[{"id": "2206204593111952", "text": "Do you recommend a bus or a train from Venice to Ravenna?", "link": "facebook.com/groups/1373361046396315/permalink/2206204593111952/", "likes": 1, "comments": [{"username": "Ed Wren", "comment_text": "Train"}, {"username": "Vivien Paulik", "comment_text": "Train of course"}, {"username": "Pierre Germain", "comment_text": "Train"}, {"username": "Russell Weidner", "comment_text": "Train"}]}, {"id": "2206205369778541", "text": "I need a private driver for pick up at airport in Rome to drive to Campobasso, one passenger.\nNot necessary to speak English.\nThanks.", "link": "facebook.com/groups/1373361046396315/permalink/2206205369778541/", "likes": 1, "comments": [{"username": "Allison Carlisle Young", "comment_text": "We used limousinrome.co\nm super quick to reply with estimates"}, {"username": "Liana Franceschini", "comment_text": "GRAZIE!!!"}, {"username": "Carmela Noble", "comment_text": "For when? Autonoleggio Isernia Zullorent does for that area. We’ve used him before and he’s great!"}, {"username": "Sherrin Wake Bracci", "comment_text": "I am glad you asked this question, as we are also going to Campobasso similar dates. My husbands family is also from there."}, {"username": "Heather Hills Jacobs", "comment_text": "Venice Group Services!!! Give them a try!!"}, {"username": "Clelia Marcantonio Vanasse", "comment_text": "We are also going to Limosano from Sorrento in September"}]}, {"id": "2206212669777811", "text": "Recommendations\nfor places to stay in sorrento. We want to visit capri, pompei and amalfi coast", "link": "facebook.com/groups/1373361046396315/permalink/2206212669777811/", "likes": 8, "comments": [{"username": "Mike Trento", "comment_text": "Hilton Sorrento palace! We loved it. Get the suite if you can. Amazingly clean"}, {"username": "Suzanne Sanderson", "comment_text": "Sorrento"}, {"username": "Ewa Kolodziej", "comment_text": "Minerva"}, {"username": "Stephanie Birchenough", "comment_text": "We stayed at a small hotel called Tasso Suites and was in the heart of everything, walked all over Sorrento, and they had a trip to Pompeii right out of our hotel."}, {"username": "Kally Trahearn", "comment_text": "Hotel Plaza."}, {"username": "Kally Trahearn", "comment_text": "Just be mindful that prices change according to the season"}, {"username": "Tamriko Chanishvili", "comment_text": "Imperial Hotel Tramontano Sorrento"}, {"username": "Nicole Gouzoules Sheehan", "comment_text": "All of the “Grands” are lovely!"}, {"username": "Tracey Aloi", "comment_text": "We stayed in apartment called Casa Scio’ on Corso Italia"}, {"username": "Sharon Heberlein", "comment_text": "We stayed at La Favorita!! It was so nice and close to shopping, restaurants, etc!!!"}, {"username": "Jono Roland", "comment_text": "Majestic Palace"}, {"username": "Geoff Roush", "comment_text": "The best place to stay for all that is Sorrento. The best place in Sorrento is Imperial Hotel Tramontano Sorrento"}, {"username": "Debbi Beston", "comment_text": "Hotel Conca Park is amazing. Eco friendly and fabulous food grown in their own gardens."}]}, {"id": "2206214159777662", "text": "Is there anyone who got a great shot of the Supermoon over Rome last night that they’d be willing to share?\n\nWe were walking all over the city enjoying the views, but my camera was completely blurry 😪\n\nI’d really to to print a good shot to remember that special evening.", "link": "facebook.com/groups/1373361046396315/permalink/2206214159777662/", "likes": 0, "comments": []}, {"id": "2206234109775667", "text": "In Florence, would it be better to stay near the train station or right near Piazza Del Duomo?", "link": "facebook.com/groups/1373361046396315/permalink/2206234109775667/", "likes": 2, "comments": [{"username": "Linda Chase", "comment_text": "I prefer to be closer to the Duomo in the heart of things"}, {"username": "Dave Colleen", "comment_text": "We stayed at Hotel Kraft, close to train station. Made getting to and from hotel, with luggage easy. No taxi needed. Walking from hotel to Duomo area was nice. Walked different ways each time to explore. It was also nice walking along the river at night."}, {"username": "Pat Cray", "comment_text": "Also stayed at the Hotel Kraft. It was lovely! Great rooftop! Easy walk or taxi ride to center city!"}, {"username": "Ty Levine", "comment_text": "You almost never want to stay near a train station in Europe. Florence. Rome. Etc. dirtier. Grittier. Not the most safe at night as homeless and pickpockets are more prevalent at night. Not as many restaurant choices etc. cheaper. Lower end hotels. That’s the general rule of thumb."}, {"username": "Eric Parks", "comment_text": "Duomo would be my preference."}, {"username": "Heath Conn", "comment_text": "Not a bad decision to be made. Both are perfect."}, {"username": "Roland Trego", "comment_text": "I haven't stayed near the train station, but several of my friends have and said it felt a bit seedy at night (as it is around nearly every train station in European cities)."}, {"username": "Shelley Bowen Glassman", "comment_text": "Kinda shady by train station."}, {"username": "Renae Larcus", "comment_text": "Stayed at Hotel Roma near train station. Still a short walk to the Duomo"}, {"username": "Fetchin Gretchen", "comment_text": "I always stay in the Oltarno as it is Quieter but still walkable from the train station."}, {"username": "Sande Ricci", "comment_text": "We stayed in a VRBO in Santa Maria Novella square. It was amazing! Close to the train and everything in walking distance. Great watching all the people in the square from our window."}, {"username": "Gayla Regitz Jones", "comment_text": "We stayed closer to Academia which was convenient to Duomo, San Lorenzo, close enough to train not far from anything really"}, {"username": "Rebecca Yeoh", "comment_text": "The beauty with Florence is that the Duomo is right near the station, and I didn’t find the station to be in a dodgy area (unlike Milan and Rome). We stayed at The Frame Hotel (in the room where the Mona Lisa was found a century ago when it was stolen from the Louvre). I recommend! It was super close to Duomo and only 5 min walk to the station."}, {"username": "Gayla Regitz Jones", "comment_text": "But if I am picking Piazza del duomo 100%"}, {"username": "Suzanne Mills", "comment_text": "Train station."}, {"username": "Barbara Bastianini", "comment_text": "I’d opt for the Duomo area.\n\nI generally avoid the train station area in all cities anywhere. In my experience stayion areas are usually not the best. They’re often marginal & run down. They seem to be frequented by petty criminals because the large number of arriving and departing tourists carrying bags make for easy pickings."}]}, {"id": "2206223263110085", "text": "Hello All, are vegetarian options besides cheese pizza easily available in Italian restaurants? Thanks in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2206223263110085/", "likes": 3, "comments": [{"username": "Alice Francesca", "comment_text": "Yes .My sister is vegetarian like many Italians and every Italian restaurant has many dishes for vegetarians.no worries"}, {"username": "Colleen Dawson", "comment_text": "The Fork is a great app to have for finding speciality restaurants. You can also use it to make reservations."}, {"username": "Maria Grazia Rizza Costanzo", "comment_text": "Absolutely"}, {"username": "Marissa McLean", "comment_text": "There’s more food in Italy than Italian food, you’ll even find some vegan and vegetarian restaurants"}, {"username": "Amy Kaye", "comment_text": "Yes, many!"}, {"username": "Nadia Mckenna", "comment_text": "Yes! Wonderful vegetarian food"}, {"username": "Bing Robertson", "comment_text": "Obviously don't eat parmesan, happy cow show work"}, {"username": "Gianluca Rivizzigno", "comment_text": "Most italian food is made with fresh, seasonal vegetables. Right now there's a lot of eggplants, tomatoes, zucchini blossoms to name few."}, {"username": "Sue Sherwood", "comment_text": "Almost everything can be meat free...."}, {"username": "Karol Sabat Hoffman", "comment_text": "Caponata, Parmigiana, vegetale alla griglia, pasta with porcini mushrooms or truffle, salads,Pasta a la Norma, patate al forno, risotto (al the variations with no meat), polenta with out meat, vegetables fritattas, minestrone. Believe me you can find a lot of options everywhere or ask for something vegetarian! The “contorno” are always vegetables!"}, {"username": "Jenny RV", "comment_text": "Yes lots of salads, pasta dishes, roasted vegetables and vegetarian deserts are available"}, {"username": "Durga Gorantla", "comment_text": "Thank you all for the wonderful replies. I’m excited to try all the wide variety. Some countries I travelled to had very limited vegetarian options, so just being curious."}, {"username": "David Horgen", "comment_text": "I'm here right now. We are eating out at restaurants a lot. You can get anything here. We are in Rome at the moment."}, {"username": "Anthony Martini Jr.", "comment_text": "Absolutely, I'd say 100% are vegetarian"}, {"username": "Patrizia D'Arcangelo", "comment_text": "We Italians eat a lot of vegetables. Rest assured that you will find vegetables in every restaurant. we are famous for pizza but we don't actually eat it often (at most once a week)"}, {"username": "Barbara Bastianini", "comment_text": "There will be plenty of vegetarian options. You don’t be limited to pizza."}, {"username": "Bonnie Loftspring", "comment_text": "Many eggplant dishes"}, {"username": "Jun Cee", "comment_text": "a margherita is vegetarian. that token single basil leaf proves it."}, {"username": "Irene Oda", "comment_text": "The majority of Italian pizza toppings are vegetarian or vegan."}, {"username": "Trish Heymer", "comment_text": "I’m pretty sure that cheese is not plant based. 😂"}, {"username": "Jan Armstrong", "comment_text": "I ate amazing pesto rigatoni in a Tonnarello in Rome. Fantastic olive oil and pepper pasta with cheese grated on top, infact barely ate any meat at all"}, {"username": "Lauren Vassallo Beattie", "comment_text": "Pizza marinara"}, {"username": "Lauren Vassallo Beattie", "comment_text": "Pizza marinara, lots of places do vegan or veggi pizza."}, {"username": "Lee Greaves", "comment_text": "Just come back last night and every restaurant we ate in had a page on the menu for vegetarian and also vegan items. They're also really hot on the allergens too and usually have all these listed as well."}, {"username": "Carolyn Schwab", "comment_text": "Yes! I've been going since 1987, never had a problem"}, {"username": "Corinne Roberts", "comment_text": "I had an easier time finding vegetarian options in Italy than in North America."}, {"username": "Suzanne Mills", "comment_text": "Pasta. Gnocchi."}]}, {"id": "2206240269775051", "text": "I am trying to purchase Vatican tickets for September 1, 2023. It says tickets are \"not bookable\" but other ticket packages say \"sold out\". Will admission tickets go on sale at a different time or does \"not bookable\" mean sold out?", "link": "facebook.com/groups/1373361046396315/permalink/2206240269775051/", "likes": 0, "comments": []}, {"id": "2206240996441645", "text": "Booking some tours in Venice for St. Marks Basilica and Doges Palace for sept, any recommendations on tour companies, hoping for a more local company vs the big sellers like viator, etc. Has anyone used Viator and had a pleasant experience?", "link": "facebook.com/groups/1373361046396315/permalink/2206240996441645/", "likes": 1, "comments": [{"username": "Carolyn Hall Raffo", "comment_text": "We just used Viator for most of our tours in Italy 🇮🇹"}, {"username": "Billie Begley", "comment_text": "We always use walks of Italy. Great small group tours. For St Marks look into their after hours evening tours. It is the only tour where they put on all lights inside. Beautiful."}, {"username": "Billie Begley", "comment_text": "Billie Begley"}, {"username": "Billie Begley", "comment_text": "For a walking tour of Venice Call Mark. See Italy tours. Great tour of The Jewish Ghetto. Lots of hidden gems"}, {"username": "Oldriska Balouskova", "comment_text": "Viator is simply a selling platform for many different companies- anyone can be on it - thus other people’s experience will not tell you much - they would need to describe a specific company they used"}, {"username": "Jim Bobrowski", "comment_text": "Honestly St. Marks you can do with Rick Steve's audio guide or just get the audio guide there for 5 eu per person. It's really not that big. We got the audio guide at doges palace. There's other places I would splurge on a full tour. But to each there own."}]}, {"id": "2206242849774793", "text": "Does anyone know if the golf cart tours are still running for Rome? I had read a few posts awhile back that they were canceling some. TIA 😊", "link": "facebook.com/groups/1373361046396315/permalink/2206242849774793/", "likes": 0, "comments": []}, {"id": "2206019403130471", "text": "Explore the gorgeous hilltown of San Gimignano in Tuscany! This amazing town was declared world heritage site by UNESCO and walking around through its narrow streets and admiring the beautiful views will giveआणखी you the possibility to feel in Medieval times.\nJoin us: https://nextstop-italy.com/virtual-tours/san-gimignano/\n\n#italygram #history #virtualworld #italyiloveyou #italytrip #vacationmood #art #italytravel #VirtualTour #florenceitaly #tuscany #medievalart #tuscanytrail #renaissanceart #medieval #medievalart #medievaltimes #medievalworld #medievalcastle #medievalhistory #medievalarchitecture #sangimignano #sangimignanoitaly #sangimignanotuscany #sangimmy #tuscanygram #tuscanyexperience", "link": "facebook.com/groups/1373361046396315/permalink/2206019403130471/", "likes": 43, "comments": [{"username": "Inge Bemelmans", "comment_text": "Nancy Bemelmans 😍"}, {"username": "Rita Levi Montalbano", "comment_text": "Dont want to be rude but most of the villages in tuscany looks like that, search for example Suvereto, Gavorrano, Anciolina, Chiusdino but also the big Siena! Please if you come to tuscany consider also different places than San Galgano where everyone goes"}, {"username": "Marie-Josée Mercier", "comment_text": "Christine Bolduc 😍"}]}, {"id": "2205932149805863", "text": "We have a last minute change to our plans are we are now spending the evening in Naples. We have nothing planned and only tonight here. We are leaving in the am.\nWhere should we go to eat/walk around tonight? Maybe with a few little shops. We have teenagers/kids with us as well.", "link": "facebook.com/groups/1373361046396315/permalink/2205932149805863/", "likes": 1, "comments": [{"username": "Rhona OConnor", "comment_text": "Just head into town and walk around and feel the atmosphere... You will find interesting things. Look for a restaurant with Italians in it, usually one with no English on the menu. ..... They have the best food 😉"}, {"username": "Karl Wilder", "comment_text": "Head to the municipal station and walk up hill. There is a wonderful rabbit, warren, small streets, with some great eateries."}, {"username": "Alice Francesca", "comment_text": "Stick around via Toledo and Piazza del Plebescito, from there walk along the seaside around Castel dell'Uovo"}, {"username": "Ann Heffern O'Connell", "comment_text": "I’m doing a night in Naples just to do a pizza tour. Also the national museum is supposed to be one of the best!"}]}, {"id": "2205908666474878", "text": "I'm going to Italy for a two-week trip mid to end of September, starting in Rome and ending in Venice. What's the weather like in those regions, mainly the temperature? Trying to figure out what type of clothes to pack.", "link": "facebook.com/groups/1373361046396315/permalink/2205908666474878/", "likes": 1, "comments": [{"username": "Heidi Littman Meiers", "comment_text": "following, trying to organize now, leave in 3 weeks, seems like it WAS super hot but now more moderate and could actually get cool at night, whats a girl to do !"}, {"username": "Madeline Caporale", "comment_text": "Check the AccuWeather site for historical temps. Most likely it is still going to be on the warmer side (mid 70s to 80s), with lows in the 60s. You are still going to want to pack for warmer temps, though maybe muted colors, light outer layers and perhaps an option for rain."}, {"username": "Danielle Wood", "comment_text": "I went to Rome the first weekend in October 2022 and was mid 20’s, so pleasantly warm. Jacket at the evening time but in the day was really warm in tshirt and trousers"}]}, {"id": "2205910086474736", "text": "If I only have time to visit either Murano OR Burano during my time in Venice, which is more highly recommended? I’m interested in seeing both of them but unfortunately on this trip I’ll only have half a day to devote to a side trip so want to choose just one.", "link": "facebook.com/groups/1373361046396315/permalink/2205910086474736/", "likes": 17, "comments": [{"username": "Nicole Amico Boeckel", "comment_text": "Definitely burano"}, {"username": "Crystal Waltz", "comment_text": "Crystal Waltz"}, {"username": "Deborah Schroeder", "comment_text": "Burano. You will go past one to get to the other so you can make a choice."}, {"username": "Ruth Mattingly", "comment_text": "Burano if you want the prettiest photos! If you want glass, Murano."}, {"username": "Marietta Canalizo", "comment_text": "If you want beautiful glass go to Murano."}, {"username": "Mary Ann Conover", "comment_text": "Loved Burano much more. The colors are fascinating."}, {"username": "Christine Ann", "comment_text": "You can do both in a half day. That’s what we did two weeks ago. Amazing!"}, {"username": "Loretta Coccodrilli", "comment_text": "One is better then none."}, {"username": "Suzanne Mills", "comment_text": "Murano"}, {"username": "Pat Cray", "comment_text": "Burano"}, {"username": "Melissa De La Cruz", "comment_text": "Burano for sure!! If you can, have lunch outside there"}, {"username": "Fetchin Gretchen", "comment_text": "There is a 6 hour day trip by boat to Murano, Burano and Tocello with glassblowing for about €40 via Get Your Guide app. Do that."}, {"username": "Melissa Jane Brown", "comment_text": "Burano"}, {"username": "Denise Calvert", "comment_text": "We preferred Burano. We did the tour of Murano factory and hopped on the local Vaporetto and enjoyed wandering through Burano. We tried to get in the Black Cat (Trattoria Al Gatto Nero) for lunch, but without a reservation, it was impossible."}, {"username": "Dolly Cote", "comment_text": "Burano"}, {"username": "Kathryn Hawkenberry", "comment_text": "I just went to Venice last week and did Burano and Murano in a half day tour for €45! It wasn’t rushed and we had more time in Burano which seems to be the more popular island based on these comments. It was a 5 hour tour and we had a viewing of the glass factory with a discount at the glass store afterwards. Same thing with the lace in Burano!! Definitely look into a tour to both islands! It’s doable, not rushed, and a perfect amount of time."}, {"username": "Domenica Calvene", "comment_text": "Glass blowing or colourful houses?\nWe did half day tour started at 9.30 back by 2.30pm booked day before."}, {"username": "Janet Farrell", "comment_text": "Wish I could have done Burano....next time"}, {"username": "Jackie Flores", "comment_text": "You don’t need to do a tour, just take the ferry and you can easily do both islands in half day"}, {"username": "Debbie Milne Jenkins", "comment_text": "The 1/2 day tour of both should be quite doable but if I had to only see one it would be Burano."}, {"username": "Sandra Kingsley", "comment_text": "Just do the boat tour that does both, you see the glass blowing in Murano then go on to Burano"}, {"username": "Lillian Angel", "comment_text": "Мurano has more to offer , definitely ! A visit to a glass factory. A nice walk along the channel and many picturesque shops and cafes ."}, {"username": "Dayna Scinto", "comment_text": "Burano, in my opinion it’s unlike anywhere else with the beautiful colours. Lots of food options also."}, {"username": "Sara Gilardi", "comment_text": "Maybe Murano if you are fond of glass, Burano if you are fond of lace."}, {"username": "Robin Lee Simmons", "comment_text": "I would definitely do Burano💙💚💛"}, {"username": "Barb MacKenzie", "comment_text": "Burano"}, {"username": "Susan Cantafio", "comment_text": "Burano"}, {"username": "Alison de Lisle", "comment_text": "We had exactly the same decision to make 4 days ago when we were in Venice. If you only have a few hours and you’re interested in glass go to Murano. It’s much closer and quicker, 20 mins in the ferry. If you go to Burano it’s for lace not glass and an hour to get there."}, {"username": "Miyuki Kanno Paul", "comment_text": "If you want to see glass artwork, go to Murano. If you prefer handmade lace products, go to Burano"}, {"username": "Becky Robertson", "comment_text": "We preferred the more relaxed pace of Burano 😊"}, {"username": "Dafne Vassetti", "comment_text": "Just Burano ;)"}, {"username": "Alicia Cox", "comment_text": "Burano! Very picturesque!"}, {"username": "Mary Gregory", "comment_text": "I loved Burano 💕. Nice place to shop and have lunch"}, {"username": "Shirley Lewis", "comment_text": "Burano! Murano is for buying glass"}, {"username": "Taylor DiBaise", "comment_text": "Burano for sure! Murano is great as well but I wish we would've spent more time in Burano."}, {"username": "Gena Diaco Penland", "comment_text": "Burano!!! We would have loved to spend more time there"}, {"username": "Madeline Caporale", "comment_text": "Depends to some extent in which craft product you are most interested in - Murano will feature glass-you can purchase anything from beads and jewelry to chandeliers and everything in between, plus you can visit the glass factories. Burano will feature lace work. Both are worthy of a visit."}, {"username": "Kay Matthews", "comment_text": "Burano"}, {"username": "Karen Blackmore", "comment_text": "Burano is lovely, less busy the further you walk. Longer boat trip."}, {"username": "Karen Blackmore", "comment_text": "Murano, alot closer than Burano. Great if you like glass, we went to a glass factory which was fascinating!"}, {"username": "Desiree Leyden Kuhnlein", "comment_text": "Absolutely burano❤️❤️❤️"}, {"username": "Carly Mathes", "comment_text": "Thanks everyone! I’m going to go with Burano. I’ll be back to visit Italy again and will do Murano next time"}, {"username": "Veronica Solimando-Lynch", "comment_text": "Burano. More interesting."}, {"username": "Gwen Cooke", "comment_text": "Burano !!"}, {"username": "Terri Bradford", "comment_text": "What’s the easiest way to get to either place?"}, {"username": "Eileen Muro", "comment_text": "Burano is beautiful. We took a half day trip from Venice to Murano and Burano. We used the public transportation water bus...or whatever it's called...lol"}, {"username": "Dawn Falsinotti", "comment_text": "Glass or Lace?"}, {"username": "Gianna Onesi", "comment_text": "Have been to Murano great trip and shops to see how glass is made."}, {"username": "Elena Innocenti", "comment_text": "I like Burano"}, {"username": "Marsha Katz", "comment_text": "Burano"}, {"username": "Odile Mainet-maillard", "comment_text": "Burano !!!"}, {"username": "Laura McLaughlin", "comment_text": "There is a half day trip to both"}, {"username": "Pat Hojnowski", "comment_text": "Both are good places to explore. Burano is my first choice."}, {"username": "Aiga Doma", "comment_text": "Burano, beautiful😍"}, {"username": "Jack Partington", "comment_text": "In our opinion, we've been to both, and would pass on seeing either again, and spend that time discovering all that Venice has to offer."}, {"username": "Lucrezia Folger", "comment_text": "Burano, beautiful multi colored buildings."}, {"username": "Crystal Waltz", "comment_text": "We didn't go to Murano, but I fell in love with Burano!! We also absolutely loved Torcello!!"}]}, {"id": "2205911486474596", "text": "Going to Courmayeur in February, any good places to see. I won't be skiing, so how is the shopping?", "link": "facebook.com/groups/1373361046396315/permalink/2205911486474596/", "likes": 1, "comments": [{"username": "Alice Francesca", "comment_text": "I don't ski either, but enjoy taking long walks in the Val Ferret.\nAlso don't miss Skyway Monte Bianco!(google it)"}]}, {"id": "2205911529807925", "text": "Hi is there a app that I can get good last minute deal on train rides?", "link": "facebook.com/groups/1373361046396315/permalink/2205911529807925/", "likes": 4, "comments": [{"username": "Chris N Lynn", "comment_text": "Trenitalia will show any fares still available for discount."}, {"username": "Ibbu Mohd", "comment_text": "Italo app"}, {"username": "Enrico Lecce", "comment_text": "You can get deals if you go online to the direct train rail services..."}, {"username": "Fiona Mac", "comment_text": "Omio"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2205912389807839", "text": "Best area to stay on Lake Garda in the beginning of October ?", "link": "facebook.com/groups/1373361046396315/permalink/2205912389807839/", "likes": 0, "comments": [{"username": "Alice Francesca", "comment_text": "The weather can be sunny but a little chilly and humid at night.\nI would stay on the Southern side , up to Salò. Beware many ferries will not be in service anymore .So you should rent a car or use buses to go explore."}, {"username": "Maria Fefelova", "comment_text": "Limone Sul Garda 😍"}, {"username": "Beata Zabek", "comment_text": "Limone was beautiful"}, {"username": "Barb Mason O'Connor", "comment_text": "Sirmione"}, {"username": "Shane Macdonald", "comment_text": "If u want to explore by boat, I’d recommend u stay somewhere around the middle of the lake. Like that u can explore the north and south of the lake and it will not take too much time of the day. If u stay down south in somewhere like peschiera del garda and want to see limone sul garda, it will take over 2hrs to get there by boat and 2hrs back. Not economical for time. Stay around the middle and one day u can explore the north and another u can explore the south"}, {"username": "Herbert Maritschnik", "comment_text": "Bardolino"}]}, {"id": "2205917449807333", "text": "Is it fairly easy to drive from Florence to Lake Como???\n\nFor context, I’m trying to piece together the last leg of our honeymoon late September. We will be leaving our 4 night stay in Florence and going to Menaggio on Lake Como for our last 3 nights, then flying home out of Milan, 4 pm flight so plenty of time to get there from Menaggio that day.\n\nIn piecing together the routes, it looks like I have a few options -\n\n1. Train Florence to Milan, Milan to Varenna, then Ferry to Menaggio\n\n2. Train Florence to Milan, Milan to Como, then Ferry or Bus to Menaggio\n\n3. Pick up rental car at Florence airport, drive there (free parking at our hotel) and use it to get us to MXP when flying out our last day.\n\nI know the trains are typically the way to go, and if we were staying in Varenna, I would have done this no doubt. But after pieceing all of the legs together, due to train and ferry or bus times, the first two options will take us about 7 hours, and that’s if everything leaves on time. I’ve heard trains can be delayed often and if so that would put us back another hour or two.\n\nI like the idea of just getting in a car (I’ve read picking up at the airport is the way to go) and having it as an option to get us to MXP on our way back. Maybe stopping in Bologna for lunch on the way or somewhere else? The drive time looks like about 4 hours versus 7+ with public transport.\n\nI’ve driven in Portugal with no issues. This would be the only portion of our trip with a car. Looking for some reassurance it would be fairly “easy”? We’d likely pick up in Florence first thing in the morning.", "link": "facebook.com/groups/1373361046396315/permalink/2205917449807333/", "likes": 1, "comments": [{"username": "Jen Ashley", "comment_text": "I lived in Florence this summer. I rented a car to\ngo to The Dolomites. I actually rented through Avis and picked it up in the city so I didn’t have to truck out to the airport, but returned it to the airport.\n1. Get your international drivers license - 20-30 at any AAA in the US.\n2. Always get your ticket when getting in the autostrada. Make sure to go in the lanes marked to pay with card when exiting (not the yellow telepass lane) .\nI found it very easy, fun, beautiful to drive through Tuscany. There are many towns to get off to grab lunch. Just know ahead if you are going somewhere with a ZTL and park outside it and bus or train in if needed. Small towns don’t have them frequently."}, {"username": "Pietro Adami", "comment_text": "Option 3, definitely."}, {"username": "Sylvie Hogg Murphy", "comment_text": "Yes, really easy to drive in this part of Italy. The highways are straightforward\nand the smaller roads all well marked. If you’ve driven in Portugal you’ll find it similar (except in Italy people generally drive faster and those German cars on the autostrada will crawl up right on your bumper and want you to get over if you’re not doing 140km/h. 😂 ) Parking could be annoying for that lunch stop in Bologna but as long as you’re not trying to enter the very core of the historic part of the city, it’s doable. Go for it!"}, {"username": "Veronica Parravicini", "comment_text": "It’s definitely easy, in Italy we say “è tutta autostrada!!” (Meaning “it’s all highway” = it’s easy, fast, straight).\nThe “difficult” part will be driving around lake Como as the streets are small and parking is a nightmare.\nDo you have a parking lot at your hotel in menaggio?\nAlso consider traffic around Milan/Lombardy in general (add 30 mins to 1hr)"}, {"username": "Donna Gilardone Szwabowski", "comment_text": "It’s a lot of beautiful driving, I would get a car. You could go through Bologna, Modena, Piacenza, Parma, then from Como could venture into Switzerland, just make sure you get the Swiss sticker for your car"}, {"username": "Trevor Brown", "comment_text": "I think you have answered your own question but if was me I would take option 1."}]}, {"id": "2205920903140321", "text": "sorry to ask again, someone posted about buying a SIM card from Amazon for use in Europe but I now can't find the thread ... any info on doing that? I've always bought one after I arrive but having it before hand would be great!", "link": "facebook.com/groups/1373361046396315/permalink/2205920903140321/", "likes": 3, "comments": [{"username": "Teresa Moore Livingston", "comment_text": "Click on the theee dots at the top right when in the FB of “Discover Italy” and then search for SIM card."}, {"username": "Sunny Lang Fan", "comment_text": "These two is what I remember and had save in my Amazon cart for future needs but you would get the GB that you need for your trip"}, {"username": "Desiree Leyden Kuhnlein", "comment_text": "I used an orange card bought on amazon"}, {"username": "Dixie Kotylak", "comment_text": "I bought one from Amazon, it worked great, didn’t even use up the whole thing! I will definitely go that route again! 👌🏻"}, {"username": "Paulette Otano", "comment_text": "Where do you buy it when you get to Italy?"}, {"username": "Gianna Onesi", "comment_text": "Airalo"}, {"username": "Don Bussolari", "comment_text": "Are you looking for a removable SIM or eSIM.?"}, {"username": "Em Hillary", "comment_text": "What is a SIM card ? And how is it different from calling Verizon? Sorry I’m new to this :("}, {"username": "Don Bussolari", "comment_text": "A SIM whether it's a hard SIM or eSIM has your phone # your carrier info and gets you connected to the net. Simply put."}, {"username": "Rip Lonergan", "comment_text": "I always buy this card from orange thru Amazon and it works beautifully. Just change Sim cards on your flight and when you arrive you will be in business."}, {"username": "Heather Kearney", "comment_text": "Orange SIM"}, {"username": "Leisa Davis", "comment_text": "I would recommend investigating an esim.\nNo need to swap over SIM cards and you can retain your phone number.\nImportant if you’ve made independent bookings and the supplier needs to contact you."}, {"username": "Jennifer Nguyen", "comment_text": "Orange Travel\n\nhttps://\ntravel.orange.co\nm/en/"}, {"username": "Lori Sammons", "comment_text": "If you have sprint now T-Mobile no need for SIM card, I’m here currently in Florence and everywhere we travel (two months ago in Germany, Switzerland, Amsterdam) we didn’t needs SIM card just put your phone on Roaming and we got internet access everywhere. We drove too so we rely on GPS on our phone. T-Mobile has unlimited data."}, {"username": "Michelle Murphy Margolati", "comment_text": "Is there a reason to buy a sim card versus paying the extra $10. For international calling on your plan?"}]}, {"id": "2205925119806566", "text": "Recommendations for hostels in Florence?", "link": "facebook.com/groups/1373361046396315/permalink/2205925119806566/", "likes": 0, "comments": [{"username": "Dafne Vassetti", "comment_text": "Plus Hostel"}]}, {"id": "2205941316471613", "text": "First time to Italy for my wife and I … another couple will join us…. Staying three weeks… not sure on the Tuscany part of the stay:\n\nAny comments on wine tours, foodie stuff and accommodations would also be appreciated\nThx!", "link": "facebook.com/groups/1373361046396315/permalink/2205941316471613/", "likes": 4, "comments": [{"username": "Jennifer Gustafson", "comment_text": "We loved walking around Florence more after dinner and night. We stayed in Florence and did day trips out! San Gimignano was wonderful!"}, {"username": "Shannon Confortin", "comment_text": "We are on our last night in. Florence. Spent 5 nights. Toured around Florence all the days but 1. Rented a car and went to San Gimignano, Pisa and Lucca. We loved San Gimignano and would love to spend a couple of nights there. Spent 45 min in Pisa and that was enough. Lucca was nice as well"}, {"username": "Danielle Withrow", "comment_text": "I stayed in Florence and took day trips out. You can do small tours to the small Tuscan hill towns that also include wineries. OR you can opt for a short train trip. For train trips - head for towns that are direct (no transfer) like Lucca, and also where the train goes into the historic district. For many small towns the train station is down the hill and out of the center of town. I'll recommend one day-long trip I took - \"Cooking with Luca and Lorenzo\". They meet you at the train station in Florence for a short 20 minute ride to a small town and their villa up on the hillside. We made two kinds of pasta, two sauces, and tiramisu. Then they take you back to the train station about 3:30. Lots of fun. (lovexfood.com)"}, {"username": "Roland Trego", "comment_text": "Two nights in Florence and three nights in the countryside, preferably with a car rental."}, {"username": "Alice Francesca", "comment_text": "https://\nwww.discovertusc\nany.com/\nvaldorcia/"}, {"username": "Lise Lotte Winther-Bay", "comment_text": "Frescobaldi Ammiraglia - is the perfect vineyard to visit in Tuscany. We went there last Monday. Beautiful surroundings, great history, delicious food together with excellent wine.\nOne of our favorite beach places, Tuscany Bay in Orbetello. Nice bare and an excellent restaurant by the water. The city of Orbetello is charming. Lots of nice restaurants/\ncafes - enjoy the aperitivi. Have a great trip🌸"}, {"username": "Chiara Alioto", "comment_text": "Countryside for sure. Visit winery’s and smaller towns and just visit Florence for a day. We stayed at Borgo San Luigi in Monteriggioni and it was beautiful, they have 2 restaurants right there. Lots of wineries nearby."}, {"username": "Russell Weidner", "comment_text": "Consider a day to Lamole and surrounding area. Look at spending a night or two at Tenuta di Ricavo"}, {"username": "Nancy Kirby", "comment_text": "For 3 weeks Id def do a few days actually in city. Evenings there are wonderful and you miss it if you leave the city w the day tour groups"}, {"username": "Barbara Bastianini", "comment_text": "Everybody’s different but in my opinion Florence is just not a day trip city. In fact, on my first trip to Italy I spent a whole week in Florence. And we enjoyed every minute of that time. There’s such an abundance of things to see and do there, and it’s so wonderful at night that you can never experience it fully on day trips, no matter how many you take. Many small Tuscan towns, though, can be visited on a day trip or even a half day. Wineries included.\n\nAnother problem with staying in the country might be transiting to other places. You can most probably get back and forth to Florence easily by train from\nthe countryside or from small villages, but lots of small or more remote locations aren’t well connected to each other by train so it’s not always easy to go from village to village or vineyard to vineyard Florence is a hub so the access to other places is just better. Of course, if you plan to rent a car it’s easy enough to drive yourself from one small destination to another so transportation wouldn’t be as much of a drawback to staying in the countryside.\n\nWith 5 nights I myself would spend three nights in Florence then rent a car to meander the countryside & the smaller villages for two days."}, {"username": "Lushan Yao", "comment_text": "I would definitely stay in Florence."}, {"username": "Lori Wroblewski", "comment_text": "We did a pasta cooking class! It was amazing!"}, {"username": "Grg Cozzetto Oetterer Mra", "comment_text": "Depends\nWith car: countryside;\nWithout car: Florence"}]}, {"id": "2205973566468388", "text": "BEST WAY TO BRING CERAMICS HOME\n\nWe are flying home from Italy and have bought quite a few ceramics! Has anyone tried to take these on carry on and did you have any issues?\n\nWe are flying Emirates and the rules are not clear. Based on what we have researched generally it should be okay but it is upto the officers discretion (with regard to if thereआणखी are sharp edges etc).\n\nIn the contrary, has anyone packed ceramics in their main bag and were they ok? We have seen the way bags are thrown around 😂.\n\nAny extra tips on packing them would be greatly appreciated! We have already bubble wrapped and packed them around out main clothes, etc.", "link": "facebook.com/groups/1373361046396315/permalink/2205973566468388/", "likes": 2, "comments": [{"username": "Alessandro Iannelli", "comment_text": "it seems to me that you have done all you can to protect them from breaking and if it's (as i assume it is) a cabin bag, i don't see any reason why it should be a problem to bring them with you (a carry on luggage could in theory pose a probkem, an overzealous officer could consider them potential weapon). anyways, i would place them right in the middle of the luggage, that should avoid bad surprises should it fall, but i'm sure you have already thought of that."}, {"username": "Miyuki Kanno Paul", "comment_text": "I often place my ceramics in my carry on rollerboard suitcase. The stores usually wrap them in bubble wrap (often double) when you specifically mentioned it. I use my clothing(both used and unused) and spare shoes to insulate. It applies to my checked suitcase as well. I use hotel’s toilet paper rolls for extra cushions if necessary"}, {"username": "Celia Minnucci", "comment_text": "Thank you so much!! We have packed them very tightly on bubble wrap and now amongst clothes, zipped it up tight with no room to move! We have decided to try the checked in luggage rather than carry on!! We have tried these ideas so thank you so much!!"}, {"username": "AP Min", "comment_text": "Some break. Some Don't. That's why you always buy twice as many as you actually need. And that's what you've already done! Cannot wait to see your treasures! 😉❤️"}, {"username": "Celia Minnucci", "comment_text": "Thank you all, they made it. No issues at all. Was able to use a box from the perculator and wrap all the cups in bubble wrap, in the box, around clothes (packed it all very tight). Also took some in carry on and it was not questioned at all. Thank you!!"}]}, {"id": "2205982349800843", "text": "Is there a good public beach’s in portofino", "link": "facebook.com/groups/1373361046396315/permalink/2205982349800843/", "likes": 2, "comments": []}, {"id": "2205974359801642", "text": "Hello!\nNeed recommendations for hotels in Milan.\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2205974359801642/", "likes": 0, "comments": [{"username": "Mat PO", "comment_text": "Portrait or Park Hyatt."}, {"username": "Graham Hyde", "comment_text": "Maison Borrela"}, {"username": "Maria Y Alexieva", "comment_text": "The Street Milano Duomo | a Design Boutique Hotel\n+39 02 3676 5691\n\nhttps://g.co/\nkgs/p8R6nX"}, {"username": "Lara Grom", "comment_text": "Rosa grande Sheraton Diana"}, {"username": "Lara Grom", "comment_text": "Mandarin"}, {"username": "Maria Milioto", "comment_text": "We will be staying at Le Grand Duca di York. Looks beautiful!"}]}, {"id": "2205975633134848", "text": "How far out does everyone recommend booking hotels/airbnbs? We plan on going in May of 2025 for our honeymoon and just curious when we should start planning.", "link": "facebook.com/groups/1373361046396315/permalink/2205975633134848/", "likes": 5, "comments": [{"username": "Gregg Pires", "comment_text": "We booked our airbnb's 8 months out and we're offered an early bird discount."}, {"username": "Alexandra A Welker", "comment_text": "About 6-8mons. If I find something better it's easy to cancel and rebook."}, {"username": "Jean Williams Bryan", "comment_text": "If you book airbnb ask them what floor and if they have a lift, or make sure you pack light. 😆"}, {"username": "Carly Mathes", "comment_text": "I booked all of my hotels in April for my trip in November and was offered early bird discount pricing. I’ve since looked to see prices now that it’s about 4 months out and they’ve gone up by 30-50€ per night"}, {"username": "Carrie Duffy VanderMolen", "comment_text": "8 mos. We always book airbnb's. It's amazing how much more inventory is out there when you book early..."}, {"username": "Casarine Temple", "comment_text": "I booked 10 months out"}, {"username": "Jill Nolan Morris", "comment_text": "I booked about a year out"}, {"username": "Nicole D'Amico", "comment_text": "We will probably book 10/11 months out. We are going September of 2024 and we are booking our flights as soon as they are released and then we will book hotels."}, {"username": "Fetchin Gretchen", "comment_text": "Short stays most hosts will not book too far out so it varies by host. Also hotels have their own calendars as to how far in advance to book. So fund where you want to stay, then ask."}, {"username": "Carol Taylor Tisdale", "comment_text": "A year if they will. If something like Booking.com shows all booked up, contact hotel directly. It’s possible they haven’t released those dates yet but likely will book you themselves."}, {"username": "Gillian O'Callaghan", "comment_text": "I went in May this year and booked about 7 months out. Had no difficulties."}, {"username": "Shani Jackman", "comment_text": "Dates for accommodation are only 11-12 months in advance on airbnb ... but get in early"}, {"username": "Maureen King", "comment_text": "We are slated for September 2024\n\nI only booked my cruise\n\nI have my 3 top hotels that have to wait\n\nAirlines waiting\n\nAlot of tours waiting\n\nCar hires waiting\n\nYes 399 long days until Rome Greece Turkey trip lol"}, {"username": "Sierra Behrens Tibbetts", "comment_text": "We will be there July 2024 and just booked three VRBOs."}, {"username": "Donna Watson", "comment_text": "I had most of our bookings complete in Dec for our May/June trip this year"}, {"username": "Suzanne Sullivan", "comment_text": "Plenty of time"}, {"username": "Deborah Schroeder", "comment_text": "As soon as I book air I book hotels. Just make sure of the cancellation policy."}]}, {"id": "2205984549800623", "text": "Hello everyone !\nI am a new member of this group because my boyfriend and i , want to visit Puglia for the first time in septembre 2024!\nLast may, we went to Florence, Rome, Sorrento and Tuscany and it wasआणखी love at first sight!!! 😍😍😍\nA friend of mine just told me that she did'nt enjoy Puglia, specially Monopoli because she find it dirty and Bari cause it is ordinary... We were disapointed to ear that!\nSo here i am , looking for your opinions!\nWhy should we visit Puglia? And what is it that blowed your mind and your soul?\nThanks in advance for your good advice!!", "link": "facebook.com/groups/1373361046396315/permalink/2205984549800623/", "likes": 166, "comments": [{"username": "Rhona OConnor", "comment_text": "Rhona OConnor"}, {"username": "Rhona OConnor", "comment_text": "Rhona OConnor"}, {"username": "Sam Gamlin", "comment_text": "Sharie Dee"}, {"username": "Lisa Luongo", "comment_text": "I will be heading to Italy mid August; first to Amalfi Coast; then Matera and Puglia. Been to Amalfi Coast several times but cannot wait to explore Matera, Lecce, Monopoli and then Bari."}, {"username": "Amy Keith Barney", "comment_text": "Jesse Barney"}, {"username": "Ружа Рафаел Асланян", "comment_text": "В Италия всяко кътче си заслужава!\nТака казват и за Неапол-нищо подобно-очарова\nтелен град!"}, {"username": "Joy DePippo Theos", "comment_text": "Elizabeth Dion"}, {"username": "Luisa Stola", "comment_text": "I would also suggest to visit north of Puglia, the Gargano with beautiful beachs and towns on the Adriatic Sea. Not to mention that is also easier traveling by bus or trains to any town."}, {"username": "Sally Bisping", "comment_text": "Jus stayed in Bari & Monopoli-both beautiful. Not sure what your friend is meaning?? Also Alberobello and Poglinio Mare"}, {"username": "Engelien Muller", "comment_text": "Puglia is beautiful to visit."}, {"username": "Dorte Bjerregaard", "comment_text": "Pogliano a Mare og Monopoli besøgte vi sidste sommer august/sept) - 4 dage hvert sted. Vi nød det i fulde drag, det var roligt, smukt og mad og vin var fantastisk. Fløj til Bari og kørte i tog mellem byerne. Og så kan Alberobello også noget, bare en enkelt dag (eller en halv)."}, {"username": "Sharyn Jane Faulkner", "comment_text": "We are about to leave Italy after three months and we are from NZ we loved Puglia 🙏❤️🇮🇹one of our favourites!! Not dirty at all it was gorgeous\nMonopoli was our base for 5 nights in the centre\nWe had a car and visited Polignano a mare by train\nAlberobello, Ostuni and Matera by car\nLoved them all absolutely fabulous! Ignore the advice re dirty we didn’t see it 🥰"}, {"username": "Vilma Jucikaite", "comment_text": "I was visiting Puglia this June and I really enjoyed it🥰. We stayed 4 nights in Bari and visited all these famous places: Alborabello, Matera, Polignano o Mare, Ostuni. Then we headed to Amalfi Coast for another 4 nights, but it was much more crowded with tourists comparing with Puglia."}, {"username": "Cheryl Colborn Armstrong", "comment_text": "We loved Bari. That side was wonderful. We would definitely go again."}, {"username": "Amanda Carter", "comment_text": "Been visiting this amazing area for 15 years and chose it to celebrate a ‘big’ birthday with 20 friends joining us last year.\nSuggest you fly into Brindisi. Hire a car and base yourself in the Salento area, during which you can cover many of the places of interest already mentioned incl Polignano, Cisternino & Ostuni etc plus travel south to Lecce & Gallipoli . Then travel north from Brindisi to the Gargano peninsula and Peschici\nDon’t miss #altrabuccodimim\ni restaurant …\nfinally return your car to Bari with a stop on the way back."}, {"username": "Ilona Bēliņa", "comment_text": "Puglia is amaizing! 😍\nHave been there 4 times and would definately go again! Polignano Mare, Mola di Bari, Sant Andrea, Otranto, Matera - such a beautiful places with amaizing people."}, {"username": "Heidi Kristin Rondestvedt", "comment_text": "Has anyone taken the train between the towns i this area? Or is car better?"}, {"username": "Diana Devlin", "comment_text": "We enjoyed the old town of Trani, it’s castle and also a visit to Castel del Monte not far from Trani."}, {"username": "Diana Devlin", "comment_text": "Matera is worth a side trip- absolutely amazing."}, {"username": "Elena Plamadeala", "comment_text": "I've been there 2 times, 12 days each time. And I would not agree. In the end, one finds what is looking for. You can find dirty places everywhere you go, if you are only focused on that. There are super lovely places in Puglia, we visited: Ostuni, Alberobello, Polignano a Mare, Otranto, Lecce, Gallipoli and Matera on the way (which is in Basilicata). For seaside: Torre dell'Orso, Pescoluse, Porto Cesareo, Punta Prosciuto and many other beaches with clean and warm water. Yes, you can find garbage too, but that's tourist contribution as well."}, {"username": "Alan Thompson", "comment_text": "You might want to look up a collective Facebook group ‘Travelling to Puglia’ which has lots of advice on this fantastic region."}, {"username": "Chantal Alloush", "comment_text": "Wij zijn net terug. Wij vonden de kust tegen vallen , maar dat komt omdat wij ook af en toe van een dagje strand houden.\n\nMaar zeker de plaatsjes daar echt geweldig! Monopli en polignano a mere, alberabello en ostuni zijn prachtig. Wij vonden het juist wel erg opgeruimd en schoon.\nBari hebben wij twee dagen gedaan. Oude gedeelte is leuk, maar niet heel bijzonder."}, {"username": "Johanne Noel", "comment_text": "I love everything about Puglia. Firstly. It's not mainstream. It raw snd beautiful, not yet spoiled by tourism. That being said, it lacks in tourism infrastructure,\npublic transportation,\nhotels, etc. You have to go there with an open mind. I would recommend Vieste, Peschici, Gallipoli, Arbellobello Otranto. There is a beautiful boat tour in Vieste grotto mare) and so much more"}, {"username": "Johanne Noel", "comment_text": "Johanne Noel"}, {"username": "Roxanne Allen", "comment_text": "Alberobello for sure. Trulli houses. Unbelievable!!!"}, {"username": "Terri Kolesar Rigano", "comment_text": "We LOVE Apulia. It's one of our favorite parts of Italy. We are going again this year and wouldn't miss it while in Italy. Ostuni, Lecce, Alberobello, Locotorondo, Polignano a Mare.....I could go on and on. What's not to love! Beautiful beaches, authentic Italian food, wonderful, welcoming people, history, architecture, Apulia has it all."}, {"username": "Anne Reilly", "comment_text": "Puglia is definitely worth a visit!"}, {"username": "Clara Romero", "comment_text": "What's your opinion regarding renting a car to drive from Naples to Arbellobelo, Puglia, then to Grotto Palazzese ? Is it worth ? Or is it better to get the train ?"}, {"username": "Barb Scott", "comment_text": "What is the picture of? Beautiful!"}, {"username": "Lindy Brophy", "comment_text": "Where exactly is this picture?"}, {"username": "Fiona Cameron", "comment_text": "Im joining a tour in October based in Ostuni and visiting different places each day (6 days). It’s with Puglialy. You choose your own accommodation and the rest is all organised. Check it out !"}, {"username": "Stacie Morrow", "comment_text": "Check out Sophie Minchilli in Rome here or IG. Her father is from Bari and she has some great guides for the entire area of Puglia."}, {"username": "Siōbhán McKenna", "comment_text": "Following"}, {"username": "Virginia Speedy", "comment_text": "Hubby and I spent around 2 weeks in Puglia last year and it was the BEST part of our one month in Italy. Bari, Monopoli, Alberobello and the d'itria Val, Gallipoli....ab\nsolutely fantastic. DON'T miss it."}, {"username": "Kristine Kvitka", "comment_text": "I'm living in Salento area. The nature is amazing. Clean seawater. September is perfect to visit Italy!"}, {"username": "Oleksandra Klymenko", "comment_text": "We loved Monopoly. The food was nice and walking around the city was a pleasure."}, {"username": "Ann Brahmani Bost", "comment_text": "I spent 2 weeks on Puglia with my sons. We loved it for all of the reasons mentioned above. We stayed in Monopoli and Matera and took day trips."}, {"username": "Isabel Salcedo Patterson", "comment_text": "Lecce and Ostuni are great!! I wanted to visit alberobello but didn't get a chance. The best pizza I had was in Puglia."}, {"username": "Heather Cohn", "comment_text": "I loved Puglia!!!,"}, {"username": "Heather Cohn", "comment_text": "Fly in and out of Bari but spend time in the other areas mentioned in this post. I was in Puglia at a villa with friends for a week. We did day trips to several towns and then one week in Positano ( also with trips to Sorrento and Capri)"}, {"username": "Bev Madill", "comment_text": "Monopoli dirty? I'm a bit shocked. We loved it and.also Polignano and Ostuni. Martina Franca is also great. Enjoy."}, {"username": "Vince Davoli", "comment_text": "Vieste is beautiful as well it’s in that general region"}, {"username": "Nola Bostridge", "comment_text": "Puglia is wonderful:\nGo to\nPolignano a Mare\nLecce\nMartina Franca\nBrindisi & Alberobello\nTons of things to do …. Enjoy :)"}, {"username": "Alice Byrne", "comment_text": "My friend and I just left Puglia. We stayed in Bari and Lecce.\nDidn’t rate Bari too much although close to public and free beach that was really nice but we loved Lecce. We spent 4 days there and really loved it. Wish we ventured out for to Monopoli or Gallipoli as heard good things about there but I would recommend Lecce!"}, {"username": "Anya Schneider", "comment_text": "Yesss you should visit….it’s beautiful and Monopoli is great and Puglia has fantastic beaches and great villages and cities ….. Alberobello; Ostuni, martina Franca, Gallipoli, Lecce, carovigno……"}, {"username": "Máire Sile O Donoghue", "comment_text": "Puglia is gorgeous\nWe didn’t stay in the cities but went right down to the heel"}, {"username": "Renáta Tóth", "comment_text": "Well, well, well. I think you definitely should visit Puglia. I personally did not find Monopoli dirty 6 years ago when I visited, and that was in July so in peak season. But in case you're in doubt, you can visit other towns, that entire coast is full of cute, beautiful towns. Our hotel was in Giovinazzo, which is also a super cute town! I would also recommend you to visit Polignano a Mare, my favourite of the coast towns, and definitely visit Alberobello. If you have time, you can venture a bit father to Matera, it is worth the trip. If you rent a car, you can even go as far down as Lecce, its like 2-2.5 hours drive or so 🙂"}, {"username": "Angela Wilkes", "comment_text": "We are just back from Puglia. I highly recommend renting a Trullo and staying in an authentic style house with a pool was perfect for us. We went to Ostuni, Alberobello, lecce, beaches, waterpark and we found lots of amazing things to explore and to do. The food was amazing the pace of life down there is just perfect to relax and to explore :) the beaches by Ostuni looked amazing with beach clubs and very popular. The sea was the most perfect temperature. Use trip advisor to find the best things to do in the area and for amazing food. We loved it and definitely worth a visit!"}, {"username": "Anna Katherine", "comment_text": "I'm off to Puglia for a week at the end of October - can't wait!"}, {"username": "Maria DiNapoli", "comment_text": "F"}, {"username": "Michelle Iocco", "comment_text": "September shouldn’t be too busy! I’ve only been to isola Tremiti off the coast of Puglia and it has stuck with me. There were so few people and it was very affordable. The water was more beautiful than the islands off the Amalfi like Ischia and Capri."}, {"username": "Michelle Louise Pearce", "comment_text": "Puglia is beautiful. So much to see"}, {"username": "Lisa Krause", "comment_text": "Jenny"}, {"username": "Irene Oda", "comment_text": "Blow our mind and soul? Wow."}, {"username": "Danny Zare", "comment_text": "Stay in Cisternino or Ostuni. You’ll have a much better experience!"}, {"username": "Lucrezia Folger", "comment_text": "The real question is what will your opinion be?? You will find and hear all opinions from a variety of people you don't know. A great thing about Italy is every place is over the top, and unique, every place has its own history, character, types of cuisine, air, lighting, and dialectic of Italian. It's anything but ordinary. You go, explore for yourself."}, {"username": "Melanie Sharp", "comment_text": "We loved Puglia, we hired a car which I think made all the difference, Ortranto was our families favourite. The food is incredible and all the people we met were friendly"}, {"username": "Jacqueline Kol", "comment_text": "Monopoli is just beautiful and the best base from which to come and go. Having toured around Puglia I would definitely be back to Monopoli to use as my base."}, {"username": "Rhona OConnor", "comment_text": "I spent a week in Bari and loved it. Looking at the post in this group up people have to get in line at 7.30am because of the crowds 😳 there is nothing like that in the Puglia area. It's so much nicer and less crowded. We went to Alberobello and we were the only ones with our guide, so it was like a private tour. It was easy to get around. I would go back and visit more of the smaller places next time. Go you will enjoy it."}, {"username": "Rhona OConnor", "comment_text": "Rhona OConnor"}, {"username": "Emily Pearce", "comment_text": "Following! We were planning on the Amalfi coast for 2 nights but starting to lean toward Puglia instead so following this post to see what others say!"}, {"username": "Marianne Hendriks", "comment_text": "Matera (not Puglia) but close and is a jewel!"}, {"username": "Evie Gee", "comment_text": "My experience was totally different. I didn't go to Bari, I stayed in Ostuni and visited nearby Martina Franca, Polignano a mare, Alberobello, Locorotondo. Beautiful quaint towns, the food is awesome. I'd go back in a heartbeat."}, {"username": "Clelia Minucci", "comment_text": "You have to visit Salento, in the south of Puglia."}, {"username": "Lisa Adams Robertson", "comment_text": "Polignano a Mare. See that restaurant? It was a highlight of our month in Italy."}, {"username": "Barbara Bastianini", "comment_text": "I like Puglia a lot. It’s beautiful, has good food and wine, and is less crowded than some other areas. My favorite town is Polignano a Mare. I also like the small charming towns of Locorotondo and Martina Franca. Those two places might lack blockbuster, world famous attractions but they also lack the craziness & over crowding that major attractions bring. They’re beautiful and atmospheric, just perfect for kicking back snd enjoying yourself. If you want to absorb the unique atmosphere of a special place you can do that here!"}, {"username": "Catalina Daniel", "comment_text": "Just came from Puglia/\nbari..Yes, it was dirtier than expected. Lots of graffiti… BUT!… The people there are genuine, extremely friendly & family oriented. The beach we went to was beautiful & the water was warm & inviting. The food in the area was also GREAT! I mean their version of a food truck!!! 🤌🏼 Our host was also great! ez check in, privacy & a bottle of wine waiting 4 us. we only had 2 days… wish we had more time"}, {"username": "Valentina Daprile", "comment_text": "Your friend most probably visited in the worst time or July august chose September or June to visit Puglia. Plus it s down to personal opinion. I am am team\nPuglia and I love it still\nLots to explore . Stay away from the most touristy places maybe. It also depends on what you like . I love the sea so somewhere on the coast is a must. I personally love Monopoli the towns and the coastline loads of little coves to bathe but also\nLove Lecce and and the coast down to Otranto and beyond. The picture you are showing, I was there just the other day and it is stunning. The faraglioni Di Sant Andrea. Lots of gorgeous small town within the internal part with Martina Franca , cisternino, Locorotondo Ostuni. Puglia is a large region chose well and and you won’t be disappointed"}, {"username": "Baba Aga", "comment_text": "I think Monopoli streets were so clean that you could eat of it! I don't think I've seen a dirty place in Puglia."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Have you been to Venice?"}, {"username": "Diana Sideris", "comment_text": "We just came back from Puglia and it was actually our favourite part of our trip. We found the food amazing less tourists, more authentic and people warm. We particularly loved Monopoli, Ostuni and Poliganani a Mare. For beaches, we prefered the ones closer to Ostuni. We did not find it dirty at all. Although one small beach in polignani a mare was ( only from all the people visiting) The towns were beautiful. Bari has parts that can look a little grimy but the old town and the women on the streets making orecchiette was lovely and a highlight. I wouldn’t stay in Bari as a base though it is further from the other towns. Maybe one or two nights and continue south."}, {"username": "Anna Alves-Regalado", "comment_text": "Danny Regalado"}, {"username": "Isabella Banfi", "comment_text": "I agree with all mentioned above in the other comments! My partner is from Puglia and although we don’t live in Italy anymore, we spend lot of time there. I would suggest to stay in a Masseria and move by car to nearby places and beaches! I would strongly recommend Masseria Moroseta if you wanna stay close to Valle d’Itria (trulli area) or Masseria Don Cirillo for Salento (the southern part). Both amazing places 😍\nSeptember is an amazing time to visit, still warm but not crazy and few tourists around!"}, {"username": "Nicola Algerino", "comment_text": "Falso ! Ti consiglio di fare base a Monopoli e visitare i paesi limitrofi. Ovvero : Locorotondo, Cisternino, Polignano a Mare,Alberobell\no, Martina Franca e Ostuni"}, {"username": "Peter Cetani", "comment_text": "You will love puglia. Visit albero bello , one of kind.Ostuni the same. Po migliano a mare as the most romantic restaurant called grotta palazese not easy to get reservations because it’s on the ocean.keep trying. Great restaurant called da tuccino. Bari ? Go to via sparano top notch store and eat at this restaurant called i due Giottoni.best. Beach are in Otranto. And your friend doesn’t know the puglia region.matera is close by . That’s where Mel Gibson filmed the passion of Christ.it’s 45 minutes from Bari.also check out cesterino ,Grotaglie the ceramic town. Puglia is better than the amalfi coast, if you know where to go."}, {"username": "Cat Furness", "comment_text": "I just didn’t a month in Puglia, Bari, Monopoli, Lecce & Gallipoli. Monopoli was my favourite place, not dirty at all. A lovely town with beautiful sunsets and great beaches."}, {"username": "Chiara Bisceglia Lamorgese", "comment_text": "Puglia, Polignano, Monopoli, Matera, Alberobello. All absolutely beautiful and worth the visit. The food the people the landscape is just wonderful. Fresh fish, vegetables, grapes figs and wine truly all a treat"}, {"username": "David Burton", "comment_text": "Sounds like your friend hasn’t got a clue. Monopoli is lovely and not at all dirty. Bari is great, lots of character and plenty to see and do."}, {"username": "Victoria Seidman", "comment_text": "Where was this photo taken? 😍"}, {"username": "Yolie Marroquin", "comment_text": "We absolutely loved our time in the south of Italy 🇮🇹 this past June and if you have already seen other areas of italy in previous travels, you should 💯 explore Puglia.🤞🏼 We stayed 4 nts at a lovely B&B in Lecce “Roof Barocco Suites” and explore around from there. We had a rental car 🚗 but decided to hire Stefano from “Stefawines” for a full 12 hr day of exploring the Salento Pennisula. This was a great decision because we were able to just sit back and not worry about parking, where should we have lunch, etc. He took care of all of that and it was great 👍🏼 We used our car the other days to explore on our own 😀 We then moved for our last 3 nts in the south and stayed in a beautiful Trullo we booked via Airbnb in an area outside Alberobello called Figazanno. From here we explored Ostuni and Alberobello, but unfortunately could not make it to Matera 🙁 I’m attaching a pic of our lovely Trullo ✨"}, {"username": "Carole Todd", "comment_text": "Look out for the trulli. Cisternino & other towns worth a visit"}, {"username": "Pao Magnoler", "comment_text": "Where did she go? You have to go. Matera, Alberobello, Polignano a Mare, Monopoli. Is an amazing place."}, {"username": "Koula Giannetta", "comment_text": "Was there last summer 2022 . Puglia and all the surroundings AMAZING... And clean. Food AMAZING. My favourite places in Italy were florence puglia sorrento..Absol\nutely Beautiful....Yo\nu must gooooo.👍"}, {"username": "Rick Schneider", "comment_text": "Loved everything about Puglia !"}, {"username": "Rachel Castleberry", "comment_text": "That place looks amazing!"}, {"username": "Carmela Noble", "comment_text": "My parents just got back from Vieste and said it was stunning and inexpensive!"}, {"username": "Rick Schneider", "comment_text": "Be sure to visit Alberabello and a side trip to Matera...worth the drive !"}, {"username": "Michael Gerace", "comment_text": "If you want to see the best beaches in Italy, go to Sardegna."}, {"username": "Yelena Shakhanova", "comment_text": "Just came back from 2 weeks in Puglia and loved it all!!!! Monopoli was our base for 5 days acrually. and it was adorable . We also went to Matera which isn’t technically Puglia but was a highlight of our trip! Poligmano just for a day for the famous beach was cool. Ostuni, and alberobello are fairytale like. Otranto and Lecce also great . Beaches depend on weatheR. Torre d’orso of the sea is calm. By monolpolu lots of little beaches , we found some gems . But if you stay in Lecce area. Can also visit the other side in Porto Cesario beaches are like Maldives . Can’t wait to go back .\nBari we only went for a half a day - nice larger city. Definitely would want to return to explore more"}, {"username": "Amy Kaye", "comment_text": "Following bc I have family in Bari and would like to go next year."}, {"username": "Nicole Heaney", "comment_text": "Otranto"}, {"username": "Paula Brink", "comment_text": "The food and wine was great. Lots of lovely, pretty towns in the Valle d’Istria: Locorotondo, Martina Franca, Alberobello. Then Ostuni , the “White City”.\nPolignano a Mare on the coast. Lecce is a gorgeous Baroque city. Further south we enjoyed Gallipolli, Nardo’, Santa Maria de Leuce. I could go on and on. We went to beach clubs in several places- crystal clear water, lovely.\nNot as touristed as some other parts of Italy but many more tourists last June than on our first trip in 2014.\nNot as much English spoken so learn some Italian."}, {"username": "Sandy Tadken Shaffer", "comment_text": "Love puglia!"}, {"username": "Carole Tarlap", "comment_text": "LOVE IT was there for 10 days last year 💥 Drove all over....."}]}, {"id": "2205986349800443", "text": "Family of 3 adults traveling May 2024. Have not booked anything yet as watching airfare but is 15,000 a reasonable budget for 14 days? Accommodations we would just want close to train stations or attractions and nice/clean. Would not rent a car and plan on Rome, Venice And Florence with a day trip or two.", "link": "facebook.com/groups/1373361046396315/permalink/2205986349800443/", "likes": 23, "comments": [{"username": "Maureen Rebello Hagerty", "comment_text": "Spent less than that for five people for longer and including an Adriatic cruise"}, {"username": "Diane Plott Miller", "comment_text": "We are going in November for 7 days. We are paying $4000 (airfare, hotel, tours to Colosseum, Vatican, day trips to Pompeii & Amalfi Coast, Florence, and Tuscany."}, {"username": "Paige Montecalvo", "comment_text": "I fell like that’s a reasonable budget for a nice trip.\n\nFor people saying $1,000 for airfare, we are in Denver and there isn’t anything even close to that, even with multiple stops or positioning flights to fly out of different cities. More like $1800-2000. Really depends on where you are flying from.\n\nWhoever said $200/night for hotels seems off as well. There have never been more Americans traveling to Europe ever. So prices are high. I would say 250/300. I’d also not be comfortable or relaxed with 3 grown adults in a mid priced hotel room for 14 days. So consider Airbnbs.\n\nI would say $50pp/day for food."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "The sketchiest parts of towns are always near the train stations. Don’t that that hold you back. Taxis are cheap."}, {"username": "Pegi Fuller", "comment_text": "We stayed at this hotel on Via Urbana in Rome. We took the train to the main Termini from Rome Airport and walked to the hotel. It was an easy walk to the Colosseum and we also walked to the Spanish Steps and Trevi Fountain. There was a Metro station down the street and we took that to the Vatican.\nIn Florence we se stayed right across from Termini Santa Maria Novello. I think it was called hotel ambassadore Easy walk to everything in Florence, the Duomo, the market, the piazza Vecchio and the Academia where the statue of David is ( recommend getting a time reservation if you don’t want to stand in line for hours)\nFrom Florence we took the train to Venice. Italy has great train service!\nHave a great trip!\n\nhttps://\nwww.hotelraffael\nlo.it/en/"}, {"username": "Phyllis Waring", "comment_text": "Rome\n\nHotel Nazionale or Hotel Quirinale ( near Termini station)\nVenice...Hotel Carlton on the Grand Canal"}, {"username": "Frank Dragna", "comment_text": "We dropped close to $50K on our trip. Worth every penny. 3 adults- two rooms everywhere. Rome, Florence(day trip), Puglia, Taormina. a d Palermo."}, {"username": "Jerry Lyubelsky", "comment_text": "Family of 4 here just over 10k"}, {"username": "Daneda Russ", "comment_text": "Just got back from 14 days with a family of 2 adults, two adult teens and one 15 year old. We needed two rooms everywhere we stayed. We chose 3 star B&Bs near attractions which included breakfast. It cost an average of 250 euro a night per room in July. We booked in March. In all but one case, triple rooms were basically a room with double bed and a child size cot. Mostly private bathroom. That said, we visited 7 locations in 14 days so for us the convenience of included onsite breakfast made a difference to getting the most out of our days. Usually we prefer rented apartments for longer stays but our itinerary was very full. Thankfully every place had some level of air conditioning."}, {"username": "Cyndi Riley", "comment_text": "We’re booking all AirB&B’s\nGot free airline tickets too.\nWe bank rolled $20K for 10 weeks. Not getting expenses places. Places with great review only, take insurance out. Clean, nice, kitchen, washer, A/C. We won’t be spending much time in those places.\nWe travel a lot and know what we want. We will be traveling around the entire county. Renting cars only in Sicily, Dolomites & Tuscany Region. I’m on every Facebook page in each region learning all I can. We leave March 18th flying into Rome & flying out of Rome. I only need to book 3 more B&B’s.\nWe have 10K for cars, trains, buses, food, entertainment. So you should have plenty unless you go with an TA."}, {"username": "Margaret Fanelli-Granger", "comment_text": "Flying out of JFK to Rome and airfare was $1,800 per ticket on Delta."}, {"username": "Ryan Monahan", "comment_text": "Very healthy budget. We were less than half of that for 2, and we were 17 days, rented a car for 14 of those days. And I don't feel like we spared much expense."}, {"username": "Maureen King", "comment_text": "This trip for us 2 people\n10 day cruise\nFlight\n4 days in Rome b4 cruise\nHotel\nExcursions\nTransfers\n\nWe are at about 12k\n\nHaven't even ate yet or shopped\n\nI'm thinking about 15k for the full 14 days if not more !!!!"}, {"username": "Sanghamitra Sahu", "comment_text": "We recently came back from Italy trip (Rome, Florence and Venice) with 2 teenager children. I suggest to book your flight and hotels thru tripmaster.com\nI suggest to stay in the center locations where the main attractions are. That way you can save the time and can enjoy the evenings until 11pm.\nIn Rome, we stayed in the hotel Pantheon which is just 200 from the pantheon. I highly recommend that hotel. In Florence, we stayed in a B&B in the center location. In Venice, we stayed in hotel Pausania. Don’t stay near to the train station. I recommend to book the tour in advance thru viator.com\nHope this helps."}, {"username": "Crisandra Giorno", "comment_text": "We spent $5k for 10 days for 4 of us airfare, car rental, stays, food, excursions, shopping etc. We did a private tour of the Vatican, boat ride around Capri, Pompeii, Mt vesuvius, catacombs, herculeum(not sure it's spelled right), colloseum, museums etc. This was 3 years ago and we go the past cpl days in August and stay into September. We're leaving for sicily on the 30th and doing Paris too this time and we're still way under 10k with excursions, rentals, stays, n airfare so your budget should be fine, it's def doable"}, {"username": "Mary Anne Richert", "comment_text": "Following"}, {"username": "Leah Roveroni", "comment_text": "We went for 9 Days via Gate 1 Travel for less than $2000 per person (inc. Air with rental car) flew into Milan,picked up car & drove to stay overnight in Parma hotel. Spent 7 nights in a Montecatini Hotel (which was a short walk from the train station). We decided to leave the car parked at the hotel, adjust our iteniary and take the \"bullet\" train each day to visit and spend our days in Rome, Venice and Florence (the train avg'd 2 hours to each city, each way). Drove to Cinque Terre for the day and the last evening back to Milan for overnight hotel stay before returning to US.\nWe were all pleased and would do it this way again"}, {"username": "Patricia Trychta", "comment_text": "$12,000 for 14 days October of 2023. Only $1,000 in gift purchases in that money."}, {"username": "Diana Smith", "comment_text": "I think 15.000 is crazy! Where are you guys staying?\nI m not cheap… and we like to eat well ."}, {"username": "Lisa Solary Jacoby", "comment_text": "We are doing MIA to Rome nonstop comfort seats with checked in luggage in March 2024 for $2400 total---3 people"}, {"username": "Ann Brahmani Bost", "comment_text": "I would not recommend staying near train stations. They’re usually not in a good part of town and not in a convenient location to attractions."}, {"username": "Tina Davenport Brown", "comment_text": "That will be plenty. Use the hopper app to watch for airline prices."}, {"username": "Shannon Thomas", "comment_text": "I sent my daughter and her fiance in april this year for 10 days for $3200 including air. Flew nonstop from atl. Stayed in rome. Daytripped by train to other locations"}, {"username": "Fannie Liu", "comment_text": "That is about the same as what we are estimating. Two people for 13 days, about $10-11K. Delta airlines, direct flight in main cabin from JFK was $1100 each. Rome, Amalfi, and Tuscany. We will rent a car for the Tuscany portion. Standard mid range hotels/\napartments, definitely nothing luxury. And we are using a private car once in Naples to get to and from Amalfi hotel. Food was estimated at $75pp per day, probably less if one is a child, the rest are mostly hard costs since I’m going next month and have detailed all the expenses. Just didn’t factor in shopping and souvenirs."}, {"username": "Judith Tobin", "comment_text": "15k what currency?"}, {"username": "Deborah Nash", "comment_text": "Depends where ur flying from and if ur flying economy or business and what level of hotl u want. We are also going next May and have spent over $20k for 2 people before even arriving."}, {"username": "Donna Pompei Lembo", "comment_text": "I always plan on $1000 a day no matter what vacation it is and it’s usually right on Mark"}, {"username": "Theresa Salerno Adams", "comment_text": "No I use tripmaster"}, {"username": "Joel Minter", "comment_text": "Alicia Thompson Minter"}, {"username": "Kelly Barrena", "comment_text": "We used to live in Europe and we are flying to Italy soon. I wasn’t happy with airfare prices so we decided to do round trip to London for $800 each (instead of $1200-1500 to Italy). We are spending a night in London and then taking a budget airline from London to Italy. This way we save a lot of money and will also get to experience one night in one of our favorite cities!"}, {"username": "Shirley Lewis", "comment_text": "Including air?"}, {"username": "Mike Guluk", "comment_text": "Can easily be done i will help if you need advice, not an agent"}, {"username": "Jim Bobrowski", "comment_text": "We were 3, 2 adults 1 teen, cost with airfare, hotels (4 cities) trains, 3 3hr tours was around 10k for 12 nights"}, {"username": "Jerry Kiger", "comment_text": "Good question interested to see input, I’m planning future trip too. Basic planning had air fare $1,500 x 3 = $4,500, hotels $200 day x 14 = 2,800, food $50 day per person $150 x 3 = $2,100 total about $9,400 in basics … would leave $5,000 or $357 remain per day for daily tours, etc. this my rough initial planning. Lot of people say check Rick Stevens website for info too which I plan as well"}, {"username": "Laurie Ladouceur Schmitt", "comment_text": "Definitely"}, {"username": "Lauren Neely", "comment_text": "That’s a very reasonable budget including airfare! Spot on Id say for a VERY lovely trip! We went April 2023 with two adults and two children for 15 days and ended up spending about that much. It helped that we traveled with two other adults and shared Airbnb accommodations.\n\n\nWe did Rome, Venice, Lake Como, and Cinque Terre. No rental car. Lovely accommodations in prime locations. All Airbnb’s. Lots of private tours and wine tastings…lovely\nmeals. Enjoy! Plan ahead and cushion your budget…it’s always fun to come home with a little cash and no bills."}, {"username": "Starla Dawn", "comment_text": "I spent $19,000 for 2 in 10 days. I think I may have over did it. But that rooftop spa suite in Rome was 👌"}, {"username": "Mike Guluk", "comment_text": "You are arriving before peak season air should be 1000-1200 return tops\nHotels at that time of yr 200 max air Babb’s as well\nSo\n3600 air\n14 x 200 hotel 2800\nFood 120 a day x14\n2000\nTrains\n500\nThat’s 10000 on a medium budget\n\nUse skyscanner for air, then book directly with airline lufthansa delta etc\n\nTrivago for hotels then read reviews\n\nTrenitalia for trains\n\nYour budget allows for good hotels fabulous food and great sites.\n\nRome is 3 day max Florence as well as Venice so I would fly to Rome 3 nights then train to Florence 2 nights then RENT A CAR.\n\nDrive to the following fabulous towns\n\nSirmione\nVerona\nRavenna\nCesenatico\nSan Marino\nThere are at least 10-15 more\nThen drive to\nVenice spend 2-3 days and you will get a great taste of one of the most incredible countries in the world\nDriving is easy\nAnd I am not even Italian"}, {"username": "Kathy Flood", "comment_text": "That is what we just spend - just two of us but we were there for a few more days."}, {"username": "Jay Parekh", "comment_text": "We did 8 days and spent less than half that. In Rome, stayed at Unahotel which is a block from. Roma Termini and the metro that can take you to Vatican, Spanish steps, and Trevi.\n\nhttps://\nmaps.app.goo.gl/\nqp88MtfNp7zcS3ux\n8?g_st=ic"}, {"username": "Mary Brown", "comment_text": "Definitely! We traveled in July (2 adults and 12 yo) for 15 days and spent around 16 USD, but that includes everything;\n\n$4000 flights\n$5000 4* hotels & Airbnbs\n$1700 activities (museums, excursions etc.)\n$500 train tickets\nRest is taxis, restaurants, food etc.\nThere were days we splurged on $200 dinners or had less than $30 panini lunch"}, {"username": "Mary Brown", "comment_text": "On another note, I would recommend doing research on the area as often, train station areas aren’t always the nicest."}, {"username": "Kimberly MacKinnon Cherry", "comment_text": "Yes, you must be could even do it for less"}, {"username": "Steve Grossman", "comment_text": "Shouldn't be a problem. Work hard to get cheaper air fares"}, {"username": "Alice Francesca", "comment_text": "Do not pick hotels right outside any train station"}, {"username": "Joanne Dunphy", "comment_text": "Any suggestions as to where to stay in Florence the end of May 2024?"}, {"username": "Pat Cray", "comment_text": "Don’t stay near train stations. It’s usually the worst they’re lovely places to stay, but not near the train stations."}]}, {"id": "2205987336467011", "text": "Hola me gustan mucho sus publicaciones! Estaremos en Florencia a fin de mes para una boda y me gustaría saber si alguien ha rentado un traje formal para caballero en Florencia", "link": "facebook.com/groups/1373361046396315/permalink/2205987336467011/", "likes": 0, "comments": []}, {"id": "2205932909805787", "text": "We are traveling across Italy in October and deciding on how to get around.\nFor reference, we are starting in Rome, then going to Naples and Venice.\nWhich do you feel is the most time-efficient and safe, especially for traveling with all your luggage?", "likes": 6, "comments": []}, {"id": "2205948389804239", "text": "Dinner recommendations for milan. Chill place,nothing fancy- traveling with 2 teen daughters.", "link": "facebook.com/groups/1373361046396315/permalink/2205948389804239/", "likes": 1, "comments": [{"username": "Tom Manno", "comment_text": "Nabucco."}, {"username": "Beth Ann", "comment_text": "https://\nwww.salsamenteri\nadiparma.com/"}, {"username": "Pam Glaser Handmaker", "comment_text": "This was one of our fav restaurants in the 11 days we were in Italy http://\nilprincipedeinav\nigli.it/ No frills, not touristy at all. But so damn good."}]}, {"id": "2205953599803718", "text": "Hi\nIs there shop that sells sim card on Pisa International Airport?\nAs foreigner what do you need to buy sim card in Italy?\nWhich mobile phone company has the best offer for internet to use for 3 days!\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2205953599803718/", "likes": 0, "comments": [{"username": "Cheryl Barowski", "comment_text": "Vodaphone. Cheaper if you buy it in the city, not at airport."}, {"username": "Hussein Karout", "comment_text": "Get an esim from flyesim app"}]}, {"id": "2205960996469645", "text": "We will be in Rome and Paris. Wanting to check out the catacombs. Has anyone been to the catacombs in Rome and in Paris? Is one cooler than the other? Not sure if I need to fit 2 catacombs visits in for our trip😂", "link": "facebook.com/groups/1373361046396315/permalink/2205960996469645/", "likes": 1, "comments": [{"username": "Olivia Wells", "comment_text": "I have done the Paris catacombs and did the capuchin crypt in Rome!\n\nParis catacombs is OUTSTANDING and I really enjoyed the capuchin crypt, which may be a better alternative to doing two catacombs!"}, {"username": "Martha Tuzson Stockton", "comment_text": "I went to the Rome ones 35 years ago and wasn’t blown away. I’ve heard the Paris ones are really cool."}, {"username": "Delphinia Salamin", "comment_text": "I’ve been to catacombs in Paris. They are not very hot but very tight and long tunnels"}, {"username": "Lydia Manchurek", "comment_text": "I did the ones in Rome less than a year ago and they were ok but I’ve heard amazing things about the ones in Paris so I would go for those!!"}, {"username": "Donna Gilardone Szwabowski", "comment_text": "The ones in Paris are vast, pretty cool"}, {"username": "Shen Min Chue", "comment_text": "The catacombs at both places are totally different experiences, there are human remains in Paris but none in Rome. There is only one and only catacomb place in Paris for visitors whereas in Rome, there are around 5 separate independent destinations. If you have time, visit the one in Paris and choose a couple or so to do in Rome, such as those along the Appian Way."}, {"username": "Lisa Roth", "comment_text": "Go to Paris for sure. I just did both in the last couple weeks."}]}, {"id": "2205962496469495", "text": "We will be staying in Messa Lubrense for 2 weeks in September. If you have any “must do” for this area, we would appreciate you sharing with us. Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2205962496469495/", "likes": 0, "comments": []}, {"id": "2205965419802536", "text": "Your favorite Hop on Hop Off in Rome. So many to choose from. Thanks!!", "link": "facebook.com/groups/1373361046396315/permalink/2205965419802536/", "likes": 1, "comments": [{"username": "Jennifer Gustafson", "comment_text": "Walking us so much better to explore the places and see the city!"}, {"username": "Jennifer Smith", "comment_text": "Following"}, {"username": "Susan Salerno Brundage", "comment_text": "Love the hop on hop off. Always took the red bus. Don't remember the name\nYou can get off and on."}, {"username": "Diane Maker Sandelowsky", "comment_text": "Following"}, {"username": "Linda Selph", "comment_text": "Following"}, {"username": "Stefan Sig", "comment_text": "Search viator"}, {"username": "Elaine Lehnert", "comment_text": "Try biga tours electric golf cart tours. Guides are wonderful! Www.bigatours.c\nom"}, {"username": "Lisa McMurchie", "comment_text": "Rip off."}]}, {"id": "2167390650326680", "text": "Cefalù Boat Trip ⚓️\nExperience the beauty of Cefalù far from the crowds with this boat tour along the coastline. Take in views of the town and its churches from the sea then skirt the coast, stopping to swim and… आणखी snorkel in the crystalline coves. Snap photos of the views, sunbathe on deck, and relax with cool drinks and snacks on board.\nRead more about Boat trip to Cefalú - https://www.viator.com/tours/Sicily/Boat-trip-to-Cefalu/d205-149954P1?pid=P00070587&mcid=42383&medium=link&medium_version=selector", "link": "facebook.com/groups/1373361046396315/permalink/2167390650326680/", "likes": 9, "comments": []}, {"id": "2205846279814450", "text": "If you are in the Vico Equense near Sorrento, avoid this restaurant. The staff is rude and claimed I had to pay cash because the machine was broken. When I said I didn’t have any cash they said I would have to go to the bank. I only knew this because someone translated for me. Server was so rude. I would’ve told her that I would have to pay service fees plus higher exchange rates twice as much the drinks, but she didn’t understand English. Very unapologetic. Would never go back. ￼\n\nThe restaurant is La Salumeria", "link": "facebook.com/groups/1373361046396315/permalink/2205846279814450/", "likes": 5, "comments": [{"username": "Vivien Paulik", "comment_text": "Was the food bad? Was it expensive?\nBecause cash if the machine is broken is okay. Service fee is okay. And not knowing English is okay."}, {"username": "Stephanie Ratcliffe", "comment_text": "Okay, looking at your statement, lets focus on some key callouts...\n\nclaimed I had to pay cash because the machine was broken. - you should always have a method of payment, dont assume the restaurant accepts cards... this is your failure not the restaurant.\n\nsaid I would have to go to the bank. - Yep, see above.\n\nI only knew this because someone translated for me. - your failure to not be able to converse in the language of the restaurant, at least have Google translate or something.\n\nshe didn’t understand English. - you're in Italy, they only need to know Italian... you should know some Italian too...\n\nVery unapologetic. - they weren't in the wrong, you were..."}, {"username": "Veronica Parravicini", "comment_text": "To everyone saying that the restaurant has no fault, I have to say that Unfortunately “the machine is broken” it’s often an excuse to reject credit cards and accept only cash. So they don’t trace your payment (no receipts) and they can avoid paying taxes (which is a criminal offence).\nI’m not saying that this it’s 100% the case but it’s unfortunately very common"}, {"username": "Ben Poupard", "comment_text": "But if you ARE in Vico Equense, go across the street to Cafe Zerilli, they're related to Bruce Springsteen and when I told them I was there because I liked the Boss they played Springsteen over the sound system 😂"}, {"username": "Frank Hunt", "comment_text": "You are in Italy, customer service is not always a thing and being shouted at can be considered normal by some, it’s just part of the hot blooded Mediterranean deal.\nJust put it behind you and move on, we all do."}, {"username": "Julie Angel Bruther", "comment_text": "Good to know! I’ll be there in November.."}, {"username": "Laura Irmina", "comment_text": "Imagine an Italian going to american restaurant in the US, offended about the server not speaking Italian"}, {"username": "Renee Rundle Stoneham", "comment_text": "Ummm…\nCC machines break… some places only take cash.\nAsk if you only have a CC if it’s ok BEFORE you order and eat.\nService fees and coperto fees are common at most restaurants in Italy.\n\nIf you don’t have cash on hand, the only place you can get it is a Bank, ATM etc…\n\nYou are in a foreign country, don’t speak the language and don’t have Google translate…\n\nThe waitress didn’t…\nSpeak English. Uhhh again, you are in a foreign country!!!\nNobody has to speak English and it’s rude and naive to think and expect everyone to speak your language!🤦‍♀️\n\nSounds like an entitlement problem not a restaurant problem."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2205908176474927", "text": "Can someone recommend a driver or car service for 4 people (with luggage) from Milan airport to Lake Como?", "link": "facebook.com/groups/1373361046396315/permalink/2205908176474927/", "likes": 0, "comments": []}, {"id": "2205898093142602", "text": "I never thought I would be asking such a Newby question. But given current crowds and high flight prices described here for European travel, is it best to plan your itinerary, then book hotels, then watch air flight prices? I would say that I normally book my flights for the dates of travel first, and then shop for accommodations. What are your thoughts? ￼ Let’s assume I’m going to Italy in May 2024.", "link": "facebook.com/groups/1373361046396315/permalink/2205898093142602/", "likes": 18, "comments": [{"username": "Shell Therese", "comment_text": "Goodness no. Flights first."}, {"username": "Stephanie J Stevenson", "comment_text": "Depends on how you like to travel. i like a lot of flexibility and spontaneity. I look for airfare, buy one way tickets and start looking for return ticket deals (not always in that order). Sometimes i buy tickets months apart and almost never buy round trip. I mostly plan accommodations and activities a few days in advance rather than be tied to a strict itinerary."}, {"username": "Anna Gambino", "comment_text": "We booked our flight from New York to Rome a few weeks ago because it was a good price. Then booked accommodations.\nThis was for next April. Will book other things like tours and trains when we get closer."}, {"username": "Anna Ngo", "comment_text": "I look for flights first and play with the dates. Book if the price is right. Search what I want to do or visit. Then I ask myself if I do want to rent a car, rideshare or use public transportation.\nThis all depends on the places i would want or like to visit and the distance. Then Find accommodations within range or close to most places I would want to visit. Sometime booking 2 different accommodations in the same city can be very convenient (sometimes cheaper) if staying for longer.\nIf I find a cheaper flight with the same airline after I had purchased the ticket, I cancel and re book or change my flight."}, {"username": "Lucrezia Folger", "comment_text": "I book flights 1st."}, {"username": "Eileen Muro", "comment_text": "We went thru Costco Travel. It includes flight, hotel, transportation from airport to hotel and vice versa and transportation to each place. We did 3 days in Rome, 3 days in Florence and 3 days in Venice. We booked in December of 2022 for July 2023 (we just came back a few days ago). We spent the next 6 months researching on YouTube and bought our tickets for tours about 3 to 4 months before leaving our trip."}, {"username": "Tracy Foss", "comment_text": "Flights first, hotels next,then transportation between ,then tours ect"}, {"username": "Kimberly Lampros", "comment_text": "I always do flights, itinerary, and then accommodations.\nFor my trip this fall I planned a round trip from bologna initially but then found better flights into bologna and out of Venice so that changed my itinerary."}, {"username": "Lydia Springer", "comment_text": "I always create a basic plan of the places I want to visit and how many nights in each. Reserve at preferred accommodations next (select those with good cancellation policies). Look at transportation between locations but don't book yet. Then book flights; if you need to fly into a different city than the one you planned to start with (perhaps it's a better price), you can switch dates around at hotels. I start everything a year out."}, {"username": "Phyllis Snyder", "comment_text": "I got my itinerary plans first- booked my arbnb accommodations (they have cancelation dates if I need to) - now waiting for the airline’s flight windows to open. My trip isn’t till September 2024. When booking my airbnbs- places were already getting booked- and that was two months ago!"}, {"username": "Ann Heffern O'Connell", "comment_text": "I booked my airbnbs first because I wanted the best ones before they were snatched up. Then I booked my airline tickets. But I looked at patterns to see what days the budget airlines traveled. A lot of hotels are just starting to book for May. I’m going in June 2024."}, {"username": "Bryson Bettini", "comment_text": "I book all inclusive trips only. Tripmasters allows you to sift through hundreds of flights and hotels altogether. They’ll even do ticket booking for in country transport like trains and cabs.\n\nCost wise it’s so close to shopping all of that myself that I just don’t worry about looking for them individually anymore."}, {"username": "Bridget Gieseke", "comment_text": "Plan your itinerary, book your accommodations,\nthen airfare. If you cannot find reasonable accommodations,\nmakes no difference how cheap the airfare is."}, {"username": "Renee Rundle Stoneham", "comment_text": "I book flights first. Because some airports etc have better routes better prices etc… it’s then easy to get a train to where you want to go.\n\nGoogle flights is great Hopper is good too get alerts for when prices fall.\n\nAccommodations are easy, unless you really want a specific place etc…\n\nThis June the only accommodation I booked a few months in advance was Varenna because of high demand.\nMaggiore and Milan were a couple of weeks before we left. Milan I booked about a week before we left. Big cities have tons of accommodations etc."}, {"username": "Ashley Martins", "comment_text": "I book my flights first - fly on Tues or Wed for best deals. That will be your most expensive item so get a good flight price/dates that you want then hotels after that."}, {"username": "Suzanne Shea-Simpson", "comment_text": "Been to Italy several times. Leaving for Rome end of Sept to catch cruise starting October 2. Cruise goes to Amalfi Coast, Sicily, Turkey, Greece finally disembark day 7 Athens where we will stay for 3 nights before flying home to FL.\nWe’ve booked several European trips through Tripmasters.com including Italy Rome, train to Florence, and train to Venice. Also used for Spain (Madrid train to Seville, train to Barcelona) London, Paris by Eurostar train, London, Paris by Eurostar then flew from Paris to Dublin. Their itinerary usually has number days that you can add or subtract. On Tripmasters we usually book air R/T air from Florida, hotels centrally located that you can change, includes train or another local flight to next destination. We don’t book any tours, transportation or extras. We always start looking 9 months out and once we agree we book. Never had a problem and cost usually $1500 to $2200 each. We use GetYourGuide.co\nm for tours and transportation.\nThey are great! On our Italy trip booked Day Trip to Cinque Terre from Florence that was fabulous. Also skip the line tours for museums, foodie tours, etc. Sorry for long text….enjoy your adventure."}, {"username": "Pam Simpson Wilson", "comment_text": "We originally planned to start in Rome and end in Venice but found tix were $200 less pp to do the reverse…. Keep open minded on airline - find the deal then fill in the rest. We booked flights in June and we are mid vacation right now!"}, {"username": "Amy Schmelzle Walsh", "comment_text": "I booked my flight to Rome in May '23 on travel Tuesday in Nov 2022 and got a great price for a multi-city round trip on AA(I only fly AA due to status) - after flights booked I booked airbnbs and hotels since my dates were firm and not changing-- this plan worked well."}, {"username": "Jen Lundy", "comment_text": "We did a ton of research starting in January for an early September departure. We looked at all options of building our own itinerary, using a travel agent, and looked at Costco Travel. Costco is the best value and hassle free option by far. For a 9-10 nights in 3 cities including 3-4 star hotels, airport transfers, and flight was $1700 CAD per person. The travel agency just didn't grasp our personas to meet our needs, and my friend and I are particular with safety, cleanliness, location and want experiences and hassle free so we have built our own itinerary. We researched hotel chains and boutique hotels based on reviews, our budget and price among other factors. We excluded airbnb. We monitored flight pricing for a while and looked at trends. We booked our airline tickets as we saw prices and seating changes. We started to secure our hotels which then changed bc of the inventory when we were due to fly. Then we started to map out our excursions and booked tours and restaurants. We booked our trains last knowing there are several transport options. We are probably now sitting at $3500 each. If I could go back in time, I'd book Costco for the big ticket important stuff (flight+hotel package) and then have more money in my pocket for experiences."}, {"username": "Leisa Lyons Kube", "comment_text": "I am working on a 49 day Europe trip for April and May 2024. I made my itinerary first and started booking hotels in February. Then booked my airlines as soon as I could. As of right now I have all of the Europe flights booked, 3/4 excursions booked. Right now I am basically waiting for purchasing tickets on things that you can only book 30, 60, 90 days before and then also the train tickets. ￼"}, {"username": "Mindy Jo", "comment_text": "I just booked a 13 night trip in November out of a podunk Montana Airport with RT airfare, hotels, train transfers from Milan (3 nights) to Venice (2), Venice to Florance (2), Florence to Rome (3), rental car in Rome and 3 nights in Sotrento for $2075. Through a reputable company I, and others I know, have used several times. I thought that was a great price. That being said I've only ever looked on this particular site."}, {"username": "Kevin Robison", "comment_text": "I'm planning way ahead this time 🙂. I just booked flights two nights ago for Oct 23 - Nov 6. I found availability ok using United miles, but not great. SFO-VIE, VIE-BLQ, NCE-SFO.\n\nI'm now looking to book places to stay around arrival and departure, book a car from BLQ, then I'll fill in the blanks closer to my trip, possibly once I'm in Italy. I'm scoping a few 3-night stays in Tuscany and Liguria along the Italian Riviera, then leaving from Nice, the land of pastries."}, {"username": "Robin Burrell", "comment_text": "Air first, then go from there"}, {"username": "Alison de Lisle", "comment_text": "Flights first"}, {"username": "Fiona Cameron", "comment_text": "I always decide when Im going ( at least 12mths in advance) then book flights as soon as possible, I think the maximum time is about 300 days with most airlines. Its cheaper to fly in Sept than late August (I’m in Australia so can only speak from my experience). It’s also cheaper to fly in/out of certain cities with certain airlines. Once flights are sorted you then have months to research you itinerary and places to stay etc. That’s my way !!"}, {"username": "Elyse Lichtman-Scheiner", "comment_text": "We planned our own similarly to everyone commenting. It worked out well. For my next trip, I will leave the planning to others and do a tour. It was a lot to plan and keep on top of."}, {"username": "Deborah Nash", "comment_text": "We booked for May 2024 as soon as the Airfares became available. We were specific about our dates and what airline we wanted Also booked all our hotels in March this year. Most places are already full! We have 3 days in Rome then 11 day cruise, 3 days in Venice then 6 days Amalfi Coast. It is going to be a very busy year in Europe. We can't even change our Rome hotel as most places are fully booked"}, {"username": "Tam Wong", "comment_text": "If you book with delta and price goes down they will credit you back."}, {"username": "Steve Wolfrom", "comment_text": "I’m seeing 1200 PP for May out of northern Florida. Fly into Florence and out Rome. Looks pretty good?"}, {"username": "Gena Kona-Mancini", "comment_text": "Yes I booked everything with a good cancelation policy that way I was able to change destinations or dates without penalty."}, {"username": "Alessandro Iannelli", "comment_text": "as a rule of thumb, first you plan your itinerary, then and as soon as possible book the flights, because their prices tend to increase so much as you approch the date of the travel, finally you take care of accommodation. but i would imagine this is the case for any destination in the world, not just italy."}, {"username": "Kristina Ruk", "comment_text": "Book flights first ;)"}, {"username": "Fetchin Gretchen", "comment_text": "I always book my accommodations first but then I stay a month or more. I usually book over Expedia 53 days out thereabouts and get price protection option where will go down but never up."}, {"username": "Nikki Niks", "comment_text": "We always book hotels first. We already booked some for Aug / Sept 2024."}, {"username": "Casarine Temple", "comment_text": "I always plan itinerary, book flights , then accommodations , then tours. I book flights and accommodations on the same day. I like to have those locked in but I also book refundable flights."}, {"username": "Ann LaGreca", "comment_text": "I would book hotels first paying attention to their cancellation policy in case you decide not to go those dates. Also depending on the airline if prices go down after you book, you may be able to get a credit good for one year"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Use Skyscanner to check airfare for different airports and dates if you are flexible. Based on your eventual purchase, set your itinerary and book accommodations and private tours etc."}, {"username": "Wendy Spano Bracco", "comment_text": "I booked hotels a year out, then I booked the flights. The tours, we worked on..the company invoiced 1 month out."}, {"username": "Maureen King", "comment_text": "I have already booked cruise\n\nSearched my top 3 hotels and waiting for it to open up\n\nWaiting on my tours to open up\n\nWaiting on my flights to open up\n\nWe go September 2024\n\n400 more days but who's counting lol 😆 😅 😂"}, {"username": "Beatriz Davalos Moreno", "comment_text": "I just came back from a 23 day vacation. I started planning about 9 months to a year before the trip. I got the flights first, kept an eye on prices using google flights and getting notifications for changing prices. After I got the flights I started by making an itinerary, where and how many days I wanted to stay at a place, looked for hotels and Airbnb's and compared prices, if we were going to stay more than one day at a place I would choose an Airbnb instead of hotel so I can have better accommodations.\nI choose airbnbs that could be cancelled If needed be. after that I got tours and train transfers! Hope this helps!"}, {"username": "Victoria Moorhead Murrow", "comment_text": "Flights first."}, {"username": "Donna Austin Jones", "comment_text": "We are going to Italy in May 2024. Ive been watching flight prices for several months and flights from Texas to Rome have been steadily rising. I bought my tickets a month ago directly through the airline and the same flight is now over $200 more. I booked my flight then booked accommodations but in hindsight i would book accommodations first because two of the places i wanted to stay got taken. 🥹 airbnb has free cancellation for most places so there’s nothing to lose if you decide to cancel."}, {"username": "Tracy Wrinn Mcdermott", "comment_text": "I set itinerary first, book hotels or rentals (with cancellation available), then set an alert on Skyscanner for best airfare."}, {"username": "Stacy Giammarino Betty", "comment_text": "I booked my Airbnb last month for next July. Only bc my dates are set in stone. Now I’m watching for airfare to see if I can hopefully get a decent price."}, {"username": "Bonnie Rodgers Henderson", "comment_text": "I make my flight arrangements first. I only travel from October to April to avoid crowds, better pricing. I only book a week or two at a time. I like being flexible and ability to change iteranery as I find new areas to visit. I have been doing this for 40+ years and never had a problem."}, {"username": "Tami Sue", "comment_text": "If you book your hotel first make sure it's free to cancel just in case u can't find a flight or change up where u fly into. I actually book my hotel first in munich because it's oktoberfest and hotels sell out fast."}]}, {"id": "2205897189809359", "text": "Is there second hand/thrift stores? How do we find these? Thanks 😊", "link": "facebook.com/groups/1373361046396315/permalink/2205897189809359/", "likes": 2, "comments": [{"username": "Shelley Stewart Greene", "comment_text": "Thrift stores are mostly in larger cities and honestly, I didn’t find a single item that I would’ve wanted there. Think older matrons wearing polyester shift dresses. However, there are vintage shops that have amazing finds but are more expensive.\n\nLastly, there are clothing shops that have end of September sales for 90% off. Trastavere (sp?) especially."}, {"username": "Jessica Stewart", "comment_text": "Oh I want to know this as well"}, {"username": "Lina Khasky-Parness", "comment_text": "I found some in Milan, on TikTok. But when i visited one it wasn’t great, seriously picked over"}, {"username": "Kimberly Coury", "comment_text": "They had second hand clothes in Rome at the little street markets."}, {"username": "Neika Toota Kelley", "comment_text": "I’ve been researching this and the big names for higher quality are Mercantile and Humana, and mercatino"}, {"username": "Zita Quintanilla Sanchez", "comment_text": "We visited a Humana in Rome and were able to find some beautiful Italian Linen dresses, tops and men’s shirts! Luck was on our side because everything we got was marked down 40% for that day."}, {"username": "SE Rosenberg", "comment_text": "Following"}, {"username": "Frannie Kaplan", "comment_text": "Il mercatino dell'usato but it doesn't particularly specialise in vintage. There are vintage and thrift stores but they're not famous and rarely cheap"}, {"username": "Gillian O'Callaghan", "comment_text": "Google \"used clothing stores near me\""}]}, {"id": "2205898409809237", "text": "Hi y’all. Leaving for Italy with my mom in September and we will mostly be there for work, but we always try to do a sightsee option. Last time in Rome we did The Catacombs …but this trip I want to do a really cool Colosseum Tour …but maybe something like “The Secret Tour” at The Doges Palace in Venice. I haven’t been inside The Colosseo since I was 14 and I’m not sure Mom ever has. Thoughts???", "link": "facebook.com/groups/1373361046396315/permalink/2205898409809237/", "likes": 0, "comments": []}, {"id": "2205898846475860", "text": "Help/Suggestions please. We will be in Florence for 2 nights in October and I would love suggestions of hotels to stay that are near attractions, AND MUST SEE attractions since we have only 2 days. This is a last minute stopover before we head to Rome to board a cruise. THANK YOU.", "link": "facebook.com/groups/1373361046396315/permalink/2205898846475860/", "likes": 2, "comments": [{"username": "Andrea Hirsch", "comment_text": "Depending on budget, Il Tournabuoni! Checks all the boxes! It’s a wow hotel"}, {"username": "Jeanne Eliason", "comment_text": "Hotel David however it may be booked. We have stayed there many many times. It's beautiful. Lovely breakfast and evening wine beer and snacks."}, {"username": "Sandy Radican Shikaly", "comment_text": "Hotel Brunelleschi in the center is wonderful"}, {"username": "Valerie Collanton", "comment_text": "Any where in the city center is close to what you want to see. Some I like: Hotel L’Orologio; Hotel Monna Lisa; Hotel Cellai; Ponte Vecchi Suites"}, {"username": "Pat Cray", "comment_text": "Loved the Kraft Hotel…. Beautiful rooftop views and restaurant! Lovely room."}]}, {"id": "2205899599809118", "text": "Hi🧚🏻‍♀️\n\nIm flying to Catania next Wednesday from Budapest but these Ryanair flights are directed to Trapani at the moment. Im flying late night, if Ryanair can’t provide any help I dont know how I get to Catania that night (probably impossible) or even anywhere from that airport that late. Is there anyone who experienced something similar?\nThank you🙏🏻", "link": "facebook.com/groups/1373361046396315/permalink/2205899599809118/", "likes": 2, "comments": [{"username": "Dafne Vassetti", "comment_text": "It's because of the fires in Sicily. Catania was strongly hit and routes are being changed depending on wind, fire direction, etc. Best thing from Trapani is to hire a private driver. It will be a few hours drive to get to Catania."}]}, {"id": "2205901856475559", "text": "Good morning all!\nIll be visiting Rome for my honeymoon in October for 6 days 5 night and I would really appreciate some thoughts/tips.\n\n-Any romantic date recommendations?\n\n-We are thinking of taking electric scooters, does anybody know if it's possible? Is there electric scooter rental around the main attractions?\n\n-We would love to go to Pietrelcina, would it be possible during our short stay?\n\nThank you in advance.🤍", "link": "facebook.com/groups/1373361046396315/permalink/2205901856475559/", "likes": 0, "comments": []}, {"id": "2205555556510189", "text": "Hello! Me and my bf will be traveling to Italy from the end of August to mid September and I had a couple of questions:\n\n1) Should we get a notarized passport to have on us when we go out? (A photocopy of the original which is signed and stamped by a notary that we can carry on us when we are out and about as I'm scared to carry the original in caseआणखी of theft)\n\n2) Do we have to book boat tours in Capri in advance? If so how in advance and where do we book them? Any recommendations? We really want to do the cave tours.\n\n3) How and where can we book a cooking class? I wanted to book one in Positano.., is it worth it? Are there better ones?", "link": "facebook.com/groups/1373361046396315/permalink/2205555556510189/", "likes": 2, "comments": [{"username": "Melanie Matthews Stuprich", "comment_text": "I’m not sure what you mean by a notarized passport? Like notarizing a copy of one? I don’t believe that would help you in anyway here but I could be wrong. Besides tours where they ask for one but will accept a picture of one, you will always need the original. Though I don’t keep mine on me when out and about because I’m too afraid to lose it or my bag being stolen. For the other questions, sorry I can’t help. Haven’t done capri in 20 years so was way different booking back then than now and wherever you do a cooking class I’m sure it would be amazing!"}, {"username": "Melanie Matthews Stuprich", "comment_text": "Definitely take a picture of your passports not just for tours but it would be a lot easier to deal with embassy with that if it does get lost or stolen."}, {"username": "Aaron Peterson", "comment_text": "Just take a photocopy and carry with you and take a few photos on your phone as well for passports"}, {"username": "Elizabeth Hartzell", "comment_text": "Hi there! We will be there at the exact same time! I emailed for the La Tagliata cooking class in Positano and they responded that they are currently booked out through the end of the year but we could join the waitlist. Currently they have over 1,000 on the waitlist. Cost is $150 per person. Almost all of the beach clubs were fully booked in Positano as well. The only one I did find had only packages available for $1000-$1500. So definitely thinking about skipping Positano as I don’t know what else there is to do there besides take pictures for Instagram 🙃"}]}, {"id": "2205716213160790", "text": "Hi all!\nBest things to do in Sorrento?", "link": "facebook.com/groups/1373361046396315/permalink/2205716213160790/", "likes": 3, "comments": [{"username": "Nadia Filice", "comment_text": "Take a ferry to Capri, Amalfi and positano"}, {"username": "Ewa Kolodziej", "comment_text": "Pizza making classes"}, {"username": "Gina Spyker Fairfield", "comment_text": "Visit I Giardini di Cataldo - lemon grove right in town that you can walk through. They make limoncello there too and you can do a tasting."}, {"username": "Christine Piche", "comment_text": "Tout !"}, {"username": "Veronica Solimando-Lynch", "comment_text": "Take the ferry to Capri"}, {"username": "David Henry", "comment_text": "Rent a scooter 🛵 and head over to the Amalfi coast 🫣"}, {"username": "AnnMarie Pfeifer Decker", "comment_text": "Drink Meloncello."}]}, {"id": "2205733916492353", "text": "I'm going next week to Florence for one day with my girl who is 10 years old. We are going with the train.\nWhat can you recommend to make her day to be unforgettable? :)\nI already thought at the museum Leonardo da Vinci interactive, Galleria Accademica, The Dome, Ponte Vecchio.. And for sure we will walk around there and be mesmerized of the view.आणखी\nDo you have a recomandation where to eat? Where to stay for an hour to catch our breath and have a nice view?\nLittle local shops to buy something as a reminder of our day together?\nThank you so much!!", "link": "facebook.com/groups/1373361046396315/permalink/2205733916492353/", "likes": 3, "comments": [{"username": "Steve Wolfrom", "comment_text": "You might ask for ideas on experiences vs museums. Cooking class? Pasta class?"}, {"username": "Lisa Valdovinos", "comment_text": "Cooking class is so much fun!"}, {"username": "Cindy Bafaloukos", "comment_text": "Lindt chocolate store has a cozy spot in the back and GELATO! It was right next to the Duomo and we rested there for about an hour enjoyed gelato and A/C"}, {"username": "Dafne Vassetti", "comment_text": "Boboli Gardens :)"}, {"username": "Teresa Shawn Lane", "comment_text": "Duomo, Point Vechio and there are shops everywhere! Go to Vivoli for gelato!"}, {"username": "Alice Francesca", "comment_text": "Head to LA RINASCENTE mall right in the center and go have a coffee on the rooftop cafe'! Best view !"}, {"username": "Deborah Schroeder", "comment_text": "1 day-what would she want to do? You need advance tickets for most sites and that really ties your time up plus, most 10-year-olds aren't big on museums after a short period of time in one. Just walking and taking in the views, stopping for lunch, getting some gelato and spending time with you would be special for her. Go to the new FB site Florencewise and see what Elyssa has for things to do."}, {"username": "Kathy Kibbe", "comment_text": "There are cute shops across from the Pitti Palace - Christmas ornaments, mugs, etc…also - find a rooftop bar for a hot chocolate break (Rinascente department store in the city center has a good one)… shop at Pylones and Flying Tiger for cool unusual stuff, get gelato at Perche No…"}, {"username": "Lushan Yao", "comment_text": "I think she will like Venchi Chocolate and Gelato. The chocolate wall fountain is quite impressive."}, {"username": "Maria LaPietra Guerrero", "comment_text": "My daughters, 8 and 12, favorite part was sunset over the Arno River. I would recommend the bridge past Ponte Vecchio. And lots of gelato."}, {"username": "Lori Wroblewski", "comment_text": "There are restaurant’s in Ponte Vecchio. We stopped there and ate and took in the sites. It was gorgeous. This was the view from our table"}, {"username": "Ilonka Sinkeldam", "comment_text": "Lorenzo market!"}, {"username": "Starla Dawn", "comment_text": "Book business class for the train ride."}, {"username": "Frann Todd", "comment_text": "I have a reservation for DaVinci exhibit, where his inventions have been transcribed, built and visitors can move the inventions!!"}, {"username": "Rita Levi Montalbano", "comment_text": "For the great view go in Piazzale Michelangelo, its a square on top of Florence and you can see the whole city. Must do"}, {"username": "Ana Stoenescu", "comment_text": "Thank you all so very much for your recommendations\n!! I really appreciate it. I made a plan where to go and I hope I let time also for serendipities 😁!\nI will come back with photos and feedback here!\nAlso, I would like to remain mentioned here, maybe for someone else, to visit the oldest pharmacy in Europe, from 1212,Officina Profumo - Farmaceutica di Santa Maria Novella. I read that there was made the parfume for Caterina de 'Medici, before she married the king of France. They still have it, is named Aqua della Regina. Go on google and look for the place, is part museum, part parfumerie. I fell in love with the place just from photos. I really think my girl will enjoy this and all the places we are going to see together!\nThank you again! 🤗"}, {"username": "Avril Samuel", "comment_text": "My daughter lives near Florence and for her 9 year old’s birthday she went on a scavenger hunt arranged by a lady in Florence, which included a boat trip. They learned so much about Florence in a fun way."}, {"username": "Ana Stoenescu", "comment_text": "Ana Stoenescu"}, {"username": "Ana Stoenescu", "comment_text": "Ana Stoenescu"}, {"username": "Ana Stoenescu", "comment_text": "Ana Stoenescu"}, {"username": "Ana Stoenescu", "comment_text": "Ana Stoenescu"}, {"username": "Ana Stoenescu", "comment_text": "Ana Stoenescu"}, {"username": "Ana Stoenescu", "comment_text": "I wrote a whole comment with what we did and it didn't upload it 😅. Pff.. It was really nice and we had a wonderful time. We went to many places outside, we entered just in museo selfie and museum of illusions.,the Santa Maria Novella Parfumerie. Wonderful place to visit!\nI posted some photos of pur journey! Thank you so much for your recommendations\n, I really appreciate it!"}]}, {"id": "2205755319823546", "text": "Hey guyyys!\nI would like to travel to Castelmezzano and also to visit Matera during this trip. Do you know if there are any buses in this area? Thank you!!", "link": "facebook.com/groups/1373361046396315/permalink/2205755319823546/", "likes": 1, "comments": [{"username": "Carmela Losavio Wiltshire", "comment_text": "good luck with that! 🙈 I'm from that area and would recommend hiring a car."}]}, {"id": "2205788266486918", "text": "We are visiting the Amalfi Coast in May.Is Vico Equense a good place to use as a home base? How are the restaurants,shops and access to ferries, trains or bus to get around.We are planning on seeing Pompeii, Capri, ferry to Positano and to hike the Path to Gods. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2205788266486918/", "likes": 0, "comments": []}, {"id": "2205792459819832", "text": "What is the best way to travel from Santa marghareta to Menaggio", "link": "facebook.com/groups/1373361046396315/permalink/2205792459819832/", "likes": 0, "comments": [{"username": "Veronica Parravicini", "comment_text": "Do you mean Santa Margherita Ligue (Liguria) and Menaggio on Lake Como (Lombardia).\nI’d say by car or train to Como + ferry/bus to menaggio"}]}, {"id": "2205809299818148", "text": "Hi,\nCan anyone recommend accommodation in bologna with a pool? Ideally close to the town center. Traveling with our 3 year old son. Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2205809299818148/", "likes": 0, "comments": []}, {"id": "2205792776486467", "text": "Positano 💜", "link": "facebook.com/groups/1373361046396315/permalink/2205792776486467/", "likes": 5, "comments": []}, {"id": "2205801653152246", "text": "My son and his family 3 adults and 2 children ages 3 & 5 are going to a wedding in Trieste in May 2024. Can anyone recommend an Airbnb?", "link": "facebook.com/groups/1373361046396315/permalink/2205801653152246/", "likes": 1, "comments": [{"username": "Vivien Paulik", "comment_text": "We stayed in Pueste del Sol apartment. Idk it is enough for 2 adult and 3 children, but you can write the owner on whatsapp and if it is not,she can recommend you other accommodation.(\nin that way it wilk be cheaper than booking on a site) She lives in Trieste, so she knows a lot of good places\nhttps://\nwww.facebook.com\n/\npuestadelsoltrie\nste"}]}, {"id": "2205806076485137", "text": "Has anyone taken a class from chef Andrea Consoli from Cooking Classes in Rome? If so, would you please share your experience or recommendations? Thanks so much in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2205806076485137/", "likes": 0, "comments": [{"username": "Philip Curnow", "comment_text": "Metro B to Circo Massimo, then walk directly away from the old chariot stadium until you hit the Appia Antica. Keep walking and you'll eventually hit the catacombs just as you exit the ancient city exit/gate."}]}, {"id": "2205806243151787", "text": "Any recommendations for boat trip from Sorrento to Capri? Is it better to do half day or full day ?\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2205806243151787/", "likes": 0, "comments": [{"username": "Dafne Vassetti", "comment_text": "Full day."}, {"username": "Darryl Vanstone", "comment_text": "We did an afternoon/\nsunset cruise which was amazing"}]}, {"id": "2205809259818152", "text": "Thought I’d share this… for those who may be going to Cinque Terra. Our afternoon on the boat was perfect! The crew were so friendly & attentive!\n\nThey offered a swim.. but we had been at the beach all morningआणखी near our BnB in Monterossa- so didn’t feel like more swimming… ❤️\n\nWhen I came home, I happened to hear an interview - I think with one of the RIck Steves tour guides with Matteo! It was fun & sentimental to hear his voice again.\n\nDisclosure: I have no professional connection with this company.", "link": "facebook.com/groups/1373361046396315/permalink/2205809259818152/", "likes": 15, "comments": [{"username": "Judy Grayson", "comment_text": "Love this!❤️"}, {"username": "Kimberly Lampros", "comment_text": "I had booked with them last year but they had to cancel because the sea was too rough. 😔 I would love to go back someday and experience their boat tour!"}]}, {"id": "2205827563149655", "text": "looking for some advice for Duomo Climb Florence:\n\nHoping to do the Duomo Climb whilst in Florence. Is there any tours that just do a climb rather than the full 3 hour tour? Just a bit tight on time, and looking for options in relation to tours?\n\nDoes anyone have any recommendations/ companies to contact or go through?\n\nThanks heaps :)", "link": "facebook.com/groups/1373361046396315/permalink/2205827563149655/", "likes": 1, "comments": [{"username": "Shirley Lewis", "comment_text": "I'm not sure why you need a tour, to skip the looooon line? 🙂 the duomo, baptistry,, opera museum may be skip the line ..."}, {"username": "Mike Crawford", "comment_text": "https://\nduomo.firenze.it\n/"}, {"username": "Desiree Dube", "comment_text": "You can buy a ticket just for the climb"}, {"username": "Gianna Onesi", "comment_text": "Doing one from get your guide Entry ticket you get audio guide"}, {"username": "Lushan Yao", "comment_text": "You don’t need a tour to climb the duomo. The duomo climb ticket is a timed entrance, and the experience takes less than an hour."}, {"username": "Molly Elizabeth", "comment_text": "https://\noperaduomofirenz\ne.skiperformanc\ne.com/en/\nstore#/en/buy\nDon't need a tour - buy a pass. We got the Brunelleschi Pass so we could see it all over the course of a few days. Climbing the dome takes about an hour...depends on how much time you spend at the top and entrance is timed. We opted to go first thing in the morning and we were thankful we did."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2205830203149391", "text": "One more dinner to book in Sorrento. Already have O'Parrucchiano La Favorita booked.\nWhat other restaurants are not to be missed in Sorrento?", "link": "facebook.com/groups/1373361046396315/permalink/2205830203149391/", "likes": 6, "comments": [{"username": "Kally Trahearn", "comment_text": "La Cantinaccia del Popolo - not high end but definitely a favourite of the locals. Google it, read the reviews. You will not be disappointed. You can't reserve, so get there early and expect to wait until a table is free for the size of your party.\n\nEnjoy xx"}, {"username": "Nicole Lee", "comment_text": "Donna sofia!"}, {"username": "Nancy Brennan Carrow", "comment_text": "Tavern Allegra"}, {"username": "Liz Marikian-Falvey", "comment_text": "Taverna Allegra"}, {"username": "Amanda Monique Bartz", "comment_text": "Tammy Turalitsch"}, {"username": "Beth Padva Monahan", "comment_text": "Bagni Delfino was one of our favorites when we were in Sorrento last week. It’s on the water and the food was delicious!"}, {"username": "Lindsey Dingman", "comment_text": "Aurora"}, {"username": "Danielle Gervais", "comment_text": "The buffet or restaurant on the terrace of the grand Excelsior Victoria hotel! Wonderful food with a view of Naples’ golf, the Vesuvio and Capri"}]}, {"id": "2205836926482052", "text": "Hi everyone, we plan to rent a car from Florence and make our way to Venice (where we fly out of) for the the last leg of your trip. We are wondering about recommendations to stop along the way? Would you recommend making our way along the east coast or stay more central?", "link": "facebook.com/groups/1373361046396315/permalink/2205836926482052/", "likes": 1, "comments": [{"username": "Veronica Parravicini", "comment_text": "I’d say Bologna: you HAVE to have lunch here!!! Tortellini, ragù alla bolognese, lasagne\nAnd then Padova or Ferrara\nYou can also go to Ravenna on the coast but it’s time consuming"}]}, {"id": "2205832379815840", "text": "any suggestions on places to stay in Lake Como that are affordable for 1 night rather than staying in Milan? Near trains/buses from Milan Bergamo airport would be ideal, will be taking train to Florence next day at some point too.", "link": "facebook.com/groups/1373361046396315/permalink/2205832379815840/", "likes": 0, "comments": []}, {"id": "2205837499815328", "text": "Is this a good spot to stay in Florence?", "link": "facebook.com/groups/1373361046396315/permalink/2205837499815328/", "likes": 10, "comments": [{"username": "Markie MK", "comment_text": "I have been in Florence several times. If it’s your first time stay in the small circle I added which is very central. On the other side of the water."}, {"username": "Jim Hooper", "comment_text": "We stayed in that general area in April and had no issues. Everything is walkable. We had balcony on Arno and loved it."}, {"username": "Shirley Lewis", "comment_text": "the map is very difficult to read and the black circle obliterates the church Santa Maria Novella, I'm assuming, your hotel is a ways from the center but Florence is very small so it may not be too far, walking across the center takes less than 30 minutes and the Duomo is 10 minutes walk from the train station. staying in the Oltrarno - other side of the river Arno - will be less touristy"}, {"username": "Саша Савино", "comment_text": "How many days in florence? For example If only 2nights its so far."}, {"username": "Brooke Dowling", "comment_text": "I stayed in that area with no issues last year"}, {"username": "Donna Dougherty", "comment_text": "At the St. Trinity bridge?"}, {"username": "Donna Dougherty", "comment_text": "Donna Dougherty"}, {"username": "Donna Dougherty", "comment_text": "By the looks of that circle you are close to here. We were there for 10 days. I"}, {"username": "Isobel Young", "comment_text": "we stayed just over the other side but we found that everything was so so close in florence! we walked between everything so i personally wouldn’t have an issue with that location"}, {"username": "Krissy DaRusso", "comment_text": "Florence is pretty easy to navigate! You’ll be fine there.\n\nTry Ditta Artiginale for coffee and breakfast. I’m obsessed with that place!"}, {"username": "Dale Adams Golden", "comment_text": "It’s a great area to stay! We like the south side of the river better and have stayed on Via Toscanella and Via d’Bardi twice. (Airbnbs)"}, {"username": "Kelly Relue", "comment_text": "Following"}, {"username": "Matthew David", "comment_text": "Stayed right here. Perfect location."}, {"username": "Pat Cray", "comment_text": "Try The Kraft Hotel\nLovely and safe"}, {"username": "Marisol Lopez-Nieves", "comment_text": "I would prefer close to Santa Maria Novella, the tranvia,to travel from the airport, the train station, and you will also be closer to the museums and Mercato."}, {"username": "Molly Elizabeth", "comment_text": "YES!!!!!"}, {"username": "Lisa Warnick Stewart", "comment_text": "That’s right about where we’re staying next month. We will be arriving in a car so thought it would be easier to deal with that being on the other side of the Arno yet super easy to walk to everything."}, {"username": "Heather Neal", "comment_text": "Following"}, {"username": "Ian Fawkner", "comment_text": "The best place to stay ‘In Firenze’ is Siena !"}, {"username": "Diana Subkova", "comment_text": "Yes, it is :)"}, {"username": "Lisa Ann", "comment_text": "Loved that area!!!!"}, {"username": "Lisa Ann", "comment_text": "Stay across the river. Where you’ve indicated. Everything is close by and within walking distance. I loved being away from the touristy spots during the evening. Walked everywhere, on both sides of the river, day and night."}]}, {"id": "2205838393148572", "text": "Tips for getting to/from/seeing Via Appia Antica without a tour?", "link": "facebook.com/groups/1373361046396315/permalink/2205838393148572/", "likes": 0, "comments": []}, {"id": "2205849536480791", "text": "My son will be in Venice for 2 full days…. Looking for great shopping and restaurant suggestions", "link": "facebook.com/groups/1373361046396315/permalink/2205849536480791/", "likes": 0, "comments": [{"username": "Tanya Luca Chetcuti", "comment_text": "F"}, {"username": "Helen Pottle", "comment_text": "I’m here at the moment. Probably depends what he wants to shop for. There are loads of shops everywhere."}, {"username": "Jay Parekh", "comment_text": "For restaurants, what’s he into? Majority of the restaurant menus are very similar."}, {"username": "Lindsey Brancher", "comment_text": "Depends on budget. My experience is: further back from St Mark’s square, the better the food. Guidecca is a gem!"}]}, {"id": "2205855359813542", "text": "Does anyone know of a Private driver that I could hire to take 2 of us from Florence to Tuscany for the day and provide us with a wine tour and drive us around the various regions?", "link": "facebook.com/groups/1373361046396315/permalink/2205855359813542/", "likes": 7, "comments": [{"username": "Dafne Vassetti", "comment_text": "Get in touch with Ciao Florence. They will provide the private driver + the wine tasting."}, {"username": "Dafne Vassetti", "comment_text": "Ps. Florence is in Tuscany!! It's the capital city of the region Tuscany. So you can't drive from Florence to Tuscany."}, {"username": "Heather Hills Jacobs", "comment_text": "Try Venice Group Services!"}, {"username": "Valerie Collanton", "comment_text": "We used Florence Limousine Service. We toured and had lunch at one winery and a tasting at a second winery. It was amazing. And very reasonably priced. You can get in touch with them by emailing info@florenceli\nmousineservice.\ncom"}, {"username": "Kate Laidlaw", "comment_text": "We just did an excellent tour with Grape Tours. From Florence we visited 3 small wineries including cellar tour, lunch, olive oil and a dairy. There were 6 pax (two other couples) way cheaper than private."}, {"username": "Jill Wolder", "comment_text": "Ask the concierge to make arrangements for you. This is especially important so it goes on record where and with whom you are. You are just not being escorted around by anyone."}, {"username": "Kim Geary Keidel", "comment_text": "Belitaly Tours. Got the name from this or another FB group. Beki was amazing. (It’s just him and his wife that do the tours.)"}, {"username": "Paula Ann", "comment_text": "We used the Viator app (there’s also a website if you don’t do apps) for all of our tours."}, {"username": "Pamela Sheldon Johns", "comment_text": "info@bespokeita\nliantours.com Giuliano or Niccolo"}, {"username": "Penny Bouchard", "comment_text": "Check out Joe banana tours. We used them once for a day trip and they were great"}, {"username": "Tara Doyle", "comment_text": "We have booked with Banana Joe for all our transfers and tours coming up in September. I can’t speak for yours yet but the customer service is OUTSTANDING!!! Anything you want they make happen!"}, {"username": "Kimberly MacKinnon Cherry", "comment_text": "Look at Viator"}, {"username": "Mary Lou Balistreri Bradley", "comment_text": "Take Grape Tours “Super Chianti” tour. My daughter and I did this and it was excellent. Two awesome wineries and a fabulous lunch at Dario Cecchini’s restaurant. Highly recommend. It was about 450 Euros for the two of us and transportation included."}, {"username": "Gwyn Schmalz Hay", "comment_text": "Tuscan Trails..5 star rating. He'll design the tour anyway you want..Todd is awesome.\nhttps://\ntuscantrails.com\n/about-us"}, {"username": "Lisa Zink Krebs", "comment_text": "Dena Brookhart WhitenerDonna Wood Robbins lots of tour options with transportation"}, {"username": "Fiona Cameron", "comment_text": "Have a look on Viator"}, {"username": "Juli Fields", "comment_text": "I highly recommend Giovanni at https://\nwww.thetuscanwan\nderer.com/ Always a wonderful experience."}, {"username": "Sherry Held", "comment_text": "Tuscantourguide\n.Com\nPaul Costa"}, {"username": "Karen Renzoni Monteleone", "comment_text": "All Around Tuscany…Lorenzo\nis great! He has a Facebook page and you could message."}, {"username": "Bethany Rudy", "comment_text": "https://\nwww.sommeliersch\noices.com/ Tom is awesome!"}]}, {"id": "2205862156479529", "text": "Our last night in Venice! Magical! Video from the Rialto Bridge on 8.2.23 @ 9:15PM.", "link": "facebook.com/groups/1373361046396315/permalink/2205862156479529/", "likes": 9, "comments": []}, {"id": "2205863963146015", "text": "Can anyone tell me what time of day the night tour tickets for the colosseum are released each day? I called to ask but my Italian is so poor I didn’t really get an answer. And are English tours given as many times per week as the Italian ones? The two night options don’t appear to show the same available dates. Help please! TIA", "link": "facebook.com/groups/1373361046396315/permalink/2205863963146015/", "likes": 1, "comments": [{"username": "Sunny Lang Fan", "comment_text": "Following"}, {"username": "Karen Blackmore", "comment_text": "I never quite worked out the exact time but it's approx the time of the tours Italian time. 30d before. Sometimes more released 7 days before. The Italian tour has more availablity and people on here have used Google translate! And someone said their Italian tour ended up in English, as no-one was Italian! Good luck"}, {"username": "Melissa Hunt", "comment_text": "If you’re looking for the night tour in September or after, it looks like they don’t offer it beyond August 31. I tried emailing them twice with no response. I had the concierge at our hotel call them and all they said was at 30 days you can see what tours are available. Well we’re at 30 days from Sep 2 and no tickets were even opened up for either the English or Italian night tour on sep 1 or 2."}]}, {"id": "2205864819812596", "text": "Looking to book our air for July 2024, which airline would you recommend? Flying out of Toronto to Rome.\nThanks 😊", "link": "facebook.com/groups/1373361046396315/permalink/2205864819812596/", "likes": 0, "comments": [{"username": "Liz Hanson McCullough", "comment_text": "We are going Air Canada because we had points to use, but when we were checking flights a few months ago, Air Transat had some better prices than AC."}, {"username": "Sima Veiner", "comment_text": "Westjet has direct flights to Rome!"}, {"username": "Nadia Filice", "comment_text": "Air Canada or air Transat"}, {"username": "Melissa McCormick", "comment_text": "We flew Air France. Our flight was cancelled 3 hours before we left out of Toronto 😭 they got us on another flight leaving same time next day with Delta. Our flights home with airfrance were great. They did manage to get all our seats together (7) of us on the delta flights the next day and gave us a hotel and food. However we still have not gotten any kind of reconciliation on the cancelled flight and I contacted them a month ago and several times in between. I would go aircanada or Delta if I booked again! Not airfrance although airfrance is associated with delta."}, {"username": "Annick Boux", "comment_text": "Air Canada"}, {"username": "Paola Iampietro", "comment_text": "Air Transat"}, {"username": "Mary Fortura", "comment_text": "Check Flight Hub or Skyscanner and book with a reputable airline. Air Canada, Air France, Lufthansa, Westjet."}, {"username": "Melissa Reyes", "comment_text": "We had a good experience with American"}, {"username": "Karen Schmidt", "comment_text": "Any of the major airlines that have the price, and especially the itinerary that you want. They are all usually only a couple hundred or so apart from each other and relatively the same with service. If you can fly direct…that’s always better"}, {"username": "Dana Marie", "comment_text": "The cheap one"}, {"username": "Paula Brink", "comment_text": "Air Canada"}, {"username": "Rhonda Kurbis", "comment_text": "Air France if it’s a available"}]}, {"id": "2205864719812606", "text": "We have a very late flight into Venice. Any recommendations on hotels that are attached or easy walking distance to the airport? Or will we have no issue getting to a hotel in Venice at midnight? What is best transportation to use that late?", "link": "facebook.com/groups/1373361046396315/permalink/2205864719812606/", "likes": 0, "comments": [{"username": "Colleen Robinson", "comment_text": "Taxis run every 15 min throughout the night and drop off location is by the bus stops. If you already booked a hotel, you walk with your luggage to your hotel if it's close."}, {"username": "Kit Nader", "comment_text": "Road taxi or water taxi. Water taxi can get you very very close to your venice hotel . BUT you need a hotel with or near a water Dock and 24 hour check in. I'll recommend hotel columbina to you ...I've stayed there its very nice 24 hour desk AND has a water Dock. So once out of the passport control at the airport ...you walk to the airport dock ( 5 mins) and there you can get a water taxi and be settled in your hotel 30 to 40 mins later. Its pricey but worth it ... 130 to 150 euros. Have a great trip. X"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Depends on where your hotel is located."}, {"username": "Karen Schmidt", "comment_text": "We arrived at midnight in December one year because our plane was delayed. Caught the water taxi to the closest stop near our Airbnb, and walked the rest of the way . Got completely lost…but a nice local man showed us the way."}, {"username": "Tony-Annette Unpingco Ada", "comment_text": "Just to let you know, the airport is quite a distance from the hotels. You may want to consider changing your arrival in venice and arriving in the afternoon to early evening to give you more options for transportation.\nOtherwise, your options and cost of transportation will be limited."}]}, {"id": "2205865686479176", "text": "On carrying passports, which seems to be the most common question (and disagreed on topic) on this site...\nThe reason people keep asking is because there doesn't seem to be a clear definitive answer. You would almost need to be an Italian-speaking lawyer to understand the fine print of DLGS 286/1998 (Consolidated Immigration Act).\nPer Rick Steves (https://www.ricksteves.com/travel-tips/trip-planning/travel-documents) keep your passport in your moneybelt and if you're asked to show it, put it immediately back in your moneybelt.\nPer the Italian Ministry of Foreign Affairs: For entry, stay or transit in Italy, foreign nationals shall be in possession of a passport or another travel document recognised by the Italian government. (A photocopy of your passport is NOT listed as a travel document recognized by the Italian government.)(https://www.esteri.it/en/servizi-consolari-e-visti/ingressosoggiornoinitalia/passaporti_documenti/)\nI could not find a single credible source that said photocopies are acceptable (plenty of travel websites say it's ok... they are not official government websites).\nI guess based on this, and the fact that we have read that hotel safes are not the most secure, I'll be carrying my passport with me at all times.\nTo each his own decision! Sorry so long!", "link": "facebook.com/groups/1373361046396315/permalink/2205865686479176/", "likes": 1, "comments": []}, {"id": "2205867446479000", "text": "Which golf cart company do you recommend? We have 8 people so could do 1 cart or 2. Looking for a 2-4 hour tour late afternoon or evening.", "link": "facebook.com/groups/1373361046396315/permalink/2205867446479000/", "likes": 0, "comments": [{"username": "Christine Sanci-Gentile", "comment_text": "Mybesttour.com"}, {"username": "Linda Chase", "comment_text": "We loved our tour with LivTours"}]}, {"id": "2205872616478483", "text": "What are Rome’s must sees at night and is it safe to go about in the evening with a group on your own?", "link": "facebook.com/groups/1373361046396315/permalink/2205872616478483/", "likes": 1, "comments": [{"username": "Gena Diaco Penland", "comment_text": "Trastavere is a great neighborhood to walk in with tons of restaurants, bars and shoos. We walked around until almost 11 every night with no issues at all! Felt completely safe!"}, {"username": "Gary Fossaceca", "comment_text": "Italy is completely safe! Have fun and don’t worry about your safety."}, {"username": "Marty Harte", "comment_text": "Very safe if you have your wits about you. Just came back last night after a week in Rome. By week’s end I was fine to let my teens wander on own a bit. They have the street smarts. Trastevere area for sure, Tonnarello was awesome for dinner. This is side view of restaurant. Main portion mostly outside around corner."}, {"username": "Cindy Sguazzin", "comment_text": "Oh wow—I’m suffering a bad case of nostalgia!"}]}, {"id": "2205875406478204", "text": "Going to Italy in mid April. Our Hub is Rome. We are taking a day trip to Florence & another to Pompeii. We had a plan to day trip to Naples but am not sure it is worth it just to try pizza where it was created. Any suggestions of other places to day trip? We don’t drink so the vineyard idea is not our scene. Not sure the logistics getting to something like Amalfi make sense but open to suggestions. Thanks in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2205875406478204/", "likes": 4, "comments": [{"username": "Lucrezia Folger", "comment_text": "Florence should be more than a day trip. However, Orvieto (1 hour from Roma) and Villa d’Este in Tivoli are breathtaking."}, {"username": "Clare Davison", "comment_text": "Orvieto?"}, {"username": "David Johnson", "comment_text": "Napolitan pizza is not only the least expensive (5€ instead of 12€ for a margherita compared to the north) but it also tastes the best in my opinion. You’ll be passing through Naples on the way to Pompeii anyway, so why not stop? Naples is huge with lots of wonderful things to do and see"}, {"username": "Elizabeth Erickson", "comment_text": "Florence for a day? It’s not a day trip. You don’t mention how long you will be in Italy. Florence is at least a 3 day trip. If you have a week, 3 days in Rome, 3 days in Florence and a day for traveling and settling in. If you are staying longer, add Pompeii. Naples is wonderful but not for a day. It takes time to get settled in Naples."}, {"username": "Valerie Collanton", "comment_text": "I would go to Naples after Pompeii. Have amazing pizza and then go to the archeological museum where Pompeii artifacts reside.\n\nhttps://\nnaplespompeii.co\nm/\narchaeological-m\nuseum.html"}, {"username": "Fetchin Gretchen", "comment_text": "If you wish to base in Rome and do day trips I highly recommend you maximize your time by booking those trip over the Get Your Guide app! Otherwise you will waste too much time in transport around. Skip Florence if only have a day. I lived there 3 months and it was not enough."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Most day trips are not worth much in my opinion. Go there, stay two or three nights."}, {"username": "Madeline Caporale", "comment_text": "You might also consider a day trip to Siena by train from Rome. It would likely be a very long day, and you might consider spending overnight in Siena. The duomo there is fabulous and lots of shops and other sights as well."}, {"username": "Rebecca R. Russo", "comment_text": "Naples YES!!"}, {"username": "Liz Cottrell", "comment_text": "Ooooo perfect time to go. Before the heat and the monstrous crowds"}, {"username": "Tracy Foss", "comment_text": "Florence on the fast train?"}, {"username": "Marty Harte", "comment_text": "Just did Rome home base last week. Day trip to Florence a must. We did Pisa 1+ hours then over to Florence on Viator✔️\nNaples we took the bullet train to try some pizza. L’Anteca da Michelle and walk some neighborhoods. Was going to head to Sorbillo for another taste but After a half day we went back to station and got an earlier train. 1/2 day is plenty IMO if not doing excursions to Capri etc.\n\nWe did an excursion by bus 7am left Rome for Salerno then ferry to Positano for 3 hours, then ferry to Amalfi for 2 then back to Salerno then bus home. LONG day back by 11. I enjoyed it just for the small taste of the beaches and shops."}, {"username": "Cindy Sguazzin", "comment_text": "You will never regret a visit to Tivoli, not only historically fascinating, but stunningly beautiful!"}, {"username": "Pat Cray", "comment_text": "Stay longer in Florence it is beautiful! Also, take a train to Sorrento then ferry to the Amalfi coast…. You won’t want to miss it! Skip Naples!!!"}, {"username": "Jeff McLellan", "comment_text": "We were in Florence for three nights at the start of our trip and wished we had stayed even longer. Of all the places we went we agree that one day in Florence would not be worth doing unless there is no way you will ever go back to Italy."}, {"username": "John Licata", "comment_text": "Spend that day in Rome"}, {"username": "Pate Mears", "comment_text": "I love Italy, but I would skip Naples. Positano is very nice and beautiful - a day trip there could be special."}, {"username": "Grace Scinto", "comment_text": "They would be extremely long days with over 4 hours of travel. Maybe rethink your plan?"}, {"username": "Sara Punis", "comment_text": "Napoli is not just pizza, is much much more"}, {"username": "Marcella Mayoya", "comment_text": "Amalfi, Capri is a must"}, {"username": "Judy Carey", "comment_text": "Untold Italy recommends going to Ostia Antica over Pompeii as a day trip from Rome. Maybe check out their website / podcast? They are a great resource."}, {"username": "Elena Eckley", "comment_text": "Tivoli and Via del Esta. LAquila Gran Sasso National Park about 2 hours"}]}, {"id": "2205878129811265", "text": "What is better for seeing scenery, the bus or the ferry from Como to Bellagio?", "link": "facebook.com/groups/1373361046396315/permalink/2205878129811265/", "likes": 10, "comments": [{"username": "Stefania Barou", "comment_text": "It is very nice to go by bus Como_ Bellagio and continue by ferry"}, {"username": "Gordon Cooper", "comment_text": "We caught the local bus from Como to Bellagio. It was great because you get to see all the small towns along the way and you can get off at any stop along the way.\nIt was also quicker than the ferry. Of course, the scenery is different than photos from the ferry but we went for experience.\nFYI - on the bus we went through the home town of the famous Moto Guzzi motercycles and saw a few other interesting sights along the way.\nA suggestion for you- bus there and ferry back."}, {"username": "Pam Armenia O'Brien", "comment_text": "Love the ferry. Views are spectacular. Make sure you know whether you are on the fast or slow ferry."}, {"username": "Michelle Kreutzer", "comment_text": "Definitely the ferry! Bellagio is beautiful😊"}, {"username": "Sue Milo Snider", "comment_text": "Private boat!"}, {"username": "Lynne Meyer", "comment_text": "Ferry"}, {"username": "Russell Weidner", "comment_text": "We always have taken the ferrys"}, {"username": "Colleen Corner", "comment_text": "Ferry for sure"}, {"username": "Michele Baron Vold", "comment_text": "Ferry"}, {"username": "Salome Nakashidze", "comment_text": "We took the ferry from Como to Bellagio and returned by bus.Both wa great."}, {"username": "Romy Coops", "comment_text": "Both are nice so take one one way and the other the other way. Bus gives you close up of villages looking down on lake. Boat gives you a view from the lake looking up."}, {"username": "Rick Schneider", "comment_text": "Ferry ⛴️"}, {"username": "Nancy Lewis", "comment_text": "Ferry. Ferry. Ferry. Ferry"}, {"username": "Lynn Macri", "comment_text": "Ferry"}, {"username": "Candice Lynn", "comment_text": "ferry for sure"}, {"username": "Robyn Green", "comment_text": "Ferry"}, {"username": "Iliana Zlatareva", "comment_text": "Boat"}, {"username": "Tom O'Hara", "comment_text": "You won't see anything with the bus."}, {"username": "Julie Salathiel", "comment_text": "Thank you all …looks like its the ferry! We are actually staying at Lierna on the other bank so well go the whole way on the ferry. ⛴️"}, {"username": "Cindy Galle", "comment_text": "We plan just a stop in Como. Is the cable tour between Como and Brunate worthwhile?"}, {"username": "Karen Martinez", "comment_text": "Choosing between bus and ferry, pls take the ferry. We took the bus last week from\nLezzeno to Como (yes coming back) and the roads are tight and winding. Bellagio is just more north of Lezzeno. Not even 20 minutes and I was so nauseated and threw up. There was another young lady looking so pale and was obviously nauseous too. Good thing I had a sick bag with me.\nGoing to Bellagio, Our airbnb suggested to take a train from Milan Malpensa airport to Milano Central then another train from Milano Central to Varenna. From Varenna we took a ferry to Bellagio, where we stayed.\nOn our way back to Milan we took a ferry fr Bellagio to Lezzeno where we spent one night. Took the bus from Lezzeno to Como. A mistake for a person with motion-sickness\nlike me.\nIf we will do it again, we would choose the ferry going back to Como instead."}, {"username": "Salvatore Giardina", "comment_text": "Ferry"}, {"username": "Horace Clinard", "comment_text": "We've booked this bus and ferry combination. Bus from Como to Lugano Switzerland, then ferry to Bellagio, and then another ferry back to Como. Perhaps someone has taken this tour and can comment on it?"}, {"username": "Dayna Scinto", "comment_text": "Ferry ⛴️ , it can take nearly 3hours on a slow ferry though fyi. 🇮🇹🫶🏼"}, {"username": "Beth Spiehler Selvia", "comment_text": "Ferry for sure!"}, {"username": "Vicki Kreymborg Sweeney", "comment_text": "We took both and loved the boat best"}, {"username": "Beata Zabek", "comment_text": "Ferry most definitely"}, {"username": "Beverley Davies", "comment_text": "Ferry all the time."}, {"username": "Vadim Gotovsky", "comment_text": "Be careful, I always fall asleep on a bus"}, {"username": "Alejandro Gabriel Valenzuela Anghileri", "comment_text": "Ferry"}, {"username": "Katy Moy", "comment_text": "Go on the ferry! The bus will do no justice to the beauty around you and you will miss the majesty of lake como"}, {"username": "Roger Pajo", "comment_text": "Two different view points…both are exceptional"}, {"username": "Kris Locatelli", "comment_text": "We always take the ferry. I love the view while on the lake!"}, {"username": "Nina Hod", "comment_text": "Ferry!"}, {"username": "Karyn McCluskey", "comment_text": "Take ferry we waited 1 hour bus full had to get Taxi 145 euro later ."}, {"username": "Roland Trego", "comment_text": "For me, always the ferries. Riding them is actually my favorite part of visiting Lake Como."}, {"username": "Ingrid Tangredi", "comment_text": "Ferry for sure 🤩"}, {"username": "John Bruckman", "comment_text": "Ferry"}, {"username": "Sara Kyle Hargett", "comment_text": "Ferry"}, {"username": "Kim Perrone Barraco", "comment_text": "I would not take the bus!"}]}, {"id": "2205881269810951", "text": "I’m travelling solo to Rome, Assisi and Florence in a couple of weeks and have a dodgy knee and was wondering if anyone knew of golf buggy tours in these places where a single can join a group and not have to pay for their own tour? Thanks 😊", "link": "facebook.com/groups/1373361046396315/permalink/2205881269810951/", "likes": 0, "comments": []}, {"id": "2205891569809921", "text": "You need to read this and decide what kind of transportation you need to buy in Venice. For 2-3 day passes starts from the time you validate your ticket.", "link": "facebook.com/groups/1373361046396315/permalink/2205891569809921/", "likes": 7, "comments": []}, {"id": "2205893193143092", "text": "Has anyone done a Tuscany vespa tour? If so, did you have prior vespa experience? Was it an easy ride? Never driven one before but really want to do one of these tours while in Siena. Does anyone have a tour company they would recommend? I would love a winery/vespa tour but not sure wine and me on a vespa would mix well. But I will try (almost) anything once.", "link": "facebook.com/groups/1373361046396315/permalink/2205893193143092/", "likes": 0, "comments": [{"username": "Elizabeth Zavala-Castrillo", "comment_text": "There's another FB for Tuscany Florence area-- someone posted they did that tour and it was a lot of fun"}]}, {"id": "2205880213144390", "text": "Are you ready to take an unforgettable virtual journey through Naples and the Royal Palace of Caserta? You will discover the Royal Palace of Caserta, a UNESCO World Heritage site, also known as the Italianआणखी Versailles, celebrated for its Baroque style and considered the largest royal residence in the world by volume. You will have the chance to walk virtually through the rich rooms of this magnificent palace and admire the spectacular fountains and sculptures that adorn the fabulous royal gardens.\nJoin our virtual experience: https://nextstop-italy.com/virtual-tours/naples-royal-palace-caserta/\n\n#italyiloveyou #art #italytravel #italytrip #italygram #history #virtualworld #VirtualTour #vacationmood #naples #naplesitaly #naplesinsider #caserta #casertaitaly #casertapalace #amalfi #amalficoast #amalficoastitaly #napoli #royalpalaceofcaserta #royalpalace #royalpalace", "link": "facebook.com/groups/1373361046396315/permalink/2205880213144390/", "likes": 4, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2169006096831802", "text": "✨Capri✨\n❤️Capri, the blue island, is a true paradise to discover and it is a perfect destination for your holidays! ✨Rich in history, glamour and beauty, Capri is the perfect size for a couple of days’… आणखी exploring.\nThe best luxury hotel: Punta Tragara 5*\n🤩The entire island from a terrace. The views from Punta Tragara are endless: the spectacular Faraglioni rocks, enchanting Marina Piccola, the white contours of Capri, the wonderful light of dawn embracing the sea and the quietly romantic sunsets. 😍All the bustle and vitality of Capri’s historic Piazzetta is just a fifteen-minute stroll away along Via Tragara and Via Caramelle\n👉Book here for the best price: https://www.tkqlhce.com/click-100692842-11552042?url=https%3A%2F%2Fwww.tripadvisor.com%2FHotel_Review-g187783-d235948-Reviews-Punta_Tragara-Capri_Island_of_Capri_Province_of_Naples_Campania.html", "link": "facebook.com/groups/1373361046396315/permalink/2169006096831802/", "likes": 62, "comments": [{"username": "Matt-Kathy Stavely", "comment_text": "Breathtaking!"}, {"username": "Rikki Golding", "comment_text": "Steve Golding"}, {"username": "Diane Ramsey Baker", "comment_text": "Margaret Krier"}]}, {"id": "2205297959869282", "text": "Hello, Planning an overnight visit to Lake Garda. Has anyone stayed at Hotel San Marco and could give thoughts on it please? Was it easy to do bike rentals and get to other places from that location? Thank you very much", "link": "facebook.com/groups/1373361046396315/permalink/2205297959869282/", "likes": 2, "comments": []}, {"id": "2205323103200101", "text": "A group of 13 ladies are travelling to Sorrento in October for 3 nights. Would love some advice on how best to spend our tme there .We are staying in an apartment near the train station. We have thought of hiring a private company for a day sightseeing trip. If anyone has any suggestions. Also we would like to visit one of the islands as well as taking in the atmosphere of Sorrento.\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2205323103200101/", "likes": 0, "comments": [{"username": "Donna Austin Jones", "comment_text": "Are you planning a day trip to Capri? It’s so beautiful!"}, {"username": "Coral Musgrave", "comment_text": "There's a walking food tour I did a few years ago in Sorrento. It was very good."}]}, {"id": "2205380449861033", "text": "In Rome 3 days so far and having a great time! We are staying in a 2-bedroom apartment near the Colosseum. It is wonderful to have the extra space of an apartment, and we are near everything! I booked itआणखी through Booking.com.\n\nA question: I will visit the Borghese gallery using the Big Bus hop on hop off tour. I already have my ticket to the gallery, for 2 pm tomorrow. It seems like a long walk from the bus stop to the gallery building. Anyone do the trip? How much time should I allocate for it? Grazie!", "link": "facebook.com/groups/1373361046396315/permalink/2205380449861033/", "likes": 1, "comments": [{"username": "Sunny Lang Fan", "comment_text": "would you mind sharing the link of the apartment that you stay when you are done with Rome ? Will be traveling there in Nov."}, {"username": "Tina Berthelot", "comment_text": "I took just the regular local bus from where I stayed and that dropped us very close. Sorry, I cannot give any feedback on the hop on hop off bus."}]}, {"id": "2205430839855994", "text": "Rimini 💖", "link": "facebook.com/groups/1373361046396315/permalink/2205430839855994/", "likes": 4, "comments": [{"username": "Aranya Charo", "comment_text": "Wow! Amazing!"}]}, {"id": "2205432519855826", "text": "Beautiful Venice, Italy 🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2205432519855826/", "likes": 1, "comments": []}, {"id": "2205452506520494", "text": "We are planning to go to Italy in December. Where will there be good Christmas markets and where can we go skiing. Also which city would be the best to spend Christmas Day. Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2205452506520494/", "likes": 1, "comments": [{"username": "Veronica Parravicini", "comment_text": "Definitely in Alto Adige, Dolomiti\nYou’ll fine the best vibes in my opinion. Although it’s expensive"}, {"username": "Kristina Ruk", "comment_text": "Skiing I would suggest Selva de Valgardena area (Santa Christina area more if you are experienced skier). But Sella de la Ronda cable system can get you round in Dolomites ;)it got expensive after Covid but the view of Dolomites are stunning."}, {"username": "Heidi Littman Meiers", "comment_text": "Val Gardena or Cortina"}, {"username": "D'Anna Hohe", "comment_text": "Bolzano and Trento. Florence has a decent one but not as good as those further north. And the ones in Germany are definitely more impressive, so I hope you aren’t going to Italy only for that reason."}]}, {"id": "2205493926516352", "text": "Any recommendations for coliseum night tours? If so; any links ?\n\nI’ve seen a couple posts on it and looks like a cool experience. Also, has anyone done one before and have any feedback?", "link": "facebook.com/groups/1373361046396315/permalink/2205493926516352/", "likes": 1, "comments": [{"username": "Jenn Messina Babore", "comment_text": "Book direct through Coopculture.it\n\nDefinitely worth doing. It’s like a private tour of the Colosseum as there is almost no one else there."}, {"username": "Jenn Messina Babore", "comment_text": "Jenn Messina Babore"}, {"username": "Gwen Roberts Baker", "comment_text": "Following"}]}, {"id": "2205483386517406", "text": "So we are heading to Venice soon..\nAm I reading right, because I'm totally unaware of this...\nIs it right you have to carry your passport on you at all times?... If this IS correct, can you just take a screenshot of your passport on your mobile as a form of ID?....\n\nMight I add, I am from the UK, we are not used to rules like this, nor have everआणखी heard of them....so for the smart people who laugh at this question.. you leave me astounded at your childish behaviour!\n\n** In all fairness I think Travel agents worldwide should be informing their customers, & have a responsibility of informing customers of this law when travelling to Italy **", "link": "facebook.com/groups/1373361046396315/permalink/2205483386517406/", "likes": 12, "comments": [{"username": "Ka Ben", "comment_text": "We moved to Southern Italy a couple of months ago. Met a couple of foreigners here that were walking around and got stopped and was asked for identification.\n(I can’t remember if it was the polizia or carabinieri) One didn’t have her passport with her. She pointed that she was staying at a nearby B&B. (Walking distance from where they were at) They asked her to get it and show it to them.\nI, personally, have not gotten stopped or asked for identification.\nBut I do carry identification documents everytime I step out."}, {"username": "Janine Emma Lucas", "comment_text": "Yes.\n\nAccording to the law DLGS N. 286 of July 25th, 1998, it is mandatory that you always carry an international identification document (your passport) whenever you are in Italy."}, {"username": "Valerie Collanton", "comment_text": "This really isn’t a big deal. Make a copy of your passport. Keep the copy somewhere safe. Carry your passport with you. If something happens (which I never have experienced in over 40 years of traveling to Italy) you will have your copy to get a replacement. I would stop worrying and just enjoy my trip."}, {"username": "Frank Dragna", "comment_text": "Legally, you are required to carry it. We never did. If you are traveling by train, might be a good idea to have it. Plane, you obviously have it."}, {"username": "Robin Darmstadt Mancil", "comment_text": "It is a law but you can carry a copy I just read."}, {"username": "Renee Rogers Tarrant", "comment_text": "You can take a copy and use that"}, {"username": "Amy So", "comment_text": "I made a color copy of my passport and take picture of the stamped page if there is any on my phone. If I take a train to go to other city (from Florence to Lucca/Pisa) I took our physical passport with us."}, {"username": "Audra Love", "comment_text": "We were there recently and not one person asked to see ours (except maybe a tour person)"}, {"username": "Bellafab Fabrizio", "comment_text": "Never have carried them not even once on any trip. I had photos on my phone"}, {"username": "Ilse Van Linden", "comment_text": "I guess you have to carry always some kind of identification whenever en wherever you are … if you are careful with your stuff here in Venice, nothing will happen 🤷‍♀️ just enjoy your trip"}, {"username": "Pat Cray", "comment_text": "Yes! Must have your passport!"}, {"username": "Maja Molnar", "comment_text": "You need ID on you at all times, everywhere. And passport is unique ID"}, {"username": "Tracey Fairbrother", "comment_text": "It is law to carry your passport a copy or screenshot isn't going to be enough for police checks which are random especially on public transport"}, {"username": "Anthony Sperduti", "comment_text": "DO NOT CARRY YOUR PASSPORT"}, {"username": "Zeeshan Asghar", "comment_text": "Always keep your original documents with you.\nI get that some people here look \"privileged\" enough to not even be asked.\n\nHowever, the moment you're asked and you don't have it on you, you're in trouble. You'll be fined or worse (detention, investigation, and jailed until they find out who you are etc.)\n\nDon't let something preventable ruin your experience.\n\nP.S: I know people who were deported for not carrying their original identification,\nbut maybe because of their ethnicity, we all know the inclusiveness of the west.:)"}, {"username": "Aurora Sottovia- Arguiarro", "comment_text": "Not sure why this is funny and not serious to some."}, {"username": "Michelle Middleton", "comment_text": "What a great way to encourage identity theft... System is flawed !"}, {"username": "Susan Levings", "comment_text": "Been in many different parts of Italy.. ,never been asked for my passport…but I do have a photo of it on my phone.. .just in case"}, {"username": "Nancy Caruso Watts", "comment_text": "So many will tell you don't worry, we were stopped twice and each time saw another family and couple get fined for not having it on their person.\n\nThe officers i spoke to were really annoyed at the amount of people not following a simple rule. They are over people not following their rules."}, {"username": "Frances Barnes", "comment_text": "Remember, we no longer have the luxury of freedom of movement, so I'm guessing you'll need a copy of the entry stamp too🤷🏻‍♀️"}, {"username": "Pam Villies Trikolas", "comment_text": "We had our passports on us at all times. I carried them in my crossbody."}, {"username": "Judith Pishnery", "comment_text": "I never carry my passport but do have a printed copy and a digital copy on my phone"}, {"username": "Carrie Jaquess", "comment_text": "If the fact that it's the LAW to carry your original passport isn't enough to convince you, consider this: In the rare event of a local or national emergency (earthquake, terrorist bombing, etc.) and you cannot get back to your hotel to retrieve your original passport, it will be more difficult to get help and support you need from the US Embassy. I've also heard that it can be difficult to get the medical attention you need in the event of an accident without your original passport which actually serves as your official ID when you're overseas."}, {"username": "Michael Albertsen", "comment_text": "We are in Treporti right now, close to Venice.\nI showed my passport at the car rental and where we are staying.\nNo where else, not even in the airport’s 🤷🏼‍♂️"}, {"username": "Diana Radin", "comment_text": "We were in Italy for almost 3 months. Carried our passports everyday with no problem… Venice is amazing, enjoy your holiday, you’re going to the most beautiful place on earth!"}, {"username": "Lorraine Swick Sanfilippo", "comment_text": "Is this for EU countries?"}, {"username": "Irene Oda", "comment_text": "You must have some kind of identification on you. Do you not have an ID card in the UK? In Europe there is."}, {"username": "Debbie Milne Jenkins", "comment_text": "I’ve traveled fairly extensively throughout Europe including Italy and have never been asked for my passport. I do have a photo of it in my phone but my experience has been that it’s much safer in the hotel safe."}, {"username": "Elaine Jefford", "comment_text": "I am from UK too been to Italy about 20 times, never carry my passport with me and never been asked for it??"}, {"username": "Eva Salas", "comment_text": "No, I did not carry my passport in Venice. It stayed in the safe, in Milan, Florence and Rome too."}, {"username": "Brenno Bianchi", "comment_text": "The law states (DLGS 286/1998) at article 6.3 that a forigner must provide a passaport whenever asked by a police officer, otherwise there could be a 2000€ of fine or up to 1 year in jail. A copy could be fine (usually it is) but in theory it's not, you are at the mercy of the policeman."}, {"username": "Kay Matthews", "comment_text": "Didn’t even realise this rule till I joined this page. We were in Venice 4 days couple of weeks ago and never carried our passport. Stayed in hotel safe!\nWasn’t asked for it at all"}, {"username": "Jill Medrano Casey", "comment_text": "Here is info from the translated version of the law: \"((3. The alien that, upon the request of officials and police agents, does not comply, without justified reason, with the order to exhibit passport or other\nidentification document and residence permit or other document certifying the\nlegal presence on the State’s territory is punished with arrest up to one yearand with a fine up to Euros 2,000)).\"\n\nAs said above, it is up to you if you feel you should carry it out not. I did sometimes, but didn't have it when I went to the emergency room where a copy was fine."}, {"username": "Krissy DaRusso", "comment_text": "Always carry mine. I’ve been stopped on trains for passport checks. Seems pretty routine here."}, {"username": "Jenn Messina Babore", "comment_text": "We had a photo of our passport on our phone and that was sufficient."}, {"username": "Terry Hamlet", "comment_text": "https://\nwww.gov.uk/\nforeign-travel-a\ndvice/italy/\nsafety-and-secur\nity"}, {"username": "Jennifer Walp Rydholm", "comment_text": "This is similar to speeding. We have laws about speeding. You can speed all the time and not get caught or get caught and not get a ticket. But, the law is to follow the posted speed. Just because you have not gotten a ticket does not mean you never will. Carry the passport or don’t. Everyone here has said what the law says. The likelihood of you getting a large fine for having a copy only is pretty slim I guess, but I am a rule follower and I feel safer with my passport on me, hidden. To each his own but asking the same question over and over will never change the answers."}, {"username": "Maria Antidormi Corica", "comment_text": "Ive carried mine with me the whole time. Only because I don’t trust anyone overthere"}, {"username": "Ashley Zammit", "comment_text": "What if you got the copy certified by a solicitor and carry that on you? Would that be beneficial at all instead of carrying it?"}, {"username": "Gena Diaco Penland", "comment_text": "We were in Italy for 2 weeks recently and my husband has traveled extensively all over the world..:.we never carry the actual passport and have never been asked for it. We have our American drivers license and a photo of our passport on our phones."}, {"username": "Wendy Bey-Sottovia", "comment_text": "We were in Italy for 2 weeks. Never carried our passports. Left them in the safe at the hotel. We were asked by the police to see them when we were in the train station in Rome"}, {"username": "Allison Mir", "comment_text": "There’s absolutely no way I would carry such a valuable document on me unless I was heading to the airport. Getting replacement passports is an expensive & time consuming business. I lived and worked in Europe for years and never carried mine. I have a pic on my phone of all my families passports and my husband & I both have our photo driving licences on us."}, {"username": "Sandra Di Liso", "comment_text": "You have to have the actual passport. We were stopped by Polizia in Arezzo - random car check. He asked for passports. I had copies. He told me that photocopies were not acceptable. He was nice I think because we had 2 kids in the car so let us off with a warning. It’s up to you if you want to take the chance of being stopped or not, and if the police are nice or not. Rules are only EU citizens can be without passports - everyone else has to have them at all times."}, {"username": "Najeana R. Crandall", "comment_text": "Does anyone know how much the fine is if you don't have it? Might not be worth the hassle?"}, {"username": "Beth Stratton-Woodland", "comment_text": "Just spent 2 weeks in Italy. Passports remained in hotels in safes."}, {"username": "Anna Rockon", "comment_text": "Anna Rockon"}, {"username": "Hege Benedicte Runge", "comment_text": "I took a train in Milan just a few weeks ago with my kids and the police entered the carriages and did a random id-check. Some had passports, others had id-cards of some sort. So it can happen any time, any place.\n\nI use my Longchamp Le Pliage tote bag since I have to carry an epipen and such with me. I use a small pouch with a zipper inside for passports. Nothing special with regards to pickpockets except using caution 🙂"}]}, {"id": "2205503279848750", "text": "We will be leaving Rome via airplane at 8:20 we were originally scheduled to leave at 9:20…. We are flying to Greece. What time should we arrive at the airport and what is the best way to get there. The Leonard express starts @ 05:35….", "link": "facebook.com/groups/1373361046396315/permalink/2205503279848750/", "likes": 0, "comments": [{"username": "Karol Sabat Hoffman", "comment_text": "Taxi"}, {"username": "Marina Rosa Moni", "comment_text": "Take the first Leonardo express"}, {"username": "Shannon Marie", "comment_text": "Stay at the hotel airport the night before. You don't want to chance your flight on the train being on time and operational"}, {"username": "Katarzyna Marczewska", "comment_text": "You will be fine with train. It is intraEU - no passport control"}]}, {"id": "2205781056487639", "text": "Has anyone purchased a Fendi bag in Rome ? Did you have to book an appointment", "link": "facebook.com/groups/1373361046396315/permalink/2205781056487639/", "likes": 19, "comments": [{"username": "Yolanda Ann Stout", "comment_text": "Not a in Rome but Milan. We went to Louis Vuitton and Golden Goose and did not need an appointment."}, {"username": "Devon Grandi Powell", "comment_text": "Didn’t purchase Fendi but did other high end shopping. Appointments were not necessary but there were occasionally lines at various stores (Celine always had a long line, for example)"}, {"username": "Stella Kevin", "comment_text": "I bought 4 in Rome. Just walked in, was helped immediately. Make sure you have your passport for the vat tax refund."}, {"username": "Claudia Ponz", "comment_text": "I did. Two weeks ago. You don’t need an appointment.😊"}, {"username": "Elizabeth Brown Atkinson", "comment_text": "Are the prices that much better?"}, {"username": "Katherine Veliz", "comment_text": "No appointment needed. Some store like LV have a line because they only allow a certain number of customers at a time."}, {"username": "Emma Middlemass", "comment_text": "Not in rome but in Milan. I didn’t make an appointment but had reserved the bag via WhatsApp with the boutique 👌🏼"}, {"username": "Lisa Rizzo Ozmon", "comment_text": "Anyone buy a LV bag there and how is the savings??"}, {"username": "Denise Hastie", "comment_text": "Phil Schoch, Tina Stockton Schoch"}, {"username": "Tricia Raymond Graham", "comment_text": "How does this work if your visiting more than 1 country? We are going to France 1st then traveling to Tuscany. I’m not sure yet of out path or what countries we will be traveling through"}, {"username": "Sara Andersen", "comment_text": "What for?"}, {"username": "Jeanne Tran", "comment_text": "I was in Greece, LV you can walk right in. Cheaper and lots more styles"}, {"username": "Michelle Buckley", "comment_text": "No appointment necessary Fendi in Rome.\nJust had to line up and wait for my turn.\nI had a screen shot of my passport when I went into Fendi. Same in Spain.\nMake sure you get the customs officer to stamp your paper work before you go to checked in luggage. Once stamped you can check your luggage in. Once through go to the Vat Refund."}, {"username": "Cindy Vennare", "comment_text": "Went to Fendi in Florence - walked in walked straight up to the bag and said that’s it! It could have been a bit cheaper but I forgot about that Vat tax and shipped my bag home with other stuff to lighten our load half way through our trip."}, {"username": "Lori Charlene", "comment_text": "F"}, {"username": "Kathy Aquino Chow", "comment_text": "I did not - I walked right in, and there were at least 2 associates waiting at the door to help."}, {"username": "Trudy Grande-Mazzone", "comment_text": "Buy at the airport store on your way out! No vat and great prices compared to US"}, {"username": "Jocelyn F. Hild", "comment_text": "What's in a Brand bag?"}]}, {"id": "2205784019820676", "text": "Good Day! We're a family of 3 that will be spending the whole month of October in Italy before flying to Ireland to continue our European dream vacation. I know many of the destinations that we're going accept tap and ApplePay, so we're prepared for that, but were still worried about how much actual cash in Euros to bring with us. I want to start with 1k Euros, but my wife thinks we need to start somewhere in the 2k Euros cash neighborhood...\n\nwhat do you guys think???", "link": "facebook.com/groups/1373361046396315/permalink/2205784019820676/", "likes": 4, "comments": [{"username": "Fetchin Gretchen", "comment_text": "Don't get cash except as needed via atm."}, {"username": "Jenny Payne", "comment_text": "I go every year to show friends around and I usually take around €1500 that’s just me as when your sharing lunch, dinners, taxi better to have cash and never had a problem in 16 years 🌻"}, {"username": "Tanya Robertson", "comment_text": "My son and his family 3 adults and 2 children 3 & 5yrs are going to a wedding in Trieste can anyone recommend an Airbnb?"}, {"username": "Ann Applegarth Veith", "comment_text": "I had €100 before arriving in Italy 4 months ago. However, I'm not traveling with a family... but there are ATMs everywhere. And most places take credit cards...except for Albania."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Get your euros in Italy at bank affiliated or post office ATMs as needed. It is not safe to carry all that cash with you."}, {"username": "Giovanni Pianigiani", "comment_text": "I have 50€ in my wallet since a couple of weeks ago, in case of emergency. I can't imagine a reason why I would need to carry more, other than buying a stolen bicycle on the black market"}, {"username": "Jenn Messina Babore", "comment_text": "Unless you are going on tours that require cash payment, you won’t need that much. Majority can go on a credit card."}, {"username": "Rhona OConnor", "comment_text": "Lots of ATM machines in Ireland too."}, {"username": "Bernadette Breen-Shinner", "comment_text": "Don’t bring cash.\nUse arms."}, {"username": "Zach Hunter", "comment_text": "Leigh Dowdy"}, {"username": "Rebecca Yeoh", "comment_text": "You don’t need much cash as almost everywhere accepts card/ tap. If you take that much cash you’ll find yourself having a hard time getting through it as card is so much more convenient. Even the toilets at train stations where you have to pay 1€ accept card 👍🏼"}, {"username": "Lauren-Jade Roberts", "comment_text": "I would be very concerned about carrying €2000 on my person. I would never have more than €50/100\n\nRural Ireland may have more requirement for cash but again restaurants/\npubs/larger shops will accept card - why not take say €250 and then withdraw cash as and when you need it from ATMs"}, {"username": "Raymond Owens", "comment_text": "I would err on the side of having more rather than less, but I try to think￼ of worst case scenarios.\n\nI think you would be fine with 1,000 Euros, but if your wife would have more peace of mind, get the 2k. If nothing else, it is worth it for her to know you guys have plenty. Will you NEED 2k? Probably not. But you DO need your wife to be comfortable with the cash situation.\n\nEnjoy your amazing trip!"}, {"username": "Leigh Dowdy", "comment_text": "I didn’t plan on keeping that much on us. I also don’t plan on going to the Vatican or coliseum. I was hoping to go to flea markets and markets where I didn’t know if they took debt or credit cards"}, {"username": "Allison Mir", "comment_text": "Just withdraw what you need if going to markets on the day."}, {"username": "Carlotta Crespi", "comment_text": "Italy is one the 7 greatest economies in the World: we use credit and debit cards every day, we have banks and ATMs ..."}, {"username": "Heidi Littman Meiers", "comment_text": "hotel in Sorrento just told me driver they are sending for PU and return to naples airport \"would prefer cash\"... honestly, CC were the thing when covid hit and no one wanted to touch cash but now in the US at least ,many places I go (I live in a major east coast city) has a sign that says 3% surcharge for CC so csah is preferred"}, {"username": "Fiona Mac", "comment_text": "Use revolut card great rates n u can withdraw cash from it too"}, {"username": "Tracy Foss", "comment_text": "Use Bank ATM and use cash like you would at home"}, {"username": "Valerie Collanton", "comment_text": "Starting with 1K euro is more than enough. As others have said, there are ATMs everywhere where you can get cash. Just check with your bank as to which ATM network is affiliated to avoid ATM fees. Otherwise you can use whatever ATM you want."}, {"username": "Shelley Frise", "comment_text": "Get a wise card it works great. Very affordable exchange fees"}, {"username": "Michele Levesque Semosky", "comment_text": "I actually like arriving with a few euros in my pocket, but would not carry that amount of cash on me. Maybe start with a few hundred and take more out as needed from a bank ATM. I don’t even have ATM card and will bring about 4-500 for two weeks."}, {"username": "Stacee Looney-Gutierrez", "comment_text": "Need cash— Toilets, buskers, and the occasional one-off situation. I would carry 200 or less."}, {"username": "Barbara Bastianini", "comment_text": "I myself would never carry 2 thousand euros in cash. Or truthfully, even one thousand. The possibility of theft or loss is just too great.\n\nI use a travel debit card to obtain Euros as needed. The travel card has no foreign transaction fees, refunds all fees imposed by the ATM itself, provides for a fair up to date exchange rate, provides fraud protection, and is good at any ATM on any network anywhere in the world. The debit card is free to set up and use. It requires no minimum balance. There’s no reason to risk carrying a lot of cash when it’s so inexpensive and convenient to obtain euros everywhere. ( it takes about 30 seconds to use the ATM.)\n\nIf you’re interested you might want to check out the debit card associated with the Charles Schwab High Yield Investor Account. We’ve used it in countless countries on 4 continents with absolutely no problems. And it increases your safety because it minimizes your need to carry a lot of cash."}, {"username": "Sandra Yee", "comment_text": "I don’t think it’s safe to carry that much cash. I only allotted about €20/day and I didn’t spend it all even though I actually TRIED to use it. Credit card was just so much easier."}, {"username": "Gwyneth Spadaro-Dutturi", "comment_text": "Can’t you just use an ATM?"}, {"username": "Sonita Sandhu", "comment_text": "I would take some cash. In Italy credit cards were fine but if you go to Croatia many of the islands take cash only. I didn’t take a bank card and about 300 cash. It was gone fast! managed as I had a friend who had a bank card."}, {"username": "Frances Barnes", "comment_text": "Sign up for a revolut or something like it. I have one and a chase account. The card lets me withdraw cash from ATM machines, overseas, at no extra expense and with bank rates"}, {"username": "Angie Hoff-Hess", "comment_text": "Just use ATM. My bank does simple 4$ transaction fee, automatically converses"}]}, {"id": "2205778943154517", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2205778943154517/", "likes": 0, "comments": []}, {"id": "2203900476675697", "text": "Visit yesterday to San Gimignano after our wine tour. Such a cool little town.", "link": "facebook.com/groups/1373361046396315/permalink/2203900476675697/", "likes": 1, "comments": [{"username": "Theodore Meyer", "comment_text": "San what?"}, {"username": "Robert McCurry", "comment_text": "Did you use a tour guide? Or drive yourself?"}, {"username": "Toni Marie", "comment_text": "Loved this town"}, {"username": "Dixie Kotylak", "comment_text": "Loved that little town!"}, {"username": "Paul Volpicella", "comment_text": "Hi"}, {"username": "Sabrina Marie", "comment_text": "Which tour did you do?"}, {"username": "Peter Kim McDonald", "comment_text": "Charlotte thanks for sharing this information! We have a reservation for Tenuta Torciano for Dinner in the Garden tour Tasting and sunset dinner Sept 25! Now really excited 🤩 Visiting San Ginimongio first."}, {"username": "Paula Brink", "comment_text": "#San Gimignano 😉"}, {"username": "Tracy Foss", "comment_text": "Thank you for sharing this! Was it a tour booked through Viator?"}, {"username": "Linda Orr", "comment_text": "Yes! It's a great place to visit!"}, {"username": "Brian Marcus", "comment_text": "Loved it!"}, {"username": "Denise Beaudoin", "comment_text": "Denise Beaudoin"}, {"username": "Denise Beaudoin", "comment_text": "Denise Beaudoin"}, {"username": "Alice Francesca", "comment_text": "SAN GIMIGNANO, PLEASE EDIT.;)"}, {"username": "Kim Mai Yuen", "comment_text": "Visa or tour visa , Which one I need fro me and my daughters . If I come to there"}, {"username": "Beverley Milson", "comment_text": "Such a perfect Italian hilltop town!"}, {"username": "Shawna Mcdonald Sapp", "comment_text": "Eva Lansford we are going to this town"}, {"username": "Jo Ann Schwartz Woodward", "comment_text": "Love your photos"}, {"username": "Christine Malota- Kendall", "comment_text": "Very precious. And their gelato… and views. ❤️"}, {"username": "Paula Marsiglio Nave", "comment_text": "Was there in June and loved it!"}, {"username": "Anne Pinsonneault", "comment_text": "Love it there!!!"}, {"username": "Rhonda Tawney Kline", "comment_text": "We loved it!"}, {"username": "Louise Stadly", "comment_text": "Wow! Amazing!"}, {"username": "Мария Величкова", "comment_text": "I was here!"}, {"username": "Mary Kelly Stevens", "comment_text": "Mary Kelly Stevens"}, {"username": "Lisa Ann", "comment_text": "Thank you for sharing this! I can't wait! Going in September"}, {"username": "Lisa Woodfall Anderson", "comment_text": "Going in October...Woo hoo!!!"}, {"username": "Denise Machon Boyd", "comment_text": "Love it there 🥰"}, {"username": "Janis De Medici", "comment_text": "There olive oil is fantastic!"}, {"username": "Mary Sandor White", "comment_text": "Staying here in September at Hotel Sovestro (Poggio Winery). Has anyone stayed here?"}, {"username": "Jen Prevoznik", "comment_text": "What winery did you tour?"}, {"username": "Connie Thick", "comment_text": "August Thick"}, {"username": "Debbie Horton Rough", "comment_text": "Looks wonderful!"}, {"username": "Angela Emmitte Tripp", "comment_text": "Such a cool town..Highly recommend to everyone"}]}, {"id": "2205124583219953", "text": "Capri or Ischia? Why?", "link": "facebook.com/groups/1373361046396315/permalink/2205124583219953/", "likes": 74, "comments": [{"username": "Carrie Dickson", "comment_text": "Procida a must ☺️"}, {"username": "Jenny Johnson Nuzzolillo", "comment_text": "Ischia, thermal baths-been back 3 times"}, {"username": "Jen Tornetta", "comment_text": "We just left Ischia. I totally recommend going. It was so nice, not crowded at all. Visited Negombo thermal bath. Relaxing day with fam."}, {"username": "Karam Tatla", "comment_text": "Capri"}, {"username": "Rosa Mello Mattos", "comment_text": "Capri"}, {"username": "Sonia Caruana", "comment_text": "Ischia, less crowded"}, {"username": "Stacy L. McGuigan", "comment_text": "Francesca Battista Lepo"}, {"username": "Bette A Pasquarello", "comment_text": "Ischia"}, {"username": "Rebecca Thompson", "comment_text": "Kristie Lathrop"}, {"username": "Stacey Blicker", "comment_text": "ischia!"}, {"username": "Cheryl Ege", "comment_text": "Italians vacation in Ischia, Capri is for tourists."}, {"username": "Sandra Nurzia Rogers", "comment_text": "Both"}, {"username": "Shirley McElroy-phelps", "comment_text": "Ischia for sure. Less touristy and locals are so welcoming and accommodating."}, {"username": "Paul Callinan", "comment_text": "Stromboli it’s beautiful."}, {"username": "СИЛВИЯ САВОВА", "comment_text": "Ischia- green,clean,fre\nedom...warm people, low price"}, {"username": "Rose Moccia", "comment_text": "Ischia"}, {"username": "Genevieve Bastien", "comment_text": "Ischia !!! We were there for 4 nights and so many great things to do . We were also in Capri but enough after a day trip there (go to Marina Picola for a lower key lunch by the sea)"}, {"username": "Maryanne Dispigna", "comment_text": "Ischia.."}, {"username": "Nancy Cicinelli", "comment_text": "In Capri take the lift cable cars up to the top corner fantastic pic's"}, {"username": "Sarah Soave", "comment_text": "Joe Rosa"}, {"username": "Mary Ann Christina", "comment_text": "Capri!!"}, {"username": "Susan Sinclair", "comment_text": "Capri was great to visit - it’s beautiful and busy. It’s very expensive . Ischia is great - beautiful many places to go each day . Had a great time on ischia"}, {"username": "Natalia Perez", "comment_text": "Capri is fun but very expensive and it can be hard to get around. You have to take Taxis or wait in a very long line for the buses. I did have the best pizza 😋 and a fun chair lift ride there though"}, {"username": "Wendy Morelli", "comment_text": "Ischia"}, {"username": "Yvonne Jones", "comment_text": "Capri every time..."}, {"username": "Jimmy Menacho", "comment_text": "Both cuz you only live once!!!"}, {"username": "Katie Barnes Burwell", "comment_text": "I continue to be surprised that Anacapri is not mentioned as the more personable side of Capri. We rented scooters on the island and stayed in Anacapri. We toodled all over the island, and loved every minute of it. Would not likely stay in Capri, not when Anacapri is so perfect and so much less touristy.❤️"}, {"username": "Melissa Klarberg", "comment_text": "Ischia! 🥰 visit posiden spa too"}, {"username": "Ela Cyniak", "comment_text": "Procida 😃"}, {"username": "Karen Schmidt", "comment_text": "For those that have already been…which town would you recommend? Any hotel recommendations\n? Also, the place I’m looking at is offering half board. It’s got great reviews. Any thoughts on that option?"}, {"username": "Michelle Corcoran", "comment_text": "Capri 💜💜💜"}, {"username": "Wendy Anne Breuer", "comment_text": "Totally different. Both"}, {"username": "Steve Partridge", "comment_text": "Ischia every time. Beautiful and relaxed and worth a visit. Spend time at a thermal theme park, San Angelo, the castle and botanical gardens, a meal around Port Ischia. Plan a trip to Procida too, make sure you have enough time to get across to marina Correcella.\n\nYou can a ways get a day trip to Capri from Ischia which would be enough with a round island boat your. Capri is absolutely manic and overcrowded. You will queue hours to get into the Blue Grotto and for the Funicular. Better to take a open top taxi to the top (share with others they take 6)\nBy the way the Blue Grotto in Croatia is better.\n\nIt’s just the sheer number of tourists in Capri. They come from the Cruise ships in Naples. It’s spoilt it"}, {"username": "Nevence Antevska", "comment_text": "Procida is wonderful"}, {"username": "Jon Ciccarelli", "comment_text": "Ischia, no contest. Far cheaper, less crowded, the castle, Greek museum, none of those luggage cars driving through the streets. Much more laid back. Capri is just none stop stress."}, {"username": "An De Ruyck", "comment_text": "Ischia for sure, personally I didn’t like Capri, too crowded"}, {"username": "Mary Nelsen", "comment_text": "Ischia"}, {"username": "Martin L. Epperly", "comment_text": "Ishcia of cause because more down to earth"}, {"username": "Lisa Ann Reigle", "comment_text": "Ana Capri"}, {"username": "Galina Kanevsky", "comment_text": "Iskia!"}, {"username": "Rebecca Weiss", "comment_text": "definitely Ischia!!!"}, {"username": "Galina Shub", "comment_text": "Ischia for sure!!"}, {"username": "Nancy Cicinelli", "comment_text": "I stayed 5 days and loved it in Ischia.. less expensive and beautiful spa beaches less tourist"}, {"username": "Gioia Burkett", "comment_text": "Neither...go to Sicily!"}, {"username": "Suzanne Mills", "comment_text": "Ishcia 100%\nCapri is a waste of time."}, {"username": "Margaret Cachia", "comment_text": "Both"}, {"username": "Elvira Lelli", "comment_text": "Both beautiful 🌹"}, {"username": "Samantha Lewis", "comment_text": "Stefan Rossi"}, {"username": "Lee Farlow", "comment_text": "Louise A Falwasser..sounds like a day trip!"}, {"username": "Katherine Clark-Fredrick", "comment_text": "Kimberly Lowe Pressley"}, {"username": "John Perrotto", "comment_text": "Gina Perrotto"}, {"username": "Suzanne Issa", "comment_text": "I Would Do Both. Capri Is Wonderful And The Poseidon Daytime Thermal Baths In Ischia\nAre Unbeatable!"}, {"username": "Dennis Schlegelmilch", "comment_text": "Ischia all the time.\nLaid back, easy on the wallet, more choices and friendly locals, better food at affordable prices"}, {"username": "Deborah Merandi Staud", "comment_text": "More of the Italians go to Ischia ! Less touristy"}, {"username": "Winston Flowers", "comment_text": "ISCHIA!!! The Thermal Pools contrasting with the nearby coolness of the Mediterranean will leave incredible memories!!"}, {"username": "Kim Baughman", "comment_text": "Capri - it’s gorgeous!!\nbut I’m biased since my Mr. Wonderful proposed there at one of the top lookouts."}, {"username": "Kathleen Jahnke", "comment_text": "Ischia for sure! Great thermal bath parks, less touristy, your money will go much further.￼"}, {"username": "Adam Mackintosh", "comment_text": "Ischia 1000% Beautiful. Natural volcanic spas. Beaches, food."}, {"username": "Cathy O'Brien", "comment_text": "Ischia …. Capri too busy during summer months except if you just go around the other side on the boat ."}, {"username": "Hannah Maleski", "comment_text": "Riley Grieveson"}, {"username": "Roxanne Perrone", "comment_text": "Both beautiful - I’d choose Ischia"}, {"username": "Dóri Kovács", "comment_text": "Faraglioni, Giardino d' Augusto : Capri"}, {"username": "Anamica Roy", "comment_text": "Ischia"}, {"username": "Jody Lynn", "comment_text": "Margaret Ann Schneider"}, {"username": "Julie Atkinson", "comment_text": "Depends what time of year you go. If you are going to Capri, try to go on days cruise ships are not in port. You will get 10,000 people a day from the cruiselines. Keep in mind cruisers clear out by 5-6 pm. You must stay overnight in Capri to really appreciate it. The town of AnaCapri is a bit quieter than the town of Capri. Both on the island of Capri. Both worth visiting as well as the beach clubs. Capri is beautiful and my recommendation but depends what you like to do and how fussy you are with crowds. September and beginning of October is a nice time to go."}, {"username": "Karen Iacono Ustick", "comment_text": "We stayed on Ischia & booked a private boat excursion to Capri for a full day. It was perfect!"}, {"username": "Gary Oroian", "comment_text": "Capri! Stay a few days and really enjoy it after the day trippers leave!"}, {"username": "Lydia A Wilson", "comment_text": "Both!!!!"}, {"username": "Nicole Wang", "comment_text": "I Schiavone! Charming, more to experience. Great food, vineyards, people and more affordable. But a day trip to Capri is fun!"}, {"username": "Maruchi Santana", "comment_text": "Spent 14 amazing days in Ischia- from there you can go to Procida and Capri\nIn Capri we did a private boat ride to grottos not visited by tourist\nWe went twice to Capri"}, {"username": "Christina Hunter", "comment_text": "Have you read the books or watched the series My Brilliant Friend? They travel to Ischia in the summers, I'd love to see it for that reason BUT our daughter's name is Capri so we are heading there 😂🥰"}, {"username": "Nancy Koehler Barboni", "comment_text": "It’s like comparing apples to oranges! Google both, look at pictures, read reviews and decide for yourself what suits you and your taste and interest! Take into consideration what month you would be visiting!"}, {"username": "Antonio Gonzalez", "comment_text": "The beauty of Capri is unique 👌"}, {"username": "Maureen Towey", "comment_text": "Capri"}, {"username": "Kathleen Jarvis", "comment_text": "Ischia working island beautiful"}, {"username": "Elizabeth Brown Atkinson", "comment_text": "Thank you - I think you made up my mind on what to do when in Naples."}, {"username": "Villy Cikorie", "comment_text": "Capri best Lemoncello"}, {"username": "Robert Baumann", "comment_text": "Both!!"}, {"username": "Sue Holden", "comment_text": "I plan on doing both in a few weeks when I am there. Been to Capri before and it’s beautiful."}, {"username": "Enza Di Carlo", "comment_text": "Ischia"}, {"username": "Carole DeSimone", "comment_text": "Ischia!!!"}, {"username": "Shelby Lehor", "comment_text": "Kris Burley"}, {"username": "Pong Ac Ai", "comment_text": "Capri"}, {"username": "Nancy Wise Cates Robinette", "comment_text": "We went to capri for a day trip and ischia for 4 days stay. We could have spend a whole day at the spa that had 32 pools of different temperatures! We had a private driver that took us around the island and gave us great tips on restaurants. We love our choice of staying in Ischia and doing a day trip In Capri that we did the blue grotto with a boat tour around the island. Then took a car tour of capri and anacapri. Where they gave us time to get out to shop and eat lunch."}, {"username": "Marissa Dela Cerna", "comment_text": "Capri 100%! But you can visit them both (just a ferry away)."}, {"username": "Paulyn Hoffman", "comment_text": "Oh both! Just wonderful to go to either. Love Ishcia though, since it was in the My Brilliant Friend Books and Series."}, {"username": "Maria Gallace Gerelus", "comment_text": "Capri !"}, {"username": "Debra Lynn Kaus Conte", "comment_text": "Ishcia"}, {"username": "Sarah Pilato Johnson", "comment_text": "My family originates from ischia so that’s my choice when I go next year. So excited!"}, {"username": "Diane Petonito Giordano", "comment_text": "I haven’t seen either one but I’m planning my next trip"}, {"username": "Rose Arcamone-Nigro", "comment_text": "My ancestors have lived on Ischia since the 1500. Was supposed to go before Covid. Can’t seem to get there now. Any Arcamone’s here?"}, {"username": "Ερασμία Γκαρή", "comment_text": "Capri is a picturesque island but plenty of tourists and crowds .Ischia is for a non outrageous ,authentic Italian summer .."}, {"username": "Josephine Rauch Rotunda", "comment_text": "Completely different vibes… Should visit capri at least once in your lifetime. Ishia is more of a beach destination ￼and laid back."}, {"username": "Marie De La Baume", "comment_text": "Both!!!"}, {"username": "Nancy Khoury DeRosa", "comment_text": "Dom DeRosa"}, {"username": "Janine Emma Lucas", "comment_text": "We’re doing 2 nights in ischia. We are staying in a sea front hotel with the thermal baths overlooking the castle which we will explore, our hotel view is the castle. Just thought it seemed like a fun mini escape from the mainland\nCapri for 1 night in a monastery"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Both have pluses ….. Capri has Anacapri on the reverse side …. Quaint and quiet , great restaurants and views…. Capri is too busy and too touristy . Ischia is not￼ as touristy as Capri"}, {"username": "Sony Ucciferri", "comment_text": "Both"}, {"username": "Todd Trnka", "comment_text": "I can’t wait will be in Ischia in 10 days.\n\nHow packed with tourist is it right now?"}, {"username": "Angela Cagna Gaberel", "comment_text": "Try Procida"}, {"username": "Alicia Fancher", "comment_text": "Both!! I can’t choose because they’re both so different and so beautiful!!"}, {"username": "Max Perletta", "comment_text": "Ishcia is not in Italy, Ischia I think yes!"}, {"username": "Rick Sikorski", "comment_text": "Only been to capri but it’s the closest thing to gods country I have ever seen"}, {"username": "Daniela Ventura", "comment_text": "Wild Sardegna, the best"}, {"username": "Sean P. O'Brien", "comment_text": "Is Ischia doable as a day trip from Sorrento?"}, {"username": "Luca Lookone Ferrentino", "comment_text": "If you're looking for a postcard tourist theme park, overpriced and highly instagrammable,\nchoose Capri.\n\nIf you're interested in a place with great landscapes, natural volcanic spas, local wines made with grapes from volcanica soil, ancient traditional food and real locals living everyday life, i would choose Ischia"}, {"username": "Stella Dee", "comment_text": "Ischia.."}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "Had the same dilemma while planning our October Southern Italy trip. Was concentrating fully on Ischia, Procida.\n\nAfter delving into research, I found areas of Capri which were of interest. Natural beauty, history, Anacapri, food, art, architecture, emerald water and legendary Beach clubs.\n\nWhen travelers mention the negative side of Capri…crowded, expensive, etc…that’s the Capri not of interest to us: the expensive piazza, Summer. We’ll explore the piazza and popular marina before/after ferries. Not into shopping either.\n\nWe’re staying 2 nights in Capri and 5 in Ischia. Like a poster had commented, you should go once to Capri. I feel 2 nights isn’t enough. That’s me. We prefer to slow down, linger and savor. Experience, not just see.\n\nIf you can do both, do it. I don’t want to miss out on the more authentic Island fishing village experience with thermal waters that Ischia offers."}, {"username": "Bob Deahl", "comment_text": "Ischia, original, less crowded, no glitz or too many tourists and fabulous wine"}, {"username": "Darla Ehrhard", "comment_text": "Never been to Capri, but I'd go back to Ischia (and to the place I stayed) in a heartbeat😊. Absolutely love it!"}, {"username": "Jill Tingley", "comment_text": "Most Italians vacation in Ischia over capri"}, {"username": "Hindi Lichtenstein Friedman", "comment_text": "Capri💕"}, {"username": "Roland Trego", "comment_text": "For a first or only visit, I’d still go with Capri. Some incredible beauty. Ride the lift to the top of Anacapri. Visit the Villa San Michele. For a three-day relaxing stay, Ischia is an excellent choice (with a visit to Procida). Not as many tourists. Good beaches, spas. Not quite the same “wow” factor as Capri, though, in my opinion, but a great place to enjoy some dolce far niente."}, {"username": "Vicky Fleming", "comment_text": "Capri is the most beautiful, but very crowded. ischia is relaxing and great if you have already been to Capri."}, {"username": "Sajal Rehman", "comment_text": "Ischia 🏆"}, {"username": "Asia Dimitrova", "comment_text": "It is hustle and bustle in Capri. I was there 20 days ago and it was a nightmare of tourists! Expensive,too."}, {"username": "Matt Tabone", "comment_text": "We just stayed in Forio, on Ischia. Found it was more Italians on holidays than tourists as per say. So we really enjoyed it. Also some places didn’t speak a heap of English but we got by - we chose ischia over Capri as we had heard that ischia is where the Italians go!"}, {"username": "Philip Joseph", "comment_text": "We intended to book Capri but accidentally booked Ischia. Best mistake we ever made. We less expensive but every bit is beautiful. Food was amazing, people were wonderful, and WAY less crowded than Capri or anywhere else in Italy."}, {"username": "Larry Dash", "comment_text": "Ischia is not a tourist trap like Capri or at least not so much of one."}, {"username": "Mike Ball", "comment_text": "I’ve done both and I would definitely return to Ischia , had a day on Capri and that was enough, overcrowded and expensive, it’s beautiful but too pristine,\n\nIschia felt more real , there are several small towns dotted around the island, public transport is extremely cheap and plentiful and there’s no shortage of good places to eat ,\n\nI’d definitely recommend Ischia over Capri ."}]}, {"id": "2205151879883890", "text": "Greetings all 😊 We will be landing in Rome around 8:30 am & already purchased train tickets for 10am, will that be enough time to get through customs? Is it a hassle to change our train tickets if necessary? Not sure why we didn’t think of this sooner! Must have been caught up in the excitement of booking everything & didn’t think it through 🤷🏼‍♀️🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2205151879883890/", "likes": 1, "comments": [{"username": "Irene Oda", "comment_text": "It will be tight. It really depends on how many other flights are landing at the same time. Where are catching the train from?"}, {"username": "Ashley Czinege", "comment_text": "Be prepared to have to purchase another ticket. It took me hours to receive my\nluggage at Fiumicino last week but it all depends on how busy it is when you arrive. They have a ticket station right at the airport to purchase a train ticket if you do happen to miss yours, so don’t stress it."}, {"username": "Kirsty Manning", "comment_text": "Check at the station if you need to, when we missed a train we found out that you can just catch the next one on the same ticket."}, {"username": "K M Uí Fhionnaláin", "comment_text": "Are you talking about train from Fiumicino airport?"}]}, {"id": "2205191069879971", "text": "Planning our 2024 trip to Sorrento (as a base), Rome and Venice in (mid) April! Wondering how everyone’s weather experience was around that time? Yes, I googled the weather that time of the year (between 60-70s is what I got) Just am unsure if it’s to cold and should push a week or so back! We are from the south (U.S) and are use to crazy weather changes. TIA!", "link": "facebook.com/groups/1373361046396315/permalink/2205191069879971/", "likes": 0, "comments": [{"username": "Jaime Cleek", "comment_text": "When you say using Sorrento as a base are you also planning to stay in Rome and Venice ??? When I see someone say as a base it makes me think they are planning day trips but Venice is quite far from Sorrenro"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "If you don’t want to swim in the sea it should be fine, just check when Easter will be (to be in Rome for easter can be great, in Sorrento maybe very busy) and consider that the 25 April is bank holiday so some things could be closed and some local trains packed."}]}, {"id": "2205286716537073", "text": "Has anyone ever used Skyluxe Travel to book airfares? Rates are very high yet they seem to be so low. Hmmmmmm………?", "link": "facebook.com/groups/1373361046396315/permalink/2205286716537073/", "likes": 0, "comments": [{"username": "Jenn Messina Babore", "comment_text": "Best is always to book direct with the airline."}]}, {"id": "2205427779856300", "text": "When traveling in Italy are you suppose to keep passports on you or can you keep copies?", "link": "facebook.com/groups/1373361046396315/permalink/2205427779856300/", "likes": 0, "comments": [{"username": "Brenno Bianchi", "comment_text": "Dlgs 286/1998 at article 6.3 states that a passport must provided by the forigner whenever asked by a police officer, otherwise 2000€ of fine or up to 1 year in jail."}, {"username": "Brian Osman", "comment_text": "Never carried mine, just a copy"}, {"username": "Krissy DaRusso", "comment_text": "I always keep my passport on me. I travel with an anti-theft crossbody that I only remove behind my locked AirBnB door. I travel alone and this is what works for me on my extended summer trips. In general, I’m a city girl with city wits so I know how to be safe in train stations/\ncrowds. Personally, I’d never leave such a valuable item out of my sight and rely on a paper copy of anything while traveling abroad.\n\nYou’ll get a pretty divided response on the thread and screenshots of what is allowed, followed by pretty routine arguments."}, {"username": "Jaime Cleek", "comment_text": "Search the group there are dozens if not hundreds of conflicting answers"}, {"username": "Christine Andaya-Wallace", "comment_text": "This is from the UK gov travel advice for Italy\n\nhttps://\nwww.gov.uk/\nforeign-travel-a\ndvice/italy/\nsafety-and-secur\nity"}, {"username": "Jamie Bly", "comment_text": "Was just in Italy. We kept ours on us but never had an issue where we were asking for it. It is law to carry identification in Italy at all times."}, {"username": "Jenn Messina Babore", "comment_text": "Copy was sufficient for our trip."}, {"username": "Alessandro Iannelli", "comment_text": "it's a tricky one. the law states, verbatim, that if a public official requests that you, a foreigner, show a passport or other id form and you don't do it \"without a justified reason\", you can incur in a 2000 euros fine and prison up to one year (the second punishment is really only in theory, no one would ever go to prison for that). i assume the document must be a passport for people coming from outside the schengen area, while it can be the normal id if you are a citizen, say,of france or greece. as for the \"justified reason\", i don't know if fear of it being robbed would count as \"justified\". of course, if you decide not to bring it with you, you absolutely must carry a good and full copy of it. probably, only the biggest a$$hole of a policeman would ruin your vacation just for carrying a copy instead of the original, and the average policeman would probably go as far as to demand to see the original only if he/she stops you under some sort of suspect circumstances."}, {"username": "Melissa Reyes", "comment_text": "I never carried mine & was never asked"}, {"username": "Carole Tarlap", "comment_text": "I leave mine in the hotel safe AND carry a copy plus I do have a driver's license 🤷💥"}, {"username": "Terry Pisano", "comment_text": "I posted on this earlier today. Per Italian Foreign Ministry, you must have your passport or other form of acceptable ID on you. It does not state that a copy is acceptable. Also, Rick Steves says to keep your passport on you at all times. Hotel safes can be accessed by hotel staff, so I'll be keeping mine on my person. Having said that, lots of folks say they have been stopped and photocopy was fine. I feel best keeping it with me."}, {"username": "Terry Pisano", "comment_text": "Per the above comment DLGS 286 is the law in Italy. Translated, it does state you must carry your passport or other identifying document on your person or face jail and fine. It does not say a photocopy is acceptable, nor does it clarify what \"other identifying document\" can be. So will you likely face a fine and/or jail if you carry a photocopy? Probably not. I think this is about as definitive as you're going to get. I'll be carrying mine..."}, {"username": "Nidhi Khanna Bansal", "comment_text": "Thank you for the information"}, {"username": "Daisy Yoo", "comment_text": "U will never get the same answer ."}]}, {"id": "2205428596522885", "text": "Trieste\n21-22 Luglio 2023", "link": "facebook.com/groups/1373361046396315/permalink/2205428596522885/", "likes": 19, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}]