[{"id": "2195163634216048", "text": "Heaven on earth at Amalfi Coast! 🫶", "link": "facebook.com/groups/1373361046396315/permalink/2195163634216048/", "likes": 133, "comments": [{"username": "Adriana Sormani", "comment_text": "Bellissima!!"}, {"username": "Sharon Grace", "comment_text": "Love your dresses"}, {"username": "Francesco Ronchi", "comment_text": "#nabottarella"}, {"username": "Mindy Grossman Sepinuck", "comment_text": "where are you in these pics?"}, {"username": "Katherine AliNuñez", "comment_text": "Beautiful photos"}, {"username": "Armine Arabchyan", "comment_text": "Beautiful photos, Positano is heaven indeed!!"}, {"username": "Monique Sierra", "comment_text": "Beautiful pictures of you and the scenery Beatrice"}, {"username": "Jonalee Wilson Stephens", "comment_text": "Great pics. Looks like you’re having a blast"}, {"username": "Cai Hood", "comment_text": "her outfits really compliment the photos"}, {"username": "Mariecris Beygel", "comment_text": "Gorgeous photos"}]}, {"id": "2195169910882087", "text": "Hi everyone!\nDo you have any great restaurant recommendations in Pisa, Sienna, Varenna & Milan? A good friend is going this Fri & looking for the best places to eat!\nThank you so much in advance! 😁", "link": "facebook.com/groups/1373361046396315/permalink/2195169910882087/", "likes": 0, "comments": [{"username": "Alejandro Gabriel Valenzuela Anghileri", "comment_text": "Vecchia Varenna"}]}, {"id": "2195170260882052", "text": "Anyone stay at the Hotel Relais de l’Opera?? If so, how was your experience? 😁", "link": "facebook.com/groups/1373361046396315/permalink/2195170260882052/", "likes": 0, "comments": []}, {"id": "2195173177548427", "text": "Already booked my Italy from Sept 5 thru Oct 4, first week in a Hotel in Roma\nWant to join ?? Sent your resume, lol", "link": "facebook.com/groups/1373361046396315/permalink/2195173177548427/", "likes": 0, "comments": []}, {"id": "2195176880881390", "text": "I’m planning a trip to northern Italy and Switzerland with my family and considering using my TD Rewards points (Canada) for flight ticket purchases. Has anyone had issues using rewards for international flights?", "link": "facebook.com/groups/1373361046396315/permalink/2195176880881390/", "likes": 1, "comments": [{"username": "Steph Haggarty", "comment_text": "I had Expedia cancel a flight last summer. They overbooked and third party bookings were canceled first.\n\nWould say use for hotels instead."}]}, {"id": "2195180987547646", "text": "Hi we have to book a taxi to take us from central pisa to pisa airport about 4am this coming Sunday morning. Does anyone know where I could book one? We are staying at an Airbnb. Thank you 😊", "link": "facebook.com/groups/1373361046396315/permalink/2195180987547646/", "likes": 0, "comments": [{"username": "Lorraine Brennan", "comment_text": "Ask ur Airbnb host or look up uber"}]}, {"id": "2195183250880753", "text": "Is 18k for 2 months for a Italy, Spain, France Portugal holiday enough for everything including flights, accommodation etc… end of July is when I’m planning on going for 2024", "link": "facebook.com/groups/1373361046396315/permalink/2195183250880753/", "likes": 30, "comments": [{"username": "Lina Stump", "comment_text": "🤔"}, {"username": "Kelly Siegmann", "comment_text": "If you go in off season. May or late Sept a"}, {"username": "Beverley Bedford", "comment_text": "Are we talking Euros, USD or AUD"}, {"username": "Julie Norris", "comment_text": "I did one month in Rome last year for AUD $4800 airfares and accommodation. This year splitting between Rome and Sicily $5100 including airfare and accommodation. Travelling Sydney to Rome by Emirates"}, {"username": "Meghan Lee", "comment_text": "This was my spending for two and a half months, 8 countries. Food was probably lower than most as I’m not a foodie & had a kitchen to cook for myself a lot. Flight Brisbane - Barcelona, Milan - Santorini, Athens- Gold Coast. April-June 2023. I was solo 5 weeks then there were 2 of us for 4 weeks, then 3 of us on the last week."}, {"username": "Anna Guevara Torres", "comment_text": "Anna Guevara Torres"}, {"username": "Tegan Gee", "comment_text": "Coming from Australia and spent $20k before leaving home. But that’s flights, accomm, car hire for a couple days, a few trains between cities and really only one group tour."}, {"username": "Stephanie Ratcliffe", "comment_text": "all depends where from... speaking to a NZ couple last year in Rome where they paid 6k and we paid £200 for flights... I've just booked a month touring round Italy, Pisa, Naples, Sicily and Venice, all flights, cars and hotels for 3k"}, {"username": "Rana Umair", "comment_text": "I live in Italy and these are astronomical numbers for me. I guess the flights are the main reason for such expense."}, {"username": "Schalk Van Wyk", "comment_text": "We live in New Zealand and are in the final week of a four month trip (for 2). I used airpoints to pay for half the flights, by far the most expensive item. Most of our accommodation has been in airbnbs, and we have had a car for almost all the time. We have done quite a bit of eating out, but cooked for ourselves as well. We have spent a little over NZ$30k, so you should be fine."}, {"username": "Tracey Purdy", "comment_text": "I def think that’s doable. We are going from aus this year and flying business and it’s prob around the $15k mark. We are doing London 1st for 4nts then over to Italy for approx 5wks. Spending money I can’t tell u what that is yet. But everything is booked including a few food tours etc and some bfasts included."}, {"username": "Paul Anderson", "comment_text": "I learned to travel as a poor student. The lessons learned have allowed me to travel my whole life. In times of little money I would travel with tools and work for housing and food. How much you need is all based on how you travel. I could travel for a year with 18000."}, {"username": "Inna Rozen", "comment_text": "Also if you’re going end of July and into august Italy shuts down in august"}, {"username": "Rasha Za", "comment_text": "Your timing is awful in terms of the temperature and how hot it will be!"}, {"username": "Keri Catoe", "comment_text": "Nope. PM me and I’ll give you our costs for our 70 day Italy trip breakdown."}, {"username": "Maria Sulsona", "comment_text": "Sounds about right. My 2 week trip to London, Paris and Rome was about 4k for flights/trains/\nhotels (Additional expenses of course for food, tours, etc.). I flew from Los Angeles to Heathrow to start"}, {"username": "Tania Williford", "comment_text": "I don't see how it's possible? Unless you're going for extremely cheap accommodations or a hostel. Airfare and hotels alone will eat that budget."}, {"username": "Kerri Armitage", "comment_text": "It will be more expensive to go then as it's UK school holidays"}, {"username": "Ethan J. Felsing", "comment_text": "I think we're around $3k all in and we're about 4.5 weeks into our Euro trip. Two of us. But I travel on a teachers budget... On a night train from Barcelona to Paris right now 👍"}, {"username": "Robin Burrell", "comment_text": "Subtract the airfare because no one knows where you are flying from"}, {"username": "Tanya Luca Chetcuti", "comment_text": "We are heading over from Australia 🇦🇺 next week for a month 🙌🏻 we are at about $15500 for 2 adults. That’s flights, accomodation and transfers."}, {"username": "Lucrezia Folger", "comment_text": "WOW!! That's a lot of $$ to me."}, {"username": "Jennifer Kippert", "comment_text": "Serina Pippin"}, {"username": "Corey Anthony", "comment_text": "You would have to be food shopping and staying apartments not hotels. I could barely make that last 2 weeks let alone 2 months unless I completely changed my eating and activity habits. U can definitely stretch $18k farther than 2 weeks but after travel expenses I think your down to only $15,500 meaning around $258 left per day. If accommodations are $125 per day your left with $133 per day for food and activities. It’s cutting it pretty close , would be more comfortable with $23,000-$25,000\nfor that period. For what it’s worth we just came back from Croatia, Italy, Ibiza, Mallorca for 19 days and it was $25.5k. Hotels, restaurants for every meal and cabs and activities. We could have cut it down by $5k had we been more frugal on food and accommodations."}, {"username": "Karon Patterson", "comment_text": "We’ve been in Italy and Paris for 7 weeks and for 2 people we’ve spent $24000"}, {"username": "Ellen Edmonds-Wilson", "comment_text": "Probably not unless it’s for one person. Airfares alone in peak season are expensive."}, {"username": "Dianne West", "comment_text": "I just did 5 weeks from Australia, did UK, Netherlands and Italy. I reckon I spent about $12,000. I paid for food and drinks one day and my travelling companion paid for food and drinks the next day so depending on how much eat and drink you might squeeze it in. What $ are you converting from?"}, {"username": "Lisa Kelly", "comment_text": "If you be if you stay in pensiones and eat inexpensively. We spent more than that on four people for three weeks in Italy, Switzerland and France."}, {"username": "Maria Antidormi Corica", "comment_text": "We just spent 50K for 2 months"}, {"username": "Annie Nelhams", "comment_text": "Anyone on a really tight budget could look at House/pet sitting holidays - free accommodation in exchange for pet care"}, {"username": "Wendy Spano Bracco", "comment_text": "So I keep seeing posts like this. People are using the a TA that prepares a “package”. For these prices (I am up in your number) I am hand picking everything. No way I would just book some unknown package of stuff with no invoicing for everything."}, {"username": "Paula Gallagher", "comment_text": "Yes\nKeep your accommodations cheap that was one of the biggest expenses besides the flight ."}, {"username": "Claudia Villanueva", "comment_text": "Sounds good.. I spent $9k in 2019 from Texas to Egypt and Greece for 12 days. 9 days in Egypt and 3 days in Athens.."}, {"username": "Jennifer Avrett", "comment_text": "There are a lot of variables but the simple answer is yes."}, {"username": "Monica Roman-Fazio", "comment_text": "Depends on where your flying from. I just came back from Italy 3 weeks a family of 4 and it was well over 20,000"}, {"username": "Maria Coladangelo Ducca", "comment_text": "Errr depends . I usually allow 5k for two weeks ( and I stay free with relatives) . I think you are cutting it close. Please buy health insurance for traveling. Yes it is a waste of money . ( a twisted ankle on cobblestones will change tour mind). Remember the people who live there are used to the cobblestones in the mediaeval villages are used to them -u are not."}, {"username": "Joseph DellaFave", "comment_text": "No"}, {"username": "Jen Alexitch Rachow", "comment_text": "You start with a budget and find flights, transportation and accommodations to fit. That is how I plan. $18k for two months sounds like a comfortable budget to me. I could totally make that work!"}, {"username": "Sherry Shannon", "comment_text": "I could put it together myself for way less than that.\nBuy a ticket into one city and out another. Use Rome2Rio to book everything in between."}, {"username": "Greg Saba", "comment_text": "Your biggest expense will be lodging. As a couple, we budget $100/day for lodging, which is usually apartments, most of which include a washer. That would be $6,000. Rental or leased car $2,500/month or $5,000. Food, gas, tickets and miscellaneous, we usually average $100/day our $6,000, but we don't eat out every meal and do some cooking at home. (With all the beautiful produce in the many markets, it is difficult to pass that up). Airfare from US, depending on time of year is usually $1,000 pp or $2,000. So, for us, $19,000 would cover it. Add in travel insurance and maybe some type of health care, and your $20k makes sense. This allows a wonderful trip in clean, well-located apartments and mostly casual dining. You can spend more, or even tighten the belt a bit more."}, {"username": "Lauren Pennachia-h", "comment_text": "We spent double that for our two month trip! But included spending $$ as well!"}, {"username": "Richard Crundwell", "comment_text": "Natalia Litwinczuk ❤️"}, {"username": "Sarah Kam", "comment_text": "My trip is costing 20k for 5 weeks. This includes all flights, accomodation, transport and spending money. I am also from Aus."}, {"username": "Jason Urquhart", "comment_text": "$30k aud for 1 month for 3 of us. Hoping it doesn’t go over leave in 1 week."}, {"username": "Cathy Heikkinen Vogt", "comment_text": "July is extremely hot in Italy and Spain. Not sure about France. April/May and September/\nOctober are perfect. Less crowds. Not hot. Lines aren’t as long."}, {"username": "Lori Sammons", "comment_text": "The best and very economical is tripmasters and Greatvalue. We’ve used them twice in Ireland, 4x Italy, Greece and Spain. You can chose premium economy very minimal added to the whole tour"}, {"username": "Carol Mckie", "comment_text": "Flights can be over 2000 return alone"}, {"username": "Emilia DeCarolis-Tabback", "comment_text": "For our family I usually estimate the following average breakdown when we travel to Italy. This number is estimated & we stay in Italy.. so it does not include travel betwen counties. Per person: NJ to Italy\n1-Flight- $1000- 1200 average east coast to Italia ) we go summer so more $! Direct too\n2-Accommodation\ns - $100-125 night per person. We only do hotels and apartment/hotel\n3- Food / drink - we usually eat sit down casual dinner rest food on go - $75-90 day\n4- misselabeous ( transportation/\ntickets) -total 200-300$ 2 week stay\nThat = 11,500- 12,000on low end - if u cook all ur meals and stay in maybe lower….\nThat’s just my math… anyway hope that helps. Again u can save on food n board if you spend less and maybe Air BB- we like hotels though. Good luck 🍀"}, {"username": "Larry Reinier", "comment_text": "I hope so. Depends on you"}, {"username": "Laurel Frost Coffey", "comment_text": "Very doable."}, {"username": "Carrie Swanson", "comment_text": "I reckon about 30,000 for a family of 4 from Australia"}, {"username": "Laura Uribe", "comment_text": "We spend about that much for two months and that includes business air from the US. We do not stay at high end hotels so if you do, then I would think you will need more."}, {"username": "Jekaterina Valujeva", "comment_text": "There are cruises from Italy to France and than to Barcelona. That way you can save some money and enjoy the ship. Check MSC cruises🙂"}, {"username": "Dianne Rios", "comment_text": "I just got back from 3 weeks in Europe 2 if which were in Italy…. Way too hot 🥵 to enjoy it to the fullest. I don’t recommend July"}, {"username": "Jenny Payne", "comment_text": "My flight from Perth to Rome $2300 , paid for my window seat x 4 , insurance with my credit card + have been going for 16 years and would never go in peak season so hot , why not September or even October good months 🌻"}, {"username": "Jane Eichhorn", "comment_text": "My husband and I were in Italy from the U.S. in March and part of April for 16 days. Booked into a tour for 11 days and 5 on our own. We booked 5 months in advance. Venice, Pisa, Florence, Cinque Terre, Assisi, Rome, Pompeii, Sorrento and spent approximately $12,000 total! It was the week of Easter in part. Beautiful weather! Have fun!"}, {"username": "Immi Walker", "comment_text": "We’re doing 5 weeks for 18.5k\nUk/ England from aus\nTo Sicily, then flight to Naples and hormone a camper can for 2 weeks before flying Milan home\n\nWe’re not seeing much or doing any tours in Sicily\n\nThis includes all accomodation ( air bnbs ) and the camper , flights, passports, drivers liscence, for myself , son and husband and our hire cars are included with baby seat hire in all countries 🙂\n\nI’d say it’s doable"}, {"username": "Elie Loummer", "comment_text": "We just came back from 2 weeks in Italy and Greece and spent over 10k each. Flights are your biggest expense, We are also from Australia and spent $4k each on flights and we bought almost a year in advance!! Accommodation is your next biggest expense, its tricky to say as different regions have very different prices, we tried to balance with spending more on accommodation in some and less in others. Just do your research and know what your priorities are!"}, {"username": "Marita Bracun", "comment_text": "Not enough, for 2 people from Australia. Probs $10k more"}, {"username": "Dana Colantuono", "comment_text": "Another thing to consider - it may not help now but in the future - when I went to italy, I booked hotels/plane tickets using my credit card points I would have accumulated and AAdvantage points. This helps alot. My trip cost was cut in half!\n\nAlbeit I only went for 2 weeks - but I saw that the hotels were significantly cheaper when booking it through the AAdvantage Rocket Hotel listings on their website.\n\nSo if you don't have one already, consider a credit card that accumulates points towards travel. Just be super disciplined with the way you use it - I use mine for EVERY transaction, even for a stick of gum in the supermarket :)"}, {"username": "Carine Brys", "comment_text": "Imo there is no way we can answer that question. I'm assuming 2 people? Do you want to stay in AirBnB's or 5 star hotels? City trips or country-side? Maybe get a rough idea of what you would like and consult with a travel agent to get an idea of pricing?"}, {"username": "Phyllis Snyder", "comment_text": "I’m staying in Italy 59 days in 2024 and I’m figuring $12,OOO for flights, accommodations,\nfood, tickets, trains- one person me. I’m not going to spend big $ on restaurants- I’m staying at Airbnb moderate stays- and will travel by train and use Rick Steve’s audio guides for tours at major sites."}, {"username": "Frank Hunt", "comment_text": "Currency, types of stay, eating habits, the list goes on………."}, {"username": "Sascha Smith", "comment_text": "I feel like you can do this economically and intelligently! You need a travel agent and some research. There has to be some point if you are spending this much you are looking for everything to be high end or you are just setting money on fire. I’m not sure which. I’d love to know how this is adding out this way? Are you booking private transportation and staying the whole trip in hotels? I think you can make it Nice and be intelligent about it."}, {"username": "Gillian O'Callaghan", "comment_text": "Flights from where? Big difference between England and New Zealand.\nWhich currency are you talking? I've been travelling in UK and Europe for 5 months so can help."}]}, {"id": "2195185380880540", "text": "Ortisei - Italian Dolomites\n\nThe view from our apartment for the next few days 😍\n\n📷myself", "link": "facebook.com/groups/1373361046396315/permalink/2195185380880540/", "likes": 98, "comments": [{"username": "Marie Cuzzi", "comment_text": "Lucky you!!!"}, {"username": "Kim Paetsch", "comment_text": "So beautiful"}, {"username": "Cristian Jimenez", "comment_text": "Karla tenemos que ir ahí 🤩"}, {"username": "Nauman Khan", "comment_text": "Nauman Khan"}, {"username": "Nauman Khan", "comment_text": "Nauman Khan"}, {"username": "Nauman Khan", "comment_text": "Nauman Khan"}, {"username": "Limor Markovich Meshulam", "comment_text": "מהמם מגיעים לאזור בסוף ספטמבר"}, {"username": "Fiorela Zegarra", "comment_text": "Wow is beautiful!!❤️"}, {"username": "Janie Patri Thomason", "comment_text": "Absolutely gorgeous!!!If you don’t mind, could you share apartment info, going to that area next year. Thank you"}, {"username": "Francesca Ballarino Hudson", "comment_text": "I want to visit this place!!!"}]}, {"id": "2195185620880516", "text": "For anyone looking for Colosseum tickets for July 21! They just opened for this date! A lot of tickets available! Hurry up!!!", "link": "facebook.com/groups/1373361046396315/permalink/2195185620880516/", "likes": 4, "comments": [{"username": "Nadia Nadia", "comment_text": "Can i have the link please"}, {"username": "Mona Radkani", "comment_text": "I downloaded the app and look at the availability there.\n\nhttps://\necm.coopculture.\nit/\nindex.php?option\n=com_snapp&view\n=event&id=D7E12\nB2E-46C4-074B-5\nFC5-016ED579426\nD&catalogid=DDD\nA3AB3-47BC-0A49\n-7752-0174490F6\n32A&lang=en"}, {"username": "Brenda Marie", "comment_text": "I have got 4 tickets available for sale will selling cause of personal issues.. please message me if anyone interested in buying them"}]}, {"id": "2195190910879987", "text": "Ciao! Do you know any beautiful places in Calabria?", "link": "facebook.com/groups/1373361046396315/permalink/2195190910879987/", "likes": 0, "comments": []}, {"id": "2195195487546196", "text": "Planning trip for next July. Only time i can go. Planing for Venice Florence Rome Amalfi. First and main question is flights. Leaving from nyc. I had planned flying into Venice. Head south via trains. Then fly out of Naples. But these flights are crazy expensive. Most reasonable seem in/out of Rome but not sure. Any suggestions/experiences?", "link": "facebook.com/groups/1373361046396315/permalink/2195195487546196/", "likes": 5, "comments": [{"username": "Dave Colleen", "comment_text": "We are here now. Flew from JFK direct to Venice. Doing the same going back."}, {"username": "Phyllis Snyder", "comment_text": "Rome has more international flights in & out- Milan is the other. Best purchases are from these two because of volume of flights."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "If you can only go in July, don’t go. I’m just being honest. It it just too dangerously hot and very humid. Wait until you can go in a cooler month even if for a shorter time."}, {"username": "Glenn Todd Webb", "comment_text": "But how much extra will it cost in money and time to back track and catch extra time. Go in a line either north or south. I would fly into Naples and go straight to Amalfi on first day. Then head north and fly out of Venice. That’s minimum 14 days."}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "Recommend visiting as early in June as possible or a different season than Summer. Sweltering heat, insane crowds and pricing."}, {"username": "Roxanne Galari La Rosa", "comment_text": "Hi, try flying out of Newark into venice, then Florence, amalfi/naples via train, end your trip in Rome… fly from Fiumicino back to Newark, since you are in NYC, if that works. We booked tickets first week of January and got a great fare."}, {"username": "Lauretta Strysik Carroll", "comment_text": "We are doing Rome (round trip) because it’s nonstop both ways and good price. Upon arrival in Rome going first to Amalfi, then Florence, Venice, Cinque Terre and ending in Rome."}, {"username": "Liz Russo", "comment_text": "When I flew to Venice last year I had to connect in Heathrow omg what a pain getting from gate to gate especially after my flight was delayed leaving JFK. But I do love Marco Polo Airport on Venice. And not going to lie, I loved taking a private water taxi from airport to the hotel. It was pricy but omg lovely after the long flights and rush to gate and such."}, {"username": "Monica Roman-Fazio", "comment_text": "We flew out of jfk on emirates into Milan it was the cheapest"}, {"username": "Grace Scinto", "comment_text": "Price the train tickets for one way and then the other. You might find it comes out about even"}, {"username": "JoAnn Byrd", "comment_text": "Rome is more reasonable in flights. That’s where we are landing."}, {"username": "Rhona OConnor", "comment_text": "Go to some of the less crowded places in Italy .... So much nicer and less expensive. Head south by train in a couple of stops to somewhere like Bari and then fly back up to catch your NYC flight."}, {"username": "Nicole Beaumont", "comment_text": "What airline? United has daily flights out of Newark to Milan and Rome. It might be worth checking into if you haven’t already."}, {"username": "Dayna Steinberg Cioffi", "comment_text": "Delta JFK to Venice direct and then trains in between and fly from Naples through Paris back to JFK."}, {"username": "Chris Christou", "comment_text": "We bought a package for Rome through Expedia and airlines and hotel were cheaper. Than just purchasing airline tickets. I think it’s too early to book. Wait at least six months before your date"}, {"username": "Casarine Temple", "comment_text": "We’re flying into Rome and out of Venice ."}, {"username": "Frank Hunt", "comment_text": "Multi city flights are off the charts, we have the same dilemma so will probably fly in and out of one city if nothing changes."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2195202257545519", "text": "Hi all! We will have the opportunity to go from Switzerland to Italy August 17-20. I was thinking of flying into Rome as a home base. I am concerned a out the temperatures, places closing etc so wondering if maybe staying closer to the coast is probably better and doing a day trip to Rome? We've never been and I would absolutely love to go but hopefully it isn't the worst idea ever? I'm ok with 85* but 90-100* in crowded areas seems terrible. I'm open to staying wherever in Italy to be honest. Suggestions? Thank you soooo much!!", "link": "facebook.com/groups/1373361046396315/permalink/2195202257545519/", "likes": 2, "comments": []}, {"id": "2195202940878784", "text": "For anyone that is travelling from Bari to Rome via train I would consider flying rather than taking the train. Obviously more expensive to fly, but in this heat the train was way too hot. We had first class tickets but the air conditioning was only in the one section of the train that sold food/drinks. 2 hours into the 4 hour ride they had sold out of all cold drinks and ran out of ice cubes. Not an enjoyable train ride!", "link": "facebook.com/groups/1373361046396315/permalink/2195202940878784/", "likes": 0, "comments": [{"username": "Lara Rebecca", "comment_text": "I’m going in December and taking the train from Bari to Rome. Can you share the details of what train you took?"}]}, {"id": "2195204620878616", "text": "Good evening, I would like to ask a query regarding traveling with minors. I am 24 years old and I want to travel to Rome (with Ryanair/Air Malta) with my sister who is 14 years old. Since no parent or legal guardian is traveling with us, do I need to present any type of written documents, such as consent forms from the parents so my sister is able to travel with me, apart from her ID card and passport?\nTIA", "link": "facebook.com/groups/1373361046396315/permalink/2195204620878616/", "likes": 1, "comments": []}, {"id": "2195206697545075", "text": "Does anyone have any campervan rental recommendations for northern italy? Flying in to milan and looking at going via a lake and up to the dolomites. Would love recommendations or any advice if this is possible in a campervan please? Or is it best to hire a car and use hotels. Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2195206697545075/", "likes": 0, "comments": []}, {"id": "2195207920878286", "text": "Going in October for honeymoon! We will be visiting Rome, Positano and Sorrento.\nDoes anyone know what beach clubs are open in Positano and Sorrento? I’ve seen some close early October. We will be there from October 11-17th (Positano and Sorrento).\n\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2195207920878286/", "likes": 2, "comments": [{"username": "Sigrid Cormier", "comment_text": "You better check out their websites, so you know for sure."}, {"username": "Teri Haskins", "comment_text": "Yeah … you are right on the edge … dates are firm??"}, {"username": "Cathleen Huismann Dinubilo", "comment_text": "I was there last year at the beginning of October and most were already closed. Sorrento still had chair rentals on the pier but not on beach."}, {"username": "Carine Brys", "comment_text": "The Belair Hotel in Sorrento had gorgeous views of the bay of Naples and the Vesuvius from every single room + dining room + patio. And a swimming pool on the lower level. We were there the first week of October and all tours were still in full swing."}, {"username": "Stacy Prestigiacomo", "comment_text": "We just went to aritiza it was great !"}]}, {"id": "2195211584211253", "text": "Would like to plan a trip to Italy next summer June/ July. Sorrento,capri, Amalfi coast. Book with a tour or do it on my own?suggestions? Thank you 😊", "link": "facebook.com/groups/1373361046396315/permalink/2195211584211253/", "likes": 4, "comments": [{"username": "Raf Gervasio", "comment_text": "Do it on your own much easier forget hotels get an apartment its spacious much more comfortable we always do self catering now"}, {"username": "Starla Dawn", "comment_text": "On your own, get a private driver, book this airbnb 4711 Boutique Apartment and they will offer help with planning and it'll all be amazing."}, {"username": "Angela Genduso", "comment_text": "Been there do your own settle in Sorrento then take day trips . Ferry over to Capri for the day. Take a boat tour to positano and or Ravello etc"}, {"username": "Lisa Valdovinos", "comment_text": "We took a small tour (10people on the boat) to the Blue Grotto to see the cave and then to Capri for a few hours to explore on our own. It picked us back up and took us back to Sorrento pointing out some landmarks and other grottos. Lastly they stopped so people could swim. It was very nice."}, {"username": "Carmela Siniscalchi Frattellone", "comment_text": "I just went last month. I was nervous to book it on my own and so glad I did. We were able to go at our pace and see what we wanted to see. I knew what cities I wanted to go on and booked a couple of day tours. The longest one was 3 hours. Once you get started you won’t be overwhelmed"}]}, {"id": "2195212047544540", "text": "I am overnight in Turin soon. will have about 6 hours each day before next train to next destination. Had not planned on this. Any must dos. I will be within 15 mins of Porto Nuova station. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2195212047544540/", "likes": 2, "comments": [{"username": "Connie Wilson", "comment_text": "You could easily visit the Egyptian Museum and take elevator to the top of Mole Antonelliana for a great view of the city. Walk the historical center with its beautiful piazzas, buildings and palaces. Download WeTaxi app to order and pay for taxis if you prefer. Super easy to use."}, {"username": "Miyuki Kanno Paul", "comment_text": "Il Museo Egizio\nMusei Reali Torino\nCappella della Sacra Sindone"}, {"username": "Esther Steinbok Sustersich", "comment_text": "Thanks."}]}, {"id": "2195212944211117", "text": "Just got back from Italy a few weeks ago and this was one of the lovely beaches in Sirolo I had the pleasure of visiting! I am ready to plan my trip for next year! Can this wonderful group help?\nI want toआणखी visit Sardinia this time and as a family of 4 looking for ( my kids are older 22 and 16 so does not need to be little kid friendly)\n1- great recommendations for hotel or airbnbs.\n2-not to be missed beaches and natural sites\n3- best towns for exploring and siteseeing\n4- where to get the best food\n5- anything off the beaten path that can be fun.\nThanks friends!", "link": "facebook.com/groups/1373361046396315/permalink/2195212944211117/", "likes": 16, "comments": [{"username": "Enrica Palla", "comment_text": "I am Sardinian, so I think I can help you 🫠\n1. In Cagliari I can recommend you \"Sa fabbrica de Sant'Anna\", a lovely b&b, but if you want I can ask more specifically and in other cities\n2. Beaches from south to north (my favourites) Solanas, Villasimius, Chia, Tuerredda, Cala Cipolla, Piscinas, Mari Ermi, Cala Cartoe, Cala Luna, Cala Gonone, La Maddalena, Alghero.\n3. Cagliari and Sassari are very tourist friendly, and with a car and google maps you can move all around the isle. Don't stick to the coast and try visiting also the center: it is incredible and very genuine (and food is AMAZING).\n5: google \"canyon di Gorroppu\" and \"villaggio nuragico di Barumini\"."}, {"username": "Enrica Palla", "comment_text": "(also, I live in Marche and I teach specifically in the middle school of Sirolo :) hope you've had a great time here!)"}, {"username": "Kim Paetsch", "comment_text": "Amazing"}]}, {"id": "2195214477544297", "text": "Looking to stay in CAMOGLI. Anyone one know how many stairs there are from the train station down to the beach? I just want to make sure I can get back up easily:) thank you !", "link": "facebook.com/groups/1373361046396315/permalink/2195214477544297/", "likes": 0, "comments": [{"username": "Alejandro Gabriel Valenzuela Anghileri", "comment_text": "I have been there lots of times, don't remember much stairs"}]}, {"id": "2195217214210690", "text": "My son has been staying at a friends house in a tiny village about 3 hours East of Rome in the mountains. He now has a hire car for five days. Any suggestions of interesting places to visit along the East Side of Italy that are not too overcrowded and are likely to have accommodation? He has already spent 4 days in Rome at the beginning of the trip. Thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2195217214210690/", "likes": 1, "comments": [{"username": "Karen Ackerly", "comment_text": "Travel through the beautiful HillTop Towns and stop and wonder around"}, {"username": "Rhona OConnor", "comment_text": "We went to Pescara and Bari. Not crowded 3 weeks ago, might be different now. Lots of small places along the coast looked interesting. Worth wandering along."}]}, {"id": "2195225704209841", "text": "Best place/ website to book ferry for capri return from naples please and best place to find ferry times and bus times in capri to anacapri 🙌🏻 any information would be much appreciated", "link": "facebook.com/groups/1373361046396315/permalink/2195225704209841/", "likes": 0, "comments": []}, {"id": "2195228530876225", "text": "We are planning to spend 9 days in Rome this September. Considering a day tour to the Amalfi coast and maybe a day tour to Florence. We have never been to Italy and would love to see as much as possible during our trip. Would love to know any experiences with these tours.", "link": "facebook.com/groups/1373361046396315/permalink/2195228530876225/", "likes": 0, "comments": [{"username": "Gabrielle Wiseman", "comment_text": "A day tour to Florence sounds great because it only takes 1.5 hours to get there from Rome on the fast train! You can also reach Naples from Rome in 1 hour on a super fast train if you wanted to go there for the day to visit another city. There are also lovely places in Rome but outside the main city which you can visit such as Tivoli or Bracciano (super quick to get to on the train!)✨"}, {"username": "Nancy Matheny", "comment_text": "I would actually consider splitting your trip w 5 days in Rome and 4 in Florence. Do 1 or 2 days outside of Florence"}, {"username": "Judy Aswege Daley", "comment_text": "I would definitely split your time. 5 days in Rome and 4 days on the Amalfi coast."}, {"username": "Yuko Y Smith", "comment_text": "I would stay in Amalfi 3days, Rome 3 days, Florance 3days."}, {"username": "Heather MacDonald", "comment_text": "We did a day trip to Pompeii. I definitely suggest that!"}, {"username": "Miyuki Kanno Paul", "comment_text": "A day trip to Amalfi coast from Roma isn’t feasible."}, {"username": "Molly Mammarella Mullins", "comment_text": "F"}, {"username": "Dawn Burton Hammon", "comment_text": "I also would split it up if it makes sense for your situation. I'm going in. Sept. 2 days Florence, 3 days Rome, 6 days south of Rome, then to Switzerland for 3 nights."}]}, {"id": "2195230084209403", "text": "Looking to book my honeymoon to Italy/Greece.\n\nI’m wondering what people recommend?\nWhat is a NEED to see? What are the things people suggest to stay away from?\n\nLooking to book for October 2024; good or bad time to travel?", "link": "facebook.com/groups/1373361046396315/permalink/2195230084209403/", "likes": 2, "comments": [{"username": "Tracy Piko Lawniczak", "comment_text": "What are your interests? Venice is a walk and get lost in. Of course the typical sightseeing things there.\n\nFlorence we did winery tour,\n\nPositano is absolutely stunning. Tour to Capri. If you like hiking check out Path of God. Just breath taking."}, {"username": "Stefani Milne Alessandrini", "comment_text": "Join a group on Greece in addition to this one on Italy. Many of the islands shut down in late October. You’ll be able to get good advice from those groups on what is open and what’s not"}]}, {"id": "2195240250875053", "text": "Day trip ideas from Florence. We'd like to hit Pisa, but heard that's more like half a day. Can we combine that with another location nearby? Or are there other day trips we should look into?", "link": "facebook.com/groups/1373361046396315/permalink/2195240250875053/", "likes": 1, "comments": [{"username": "La Cinzia", "comment_text": "You can see Volterra, one of the oldest towns in Italy, very interesting and amazing"}]}, {"id": "2195234937542251", "text": "I can’t get a reservation for a bicycle tour because all require two person min. I’m by myself.\nAny suggestion ?", "link": "facebook.com/groups/1373361046396315/permalink/2195234937542251/", "likes": 0, "comments": []}, {"id": "2195241270874951", "text": "Is this any good please? Is it a full tour? Won't let me click on more info. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2195241270874951/", "likes": 0, "comments": []}, {"id": "2195242150874863", "text": "Hello everyone. We will be in Misano in September for the Motogp races. My partner is into the races more than I am. I was thinking of visiting San Marino while he is at the races. Any other suggestions?", "link": "facebook.com/groups/1373361046396315/permalink/2195242150874863/", "likes": 0, "comments": []}, {"id": "2195245297541215", "text": "favorite photo spots and restaurants in Milan!", "link": "facebook.com/groups/1373361046396315/permalink/2195245297541215/", "likes": 3, "comments": [{"username": "Robin Kronick", "comment_text": "https://\nwww.google.com/\nsearch?bih=878&b\niw=430&channel=\niss&rlz=1MDAPLA\n_enUS887US874&s\nource=mobilesea\nrchapp&sxsrf=AB\n5stBi6HpQOQ0j4G\nk6L2F9ax8joSGno\nFw%3A1689712098\n876&q=Duomo+di+\nMilano+Milan%2C\n+Metropolitan+C\nity+of+Milan%2C\n+Italy&ludocid=\n123576818322087\n72627&ibp=gwp%3\nB0%2C7&lsig=AB8\n6z5Vyc5mjStQF7l\nq0uLBDqQZf&lqi=\nCg5kdW9tbyBpbiB\ntaWxhbkiI9lxaHB\nAAGAAYAiIOZHVvb\nW8gaW4gbWlsYW4q\nBAgCEACSAQ9jYXR\nob2xpY19jaHVyY2\niaASNDaFpEU1VoT\nk1HOW5TMFZKUTBG\nblNVTmxiWEZwVVd\nKbkVBRaoBQhABKg\nkiBWR1b21vKAAyH\nxABIhv8VcfEFoY5\nHCmI6hKZevN0MIR\nz0l92M9UXXj4yEh\nACIg5kdW9tbyBpb\niBtaWxhbuABAA&p\nhdesc=X7sn14iK5\nmc&sa=X&sqi=2&v\ned=2ahUKEwj25bO\nLjJmAAxWJMlkFHW\n8VA2wQkbkFKAB6B\nAgHEAc&client=m\nobilesearchapp&\ncs=0&gsas=1&hl=\nen&v=271.3.5463\n69769&bshm=lbse\n%2F5#lpg=cid:Cg\nIgAQ%3D%3D"}]}, {"id": "2195262697539475", "text": "Thoughts on this water limousine tour to see this villa. Is there a reason to book a water tour to get there?", "link": "facebook.com/groups/1373361046396315/permalink/2195262697539475/", "likes": 1, "comments": [{"username": "Ilaria Verda", "comment_text": "To visit it you need to arrive in Lenno. From Lenno to this villa there is a 25 minute walk, partially uphill. There is also a taxiboat from Lenno"}]}, {"id": "2195251824207229", "text": "Beautiful Rome.", "link": "facebook.com/groups/1373361046396315/permalink/2195251824207229/", "likes": 166, "comments": [{"username": "Jonathan Barlow", "comment_text": "Rieley Allpress"}, {"username": "Carol Barone", "comment_text": "Beautiful I can not wait until my family and get to Rome"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2195268694205542", "text": "Spectacular even with the grey sky!😍🌈", "link": "facebook.com/groups/1373361046396315/permalink/2195268694205542/", "likes": 25, "comments": [{"username": "Jonathan Barlow", "comment_text": "Rieley Allpress"}, {"username": "Zita Lynch", "comment_text": "What church is this? And where?"}]}, {"id": "2195270107538734", "text": "We're planning a trip to Italy next April. We'll have 17 days, beginning in Venice and ending in Rome. My husband has not been to Italy before, except for a few days in Lake Como. We're starting in Venice, ending in Rome. Since my husband is a big car enthusiast, is it worth it to go to the maserati or ferrari tours or museums. I thought we could do Venice, Bologna (near the car museums) Florence/Tuscany/Umbria before Rome. All thoughts and suggestions are appreciated", "link": "facebook.com/groups/1373361046396315/permalink/2195270107538734/", "likes": 4, "comments": [{"username": "Suzanne Mills", "comment_text": "BMW museum in Munich is amazing."}, {"username": "Jeff Mulvihill", "comment_text": "Sounds like a good plan\nDon’t make it too busy; make time to just enjoy being in Venice, Florence and Rome"}, {"username": "Scott Perry", "comment_text": "Bologna is a great city!"}, {"username": "Alejandro Gabriel Valenzuela Anghileri", "comment_text": "Get a ride on a Ferrari, there's plenty of track experiences, look for \"Smartbox\""}, {"username": "Barbara Brosnan", "comment_text": "Was just there with my hubby and 3 of our kids. My 21 year old chose to postpone his birthday gift so he could drive a Ferrari in Maranello. Then the kids chipped in for hubby Father’s Day gift. They were beyond thrilled. Ferarri museum was good. We all agreed factory tour was a waste of time (and €), sat on a crowded bus for 50 min only to see the outsides of the buildings, would’ve preferred more time in the museum instead. I’m not a car person but the joy on their faces made my day."}, {"username": "Rhona OConnor", "comment_text": "We went to the Maserati factory museum and it was interesting, amazing cars on display. If you are going... Book the factory tour, that looked great. We just decided to go on the day so it was not available. Also across the road you can test drive a very sporty Maserati. It is about €200 for 10 mins. There is a public bus from Bologna takes about 45 mins."}, {"username": "Rhona OConnor", "comment_text": "Rhona OConnor"}, {"username": "Rhona OConnor", "comment_text": "Rhona OConnor"}, {"username": "Beth Heys", "comment_text": "Verona is worth a night or 2 if you have time. It's on the train line from Venice to Milan."}]}, {"id": "2195271384205273", "text": "We are staying in Pompeii the night before we plan to tour the ruins. I am looking for a guide. We can meet first thing in the morning before the crowds get there. Can anyone recommend someone and where’s the best place to get tickets before we get to the main gate?￼", "link": "facebook.com/groups/1373361046396315/permalink/2195271384205273/", "likes": 0, "comments": [{"username": "Barbara Brosnan", "comment_text": "We used Tours with Locals, private tour with Paolo Mondola, for our family of 5 and he was great!"}, {"username": "Cat Furness", "comment_text": "There are tour guides at the entrance you can get when you buy your tickets! Or you can get an audio guide and go by yourself, it’s very cheap."}, {"username": "Don Martin", "comment_text": "Don Martin"}]}, {"id": "2195273694205042", "text": "Hi, Going to Italy in September. I have a concern....I frequently need to use a restroom as I have a bladder condition. Are there places they let you use? Or do I have to actually be at a restaurant or café to use the restroom? A bit worried, silly I know!", "link": "facebook.com/groups/1373361046396315/permalink/2195273694205042/", "likes": 20, "comments": [{"username": "Bobbie Lane Hausherr", "comment_text": "Not a silly question at all!🥰"}, {"username": "Danielle Genest Godfrey", "comment_text": "Thanks everyone, it's very re-assuring! I will carry coins and TP with me."}, {"username": "Marita Bracun", "comment_text": "You do have to pay for some toilets, but find mc Donald's, kfc, etc. Walk into hotel lobby's like your staying there as there are always toilets on ground floor. Good luck."}, {"username": "Jill Brothers", "comment_text": "Carry one euro coins"}, {"username": "Louisa Curvelo", "comment_text": "Me too!!"}, {"username": "Mary Anne", "comment_text": "We had no trouble at all during the month we just spent in Italy. Only paid twice, and that was at railway stations. My motto is always use one when you see one, whether you need it or not."}, {"username": "Gabrielle Wiseman", "comment_text": "At some train stations you need to pay to use the tickets, so try to have some €1 coins handy! Other stations, especially more rural, have what I like to call ‘medieval toilets’ (you basically have to stand/squat and pee into a hole in the ground🤣). Otherwise if you’re out and about, I’m sure there are plenty of cafes/bars that will be happy to let you use the toilet! The italian phrase would be ‘posso usare il bango’ (bango pronounced like ‘ban-yo’) - I’m sure the staff would appreciate your effort at using italian!🫶🏽"}, {"username": "Cat Furness", "comment_text": "Get the Flush app, it shows where the public toilets are, very handy to have."}, {"username": "Karen Doblo", "comment_text": "Download the Flush App. You can find public toilets anywhere in the world."}, {"username": "Mary Peluchetti", "comment_text": "Buy yourself some leak proof undies eg- period pants. This helps in urgent situations"}, {"username": "Neville Spargo", "comment_text": "Flush is a great global toilet finder app!\nRestaurants for the most have good toilets for paying customers to use , always use them before you leave !"}, {"username": "Danielle Johnston", "comment_text": "You need to purchase something and I’ve haven’t had one bathroom without TP."}, {"username": "Heather Hills Jacobs", "comment_text": "Bring toilet paper with you and euros!"}, {"username": "Dianne McAuley", "comment_text": "Danielle Genest Godfrey, it’s not silly!! Many of us need to know if needed that there are accessible toilets nearby. It’s a fair question!! I’m thinking of going September, October next year. Enjoy your trip. 🤗🇦🇺"}, {"username": "Vicki Brozovich", "comment_text": "We had no problems. Don’t worry. Sometimes you may need a tissue, but fall less then in America!"}, {"username": "Patricia Greige", "comment_text": "Add 2 euros per time you use the bathroom to your budget. You can plan to buy something to eat each time you need to use the bathroom."}, {"username": "Bonnie Qn", "comment_text": "Bring coins (euro), so you can use the public restrooms, they are around. We even walked right in to 2 different McDonald’s in Rome- one was a 50 coin and the other free."}, {"username": "Joan Kraft-Bietz", "comment_text": "Just choose a restaurant that has outdoor seating walk into the back of it (bathrooms are in the back or downstairs) if u can’t see them ask waiter Bagno??? They have no idea if your a customer or not….. I did it countless times, good luck and don’t worry!"}, {"username": "Sue Waksmunski", "comment_text": "I purchased toilet seat covers from Amazon. I carried a small pack of travel tissues, and individual antibacterial wipes. All three of these fit into a very small and very nice zipper pouch. You can also add a few 1 Euro coins to the pouch. If you buy a pack of gum, or a cup of coffee in Italy you can use the bathroom in the restaurants for free.. Even many museums have a one euro charge to use the bathroom. I think it was Spain that you could walk right into any bar or restaurant and simply use the bathroom. Different cultures- different rules. But definitely consider bringing the toilet seat covers, personalized pack of tissues, and antibacterial wipes. Lots of toilets do not have seats"}, {"username": "Laura Uribe", "comment_text": "I have the same problem. We just stop for a water or coke if I need a restroom and there are not public restrooms available. Trains and train stations also have restrooms. Nothing to worry about."}, {"username": "Mike Carlstrom", "comment_text": "Well,,,, that depends…"}, {"username": "Phyllis Snyder", "comment_text": "Yes except to buy lots of coffee or cold drinks or pastries in cafes."}, {"username": "Maggie Gpe Banuelos", "comment_text": "In Venice no problem finding a public restroom but you have to pay one euro! In Florence and Rome we begged our bladders to do its business before we left restaurants! 😬"}, {"username": "Jennifer Walp Rydholm", "comment_text": "I am so glad you asked this question! I am stressing about this as my tummy can get upset. In Portugal last year the trains we took did not appear to have a bathroom…my nightmare to be trapped on a moving vehicle for an hour or two without. I am downloading the flush app and creating my itinerary for September around it 😂. We will be there 9/24… we will both be looking for facilities!"}, {"username": "Kimberly MacKinnon Cherry", "comment_text": "Download the flush app. It shows you where public bathrooms are worldwide"}, {"username": "Carol Ryan", "comment_text": "Blimey half the people on here should be called 'Karen'"}, {"username": "Diane Lebel", "comment_text": "What about strolling on ,and asking quickly ,may i go to the bathroom, its urgent\nThank you"}, {"username": "Emma Conyers", "comment_text": "It's not silly if it's a medical requirement. Please don't feel it is. I would recommend taking some tissue with you though xx"}, {"username": "Diane Grodzki Smith", "comment_text": "Wear a diaper lol 😂 🤦🏻‍♀️"}, {"username": "Megan Beals", "comment_text": "I saw a tip online to use library bathrooms"}, {"username": "Alla Pechersky", "comment_text": "We are in Italy now and have not had any issues with finding washroom to use. Walk into any medium to large size restaurant and use the facilities. The small places may not have a toilet for the customers."}, {"username": "Billie Begley", "comment_text": "My husband had the same issue. We bought lots of bottled water just to accommodate. We found it to be problematic. Also during the afternoon lots of restaurants were not open. Small cafes that served Cappuccino were his best options."}, {"username": "Wendy Harrison", "comment_text": "Take a couple of small toilet paper 'ends', in ziplocks, and keep one on your purse."}, {"username": "Miyuki Kanno Paul", "comment_text": "It’s nothing silly about it at all! I search restrooms quite often as a matter of fact. A great excuse to get un caffè or aqua for €1 or €2 at a bar, and go straight to the restroom. Bring some tissues and be prepared to squat! I carry a small roll of TP in my bag. Some restaurants actually have an attending maid charging for 50 cents for the service, by the way."}, {"username": "Sara Beth", "comment_text": "Here now and I use the bathroom a lot. No issue-just buy a water or drink or snack and use it! And carry one euro coins in case."}, {"username": "Allison Mir", "comment_text": "There is a really useful app you can download called Flush"}, {"username": "Marisa DePalma", "comment_text": "Have to pay for toilet in some places"}, {"username": "Karen Schmidt", "comment_text": "I drank a lot of decaf espresso lol. One to 2 euros for the espresso, and I could use their bathroom when I needed. ￼"}, {"username": "Mishaela Nobbs", "comment_text": "Pack tissues/toilet paper with you and buy a bottled water or snack if you go into a cafe. We didn’t have many issues with finding places."}]}, {"id": "2195171510881927", "text": "Picture-perfect towns, boat rides, amazing landscapes, archaeological sites and delicious food…that, and much more, is a journey to Sicily.\nPlaced in the heart of the Mediterranean Sea, Sicily is the dream ofआणखी every vacationer who loves nature, culture and history.\nJoin our virtual experience: https://nextstop-italy.com/virtual-tours/best-of-sicily/\n\n#medievalart #italytravel #italyiloveyou #virtualworld #italytrip #vacationmood #sicily #sicilylove #sicilyitaly #sicilytravel #sicilyessence #sicilytourism #sicilypictures #TAORMINA #taorminasicily #cefalù #cefalusicily #ValleyoftheTemples #syracuse #ortigia #ortigiaisland #palermo #palermo #archaeology", "link": "facebook.com/groups/1373361046396315/permalink/2195171510881927/", "likes": 15, "comments": [{"username": "Mary Gallardo", "comment_text": "BELLISIMAS FOTOS FELICITACIONES.\nGRACIAS POR COMPARTIRLAS.-U\nRUGUAY.🇺🇾🇺🇾🇺🇾🇺🇾🇺🇾🇺🇾"}, {"username": "Mary Gallardo", "comment_text": "Mary Gallardo"}]}, {"id": "2184458038619941", "text": "Don't miss a stay here...a heaven on earth!\nEvery where you look could be a postcard or picture...you are at La Lupaia, between Montepulciano and Pienza, Lupaia is an ancient farm estate dating back to 1622!🥰आणखी\nDiscover more here: https://www.jdoqocy.com/click-100692842-11552042?url=https%3A%2F%2Fwww.tripadvisor.com%2FHotel_Review-g608934-d1015571-Reviews-Lupaia-Torrita_di_Siena_Tuscany.html", "link": "facebook.com/groups/1373361046396315/permalink/2184458038619941/", "likes": 70, "comments": [{"username": "Andrew Raymond Lynch", "comment_text": "LeeAnne Lynch"}, {"username": "Guy Blackburn", "comment_text": "Liesel Wett"}, {"username": "Tammy Jo", "comment_text": "Tessa"}, {"username": "Debbie Dickson", "comment_text": "Stunning 😍 😍 😍"}]}, {"id": "2155591041506641", "text": "Amalfi Coast Kayak Tour along Arches, Beaches and Sea Caves\nExplore hidden caves and coves along the Amalfi Coast that aren’t accessible by land or large boats with this unique sea kayaking experience. Set off… आणखी with your local guide and kayak instructor to skirt the coastline and paddle right up to picturesque spots like tiny beaches, natural rock arches, historic watchtowers, and sea grottoes. Enjoy commentary about the coastal sights and pose for souvenir photos along the route.\nRead more about Amalfi Coast Kayak Tour along Arches, Beaches and Sea Caves - https://www.viator.com/tours/Amalfi/Amalfi-Coast-Kayak-Tour-along-Arches-Beaches-and-Sea-Caves-Half-day/d33601-116993P2?pid=P00070587&mcid=42383&medium=link&medium_version=selector", "link": "facebook.com/groups/1373361046396315/permalink/2155591041506641/", "likes": 37, "comments": [{"username": "Kim Butler Oam", "comment_text": "I love this 😍"}, {"username": "Vicki OBrien Lush", "comment_text": "Ken Lush"}, {"username": "Rhonda Baynard", "comment_text": "Kayaking in Italy.. that will be a dream come true!"}, {"username": "Liz Miller-Boone", "comment_text": "Dan Boone"}, {"username": "Gbri-Èle Mrn", "comment_text": "Nabelle Gagné"}, {"username": "Jo Courage", "comment_text": "Oooh wow 😮 looks gorgeous!! Would be lovely & peaceful to do this ❤️🥰 Paul McCarthy"}, {"username": "Jo Courage", "comment_text": "I’m loving all the ideas & suggestions on the site! So helpful & positive, makes me SO excited to explore Italy 🇮🇹 next year"}, {"username": "Samantha Jane Smith", "comment_text": "Alec Smith !"}]}, {"id": "2195024410896637", "text": "Churches, towers and noble palaces… a small picturesque town perched high on a hillside surrounded by olives trees as far as one can see : come explore Trevi!\nJoin us: आणखीhttps://nextstop-italy.com/virtual-tours/trevi-capital-oil/\n\n#virtualworld #italygram #ravelloitaly #umbria #renaissanceart #hilltown #umbriagram #assisi #virtualtour #medievalart #umbriatourism #Spello #hiddenparadise #vacationmood #italytravel #italyiloveyou #hilltopviews", "link": "facebook.com/groups/1373361046396315/permalink/2195024410896637/", "likes": 5, "comments": []}, {"id": "2193887287677016", "text": "We just returned from Italy and we loved our boat tour around the island of Capri with Paolo. He offers various tours. We stayed in Sorrento, took the ferry to and from Capri which was great, and simple. Thisआणखी group offered lots of great advice and tips for our trip so I want to pay it forward by sharing this link with you.\nhttps://www.amazingcapritour.com/index.html", "link": "facebook.com/groups/1373361046396315/permalink/2193887287677016/", "likes": 5, "comments": [{"username": "Betty Stilt", "comment_text": "Thanks! Very helpful."}, {"username": "Janis Hall Bockelman", "comment_text": "Was the cost of this per person or the entire boat?"}, {"username": "Raf Gervasio", "comment_text": "Thanks for the tip just booked with Paolo...looking\nforward to it"}, {"username": "Mary Spring", "comment_text": "Is something like this very bumpy? A member of my group gets seasick very easily. It looks so nice!"}]}, {"id": "2194344557631289", "text": "This page has been so helpful for me and so I want to pay it forward. For those of you wanting to go to the Pantheon in Rome. Get your tickets BEFORE you go. It will save you a lot of time and stress with the heat and system not working properly. Trust me. First day we went and could not get the app to work, the line for tickets was really long and it was HOT so we gave up. I was able to get them from my computer and go back without any line.\nUse the link below to get to the site: Create your login > Choose your tickets > Go to your cart to checkout > It will take you to another site where you input your email address > Then you must choose your payment option. * I was able to ONLY get Paypal to work through Intesa Sanpaolo S.p.A. option. Click on \"other payment options\" to get to that. That was the ONLY way that would work for me. I am SO glad I do not have to wait in that long line today in this 100 degree heat.\nHere is the link: https://portale.museiitaliani.it/\n\n(You may have to click another link on this page to get there but it’s possible)\n\nAnother tip: Rick Steves free tour is perfect for the Pantheon! Save your money for more gelato! ❤️", "link": "facebook.com/groups/1373361046396315/permalink/2194344557631289/", "likes": 10, "comments": [{"username": "Melissa Freas", "comment_text": "We'll be in Roma the beginning of October, so I'm going to wait to buy my tickets. Hoping they'll have some of the kinks worked out by September."}, {"username": "Nadia Nadia", "comment_text": "Hi the link didn’t work"}, {"username": "Allison Taeger Wilson", "comment_text": "Thanks for the info about PayPal I have been trying directly with my credit card and haven’t been able to get it to work. Used PayPal and got them booked for next Monday at 10:00 am."}, {"username": "Coco Cole", "comment_text": "Thanks!!"}, {"username": "Haley Lassiter", "comment_text": "My pantheon experience, in June, we tried getting in with a group of 8 people day of, and the staff said it was sold out. We were quickly approached by a guide company who said they had tours going every 45 minutes for 15 euros. We went with them and it was great, got a complete guided tour of the inside. It seems there are guided tour groups like this watching for people trying to get in and then failing. We got to completely skip the entire line too. 😊"}, {"username": "Joseph Manzo", "comment_text": "Maria Teresa Manzo"}, {"username": "Chelsea Gudith", "comment_text": "Todd Gudith"}]}, {"id": "2194845660914512", "text": "Hi all. Any updates on the Catania airport closure (latest Google news is re-opens Wednesday at 2pm). We are in Ortigia and due to fly from Catania to Rome tomorrow at 11.40 am and then onwards to Sydney late Thursday. Our airline ITA sent an email yesterday asking us to check in to our flight? Currently on hold with them. Any updates/advice much appreciated! Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2194845660914512/", "likes": 2, "comments": [{"username": "Alessandro Iannelli", "comment_text": "Part of the airport has already opened, so not all flights have been cancelled. As you correctly write, by Wednesday, 2 p.m., the airport should be fully operating. My advice is to follow closely the development of the situation on the website of ITA, like every two hours or so. there is a chance they will move your flight to either Palermo or trapani, as they have already done with some flights."}]}, {"id": "2195000904232321", "text": "Trying to arrange a day trip from Rome to Pompeii. I was looking at getting the train and then a tour guide at the site, but have seen coach trips are an option too. When I look at booking trains they all seem to be very different times, prices and often the final station isn’t Pompeii Scavi. Anyone offer any advice or help?! I was looking at going Sunday 13th Aug but could go on the 12th if travelling Sundays is more difficult. Thank you 😊", "link": "facebook.com/groups/1373361046396315/permalink/2195000904232321/", "likes": 1, "comments": [{"username": "Jennifer Pace Kirby", "comment_text": "Go to website seat61 and there are directions on how to get there. You will take the high speed train to Naples and then get on the regional train to Pompeii Scavi stop. I think in the summer there is a train that goes from Naples to Sorrento with a stop at Pompeii. We were there in February and took the regional train. The tourist train wasn’t running then. It is a pretty slow train but it totally worked. It will be super hot on the regional train and probably crowded. There is no air conditioning. You could also hire a driver to pick you up at the train station and take you to Pompeii. You can also do a tour that will handle the transportation.\nI personally would not take a bus from Rome to Pompeii. That will waste a bunch of time. Maybe there is a tour that picks up at the train station. Good luck!"}, {"username": "Miyuki Kanno Paul", "comment_text": "First of all, you need to take a high speed train called Frecciarossa or Italo from Roma Termini to Napoli Centrale. Then go underground path to Piazza Garibaldi/\nCircumvesuviana station. Purchase ticket to Pompeii Scavi(buy round trip tix at the window). Only Circumvesuviana\nSORRENTO LINE stops at Pompeii Scavi.\n\nFor high speed trains, download Trenitalia app or Italo app."}, {"username": "Mark Williams", "comment_text": "Every time I took a train I just searched \"high speed train city \"x\" to city \"y\" and it would come right up"}]}, {"id": "2194784650920613", "text": "In Australia we have Salvos, Vinnies etc., where people donate all unwanted clothing..(and other items).\nDoes anyone know if Italy has these kinds of outlets? or secondhand clothing stores?", "link": "facebook.com/groups/1373361046396315/permalink/2194784650920613/", "likes": 2, "comments": [{"username": "Ingrid Zancoli", "comment_text": "Second hand stores can be found in every town, but then people can give clothes in good condition to several associations or to their neighbourhood church."}, {"username": "Alessandro Iannelli", "comment_text": "If you want to donate clothes, you have to put them into a plastic bag and throw them into one of those big containers (they are usually but not always in bright yellow) that say \"raccolta vestiti usati\" or \"raccolta indumenti usati\". If instead you are interested in buying used clothes, there are places where you can buy them, depending on the city."}, {"username": "Sally Warren", "comment_text": "There are second hand shops in Rome esp. Monti area.\nIn Google maps enter Thrift Store. That said, France was better……."}, {"username": "Jenny Payne", "comment_text": "Only through churches I found, they have vintage shops but nothing like Australia has charity shops 🌻"}]}, {"id": "2194813440917734", "text": "We are thinking about spending our 30th anniversary is Italy in May 2024. We’ve been before and did all the big stuff. We want 7-10 days of just relaxing, maybe some beach time and maybe a day trip or two. Trying to stay away from overly crowded areas. I just want to eat and drink lots of coffee! 😂Any suggestions ?", "link": "facebook.com/groups/1373361046396315/permalink/2194813440917734/", "likes": 2, "comments": [{"username": "Ryan Monahan", "comment_text": "Spend half in a small town in Tuscany, and the rest on the coast. We were just there for 16 days and we spent 4 of them near a small town called Reggelo, about 30 min from Florence. It was quiet and we had a rental car to cruise around during the days exploring and doing wine tastings. Absolutely loved it. Another option Lucca, it was a little busier but still one of the quietest spots on our trip we loved it."}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "Look into Ischia (island in bay of Naples) for beach and local feel. Great resorts and vibe at a fraction of Amalfi Coast. Know for its thermal waters and hot springs."}, {"username": "Anita Clayton", "comment_text": "We have just booked Tropea for September Chill week."}, {"username": "Francesca Russo", "comment_text": "May can be very hot, but it can also be very rainy. If you want to be sure to find a perfect weather to relax and have some sea time, you should go to Sicily. Sicily has both some of the most beautiful beaches of Italy and wonderful cities to visit."}]}, {"id": "2194815534250858", "text": "My painting of Florence\n\nThe beauty of Florence is in layers.\nWith each discovery, I fall deeper in love.\nFlorence has captured my heart.", "link": "facebook.com/groups/1373361046396315/permalink/2194815534250858/", "likes": 371, "comments": [{"username": "Mary Gregory", "comment_text": "Mary Gregory"}, {"username": "Yuko Konno", "comment_text": "Wow! Amazing!"}, {"username": "Lynn Johnson", "comment_text": "Amazing!!!! What a talented capture of the beauty Florence holds."}, {"username": "Christine Rickert", "comment_text": "Your style of painting adds a vintage feel to this landscape. Love your choice of colors too. Beautiful painting."}, {"username": "Grace Romano", "comment_text": "Grace Romano"}, {"username": "Chezza De Venish", "comment_text": "Very impressive!"}, {"username": "Patti Bauman Widener", "comment_text": "Beautiful!"}, {"username": "Michele Trial Westerman", "comment_text": "Wow that s excellent!"}, {"username": "Joy Divine Sholty", "comment_text": "Very nice!!"}, {"username": "Sally Ann Tanasi", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Kathleen Craig", "comment_text": "Beautiful"}, {"username": "Arleen Booth D'Avis", "comment_text": "Arleen Booth D'Avis"}, {"username": "Joanne Wright", "comment_text": "Beautiful!"}, {"username": "Susan Duwall", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Carmen Martin", "comment_text": "Beautiful 👏👏👏"}, {"username": "Dawn Fannin Cepeda", "comment_text": "What a beautiful painting. You are talented."}, {"username": "Linda Deciccio", "comment_text": "Fabulous"}, {"username": "Angela M Smith", "comment_text": "It has my whole heart too! I think my fave Italian city now."}, {"username": "Rachel Parrish", "comment_text": "wow, such a GREAT job!"}, {"username": "Denyce Dean", "comment_text": "Absolutely stunning!"}, {"username": "Paula Marsiglio Nave", "comment_text": "Beautiful painting."}, {"username": "Marilyn Del Rosso", "comment_text": "It’s one of my favorite cities in Italy other than Verona!!!"}, {"username": "Marsha Lewis", "comment_text": "Beautifully done. 🙏♥️🥰"}, {"username": "Susan B. Corino", "comment_text": "Beautiful picture"}, {"username": "Barbara McMahon", "comment_text": "Wow!"}, {"username": "Mirsada Miki Mikica", "comment_text": "Absolutely gorgeous♥️"}, {"username": "Susan Tan", "comment_text": "Beautiful"}, {"username": "Rebz Sprung", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Luigia Gray", "comment_text": "Beautiful painting"}, {"username": "Letisha Withrow", "comment_text": "Stunning!!! 😍😍😍 I wish we had spent more time in Florence. I do plan to go back 😍😍"}, {"username": "Rosalinda Winco", "comment_text": "Very nice!"}, {"username": "Desiree Leyden Kuhnlein", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Larissa Miller", "comment_text": "Beautiful."}, {"username": "Nicole Beaumont", "comment_text": "Beautiful. I fell in love with Florence too."}, {"username": "Martha Lovett", "comment_text": "Beautiful, what a wonderful capture of lightning!"}, {"username": "Ildiko Gyimesi Mikos", "comment_text": "Beautiful ♥️"}, {"username": "Nancy Cicchino Knoeller", "comment_text": "Beautiful! One of my favorite places too!"}, {"username": "Louise Faggioni", "comment_text": "Louise Faggioni"}, {"username": "Cherie Compartore", "comment_text": "beautiful"}, {"username": "Bev Symes", "comment_text": "excellant\nDid you do it there"}, {"username": "Claudia Evans Williams", "comment_text": "Same here. You’ll never forget it."}, {"username": "Susan Vogel", "comment_text": "U are talented"}, {"username": "Sharon Lehmann", "comment_text": "Absolutely stunning! I love Florence as well"}, {"username": "Cindy Holtfreter", "comment_text": "Absolutely stunning!"}, {"username": "Maria Giglietti Emmerich", "comment_text": "Love this"}, {"username": "Elizabeth Best Christensen", "comment_text": "Gorgeous!"}]}, {"id": "2194825977583147", "text": "Best place to stay for two adults and two 12-year-olds during Naples Pizza Festival 2024?\n\nSomewhere safe, central and preferably quiet.", "link": "facebook.com/groups/1373361046396315/permalink/2194825977583147/", "likes": 2, "comments": []}, {"id": "2194844887581256", "text": "Hi all...hubby and I are planning a trip to Italy for our 25th Anniversary 😊 We were thinking mid September 2024...is this a shoulder season? How are the crowds during this time?", "link": "facebook.com/groups/1373361046396315/permalink/2194844887581256/", "likes": 1, "comments": [{"username": "Glenn Todd Webb", "comment_text": "It is. Much less."}, {"username": "Mike Ball", "comment_text": "It’s a good time to go , it’s much quieter as most families have had their summer holidays and the children are back at school,\n\nIt’s still very warm but not as oppressive as July and August."}, {"username": "Mary-lou Lorusso Pretorius", "comment_text": "Hi Dale. Mid September is a good time as weather is still good and the tourist season should be over. Try including Amalfi coast. It's stunning 😁"}, {"username": "Mari Gibbs", "comment_text": "This sounds like a fun trip. Have fun planning!"}]}, {"id": "2194905394241872", "text": "WHEN YOU GO TO\nROME\nIS BETTER TO\nHOTEL BY VATICAN\nOR COLOSIUM", "link": "facebook.com/groups/1373361046396315/permalink/2194905394241872/", "likes": 40, "comments": [{"username": "Anne Mc Namara", "comment_text": "We stayed near Castle Sant'Angelo. Easy walking distance to most places. We walked to the Vatican,The Trevi fountain,The Spanish Steps and The Capuchin Crypt from there. We got the Metro from the Crypt to the Vatican"}, {"username": "Valerio Fenni", "comment_text": "Colosseum is connected better with airports metro and others touristic points of interest"}, {"username": "Russell Weidner", "comment_text": "The Pantheon"}, {"username": "Vickie Scobie", "comment_text": "I agree Spanish Steps or Trevi. We stayed in between and it was very easy walking."}, {"username": "Jason Hobel", "comment_text": "We stayed right in the middle so we had access to both sides of the river to see everything. We stayed at Kame Hall and it was a nice place."}, {"username": "Beatriz Davalos Moreno", "comment_text": "We are a block of Trevi fountain right now, lots to do here! Colosseum at about 8 minute ride and only 10 euros for ride"}, {"username": "Beatriz Davalos Moreno", "comment_text": "Wonderful Airbnb at 360 dollars per night with 2 bedrooms, modern, clean and at the center of town!"}, {"username": "Kim Finger McCormack", "comment_text": "We stayed between the Vatican and Castle Sant Angelo and loved it. Very quiet but good restaurants."}, {"username": "Cameron Smith Bradley", "comment_text": "Just different places. I really loved our neighborhood near the coliseum."}, {"username": "Skye Birch", "comment_text": "colosseum is a great location short stop to terminal and from colosseum you can pretty much walk to trevi fountains and also alone the river to the castle and vatican"}, {"username": "Claudia Amp", "comment_text": "Stay in Monti and you’ll be a few blocks from the Colosseo; it’s a very nice area, close to Termini station but safe, have lots of locals so not too touristy; easy access to supermarkets, shops and good restaurants. Vatican is not too central and convenient if you want to easily get to other attractions in the city center."}, {"username": "Jacqui Strubel", "comment_text": "Near Trevi"}, {"username": "Susie CB", "comment_text": "When I stay longer I like to stay out of center in a neighborhood with lots of locals … non crowded restaurants and bars…. But I also LOVE to walk… Prati is where I stay https://\nabnb.me/\nOVylMmedxBb"}, {"username": "Kriste Feltman", "comment_text": "Colosseum is closer to everything else"}, {"username": "Heather Murawinski Comerford", "comment_text": "Colosseum"}, {"username": "Ann Di Lallo Blakeney", "comment_text": "I prefer the Trevi fountain area ❤️"}, {"username": "Chrystal Stevens Bisonet", "comment_text": "Depends on personal preference! 🙂 I’m Catholic and love the option of waking up early and going to St Peter’s to quietly reflect before the crowds hit. What’s nice is there is a metro stop right by our Airbnb, so we can get around Rome easily."}, {"username": "Joanna Topor", "comment_text": "Spanish Steps was our choice. Also, Vatican is a small distance from everything else."}, {"username": "Terry Massaro", "comment_text": "The Pantheon……Hotel\nNationale, great location"}, {"username": "Hassan Ali Maki", "comment_text": "Vatican"}, {"username": "Jane Ortiz Casarez", "comment_text": "We stayed in an apartment near the colosseum when we went and LOVED it but that was 10 years ago. Not sure how much has changed since then"}, {"username": "Justyna Leniartek Taunt", "comment_text": "We stayed right by the Colosseum and it was very nice since you can get around anywhere by bus or metro. That said, I prefer the Prati neighborhood which is where we would stay next time!"}, {"username": "Hudd Cass", "comment_text": "I’ve also stayed near Centrale Station before and it was fairly central and easy to get around."}, {"username": "Mindy Nguyen", "comment_text": "Close to the colloseum so it’s more centralized to the other things like the pantheon, Trevi fountain, Spanish steps etc. (walkable distances)\n\nYou’ll likely only be in Vatican just for the museum tour, Sistine chapel, and St. Peter’s which can be done in half a day."}, {"username": "Ginger Smith Simpson", "comment_text": "Collosseum"}, {"username": "Kem Wardlaw", "comment_text": "Trianon Borgo Pio (Vatican area) was very nice"}, {"username": "Angie Callejas", "comment_text": "Stayed near near Piazza Del Popolo it was near everything. It was also a central pick up for tours."}, {"username": "Paula Gallagher", "comment_text": "We stayed top of Spanish steps it was so central to every thing ."}, {"username": "Janette YesPlease", "comment_text": "We stayed near the Colosseum and found it very touristy for restaurants and cafes at our location. However, on a stay a few weeks earlier, we loved the Campo de Fiori area. Still somewhat touristy but very close to many of the sites, and we found several great restaurants, particularly one of the best gelato shops next door to our accommodations.\nWe also loved how the square transitioned from the day market to nightlife with different bands and entertainment outside our window."}, {"username": "Eka Chelidze", "comment_text": "Vatican of course ...👍👍"}, {"username": "Ken Lerch", "comment_text": "Both are in fringes of city center but Vatican even a little further since it is across river. But both have nearby metro."}, {"username": "Lisa Martinson", "comment_text": "Spanish steps or trevi is my preference"}, {"username": "Charlotte Reid", "comment_text": "Colosseum as you’re more likely to spend more time in this area"}, {"username": "Ros Birch", "comment_text": "Close to Termini. You can get anywhere from there."}, {"username": "Marie Cuzzi", "comment_text": "Colosseum is my choice 💕💕"}]}, {"id": "2194896374242774", "text": "Hi has anyone ever gone to Monte Faito from Sorrento? Any suggestions on transportation and things to do would be great. TIA", "link": "facebook.com/groups/1373361046396315/permalink/2194896374242774/", "likes": 0, "comments": [{"username": "Giuseppe Placi", "comment_text": "Train to Castellammare and then funivia from there"}]}, {"id": "2194944677571277", "text": "Ciao Bella Italia!!! All I got to say everything was breathtaking!!! My daughter and I had a marvelous time walking practically towards every place:;beating the crowds and heat at 5 am hours ; getting lost andआणखी laughing like crazy cause we would run into new things we had no knowledge of and loving that!!! Last stop was Milan as shown here and all I can say is “I’ll be back!🙏”", "link": "facebook.com/groups/1373361046396315/permalink/2194944677571277/", "likes": 89, "comments": [{"username": "Mary Evans", "comment_text": "Once is never enough"}, {"username": "Melissa Bennett Lather", "comment_text": "We were there in June. So amazing!"}, {"username": "Michael Messina", "comment_text": "Yes come back, lot more to see yet🙂🙂"}, {"username": "Stefano Bressanelli", "comment_text": "A presto! See you soon."}, {"username": "Imperia Arcidiacono", "comment_text": "Isn’t it wonderful and you did it with your beautiful daughter❤️. I also did a trip from Milano to Sicily my hometown before she got married"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2194977320901346", "text": "Hi all, any recommendations for tour companies in Sorrento? Looking to visit Positano , Amalfi and Ravello for a day trip with maybe boat tour included? Also any half day wine tour recommendations? Thanks so much in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2194977320901346/", "likes": 2, "comments": [{"username": "LeAnn Bonkiewicz", "comment_text": "F"}, {"username": "Beatrice Gheorghiu", "comment_text": "Take the ferry to go and visit the cities and also you can take the ferry from Amalfi to Capri and from there rent a small boat to get you to the caves. But why did you chase Sorento for your accomodation? Maiori is better and not as expensive as Positano or Amalfi but you are very close to them and you can take the bus to visit Amalfi and Ravello."}, {"username": "Anne Sarno-mcilwrath", "comment_text": "Bella Amalfi Travel is who we used. They were very accommodating."}, {"username": "Lisa Valdovinos", "comment_text": "Avanti"}]}, {"id": "2194998597565885", "text": "Hello all 👋\n\nDoes anyone have any recommendations for opera in Rome and where to buy tickets?", "link": "facebook.com/groups/1373361046396315/permalink/2194998597565885/", "likes": 2, "comments": []}, {"id": "2195004474231964", "text": "Affordable accomodation recommendations in Bellagio for 5 adults with a view 🏖️", "link": "facebook.com/groups/1373361046396315/permalink/2195004474231964/", "likes": 0, "comments": []}, {"id": "2195004770898601", "text": "Has anyone been to Puglia in late November?", "link": "facebook.com/groups/1373361046396315/permalink/2195004770898601/", "likes": 0, "comments": [{"username": "Rossella Montanaro", "comment_text": "Se vuoi posso aiutarti.. Abito in Puglia 😊"}]}, {"id": "2195005830898495", "text": "Can you please recommend mid-price range (not expensive) restaurants with Italian food in Forio, Ischia? Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2195005830898495/", "likes": 0, "comments": [{"username": "Romana Svítková", "comment_text": "Bump :)"}, {"username": "Romana Svítková", "comment_text": "Hey guys, any recommendations\n, please?"}]}, {"id": "2195006204231791", "text": "Anyone have any reviews of TourRadar tours", "link": "facebook.com/groups/1373361046396315/permalink/2195006204231791/", "likes": 0, "comments": [{"username": "Rodger Cravens", "comment_text": "Yes, Google has literally thousands of reviews of them. No, this group is not a better resource for reviews."}]}, {"id": "2194991524233259", "text": "I’m desperate for some good hotel or apartment accommodation recommendations for Como or Bellagio.\nI just checked our apartment in Bellagio and they’ve cancelled on us. I rang and was given another number to call that is “not connected”!\nWe are a family of four - kids are 15 and 20.\nAny advice or recommendations would be greatly appreciated.\nTravelling in September.\nTIA", "link": "facebook.com/groups/1373361046396315/permalink/2194991524233259/", "likes": 0, "comments": []}, {"id": "2194996300899448", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2194996300899448/", "likes": 4, "comments": [{"username": "Paula Lazeski", "comment_text": "From today's NYTimes: \"Much of Italy is engulfed by the heat, with temperatures expected to reach 104 Fahrenheit (40 Celsius) in the nation’s central and southern regions. The country’s Health Ministry has placed 20 of Italy’s 27 cities under the highest heat warning.\""}, {"username": "Sally Butchart", "comment_text": "Claudio Crobu"}, {"username": "James Carr", "comment_text": "Of course, the one year I decide to tick it off my bucket list."}]}, {"id": "2194951147570630", "text": "Hi Everyone!\nWe are spending a couple of days in Portofino and Cinque Terre. Any must see’s / must do’s would be greatly appreciated ❤️\nMany thanks", "link": "facebook.com/groups/1373361046396315/permalink/2194951147570630/", "likes": 0, "comments": [{"username": "Nicholas William Lowe", "comment_text": "Get the ferry to San Fruttuoso. And have lunch there"}, {"username": "Simone Pfenninger", "comment_text": "Santa Margherita Ligure, Lerici"}, {"username": "Greg Saba", "comment_text": "Add Tellaro, Porto Venere (pictured), Camogli, Rapallo. Hike between Cinque Terre towns, which might help you get away from crowds during the long season."}, {"username": "Loredana Polichetti", "comment_text": "Santa Margherita, paraggi beach, San fruttuoso beach, camogli, lerici, Rapallo, take the train and visit all 5 terre towns (Riomaggiore, Manarola, Corniglia, Vernazza, Monterosso)\nCanneto beach,"}, {"username": "Deann Decker", "comment_text": "I NEED ROME INFO"}]}, {"id": "2194949280904150", "text": "I will be based in Positano in September. What areas other than Ravello & Capri are your favs?", "link": "facebook.com/groups/1373361046396315/permalink/2194949280904150/", "likes": 0, "comments": [{"username": "Kay Rendall", "comment_text": "Love the local markets in Piano Sorrento. Check what days from accom, bus, where the locals shop for clothes bags, shoes. Just watch thebl elegant local ladies try on, bargain for designer ladies. Great atmosphere. Same in Sorrento markets, follow thenlocal ladies with their shopping baskets from train station. Just a lazy lunch with a wine, enjoy the views.\nU can also get a busbm to Nocelle in the mountains for the views\nDinner in Monteresso, the restaurants send shuttles your accom will bock, arrange transpirt"}, {"username": "Meghan Konopka", "comment_text": "The town of Amalfi!! Highly recommend the Amalfi Lemon Experience"}, {"username": "Glenn Todd Webb", "comment_text": "Cathedral in Amalfi.\nVilla Rufolo and Cimbrone in Ravello."}, {"username": "Brad Nelsen", "comment_text": "Praiano"}, {"username": "Miyuki Kanno Paul", "comment_text": "Cetara for anchovies. Vietri sul Mare for ceramics"}, {"username": "Bunny Westfall", "comment_text": "Sorrento"}, {"username": "Carol Brewer", "comment_text": "Sorrento"}, {"username": "Diana Salvatore", "comment_text": "thank you for the info."}, {"username": "Katherine Azcue", "comment_text": "Sorrento"}, {"username": "Robin Burrell", "comment_text": "Sorrento, Naples, amalfi,"}, {"username": "Jean Bennett O'Reilly", "comment_text": "Sorrento!!!"}, {"username": "Wahab Sidharta", "comment_text": "Amalfi & Sorrento"}, {"username": "Lisa Valdovinos", "comment_text": "Sorrento"}]}, {"id": "2194946997571045", "text": "We were on staff travel from Rome today to Melbourne and bumped off. Not looking good for Thursday either . Has anyone got any tips on what to do now to get home quick and reasonable price ? Happy to fly into anywhere .", "link": "facebook.com/groups/1373361046396315/permalink/2194946997571045/", "likes": 2, "comments": [{"username": "Miyuki Kanno Paul", "comment_text": "If your employer has ZED agreement with certain airlines who serve MEL(I assume you are going to OZ country), go for it. Think about alternative airport like MXP"}]}, {"id": "2194948977570847", "text": "Arriving a day early in Rome ahead of the start of Insight Vacation's Best of Italy tour.\nAll ears for ideas on what to sight see ahead of the tour start. So far I have:\nColosseum interior tour (since I read this is just an external visit on the IV tour)", "link": "facebook.com/groups/1373361046396315/permalink/2194948977570847/", "likes": 0, "comments": [{"username": "Shen Min Chue", "comment_text": "I would suggest Castel Sant Angelo, Altare della Patria, Baths of Caracella or Bocca della Verità. Since you are doing the Insight Vacations tour, check to see if your Vatican Museums visit include any of these 3 rooms, namely Old Bramante Staircase, Cabinet of the Masks or Niccoline Chapel. If yes, then you will be seeing more than most visitors to the Vatican and there will be no point in doing any other Vatican tour."}]}, {"id": "2194947984237613", "text": "if i link my mastercard to apple pay will i need a pin number to make purchaces with my apple pay in italy", "link": "facebook.com/groups/1373361046396315/permalink/2194947984237613/", "likes": 1, "comments": [{"username": "Robert Lawshe", "comment_text": "No"}, {"username": "Lisa Howard", "comment_text": "No"}, {"username": "Allison Mir", "comment_text": "No"}, {"username": "Ruth Hackert", "comment_text": "What is the advantage of doing this ?"}, {"username": "Joanne-Peter Hart", "comment_text": "Your phone will recognise your face."}, {"username": "Lisa Minichini-Dowty", "comment_text": "No"}, {"username": "Lisa Minichini-Dowty", "comment_text": "No"}, {"username": "Tania Lediard", "comment_text": "Your phone password is your pin if your facial or finger print recognition (depending on age of phone) isn’t set up."}, {"username": "Lois LaMonica Norton", "comment_text": "Is it better to use debit or credit card linked to Apple Pay"}, {"username": "Jaime Cleek", "comment_text": "At least in US it depends you can choose to bypass the pin but sometimes your prompted to enter a pin. This is for us in the US but it couid be because it's my bank card and it has a pin enabled"}, {"username": "Ruth Hackert", "comment_text": "Get a CC without foreign transaction fees"}, {"username": "Alexandra A Welker", "comment_text": "No. And no Pin required for Google Wallet and Android pay as well."}]}, {"id": "2194946717571073", "text": "Any recommendations\nbest way to travel from Naples to Salerno", "link": "facebook.com/groups/1373361046396315/permalink/2194946717571073/", "likes": 4, "comments": [{"username": "Tania Lediard", "comment_text": "High speed train."}, {"username": "Betty Stilt", "comment_text": "Check the Rome2Rio app. It gives you options."}, {"username": "Betty Stilt", "comment_text": "Betty Stilt"}, {"username": "Giuseppe Placi", "comment_text": "Ferry or private driver"}, {"username": "Cat Furness", "comment_text": "Train goes directly there."}, {"username": "Arike Shrestha", "comment_text": "Thank you all especially the Rome2Rio app very handy..🙏"}, {"username": "Linda van Beest", "comment_text": "Train"}, {"username": "Miyuki Kanno Paul", "comment_text": "Frecciarossa or Italo. These high speed trains are the best"}, {"username": "Tommasina Mele", "comment_text": "Train!"}, {"username": "Pilar Tozzi", "comment_text": "Trenitalia app, for trains. High speed trains and metropolitana regionale, cheaper ."}, {"username": "Helga Maurer", "comment_text": "Train"}, {"username": "Anne Hoenig Steib", "comment_text": "Train."}, {"username": "Garry Holt", "comment_text": "High speed donkey"}, {"username": "Peter Razzano", "comment_text": "Positano car service… the best!"}]}, {"id": "2194922804240131", "text": "Can anyone provide Recommendations to buy leather jacket in Florence", "link": "facebook.com/groups/1373361046396315/permalink/2194922804240131/", "likes": 6, "comments": [{"username": "Jason Craven", "comment_text": "I bought from Massimo Leather. They were great to deal with."}, {"username": "Stephanie Smith", "comment_text": "David 2 leather"}, {"username": "Sandra Francano Richards", "comment_text": "Yes. I recommend you do."}, {"username": "Mark Horrocks", "comment_text": "Don't go to the 2nd david markets . They say the leather isn't that good. I bought a beautiful lambskin jacket from Matliar. He is on via de guicciardini 21r. Its 2 mins walk from the ponte vechio bridge."}, {"username": "Debbie DiOssi", "comment_text": "Peruzzi leather near Santa Croce"}, {"username": "Debbie DiOssi", "comment_text": "Peruzzi leather near Santa Croce"}, {"username": "Laura McSweeney", "comment_text": "Gold Market. High quality"}, {"username": "Shawn Kopp", "comment_text": "Cash or credit 🥸"}, {"username": "Kurt Tilton", "comment_text": "I've bought several at Ponte Vecchio Florence . As for Gerardo Moradei"}, {"username": "Scott Perry", "comment_text": "Benheart"}, {"username": "Debby Finn Martino", "comment_text": "David 2 Learher. We’ve been buying from Franco Fonati for 22 years!"}, {"username": "Phyllis Waring", "comment_text": "So many exquisite leather shops in Florence!! Start at the Leather factory and the many fine leather stores and artisan stalls located in Piazza Santa Croce!"}, {"username": "Judy Carey", "comment_text": "https://\nscuoladelcuoio.i\nt/en/ Never been here but have seen many recommendations\n."}, {"username": "Lisa Valdovinos", "comment_text": "I bought a purse and used my debit card."}, {"username": "Renee Peanasky", "comment_text": "Il Perseo Leather"}, {"username": "Sam Mouchamel", "comment_text": "Best leather in USA 🇺🇸\nHonestly"}, {"username": "Maureen McCall Bradley", "comment_text": "Bought a beautiful coat at via de' ginori, 23 R"}, {"username": "Rhonda Smith", "comment_text": "￼"}, {"username": "Jim Hinckley", "comment_text": "Bought my leather briefcase there"}, {"username": "Glenn Todd Webb", "comment_text": "Benheart"}, {"username": "Eugene Dellea", "comment_text": "Gold Market and Leather Shop."}, {"username": "Cathy Allman", "comment_text": "Highly recommend Tornabuoni! Great family owned shop."}, {"username": "Sue Whitney", "comment_text": "Is the Noi store still open in Florence?"}]}, {"id": "2194921520906926", "text": "Can anyone please advise a good restaurant in Sorrento that is not too expensive?expensive", "link": "facebook.com/groups/1373361046396315/permalink/2194921520906926/", "likes": 1, "comments": [{"username": "Kay Rendall", "comment_text": "La Giginno in small old city. Tables outside which u need to book to watch world go by. Inside and upstairs very busy, lots large tables locals. Great food , reasonable price closed Tuesdays. I goo back year after year, even taking thec1hr bus from Positano fot lunch. Traditional food."}, {"username": "Clare Boxer", "comment_text": "Ristorante Il Pozzo Sorrento"}, {"username": "Nancy Brennan Carrow", "comment_text": "Tavern Allegra"}, {"username": "Nicole Lee", "comment_text": "Donna sofia was delicious"}]}, {"id": "2194921150906963", "text": "Hi everyone travelling to Italy in 2 weeks.\nStaying in Rome 3 days Naples and Positano 4 days Florence 3 days everything is booked. However have decided to extend and go to Cinque Terre for 4 days and won’t have a car just trains. I love to be by the water/beach and would love some suggestions of what part of Cinque Terre would be the best and most convenient without costing a fortune!!\nThanks in advance", "link": "facebook.com/groups/1373361046396315/permalink/2194921150906963/", "likes": 6, "comments": [{"username": "Len Murtha", "comment_text": "Riomaggiore. We are here now. There is a beach jist past where you would board the ferry. Very easy to get to, just walk along the stone path. You can buy towels for $5 if you don’t have any. Towels to buy would be up along main road in town."}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "Hands down: Vernazza! The most charming. Been twice. Bawled when I left. It’s the town the Disney movie “Luca” is fashioned after.\n\nIf you enjoy hiking, split the gorgeous scenic hike into 2 jaunts. South to North. Train to Rio and hike to Vernazza. Another day, hike Vernazza to Monterosso.\n\nAnother great day trip from CT is taking the public boat to Portovenere. Stunning.\n\nHighly recommend staying at La Mala in Vernazza. Fab stone terrace with amazing sea views. It’s at the top of cliff, so there are stairs. But it’s soooo worth it!\n\nCT known for its amazing pesto and focaccia.\n\nAs far as convenience, all villages are easy, up to what you’re looking for and lodging you find. I feel Vernazza is best layout. Small so it’s not a trek to get to lodging.\n\n4 days is a perfect amount of time. You can savor and enjoy without spreading yourself thin.\n\nBuon viaggio!"}, {"username": "Roland Trego", "comment_text": "If you want a good beach, Monterosso al Mare is the one to choose. Having said that, it is not really typical of the other villages in that it is on fairly level terrain. The others are on steep hills. You can take the train or boat to all the nearby destinations."}, {"username": "Esther Steinbok Sustersich", "comment_text": "I am not sure if you’ll be able to find accommodation if you have not already booked it."}, {"username": "Sara Overbagh Hammonds", "comment_text": "Monterosso was great and right on beach. But honestly you could stay at any. So easy to hike to each and hop on train so easily in each village. It takes 10mins to get from Monterosso to farthest village."}, {"username": "Simone Pfenninger", "comment_text": "Monterosso or La Spezia"}, {"username": "Nancy Matheny", "comment_text": "We were recommended by a travel agent who specializes in Italy to stay in Portovenere so that is where we will be staying in October."}, {"username": "Karon Patterson", "comment_text": "Vernazza, excellent and great swimming everything is so close and excellent restaurant s"}, {"username": "Evan-Sue Wilson", "comment_text": "Monterosso is right at the start and a great place to stay. We caught the train to visit all the other towns, plus you can walk between them.\nJust beautiful! Enjoy your trip."}, {"username": "Paul Del Grande", "comment_text": "Thanks for all the feedback really appreciated x"}]}, {"id": "2194918064240605", "text": "Would love some suggestions on what area and places to stay in Florence, Venice and Lake Garda\nIt’s all a bit overwhelming\nThank you in advance", "link": "facebook.com/groups/1373361046396315/permalink/2194918064240605/", "likes": 1, "comments": [{"username": "Pietro Adami", "comment_text": "For Garda lake, consider Sirmione or Peschiera and plan daytrip to Verona, as well as the lake west coast"}, {"username": "Nicola Bradley", "comment_text": "Bardolino would be a good base in Lake Garda. Lots of restaurants, Garda is easy to walk or cycle to, and you could get ferries to Sirmione or other towns"}, {"username": "Rachael Richardson", "comment_text": "We stayed pitti palace side of Florence a much more chilled side , more trendy bars and relaxed restaurants , the other side is crazy busy\nWe stayed near arsenale in Venice again , much more reasonable and lovely local restaurants"}, {"username": "Claudia Amp", "comment_text": "Firenze stay in Oltrarno less touristy and less busy but still central or maybe around Santa Croce."}, {"username": "Claudia Amp", "comment_text": "Venice stay in Santa Croce, San Polo or Canareggio."}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "Florence: Casa G (stylish boutique in heart of Florence)\n\nLake Garda: Prati Prati. A bit of Tuscan modern feel. Pool. Lovely. We enjoyed renting bikes and riding along the river to fairytale villages."}, {"username": "Zanna Darcy", "comment_text": "On Lake Garda we stayed in Nago-Torbole at the Hotel Lago di Garda -- we had a beautiful room with a large deck and private hot tub. The views were jaw dropping gorgeous. Highly recommended"}, {"username": "Jane Coutts", "comment_text": "We are staying in San polo on Venice at the moment it’s a really nice area"}, {"username": "Jerry Lyubelsky", "comment_text": "Just depends on your itinerary and sightseeing ventures. For example in Florence we stayed close to the duomo (about 1/2 mile away) and this was close enough to everything like accedemia, uffizi, Arno etc"}, {"username": "Nicole Beaumont", "comment_text": "In Florence, stayed at the Hotel Duomo Firenze. I had a room with a view. 😊"}, {"username": "Lyn Evans", "comment_text": "Lake Garda is stunning. We loved staying in Malcesine which is devine and from there a trip on the cable car up to mt Baldo and visit across the lake at Limone and up to the head of the Lake to Riva del Garda. Then we caught the fast ferry with our luggage down the lake to Sirmione which is gorgeous and stayed at hotel Eden right next to ferry stop. It’s a beautiful village within a moated town complete with medieval castle you can visit. We visited Verona on the local bus from here also. The closest train stn is Peschiera del Garda. Hope this helps."}, {"username": "Suzanne Mills", "comment_text": "Malcesine or Limone in Garda. Avoid Riva and Serimone."}, {"username": "Leesa Martin", "comment_text": "thank you all so much. really appreciate all your wonderful information. 😄"}, {"username": "Leesa Martin", "comment_text": "just advised we need to cancel our Venice accomodation. Any suggests where to book now? lol"}]}, {"id": "2194914407574304", "text": "hi all, looking for recommendations:\nwe have 2 nights in florence , 3 nights in Siena and have one night spare to choose a nearby destination to stay before flying out of Pisa. We were considering Viareggio, Forte dei Marma or Lucca ?\nany suggestions??", "link": "facebook.com/groups/1373361046396315/permalink/2194914407574304/", "likes": 0, "comments": [{"username": "Mirko Bellagamba", "comment_text": "Forte dei Marmi"}, {"username": "Marie Cuzzi", "comment_text": "Lucca 💕💕💕"}]}, {"id": "2194900264242385", "text": "What are your favorite things to do in Bologna now until Thursday. We are in town with two teens. Hoping to find something to get out of the heat. TIA.", "link": "facebook.com/groups/1373361046396315/permalink/2194900264242385/", "likes": 1, "comments": [{"username": "Wolly Valentina Losi", "comment_text": "https://\nwww.bolognawelco\nme.com/it/\ninformazioni/\nbologna-in-famig\nlia?gclid=Cj0KC\nQjw8NilBhDOARIs\nAHzpbLCJZjaFgql\nvBanWSHGkEQh7R-\nacBVFB-2uEAeYdu\n3FNuEqapm5l3Lca\nArETEALw_wcB"}, {"username": "Claudia Amp", "comment_text": "Get on the train and go to the beach maybe; Cesenatico, Rimini (close to Rimini you can go up to Verucchio small little village of the Malatesta, among one of the most beautiful “Borghi d’Italia” and you can also check Sant’Arcangelo di Romagna) Cervia is a nice town by the sea. In Bologna you can go to Giardini di Viale Margherita or up to San Luca’s sanctuary, very beautiful."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2194882234244188", "text": "Bellini at breakfast @ lake garda.", "link": "facebook.com/groups/1373361046396315/permalink/2194882234244188/", "likes": 3479, "comments": [{"username": "Sania Junejo", "comment_text": "Sania Junejo"}, {"username": "Lynn Biagioni", "comment_text": "Perfect start to the day"}, {"username": "Cristian Jimenez", "comment_text": "Karla Un desayunito asi 🤩😘"}, {"username": "Shula Hurvitz", "comment_text": "☕️🇮🇹🥇💥🎯🇮🇹🇮🇱"}, {"username": "Patricia Foley Mastrorilli", "comment_text": "Love that place! Thanks for sharing! It made me FEEL our trip again! ♡ Enjoy!"}, {"username": "Louis Owen", "comment_text": "Megan Rose Miley"}, {"username": "Cornelia Merten", "comment_text": "Dort bin ich im September...🫡"}, {"username": "Scott Scribner", "comment_text": "Will be in Lake Garda in 49 days."}, {"username": "Jennie Gain", "comment_text": "Ooh amazing\nIs that your hotel ?"}, {"username": "Patricia Peñacérrada", "comment_text": "❤"}, {"username": "Hala Assaf", "comment_text": "Best morning 🌄 💛"}, {"username": "Wayne Spencer", "comment_text": "Stunning view. What a great spot for breakfast 😋"}, {"username": "Paola Malcotti", "comment_text": "Toast & cappuccino???"}, {"username": "Khadija Muftah Mansour", "comment_text": "Breathtaking!"}, {"username": "Piyumi Wick", "comment_text": "Jonathan X Mishayel grilled cheese sandwiches 😌"}, {"username": "Maman'i Alexįãh", "comment_text": "Amazing 😍"}, {"username": "Marin Masle", "comment_text": "Dora"}, {"username": "Oujnane Warda", "comment_text": "😍😍😍😍"}, {"username": "Aleksandra Jarzębowska", "comment_text": "Wow"}, {"username": "Leda Mercedes", "comment_text": "Wendel Traczuk"}, {"username": "Leda Mercedes", "comment_text": "Wendel Traczuk"}, {"username": "Morella Monascal", "comment_text": "Morella Monascal"}]}, {"id": "2194875230911555", "text": "To anyone who has had elopements/symbolic ceremonies in Italy do you recommend getting a wedding planner? Wondering because ours will be simple just floral, officiant, photographer, videographer already reserved location and have been emailing vendors wondering if I should save the money that would cost to hire a wedding planner", "link": "facebook.com/groups/1373361046396315/permalink/2194875230911555/", "likes": 0, "comments": []}, {"id": "2194874440911634", "text": "A fun night out in Rome. Delicious dinner at People Bistro.", "link": "facebook.com/groups/1373361046396315/permalink/2194874440911634/", "likes": 55, "comments": [{"username": "Sania Junejo", "comment_text": "Sania Junejo"}, {"username": "Hollie Baker Lloyd", "comment_text": "Lemoncello!"}, {"username": "Louise Faggioni", "comment_text": "Jo Ann, Where in Rome is this located? Great fun 🤩"}]}, {"id": "2194870887578656", "text": "Hi People,\nI bought 3 tickets from 29th of July instead of the 29th of June from Rome to Milan at 8:05AM by mistake and we are reselling them if someone is interested, we are selling the 3 tickets at a 20% discount, so the ticket price will be 33 euros instead of 42 euros 🙂\nDM me for more details!", "link": "facebook.com/groups/1373361046396315/permalink/2194870887578656/", "likes": 0, "comments": []}, {"id": "2194857054246706", "text": "Hi guys trying to book train tickets on rome2rio app and this comes up when i go to purchase do you have to purchase a seat reservation on top of this price ?", "link": "facebook.com/groups/1373361046396315/permalink/2194857054246706/", "likes": 2, "comments": [{"username": "Debbie Fekete Gene", "comment_text": "That’s a fast train you have there. It is assigned seats you will then pick what class you want which will determine what car you seat in. Extra charge is if you upgrade your seats"}, {"username": "Elena Innocenti", "comment_text": "if you want to choose your seat, yes"}, {"username": "Katalina Loredo", "comment_text": "You should use Trenitalia 🙂"}, {"username": "Charlotte Reid", "comment_text": "Trenitalia is much better! Use this as it will tell you if you need a seat reservation too"}, {"username": "Mirko Bellagamba", "comment_text": "if you want to choose a seat, it makes you pay, otherwise it chooses a seat automatically for free."}, {"username": "Vijay Almeida", "comment_text": "It’s 2 Euro for seat selection."}, {"username": "Mo Dee", "comment_text": "Download the Trenitalia app and buy from there."}, {"username": "Victoria Laverty", "comment_text": "Buy direct through company"}, {"username": "Sam Mah", "comment_text": "Use Trenitalia...."}, {"username": "Sireesha Darbha", "comment_text": "Hi we are seeing an error when booking through Trenitalia. “Train 9222 external system does not accept reservation”\n."}]}, {"id": "2194853034247108", "text": "Looking for a small town to stay in Northern Italy between Conegliano and Barolo. Suggestions please?", "link": "facebook.com/groups/1373361046396315/permalink/2194853034247108/", "likes": 0, "comments": [{"username": "Pamela Dorigo", "comment_text": "Hi, omg so a big area to choose between. Could be also Parma or Mantova or Verona or also Vicenza...."}, {"username": "Meeta Nayar", "comment_text": "We stayed in Merano last year in April - it was stunning!"}, {"username": "Judy Jamieson Pisano", "comment_text": "Verona is very nice"}]}, {"id": "2194851097580635", "text": "Recommendation for a small pretty winery near Orvieto we can stop for lunch on our drive from Rome to Florence. Not looking for a wine tour or any guided tour, just a nice winery/trattoria with great views we can stop by to eat without booking a tour. Thanks!!", "link": "facebook.com/groups/1373361046396315/permalink/2194851097580635/", "likes": 0, "comments": []}, {"id": "2194848460914232", "text": "We are looking at November/December next year. I see everyone talking about Cinque Terre and would love to visit but I’ve also read that quite a few places close down come winter and was wondering if is was worth a visit? Thanks 😊", "link": "facebook.com/groups/1373361046396315/permalink/2194848460914232/", "likes": 1, "comments": [{"username": "Greg Saba", "comment_text": "Our first visit to Vernazza was by car, with a short walk to the village in mid to late November. The weather was decent (photo from November visit). We recall having a little deli make us a sandwich and provide us some inexpensive local wine. It seemed fairly active, even with the few tourists. We returned a few years ago in the fall, hiking three of the five towns then. It was late September, and it felt like we were leaving a packed stadium. The crowds in this tiny village, many off of cruise ships, were disgusting. We quickly retreated back to a restaurant with a view above the Vernazza, along the hiking trail."}]}, {"id": "2194827960916282", "text": "Looking for feedback and reviews regarding HolidayMax bookings. I am based in Australia and wanting to enjoy their Iconic Europe Luxury Tour package in 2024. This package starts and ends and includes 5 nightsआणखी accomodation in Rome.\n\nThe package looks great but the booking company is slow to respond and vague on follow up details. They also have no social media presence but an ok trust score. Hence my request for genuine first hand experiences and feedback.", "link": "facebook.com/groups/1373361046396315/permalink/2194827960916282/", "likes": 0, "comments": [{"username": "Mellanie Jayne Polwarth", "comment_text": "Did you get any feedback about holiday max? We have just booked a trip with them for Mediterranean cruise… hope they are ok"}, {"username": "Adele Pettenuzzo", "comment_text": "F"}]}, {"id": "2194835694248842", "text": "We are a family of 4 (2 adults, 7yo, 4yo) travelling to Italy over winter, from Australia. (Our kids wanted a white Christmas) we've got about 6 weeks and will be hiring a car for most of it. Picking it up in Milan drop off in Florence. Would love ideas of fun activities to do with kids, pizza making, gelato making etc. Who you booked through. Iआणखी know we're not doing all of Italy, we're concentrating on the north.\n\n30 Nov - 2 Dec Milan\n2-4 Dec- Bologna\n4-6 Venice\n6-10 Bolzano, visiting Merano\n10-14 Munich\n14-16 Innsbruck\n16-18 Lake Guarda via Verona\n10-20 Lake Como\n20-27 Courmayeur\n27-29 Turin\n29-31 Genoa\n31-3 Jan Cinque Terra\n3-6 Florence via Pisa\n6-9 Rome\n9-11 Milan\n11-16 London", "link": "facebook.com/groups/1373361046396315/permalink/2194835694248842/", "likes": 1, "comments": []}, {"id": "2194829790916099", "text": "Has anyone made the trip from Milan to Assisi? What’s the best way to get there?", "link": "facebook.com/groups/1373361046396315/permalink/2194829790916099/", "likes": 1, "comments": [{"username": "Ken Lerch", "comment_text": "Easy, train."}, {"username": "Glenn Todd Webb", "comment_text": "Rome2rio app"}, {"username": "Laura Piccinini", "comment_text": "Rent a car,you can have wonderful stops heading there ( parma Modena Bologna and Gubbio)"}]}, {"id": "2194829254249486", "text": "What’s the best way to get from Venice to Tremezzo?", "link": "facebook.com/groups/1373361046396315/permalink/2194829254249486/", "likes": 0, "comments": [{"username": "Glenn Todd Webb", "comment_text": "Train to Milan. Rent a car. It’s 45 min to Como then less 1/2 hour up West Bank. Make sure you see Villa Balbianello and Villa Carlotta next to grand hotel Tremezzo."}]}, {"id": "2194828254249586", "text": "Hello there.\nMy husband and I have 5 nights left to finish our Europe plans.\nSo it’s between sienna/Florence area or Monterosso/Cinque Terre in August.\nAny information that would help us decide would be much appreciated.\nPlease help!!\nAny hotel recommendations also appreciated.\nThank you 😊", "link": "facebook.com/groups/1373361046396315/permalink/2194828254249586/", "likes": 0, "comments": [{"username": "Lisa Valdovinos", "comment_text": "Florence was really nice. We did a cooking class. Pizza and Gelato. It was really fun."}, {"username": "Lyn Evans", "comment_text": "Both very different.. do you want coastal or more city and vineyards etc. where else are you going to be going to and coming from for this next stay? We are doing Monterosso and Lucca this trip and not too much travelling between both stays."}]}, {"id": "2194828044249607", "text": "Keen to hear if anyone has booked a rental car with Autoeurope rentals while in Italy and how was the experience?", "link": "facebook.com/groups/1373361046396315/permalink/2194828044249607/", "likes": 0, "comments": [{"username": "Miyuki Kanno Paul", "comment_text": "I found it less expensive by booking directly from the individual rental car company"}]}, {"id": "2194827117583033", "text": "Hi all , Going to Venice in September for 3 days. Would like to book some tours looking for recommendation. Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2194827117583033/", "likes": 1, "comments": [{"username": "Pamela Dorigo", "comment_text": "Hi Venice worth to wonder in the city and just get lost to appreciate more the calles (small roads) and enjoy the real atmosphere of Venice. If you love wine and specially Prosecco you can come to Prosecco Hills and do a tour and tasting in the area. You can book an organized tour or organise by yourself and stop in 1 or 2 wineries. I'm a sommelier and I work in a winery if you need more information, I'm available. Have a nice day"}, {"username": "Janis Hall Bockelman", "comment_text": "We did a “traveling” opera! Google it. It was an interactive opera and so much fun. We went to LaTraviata"}, {"username": "Barbara Brosnan", "comment_text": "We used LivTours for private tour of Doge’s Palace with secret passages and St Marks. They were amazing, secret passages were our favorite part, we were the only ones in there and it was fascinating."}, {"username": "Lisa Valdovinos", "comment_text": "We used Avanti"}, {"username": "Meredith Williams", "comment_text": "we did an evening walking food tour and loved it"}, {"username": "Nancy Bonini", "comment_text": "Thank you all for sharing. Will look into some of these wonderful suggestions."}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "Loved loved loved the “Real Hidden Venice” tour. I have high hopes and this tour exceeded all! Learned sooo much and had the best tour guide. Ask for Matteo, he’s awesome!"}]}, {"id": "2194826957583049", "text": "My partner uses a c pap to sleep. Is it difficult to find distilled water??", "link": "facebook.com/groups/1373361046396315/permalink/2194826957583049/", "likes": 6, "comments": [{"username": "Michelle Casillas", "comment_text": "You can find it at most grocery stores. It’s in the section with the laundry detergent."}, {"username": "Betsy Hummel", "comment_text": "You can’t use regular bottled water. The SmartWater brand bottled water is however, distilled and relatively easy to find."}, {"username": "Jennifer Lacy", "comment_text": "Oftentimes found in the automotive section."}, {"username": "Kathy Griffith Fish", "comment_text": "Your partner might find that short term they can forego the water. That is what my husband did in Egypt. There was no distilled water to be found tin that country except in tiny tubes"}, {"username": "Jackie Martin", "comment_text": "I read on a different thread that you can get it at a pharmacy but have to ask as they keep it behind the counter."}, {"username": "Lorelei Anderson Kempenaar", "comment_text": "Janice"}, {"username": "Robin Abrahams Stieff", "comment_text": "My husband also didn’t use water for his cpap in Italy. It worked fine."}, {"username": "Elide Ciarletta", "comment_text": "The only place my husband was able to find distilled water was at la Farmacia. He paid 3 euros for a one litre bottle. We searched many grocery stores both in Rome and Pescara and we did not find seeing that they do not sell it."}, {"username": "Vicki Susie Naab Gandolf", "comment_text": "We were told by our cpap provider that we could use bottled water during that time which we did w/o any issues for my husband’s machine or any less effectiveness. We were able to find distilled water in one place. Just be sure you don’t buy water with gas (carbonated) which is very popular there."}, {"username": "Heidi McPhillips", "comment_text": "It can be in Europe, you may have to go to multiple places and in pharmacies it’s usually behind the counter so ask them"}, {"username": "Nancy Webster-Gregg", "comment_text": "And what about plugging the CPAP machine into wall with converter-any problems?"}, {"username": "Mark R Palladino", "comment_text": "I have been using my cpap machine for 5 years and use tap water. I clean the basin with a vinegar, dawn dish soap and water solution when lime starts to show. I have never had any machine issues and my AHI numbers are exactly where they should be.\nAs my grandfather used to say “Eh! Whatsa the differn’?” 😊"}, {"username": "Diana Lawler", "comment_text": "My Cpap you can turn the humidifier off if you don’t have distilled water."}, {"username": "Filomena Lemme", "comment_text": "You can find in pharmacies. Need to ask pharmacist, as they keep it behind the counter."}, {"username": "Heidi Littman Meiers", "comment_text": "Hubs is new to cpap ... I refuse to spend my vaca in a grocery store so we will take it from home in our stainless water bottle and then transfer to a cheap plastic bottle (from water we buy at a coffee shop etc) #teamcheckedlugg\nage but how do we plug it in ?"}, {"username": "Margaret Saigling", "comment_text": "My doctor said tap water is fine."}, {"username": "Janis Holcomb", "comment_text": "You don't have to put water in it. I never use water in mine, even at home"}, {"username": "Larry Reinier", "comment_text": "I haven’t used distilled water in over 30 years and mine works just fine"}, {"username": "Maria C Sapien", "comment_text": "Walmart"}, {"username": "Heather Nixon", "comment_text": "What is the water for? I have a tank on mine but have never used it…. For years I’ve just not used the water"}, {"username": "Marisol Lopez-Nieves", "comment_text": "You need to buy in it in the pharmacy “Farmacia” ask the pharmacist for Aqua depurata\nDepending on the area will cost from 2.50 to 3.50 Euros per litter"}, {"username": "Dayton Cash", "comment_text": "I know it costs more, but I bought an Air Mini before my trip to Iceland back in July of last year. It does not require a reservoir with water. It is my travel CPAP so I don’t have to worry about the distilled water."}, {"username": "Anna Biscotto", "comment_text": "Best to boil the water first and let it cool down before adding to the machine"}, {"username": "Sherry Davis Wainz", "comment_text": "Consider buying a travel cpap device. Requires no water and is smaller than a kindle and about 2 inches tall\nIf you travel a lot it is worth it!"}, {"username": "Kelly Creola Close", "comment_text": "Every Pharmacy had it. Just had to ask"}, {"username": "Tina Capozzola", "comment_text": "I bought a mini CPAP that requires no water…it’s very small and light."}, {"username": "Jim Painter", "comment_text": "Also look in the laundry section. \"aqua distillata\""}, {"username": "Nydia Bryan", "comment_text": "One issue mentioned is the length of cord and location of sockets/plugs. Take a small extension cord just in case."}, {"username": "Gwen Garris", "comment_text": "any supermarket… or worst case boil some water"}, {"username": "Bea Kuckens", "comment_text": "Also see July 27 thread, question posted by Nathalie Prestige Pare."}, {"username": "Mirko Bellagamba", "comment_text": "You can find it easily in supermarkets"}, {"username": "Sandra Francano Richards", "comment_text": "You can use bottled water."}, {"username": "Jerome Burdi", "comment_text": "Boiled water is distilled."}, {"username": "Anthony Sperduti", "comment_text": "Good question"}, {"username": "Carol DelMonte DiDonato", "comment_text": "No, my sister bought it in Italy."}]}, {"id": "2194825627583182", "text": "Help! We are going to Rome in August for 3 nights = 2 full days. The more I research on Rome, the more I realize I could spend 2 months there and still not see it all! So my question is: If you had only 2 days in Rome, what would your top 5 sights/areas to explore be?\nI want to lower my expectations of how much is realistic to see in 2 days. I am… आणखी going to book the Colosseum night tour direct through coopculture and I've already booked a 2hr Guruwalk tour for one of our mornings.\nMy husband and I are open to walking and exploring all day long, but so far I'm thinking:\nColosseum, Roman Forum, and Palatine Hill (late afternoon into evening)\nTrevi Fountain and Spanish Steps (early morning)\n2 hr Guruwalk tour (morning; starts at Piazza Venezia and ends at Campo de Fiori)\nExplore Trastevere (where we are staying)\nBaths of Caracalla\n\n\n(P.S. Not too interested in going into the Vatican/St. Peters)\nHelpful input appreciated please :)", "link": "facebook.com/groups/1373361046396315/permalink/2194825627583182/", "likes": 16, "comments": [{"username": "Heather Stephenson", "comment_text": "Castel Sant’ Angelo is my favorite"}, {"username": "Melanie Fraser Hotchkiss", "comment_text": "Rome is pretty easy to walk around. The colosseum is good and takes a couple of hours. You don’t need to spend too much time at the Spanish steps and Trevi fountain. Take in the piazza’s and enjoy a drink and people watching We did the hop on hop off bus tour which was a good way to see everyone and work out where everything was. We Went up to the Vatican but didn’t go in."}, {"username": "Hollis H McGuire", "comment_text": "Be sure to taste pizza and gelato from the tiny shops everywhere.\nSeek restaurants where there are lots of people - a great ad!\nAt Camp di Fiori - linger for lunch after you ogle all the fabulous fish and flowers and sugared orange rind.\nFrom the Campo, walk to Piazza Navona - just a few blocks and it’s SPLENDID.\nYou could spend 2 YEARS and not see Rome!\nI’d skip the Baths of Caracalla; go sit in the middle of the Piazza fella Rotondo and be awed with the Pantheon. Walk inside and look up.\nGet coffee and/or gelato here, too ( in fact get them EVERYwhere😀)"}, {"username": "Sarah Lybarger", "comment_text": "Shelby Britton some great tips for Rome!"}, {"username": "Lynn Luken", "comment_text": "Hop On Hop Off bus. Coliseum and Vatican"}, {"username": "Hollis H McGuire", "comment_text": "Posters here are right - the Vatican IS a must. But not on a hot day when it’s so crowded you can’t even linger.\nSkip it for when you have a decent amount of time to devote to it properly."}, {"username": "Gundega Barkane", "comment_text": "I would do willa Borghese gardens instead of Bath of Caracalla"}, {"username": "Ron Warner", "comment_text": "Do the hop on hop off bus tour which will give you a good overview of the city and you can get off and on at the different stops"}, {"username": "Miriam McNally", "comment_text": "A few \"alternative\" ways: Colosseum night tour is amazing. Trevi and Spanish Steps not so busy v late night or v early morn. Breakfast in Vatican 7.30 am I think, has been highly recommended here. If you're into running, there are early morning running tours around Rome, I haven't done it but it is highly recommended. Also, the church of San Clemente is absolutely FAB! Hidden gem! It's an easy one to do in the afternoon, cool cos inside, has amazing ruins on 3 floors below. https://\nbasilicasancleme\nnte.com/eng/"}, {"username": "Wade Lindstrom", "comment_text": "Trust me. Go to the vadican City (preferably with a guide to get more out of it) and pay an extra €8 to go up the top of the dome. There are 3 sections you get access to. I spent about a week in Rome and going up that dome was my favourite thing by far."}, {"username": "Lindsay Storry", "comment_text": "We enjoyed the Villa Borghese gardens as a nice reprieve from the city noise, pollution, and crowds. And right across the bridge from Trastevere is the Jewish Ghetto. There are so many old ruins there with interesting history and no one around. I found the art installation with gold cobblestones that listed the names, birthdates, date of deportation, name of the camp, and date of death in front of different doorways (where these people used to live) particularly moving."}, {"username": "JoJo Sisto", "comment_text": "We are only there that amount of time as well\nSo doing the golf cart tour to at least see all of the landmarks and just doing St. Peter’s Basilica and not the Vatican and Sistine except from the outside. Also doing Borghese Gardens and a food tour in Trastevere 🙂"}, {"username": "Lisa Adams Robertson", "comment_text": "Borghese Galleria is amazing, and is set in a lovely park, near the Spanish Steps. The Spanish Steps are underwhelming and take about a minute. If you are at all interested in incredible art, I highly recommend the Borghese Galleria. Book in advance, takes 2 hours maximum (timed entry)."}, {"username": "Karoline Bakker", "comment_text": "Take the hop on hop off buss and do the whole tour. Decide where you want to go on the 2th round after seeing all the highlights from the buss and in the evening just wander in the streets round the famous squares and enjoy ! If you throw a coin in the Trevi fountain (over your shoulder) you will be back in the eternal city 🇮🇹"}, {"username": "Nicola Coulthard", "comment_text": "Although you've said no to Vatican, I would do the st Peters basilica and travel up to the cupula to see the view from the top. We did Vatican museum and although it had nice things in, it wasn't the best thing for such a short trip. I'd also say St Agnatsia perspective ceiling. Spelt it wrong but a quick Google will tell you all about it. Nothing to look at outside but fab inside. A quick visit on route to colluseum would allow you to fit it in. Enjoy your trip."}, {"username": "Laurie Denoni", "comment_text": "One major place each day then enjoy a long lunch, Apertivo and late dinner! In between stop for espresso. After the 15th many local restaurants close for 2 weeks"}, {"username": "Julie Adams", "comment_text": "Do a night tour of the colosseum. It's incredible at night, and you'll beat the heat."}, {"username": "Karen Blackmore", "comment_text": "We loved going to the top of St Peter's Basilica dome (we used a Tiquets tour which was great). Personally I was not overwhelmed by The Vatican. Loved the map corridor and some of the mosaic floors. Good to tick off and our evening tour had lovely light on the buildings. Everyone's opinion is different of course!"}, {"username": "Janice Rea", "comment_text": "Take a golf cart tour. See an overview. Great. Then go back and see sights."}, {"username": "Lori Johnson Hilton", "comment_text": "I would skip the Vatican. It's over the top ostentatious, and quite frankly pisses me off that a religious order would have that kind of money. AND charge me an arm and a leg to see it. AND have a dress code. There are so many other wonderful things to see, do and eat. I've been all over Italy many times over and Rome is at the top of my list for large cities, history, and the best food in the country. The most memorable ruins are the Colosseum and Nero's Palace. Both are otherworldly and incredibly memorable (esp Nero)"}, {"username": "Laura Piccinini", "comment_text": "If you don't enter in museums, you can do a lot':\n1 day-- Colosseo +circo massimo + piazza Venezia ed altare della patria + piazza Navona+trevi+ campo de fiori + piazza di spagna + piazza popolo e Pincio\n2 day --- castel sant angelo , bocca della verità , san Pietro (Just piazza),Trastev\nere , Gianicolo\n\nYou Need to walk alot but with no entrance you can do It!"}, {"username": "Raquel Pickering", "comment_text": "I THINK Spanish steps and trevi are in opposite directions? Not sure. Do trevi first thing and skip the big crowsa. We went at 7am and it was pretty good. We then walked to St peters and got there early too and was a very short quick line. You're mad to miss it!"}, {"username": "Wallace Clavelle", "comment_text": "Item 2: if you want to do with no one in the photo (Trevii Fountain & Spanish Steps), I would go around 5AM. By 6, there was a good amount of people there (from when I did both 5&6AM) less than a week ago."}, {"username": "Robin Burrell", "comment_text": "Coliseum, tour of the Vatican"}, {"username": "Rebecca Korpershoek", "comment_text": "We did the Catacombs and Crypts underground tour, it was really different and interesting. Good to do on a hot day!"}, {"username": "Andresa GB", "comment_text": "Get a scooter and do all that during the night , it was an awesome experience ❤️"}, {"username": "Tracy Foss", "comment_text": "Take a golf cart tour or the hop on hop off bus"}, {"username": "Sonia Smith", "comment_text": "If you have any time at all the Basilica in Rome is amazing. Doesn’t take the time the Vatican does. The art in it is breathtaking. One of my favorite experiences is climbing to the top and seeing the view of Rome. Besides the coliseum, it’s not to be missed. Rick Steves has an amazing free audio tour of the Vatican. He made it come alive and I learned so much."}, {"username": "Suzanne Mills", "comment_text": "My best recommendation is to stay at least a week"}, {"username": "Nancy Vahl Raske", "comment_text": "Add Pantheon"}, {"username": "Angela Benini", "comment_text": "You could spend years in Rome and still not see it all.. Your plan seems a good one though. I would consider the Pantheon, the Aventino where the Giardino degli Aranci is, and the Gianicolo, a walk from trastevere"}, {"username": "Stephanie Saenz Bauer", "comment_text": "We had private tour with local and she walked us all the spots over 8 hr period and she provided the hx it was great if you have little time."}, {"username": "Carola Blödgen", "comment_text": "The Vatican is a must"}, {"username": "Donna Pociecha", "comment_text": "Vatican is worth it, the art is phenomenal and it’s really not about a secular churchy kind of thing. More pertaining to history and art. Go with a guided group first thing in the morning"}, {"username": "Tina Norris", "comment_text": "I would hire a good tour guide for all of the 1st day and then you have the sights seen. And spend the 2nd day, relaxing and strolling around yourselves."}, {"username": "Lauren-Jade Roberts", "comment_text": "Trastevere is great - best place to spend majority of the time we literally sped past trevi fountain and spanish steps - loads of litter and tourists. I'd happily not go back to central Rome now I've walked past it all. Trastevere i'd happily return to many times, really nice vibe around there. Albeit, I do always prefer neighbourhoods to the true city centres. Vatican is 95% an art gallery, with no time to actually stop and look as you're sheparded through each room, I'd expected the guided tour to focus more on the religion side of things but its all about the art, which personally i'm not into."}, {"username": "Bob Sullivan", "comment_text": "Do you plan on never returning?\nFamous travel expert Rick Steves says \"Travel like you'll be back again\".\nOn that short a trip and in August, I'd do what the weather permits. It's going to be hot. You don't want to be standing in lines eating up precious time. Eat, drink and be merry! Wander around and take gelato breaks and/or spritz breaks whenever you are so moved. Just walking you can see the history in the architecture etc. Remove the Vatican from the equation and there's still tons to see."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Don't miss Vatican , it's spectacular. If you still find slots, do the early morning visit with breakfast."}, {"username": "Alexandra A Welker", "comment_text": "Vatican/\nSistine Chapel, Coliseum, Spanish Steps, Castel Sant'Angelo, Pantheon, Trevi Fountain, Piazza Navona, Galleria Borghese/Villa Borghese,. Trastevere."}, {"username": "Anne Contini", "comment_text": "Pizza Navona one night is a must. Its hot out there so museums, galleries and cafes!!"}, {"username": "Terry Pisano", "comment_text": "Same here. 2-1/2 days in Rome. Thr first day I figure jet lag so I scheduled a late afternoon golf cart tour. Next day is all day walking tour and exploring. I'm skipping Vatican too. Would love to see it, but will have to be next time!"}, {"username": "Dayna Steinberg Cioffi", "comment_text": "Trevi and Spanish steps are a few minutes to see and take pics. We did them each night after dinner. Colosseum and Forum book a tour. We had a 3 hr tour it was more than thorough (I could have done in less time). We did a golf cart tour in 3 hours can take your everywhere!"}, {"username": "Susan Hulsey Watkins", "comment_text": "The Pantheon, while technically a church, is an engineering marvel. Recommend!"}]}, {"id": "2194816657584079", "text": "Hi family of 4 thinking of going in 2024 for 17 days: One itinerary we are thinking is Rome 3 nights, Sicily 6 nights, Sorrento 3 nights, Florence 3 nights, Venice 2 nights. We would fly from Rome to Sicily and Sicily to Naples and use fast train for the rest. Does this seem too rushed? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2194816657584079/", "likes": 0, "comments": [{"username": "Pat Cirillo", "comment_text": "I would skip Sicily and make it it’s own trip someday (you’ll want to come back). Give Rome and Sorrento/\nAmalfi Coast more time."}, {"username": "Debbie Plante", "comment_text": "Yes. Too much unpacking and packing. You want to SEE the areas and enjoy."}, {"username": "Annick Hupperetz", "comment_text": "We took 15 days to visit the Amalfi Coast because there is a lot to see."}]}, {"id": "2194809700918108", "text": "Am missing my beloved Italia already 😪\nWe returned home to Australia on Saturday from 4 weeks away, taking in Paris and Zurich before hitting Italy 🥰\nFirst stop (by train) was Bellagio. It was insanity at Como when we arrived, huge queue for ferry tickets and fast ferries sold out hours in advance. Looked at the bus option, which was even worse that day 🙈 so got a slow ferry a few hours later and enjoyed a leisurely lunch while we waited. Got to Bellagio and were beyond happy. It’s been 16yrs since our last visit! Not much has changed, and we frequented our favourite bar by the water every afternoon. A day trip to Menaggio and Varenna (gorgeous lunch stop). A day trip to FoxTown on the Swiss border - we have previously driven from Switzerland into Italy and we love a shopping stop there, bargains to be had! - so we caught the train up. Took the bus to/from Como that day, the views were superb, and it only takes slightly longer than a fast ferry (for about 1/4 of the price). Our 4nts flew.\nSecond stop Venice, which we haven’t seen for 10yrs. I wasn’t sure how much we would enjoy it, but I can safely say we loved it! Our daughter was four last time we went, so clearly this made a huge difference. We did a gondola for the first time. We had cocktails (a mocktail for the 14yo!) at a rooftop bar, we caught Vaporetto everywhere, found some great cafes, we checked out the views from the DFS roof - link in comments, book 21 days in advance, it’s free and a must-do - and we had a great apartment on the Grand Canal. Loved every second of our three night stay.\nWe collected a car from Europcar and drove down as far as San Benedetto del Tronto for an over nighter to break up the journey to Monopoli. Arrived in magnificent Monopoli the following afternoon and WOW. Just WOW! It was like entering a travel brochure! We had rented an apartment in the old town, which you’re able to drive into btwn 3:30-5:30 for only 15 mins to unload your bags and then get out, as it’s a pedestrian-only area. I cannot recommend this village enough, it blew our minds how gorgeous it was. We needed the chill week by the Adriatic to unwind from all we had already done, and it was perfect. Drove to a few nearby beaches on different days, visited Polignano a Mare, but the highlight of day trips was easily Matera - what an astounding step back in time, just a jaw dropping, mind blowing village. No words can describe. Link in comments. But do yourself a huge favour and visit Monopoli/Puglia, it’s amazing.\nLast stop was Milan. Caught the train from Bari after returning our car. A long trip (8hrs) so it wrote off the day, which I hate, but flights had been crazy expensive prior to our departure. Sadly someone decided to steal my suitcase in Bologna - now found but what a saga to get it home 🙈 - which didn’t put us in a good mindset, but we explored Milan nevertheless. Duomo is stunning, esp at night, but the rest of Milan we were quite underwhelmed. I wish we’d perhaps gone to Rome (which we’ve seen maybe four times) for our flight home. Anyway, we won’t die wondering what Milan is like!\nSo a magnificent - if somewhat busy - trip rich in more memories for our little family. If you want any tips or advice on any of our stops just shout out. All I can say is pack your sense of adventure, an open mind, a teaspoon of patience (some days more than one required😝), your manners, a few Italian phrases, eat lots of gelato and enjoy every second of your holiday! 🇮🇹🙌🥰", "link": "facebook.com/groups/1373361046396315/permalink/2194809700918108/", "likes": 4077, "comments": [{"username": "Laurie Heederik", "comment_text": "Never did like her and never will now."}, {"username": "Jenny John Walker", "comment_text": "We visited Udine in the North not far from Trieste and Venice, used to belong to the Austrian empire 200 years ago. A part of Italy you never hear about but such a history. Udine is a lively large town easy to get to and from to the Dolomites fabulous villages around, Mosaic school nearby plenty of vineyards and great restaurants. Puglia is great but a bit touristy unless you go off the beaten track."}, {"username": "Debbie Bell", "comment_text": "If you want to see real Italy (not touristy) then head for Le Marche. Unspoilt.. very little English spoken, wonderful people, food and wine. I've lived here for 16 years and still haven't seen everything 🤩"}, {"username": "Jenny Cantrell", "comment_text": "What an amazing trip. You packed so much in!!xxxx"}, {"username": "Dawn Marie", "comment_text": "You trip sounds amazing!"}, {"username": "Anita Berry", "comment_text": "My favourite country"}, {"username": "Donna Maree Lowrey", "comment_text": "Karen Tonoli"}, {"username": "Paola Povesi", "comment_text": "As an Italian lady....just reading your lovely descriptions made me exhausted but happy you love Italy. I don't like travelling around Italy in summer, anyway I'd recommend lake maggiore and lake Garda and our magnificent mountains, The Dolomites. No Rome or Venice in summer, if you like seaside places go to Isola D'Elba, nearer than Sicily or Sardinia. Italy is terribly expensive for the Italians on summer holidays!"}, {"username": "Maria D'angelo", "comment_text": "Next time,make sure you visit Napoli !!! ❤️"}, {"username": "Jean Wilcox", "comment_text": "How wonderful,I know all except Milan."}, {"username": "Stacy Nobbie Remmers", "comment_text": "Ahaa, we day tripped to Florence for our 2 day Milan stay because my husband found it underwhelming."}, {"username": "Angel Dandov", "comment_text": "Why then, after all, have you added a photo of Monopoli (Apuglia)?"}, {"username": "Judelle Drake", "comment_text": "Our trip to southern Italy was cancelled during Covid. Still hoping to go there...!"}, {"username": "Terri Kolesar Rigano", "comment_text": "Where did you stay while in Monopoli? We will be there later this year. Puglia is one of our favorite places to visit. I had the same feeling when we went to visit Matera."}, {"username": "Pam Baird", "comment_text": "What a beautiful photo!"}, {"username": "Linda Dawson", "comment_text": "Janet Brady some info on Lake Como x"}, {"username": "Ceris Evans", "comment_text": "Happy Memories of travelling in Italy! 😃"}, {"username": "Mirella Moro", "comment_text": "Polignano ❤️"}, {"username": "Marilynn Reynolds", "comment_text": "What wonderful memories you created as a family!!❤️"}, {"username": "Ashley Nicholson", "comment_text": "Looks like Sorrento. Love Italy & seen some beautiful places - Pisa, Florence, Capri, Anacapri, Amalfi Coast, Naples xx"}, {"username": "Martha Fernández", "comment_text": "Hi Julia , what a wonderful trip you did.I'm from Miami and would love to go to Australia sometime I want to go with the tour company but is very limited I would love to do it on my own but I have no idea where to star, any info I really appreciate it\nThanks safe trip back home"}, {"username": "Robyn Noden", "comment_text": "I wish I could remember the name of the little B&B we stayed at in Bellagio? Maybe Mirabella, our hostess Francesca was so wonderful 😍 our ferry wait time was similar to yours and 30c +, but I loved it"}, {"username": "Mary Jordan Meiser", "comment_text": "I used Milan only as airport, usually when leaving Italy, as arrival could be Geneva, Zurich, train through the mountains, or Rome for Naples and Capri. Then I had friends move to Milan, and I saw a totally different city. I am glad that I had that chance to ignore the less appealing aspects and enjoy the city with \"locals.\""}, {"username": "Marleen Kroll", "comment_text": "Great descriptions. I haven’t been to Puglia yet. You made it sound wonderful."}, {"username": "Brenda Shepherdson-Geisser", "comment_text": "Thank you for your write up and tips. Very useful."}, {"username": "Wendy Triggs", "comment_text": "Wow sounded an amazing trip 🤩"}, {"username": "Fiorella Laneve", "comment_text": "Our fantastic Puglia!!!!!!"}, {"username": "Kym Sandford", "comment_text": "Thank you Julia for your great tips. Aussie as well, currently In Tuscany and heading to Puglia in a couple of days. Can’t wait x"}, {"username": "Janice Francis", "comment_text": "Sam Samantha Diamond"}, {"username": "Janice Francis", "comment_text": "Paula Rich"}, {"username": "Lynn Moore-smith", "comment_text": "Sounds wonderful. Would like to go this October. Thanks for the info."}, {"username": "Carla Jones", "comment_text": "Mm brings back memories"}, {"username": "Charys Winter", "comment_text": "Love Bellagio.\nAdore Italy 🥰"}, {"username": "Anneke Hamming van Keulen", "comment_text": "Italy is over 40 degrees Celsius now.....not a very nice place to be there ....."}, {"username": "Miriam Christian", "comment_text": "Next time you should explore Sicily. Just returned from there and longing to get back. It is Italy in its purest form."}, {"username": "Marg Tschirpig", "comment_text": "Donna Obst"}, {"username": "Kari Mills", "comment_text": "I recognise that photo . We were there the other day . I loved monopoli too . My partner wasn't well so I had to entertain myself alot . I felt very safe there and like you enjoyed the beach . I loved venice I felt like I had music flowing thru my head with all the visuals . Travelling on those ferries I could have done it all day . We are now down in sicily enjoying taormina. Omg what an incredible place . A lot like amalfi coast ."}, {"username": "Robin Wall", "comment_text": "Thank you for sharing … very insightful … …"}, {"username": "Alice Francesca", "comment_text": "So glad that you visited my beautiful Country! Wish i had known in advance so I would recommend other cities/ towns instead of Milan (which I don't like either like many Italians) .Apart from Rome I would suggest Verona (home of Romeo and Juliet) and lake Garda , plus Torino (first capital of Italy and rich in royal palaces) in the North, Siena, Lucca, the Valle D'Orcia valley with stunning Pienza and the hot springs of Bagno Vignoni in Tuscany, Assisi and Spoleto in Umbria (as green and lush as it gets) plus Lecce and Taormina in the South.If you like caribbean like beaches and sea fly to Sardinia, the biggest island of Italy, great vacation spot.\nIn the picture: Sardinia."}, {"username": "Suzanne Munro", "comment_text": "OMG 😲 thank you for your insight, sounds wonderful."}, {"username": "Marie Coote", "comment_text": "Monopoli secret gem .."}, {"username": "Fran Koy", "comment_text": "This lovely post, makes u realize what it takes to be a true traveling family..\nSpent 10 days around Rome in March...\nWhat a fabulous time to go ...busy but no crowds...around\n60....\nWe went to see my Grandson studing in Rome...Don't miss the Borghese museam on one of your travels..."}, {"username": "Ginny Janes", "comment_text": "Fabulous post !!"}, {"username": "Elisabeth Fawcett", "comment_text": "Its way too touristy now in all the named places. I like authenticity, not there anymore....."}, {"username": "Emma Morrison", "comment_text": "F"}, {"username": "Danielle McNamara", "comment_text": "Foxtown is fabulous!"}, {"username": "Pat Ciotti Brown", "comment_text": "Paola Rich some worth while information"}, {"username": "Yvonne Millard", "comment_text": "San Benedetto del Tronto is beautiful"}, {"username": "Claudia Codega", "comment_text": "I have really appreciated your great review. I live in Australia but I am Italian from Lake of Como (Lecco side). The view is spectacular from the mountains and same can be easily reached (in case you want to go back )"}, {"username": "Joan Al-Darab", "comment_text": "Sounds wonderful. Hope to visit Puglia in September."}, {"username": "Lucy Mignone", "comment_text": "Mario Mignone"}, {"username": "Anton Zablotny", "comment_text": "You missed a treat not carrying on to Lecce."}, {"username": "Patricia Mudaliar", "comment_text": "Wow thanks for sharing Julia it sounds amazing! I have been to lake Garda & Rome in the past but would love to go back. I also want to do Switzerland. 🙏"}, {"username": "Phryne Solomonides", "comment_text": "Very informative post.thank u"}, {"username": "Ken Smith", "comment_text": "We spent six weeks in Italy doing the same thing battling the crowds and the heat but finding small places that were magical and even big cities that were captivating- Rome the eternal city Milan The Last Supper Venice the Grand Canal the new 401 we loved every moment!!"}, {"username": "Maria Sagar", "comment_text": "Sounds wonderful !"}, {"username": "Doredi Beltrame", "comment_text": "Took this same picture. Stayed on Via San Vito….absolutel\ny loved Monopoli and close to so many places to visit. Matera and Alberobello were amazing too. Planning our southern Puglia trip for June 2024 nice time to go because it isn’t crazy busy yet. As far as restaurants just wing it ….food is good everywhere!!!! The Baileys Chocolate Crepe is amazing from the crepe restaurant. Try to support the restaurants that aren’t on trip advisor you will be pleasantly surprised."}, {"username": "Patricia Mudaliar", "comment_text": "I will also be travelling solo next time as I lost hubby last year. Looking forward to going back to Italy but not booked anything yet.might b nice to get a few solo travelers to go together just for the craic & company!"}, {"username": "Kay Malick", "comment_text": "Waow..amazing review!"}, {"username": "Maria Ammaccapane", "comment_text": "Un'altra volta vieni a Napoli, Pompei, Ercolano, Sorrento,Capri,\nIschia,Paestum e tanto altro nella splendida Campania👋👋"}, {"username": "Tery Pedro-Matrone", "comment_text": "Tery Pedro-Matrone"}, {"username": "Tery Pedro-Matrone", "comment_text": "Tery Pedro-Matrone"}, {"username": "Tery Pedro-Matrone", "comment_text": "Omg… the blue boats we were just there!"}, {"username": "Stacy King", "comment_text": "Did you see the singing man right through this walkway on the left?"}, {"username": "Carol Abbott", "comment_text": "Thank you for sharing\nWe hope to travel there certainly in the slightly cooler months"}, {"username": "Melina Bustamante", "comment_text": "😍 Monopoli one of my favorites towns 💙"}, {"username": "Cheryl Kilroy", "comment_text": "Sounds like an awesome trip! Did you travel by train from Paris to Zurich?"}, {"username": "Lorri Ahlemeyer Silva", "comment_text": "Was in Monopli for a few days at the end of May. Great town. Also spent 2 nights in Matera and stayed in a hotel with cave rooms. Loved Matera. Amazing place to experience. Would go back in a heartbeat."}, {"username": "Helen Le Quesne", "comment_text": "What was the name of where you stayed in Venice please? You would recommend?"}, {"username": "Judy Connaughton", "comment_text": "Michael D. Biagi interesting to follow for our hopefully Italian experience 😎"}, {"username": "Sondra Homeres Meyers", "comment_text": "More pics please 👍🏼"}, {"username": "Liz Friedrich", "comment_text": "This is a great post. Thanks so much. So much really helpful info."}, {"username": "Sandra Callanan", "comment_text": "Loved reading your review. It brought back so many memories of happy times in Italy."}, {"username": "Alanda Binstead", "comment_text": "Love reading all the comments of places to see. We’ve rbeen to Italy twice and going back in May 2024. We will be doing all our travel by train so any advice would be helpful. It will be north Italy ending in Grosseto"}, {"username": "Ellen Houben", "comment_text": "Monopoli 🩵"}, {"username": "Rhonda Wilkes", "comment_text": "Barbara Lee Shane Lee"}, {"username": "Janet Ballard", "comment_text": "Thank you Julia it was lovely to hear all about your holiday it sounded wonderful. Love Italy 🇮🇹. Myself and my late partner did a lot of holidays in Italy. Going back there next year has a solo traveler for the first time. Lake Garda Venice Varona..Very much looking forward to it. Bit nervous has first time by myself."}, {"username": "Caroline Sherwood", "comment_text": "Jeremy Sherwood"}, {"username": "Monica Carson", "comment_text": "Sophia Howarth sounds like your brilliant trip to italy"}, {"username": "Erika Huber", "comment_text": "Beautiful Monopoli 😍"}, {"username": "Glenda Speirs", "comment_text": "Thank you for your wonderful post ! Off to Italy in October can’t wait 😝"}, {"username": "Jenny Meffert", "comment_text": "Fabulous post. Great tips and travel information"}, {"username": "Ann Tingle Harhoff", "comment_text": "Thank you for sharing this - I’ve made lots of notes! 🥰"}, {"username": "Linda Marcov", "comment_text": "We were three days in Monopli this May , can’t agree more, it was suburb. And Matera still has me swooning! I want to go back at night when it’s all aglow. Next time. Our trip through Puglia was so rewarding! Those olive trees …. My what stunning trees !"}, {"username": "Linda Marcov", "comment_text": "Thanks for your great post"}, {"username": "Giulia Ravina", "comment_text": "Next time you're in the North of Italy visit Turin: you won't be disappointed😉"}, {"username": "Adriana Horne", "comment_text": "Thanks for sharing your trip. Im going to Italy in August and will be going to Matera and Monopoli. I’m so glad you loved it there. I’m also going to Lake Como staying in Bellagio. I read you went to Foxtown and I’m wondering how long it takes to travel therw and best way to get there? Thank you in advance"}, {"username": "Rosemary Scarlet", "comment_text": "I too found Milan totally underwhelming . Saw the Last Supper , the Monumentale Cemetery ( fantastic !!!) , Duomo.\nEverything else was very ordinary ."}, {"username": "Sarah Beaumont", "comment_text": "Thank you so much for this post Julia and all the comments and answers. It's inspiring!"}, {"username": "Pina Pascale", "comment_text": "Vicino Monopoli è possibile visitare anche le Grotte di Castellana!\nUna perla del sottosuolo pugliese!"}, {"username": "Mary Smyth", "comment_text": "Katrina Christ. There we were too, three weeks ago. Interesting article"}, {"username": "Sue Ellen Bennett", "comment_text": "Great to read your travelogue. All of it sounds amazing."}, {"username": "Gayle McShane", "comment_text": "Kerry Moore worth a read 👍"}, {"username": "Katharine Seed", "comment_text": "Such a spectacular trip!"}, {"username": "Paul Cav", "comment_text": "Anna Cavallin"}, {"username": "Helen Kimber", "comment_text": "Shayne Duncan"}, {"username": "Lida Cayer Matthews", "comment_text": "My kind of trip!!"}, {"username": "Daniela Benzoni", "comment_text": "Viaggio stupendo!\nIo sono di Milano e mi spiace leggere che non ti sia piaciuta. Milano è una città stupenda, ricca di storia ed arte. Una città da esplorare in cui poter fare tantissime cose e vederne altrettante. È una città da visitare con calma, non solo di passaggio. Forse sarebbe meglio informarsi prima su cosa fare e vedere.\nSolo per fare un esempio la Pinacoteca di Brera è ricca di dipinti stupendi (molti famosi).\nMolti pensano che a Milano ci siano \"solo\" il Duomo ed il Castello Forzesco (che comunque sono bellissimi).\nComunque sia leggendo il tuo post mi è venuta voglia di visitare Monopoli, non ci sono mai stata😊"}, {"username": "Karen Lameo", "comment_text": "Thoroughly enjoyed your comments!! Making plans for 2024. Will take your suggestions into consideration!"}, {"username": "Michelle Bazzacco Maugeri", "comment_text": "Sounds like an amazing trip. I can't wait to go back to Italy again to see more magnificent places"}, {"username": "Christine Gowan", "comment_text": "Monopololi we love it , beautiful old city , been twice , and planing to go back , fantastic xxxxc"}, {"username": "Patricia Oman", "comment_text": "Thankyou for a wonderful write up & description. I fear I will never make this trip as have no idea how to organize."}, {"username": "Dana Talusani", "comment_text": "What part of your trip is this picture from? Stunning blue water!"}, {"username": "Elizabeth Broom", "comment_text": "I highly recommend reading Rick Steves for travel in Italy and all of Europe, recommends places to stay, restaurants, places to visit etc. wet travelled for 7 weeks in Italy using only Tick Steve’s book and a Eurail pass."}, {"username": "Eileen Lonergan", "comment_text": "Eileen Lonergan"}, {"username": "Karen Lacey", "comment_text": "Bert Lacey recognise this view?! X"}, {"username": "David Burton", "comment_text": "Beautiful Monopoli - was there last week!"}, {"username": "Maureen Munns", "comment_text": "Just love Italy and monopoly is the best 👍🏻"}, {"username": "Kerry Ritson", "comment_text": "Taking photos like this is very rewarding!"}, {"username": "Angela Younger", "comment_text": "Love your monologue! So much info\nI also just got back from Italia! A regular trip for me Pre COVID..can’t wait for next year and will take on some of your suggestions 🙏"}, {"username": "Mary Church", "comment_text": "Thank you for infro it was very interesting I have been to ltaly once before and loved it wil be visiting next year"}, {"username": "Jane Allaway", "comment_text": "Don Cullen interesting read"}, {"username": "Irene Turai", "comment_text": "My favorit place? anywhere in Italy I'm happy ❤️🇮🇹"}, {"username": "Debbie Bellenger", "comment_text": "Oh my gosh!!!! Stunning!!!!"}, {"username": "Charmaine Bittruf", "comment_text": "Thanks Julia for a great comprehensive description if your wonderful trip. It sounded amazing. I think I would love to do that cheers"}, {"username": "Kaz Corcoran", "comment_text": "Welcome home to Oz. What a wonderful holiday you’ve had. Time now to plan the next one 😉😁"}, {"username": "Maria Wilson - Tamburro", "comment_text": "Thank you for your descriptive account of your holidays. Sounds marvellous"}, {"username": "Lesley Cowie", "comment_text": "Thank you for such detailed information & such joy. This will help me sooo much with my planning. I have wanted to go to Lake Como & Bellagio ever since I saw the movie \"Heaven has no Favourites\" based on the book \"Bobby Deerfield\" with Al Pacino & Marthe Keller."}, {"username": "Judy Fox", "comment_text": "We loved Polignano and we really enjoyed Puglia"}, {"username": "Charmaine Lee", "comment_text": "Loved reading this Julia I too adore Italy and plan to return next year. We have done quite i bit of the north and would like to start in Venice and take trains down the Adriatic coast. You have certainly raised our internet in Monopoli. Thanks."}]}, {"id": "2194802717585473", "text": "Sorrento", "link": "facebook.com/groups/1373361046396315/permalink/2194802717585473/", "likes": 1749, "comments": [{"username": "Jôzsefnė Kocsis", "comment_text": "Igen,tavaly itt volt a szállasunk, és fürödtünk is!\nA fekete,forró homok is emlékezetes maradt...👏🇮🇪🥰"}, {"username": "Gary Swift", "comment_text": "Beautiful Sorrento"}, {"username": "Joanne Jarrett", "comment_text": "Beautiful 😍"}, {"username": "Carol Rippel Barnes", "comment_text": "Love Sorrento"}, {"username": "Dee Demaris Quintero", "comment_text": "Sorrento is beautiful, we loved staying near there"}, {"username": "Rachid Baltri", "comment_text": "Sto cercando un lavoro per essere e possibile e grazie"}, {"username": "Wendy Russell", "comment_text": "I left a little bit of my soul in Sorrento"}, {"username": "Regina Nagy", "comment_text": "Love Sorrento❤️🇮🇹"}, {"username": "Lois Marie", "comment_text": "We were here and it’s is beautiful"}, {"username": "Carolyn Messino", "comment_text": "I was there"}, {"username": "Debbie Hilton Holl", "comment_text": "Best limomcello in the world"}, {"username": "Kerry Rigby", "comment_text": "My favourite place🩷"}, {"username": "Pauline Mokhethi Dolo", "comment_text": "My bucket list"}, {"username": "Peter Stebbings", "comment_text": "Wonderful Place....."}, {"username": "Liliana Musso", "comment_text": "we stayed at Imperiale tramontano hotel,former house of poet Torcuato Tasso"}, {"username": "Judith M. Hegler", "comment_text": "Loved my trip to Sorrento🥰! Hopefully I will get back again❤️"}, {"username": "Gayle McCutcheon", "comment_text": "Stayed here for five days. Beautiful place to vacation."}, {"username": "Marek Maco Mackovič", "comment_text": "Marek Maco Mackovič"}, {"username": "Mike Denning", "comment_text": "Can’t separate the two places both got buckets of charm but the many highlights of Amalfi coast takes some beating."}, {"username": "Karla Hardie", "comment_text": "Stuart Jack"}, {"username": "Brenda Wainwright", "comment_text": "I went for a trip on a cruise want to go back"}, {"username": "Alexandria Lagala-Romano", "comment_text": "Visited Sorrento several years ago. Paradise!"}, {"username": "Phyllis Mc Kenny", "comment_text": "Gorgeous ❤️❤️"}, {"username": "Angela Binley", "comment_text": "4 weeks Friday Ian Binley❤️🥰"}, {"username": "Ashley Wood", "comment_text": "Love Sorrento. What a place!"}, {"username": "Mary Pitrone Meo", "comment_text": "Another pretty place in Italy"}, {"username": "Dominic Rocchio", "comment_text": "LOVE Sorrento!!!"}, {"username": "Sandra Jennings", "comment_text": "❤️"}, {"username": "Lorraine Lean", "comment_text": "David Lean the best place we have been ❤️❤️"}, {"username": "Larry S Rindner", "comment_text": "Claudette LaFerney 👍"}, {"username": "Roger W Ilsley", "comment_text": "Love Sorrento"}, {"username": "Nancy Brennan Carrow", "comment_text": "We loved Sorrento. I miss it! ❤️"}, {"username": "Wendy Bey-Sottovia", "comment_text": "My fav!"}, {"username": "Mary Evans", "comment_text": "Ah yes. I need a return trip"}, {"username": "Carine Brys", "comment_text": "My best trip ever! Just my daughter and me..."}, {"username": "Dottor Peppe Insigne", "comment_text": "I am of the opinion that the Sorrento peninsula is much more beautiful and less appreciated than the Amalfi coast"}, {"username": "Dianne Lee", "comment_text": "I have that same photo our first look of Sorrento in April a big WOW"}, {"username": "Jude Dale", "comment_text": "The sorrento peninsula is truly beautiful 😍"}, {"username": "Val Nicholls", "comment_text": "Love Sorrento"}, {"username": "Robert Told", "comment_text": "Visit Spring 2023"}, {"username": "Kathy Battaglia", "comment_text": "just loved all of it! just got back and missing it !"}, {"username": "Susan Lepre Remillard", "comment_text": "Absolutely gorgeous!!!Sorr\nento has my heart!❤️"}, {"username": "Patrycja Król", "comment_text": "I've been. I've seen. It's wonderful there😍"}, {"username": "Donna Kate", "comment_text": "Martin Taylor"}, {"username": "Linda Onorato", "comment_text": "My German friend said Sorrento was too tourista serving German food to all the German tourists so wanted nothing to do with this locale"}, {"username": "Bobbie Schaefer DiChristopher", "comment_text": "Loved Sorrento. Hoping to make it back someday."}, {"username": "Joey Heath", "comment_text": "Going back to sorrento for the 4th time in September"}, {"username": "Lidia Antoniette", "comment_text": "Loved Sorrento so much, such a gorgeous place :)"}, {"username": "Katrina Keegan", "comment_text": "Sharon Mason not long now 🏖"}, {"username": "Karen Lewis", "comment_text": "Loved it first Italian holiday will be going back. X"}, {"username": "Wendy Montague", "comment_text": "Sorrento is beautiful, as is Italy. Lovely holidays and great memories"}, {"username": "Grumpyy Mike", "comment_text": "Fabulous place, great food and"}, {"username": "Elly de Bruijn", "comment_text": "I love Sorrento and specially GRAND HOTEL RIVIERA to stad."}, {"username": "Jerry-Agnes Gilley McKamey", "comment_text": "Just there and the Grand Hotel La Favorita spoiled us rotten for our anniversary stay!!"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2194798984252513", "text": "Thoughts on a trip to London, Paris, and Italy in January? Any advice on which cities to visit in Italy or example itineraries for these locations? Trip time would be 2 - 3 weeks", "link": "facebook.com/groups/1373361046396315/permalink/2194798984252513/", "likes": 0, "comments": [{"username": "Charlotte Reid", "comment_text": "Naples and Rome are both great to visit. Could do Naples in 2 days and Rome I’d say 3 days maybe one extra if you want to go to the Vatican"}, {"username": "Glenn Todd Webb", "comment_text": "You need almost a week in London and Paris each. Save travel and check in/out times. Just go to Italy. You can do Rome, Florence, venice, Milan, lake Como in 3 weeks and see all the major places."}]}, {"id": "2194790330920045", "text": "We will be in Florence the last week of September and would like a suggestion for a nice Airbnb.", "link": "facebook.com/groups/1373361046396315/permalink/2194790330920045/", "likes": 0, "comments": []}, {"id": "2194789914253420", "text": "Anyone enjoyed taking the train from Paris to Florence or will it feel too long and should fly? How are the train stations? It *seems* nice to see parts of France, maybe Milan, etc. on the way. Time isn't a factor as I can account for it.", "link": "facebook.com/groups/1373361046396315/permalink/2194789914253420/", "likes": 4, "comments": [{"username": "Ken Lerch", "comment_text": "We took the overnight. ‘Didn’t see that much but easy and we are train people."}, {"username": "Marie Cuzzi", "comment_text": "I’d fly not a fan of trains"}, {"username": "SarahMarie Farrugia", "comment_text": "I would opt for flying"}, {"username": "Silvia Laurenti", "comment_text": "Great way to travel - Paris Milan train is a lovely journey easy and scenic"}, {"username": "Desiree Jimenez", "comment_text": "In 2015, my husband and I took a train from Paris to Turin. It was actually really nice and we enjoyed it. We played cards while taking in the scenery."}, {"username": "Marcilene Stefan", "comment_text": "I flew from Venice to Paris! it was a wonderful experience! cheap and fast!"}, {"username": "Ann Lombardi-Perkins", "comment_text": "If you're in a hurry, fly. We enjoyed taking the train."}, {"username": "Carmine Napolitano", "comment_text": "We went from Milan to Paris executive class was like a hundred bucks open bar and they let us order pretty much as much food as we want included and you got to see the sites catch up on sleep"}, {"username": "Gillian O'Callaghan", "comment_text": "Love using the trains in Europe and have just left after about 20 train trips. Relaxing, great scenery....some\nthing chilled and magical about it. Nice to be unbusy and not rushing from a to b.....and not queueing in airports. Go and enjoy."}, {"username": "Joe Guzzi", "comment_text": "Fly"}, {"username": "Heather MacDonald", "comment_text": "I loved taking the train within Italy. I never even picked up my book. I'm not sure how I'd feel coming all way from Paria but I think the scenery would be incredible."}, {"username": "Doug Burke", "comment_text": "Take the train. A different way to travel without the typical airport mob scene."}, {"username": "Chandni Punjabi", "comment_text": "Can anyone please guide if we train from Paris/Lyon to Florence with two toddlers, which option would be better? Train or flight?"}, {"username": "Virgz Van Møøre", "comment_text": "Too long, check on Trenitalia"}, {"username": "Sara Butcher", "comment_text": "I’ve travelled CT to Paris and that was a long day but travelling from Rome or Milan will be shorter and only one train. I travelled first class as the tickets were not much more expensive. My seat was allocated and they bought menus to my seat to choose my meal. It was great seeing the scenery (went through Switzerland) and a day to relax and have some downtime. For me, much more relaxing than flying. I also had a pickup waiting for me at the train to take me to the hotel- best thing! ❤️🇮🇹🇫🇷🇦🇺"}, {"username": "Steve Mathison", "comment_text": "We did this a couple years ago. When you check schedule there was only 1 train that left early from Florence and got to Paris mid afternoon all the other trains are over night trains. We did the morning train. The train trip thru Switzerland was amazing. I would take the train. Ours was 9-10 hours."}, {"username": "निनावी सहभागी", "comment_text": "Has anyone gotten a Euro rail global pass? I'm taking the train from London to Paris for sure. And if I also do Paris to Florence, it may be worth it. Can it be used for Eurostar, TrentItalia, basically any type in Europe?"}]}, {"id": "2194785227587222", "text": "I have this. Is this all I need for plugging in our phones? Or do I need something in addition? We won’t have hair dryers or curling irons. But I am bringing my good camera (SLR) and will have to plug in my battery pack probably once. I also have mini fans for sleeping. Will I need something for those things? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2194785227587222/", "likes": 7, "comments": [{"username": "Lynda Fenton", "comment_text": "Yes, perfect for phones & iPads. Unfortunately, if you plug in a fan that is 110, the 220 surge will destroy it. (I have lived in Sicily for a year & destroyed many American fans plugging them into an adaptor, because I’m forgetful 😂)."}, {"username": "Meredith Williams", "comment_text": "took that one and it was great for my phone, kindle and airpods!"}, {"username": "Julia Ruby", "comment_text": "I might consider bringing a type L as well."}, {"username": "Lauren-Jade Roberts", "comment_text": "Some places in Italy have three prongs not two"}, {"username": "Vicki Susie Naab Gandolf", "comment_text": "That will be fine. Most of the hotels we stayed in had jacks for phones that were compatible with our phones. Just needed the places for our cameras, razors, etc. I did take a hair dryer, but just ended up using the ones on the hotels."}, {"username": "Eileen Rossi", "comment_text": "💯👍🏻"}, {"username": "Rosanne Messineo Mills", "comment_text": "That’s a good brand for an adapter. We bought the version that has both USB-A and USB-C outlets."}, {"username": "Heidi Littman Meiers", "comment_text": "Can someone recommend a \"converter and adapter \" in one ? Is that a thing ?"}, {"username": "Monique Swanner", "comment_text": "Yes you need that. Some places have USB but not all"}, {"username": "Neville Spargo", "comment_text": "One thing that has worked well for us is bring a small power board from home , then you only need one plug converter for the plug board and then all your devices plug into the board with No converter required 😃"}]}]