[{"id": "2211662709232807", "text": "We are headed to Sorrento in 2 days. I thought some of the beaches you could just go and reserve a chair for a couple hours in the morning. Is that not the case? Did I need to book in advance? If you’ve been, which is your favorite beach?", "link": "facebook.com/groups/1373361046396315/permalink/2211662709232807/", "likes": 1, "comments": [{"username": "Cat Furness", "comment_text": "I was there in June. I walked down and was able to get one without booking.\nCan’t remember the name but it was the very last beach club on the left."}]}, {"id": "2211659812566430", "text": "Looking for restaurants recommendations by Cathedral in Milan", "link": "facebook.com/groups/1373361046396315/permalink/2211659812566430/", "likes": 0, "comments": [{"username": "Jean Schroeder", "comment_text": "Following"}, {"username": "Pamela Campaner", "comment_text": "I usually advise against eating too close to the cathedral because the menus are too touristy. A short walk away, Via laghetto 2 on a small street next to the University, is Cantina Piemontese. A charming historical restaurant opened in the early 1900s. Check out the vacation closure!"}, {"username": "Elnara Mektiev", "comment_text": "Following"}, {"username": "Elnara Mektiev", "comment_text": "I will be in Milan for 2 days, what restaurant would you recommend very not touristy very authentic with great ambiance and must try!"}]}, {"id": "2211673642565047", "text": "Our hotel in Ravello just sent this list. Anyone been to these and have real reviews and suggestions where to go? We are only in ravello one night.\n\nPlan to go to Villa Cimbrone for sunset before", "link": "facebook.com/groups/1373361046396315/permalink/2211673642565047/", "likes": 17, "comments": [{"username": "Romilly Farina", "comment_text": "We ate at Cumpa Cosimo. I had the best gnocchi of my life there. It’s family run and there aren’t views but the food is amazing!!!!"}, {"username": "Kathy Dalziel Howie", "comment_text": "View at Hotel Caruso is spectacular. Easy to walk to from down town area. Go up for a drink at least and walk the grounds"}, {"username": "Lisa Adams Robertson", "comment_text": "We stayed at Villa Maria and ate there one night and enjoyed it. I honestly don't remember what we ate, though!"}, {"username": "Deepa Arte", "comment_text": "Highly recommend Ristorante pizzeria vittoria (had salt baked fish) and Osteria Ravello (black cod cooked in parchment paper). We were there a week ago. I so miss it.\n\nAlso recommend visiting villa Ruffolo."}, {"username": "Deepa Arte", "comment_text": "Villa Maria was a disappointment,\ngreat view but food not so."}, {"username": "Gay Bell DiBartolomeo", "comment_text": "We stayed at Villa Cimbrone. Had a lovely dinner at Villa Maria down the hill. Incredible view."}, {"username": "Colin Ng", "comment_text": "F"}, {"username": "Bethany Morrow", "comment_text": "We went to Garden Ristorante in Ravello last week and loved it. Check to see that it is the same one. The views were amazing! Here is a pic"}, {"username": "Bernadette Sarmiento", "comment_text": "F"}, {"username": "Patricia Capuccio", "comment_text": "My husband's family comes from Ravello. The ceramics are gorgeous"}]}, {"id": "2211676219231456", "text": "My husband and I will be returning to Italy next month. The last time we were there, we were using AT&T as our phone carrier. Two years ago we switched to Consumer Cellular and while we are extremely pleased with their domestic service, their international service is not nearly as good and expensive. We are looking for alternatives so that we canआणखी stay in touch with family without having to sell a child to pay for it (joking). We have looked into International and Italy only SIM cards, but they too have pros and cons. We have already put WhatsApp on our phones which will help.\nIf anyone has any alternative ideas to share, I would appreciate your input.\nThank you, in advance, my fellow travelers.", "link": "facebook.com/groups/1373361046396315/permalink/2211676219231456/", "likes": 3, "comments": [{"username": "Paula Banks", "comment_text": "Buy an ESIM I use them all over the world they work great and are cheaper"}, {"username": "Paula Banks", "comment_text": "I have good luck with Airilo"}, {"username": "Denise Ward", "comment_text": "I had good luck in France with whatsapp."}, {"username": "Joshua Pickles", "comment_text": "T-Mobile for the win"}, {"username": "Janine Emma Lucas", "comment_text": "We are using Airalo, 30 gb, 30 days $33 usd. My daughter recently returned and had great coverage. No physical sim, it’s an app."}, {"username": "Mary Ann Brown", "comment_text": "Airalo, used in London and Paris and was great"}, {"username": "Leslie Goodland", "comment_text": "Buy a local SIM card and use Whatsapp."}, {"username": "Mary Robinson Boggs", "comment_text": "We also have consumer cellular and in March we spent a month in Vietnam. We bought a SIM card and just switched it out and it worked great. Thinking of doing ESim for our Italy trip this fall"}, {"username": "Sam Mah", "comment_text": "Lebara and Orange."}, {"username": "Shirley Lewis", "comment_text": "buy a SIM card from any local phone service, Wind, Tim, Vodafone, etc and you will have service just like home! you must have your passport with you to purchase ... about 40 euro for 1 month"}, {"username": "Kim Bend Smolinski", "comment_text": "If you have a newer phone, you cannot replace a SIMs card and have to go with an ESIMS.... That's our plan when we go to Italy next month."}, {"username": "Eva Johnson", "comment_text": "WhatsApp"}, {"username": "Susan Rathke", "comment_text": "I use Messenger and a Instagram to make calls home."}, {"username": "Kate Ochman", "comment_text": "This assumes you d get enough selling the child!"}]}, {"id": "2211678699231208", "text": "Hello! We are going to be in either Lake Garda or the Dolomites next summer. I have an adventurous husband and daughter (and a slightly less adventurous self and other daughter who will go along nervously 😜). These are the ”thrill” activities I can think of: paragliding, canyoning, via Ferrata, SUPaddleboarding, and white water rafting. We hadआणखी planned on going to slovenia and had a place that had packages that packages multiples of these things together. Anyone have any experience with companies that group these activities together? It can be either Lake Garda area or Dolomites. Tia!!", "link": "facebook.com/groups/1373361046396315/permalink/2211678699231208/", "likes": 0, "comments": []}, {"id": "2211676725898072", "text": "Do we still need to have a negative Covid test when entering Italy?", "link": "facebook.com/groups/1373361046396315/permalink/2211676725898072/", "likes": 4, "comments": [{"username": "Meredith Williams", "comment_text": "nope!"}, {"username": "Claudia Jaramillo Giraldo", "comment_text": "No"}, {"username": "Cheryl Swiatko", "comment_text": "No"}, {"username": "Cheryl Swiatko", "comment_text": "No"}, {"username": "Silvana Rocca Ozzimo", "comment_text": "No"}, {"username": "Mona Sidhu Samrari", "comment_text": "Noooooo"}, {"username": "Geraldo Prioriello", "comment_text": "No"}, {"username": "Graham Sherlock", "comment_text": "No checks, No nothing, just proceed"}, {"username": "Karen Martinez", "comment_text": "No"}, {"username": "Austin Briscoe", "comment_text": "No"}, {"username": "Roe Gallo Saks", "comment_text": "No"}, {"username": "Steph Coombes", "comment_text": "No"}, {"username": "Ewa Kolodziej", "comment_text": "🤣🤣🤣🤣🤣🤣🤣"}, {"username": "Fabio Clemente", "comment_text": "They stopped to asking the COVID test in June, 2022"}, {"username": "Michele Ann Tomao Ruzzano", "comment_text": "No, we were there 3 weeks ago."}, {"username": "Enrico Lecce", "comment_text": "Noooo"}]}, {"id": "2211689709230107", "text": "Beautiful Venice, Italy 🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2211689709230107/", "likes": 3, "comments": []}, {"id": "2211689795896765", "text": "Can anyone advise if Sheraton Rome Parco de’ Medici has airport shuttle for pick up & drop off. TY😍", "link": "facebook.com/groups/1373361046396315/permalink/2211689795896765/", "likes": 0, "comments": []}, {"id": "2211680245897720", "text": "Best gelaterias/ ice creams in Venice? 🍦", "link": "facebook.com/groups/1373361046396315/permalink/2211680245897720/", "likes": 0, "comments": [{"username": "Rob Wolfe", "comment_text": "My suggestion is try them all and then you decide which ones the best. You may even have to do it twice."}, {"username": "Marjorie Clare", "comment_text": "All are delicious anywhere in Italy !!!"}, {"username": "Kejdi Okej", "comment_text": "My suggestion is try them all and then you decide which ones the best . You may even have to do it twice"}, {"username": "Danni Whitby", "comment_text": "My advice is do not go to the most popular Suso and surrounding gelato’s who overcharge for inferior gelato, the authentic and amazing gelato in Venice is “Gelateria Gallonetto”.\n\nAuthentic gelato is not on show piled in tubs, it’s hidden in metal tubs with lids, and is not artificially coloured!"}, {"username": "Andrew Durston", "comment_text": "Your not going to get bad ice cream in Italy…."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 8, "comments": []}, {"id": "2177029462696132", "text": "Traveling to Italy during our hot summer can be tricky if some of your accommodation options don’t have air conditioning and you need to stay cool or you don’t want to overheat during an excursion like a sunset… आणखी boat ride or a walking tour.\nHere are the best portable fan for travel so you can stay cool no matter where you are!\nMINI PORTABLE FAN FOR TRAVEL\nIt's slim and lightweight, perfect for dropping in your bag and pulling out whenever you need to cool down.\n👉 https://amzn.to/437sUSB\nPORTABLE TRAVEL FANS FOR YOUR ACCOMMODATION\nIt’s tiny and its 6-ounce weight won’t take up a ton of space in your bag. But it’s powerful with three speeds.\n👉 https://amzn.to/3PpU6IT\nHANDS FREE PORTABLE NECK FAN\nThis hands free bladeless neck fan can send the wind without clogging your hands by simply placing it on your neck.\n👉 https://amzn.to/42OztJn", "link": "facebook.com/groups/1373361046396315/permalink/2177029462696132/", "likes": 0, "comments": []}, {"id": "2211536889245389", "text": "Visiting Rome next month on a bus tour. Our tour includes seeing the outside of the Colosseum, but doesn’t go inside. We are assuming that seeing the inside is a must do. Any recommendations on buying tickets to skip the line? Did you buy tickets directly from the colosseum or from a tour company? I see some tours go down to the Colosseum floor and some don’t. Our time is limited so I need help choosing wisely. Thanks for any advice!", "link": "facebook.com/groups/1373361046396315/permalink/2211536889245389/", "likes": 1, "comments": [{"username": "Paul Anderson", "comment_text": "Buy an underground night ticket off site 300 meters up the road from the colosseum no lines. There is a small steam running underneath left over from the Roman aqueduct"}, {"username": "Valerie Shea Romeo", "comment_text": "Same here. I don’t have the schedule yet or know how much time I will have to see the inside. I noticed tours are 1-3 hours. I’m going to look for afternoon shorter time."}, {"username": "Darcy Jessen", "comment_text": "Was there a few days ago. If I were to do it again, I’d skip the inside"}, {"username": "Bill Gillespie", "comment_text": "I use Viator all the time."}, {"username": "Danielle Withrow", "comment_text": "I'm not sure seeing the inside of the Colosseum is a Must Do, especially if your time is limited. However, seeing the OUTSIDE is a Must Do, in my opinion. It is easy to walk around the entire structure without a ticket and get a real feel for the grandeur it once was. If you can get a ticket for the inside without sacrificing other activites/\nsites in Rome - great, but don't feel you are missing out if the inside doesn't work out."}, {"username": "Mil Myvegas", "comment_text": "If you are NOT looking for a guided tour then consider The PARCO Membership from CoopCulture. €80 for two adults and up to three children under 18 years of age. You still need to reserve your free admission to the Colosseum by choosing your preferred date and time, but there is a special link for members to do this and there is currently availability (9:30 am - 5:30 pm) everyday through the first week of September. I purchased the membership and used it two weeks ago. You will need to redeem the voucher at the ticket booth, but there is a designated window for members and there’s no need to stand in the long line for same day tickets. If you purchase the membership you will need to present your passport/s. This is how I secured my entrance tickets. You do get access to the Forum, Palatine Hill, and Super Sites if you want to visit. No underground access and NO tour guide. You explore on your own. This worked for my family. https://\nwww.coopculture.\nit/en/products/\nparco-membership\n/"}, {"username": "Marian Seanor", "comment_text": "Curious are you with Insight tours as I am in Sept and decided after reading I’m ok with seeing just the outside. We have a packed day, glad I am arriving one day before tour."}]}, {"id": "2211538435911901", "text": "We are staying near Assisi, looking for vegan recommendations here or must try places anywhere else in Umbria. After one week in Italy I am getting a bit tired of pizza without cheese, grilled vegetables and pasta with tomato sauce haha so maybe you can help me out ☺️", "link": "facebook.com/groups/1373361046396315/permalink/2211538435911901/", "likes": 1, "comments": [{"username": "Elena Eugeni", "comment_text": "https://\nmaps.app.goo.gl/\neLU5K8h4Y3pwb9Rc\n7\nThis is very good, they use all local produces that they grown. You should call ahead and book, they are usually open only on weekends"}]}, {"id": "2211510869247991", "text": "Taking family to Italy next year . Four teenagers 18 through 14. We will be there for 8 to 10 days would like a few days at the beach at the end so we can relax. Would anybody have a general itinerary that would be a good starting point. I think we will start in Rome and work our way up north and (leave Naples down south for another trip) What do you guys think of this. We don’t have a huge budget so if anybody has good Airbnb or hotel recommendations, we would be very grateful. Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2211510869247991/", "likes": 5, "comments": [{"username": "Leslie Goodland", "comment_text": "Ask your teenagers to put one together. It'll be a good research project for them. Don't forget your visas."}, {"username": "Lean Ni Chleirigh", "comment_text": "Does it have to be a traditional beach? I’ve heard that lake Garda is amazing for water sports, maybe your teens will appreciate.\nA few days at the beach really only leaves you a week, so I’d say Rome and decide between Venice and Florence."}, {"username": "Felicia LoCascio Whitney", "comment_text": "We are going to Santa Marinelli when we arrive in FCO. Hotel directly on the beach. From there we'll drive to Umbria!"}, {"username": "Becky Lymak", "comment_text": "Liz Fielden good post to follow for us x"}, {"username": "Bea Kuckens", "comment_text": "With a family of six, definitely Air B & B."}, {"username": "Lucrezia Folger", "comment_text": "There is a big difference between 8 and 10 days, also without arriving and departing as part of those days. Every one will love Roma, and heading north to 1 or 2 other places depending on your days sounds great. If you want to be near water, go to Largo Como or Cinque Terra. The kids are at a great age to also be reading up on places in the areas you're going to, to see what they too want to do."}, {"username": "Claire Dowson", "comment_text": "You can swim in the Lakes, which is lovely."}, {"username": "Rose Turdo", "comment_text": "Bolsena Lake"}]}, {"id": "2211446002587811", "text": "I have a 9Am flight from Fiumicino to home next week. I will be coming from Lucca the day before. Would you suggest staying near Fiumicino or in Rome (have been multiple times) for the night and then just taking a very early train to Fiumicino.", "link": "facebook.com/groups/1373361046396315/permalink/2211446002587811/", "likes": 0, "comments": [{"username": "Chris Landry", "comment_text": "I stayed at the airport hotel. Just a walk away. No stress."}, {"username": "Stephen Henn", "comment_text": "We usually stay at Hotel Tiber which has an airport shuttle for small fee (6-8€). It is in Fiumicino and reasonably priced. It’s about 10-15 minute drive from airport. They have a restaurant and bar in the hotel."}, {"username": "Donna Pennino", "comment_text": "If you haven't already make sure you download the us customs Mobile Passport App to get back in. Apparently makes doe easier return to US."}, {"username": "Beverley Milson", "comment_text": "Stay near airport. Take a stroll to waterfront… lots of restaurants… no stress next day for early flight."}, {"username": "Rebecca Yeoh", "comment_text": "I stayed near Roma Termini, its not a great area to be frank. If I were you just opt for somewhere close to the airport. You don’t want to be walking from hotel to Termini at that time of the day."}, {"username": "Tricia DeCristofaro", "comment_text": "We stayed right near the airport at the Hilton. Easy!"}, {"username": "Tricia DeCristofaro", "comment_text": "We stayed right near the airport at the Hilton. Easy!"}]}, {"id": "2211423895923355", "text": "Has anyone used, In the US, the \"Mytravelgov\" site when renewing a passport or traveling abroad?", "link": "facebook.com/groups/1373361046396315/permalink/2211423895923355/", "likes": 0, "comments": [{"username": "Colleen Dawson", "comment_text": "Never use it for passport renewal, use it to register in the STEP program."}, {"username": "Ralf Eisermann", "comment_text": "Yes. It took 5 months to receive but that was fine for me."}, {"username": "Kejdi Okej", "comment_text": "Yes l t took 5 months to receive but was fine for me"}]}, {"id": "2211342649264813", "text": "I’ll be spending a week in Venice and a week in Florence in May 2024. I love art galleries and museums. I’ve been to Rome before. From Florence I was planning to stay in Bari 5 nights and take day trips to Alborello, Trani and Matera. I’ll be travelling by train. Was thinking of then staying in Lecce for 5 nights and take day trips to Brindisi and Otranto. Is 5 nights too long for Bari or Lecce? Where else would you recommend in the Puglia region?", "link": "facebook.com/groups/1373361046396315/permalink/2211342649264813/", "likes": 0, "comments": [{"username": "Lauren Smigielski", "comment_text": "When you’re in Venice you must go visit Murano and see the blown glass museum! They’ll give you a little demo on how they make the glass then you can tour the stunning gallery and purchase if you’d like, my hotel offered a free water taxi shuttle to and from Murano 😊"}]}, {"id": "2211332639265814", "text": "HI ALL! please help\n\nBest beaches to swim in, in *lake como* and *Portofino*? To survive the heat wave coming next week???", "link": "facebook.com/groups/1373361046396315/permalink/2211332639265814/", "likes": 0, "comments": [{"username": "Ely Elisa", "comment_text": "In portofino no beaches, just in Paraggi."}, {"username": "Kejdi Okej", "comment_text": "In Portofino no beaches just in paraggi"}, {"username": "Amanda Kenny", "comment_text": "We've just left Rapallo which is close to Portofino. You can swim here and it's a great place to stay. Lots to do, lively, not expensive. San Fruttuoso is lovely but small. You can swim here. Close to Portofino. Are you staying in Portofino? Very expensive and doesn't seem to be a lot to it. I recommend Rapallo. We explored Portofino and Cinque terre from there."}, {"username": "Kenzie Masters", "comment_text": "Baia Cannone is a cool swimming spot in Portofino!"}, {"username": "Francesca Giovanelli", "comment_text": "Como Lake coast is 140 km long, there are hundreds of beaches. You have to look for one close your accommodation"}]}, {"id": "2211336995932045", "text": "Is Italy a good time to visit in the end of January?", "link": "facebook.com/groups/1373361046396315/permalink/2211336995932045/", "likes": 12, "comments": [{"username": "Heath Conn", "comment_text": "Yes but Rome and south of Rome would probably be warmer. Only bad month is August."}, {"username": "Dalia Abrahami", "comment_text": "Cold"}, {"username": "Mohammad Farooq Omerzada", "comment_text": "No because it’s cold"}, {"username": "Phyllis Flowers", "comment_text": "January is not the best month for Rome, Florence, Venice it will be cold but some people don’t mind the cold. Sometimes it’s rainy and that isn’t fun."}, {"username": "H Raymond Fasano", "comment_text": "There’s never a bad time to go to Italy. If you are free to go then go."}, {"username": "Ann Ferro Murray", "comment_text": "September. Vacationers leave. Weather is perfect"}, {"username": "Jenn Smith", "comment_text": "We absolutely LOVED Italy in December and January! I prefer the winter over the heat of the summer."}, {"username": "Graham Sherlock", "comment_text": "Great time, much better than the heat"}, {"username": "Larry Basirico", "comment_text": "Pros and cons of each season. Go when you can."}, {"username": "Mitch Barker", "comment_text": "Mitch Barker"}, {"username": "Stevie Boombatz", "comment_text": "Yes because it will not be mobbed like in the summer"}, {"username": "Wolfgang Nitsch", "comment_text": "Sure if you like snow"}, {"username": "Charles Jones", "comment_text": "Anytime!"}, {"username": "S Christian Everett", "comment_text": "All about perspective\n\nIs that the best time for you to go ?\n\nIf so I’d stick to Florence / Rome and south from\nThere.\n\nTake note some smaller touristy towns like Positano , most hotels, restaurants, shopping is closed that time of year\n\nGoing to Italy is ALWAYS A GREAT IDEA 💡"}, {"username": "Al-Amin Sharif", "comment_text": "Very cold 🥶"}, {"username": "Mari Falcone", "comment_text": "I love Italy in January. If you're going right after New Year's the sales are amazing. If you're going for weather then no but if you want to experience Italy with less tourists I'd say go for it."}, {"username": "Mitch R Juan-Lim", "comment_text": "How about mid May? I’ve been there a long time ago and don’t remember how the wether was"}, {"username": "John Todarello", "comment_text": "Only if you like to freeze"}, {"username": "Nicole Condemi", "comment_text": "In the north, last time we were there we were nearly snowed in ❄️ Christmas stalls are super magical though"}, {"username": "Sara Bee", "comment_text": "As an Italian who lives overseas, January and February are my least favourite months to visit. Days are short, cold, Christmas atmosphere is over…just not my favourite."}, {"username": "Martin Corona", "comment_text": "I’d wait until at least end of march and beginning of April. Prices are cheaper and weather is okay"}, {"username": "Doredi Beltrame", "comment_text": "Anytime is good. I’m from Canada and it’s always warmer in Italy North or South than in Canada"}, {"username": "Marscha Fransisca Debora Basdew", "comment_text": "Yes, the weather can be great. Not hot and if you are lucky no rain"}, {"username": "Fabrizio Benedetti", "comment_text": "Yes , in Rome the winther time is beautiful not very cold"}, {"username": "Rhonda Hope", "comment_text": "Yes"}, {"username": "David Passalacqua", "comment_text": "If you like skiing in the Italian alps."}, {"username": "Nancy Kirby", "comment_text": "Empty which is great, but cold"}, {"username": "Christian Capitaine", "comment_text": "Our family has made several trips over the Christmas holidays and into early January. Christmas in Italy is simply magical. Early January is very enjoyable and, additionally, the benefit of a lack of overwhelming crowds of tourists is not to be overlooked. Another benefit is more affordable prices for hotels and air travel. Finally, most stores have massive sales after the first week in January. We have also been to Italy in the summer months and in March. If you are not comfortable with cooler temperatures, go in March or October and you can still somewhat avoid the massive crowds. I hope that helps. I echo the sentiment from other folks: it is never a bad time to go to Italy."}, {"username": "Princess Queen", "comment_text": "Yes but rainy"}, {"username": "Noel Mikhail", "comment_text": "Cold and snow!"}, {"username": "Carol Newman", "comment_text": "I'd say no very cold."}, {"username": "Anita Lawrence Mundy", "comment_text": "Yes if you like snow"}, {"username": "Sudip Datta", "comment_text": "Too cold. But if you enjoy cold Breeze yesss...."}, {"username": "Lilia Sáenz", "comment_text": "What about the 1st week of October?"}, {"username": "Martin Totta", "comment_text": "It depends .. if you think to found warm and a lot of sun is not sure you will found it 😉 maybe if you want to visit Sicily you can found good weather but not sure"}, {"username": "Agneta Danielsson", "comment_text": "Always 🇮🇹"}, {"username": "John Bruckman", "comment_text": "It’s always a good time to visit Italy…"}, {"username": "Anthony Martini Jr.", "comment_text": "No"}, {"username": "Gary W Anderson", "comment_text": "Italy is always a good idea but watch the weather and avoid prime seasons because of crowds."}, {"username": "Iwona Dygas", "comment_text": "Yes, for skiing"}, {"username": "Jay Cabrera", "comment_text": "It’s always a good time to visit Italy. I was in Rome and Venice this past January and it was cold but a great time was still had!"}, {"username": "Daniele Morani", "comment_text": "Italy stretches for 1300 km, from the Alps to the Mediterranean Sea. Where are you planning to stay? January is great if you wanna go skiing."}, {"username": "Albert Campagna", "comment_text": "Cold"}, {"username": "Fabio Clemente", "comment_text": "It is cold but still nice"}, {"username": "Craig Scott", "comment_text": "When’t to Rome in January was lovely only rained once 👍"}, {"username": "Ken Vecchia", "comment_text": "Huh? Beautiful place anytime of the year. Dress accordingly"}, {"username": "Sandy Tadken Shaffer", "comment_text": "Awesome"}, {"username": "Israa Abodoma", "comment_text": "Too cold at the time."}, {"username": "Gemma DeVoldre", "comment_text": "Cold"}, {"username": "Annette Giovia", "comment_text": "The best time to go to Italy is anytime you can get there. Check on Google to see what the temps will be there. If it's cold, bring a coat!! BUT GO!!!! (25-45° in the north. 40-55° central. 50-60° in the south)"}, {"username": "Claudio Blizzard Indastria", "comment_text": "Probably worst time of the year. It might be a great experience anyway"}, {"username": "Paolina Lamb", "comment_text": "Any time. Every time! ❤"}, {"username": "Ginger Smith Simpson", "comment_text": "Late February in Rome was perfect"}, {"username": "Sandy Connell", "comment_text": "I went to Rome on the 3rd Jan and it was 24c so yes 👍🏼"}, {"username": "Tricia Bean Scott", "comment_text": "Tricia Bean Scott"}, {"username": "Mark Held", "comment_text": "Any time of the year is great to visit Italy. There are not as many of those pesky tourists in the winter too😎"}]}, {"id": "2211341452598266", "text": "Venice! there is something different about this city 💜\n#venice #italy", "link": "facebook.com/groups/1373361046396315/permalink/2211341452598266/", "likes": 227, "comments": [{"username": "Peggy Fisher", "comment_text": "Captivating <3"}, {"username": "Marcus Hiesler", "comment_text": "Haha yes, no roads"}, {"username": "Enolita Castillo", "comment_text": "Venice: one of my favorite cities in the world!"}, {"username": "Romeo Bruni", "comment_text": "Yeah it’s sinking"}, {"username": "Michaela Hlaváčková", "comment_text": "Very nice photos!"}, {"username": "Sandra Chambers", "comment_text": "It’s enchanting 🏰"}, {"username": "Toni Marie", "comment_text": "Fav city"}, {"username": "Linda Poole", "comment_text": "Venice is magnificent!"}, {"username": "Heidi Shaffer Montecino", "comment_text": "It’s so magical!"}, {"username": "Lashawn Bennett", "comment_text": "I love it!!! I was there last month"}, {"username": "Kamala Moodley", "comment_text": "Absolutely gorgeous!"}, {"username": "Gail Grande", "comment_text": "It’s magical"}, {"username": "Vickie Piacentini", "comment_text": "Loved Venice!"}, {"username": "Gail Grande", "comment_text": "Such a magical place! Loves strolling the streets"}, {"username": "Delores Filleti-Nemet", "comment_text": "I'm coming back Venice this time for a week minimum"}, {"username": "Paweł Falkowski", "comment_text": "May'22 👌🇮🇹🇵🇱"}, {"username": "Liliana Bristman", "comment_text": "Absolutely gorgeous!!!Any recommendations\nfor restaurant and things to do?"}]}, {"id": "2211355652596846", "text": "I am planning to spend two days in amalfi beach , should I go to positano or amalfi\n\nI am looking for a nice beaches ( affordable) , nice downtown and good nightlife", "link": "facebook.com/groups/1373361046396315/permalink/2211355652596846/", "likes": 2, "comments": [{"username": "JoAnn Bobier", "comment_text": "Maiori has the largest beach on the Amalfi coast very nice and not as crowded"}]}, {"id": "2211358052596606", "text": "First trip to Italy, rent a car? or travel by train? Milan-Venice Bologna-Florence-Rome.", "link": "facebook.com/groups/1373361046396315/permalink/2211358052596606/", "likes": 3, "comments": [{"username": "Christine Golia Brigida", "comment_text": "Train is very easy"}, {"username": "Pao Magnoler", "comment_text": "Train."}, {"username": "Leslie Goodland", "comment_text": "Definitely train. Less stress and headaches."}, {"username": "Jason Hobel", "comment_text": "The train systems in Italy are very user-friendly. And it would be much cheaper in the long run too...and no traffic to deal with."}, {"username": "Jan Andrews", "comment_text": "Train"}, {"username": "Kejdi Okej", "comment_text": "Train is vere easy"}, {"username": "Ronna Helfand", "comment_text": "Train. Much easier especially if you not familiar with the roads."}, {"username": "Kirsty Gardiner", "comment_text": "Train"}, {"username": "Renae Larcus", "comment_text": "Train. Easy between those major cities."}, {"username": "Lori Wroblewski", "comment_text": "Train"}, {"username": "Greg Fetro", "comment_text": "TRAIN👍🤌"}, {"username": "Francisca Lis", "comment_text": "Train"}, {"username": "Rebecca Yeoh", "comment_text": "Train. The high speed trains are amazing. Book in advance and choose your seats. Recommend Trenitalia."}]}, {"id": "2211355932596818", "text": "My husband and sister and I, are traveling to Europe next week. We start in Ireland, but will fly to Florence and plan on driving down and through Italy to Rome for a cruise. We will have about 15-20 days. We are a little nervous about driving, but know that is the best way to see as much of Italy as we can.\nWhat are the must sees and great places to go and stay? Your input in greatly appreciated.", "link": "facebook.com/groups/1373361046396315/permalink/2211355932596818/", "likes": 6, "comments": [{"username": "Julia Salmon", "comment_text": "If you don’t want to drive it’s super easy to take the train to different cities!"}, {"username": "Leslie Goodland", "comment_text": "According to the many posts I've read, driving in Italy is not recommended for tourists. Issues with parking, or not being able to drive at all in some cities. If you do, you'll need to know enough Italian to read road signs, have an international driver's license and be able to drive a stick shift.\nThe train system in Italy is wonderful and easy. If you want to get to places that aren't accessible by rail, hire a driver. The front desk at your hotel can help with that."}, {"username": "Kathy Tully Sexton", "comment_text": "We drove several times. Apple Maps is better than google as it alerts you to speed cameras. Pay attention to the ZTLs and their operating times. Make sure you have cash ready on the toll roads as sometimes you get a ticket and pay at the exit and sometimes you just pay at the toll. The sign with the ticket in the hand means that there is an attendant, if there is no hand it’s just a machine and often difficult. We much prefer the attendant. Some rental cars allow you to go thru the reader and send a bill but there are fees involved. If you drive a stick the rental will be cheaper. Many cars are diesel. Ask before you leave what gas. Ours had some mystery blue cap next to the diesel that confused even the gas attendants. Turns out it’s some fuel additive you must buy inside a store. Have offline maps as a backup if you lose cell service. (Screenshot the steps when you do have good service). Each car had a different size charger plug. The new Audi we rented only had usbc chargers and the flat magnetic charger that overheated our phones. We loved driving and stopping to see things. Driving into the walled cities was quite an adventure. Have fun!"}, {"username": "Lucrezia Folger", "comment_text": "Since you're driving, where is it you want to see, cities, coast, country..... ? What are your ideas?"}, {"username": "Tina Norris", "comment_text": "Sounds like a great holiday. Enjoy it"}, {"username": "Kejdi Okej", "comment_text": "Soinds like a great holiday enjoy it"}, {"username": "Starla Dawn", "comment_text": "Sorrento"}, {"username": "Nancy Koehler Barboni", "comment_text": "The only place I would travel by car in Italy is through Tuscany. Even when you arrive to a small town or city, it’s almost impossible to find parking and it can be a nightmare. The trains are very good in Italy and that’s the way I would go."}, {"username": "Paul Anderson", "comment_text": "About 50 km due north of Rome is a litttown called sultry. It this town is the first Roman amphitheater ever built. It is cut into the rock instead of being built on flat ground. The are also many Etruscan burial sites surrounding it. Almost no tourists ever visit the site so most likely you will be alone there. If it is closed you can walk up the hill around back and get a free over view of the whole thing. I believe it is on state route 2"}, {"username": "Jenny RV", "comment_text": "From an Irish person who loves Italy, I hope that ye have a wonderful trip. If you get a chance in Tuscany to visit Lucca you really should."}, {"username": "Chiara Normanno", "comment_text": "With a car, the sky is the limit. I could recommend Piedmont for amazing sceneries as well as Tuscany and the whole central/\nAdriatic Italy, but there's Sicily, Apulia, Sardina for access to remote and heavenly beaches... My two cents? Get a guide and let the pictures guide you through your itinerary."}, {"username": "Fetchin Gretchen", "comment_text": "I asked Google for a suggested route and while I think this is pretty ambitious and you may want to pare it and stay longer in some places, I think it is not bad. Don't get the car until after Florence. A car in the big cities can be a nightmare. So maybe get rid of in Rome?\nHere is a possible itinerary for your 15-20 day trip to Italy, starting in Florence and ending in Rome:\n\n* Day 1: Arrive in Florence and check into your hotel. Spend the afternoon exploring the city center, including the Piazza del Duomo, the Uffizi Gallery, and the Ponte Vecchio.\n[Image of Florence Piazza del Duomo]\n[Image of Florence Uffizi Gallery]\n[Image of Florence Ponte Vecchio]\n* Day 2: Take a day trip to Siena, a beautiful medieval town in Tuscany. Climb the steps to the top of the Piazza del Campo for stunning views of the city.\n[Image of Siena Piazza del Campo]\n* Day 3: Drive to the Cinque Terre, a group of five villages perched on the cliffs along the Italian Riviera. Hike between the villages, go swimming in the Mediterranean Sea, and enjoy the stunning views.\n[Image of Cinque Terre villages]\n[Image of Cinque Terre hiking]\n[Image of Cinque Terre swimming]\n* Day 4: Drive to Pisa, home of the Leaning Tower. Spend a few hours exploring the city and climbing the tower.\n[Image of Pisa Leaning Tower]\n* Day 5+: Drive to Lake Como, a beautiful lake in northern Italy. Spend a few days relaxing by the lake, swimming, and hiking in the mountains.\n[Image of Lake Como Italy]. Varenna, Bellagio are fun places to see here.\n* Day 6: Drive to Verona, a city in northeastern Italy famous for its Roman amphitheater and Juliet's balcony.\n[Image of Verona amphitheater]\n[Image of Verona Juliet's balcony]\n* Day 7: Drive to Venice, a city built on canals. Take a gondola ride, explore the Piazza San Marco, and get lost in the maze of narrow streets.\n[Image of Venice gondola ride]\n[Image of Venice Piazza San Marco]\n[Image of Venice narrow streets]\n* Day 8: Take a day trip to the Dolomites, a mountain range in northeastern Italy. Go hiking, biking, or skiing in the mountains.\n[Image of Dolomites mountains]\n* Day 9: Drive to Rome, the capital of Italy. Spend a few days exploring the city's ancient ruins, including the Colosseum, the Roman Forum, and the Pantheon.\n[Image of Rome Colosseum]\n[Image of Rome Roman Forum]\n[Image of Rome Pantheon]\n* Day 10: Take a cooking class in Rome and learn how to make traditional Italian dishes.\n* Day 11: Enjoy a leisurely breakfast at your hotel before boarding your cruise.\n\nThis is just a suggestion, of course, and you can adjust the itinerary to fit your interests and time constraints. If you are nervous about driving in Italy, you can always take trains or buses between destinations. However, driving will give you the most flexibility and allow you to see more of the country.\n\nHere are some tips for driving in Italy:\n\n* Be prepared for narrow roads and hairpin turns.\n* Drive slowly and obey the speed limit.\n* Be aware of pedestrians and cyclists.\n* Use your turn signals and don't be afraid to honk your horn.\n* If you get lost, ask for directions at a gas station or tourist information office.\n\nI hope this helps!"}, {"username": "Suzanne Mills", "comment_text": "Train"}, {"username": "Georgeann Farinacci Greene", "comment_text": "Having a car and driving is awesome. Just remember, some places they drive crazy wild!!"}, {"username": "Rose Turdo", "comment_text": "Spiaggia di Vignanotica\nBolsena\nAlberobello"}, {"username": "Jennifer McDonnell", "comment_text": "No advice about Italy - the driving experience in the US is too different but I would just take it slow and try to laugh off the panic attacks 😂. Just came on to say welcome to Ireland and I hope you have a blast. Weather here is cool and a bit wet but that just makes it greener."}, {"username": "Laura Uribe", "comment_text": "Check out Montelpuciano, Siena, Orvieto, Assisi, Citta de Bagnoregio and Sam Gimignano. All amazing places!"}, {"username": "Michele Maurice", "comment_text": "Im going on a cruise in Italy. I believe the city im leaving out of cars ard not allowed anywhere near from what I've seen and read and watched on you tube. That makes me think some places are like our New York and Boston and cars beware. Check if you can see these places by car first"}, {"username": "Debra Quinney", "comment_text": "You will be fine driving we have done it before and will be there again In September just remember to really concentrate when you first pick the car up and don’t get intimidated by the Italian drivers as they can be quite aggressive drivers"}]}, {"id": "2211359915929753", "text": "Looking for recommendations for the best hotel in the Lake Como area. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2211359915929753/", "likes": 6, "comments": [{"username": "Lauren Smigielski", "comment_text": "We stayed at the hotel Barchetta in Como and loved it! Had a beautiful view of the lake, great location for getting around the town & had free breakfast every morning"}, {"username": "Mat PO", "comment_text": "Il Sereno, Mandarim Oriental and Passalacqua."}, {"username": "Renae Larcus", "comment_text": "Varenna. Albergo Milano! Right on the water and the dining and breakfasts are excellent."}, {"username": "Sandra Manafort", "comment_text": "Mandarin Oriental in Blevio. Villa serbelloni in bellagio."}, {"username": "Beth Spiehler Selvia", "comment_text": "We stayed in Hotel Villa Marie in Tremezzo."}, {"username": "Penny Bellofatto Westberry", "comment_text": "Grand Hotel Tremezzo"}, {"username": "JA Gna", "comment_text": "We stayed in Como last june but if I can do a do over i would definitely stay in Bellagio instead."}, {"username": "Amber Butler", "comment_text": "Following"}, {"username": "Nadia Foglia", "comment_text": "Hotel Miralago in Cernobbio"}, {"username": "Francesca Giovanelli", "comment_text": "Depends on your budget. You can spend from 100€ per night to 1000€ per night or more. Second, if you travel without car you have to consider that many hotels are outside of the center of places. Lake Como is a big area with few cities and hundreds of small villages"}, {"username": "Andrea Bainbridge", "comment_text": "Hotel Florence in Bellagio ! Fantastic"}, {"username": "David Gotlieb", "comment_text": "Grand hotel menaggio was great"}, {"username": "Nancy Moore", "comment_text": "Hilton!!!!"}, {"username": "Roe Gallo Saks", "comment_text": "Gran Hotel Tremezzo. Beautiful! Probably one of the most romantic as well!"}, {"username": "Andrea Stabs", "comment_text": "In Bellagio hotel Belvedere 💯"}, {"username": "Phyllis Cawthorne Miller", "comment_text": "Stayed this past April in Hotel Bellagio. Great location. Paid a little more for the lake view and it was worth it. Breakfast included was excellent with a personal cappuccino each morning!"}, {"username": "Elnara Mektiev", "comment_text": "Following"}, {"username": "Victoria Benham", "comment_text": "https://\nwww.passalacqua.\nit/en/\n\nGrand Hotel Tremezzo newest sister property"}, {"username": "Jamie A White", "comment_text": "Grand Hotel Cadenabbia was v nice."}, {"username": "David Perillo", "comment_text": "Villa d’Este if you want the very best"}]}, {"id": "2211369875928757", "text": "Taxi from the airport to the hotel. Anything? Anyone on here that can reccomend? For 3 adults and a child. TIA", "link": "facebook.com/groups/1373361046396315/permalink/2211369875928757/", "likes": 0, "comments": [{"username": "Allison Carlisle Young", "comment_text": "In Rome we used limousinrome.co\nm for family of 5"}, {"username": "Darcy Jessen", "comment_text": "In Rome we used Movin Rome. Great service"}]}, {"id": "2211389769260101", "text": "Staying in milan in October are summer clothes still okay or autumn needed", "link": "facebook.com/groups/1373361046396315/permalink/2211389769260101/", "likes": 10, "comments": [{"username": "Paul Distefano", "comment_text": "Was there last october and it was nice"}, {"username": "Colleen Dawson", "comment_text": "It will be comfortable, but Italians dress for the seasons, so you might see some light coats and scarfs."}, {"username": "Ruth Micallef", "comment_text": "Check closer to date its too early"}, {"username": "Gayl Pizzano Hurley", "comment_text": "Check out 10 outlook prior.. climate change is in full force , and one may never know"}, {"username": "Dawn Falsinotti", "comment_text": "Both."}, {"username": "Lucrezia Folger", "comment_text": "Never know. Google says: October Weather in Milan Italy\nDaily high temperatures decrease by 12°F, from 71°F to 58°F, rarely falling below 51°F or exceeding 78°F.\n\nDaily low temperatures decrease by 10°F, from 55°F to 46°F, rarely falling below 37°F or exceeding 62°F."}, {"username": "Holly Clifton", "comment_text": "Layers!"}, {"username": "Suzanne Mills", "comment_text": "Layer and expect rain."}, {"username": "Brenno Bianchi", "comment_text": "Last year October in Milan was very warm; two years ago the opposite, cold and rainy"}, {"username": "Sue Allanby", "comment_text": "You are in Milano - the fashion capital of Italy (and one of the best in the whole of Europe) 🇮🇹 don’t worry about it!! 🫣😉😂"}, {"username": "Tara Crumlish", "comment_text": "I would recommend more lighter fall clothes especially if you are going in mid to late October. September is usually very warm still but once October hits it can get more fall temperatures. Also, depends on how cold you get, too! Night time will definitely be chilly in the 50s."}, {"username": "Karen Catania", "comment_text": "It was nice in November with a jeans and a T-shirt. Ideally you check the forecast 5 days before you leave."}, {"username": "Karen Blackmore", "comment_text": "Layers! We were in there in July, scorching one day, torrential rain the next! Be prepared, and if caught out, go shopping!"}, {"username": "Janet Messanelli Bozzone", "comment_text": "Layers."}, {"username": "Mona Sidhu Samrari", "comment_text": "Take both. Summer types n fall clothes Maroon brown dark clothes rust color. It’s so pretty 😍"}, {"username": "Mona Sidhu Samrari", "comment_text": "Milan is city of fashion !"}, {"username": "Nancy Lewis", "comment_text": "Layers"}, {"username": "Jolie Carbone", "comment_text": "October is usually mild but Milan can get rainy and humid during fall, bring something for the rain. Also don’t worry too much about the “fashion capital” people from Milan really don’t care what you dress like. If you need to see a lot of stuff and walk around, prioritize comfort"}, {"username": "Laura Uribe", "comment_text": "The evenings can be cooler. Especially if it’s been overcast or rainy. Otherwise pretty warm still."}]}, {"id": "2211388045926940", "text": "Hi all\nI’ll be going to Venice early September - any recommendation good restaurants? And what places are best to see? Thanks!!", "link": "facebook.com/groups/1373361046396315/permalink/2211388045926940/", "likes": 1, "comments": [{"username": "Edoardo Casolo", "comment_text": "Good restaurants are pontini, da marisa, agli arboreti, alla Maddalena ( this last one is in mazzorbo)"}, {"username": "Rosa Zordan", "comment_text": "Everywhere and anywhere"}]}, {"id": "2211298002602611", "text": "Caio. If you’re looking to head a bit north I can highly recommend Lago Maggiore. So much to see or do. It’s subjective but I’ve enjoyed it more than Como. My favorite spots to visit are the 3 Borromean Islandsआणखी via ferry (~ 30euro for a round trip ticket from Leveno. Or you can depart from Stresa which is prob cheaper). I’m not sure about travel to Stresa but the train lines ends in Laveno. You take the car ferry across to Intra and from there a smaller ferry zips you around the islands. If you can only do two islands I’d recommend Isola Superiore and Isola Bella. You can also take a ferry to Santa Caterina del Sasso. A monostary and church built into the side of the cliff. It’s spectacular.\nI find the ferries here easier. And the trips are shorter.\nLaveno has a funivia. It’s only abt a 5-10 min walk from the ferry and cost 12 euro round trip. The ride itself one way is abt 20 minutes. There are restaurants and hiking trails at the top.", "link": "facebook.com/groups/1373361046396315/permalink/2211298002602611/", "likes": 14, "comments": [{"username": "Vinayini Murty", "comment_text": "Gorgeous photos!"}, {"username": "Marcia Stokes Clement", "comment_text": "Stayed there in 2008, just loved it!"}]}, {"id": "2211393425926402", "text": "Hello ,\nI hope if anyone used trentio card can confirm if the condition to take it from the hotel is staying at least 2 nights and how to know the eligible public transport and how to use it ,tried to search but couldn't find enough info\n\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2211393425926402/", "likes": 0, "comments": []}, {"id": "2211401575925587", "text": "Is there a big difference btwn trentalia and italo as far as their buisness or 1st class? Appreciate anyone that has experience with either class on either company. Would prefer best experience possible, preferably one with 🍷🍾 as an option lol\n\nBack story, we will be going from Venice to Milan to start a long journey home....I made a mini vaca outआणखी of the plane ride🙃\nI wanted the best flight product and flying Qatar business in their Q suites was a bucket list for me so we are going wayyyy out of the way to go home. I was able to score award seats and pay for the flight with points. Direct trip home would have been Venice to Boston but to fly in Q suites, we are taking\nTrain from Venice to Milan on Sat\nFlying out of Milan to Doha: 5 hr flight\nOvernight in their business class lounge\nFlying Doha to Boston in Q suites on Sunday: 15 hr flight\nOriginally wanted to fly Emirates but their award tickets were very high points wise and I went on as soon as space opened, plus they swapped out the A380 for the 777 on the Milan to JFK route 👎", "link": "facebook.com/groups/1373361046396315/permalink/2211401575925587/", "likes": 2, "comments": [{"username": "Brian Marcus", "comment_text": "You should be in Travel Miles 101 group!!"}, {"username": "Shannon Madison", "comment_text": "I think Italo is much nicer - it’s privately owned."}, {"username": "Louis Des Forges", "comment_text": "There isn't a big difference between 1st and 2nd class. Just more room, a cup of coffee and a small snack. You certainly don't get free alcohol. Most people who use 1st class are business people as its usually quieter and more conducive for working."}, {"username": "Brenno Bianchi", "comment_text": "The best one is the executive class of Trenitalia, there is free food and open bar"}, {"username": "Kejdi Okej", "comment_text": "Doesn t necessarly need to doesn t free , just avalilabe"}, {"username": "Rhona OConnor", "comment_text": "The difference between 1st and 2nd class on the trains is a bot the same as in most countries. In Italy\n🔹Seat formation is 2+1 so more room\n🔹Space for luggage between seats\n🔹Slightly cooler\n🔹Slightly less people\n🔹More italian v tourists\n🔹Some give a light snack served in a paper bag.\nDon't expect Emerates level of service!! 😁"}, {"username": "Bea Kuckens", "comment_text": "https://\nwww.seat61.com/"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 8, "comments": []}, {"id": "2211404065925338", "text": "Just returned to Australia from 3 weeks in Italy. Had only one small issue. Cross body bags worn all\nthe time and no problems\nWith pick pocketing. Just a warning re taxis at train station or airport. Don’t agree to a taxi if a taxi driver approaches you as they charge an outrageous fee upon arrival at your destination. Join the line at the rank and take a regular taxi. We did get caught and our hotel told us the scam.\nApart from that it was all wonderful!", "link": "facebook.com/groups/1373361046396315/permalink/2211404065925338/", "likes": 75, "comments": [{"username": "Joanne-Peter Hart", "comment_text": "Best tip is to pre book the taxi through an ap like Uber. Prepaid so no scams, cash or detours."}, {"username": "Brian Osman", "comment_text": "I always used official taxi's"}, {"username": "Frank Hunt", "comment_text": "Yes, in fact never interact with anyone who approaches you anywhere in another Country, so many con artist and scammers everywhere. Best to walk past and ignore."}, {"username": "Beth Stewart", "comment_text": "That’s a con I have heard of in larger cities in Canada, as well"}, {"username": "Angela Elsley", "comment_text": "How did you go with jet lag?"}, {"username": "Julie Norris", "comment_text": "I remember arriving in Rome from Sydney and this absolutely drop dead gorgeous man approached me and asked if I wanted a taxi. I knew the scam but wow 😊 I catch the shuttle bus now. Easier for me and fits my budget with the AUD so low"}, {"username": "Jenny Payne", "comment_text": "And at train stations if your not happy with the first price , go to the next in line until it is a reasonable price🌻"}, {"username": "Francesca Giovanelli", "comment_text": "There are many illegal taxi around, don’t pay in cash and look for a license number or a shield on the car. Especially for your safety, illegals can be without insurance and not tested for alcohol and drugs . And they don’t pay taxes"}, {"username": "Maureen Strazzari", "comment_text": "Thanks. Good to know."}, {"username": "Vero Charles", "comment_text": "I love this place"}, {"username": "Tracy Glasgow", "comment_text": "I used a taxi from a taxi rank in Rome and still got ripped off with outrageous fee and didn’t even get dropped at our hotel. Dumped us on one side of Novona square and told us to find our way from there. Used Uber Black after that and had no problems."}]}, {"id": "2211408565924888", "text": "What to do only a day in each (Rome, Postino, Civitavecchia, Messina) suggestions welcome", "link": "facebook.com/groups/1373361046396315/permalink/2211408565924888/", "likes": 0, "comments": []}, {"id": "2211407865924958", "text": "Currently in Rome. What is your favorite restaurant in Trastevere for dinner?", "link": "facebook.com/groups/1373361046396315/permalink/2211407865924958/", "likes": 40, "comments": [{"username": "Jennifer Brothers", "comment_text": "Michele Grilliot Parsons"}, {"username": "Al Benelli", "comment_text": "Della Fratte"}, {"username": "Robert Fonte", "comment_text": "Angelina in testaccio\nBetter area for restaurants"}, {"username": "Tina Briguglio", "comment_text": "Vicki Misurelli we will have to go to some of these"}, {"username": "Ted Jörgner", "comment_text": "Same question but also that has a good winelist with decent prices?"}, {"username": "Nicole Condemi", "comment_text": "This isn’t a restaurant, but there are bars/\nrestaurants down on the river. Market stalls too. Really nice for a drink or a stroll."}, {"username": "Maria Vamva", "comment_text": "Nannarela is really good"}, {"username": "Francesca Campetta", "comment_text": "Da Enzo al 29\nTrattoria da Sora Lella\nPopi Popi\nOtello"}, {"username": "Bob McCann", "comment_text": "Sabatini was very good.. on the square in Trastevere"}, {"username": "Kevin Mumma", "comment_text": "This place\n\nMeridionale Restaurant\n+39 06 589 7196 https://g.co/\nkgs/aTaMGX"}, {"username": "Jerry Reyes", "comment_text": "I have 2 tickets for the Palio in Siena on Aug 16. The package comes with a dinner the night before in a contrada. We had to cancel our trip to Italy due to a family medical issue. If anyone is Interested in the tickets, please contact me."}, {"username": "Ted Cabot", "comment_text": "One of the best pizzerias in the world in that neighborhood Seu Pizza Illuminati"}, {"username": "Debbie Salmon", "comment_text": "Otello. Discovered it on our last night in Rome."}, {"username": "Sally Sharkey", "comment_text": "Il veto Alfredo was excellent. Make reservations on line."}, {"username": "Bronwen Jones", "comment_text": "Ombré Rosse is up in the park above Trastevere. Nice atmosphere and not expensive."}, {"username": "Nancy McBride", "comment_text": "Trattoria da Augusto!"}, {"username": "Anne Davidson", "comment_text": "Find a hole in the wall that looks good. Check out the patrons. Its hard to have a bad meal. The only bad meal i had there was an old Rick Steves recommendation which was awful."}, {"username": "Marlene Sanz-Rodriguez", "comment_text": "Il Matto need reservation"}, {"username": "Lesley Richardson", "comment_text": "Lots the method should look at the menu and if it’s in Italian you’ve picked a good one! Next best is in Italian and English. Don’t go to one’s with English and photos of the food 🤔 tip from a friend who went on food tour 🇮🇹"}, {"username": "Rachel Milstein", "comment_text": "Il Duca.\nIt was AMAZING and recommended by a local!"}, {"username": "Gurleen Gill", "comment_text": "f"}, {"username": "Silvia Fioranelli", "comment_text": "Tonnarello"}, {"username": "Vicki Lyn", "comment_text": "Following"}, {"username": "Monica Rameriz", "comment_text": "Mimi & Coco's"}, {"username": "Kevin P. Wrenn", "comment_text": "La Taverna Dei Fori Imperial.....Ne\ned to make a reservation in advance if you want to eat before 9pm!!"}, {"username": "Steph Bozek", "comment_text": "Mario V A Bozek"}, {"username": "Ken Polonsky", "comment_text": "All of them!!"}, {"username": "Stefania Tutino-Eslow", "comment_text": "Da Enzo"}, {"username": "Yvonne Ormson", "comment_text": "So many great choices in Trastevere area ❤️"}, {"username": "Libby Bownas", "comment_text": "Il Duca was great. Plus no queues."}, {"username": "Lauren Velleno", "comment_text": "Pasta e Vino"}, {"username": "Adriana Di Marco", "comment_text": "Bottega Ciccone was incredible!"}, {"username": "Anika Lenzen", "comment_text": "Nanarella 😍"}, {"username": "Marty Harte", "comment_text": "Don’t be scared of the lines they move very quick."}, {"username": "Gianna Verrecchio", "comment_text": "Taverns trilussa!!"}, {"username": "Eden Seery Thornton", "comment_text": "We ended up at Il Buco tonight. All Italians besides us and one other table. The overall experience was wonderful and the food was okay. May try Enzo tomorrow night, then it’s off to Florence!"}, {"username": "Dawn Handrahan-Lauchlan", "comment_text": "RIONE XIII"}, {"username": "Laura D. Anderson", "comment_text": "Spirito di Vino"}, {"username": "Richard Aird", "comment_text": "Tonnarello"}, {"username": "Kristi Entwistle", "comment_text": "Tonnarella & Nannerella have the same menu— just FYI. It’s good, but you don’t need to hit both places! Da Enzo line was down the block! Go early or be ready to wait in line!!"}, {"username": "David Sapienza", "comment_text": "Otello."}, {"username": "Rocio Isasi Cortazar", "comment_text": "Tonarello"}, {"username": "Gina Schatz Chamberlain", "comment_text": "I feel like you would have to try real hard to find one that is not good. But of course those with the lines are typically tried and true."}, {"username": "John Pallone", "comment_text": "Duca"}, {"username": "Patrick Vega", "comment_text": "Tonnarello 💯"}, {"username": "Eileen Serfilippi Maringo", "comment_text": "Peppo Al Cosimato !\nExcellent !!"}, {"username": "Michele Boubede Granito", "comment_text": "Many great places\nDidn’t have a bad meal\n\nOsteria de Fortunato - older women make the pasta by hand in the window\nIncredible meal"}, {"username": "Mike Davis", "comment_text": "Following"}, {"username": "Annette Gonzalez", "comment_text": "Tonnarello love the carbonara 😜"}, {"username": "Jeff Gentner EA", "comment_text": "Never had a bad meal in Trastevere."}, {"username": "Lynn Barnett Head", "comment_text": "Following"}, {"username": "Alisa Flores", "comment_text": "Gaylee Thompson Demlinger"}, {"username": "Marina Nagi", "comment_text": "La Canonica"}, {"username": "Maria Nestoros Coulopoulos", "comment_text": "Meridionale!!!"}, {"username": "Sandeep Cohen", "comment_text": "Da Enzo"}, {"username": "Kimberly Baer Oren", "comment_text": "So many choices in Trastavere. Great food area, but we ended up at Dar Poeta twice. Inexpensive and great pizza."}, {"username": "Vogelbrunnen Andreas", "comment_text": "Everyone we picked just walking down the street was great with good prices.\n\nWe also ate at Roscioli (unbelievable)"}, {"username": "Mark S. Keller", "comment_text": "Daroma"}, {"username": "Lori Harrison", "comment_text": "Da Enzo is excellent!!!’"}, {"username": "Carmela Garcia-Araya", "comment_text": "following"}, {"username": "Mary Melton", "comment_text": "Tonnarellos!!"}, {"username": "Stacy Prestigiacomo", "comment_text": "El faciolaro was delicious went 2x ask for Daniel show him this"}, {"username": "Courtney Soloff England", "comment_text": "Tonnarello or Enzo"}, {"username": "Lori Potter Farmer", "comment_text": "Lois Midkiff"}, {"username": "Chelsea Kennedy", "comment_text": "Amber Yorg"}, {"username": "Monica Marzari-Hailey", "comment_text": "Meo Patacca 💯 You won’t regret it!!!"}, {"username": "Tanya Pozzi", "comment_text": "TONNARELLO"}, {"username": "Leonard Mauceli", "comment_text": "Girrosto Tuscano off Via Veneto by the Old Aquaduct!!"}, {"username": "Maggie Manger", "comment_text": "Nannarella’s restaurant.\n\nhttps://\nnannarellaroma.i\nt/\n\nThe line gets long but it goes fast. So good!"}, {"username": "Bob Deahl", "comment_text": "Sabatini’s"}, {"username": "Susan Carney Ash", "comment_text": "Da Enzo"}, {"username": "Abby O'Mara", "comment_text": "Osteria il matto on via portuense. It was fabulous. Good amazing and in incredible selection of wines and Marco our waiter has amazing knowledge about food and wine. 10/10"}, {"username": "Ken Lerch", "comment_text": "Spirito DaVino"}, {"username": "Cynthia Peraza", "comment_text": "Tonnarello, yes it’s all over tik tok and instagram but it’s 100 percent worth the hype"}, {"username": "Shannon Goff Flanagan", "comment_text": "Maggie Goff Bolin"}, {"username": "Fabio Clemente", "comment_text": "Any restaurant in Trastevere is really good"}, {"username": "Kim Bernhard Mazza", "comment_text": "Da Enzo 😋"}, {"username": "Claudio Blizzard Indastria", "comment_text": "Enzo,\nimpiccetta\n\nL'Elementare for round pizza romana\nBoccaccia for pizza al taglio.\n\nTonnarello is way too Touristy and the food is just average. Anyway if you want to dine there anyway and line is too long, nannarella is practically the same restaurant under a different name."}, {"username": "Brenda Bonham Gerland", "comment_text": "Don’t recall any of the names, but everywhere we went was good! So many folks miss the Trastevere area… we stayed at a B&B there and simply loved the ambiance!"}, {"username": "Kimberly Borg", "comment_text": "Tonnarello"}, {"username": "Sarah Gaston", "comment_text": "La scala! Especially for their cacio e pepe!"}, {"username": "Alice Dzimiera", "comment_text": "Mimi e Coco"}, {"username": "Angela Harris", "comment_text": "Thank you everyone going to Rome for a week in September."}, {"username": "Diana Ferro-Rodrigues", "comment_text": "Da Enzo & Ivo a Trastevere"}, {"username": "Dominique Maillet", "comment_text": "Le Mani in Pasta"}, {"username": "Nick Triano", "comment_text": "Check out Hostaria Dar Buttero - V. della Lungaretta 156. Unassuming place with a great internal giardino and wonderful food. They’ll treat you well 🙂"}, {"username": "Fabiola Beltran", "comment_text": "Tonnarello !!!"}, {"username": "Carmen Higham", "comment_text": "Tonnarella…hand\ns down!"}, {"username": "Amy Nicewander", "comment_text": "Jaime Cotten Keyes"}, {"username": "Kori Martz", "comment_text": "BaGhetto Milky 🙌 it's so good! Try the artichokes for sure!"}, {"username": "Katie Botos", "comment_text": "Tonnarello is amazing!"}, {"username": "Andrea Brown", "comment_text": "We loved nannarella for cacio e Pepe, carbonara and amatriciana. We also tried the artichokes and calamari for appetizers."}, {"username": "David Horgen", "comment_text": "Had a fantastic meal at Enzo a few days ago. If you were staying there, Cafe 67 is a great place to get cappuccinos in the morning. Friendly couple that owns it, and they're only 1,40 each"}, {"username": "Roger Almanza", "comment_text": "Roma Sparita for the cacio e pepe in a cheese bowl 🤤"}, {"username": "Jennifer Gustafson", "comment_text": "The supplee place can’t think of the name and http://\nwww.ristorantesp\niritodivino.com\n/"}, {"username": "Yiota Mallas", "comment_text": "Da Enzo by far"}, {"username": "John Bruckman", "comment_text": "Taverna Trilussa"}, {"username": "Lindsey Dingman", "comment_text": "Facialaro"}, {"username": "Jan Armstrong", "comment_text": "Tonnarello or Emma."}, {"username": "Tracy Nadel Heffez", "comment_text": "Tonnarello. Delicious"}]}, {"id": "2211408642591547", "text": "Hello everyone,\ni am a girl travelling solo to Italy next week , i know my question may seem silly to some of you but since it’s my first time here in italy ,\ni would like to know if it’s safe in the trains for exemple ( ill be traveling between genova - sestri levante - portofino ) , are there any neighborhoods to avoid in these three places ?\nThank you in advance 🦋", "link": "facebook.com/groups/1373361046396315/permalink/2211408642591547/", "likes": 0, "comments": [{"username": "Isabelle Truong", "comment_text": "Train travel is very safe, I’m a solo traveller, I took bus, metro and train all over Italy for a month without any problem. Don’t carry too much cash or too many credit cards on you, keep your handbag across your front. Genova’s Brignole station is safer than the other station. Enjoy Italy."}]}, {"id": "2211421669256911", "text": "We are arriving in Rome and need to go to Civitavecchia for our cruise. What are my options?", "link": "facebook.com/groups/1373361046396315/permalink/2211421669256911/", "likes": 20, "comments": [{"username": "Amy Andrews", "comment_text": "We hired a car."}, {"username": "Tracey Stewart", "comment_text": "www.sharedshutt\nle.it used them last year. Pick up from your accommodation, drop off at cruise terminal - 65€ for two people. Also for pick up from terminal to the airport, very reliable."}, {"username": "Pamela Cari", "comment_text": "We went by bus from our hotel"}, {"username": "Katamaranken Eal Dl", "comment_text": "uber"}, {"username": "Sha Mohammed", "comment_text": "Limo 175uros or flat fare taxi."}, {"username": "Susan Parker Clifton", "comment_text": "Ask the cruise line for transfer, like a shuttle"}, {"username": "Wolfgang Nitsch", "comment_text": "Walking taxi or bus"}, {"username": "Helen Ladkin", "comment_text": "Private transfer"}, {"username": "Michael Barnes", "comment_text": "WelcomePickups.\ncom\nThey did several for us."}, {"username": "Cris Creamer", "comment_text": "I booked a cab. It was a mercedez benz cab which is very common there"}, {"username": "Rebecca R. Russo", "comment_text": "Train...if you are getting on EPIC.. hopefully you have the best experience ever just like we did a couple weeks ago."}, {"username": "Herminia Pv de Shahin", "comment_text": "We went by Uber.👍"}, {"username": "Helene Kalfas", "comment_text": "Cab was 150 euros"}, {"username": "Michael Messina", "comment_text": "Catch the train from platform 26or 27 regional, or trains going to Pisa or Grosseto all stop in Civitavecchia. Buses outside station will take you direct to port."}, {"username": "Urfi Omer", "comment_text": "Shuttle bus just near the railway station, 10 min drive. Drops you next to the ship."}, {"username": "Clara Balzano", "comment_text": "Private driver takes you straight to the ship, very professional"}, {"username": "Penny Cato", "comment_text": "Take a train from the airport to the port\nCivitavecchia. Nice views along the way 🇦🇺🇮🇹🥂🥂💕"}, {"username": "Francesca Greco Cavallaro", "comment_text": "Train"}, {"username": "Nancy Amato", "comment_text": "I took the train"}, {"username": "Wayne Matthews", "comment_text": "Alice Matthews"}, {"username": "Katherine Smitham", "comment_text": "There is a train that only costs 5 euros x"}, {"username": "Veronica Mendez", "comment_text": "ItTaxi"}, {"username": "Mary Kalasa", "comment_text": "I did it once. Had the hotel hire a driver for me and my friend. Was totally worth it."}, {"username": "Lena Lai", "comment_text": "Train to port, then Taxi, 8 euro per person is what we paid I think from train station"}, {"username": "Joe Pisano", "comment_text": "Plain and simple. TAXI! Peoples been thousands and thousands of dollars to fly to Italy and then take a cruise walk to save €10 by getting on a train"}, {"username": "Karen Robertson", "comment_text": "I did this last year. Pre booked a car through My Daytrip, but I understand there is a bus that is at the terminal and goes to Rome, check with your travel agent"}, {"username": "Stephen Anderson", "comment_text": "Bizarre that you have not researched that"}, {"username": "Renae Larcus", "comment_text": "We did the train"}, {"username": "Tissie McClure", "comment_text": "You can get a Viator ride!"}, {"username": "Dianne PorŦer Wilson", "comment_text": "Roberto Brunetti Tours"}, {"username": "Kristi Pitts Todd", "comment_text": "Take the train.. about an hour trip for $5.. that's what we did earlier this week"}, {"username": "Albert Campagna", "comment_text": "Train/bus/car service"}, {"username": "David Murszewski", "comment_text": "Cab ! Well worth it"}, {"username": "Andrea Corey Andrews", "comment_text": "Private transportation is good"}, {"username": "Mandy Aycock Jackson", "comment_text": "Train is the cheapest. And I'll warn you about the tunnels. I don't know why but they stopped up our ears soooo badly. It was really hard to pop them and very very uncomfortable. I noticed it didn't seem to bother locals though."}, {"username": "Gina Simonelli Sloan", "comment_text": "We hired a private car it’s a 1 1/2 hr to the port"}, {"username": "Mary Patzke", "comment_text": "Does the cruise line offer transportation?\nI find that is usually easiest. Maybe not the cheapest, but they’re responsible for you then."}, {"username": "John Bruckman", "comment_text": "Train"}, {"username": "Lisa Lucinskas Keenan", "comment_text": "We just did this. Stayed at the Hive and they had transportation for us to the Port . So check with your hotel too."}, {"username": "Norma Kalberer", "comment_text": "Take a bus."}, {"username": "Jennifer Romero", "comment_text": "We took a cab. I have driver info if you’d like"}, {"username": "Michael Spiekermann", "comment_text": "This question has been asked and answered a thousand times.\nSearch the archives or ask google.\n\nPs: cheapest option is train."}, {"username": "Michelle House Cassisa", "comment_text": "Private transportation"}, {"username": "Michael R Hebert", "comment_text": "Cruise line has all the answers."}, {"username": "Celeste Germany", "comment_text": "Train might be cheaper but you end up lifting the bags up or down stairs. It’s a killer"}, {"username": "Carra Gia Gia", "comment_text": "Me too"}, {"username": "David King", "comment_text": "Train, private car, or arrive a day early and go to Civitavecchia the night before, and have a great dinner and relax in a hotel. No stress.\n\nCheck with your cruise line for shuttles from the train station to the pier—you do not want to walk with your luggage (we did that once ,and said never again!) and taxis from the train to the pier were nonexistent (very busy)"}, {"username": "Anthony Freitas", "comment_text": "We just got back yesterday from this and we used private transportation to and train from. I should of done private for both ways"}, {"username": "Renae Larcus", "comment_text": "Take the train. We did. Easy."}, {"username": "Sylvia Kotsopoulos Vocino", "comment_text": "Train and then port has a shuttle to the ship. We did this two weeks ago."}, {"username": "Susan Argall", "comment_text": "Doesn't the cruise ship provide transportation?"}, {"username": "Carolyn Dahl", "comment_text": "I just looked that up as I have to do it in a month. You go to Termini Station, 15 euro for the 45 minute train. The docks are about a mile from the train station, we’ll either walk or Uber.\nI read the bus takes longer."}, {"username": "Cindy White Sanchez", "comment_text": "We went on a Mediterranean cruise 10 years ago and hired a car for $100 which was well worth it. He drove really fast, but we definitely got there on time. Sorry I don’t remember the name of the company.￼"}, {"username": "Lisa Martinez", "comment_text": "Private driver about 120 euros"}, {"username": "Robin Whittenburg", "comment_text": "We just did this last month. We used a private car service both ways. Trains and buses were having strikes off and on throughout the month and we didn’t want to risk it."}]}, {"id": "2210102506055494", "text": "Update: I emailed the actual website and they just got back to me. They are open at 12 on Aug 15th…\nDoes anyone know if the Pantheon is open Aug 15th. One site says no. The main site, that no one in US can getआणखी tickets on says a confusing yes and no. Tour groups on GYG and Viator are selling tickets for this date. I’m confused. Thanks in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2210102506055494/", "likes": 1, "comments": [{"username": "Agnese Arnó Ch-Ch", "comment_text": "It’s closed only 25 dicember 1 January."}, {"username": "Ant Salsa", "comment_text": "What web site are you on"}, {"username": "Margaret Fanelli-Granger", "comment_text": "August 15, is a holiday. It’s Ferraosto, the Assumption of Mary."}, {"username": "Vasthi Cheddar", "comment_text": "Try using PayPal to pay"}, {"username": "Grazia Mottinelli", "comment_text": "It' s open ( closed on Dec 25 and Jan 1)"}, {"username": "Barbara Kistler Wilhelm", "comment_text": "If you look it up says august 15 is Christian holiday and most museums closed"}, {"username": "Michele Rossman", "comment_text": "It’s closed most likely. Get your guide and viator will then cancel on you since those are third party sites that will then attempt to get tickets after you purchase."}, {"username": "Giulia Bucolo", "comment_text": "Majority of italy will be closed on the 15th! It is probably the biggest holiday all year"}, {"username": "Alexandra A Welker", "comment_text": "I think it's closed. August 15th is a holiday, with Ferragosto overlapping with the Assumption of the Virgin Mary it will most likely be closed. I found another website that says it's closed."}, {"username": "Denise Haschke Wasserman", "comment_text": "Aug 15 is the Feast of the Assumption of the Blessed Virgin Mary, a holy day for Catholics, so it is closed because of Mass that morning"}]}, {"id": "2211440362588375", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2211440362588375/", "likes": 11, "comments": [{"username": "Nicole Webb", "comment_text": "Clayton Webb"}, {"username": "Auring Fadel", "comment_text": "Hero Jaff 😆"}, {"username": "Kimberly Lampros", "comment_text": "I don't know what he's talking about. I'm much happier in Italy 😆"}]}, {"id": "2211447779254300", "text": "La Spezia🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2211447779254300/", "likes": 1, "comments": []}, {"id": "2211448729254205", "text": "Staying at the Royal suite Trinita dei Monti Rome\nAnyone stayed here ???", "link": "facebook.com/groups/1373361046396315/permalink/2211448729254205/", "likes": 0, "comments": []}, {"id": "2211453675920377", "text": "What kind of euros do I need to carry for washrooms? Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2211453675920377/", "likes": 52, "comments": [{"username": "Jennifer Gustafson", "comment_text": "Just stop at a cafe and grab an apperativo or beverage and use theirs for free."}, {"username": "Melanie Matthews Stuprich", "comment_text": "We used a couple pay bathrooms (1-2 euro) but mostly we would stop for a drink and sit down for a little bit in a cafe (we were there right when the crazy heat wave started here in Italy) and would always use the restroom there or in tourist places. It’s not like every place charges for bathroom breaks (like they used to 20 years ago). At least not in Rome and Florence this summer."}, {"username": "John Bruckman", "comment_text": "1 euro coins"}, {"username": "Colleen Dawson", "comment_text": "There’s only one kind of Euros and come in different denominations. For public washrooms you will need coins, which you can get after purchasing a n item and get change,usually €1, some places could be less or more."}, {"username": "Ryan Hayes", "comment_text": "American euros 💶"}, {"username": "Pashe Simpson", "comment_text": "You have to pay for bathrooms?"}, {"username": "Melanie Fay Wais", "comment_text": "Bring toilet paper, hand sanitizer and soap just in case."}, {"username": "Holly Clifton", "comment_text": "1 to 2 euro coins."}, {"username": "Sue Policicchio", "comment_text": "Domenic Policicchio III\nAngelo Policicchio"}, {"username": "Sandra Bongiovanni Memoli", "comment_text": "Good question. I remember being in Sienna on a tour and I had to go to the bathroom very desperately lol and you had to pay. Make sure you’re prepared 🤣🤣￼￼"}, {"username": "Gina Gallardo Tolomeo", "comment_text": "Only place I had to pay was at the train station - 1 euro and super clean! I made sure to use bathrooms in EVERY museum, restaurant, etc that we visited to avoid the public bathroom situation."}, {"username": "Angela DiGuglielmo Boor", "comment_text": ".50 in Positano - but the machine took my 1 euro coin just fine (without giving change of course)."}, {"username": "David Davey", "comment_text": "No counterfeit euro 😂😂 Get small denominations 1 or 2 euros."}, {"username": "Helen Lettieri-Haaland", "comment_text": "I was in Italy for two weeks and only paid for bathroom maybe two times"}, {"username": "Karen Blackmore", "comment_text": "At stations it was 1 euro with a person on the door. Wouldn't have mine if that meant they were spotless with loo paper, but they weren't. Not awful but expected a bit better!"}, {"username": "Gene Hamilton", "comment_text": "Most are 1 euro some 1.5 and we even saw some 2 euro"}, {"username": "Marie Cunningham", "comment_text": "They seem to take euros and credit cards. In venice. Milan."}, {"username": "Patty Crowther Pearce", "comment_text": "Usually in Italy, you don’t pay but tips are appreciated. Unless it is a pay facility. A few coins, .50 euro cents is usually sufficient."}, {"username": "Laura Torres Palomino", "comment_text": "You can use any cafe’s restroom At no charge…but it’s also polite to buy a pastry or espresso."}, {"username": "Beatriz Davalos Moreno", "comment_text": "Usually you get charged 1.50 euros to use the restroom every time"}, {"username": "Daniele Morani", "comment_text": "If there's a bar nearby, grab a coffee and ask to use the toilet. It's free."}, {"username": "Sergey Tretyakov", "comment_text": "Just don't buy 'toilet tickets' online (on the Venice website for example) - waste of money"}, {"username": "Sandra Shoffner", "comment_text": "Coins"}, {"username": "Ian Beyer", "comment_text": "The European kind."}, {"username": "Sarah Lynn", "comment_text": "Typically 1€ at train stations or businesses where you're not purchasing something else."}, {"username": "Jodie Munushian", "comment_text": "The public water closets ( as they are referred to) are 0.50 to 1.00 euro . You insert a coin. They are immaculate."}, {"username": "Ashley Martins", "comment_text": "$1 to $2 coins. Only place I paid was train station, everywhere else we went when we were dinning, buying a drink, etc."}, {"username": "Antonia Dosik", "comment_text": "IN SOME PLACES, VERY RARELY, YOU HAVE TO PAY TO USE A BATHROOM. USUALLY A EURO. VERY RARE, HOWEVER; I WOULD NOT EVEN WORRY ABOUT IT."}, {"username": "Carmen Folgueiras Weisz", "comment_text": "I only paid in public bathrooms, but everywhere else it was free. The restaurants let you use the restroom even if you’re not a patron. Believe me, I have been all over Europe and Italians are the nicest about letting you use the restrooms."}, {"username": "Bev Cutmore", "comment_text": "Not sure but carry a toilet roll with you everywhere, we found most places lacking, only downside of our smashing trip but such a small detail but important"}, {"username": "Vickie Love Hooper", "comment_text": "We encountered wash rooms that took 2 euro and others that took 1 euro.\n\nHahaha! Linda Kuper Mortensen, I had to correct my reply since I didn’t notice I had typed the same number 🤣😂🤣"}, {"username": "Andrea Corey Andrews", "comment_text": "Most are 1 euro"}, {"username": "Nicholas Nick Smith", "comment_text": "The European kind."}, {"username": "Janine Emma Lucas", "comment_text": "1-2€ we found. And rarely can you swap places with your travel companion…they are often monitored by a person"}, {"username": "Margaret Frey", "comment_text": "In the Milan train station we needed 1 Euro coin to get into the bathroom."}, {"username": "Linda Wallace Smith", "comment_text": "When possible find a bakery. Buy a couple cookies (less than a euro) and use their restroom for free!"}, {"username": "James Carr", "comment_text": ".5, 1 and 2 euro coins."}, {"username": "Charlene Noll", "comment_text": "Even the Macdonald’s in Naples charged for the toilets. Crazy"}, {"username": "Renae Larcus", "comment_text": "Usually 1Euro"}, {"username": "Jay Parekh", "comment_text": "couple of the ones we used took credit card.. tap and go."}]}, {"id": "2211454769253601", "text": "Requesting VAT Refund help please. Does anyone have thoughts on the best practices to claim VAT refund with a below itinerary:\n\nOur general itinerary is:\nUS to Italy by air\nItaly to Switzerland by train\nSwitzerland to Netherlands by train\nNetherlands to US by air\n\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2211454769253601/", "likes": 0, "comments": []}, {"id": "2211296792602732", "text": "Wondering what to do in Naples? I wanted to do the blue grotto badly but not in port long enough\n\nWe are in port from 6am to 3.30pm in September. Hubby has already done Pompeii. Thinking should I do alone\n\nThank you", "link": "facebook.com/groups/1373361046396315/permalink/2211296792602732/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nnextstop-italy.c\nom/\nvirtual-tours/\nnaples-royal-pal\nace-caserta/"}, {"username": "Edith Nagy-Villi", "comment_text": "I think that's not enough for Pompei. Visit Naples underground, eat pizza fritta from Sorbillo (provola e pomodoro is the best), have a coffee at cafe Gambrinus, visit Royal palace, eat sfogliatella at galleria Umberto I, go to christmas alley, have an Aperol spritz, there are a lot of things to see and do in Naples"}, {"username": "Glenn Todd Webb", "comment_text": "Duomo, San Martino (take funicular ), archaeology museum, hop on hop off. Stay in Naples."}, {"username": "Diane Davis Lawyer", "comment_text": "Just suggested this to someone else too! Haha! Try some of Atlas Obscura's suggestions: https://\nwww.atlasobscura\n.com/\nthings-to-do/\nnaples-italy"}, {"username": "Barbara Pasteris Allen Hettlinger", "comment_text": "Take the ferry from Naples to the island of Procida and just explore on foot. Beautiful island with gorgeous vistas. Not touristy at all. Great spots for lunch along the waterfront."}, {"username": "Valerie Collanton", "comment_text": "And get a coffee and pastry at Gran Caffe Gambrinus."}, {"username": "Ildiko Gyimesi Mikos", "comment_text": "Archaeology museum!! Sansevero Chapel is also amazing. Walk around Spanish Quarter and eat 🍕"}, {"username": "Laura Uribe", "comment_text": "We are checking this out on our visit this fall."}, {"username": "Victoria Moorhead Murrow", "comment_text": "Go to the historic district and walk around and eat everything ❤️"}, {"username": "Leslie Goodland", "comment_text": "That's not much time. I'd just stretch my wander toes."}, {"username": "Alison Rouget", "comment_text": "We are in Naples for 3 hours between our train and ferry. This is what we are going to do after we store our luggage - take a wander through the Centro Storico streets, pizza in Naples for lunch, (I think you have to eat a pizza in Naples!) then maybe a quick ride on the Centrale Venicular if we’ve go time?\nYou could do Pompeii for a couple of hours and would be very achievable if you took a taxi, or arranged a driver.\nThe Archeological Museum in Naples sounds like it is very good, but I got the impression it would be better to visit if you had been to Pompeii, that was just someone’s opinion that I read though?"}]}, {"id": "2211464782585933", "text": "Hello, I would like to ask for your input on the 14 day itinerary we’re thinking next summer.\nFlorence\nLake Como\nSicily\nSardinia\n\nWe’ve been to Florence before so we won’t stay there more than 3 days.\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2211464782585933/", "likes": 1, "comments": [{"username": "Lisa Adams Robertson", "comment_text": "Too much. Sicily is worthy of at least 12 days on its own. It's a large island and there's so much to see!"}, {"username": "Greg Saba", "comment_text": "Sardinia is wonderful. We spent 8 nights there and got a pretty good glimpse. Definitely need a car because public transport is lacking. Lake Como, we based in Varenna, had great weather and that helped us enjoyit in three nights. Not a big fan of Florence, mostly due to the crowds. We have had multiple Sicily trips (and now own a second home there). We have done 4 and 5 days trips to specific areas, and last year spent a month, visiting 76 places. If interested, you can google \"Ultimate Month in Sicily\" and see our Fodors report with over 1,000 photos. It might help you whittle down which area might appeal to you."}, {"username": "Ike Simoncini", "comment_text": "I agree all 4 of them excellent places but all of them is a bit to match . Florence in tuscany verry beautifull city,personaly i would not stay longer in a city then 3 days anyway. The region tuscany is also realy lovely chianti nearby is so beatifull and the food is awsome. Siliy is also verry verry well known for its food in this thread i gave someone a verry good plan for a 3 week trip in sicily https://\nwww.facebook.com\n/groups/\n1373361046396315\n/posts/\n2210044212727990\n/\n?comment_id=2210\n519829347095&re\nply_comment_id=\n221145231592051\n3&notif_id=1691\n719875192477&no\ntif_t=group_com\nment_mention. sardinia is bit the same as sicily i would definatly choose one of the two Lake como is realy beautifull BUT since i'm a foody i don't realy like it as soon as you go up north to match the food gets a little less wonderfull. If you would stay at a lake i would prefare lake garda but its more crowded and there is a lot of mass tourism there witch i realy don't mind. If you wnat andvice on garda just let me knwo i can give you some great restaurants over there. In 4 weeks i will stay at the chianti district for 2 weeks and after that i could give you some tips about paces to visit or to eat as well"}]}, {"id": "2211353605930384", "text": "Tips for traveling alone through Florence, Bologna, & Milan?", "link": "facebook.com/groups/1373361046396315/permalink/2211353605930384/", "likes": 10, "comments": [{"username": "Angelina John", "comment_text": "Enjoy & savor every minite!"}, {"username": "Briana Alise Farina Gjoka", "comment_text": "Watch for gypsies and pit pockets"}, {"username": "Matt Johnson", "comment_text": "Ok???"}, {"username": "Kathy Kibbe", "comment_text": "Florence and Bologna are very safe - stay inside the city walls in Bologna - Santo Stefano is a great area - book a food tour and other group tours, cooking classes, etc in both places (I haven’t spent time in Milan so no advice there…)"}, {"username": "Ted Cabot", "comment_text": "In Milan, use your phone to tap in and tap out at the underground metro turnstiles, much easier than worrying about buying tickets. I highly recomend the duomo rooftops tour and treat yourself to a fancy breakfast at marchesi in the galleria next to the duomo. Utilize the free walking tours in milan and food tour airbnb experiences to find a tribe you can feel comfortable around. We still keep in touch with some solo travelers we have met on those over the years. If you need help with an itenarary or food/\ndrink recomendations, you are welcome to PM me!"}, {"username": "Prena Patel", "comment_text": "Following as we are headed there in November"}, {"username": "Lily Thomas", "comment_text": "I recommend hiring a bike or moped but if you are not confident on the road then I don’t recommend"}, {"username": "Robert Bill", "comment_text": "Pack a lot of condoms. Those men will charm the pants right off you! 😝"}, {"username": "Brian Osman", "comment_text": "Enjoy yourself!"}, {"username": "Stuart Kennedy", "comment_text": "Always be aware of your surroundings"}, {"username": "Ronald Shaw", "comment_text": "Lose 5 pounds before you go; you’ll enjoy getting them right back. 🙂"}, {"username": "Sonia Smith", "comment_text": "Just like anywhere else. Be aware of your surroundings and be in a crowded place."}, {"username": "Andrea Daguerre", "comment_text": "Pack light"}, {"username": "Yane Cas", "comment_text": "Be vigilant. Keep your eyes on your belongings"}, {"username": "Mark Spielman", "comment_text": "Skip Milan & Go to Verona"}, {"username": "Ray Kelley", "comment_text": "Get a money belt and have fun"}, {"username": "Gillian O'Callaghan", "comment_text": "I've just done a month solo in Italy.......jus\nt go and enjoy. I booked 13 train trips on Trainline, walked about 8 hours a day, booked tickets on Viator, had the best steak ever in Florence, found places that sold pizza by weight as there's no way I could eat a whole 🍕, drank Aperol Spritz and Hugos, chilled out in Arezzo.....and lots of other places. Being able to lift your bags easily (I'm 65, had checked luggage (16kgs) small backpack snd crossbody purse) is so helpful on trains and in accommodations.\nHave fun 🇮🇹"}, {"username": "Lj Downs-Ahearn", "comment_text": "Life360, it’s a great app so your friends and family can see where you are !"}, {"username": "Lj Downs-Ahearn", "comment_text": "Also don’t let anyone put bracelets on you….they may be offering it as a ‘gift’ and then try and get you to give them money. If they approach you they may seem nice at first and then try to rope you into having one"}, {"username": "Chrysa Zournatzidou", "comment_text": "If you’re interested in visiting museums in Florence, then book the tickets online so you don’t need to wait in long queues!! And of course you should take a tour around Tuscany( Siena, San Gimignano etc)!!\nHave fun 🤩"}]}, {"id": "2211441039254974", "text": "If anyone will be visiting Rome from Ottawa I am looking to get the following Starbucks mug brought back. I was unable to get while on my cruise a few weeks ago. Thank you in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2211441039254974/", "likes": 0, "comments": []}, {"id": "2211371422595269", "text": "Will be taking. Water feeey to Murano to see the Murano Glass Blowing. I have read their are several “tours”\nThat aren’t really the Murano glass …\nHow anyone done a tour here? Any recommendations on authentic tours or walk abouts for Murano and Burano as a day trip?\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2211371422595269/", "likes": 2, "comments": [{"username": "Leslie Goodland", "comment_text": "I booked my tour with Get Your Guide. Saw a glass blowing demonstration of an animal and a vase. Then we got to go shopping in their showroom, which was filled with all sorts of cool pieces in varying price ranges. They'd even ship the big stuff for you. Guide was a wealth of information."}, {"username": "Joe-Linda Po Agustin", "comment_text": "Free, just visit a factory and you can watch the glass blowing demos. They have a sort of viewing platform or dais where people can watch as artisans work. After the demo, you’ll have to pass through the showroom, but there’s no sales pitch so you’re not pressured into buying their wares. As for Burano, there are old ladies sitting outside of the stores making the lace and you can watch them. Just strolling around, going into the shops without buying anything makes for a great way to spend your time there. If you do want to buy, just be careful as many are made in China. The authentic ones are quite pricey."}]}, {"id": "2211472755918469", "text": "Hi i will be in Florence end of August and would like to check where i can either rent a baby stroller (aside from Babonbo) / buy a cheap stroller (can donate / leave behind)? I would just need it for 4 days for when we’re out and baby needs to nap.\n\nI will mostly baby carry but just want to keep the option for stroller open. Baby is 15 months at the time of travel!\n\nFeel free to recommend baby friendly places (like parks / playgrounds) :)\n\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2211472755918469/", "likes": 0, "comments": []}, {"id": "2211474409251637", "text": "1st time Italy travelers. We’re looking for a good day trip from Rome. There are 7 in our group. 3 are children ages 15, 10 and 8. We were thinking Tuscany or Florence. Any and all recommendations are appreciated.", "link": "facebook.com/groups/1373361046396315/permalink/2211474409251637/", "likes": 1, "comments": [{"username": "Joe Pisano", "comment_text": "One day? No way with the team you have."}, {"username": "Kejdi Okej", "comment_text": "One day no way with the team you have"}, {"username": "Shelagh Kosinski", "comment_text": "Orevitto"}, {"username": "Cinzia Berletti", "comment_text": "I second Orvieto"}]}, {"id": "2211475222584889", "text": "We are in Rome! Landed yesterday, highly recommend getting up early! We were a bit jet lagged flying in from Australia and woke up at 3am and then went for a walk at 4am. We were at the Trevi fountain aroundआणखी 5am and by 5:30am the people started steaming in.\n\nThe city is beautiful early in the morning, especially when the first light hits the old buildings.", "link": "facebook.com/groups/1373361046396315/permalink/2211475222584889/", "likes": 1051, "comments": [{"username": "Pat Packard", "comment_text": "Good for you! Hope to do the same in October, but only coming from USA. R u staying close to Trevi? Ok to walk around early in morning?"}, {"username": "Alexandra Michele", "comment_text": "I also went to Trevi yesterday morning at 5:30am 😃"}, {"username": "Debbie Milne Jenkins", "comment_text": "GREAT photos!"}, {"username": "Viraf NZ", "comment_text": "My favourite in Rome 😊"}, {"username": "Tracey Turner", "comment_text": "We arrive in a couple of weeks from Sydney. That will be us for sure. 🤣❤️\nEnjoy your holiday ."}, {"username": "Kerry Jacobsen", "comment_text": "I’m thinking my insomnia will be an asset when we visit in September 😂"}, {"username": "Kylie Stefanile-guille", "comment_text": "Steven McIntosh"}, {"username": "Michèle Nardelli", "comment_text": "Agree - you have to be a sparrow to avoid the crowds"}, {"username": "Christine Mullmann O'Hara", "comment_text": "You had the place to yourselves!!"}, {"username": "Leanne Bingle", "comment_text": "Elizabeth Colleen Fowler rise and shine lol"}, {"username": "Helen Stokes", "comment_text": "We plan do get up early too, a few times anyway.\nAnd we are coming from Australia so might be jet lagged"}, {"username": "Susan Pierce", "comment_text": "Jet lag, usually dreaded, served you very well. 👍🏼✈️😃"}, {"username": "Jackie Armstrong-Mathison", "comment_text": "Jim Mathison"}, {"username": "Annette Doley", "comment_text": "We did the same about a month ago. Got up early and did a 2 hr Walk seeing all the sights before the crowds started and to beat the heat"}, {"username": "Nadia Caporale", "comment_text": "Amanda Cortes"}, {"username": "Gary Bailey", "comment_text": "i love walking early in the morning"}, {"username": "Dena Mousley Bartman", "comment_text": "Kelly Linn Dodd ! Early!!!"}, {"username": "Nicole Mynard Frew", "comment_text": "Will be there in 32 days. So looking forward to it Emily Mynard"}, {"username": "Jean Bennett O'Reilly", "comment_text": "Enjoy the experience❣️"}, {"username": "Amanda Knight", "comment_text": "Sharryn Chapman we will need to be up bright n early!!"}, {"username": "Marianne Langa", "comment_text": "Roma❤️❤️❤️"}, {"username": "Yateesh Kumar", "comment_text": "Nileema Kumar"}, {"username": "Frank Pallante", "comment_text": "I have also done this. Fantastic in the early hours"}, {"username": "Ellen Marie", "comment_text": "Love this! 10/10 recommend! Also, if you’re a ways away from the sights you want to see, download the Lime app and take a scooter (only ride in the streets, it’s illegal to ride on sidewalks) to get to your destination early. There is little traffic that early, so even inexperienced Lime riders will be fine! Plus it’s so fun!"}, {"username": "Christine Broussard", "comment_text": "Arriving in September from cairns!! Great pics!!! 👍🏼🌺"}, {"username": "Wendy Norman", "comment_text": "I did that in 2019 from Australia too. We were jet lagged so up early 5am, it’s truly magical when there’s hardly anyone around! Fabulous!"}, {"username": "Donna Spencer", "comment_text": "Beautiful predawn pic."}, {"username": "Krystal Story", "comment_text": "Jasmine Clayton Melvis Cox"}, {"username": "Doug Burke", "comment_text": "I've posted this before as seeing a place in the early morning is a totally different experience than seeing it later in the day......\n\nI didn't run on vacation for years until one year we went to Europe for two weeks a month before a marathon. Two weeks off wouldn't have not done me any good so I brought my gear. Had a great experience and now I do it even if there's no big race on the near horizon.\n\nIt allows one to see and experience a locale in a little bit different way than one normally would. And no need to actually run to experience this. Walking will do just fine. Some of my memorable vacation runs:\n\nA dawn run beginning and ending literally under the Leaning Tower of Pisa. That whole Cathedral square looks totally different at 6AM than at 2PM. At that hour, there were exactly two people there, myself and a very bored looking policeman.\n\nA run in the linear park along the Bosporus in the shadow of the Blue Mosque in Istanbul. Lots of local runners out for their own morning run including some women dressed in the traditional robes leaving only slits for their eyes but sporting colorful Nike shoes and churning out 8 minute miles, robes streaming behind.\n\nA run overlooking the Caldera in Santorini with the sun rising out of the sea.\n\nA sunrise run from the town square in Bastogne, Belgium out to the village of Foy to the American perimeter where their foxholes still exist from the Battle of the Bulge.\n\nAnd a dawn run through the sites of Rome which included a lap around the deserted Colosium.\n\nAnd I can get out and do my running and have plenty of time to do what I came there to do. I typically get out at 6AM, done by 7:30, cleaned up and at breakfast at 8 ready to play tourist for the day."}, {"username": "Catherine Lammers", "comment_text": "Awesome pics!"}, {"username": "Tara Roed", "comment_text": "What a great way to take advantage of the jet lag ❤️❤️❤️. Enjoy beautiful Italy 🇮🇹"}, {"username": "Kejdi Okej", "comment_text": "What a great way to take ♥️♥️ advanta of the jet lag ♥️♥️ ♥️ , enjoy beautiful 🇧🇬"}, {"username": "Melanie Matthews Stuprich", "comment_text": "20 years ago I never saw the crowds like I saw this summer at Trevi fountain! I was blown away (hadn’t been back in 20 years until this summer). The amount of tourists has definitely increased in the last two decades."}, {"username": "Jan Lumberg Kupczyk", "comment_text": "One great way to see it quietly."}, {"username": "Shannon Plane", "comment_text": "See, early is awesome 🌟"}, {"username": "Keri Smith Estes", "comment_text": "Isn’t it magical?!!! Have a wonderful visit!"}, {"username": "Kim Grace", "comment_text": "Michelle Cummins"}, {"username": "Nina Luna", "comment_text": "Carina Luna"}, {"username": "Beth Templeman Brock", "comment_text": "I loved Rome!"}]}, {"id": "2211475382584873", "text": "Is there a way to book a Rome Catacombs tour directly through the Catacombs rather then a 3rd party vendor? If so where do you go?", "link": "facebook.com/groups/1373361046396315/permalink/2211475382584873/", "likes": 0, "comments": [{"username": "Shen Min Chue", "comment_text": "Just go directly to the respective venues of the different catacombs and purchase tickets straight from their ticket offices. These official places will group you into appropriate guided tours, led by their official guides, according to languages spoken. You can search on google maps for these direct catacombs -- Catacombs of St. Sebastian, Catacombs of St. Callixtus or Catacombs of St. Domitilla."}, {"username": "Paul Anderson", "comment_text": "There are many catacombs in Rome. The ones near the appian gate are nice and you just go there and buy a ticket at the convent. Yes many of them are religious compounds."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 8, "comments": []}, {"id": "2211477412584670", "text": "Looking for recommendations & advice for four full days and two half days while based on Sorrento at the beginning of October!\n\nThis is what I have planned so far (evenings in Sorrento for the most part)\n\nHalf day: travel to Sorrento, explore sorrento\nFull day: Pompeii/Herculaneum/Mt Vesuvius/Winery - some variation of this.\nfull day: amafli / ravello\nFull day: path of gods / positano\nFull day: island - Capri, ischia, or procida\nHalf day: sorrento, travel near FCO for the night\n\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2211477412584670/", "likes": 1, "comments": [{"username": "Kally Trahearn", "comment_text": "Sounds perfect - you're seeing lots but have enough time to relax, however, you could do Positano/\nAmalfi/Ravello on the same day if you don't mind a long day. I'd probably have breakfast in Positano, lunch in Amalfi and dinner in Ravello. You can get a bus to Positano, then on the way home from Ravello, a private car is probably easier and quicker, especially if you've had a long day already.\n\nThere's a restaurant I would recommend in Sorrento: La Cantinaccia del Popolo - not high end but definitely a favourite of the locals. Google it, read the reviews. You will not be disappointed. You can't reserve, so get there early and expect to wait until a table is free for the size of your party.\n\nRelax and enjoy it all x"}]}, {"id": "2211478029251275", "text": "Traveling to Italy the end of September. Any suggestions on what to pack. Beginning of fall should still be warm but not sure if I should pack for warm or cold weather.", "link": "facebook.com/groups/1373361046396315/permalink/2211478029251275/", "likes": 4, "comments": [{"username": "Ingrid Zancoli", "comment_text": "It depends on the zone of Italy, in the south It would still be warm enough to go to the beach, in the North It can be colder and maybe a bit rainy"}, {"username": "Michael Widjaja", "comment_text": "Bring something to layer up with just in case it gets cold"}, {"username": "Mary Agozzino Derrick", "comment_text": "Depends where in Italy you're going to...we here in Siracusa lady October and we had days in the 30C the whole month was gorgeous !"}, {"username": "Allan Olexa", "comment_text": "Where in Italy?"}, {"username": "Francesca Giovanelli", "comment_text": "Quite warm you need a jacket in the evening. If you go on the Alps cold"}, {"username": "Rhonda Hope", "comment_text": "Just a cardigan or light jacket is fine"}, {"username": "Wendy Spano Bracco", "comment_text": "Add your cities into a weather app. AccuWeather shows you 45 days out to give you an idea."}, {"username": "Terry Pisano", "comment_text": "Bringing a sweater and a hoodie. I dont expect it to be too cool... maybe at night in the northern parts..."}, {"username": "Cassandra Blanchard", "comment_text": "Wondering this as well - will be in amalfi coast last week of September/\nfirst week of October"}, {"username": "Jenny Payne", "comment_text": "Should be warm , cotton, linen, silk I take every year with a jacket if cool in the evenings 🌻"}]}, {"id": "2211483585917386", "text": "Has anyone attended an opera at Teatro alla Scala in Milan recently? We have tickets for September 13, and want to make sure we bring (or buy) outfits to dress appropriately. I’m seeing suggestions from “smart casual” to dark suits and cocktail dresses. Women and one man in our group. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2211483585917386/", "likes": 1, "comments": [{"username": "Chris Landry", "comment_text": "I did mid September in 2021. I wore black pants and a long flowy tunic with sandals. I did not feel out of place. I saw a few dressed formal as well. No jeans."}, {"username": "Pamela Campaner", "comment_text": "I was born and raised in Milano. Don’t overdress!"}, {"username": "Lisa Adams Robertson", "comment_text": "We are also going to an opera, but in Venice. It's going to be opening night for the performance, so the attire is supposed to be formal, according to the website. I hope we won't be overdressed, but I guess I'd rather overdress than underdress. IDK, I'm a little stressed about it!"}, {"username": "Kejdi Okej", "comment_text": "I was born and raised in milano don t overdress"}, {"username": "Shelley Jade", "comment_text": "F"}, {"username": "Cassandra Crowley", "comment_text": "Casual."}]}, {"id": "2211483589250719", "text": "Anyone in Florence right now? I’m concerned about the heat. I booked a Vespa tour around the city and countryside but it’s supposed to be 100 that day. (Monday) I’m thinking I should cancel thoughts?….", "link": "facebook.com/groups/1373361046396315/permalink/2211483589250719/", "likes": 0, "comments": [{"username": "Tony Gesmundo", "comment_text": "Should be fine. Bit of a breeze around and once in the shade it’s very bearable."}, {"username": "Paul Anderson", "comment_text": "If you stay up in the hills outside of Florence it is much cooler"}, {"username": "David Horgen", "comment_text": "Where sunscreen and stay hydrated. Have fun!"}]}, {"id": "2211495695916175", "text": "Going to Italy next summer but want to get accommodations booked ASAP because we have a family of 5 (2 teens and a 10 year old) and it’s tough. We have 10 nights. We are planning on 3 in Venice, and then want to go to Cinque Terra (3-4?) and Lake Como (3-4?) but not sure where we should stay longer. Any insight? Is 4 nights too long in Cinqueआणखी Terra? Maybe not if the teens want a couple beach days? How crowded is the beach in monterosso in the summer? Is it even worth it? what is there to do in Bellagio other than look at beautiful scenery - that’s perfect for me but the kids will get bored! Can you rent motor boats and do waterskiing, tubing, etc? Any good day trips? We were also considering Lugano so they can experience Switzerland. Re cinque Terra, We loved cinque Terra last time we were there but it was off season so we are worried about crowds in summer. any/all advice is welcomed!!", "link": "facebook.com/groups/1373361046396315/permalink/2211495695916175/", "likes": 1, "comments": [{"username": "Rebecca Martin", "comment_text": "Re Venice: we just stayed at the De Barbari apt thru https://\nwww.veniceapartm\nent.com/ with our family of 5 (kids ages 14, 14, and 16) and it worked out well. Walkable to train station, washing machine and huge drying rack, clean, a/c worked well. And relatively cheap, 200 euro per night in July. The apt across the hall (Carlo Scarpa) may be even better bc it also has a loft space.\n\nAlso, we did the rowing lessons and the kids loved it."}, {"username": "Kate Laidlaw", "comment_text": "We just stayed 4 nights in Riomagiorre and it was very relaxing, my new favourite place. Plenty of time to enjoy each town at least once with plenary of eating, hiking and swimming. It wasn’t as busy as June/July. Get a 3 day train and hike pass!"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "When in Cinque Terre go to Vernazza (my favorite). There is a tiny sandy beach just off the main square and some nice little cafes.\n\nThe Lido island in the Venice lagoon also has a nice beach."}, {"username": "Lindsey Lobeck Shian", "comment_text": "We are in Como now & loving it. Kids are 15 & 13. Stayed in Cinque Terre prior, airbnb in Monterosso. Pesto making class at Nessun Dorma in Manarola. Hiked to Vernazza. Private boat was canceled due to the waves. Dinner at Bellaforte in Vernazza. Amazing! Beach day in Monterosso. Reserved chairs DAY OF at the beach for 80 euros for 4 chairs & 2 umbrellas. Ligurian Sea is warm & had fun waves. We had food service so never had to leave our chairs.\n\nBuy the CT train tickets & hiking pass. Train is so easy!\n\nIn Como, took funicular to Brunate. Ate dinner. Gorgeous views. Private boat your around Lake Como. Ferried to Bellagio, walked, shopped & explored. Took another ferry from Bellagio to Verenna. Shopped, are gelato. Ferry back to Como. Today we took an e-bike tour to Switzerland. Beautiful…Loren\nzo was awesome!\n\nComo has many plazas with fabulous restaurants and fun shops."}, {"username": "Sam Mah", "comment_text": "Try looking for apartments as they may have extra rooms/beds as well as washing machine."}, {"username": "Robin Cole", "comment_text": "Sounds like a good plan! I think your 3 locations are well chosen for kids. I’m not sure how early in June you are going, but the earlier the better for less crowds. I would stay in Monterosso in Cinque Terre for the best beach for your kids, and visit the other villages by the local train or ferry. Definitely do the pesto class at Nessun Dorma in Manarola…your kids will love it and it’s a great lunch and view. You can book it online ahead of time. Lake Como is fun to take the ferries and explore. I stayed in Varenna and loved the beauty and peacefulness of the village, but your kids might enjoy staying in Menaggio more…a little livelier for them. But take them up the trail to the castle in Varenna if you like a challenge! Most beautiful view ever and worth the climb! There are 2 trails…the easier one on the ferry side but without views, and the more challenging one on the other side of the village past the church with gorgeous views and random surprises along the trail like a small bamboo forest, a grave from the 1800’s in the degrading stone steps, a clay tennis court in the middle of nowhere, an old cemetery, and crazy art sculptures at the end of the trail near the castle entrance. You could also take the kids to see the Villa Balbianello by ferry…most beautiful gardens ever and where they filmed the wedding scene for Anakin Skywalker if your kids are Star Wars fans!"}]}, {"id": "2211493295916415", "text": "Question regarding receipts. Leaving for Rome/Puglia/Florence 8/31. Do I need to keep EVERY receipt for everything (restaurants, small incidental expenses,) or just items like wine and shipping back to USA, souvenirs, purses, usual tourist shopping items. I have seen the posts regarding producing receipts if asked. Just making sure I understand the scope. If anyone gets asked, it will be me! 😂 TIA.", "link": "facebook.com/groups/1373361046396315/permalink/2211493295916415/", "likes": 15, "comments": [{"username": "Charlene Noll", "comment_text": "For what, customs? Is this for the tax refund??"}, {"username": "Janine Emma Lucas", "comment_text": "For customs they only need receipts to be declared for things you sent home on your behalf and things you’re bringing. Not needed: taxi, food, drinks, bus fares etc."}, {"username": "Marcus Hiesler", "comment_text": "Threw all ours in the bin at the end of everyday"}, {"username": "Vinayini Murty", "comment_text": "I am keeping to compare against credit card bills, then will toss"}, {"username": "Elaine C. Macalolooy", "comment_text": "If this is for the VAT refund , not all receipts are acceptable like the small stores or restaurants . It’s usually big merchandise items or places like big dept store . You can also ask the store if they have the VAT refund form to give to you and they can help fill it out for you . In Florence Designer outlet , they have an office to refund your tax immediately after you’re done your shopping and in the Airport look for the VAT refund station , come early due to the line up . All my big purchases were in my carry on and they asked to see them right there ."}, {"username": "Janet Messanelli Bozzone", "comment_text": "You need to have receipts when you leave restaurants cafes and small businesses until you have gone a distance from the location. Then you can discard them. The police check so they know the charges were accounted for and not settled for under the table cash. You need to save the big ticket items if you want your VAT back."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Save receipts for all merchandise you are bring back through customs."}, {"username": "Dann Hrusch", "comment_text": "I keep receipts as souvenirs but have never been asked to produce them."}, {"username": "Gillian O'Callaghan", "comment_text": "If you mean for VAT claims it's only for certain goods over a set amount. I didn't keep any receipts for meals, groceries or small purchases. Checked budget on banking app daily."}, {"username": "Robin Burrell", "comment_text": "Just when you leave the restaurant. Once you are out you can toss"}, {"username": "Molly Roberts Siegenthaler", "comment_text": "Any large purchases only. Usually over $150."}, {"username": "Sigrid Cormier", "comment_text": "Laura Miller Bailey just you don’t misunderstand. The VAT in all the EU countries and Britain is already included in the price your paying. Unlike the US and Canada were the sales tax is added onto the price posted at the cashier.\nThe VAT varies on if it’s a luxury goods or not. If you plan on purchasing any one item over I believe it’s around 120-130€ for example leather goods, gold jewelry etc. Look for the stores that have a sign in either the window or door that’s says Tax Free or to that effect. They will ask to see your passport. They will give you a receipt and completed form with their stores registration # and info. Now some stores I recently heard will reduce the price of the goods by the VAT less a small admin fee right at the store. Of that im not 100% sure.\nBUT if you keep all your receipts that qualify for a refund. At the airport look for the VAT refund Kiosk. Keep your purchases your claiming with you as they may ask to see them. Give them the completed store form, your completed form and you will get what you paid in VAT (sales) tax back,either in cash or credit to your CC.\nGo to google to get more detailed info on what qualifies etc. Leave yourself extra time at the airport. You can also google where exact,y the kiosk is located.\n\nNow don’t forget to check the US website to how much you can bring back into the US both in value and is there are any restrictions ."}, {"username": "Kristen Rozansky", "comment_text": "Hmm. I threw every receipt out from every purchase every day I was in Italy in July/August. I also have Global Entry and they never seem to ask if I have anything to declare when I return to the US, so maybe I’ve just been lucky to date!"}, {"username": "Lisa Roth", "comment_text": "VAT refund does not apply items that are used/consumed while in country, so that means things like your hotel stay, meals, groceries, etc.\n\nOnly new, unused goods being exported out count - and often only receipts > a certain rather substantial amount, so little 20€ receipts for a souvenir t shirt or whatever won’t count either."}, {"username": "Sue Policicchio", "comment_text": "Domenic Policicchio III\nAngelo Policicchio"}, {"username": "Katia Macri-Roberts", "comment_text": "VAT aside, the reason to hold onto the receipt for your gelato or coffee is because the carabinieri can and will ask you to produce proof of purchase after you exit a shop. Hold onto them for the day and then discard. 😄"}, {"username": "Anne Davidson", "comment_text": "You might need receipts for customs. Check what you are allowed to bring back home. There are usually restrictions on alcohol and cigarettes/\ntobacco and a limit on what you can buy. Above that limit you pay duty. In large stores ask if they have duty free. If so, they need your passport info and they fill out forms. Last departure point from Europe look for the tax refund area and give them your receipts. Have it refunded to your credit card. There’s often a charge for a cash refund."}, {"username": "Isabelle Truong", "comment_text": "I paid with Wise card so the payment is shown on there. You can also take a photo of your receipt then delete them later so you don’t have to carry bits of paper in your bag."}, {"username": "Christine Caudill", "comment_text": "Could someone be so kind to confirm for me. Based on comments, the VAT taxes charged by our hotels are not eligible to be refunded?"}, {"username": "Dale Sachs Rizzo", "comment_text": "If I buy wine in Italy & have it shipped home, do I need to declare to customs?"}]}, {"id": "2211496045916140", "text": "Is Sardinia worth visiting? Any￼ feed back would be appreciate it.!", "link": "facebook.com/groups/1373361046396315/permalink/2211496045916140/", "likes": 24, "comments": [{"username": "Marjetka Ban", "comment_text": "Definitely ❤️"}, {"username": "Keith Piccirello", "comment_text": "Anywhere in Europe is worth visiting"}, {"username": "Kejdi Okej", "comment_text": "Yes definitely , the beaches are so beautiful"}, {"username": "Jonna Hjelt", "comment_text": "Yes! Alghero old town and Sassari beaches 🌟"}, {"username": "Sisse Brüel", "comment_text": "I have been in italy +50 times and I love the country. But - Sardinia is my favorite place ❤️. Need say no more..."}, {"username": "Paul Wiener", "comment_text": "Sargassum (sea-weed) issues now in Sardinia?"}, {"username": "Adele Mazoudier", "comment_text": "Yes, stunning landscape, fascinating history (nuraghe). Loved it. Two weeks there a few months ago."}, {"username": "Santo Finocchiaro", "comment_text": "Yes. Cagliari is a nice area."}, {"username": "Vanessa Tuveri", "comment_text": "My dear , Sardinia is the Maldives or the carabbians of Italy as far as the sea.\nBeautiful country , the food is Italy on steroids like a lot of the south do to produce growing in the sun ; the vast culture of km zero and the way things are made is an experience in it s own ."}, {"username": "Heath Conn", "comment_text": "Debbie Conn"}, {"username": "Barbara Krot Barrett", "comment_text": "Beautiful but pricey"}, {"username": "John Todarello", "comment_text": "What sort of question is that ???"}, {"username": "Annelise Drewes Giddings", "comment_text": "Absolutely fantastic!! But public transport is a little unreliable Olbia, Cagliari, Alghero...all different but wonderful"}, {"username": "Jenny Down", "comment_text": "Absolutely.. We spent 10 days there in 2019 and will definitely go back again. The people, the food, the weather in September and the crystal clear water we all fabulous!! X\nGo and enjoy!"}, {"username": "Anne Smith", "comment_text": "Definately"}, {"username": "Anne Smith", "comment_text": "The beaches are beautiful"}, {"username": "Dade Lgg", "comment_text": "The seaside there is the best I have ever seen!"}, {"username": "Lorraine Aspinall", "comment_text": "Definitely. We just spent 2 wks there exploring the north of the island. Best beaches and lovely quaint towns."}, {"username": "Mike Wood", "comment_text": "Any suggestions how best to do without hiring a car 🚘"}, {"username": "Mary O Connell", "comment_text": "Definitely worth it. Absolutely gorgeous"}, {"username": "Kostadinka Godzo", "comment_text": "Absolutely!"}, {"username": "Karen Rabbich", "comment_text": "Absolutely!!!"}, {"username": "La Italuba", "comment_text": "The Caribbean are in Italy and that's Sardinia"}, {"username": "Valentina Knight", "comment_text": "Sardinia definitely worth visiting. The colour of the sea is the best, so transparent. Visit the local country restaurants for traditional meals. Kustera restaurant was unbelievable."}, {"username": "Nancy Plumitallo Brady", "comment_text": "Priscilla Brady"}, {"username": "Lori Crites Perez", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Astrid Støle", "comment_text": "Love it! ❤️"}, {"username": "Jul Bel", "comment_text": "Our family favorite!"}, {"username": "Joanne Grindrod", "comment_text": "Janice Cox 💕"}, {"username": "Ania F. Popiol", "comment_text": "Definitely 💯!!!"}, {"username": "Ella Rooke", "comment_text": "Yes definitely. The beaches are so beautiful"}, {"username": "Virginia Porato", "comment_text": "Most definitely!!! Beautiful beaches 🥰"}, {"username": "Crister Cala Carlstrom", "comment_text": "👍☀️"}, {"username": "Ildiko Gyimesi Mikos", "comment_text": "Most definitely. 💯 Was there for 2 weeks this June."}, {"username": "Melanie Fuger-Dolan", "comment_text": "Omg YES!!! Was just there 2 weeks ago. It’s beautiful"}, {"username": "Gemma DeVoldre", "comment_text": "Yes"}, {"username": "Shawn Galbraith", "comment_text": "I spent 5 nights/ 6 days. It is absolutely lovely. Public transportation is more tricky there however."}, {"username": "Daleen Beukes", "comment_text": "Beautiful place, definitely worth visiting. Just came back from Stintino but all the beaches are magic."}, {"username": "Iwona Dygas", "comment_text": "If you like beautiful landscapes and gorgeous beaches then yes"}, {"username": "Ville Lignell", "comment_text": "Absolutely. Politically Italy, culturally an own reality."}]}, {"id": "2211516032580808", "text": "If you had one last night in Naples what would you choose to do . . . I feel we have seen lots of this amazing place but wonder if there is any hidden gems that we haven’t discovered. Thanks in advance 😊", "link": "facebook.com/groups/1373361046396315/permalink/2211516032580808/", "likes": 4, "comments": [{"username": "Vinayini Murty", "comment_text": "But what have you seen so far? How can we advise you on what you haven't seen?"}, {"username": "Clint Foster", "comment_text": "If you haven’t had pizza at Pizzeria de Michelle it’s a must I hear. Going when we are there in a few weeks. I read it’s top 5 in the world."}, {"username": "Diane Davis Lawyer", "comment_text": "Try some Atlas Obscura suggestions: https://\nwww.atlasobscura\n.com/\nthings-to-do/\nnaples-italy"}, {"username": "Angela Gilmore", "comment_text": "Just a random list of things:\nCertosa di San Martino\nCastel Sant'Elmo\nMonastero Santa Chiara\nCastel dell'ovo\nMaschio Angioino\nPalazzo Reale\nCastellammare (small village near Naples and Sorrento)\nSorrento\nPompei/Ercolano\nVesuvio\nCapri/Ischia/\nProcida\nMuseo Capodimonte\nHistoric City center\nSan Gregorio Armeno\nNapoli sotterranea\nCatacombe di San Gaudioso\nCatacombe di San Gennaro\nCristo Velato\nToledo metro station\nSalita del Pietraio\nPiazza plebiscito\nChiaia, Mergellina and Lungomare Caracciolo\nQuartieri Spagnoli (Largo Maradona/vico Totò...)\nBacoli and Casina Vanvitelliana (small village near Naples)\nReggia di Caserta (outside of Naples)\n\nWhat to eat\n\nPizza everywhere 😅 (Concettina ai tre santi, Starita, 50 Kalo, Sorbillo, Da Michele, Di Matteo and many more)\nFiocco di Neve, Poppella Pastry\nBabà and Sfogliatelle (Attanasio or Scaturchio)\nTarallo sugna e pepe (Taralleria Napoletana or Leopoldo or other places)\nFrittatina and Panzarotti (Pizzeria di Matteo or other places)\nCuoppo (La passione di Sofi or other places)\nMeatballs with tomato sauce at Tandem\nA figlia do marenaro and Nennella, restaurants for traditional food"}, {"username": "Tania Bourgoin", "comment_text": "We are looking forward to hopefully going to the Opera at Teatro San Carlo"}, {"username": "Mary Anne", "comment_text": "If you have time the dive or snorkel at Baia is amazing. There is also a glass bottomed semi submersible boat for non swimmers.\n\nhttps://\nsubaia.com/en/\narchaeological-p\nark-baia"}]}, {"id": "2211507915914953", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2211507915914953/", "likes": 8, "comments": []}, {"id": "2211508512581560", "text": "We are headed to Italy the third week of October for 8 full days (travel not included). Our original plan was to divide our time between Rome and Sorrento (to explore Capri and AC). We fly in and out of Rome. Now we are considering heading through Tuscany/Florence and up to Venice instead. I'm really really torn about whether I want to see Venice or Amalfi Coast. Opinions welcomed.", "link": "facebook.com/groups/1373361046396315/permalink/2211508512581560/", "likes": 6, "comments": [{"username": "Kimberly Milo Fay", "comment_text": "I had the same dilemma but I have 2 weeks. Decided to skip Rome altogether and do Venice for 2 nights,\nFlorence(day trips to Siena, Pisa, San Gimignano, Lucca, Orvieto)for 6 nights, then to Sorrento as our base for 6 nts for visiting Amalfi, Positano, Capri and Ravello. We had difficulty with getting a direct flight back to JFK from Naples so we are taking the train to Rome and will be there for 24 hrs. Hop on/Hop off bus to see the major sights, some photo ops, no tours in Rome. Nice dinner and then leave the next day.\nI’ve decided that I WILL go back to Italy and see Rome another time along with Lake Como, Sicily, Portofino, etc\nSo much to see and do!"}, {"username": "Katie Marie", "comment_text": "I’m leaving Rome today and this might be me, but I’m truly upset I ever went to Capri / AC.\nI went to Rome then Florence and absolutely fell in love with Florence. I did 3 nights in Capri and it sucked for a few reasons, but if you are wanting to explore specific things in one of the coastal towns then make sure you stay there. Otherwise you can’t depend on the ferries.\n\nI was meeting a friend in positano and both of our ferries were delayed… so we only got 4 hours there. It’s hard to explain but it seems like it would be great if you stayed at an amazing hotel, had a yacht for a week could go shopping in every store etc.\n\nThat Tuscan sun was truly the most beautiful thing I’ve ever seen! And all of the people were so friendly and welcoming."}, {"username": "Gina Rovello Keenan", "comment_text": "They are so very different. Our first trip we went to Sorrento and took the bus down the Coast to Amalfi . It was quite the task getting up to Ravello with traffic. Then we took the ferry back. It was all very beautiful. Sorrento was a great base. This trip we are going to Bologna, Florence and Venice. We have been to each before but are taking other family members this time. Florence is so much art & history (we only did a day trip last time). From Florence you can day trip to other towns and wineries. Venice, well Venice is Venice! so beautiful and unique. Which would you prefer?"}, {"username": "Jack Partington", "comment_text": "Capri is pretty but mostly a tourist trap."}, {"username": "Valerie Collanton", "comment_text": "I love both. You can’t go wrong either way. Yes Capri is touristy but it so beautiful. If you decide on that option, I would stay in Sorrento. It is easy to get ferries to Capri and other places. Third week in October is a great time to go. It will definitely be less crowded. Though last year I was surprised how busy Rome was during the last week in October"}, {"username": "Kejdi Okej", "comment_text": "Capri is pretty but mostly a tourist trap"}, {"username": "Tam Wong", "comment_text": "Do Rome , Florence for sure"}, {"username": "Sue Policicchio", "comment_text": "Domenic Policicchio III\nAngelo Policicchio"}, {"username": "Karen Schmidt", "comment_text": "Rome 3-4 nights, Florence (or Siena) 2-3 and Venice 2. It will give a nice overview of each city"}, {"username": "Diane Janovas", "comment_text": "I have been to both. Both beautiful but Venice is totally unique and amazing. Especially if first trip to italy...go to Venice"}, {"username": "Rachael Richardson", "comment_text": "I’d do Tuscany Florence and Venice any day, capri totally overrated , loved sorrento though"}, {"username": "Linda Snyder Shandle", "comment_text": "Loved Sorrento and Florence. And Rome. Just got back. 🥰"}, {"username": "Colleen Sommerin", "comment_text": "Amalfi"}, {"username": "Laura Uribe", "comment_text": "They are all great places! There is always time to go back for another trip. Italy is amazing! Just don’t wait too long to decide, or the decision will be made for you based on availability."}, {"username": "Jenny Payne", "comment_text": "I would do the latter🌻"}, {"username": "Linda Chase", "comment_text": "❤️ Venice"}, {"username": "Susan Sassoon", "comment_text": "Italy is so beautiful. Very hard choice. Venice is like no other city ( that I know of). You haven’t felt Italy if you don’t go to Venice.\nThe Amalfi coast and small towns are stunning . Which ever one you choice, will be a right choice."}, {"username": "Ted Cabot", "comment_text": "Venice is a must! There is no where quite like it in the whole world! Amalfi is beautiful but is a coastal cliff side area, great but not unprecedented. If you need Itinerary help or food and drink recommendations\n, PM me, I live about 45 minutes from Venice."}, {"username": "Bill Gillespie", "comment_text": "4 nights in Venice, the rest in Rome. You'll be back, then go to Naples, Capri and AC."}, {"username": "Teresa Chiovaro Cowley", "comment_text": "Capri is a day trip. Boat tour around the grottos and spend a few hours in Capri from Beautiful Sorrento was wonderful. We traveled from Rome to Sorrento, back up north to Florence 2nights, on to Lake Como 3 nights and Venice. We then headed back to Rome. There is so much more in Rome to explore. Next trip will definitely be heading back to Rome and explore Sicily."}, {"username": "Summer Wicker", "comment_text": "I’ve been to both and I’d do Florence and Venice over the Amalfi coast"}]}, {"id": "2211509062581505", "text": "I’ve been following this group and have taken advice of staying in Sorrento as home base for exploring however I am having trouble finding an affordable Airbnb for 8 adults in Sorrento . Thoughts on Sant’Agnello? We will not be renting a car so looking to be able to walk/short taxi drives to trains/ferries/etc.", "link": "facebook.com/groups/1373361046396315/permalink/2211509062581505/", "likes": 3, "comments": [{"username": "निनावी सहभागी", "comment_text": "Following"}, {"username": "Paula Brink", "comment_text": "Sant’Agnello is lovely, we stayed there at Hotel Mediterraneo. It’s an easy walk into centre of Sorrento- about 20 minute walk."}, {"username": "Karen Schmidt", "comment_text": "When are you going? If it’s next year, more listings might become available. Some don’t open availability until October for the following year"}]}, {"id": "2211518755913869", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2211518755913869/", "likes": 5, "comments": []}, {"id": "2185803435152068", "text": "Best Kept Secret in Locorotondo🤫\nOttolire Resort is located in the heart of the green hills of Itria Valley in Puglia, in a fairy-tale landscape made up of ancient olive groves and vineyards, delimited by the… आणखी characteristic dry stone walls, recently declared Intangible Heritage of Humanity by UNESCO.\nDiscover more: https://www.anrdoezrs.net/click-100692842-11552042?url=https%3A%2F%2Fwww.tripadvisor.com%2FHotel_Review-g1056127-d13481308-Reviews-or10-Ottolire_Resort-Locorotondo_Province_of_Bari_Puglia.html%23REVIEWS", "link": "facebook.com/groups/1373361046396315/permalink/2185803435152068/", "likes": 10, "comments": []}, {"id": "2209358006129944", "text": "Capri Blue Grotto Boat Tour From Sorrento\nThe Blue Grotto is the most famous sight on Capri, but the long wait at the cave entrance means that many boat tours skip a stop here. With this tour, set sail first… आणखी thing in the morning to beat the crowds and cut wait times to a minimum. After taking in the grotto, enjoy a boat tour around the island with stops to swim and free time to explore on land. Read more about Capri Blue Grotto Boat Tour From Sorrento -\nhttps://www.viator.com/tours/Sorrento/Special-Capri-Blue-Grotto/d947-42612P9?pid=P00070587&mcid=42383&medium=link&medium_version=selector", "link": "facebook.com/groups/1373361046396315/permalink/2209358006129944/", "likes": 12, "comments": []}, {"id": "2211318639267214", "text": "Good morning. We are staying 4 nights at Hotel Patria, is this central to everything? Do you need travel cards for the buses and trains? Tia.", "link": "facebook.com/groups/1373361046396315/permalink/2211318639267214/", "likes": 4, "comments": [{"username": "Phillip Farquhar", "comment_text": "Your beside termini station."}, {"username": "Beth Searight Millar", "comment_text": "I stayed there this spring and walked to everything - but the hike to the Vatican was a bit long."}, {"username": "Sandy Radican Shikaly", "comment_text": "About 20 min to the Trevi and an hour to the Vatican.. I would move more central and away from Termini... that area attracts transients."}, {"username": "Diana Forni", "comment_text": "Thank you 😊 all."}]}, {"id": "2211320932600318", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2211320932600318/", "likes": 3, "comments": []}, {"id": "2210856845980060", "text": "I am flying into Florence from Paris CDG (Air France) and KLM out of Florence to Amsterdam. At what point in the process were your bags weighed and sized?", "link": "facebook.com/groups/1373361046396315/permalink/2210856845980060/", "likes": 5, "comments": [{"username": "Geoff Northcott", "comment_text": "Every time you check in - so for you, Paris and Florence"}, {"username": "Gillian O'Callaghan", "comment_text": "For checked it's when you do the check in/bag drop (and carryon assessed too), for carryon it's at the gate or in the plane (yes some go in the hold from there)."}, {"username": "Anthony Martini Jr.", "comment_text": "Every check in. And they are strict"}, {"username": "Rosa Zordan", "comment_text": "Depends if your luggage is straight through or not. If you need to collect your luggage then you will need to check it in and it will be weighed at every airport."}, {"username": "Rosnani Konali", "comment_text": "KLM & AF do code share flights. If both your flight sectors are booked on the same flight ticket itinerary, your bags will probably be weighed & checked in @ Paris, all the way through to Amsterdam, as these are all within the EU.\n\nYour hand luggage will be assesed at each boarding gate, ie in Paris & also Florence."}]}, {"id": "2211284752603936", "text": "Hi there,\nI’m looking for a place to stay at the end of this month for 2 nights in Rome for 2 adults 1 child any recommendations?", "link": "facebook.com/groups/1373361046396315/permalink/2211284752603936/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.kqzyfj.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187791-d2031\n81-Reviews-Hote\nl_Condotti-Rome\n_Lazio.html"}]}, {"id": "2210984192633992", "text": "Traveling to Italy in October, I am flying in and out of Milan. Any recommendations for hotels/airbnbs and restaurants in Milan, Reggio Calabria, and Messina.", "link": "facebook.com/groups/1373361046396315/permalink/2210984192633992/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.anrdoezrs.ne\nt/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187849-d1949\n76-Reviews-Hote\nl_Spadari_Al_Du\nomo-Milan_Lomba\nrdy.html"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "reggio https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187777-d1825\n940-Reviews-Al_\nCastello_Luxury\n_B_B-Reggio_Cal\nabria_Province_\nof_Reggio_Calab\nria_Calabria.ht\nml"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Messina https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187889-d1238\n4034-Reviews-Vi\nlla_Pulejo-Mess\nina_Province_of\n_Messina_Sicily\n.html"}, {"username": "Curtis Thornton", "comment_text": "Of course you come out here right after I leave. That's just rude, Cara."}]}, {"id": "2211041435961601", "text": "This will bring the trip to life and enhance the visit next year", "link": "facebook.com/groups/1373361046396315/permalink/2211041435961601/", "likes": 0, "comments": [{"username": "Jaime Cleek", "comment_text": "What will?"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 8, "comments": []}, {"id": "2211087272623684", "text": "Looking for recommendations for an AirbnB or VRBO in Florence. We will have 4 couples. Would love a place secluded with beautiful views which isn’t terribly expensive! Yea, I know😔😔", "link": "facebook.com/groups/1373361046396315/permalink/2211087272623684/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.dpbolvw.net/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187895-d7730\n220-Reviews-Bed\n_and_Breakfast_\nLocanda_di_Mosc\noni-Florence_Tu\nscany.html"}]}, {"id": "2210962742636137", "text": "Looking for kid friendly restaurant recommendations in Venice?", "link": "facebook.com/groups/1373361046396315/permalink/2210962742636137/", "likes": 0, "comments": [{"username": "Kally Trahearn", "comment_text": "Italian restaurants are almost always family friendly. Try not to get into the tourist trap restaurants that have pictures of food - get off the main square to get a decent meal at a decent price."}]}, {"id": "2210866739312404", "text": "Hello guys! Any recommendations\nof day trip tours from\nFlorence to Cinque Terre? Where to buy?", "link": "facebook.com/groups/1373361046396315/permalink/2210866739312404/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Florence/\nCinque-Terre-Hik\ning-Day-Trip-fr\nom-Florence/\nd519-5070CINQUE?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}, {"username": "Debbie DiOssi", "comment_text": "Viator has a great small group day trip."}]}, {"id": "2210878649311213", "text": "Italian dopamine color matching town, dreamy and healing", "link": "facebook.com/groups/1373361046396315/permalink/2210878649311213/", "likes": 842, "comments": [{"username": "Angie Mattin", "comment_text": "We were there 2 days ago 🥰"}, {"username": "Barbara McMahon", "comment_text": "Absolutely beautiful!"}, {"username": "Ivette Lugo", "comment_text": "it’s beautiful, should i cancel my Rome itinerary and go there?"}, {"username": "Randi Beasley", "comment_text": "Where is this?"}, {"username": "Pamela Schnitzer Stebila", "comment_text": "Phyllis Schnitzer\nAngie Schnitzer Walton"}, {"username": "Jaira Mara", "comment_text": "♥️♥️♥️"}, {"username": "Karen Klipple Buron", "comment_text": "Emma Buron ^Procida…"}, {"username": "Karen M Gahrns", "comment_text": "Gorgeous!"}, {"username": "Jim Anthony", "comment_text": "Lucee Mclean Procida, near Naples"}, {"username": "Darryl Kinson", "comment_text": "Beautiful!"}, {"username": "Olivia Harrison", "comment_text": "In love"}, {"username": "Claudia Mckenzie", "comment_text": "Meg Maria"}, {"username": "Lyn Pappas Dahm", "comment_text": "Was there in 2019! Beautiful island\nLove your pics\nMuch less crowded than the AC"}, {"username": "Maureen Tash", "comment_text": "Oh my gosh😱so incredibly beautiful."}, {"username": "Trish Austen", "comment_text": "Is it easy to visit both Procida and Salerno in the same day .. We have 1 day in Naples ? Thank you"}, {"username": "Dianne Parisi", "comment_text": "Wow beautiful!!!"}, {"username": "Jade Illiano-Smith", "comment_text": "Che bella procida"}, {"username": "Hanni Perathoner", "comment_text": "Wo ist das welche Stadt"}, {"username": "Kelly Martin", "comment_text": "Nicola Francis x"}, {"username": "Teresa Prophet", "comment_text": "Absolutely beautiful photos, will put it on my ever growing list of places I want to visit 😂😂"}, {"username": "Erna Torres-Saguilig", "comment_text": "I love Procida! Hoping to go back someday"}, {"username": "Runn Cynn", "comment_text": "Omg. Ridiculous!!! So want to go and just relax and drink my cappuccino!!!"}, {"username": "Nina Gosto", "comment_text": "Leon Šehić"}, {"username": "Zuney Rojas", "comment_text": "Elisa Zarate ya casiiiii amiga"}, {"username": "Denise Skinner", "comment_text": "On my list for next year 🥰"}, {"username": "Diana Hesse", "comment_text": "What do you mean by dopamine colour matching?"}, {"username": "Joanna McLachlan", "comment_text": "Jesse McLachlan !!! 😍😍😍"}, {"username": "Tania Lirette-Seppala", "comment_text": "Curtis Seppala"}, {"username": "Krista Cortez", "comment_text": "Lynn Golenor Cortez Susan Davis Phillips"}, {"username": "Kelly Young", "comment_text": "Judy Young"}, {"username": "Linda Johansson", "comment_text": "What area is this?"}, {"username": "Linda Johansson", "comment_text": "What area of Italy is this?"}, {"username": "Martine Huguet-Latour", "comment_text": "Where it is?😲"}, {"username": "Nadia Mckenna", "comment_text": "WoW they look like paintings"}, {"username": "Sarit Rolnik", "comment_text": "Add the location please!"}, {"username": "Victor Sessin", "comment_text": "Elad Landman"}, {"username": "Daele Dobson", "comment_text": "Beautiful photographs!"}, {"username": "Cris Montenegro", "comment_text": "Great pictures!!"}, {"username": "Ilse Opdecam", "comment_text": "Procida"}, {"username": "Dana Guidotti Rooney", "comment_text": "..and the Location is?"}, {"username": "Pam Lewis", "comment_text": "very nice, thank you"}, {"username": "Barbara Pasteris Allen Hettlinger", "comment_text": "It's Procida -- easy boat ride from Naples. Beautiful island, not a lot of tourists and very walkable. Highly recommend!"}, {"username": "Danielle Williams", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Amy Rountree", "comment_text": "Beautiful pictures!"}, {"username": "Etschi Bruckner", "comment_text": "definitely one of my fav spots - I go there almost every time I´m in Napoli. And I´ve got a friend with a gorgeous albergo there"}, {"username": "Joelle McClure", "comment_text": "Maria Bowers"}, {"username": "Sue Graham", "comment_text": "Stunning!"}, {"username": "Donna Wynne", "comment_text": "Lesley Greasley 🤩"}, {"username": "Cristina Cris", "comment_text": "Procida is so beautiful 🤩"}, {"username": "Fran Siebert Roberts", "comment_text": "Is this the Almafi Coast?"}, {"username": "Claire Rodgers", "comment_text": "Looks like Procida"}, {"username": "Claire Rodgers", "comment_text": "Unfortunately when we were there is was lashing with rain. Stunning"}, {"username": "Afaf Elbaakili", "comment_text": "Fascinating ❤️"}, {"username": "Valerie Miller Studer", "comment_text": "Gorgeous pics!!"}, {"username": "Alyssa Delossantos", "comment_text": "Anthony Giusti"}]}, {"id": "2210891589309919", "text": "We are going on our Honeymoon the first 2 weeks of October. We will go through Rome, Cinque Terre, and Florence. My fiancé’ has agreed to let me visit ONE spooky, haunted, supernatural place or something ofआणखी that nature while we’re there. Any suggestions in any of those areas? 👻\n\nPic of the most Italian looking spot we could find in the Midwest for our engagement photos so post doesn’t get lost.", "link": "facebook.com/groups/1373361046396315/permalink/2210891589309919/", "likes": 22, "comments": [{"username": "Jenny Li", "comment_text": "Whatever place you choose, remember to keep an open mind and enjoy your honeymoon! 👻"}, {"username": "Alessandra Mariella", "comment_text": "Museo e Cripta dei frati cappuccini in Rome!!\nYou will not regret it!"}, {"username": "Laura Ortiz", "comment_text": "I would look into Pompeii! I also found that Airbnb experience for Florence."}, {"username": "Laura Ortiz", "comment_text": "Laura Ortiz"}, {"username": "Aaron Peterson", "comment_text": "go to the Catacombs in Rome they have a few tours that would fit your needs"}, {"username": "Joellen Baltimore Leo", "comment_text": "Santa Maria della Concezione dei Cappuccini in Rome"}, {"username": "Holly Aley", "comment_text": "Catacombs!!"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Catacombes of San Callisto and Cripta dei Cappuccini in Rome."}, {"username": "Melinda Bryant", "comment_text": "Melinda Bryant"}, {"username": "Simona Franzini", "comment_text": "Ciao! If you plan to travel by car, I suggest to visit Il Parco dei Mostri. It’s truly a unique place, for the presence of grotesque sculptures scattered in a surreal landscape, is the oldest sculpture park in the modern world…about an hour and a half by car from Rome. I’m italian so feel free to ask For any advice and enjoy your honeymoon😊"}, {"username": "Debbie Potter", "comment_text": "I'm surprised you're not going to Venice. It's known to be a romantic city."}, {"username": "Amelia Alati", "comment_text": "Nice that he’s letting you."}, {"username": "Kimberly Luten Smith", "comment_text": "Just wanted to say, great picture!"}, {"username": "Ed Wren", "comment_text": "Vatican Necropolis"}, {"username": "Nancy Lewis", "comment_text": "He will “let you” do something you want? That’s your biggest problem. If you need his permission to do what you want???\nI supported every hobby it interest my husband had and he supported mine. We both learned to share each others interests. We never ever asked each other for PERMISSION to do anything in 49 years!\nGood luck."}, {"username": "Tessa Hanks", "comment_text": "Dusty McKenna Eckmann"}, {"username": "Lynn Fotia", "comment_text": "Cute picture. Sounds like a fun honeymoon."}, {"username": "Ishbel Raffle", "comment_text": "You should visit as many as you want! It’s your honeymoon too!"}, {"username": "Debra Quinney", "comment_text": "Sacro bosco sculpture parc fantasy and grotesque sculptures"}, {"username": "Jessica Stewart", "comment_text": "Congratulations\nmy husband and I will be going on our honeymoon/ anniversary and will be there the first week of October!"}, {"username": "Grace Kelly", "comment_text": "Didn’t think about the catacombs until people started posting it here 🤩 I’ll convince my boyfriend to do this in our trip next week 🙌🏻"}, {"username": "Ashley Naccari Jacobs", "comment_text": "Church of the dead le marche!!! https://\nwww.deliciousita\nly.com/\nle-marche-itiner\naries/urbania"}, {"username": "Paul Davis", "comment_text": "Michelle Donley: check out the Capuchin crypt."}]}, {"id": "2210918755973869", "text": "Wondering if everyone does their own planning or if anyone uses guided tours?", "link": "facebook.com/groups/1373361046396315/permalink/2210918755973869/", "likes": 31, "comments": [{"username": "Julie Gayde Benden", "comment_text": "I’ve always been the trip planner in the family. It can be quite stressful. I just finished up a trip with my daughter and chose Trafalgar this time. I wanted to be taken care of this time. And I wanted to just be less stressed. It was the best trip ever. Our tour director was phenomenal and took care of all the details. We waited for nothing! No lines for all the things with long lines! We had plenty of free time to explore on our own and optional experiences that cost extra if we wanted to join. All transportation was taken care of including airport transfers."}, {"username": "Mary Paron", "comment_text": "Both! We used Viator for some that worked out well"}, {"username": "Cheryl Gorfinkle", "comment_text": "Tours by locals"}, {"username": "Carmine Napolitano", "comment_text": "We went on a long vacation to Italy so we figured we would use a travel agent to help us out because of the multiple stops turns out the agent screwed a couple things up that we could have just done ourselves so my take on it is you can screw up your own trip for free I heard Costco does nice packages"}, {"username": "Alexandra A Welker", "comment_text": "I usually do most of the planning, then get one or two guided tours. I got a guided tour for the Vatican/\nSistine Chapel. And since I bought the City Pass, entry tickets for the Colosseum and a few other attractions were included and we did it ourselves. I have used Viator, Get Your Guide, TripAdvisor"}, {"username": "Russell Weidner", "comment_text": "I have always planned our trips and excursions. Use Rick Steves books by country/area as a base guide"}, {"username": "Carmen Higham", "comment_text": "Both…but more me!"}, {"username": "Cindy Breneman Hattrich", "comment_text": "I am using a guided tour cause I don’t want to plan or get tickets or stand in line or worry if I will get to the place in time or use gps or do anything but drink wine and eat gelato and pasta"}, {"username": "Claudette Nadal", "comment_text": "I do both. I’ve been on Trafalgar tours and Rick Steves tours and prefer Rick’s tours. Saves lots of hours of research that’s for sure I also like to combine this with a week or two or travel planning my own itinerary. It’s a good balance!"}, {"username": "Sue Ellen Thomas", "comment_text": "Rick Steves book on Rome is what I read and picked and chose what we saw! Excellent book"}, {"username": "Mark R Palladino", "comment_text": "We are doing our own planning and it’s our first time in Italy. Nothing better than a good adventure!"}, {"username": "Graham Sherlock", "comment_text": "Do it yourself, you don't grow if you don't do stuff for yourself"}, {"username": "Sabrina Sofia", "comment_text": "I plan my own\nIt’s not that difficult"}, {"username": "Leisa Lyons Kube", "comment_text": "I am doing my own planning"}, {"username": "Rick Pierangeli", "comment_text": "Both"}, {"username": "Cheryl Blewitt Slavik", "comment_text": "I just did one of the Rick Steve’s tours"}, {"username": "Ula Wojnar", "comment_text": "Do my own everytime"}, {"username": "Patti Bauman Widener", "comment_text": "We do our own planning."}, {"username": "Pamela Jones", "comment_text": "We are in our mid 60's. We're presently away for 5 months- on a budget!!, but some of our grown children joining us for 2 weeks in Italy. Planned & booked everything myself. Here's some examples of Italy that I put into the itinerary for other family members."}, {"username": "Pamela Jones", "comment_text": "Pamela Jones"}, {"username": "Miġueł Péręz Martínəż", "comment_text": "A combination of both. Plan and book by ourselves but algo hire tours in the city."}, {"username": "Deborah Gold", "comment_text": "We always do our own, unless we are going somewhere that requires a guide while we are there. We love the joy and excitement of planning. I go to the Library for guidebooks, and use the internet to compare what we are reading and update it, or to research further. He spends hours on the internet searching accommodations and then we make choices together. It’s an occupation of its own, and a part of the whole experience. It can be a bit stressful but it’s worth it."}, {"username": "Wendy Palmer", "comment_text": "I do my own but I wish we had done a guided tour through Pompeii. I think we would have gotten more out of it."}, {"username": "Larry Reinier", "comment_text": "We use Rick Steve’s and Gate 1 tours. We plan some on our own. You get wat more out of a tour with knowledgeable guides"}, {"username": "Rita Ferragine Poole", "comment_text": "We did our own planning and it worked out fantastic. We don’t like to be overly scheduled. If you do your research and have the logistics booked, the rest is easy to manage."}, {"username": "Dawn Teach", "comment_text": "My own"}, {"username": "Caterina Liquori-Culhane", "comment_text": "I took a tour. I like everything planned. And we had enough free time. Im ready to just do a few places next time. Will book myself"}, {"username": "John Spensieri", "comment_text": "Easy to plan if you have the interest and time. So many resources!!"}, {"username": "Lindy Brophy", "comment_text": "I’ve only done my own planning. ￼Flights, hotels, ground transportation and any other aspects of travel planning. No regrets."}, {"username": "Lynn Tritscheller Agnew", "comment_text": "I did all of the planning, but I used an app called wander log"}, {"username": "Jacquie Johnston", "comment_text": "I always do my own planning, I love doing it."}, {"username": "Holly Taylor", "comment_text": "I’m doing my own."}, {"username": "Angelina John", "comment_text": "My own planning!!!"}, {"username": "Annabella Pojer", "comment_text": "I always do my own 😀"}, {"username": "Sharyn Lockwood Allan", "comment_text": "We’ve just planned and booked our first Europe trip for next year"}, {"username": "Todd Trnka", "comment_text": "Planning myself. Always better."}, {"username": "Beth Stewart", "comment_text": "I Will be using guided tours as we are too old now to drive in Italy! Doing Canadian battlefield tour in 2024"}, {"username": "Teri Kirkland", "comment_text": "We are using Avanti Tours for private tours and bookings for hotels."}, {"username": "David Davey", "comment_text": "Problem with without proper guide are you will miss many fine details, history, and nuances of area. If you know all about the area why bother to going. Let’s marinade that for while."}, {"username": "Victoria Williams", "comment_text": "Absolutely my own. I can go wherever i.want and tweak if necessary"}, {"username": "Jaime Cleek", "comment_text": "We do our own and don’t even plan any tours"}, {"username": "Jo Ann Schwartz Woodward", "comment_text": "Combination"}, {"username": "Juliet Lee", "comment_text": "Own planning for sure"}, {"username": "Leslie Goodland", "comment_text": "Did my own planning. Loved every minute of my solo travels."}, {"username": "Shelagh Kosinski", "comment_text": "We do both."}, {"username": "Marie Imperial", "comment_text": "DIY."}, {"username": "Carmen Folgueiras Weisz", "comment_text": "I love planning my trips. It’s part of the experience!"}, {"username": "Evy Fredy", "comment_text": "Plan& book by myself now for my trip coming up in October to Sicily, I’ve done it last fall for my trip solo in Venice, Rome, Naples & Amalfi, everything went well! I enjoyed it!"}, {"username": "Karin Harmsen", "comment_text": "We just got back from a 17 day European vacation - Switzerland, Germany, Austria and northern Italy - and I planned the whole thing for our family group of 18 people. It wasn't easy, and I was born and raised in Germany. But now I really do feel accomplished! 😉"}, {"username": "Steve Wolfrom", "comment_text": "Some people have a lot of time, some don’t. ￼"}, {"username": "Caroline Basford", "comment_text": "All ways plan ourselves all the fun x"}, {"username": "Bonnie Loftspring", "comment_text": "Went on my first organized tour last May to Italy, I won’t do it any other way now. Yes, you are paying a premium for the experience of everything, I mean everything being taken care of. Perfect for an older couple who’s hubby gets anxious while traveling. We had a great time because he was at ease not to mention TAUCK is a high tier organization w great hotels, & great tours all arranged."}, {"username": "Peter-Sue McWilliam", "comment_text": "We spent 2 weeks in Italy first week Limone Lake Garda did our own bookings from home New Zealand stayed in Airbnb was magic just loved it, then we booked Backroad Tours Tuscany Treats starts in Florence couldn’t fault it far exceeded our expectations so nice to visit place’s off the Tourist route, every day was so different, highly recommend"}, {"username": "Sue Perks", "comment_text": "I like to decide where when and how long I get to stay there. And when i eat my meals 😊"}, {"username": "Bea Kuckens", "comment_text": "We do our own. My brother and his wife are doing a Roads Scholar. Our trip of almost a month isn't costing us much more than their 12 days. Depends on what's important to you - we like our independence, they want everything handled for them."}, {"username": "Christine Matthews", "comment_text": "get a rick steeve's guide book. perfect jumping off point to organize your own trip. He gives real usable advice - hotels, restos, in all price points and must see museums etc."}, {"username": "Angela Marsala-Gaydos", "comment_text": "I am a newbie to solo travels and after friends bailed I bravely booked a tour of Italy with Firebird Tours in mid October. Hotels, transportation and daily morning tours with afternoons free to wander. Breakfast included but dinner will be a magical experience tasting my way through Italy."}, {"username": "Susan L. Arnold", "comment_text": "Depends on where you are going."}, {"username": "Larry M Murray", "comment_text": "We planned our trip and then took it to a travel agent who put it all together in the right order and made recommendations\n. It worked perfect for us."}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "A mixture of both. It's a lot of fun."}, {"username": "Maritza Marquez Nickerson", "comment_text": "Combo of both for me"}, {"username": "Nina Sikand", "comment_text": "Own as easy enough!"}, {"username": "Sherri Leis Dillavou", "comment_text": "Always my own no matter what country I’m going to"}, {"username": "Matthew Livio Conti", "comment_text": "Neither? We only plan what we want to see, not when we go (unless reservations are required). Everything changes after your plane is delayed, you can't find your hotel, you get lost driving, you want to stop somewhere you didn't plan to, etc..."}, {"username": "Maria Musumeci", "comment_text": "Both 👌"}, {"username": "Brian Osman", "comment_text": "I've done both"}, {"username": "Rose Wolschlager Hinman", "comment_text": "I did my own and went solo."}, {"username": "Mandy Jonas", "comment_text": "Planned my own trip and it was wonderful! My own time, my own interests. Rome, Sorrento, Amalfi, Florence, San Gimignano, Sienna, Venice"}, {"username": "Annette Tamminga", "comment_text": "Love guided tours."}, {"username": "Wendy Spano Bracco", "comment_text": "I worked very closely with an agent to plan our trip. We have been talking 1-2 days a week for a year. We have private tours booked through one company and the hotels arranged the rest."}, {"username": "Kim Geary Keidel", "comment_text": "We booked some private tours and did some on our own. Did a lot of research!!"}, {"username": "Shawn Galbraith", "comment_text": "I love the planning stage! No tours needed."}, {"username": "Susan Vogel", "comment_text": "Both"}, {"username": "Janine Brailsford", "comment_text": "Both"}, {"username": "Karen Posey Dilks", "comment_text": "Guided is better then you can go back later if you want"}, {"username": "Tricia Bean Scott", "comment_text": "Typically we do our own research & planning."}, {"username": "Deanna Gasparott Kelley", "comment_text": "I found that if I hire a tour guide, I learn so much more and therefore am more interested in the attractions."}, {"username": "Vicky Alger Skillman", "comment_text": "My daughter and I planned! We are the best travel agents we know!✈️🇮🇹"}, {"username": "Mari Vee", "comment_text": "Guided tours… saves me the headache and stress of planning things, etc. We always get plenty of time to do what we want on our own as well. We’ve traveled with Trafalgar and Globus Tours 8x all over Europe and Israel so far."}, {"username": "Kristen Taylor", "comment_text": "I do both."}, {"username": "Alice Dzimiera", "comment_text": "I don't like tours but it's individual preference. I've been to Italy 5 times & have gone on my own."}, {"username": "Lisa Adams Robertson", "comment_text": "Both! We do a guided tour, then plan time on our own before and after the tour. It's worked out well for us."}, {"username": "Jamie Mariano Heckelman", "comment_text": "I’ve done both. In either case, it is important to know “how” you want to travel—jam-pack\ned with activities; a mix of busy days/1/2 days and then free time; are you flexible or do you need a set schedule? This site does help a lot! And when doing it yourself, the planning can feel overwhelming at times. In either case, you can’t go wrong!"}, {"username": "Peggy Frasca Prichard", "comment_text": "We are using a travel agent and private tours for Vatican, coliseum, Capri boat tour, positano, tour of Tuscany and a walking tour of Florence. We will do some self guided exploration as well. Staying in Florence, Rome and Sorrento."}, {"username": "Sara Punis", "comment_text": "For Italy my own plans"}, {"username": "Jan Lumberg Kupczyk", "comment_text": "We have done both, but.....now guided tours. We are in our 70's and frankly love not getting lost, not finding our motel, etc. When I have gotten sick, the tour guides have been amazing!\nAnd we have met many, many dear friends from all over the world. ❤️"}, {"username": "Alan Coe", "comment_text": "Always my own. Use Tripadvisor a lot."}, {"username": "Angie Mattin", "comment_text": "99% own planning"}, {"username": "Grace Scinto", "comment_text": "I prefer to do it myself as I get better deals dealing directly with hotels etc."}, {"username": "Elena Eckley", "comment_text": "I do a combination of both"}, {"username": "Carolyn Dahl", "comment_text": "Doing my own planning with help from Rick Steves."}, {"username": "Isabelle Truong", "comment_text": "I love doing my own research and planning, then add on extra things once I arrive the destination"}, {"username": "Renae Larcus", "comment_text": "We plan our own trip but we will do a day tour or half day tour. We are not tour group people."}, {"username": "Kim Briggs", "comment_text": "Always my own planning. More value for my buck and researching trips give me joy"}, {"username": "Terry Pisano", "comment_text": "Using a tour but mostly planning my own experiences. It seemed overwhelming at first... now I wish I had just done it all myself. But no regrets!"}, {"username": "Stephanie Share St John", "comment_text": "I do both, depends on where and with whom"}, {"username": "Virginia Speedy", "comment_text": "Two months of travel...planne\nd it myself."}, {"username": "Lori Haines", "comment_text": "We leave on the 26th for 2 weeks, decided to do a tour for first time there. We added alot of additional excursions. I know it will be tiring but believe it will be a trip of a lifetime. We can sleep when we get home.😁"}, {"username": "Elizabeth Dancy", "comment_text": "Both"}, {"username": "Maruchi Santana", "comment_text": "I plan all the trips, and use in country private guides for mayor sites, they help me purchase tickets, transportation…\nI plan 6 months in advance using Rick Steve’s guides, bloggers, and Context Travel lectures."}, {"username": "Marianne Kathleen McCrary", "comment_text": "Both"}, {"username": "Tari Lawson", "comment_text": "I doy own planning but sometimes use the services of a travel agent when booking. I have not done a group tour mostly because I like to do things on my time and don't want to travel with large groups. I might try a group in the future, depending on where I am traveling."}, {"username": "Todd White", "comment_text": "Did my own planning. One week in Paris. Then we flew to Barcelona for an 8 cruise to Italy. Recommend travel insurance."}, {"username": "Wayne Brown", "comment_text": "Always my own, its part of a holiday imo"}, {"username": "Heather Ann", "comment_text": "Both times I did my own planning"}, {"username": "Lavinia Pelliccione", "comment_text": "I think it really depends if you’re a good planner on your own. I’m not so guided tours was the smarter choice for me."}, {"username": "Barbara Bastianini", "comment_text": "I always plan my own trips everywhere."}, {"username": "Vicki Brozovich", "comment_text": "We did both. Viator expensive, but never disappointed us"}, {"username": "Robin Barbera", "comment_text": "Been doing my own planning for years. Part of the fun of the trip is the journey ti get there"}, {"username": "Karen Espinoza", "comment_text": "My own"}, {"username": "Karen Espinoza", "comment_text": "Favorite places I wan to go\nHow to get there\nSearch the flights,map, the distance between places, after that the hotels or Rbnb"}, {"username": "Andria Saia", "comment_text": "It is so easy to plan for travel in Italy don’t be intimidated 😊"}, {"username": "Fetchin Gretchen", "comment_text": "Both."}, {"username": "Lynn Dye Shell", "comment_text": "We went for 10 days in July and I planned it all. It was my first time traveling internationally\nand I did lots of research and got a lot of tips and advice off of Italy travel pages on FB. It’s a lot of work but I really enjoyed it."}, {"username": "Shirley Lewis", "comment_text": "I think it depends on whether it's your 1st trip; if so, then I would suggest a guided tour, or if you're anxious about travel."}, {"username": "Phyllis Flowers", "comment_text": "I have done both, pros and cons to both. I do like some of the high end things the tour companies can do. You can plan your own as most people here do. Just alot of time, research, and you own it when things go wrong. But you can save money. Plus I like the advise of a place that exclusively does nothing but travel to Italy and has access to drivers, unusual places, etc…"}, {"username": "Sarah Pierce", "comment_text": "I’ve done both!\n\nI love a guided tour if you don’t have much time to plan. They are a little more expensive, but you just have to show up. That’s the beauty of it!\n\nPlanning can be fun though if you have the time."}, {"username": "Kit Nader", "comment_text": "Own\n... I like to be casual during travel not forced to something because I booked it and feel obliged to do it...even though I don't now really want to."}, {"username": "Judy Kroeker", "comment_text": "Heading over in a month with tour group because my hubby is one who gets anxious about being at a place 30-45 minutes beforehand - not even possible when switching trains etc. it allows him to relax and enjoy more therefore so can I. Many meals, transportation and lodging as well as city tours and venue entries all taken care of. Yes, it costs more and I never thought I would do one, but it is more relaxing. Second time with this company into Europe. Where it is a language I speak and read, I do my own planning, and yes, planning is wonderful, fun and anticipatory. I believe in extending the holiday through (1) research, planning and booking\n(2) actually being on holiday\n(3) going through pics and trashing some and choosing the best couple hundred to make a memorable book with."}, {"username": "Connie Rai", "comment_text": "It's great to plan your own trip bit also very time consuming and lots of times you miss a lot of the off the beaten path places. As the saying goes, \"a jack of all trades, a master of none.\" You use a dentist for dental work and don't do it yourself. You are a professional in your line of work so you should use a professional in Travel for your trips...someone\nlike myself with 30 years in the travel industry...has personally traveled extensively to all 7 continents and book individuals as well as leading SMALL PRIVATE CUSTOM GROUP TOURS! There is no better way and it is all booked without having to worry about admission fees, transportation,\netc. When you go to visit these awesome places, wouldn't you rather have a professional tour guide that is a historian and also a wealth if knowledge or read a tour book to determine what your visiting, etc? No comparison. Call Connie at 561-865-7484. Thank you"}]}, {"id": "2211061072626304", "text": "Italy- Sorrento —> FCO question!\n\nWe’re staying in Sorrento for five nights and want to head back closer to FCO for the sixth night since our flight leaves at 730am the next day. We’ll have already done Rome at this point.\n\nWe are looking at renting a car from Naples airport or train station then driving it up to somewhere near FCO with an airportआणखी shuttle. My husband is getting a IDP, can drive stick shift, & we’d avoid city centers. Is this drive worth it? Are there any hidden gems to stop along the way? We thought we’d leave early afternoon and make a day of it, but it seems like it’s mostly a boring highway drive?\n\nI’d also love to spend the night not at the airport hotel, so I would love any recs for a local town close to FCO!\n\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2211061072626304/", "likes": 5, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.jdoqocy.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g799531-d1491\n6730-Reviews-Fl\ny_Deco_Hotel-Li\ndo_di_Ostia_Pro\nvince_of_Rome_L\nazio.html"}, {"username": "Katia Macri-Roberts", "comment_text": "Think practically:\n\nYour flight leaves at 730am. You will have to be at the airport by 6am. You will need to be very close to FCO.\n\nIf you rent a vehicle in Naples you will be required to drop the car off most likely at FCO airport to the rental place. Sometimes this is not a quick procedure. They have to check the car over before you leave. Bare this in mind for your ultra early flight.\n\nPersonally I’d stay very close to the airport."}, {"username": "Charleen Siegler Schuss", "comment_text": "Stay in Ostia and visit Ostia Antica a wonderful ruin."}, {"username": "Stephen Henn", "comment_text": "We usually stay at Hotel Tiber which has an airport shuttle for small fee (6-8€). It is in Fiumicino and reasonably priced. It’s about 10-15 minute drive from airport."}, {"username": "Bill Gillespie", "comment_text": "I've done what your wanting to do a couple of times, so here goes. Get your rental car and head to Monte Casino, it's a Most beautiful Monestary that's has been leveled 3 times in its history. The exit for Monte Casino is marked going down the highway towards Rome. Use your own GPS on your phone, don't bother renting one. I would leave Naples between 930 and 10 so you can get there, tour this awesome place, then drive down to the town and pick a place to eat. That will probably have you leaving Monte Casino about 1:30 or 2, about 1.5 more hours to the airport, drop off the car, you'll be in no rush. I'll look up the hotel we are staying in again, it is the first hotel at the entrance to the river. It has a great pool on the roof and great views. I've always gotten a cab to it from the AP and took their shuttle in the morning. There are plenty of places for dining right down the street. The hotel name is Hotel Tober Fiumicino. Hopes this helps."}, {"username": "Steve Grossman", "comment_text": "If your flight is that early, you're going to be up in the middle of the night, the airport hotel is what we do in that case"}, {"username": "Andrew Mircovich", "comment_text": "In my humble opinion it is not worth driving . Take the train from Sorrento to Naples then get off and switch fir a train to Rome . Golden Tulip is a great hotel right next to the Rome Termini. You can take a train or a taxi is 50€ to FCO"}, {"username": "Rose Turdo", "comment_text": "Bolsena Lake"}, {"username": "Rose Turdo", "comment_text": "Hotel Ferrari in Naples .. inexpensive. I've stayed there 3 times traveling from Sicily to Rome for departure."}, {"username": "Lucrezia Folger", "comment_text": "No, there really isn't much along the way that's easy and convent to drive to."}, {"username": "Karen Lenthe Redett", "comment_text": "Ferry to Naples and get the train to termini. Then take the express over by the FCO airport to your hotel.\n\nDo not travel later in day so you can get rested as trains can be super late arriving."}, {"username": "Gena Kona-Mancini", "comment_text": "I left Sorrento at around 1030am, took the train to Pompeii and spent a few hours there before taking the train again to Naples where we could take a high speed to Rome. Stayed at a hotel near the airport to leave without stress the next day"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Lots of options very near the airport."}]}, {"id": "2210815639317514", "text": "I've been researching TIM cards, will they work with a Samsung S22 Ultra or Apple 13 Pro? Thank you in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2210815639317514/", "likes": 0, "comments": [{"username": "Chris N Lynn", "comment_text": "SIM cards? iPhone 13 Pro have ability to add an Esim. So does ultra."}, {"username": "Jessica Stewart", "comment_text": "Who’s your provider?"}, {"username": "Ian Beyer", "comment_text": "iPhone 13 still supports SIM cards. 14 does not."}]}, {"id": "2211068355958909", "text": "We are planning a trip to Italy for next May. Looking to fly into Milan￼, visit relatives, and then work our way to Croatia. Any recommendations where to stop and stay on our way from Milan to Croatia?", "link": "facebook.com/groups/1373361046396315/permalink/2211068355958909/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Trieste"}, {"username": "Berndt Weihs", "comment_text": "Trieste!!"}]}, {"id": "2210806815985063", "text": "Hi everyone! Posting anonymously because the group is public.\n\nSo! My partner and I will be visiting Italy in late October, and I have a couple of questions.\n\n1. We will be arriving in Rome at night. We estimate we’ll be checking in to our accommodations around 8PM-ish.\nMy question is: does anyone know of a golf cart tour we can take at that timeआणखी of night? It’s still relatively early, and we’d like a quick lay of the land when we get there.\n\n2. I’ve been looking at possible day trips from Rome on Viator, and there’s one that does the Amalfi Coast. Now, my question on this is, I know it’s a popular spot during the summer, but is it worth going late October/early November?\n\nThanks in advance, everyone! 😊", "link": "facebook.com/groups/1373361046396315/permalink/2210806815985063/", "likes": 7, "comments": [{"username": "Rosa Zordan", "comment_text": "Rome comes to life at that hour, so ditch your luggage and hop on a 'hop on hop off' bus. As your concierge for a map and that way if you get lost a taxi can take you back. The Almafi coast is a large area and beautiful all year round but I would recommend staying a night or 2. Definetly not worth just a day trip. Roads are difficult and train ok but still a bit far for just a visit and truely enjoy. You will be mesmerised. Enjoy"}, {"username": "Serenna Davies", "comment_text": "We took the train to Tivoli from Rome to see the gardens. (2hrs there) It was a great day out."}, {"username": "Lucy Casado-Martinez", "comment_text": "Just be careful to look at the fine print for these Amalfi tours as they change with seasons I.e. instead of going to positano they’ll go to sorrento instead. Sorrento is a good place but it’s just incase you were booking for positano instead."}, {"username": "Joey Chopra", "comment_text": "Wondering about #2 as well! Going early Dec."}, {"username": "Diane Janovas", "comment_text": "Wouldn't book a tour for arrival day. Too much pressure if plane delayed,lines at airport. Take a walk or hop on hop off bus"}, {"username": "Jenny Payne", "comment_text": "I’m going to Italy October/\nNovember as I take friends and show around Italy. I stay in a 3 star hotel near the termini called Hotel Nord Nuova,they allow you to leave luggage and go off if you want. I always wear rubber soles , sandals,sneaker\ns & in winter boots + cross body bag & I take a cabin size case. Don’t take the world , I only go with linen,silk,cott\non.need to cover shoulders and cover your knees ( google what is expected) last year hot in October getting cooler + maybe some rain ,so an umbrella or jacket🌻"}, {"username": "Michele Couzens Simourd", "comment_text": "As someone else suggested, if you go to the Amalfi coast, I would suggest you book a couple of days. You can take a Sita bus between towns, like positano, Praiano, Amalfi and Ravello. You’ll have to check the schedule for that time of year. Renting a car might be an option as it will be less busy but only if you are comfortable behind the wheel:)\nAlso check schedules for ferries, if you decide to go to Capri. Amalfi is beautiful!! Have a great time!"}, {"username": "Meghan White", "comment_text": "I just booked a golf cart tour through Viator this week for September. They did have a 8pm golf cart tour option"}, {"username": "Joanne-Peter Hart", "comment_text": "We were scheduled to check into our accommodation around 8pm. Due to heavy storms over northern Italy our plane was delayed several hours and we didn’t check in until after midnight.\nAlways a risk to have something booked as soon as you arrive as the unexpected can happen and you loose your money."}, {"username": "Dunia Aldyni", "comment_text": "Yes it’s worth Amalfi coast is amazing 🤩 visit lemon 🍋 garden have lunch there with view wall around eat seafood 😋😋😋😋😋it is delicious 🤤"}, {"username": "Giovanni Pianigiani", "comment_text": "Rome Amalfi is 5 hours driving (one way) or 3 hours by train"}, {"username": "Janet Messanelli Bozzone", "comment_text": "Don’t try to book anything on your first night in case you are delayed. Have dinner on a piazza like the Italians do and people watch and then walk around and soak in Rome at night. If you are going in late October, most places in Amalfi will be closed for the season. It will still be beautiful but I wouldn’t do a day trip from Rome."}]}, {"id": "2211296095936135", "text": "Will start out by saying I didn’t do my due diligence, but still looking for some advice. Bought tickets to fly JKF to FCO through Norse. Didn’t know they were that new of an airline, I’ve never flown to Europe before and just thought it was a European airline. Started following them on social media and I’m terrified now that our flight could beआणखी canceled because that’s all I’m reading. Should I buy back up tickets that I can cancel? I do have travel insurance, but I have hotels and excursions booked I don’t want to miss one day of this trip. This will probably be my once in a lifetime trip there and I can’t even sleep I’m so stressed out. Apparently their customer service is terrible too. No phone number and they only do paper tickets at the airport….also our flight leaves at 12:30am so if something does go wrong the airport is basically closed till later that morning. Anyone else flown with them? Thanks for any info or advice.", "link": "facebook.com/groups/1373361046396315/permalink/2211296095936135/", "likes": 12, "comments": [{"username": "Lisa Ann", "comment_text": "Following"}, {"username": "Janice Finn Clemans", "comment_text": "We just flew this same flight with Norse to Rome out of JFK a few weeks ago. Beautiful brand new plane. 787. It was huge. Plane was filled to capacity. The airport was crowded for the 12:30 flight like it was 10 in the morning. I didn't a lot of pricing and research and this price was by far the lowest. So much so, that my brother and his family drove from Boston to take the flight with us. Was very pleased with my decision to fly with them."}, {"username": "Joe LaLonde", "comment_text": "The stress is understandable,\nbut a few unsatisfied customers can be a lot more vocal than countless happy customers. If you buy the backup tickets you’ll actually just have two tickets to Europe, as you won’t know if Norse works out until it’ll be too late to cancel with a major airline, I’m pretty sure most majors leave earlier than 12:30 from NYC, the slot is probably cheaper and hence why budgets leave at the time. If it were me, I’d just take the chance with Norse, I bet you’ll be pleasantly surprised."}, {"username": "Daniella Grossman Kreiner", "comment_text": "My husband just flew Norse to London and he said it was surprisingly great. No issues whatsoever. He booked the premium ticket in the front rows, had tons of legroom and said the plane was a brand new Dreamliner."}, {"username": "Bindu Oommen Iype", "comment_text": "We just flew out of JFK on Norse to FCO last Sunday at 12:30 AM. Other than the plane being delayed about 45 min, they made up the time in the air and we got into Rome an hour early. Flight was great. It was a huge, new plane and I wouldn’t hesitate to book with them again. Don’t stress and enjoy your trip!!! 😊"}, {"username": "Faryal Abbas", "comment_text": "We booked flight to London from Washington DC as well hopefully it goes well for us too 🤞🏼"}, {"username": "Stephanie Ratcliffe", "comment_text": "people only tend to comment on social media when they have a bad experience, how many good flights do you get off and go yes I'll immediately post about my acceptable flight... none I'd guess. Just saying that the viewpoint may be slightly skewed..."}, {"username": "Dann Hrusch", "comment_text": "If you look on a site like FlightAware you can see the recent flight history. In the past 15 days NBT402 has departed everyday, with at most an hour delay. 12 of those flights arrived early. Seems pretty encouraging to me."}, {"username": "Jaime Cleek", "comment_text": "This can happen with any airline these days"}, {"username": "Aurora Villegas Flores", "comment_text": "We just flew home from London to NY on Norse.\nVery nice plane. I love their dimming windows.\nGreat service. No complaints."}, {"username": "Nancy Willson", "comment_text": "What is your departure date? I flew to Italy last September and worried for 6 weeks or so that my flight from DTW to JFK on Jet Blue would be delayed and I'd miss my flight to Milan. Without going to the long details I'll simply say that I tried very thing I could think of to get a different flight or time but nothing worked out (without paying a huge fare difference). So I feel your pain and panic. My flight was in deed delayed but I made it to the gate at JFK just in time to board for Milan. Please keep us posted on your status."}, {"username": "Sonia Scotto Lubrano", "comment_text": "United is canceling multiple flights a week from EWR to Napoli and Roma. (I’ve been keeping track)\n\nI really don’t think it matters what airline you book. The possibility of it being canceled is higher than it was 5 years ago"}, {"username": "Melissa Hitchner", "comment_text": "I would bet that every airline has negative comments on their social media, that is where people go to vent. I would monitor the flight that you're on on FlightAware and see how many times it gets delayed or canceled, but otherwise I wouldn't worry too much about it."}, {"username": "Crystal Waltz", "comment_text": "American Airlines delayed our trip by a day because of a delayed flight. We were able to extend it a day and booked an extra hotel room so as not to miss any of our time in Venice."}, {"username": "Cindy Hill Mangan", "comment_text": "My son flew home on Norse last week, no issues, nice Dreamliner!"}, {"username": "Hollis H McGuire", "comment_text": "Travel is all about things that can go wrong - but mostly things go right. Try to relax and believe what Joe LaLonde says - he’s right. Have fun!\nPS- travel requires being a VERY good sport. If you’re new at this, please allow me to tell you some obvious things that might not have occurred to you:\nAll important papers, passport, meds, stuff you just can’t lose, goes in your carry-on bag. (Pay attention to those weight restrictions!)\nWear comfortable shoes, choose clothes you look good in and remove half of what you’re planning to take. (Nobody cares if you wear the same stuff, and you can wash it in your hotel.)\nMake sure your CCs and passport are safely stowed - and make copies to put on your phone.\nHave a WONDERFUL trip. 😘"}, {"username": "निनावी सहभागी", "comment_text": "Thanks everyone. I am going to keep an eye on the flight and just hope for the best and stay away from the reviews!"}, {"username": "Jill Medrano Casey", "comment_text": "All airlines have been canceling flights and having delays lately. It's stressful and nerve-wracking up until you land at your final destination. 😭"}, {"username": "Annette Brin", "comment_text": "My 2 sense here -Many buy tickets that are cheapest and that low cost carrier have ZERO agreements with any other service providers- buyer beware! Cancel and buy your tickets with a reputable airline that if cancels will put you on another carrier. Less expensive for a reason. Know your rights as a passenger."}, {"username": "Annette Brin", "comment_text": "I never can understand the mentality to be honest when it comes to this question. Your recourse is just less period with these unproven low cost carriers. For example mechanical issue on Luftansa, they will absolutely put you on another carrier. Westher excluded. These carriers (start ups) have no agreement with others at bare minimum buy insurance for your trip."}, {"username": "Monique Anne", "comment_text": "American rebooked my connecting flight because of some stupid reason and I ended up sitting in the Uk for 71/2hrs waiting for my next flight."}, {"username": "Melanie Diaz", "comment_text": "I used Norse for my trip , I have no complains . I’m here in Europe now. So it was a good flight.\nBooked my flights last minute but everything has gone well."}, {"username": "Nicole Vidiri Silva", "comment_text": "We also just flew Norse from Paris and had no issues."}, {"username": "Lucrezia Folger", "comment_text": "Stick with what you have, they are still flying and all airlines in their history have had delays and cancelations, doesn't mean it will happen to you."}, {"username": "Susan Annette Wanta", "comment_text": "Get travel insurance!"}, {"username": "Tiffany Davis", "comment_text": "my kids did that airline and route last month with no problems"}, {"username": "Emily Ann", "comment_text": "I had a great experience with Norse, I would not worry… flew them to and from Europe in May and flying from Rome to JFK in october"}, {"username": "Robin Darmstadt Mancil", "comment_text": "I had the same experience with Neos. Booked the flight then saw horrible reviews. We had the BEST experience with them. Had a problem with email someone answered the phone! We will fly JFK to Milan just to fly them!"}, {"username": "Kim Carlton", "comment_text": "Be sure to get travel insurance for each person on your trip. Make sure it includes coverage for trip delays and cancellations. Always purchase travel insurance for international travel! Have fun! Italy is magical!"}, {"username": "Hindi Spivak Golden", "comment_text": "What site are you purchasing the flights from?"}, {"username": "Ruth Akutu Maccarthy", "comment_text": "I would cancel the ticket with them and book with another airline"}]}, {"id": "2211281215937623", "text": "What are public transportation options from Fiumicino Airport to area around Spanish steps ( staying at Borgononi Hotel)", "link": "facebook.com/groups/1373361046396315/permalink/2211281215937623/", "likes": 1, "comments": [{"username": "Rhona OConnor", "comment_text": "Check Google maps... It will show you the options"}, {"username": "Colleen Dawson", "comment_text": "Rome2rio app will give you all the information you need, options for mode of transportation,\ntime and approximate cost."}, {"username": "Rita Scotto Epifanio", "comment_text": "From the airport you can either take a taxi or the train. If you chose to take the train you’ll need to take the Leonardo Davini to Roma termini. From Roma Termini you can take a taxi to your hotel, which will be cheaper than if you take the taxi from the airport, or you can take the metro to the Spanish steps."}, {"username": "Janie Moore Kidd", "comment_text": "Thank you for the information"}]}, {"id": "2211285279270550", "text": "Do you have more room for luggage if you travel on fast train or first class?", "link": "facebook.com/groups/1373361046396315/permalink/2211285279270550/", "likes": 0, "comments": []}, {"id": "2211294192602992", "text": "What is the best ticket to buy to enter the Colosseum and the Vatican (I can't decide which ticket to buy and that I don't have to do or wait in line)?\n\nWe will have a window from 9:15 am to 7:20 pm what else can we do/see in Rome?\n\nThanks in advance !!", "link": "facebook.com/groups/1373361046396315/permalink/2211294192602992/", "likes": 2, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nDetailed-Itinera\nry-Vatican-Sist\nine-and-St-Pete\nrs-Tour-with-Pr\nivileged-Entran\nce/\nd511-24338P27?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "Pia Reilley Loughin", "comment_text": "Best Vatican tour is their 7:30 am tour. We had the whole place to ourselves.\nFor the Colosseum the underground tour was absolutely amazing! We had access to the gladiators entrance and arena floor."}, {"username": "Jaime Cleek", "comment_text": "Buy them direct"}, {"username": "Paul Anderson", "comment_text": "Get you Vatican ticket at the door after lunch. Almost no lines. Buy the night tour for the colosseum underground. Buy this ticket off site about 300 meters up the street. Again no lines"}, {"username": "Danielle Townsend", "comment_text": "There is a really cool museum in Rome not far from Trevi Fountain called Galleria Doria Pamphilj - Palazzo Doria Pamphilj it's really beautiful and not crowded at all"}]}, {"id": "2211300499269028", "text": "Hi! I purchased a Bagallini crossbody/backpack for our trip next month. It got here yesterday and the straps do not allow it to be a good crossbody over the, ahem, “girls”. Anyone ever use these and what are your thoughts?", "link": "facebook.com/groups/1373361046396315/permalink/2211300499269028/", "likes": 6, "comments": [{"username": "Sonia Smith", "comment_text": "I use something like those for my day pack. It makes it more difficult to get into your bag. Exactly what you want. You just have to be diligent to refastened them. ￼"}, {"username": "Kimberly Coury", "comment_text": "I’ve been using them the last 10 days here. Makes me feel better. More difficult to get into the important zippers."}, {"username": "Shannon Confortin", "comment_text": "We use them ( family of 5) and love them"}, {"username": "Barbara Kistler Wilhelm", "comment_text": "The pickpockets are professionals and I was a victim. Still dont understand how they got in my bag without me knowing. Just glad it happened on last day of my trip."}, {"username": "Jessie Billiet", "comment_text": "We used them and they worked well!"}, {"username": "Diane Leesmith", "comment_text": "Are these clips?"}, {"username": "Rochelle Yngks", "comment_text": "I use the S-Biner microlock. It is more secure."}, {"username": "Michelle Richardson Williams", "comment_text": "Thanks everyone!"}, {"username": "Walaa Hosny", "comment_text": "I just used them in my trip in July and it worked fine"}, {"username": "Janine Emma Lucas", "comment_text": "These are great, it’s what many of the travel security bags have on them and charge an arm and a leg!"}, {"username": "Jim Bobrowski", "comment_text": "S-biner is better. They make a lockable one"}, {"username": "Kevin Kappel", "comment_text": "Definitely good for zipper to zipper lock in crowded areas to avoid pick pockets"}, {"username": "Beryl Lato", "comment_text": "What are these called so ai can find them on Amazon?"}, {"username": "Linda Wetsel", "comment_text": "Never put anything in a backpack of value unless locked- backpacks are easily accessed by pickpockets- had a friend lose money and passport in a small gelato store with 3 friends in with her - no one saw him!"}, {"username": "Rosanne Messineo Mills", "comment_text": "Use a locking S clip instead."}]}, {"id": "2211301389268939", "text": "Hi, international caller newbie here. I can call my mate’s mobile in Italy from my landline in Oz at no charge. However, he’s worried that it will use up his data ?? Surely that cant be right? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2211301389268939/", "likes": 1, "comments": [{"username": "Ruth Hackert", "comment_text": "He should ask his carrier"}, {"username": "Isabelle Truong", "comment_text": "Depending on what mobile plan your friend has but when I travel overseas, and need to make calls to Australia, I use WhatsApp or messenger when I have free wifi then the calls are free and I don’t use up my mobile data."}, {"username": "Katia Macri-Roberts", "comment_text": "If they are just using the phone the old fashioned way (not through messenger or Skype etc) then your friend pays a hefty fee for your call too. If they are using an app they need to be in a wifi area. If not their data will be used. It’s best to turn data off when overseas anyway so as not to get a rude bill shock when arriving back to Australia!"}, {"username": "Allison Mir", "comment_text": "Use WhatsApp over Wi-Fi"}]}, {"id": "2210803929318685", "text": "Hi All! Thanks to everyone in this group! I have been reading and information gathering for several months. 😊\n\nMy husband and I leave for Rome in late September and are taking a cruise in early October. We have a stop in Salerno for the Amalfi Coast, and I booked a shore excursion through the cruise company for a “Private Motor Launch” toआणखी Positano. The boat ride is 75 minutes each way with free time in Positano. Can anyone give advice as to how big these boats are? My husband gets motion sick on small boats (for example, the parasailing boats in the Caribbean) but is okay with tender size and larger. I may need to cancel and go another route, but I have read the roads are also curvy and a ride to Positano would be interesting for him as well. Maybe I’ll just leave him on the boat 🤣 (Totally kidding) Thank you!!", "link": "facebook.com/groups/1373361046396315/permalink/2210803929318685/", "likes": 1, "comments": [{"username": "Lucy Casado-Martinez", "comment_text": "If you book a private transfer the roads are very scenic. It just depends on when you travel because I’ve always been told weekends are and therefore traffic is busier!"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Contact the cruise company that you booked with and ask them"}]}, {"id": "2210814709317607", "text": "My husband and I are going to Italy for 15 days in April 2024, we have been in touch with a travel agent but not sure we want them to book the whole trip. They have me a bit freaked out about train travel and transfers (not sure what those are) and I’m wondering if booking trains is really as difficult and expensive as they are making me think theyआणखी are? We are not high maintenance people, and I’m not intimidated by booking my own travel, but this is my husbands first trip abroad and I don’t want to mess up any travel between stops. We are planning on going to Florence, Rome, and the Amalfi Coast or Cinque Terra. The travel agent also warned against Cinque Terra saying getting around is very difficult. Any tips or advice would be greatly appreciated. Thanks!!", "link": "facebook.com/groups/1373361046396315/permalink/2210814709317607/", "likes": 53, "comments": [{"username": "Janet Borrello Peppard", "comment_text": "Create an account and Download the Trenitalia app. Super easy to book trains. Look for freccia rossa which are the fast trains. You can see how long the trip will be and can see any deals….prices vary quite a bit so take some time to look at the different options. Once you book you will have all the tickets right on your phone which the conductor will come around and scan. Business class is worth it if not much of a price difference. Also book specific seats when you can."}, {"username": "Fran Fitzpatrick", "comment_text": "Wether you have your agent arrange your train reservation or you do it yourself it is very easy. Just give yourself time to get acclimated to the station and ticket counters. There are info booths if you need them. We did Rome Tuscany Florence and Venice plus a day trip to Luca no problem."}, {"username": "Linda Pitler", "comment_text": "The train is fabulous and super easy with the app.\nI’ve never been to cinque terre but from what I’ve seen and read it’s fabulous. The 5 islands are linked, there is bus transportation or if you are a hiker there are trails to go from one to the other.\nCheck out Rick Stevees Rome/ lItaly series (3 episodes) on Amazon prime."}, {"username": "Kathleen Lunz-Gewirtz", "comment_text": "Visitacity.com for itinerary\nAnd\nViator for tickets\n\nSo easy!!"}, {"username": "Ann Carroll", "comment_text": "When unsure about how to get somewhere we search it on YouTube￼. We can usually find a good how to video for things like using the mass transit and using and getting to trains etc. ￼￼"}, {"username": "Paula Ann", "comment_text": "No way, trains are very easy. I planned our whole trip including our train travel. Good luck and enjoy your trip!"}, {"username": "Shelly Kentner Lehman", "comment_text": "Trains don’t cost very much at all"}, {"username": "Michael Foster", "comment_text": "Skip CT . Do Rome, Firenze, Amalfi Coast/Pompeii. If you can squeeze a few more days, Venice is mind boggling… you won’t see everything; but you’ll leave something for the next trip. Beautiful country, cities, people. Enjoy yourselves."}, {"username": "Georgina Mcauliffe", "comment_text": "I have been to Italy far too many times to count, often for months at a time and always self booked. All over the country. Pre and post app eras! I would go it alone personally if you like travel research. The Cinque Terre is a rather tricky one unless you have good walking legs or stick to boats but my advice if you really want to go there would be stay outside the villages and travel in early or later in the day by train or boat. The villages are lovely in the evenings. Levanto or Santa Marguerita are actually really good places to base yourself that mostly Italians and French frequent. The main thing that can rarely really throw you with trains - apart from not validating a paper ticket before boarding and them not announcing the platform until the very last minute (common so be very prepared, keep your eyes on the boards and know which number train you are on as it wont say your destination name unless its last or only stop) happen either with both agent or self booked and that is the dreaded Italian habit of throwing a \"sciopero\" (strike) into the mix at last minute at which point there is total generalised chaos for everyone - native and tourist. It's happened to me twice but over a 30+ year travel period. In fact on the way to the Cinque Terre from Milan once - a suitcase you can sit on proved to be awfully useful in such circumstances! We got there that night - eventually - and the bit the family now remembers is trying to find somewhere safe to stash the 6 year olds tooth that fell out whilst waiting...proba\nbly eating something sweet and chewy at the time. If you are in Florence make sure you plan time to see Sienna, San Gimigniano and Lucca. Different people fall in love with different things - for my husband Rome is the overall emperor, for one daughter its Florence, son is Venice, other daughter says its the Eolian Islands and for me its probably Sicily but I love everywhere! Except Como and driving the northern motorways... For some reason I cant bear the totally crowded tourist nature of Como whilst I put up with it better in Cinque Terre and Amalfi Coast."}, {"username": "Patricia Garcia Goddard", "comment_text": "My daughters are there right now and have fallen in love with this place!! They will definitely go back and recommend Cinque Terre!!"}, {"username": "Steve Ely", "comment_text": "Its easy, get the Omio app for trains and buses and take a battery pack with you. We travelled Italy for 10 weeks south to north with no problems. Enjoy the adventure.\nSafe travels."}, {"username": "Deborah Gold", "comment_text": "100 answers???!!! I think you’ve got more advice than you need without me chiming in. We bought our train tickets at the station I think, before getting on the trains."}, {"username": "Russ McCullum", "comment_text": "Sandy McCullum"}, {"username": "Elizabeth Fraser", "comment_text": "Any air bnb recommendations\n\nFor Rome?"}, {"username": "Lisa N Lennie Hales", "comment_text": "We went last July and booked everything ourselves. Found a cute air bnb in Riomaggiore. CT was my favorite place, don't skip it. You can ride the train between the towns and it is super easy...save your money and do it yourself!"}, {"username": "Tissie McClure", "comment_text": "Let the travel agent do it because I just got back from 33 days in Europe and yes it is summer break, but there were so many lines to get tickets! Our travel agent did it all, and the tickets were in our neat little spiral book she gave us and just no worries!"}, {"username": "Debbie Knebl Helias", "comment_text": "For my first upcoming trip to Italy in October I booked through Railbookers. I already started my own future trip back to Italy in May 2024 and I will do my own arrangements. The biggest advantage I see is they are able to “book” your train reservations earlier than I could. It may turn out to be more economical for my trip 2. We shall see. I also have been told by my travel agent friend my research is more detailed than any travel company would do. I hope this helps."}, {"username": "Jennifer Satter", "comment_text": "Www.Spectacular\nJourneys is fabulous! Highly recommend!"}, {"username": "Charvette Fernandes", "comment_text": "Super easy, you can book in advance, the website I use is www.trainline.c\nom and you can download the app as well."}, {"username": "Lois Midkiff", "comment_text": "There are tons of Youtube videos on anything you need. The Man in Seat 61 - seat61.com is an outstanding resource on both Facebook & Youtube."}, {"username": "Donna Parrish", "comment_text": "I plan my own European trips using Rick Steves’ travel books."}, {"username": "Sherry Somers Willome", "comment_text": "we used Rome Excursions Luca answered all my questions and was happy to do whatever we wanted as to time spent at places, etc Took us to Naples, Pompeii, city tour through Rome, etc. My SIL wanted to go by a Rome Harley Davidson to get a shirt and they were glad to take us there.....Recom\nmend!"}, {"username": "Amy So", "comment_text": "You can do it on your own. I would highly suggest pick either amalfi coast or cinque terre in one trip. Both places are out of the way to get to so don’t waste time in traveling to both. Between the two, I’d pick wherever will have the best weather in April. We went to the south (Rome, Orivieto, Sorrento based and went to Pompeii, Capri, Positano, ravello and amalfi coast last June and this June we did Venice, Florence with day trips to Lucca and Pisa, tuscany( Volterra and neighboring cities), cinque terre and Milan this June. Italy is such a beautiful country. We rented a car in both trips, took trains, and had private transfers. It was easy to navigate. You can start planning by reading Rick Steves Italy book. Good luck and have fun!"}, {"username": "Janet Ciantar Sultana", "comment_text": "Cinque Terre is easy to do. Go up with the train and then visit each one with the ferry, Corniglia only by train or car. You can also go trekking, there are the Sentiero degli Dei, Sentiero Azzurro and Sentiero del Amore."}, {"username": "Nina Sikand", "comment_text": "Just research and book in advance or when you arrive as we did from having explored the route and info. All straightforward\n!"}, {"username": "Amanda Davies", "comment_text": "I’ve used Trainline to book in several different countries including Italy, Slovenia, Austria and Poland. When trains are unavailable there are similar apps for buses. Flixbus is great. I’ve also booked ferries in Croatia in advance. I think that agents are increasingly out of touch with what’s available online and using groups like this one for useful tips is the way to go!"}, {"username": "Harriette Roxanne Booker Dorse", "comment_text": "Expedia"}, {"username": "Carol Thomson", "comment_text": "Use buses instead of trains. They are great to travel on, cheaper & get to see more countryside. They leave from train stations so just as easy to get to. Trains are fine to travel on as well. I am 1/2 way through from London, Paris, Belgium, Amsterdam, Florence flying out of Rome.\nLooks confusing when you start planning. Once you plan your destinations, then plan how to travel between."}, {"username": "Isagani Abalos", "comment_text": "Travel agency is not the best way to travel. Pick a city as your home base and do day trips from there. Download Rome2Rio app and AirBnb. You can make hotel or AirBnb reservations near central stations the day before. Plenty of selections."}, {"username": "Liz Mendygral", "comment_text": "We travelled around Italy by train and found it to be quick efficient easy to organise . I don’t think you would have to buy tickets ahead of time because April isn’t very busy\nWe purchased tickets at the station as well as through an online app.\nNo problems at all!\nHave confidence in your ability\nCinque terra is very easy to travel around - we stayed at Levanto and travelled out each day from there by train as well as walked"}, {"username": "Rosa Araújo", "comment_text": "Es fácil coger los trenes online y es muy cómodo viajar, ya ves los precios según horarios o rapidez del trayecto que desees. Cinque Terre en tren o barco parando en cada sitio también es bonito."}, {"username": "Sam Mah", "comment_text": "You can book online for Trenitalia (you might not be able to download the APP), you just have to register. Go and have a look at how much trips cost. If you want a fast train then yes you need to reserve a seat and yes the earlier you buy it (generally) the cheaper it is. Local slower trains are cheaper and you generally don't need to book ahead, you can either get a ticket at the station or online on the day you travel,"}, {"username": "Katherine Smith", "comment_text": "Train tickets get way more expensive the closer you get to your travel date."}, {"username": "Sally Ann Tanasi", "comment_text": "Hope everything goes well. I think I’d go to the Amalfi coast because you can go to Sorrento Capri Positano Amalfi Ravello Pompeii Herculean. I’d stay in Sorrento as a base"}, {"username": "Sara Kyle Hargett", "comment_text": "I used AAA to book all our travel, hotels and the excursions that I picked out. They did a great job! I would love to go back and explore the off the beaten path towns. I've seen some beautiful pictures of places that I haven't heard of"}, {"username": "Lisa Valdovinos", "comment_text": "I had a wonderful travel agent who took care of everything with no issues. We were gone for two weeks. She booked flights, hotels, private transportation,\ntrains and excursions. We were very happy with her. She was local to us which I think made a difference. We were able to meet her in person which made us feel at ease."}, {"username": "Debra Rigler-Arsenault", "comment_text": "We booked our flight tickets through a travel agent and so happy we did. Twice part of our flight has been cancelled and she has kept us informed of the changes and of alternative options. We would have stressed out trying to get things changed on our own. Booked our own accommodation and will figure out train travel when we get to Italy. But for us a travel agent has been worth it. Also the plane tickets and her low commission was even less than the tickets we were checking out before we went to see her."}, {"username": "Anna Gambino", "comment_text": "Book it yourself. I like to be in control of my trip. Working with travel agent now and having a hard time getting answers in a timely manner. I just booked trains for the first time even though I have been to Italy several times. They are not expensive. Paid about 45-60 Euro per person business class on Trenitalia. If you read these fb pages and do research, you will be able to do yourself."}, {"username": "Marie Ring", "comment_text": "We used the app to book trains and it was extremely easy. I’d recommend purchasing the trips in advance but I’d also recommend paying just a little more and getting first class seats. We did that and had so much more room- they were just a little extra but totally worth it!"}, {"username": "DeAnna Pulliam Like", "comment_text": "I should say... first and foremost... booking trains yourself is doable. We loved traveling by train! For more information on train travel... I recommend looking at https://\nwww.seat61.com/ We did book all of our own trains. We had 6 different train travel days. I think only one was direct. The others had 2, 3, or even 4 trains. The part that made it difficult was if the first train was delayed, you could miss the next one. We had 2 trains that were delayed enough, that we missed our next train. I had to go online once I knew what time we would be arriving at our connecting destination and book a different train. The real problem is if they are different train companies. So my second train that I had already paid for that we missed, was just lost $, because they were through different train companies. No recourse for delayed trains. I was able to find later trains online easily, and just come up with a plan b on the fly. That was fine and we were able to be flexible. Just a little later to our final destination, and out the $ for the missed train. The other thing to look out for (which I believe you'll find on the seat61 website), is when you take a train into a larger city, for instance, Milan, or Florence. There is more than one train terminal. Check your tickets to find out which train station you will be arriving at, and where the next one departs from. One of our trips brought us into Milano P Garibaldi, and the next train we needed to board left Milano Centrale. I looked up ahead of time how to get from one train station to the other, and how much time that would take. I factored that in when scheduling train times. It is doable. Just be ready to be flexible... and pay attention to the train stations. Lots of good info on the seat 61 website. That is what this guy does... travels by train everywhere."}, {"username": "Joanna Hovenden", "comment_text": "It’s 90 days exactly, download the app. Put in dummy dates the same day though & get exact time you want.\nThen when you are sure what you want, put in the correct dates, the train app, contacts your email immediately they are available & you can book.\nThey just then scan them on the train.\nIf you book way in advance thru an agent they are much dearer."}, {"username": "Lisa Akira", "comment_text": "Trains are so easy!!!! First know where you want to go. Download the Trenitalia app. (It has an English version). Pick your time. You search from pont A to pont B. Write down the train number!!!! If you have to transfer, meaning switch trains, it will specify that clearly, and you will get separate tickets to print (or save to your phone) for each train, but you will pay for the total trip.\nWhen you get to the rail station there is an electronic monitor just like an airport that lists all the train numbers, time, and what platform the train will be on. Go to that platform and get on your train. Boom. Done.\nI went all over Italy and Switzerland by train. Best thing ever and very reasonably priced. Just write down your train number because the stops, while listed, are trickier to grasp. The origin of the train and final stop are listed most clearly, but the intermediate stops scroll by. If you know your train number, you’re good to go. If you miss your train, or if you are super early, just go to the ticket counter and they’ll swap it out easily. No hassle. If in doubt just ask for help. I had zero problems on the trains.\nAlso allow fun time for boat rides! It’s a beautiful way to see the coastlines or lakes.\n\nConsider less touristy places too, like Tuscany or the Northern lakes. (Unless you love lines and crowds). The most “popular” places aren’t always the best."}, {"username": "Gay Polt", "comment_text": "I’ve been following! Thanks to everyone for all of the good information!\nWe’ve been planning a trip as well. When you decide your itinerary, you can enter a keyword in the search at the top this page and it will give show you previous discussions. Examples : Florence restaurants, golf cart tours in Rome, where to stay in each location.\nI’ve learned so much!"}, {"username": "Anna EClar", "comment_text": "Im In the process of booking all my train tix on the Trenitalia app. No issues at all. Take the time to learn the different classes of service and choosing seats etc. im trying to do all business class seats but a couple regional trains dont have it. Oh well. If you’re self sufficient you will be fine."}, {"username": "Sabrina Marie", "comment_text": "It’s super easy, you can book in advance, day of, or literally grab a ticket when you get to the train station.\n\nI would just google my route and buy a ticket the morning of usually, this way I wasn’t rushed and could leave when I wanted, most of the trains runs every hour or more for those busy locations."}, {"username": "Tunya Pyne", "comment_text": "We are going next month 🙂 our second trip 🙂 transfers are from airport to hotel etc 🙂 we are coming from Canada and flying into Rome then driving up to the Tuscany region and staying in little towns around there plus Florence then training to Milan and Lake Como 🙂 then back to Pompei and Rome (going for about 3 weeks). We book it all ourselves and use a combo of Airbnb, VRBO and hotels 🙂 best of luck 🙂"}, {"username": "Tracy Perez Abreu", "comment_text": "As everyone says, train apps and I also use www.rome2rio.co\nm"}, {"username": "Russ Whitley", "comment_text": "Have a look at the web site for trenaitalia. If you can work your way through it you can do most of the train tickets yourself. (When you open it, open the menu bars and choose English button.)\nIt has a bit of Italian still through English version but you can use google translate it’s fine.\nHere is site. https://\nwww.trenitalia.c\nom/en.html\n\nThe other site that is massively helpful is Seat61.com It goes over details of red arrows, (Freccia Rosso) white arrows, local trains etc."}, {"username": "Lynn Mathiowetz Hoffman", "comment_text": "If you have questions reach out to Amici Vacations. She’s return Italian and husband married to an Italian and has been going for 25 years and we are using her for our trip coming up on August 30. She has different levels of services available and knows the transportation inside it out. I can’t recommend her highly enough."}, {"username": "Marilyce Arbelo", "comment_text": "I used the Omio app and found it super user friendly!! After a day or so we understood the trains and metro systems and it was easy after that! We took a train rome to Florence (about $200 for 2 people), rome to the FCO airport ($30 for 2), and rome to cruise port ($17 for 2) and bought each like an hour before or while at the station. The app will send you an email with the tickets and you follow a link to check in / validate the ticket and you’re all set! There’s many people around the station to guide you as well"}, {"username": "Karen Dross Zbikowski", "comment_text": "Read the Rick Steve books on these cities. He is very clear with his direction and descriptions, especially with train travel. Also, check out you tube videos on the train stations and locations so you will know what to expect. Have fun!"}, {"username": "Tomas Krivanek", "comment_text": "Getting around 5terre is completely easy. By 🚈. But Amalfi might be tricky in high season, however April might be quiet🇮🇹🇮🇹🇮🇹"}, {"username": "Susie Davison Stevens", "comment_text": "what is your favorite train app?"}, {"username": "Laura Zel Kremer", "comment_text": "Our travel agent booked us through Railbookers. They created an itinerary including all of the train tix."}, {"username": "Rita Davoli-Conti", "comment_text": "We are in Italy now - we’ve travelled through both France and Italy and did not prebook our train tickets - we did this in 2017 as well - we have not had any problems moving from city to city and it’s August! If you are worried just buy all the tickets at the 1st train station!"}, {"username": "Alaide Stuart", "comment_text": "If you are in the Lucca area and want a great wine tasting experience, make a reservation at Fattoria del Dotto. It is beautiful, fun with good food and wine!"}, {"username": "Cathy Clarkin", "comment_text": "Ok is it possible in 2 weeks do do Rome for a couple days ( we land and dept from there) 1 of the girls can only do a week , so essentially we are splitting the country/trip in 2 parts ,\nAFTER Rome comes Florence and Cinque Terre and hopefully a wine tour day , in that first week.\nOptionally— Rome for the couple days , train to Venice - Amalfi coast back to Rome to drop her off . Either order is fine , but does it Make sence ???"}, {"username": "Jared Colwell", "comment_text": "So NOT TRUE. Wife n I planned our whole trip including planes trains and automobiles. No issues. In fact is a cherished memory. Bonus was that any disagreements were handled at home in advance and not when we were tired, hungry, clueless in a foreign country wasting precious time"}, {"username": "Debby Guthrie", "comment_text": "i tried using a travel agent. but after many conversations that she simply did not listen to our wants and an itinerary that did not reflect anything i asked for i told her we would handle it on our own and i found the hotel and booked it myself and then she had the audacity to ask why i didn’t ask her to book it so she could get the commission 😳. i called the hotel directly and booked it. there was no commission."}, {"username": "Carrie Cornils", "comment_text": "We used Costco and it was great!"}, {"username": "Barbara Dixon Woods", "comment_text": "You don’t need a travel agent at all. I easily booked everything direct and not no problems at all . Train travel is easy as is booking hotel or lodging and even tours ."}, {"username": "Susan Levine Solomon", "comment_text": "You can also get great advice from the people at the hotels or air bnb. You can always contact them before you leave to get advice. They are usually very helpful:)\nGo on YouTube and look up anything. There are videos for everything you need to know. Going to Italy in April 2024. Doing it myself."}, {"username": "Kate Laidlaw", "comment_text": "We just did Rome 4 nights, Florence 3 nights and Riomagiorre 4 nights before heading onto France.\n\nTrains were very, very easy.\n\nWe walked from the train stations to our accommodation, no transfers needed.\n\nFeel free to ask more questions"}, {"username": "Julie Angel Bruther", "comment_text": "I booked 6 weeks myself. Use the train apps. Very easy . Figure out where you want to be. Then figure out how to get there and get to your next destination. Take your time. Do one destination a day . Don’t stress. Trains are actually pretty cheap , even business class. I used Airbnb as well. I asked the host questions… like how far from train, best mode of transportation to get there etc. hope this helps"}, {"username": "Pam Rottschafer", "comment_text": "I didn't want to deal with trains on my first trip to Europe so am doing cruise! Rome, Sorrento, Amalfi, Montenegro, Croatia ending in Venice!!"}, {"username": "Lisa Sweet-Roberson", "comment_text": "Following"}, {"username": "Cindy Gallen Barton", "comment_text": "We have had no issues with trains. 1st trip we went to Nice, Genoa (day trip to Cinque Terra by train) Milan and Venice. Last trip Rome and Amalfi Coast using the train. They are fast, comfortable and usually on time."}, {"username": "Pete Wilson", "comment_text": "Depending when you are travelling in April, be aware of Easter for travelling and I would say to Rome especially. It appears Good Friday is 29Mar24 and Easter Monday 01April24 so you will probably be okay, it's just to be aware. Enjoy every second of it and have a great trip :-)"}, {"username": "Maureen Dennis", "comment_text": "Ecause of our age we chose AMA for three weeks in Italy"}, {"username": "Lisa Zarlingo Smith", "comment_text": "We went to Italy last year as our first trip to ever leave the US and had no trouble getting around on trains. I pre-booked all trains and we had no issues. I used ItaliaRail because I found their website easier to use but I also had the \"Trenitalia\" app which was helpful while we were traveling. If you're going to Florence I would choose Cinque Terre simply for the fact of less travel (AND we ABSOLUTLEY LOVE IT THERE!)"}, {"username": "निनावी सहभागी", "comment_text": "Thank you all so much!!!! You’ve eased my fears, so I think we are going to do this ourselves and hopefully save some money for our trip. By the way, this is our 25th Anniversary so if anyone has restaurant tips in Rome I’ll take them 😊"}, {"username": "Anna N. Battaglia", "comment_text": "Booking trains is really easy, you can use the website Trenitalia or Italo, these are the two train companies in Italy (Trenitalia has more offer and covers all destinations, Italo only the main cities). Buy tickets online is simple and you receive them via mail or phone.\nI suggest you to look for Freccia Rossa or Frecce in general, and best 1st class or business, they are really convenient. As for prices, if you book in advance you can also find good offers. Enjoy your trip!"}, {"username": "Bea Kuckens", "comment_text": "They want commissions. We do all of the planning and booking ourselves - that way we get the flights that work best for us, the lodging of our choice, train times we want, etc. It would take WAY too much back-and-forth with a travel agent to fine-tune an itinerary that meets all of our needs and expectations. The trains are easy to book - just go to Trenitalia or the Trainline website. For Cinque Terre, check the Cruisemapper website, Port of La Spezia and see what cruise ships are in each day and try to plan around them. You don't want to be there when a ship dumps 2,500 - 5,000 day-trippers off."}, {"username": "Mike Adams", "comment_text": "If your freaked out by transfer s stic with the professional s"}, {"username": "Alicia Cox", "comment_text": "It really is not that hard. We have taken 3 trips to Italy & planned it ourselves with a combination of planes, trains, & automobiles 🤣 & a few buses. Booked our own Airbnb & hotels. We planned our travel around our dates & itinerary but allowed enough flexibility to change as we traveled as far as day trips, but stayed most places 3 days so it wasn’t so much pack & unpack. Honestly part of the fun is the planning. And definitely DIY will save A LOT… & the shopping is great 😉"}, {"username": "Leslie Goodland", "comment_text": "Train travel is very easy.\nDon't sweat it."}, {"username": "Jacquie Johnston", "comment_text": "We walked to the train station in Rome last October book our train to Venice. Via our concierge at our hotel, he advised to take the fast train, he had a ￼ schedule an advice, we walked to the train station, and it worked out perfectly. We are 70 an 69."}, {"username": "Susan Sassoon", "comment_text": "I don’t know what your ages are, however train travel can be difficult. The stations are old and they might not have escalators or elevators. Lots of steep stairs. If you have the means, you can stay somewhere central and get a private driver to do day trips or take you wherever."}, {"username": "Eliz Fragoso", "comment_text": "Don’t forget starting 2024 you must have a visa for over 30 countries in Europe 😱"}, {"username": "Sabrina Kerhin", "comment_text": "Planning is half of the fun! We are leaving for Tuscany on 8/30 and with the help of this group I’ve planned and booked everything. We are staying in 4 different places, 3 nights each. We have car rental for the country side and trains booked in and out of Florence. Very easy to do if you like planning. Feel free to reach out to me mid September and I’ll let you know how it was."}, {"username": "Jane Eichhorn", "comment_text": "We bought train tickets quickly and easily on the days we traveled. Cinque Terre is not to be missed!it was very easy getting around. A little crowded on the train, as we were there on Easter in April this year, but no problems at all! We did a sunset cruise. They picked us up in Riomaggiore where we stayed and allowed us to get off later on Manarola. We took the train back quite late and no problems!"}, {"username": "Jane Eichhorn", "comment_text": "We booked the first part of our two weeks withGate One travel group for Venice, Florence, Rome, Pompeii,Sorrent\no, and could have added a day to Amalfi Coast,but opted instead to go on our own to Cinque Terre."}, {"username": "Jennifer Melka Maley", "comment_text": "Book on your own! It’s so easy …you can do it cheaper than them too. Just take the time and research. They tend to book places where they get a commission so I really don’t trust them . I’ve compared their pricing and my own and they always come in so much higher !"}, {"username": "Amanda Molinelli DuAime", "comment_text": "I think when they say getting around cinque terra is tough is because it’s all hills and stairs except one town. The train system there is crazy easy to use and I’ve never learned how PT works and I could get around just fine."}, {"username": "Shannon Welch Farr", "comment_text": "Hi. I purchased train tickets from Rome -> Florence -> Milan myself without any issues.\n\nWe also got information for transfers to / from airports and train stations to / from hotels from the hotels and booked those with no issues.\n\nWe booked all of this a couple of weeks ago for our trip in late September / early October and there seemed to be plenty of seats to choose from.\n\nI used the Trainline website."}, {"username": "Elana Kruger", "comment_text": "We just did Italy - booked all my train tickets on the Italo app - book as early as possible as it's cheaper.\nIt is so easy to navigate & arrange on your own. People everywhere so obliging & helpful.\nWe did Rome, Positano & Venice."}, {"username": "Judith Tobin", "comment_text": "I’ve been to Italy several times, going there next month. Would never occur to me to use an agent. Have already pre booked my trains on the Trainline app. Can even put tickets into the Apple wallet. Enjoy your trip"}, {"username": "Peter Stephan", "comment_text": "Train travel is almost free in Italy. Florence to Rome $25. The travel agent charges you $100, $75 for them."}, {"username": "Kate Bryant", "comment_text": "Cinque Terra does require allot of steep walking unfortunately for you.\nAssuming you are flying into Rome, the train travel is easy from Roma to Firenze. You would need , depending on how much time you have 2-3 days in Firenze. More time if you have it, but you can use it as a base and travel by train to Lake Como, and can easily catch the bus up to Bellagio. It’s truly magical place.\nYou can take a bus down to Amalfi, stopping off to see Pompeii! Sorrento, Positano, Capri are a dream come true!\nBe mindful about Rome train station with gypsies , don’t mean to frighten you, but they are always hanging around, like anywhere traveling, just be mindful.\nYou can travel first or second class on the train. Either is fine. Most people do second.\nHave a wonderful, wonderful time.\nAlso look into a private driver to take you around Sorrento and Positano, which is so easy. Don’t forget Capri, when there.\nHave a magical time. 😘"}, {"username": "Lee Childs", "comment_text": "Check out the Rome2Rio app. It will help you plan."}, {"username": "Rhona OConnor", "comment_text": "Get the Trainline app an put your dates and times into it and you can work out time and cost. Local busses and taxis work OK too. Getting around in Italy is easy enough. I did it for the first time in June and had no problem. Just allow time in your planning. 👌"}, {"username": "Debbie Greenseid Koslow", "comment_text": "I have been to Italy twice and I also love to explore and plan my own trips. The thing that made me use a travel agent both times was that it is a different country, different \"rules\" and different language. If you are the type of person who will take the time to learn about everything you need to know then do it yourself. If not - use a TA. As far as Cinque Terra - you can either take a ferry from each town to the next or a train. Some people love CT, I did not so I don't want to give my opinion on going there or the Amalfi Coast. Hope this helps."}, {"username": "Pia Reilley Loughin", "comment_text": "We were gone for 2.5 weeks been home about 24 hours now.\nWe booked everything ourselves including trains.\nWe were Rome, Tuscany and Venice."}, {"username": "Margaret Wright", "comment_text": "Train travel is inexpensive, easy, and reliable. You can buy a ticket at the station, validate it just before departure and that’s it. Cinque Terre is great to get to by train. There is a fast train from Florence to Rome.\nYou can also get the ferries to visit all of the 5 towns in Cinque Terre, stopping off at each one and then getting the next ferry to the next town.\nPlease note that travelling in Italy is not that difficult and I hope you enjoy your time there."}, {"username": "Katie Turnbull", "comment_text": "Trains are very easy and cheaper the earlier you book them. Cinque Terre is very easy to train around or hike. You will be able to navigate it all without the agent."}, {"username": "Regina-Rich Krett", "comment_text": "I plan our travel myself but I research everything a lot before booking. In Italy I use welcome pickups for transfers from the airport if we are staying somewhere outside of Rome. As an example this year we will be an hour outside of Rome so I booked our airport transfer with them. If staying in Rome first I book train tickets to closet stop to hotel then we Uber to the hotel. The trains in Italy are not expensive at all and are very easy to navigate. We have taken trains all over Italy from Venice to Naples with no issues."}, {"username": "Bev Madill", "comment_text": "Don’t be daunted. It’s quite easy. Just use the Trenitalia website and create an account. All your tickets will be stored there. Italo (the private rail company) also do some of those routes. The CT is very easy to get around. Trains between towns are frequent and easy to understand. You’ll have a great time."}, {"username": "Erick Abutin", "comment_text": "We are doing best itenerarie , just send me a message . 😊"}, {"username": "Rose Turdo", "comment_text": "They're creating a schedule, while you're on vacation. Don't do it.\nIf you're capable, rent a car and drive. Do not pre-book hotels except for night of arrival and departure.\nGoogle Maps is great."}, {"username": "Renae Larcus", "comment_text": "Train travel is easy in Italy. Why is this agent scaring you? Also CT May be crowded depending on when you go but it is also easy to get town to town by train. Or ferry. Or hike."}, {"username": "Chris Avanzato", "comment_text": "Trains are efficient, clean, and easy to navigate, particularly in the cities you are visiting. No need to book any in advance. One caveat, pack light."}, {"username": "Christie Lisk Rogers", "comment_text": "We have done it with and without travel agents. On the train part, strikes are not uncommon. A travel agent will follow the shutdowns and have solutions. I also think our rooms are better with an agent and they arrange cars if other options are difficult. It’s just the ease of mind for me and not trying to balance all the details"}, {"username": "Sande Ricci", "comment_text": "Trains are easy! Book them yourself as you go. Trentalia is a great app to have for train schedules and buying tickets."}, {"username": "Heather Sechrist", "comment_text": "After family used a travel agent a couple years ago and had a lot of expectations not met, we booked everything ourselves.\n\nThe trenitalia app for train travel was great. Easy to book. You decide how strict of a fare you want (for us, certain times we’re a must, others were more open). The business class coaches were awesome for long journeys. I only prebooked the king journeys: Rome to Naples, Sorrento to Florence, Florence to Rome. Everything else, I booked as we walked into the train station."}, {"username": "Karen O'Connor", "comment_text": "The places you are going to are so easy by train. A few changes here and there but nothing too dramatic. I travel to Italy almost every year from Australia to see friends, book nothing prior and navigate the trains for travel to each place easily. Trains run mostly that will suit your time frame. I have been to all your places via train with honestly no drama!"}, {"username": "Susan Trenear", "comment_text": "We are currently in Palermo on week 4 of our 5 week Italy trip. I took the advice of a travel agent based on the same circumstances. However looking retrospectively\nall the travel agent has done is charge me additional fees. We went to Florence, Rome and Salerno caught trains etc. the trains are very user friendly and would recommend this method of travel."}, {"username": "Greg Saba", "comment_text": "So many travel agents have never been to the places you may want to go. He or she may be simply wanting to send you to places he or she is most familiar with. There is so much info available on the internet and places like this today, that there has never been a better time to do your own planning. We have planned and written trip reports on Fodors of many of our experiences, all of them highly successful. Cinque Terre was one of our favorites. We based in Rapallo, and simply parked our car for 6 days. We were able to take trains to Genoa, Camogli, Portovenere, Lerici, Tellaro, La Spezia and Cinque Terre. We had a 2-day rail and hiking pass for Cinque Terre, walked between the three villages, where the trail is open and took trans to the other two. Best hike ever. No-preplanning.\nWe simply watched the weather and planned each day the night before over dinner. Inexpensive and fun."}, {"username": "Brooke Ashley", "comment_text": "We booked ours ourself online, you definitely don't need a travel agent for that. My advice would be to give yourself a lot of time at the station to find your platform as the stations are really busy and it can be challenging to find the screens that display your platform, we were a bit confused at times.\n\nWe travelled to and from Cinque Terre by train recently from La Spezia and found the trains often ran late. It was more affordable to buy the day pass but you can purchase that a ticket counter on the day. They run frequently."}, {"username": "Eva McLean", "comment_text": "Google getting around Cinque Terre. You will find that you can get there by train from Rome or Florence.\n\nOnce there, there is a Cinque Terre express train that travels between the five villages.\n\nOr you can choose to hike between the villages (beautiful!) and take the train back.\n\nI believe, if I remember correctly, you can also take boats between the villages.\n\nI stayed in Monterosso and did a combination of hiking and the express train. It’s considered a national park. This website has info on passes and pricing. I was able to get mine at the Monterosso train station.\n\nhttps://\nwww.cinqueterre.\ncom/en/\nthe-cinque-terre\n-card"}, {"username": "Joey Clark", "comment_text": "I’d drop that travel agent!! Trains are easy to book and transfers weren’t scary. We had a group of 12 this summer, booked everything ourselves (most of us had never been to Italy), no issues at all, took trains all over the country. We had the exact same itinerary as you’re planning (Cinque Terre and amalfi - stayed in sorrento) plus Venice. You’ll have an amazing trip!"}, {"username": "Fetchin Gretchen", "comment_text": "I highly recommend the trainline app on your phone plus bring a battery pack to keep phone charged for easy ticket and bookings access!\nI think you can definitely book your own train travel to Italy without too much difficulty. The Italian train system is very efficient and easy to use, and there are many different routes and options available.\n\nHere are some tips for booking train travel in Italy:\n\n* Start by planning your itinerary and figuring out which cities you want to visit. Once you know where you're going, you can start looking at train schedules and prices.\n* There are a few different train companies that operate in Italy, so it's important to compare prices before you book. I recommend using a website like Trainline to compare prices from different companies.\n* If you're traveling during the peak season (April-June and September-Octob\ner), it's a good idea to book your train tickets in advance. This will ensure that you get the best prices and that you don't miss out on a train.\n* When you book your tickets, make sure to pay attention to the class of service you want. There are three classes of service on Italian trains: economy, premium, and business. Economy class is the cheapest, but it can be crowded and noisy. Premium class is a bit more expensive, but it offers more legroom and a quieter ride. Business class is the most expensive, but it offers the best amenities, such as free Wi-Fi and access to a lounge.\n* Once you have your tickets, make sure to print them out or save them on your phone. You will need to show your tickets to the conductor when you board the train.\n\nTransfers are just the connections between trains. For example, if you're taking a train from Rome to Florence, you might have to transfer trains in Bologna. The travel agent is probably warning you about transfers because they can be confusing if you're not familiar with the Italian train system. However, they're not really that difficult to figure out. Just make sure to pay attention to the signs and ask for help if you need it.\n\nI think Cinque Terre is a great place to visit, and I don't think the travel agent is wrong about the transportation being difficult. The five villages that make up Cinque Terre are all very small and they're only accessible by foot, train, or boat. The trains are the most efficient way to get around, but they can be crowded and slow. If you're not used to walking, you might find it difficult to get around Cinque Terre.\n\nHowever, I think the difficulty of transportation is part of what makes Cinque Terre so special. It's a very unique place and it's worth the effort to get there. If you're willing to put in a little bit of effort, you'll be rewarded with some amazing views and some truly unforgettable experiences.\n\nHere are some tips for getting around Cinque Terre:\n\n* The Cinque Terre Card is a great way to save money on transportation in Cinque Terre. The card gives you unlimited access to the trains, buses, and boats that serve the five villages.\n* If you're not up for a lot of walking, you can take the Cinque Terre Express Bus. The bus stops at all five villages and it's a great way to see the coast without having to walk.\n* If you're traveling with a group, you can rent a boat. This is a great way to explore the coast at your own pace and to get some amazing views.\n\nI hope this helps!"}, {"username": "Nathan Earl Stellenberg", "comment_text": "The quote I received from travel agent was absurd. Picked up valuable insight from this travel site which has given me the courage and confidence to do all the planning myself, saving nearly $10k (NZD) in the process."}]}, {"id": "2210822309316847", "text": "Has anyone used the Freenow app for booking taxis? Experience?\nAlso if you have a train ticket for a certain time but miss the time, can you still use the ticket for a later train or do you have to purchase a new one?\nAnd, are last minute train tickets easy to get & if so, how long should I allow to do so?\nTIA 😊", "link": "facebook.com/groups/1373361046396315/permalink/2210822309316847/", "likes": 3, "comments": [{"username": "Rhona OConnor", "comment_text": "You can book train tickets when you arrive at the station."}, {"username": "Pia Reilley Loughin", "comment_text": "Are you looking to I take high speed trains? If yes, book in advance to save money.\nLast week my local train was canceled causing us to miss our connecting high speed train.\nTrenitalia (was company for both trains) rebooked us for free to allow us to get on the next high speed train to our destination."}, {"username": "Kejdi Okej", "comment_text": "You can book train tickets when you arrive at the station"}, {"username": "Heather MacDonald", "comment_text": "I used the app, but I was not always successful so when no one took the job, I used Uber Black. It was more expensive but they usually came within 5 minutes."}, {"username": "Eric Parks", "comment_text": "I've used Freenow as well as AppTaxi. Only had issues getting a taxi once and that was in the hours leading up to AC v Inter in Milan (big milan rivalry game)"}, {"username": "Costero Home", "comment_text": "Yes, they are not bad. We too used UBER Black."}, {"username": "Suzi Menacher", "comment_text": "I used Freenow in London and Paris with great results. I am hoping to have same success next spring in Italy."}, {"username": "Karen Trom", "comment_text": "Hit or miss with a Free Now. More than once we watched their progress and even showed them arriving only to have the ride cancelled.\n\nDon’t use it if you absolutely have to be somewhere on time."}, {"username": "Chris Landry", "comment_text": "Three weeks in Rome FreeNow worked for me."}, {"username": "Alicia Burno", "comment_text": "About the train ticket, you can go to the office at the train station and explain the situation, they will change the ticket to a new one with no charge. It happened to us."}, {"username": "Laura Uribe", "comment_text": "The few times I tried to use it, I had no options. Trying Uber this trip."}, {"username": "Stuart Flinn", "comment_text": "We used Freenow several times in Rome. Never a problem. The service was quick and the prices were just a couple Euro more than the cabs hailed in the traditional sense. We don't speak Italian, so having the app run the instructions and deal was fine by us."}, {"username": "Abby O'Mara", "comment_text": "I have used FREENOW to pre book for early morning pick ups. The first time just before pick up they switched the driver 5mina before which was no problem and the second they cancelled us just before pick up time but then allocated someone else within 5mins so it all worked out in the end."}, {"username": "Sabrina Marie", "comment_text": "Used many times in Milan and Rome. All times came out Cheaper than just grabbing a taxi and paying direct."}, {"username": "Sabiha Syed Shaikh", "comment_text": "Better than Uber"}]}, {"id": "2210846905981054", "text": "Traveling from Sorrento to our next stop in Positano in September. Would we be okay with 4 people taking the ferry with our luggage or is the private driver worth it?", "link": "facebook.com/groups/1373361046396315/permalink/2210846905981054/", "likes": 0, "comments": [{"username": "Lucy Casado-Martinez", "comment_text": "There’s a lot of steps if you’re getting off the boat and don’t know how big your luggage is. Might be better getting the car instead."}, {"username": "Kay Rendall", "comment_text": "Definately a car. 45 stairs from ferry to town square with luggage. I have done it. Then depending where u r staying u can walk uphill, get the local bus or a taxi.\nIf u decide to use ferry. Accom can organise Positano porters for your luggage."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 8, "comments": []}, {"id": "2210828869316191", "text": "Will you please tell me about Sicily and what we can do over a three day weekend away from Catania.\n\nWe can leave early Friday morning but must be back Sunday night. Visiting our college student and want to plan a weekend excursion with them.\n\nPlanning to spend 5 nights total.\n\nNight -1)Thursday-late arrival. Catania -sleep.\n\nExcursion - 2 nights/3आणखी days\nDays-2-4) Friday-Sunday) leave Catania 9:00 am.\nArrive back to Catania, Sunday night about 18:00 sleep in Catania.\n\nDay- 5) Monday- exploring near and around Catania without student - sleep.\n\nDay -6) leave\n\nThank you", "link": "facebook.com/groups/1373361046396315/permalink/2210828869316191/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "follow us https://\nnextstop-italy.c\nom/\nvirtual-tours/\nbest-of-sicily/"}]}, {"id": "2210829025982842", "text": "Can anyone suggest a centrally located hotel or air bnb in Rome ? We have 5 kids (1,7,9,11,13) so preferably something we can walk to sights. We’re okay with two hotel rooms or an air bnb. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2210829025982842/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.kqzyfj.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187791-d1637\n009-Reviews-B_B\n_A_Picture_of_R\nome-Rome_Lazio.\nhtml"}]}, {"id": "2210852059313872", "text": "Can anyone recommend the easiest / cheapest way to get from Marco Polo Airport to the San Marco area (if you’ve done this before)? My partner and I fly in on Saturday and are staying around San Marco. Thanks in advance! 😊", "link": "facebook.com/groups/1373361046396315/permalink/2210852059313872/", "likes": 0, "comments": [{"username": "Jackie Macleod", "comment_text": "Get the Alilugana (water bus) from outside the airport. No need to book anything. Designated stops, one being San Marco."}]}, {"id": "2210853895980355", "text": "Hi everyone, looking for a cute bnb or guesthouse for one night in Genoa. Any recommends? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2210853895980355/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.anrdoezrs.ne\nt/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187823-d5219\n942-Reviews-B_B\n_Al_Molo-Genoa_\nItalian_Riviera\n_Liguria.html"}, {"username": "Isabelle Truong", "comment_text": "I stayed at this lovely 1BR place, near the train station and easy walk to all the sights in the old town. Very convenient location and a great host. There is a lot to see in Genoa , I recommend a longer stay if you can.\nhttps://\nabnb.me/\nNaHYUYh0aCb"}]}, {"id": "2210855752646836", "text": "Hi,\nWe will be staying in Rome for couple of days in September and plan to go to Tivoli and we will not have a car. Looking for recommendations:\n· Getting to Tivoli from Rome and back\n· What villas to visit and in which order (understand there is some uphill and downhill paths between villas)\n· Restaurant for lunch\nThanks to all in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2210855752646836/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "have a look here https://\nwww.viator.com/\ntours/Rome/\nTivoli-Day-Trip-\nfrom-Rome-Villa\n-dEste-and-Hadr\nians-Villa/\nd511-3058TIVOLI?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}]}, {"id": "2210884165977328", "text": "Thanks to all the advice from this group I was able to secure the Full Experience Ticket with access to the Arena of the Colosseum on coopculture… which was significantly less than through a third party…\n(I am so happy that has been accomplished)…..", "link": "facebook.com/groups/1373361046396315/permalink/2210884165977328/", "likes": 1, "comments": []}]