[{"id": "2199409913791420", "text": "Hi! I just joined this group and excited for tips on traveling to Italy with 3 teenage girls next summer for 8-9 days. Any unique things to do with them around Rome, Venice, Cinque Terre or somewhere on the coast (Positano, Naples)? I’m wondering if Tuscany is a big draw for teen girls ovet the cities listed above. I’ve seen all the big cities in Italy so I’m ok not hitting all the classics and doing a couple of kid focused things).", "link": "facebook.com/groups/1373361046396315/permalink/2199409913791420/", "likes": 6, "comments": [{"username": "Lucrezia Folger", "comment_text": "1st decide if it's 8 or 9 days, without arriving and departing included in that,2nd that's too many places for 9 days. 3d, since your girls are teens and I'm sure on the internet often, have them start looking at areas of interest to not only get involved and excited but also learn about the places you're going to. You could all talk about each place every couple of weeks or so and decide from the interests you all have. Since you all have never been, Rome and Florence are a good start. 5 days in Rome with a day trip to Pompeii, 4 in Florence."}, {"username": "Rhona OConnor", "comment_text": "Don't do too much!!!! Take time in each place."}, {"username": "Roland Trego", "comment_text": "https: //\nwyldfamilytravel . com /\nitaly-with-teena\ngers/"}, {"username": "Giorgia Petraia", "comment_text": "There aren’t many kid focused activities over here. Plus if they’re in their teen years they gonna be able to enjoy the adult attractions. We bring children to museums here since they’re 6/7 years old"}, {"username": "Billie Begley", "comment_text": "I would do Sorrento area. You have the ferries to go to Capri. Amalfi. Ischia for the hot pools. Probably more into than churches for them."}, {"username": "Billie Begley", "comment_text": "They would get a kick out of O’Parrucchiano dine in a lemon grove in Sorrento"}, {"username": "Billie Begley", "comment_text": "If you want a boat tour contact Capitano Ago. They were Awesome. We had a bit too much fun."}, {"username": "Dana Green", "comment_text": "Our girls (ages 15, 17) loved Tuscany. Siena has some amazing stores and I think they both enjoyed the slower pace that came with getting out of Florence."}]}, {"id": "2199410797124665", "text": "Who has done a Vatican tour, Sistine chapel, and St Peters? Which tour group? Viator was recommended. 225.00 per person. Does that sound right?", "link": "facebook.com/groups/1373361046396315/permalink/2199410797124665/", "likes": 2, "comments": [{"username": "Leigh Griffiths-Cole", "comment_text": "We just booked tickets with a tour guide on the official Vatican website. So much cheaper. 118euro for 2 adults and 2 children."}, {"username": "Lisa Schalig-Winter", "comment_text": "We used Crown Tours. Our guide was great."}, {"username": "Andrea Corey Andrews", "comment_text": "Viator was great"}, {"username": "Lisa Kessler Scherr", "comment_text": "We did the Vatican Gardens Tour. Our guide took us through the chapels up until the Sistine Chapel (there’s no talking in there). She told us how to enter St Peter’s without waiting in line. The tour was 40 euros per person and we booked it through the Vatican website well in advance."}, {"username": "Reina Pike", "comment_text": "We used Viator and had a great experience!"}, {"username": "Gina Spyker Fairfield", "comment_text": "We used The Roman Guy and did their Privileged Entrance tour. Very knowledgeable guide, smaller group, early entrance so it wasn’t quite as crowded."}, {"username": "Lisa Valdovinos", "comment_text": "We used Viator"}, {"username": "Kevin Wilkins", "comment_text": "We booked it with the help of our guide - Chiara Antonelli Tourist guide. She was a huge help, a fantastic guide and a lot of fun!"}, {"username": "Lisa Pirone Kaiser", "comment_text": "We had a great early morning tour. https://\nwww.whatalifetou\nrs.com/\n?utm_source=GMBl\nisting&utm_medi\num=organic"}, {"username": "Karen Blackmore", "comment_text": "We did the Happy Hour visit to the Vatican and Sistene chapel through the Vatican website. For St. Peter's, we climbed the Dome early in the morning with Tiquets, very good tour."}]}, {"id": "2199410343791377", "text": "Anyone got experience use the Euroraill pass in Italy? Is easy to use to get in train?", "link": "facebook.com/groups/1373361046396315/permalink/2199410343791377/", "likes": 0, "comments": []}, {"id": "2199411983791213", "text": "Hi! We have young kids (ages 9 and 6) and are looking for an apartment style hotel in Rome. Ideally it would be a 2 bedroom with a kitchenette. Had anyone stayed in any that they would recommend? Thanks so much!", "link": "facebook.com/groups/1373361046396315/permalink/2199411983791213/", "likes": 0, "comments": [{"username": "Dave Conroy", "comment_text": "Check out airbnb for your family and ideally one with a washing machine so you can all pack light."}, {"username": "Rhona OConnor", "comment_text": "Check Booking.com they list apartments and the reviews are accurate"}]}, {"id": "2199423200456758", "text": "Is it better, more affordable, to stay in La Spezia and do day trips to the 5 villages of Cinque Terre?", "link": "facebook.com/groups/1373361046396315/permalink/2199423200456758/", "likes": 1, "comments": [{"username": "Leesa Martin", "comment_text": "I’m interested to know where is best to stay also. So confusing"}, {"username": "Merilice Finateri", "comment_text": "We did this in May and loved it!"}, {"username": "Annette Fordyce", "comment_text": "I’ve never stayed in La Spezia, but can heartily recommend Levanto, which is a few kilometers north of the Cinque Terre. Super easy access to all five villages, but a charming town itself."}, {"username": "Laura DeCicco", "comment_text": "We stayed in Riomaggiore and loved it."}, {"username": "Robert Bélair", "comment_text": "We stayed in La Spezia for 4 nights. Loved the area. Easy access to the train station and a wonderful selection of restaurants as well"}, {"username": "Gayle Moores", "comment_text": "We stayed in Riomaggiore at a charming b&b. IL Bo Ma. Very good b&b at a reasonable price. Close to the train station and in the centre of the town with shops and restaurants nearby.Our Italian host was very helpful and spoke perfect English.Contine\nntal breakfast was placed at our door every morning. We were able to make fresh coffee every day with an espresso machine that was provided for us and fridge was stocked with water and yogurt.We bought a 24 hour train pass from the train station in Riomaggiore that allowed us to travel all day visiting all 5 villages. Really enjoyed our stay there! It is a beautiful and charming place!"}, {"username": "Gennaro Cappeluti", "comment_text": "Stay in Marina di Massa. Hotels. Cost you a third of hotels in Pisa of Florence. Boat leave jetty very morning from 10 am that goes to cinque terra. 20euros"}, {"username": "Kim Hull", "comment_text": "I'm currently staying in Vernazza and it's great. I've visited the other villages, and would probably have liked Monterosso for the beach/sun lounges. Vernazza has a tiny beach you can lay at. Riomaggiore and Manarola have boat ramps, so not ideal for swimming as far as I could tell. I didn't visit Cornigila as I've heard there's hundreds of steps to climb from the train station, and after doing the Vernazza to Monterosso hike yesterday my legs were too tired for that today. I'm glad I chose Vernazza to stay at, it's really close to the train station (Riomaggoire and Manarola had long tunnel walkways to wheel your luggage through - they also seemed a bit quiter/not as much atmosphere maybe?). I can't comment on staying at La Spezia, as i always wanted to experience one of the towns, in the evening once the crowds are gone. Well worth it! The trains get incredibly packed, so be prepared for that. Best time to go is early morning, then you'll just have to fight the crowds later in the day heading back."}, {"username": "Sally Warren", "comment_text": "Yes, lots cheaper. Also, look at Levanto."}, {"username": "Elizabeth Crinnion", "comment_text": "In 2019, my kids and I stayed (extended our trip after my husband went home) in La Spezia right near the train station. We were only in the area for two nights. We would jump on the train and explore Monterosso, Vernazza, and Manarola. What I liked about it was I could run to the large grocery store and cook meals at the AIRBNB. We would venture out in the am, come home and relax, have dinner, and then head back to the 5 Villages. I am not sure about the other villages, but I didn't see any large markets where you could obtain food and cook at home. We were on a budget so this worked out for us and I enjoyed heading back in the evenings when the crowds died down. With that said, we are heading back next summer and I splurged and got a place in Monterosso in Old Town (we really want to hike this time since our kids). So, if you stay in La Spezia, I would stay right near the train station so you can jump on the train and you are not spending a lot of time walking back and forth from the station."}]}, {"id": "2199432470455831", "text": "Is there more than one train station? Will be going from Rome to Florence.", "link": "facebook.com/groups/1373361046396315/permalink/2199432470455831/", "likes": 5, "comments": [{"username": "Lj Downs-Ahearn", "comment_text": "Florence Santa Maria novella for the main station x"}, {"username": "Jason Hobel", "comment_text": "Take the high speed train from Roma Termini to Firenze Santa Maria Novella. Those are the main stations."}, {"username": "Ken Lerch", "comment_text": "Each has one main, end of the line, station."}, {"username": "Diana Granado", "comment_text": "Hi, just look up on www.trainline.c\nom, it has all the companies and timetables… it’s like $5 extra per ticket but their website is easier to understand"}, {"username": "Linda Miller", "comment_text": "Yes"}, {"username": "Vivien Paulik", "comment_text": "There are the main stations, but of course how the train is going to the city, there are stations"}, {"username": "Monica Espinoza", "comment_text": "What train is best to use from Rome to Amalfi Coast?"}, {"username": "Pao Magnoler", "comment_text": "Roma termini is huge. You will find a lot of trains that will take you to Florence."}, {"username": "Benedetta Vanni", "comment_text": "Main stations served by most high speed trains: Roma Termini (short: Roma T.), Firenze Santa Maria Novella (short: Firenze S.M.N.)\n\nOther stations also served by high speed trains (but fewer) or intercity trains: Roma Tiburtina, Roma Ostiense, Firenze Campo di Marte."}]}, {"id": "2199431497122595", "text": "We were looking for train tickets from Venice to Rome for our November trip and everything on Trenitalia appears to be sold out. Is that possible this far out?", "link": "facebook.com/groups/1373361046396315/permalink/2199431497122595/", "likes": 3, "comments": [{"username": "Sam Mah", "comment_text": "Are you using Venice Mestre as the station?"}, {"username": "Sam Mah", "comment_text": "Sam Mah"}, {"username": "Andrea Herbold K.", "comment_text": "Its too early. Wait until 60 days before your travel to start looking."}, {"username": "Sandy Radican Shikaly", "comment_text": "Too soon"}, {"username": "Lisa Kelly", "comment_text": "Too ealry"}, {"username": "Chantal Campeau", "comment_text": "try Omio"}, {"username": "Giovanni Pianigiani", "comment_text": "I think it's simply a bug in the system. You can purchase all trains up to 11/24, but they are locked from 11/25 onwards.I guess they don't start selling until 4 mon ths earlier"}, {"username": "Nicola Ramoso", "comment_text": "Too early, try to check again next month"}, {"username": "AnaMaria Uceda", "comment_text": "I just checked the Trenitalia app and it appears as if you might have to change the date for Friday. You might be on time to accommodate your travel options. It’s weird that they’re sold out by now. And also, make sure you’re leaving from the right station since Mestre is far away from Santa Lucia. Good luck!"}, {"username": "Carly Mathes", "comment_text": "Somebody commented on a post on Reddit that the full schedule is not usually available for Trenitalia until 60-90 days before. So it may be that some of the trains are posted but the full schedule will not be available until closer to end of August or end of September"}, {"username": "Jaime Cleek", "comment_text": "it's pretty early"}, {"username": "Gillian O'Callaghan", "comment_text": "It's far too early. Try in September ir October. It's a popular route with lots of trains. Yes less trains in November but less people."}, {"username": "Chris N Lynn", "comment_text": "That is definitely weird as I see trains the week before but not available on Saturday December 2nd either. I wonder if those haven’t become available yet as the week. Still 123 days til the 25th. Just a guess."}, {"username": "Joanne Diaz", "comment_text": "I had same problem awhile back I called and they said all the tickets hadn't been released yet. I just waited and was able to get them no problem"}, {"username": "Janet Messanelli Bozzone", "comment_text": "Too early to get tickets."}, {"username": "Penny Williams", "comment_text": "The new timetable gets realeased around then so tickets won't be listed. Read the Man in Seat 61s website for more info about train travel in Europe."}, {"username": "Frank Hunt", "comment_text": "Try Trainline App"}, {"username": "Renae Larcus", "comment_text": "Schedules aren’t even released until 60-90 days out usually 🤷‍♀️"}]}, {"id": "2199435097122235", "text": "ISO good hostels around Italy and your experiences! Preferably female only, but no biggie if not. Thank you!!", "link": "facebook.com/groups/1373361046396315/permalink/2199435097122235/", "likes": 0, "comments": []}, {"id": "2199435457122199", "text": "Stupid question.. where would you store you luggage til you can check into you stay we have an apartment near Spanish steps but arrive at 7am and can’t get in til 4pm", "link": "facebook.com/groups/1373361046396315/permalink/2199435457122199/", "likes": 12, "comments": [{"username": "Yvette Pavone", "comment_text": "Use the STASHER APP. STASHER.COM"}, {"username": "Joanne Smith", "comment_text": "If it’s a hotel you can store there"}, {"username": "Vasthi Cheddar", "comment_text": "Use the stasher app or ask your host"}, {"username": "Tami Sue", "comment_text": "I would ask ur host if you can't leave it there try the train station."}, {"username": "Nakitha Badon", "comment_text": "And the luggage lockers all over the city. We used a couple"}, {"username": "Barbara Hughes", "comment_text": "Try the hotel anyway."}, {"username": "Yiota Mallas", "comment_text": "Termini rail station has a left luggage centre"}, {"username": "Lisa Zarlingo Smith", "comment_text": "I would still ask your host for a recommendation.\nI stayed in an AirBnB in Florence and even though they were still cleaning our room she let us drop our luggage off early. I asked her a recommendation of where to store my luggage and she offered to let me drop them by the room."}, {"username": "Chelou Jamoral Hsia", "comment_text": "Our apartment was also near Spanish steps. The Twenty Piazza Di Spagna. Owner was friends or same owner of a hotel where we left our luggage in the morning. They delivered them to the apartment while we roamed Rome!"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Most hotels will hold your bags until check in time"}, {"username": "Victoria Marchetti", "comment_text": "Ask your hosts alot will.let you drop it off early"}, {"username": "Jaime Johnson", "comment_text": "Our hotel said they’d hold our luggage until check-in"}, {"username": "Sandy Michelle Duggan", "comment_text": "Ask the people at apartment if you can drop luggage earlier, ours let us? I don't recall seeing luggage storage facilities in Rome, but wasn't really looking, but I'm sure there would be."}, {"username": "Jordan Messina", "comment_text": "Surely they have a luggage room where you can Stowe. Before checking in at 4pm."}, {"username": "Sandra Keyser", "comment_text": "Sandra Keyser"}, {"username": "Tania Williford", "comment_text": "Book the cheapest hotel near the house you rented and drop your bags there until you can check in."}, {"username": "Dunia Aldyni", "comment_text": "If they have reception you can leave it their we did that"}, {"username": "Paulinha Cã", "comment_text": "If you don’t want to use a luggage store place (here some option found in google), or if you are tired and don’t want to walk around, you can try dayuse.com and rent a hotel room from 11am to 6pm (which usually is $89-100)."}, {"username": "Jono Roland", "comment_text": "You can ask the hotel as they’re usually pretty flexible"}, {"username": "Julie Norris", "comment_text": "I'm storing mine at Termini Station's lockers"}, {"username": "Dawn Lanette McKinley", "comment_text": "There are lockers or luggage holds at the train stations. ￼ I’ve never had problems with either."}, {"username": "Chassy Maria", "comment_text": "I used stow your bags. They are luggage lockers and pretty cheap. I’m actually about to use them again today in rome. We check out at 10 and leave at 330pm"}, {"username": "Rachael Richardson", "comment_text": "Just ask them they will store in most places otherwise near the station they have luggage storage places everywhere"}, {"username": "Sam Woodley", "comment_text": "Everywhere we have stayed they let us drop off our bags early and then we just come back to check in"}, {"username": "Cory Lee", "comment_text": "Lockers in train stations and airports"}, {"username": "Sheila Bridges", "comment_text": "Great advice. I love this."}, {"username": "Paula Aston Marshall", "comment_text": "Ask your contact, for the apartment, if you can check in early."}, {"username": "Brittany Whitfield", "comment_text": "Use the luggage hero app. We did this in Venice. A small business owner - cafe and laundromat locked up our bags in the laundromat closet. It worked well for us!"}, {"username": "Christine Aird Craig", "comment_text": "Ask the Airbnb person"}, {"username": "Betsy Meeks", "comment_text": "I contacted Expedia thanks they have given me a store near by to go to"}, {"username": "Sigrid Cormier", "comment_text": "Google luggage storage Rome. I think bounce is in Rome. Pick location that works for you."}, {"username": "Ruth Hackert", "comment_text": "Ask your host"}, {"username": "Joey Clark", "comment_text": "The Bounce app is awesome…"}, {"username": "Maria Ariano", "comment_text": "Most hotels will let you leave your baggage and come back (both checking in and out)"}, {"username": "Lisa Minichini-Dowty", "comment_text": "Message property... most let u store prior to checkin"}, {"username": "Laura Uribe", "comment_text": "We have started booking the day before or the day after where we stay if we are going to have this logistical problem. It makes life easier. It’s such a headache dragging your luggage to somewhere to store it and then picking it up and dragging it to where you’re staying."}, {"username": "Alejandro Gabriel Valenzuela Anghileri", "comment_text": "Contact the host, easily she or he will keep your luggage or find an accommodation"}, {"username": "Nicole Gouzoules Sheehan", "comment_text": "We have the same issue. We emailed our hotel in Rome and they said it was no problem they would store our luggage for us."}, {"username": "Marjie De Villa Lorica", "comment_text": "We stayed in a very nice boutique hotel in Via del Corso, and they were very gracious to keep our luggage before check in/ after check out."}, {"username": "Ivette Lugo", "comment_text": "google luggage storage wherever you are staying, i see one at naples train station, where is your destination?"}, {"username": "Jane Lisa", "comment_text": "Not a stupid question at all. 🙂"}, {"username": "Thelma Gipson", "comment_text": "Check the app bounce."}, {"username": "Paraone Gloyne", "comment_text": "Or pay extra so you can go in."}, {"username": "Phyllis Snyder", "comment_text": "Not a stupid question at all. I’d first ask the hotel or arbnb host if they would hold for you."}, {"username": "Natalee Turpin", "comment_text": "Most hosts/hotels will hold it but if not, I suggest the bounce app too!"}, {"username": "Sharon Bowns", "comment_text": "Check where you are staying. You can probably just leave your luggage."}, {"username": "Cheryl Ann", "comment_text": "Bounce is a great app! It lets you know places around you that will store your bags. We used it when we were in Italy."}, {"username": "Claudia Amp", "comment_text": "There are a lot of places offering this kind of service in the city center. Some hotels do this as well; ask your accommodation facility if you can store your luggage before your check in. It’s not really complicated."}, {"username": "Susan Palmer", "comment_text": "Check with your host. Many times they have alternatives for you"}]}, {"id": "2199436777122067", "text": "Best airport for standby flying from lax to Florence flr thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2199436777122067/", "likes": 1, "comments": [{"username": "Meghan Konopka", "comment_text": "I’d say aim for Amsterdam or Zurich. London and Frankfurt are okay options if you have at least a 2hr layover as theyre massive airports and take a bit to get from gate to gate"}, {"username": "Miyuki Kanno Paul", "comment_text": "Fly to a big hub first. It’s much easier to fly into FCO or MXP and take a high speed train to Firenze"}, {"username": "Jennifer Turbeville Hazen", "comment_text": "I fly nonrev and have never had issues flying into FCO and getting a train to Florence."}]}, {"id": "2199437637121981", "text": "Hello. Has anybody used luggage storage in Pisa and Lucca train stations? Could you please share any info? I plan to visit on my way to another city and don't want to carry my bag all day 🙃 Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2199437637121981/", "likes": 2, "comments": [{"username": "Carla Breiding-Cubillas", "comment_text": "Yes, Pisa at the train station 5 euros per suitcase (3 weeks ago)"}]}, {"id": "2199438543788557", "text": "My husband and I are planning a trip for March of 2025. Is it best to use a travel agent or should we plan a little and then see what falls in place when we arrive? Which is the best place to fly in too?", "link": "facebook.com/groups/1373361046396315/permalink/2199438543788557/", "likes": 0, "comments": [{"username": "Lisa Valdovinos", "comment_text": "We used a travel agent for everything. It took the pressure off us. I would do it all over again."}, {"username": "Roland Trego", "comment_text": "I would at least do research to find out where you want to visit. Then you can decide if you want to do it yourself or use an agent. I have several friends who have used Costco Travel repeatedly and been quite pleased with them."}]}, {"id": "2199441643788247", "text": "Recommendation for Sorrento Hotels thank you", "link": "facebook.com/groups/1373361046396315/permalink/2199441643788247/", "likes": 24, "comments": [{"username": "Matthew Cawley", "comment_text": "https://\nmaps.app.goo.gl/\npnGgrFbx9uxsZq34\nA\n\n5 min walk and you are on the main road. Has pool and gardens. Host Luca was outstanding"}, {"username": "Lori Mongillo", "comment_text": "Hotel Brittania - Stefano is amazing. Great location, clean rooms, breakfast included."}, {"username": "Lori Mongillo", "comment_text": "Following"}, {"username": "Karen Lenthe Redett", "comment_text": "Our guest house."}, {"username": "Amy O'Neill", "comment_text": "Craig Chapman"}, {"username": "Laura Thompson", "comment_text": "Piazza Tasso B&B Relais. Right in the city center. Most rooms have a perfect balcony overlooking the square!"}, {"username": "Kally Trahearn", "comment_text": "Hotel Plaza Sorrento - reasonably priced compared to some others mentioned here and within spitting distance of Piazza Tasso (main square). Have stayed there before and booked to go again."}, {"username": "Siobhan Nolan-farmer", "comment_text": "Marina piccola"}, {"username": "Karol Sabat Hoffman", "comment_text": "Villa di Sorrento!!! 💯"}, {"username": "Marita Sundin", "comment_text": "Continental"}, {"username": "Marielos Cardona", "comment_text": "Debby Pamela De Carranza Mira estas opciones de hoteles en Sorrento"}, {"username": "Gerilyn Tort Williams", "comment_text": "LaFavorita"}, {"username": "Joan Coombes", "comment_text": "TUI Blue Atlantic Palace"}, {"username": "Janine Marie", "comment_text": "Sorrento Palace 💚🤍❤️"}, {"username": "Kathleen Hill", "comment_text": "Conca Park, 2 minutes to town!"}, {"username": "Laura Hall", "comment_text": "Hotel Parco dei Principe Sorrento"}, {"username": "Krystle Waggy Konečný", "comment_text": "Hotel Caravel was awesome!!!"}, {"username": "Debi Sicurella Krulisky", "comment_text": "Belair hotel!"}, {"username": "Lisa LaBracio Volpe", "comment_text": "Plaza Hotel"}, {"username": "Karen Kinney Codella", "comment_text": "The Hilton. It is up the hill a bit. Easy walk to town. Has beautiful views of countryside. Great amenities!"}, {"username": "Starla Dawn", "comment_text": "Absolutely loved my Airbnb and host close to restaurants and harbour very secure comfortable and modern and clean."}, {"username": "Pamela Ann Morelli", "comment_text": "Grand Hotel De La Ville the best place"}, {"username": "Minerva Lopez-Daniels", "comment_text": "Villa de Sorrento"}, {"username": "Sandy Abplanalp", "comment_text": "Hotel Continental. Convenient location in Sorrento, some rooms with sea view and balcony, breakfast included to die for, sun roof with bar and fabulous restaurant and service, beautiful pool which we didn’t use in early May and a lovely lovely staff!"}, {"username": "Rosemarie Gareri Conca", "comment_text": "Bella de serene"}, {"username": "John Layman", "comment_text": "The Plaza"}, {"username": "Roxanne Perrone", "comment_text": "Hotel Corallo"}, {"username": "Judy Bessette", "comment_text": "We loved Maison II Conservatorio. Great staff and location. Right in center of everything."}, {"username": "Brittany Tumulty", "comment_text": "Grand hotel capodiamonte! Stunning property"}, {"username": "Suzanne Grundy", "comment_text": "Hannah Brxwn check some of these hotels out"}, {"username": "Tammy Alford Hall", "comment_text": "Hotel Capodimonte"}, {"username": "Jani Ahmad Lilly", "comment_text": "Grand Hotel La Favorita!! We were there June of last year! Beautiful 5 star hotel with stunning views!"}, {"username": "Hollie Barcheck Juersivich", "comment_text": "Grand Hotel Flora"}, {"username": "Donna Pompei Lembo", "comment_text": "https://\nwww.delavillesor\nrento.com/"}, {"username": "Marilyn Caladine", "comment_text": "Without hesitation The Conca Park. ❤️"}, {"username": "Gina Aguilar", "comment_text": "I have stayed at hotel Grand Riviera is the best. I have stayed there 4 times and I love it."}, {"username": "Sandra Francano Richards", "comment_text": "Bellevue Syrene. You will thank me."}, {"username": "Robin Barbera", "comment_text": "Grand hotel de la villa"}, {"username": "Donna Russonello Merlino", "comment_text": "Hotel Plaza Sorrento\nIn the center of Sorrento"}, {"username": "Wendy Robertson", "comment_text": "Anyone stayed at Hotel Zi Teresa? I have 4 nights booked there"}, {"username": "Jill Tingley", "comment_text": "Best bellview serene on cliff!"}, {"username": "Roberta Higgs", "comment_text": "Grand Hotel Riviera. Ten mins walk into the centre, but out of earshot of all the hustle and bustle, awesome place. Can’t fault it."}, {"username": "Melanee Maranto Adams-Chappell", "comment_text": "Hotel Plaza Sorrento! It’s right in the middle of everything!!"}, {"username": "Shelley Albanese Knight", "comment_text": "Grand Compodimonte!! Amazing!!!!"}, {"username": "Juliette Sastrowitomo", "comment_text": "https://\nwww.bougainville\n.it/mobile/en/\n\n5min from the beach. Half hour from Sorrento"}, {"username": "Nancy Fricke Corsi", "comment_text": "Palazzo Jannuzzi Relais"}, {"username": "Vera Pergolizzi Blade", "comment_text": "Hotel Cristina. We were there in May."}, {"username": "Sherry Lynn Hewitt", "comment_text": "Grand hotel cocumella."}, {"username": "Jean Flannery Mehrkens", "comment_text": "Following"}, {"username": "Rebecca Sommers", "comment_text": "Maison la Minervetta was amazing! 💗"}, {"username": "Mary Manning- Cicciarelli", "comment_text": "Minerva sorrento"}, {"username": "Judith Lamas", "comment_text": "Hotel Caravel"}, {"username": "Lauren Van Bavel", "comment_text": "100% recommend Hotel Miramare. We've stayed 3 times and look fwd to our 4th visit."}, {"username": "Czecie Reyes", "comment_text": "Hotel Leone"}, {"username": "Nicole Dillon", "comment_text": "Following"}, {"username": "Cecilia McDaid McCann", "comment_text": "Grand Hotel Ambasciatori 🇮🇹"}, {"username": "Callis Chen", "comment_text": "Sorrento\nGrand Hotel De La Ville\nhttps://\nwww.delavillesor\nrento.com/"}, {"username": "H Raymond Fasano", "comment_text": "Hotel Vesuvio. Big rooms and they have a pool. 10 minutes to the Marina"}, {"username": "Ronel Gouws", "comment_text": "We book at Vhome"}, {"username": "Debra Zee", "comment_text": "Hotel Savoia Sorrento.\nFair price, central for walking, good breakfast,, clean, family owned"}, {"username": "Lisa Gelsomino Hennessy", "comment_text": "Hotel Minerva"}, {"username": "Lorraine Alexander", "comment_text": "Grand Grand Hotel Vesuvio - Sorrento ❤️❤️❤️"}, {"username": "Nancy Woods", "comment_text": "We stayed in the junior suite at Hotel Ambasciatori It was awesome!!"}, {"username": "Francesca Skelton", "comment_text": "Grand hotel Capo di Monte. Absolutely beautiful"}, {"username": "Emma Butcher", "comment_text": "Hotel Plaza Sorrento"}, {"username": "Diana Ferro-Rodrigues", "comment_text": "Hotel corallo"}, {"username": "Thomas Harris", "comment_text": "Hotel Bristol"}, {"username": "Paul Witham", "comment_text": "Minerva , Bristol"}, {"username": "Mary Evans", "comment_text": "Hotel mediterraneo"}, {"username": "Brian LaMantia", "comment_text": "Hotel Christina. Stay there last yr great place , free shuttle from train & into town ,swimming pool breakfast"}, {"username": "Anne Mc Namara", "comment_text": "Hotel Tourist.5 minutes walk from Train Station and a couple of minutes walk to lots of restaurants and shops.. has a pool in a lovely garden area and very good price. We were there in October and it cost €470 for 5 nights between tow of us"}, {"username": "Patty Cinke Kornbluh", "comment_text": "Has anyone stayed just outside of Sorrento at Grand Hotel Du Golfi? Reviews are amazing especially the views and we have booked for next May."}, {"username": "Sue Gorman-Ellens", "comment_text": "We have stayed at the Conca Park a few times, lovely hotel and a very short walk into town too 😃"}, {"username": "Sandy Radican Shikaly", "comment_text": "Grand Hotel La Favorita 5 star property!!!"}, {"username": "Donna Watson", "comment_text": "Michelangelo was spectacular and location was perfect"}, {"username": "Christine Sanci-Gentile", "comment_text": "Hotel Grand President"}, {"username": "Hermineh Topalian", "comment_text": "Travel is must important not hotel"}, {"username": "John Selvaggio", "comment_text": "Imperial Hotel Tramantano and Grand Hotel Royal are favorites, and Minerva is very nice on a budget"}, {"username": "Freya Humberstone", "comment_text": "Hotel Conca park"}, {"username": "Karen Sailer DeVries", "comment_text": "Hotel Minerva."}, {"username": "Mary Ann", "comment_text": "We stayed here and it has a gorgeous pool, excellent meals and amazing view!! https://\nwww.facebook.com\n/hotelhermitage"}, {"username": "Lisa R Royster", "comment_text": "We stayed at Sorrento Dreams and it was amazing!"}, {"username": "Eileen Angileri", "comment_text": "We stayed at a gem just outside of Sorrento. Hotel Baia de Paulo. Absolutely stunning on the beach. 3star and cheap for it positions."}, {"username": "Samina Jassani", "comment_text": "Has anyone stayed at this hotel ?"}, {"username": "Darryl Vanstone", "comment_text": "Hotel Corallo Sorrento"}, {"username": "Nancy Incorvaia Mullin", "comment_text": "Sorrento flats"}, {"username": "Tina Orzolek Petrone", "comment_text": "Beautiful hotel and location https://\nwww.googleadserv\nices.com/\npagead/\naclk?sa=L&ai=DCh\ncSEwiyuvrFqaqAA\nxVS8MgKHTXgCfoY\nABACGgJxdQ&ae=2\n&ohost=www.goog\nle.com&cid=CAAS\nJORoZbZOFay8QPW\n2SrnnLDeHXtJHhY\nJQtbQnrJM1axftR\n5SbuA&sig=AOD64\n_3BO9M8aDOJfvAp\nayN2HUGfYJx1_A&\nq&adurl&ved=2ah\nUKEwjDufLFqaqAA\nxV5F1kFHdu_CXIQ\n0Qx6BAgPEAE"}, {"username": "Eileen Kirk", "comment_text": "Hotel Royal best view, best breakfast and outdoor bar. Walk to everything on the water"}, {"username": "Rachel Bradfield", "comment_text": "The Grand Capodimonte"}, {"username": "Chloe Hinson", "comment_text": "Is it for just two of you? Would you be open to an air b+b? If so I have a recommendation!\n\n\nB+B Veru, it’s just behind the train station & it’s on Corso Italia. Very very central everything. Can be booked on their site, Airbnb app or Booking.com. We stayed in June & we’re going back next year. The host went above & beyond for us & was communication was amazing. Apartment/room itself was perfect. So clean, modern & perfectly located.\n\nhttp://\nbbverusorrento.c\nom/it/"}, {"username": "Virgz Van Møøre", "comment_text": "Palazzo Montefusco"}, {"username": "Lisa Martinez", "comment_text": "Definitely Hotel Conca Park!!"}, {"username": "Sarah Wood Armstrong", "comment_text": "Villa Oriana Relais"}, {"username": "Frances Scannapieco", "comment_text": "Hotel Antiche Mura. I have stayed there 4 times. Right in the center of Sorrento. Fabulous hotel"}, {"username": "Tiffany Hadfield Merrill", "comment_text": "Hotel mignon, small & quaint ❤️"}, {"username": "Tanya Cini-Kirk", "comment_text": "Hotel Rivage!!! Clean, really nice, perfect location with great view"}, {"username": "Sheila Grant", "comment_text": "We liked hotel grand Vesuvio !\nHas a courtesy bus up the hill ! Beat views and pool and gardens"}, {"username": "Renee Giordano Norton", "comment_text": "Grand Hotel Capodimonte"}, {"username": "Gladys Marziotto", "comment_text": "Hotel michalangelo"}, {"username": "Sasha Childs", "comment_text": "Nastro azurro, not in the centre but has a courtesy bus that takes you in and out"}, {"username": "Bethany Morrow", "comment_text": "Hotel Lorelei Londres"}, {"username": "Wendy Bey-Sottovia", "comment_text": "Hotel Corallo!"}, {"username": "Frances Larin", "comment_text": "Hotel Capodimonte"}, {"username": "Jono Roland", "comment_text": "Majestic Palace Hotel"}, {"username": "Ann Marie Laface", "comment_text": "La Favorita"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Hotel Victoria"}, {"username": "Dan Trudi Flynn", "comment_text": "Hotel De La Ville"}, {"username": "Wendy Else Sparks", "comment_text": "Grand Hotel Capodimonte"}]}, {"id": "2199440983788313", "text": "I will be in Catania for several days and plan to fly to Rome for a single day and fly back to Catania that night. What are must dos if I only have one day? Are the Colosseum and Vatican City doable on the same day? Bonus points for things to do in Catania?", "link": "facebook.com/groups/1373361046396315/permalink/2199440983788313/", "likes": 0, "comments": []}, {"id": "2199440993788312", "text": "I am traveling soon to Italy with my family and my cousin’s family 🇮🇹!! Any advice in any aspect ??? We are doing a road-trip around Italy.", "link": "facebook.com/groups/1373361046396315/permalink/2199440993788312/", "likes": 0, "comments": [{"username": "John Sampson", "comment_text": "Brilliant..try the South..amazing ..same as the North but less stress....beaut\niful country"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2199443263788085", "text": "Hi all, apologies if this is a silly question. I have problem feet and need really good arch support. I have dressy leather flop flops that I was planning on taking with me, but I read some museums and restaurants won't let me in, and in general flip flops are only worn to the beach. Is this really the case?\nSo far I can't find sandals that I would be able to walk all day in unfortunately :(\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2199443263788085/", "likes": 17, "comments": [{"username": "Susan Brooks", "comment_text": "I just returned from Italy and no one was wearing flip flops."}, {"username": "Maria Coladangelo Ducca", "comment_text": "Sort of true. Basilica is very holy . Yes flip l flop are beach attire. Try a Vionic brand sandal. They have an arch support . Wear before you go on holiday. A dressy Birkenstock? Try Nordstrom . All big towns in Europe lots of walking . Off the main tourist attraction expert cobblestone. Try a clean white sneaker ( if Trinny Woodall can do this with a Prada dress so can we. Good luck"}, {"username": "Rosslyn Patience", "comment_text": "Maybe get some orthotics made that suit your feet. Then buy shoes the orthotics will fit into."}, {"username": "Ann Conlin Cantatore", "comment_text": "Dressy leather flip flops should be fine. Dollar tree flip flops would be frowned upon"}, {"username": "Pam Kimak", "comment_text": "Taos sandles... lots of support. I wore them everywhere."}, {"username": "Kristen Taylor", "comment_text": "I found Hokas and I’m never going back! I have hammer toes on both feet, a missing toe on my left foot, a fallen arch and Diabetic Charkot foot on my right foot, and must wear expensive custom orthotics in all shoes. Both regular and wide width Hokas work. I wore the same pair every day on my recent trip to Greece & the islands. Never felt more support or comfort than in my Hokas. I’m a believer!"}, {"username": "Blenda Johansen-Rodriguez Del Rio", "comment_text": "Try Vionics; the best!"}, {"username": "Dianne Lieb", "comment_text": "I have Morton's Neuroma and had Bunion surgery. I need a good arch support as well. I just bought Baretraps sandals Jaxen Sandal. They are so comfortable."}, {"username": "Mary Ellen Maatman", "comment_text": "I have very high arches. Skechers arch fit sneakers were fantastic and I wore them everywhere. Oerfectly acceptable at all places."}, {"username": "Kerrin Barassi", "comment_text": "Regardless of foot issues remember Italy is full of cobblestones & stairs! Are your flip flops going to be safe if it’s raining? Will they support your ankle if you jar it on uneven ground? Are you happy to carry bags wearing thongs? Oops flip flops 🩴🩴. Save them for the beach (which is often uneven pebbles too) & wear runners, your feet will thank you"}, {"username": "Leila Jane", "comment_text": "People fall all the time in Europe because of the cobblestones and uneven pavement and steep stone stairways. Flip flops can be dangerous as they do not give enough support to your feet and ankles. I like Teva sandals that stay strapped to my feet."}, {"username": "Sandra Yee", "comment_text": "Wear them and if staff stops you, explain your special needs to them and more likely than not, they’ll let you through. 💕💕💕"}, {"username": "Gill Martini", "comment_text": "Flip flops are only used to go to the beach"}, {"username": "Katie Beth", "comment_text": "Please try and wear sneakers if you can. I have bad feet and made the mistake of touring Spain in what I thought was going to be a good supportive pair of sandals and it was excruciatingly painful, the cobblestones make it worse. I ended up buying sneakers before we arrived in Italy and I am soooooo glad I did as the streets were worse there"}, {"username": "Katie White-Meade", "comment_text": "Sketchers have a sale on at present. Lots of people swear by them and the comfort. Nurses wear them."}, {"username": "Lisa Flanders", "comment_text": "We were in Europe for a month and I wore my Yellow Box flip flops every single day!!\nI did read an article that said that’s how they know that you’re an American!! 🤣"}, {"username": "Jennifer Larese Taylor", "comment_text": "Literally no one cares what you wear on your feet. Wear what you want"}, {"username": "Bob Dook", "comment_text": "Check with New Balance. They have trainers for different type of feet and walk, with various widths too."}, {"username": "Pamela Bongas McIntyre", "comment_text": "We were in Italy in May and everyone was wearing white sneakers even with dresses. Get a pair with really good arch supports like Brooks or On clo￼udflyers. If you’re wearing sandals, try Bzees- they have excellent arch support for people who have high arches. Good luck and enjoy!"}, {"username": "Carrie Jaquess", "comment_text": "I’d be afraid to wear flip flops on all those uneven pavers/\ncobblestones! Try NAOT or Finn Comfort sandals. I also have problem feet and these work for me. Also the footbed is removable so a good shoe repair place can add additional arch support to the underside of the footbed if needed."}, {"username": "Donna Brannon Hudson", "comment_text": "Check to see if your flip flop brand make any regular sandals & if they do, give them a try rather than the flip flops. My podiatrist & foot surgeon told me to never wear flip flops."}, {"username": "Georgeann Farinacci Greene", "comment_text": "Try Vionic brand or Hokas"}, {"username": "Wendy Harrison", "comment_text": "I wear Tevas. Not sure if you've tried them. Never flipflops."}, {"username": "Mary Gregory", "comment_text": "Wear sneakers"}, {"username": "Kellie Dullaghan", "comment_text": "Try Abeo brand, find them and others for high arches at:\nthewalkingcompa\nny.com"}, {"username": "Anne Davidson", "comment_text": "If you cant afford or dont have time to get proper orthotics look for something like Superfeet an orthotic type insert and buy shoes that let you insert them. In italy you can find shops that sell comfortable orthopedic type shoes."}, {"username": "Bea Kuckens", "comment_text": "You don't want to walk on cobblestone streets in flip-flops. Get some good leather supportive walking shoes. I have walked all over Europe in my SAS walking shoes. Not stylish, but seeing the young girls in the equivalent of combat boots with skirts, I don't think they look bad ;)"}, {"username": "Sara Kyle Hargett", "comment_text": "I would never wear flip flops there. Good tennis shoes all the way"}, {"username": "Danielle Seal", "comment_text": "I was in Italy in may and I wore Clark’s cloud steppers Sandal/ flip flop and I wore them everywhere and no issues.. I also have issues with my feet but they are great and comfortable.. we also did a lot of walking, best I found so far"}, {"username": "Patti Farrell", "comment_text": "Flip flops are not good for your feet"}, {"username": "Lisa Kelly", "comment_text": "I’ve worn my Teva wedge flip flops all over Italy and nobody cares. I wore Bzees in the Vatican though (have you tried those? So comfy!)"}, {"username": "Crystal Waltz", "comment_text": "I have bunions that are very annoying. I love wearing sandals so took a pair of Eddie Bauer hiking sandals, a pair of Skechers sandals, and a pair of tennis shoes. After one day in sandals, I stuck to tennies the rest of my Venice visit. They were so much better on my feet."}, {"username": "Kit Nader", "comment_text": "I woukd just wear what u want ....chances are no one will look at your feet"}, {"username": "Lisa Abrams Argento", "comment_text": "Bionic have some good ones."}, {"username": "Linda Love Vines", "comment_text": "https://\nus.ecco.com/\necco-womens-flow\nt-wedge-cork-sa\nndal-0194890573\n086.html?gclid=\nEAIaIQobChMIg7C\nWl5KqgAMVluDjBx\n2PRg3SEAQYAiABE\ngLtJvD_BwE"}, {"username": "Alicia Cox", "comment_text": "I also have recurrent plantar fasciitis plus a high arch. I have great luck with Keen Newport, Brooks Adrenaline, allegria TRAQ tennis or sandal. Go to a store that specializes in foot issues if you have one & focus on comfort & support not cute because you will walk A LOT on all types of uneven stone & you will be glad at the end of the day!"}, {"username": "Nancy Day", "comment_text": "I have arch issues and have Vionics that are good"}, {"username": "Lauren-Jade Roberts", "comment_text": "I wore leather flip flops for 10 days in Italy no issue"}, {"username": "Gwen Reuben", "comment_text": "I can wear ABEO sandals all day . Good arch support."}, {"username": "Pam Gerretsen", "comment_text": "I've worn a variation of these for years, definitely been in the Vatican a couple of times in them, and they're super comfy to walk in for me. Admittedly I don't have any foot problems, so may not be the same for you, but hope that helps."}, {"username": "Maru Sya", "comment_text": "Thank you everyone for your awesome recommendations\n!! I checked out all the brands you recommended. Dansko, Sketchers, Ecco - not enough arch support for me...birkenstoc\nks - love them, got 3 pairs but I wanted something more elegant :)) Teva, Merrill no arch support and sporty look. Abeo, Taos, Naot, Orthotheet- Going to order a pair to try."}, {"username": "Tonsia Keytel", "comment_text": "I also have issues with my feet, I bought a pair of Hoka shoes and wore them every day for 5 weeks, a lifesaver and never had a problem with my feet, walked at least 15000 steps each day and sometimes more, great for cobblestone streets! Best $180 I ever spent on shoes."}, {"username": "Jody Holwadel Thomas", "comment_text": "Aetrex is excellent for arch support! They have inserts, sandals and tennies - I swear by them. Hokas for extra cushion and you can get an Aetrex insert if needed!"}, {"username": "Laura Uribe", "comment_text": "I have never had an issue after countless trips. I wear flip-flops in the evening because I have really narrow feet and can never find sandals to fit. And then I wear sneakers during the day when we’re walking."}, {"username": "Phyllis Snyder", "comment_text": "They can deny you entry- or you might slip by. Just be prepared."}, {"username": "Hollie Barcheck Juersivich", "comment_text": "I just has foot reconstruction surgery in Dec. Ì brought my Hokas during the day and my Vionex for night life. TIP OF THE DAY!!! I got break away ice packs from Amazon for swelling at night. It wasn’t the best, but it was better than nothing."}, {"username": "Bonnie Fitzpatrick Feick", "comment_text": "I just did 30,000 steps a day in Paris with my problem feet wearing Fit Flop sandals with a back strap. They have lots of arch support. (This sounds like an ad but I swear I have no connection to the company. 🙂 )"}, {"username": "Bill Elias", "comment_text": "Check out an Ecco store. If you need firmer arch supports, they sell insoles that you can simply swap out in your shoes. You can even travel with both pairs of insoles if you want to fool your feet into thinking that you’re wearing different shoes."}, {"username": "Bobbie A. Lewis", "comment_text": "Vionics are the best, in my opinion. They are now making dressier shoes with awesome arch support. I really love their flip flops though."}, {"username": "Raelyn Werbish Zeilinger", "comment_text": "Birkenstocks hands down best for my awful feet !"}, {"username": "Barbara Pasteris Allen Hettlinger", "comment_text": "I've had good luck with Merrell's sandals which have very good arch support."}, {"username": "DeAnna Pulliam Like", "comment_text": "Keen sandals! Great all-around sandals for all-day wear. Don't know if there is a pair that would be dressy enough for what you are looking for. More sporty."}, {"username": "Sarah Chenoweth", "comment_text": "Check out cushionaire sandals."}, {"username": "Mary Ann Brown", "comment_text": "Hokas are the bomb"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Flip-flops in Italy? You’ll fall flat on your face on the cobblestone lol! Save them for the beach or just out￼ to eat but not for walking … get a pair of good walking sneakers, I know I don’t like them either, but it’ll save you !!!"}, {"username": "Dana Green", "comment_text": "The Dr. Scholl’s tennis shoes are great and so are Sofft sandals. I wore those while in Italy. Walked 1000’s of steps and never had sore feet."}, {"username": "Barbie Phillips", "comment_text": "I have major feet issues including a torn plantar fasciitis & torn joint. I did NOT take flip flops. I found a pair of￼ tevas that have multi colors. They worked awesome! My feet didn’t hurt when I wore them through Rome. Tuscany, & Florence."}, {"username": "Denise Grinols", "comment_text": "I went to a store that sold walking shoes and bought a good pair of leather shoes that provided arch support and were comfortable all day. You do not want to wear open toed shoes in public with all the disgusting germs etc"}, {"username": "Debi Sicurella Krulisky", "comment_text": "Vionic sandals are great for poor feet…"}, {"username": "Janet Messanelli Bozzone", "comment_text": "No restaurant or museum (that I know of) is going to deny you entry if you are wearing flip flops. I wear Vionics and can walk for miles in them. They are not beachwear and I have several styles. (I just ordered 3 new pair…don’t tell my husband. Lol). You will be fine."}, {"username": "Linda Jo Rice", "comment_text": "I need that too.."}, {"username": "Susan Lowry Lamb", "comment_text": "I've had insane foot issues over the last few years, and the last few times I've gone to Europe I have lived in Oofos flip flops because of them. You can take a real pair of something cute to change into for dinner if you feel the need."}, {"username": "Diane Davis Lawyer", "comment_text": "Look into Orthofeet sandals."}, {"username": "Lisa Owyang Anton", "comment_text": "I love the Dansko Tanya sandals- great arch support and I can walk in them all day."}, {"username": "Oldriska Balouskova", "comment_text": "I have traveled in Birkenstock sandals all over Italy and never had any problems in museums or restaurants"}, {"username": "Patti Farrell", "comment_text": "Try NAOT SANDALS"}, {"username": "JeriLynne Clifford", "comment_text": "As someone who used to manage a podiatrist office he said 50 percent of people’s foot problems are because of wearing poor foot wear ie flip flops.\nI would try some sneakers. All of the walking you will be doing your feet will thank you. Some supportive nice sandals for dinner perhaps."}, {"username": "Holly Weller", "comment_text": "Skechers sandals"}, {"username": "Rhona OConnor", "comment_text": "No one will look at your feet.. Wear what ever works for you as there is lots of walking."}, {"username": "Marie Cuzzi", "comment_text": "I wore flip flops without any issues"}, {"username": "Elena Innocenti", "comment_text": "nobody cares about your shoes, unless you go to fancy restaurants or clubs."}]}, {"id": "2199444300454648", "text": "PLEASE HELP! Do train tickets purchased directly from ITALO have the names of the passengers on the tickets?\nI've registered an account on the ITALO website and when I go to buy 2 tickets, the second passenger field will only accept my name and not my husband's. So when I try to check out, it has my name listed twice for both tickets. Has anyone had trouble with this? Do purchased tickets actually have passenger names on them?", "link": "facebook.com/groups/1373361046396315/permalink/2199444300454648/", "likes": 1, "comments": []}, {"id": "2199451230453955", "text": "Great boutiques in Amalfi/Positano/Sorrento/Capri/Naples! I need to come home with some cute clothes, bags & shoes!!👠💃🏽🛍️", "link": "facebook.com/groups/1373361046396315/permalink/2199451230453955/", "likes": 23, "comments": [{"username": "Meghan Konopka", "comment_text": "Lei Valle de Mulini in Amalfi they are certified authentic limoncello and they have other various local items as well. Their lemon honey is delicious!! They’ll also ship. I think we paid about €50 for shipping to the US. There’s a few different sandal makers in Capri, I recommend La Capri Chic in AnaCapri! They were awesome."}, {"username": "Tara Roed", "comment_text": "We had shoes made here\n\nhttps://\nnanapositano.it/\nen/"}, {"username": "Simona Ptichka", "comment_text": "In Capri - designer boutiques- very nice\nIn Sorrento - lots of shops as u walk between buildings esp linen clothing\nIn Positano- Luisa’s boutique ( dresses tops, etc )"}, {"username": "Jim-Holly Ballew", "comment_text": "Sorrento has several super cute “ linen” stores"}, {"username": "Meredith Williams", "comment_text": "nana positano makes sandals! so many options"}, {"username": "Rachel Finkle", "comment_text": "CB in Positano!"}, {"username": "Bri Flosi", "comment_text": "Carro in positano had great bags!"}, {"username": "Maria Coladangelo Ducca", "comment_text": "All over main tourist strip . The best deals are in the markets!!!"}, {"username": "Gina Spyker Fairfield", "comment_text": "Antonella Ferrante in Sorrento for cute leather bags and gloves"}, {"username": "Evelyn Trager Jose", "comment_text": "Antica Sartoria - Should be in all those locations! Affordable resort wear and gorgeous patterns"}, {"username": "Ashley Martins", "comment_text": "Had a pair of sandals made here in Sorrento, so cute & comfy. Wish I would have bought more then the one pair."}, {"username": "Lydia Sydnor", "comment_text": "CB Positano !"}, {"username": "Jenny Payne", "comment_text": "Fashion boutiques are everywhere. Rome, Naples,Florence\nthe list can go on and on 🌻"}, {"username": "Sarah Kam", "comment_text": "Is shopping expensive in Amalfi? I heard it is really pricey!"}, {"username": "Terina Kwiatkowski", "comment_text": "Best boutiques or in Revello🇮🇹￼"}, {"username": "Liz Corradi", "comment_text": "La Capri Chic in AnaCapri for sandals. You design your sandal and they will make it while you wait. Vincenzo and Luca are the best."}, {"username": "Virgz Van Møøre", "comment_text": "Borrelli Boutique in Naples"}, {"username": "Stephanie Gibbs Boothe", "comment_text": "Definitely CB in Positano!!"}]}, {"id": "2199453560453722", "text": "Trying to get from Spoleto to Montecatini Terme on September 2nd, leaving Spoleto around 10am - 12pm, but it doesn't look like there's a good train that day. All I'm finding is 8 hour routes..... is there a good alternative I could use? That doesn't have a bunch of transfers preferably 🫣", "link": "facebook.com/groups/1373361046396315/permalink/2199453560453722/", "likes": 2, "comments": [{"username": "Louis Des Forges", "comment_text": "If its a Regional train there is no advantage of booking in advance-the fare is the same on the day and you cannot book a seat."}, {"username": "Louis Des Forges", "comment_text": "The only train worth buying tickets for in advance is Florence to Rome. The rest of your trip will need to be by regional train or bus which you cannot book reserved seats for."}, {"username": "निनावी सहभागी", "comment_text": "Thank you for the info!!"}, {"username": "Benedetta Vanni", "comment_text": "Unfortunately both your origin and your destination are off the high speed lines therefore you will not be able to avoid transfers."}, {"username": "Brenno Bianchi", "comment_text": "The railway between Pistoia and Montecatini Terme is interrupted until the third of september for works related to the ongoing doubling the truck. There is a bus instead for that leg, but makes the jorney longer and with one more change."}, {"username": "Brenno Bianchi", "comment_text": "These two solutions are likely the best"}]}, {"id": "2199454840453594", "text": "Question for those of you who have visited wineries in Tuscany. Are they kid friendly? I have a very well behaved 13 year old who I would be traveling with.", "link": "facebook.com/groups/1373361046396315/permalink/2199454840453594/", "likes": 14, "comments": [{"username": "Billie Begley", "comment_text": "All of Italy is kid friendly. We saw kids on our winery tours. I think the more important question is if he will like it or be bored."}, {"username": "Irfan Mahmood", "comment_text": "😃"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Normally they are kids friendly, maybe ask before if there is some issue (maybe for insurance reasons entering wine cellars) but I highly doubt it.\nHe probably will also be able to sip something from your glasses, so he can start wine appreciation the Italian way 😁"}, {"username": "Jessica Asquith Hemphill", "comment_text": "Absolutely! They even let my daughter(15) have a smaller tasting. We don’t let her drink at home but they sample at very young ages there. This one was beautiful and they did a wine pairing with lunch so the kids didn’t get bored! https://\nwww.altieroinchi\nanti.it/en/\ntastings/"}, {"username": "Pom-Eric Doland", "comment_text": "Curious what wineries you were considering? We will be traveling in November with 2 teenage kids and we’re curious too!"}, {"username": "Brian Yonks", "comment_text": "They are not age crazy like we are. Enjoy. Order what you like and have them ship it to the US."}, {"username": "Paola Zirpola", "comment_text": "Just got back and we had a 19 year old 2 16 year old and a 14 year old. It was all good"}, {"username": "Cameron Smith Bradley", "comment_text": "I took mine on one"}, {"username": "Jessica Biggs", "comment_text": "Everywhere we have been it Italy has been kid friendly!"}, {"username": "Holly Hall", "comment_text": "We brought our kids! Only issue is the kids might be bored."}, {"username": "Kristy 'Bartlett' Blosch", "comment_text": "We’ve taken little kids and they kind of enjoyed it. During the tasting part, they brought the kids a little charcuterie plate and some juice."}, {"username": "Nicole Cervantes Hollywood", "comment_text": "My kids were younger and sometimes offered a taste. He’ll be fine. The tours can be educational and entertaining too."}, {"username": "Maria Coladangelo Ducca", "comment_text": "I would call and inquire ."}, {"username": "Bill Elias", "comment_text": "I’m a native Californian. My parents took my brother and I along when they went wine tasting in the 70s when I was that age. The information is interesting - and if there’s a wine cave, it’s a plus."}, {"username": "Paige Montecalvo", "comment_text": "I found all of Europe and even Morocco to be very kid/family friendly. Every airport had family lines, and it seemed every place we went had kids and families everywhere. This includes some “fancy” places for dinner in Positano and Venice, tours that I would consider more for “adults”, etc. Acting inconvenienced by children seems to be very American 😂"}, {"username": "Sarah Enterkin Masenthin", "comment_text": "Italy LOVES kids,"}, {"username": "Rebecca A. Baer", "comment_text": "Shouldn't be a problem!"}, {"username": "Barbara Brosnan", "comment_text": "Our family of 5 loved it. Kids 13, 16, 21"}, {"username": "Diana Granado", "comment_text": "He’ll love it"}, {"username": "Lisa McMurchie", "comment_text": "Thanks everyone!"}, {"username": "Ashley Martins", "comment_text": "Very kid friendly & will even ask you if it is ok to offer wine to them."}, {"username": "Margaret Ryan", "comment_text": "It's Italy 🇮🇹. Adatto ai bambini 🥰"}, {"username": "Aymée Hogbin", "comment_text": "The one we did (with our 4 kids, ages 6 up to 15), they said all the kids could taste the wine because they’re over 4! We didn’t take up the offer, much to the kids disappointment,\nbut they had an absolute ball, they loved it & were very welcome!"}, {"username": "Romina Lauretig Toscano", "comment_text": "We love kids in Italy :)"}, {"username": "Sarah Clark Akeroyd", "comment_text": "Yes 🙌"}, {"username": "Linda Brande Battaglia", "comment_text": "They have shorter wine tasting ones. Plus if you google wine tasting/farm with animal petting zoo is also good for smaller children so parents can seat and animal farm was right there."}, {"username": "Patty Ham", "comment_text": "Yes"}]}, {"id": "2199455023786909", "text": "Hi! Can I have suggestions on how much time is needed in each of these places please? Don’t want to feel like we are just traveling the whole time.\nMilan, Venice, Tuscany area, Rome, Sicily?\nThank you.", "link": "facebook.com/groups/1373361046396315/permalink/2199455023786909/", "likes": 5, "comments": [{"username": "Connie Wilson", "comment_text": "Milan 2 nights, Venice 3 nights, Tuscany 5-6 nights (including a trip to Florence), Rome 4-5 nights, Sicily 7 nights minimum."}, {"username": "Maria Ariano", "comment_text": "It depends on what, and how much, you want to see... I've been going to Venice at least once a month all my life, and there's still lots to see. Ditto for Rome.\nPersonally, I'd much rather take it easy and see well one or two major sites than try to cram everything in 1 day."}, {"username": "Thomas Jensen", "comment_text": "I would say at least a year to see all of it..🤔"}, {"username": "Matthew Cawley", "comment_text": "Rome no more than few days (2-3), Tuscany depends on your plans for 4-5 days"}, {"username": "Danielle Labossiere", "comment_text": "Following"}, {"username": "Valerie Collanton", "comment_text": "A lifetime ! (But in the alternative)I would say Milan - 2 nights; Tuscany 6-7 nights; Rome 4 nights; Sicily 7-10 nights."}, {"username": "Roland Trego", "comment_text": "Milan 1 for sights, more for high-end shopping if that appeals to you. Venice minimum 2 full days and nights. Tuscany 2 for Florence and 2-3 for Siena, Lucca, San Gimignano. Rome 4 days. Sicily 5-6. Of course, you could spend more in all of them."}, {"username": "Lisa Adams Robertson", "comment_text": "We did a tour of Sicily for 11 days, which was amazing, but there's still much we didn't get to see!"}, {"username": "Joe LaLonde", "comment_text": "You’ll just scratch the surface of each to attempt all, given a normal holiday timeframe. At the very least, drop Sicily and try to do it alone in the future. I spent 11 days there last year and only tried to see the western half, it was too rushed for just half of it."}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "Would break trip up into 2 visits: North and South. Don’t spread yourself thin, best experiences come from lingering, savoring and immersing oneself."}, {"username": "Bridget Gieseke", "comment_text": "I would suggest 3-4 days in each city… longer for Rome & Tuscany. Gather you’re staying at airbnbs’s? Marriott hotel points users get the 5th night free when booking with points.. always recommend that if you’re a Marriott person."}, {"username": "Graham Sherlock", "comment_text": "3 nights in Rome is perfect. Stay in Lucca for a week and explore Tuscany including Florence. 3 nights in Venice."}, {"username": "Gilda Capraro", "comment_text": "Great question. Travelling can drain our energy, and create needless stress. Couple of things: You've mention 3 cities, and 2 regions. Tuscany is vast, and Sicily even more vast, geographically.\n\nYou have to decide what you want out of the 2 regions, and narrow down where you will focus your stay. I'd suggest watching some youtube videos from well rated sources.\n\nAs for the cities - Milan, Venice and Rome, honestly, for me a week in each would not be enough. I recently spent 3 days in Venice and later on, a week in Milan, and I really wish I had done a full week in Venice, and 10 days in Milan.\n\nI get that folks are strapped for time, but how I pulled off longer stays, was to sacrifice other short term travel I might have once done at home. Haven't had a winter vacation in about 8 years (as a Canadian \"snowbird\" that really IS a sacrifice. LOL). But at the end of the day, rushing through Italy at breakneck speed ticking stuff off of a \"must do\" list, just does not work for me. It is the opposite of what the lifestyle in Italy is about."}, {"username": "Benedetta Vanni", "comment_text": "Tuscany only could take 2 weeks if you are into hiking and swimming besides art and history."}, {"username": "Dixie Kotylak", "comment_text": "I’ve kind of felt that…I think in future I will do two days minimum each place, one day to explore, one day of down time. 👌🏻"}, {"username": "Tommy Jenkins", "comment_text": "I would say 12-16 months each location just a guess. I’ll let you know in 3 weeks when we get there for the first time !!! Wooo Hooo !!"}, {"username": "Barbara Bastianini", "comment_text": "It really depends on what you want to see and do in each location. And on your individual\nInterests and travel style.\n\nFor me I’d break it down approximately like this\n\nMilan 2 full days.\nVenice 4 full days\nRome 5 full days. Or more\nTuscany is a whole area with countless cities and towns. So maybe a full week.\nSicily. Also a full week.\n\nNaturally even more time in each place would be better."}]}, {"id": "2199455403786871", "text": "Why does every single train option on ANY day say “this travel solution refers to the next day?” I’d love some help. 🤦🏻‍♀️ I’m trying to book tickets for 8/22 on frecciarossa from Roma Termini to Napoli Central.", "link": "facebook.com/groups/1373361046396315/permalink/2199455403786871/", "likes": 9, "comments": [{"username": "Grace Scinto", "comment_text": "Try the Trenitalia page. I just had a look and there is no problem with it."}, {"username": "Peach Panfili", "comment_text": "Book on the Trenitalia site and make sure you put in the correct times you want to travel including the correct date."}, {"username": "Daniela Benzoni", "comment_text": "Daniela Benzoni"}, {"username": "Chris N Lynn", "comment_text": "use 0:00 instead of a time and it will give you that days schedule. Or, choose the previous day to see all of the schedule."}, {"username": "Jocelyn Blanke Sia", "comment_text": "Yes! I wondered too. I just chose the previous day to book. 🤷🏻‍♀️"}, {"username": "Stacy Rosenbaum Hochmuth", "comment_text": "I was on Trenitalia website. Let’s hope I have better luck today. Thanks all!"}, {"username": "Sara Beth", "comment_text": "Because of your current time at home. Just check the date."}, {"username": "Jaime Cleek", "comment_text": "Try to do it when you’re on your computer and not your app"}, {"username": "Rachel Gray", "comment_text": "Check the time. You could have a time that’s too late, where the only option is the next day."}, {"username": "Stacy Rosenbaum Hochmuth", "comment_text": "I am booked! I needed the time field set to 00:00."}, {"username": "Fetchin Gretchen", "comment_text": "Try trainline instead. If it dies the same, they are sold out today or you must buy in persin."}]}, {"id": "2199457500453328", "text": "Our train tickets say first class. What does that mean or include?", "link": "facebook.com/groups/1373361046396315/permalink/2199457500453328/", "likes": 14, "comments": [{"username": "Mike Makofske", "comment_text": "Hopefully it means air conditioning. Probably a little more room, too. In my experience it's been worth the extra money."}, {"username": "Sharon Bowns", "comment_text": "You purchased 1st Class Train tickets"}, {"username": "Jorge Ronay", "comment_text": "It means you will get to your destination before everyone else"}, {"username": "Harris Dee", "comment_text": "I bought first class tickets on Italian rail specifically because I knew what the ticket included"}, {"username": "Linda Snaring", "comment_text": "First class is great!!! You get wine and snacks served to you!"}, {"username": "Nadia Filice", "comment_text": "Seat in a specific train and includes drink and perhaps a snack or something else"}, {"username": "Russell Weidner", "comment_text": "Should have assigned seating"}, {"username": "Diana Granado", "comment_text": "I think you’ll get to change the time you embark, but you better check"}, {"username": "Jan Pab", "comment_text": "In Italo and Trenitalia, Business Class in trains is better than what some people call 1st Class, but it’s really premium 2nd class. Just make sure you book Executive Class."}, {"username": "Chante Lugo-Wrecke", "comment_text": "You should get a seat in the first class cabin. Some include a meal and drinks. Why don’t you Google first class service for your particular train."}, {"username": "Cyndi Stich Bleier", "comment_text": "Nothing really. We had first class tickets last month. Got on train and seats were occupied. We were told at last minute our seats had been changed. Went to newly assigned seats also first class and there were people in those seats as well. They said train was overbooked and we were left sitting anywhere we could find a seat 😞"}, {"username": "Camilla Hakobyan", "comment_text": "You’ll arrive first! 😂"}, {"username": "Tanya Black Anderson", "comment_text": "Luggage space, quiet zone, leg room, table"}, {"username": "Renee Rundle Stoneham", "comment_text": "Depends on the train…\nAssigned seats\nSeparate car (look for the 1) usually at front of train, but we had some that were in middle.\n\nWe did not get drinks or snacks 🤷‍♀️\n\nQuieter, less people.\n\nFirst class is nice for longer rides."}, {"username": "Sherry Shannon", "comment_text": "Why do people in this group laugh at everything? Why can’t people just ask questions? Isn’t that what we’re here for?"}, {"username": "Michele Davidson", "comment_text": "Muggy, tell us about your upcoming travels!"}, {"username": "Maria Regalado", "comment_text": "In Italo, we got access to the lounge which was helpful bc there were no seats to wait for the train. After a long day we went a bit earlier to train station and relaxed in loungeC they had snacks and coffee. On the train they gave us a sandwhich and beverages."}, {"username": "Michael Widjaja", "comment_text": "It depends…on freccia you’ll get bigger seat whereas on italo you can get coffee and light meal option"}, {"username": "Judy Stamps Pelitere", "comment_text": "Be sure you get an assigned seat! Even if u are first class. We made that mistake."}, {"username": "Susan Dolin Rothschild", "comment_text": "Italia or Trenitalia? Which line should we use?"}, {"username": "Gregory Hawkins", "comment_text": "Yes more leg room quieter and better seats. Also they come around with snacks and it is usually worth it since it doesn’t really cost that much more."}, {"username": "Jenny Larsen", "comment_text": "Also they have cleaners on the train\nFreed water , snacks , refresher towels etc very comfortable"}, {"username": "Jenny Martin", "comment_text": "It’s all explained on their website- easy to look up"}, {"username": "Michelle Smith", "comment_text": "Food and drink supplied in your carriage more room in your seats"}, {"username": "Amanda Richards", "comment_text": "Comfy seats, quieter cabin, Prosecco & snacks!"}, {"username": "Sandra Cran", "comment_text": "How do you pick the seating with the table in the middle. Is that on the bullet train"}, {"username": "Fadi Carefree", "comment_text": "Delecious food"}, {"username": "Maria Antidormi Corica", "comment_text": "Nothing really"}, {"username": "David James Casey", "comment_text": "Eh I took the train from Rome to Venice … not all scenic but I nearly missed the train to the delight ( not) of my travelling companion.\nMaybe I missed the tannoy but trains are not called like they are in the uk.? ( maybe that doesn’t exist anymore either)\nCaught the train by the skin of our teeth\nFlorence to Rome is a stunning train journey, sigh."}, {"username": "Lynda Dorney Hunt", "comment_text": "We did first and business class all through Italy where we could and wouldn’t do anything less now."}, {"username": "Edoardo Casolo", "comment_text": "It means you will be in first class"}, {"username": "Stephen Albury", "comment_text": "You will will receive beverages and snack kit. Also sitting in a car with limitations ( no phone use and etc )"}, {"username": "Sherry Gilliam Patrell", "comment_text": "Nice , assigned seats, beverages and snack ,charging ports and room for your luggage."}, {"username": "Merilice Finateri", "comment_text": "It's like being on a plane. Very nice"}, {"username": "Meghan Tan", "comment_text": "Didn’t you read what first class entails before you bought a ticket for first class?"}, {"username": "Jamie Ash", "comment_text": "Jamie Ash"}, {"username": "Romind Santos", "comment_text": "I too, was wondering this for our rides. Didn’t know if there was higher ie. Executive, Business, etc"}, {"username": "Dale Kitchen", "comment_text": "Roomier seats."}, {"username": "John Wilson", "comment_text": "Fewer people per car,chairs that fit fatter asses"}, {"username": "Nick Justason", "comment_text": "Took first class up to Venice from Rome, larger leg space, no talking on the phone/music out loud, the only table I could see and some snacks/drink along the way"}, {"username": "Carla Epifani-Worthy", "comment_text": "Do all the seats face forward ? I get motion sickness if not facing forward. Thanks !"}, {"username": "JA Gna", "comment_text": "Leatherette vs. Cloth seats no other difference, ive been on both classes in european trains and thats basically the difference , dont expect first class service like the airlines, and first class coaches are usually the first 2 coaches in the front so technically less walking when you get to hour destination but second class is not bad at all they’re clean and comfy"}, {"username": "Julia O'Brien Holbrook", "comment_text": "Prosecco!! You can get Prosecco instead of water if you’d like. Sometimes it comes with a meal. Definitely snacks"}, {"username": "Claire Barber", "comment_text": "Depends on the train type. On non fast speed trains (frecciabianca)\nlikely no snack."}, {"username": "Steffen Reiter", "comment_text": "You will probably get oysters, caviar and champagne 🤩"}, {"username": "Bennie Allen", "comment_text": "You will enjoy the extra room. When you’re on the train look at the other car seating and you will be glad you got first class"}, {"username": "Courtney Rey", "comment_text": "Taking italia rail from Milan to Venice\nPlease tell me there are cocktails on board 😂"}, {"username": "Debra Evans", "comment_text": "I wish mine said First Class … 🤷🏼‍♀️🤦🏼‍♀️"}, {"username": "Jenny Frank", "comment_text": "It means 1st class.\nIt's all online clearly."}, {"username": "Sharon Krupp", "comment_text": "It depends on the train. We did first and only had 8 people in the cabin and had a cooked meal delivered! It was bliss. They were like large recliners"}]}, {"id": "2199468463785565", "text": "I’m currently in Rome and would love to know where there are affordable clothes for older aged women. Yesterday we walked down Via del Corso and it all seemed to be either for a younger demographic or it was designer. Any suggestions would be much appreciated", "link": "facebook.com/groups/1373361046396315/permalink/2199468463785565/", "likes": 14, "comments": [{"username": "Holly Weller", "comment_text": "Post this and question on a site called Visit Rome you may get some answers there"}, {"username": "Romina Lauretig Toscano", "comment_text": "Oviesse stores are for all ages. You have one big outside metro San Paolo (b line)\nhttps://\nwww.ovs.it/it/\nit/"}, {"username": "Paula Brink", "comment_text": "https://\nca.marinarinaldi\n.com/store/\n0100613"}, {"username": "Paula Brink", "comment_text": "https://\nwww.coin.it/\nit-it/saldi/\ndonna/\n?_gl=1%2Anboayt%\n2A_up%2AMQ..%2A\n_ga%2AMzI1NTU0O\nDE3LjE2OTAyOTk5\nMjc.%2A_ga_TVQP\nK08SD1%2AMTY5MD\nI5OTkyNS4xLjAuM\nTY5MDI5OTkyNS4w\nLjAuMA..\n\nPiazzale Appio, 7 is the address."}, {"username": "Paula Brink", "comment_text": "https://\nwww.rinascente.i\nt/en/\nThis is a department store as is Coin, the one I posted above. Rinascente is on via del Tritone."}, {"username": "Elena Innocenti", "comment_text": "OVS in Via del Tritone have affordable clothes.\nMore expensive in this area are Elena Mirò, Marina Rinaldi, Luisa Spagnoli, Marella…\nInside Rinascente (via del tritone) you can find different kind, from luxury to middle range price."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Rinascente, Luisa Spagnoli, Marina Rinaldi, shops in via dei Coronari, shops in via Cola di Rienzo."}, {"username": "Dawn Britten", "comment_text": "Rinascente."}, {"username": "Linda Haavig", "comment_text": "Try Zara"}, {"username": "Mimi Mary", "comment_text": "Go to the mall\nGalleria Commerciale Porta Di Roma\nYou will find stuff there 3 floors it very nice and there is parking"}, {"username": "Gina Romano Peralta", "comment_text": "Awesome. Love the many suggestions. Are there stores like Target in Rome?"}, {"username": "Michele Campbell", "comment_text": "There are a few nice clothing stores on Via Nazionale. Some like Max & Mara a bit more expensive, some less expensive too"}, {"username": "Daniela Raffio", "comment_text": "We stayed on Via Nationale and the whole street was littered with beautiful clothes shops suitable for all ages"}, {"username": "C Elena Powers", "comment_text": "OVS is a great choice...I've bought quite a few things from them. Good prices too!"}]}, {"id": "2199468567118888", "text": "Did anyone here tried buying frecciafamily thru trenitalia? Im buying tickets for our upcoming october trip (family of 4 2 adults and 2 9 y/o).\nThanks!", "link": "facebook.com/groups/1373361046396315/permalink/2199468567118888/", "likes": 0, "comments": [{"username": "Gillian Docherty", "comment_text": "Yes we did for family of 5"}]}, {"id": "2199476370451441", "text": "Trastevere food tour recommendations? ￼Also, any pros/cons to scheduling through Get Your Guide for tours? Did any of you take their full day wine tour in Tuscany? The one we booked had preference for a younger crowd and stops to shop in a local village. Please share if you did this one! Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2199476370451441/", "likes": 1, "comments": [{"username": "Carissa Lawson", "comment_text": "We used Get your Guide for Trastevere food tour and it was great!"}, {"username": "Marcy Laden", "comment_text": "Did the Twilight Trastevere Rome Food Tour through Eating Europe Rome and it was great!"}, {"username": "Maaria Karpo", "comment_text": "Nannarella, Sabatini, Tonnarello"}]}, {"id": "2199472640451814", "text": "Hi we are in Venice right now -any recommendations for a cevchitti tour and also a seafood restaurant preferably water fee for our 40 th anniversary dinner?", "link": "facebook.com/groups/1373361046396315/permalink/2199472640451814/", "likes": 0, "comments": []}, {"id": "2199477350451343", "text": "Hi!\nI’m hoping to get some help with Lake Como. We are there for two nights and hope to do a lake tour. Just wanting to know what you found is great and affordable. Or will you see most things on the Ferry?\nAlso are water taxis available and affordable?\nThank you, just trying to work out our itinerary.\n🥳🙏", "link": "facebook.com/groups/1373361046396315/permalink/2199477350451343/", "likes": 37, "comments": [{"username": "Tonsia Keytel", "comment_text": "You can’t see everything from the ferries, have to get off in each town. What mode of transport are you using to get there? If train, I would go to Varenna and stay there, short ferry ride to Bellagio and Mennaggio, all very quaint."}, {"username": "JA Gna", "comment_text": "We did this last month a little pricy but well worth it! you can save a bit if you drive yourself but the boat you’ll get is only 40 hp and you dont have any guide. The ferries are a nightmare the lines to buy a tickets are so long and your supposed to be able to buy online but when your in their website it keeps saying nothing is available, W ended up getting in line in Como ticket office at 8am thinking were early finding there was a long line already ended up being in line close to 2 hours finally catching the ferry to Bellagio from como at 10 and arrived in bellagio close to noon , pretty much wasted half of our day, I heard water taxis are pretty expensive but i have not confirmed this and if you travel by bus can take you longer due to traffic and one local told me if there happens to be an accident while your on your way to any town you’ll be stuck in traffic for hours. We stayed in Como for 3 days but if we have to do it all over again it would have been a lot better to just stay In bellagio and have that as your base to visit other towns in lake como."}, {"username": "Monique Swanner", "comment_text": "Getting around como is freaking miserable. We absolutely loved being there, but public transport was extremely unpredictable and unreliable. Busses running late, not way to know if they'll stop where they say they will or when, taxis are few and far between and insanely expensive, so much so that it's hard to even get to the next town over. We decided if we were to ever go back we would absolutely need to rent a car. Every where else we went in Italy was no problem, and our issues were most certainly nothing to do with poor planning."}, {"username": "Ellen Quinn", "comment_text": "Following"}, {"username": "Kim Hull", "comment_text": "I stayed in Varenna and caught the ferry to Bellagio & Menaggio, which was easy. I left at 9am so it wasn’t too busy yet. However coming back from Menaggio at 1pm it was a long line in the hot sun to buy tickets. I like the heat, so it didn’t bother me. However packing a small umbrella might be a good idea.\nNo idea about private charters. As a solo traveller it would’ve been way over my budget."}, {"username": "Paul Davis", "comment_text": "To take the fast ferry, you must get in line in the morning around 7:30. You cannot buy a return ticket until you arrive at your destination. If you are going from Como to Bellagio, as soon as you arrive, go buy your return tickets. If you’re going from Como to Varenna, and are on a midday ferry, you have a slim chance of getting return tickets. That is because the people that got off in Bellagio are buying them before you ever get to Varenna. If you’re on an early ferry, you’ll likely get tickets. That leaves the bus, the train (from Varenna) the slow ferry. None are great options. If you’re in Bellagio and are planning to take the bus back to Como at around 5:00, prepare for a battle at the bus stop. There will be a mob of 100 people trying to get on the bus."}, {"username": "Amelia Bonannella", "comment_text": "f"}, {"username": "Eddie Williams", "comment_text": "Carrie Swanson"}, {"username": "Rene Chick", "comment_text": "Following"}, {"username": "Sonia Ciaglia", "comment_text": "Callum Audet"}, {"username": "Jacqui Warsama", "comment_text": "I was there a month ago, we didn’t have a car. We stayed in Varenna and ferry to Bellagio and Menaggio were about 20 mins, always got on both ways and always bought a return ticket! All places are absolutely wonderful!\nWe also had a ‘middle of the lake tour’ 50€ each for an hour but we’ll worth it, the guide took you to all the famous villas and hotels to see them from the lake! This is the company and he’s based in Varenna by some restaurants, opposite side to the port but only 10 min walk.\nhttps://\ntaxiboatvarenna.\ncom/"}, {"username": "Nicole Hart", "comment_text": "We are going June 2024 and have just booked B&B como... hopefully ok !"}, {"username": "Julia Muller", "comment_text": "We spent 4nts in Bellagio late June. The ferry situation from Comp to anywhere is ridiculous, being unable to buy return tickets, but it is what it is. After maybe 1.5hr wait in the sun we got on a slow ferry in the end, as we weren’t in a hurry, and it was a good way to check out which towns we wanted to visit in the coming days! We took a ferry to Menaggio and Barenna one day, it was simple (could buy return tickets) and beautiful. We took the bus to Como and it was super easy and a different perspective of the lake. Coming back to Bellagio around 6pm was busy, but still do-able."}, {"username": "Andri McKenzie", "comment_text": "We stayed in Lezzeno on lake Como 2 weeks ago for 6 nights. It’s just outside of Bellagio. Honestly the ferries were frustrating and super busy. We ditched that idea and twice rented a boat for private use. You do not need a licence and we had SO much fun. We switched off in quiet places and had a swim in the lake. Obviously someone always stays on the boat. You see SO much more and can take your time. Boat rentals are very flexible, anything from 1h to all day. We found it much more enjoyable. The ferries rush from one place to the next and when they’re full you don’t see anything.\nBoat rental was 150€ for 2 hours and 210€ for 3 hours. Sounds expensive, but we thought it worth it. We even docked at Lenno and went to buy Gelato while my husband stayed with the boat. Great fun."}, {"username": "Cathy McDonald", "comment_text": "Erin McDonald"}, {"username": "Renae Larcus", "comment_text": "Just take the ferry. It’s like a hop on hop off bus. Get off at towns you want to see"}, {"username": "Mary Jo Carlson Pape", "comment_text": "Following"}, {"username": "McKayla Ellsworth Greco", "comment_text": "We just got back from staying in Bellagio for 3 nights- we rented a car and while the drive was a very narrow at times, I couldn’t imagine relying on public transit. Ferry situation was very busy. Never ventured to como but took it Bellagio to Varenna leaving at 10AM and returning at 1pm and it was okay. Lines starting to build tho. We rented a boat with a private driver for 2 hours for 600$ but was an amazing experience. Friday and Saturday much busier than Sunday to Monday."}, {"username": "Samira Parker", "comment_text": "I'm in Menaggio right now with my daughter and my advice is this. Leave the ferries out of it as much as possible. We are only here for two nights, and I'd heard Bellagio is so beautiful that this morning we went to do a short trip across for the morning. It was so crowded that I let it go and decided to stay and explore Menaggio. Great decision! I think every town is stunningly beautiful and it's great to pick one and enjoy it thoroughly if you don't have much time. I can ride a boat on a lake anywhere, but exploring the back alleys at a leisurely pace, strolling through the piazzas or along the shore with gelato, these are the things to do in the precious short time spent at Lake Como. I guess if you can afford a private boat tour that would be the way to go, but even then I think you wouldn't have enough time in each place and would still be better off enjoying one town. You can't see everything in a two night stay so ENJOY one place."}, {"username": "Claire Dowson", "comment_text": "Where are you staying? The train runs the length of the east side, then you can catch the ferries. You must visit Varenna and Villa Monastero. Much preferred to Bellagio."}, {"username": "Patty Dehne-Olberding", "comment_text": "I think it depends on the time of year you are there. We stayed in Varenna for 2 nights in early May. We traveled to Varenna by train from Milan, about 1 hour. Loved Varenna. We took the ferry to Bellagio one day with no issues and no long lines. We took a water taxi tour from Varenna to Villa del Balbianello. The price included a tour of the Villa. It was beautiful. The water taxi drove by and pointed out other sites along the way. There is more shopping in Bellagio than Varenna but I preferred Varenna. Very quaint. If you go there have a meal at Al Prato, reserve early."}, {"username": "Andrea Sontz", "comment_text": "We are in Varenna right now and the ferries are crazy. No schedule and crazy long lines."}, {"username": "Todd Scarfone", "comment_text": "Was there a few days ago, we stayed in Como and caught the bus to Bellagio for the day. Then also caught the bus to Menaggio and then ferry to Varenna (very quick).\nWe also went early, caught transport to the towns at 8/9am stayed until about 2pm and get out while everyone’s still there. Great photos and nicer with no one around in the morning, then shops will open around 10."}, {"username": "Nariman Dergam", "comment_text": "Interested"}, {"username": "Trisha Campedelli", "comment_text": "April 24 for us"}, {"username": "Monique Baker", "comment_text": "I cannot recommend this tour with Violeta enough. It was our favorite day in Italy. She took care of everything and it would have been a nightmare navigating the ferries and boats without her. Ours was a small group so it was our family of five and one other family of four. It was perfectly paced and she made dining reservations for us at a perfect spot for lunch and went the extra mile and booked us dinner reservations that night when we arrived. Highly recommend!\n\nhttps://\nwww.viator.com/\ntours/Lake-Como/\nComo-Lake-Highli\nghts-Villa-Balb\nianello-and-Bel\nlagio-full-day-\nprivate-tour/\nd26113-172688P6"}, {"username": "Renee Rundle Stoneham", "comment_text": "We used Varenna Taxi Boat to see Villa Balbianello.\nIt was a small group tour but an awesome way to get out on the lake and have a bit of a tour.\nPrice includes the Villa tour.\nThey take to the Villa for a tour in the way there they point out different villas on the Lake.\nAfter the tour they drop you off at Bellagio or Varenna. We wanted to see Bellagio so got dropped of there and wandered around and had a few drinks at different places etc…Originally we were going to have dinner in Bellagio but it was a zoo and we just decided to go back to Varenna.\nGot on the ferry for the trip back to Varenna for dinner.\n\nhttps://\ntaxiboatvarenna.\ncom/"}]}, {"id": "2199478793784532", "text": "Will be flying into rome for a 13 day trip. First 3 nights will be spent in Rome. I think we have for the most part figured out what we are going to do these days.\nThe next 5 days we will be staying in positano. I need recommendations on what to do to fill our days here. We are going in October. Where should we eat? What day trips should we take?आणखी (Def want to go to capri). Any tips for staying in Positano and the best way to get there from rome with our luggage (4 adults)\nThe last leg of our trip will be spent in a lesser known area in the south called San Giovanni in Fiore, it’s where my great grand mother lived before she came to America at 17 years old. My grandpa will be on the trip and has many cousins still there. Looking for any info on this area of things to do (outside of visit with family). It looks like a bigger city close to this area may be cosenza.\nAfter this we are heading back up to ischia for a night and then to rome to fly home.\n\nWe are looking into a cooking class, any other fun things we should look to book?? Thank you for any tips!", "link": "facebook.com/groups/1373361046396315/permalink/2199478793784532/", "likes": 5, "comments": [{"username": "Alice Francesca", "comment_text": "Positano: LE TRE SORELLE RESTAURANT.righ\nt on the beach.check their site"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "5 days is alot in positano … go to Amalfi, go to Capri and Anacapri"}, {"username": "Laura Uribe", "comment_text": "When in Positano, definitely a day trip to Ravello."}, {"username": "Romina Lauretig Toscano", "comment_text": "5 days in Positano and only 3 in Rome?"}, {"username": "Jenny Payne", "comment_text": "Myself I go a lot to Italy ,I would stay in Sorrento as you will have more to do and do day trips by bus because depending on the weather the ferries may not be running 🌻"}, {"username": "Janet Isaacs Lanza", "comment_text": "La Italia restaurant in Positano"}, {"username": "Lucrezia Folger", "comment_text": "I'd reverse it. 5 in Rome, 3 in Positano. Much more to do in Rome."}, {"username": "Graham Sherlock", "comment_text": "5 days in Positano is 5 days too many"}, {"username": "Cindy Giampietro", "comment_text": "Just spent 3 days in positano. Ferry ride there was beautiful. if you have to take your own luggage up to where you are staying (if that service is not provided by where you are staying), they have porters that will do it for you for 10 euros per bag (15 if there are a lot of stairs to your door). I saw a lot of people struggling with luggage. You can rent a lounge chair at a private beach for the day for 35 euros. Take water shoes - the rocks on the beach are painful. Prices for items vary. The same beach towel that was 20 euros up the hill by our home was 10 euros at the bottom of the hill."}]}, {"id": "2199480090451069", "text": "6 days starting in Naples best way to travel amalfie …bus tour .car and bnb or cruise ..any suggestions", "link": "facebook.com/groups/1373361046396315/permalink/2199480090451069/", "likes": 0, "comments": []}, {"id": "2199487987116946", "text": "Hiiiii lovely humans!\n\nHeaded to Naples/Amalfi Coast soon and just hoping for some pro tips!\n\n1. what’s the chillest town that’s still close to all the action?\n\n2. If you rent a moped in Sorrento are you able to easily ride it to Maiori, Positano, Ravello, etc?\n\n3. Is it worth doing boat ride around Capri or Amalfi? Or do some tours do both?\n\nAny recoss so appreciated! ciao! 🤗💕🙌", "link": "facebook.com/groups/1373361046396315/permalink/2199487987116946/", "likes": 1, "comments": [{"username": "Glenn Todd Webb", "comment_text": "1-Ravello 2-yes spend the day. See blue grotto and take chair lift and see the villas"}, {"username": "Miyuki Kanno Paul", "comment_text": "3. Definitely yes. At lease once!!"}, {"username": "Jennifer Avrett", "comment_text": "2- yes, it's a bit of a drive from Sorrento but the best way to get around on the Amalfi Coast"}, {"username": "Anita Downey", "comment_text": "Yes definitely a moped cheap to hire and easier to park. Also the easiest way to get to Ravello which is beautiful. Would also recommend a day trip to Capri to see the Grottos and spend a leisurely day on the water"}, {"username": "Joan Belserene Forcheski", "comment_text": "Chillest town is Minori. Not over crowded. Wonderful restaurants and very easy access to the ferry for visiting all the other towns. Also very few steps."}]}, {"id": "2199489017116843", "text": "Hi, Im new here!\nIve seen a few posts re esim for Italy and i have a specific question but I seem to be unable to comment on the posts Ive seen on this subject.\nSo here goes.\nI am looking at using airalo esim and I want to know if I can use this with my existing Australian number… or do I get a number attached to this sim. I know ai am able toआणखी reatain my aussie number while using another esim but just want to know if airalo esim provides another number. I have done lots of research and cannot find the answer anywhere. Ideally seeking answers from Aussies who have used airalo in Italy/Europe.\nThank you !!", "link": "facebook.com/groups/1373361046396315/permalink/2199489017116843/", "likes": 21, "comments": [{"username": "Rika Foster Terblanche", "comment_text": "Just came back from 5 weeks holiday and we used Holafly and it was the best. My son is over there now and also using it."}, {"username": "Brian Marcus", "comment_text": "I used it and was very happy with the price and service. But no phone number as Karen above notes. Just data, no voice no texting.\nFB Messenger, what's app, signal, etc etc worked fine."}, {"username": "Annette Sparks", "comment_text": "I don’t think you can keep your own number unless you use your provider. A lot of esims only provide data. If you want calls, I believe you get a new number - probably from a European country. We have purchased a sim for calls and data in EU. Let me know if you want more info. Also from Oz."}, {"username": "Micheal Gunner", "comment_text": "I am from Oz and used Airalo, it is data only if you turn on your Aussie SIM depending on your plan you will get charged OS roaming costs if it is enabled"}, {"username": "Rachael Ann", "comment_text": "We just recently returned and used sims direct which is Aussie owned. You order a SIM card before leaving and swap out with your normal SIM card on arrival. Obviously you need to have an unlocked phone. This gives you a new number but you can retain your normal No on WhatsApp which makes things easier for bookings you may have. We got the $35 one as we went to Italy and the UK which lasts a month. We can definitely recommend Sims Direct."}, {"username": "Caterina Liquori-Culhane", "comment_text": "We paid for one month internally with our phone company. $100 unlimited data,texting and 250 mints calling"}, {"username": "Leisa Davis", "comment_text": "I was very confused for ages too but here is my simple understanding of how an esim works.\n1. Put your phone on air plane mode\n2. Then go somewhere where you get free wifi, like McDonald’s.\n3. You can now use your phone to do anything with data enabled. Ie\nMessenger, FaceTime and what’s app calls,\nusing your phone number and send/receive blue sms, use google maps, search the web etc.\n5. But you can’t make normal phone calls as your phone is on airplane mode.\n6. So your esim is the McDonald’s wifi.\nI hope this helps."}, {"username": "Julie Allen", "comment_text": "Can’t you make calls through iMessage which uses data? Not sure how to do it though"}, {"username": "Fiona Cameron", "comment_text": "Thank you to all who replied, makes sense now!"}, {"username": "Ryan Monahan", "comment_text": "Airalo is data only. Leave your primary sim active so you can receive texts and calls. Turn data roaming off on your primary sim. But don’t answer calls or reply to texts with your primary sim, use your eSIM Data for calls and messages etc. I’ve used it a lot so feel free to reach out if you have any questions. ☺️"}, {"username": "Helen Wake", "comment_text": "Why are you bothering.... you just pay a bit extra to your telecommunicati\nons provider and have roaming...."}, {"username": "David Silverstone", "comment_text": "You could just turn on international roaming! I know Vodafone does it for $5 per day. You can switch it off for the days when you don't plan to make or receive calls and just use your phone in airplane mode with WiFi on. Most hotels and Airbnb will have free WiFi."}, {"username": "Rosario Zavala", "comment_text": "Hola regrese hace dos semanas de Europa y contraté aíralo por un mes . Seguí con mi mismo número sin ningún problema y me funcionó muy bien te lo recomiendo. 👍"}, {"username": "Carlene Reader", "comment_text": "Hi. I’m from Australia and used Airalo esim while in Italy, as did my son. We bought the 30 day mamma Mia package and it was brilliant and easy to use. You do not get a number with the esim. We used WhatsApp to make calls as that’s what everyone in Italy uses. Buy the esim and download it to your phone before you leave, and when you arrive in Italy, turn the data off on your exiting number and turn it on for esim. You do this through settings-mobile\n-then select the sim."}, {"username": "Kerry Aldred", "comment_text": "i've set up an unlimited EU Esim - Maya Mobile plan. Keep your own number, you are able to also hotspot for others & you can tether your laptop. I'm travelling through Europe for 5 weeks & will be working during that time."}, {"username": "Kerry Aldred", "comment_text": "Helen Wake @ $10 a day - far too expensive"}, {"username": "Simonetta Seri", "comment_text": "Just back from Italy & used Airolo. Great for data only - calls on whatsapp or messenger- I've attached screenshot of where you need to make sure you turn off your home sim, & turn on the esim. Because you leave your physical sim in the phone, & you have International roaming, you can still receive text messages & phone calls. If you answer phone or send text messages, it will trigger the daily $10 charge. 2 important things to note:\n1. Activating a day pass works on Australian Eastern Time Zone. So if you activate it at 3pm in Italy & then again at 5pm, you will be charged $20 😡\n2. Make sure you turn off your message bank - even if you don't answer a call, if it diverts to message bank, you will be charged the $10 daily fee 😡"}, {"username": "Simonetta Seri", "comment_text": "Simonetta Seri"}, {"username": "Rose Stolarek", "comment_text": "We used Amaysim and it was fantastic! We kept our own number. The only issue is that you need to be with amaysim in Australia and we just added$70 roaming pack . We were away for over 2 months"}, {"username": "Jen Larkin", "comment_text": "Australian here- Yes you can. Get the regional Esim and you have greater flexibility. It’s data only but WhatsApp and messenger as well as internet are accessible pretty much everywhere. We used it in Europe including Italy in May and I’m using my Asian Esim now to respond to you from Vietnam"}, {"username": "Margaret Marsiglio", "comment_text": "Apparently you keep your own number but turn your phone to airplane mode then switch your data to AloSim while abroad"}, {"username": "Deanne Kelly", "comment_text": "Telstra is $10 a day when you use it, but you have to watch the time and work it out as it’s AEST.\nPerth is 6 hours ahead of Europe,the East Coast 4 hours.\nI turn mine on every few days to call home and check messages etc…\nIn between those days I just use the wifi and use WhatsApp or messenger."}, {"username": "Kathy Johnson Schaefer", "comment_text": "I used Holafly. I am US based, apparently they gave me an Australian number but I don’t know what it is! So no you can’t use for 2 step verification. I just What’s App’d my son to give me a verification code I put in his number 😂"}, {"username": "Hussein Karout", "comment_text": "You can dowload flyesim app and still using your local number"}, {"username": "Hussein Karout", "comment_text": "Most affordable one is flyesim app"}]}, {"id": "2199492320449846", "text": "What are your favorite cities or wineries in Tuscany? We will visit Florence and Il Borro and would love your recommendations on other places you went to and loved. TIA!", "link": "facebook.com/groups/1373361046396315/permalink/2199492320449846/", "likes": 1, "comments": [{"username": "Marc Spiegel", "comment_text": "Antinori is a must 💯"}, {"username": "Alice Francesca", "comment_text": "Pienza and the Val d'Orcia.I am Italian and I go there at least once a year! Check it online!"}, {"username": "Miyuki Kanno Paul", "comment_text": "Montalcino and Montepulciano, plus Civita di Bangnoreggio"}, {"username": "Matthew Cawley", "comment_text": "Stayed in Chianti at Villa Di Capovento and it was really outstanding. Winery 10 min drive is Rocca Delle Macey... very very good."}, {"username": "Nadia Granito", "comment_text": "This place was Amazing!"}, {"username": "Valerie Collanton", "comment_text": "We had an amazing tour and lunch here.\n\nhttps://\nwww.santagnesefa\nrm.com/\n?utm_source=goog\nle&utm_medium=o\nrganic&utm_camp\naign=mybusiness"}, {"username": "Juliette Sastrowitomo", "comment_text": "My favorite, you can taste the wine and have a delicious meal\n\nhttps://\nwww.facebook.com\n/osteriaperano"}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "Easy. Val D’Orcia region seen in all Tuscany landscapes. Mobtalcino, Pienza and Montepulciano. Also, visit Siena."}, {"username": "Caroline Linton", "comment_text": "Janice Carbone"}]}, {"id": "2199501743782237", "text": "Hello. Will a fiat 500 fit 2 large suitcases? We won't be leaving luggage in the car unattended so are happy to fold the seats down to fit.\n\nThanks 😊", "link": "facebook.com/groups/1373361046396315/permalink/2199501743782237/", "likes": 5, "comments": [{"username": "Grace Scinto", "comment_text": "I doubt it we had a small SUV and we couldn’t get two suitcases in the back. Check the car rental website for an indication. Maybe 2 carryons would be ok"}, {"username": "Karen Landini", "comment_text": "Check your suitcase dimensions against the online specs for the vehicle. Even if they would technically fit, getting rigid cases through the openings might not be possible. Duffel bags would be the safest way to travel in a small car....and packing cubes of you need to pull some out to reconfigure."}, {"username": "Steve Grossman", "comment_text": "We rented a fiat five hundred two times on separate visits to paris.\nTwo bags of fifty pounds each that qualify to go on the airlines fit in the car. Plus hand luggage. You can do this don't Let anyone tell you that you can't"}, {"username": "Alessandro Battxi", "comment_text": "No"}, {"username": "Rhona OConnor", "comment_text": "The back seats fold down and you have quite a big space."}, {"username": "Heather Sechrist", "comment_text": "Yes, we have one now and it’s fine."}, {"username": "Miyuki Kanno Paul", "comment_text": "How many people are occupying the vehicle? My answer is NO. But Fiat Panda 5 doors may fit depending on the size of suitcases."}, {"username": "Frannie Kaplan", "comment_text": "Depends if they're squishy. If they're hard and very stuffed, possibly not"}, {"username": "Judy Jamieson Pisano", "comment_text": "We did four suitcases plus hand luggage with the seats folded down"}, {"username": "Marisa Brombal D'Emilio", "comment_text": "I owned a Fiat 500 and you would be surprised how much you can get into that car!"}, {"username": "Melanie Matthews Stuprich", "comment_text": "If no one is sitting in the back then yes you should be fine! I own one and love it so much here in Sicily. It’s a perfect car for small streets and small parking. You might have to fight with it a bit if they are rigid suitcases that are extra large but you should be fine! Where in Italy are you guys going?"}, {"username": "Kylie Rostron O'Connor", "comment_text": "Would a 6ft 4 man be comfortable in the front"}]}, {"id": "2199505023781909", "text": "My husband and I are going to Italy in October. We are looking to stay a couple days on the Amalfi coast. Which city would you base out of and why? Any hotel recommendations? We want to do a day trip to Capri as well. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2199505023781909/", "likes": 29, "comments": [{"username": "April McCoy Broussard", "comment_text": "We spent a weekend in Piano de Sorrento, which was a short 4 min train ride to Sorrento. It was such a quaint little town. Our gorgeous Airbnb had an amazing water view with a small balcony. It was perfect!"}, {"username": "Renee Rundle Stoneham", "comment_text": "If you want a day trip to Capri I’d suggest Sorrento (not technically Amalfi coast).\nThe ferry goes directly to Capri from there. It also goes to Amalfi, Positano etc…\n\nHowever you need to Google and make sure the ferry’s are running in October."}, {"username": "Teresa Helena Basevi", "comment_text": "I’ve stayed in Praiano, at the Grand Hotel Tritone. It was amazing, perfect! The hotel has day trip to Capri."}, {"username": "Sara Kyle Hargett", "comment_text": "Sorrento. Continental Hotel was lovely"}, {"username": "Michelle Plutto", "comment_text": "Following"}, {"username": "Laura Yano", "comment_text": "Following"}, {"username": "Doris Callender", "comment_text": "Definitely Sorrento 🍋"}, {"username": "Soc Cer", "comment_text": "Sorrento...beca\nuse it's cheaper than Positano but close enough to get to all the other 'hot spots' in the Amalfi Coast such as Capri, Positano, Ravello, etc. for day trips...Sorrent\no has a lot of tourists though...so if you want to lay low...then maybe consider staying further out such as Ravello or Amalfi or Minori"}, {"username": "Jennifer Gustafson", "comment_text": "I would stay in Amalfi it’s central and easier to get around to the other cities transportation wise. Plus if you’re a foodie it’s a bit if a hike but up the mountain is the Agricola Fore Porta restaurant. It is a farm to table restaurant with beautifully homemade food!"}, {"username": "Rachel Alves", "comment_text": "Sorrento and a day trip along Amalfi coast"}, {"username": "Jono Roland", "comment_text": "Sorrento. Majestic Palace Hotel. 🤓❤️🇮🇹"}, {"username": "Aletta Babaya", "comment_text": "Following"}, {"username": "Maria Salerno", "comment_text": "We stayed in Positano/ LE AGAVE HOTEL magnificent! We also rented a villa in Praiano/ less touristy and just as beautiful !"}, {"username": "Christine Broussard", "comment_text": "Has anybody ever stayed in Mediterranean suites in old townSorrento?"}, {"username": "Deborah Rivera", "comment_text": "Following"}, {"username": "McKayla Ellsworth Greco", "comment_text": "We stayed in Sorrento"}, {"username": "Rosario Dychitan", "comment_text": "Ravello, nice and quiet."}, {"username": "Carolyne Banford", "comment_text": "We are staying at Casa Roy’s in Sorrento. Has anyone stayed there? Would love info!"}, {"username": "Lolli Rendina", "comment_text": "Are you using a travel agent?"}, {"username": "Ivette De Jesus", "comment_text": "Stay in sorrento and do day trips to Capri and Amalfi Coast."}, {"username": "Lisa Marie Corcoran", "comment_text": "We are also going in October and we are basing out of Sorrento. We rented a VRBO penthouse apartment with views of Mt Vesuvius from the master bedroom and a huge terrace"}, {"username": "Lorraine May Buttimore", "comment_text": "Following"}, {"username": "Sue Kreger", "comment_text": "If you’re on instagram, have a look at NickiPositano….\n. she’s an English lady married to an Italian and has lived in Positano for over 25 years…… a lot of content and some great advice….. I’ve never been to Positano but feel like I have been there and Capri and other towns around the Amalfi coast, after watching her on YouTube."}, {"username": "Kally Trahearn", "comment_text": "Would recommend staying in Sorrento, which gives you options of Amalfi Coast and Capri as day trips as well as Pompeii, Vesuvious and Herculaneum. The Hotel Plaza Sorrento is a great, central place to stay if there is availability."}, {"username": "Marianella Flynn-Morales", "comment_text": "Look up hotels in Atrani it’s a 10 minute walk to Amalfi it’s beautiful"}, {"username": "Jean E Snyder Spinell", "comment_text": "Following"}, {"username": "Rod Fick", "comment_text": "We stayed in Positano at the Hotel Marincanto, and really liked everything about it, especially the great staff! They arranged drivers for us when needed for day trips, dinners out, etc. The day trip to Capri can be arranged right on the nearby dock/pier. That was one of the highlights! If I ever go back I’d consider staying over on Capri."}, {"username": "Cynthia Marie", "comment_text": "Our favorite on the AC was Sorrento. We stayed in a vacation rental with a rooftop patio . The view was incredible, reasonable priced on TripAdvisor."}, {"username": "Debbie Schultz", "comment_text": "Ravello is the most beautiful city in the area."}, {"username": "Karen Juanita Letchmanan", "comment_text": "Following"}, {"username": "Lisa Valdovinos", "comment_text": "We stayed in Sant’Agnello in a boutique hotel and walked to Sorrento. It’s a 20 minute walk. The hotel was The Villa Garden. We loved it! We also did a small boat tour to the Blue Grotto and then on to Capri."}, {"username": "Steve Grossman", "comment_text": "We stay in Amalfi All the time. Hotel bellevue if available, is the best deal on the peninsula and a tremendous view\n\nof the ocean and the mountains"}, {"username": "Kylie Paine", "comment_text": "My daughter stayed in Salerno at the lemoncello rooms right near the harbour she caught ferries to Capri and a day cruise to Amalfi and Positano , easy 20 min walk to nearby towns for meals and right on the beach"}, {"username": "Rod Fick", "comment_text": "We really enjoyed Hotel Marincanto in Positano. Great location; great views and exceptional staff, who helped us plan day trips. That included a day trip to\nCapri."}, {"username": "Renae Larcus", "comment_text": "Base in Sorrento."}, {"username": "Lucrezia Folger", "comment_text": "Do Ischia instead of Capri. I always stay in Positano, why, because it's beautiful."}, {"username": "Penny Bellofatto Westberry", "comment_text": "We enjoyed Eden Roc in Positano. Great location, warm and helpful staff."}, {"username": "Jill Wolder", "comment_text": "Stay in positano. Le Sireneuse or The San Pietro. If you don’t stay at the San Pietro,make sure to make a dinner res there."}, {"username": "Iliana Zlatareva", "comment_text": "Sorento"}, {"username": "Nikki Niks", "comment_text": "We love Amalfi and walk or boat everywhere. Capri is a waste of time imo. We are going 2024 again and won’t be doing Capri again. There’s too much to do and see in that whole area. Make sure you do get a private boat tour and spend the day out on the water. It was our best day for sure!"}, {"username": "Christina Basham", "comment_text": "How is the walk between these small towns? Is it doable for someone in their 60’s as I would love to do this. Going in October. Thank you"}, {"username": "Kay Malick", "comment_text": "Following"}, {"username": "Phyllis Snyder", "comment_text": "Sorrento has easy access."}, {"username": "Danielle Labossiere", "comment_text": "Following"}, {"username": "Arike Shrestha", "comment_text": "Novotel in Salerno is great with a pool and very nice restaurants by the sea. Close to local amenities. Easy access to Positano,Amalfi\n, capri, Pompeii. Well priced.."}, {"username": "Sarah Williams", "comment_text": "If you plan to travel between any of those mini cities be aware that bad weather may mean that boats are cancelled. Last summer I spent 4days in May on Capri IMO it’s massively expensive but if you day trip everyone lands at the same time and it’s carnage to get anywhere! Same with positano. Same with Amalfi. Sorrento is great for Pompeii. Amalfi is great for walks and just chilling. It really depends on what you like to do."}, {"username": "Linda Metallo Casey", "comment_text": "Sorrento"}, {"username": "Mariët Eertman-Heemstra", "comment_text": "You need at least 5 days to explore the Amalfi coast."}, {"username": "Wendy Wood Cullum", "comment_text": "Settimo cielo in sorrento\nGreat ocean views"}, {"username": "Jeanette Smith Floyd", "comment_text": "Positano, Hotel Poseidon"}, {"username": "Cheryl Gorfinkle", "comment_text": "Sorrento\nImperial Hotel Tramantano\nFerries to cspri , positano, Amalfi near by"}, {"username": "Anna Gambino", "comment_text": "Have stayed on Amalfi twice but I was with a small group. From that trip I learned some of the other towns. Just booked an Airbnb in Maiori for next April/May. Ferries and buses available to the other towns."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2199494213782990", "text": "Gargano with friends…", "link": "facebook.com/groups/1373361046396315/permalink/2199494213782990/", "likes": 15, "comments": []}, {"id": "2199508273781584", "text": "Anyone know of a group shopping day tour that is excellent in Florence? Looking for good vintage, leather bags/belts, cute/elevated clothing but affordable, a lil high end thrown in there (more interested in the quality and the look than the brand).", "link": "facebook.com/groups/1373361046396315/permalink/2199508273781584/", "likes": 0, "comments": []}, {"id": "2199508563781555", "text": "We land in rome at 7:45 am. What do you recommend time wise for a train to Venice from termini train station. We are doing coo. Is 10:55 realistic or would 11:30 or 11:50 be better options? Of course we want to get to Venice as early in the day as possible but I want to be realistic. I assume we can get a taxi to Termini from the airport.\nWhat can we do if the flight is delayed? It looks like one time change is allowed. Anyone have any experience with this?", "link": "facebook.com/groups/1373361046396315/permalink/2199508563781555/", "likes": 2, "comments": [{"username": "Valerie Collanton", "comment_text": "10:55 would probably work if all goes smoothly. You can get a train from the airport to Termini which might be a faster option than a taxi. Look at the schedules to decide. You can check them on the Trenitalia website."}, {"username": "Elena Innocenti", "comment_text": "if I had to take it, at least at 11:30.\nLast night when i came back to FCO I waiting about 1h for luggage and it's not a coincidence, often happens to wait a long time. Also you have to check passport, and go to train station (maybe is better by Leonardo Express train direct to Termini, because usually there are long queue for taxi and you can find traffic in the street)\nThere are different kind of tariff. Some allow change other no, other with pay extra."}, {"username": "Carmine Castiglia Jr", "comment_text": "Why not just wait until you reach Termini and then buy tickets on the next train out?"}, {"username": "Carmine Castiglia Jr", "comment_text": "Also, you can take the Leonardo Express directly from FCO to Termini. It runs every 15 minutes during most of the day.\n\nhttps://\nwww.trenitalia.c\nom/en/services/\nfiumicino_airpor\nt.html"}, {"username": "Peach Panfili", "comment_text": "No don’t get a taxi to termini, get the train from the airport - it’s called The Leonardo Express - the station is within the airport terminal as are numerous machines to purchase tickets. It’s cheap, reliable, fast and the carriages are designed for people with luggage."}, {"username": "Giovanni Pianigiani", "comment_text": "it's really just a matter of price. Just check on Trenitalia website for tomorrow, there is plenty of availability, although for a slightly higher price than one week later (92€ vs 82€). Personally I'd rather pay 10€ more for a train which I am sure I won't miss, than paying 10€ less with the risk of missing the train"}, {"username": "Frank Hunt", "comment_text": "Waiting for luggage at Rome can be a shocker, play safe."}, {"username": "Marilyn Vitale DeStefano", "comment_text": "Have a great trip, Connie Vitale! I’m jealous!"}]}, {"id": "2199512993781112", "text": "HELP! Needing recommendations on where to stay in Cinque Terre?!", "link": "facebook.com/groups/1373361046396315/permalink/2199512993781112/", "likes": 3, "comments": [{"username": "Renae Larcus", "comment_text": "Monterosso. Beach. More dining options. Wineries."}, {"username": "Gloria Maledi", "comment_text": "vernazza, la marinarooms"}, {"username": "Sara Butcher", "comment_text": "I loved Monterosso! Great atmosphere, I believe flatter, great restaurants and shops ❤️🇮🇹🇦🇺"}, {"username": "Carla Breiding-Cubillas", "comment_text": "Monterosso,@ La Ca Dei Nonni, beautiful view!"}, {"username": "Bernadette Collins", "comment_text": "Another vote for Monterosso. Easy train trip to visit the other towns"}, {"username": "Kimberly Lampros", "comment_text": "I loved staying riomaggiore. But I don't think you'll go wrong with any of the villages."}]}, {"id": "2199518427113902", "text": "Hello! Arrived yesterday. This group has been helpful. Lemme return your kindness by sharing a few things I realised:\n\n1. Leonardo express is so convenient when you want to get to Termini Station from FCO. You can just buy your ticket there (15 euros only) and after 32 min, you are at the station. Do this when your hotel is near the station. Extremely easy, no need to book in advance.\n\n2. I did use the subway as suggested by rome2rio, it took me a while to find it but it is manageable ( I am a solo traveler and since I traveled with just a carry-on.. I was able to navigate easily. Many have warned us about pickpocketers, just be extra vigilant and you will be fine) I do not mean to discount the stories of those who have lost their essentials and I am sorry for such experiences you had. All I wanna say is, if you choose to take public transportation, be mindful of your surroundings all the time.\n\n3. After the subway was the plot twist, I still had to get an uber to find my way to the hotel. I am staying at TH Roma Carpegnale hotel which is not that far from the station. It took me almost an hour to find one. Uber works fine but it depends on where you are. They are pretty particular with the pick up point so it is not like you will just type where u are and they will find you. On the contrary, they will let u know where and u must find it.\n\n4. Having said those, while I tried to be economical by using the train and subway, then uber- I computed and realised it is a lot better if I just took a taxi from the airport (esp my hotel is not near Termini Station) I could have saved more (time and money)\n\n5. Shoes are always a topic in this group, I agree, wear comfortable ones but once here, you will find so many women wearing heels and sandals and they are just okay. (Again, u know yourself better-no one will judge u if u did not wear your rubber shoes)\n\n6. I used the e-sim Airalo and it works perfectly.\n7. Cards are accepted pretty much everywhere. no need to carry lots of cash (just enough to tip)\n8. I did not have everything planned and ate at wherever looks authentic Italian restaurant whenever I got hungry. Part of the joy for me.\n9. weather is hot but not unbearable 🙂\n10. Let me conclude by saying, do not be afraid to “Rome” around- you may be lost but it is all worth it. God bless you all!", "link": "facebook.com/groups/1373361046396315/permalink/2199518427113902/", "likes": 144, "comments": [{"username": "Judy Grayson", "comment_text": "Good tips and you put them in such a cute and informative format..."}, {"username": "Rye Eiven", "comment_text": "This gives me a positive vibe and even excitement! Gonna travel “solo” soon too’ ! 😊thanks"}, {"username": "Carol Johnson", "comment_text": "The best App to use for taxi in Europe is .. Free Now.."}, {"username": "Kim Scheels Pinero", "comment_text": "Appreciate the post! Thanks! Pics are beautiful!"}, {"username": "Monique Gomez", "comment_text": "Please elaborate on the e sim aíralo? What is it? Where do you buy? How do you use? Cost? Thank you so much!"}, {"username": "Gabriel Toncelli", "comment_text": "Don’t drink cappuccino after 12 pm and everything is gonna be all right ! 😅"}, {"username": "Tracy Foss", "comment_text": "Looks like a great trip !"}, {"username": "Patty Barnes", "comment_text": "Thank you"}, {"username": "Laura Shojaei", "comment_text": "\"Rome\" around! Love all of this ❤️ Thank you for the helpful suggestions."}, {"username": "Linda Paster Oliva", "comment_text": "Great post, so interesting to read about your experience.\nWe had the same experience in Rome, (Venice, Florence and Sienna as well) which was no shortage of restaurants to eat in, no reservations necessary and the food was magnificent.\nI’ve read some remarks about the waiters in Italy being rude however that was not our experience at all. Across the board we found everyone who waited on us to be most accommodating and gracious. Far nicer than any recent dining experience we’ve had here at home"}, {"username": "Lesley Richardson", "comment_text": "We found using the taxi in Milan was more convenient and cheaper than 2 subway tickets and lugging luggage up stairs 🤔 I agree with point 4 😊"}, {"username": "Cindy Medina", "comment_text": "Very impressed that you are traveling solo and enjoying life!"}, {"username": "Jan Armstrong", "comment_text": "Brilliant tips. We returned last week and I was nodding with everything you have said. We found Uber great, esp in the heat. But you are right - they will give you a pick up point nearby and we found we had to find that before accepting. Worth every penny over walking in 98’F. We had a pickpocket experience and again, it was clear as we tried to get on the metro, the thieves were trying to make our entrance tricky to embark. So my husband ( with wallet in pocket) was being jolted by 2 ladies whilst my son and I struggled to get on- on a quiet carriage but they were half blocking the doors. By the time I got on, I could see the distraction technique, told my husband to move away. In a split second they had taken his wallet. Luckily doors were closed, he grabbed the thief’s shoulder shouting where’s the wallet, I grabbed the bag of her accomplice who pointed at the floor- she had just dropped it so we got it back. You are right, they are very clever and it was because of this FB group, I recognised the diversion. Techniques people had spoken about. After that, he just used his Apple Pay and I gad been using cross body bag with hand on it at all times. 2 restaurant tips - Emma and Tonnarello. We were staying kn a Trastevere which also had a handy CONAD supermarket in the OVS dept store. Just 20min walk from Pantheon. Taxi rank across the road in Via Di Trastevere."}, {"username": "Lori Sammons", "comment_text": "Where did you buy the sim? Thanks"}, {"username": "Aneta Dzieniszewska", "comment_text": "Does Leonardo Express stop on the way or it is just direct to Termini Station?"}, {"username": "Daisy Yoo", "comment_text": "Piggyback on ur point , we will do taxi directly from airport , for one we have 3 ppl , it makes sense financially and time wise , not to mention safety as well"}, {"username": "Gianna Onesi", "comment_text": "Thank you for the information!"}]}, {"id": "2199521520446926", "text": "Mt. Etna", "link": "facebook.com/groups/1373361046396315/permalink/2199521520446926/", "likes": 3, "comments": []}, {"id": "2199527393779672", "text": "Has anyone in this group traveled with Italy with Pleasure?", "link": "facebook.com/groups/1373361046396315/permalink/2199527393779672/", "likes": 0, "comments": []}, {"id": "2199523113780100", "text": "How do I check where the ztl zones are exactly? I am interested in a b&b in Pisa but the owner says she isn’t in the zone but the general map I saw was all red(ztl zone). Is there a specific map that tells? Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2199523113780100/", "likes": 0, "comments": [{"username": "Alice Francesca", "comment_text": "There will be signs on the street when you are entering Ztl.If you are not allowed, or don't have special permit, you will get a fine.Remember some ZTL only work at certain times or days so the owner of the bnb might be right"}, {"username": "Benedetta Vanni", "comment_text": "https://\nmobilita.pisamo.\nnet/ztl/\n\nHope this helps.\n\nDo not assume you can park your car near the hotel: medieval towns such as Pisa have very limited parking space (narrow roads, high density of buildings)."}]}, {"id": "2199530363779375", "text": "Hi!\nExcited to be visiting Italy again next year in May/June.\nIs there a deal for booking lots of train or bus tickets together or just book individually? Or an Italy unlimited month pass etc?\nI am not much of a pre booker but good to read on this group that prices go up a lot last minute!", "link": "facebook.com/groups/1373361046396315/permalink/2199530363779375/", "likes": 0, "comments": []}, {"id": "2199538937111851", "text": "Beware if you are flying in or out of Palermo, Sicily.\nFire going on around the airport, which had to be closed", "link": "facebook.com/groups/1373361046396315/permalink/2199538937111851/", "likes": 0, "comments": [{"username": "Alessandro Iannelli", "comment_text": "It reopened at 11 a.m."}]}, {"id": "2199558617109883", "text": "Looking for recommendations on mobile phone carriers to use whilst in Europe please. Not so worried about calls but would like data. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2199558617109883/", "likes": 1, "comments": [{"username": "Sam Mah", "comment_text": "Lebara."}, {"username": "Eric Parks", "comment_text": "I use Iliad. 150Gb, 5g for 10€/mo for Italy. Plan is less data for rest of Europe but don't recall how much."}, {"username": "Sandi Van", "comment_text": "T-Mobile free text and data"}, {"username": "Dominic Po", "comment_text": "T mobile work fine. I bought international plan for 10 days just in casw"}, {"username": "Sabrina Francesca", "comment_text": "I used airalo\nWorked perfect.\n\nThey just sent me a 3 dollar off coupon that I don't need if u want it.\n\nSABRIN7109\n\nI paid 11 bucks for a whole month and had data everywhere with plenty left over"}, {"username": "Lupita HC", "comment_text": "Holafly"}, {"username": "Raelyn Werbish Zeilinger", "comment_text": "I have Verizon and bought international plan $10 a day , I was in Ireland and never had to worry if on wifi or not"}, {"username": "Michele Levesque Semosky", "comment_text": "Depending upon what plan you have, TMobile provides unlimited texts and data. Phone calls are .25 per minute."}]}, {"id": "2199548113777600", "text": "We are staying in Florence for a few days in October and are looking for two recommendations:\n1. A really good cooking class- I am a foodie and love to cook but have quite a bit of experience\n2. A tour of Tuscany- we will not have a car and really want to see the area. Lunch would be a bonus", "link": "facebook.com/groups/1373361046396315/permalink/2199548113777600/", "likes": 2, "comments": [{"username": "Kathleen Mignogna", "comment_text": "Same here!!"}]}, {"id": "2199556943776717", "text": "I will be in Florence for Christmas and Rome thereafter until NYE.\nWith all the posts popping up about luggage allowances and difficulty with cases on stairs, trains, etc, can anyone give me any ideas regarding what to pack weather wise?\nI will be spending 3 weeks prior travelling to Norway, England and across Europe, so I am expecting degrees of cold weather changes where layers and coats will be required, so I will have some bulky items. Thanks in advance", "link": "facebook.com/groups/1373361046396315/permalink/2199556943776717/", "likes": 3, "comments": [{"username": "Alice Francesca", "comment_text": "Florence is generally colder than Rome.So you will need a hat, gloves, scarf and a nice warm jacket.\nIn Rome sometimes the weather is warmish, I was there around last Xmas and just needed a coat."}, {"username": "Sigrid Cormier", "comment_text": "Wear your heaviest coat, sweater, jeans, shoes on the plane….cause you’ll be taking off your coat as you sit. That will help somewhat.\nI’m assuming you will be doing laundry on long the way."}, {"username": "Cindy Hall", "comment_text": "Last December we went from Switzerland, Milan, Genoa, Florence down to Rome. So we went from extremely cold with snow, through mild with rain to 70 degrees. We took Parkas that had zip out linings- they were PERFECT (Patagonia has excellent options) for going through the various weather conditions."}, {"username": "Lucrezia Folger", "comment_text": "According to google: The average temperature in Europe during December varies between minus degree temperature to 8 degree temperature. A diverse number of places experience severe snowfall during this period."}, {"username": "Raelyn Werbish Zeilinger", "comment_text": "Anyone wear their leather jacket in December ? Going December 2024 and I was also wondering what coats to pack , puffer coat it is for one coat!"}, {"username": "Rhona OConnor", "comment_text": "Don't forget a ☔"}, {"username": "Lisa M Miller-Breakwell", "comment_text": "Ohh… this sounds very familiar! An Xtm jacket like mine is perfect. They are so warm and light!"}, {"username": "Mark Miller", "comment_text": "And wet weather boots"}]}, {"id": "2199562783776133", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2199562783776133/", "likes": 6, "comments": []}, {"id": "2199568567108888", "text": "Am I missing a major food rule in Italy? Sitting at a restaurant we asked for olive oil for our bread and the waiter seemed really upset that we asked. He then proceeded to take our plates away and kept say ‘non possibile’ like 5 times. Then 2 minutes later came back ok here is the olive oil. I’m really confused what happened and what we did wrong. Can someone fill me in?", "link": "facebook.com/groups/1373361046396315/permalink/2199568567108888/", "likes": 89, "comments": [{"username": "Ilaria Verda", "comment_text": "Only tourists did it"}, {"username": "Alessandro Battxi", "comment_text": "only tourists can ask something like that."}, {"username": "Rebecca Saltmarsh", "comment_text": "Oh wow, I’m intrigued to hear responses as to why also 🤨"}, {"username": "Manuela Bonazzi", "comment_text": "Un italiano non mette l'olio sul pane al ristorante..com\nunque non mi sembra così sconvolgente,c'\nè di peggio,tipo il cappuccino con la pasta."}, {"username": "Hope MacIntyre", "comment_text": "Doesn’t matter if tourist ask, a paying customer is a paying customer and seems like tourists support business and should be treated better"}, {"username": "Beth Stark Clarke", "comment_text": "My friend from Italy said that dipping bread in olive oil is an American thing. Not a normal practice in Italy."}, {"username": "Kelly Ann", "comment_text": "Places I went had olive oil and balsamic on the tables… 🤷🏼‍♀️"}, {"username": "Sheri Marie", "comment_text": "Just a guess. He probably felt insulted. They take great pride being a server and they move at a relaxing pace. 🤷🏼‍♀️"}, {"username": "Emma Chadwick", "comment_text": "My understanding is that the bread they give you is for mopping up sauces etc from your food and that asking for oil/butter is very much an American/uk thing."}, {"username": "Melissa McCormick", "comment_text": "We had half and half… some restaurants had it on the table with salt and pepper, some poured it for us, then some we had to ask. When we asked for it some seemed fine giving it and we had like 1-2 that seemed a little annoyed. Not sure! But we definitely had an experience like that as well!"}, {"username": "Cecilia Christine Costantini", "comment_text": "We don't put olive oil on bread in restaurants, but you can order bruschetta aglio e olio (which is with oil and garlic). Oil is brought to the table by default if you order a salad or some other dishes, but not for bread. However, in some restaurants in might be on the table already, but if you look around, you won't see Italians using it on their bread."}, {"username": "Carmen Capra", "comment_text": "The olive oil and balsamic on the tables are not for dipping bread but to mix your salads with…."}, {"username": "Thelma Gipson", "comment_text": "I've been in Italy for two months, waiters get extremly annoyed for everything, if you order ice, if you order oilive or balsamic etc. They are not very nice."}, {"username": "Alessandro Iannelli", "comment_text": "When I was a child, and even more so in the previous generations, a traditional \"snack\" for kids was bread with a little olive oil, salt, pepper, and depending on the tastes or the region also some anchovies. So putting olive oil on bread isn't something new in italian food culture. Of course, I wasn't there so I can't tell what happened, if you kind of \"dipped\" bread in oil that looks weird. You know what my guess is? They didn't feel like charging you for a little olive oil, so they were annoyed that it was going to be \"wasted\" like that. Olive oil costs nowadays, even the cheapest pne goes 6 euros per liter."}, {"username": "Claudio Blizzard Indastria", "comment_text": "We don't make bruschette on the fly at restaurant lol"}, {"username": "Alessia Zito", "comment_text": "Because we Italians don't eat bread with oil in restaurants, we eat it by the \"scarpetta\" or while waiting for food, but without mixing it with anything else"}, {"username": "Miriam Griffin Woods", "comment_text": "Guess I will not ask for butter than lol"}, {"username": "Nicola Ramoso", "comment_text": "It might be the usual case of a waiter with poor English skills that doesn't know how to explain himself and so he just curtly dismisses the customer"}, {"username": "Lauren Burow", "comment_text": "They brought it with the bread at the restaurants we went to! 🤪 they even poured it for me adding the balsamic and salt &pepper at one place. So I don’t know…"}, {"username": "Angela Grumpylicous", "comment_text": "If you pay to sit and eat in the restaurant ask for whatever you like. They will have attitude most of the time regardless of what you do because you are tourist. But without tourist they wouldn’t have jobs."}, {"username": "Laura Uribe", "comment_text": "The people that haven’t had an issue are most likely frequenting restaurants that are used to dealing with tourists. Bread in general and especially dipping it in olive oil is not a thing in Italy. We have spent months through the years and tend to visit small towns or non tourist restaurants. Jmo"}, {"username": "Ettore de Vita", "comment_text": "If costumer’s ask you for a EVO , just give it to him/her and STFK up .!"}, {"username": "Elaine Davidson", "comment_text": "I’m from UK and would really like some butter with the bread 😎"}, {"username": "Rosaria Bishop", "comment_text": "From an Italian I suggest you order what you want and if you want a cappuccino with your meal or oil with your bread then you have it! If Italians don’t like it then maybe they would prefer tourists go elsewhere 🤷‍♀️ I am proud of my heritage but Italians can be very arrogant!"}]}, {"id": "2199569850442093", "text": "Hi everyone, I and my mom will be going to Milan from July 28th to July 31st for 3 days. We're considering this Day trip to Cinque Terre on Tiquet (आणखीhttps://www.tiqets.com/en/milan-attractions-c71749/tickets-for-cinque-terre-daytrip-from-milan-p977042/). Has anyone tried this trip or something similar? Is it doable to a day trip to Cinque Terre either with a guide or by ourselves?\n\nIt's said here on Tiqet that the trip starts at 6.45am and lasts around 13 hours, which I expect to end at 8.00pm. But we also have a flight to catch at 9.30pm to Rome 😬 Should we just skip Cinque Terre.\n\nWe also plan to do another day trip to Lake Como the day before this.", "link": "facebook.com/groups/1373361046396315/permalink/2199569850442093/", "likes": 0, "comments": [{"username": "निनावी सहभागी", "comment_text": "."}]}, {"id": "2199571293775282", "text": "Visiting Sicily Sorrento and Amalfi in September. Do all excursions and day trips need to be booked well in advance or is there room for spontaneity and can book a couple of days before? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2199571293775282/", "likes": 1, "comments": []}, {"id": "2199583353774076", "text": "Hey all, question re: Amalfi Coast.\nI have been visiting the cost every year since 2018, so I know the area very well. I would like to do something different special this year perhaps see something off the beaten path;\nwhat was the highlight of your trip and there is anything that you would definitely recommend as a must do? It Can be a specialआणखी restaurant, a fancy beach club, an incredible boat tour, a museum or any other adventure that left the mark. Also, this year I am traveling solo, so definitely keen to join a group tour. thank you all and enjoy this amazing country! ❤️", "link": "facebook.com/groups/1373361046396315/permalink/2199583353774076/", "likes": 3, "comments": [{"username": "Alice Francesca", "comment_text": "Do you have a region/area in mind?"}, {"username": "Glenn Todd Webb", "comment_text": "Villa Rufolo and Cimbrone in Ravello"}, {"username": "Miyuki Kanno Paul", "comment_text": "Il Cantastorie in Vietri sul Mare is fabulous for both lunch and dinner.\nHave lunch at Al Convento(late Anthony Bourdain dined there), San Pietro, or Aquapazza(David\nRocco dined there) in Cetara. Shopping Colatura di Alici, salted capers, jarred tuna at Nettuno just up the winding street.\nRicotta e Pere at Sal de Riso in Minori. Oh Minori has Villa Romana e Antiquarim. Stroll lungomare in Maiori and catch the granita lady for ice cold scoop. Have cuoppo at Cuoppo d’Amalfi, and Lemon leaf wrapped cheese at Al Cancelletto in Amalfi. Paper mill museum is just up the street on the main drag. Delizia al Limone tasted the best at Villa Maria in Ravello."}, {"username": "Steve Grossman", "comment_text": "In capri have lunch at the hotel villa brunella. You will absolutely love it"}, {"username": "Stacy Prestigiacomo", "comment_text": "Arienzo beach club in positano was great and Maria grazia restaurant not sure what town had amazing food"}, {"username": "Em Marie", "comment_text": "Path of the Gods hike to Positano 😍"}, {"username": "Sarah Williams", "comment_text": "Path of the gods - incredible walk"}]}, {"id": "2199592943773117", "text": "Hello 👋🏻\nJust curious. Is it better to book a Gondola ride online, or there personally in Venice?\nIs it cheaper or same price? We want private ride, not Group.\nThank you in advance 🙏🏼", "link": "facebook.com/groups/1373361046396315/permalink/2199592943773117/", "likes": 1, "comments": [{"username": "Giada Todaro", "comment_text": "Do it personally. Gondola rides have fixed price. 80 euros for 30 mins ride"}, {"username": "Dayna Steinberg Cioffi", "comment_text": "Book when you are there. They are readily available and you can just decide when you are in the mood, weather, and area you choose to be in."}, {"username": "Pao Magnoler", "comment_text": "Do it there."}, {"username": "Trish Ellis", "comment_text": "You can get a ride for just two."}, {"username": "Nadia Filice", "comment_text": "Do in person. Rate is €80 for 30 minute ride"}, {"username": "Lisa Valdovinos", "comment_text": "My husband and I walked right up the gondola. There was no line. It’s between 80-100 euros."}, {"username": "Kit Nader", "comment_text": "Same price. No need to book. You'll be tripping over gondoliers touting for business."}, {"username": "Lucrezia Folger", "comment_text": "Just do it when there, 100’s of them everywhere."}]}, {"id": "2199593230439755", "text": "Advice needed!\n\nWe recently stayed in an apartment in Venice and realised 1 day later we checked out, my husband left behind a whole heap of clothes in drawers.\nI contacted them as soon as we realised to which they instantly replied no items were left behind. We are 100% certain they were left there.\nHas anyone had this happen ? Any advice on what actions to be taken?\nFYI - the clothing was quite expensive with tags on them.\nThanks in advance", "link": "facebook.com/groups/1373361046396315/permalink/2199593230439755/", "likes": 20, "comments": [{"username": "Phyllis Snyder", "comment_text": "Don’t think you have any recourse- however possible your travel insurance might help?"}, {"username": "Shelly Michelle", "comment_text": "I would definitely add this experience to any reviews you complete. This happened to me recently, but I had left my iPad and digital camera in a drawer. Yes, normally I go through drawers, but for some reason, I didn’t this time. I immediately called the hotel (3 hrs after we checked out). The guy who answered said “if we find it we will call you”. No, I need to speak to a manager. Once I did that, miraculously, someone had gone up to the room and located the items. What would’ve happened had I waited for them to call? Lesson learned!"}, {"username": "Harris Dee", "comment_text": "I leave all my liquid toiletries to lighten my bag … never a complaint"}, {"username": "Jona Guðmundsdottir", "comment_text": "The only time we forgot something that was worth asking for was 8 yrs ago when we forgot my sons new swords and toys.... then we found out that my husbands new sweater which he swore he hadnt brought with us was there as well... plus some other stuff. Thankfully the owner just sent the lot home to us and didnt even want to get paid. :)"}, {"username": "Frances McDonagh", "comment_text": "How times have changed I was on Venice and left my cheapy diamond studs in a hotel when I got back to Ireland I emailed them and they posted them to me"}, {"username": "Sanjic Konopiski", "comment_text": "I forgot my European charger in Palma de Mallorca. I realized after few hours after checking out. I called and they said they didn't find anything. I know is there. I didn't push because it was cheap item and easy to replace otherwise probably you will need to go back to hotel for expensive items and talk with managers or something. Good luck"}, {"username": "Olga Plitt", "comment_text": "I never put stuff in drawers when I travel, I live from my suitcase,its always worked out better."}, {"username": "Olga Plitt", "comment_text": "I think that the reason they say they didn't find anything is if they say they did ,the customer would probably want it sent to them and they say no its to expensive to do it could create a bad customer complain."}, {"username": "Tracy Foss", "comment_text": "Live & learn...it sucks"}, {"username": "Tracey Fairbrother", "comment_text": "They've gone"}, {"username": "Frank Dragna", "comment_text": "They may have been honest with their answer and a cleaning crew took the items."}, {"username": "Christine Broussard", "comment_text": "Cleaner’s definitely unfortunately"}, {"username": "Brian Anderson", "comment_text": "They are only clothes....they\n're gone. Don't dwell on it."}, {"username": "Colleen Lee", "comment_text": "Travel insurance may cover it, worth a try."}, {"username": "Lee Pellicciotta", "comment_text": "Yes with my daughters teddy! They said it wasn’t found and 100% we know it was there! Sadly we were on a train already so could never get it!"}, {"username": "Debra Fergison Canova", "comment_text": "Write it off"}, {"username": "Steven Gosling", "comment_text": "This happened to me at a hotel in Garda. I was about 14 (I'm now 52) and left my collection of mix tapes recorded from the radio under the bed. I was gutted. I pestered my mother to call the hotel (no email then) which she did but they claimed they never found them. But I bet the cleaner suddenly had a new collection to play in his walkman."}, {"username": "Kimelia Miller", "comment_text": "Same experience in a hotel in Las Vegas. Rushing to get to the airport and I didn’t check the wardrobe where my new clothes were hanging. I rang the hotel as soon as we landed at our next stop and was told that nothing was found.😩"}, {"username": "Missy Manzano", "comment_text": "Oh no ! I’m so sorry . We have an AB&B in another state , so if anything is left behind it’s the word of the housekeepers against the word of the guests , unfortunately. I don’t believe there is any recourse now . 😞"}, {"username": "Grace Scinto", "comment_text": "This sort of potential issue is why I never unpack my suitcase."}, {"username": "Penny Williams", "comment_text": "Do you have travel insurance? Make a claim for lost clothes. Same as losing a suitcase."}, {"username": "Maria Gioffre", "comment_text": "I would put a claim in as stolen. You wont get it back. There is a lot if thieves of there"}, {"username": "April Calder", "comment_text": "I left my birkenstock sandals in a hotel room. Called immediately and said they weren't there. Oh well hope someone's enjoying my sandals. Lol"}, {"username": "Dianne Kelly", "comment_text": "It seems to me that the majority of comments I read about B&B's and renting private homes are pretty negative."}, {"username": "Frank Hunt", "comment_text": "Left my expensive Raybans in a drawer in a hotel once, phoned up an hr later, nothing.😂😂"}, {"username": "Jenny Kendrick", "comment_text": "Possibly cleaners get used to stuff being left behind by travellers like me who leave their clothes so they can fit their souveniers in their bag! Possibly little you can do if they say they dont have them"}, {"username": "Eva Salas", "comment_text": "File it with your home insurance. It was stolen, right?"}, {"username": "Ruth Akutu Maccarthy", "comment_text": "The cleaners ....."}, {"username": "Amanda Richards", "comment_text": "Travel insurance?"}, {"username": "Karen Bishop", "comment_text": "We had an experience with my daughter’s Teddy! Not once but twice.\nI know, should have learnt the first time!\nTeddy got left behind in Las Vegas, he arrived home to Australia via FedEx with a cute note. Next USA trip he was left in Florida and also arrived via FedEx in Memphis. Both times very very lucky!! He has stayed home ever since!! 😳\nSadly in this case I feel your husbands shirts are gone. 😢"}, {"username": "Debbi Mayfield", "comment_text": "Unfortunately if they said there are no clothes, you are out of luck. It’s your word against theirs.\n*note to others: don’t put stuff in drawers where you’ll forget it"}, {"username": "Connie Wilson", "comment_text": "I would chock this up as a mistake and move on…enjoy the rest of your trip!"}, {"username": "Oldriska Balouskova", "comment_text": "I don’t think there is anything you can do - I just found a bunch of clothes in a hotel room and the hotel said they would immediately contact the previous occupant - but it was a 5 star hotel"}, {"username": "Gina Van Antwerp", "comment_text": "In our family, one of us goes through every room and drawer before checking out"}, {"username": "Chris Vilsack", "comment_text": "It's gone. Sorry. Nothing you can do. Next time put your best shoe(s) somewhere unique. Forcing you to remember to empty the room"}, {"username": "Bob Cinquini", "comment_text": "Well, now you have a reason to go back!!"}, {"username": "Sheri Marie", "comment_text": "Unfortunately no. That happened to us in the states."}, {"username": "Maria Pham", "comment_text": "Leave your husband instead. 🤣"}, {"username": "Lauren Swanteck Myler", "comment_text": "I would just let it go."}, {"username": "KB Spector", "comment_text": "It is also possible the cleaners took them, and the owners are responding truthfully. Either way, you will sadly have to eat the loss. I left a silk jacket behind once and after several attempts to retrieve, someone at a different address is surely enjoying it!"}, {"username": "Angela Grumpylicous", "comment_text": "Nope you have no recourse. When you check out it’s your responsibility to make sure you have all your items (that’s what their response will be). They won’t do anything. Just take it as an expensive lesson and reminder for your next trip. It’s sucks"}, {"username": "Kit Nader", "comment_text": "I had a similar thing once left clothing and a hand made blanket I'd just finished making ( this was in England in a cottage). They said when I enquired that nothing had been found. They were all together in a bag. Nothing I could do about it ... but we ended up going back to the cottage 6 months later ...and the blanket was just there folded up in a cupboard . Obviously no clothing!! I guess the staff couldn't care less."}, {"username": "Claudia Amp", "comment_text": "Maybe the cleaners took them and the actual owners know nothing about these items. A lot of Airbnb owners manage everything remotely having only cleaning staff go in to check apartments and clean up. If they say the found nothing, you might as well give up."}, {"username": "LaRee Begbie", "comment_text": "This happened to me once when I travelled to Mexico. They found my clothes and then refused to return them. Thankfully I had this all in writing. I contacted my credit card and provided them with all the documentation. My credit card reimbursed me for my items that were basically stolen from me. Check with your credit card for Insurance, you could be covered."}, {"username": "Keith Crossley", "comment_text": "I left a special shirt in the room. By the time I realized it and returned, the cleaners had come and gone. That's it, gone; nothing to do with the owners / managers."}, {"username": "Marie Callahan", "comment_text": "Maybe you're better off leaving it. Years ago I appreciated that a hotel would ship a light left-behind windbreaker jacket to me. Hotel was a few hundred miles away.\nThen I got the $50 charge when it could have shipped for under $5."}, {"username": "Sue Cuthbert", "comment_text": "My daughter left expensive sun glasses (2nd pair after she sat on her first) and something else important in a hotel in NY. We phoned as soon as we reached the airport, they also said, nothing left in the room.\nIt happens the world over."}, {"username": "Patricia Siemiontkowski", "comment_text": "Several years ago when I checked into a Pensione in Italy, I found a drawer full of beautifully tailored pants. No one apparently claimed them. They were a perfect fit for me! Welcome to Italia!"}, {"username": "Jennifer Dobachesky", "comment_text": "I left a necklace behind in New York on my way to Italy and contacted the hotel while I was still in the airport in nyc and they said it wasn’t there. I knew exactly where I had left it but they said no. So I was just out of luck. It was my own fault for leaving it. I just wish more people were honest when things were found"}, {"username": "Caroline Croghan", "comment_text": "Maybe the people cleaning the room didn't check properly and the next guests took the clothes"}, {"username": "Frannie Kaplan", "comment_text": "I did this as a girl qnd my parents acted like I had killed somebody. Instead of leaving them there they told the hotel they'd pay for the shipping to send them back and hold it above my head for the rest of my life. Surprisingly, they did mail it. You can offer to do the same.\nPersonally now that I work I would never bother to mail something like this but you can ask."}, {"username": "Pamela Johnson", "comment_text": "I'd say its your own fault and nothing can be done if they say nothing there. Lessons learned."}, {"username": "Lauran Cantwell", "comment_text": "It may be a case of the cleaners found them or the next check in guests. The owners truly may have no knowledge of the. Sorry you had to experience this."}, {"username": "Jessica Shin Cho", "comment_text": "This happened to us, my husband left a very expensive jacket in our hotel in Venice. We realized it when we got to Florence. Fortunately, hotel concierge messaged it was found and offered to ship back to US for very minimal fee. They didn’t want to send to Florence or Rome m(our next stop) bc they couldn’t guarantee it would be delivered by the time we checked out of each city. And to our surprise, jacket was delivered to our house 2 days after our return."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2199594017106343", "text": "Beautiful Ortisei -Italian Dolomites\n\n📷myself", "link": "facebook.com/groups/1373361046396315/permalink/2199594017106343/", "likes": 77, "comments": [{"username": "Clint Foster", "comment_text": "Any good tours that take you to the Dolomites from Venice or Milan?"}, {"username": "Pam Borchert Wildrick", "comment_text": "Dramatic and beautiful!!!"}, {"username": "Alisha Frank", "comment_text": "Terry Frank"}, {"username": "Paul Davis", "comment_text": "Beautiful town!"}, {"username": "Ruth Akutu Maccarthy", "comment_text": "Ruth Akutu Maccarthy"}, {"username": "Mary Andreotta", "comment_text": "Looks amazing! We are going to the Dolomites next year, to my father-in-law's\nvillage - Borca di Cadore."}, {"username": "Shane Hoare", "comment_text": "Angelina Hoare"}, {"username": "Melissa Landriscina", "comment_text": "Craig Lobban"}, {"username": "Geri Elkin", "comment_text": "Perfect photo. I missed it on our first trip to Italy as it was not the right season BUT It's on the bucket list for the future definitely. 💗"}, {"username": "Ken Feltham", "comment_text": "Going there in October 😀"}, {"username": "Kelly Hanberg Rosati", "comment_text": "Robin Seiwerath"}]}, {"id": "2199602320438846", "text": "Looking for good restaurants in Venice but not to expensive . What a must see there .", "link": "facebook.com/groups/1373361046396315/permalink/2199602320438846/", "likes": 0, "comments": []}, {"id": "2199605820438496", "text": "Hello I'm just wondering is it necessary to book a ferry in Venice in advance ?", "link": "facebook.com/groups/1373361046396315/permalink/2199605820438496/", "likes": 2, "comments": [{"username": "Connie Wilson", "comment_text": "No, they are not reservable."}, {"username": "Kasia MacDuda", "comment_text": "If you stay at Hyatt Centric they will provide a water shuttle at no fee. It was great!"}, {"username": "Nick Cittadinni", "comment_text": "Where are you trying to go on your ferry?"}, {"username": "Lynn Francisco Casella", "comment_text": "No"}, {"username": "Pao Magnoler", "comment_text": "No. You can't book them. You just get there and buy the tickets. They are available all the time."}, {"username": "Maree Noble", "comment_text": "Thank you 😊"}, {"username": "Linda McShane Payne", "comment_text": "You can book a water taxi"}]}, {"id": "2199639503768461", "text": "I am planning on visiting Italy next May and right now want to visit Rome, Florence, Venice and Naples. I would love to do at least one cooking course. Where would you suggest and bonus - do you have a class you would suggest?", "link": "facebook.com/groups/1373361046396315/permalink/2199639503768461/", "likes": 0, "comments": [{"username": "Glenn Todd Webb", "comment_text": "I posted this ? For Rome/Florence. Search previous answers."}]}, {"id": "2199613663771045", "text": "Best way to travel from Naples and explore the amalfi coast towns ..7 days please", "link": "facebook.com/groups/1373361046396315/permalink/2199613663771045/", "likes": 10, "comments": [{"username": "Glenn Todd Webb", "comment_text": "Stay in Ravello and see villa Rufolo and villa Cimbrone. Take a day to Capri, a day to Amalfi. You can skip Sorrento and Positano. Day trip south to Paestrum if you like Greek ruins."}, {"username": "Miyuki Kanno Paul", "comment_text": "What month of the year are you going to visit? Many places shut down starting from late October to early March.\nFrom Napoli, take a ferry from Molobeverello port to Positano or Amalfi is the easiest while ferry is running. SITA bus runs between Sorrento to Salerno. So if you are going during off season, get to either Sorrento or Salerno first, then take a SITA bus.\n\nWe usually take a train to Salerno and pick up a rental car when driving"}, {"username": "Taylah Arnott", "comment_text": "Joel Brincat"}, {"username": "Patti Warren", "comment_text": "Do not skip Sorrento! It’s my favorite."}, {"username": "Renae Larcus", "comment_text": "We stayed in Sorrento and took the ferry or the SITA bus to other towns."}, {"username": "Jason Hobel", "comment_text": "What about staying in Sorrento? It makes for a perfect base and you can take many day trips form there including the Amalfi Coast, Pompeii, Herculaneum, Mount Vesuvius and more and Sorrento is a beautiful town too. It was one of my favorite places."}, {"username": "Genevieve Bastien", "comment_text": "We stayed in naples and did day trips by ferry to Sorrento, Capri, Pompeii (by train) and then you can also do Ischia by day ferry\nHave a great trip :)"}, {"username": "Russell Weidner", "comment_text": "By ferry"}, {"username": "Paige Montecalvo", "comment_text": "I LOVED Positano and didn’t find anymore crowded than anywhere else we went. It’s so beautiful and feel like it’s a must see if you’re going there"}, {"username": "Jono Roland", "comment_text": "⛴️ ferry to Sorrento and various boat tours or train to Salerno and boats galore! 🤓🇮🇹❤️… you could drive but traffic is a nightmare!"}, {"username": "Lynsey Mills", "comment_text": "Best places to stay in Sorrento? This site is amazing btw. Very inspirational"}, {"username": "Terina Kwiatkowski", "comment_text": "We are here in I’m off you right now and 100% scooters the best way! ￼"}, {"username": "Bernadette McKay", "comment_text": "By ferry"}, {"username": "Luigia Gray", "comment_text": "Stay in Sorrento. You can easily get bus or train."}, {"username": "John Kay", "comment_text": "Can a good driver be recommended from Ravello please"}]}, {"id": "2199618000437278", "text": "Looking for a cooking class to take on Rome in October?", "link": "facebook.com/groups/1373361046396315/permalink/2199618000437278/", "likes": 0, "comments": []}, {"id": "2199627380436340", "text": "Hi everyone planning a trip to trieste in October, any suggestions where to stay (airbnb?) and where to go? As others have told me that Ljubljana is close by.\nAppreciate all your help 🙏🏻🙏🏻", "link": "facebook.com/groups/1373361046396315/permalink/2199627380436340/", "likes": 0, "comments": [{"username": "Cecilia Christine Costantini", "comment_text": "Yes, Ljubljana is close, 1h20 by bus."}, {"username": "Todd N Nicole Clarke", "comment_text": "We just spent 3 days in Trieste stayed in a hotel which was close to everything, we had a driver from Ljubljana airport took about 1.5hrs"}, {"username": "Ruth Mattingly", "comment_text": "In April we stayed at Hotel Solun. It was affordable and nice, though they do not have a ton of rooms. Great location. We did hire a driver and did a day trip to Ljubjana, with a stop in Bled. It was worthwhile. A unique part of the world. If you go, enjoy a Hugo Spritz by the water."}, {"username": "Elena Innocenti", "comment_text": "the last time i went to trieste for work i stay at Savoia Excelsior Palace Trieste. Good hotel near Piazza Unità d’Italia, and sea view room are avaible."}, {"username": "Benedetta Vanni", "comment_text": "Definitely go to Miramare which is a castle nearby with a beautiful view and a garden. Buy the audioguide on site. Consider buying \"FVG card\" (Friuli Venezia Giulia) which will give you free access to a number of museums and attractions (e.g. free audioguide to Trieste city center, you can get it at the local Infopoint in Piazza Unità)."}]}, {"id": "2199628263769585", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2199628263769585/", "likes": 0, "comments": []}, {"id": "2199636933768718", "text": "Flying from Venice to Paris on the last leg of our trip before coming back to the states… any advice on AirFrance vs. Easy Jet??", "link": "facebook.com/groups/1373361046396315/permalink/2199636933768718/", "likes": 1, "comments": [{"username": "Edmond Nolan", "comment_text": "Air France hands down"}, {"username": "Dayna Steinberg Cioffi", "comment_text": "We just flew air france from naples to paris and then paris to jfk. Flights were great, nice staff, comfortable seats and meals/snacks."}, {"username": "Sarah Sellem", "comment_text": "Both are OK but easyjet are very strict regarding the weight of your suitcase. If there’s even a kilo over you have to pay extra"}, {"username": "Jenny Frank", "comment_text": "AF"}, {"username": "Rhona OConnor", "comment_text": "Easy Jet is a budget airline.... And all that brings."}, {"username": "Louis Des Forges", "comment_text": "As the flight is only 90 minutes all you get on Air France is a single drink (tea, coffee etc). Work out how much baggage you are taking and compare prices. If its more than €10 don't see the benefit of going with Air France for a short flight."}, {"username": "Virgz Van Møøre", "comment_text": "Air France or Transavia, Easy Jet can be canceled last minute"}]}, {"id": "2199640393768372", "text": "Has anyone gone to Pepe in Grani from Sorrento?\nHow did you get there?\nI got quoted €400 to take us to Caiazzo for pizza, and think it sounds a little ridiculous since I can rent a car for the day for €100.", "link": "facebook.com/groups/1373361046396315/permalink/2199640393768372/", "likes": 0, "comments": [{"username": "Claudio Blizzard Indastria", "comment_text": "Unfortunately Caiazzo is out of any touristic route, and drivers have no reference or standard. 400 sounds crazy but 200 would be reasonable anyway\n\nYou could try to Use Napoli or Caserta as starting point, making the journey cheaper or switch to i masanielli in Caserta which is as good as pepe in grani."}]}, {"id": "2199644103768001", "text": "Anyone from the USA travel to Italy with Consumer Cellular as your carrier? Guidance on navigating the international roaming fees? SIM cards? I’m really not good at this, and appreciate any help. Leaving for Rome 8/31/23. Grazie!", "link": "facebook.com/groups/1373361046396315/permalink/2199644103768001/", "likes": 0, "comments": [{"username": "Lee D'Angelis", "comment_text": "Just use WhatsApp. You & your contacts need to down the app."}, {"username": "Nancy Wasen", "comment_text": "I would contact their customer service."}, {"username": "Miyuki Kanno Paul", "comment_text": "Make sure that your phone is unlocked if you plan on purchasing a SIM. TIM offers Tourist Special for a very reasonable price"}]}, {"id": "2199642003768211", "text": "Can anyone recommend transfer from the airport ( FCO) into Rome centre. I arrive at about 9.30 in the morning. Is it advisable to book a transfer or is it easy to catchl a bus?", "link": "facebook.com/groups/1373361046396315/permalink/2199642003768211/", "likes": 3, "comments": [{"username": "Karen Landini", "comment_text": "Official taxi stand at the airport. Fixed price, confirm use of credit card before getting in or pay cash."}, {"username": "Alessandro Iannelli", "comment_text": "Train would be my favorite solution."}, {"username": "Giada Todaro", "comment_text": "Taxi has fixed price. 50 euros. Otherwise you can choose Leonardo express train. 14 euro per person. 30 mins ride and it will bring you at Roma termini station"}, {"username": "Benedetta Vanni", "comment_text": "There is a train station right outside the airport. You can catch a Leonardo Express if you want to go straight to the central station (Roma Termini). Otherwise, you can take a regional train that stops in a lot of minor stations that might be convenient if your destination is not near the central station. Check trenitalia.com"}, {"username": "Cat Furness", "comment_text": "Train is the easiest"}, {"username": "Amanda Bellamy", "comment_text": "Thanks so much everyone for your help"}, {"username": "Ian Fawkner", "comment_text": "Bus is super easy- just exit and walk to your right - about 8 euro"}, {"username": "Tiffany Hadfield Merrill", "comment_text": "We took the train, very easy to Roma termini"}, {"username": "Traci Raymer", "comment_text": "You can walk across the street to the Hilton Rome Airport and they have a shuttle. One way is $12 euros 💶 goes every hour. White cab taxis is next at 50 euros and private transfer is 120 if you have large party (we had 6 but was picked up in a nice Mercedes van with good air conditioning)"}, {"username": "Cheri Arrowood-Stanziano", "comment_text": "Express Shuttle"}, {"username": "Renae Larcus", "comment_text": "Take the Leonardo Express!"}, {"username": "Michelle Lynn", "comment_text": "Daniele Your Driver in Rome"}]}, {"id": "2199649027100842", "text": "Did anyone used the luggage storage in Venice train station? Would like to know the experience. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2199649027100842/", "likes": 0, "comments": []}, {"id": "2199651943767217", "text": "We leave in a week for this wonderful trip we have been preparing for almost a year. Can’t wait! Thanks so much for all the dreamy pictures, the good advices and tips. Ciao! Arrivederci!", "link": "facebook.com/groups/1373361046396315/permalink/2199651943767217/", "likes": 10, "comments": [{"username": "Vasilenia Melissaropoulou", "comment_text": "Bon voyage ! Si vous pouvez, j'aimerais bien regarder quelques photos et lire vos impressions d'Italie !"}, {"username": "Donna Hinton", "comment_text": "Have a wonderful time! Safe travels!!"}, {"username": "Tracy Foss", "comment_text": "Have a wonderful time"}, {"username": "Sandy Michelle Duggan", "comment_text": "Safe travels ✈️, I just got back on Monday, same, Dream holiday 1.5 years planning, loved it, enjoy."}, {"username": "Mariposa Mariposa", "comment_text": "Safe travels!! Let us know how it goes 🇮🇹"}, {"username": "Nancy Brennan Carrow", "comment_text": "Have the best time!"}]}, {"id": "2199654213766990", "text": "Ciao! looking for advice on getting to Praiano from Naples airport. I was looking at the ferry as that sounds like a fun experience. Our air bnb host said that the climb from where the ferry brings you (Positano) is intense and that the cost of the ferry, porter for luggage, and transfer Positano to Praiano is likely the same cost as a private transfer by car from Naples to Praiano. Anyone made this journey before?\nWe are in our 30s and both healthy/exercise regularly *Honeymooning* :)", "link": "facebook.com/groups/1373361046396315/permalink/2199654213766990/", "likes": 0, "comments": []}, {"id": "2199656433766768", "text": "Has anyone stayed in Orvieto and needed to get to the train station before the funicular opens? What is the best way to get to the station?", "link": "facebook.com/groups/1373361046396315/permalink/2199656433766768/", "likes": 0, "comments": []}, {"id": "2199656847100060", "text": "Flights booked for Spring Break in Italy! Flying into Rome on the Saturday before Easter and out again on the following Sunday. Want to spend a minimal amount of time in Rome and then split the rest of our days between Gaeta and Florence. Looking for suggestions on the order we should see these places and how to travel between them to maximize our time.", "link": "facebook.com/groups/1373361046396315/permalink/2199656847100060/", "likes": 0, "comments": []}, {"id": "2199657860433292", "text": "Any tips for riding trains (regional,Fast,Italo) with big stroll?\nDo i need to go directly to my coach or any tips will be appreciated", "link": "facebook.com/groups/1373361046396315/permalink/2199657860433292/", "likes": 0, "comments": [{"username": "Benedetta Vanni", "comment_text": "In major stations served by high speed trains, the platforms are equipped with screens which will tell you which coach will stop in front when the train comes in. Super useful."}]}, {"id": "2199663460432732", "text": "Hello fellow Italy lovers 👋🏼 I have just booked last minute flights to Naples 31st July - 11th Aug. I am wanting to stay in Sorrento for the duration and do day trips for Amalfi, Positano and Capri.\nI’m a solo traveller and struggling to get a decent priced accommodation for the duration of my stay. Can I please have recommendations on where’s the best places to stay but a cheap/reasonable price for a solo traveller ☺️ thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2199663460432732/", "likes": 0, "comments": []}, {"id": "2199663753766036", "text": "Enjoying this FB page! Taking my mother (79 year old) and sister to Europe for their first time. Taking Norwegian cruise, it will be easier for my mother. We will be docked in Livorno for 2 days. We will visit Florence one day. Looking for recommendations for a reputable and reliable, with excellent reviews, private tour company for a day trip to visit small quaint villages and maybe a winery visit. Not using Norwegian excursion options for this stop. Appreciate any suggestions!", "link": "facebook.com/groups/1373361046396315/permalink/2199663753766036/", "likes": 0, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2199664997099245", "text": "My friend’s daughter studied abroad and shared these recommendations for Florence and Rome (we are not going this trip but definitely saving this for when we do!). Thought I would share! 😊\n\nFlorence & Rome Recommendations\nGeneral Rules of Thumb:\n• Gelato places that have huge mounds of gelato with fake fruit piled on top are going to be low quality, tourist traps! – search for silver tins/even some with lids, for more authentic gelato\n• Restaurants with pictures of the food outside/on the menu are tourist traps – normally located around the big attractions, try to avoid if you can additionally, seek Osterias and Trattorias – ristorantes are usually not the best\n• When eating outside, try to not leave your phone/wallet out on the table or sling your bag over the back of your chair – pickpockets are very savvy and will not be deterred that you’re sitting at a restaurant when it comes to getting their targets.\n• Water is not free when you go out to eat, unlike here at home. Not an ungodly cost, but just factor that in whilst ordering! Specify still/flat water!\n• Breakfast is not really a thing, maybe a pastry and espresso but do not expect omelets and pancakes at the hotel. Lunch is traditionally a smaller meal, check restaurant hours because lots will open for a small lunch window and close again before dinner. Dinner is late – 8/8:30ish.\n• Florence - The grocery store is CONAD, there is one right next to the Duomo with a huge wine selection, meats and cheeses, snacks, etc. since you will be eating later – perhaps a glass of wine and a snack on the steps of some beautiful building will hold you over until dinner, open container law can be a wonderful thing\n\nFlorence\n• Osteria Santo Spirito – truffle gnocchi and bruschetta is to die for, try to eat outside if you can, make a reservation!\n• Simbiosi – pizza is not as common or as delicious as you are envisioning in Florence– however Simbiosi has the most delicious pizza of all. Beautiful restaurant, great wine menu, and fairly inexpensive.\n• Panini Toscani – the only Piazza del Duomo recommendation – free samples, delicious, can still taste my order and miss it daily\n• All’Antico Vinaio – paninis didn’t hit the spot for me the same way it hit the spot for everyone else… have amassed international fame though so they’re clearly doing something correctly\n• Trattoria 13 Gobi – internationally recognized for their rigatoni dish, as they should be – also recommend the penne with steak and red wine sauce\n• Acqua al Due – I have dreams about their blueberry steak, they have a steak sampler, pasta sampler, and a salad sampler – try it all!\n• Quattro Leoni – pear and pecorino ravioli and cheesecake… ❤\n• Il Mercato Centrale – Heaven on Earth. Basically, a food court with a bar in the middle – everyone can get what they want and try each other’s – from caprese salads to sushi, they also host cooking classes which could be a lot of fun!\n• Trattoria Za Za – They have the entire breadth of Italian wants and menu needs – very well known for their Florentine steak! Make a reservation!\n• La Giostra – if you want to have a more expensive, slightly more formal meal whilst you’re there, known for their steak. Ambiance is beautiful – make a reservation! Pics of famous people who have been there line the walls… worth it for a reason!\n• La Buchetta – angels and demons gnocchi (basically alfredo sauce with a little spice)\n• Gelateria del Neri – arguably the best gelato in all of Florence\n• Don Nino and Edoardo’s – both in the Piazza del Duomo, loved by many – a little pricier because you’re paying for location, but still good\n• La Carraia – inexpensive, lots of flavors, have two Florence locations\n• Strega Nocciola – incredible, no notes for this gelato\n• View on Art – never made it here myself, but rooftop bar with the perfect view of the Duomo\n• Golden View – rather than a view of the duomo, there is a view of the Ponte Vecchio – seafood restaurant if you’re also looking for a carb break 😊\n• Rosalia’s – it’s a lot of Italian food in not a lot of time, if you are craving a smoothie or something green, more delicious and fresher Panera\n• Gusta Pizza – Diners, Drive Ins, and Dives traveled here – delicious, what you would hope Italian pizza to taste like! Check the hours before you go\n• Il Profeta – expensive, however, out of this world. Owned by a husband and wife – the best thing is the chocolate cake\n• Il Teatro – 20 euros for family style deliciousness – “unlimited wine”, a giant charcuterie platter that has these fried pasta dough balls that I dream of whenever I take a bite of bread, plus meats and cheese, and bruschetta. Then, three different pasta dishes that are rotating but could be pesto, alfredo, tortellini, etc. finally, there is a dessert platter with panna cotta, flan, cheesecake, and more. More casual if you wanted a more “let loose” evening.\n\nRome\n• Osteria da Fortunata – an elderly woman sits in the window and hand makes the pasta… do you need any other reason to go there\n• Taverna Trilussa – did not eat here myself, but heard amazing things – apparently expensive\n• Giolitti – gelato and other delicious treats\n• Old Bridge Gelateria – so many flavors of gelato\n• Da Buffeto – best pizza in Rome\n• Dar Poeta – also pizza, also the best", "link": "facebook.com/groups/1373361046396315/permalink/2199664997099245/", "likes": 543, "comments": [{"username": "Lillie Botica", "comment_text": "Drina Botica"}, {"username": "Tiara Jane Bantugan", "comment_text": "Gj Bantugan"}, {"username": "Gretchen Barretto", "comment_text": "Joash Isaiah CastilloJoachim Miguel Castillo Mel Castillo please note. Keen to choose from the list here. Best ads is word of mouth 👄"}, {"username": "Kahlia Strid", "comment_text": "Jamie Scud"}, {"username": "Karina Durant", "comment_text": "Taryn Hallam"}, {"username": "Juliana Smith", "comment_text": "Robert Bruce"}, {"username": "Ravina Bhojwani", "comment_text": "Thanks so much for sharing 🙏🙏could you please ask her where to shop too please thanks so much 🙏🙏"}, {"username": "Shirley Lewis", "comment_text": "I have lived in Florence and agree with this list ... Trattoria 13 Gobi is super! go across the river to the Oltrarno to look for local restaurants ... listen to her advice about Gelato!"}, {"username": "Pat Volza", "comment_text": "Lori Bruno"}, {"username": "Cecilia Lopac", "comment_text": "Thank you so much for this!"}, {"username": "Kathy Kibbe", "comment_text": "Great recommendation on the Conad grocery near the Duomo if you are in an Airbnb - great selection and lots of vegan/veg options - there is one across the Ponte Vecchio to the left as well"}, {"username": "Linda Ryan", "comment_text": "Steve Ryan"}, {"username": "Sara Gvero", "comment_text": "As an Italian I approve of all the rules of thumb! Giolitti in Rome does have great gelato."}, {"username": "Sophia Lin", "comment_text": "Thank you for sharing!"}, {"username": "Jen Linford", "comment_text": "What a brilliant post . So helpful - thank you 😊"}, {"username": "Theresa Cline", "comment_text": "Dawn Morey Mollica"}, {"username": "Shera Lee", "comment_text": "'Share' to your own page -"}, {"username": "Shera Lee", "comment_text": "Grahame N Katrina Stephens-Rolsto\nn"}, {"username": "Castle Kirk", "comment_text": "Castlekirk"}, {"username": "Jennifer Cook", "comment_text": "Kathy Zink Russell…. Write this down!!🤣"}, {"username": "Maria Fedele", "comment_text": "What an incredible list! Thank uou"}, {"username": "Claudio Blizzard Indastria", "comment_text": "Suggestions in Roma are quite Standards, \"the Best\" is really opinabile"}, {"username": "Heidi Adden Gee", "comment_text": "Aj Abbigale"}, {"username": "Raquel Pickering", "comment_text": "Tracey Moody"}, {"username": "Carley Johns", "comment_text": "Vivi Lowe good spots here"}, {"username": "Yateesh Kumar", "comment_text": "Nileema Kumar"}, {"username": "Elizabeth Villa", "comment_text": "Ana Isabel Fernandez"}, {"username": "Regina Benner", "comment_text": "Thanks!"}, {"username": "Cheryl Hoffman Zsido Poage", "comment_text": "Heather Leigh"}, {"username": "Gracy Grace", "comment_text": "Thanks. I’ve been to Rome, Florence, Pisa, once. But would prefer more info about museums all over. Would you have some?"}, {"username": "Alice Francesca", "comment_text": "At any decent hotel (from 3 stars up) you surely will find all kind of food for breakfast! Sweet and salty, including bacon, eggs, pancakes etc.I am Italian ."}, {"username": "Tarah Watts", "comment_text": "Jacques Vercuiel"}, {"username": "Shannon Welch Farr", "comment_text": "Thanks so much! We have an AirBNB lined up for Florence so good to know where to find a few groceries!\nSarah Foot DiNicolantonio lots of restaurant recommendations\nhere."}, {"username": "Bec Billy Dodds", "comment_text": "Ronnie Bowkett Phillip Velcich"}, {"username": "Elaine Baker", "comment_text": "Lorraine Mees\nThere’s some good tips here for Florence 👍"}, {"username": "Jo Courage", "comment_text": "Wow thank you so much for posting this it is so helpful for ideas of places to go 👏"}, {"username": "Dana Green", "comment_text": "If you use your maps app on your iPhone you can find all kinds of grocery stores scattered in Rome. There’s Conads, Pam’s, and Coop’s all over."}, {"username": "Dana Green", "comment_text": "On super hot days in Rome I used the delivery Apps called Deliveroo and Just Eat. I used them twice for restaurant/\nfood delivery and twice for Conad grocery store delivery. Delivery fees were super minimal. There is no Uber Eats in Rome."}, {"username": "Matty Shay", "comment_text": "Millie Timm"}, {"username": "Tanya Lawrence Lovelady", "comment_text": "Thank you!"}, {"username": "Stephanie K. Cox", "comment_text": "Following!"}, {"username": "Paula Ravinski Galle", "comment_text": "Following"}, {"username": "Magda Rampal", "comment_text": "Donna Mersin"}, {"username": "Mary Jo May", "comment_text": "Diane Rogel"}, {"username": "Lorraine Baker", "comment_text": "Such comprehensive information. Very helpful.😍"}, {"username": "Pamela Schnepp", "comment_text": "Antoinette Schultz Vogt"}, {"username": "Josephine Rauch Rotunda", "comment_text": "Thank you so much for this information and tips…. I am saving this for my trip next year, although I have been to Italy a few times now it’s always good to try new places and to get other opinions… It’s obvious from the comments everyone does have a different opinion and tastes."}, {"username": "Rachel Castleberry", "comment_text": "Grazie Mille!! This information is amazing! Thank you for sharing."}, {"username": "Lea Wilson", "comment_text": "Thankyou daughter of Rebecca ❤️"}, {"username": "Holly Groves", "comment_text": "Barry Groves"}, {"username": "Chris Payne Davenport Burgis", "comment_text": "Tina Davenport Brown"}, {"username": "Chris Payne Davenport Burgis", "comment_text": "Thanks for sharing"}, {"username": "Robyn Lawson", "comment_text": "Great information which will really assist when we go in September. Thank you."}, {"username": "Robyn Klade", "comment_text": "Debbie Padgett Cohen"}, {"username": "Beth Wright Albrecht LaSasso", "comment_text": "Jodi Snare"}, {"username": "Beck Chapman", "comment_text": "Kris John Chapman menus with pictures!! 😂"}, {"username": "Tiffany Boland", "comment_text": "Kate George, Dannielle Boland some good recommendations"}, {"username": "Josh Pearce", "comment_text": "Following."}, {"username": "Sue Anderson", "comment_text": "Thanks for the tips!! We're visiting Italy next year and I'm becoming a little worried that I won't find a lot that I like to eat. I don't eat meat or cheese - and EVERY post is about eating these 2. I get the feeling that finding fresh fruit or vegetable dishes without cheese/cream is going to be hard. Am I going to starve??"}, {"username": "Lina Fusco", "comment_text": "Melissa Lazarevic Isabella Struga Matthew Struga"}, {"username": "Jessica Swayze Bennett", "comment_text": "Stephanie Sullivan Rogers\nSheryl Paul Want"}, {"username": "Lynne Farrell", "comment_text": "Following"}, {"username": "Consuelo Lowe", "comment_text": "Thank you!"}, {"username": "Deb Wiens", "comment_text": "Robert"}, {"username": "Marinor Gilanga Protacio", "comment_text": "Thanks for sharing!"}, {"username": "Christa Lumby", "comment_text": "Morgan Eicher Mike Toomey"}, {"username": "Molly Phong", "comment_text": "Kathie Lehane Melia"}, {"username": "Lora Romo", "comment_text": "Thank you for taking the time to share this!"}, {"username": "Brooke Chapman", "comment_text": "Mitch Corn"}, {"username": "Michelle Chew", "comment_text": "Thanks for sharing. Very helpful."}, {"username": "Maire Green", "comment_text": "What is the best way to save these posts? They are invaluable and thank you everyone."}, {"username": "Victoria Petcavage Brown", "comment_text": "Thank you!"}, {"username": "Monica Saluja", "comment_text": "Following"}, {"username": "Erik Moller", "comment_text": "I am in Ferrara. Any recommendation for good pasta tonight?"}, {"username": "Cindy Jendra Kuehner", "comment_text": "Great info\nSandi Phalen Nancy Koutropoulos Ashley Merath"}, {"username": "Gwyn Schmalz Hay", "comment_text": "Ate at Osteria San Spirito 9 yrs ago and can't wait to go back in Sept... So glad it's still there and good!!!"}, {"username": "Carolyn Barthelmes", "comment_text": "Wow. Good info. Thank you."}, {"username": "Lauren Overton Call", "comment_text": "Victoria Butler Culbertson"}, {"username": "Jodi Thornton Lindsey", "comment_text": "F"}, {"username": "Kimmie Roberta", "comment_text": "Andrea"}, {"username": "Maria Arena-Arganese", "comment_text": "Thanks for sharing. Great source of info"}, {"username": "Patty Barnes", "comment_text": "Thank you !"}, {"username": "May Mazen", "comment_text": "Moemen Mazen 🤩🤩🤩"}, {"username": "Rhona OConnor", "comment_text": "Great information 👌thank you"}, {"username": "Aaron Kincaid", "comment_text": "Tailor Kincaid"}, {"username": "Sarah Reed", "comment_text": "Debbie Stevens Sears Heather Sturgill"}, {"username": "Sheree Burkett", "comment_text": "Thank you for sharing!!"}, {"username": "Judi Schuckman", "comment_text": "Great information! Thank you"}, {"username": "Vannia Renee", "comment_text": "Erik Rodriguez saving for later"}, {"username": "Mimi Mary", "comment_text": "Wagon Moree. Liza Toro"}, {"username": "Laurie Ladouceur Schmitt", "comment_text": "Going in October. This is very helpful."}, {"username": "Carol Sellen Ferrero", "comment_text": "Omg what great Info Thanks a bunch"}, {"username": "Deborah Larsen", "comment_text": "Regarding Conad grocery store for shopping agree a good venue for buying snacks but be aware it is not allowed to eat a ‘picnic’ on the steps of historical buildings and you may be fined for doing so."}, {"username": "Gay Bell DiBartolomeo", "comment_text": "Gayla Faye Bell"}, {"username": "Stangle Shepard", "comment_text": "Jay Duke Laura Lucchesi Tracy Hedrick O'Brien Lorrie Hedrick Ackerman Lezley Woodring Marcella Parkhurst. Good info to know. Add to all of our other tips lol"}, {"username": "Diana Spicer", "comment_text": "Such wonderful info! Thank you!"}, {"username": "Elena Innocenti", "comment_text": "Belive me, da Baffetto pizzeria in Roma is only for tourist. Save your time and go in some other pizzeria. My father lived in the same street and I know it well."}, {"username": "Millie Fisk", "comment_text": "Love this! Thanks for sharing!!!!!"}, {"username": "Craig Rickards", "comment_text": "Gerri Tronc"}, {"username": "Nhora Andrea Holmes", "comment_text": "I was just in Rome and Osteria Da Fortunata was all over Instagram as being a great authentic place and we did not agree. The food was pricier than other restaurants and not great. We had a much better carbonara at Roscioli."}, {"username": "Jesse Crawford", "comment_text": "Korri Sullivan"}, {"username": "Tracy Foss", "comment_text": "Thank-you so much I love posts with so much information!"}, {"username": "Ky Bean", "comment_text": "Brilliant post Thankyou"}, {"username": "Courtney Soloff England", "comment_text": "This is so helpful!!!!"}, {"username": "Carol Ciotti Lawlor", "comment_text": "Maria Delaney"}, {"username": "Susie Kanack", "comment_text": "Agree about the gelato!"}, {"username": "Mary Lou Balistreri Bradley", "comment_text": "We went to Osteria Santo Spirito and we liked it so much, we went twice. The risotto was next level."}, {"username": "Michele Urban Jokich", "comment_text": "Dan Barron hang onto this!!!!"}, {"username": "Melanie Popz", "comment_text": "In Rome we loved the restaurants in the Jewish Ghetto, highly recommend eating in that area."}, {"username": "Valerie Barbeau", "comment_text": "Thanks"}, {"username": "JeriLynne Clifford", "comment_text": "Thank you! I screen shot it and will add to my research list"}, {"username": "Brenda Harris Dixon", "comment_text": "Lauren Nicole Dixon good tips for restaurants"}, {"username": "Dana Talusani", "comment_text": "This is terrific info! Thank you!"}, {"username": "Kirsten Marciniec", "comment_text": "Meg Marie Mercedes Strezo Michelle Frawley"}, {"username": "Mimi Malamud Levitan", "comment_text": "great post!! thank you! will be going in October 😎😎"}, {"username": "Dina Veneziale Horn", "comment_text": "George Horn"}, {"username": "Jan Armstrong", "comment_text": "There is also a CONAD on the main road in Trastevere. Closes early on a Sunday which had us rushing around at 1pm but a great store. For those more central, it’s only a 20min walk from Pantheon."}, {"username": "Cindy Corbin Cangelose", "comment_text": "."}, {"username": "Frances Burke", "comment_text": "Thank you!"}, {"username": "Antonieta Murillo-Smith", "comment_text": "Grazie Mille!!! This information is amazing!"}]}, {"id": "2199668860432192", "text": "Coming from Lake Como, where would be the closest but best place to view the Swiss Alps? Thought, while we are there we may be able to fit that into our itinerary. Any advice or recommendations? We intend to go to Verona after that. Thanks.\nGOOGLE Picture for reference only 😉", "link": "facebook.com/groups/1373361046396315/permalink/2199668860432192/", "likes": 8, "comments": [{"username": "Glenn Todd Webb", "comment_text": "Switzerland is just 10 min from Como. Lugano is first major city. They have train service and a tour."}, {"username": "Leigh Griffiths-Cole", "comment_text": "Take the train to Tirano and then get the Bernina Express to St Moritz. You can do it as a day trip. It’s magical."}]}, {"id": "2199669953765416", "text": "Has anyone done any of the free walking tours on offer in Venice? I know you would need to tip the guide after, if so are they any good?", "link": "facebook.com/groups/1373361046396315/permalink/2199669953765416/", "likes": 0, "comments": []}, {"id": "2199677203764691", "text": "Can anyone give me their thoughts on must see or must do places in Sicily?", "link": "facebook.com/groups/1373361046396315/permalink/2199677203764691/", "likes": 4, "comments": [{"username": "Ken Lerch", "comment_text": "Agrigento"}, {"username": "Pietro Di Sorbo", "comment_text": "In short, Archeological sites of Temply Valley, Segesta Selinunte, Palermo (historical Norman architecture, Mondello beach and many other), Monreale, Trapani (nice town with a nice beaches), San Vito Lo Capo (beaches and amazing landscape) Erice (medieval village with stunning view), Castellammare del Golfo (loveable little town with nice beach), Scopello (beach), Zingaro Reserve (hiking in a natural park with stunning beaches), Marsala (beaches and amazing sunset at salt factory), Piazza Armerina (Villa del Casale), Syracuse (old town Ortigia), Ragusa (old town Ibla), Modica, Scicli, Noto, Scala dei Turchi (beautiful beach), Marzamemi (fishing village with loveable beach), Ventecane Reserve (hiking and nice beaches), Riviera Cyclops and their village (Acireale, Acitrezza, Acicastello), Catania, Etna Volcano, Taormina and Isolabella, Giardini Naxos (beaches), Cefalù (nice village and loveable beach).\nAround Sicily there are many little Islands with fantastic sea and crystal water, one of them, Favignana, is at only an half hour from Trapani.\nThese are only some suggestions, there are so much to see the you can stay there a month and any day you have something of different to do.\nBuy a good book guide and decide according your interests.\nRent a car, public transports there are not so good as mainland."}, {"username": "Leslie Alexandra", "comment_text": "We fell in love with Taormina!"}, {"username": "Lisa Abrams Argento", "comment_text": "I fell in love with the whole place, Erice, Palermo, Ortigia, just to name a few."}, {"username": "Miyuki Kanno Paul", "comment_text": "Palermo, Erice, Segesta, Trapani, Marsala, Selinunte, Agrigento, Siracusa, Noto, Villa Romana del Casale(near Piazza Armerina), Ragusa, Catania, Taormina, Monte Etna, are just a name of few. Plan at least 2 weeks"}, {"username": "Christina Papasso", "comment_text": "Just left a few days ago.. I fell in love with Cefalù and Taormina"}, {"username": "Lina Stump", "comment_text": "Monreale, Agrigento, Taormina, Etna, Palermo, San Vito lo Capo"}, {"username": "Isa Van Wyk", "comment_text": "Taormina"}, {"username": "Heikki Valtonen", "comment_text": "Go home this moment too hot.Sad but true😔"}, {"username": "Keri Catoe", "comment_text": "Sicily is absolutely breathtaking. The cost of everything is less than mainland (except in Taormina) and the food is so fresh and amazing. And the people in Sicily are friendly and it’s a slower pace than the places we have visited in mainland Italy. We spend 30 days traveling through Sicily and that still was not enough time. I can’t wait to go back!"}, {"username": "Ona Gardemeister", "comment_text": "And I'd add also the Eolian and Egadi islands, are super, too!"}, {"username": "Marisa Milanese", "comment_text": "If your traveling there this week, there are large fires may want to reconsider"}, {"username": "Frannie Kaplan", "comment_text": "I like to look up the food tours on YouTube and go there lol"}, {"username": "Camellia May Phillips", "comment_text": "Siracusa, especially Ortigia. Taormina worth a day trip to see Greek Theater and the view!"}, {"username": "Danielle Cannova", "comment_text": "Here now, the fires were really bad the past few days during extreme heat. Today it seems things have been a bit calmer and temperature is better . I’m Sicily there is so much to see really depends where you are planning to stay . I am in Alcamo/\ncastellamare del golfo\nAnd it is beautiful . Boat tours Tours to other islands are a must do. Scopello, San Vito lo capo, la zingaro, Favignana, levanzo. I am staying at La Blanca Resort and I am\nSo happy I did. Been here so many times this was the best decision ."}, {"username": "Diana Serrano", "comment_text": "Taormina"}, {"username": "Ian Selwyn-Yates", "comment_text": "Even at this time last year in Sicily it was 41 degrees and unbearable. Couldn't get off the bus as visits outside were unbelievably hot!"}, {"username": "Ken Ramsey", "comment_text": "I am planning on 10 days in Sicily starting on September 1st. I am wondering if I should reschedule because of the damage from the recent fires. Any thoughts would be appreciated."}]}, {"id": "2199681537097591", "text": "We are travelling to Venice and are after recommendations for three to four star hotels surrounding the canals ? Is there a difference between the city of Venice and the bridges and St Mark's Square. Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2199681537097591/", "likes": 0, "comments": []}, {"id": "2199682207097524", "text": "Best route by train from Venice to Paris - want to see as much of countryside as we can but be comfortable for a all day experience?", "link": "facebook.com/groups/1373361046396315/permalink/2199682207097524/", "likes": 0, "comments": []}, {"id": "2199692400429838", "text": "Planning Italy trip with my husband December 2024 . Recommendation for hotels Rome, Florence and Venice and for places eat thank you !", "link": "facebook.com/groups/1373361046396315/permalink/2199692400429838/", "likes": 0, "comments": []}, {"id": "2199695343762877", "text": "We’ve just come back from a trip to Verona and Lake Garda. We’ve done Rome, Milan, Amalfi Coast, Venice, Capri, and I have to say Verona was high up there with my favourites. If you can visit, I’d definitely put it on your list. Beautiful, less crowded and less touristy, with some fantastic sites.", "link": "facebook.com/groups/1373361046396315/permalink/2199695343762877/", "likes": 165, "comments": [{"username": "Carrie Demay", "comment_text": "We love Verona as well. We flew in and out of Verona and spent a few days before coming home. The food, people and scenery exceeded my expectations. It is so walkable. We traveled all over Italy and Verona was a highlight."}, {"username": "Dave Conroy", "comment_text": "I enjoyed Verona TBH tho it was on a whim via a super cheap flight. No preparation. Was cool."}, {"username": "Colleen Carollo Oxsalida", "comment_text": "Totally agree — Verona was wonderful!"}, {"username": "Shula Hurvitz", "comment_text": "✈️🇮🇹🇮🇱🥇🔥"}, {"username": "Molly Roberts Siegenthaler", "comment_text": "We will be in Verona in a little under four weeks. And must do restaurants? Favorite site? Favorite surprise?"}, {"username": "Jayne Geaney", "comment_text": "Verona has been on my bucket list for years, going in September, so excited to see all the comments on here saying how lovely it is.😊"}, {"username": "Eileen Lonergan", "comment_text": "Love Verona too"}, {"username": "Janie Patri Thomason", "comment_text": "Verona is one of my favorite places!!"}, {"username": "Yvonne Donnellan", "comment_text": "Verona is my favourite and I've visited all the places you mention."}, {"username": "Caterina Liquori-Culhane", "comment_text": "Maybe I forgot but I thought Verona was just ok. I would skip it .Too many other things to see. Just my opinion."}, {"username": "Lee Pellicciotta", "comment_text": "Verona is a must!! So beautiful!!"}, {"username": "Tommo Thomson", "comment_text": "We found Capri a nightmare tbh 30000 plus people, the path to town centre needs to be simplified Because it like walking up a mountain side."}, {"username": "Julia Muller", "comment_text": "We did Verona maybe 8/9 years ago and absolutely loved it too - I can remember it so clearly! 💕"}, {"username": "Regina Silva", "comment_text": "Acabamos de voltar também da Itália, fizemos Napoli, Pompeia, Sorrento, Capri, Costa Amalfitana, Otranto, Matera, Polignano a Maré, Roma, Florença e Pisa. Mas dessas cidades que vc postou só não conheço o Lago Garda, conheço o Lago Como. Que cidades mais lindas tem a Itália."}, {"username": "Malka Marna Erlich", "comment_text": "Hi. We are planning a trip to Verona. Would you please share your itinerary?"}, {"username": "Magdalena Wostal", "comment_text": "We love Verona 🎈🎈🎈"}, {"username": "Brooke Barron", "comment_text": "I’m on my way home from 3 weeks in Verona. I absolutely love it ❤️"}, {"username": "Nichola Harkin-Chipps", "comment_text": "How are the prices for shopping such as clothing and purses?"}, {"username": "Melissa Ciske", "comment_text": "To me - it’s the best! I love the atmosphere, not too big but not too small. You can wander, shop, eat, listen to music and it’s a short train ride from other places to day trip to!"}, {"username": "Paola Girelli Harding", "comment_text": "Thank you for the beautiful photos and compliments of my hometown of Verona! 🤩🌎🇺🇸🇮🇹"}, {"username": "Kelly Hanberg Rosati", "comment_text": "Robin Seiwerath"}, {"username": "Suleiman Bajes Haddadin", "comment_text": "We love verona to level that we bought small apartment there.one of the most beautiful cities in Italy ."}, {"username": "Patrick Aleta Wieneke", "comment_text": "Verona is a lovely, beautiful city. We have been there three times and used it as a base. Very walkable, lots to see and some good restaurants."}, {"username": "Sharon Bowes", "comment_text": "Loved Verona - a beautiful city ❤️"}, {"username": "Cindy Sguazzin", "comment_text": "I once attended a performance of the Opera “Aida” in the ancient ruins of the Arena in Verona—so dramatic, so beautiful, so unforgettable!\nI don’t know whether or not this still happens, but it would be so worthwhile to find out and plan your trip around that!"}, {"username": "Caroline Allen", "comment_text": "Michelle Allen"}, {"username": "Jackie Ames", "comment_text": "I was in Verona for a month last year!.. I love it 😊. Lake Garda is beautiful"}, {"username": "Barbara Russo-Sprouls", "comment_text": "I loved Verona too. Great Roman antiquities."}, {"username": "YaNah DeVeyrah", "comment_text": "Ange Paste"}, {"username": "Nicole Tucker", "comment_text": "Agreed! Verona was one of my favorites also! Day trip to Garda was a highlight."}, {"username": "Pom-Eric Doland", "comment_text": "Curious about your experience at Lake Garda. Can you share? We are planning to visit in November. Thank you!"}, {"username": "Paul Davis", "comment_text": "In the morning before the crowds."}, {"username": "Angela Neal Hinson", "comment_text": "Beautiful!"}, {"username": "Poonam Shah", "comment_text": "Hey Can you suggest safest places or areas to stay in milan ? I am visiting milan for 2 days."}, {"username": "Lisa Close", "comment_text": "Verona is one of the most beautiful cities I’ve ever visited 😍 super underrated!"}, {"username": "Anita Clayton", "comment_text": "Lovely city."}, {"username": "Sue Gorman-Ellens", "comment_text": "Love Verona !"}]}, {"id": "2199698250429253", "text": "Talk to me about Lucca with a car. I know it’s a car-free town center, so where did you park your car if you were doing a day trip to Lucca?", "link": "facebook.com/groups/1373361046396315/permalink/2199698250429253/", "likes": 2, "comments": [{"username": "Sandra Kent", "comment_text": "Out side wall there are meter parking enjoy beautiful place"}, {"username": "John Jessup", "comment_text": "$8 Euros a day as I recall.. easy walk into the city"}, {"username": "Lisa Abrams Argento", "comment_text": "We took the train from Florence. It was a wonderful city to walk. Enjoy."}, {"username": "Jonathan Goetzel", "comment_text": "Easy park and walk."}, {"username": "Jill Timms Goldie", "comment_text": "Lots of parking around the city and then a short walk to everything."}, {"username": "Theodore Meyer", "comment_text": "There are many parking lots outside the walls. We parked in a free lot but it was 2018 and I can't remember the name of the lot."}, {"username": "Linda Miller", "comment_text": "Over by the train station there's a large parking lot."}, {"username": "Jayne Dawson Meyer", "comment_text": "Outside of Luca. Close walk"}, {"username": "Benedetta Vanni", "comment_text": "The car free town center is within the city walls. Anywhere outside is usually metered parking (blue stripes on the ground), 1 to 2 €/h as a fare. I highly recommend to walk on the walls all around: approximately 4 km."}]}, {"id": "2199376167128128", "text": "Has anyone had experience, and can recomend a small house/condo/apartment in Sorrento to use as a base for a month?", "link": "facebook.com/groups/1373361046396315/permalink/2199376167128128/", "likes": 3, "comments": [{"username": "Beverley Ford", "comment_text": "My sister and I stayed in an apartment at a Lemon Farm in Sorrento last year. It was fabulous. Run by Maria and the hosts couldn’t do enough for you. I have her contact details should you be interested."}]}, {"id": "2199343457131399", "text": "Would really like to stay at an Tuscan agriturismo fall of 2024 and do a guided vineyard tour. Is this possible without a car? recommended locations, specific agriturismos, and tours welcomes. Overwhelmed thinking about transportation from a train to the agriturismo and then from the agriturismo to specific vineyards. 🤯", "link": "facebook.com/groups/1373361046396315/permalink/2199343457131399/", "likes": 8, "comments": [{"username": "JeriLynne Clifford", "comment_text": "I would suggest finding a place to stay (you can search this site, I have seen others recommended) and use a service. We do this and don’t rent a car. They arrange the tastings, lunch and no drinking and driving. They are a dream to work with.\n\nhttps://\nwww.montalcinowi\nnetours.com/"}, {"username": "Claudia Amp", "comment_text": "I have a few places to recommend:\n\nLe Gusciane Country Inn (they make their own gin using juniper and other Tuscan herbs grown on their grounds) in Camaiore\n\nLocanda al Colle (Camaiore)\n\nVilla Dianella (Vinci)\n\nAgriturismo are normally on the outskirts/\ncountryside so you 99% need a car, unless the establishment has transfer services in place. Need to sort that out when you book your stay directly with them."}, {"username": "Renae Larcus", "comment_text": "La Lucciolaia Agriturismo - San Gimignano. Lovely!"}, {"username": "Lora Ruscitti Covington", "comment_text": "We stayed here and it’s fabulous. But I do think you’d need a car. We took day trips each day.\n\nhttps://\nwww.countryslowl\niving.com/\nbranches/\nfontanaro/"}, {"username": "Kim LaFontaine", "comment_text": "We loved Agriturismo Mormoraia. They have a winery and make their own olive oil. The rooms are great and the restaurant on site ￼is glorious. 💗"}, {"username": "Alice Francesca", "comment_text": "If you want to see the Tuscan countryside, which I strongly advice to do, better you rent a car.\nDrive south of Siena to Pienza and see the surroundings.In\ncredible landscapes."}, {"username": "Brian McGraw", "comment_text": "For Tuscan winery exploration, I think you need a car.\nOtherwise you’re going to spend your whole trip waiting around for transfers.\nOr you’re going to be totally stuck."}, {"username": "Erin Vizza", "comment_text": "Agritourismo La Terra!"}, {"username": "Nancy Jane Oster Burleigh", "comment_text": "We will be in a Villa out in Tuscany for 5 days in October. No car. We have hired a drive company. They will be taking us out there from Florence, and on a fabulous wine tour and Truffle hunt, then to Rome.\nCapital Chauffeur Service CCS"}]}, {"id": "2199229573809454", "text": "Where can I find good food trucks/street food vendors in Florence, Venice, and Rome? ￼", "link": "facebook.com/groups/1373361046396315/permalink/2199229573809454/", "likes": 1, "comments": [{"username": "Claudia Amp", "comment_text": "Street food in Venice is “cicchetti” and you just have to go to any “bacari”for that: “Cantina do Spade”, “Alla Vedova”, “Cantina do Mori”. In Florence “I Fratellini”, “L Trippaio di San Frediano”, “L Trippaio di Sant’Ambrogio” and “Gozzi” for the best fried meatballs; in Rome “Trapizzino”, “Bonci”, “Supplizio”."}, {"username": "Miyuki Kanno Paul", "comment_text": "In Firenze, Da Nerbone inside Mercato Centrale for Lampredotto"}]}, {"id": "2199366053795806", "text": "Has anyone ever traveled with their service pets? Is it allowed And what was the experience like", "link": "facebook.com/groups/1373361046396315/permalink/2199366053795806/", "likes": 0, "comments": [{"username": "Erica Senes Tombesi", "comment_text": "It'allowed almost everywhere, bus and train for sure."}]}, {"id": "2199367363795675", "text": "Gianna Taylor #travel", "link": "facebook.com/groups/1373361046396315/permalink/2199367363795675/", "likes": 22, "comments": [{"username": "ويني ديلاكروز راموس", "comment_text": "How to get in this place from pisa bus station?"}]}, {"id": "2199373697128375", "text": "Wondering if anybody has any good beach recommandations in Naples (good waters and family friendly)!", "link": "facebook.com/groups/1373361046396315/permalink/2199373697128375/", "likes": 1, "comments": [{"username": "Marina Maddaloni", "comment_text": "Hi , I lived in Naples and I can say we don’t have family friendly beaches with good water .\nWe do but are very small and not ideal for family . Others big beach don’t have good water . Unless you don’t move to capri, ischia , Sorrento but even there the beaches are small and overcrowded and not very easy access .\nGood for adult but not for babies"}]}, {"id": "2199373917128353", "text": "Anyone have experience with the Ferrari tours in Modena and Maranello? Adding in a trip to Lamborghini museum too? Suggestions on transportation between all 3. Starting point is Modena. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2199373917128353/", "likes": 1, "comments": [{"username": "Marie Lamberth", "comment_text": "F"}, {"username": "David Silverstone", "comment_text": "We went to both Ferrari museums. it was a great experience and definitely worthwhile going to both. The one in Modena is a short walk from the city centre and is a bit like an art gallery but with actual cars suspended a little above the floor. Impressive! We walked there from our hotel. The next day we drove our rental car to Marinello. That museum is packed with beautiful road cars, race cars and engines from their early years to future concepts. You can also visit their racetrack! There's not much else in Marinello as the whole town seems to exist for manufacturing of Ferrari!"}, {"username": "Jose Velez", "comment_text": "The Enzo museum in Modena is here he was born and the exhibition changes. In maranello you have the Ferrari museum with all the racing cars and history. You have a factory tour in a bus.\nAt Lamborghini you have the museum and a walking to the production line. It requires a reservation for the tour"}]}, {"id": "2199374380461640", "text": "I’m traveling to Rome —> Florence —> Zurich —> Lucerne solo and have a few privacy concerns that I’m conflicted about\n\nWould you recommend a backpack or rolling carry on? I ordered a calpak and love it, but it has a ton of zippers… got two TSA approved locks but would feel more comfortable with the one zipper / lock on my suitcase. I’m just worriedआणखी about the roads etc for the wheels.\n\nAlso, would you bring your passport with you and carry it in safely? A few of my hotels have safes, but one or two of my airbnbs don’t.\n\nI assume I could leave a bag for a “back up plan” right?\n\nThank you!!", "link": "facebook.com/groups/1373361046396315/permalink/2199374380461640/", "likes": 4, "comments": [{"username": "Rosslyn Patience", "comment_text": "You can wear a money belt under your clothes when you go about at the airb&bs if you are worried. I have the same dilemma."}, {"username": "Bronwyn O", "comment_text": "I prefer a backpack because I prefer to carry the weight with my core, not the end of my arms. It turns out I never had to leave it on a luggage rack, but I have a suitcase cover that fits around it (and could fasten straps around the rack) to make it difficult for anyone to unzip or grab and run.\n\nAlways carry your passport. There are many theft proof purse or bag options - wire mesh inside to prevent slashing, zippers lock, and look for one where the strap also locks/\nunfastens so when you’re sitting you can fasten it to the chair, table leg, or whatever is convenient. When nothing else was available I just put the strap around one leg while I sat. I kept my passport, money, insurance cards, tickets, phone, and camera in mine (plus a few non-expensive but handy extras like hand sanitizer and water bottle), and didn’t have to worry about keeping an eye on the bag constantly."}, {"username": "Gayle Moores", "comment_text": "Keep your passport on you. Wear a money belt at all times in public. Keep your money in it.Keep it inside your clothes just below your waist where it cannot be seen. I keep my passport in my money belt for safety.I put it in a plastic bag to keep it dry and clean.You will need to show it to the hotel reception desks where you are staying. Sometimes the police may ask to see your passport on the trains to identify yourself."}, {"username": "Jenny Payne", "comment_text": "I travel a lot to Italy , my packback has a lot of zips and I like that as I also wear a crossbody bag , so I can keep all my important documents in🌻"}, {"username": "Romina Lauretig Toscano", "comment_text": "Leave your passaport at the airbnb. Nobody will rob it."}, {"username": "Beth Casey Murphy", "comment_text": "Money Belt is a good idea"}, {"username": "Sam Mah", "comment_text": "Switzerland rail provides some of the best train station services for people travelling with suitcases but the biggest problem with having a suitcase on wheels (that is heavy) is lugging it up staircases which you'll find lots of at old train stations and old buildings that don't have lifts."}, {"username": "Lisa Kelly", "comment_text": "I am in Lucerne right now after doing almost your exact itinerary. We have sturdy rolling bags (carry ons), back packs and I have a belt bag (worn crossbody). I have two locks, one on the main compartment of my suitcase and one on the main compartment of my backpack. I keep money in the belt bag and the passports in my backpack, locked compartment. A couple times I have put the passports in my belt bag. We have 7 train days. I also have leave them in the locked pack in our airbandbs. I do not take that backpack out with me during the day - I brought a smaller daypack and there’s nothing valuable in it. I brought money belts for all of us and haven’t used them once. You’ll figure out what your comfortable with. Have fun!"}, {"username": "Diana Smith", "comment_text": "Take your passport with you . You will be fine…:))) Have 🤩"}, {"username": "Rhona OConnor", "comment_text": "You will be fine..... Just don't make it easy for thieves..... Like some do. Places like Lucerne are very safe and friendly. ..... But expensive!! €33 for a pizza"}, {"username": "Rhona OConnor", "comment_text": "Rhona OConnor"}, {"username": "Sally Warren", "comment_text": "Passport must be on your person.\nI prefer a small wheelie case these days. Light enough to carry if cobblestones become a problem."}]}, {"id": "2199374383794973", "text": "We will be flying into Rome Sept 11 at 8:45 AM. Our friends are not flying in until 3 PM. We will be meeting them back at the airport and going to Naples for a couple days at the start our vacation. ￼\nAny suggestions what we can do while we are waiting about six hours for them? Anything close to the airport? We will have carry-on luggage. I don’t know if it is safe to leave it at the airport or we will be taking it with us for the day.\nWe’ll probably need lunch and a nap😄\nThank you", "link": "facebook.com/groups/1373361046396315/permalink/2199374383794973/", "likes": 4, "comments": [{"username": "Austin Briscoe", "comment_text": "Go to Ostia Antica and check out the ruins or have lunch at the beach in Fiumicino."}, {"username": "Andrea Bainbridge", "comment_text": "We had to stay close to the airport and found a nice area right along Via della Torre Clementina on a canal. Lots of restaurants and bars. Decent walking area. Can’t advise about your bags."}, {"username": "Robin Burrell", "comment_text": "The Hilton at the airport offers day rooms if you would like to nap and shower."}, {"username": "Janette YesPlease", "comment_text": "There is a spa very close to the Leonardo da Vincci airport, which might be an excellent way to unwind and start your vacation.\n\nhttps://g.co/\nkgs/2oK8u8 QC Termeroma\n+39 02 8974 7209"}, {"username": "Maureen Rebello Hagerty", "comment_text": "Airport lockers. Train or taxi into the city. You probably won’t get in to see any of the sites like the Colosseum or Pantheon without tickets but you can walk around and see lots!"}, {"username": "Cynthia Tarantino", "comment_text": "Can you get a locker for your bags at the airport?"}, {"username": "Jenn Messina Babore", "comment_text": "Can you just meet them in Naples? Honestly seems a bit of a waste of your day to hang around the airport (assuming your flights and theirs get in on time and then allocate additional time for Customs). Otherwise might be easier to eat and shop in the airport. A taxi to Rome is at least a half hour, so you could go and have lunch and come back."}, {"username": "Matt-Kathy Stavely", "comment_text": "Thanks for all the input!"}, {"username": "Andrea Marie", "comment_text": "I don’t necessarily recommend doing an activity out in the sun right after getting off a long flight because you very well may be dehydrated. Your best bet is to read some restaurant reviews and find a spot in Ostia Antica. If you’re up to it, you can visit the ruins, but don’t plan on pushing yourselves too hard on day one. Also, there are luggage lockers at FCO airport that you should be able to utilize."}, {"username": "Steve Grossman", "comment_text": "Sleep"}, {"username": "Peach Panfili", "comment_text": "The little town of Fiumicino is just a brief cab ride away - there is a specific cab rank opposite the airport and it’s simple and cheap to check your bags at the airport left luggage office. It’s a charming fishing village where the Tiber meets the sea and it’s a nice place to wander around and there are many quaint restaurants where you could have a nice leisurely lunch. You can also ask the cab driver that took you there to return at a certain time."}, {"username": "Greg Saba", "comment_text": "At Rome Airport there is luggage storage located in the International Arrivals of Terminal 3. I agree with suggestion to go into Fiumicino. The riverfront area has many little restaurants, and it won't be crowded. You might not have a lot of time to do much else."}, {"username": "Brittany Peterre", "comment_text": "QC Termeroma Go to this day spa… get a massage and enjoy their Roman baths, they have an airport shuttle and is 10 minutes away from the FCO."}, {"username": "Doug Burke", "comment_text": "Meet them at Naples. Is riding a train together really THAT important?"}]}, {"id": "2199374683794943", "text": "🤞that these low highs in the forecast are a reality from Thursday on. If they hold, we will actually be escaping the Midwest heat by going to Italy. 😅", "link": "facebook.com/groups/1373361046396315/permalink/2199374683794943/", "likes": 1, "comments": []}, {"id": "2199375197128225", "text": "Very excited to be visiting Italy in December. Staying 3 nights in Milan with husband and daughter.\nCity centre is where we were looking, however all the large hotels seem to be out of the city.\n\nSuggestions on staying just outside the city or city centre??", "link": "facebook.com/groups/1373361046396315/permalink/2199375197128225/", "likes": 1, "comments": [{"username": "Claudia Amp", "comment_text": "City centre, nothing to really see outside the city (a part from certain museums)"}, {"username": "Lisa Lu", "comment_text": "Grand Visconti Palace Hotel was great for my spouse, daughter and me. It’s close to the train and a quick ride into all the sights and fun areas."}, {"username": "Stefano Follador", "comment_text": "The city is pretty well connected so I don’t think is an issue to stay a little bit out of the center."}, {"username": "Alice Francesca", "comment_text": "Stay in the center!I am Italian.There are great hotels there"}, {"username": "Laura Cardinale", "comment_text": "If you can afford it, stay in the center."}, {"username": "Virgz Van Møøre", "comment_text": "Hotel Gran Duca di York is fine.\nVisit ideas :\nDuomo, navigli, Cenacolo, botanical garden, galleria VE II, castello Sforzesco, art nouveau, street art porta Ticinese, basilica San Lorenzo, rooftop bar at Rinascente with view on the Duomo, make sure to book well in advance for the Cenacolo."}, {"username": "Elena Innocenti", "comment_text": "Armani Hotel in Via Manzoni."}, {"username": "Bonnie Loftspring", "comment_text": "On recent trip, totally enjoyed staying city center, you will be immersed in all the holiday decor, shopping & outside events. All walking, all easily accessible. Location was optimal. Yes, more pricey, no need for car, parking, never needed a taxi,"}, {"username": "Renae Larcus", "comment_text": "Hotel Berna near the train station. A 25 min walk to the Duomo"}, {"username": "Claudia Castellini", "comment_text": "City center, definitely!"}, {"username": "Nancy Koehler Barboni", "comment_text": "Stay in the city center. December is cold and foggy in Milano. Take day trips to Switzerland!"}, {"username": "Glenn Todd Webb", "comment_text": "Rosa grand behind duomo"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}]