[{"id": "2194378370961241", "text": "Beauty of a day at Faraglioni. Amazed how big some of these yachts are.", "link": "facebook.com/groups/1373361046396315/permalink/2194378370961241/", "likes": 4, "comments": []}, {"id": "2194380620961016", "text": "Planning our dream trip to Italy next summer. I realize it’s extremely hot and crowded, but I am a teacher, so the only time I can go would be during summer break. I am trying to narrow down between the last half of June or first half of August and would love to hear from people who’ve been during those times. We’ve ruled out July. Grazie!", "link": "facebook.com/groups/1373361046396315/permalink/2194380620961016/", "likes": 24, "comments": [{"username": "Patrick Evans", "comment_text": "We just went in the middle of June and most of the trip was in the 80s, until the last few days when it climbed through the 90s to hit 101 on our last full day."}, {"username": "Rebecca Branta", "comment_text": "June! My husband is a teacher and we just got back. Rome got hot early July but everywhere else was manageable!"}, {"username": "Ana L Baratta", "comment_text": "First week of June ! Don’t go in July or august . We used to take our kids as soon as school was over . We now go in October . Good luck . 🍝🍝"}, {"username": "Katie Martinez", "comment_text": "I’m a teacher too! Go in June! I’m here now and today in Rome it’s 100 it’s really really 🥵 . It will give you a chance to enjoy the rest of summer vacation once you get back. You’ll probably be so relaxed. I know I feel so much more relaxed now than before and I still have a few weeks to go before school starts once I get back. 😊 Good luck planning. It’s amazing here!"}, {"username": "Stephanie Earl Peterson", "comment_text": "I'm also a teacher and my husband is an administrator so we are in the same position as you. We went the last two weeks of June. Temperatures were in the 90s and it was crowded and hot. But we made everything work and did our best to stay hydrated and to take breaks to cool off.￼"}, {"username": "Jim-Holly Ballew", "comment_text": "June!"}, {"username": "Kristi Entwistle", "comment_text": "We were there last week of June & first week of July— plan early excursions then you come back and relax for a few hours in the heat of the day.\nIt’s fine & don’t let anyone scare you!! Have the best time❤️"}, {"username": "Paige Montecalvo", "comment_text": "We just were just there June 29 through July 6, and it was hot but not as hot as I see people posting about right now. I’m from Florida, so hot and humid doesn’t phase me anyway. I do think we got lucky because we went on our Colosseum tour on June 30 at 4PM and it had rained earlier in the day. The crowds had thinned a bit and it was 78 and sunny! We couldn’t believe it!\n\nI personally would choose June because much of Europe takes holiday in August (and it’s hotter) Our friends who live there were trying to refinance their home last august and literally got an email from the bank (not their loan officer but the actual bank) that they were closing down for three weeks for summer holiday 😂 Gah, I wish the US would pick up this summer holiday lifestyle… but I digress.\n\nAnyways, I personally think June is a better bet."}, {"username": "Lora Ruscitti Covington", "comment_text": "We went mid June and it was hot but not unbearable. Perfect time. In the mountains and Tuscany the weather was perfect and even needed a sweater."}, {"username": "Beverly Colman Schmidt", "comment_text": "June"}, {"username": "Paula Gallagher", "comment_text": "Just got back from doing last half of June first week of July . It was not as hot as it is now and the crowds were just starting to get very bad . My son went in August prior year and said that was the only thing he didn’t like the heat was tough to deal with. So do June ."}, {"username": "Francesca Russo", "comment_text": "July is the hottest month here in Italy, so your decision to avoid that month is wise.\n\nJune and August have almost the same temperatures, but the last half of June is when the sun sets later."}, {"username": "Fran Monopoli", "comment_text": "Easter break ? April! So much better"}, {"username": "Michael Simon", "comment_text": "As early in June as possible. August is awful, not only hot but humid."}, {"username": "Jessica Amber Coors", "comment_text": "June!!! We just went June 29-July 13th and it was insanely hot. Definitely had to take breaks in the day. I would recommend as early in June as you can!!"}, {"username": "Susan Donlan", "comment_text": "Lee we Ave the day you get out of school. Crowds and heat are still reasonable then"}, {"username": "Ildiko Gyimesi Mikos", "comment_text": "Last half of June… 100%!!"}, {"username": "Dennis Jones", "comment_text": "We just returned…judgin\ng from what we experienced in July,\nI would say go the last half of June!\nWhen we arrived in Venice July 2, the weather was in the 80’s…by the time we made it to Rome on July 7 it was 🔥🔥🔥!"}, {"username": "Iris Joan Price", "comment_text": "June and maybe head to Northern Italy. It is already hot in late June, and getting hotter every year. I remember the heat being intense that time of year in Florence back in 2008."}, {"username": "Jody Ŧ Madding", "comment_text": "June, no brainer."}, {"username": "Marybeth Gerrish", "comment_text": "Just came back from abruzzo with a tour called Italia Sweet Italia. Absolutely wonderful. Fabrizio, the tour leader and owner of the tour company shows his love for his family, town, and region in this tour. Highly,highly recommend"}, {"username": "Hollis H McGuire", "comment_text": "If you can pick June - less hot and marginally less crowded."}, {"username": "John Layman", "comment_text": "Early as you can"}, {"username": "Shanna LaDelfa", "comment_text": "June, a lot of Italy shuts down in August as Italians take holiday close to the coast. June would be a better experience and not as hot."}, {"username": "Madeline Caporale", "comment_text": "I would try the last half of June. If last year is any predictor the extreme July temps will continue through August. A group I am traveling with found that even early September was still uncomfortably warm."}, {"username": "Pat Cirillo", "comment_text": "This is easy. June."}, {"username": "Joanne Hubbard", "comment_text": "We are here now and it is so hot and unbearable . Everyone looks exhausted ."}, {"username": "Vicki Susie Naab Gandolf", "comment_text": "We were there this year June 23 thru 30. It was hot but not unbearable. Kept water with us, and, of course, there’s always gelato!"}, {"username": "Heidi Hutson", "comment_text": "Early June will be less crowded and not as hot:)"}, {"username": "Jean Grimes", "comment_text": "Last half of June"}, {"username": "Michelle Dougherty", "comment_text": "June June June!!\nLord, it's still hot, but not Dante's inferno hot lol.\nPlus side, many of us locals still have kids in school, so we aren't out and about yet in addition."}, {"username": "Angela Genduso", "comment_text": "June all of Europe gets August off for vacation ."}, {"username": "Steve Grossman", "comment_text": "Bologna for sure. It's on the way to monza and has. What is commonly called the best food in Italy?"}, {"username": "Allan Olexa", "comment_text": "Christmas break? We visit annually at Christmas…wonde\nrfully mild and not as crowded. (I am a retired teacher)"}, {"username": "Cat Furness", "comment_text": "June !!"}, {"username": "Susan Loo", "comment_text": "Last part of June for sure!!!!"}, {"username": "Elena Innocenti", "comment_text": "June it’s better"}, {"username": "Renae Larcus", "comment_text": "June. Not quite as hot. August is awful"}, {"username": "Stacey Esposito", "comment_text": "June"}, {"username": "Trish Ellis", "comment_text": "June! We were there this June 13 for 12 days. Weather was nice!"}, {"username": "Patricia Quirk", "comment_text": "Go June weather is perfect. I’ve done June snd it was gorgeous. I am in Italy now and it is hot but still lovely just a little more planning for your days ie start early, rest after lunch and then start again."}, {"username": "Kimberly Hawes", "comment_text": "June. 😎 I’m here now and I’ve been here in June and it’s much better. Today it was 102 in Siena and hotter in Rome. Depending on your itinerary, of course. I’m also in education so I hear ya 👍"}, {"username": "Dana Golden", "comment_text": "Go as early as you can. It’s dangerously hot right now. I can only imagine next year won’t be much cooler. Have fun planning your vacay! It’s glorious here!"}, {"username": "Michelle Lenhart-Freebairn", "comment_text": "June!!!!!!"}, {"username": "Gwen Cooke", "comment_text": "June"}, {"username": "Sandy Brightbill", "comment_text": "We just hit back from Italy 6/9-6/24..\nPerfect weather except last 2 days in Rome extremely hot.. 112 degrees.. and it was the first of the heat for them..I would start there as not really anywhere to cool off.."}, {"username": "Carmela Siniscalchi Frattellone", "comment_text": "Def June. I went the last 2 weeks of June and it wasn’t too bad."}]}, {"id": "2194380790960999", "text": "Ok silly me! Thought I saved a previous post but can not find it.😖\nI will be changing trains in Naples for sorrento.\nSomeone in this group posted that they hired a private driver to pick them up at station and take them to their accommodation in sorrento.\nHope you are reading this and can repost the name of company for me. Believe it is a small family run company", "link": "facebook.com/groups/1373361046396315/permalink/2194380790960999/", "likes": 1, "comments": [{"username": "Kay Rendall", "comment_text": "Plenty taxis outside Sorrento station. Just have address written down to hand to driver as accent can be a problem and u can find yourself at wrong hotel. Check Google maps it may be walking distance. Or RomeRio website, they give u options, times, prices."}, {"username": "Sandy Radican Shikaly", "comment_text": "Amalfi Coast Transfers owned by Mena Forino"}, {"username": "Carmela Siniscalchi Frattellone", "comment_text": "I paid 100 euro for pickup at Naples train station and drop off at hotel in Sorrento. My hotel arranged it so I don’t know the name but wanted to give you the price. I was there 2 weeks ago"}, {"username": "Mary Anne", "comment_text": "We used Guemar travel. Small company. Fabulous service. Luxurious cars."}, {"username": "Giuseppe Placi", "comment_text": "Transferelax"}, {"username": "Cheryl Kavanagh", "comment_text": "Hi yes it was me, I booked it through get your guide, but I am getting a mini bus transfer from Naples station to Sorrento right to my hotel 🙂"}, {"username": "Gina Spyker Fairfield", "comment_text": "We used Autoservizi De Martino for transfers between Naples and Sorrento and for a day along the Amalfi Coast."}]}, {"id": "2194386667627078", "text": "If anyone was stranded in Malpensa Milan airport over the weekend on flight 175 with delta, please reach out we are trying to message some of y’all!", "link": "facebook.com/groups/1373361046396315/permalink/2194386667627078/", "likes": 1, "comments": []}, {"id": "2194395660959512", "text": "Are they going to televise the Women’s World Cup in Italy?", "link": "facebook.com/groups/1373361046396315/permalink/2194395660959512/", "likes": 0, "comments": [{"username": "Giovanni Pianigiani", "comment_text": "apparently so. The state-owned broadcaster RAI has purchased 15 matches, including all Italy ones, plus the opening match, the two semis and the final. You should be able to see them on RaiPlay app or on any TV set for free"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2194400394292372", "text": "Need help deciding on tours out of Sorrento .. one to the Amalfi Coast including Poisitano Amalfi and possibly Ravello … I am traveling Solo at the end of October and would need a small group tour .. the second to Capri for the day .. I will not go swimming so only boat around island and visit Capri and Anacapri .. any recommendations!! Iआणखी appreciate it !! First time Solo traveling and making all my own arrangements!! .. it’s a little more complicated when you need a small group .. I’m young at heart and fairly fit but 69 years old … so I need a little support and convinience … I must admit .. I’m a little spoiled and like nice things .!! Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2194400394292372/", "likes": 14, "comments": [{"username": "Laura Jetton", "comment_text": "I went on Perillo tours and left all the planning to them.\nIt was first class all the way, and made life long friends in the group.\nEnjoy!"}, {"username": "Rhona OConnor", "comment_text": "You could look at the GetYourGuide app to see what is available."}, {"username": "Glenn Todd Webb", "comment_text": "Skip Positano. Spend more time in Amalfi and the most in Ravello."}, {"username": "LeAnn Bonkiewicz", "comment_text": "Love Positano!"}, {"username": "Kath Milburn", "comment_text": "Go to the small tour company which is in an office next to the train station. I was travelling solo and went on a trip to Positano, Amalfi and Ravello. Had a lovely lunch in Amalfi overlooking the sea, which was very reasonable and delicious, through the tour company. Only 7 of us in an air conditioned Mercedes mini bus. Collection from my hotel. Absolutely brilliant trip. I always use this company when in Sorrento but I can't remember the name."}, {"username": "Karen Smart", "comment_text": "We did these “shared tours” recommended by Rick Steves. It is for small groups. Had a great time. We did the Capri Boat Tour and also the Amalfi Coast Drive. https://\nwww.sharedtours.\ncom/"}, {"username": "Helen Fletcher", "comment_text": "We used the local buses they are so cheap you can get them from the bus/train station in Sorrento we got it to Positano. They are really good fun obviously you could pay for a taxi or boat but am sure they will be a lot more expensive"}, {"username": "Sigrid Cormier", "comment_text": "This sounds like what your looking for.\nhttps://\nwww.tripadvisor.\nca/\nAttractionProduc\ntReview-g187782\n-d11463787-Shar\ned_Amalfi_Coast\n_Small_Group_to\nur_by_Minivan_f\nrom_Sorrento-So\nrrento_Province\n_of.html"}, {"username": "Janice Rea", "comment_text": "I used Mondo Tours. Smaller tours. Both for Amalfi coast tour and Capri boat tour with optional blue grotto. Good luck and enjoy!!"}, {"username": "Heather Stephenson", "comment_text": "We are here now and have enjoyed outings with https://\nwww.tempiotravel\nsorrento.com/"}, {"username": "Mary Jo Gronli", "comment_text": "Where are you traveling from?"}, {"username": "Elissa OConnell", "comment_text": "I would go to Amalfi coast and go to Positano, Amalfi and Ravello"}, {"username": "Lisa Valdovinos", "comment_text": "Check out Avanti"}]}, {"id": "2194405034291908", "text": "Any reason for not staying on Capri itself and then touring around the coast? TY", "link": "facebook.com/groups/1373361046396315/permalink/2194405034291908/", "likes": 1, "comments": [{"username": "Pong Ac Ai", "comment_text": "Capri so beautiful make sure you got the private. Boat tour and chair lift going to monte solaro"}, {"username": "Anthony Sperduti", "comment_text": "Yes\nLots of them"}, {"username": "Jan Pab", "comment_text": "We stayed in Massa Lubrense at a beautiful airbnb, then hired a private boat (Lubrense Boats) to Capri. Next time, we want to stay in Capri for 2 nights."}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "Staying in Capri for 2 nights this October. In research, I’m discovering it’s not long enough to explore as we wish to.\n\nThose who say “don’t”…likely visited for a day on a crowded ferry and only experiencing the main piazza with the fancy shops/dining.\n\nWe’re focusing more on its history, churches, gardens and villas mainly in Anacapri. Plus a fabulous beach club for the day-Il Fontelina."}, {"username": "Tami Whittlesey", "comment_text": "I spent a few hours there last fall and realized very quickly that I wanted more. Next spring I have 5 nights reserved in Anacapri. I want to see the sunrises and sunsets and enjoy Capri before and after the wave of daytrippers. Book early for the best availability :)"}, {"username": "Aaron Loree", "comment_text": "Expensive"}, {"username": "Enrico Lecce", "comment_text": "Stay there on ana Capri then travel the area..."}, {"username": "Deanna Tipton Clemens", "comment_text": "We spent two nights in anacapri at a bed and breakfast last week. It was amazing."}, {"username": "Roland Trego", "comment_text": "If it's windy, the ferries might not be running, so you will be stuck on Capri. If you're on the Amalfi Coast or in Sorrento, you'll have the option of going by car or bus if that happens."}, {"username": "LeAnn Bonkiewicz", "comment_text": "Staying there in September"}, {"username": "Kyle Wilcox", "comment_text": "$$$$"}, {"username": "Larry Reinier", "comment_text": "Expensive"}, {"username": "Mariya Terzieva", "comment_text": "Financial 😃"}, {"username": "Carmine Napolitano", "comment_text": "$"}, {"username": "Darryl Vanstone", "comment_text": "Expensive"}]}, {"id": "2194405764291835", "text": "If you’re in the Amalfi coast do yourself a favor and don’t go to Ravello by bus (SITA bus) I wasted an entire day trying to go from and to Amalfi. There’s only minibuses going to Ravello, they’re packed and running extremely behind schedule. Spent hours in the sun waiting, the worst day so far!!", "link": "facebook.com/groups/1373361046396315/permalink/2194405764291835/", "likes": 11, "comments": [{"username": "Sigrid Cormier", "comment_text": "You can take a boat. Then bus or taxi up from port. It would be very scenic by sea."}, {"username": "Evelyn Trager Jose", "comment_text": "I almost made this same post. It’s a literal nightmare getting to Ravello on public transportation.\nNever happened for us either. The bright side - something to go back for!"}, {"username": "Cait Millett", "comment_text": "I was thinking of taking the ferry from Naples to Positano and then would have to figure out getting to praiano from there. Has anyone ever done this?"}, {"username": "Krista Blaylock", "comment_text": "We are coming in September and this was a huge concern for me. Were there taxis available?"}, {"username": "Heather Akstulewicz", "comment_text": "Following. I'm coming in Sept & Ravello was high on my list! A taxi is probably a million dollars 😭"}, {"username": "Sigrid Cormier", "comment_text": "Google small group tour Sorrento Amalfi and Ravello. Only 8 people in the group.\nAfter the fatal bus accident (driver no passengers) I believe they are not allowing to large busses any longer."}, {"username": "Mary Lynn Austin Mang", "comment_text": "We went in May and taxi was $60 ea way"}, {"username": "Cheryl Ann", "comment_text": "We were there last week and we paid for a taxi van. On the way up we had 9 people in the van and he charged €15 a person. On the way down we only had our group of 5 and it was closer to €20 a person. Taxis are really easy to find by the ferry docks. Ravello is beautiful with amazing views and worth every cent."}, {"username": "Daniel Michael", "comment_text": "Words alone won’t express how thankful I am to you and to your platform. It has been a good opportunity for me and my family thank you. Mr Luke Donald"}, {"username": "Gay Polt", "comment_text": "Following.. thanks everyone!"}, {"username": "Robin Burrell", "comment_text": "They wrinkle, don’t stretch, and are hot."}, {"username": "Johni Divine", "comment_text": "We spent $20 per person for a taxi to get to Ravello from amalfi for anyone asking! On the way back we paid $15 per person!"}, {"username": "Starla Dawn", "comment_text": "I did a private driver option for Positano and Ravello and it was relaxing and wonderful. We also stopped at Pompeii on way back to Sorrento."}, {"username": "Linda Metallo Casey", "comment_text": "We had a private driver. Mena Forino with Amalfi Coast Transfers was the best. Contact her."}, {"username": "Denise Curtis", "comment_text": "Anybody done vespas from Positano to Ravello?? Mid September so crowds hopefully are less."}, {"username": "Leila Jane", "comment_text": "We used romeinlimo and reserved it ahead of time. Can't remember the price but it can be shared with another couple if you want to. I went on Cruise Critic for my sailing and met another couple online who wanted to share the ride. Worked out beautifully and so much easier and more relaxing."}, {"username": "Karen Cumbo", "comment_text": "Nope. We always rent a car and drive. I don’t like putting my life in the hands of some bus driver."}, {"username": "Karen Turck", "comment_text": "Bob Hargreaves"}, {"username": "Anel Van Zyl", "comment_text": "We had a similar experience about 2 weeks ago, trying to catch a bus from Amalfi back to Ravello where we stayed. The big Sita buses were still going from Amalfi to Ravello but the trips take about 1 hour and 40 minutes (think they first go to Scala and then Ravello). The last bus of that particular day was 4pm although the person in the tabbacheria who sold us the tickets neglected to mention this. The schedules at the bus stop looked like there should have been more buses but maybe they stopped earlier as it was a Saturday? Anyway, then we found out about the smaller 20-seater white Riccatelli buses (also marked as Sita on the dash board). They also indicate the destination with a card on the dashboard. These buses are supposed to run hourly till 9pm. You use the normal Sita bus tickets. Unfortunately, our fellow tourists didn't see the need for queuing (some who arrived late shamelessly pushed themselves to the front) and getting a seat on the bus actually involved a lot of shoving! The Riccatelli Sita bus trips to Ravello are much shorter-about 15 minutes. Ravello is such a charming town, especially in the evenings!"}]}, {"id": "2194342064298205", "text": "Recommendations please,we are planning a trip September for 4-5 weeks and wondering best place to start..from UK...we want to visit as many places as possible by transport IE... train ferry we have been to Rome afew times so not bothering again...thank you all advice welcome x", "link": "facebook.com/groups/1373361046396315/permalink/2194342064298205/", "likes": 2, "comments": [{"username": "Nicola Bradley", "comment_text": "We’ve just been in Verona which was a great base. Easy to reach Milan, Venice and Lake Garda by train. From there we went to Florence. We’ve been to Tuscany and Umbria before. Gubbio, Perugia and San Gimiano are all worth a visit"}, {"username": "Dao Siri", "comment_text": "Have a good time for you.\nNice trip.\nOn September 19-23\nMy family want to go to Lake Como and Tuscany and travel around for4days trip stays in Lake Como and Tuscany for adults 5 persons please recommendations\ntrip start from Milan about traveling boat and hotel restaurant and interested activities Thank you in advances"}, {"username": "Miyuki Kanno Paul", "comment_text": "Build your itinerary based on which airport(s) you will be using. Then decide if you want north to south, south to north, etc. Stick to the mainland unless you are willing to rent a car in Sicilia. You’ll need a good 2 weeks and more to explore the unique island. You will appreciate more of Sicilia if you have visited the mainland already"}]}, {"id": "2193995734332838", "text": "We are planning to travel from Salzburg to Rome. Does anyone have recommendations about flying versus taking the train? Do you get to see a lot of the countryside when you travel by train?", "link": "facebook.com/groups/1373361046396315/permalink/2193995734332838/", "likes": 1, "comments": [{"username": "Sigrid Cormier", "comment_text": "Personally I would do it. Going through the alps and northern Italy is stunning. I think you’d have some views in the Amalfi coast area. You would need to google that question. I can’t say but you might have a few transfers."}, {"username": "Mary Anderson Jenkins", "comment_text": "The Austrian trains don't seem to strike like the Italian trains. A plus!"}, {"username": "Tracy Hazlett Van Denburg", "comment_text": "Oh funny, i just posted a similar question…we are thinking of traveling by train from Munich to Rome."}, {"username": "Holly Weller", "comment_text": "We're traveling from Venice to Salzburg by train hope to see some great views 😍"}]}, {"id": "2193981914334220", "text": "Last day in Rome and looking for the best area to shop for gifts. Looking for leather goods, jewelry, pasta, etc. It is so hot so would love to narrow down one area. Thanks in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2193981914334220/", "likes": 3, "comments": [{"username": "Charleen Siegler Schuss", "comment_text": "Campo di Flori in the AM fir beautiful scarves, leather wallets, purses, pasta, spices, kitchen supplies and the most gorgeous fruits and veggies you will ever see. Plus there is a bakery with pastries to die for on a side street."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Check via Cola di Rienzo for clothes shopping, la Rinascente in via del Tritone and Fondaco in via Frezza.\nFood Campo dei Fiori or a normal supermarket will have everything you want!"}, {"username": "Lucille Leblanc", "comment_text": "Airport has a great selection of stuff"}]}, {"id": "2193959604336451", "text": "Hey gang. We are travelling to Italy in august. Yes. The most busiest time. Lol\nRome Naples Sorrento Florence Verona and Milan. We have notice a large increase in pickpocketing incidences. Any advice on how to carry around money , credit card , cell phone , etc Your input is much appreciated 🤔🙏", "link": "facebook.com/groups/1373361046396315/permalink/2193959604336451/", "likes": 5, "comments": [{"username": "Dave Conroy", "comment_text": "If you search on pickpocket you will find a ton of threads (daily) and most contain options to minimise risks, etc. IMO YOU are a bigger risk than the brand or item you buy to avoid being pickpocketed, so be aware of yourself and others and the basics, like not being distracted, pushed, leaving bags open/\naccessible so you're seen as easy, etc. TBH stories may or not be true or representative.\nI have been on forums for a number of the many countries I've visited, incl high crime places like India and South Africa, and there are always threads about theft, risks, etc and not too much of it is real individual experience, more things people hear. A lot of it is displaced anxiety of being out of control in a strange place, IMO. In a risky situation, getting on transport, in a crowd, hold onto your chosen bag in front of you. So a cross body type bag or a bum bag are more favourites. It's debatable whether you should spread items across you, so cash in one place, phone in another, or have it all together. I like to have most stuff in one place that I can always pay attention to and have on my person. But I will have a card in a secret place as a fail safe. You can also leave stuff in a safe if there's one at your accommodation, but thefts from hotels do happen. I trust myself and my attention more than anything else, and definately more than any brand or item recommended. I thinBank cards, get modern internet bank account cards so you can instantly cancel if lost or stolen. Lots of old school banks are very poor for this kinda thing. I have a chase, Revolut and Monzo, and Tide for my business. All cancellable within a minute or less on my phone. sure the phone could be stolen too - haha. Italy isn't likely to be any more crime ridden than your own country. be wary but realistic."}, {"username": "Laura Jetton", "comment_text": "I got a leash for my phone so I could carry it around my neck. That prevented me from getting in and out of my purse.\nI also took a pic of my passport and had a photocopy in my purse, then left the real one in my room.\nI kept my $$ and cc in a zippered pocket and carabiner everything closed.\nMy daughter used a money belt."}, {"username": "Graham Sherlock", "comment_text": "You will hate Italy in August it is too hot now, August will be unbearable, 24 x 7, 7 days a week."}, {"username": "Miyuki Kanno Paul", "comment_text": "Don’t leave your cell phone on the table"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Keep valuables under your clothing out of sight. Get a lanyard for your cell phone. Be extra vigilant when in crowds and when using public transportation."}, {"username": "Gina Johannes", "comment_text": "Try a slim running belt on Amazon. They go under your shirt and hold money/phones.\nWe are currently in Milan and had no issues. Was in Florence and Venice also this week. Again with no issues."}, {"username": "Sandra Francano Richards", "comment_text": "Most Italians are on holiday in August. Much will be closed. I was there in August for a wedding a few years back. Very hot. Lots of things closed."}, {"username": "Patsy Luque Mejia", "comment_text": "We will be in Italy the 3rd week of August through September. Really hope this heat wave is over by then. I know it will be hot, but historically the hottest month is July through mid August. Hoping and praying for milder heat near the end of August. 😁 Carry a cross body. I use travelon. Money belt too."}, {"username": "Sharon Williams Sellers", "comment_text": "You can’t be too careful there. Naples is the very worst￼. We actually saw a pickpocket doing his thing and one of them tried to hit us but we were very cautious.. I get a belt that has a zipper and wear it under my clothes and I put my passport and all my valuables in there. I carry a purse but it’s just for things like a lipstick and a Kleenex etc. I would be afraid to carry anything in a purse."}, {"username": "Najeana R. Crandall", "comment_text": "August is when italians vacation. Lots of shops and stores may be closed while you're there. Heads up!"}, {"username": "Valerie Collanton", "comment_text": "Just use your common sense. Crossbody bag. Don’t put wallet, phone or anything or value on back pocket. Be mindful of your belongings. I have never had an issue and have traveled solo all over Italy."}, {"username": "Phyllis Snyder", "comment_text": "Under the clothes money belt, anti theft crossbody purse or bag- always zipped up and never worn in the back- and never put down. In crowded areas hands firmly on your belongings. Also don’t fall for scams - unfortunately they are professionals and know that tourist are distracted. Stay alert don’t be in a rush know your surroundings. They won’t pick you to rob if they know you’re on to them."}, {"username": "Diane Petonito Giordano", "comment_text": "Yes pick pocketing is on the rise but they always had that issue. If your a woman carry a crossbody with zippers. Always, be aware of your surroundings don’t put the bag behind ur chair or on the ground. For men if they carry their wallets in the back pocket make sure the bottom is closed. Side pockets r easy for them to get the wallet especially, in crowded places."}, {"username": "Irene Oda", "comment_text": "Where there are tourists there will always be pickpockets - especially with nicer weather and crowds ( April - October at least). They know their skills and who to target. It's a numbers game really. The hotter the weather the more likely tourists let their guard down. I keep my passport locked in my suicase- including excess cash. I'm always afraid of using the hotel safes. I left my passport in a safe once and had already checked out- discovered it next day. Luckily was close enough to retrieve. Also just enough cash for the day. Crossbody bag etc for females. For men nothing in pockets. Thieves like to work fast. So anything that makes it harder. Watch put for younger kids crowding you. Just be aware of surroundings..."}, {"username": "Nadia Camier", "comment_text": "Un sac bandoulière devant."}, {"username": "Krissy DaRusso", "comment_text": "I use a travel safe purse that I wear across my body. I just make sure I hold onto it and keep it zipped when I’m surrounded by people or on public transportation.\nI also make sure I don’t eat outside with my phone/purse on the table. I travel solo and this is my second summer here. Other than those precautions I feel completely safe!"}, {"username": "Jenny Payne", "comment_text": "Cross body bag , I use all the time as I go 2 Italy twice a year and been lucky & a lot of commonsense & don’t stand out , blend in 🌻"}, {"username": "Sharmini Nair", "comment_text": "Carry a crossbody bag and hold it in front of you at all times"}, {"username": "Kelly Tabor", "comment_text": "Use the wallet app on your phone so you don’t have to carry cards. Use a crossbody bag which can be across the front of your body. Never place your bag on the chair behind you. Always in your lap. Hand on your bag at all times while in crowds."}, {"username": "Jacki Forcht McElhaney", "comment_text": "Pacsafe has several options."}, {"username": "Tanya Nard", "comment_text": "I was there this time last year, I found the heat to be unbearable. We went mainly to the beach where it was a lot better. I couldn’t imagine walking and touring around in this heat!"}, {"username": "Delphinia Salamin", "comment_text": "I was in Barcelona which is worse pickpocketing area. What we did we bought backpacks that tie around the waist and had three compartments. In the last compartment we used a certified combination lock and kept credit cards and more cash. When eating we held bags in front of us and locked our cell phones and kept everything insight. This worked very well as we carried small amounts of cash in our pockets and everything else locked up. When my friend went to Naples she secured her backpack same way but her friends didn’t do this and were pickpocketed while at a souvenir shops they took few items from backpack"}]}, {"id": "2193871704345241", "text": "Beware, my Dad had his phone stolen on the subway today in Rome 😢", "link": "facebook.com/groups/1373361046396315/permalink/2193871704345241/", "likes": 1, "comments": []}, {"id": "2193257434406668", "text": "Ciao!\n\nWe are finishing our 6 week Italian adventure tomorrow 😢 (thankfully we have a few weeks left in other countries!). We are a family of 6 (our kids are 15, 12, 10 & 6) travelling from Australia.\n\nOur Italian itinerary was:\n\nMilan - only stayed 2 nights, primarily for my husband & sons to attend a football match at San Siro. They had an absolute ball!\n\nTrain to Venice.\n\nVenice - stayed in a very cool & quirky Airbnb for 3 nights. Loved Venice, just walking around & getting lost. Took a tour boat to Murano & Burano one day which was interesting, especially the glass blowing demo. I probably couldn’t have stayed longer with the kids… anywhere they tried to kick a ball they got told off & so it was enough time with them (could absolutely go back without them sometime & enjoy some nicer restaurants etc 🤣).\n\nTrain to Bologna.\n\nBologna - loved it! Food was amazing, definitely the best we had in Italy. Gelato is amazing here! We got tickets on the day to walk up the tower, I was scared (I’m terrified of heights!), but all the kids were fine. View from the top is pretty great. I loved that they closed the main streets around the Piazza over the weekend to cars, it had a nice ‘festival’ vibe. Our Airbnb here was also great. Spent a morning at Giardini Margherita, where the kids got to kick the ball freely & enjoyed a game with some local children! We had 4 nights here & felt that was a good amount of time. We did a day trip to Modena & checked out the markets/bought parmigiano/tasted balsamic vinegar, which made for a fun day.\n\nTrain to Levanto.\n\nLevanto - we stayed in a beautiful farmhouse through Airbnb that I cannot recommend highly enough (except the stairs to get back up… if you have a car, this wouldn’t be an issue!). We stayed here to explore 5 Terre because we met up with friends & needed a big house, which I couldn’t find in any of the 5 CT towns. Levanto was beautiful though & we spent half a day on a small boat looking at the CT towns from the water & it was a highlight of our entire trip. We also caught the train to the towns & hiked between Corniglia, Vernazza & Monterroso. Definitely more of a hike than a walk & it was a bit challenging at times keeping kids motivated, but we got there in the end & all loved it. We explored RioMaggiore & Manarola by train separately & loved Nessun Dorma for drinks/dinner!\n\nTrain to Florence via Pisa.\n\nPisa - we literally stored our bags near the station & walked to the leaning tower. It’s a bit of a trek, but totally worth it, we had a lot of fun trying to get the pictures right!\n\nFlorence - I could write a novel on all the ways I loved Florence! Someone here mentioned the Benheart store for leather & this was honestly one of the highlights of our trip. Ben was in the store & he (& his staff) are an absolute joy to be around! He had my kids in the street playing football while we browsed & honestly, the BEST shopping experience ever, I couldn’t walk into another leather shop after that, nothing could compare to our experience in there. We saw David & he is obviously incredible (I had pre-booked tickets for him & the Galleria Dell’Accademia) & we spent a lot of time just walking & looking at everything (we didn’t go into the Duomo, just admired it from outside). We were here 3 nights & could have happily stayed longer!\n\nWe then hired a car from Europcar (in the city) & I have to say, it was the worst car hire experience we’ve had. They didn’t have the car we’d booked months prior, then tried to blame it on us being there late (we had been there on time & had to stand in the queue for ages). It just went on & on, they were so rude, it was horrid. Anyway! We got a smaller car than we needed, so it was a squish, but we got everyone in & headed to Tuscany.\n\n(Note… we had so many dramas trying to get a cab to take us from our accom to the car hire, they kept declining us & Uber doesn’t exist in Florence… so keep this in mind! If I’d known I would have organised a transfer car. We got a cab easily from the train station to our accom, there’s a big line for them there).\n\nTuscany - we had a week at Agriturismo Diacceroni & it was great. I wouldn’t have stayed there without kids, it was a little bit “summer camp”, but with kids it was perfect. We lazed by the pool, the kids did some horse riding, we did a pizza & pasta making course & a truffle hunt. The on-site restaurant was great & the apartment was really big. Would definitely recommend if you’re traveling with children! We did drive around to a few of the towns nearby & really loved them all. We did a winery tour at Fattoria Il Piano near San Gimignano & it was excellent.\n\nFrom there we returned the car to Florence & got the train to Naples.\n\nNaples - because we were only there for 2 nights (primarily to see Pompeii), I booked an Airbnb near the train station. The actual apartment was fantastic, but the area was a bit so-so. We never felt unsafe, it was just FULL of rubbish! We stepped over a rat amongst it all one day. We caught the train to Pompeii & had a tour with a guide I found on Airbnb experiences. She was brilliant, I would highly recommend her, especially for kids. That afternoon I booked a Spanish Quarter tour through GetYourGuide which I really enjoyed, but it was probably too much in one day for the kids, they were exhausted! They did love the Maradona stuff though! We had dinner at Trattoria Nennella (got there 20min before it opened & lined up), which was lots of fun - they turn the music on & the waiters all dance & sing, the kids LOVED this!\n\nFlew Ryanair to Cagliari.\n\nSardinia - wow, this place is beautiful! We picked up a car at Cagliari airport & drove to our Airbnb in Costa Rei. It was a drive to the beach, but it didn’t matter because we wanted to explore a few anyway. We visited a few of the beaches up & down the coast & they were all magnificent! We organised a last minute snorkelling tour for half a day through a dive centre in Villasimius & this turned out to be a great idea! We did 2 fairly long snorkels in beautiful clear blue water, everyone really enjoyed this. The company was Archeo Diving & they were really excellent. Villasimius was a cool town, we really liked hanging out there. We had 4 nights, but could have spent a lot more, it is paradise!\n\nFlew ITA Airways to Rome.\n\nRome - it was HOT!!! Really, really hot, almost unbearable. Thankfully our Airbnb had aircon. We stayed in Monti right behind the Roman Forum & it was a great apartment & spot. We did a Colosseum tour through LivTours, initially we had booked the underground tour, but we were victims of the cancellations, so it got changed. The Roman Forum part of the tour was interesting for me, but for the kids in the heat (& so soon after Pompeii, perhaps), it was just a long, hot day! Once we got into the Colosseum everyone really loved it, but 3 hours was a long time. We also did an early morning Vatican Museum/Sistine Chapel tour with LivTours, which started at 7:30 (although we did still have to queue until it opened at 8am). This was also really interesting for me… but probably went largely over the kids’ heads. Personally, I thought the 2 LivTours we did were really great, but in hindsight I may have looked harder for a tour guide that could tailor things more to the children, they were quite ‘serious’ information/content-heavy. Our guide in Pompeii navigated offering interesting info to us, while also engaging the kids so well, it was always going to be hard for anyone else to stack up!\n\nWe walked around Trastevere one afternoon & felt a bit like we were missing something… we didn’t really find any cool shops or anything interesting like I’d read. Maybe we were in the wrong place?! My daughter did get her ears pierced here though & I was really impressed with the shop that we had it done at. We found exactly what we thought we’d find in Trastevere, in Monti (right near where we stayed) though! Lots of cool arty shops, another lovely guy making beautiful leather pieces & good restaurants/bars. We actually stumbled across a brilliant burger bar here (T&C), right when everyone was feeling a bit over pasta & pizza!\n\nOtherwise we walked ALOT around Rome! We went to the Pantheon the day after they introduced the new ticketing system & I had bought us each a ticket for €6 online. There was such confusion though with the new system that no one knew what was going on & tension between customers & staff got a bit high at times. They had various queues & people who hadn’t pre-booked tickets were walking right in while we had to stand & wait, it was chaos. I hope they’ve ironed out those kinks by now!\n\nAnother great thing we did in Rome was an early morning running tour (through Airbnb experiences). We met the guide at 6:30am & did about 10km past all the main points of interest - even though we’d already seen them, it was so cool to see the Colosseum without anyone around it & likewise for the other places. If you like running, I would highly recommend this, it was a great way to see the city & the guides were excellent!\n\nWe had 5 nights in Rome & it was probably 1 or 2 nights too many - perhaps because it was so hot, or perhaps having the kids & not being able to hop between restaurants like I would without them, we just kind of felt like there wasn’t a lot else we could do after we’d seen all the ‘hot spots’. It was probably the heat making us all grumpy 🤣.\n\nTrain to Venice Mestre.\n\nMestre - yes, we backtracked. Only because we booked our sons into the AC Milan Junior Football Camp in Cortina after I’d booked everything else! So we had a night at the Anda Venice Hostel near Mestre station & it was actually awesome (had another night a week later on our way back). Of course, the kids think it was the best accommodation ever!!! We hired a car from Alamo at the train station (easiest car hire ever, can recommend!).\n\nCortina D’Ampezzo - WOW! This place is amazing, we LOVED it! I can’t put into words how beautiful the Dolomites are, they really took my breath away every day. We stayed in the Hotel Alaska (the kids stayed here with the camp & we thought it best to stay close this time) & it was fantastic. The town of Cortina has lots of shops & great restaurants/bars. We drove around a bit to other towns/lakes & they were all gorgeous. We hired e-bikes one day & rode for half a day, lots of fun & great scenery! We caught the gondola up to a wine bar (Masi Wine Bar) which was fab - great wine & those views are perfection!!! We can’t wait to come back, it is a really magical spot!\n\nWe drove back to Mestre to fly out of Venice airport for Greece.\n\nI booked all our train tickets through ItaliaRail & it was super easy. The train between Levanto & Florence wasn’t available to book until a couple of weeks prior, that was a little stressful, but we got there in the end! I booked business class seats where possible - it was nice to have assigned seats & a bit of space. There was always room for our bags above the seats or between seats.\n\nWe took backpacks with zip-off daypacks rather than suitcases. This has worked well for us as we haven’t had to wheel cases on cobblestones etc. & getting on/off trains has been totally fine. We have had to buy one extra bag so far though… the shopping here is great!!!\n\nWe used Stasher & Bounce to store bags - just check the reviews on the places you’re using & it should be fine. For us it worked really well. My preference though, is for stowyourbags.com We used them numerous times & it is just so easy. If there is one near where you’re going, I’d really recommend. Just book online & then use the code once you get there, such a great system.\n\nWe have loved exploring Italy, it’s been a great place to bring the kids. We’ve felt safe the entire time & met some really beautiful people along the way!\n\nI will happily answer any questions, but we are still traveling for another month, so if I’m slow to reply, please forgive me!", "link": "facebook.com/groups/1373361046396315/permalink/2193257434406668/", "likes": 304, "comments": [{"username": "Kellie Suffell", "comment_text": "Hi Aymée Hogbin we are doing a similar trip can I pop you a DM?"}, {"username": "Gemma F O'Brien", "comment_text": "Would you please DM me the air Bnb links for your stay? They sound super!"}, {"username": "Ben Masters", "comment_text": "Would love the Venice accomodation recommendations\nas well please 🙏"}, {"username": "Anna Tullemans", "comment_text": "Thank you for this great review. We are heading to Italy next year and are planning where to go and where to stay. Would love to know where you were in Venice as that is our first stop."}, {"username": "Kerry Littlejohn", "comment_text": "Where did you stay in Venice? We’re are going over next March/ April. It sounds amazing."}, {"username": "Elizabeth Bernal Bain", "comment_text": "So so so many questions! You left a great overview of your trip. We are going with 2 kids who will be 13 and 9 when we go.I want to take a trip like yours but not so many places. First of all, how much did a vacation like that cost? Second, how did you pay? Bank card? Credit card? Cash? Third, what about logistics and getting from accommodation to your point of interest location? And you mentioned everyone used backpacks. How did you pack and what did you bring? My husband and I are thinking of going next October and maybe spending 2-3 weeks and I want a slow paced experience where we just enjoy the atmosphere. My kids actually love to window shop and walk around places. Did you plan your trip yourself or did you use a travel agent? Either way, it sounds like a fantastic holiday."}, {"username": "Jan Woods", "comment_text": "Fellow aussie here - planning our trip (3 adults just retired). Personally I think your trip sounds amazing. I visited Europe many many years ago and traveled around with my girlfriend. I would have liked if your post had listed the names of the airbnb's and hotels you stayed at. This would help people alot.\nEnjoy the rest of your trip 🩷"}, {"username": "Melini Menges Curtis", "comment_text": "What an amazing informational post- thank you! 😊 I would also love a list of your accommodations as well as the name of the boat tour you took to see CT. Gathering all the information I can to start planning my bucket list trip to Italy 😍"}, {"username": "Elizabeth Dion", "comment_text": "Thx for the fun info! Can you share where you stayed in Venice and how you booked your hotel in Alaska as when I put in for my family of 5 for next year it says they can't accommodate us... Thanks!"}, {"username": "Melanie Dianne", "comment_text": "Following 🙂"}, {"username": "Barbara Gentilcore", "comment_text": "Wow great information. thanks."}, {"username": "Katie Oelker", "comment_text": "What an incredible experience!! Jealous of all these long trips. We are from the US and could barely swing 2 weeks gone 🤦‍♀️ bookmarking this for when we go and for when we go back another time!! Thank you again and enjoy the rest of you trip!"}, {"username": "Cindy Murillo-Hunter", "comment_text": "When in Rome did u book tour ahead of time or when you arrived?"}, {"username": "Hellen Brugnatti", "comment_text": "Could I please get info on where you stayed in Venice and also Tuscany. Also how did you book the horses? And did they have to be prebooked?"}, {"username": "Elise Groves Sheehan", "comment_text": "Thank you!! I would love to know the place you stayed in Levanto when you have a moment. Also, the 10k run sounds like such a cool and different way to see a city. I didn’t know there were experiences/ tours like that! Did you find those on the airb&b website?"}, {"username": "Carole Duncan", "comment_text": "What a great post Thankyou 😀 Planning a girls trip next September ( well more of a mature woman’s trip lol) Would appreciate it if you could send me a list of the accomadation you stayed in please 😎"}, {"username": "Nancy Sorrentino-Dillon", "comment_text": "would love the name of the tour guide/company you used for Pompeii tour"}, {"username": "Nadia Nadia", "comment_text": "Hi arriving in Rome 6 nights and 5 days, no children only with young adult son 😁keen to hear if I should do all our tour booking now or can be done there. Thanks"}, {"username": "Danielle Katzenstein Recine", "comment_text": "I was on the same running tour…but I was in bed sleeping. Kudos to you for running in the Rome heat. Just left there and it was unbelievably hot!"}, {"username": "Sarina Natale", "comment_text": "Thanks for sharing this, lots of great information. Who did you fly with?"}, {"username": "Julie McIvor", "comment_text": "Lynette Pitt"}, {"username": "Tina Neglie Farghaly", "comment_text": "Wow\nWhat a lot of places you visited! And still more to come.\nHappy to know it was such a positive experience and above all your consideration in sharing it! How kind"}, {"username": "Sandra Lew", "comment_text": "I have a September reservation for the Hotel Alaska in Cortina. Good to know someone liked it 🙂 and will need to check out the wine bar. Any restaurant recommendations\nin Cortina?"}, {"username": "Cynthia Vossenberg", "comment_text": "Can you DM me the running tour used in Rome? The contact I have is on vacation for the dates we are there and not available"}, {"username": "Krista Missons", "comment_text": "Isabel Isidro Collings - this post is awesome"}, {"username": "Nadia Nadia", "comment_text": "I desperately appreciate the name and link to the tours that you did and were happy with, leaving in a month time 😬"}, {"username": "Michael Galan", "comment_text": "Please adopt me"}, {"username": "Paurenia Patrick", "comment_text": "Lee-Ann Parrotte"}, {"username": "Riza Delos Santos Sargent", "comment_text": "We are a family of 4 with 2 boys. I’m starting to plan our first trip to Italy, Greece and maybe Switzerland in June 2025. Your post is wonderful and my boys love the football part the most. They play travel soccer and would to know more about the camp and the game. What’s the website for those? Need more info about these please when you have time. Thank you!"}, {"username": "MMs Lina", "comment_text": "Would love to know where you stayed in Rome?"}, {"username": "Kris Carr", "comment_text": "Great post and some fab experiences by the sound of it. We are going to Cortina D’Ampezzo and you’re the first to post about it. So so happy to hear how beautiful it is. Enjoy the rest of your trip. We’re coming from Aus in September."}, {"username": "Nat Burgess", "comment_text": "Thank you so much, this is so helpful. We are planning a 6 to 8 week trip. First time to Italy. Would love a list of all the accommodation used. There is only 2 of us, so happy if some would not be suitable for us. Fabulous job 👏"}, {"username": "Karen Miller Morales", "comment_text": "Love this!! The exact trip I wish to do next year and Greece will follow Italy"}, {"username": "Mariposa Mariposa", "comment_text": "Thanks for sharing. This is wonderful advice."}, {"username": "Carol Potter", "comment_text": "WOW!!!"}, {"username": "Rebecca Camp", "comment_text": "Thanks for sharing!!"}, {"username": "Alexis McNamara", "comment_text": "Loved this review! Thank you!"}, {"username": "Jacqueline Morris", "comment_text": "Would like to know where you stayed in Venice, please ."}, {"username": "Paloma Rastagar", "comment_text": "What an awesome review! Travelling with my toddler mid September and wasn’t sure if I booked correctly via Italia rail! Glad it’s easy! 🥰"}, {"username": "Debbie Vick Schavietello", "comment_text": "Laura Dutreix great info from this group!"}, {"username": "Frank Bertuello", "comment_text": "How was Ryan air\nWhat were the allowances on the flight\nWe will fly from Paris to Rome\nThank you"}, {"username": "Lisa Hartert", "comment_text": "Excellent review! Can’t believe how well you managed with kids. Wow!! 😍🇮🇹"}, {"username": "Stephen Henn", "comment_text": "Planning a trip to Greece in the spring. Haven’t been able to find a FB page like this one for Greece. Are there any FB pages for Greece that helped you as you planned your trip there?"}, {"username": "Jill Powell Miller", "comment_text": "Aymee Aymée Hogbin sounds like an amazing trip. Can you post where you stayed in Venice and Bologna please, thank you"}, {"username": "Kimberly Campanaro", "comment_text": "Sounds amazing. My family of 4 are going in a few weeks. Would you be able to share the name of the small boat that you used from Levante to see the 5 CT? Much appreciated."}, {"username": "Debbie DeMarco Gero", "comment_text": "Thank you for the thorough post! So helpful!"}, {"username": "Brendan Grace", "comment_text": "Holly Fowler"}, {"username": "Susan Ward Cross", "comment_text": "Great review! Thanks for sharing your experience 😊"}, {"username": "Piyuma Jayasundara Boteju", "comment_text": "Could you give me information about the Murano Glass blowing demo please?"}, {"username": "Janine Kallestad Padgett", "comment_text": "Please dm me with airbnb info. I’m traveling w a family of 5"}, {"username": "Jane Teofilo", "comment_text": "Thank you such a detailed and amazing trip! This will be our first trip without the kids going in September so looking forward to it, as an Aussie myself - did you buy a SIM card at the airport or just used international roaming on your phone? Thanks"}, {"username": "Rebecca McFarlane", "comment_text": "Mick Kearey great advice here baby 🇮🇹🍕"}, {"username": "Aymée Hogbin", "comment_text": "Janine I will DM you."}, {"username": "Karen Gordon", "comment_text": "What a fab review! Thankyou! 🥰❤️\nCant wait to hear where you go next! 😍\nHave a great time 🥰🌻"}, {"username": "Carol Fayers", "comment_text": "Such an informative post. Thank you! Enjoy the rest of your travels!"}, {"username": "Jacqui Warsama", "comment_text": "Hi great information about everywhere you stayed, thank you….\nThe Dolomites? Do you have to hike, or can you admire them from town of Cortina?"}, {"username": "Tracy Foss", "comment_text": "I am nervous about ITA & Ryanair baggage allowance were they a lot smaller ?We are flying domestic Venice to Sicily & Sicily to Naples We are traveling with carry on & personal coming from Air Canada. We are taking trains the rest of the time business class so not worried"}, {"username": "Sue Higgins", "comment_text": "I love your honest well written recount. What a fabulous holiday making memories for your family. What shone through in spades was your mindset towards the great and not so great experiences. That’s travel! Not everything is going to be great! What a fabulous role model for your kids. Enjoy the next part of your adventures."}, {"username": "Sue Anderson", "comment_text": "This is an awesome post, so many great tips. Thank you"}, {"username": "Kylie Eagleton", "comment_text": "Sounds amazing"}, {"username": "Kathy Schieber", "comment_text": "Whereabouts did you stay in Florence?"}, {"username": "Coco Cole", "comment_text": "Thanks!!"}, {"username": "Robýn Kretsçhmər Schuchårdt", "comment_text": "Did u go to vatican city?"}, {"username": "Laura Miller Bailey", "comment_text": "What an amazing adventure! Thanks for sharing 😎"}, {"username": "Linda Corigliano", "comment_text": "God bless you. Enjoy the rest of your vacation and thank you for your post! 🙌🙏🏻🍷"}, {"username": "Johan Jürgensen", "comment_text": "I’m so happy for you! And. Wierdly enough, so proud of italy! And I’m not even Italian?!\nI’m Danish, but been to italy at least 20 times. 👌🔥🍕"}, {"username": "Oana MC", "comment_text": "Wow !\nSuch an amazing trip ans so many advices you give us, generously !\nThank you , it’s , far away, the best post I saw ….."}, {"username": "Francia Clasara", "comment_text": "Great details and information!!!!"}, {"username": "Mallorie Mathis McManus", "comment_text": "BEST review Ever. I took notes of the Dolomite time as that will be my next trip to Italy :)\nBut what a great, positive report - Even when mentioning the not so great parts. thank you 😊😄😊😊"}, {"username": "Lisa Pinder", "comment_text": "Our itinerary is very similar\nMilan\nLake Como\nDolomites\nVenice\nBologna\nVernazza CT\nFlorence\nSiena\nRome\nI can't wait bring on next September !!!"}, {"username": "Sonja Thayer", "comment_text": "I would love to hear more about Sardinia! I am thinking about going for a week next summer. Did you fly? If so where from? Any recommendations\non towns to stay?"}, {"username": "Marita Bracun", "comment_text": "WOW what an awesome experience for you all"}, {"username": "Lyn Healy", "comment_text": "Thanks for sharing...what a great review!...we are going next year 2024 from Australia too...not taking the kids though...x"}, {"username": "Jaime Johnson", "comment_text": "Great info, thanks for sharing!"}, {"username": "Lisa Hry", "comment_text": "I would love to know where you stayed in Venice that was quirky and cool?\nI would also love to know where you stayed Levanto at the farm house?\nThank you so much for this great review and enjoy the rest of your vacation"}, {"username": "Jean Still", "comment_text": "Amazing trip. Thanks for sharing. We have a couple of nights in Bologna after a cruise. Any restaurant recommendations\n? Thanks again x"}, {"username": "Michela Crawford", "comment_text": "Great information 😊"}, {"username": "Laureen Garrido Jimenez", "comment_text": "Ooh I would love any info on football games you may have.\nWe looked into any matches at Siro but looks like there are none currently."}, {"username": "Elvira Lelli", "comment_text": "Lovely review on your amazing adventures' thankyou for sharing...Italy\nis a beautiful place to visit...🤩"}, {"username": "Gillian Bissex", "comment_text": "Thank you for spending the time to write this amazing review. We are from Australia also and spent 2 days/nights in Monti. Perfect location. We started walking from there as soon as we had checked in to hotel. We had little to no jet-lag. I agree re Trastevere. Maybe we were there at wrong time of day.\nFor future reference, I would love to know where you stayed in Florence and Venice.\nIMO, you should be a travel writer!"}, {"username": "Helen Costigan", "comment_text": "Can I ask about the football camp? Do you know what the costs where? I have a boy and girl who would love this !"}, {"username": "Mary Paron", "comment_text": "Loved the review and good info"}, {"username": "Linda Safstrom Humphreys", "comment_text": "Brilliant post, thanks for sharing"}, {"username": "Angie Tripp", "comment_text": "Amazing trip!"}, {"username": "Ashlee Ann", "comment_text": "Would love to know where you stayed in Bologna?"}, {"username": "Claudio Bidart", "comment_text": "You mentioned backpacks are you able to recommend which brand or type please, visual or a link as I'm debating mid size wheel bags and I'm doing a similar trip like yourself via trains as main mode of transportation through Italy. Thanks"}]}, {"id": "2193877641011314", "text": "Hi all, I am trying to plan a trip to Cinque Terre and the Amalfi Coast. What is the fastest way to get from California to Cinque Terre and then from Cinque Terre to Amalfi or Sorrento. Prefer not taking a bus. Should we stay in Amalfi, Sorrento or Positano? How many days? Plan on going next year May/June and visiting Italy for 11 days. Any tips would be appreciated. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2193877641011314/", "likes": 1, "comments": []}, {"id": "2193880061011072", "text": "32 nights is this a good option flying into and out of Venice?\n1) Venice 4nt\n2) Verona day trip lake garda 2 nt\n3) CT 3nt\n3) Florence 5nt\n4) rome\n5) amalfi coast\n6) Sicily\nHave only booked first 3 hotels. I have been to Italy spouse has not. One mid age couple.\nAlso to add in Sardinia is that a good option logistically and if so where would it fit in?", "link": "facebook.com/groups/1373361046396315/permalink/2193880061011072/", "likes": 1, "comments": [{"username": "Ginger DiGalbo Katz", "comment_text": "Fly from Rome to sardenia. You need 6-7 days to see some of its fab beaches and experience the food etc then fly back to Rome. 32 days is long so you can fit all in."}, {"username": "Robin Burrell", "comment_text": "If you are going to Sicily, do the Aeolian Islands instead of Sardinia. Here is what I would do with 32 days,\n1. Venice 3 nights\n2. Garda 3 nights Sirmione\n3. Verona 2\n4. Florence 4 nights\n5. Santa Margarita 4 nights, explore coast, day trip to CT\n6.Rome 3 nights\n7. Sorrento or Positano 4 nights overnight train to Palermo from Naples\n8. Palermo 2 nights\n9. Cefalu 2 nights\n10. 3 nights Lipari, Vulcano or Panarea\n11. 2 nights Taormina\nHome from Catania to Rome or Florence or Venice.\n\nThis gives you a taste of Sicily only, but you can’t do it all.\nIt’s moving around a lot, only you can decide if it’s too much. My husband and I do it and he’s 76, but in good shape."}]}, {"id": "2193905517675193", "text": "Given that much of the Amalfi Coast shuts down in the winter where would you suggest staying in late January? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2193905517675193/", "likes": 1, "comments": [{"username": "Sheron Milliken", "comment_text": "I’d visit a larger city with more indoor attractions."}, {"username": "Colleen Jennings", "comment_text": "Bologna, Firenze, Milan ie any large city."}]}, {"id": "2193941637671581", "text": "We did a day trip from Florence via bus and visited 4 of 5 villages in Cinque Terre via train and boat a few days ago. Very hot but the gorgeous blue water was nice and cold! We swam in Monterosso and Vernazza.आणखी More rustic than the Amalfi coast but just as beautiful and much less crowded! I would definitely spend a few days there next time.", "link": "facebook.com/groups/1373361046396315/permalink/2193941637671581/", "likes": 108, "comments": [{"username": "Di Ganibe", "comment_text": "beautiful! can you share your train details from florence to CT and how did you get around in CT? wondering if this is a possible 1 day in/out trip."}, {"username": "Erin Ricker Seager", "comment_text": "Which group?"}, {"username": "Joleen Hart", "comment_text": "Absolutely gorgeous!!! Thanks for sharing!! Makes me excited for our trip!!❤️❤️"}, {"username": "Julia Muller", "comment_text": "My happy place 💕🙌🇮🇹"}, {"username": "Savannah Musser", "comment_text": "Is it better to book the day trip through a group or just take transpiration yourself and explore?"}, {"username": "Jeanne Zorich", "comment_text": "It is breathtaking ! I want to go back"}, {"username": "Heather MacDonald", "comment_text": "We did that tour today! What a beautiful place!"}, {"username": "Jeanne Mistler Buring", "comment_text": "Yes. Definitely stay overnight in the Cinque Terra"}, {"username": "Ariel Alysha", "comment_text": "Thank for sharing - what beautiful photos! How long did it take to get to CT from Florence?"}, {"username": "Zefy Steel", "comment_text": "Lilly, how long did you get to spend in each village"}, {"username": "Lynne Warshaw Gilman", "comment_text": "What was the name of the day trip and the company? Going to Florence in October and I am starting to plan some day trips."}]}, {"id": "2193964294335982", "text": "Has anyone attended a soccer match in Italy? If so, any idea on how to buy tickets?", "link": "facebook.com/groups/1373361046396315/permalink/2193964294335982/", "likes": 3, "comments": [{"username": "Todd Packer", "comment_text": "It depends on which team plays at home."}, {"username": "Peter Morgan", "comment_text": "I went to the Stadio Olimpico in Rome in 1982 to see Roma vs Juventus but my friend bought the tickets so I can’t really help you\nIt was a magnificent game by the way"}, {"username": "Michelle Creed", "comment_text": "When I did, I actually ask the front desk of the hotel to help. U can always email now and see what they can do for you."}, {"username": "Karyn Abbott", "comment_text": "We have done this a couple of times. Tickets are electronic so you just go to the team website and buy single game tickets. If you need English just click the British flag at the top. It’s not all in English but you can figure it out. Often tickets don’t go on sale until just before the game but you can enter your email and get a notification when tickets are available. This is a great experience and well worth figuring it out. In Italy search for Series A."}, {"username": "Kristi Britt-Stearns", "comment_text": "F"}, {"username": "Chassy Maria", "comment_text": "I just watched local games at the field in Cinque terre. It gave a real sense of community and insight into the culture. It was a ton of fun and free."}, {"username": "Maria Y Alexieva", "comment_text": "Go to the website or the official app and you'll see how. Fyi, tickets become available for free sale 2-3 weeks before the game. If you want to buy early, you'll need a reseller and the price would be 3-4 times higher."}, {"username": "David Dowd", "comment_text": "Football season starts in Italy on August 20. If you want to go before then there may be friendly pre-season games, but no official serie A games before then. Book on- line at official club website"}, {"username": "Adriana Rodriguez-Argueta", "comment_text": "Back in Jan’20 we attended AS Roma vs Juventus at Stadio Olímpico. I bought tickets online directly from AS Roma. Please know that Serie A doesn’t begin until mid August.\n\nhttps://\nwww.asroma.com/\nen"}, {"username": "Suzanne Munro", "comment_text": "I went through the facebook instagram page of the club they sent me the correct link for tickets to buy and gave advice"}, {"username": "Dottor Peppe Insigne", "comment_text": "Per la maggior parte delle partite c'è bisogno della tessera del tifoso,un decreto anticostituzion\nale voluto dal ministro Maroni. Solitamente costa intorno ai 20€,non so quanto ti convenga spenderli"}, {"username": "Stuart Mcilroy", "comment_text": "I went to Lecce v Sampdoria in Feb, the club website said you could buy tickets at the ground on the day of the match… perfect I thought - however the info was wrong, you can only make changes to tickets on match day- after much time trying to talk to the( very helpful ) guy at the ticket office outside the ground he directed me to a Tabata/tobacco shop about 2km from the ground, managed to get a ticket sorted out - also the security getting into the ground is much tighter than the uk - your details are included in your match ticket and they will check this against your passport/ driving licence - all said I really enjoyed the experience"}, {"username": "Susan Cindy", "comment_text": "Thank you everyone! Very helpful!"}]}, {"id": "2193962447669500", "text": "Has anyone used an esim card for data in Italy? How does it work?", "link": "facebook.com/groups/1373361046396315/permalink/2193962447669500/", "likes": 0, "comments": [{"username": "Don Bussolari", "comment_text": "How does it work in regards to what? Install it at home and activate it there. Have used them in France and Scandinavia. I used Airalo for the eSIM."}]}, {"id": "2193970554335356", "text": "Hello everyone. We will be in Cinque Terra in early Sept. What is the best beach?", "link": "facebook.com/groups/1373361046396315/permalink/2193970554335356/", "likes": 4, "comments": [{"username": "Lisa Camarda", "comment_text": "Monterosso near the end where Neptune-The Statua del Giante stands looking out toward the ocean. The water was absolutely beautiful and not rocky. Swimming there was one more highlight of our trip!"}, {"username": "Lorena Kinkela", "comment_text": "Monterosso"}, {"username": "Ken Lerch", "comment_text": "If you are staying In a hotel Monterosso, check if the hotel has private privileges at the private beaches in either old or new town."}, {"username": "Joe Ascenzi Ascenzi", "comment_text": "Monterosso"}, {"username": "Peggy Young", "comment_text": "We are staying en La Spezia"}, {"username": "Julia Muller", "comment_text": "Monterosso has the biggest and calmest beach and is beautiful for a day of R&R if you’ve done the hike between all five villages the day before! We have enjoyed Vernazza’s small beach too - more waves and a bit of fun of you’re travelling with older kids 👌"}, {"username": "Melissa Santos", "comment_text": "Staying at Hotel Villa Steno in early September!"}]}, {"id": "2193971251001953", "text": "Hello. First time on the site. Looking forward to advice.\nWe are coming from Vancouver, Canada. We are seniors!\nMy husband and I are hoping to see Milan in 2024. We have seen Rome,Florence and Pisa a few years ago.\nAny advice on Milan would be great .. hotels, restaurants and of course museums and architecture! How long should we stay in Milan to enjoy ? What another cities should we see close by? Would we need to fly or train to other areas?\nThank you so much in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2193971251001953/", "likes": 3, "comments": [{"username": "Rita Levi Montalbano", "comment_text": "Surely you have to go above the roof of the Duomo, there are very cheap tickets that allow you to go up. Near the duomo, after visiting the Galleria and Piazza della Scala (they are really close to eachothers) you can eat a great and authentic pizza from \"Piz milano\". Another thing to do absolutely is an aperitif on the navigli, try looking at \"La Vineria\". A macabre but interesting thing is the san bernardino ossuary. Milan is also great for shopping. If you reserve the tickets you can also see \"Ultima cena\" from Leonardo Da vinci. You can walk in the Sempione Park that brings you in the stunning Castello Sforzesco.\nNearby cities in which to make daily stops can be monza, bergamo, mantua, the lakes (como, lecco, iseo) or you can go to the high mountains (alps) with a couple of hours by car. you can also arrive in genoa in about 1 hour, to see a bit of the sea and the Cinque Terre."}, {"username": "Alice Engstrom", "comment_text": "The Last Supper by Da Vinci,, but go to Como aND STAY IN Vrfenna on htelake.. so wonderufl"}, {"username": "Karen Schmidt", "comment_text": "Hey…I’m in Maple Ridge!! Anyhow, the lake area and/or Venice should be a must when in that area ! Easy train rides from Milan."}, {"username": "Miyuki Kanno Paul", "comment_text": "If you can obtain a copy of Rick Steves Italy guidebook, please do so. It contains so much information that you will be able to get great ideas for your itinerary"}, {"username": "Ilaria Verda", "comment_text": "Hi great to hear you are coming to Milan! There are a lot of things to visit and do. I suggest you Duomo (take an aperitif on rinascente terrace, you will have a wonderful view of Duomo), la scala, buy in advance ticket for last supper, pinacoteca of Brera (paintings there are incredible) , Sant'Ambrogio, castello Sforzesco, city life, fondazione Prada.... Then move to close cities, don't miss Bergamo, Pavia with one of the older university of the world, Mantova and Como. You can also go to alps, try Bormio with roman terms still active or move to genoa"}, {"username": "Renee Rundle Stoneham", "comment_text": "We were just in Milan, it’s very different from Rome but has some fabulous sights and museums.\n\n2-3 full days, we were there 2.5 full days and it was enough. (Plus it was June so hot and crowded)\n\n1) The Duomo… wow it’s amazing, definitely get the tickets to the rooftop terraces. If going in summer get there as early as possible, it get hot up there! We went at 11am it wasn’t early enough!😂\n2) The Last Supper, it was just amazing to see it, right in situ, amazing that it survived.\nYou NEED to book tickets in advance online. They release them in 3 mo blocks and they sell out fast. I bought our Ms for June in March, right after booking flights.\n3) Civic Archaeological Museum, a fantastic museum that we just stumbled upon after going through The Church of San Maurizio al Monastero Maggiore- beautiful and a must see as well.\n4)Sfzora Castle, it’s huge and has a huge museum just full of everything! Paintings, furniture, statues, tapestries, musical instruments etc… so much!\n5) The Galleria Vittorio Emanuele II is just beautiful to walk through, it’s right next to the Duomo and was a great route to our hotel. Spin in the villa balls for luck!\n6)Navigli area- lots of restaurants along the canals. Big Apertivo place with lots of drink specials etc… ( we felt a bit old 😂 so strolled by) Had a very good dinner at The Smokehouse. (Not brisket as we are from TX..😂 but it smelled great!)\n\nIf you’re into high end shopping and designer goods… Milan is for you! I’m not, so all the Prada, LV stores etc were not on my list.\n(We’ve been to Florence on a previous trip and I loved all the leather stores there & bought my fill!😂)\n\nDefinitely visit Lake Como for a few days it’s an hour train ride to Varenna. We stayed 3 full days in Varenna and loved it! It was a great base to see sights around the Lake. The ferry system is a very easy way to get to other towns like Bellagio.\nWe also took the train to Bellano and walked through the gorge. Very nice and a reprieve from the crowds.\n\nWe also spent 2 days in Lake Maggiore, in Stresa before heading to Como & Milan. It was very nice and wayyy less crowded than Como. Isloa Bella and the Villa there was just beautiful and a great day on the lake!\n\nWe were going to do a day trip to Bergamo but decided to stay in Milan and see Sfzora Castle instead.\nVerona is also another place to go for a few days."}, {"username": "Helena O'Neill", "comment_text": "We're heading to Turin at end of August to visit friends. Haven't been before but it's meant to be stunning with loads to see and do, easy day trips and great food. It's just over an hour by train from Milan."}, {"username": "Jennifer Smith Tanouye", "comment_text": "Following"}, {"username": "Bev Madill", "comment_text": "If you visit Milan you could easily go to Lake Como (Varenna is great and easy to get to) or Lake Garda (Sirmione). Verona is an interesting city and about 1.5 hrs by train. Another idea would be Bologna. Food there is amazing. I hope you have a great time."}, {"username": "Matteo Gallizioli", "comment_text": "near to Milan there is my city BERGAMO, the old town, called \"città alta\" (high city) is beautifull"}]}, {"id": "2193973677668377", "text": "I'm going to the Amalfi Coast in October. My friend sends me reels daily from the areas where we are visiting,Capri,Positano,Sorrento etc which gets me super excited. I'm coming with a tour from Germany for 7 days. My question is,in the reels ,for example one from Positano it has all this colorful pottery displays with lemons and other prettyआणखी pottery for people to shop at along the winding road. Is that pottery super expensive? Can you find those places in the inner villages too,or are they only along the coastal area. I don't want to miss out on getting a few souvenirs. TIA.", "link": "facebook.com/groups/1373361046396315/permalink/2193973677668377/", "likes": 6, "comments": [{"username": "Clare Keddie", "comment_text": "The pottery shops are in all these places lemons everywhere. I didn’t think the pottery was that expensive but depends what you buy and where"}, {"username": "Carrie Du Bois", "comment_text": "The prices vary. I bought two pieces last year and I didn’t think the prices were that bad. I didn’t have room in my suitcase, so the shipping charges were outrageous. I purchased my items in Amalfi. We went back to Italy again a few weeks ago. We were not on the Amalfi Coast and I only saw the lemon pottery in Sicily. I should have bought another piece there but didn’t. I was disappointed because I wanted to buy more."}, {"username": "Judy Jamieson Pisano", "comment_text": "The best place to shop is Vietri sul Mare at the beginning of the peninsula. There is an entire street where the ceramics are made. We have items shipped to the US all the time"}, {"username": "Colleen Sommerin", "comment_text": "There is a huge variety of choice and quality. The souvenir shops are cheaper but still fine. You can find better quality in specialist galleries. We bought something unique in Ravello, it's cost about €150 for a bowl and two platters."}, {"username": "Vicki Susie Naab Gandolf", "comment_text": "I bought a lemon decorated olive oil bottle in Positano. It was very reasonable. Because it wasn’t that big I carried it in my luggage and they wrapped it very well so I could do that."}, {"username": "Leila Jane", "comment_text": "You will find lots of pottery places along the Amalfi Coast. The prices did not seem overly expensive to me. The problem comes in with how do you get it home safely? I bought several very small dishes (made for olive oil dipping bread into, I think?) with lemon painting on them and used those for little gifts to various people. I'll attach a picture of one of them. By the way, I sometimes see Italian painted pottery in HomeGoods for good prices as well."}, {"username": "Steve Grossman", "comment_text": "You can find them in Most town but they're more expensive In positano"}, {"username": "Jennifer Larese Taylor", "comment_text": "Pottery everywhere! Different regions, slightly different designs"}, {"username": "Ginger DiGalbo Katz", "comment_text": "All amalfi coast towns have beautiful pottery for sale. Esp w lemons"}, {"username": "Susan D Johnson", "comment_text": "I spent over 250 euros for a few pieces at Piccadilly Ceramics along the Amalfi Coast. For 35 euros they shipped everything to me in the United States. It was well worth that price. I received everything bubble wrapped and packaged in styrofoam. They are located along a winding road and are literally built into the side of a mountain! Beautiful ceramics!"}, {"username": "Suzanne Milani Agresta", "comment_text": "I bought 3 glass bottles of lemoncello and matching shot glasses-put them in my luggage-well padded with clothing! They were fine but I wrapped them in plastic bags in case they leaked"}, {"username": "Karol Muir", "comment_text": "I would take extra bubble wrap with you."}]}, {"id": "2193975267668218", "text": "Hii hi.\nHas anyone done the unspeakable of trying to travel Europe with 2-3 days per city? We have 5 weeks, and want to travel as much as Europe as possible, probably only stopping at 1 or 2 cities in aआणखी country, with a combination of train and flights. If you have, would you be willing to share your itinarary and mode of transport with me, please? If it includes costs and accomodations, that would be even better 😍\nWe have 5 weeks, so looking at a map and internet is fine - but hearing of people that have actually done it is much better ❤️\n\nI've highlighted the countries that we're interested in below. Looking at March and April 2024\nAny and all tips welcome for how to make this work. We hope to be back over the years to do a deep dive into individual cities- for now, we want to live out our childhood dream of experiencing all our favourite places\n\n❤️", "link": "facebook.com/groups/1373361046396315/permalink/2193975267668218/", "likes": 12, "comments": [{"username": "Juliet Lee", "comment_text": "I would suggest to get a real feel for a place you need to stay at least 3 nights otherwise you are travelling every other day - good luck - definitely look at trains as I think some count tries are offering cheap deals at present . Look at this pass for non eu travellers\n\nhttps://\nwww.eurail.com/\nen/eurail-passes"}, {"username": "Lori Sammons", "comment_text": "Yes, we have. We flew in to Munich stayed two days, drove to Switzerland stayed 2 days my kids went paragliding in Lucerne, drove back to Munich, went one day in Salzburg, stayed in Munich for another day and took train to Amsterdam, did a day trip to Belgium."}, {"username": "Manuela Teves", "comment_text": "You can’t forget to visit Portugal it’s beautiful and the food is amazing"}, {"username": "Starla Dawn", "comment_text": "I did but within Italy and it actually worked out awesome and didn't feel rushed somehow."}, {"username": "Julia Muller", "comment_text": "I always think you need at least 3-4 days to truly experience a city, rather than just ticking off a list. You can always go back another time to take in the places you miss on this trip. I’m of the thought do it properly or don’t do it at all 😊\nA lot of time is wasted travelling between places, it eats into your precious Europe enjoyment time!\nWe just did a bit of a whirlwind and have come home for a rest - 3nts Paris, 3nts Zurich, 3nts Venice, 4nts Bellagio, 8nts Monopoli, 2nts Milan on the way out. However, we have been to all of those places before (at least 2-3 times) aside from Monopoli, hence us spending longer there… plus we needed to flop at the coast after the initial travel frenzy!\nIf I were you I would block your travels into zones and just do short train trips btwn each stop (min 3nts) and save the further away countries for another time…"}, {"username": "Sarah Emerson Nelson", "comment_text": "I stayed at some great places in Belgium and the Netherlands. I will DM to my itinerary and you can see if it interests you. I preferred three per town, but did a lot of two only this summer."}, {"username": "Allison Stalenberg", "comment_text": "Following"}, {"username": "Joy Buenaflor", "comment_text": "The first time I went to Europe it was a 21 day tour starting in London. We were moving every 2-3 days. I lost count how many churches we visited. By the time we reached Rome, I was exhausted. Visited the Vatican, but skipped the tour of the City. I didn’t have to worry about hauling luggage or trying to catch a train/bus/\nflight, but it was exhausting. I went back to the cities I really enjoyed and game Rome another go.\nIt is doable and fun, but can get overwhelming. Good luck!"}, {"username": "Becky Nelson", "comment_text": "In 2018, my sister and I traveled to Europe for 5 weeks (she had to leave after 4 weeks) to visit 11 of my exchange students and two friends. I arranged all the travel plans for the most part. We flew most of the time (one way tickets), 3 trains, a bus, taxi and cars of exchange families. We visited 13 countries (Iceland, Sweden, Norway, Denmark, Germany, Poland, Italy, Switzerland, Austria, Lichtenstein, France, Amsterdam, and Ireland). I spent only 10 nights in a hotel and the rest of the time I was able to stay with my exchange students and their families. I spent the most time in Switzerland seeing 5 students but we moved around every 2-4 days. I have good recommendations\nfor hotel in Amsterdam, Kraków and Paris. Message me if you’d like that information on those or activities we did."}, {"username": "Yessica Romero", "comment_text": "Flew into Paris 1 day\nTook the train to to Switzerland 2 days\nThe flew to Rome 3 days\nThen flew back to Paris for one 1 day then to come back home from there. A little tired but will definitely be going back to Rome!"}, {"username": "Bill Elias", "comment_text": "https://\nyoutu.be/\n2pfd9OWR-Aw"}, {"username": "Maria Brozou", "comment_text": "It will be a nightmare to go from Greece to Montenegro. Fly first to Italy and either skip Montenegro or go from Italy."}, {"username": "Carrie Swanson", "comment_text": "I did it a few years back and really regretted it."}, {"username": "Pietro Di Sorbo", "comment_text": "I would suggest you don't skip Spain."}, {"username": "Sarge Pauline", "comment_text": "Just keep in mind that of course part or all of the day between places is taken up by travel. We have made that mistake in the past so your 2 nights somewhere is actually only a day… Maybe look at what there is to do that you want to see/do in each place and work from there to time in each location?"}, {"username": "Denn Ruiz", "comment_text": "Bayern is the best part of Germany and is not far away from Wien. Königssee is a must and also Neuschwanstein castle. From there you can drive to Prague, to Wien, Italy."}, {"username": "Kanika Thet", "comment_text": "I’ve done 10 cities, 6 countries in 2 weeks back in summer 2019. It’s doable because transportation between cities/\ncountries are very easy and affordable in Europe.\n\nTrain London to Paris\nTrain Paris to Brussels\nTrain Brussels to Amsterdam\nTrain from Amsterdam to Cologne\nFly Cologne to Munich\nFly Munich to Venice, Italy\nTrain Venice to Milan\nTrain Milan to Rome\nFly Rome to Athens\nFly Athens to Santorini\nAnd then Fly Santorini to London.\n\nI’ve done quite a few other routes like 4 East Europe Countries in 1 week…\n\nMy only tip for something like this is to travel light or choose a central location and go for day trips to nearby cities/\ncountries."}, {"username": "Wendy Linklater", "comment_text": "I would use the trains as much as possible, don't have to worry about weight/size of baggage, don't have to stress about getting to airport, trains are rarely delayed like planes are."}, {"username": "Brooke Heneghan", "comment_text": "I’m currently doing northern Italy across a previous of two weeks x based in Verona for three nights and travelling to Venice for a day then milan and Como for a day too x we are then going Bologna for two nights and heading to Parma and Modena for a day trip and then going to do Rome x in regards to Belgium- we based ourselves in Brussels for two nights and paid for a tour to Ghent and Bruges (I think it was like 40-50 each for the entire day with activities and transport) x we also did Prague (HIGHLY recommend two nights staying solely in Prague) and also cologne in Germany- you only really need a day for cologne so if you wanted u could easily do a day trip there!! Hope this helps x also, u can get the Eurostar from London to Paris in just over an hour I think? Xx"}, {"username": "Jekaterina Valujeva", "comment_text": "You have to use a cruise ship for Europe 🙂"}, {"username": "Claire Lewis", "comment_text": "With 5 weeks pick 5 countries and spend a little time exploring them."}, {"username": "Michelle Omirinde", "comment_text": "I love seeing as much as I can while on holidays. We are doing a world trip in March.\nArrive Rome 3 days\nTrain to Pisa then into Cinque Terre for the night\nOn to Venice stopping to see Florence on the way3 days\nThen to Milan 2 days then into Como and Luzern for the night\nOnto Murren in Switzerland for 2 nights\nParis for 4 nights\nLondon for 4 nights\nThen off to the USA.\n\nMy family are not art or history buffs, so are just wanting to take a look at the cities and eat the wonderful food and see the different cultures. We are heading to the Vatican, but besides that, we are not worried about churches. We want to see the Mona Lisa and they are our main ‘must do’s’. The rest is just looking and marvelling at the beauty of Europe. We are so excited!! I’ve been before to Europe, but my family hasn’t."}, {"username": "Jennifer Larese Taylor", "comment_text": "You could easily fly into the UK and spend time in London. From there you can do day trips to places like the Cotswolds, Stratford upon Avon, Oxford, Brighton, etc, depending what you want to see. From there you can take the Euro star (channel tunnel) to a variety of places in Europe. Based on your list, I would go to Brugges in Belgium. It’s a lovely walkable city, great to spend a long weekend. You can very likely get a train from Brussels on to the Netherlands. Again it depends what you want to see, but Amsterdam is full of culture but also different from Brugges. It’s also a great base for exploring further afield. You could then start working your way south to Italy via Germany. I don’t know Germany but Berlin, Cologne and the Black Forest are all interesting places to visit. Then you are just over the Alps into Italy"}, {"username": "Douglas Godesky", "comment_text": "I would drive it all. We typically do 900-1200 miles per country in 10 days, with 1 - 2 night stops in towns and cities we target."}, {"username": "Claudia Amp", "comment_text": "In Belgium I recommend Antwerp, beautiful city and then go on to check the Flanders."}, {"username": "Michel Vansieleghem", "comment_text": "If you go to Belgium, go for Brugges. I could help you out..."}, {"username": "Julie Baskcomb", "comment_text": "F"}, {"username": "David Solo", "comment_text": "Why?"}, {"username": "Dessislava Kozovska", "comment_text": "It's doable, depends on what you want to do in every city, but absolutely doable!\nI can gelo with Bulgaria if needed as that's where I'm from.\nTip: if you can, choose a city that would be somewhere in the middle of your trip and spend an extra 2 days there to recharge 🤗"}, {"username": "Elle Verga Francisco", "comment_text": "We've been doing this. We usually travel to EU for a month, and then stay for about 3-4 days in a city. Since we travel as a family of 6, we get transport services which almost costs the same as riding trains. Have done Spain - France - Italy. But just a headsup, nothing beats staying in a city for long and soaking up the culture and taking everything slowly, just as most Italians do 💖"}, {"username": "Michelle Casillas", "comment_text": "We’ve done 2 separate road trips covering 5-6 countries each time. Feel free to PM me. I will help as much as I can."}, {"username": "Lora de Vries", "comment_text": "Slight correction to your list. London is a city not a country. We have visited most of the countries, but flew and drove."}, {"username": "Steph Haggarty", "comment_text": "Yes! I’ve done both slow and speedy travel through Europe and thoroughly enjoyed both.\n\nLast time we focused on the French Rivieria and Spain, with quick stops in Monaco and Italy. This year it’s France and Northern Italy.\n\nEarlier this year traveled to Denmark and Sweden (quick city break) and highly recommend both."}, {"username": "Sarah Lowe", "comment_text": "In 2018 I spent 4 weeks backpacking across Europe staying 2-3 nights in each city. I got a Eurail pass and planned trains in advance to save $. I flew into Paris,\nTrain to Amsterdam\nTrain to Berlin\nTrain to Prague\nTrain to Vienna\nOvernight train to Venice\nTrain to nice with day trip in Milan, day trip to Monaco\nFlew to Barcelona\nThen flew back to Paris and home.\nI had the most memorable time and never felt rushed. I stayed in cheap accommodations,\nhostels and airbnbs, as that made sense for me at the time.\nThe longest train was overnight to Venice and wasn’t horrible but was definitely not comfortable."}, {"username": "Gillian O'Callaghan", "comment_text": "Yep ....90 days in Schengen plus 40 days in UK and about to head from London to NY....having a blast."}, {"username": "Anna Kirimova", "comment_text": "for the first time i see someone adding Bulgaria (my country) to their list"}, {"username": "Vladi Frost", "comment_text": "Silly and pointless comment from me..just hate to see Czech Republic called Czechia 🙈 I'm sure you will have a great time wherever you visit!"}, {"username": "Danielle Ritchie", "comment_text": "I did London then Eurostar/\nchannel tunnel to Paris, then train to Brussels then train to Amsterdam, used Trainline app for trains spent 2 or 3 days each place 🙂"}, {"username": "Sam Mah", "comment_text": "Don't forget to consider a Eurail pass if you're going to use a lot of rail."}, {"username": "Megan Dow", "comment_text": "We did London, Venice Florence and Rome in ~12 days and it bordered on being too many for us in that amount of time. Everybody is different but in my opinion that is way too much travel in 5 weeks. I would cut down that list and prioritize"}, {"username": "Lyn Wise", "comment_text": "Yep, doing it now. Did the first 4 countries of my trip in 10 days"}, {"username": "Rachel Michelle", "comment_text": "I like Spain 🇪🇸 the best"}, {"username": "Gwen Cooke", "comment_text": "I think it’s very doable… we live in uk and every couple of months my son and I have a mini adventure to a European city staying 1-2 nights … flights can be very cheap across Europe ( if you buy them at the right time and right company …) you can get £40 return flights from UK to Venice … we once got £5 return flights to budapest ( genuinely don’t know how that happened but … it did !) … have a great time and happy travels 😊"}, {"username": "Oksana Yarosh", "comment_text": "Yes, university students in my circle do this often. A friend's granddaughter did 2 days per city for 4 months."}, {"username": "Andrea Marie", "comment_text": "Yes, check out the Eurail website. It has suggested itineraries and trip planning tools."}, {"username": "Alexandra A Welker", "comment_text": "Yep, we did Athens, Santorini, Rome, Florence, Venice, Bologna (1 night) then back to Rome for our plane to London (in that order) for 2.5 weeks total. I bought separate airfare tickets except for in Italy, we took the fast train.\nI also did a tour we travelled starting from Amsterdam, Paris, Black Forest, Luzern, Geneva, Cannes/Nice, Barcelona, and Madrid 2.5weeks as well. So definitely doable with the time you have (5weeks), you can see as many places but my suggestion is to stay at least 3 nights in each city."}, {"username": "Kristian Strebør", "comment_text": "I have tried this and enjoyed it but for many of the places on your list the city is not the best thing and oftentimes seeing the capital skews your experience of the nation. For example, London is amazing but it’s not like the rest of the UK or even England.\nI would combine the cities with other amazing places. See less but see more!\nHere’s some examples\nUK - Scottish Highlands\nFrance - Alps\nItaly - Cinque Terre\nAnd most importantly, Norway! Oslo is a nice city but Norway is all about the western fjords, the mountains and the Lofoten Islands.\nHappy travels!"}, {"username": "Francesca Liz", "comment_text": "My daughter is going from the top of Italy to the bottom and going up Greece to the isles and then flying home!! 6 weeks !! She’s 25 and has it all planned already!!"}, {"username": "Daphne", "comment_text": "great that you are going to explore Europe. I live in the Netherlands. and would make the trip different. I would start in the Netherlands, visit Amsterdam and possibly visit another city like Utrecht or Volendam. then you could take the train to Germany, to Cologne, Düsseldorf is also close by. Or you Will start in Germany Berlin to Cologne. there are night trains to Switzerland and here many beautiful places to visit. then you could continue towards Italy, Milan, Venice, Lake Garda, Rimini, Florence or Rome. in any case, have fun"}, {"username": "Sara Zangenberg", "comment_text": "We just did a 15 day road trip stopping for 1-2 nights at each city. We hit 6 countries and 8 cities in 15 days. It was a lot and even though we saw many different places I would have much rather taken a few more days at fewer places than raced through our stops."}]}, {"id": "2193976147668130", "text": "I'm looking to get 4 of my grandchildren soccer shirts. Going to Rome first stop. Any help would be appreciated. Ciao", "link": "facebook.com/groups/1373361046396315/permalink/2193976147668130/", "likes": 3, "comments": [{"username": "Liisa M. Valo", "comment_text": "Where you going after Rome?\nBut if it has to be a Roma ones there’s an AS Roma store at Piazza Colonna and just over the Garibaldi bridge to Trastevere on the right there’s Trastevere Calcio store."}, {"username": "Louise Desnoyers", "comment_text": "The specialized stores sell them but they are very expensive ( 50-100€). Every time I go to Italy I buy some. Most of the time I found them at a reasonable price ( 10-20 €) in local market. They are not high quality as the ones sold in sports stores but average quality that lasts enough time (3-5 years) to be worn by my grandsons!\nEnjoy your trip!"}, {"username": "Adriana Rodriguez-Argueta", "comment_text": "If you stop in Venice you can find the official Venezia FC stores; one in Mestre and 2 in Venice.\n\nhttps://\nshop.veneziafc.i\nt/"}, {"username": "Danilo Esse", "comment_text": "As ROMA STORE VIA DEL CORSO"}, {"username": "Andrew Raymond Lynch", "comment_text": "The Rome soccer team has a store in due town Rome. Perfect for what you want."}, {"username": "Jennifer Smith", "comment_text": "You will find them in many of the gift shops"}, {"username": "Cherie Horne Duda", "comment_text": "There is a store two train stops from the colesium that also will customize while you wait"}, {"username": "TJ Williams", "comment_text": "Roma has many team stores in the city and at the stadio olimpico. Lazio also has a a few stores in the city and at the stadio."}, {"username": "Mary Anne", "comment_text": "If you are going to Naples every second market stall has the ones celebrating Naples win this year."}, {"username": "Bev Fisher", "comment_text": "…but don’t ask for soccer shirts! 😉 They’re football shirts!\nEnjoy your trip!"}, {"username": "Miyuki Kanno Paul", "comment_text": "There is an official store right in front of a government building in Roma if I remember correctly"}, {"username": "Giovanni Pianigiani", "comment_text": "https://\nwww.sslazio.it/\nit/club/\nofficial-store\n\nhttps://\nstore.asroma.com\n/"}, {"username": "Marco Campoli", "comment_text": "Forza lazio"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2193979157667829", "text": "Hello! I am traveling to Italy (2 weeks north and 6 days south). Does this itinerary for 6 days in Puglia sound good, or should I replace a specific town with a different town? (I love villages/towns and not cities).\nPlease keep in mind I will be traveling *solo without a car*, so I am relying 100% on public transportation. If there are no busesआणखी from place to place, please let me know, because I am not so sure!\nI land in Bologna, then might take a flight to Brindisi.\nBrindisi --> Ostuni --> Alberobello --> Monopoli --> Polignano a mare --> Bari (then a flight back to Bologna)\n\nIf you have any other suggestions, I'm open to hearing them!\nThanks in advance 😊", "link": "facebook.com/groups/1373361046396315/permalink/2193979157667829/", "likes": 2, "comments": [{"username": "Pietro Di Sorbo", "comment_text": "Consider Puglia is better enjoyable from June to September because the hot weather lets enjoy the very nice beaches too.\nYour path is good, I would suggest to add Otranto and Matera (even if is not in Puglia but not so far}.\nAnother Puglia area very nice is the Gargano and its loveable coast towns with nice beaches, Vieste, Peschici, Rodi Garganico, but maybe you need more time."}]}, {"id": "2193980831000995", "text": "Opinions and recommendations on boat tours Sorrento to Capri and Sorrento to positano", "link": "facebook.com/groups/1373361046396315/permalink/2193980831000995/", "likes": 107, "comments": [{"username": "Karen Sailer DeVries", "comment_text": "We used youknowboat semi-private boat from Sorrento to Capri/AnaCapri in early April. Only 8 of us total. Captain was great. Went into Blue Grotto and green grotto."}, {"username": "Jan Pab", "comment_text": "Lubrense Boats"}, {"username": "Anna Buchan", "comment_text": "Sorrento to capri you know boat.com"}, {"username": "Sarina Santino Rohloff", "comment_text": "We used sorrentovibes last week and it was perfect! I highly recommend them. They did a custom quote for us and we used them fir everything we did while we were in Sorrento."}, {"username": "Lisa Lorentz", "comment_text": "F"}, {"username": "Mona Ben M'rad", "comment_text": "I did a day tour castellamare di stabia-positano\n2h free time, too short-amalfi 2h30 free time great for only one visit: the amazing cathedral and then it was possible to stop by sorrento and return alone to your hotel or go back to castellamare. We had a shuttle picking us up initially and at the end of the day. 55 euros/adult and 50 for a kid."}, {"username": "Russ Whitley", "comment_text": "If you want to go to Grotto on Capri or around island find a private boat. It’s a bit of a zoo in there at times."}, {"username": "Daniel Michael", "comment_text": "Fear is not real. It is a product of your thought you create. Do not misunderstand me. It is very real but fear is a choice. All I’m trying to say is with you need not to fear about losing your money, you can only lose it somewhere else but not with sir Luke Donald"}, {"username": "Diane Gustafson", "comment_text": "Sorrento and Capri the best. Stay a couple of nights in Capri and enjoy exploring!"}, {"username": "Elizabeth Bernal Bain", "comment_text": "Can you do capri and positano in the same day or would you need a whole day for capri and then a whole day in Sorrento. I’m thinking of doing a home base in Sorrento and day tripping to the best sites in the area: amalfi coast, capri, Naples, Pompeii"}, {"username": "Rebecca Davies", "comment_text": "Following"}, {"username": "Antonio Aloè", "comment_text": "Google..."}, {"username": "Marie-Louise Harrison", "comment_text": "F"}, {"username": "Donna Gutridge", "comment_text": "I would recommend asking if the weather is bad that day if they would still go out if the tour was a big tour company?"}, {"username": "Donna Gutridge", "comment_text": "I say. this because I was there with Perillo and we went out to Capri amazing"}, {"username": "Donna Gutridge", "comment_text": "Sorry 2 weeks later we went out with a tour company and it was the titanic!! If the water is rough dont go!"}, {"username": "Craig Rickards", "comment_text": "Gerri Tronc"}, {"username": "Jodi Thornton Lindsey", "comment_text": "F"}, {"username": "Sarah Bird", "comment_text": "Following I go august"}, {"username": "Anne Marie Shepherd", "comment_text": "Lauren Cooley McCullough"}, {"username": "Keith Bourget", "comment_text": "Pgd"}, {"username": "Sandy Michelle Duggan", "comment_text": "best trip I did was sorrento to Capri, 8 hours, bloody amazing."}, {"username": "Lori Johnson Hilton", "comment_text": "If you go to Capri for the day (and I'd suggest at least four days) immediately take the funicular to upper Capri town (which is \"in the middle\") and/ or an open-top taxi up to Anacapri. Anacapri is stunning and amazing discoveries are around almost every corner. I see so many tourists spending their day by the pier, which a crowded mess. The beauty, food and essence of Capri is all UP. And of course from Anacapri take the ski lift to the tippy top. Better yet, spend a week 😉"}, {"username": "Valerie Coffey", "comment_text": "F"}, {"username": "Hakeem Khalil Raza Atari", "comment_text": "نسخہ\n1: نفس میں سختی کا بلکل نا ہونا\n2: مشت زنی کی وجہ سے نفس کا سائز چھوٹا ہوجانا\n3: اگر کبھی سختی آگئی تو چند سیکنڈ میں فارغ ہوجانا\n4: بچہ پیدا کرنے کے قابل نا رہنا\n5: اگر سختی بھی آتی کو مگر ٹائمنگ کا زیرو ہونا\n6: وریکوسیل یعنی خون نا نفس تک نا جانا جس سے سختی تناؤ اور سائز چھوٹا ہوجاتا ہے اور بندہ بیوی کو مطمئن نہیں کر سکتا\n7: سپرمز کا نا مکمل ہونا سیکس کا خیال آتے یا کوئی فلم دیکھتے قطرے آنا،\nاپنے ہاتھ سے نفس کو رگڑنا اور منی نکالنا، بدفعلی کی وجہ سے نفس میں سختی کا نا ہونا، ٹیرھا پن، اور نفس کا بے حد کمزور ہونا۔مباشرت کے بعد کپکپی طاری ہونا،ایک دفعہ ہمبستری کرنے کے بعدوبارہ تیار نہ ہونا,ایک ہفتہ تک جسم تیار نہ ہونا مباشرت کیلئے۔جنسی کمزوری کی علامت ہے،مردانہ کمزوری اور عضوءخاص میں جوش. تناؤ . سختی میں کمی کا شکار ہونا،ہر وقت تھکاوٹ رہنا چلنے سے پنڈلیوں میں درد رہنا،پہلے دن عضو خاص سخت لوہے کی طرح سختی انتشار فل کیپسول بھر لیں ، 40 سال سے کم عمر لوگوں کو ایک خوراک رات کھانے کے بعد دودھ نیم گرم سے دیں اور *40 سال* سے اوپر کے لوگوں کو صبح و شام کھانے کے بعد دودھ نیم گرم سے دیں\nکیپسول کے استعمال سے ٹائمنگ *30سے 50 منٹ* اور سختی برداشت سے باہر ہوگی نفس کی لمبائی اور موٹائی میں فرق واضح نظر آئے گا نفس کا ٹیڑھا پن ، رگوں کا اُبھرا ہوا ہونا ، رگوں کا نظر انا ، اور نفس کی رگوں اور پٹھوں کو مضبوط کرتا ہے جس سے بہت زیادہ سختی آتی ہے انسان عورت کے بغیر نہیں رہ سکتی ٹائمنگ جتنی زیادہ ہو گی آپ کا پارٹنر اس سے لازمی خوش ہو گا عورت کے لئے اصل چیز منزل حاصل کرنا وہ چاہے اس لذت کو بھر پور طاقت اور لوہے کی طرح سخت ٹائمنگ ہونی چاہئے اس کے بھی احساسات جذبات ہیں وہ کیا چاہتی ہے کیسے چاہتی ہے جس طرح آپ چاہتے وہ بھی اسی طرح چاہتی ہے اور آپ اپنے ان قیمتی لمحات کو اپنی شریک حیات کے ساتھ صحیح معنوں میں انجوائے کریں گے\n\n\n*14 دن میں نامرد کو بھی مرد کامل بنا دے گا*\n40 din course\n\n*آرڈر بکنگ کے لیے واٹس ایپ نمبر پر رابطہ کریں* *\n03186400846"}, {"username": "Tegan Leaf", "comment_text": "This one takes you everywhere. The ferries are 10 euro"}, {"username": "Mary Marzacco Krzykowski", "comment_text": "Used a travel agent right a few doors down from Hotel Michelangelo in the city center. $55 Euros for a boat to Capri & bus to Ana Capri. $55. Euros for a boat to Amalfi & Positano all day trips for both."}, {"username": "Joanne G. Connolly", "comment_text": "Going by ferry is cheap and convenient."}, {"username": "MaiLing M Matthews", "comment_text": "Highly recommend Positano Charter from Positano for private boat needs"}, {"username": "Lisa Nicoletta", "comment_text": "Spend your time discovering Sorrento instead...so many great restaurants and shops not to mention so much more reasonably priced. Spent so much $$ on Capri and I wish I hadnt...."}, {"username": "Barbara Brosnan", "comment_text": "We used Joe Bananas and they were great"}, {"username": "Debbie Colacicco", "comment_text": "Luxury Boat Hire Positano"}, {"username": "Lucrezia Folger", "comment_text": "Sorrento to Ischia. Forget Capri, it's overpriced, & overcrowded."}, {"username": "Navreen Mandair", "comment_text": "Get your guide"}, {"username": "Shannae Lee Jasper", "comment_text": "F"}, {"username": "Kate Douchkov", "comment_text": "Check out Capitano Ago - we did both the Capri and Amalfi full day trips, both were excellent days out. https://\nwww.capitanoago.\ncom/\ngroup-excursions"}, {"username": "Kate Piszczek", "comment_text": "Ferry"}, {"username": "Marissa De Jager", "comment_text": "*"}, {"username": "Denise Tenn", "comment_text": "We just took the ferry day trips from Sorrento - really great - we went in May though so not too crowded!"}, {"username": "Kay Rendall", "comment_text": "Sorrento to Positano. Local ferry. In fact ferry to Capri stops in Positano 1st. Wander the small streets, walk the path to the left as u exit the ferry, for great views, a restaurant on the cliff, perhaps for a drink. If u follow to the end u will be at Fornilla Beach. All beaches in Positano r black sand\nCall in to the local church up the stairs to the square just ti the right from ferry stop to see Black Madonna. Walk up all the stairs to town square. Catch the local orange bus, tickets at bar opposite that goes round in circle around mountain top and back down perhaps ask driver for International bar stop and then slowly meander your way down the mountain taking in the houses above and below, the incredible views that make Positano magic\nSeveral restaurants on the way for a drink. Not necessarily with a view, but friendly, reasonable. I luv the 1 part way down after the after the Fontanio. A fountain with a crib.\nThat has tables, umbrellas on the left as u walk down. Lovely light pizzas to share and food for lunch .\nOften eat dinner here I will be in Positano in September for 3 weeks 9th visit if u waiting for Ferrybti return, walk down to the beach, Go to Chez Black to have a drink, cocktail, watch the world gi by, or walk up to the left almost to the end beach, a lovely leafy cool place with tables, reasonable.\nOf course u can do Walk of the Gods, cooking classes etc if u wish. But my suggestions r to explore the real Positano om a budget."}, {"username": "Anne Mc Namara", "comment_text": "We booked a tour to Capri and another to Almafi and Positano. Capri was amazing but my advice don't get the private tour bus when you get there. You are left in Anacapri for 3 hours where there is nothing to do and have less time in Capri town. Get the Funicular from the harbor to Capri town and enjoy the town and the harbor area. Lots to see and do. The boat trip to Almafi and Positano was lovely but didn't have enough time in Positano.If I was going back again I'd get the bus from the train station in Sorrento to Positano and spend the day there.We also got the Train from Sorrento to Pompeii. I loved Sorrento and can't wait to go back"}, {"username": "Jolie Lubitz-Centazzo", "comment_text": "We did a full day boat tour with SalBoat. From Sorrento to Positano (2hrs free time) served lunch on board drinks included, Amalfi (2hrs free time), swim time, limoncello, then back to Sorrento. Approx 9am-5pm. AMAZING DAY!!"}, {"username": "Tiffany Williams", "comment_text": "Sorrento is our favorite place in Italy💗 we took a boat tour from Sorrento out of Marina Grande..Ill post a picture lol we went from Sorrento to Capri and had the best time!! Memories I'll never forget"}, {"username": "Tiffany Williams", "comment_text": "Tiffany Williams"}, {"username": "Tiffany Williams", "comment_text": "Tiffany Williams"}, {"username": "Nancy Brennan Carrow", "comment_text": "We used Rick Steves recommended Mondiguide.it. We did a boat tour of Capri w/blue grotto & 4 hrs in Capri w/snacks & drinks. Next day, 6 person shared minivan tour of Amalfi Coast. We had an hour in Positano, 1.5 hrs in Amalfi & 1.5 hrs in Ravello. Totally recommend both!"}, {"username": "Lauren Marie", "comment_text": "Donna McGeehan"}, {"username": "Ann Whalen", "comment_text": "@bluestarposita\nnu"}, {"username": "Monica Roman-Fazio", "comment_text": "I did both just came back home Friday. The boat tour for capri was great. The one for positano I don't think it was worth it it was the same thing but different places"}, {"username": "Lisa Sie Mamola", "comment_text": "We had the best time with the one and only female captain, Valeria. It’s a private boat, rented for 3 hours and she will take you wherever you want! Let me know if you want her info….."}, {"username": "Cynthia McDonald", "comment_text": "We grabbed the ferry from sorrento to Amalfi. Stayed a few days. Then took the ferry to positano. While there did a day trip via ferry to Capri and grabbed a boat tour at the dock. Easy."}, {"username": "Sara Kyle Hargett", "comment_text": "Take the ferry"}, {"username": "Theresa Sorrentino Pagan", "comment_text": "I want to take a ferry to capri and go swimming. Where is the beat place to do that that’s close to the port. Don’t really care for an all day tour."}, {"username": "Nata Studenik", "comment_text": "We took the boat from Amalfi and stayed on Capri overnight. Should have stayed longer. Fantastic trip. In Positano we did the stairs around 600 or so. But we love walking from town to town. Stunning views."}, {"username": "Sonia Scotto Lubrano", "comment_text": "NOT gestour for literally anything You do in the Napoli area"}, {"username": "Rachael Richardson", "comment_text": "We just did the basic tour from sorrento €60 got a tour of the island first then dropped off , then got the bus to a Anacapri and back to Capri town the back to the boat set off 10am back for 6pm also included pick up at both ends dropped off at sorrento train station , available from most booking agents- bus on the island is €20 also separate to boat trip . Check the blue grotto as it was closed due to high tide"}, {"username": "Graham Sherlock", "comment_text": "Capri over Positano anyday"}, {"username": "Ashley Tardi-Salzo", "comment_text": "We are using Feeling Amalfi Coast for our boat tour from Sorrento to Capri!"}, {"username": "Jamie Vance", "comment_text": "Charter Villas with Captain Roberto Casa! Fabulous all-day experience! My son got engaged in his boat! Best experience ever!"}, {"username": "Marci Hulnick Ryan", "comment_text": "We really loved using YouKnow! Tour company for our small boat tours from Sorrento to both Capri on one day and Ischia & Procida another day! There were only 6 - 12 passengers on board each day, wonderful captains & skippers, great touring advice, we got to jump into the water and swim both days, even though the water was too rough to go into the blue grotto we were a small enough boat to go around the island and see many other grottos and sites, and the service overall was excellent! I would definitely use them again and highly recommended them! 🥰"}, {"username": "Anthony Campanella", "comment_text": "FerryHopper (dot) com\n\nWe did Salerno to Amalfi to Positano to Capri and back in one day."}]}, {"id": "2193981464334265", "text": "Any tips how to get to Florence from Rome? And also how to get to venice & Pisa from Florence?\n\nAny walking distance tourist attraction on Florence, Pisa & Venice", "link": "facebook.com/groups/1373361046396315/permalink/2193981464334265/", "likes": 1, "comments": [{"username": "Chantal Elliott", "comment_text": "Rome2rio app can guide you. I’ve used it a lot! It’s very useful."}, {"username": "Jessy Bee", "comment_text": "There's regular trains and bullet trains from Florence to Pisa, Venice to Rome etc.\nI highly recommend these apps to plan your activities and travel.\nThese apps are easy to navigate for timetables and tickets. Just ensure you look at the times and stops, you may find a super cheap ticket but it might be the longest line to get to your destination.\nAlso, the untold italy website and/or their podcast is great to giving away lots of hints and tips on where to go and what to see\nhttps://\nuntolditaly.com/"}]}, {"id": "2193984277667317", "text": "Ciao! We are heading to Italy this week and have gotten many tips from this page. We end our trip in Positano staying at Le Sirenuse. We have a day tripped planned to Capri, but now we’re wondering if we really want to bother. We are going on a boat to Nerano one day and a sunset cruise another day. I’m just not sure I want to spend a day in Capriआणखी and not using our “off day” to enjoy the pool and view at Le Sirenuse. I feel like we might be going to a lot of trouble to experience a similar setting. Does anyone that has stayed at Le Sirenuse have any insight? Appreciate all of you!", "link": "facebook.com/groups/1373361046396315/permalink/2193984277667317/", "likes": 10, "comments": [{"username": "Kimberly Lynne", "comment_text": "Based on reports of heat, crowds, and a lovely hotel…:enjoy the day at the hotel. And if you decide to go, catch a ferry."}, {"username": "Paula Brink", "comment_text": "If I were you I would just relax and enjoy your lovely surroundings at Le Sireneuse.\nI think Capri is most enjoyable when you stay there a couple of nights."}, {"username": "Leopoldo Conti", "comment_text": "Capri for half a day is a nonsense, I’d rather relax at Le Sireneuse, Capri it’s a hella of a tourist trap if you don’t know where to go"}, {"username": "Denise Poehls", "comment_text": "Go to Franco’s bar at the hotel for the exquisite cocktails at happy hour"}, {"username": "Sonia Scotto Lubrano", "comment_text": "Capri is so overrated (in my opinion)"}, {"username": "निनावी सहभागी", "comment_text": "I appreciate all of your input! Thank you!"}, {"username": "Jo Ann Schwartz Woodward", "comment_text": "We 💜Le Sirenuse and the restaurant is amazing. I love Capri for the museum, the shopping and different views."}, {"username": "Jill Wolder", "comment_text": "Relax and enjoy le sireneuse. Pool. Walk around positano. Perfect ending"}, {"username": "Robin Burrell", "comment_text": "I would absolutely spend the day at La Sireneuse. See the pool, relax on the patio with an aperitivo and watch the sea, then go have breakfast! Ha ha. And this isn’t from experience, although I would love to experience all that hotel has to offer"}, {"username": "Jennifer DeChiara", "comment_text": "Absolutely stay at your hotel. Capri is overrated. Le Sirenuse is not but it does cost a fortune."}, {"username": "Andrea Gattini Pennington", "comment_text": "I would consider going to Capri over Nerano. I loved taking the chairlift up to see the beautiful views, blue grotto, shopping. You can take a ferry over for the day."}, {"username": "Jillian Moccio", "comment_text": "Skip Capri the other boat tours are enough. enjoy your hotel.. capri is pretty but the half day tour is not great maybe if you stay there different experience. Enjoy Positano and relax. Great hotel choice!"}, {"username": "Maria NoBa", "comment_text": "Your hotel looks amazing. I would stay there for sure. Capri is nice, but so is Positano."}, {"username": "Graham Sherlock", "comment_text": "If you're only there once go to Capri"}, {"username": "Debi Wood Swan", "comment_text": "I am now in Florence, having come from the coast. We went to Capri and while the views were gorgeous, I found it highly overrated. It is very hot here and a pool day sounds more relaxing!!!"}, {"username": "Kim Hudson", "comment_text": "We just left Positano. We did one day in Capri. The boat ride was wonderful but we could have skipped the island. It was very crowded and the heat made it a bit uncomfortable. A relaxing day at the pool would be much more refreshing."}, {"username": "Wendy Bevan", "comment_text": "Did Capri day trip , would love to stay a few night but if I had time to relax then I would relax"}, {"username": "Susan Lapinsohn", "comment_text": "Skip Capri. Crowded, HOT, and lots of designer shopping. Take in all you’ve experienced at La Sirenuse!"}]}, {"id": "2193985337667211", "text": "Hi, what is the difference between a “regular” collesium tour vs the underground tour? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2193985337667211/", "likes": 2, "comments": [{"username": "Sharon Williams Sellers", "comment_text": "The regular tour takes you on the upper part of the Colosseum. The underground tour would take you down below where the animals were held before they brought up ￼ to the main part of the Colosseum. It is fascinating, and I know you’ll love it."}, {"username": "Michele Campbell", "comment_text": "If you particularly want to do the underground tour research the company you book with. These tickets are limited and some companies sell you the tickets, don’t get enough issued to them and cancel your booking at the last minute, too late to rebook with anyone else. Happened to us a few weeks ago"}]}, {"id": "2193986421000436", "text": "Hi guys, this group was amazing for my Rome and Italy vacation. I was wondering if there is a similar group for Athens, Greece? It’s where I want to go next?", "link": "facebook.com/groups/1373361046396315/permalink/2193986421000436/", "likes": 1, "comments": [{"username": "Darcia Darcia", "comment_text": "Following"}, {"username": "Gillian O'Callaghan", "comment_text": "There is a fabulous (kind, positive, helpful) Greece Travel Planning group run by Sandy Papas."}]}, {"id": "2193986491000429", "text": "Needing recommendations for private transfer companies for a transfer from Vietri sul Mare-Amalfi to the Ravello, and back . TIA", "link": "facebook.com/groups/1373361046396315/permalink/2193986491000429/", "likes": 1, "comments": [{"username": "Barbara Brosnan", "comment_text": "We used Joe Bananas for many transfers in that area and they were phenomenal"}, {"username": "Sandy Radican Shikaly", "comment_text": "Amalfi Coast Transfers"}, {"username": "Dianne Radcliff", "comment_text": "GetTransfer.com"}, {"username": "Cettina Milioto", "comment_text": "Taxi Carmine tour Amalfi Coast ♥️♥️♥️"}]}, {"id": "2193987231000355", "text": "Beginning stages of trip planning for late August 2024.\n\nBest hotels in Rome, Venice, Florence and the Amalifi Coast.\n\nThanks in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2193987231000355/", "likes": 3, "comments": [{"username": "Courtney Larson Bryant", "comment_text": "Strongly recommend hotel with elevators and a/c- in Italy now and it is very hot!!"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Must you go in August?"}, {"username": "Sandy Radican Shikaly", "comment_text": "Hotel Brunelleschi in Florence and Grand Hotel La Favorita in Sorrento"}, {"username": "Jeff McLellan", "comment_text": "How long in each place? If more than a two nights recommend apartments instead."}, {"username": "Penny Bellofatto Westberry", "comment_text": "We enjoyed the W in Rome and Eden Roc in Positano."}, {"username": "Paula Brink", "comment_text": "25 Hour Firenze in Florence.\nNH Collection Roma Fori Imperioli in Rome or Hotel Raphael.\nHotel Mediterraneo in Sorrento was very nice but I see they have put their prices up to a ludicrous amount."}, {"username": "Felicia LoCascio Whitney", "comment_text": "There is a magnifying 🔎 at the top of this page. You will find that this exact question has 1000's of responses. It is a veritable font of Italy information. Have fun!"}, {"username": "Starla Dawn", "comment_text": "Hotel Barocco Rome Sauna and Spa Suite."}]}, {"id": "2193987717666973", "text": "Hello, just wondering, when buying train tickets, seniors, how was that verified?", "link": "facebook.com/groups/1373361046396315/permalink/2193987717666973/", "likes": 5, "comments": [{"username": "Debbie DiOssi", "comment_text": "Your ID or passport."}, {"username": "Pauline Brown", "comment_text": "I always thought you could only buy a senior reduced price ticket if you actually lived in Italy. Everyone else has to pay full price."}, {"username": "Jan Shelton Koprivnik", "comment_text": "F"}, {"username": "Kim Hunter Groop", "comment_text": "Never asked once when traveling by train. Maybe you need to look the part."}, {"username": "Dawn Canada", "comment_text": "Well my husband is senior age and I purchased the senior ticket for him. They didn’t verify the senior ticket, just that we had 5 tickets for everyone."}, {"username": "Pong Ac Ai", "comment_text": "Both seniors and 16 below have discounts"}, {"username": "Colleen Jennings", "comment_text": "Never been asked - age is 60 for a senior. Also discounts in museums, again never been asked for ID."}, {"username": "Neville Spargo", "comment_text": "Booked online , just asked for date of birth and never had it checked"}, {"username": "Kary LeBlanc", "comment_text": "Well legally you’re supposed to have your passport on you 🤷‍♂️"}, {"username": "Frank Hunt", "comment_text": "Trainline app, from memory there is a seniors option when enrolling."}, {"username": "Sheila Manganello Paul", "comment_text": "Colleen Manganello John Manganello Sam Manganello. We’re seniors"}, {"username": "Rip Lonergan", "comment_text": "I rode trains in Italy all summer as a senior last year, and was never asked to prove my age. That being said, I always have my passport nearby."}, {"username": "Jo Jo", "comment_text": "How old for senior ticket?"}]}, {"id": "2193987797666965", "text": "Hi! I’m currently studying abroad in Florence right now. I wanted to get a tattoo while I’m here to represent my time here. I wanted to know if anyone has ever gotten a tattoo in Florence. I am skeptical because it’s not my home country and want to make sure I go to a good place that will be safe. Thanks in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2193987797666965/", "likes": 5, "comments": [{"username": "Tatyana Garcia", "comment_text": "Research artists on Instagram, Italy has great artists! I actually travel there for my tattoos from the US 🙂"}, {"username": "Maria Laura Del Pace", "comment_text": "You should go to \"Ikonoclasta\": best experience ever with my tattoos, they are super chill and willing to take care of you, you can find them on Instagram and see with ur eyes their artworks! :) (It's also easy to go there on a bus, i think I took the 22 from Firenze Campo di Marte but I'm not sure, it's better if you check up on google maps)"}, {"username": "Alessia Zito", "comment_text": "Alessia Zito"}, {"username": "Carla Onofrio", "comment_text": "My husband and I got tattoos a few weeks ago in Florence at Florence Tattoo Studio. Very clean, professional, he was super nice and he did a great job! You probably need an appointment."}, {"username": "Debi McGrath", "comment_text": "I got one in Thailand and had no issues at all, pretty sure standards are much better in Italy. You’ll be fine."}, {"username": "Joe Kolf", "comment_text": "Seems to me she is just looking for a safe place to get a tattoo in Florence, I have no idea what that has to do with Africa. My daughter has tattoos, but she only uses one specific artist where we live in the USA."}, {"username": "Marni Sherwin Grove", "comment_text": "I don’t know if one in Florence, my friend just got one in Rome"}, {"username": "Serena Nena Melis", "comment_text": "Based in Florence"}, {"username": "Frederick Rühr", "comment_text": "I wouldn‘t put a bumper sticker on a Lamborghini, but I could at least peel it off. But that’s just me."}, {"username": "Maria Laura Del Pace", "comment_text": "You should also check Bad Brothers Tattoo, near Firenze Campo di Marte: they did plenty of tattoos as a \"souvenir\" from florence, such as monuments or stamps with a picture of the monument inside, and their artworks are pretty impressive"}]}, {"id": "2193991014333310", "text": "Hey traveling to Italy in a month with my family of 6. Wanted to see if anyone had contact for a private driver. Wanted to take a car from Florence to Cortina d ampezza. thanks in advance!!!", "link": "facebook.com/groups/1373361046396315/permalink/2193991014333310/", "likes": 0, "comments": [{"username": "Sigrid Cormier", "comment_text": "Google it. Lots of car/drivers for hire."}]}, {"id": "2193995154332896", "text": "Hello everyone,\n\nI’m headed to Italy with stops in Milan, Venice, cinque terre, and Lake Como. I need on advice on places to stay and restaurants. If you have names of guides I’d very much appreciate that too. Any other suggests are appreciated. Thank you in advance.\n\nPeace, Tim", "link": "facebook.com/groups/1373361046396315/permalink/2193995154332896/", "likes": 2, "comments": [{"username": "Merilice Finateri", "comment_text": "We stayed in La Spezia and trained it to Cinque Terre. Travel time was 4 to 7 minutes. Very easy."}, {"username": "Renae Larcus", "comment_text": "Lake Como stay in Varenna. Albergo Milano right on the water. 👍"}, {"username": "Trish Heymer", "comment_text": "I stayed in la Spezia at an amazing air bnb. We walked to the waterfront an got a bout tour to and from cinque Terre. It was great seeing all five towns from the water."}, {"username": "Georgia Shorland", "comment_text": "Hotel Florence in Bellagio was amazing for food, the view is incredible too! We booked 2 weeks in advance via email ☺️"}]}, {"id": "2194007790998299", "text": "For those traveling to certain European countries, please be safe and stay cool. I heard that certain tourist attractions are being closed due to the extreme heat.\n\n", "link": "facebook.com/groups/1373361046396315/permalink/2194007790998299/", "likes": 2, "comments": []}, {"id": "2194008990998179", "text": "Because of a gastro disease that I have, eating protein with carbs in the same meal is a big no no or I’ll be in pain for days. So, no sandwiches, pasta w/meat,etc. I generally stick to carb meals because it seems the best. Will I have a hard time finding things to eat on the menus of Italy? It is VERY hard finding things in the US! What are your suggestions to look for on an Italian menu? Carb meals means no meat, nuts, eggs, dairy. On occasion I’ll have cheese with a carb meal but I can’t make a habit of that.", "link": "facebook.com/groups/1373361046396315/permalink/2194008990998179/", "likes": 5, "comments": [{"username": "Larry M Murray", "comment_text": "Every menu I saw had a page dedicated to people with eating disorders."}, {"username": "Lisa Verney", "comment_text": "I've heard lots of places do vegan options so a vegan pasta would cover you as long as it had no nuts?"}, {"username": "Grace Shepherd", "comment_text": "Can get a simple tomato pasta most places, just ask for no cheese on top"}, {"username": "Wendy Harrison", "comment_text": "Pasta with olive oil, a little onion and garlic?"}, {"username": "Alessandro Battxi", "comment_text": "you have plenty of option. Italian cuisine is not just pasta and meat. You should check better the recipes we do have."}, {"username": "Judy Jamieson Pisano", "comment_text": "You might have an easier time getting protein and no carb meals. Most secundo patti dishes are meat or fish with veggies, no carbs."}, {"username": "Desiree Leyden Kuhnlein", "comment_text": "Very accommodating in restaurants…. Everyone I went to asked if you had allergies"}, {"username": "Kari Cooper", "comment_text": "Marinara pizza (doesn't have cheese but is amazing!).\nSpaghetti d'olio (olive oil, a few chili flakes, and the pasta) also amazing.\nSeafood/Meat as a Secondi is usually served by itself with no sides, so you won't need to worry about the carbs. And if you do get a side is usually veggies.\n\nKeeping the dairy out could be a little more difficult since cheese is life here, but it's possible."}, {"username": "Jos Recine", "comment_text": "Pasta con pomodorino (Pasta and little cherry tomatoes), pasta in bianco, spaghetti aglio e olio, rice and mushrooms, pappardelle con funghi (pasta and mushroom), cacio e pepe, pizza bianca, pizza marinara (with tomato), pizza Margherita, pasta e fagioli.., Italy is the carb Capitol of the world, lol"}, {"username": "Sandra Desmond", "comment_text": "Put castor oil % organic cold pressed hexane free in a brown glass bottle on your stomach wrap it their wraps or organic flannel or towel . I guarantee you it will help so much"}, {"username": "Iris Joan Price", "comment_text": "I found most restaurants were very accommodating of my particular dietary issues, and I found plenty to eat. This thread has some terrific suggestions for your particular concerns. Mangia, mangia! (Eat, eat!) and buon appetito!"}, {"username": "Paul N Marietta Dodson", "comment_text": "Not at all. Just don't order the pasta dishes with your proteins. They are all separated on the menus."}, {"username": "Jules Galloway", "comment_text": "Pasta with tomato based sauces (get a vegetarian option), pair it with a salad (ask for no cheese) or some veggie side dishes. Add some bread. Some pizza places have vegan and cheese free options. And most gelato places have dairy free sorbets, so you won’t miss out there either! Happy travels. 🍝"}, {"username": "Karen Le", "comment_text": "Pasta only?"}, {"username": "Barbara Bosche Bensinger", "comment_text": "Food is so much “cleaner” in Italy. I hope you can enjoy it!"}, {"username": "Pietro Adami", "comment_text": "Maybe “risotto” dishes can help? (Cooked rice, italian style, which may come with a variety of additions - different veggies, meat, fish, etc - and allow you some choice)"}, {"username": "Zucchero Candito Kandinsky", "comment_text": "It shouldn't be hard. If you tells us which cities you intend to visit, we can try to suggest regional dishes that may suit you."}, {"username": "Angela Gilmore", "comment_text": "You can easily have only carbs and avoid protein looking the section \"Primi piatti\" on the menu.\n\"Secondi piatti\" instead refers to dishes with meat or fish or dairy plus veggie.\n\nMoreover, you can opt for veggie dishes just to be sure that they are dairy free.\nAnd you can always explain your problem in the restaurant and the waiters will give you advices."}, {"username": "Mary Agozzino Derrick", "comment_text": "Depending where you are there are lots of fish options"}, {"username": "Janet Messanelli Bozzone", "comment_text": "Plenty of separate carb and meat options. Primi are mostly carbs and secondi mostly meat. You just have to watch the sauces for pasta but pomodoro is found on most menus."}, {"username": "Jenny Payne", "comment_text": "Ask for gluten free of vegan meals , most likely have to explain to them your problem 🌻"}, {"username": "Michelle Thorpe", "comment_text": "All food has protein. One cup of pasta has 8 grams of protein. Bananas have protein. Do you mean specifically you can’t eat meat ?"}, {"username": "Anne Davidson", "comment_text": "Eat pasta with vegetables. Most meat and chicken dishes are served without carbs or veg. You order sides"}, {"username": "Ann Lombardi-Perkins", "comment_text": "Pesto is your friend"}, {"username": "Leila Myftija", "comment_text": "Can you eat fish?"}, {"username": "Felicia Landis", "comment_text": "Julie Gayde Benden I have a rare auto immune that limits my eating any inflammatory foods it creates an allergic skin reaction it’s painful burns and itches. I ate whatever I wanted the first few days I reacted it was not fun, but I was there a month and enjoyed everything. The food is so much cleaner in Italy. I hope you can enjoy eating all the amazing foods. Example I can’t drink coffee here in the states but I sure enjoyed my daily expresso while there, tomatoes, breads bother me here but not in Italy I had bruschetta every day if not twice. Alcohol also is a reactor but I drank wine, wine, wine, Aperol spritz and limoncello. It makes me want to move there❤️🇮🇹wish you all the best"}]}, {"id": "2194011540997924", "text": "What tours/sights should I absolutely book before arriving in Rome to avoid cues/missing out?", "link": "facebook.com/groups/1373361046396315/permalink/2194011540997924/", "likes": 2, "comments": [{"username": "Marissa Diana", "comment_text": "7:30 am Vatican breakfast tour - book directly from their website"}, {"username": "Jeff Gentner EA", "comment_text": "As much as possible. Less stress and it gets you on a schedule and avoids disappointment.\nTry Walks of Italy for great walking tours."}]}, {"id": "2194012710997807", "text": "We're planning a few tours for our visit to Rome. What are the ways to get from St. Peter's Basilica to the Vatican Gardens other than walking the 20 min walk.", "link": "facebook.com/groups/1373361046396315/permalink/2194012710997807/", "likes": 4, "comments": [{"username": "Cynthia McDonald", "comment_text": "Subway"}, {"username": "Janet Messanelli Bozzone", "comment_text": "Uber or taxi"}, {"username": "Shen Min Chue", "comment_text": "You mentioned Vatican Gardens. The 1km walk along the perimeter wall starting from St. Peter's Square will bring you to the entrance of Vatican Museums not the Vatican Gardens. To gain access to the Vatican Gardens, you need to purchase combination tickets, available from official site, which combine the Gardens with the Museums. After you have purchased such tickets, present your booking documents, at the time indicated on the ticket, at the entrance of the museums to the staff. You will be directed internally to the gardens from the museums."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Uber."}, {"username": "Jan Armstrong", "comment_text": "We got Ubers for our last couple of days in Rome due to the heat. Worth every penny"}, {"username": "Kim Butler Oam", "comment_text": "My sister and her hubby were getting e scooters when ever they got tired 🫠"}]}, {"id": "2194013520997726", "text": "To this wonderful group, has anyone stayed at the Hotel Duomo Firenze? Thoughts.", "link": "facebook.com/groups/1373361046396315/permalink/2194013520997726/", "likes": 13, "comments": [{"username": "Mary B. Collins", "comment_text": "f"}, {"username": "Marie Barré", "comment_text": "We stayed there last year. Rooms were nice but small. The elevator is shared with the building so at times there was a wait because it too is small."}, {"username": "Cindy Sherrill", "comment_text": "Yes!!\nGreat location and rooftop bar!!!"}, {"username": "Blanca Gil", "comment_text": "Stayed in 2015 in a single room. It was a very small room, but the views and location were fantastic!"}, {"username": "Kristina Ruk", "comment_text": "Just dont forget about the romantic get up from the bells😀"}, {"username": "Nicole Beaumont", "comment_text": "Yes! Just stayed there last month. I had a room with a view too. I would definitely stay here again."}, {"username": "Gina Johannes", "comment_text": "We just left Florence, We stayed about 3 minutes away at Croce di Malta. It also has a rooftop with beautiful views. But bonus because it has a pool and it was 98 degrees there yesterday!"}, {"username": "Julie Norris", "comment_text": "I stayed there 15 years ago and loved it. That was a long time ago though"}, {"username": "Kayla Castilla", "comment_text": "We stayed there last year. Not a bad hotel overall. There's a tiny elevator you get to take to the hotel. It's the absolute perfect location outside the duomo!\n\nWe enjoyed it and would stay here again.\n\nIt's an older hotel - they still use actual keys and you have to drop it off at the desk and pick up when you come back."}, {"username": "Sonia Ramos", "comment_text": "Yes we just left last week and the view alone is worth it! Very welcoming staff and breakfast is amazing. I’d stay again!"}, {"username": "Louanne Peterson", "comment_text": "We stayed there many years ago. The views and location are amazing. The hotel is an older boutique hotel but it was very nice. We actually stayed there before our wedding in Florence and the hotel gave us a gift that we still have. They were very sweet."}, {"username": "Tiffany Williams", "comment_text": "We stayed there and had the BEST view of the Duomo..it was amazing. The continental breakfast was one of the best we had in Italy..there's also an amazing Cafe downstairs they had Pistachio cappuccinos omggg I wish I could have one. The Duomo bells ring early like 6am or 7am so you don't need to set an alarm lol if you want to sleep later you might want a hotel further away"}, {"username": "Tiffany Williams", "comment_text": "view from our room"}, {"username": "Pamela Heldenbrand", "comment_text": "We stayed here - great location but tired rooms - the walls in our room were stained and scraped and needed repainting."}, {"username": "निनावी सहभागी", "comment_text": "Thank you all for the insights!!! Very helpful!"}]}, {"id": "2194013690997709", "text": "How far in advance did y’all book your hotels? I will be in Italy for 13 days in March ‘24 and feel rushed to book. TIA", "link": "facebook.com/groups/1373361046396315/permalink/2194013690997709/", "likes": 18, "comments": [{"username": "Alice Dzimiera", "comment_text": "We booked 5 months out for Rome in June"}, {"username": "Shadeya Mellon", "comment_text": "I booked really early but made sure I could cancel if needed. Allowed me to lock in a good location and price but still have flexibility to change if I needed"}, {"username": "Sarah Dobrzykowski", "comment_text": "We booked most within the week of the trip (we had an apartment and so our trips were long weekends). It took more work to find something but it can be done."}, {"username": "Julia Muller", "comment_text": "We are last minute “let’s go to Europe” kind of people 🙈 which puts some stress into the equation, but you can always find something. For example, we just got home from a month’s travels and booked in March/April!! I know, we’re crazy…🤪"}, {"username": "Lovetta Jackson", "comment_text": "i’ve planned things a year in advance. its better than stressing out about it last minute"}, {"username": "Frank Knights", "comment_text": "I am finding that I can not book more than 366 days out. Looking at Como 9/24"}, {"username": "Dana Colantuono", "comment_text": "3 months"}, {"username": "Christine Lawson", "comment_text": "A year in advance"}, {"username": "Karen Espinoza", "comment_text": "I am already booking averting 8 months ahead."}, {"username": "Diane Pieri Adiliano", "comment_text": "We booked 10 months in advance"}, {"username": "Cindy Medina", "comment_text": "Has anyone stayed in any Marriott hotels in Rome, Florence or Venice? I have points but want to make sure it will be worth it."}, {"username": "Stephanie J Stevenson", "comment_text": "We always book a few days in advance as we go along. Maximum flexibility is key to our enjoyment."}, {"username": "Tiffany Hutchings", "comment_text": "The sooner the better. Definitely read hotel reviews as well."}, {"username": "Casarine Temple", "comment_text": "I booked everything when I bought my tickets in November for this September Italy trip."}, {"username": "Reagan Bramston", "comment_text": "Book airfares 1st. Travel into a southern airport, leave from a northern one , or vice versa. ( Or stay in north OR south) A travel agent can do this easily for you, giving you cheapest or various optional routes to choose from. Usually can only book 1 year out from your dates. Then decide on places to visit. Get travel books from your library, Rick Steves travel books are fabulous, look at cities on youtube. Download free Rom2rio app for distances between cities along with times, costs via train, buses, automobiles, ferries etc. 13nights means 12days, minus your arrival (jetlag) day & day of departure.... so 10 days only. Pick 2 or 3 areas, so maybe stay north or south. Enjoy your time. We usually stay 3-4 nights minimum in one spot, sometimes a week. But we are in our 60's & like to chill & pretend we are locals... plus have been before. We also travel 30 + hours from Australia, so stay 4-5 weeks. Everyone has different needs , tastes & travel restrictions. Hopefully you will go back for more visits."}, {"username": "Gail Penoro Tobias", "comment_text": "8 weeks out"}, {"username": "Carrie Swanson", "comment_text": "Already booked for may"}, {"username": "Starla Dawn", "comment_text": "1 month"}, {"username": "Lori Ann", "comment_text": "One month 🙂"}, {"username": "Rosemarie Furnari Cisluycis", "comment_text": "We booked air and hotels 9 months in advance. Glad I did because prices kept going up."}, {"username": "Annick Hupperetz", "comment_text": "A year in advance."}, {"username": "Rose Wolschlager Hinman", "comment_text": "I went October of last year, but I booked everything August of last year"}, {"username": "Janet Grego", "comment_text": "Rustalyn Hiner York Melissa Thomas Jackie Baxter Maddy Russell Raelyn Kirchhoff Debbie Cothern"}, {"username": "Nadia Ruta Wolf", "comment_text": "I'm booking now for my trip this September. Still getting great airbnbs."}, {"username": "Constance Lee", "comment_text": "I started planning 7 months out But booked things 3-4 months out."}, {"username": "Linnea Rand Andreasen", "comment_text": "Well I booked a few hours before 🙈 It is possible to find both hotels and Airbnbs with some hours notice. Sometimes it is cheaper being in last minute, sometimes it is not, so book when you feel the need to it, and you will for sure find a place to sleep!"}, {"username": "Renato Cinque", "comment_text": "I. Would book hotels as soon as possible cause hotels are going fast in Italy"}, {"username": "Liliana Voicu", "comment_text": "2 weeks lol"}, {"username": "Heidi Stokes", "comment_text": "I am booked already for April 2024."}, {"username": "Sarahlee Waugh-Jones", "comment_text": "2weeks for hotel and tours. Prices were still good. Booked flights about 2 months ahead. Plan's always change around here 😂🤷‍♀️. We leave this Friday ❤️❤️"}, {"username": "Georgia Shorland", "comment_text": "We booked 6 months in advance and very glad we did, when I checked 1 month out the prices for our exact dates had increased massively (for some places $500+ and we had a budget of $200pn) definitely book as early as possible! Gives you wiggle room to change dates if needed aswell."}, {"username": "Jenny Payne", "comment_text": "Earlier the better🌻"}, {"username": "Lisa Zarlingo Smith", "comment_text": "We're headed to Naples and Sicily next June and I have all my rooms reserved."}, {"username": "Janet Messanelli Bozzone", "comment_text": "I book a good REFUNDABLE deal as soon as I can find it. I tend to use Booking dot com. Select “free cancellation”. Spit happens."}, {"username": "Clay Gilmore", "comment_text": "I’ve booked hotels for next May. I got to pick locations, room types, etc. Allows time to concentrate on best tours and experiences to fill up relaxing two weeks."}, {"username": "Alessandro Battxi", "comment_text": "One or two weeks before, even last minute."}, {"username": "Nancy King", "comment_text": "9 months in advance for our hotels in Venice and Rome."}, {"username": "Pong Ac Ai", "comment_text": "2 months"}, {"username": "Alexandra A Welker", "comment_text": "You have time! I usually book 3-4 months but if I go and it's high season then I will book sooner like 5 months out."}, {"username": "Paige Montecalvo", "comment_text": "We booked our whole 33 day trip which was June 3-July6 this year, back in January"}, {"username": "Jason Hobel", "comment_text": "As soon as you can, and make sure they offer free cancelation too just in case."}, {"username": "Tracey Ragland Hester", "comment_text": "We went March 2023 and started booking October 2022."}, {"username": "Karen Schmidt", "comment_text": "Booking my trip for next May Airbnb’s now"}, {"username": "Kimberly MacKinnon Cherry", "comment_text": "We are going in March as well and plan to book accommodations ( we are going to stay in a hotel in Rome, and VRBO in Florence) and flight by next month."}, {"username": "Katherine Rogers", "comment_text": "We have already booked an hotel for Rome for September 2024. Wanted a specific hotel and the family room for 5 people."}, {"username": "Jenny Frank", "comment_text": "book now; and get today's prices; prices will go up a lot as you near"}, {"username": "Rachael Richardson", "comment_text": "Start booking now ! If you have a definite itinerary, make sure they are cancellable"}, {"username": "Phyllis Snyder", "comment_text": "I have already booked all 6 of my accommodations for my September October trip 2024. Even then some choices I looked at were taken. Book asp."}, {"username": "Greg Baker", "comment_text": "We are staying in Florence and Rome for Italy and we booked our reservations about 7-8 months out but really depends on where you’re going if it’s a higher tourist or attraction area the sooner the better usually speaking"}, {"username": "Sande Ricci", "comment_text": "Probably around 9-11 months in advance. We didn’t stay in hotels though. We rented VRBO and Airbnb."}, {"username": "Susan A. Jasper", "comment_text": "We booked our VRBO a year ahead and so glad we did. We are paying $532 a night and it is now over $800. So glad we locked it down early."}, {"username": "Robin Burrell", "comment_text": "March should be fine to book whenever you want almost everywhere unless an event or concert or festival is going on"}, {"username": "Veronica Trejo Beebe", "comment_text": "In March and arriving in October."}, {"username": "Denise Tenn", "comment_text": "We stayed in some beautiful airbnbs & just booked 2 weeks in advance of stops the whole trip (as was 3 months during March/April /May Inter-railing trip) and wanted some flexibility along the way. Normally a planner but this worked so well out of main peak season."}, {"username": "Carol Taylor Tisdale", "comment_text": "6-9 months usually."}, {"username": "Paula Bodden", "comment_text": "If you are going in March I would book now. Just booked our rooms for May."}, {"username": "Eileen Lonergan", "comment_text": "A couple of weeks"}, {"username": "Patsy Luque Mejia", "comment_text": "We booked nearly a year in advance. The rooms are held with a credit card. Changes and cancellations can be made up to a few days before arrival. No charges are applied to our credit card until the cancellation deadline date."}, {"username": "Tracey O'shea", "comment_text": "We have just booked ours for Xmas"}, {"username": "Cindy Breneman Hattrich", "comment_text": "I am going august and reserved my whole trip with a travel agent last January"}, {"username": "Kristina Ruk", "comment_text": "Well I book last minute..as with kids you never know🤣"}, {"username": "Jill Medrano Casey", "comment_text": "I think it depends on how many people and your price point. I also liked booking ahead of time to be able to pay off some of my vacation early."}, {"username": "Glenn Todd Webb", "comment_text": "5 months"}, {"username": "John Layman", "comment_text": "Never to early"}, {"username": "Giuliana Vaccari", "comment_text": "We booked hotels on the Amalfi Coast about 10 months out as those book very quick, especially Positano"}, {"username": "Sam Mah", "comment_text": "We have been travelling around by train all over Europe and have booked 2-6 days before we got to the next location. The only place that we had to go further out than we originally wanted was Paris. Pretty sure in March you won't have problems but the earlier you book the cheaper you may find it."}, {"username": "Tracy Wrinn Mcdermott", "comment_text": "Make sure you have free cancellation and book early in popular places, especially if budget is a concern. It’s only necessary to book super early if you have special accommodations in mind in very touristy popular places. I booked my hotel in Venice for next July already because it only has 9 rooms and I wanted that particular hotel. I book early because it relieves my stress. I’m a little crazy like that. Do whatever makes you feel comfortable:)"}, {"username": "Gillian O'Callaghan", "comment_text": "Some 6 months out, some 6 weeks, and returned on a whim and booked 2 weeks out."}, {"username": "Elaine King", "comment_text": "One year"}, {"username": "Wallace Clavelle", "comment_text": "Just depends.\nI booked some places weeks before I got there and some a couple months in advance. But booking way in advance may be easier, less to worry about when time comes and easier to pay off in advance. Def pay for the cancellation fee, if you get in advance just encase something comes up."}, {"username": "Sara Jellen Wingard", "comment_text": "We booked almost a year in advance when we found the perfect location and price"}, {"username": "Mary Agozzino Derrick", "comment_text": "We usually book 10 months to 1 yr in advance and this way, we always get what we want, and we always travel with our dog....never had any problem or issues this way"}]}, {"id": "2194017297664015", "text": "Hi there, we are heading to Rome for 4 days. Staying in Travestere. Hopefully it’s a good location. Who should I book Vatican tour with pls?", "link": "facebook.com/groups/1373361046396315/permalink/2194017297664015/", "likes": 1, "comments": [{"username": "Marissa Diana", "comment_text": "Book 7:30 AM Vatican breakfast tour directly from Vatican website"}, {"username": "Cindy Capozzi", "comment_text": "We stayed at Hotel Ripa Roma and liked it. Fantastic breakfast included. We used FreeNow app for Taxis."}, {"username": "Terri Keener", "comment_text": "Great location where are you staying?"}, {"username": "John Mazurek", "comment_text": "Directly with the Vatican on-line! Be prepared to walk and walk and walk! But worth every step!"}, {"username": "Oancea Bogdan", "comment_text": "It's Trastevere 👍"}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "We loved the energetic vibe of Trastevere, but on weekends and late into the night…it was extremely noisy and overrun with partying young adults. I’m not a fuddy duddy at all, but would opt to stay away from the area and just visit for meals/drinks next visit.\n\nLoved the area just beyond the bridge at Castel Sant’Angelo. Lovely. Charming. I walked the area solo at dawn and it’s a hop, skip n jump from Vatican. Don’t miss Sant’Angelo rooftop at sunset and a drink overlooking the views of St Peter’s dome. Magical."}, {"username": "Tracy Wrinn Mcdermott", "comment_text": "Book directly with the Vatican\n\nhttps://\nm.museivaticani.\nva/content/\nmuseivaticani-mo\nbile/en.html"}, {"username": "Dawdaw Samaha", "comment_text": "book it as soon as possible, hard to find tickets the same day, there is agents you can get it but they charge you a lot and they accept cash only, try to do it through an official agent . Buy a guided tour. It is very beautiful and amazing experience"}, {"username": "Karen Schmidt", "comment_text": "We did a Friday evening tour. WAY fewer people! This was end of September last year…."}, {"username": "Roland Trego", "comment_text": "ROME POSSIBILITIES\n+Day 1 (1/2 day only): Strolling in the Trastevere district, Basilica di Santa Maria in Trastevere + dinner\n+Day 2: Piazza Navona, the Pantheon, Trevi Fountain, Sant’Ignazio di Loyola church, + strolling on Via dei Coronari + dinner in the Campo de’ Fiori\n+Day 3-4: Advanced booking is necessary!\na. Vatican (on a pre-booked, small-group, guided tour) (3h30m). Here is the link for Vatican. If you can’t see availability for the day you want, it might not be released or it is sold out. Several people highly recommend the Prime Tour with breakfast before or VIP Prime with breakfast before. (Remove spaces to access links.) https: //\nm.museivaticani . va/.../\ntariffe-e-biglie\ntti.html\nb. Galleria Borghese (2.5 hrs). Book TODAY!\nc. Colosseum (2-3 hrs.) Book through Coop Culture (the official website for the colosseum). Third-party sites frequently cancel.\nOther:\n+ Spanish Steps\n+ Monument to Vittoria Emanuele II. Take the elevator to the top for the views.\n+ Strolling in the historic center (e.g., Campo de’ Fiori) and dinner\n+ Palazzo Colonna, Saturday morning only, with reservation. Still privately owned. Spectacular grandeur.\n+ Galleria Doria Pamphilj: art museum in a palace. Must-see: the OPULENT Galleria degli Specchi (Gallery of Mirrors)\n+ Golf cart tour\n\nRome taxis: https: // www . rome . net/taxi"}, {"username": "Leslie Goodland", "comment_text": "I LOVED Trastevere! Lovely part of Rome. I booked my tour with Get Your Guide. I used them a couple of times. I would recommend them."}]}, {"id": "2194018474330564", "text": "Any must do's great accommodation in Sardinia tips", "link": "facebook.com/groups/1373361046396315/permalink/2194018474330564/", "likes": 0, "comments": [{"username": "Sandra Desmond", "comment_text": "I’m going to Sardinia there’s some lovely hotel’s apartments that are rented out look up booking. Com"}, {"username": "Kay Rendall", "comment_text": "Don't miss Alghero I found it beautiful, relaxing easy to wander. Lots history stay in the old town\nI stayed in a Monastery that is now a hotel right in the centre. Beaches close by.\nEnjoyed this area more than any in Sardinia. Flew direct from Rome"}, {"username": "Petra Elisabeth Freilinger", "comment_text": "Hi!! When will you travel? Check out San Pantaleo, nord Sardinia, close to the emerald coast, only 5 to 10 min drive from the major beaches, lovely little village with lots of small bars and cafes, fancy boutiques, art galleries, in the last years it has become one of the ‘Hot spots’ of the Emerald cost , also some really nice Hotels there. For accommodation - nord Sardinia - these are really special - Lianti Resort, Gallicantu, and Petra Segreta Resort and Spa 🌟🌟🌟"}, {"username": "Mike Ball", "comment_text": "Alghero is a must see , beautiful old town, good beaches and a little bit of Catalonian culture thrown into the mix ,\n\nAlso try to visit Bosa if you can,"}, {"username": "Ildiko Gyimesi Mikos", "comment_text": "Which area of Sardinia are you planning to visit?"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2194024587663286", "text": "We have 3 days. Pls suggest where shall we stay.\nAmalfi , Positano or Sorrento ?", "link": "facebook.com/groups/1373361046396315/permalink/2194024587663286/", "likes": 172, "comments": [{"username": "Jill Moorcroft Penn", "comment_text": "All good but I love Positano."}, {"username": "Barbie Toledo", "comment_text": "All three. One day each. ❤️"}, {"username": "Bonita Benkoski", "comment_text": "Positano"}, {"username": "Bonnie Lang", "comment_text": "AMALFI!!"}, {"username": "Donna Webster Hoffmann", "comment_text": "Praiano is just outside Positano (we walked there). Hotel El Niño is wonderful overlooking the coastline with a pool and restaurant."}, {"username": "Amanda Geistweidt", "comment_text": "Just left Positano and ready to go back! Magic"}, {"username": "Elise McGill", "comment_text": "Sorrento there’s the most gorgeous hotel there"}, {"username": "Connie Titone", "comment_text": "Salerno"}, {"username": "Charmaine Tetkoskie", "comment_text": "Sorrento"}, {"username": "Jill Shagool", "comment_text": "Amalfi"}, {"username": "Brittany Schoenauer", "comment_text": "Amalfi was my favorite. We stayed in a hotel there that looked out to the water and it was a great couple days"}, {"username": "Karyn Owen", "comment_text": "Positano"}, {"username": "Sandi Davenport Belushi", "comment_text": "Sorrento is sweet. Relaxed and wonderful. Day trip to amalfi. Unless you have a ton of money and are young!😂😂😂"}, {"username": "Don Bev Currie", "comment_text": "Sorrento."}, {"username": "Pamela Abbey Pellichero", "comment_text": "Positano!!!"}, {"username": "Alan Monroe", "comment_text": "Amalfi!! But book a longer trip!!"}, {"username": "Jacques Smith", "comment_text": "Positano.. not a choice.. a must!"}, {"username": "Cheryl King Smith", "comment_text": "Sorrento"}, {"username": "James Prescott", "comment_text": "Can’t go wrong with any of them ..and I was pleasantly surprised how cool Sorrento was. They al all pretty much together so stay in each one nite!,,"}, {"username": "Celeste Hedequist", "comment_text": "Sorrento. It easy to get to other places from there."}, {"username": "Diana Skidmore", "comment_text": "Sorrento for sure and do a day trip to amalfi with viator and then we did a private boat tour to the blue grotto to Capri and then had dinner in Capri and did the cruise back to sorrento watching the sunset.. incredible... my least favorite was amalfi which I thought was gonna be my favorite. Positano was fun and great shopping"}, {"username": "Tatyana Gourov", "comment_text": "Amalfi"}, {"username": "Jolynna Wilson", "comment_text": "Ravello!"}, {"username": "Lois Bummer", "comment_text": "All of them"}, {"username": "Janelle Waguespack", "comment_text": "Sorrento"}, {"username": "Lee Mckay", "comment_text": "OMG. all really good"}, {"username": "Michelle Antenucci", "comment_text": "Positano"}, {"username": "Amanda Johnson", "comment_text": "We are staying in Sorrento on Oct seemed like the most affordable and accessible to everything"}, {"username": "Susan Hanna Martin", "comment_text": "Positano!!!!"}, {"username": "Danielle Gervais", "comment_text": "Sorrento"}, {"username": "Jack O'Connor", "comment_text": "Sorrento. It’s well positioned to still make day trips to Positano, Amalfi and Ravello. Yet, it’s also big enough to explore on your own as a starting hub. It’s very safe to walk around, has about 5 central corridors full of shops, trattorias, gelatorias, wine bars and the like. You will also be able to catch breaktakinf views of Naples, Vesuvius and Ischia on a clear day. It’s just a really lovely, lovely place!"}, {"username": "Elsa Hurt", "comment_text": "Sorrento"}, {"username": "Plamen Gerasimov-Pindo", "comment_text": "My answer - yes!"}, {"username": "Cathy Ruggiero", "comment_text": "Stay in Praiano\nView from my pool"}, {"username": "Karen Richter", "comment_text": "Sorrento"}, {"username": "Anne Marie Shepherd", "comment_text": "Lauren Cooley McCullough"}, {"username": "Ashley DeFrees", "comment_text": "Which place would you like to see during sunrise/\nsunset? I would go Positano if I could do it again."}, {"username": "Joan Belserene Forcheski", "comment_text": "Stay in Minori! Hotel Avila Romana was lovely. Minori is Quaint, less crowded. Great restaurants, easy ferry access to Amalfi, Sorrento, Positano & Capri.!"}, {"username": "Grunt E Stin", "comment_text": "Why don’t you try Paestum? Amazing place near them all with a world unesco site and far cheaper than the places you mentioned."}, {"username": "Claudia Barnhill Swicegood", "comment_text": "Amalfi"}, {"username": "Martinez Martin", "comment_text": "Any city will be great, just don't stay too high up over looking the city. There isn't am elevator up to your hotel. So if you have an amazing overlooking view you also will have the equivalent of 27 flights of stairs to and from your room."}, {"username": "Julie George", "comment_text": "Positano"}, {"username": "Leslie Moskowitz", "comment_text": "Sorrento 💯 we went all three last year, but stayed in Sorrento and we were so happy that is where we stayed"}, {"username": "MaryKevin Miller", "comment_text": "Any"}, {"username": "Joanne Ferreira", "comment_text": "Any of the above"}, {"username": "Donna Pompei Lembo", "comment_text": "Sorrento!!"}, {"username": "Ann Smith", "comment_text": "Sorrento"}, {"username": "Hermineh Topalian", "comment_text": "All 3"}, {"username": "TedandDawn Pappas", "comment_text": "Amalfi"}, {"username": "Gloria J. Fernandez", "comment_text": "Sorrento"}, {"username": "Anis Suissi", "comment_text": "Sorrento bien sûr"}, {"username": "Megan McLane DeLaurentis", "comment_text": "Sorrento- hotel contential"}, {"username": "LaTonia McGinnis", "comment_text": "Lydia Colette"}, {"username": "Nicole Wild", "comment_text": "Positano and drink lots of Limoncello 😜😂♥️"}, {"username": "Chris A. Steinmetz", "comment_text": "Positano"}, {"username": "Beatrice Gheorghiu", "comment_text": "Maiori 😂"}, {"username": "Denise Robinson", "comment_text": "Amalfi, if you was staying for longer I’d say Sorrento x"}, {"username": "Gail Holler", "comment_text": "Amalfi"}, {"username": "Sandy Michelle Duggan", "comment_text": "sorrento"}, {"username": "Shelley Gilge Adair", "comment_text": "Ravello"}, {"username": "Casey Farrell", "comment_text": "Positano ❤️✨"}, {"username": "Kevin Vaskez", "comment_text": "Use Amalfi as a base less crowded n easier to walk n take water taxi to visit the others."}, {"username": "Ian Beyer", "comment_text": "Miramare B&B, agerola."}, {"username": "Lori Swan", "comment_text": "Sorrento"}, {"username": "Ron Warner", "comment_text": "Positano is the most beautiful of the three"}, {"username": "Allison Cleary-Cranney", "comment_text": "Sorrento!!"}, {"username": "Zeynep Arpacıoğlu", "comment_text": "Positano per me"}, {"username": "April Mahon", "comment_text": "I loved sorrento out of all of them and will be going back to spend more time there but all are beautiful x"}, {"username": "Nicci Knights", "comment_text": "Consider Cinque Terra 🙌 so beautiful and all accessible with the train once you are there. Beautiful scenery!"}, {"username": "Brook McCleery", "comment_text": "Sorrento! Take a boat tour to other islands"}, {"username": "David Daggett", "comment_text": "Sorrento, Italy"}, {"username": "Julie Thompson", "comment_text": "All xxx"}, {"username": "Renee Hall", "comment_text": "Inny,minny,miny\n,mo"}, {"username": "Araceli Rossi", "comment_text": "POSITANO, estuve 4 noches , espectacular!!!\n👏👏❤❤"}, {"username": "Antonia Toni Cadete", "comment_text": "That’s like trying to choose between chocolate chocolate and chocolate"}, {"username": "Hudd Cass", "comment_text": "I’ve stayed in all 3 and Postitabo was our fav!"}, {"username": "Natalie Silkov-yianni", "comment_text": "positano"}, {"username": "Rose Gabriele", "comment_text": "Is anyone familiar with an Italian language school in Sorrento? Thanks in advance for any info you can share."}, {"username": "Dolores Jiran Miller", "comment_text": "Sorrento. Hotel Grand de VIlle"}, {"username": "Marissa Rider", "comment_text": "Ravello"}, {"username": "Silke Frankl", "comment_text": "Sorrento"}, {"username": "Deborah Sue Yarbrough", "comment_text": "Ravello"}, {"username": "Julie Fabrico", "comment_text": "Positano!!!!"}, {"username": "Gail Barrett", "comment_text": "Sorrento or Positano my two favorite places"}, {"username": "Helena S. Stone", "comment_text": "Ravello"}, {"username": "Moyra Clarke", "comment_text": "Sorrento!"}, {"username": "Pamela Poli DiSarro", "comment_text": "Positano"}, {"username": "Denise Moriarty", "comment_text": "Sorrento"}, {"username": "Toby Dye", "comment_text": "Sorrento and visit the others from there."}, {"username": "Gina Aguilar", "comment_text": "Sorrento"}, {"username": "Nadine Sughayyar", "comment_text": "If you have a car, Sorrento. It’s easier to park and most likely more economic. You can do day trips to the other two places. It’s very difficult to find parking in Positano."}, {"username": "Debbie Hetho", "comment_text": "Nerano"}, {"username": "Mary Moger", "comment_text": "Just got back from a week in Sorrento we stayed at the Hotel Antiche Mura it was beautiful lovely pool great staff and a 2 min walk to the square"}, {"username": "Julie Saritag", "comment_text": "If you don’t have a car there is an open top bus from sorrento bus station to amalfi snd positano. It’s an amazing ride and used by locals and tourists."}, {"username": "Sofie Faltum", "comment_text": "Hotel Villa Garden, Sant’Agnello close to Sorrento.\n\nSorrento is strategically located, making it an ideal starting point for exploring the Amalfi Coast and other nearby destinations such as Capri, Pompeii, and Naples. There are good transportation connections, including ferries and trains, making it easy to get around and explore the area.\n\nCompared to Positano and Amalfi, accommodation, food, and shopping prices can be more affordable in Sorrento. This can make it a more budget-friendly\nchoice for some travelers.\n\nSorrento has its own unique charm and atmosphere. The town has retained its authentic Italian character with narrow streets, local shops, colorful houses, and a lively ambiance. You can experience the local culture and traditions up close.\n\nLiving in Sorrento offers stunning views that set it apart from Positano or Amalfi. From Sorrento, you can enjoy breathtaking views of the majestic Mount Vesuvius. As Sorrento is situated on the opposite side of the Bay of Naples, the sight of Mount Vesuvius rising majestically in the horizon creates a truly awe-inspiring backdrop. This remarkable view can be an extraordinary experience and a perfect subject for capturing memorable photographs during your stay in Sorrento."}, {"username": "Col Giufre", "comment_text": "Sorento ITALY"}, {"username": "Mariela Bonilla", "comment_text": "Sorrent"}, {"username": "Rosalie Todaro Morreale", "comment_text": "Positano!!"}, {"username": "Yvonne van Gent", "comment_text": "Amalfi and Sorrento"}, {"username": "Maria EIkady", "comment_text": "Sorrento! You can take the fairy boat to Naples, ischia, Positano and Amalfi if you desire! We stayed in Sorrento and loved the vibes plus lots to see and do!"}, {"username": "Sonia Scalzi", "comment_text": "Sorrento"}, {"username": "Diane Willis", "comment_text": "Sorrento"}, {"username": "Christine Broussard", "comment_text": "Has anybody stayed at Mediterranean suites in Old Town In Sorrento?"}, {"username": "Lulules Roberts", "comment_text": "Raveno"}, {"username": "Lulules Roberts", "comment_text": "Yes praiano amazing can get local bus anywhere"}, {"username": "Ann-Dorte Bruhn", "comment_text": "Sorrento or Positano"}, {"username": "Julia Pie", "comment_text": "Amalfi"}, {"username": "Yanni Kate", "comment_text": "Been to them all…. One more beautiful than the other… you can’t go wrong…. Myself I would do Sorrento with a day trip to Capri to see the blue grotto…. An awesome experience, one you will never forget 👍🏼♥️ 🇮🇹"}, {"username": "Jodie Garito Ward", "comment_text": "Sorrento"}, {"username": "Laura Michelle Bratisax", "comment_text": "I would go out on a limb and say Cinque Terre!"}, {"username": "Sandie Chandler", "comment_text": "Positano all the way. A bit more expensive, but so worth it. We stayed atCasa Teresa which was the most reasonable for our dates last September."}, {"username": "Korena Maree", "comment_text": "Praiano"}, {"username": "Tracey Sadiq-Butz", "comment_text": "Sorrento"}, {"username": "Halla Guðnadóttir", "comment_text": "Amalfi"}, {"username": "Lisa Martinson", "comment_text": "Sorrento"}, {"username": "Joan Madonna", "comment_text": "Sorrento loved it"}, {"username": "Josh Hess", "comment_text": "Sorrento"}, {"username": "Sharon Long", "comment_text": "Positano"}, {"username": "Carolyn Robilotti Karpinski", "comment_text": "Sorrento"}, {"username": "Kevin Clement", "comment_text": "Positano"}]}, {"id": "2194025847663160", "text": "We have a cooking class that begins in Taormina at 10:00am. Ship docks at 7:00. After looking into train schedules, I don’t think we can go by train. So I’m looking for a car service, but they all seem to be airport based. Anyone have a taxi or car service to recommend? Will there be taxis just showing up at the port? Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2194025847663160/", "likes": 1, "comments": [{"username": "Kay Jenkins", "comment_text": "ask the people who are providing the course, they may have best ideas."}, {"username": "Heather Hills Jacobs", "comment_text": "Try Venice Group Services for private transfer"}]}, {"id": "2194026987663046", "text": "I’m from the NY area and my boyfriend and I are traveling to Europe for the first time next May! Were heading to Barcelona for a wedding and then flying to Rome to catch a Mediterranean cruise. We’re super excited but wanted to get an idea how far in advanced should we be getting our plane tickets? I’ve been keeping track and it looks like for aआणखी round trip flight for basic economy it’s going to be about $1800 per person, is this normal pricing? Should we wait it out and see if prices drop? Is it better to book through a travel agent? Any help for a fellow Gen Zer would be greatly appreciated🫶🏻", "link": "facebook.com/groups/1373361046396315/permalink/2194026987663046/", "likes": 0, "comments": []}, {"id": "2194027307663014", "text": "What would you do with one day in Milan? Btw- have multi generations!", "link": "facebook.com/groups/1373361046396315/permalink/2194027307663014/", "likes": 9, "comments": [{"username": "Colleenmaaske Maaske", "comment_text": "Go to the Gucci outlet 😁"}, {"username": "Vickey Bingham", "comment_text": "Duomo!!"}, {"username": "Barbara Bastianini", "comment_text": "I myself would visit the Last Supper and the Duomo. ."}, {"username": "Robin Burrell", "comment_text": "See the last supper"}, {"username": "Heather McFee", "comment_text": "Skip Milan. Take the train to Lake Como!!"}, {"username": "Matthew Gramitt", "comment_text": "If I was there for the airport, I’d make it a half day instead. And only on the flight out.\n\nDuomo and nearby areas.\n\nOr…\n\n…if flying out of Malpensa, just stay the night in Busto Arsizio, walk around the old town parts and have a good dinner at a great locals-type spot - Trattoria del Municipio.\n\nIf flying out of Linate, same thing but stay in Melegnano and eat at locals-type restaurant Ristorante Pizzeria Da Nicolas."}, {"username": "Lisa Scott", "comment_text": "I love Milan. Tickets to see The Last Supper in the morning, Lunch overlooking the Duomo, then a bike tour - you’ll see everything including Navigli and no-one will be exhausted. Dinner if you are staying the night to try Osso Bucco and risotto Milanese. I also love the Michelangelo Pieta Ronda at Sforza Castle and your bike guide might be able to arrange that for you in advance - it’s only a 20 minute visit for most people."}, {"username": "Karen Harrison", "comment_text": "Last Supper, Duomo, La Scala, Galleria. All can be done in a day. Tickets in advance required for the Last Supper."}, {"username": "Zucchero Candito Kandinsky", "comment_text": "Visit the Duomo, absolutely. If you like art, pinacoteca di Brera. Galleria Vittorio Emanuele is usually very crowded but is a must, a stroll to Castello Sforzesco and City Life. Perhaps go see the Last Supper. See the Navigli. Of course, drink a spritz and have a slice of pizza from Spontini. I personally enjoy also the Cimitero Monumentale"}, {"username": "Dottor Peppe Insigne", "comment_text": "Prenderei il treno per Napoli"}, {"username": "Xiomara Servellon", "comment_text": "Colonne di San Lorenzo"}, {"username": "Xiomara Servellon", "comment_text": "If you visit in this Moment you can approffit the sales \"saldi\""}, {"username": "Yuri Budilov", "comment_text": "I would not go to Milan for 1 day. Perhaps it is because I have been there 3-4 times already and never fewer than 4-5 nights. Also, it depends on your interests. If you like art there is Last Supper by Da Vinci and there is even more interesting Pinacoteca Di Brera for painting lovers. There is Castello Sforzesco and nearby. All of those will eat 1 day, assuming you like art. You can spend a day simply shopping in Milan. It does not get any better for shopping, if you are into clothes, shoes, bags, etc - and you have the means and interest. There is also Opera house La Scala for music lovers. There is Duomo and nearby (including the roof of the cathedral). All of that needs another day. The queues for tickets may be long, depending on the season."}, {"username": "Claire Lewis", "comment_text": "Visit Como"}, {"username": "Francesco Pogna", "comment_text": "Visit Bergamo"}, {"username": "Donna Mauerhan", "comment_text": "Visit the Duomo, last supper & canal district! Beautiful city."}, {"username": "Ann Moore-Pak", "comment_text": "Opera house tour of la scala… wealth of culture… or last supper. I had ages 13- to 32! And me! Loved milan. Have risotto, sparkling red wine.. not to be missed… and osso bucco!"}, {"username": "Ann Tatum Boltin", "comment_text": "Rooftop tour of the duomo and tour La Scala great exhibit there now and it is not as crowded as other sites like the galleria."}, {"username": "Martin Rudolph", "comment_text": "Design museum"}, {"username": "Nancy Lewis", "comment_text": "Would skip and go to next stop with an extra day."}, {"username": "Nancy Lewis", "comment_text": "Only 2 things to see. The Duomo and The Last Supper."}, {"username": "Roe Gallo Saks", "comment_text": "Duomo, last supper and the opera house. All near one another. Play s a walk through the galleria"}, {"username": "Hudd Cass", "comment_text": "Shopping and nightclubs are the only real highlight in Milan."}, {"username": "Monica Roman-Fazio", "comment_text": "Duomo midday definitely there shops all over the place there plus the church."}, {"username": "John Borgia", "comment_text": "Last Supper and Duomo roof tour"}, {"username": "Iris Joan Price", "comment_text": "Of course, the roof of the Duomo would be my top pick and the Galleria next to it. The Italian Design Museum is wonderful if you and the kids are into modern design of all types at the Triennale Milano\nViale Emilio Alemagna, 6, 20121 Milano MI, Italy https://\nartsandculture.g\noogle.com/\npartner/\nla-triennale-di-\nmilano"}, {"username": "Steph Craddock", "comment_text": "Go somewhere else!! 🤣"}, {"username": "Gina Palmerio De Carmo", "comment_text": "Depends what your interests are. We are soccer family and there are no games in July so we’re doing a tour of the San Siro."}, {"username": "Dana Yednak", "comment_text": "Just had a $25 pastry for dinner. Streets not incredibly walker friendly for older folks. Like me. Big lunch. Duomo. Done! 😁"}, {"username": "Ellen Edmonds-Wilson", "comment_text": "Milan in one day was what we did when it rained in Como. We visited the Castello Sforesco, which was wonderful, and the Duomo plus the shopping arcade and the Da Vinci museum therein. It was a lovely day. Plus a great lunch."}, {"username": "Rosemary Giuffre", "comment_text": "Go see the last supper"}, {"username": "Robýn Kretsçhmər Schuchårdt", "comment_text": "I'd go see The Last Supper and the Duomo"}, {"username": "Wendy Harrison", "comment_text": "The Duomo, the Piazza, the Galleria and the Last Supper."}, {"username": "Anu Raun", "comment_text": "Navigli, on the way froum Navigli (having there aperatiov, seeing Arco di Porta Ticinese) to Duomo is some ruins and churches (Basilica di Sant'Ambrogio),\nGalleria Vittorio Emanuele II, La Scala, Castello Sforzesco and Parco Sempione (and Arco della Pace), I havn't been on Cimetero Monumentalo, when you come by train, then BAM and TreeVilla park with modern buildings etc etc etc"}, {"username": "Deacon Tom Lang", "comment_text": "Have lunch near the Duomo. Head into the Galleria next door. Go straight through to the Leonardo DaVinci exhibit at the far end. Continue out of the Galleria, turn left, and your La Scala Opera House. If you aren’t going for awhile, go to the website for Santa Maria della Grazie and try to get tickets to see The Last Supper in advance. Hard to get even in advance, but worth the try."}, {"username": "Evelyn Brown", "comment_text": "The Last Supper, but you have to get tickets in advance.\n\nThe Duomo and surrounding area - lots of restaurants and shopping."}, {"username": "Sandra Maldonado", "comment_text": "Visit the cathedral and La Scala."}, {"username": "Glenn Todd Webb", "comment_text": "We did first last supper tour of the day then went to Chiesa Maggiore (frescoes floor to ceiling), then had afternoon guided tour of Duomo. Plenty of time to see galleria, take hop on hop off and have lunch near duomo."}, {"username": "Rita Levi Montalbano", "comment_text": "Surely you have to go above the roof of the Duomo, there are very cheap tickets that allow you to go up. Near the duomo, after visiting the Galleria and Piazza della Scala (they are really close to eachothers) you can eat a great and authentic pizza from \"Piz milano\". Another thing to do absolutely is an aperitif on the navigli, try looking at \"La Vineria\". A macabre but interesting thing is the san bernardino ossuary. Milan is also great for shopping. If you reserve the tickets you can also see \"Ultima cena\" from Leonardo Da vinci. You can walk in the Sempione Park that brings you in the stunning Castello Sforzesco. Sorry if it's not written in perfect English, I'm an Italian living in Milan and I used the translator to do it faster."}, {"username": "Eric Parks", "comment_text": "I'd do what the other mentioned plus stop at the Aperol Bar in the Galleria (sit and people watch, bar area gets packed) then go in search of the best possible osso bucco and risotto milanese."}, {"username": "Stephanie Earl Peterson", "comment_text": "We were there a couple weeks ago we were way late in the game getting tickets for the last supper. You need a few months for that. And we got to the duomo right at 6 o'clock and discovered that was the last tour and we missed it by three minutes. So make sure you get into that sooner than that also. Really disappointed because the two things I wanted to see the most in Milan were missed. ￼"}, {"username": "Sarah Hadjinian Kirakossian", "comment_text": "We did Milano in a day. We took train form Florence. Dropped off luggage at metro station locker room.\nToured the Duomo, walked over to the Galleria shopped a little had lunch. Walked to the Santa Maria Della Gracie to see the “Last Supper” along with a short city tour (included in our package). Went back to center to explore the 2nd biggest Starbucks and took the late train to Venice."}, {"username": "Renae Larcus", "comment_text": "Duomo, Galleria, maybe aperitif at Navigli. We had 2 nights in Milan and it was plenty."}, {"username": "Lisa Martinson", "comment_text": "See the last supper"}, {"username": "Victor Segovia Jr.", "comment_text": "Eat"}, {"username": "Phyllis Snyder", "comment_text": "See the Last Supper."}, {"username": "Miyuki Kanno Paul", "comment_text": "I’ve only spent one day in Milano. You can squeeze a lot without any hassle. Plan ahead"}, {"username": "Francesco Ronchi", "comment_text": "Duomo-Castello Sforzesco-Brera\n-Navigli"}, {"username": "Rose Anderson", "comment_text": "I would take a train to lake como and ride the ferry between all the little towns- so relaxing - good places to eat with lovely views-\nOf course the art in Florence is awesome but you need advance tickets-\nI would also love to see Tuscany- maybe a wine tasting but might not work for multiple generations traveling"}, {"username": "Monica Sulkey Hayes", "comment_text": "Definitely the Duomo and the last supper"}, {"username": "Carmine Napolitano", "comment_text": "I would skip it unless you like buying $150 shirts and getting dirty looks from fashionistas they had a decent park somewhere if you have kids we caught a van to Lake Como\nps aperols taste like dayquil mixed with sprite yuk"}, {"username": "Debbie Bodette", "comment_text": "Wouldn’t go. I did and really wished I did Venice instead."}]}, {"id": "2194027774329634", "text": "I need some advice. We are taking the overnight train from Sicily to Salerno then up to Bomerano for 5 days. While we are in Bomerano there is a football game in Naples that I am getting tickets for.\nAfter the Amalfi coast we wanted to head to Matera for a couple of days and then to Rome for our last week.\nI'm wondering if it would be better to getआणखी on another train to Matera from Salerno first for a couple of days, then Matera to Naples for the soccer game, then to Bomerano.\nRather than going from Bomerano to Naples for the game spending the night and then head back to Bomerano the next day..it looks like logistically it would make more sense to do Matera first, then head to Naples than to Bomerano.\n\nAll suggestions appreciated. Also best area to stay in Naples if our only interest there is the football game.", "link": "facebook.com/groups/1373361046396315/permalink/2194027774329634/", "likes": 0, "comments": [{"username": "Kay Rendall", "comment_text": "Matera is definately closer to Sicily, but trains, public transport in that area not so straight, easy to navigate do more research."}, {"username": "Brenno Bianchi", "comment_text": "There is no national railroad train station in Matera"}]}, {"id": "2194027924329619", "text": "We are a family of 5 (3 teens aged 18,16 and 13) travelling to Rome for 4-5 days in December 2023. This will be our second visit to Rome. Last time we stayed in Campo Dei Fiori and saw all of the main attractions. This time I am thinking of staying in Trastevere for something different. Would be interested in any thoughts/ experiences. Is it good for teenagers who love to shop and eat? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2194027924329619/", "likes": 0, "comments": []}, {"id": "2194032157662529", "text": "What is the best high speed train to take from Venice to Florence, then Florence to Rome and Rome to Sorrento?", "link": "facebook.com/groups/1373361046396315/permalink/2194032157662529/", "likes": 0, "comments": []}, {"id": "2194030190996059", "text": "Hello! Looking for recommendations for a fishing charter near to Florence towards Cinque Terre or other locations - willing to drive. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2194030190996059/", "likes": 0, "comments": []}, {"id": "2194036170995461", "text": "Italy and toddlers 🐵\n\nI’m in Rome, Florence and Venice for a few days mid September and hoping venture out to Cinque Terre for a day trip or somewhere we can swim and let our little one cool down.\n\nAny recommendations for day tours or is it worth just catching a train ourselves and wondering around.\n\nAlso, is the weather somewhat bearable during mid September ? We are used to Australian summers so I feel like will be okay but just making sure we are prepared with these record heat waves.\n\nAlso, anyone booked with ItaliaRail ?", "link": "facebook.com/groups/1373361046396315/permalink/2194036170995461/", "likes": 0, "comments": [{"username": "Jenny Payne", "comment_text": "I use them all the time in Italy as I go twice a year , I’m from Australia & September will be beautiful weather usually going into October as I’m going bk then 🌻"}]}, {"id": "2194046704327741", "text": "In the Trenitalia app……\nCan someone help me.\nWhich station do I choose for all the major cities?", "link": "facebook.com/groups/1373361046396315/permalink/2194046704327741/", "likes": 1, "comments": [{"username": "Patsy Luque Mejia", "comment_text": "Florence/\nFirenze-Santa Maria Novela.\nVenice/Venezia - Santa Lucia.\nBologna-Bologna\nCentrale.\nYou may also Google it for the main train station in the city you are interested in."}, {"username": "Sam Mah", "comment_text": "Use google 1st to work out where you are staying then do a search for \"train station\" and it will show all that are nearby."}]}, {"id": "2194049224327489", "text": "Desperately looking for a hat (for my quit large fat head), any suggestions?", "link": "facebook.com/groups/1373361046396315/permalink/2194049224327489/", "likes": 0, "comments": []}, {"id": "2194054207660324", "text": "Can anyone share their experience doing the Colosseum tour (obtained from Coop directly) with Underground? It says it’s only 1 hour 15 min. How can this be? Do they not guide us through Palatine, Forum, etc?", "link": "facebook.com/groups/1373361046396315/permalink/2194054207660324/", "likes": 0, "comments": [{"username": "Sharon Williams Sellers", "comment_text": "The Colosseum tour is awesome. We actually walked through Palatine and the Forum etc. on our own. It is amazing!"}, {"username": "Amy Sandler Riemer", "comment_text": "Did you do the underground tour or regular ticket?"}, {"username": "Shen Min Chue", "comment_text": "The Coopculture Underground ticket includes a 75 mins guided tour of the Underground & Arena only. There is no guided tour of the Roman Forum & Palatine Hill. These areas are for your self-exploratio\nn. However with such an arrangement, you got the potential to cover more & see more than those on guided tours of Forum and Palatine from external operators. This is because on your own, you have 48 hours validity to self-explore thoroughly the Forum and Palatine as compared to guided tours which are selective in their coverage. More importantly, on your own, you will have time to be able to cover all available SUPER sites"}, {"username": "Jeff McLellan", "comment_text": "Andrea Hirsch we were just in Rome last week and we wanted a proper tour of Colosseum, Roman Forum and Palantine Hill. Coopculture does arrange private tours that include all three. Note that if you want to visit the underground you will need to book an entry ticket that includes this as they limit the number of people down there at any time and even the private tour does not get you access. We booked the Full Experience ticket for our entry, did the underground and then were took to meet our guide who was great. Details are below.\n\nOnce you book your timed entry you can contact their group bookings team and arrange a private tour for €240 (regardless of your group size, it is subject to them having an english speaking guide available).\n\nEmail tour@coopcultur\ne.it and provide them with:\n\nDate\nTime\nReservation code of the tickets purchased\nYour telephone number\nConfirm that you want an English private guided tour\n\nThe two options are:\n€130* for Colosseum only\n€200* for Colosseum + Roman Forum OR Palantine Hill\n€240* for Colosseum, Roman Forum AND Palantine Hill\n\n* this is for 1-30 people so for our family of four we paid an additional €80 each for a three hour private tour. Moved at our own pace, saw what we wanted to see and took breaks in the shade where our guide explained everything and answered our questions.\n\nOur guide Giulia was amazing. We did the three hour tour of the Colosseum, Palantine and the Forum."}]}, {"id": "2194054454326966", "text": "Kia ora, I am turning 50 next month and celebrating myself with a solo trip - landing in Spain 31st Aug, cruising from Spain to Italy and ending in France mid Sept. First time travelling with self, not anxious about that although it would be fabulous to meet up with other solo women for dinner (so I don’t feel like an egg 😂) Feel free to reach out 🧳 🥂 🌍", "link": "facebook.com/groups/1373361046396315/permalink/2194054454326966/", "likes": 9, "comments": [{"username": "Kay Rendall", "comment_text": "I will be in Italy from Au, all of August, September, some Oct\nIf want to message me.\nTables in restaurant tables in Italy very, very close together, so a smile , a Bono Sera lots of times start a conversation. Met many Italians and people from all over the world this way. Many I am still in touch with on facebook."}, {"username": "Debra Genovese", "comment_text": "I'm going in October solo too"}, {"username": "Jennie Garratt", "comment_text": "How incredible have a fantastic time"}]}, {"id": "2194055530993525", "text": "Looking for recommendations for an agriturismo in the val d'orcia or Southern Chianti areas with pool & restaurant on site. Ideally would also have animals, cooking classes and/or winery on site as well- but Iआणखी know that's a lot, lol. I've been looking on the agriturismo site and have some ideas but wanted to gather some recommendations from folks with experience. Thoughts? 😊", "link": "facebook.com/groups/1373361046396315/permalink/2194055530993525/", "likes": 55, "comments": [{"username": "Michelle Casillas", "comment_text": "https://\nlachiusatuscany.\ncom/"}, {"username": "Brooke Hembree", "comment_text": "I can’t recommend Oscar’s place enough! And he has everything you’re looking for!\nhttps://\nabnb.me/\n4kOYCixTvBb"}, {"username": "Jackie Linenthal Tambone", "comment_text": "We stayed at Podere Rocca near Montepulciano. It's not very far from Chianti region. It was very quaint."}, {"username": "Jackie Linenthal Tambone", "comment_text": "Here is the link\nhttps://\npoderelarocca.it\n/en/"}, {"username": "Nancy Fantom", "comment_text": "F"}, {"username": "Megan Knight", "comment_text": "We stayed here: not a farm but an old castle with a winery. Awesome restaurant, the most peaceful grounds and a gorgeous infinity pool!\n\nhttps://\nwww.vicchiomaggi\no.it/"}, {"username": "Karen Michelle Lucero", "comment_text": "Following. Note to Kristin Huff"}, {"username": "Pam Armenia O'Brien", "comment_text": "Quercerto di Castellina"}, {"username": "Raina Gardner", "comment_text": "We had lunch at a beautiful organic farm/winery that also is an agriturismo B&B with a pool. We didn't stay overnight so not sure of those details. It's just outside of the medieval town of San Gimignano. https://\nfattoriapoggioal\nloro.com/"}, {"username": "Erin Vizza", "comment_text": "http://\nwww.agriturismol\naterra.it/\n\nIt had a gorgeous pool, dogs, cats and bunnies for our kids to enjoy. Winery close by. Cooking classes and a dining table with a view to die for. We felt so at home and at peace here."}, {"username": "Genna Degan", "comment_text": "F"}, {"username": "Roberto Lacayo", "comment_text": "https://\nwww.facebook.com\n/\nAgriturismoLaLuc\nciolaia?mibexti\nd=LQQJ4d\n\nWe stayed here and like others mentioned, a vehicle is recommended because of its proximity to other areas. Beautiful, peaceful and amazing place."}, {"username": "Cari Wilson", "comment_text": "These look wonderful!"}, {"username": "Jennifer MacKenzie", "comment_text": "F"}, {"username": "Marie-Pier Tremblay", "comment_text": "Agriturismo Terre di Baccio : extraordinaire"}, {"username": "Marie-Pier Tremblay", "comment_text": "Salvadonica: super"}, {"username": "Donna Wells", "comment_text": "Following."}, {"username": "Starla Dawn", "comment_text": "My daughter and I had a great time on this tour and we stopped at a farm to table winery as part of it.\n\nhttps://\nwww.tripadvisor.\nca/\nAttractionProduc\ntReview-g187895\n-d19347975-Hors\neback_ride_visi\nt_to_S_Gimignan\no_tuscan_lunch_\nwine_tasting_Ch\nianti_winery-Fl\nore.html"}, {"username": "Rebecca Whisenhunt", "comment_text": "We stayed here for 3 nights and absolutely fell in love. Right outside of San Gimignano, breakfast is included, has a restaurant onsite that’s open for dinner, cooking classes available, and also the cutest cats on property 🥲❤️ https://\nabnb.me/\nmzLifVTowBb"}, {"username": "Michele Hedden", "comment_text": "Following"}, {"username": "Debbie Porter", "comment_text": "Sarah Porter Angie Johnson Susan Elkins Perry"}, {"username": "Brent Chapman", "comment_text": "Terrapille is amazing. The actually filmed part of the gladiator movie on their farm. https://\nwww.terrapille.i\nt/en/home/"}, {"username": "Debbie Horton Rough", "comment_text": "Following"}, {"username": "Skye Walford Scomazzon", "comment_text": "The Isabella Experience\nTuscany\nAMAZING"}, {"username": "Sarah Johnson Fercho", "comment_text": "Following"}, {"username": "Diane NM", "comment_text": "KMZero KM Zero Tours - Slow Travel Tuscany"}, {"username": "Lisa Hry", "comment_text": "Following for sure"}, {"username": "Shelley Dominguez", "comment_text": "https://\npoderespedalone.\nit/\n\nWe left with many beautiful memories and new,sweet friends! This was our view."}, {"username": "Caroline Linton", "comment_text": "Janice Carbone"}, {"username": "Katie Di Nino", "comment_text": "Following!"}]}, {"id": "2194060340993044", "text": "I have a question for the group; can you bring things such as ham and cheese back to the US from Italy?", "link": "facebook.com/groups/1373361046396315/permalink/2194060340993044/", "likes": 8, "comments": [{"username": "Larry Reinier", "comment_text": "Nope just cheese"}, {"username": "Kristin Carnicelli-Fedyshyn", "comment_text": "No meat cheese is ok but has to be shrink wrapped from what I have read. Go on tsa.gov. It will tell u what is allowed and what is not allowed"}, {"username": "Bill Elias", "comment_text": "I believe hard cheeses are fine and sealed packages?"}, {"username": "Bill Elias", "comment_text": "https://\nhelp.cbp.gov/s/\narticle/\nArticle-3619?lan\nguage=en_US"}, {"username": "Bill Elias", "comment_text": "This was more useful.\n\nhttps://\nwww.dontpackapes\nt.com/"}, {"username": "Patricia Capuccio", "comment_text": "If cryovacked"}, {"username": "Mallorie Mathis McManus", "comment_text": "I brought back cheese from Volendam just this past December. It was in my carryon Had never been opened ...shrink wrapped for shipping. Two medium size \"rounds\".\nDidn't even try to bring the oils, wines, and balsamic vinegar from Italy. I had all that shipped to my house."}, {"username": "Barbara Asaro Sciuto", "comment_text": "Funny they sell salami and cheeses at the airport…after you pass security…you can bring cheeses home but not salami!"}, {"username": "Nadia Filice", "comment_text": "Yes as long as it’s vacuumed packed and no seals broken/opened"}, {"username": "Marissa McLean", "comment_text": "I’ve brought hard salami back a few times in checked baggage"}, {"username": "Jordan Messina", "comment_text": "Maybe a possibility but might get confiscated once at US boarders"}, {"username": "Debbie Brooks Guariglia", "comment_text": "Yes, I brought cheese and salami back with me."}, {"username": "Felicia LoCascio Whitney", "comment_text": "No meats"}, {"username": "Háló-Tóth Blanka", "comment_text": "I would not even come home with all those tasty things🤔😅 i aways bring many food w me which is better than here. Last time even babyfood cuz my son loves the italian one better. But cheese, coffee, ham, chocolate everything…."}, {"username": "Nancy Deaton Cone", "comment_text": "No"}, {"username": "Carla Casci Principato", "comment_text": "Its important to remember if you have global entry and get caught bringing in anything you shouldn't, you will be forever banned from getting Global Entry.\n\nMeat, milk, egg, poultry, and their products, including products made with these materials are either prohibited or restricted from entering the United State\nThe following are generally admissible:\nCondiments: ketchup (catsup), mustard, mayonnaise, Marmite and Vegemite and prepared sauces that do not contain meat products\nOlive oil and other vegetable oils\nBread, cookies, crackers, cakes, granola bars, cereal and other baked and processed products\nCandy and chocolate\nCheese - Solid cheese that does not contain meat are admissible.\nLiquid milk and milk products intended for use by infants or very young children are admissible if in a reasonable amount or small quantity for several days.\nJuices - Commercially packaged\nTea- Commercially packaged and ready to be boiled, steeped or microwaved in liquid. Coca, barberry and loose citrus leaves are prohibited\nSpices - most dried spices are allowed except for orange, lemon, lime and other citrus leaves and seeds, lemongrass, and many vegetable and fruit seeds\nNoodles and ramen that do not have animal products in the ingredients.\nFlour\nMushrooms -fresh, dried and above the ground parts that are clean and free of soil\nNuts - Roasted\nBakery items, candy, chocolate, and dry mixes containing dairy and egg ingredients commercially labeled and presented in final finished packaging are generally admissible."}, {"username": "Roberta Andrechick Niedt", "comment_text": "You can bring hard cheese as long as it is vacuum sealed. You canNOT bring meat, regardless of how it is wrapped."}, {"username": "Karen Espinoza", "comment_text": "I’ve bought tons of everything and never had a problem"}, {"username": "Susan Argall", "comment_text": "Question Why would you want to use up all that room in you suit case for salami when you can use it for wine???🤣🤣🤣🤣🤣🤣"}, {"username": "Peter Apostolo", "comment_text": "What you have to understand is that Ham & cheeses could be used to h*Jack the plane to go to Cuba and be made into an e***sive device that could disable your digestive system!"}, {"username": "Joanne-Peter Hart", "comment_text": "I am just visualising all the drug detection dog’s growling at that one bag! 😂 😂 😂"}, {"username": "Paul Anderson", "comment_text": "Not legally."}, {"username": "Carol Brewer", "comment_text": "I always bring shrink wrapped Parmesan back. Lots of it ."}, {"username": "Celeste Beaver", "comment_text": "Not if customs knows about it"}, {"username": "Allan Jaworski", "comment_text": "Meat is unlikely to be allowed. Definitely not ham. They may allow commercially cooked meat products that are “shelf stable without refrigeration”,\nbut don’t count on it. As for cheese they allow “solid hard or soft cheeses (as long as the cheese does not contain meat or pour like a liquid i.e. ricotta or cottage cheese)”. Best bet is to declare everything to avoid legal trouble. Check https://\nwww.aphis.usda.g\nov/aphis/\nresources/\ntraveler/\nintl-travel"}, {"username": "Glenn Todd Webb", "comment_text": "Best bet is to have it shipped or put in checked luggage. If it’s carry on, good chance it will be confiscated no matter what the salesman says."}, {"username": "Joannie Houk", "comment_text": "Nope"}, {"username": "Mary Fornataro", "comment_text": "Print the regulations and show it to any agent who says you can't bring it home."}, {"username": "Bill Ironside", "comment_text": "Providing its not the one you took over."}, {"username": "Jim Hinckley", "comment_text": "Dog sniffed my ham from Italy in the Airport"}, {"username": "Giorgio Zanichelli", "comment_text": "vacuum packed aged cheese is allowed, no forms of meat are allowed though"}, {"username": "Terry Pisano", "comment_text": "Lucy did it on I Love Lucy - wrap it in a blanket and pretend it's a baby 👶"}, {"username": "Sigrid Cormier", "comment_text": "I’ve attached 2 links you should read.\nhttps://\nhelp.cbp.gov/s/\narticle/\nArticle-3619?lan\nguage=en_US\n\nhttps://\nwww.cbp.gov/\ntravel/\nus-citizens/\nknow-before-you-\ngo/\nprohibited-and-r\nestricted-items"}, {"username": "Miyuki Kanno Paul", "comment_text": "Anything PORK PRODUCTS are a huge NO! You can bring hard/semi hard cheese if vacuum sealed"}, {"username": "Angie Callejas", "comment_text": "https://\nwww.ricksteves.c\nom/travel-tips/\npacking-light/\nclearing-customs\n#:~:text=You%20\nmay%20take%20ho\nme%20vacuum,air\nplane%20breakfa\nst)%20are%20not%2\n0permitted."}, {"username": "Lisa Martinson", "comment_text": "Yes it’s usually sealed. Pack it in your suitcase."}, {"username": "Sonia Scotto Lubrano", "comment_text": "Nopeee. I mean you can pack it in a sandwich to eat but throw it away before landing."}, {"username": "Kevin Mancino", "comment_text": "Hard aged cheese that has been vacuumed sealed and has a store label om it. Meat is absolute a NO!!! I brought a few small amounts of meat a few times never got caught. So I got brave an atempted to bring in a good amount. Got caught and put on a watch list for 5 years."}, {"username": "Linda Miller", "comment_text": "FYI: https://\nwww.tsa.gov/\ntravel/\nsecurity-screeni\nng/\nwhatcanibring\n\nhttps://\nwww.cbp.gov/\ntravel/\nus-citizens/\nknow-before-you-\ngo/\nprohibited-and-r\nestricted-items"}, {"username": "Heath Conn", "comment_text": "No for the meat."}, {"username": "Luciana D'Angelo", "comment_text": "No pork meat, vacuum sealed hard cheese yes."}, {"username": "Luciana D'Angelo", "comment_text": "My brother had a prosciutto sandwich and they took it from him at customs returning to Canada"}, {"username": "Maria Y Alexieva", "comment_text": "A month ago, I had a small water bottle full of sand and shells from the Bahamas in my suitcase. Since I had a connection in Miami, I had to pass through the security. I almost ended up in jail because it had reacted in explosive testing. I wouldn't take anything that might result in manual check of my luggage because TSA are unpredictable. Moreover importing raw meat with luggage is forbidden. Of course it's possible not to get caught, but is it worth the risk. The average number of people in jail per capita in the USA is, if not the highest, then in the top 5 in the world. Not because crime rates are so high, but because jails are private and it is a huge business. Don't give them a reason to make you a criminal only for the love of prosciutto."}, {"username": "Nancy Lewis", "comment_text": "I buy food items to take home within the airport after security. Some airports have mini gourmet stores near gates. In Denmark I bough smoked salmon marinated herring. In Italy I bought several little pots of dried herbs, tomatoes seeds, prosciutto etc. some stores had cooler packs or freezer packs to keep some foods chilled."}, {"username": "Elena Paonessa", "comment_text": "Elena Paonessa"}, {"username": "Eric Hvezda", "comment_text": "I was there recently, and I was able to bring back the Parmesan cheese in my checked luggage"}, {"username": "Lucio Pontecorvo", "comment_text": "Nope"}, {"username": "Phyllis Flowers", "comment_text": "Cheese yes ham no"}, {"username": "Phyllis Flowers", "comment_text": "6 litters of olive oil and 6 wheels of cheese. I end up leaving cloths in Italy to bring back goodies. Don’t overpack or bring an extra case for fresh pressed EVO you can’t buy that quality here for that price"}, {"username": "Paul N Marietta Dodson", "comment_text": "My brother will never travel back through the Miami Airport because the customs agent took his mortadella 😅"}, {"username": "Linda Wallace Smith", "comment_text": "We had sausage confiscated in NYC. But cheese was fine."}, {"username": "Angelina V. Marchio Tucker", "comment_text": "How about wine and olive oil"}, {"username": "Roxanne Kellogg", "comment_text": "I’m have an “I Love Lucy” memory of her and Ethel eating a boatload of cheese while flying back to the states!😂"}, {"username": "Patty Oaks", "comment_text": "USDA website has info to be relied on."}, {"username": "Alexandra A Welker", "comment_text": "Per this website cured hams (prosciutto, Serrano ham, Iberian ham) and salami from areas within France, Germany, Italy and Spain may not be brought into the United States by travelers. These items may only enter in commercial shipments because there are special restrictions that require additional certification and documentation. https://\nwww.aphis.usda.g\nov/aphis/\nresources/\ntraveler/\nintl-travel/\nmeat-poultry-sea\nfood/\nmeat-poultry-sea\nfood#:~:text=Tr\navelers%20may%2\n0bring%20back%2\n0fresh,the%20pr\noduct's%20count\nry%20of%20origi\nn."}, {"username": "Julie Stevenson", "comment_text": "PORK is a Strict NO"}, {"username": "Kelly Ann", "comment_text": "You can bring back cheese\nBut no meat is allowed"}, {"username": "Maria Angela Perrone", "comment_text": "No pork"}, {"username": "Antonello La Ferrara", "comment_text": "Only small quantities of air sealed products. If it’s not air sealed and they check your bags they will take them away from you, and you may incur in a fine."}, {"username": "Colleenmaaske Maaske", "comment_text": "No"}, {"username": "Serena Mascheretti", "comment_text": "Only aged cheese."}, {"username": "Lisa McMurchie", "comment_text": "I brought back Parmesan"}, {"username": "Laurie Ingram Bain", "comment_text": "Only hard cheese, no meat."}, {"username": "Fred Tempes", "comment_text": "I think, yes. I brought back chunks of guanciale for carbonara and some nice ricotta salata— no problem"}, {"username": "Mary Cammisuli", "comment_text": "Cheese yes, it needs to be vaccuum sealed and the cheese shops will do that for you. I brought back 2 kg of parmesan from Bologna 😂"}, {"username": "Sherri Leis Dillavou", "comment_text": "Some cheeses but no meat"}, {"username": "Pat Cray", "comment_text": "I brought cheese back"}, {"username": "Ronald Johnson", "comment_text": "Be careful. Check. You’d be surprised at what is, or is not allowed.\nAlso, just because something is sold at the airport doesn’t mean you can take it home either. I have travelled a lot and rarely would consider bringing home a food item; even the customs screeners don’t know how to interpret the regulations sometimes"}, {"username": "Stacy Derouin", "comment_text": "Cheese yes, ham no. You can Google the regulations for specific details."}, {"username": "Hassan Ali Maki", "comment_text": "Any cooked food but not raw."}, {"username": "Robin Kronick", "comment_text": "If it shrink wrapped yes, for both"}, {"username": "Jane Allen", "comment_text": "Parmasan"}, {"username": "Pietro Adami", "comment_text": "Take some bread with you too, make a ham & cheese sandwich once landed, and eat it all before customs.\n:-)"}, {"username": "Alla Zats", "comment_text": "You should check USDA rules. There are dogs deployed at international arrivals at Boston Logan, for example,- if the dog marks you, your luggage will be searched for food and you might get in trouble."}, {"username": "Anthony Sperduti", "comment_text": "Hard cheese"}, {"username": "Heidi McLean", "comment_text": "I once got a prosciutto sandwich at the Rome airport to eat on the plane and had to throw it out at security checkpoint."}, {"username": "Brenda Crossin", "comment_text": "Check out aphis.usda.gov/\naphis/resources/\ntraveler/\nintl-travel/\nmeat-poultry-sea\nfood/\nmeat-poultry-sea\nfood\n\naphis.usda.gov/\naphis/resources/\ntraveler/\nintl-travel/\nmilk-dairy-eggs/\nmilk-dairy-eggs"}]}, {"id": "2194074210991657", "text": "CIAO! I would LOVE opinions & suggestions or any input on my itinerary I roughly put together for our 25th annv. trip NOV 26-DEC 19 - we have 22 nights not including overnight there!\n-Would love any 4-5 star hotel suggestions with views of major attractions in each city! (Besides ORVIETO we have no hotels picked yet)\n- IF ANYONE did a VOW RENEWAL in VENIZIA would LOVE to hear reccos on that!! GRAZIE!\n\n-3 nts BOLOGNA (get settled, FERRARI Museum & VIP experience, enjoy city & food)\n-3 nts MILANO (Duomo, last supper, visit como, bellagio, and lugano)\n-STOP in VERONA for city tour/lunch on way to VENIZIA\n-4 nts VENIZIA (renew vows on gondola, enjoy city & food, Burano visit)\n-4 nts FIRENZE (Duomo, Pisa & Lucca day trip, Siena & San Gimignano day trip, enjoy city & food)\n--2 nts ORVIETO (Olive Grove & Wine Vineyard stay at ALTAROCCA RESORT, Cooking lesson, wine & olive tastings, enjoy city & food)\n-2 nts NAPOLI (Pompei, Herculeum, Mt Vesvius tours, PIZZA!)\n-4 nts ROMA (Vatican, Sistine Chapel, Pantheon, Roman Forum, Colosseum, St Peters, Trevi Fountain, Spanish Steps, enjoy city & food)", "link": "facebook.com/groups/1373361046396315/permalink/2194074210991657/", "likes": 1, "comments": []}, {"id": "2194065044325907", "text": "Best way to get from Venice to\nPisa, then Florence?", "link": "facebook.com/groups/1373361046396315/permalink/2194065044325907/", "likes": 1, "comments": [{"username": "Mike Ball", "comment_text": "There is no direct train service from Venice to Pisa, you actually have to change trains in Florence to get to Pisa, so you would actually be better doing Florence and then Pisa ."}, {"username": "Sharet Mendez", "comment_text": "Train🚅"}, {"username": "Bob Lampo", "comment_text": "Good app to use for travel planning is called Rome2Rio. Call it up in a browser and it gives you train car bus air every walking routes as you ask.\nYou can even enter specific address/\nairports hotels and it give you the combinations needed to complete your route."}, {"username": "John Licata", "comment_text": "To skip Pisa"}, {"username": "Enrico Lecce", "comment_text": "Enrico Lecce"}, {"username": "Teresa Helena Basevi", "comment_text": "By car! You can rent one at Mestri airport."}]}, {"id": "2194081940990884", "text": "Hi! If you've visited Italy between Christmas and New Year's, I'd love to know what it's like. Crowded? Businesses closed/open? Certain regions better than others?", "link": "facebook.com/groups/1373361046396315/permalink/2194081940990884/", "likes": 0, "comments": [{"username": "Adryn Sumner", "comment_text": "It’s the best time to go imho. We took a villa outside of Florence from November - March and loved it beyond imagination. Vastly better than when we were there in the spring and in summer. Day trips all over the area were amazing. When we return, it will definitely be in the fall/winter months. Businesses open and decidedly not crowded. Much more interaction with the locals."}, {"username": "Jennifer Dombrowski", "comment_text": "As you might remember Missy, I lived in Italy for years! It’s very, very quiet. If you’re going to go during that period, I suggest sticking to larger cities where there will be things to do and businesses open. In smaller towns, locals take the opportunity to close down everything from restaurants, wineries and shops to even smaller attractions."}]}, {"id": "2194082767657468", "text": "How would you recommend I get my family of 4 from Rome to Paris in December. Looking for the quickest, cheapest, and most convenient way. Thank you !", "link": "facebook.com/groups/1373361046396315/permalink/2194082767657468/", "likes": 0, "comments": [{"username": "Gary W Anderson", "comment_text": "Quickest air flight, cheapest by rail and most convenient air flight, most beautiful by rail"}]}, {"id": "2194084590990619", "text": "We are going to Naples for a couple of nights. Does anyone have any suggestions on where to stay. There are 4 of us and we will be traveling by train from Rome.", "link": "facebook.com/groups/1373361046396315/permalink/2194084590990619/", "likes": 0, "comments": [{"username": "Scott Perry", "comment_text": "I stayed in Chiaia a few weeks ago. Only a couple train stops from the center. I loved that area."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2194084080990670", "text": "Does anyone have photos and experiences in Positano/Amalfi Coast in December & January? Pleas tell!!", "link": "facebook.com/groups/1373361046396315/permalink/2194084080990670/", "likes": 0, "comments": [{"username": "Kay Rendall", "comment_text": "That area almost closes totally down. Most hotels, b&b 's, restaurants close up for winter. The ferries stop running because of weather and I think everything but school buses stop running."}]}, {"id": "2194084794323932", "text": "Does anyone know if there is a way to buy skip the line tickets to Doge's Palace without doing a tour? I have looked on the main website and I know people have loved the secret itineraries tour, but I don't think my kids will love the torture chamber/prison parts. Plus we are doing lots of other tours so would be a good way to save some $$$! Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2194084794323932/", "likes": 0, "comments": []}, {"id": "2194087237657021", "text": "Trying to decide on an Airbnb in Rome. The two areas I’m choosing from are Vatican City area or Salario. Anyone have any advice or experience staying in either of those areas? Thanks in advance", "link": "facebook.com/groups/1373361046396315/permalink/2194087237657021/", "likes": 0, "comments": []}, {"id": "2194088447656900", "text": "We are renting a car from Rome to Puglia to Amalfi Coast then dropping off the vehicle in Florence. My aunt has driven all over Europe but I’m weary. For those that hired private drivers. What companies did you use and approx cost?\n\nThank you so much!!!!", "link": "facebook.com/groups/1373361046396315/permalink/2194088447656900/", "likes": 0, "comments": [{"username": "Steve Grossman", "comment_text": "Ridiculously more than renting a car. And you can do that, we do it all the time. Driving on the auto strata is very easy. It's like being on any big American highway. You can do it easily"}, {"username": "Belinda Morris", "comment_text": "MyDayTrip is great for private transfers in Europe - they allow you to stop at places on the way (no touring there, driver stays with car). They seem expensive but once you consider cost of petrol, parking, tolls and the hassle, it can be worth it, depending where you want to go exactly. This is a door to door service so you can stay in centre of towns without having to try to fight for a park. I highly recommend…"}]}, {"id": "2194117924320619", "text": "We are heading into Rome for a 10 day cruise... anyone sail with norweigan before? We get into Rome at 730 am and don't have to be on the boat until 3pm...anything fun we can do while we're waiting??", "link": "facebook.com/groups/1373361046396315/permalink/2194117924320619/", "likes": 0, "comments": [{"username": "Kay Rendall", "comment_text": "Usually takes quite some time to board. Customs etc. Forms to fill out.\nQuite a few people boarding. Ship will leave at 3 regardless, if that is sailing time. A friend mine got left behind because she wasn't there in plenty time before to board"}]}, {"id": "2194117530987325", "text": "I am flying into Venice and then going to Cinque Terra. Thinking about detouring to the Dolomites first. So I can either have 4 nights in Venice and Cinque Terra or 3 nights each and goto Dolomites for 2 nights. Thoughts? Opinions? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2194117530987325/", "likes": 1, "comments": [{"username": "Megan Dow", "comment_text": "I would do the latter. 3 nights each in Venice and Cinque and 2 nights in the Dolomites assuming that you will stay in a town at the foot of the Dolomites and not in the heart of the mountains"}, {"username": "Robin Burrell", "comment_text": "4 nights in Venice is a lot, I would do 3, Dolomites 3 CT."}, {"username": "Jekaterina Valujeva", "comment_text": "2 nights Venice is enough."}, {"username": "Bev Madill", "comment_text": "You need to factor in travelling time between areas. Italy shouldn't be rushed. There's a lot to do in all those places. 4 nights in Venice allows you to see the usual sites but also wander around which to me is what travel is all about. 4 nights in the CT means you can see all the villages, go to beautiful Portofino for the day and maybe Portovenere another day. Good luck with whatever you decide."}, {"username": "Krissy DaRusso", "comment_text": "Less time in Venice!"}, {"username": "Lauren Ako", "comment_text": "We stayed in Santa Margherita and went to cinque Terre by train. Very crowded there now. I suggest travel by boat. The sea was too rough that day for boat. Loved Santa Margherita and Portofino ."}, {"username": "Heidi Littman Meiers", "comment_text": "depends on what you like to do but the Dolomites are someplace you could easily spend 3-4 days... and our hotel said skip lago de Braises , totally packed with Instagram tourists these days, also lake not full due to lack of spring rain"}]}, {"id": "2194126840986394", "text": "We are travelling from New Zealand and thinking of travelling down the east coast of Italy. We have already been to the key cities. Comments appreciated.", "link": "facebook.com/groups/1373361046396315/permalink/2194126840986394/", "likes": 0, "comments": [{"username": "Rita Palmer", "comment_text": "Puglia area"}]}, {"id": "2194130577652687", "text": "Good morning,\nwe will be off to Sorrento for 10 days very soon and want to visit Positano Rome Pompeii and possibly Amalfi Coast. Could you please advise best ways to book trips and best transport options. Also\nDo any need to be booked in advance. Thanks so much 🙏", "link": "facebook.com/groups/1373361046396315/permalink/2194130577652687/", "likes": 0, "comments": [{"username": "Vicki OBrien Lush", "comment_text": "Following"}, {"username": "Janice Rea", "comment_text": "Mondo tours did a driver to Amalfi coast cities. Ferry to Capri and Blue Grotto. Best to book ahead. Italy is crowded."}, {"username": "Marcia Levy", "comment_text": "You can take a day trip toPositano by ferry and book a tour of Pompeii. We just hired a guide for - 2 hour Pompeii tour. It worked out very well. Our hotel arranged it. You can take the ferry to Capri. Book everything advance."}]}, {"id": "2194147374317674", "text": "This is a post for my fellow Aussies after we have just had our best 24 hour transit ever flying economy. We flew emirates Melbourne Dubai Dubai Bologna ...try if you can to leave at night we flew out at 9.30pm which was perfect .Both legs we booked an aisle and window seat and were so lucky to have no one in the middle (doesn't always work but worth a try ) After a feed I watched Wimbledon lady's final with a Red and then slept the whole way ( which I never do usually) now the game changer ..we had a 4 hour stopover in Dubai and booked a lounge with a shower for the first time ...what a difference a shower made . It cost $150 aus $ for the two of us with included food and drinks which was less then what we spent on our last stopover in a bar at Dubai (we only had two drinks ). The flight time was perfect as we arrived in Bologna at 2.30 pm so had a walk around a few aperols and bed by 8.30 pm ...The irony we are in the food capital of Italy and we were so full from being fed on the flights we couldn't manage dinner 🤣 today will be different !! ..Had a great nights sleep I have just been for a big walk and ordered my first cappuccino in Italian (have been taking lessons ) .Hope this helps as the long haul from Australia can be daunting but it really isn't that bad 😅", "link": "facebook.com/groups/1373361046396315/permalink/2194147374317674/", "likes": 1681, "comments": [{"username": "Sandra Wilson", "comment_text": "I am always fine on the way over, I think it’s the excitement of holiday times but coming home is a different story. Alternative is don’t go so just we just deal with it.\nJust reading a book based in Bologna , sounds fab. Haven’t been there. Enjoy."}, {"username": "Debbie Volker", "comment_text": "We have used free showers at terminal 3 in Dubai . A nice shower certainly makes all the difference"}, {"username": "Jill Coward", "comment_text": "I am off to the UK and France in two weeks and I have been told about an E Sim which I am yet to investigate but a friend is using one now."}, {"username": "Susan Coughtrey", "comment_text": "We only had an hour stopover in Dubai, bought a couple of coffees on our way to the next gate, when we checked our card statement saw we’d been charged $27 AUD 😱"}, {"username": "Yvonne McKenzie", "comment_text": "What wonderful info."}, {"username": "Alice Francesca", "comment_text": "Hope you ordered your cappuccino before 11 am;) not after."}, {"username": "Natasha Troop", "comment_text": "Where did you book the lounge with a shower?"}, {"username": "Elizabeth Neal", "comment_text": "Bologna is fantastic 👏"}, {"username": "Jenny McGoran", "comment_text": "Thanks, this is great information!"}, {"username": "Jill Godfrey", "comment_text": "Thanks for sharing your experience. I’m doing a similar flight in 6 weeks with emirates, stop over Dubai, enroute to Amsterdam.\nThe lounge booking sounds perfect.\nEnjoy your adventure✈️✈️"}, {"username": "Belinda Winchester", "comment_text": "Leanne O'Rourke may be a good idea for you. Please read"}, {"username": "Jenny McEntyre", "comment_text": "We’ve done that flight a few times and find leaving at night helps the body clock adjust better. We always have a shower at Dubai, which is so refreshing. Though just a the public ones as didn’t know about booking a lounge! Will definitely do that next time. We have only had a quick changeover time though, which made it all a bit rushed. But the good thing was we arrived at our destinations in Europe early in the day and ready to hit the ground and do a full day before collapsing into bed."}, {"username": "Fran Cansdell", "comment_text": "Sounds good. 🤗"}, {"username": "Denise Sumpton", "comment_text": "Sandra Saad Sally Saad"}, {"username": "Debbie Distefano", "comment_text": "Hi Andrea I’m interested to know what lounge you went in. When we tried to do this it was much more expensive."}, {"username": "Annette Cavill", "comment_text": "Emirates is the best way to fly long haul, Singapore Airlines is also good but they don't go everywhere."}, {"username": "Heather Schütze", "comment_text": "You can get a free shower in most airports. I got one in Dubai and Auckland (a first for me). Just take your own towel with you (micro-towels fold up small enough for hand luggage. I had none but paper towels can also do the trick when it's so hot. (Another first for me!)."}, {"username": "Ann-Marie McCann", "comment_text": "Great 👍 to hear"}, {"username": "Natalie Ryan", "comment_text": "Thanks for the information, flying Emirates for the first time next April Bris-Dubai, then Dubai- London. Feeling a bit overwhelmed as to what seats to choose."}, {"username": "Sue Gallagher", "comment_text": "thank you"}, {"username": "Bronwyn Lind", "comment_text": "Great post! Very much appreciate your recommendations\n! Nice to have an Aussie viewpoint on travel 😀"}, {"username": "Wan Tan", "comment_text": "As a solo traveller, I really resent couples who book their seats this way."}, {"username": "Melinda MacBeth", "comment_text": "We’re just back doing the 9.30pm out of Melb with Emirates. We too attempted the window aisle trick for our 4 legs and found someone in the middle each time. No big deal though. We arrived in Milan around 2.30pm also, in bed asleep by 8.30pm & zero jet lag which was fabulous. Couldn’t say the same coming home, Dubai Melb seemed twice as long but I guess there’s no adrenaline pushing you on coming home."}, {"username": "Kerry Anne", "comment_text": "We flew Emirates too from Brisbane to Berlin then return Rome to Brisbane. My son is on spectrum so ordered bland food. That is salmon and cod to them. Not to my son it’s not. Or me for that matter. Ask for kids meals instead even though they are not kids. My food was great. I actually gave half to my son. Flights were good and we had extra leg room. Our flights home to Brisbane some deal on food. However, understand you cannot purchase duty free alcohol that’s right no limoncello to take home as you cannot take it on your connecting flight Dubai to any Australian city. They will confiscate it. It’s nothing to do with Aus by the way. Emirates are great but be aware as it is disappointing when you grab some last minute gifts but can’t purchase them. But I wish we’d had that lounge and shower. Thank you for sharing."}, {"username": "Judith L. Dick", "comment_text": "Thank you for this. It’s very helpful as I am flying from Scotland to Sydney with Emirates in October and have been wondering about plane seats, I’m travelling solo, and showers etc."}, {"username": "Stacey Nadine DeRosa", "comment_text": "Anthony De Rosa"}, {"username": "Lynda Ogden Fitzsimmons", "comment_text": "Helen Valero.xoxo"}, {"username": "Judy Phipps", "comment_text": "We were in Italy recently and we ordered cappuccinos anytime of the day and nobody cares as long as they are making money."}, {"username": "Fiona Cameron", "comment_text": "I have flown this route a few time but Rome not Bologna. My best tip was to take a flight out of Sydney (where I live) with at least a 10 hr stop over In Dubai. There is an airside hotel where you can book rooms for a set number of hours, so you get your own room a shower/bath and a huge bed.\nI flew business class the first time and just used the business lounge for a shorter stop over, but the hotel stay (economy flights this time) was actually much better and much cheaper!!\nAlso with Emirates, if you book a flight with a stopover of more than 8(?) hrs they will offer you a free hotel stay…. But you don’t get to choose the hotel and it is outside the airport so you have to do the whole check in security stuff again for ongoing flights. This option appears in “Manage bookings” after booking is confirmed, but they don’t tell you upfront so best to check. Transport is provided to the hotel you are allocated and return to airport. I have taken this option but preferred the airside hotel, less hassle and worth the $$."}, {"username": "Michelle Watson", "comment_text": "Helps me a lot! I’m going to Sicily in November and I’m going to do exactly that!\nI love a night flight from Melbourne if possible too.\nWent to Europe in May and had a 5am melbourne to Lisbon. via Dubai and it was a killer!"}, {"username": "Elisha Layton", "comment_text": "Tia Fattore"}, {"username": "Lara Clark", "comment_text": "How do you book the lounge if you don't fly business? 🤔"}, {"username": "Susie Cristiano", "comment_text": "Paul Cicciarello"}, {"username": "Mike Marshall", "comment_text": "I usually just go up to the counter and say, “Cappuccino” and they serve me one. It looks like I saved a lot on lessons."}, {"username": "Raine Mitchell", "comment_text": "We also flew Emirates in June. Melbourne-Dubai\n- Rome and back from Athens-Dubai-Me\nlbourne. Had great flights with them."}, {"username": "Amanda Bennis", "comment_text": "Mary Halpin - this lounge thing is a good idea I reckon!"}, {"username": "Julie Atkins", "comment_text": "We've booked a lounge in a few airports on long haul flights and it makes such a difference. Lucky to get the spare seat😊😊"}, {"username": "Dena Morgan", "comment_text": "Where did you stay in Bologna? Was it easy to get to from the airport and how much did they charge? Did it include breakfast? Thanks."}, {"username": "Tracey Whiteford", "comment_text": "It's a long haul to anywhere when we're flying from Australia 😁 great when you can make it as relaxing as possible , well done !!!"}, {"username": "Mandy Mandy", "comment_text": "Rick Bishop night flight ✈️"}, {"username": "Guiseppi Salerno", "comment_text": "Shirley Salerno"}, {"username": "Sue Simmonds", "comment_text": "we are doing a similar flight....Brisb\nane departure 250AM...4 hour stopover in Dubai, then 5 hour trip to Zurich, thankfully we have access to Emirates Lounge. Spending several weeks in Austria then...self directions thru Italy for 2 5 weeks 😁, excited much!!"}, {"username": "Belinda Jane", "comment_text": "Joanne Dorn some handy tips"}, {"username": "Sharon Dalton", "comment_text": "I love Italy! ❤️"}, {"username": "Helen Nelson", "comment_text": "I flew the long haul from Aus to Athens over a month ago with Emirates. Flights were good and layover not too bad. I’m dreading the return flights next month because I have 12 hours layover in Athens before I even start my Emirates flights. Always sleepy when I get home from the west to east journey. That’s what we get for living in Aus."}, {"username": "Patricia Tosi", "comment_text": "Wow thanks for all the tips"}, {"username": "Marlene Biddle", "comment_text": "Flying Emirates September Melbourne Dubai 1st leg with 2 nights stopover...and then onto Lisbon. Return same...thought we'd splash out and we have the time."}, {"username": "Lisa Cottrell", "comment_text": "Hi Italy lovers. We are looking to go to Southern Italy next year. We want to use trains or private transfers for our trip , spending 2 or more weeks , with Sicily as well. We have done northern Italy a few times but never south of Rome . Any tips , advice, places to see and stay much appreciated !"}, {"username": "Connie Bailey", "comment_text": "We loved Bologna…the only negative was I wanted to try Spaghetti Bolognaise from where it originated & struggled to find any restaurant that offered it. Finally I did & to my disappointment wasn’t anything to rave about…my husband reckons the one I make at home is way better!!🤷🏻‍♀️"}, {"username": "Wendy Morelli", "comment_text": "Thank you for your positive post! 😜😜😜I am flying to Rome\nvia Dubai next week. Can I ask how you booked a shower in Dubai, please."}, {"username": "Denece Sims", "comment_text": "Penny Clarke just fyi"}, {"username": "Debbie Latham", "comment_text": "Enjoy Bologna"}, {"username": "Liz Arcuri", "comment_text": "$150 for two drinks in Dubai, they must have been pretty good. I have never paid that?"}, {"username": "Marianne Patching", "comment_text": "John Withoos Sonja Withoos\nWhat we were talking about last night."}, {"username": "Anne Elizabeth Adams", "comment_text": "Thank you for the tip."}, {"username": "Sue Tudor", "comment_text": "Brilliant"}, {"username": "Julie Ruffy", "comment_text": "How about some Bologna tips - I’ll be there soon!"}, {"username": "Gail Levingston", "comment_text": "Wow! That's awesome!"}, {"username": "Gail Levingston", "comment_text": "Robyn Hodder-Macneill"}, {"username": "Jane Fisher", "comment_text": "Great advice!"}, {"username": "Susan Johnson", "comment_text": "Well executed,enjoy your travels."}, {"username": "Renata Davidson", "comment_text": "I'm doing something similar next month. So glad to hear the feedback. Am definitely booking g a shower in Dubai!"}, {"username": "Richelle Trezise", "comment_text": "Thanks we to are flying out of Sydney at 8.30pm. Just wondering first time flying etihad do they have a lounge and how do you book it"}, {"username": "Cheryllin Middleton", "comment_text": "Yvonne Pride"}, {"username": "Jannine Campton", "comment_text": "Great post. I always choose my flights according to their arrival time at destination. Must be afternoon so I can get to bed early, after the 24 hr journey I sleep like a log with the help of an over counter sleeping pill. Never have jet lag. Next time I’m going to add your tip of booking lounge and shower on the stopover."}, {"username": "Lisa Simmons", "comment_text": "On the subject of Bologna\nfor the petrol heads\nTour of Ducati factory and the museum book on line it’s just out of town . Taxi best .\nGreat city, fab food love the porticos"}, {"username": "Natalie Perrett", "comment_text": "Sue Jennion"}, {"username": "Leanne Waite", "comment_text": "Jo Mounsey - some good tips for the stop over"}, {"username": "Karen Cotogno-Young", "comment_text": "Bianca Young"}, {"username": "Debbie Morton", "comment_text": "I Hope that you didn’t order after 11am 🤣. Seriously though, kudos for surviving in Economy. Bologna is fabulous. Do you need directions to Luisa Spagnoli?"}, {"username": "Connie Aitken", "comment_text": "We found free showers in abu Dhabi near (gate 35) , and yea if you are prepared , a shower after 14hrs on a plane is bliss ! 😊"}, {"username": "Cheryl Kavanagh", "comment_text": "Andrea, I am from Australia to, flying Emirates, your experience sounds great, can I ask you about your mobile, did you buy a sim card when you arrived at the airport to operate your phone and is it easy to install thanks 🙂"}, {"username": "Rose Leggett", "comment_text": "We flew Emirates to Barcelona really good trip also did the lounge for stop over 😊"}, {"username": "Fran Bonanno", "comment_text": "Thanks for the info re Dubai- that’s a short 4 hour stopover for us in Oct\nWill definitely book into a lounge 👌"}, {"username": "Lynda Blackley", "comment_text": "We are flying (30/8) Sydney - Korea (3 night stop over ) with Korean Air, then\nKorea - Rome\nThen coming home ( end Sept ) Emirates\nVenice - Dubai ( 4 night stop over )\nDubai - Sydney"}, {"username": "Ness Layton", "comment_text": "Elisha Layton"}, {"username": "Tracey Rigby", "comment_text": "Dubai has free showers. just carry a small hand towel and soap"}, {"username": "Trish Devlin", "comment_text": "Oh great info and comments thanks Andrea !"}, {"username": "Carol Fayers", "comment_text": "What a fab post! We are flying emirates in September and I have been wondering about the lounge."}, {"username": "Miyuki Kanno Paul", "comment_text": "Sleeping during the flight is key! We are from west coast of USA, so fly out first in the morning to the east coast, 2-3 hour layover for 5 pm-ish departure to Italia for early morning arrival. We stay up as long as possible during daylight"}, {"username": "Lisa Woollard", "comment_text": "Zeza Korbay"}, {"username": "Kasey Summers", "comment_text": "Does anyone know if Qatar has anything similar?"}, {"username": "Julie Piontkowski", "comment_text": "Must have lasagna!!\nWe loved Bologna❤️"}, {"username": "Lorraine Klein Lynch", "comment_text": "That sounds like a lovely vacation on its own!"}, {"username": "Karen Rockwell", "comment_text": "Love your story..."}, {"username": "Enza Russell", "comment_text": "Thank you for sharing, this will help with my plans as a fellow aussie. Buon divertimento! 😊"}, {"username": "Karen Williams", "comment_text": "We did much the same flying to Ireland. A restfully few hours and a shower in Dubai were the answer, oh and arrival times in afternoon."}, {"username": "Rebecca Goldsmith", "comment_text": "Fellow Aussie her just wondering if anyone has flown Perth to Doha and used the lounge service there. We fly out next month and have a 3 hour layover wondering if that will be enough time to use lounge and have a shower?"}, {"username": "Raquel Pickering", "comment_text": "OMG how amazing! Fellow Aussie here that flew emirates (best airline ever!!!) from Sydney -Dubai - Dubai - Rome. We only had a 90 minute layover in Dubai which was good, but i totally agree on the idea of planning to arrive in the morning or afternoon. We got there at - i kid you not - 11.55pm and we just got straight onto a bus to the Rome Termini and crashed. It was horrible. Pitch black, so tired (cannot sleep on a flight) and our body clocks were hammered! I will really plan to have a leisurely layover in Dubai now! I am assuming that you can book the showers etc through their website?"}, {"username": "Colleen Pound", "comment_text": "Thanks for the advice I am off to Italy in 2025 so am compiling lots of tips now"}, {"username": "Kiralee Philpot Phillips", "comment_text": "F"}, {"username": "Narelle Pacey", "comment_text": "Did you have a neck pillow.. I am looking into it ?? Too bulky to carry around.. won’t work anyway … what are your thoughts"}, {"username": "Kathleen Konarew", "comment_text": "Such helpful advice. Thanks so much. Lounge sounds perfect."}, {"username": "Kathleen Konarew", "comment_text": "Dianne Sutherland"}, {"username": "Cynthia Talone", "comment_text": "Barbara De Luca"}, {"username": "Priscilla Keith", "comment_text": "Great advice. Very practical. We are in Aus and I am also contemplating the trip with teengers. It's feels a long flight!"}, {"username": "Robyn Amos", "comment_text": "Thank you for the tips - hoping for the best in economy!"}, {"username": "Carly Maree", "comment_text": "Lyn Boyd"}, {"username": "Catherine Schopen Rodriguez", "comment_text": "Brava!"}, {"username": "Maryanne Grieve", "comment_text": "Shania Grieve"}, {"username": "Sheila Gale", "comment_text": "We are also flying emerites though from Sydney-Dubai-Na\nples 2nd Sept. Arrive Naples 12 noon and only 2-1/\n2 hrs in Dubai. Coming back we fly from Venice-Dubai-Sydney with a 23hr lay over in Dubai. Emerites are supplying a hotel room free of charge with food for the lay over. Have flown Emerites before and had no complaints"}, {"username": "Jenny Redman", "comment_text": "Does anyone know if there is a Lounge facility, showers etc in Doha please?"}, {"username": "Mellanie Jayne Polwarth", "comment_text": "Justin Polwarth"}, {"username": "Rebecca Korpershoek", "comment_text": "Yup I mostly only fly with Qantas/\nEmirates international, never had a issue with lost luggage, roomy enough for economy and service is top fantastic.\nFlying out next week to Milan to stay in the countryside with family, can’t wait 😎"}, {"username": "Jason Sumner", "comment_text": "Excellent advice"}, {"username": "Catherine Moore", "comment_text": "Thanks Andrea for your synopsis as I will be doing a similar flight from Brisbane in September and was wondering about booking a lounge. Which lounge did you book?"}, {"username": "Nicole Buchanan", "comment_text": "Sounds very well planned have the best time. We are going home today 😢"}, {"username": "Julie Norris", "comment_text": "I'm booked to fly out of Sydney to Rome at 845pm with Emirates. Last year I did 6am departure which was a huge mistake. I love that I arrive at 1.30pm this year. Never thought of doing the shower option in Dubai though 😊"}, {"username": "Sharon Hiesler", "comment_text": "Marcus Hiesler"}, {"username": "Nerida McKay", "comment_text": "I was planning to look into this for our trip next year, thanks for the info 😊"}, {"username": "Leonie McConnell", "comment_text": "Great info, thanks. Will add this to our trip in October 👍🏼"}, {"username": "Liz O'Halloran", "comment_text": "Sounds like a plan Thanks for sharing Andrea Bourke"}, {"username": "Joanne Izenberg", "comment_text": "We are doing Sydney/ Perth / Rome in September with Qantas. Nearly 16 hours straight from Perth!! 😱😫. Flying via Dubai on the way back. Good to know. Thanks"}, {"username": "Vern Green", "comment_text": "Andrea Bourke, we are Going to Italy from Australia next month. Will be in Bologna for 3 days. Can you give some feedback on what and where are the things to see and places you enjoyed to eat. Would be great"}, {"username": "Lina Mercuri-Caminiti", "comment_text": "Well done.\nFrom a fellow Aussie, I can say that the flight is always the worst part.\nMust try that stop over shower, sounds great!.\nEnjoy your stay, I hope you like the heat!.. 😊"}, {"username": "Julia Muller", "comment_text": "If you can manage those perfectly timed flights you’re on a winner 🙌"}, {"username": "Lisa Silvestri", "comment_text": "Andrea I researched this too but was hesitant to book as we only have just under 2 hour stopover … do you think 2 hours is too short a time to book Premium Lounge tickets?\nThank you 😊"}, {"username": "Natalie Ryan", "comment_text": "Thank you for sharing!!!"}, {"username": "Josie Gilbert", "comment_text": "We have travelled from Sydney to Italy 3 x with 3 kids, whilst the flight is a punish it is worth it after just one day of being back in Italy."}, {"username": "Simone Wright", "comment_text": "We love flying at night\nWe leave Friday night for Paris stop over in Singapore then land CDG 21.15 pm sleep and rise ready for the adventure\nPs booked a lounge in Singapore going and coming home as last time we were stuck in Hong Kong airport and was horrible… this time winning 🍷🍕"}]}, {"id": "2194147657650979", "text": "Hi all, Can anyone recommend a private Driver in the Amalfi coast we are in Maiori and need to get to Salerno in a couple of days to catch a train. The ferry might be pushing it time wise.", "link": "facebook.com/groups/1373361046396315/permalink/2194147657650979/", "likes": 0, "comments": []}, {"id": "2194148764317535", "text": "Hello, lovely travellers! My husband, two-year-old, and I are travelling from Naples to Ischia in September. We've looked at quotes for transfers from the airport (NAP) to our hotel on the island. For this journey, Iscla Travel has quoted €99 total while the hotel has quoted €83 per person (our child would be free). I have two questions that I'm hoping you can help with:\n1. What do you think accounts for the large difference in quotes?\n2. Have you used Iscla Travel? How was your experience?\nThanks in advance for your help!", "link": "facebook.com/groups/1373361046396315/permalink/2194148764317535/", "likes": 0, "comments": [{"username": "Kay Rendall", "comment_text": "Does the quote include ferry from Naples, then transfer to your accomadation. 93 euro total including ferry doesn't sound right to me, but not sure which area Ischia u r staying."}]}, {"id": "2194152267650518", "text": "Hi everyone, are you best to purchase a sim card from the airport when you land in Italy,I would like to be able to make calls as well as messenger is that possible? Thanks in avance, 🙂", "link": "facebook.com/groups/1373361046396315/permalink/2194152267650518/", "likes": 1, "comments": []}, {"id": "2194156750983403", "text": "If you are visiting beaches, lakes, rivers it is a great idea to have reef shoes with you, often you have to walk over rocks and pebbles in and out of the water and without adequate footwear it can be a nightmare", "link": "facebook.com/groups/1373361046396315/permalink/2194156750983403/", "likes": 3, "comments": []}, {"id": "2194157547649990", "text": "Hello. Visit napoli in September. Any suggestions for cruise travels??where we can go inside the napoli for 🏊‍♂️???we will stay only 4 days", "link": "facebook.com/groups/1373361046396315/permalink/2194157547649990/", "likes": 0, "comments": []}, {"id": "2194163790982699", "text": "Me and my daughter are going to Italy and want to visit, Rome, Venice, Florence and Milan for 10 days , I was wondering if we will have enough time to visit them all and also if is better for us to plan the trip ourselves or just booked the tour and trip packages?", "link": "facebook.com/groups/1373361046396315/permalink/2194163790982699/", "likes": 26, "comments": [{"username": "Julia Muller", "comment_text": "If I were you I would skip Milan and do 3nts at each of the others 😊"}, {"username": "Suzanne Mills", "comment_text": "No, too much travel. Pick 2. Florence and Venice"}, {"username": "Leah Naylor", "comment_text": "Skip Milan. You can book tours locally in each city and manage the trains/ transport and hotels on your own. It depends on how you like to travel and if planning is fun or stressful for you."}, {"username": "Casarine Temple", "comment_text": "I booked all our plane tickets , accommodations,\ntours and transportation myself . Seemed relatively easy for me to do so."}, {"username": "Manuela Bonazzi", "comment_text": "Milano puoi evitare di vederla senza alcun rimpianto."}, {"username": "Starla Dawn", "comment_text": "I just did Naples 1, Sorrento 4 (Beach day, blue Grotto boat day, Amalfi Coast day), Flew to Catania, Sicily straight to Lipari Hotel Mea (WOW) I did 2pm boat tour next day to Panacea and Stromboli Islands. 2 Taormina on way back to airport (private drivers are the best thing ever) and flew from Catania to Florence 2. Did a horseback riding farm to table winery and San giginamo (AMAZING) next day art and the city.\nFast train to Rome 2\n\nAnd the only thing I would change would be skip first day in Naples.\n\nIt was an epic trip, every part of it went so smoothly, every stay (mix airbnb and hotel) was great and it didn't feel rushed somehow.\n\nI booked it entirely myself and I am NOT a planner."}, {"username": "Krissy DaRusso", "comment_text": "You can totally do this trip on your own. I’d spend most of the time in Rome and Florence. Milan and Venice can be short (Milan the shortest or left out completely). Venice is so unique but really only need 2 days there."}, {"username": "Sherry M Roedl", "comment_text": "Use a travel agent to help you plan the trip you want."}, {"username": "Deanna K Largent", "comment_text": "Safer with a trip package or a cruu"}, {"username": "Gina Johannes", "comment_text": "Don’t ditch Milan. However 1 day is enough. We just left Florence and came using the train. Your trip is very doable. Don’t let others discourage you! We did Venice first, Florence, Milan and going to Vigeveno today. (With an 7 day cruise to Greece in between)"}, {"username": "Pietro Di Sorbo", "comment_text": "A bit stressful for ten days, maybe is better to cut Milan"}, {"username": "Sar Malco", "comment_text": "3 cities max."}, {"username": "Alex Hicks", "comment_text": "Definitely doable but I would skip Milan and spend more time in the other cities. I loved Florence! ✨"}, {"username": "Teresa Copson", "comment_text": "From my personal travel experience I wouldn’t do a tour exactly but I would book with a good travel agent. They can help craft a great itinerary with all of the transfers and help you pick your own tours whether they be group or private or unique such as spending time with locals in between your personal time just wandering, shopping and eating gelato with your daughter.Whatev\ner you decide, enjoy and make precious memories.♥️🇮🇹"}, {"username": "Brooke Heneghan", "comment_text": "Maybe stay in Verona as a base and do Milan and Venice as day trips? X"}, {"username": "Claire Lewis", "comment_text": "Do a tour or extend the trip to 2 and a half weeks"}, {"username": "Mary Fortura", "comment_text": "Skip Milan. From Venice, Florence and Rome you can do day trips to several other beautiful cities like Siena, Cinque Terre, Pompeii, etc. endless possibilities. Fly into Venice and go south. Fly out of Rome. Or vice versa. Use Viator app to book day trips/\nexcursions - guided or not, full day or half. I personally don’t think you need an agent."}, {"username": "Jim Hinckley", "comment_text": "Check out Trafalgar Tours. We just did Trafalgar in Ireland"}, {"username": "Val Kilgallon", "comment_text": "My daughter and I just did 10 days in Rome (4), Florence (3), and Venice (3). I was happy with our time in Venice, but I really wish I'd had an extra 2 days in Rome and at least one other day in Florence. Don't try to do everything in that amount of time. Give yourself enough time in each city to really explore and hit the sites and activities that you want to experience in each town. This was my first time traveling to Europe in over 30 years and I was nervous about handling the planning on my own, particularly transportation.\nEach of these cities is very very walkable, and the trains are easy to use. I found that going through tour groups did cost more money and I wanted the freedom to be able to follow our own agenda. In the end. I am very glad that we did this trip on her own, in part because my daughter got sick for 2 days while we were traveling and the ability to change our schedule and let her stay in and rest with me checking in on her was much easier then if we had been obligated to be on a tour bus or locked into visiting particular sites at a particular time. As long as you plan ahead, and book the most important activities that you want to see ahead of time, you can absolutely do this on your own! Easy to get around in Italy, most people speak English, most of the signs are in both English and Italian, and in planning it yourself, you have complete control over where you stay (say, center of town rather than on the outskirts, if you prefer), how long you could stay at each venue (if you want to spend half a day at the Uffizi rather than an hour with the tour company's guide), and you can change things up easily. We really needed to take midday breaks in the heat of summer, which I'm not sure would have been as easy to do if we needed to get back on the tour bus at a certain time. You can do it! Good luck!"}, {"username": "Joseph Guerrero", "comment_text": "Firstly there’s no correct answer, just opinions. This itinerary is doable but I’d recommend cutting out one stop to give you more time in cities with less trains/hotel check ins etc. As for planning, you can 100% plan this yourself. My wife and I, mostly my wife, planned 17 days in Europe, 11 of those in Italy, in less than 4 weeks from when we had the idea this May and travelled in June. We’re not experienced European travelers and had our 2 daughters (8 and 12) with us so it’s absolutely doable. I’ve never used a travel agent so I’m not saying they don’t have value nor provide a service but just confirming that it can absolutely be done on your own."}, {"username": "Tammy Wells Mock", "comment_text": "I think there is not enough time to see 4 cities. You will spend all of your time checking into and out of hotels. I would definitely drop Milan."}, {"username": "MariaChiara Dolci", "comment_text": "I’m Italian , I live in Milan and I say… skip Milan ! I love this city but not compared to others you are visiting 🙂 next time maybe… enjoy !"}, {"username": "Achim Marke", "comment_text": "Italian cities in summer are mostly hot and stressful. Thats why the italians go in summer on holiday on the beach or in the mountains"}, {"username": "Theresa Salerno Adams", "comment_text": "I use tripmaster and plan myself"}, {"username": "Lori Johnson Hilton", "comment_text": "Skip Milan. But if you do go there, spend the day in Lake Como. Short train ride and I've of my favorite places anywhere."}, {"username": "Narmela Zayeh Kandi", "comment_text": "Any recommendations\nfor tours and packages ?\nThank you in advance."}, {"username": "Phyllis Lahn", "comment_text": "Skip Milan, trip is too aggressive. You're not checking it off your bucket list, you need to experience it."}, {"username": "John Borgia", "comment_text": "Not enough time"}, {"username": "Georgette Walker", "comment_text": "Get a travel agent for all that. Buy your tours before you go and get the VIP tickets."}, {"username": "Viraf NZ", "comment_text": "We did the same cities in 10 days on our own ."}, {"username": "Phyllis Snyder", "comment_text": "If possible fly into Venice then move on to Florence then Rome and fly out- skip Milan. Or reverse Rome, Florence , Venice. Take fast train and book rooms close to sites to save time. Have fun!"}, {"username": "Rachael Richardson", "comment_text": "More days in Rome and Florence 2 enough in Venice - ditch Milan ! Do it yourself use booking . Com and book flight into Venice back from Rome or other way !"}, {"username": "Anthony Sperduti", "comment_text": "Skip Milan"}, {"username": "Pong Ac Ai", "comment_text": "Tour is good but it’s ok travel by yourself self phasing just study your whole tour via YouTube videos especially rick Steve’s"}, {"username": "Connie Rai", "comment_text": "Connie Rai"}, {"username": "Anne Bono Whiteside", "comment_text": "I’d do the first three"}, {"username": "Lia Geloso", "comment_text": "Skip Milan"}, {"username": "Doug Burke", "comment_text": "Skip Milan."}, {"username": "Ro Todisco Weil", "comment_text": "Definitely do a tour since this is your first time, much easier & you will get to see & do a lot!\nIf, you decide to do it on your own, fly into Rome, train 🚊 to Florence & then train to Venice! Trains are great too👍\nLeave Venice to last since it’s More relaxing & Magical!\nTry to spend some time in St Marks Square, take in the Music 🎶 from the different Cafes ☕️ & People watch too!\nAlso, the public water busses are fun & a great way to see VENICE! So many great places to see in Venice & as I said,\nMore relaxing & make sure to enjoy some yummy 😋 Gelato 🍧!\nIf you have time going over to Burrano is a beautiful quaint town & know 4 it’s Lace, etc!\nMurano is where they make the blown glass, beautiful 🤩 but expensive…. They & another little island is all on the same public water buses/ taxis! If it’s really hot weather I would skip Murano, even hotter into where they blow the glass!\nLeave from Venice Airport & have a fantastic trip!! 👏🏻💯🎶🍧🇮🇹🇮🇹☕️✈️👍"}, {"username": "Suzanne Carver Musashe", "comment_text": "You can take a train from Venice Florence and Rome and walk through the cities"}, {"username": "David Solo", "comment_text": "Seeing as much as possible is often a bad strategy. You will end up spending 4 of 10 days traveling and seeing nothing but train stations. Do Rome for 4 days, Venice for 2 days max and finish up with Florence. Plenty of day trips around Florence like Sienna, San Giminiano Greve, wineries, etc. Milan is certainly interesting (the Last Supper, shopping for example) but compared to Rome and Florence and surrounding area you will get a lot “more for your money” in Rome/Florence. Personally, I would never take a tour but\nTo each his own. Rent a car in Florence. Google maps works there too! Just my opinion. 😀"}, {"username": "Glenn Todd Webb", "comment_text": "No. 10 days not enough for those 4. I might do Venice, Florence and Milan in 3. Rome has plenty for a week. Too much time traveling between, checking in/out, packing, catching trains. Pick 2 and do day trips from each. See each city like it will be ur only time."}, {"username": "Brian Osman", "comment_text": "Go-ahead tours has a package of those cities and handle everything!"}, {"username": "Blenda Johansen-Rodriguez Del Rio", "comment_text": "Yes. I did 3 of them in 7 days. You can do 4 in 10."}, {"username": "Lexy Kammler Puzzella", "comment_text": "We did these exact cities 6 years ago. It doable but if I did it again I would not do all 4. We didn't like Milan as well as the other 3 cities. We did 2 nights in Florence, Venice and Milan and 4 in Rome. I would add a night each to Florence and Venice so we could have explored on our own a bit. We flew in and out of Rome, used trains. For the most part planned it all ourselves. Did have a friend get us few tours set up for the important ones so we could skip the lines and have private tours. Well worth our money!"}, {"username": "Miyuki Kanno Paul", "comment_text": "Skip Milano."}, {"username": "Alicia Cox", "comment_text": "All great advice! Skip Milan"}, {"username": "Tracy Foss", "comment_text": "It depends on how much research you want to do I'm guessing because you're asking that you should probably find a tour or travel agent"}, {"username": "Carol McDonald", "comment_text": "yes you will"}, {"username": "Cynthia McDonald", "comment_text": "We do it all on our own for the flexibility. We've been 15 times. Rome is a great place to land and spend 2 days seeing the \"compulsories\" (Coliseum, Vatican, etc). But then take a train out to Venice and you could do 2 days in Venice and get the feel of it, then train to Florence for 2 days and see the \"Compulsories\" (Ponte del vecchio, Ufficio, David) and then train to Milan for 3 days to see the Duomo, Galleria, Canal area and fly out of Milan. We do public transport in Rome and Milan but Venice and Florence are very walkable cities. Hope this helps. Enjoy! Let me know if any questions or thoughts. We love sharing Italy with everyone."}, {"username": "Theresa Hayes", "comment_text": "Is 3 weeks to see Italy ok from Pompeii to Venice via cinque Terre then Venice back to Tuscany ? 3 days each stop fly into Rome."}, {"username": "S Christian Everett", "comment_text": "Easily\n\nDo\nIt all\nYourself"}, {"username": "Lisa DeLeo", "comment_text": "Do it yourself. It’s so much more fun bc you get to do what u want when u want…\nI’d do it the opposite way tho\nand fly into Milan- Malpensa and rent a car. Unless you want to use public transport which is very time consuming…2 days\nThen I’d drive south and do Venice for a day - park near Venice at the Terminal San Giuliano in Mestre and then take a ferry across the grand canal to spend a full day or even sleep there overnight bc it’s very pretty at night…2 days\nNext I’d drive to Florence and make a few different stops. (3 days)\nLastly I’d drive south to Rome. (3 days)\nFly out of Rome Fiumicino…\nIf u only stay one day in Venice you will hav a fourth day in either Florence or Rome…\nGo for it!!!🇮🇹🥖🍝 🍕🍷"}, {"username": "Nancy Lewis", "comment_text": "I would drop Milan and add extra days in other places."}, {"username": "Roseann Genovese", "comment_text": "You should book a tour especially\nIf this is your first trip\n4 cities Is a lot to do on your own\nYou will have to carry your bags from city to city & pay all your transfers\nAnd you will miss a lot"}, {"username": "Roseann Genovese", "comment_text": "We did our first trip with Perillo:\nVenice, Florence & Rome\nWe gave ourselves extra day before the tour & our down days we took the train to Bologna & Verona\nThey took us to Tuscany for the day for a wine tasting with foods\n\nAnd for Rome they took care of admission & entrance to the Vatican\nWe never waited on line"}, {"username": "Cyndi Nistal", "comment_text": "We did a tour with gate 1 tours.\nThey were great & we were able to enjoy & not worry about the planning. We had free time in every city."}, {"username": "Diane Petonito Giordano", "comment_text": "That’s a lot to cover in 10 days."}, {"username": "Debi Ann Marie", "comment_text": "Trafalgar costsaver Tours has many great tours.\nMany city & length of stay options.\nI've traveled with them & made friends from the US Canada & Australia to name a few. You get to see a lot, all pre planned for you. Especially if you haven't been to Europe before, it's convenient & worth it to assimilate.\nHave fun!"}, {"username": "Nancy Kirby", "comment_text": "Take one out for sure"}, {"username": "Steve Grossman", "comment_text": "Not enough days 4. 4 cities. Leave out Milan"}, {"username": "Steve Grossman", "comment_text": "You can very easily plan the trip yourself with your cell phone"}, {"username": "Steve Grossman", "comment_text": "I would fly into venice and home from rome or the opposite"}, {"username": "Abe Michelson", "comment_text": "Honestly you are spreading yourself thin. Even with fast trains. Which is what you should be taking. Of the 4. Cancel Milan. 3 days in each. Still thin/ especially for Rome & Florence. Venice you can get a good experience in 3 days if you are active and keep the days packed. I would do 3 and even then…you will feel like it isn’t enough time. Just motivate you enough to go back."}, {"username": "Janet Lugar Miller", "comment_text": "Go in fall!!!!"}, {"username": "Jerry Lyubelsky", "comment_text": "We just did Milan, Rapallo, Florence and Rome in 10 days. It’s doable. I’ve worked with and agent both our trips and we saved some money in the flights and they have a scoop of hotels and such. Viator is great for prebooked tours. Book those well in advance."}, {"username": "Chris Vilsack", "comment_text": "That's a lot to see.. It's like saying.. I'm going to the USA, wanna see nyc, Miami, DC, and cape may in 10 days. Rome alone can be 4+ days, and it's sweltering there now it's summer. Not to sound weird.. Can you go back? With too many destinations, you're constantly traveling, checking in and out of places, you have no idea where you are each time so you have to get grounded, etc"}, {"username": "Charleen Siegler Schuss", "comment_text": "You need to experience La Vita Dolce and you can't running form site to sight. Start in Venice 3 nights, Florence 3 night, Rome 4 nights. Besides all 'have to see places' stop at a bakery, hardware and fabric, grocery, wine, deli stores. Go to a flea market. Wander, get lost, discover your own fountains and ruins. In Rome Besides the usually visit Borghese Museum, take a bus to Tivoli for the Villa d Estes."}, {"username": "Sarah Luisa Hughes", "comment_text": "I agree probably drop Milan, my order with best first would be.. Rome, Florence, Venice, Milan. And I actually prefer Bergamo to Milan, if anything a day trip to Milan but agree with everyone else in just 10 days it is too many places. And you need to spend A MINIMUM of 3 full days in Rome."}, {"username": "Traci Beavers", "comment_text": "Skip Milan this time - next time make Milan your base and do cinque and como and maybe some of the small places like Verona"}, {"username": "Marisa DePalma", "comment_text": "Book a tour\nYou will see so much more"}, {"username": "Elena Boetel Sutton", "comment_text": "Will be close with that many cities in 10 days unless you are actually going 12 days with a day of travel on each end and 10 actual days in Italy. Assuming hit the ground running you can fill 4 days in Rome, 2-3 in Florence with one of those days a side trip to Pisa and Tuscany country side, 2 in Milan and 2 in Venice. FYI I was in Milan in February. If you have any hope of seeing Last Supper painting book a tour on Viator or similar. Go to the roof top of the Duomo and also plan to see Duomo at night. That place lit up at night is absolutely stunning."}, {"username": "Raf Gervasio", "comment_text": "Sounds OK but I would stop Milan as its not on the route"}, {"username": "Renae Larcus", "comment_text": "Skip Milan. Do the others. I would plan it myself but if it’s your first time a tour might be easier. Look at TripMasters"}, {"username": "Ginger DiGalbo Katz", "comment_text": "Try to do 12 or skip one"}, {"username": "Jenny Godfrey", "comment_text": "I personally think four is a bit much and your miss out on so much. Last year we did 3 weeks, Rome, Florence and Venice and have been to them all separately at different times. But you find so much to do and you will kick yourself because you didn’t spend enough time in those locations. Maybe do Milan a different time or can you do longer time?"}, {"username": "Paula Brink", "comment_text": "Book your flights multi city- into one city and home from another to avoid backtracking.\nYou can easily plan this yourself but with only 10 days I’d do 3 locations max."}, {"username": "Sigrid Cormier", "comment_text": "If you’ve not ever been before, book a tour….all the details are taken care of. You don’t need to worry about rail strikes etc. Getting around can be time consuming. Where as your bus is waiting for you at your door. Have fun!"}, {"username": "Laura Jetton", "comment_text": "My first time I went on a Perillo tour just to get a taste of what I would and wouldn’t want to do on my own."}]}, {"id": "2194162300982848", "text": "Please can anybody recommend nice places to eat in Florence please.\nAlso other nice places to visit for a city break.\nThank you 😊", "link": "facebook.com/groups/1373361046396315/permalink/2194162300982848/", "likes": 8, "comments": [{"username": "Valerie Collanton", "comment_text": "Trattoria ZaZa. Trattoria Boboli."}, {"username": "Shelley Bowen Glassman", "comment_text": "Great are for a spectacular sunset in Florence. You can take a taxi there."}, {"username": "Ali Miller", "comment_text": "IL LATINI"}, {"username": "Merlene Gilb", "comment_text": "Pick up a sandwich at All’Antico Vinaio."}, {"username": "Janet Messanelli Bozzone", "comment_text": "There are over 2000 restaurants in Florence. So much depends on your taste and budget. My favorite is La Giostra. It is more expensive than many but worth it for the experience. Other recommendations\n: Trattoria Anita (inexpensive and locals go there), Trattoria Za Za, Osteria Vecchio Cancello, Braciere Malatesta, Antica Trattoria da Tito ( great Florentine steak, just don’t ask for it well done). I can probably name a dozen others but download TheFork to read reviews and make reservations. I use Tripadvisor to narrow down my choices. 🙃"}, {"username": "Lisa Carter Kayton", "comment_text": "Casalinga and Chinghale Bianca"}, {"username": "Pam Armenia O'Brien", "comment_text": "La Goistra\nAqua Al 2"}, {"username": "Virgz Van Møøre", "comment_text": "13 Gobbi, Bondi"}, {"username": "Lisa Carter Kayton", "comment_text": "We stayed in Pontassieve which is about 35 minutes outside of Florence. We explored all the hills and visited Pelago, Stia and Poppi to name a few. None were crowded and we saw an amazing castle and a beautiful church."}, {"username": "Len Murtha", "comment_text": "Yellow Bar. Around corner from the Duomo. Get the ravioli. Octopus exceptional as well."}, {"username": "Russell Weidner", "comment_text": "And look into Lamole and Tenuta di Ricavo"}, {"username": "Sigrid Cormier", "comment_text": "Google top things to see and do in Florence. Read the descriptions and visit what you find appealing. Gives you locations hours and any cost."}, {"username": "Michelle Nelson-Harrison", "comment_text": "Take the train to Cinque Terre or we drove to La Spezia and boated over to Cinque Terre! It was absolutely a gorgeous boat ride!"}, {"username": "Patti Farrell", "comment_text": "Definitely lake Como and take the Ferry to all the beautiful towns on The lake"}, {"username": "Maria Manfredi", "comment_text": "La Spada, Angel Rooftop bar, Mattacena, Cicalini for Fiorentina steak"}, {"username": "Mat PO", "comment_text": "Spend a night or two at Castello di Casole."}, {"username": "Kelle Packard", "comment_text": "Za Za trattoria and guanciale!"}, {"username": "Lisa Abrams Argento", "comment_text": "Take the train to Lucca for the day."}, {"username": "Zarine Batli", "comment_text": "Trattoria Sostanza if it’s still there. Excellent"}, {"username": "Lisa Baglio Garrison", "comment_text": "https://\nwww.trattoriazaz\na.it/"}, {"username": "Lisa Baglio Garrison", "comment_text": "https://\nwww.osterialabis\ntecca.it/"}, {"username": "Michael Westlake", "comment_text": "Trattoria 4 Leoni"}, {"username": "Jessica Amber Coors", "comment_text": "Osteria Zio Gigi - 💯can’t recommend this place enough!!!! One of the best meals I’ve ever had in Florence, amazing service, and pretty cheap for the quality of food! Most dishes are 10-12€"}, {"username": "Aurélie Esposito", "comment_text": "The rooster perfect for a brunch ! Mercato centrale for a quick and super yummy lunch"}, {"username": "Dee Jayawardena", "comment_text": "Osteria Nuvoli, local and low key but fab food"}, {"username": "Beverley Davies", "comment_text": "Restaurant Nantalino. Always fabulous."}, {"username": "Tania Davis", "comment_text": "Our best dinner for food and service was at Ristorante Oliviero 1962"}, {"username": "Becky Reeder", "comment_text": "Are there any that need reservations made a year in advance? Or Atleast 6 months. I ve gone to tourist towns here in the states where you needed to have made the reservation months in advance of going."}, {"username": "Tina Haldeman Tootle", "comment_text": "Don’t eat here was a total scam for the tune of 700euro. I should of look ed them up on trip advisor"}, {"username": "Kerrie Payne", "comment_text": "Thank you all for some great recommendations\nlots to look at and research 👍\nI appreciate all your time 😊"}, {"username": "Tracey Kelly", "comment_text": "Il Bongusto, via Giuseppe Verdi 16, delicious and excellent service"}, {"username": "Dave Colleen", "comment_text": "Ate here last night and it was delicious. There was a line outside but we were seated within 10 minutes"}, {"username": "Yahima Oquendo", "comment_text": "Amazing pizzas ! The Tuscany countryside is beautiful and great to decompress."}, {"username": "Amanda Alyssa", "comment_text": "La Buchetta!! It is pricier than other places but it by far one of the best meals I’ve had in Italy"}, {"username": "Nikki Livingston", "comment_text": "La Giostra! It is absolutely beautiful inside and the best meal I’ve ever had!! Look it up, it’s really cool!"}, {"username": "Dave Colleen", "comment_text": "Head breakfast here before catching the train. They have a nice menu at table service"}, {"username": "Courtney Larson Bryant", "comment_text": "From Florence we visited Luca by train and loved it"}, {"username": "Kathy Kibbe", "comment_text": "La Menagere is beautiful and great for brunch/lunch"}, {"username": "Melinda Noyes", "comment_text": "Pizzeria Templari!"}, {"username": "Mary Agozzino Derrick", "comment_text": "Ask a local...they always know the best places for authentic food"}, {"username": "Nancy Koehler Barboni", "comment_text": "Take a day tour to the countryside for food and wine!"}, {"username": "Diana Ferro-Rodrigues", "comment_text": "Il Latini"}, {"username": "Gary W Anderson", "comment_text": "We’ve eaten at Mamma Gina’s restaurant years ago and been back a couple of times, moderate prices local people recommended it.\nThe usual Uffizi, Acadamia (David), Medici home and gardens but a hidden gem Is the Galileo museum."}, {"username": "Gina Johannes", "comment_text": "Trattoria ZaZa or Cafe Pucci"}]}, {"id": "2194166817649063", "text": "Have seen posts with women asking for packing tips but not noticed any from men. At home it gets up to 32 degrees Celsius (90 Fahrenheit) and we go to\nMaui every second year. I will say for some reason I have never sweated as much as I did in Rome or\nPompeii and this next week is going to be even warmer even on the coast.\n\nAt home I typically wear black and grey shirts year round so for this trip is thought I would wear some colours. Brought several lighter coloured t-shirts and button up shirts. I know we are all human but looking like my sweat glands are malfunctioning particularly in photos isn’t a look I would chose if I can avoid it.\n\nSo here are two photos just as examples for anyone else who is planning on coming here in the summer.\n\nThe check shirt is way better option than the solid lighter blue one.\n\nThe striped shirt despite being a darker blue is a way better option than the lavender one.\n\nLiterally planning on trying to find somewhere to donate 12 shirts to free up space in my bag as I have not and will not be wearing them over the next week.\n\nAs an aside the button up style is also much cooler to wear than a t-shirt.", "link": "facebook.com/groups/1373361046396315/permalink/2194166817649063/", "likes": 39, "comments": [{"username": "Anna Treviño O'Campo", "comment_text": "There is a ph balanced soap that helps for sweating and it makes all the difference in the world along with how much water u are in taking so look that up too. I've heard how horribly hot it is in Italy. I'd still go lighter cotton on the shirts that u have out."}, {"username": "Madeline Caporale", "comment_text": "Paying attention to fabric content is also of help. Cotton will breathe better than polyester. Modal and tencel both have moisture wicking properties as well. Linen also is lighter than cotton, is also natural and breathes well."}, {"username": "Tracy Wrinn Mcdermott", "comment_text": "Linen button ups are the best and coolest shirts. My husband lives in those and v-necked white cotton t-shirts all summer."}, {"username": "Tad Hashimoto", "comment_text": "Totally agree.\n\nI had a couple button ups and a few breathable synthetic golf (polo) shirts that did me well.\n\nI also packed some Hanes mesh undershirts. Synthetic moisture wicking base layers are life savers."}, {"username": "Bill Bowler", "comment_text": "Precisely why I wear nothing but performance material polos and shirts in mid to dark colours when I'm in Europe in summer. I may be sweating but you won't see it and the perf material wicks it away very well. Perf golf wear for daily excursions has been the key for me for years of summer travel in europe."}, {"username": "Belle Littler", "comment_text": "Great advice!! Totally agree. I pack everything for my husband 🙄"}, {"username": "Bob Sullivan", "comment_text": "It's almost always easier to mix and match for a guy with pants primarily in 3 colors so underpacking is easier. 🙂\n(doesn't mean I can always do it though)\nI was able to do 2 weeks in Dec in just a carry-on and personal item and even came home with 2 new coats."}, {"username": "Amalia Cristina", "comment_text": "Just a quick tip, if you want to blend in withe the locals, don’t wear short sleeve shirt, rather wear a polo if you want to be more formal but casual at the same time. As to the t-shirts possibly without a v neck, better round neck."}, {"username": "Miriam McNally", "comment_text": "Enjoyed reading this thread (tho I know that's not the purpose of it), especially the \"I tried to be independent\" bit! Enjoy your hols, it's a cold 18 degrees here in Ireland!"}, {"username": "Alicia Cox", "comment_text": "Very good, specific, well thought out advice Jeff McLellan! 👏🏻"}, {"username": "Adriana Sormani", "comment_text": "I was in Italy last week and it was hot!!I heard it’s even hotter now!"}]}, {"id": "2194171684315243", "text": "Is it possible for someone to provide me with TravelMar’s phone number (the ferry service on the Amalfi) coast… Many of the other vendors I’ve contacted have a 10 digit phone number plus the country code but travelmar seems to have nine digits and the country code and I don’t quite understand this… Any help would be greatly appreciated", "link": "facebook.com/groups/1373361046396315/permalink/2194171684315243/", "likes": 1, "comments": [{"username": "Theresa Ladner", "comment_text": "This is what is on their website. Did you try dialling?"}, {"username": "Lindsay Stewart", "comment_text": "Lindsay Stewart"}]}, {"id": "2194175617648183", "text": "I am turning 50 in January 2026\nMy dream is to spend a month or two in Italy/ Greece and possibly a little bit of Amsterdam\nI would like to spend part of it on my own, slowly exploring and wandering and pleasing myself after years of pleasing the family. My husband will then possibly join me to do some more touristy things.\nI’m an emerging selfआणखी taught jeweller and would love to do some learning while I’m there in amongst the travel.\nI love the coast and I love the warm weather so January (my actual birthday) probably won’t be the right time of year but that’s ok.\nI invision staying in quaint, clean and affordable airbnbs, quite happy to have one base for my month alone and then move around a bit with my husband.\nAny advice at all welcomed, any jewellery courses that people know of welcomed also\nThank you 🙏🏼", "link": "facebook.com/groups/1373361046396315/permalink/2194175617648183/", "likes": 0, "comments": []}, {"id": "2194176990981379", "text": "Who can guess which restaurant this is in Sorrento, I miss his steak and salmon", "link": "facebook.com/groups/1373361046396315/permalink/2194176990981379/", "likes": 0, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2194338540965224", "text": "What are reasonable gondola prices these days? Also did you book in advance or on the spot? Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2194338540965224/", "likes": 4, "comments": [{"username": "Kelly Roland Thompson", "comment_text": "On the spot so many available and about 75 bucks maybe"}, {"username": "Heather Becker", "comment_text": "Gondolas are a set price."}, {"username": "Melissa McCormick", "comment_text": "Our Airbnb host told us it’s a set price for every gondola. She said 80 during the day and 100 in the evening. That was also posted on signs with those prices. We went around 4 pm I believe and it was 80 euros."}, {"username": "Karen Bowman", "comment_text": "Are they busier in the evening?"}, {"username": "Ashley Martins", "comment_text": "Set prices"}, {"username": "Stephanie English", "comment_text": "You know you can get a traghetto for €2 each to get across the canal at a few different points. We went with kids that just wanted the experience and thought €80 was a rip off! Google it"}, {"username": "Helen Butterfield", "comment_text": "We went early in the morning about 9am near the Rialto Bridge and as it wasn’t busy the gondolier asked if we were interested and we only paid 60E."}, {"username": "Stacy Prestigiacomo", "comment_text": "They are all over 80 e , 100 after 7 pm . Can fit up to 5 in a gondola"}, {"username": "Lara Vander Meulen", "comment_text": "We would recommend Luca. We booked in advance based on feedback from this group. He was great. He explained the history of buildings and sang to us. Also, he doesn’t do the grand canal so it was much more enjoyable."}, {"username": "Teresa Brewer Harkins", "comment_text": "Uh…crazy question…80 for each person or the total for up to 5 people?"}, {"username": "Nadia Nadia", "comment_text": "So I assume per person? Or per Gondola?"}, {"username": "Julia Muller", "comment_text": "On the spot. There are plenty around, and it’s 80 Euros (all cash, as far as we could see) when we were there at the start of July 😊"}, {"username": "Marcilene Stefan", "comment_text": "80 per gandola"}, {"username": "Nicola Lambert", "comment_text": "You shouldn’t be charged more than €80, it’s a fixed fee"}]}, {"id": "2194182847647460", "text": "Love Tuscany so much! One thing that I didn’t expect to see was the beautiful sunsets. How special is this one ❤️", "link": "facebook.com/groups/1373361046396315/permalink/2194182847647460/", "likes": 4, "comments": []}, {"id": "2194187507646994", "text": "Tattoo recommendations in Milan?", "link": "facebook.com/groups/1373361046396315/permalink/2194187507646994/", "likes": 0, "comments": []}, {"id": "2194187597646985", "text": "Any advice on where to see any football (soccer) games the next couple of weeks along Rome/Florence/Milan? I know it’s off season, but perhaps smaller local teams, or practices?", "link": "facebook.com/groups/1373361046396315/permalink/2194187597646985/", "likes": 1, "comments": [{"username": "Robýn Kretsçhmər Schuchårdt", "comment_text": "Following"}]}, {"id": "2194202650978813", "text": "Does anyone have any good recommendations for photographers in Italy? Will be in Ravenna, Amalfi Coast and Rome.\n\nTIA 😊", "link": "facebook.com/groups/1373361046396315/permalink/2194202650978813/", "likes": 1, "comments": [{"username": "Tania Vázquez", "comment_text": "Istanti Senza Tempo the best in Rome 📸👏"}, {"username": "Sarah Anne", "comment_text": "The New Old - Wedding Stories\nIs incredible !! 🤍\n\n@thenewoldweddi\nngs on instagram"}, {"username": "Maria Falcone Sedgwick", "comment_text": "We had family photos done in Ravello on the Amalfi Coast years ago. I don't recall the photographer but the landscape and back ground CANNOT be beat!!!"}]}, {"id": "2194202747645470", "text": "Hi everyone! Thanks for all the tips so far. Looking for recommendations for towns and beach along Amalfi. We have our own car and will be staying in a hotel in Pompeii, but have a full day free to explore Amalfi coast. I saw also lots of recommendations for a boat tour. If anyone can recommend a half-day boat tour / company from mainland Amalfi, I would be grateful. Not sure we want to do all day boat tour with 6 and 9 year olds. Thanks in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2194202747645470/", "likes": 0, "comments": []}, {"id": "2194203824312029", "text": "Went for a walk and saw this in one street. Many more too. Full of water. Curious", "link": "facebook.com/groups/1373361046396315/permalink/2194203824312029/", "likes": 47, "comments": [{"username": "Diane Leesmith", "comment_text": "Have you found the wine ones?"}, {"username": "Margaret Frey", "comment_text": "🤔"}, {"username": "Michela Ratti", "comment_text": "It is to keep cats away for littering."}, {"username": "Colleenmaaske Maaske", "comment_text": ".???????"}, {"username": "Adam Choyce", "comment_text": "I can never find the full Jack Daniels ones!"}, {"username": "Rayandra Alexander Seville", "comment_text": "Shooting target, maybe? 🤔"}, {"username": "Teresa Heran", "comment_text": "It’s to scare away the cats so they don’t mark."}, {"username": "Chiara Bettaglio", "comment_text": "Those are for keeping cats at large, so they don't mark on the window. It never worked for us anyway, but it's a common believing."}, {"username": "Esther Steinbok Sustersich", "comment_text": "Now I also heard to wash away dog pee"}, {"username": "Virgo Tronci", "comment_text": "It's an urban myth. It's for dogs and cats so that they don't pee there. I don't know if that works, but you'll find it everywhere in Italy 😆"}, {"username": "Libera Sanna", "comment_text": "Si mettono le bottiglie vicino alle finestre per allontanare i gatti😂"}, {"username": "Heather Stokes", "comment_text": "To keep the cats from peeing there."}, {"username": "Angela Koots", "comment_text": "I can confirm it actually works!\n\nJust spent 3 weeks at our family home in Calabria. Homeless cats at our door daily looking for food handouts (they were previously given food here). I put a clear water bottle out and never saw them again until the last day when I removed the bottle. Within an hour of removing the bottle, there were 3 cats lying outside our door.\n\nI put the bottle back out and bam 💥 the cats disappeared from sight again."}, {"username": "Anwen Ingram", "comment_text": "I haven't even seen a cat here yet. In rome anyway"}, {"username": "Gemma Risk", "comment_text": "It’s so dogs don’t pee on that area I was told"}, {"username": "Kaylie Francesca", "comment_text": "People put them outside their homes here in Spain too. To keep stray cats and dogs from marking their walls."}]}, {"id": "2194207827644962", "text": "We have been in Italy for almost two weeks and have not yet had the “blow your hair back” food experiences we have heard everyone else talking about. Looking for suggestions for restaurants in Milan as we have 4 nights there before heading home.", "link": "facebook.com/groups/1373361046396315/permalink/2194207827644962/", "likes": 1, "comments": [{"username": "Agnese Arnó Ch-Ch", "comment_text": "What price range? What type of food? (Classic italian, modern italian, pizza?)"}, {"username": "Lara Grom", "comment_text": "I am a guide of Milan\nIf you need ideas.\nTry the amazing experience of Ratanà you will love it. Reservation needed"}]}, {"id": "2194204640978614", "text": "Monterosso, Cinque Terre, Relax times with beach and beers.", "link": "facebook.com/groups/1373361046396315/permalink/2194204640978614/", "likes": 142, "comments": [{"username": "Kathleen Ball-Clayworth", "comment_text": "So beautiful!!!"}, {"username": "Gabriëlla Maude", "comment_text": "Harvey Celie"}, {"username": "Michelle Evans", "comment_text": "So excited to stay here in September. Your pics are great. Any recommendations\nfor great restaurants please?"}, {"username": "Pam Rieder Runk", "comment_text": "Best Gelato I had Flavor Cinque Terre 5. Delicious! In Monterosso."}]}, {"id": "2194208324311579", "text": "Hi there. My husband and I have 5 nights left to plan on our trip. It’s between Florence/Sienna or stay Monterosso/ChicaTerra.\nWill be in August.\nWe Will be then going on Croatia cruise and then 4 nights in Barcelona. Please help with your recommendations.\nThank you 😊", "link": "facebook.com/groups/1373361046396315/permalink/2194208324311579/", "likes": 1, "comments": []}]