[{"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2206882886377456", "text": "I am thinking about booking Hotel Alessandra in Florence. Has anyone stayed in the annex suite ? If so, how was it ? Also, I saw the website for the hotel says there are 30 steps to navigate to the lift. What is the stair situation for the annex ? Thanks !", "link": "facebook.com/groups/1373361046396315/permalink/2206882886377456/", "likes": 0, "comments": [{"username": "Jeanne Eliason", "comment_text": "Check out Hotel David. A short walk to the Ponte Vechio. A pretty family owned hotel with a fantastic breakfast and happy hour."}]}, {"id": "2206884173043994", "text": "Is it possible to hike around the Dolomite area in late November? Any lodging recommendations that are open at that time? Thank you for any advice!", "link": "facebook.com/groups/1373361046396315/permalink/2206884173043994/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g194745-d5298\n66-Reviews-Hote\nl_Mirage_Cortin\na-Cortina_d_Amp\nezzo_Province_o\nf_Belluno_Venet\no.html"}]}, {"id": "2206886119710466", "text": "I will be in Rome with my mom for 3 days before we continue our trip to Venice and Cinque Terre. We have been to Rome a couple of times before and seen a lot of the major attractions. This time I’m thinking of making day trips while we are there. We went to Frascati last time. Any suggestions where we can go not too far over the day? I was thinking Tuscany if possible? Or is it too big to even attempt see some of it in one day? Is Assisi worth a visit? Any other picturesque village or place you can recommend?", "link": "facebook.com/groups/1373361046396315/permalink/2206886119710466/", "likes": 0, "comments": [{"username": "Linda Chase", "comment_text": "I love Assisi"}, {"username": "Janice Pesavento", "comment_text": "Assisi is worth it"}]}, {"id": "2206888636376881", "text": "Plan on flying into Milan Oct 23\nWould like to do a food tour Parma, piedmont Genoa. Then Italian Rivera Cinque Terre, bike to Bonassola\nPossibly staying in Levanto to access all places for day trips. Then round out last 4 days Florence. Leave 11/2, Will travel by train. Is there a travel agent in Italy I can work with for accommodations and tour bookings?\nThere will be 3 adults. I am looking for affordable hotels. Of course restaurants recommendations and must do activities\nThanks so much", "link": "facebook.com/groups/1373361046396315/permalink/2206888636376881/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Parma/\nParma-Walking-Fo\nod-Tour/\nd27234-237138P1?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}, {"username": "Carlie Lee", "comment_text": "Hi! I book hotels and tours in Italy with our trusted suppliers and I'd love to assist you."}]}, {"id": "2206889953043416", "text": "What golf cart should I do in Rome?", "link": "facebook.com/groups/1373361046396315/permalink/2206889953043416/", "likes": 9, "comments": [{"username": "Ken Vecchia", "comment_text": "One with wheels"}, {"username": "Carol Skender-Buckner", "comment_text": "We are doing nite time tour with My Best Tour in September."}, {"username": "Jenny Barr", "comment_text": "I did a golf cart tour with Liv Tours and it was great! Would absolutely do it again. Great way to see parts of the city you normally wouldn’t get to and you’re able to customize what you want to see."}, {"username": "David Murszewski", "comment_text": "Fabulous well worth it"}, {"username": "Lisa Lucinskas Keenan", "comment_text": "We did LIV tours- was awesome! Luca was the best!!!"}, {"username": "Daniel Milby", "comment_text": "We did the evening golf cart tour. It was great. It included a split of Prosecco when you got on. They stopped at a small restaurant for cheese and meats and a glass of wine. Then a stop for a pint of Peroni at the Peroni bar. All while taking in sites. It was a very small group tour. There was 2 couples. We did it our first day there to get the lay of the land."}, {"username": "Sandra Piacenza", "comment_text": "Yes yes yes!!"}, {"username": "Debbie Fokas Vacca", "comment_text": "We did a Golf Cart Food Tour via Get Your Guide. It took us to some cool spots with delicious tastings."}, {"username": "Linda Chase", "comment_text": "We also did a private golf cart tour with LivTours and loved it!"}, {"username": "Jennifer Goodwin Koss", "comment_text": "We did a 7pm private tour with Rolling Rome. It was fantastic!"}, {"username": "Jamie Ash", "comment_text": "Rolling Rome. It was the highlight of our trip! fantastic."}, {"username": "Beth Iverson Brown", "comment_text": "We booked Italy to the Max… some friends booked with them a few years ago and said it was the best part of their trip!"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nGolf-Cart-Tour-i\nn-Rome/\nd511-389893P1?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "Iman Nazaran", "comment_text": "Following"}, {"username": "Chris Smiley", "comment_text": "Biga, absolute best!!!!"}, {"username": "Dave Colleen", "comment_text": "Bigatours.com"}, {"username": "Mindy Jones Wilkins", "comment_text": "We are doing Turtle Tours in October…."}, {"username": "Tam Wong", "comment_text": "Thank you for the information"}, {"username": "Lauren Overton Call", "comment_text": "Victoria Butler Culbertson"}, {"username": "Susan Head Coggin", "comment_text": "Terri Coggin, Carolyn Nicholson Strack we need to plan a golf cart tour."}, {"username": "Sandy McDowell", "comment_text": "Sheilagh Reid Julie Mclachlan"}]}, {"id": "2206890749710003", "text": "We are visiting Italy in September and I’m looking for a day trip to Assisi and Spello with return transport to Perugia. Nothing available with Get Your Guide or Viator. Thank you in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2206890749710003/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Assisi/\nAssisi-and-Spell\no-Full-Day-Priv\nate-Walking-Tou\nr/\nd27667-7233P40?p\nid=P00070587&mc\nid=42383&medium\n=link&medium_ve\nrsion=selector"}]}, {"id": "2206899053042506", "text": "Happy Trails (Riomaggiore,Cinque Terre) #reels #reelsinstagram #instagram #trending #viral #explore #love #instagood #explorepage #reelitfeelit #follow #photography #fyp #reel #instadaily #आणखीreelsvideo #like #memes #foryou #music #facebookreels #facebook #facebookviral #reelsviral #reelsviralvideo #reelstrending #trendingnow #reelstrendingvideo #facebookpost #riomaggiore #monterossoalmare #manarola #corniglia #vernazza #cinqueterre #laspezia #reels2023 #ristoranteilgabbiano #paanokumitasafacebookreels #facebookreelssahod #facebookreelsearnings #metaverified #metaverifiedaccount #facebookreelsmonitization #facebookreel #fbreels #facebookreelssettings #facebookreelsincome #facebookreelsplaybonusprogram #facebookreelsvideo #facebookreelseligibility #facebookreelsviral #facebookreelspayout #facebookverified #bonassola #levanto #adsonreelsfacebook #adsonfacebookreels #adsonreelsmonetization #monterossobeach #monterosso", "link": "facebook.com/groups/1373361046396315/permalink/2206899053042506/", "likes": 25, "comments": [{"username": "Pat Packard", "comment_text": "Nice video"}, {"username": "Heidi Littman Meiers", "comment_text": "Is this from today ? Aug 4 ? Why is everyone so bundled up ? Weather said sunny and almost 80f today ?"}]}, {"id": "2206900273042384", "text": "Traveling on a cruise ship tour to vernazza by bus it is better to buy a park pass to hike the Cinque de terre on line before u go or buy at the train station when u arrive... Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2206900273042384/", "likes": 0, "comments": []}, {"id": "2206907559708322", "text": "I am in Florence right now. I am asking for a taxi company or private car to arrange ahead to take me to the FLR Florence Airport early in the morning next week. I would also use the same transportation to ride to the train station. I appreciate your detailed information\n\nThank you so much!", "link": "facebook.com/groups/1373361046396315/permalink/2206907559708322/", "likes": 1, "comments": [{"username": "Carmine Castiglia Jr", "comment_text": "If you are staying at a hotel, your best bet is to simply ask at the front desk."}, {"username": "Wendy Spano Bracco", "comment_text": "I have my hotel handling all my transfers. If you are in hotel, reach out to them"}, {"username": "Sandra Shoffner", "comment_text": "Personal-transp\nort.com. I have used them for 5 years no matter where I travel. Always on time and no issues."}, {"username": "Jeanne Eliason", "comment_text": "Just have the hotel arrange that. Remember if you need a taxi in the wee hours, say 4am, need to arrange it the day before. Darn those 6am flights. From our Hotel David it's about 35 minutes in traffic. Only took 20 minutes at 4am. 22 euros and they charge for luggage amounts too. Over 14 years have never had a \"bad\" ride or driver. We always tip which isn't necessary."}, {"username": "Stacy Derouin", "comment_text": "We always just have our hotel arrange it for us-easy and pretty foolproof."}, {"username": "Valerie Collanton", "comment_text": "Welcome Pickups. Download the app and you can book on there."}, {"username": "Suzanne Shea-Simpson", "comment_text": "We use getyourguide.co\nm for our transportation needs"}]}, {"id": "2206911806374564", "text": "We are staying in Sorrento in October, I would like to see Positano, Amalfi and Ravello while we are there. Any recommendations on the best way to do that? Is it easy enough to do independently and much cheaper or is it just worth booking a tour that takes you around them for the day?\n\nThanks in advance☺️", "link": "facebook.com/groups/1373361046396315/permalink/2206911806374564/", "likes": 18, "comments": [{"username": "Dianne Radcliff", "comment_text": "Easiest and least expensive option to visit Positano is the bus. We have also taken the ferry from Sorento to Positano and Capri, which is lovely."}, {"username": "Colleen Schimmenti", "comment_text": "Look up Viator - Positano, Amalfi & Ravello…so worth it. You’re in an air conditioned bus and then they take you around to each place. You meet at 9 am and come back around 6 pm. Enough time at each location to enjoy. We just did this on Monday glad we did."}, {"username": "Joan Belserene Forcheski", "comment_text": "Take the ferry to Amalfi & bus or taxi to Ravello"}, {"username": "Katherine Azcue", "comment_text": "We did it independently using the ferries and drivers provided by hotel for when it was past ferries running"}, {"username": "Kim Shea", "comment_text": "Me too! Following"}, {"username": "Leanne Bingle", "comment_text": "Elizabeth Colleen Fowler"}, {"username": "Jess Villa", "comment_text": "We booked all of our excursions through the driving company. We told them what we wanted to see and They took the headache out of it and planned amazing days for us in sorrento, positano, Pompeii, hiring vesuvious, wineries, Ravello, capri, wineries, resteraunts from finding italy, amalfi, etc. She took what we wanted to do and planned the most efficient and relaxing days.. Message rosa on what's app. They were well priced and we felt well taken care of and safe!\n\n+39 338 920 8399- Rosa"}, {"username": "Andria Saia", "comment_text": "Super easy - take the bus or the boat 🥰"}, {"username": "Wahab Sidharta", "comment_text": "By Ferry from Marina Piccolo in Sorrento"}, {"username": "Beth Deutsch Morse", "comment_text": "We did a private driver Stefania al volante. She made suggestions of what to see in each place. We loved Ravello"}, {"username": "Kally Trahearn", "comment_text": "Cheapest way would be to either take the ferry or the bus from Sorrento to Positano. From there you can go on to Amalfi if you want. From Amalfi, there is a bus that takes you to Ravello. That way, you can spend as much or as little time in each place as you wish before moving on."}, {"username": "Samina Jassani", "comment_text": "Following"}, {"username": "Samina Jassani", "comment_text": "Is it better to do tour by car or by boat ?"}, {"username": "Nancy Koehler Barboni", "comment_text": "No need for a tour but you could get a private driver or do it yourself with buses and ferries! For instance, you could go buy land, one-way, and boat on return."}, {"username": "Paula Bennett", "comment_text": "We booked Amalfi Coast Transfers because we want to see Furore and other tours don’t go there. We have 8 hours to go where we went to go. It can be longer if we choose."}, {"username": "Sandi Marella Johnson", "comment_text": "The ferry boat"}, {"username": "Ros Birch", "comment_text": "We took the bus from Sorrento to Amalfi, then another bus to Ravello and back to Amalfi. We took the return bus to Sorrento but got off in Positano and got the boat back to Sorrento."}, {"username": "Suzanne Mills", "comment_text": "No your, go on your own, it’s easy."}, {"username": "Suzanne Mills", "comment_text": "Tour"}, {"username": "Judy Hall Bragman", "comment_text": "We are doing a small boat tour of the coast! I am sure there are many different tours that offer them."}, {"username": "KayandMike O'Grady", "comment_text": "Buses from train station."}, {"username": "Lorraine Kennedy", "comment_text": "Thanks everyone, probably should have mentioned that any boats/ ferry is out as my mother in law can’t do them sure to travel sickness😅"}, {"username": "Linda Keck Combs", "comment_text": "Private driver is my choice. Expensive but it’s an indulgence!\n\nTips on taking a taxi from the Naples airport to our Airbnb in Sorrento? It’s ￼ reported to be about €90. I realize you have to have an agreed-upon price before hiring the taxi. Just wondering if the language barrier was a problem for those using the taxi?\n\nThanks!"}, {"username": "Roland Trego", "comment_text": "You take the ferry to Positano and Amalfi. Nothing complicated about it. From Amalfi, you can take a bus up the mountain to Ravello. Two villages in one day is plenty. If I could only see two, they would be Positano and Ravello. I find riding the ferries very relaxing and pleasurable. Also, I personally think the sea view is far superior to what you see from the road. The bus gave me motion sickness and I have to say it was a bit scary as the roads are narrow and the bus came precariously close to the edge of the road, with an over-generous view looking a thousand feet down over the cliff."}, {"username": "Kathleen Jakubczyk", "comment_text": "The most exciting and fun way to see the area is to rent a Vespa scooter in Sorrento. We just got back last week and that was highlight of my trip."}, {"username": "Pamela Ramey", "comment_text": "We just got back in May and we did a private tour and it was wonderful. Time in each town and Tina w for lunch in Ravello. We booked thru Viator. Very nice driver and Lincoln town car. He picked us up and dropped us off back at our hotel. I hope this helps."}, {"username": "Lorelei Anderson Kempenaar", "comment_text": "Janice Foxcroft"}]}, {"id": "2206917283040683", "text": "We have a day in between Cinque Terre and Rome that we need filled. We'd like to stay on the coast or close to the major train routes between the 2 destinations. We don't neccessarily want a big attraction or another to do. More like just a sweet, cute town or a really cool bed and breakfast/winery place to stay. Like a light touring/walking/exploring and place to rest and relax kinda spot. Anyone have any ideas or recommendations? Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2206917283040683/", "likes": 0, "comments": [{"username": "Dafne Vassetti", "comment_text": "Lucca."}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Sestri https://\nwww.jdoqocy.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g194917-d2331\n54-Reviews-Hote\nl_Vis_a_Vis-Ses\ntri_Levante_Ita\nlian_Riviera_Li\nguria.html"}, {"username": "Graham Sherlock", "comment_text": "Lucca"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Lucca or check some little village on the sea: check Castiglioncello\n, Marina di Bibbona with a visit to Bolgheri, Baratti, Castiglion della Pescaia, Orbetello, Capalbio."}, {"username": "Brett Boyer", "comment_text": "We decided to stop in Lucca inside the walls. Should be fun. Thanks everyone"}]}, {"id": "2206921646373580", "text": "Top 5 things to do on the Amalfi coast?.. Annnnd GO!", "link": "facebook.com/groups/1373361046396315/permalink/2206921646373580/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Capri/\nPrivate-Boat-Tou\nr-on-the-Island\n-of-Capri/\nd4223-342540P1?p\nid=P00070587&mc\nid=42383&medium\n=link&medium_ve\nrsion=selector"}, {"username": "Carine Brys", "comment_text": "Go where???? LOL!"}]}, {"id": "2206931829705895", "text": "Etna volcano mount, Catania", "link": "facebook.com/groups/1373361046396315/permalink/2206931829705895/", "likes": 4, "comments": []}, {"id": "2206932846372460", "text": "Out of Rome Venice and Sorrento in ￼March where would you choose to spend the most time. Also would you pick Sorrento over Positano due to crowds and just do a boat day along Amalfi coast? Tips and advice welcomed also best places to stay!", "link": "facebook.com/groups/1373361046396315/permalink/2206932846372460/", "likes": 4, "comments": [{"username": "Fiona Mac", "comment_text": "Definitely sorrento b4 positano\nIt's too busy and more expensive\nLoads more in sorrento and its a great base\nBeautiful restaurants n bars and room to walk about and people watch"}, {"username": "Lucrezia Folger", "comment_text": "I'd stay mainly in Rome and do a few days in Positano with a trip to Ischia instead of the over-crowded Capri."}, {"username": "Mindy Marshall Lavin", "comment_text": "I think alot of things are still closed in March on the Amalfi Coast."}, {"username": "Jono Roland", "comment_text": "Sorrento… then boat day trips to Positano and Amalfi. 😎🇬🇷"}, {"username": "Jillian Maxwell Novay", "comment_text": "I feel like those who say Sorrento over Positano have never actually stayed in Positano. I stayed in both cities in June and was not a fan of Sorrento at all. Positano however was my dream city and I can’t wait to go back. It’s only crowded by the ferry/main town area. There is SO much more to see."}, {"username": "Sandy Radican Shikaly", "comment_text": "Ferries to the Amalfi Coast don't run until April"}, {"username": "Katherine Azcue", "comment_text": "Sorrento in my opinion. You can go to Capri, Ravello, amalfi, positano, pompei, all from there! And Sorrento is gorgeous"}, {"username": "Deborah Schroeder", "comment_text": "The question is more what you would prefer based on your wants. Venice and Rome-totally different cities. As for Sorrento-that is a trip all in its own."}, {"username": "Leanne Bingle", "comment_text": "Elizabeth Colleen Fowler"}, {"username": "Raf Gervasio", "comment_text": "We stayed in Sant' Agnello which is short walk to Sorrento"}, {"username": "Nicole Gouzoules Sheehan", "comment_text": "We’re staying in Sorrento and it’s incredible. We did take the ferry to Positano yesterday and it’s lovely but too crowded for my liking."}, {"username": "Kally Trahearn", "comment_text": "So many more options in Sorrento and much less hilly.\nMy favourite restaurant in Sorrento - La Cantinaccia del Popolo - not high end but definitely a favourite of the locals. Google it, read the reviews. You will not be disappointed. You can't reserve, so get there early and expect to wait until a table is free for the size of your party.\nEnjoy xx"}, {"username": "Jodi Thornton Lindsey", "comment_text": "F"}, {"username": "Jenny Payne", "comment_text": "Definitely,Posi\ntano has become very expensive since covid"}, {"username": "Barb Krieg-Stepien", "comment_text": "I just got back from Positano. It was amazing! We never thought it was overly crowded but maybe never was down when ferry came in. Buses are always a nightmare but that’s Italy!\n\nWe did a day trip to Capri 😩now that was overly crowded and painful!"}, {"username": "Michelle Bergman Davis", "comment_text": "Rome, for sure!"}, {"username": "John Mccormick", "comment_text": "Payton, disregard a lot of the posts on this thread. In March, most of Amalfi coast is not open. It’s quite chilly and windy. Positano would definitely be my choice for late April or early May but not March. Sorrento being a larger city would be better than Positano but I would probably stick with Rome and Venice in March. )or for a couple days take train down to Puglua(Bari or Lecce) where it will be warmer. Enjoy!!"}, {"username": "Adeline Alex Tanfara", "comment_text": "Positano but be aware there are all of steps …."}]}, {"id": "2206934146372330", "text": "Are there any provisions in regards to bringing OTC drugs (Tylenol, Advil or Benedyl) and Rx medications? Or essential oils.", "link": "facebook.com/groups/1373361046396315/permalink/2206934146372330/", "likes": 0, "comments": []}, {"id": "2206934319705646", "text": "Going to Florence in first week of October. Looking for a good all day Tuscany wine tour. Any recommendation?", "link": "facebook.com/groups/1373361046396315/permalink/2206934319705646/", "likes": 0, "comments": [{"username": "Brenno Bianchi", "comment_text": "No problem for otc drugs and very few provisions regarding a few particular Rx medications.\nAs an advice, bring with you the medical prescription with written inside the name of the active ingredient in the medication. This above all to make it easier to repurchase them if the need arises."}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Florence/\nTaste-of-Chianti\n-Tuscan-Cheese-\nWine-and-Lunch-\nfrom-Florence/\nd519-5070CHIANTI\nSAFARI?pid=P000\n70587&mcid=4238\n3&medium=link&m\nedium_version=s\nelector"}]}, {"id": "2206941383038273", "text": "Hi have done a quick search but after recommendations for wine tour with great food included in Tuscany please thank you", "link": "facebook.com/groups/1373361046396315/permalink/2206941383038273/", "likes": 0, "comments": [{"username": "Dafne Vassetti", "comment_text": "Get in touch with Ciao Florence :)"}, {"username": "Gerry Morin", "comment_text": "Italian days Parmesan cheese, factory, balsamic vinegar with Italian family and prosciutto, making followed up by a 10 course wine dinner at a vineyard in the mountains bologna well worth it"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Florence/\nTaste-of-Chianti\n-Tuscan-Cheese-\nWine-and-Lunch-\nfrom-Florence/\nd519-5070CHIANTI\nSAFARI?pid=P000\n70587&mcid=4238\n3&medium=link&m\nedium_version=s\nelector"}]}, {"id": "2206948063037605", "text": "Hey everyone! I’m planning a trip for my family and my son for next May. We want to experience the Amalfi coast, but we don’t want it to be a very touristy experience. We were hoping to find historical villages and things off the beaten path. I have googled plenty but anyone can write anything about anywhere. So I just wanted some personal recommendations on coastal towns or villages that spoke to you? Thank you in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2206948063037605/", "likes": 4, "comments": [{"username": "Rhona OConnor", "comment_text": "Look at the other side....lots of amazing places to visit. Check the Puglia area."}, {"username": "Tania Bourgoin", "comment_text": "Have you considered the Cilento Coast, just a bit further south. Much nicer beaches, Paestum and will not be as expensive or overrun with tourists. Give a listen to the UnTold Italy podcast from July 27"}, {"username": "Pam Kimak", "comment_text": "Went to Maiori recently and loved it..a wonderful town...great restaurants and main street.Stayed across from the Tyranian Sea..nice beaches..cobble\nstone boardwalk..love\nly hotels."}, {"username": "Robin Burrell", "comment_text": "Try southern coast instead"}, {"username": "Suzanne Mills", "comment_text": "Ravello"}, {"username": "Debbie Blaskie", "comment_text": "Carmine Amalfi Coast Tour. Do his Secret Tour. Best. ❤️❤️❤️"}, {"username": "Kn Blanchard", "comment_text": "We stayed in a small town, Conca dei Marini on the Amalfi coast. The SITA bus stops in town to go to the large and small towns. We would highly recommend (family of 5, three teenagers)"}]}, {"id": "2206960333036378", "text": "Is it too cold in winter for a campervan trip with my two teens?\nI'm thinking over the Christmas/New Year period.", "link": "facebook.com/groups/1373361046396315/permalink/2206960333036378/", "likes": 1, "comments": [{"username": "Philip Curnow", "comment_text": "Great surname 😀"}, {"username": "Kerry Laux", "comment_text": "I was in the North of Italy over Xmas and New Year and it was freezing- I was glad we were in a hotel!"}, {"username": "Melanie Matthews Stuprich", "comment_text": "Italy is pretty large? I’m sure it would be fine in Sicily but not northern Italy. Big difference."}, {"username": "Kristina Ruk", "comment_text": "It depends what year. We ussually go to the mountains of northen Italy so in some skiing resorts were camping zones fool of vans or campers every year ;)"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "yes!"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "It depends mainly on how well the heating works in your van. I have friends who go skiing with camper vans in the Dolomite, but it’s really cold. But Christmas 2022 in Tuscany was exceptionally 18 degrees.\nIn Sicily or Puglia usually is much warmer.\nMaybe you can chose the destination last minute?"}]}, {"id": "2206962863036125", "text": "Hi, First time Traveller to EU, Planning a trip with friends next year including Italy.\nFor Cinque Terre. ￼Would you recommend staying there for the 4-5 days or should we stay close by in La Spezia or Santa Margherita.\nWe won’t have a car so relying on public transport. 🙏", "link": "facebook.com/groups/1373361046396315/permalink/2206962863036125/", "likes": 3, "comments": [{"username": "Dafne Vassetti", "comment_text": "Use La Spezia as a base. So you can also see other things."}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "stay in Sestri https://\nwww.jdoqocy.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g194917-d2331\n54-Reviews-Hote\nl_Vis_a_Vis-Ses\ntri_Levante_Ita\nlian_Riviera_Li\nguria.html"}, {"username": "Greg Saba", "comment_text": "We based in Rapallo. A great jumping off point for Santa Margarita, Portofino (pictured), Camogli, even Genoa, as well as Cinque Terre, Portovenere, Lerice, Tellaro. From Rapallo, we were able to walk to the first two, while enjoying evenings in a vibrant community."}, {"username": "Kate Laidlaw", "comment_text": "We’re currently staying 4 nights in Riomagiorre. We got a pass to hike and use the trains. It has been amazing. Our accomodation is steps away from everything. Very relaxing. Nice and small compared to La Spezia."}, {"username": "Harry Fryer", "comment_text": "Hey dale, me and my friends spent your time residing in La Spezia. The location is very close to cinque terra and easily accessible by train, it is not at nice as cinque terra itself but if you are looking to try keep prices down i believe La Spezia is a wonderful option. I hope this helped and good luck with your planning xo"}, {"username": "Anne Haeusler", "comment_text": "Hi Dale, We stayed in a hotel on a hill just outside of Levanto which is the next town over from Cinque Terra for four days. It was less expensive and less frenetic than any of the five towns (the crowds at some were amazing). Trains run frequently to and from the towns if walking gets too much. Also had a sand beach there as well as the pebbles. Also enjoyed the walk to Bonassola as well. Not as pretty but much less crowded and the risotto from a street cafe was one of the best I've had. You'll love Cinque Terra, it is as pretty as the pictures."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2206967836368961", "text": "Hi! For those of you that have visited the Bell tower in Venice, were you allowed to wear shorts? I know that the basilica has a dress code but wondering about the tower alone. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2206967836368961/", "likes": 1, "comments": [{"username": "Jenny Godfrey", "comment_text": "Lots of people do. Ps bell tower has a lift to top no stairs to climb."}, {"username": "Amy Morrow Grucela", "comment_text": "No dress code"}, {"username": "Angela Mcnamara", "comment_text": "No dress code"}, {"username": "San Dra", "comment_text": "Thank you all for confirmation!"}, {"username": "Lori Wroblewski", "comment_text": "Venice is a lot more relaxed on dress code than Florence is"}, {"username": "Tricia Brittingham Neff", "comment_text": "Yup!"}]}, {"id": "2206967993035612", "text": "If you only had 1 day from Rome to explore a stunning little town in Tuscany, which would it be?\nWill be end of September and thinking somewhere not too far from Rome as have to return same day by public transport.\nWould have loved to have had more time of course and visited Pienza and Multipulciano.\nBut now considering Orvieto and squeezing in Civita di Bagnoregio or Spello?\nSuggestions please 🙏", "link": "facebook.com/groups/1373361046396315/permalink/2206967993035612/", "likes": 2, "comments": [{"username": "Daisy Yoo", "comment_text": "If u just have one day I would do Orvieto"}, {"username": "Dr-Jon Warnecke", "comment_text": "Spoleto and Spello can be done in one day, so can Orvieto and Civita d' Bagnoreggio. All are fantastic small towns/cities, uniquely different."}, {"username": "Linda Brecher Bekoff", "comment_text": "Orvieto is a simple train ride. Beautiful city but we found they all but shut down at lunch time. Plan to go early.\nFlorence is doable by train in 1 day if that’s all the time you have. We did it by train, covered a lot of ground, had dinner reservations and caught the last train back to Rome."}, {"username": "Jeanne Eliason", "comment_text": "Orvieto is gorgeous. If you can book the underground Orvieto tour. Google it."}, {"username": "Karen Hendershot", "comment_text": "Orvieto! Stroll and take it all in."}, {"username": "Sue Gaughan", "comment_text": "Civita di Bagnoregio, because one day it will be gone."}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "look here https://\nwww.viator.com/\ntours/Rome/\nTuscany-in-One-D\nay-Sightseeing-\nTour-from-Rome/\nd511-3731TUSCANY\n?pid=P00070587&\nmcid=42383&medi\num=link&medium_\nversion=selecto\nr"}, {"username": "Andrea Bainbridge", "comment_text": "Orvieto."}]}, {"id": "2206984486367296", "text": "Where is the best place or websites to buy skip the line tickets to the Vatican", "link": "facebook.com/groups/1373361046396315/permalink/2206984486367296/", "likes": 4, "comments": [{"username": "Philip Curnow", "comment_text": "Skip the line is a business in itself and a big earner for OTAs who purchase all the tickets in advance. Go to an official Romaturismo info point and ask them directly."}, {"username": "Silvia Maria Lourenco Narciso", "comment_text": "I bought them on tquets"}, {"username": "Brian Osman", "comment_text": "Use the Vatican website, not 3rd a third party, they often cancel on you, try to get the early morning tickets"}, {"username": "Paul Anderson", "comment_text": "Get the night tour. No lines the ticket office is up the street about 300 meters."}, {"username": "Cindy Gallen Barton", "comment_text": "The Tour Guy"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nVatican-VIP-Expe\nrience-Exclusiv\ne-Breakfast-at-\nthe-Vatican-wit\nh-Early-Access-\nto-Vatican-Muse\num-and-Sistine-\nChapel/\nd511-3731VATICAN\nBREAKFAST?pid=P\n00070587&mcid=4\n2383&medium=lin\nk&medium_versio\nn=selector"}, {"username": "Marty Harte", "comment_text": "I used Viator semi private skip the line tour and it wound up being through Liv. Amazing tour by Dario"}, {"username": "John Bruckman", "comment_text": "Just go to the Vatican website…."}, {"username": "Lisa Valdovinos", "comment_text": "Viator"}, {"username": "Roro Ja", "comment_text": "I bought from the station"}]}, {"id": "2206985146367230", "text": "Going to Venice for the first time and we have to do the gondolas. I have been reading its approx 80 euros. We are a family of 3. Would that be 80 each and is it cash only?", "link": "facebook.com/groups/1373361046396315/permalink/2206985146367230/", "likes": 5, "comments": [{"username": "Jim Bobrowski", "comment_text": "80 eu total for up to 5 people. Cash. Don't pre book just find one in an area you want to see. We got ours right outside Hard Rock Cafe. You want one that goes in small canals not the Grande Canal. Very rough on Grande Canal"}, {"username": "Kristina Ruk", "comment_text": "Nope. 1 gondola 80 eur, capacity to 5 persons"}, {"username": "Roz Fawcett", "comment_text": "Evening rides are € 100"}, {"username": "Leanne Bingle", "comment_text": "Elizabeth Colleen Fowler"}, {"username": "Gena Diaco Penland", "comment_text": "80 during the day and 100 in the evening. Not per person."}, {"username": "Jennifer Shephard", "comment_text": "Do you know if it’s cash or do they take cards"}, {"username": "Kathy Flood", "comment_text": "Book an evening with rowvenice.com. We had a blast."}, {"username": "Stacey Esposito", "comment_text": "And evening gondola rides start at 7 pm."}, {"username": "Stacey Esposito", "comment_text": "We got ours right by the rialto bridge."}, {"username": "Stacey Esposito", "comment_text": "Stacey Esposito"}, {"username": "Stacey Esposito", "comment_text": "It went down the little canals and was beautiful"}, {"username": "Shelby Symons", "comment_text": "We pre booked our tickets as we weren't sure how busy it was going to be and how easily it was going to be to get one."}, {"username": "Kay Matthews", "comment_text": "€80 for up to 5 people, for whole Gondola not each\nWe got one from the little bridges in the side streets, went out onto grand canal by Rialto and back into small canals. Was great"}, {"username": "Lori Wroblewski", "comment_text": "Omg it was amazing and so worth it! Our guy sang to us and told us all the things we saw. It was beautiful"}, {"username": "Courtney Rey", "comment_text": "80 EU we took the ferry from train station to San Marco don’t get on one of the ones by the ferry\nOver crowed long wait and they go in the grand canal\nWalk around and you will find plenty that go in the local areas with no wait and walked all the way back to the train to see as much as we could"}, {"username": "Jennifer Amen", "comment_text": "Do you tip Gondola workers??"}, {"username": "Mark Boyce", "comment_text": "Careful with prebooking if the weather is bad. A good friend couldn’t cancel and ended up going out in the rain."}, {"username": "Nancy Day", "comment_text": "If you want a longer ride can you book for double"}, {"username": "Sandy Michelle Duggan", "comment_text": "no 80 euros total, they are available all over venice"}, {"username": "Dee Keeling", "comment_text": "We just came back last night from our last stop at Venice. It was $108EU for 2 adults and our 10 year old by the Grand canal. To me it was not the 30min they stated."}]}, {"id": "2206991816366563", "text": "I need info on the golf cart tour of Rome", "link": "facebook.com/groups/1373361046396315/permalink/2206991816366563/", "likes": 66, "comments": [{"username": "Marl Joe", "comment_text": "Following"}, {"username": "Vasthi Cheddar", "comment_text": "Rolling Rome"}, {"username": "Nicola Jenkins", "comment_text": "Nick Jenkins"}, {"username": "Michelle Buckley", "comment_text": "Try the vespasidecartou\nr\nI had the best time"}, {"username": "Lara Grom", "comment_text": "Livtours and have fun with private or small group max 6"}, {"username": "Hope MacIntyre", "comment_text": "Joy"}, {"username": "Bridget Hamilton", "comment_text": "Following"}, {"username": "Mary Cassidy", "comment_text": "We did Livtour for 8 2 carts around 3 pm. It was great!"}, {"username": "Isabelle Maillé", "comment_text": "Guides - DestinationRome"}, {"username": "Emma Hanson Hammond", "comment_text": "Best thing we could have done with our kids. Rolling Rome!"}, {"username": "Tina Kennedy", "comment_text": "It's awesome! Booked mine through Viator. Highly recommend."}, {"username": "Coleen Durand", "comment_text": "Following"}, {"username": "Joni Macri Morell", "comment_text": "Anne resc"}, {"username": "Joshua Pickles", "comment_text": "YouTube"}, {"username": "Kenneth Autaubo", "comment_text": "Dublin,Sept 12, any recom’d for Brunch and Dinner"}, {"username": "Kelly Peagler Myers", "comment_text": "Shawnna Chance"}, {"username": "Hailey Thomas", "comment_text": "We have a tour of the Colosseum immediately after our golf cart tour, do you think they would allow us to stop and get food to bring on the golf cart with us? It’s tacky and I wouldn’t even ask if that’s not something that’s done but I’ve learned never to assume."}, {"username": "Karen Klein-Jelaso", "comment_text": "It was great"}, {"username": "Karen Klein-Jelaso", "comment_text": "It was great"}, {"username": "Franco Verrilli", "comment_text": "Lisa Foley"}, {"username": "Kevin Kappel", "comment_text": "How much is a tour for 2 people?"}, {"username": "Phyllis Bruno Hatala", "comment_text": "Rudy's touring service is the best ! knows history and art , gets you past all the lines, very nice and personable"}, {"username": "Therese Goulding Louk", "comment_text": "Tam Wong we used Travel Turtle Golf cart tour. We did the secret Rome tour as we had been to all the other places. If you like history, it was great."}, {"username": "Shama Patel", "comment_text": "Following"}, {"username": "Fiona Furletti", "comment_text": "Thank you for sharing!"}, {"username": "Rose Turdo", "comment_text": "Jennifer Jenifer Ahern Neverman"}, {"username": "Peggy Shea Tyrcz", "comment_text": "Timothy Scherer"}, {"username": "Peggy Shea Tyrcz", "comment_text": "Gina Barrett"}, {"username": "Andrea Celli Zeitvogel", "comment_text": "THIS IS HOW I LOOKED ROLLING ROME.....Viator\n<booking@t1.via\ntor.com>"}, {"username": "Linda Snyder Shandle", "comment_text": "we did Rolling Rome last week started at 7pm. it was great. we saw things we probably would not have seen, things I had never even heard of and others that we chose to see. we had colosseum and roman forum scheduled for next day so he took us to other places. really enjoyed it!"}, {"username": "Benski Dy", "comment_text": "Debbie Carroll"}, {"username": "Linda Smith", "comment_text": "Loved it!!!!!"}, {"username": "Barb Krieg-Stepien", "comment_text": "We we’re only in Rome a half day flying out the next. We did the 3hr night golf cart tour thru Viator. Wonderful to see all the sights with a little history. I wouldn’t recommend if you want a ton of info. Almost like a bullet points of all the sights. Beautiful at night. We did 7pm-10pm"}, {"username": "Tiffany Shimunek", "comment_text": "Laura, Ruth and Chris, more options listed here"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nRome-by-Golf-Car\nt-Private-Tour/\nd511-7377P1?pid=\nP00070587&mcid=\n42383&medium=li\nnk&medium_versi\non=selector"}, {"username": "Cheryl Grant Sizer", "comment_text": "Following"}, {"username": "Nicole Millar", "comment_text": "Marlene Kaiser-Domingue\nz"}, {"username": "Gina Gallardo Tolomeo", "comment_text": "We also did Rolling Rome - our guide Emmanuel was fantastic! Booked direct through their website. Great experience and one of our favorite tours. Did the sunset tour on our arrival day. Worked perfect for us - group of three."}, {"username": "Iman Nazaran", "comment_text": "Any one knows what is included and what it is not included in Glolf cart tour?"}, {"username": "Melodye Mitchell", "comment_text": "Will they combine groups to lower the price? There are just two of us and we’d be willing to share a cart if possible."}, {"username": "Geoff Roush", "comment_text": "We use Get Your Guide app for most of our excursions and tours and it's worked well."}, {"username": "Diane Hamilton", "comment_text": "Should I book a golf cart tour now? Arriving in Rome November 15 th"}, {"username": "Lorene Vallish Phelps", "comment_text": "Joanna Phillips"}, {"username": "Reets Lawrence", "comment_text": "Mel Sargison"}, {"username": "Linda Ryan", "comment_text": "How much?"}, {"username": "Minette Reyes-bautista", "comment_text": "Book thru get your guide; wheel tours with Antonella as guide— superb!"}, {"username": "Karen Ivgy", "comment_text": "We used Turtle Tours. Tomas and Matteo were great guides. Highly recommend."}, {"username": "Kim Kennedy", "comment_text": "Angel tours was great!"}, {"username": "Kim Siv", "comment_text": "Mary Jo Vaccaro Michelle Silvaroli"}, {"username": "Carmen Cullen", "comment_text": "Dareon Carrington"}, {"username": "Elise Wall", "comment_text": "Turtle tours"}, {"username": "Chris Smiley", "comment_text": "Biga always!!!"}, {"username": "Brandon Smith", "comment_text": "Hi there...read on another post that the golf cart tours were being banned by the city and companies were cancelling....h\nas that been worked out and they are operating again?"}, {"username": "Chelsey Beth", "comment_text": "Carol Corrao"}, {"username": "Dayna Scinto", "comment_text": "We thoroughly enjoyed Turtle Tours, they will even start the tour at your accommodation if you are within the city. We did a evening/sunset tour which was perfect. Our teenagers loved it too."}, {"username": "Haley Ex-Lubeskie", "comment_text": "Joyce Ex"}, {"username": "Sharon Wozza", "comment_text": "We are only 2 people. Not sure if you pay per head or per cart! Is there anyway to book to share the cart (& cost) with another party?? TIA"}, {"username": "Catherine Nichols", "comment_text": "We did Rolling Rome, was the definite highlight in Rome. Our guide Valeria was so knowledgeable and personable and it was so much fun seeing the city like this, including a free gelato! Highly recommend."}, {"username": "Donna Dillon", "comment_text": "It’s quite expensive once you convert Aussie dollars"}, {"username": "Lisa Ciardullo", "comment_text": "Josephine Palmisano"}, {"username": "Jeannie Scala", "comment_text": "What info do you need?"}, {"username": "Trace Barron", "comment_text": "Maybe try a please????"}, {"username": "Michael Barnes", "comment_text": "Which one.\nThere are many golf cart tours in Roma."}, {"username": "David Murszewski", "comment_text": "Well worth it!"}, {"username": "Allison Miller Kramer", "comment_text": "Biga Tours- was the best! I could have listened to him all day. Wealth of knowledge. Nice golf carts too."}, {"username": "Paula Ehlenberger Zottoli", "comment_text": "We loved this one"}, {"username": "Michael Villeck", "comment_text": "Rolling Rome was amazing. Our guide was Gabriel. Best tour we did in Rome. Took us everywhere knew everything and recommended maybe our favorite dinner of the trip !!"}, {"username": "Darrow Pate B", "comment_text": "Look into the Vespa Sidecar Tour as an alternative! It is amazing!!!!!!"}, {"username": "Jo Morgan", "comment_text": "We used Livtours last month they were great"}, {"username": "Jessica Bender", "comment_text": "Stacy Giammarino Betty"}, {"username": "Gail Lafferty", "comment_text": "Rolling Rome was terrific. Guide full of info and flexible.\nJust right for us: 2 kids, 2 parents and 2 grandparents. On/off optional at sites."}, {"username": "Edmond Nolan", "comment_text": "Way too expensive"}, {"username": "Christine Sanci-Gentile", "comment_text": "Evening tour with Sophie at mybesttour.com was amazing."}, {"username": "Michelle Horvath Sitkowski", "comment_text": "Following"}, {"username": "Linda Chase", "comment_text": "We used LivTours and it was wonderful!"}, {"username": "Dianne Maurer", "comment_text": "Bob Gowen something fun to do in Rome"}, {"username": "Kelly Tabor", "comment_text": "It’s the best. LIV tours and ask for Chiara De Marchis. She’s amazing."}]}, {"id": "2207002499698828", "text": "My daughter’s in Europe and trying to organize a guided hiking tour of dolomite’s but not having much luck with availability Looking around 20 th of Sept. any suggestions", "link": "facebook.com/groups/1373361046396315/permalink/2207002499698828/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Venice/\nGuided-hike-on-f\nootpaths-in-the\n-Dolomites/\nd522-144865P2?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}]}, {"id": "2207004256365319", "text": "We have the opportunity to do the VIP tour of the Vatican for breakfast. Is it worth it, or would you just go early/skip the line tickets? Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2207004256365319/", "likes": 0, "comments": []}, {"id": "2207006296365115", "text": "Best day trip from Rome?", "link": "facebook.com/groups/1373361046396315/permalink/2207006296365115/", "likes": 0, "comments": [{"username": "Cinzia Berletti", "comment_text": "Following"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nSmall-Group-Pomp\neii-with-Amalfi\n-Coast-Drive-an\nd-Positano-Stop\n-from-Rome/\nd511-15693P17?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nTivoli-Day-Trip-\nfrom-Rome-Villa\n-dEste-and-Hadr\nians-Villa/\nd511-3058TIVOLI?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}]}, {"id": "2207015556364189", "text": "Thought some mind find this interesting.\n\n", "link": "facebook.com/groups/1373361046396315/permalink/2207015556364189/", "likes": 1, "comments": []}, {"id": "2207040516361693", "text": "Hi we are driving from Matera to Pompei, I would love some information on the best places to stop on the way. We are doing it as a day trip. Thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2207040516361693/", "likes": 1, "comments": [{"username": "Giulia Cardamone", "comment_text": "Caserta! The Versailles of Italy!"}]}, {"id": "2207040913028320", "text": "We are ending a tour in Rome but want to stay for a few extra days to Pompeii, Coloseum, Trevi Fountain etc etc. Does anyone have a ball park of how many extra days is enough?", "link": "facebook.com/groups/1373361046396315/permalink/2207040913028320/", "likes": 0, "comments": [{"username": "Jon Cheeks", "comment_text": "I would say another week"}]}, {"id": "2207040666361678", "text": "Hi! I’m in Rome and considering doing a Sunday day trip to Tuscany. It looks like we will visit Montepulciano and Pienza. It also includes wine history and a lunch on a vineyard. Any suggestions if this is a good trip to take? We leave for our cruise Monday, so day trip only. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2207040666361678/", "likes": 2, "comments": [{"username": "Kimberly Lampros", "comment_text": "If you have enough time and don't mind the ride and long day then I'd say do it. I took a similar tour but it was out of siena so it was much closer. But seeing montepulciano and Pienza was fantastic and where we had lunch had stunning views and delicious food."}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nTuscany-in-One-D\nay-Sightseeing-\nTour-from-Rome/\nd511-3731TUSCANY\n?pid=P00070587&\nmcid=42383&medi\num=link&medium_\nversion=selecto\nr"}, {"username": "Linda Mascaro", "comment_text": "How about Trastevare"}, {"username": "Diane Milam Morgan", "comment_text": "Two of the best towns in Tuscany for sure"}, {"username": "Melanie Wilkins Bennett", "comment_text": "After all the great comments, we decided to take the tour! I’ll do an update after. Thank you!! 🥰"}]}, {"id": "2207055893026822", "text": "Hey everyone, we’re travelling to Italy for the first time at the end of the month with our 18-month old. Looking for recommendations on where to stay in Rome, Sorrento (or Amalfi), and Florence. We plan on renting a car to get from city to city but don’t intend to use it otherwise.\nThanks in advance! :)", "link": "facebook.com/groups/1373361046396315/permalink/2207055893026822/", "likes": 3, "comments": [{"username": "Jenny Payne", "comment_text": "Think twice about driving from Sorrento to Amalfi, I think it would be a nightmare🌻"}, {"username": "Gina Rovello Keenan", "comment_text": "Are you renting a car one way to each city or are you just going to park it for days not in use? That could be very expensive."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "You are booking very late and pickings will be slim. I advise you to check availability on a booking site."}, {"username": "Irene Oda", "comment_text": "At the end of August?"}, {"username": "Nikki Blosser", "comment_text": "Would be more cost efficient to use the train to go between those cities. (faster too) Parking can be a huge hassle there.\nBooking lodging may prove to be difficult at this late date. People will be suggesting certain places that will likely be booked already. I would search up AirBnB and see what is available in the areas you want to go.\nSorrento is nice to stay, I hear Ravello is quieter. Although with the tourism boom I have to wonder if these smaller towns are busy too with everyone recommending them now instead…."}, {"username": "Suzanne Mills", "comment_text": "Find an Airbnb with a small kitchen. Ditch the car idea, parking is IMPOSSIBLE. Train and see the countryside and relax."}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.discovercars\n.com/\n?a_aid=NextStop-\nItaly"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Rome https://\nwww.dpbolvw.net/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187791-d3964\n772-Reviews-Rom\ne_Times_Hotel-R\nome_Lazio.html"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Amalfi Coast https://\nwww.jdoqocy.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g194806-d6036\n30-Reviews-Hote\nl_Club_Due_Torr\ni-Maiori_Amalfi\n_Coast_Province\n_of_Salerno_Cam\npania.html"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Florence https://\nwww.kqzyfj.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187895-d3314\n157-Reviews-Hot\nel_Firenze_Numb\ner_Nine-Florenc\ne_Tuscany.html"}, {"username": "Bellafab Fabrizio", "comment_text": "Dont drive in Amalfi"}]}, {"id": "2207063989692679", "text": "Going to Milan, Venice (Read many posts about Gondola rides...will do) and Florence soon.\nAnyone have any recommendations in particular for Florence and cooking,wine etc? Thanks in advance for any suggestions.", "link": "facebook.com/groups/1373361046396315/permalink/2207063989692679/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Florence/\nPastamania-Pasta\n-making-class/\nd519-125387P1?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}]}, {"id": "2207059536359791", "text": "Please recommend restaurants to eat at in Trastevere. Thanks in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2207059536359791/", "likes": 12, "comments": [{"username": "Jan Armstrong", "comment_text": "Tonnarello and Emma"}, {"username": "χριστινα χατζηγεωργιου", "comment_text": "Τοnarello was great"}, {"username": "Marty Harte", "comment_text": "There last week for sons 18bday dinner. Amazing."}, {"username": "Pam Glaser Handmaker", "comment_text": "FYI- there are 2 Tonarello locations. The one with the line. And the other one. We had a 10 minute wait!"}, {"username": "Nicole Gouzoules Sheehan", "comment_text": "Mimi e coco Trast!"}, {"username": "Muhannad Abudahab", "comment_text": "Mimi e coco Trastevere"}, {"username": "Rocio Isasi Cortazar", "comment_text": "Tonarello 🇮🇹😋"}, {"username": "Francesca Campetta", "comment_text": "Da Sora Lella\nDa Enzo al 29\nOtello\nPopi Popi"}, {"username": "Kelly Aynes Zingaro", "comment_text": "Nannarella"}, {"username": "David Dowd", "comment_text": "Trattoria Da Teo piazza Del ponziani wonderful food"}, {"username": "Mike Nello", "comment_text": "Tonarella"}, {"username": "Maryanne Cristina", "comment_text": "Nannarella"}, {"username": "Paul Gardner", "comment_text": "Had great Carbonara and aperitivo at Pimms Good restaurant …check it out"}, {"username": "Jennifer Gustafson", "comment_text": "Www.eatingeurop\ne.com the twilight Trastevere food tour. It was a wonderful tour with all kinds of special dishes."}, {"username": "Steve Rothstein", "comment_text": "Tonnarello\nGet the Tiramusu for dessert !!"}, {"username": "Juliet Johnson", "comment_text": "Roma Sparita"}, {"username": "Alice Dzimiera", "comment_text": "Trattoria da Teo,Mimi e Coco & Osteria da zi Umberto. Tonnarelli & da Enzo lines are too long & I think overhyped"}, {"username": "Maureen McGough Hines", "comment_text": "Popi Popi was amazing"}, {"username": "Rashelle Lynne", "comment_text": "Prosciutteria cantina dei papi for lunch and Mimi e coco"}, {"username": "Jenny Barr", "comment_text": "Da Enzo is delicious and popular with locals."}, {"username": "Chelsea Gudith", "comment_text": "Chelsea Gudith"}, {"username": "Juan Carlos Calle", "comment_text": "Tornarello"}, {"username": "Juan Carlos Calle", "comment_text": "Juan Carlos Calle"}, {"username": "Juan Carlos Calle", "comment_text": "Juan Carlos Calle"}, {"username": "David Baillie", "comment_text": "Any restaurant without a line of eager tourists caught in the grip of their high expectations. There's great eating all over."}, {"username": "Terrel Ramsay", "comment_text": "Nonarellas"}, {"username": "Jolie Lubitz-Centazzo", "comment_text": "Dar Poeta for amazing pizza"}, {"username": "Belinda Scanlon", "comment_text": "Tonarello"}, {"username": "Laura Butler", "comment_text": "Da Meo Patacca! Delicioso"}, {"username": "Michael Rabkin", "comment_text": "Not sure about restaurants, but I highly recommend Freni e Frizioni for aperetivo. They have an excellent vegetarian buffet, and the location is great."}, {"username": "Sandy Radican Shikaly", "comment_text": "Tonnarello"}, {"username": "Philip Curnow", "comment_text": "Never had a problem with 'Da Massi'. Popular with Romans and visitors. Very fair prices."}, {"username": "Sam Braithwaite", "comment_text": "Ate here on Tuesday evening and it was delicious. Great staff and good prices. Can 💯 recommend Da Massi 👍🏻"}, {"username": "Jill Rosenfeld", "comment_text": "Tonarella"}, {"username": "Kyle Wilcox", "comment_text": "Tonarello"}, {"username": "Beth Ann", "comment_text": "Rione 13"}, {"username": "Steve Griggs", "comment_text": "I’ll be staying Trastevere in November. Talking a walking tour of 10 restaurants. Hopefully Toranelllo is one of them."}, {"username": "Susan Carney Ash", "comment_text": "Da Enzo is great, but get there early! The line gets looooong."}]}, {"id": "2207065173025894", "text": "Looking for a place to buy a diamond wedding band (not engagement ring) on my upcoming trip. Florence, Venice, lake como, Milan and Nice, France.\n\nIs Italy/ France a good place to buy a diamond ring or would I get better value just buying in the states?\n\nI can’t find much information online about buying diamonds there.", "link": "facebook.com/groups/1373361046396315/permalink/2207065173025894/", "likes": 0, "comments": []}, {"id": "2207067306359014", "text": "Sicily Suggestions appreciated! I wanna experience the best I can in 12 days without being run ragged. What are the best spots/best routes? Is Palermo and west better or Catania and East?! It all seems so amazing, therefore I am overwhelmed!", "link": "facebook.com/groups/1373361046396315/permalink/2207067306359014/", "likes": 0, "comments": [{"username": "Greg Saba", "comment_text": "The three most popular and iconic places for short visits are Cefalu, Taormina and Ortigia. As you have found, there are so many options, but you could fly into Palermo, spend a couple days there, and travel by train to Cefalu, then by rail on to Taormina and end in Ortigia (which also could be a day trip from Taormina). You can then fly out from Catania. This allows for a tour of Mt. Etna. Maybe a granita and brioche on Castelmola above Taormina."}, {"username": "Rina Speronello", "comment_text": "Mattia Caramazza"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nnextstop-italy.c\nom/\nvirtual-tours/\nbest-of-sicily/"}, {"username": "Elena Innocenti", "comment_text": "I like the west. Palermo, Monreale, San Vito lo Capo, Cefalù, Bagheria, Trapani, Bonagia, Erice, Marsala, Segesta, Sellinunte…\n\nFrom Marsala you can have a day trip by boat to Favignana, Marettimo and Levanzo (I like Levanzo sooooo much)"}]}, {"id": "2207071923025219", "text": "The view from Tempio di Giove, Terracina (Lazio Region)", "link": "facebook.com/groups/1373361046396315/permalink/2207071923025219/", "likes": 3, "comments": []}, {"id": "2207085919690486", "text": "Hi! We Will Travel by car from Bologna to Cavriglia in Tuscany. Any suggestions of nice stops on the way resturants, wineyards, villiages or views?", "link": "facebook.com/groups/1373361046396315/permalink/2207085919690486/", "likes": 1, "comments": []}, {"id": "2207092783023133", "text": "Someone asked below. There is a free shuttle from the airport terminal. Check the hotel website for information.\n\nDoes anyone know how to get from the FCO train station to the Hilton Garden Inn - is there a shuttle or is it best by taxi?", "link": "facebook.com/groups/1373361046396315/permalink/2207092783023133/", "likes": 1, "comments": [{"username": "Ruth Hackert", "comment_text": "Ask the hotel"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2207096916356053", "text": "We had our Coopculture Underground night tour of the Colosseum last night. I just wanted to share my experience for anyone else who’s planning on doing this. First of all, we had to book the tickets in Italian, despite stalking the website, practicing buying a few days before, setting alarms, AND trying 4 days in a row….I was unable to secure English tickets. I had read in quite a few places this was no big deal, that most tours are all English speaking people and the guide ends up doing the tour in English or else you can follow closely along with google translate. We didn’t get that lucky. Our group was ALL Italian speaking, she didn’t say one single word to us in English and Google Translate was terrible when it even worked. There was no signal in the underground. My husband and son listened to our downloaded Rick Steves app, but we all feel as though we missed out on so much. I took some amazing pictures and enjoyed just being there, but I would have really enjoyed some history and her point of view.\n\nAlso….BRING EVERYONES PASSPORT!!!! Despite 2 years of planning and research, I somehow missed this little nugget of information!!! When we went to check in, the man looking at tickets Flat. Out. Refused. To let us in. In fact he was screaming “No way, No Way” as I pleaded with him (my husband and I had our ID’s. I even may have shed a tear or two. As we were walking away to leave, my son said “Do you have pictures of our passports?” OMG!!!YES I did!!! Of course I did, why didn’t I think of that!!! My mind was 💯 focused on getting back to our Airbnb in enough time to grab the passports and get back!! Well, he saved the day!! They accepted the pictures!!\n\nAll in all it was an experience we’ll never forget, I was happy we got inside, toured the underground and went at night. The night part was amazing to me. The 8:30 tickets were perfect for lighting in pictures!!", "link": "facebook.com/groups/1373361046396315/permalink/2207096916356053/", "likes": 476, "comments": [{"username": "Cathy Saultzman", "comment_text": "Donna Clemons Curry"}, {"username": "Elaine Wilson", "comment_text": "Looks great"}, {"username": "Anne Davidson", "comment_text": "I didn’t know about this tour. Thanks for sharing."}, {"username": "Rachael Richardson", "comment_text": "Lucky you ours got cancelled"}, {"username": "Deborah Barnes", "comment_text": "I stalked the site for weeks trying to nail the ticket release timing. It was not always aligned to the tour time (at least the English version) I ended up buying tickets for the Italian version. I still think it will be a special experience. It seems there are limited ticket numbers released for the underground night tour and I have no clue how I could have improved my chances."}, {"username": "Gretchen Barretto", "comment_text": "Mel CastilloJoash Isaiah CastilloJoachim Miguel Castillo"}, {"username": "Kristy Portz", "comment_text": "Melaina Zanelle"}, {"username": "Joanne Smith", "comment_text": "Are you from StLouis? I know people by your name"}, {"username": "Rebecca Creek", "comment_text": "Looks like it was well worth all the effort ! Beautiful pictures."}, {"username": "Lori Charlene", "comment_text": "Deanna Guerin"}, {"username": "Nancy Sunshine", "comment_text": "Thanks for the tip about the passport I didn't think we would need it but now I know"}, {"username": "Helen Kimber", "comment_text": "Shayne Duncan"}, {"username": "Lynnie Silverman", "comment_text": "I have a tight fitting slim cross body bag this fits under my jacket, not exposed. We carry passports in it, ID’s and photos on our phones of the passports, insurance cards, Medicare, etc.\nI won’t let my husband carry anything in his pockets!\nOf course, if I get kidnapped, my husband is sunk!🤪"}, {"username": "Monica Paz Gannon", "comment_text": "I, with other teachers took a high school group of 46 kids in 2019 and our assigned tour guide (from the Europe tour company) collected all of our passports in order to show at all the places we went. So yes, you will be asked for it no matter the size of your group or family."}, {"username": "Cathlene Dunn", "comment_text": "Your son is a very sharp guy and saved the day. I hope he got seconds of gelato! Thanks for the tour info. Your photos are beautiful!"}, {"username": "Helen Wake", "comment_text": "I've never been yet but have no idea why you would ever need a passport to get in to an attraction???? You've bought a ticket... why do they care who you are? So bizzare. Here in Australia is unheard of to ever need a passport.... they're needed to enter a country..... not a tourist spot. So strange. But will remember once I finally get to Italy. Never needed it in China, in Prague, in Holland...."}, {"username": "Rose Stolarek", "comment_text": "So glad you had a great time and I hope you bought your son a well deserved gelati! Keep enjoying your travels"}, {"username": "Angie Bacon-Gonzalez", "comment_text": "Kathy Bacon"}, {"username": "Carla Jane", "comment_text": "Darren Bonaccorso, have a read😊"}, {"username": "Michelle Lynch", "comment_text": "Sue Weir"}, {"username": "Lorrie Newey Monn", "comment_text": "Amy Colledge"}, {"username": "Paula Grove Baker", "comment_text": "We go next month already have tickets for night tour. It was plainly listed in the instructions that ID is required upon arrival for the tour."}, {"username": "Paula Maree", "comment_text": "Pretty sure it must be the same man that yelled at us Amber Dunbar 🤦🏻‍♀️😃"}, {"username": "Christina Ulewicz", "comment_text": "Honestly I would fear it would get stolen too. So I probably would have made the same mistake"}, {"username": "Kathy Burry", "comment_text": "Looks amazing."}, {"username": "Chloé Marie", "comment_text": "I stalked the website for days and we were not able to secure tickets in English either! We also decided to just go with the Italian tour, as it was our only option. We figure it will be a bummer to not hear the tour in English but we couldn’t bare going to Rome and not getting a chance to see such a historical site…especially\nat night!"}, {"username": "Wendy Johnson", "comment_text": "We also did the Italian 8:30 pm tour, 2 weeks ago. All but three people on our tour could speak, and understand Italian Including my husband.\nWe all just wanted to see and take photos at the Colosseum at night. Even in all Italian, so totally worth it.\nWe did go back for a day tour, that also included the Roman Forum. Also, they just require everyone to have picture ID such as a driver’s license, we did not need our passports.\nOut of all my tours while in Italy which included- Rome, Venice, and Milan and Pompeii the Colosseum was the only place that wanted to see picture ID."}, {"username": "Arv S Sachdev", "comment_text": "lovely pictures. thank you for sharing. memorable times."}, {"username": "Cindy Solomon", "comment_text": "Candace Linda Solomon Cross"}, {"username": "Cindy Solomon", "comment_text": "Trevor's ArtWorld"}, {"username": "Jessica Thompson", "comment_text": "I just asked in this group about a cool colosseum tour …so glad you posted. I’m going to schedule this. I’m sorry of what you had to go through. Sounds stressful …but look at the amazing photos …and great memories!! So glad you turned it around and had a great time. 👏🏻👏🏻👏🏻"}, {"username": "Joanne Smith", "comment_text": "Great pics"}, {"username": "Rita Legge", "comment_text": "So happy you got in. What a disappointment though not being able to listen to the tour in English. But your photos are wonderful. What an experience!\nI have been stalking the website as well and cannot figure out when tickets are actually released. Have been watching for the didactic tour but I can never see the newest dates turn green. Once in awhile a random date will show a couple of time slots with usually only one ticket available. Do you have any tips? Thanks!"}, {"username": "Michelle Thorpe", "comment_text": "Sounds too stressful for me. I’m a big believer in no to low stress vacations. That sounds like work."}, {"username": "Justin Sidhu", "comment_text": "I second this. While Italian was very much a second language for all in our group, we certainly weren't given an option and the entirety of the tour was in Italian. It was difficult for many throughout the group to follow along. Drivers licenses work for ID, as well as a health insurance card that had our son's name on it. Security was stricter than I would have thought. Anyway, while we couldn't follow along, the experience itself was amazing."}, {"username": "Nadia Nadia", "comment_text": "Omg i too have bought Italian speaking tour as English wasn’t available 😬😬😬"}, {"username": "Annof RedGables", "comment_text": "Why do they need to see your passport to do a tour?"}, {"username": "Toni Colwell", "comment_text": "I’m so sorry to hear that your google translate didn’t work — we had our underground tour, and the app worked in almost every part down there, except for when we were surrounded with stone on all sides. But if I could see the night sky, then the app worked.\n\nI agree though, it is disappointing that they don’t have more English tours scheduled overall — as it would have been best to hear the guide directly.\n\nUltimately, you were able to see it, which is what matters the most. As you can also do a little online research about it later\n\nBtw, what a quick-thinking boy your son was. 🙌"}, {"username": "Valentina Saltarelli", "comment_text": "I’m from Rome ( my English is not perfect) but I want to say that as Italian I’m so sorry for this bad experience.\nI often, for several reasons, visit Colosseo Vatican and co. and I completely understand your difficulties. Sometimes people are very rude and I’m upset for this .\nMoreover is very difficult also for Italians to find Colosseo tickets !!!"}, {"username": "Sherry Held", "comment_text": "Lovely photos! Glad it all worked out."}, {"username": "Sylvie Hogg Murphy", "comment_text": "Incredible pics! Yay for your son saving the day and all of you managing to enjoy the experience despite the language barrier. The ruins are so evocative at night, aren’t they??"}, {"username": "Carolyn Danielson Sanchez", "comment_text": "I scheduled a night tour with a guide thru GetYourGuide. It’s at the beginning of October, but didn’t have any issues with booking. It says it’s in English, so I sure hope it works out! ￼ Thank you for the heads up about the passport. I just looked at my reservation and it does specify a passport, but photocopies are excepted. ￼"}, {"username": "Cherie Coe", "comment_text": "Quentin Coe"}, {"username": "Kym Stacey-Nielsen", "comment_text": "Why on earth do you need to see your passports or a copy of it!"}, {"username": "Gwen Roberts Baker", "comment_text": "We're thinking of booking a night tour but are wondering if we'll miss out on some of the surroundings due to the lack of light. Thoughts?"}, {"username": "Atet GC", "comment_text": "What is this tour package called? It seems amazing to go on night time."}, {"username": "Tracy Jasas", "comment_text": "Lots of good info! Thanks"}, {"username": "Nic Ní Mhealláin", "comment_text": "How did you book this? My son would love this"}, {"username": "Caterina Liquori-Culhane", "comment_text": "We just came from italy and only did the regular tour. We were never asked for our passports once. This is my fourth time to italy and again never been asked for a passport. Very strsnge"}, {"username": "Caterina Liquori-Culhane", "comment_text": "That's cool at night. Never knew they had night tours"}, {"username": "Catherine Lefebvre", "comment_text": "Why are people so obstinate to not bring their passport with them ?? On a trip, you bring it everywhere !! When we receive it, that's what we're told"}, {"username": "Patty Maffei", "comment_text": "Thanks for the pictures. Wouldn’t have thought of doing it at night. And also the passport and English tour. Glad it all worked out"}, {"username": "Krystal Apolinaro", "comment_text": "We did both the daytime and nighttime tours and we liked the nighttime one as well. So cool! For future reference, some tour companies also do the tours underground. We used Get our Guide and scored tickets!"}, {"username": "Melissa Hunt", "comment_text": "I did just what you did and also had no luck snagging English tickets so I bought Italian. Knowing what you just said now I have an idea to pay one of the other guests to translate for us if anyone speaks English!"}, {"username": "Valerie Collanton", "comment_text": "Glad it worked out. I would not expect that a guide would speak English if the tour specified it was in Italian."}, {"username": "Jerry Mullis", "comment_text": "Wow, What agency did you book it with?"}, {"username": "Reta Carter", "comment_text": "Thank you! Love your beautiful photos and your info. We just returned from Rome and will definitely go back and do the underground tour! I tried when we went but no such luck!! I will plan very far in advance to get this thanks to your advice! Love this helpful site’"}, {"username": "Dianne Novak Iadanza", "comment_text": "Wonderful pictures and hope that your son and you will remember it in a better light looking back. How many people were in your Italian tour. We arr planning for 1st weekend in October so really getting ready to try and schedule through coopculturr."}, {"username": "Dianne Novak Iadanza", "comment_text": "I think every hour 30 days in advance but not sure if every \"tour time\" like 7:40 or on the hour"}, {"username": "Beverly Wagner", "comment_text": "Amazing"}, {"username": "Stacy Rosenbaum Hochmuth", "comment_text": "I also did many of the things you did and only got through on the Italian tour at night. Glad to hear you still enjoyed it!"}, {"username": "Sharon Long", "comment_text": "Oh wow! What a roller coaster! 😬 Glad you got in. So bummed it wasn’t translated for you. Thank you for sharing your experience and your feedback. We’ll be there next month!"}, {"username": "Kim Butler Oam", "comment_text": "Oh the things that happen. 🤦‍♀️ I’m deaf so wouldn’t matter what language for me 😂, I just research before I go and use my imagination from watching shows with captions. I’ll definitely do the night tour next trip. I’m so glad you got in but yes a shame it wasn’t in English. I bet the atmosphere helped make up for that. Could you imagine the gladiators walking down those hallways . My imagination ran wild on my day time visit. Loved it. Enjoy the rest of your trip"}, {"username": "Andrea Hirsch", "comment_text": "We had the SAME issue!!!! Our guide said like 5 words in English, and was nice enough to answer some questions at the end for us since there were like 8 English only speakers on our tour. But my kids were frustrated and we felt the same. And I was unsuccessful trying to download the Rick Steve’s also due to no service. I feel your pain. I fee like the underground wasn’t worth it as a result:("}, {"username": "Melanie Matthews Stuprich", "comment_text": "Yes thankfully we had pictures of all of our passports as well for many tours. Easier than carrying the passports around and possibly getting them stolen!"}, {"username": "Karen Blackmore", "comment_text": "Sorry to hear that. We were lucky with the English tour but it was September. Yes, some have said use Google translate or everyone English, sorry it didn't work out for you 😥. Amazing that you saw it. And yes, well done to your son re the photos of passports. I took ours thinking they wouldn't check, but they certainly did!"}, {"username": "Laura Taylor Gregar", "comment_text": "Which one did you go on? I’m on website now. Does it specify underground tour?"}]}, {"id": "2207127079686370", "text": "I watched a young woman in the crowd stand up and sing Andre Bocelli (Time to say goodbye) on the 21/07/23 in the front of the Florian Cafe. It was the most cathartic experience i have ever encountered. I cried for hours. I would love if someone on here was there to experience the song. It was absolutely beautiful and on my birthday. Wondering if anyone recorded it by chance.", "link": "facebook.com/groups/1373361046396315/permalink/2207127079686370/", "likes": 1, "comments": []}, {"id": "2207131519685926", "text": "Hello\nopinions about hotel Accademia in Rome?\nhow are the standard rooms, I understand they are the only ones not renovated?\nbut what are the business rooms like?\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2207131519685926/", "likes": 0, "comments": []}, {"id": "2207143499684728", "text": "Sicily : Palermo, Cefalù, Castellamare del Golfo and Sciacca.", "link": "facebook.com/groups/1373361046396315/permalink/2207143499684728/", "likes": 40, "comments": [{"username": "Victoria Russo", "comment_text": "Going to Catania October 1\nExcited to visit"}, {"username": "Vicki Musiello", "comment_text": "Great photos!!"}, {"username": "Sue Graham", "comment_text": "Fab photos. We loved Sicily ."}]}, {"id": "2207148486350896", "text": "I'm a female travelling from Naples Airport to Sorrento alone. How easy is it navigate Naples Airport? I'm thinking of getting a bus/coach from the airport. Looking for easiest & hassle free option. I've a dreadful sense of direction!! Any advice/recommendations would be much appreciated. Thank you in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2207148486350896/", "likes": 0, "comments": []}, {"id": "2207149386350806", "text": "Somewhere in Lake Garda🥰🇮🇹!", "link": "facebook.com/groups/1373361046396315/permalink/2207149386350806/", "likes": 3, "comments": []}, {"id": "2207150626350682", "text": "Any private tour for 12 pax ?\nRome > pisa> >milan drop us at brig Switzerland\nEnd of November ?\nAround 6 to 7 days", "link": "facebook.com/groups/1373361046396315/permalink/2207150626350682/", "likes": 0, "comments": []}, {"id": "2207152549683823", "text": "Im travelling from India in september . Which luxury bag I can buy with budget of 500-1000 usd from Rome ?", "link": "facebook.com/groups/1373361046396315/permalink/2207152549683823/", "likes": 0, "comments": []}, {"id": "2207155736350171", "text": "Hi, so travellers from Australia how did you purchase train tickets for towns around Italy.\nEveryone says Tranitalia app but it's not available in Australia tia", "link": "facebook.com/groups/1373361046396315/permalink/2207155736350171/", "likes": 23, "comments": [{"username": "Ravi Mittal", "comment_text": "You can use omio.com"}, {"username": "Lesley Fisher", "comment_text": "We recently travelled the UK & Europe including Italy in June/ July & we had EURORAIL passes & pre booked the most likely booked out trips &/or longer journeys so we had a guaranteed seat & table with comfort.\nThen whilst over there travelling we used an app called TRAINLINE that you can search any country throughout Europe & UK & it gives you all the options & prices & I believe you can book & pay for these whilst in Australia but found it so much easier to just book the smaller trips on this app whilst over there.\nWe have relatives & family including my Son who live in the UK & they all use TRAINLINE whilst travelling in their own country or in Europe.\nWe also missed a few of our reserved & prepaid bookings whilst in Europe due to train strikes & delays & last minute changes on platforms that you have to run & quite often climb many stairs! Especially Italy & France. But don’t stress as if we missed our booked one we jumped on the next available & they honoured our booking even though a different time on our tickets. They obviously know how many delays there are & not once asked again to pay again!\nGood luck 🚂"}, {"username": "Kaylean Smith", "comment_text": "I purchased tickets via Trainline as well we haven’t travelled yet but the online transaction was easy"}, {"username": "Raquel Pickering", "comment_text": "Bought ours at the rome termini. We knew when and where we were going so we actually bought ones for our next leg on the train trip when we arrived got to the destination. We were going from Rome to Florence to venice to milan to Paris. So when we arrived in Rome, we bought our florence tickets at the termini and when we arrived at florence we bought or venice ticket's etc..."}, {"username": "Karen Hansen", "comment_text": "I am in Australia and used omnio, very easy and in English"}, {"username": "John Kinchin", "comment_text": "Trainline"}, {"username": "Marilyn Edwards", "comment_text": "I’ve been travelling around the South of Italy for 3 months & only use the TRENÌT App. It’s so convenient & I linked it to my PayPal account. You choose the train you wish to purchase , pay for the ticket & it’s sent to you via email. No need to find a working machine to validate, you just show the email to the conductor when he comes around on the train. It’s the best way to purchase & prebook. Worked for me before I left Australia. The train timetables are there and it shows the stops & if the train is delayed. It’s a great app. 🇮🇹"}, {"username": "Phil Derriaghy", "comment_text": "Trainline"}, {"username": "Elisa Doro", "comment_text": "I only book if it’s high season… otherwise just buy when you need … I live here and use. Trenitalia .. easy and quick"}, {"username": "Cheryl Theunissen", "comment_text": "Omio worked for us. We are from South Africa. What's nice with the App, you don't need to print vouchers."}, {"username": "Kelly Parkinson", "comment_text": "From Australia and used Trainline 😊"}, {"username": "Rebecca Loughron", "comment_text": "Bernie Loughron….. interesting"}, {"username": "Christina Vitas", "comment_text": "Raileurope app"}, {"username": "Natalie Perrett", "comment_text": "Sue Jennion"}, {"username": "Rachel Cooksley", "comment_text": "Trenitalia.com\nJust booked all of our train tickets on the website with no issues. Prices are in Euro, that’s the only disadvantage.\nIf you go to the menu, you can change it from Italian to English"}, {"username": "Sharyn Wright", "comment_text": "We purchased through our travel agent"}, {"username": "Margaret Wills", "comment_text": "We’re travelling through Italy in September to 9 different locations and booked all our train tickets through OMIO and Rome2Rio and paid for them in AUD currency through ApplePay. All digital and downloaded into the phone Wallet."}, {"username": "Kathy Card", "comment_text": "use omio app - in italy now and so easy . happy to answer any questions . app planned our trip and was perfect. does the whole trip tells you where to get off and get on for next connection."}, {"username": "Ky Bean", "comment_text": "I tried to navigate trenitalia but decided to give the big stuff to my travel agent. I wanted specific class an times so asked her to sort it. We will manage the little public transport stuff but for my own sanity an my PTSD husband..... it was far better to pay a little more for the assurance an peace of mind it is organised an we have paper copies on hand ✋️"}, {"username": "Rebecca Bridge", "comment_text": "Online or at the station"}, {"username": "Liv Weakley", "comment_text": "Omio app!!"}, {"username": "Linda Shepherd", "comment_text": "Flight Centre Australia booked all our train rides without any problems. On all the major train trips would recommend Business. Especially if you have big luggage, and you want to see your luggage and keep it in your eye sight. We didn’t have a any problems."}, {"username": "Rosalinde Tullio", "comment_text": "Just book direct through the Trenitalia website"}, {"username": "Michelle Desira", "comment_text": "We used italotreno - we purchased over there though through their app up to the day before or day of we needed. I found italotreno to be the cheapest prices."}, {"username": "Charlotte Vickers", "comment_text": "Australian and travelled to Italy last year. Used Italo, easy to use and book and the trains were great. Highly recommend."}, {"username": "Kirralee Thompson", "comment_text": "Omio!"}, {"username": "Jymie Sam Totiel", "comment_text": "Mark Totiel"}, {"username": "Kris Carr", "comment_text": "Used the Trainline app. Just wondering if we need to print tix or just scan barcode on phone??"}, {"username": "Carolyn Liddiard", "comment_text": "I used Trainline app"}, {"username": "Miyuki Kanno Paul", "comment_text": "Use Trenitalia’s official website"}, {"username": "Maria O'Callaghan", "comment_text": "I use Trainline. It shows the price in $AU.\nIt’s easy to use and you see both Trenitalia & Italo trains. We always book 1st class, more comfortable & more room. If you book early ( 2 months before) it’s much cheaper.\nLook up Seat 61 Italian trains, you will get a good understanding of the train system.\nEnjoy 🇦🇺"}, {"username": "Lauren Anne Heckenberg", "comment_text": "I booked on the website."}, {"username": "Bellafab Fabrizio", "comment_text": "Definatley prebook it gets confusing at the train station and its busy and staff are unwilling to help.\n\nAlso get the get your guide app. You will get great deals"}, {"username": "Debbie Ellwood", "comment_text": "I try and book all expected/\nplanned trips with my travel agent.\nAnd then local trips with the little local shops.\nKnowing some Italian is an advantage."}, {"username": "Luisa Macheda", "comment_text": "Yes the app is called Trenìt! I downloaded and used it from Australia. But there is also Omio which I also used"}, {"username": "Matt Johns", "comment_text": "Verity Johns"}, {"username": "Debbie Ellwood", "comment_text": "I like a stress free holiday. I usually book flights, a pickup driver ( when jet-lagged )and sometimes the first couple of nights accommodation)p\nlanned train travel and any skip the line tours with my travel agent.\nI book all the rest of the accommodation and local train travel myself. & find my own insurance.\n\nOnce Flying back from bari to rome booked 6 air tickets online in italy with an Italian airline, and they had a cliche in their system, but took the money. Forced me to rebook, and refunded 3 weeks later. But not what you need at the end of a holiday when you have spent what you have."}, {"username": "Cynthia Leitinger", "comment_text": "Rail Ninja"}, {"username": "Penny Hogan", "comment_text": "Rome2Rio app to see all available options from A to B and then book direct with whichever carrier is cheapest/\nfastest/best time etc"}, {"username": "Tracey Purdy", "comment_text": "I booked all mine through www.italiarail.\ncom\nRead this\n\nhttps://\nwww.seat61.com/\nindex-mobile.htm"}, {"username": "Lauren Van Bavel", "comment_text": "We're from Australia and we always use Trenitalia - never an issue"}, {"username": "Brittany Kendal", "comment_text": "Use this app it's amazing and so simple!"}, {"username": "Natalie Wohling", "comment_text": "I used omio when I got there. Very easy to use."}, {"username": "Frank Hunt", "comment_text": "Trainline App, but all apps are available on your phone."}, {"username": "Katrina Bianchi", "comment_text": "We only bought tickets a few days in advance when we were over there. We used trenitalia and Omio. It’s handy to have a couple of apps because sometimes one wouldn’t work and we would use the other. We went in August last year when it was crazy busy and never had a problem booking seats only a few days ahead. It gave us more flexibility."}, {"username": "Cindy Schutte", "comment_text": "I used Trainline app. Worked brilliantly."}, {"username": "Kylie Stefanile-guille", "comment_text": "There is an app called .Italo"}, {"username": "Steve Teresa Pitt", "comment_text": "Just spent 8 weeks travelling France, Spain, Malta, Italy- use Rome2Rio app for all our transport, great free app gives all transport options, prices, timetables, all tickets purchased through it"}, {"username": "Carole Faulks Lear", "comment_text": "I have used the \"trenit\" app from Australia no probs"}, {"username": "Rachel Bischoff", "comment_text": "I use Omio app"}, {"username": "Ruth Green", "comment_text": "Always use the Trainline app, very user friendly, never an issue."}, {"username": "Christel Maree", "comment_text": "I purchased Ítalo train tickets through their app easily!"}, {"username": "Lusiana Livolti", "comment_text": "Try the app Omio"}, {"username": "Claire Darcy", "comment_text": "Trainline app is the best way plus Omio"}, {"username": "Nicole Leggett", "comment_text": "Omio app"}, {"username": "Joanne Izenberg", "comment_text": "We used the Trenitalia website and the tickets were emailed to us and saved them on my phone. I mostly booked Italo trains"}, {"username": "Amanda Ash", "comment_text": "Booked them online as I travelled."}, {"username": "Dean Pecorari", "comment_text": "The app works for me from Melbourne"}, {"username": "Leesa Martin", "comment_text": "I’m from Australia and I am using Train (Trainline) it has been fantastic for our up coming trip in September"}, {"username": "Filomena Misuraca", "comment_text": "At train stations as needed. No hassles"}, {"username": "Viviana Arias", "comment_text": "Went last May from Australia and we used Italo trains (Milan, Florence & Rome). I booked on their app several weeks in advance. Easy and great value."}, {"username": "Richelle Trezise", "comment_text": "Tenitalia website or italo app or website the italo app can be downloaded. I hoping the trenitalia app can be downloaded when you arrive in italy"}, {"username": "Tracey Knight", "comment_text": "We always book through Trenitalia website. We created an account and can log in anywhere to access our bookings."}, {"username": "Alessio Esposito Inchiostro", "comment_text": "Trenitalia.com website"}, {"username": "Jeanne Eliason", "comment_text": "Depends on what trains you are taking. Regional trains have kiosks to purchase tickets like in Santa Maria Novella station in Florence. Many small stations also have the tobacco shops to purchase. If you want round trip tickets tell the person \"and return\". We travel by regional trains in Tuscany. There are many towns where the train station is in the town or very walkable. Of course these are paper tickets that need validating before getting on the train."}, {"username": "Debbie Hardy", "comment_text": "Just book through the website"}, {"username": "Debbie Hardy", "comment_text": "Just book through the website"}, {"username": "Sharon Hawkins", "comment_text": "I booked through railbookers a uk company and i am in aus"}, {"username": "Sneha Jay", "comment_text": "F"}, {"username": "Fiona Cameron", "comment_text": "Use the Trenitalia website, there’s an english option but you must use Italian place names… Roma, Firenze (Florence) Milano etc. simple and you can use PayPal to pay so you don’t have to give your card details.\nI must’ve made this comment in answer to this question a zillion times this week!! 😊😊"}, {"username": "Rose Stolarek", "comment_text": "Trainline app is available and is fantastic"}, {"username": "Amanda Ross", "comment_text": "I used Omio app and Trenitalia website, no problem with either"}, {"username": "Diana Morgan", "comment_text": "I thought everything was available on Google. You live and learn lol"}, {"username": "Kerryn Colds", "comment_text": "We used omnio too"}, {"username": "Marcus Hiesler", "comment_text": "We driving everywhere"}, {"username": "Trish Dooley Thorp", "comment_text": "I also used Trainline app it was easy to use and had no problems"}, {"username": "Diana Subkova", "comment_text": "You can also use Omio site or buy tickets from any train station."}, {"username": "Todd N Nicole Clarke", "comment_text": "I used the Trainline app, it was the best, prices were cheaper than the direct sites, could chose class and seats, we went business class which was great"}, {"username": "Noelene Cameron", "comment_text": "Trainline app is fabulous. Brings up multiple choices and prices. Book, pay and save ticket in the app.\n\nhttps://\nwww.thetrainline\n.com/\ninformation/apps"}, {"username": "Stella Cammarano", "comment_text": "Omnio is best"}, {"username": "Heather Stokes", "comment_text": "Rome to Rio app has worked well so far."}, {"username": "Annette Sparks", "comment_text": "Use the website. From Perth and found it really easy to use"}, {"username": "Erin Magee", "comment_text": "App not avail but the website is good"}, {"username": "Neville Spargo", "comment_text": "OMIO, works great and their support is great too."}, {"username": "Alison de Lisle", "comment_text": "Omio!"}, {"username": "Sue Cornish", "comment_text": "We waited until we arrived and purchased 1 week before travel on web site"}, {"username": "KayandMike O'Grady", "comment_text": "Hi , we are from UK recently travel in tuscany. Train system brilliant. Good ticket machine at station as long as you remember to validate your ticket on the station. Clean, comfortable and on time."}, {"username": "Gillian O'Callaghan", "comment_text": "Kiwi here...used Trainline before I left and while in Europe/UK. Booked 13 train trips in Italy with no issues."}, {"username": "Rip Lonergan", "comment_text": "Trenitalia ￼ is my go to app. It covers all modes of transportation."}, {"username": "Nancy Rogers Caradonna", "comment_text": "Trainline"}, {"username": "Janette David Payne", "comment_text": "We used Trainline and Rome to Rio… we’re in Australia."}, {"username": "Gillian Bissex", "comment_text": "I used Trainline app from Australia. Everything worked smoothly. Enjoy your trip!"}, {"username": "Sam Mah", "comment_text": "You can register online with them (Trenitalia) and buy via the online site."}, {"username": "Michelle Smith", "comment_text": "We booked with Trenitalia prior to travel from Australia"}, {"username": "Ange Cimino", "comment_text": "Trainline App."}, {"username": "Donna Sims", "comment_text": "I tried many and found ItaliaRail website to be the easiest to navigate and understand, booked all our train travel with ItaliaRail."}, {"username": "Rhiannah Flynn", "comment_text": "I used omio"}, {"username": "Alice Byrne", "comment_text": "I used the tranitalia website back home"}, {"username": "Lisa Boyes Cooper", "comment_text": "I used Omio and found it easy to use. Didn’t have a problem with any trains 🚂"}, {"username": "Voula Ladas", "comment_text": "Use the website and save it to your desktop . Once you’re in Italy you can download the Trenitalia App. Just can’t do it while in Australia . Also BEFORE you purchase your tickets, register with Trenitalia. Hopefully that will mean once you are in Italy ,the tickets you’ve purchased will show in the App."}, {"username": "Julie Salathiel", "comment_text": "I have booked mine through the trenitalia website, used Rome to rio app as a guide. Website very easy to use."}, {"username": "Maria Andreou", "comment_text": "I’m here right now I used a mix of Italia Rail and the Omio app. Enjoy your trip!"}, {"username": "Rachel McCahon", "comment_text": "Is there any difference in price using either trenitalia website/ Omio app/ trenit/ Trainline ?"}, {"username": "Lara Anderson", "comment_text": "Used Omio multiple times for many trips to Italy, never had an issue"}, {"username": "Debbie Panizza", "comment_text": "So much better to book when you get there. It’s as easy as in Australia as it is there. Just do it at the station, or use the app trainline. Just remember trains in Italy quite often don’t run on time so don’t get stuck like we did and didn’t get the connecting train. Had to pay again because different company’s. Enjoy"}, {"username": "Kathy Whiting", "comment_text": "Online on Trainline or Italo and if in Italy unless u know train will be crowded purchase at train station less expensive."}, {"username": "Amelia Bonannella", "comment_text": "Use the Trenitalia website, in English. Works perfectly fine 😊"}, {"username": "Catherine Toms Bengough", "comment_text": "We used the “the man in seat 61”, he has detailed explanations and all the links. Worked perfectly."}, {"username": "Fiona Mac", "comment_text": "Try omio app"}, {"username": "Ian Fawkner", "comment_text": "Omio works a treat !"}, {"username": "Georgia Taylor", "comment_text": "Don’t forget to look at Italo also it tends to be cheaper if it’s available (mainly between the big cities)"}, {"username": "Serena Mascheretti", "comment_text": "There is the website"}, {"username": "Bernadette Johnstone", "comment_text": "Train line"}, {"username": "Julie Norris", "comment_text": "Trenitalia website 😃"}, {"username": "Regan Verwey", "comment_text": "I’ve used the website and Omio app."}, {"username": "Russ Whitley", "comment_text": "Go to the TrenItalia web page. Not sure VC why app not available, probably because it’s in Italian. There’s also an Aus web page italiatren.com. I’ve never used it but it says it’s a booking agency in Australia for Italy trains. Be cautious though."}, {"username": "Irene James", "comment_text": "Book it on line."}, {"username": "Yulichka Crowther", "comment_text": "It works in Australia...I don't know about app but website is working"}, {"username": "Yulichka Crowther", "comment_text": "https://\nwww.trenitalia.c\nom/it.html"}, {"username": "Louise Gotch", "comment_text": "Trainline. Worked perfectly."}]}, {"id": "2207157133016698", "text": "I'm a female travelling from Naples Airport to Sorrento alone. How easy is it navigate Naples Airport? I'm thinking of getting a bus/coach from the airport. Looking for easiest & hassle free option. I've a dreadful sense of direction!! Any advice/recommendations would be much appreciated. Thank you in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2207157133016698/", "likes": 0, "comments": []}, {"id": "2207177039681374", "text": "Hello! What company did you use for Hop on hop off bus in Rome and do you have to book the tickets in advance? Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2207177039681374/", "likes": 1, "comments": [{"username": "Mary White", "comment_text": "I book through Viator, and look at current reviews to decide"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nBig-Bus-Rome-Hop\n-on-Hop-off-Tou\nr/\nd511-39333ROMEHO\nHO?pid=P0007058\n7&mcid=42383&me\ndium=link&mediu\nm_version=selec\ntor"}]}, {"id": "2207182266347518", "text": "Has anyone flown TAP Portugal to Italy? If so, how was your experience?", "link": "facebook.com/groups/1373361046396315/permalink/2207182266347518/", "likes": 0, "comments": []}, {"id": "2207182419680836", "text": "Hello everyone!\nWhat’s the weather like in Florence?\nI’m coming next week.\nMany thanks to those who respond.", "link": "facebook.com/groups/1373361046396315/permalink/2207182419680836/", "likes": 2, "comments": [{"username": "Christine Malota- Kendall", "comment_text": "Check the weather app and search for Florence Italy."}, {"username": "Mike Laudick", "comment_text": "You can easily look at a weather forecast, can’t you?"}, {"username": "Stacey Cohen Sturner", "comment_text": "Definitely track the weather leading up to your trip. The forecast has been spot on for us. When checking a week or so ago, it predicted showers for today and there were. So glad I knew to pack a rain jacket."}]}, {"id": "2207184459680632", "text": "Hi we are travelling around Italy next year. Just wondering if most restaurants have Gluten free mains and dessert options. Thanks fellow travelers.", "link": "facebook.com/groups/1373361046396315/permalink/2207184459680632/", "likes": 2, "comments": [{"username": "Sheila D'Anna", "comment_text": "Your prima piatti options will have pasta options typically so on the menu look at the secondi piatti for meat and seafood options. You can’t beat the gelato for desserts."}, {"username": "Elena Eugeni", "comment_text": "In many restaurant you can ask for gluten free pasta. Not many can actually guarantee to avoid gluten contamination, you will have to look for a certified place"}, {"username": "Vicki Musiello", "comment_text": "I recently spent a month there and many restaurants have gf pasta, and quite often pizza bases too. (I’m not coeliac, very wheat intolerant). I eat no meat products at all, just a little white fish & prawns & had no problems there either. There are loads of veggies and salads on offer and delicious roast potatoes everywhere. Desserts? Panna cotta, most semi freddo, lots of yummy crème brûlée type desserts and gelato gelato gelato!!!"}, {"username": "Karyn Sternberger Sikorski", "comment_text": "Join the Gluten Free Italy FB page. Download the Find Me Gluten Free app. There are dedicated gf free restaurants in the larger cities and gf options in many restaurants. Many hotels provide gf options for breakfast if you ask them. Much better than availability at home"}]}, {"id": "2207187606346984", "text": "Hiiiii we will be visiting Milan Lake Como then Lucerne Switzerland Can anybody tell what is the best and budget friendly way to reach Vienna Austria 🇦🇹 as our return flight will be from there\nIs lucerne to\nZurich then zurich to Vienna by bus is good option\nAny help is appreciated", "link": "facebook.com/groups/1373361046396315/permalink/2207187606346984/", "likes": 0, "comments": []}, {"id": "2207195489679529", "text": "I’m traveling from Venice to Rome in September. Fast trains seem to still take about 4 hours and €140. A flight takes a little over an hour and €50. Has anyone take a flight rather than the train? Is there a benefit from taking the train? I do understand that the flight will include some time waiting to board but what does that add 2 hours?", "link": "facebook.com/groups/1373361046396315/permalink/2207195489679529/", "likes": 6, "comments": [{"username": "Pietro Adami", "comment_text": "Early check-in, travel (taxi?) to and from the airport ..not worth, in my opinion"}, {"username": "Gregory Smith", "comment_text": "More space on the train, ability to walk around as needed. Going from city center to city center alone saves you the airport travel times. No security checkpoint. No weather or ATC delays. No luggage pickup delays if you check bags. Add the cost of traveling from FCO into City of Rome and Venice to the airport."}, {"username": "Anna O'Connor", "comment_text": "The train will be quicker than flying when you factor getting to and from airports."}, {"username": "Karen Blackmore", "comment_text": "Lovely countryside to watch from the train!"}, {"username": "Joe Gelardi", "comment_text": "TRAIN PERIOD. Much less complicated and beautiful scenery"}, {"username": "Debra Hayman", "comment_text": "Where are you getting those prices from?\nI checked a random date in September and price with the train on the Trenitalia site is between €21 and €49."}, {"username": "Tracy Piko Lawniczak", "comment_text": "We did that exact route and went train. Just very very relaxing. Not having to worry about what time to get to airport, and going thru security checking bags etc. TRAIN 100%"}, {"username": "Deanne Tetrault", "comment_text": "The flights are never as cheap as that with luggage etc but faster wins with me"}, {"username": "Karen Smart", "comment_text": "The airports are outside of these cities so you would also have cost and travel time getting from the airport into town. 20-30 minutes to Venice airport (depending on hotel location) and 30 minutes getting into Rome. The train stations are right in the city."}, {"username": "Vanessa Durkin", "comment_text": "Try omio or tenitalua for cheaper tickets"}, {"username": "Lee Rew", "comment_text": "I flew Rome to Venice and then took the train back to Rome. I flew there because I had just landed in Italy and my first destination to stay was Venice."}, {"username": "Charleen Siegler Schuss", "comment_text": "The train stops on the Grand Canel. The airport involves travel to get to the Grand Canel."}, {"username": "Melissa Ciske", "comment_text": "I did Verona to Naples and would take a train next time. Between the amount of time getting through the airport, baggage costs and restrictions and flight delays - we could have enjoyed a nice relaxing ride and would have ended up getting there at the same time"}, {"username": "Chiara Codecá", "comment_text": "The train has one major advantage, it takes directly into the city centre both in Venice (Santa Lucia Station) and in Rome (Termini Station). Plus, in the nord-east the landscape is lovely."}, {"username": "Casarine Temple", "comment_text": "I would definitely go with the trains . We’re taking trains from Rome to Florence to Venice in September."}, {"username": "Blanca Gil", "comment_text": "Trains get you to the city center, planes do not. It will only add extra stress and hassle on your trip."}, {"username": "Mandy Pusateri", "comment_text": "We are doing the same thing but in the opposite direction. We are going from Rome to Venice so I'm so glad I came across this post. I do have a question, and that is should we buy our tickets ahead of time or wait until the day of?"}, {"username": "Mike Guluk", "comment_text": "Train leaves from center of Venice arrives Centre of Rome plane leaves outside of Venice takes 1 hr to get there and add at least 1 1/2 hrs before flight.if carry only you arrive in Rome 45minutes from city. If baggage add at least 1/2 hr total time same same but train way more relaxing"}, {"username": "Graham Sherlock", "comment_text": "Train quicker, more comfortable, better scenery, not cramped, no waiting for luggage to arrive, drops you in central spot."}, {"username": "Shirley Lewis", "comment_text": "If that flight is on a low-cost airline, you will also pay for your seat for your carry-on and your checked baggage"}, {"username": "Gregory Smith", "comment_text": "The only reason to take that flight is to connect to an outbound in FCO."}, {"username": "Tracey Fairbrother", "comment_text": "Train is more scenic and no restrictions on liquids etc"}, {"username": "Jade Stringer Alkire Wisecup", "comment_text": "We looked at both, baggage cost suck on the plane, doubled almost tripled the price."}, {"username": "Toby Levy", "comment_text": "Have to pay for luggage on flights but not on trains. Way easier, just did it"}, {"username": "Robin Burrell", "comment_text": "Well, that’s the price of an upper class train seat vs an economy plane seat. Also take into account travel time to airport and waiting for plane, then train into the town of arrival by plane. Add 2 to 3 hrs onto that plane trip and its even. Except train travel is much much more pleasant"}]}, {"id": "2207195039679574", "text": "Can anyone recommend 2 bedroom accomodation on Travestre side of Pantheon that is not Air BnB please.", "link": "facebook.com/groups/1373361046396315/permalink/2207195039679574/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.kqzyfj.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FVacationRen\ntalReview-g1877\n93-d11391789-Hi\nstorical_Center\n_of_Rome_Traste\nvere_Piazza_Nav\nona_Bright_Conf\nort_AC_WiFi-Vat\nican_Cit.html"}]}, {"id": "2207195996346145", "text": "Going to Naples in a couple of weeks , just looking for reasonable places to eat and drink , have heard it’s really expensive even for coffee etc , also love shopping ( not designer) any recommendations would be gratefully received, Thank you 🇮🇹🍕☕️🛍️", "link": "facebook.com/groups/1373361046396315/permalink/2207195996346145/", "likes": 0, "comments": []}, {"id": "2207200893012322", "text": "Hi all! We have had to reconsider our taking the train from Florence to Rome the DAY OF our flight, so we will likely do this the day before now, If we train from Florence to Rome, is there a town worthy to stop and tour on our way (I was thinking Orvieto) and does anyone know if there are places to store our luggage?", "link": "facebook.com/groups/1373361046396315/permalink/2207200893012322/", "likes": 0, "comments": [{"username": "Graham Sherlock", "comment_text": "Orvieto is great, not sure if they have luggage storage though, are you able to stay there a night and travel on to Rome the next day. You would need to be on an afternoon flight out of Rome to do this."}, {"username": "Greg Saba", "comment_text": "There is a private luggage storage connected to a local business near the Orvieto train station. I would confirm by email to the proprietor: orvieto@bon-ita\nly.it Then you simply take the funicular up to the city."}]}, {"id": "2207203596345385", "text": "Recommendations please for Florence:\nLooking for the best area to stay in Florence - close to restaurants, bars & shops.\nAny hotel recommendations are also appreciated (preferably under 250euro per night).\nThank you.", "link": "facebook.com/groups/1373361046396315/permalink/2207203596345385/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.anrdoezrs.ne\nt/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187895-d3253\n170-Reviews-Rel\nais_La_Corte_di\n_Cloris-Florenc\ne_Tuscany.html"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2207213426344402", "text": "We are flying out of Naples at 6am. Where would you stay the night before? Is Transportation that early a problem?", "link": "facebook.com/groups/1373361046396315/permalink/2207213426344402/", "likes": 0, "comments": []}, {"id": "2207214443010967", "text": "Trenitalia Regional train ticket change. Please note that from today the electronic tickets for regional trains require the traveller to \"check in\" before you board the train. It's the equivalent of validating a paper ticket. It's a button that appears once your payment has gone though. I was unaware (I did see the button but knew nothing aboutआणखी this new rule) and got caught by the conductor. Luckily he was able to check me in from his device today and I avoided a fine, but he was unsure if this would be possible in the future as he was still learning the new system himself. He said it's now compulsory to check in before travelling.", "link": "facebook.com/groups/1373361046396315/permalink/2207214443010967/", "likes": 125, "comments": [{"username": "Sheyla Enrich", "comment_text": "I have tickets for September. So, it works now as airline tickets that you need to check in on the app?"}, {"username": "Grace Sanchez", "comment_text": "It is on the email after you’ve booked the ticket. But when are you allowed to check in?My trip is in 2 weeks..how far in advance are we able to check in?"}, {"username": "Colleen Jennings", "comment_text": "Thanks so much for this useful information. 🙏"}, {"username": "Mel Matt", "comment_text": "When I purchased my ticket online I got the following notice\n\nTicket type: E-ticket\n\nFor High-Speed trains, show the conductor the PNR code found above.\nShow the conductor your ticket(s) on your personal electronic device (PC, tablet, smartphone), or as a printed version of the PDF\nThese tickets are already validated (no need to validate at the platform validation machines)\nFailure to show the ticket(s) to your conductor could result in fines"}, {"username": "Mega Mashkor", "comment_text": "I use TrainItalia for travel most times since i live here, and bought tickets directly from the app. Usually I check_in myself from the app, its very simple. Usually the option will appear for check in when the train depart. All you have to do is just click on the check in button on the app. 😊"}, {"username": "Silvia Aha", "comment_text": "This is what the regional train ticket looks like with the check in button, easy. I just didn't know and boarded the train without even looking at the ticket assuming I didn't need to do anything after the purchase"}, {"username": "Moira Owens", "comment_text": "Phrage Frenta"}, {"username": "Gayle Moores", "comment_text": "Thanks for this info as we do take many regional trains when travelling to Italy and book ahead."}, {"username": "Sophie L", "comment_text": "I have 2 questions:\n\n- what about regional trains reserved via trainline or omios? how to check in?\n\n- if several tickets are purchased together, is there only one check-in to be done?\n\nthank you for sharing the information"}, {"username": "Kiralee Philpot Phillips", "comment_text": "Tania Guest Hall"}, {"username": "Deb Harnett", "comment_text": "Yes I have regional trains booked through Omio as well how do you validate them"}, {"username": "Margaret Clark", "comment_text": "Rachel Clark"}, {"username": "Cathy Saultzman", "comment_text": "Donna Clemons Curry\nNeed to figure this out."}, {"username": "Kaye Old", "comment_text": "Anita Hamilton"}, {"username": "Rachel Wright", "comment_text": "How do I download the app? We are in Italy, but its still telling me the app is unavailable in my country 🤷🏼‍♀️"}, {"username": "Rebecca Loughron", "comment_text": "Bernie Loughron"}, {"username": "Vickie Marino", "comment_text": "Gayle Keen : what are the chances of either of us remembering this? 🤔 😄"}, {"username": "Fiona Cameron", "comment_text": "Thank you! I presumed I had to scan the QR code somewhere!!! I will add this to my notes with tickets. 😊😊"}, {"username": "Michelle Lynch", "comment_text": "Sue Weir"}, {"username": "Cathy Heikkinen Vogt", "comment_text": "Stuart Vogt"}, {"username": "Vicky Alger Skillman", "comment_text": "Thank you for sharing!"}, {"username": "Lucia Stefakova", "comment_text": "Isnt it better than to purchase tickets directly at the train station to avoid all the fuss?"}, {"username": "Lloyd Mulligan", "comment_text": "I got fined today....70€ and only one stop away from my destination. I had a conductor who just would not listen to me. He actually called the police when I questioned him. Is there a way to appeal the fine? (As useless as it may be)"}, {"username": "Tiffany Boland", "comment_text": "Kate George Ellie Hearfield Dannielle Boland Ebony Boland Imijin Boland"}, {"username": "Nancy Sunshine", "comment_text": "My ticket instructions said this ticket does not need to be validated"}, {"username": "Ashley Reneé Harris", "comment_text": "I bought my train ticket a couple of weeks ago and did not get a confirmation button. Since this is a new rule....don't know what to do. The check in button doesn't show up in my email either. We are going on a regional train."}, {"username": "Matilde Russo", "comment_text": "Anneliese Breen"}, {"username": "Renel Vermaak", "comment_text": "Is there a cruise that can go around Italy"}, {"username": "Eileen Reynolds", "comment_text": "Thank you😊"}, {"username": "Angela Jorgenson", "comment_text": "Do you know - If I purchased a regional ticket for 4 adults, and I check-in with the app - does it check us all in (- all 4 of us)? Or do each of us need the app?"}, {"username": "Lorraine Swick Sanfilippo", "comment_text": "Everywhere seems to think everyone is electronically savvy. I was just in London snd would have been lost without my daughter"}, {"username": "Michelle Plutto", "comment_text": "Is there an app?"}, {"username": "Tish Hartigan", "comment_text": "Darn. Thought that was going to be one less thing to worry about by purchasing online. 🙁 Thanks for letting us know!"}, {"username": "Kay Jenkins", "comment_text": "thank you for this info"}, {"username": "Diane Davis Lawyer", "comment_text": "Regional being the slower trains?"}, {"username": "Jaime Cleek", "comment_text": "I haven't seen any button on our trains after I purchased them but I'll definitely be sure to check em"}, {"username": "Molly Graban", "comment_text": "Dylan Graban"}, {"username": "Laura Uribe", "comment_text": "Thank you so much for sharing!"}, {"username": "Brenda Carter Lancaster", "comment_text": "April Shields Williams Lacey Lancaster"}, {"username": "Alice Byrne", "comment_text": "I tried to do it the other day when I got the email telling me to check in and it wouldn’t let me. I thankfully didn’t have any issues but good to know for future reference"}, {"username": "Donna Holt", "comment_text": "Oh good to know. We have tickets for late-Sept."}, {"username": "Victoria Russo", "comment_text": "Thx for sharing"}, {"username": "Stacy Dellasega", "comment_text": "My travel agent sent me tickets with a bar code and said nothing more would be needed. Has that now changed? If so do I need the app to check in??"}, {"username": "Emma Olsen", "comment_text": "All conductors have this machine on them and when they see that we are tourists they dont give any fine. I have travelled Verona-Milano-V\nenice in december and now Verona-Bologna-\nCesenatico-Bolo\ngna without doing it without problem. They didnt Even check my ticket today from Cesenatico to Bologna. Just so so so much people on the train now because the italians are on holiday now too."}, {"username": "Teresa Grasso", "comment_text": "Thank you so much for posting this. I literally just purchased a ticket for tomorrow and was not aware of new check-in procedure."}, {"username": "Kathleen Roll", "comment_text": "Good to know about the change - thanks"}, {"username": "Erica Styan", "comment_text": "Thank you"}, {"username": "Chris N Lynn", "comment_text": "I would think still if purchasing through the Trenitalia app the tickets are automatically validated like it says their fast trains do. I’m wondering if this is a new way for them to ensure third party apps (TrainLine, Omio, etc) require validation like their app does automatically."}, {"username": "Andi B. O'Connor", "comment_text": "Myles O'Connor"}, {"username": "Kate Brennan", "comment_text": "Alexandra Brennan"}]}, {"id": "2207217529677325", "text": "Our trip will include Rome, Venice, and amalfi coast. Is there anywhere an hour train ride away from Rome that’s worth going to to give a different perspective of Italy? Something less touristy.", "link": "facebook.com/groups/1373361046396315/permalink/2207217529677325/", "likes": 2, "comments": [{"username": "Rita Levi Montalbano", "comment_text": "Maybe assisi, the san francesco basilica is beautiful but i think its more likely 2 hr.\nI was going to suggest u naples but its not so different from the costiera amalfitana.\nNear l'Aquila there are some very good natural parks that you can visit if you think you will miss some nature during your staying"}, {"username": "Shane McClain", "comment_text": "If you can do Bologna it’s awesome and food is amazing"}, {"username": "Jenny Payne", "comment_text": "Orvieto or Tivoli both lovely , check to see if they close on Saturday at lunch time 🌻"}, {"username": "Lynne Pompetti", "comment_text": "Google or a travel agent know..."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Not far from Naples is the town of Caserta. There is a beautiful palace and gardens there."}, {"username": "Chiara Codecá", "comment_text": "Then northern part of Lazio, very close to Rome by train, is underappreciate\nd and still awaiting to be discovered by tourists. It's a landscape of hills, small and cozy villages and beautiful, ancient villas and historical gardens - I'm thinking of Villa Lante in Bagbaia, near Vitervo. Check it out online, see what you think."}, {"username": "Fetchin Gretchen", "comment_text": "Here are a few places less than an hour train ride from Rome that you can visit for a different perspective of Italy:\n\n* **Tivoli:** This town is home to two UNESCO World Heritage sites, Villa d'Este and Villa Adriana. Villa d'Este is known for its beautiful gardens and fountains, while Villa Adriana is an impressive Roman archaeological complex.\n\n* **Orvieto:** This hilltop town is known for its stunning views, medieval architecture, and delicious wine. Be sure to visit the Orvieto Cathedral, which is one of the most beautiful cathedrals in Italy.\n\n* **Viterbo:** This town is the capital of the Lazio region and is home to a number of historical sites, including the Piazza del Campo, the Rocca Albornoziana, and the Cathedral of San Lorenzo.\n\n* **Anzio:** This seaside town is located on the coast of the Tyrrhenian Sea. It's a popular destination for swimming, sunbathing, and seafood restaurants.\n\n* **Ostia Antica:** This ancient Roman city is located just a few kilometers from Rome. It's a fascinating place to visit to learn about Roman history and culture.\n\nThese are just a few suggestions, but there are many other great places to visit within an hour train ride of Rome. If you're looking for something less touristy, I would recommend Tivoli, Orvieto, or Viterbo. They all offer a unique perspective of Italy and are sure to leave you wanting more."}, {"username": "Deb Porter", "comment_text": "Anguillara Sabazia, it’s the town on Lake Bracciano where Everybody Loves Raymond shot their episodes in Italy. Very charming"}, {"username": "Glenn Todd Webb", "comment_text": "Tivoli or Orvieto"}, {"username": "Sylvie Hogg Murphy", "comment_text": "Orvieto - so easy to get there from Rome, and it will round out your Italian itinerary beautifully. Umbrian hill town perched atop a spur of tufa, stunning cathedral, cozy trattorias with hearty food, also ceramics shops with hand painted plates and pitchers etc. Just lovely!"}, {"username": "Debbie Milne Jenkins", "comment_text": "Ostia antica is probably less than an hour away, not far from the airport - a site with ruins that if I’m not mistaken has a site of ruins larger and older than Pompeii. Tivoli is also very nice and close to Rome. Enjoy your trip."}]}, {"id": "2207222656343479", "text": "First time visitors to Sorrento - any tips, places to eat, things to do?", "link": "facebook.com/groups/1373361046396315/permalink/2207222656343479/", "likes": 7, "comments": [{"username": "Dave Fowell", "comment_text": "It's expensive there but very nice. Use the train to go to Pompei and Herculaneum rather than pay for an expensive private trip."}, {"username": "Clare Boxer", "comment_text": "If you like Art.. the Exhibition of Andy Warhol at Villa Fiorentino (which is on Main Street in Sorrento). It was brilliant!"}, {"username": "Philip Curnow", "comment_text": "Make an effort to get waterside and go for a boat trip along the coast. Evenings, mingle and walk where you fancy you."}, {"username": "Wahab Sidharta", "comment_text": "From Marina Piccolo, Sorrento you can get around Amalfi, Positano and Capri by Ferry"}, {"username": "Jeff Gentner EA", "comment_text": "Donna Sofia restaurant"}, {"username": "Jeff Gentner EA", "comment_text": "DiGugino restaurant"}, {"username": "Janice Pesavento", "comment_text": "Oparrachiano ristorante"}, {"username": "Sarah Luisa Hughes", "comment_text": "Enjoy the Little Things Bistrot. Always a queue but worth the wait. It's in the lemon streets. Its our favourite in Sorrento, family run, good food and inexpensive.\nYou can get the ferry to Amalfi, Positano, Capri. We did Amalfi and Positano in 1 day. We used ferry hopper ➡️ Sorrento- Positano - Amalfi -Sorrento.\nYou can easily get the train to Pompei, Herculaneum, and Naples.\nSorrento is a great base, so much to see and do 👍"}, {"username": "Meghan Schatt", "comment_text": "Our favorite gelateria is Raki"}, {"username": "David Henry", "comment_text": "Great kebabs 😋"}, {"username": "Cyndee Ger", "comment_text": "Sorry I can’t remember the name of who we used😩\nWe did a cooking class at someone home outside w beautiful views. Drank wine met other tourist. Great evening❤️"}, {"username": "Leanne Bingle", "comment_text": "Elizabeth Colleen Fowler"}, {"username": "Enrico Lecce", "comment_text": "Every where in sorrento is beautiful... enjoy ... the moment."}, {"username": "Enrico Lecce", "comment_text": "Enrico Lecce"}, {"username": "Chelsea Gudith", "comment_text": "Lounge Bar Tasso… BEST food we had in Italy.\n\nBougainvillea for gelato- Parfumo Di Sorrento & Lemoncello 💯💯💯\n\nSpend the day at a beach club, we enjoyed Leonellis"}, {"username": "Anna Stuckey Wheeler", "comment_text": "Are you familiar with Rick Steves? If you are looking for an American perspective with travel tips, he is a good place to start. I’d also suggest a Google search and research sources ending with .it. There are translation options. Many tips given here are tourists trips from people who have been once or twice. It’s great when people who actually live there share ideas. The town of Sorriento also has government/\ntourism websites and again, look for some ending with .it."}, {"username": "Paul Ryley", "comment_text": "L’ Antica Ristorante! Best meal I had in all of Italy! Fantastic place! Will not be disappointed!"}, {"username": "Paul Milestone", "comment_text": "Amalfi coast tour is a must. Ravello, amalfi and positano are stunning. Church in amalfi is a must see"}, {"username": "Maria Marra", "comment_text": "Go to Vasame pizzeria. Amazing food and service"}, {"username": "Karen Smart", "comment_text": "Pizzeria De Franco had great pizza!"}, {"username": "Sandra Borducci", "comment_text": "Boat to Capri!"}, {"username": "Lori Iadevaia Francisco", "comment_text": "https://\nwww.sirenuse.it/\nen/\n?mibextid=Zxz2cZ"}, {"username": "Suzanne Mills", "comment_text": "Ask the locals for recommendations"}]}, {"id": "2207219893010422", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2207219893010422/", "likes": 5, "comments": []}, {"id": "2206726139726464", "text": "Hello! I am considering traveling from Milan to Venice to Florence to Milan by train. Are trains reliable? Any tips/suggestions/advice? thanks", "link": "facebook.com/groups/1373361046396315/permalink/2206726139726464/", "likes": 4, "comments": [{"username": "Colleen Dawson", "comment_text": "The website Seat61 is a great resource for train travel in Italy."}, {"username": "Karen Schmidt", "comment_text": "Yup…super easy too! High speed train available for all those locations"}, {"username": "Ibbu Mohd", "comment_text": "Go with Italo-trains. Private owned n less to no chance of strikes"}, {"username": "Bruno Bucciarati", "comment_text": "Yes, trains are reliable, I suggest you to take the Frecciarossa trains (high speed ones).\n\nThings to note: usually the central stations in Italy called “centrale” or “c.le”. For example Milano Centrale. This downs apply in Venice (main station is Venezia Santa Lucia) and Florence (main station is Firenze Santa Maria novella).\n\nI also suggest you to download the Trenitalia app"}, {"username": "Sara Butcher", "comment_text": "Excellent train system. I travelled Milan - Venice - Milan then a Varenna - Cinque Terre, booked first class tickets. Very comfortable, fast trains. ❤️🇮🇹🇦🇺"}, {"username": "Carolina Lamb", "comment_text": "Train traveling in Italy 🇮🇹 is very convenient! Trains are really nice and comfortable.\nWe just returned from Italy and we took the train frequently! We actually did your route Milan to Venice and then to Florence and so forth from there on."}, {"username": "Sharet Mendez", "comment_text": "I used the app \"Trainline\" and for me worked great."}, {"username": "Karen Dwyer", "comment_text": "We did the same routes in June- all booked on trentalia app"}, {"username": "Julie Strauss", "comment_text": "Lex Strauss"}, {"username": "Gayle Moores", "comment_text": "You can book all your trains you are taking online ahead of time. If you book them online you do not have to validate the tickets at the station. Just keep your copies of your tickets ready to show the conductor if they should ask!Rome2Rio is a good website to check schedules."}, {"username": "Anna Sanday", "comment_text": "We are in Italy now. We travelled from Pisa to Rome and from Rome to Naples. Super easy & relatively cheap. The views were beautiful along the way. Booked on the train line app. We’re getting the train to Sorrento today"}]}, {"id": "2206735113058900", "text": "With Severina Carro Simbulan and Helen Francisco Carro", "link": "facebook.com/groups/1373361046396315/permalink/2206735113058900/", "likes": 36, "comments": [{"username": "Helen Francisco Carro", "comment_text": "💕🙏💕"}, {"username": "Marie Cuzzi", "comment_text": "Such a gorgeous Cathedral inside and out ! One of my favorites ♥️♥️"}, {"username": "معمر الهلول", "comment_text": "معمر الهلول"}, {"username": "Angie Hill", "comment_text": "Beauty♥️♥️"}]}, {"id": "2206739129725165", "text": "My family of 4 will be in Rome for 5 days. I’m considering not booking anything until we get there. (We booked the hotel)\nIs that a terrible idea? Can we wing it? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2206739129725165/", "likes": 2, "comments": [{"username": "Loreta Berti", "comment_text": "Best to book tours and favourite recommended restaurants as they do book out."}, {"username": "Sande Ricci", "comment_text": "I would not wing it!"}, {"username": "Katie Marie", "comment_text": "Don’t book anything the day you travel in. My flight got delayed so I missed a tour and i wasn’t able to see the colosseum. Also, you can book tours and choose “Roma pass” (two tours) BUT do NOT buy it yet. I got to Rome and spent an hour trying to find which info station to pick it up at with no luck. So that was $100 down the drain. (You can book in advance then get to Rome and purchase the Roma pass which is incredibly helpful to get around)"}, {"username": "Carla Johnson", "comment_text": "I think winging it is a good idea, that's what we'll be doing. I'm on a time schedule everyday but I'll be danged if I'll be on one on my first vacation in 3 years."}, {"username": "Carolina Lamb", "comment_text": "I just returned from Rome, you can book the Vatican and the Colosseum thru tour guide websites day of. I highly suggest when you do book , book skip the line tours!! No waiting on long lines you get right in!"}, {"username": "Allison Mir", "comment_text": "You might find you spend a lot of your holiday waiting in queues"}, {"username": "Matt Henderson", "comment_text": "We booked tours with Get Your Guide and it was easy to change dates."}, {"username": "Tari Lawson", "comment_text": "There are certain things I would pre-book and then wing it fir others."}, {"username": "Wendy Valdes", "comment_text": "You will be possibly taking the trip of a lifetime. Why in the world would you want to “wing it” and miss out on the beauty and history that this country is so rightfully known so for.\n\nJust asking."}, {"username": "Shannon Goff Flanagan", "comment_text": "Half and half! Book your must do. Wing the rest!"}, {"username": "Elizabeth Hartzell", "comment_text": "My 2 cents. We will be in Rome in a month and after joining this group decided to book our tours of the Vatican and the Colosseum. There wasn’t a ton available. Ended up booking an 8am tour of the Vatican the day after we land (because that’s the only thing they had available in English during our available dates) and a night tour of the colosseum in Italian also because that’s what was available. I’m super happy I was able to get my preferred times but it would have been nice to have more options. I wish I would have booked further in advance but I’m planning the entire trip last minute. I do think it’s smart to allow a fair amount of free time too! 😉"}, {"username": "Kate Laidlaw", "comment_text": "We booked Vatican and Colesseum early morning tours and then had the afternoons/\nnights free. Perfect mix. But if you don’t pre book those big attractions, you’ll miss out."}, {"username": "χριστινα χατζηγεωργιου", "comment_text": "Κλείστε οπωσδήποτε εισιτήρια για το Βατικανό Μόλις επέστρεψα από Ρώμη κ σας εγγυώμαι ότι αν δεν έχετε εισιτήρια θα το μετανιώσετε Οι ουρές είναι τεράστιες Για το Κολοσσαιο η ουρά έχει ροή αλλά η αναμονή φτάνει τη μία ώρα αλλά εκεί τα παιδιά μπαίνουν δωρεάν"}, {"username": "Melanie Matthews Stuprich", "comment_text": "It depends on when you are going? This month? The lines are going to be insane. Winter you would get away with not prebooking things and winging it."}, {"username": "Paola Coppi", "comment_text": "Hi, which city are you going to visit? If you're visiting Uffizi in Florence, Musei Vaticani and Cappella Sistina in Rome you should book in advance because they are packed. Even we Italians book in advance otherwise you have to wait for hours in line. If you are planning to visit Leonardo's Cenacolo in Milan well, consider to book for next year in Italy because it is really difficult to step in. Italy is full of wonderful things to see so it won't be difficult for you to enter churches and museums almost free of charge everywhere, in the little village or in the big city."}, {"username": "Chrystal Stevens Bisonet", "comment_text": "If you want to see inside the colosseum and the Sistine chapel, I’d book ahead of time. Here are the official websites for those:\n\nhttps://\nwww.coopculture.\nit/en/tickets/\nindex.html\n\nhttps://\nm.museivaticani.\nva/content/\nmuseivaticani-mo\nbile/en/\norganizza-visita\n/\ntariffe-e-biglie\ntti.html"}, {"username": "Beth Casey Murphy", "comment_text": "Coliseum, Vatican & Borghese Gallery need reservations and a tour guide will bring it to life."}]}, {"id": "2206741156391629", "text": "Hi Everyone! I am planning to do hiking from Almafi to Positano, could you please advise on the best route, so we can get to the start of the route by bus.\n\nUPD- just read about Path of God- anyone did it? Should I be aware of anything doing it?\n\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2206741156391629/", "likes": 0, "comments": [{"username": "Steve Grossman", "comment_text": "There might be hiking but i've never heard of it. There is only one road between the towns and it is one of the single most dangerous roads in the world. Maybe there is some way hope someone else responds with a good answer for you"}, {"username": "Tania Lediard", "comment_text": "Bring lots of water during hot season"}, {"username": "Brad Nelsen", "comment_text": "Do Path of the Lemons first from Maiori to Minori then Path of the Gods from Praiano to Positano. We heard from a local that a young girl fell of the POG track down a cliff and died (she stepped off the track a bit to take a photo apparently) so you need good shoes and to be careful where you step!"}, {"username": "Dafne Vassetti", "comment_text": "I would suggest you get a Guida Escursionistica\n- a guide that is specialized in hiking/\ntrekking."}]}, {"id": "2206759716389773", "text": "Apologies for asking as cannot locate the thread about the crossbody bags to buy for travel.", "link": "facebook.com/groups/1373361046396315/permalink/2206759716389773/", "likes": 0, "comments": [{"username": "Norma Boily", "comment_text": "I just bought this Travelon cross body. It is slim, not to carry a sweater or umbrella! But your cards, touring info, passport and all the smaller travel essentials. My I-Pad mini fits"}, {"username": "Bea Kuckens", "comment_text": "You can use the search feature within the group to find the post you remember, along with any other discussions on the subject. Look for magnifying glass (desktop) or three dots (app)."}, {"username": "Erin Lambert Mayeux", "comment_text": "Travelon has a wide variety of purses & bags; Amazon carries some. I felt very safe traveling w/my Travelon crossbody purse. However, I did keep my hand on the locking zipper when out in public."}, {"username": "Carolina Lamb", "comment_text": "They sell crossbody bags on every corner in Italy, if you can’t find one before hand."}, {"username": "Susan Douglas", "comment_text": "Has anyone used one of the bags that straps to your leg?"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\namzn.to/3KuMtgO"}]}, {"id": "2206748036390941", "text": "Rainy in Roma! Saluti 🥂", "link": "facebook.com/groups/1373361046396315/permalink/2206748036390941/", "likes": 223, "comments": [{"username": "Zucchero Candito Kandinsky", "comment_text": "I used to work in a bar on that square! How many memories... Enjoy your trip, drink a lot, eat even more"}, {"username": "John Hagan", "comment_text": "Great spot! I stayed next door at Hotel Abruzzi several years ago. Lots of night life. Hope you hit Tazzo D’oro around the corner!"}, {"username": "Marcus Hiesler", "comment_text": "West Coast tonight"}, {"username": "Patricia Chavez", "comment_text": "Wow!! Now that's a Awesome Shot!!\nThanks for sharing it."}, {"username": "Erica Martini Cross", "comment_text": "We check in on Monday! Can’t wait for that view!"}, {"username": "Charles Junior Runga", "comment_text": "Amazing is all I can say"}, {"username": "Sigrid Picken", "comment_text": "Great picture 💕"}, {"username": "Julie Darby Payne", "comment_text": "Be there in Sept!!! Nice view!"}, {"username": "Sue Lindsey Meeks", "comment_text": "Cheers! My favorite hotel in Rome!!!"}, {"username": "Jack Partington", "comment_text": "Great location!"}, {"username": "Nadia Mckenna", "comment_text": "Great shot"}, {"username": "Jean Ormsby", "comment_text": "What’s the name of the hotel please"}, {"username": "Tracey Frank", "comment_text": "Great view 4 weekends to go and ill be there 😀"}, {"username": "Krissy DaRusso", "comment_text": "Appreciate the death grip on that glass of wine!"}, {"username": "Janelle Wales", "comment_text": "The most magnificent building on earth! Took my breath away and that pic is sensational ♥️"}, {"username": "Sona Anjali", "comment_text": "T"}, {"username": "Dany O Murillas", "comment_text": "That's definitely not how you grab a wine glass hahah"}, {"username": "Syl Sgro", "comment_text": "We will be staying at L'Orologia Roma in Rome. Has anyone stayed there and did you like it?"}, {"username": "Ellie McCoy", "comment_text": "The way you're holding the glass 🤭 looks great!"}, {"username": "Adrianna Stella", "comment_text": "We stayed at this hotel March of 22 and LOVED it!"}, {"username": "Carrie Fischer Hogan", "comment_text": "Better grip?😂"}, {"username": "Hasan Sadruddin", "comment_text": "Mehwish Sadruddin"}, {"username": "Jenna Guanci", "comment_text": "That's my room! Lola I was in 604"}, {"username": "Laurel Hayden Peddie", "comment_text": "Loved that hotel, we stayed in the senior suite and had a similar view!"}, {"username": "Goran Abraham", "comment_text": "Goran Abraham"}, {"username": "Bill Elias", "comment_text": "It’s a bit depressing that you apparently need tickets to enter now."}, {"username": "Antonio Aloè", "comment_text": "Salute dude..."}, {"username": "Narelle Pacey", "comment_text": "Great photo 🤘"}, {"username": "Christine Harbidge", "comment_text": "Stayed there in Feb this year, great hotel with an ever better view. Will def stay there when in Rome again."}, {"username": "Leslie Feuer Orton", "comment_text": "Loved stay at that hotel many years ago. Prices in Rome are crazy now."}, {"username": "Marla Wiese Compa", "comment_text": "I stayed there a couple of weeks ago! Beautiful view from the rooftop bar! Enjoy!"}, {"username": "Anne Herrmann-Fields", "comment_text": "Thank you for sharing this photo. I LOVE IT!!!!!! 💖💖💖"}, {"username": "Jennifer L. Harris", "comment_text": "Best Hotel!! I stayed there last year 😊"}]}, {"id": "2206750126390732", "text": "Any tips on accommodations in or near Venice?", "link": "facebook.com/groups/1373361046396315/permalink/2206750126390732/", "likes": 1, "comments": [{"username": "Dave Colleen", "comment_text": "Hotel Moresco. We stayed there 2 weeks ago. Easy walk to train, on the canal, staff is fabulous, happy hour food every day, great breakfast buffet, nice rooms and bathrooms."}, {"username": "Kit Nader", "comment_text": "Look on trip advisor for reviews. I can recommend hotel columbina"}, {"username": "Karen Dwyer", "comment_text": "Hotel Aquarius- we stayed there in June- loved it!"}, {"username": "Kathleen Hills", "comment_text": "Thank you so much!❤️"}, {"username": "Iman Nazaran", "comment_text": "👍👍"}, {"username": "Darla Ehrhard", "comment_text": "https://\nwww.casangiorgio\n.com/en/"}, {"username": "Frances Scannapieco", "comment_text": "Hotel Al Ponte Antico, Venezia. Small Boutique Hotel on the Grand Canal. Absolutely fabulous"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.anrdoezrs.ne\nt/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187870-d6513\n32-Reviews-Hote\nl_Palazzo_Stern\n-Venice_Veneto.\nhtml"}]}, {"id": "2206757369723341", "text": "Will be in Montepulciano in October. Want to visit some of the wineries. We will have a car so thinking we would go in our own. looking for information on if reservations are needed or if you can walk in. Also recommendations of your favourite wineries. TIA", "link": "facebook.com/groups/1373361046396315/permalink/2206757369723341/", "likes": 3, "comments": [{"username": "Luca George Tudor", "comment_text": "Hello. In some places you can just walk in and they will serve you without any problem but I always recommend to make a reservation. Usually they organize a far better service if they know it in advance and you are 100% sure that it’s open and everything is available. Very good wine and nice Cantina Boscarelli, Poliziano, Avignonesi, Icario. And don’t forget those in the old center: just 3 or 4 of them but very very beautiful"}, {"username": "Barbara Krot Barrett", "comment_text": "Following"}, {"username": "Evelyn Trager Jose", "comment_text": "We enjoyed Poliziano"}, {"username": "Kim Bend Smolinski", "comment_text": "My friend lives near there and her favorite place is https://\nwww.cantinaderic\nci.it/vini/"}, {"username": "Rhonda Hope", "comment_text": "Most require reservations"}, {"username": "Rhonda Hope", "comment_text": "Montepuliciano has wonderful restaurants we stayed there last October"}, {"username": "Molly Roberts Siegenthaler", "comment_text": "Whatever you choose, it’s harvest time and a lot of wineries will be closed to tours."}, {"username": "Stephanie Lee Garcia", "comment_text": "Following"}, {"username": "Deborah Larsen", "comment_text": "Reservations will ensure you don’t waste your precious vacation time driving to a winery only to be politely turned away. Especially the smaller producers who make up the majority of the 70 or so wineries in that region, a better experience awaits if they can plan your tasting and be prepared for your arrival."}]}, {"id": "2206763806389364", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2206763806389364/", "likes": 2, "comments": []}, {"id": "2206765386389206", "text": "Does everyone use Rick Steves' guide books? If not, highly recommend - best guide books on the planet for Europe. But anyone like others?", "link": "facebook.com/groups/1373361046396315/permalink/2206765386389206/", "likes": 6, "comments": []}, {"id": "2206768849722193", "text": "We're in the planning stage for early Oct. tours in Rome. E-Bike vs Segway? Airbnb tours vs TheRomanguy? Thanks group!", "link": "facebook.com/groups/1373361046396315/permalink/2206768849722193/", "likes": 0, "comments": [{"username": "Jackie Gotelli", "comment_text": "E-bike tour is great! I forgot what company ours was booked through"}]}, {"id": "2206772226388522", "text": "Beautiful night in Termoli.", "link": "facebook.com/groups/1373361046396315/permalink/2206772226388522/", "likes": 5, "comments": []}, {"id": "2206778219721256", "text": "Having recently driven from the UK through France, Lake Como, Venice & now Switzerland by car, here are a few things we noticed which may be of help.\n\nLake Como:\nUnbelievably scenic. Everywhere we went around the lake from Nesso to Varenna, Bellagio to Menaggio is glorious. Try & fit in as much sightseeing as you can.\nHire a boat - we did at Bellagio, cost around €100 for an hour. Great fun.\nThere are lots of areas around the lake where you can have a dip. Very cold but worth it.\n\nDrive to Venice took around 4hrs & tolls cost us approx €30. Plenty of services en route & pre-booked car park.\n\nVenice:\nExtremely hot, very very busy but a one off! An experience like nowhere else.\nIf you want to go on the Grand Canal in a gondola be sure to use the gondoliers actually on the Grand Canal. The ones in the small waterways charge the same -€80 for 20m/half hour or €120 to make it to the Grand Canal as it’s further.\nHave an Aperol or coffee at Piazza San Marco - most cafes/restaurants there have musicians playing whilst you sit.\nTypical meal at a Trattoria (lasagne, calzone, pizza x 2, a huge beer, medium beer & large bottle of water) for 4 cost us €90.\n\nAt both Lake Como & Venice we used our card (Starling) everywhere with no problems, and took just a little cash for tips. Make sure your Airbnb/hotel room has excellent air con! Get up early before they become very very busy.", "link": "facebook.com/groups/1373361046396315/permalink/2206778219721256/", "likes": 58, "comments": [{"username": "Lee-Anne Stewart", "comment_text": "We hired a little speedboat at Varenna and it was indeed great fun."}, {"username": "Elizabeth Zavala-Castrillo", "comment_text": "In Venice is that 120euros per person?"}, {"username": "Rita Levi Montalbano", "comment_text": "Please do not take aperitivo in piazza san marco, only tourist trap. Search or ask instead for a \"bacaro\" which is like the typical venetian bar to drink and eat something"}, {"username": "Rocsana Thompson", "comment_text": "Hi Leanne, thank you for your tips. We are going to that area in 2 weeks and hiring a car. I was wondering how you found driving around that area? Any problems with parking? We are from the UK, that is why I am asking. Thank you"}, {"username": "Edoardo Casolo", "comment_text": "Do not have an aperil or coffee in piazza San Marco, prices are obscene. It s better to get it in other places like small bars"}, {"username": "Carol Mckie", "comment_text": "Is it best to stay close to the ferry or town centre if you don't have a car at bellagio?"}, {"username": "Mirella Trimboli Perau", "comment_text": "Thanks for all your information. Which car co did you use and what was the approximate cost."}, {"username": "Caterina Liquori-Culhane", "comment_text": "We took a tour. I had been before to lake Como. Want to go again but our tour took us to lake Maggiore, also very beautiful and the borrmean palace and gardens on isola bella. Wow!"}]}, {"id": "2206779869721091", "text": "I plan to take bazillions of pictures on my trip to Southern Italy in September and don't want to be worried about my phone battery life.\n\nWho has a powerbank charger that they've used and loved? Currently have a Samsung S21+. Would love suggestions and links!", "link": "facebook.com/groups/1373361046396315/permalink/2206779869721091/", "likes": 3, "comments": [{"username": "Marc Spiegel", "comment_text": "Eloop E45, but not sure if it's available outside of Asia"}, {"username": "Alessandro Iannelli", "comment_text": "There are 30000 mAh (or even bigger) power banks that you can buy, for example on Amazon, I have one of those and it's a \"beast\", it's almost impossible to run out of juice during the day, even if I spent the whole day watching videos. Choose a fast charging one (at least 20w) and see if the charger included is also fast charging, otherwise buy a fast charger as well. The fast charging is important because you want to put the device to charge at night and have it full by the morning. Unless you buy two and put one all day to charge, in which case slow charging is fine."}, {"username": "Celia Minnucci", "comment_text": "Cygnett power bank from jb hi fi, it has five charges and fast charges. It retails at about 120 AUD. It is amazing. My phone has no battery, very quickly it's full again."}]}, {"id": "2206780259721052", "text": "I have a question about catching a taxi at the Vatican (museums) to the Rome Termini train station, please!\n\nWe are arriving in Rome by train from Florence just for the day. We have a late afternoon Vatican tour (purchased on Vatican website direct.) It begins around 3:30 and lasts 2 hours without the happy hour portion. So, over by 6:00 PM at theआणखी latest, I'm hoping.\n\nIs it difficult to get a taxi from the Vatican to the train station? Is the FreeNow app the best way or is it safe to take one of the taxis at a taxi stand close to the Vatican? I don't want to get ripped off like I've read happens to so many when catching a taxi at the Vatican. I've not made our train reservations yet back to Florence from Rome. How much time do you feel it would be to get a taxi to get to the train station to catch a train? Should I allow about two hours between the Vatican tour end and the train? I'm so stressed over this!! Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2206780259721052/", "likes": 3, "comments": [{"username": "Ryan Shearer", "comment_text": "Your tour will probably be canceled before you arrive, if it isn’t just get an Uber black. An E or S class Merc will collect you and drop you off, haven’t waited more than 5 minutes for the car to arrive so don’t stress on timing. You can also book tours out the front from vendors."}, {"username": "Ken Lerch", "comment_text": "after others chime in about the taxis, keep in mind that there is a metro station a couple of blocks north of the Vatican and another station at the Piazza Republican, which is a couple of blocks from the train station."}, {"username": "Michael Broadwater", "comment_text": "I would just use the Metro, jump on at Termini and off at Ottaviano, a few blocks away from the Vatican."}, {"username": "Kim Sousa Andrews", "comment_text": "I was often overcharged by taxi drivers on my Italy trip, but who cares! Compared to the cost of your total trip it’s a very small amount. I was just happy to be able to get a taxi."}, {"username": "Laura Irmina", "comment_text": "In case taxi option won't work - Metro line A, from station Ottaviano (5 minutes walk from Vatican) directly to Termini. Ticket costs 1.50 EUR, can be purchased in the machine underground."}, {"username": "Diane Davis Lawyer", "comment_text": "I just found this again, I had lost it but found it just now. I think it's good info:\n\nHow to Find a Taxi at the Vatican\n\nThere are NO TAXIS at the taxi stand in front of St. Peter's Basilica.\n\nNot one. Anywhere in sight. I presume this is a security measure.\n\nIf you exit the Vatican Museums through the same door where you entered, you will see a taxi stand there to your left.\n\nIf you are exiting St. Peter's Basilica, to find the closest taxi stand, walk out of St. Peter's Square. Walk around the iron barriers, hugging the colonnade.\n\nWhen you've almost come to the Swiss Guard, take a left on via delle Fornaci.\n\nWalk along that street, taking the little pedestrian underpass, and once you exit the underpass, you will see the taxi stand on your left.\n\nIt's less than a five minute walk from St. Peter's Square."}, {"username": "Bethany Rudy", "comment_text": "I used Uber so the price was set"}, {"username": "Rita Scotto Epifanio", "comment_text": "Take the metro. It’s so easy. There’s an entrance to the metro right outside the Vatican and it’ll take you right to Roma termini."}, {"username": "Silvia Maria Lourenco Narciso", "comment_text": "Today we went from our Airbnb in the centre of Rome (via Sforza) to the vatican and we paid 12 euros by a Uber (actually the car was a taxi). It was fast (it was 7 in the morning), easy and cheap (we are a family of 4). If you use a Uber you pay through the app and you see how much you are due to pay in advance."}, {"username": "Sylvie Hogg Murphy", "comment_text": "I also recommend the metro as the simplest option since you won’t have luggage. You’ll be taking Metro Line A - the stops by the Vatican are Cipro and Ottaviano. When you enter the station, look for the signs for “direzione Anagnina.” (Ie the east-bound direction) Get off at “Termini” which is the main train station for your train back to Florence. The ride to Termini is only about 15 min by metro. If you take a cab it will likely be 30 min because you are cutting right through the heart of Rome at a busy hour. Altogether I would still allow about an hour and half between the end of the tour and the train departure time in case of unforeseen delays, pit stops for bathrooms or refreshments etc."}, {"username": "Martin-John Rubio", "comment_text": "There are plenty of things on the daily to be stressed about… getting a taxi 🚖 is not one IMHO 🤷🏽"}, {"username": "Sabiha Syed Shaikh", "comment_text": "The Freenow app is the easiest to use. It was easier to find a taxi during late hours compared to Uber. It will also give you an estimate cost and duration. Download it and register ahead of time.\nOne more tip if you don’t get a taxi right away, cancel that trip quickly and reorder. You won’t be charged and get a taxi."}, {"username": "Lynn Crane", "comment_text": "We were there a month ago and there was a lot of construction going in there, making it difficult to maneuver. Apparently it was kind of a long term mess for awhile. Just a FYI.\n\nWe just caught an Uber to make it a bit easier and got on the phone with the driver when our pickup point didn't work because of the construction and traffic congestion in the area. That might be the way to go for you."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2206785529720525", "text": "I’m a solo traveller. I gonna travel to Bologna in September just for 3 days long weekend. Need advice place to visit, food and best place for coffee please 🙏 many thanks in advance 😊 xx", "link": "facebook.com/groups/1373361046396315/permalink/2206785529720525/", "likes": 2, "comments": [{"username": "Scott Perry", "comment_text": "Caffè Terzi for coffee, Guero for cocktails, Regina Sofia and Zii Margherita for pizza. The archaeological museum is pretty amazing. The Piazza Santo Stefano has some wonderful restaurants. I just got back from Bologna a couple of weeks ago. Actually, the whole city is a treasure. Can’t wait to go back!"}, {"username": "Dawn Hofmeister", "comment_text": "We loved 🥰 Bologna. We had fabulous food and coffee everywhere."}, {"username": "Elaine Eitzer", "comment_text": "Order tortellini in brodo,no one makes it like the Bolognese"}, {"username": "Marisa Gazzotti", "comment_text": "Look up the Seven Secrets of Bologna, climb the Asinelli Tower, walk the archway all the way to San Luca, there is plenty to do. You will love it"}]}, {"id": "2206788523053559", "text": "I have 4 hours in Bologna 10am-2 (Centrale station) I thought, walk around and get lunch. (2 adults 3 teens) if someone could suggest a restaurant? Or suggestions if we have time to see something ? Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2206788523053559/", "likes": 0, "comments": [{"username": "Marisa Gazzotti", "comment_text": "Walk up Viale Indipendenza (beautiful historic central road) in 15 minutes you will get piazza Maggiore. The very center of Bologna. Its worth it. Have an 'Aperitivo' or snack in one of the many little bars leading to the center."}, {"username": "Marisa Gazzotti", "comment_text": "Marisa Gazzotti"}, {"username": "Sheri Winters Spry", "comment_text": "Thank you 😊💕"}]}, {"id": "2206785683053843", "text": "Coming to Rome in December. Trying to decide between an early morning or night time Colosseum tour. For those who have done both which did you prefer?", "link": "facebook.com/groups/1373361046396315/permalink/2206785683053843/", "likes": 1, "comments": [{"username": "Victoria Laverty", "comment_text": "Night"}, {"username": "Deborah Lancaster", "comment_text": "I personally loved the night time for the impressive glow but also loved daytime to see all its beauty. Enjoy."}, {"username": "Sherri Courtney", "comment_text": "Night"}, {"username": "Cheryl Swiatko", "comment_text": "Night time tour hands-down!"}, {"username": "Melissa Hunt", "comment_text": "Th night tour is not offered in December. On their website it says “to September “ but they never released any tickets for sep 1 or 2 so I guess it means not “through September”."}, {"username": "Julie Strauss", "comment_text": "Lex Strauss"}, {"username": "Ken Feltham", "comment_text": "I booked night for the 26th August and it got cancelled because they couldn’t get tickets. So we are on a day one now 😏"}]}, {"id": "2206790979719980", "text": "Hi everyone. My current plans (I am already in Europe) have my family and I exceeding the Schengen timing by 5 days.. we are departing from Rome back to Australia. What is the likely consequence of this?", "link": "facebook.com/groups/1373361046396315/permalink/2206790979719980/", "likes": 0, "comments": [{"username": "Gabriela Sylvester", "comment_text": "A non-EU national who stays in the Schengen area beyond 90 days (without a residence permit or long-stay visa) is illegally present, which can result in a re-entry ban to the Schengen area"}, {"username": "Michael Widjaja", "comment_text": "Blacklist from visiting schengen countries for at least 5 years,I almost did it back in 2019,lucky it’s already past the 180 days so I didn’t break any rule…."}, {"username": "Brenno Bianchi", "comment_text": "Ban for rentering the Schengen area for up to 5 years, a fine between 5000 and 10000 euros for each family member and possibility of deportation immediatly after 90 days (but this last is theoretically possibile but very unprobable)."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "How much time you still have in Schengen?If it’s more than a week grab a plain (or depending where you currently are, drive a car) and go outside the Schengen area for 24 hours: Morocco, Turkey, Albania, Great Britain are all linked by economy flights."}, {"username": "निनावी सहभागी", "comment_text": "Thanks everyone I know what the actual rules and possible consequences are. I am more interested in peoples actual experiences if they exceed their Schengen time by a few days when exiting via Rome. Small fine? Nothing? Re-entry ban for x years.."}]}, {"id": "2206802176385527", "text": "What time does the pope do mass on sundays?", "link": "facebook.com/groups/1373361046396315/permalink/2206802176385527/", "likes": 7, "comments": [{"username": "Michael Widjaja", "comment_text": "Angelus at 12 afternoon,with his health he rarely lead the mass now"}, {"username": "Zucchero Candito Kandinsky", "comment_text": "Every Sunday at midday he recites the angelus but he should be in Portugal right now"}, {"username": "Aurora Villegas Flores", "comment_text": "http://\nwww.papalaudienc\ne.org/schedule"}, {"username": "Aurora Villegas Flores", "comment_text": "Noon, but his schedule is online. I posted the link for you.\nI just went to Sunday Angelus last week.\n\npapalaudience.o\nrg"}, {"username": "Pauline Bezzina Gatt", "comment_text": "In Lisbon,Portugal\nfor World Youth Day at present"}]}, {"id": "2206801426385602", "text": "Hi! If taking public transportation on trains and ferries from Rome to Positano, would you recommend going through Naples or Salerno? Thanks in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2206801426385602/", "likes": 0, "comments": [{"username": "Tania Lediard", "comment_text": "Salerno. Direct high speed train right to Salerno, a short walk to the pier and then the ferry to positano. Easy and scenic. You get a wonderful view of the coastline as you travel up to positano. Ferry doesn’t go far off shore, so it’s spectacular scenery."}, {"username": "Rebecca Yeoh", "comment_text": "I got the high speed train from Rome to Naples and a driver met us at the station and took us to our hotel in Positano. I was travelling with my mother (in her 70’s) so I was mindful of keeping it simple."}, {"username": "Joy Jacobs", "comment_text": "Rebecca Yeoh what company/driver did you use, and how long was the trip in total? Thanks"}]}, {"id": "2206801843052227", "text": "Hi! We are visiting Italy at the end of March/early April. I understand this isn't the best time to go to The Dolomites because a lot of the hotels are closing for their breaks. My question is is it feasible to go for one night directly from Florence? We will be spending 3 nights in Venice afterwards. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2206801843052227/", "likes": 4, "comments": [{"username": "Tomas Krivanek", "comment_text": "Better doublecheck. Even may is good for skiing there so why should they close???"}]}, {"id": "2206804733051938", "text": "❗️❗️❗️Dear group members that flew in recent times to Italy via Emirates airline, specifically JFK to Milan economy.\nI searched high and wind on their official site and all over internet for the size/weightआणखी restrictions for personal item. We are traveling with carry ons and wanted to know how big of backpacks to buy to place under the front seat so I decided to go directly to the source and called them.\nTo my shock no other piece is allowed, just a purse, a fanny pack or a laptop bag😨😳\nSo our genius idea to travel with just a carry ons and backpacks went right out of the window🥺😣\nIm so hoping the costumer service representative was new or didn’t understand my question!\n❗️❗️❗️Please someone put my mind to rest and confirm this information🙏🏻 and share your personal experience with this airline!\nP.S. we’ve flown Emirates to Dubai and remembered them being one of the best\n\nHank you so much in advance!♥️", "link": "facebook.com/groups/1373361046396315/permalink/2206804733051938/", "likes": 8, "comments": [{"username": "निनावी सहभागी", "comment_text": "I meant -high and wide 🤪🫣"}, {"username": "Michael Widjaja", "comment_text": "I don't know how it is now,I flew Emirates before covid and I was allowed to carry a backpack and cabin luggage.\n\nThe one that's such a pain when it comes to cabin luggage is Qatar,the ground crew in FCO are nice but in CDG, they're the worst...."}, {"username": "Melissa Jane Brown", "comment_text": "I think they're becoming strict with luggage restrictions as when we flew to Italy with them (from Australia) in June, they were even weighing ladies handbags!"}, {"username": "Wendy Wallin", "comment_text": "Are you wanting to take a cabin bag & a back pack as carry on luggage? Generally find it’s One or other"}, {"username": "Bev Symes", "comment_text": "1 piece of carry on like a small wheeled bag or back pack and another small handbag type..They are clamping down. However many still risking it"}, {"username": "Jackie Farside", "comment_text": "I am flying on Emirates tomorrow and it’s a personal bag and one checked bag for flex and economy. I have a smaller backpack. If you scroll to the bottom of the main page there’s a baggage link with all the information. It’s just not simply stated."}, {"username": "Monica Roman-Fazio", "comment_text": "That is correct only one carry on per person. Everyone wants to bring carry ons they wanted me to check mine coming home. I paid extra money for extra luggage coming home. If you want to bring extra carry ons party now it's more money at the airport. They didn't weigh our carry ons"}, {"username": "Catherine Johnson", "comment_text": "Correct information from Emirates."}, {"username": "Leila Safavi Ofs", "comment_text": "I just now found this on the Emirates website. I scrolled to the bottom & Under Before You Fly, I clicked on Baggage."}, {"username": "Alisha Kalopdeo", "comment_text": "It would probably depend on the size of the backpack. I've previously carried a small one similar to the size of a handbag and they let me on but I would thinking anything larger would then quality as a second carry on. What I did on my most recent trip was flatten by empty backpack and store it in my carryon. I have a small cross body bag with passports etc. When you land its easy to just pull it out if needed immediately or make the swap when you get to your hotel. I actually used both I had valuables - passport, phone, cards in a very small cross body in front of me and a backpack for snacks, water, souvenirs etc."}, {"username": "Lisa Terry Holtcamp", "comment_text": "The 15 lb weight if they weigh the carry on would be an issue with me. I can pack a lot in a bag bit it’s going to add weight."}, {"username": "Ruth Akutu Maccarthy", "comment_text": "It should be written on your ticket or email confirmation you received.\nCall the customer service again"}, {"username": "Lynn Fotia", "comment_text": "When I fly domestic I put a very small purse inside my big bag I put under the seat. The small purse is were I put my money and id. Couldn’t you do something like that. Just leave room in your backpack for a Fanny pack etc."}, {"username": "Rhonda Allen", "comment_text": "We often fly Emirates and now they only allow 1 item in the cabin. Your personal item has to fit inside your backpack or carryon."}, {"username": "Allison Mir", "comment_text": "Anonymous participant it is in Europe."}, {"username": "Allison Mir", "comment_text": "Anonymous participant the backpack would need to be very small"}, {"username": "Allison Mir", "comment_text": "Anonymous participant Cost of fuel"}, {"username": "Allison Mir", "comment_text": "Anonymous participant it’s to with space on the overhead bins for other passengers."}, {"username": "Allison Mir", "comment_text": "Wendy Wallin exactly!"}, {"username": "Allison Mir", "comment_text": "It really depends what ticket you have. You want to carry more you need to pay more.in Europe it’s generally only what’s on your booking and your personal item would be something very small just for your phone, passports."}, {"username": "Leopoldo Conti", "comment_text": "You can store one piece under as long as it’s\n\nBag 25x40x20 (h x w x d) cm,\nLaptop 25x40x20 cm,\nBackpack 40x25x20 cm"}, {"username": "Andrea Paquette Haber", "comment_text": "It says it on their site or your tickets. Cause I’ve seen the info. And knew that. We’re flying from JFK to Milan in sept."}, {"username": "Sue Allanby", "comment_text": "I travel using Middle East airlines extensively,sta\nrt of July with Emirates CPTLHR the rule is 100% one piece of cabin baggage small case/backpack + purse or small laptop NOT BOTH - the case/\nbackpack is stowed in the overhead locker & purse under seat in front of you (as it’s small then there is space for you feet as intended).Believe me on a long flight you need to stretch your legs!!\nYOU WILL NOT BE ALLOWED to take both onboard."}, {"username": "Lora de Vries", "comment_text": "I regularly fly with Emirates (all classes). Obviously First and Business have additional baggage allowances. For Economy, you are only allowed to take a carry on of the weight and size they display on their website and a small personal item (small handbag, laptop bag, purse). You CANNOT take both a carry on AND a backpack. One item will be checked in. Also, if you do some Duty Free shopping, it adds to your carry on limit and bag allowances, and you may be asked to return it and get your money back or dispose of it just as you board the plane. So, not sure what you are not understanding!"}, {"username": "Roy Wallin", "comment_text": "Anonymous participant Some people will not be able to lift 23 kg to an overhead locker. Also suspect there would also be a load limit for the overhead locker."}, {"username": "Lexington Niteli", "comment_text": "A Carry-on plus another backpack? Usually they allow a carryon plus a personal item exactly as you describe. The personal item isn't meant to be stored inder the seat the whole time, just take off and landing, like a laptop or maybe a small bag of snacks."}, {"username": "Kimberly Lampros", "comment_text": "To my knowledge Swiss air is the same way. 1 carryon, no personal item."}, {"username": "Mika Whyte", "comment_text": "I flew from Australia to emirates on economy and I saw so many people with two carry on items. However, you are only allowed one and they might ask you to gate check if you bring more than that. You might get lucky and get away with it, they were pretty lax when I travelled to Italy"}, {"username": "Kathleen Roll", "comment_text": "Many of our have the same one under bag ONLY nothing else, if you wish to take more carry on you can at a further cost and it is small!"}]}, {"id": "2206808663051545", "text": "YES 🥰", "link": "facebook.com/groups/1373361046396315/permalink/2206808663051545/", "likes": 111, "comments": [{"username": "Joann Reyes", "comment_text": "Love this pic"}, {"username": "Denisa Navratilova Moore", "comment_text": "Maria Brzoska Sunyak this could be you!"}, {"username": "Hasnain Nawaz", "comment_text": "Love this♥️"}, {"username": "Katherine AliNuñez", "comment_text": "What a great picture!!"}, {"username": "Leila Jane", "comment_text": "Love it!! So cute!!"}, {"username": "Diane Hamilton", "comment_text": "Love this 🇮🇹"}, {"username": "Anna Cichorek", "comment_text": "Anna Cichorek"}, {"username": "Anna Cichorek", "comment_text": "Anna Cichorek"}, {"username": "Eileen Lonergan", "comment_text": "Isn't it great fun. I loved Pisa"}, {"username": "Teresa D'Alessio", "comment_text": "Great shot"}, {"username": "Angelo Adamo", "comment_text": "Very cool 😎there no crowd what happened"}, {"username": "D Rochelle Milton", "comment_text": "Great pic!"}, {"username": "Elizabeth Asadourian", "comment_text": "Soon"}, {"username": "Soheil Davoodi", "comment_text": "Soheil Davoodi"}]}, {"id": "2206812093051202", "text": "Hello! My husband and I will be in Tuscany in mid September and we are looking for a wine tour with a driver. We are looking just for a day tour. We are staying in Gaiole near Siena. ￼ So many of the tours we look at are from Florence. ￼Thank you for your help.", "link": "facebook.com/groups/1373361046396315/permalink/2206812093051202/", "likes": 3, "comments": [{"username": "Kim Catania", "comment_text": "Check out Welcome Italy Tours- we did a day trip from Gaiole to 2 wineries - it was the most amazing day! Antonio was our tour guide and driver - outstanding!"}, {"username": "Andrea Farster", "comment_text": "In 2019, I used Tuscan Drivers and had a great day wine tasting. We were picked up and dropped off at our hotel in Lucca."}, {"username": "Janie Osborn Wiltshire", "comment_text": "Paul Costa"}]}, {"id": "2206810306384714", "text": "Today we visited CIVITA “The dying city” at Bagnoregio, it was amazing!", "link": "facebook.com/groups/1373361046396315/permalink/2206810306384714/", "likes": 29, "comments": [{"username": "Mary Lou Gifford", "comment_text": "Some hike"}, {"username": "Margaret Sleep", "comment_text": "Loved my visit"}, {"username": "Linda Johnson", "comment_text": "How was the walk in?"}, {"username": "Connie Gibbs", "comment_text": "Well worth the visit. Spectacular from a far and magical once inside the walls."}]}, {"id": "2206814389717639", "text": "I’m looking for recommendations for restaurants in Florence. We’re a family of 4, and after camping for 3 weeks in Austria, Lago di Garda, san Gimignano and Maremma, we’re kind of tired (but the happy kind!)आणखी and don’t want to hunt for a restaurant. Tricky part is: my son is a difficult eater: fries and pizza margarita is about the only thing he eats, at least in restaurants. We still want something nice and authentic though (parents have needs as well!) Any ideas? We’re staying between Mercato centrale and piazza del duomo. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2206814389717639/", "likes": 8, "comments": [{"username": "Laura Cardinale", "comment_text": "La Beppa Fioraia!\nIs a Little bit far from your location but totally worth"}, {"username": "Саша Савино", "comment_text": "Za za"}, {"username": "Pietro Adami", "comment_text": "Go to the Mercato Centrale, upstairs, and your son will love you !"}, {"username": "KB Spector", "comment_text": "Ciro & Sons"}, {"username": "Jim Hash", "comment_text": "Giglio’s or Central Market."}, {"username": "Jennifer Grazian", "comment_text": "I would recommend doing the upper level of the Mercato Centrale!"}, {"username": "Mary Jade Chan", "comment_text": "Mercato Centrale plenty of great restaurants - Trattoria Za Za (florentine Steak)"}, {"username": "Ziv Ran", "comment_text": "Quattro Strade in Fiesole"}, {"username": "Nicole Rebecca Louise", "comment_text": "We had a lovely meal at Ostaria dei Centopoveri! Fresh, authentic food but lots to choose from!"}, {"username": "Louise Roy", "comment_text": "Amalfi del Duomo"}, {"username": "Suzanne Mills", "comment_text": "Alfredo pasta"}, {"username": "Laura DeCicco", "comment_text": "Trattoria ZAZa has tons of choices."}, {"username": "Debbie DiOssi", "comment_text": "Bocadama in Santa Croce square"}, {"username": "Michelle Miller", "comment_text": "Osteria Santo Spirito. The food is fantastic. If he will eat pasta and red sauce he will be fine there"}, {"username": "Steven Clarke", "comment_text": "Trattoria dall 'oste. Go to the og though near the train station. You can have an amazing meal, whilst they cater for kids. Not too expensive and better and bigger than the branch they opened near the dumo. 😋"}, {"username": "Christie Grant", "comment_text": "If you love steak you have to try Giannino in Lorenzo (RistoranteRost\nicceria) omg absolutely the best fillet i have ever had."}, {"username": "Gary Fossaceca", "comment_text": "Il Porscepino"}, {"username": "Jim Kelleher", "comment_text": "Trattoria Garibardi"}, {"username": "Nina Sikand", "comment_text": "Or Gusta Pizza for a family pizza night although ZaZa is on my list for the next visit as recommended."}]}, {"id": "2206835206382224", "text": "Has anyone gotten a hotel for a night in Florence while the ship overnights in Livorno. Trying to figure out if it would be worth it to avoid 4 train rides in/out, next day in/out. Please tell me if and how you got it to work for you.", "link": "facebook.com/groups/1373361046396315/permalink/2206835206382224/", "likes": 0, "comments": []}, {"id": "2206815003050911", "text": "Best places to buy gold jewelry in northern Italy other than Florence? Anyone been to Vicenza to buy jewelry?", "link": "facebook.com/groups/1373361046396315/permalink/2206815003050911/", "likes": 0, "comments": [{"username": "Brenno Bianchi", "comment_text": "Most gold jewelery in Italy is made in Arezzo. Every year the city exports around 2.5 billion euros in jewelery."}, {"username": "Paola Coppi", "comment_text": "Valenza (Piedmont) is famous for jewelry! My aunt and granny used to buy there! In the surrounding you can visit the old sinagogue in Casale Monferrato, and drink Monferrato hills wine."}]}, {"id": "2206817033050708", "text": "I would like to ask if you know of any cruises to Amalfi, Positano and Capri that depart from Salerno", "link": "facebook.com/groups/1373361046396315/permalink/2206817033050708/", "likes": 0, "comments": [{"username": "Tam Wong", "comment_text": "There is a ferry"}, {"username": "Ibbu Mohd", "comment_text": "Ferryhopper -get this app"}]}]