[{"id": "2208931306172614", "text": "So, in Latin class the morning greeting was \"salve!\". And I now learn that is still a greeting in Italy these days.\nHow is it (is it) used in normal situations?", "link": "facebook.com/groups/1373361046396315/permalink/2208931306172614/", "likes": 44, "comments": [{"username": "Steph Coombes", "comment_text": "It’s usually used as a greeting to someone you know but maybe not very well\nMore formal than ‘ciao’ x"}, {"username": "Manuela Bassetti", "comment_text": "I always use “Salve” in shops and restaurants, “ciao” is really informal, it’s okay to great a friend, but not with someone you don’t know, and buongiorno/\nbuonasera is way too formal"}, {"username": "Phyllis Snyder", "comment_text": "Salve I’ve told is a more proper greeting people who are not that close to you- Ciao is for casual informal.."}, {"username": "Mary Nelsen", "comment_text": "Salve Regina"}, {"username": "Amalia Cristina", "comment_text": "Salve is used when you can’t say ‘you’ to someone but you must use the formal ‘lei’ or ‘usted’ for those who know spanish. And that is used for people you either don’t know or you highly regard or simply you don’t have enough intimacy with like a friend or a colleague or family. If for example you enter a bar or a restaurant you don’t say ciao, you say salve or buongiorno."}, {"username": "Patricia Puente", "comment_text": "Salve is the formal of hello. Ciao is the informal."}, {"username": "Fred Tempes", "comment_text": "Cycling in Italy, we were frequently greeted by fellow cyclists with a hearty “Salve”."}, {"username": "Monica Sucato", "comment_text": "Instead of Ciao...Salve Is less coloquial but yes, It Is still in use"}, {"username": "Kit Nader", "comment_text": "How is it pronounced? Can someone write it phonetically please."}, {"username": "Michael Widjaja", "comment_text": "As an Italian learner,I use it to address someone more formally than ciao,but you can’t use salve as goodbye like ciao"}, {"username": "Ruth Akutu Maccarthy", "comment_text": "I use it when I get into a place to greet strangers"}, {"username": "Julie Espinoza", "comment_text": "English is very casual. Spanish in Mexico you have a formal way of greeting and speaking to someone say an adult or just introduce."}, {"username": "Lisa Joy", "comment_text": "I’ve been thinking about this and looking for the Aussie equivalent\nBuongiorno = good morning/ good day to you\nSalve = hello\nCiao = hi or g’day\nDoes that sound right?"}, {"username": "Lisa Scott", "comment_text": "When we were hiking in the alps in the north of Italy we heard “Salve” as a greeting from people coming in the other direction often."}, {"username": "Cherie Dwyer", "comment_text": "Heard it in Sicily, not Tuscany or Sorrento, when entering shops"}, {"username": "Kimberly Becker Mast", "comment_text": "Whenever I walked into a shop in Italy most shopkeepers said salve and not ciao or buongiorno- so I started using it and it seemed perfectly accepted"}, {"username": "Melissa Fabrizio", "comment_text": "I’m doing Duolingo Italian lessons with my daughter and it has taught us “salve”. I had never heard that in all my years taking Italian as a kid in school. It means Hello."}, {"username": "Joe Guzzi", "comment_text": "I used it yesterday to great the mayor of our village."}, {"username": "Amanda Ash", "comment_text": "More polite than ciao"}, {"username": "Shirley Lewis", "comment_text": "this greeting is above the door of a beautifully restored art nouveau residence at XX Septembre 42 in Florence"}, {"username": "Shirley Lewis", "comment_text": "a better view of the greeting above the door of the art nouveau residence at XX Septembre 42 in Florence"}, {"username": "Elizabeth May La Duca", "comment_text": "My Oxford English-Italian\ndictionary translates salve as hail [as in hail Hitler]"}, {"username": "Marcos Aguirre", "comment_text": "Formal"}, {"username": "Kim Aranha", "comment_text": "I consider it to be old fashioned - I never use it my self - I either say ciao for casual or: buongiorno- buonasera- buonanotte"}, {"username": "Nancy Cicinelli", "comment_text": "I thought it used as formal greeting for strangers"}, {"username": "Princess Queen", "comment_text": "Ciao is most common"}, {"username": "Princess Queen", "comment_text": "Salve is greating between older people mostly,young greats by ciao"}, {"username": "Ally Dickerson", "comment_text": "It doesn’t have a translation into something like hello(I also would not consider hello formal haha), it is a whole greeting for a formal situation like walking into a shop or when you are working, greeting somebody you don’t know. It is a little more then buongiorno or buonosera (good morning/ good evening) it’s a very respectful and friendly way to say greet an elder, professional or a stranger"}, {"username": "Cindy Dymond Fernicola", "comment_text": "Kathy Troast"}, {"username": "Arnie Schwartz", "comment_text": "Is the v pronounced like a “v,” or like a “w” as in Latin?"}, {"username": "Elena Eugeni", "comment_text": "I use that quite frequently, it's less formal than buongiorno/\nbuonasera but more than ciao"}, {"username": "Paola Coppi", "comment_text": "Use It when you arrive in a Place, not when you wave bye bye"}, {"username": "Alessandro Iannelli", "comment_text": "The difference between italian and latin is that in Latin it has a plural (salvete), in Italian only \"salve\" is used"}, {"username": "Kimberly Harrison Loesche", "comment_text": "The shop owners in Tuscany have been using it when we enter and when we leave the shop. We asked one and she said it is both a greeting for hello and goodbye. Not as casual as ciao but still a casual greeting."}, {"username": "Angela Scott", "comment_text": "I said buongiorno to a man walking by in Tuscany and he replied salve"}, {"username": "Melanie Matthews Stuprich", "comment_text": "I hear it most often coming into shops here in Sicily. Just like a middle of the road greeting for someone you don’t know but not as formal as other greetings but not like a friend who says ciao!"}, {"username": "Elizabeth Boone", "comment_text": "I hear salve more from kids saying it vs ciao."}, {"username": "Luca George Tudor", "comment_text": "I use that all the time when I lose track of time and can't immediately realize if I should say Buongiorno or Buonasera 🤣"}, {"username": "Silvia Urbinelli", "comment_text": "We use Salve very often, but it is more \"friendly\" than Buongiorno. I may accept Salve by my students, but I would not accept it by other students that don't attend my classes."}, {"username": "Edoardo Casolo", "comment_text": "I use it often although it s a bit formal"}, {"username": "Roxanne Franquelli", "comment_text": "Usually informal. Salve. For hello. I’m an Italian teacher."}, {"username": "Angie Mattin", "comment_text": "I was taught that ‘ciao’ was very informal, used more amongst friends and gives the impression of being someone who doesn’t know much Italian/is a visitor if used amongst strangers.. I tend to use ‘salve’ most of the time, it’s not as formal as ‘buongiorno’ or ‘buona sera’, but still polite."}, {"username": "KB Spector", "comment_text": "KB Spector"}, {"username": "Allan Olexa", "comment_text": "Salve Keith. I also had 3 years of Latin in high school…quite a few decades ago. It’s fun for me to be able to read some inscriptions on old buildings in Italy."}, {"username": "Patricia Foley Mastrorilli", "comment_text": "I didnt hear it used much except from an older cousin when he entered my other cousins home."}, {"username": "Keith Crossley", "comment_text": "This (\"salve\") came to mind when I was filling a \"Contact us\" form. \"Ciao\" seems informal, and \"buonxxxxx\" formal, never mind time of day. How does \"salve\" work in this context?"}, {"username": "Jen Jen", "comment_text": "Glad to hear it is used since I keep learning it in my duolingo lessons 😂"}, {"username": "Janet Ottaiano", "comment_text": "In Sicily when I walked into the shops the merchant said, \"salve.\""}, {"username": "Lesley Vullo Pino", "comment_text": "Whenever you walk inside a place you can greet them saying Salve.."}, {"username": "Lucrezia Folger", "comment_text": "Hello"}, {"username": "Karen Niski Ready", "comment_text": "P M.pL\nLP"}]}, {"id": "2208930906172654", "text": "Hi I’m planning a trip to italy for my first time. What city/cities can I go to relax, get good food, have entertainment with great views? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2208930906172654/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Polignano a Mare"}]}, {"id": "2208930456172699", "text": "? spending a few days in Sorrento ( will tour Pompeii etc). and then headed to Sicily for 5 days- what is a good spot between Sorrento and Messina to stay for a night?\nThx you !!", "link": "facebook.com/groups/1373361046396315/permalink/2208930456172699/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Tropea"}, {"username": "Jordan Messina", "comment_text": "Catania or Taormina"}]}, {"id": "2208928179506260", "text": "Please recommend the “Must Do in Milano”", "link": "facebook.com/groups/1373361046396315/permalink/2208928179506260/", "likes": 24, "comments": [{"username": "John Spensieri", "comment_text": "B"}, {"username": "Nora Arrechea", "comment_text": "The last Supper. Leonardo. STA María degli angeli.\nPinacoteca di Brera.\nPalazzo Sforza.\nDuomo.\nGalería Vitorio Emanuele..."}, {"username": "Dade Lgg", "comment_text": "Canals, historical castle, duomo cathedral.. but please consider that during August the city is basically empty since all the milanese are on holiday"}, {"username": "Ann Moore-Pak", "comment_text": "Duomo. Last supper n opera house n the mall"}, {"username": "Unal Dogan", "comment_text": "I used ChatGPT to plan my entire trip. Ask it anything. It will give you endless answers."}, {"username": "Tita Gorbea", "comment_text": "Have a Hugo, sit back and enjoy."}, {"username": "Paola Coppi", "comment_text": "Go to Santa Maria Presso San Satiro Church in Via Torino. It Is an hidden beauty.\nAlso don't forget to visit the La Scala Theatre. via Montenapoleone Is famous for Fashion and of course Pinacoteca di Brera (Art Museum) and Naviglio (a River) on Porta Genova"}, {"username": "Paola Coppi", "comment_text": "Try Risotto alla Milanese and Ossobuco!"}, {"username": "Yassmeen El-Sayed", "comment_text": "Day trip to Como and then take the ferry to Bellagio (Bellagio on its own can take the whole day) and another day to Varenna (Villa monastero was amazing!)"}, {"username": "Sergio Rosales", "comment_text": "Go to Lake Como..."}, {"username": "Monica Marzari-Hailey", "comment_text": "Shopping lol"}, {"username": "Paul Fielding", "comment_text": "Necchi villa"}, {"username": "Nessa Macias", "comment_text": "Definitely the rooftop of the Duomo di Milano. Buy tickets with elevator access if you don't want to climb. The intricate work of the architecture will wow you!"}, {"username": "Marco Brambilla", "comment_text": "Ponte della Ghisolfa"}, {"username": "Jill Giura DeRamo", "comment_text": "The Last Supper, the Duomo and you must eat at IL Cestino. So good!"}, {"username": "Miyuki Kanno Paul", "comment_text": "Teatro la Scala\nCenacolo Vinciano\nDuomo\nGalleria Vittorio Emanuele II\nHave Ossobuco alla Milanese\nBring panettone home"}, {"username": "Riccardo Collova", "comment_text": "Jayme Collova"}, {"username": "Lisa Kelly", "comment_text": "Cathedral roof and then Castle sforzesco to see Michelangelo’s last sculpture."}, {"username": "Lara Grom", "comment_text": "Hi this is larissa or Lara guide in Milan number one amazing place saint Maurizio corso Magenta get a coffee at marchesi same street and you will be happy then stroll in the area it’s quite and beautiful"}, {"username": "Geoff Roush", "comment_text": "Duomo and last supper"}, {"username": "Clelia Minucci", "comment_text": "Take the train to Rome"}, {"username": "Behiye Celebi", "comment_text": "Sema Gül Deshmukh Fatma Öncu."}, {"username": "Debora Mazzierli", "comment_text": "See “l’ultima cena “ of Leonardo Da Vinci and the Duomo"}, {"username": "Laurinda Gray", "comment_text": "Castello Sforzesco, the Last Supper and the top of the Duomo!"}, {"username": "Frank Katz", "comment_text": "La Scala opera house"}, {"username": "Saskia Kop", "comment_text": "Go to Navigli, the San Siro stadium, the Duomo ofcourse and drink a cocktail in the Armani Hotel ❤️"}, {"username": "Robin Darmstadt Mancil", "comment_text": "Monumental cemetery!! There’s a metro stop very close to it. It’s free and it’s unbelievable!"}, {"username": "Raphael Joson", "comment_text": "Climb up the Duomo\nLast supper\n\nDon’t forget day trips to lake como and even Cinqueterre"}, {"username": "Raquel Derasmo Piccirillo", "comment_text": "Go to the rooftop of the Duomo in the late AM. Lunch at Antico Vinao. Have dinner at Navigli."}, {"username": "Yahya Ammane", "comment_text": "Following"}, {"username": "Murielle Medina", "comment_text": "Brera, Via Monte Napoleone, Paolo Sarpi (China Town), Corso Como, Sempione Park and of course Alzaia Naviglio Grande."}, {"username": "David Perillo", "comment_text": "Shopping at Rinascente. Even just seeing is believing."}, {"username": "Murielle Medina", "comment_text": "If you have enough time go to Sirmione by train Milano/\nDesenzano or to Verona."}, {"username": "Adam Hogarth", "comment_text": "Day trip to Bergamo via train if you have a spare day!"}, {"username": "Ken Vecchia", "comment_text": "Duomo is awesome visit amust"}, {"username": "Gaby Devyll", "comment_text": "Take train from Milano to Bellagio. Ferry ticket included with the train ticket. A perfect day trip from Milan to visit both Varenna and Bellagio."}, {"username": "Matteo Gallizioli", "comment_text": "Ultima cena of Leonardo"}, {"username": "Rose Turdo", "comment_text": "Vertical Forest"}, {"username": "Ted Cabot", "comment_text": "We are big fans of china town in Milan for street food and Shallo Brera for awesome craft beer hole in the wall"}, {"username": "Michaela Hlaváčková", "comment_text": "Visite Duomo, La Scala theatre, galleria Vittorio Emanuele Il."}, {"username": "Kelsey McCarty", "comment_text": "Visiting the Duomo and doing the radio tour :3"}, {"username": "Žaklina Roso", "comment_text": "Navigli"}, {"username": "Theodore Meyer", "comment_text": "Santa Maria delle Grazie"}, {"username": "Fiona Mac", "comment_text": "Shopping lol"}, {"username": "Irini Kakoulidou", "comment_text": "Go to Navigli"}, {"username": "Giessica Bormio", "comment_text": "Campari during an happy hour"}, {"username": "Leena Pitkänen", "comment_text": "Duomo, Branca tower, Galleria Vittorio Emanuele II, Bosco Verticale, San Siro stadio"}, {"username": "Patti Hunt", "comment_text": "Leonardo’s Vineyards! My favorite thing to do! Tickets are cheap, the place is beautiful. I go back every time I’m in Milano. It’s directly across the street from the church where the last supper is painted"}, {"username": "Francesco Cutri", "comment_text": "Maruzzella! Beautiful food!"}, {"username": "Lisa Martinson", "comment_text": "Last supper & Duomo roof top"}, {"username": "Gary Fossaceca", "comment_text": "The last supper"}, {"username": "John Adams", "comment_text": "Pinocoteca di Brera"}, {"username": "Lina Khasky-Parness", "comment_text": "Milano is also less expensive to fly in and out of… not the most exciting town in Italy."}, {"username": "Lynn Dye Shell", "comment_text": "The Last Supper is amazing"}, {"username": "Donna Russonello Merlino", "comment_text": "Walk on the roof of the Duomo."}, {"username": "Alessia Zito", "comment_text": "I reccomend to visit: brera (where you can visit the pinacoteca di brera), duomo (visit the inside of the duomo and go up to the terrace), the gallery, arco della pace, navigli, church of san bernardino alle ossa (inside walls made of human bones, it may seem disturbing but it is breathtaking) sempione park, 900 museum, villa invernizzi, fondazione prada, porta garibaldi, piazza gae aulenti, city life, santa maria delle grazie church where you can see the painting of leonardo da vinci's last supper, teatro “la scala”, qc terme (a beautiful spa) there are many streets where go shopping like via torino, san babila, via della spiga, via montenapoleone,\nmilan is the capital of fashion.\nAlso there are many terraces where you can have an aperitif, i reccomend: Milano verticale, Via de Cristoforis ( Porta Nuova - Garibaldi) the dome, terrazza 21, sun eleven rooftoop\nEnjoy😉"}, {"username": "Mike Adams", "comment_text": "Great shopping\nHome of Campari!"}, {"username": "Laura Natalini", "comment_text": "Sbopping!"}, {"username": "Viktorija Savicka", "comment_text": "Shopping"}, {"username": "John Spensieri", "comment_text": "B"}, {"username": "Marlene Sanz-Rodriguez", "comment_text": "Shop!!!"}, {"username": "Monica Grieger", "comment_text": "Eat at https://\ninstagram.com/\ncesarino_milano?\nigshid=MzRlODBi\nNWFlZA%3D%3D"}, {"username": "Neaţă Maria", "comment_text": "Go to see Duomo di Milano, Castello Sforzesco, Last supper and Santa Maria delle Grazie, Brera District, Navigli and Darsena.. And more important, go to Monza or Como :)"}, {"username": "Саша Савино", "comment_text": "Dont waste your time. Duomo, galleria, Navigli, sforzesco castle and run away to other city like florence or venice.\nIf u want pizza Gino sorbillo nearby duomo or risoelatte."}, {"username": "Margaret Williams", "comment_text": "La Scala theatre"}]}, {"id": "2208927059506372", "text": "Where are your top places to visit in Tuscany? 🍷 🥖🧀🌳🌾🍇 I will be staying in Florence and I am stumped on creating a realistic 4 day itinerary for this area. TIA💜", "link": "facebook.com/groups/1373361046396315/permalink/2208927059506372/", "likes": 13, "comments": [{"username": "Karrie LeBlanc", "comment_text": "We had a great experience at Frescobaldi Nippozzano about 30 minutes outside Florence for their wine tour and Tuscan snack package. 2 hours long."}, {"username": "Emily Smith", "comment_text": "Loved San Gimignano! So beautiful and quaint. Great wineries outside the little medieval town."}, {"username": "Gary W Anderson", "comment_text": "Day trip to Siena, the Uffizi, Acadamia (David), Medici palace and grounds, Duomo, Galileo museum, the Ponte Vecchio along with Tuscany"}, {"username": "Renae Larcus", "comment_text": "Siena, San Gimignano, Pienza, Montepulciano"}, {"username": "Max Sorber", "comment_text": "Relatives loved San Gimignano and Lucca"}, {"username": "Julia Muller", "comment_text": "I can highly recommend Volterra - we spent four days in Vicopisano about five years ago and I still want to go back to Volterra some time soon! And Lucca, def Lucca 💕 We stayed in Montepulciano a long time ago (maybe 15yrs ago) and absolutely loved it too. So much to see in Tuscany, it’s breathtaking!"}, {"username": "Rhonda Hope", "comment_text": "Montalcino, Volterra, montepuliciano,\nSan gimignano, sienna it’s all beautiful"}, {"username": "Linda Mascaro", "comment_text": "Pienza, Montepulciano, Cortona\nAll very beautiful"}, {"username": "Monica Grieger", "comment_text": "You have to go here\nBook in for a wine tour\nIt’s worth every cent\n\nhttps://\ninstagram.com/\ncartizzepdc?igsh\nid=MzRlODBiNWFl\nZA%3D%3D"}, {"username": "Emily Pearce", "comment_text": "Following!"}, {"username": "Karol Sabat Hoffman", "comment_text": "Siena, Montelpuciano, Val D’Orcia, Pienza!"}, {"username": "Lisa Pirone Kaiser", "comment_text": "Everything is amazing there! We did a fantastic cooking class at Montese Cooking Experience. All wineries were beautiful but we really enjoyed Tenuta Torciano wine tasting 🍷"}, {"username": "Vanessa Stack Reese", "comment_text": "Moltalcino is cute, not so crowded as San Gimignano, great wineries around the town. We loved cicco Piccolomini winery- beautiful views, great wines. And a gorgeous Abbey at the entrance that is well worth a visit (for free!) Vigno Bagnoni was a local suggestion, and it was incredible- beautiful hot springs and a cute little town with great restaurants. You can spend. Nice relaxing day there. Day trip to Siena, Lucca is a nice lunch stop and close to Pisa for a quick stop there- both are short stops, but nice to see"}, {"username": "Bethany Rudy", "comment_text": "We loved Lucca!"}, {"username": "Seán Ó Confhaola", "comment_text": "Siena, Pisa, Arezzo and Pienza."}, {"username": "Gianna Onesi", "comment_text": "Florence, Bologna, Lucca, Siena, Pistoia"}, {"username": "Rebecca Yeoh", "comment_text": "San Gimignano is a must! I would also suggest a winery lunch in Chianti and a roam around Siena. You could do all 3 in a day trip from Florence."}, {"username": "Dale Ilinsky", "comment_text": "Anyone got recommendations\nfor great places they have stayed in Tuscany. 🍷"}, {"username": "Jennifer Bernardino", "comment_text": "Debora Mazzierli she’s the best tour guide ever!!! And can help you with Tuscany and beyond"}, {"username": "Sonia Starinieri", "comment_text": "You can do Siena and San Gimigniano. You can also explore the Val d'Orcia area and cities like Montalcino to Montepulciano."}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "Just went to Siena and San Gimignano. Highly recommend one or both."}, {"username": "Robin Heid", "comment_text": "Following"}, {"username": "Norm Utech", "comment_text": "absolutely do the pizza and gelato class in the hills\n\nhttps://\nwww.walkaboutflo\nrence.com/\ntours/\npizza-and-gelato\n-cooking-class-\nat-a-tuscany-fa\nrmhouse-from-fl\norence"}, {"username": "Sam Dow", "comment_text": "F"}, {"username": "Nathan Earl Stellenberg", "comment_text": "Saturnia Hot Springs"}, {"username": "Shahd Mohamed Wahid", "comment_text": "Siena ♥️"}, {"username": "Debora Mazzierli", "comment_text": "I suggest you\n1)a day in Cortona:\ntake a train that arrives at 9.30. Book an historical tour of the city ( contact me) until 1 pm. Have a nice lunch in town then at 4 pm have cooking class with Chef Ryan.\n2)visit a cheese farm, lunch in Montalcino with wine tasting , then visit Pienza and Montepulciano : Unesco heritage\n3)visit a fortress on the lake, the lunch with wine tasting in a castle, then visit a small local family business"}, {"username": "Todd Scarfone", "comment_text": "You must do the Montese Cooking Experience - google it, great day!"}, {"username": "Jennifer Bernardino", "comment_text": "Debora is the best!"}]}, {"id": "2208921496173595", "text": "Just one week of our three week trip!", "link": "facebook.com/groups/1373361046396315/permalink/2208921496173595/", "likes": 39, "comments": [{"username": "Sabrina Tjoelker", "comment_text": "I’m counting on this …I plan to eat all the food"}, {"username": "Kell Murgas", "comment_text": "Every time we go on vacation- we lose weight! Not on purpose…cause we walk!! And eat good food"}, {"username": "Courtney Rey", "comment_text": "I’m back almost a week and I still can’t feel my legs and ass I feel like I did 4 marathons !!!!!! And I’m in pretty decent shape"}, {"username": "Nancy Duplessis", "comment_text": "Impressive. We walked the most in Rome, 50K in two days. And ate and ate and drank 😂"}, {"username": "Gail Linville Ellis Fuhrman", "comment_text": "It is a lot of walking for sure"}, {"username": "Miyuki Kanno Paul", "comment_text": "EASILY! It’s so dangerously easy to carry away in Italia! My record walk was 14.5 miles in one day in Napoli. I have packed a bottle of ibuprofen in my suitcase ever since. We were back in Italia 3 months ago; we tried to balance by alternating high and low days. We managed to keep our high at 11.1 miles"}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "Yes! That's what we did every day for 2 weeks! Good way to counteract all the great food!"}, {"username": "Eileen Muro", "comment_text": "I wish I had a tracker on me. We went to Italy for 10 days....ate pizza, pasta, wine, Gelato and \"drinks\" EVERY DAY. I came home not gaining an ounce and hubby lost 3 lbs but he also got sick the last day...lol. We did tons of walking and did 3 climbing excursions.... lots of hydration because we just recently went from July 18-July 29 and there was a heat wave going on. I have to honestly say..... hubby and I went on a weight loss journey once we booked our trip. I lost 23 lbs....hubby lost 15. We were still considered overweight when we went our trip but truly believe without our \"preparation\" for this trip....we may have really struggled."}, {"username": "Debbie Riffe Fulco", "comment_text": "My friend and I walked 83 miles in 2 weeks. Had to recuperate when we got home 😩"}, {"username": "Paula Bennett", "comment_text": "Awesome"}, {"username": "Elaine C. Macalolooy", "comment_text": "While at Rome. Started at 5:45am just to see the Trevi Fountain and Spanish steps and to beat the crowds and heat wave. Came home around 9pm and had a good sleep after 😂"}, {"username": "Kay Malick", "comment_text": "Great..it's the same for me...through I am in a small city like Perugia...150 km for July!"}, {"username": "Kay Malick", "comment_text": "Aamna Khurram !"}, {"username": "Elaine M Woodward", "comment_text": "That many steps only burned 934 calories?"}, {"username": "Adriana Sormani", "comment_text": "Yep, especially in Venice"}, {"username": "Theresa Caruthers Ansbaugh", "comment_text": "Wow I need to train for my vacation LOL"}, {"username": "Jennifer Lynn Davis", "comment_text": "That was one of the best parts of Italy for me."}, {"username": "Luanne Carey", "comment_text": "That's why we eat all the gelato when we're there! 😄"}, {"username": "Randi Conniffe Duncan", "comment_text": "We are in Venice and got 13,500 steps yesterday. (and we are in our 60s) 😁"}]}, {"id": "2208921386173606", "text": "Looking for hotel recommendations for best canal view in Venice for 1 night. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2208921386173606/", "likes": 7, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.dpbolvw.net/\nclick-100692842-\n12291623?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.it\n%2FHotel_Review\n-g187870-d23042\n7-Reviews-The_G\nritti_Palace_a_\nLuxury_Collecti\non_Hotel_Venice\n-Venice_Veneto.\nhtml"}, {"username": "Jill Wolder", "comment_text": "daniele"}, {"username": "Mat PO", "comment_text": "Aman Venice."}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "Rialto"}, {"username": "Marie Cunningham", "comment_text": "I'm in venice now and best place is the hotel opposite the Hard Rock Cafe!"}, {"username": "Melissa Vocke", "comment_text": "Sina Centurion. Here now!"}, {"username": "Charles Ferer", "comment_text": "Gritti palace"}, {"username": "Tami Ford LaMar", "comment_text": "Loved this hotel"}, {"username": "Michele Ann Tomao Ruzzano", "comment_text": "Saint Angelo"}, {"username": "Bridget Gieseke", "comment_text": "Daniele"}, {"username": "Miyuki Kanno Paul", "comment_text": "There are gazillion of canals!"}, {"username": "Amanda Watson", "comment_text": "Following 💜"}, {"username": "Chloe Hyatt", "comment_text": "Hotel Rialto"}, {"username": "Diana Ferro-Rodrigues", "comment_text": "Monaco and grand canal"}, {"username": "Linda Shepherd", "comment_text": "We stayed at the Rialto Hotel they have really nice appartments on the top floors. Very modern and great views from the windows. Really central location you can walk everywhere in 10 to 15 mins."}, {"username": "Linda Shepherd", "comment_text": "Linda Shepherd"}, {"username": "Frances Scannapieco", "comment_text": "Hotel Al Ponte Antico, Venezia. Fabulous"}, {"username": "Shannon Hanna Cagle", "comment_text": "Just a thought. We never splurge on a canal view room because we don’t plan to stay in the room much. We splurge on cocktails & dinner on the grand canal to enjoy the view. Or just being out walking around. If money was no issue I would upgrade for sure."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2208913622841049", "text": "Would love some advice. Planning a few days in Florence and want to suss out the most convenient/best place to stay. Or something to use as a guideline when looking for hotels.\nThanks in advance 😊🇮🇹🍕🍝", "link": "facebook.com/groups/1373361046396315/permalink/2208913622841049/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.tkqlhce.com/\nclick-100692842-\n12291623?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.it\n%2FHotel_Review\n-g187895-d23072\n3-Reviews-B_B_H\notel_Firenze_Pi\ntti_Palace_al_P\nonte_Vecchio-Fl\norence_Tuscany.\nhtml"}, {"username": "Karrie LeBlanc", "comment_text": "We stayed in Santo Spirito neighborhood and very happy we did. Easy still to walk or cab to everything. Lots of restaurants and bars, shops and things to do without being overcrowded. It seemed to be a “cool” spot to be for younger travellers as well. The small bar at the end of our street was definitely a popular hangout as was Santo Spirito square"}, {"username": "Renae Larcus", "comment_text": "Hotel Roma. Great location close to the train station and you can walk anywhere."}]}, {"id": "2208912682841143", "text": "Any recommendations for horse riding in Tuscany? We are staying in the Poggibosni/San Gimignano area. We don’t want an organized tour as such with lunch or wines etc- just horse riding. However not having any luck getting in contact with anyone. Already contacted the local Club Ippico L ‘ Agrifoglio 3 times with no luck. TIA😀", "link": "facebook.com/groups/1373361046396315/permalink/2208912682841143/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Siena/\nHorseback-riding\n-explore-Tuscan\n-nature/\nd944-268557P1?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}]}, {"id": "2208788616186883", "text": "I HOPE THIS HELPS SOMEONE!!!!\n\nQuick story time: I was at the public beach in almafi when I was approached by a younger possibly Hispanic female. She asked if I spoke Spanish and I told her yes. First she asked if I could share “cell phone service” with her… first red flag. She explained that her brother was on the way to almafi and was coming via bus. She said￼ she didn’t have service so she just wanted to let him know that she would be waiting for him at the beach and their dad would be waiting for him at the bus stop. I must have looked confused so she went to her own phone and went into settings… I did the same. I asked her if she meant hotspot and she said no… she then proceeded to ask if she could use my phone to call her brother… Second red flag as now I was scared she would take my phone and take off running. I offered to send her brother a text instead, and she insisted it be through WhatsApp… she insisted she could type it herself, but at this point, I was starting to feel uncomfortable, so I just told her I would send it myself so I can get rid of her. The male had a germany phone number…. Another red flag!!!! She thanked me and left. I then received a phone call from a friend and began to chat with them. As I was still talking to my friend on the phone, I received a phone call from her supposed brother, but since I was already on the phone, I did not answer. As I looked around for the girl\nShe was, of course, nowhere in sight. The whole situation still never set right with me. The following morning when I woke up I was notified that my ‎WhatsApp account was flagged for spam, and it was permanently deleted. I can’t say for sure that text message was the culprit, but my gut feeling told me that it had something to do with it. The more I think about it my theory is that if I would’ve answered that guys phone call, he would’ve started asking me for money and gave me some Sob story about how he was stuck at the train station with no money and needed funds… I’m also thinking that that female had already been reported and that alleged Germany phone number was flagged thus my WhatsApp account was also flagged. I just wanted to share this quick story and remind everybody to stay vigilant and if something doesn’t feel right, go with your gut feeling and stay safe. ￼", "link": "facebook.com/groups/1373361046396315/permalink/2208788616186883/", "likes": 115, "comments": [{"username": "Sony Ucciferri", "comment_text": "I will not help anyone no matter what ! God job !"}, {"username": "Diana Wilson", "comment_text": "Thank you"}, {"username": "Sonia Smith", "comment_text": "Sorry this took time away from your vacation. I’ve learned the easiest thing to do is to just walk away from the beginning of this sort of situation. It sounds like this has taken too much time in your head. A real emergency can be handled by the authorities available."}, {"username": "Pamela S'tha Mlilo - Mhlanga", "comment_text": "Thank you for sharing."}, {"username": "Joe Perchetti", "comment_text": "Thank you for sharing and great to hear that your homework, common sense and instincts kicked in to prevent a miserable holiday"}, {"username": "Lina Costantino Sirianni", "comment_text": "Tony Sirianni Adrian Sirianni Alyssa Sirianni Olivia Sirianni something else to look out for"}, {"username": "Krissy DaRusso", "comment_text": "Glad you trusted your gut."}, {"username": "Josephine Spallina", "comment_text": "Agreed. Glad you went with your gut instinct."}, {"username": "Kelly Mabey Nelson", "comment_text": "Thanks for sharing and also happy you trusted your own intuition"}, {"username": "Farrah Sweetiepie", "comment_text": "Robert Corpuz\nRead this…."}, {"username": "Rhona OConnor", "comment_text": "Well done 👏"}, {"username": "Mario Torre", "comment_text": "So your what’s up account is closed??? Thanks for letting us know, if it happens to me, will just tell them to go to carabinieri office for help."}, {"username": "David King", "comment_text": "Good job!!!!!!\n\nThat’s a great reminder that ANYONE asking to touch/hold/\nborrow your phone is SUSPICIOUS and should be redirected to government officials for help.\n\nAlso, per her story, if her dad was waiting at the bus station and she was waiting at beach then there really was no need for a panicked phone call. The brother would show up and figure it out either way. I would never have sent a WhatsApp message for a stranger."}, {"username": "Shabina Sadiq", "comment_text": "Samara Zahra AmjadLaaibah Amjadread this"}, {"username": "Bunny Brown", "comment_text": "Your gut feeling is always a good thing to trust."}, {"username": "Phyllis Snyder", "comment_text": "Tourist are targeted for scams- best to, while in foreign or unfamiliar areas, to ignore strange people - walk away from people or situations- where strangers approach you to selling or asking for help or giving help or to sign petitions."}, {"username": "Frances Spransy Harper", "comment_text": "Glad you dodged that bullet!"}, {"username": "Paula Julian Peterson", "comment_text": "“Vai via” = “Go away”"}]}, {"id": "2208908732841538", "text": "I would love to stay in a castle in Tuscany. Flying into Florence. Any ideas?", "link": "facebook.com/groups/1373361046396315/permalink/2208908732841538/", "likes": 16, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.kqzyfj.com/\nclick-100692842-\n12291623?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.it\n%2FHotel_Review\n-g616196-d28003\n6-Reviews-Caste\nllo_di_Tornano-\nGaiole_in_Chian\nti_Tuscany.html"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.kqzyfj.com/\nclick-100692842-\n12291623?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.it\n%2FHotel_Review\n-g4359515-d2956\n33-Reviews-Cast\nello_Di_Velona-\nCastelnuovo_del\nl_Abate_Montalc\nino_Tuscany.htm\nl"}, {"username": "Michelle Rovere", "comment_text": "We have booked Castello Delle Serre near Siena - looks gorgeous and the location is perfect for exploring nearby towns in Tuscany and Umbria. We can’t wait!!!"}, {"username": "Costero Home", "comment_text": "Check Airbnb castle listings."}, {"username": "Veronika Bisani", "comment_text": "Castello di Spaltenna"}, {"username": "Enrico Lecce", "comment_text": "Enrico Lecce"}, {"username": "Enrico Lecce", "comment_text": "There so many castle and large Villas that look like castles which you may rent .... enjoy have fun..."}, {"username": "Mat PO", "comment_text": "Castello di Casole and Castiglio Del Bosco."}, {"username": "Janie Osborn Wiltshire", "comment_text": "Castello di Montegufoni"}, {"username": "Craig Rickards", "comment_text": "Gerri Tronc"}, {"username": "Lynn Francisco Casella", "comment_text": "Stay at a z Hilton and visit one"}, {"username": "Kenneth T Williams", "comment_text": "Check our Palazio San Lornenzo\nIn Colle Val de este\nGoing back in Sept for 3rd time\nNeat Castle"}, {"username": "Bridgette Roman", "comment_text": "Castillo de Velona near Montalcino. It’s beautiful and the service is over the top wonderful. Proximity to all that Brunello is pretty good too!"}, {"username": "Tammy Eckert Grooms", "comment_text": "Castillo de Vicarello"}, {"username": "Georgie Diamond Cavallaro", "comment_text": "F"}, {"username": "Maria Theresa", "comment_text": "Castillo Vicchiomaggio in Greve was beautiful and an amazing experience."}, {"username": "Elizabeth Ciara Collen", "comment_text": "F"}, {"username": "Sherika She", "comment_text": "Sherika She"}]}, {"id": "2208906049508473", "text": "Hello!!! I’ve been looking at hop n hop off buses in Rome and there are quite a few options. I’m looking for recommendations of ones that provided all day flexibility.", "link": "facebook.com/groups/1373361046396315/permalink/2208906049508473/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nBig-Bus-Rome-Hop\n-on-Hop-off-Tou\nr/\nd511-39333ROMEHO\nHO?pid=P0007058\n7&mcid=42383&me\ndium=link&mediu\nm_version=selec\ntor"}]}, {"id": "2208903542842057", "text": "Hi all! Recommended restaurants for dinner in Bologna?", "link": "facebook.com/groups/1373361046396315/permalink/2208903542842057/", "likes": 0, "comments": [{"username": "Manuela Bassetti", "comment_text": "“Pane, Vino e San Daniele”, “Trattoria Da Vito”, “Osteria delle Donzelle”, “Ristorante Trattoria Da Sandro Al Navile”"}, {"username": "Scott Perry", "comment_text": "Cocktails at Guero! Tell them Scott sent you."}]}, {"id": "2208900869508991", "text": "Has anyone used TAP. Air Portugal to Italy.", "link": "facebook.com/groups/1373361046396315/permalink/2208900869508991/", "likes": 6, "comments": [{"username": "Suzana Ferreira", "comment_text": "Why do you ask ?"}, {"username": "Geraldo Prioriello", "comment_text": "It’s good"}, {"username": "Rosa Morabito", "comment_text": "Yes. They’re ok."}, {"username": "Joel Fiset", "comment_text": "It’s an airline. Their planes have fuel and wings. You’ll be fine."}, {"username": "Darby Collins", "comment_text": "I just flew TAP to Italy from Miami. No issues during our flights."}, {"username": "Stephen Henn", "comment_text": "The food wasn’t very good. Arrived at FCO 3 hrs before flight as recommended and counter staff didn’t arrive until 90 minutes before departure."}, {"username": "Aaron Loree", "comment_text": "Used them last month. No issues"}, {"username": "Fabio Clemente", "comment_text": "It is awesome"}, {"username": "Paula Schwartz", "comment_text": "We flew from Boston to Portugal on TAP. We had no issues. The counter staff was wonderful. He even helped my daughter put clothes from her suitcase into mine to avoid a weight overage charge. The best part was that we could pick our seats after booking the flight, at no cost. We didn't have to wait until the day before and pay for them. Food wasn't good but Air France was worse."}, {"username": "Marscha Fransisca Debora Basdew", "comment_text": "It's ok. Safe trip 🙏"}, {"username": "Gillian O'Callaghan", "comment_text": "I've just done 3 flights with TAP. Why do you ask?"}, {"username": "Laura Uribe", "comment_text": "We did in 2019. Had no issues and got to upgrade to first class for $700."}, {"username": "Stephanie Smith", "comment_text": "No, nope, never again. We flew Boston to Venice last May and it was the worst experience we ever had, cancelled connection in Lisbon, luggage lost for 5 days, 8 months to get compensation."}, {"username": "Jackie Frosch", "comment_text": "We flew them in April to Florence. No problems, just a bit of a delay in Lisbon before going on to Florence. Not unique to any airline😊"}, {"username": "Laurinda Gray", "comment_text": "We flew last year Miami to Milan, no issues at all!"}, {"username": "Diana Smith", "comment_text": "We did TAP to JFK. No problem!"}, {"username": "Mandie Cowan", "comment_text": "The flight was good. Great actually.\nThey, however, lost our luggage for 10 of our 14 day cruise! TAP Air Portugal has still not reimbursed us. After almost ONE YEAR!! Their customer service is nil, it’s terrible!"}, {"username": "Andrea Marie", "comment_text": "TAP is not my favorite airline, but it gets the job done. Heads up — the in-flight meals seem to have a ton of sodium, so I would suggest bringing something from home."}, {"username": "Sandra Mahany Suchoff", "comment_text": "We used them a few years ago and upgraded our seats and then a few days before we left they switched the plane and we had no seats because the new aircraft was smaller…flew economy and when the seats were reclined we literally couldn’t get out! So claustrophobic.\nIt took over a year for us to receive our refund checks from the upgraded seats."}, {"username": "Ihsan Khrichfa", "comment_text": "Disaster this company after layovers a lot of people didn’t receive the baggage im one of them and long delays during transit"}, {"username": "Susanna Fisch Zysk", "comment_text": "We have flown to Portugal and Spain. No issues. Comfortable."}, {"username": "Manny Patricia Botelho", "comment_text": "We just flew from Boston to Rome and we had no issues"}, {"username": "Valda McMullen", "comment_text": "We flew TAP from lisbon to Florence - absolutely no issues, all went smoothly. Booked on line and picked our seats."}]}, {"id": "2208903479508730", "text": "Where would be the best, most central and cheap place to stay as a base? We’re a couple with a car that want to visit Pompeii, Naples and the Amalfi coast before heading to Rome mid October. I was thinking Sorrento, Salerno or somewhere on the Amalfi coast. Also, would four or five days be enough? Thanks in advance. 😊", "link": "facebook.com/groups/1373361046396315/permalink/2208903479508730/", "likes": 3, "comments": [{"username": "Nicole Gouzoules Sheehan", "comment_text": "Sorrento! We did Pompeii, Capri, Positano and explored Sorrento in five days."}, {"username": "Starla Dawn", "comment_text": "Sorrento is the best"}, {"username": "Amy French Baillie", "comment_text": "Loved sorrento as a base last week 😊"}, {"username": "Miyuki Kanno Paul", "comment_text": "Since you have a car, you have many options. Salerno is a better option for mobility by getting on A3 fast, easy drive to Pompeii Scavi. Much more reasonably priced lodging should be found there in Salerno. Salerno is the end of SS 163 Amalfi Coast drive. I do not recommend driving into Napoli, though. However, you can take a high speed train to Napoli Centrale and have fun for a day.\nAlso someone mentioned that ferry service to certain Amalfi destinations are available"}, {"username": "Andria Saia", "comment_text": "We did 10 days in Sorrento as a home base - had a car and didn’t use it because public transportation is really easy around that region and parking and driving are not 😊"}, {"username": "Kally Trahearn", "comment_text": "Definitely Sorrento - everything is close by. Train for Pompeii and Naples, bus from train station to Positano/\nAmalfi or ferry to Amalfi and ferry to Capri.\n\nAllow one place per day, so you have time to relax and enjoy your surroundings too. If you need a hotel recommendation,\nI can highly recommend Hotel Plaza Sorrento - very reasonably priced, great staff and added bonus of rooftop bar and infinity pool. Also less than 1 min walk to Piazza Tasso and a 5 min walk from the train station.\n\nEnjoy it all. I loved it there and I'm sure you will too."}, {"username": "Nathan Earl Stellenberg", "comment_text": "Sorrento"}]}, {"id": "2208900722842339", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2208900722842339/", "likes": 6, "comments": []}, {"id": "2208899746175770", "text": "My daughter and I are travelling through Tuscany this October and we are going to do two days in Florence and then we're going to rent a car and drive through Tuscany. Any recommendations on small towns to stay and to see? So far we are looking at, Spello and Montalcino. Also any recommendations on places to stop and eat/drink at.", "link": "facebook.com/groups/1373361046396315/permalink/2208899746175770/", "likes": 4, "comments": [{"username": "Dr-Jon Warnecke", "comment_text": "Try this route. Lucca, San Gimignano, Pienza, Siena, Orvieto, Montalcino, Spello, Spoleto, Assisi. The last three, plus Orvieto, are in beautiful Umbria, where more small cities await."}, {"username": "Joanne Wright", "comment_text": "Orvieto for sure!"}, {"username": "Jennifer Ravai", "comment_text": "Thank you I will check out those places. I started doing some research as well. We are going to rent a car. ￼"}, {"username": "Rose Turdo", "comment_text": "Land in Milan, fly out of Rome.\nHow long ?"}, {"username": "Yvonne Hainey Williams", "comment_text": "We are staying in montecatini nit heard too much about it but was recommended to visit ."}, {"username": "Ryan Monahan", "comment_text": "Montepulciano is absolutely beauiful. We REALLY loved the tiny mountaintop town Volpaia and just below it is Radda in Chianti, such a gorgeous town. In fact we drove around Tuscay quite a bit and thought that the area within about 30 miles of Radda in Chianti was exceptionally beautiful. Amazing wineries too, most of them up on hilltops with windy roads up to them."}, {"username": "Jerry Kiger", "comment_text": "I want to do the same thing. Want to enjoy the bigger cities but also drive and enjoy Tuscany and head north Verona - Venice areas too. Interested in the input on this thread"}, {"username": "Miyuki Kanno Paul", "comment_text": "Driving through the Chianti Road is beautiful. We stopped at Panzano and had lunch at world famous Dario Cecchini’s restaurant on our way to Montalcino. We made a day trip to Montepulciano and Pienza. Then we stayed in Orvieto and made a day trip to Civita di Bangnoreggio and Deruta. We returned out car before getting on the train back to Roma. I don’t know where you’ll drop off your rental car. You may want to avoid driving into Roma.\nRick Steves guidebook has great itineraries for driving Toscana’s hilltop towns. You should take a look at it"}, {"username": "Gianna Onesi", "comment_text": "Lucca, Bologna, Montelpulciano"}, {"username": "Brittany Pardue", "comment_text": "Following. Doing the same thing and not finding much input on this either."}, {"username": "Laura Uribe", "comment_text": "Loved Montelpuciano and San Gimignano."}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Arrezzo"}, {"username": "Alicia Cox", "comment_text": "Lucca, Volterre, San Giagminano, Sienna all wonderful!"}, {"username": "Lara Grom", "comment_text": "Bagno Vignoni and bring your bathing suit"}, {"username": "Jan Peter", "comment_text": "Abbey of Sant’Antimo near Montalcino to hear the monks chanting. Look on their website for times. Read the signs in the parking lot, we got booked there. Then Abbazia of Monte Oliveto Maggiore, buy some of the goods they produce, especially the lotions and potions, have lunch at the restaurant in their grounds, admire the frescos depicting the life of Saint Bernard. Check for opening times on their website. Enjoy."}, {"username": "Ike Simoncini", "comment_text": "I will be there for two weeks in september as a foodie i selected 12 restaurants after a month of studying online:) i will test them these restaurants are in the neigbourhood of valdarno if you want to i will tell you wich ones are realy good just send me pm on messenger and i will let you know im there from 6 september to 21th"}]}, {"id": "2208895669509511", "text": "Hello. I have 7 hours between flights in Naples. Can you recommend what can see, how to go from the airport and where can storage luggage? Thank you!\nAlso looking for boat trips from Baja Sardinia and airport transfer from Olbia airport.", "link": "facebook.com/groups/1373361046396315/permalink/2208895669509511/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "follow us https://\nnextstop-italy.c\nom/\nvirtual-tours/\nnaples-royal-pal\nace-caserta/"}, {"username": "Sigrid Cormier", "comment_text": "Google locker storage Naples airport.\nIs that 7 clear hours to sightsee? Have you been to Italy/Naples before?\nThere’s a Castle right in the port. A fabulous Shopping Mall. Do a great walking tour.\nYou can google ferry along the Sorrento Coast.\nJust use google and find what interests you."}, {"username": "Jennette Riches", "comment_text": "There are a lot of variables in your plan. If you are arriving from an international city, you will be required to go through customs in order to leave the airport. If you take a taxi to central Naples or a bus will make a difference between 5 minutes or 30 minutes in each direction. To get your next flight you are required to be at the airport 2 hours prior for domestic and 3 hours prior for international.\n\n7 hour layover\n\n1 hour disembark and customs (if international arrival)\n\n15 minutes to storage luggage\n\n5 (taxi) - 30 (bus) minutes from the airport to Central Naples\n\n5 (taxi) - 30 (bus) minutes from Central Naples to the airport\n\n2 or 3 hours advance arrival at the airport (domestic / international)\n\nThat leaves you 1 hour 45 minutes to 3 hours 30 minutes to sightsee depending on all the variables."}]}, {"id": "2208892202843191", "text": "The narrow streets of Naples with restaurants and bars. These streets are so alive especially in the evening.", "link": "facebook.com/groups/1373361046396315/permalink/2208892202843191/", "likes": 0, "comments": []}, {"id": "2208876072844804", "text": "Hello! Considering our travel options for Florence > Positano in mid September. (Planning to travel one day.) Should we take a train to Naples & take a ferry to Positano? Or rent a car and drive from Florence to Naples & take the ferry? First time to Italy, so weighing out our options! Any advice or tips are helpful :)\n\nSide note, we'll actually be coming from Panzano so if we did the train, we'd need to backtrack back to Florence to get a train. Wondering if a car might be more relaxing even though it'll take longer?", "link": "facebook.com/groups/1373361046396315/permalink/2208876072844804/", "likes": 0, "comments": [{"username": "Karl Cvelbar", "comment_text": "Positano and the Amalfi coast needs more than a couple of hours. You'll get there and be blown away by its beauty. If you can stay longer like a couple of nights you won't regret it. We caught the high speed train from Rome to Naples then the local train which ends at Sorrento. All very doable with public transport. If you're not an extremely confident driver I'd seriously look at trains and buses as it's very well catered for."}]}, {"id": "2208821759516902", "text": "Hello :) do you have any tips for good car rental in Rome please ? :)\n\nThank you for your help", "link": "facebook.com/groups/1373361046396315/permalink/2208821759516902/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "look here for the best offers https://\nwww.discovercars\n.com/\n?a_aid=NextStop-\nItaly consider noleggiare or hertz"}, {"username": "Stephen Henn", "comment_text": "It’s easiest to navigate from the airport out of the city than to rent in Rome proper. Take the Leonardo Express (14€) from Termini to FCO to pick up car. We use AutoEurope.com to find the best deals. You don’t need a car in Rome. Public transport is better to use there."}, {"username": "Miroslava Vyšňanová", "comment_text": "Thank you so much ❤️"}]}, {"id": "2208817072850704", "text": "Just starting to plan a trip for May 2024, but feeling overwhelmed. Hoping to go for 12 days (2 days would be travel days). What cites do you recommend for first time visitors to Italy? We are a family of 4 with two teens.\nDefinitely want to see Rome and Venice. Where else should we go?", "link": "facebook.com/groups/1373361046396315/permalink/2208817072850704/", "likes": 1, "comments": [{"username": "Vicki Kase", "comment_text": "Rent a car and drive to Sorrento, Amalfi Coast, Pompeii, Herculaneum, Mt Vesuvius, Florence, Pisa, Assisi, Naples, take a ferry to Isle of Capri and back to Rome 😁"}]}, {"id": "2208861096179635", "text": "Heading to Milan and Lake Como in September, was wondering is y’all recommend any specific companies for taking the train a day trips to Lake Como?\n\nAlso any recommendations on what to do there would be great and especially good restaurants to try cause I always love trying new places!", "link": "facebook.com/groups/1373361046396315/permalink/2208861096179635/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Lake-Como/\nLake-Como-Day-Tr\nip-from-Milan/\nd26113-2872ZV07?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}]}, {"id": "2208814042851007", "text": "Just in the early thinking/planning stages. We will be traveling with our 7 year old twins. What areas or iteneraries are the most kid friendly? Things to do for the kiddos but also appeal to mama and daddy. Thanks in advance", "link": "facebook.com/groups/1373361046396315/permalink/2208814042851007/", "likes": 0, "comments": [{"username": "Lauren Neely", "comment_text": "We traveled in April 2023 with a 6 and 8 year old and had a marvelous time! 15 days total….Rome (day trip to Pompeii), Venice, Lake Como, Cinque Terre"}]}, {"id": "2208884569510621", "text": "Traveling to Tuscany region in June of 24 with family group of 13. Can anyone recommend particular villas with a minimum of 5 bedrooms and air conditioning? Preferably somewhere you have stayed. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2208884569510621/", "likes": 0, "comments": []}, {"id": "2208877142844697", "text": "Hi everyone! My husband and I will be visiting Rome for the first time the first week of December. We definitely want to go see the Vatican and the Colosseum. Do you guys recommend booking straight from their website or from a 3rd party? I keep hearing 3rd parties, there's always a chance of cancelation. Need all the recommendations as this is our first time visiting Italy, thank you in advance❤️", "link": "facebook.com/groups/1373361046396315/permalink/2208877142844697/", "likes": 0, "comments": []}, {"id": "2208876419511436", "text": "Hi, all. Planning a trip in October for my oldest who graduated college and has moved away. I have airline tickets booked and most hotels. I’m doing a mix of staying on points (thus the locations selected) and staying at boutique hotels. Here is our general itinerary:\nRome 1 night\nPisa or Grotta Giusti Resort (Tuscany) 3 nights\nSorrento 3 nights\nRome 1 night\nBiggest thing keeping me from being able to finalize lodging and activities is transportation. One of our excursions starts in Florence but we want to be on our own the rest of the days there. We also want to check out Cinque Terre area so the car feels necessary.\n\nWe get in at 1300 to Rome after an overnight flight so our initial thought was to stay in Rome for one night then head up to Tuscany. But I’m wondering if that’s going to be a bigger pain than just heading up that same day.\nDo we get the car in Rome and drive up or are we better off taking the train? If we rent a car, is the airport the only option for picking it up?\nIf we get a car for Tuscany can I drop it off there and take the train down to the coast? Or are we better off getting a flight from Florence to the coast?\nThanks in advance and apologies for the basic questions, but I haven’t been to Italy since I was seven. 😆", "link": "facebook.com/groups/1373361046396315/permalink/2208876419511436/", "likes": 1, "comments": [{"username": "Autumn Watson", "comment_text": "We stayed in Rome and explored by foot. Then got a car and drove to Tuscany (Siena & surrounding areas) and dropped it in Florence. Explored there by foot. Took train from Florence to Pisa (with 2 hr layover to walk to the tower) and then took train to Monterosso and stayed there. Can hike or take trains to other towns in Cinque Terre - super easy."}, {"username": "Miyuki Kanno Paul", "comment_text": "Regarding excursion, you can part the group and go on your own. You need to notify the group leader/tour operator at what point/\nlocation you want to leave the tour. Returning to your lodging is your responsibility, by the way.\nRental car. Many rental car agencies are available in Roma throughout the city, especially at Roma Termini station. The most important thing is where you are going to drop off the car. Use Google Map and punch in your desired town of choice and see who has an office there. We usually take train to the furthest we can go before picking up our car. Last time we rented a car in Toscana, we picked up a car when leaving Firenze and returned it in Orvieto, then took a train to Roma.\nFatigue from a long flight should be taken in consideration. We are not a big fan of picking up a car at the airport especially immediately after long journey(we start from LA), so we take a train(rest time for us) as far as we can, then pick up a car if necessary. Italian railroad system is impressively well connected. Unless you are going to the countryside, it is more efficient to take advantage of the fabulous train system. For example, we took a high speed train from Firenze to Bologna and picked up a car there instead of driving from Firenze. I do understand that there are people who only want to drive a car to everywhere and avoid trains at all cost.\nI hope that my experience helps.\nIn the end, you have to decide how you want to execute your plan.\nHappy Planning!"}, {"username": "Piera Angeletti", "comment_text": "Very good tips!! I will agree as native Roman and Italian"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2208875396178205", "text": "Can anyone suggest a good hotel for either Palermo, Cefalù, Taormina, Lipari and Syracuse? I generally like to stay in a central location so that I can walk to attractions, restaurants,etc. TIA.", "link": "facebook.com/groups/1373361046396315/permalink/2208875396178205/", "likes": 0, "comments": []}, {"id": "2208832489515829", "text": "We have 1 morning and lunch time to do a few wineries around Montalcino. There are so many great options! What I’m looking for is a wine tasting with a good view, and bonus points if we can combine one of the wine tastings with a lunch on premise. What recommendations do you have to help me cut down on the many amazing options?", "link": "facebook.com/groups/1373361046396315/permalink/2208832489515829/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Siena/\nBrunello-di-Mont\nalcino-Wine-Tou\nr/\nd944-67309P3?pid\n=P00070587&mcid\n=42383&medium=l\nink&medium_vers\nion=selector"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Siena/\nMontalcino-Brune\nllo-Wine-Tastin\ng-and-Lunch-in-\na-Tuscan-Castle\n/\nd944-116773P73?p\nid=P00070587&mc\nid=42383&medium\n=link&medium_ve\nrsion=selector"}, {"username": "Kelly Barrena", "comment_text": "Thank you! To be clear, I’m not looking for a virtual tour company for the wine tastings. I am just looking for the names of wineries so we can go ourselves."}]}, {"id": "2208831316182613", "text": "Hi! I am looking to do a cooking class in Florence city center and the options are endless! We don’t have much time so I’d like to do 2 hours max, would love to make gnocchi and tiramisu or something of the sort. Any recommendations\n?", "link": "facebook.com/groups/1373361046396315/permalink/2208831316182613/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Florence/\nFlorence-Cooking\n-Class-Learn-Ho\nw-to-Make-Gelat\no-and-Pizza/\nd519-5049ITALY_P\nIZZA?pid=P00070\n587&mcid=42383&\nmedium=link&med\nium_version=sel\nector"}]}, {"id": "2208805672851844", "text": "We would love recommendations for a “private boat tour” of the Amalfi Coast starting in Sorrento. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2208805672851844/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Sorrento/\nPrivate-Amalfi-C\noast-Boat-Tour-\nFrom-Sorrento/\nd947-42612P14?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "Megan Atkinson", "comment_text": "You read my mind! Following 😁😁😁"}]}, {"id": "2208799079519170", "text": "Hi All. What's the best way to get from the Civitavecchia cruise port to Rome? Do we need to book something in advance?", "link": "facebook.com/groups/1373361046396315/permalink/2208799079519170/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nCivitavecchia-Pr\nivate-Transfer-\nCentral-Rome-to\n-Civitavecchia-\nCruise-Port/\nd511-5476ROMHTLP\nRT?pid=P0007058\n7&mcid=42383&me\ndium=link&mediu\nm_version=selec\ntor"}]}, {"id": "2208778569521221", "text": "We are a family of three with a 14 year old son heading to Italy in March 2024.\nWhat area in Rome do you suggest staying?", "link": "facebook.com/groups/1373361046396315/permalink/2208778569521221/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.anrdoezrs.ne\nt/\nclick-100692842-\n12291623?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.it\n%2FHotel_Review\n-g187791-d23613\n4-Reviews-Hotel\n_Abruzzi-Rome_L\nazio.html"}]}, {"id": "2208766859522392", "text": "First time going to Italy!\n\nWe are going on January for 10 days.\n\nFlying into Naples, so far me and my bf talked about Rome, Florence but not sure where else would be worth a visit.\n\nWe talked about Amalfi coast but figured since it’s winter, not a lot of action will be happening. But we also don’t do winter sports. We plan on skipping Milan.\n\nWeआणखी are into museums, really big foodies(not really a big wine drinker or alcohol in general but would have a glass), of course sight seeing.\n\nCan you guys recommend us on where to visit along what to do besides Rome and Florence, and budget friendly restaurants?!", "link": "facebook.com/groups/1373361046396315/permalink/2208766859522392/", "likes": 2, "comments": [{"username": "Scott Perry", "comment_text": "You might be best served by just sticking to those places, with perhaps a side trip (side quest? 😄) every other day or so."}, {"username": "Kristin Goetz Smith", "comment_text": "We are going in February and chose Rome, Florence, Bologna, and Venice 😀"}, {"username": "Karen Schmidt", "comment_text": "We were in Venice in January with a side trip to Verona. It was fantastic!!"}, {"username": "Andrea Arango", "comment_text": "You can do a day trip to tuscany from Florence to have lunch at a winery"}, {"username": "Jennifer Lynn Davis", "comment_text": "Perugia is not too far from Florence."}]}, {"id": "2208764236189321", "text": "Favorite experiences or tours in the following areas:\n\nVenice\nFlorence\nRome\nSorrento\n\nAlso have seen quite a few folks post about electric bike tours….where are those and did you enjoy?\n\nI’ve heard so the Sistine and Vatican tour but skip coliseum tour in Rome. Is Pompeii worth it?", "link": "facebook.com/groups/1373361046396315/permalink/2208764236189321/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Florence/\nFlorence-E-Bike-\nVineyard-Visit/\nd519-64300P3?pid\n=P00070587&mcid\n=42383&medium=l\nink&medium_vers\nion=selector"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nAppian-Way-3-hou\nr-e-Bike-Tour/\nd511-133210P1?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}]}, {"id": "2208759289523149", "text": "The information on this site is great, thank you. Any suggestions for an easy way to get from a hotel in Rome to the port for a cruise with several bags of luggage", "link": "facebook.com/groups/1373361046396315/permalink/2208759289523149/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nCivitavecchia-Pr\nivate-Transfer-\nCentral-Rome-to\n-Civitavecchia-\nCruise-Port/\nd511-5476ROMHTLP\nRT?pid=P0007058\n7&mcid=42383&me\ndium=link&mediu\nm_version=selec\ntor"}]}, {"id": "2208743429524735", "text": "Going to Milan at the end of august for 5 days. Three of those will be spent at Monza for the race. We have two full nonconsecutive days free and partial free days on Friday, Saturday, and Sunday which means we must stay close to the Milan area. Open to suggestions on where to go, what to see, any must try restaurants?! Any full day trips we must try like Lake Como or Venice?", "link": "facebook.com/groups/1373361046396315/permalink/2208743429524735/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Lake-Como/\nLake-Como-Day-Tr\nip-from-Milan/\nd26113-2872ZV07?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Milan/\nTrip-to-Venice-f\nrom-Milan/\nd512-70609P61?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "Tony Gesmundo", "comment_text": "Lake Como a must"}]}, {"id": "2209228539476224", "text": "What is the best way of carrying your phone and cash card around with you, going to Amalfi coast. I would normally just have a small backpack with me, but make sure I have my hand and arm around it when on public transport, or confided spaces. But thinking of taking my running belt, just for my phone and card?? I also have 2 teenagers that will be with me, with their phones! Thinking, a small crossover bag or bum bag?? but make sure they keep their hands on them. Any suggestions please! Thank you!🙏", "link": "facebook.com/groups/1373361046396315/permalink/2209228539476224/", "likes": 4, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\namzn.to/45jpP33"}, {"username": "Stephen Henn", "comment_text": "My wife and daughters liked Travelon crossbody bag. https://\nwww.travelonbags\n.com/\ncross-bags.html"}, {"username": "Kristina Ruk", "comment_text": "You have everything right ;)"}, {"username": "Kay Rendall", "comment_text": "Amalfi Coast very safe, just be careful on crowded bus perhaps. This will be my 9th visit, never heard of anyone being pickpocketed in that area."}, {"username": "Carmela Siniscalchi Frattellone", "comment_text": "My daughter and I both had crossbody bags."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Get lanyards for your phones or small cross body cases."}, {"username": "Michele Levesque Semosky", "comment_text": "I will be bringing my Travelon cross body and purchased a small backpack whose opening is against your back when wearing it as a personal item. Can use both while touring."}, {"username": "Bea Kuckens", "comment_text": "Running belt or similar is perfect."}, {"username": "Bernadette Sarmiento", "comment_text": "Crossbody is the best-I got pacsafe👍"}, {"username": "Alison de Lisle", "comment_text": "We’re here now and it feels very safe. I have been using a cross body bag the whole time in Italy. My daughter (20) also travelled through Italy a month ago with a cross body bag with no problem. It definitely seems to be the bag of choice for most travellers."}]}, {"id": "2209214396144305", "text": "I have purchased Trenitalia tickets from Australia with a Visa card. Is it usual to have a substantial Orthaul.com charge in addition to international transaction fees. If so what is it for?", "link": "facebook.com/groups/1373361046396315/permalink/2209214396144305/", "likes": 2, "comments": [{"username": "Fiona Cameron", "comment_text": "I use PayPal so Im not actually giving Trenitalia my card details. The credit card I use through PayPal doesn’t charge any extra fees… not sure what this is 🤷🏻‍♀️"}, {"username": "Maria O'Callaghan", "comment_text": "I just google it, doesn’t make sense."}, {"username": "Sally Warren", "comment_text": "No. What site did you purchase from?"}, {"username": "Gillian O'Callaghan", "comment_text": "No. I booked train tickets for Italy when in New Zealand using Trainline app. No extra charges to what I'd agreed. Contact your bank."}, {"username": "Cathy Ann", "comment_text": "Looks dodgey"}, {"username": "Jane Wilson", "comment_text": "No. Purchased tickets on Trenitalia website, direct in Australia.\nPaid using PayPal… no extra costs only what we saw and agreed to."}, {"username": "Laura Uribe", "comment_text": "Sounds like you may have used a third party site."}, {"username": "Miyuki Kanno Paul", "comment_text": "It’s a third party entity.\nYou should have purchased your tickets directly from Trenitalia’s official website"}, {"username": "Lisa Reeve", "comment_text": "Nope…I booked tickets direct and got the early bird. Paid then they gave me a refund when they b came available."}, {"username": "Rhona OConnor", "comment_text": "The Trainline app is very good for booking tickets.... No extra charges."}, {"username": "निनावी सहभागी", "comment_text": "Thanks all for your comments, it appears I fell for a scam in my confusion of an initial visa payment rejection and unwillingly joined up to a dating site. They say on the phone they will reimburse me. We’ll see."}, {"username": "Bellafab Fabrizio", "comment_text": "Its an international credit card fee. U need to use a card that charges no fees."}, {"username": "Priya Joan", "comment_text": "No"}, {"username": "Rachel Gray", "comment_text": "Look at Omio for train ticket purchases"}]}, {"id": "2209223419476736", "text": "Hi,\nCan anyone reccomend any bars with good music/ atmosphere in Rome please? 🙂", "link": "facebook.com/groups/1373361046396315/permalink/2209223419476736/", "likes": 0, "comments": []}, {"id": "2209232289475849", "text": "Hi guys,\n\nI’m looking at doing Italy for my 30th and I was wondering what are the best spots with beaches for a solo traveller.\n\nExtra points if the location has coeliac friendly places.", "link": "facebook.com/groups/1373361046396315/permalink/2209232289475849/", "likes": 0, "comments": []}, {"id": "2208890639510014", "text": "Italia Roma", "link": "facebook.com/groups/1373361046396315/permalink/2208890639510014/", "likes": 63, "comments": [{"username": "Nadia Mckenna", "comment_text": "Beautiful photos"}, {"username": "Baruch Lerman", "comment_text": "Thank you ❤❤"}, {"username": "Nicole Gouzoules Sheehan", "comment_text": "Great pictures!!"}, {"username": "Baruch Lerman", "comment_text": "Thank you ❤️"}, {"username": "Wilma Resta", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Diane Hamilton", "comment_text": "Stunning 🇮🇹"}, {"username": "Helen Stokes", "comment_text": "Helen Stokes"}]}, {"id": "2208899716175773", "text": "Please help!!\nTrying to book my ticket under this fare for two of us, Me&you but have no idea under the second passenger what option I need to chose.", "link": "facebook.com/groups/1373361046396315/permalink/2208899716175773/", "likes": 0, "comments": [{"username": "Joe-Linda Po Agustin", "comment_text": "You’re buying round trip first class tickets for 2 with their base price on a high speed train. Is your question about the green button, the choose seats? If you want to choose your own seats, there is an extra fee. If you don’t want to pay that, they will automatically assign the seats for you."}, {"username": "Antonio De Feudis", "comment_text": "There, you should be able to choose the \"me and you\" offer, but i think they already booked all the seats with that offer. I tried to book your same itinerary and the offer is unavailable."}, {"username": "Lisa Roth", "comment_text": "Abbonamenti is a subscription - like monthly pass or whatever. I’m 99.999% certain that’s not what you’re looking for. Just choose base since the other offers look grayed out."}, {"username": "Joe-Linda Po Agustin", "comment_text": "Nadia Nadia, are you sure it’s still available? What I got is this ( for Rome to La Spezia)."}]}, {"id": "2208951346170610", "text": "Pretty much my breakfast lunch and dinner while I’m here 😆", "link": "facebook.com/groups/1373361046396315/permalink/2208951346170610/", "likes": 43, "comments": [{"username": "Nadia Mckenna", "comment_text": "Sounds good to me🤣"}, {"username": "Enas Mourad", "comment_text": "That’s what we’re here for 😂"}, {"username": "Sarit Rolnik", "comment_text": "For me it's always Italian Salad 😄"}, {"username": "Eileen Muro", "comment_text": "And pasta!"}, {"username": "Marcela Trujillo", "comment_text": "Tourist question… are you allowed to taste gelato first like US before you purchase?"}, {"username": "Kathy Pageau", "comment_text": "Mathieu Galvani🤷🏻‍♀️dont need more!"}, {"username": "Manuela Critelli", "comment_text": "Scegli gelati poco colorati e mai gelati che escono troppo dalla vaschetta, la temperatura e il sapore cambiano il gusto e la qualità del gelato! La pizza sembra meravigliosa 😊"}, {"username": "Ralf Eisermann", "comment_text": "Nothing the matter with that. Eat up."}, {"username": "Wilma Resta", "comment_text": "Wilma Resta"}]}, {"id": "2208961799502898", "text": "We miss Italy Sorrento & Rome", "link": "facebook.com/groups/1373361046396315/permalink/2208961799502898/", "likes": 19, "comments": [{"username": "Nicole Gouzoules Sheehan", "comment_text": "We just did the same trip - It was magical."}]}, {"id": "2209004022832009", "text": "Lake Cuomo Milan and Venice , trip of a lifetime best pics of trip and we got it all in in 8 days !\nBellagio - Hotel De Luc ⭐️⭐️⭐️⭐️⭐️\nMilan - Hotel Indigo Milan ⭐️⭐️⭐️⭐️⭐️\nDay trip to Venice from Milan via Italia Rail ⭐️⭐️⭐️⭐️⭐️ took the ferry to San Marco and walked back to the train to see it all !", "link": "facebook.com/groups/1373361046396315/permalink/2209004022832009/", "likes": 31, "comments": [{"username": "Betty Bartlett", "comment_text": "Betty Bartlett"}, {"username": "Patty Barnes", "comment_text": "This looks amazing"}]}, {"id": "2208329879566090", "text": "I have seen many posts about visiting Murano and Burano from Venice. We did it in half a day.. it was nice to adventure out and see other islands. I want to suggest Verona....here are some pics of our visit. आणखी We enjoyed our lil excursion, smd left our \"heart\" up at the Pizzale Castel San Pietro. It was a hike thats for sure but we had already done the climb up to the Dome of St Peter's Basilica and the Duomo in Florence days before so this climb was much easier. I really enjoyed Verona ❤️", "link": "facebook.com/groups/1373361046396315/permalink/2208329879566090/", "likes": 1, "comments": [{"username": "Patsy Luque Mejia", "comment_text": "Did you take the train from Venice to Verona on a day trip?"}, {"username": "Jerry Kiger", "comment_text": "Nice pics looked like fun. Is the knight pics on Verano? Think all pics were just wanted to check I got it right"}, {"username": "Leone Karzon", "comment_text": "Did you mean Verano or Verona?"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2209055696160175", "text": "It finally showed up!", "link": "facebook.com/groups/1373361046396315/permalink/2209055696160175/", "likes": 188, "comments": [{"username": "Lester Smith", "comment_text": "I just go to AAA office to get it done"}, {"username": "Rumon AndFriends", "comment_text": "This worthless piece of paper can be created with a good graphic software and print\n\n30 years ago I had one from a banana republic and back then it was okay to show at traffic stop but not for car rental"}, {"username": "Robin Abrahams Stieff", "comment_text": "You can get one instantly at AAA."}, {"username": "Christopher Davi", "comment_text": "It’s better to have it and not need it, then need it and not have it. Spend the $20 save thousands"}, {"username": "Theresa Kearon Maggiore", "comment_text": "Triple AAA was great. As an AAA member, Walked in , provided necessary ID, paid $20.00, had picture taken and walked out with Permit👍"}, {"username": "Carla Jane", "comment_text": "Darren Bonaccorso Greg Wyllie"}, {"username": "Nancy Surprenant Leclair", "comment_text": "It's not necessary"}, {"username": "Kathleen Lee Iglesias", "comment_text": "You need to have a copy or show it if you rent a car."}, {"username": "Steve Griggs", "comment_text": "Got mine in hand at the\nAAA office in about 20 minutes."}, {"username": "Kimberly Bos", "comment_text": "https://\nit.usembassy.gov\n/\nu-s-citizen-serv\nices/\nlocal-resources-\nof-u-s-citizens\n/\ntransportation-d\nriving/"}, {"username": "David Vickers", "comment_text": "U can obtain one from your local post office. £5."}, {"username": "Jymie Sam Totiel", "comment_text": "Mark Totiel"}, {"username": "Pop Cha", "comment_text": "$20 for a peace of mind.\nIn case you got pulled over and the police refused your state license."}, {"username": "Chas Sim", "comment_text": "Got stopped yesterday in Italy and gave them my New Jersey DL . No issues at all ."}, {"username": "Lidia Kosta", "comment_text": "Need it to be cover for insurance if something was to happen to the car. Insurance company would use it for an excuse not to payout."}, {"username": "Janelle Hanchett", "comment_text": "I think this might be a USA racket. I’ve lived in the EU for four years and have driven in many countries with my American license, rented at least 10 cars, have never heard of the international license even mentioned. Spain, Netherlands, Luxembourg, Italy, France, Germany, Switzerland. No mention anywhere."}, {"username": "Richard Staarkeson", "comment_text": "Some car rental companies in Italy will not give you a car if you don't have the permit."}, {"username": "Tim Russi", "comment_text": "The rental car company didnt even ask.for these."}, {"username": "Theresa Kearon Maggiore", "comment_text": "The international driving permit is basically a “booklet” that transcribes your license information into several languages in the EU areas to make it less complicated for foreign authorities to assure correct information is collected when legal circumstances require it and if unfortunate circumstances arise, it facilitates expedience in resolving translation issues. It’s better to have than have not and makes a nice remembrance souvenir 🤷‍♀️😁"}, {"username": "Jennifer Anne Rootes Holmes", "comment_text": "Just got back from Greece. No international licence was required"}, {"username": "Randi Christiansen Roberts", "comment_text": "I got an International Drivers License in 1969, and I had to take a lengthy written exam for it. Do they still require that?"}, {"username": "John Petri", "comment_text": "Is it needed for the US if you have a Canadian driver license?"}, {"username": "Katherine H. Kim", "comment_text": "Was on line for Avis rental car in Naples airport this June and the person in front of me was asked for the IDP and he showed them a pic of it on his phone but was denied a rental car. Italy is so random that I wouldn’t risk it."}, {"username": "Amalia Cristina", "comment_text": "omg I can't believe how advanced the us is in some things and how behind it is in others, they still have the paper one..."}, {"username": "Anthony Martini Jr.", "comment_text": "Lol\nAAA u get it in 4 minutes"}, {"username": "Victoria Russo", "comment_text": "You are braver than me"}, {"username": "Bill Oakley", "comment_text": "Just got mine too!"}, {"username": "Curtis Sandy", "comment_text": "The 1 one expiration is a scam. The treaty states the IDP is valid for 3 years but AAA only uses a 1 year period."}, {"username": "Winston Bachan", "comment_text": "Should I bring euro or use credit card in Italy?"}, {"username": "Regina Zembrzuski Gendreau", "comment_text": "This isn't stamped right... where is the red stamps? I would go back to AAA and make sure they stamp it correctly"}, {"username": "Angie Hoff-Hess", "comment_text": "My Bend Oregon gives it to me within 30 minutes❤️☕️🇺🇸🇸🇮"}, {"username": "James Farley", "comment_text": "Got in less than 10 minutes @ AAA"}, {"username": "Rachel Collins", "comment_text": "We got our on the spot here in AZ."}, {"username": "Sande Ricci", "comment_text": "We were asked for ours at the rental car office."}, {"username": "Em Marie", "comment_text": "Em Marie"}, {"username": "Stephanie Garofalo", "comment_text": "I always walk out with mine, same day at AAA… good that you got yours"}, {"username": "Sandra Cran", "comment_text": "How long does it usually take to receive this in the mail"}, {"username": "D Rochelle Milton", "comment_text": "Awesome… did they have to mail it to you? I went to AAA and received mine right there, as soon as I renewed the application and they took my photo. I had a month before my membership expired so it was free. $45 w/out AAA membership."}, {"username": "David Horgen", "comment_text": "We rented a car and are in Tuscany right now. Didn't need it to rent the car, but he said if you get pulled over you have to show it. To rent the car they just needed a credit card and driver's license"}, {"username": "Tomas Krivanek", "comment_text": "Fee 20$🤦‍♂️ we pay 3$😛😉"}, {"username": "Joseph DellaFave", "comment_text": "Tammy Lynn Schmitt. Can you get this online?"}, {"username": "Edmarie Saia", "comment_text": "How do you start the process to apply for one?"}, {"username": "Achim Marke", "comment_text": "No picture? 😁"}, {"username": "Ettore de Vita", "comment_text": "Not necessary anymore, you DL is sufficient."}, {"username": "Joe Laricchia", "comment_text": "AAA gives it to you on the spot"}, {"username": "Carole Tarlap", "comment_text": "Google it.....YOU will see the LAW AND FEES if stopped or get in an accident without it💯💥💥 $20-40 is worth it's wait in GOLD!!"}, {"username": "Romina DL Hermanson", "comment_text": "Is this to drive in Europe?"}, {"username": "Jackie Singer", "comment_text": "AAA got mine same day"}, {"username": "Debbi Mayfield", "comment_text": "Why did you have to wait for it to show up? We went to AAA and got it within 30 minutes. Wondering where else you can get one."}, {"username": "Wanda Fernandez", "comment_text": "Interesting. My car rental explicitly mentions that I need it to get the car"}, {"username": "Sara Conley", "comment_text": "That’s the day we pick ours up!"}, {"username": "Maria Gustis", "comment_text": "How and where you can get it?"}, {"username": "Denis Kee", "comment_text": "AAA and you get it when you go apply"}, {"username": "Jessica Stewart", "comment_text": "My husband went today to a local AAA and got it in 20 min"}, {"username": "Angelita Reyes Lara", "comment_text": "You can get it in 10 minutes at AAA ."}, {"username": "Shirley Lewis", "comment_text": "you'll be sorry! 🤣"}, {"username": "Jed Eldredge", "comment_text": "Better have it and not need it than need it and not have it."}, {"username": "Anthony DeSimone", "comment_text": "When zI was there in May some places required it"}, {"username": "Cee Esperance", "comment_text": "Better to be prepared. It doesn't cost much to get one anyway."}, {"username": "Rumon AndFriends", "comment_text": "Why do u need it - any state valid license is okay to rent anywhere, specially in Europe\n\nLast month rented in 3 countries in EU"}, {"username": "Sandra Desmond", "comment_text": "Do you need this if your living outside the EU, just be very careful driving in Italy they drive so fast and crazy, I think I would be too scared to drive over\nHappy holidays 💗"}, {"username": "Bill Shafer", "comment_text": "We get ours on the spot. From our local office."}, {"username": "Yvonne Ormson", "comment_text": "Was it lost?\nWe get ours instantly at our local AMA offices in Canada."}, {"username": "Jason Perash", "comment_text": "You can get this at AAA?"}, {"username": "Denise Ward", "comment_text": "I didn't find out about this until the week before we left for France, but I rented the car and drove the one day anyway. No problems, but next time I will get one to be safe."}, {"username": "Lorissa Gill", "comment_text": "You can get them online"}, {"username": "Keith Crossley", "comment_text": "Comments vary from \"mandatory\" to \"don't really need\". I have a collection of them going back some 25 years... never been asked for it. BUT I'm definitely getting another for my next trip. Consequences for not having it are unacceptable."}, {"username": "Scott Christino", "comment_text": "May god watch over you. 🤣"}]}, {"id": "2209073652825046", "text": "Well flew into Milan yesterday arvo and caught train to Venice.\nPre booked with Omio and worked fine.\nNo sign of any pick pockets since arriving.\nVenice is magnifico!", "link": "facebook.com/groups/1373361046396315/permalink/2209073652825046/", "likes": 2, "comments": []}, {"id": "2209080906157654", "text": "Italia Stresa", "link": "facebook.com/groups/1373361046396315/permalink/2209080906157654/", "likes": 21, "comments": [{"username": "Barbara Judge", "comment_text": "Where is this? Beautiful"}, {"username": "Anita Clayton", "comment_text": "Looks lovely. Was going to tag it on to our Tuscan trip in June but it was showing cloudy weather so we headed home. Maybe next June's trip"}, {"username": "Marg Ryan", "comment_text": "Thanks for sharing"}]}, {"id": "2209093316156413", "text": "Italia Tivoli", "link": "facebook.com/groups/1373361046396315/permalink/2209093316156413/", "likes": 38, "comments": [{"username": "Bev Symes", "comment_text": "Fabulous photos"}, {"username": "Sylvia Martinez", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Baruch Lerman", "comment_text": "Thank you ❤️❤️"}, {"username": "Ana Belen Ayard", "comment_text": "Beautiful scenery"}, {"username": "Fanie Bekker", "comment_text": "Demiche Bekker"}, {"username": "Marg Ryan", "comment_text": "Beautiful photos\nBaruch Lerman is it hard to get there from Rome?"}]}, {"id": "2209103802822031", "text": "Italia Monte Borgeto Italia", "link": "facebook.com/groups/1373361046396315/permalink/2209103802822031/", "likes": 28, "comments": [{"username": "Nadia Mckenna", "comment_text": "Once again… stunning photos"}]}, {"id": "2209112056154539", "text": "Italia Verona", "link": "facebook.com/groups/1373361046396315/permalink/2209112056154539/", "likes": 131, "comments": [{"username": "Tabitha Munderville", "comment_text": "One of my favorite cities! ❤️"}, {"username": "Rosanna Monaghan", "comment_text": "We loved Verona, 🥰🥰"}, {"username": "Marg Ryan", "comment_text": "Looks beautiful, we are heading there late September. Thanks for sharing"}, {"username": "Helen Stokes", "comment_text": "We are there from 3rd September"}, {"username": "Amanda Stewart", "comment_text": "Karen Stewart"}, {"username": "Amanda Jane Worthington", "comment_text": "Beautiful 🇮🇹 ❤️"}, {"username": "Margie Fuller", "comment_text": "Going there in October. 💗"}, {"username": "Agnieszka Mróz", "comment_text": "Agnieszka Mróz"}, {"username": "Agnieszka Mróz", "comment_text": "Agnieszka Mróz"}, {"username": "Agnieszka Mróz", "comment_text": "Agnieszka Mróz"}, {"username": "Nina Halašiová Jaššová", "comment_text": "We were in July🤩, loved that too..."}, {"username": "Liliana Bristman", "comment_text": "Absolutely gorgeous!!! We are going in September! Where are you staying and any suggestions appreciated!"}]}, {"id": "2209125939486484", "text": "Amalfi❤️✨❤️🇮🇹☀️🍋", "link": "facebook.com/groups/1373361046396315/permalink/2209125939486484/", "likes": 2, "comments": []}, {"id": "2209076919491386", "text": "Palermo, Sicily. 🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2209076919491386/", "likes": 59, "comments": []}, {"id": "2209110686154676", "text": "Grand Canal in Venice italy 🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2209110686154676/", "likes": 2, "comments": []}, {"id": "2209181242814287", "text": "Milan fashion capital", "link": "facebook.com/groups/1373361046396315/permalink/2209181242814287/", "likes": 39, "comments": []}, {"id": "2209204149478663", "text": "Italia Cortina", "link": "facebook.com/groups/1373361046396315/permalink/2209204149478663/", "likes": 1, "comments": []}, {"id": "2209208779478200", "text": "Italia Pisa", "link": "facebook.com/groups/1373361046396315/permalink/2209208779478200/", "likes": 55, "comments": [{"username": "Amanda Stewart", "comment_text": "Karen Stewart"}, {"username": "Sorina Niculcea", "comment_text": "Poor horses"}]}, {"id": "2209220309477047", "text": "Italia Lago di Como", "link": "facebook.com/groups/1373361046396315/permalink/2209220309477047/", "likes": 8, "comments": []}, {"id": "2209215789477499", "text": "Hello what is the best shopping area in rome?", "link": "facebook.com/groups/1373361046396315/permalink/2209215789477499/", "likes": 0, "comments": []}, {"id": "2208762216189523", "text": "Hi everyone! We are going to Naples in late June 2024 and planning 1 day trip to Amalfi Coast or Procida. What should we choose?\n\nAbout the day in Amalfi Coast, we hesitate between :\n1. Sorrento (by train) + Amalfi by ferry\n2. Vietri sul mare (by train) + Amalfi (by ferry)", "link": "facebook.com/groups/1373361046396315/permalink/2208762216189523/", "likes": 1, "comments": [{"username": "Jennifer Gustafson", "comment_text": "1 day isn’t enough. Ferry stops running fairly early. There’s so much to see! But if you do get to Amalfi, up the mountain (it’s quite a hike but totally worth it) is the Agricola Fore Porta a beautiful farm to table restaurant where everything is homemade. So wonderful!"}, {"username": "Gayle Moores", "comment_text": "They are both beautiful but I would choose the Amalfi Coast and visit the town of Amalfi. It is the largest town on the Coast and has much to offer.You can visit the Amalfi cathedral,go shopping and have lunch at one of the many restaurants that are in Amalfi.The last ferry to return does leave around 6pm. but at least you will get to see at least one town on the coast.\nFerries leave from the Molo Beverello port in Naples to Amalfi. You can always pre book online next year closer to your date. I recommend this as the Amalfi Coast is popular especially in the Spring and Summer months. This is a beautiful trip by water. Check ferry hopper online for schedules.You can take the train to Sorrento but will then have to take a bus to the towns on the Coast as the train does not run along the Coast.Will take longer to get there.\nAnother way of seeing it is to take a tour of the coast with a tour company if you choose to do that.You can get to Vietri sul Mare from Amalfi by ferry. A 45 minute trip if you choose to go."}, {"username": "Andrea Bergey Lewis", "comment_text": "We just got back and spent a week on the Amalfi coast and also took a day trip to Procida. If you only have a day, I would recommend Procida. Its stunning, less crowded, and almost like you’re stepping back in time. Amazing seafood and people. You can walk everywhere and discover quaint streets and shops or take the FREE bus to get around the island. It’s gorgeous!"}]}, {"id": "2208774149521663", "text": "Ok so still in Rome but wanted to write when it’s fresh\n1. Don’t stay on the Vatican side of the river way more going on the other side\nTotally reccomend out air bn b only 300ft from trevi fountain\nAnd in heartआणखी of everything\nOnly issue is kind of noisy outside\nBut use a white noise ap and ac and your golden\n(Ac works very well and sleeps 7 in three separate rooms proably could do 8-9 if they let you)\n\nFor Vatican booked city walks tour\nGuide was knowledgeable and very smart about navigating Vatican and keeping us in the shade (much better then other tours that were chaotic) I didn’t get his name but he was of Italian and German decent probably in his late 50s and very easy to understand and even made sure we worked in two bathroom stops\n(Before your had incredible porchetta sandwiches at angry pig awesome and filled us up)", "link": "facebook.com/groups/1373361046396315/permalink/2208774149521663/", "likes": 197, "comments": [{"username": "Jen Bies Duffy", "comment_text": "Can you please post the link to the Airbnb? Thanks!"}, {"username": "Jamie Bartolo Shaw", "comment_text": "I actually loved our vrbo near the Vatican! It was a quaint, quiet, true neighborhood and not touristy. We had plenty of cafes and restaurants around us but still could visit the busy tourist areas when we wanted! The city has more to offer than just the well known sites. I’m sure your place is lovely, but there are many perks to venturing outside the tourist spots!"}, {"username": "Vilma Noronha", "comment_text": "We, too, are booked on the Vatican side at Casa Maria Immacolata. A convent turned to a hotel. Hopefully, we will be happy with the choice."}, {"username": "Christine Cassidy", "comment_text": "Good to hear. We will be staying at this place next month."}, {"username": "Nakitha Badon", "comment_text": "We loved all of our Air Bnb too. They were great and exceptionally clean"}, {"username": "Kim AndKids", "comment_text": "Agree about crossing the river. When I traveled there, the manager of the small inn where we stayed was absolutely wonderful, and the walks in the evening were able to be slow, unhurried and so pleasant.\n\nThe manager walked us from the inn to a restaurant a few blocks away and gave us the history of the local buildings as we passed. He was 82 years old, and a delight.\n\nKept turning to me, and with the high notes and tones of, say a Louis Prima, would say \" KIM-ber lee!\" at the start of his statements."}, {"username": "Cheryl Blewitt Slavik", "comment_text": "I loved staying on the Vatican side because it was more like hanging out with the locals. I stayed at the Hearth Hotel and the staff were super friendly. They helped me find a restaurant with authentic Italian food and a tailor to hem some pants. Also the biggest market in Rome is just a block or so from the hotel. Wandered around for an hour or two! This is just one spot inside the market. Fresh pastries. Excellent coffee. Breads. Pizza. Fish. I bought toothpaste and sunscreen- great prices. Lots of different booths"}, {"username": "Graham Sherlock", "comment_text": "Yes Vatican side is good and it is also the trastevere side, too crowded on the other side, loved my daily walk across the river."}, {"username": "Yvonne Ormson", "comment_text": "Trastevere and Vatican areas are perfect. It’s so lovely to be in more authentic and less crowded areas. Trastevere is THE place to eat.\nMuch too noisy and crowded in the tourist area."}, {"username": "Caterina Liquori-Culhane", "comment_text": "Anywhere near the trevi fountain has to be extremely noisy. It is bit of a walk across the river but we were ok with it. If you are nit a walker choose the otherside."}, {"username": "Carmela Downer", "comment_text": "What site did you find this apartment?"}, {"username": "Lucy Suganda-Ho", "comment_text": "Sasha Ho"}, {"username": "Allan Beverley", "comment_text": "Lydia Beverley"}, {"username": "Colleen Kelley", "comment_text": "We like action and people and gelato and drinks. May not be for everyone but definitely enjoyed by us two adults and two teens"}, {"username": "Amy Sullivan", "comment_text": "We much preferred staying away from the busy areas during our stay. It felt more local, real, and relaxing. We did not mind walking further as the weather was perfect in the spring (and we have a teen not younger kids)."}, {"username": "Kevin Ybarra", "comment_text": "Jessica Tully Ybarra"}, {"username": "Raquel Banuelos", "comment_text": "We stayed at an air bnb in trastevere neighborhood and loved it! It had a loft and A/c in each room. Top floor with 2 bathrooms. loved being away from major crowds…and we had so many dinner options."}, {"username": "Anna Maria Freeman", "comment_text": "Oh my gosh, I loved staying by the Vatican. Our apartment was spacious and beautiful. Lots of non tourist shops and a quick bus ride anywhere"}, {"username": "Shannon Uebelhor Fuhs", "comment_text": "I actually very much disagree! We stayed a block from the colosseum one night and then moved across the river to Trastevere area (south of Vatican) and hands down everyone in my family (teen boys) loved this area the best! We were still within a 25 minute walk to ALL the historic sites and Trastevere is “the secret sauce” of Rome - best Italian everywhere you eat, beautiful churches (Santa Maria!) and bridges, most romantic settings, and oh my goodness it comes to life at night as the roads become filled with street cafes and there is a summer festival that stretches for miles along the River. This is where the locals go to hang out and eat. Hate to say it, but if you travel to Rome and miss this, you are kinda missing out on much of the culture. Break away from the tourist spots. We stumbled across it and are so glad we did! We stayed at Hotel Trastevere - reasonably priced, great location and very friendly service."}, {"username": "Carrie Cronin", "comment_text": "Angry pig in Trastavere is awesome!"}, {"username": "Richard Bishop", "comment_text": "We enjoy prati on the Vatican side of the river for folk who like quiet and more residential vs to touristy …59 each his own"}, {"username": "Breeana Wallick", "comment_text": "I actually really liked being 5 minutes away from the Vatican on the other side of the river. 🤷🏻‍♀️ We were able to sneak in a super early walk without waiting in line to get in."}, {"username": "Michael Foster", "comment_text": "You want to stay on right side of river, away from Vatican. In same sentence, you complain about terrible noise. We stayed in great place, 4 blocks from Vatican, spacious & quiet with fantastic patio to enjoy in the evening(yes, outside & no noise)."}, {"username": "Teri Haskins", "comment_text": "We LOVED staying right by the Trevi !!!"}, {"username": "Pamela Gagliani", "comment_text": "This should not be on FB"}, {"username": "Lauren LaDuca", "comment_text": "I have to respectfully disagree. I lived in Rome for a few months in the Trastevere neighborhood (Vatican side of the Tiber River) and personally think it’s the best way to experience Rome. Quiet on some of the streets and more local feeling, but still an easy walk to many sites or you can hop on the tram which will take you all the way to the Vittoriano. Trastevere has tons of shops and restaurants and is really a great place to stay when you visit Rome."}, {"username": "Corinne Scarfo", "comment_text": "We loved staying near the Vatican. It was a 2 minute walk, lots of shops and restaurants. everywhere was easy to walk walk transportation was a 2 minute walk. the price was great for our apartment unit on Borgo Pio. Stayed 2x"}, {"username": "Richard Myburgh", "comment_text": "Prati is a pretty crap neighbourhood for tourists, but Trastevere is gold standard. You can tell too, literally every house is an Airbnb (RIP)"}, {"username": "Wendy Schell", "comment_text": "I am also partial to that location/\ndining (and they host a flea market)."}, {"username": "Mike Bruno", "comment_text": "disagree with #1. We had a wonderful time in April staying in Borgo Pio neighborhood."}, {"username": "Franco Verrilli", "comment_text": "Lisa Foley"}]}, {"id": "2208784352853976", "text": "Venice, bologna, Rome and Sorrento\nWhat are some must that we should do and see while there !?", "link": "facebook.com/groups/1373361046396315/permalink/2208784352853976/", "likes": 6, "comments": [{"username": "Artur Kiełbasiński", "comment_text": "List of little-known places (including free ones) in Rome. Additionally, restaurants (in yellow) Map made in the Google Maps system.\nhttps://\nwww.google.com/\nmaps/d/u/0/\nedit?mid=1mrj_va\ncNAuxfReW9RQQyF\ngd4rX3jhBI&usp=\nsharing"}, {"username": "Rachel Gallacher", "comment_text": "Bagni regina giovanna, ravello, blue grotto - all in/around sorrento x"}, {"username": "Ann Moore-Pak", "comment_text": "Bologna? The food is exquisite. Opera house. University… the square with the huge unfinished church. The town with the covered overhangs so u can shop n not get wet."}, {"username": "Raf Gervasio", "comment_text": "In Bologna you must try authentic bolognese.....b\nut never ask for spaghetti lol"}, {"username": "Peter Heydon", "comment_text": "Award Bologna a capital B?"}, {"username": "John Spensieri", "comment_text": "Everything!!!!"}, {"username": "John Spensieri", "comment_text": "Venice for magical, Bologna for food and Rome for Vatican, pantheon and coliseum, Trevi fountain and ancient ruins!"}]}, {"id": "2208789336186811", "text": "I have purchased the Trenitalia Pass, 7 journeys in 15 days.\n1 - Is this good for 7 days of travel in a 15 day period? As many trains as I want on each day?\n2 - what is included? Do I need a separate ticket for intra city transportation?\n3 - How and when do I activate the pass?\n4 - How and when do I book the \"journeys?\" The pass says at the \"Trenitalia sales channels.\"\n5 - is this pass also good to get me from Naples to Sorrento with a stop in Pompeii?\nI assume this is good for any train on this line, not the private train line.\nAnd is it good for the high speed trains or only ???? trains? and when there at the train stations, is it easy to know which train is which (common sense says if I make it to the right track that I\"ll get on the right train). I heard that the tracks change often, so one should stay near the message board until close to time to get to the train. Any tricks to this? How far out should I make my way to the tracks? I have lots of experience riding metros in different places, but no train experience.\nThanks, I think once I do this once everything will be easy, but trying to have all the facts straight before I get there next month.\nAnd I know these questions have been addressed before, but the information is overwhelming. Is there a simple place to read something? A simple guide?", "link": "facebook.com/groups/1373361046396315/permalink/2208789336186811/", "likes": 1, "comments": [{"username": "Fiona Cameron", "comment_text": "Not sure of the benefit of this “pass” if you still have to book each train before you travel.\nTo be honest, Ive never heard of this type of pass. Did you purchase through Trenitalia website, if so the T&Cs should have come with the pass, in English???\nI have found the website “seat 61” enormously helpful with this stuff. Try there for some answers. 😊"}, {"username": "Shannon Madison", "comment_text": "From what I understood from their website - a journey is a single leg of the trip. There’s more info on their website"}, {"username": "Rhona OConnor", "comment_text": "You bought the pass then look for the information 🤔. I decided against it and used Trainline app to book. It was very easy.\n\nLook at the Board for your train number then the platform will appear about 10 mins before departure. Head straight to the platform and be ready to board when it arrives. All our trains were on time."}, {"username": "Catherine Johnson", "comment_text": "I have previously used the train pass. Normally I had to activate it at the station on the day I was using the pass for the first time. It usually required a visit to the station office with my passport. I could then travel on the network as many times as I liked during its period of validity. Generally I booked my train journeys and seats prior to leaving. It’s about 4 years since I last used them. I now think it’s easier to just book trains as I need them."}, {"username": "Nelle Lee", "comment_text": "Trains generally run on time, and they don't wait on you.\nGo early and be ready to move. Seats fill up fast."}]}, {"id": "2208789906186754", "text": "Hello my posts seem to disappear. Can anyone tell me if they have had issues reserving restaurants with credit card number is it safe to do? Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2208789906186754/", "likes": 0, "comments": [{"username": "Alejandro Gabriel Valenzuela Anghileri", "comment_text": "You don't need credit card number to reserve a restaurant, just call and reserve 🤔"}, {"username": "Colleen Dawson", "comment_text": "Use the app The Fork."}]}, {"id": "2208796956186049", "text": "Just booked our flights to Rome for March 2024. It hasn’t actually hit me yet. I’m excited to finally get to go but nervous at the same time. So much to plan. Been reading a lot on this page of what to do and not to do. Gets a bit overwhelming and confusing. What makes me more nervous is trying to plan our timing so we can figure out where to stay.\nThis is our itinerary but of course I’m sure will change once I sit down and try to figure out our travel time.\nLand in Rome. Because we fly out from Rome, we figure we will stay in Rome the last few days before leaving.\nWe fly in 3/27 and return home 4/10. We will be in Italy Easter weekend which o read is a busy time.\n\nDay 1-So land in Rome. Same day make our way down to Naples… maybe stay that night in Naples.\nDay 2- Naples day to Pompeii evening and stay on Pompei\nDay 3-pompei to Amalfi coast.\nDays 4-5 stay for 2 days?\nDays 6-7 Amalfi coast to Bari. (My ancestors are from Bari) for 2 days\nDays 8-9 Bari to countryside of Tuscany.. forgot the name of the city because I don’t have my paper with me.\nDays 10-11 .. Tuscany city forgotten name to Florence.. day trip to Pisa\nDays 12-14 Florence to Rome.\nLeave out day 14\nAs mentioned, I need to calculate travel time.\nAny suggestions on this visit on planning travel or places to stay? I’m open to redoing itinerary. I also need to check to see what there is to see in Naples and Pompei.\nMy ancestors have a hotel in Naples\nWe are far from being wealthy. My budget is 2600-3400$ which includes hotel, travel and food expenses.\nThanks in Advance 😁", "link": "facebook.com/groups/1373361046396315/permalink/2208796956186049/", "likes": 56, "comments": [{"username": "Kathleen Lunz-Gewirtz", "comment_text": "Air bnb and plan through visit a city.con"}, {"username": "Karen Cotterill", "comment_text": "Looks to be a lot of time on trains or in cars ..I would not plan to go to as many places ..as far apart !"}, {"username": "Colleen Sommerin", "comment_text": "This is way to much in the time you have. You need 2 nights in each town to give you at least one full day. If one full day is enough (I don't think so) then you could maybe manage this itinerary. I would Base yourself in Sorrento for Pompeii and Amalfi coast portion. No need to stay jn Naples. Skip Pisa, spend more time in Tuscany. Visit San Gimignano and Lucca maybe Siena. Check Rometorio to give you some idea of travel times."}, {"username": "Jill Rosenfeld", "comment_text": "Way too much. I don’t think it will feel like a vacation."}, {"username": "Sierra Behrens Tibbetts", "comment_text": "That amount includes airfare?!"}, {"username": "Phyllis Snyder", "comment_text": "Looks fantastic ! Do read up on the new requirements for entry 2024- an ETIAS application might be in effect."}, {"username": "Lori Haines", "comment_text": "We're getting ready to leave for 2 weeks. We did a tour through cosmos."}, {"username": "Ewa Olbrych-Rudzinska", "comment_text": "Skip Pisa for sure . If you are in Bari and only 10 days focus this time on Rome and south which is Amalfi coast plus Bari. See Matera which is amazing . U will be so tired and you will not experience a lot if the list will be all over the place in 10 days . Italy is stunning everywhere. South Amalfi coast is amazing . Rome as well . Bari probably as well . Matera is close to Bari . You will not regret it . Florence is 3/5 day’s minimum. 2 hours from Venice . Combine those two plus Rome for next trip . Do some Rome this time since u fly there . Explore Amalfi coast and Bari and Matera . Next time Rome Florence Venice 🙂 this is my advice just coming from there and 3 weeks were not enough . We are coming back in September"}, {"username": "Joanna Priestley", "comment_text": "Instead of staying in Naples or Pompeii,stay in Sorrento, it’s beautiful and much safer! And this I heard from our driver to the train! Pompeii at night is not a good place! You can get to Pompeii from Sorrento, and Amalfi as well, book a tour or take the train right to Pompeii you can take the ferry to Amalfi for the day from Sorrento, we did this and was a great home base to get to Amalfi and Pompeii , have fun putting your trip together, it’s exciting, You will fall in love with Italy, enjoy all the sites and all the food!"}, {"username": "Rosemary Barbetta", "comment_text": "I would give the Amalfi coast a miss. If your ancestors come from Bari, would you not be more interested in that area\nDay 2…to Pompeii (full day)\nDay 3…explore Naples, it’s interesting.\nDay 4..to Bari. Lots to do and see in Puglia.\n5-7 in Bari\n8…Travel to TUSCANY\nDay 10-11 to Florence\nYou need some time in Rome."}, {"username": "Laura Storie Dolinar", "comment_text": "We’ve booked ours for May2024 so much good advice from this group…trying to make sure we spend time enjoying all the things Italy had to offer to make everyone love it! We’re excited planning!"}, {"username": "Debbie Potter", "comment_text": "Oh wow... Great itinerary. I'm nervous too and trying to figure out the travel logistics there and the timing... its so hard."}, {"username": "Lisa Petricone Cook", "comment_text": "Lisa Petricone Cook"}, {"username": "Alicia Cox", "comment_text": "Is your budget per person? I think you will spend more.\nI would stay in Sorrento & do day trips from there maybe for Pompeii but definitely Amalfi. Otherwise lots of time packing & unpacking. See Florence & Tuscany towns from one central location. Can’t remember where Bari is. Just remember when you calculate travel time - it takes longer than you think it will because part of the time is just figuring everything out whether it’s the trains or other public transport vs if you are driving. Have fun, but SAVE YOUR MONEY bec I’m pretty sure you have under calculated what it will cost."}, {"username": "Starla Dawn", "comment_text": "My two least favourite places on my trip in June was Naples & Pompeii.\n\nMy very favourites were basing out of Sorrento, and Lipari, Sicily.\n\nThen flew to Florence and loved horseback riding in Tuscany. Florence itself wasn’t my favourite but glad I went."}, {"username": "Kristen Damm", "comment_text": "I was in Italy this summer. Our group of 6 spent 3 nights each in Rome, Vernazza, Florence, Tuscany, and Venice. Three nights was perfect. Enough time to see the highlights and not too much time spent moving between places.\n\nMy best advice…pack light! Take half of the clothes you think you need and do laundry. We washed underwear in our sink using laundry sheets. You do not want big luggage on trains.\n\nEnjoy! Italy is amazing. I’ve now been 3 times."}, {"username": "Karen Schmidt", "comment_text": "Fly to Naples, rather than Rome."}, {"username": "Tami Sue", "comment_text": "U don't want to experience Rome? I like staying in naples and taking the ferry to Sorrento."}, {"username": "Janet Desrochers", "comment_text": "So many legit questions. Sounds like you're traveling a lot, but you don't mention if you have tours, etc. planned for each town. If you're going to stay in Pompeii, you should at least see the ancient city. It's pretty amazing. Also, I swear by Tripmasters.com best prices anywhere, and you can customize any aspect of your trip. Also use GRAY LINE TOURS for a perfect experience. But as much as you want to see a much as you can, you need time to rest. I went the last week of March in 2015 and the weather was awesome. A little rainy and chilly sometimes, but only needed a light jacket either way. I'm from New England, btw. Crowds aren't too bad that time of year but if you are going to Rome you should buy skip the line tickets for the larger attractions. Again, Gray Line Tours. Good luck and have a blast!"}, {"username": "Cheryl Kisner Lauer", "comment_text": "We went to Sorrento for eight days in 2009. Great location to do Capri, Pompei, Amalfi coast. Stayed at Grand Hotel de la Ville. Sorrento is a lovely small town with very friendly people"}, {"username": "Guia Taylor", "comment_text": "I say, you do you! The itinerary may seem busy for some, but if it ticks the boxes for you then go for it.\n\nI have a very busy itinerary, but it's because this was going to be our only trip to Italy in our lifetime. It will be very unlikely for us to return so we wanted to see all of it. While it may seem like we're merely site seeing and not immersing ourselves in the experience, our group just doesn't have that luxury.\n\nWe'll be there for 17 days and we've booked all our train tickets, inter city plane tickets and accommodations and we're currently sitting at AUD 1,687.03 for 2 people. This doesn't have our international flights and food yet."}, {"username": "Renee Rundle Stoneham", "comment_text": "Too many stops for just one 1 consolidate down. They way it looks you’ll be constantly moving and checking into hotels etc!\n3 nights minimum in each.\nBase out of Sorrento to see Pompeii and Naples and Amalfi. 4-5 nights\nThen move to Bari for 3 nights… do day trips from there.\nThen head back to see Rome for a few days.\nFrom Bari to Florence is a haul! I’d skip Tuscany this trip and just concentrate on Rome and the South."}, {"username": "Pat Hojnowski", "comment_text": "Try Cosmos tours.\nThey are budget friendly. Our tour guide was exceptional.\nOther suggestion is for you to get brochures from other tour companies.\nThey have varied itineraries that you could follow and varied price points.\nGlobus, Trafalgar, Caravan to name a few.\n\nYour trip is too busy.\nI definitely would stay in Rome at least one night in the beginning of your adventure."}, {"username": "Pat Hojnowski", "comment_text": "How exciting!!\nItinerary looks too busy to me.\nTry picking up brochures from various tour companies to use as a guide.\nCosmos is budget friendly. Our guide was incredible and beautiful. Think blonde Sophia Loren!\nWe went 2 more times on our own.\nItaly is so amazing. Savor each day. Have a rewarding time!"}, {"username": "Lainie Bennett", "comment_text": "I travel to Italy frequently. I'm here now. This is way too ambitious a schedule, even for a seasoned traveler, but you should do whatever works for you. However, I will advise: 1) Most things in Italy come to a screeching halt from Holy Thursday through Easter Monday at a minimum. So do your research carefully.\n2) Many ferry lines to/from the Amalfi Coast do not run all year. They are seasonal. Check schedules carefully if you plan to ferry. Also, be aware that most likely, in early April, weather on the Amalfi Coast is usually not \"beach weather\". What other activities do you have planned on the Coast?"}, {"username": "Christine Ann", "comment_text": "That’s way too much moving around in such a short amount of time"}, {"username": "Helene Smith", "comment_text": "Remember to hire wifi at the airport. That was a great help every time we were there."}, {"username": "Andi Perry Gowin", "comment_text": "We stayed in Bari a few weeks ago. It was our least favorite stop. Suggest staying closer to the beach and Old Bari rather than near the train station.\n\nWe took the train to Polignano a Mare. Loved it there! Much more touristy. And likely more expensive to stay than Bari.\n\nWe were on Capri for 5 days and loved it. But about double the cost for food and housing. But the yacht and people watching was awesome!"}, {"username": "Maja Vidmar", "comment_text": "budget is way too low for my opinion. For two plp for two weeks minimum 5000e and even that is tight"}, {"username": "Nadine HG", "comment_text": "Thank you everyone for your comments, suggestion and helpful advice. Short answer to questions asked. It’s just my husband and I. The budget doesn’t include airfare. I saved up x amount of money and that is what was left after airfare. I’m working 2 jobs just to save and have plenty of time to save more. Suggested budget excluding airfare is 5000$. Ok I can make that happen. I have not booked any tours yet, and wasn’t sure if we should.\nKnowing they many places may be closed around Easter, I’m wondering if I need to move our dates even after we already purchased the tickets. So seems we need to stay in a hotel for multiple days and not just 1 or 2 nights. May have to cut off a destination.\nI’m going to turn off comments for now so I can write down y’all’s(I live in Texas lol) suggestions. Thank you everyone for your helpful tips. 😁"}, {"username": "Laura Uribe", "comment_text": "My personal opinion is there are way too many places. Use Naples as a base for Amalfi coast and Pompeii. Bonus is hopefully your family cuts you a break on hotel. Also, Amalfi coast is super expensive so by day tripping, you save money."}, {"username": "Colita Ellis Wittenkeller", "comment_text": "Too many locations. Pick three. Assume every time you travel to a new place, it’s a full day basically gone."}, {"username": "Mary Anna Machi", "comment_text": "Any chance you can change your flights without significant cost?\nIn to Rome, out of Naples or vice versus would save you considerable time and cost.\nIf not. Consider staying in sorrento as base. Easy train and too many cities/move for two week trip"}, {"username": "Rhona OConnor", "comment_text": "Work out the journey time for each leg. It takes more time than you expect. I traveled in 4 hour train journeys and allowed a day for it because by the time you check out, get to station in time, travel to destination, get to accommodation, check in, basically it takes the day. My second day I did the sights. 3rd day I chilled and wandered around. Next day traveled. That's how I planed. Then I spent a week in Bari 😁"}, {"username": "Mark Deebel", "comment_text": "Sue Shurow Deebel"}, {"username": "Rick Schneider", "comment_text": "Go from Rome directly to Sorrento by train , from Sorrento easy train to Pompeii and Ferries to Amalfi coast and Capri.\nDrive to Matera one night , continue to Puglia and cities you want to visit. Easter events can be fun to see , some crazy...\nAll day long drive to Florence , visit Tuscany etc.\nDrive to Rome , drop off car and visit Rome and its wonderful sights.\nTrain back to Airport.\nHave a great time !"}, {"username": "Bea Kuckens", "comment_text": "Does stated budget include airfare (hopefully not)? Are you renting a car or taking trains? Looks like you might have one night free lodging in Naples? Otherwise, are you planning on hotels or Air B & B's? That's a lot of bopping around. You will feel rushed and by the fifth location you're going to be tired of checking in and out of lodging, packing and unpacking, etc."}, {"username": "Diane Rogers-Gajewski", "comment_text": "We are going to same time!!! We are staying in Sorrento for 3 nights, Rome 3 nights , Tuscany 3 nights and Venice 3 nights! I'm learning a lot from this group also."}, {"username": "Kimberly MacKinnon Cherry", "comment_text": "We are planning to go to Rome, Florence and the Tuscan countryside in March as well, but only 9 days. You might have a bit too much planned? Lots of travel. You might want to eliminate a couple of stops"}, {"username": "Gina Rovello Keenan", "comment_text": "Way to many places, too much time spent moving from town to town. I would base in 3 towns. Get a map and look at your plans. Then look on Rome2Rio to find travel time."}, {"username": "Lucrezia Folger", "comment_text": "Day 1-land in Rome and stay 3 nights. Next: Florence, Capitol of Tuscany, 3 nights, possibly a day trip to Pisa, but not much time, explore Florence.\nTrain to Naples for 2 nights with a morning trip to Pompeii.\non your way to the Amalfi Coast\nAmalfi Coast for 2 days\n2 days in Bari and on the 13th head for a final night in Rome.\nLeave out of Rome on day 14. Another option would be to Not go to the Amalfi Coast this trip, it's a lot of traveling around with many hours of it, wasting time, checking in, checking out, etc. Add those days to be with family in Napoli or explore the Bari area. Amalfi Coast is expensive."}, {"username": "Elaine M Woodward", "comment_text": "Including airfare?"}, {"username": "Nancy Lewis", "comment_text": "Budget seems a bit tight. Depending on any shopping and higher end restaurants.\nWe figure minimum $200 per day per person. Just as a guideline.\nSo 2 people for 14 days is $5600. I know that is on the high end but would be prepared to spend $4-5,000 total.\nAlso agree too many locations. You won’t have any breathing room. Focus on 3 major cities. I personally would do Lake Como not Amalfi.\nRome, Lake Como and Tuscany/\nFlorence."}, {"username": "Jonalee Wilson Stephens", "comment_text": "The ap rometorio is good for planning travel time."}, {"username": "Miyuki Kanno Paul", "comment_text": "When “staying 2 days”, the actual time you will be spending is one full day. You need to factor in your moving/\ntraveling time on departure/\narrival in each town. You will be busy packing and unpacking almost every other day. You’ll lose so much precious time. I can see that you want to cover as many places as you can, but it’s too many places that you won’t be able to enjoy each town. Have a base somewhere and do day trips from there.\nAbout Bari. You mentioned that your ancestors are from Bari. Don’t you want to stay there more than “2 days”? (Because I would love to spend more time with family if I were you)\nYou technically have 13 days to spend. I would recommend that you narrow down to 3 locations and take day trips from each base. For example, if you can stay at your ancestors’ hotel at reasonable rates, Napoli is a great base to visit Pompeii by train and Amalfi coast by ferry. For Toscana, have a base in Firenze. Both trains and buses are well connected."}, {"username": "Barbara Tabor", "comment_text": "I picked itinerary and booked rooms then started planning transportation.\nDiscovered that trans can take a lot of time. And the train fares add up. If you have long travel between destinations, you really only have 1 full day there on a 2 night stay. BTW, we are staying 2 nights in Pompei at a small hotel, only 50 euro per night includes breakfast. We were going to stay in Salerno because its less than half the price of Positano. From Salerno you can take the fe or bus to check out Almafi, Positano, etc. But I already had an apartment on the beach in Nerano Cantone (about 150 per night) for 2 nights, and we can take a local big tour boat for a brief tour of Almafi & Positano (50 euro) so gave up Salerno (added its days to Nerano, Spello & Florence). From Nerano to Spello will take us 8 hours, 1 bus, 4 trains. We are in Italy for 22 nights. IMO your Itinerary is too expansive."}, {"username": "Lyn Pappas Dahm", "comment_text": "I would fly into Rome and take the train directly to Naples. Hotels in Rome will be very expensive because of Easter. As will the Amalfi Coast where many Italians go for Easter Holidays. Naples will be budget friendly. Then use Naples as your base you can take the train to Pompeii and ferry to the Coast. Then take the train from Naples to Bari. Stay in this region because it will be cost effective ( Tuscany is expensive and the countryside is very similar) you will get a unique and really authentic experience. Then take the train to Rome spend a few days then fly home. The itinerary you have planned will cost you 4-5,000. Staying in Puglia will be way less expensive."}, {"username": "Nicole Dunbar", "comment_text": "Why not Rome, Naples, Bari, then go North for Tuscany and Amalfi? I haven’t been there yet but just looking at the map, that would make the most of your time. Wishing you a fabulous trip!"}, {"username": "Dixie Kotylak", "comment_text": "Have the best time ever! Recently returned from a week tour in Italy through Greca travel (carrani tours/grey line) a week in Greece tour, then a week on our own in Italy. I remembered travelling with my mom when she was older (as I am now) and WHEN I’m back in Italy (I loved it SO much❤️🇮🇹❤️…) I will spend more time in one place….definite\nly planning 3-4 days in Florence, 4 days in Rome, 3 days in Tuscany region, and 3 days in Venice. We returned from Greece to Naples, took the bus to Sorrento, stayed one night (I wish it had been longer) then took the boat back to Naples, got to our b&b, hit Pompeii, and the next morning were up at 4am for our flight to Genoa. (I would definitely like to explore Naples for a few days also….In Genoa we took the train to La Spezia where we were staying….then visited two of the 5 Cinque Terre villages….then next day train back to Rome for two days. I had gotten heat stroke in Pompeii, so that killed the end of our adventures in Cinque Terra and Rome sadly….we had planned a night in between CT to go back to Florence but went right to Rome instead. I was just happy to be able to catch my flight home without any sickness issues…..defini\ntely pack Imodium and pepto bismol…if needed it will be easier than searching when not feeling well…anyway now from experience….I definitely will not spend only one night in any place ever again….it’s just too much of a pain to pack up and move on a daily basis…at least for me. Definitely prebook hotels if possible, luckily the person I travelled with had some time share options and that worked out well budget wise, but last minute hotels in July would have been crazy expensive. Have an amazing time!!! ❤️🇮🇹👌🏻👌🏻👌🏻"}, {"username": "Kenly Krag Trigonoplos", "comment_text": "Be aware that Italy is a catholic country and there may be a lot closed for this holiday."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2208799429519135", "text": "This is an odd question,\n\neverytime I travel I like to bring think for the less fortunate. Most of the time kid. Is there notable poverty in rome? París? Palma de mayorca? La Spezia? Barcelona? Madrid? Marseille? Genoa?naples?", "link": "facebook.com/groups/1373361046396315/permalink/2208799429519135/", "likes": 0, "comments": [{"username": "Lucrezia Folger", "comment_text": "Yes, of course, there are poor, especially with all the refugees. You'll see them on the streets if not the camps but you won't see camps unless you go there. Buy them something to eat if you want to do something, Stuff, they don't need."}, {"username": "Ann Lombardi-Perkins", "comment_text": "Yes, there will be refugees and homeless, some beggars. I agree, buy some extra fruits and foods if you'd like. You'll also be helping the small businesses with stalls."}, {"username": "Gillian O'Callaghan", "comment_text": "Yes...there are homeless, impoverished and unwell people in every town and city. I have just finished 5 months travel in 16 countries and sad to see."}, {"username": "Carlotta Crespi", "comment_text": "This is such a patronising post..."}, {"username": "Etschi Bruckner", "comment_text": "there are poor people everywhere - and there are some that just pretend to extract money from tourists, be careful!"}, {"username": "Giovanni Pianigiani", "comment_text": "You better do some research and find a trustworthy organisation in the area you are visiting, and give them some money, if you want to help who really needs. Just giving out money to the first ill-looking beggar you find on the street is likely to foster organised crime"}, {"username": "Melissa Bensink", "comment_text": "So, as lovely as this thought is. And I always encourage people to follow their heart but whether you are at home or travelling, it is almost (barring a failing corrupt government) always better to give to an organization that helps those in need. For example I work in a food pantry in the US. A box of cereal from the grocery store donated to one person helps one person for a few days. A donation of the cost of that cereal can help several people for a week. Organizations can purchase bulk, at discounted prices. Your dollars go further. You help way more people. Systems and organizations can have significant impact as they know the needs of their community, often very well. In the world of poverty...cash is king, and in short supply most places. Just something to consider."}, {"username": "Andrea King Bridges Mills", "comment_text": "Check out the organization Not Just Tourists. They have several locations and help tourists take suitcases full of unused medical supplies to countries and locations that need them. They supply suitcases and supplies, you just check and connect."}]}, {"id": "2208818822850529", "text": "We will be traveling to Italy in near future. We will be taking our blind senior in a wheelchair with mobility issues to visit the home land of her birth. Is it safe in Rome ? Also better trains or domestic flights?", "link": "facebook.com/groups/1373361046396315/permalink/2208818822850529/", "likes": 0, "comments": []}, {"id": "2208821566183588", "text": "Just trying to narrow my trip to one. Amalfi Coast, Cinque Terre or Sicily for a week in April?", "link": "facebook.com/groups/1373361046396315/permalink/2208821566183588/", "likes": 2, "comments": [{"username": "Giu Di", "comment_text": "Better south as April would still be coldish. I would probably suggest Sicily"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Weather would be warmer in Sicily."}, {"username": "Lisa Abrams Argento", "comment_text": "Sicily, I loved it."}, {"username": "Inna Rozen", "comment_text": "Not sure much is open in terms of tours and boats in Amalfi during April"}, {"username": "Carrie Duffy VanderMolen", "comment_text": "Sicily"}, {"username": "Jill Tingley", "comment_text": "Sicily or Amalfi"}]}, {"id": "2208825912849820", "text": "Best app for editing photos-like blocking out ppl etc., extra stuff in pics. Thanks! Doesn’t have to be a free app. I have an iPhone as for reference.", "link": "facebook.com/groups/1373361046396315/permalink/2208825912849820/", "likes": 3, "comments": []}, {"id": "2208828542849557", "text": "Recommendation for a driver/guide to drive us (group of 4) from Florence to Tuscany region for an authentic make a meal and eat it at a local home/farm within an hour from Florence. Suggestions?", "link": "facebook.com/groups/1373361046396315/permalink/2208828542849557/", "likes": 1, "comments": []}, {"id": "2208830399516038", "text": "Hi there! Would love reccomendations for hikes near Corvara that can be done with young kids and a stroller/baby carrier. Ideally 6-8 kilometers with plenty of playgrounds and riffugios along the way 😝", "link": "facebook.com/groups/1373361046396315/permalink/2208830399516038/", "likes": 0, "comments": []}, {"id": "2208831902849221", "text": "When you fly into a country in Europe to transfer to Italy, do you need to go through customs both times or only once? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2208831902849221/", "likes": 5, "comments": [{"username": "Allison Mir", "comment_text": "Yes unless you have an EU passport"}, {"username": "Edoardo Casolo", "comment_text": "If the country un Europe is in the eu then no if it isn’t then yes"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "You go through immigration/\npassport control at your connection and customs at your final destination."}, {"username": "Jim Campbell", "comment_text": "When we flew to Spain we went through Frankfurt Germany and that's where they checked our passports and went through customs. We are kind of bummed that we didn't get a Spanish stamp we got a German stamp and we never stayed in Germany"}, {"username": "Laura Uribe", "comment_text": "If your initial layover is in a Schengen country, then no. When traveling Europe, Schengen countries recognize your immigration stamp from other participating countries."}, {"username": "Patricia Spinney Loranger", "comment_text": "Check with your airline."}, {"username": "Patricia Spinney Loranger", "comment_text": "Check with your airline."}, {"username": "Laura Irmina", "comment_text": "It's not about EU, it's about Schengen area. When you enter/leave Schengen, you go through passport control. Then, when you travel between Schengen countries - you don't."}]}, {"id": "2208832339515844", "text": "I'm trying to purchase tics for the night tour of the Colosseum on Coopculture but am having difficulties. Trying to book for Sept 16th but nothing happens when I click on the date. Any advice??", "link": "facebook.com/groups/1373361046396315/permalink/2208832339515844/", "likes": 2, "comments": [{"username": "Marion Daku", "comment_text": "It’s too early-they are only 30 days out"}, {"username": "Karen Blackmore", "comment_text": "It's usually 30d before but none available for September yet (even dates that are less than 30d away) for the night time tour. They are available for daytime until 6th September. The lunar part of the website says \"to September\". There's another post on this Facebook group about it."}, {"username": "Karen Blackmore", "comment_text": "September dates have just appeared!"}]}, {"id": "2208860312846380", "text": "Hi everyone! Do the colosseum by night tours end in August? I haven’t seen any September dates released on coop culture.", "link": "facebook.com/groups/1373361046396315/permalink/2208860312846380/", "likes": 3, "comments": [{"username": "Karen Blackmore", "comment_text": "They seem to have stopped releasing the night tour tickets. But we went in September last year, so not sure why. I'm wondering if it's something to do with the extra exhibition they currently have. Maybe they are removing this so tickets not available while they change the site details? Day tickets available until 6th September."}, {"username": "Karen Blackmore", "comment_text": "Early September now available!"}]}, {"id": "2208860769513001", "text": "We are leaving for Italy in about a month and the thing I’m most anxious about is knowing which train station I should choose based on where I’m staying. Could anyone give me pointers?\n\nI downloaded the Trenitalia app but am still struggling.\n\nTIA!", "link": "facebook.com/groups/1373361046396315/permalink/2208860769513001/", "likes": 15, "comments": [{"username": "Jeanne Eliason", "comment_text": "Where will you be? When we are in Italy? In the small Tuscan towns we stay at there is only one train station? Do you mean what bin or track to be on?"}, {"username": "Laura Uribe", "comment_text": "I pick the quickest followed by the least expensive. All of their trains are fine. Sometimes you have to stand but it’s all part of the adventure!"}, {"username": "Erin Mitchell", "comment_text": "I had 4 different train apps on my phone. If you know the address of your hotel you can search the closest train station to it and then go from there. You can always get a taxi from the train station as well."}, {"username": "Blanca Gil", "comment_text": "Use Google maps to see the city you are staying in and find the closet train station to your hotel. Usually it will be easy to spot on maps (it’s the one with the most tracks). Check your hotel for directions by train."}, {"username": "Amanda Rogers", "comment_text": "Google Rome to Rio - gives all transport services city to city, town to town. Very accurate - I have just recently returned from UK and Italy and it was perfect for both countries. Don’t be worried about trains very simple to use and well signed for platform directions."}, {"username": "Miyuki Kanno Paul", "comment_text": "Roma’s main station is\nRoma Termini\n\nFirenze\nFirenze S.M.N.\n\nNapoli\nNapoli Centrale\n\nVenezia\nVenezia Santa Lucia\n\nGenova\nGenova Principi\nor\nGenova Brignole\n\nMilano’s main station is\nMilano Centrale"}, {"username": "Pao Magnoler", "comment_text": "Where are you staying?\nIs really easy moving around with trains.\nYou should pick primarily main stations, you would get directly yo the center of the city and it would be easier."}, {"username": "Silvia Arndt", "comment_text": "I also downloaded the Trenitalia app but booked all our high speed trains on my computer as it was easier for me. I realized that you need to know the name of the stations…a quick google search helped with that. I picked all the “main” stations for travel"}, {"username": "Vijay Almeida", "comment_text": "Vijay Almeida"}, {"username": "Alicia Burno", "comment_text": "I am in Rome now and I have to say, you arrive to the terminal go into the office of Italotren or Trenitalia and buy the tickets right there. Very helpful people. That’s how we are doing. We just came back from traveling through the north side, tomorrow heading south and I will buy the tickets when I get to the train station."}, {"username": "Fiona Mac", "comment_text": "Omio app too"}, {"username": "Melanie Fuger-Dolan", "comment_text": "Always best to ask the hotel or Airbnb host."}, {"username": "Angie Hoff-Hess", "comment_text": "I used a Google map and it showed me more easily than train app"}, {"username": "Chelsea Clough", "comment_text": "I just googled what is the closest train station or distance from each train station to what hotel I’m staying at in each city and that’s how I chose the train station. I also like Trainline over Trenitalia app it was more user friendly in my option. Rome2Rio was also an amazing app that allows you type in two destinations and see the different ways to get there and times"}, {"username": "Marianna Ganci Farkas", "comment_text": "Following"}]}, {"id": "2208888402843571", "text": "Staying in Vasto for a week end of September. Ideas for best places to go please. Not beach every day . ThAnkyou in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2208888402843571/", "likes": 1, "comments": []}, {"id": "2199965300402548", "text": "Edit: Just in case this helps anyone else, we visited the Colosseum this week having booked 2 adult tickets. At the entry gate we asked about the children and they told us to collect their tickets from the ticket office inside and put us into a different line so we could walk through to collect them. These were free. I did have to show ID for myआणखी older child to prove he was under 18.\n\nHi, finding conflicting information on children's tickets for the Colosseum. Are children under 18 free? How do I book their ticket on Coop Culture? Doesn't seem to be an option. Thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2199965300402548/", "likes": 1, "comments": [{"username": "Sara Beth", "comment_text": "You need to purchase a free ticket"}, {"username": "Heather Baumann", "comment_text": "It depends on the type of your you get. Free for the regular ole tickets with no guide. Everything else is a reduced cost"}, {"username": "Bethanie Johnson", "comment_text": "I asked an Italian person at work who confirmed that we can pick up the -18 years tickets on arrival at the Colosseum."}]}, {"id": "2208230922909319", "text": "Look what we saw today! Missed it last year and this year we finally found it.\n\nAlthough hidden out of the way, have to say we had unlimited access and got in touching distance to them.\n\nYou need to go toआणखी Arsenal Nord there is a ferry stop and another boat that ferry’s you across, then walk around the buildings and then it’s there.\n\nAmazing! Why it’s so hidden and out of sight, hardly anyone else seeing them which is crazy.\n\nApparently was meant to be on another bridge and then they moved it.\n\nOnly found it because of people on this group. So hope others find it too! Honestly would of expected someone to be on duty security wise and a lot more people visiting but that wasn’t the case!\n\nAmazing!", "link": "facebook.com/groups/1373361046396315/permalink/2208230922909319/", "likes": 445, "comments": [{"username": "Steve Morris", "comment_text": "We found it too"}, {"username": "Janine Hansen", "comment_text": "Helen Granata Margaret Vaughan"}, {"username": "Richelle Trezise", "comment_text": "How long is it up for. Hopefully a while arrive in sept"}, {"username": "Līga Bērziņa", "comment_text": "One week ago i saw it from distance ☺️"}, {"username": "Susan Kelso", "comment_text": "Kim Costelow Lindsay\n‘Building Bridges’\nCalle Seconda de la Fava 2737F Venice"}, {"username": "Kerry Lincoln", "comment_text": "Kylie Lincoln"}, {"username": "Jenny Godfrey", "comment_text": "Jenny Godfrey"}, {"username": "Jenny Godfrey", "comment_text": "Famous artist, seven years ago he had the hands holding up hotel and he had exhibition of his art work in the hotel. Then he did this bridge, for celebration of art and culture, it was meant to bring more people to Venice but some row happened over location of where it’s going and they moved it. We got up close because we went inside the Arsenal they have other stuff on but we just wanted to see this."}, {"username": "Marcella Celini", "comment_text": "Also found in Vieste, Puglia🫶"}, {"username": "Vickie Cotton", "comment_text": "Jan Morin Carr, we might want to find this."}, {"username": "Ddebbie Burnett", "comment_text": "Denise Watson x"}, {"username": "Carrie Swanson", "comment_text": "Which city ?"}, {"username": "Carol Viscusi Mellor", "comment_text": "Went yesterday. Gorgeous."}, {"username": "Livia Ari", "comment_text": "Love this picture ❤️"}, {"username": "Brachi Rosenberg", "comment_text": "Gali Zini Leibovich"}, {"username": "Annette Mallery Auteri", "comment_text": "Samantha Riethmiller"}, {"username": "Eva Salas", "comment_text": "I saw these on a boat ride to Murano. Amazing."}, {"username": "Erica Styan", "comment_text": "I am going on april and need to see these thank you!!!! Love this"}, {"username": "Amanda Stewart", "comment_text": "Karen Stewart are we going anywhere near this in November?"}, {"username": "Shari Lawson", "comment_text": "Michael Minervini"}, {"username": "Makala Watkins", "comment_text": "Ryan Kasek"}, {"username": "John Adams", "comment_text": "Not to sound silly but is this a permanent display? Planning to visit Venice next year."}, {"username": "Kristi Hanley", "comment_text": "Steven Hanley"}, {"username": "Kim Copley", "comment_text": "Is it flooded there atm?"}, {"username": "Milinda Jensen Fortune", "comment_text": "Does everyone know that the artist, Lorenzo Quinn, is the son of actor, Anthony Quinn?"}, {"username": "Nicole Cervantes Hollywood", "comment_text": "Was able to see it from the ferry to Murano"}, {"username": "Meru Barnes", "comment_text": "Victoria Ashley"}, {"username": "Elena Drăgoi", "comment_text": "Looks lovely from close up. We only saw it from a boat on our way to Murano. 🥰"}, {"username": "Lisa Drake Springer", "comment_text": "Thank you!"}, {"username": "Jennifer Benjamin", "comment_text": "Tanya White. We need to look for this!!"}, {"username": "Debi Lomax", "comment_text": "I found this last year but the ferry wasn't running that day so couldn't get close. So pleased you managed to get so close"}, {"username": "Diana Hesse", "comment_text": "So out of character imho"}, {"username": "Mary Lou Gillen", "comment_text": "Wow that is so nice! I wish I had stumbled upon that. What is the meaning of that sculpture? Is that somewhere in Venice?"}, {"username": "Karina Lutz", "comment_text": "Where is this place? I can’t find on google maps"}, {"username": "Judy Carey", "comment_text": "Where is this?"}, {"username": "Kristina Novic", "comment_text": "I saw it back in July when we were on a water taxi from Venice to Burano"}, {"username": "Kathleen Julian Conrad", "comment_text": "Amazing"}, {"username": "Stephanie Earl Peterson", "comment_text": "I took this photo from a distance. I couldn't get closer. I wondered what it was."}, {"username": "Kerri Tobin Hanson", "comment_text": "Found it on Google Maps."}, {"username": "Virginia Speedy", "comment_text": "Wow! Fantastic. I'm glad we didn't go to Venice last year as would've felt sick knowing we missed it!"}, {"username": "Dianne Haffner Zumbrunn", "comment_text": "Terrie Jackle"}, {"username": "Shirley Ann Miller", "comment_text": "Shirley Ann Miller"}, {"username": "Suzanne Theresa", "comment_text": "Daniella Ann"}, {"username": "Sherrin Wake Bracci", "comment_text": "Ellie Bracci can we find this please?"}, {"username": "Carol Taylor Tisdale", "comment_text": "https://\nwww.halcyongalle\nry.com/\nexhibitions/\n9-building-bridg\nes-lorenzo-quin\nn/"}, {"username": "Leanne Ravell", "comment_text": "We need to find these Ricky Price"}, {"username": "Jen Belsito", "comment_text": "I am so glad I stumbled upon this post. We are there on just over a week and would love to find these."}, {"username": "Debbie Freedman Katz", "comment_text": "Thanks I want to see this"}, {"username": "Sha Zzu", "comment_text": "Naz Rajani"}, {"username": "Ewa Olbrych-Rudzinska", "comment_text": "Amazing we missed it . Next time 🙂"}, {"username": "Sherri Haff Benson", "comment_text": "Bill Benson - I want to see these while in Venice. 😍"}, {"username": "Sherri Haff Benson", "comment_text": "Skyler Benson"}, {"username": "Kandace Brown Powell", "comment_text": "Denise Gould"}, {"username": "Kathleen Venezia", "comment_text": "Rosemarie Venezia"}, {"username": "Dianne Parisi", "comment_text": "Dianne Parisi"}, {"username": "Sege Ken", "comment_text": "Nice"}, {"username": "Dave Colleen", "comment_text": "We walked from the train to this definitely off the beaten path. We walked along this building to find it"}, {"username": "Tammy Howell Vest Dukeshire", "comment_text": "I felt like we were somewhere we shouldn’t have been when we finally found it"}, {"username": "Liz Spaeth-Werner", "comment_text": "Very cool!"}, {"username": "Carla Jane", "comment_text": "Darren Bonaccorso I want to see this!"}, {"username": "Patti Porter", "comment_text": "We saw the work from the water on way to murano. Nice you got so up close"}, {"username": "Fermio Xukys", "comment_text": "Nice"}, {"username": "Fermio Xukys", "comment_text": "nice"}]}, {"id": "2208751852857226", "text": "Hi! What is the best choice for cell phone service. Add international to t-mobile service or get a SIM card from Amazon?", "link": "facebook.com/groups/1373361046396315/permalink/2208751852857226/", "likes": 2, "comments": [{"username": "Nicola Amy MacDonald", "comment_text": "I got a vodafone sim from the Rome train terminal downstairs. €20 a month included calls 200gb data. Was fantastic. Called Australia with no issues."}, {"username": "Andrea Bainbridge", "comment_text": "We’ve used T- mobile in Italy, France and Switzerland without paying anything more than our monthly fee. Never have had any problems."}, {"username": "Shawn Galbraith", "comment_text": "T mobile works fine\nWithout adding anything\nUnlimited text\nSufficient data\nCalls. 25 cents/min"}, {"username": "Michele Levesque Semosky", "comment_text": "Depending upon which plan you have with t mobile, you may get data and texting free and calls for .25 per minute. Give them a call or message to find out what you already have in your plan"}, {"username": "Eileen Muro", "comment_text": "We paid for the international plan thru TMobile. $35 for 10 days and that's exactly how long we were there for. It worked great."}, {"username": "Cyndi Riley", "comment_text": "If you haven’t called T-Mobile do so. I have it with my plan already. No extra charge on anything except calls. I’m using WhatsApp for calls."}, {"username": "Jessica Stewart", "comment_text": "Don’t get one T-Mobile has it in your plan"}, {"username": "Carole Moore Howard", "comment_text": "International is included in our TMobile plan. Free Wi-Fi on the plane too."}, {"username": "Mandy Pusateri", "comment_text": "I just called T-Mobile today and I was told that they do cover Italy, a 10 day international call service is $35 for 10 days."}, {"username": "Bill Shafer", "comment_text": "T Mobile Magenta Max plan gives you fee international data and free Wi-Fi on plane. Works great."}, {"username": "Lorraine Swick Sanfilippo", "comment_text": "You can use Facebook messenger or my granddaughter added international when we went to London"}, {"username": "Antonio Aloè", "comment_text": "Get a sim card in Italy they are very cheap,Vodafone,\nTIM etc.."}, {"username": "Kelly Cannon", "comment_text": "Get a local sim from a reputable store when you get where you're going. It shoul give you the best overall service, it will give you the ability to call locally and receive texts and calls easier from guides(they'll appreciate this) and it may actually be the cheapest option."}, {"username": "Sherri Leis Dillavou", "comment_text": "I just used texting. It was free with T-Mobile"}, {"username": "Jose Velez", "comment_text": "T-Mobile has 5Gb and text message for free and you pay a small fee for calls. You can get a package of $35 for 10 days and $50 for 30 days. Since I use the gps a lot, music and calls I use the $50 for 30 days"}, {"username": "Victor Martinez", "comment_text": "T-Mobile is free text and data, talk is .25 per minute. Get the what’s app if you need to talk, it’s free"}]}, {"id": "2208773636188381", "text": "I have been stalking coopculture and it seems odd that colosseum night tours in English nor Italy aren’t showing up for beginning of September. The 30 day mark has passed but the days are not even highlighted red? Any ideas?", "link": "facebook.com/groups/1373361046396315/permalink/2208773636188381/", "likes": 4, "comments": [{"username": "Silvia Arndt", "comment_text": "Maybe sold out? I hear they go quickly"}, {"username": "Marty Harte", "comment_text": "About 3 mos out before trip I booked an evening tour through Viator no probs and it was great. It was a 5-7pm tour. I know it’s now direct through Coop but if you can’t find anything worth a shot. I just got back 2 weeks ago."}, {"username": "Marianne Hendriks", "comment_text": "Available. Maybe remove search history and cookies??"}, {"username": "Alisa Tulande", "comment_text": "I’m wondering the same thing! Am looking to go first week of September but appears it has not opened yet."}, {"username": "Christina Ruckman", "comment_text": "I’ve checked multiple times each day and nothing for September has shown available for night tours. The schedule on the Italian link says they are “to September”…I’m starting to think that means through august and not into September, since they have not been released for the beginning of September."}, {"username": "Gwen Roberts Baker", "comment_text": "I thought it was just me that couldn't figure this out. Now I don't feel so stupid.😁"}, {"username": "Lisa Kelly", "comment_text": "Stuff in that site sells out within seconds. You have to be at the moment they are released. So 7:15am (pacific) if you want 4:15. And you need to practice because they are literally gone in seconds. The day will light up in green when it’s there. You have to constantly reload."}, {"username": "Blanca Gil", "comment_text": "Those dates may be sold out. I had a hard time getting tickets for this past April. I ended up buying tickets on Get Your Guide. Good Luck."}, {"username": "Alison Simon-Ostan", "comment_text": "I am getting the same result for both English and Italian night tours for September. I’ve tried desktop and phone, same results.\nMaybe just keep checking…\nIn Australia it seems to show up at 6:30am Melbourne time."}, {"username": "Gena Kona-Mancini", "comment_text": "I noticed this said \"until September\" so maybe they will either stop or change the hours for September?"}, {"username": "Sierra Behrens Tibbetts", "comment_text": "What is the exact website?"}, {"username": "Kelly A Hodson", "comment_text": "Whenever I manage to find anything available it is a 1 ticket only…\nI want to get the full experience w ticket (arena and underground) on 13th Sept… but everytime I look nothing is ever available for any dates earlier."}, {"username": "Carla Jane", "comment_text": "Darren Bonaccorso"}, {"username": "Sha Zzu", "comment_text": "They are only on Fridays and Saturdays"}, {"username": "Karen Blackmore", "comment_text": "Yes, I had noticed that too. It seems that they may not do the night tours after the end of August. If sold out they are red. If not going to be available, or the date is gone, they are grey. Green (rarely seen) is \"Available, panic, heart racing, try and get into basket, spot photos with bridges and credit card payment\"! The days they don't run (Sun, Mon) have no colour. So I conclude that they have stopped for the winter."}, {"username": "Paola Coppi", "comment_text": "Don't worry: by September if you study hard every day you will be A2/B1 in Italian. Just kidding!"}, {"username": "Jayne Geaney", "comment_text": "Don’t know why they’re not showing up but that’s the opening times on the Coliseum website."}, {"username": "Lucy Casado-Martinez", "comment_text": "Go on get your guide"}, {"username": "Siobhain Welsh", "comment_text": "I managed to get 5 tickets last night but it took monitoring for 9 hours and pre-filled data saved in my browser to get it. Missed them for days before but had it selected filled and payment processing all in under 20secs. You need to be quick and have studied the release patterns because they aren’t always on the exact time 30days before"}, {"username": "Patty Gaskin", "comment_text": "Just curious are there no underground tours on Mondays??"}, {"username": "Patty Gaskin", "comment_text": "Can someone please explain this to me. I selected the time available 22:00 and this popped up. Does this mean it's full? Why say it's available??"}]}, {"id": "2208775522854859", "text": "Ciampini\nDelicious cocktails and right down street from Luis Vuitton and near Spanish steps\nBeautiful cafe to stop for a cocktail and quick slice of pizza in the center of an open area\nThe pizza was best we have had yet and reasonable and the wine and mojito were delicious\nIf you like Campari you would be in heaven ( I don’t)", "link": "facebook.com/groups/1373361046396315/permalink/2208775522854859/", "likes": 0, "comments": []}, {"id": "2208800859518992", "text": "Last night of an amazing 3 week tour of Italy and Slovenia. Started at Bergamo, Venice, Trieste, Ljubljana, Lake Bled, Dolomites, Berano and finally Lake Garda.My poor husband has driven almost 2000 miles . Here are our best pics", "link": "facebook.com/groups/1373361046396315/permalink/2208800859518992/", "likes": 334, "comments": [{"username": "MaryLou Capobianco", "comment_text": "Beautiful pictures"}, {"username": "Judy Dimino Olsen", "comment_text": "Great pics!"}, {"username": "Mona Sidhu Samrari", "comment_text": "Mona Sidhu Samrari"}, {"username": "Pam Lewis", "comment_text": "thanks for sharing"}, {"username": "Megan Leigh", "comment_text": "Lovely photos! Can you tell me more about your itinerary? How long did you stay in each place? We've considered adding Slovenia & Croatia."}, {"username": "Lisa Adams Robertson", "comment_text": "Sounds similar to what we'll be doing in Sept/October, but part of it (Slovenia/\nTrieste areas) will be a small group tour so we can relax and have someone else sweat the details and transportation!\nDoing the Dolomites/\nVerona/Venice on our own (maybe a day trip to Lake Garda)."}, {"username": "Luanne Carey", "comment_text": "Wow - what a trip! Literally. 😄 We are skipping one year of Italy to go to Prague, Vienna and Slovenia in 2024. (Back to Italy for 3 months in 2025 hopefully!) Any recommendations\nfor Slovenia? We're definitely doing Lake Bled and Ljubljana. Where did you stay in Lake Bled?"}, {"username": "Susan Morlan", "comment_text": "What did you think of Trieste? Considering on our upcoming itinerary"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "How wonderful!!"}, {"username": "Joanna Priestley", "comment_text": "Beautiful pics!!!"}, {"username": "Shelley Jacobs", "comment_text": "Beautiful. Janis Laidler Did you have any difficulty with driving that far yourself? Road sign problems etc?"}, {"username": "Wilma Resta", "comment_text": "Wilma Resta"}, {"username": "Betty Bartlett", "comment_text": "Betty Bartlett"}, {"username": "Tracy Foss", "comment_text": "Wonderful pictures looks fantastic!"}, {"username": "Angela Perky Perkins", "comment_text": "Looks wonderful!"}, {"username": "Ruth Mattingly", "comment_text": "Wonderful trip!"}, {"username": "Jono Roland", "comment_text": "Good job to your hubby and what a great trip!🤓"}, {"username": "Boo Choate", "comment_text": "Where did you stay in The Dolomites?"}, {"username": "Maria Pace", "comment_text": "How was the driving. Hubby wants to drive but people say not to🤔"}, {"username": "Natasha MacMillan", "comment_text": "Sounds amazing, what company did you use for your hire car. Thank you 😊"}, {"username": "Barbara Judge", "comment_text": "Are these two countries close to each other? How long did you rent car? Did you see Dolomite’s? Plz post those pics! Your pics are lovely"}, {"username": "Laura Storie Dolinar", "comment_text": "Great pics! We are going to Italy 2024 and planning to spend 4 days at the end of our trip in Slovenia! We are driving from Venice so glad to hear it’s rather easy. Can you tell me where you stayed while near Postojna? That is where my husband’s grandmother was from and we are planning to explore the area."}, {"username": "Debbie Milne Jenkins", "comment_text": "Looks like a great trip!"}, {"username": "Anna Szewc", "comment_text": "Absolutely gorgeous!!!\nWhat was your favorite place?"}, {"username": "Lisa Wylin", "comment_text": "Wow! I want my husband to meet your husband- amazing! Someday I’ll want tip, etc.🥰"}, {"username": "Kerry McNamar", "comment_text": "Great pics. I can almost smell the lagoon (and caffe)."}, {"username": "Jerasol Winstead", "comment_text": "Jerasol Winstead"}, {"username": "Angela Brevetti-Cantone", "comment_text": "Burano and Lake Garda were my favorites!"}, {"username": "Michela Crawford", "comment_text": "Beautiful pics"}, {"username": "Arnie Lagadia", "comment_text": "I like all your pictures thank you for sharing it"}, {"username": "Patricia Chavez", "comment_text": "Absolutely Beautiful Pictures!!\nSounds like a Awesome Vacation!!"}, {"username": "Krista Ford-Walcer", "comment_text": "Looks fabulous!"}, {"username": "Lynette Newman", "comment_text": "Looks awesome!!!"}, {"username": "Randi Beasley", "comment_text": "Where did you stay in Lake Garda and did you love it? Planning on ending my trip there in October. It seems like a good base for tasting some of the wines in that region. Did you do any wine tasting?"}, {"username": "Paula Luca", "comment_text": "Love the pictures ❤️"}]}, {"id": "2208803539518724", "text": "Hello! We have plans to fly into Naples around early morning and go for sorrento right away in mid September. What’s the best form of transportation at that time? Ferry? Train? Hire a driver?", "link": "facebook.com/groups/1373361046396315/permalink/2208803539518724/", "likes": 0, "comments": [{"username": "Ettore de Vita", "comment_text": "After get a taxi to Napoli train station and proceed\nOr , private driver"}, {"username": "Miyuki Kanno Paul", "comment_text": "Taxi or shuttle bus(for fee) to:\n1. Train. Piazza Garibaldi station for Circumvesuviana\nSorrento Line.\n2. Ferry. Molobeverello port to Sorrento."}, {"username": "Ibbu Mohd", "comment_text": "From naples airport take bus or white taxi to beverello port and ferry to sorrento port.\n\nFerryhopper - get this ferry app for all amalfi coast cities.\n\nTaxi to sorrento will cost around $150"}, {"username": "Paula Brink", "comment_text": "https://\nwww.curreriviagg\ni.it/mobile/\nTake this bus right from the airport direct to Sorrento. No need to go into Naples to get train or ferry."}, {"username": "Jenny Payne", "comment_text": "Train🌻"}, {"username": "Amy French Baillie", "comment_text": "Train. Campania express easy - more expensive than circumvesuvia (15 euros instead of 2.60 euros) but more comfortable with luggage"}]}, {"id": "2208805246185220", "text": "Looking for the best winery tours that start from Siena in early October", "link": "facebook.com/groups/1373361046396315/permalink/2208805246185220/", "likes": 0, "comments": [{"username": "Michael Broadwater", "comment_text": "\"Best\" is subjective, you'll get answers here, don't forget to use the search function, and you'll also wanna check out Trip Advisor for ratings"}, {"username": "Jerry Kiger", "comment_text": "Someone just suggested this place website looks nice. Not 100 if this the area you want but maybe good option"}, {"username": "Jerry Kiger", "comment_text": "https://\nwww.montalcinowi\nnetours.com/\n?fbclid=IwAR0Oe1\nrnXkvTebJRzID-z\nv3WgADzVF-bbhux\nRgBayi_47K4xflL\n95HCn468_aem_Ae\nIuNaHvagLR3GrwZ\nVQ3UzsFLsMi3MNB\nKHtoJf2JCrmQqgf\nwIELoScmU2Whuoj\nnUlMg"}]}, {"id": "2208812316184513", "text": "Hello everyone, I (F 37) have just learnt that I have crohn's disease 😞 I was looking forward to eatting my way through Italy and now I am really worried. Please tell me, do they have alot of GF options? Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2208812316184513/", "likes": 1, "comments": [{"username": "Shelley Perelmuth Sperling", "comment_text": "Do you need to be GF ?"}, {"username": "Carmine Napolitano", "comment_text": "My wife has issues and she found the Italian food much easier on her she was sad to come home"}, {"username": "Frances Barnes", "comment_text": "Crohn's doesn't necessarily mean gluten free. It's not diet based, although some foods may cause a flare up.\nI've had Crohn's for almost 10 years and just find it's trial and error as to what foods trigger a flare"}, {"username": "Silvia Aha", "comment_text": "Heaps of GF options available"}, {"username": "Jessica Zolciak", "comment_text": "There are many fruit and vegetable options and I was surprised to see packages labeled GF. Lots of nuts and tons of seafood (I'm not a seafood person). Best of luck."}, {"username": "निनावी सहभागी", "comment_text": "Thank you everyone 💓"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2208815216184223", "text": "Please provide details of water taxis for transfer from Venice train station to Lassidi hotel", "link": "facebook.com/groups/1373361046396315/permalink/2208815216184223/", "likes": 0, "comments": [{"username": "Brian Osman", "comment_text": "Try Google"}, {"username": "Carol Taylor Tisdale", "comment_text": "There are several water taxi services. Yes Google."}, {"username": "Ibbu Mohd", "comment_text": "As u step out from train station, you will see water taxis.\nyou need to tell them address n details of your hotel."}, {"username": "निनावी सहभागी", "comment_text": "Approximate price"}, {"username": "Wendy Wallin", "comment_text": "Anonymous again☹️"}]}, {"id": "2208815866184158", "text": "Starting to plan a 2024 visit to Italy and have some questions....\n1. Could be my only trip to Italy, what are the places and spaces I shouldn't miss?\n2. April or September?\n3. Book a tour or go at it and plan on my own?\n4. Should I try to squeeze in a neighboring area, such as Spain for example?\n5. How long is the ideal trip?\nAppreciate any of your advice and lived experiences.", "link": "facebook.com/groups/1373361046396315/permalink/2208815866184158/", "likes": 10, "comments": [{"username": "Mary Balistreri Swan", "comment_text": "How long are you going for?"}, {"username": "Fetchin Gretchen", "comment_text": "Either April or September. Have 2 to 3 weeks and base in 2 or 3 cities and do day trips from there. I would do base in Florence and Rome or Venice. Side trip to Pompei from Rome. If 3 weeks do also Amalfi Coast based in Sorrento or Lake Como area based in Varenna."}, {"username": "Charleen Siegler Schuss", "comment_text": "What are you into. Checking iconic sights off your bucket list, architecture, art, food people watching, figuring out how other folks solve life's issues, getting to know a country, meeting fellow travelers, meeting folks from the country you are visiting or/and learning a new language, experiencing la vita dolce, or not sure why. Answer those questions and the collective we can help you plan your trip."}, {"username": "Lauren Neely", "comment_text": "We went in 2. April for 5. 14 full days plus travel (so 16 total), to 1. Rome, Venice, Lake Como, and Cinque Terre. 3. We planned and booked everything on our own. It was amazing! Would change nothing. Our budget was $14,000 for 4 people and we traveled with 2 others who shared Airbnb’s with us."}, {"username": "Rose Turdo", "comment_text": "3 / 4 weeks best\nLand in Milan .. Fly out of Rome\nRent a car and don't pre-book anything.\nSpend your nights outside of tourist traps will save you a ton of money.\nMilan to Switzerland across to Lake Como to Venice, through Tuscany to Pisa to Florence.\nShoot down the Almafi Coast. Across to Alberobello, back to Nsples up to Rome for few days before departure.\nIt is plenty of time and if you do not pre-book you can come and go as you please."}, {"username": "Carrie Duffy VanderMolen", "comment_text": "We were in Italy in late Sept of 2017. Flew into Rome from the US. We are not into busy cities. Rented a car in Rome and spent 6 days in Tuscany and then drove to the Amalfi Coast and spent 6 days in Vietri Sul Mar. after realizing not smart to drive around there (except for Ravello) we parked the car and ferried everywhere. Then drove back to Rome and flew home. It was magical! Driving is doable but ill advised and parking was a nightmare. Preferred the smaller towns of Praiano, Māori, and Minori. Fabulous!"}, {"username": "Carrie Duffy VanderMolen", "comment_text": "You do not need to book tours. Stay in a small town on the coast and ferry everywhere. It’s easy (and cheaper). In Tuscany we drove everywhere we wanted to go and it was easy (parking can be an issue)."}, {"username": "Lean Ni Chleirigh", "comment_text": "Go for three weeks. Don’t squeeze in another country. I’d go April for the spring flowers.\nVenice and Rome would be my ‘essential’ items. I’m not into the coastal towns, but the lakes are amazing."}, {"username": "Miyuki Kanno Paul", "comment_text": "What is your interest(s) in Italia? Why do you want to visit there? Ask yourself these questions and start building your only trip to Italia. Have a copy of Rick Steves Italy guidebook. He covers the most popular cities throughout Italia. It’s a survival guide, too. Check his book and find your potential locations. His book also recommends how much time/days you should spend/stay in each town"}, {"username": "Tara Roed", "comment_text": "Not sure your preferences on towns…don’t know your interests. I would say at least a few days in rome as it’s a good hub to fly into and although a big city it is a city unlike others. We were there and amalfi coast end of June and beginning of July. I wasn’t sure I would ever get back either so I planned based on my interests and my kids. I planned it all myself so that we could hit all the places/\nactivities I knew we would personally love. It was a lot of work but worth it and made it more fun…I’m my opinion"}, {"username": "Sande Ricci", "comment_text": "If you want to incorporate another country, spend some days in Genoa. You can take the train from there to Monaco and Nice and spend the night or a few days. We love Genoa and are going back in 2024 for 9 days there."}, {"username": "Lori Haines", "comment_text": "First time do a tour. Check out globus/cosmos."}, {"username": "Lucrezia Folger", "comment_text": "How long is the \"ideal\" trip? The longer the better. 3 months would be perfect, and I saw your photo, you are young, and this will not be your 1st and only trip!! Guarantee it! 1st we all need more details, Sept / Oct better time than April. Since you have a little over a year, you have plenty of time to write out a couple plans based on the number of days, read, learn, ask for opinions, but ultimately make your own decisions and plans. Sounds like you need to start figuring it out 1st, so basically you have an idea of what the different areas and cities are about. What do you like to do? Hike? Nature? Explore the famous sites? Museums, tours, cooking classes.... a lot to start doing your homework 1st."}, {"username": "Annette Brin", "comment_text": "How much time can you stay and in your budget? A month would be really super. April will be less crowded than Sept and prob better pricing. September is more of a shoulder month and still more “ high season.”\nMaybe consider 3-4 different bases for your stay."}, {"username": "Debbie Norris Grigg", "comment_text": "Following!"}, {"username": "Maria Delaney", "comment_text": "Our first trip was a month and it wasn’t long enough so now we are going back for 3 months. If you have 3-4 weeks, I would do the Amalie coast with Ciro la Motta, Taxi Mister Cab Driver-Naples & Amalfi coast-over 3-4 days. Then go up to Rome for a week, Florence for a week, then possibly Venice. You can always take day trip out of Florence. Good luck and most of all enjoy"}, {"username": "Diana Sankara", "comment_text": "Places you shouldn't miss depend on what you're looking for: countryside, metropolis, mountains, etc. Anyway I'd say Rome, Venice and Palermo are worth a visit at least once in a lifetime. September is less busy but still warm. Plan on your own if you're good at researching. Italy is already a handful, l wouldn't add any other country. The ideal vacation is as long as possible: pack smart, dress in layers, comfy wash n wear clothes, dressy is not required."}, {"username": "Deb Eastwood", "comment_text": "Anybody driven in the Dolomites towards end of May, if so, how was the weather generally and were restaurants, activities, cable car etc open"}, {"username": "Kristina Ruk", "comment_text": "Well Italy is a huge country, so first of all decide you want to see historical sites like Roma, Florence..or seaside places. I would recomend definately to see Venice once in a lifetime. What time April or september? As the end if April can be arround +20 (or not) and the begining of September can be quite warm or hot, but the sea water still can be warm enough to swim 😉 how much time you have? You use public transport or a car? As driving to Spain can take time ;)"}, {"username": "Lisa Wylin", "comment_text": "Make life easier! Go on a tour!! Pack your bags and enjoy. They do all the work, you just soak it all in. And you get some free time. I took two different tour with Collette Tours - awesome, worth it!"}, {"username": "Tam Wong", "comment_text": "Don’t worry once you go once it is love at first sight. You will go back . It calls you 🇮🇹🇮🇹"}]}, {"id": "2208816712850740", "text": "Ciao <3 where can I eat dinner/lunch in Sorrento? I need cheap and delicious Caffe/pizzeria/restaurant <3 I stay near the city centre, near the train station <3", "link": "facebook.com/groups/1373361046396315/permalink/2208816712850740/", "likes": 0, "comments": [{"username": "Jules Blumke", "comment_text": "Francos. Just around corner from train station"}, {"username": "Kally Trahearn", "comment_text": "La Cantinaccia del Popolo - not high end but definitely a favourite of the locals. Google it, read the reviews. You will not be disappointed. You can't reserve, so get there early and expect to wait until a table is free for the size of your party.\n\nEnjoy xx"}]}, {"id": "2208819716183773", "text": "Any comments on this property !? Sorrento ! Thx u", "link": "facebook.com/groups/1373361046396315/permalink/2208819716183773/", "likes": 1, "comments": []}, {"id": "2208847206181024", "text": "🙏🏻 Practicing Catholics, ￼very excited to be in Rome on a Sunday. Can someone suggest a great church to go to mass on Sunday morning October 8th? Staying near Piazza Navona.\nThx u 🙏🏻", "link": "facebook.com/groups/1373361046396315/permalink/2208847206181024/", "likes": 29, "comments": [{"username": "Kimberly Pex", "comment_text": "Pantheon"}, {"username": "Lynne Meyer", "comment_text": "Every piazza has a church but we loved mass in the Vatican"}, {"username": "Pauline Bezzina Gatt", "comment_text": "Santa Maria Maggiore"}, {"username": "Maria Straface Campbell", "comment_text": "See if there is a canonization mass then. I went in October 2017 I believe it was the middle of October"}, {"username": "John Borgia", "comment_text": "There’s practically a church on every corner"}, {"username": "Marjie De Villa Lorica", "comment_text": "Basilica of iSanta Maria del Popolo ( at end of Via del Corso) has mass at 5:30 pm ( in Italian) daily.\n\nAlso the Church at the top of Spanish Steps has evening mass.\n\nWe also attended a mass at a (side) chapel at St Peter’s Basilica, 9:30 am. Other times available on their website."}, {"username": "Celeste Germany", "comment_text": "Check the mass schedule at St. Peter’s basilica. We went early on Sunday and we’re able to find a seat. Once in a lifetime experience"}, {"username": "Margie Franzen Springelmeyer", "comment_text": "Nancy Able Noble Karla Kennedy !!!!!!"}, {"username": "Terry Sullivan", "comment_text": "The Vatican"}, {"username": "Maxine Righi", "comment_text": "There's 3 churches on that piazza I be"}, {"username": "Dixie Kotylak", "comment_text": "I went to Santa Maria Maggiore for mass on a Sunday, they do have math and English, but I went to the Italian one, and it was lovely. The church is breathtaking….i\nt is in the train station area in Rome, about three blocks down…. 🙏🏻❤️🙏🏻"}, {"username": "Dixie Kotylak", "comment_text": "Dixie Kotylak"}, {"username": "Gay Bell DiBartolomeo", "comment_text": "There is a Mass at St Peter’s on Sunday mornings, NOT conducted by the Pope. Afterwards the Pope speaks outside in the square."}, {"username": "Shannon Uebelhor Fuhs", "comment_text": "St Peter’s Basilica! We went on Sunday last month. They have Mass every hour and since the museums are closed on Sunday, that is the best day to visit St Peter’s. We were glad we went then. Mass was beautiful and the crowd was a quarter of the size as the next day."}, {"username": "Felicia Bogden", "comment_text": "At St Peter’s Cathedral"}, {"username": "Katie Ewers", "comment_text": "Yes, Sant'Ignazio, Rome"}, {"username": "Chrystal Stevens Bisonet", "comment_text": "This church has an English speaking Mass on Sundays at 9:30"}, {"username": "Jerasol Winstead", "comment_text": "St. Peter’s Basilica"}, {"username": "Lorna Kennedy", "comment_text": "San Silvestro in Capite"}, {"username": "Anna Maria Gatt", "comment_text": "On Sunday you should attend Mass at St Peter's Basilica at 10am. It's a beautiful experience. Everyone is invited. No tickets required."}, {"username": "Simone Clark", "comment_text": "San Giovanni in Laterano"}, {"username": "Cherie Dwyer", "comment_text": "I reccomend also purchasing an Italian/\nEnglish mass booklet- I believe Amazon has them. I have enjoyed many masses in Italy and can follow along but having the translation would be great. I looked briefly in Italy and couldn’t find one"}, {"username": "Valda Walsh", "comment_text": "I have attended English Mass…with a bit of planning, you should have no problem finding what you are looking for.\nThis site is a helpful resource\n\nhttps://\nwww.pnac.org/\nvisitorsoffice/\nsacraments-rome/\nmass-in-rome/"}, {"username": "Maria Magali Giacalone", "comment_text": "You may find a mass in English (if you need) - we went to one near the embassy."}, {"username": "Kevin Troutman", "comment_text": "Debbie Troutman"}, {"username": "Karen Klipple Buron", "comment_text": "Archbasilica DI San Giovanni is the oldest basilica (original papal residence before the Vatican). I don’t know if they hold mass there, but the Sacred Steps (the staircase that Jesus walked up) are located nearby. Both are a must see if you have time https://\nwww.scala-santa.\ncom/en/\nhomepage/"}, {"username": "Nicole Millar", "comment_text": "Marlene Kaiser-Domingue\nz"}, {"username": "Kimberly Mosiniak Seagle", "comment_text": "We went o mass at Pantheon. It was incredible."}, {"username": "Angie Bean", "comment_text": "You can Google English masses in Rome with times and locations if you’d like an English mass to attend"}, {"username": "Georgeann Farinacci Greene", "comment_text": "Any will be amazing to go to. I was able to go to the church my grandparents went to in our town outside of Rome. I felt so connected even though I never knew my grandmother & my grandfather has been gone since I was a teen. Mass was all in Italian, I did pretty well, except when we did prayers & I slipped back in to English. Everyone looked at me & then wanted speak to me after mass. Such a great time!!"}, {"username": "Andrea Corey Andrews", "comment_text": "Vatican go to the Swiss guard station and get tix or Saint John Lantetn"}, {"username": "Larry Dash", "comment_text": "“Santa Maria della Minerva: This 13th-century church from the dominicans lies near the Pantheon and was built on the foundations of a temple for Isis. It is also special since it is the only gothic church in Rome. Left of the main altar, you can see the 'Cristo della Minerva', a famous work by Michelangelo from 1521.”"}, {"username": "Lisa Pirone Kaiser", "comment_text": "All are breathtaking . I think 11am is usually in English but the masses in Italian are beautiful too."}, {"username": "Ana Cristina Amas", "comment_text": "Also be on the lookout for evening rosary processions. Everyone carries a candle and it is very beautiful."}, {"username": "Amy Hanson Garrity", "comment_text": "The Pantheon has mass"}, {"username": "Nina Truong", "comment_text": "F. 😍"}, {"username": "Lisa Rotondi", "comment_text": "Santa Maria in Vallicella (Aka Chiesa Nuova) is very near to Piazza Navona. We attended Sunday Mass there last month. It’s also the resting place of St. Phillip Neri, founder of the Oratory. https://\nen.m.wikipedia.o\nrg/wiki/\nSanta_Maria_in_V\nallicella"}, {"username": "Michael Widjaja", "comment_text": "There are numerous masses in Vatican,ask the guard for the times “a che ora è la messa?”"}, {"username": "Vicki Brozovich", "comment_text": "St Agnus of Anguish\nIs right in the Novona plaza"}, {"username": "Gordon Rose", "comment_text": "Via di Santa Maria dell'Anima\n\nSant'Agnese in Agone is a 17th-century Baroque church in Rome, Italy. It faces onto the Piazza Navona"}, {"username": "Kim Shea", "comment_text": "I’m beyond excited! Thx u all !!!!"}, {"username": "Letty Veronica", "comment_text": "Basilica of Santa Maria in Trastevere is spectacular. It was started in 320 AD and finished around the 1100s. Mass is in Italian but you can follow along if you go to church on a regular basis."}, {"username": "Kurt Tilton", "comment_text": "They are everywhere. If you are there on a Wednesday, that is when the Pope addresses people in St. Peter's Square"}, {"username": "Mary Collins", "comment_text": "If you want Sunday Mass in English you have 2 options: Santo Spirito in Sassia or Saint Patrick’s American parish. Both have been so wonderful every time I have gone."}]}, {"id": "2208856009513477", "text": "We'll be in Florence and Rome end of March. Are there any football stadiums nearby (within a couple hours) that allow tours?", "link": "facebook.com/groups/1373361046396315/permalink/2208856009513477/", "likes": 0, "comments": []}, {"id": "2208872562845155", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2208872562845155/", "likes": 1, "comments": []}, {"id": "2208874116178333", "text": "Italia Nemi", "link": "facebook.com/groups/1373361046396315/permalink/2208874116178333/", "likes": 22, "comments": [{"username": "Ramune Voveruniene", "comment_text": "How long time did you spend in Italy?"}]}]