[{"id": "2198841640514914", "text": "Hi,\n\nHow reliable is Viator to book a tour from Florence?\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2198841640514914/", "likes": 20, "comments": [{"username": "Chris Sylvester Paulson", "comment_text": "Had very good luck with them."}, {"username": "Mary Paron", "comment_text": "We booked a trip to Parma the night before and it was fine."}, {"username": "Dana LaBorde", "comment_text": "Use them all the time!"}, {"username": "Linda Miller", "comment_text": "I'd look into booking direct, Viator is more expensive than booking directly"}, {"username": "Michelle Cotoni", "comment_text": "Used them recently in Sicily for two separate tours and they were on time and fantastic tours!"}, {"username": "Karen Pedersen", "comment_text": "Drama free for me"}, {"username": "Monique Swanner", "comment_text": "I used it for our vespa tour and it was perfect!"}, {"username": "Denise Wester", "comment_text": "I use Viator for all my travels for booking excursions. I love it. Everything is in one place to communicate. You can communicate with the operator through the app I love it have had no problems. Just remember this is not the actual operator they are facilitator for the operators."}, {"username": "Terri Amos", "comment_text": "I have been on Viator tours in France, Verona and Italy (city walking food/wine tours and fat tire tours) without any issues and had a blast!"}, {"username": "Gail Chivallati Kelleher", "comment_text": "I use Viator in US as well as Italy and really like it!"}, {"username": "Susan Vogel", "comment_text": "I used it all through Europe . Book 3 tours and u get 5% off but u need to call them .\nStill using them .\n\nU can also go direct to the museums or sone palaces and book direct"}, {"username": "Marjie De Villa Lorica", "comment_text": "Not in Italy though— but used Viator in Lisbon and in US with no issues."}, {"username": "Lin Amee", "comment_text": "I used Viator when I was in Florence for 6 tours & had no issues."}, {"username": "Lamia Soufny", "comment_text": "Very reliable!"}, {"username": "Favi Godfrey", "comment_text": "of the 5 tours we booked last year during our italy trip only 1 failed, in Rome. had a real hard time getting refunded. otherwise noo glitches w the other 4 tours. impressive, interesting and fun!"}, {"username": "Lori Mongillo", "comment_text": "Amazing! We used it for many different attractions in Florence. Cooking classes, Museums etc…"}, {"username": "Theresa Salerno Adams", "comment_text": "I’ve used them also"}, {"username": "Karyn Shuffler Green", "comment_text": "I love Viator!!"}, {"username": "Michelle Barrette", "comment_text": "Over Easter in Milan had booked way in advance the Dumo tour. They cancelled the night before. I didn’t get the message. Waited fir tour to start and then discovered they were a no show.\nI was horribly disappointed. At that Kate notice in a holiday weekend, no tickets were available. This tour was my main reason to go to Milan.\nDo NOT book Viator. I’ve read on this site about lots of their cancellations."}, {"username": "Joe Kolf", "comment_text": "Used Viator in Ireland, not one bad tour. Using in Italy in October."}, {"username": "Cheryl Zandstra", "comment_text": "We used it for Vatican tour and tour in Florence. Very good sent updates a few days before and reminder and all information the day before. I’m glad I did it"}, {"username": "Susan O'neill", "comment_text": "Andrea Bushe"}, {"username": "Gina Scavetta", "comment_text": "I used viator for 6 tours in italy - they were great 5 stars!"}, {"username": "Heather Hills Jacobs", "comment_text": "We booked with them for Venice and everything went well!!!"}, {"username": "Michael M. Jessup", "comment_text": "We took it from Rome to Pompeii, and it was very good."}, {"username": "Jess Galasso", "comment_text": "I’ve had great luck with their offerings in several countries."}, {"username": "Lisa Gaimaro Sullivan", "comment_text": "No problems at all and great when you need to cancel. Easy and refunded immediately."}, {"username": "Eric Coetzee", "comment_text": "Have used it a lot"}, {"username": "Glenn Todd Webb", "comment_text": "They cancel a lot. I won’t use them. They sell tickets they don’t have."}, {"username": "Gillian O'Callaghan", "comment_text": "I booked 3 activities in Florence (and others) with Viator.....all worked out perfectly."}, {"username": "Lisa Martinson", "comment_text": "Very I’ve never been disappointed."}, {"username": "David Mistick", "comment_text": "I used them recently in Florence and it was great"}, {"username": "Niki Fielding", "comment_text": "I also book through Get Your Guide. They are very good"}, {"username": "Sue Taylor", "comment_text": "Currently on a tour in Tuscany booked through Viator, and have done previous tours in Rome - highly recommend"}, {"username": "Gena Diaco Penland", "comment_text": "We just returned from a 14 day trip and used them for 9 tours! Every one was great with no issues at all!"}, {"username": "Natassa Katsouli", "comment_text": "I use openAI chat GPT to recommend me walking tours with the best sightseeing"}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "We used Viator last week for 2 booking i. Pompeii. Both were excellent!"}, {"username": "Melissa Rego", "comment_text": "I will look on Viator and see the actual tour company name and then I look them up directly to see their reviews. I usually end up booking directly through the company when it’s cheaper and I find a promo code."}, {"username": "Michele Baron Vold", "comment_text": "We have always had good luck."}, {"username": "Mike Conway", "comment_text": "100%"}, {"username": "Nancy Brennan Carrow", "comment_text": "I used Viator in Dublin, Sorrento & Rome with no issues. Totally recommend."}, {"username": "Debra Burroughs Disario", "comment_text": "Very I book from them whenever I travel"}, {"username": "Amanda Pollitt", "comment_text": "Used them in Italy and Poland and we’re fine ."}, {"username": "Lisa Valdovinos", "comment_text": "We used it and it was very reliable."}, {"username": "Melanie Adams", "comment_text": "It’s great!!"}, {"username": "Wendy Takacs", "comment_text": "I use them a lot. They’re great"}, {"username": "Wayne Brown", "comment_text": "💯, always use Viator 👍"}, {"username": "Linda Pitler", "comment_text": "I’ve used them for many tours and have always had good experiences."}, {"username": "Ann Applegarth Veith", "comment_text": "I have used Viator in all major cities in Italy, Albania, North Macedonia and Kosovo. Viator is good as long as your tour is confirmed right away, The tour operator may wait overnight to confirm, so you are in limbo, waiting and you can not make other plans until you hear back on your original booking."}, {"username": "Lori Kearns Cates", "comment_text": "I have used Viator all over the world and have had nothing but good experiences."}, {"username": "Mahalia Agustines", "comment_text": "Jaime Agustines"}, {"username": "Margorie Madrid", "comment_text": "I didn’t had no issues and booked everything with them."}, {"username": "Maureen McCall Bradley", "comment_text": "We booked direct with Walkabout Florence instead."}, {"username": "Cardythe Riggs", "comment_text": "Julie Ouellette my experience was not positive. I booked tour with Viator to Florence. I arrived at train station in Milan expecting to meet with tour guide ( as has been my experience with all other tours). There was no one and a passenger waiting to board train contacted Viator on my behalf. Viator informed me this was a “solo” trip although advertised as “guided”. Basically Viator only booked train ticket and hop-on-hop-off bus on my behalf. I arrived in Florence at 9:00am and train ticket was booked to return at 7:00pm. Therefore, I wasted an entire day in Florence waiting around to board return train to Milan."}, {"username": "Maria Antidormi Corica", "comment_text": "Never had a problem"}, {"username": "Carmen Zervigon Everett", "comment_text": "Used it frequently. Really liked them. Very reliable in Paris and Rome. Great skip the lines too!"}, {"username": "Elaine King", "comment_text": "I've read posts that said they cancel on people at the last moment, book direct!"}, {"username": "Yvonne Carreno", "comment_text": "Very!"}, {"username": "Sue Sherwood", "comment_text": "I used them in Normandy."}, {"username": "Victor Hillary", "comment_text": "I love viator so much ! I used them for many years!"}, {"username": "Rachel Bradfield", "comment_text": "Well I used Viator for trip in Rome and they were good !"}, {"username": "Katie White-Meade", "comment_text": "I have used them and be very cautious. They were not what they promote. I don’t recommend."}, {"username": "Anne Krabbe", "comment_text": "I used them for a tour in Rome and one of the Vatican — everything as advertised. I would use them again."}, {"username": "Cat Furness", "comment_text": "Very"}, {"username": "Leonardo Solorzano", "comment_text": "I use viator for everything and everywhere I go."}, {"username": "Danielle Johnston", "comment_text": "We had no issues"}, {"username": "Dianne Sloan", "comment_text": "Have used them in Europe and New York .. great way to book tours"}, {"username": "Nancy Friend Held", "comment_text": "We used them in both Sicily (Syracusa) and Croatia when we were on a cruise this past June. To be honest I was nervous, however, their tour guides were better than those through our cruise line. We didn’t do an excursion, so to speak, but rather a private tour guide so I can’t speak of booked activities."}, {"username": "Janette YesPlease", "comment_text": "I used Viator and had my prepaid tour canceled a few weeks before our date. I'm still waiting for a full refund and have spoken to them several times. It's been three months, and it hasn't been resolved."}, {"username": "Mia Bella", "comment_text": "I use them all the time all over the world and have never once had an issue"}, {"username": "Melissa Yard-Smith", "comment_text": "I used them for a Tuscany day trip from Florence about two weeks ago - excellent!! Highly recommend."}, {"username": "Tracey Leigh Cope", "comment_text": "These people are absolutely AMAZING...\nI can not recommend them enough honestly so happy with everything 😊\nMy boys and I did a pasta making class and an fiat 500 tour through Tuscany ABSALUTLY AMAZING 🥰 and all the staff where so amazing we were there in May\n\nVia Vinegia 23r, 50122 Florence, Italy\n+39 055 2645746\nwww.walkaboutfl\norence.com"}, {"username": "Cristina LoPiccolo-Ciaravino", "comment_text": "One tour guide was excellent for colosseum, very knowledgeable, the other we booked was a driver we booked for 4 hours who was very nice but we actually needed to tell him where to go. He gave no suggestions. He was very nice and It worked out but definitely not as advertised."}, {"username": "Maria Musumeci", "comment_text": "We used Viator & Get Your Guide for all our tours & tickets throughout our 4week Italy trip including Florence. No issues at all. Perfect service from everyone. Everything was spot on, made for a fabulous trip 😍"}, {"username": "Donna Sweet", "comment_text": "I’ve had good experiences with some Viator tours."}, {"username": "James Carr", "comment_text": "Keep in mind Viator is a platform for tours, same as Airbnb is a platform for places to stay. As such, quality may vary tremendously."}, {"username": "Lynnelle Richardson", "comment_text": "We booked two viators tours from Florence and were very happy. Booked the night before departure, no problems at all."}, {"username": "Jen Yanda", "comment_text": "Worked great for us."}, {"username": "Benita Long", "comment_text": "I recommend Viator for sure"}, {"username": "Chris Brown", "comment_text": "Had great results! Everything ran on time for a group of 11"}]}, {"id": "2198843270514751", "text": "What is official web page for buying colosseum and Vatican tickets?", "link": "facebook.com/groups/1373361046396315/permalink/2198843270514751/", "likes": 16, "comments": [{"username": "Linda Snaring", "comment_text": "I recommend you buy a book called Rick Steves travels for Rome or the Italy book. He will tell you in his book. He will also tell you secrets about buying the tickets and secret gates to go in that are not the busy ones.￼"}, {"username": "Bing Robertson", "comment_text": "https://\nwww.coopculture.\nit/en/tickets/"}, {"username": "Jeff McLellan", "comment_text": "Here is the link for Vatican - if you can’t see availability for the day you want it might not be released or it is sold out. Highly recommend the Prime tour with breakfast before or VIP Prime which we did with breakfast before. For ten minutes we were the only people in the Sistine Chapel other than our guide (who was amazing) and the guards.\n\nhttps://\nm.museivaticani.\nva/content/\nmuseivaticani-mo\nbile/en/\norganizza-visita\n/\ntariffe-e-biglie\ntti.html"}, {"username": "Tricia Loftus-Carron", "comment_text": "Buy from Get Your Guide Download the app it’s AMAZING!!"}, {"username": "Luisa Castellano", "comment_text": "I use Viator or Klook"}, {"username": "Karen Marie", "comment_text": "GetYourGuide"}, {"username": "Lynn Clemens", "comment_text": "Mark Clemens"}, {"username": "Hope Stamback", "comment_text": "We just used Get your Guide and could not recommend it more highly. We had a dedicated entrance that skipped allllll of the lines. We used their audio guide and it was great."}, {"username": "Lesley Stewart-D'Ortenzio", "comment_text": "Go on Viator.com they have lots of tours. Just type in Rome tours -a large selection will come up"}, {"username": "Gina Miano Polizzotto", "comment_text": "I’ve bought all my Italy tours through viator. They are great"}, {"username": "Suzie Safko", "comment_text": "Do NOT book anything from Love In Italy Tours as they are a scam."}, {"username": "Cristina Maximciuc", "comment_text": "Read the question without last word 😂\nSorry, I found it very funny."}, {"username": "Iman Nazaran", "comment_text": "Following"}, {"username": "Bill Elias", "comment_text": "Back in the day you could simply walk up to the booth at the Roman Forum and buy a combination ticket that included the Colosseum - which allowed you to skip the very long Colosseum lines.\n\nDoes that not work any longer? It’s been a while."}, {"username": "Adele Badalamenti", "comment_text": "As I understand …Vatican tics can be purchased 60 days out and Colosseum tics 30 days out."}, {"username": "Hilary Pickett", "comment_text": "Get Your Guide - it’s great 😊"}]}, {"id": "2198846503847761", "text": "We are travelling in September on a cruise that leaves from Venice - however, the cruise actually leaves from Ravenna, a few hours south of Venice. We plan to arrive a few days early to spend some time in Italy - I was hoping someone in the group would have suggestions for travel from Marco Polo airport down to our base in Ravenna? We prefer not to rent a car. Thanks in advance for any tips.", "link": "facebook.com/groups/1373361046396315/permalink/2198846503847761/", "likes": 0, "comments": [{"username": "Amy Dreise", "comment_text": "We took the train."}, {"username": "Khushi Khanna", "comment_text": "Ravenna has amazing Byzantine murals on the churches. Enjoy"}]}, {"id": "2198850140514064", "text": "First time posting: Milan Advice Needed!!!\n\nStarting our first trip to Italy in Milan for a day and a half. Want to stay in the center of the city so we can walk to the \"must see's\" and also the shopping area. Does anyone have recommendations on a hotel that's in the center and/or amazing place for nice dinner? Thank you in advance! 💕", "link": "facebook.com/groups/1373361046396315/permalink/2198850140514064/", "likes": 0, "comments": [{"username": "Virgz Van Møøre", "comment_text": "Hotel Gran Duca di York"}, {"username": "Whitney Meyers", "comment_text": "Crazy pizza Milan is great for dinner, make sure you go to top of cathedral the lift helps. Also riding a lime bike around exploring all its hidden gems is perfect! Milan is my favorite"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187849-d2417\n960-Reviews-Cha\nteau_Monfort-Mi\nlan_Lombardy.ht\nml"}]}, {"id": "2198855817180163", "text": "Looking for Recommended hotels in Florence, Rome, Milan for solo woman traveler. Looking for central location and walking distance to restaurants and sites. Able to walk back to hotel in evening in a safe area with lots of people traffic. Midrange cost.", "link": "facebook.com/groups/1373361046396315/permalink/2198855817180163/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.tkq/ lhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187849-d2417\n960-Reviews-Cha\nteau_Monfort-Mi\nlan_Lombardy.ht\nml"}]}, {"id": "2198862173846194", "text": "Recommendations for reasonable in Lake como 3 nights at the end of September ?? Like charming and good restaurants, some history….easy access to the lake. For my husband and I. Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2198862173846194/", "likes": 0, "comments": [{"username": "Virgz Van Møøre", "comment_text": "Alessia's place in Como City"}, {"username": "Renae Larcus", "comment_text": "Varenna. Albergo Milano"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.dpbolvw.net/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187837-d3103\n41-Reviews-Albe\nrgo_Milano-Vare\nnna_Lake_Como_L\nombardy.html"}]}, {"id": "2198870770512001", "text": "POSITANO VS MATERA\n\nI have time for one but not both on my trip… which one should I choose?\n\nI’ve dreamed of Italy forever and both look too amazing but I’d appreciate any tips on which to do this trip.", "link": "facebook.com/groups/1373361046396315/permalink/2198870770512001/", "likes": 299, "comments": [{"username": "Anthony Sperduti", "comment_text": "been to both definitely Matera,"}, {"username": "Claire Robinson", "comment_text": "Love both but Matera is way more magical. Let me know if you decide to go and need any tips x"}, {"username": "Robin Burrell", "comment_text": "Matera. Positano and the Amalfi Coast was beautiful but Matera just blew me away."}, {"username": "Joanne Stuyck", "comment_text": "Both very different but would definitely choose Matera ❤️"}, {"username": "Kim Cicarelli", "comment_text": "POSITANO!!!!"}, {"username": "Gail Hartshorn", "comment_text": "I have been to both.. you would not be disappointed with either."}, {"username": "Rhonda Prince", "comment_text": "Positano"}, {"username": "Raquel Millikin", "comment_text": "Loved both but MATERA would be my pick. It’s incredible!!! Read about it before you go!! The history is so fascinating!! You truly feel like you stepped back into history."}, {"username": "Ann DiPasquale", "comment_text": "Both are fantastic. Matera is a must to see."}, {"username": "Maria Musumeci", "comment_text": "I've been to both, and they're both absolutely stunning in their own ways.\nIf you like to see Positano, youll have access to the Amalfi Coast. I'd stay in Sorrento & day trip to Positano, Ravello, Amalfi Beach & more.\nIf you go to Matera (Basilicata region, bordering Puglia) you'll have access to the stunning Puglia region, such as Alberobello, Ostuni, Polignano A Mare, Lecce, Molfetta, Giovinazzo, Monopoli, Bari & much more. I found this side of Italy magical, clean, not as touristy, authentic & stunning. The water views were beautiful. I'd go back there in a heartbeat!\nBut I did loooove Amalfi Coast too.\nLook it up, see which side you'd be interested in."}, {"username": "Jennifer Miller", "comment_text": "Positano is super touristy. When I went, we stayed in Ravello - up the mountain, which was wonderful. They have amazing gardens, food and\nPottery. And a bus to the coast was $.50."}, {"username": "Dương Phương Thảo", "comment_text": "Matera"}, {"username": "Joanne Bianco", "comment_text": "Matera is magic"}, {"username": "Loretta Coccodrilli", "comment_text": "ano"}, {"username": "Todd Ross", "comment_text": "Let Marcelo drive and you can do both LOL"}, {"username": "Jill Cox", "comment_text": "Positano 100%!"}, {"username": "Patricia Koh", "comment_text": "would it be easy to get to Matera without a car?"}, {"username": "Krystal Schinella", "comment_text": "Materaaaaaaa the energy was electric 😍 positano is equally gorgeous but Matera has cats, you can get lost in all the paths and staircases all day. There is a hiking trail, they have free internet in the plaza, buskers, everyone is so friendly. Literally had so many locals give me different tours of their home town 😍🙌🏻 I am a bit bias because their local stories made me fall in love with the place."}, {"username": "Laura McCready Pizani", "comment_text": "Kathleen Barnes join"}, {"username": "Katherine Malo", "comment_text": "TR Malo"}, {"username": "Thea Bianca", "comment_text": "Positano in summer, Matera in winter"}, {"username": "Kassandra Poirrier", "comment_text": "Thank you everyone for your replies!! As much as I would love to do both, I’ve chosen this time to go to Matera!\n\nGuess this just means I’ll need to do another Italy trip one day and do the Amalfi coast then. Oh well! 😉"}, {"username": "Marsha Rose-Sperduti", "comment_text": "Amalfi Coast is dreamy and a must, but Matera and then on to the Puglia region make for a less crowded and touristy experience. Pick one then do the other on your next trip. This was our view from our room in Matera."}, {"username": "Anna Ward Gounev", "comment_text": "I’ve been to Positano and can’t imagine anything more magical"}, {"username": "Vince N Cindy Erno", "comment_text": "I’ve been to both, and very different vibe. Can’t go wrong with either."}, {"username": "Billy Nash", "comment_text": "2 absolutely different experiences. Been 2 both several times. Both incredible."}, {"username": "Billy Nash", "comment_text": "It will be 1000 degrees in Matera in August……"}, {"username": "Marthese Briffa", "comment_text": "Definitely Matera."}, {"username": "Lorraine Saliba", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Sharine Ramjewan", "comment_text": "Both places are absolutely stunning... so whichever you choose... I think you will have an amazing time!!! Those two places were amazing for me!!!!"}, {"username": "Heather Lauzon", "comment_text": "Following"}, {"username": "Catherine AleXandra", "comment_text": "My mother was from Matera… so it has my vote. 🌹🇮🇹❤️"}, {"username": "Soc Cer", "comment_text": "POSITANO - the vertical town that is best scene from the water <3"}, {"username": "Mary Wevodau", "comment_text": "Was in Matera a few weeks ago, so unique and beautiful!\nOf course this view from our Airbnb definitely helped! Positano was crazy crowded, although the nearby town of Praiano was 😍"}, {"username": "Lisa Adams Robertson", "comment_text": "Matera! Matera is fascinating and otherworldly. Positano was disappointing, crowded, and boring, at least from the land."}, {"username": "Lisa Adams Robertson", "comment_text": "Lisa Adams Robertson"}, {"username": "Queenie Mah", "comment_text": "Matera, it is so unique. One of the highlights of my trip! An off the beaten track places to visit."}, {"username": "Michelle Irgens", "comment_text": "I don't know about Matera. We loved Positano but we were there in Dec. It was quiet except locals celebrating the feast of the immaculate conception. I think it may be a little to over run in the summer. I hope you make it to Pompeii though. It's more than I ever expected! We've been twice...once on '03 and again in '19. They have excavated so much more and added a great Pink Floyd exhibit!"}, {"username": "Miyuki Kanno Paul", "comment_text": "Matera is magical. But you only need 2 full days or so to explore both Sasso Barisano and Sasso Caveoso.\nAs for Positano, you can hop on ferry or bus(unless you are driving) ti visit other towns"}, {"username": "Jane Morris Taylor", "comment_text": "Depends which time of year and who you’re with. Do you have kids? We’ve just returned from a Puglia trip and we tacked on two nights in Matera at the end. It is definitely magical, especially at twilight when the lights start coming on. My kids were troopers but it was sooo hot and there was no pool or sea to swim in to cool down. And we couldn’t hike across to the caves on the hillside opposite as it was too hot or too dark. Positano is beautiful too, though I prefer amalfi and atrani. It is busy but you have the sea! If summer, I’d choose coast, if spring/autumn, then matera."}, {"username": "Romina Cini", "comment_text": "Positano forever ♥"}, {"username": "Paweł Falkowski", "comment_text": "Matera👌It is a fantastic and unique place. Two days in January'22 👌🇮🇹🇵🇱"}, {"username": "Rudolf Turecek", "comment_text": "Matera, far better than Positano in my POV."}, {"username": "Doredi Beltrame", "comment_text": "Matera!!!!!"}, {"username": "Arlene Soriano Concepcion", "comment_text": "Just got back from our trip. Amalfi coast and Positano were beautiful. However, avoid Positano in the summer! It was crowded!!!\nWe did a tour with Collette we stayed at hotel Raito which I in Vietri del Mare or Vietri Del Sur? Close enough to Positano /Amalfi but far from the mayhem!"}, {"username": "Jo Ann Di Giamo", "comment_text": "Matera!"}, {"username": "Maria Graziella Rincon", "comment_text": "Matera"}, {"username": "Jeanine Singer Bair", "comment_text": "Matera!!! All the way"}, {"username": "Barbara Was", "comment_text": "I would go to Matera. It is beautiful, historic and so unexpected. Great food too."}, {"username": "Suzanne Fazio Cappa", "comment_text": "Been to both. Positano is beautiful, but Matera is absolutely breathtaking.\nMatera all the way."}, {"username": "Livia Magyar", "comment_text": "Matera"}, {"username": "Deanna Gasparott Kelley", "comment_text": "It depends on what you are looking for. I was in Positano last month and was disappointed at how touristy it was. The village is lovely, the scenery is amazing, but the stores were commercialized,\nI thought it was difficult to find authentic restaurants, and there were LOTS and LOTS of people. I never saw traffic when cars weren’t gridlocked. And boat traffic was very congested. Obviously a lot of people like this experience, but if you are looking for a more relaxed vacation, I would suggest somewhere else."}, {"username": "Rick Schneider", "comment_text": "Two very different places Matera an amazing story...Positan\no an amazing place to see. Matera is a one day visit. Positano needs a few days with Amalfi coast"}, {"username": "Rose Oliver", "comment_text": "❤️❤️❤️❤️"}, {"username": "Jill Irland Nobes", "comment_text": "Appreciate the comments"}, {"username": "Nancy van Beest", "comment_text": "Matera!"}, {"username": "Ane Michaela", "comment_text": "I visited both on the same trip. When I saw Positano, I was like: awww, this is so beautiful. When I went to Matera after, my first reaction was: HOW THIS PLACE CAN BE EVEN REAL???\nSo, yeah, even though they are very different, I would choose Matera. It was definitely the highlight of the trip."}, {"username": "Kara Gilmore", "comment_text": "Positano"}, {"username": "Kira Marie Ciccarone", "comment_text": "Matera!!!"}, {"username": "Tina Moreman Hunter", "comment_text": "We're planning to do both in October, but we're going to Positano while staying in Sorrento and to Matera while staying in Monopoli. I would not want to a day trip to Positano from Monopoli or to Matera from Sorrento, so I think it's totally dependent on where you're staying. Choose the one that requires less of your day spent traveling and more spent enjoying, then stay in a different location on your next trip and see the other."}, {"username": "Iliana Zlatareva", "comment_text": "Positano"}, {"username": "Lucrezia Folger", "comment_text": "Been to both several times, and they are both completely different and unique. It's like asking which of your children do you like best?? It's impossible to answer. Maybe just base it on ease of logistics to where you are coming from, or where you need to return to."}, {"username": "Lillian Gucciardi Nahas", "comment_text": "They’re completely different! Both are amazing. Matera is a bit out of the way so if you can get there easily I’d say do it this time and leave Positano for another visit. What time of year are you going?"}, {"username": "Robert Castelli", "comment_text": "How often do you get to Italy?? Find the time to do both or you’ll regret it.\nWhat’s a few extra days/$$ for an incredible lifetime experience?"}, {"username": "Stjepan Kujadin", "comment_text": "Mattera, Positano is a mess this time of a year"}, {"username": "Lisa Marie Neirink-Cook", "comment_text": "Matera, hands down!"}, {"username": "Stephanie Abney Bryan", "comment_text": "Angela Stewart Sessoms & Tami McGhee"}, {"username": "Catherine Kelsall", "comment_text": "Matera - a walking tour is a must to understand the history.\nPositano was beautiful but so busy"}, {"username": "Rutchel Garmay Salgado", "comment_text": "Rya Garmay Christensen"}, {"username": "Denise Luistro Nadeau", "comment_text": "Matera. Beautiful area - old world Italy. Not touristy at all"}, {"username": "Barba Ra", "comment_text": "Depends where you are now! From Positano to Matera is around 230 km, which means cca 4 hours by car.\nPositano is beautiful but crazy crowded and expensive. Matera is something unique and breath taking. I would definetely choose Matera and Basilicata and see that part of peaceful South Italy."}, {"username": "Bernice Lund", "comment_text": "Positano"}, {"username": "Megan Jeffries", "comment_text": "Matera very unique and less traveled. We stayed at an awesome cave hotel with a pool in the caves. (Can’t remember the name)"}, {"username": "Nicole Vidiri Silva", "comment_text": "Matthew Silva"}, {"username": "Christine LaMore Meyers", "comment_text": "The best way to get to Matera from Sorrento"}, {"username": "Katherine Azcue", "comment_text": "Positano"}, {"username": "Gram Jane", "comment_text": "Positano"}, {"username": "Donna Winter", "comment_text": "Positano"}, {"username": "Julie Agarkov Mayblyum", "comment_text": "They are as different as night and day. No way to compare. One is on the coast with a possibility to take a boat and view of Amalfi coast, beach etc., the other is a stunning unique place not to be missed at some point in a lifetime."}, {"username": "Judy Matthews Barrientos", "comment_text": "So wonderful, take a Boston out on the water."}, {"username": "Mary Weldele Coco", "comment_text": "Positano, without a doubt!!"}, {"username": "Martha Regina de Hernández", "comment_text": "Luis Arturo Hernández Castro"}, {"username": "Lorin B. Bridge", "comment_text": "Positano, it is heaven."}, {"username": "Sandra Kingsley", "comment_text": "I loved Positano though very expensive!"}, {"username": "Rhonda Russell", "comment_text": "I spent 4 days in Matera last year. An amazing place to explore"}, {"username": "Kristýna Dolečková", "comment_text": "100% Matera"}, {"username": "Shelley Phillips", "comment_text": "Matera for sure. So interesting!"}, {"username": "Armine Arabchyan", "comment_text": "Positano looks much better in person than photos. It’s just breathtaking and yes super busy during the day but mornings and evenings are quiet"}, {"username": "Cynthia Marie", "comment_text": "Matera is amazing. You can see a coastal town everywhere but where else can you see a cave town. Totally worth it. Matera has gotten so popular lately. I’m glad we went before it got popular. It was one of our favorite stops on the way to Puglia."}, {"username": "Holly Stauffer Risinger", "comment_text": "We went to Matera in April and it was just magical! We stayed at a cave hotel which was outstanding and I highly recommend Sextantio | Le Grotte della Civita | Albergo Diffuso"}, {"username": "Amina Mohammed", "comment_text": "Just did Amalfi coast and Positano last wee, amazing and spectacular. Loved it."}, {"username": "Mariët Eertman-Heemstra", "comment_text": "They are both fantastic to visit but only Matera you can do in one day. Positano is part of the most beautiful Amalfi Coast where you should visit for at least 5 days. You should drive the coastway, visit Positano, Sorrento, Amalfi and Ravello. Also make a boat tour from Sorrento to Amalfi. You can get of at Positano also. Picture is mine, taken from Villa Rufolo in Ravello.\nAnother good advice: Visit in april, May or September, otherwise it is far too crowdy!"}, {"username": "Elisa Doro", "comment_text": "You cann’t compare these 2 beauties … but I can almost 100% guarantee that you will be blown away by the beauty and uniqueness of Matera. I am. Or sure how much time you will have but a night and day in Matera is enough to savour the uniqueness of this place . Then if you have time .. Alberobello and the Valle d’itria is only an hour away.\nIf you decide to come . I can help with info and transfers…you won’t be sorry 🤗🤗🤗"}, {"username": "Carmela Tortora Coppola", "comment_text": "Matera"}, {"username": "Anis Rahmoun", "comment_text": "Matera"}, {"username": "Linda Jane Richardson", "comment_text": "When I went to Matera it was wet slippery. Positano, Amalfi and Ravello on the Amalfi Coast are far better for a visit"}, {"username": "Shelley Chilton", "comment_text": "Just been to both Matera for me! So special and unique."}, {"username": "Sylvia Giordani", "comment_text": "Please consider Matera. It's a unique ancient heritage destination. By day, it is breathtaking, by dusk it takes on another magnificent sight. Enjoy! 🌻"}, {"username": "Linda Hill", "comment_text": "Matera…. for me!"}, {"username": "Roseann Ferrara Castrillon", "comment_text": "Positano 💯"}, {"username": "Deborah Coram", "comment_text": "Matera is the oldest town in Italy and simply amazing. We stayed 3 days and I would have loved to stay longer and learn more. We did a lot of hiking and if you really want to explore Matera you should be up to do so….also not very toursity which I love whereas Positano is over run.\n\nBest bar I’ve ever been to is in Matera. I felt like I was on the Flinstones!! 🤣🤣"}, {"username": "Alex Hicks", "comment_text": "Matera! ✨"}, {"username": "Caroline Basford", "comment_text": "Matera"}, {"username": "Patricia Jameson", "comment_text": "Never been to Matera so can’t really say, but my son is still talking about Positano, Sorento and the Amalfi. They are breathtaking. A definite must see!!!"}, {"username": "Tatuka Talakhadze", "comment_text": "positano for me ✌🏼"}, {"username": "Candy Mattiello", "comment_text": "I would take Positano.. hands down! I LOVED it! You can take side trips to Sorrento, Ravello, Isle of Capri, Salerno … beautiful town and experience!💕😜"}, {"username": "Michelle Solak", "comment_text": "Never been to Matera but we absolutely loved Positano"}, {"username": "Karrie Doyle", "comment_text": "Amy DeCoste"}, {"username": "Julia Muller", "comment_text": "One word: MATERA!!\nWe were there two weeks ago to the day and we’re absolutely blown away. Breathtaking, mind blowing, words can’t capture its beauty. Don’t hesitate, you will never see anything else like it. A day I will never forget as long as I live 💕🇮🇹"}, {"username": "Jill Tingley", "comment_text": "Positano"}, {"username": "Luciana Filippelli McCartney", "comment_text": "Matera!!!! Positano is beautiful but requires more days!"}, {"username": "LeAnn Bonkiewicz", "comment_text": "Positano"}, {"username": "Khushi Khanna", "comment_text": "Matera is unique. Positano has the charm of a hilly seaside location ."}, {"username": "Nikki Barrett", "comment_text": "I haven’t been to Positano but Matera is just an experience you would be unlikely to ever have anywhere else. I absolutely loved it- it was the most beautiful and unique place I have ever visited. Just learn a little Italian to get by as the locals don’t speak a lot of English."}, {"username": "Maria Luiza Bulcão", "comment_text": "I had been in both last May. All Italy is wonderful. But if you prefer places not crowded, go to Matera and towns around."}, {"username": "Tijana GH", "comment_text": "Matera. I personally prefer Amalfi over Positano. Don't get me wrong, Positano is pretty, but it is just too much. Too many people, too many rules, too expensive. Matera is such an out of space experience, you can get super nice accomodation with nice views. I have been in both locations, when it was hot... Matera is just way better!"}, {"username": "Alexis Ferrari-Pagán", "comment_text": "Charlie Pagán-Ferrari"}, {"username": "Anna Kabebe", "comment_text": "Oh they are so different! So unique both of them. I couldn’t choose one over the other. 🤩"}, {"username": "Paula Poisella", "comment_text": "Yes Matera, we stayed 3 nites in a cave hotel, very old and unbelievable, did a private walking tour with a wonderful guide and the history is mind blowing! Also been to Positano and Amalfi coast, they are beautiful but such different experience from Matera!"}, {"username": "Jennifer Anne Trowse", "comment_text": "Matera without a doubt!@"}]}, {"id": "2198880690511009", "text": "Is there a place that you can listen to live music in Rome at night that kids can attend? We don’t drink so didn’t need to be a bar scene. Thanks In advance.", "link": "facebook.com/groups/1373361046396315/permalink/2198880690511009/", "likes": 2, "comments": [{"username": "Cecilia Christine Costantini", "comment_text": "Check: https://\nculture.roma.it/\nmanifestazione/\npiazza-gianicolo\n/ - it is a sort of openair bar (but you can get non-alcoholic drinks I bet), on one of the hills of Rome, overlooking the city."}, {"username": "Cecilia Christine Costantini", "comment_text": "This is the place I am talking about, right now it is scorching, but at night it is pleasant"}, {"username": "Cecilia Christine Costantini", "comment_text": "If your kids are young, from July 31st there are puppet shows (on the left side of the big statue facing the view)"}, {"username": "Cecilia Christine Costantini", "comment_text": "On the right side of the big statue (facing the view) there is also this for young kids"}, {"username": "Meredith Holloway Helbon", "comment_text": "I’d love to know the same thing, but regarding Naples (we do drink, but doesn’t need to be a bar)."}, {"username": "Dayna Steinberg Cioffi", "comment_text": "There were performers with amazing voices just singing on many street corners!"}]}, {"id": "2198875017178243", "text": "Recommendations for restaurants in Milan, Cinque terre, Florence, Figueres and Barcelona. Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2198875017178243/", "likes": 2, "comments": [{"username": "Stefano Follador", "comment_text": "For Barcelona I suggest you mescladis Borell.\nIs a good restaurant but it’s also a social project that helps migrants people without documents to starts a career in restaurant business as server and cook."}, {"username": "Jane Coutts", "comment_text": "Florence- il cinghiale bianco- - very old traditional florentine restaurant specialising in meat."}, {"username": "Chiara Pirrello", "comment_text": "For Milan pizza club no limits…you will see, it’s a giro pizza! Very nice! For a restaurant: pane e tulipani near stazione centrale.\nFor an « apericena » Maya at Navigli.\nHave a nice trip 🥳"}, {"username": "Lizzie Danner Roth", "comment_text": "For Florence, highly highly recommend La Giostra! Pear ravioli and tiramisu were divine. My husband had the filet and it also was delicious."}, {"username": "Merilice Finateri", "comment_text": "Montrosso I think near the train station."}, {"username": "Elena Innocenti", "comment_text": "Firenze “Buca Mario”, near Piazza di Santa Maria Novella, have the autentic tuscany cuisine. You have to try “crostini toscani” dish, it’s like my grandmother do them at home and also Fiorentina is a must.\nEverytime i go to Firenze, i go there, it’s my favourite restaurant.\nAnother good and easy is “Buca Poldo” near Piazza della Signoria.\n\nIn Barcelona there is a place call “Bar Lobo” carrer Pintor Fortuny, near Buqueria Market, very nice bar restaurant for breakfast, lunch and dinner. A fixed stop everytime in my Barcelona trip.\nI like also “Cal Pinxo” in Portvell, “Salamanca” in Barceloneta, “Orio” tapas bar in carrer de Ferran (near Ramblas and Placa Sant Jaume), and Les Quinze Nits in Paca Reial, a very nice place for dinner in barrio Gotico.\n\nIn Milano i like “Mamma Rosa” “il giglio rosso” “Mediterranea” (fish) all of them are near stazione centrale."}, {"username": "Gioia Clari", "comment_text": "In Milan, some easy-going but delicious options are da Martino (well known for its Cotoletta alla milanese, Needs to be booked in advance), Osteria delle Commari (specialties from Rome/Latium area), la Taverna dei golosi.\nOtherwise Ristorante Sa Mesa (Sardinian restaurant, the fish is very good), A' Riccione (fish, fancier), Trattoria a casa nostra\nFor pizza: Capuano's, Sorbillo, Da zero (gluten-free options as well) - usually they do not accept reservations, but they are fast and if you come early its easier"}, {"username": "Renae Larcus", "comment_text": "In CT go to Manarola and eat at Nessun Dorma. Our favorite there!"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2198884607177284", "text": "Taormina, Sicily", "link": "facebook.com/groups/1373361046396315/permalink/2198884607177284/", "likes": 3, "comments": []}, {"id": "2198885150510563", "text": "Taormina", "link": "facebook.com/groups/1373361046396315/permalink/2198885150510563/", "likes": 3, "comments": []}, {"id": "2198890233843388", "text": "Hi, would like to visit Craco Historical Center in South Italy in December. But I cannot find the information on where to buy the tickets. Is the place open?\n\nhttps://maps.app.goo.gl/a6pcKwiAaBAa4SED6?g_st=ic", "link": "facebook.com/groups/1373361046396315/permalink/2198890233843388/", "likes": 0, "comments": []}, {"id": "2198893057176439", "text": "Hi Gang!\nI am Portuguese and very cultured and would love to visit Italy for two weeks ( small costal towns)\nI don't smoke , can't drink wine nor do I like it to tell you the truth!\nI know I know!\nBut I love beer! Lol\nI am a excellent cook too.\nSo ...my questions are\nWhere should I go?\nNo wine tours no cooking classes please.\nI enjoy seeingआणखी natural historical sites, abit of walking, good food ( ma and pa small cafés etc)\nNot into large crowds or nor waiting in lines ( some health issues) ...\nAny suggestions?\nGolf cart ( evening tour) is on my list\nI do want to stay in Monestaries or guest house as it is more affordable.", "link": "facebook.com/groups/1373361046396315/permalink/2198893057176439/", "likes": 4, "comments": [{"username": "Stefano Follador", "comment_text": "If you are into beer o suggest you a visit to pedavena brewery. Is in Belluno province, next to Feltre, not far from Dolomiti area."}, {"username": "Pietro Adami", "comment_text": "Sicilia, or Puglia"}, {"username": "Alice Francesca", "comment_text": "When are you going?"}, {"username": "John Sampson", "comment_text": "I go to Basilicata, every year.i rent of an Italian family who I have made friends with. I stay in mountain village.it has eveything .bars, restaurants, shops etc. It is an hour and 15 min minutes from the coast.not a tourist area.the coast has beautiful places like policoro,metapo\nnto.\nLots of great walking.great food.. I recommend to anybody who is looking for a peaceful break with no tourists etc.. give something like this a try."}, {"username": "Kay Malick", "comment_text": "Umbria region is good for culture, small towns and traditional places..."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Check the village of Calci in Tuscany, twenty minutes from the sea, there is brewery (La Staffetta) and I think they also rent rooms, there is a Monastery (turned into a good museum), lots of olive trees and in October you’ll find new olive oil some little nice. restaurants. Plenty of things to see around (Pisa, Lucca, Livorno, Florence and counting)."}, {"username": "Paulinha Cã", "comment_text": "CHIANTI BREW FIGHTERS. via G.Rossa 10/C, RADDA IN CHIANTI (SI)"}]}, {"id": "2198896930509385", "text": "Our Hotel and view on Capri\nIt doesn't feel crowded here, just calm and beautiful\n\nThe most important thing is to stay near the city of Capri itself and not down by the harbor, where you will be frightened by the crowds⁉️💦🇮🇹☀️", "link": "facebook.com/groups/1373361046396315/permalink/2198896930509385/", "likes": 60, "comments": [{"username": "Vernell Carranza", "comment_text": "Aww wish I saw this before our trip. Looks amazing!!!"}, {"username": "Mariposa Mariposa", "comment_text": "Just Beautiful…wish I was already there 🇮🇹🤍. Can’t wait!!"}, {"username": "Sarah Wanless Pescitelli", "comment_text": "So great to hear! We arrive tomorrow!"}, {"username": "Christi Craddock Taylor", "comment_text": "Charlotte - So glad to hear about Hotel Weber. We’re staying there in September. Did they pick you up at the port when you arrived? Did you eat at the hotel restaurant?"}, {"username": "Carmen Zervigon Everett", "comment_text": "How did you get down to the beach? Is that the beach guests used? How far from Anacapri and how would a guest get there? Thank you"}, {"username": "Samaria Braman", "comment_text": "Is the water very cold?"}, {"username": "Tommo Thomson", "comment_text": "We had found Capri a little to overcrowded tbh and the lack of tourist information was lacking just our opinion could not wait to get back on the boat lol"}]}, {"id": "2198901330508945", "text": "Hi, would like to plan a trip to Italy and Greek Islands. Don’t want to do too many touristy things, just the main (and most interesting ones) and then relax near a beach in hotels with water views. Prefer not to hire a car so any suggestions on getting around. Would also like to include a cruise but only on a small boat (200 people max). Also would love to do a foodie tour, any suggestions would be most appreciated", "link": "facebook.com/groups/1373361046396315/permalink/2198901330508945/", "likes": 2, "comments": [{"username": "Colleen Jennings", "comment_text": "Hi. Not sure when you’re planning to travel but currently there are wildfires in Rhodes & Corfu. Travelling round Italy is really easy - upload the Trentitalia app.\n\nI’ve been going to Italy since I was 13 & recommend the following places - I’ve stayed in the hotel recommendations\nthis year.\n\nBologna, Padua, Lucca, Genoa, Parma, Verona, Asti, Piedmont, Florence, Pietrasanta, Puglia area, Sardinia & Sicily. Hired a car in Sardinia & Sicily. I could go on…. Been to Rome, Venice, Sorrento but prefer smaller cities/towns.\n\nIn Florence stay in the Oltrano area - across the bridge 10 mins walk to the sights but more authentic & less touristy.\nLucca is a beautiful walled city home of Puccini & much more. Recommend Insidethewall.i\nt for a 5 roomed boutique place to stay. Sestri Levante is a lovely town in the Cinque Terre region - hotel Due Tori is right by the sea.\n\nIf you decide to do the beach area in Italy, I recommend the coast from Viareggio to Marina di Massa. Very Italian with few tourists just Italians in the summer holiday season. We hire bikes when we go here - cycle paths everywhere. Or we use the bus - frequent & cheap. Enjoy your trip."}, {"username": "Frances McDonagh", "comment_text": "Be careful of Rhodes and Corfu loads getting evacuated with heatwave and fires"}, {"username": "Miyuki Kanno Paul", "comment_text": "Speaking of Greek island, Naxos is more relaxed and far less congested than Santorini or Mykonos."}, {"username": "Teresa Tiganis", "comment_text": "Travel around mainland Italy, very easy by train and then fly directly to Greek Islands to relax on the beach, I recommend Paros and Milos"}, {"username": "Sue Dundas", "comment_text": "Take me 😆"}]}, {"id": "2198915917174153", "text": "Hello, my family of 5 will be in Italy and France for 2-1/2 weeks departing in mid of August and I am trying to book train tickets online, but not sure if the following websites below are legit. Please advise me which website is trustworthy to purchase online.\n1). Trenitalia 4). Raileurope\n2). TheTrainLine 5). ItaloTreno\n3). italiarail 6). Rail.ninja\nMany thanks in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2198915917174153/", "likes": 0, "comments": [{"username": "Joy Clift", "comment_text": "Trentalia and train line are both good."}, {"username": "Erica Senes Tombesi", "comment_text": "Trenitalia is the main company, Italo is another conpany, both web site are good and safe"}, {"username": "Pietro Adami", "comment_text": "1 and 5 are the official ones, run by the respective rail companies."}, {"username": "Rhona OConnor", "comment_text": "I use the Trainline app. Easy and straightforward\n."}, {"username": "Victoria Laverty", "comment_text": "I booked straight with company italio private owned"}, {"username": "Rye Eiven", "comment_text": "What about Omio?"}, {"username": "Kuusik Aimi", "comment_text": "I use Trainline app :)"}, {"username": "Dave Conroy", "comment_text": "I have used Trainline for many, many years. I have looked at Omio, also a third-party service, and seems good. I have looked at Trenitalia and good but a tad more complicated than trainline, and likewise ItaloTreno. mainly issues with seat selection and categories of ticket, but they're OK. I would use any of them. I don't know the others. Some say only use the actual train company sites, which is fair ... tho if you're more likely to make mistakes because they're a bit less clear and friendly to non-Italian speakers then not sure what the advantage/risk mitigation is."}, {"username": "Matteo Gallizioli", "comment_text": "TRENITALIA or ITALOTRENO\n\nOn Trenitalia there are \"Frecce\" that are the \"high-speed\" trains\nItalo is only \"high-speed\" but is a private company"}, {"username": "Frances McDonagh", "comment_text": "The train line is brilliant"}, {"username": "Sam Mah", "comment_text": "Trenitalia is the train service provider for a lot of train services in Italy."}, {"username": "Gillian O'Callaghan", "comment_text": "You'll get people recommending them all.\nI used the Trainline app for 13 trips in Italy and loved it. Mainly because it has trips from both companies."}, {"username": "Benedetta Vanni", "comment_text": "The companies operating trains are:\n1) Trenitalia: frecciarossa/\nintercity/\nregional trains (trenitalia.com)\n2) NTV: italo train (italotreno.it)\nSo those are the only 2 official websites."}]}, {"id": "2198959533836458", "text": "Hi new member here. I'm really enjoying all the helpful info and suggestions. I hoping to travel to Italy maybe 2025, I know it's a way off yet but my health needs to improve and I like to be well prepared in advance. I would appreciate any advice, as I may be travelling solo so I'm wondering whether going with an organised tour group would be best. Although I've been told they can be full on and abit rushed, or wether it's best to just go at my own pace and just do my own itinerary. Thanks for any suggestions. 😊", "link": "facebook.com/groups/1373361046396315/permalink/2198959533836458/", "likes": 1, "comments": [{"username": "Kristina Ruk", "comment_text": "As for me on my own its better as you dont have to be in rush, take/spend more time on what you like, choise what you like. Some people like then everything is organised so its up to you l"}, {"username": "Fiona Cohn", "comment_text": "Angela I’ve just come back from Italy. I did most of the trip Solo, and loved touring at my own pace. When dining out, I never felt lonely, I’d chat with fellow diners, asked them where they’re from, even made new friends."}, {"username": "Lucrezia Folger", "comment_text": "It really depends on what you're more comfortable doing. Have you traveled solo before? Made your own arrangements etc before? I prefer solo, but it's really a personal choice."}]}, {"id": "2198965370502541", "text": "Cornetti - where can I find a good one in Sydney? I have found them on occasion in Leichardt at a cafe, but I live in Dural and often don't time it right they are sold out, or haven't arrived yet that day.\nI live on these when in Italy but I don't like most Croissants in Australia. Please advise! Thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2198965370502541/", "likes": 2, "comments": [{"username": "Nissa Nolan Foster", "comment_text": "Have you tried Dolcettini? Their website says they are in Dural and have cornetti towers."}, {"username": "Cecilia Christine Costantini", "comment_text": "Your best bet is to join some facebook group like ITALIANI A SYDNEY (I think there are a couple of different ones) and ask there."}, {"username": "Joanne Nacson", "comment_text": "How are they different to a croissant? Would also like to know where you can get in Sydney"}, {"username": "Sian Kennedy Gipslis", "comment_text": "I think Papa’s in Haberfield make them!"}, {"username": "Nadia Mckenna", "comment_text": "Try Delisse Café in Castle Towers. Unfortunately, I do agree with you that they don’t taste the same as those in Italy (or France)\n☹️"}, {"username": "Margaret-Anne Gilbert", "comment_text": "Feeling your pain Josie Gilbert 🥐"}, {"username": "Rachel Cielens", "comment_text": "Good luck! Ever since returning from Italy and France pastries, breads, pizza and pasta is just not the same!"}, {"username": "Maria Musumeci", "comment_text": "Josie Gilbert Oh my goodness, I fell in love with them in Sicily, often having one with my morning coffee!! Venice had the best Almond ones!! Chocolate or Almond Cornetti 😋 being my favourite.\nYou can get them at Pasticceria Papa either Haberfield, Five Dock or Bondi. So delicious, not 100% like the Sicilian or Italian ones, but very very close."}, {"username": "Richelle Trezise", "comment_text": "https://\nsitchu.com.au/\nsydney/cafes/\nbest-italian-pas\ntry-shops"}]}, {"id": "2198969567168788", "text": "#morning #walking #saturnia #tuscany #italy #with #love #happy #nature #sunrise #birds #olive #tree #unforgettable #beautiful #travel #aroundtheworld #reels", "link": "facebook.com/groups/1373361046396315/permalink/2198969567168788/", "likes": 6, "comments": []}, {"id": "2198974953834916", "text": "Werona ❤️", "link": "facebook.com/groups/1373361046396315/permalink/2198974953834916/", "likes": 39, "comments": [{"username": "Daisy Yoo", "comment_text": "Verona"}, {"username": "Martin-John Rubio", "comment_text": "The fake R& J balcony?"}, {"username": "Dianne Lloyd", "comment_text": "Shakespeare's Juliet wasn't based on a real person, and the house doesn't have any relation to the story. (Sorry, for some, that could be equivalent to finding out that Santa isn't real 🥹)"}, {"username": "Frank Hunt", "comment_text": "Had to get the translation.😂😂"}, {"username": "Frank Hunt", "comment_text": "Loved Verona, had the best lunch ever, had a full beer spilled down me at a bar near the river, got a Covid test for my cruise - negative. Life was good last year.❤️❤️"}]}, {"id": "2198984977167247", "text": "Milan is a very beautiful city❤️🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2198984977167247/", "likes": 76, "comments": [{"username": "Winner Fatoyinbo", "comment_text": "Beautiful city"}, {"username": "Alison Schmidt", "comment_text": "Alison Schmidt"}, {"username": "Neal Gibson", "comment_text": "Neal Gibson"}, {"username": "Ann Lombardi-Perkins", "comment_text": "i agree"}]}, {"id": "2198768947188850", "text": "Any recommendations for places to stay in Milan? Any areas to avoid? Will be going May 2024", "link": "facebook.com/groups/1373361046396315/permalink/2198768947188850/", "likes": 0, "comments": [{"username": "Matteo Gallizioli", "comment_text": "like any big city, pay attention to the suburbs (like quartoggiaro)\nCentral train station and Via Como (movida) \"dangerous\" for thieves"}, {"username": "Glenn Todd Webb", "comment_text": "The area around duomo is pretty central. The triangle from duomo to sforza castle to Santa Maria Della grazie is good. We stayed just behind duomo at Rosa Grand."}]}, {"id": "2198770207188724", "text": "Hi Peeps, we are planning a trip to Italy in second half of October. Mostly driving on a rented car. I am researching the time it takes to do a road trip from Pisa to Milan and am getting very confused with the estimates that pop up. the distance doesn't seem to be much but travel time without toll shown by google is close to 6 to 7hrs. Why does it take so much time to do 300 km trip? Is it advisable to do a road trip from Pisa to Milan via Portofino/Genoa in one day?\nto those who lend their advice, appreciate your help in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2198770207188724/", "likes": 2, "comments": [{"username": "Clarissa Rava", "comment_text": "It takes that long because half of the road is passing through Appennini mountain.\n\nEdit i didn’t noticed you said 6 hours lol what. Hahahha"}, {"username": "Jihan Adem", "comment_text": "Trains are excellent and often and incredibly good value.\n\nThe roads are much slower (and very busy) as most things are in Italy - ‘piano piano’ ….\n\nBut if you’re set on doing so much in one day I’m sure you’ll get great comments below 👇"}, {"username": "Kristian Strebør", "comment_text": "My Google and Apple Maps says 3 hours"}, {"username": "Nicola Ramoso", "comment_text": "Huh? Are you sure that you've enabled toll roads?"}, {"username": "Elena Innocenti", "comment_text": "Small road, speed limits and traffic crossing town."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "It’s 3 hours with toll roads, 6 hours with standard roads with maximum average speed of 50km/h but if you stop in Portofino probably it will be 6 hours because of the time you need from the highway to Portofino and back."}, {"username": "Joe Guzzi", "comment_text": "Take the toll roads. 3h12"}, {"username": "David Fidgeon", "comment_text": "See viamichelin.com for route plan and timing"}, {"username": "Fiona Cameron", "comment_text": "Take a train, much less stressful."}, {"username": "Rhona OConnor", "comment_text": "The roads will not be all highways, that's why travelling takes time."}, {"username": "Steph Craddock", "comment_text": "If you go cross country it is all hills and mountains, so windy roads, up and down, up and down. Some beautiful drives. But that's why it'll take you most of the day to drive Milano -Pisa."}, {"username": "Alice Francesca", "comment_text": "Take the train.Easier, quicker, takes you straight to the center of town where cars are not allowed in many places and you risk a heftly fine.parking can be a nightmare too."}, {"username": "Leila Myftija", "comment_text": "Go via Parma and La Spezia (A15/E33 and A1): ca. 3 and a half hours."}, {"username": "Allison Mir", "comment_text": "It takes longer without toll roads because the alternatives are narrower windy often coastal routes with lower speed limits. If time is your biggest factor use the toll roads"}, {"username": "Keith Crossley", "comment_text": "Keith Crossley"}, {"username": "Silvia Urbinelli", "comment_text": "Pisa Milano 3 hours max 4. Here is: Milano, Parma,Fornovo,M\nassa,Pisa. It'toll road (highway).\nIf you want to stop in Portofino, you must drive Milano, Genova, LaSpezia, Massa, Pisa. It's more traffic."}]}, {"id": "2198782220520856", "text": "Anyone know if any vacation specialists that take monthly payments up until closer to the trip?", "link": "facebook.com/groups/1373361046396315/permalink/2198782220520856/", "likes": 0, "comments": [{"username": "Rita Kanten", "comment_text": "I believe FF Go Ahead travel does."}, {"username": "Kimberley Jade", "comment_text": "I’d like to know also. I’m in Australia"}, {"username": "Jaime Cleek", "comment_text": "Usually they stop 30-45 days out."}]}, {"id": "2198828650516213", "text": "Airbnb /\nhotel recommendations for Sorrento, please", "link": "facebook.com/groups/1373361046396315/permalink/2198828650516213/", "likes": 5, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.dpbolvw.net/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187782-d2289\n59-Reviews-Gran\nd_Hotel_Excelsi\nor_Vittoria-Sor\nrento_Province_\nof_Naples_Campa\nnia.html"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.anrdoezrs.ne\nt/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187782-d1270\n6189-Reviews-3_\nSuites_View-Sor\nrento_Province_\nof_Naples_Campa\nnia.html%3FspAt\ntributionToken%\n3DMTcyMjQ2MjM"}, {"username": "Dave Conroy", "comment_text": "Budget?"}, {"username": "Tiffany Hadfield Merrill", "comment_text": "Hotel mignon, so cute"}, {"username": "Suzanne Sanderson", "comment_text": "Hotel Plaza Sorrento is lovely"}, {"username": "Tracey Aloi", "comment_text": "Casa Scio’ 1 bedroom apartment on main street"}, {"username": "Mélanie Dutil", "comment_text": "Tout près de Sorrento et Lisa, l’hôte, est géniale.\n\nhttps://\nabnb.me/\nRH4u6dKWGBb"}, {"username": "Frances Scannapieco", "comment_text": "Hotel Antiche Mura. In the center of Sorrento. Fabulous"}, {"username": "Kelly Roland Thompson", "comment_text": "Grand hotel Royal"}, {"username": "Cettina Milioto", "comment_text": "Hilton sorrento. Ask for the renovatated room"}, {"username": "Virgz Van Møøre", "comment_text": "Palazzo Montefusco"}, {"username": "Geoff Roush", "comment_text": "Imperial Hotel Tramontano Sorrento"}, {"username": "Lisset Berdeal Sassi", "comment_text": "We stayed in a great airbnb with great host that arranged all our transfers and tours. It's centrally located.\nhttps://air.tl/\nbj6sVpOH"}, {"username": "Jan Pab", "comment_text": "We stayed in Sant’Agata in this beautiful airbnb"}, {"username": "Lisa DiSalvo Timmoneri", "comment_text": "Hotel Mignon - we loved it and will definetly be going back!"}, {"username": "Angie Balana", "comment_text": "Grand Hotel Vesuvio"}, {"username": "Nadine Gauld", "comment_text": "White House Sorrento. We booked via booking dot com but they’re on Airbnb as well. Two bed, two bath, balcony, ample living area and use of the complex’s pool. We’re here at the moment and it’s been great, easy walk into the main area or you can get the bus."}, {"username": "Alison Sherratt", "comment_text": "Lemon Flats Sorrento"}]}, {"id": "2198923303840081", "text": "Question: I am seeing a lot of comments about private transfer is great in the group. Will we need one for Milan airport to the city, and back? If yes, any suggestions? Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2198923303840081/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "have a look here https://\nwww.viator.com/\ntours/Ferno/\nMalpensa-Airport\n-Milan-MXP-Mila\nn-Private-Trans\nfer-up-to-8-pas\ns/\nd50509-128285P73\n5?pid=P00070587\n&mcid=42383&med\nium=link&medium\n_version=select\nor"}, {"username": "Rhona OConnor", "comment_text": "Public transport options are good too. I always use the train or bus. Much cheaper."}]}, {"id": "2198925623839849", "text": "Someone posted a recommendation for a book prior to a trip to Sorrento I believe. I cannot find the post for the life of me. Any help?", "link": "facebook.com/groups/1373361046396315/permalink/2198925623839849/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\namzn.to/3DsfJ4g"}]}, {"id": "2198931673839244", "text": "We are due to travel/stay at Minori on a package holiday at the end of August. Do any of you lovely people have any recommendations for places to eat and tips for sightseeing/things to do etc and best ways of getting out and about under our own steam. Thank you SO much in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2198931673839244/", "likes": 1, "comments": [{"username": "Izzie MacDonald", "comment_text": "Minori is amazing, we loved it...walk to Ravello....ther\ne are ferries that go along the coast buy your ticket on the waterfront..\nAlso day trip to Amalfi..buy tickets at same place..& same to Capri BUT if you want to go to the Blue Grotto or anywhere extra go online & book..because Amalfi is horrendously busy...& the ques long...\nThe town up on the hill in Capri expensive but lovely... the other tiwn we went to seemed like the poor cousin!\nIf you get a tour dont automatically believe ya tour guide knows best re food..( we found that out..)\nWe thought Minori was the nicest lil tiwn along the coast there."}]}, {"id": "2198938490505229", "text": "Hello all. Sorry if this is somehow unrelated. I'm in Rome with my daughter who's 8. We live in Ireland so she's not used with the heat. We're staying inside during the day, we have air conditioning, it's still warm though. The flight was delayed so she was exhausted when we arrived. Woke up with temperature that has been on and off and ableआणखी to control with paracetamol. She has bad stools too. But no pain or anything else and she's in good mood A friend nurse said it's the heat. Any advice on what I can give her here or where I can go for advice other than ER? I know this is a travel group and I'm not looking for medical advice just some suggestions. Thank you very much.", "link": "facebook.com/groups/1373361046396315/permalink/2198938490505229/", "likes": 13, "comments": [{"username": "Alessandro Battxi", "comment_text": "eat lightly, drink plenty of water and avoid the hottest hours to go out."}, {"username": "Oancea Bogdan", "comment_text": "GO to the pharmacy and ask for Polase. It will restore the electrolytes. Drink lots of water"}, {"username": "Cecilia Christine Costantini", "comment_text": "I went out in the extreme heat with no sunglasses a few days ago, got home and was dizzy/had a fever/💩. \"Cold\" shower and electrolytes (well, I had some water with salt and lemon actually, but you can go to a supermarket and buy any \"sport drink\"), some rest. I was dehidrated. The next day I was fine."}, {"username": "Sally Warren", "comment_text": "Drink plenty of water. If she’s chirpy go eat some pasta in the evening."}, {"username": "Prisca Aroomoogum", "comment_text": "Go to the pharmacy/\nchemist and ask them for probiotics/\nfermenti lattici and electrolytes.\nGatorades drinks are also helpful.\nAlso if she’s sensitive to milk, in Italy the milk is “stronger” because is less diluted and if not used to it people can get an upset stomach.\nI hope she feels better soon 🙂"}, {"username": "Stacey Esposito", "comment_text": "Water / electrolyte drinks like power aide I have seen here. A cooling cloth around her neck"}, {"username": "Erika Santos", "comment_text": "Aww poor thing hopefully she feels better soon"}, {"username": "Suzanne Hendriks", "comment_text": "AA drink or aquarius sports drinks, with that you fill up salts and necessary minerals. It is almost the same as ORS."}, {"username": "Reina Pike", "comment_text": "We needed a doctor while we were in Rome and our host gave us this link. They were fast, cost nothing, open 24 hours and for tourists:\n\nhttp://\nmobile.060608.it\n/en/\naccoglienza/\nservizi/\nemergenze-e-nume\nri-utili/\nguardia-medica-t\nuristica.html#:\n~:text=Emergenc\ny%20Medical%20U\nnit%20for%20Tou\nrists,Services%\n20%2F%20Hospita\nlity%20%2D%2006\n0608.it"}, {"username": "Helen Kalloniatis", "comment_text": "Pressure points to cool the body down are back of neck and inside wrists. Keep cool cloths on these areas to help. If she starts vomiting or cannot keep fluids down, straight to hospital/ doctor."}, {"username": "Kristina Ruk", "comment_text": "Give more fluids"}, {"username": "Audrey Daenzer", "comment_text": "Poor thing. Hope she feels better.\nIf you arrived and it started right after the flight etc., I doubt it can be from the heat since you haven’t experienced it yet. Maybe something she ate on the plane or just from the change in pressure on the flight in general."}, {"username": "Niamh O'Flaherty", "comment_text": "Poweraid is very good for rehydration"}, {"username": "Triskell Young", "comment_text": "Several people have recommended specific things to get from a farmacia, but another thing to do would be to just go to one and describe the symptoms. The pharmacists are really great, competent and helpful and might know best what local medication will be effective."}, {"username": "Cee Esperance", "comment_text": "Sounds like she is dehydrated. Start with the electrolyte drink, make sure she drinks a lot of water (not soda/pop nor juice)"}, {"username": "Enrica Palla", "comment_text": "Try with Guardia medica, it's a free service for minor emergencies. It is usually on at night."}, {"username": "Enrica Palla", "comment_text": "Enrica Palla"}, {"username": "Heather Sechrist", "comment_text": "I used doctors in Italy a couple of weeks ago for a virtual visit. 20euro and got fixed up quick! Hope she feels well soon!"}, {"username": "Miyuki Kanno Paul", "comment_text": "Farmacia"}, {"username": "Colleen Dawson", "comment_text": "If you are still in need of help the website doctorsinitaly is a great resource.Please\ndon’t just give electrolytes until you know what is happening. Visit a pharmacy, they can also give you suggestions."}, {"username": "Linda Jo Rice", "comment_text": "At the least needs aggressive rehydration"}, {"username": "Adriana Alexandru", "comment_text": "Pedialyte drinks( not sure if you find in Italy)"}, {"username": "Kim Thomas Simmons", "comment_text": "Gatorade, propel, pedialyte. Anything with electrolytes. Keep her well hydrated"}, {"username": "Melissa Welch", "comment_text": "Liquid IV for hydration!"}, {"username": "Bernadette Di-Filippo", "comment_text": "Hope she’s feeling better. After she’s had her electrolytes, cool down the pressure points, cold wet face wash on forehead and keep sipping water throughout the day. Keep drinks regular and avoid skulling/\ngulping down a lot of water at once as that can make you feel sick. Put wet face washes in the fridge to put on back of neck if it gets hotter. I’d keep up the Panadol another day to beat that fever."}, {"username": "Nicole Villareal", "comment_text": "Try this, incredibly helpful and fast appointments\nhttps://\nwww.doctorsinita\nly.com/"}, {"username": "Sara Conley", "comment_text": "Definitely the electrolytes! If you can find real pure coconut water that’s better than regular water!"}, {"username": "Giuliana Chemello-BigDog RPht", "comment_text": "Keep her as hydrated as possible with electrolyte drinks."}, {"username": "Ali Everson", "comment_text": "Teva is an Italian brand of hydralite. Try that. 1 morning and night while this heat persists."}, {"username": "Melissa's Page", "comment_text": "Thank you all very much 🙏"}, {"username": "Linda Tibbles", "comment_text": "Go to pharmacy or farmacia and ask for electrolyte drink tablets. Put in water and drink. Then plenty of fluids. They are like sports drinks, athletes have."}, {"username": "Lyn Evans", "comment_text": "Can you get something like hydralyte. It’s good for dehydration and after gastro."}, {"username": "Lyn Evans", "comment_text": "A wet hanky tied around the neck is good too."}, {"username": "Kelli Pilkington", "comment_text": "If your hotel room has a bath, run a tepid bath to help bring her core body temp down. Lots of fluids, ice blocks/ice if possible. Hope she is feeling better soon"}, {"username": "Ingrid Morris", "comment_text": "Limit clothing and have a cool bath. Hydrate with electrolytes and avoid salty foods. If no change in 24hrs or she becomes worse, straight to ER."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2198433363889075", "text": "All roads lead to Rome,\nthe fantastic city, with countless experiences at every corner, so beautiful, so old, so much history gathered in one place! 🏛️🏺🇮🇹🍀\n\nLove Rome too💕", "link": "facebook.com/groups/1373361046396315/permalink/2198433363889075/", "likes": 124, "comments": [{"username": "Mariposa Mariposa", "comment_text": "What a beauty 🤍🇮🇹"}, {"username": "Czecie Reyes", "comment_text": "Great pictures!!"}, {"username": "Andrea Romano", "comment_text": "Beautiful photos"}, {"username": "Risa Mwangi", "comment_text": "My dream country. ..That's my prayer"}, {"username": "Andrew Mircovich", "comment_text": "The best city in the entire world !"}, {"username": "Lisa Jones", "comment_text": "Fantastic photos!"}]}, {"id": "2198950377170707", "text": "BUONGIORNO a tutti: Bari (Puglia) @angelaricci68", "link": "facebook.com/groups/1373361046396315/permalink/2198950377170707/", "likes": 955, "comments": [{"username": "Cat Furness", "comment_text": "Absolutely gorgeous!!! Love Bari"}, {"username": "Elvira Lelli", "comment_text": "Gorgeous Bari 😍🤩"}, {"username": "Nana Esther Bertolino", "comment_text": "Nana Esther Bertolino"}, {"username": "Enza Liberio", "comment_text": "Stupenda la nostra Bari!"}, {"username": "Anna Guerrieri", "comment_text": "Anna Guerrieri"}, {"username": "Luisa De Francesco", "comment_text": "Nico Le"}, {"username": "Tina Hebel", "comment_text": "Roberto Klam 🥰"}, {"username": "Joe Laricchia", "comment_text": "So beautiful"}, {"username": "Maurizio Onnis", "comment_text": "Cinquant'anni fa c'erano già le panchine?Io non le ricordo!"}, {"username": "Yllka Dushku", "comment_text": "Yllka Dushku"}, {"username": "Piero Santamaria", "comment_text": "Unica"}, {"username": "Gaetano Cusato", "comment_text": "Buongiorno"}, {"username": "Carmen Delia Marusca", "comment_text": "Carmen Delia Marusca"}, {"username": "Rosa Pantaleo", "comment_text": "Rosa Pantaleo"}, {"username": "Francesca Lastella", "comment_text": "Francesca Lastella"}, {"username": "Carlo Schirone", "comment_text": "Dedicato a tutti quelli del nord fatevi gl occhi"}, {"username": "Patrizia Spagnolo", "comment_text": "La mia città...meravig\nliosa"}, {"username": "Val Eliola", "comment_text": "Val Eliola"}, {"username": "Viorica Târziu", "comment_text": "Bongiorno a voii tutiiii baressi"}, {"username": "Wilma Fasano", "comment_text": "Wilma Fasano"}, {"username": "Rosa Turi", "comment_text": "Stupenda 😘La mia Città 😘"}, {"username": "Anna Fiorito", "comment_text": "Anna Fiorito"}, {"username": "Roswitha Paolini", "comment_text": "Roswitha Paolini"}, {"username": "Maury De Chirico", "comment_text": "❤️"}, {"username": "Joanna Joanna", "comment_text": "Joanna Joanna"}, {"username": "Ketty Martire", "comment_text": "Belliss Bari anke Ks"}, {"username": "Giovanni Cafagno", "comment_text": "Non si sarebbe il tramonto olalba comunque so o belle entrambe sia il tramonto che l'alba sul lungomare di bari amicirovate adandarevederlo\nsia il tramonto che l'alba sul lungomare ciao wbari baresi non stiamo a vedere nulla ancora della campagna acquisti del bari lo leggeremo alla fine sul giornale chi a comprato e chi a cedutospero che abbiamo fatto dei buoni acquisti il bari okkk ciao baresi w bari w bari baresi siamo forti noie se dovessimo cambiare gestione saremo più forti baresi ilpresidente e uno che non sta benedizioni testa nonsa cosa deve fare del bari visto che lui non a di bisogno di soldi lo desse al miglior offerenteil buon compratore e stato da lui solo che non si sono trovati al prezzogianni rivera e la sua cordata dametic0ani erano più che sufficienti buonilui si sarebbe preso i suoi soldi e il bari aveva cambiato gestione rivera disse che voleva allenarlonil bari lui ciao ivera io ti o sempre appoggiato se tu vieni a bari coni tanti tuoi simpatizzanti che ai saresti stato il nostro beniamino cia rivera w bari"}, {"username": "Vito Bomba", "comment_text": "Bari non è la Puglia ma una terra a sé. Di fatto, sin dai precedenti secoli, l'attuale Puglia era divisa in 3 zone prive di una sola identità. Lo era anni fa' lo è oggi ecco perché amare Bari conta di più. ❤️❤️❤️❤️"}, {"username": "Ciscoman Django Bulldozer", "comment_text": "Leandra Oliveira"}, {"username": "Vittorio Placido", "comment_text": "Bari è Bella Sempre molto Fascinosa"}, {"username": "Maria Van Gerven", "comment_text": "Bernie Van Gerven"}, {"username": "Sarah Emerson Nelson", "comment_text": "Buongiorno back to you! Bellissimo!"}]}, {"id": "2198721347193610", "text": "Some tips on traveling in December ?\nMuch appreciated!!!", "link": "facebook.com/groups/1373361046396315/permalink/2198721347193610/", "likes": 17, "comments": [{"username": "Jan Fargo", "comment_text": "Most places close for winter. Some things are open but modes of travel are hit and miss. Check before going"}, {"username": "Souley Sakho", "comment_text": "Are you serious?"}, {"username": "Ville Lignell", "comment_text": "The cities and their sites are always open."}, {"username": "Greg Saba", "comment_text": "Christmas markets are open. A lot fewer tourists and tour groups to contend with. Temperatures generally range from the 40’s to 50’s (F) north to south. It is a bit rainier period, but when it’s clear the skies are blue blue. Dress accordingly."}, {"username": "Gillian O'Callaghan", "comment_text": "Ohh a great time....when I go back I'll go at that time 👍"}, {"username": "Martha Hughes", "comment_text": "I was in Sicily mid November to early December 2022 and Rome early December 2022 .. total of 4 weeks. It only rained for a short time one day ... lucky to hit great weather. It was only cold enough to need a warm coat three nights. A few places were not open, but only a few ...most everything was open. (I wasn't near a beach.) Definitely fewer crowds but not void of crowds. No Christmas markets were open. It was fantastic."}, {"username": "Daisy Yoo", "comment_text": "We are going early Dec , Christmas markets open , less ppl , u can dress in layers and have ur cross bag inside"}, {"username": "Frank Hunt", "comment_text": "Overcoat and central heating."}, {"username": "Phyllis Snyder", "comment_text": "I understand Rome in December is so fabulous! I’m sure the rest of Italy will be similar. Festivities galore! Just be prepared for the weather- dress warmly."}, {"username": "Bob Sullivan", "comment_text": "I did 9 nights (Rome/Florence/\nVenice) in Dec 2019 and immediately wanted to make it an annual trip. I returned for 2 weeks in 2022 primarily around Veneto with many daytrips. They do a really cute (and not commercial) Christmas over there! Even got to see a few rugby games in Padua!\nAll travel done by train. Here are some lights in Padua."}, {"username": "Nancy Curmi", "comment_text": "Ali Sha"}, {"username": "Anita Lawrence Mundy", "comment_text": "Wonderful"}, {"username": "Alice Francesca", "comment_text": "It depends on where you are going Italy stretching from the Alps near Switzerland to Sicily close to Africa, so in the winter you can find pretty much freezing (although bearable) temperatures around Milan or sunny and pleasant weather in Taormina."}, {"username": "Miyuki Kanno Paul", "comment_text": "Where will you visit in Italia?"}, {"username": "Elizabeth Thorpe Vorster", "comment_text": "Our plan is 3 days in Munich . 3 days in Rome and then 3 days in Paris.\nThat's our \"base camps\" .\nFrom South Africa, so would love the snow thing! ❄️\n\nThank you all for the tips!!!"}, {"username": "Nana Esther Bertolino", "comment_text": "I live in Rome and December can be tricky. Wear winter clothes, hat and gloves , Not many tourist. Can also be rainy.."}, {"username": "Souley Sakho", "comment_text": "Thank you for the information"}, {"username": "Carol Taylor Tisdale", "comment_text": "We spent the week of Christmas in Paris following a river cruise and it was utterly delightful!! The temperatures were never frigid and actually perfect for walking distances exploring. Some days only required a light wrap or sweatshirt. Great opportunities for eating fresh hot crepes, drinking hot chocolate at Angelina's, even enjoying a cappuccino in an outdoor cafe. The top of Eiffel was pretty cold but still a treat. Personally, compared to my most recent trip to Paris this past June - I'd FAR prefer going in winter than in summer!"}, {"username": "Olga Olga", "comment_text": "Very cold! Actually freeze by the sea"}, {"username": "Lisa Vivolo", "comment_text": "Florence in December is wonderful!! I am spending the whole month there Feel free to look me up for a glass of vino with me and my adult daughter!"}, {"username": "Fran Astur", "comment_text": "F"}]}, {"id": "2198732360525842", "text": "Hi, my partner and I are taking a day trip to Genoa in our hire car tomorrow morning. I know it doesn't get the best rep on here compared to other cities, but we're still going anyway as part of our Italian tour 💁🏻‍♀️we know about the smaller coastal towns outside of the city, so I'm looking for recommendations of things/specific places to do, see and eat in the city. AND if anyone can give us an idea of where we can park for free, or relatively cheaply, even better! 😁🥰", "link": "facebook.com/groups/1373361046396315/permalink/2198732360525842/", "likes": 1, "comments": [{"username": "Brenno Bianchi", "comment_text": "Genoa is famous for the Strade Nuove (Via Giuseppe Garibaldi, Via Balbi, Via Cairoli) (1778-1786, formerly Strada Nuovissima) and Palazzi dei Rolli (both UNESCO world heritage site).\nThe Royal Palace and the Ducal/Doge's Palace are quite beautiful too, as the National Gallery.\nThe Aquarium I think it is still the biggest in Europe.\nI had good reviews also of the Galata, the maritime museum."}, {"username": "Tari Lawson", "comment_text": "Go to the Monumental Cemetery of Staglieno. The place is amazing. Additionally, I would recommend a visit to Santa Maria di Castello. Once inside ask for the free monastery tour. Genoa is so charming. We loved our time there."}, {"username": "Connie Wilson", "comment_text": "Visit the Christofer Columbus house, San Lorenzo Cathedral, Royal Palace Museum, the Aquarium and take a harbor cruise (very interesting!)."}, {"username": "Stefano Follador", "comment_text": "The city is kind of particular. Sincerely not beautiful in a canonical point of view, but interesting.\nI suggest the Acquarium, which is wonderful, but take quite a long time to visit.\nThen there is the Maritime Museum which is really underrated and so interesting. If you are into history of the sea and the immigration/\nemigration is something deserve a visit.\nAbout place to eat it’s been a while but I liked Trattoria Vegia Zena and osteria il Cadraio. Give them a shot"}, {"username": "Sam Mah", "comment_text": "Genoa is gorgeous to just wander around and get lost in the cobbled streets and check out the architecture. It has a fabulous maritime museum on the waterfront. You can take free funiculars up to get panoramic views of the city."}, {"username": "Ville Lignell", "comment_text": "So weird nobody suggested Cinque Terre, given that it's in the same region! Just hit any inquiry about trips outside Florence and it's always on the list... 😂"}, {"username": "Paul Anderson", "comment_text": "It head north in to the mountains. It is cool and beautiful"}, {"username": "Ruth Hulk", "comment_text": "Hi folks, thank you for all of your suggestions! Just to clarify, we are going to the city, not anywhere outside of it - no towns, mountains, etc. We've done loads of that on this trip so far. We're looking for recommendations\nof things to do for one day in the city of Genoa! We're en route now 🙂 if anyone can recommend any parking, that would be amazing!"}, {"username": "Colleen Jennings", "comment_text": "Pesto originated in Genoa so sample some in any trattoria. Enjoy your time there - we had 4 days there 10 years ago. Loads to see & do."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Look on google which is the closest “migliore focaccia di Genova” (best focaccia in Genova) and eat focaccia di Recco (ie cheese focaccia): you’ll be blown away!"}, {"username": "Sande Ricci", "comment_text": "Go to the old historic area. Go to the port. You can drive down the coast to Recco and Camogli and check out the beach. We were there in May and loved it so much were going back next year to spend more time there. I think it's really underrated."}]}, {"id": "2198736960525382", "text": "We will be traveling to Rome for 3 days, and to Venice for 2 days, in December.\n\nWe will have our 8 year old and 12 year old with us.\n\nWe are traveling on a tight budget (the currency converter rate for us is crazy!!).\n\nPlease could you share suggestions for:\n\n1) Family & budget friendly stays in Rome and Venice?\n\n2) Suggestions for passes and tickets we should aim to get in order to maximize our budget?\n\n3) Any insider tips or tricks you could suggest to us please?\n\nThis is a once in a lifetime for our little family.\n\nThank you in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2198736960525382/", "likes": 5, "comments": [{"username": "Renae Larcus", "comment_text": "In Venice we had an Airbnb the second time we went. It was lovely and had everything we needed and more. Consider that."}, {"username": "Bill Casper", "comment_text": "Try Booking. Super owners and very high rating.\n\nhttps://\nwww.booking.com/\nShare-98Q920."}, {"username": "Connie Wilson", "comment_text": "Affordable lodging in Italy can be found in monasteries. Check these out:\n\nhttps://\nwww.monasterysta\nys.com/\n?d=Italy%2FLazio\n%2FRome-accommo\ndation"}, {"username": "Paul Davis", "comment_text": "Consider leaving the kids with the grandparents. They’ll slow you down and they likely will not enjoy the trip."}, {"username": "Gayle Moores", "comment_text": "In Venice if you decide to take the water bus (Vaporetto)buy the day pass for 33euros each. It is a better deal as it allows you to go back and forth all day on the canal and see different places. It is also good for the Islands of Murano and Burano.The regular ticket is only good for 75 mins. and then you will have to buy new tickets again after the expired time.It adds up .Just remember to validate your tickets on the water bus.The validity of your tickets starts from the time you first validate them and ends at the same time not at the end of the day.You can also buy 2 and 3 day tickets.We bought the 2 day pass and used it lots and stopped at many interesting places.Was worth it!"}, {"username": "Stefano Follador", "comment_text": "When in Venice instead of stay in the city, which is lovely, but expensive, think about heading to Mestre. Is like the earth part of Venice, there are cheaper accommodation.\nJust be careful in the train station area is not the safest place on earth"}]}, {"id": "2198733257192419", "text": "Airbnb / hotel recommendations for Rome\nStephanie Taylor", "link": "facebook.com/groups/1373361046396315/permalink/2198733257192419/", "likes": 3, "comments": [{"username": "Karen Tuccinardi", "comment_text": "Just got back today, stayed in a small hotel, great location to walkable ￼to restaurants shops very reasonable per night and includes breakfast!"}, {"username": "Molly Elizabeth", "comment_text": "https://\nwww.airbnb.com/\nrooms/\n8383758520011217\n83?source_impre\nssion_id=p3_169\n0154384_lJcrYrX\njx7l%2BjtBa\n\n5 minutes from Colosseum, amazing AC, clean, and really awesome host!"}, {"username": "Stephanie Taylor", "comment_text": "Madison Taylor no rooms available for those dates"}, {"username": "Pierre Germain", "comment_text": "Hotel Romanico Palace, Rome"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.jdoqocy.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187791-d1024\n5528-Reviews-Va\ntican_Style-Rom\ne_Lazio.html%3F\nspAttributionTo\nken%3DMjEyNTMyO\nTI"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.kqzyfj.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187791-d5765\n58-Reviews-Hote\nl_Camelia-Rome_\nLazio.html"}]}, {"id": "2198695163862895", "text": "Hi! I have booked a trip to northern Italy in late September. We are planning to do 3 nights in Venice, 3 nights in riva del garda and 3 nights in Florence.\n\nCan anyone recommend activities / places to visit while there and good restaurants to eat at? We are big foodies and also love anything water related. 😊\n\nThanks in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2198695163862895/", "likes": 3, "comments": [{"username": "Nicola Ramoso", "comment_text": "Northern Lake Garda meaning Riva del Garda?"}, {"username": "Nikki Livingston", "comment_text": "We had so many great meals in Florence. Our favorite was La Giostra! It was a beautiful atmosphere and the best meal I’ve ever had! Enjoy your trip!"}, {"username": "Alice Francesca", "comment_text": "If you are in Riva take time to visit other places via ferry: Malcesine and the top of Monte Baldo, Salò, Isola del Garda.."}, {"username": "Jessica Petyo", "comment_text": "Ciro & Sons in Florence https://\nwww.facebook.com\n/groups/\n1373361046396315\n/permalink/\n2196952960703782\n/\n?mibextid=I6gGtw"}, {"username": "Ana Ka", "comment_text": "I am a foodie too! I absolutely love bottega del buon caffe in Florence and alla Vecchia Bettola. In lake Garda we really liked only one restaurant: La Caneva Bistrot Mediterraneo"}, {"username": "Ana Ka", "comment_text": "And on Garda we absolutely loved this town with lemon orchards 🍋 and stunning harbour: Limone sul Garda"}, {"username": "Steve Grossman", "comment_text": "Book from the united states dinner at il Latini In florence. You will thank me afterwards. Must reserve before you leave your trip you will not get in otherwise"}]}, {"id": "2198700877195657", "text": "Hi, wanting to pre book trips to the stadium and the church and hop on hop off bus tours but don't know who to book it with, any recommendations would be appreciated ☺️ edit sorry should of said going to Milan lol 🤦🏻‍♀️", "link": "facebook.com/groups/1373361046396315/permalink/2198700877195657/", "likes": 1, "comments": [{"username": "Jenn Messina Babore", "comment_text": "What stadium and church? Colosseum and Vatican? Best would be to purchase tickets direct on their websites."}, {"username": "Alessandro Iannelli", "comment_text": "Regarding the stadium (called San siro or also Meazza), there's a \"stadium tour\": https://\nwww.sansirostadi\num.com/en/\nmuseum-tour/tour"}]}, {"id": "2198726363859775", "text": "R there any lockers for suitcases in Venice? We have to check out of Airbnb at 10am & want to do a Gondola ride before heading to Florence….", "link": "facebook.com/groups/1373361046396315/permalink/2198726363859775/", "likes": 0, "comments": [{"username": "Ilana Brongiel", "comment_text": "Did you check with the AirBnB to see if they can store your luggage safely? I’ve seen some that will do it for early arrivals, so wondering if they will do the same for check out 🙂"}, {"username": "Maria Coladangelo Ducca", "comment_text": "Ask the hotel if they can hold them for you"}, {"username": "Maggie Gpe Banuelos", "comment_text": "Yes there are. We left our bags right in front of saint Mark’s square. Plus there’s an Irish pub that holds them for you as well"}, {"username": "Stacey Esposito", "comment_text": "I just passed some by Saint Mark's Square."}]}, {"id": "2198729093859502", "text": "Hello,\nAny one travelled to ortisei in late September can tell me how weather looks like(very cold or just cool) as i am going one day trip from trento and weather app showing different average temperature for last year ? Have a 1 year baby so need to make sure she dressed well", "link": "facebook.com/groups/1373361046396315/permalink/2198729093859502/", "likes": 2, "comments": [{"username": "Paul Davis", "comment_text": "I can’t answer your question about September weather but I will tell you that Ortisei is stunning. We were there earlier this month. Your photo was taken very close to where we stayed. Be sure to take the lift to the top of Seceda. You will be on top of the world! You can probably do the round trip in less than two hours assuming you don’t stay on top too long. Buon viaggio!"}, {"username": "Alessandro Iannelli", "comment_text": "It says 10 °C average as lowest temperature and 23°C average as highest. That's how the averages are usually shown, lowest (usually right before sunrise) and highest point (sometime in the afternoon before 5 p.m., give or take)."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "I would say something around 10/15C during the day, 5/10C during the night. It really depends on the year."}]}, {"id": "2198731080525970", "text": "Looking for recommendations for a mountain town for one to two nights in the Dolomites ??", "link": "facebook.com/groups/1373361046396315/permalink/2198731080525970/", "likes": 0, "comments": [{"username": "Betty Alexander", "comment_text": "Bolzano…."}, {"username": "Robyn Bullock", "comment_text": "Merano 😍😍"}, {"username": "Connie Wilson", "comment_text": "Ortisei is one of the best! Easy access to cable cars for fabulous hiking trails."}, {"username": "Ville Lignell", "comment_text": "From an Italian page:\n\nhttps://\nwww.cosafarei.it\n/dolomiti"}]}, {"id": "2198733820525696", "text": "Going on a Mediterranean cruise middle of September for 3￼ weeks. What is the weather like that time if the year? From Texas use to hot weather", "link": "facebook.com/groups/1373361046396315/permalink/2198733820525696/", "likes": 0, "comments": [{"username": "Betty Alexander", "comment_text": "Depends where you’re going, we were in Italy until late October and the days were glorious with a light cardi needed at night."}, {"username": "Colleen Dawson", "comment_text": "Sometimes the cruise line will give you an update on the weather in the region they are traveling."}]}, {"id": "2198733887192356", "text": "Hello! I’m going for 10 days on holiday to lake Garda with 2 kids 8 and 5 years old, any suggestions where to go and what to see please? Driving with own car. Distance 2 hours. Thank you so much", "link": "facebook.com/groups/1373361046396315/permalink/2198733887192356/", "likes": 0, "comments": [{"username": "Kristina Ruk", "comment_text": "Gardaland ;)"}]}, {"id": "2198733917192353", "text": "We would like a private water taxi to murano/burano (not a tour, not the vaporetto). Can anyone recommend a company they have used? Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2198733917192353/", "likes": 0, "comments": []}, {"id": "2198734300525648", "text": "Question: is it a must to get Colosseum tour tickets before arriving in Italy or are they also available on site?", "link": "facebook.com/groups/1373361046396315/permalink/2198734300525648/", "likes": 2, "comments": [{"username": "James Carr", "comment_text": "Always get before you go"}, {"username": "Joshua Pickles", "comment_text": "Only available 30 days prior and the sell out online. They do not sell onsite. Only buy from the official site not your sites."}, {"username": "Eleanor Marie Marschall-La Rosa", "comment_text": "They are available on site but you’ll be waiting in line for hours on end.\nAlways best to book in advance"}, {"username": "निनावी सहभागी", "comment_text": "Thank you- we have our tickets now 😊"}, {"username": "Lynne McInally", "comment_text": "Don’t wait. We arrived and had to buy them 3 party for 4 days later! We could have missed it. Also you don’t want to stay in long lines in that heat."}, {"username": "Angela Johnson", "comment_text": "We had a change in plans that opened up a couple of hours and so I logged onto Viator and was able to get Colosseum guided tour tickets two hours in advance. But honestly, I think I just lucked out."}]}, {"id": "2198735237192221", "text": "Hello!\n\nJust wondering if anyone can recommend an airline for travel from Florence to Berlin? We booked through Austria Air yesterday, and paid + received confirmation, but they’ve emailed a notification of refund this morning and said we’ll get credit notes. We’ll be requesting a refund, as we can only fly on this specific day.\n\nThanks in advance for any tips you might have! ✨", "link": "facebook.com/groups/1373361046396315/permalink/2198735237192221/", "likes": 0, "comments": [{"username": "निनावी सहभागी", "comment_text": "Bump 🍑"}]}, {"id": "2198736353858776", "text": "Does anyone know how long the T1 Leonardo tram takes from the Villa Costanza parking lot into central Florence? TIA", "link": "facebook.com/groups/1373361046396315/permalink/2198736353858776/", "likes": 0, "comments": [{"username": "Carmine Castiglia Jr", "comment_text": "Everything you need to know can be found at https://\nen.comune.fi.it/\nadministration/\ntramway/\nsystem.html"}]}, {"id": "2198742107191534", "text": "I am looking for a place to stay near Assisi, Italy. I would love an agriturismo within walking distance. I am open to other central locations to use as a base to explore Umbria. There will be 4-6 of us traveling. Thanks to all!", "link": "facebook.com/groups/1373361046396315/permalink/2198742107191534/", "likes": 0, "comments": []}, {"id": "2198698310529247", "text": "I tried booking a train using Trenitalia but did not see the route/time I needed available but Trainline had it available. Can someone tell me the reason for this? Also, the fare was non-refundable/no changes and it appears that it only charged me for the 2 adults and not for my two kids under the age of 15. Is this correct?", "link": "facebook.com/groups/1373361046396315/permalink/2198698310529247/", "likes": 2, "comments": [{"username": "Jenn Messina Babore", "comment_text": "How far out if your travel date?\n\nThere is a family fare that discounts free tickets for the kids if it is applicable."}, {"username": "Frank Hunt", "comment_text": "Use Trainline App"}, {"username": "Karen Blackmore", "comment_text": "Where was the trip? There are other trains as well as Trenitalia ones. Regional ones are often Trenord. We've used Trainline app, in Italy now, and it's been great!"}, {"username": "Jenine Gallardo", "comment_text": "Kids are free"}]}, {"id": "2198726910526387", "text": "Several people have suggested staying on Lk Como as a base for a couple of days and doing a day trip into Milan (as opposed to basing in Milan and day tripping to the lake).\n\nWhich lake town would you recommend and why? I’m thinking either Varenna or Como but have no idea if one might work better than the other. We plan to just walk, shop and eat - and of course use the ferry system to visit other lake towns.", "link": "facebook.com/groups/1373361046396315/permalink/2198726910526387/", "likes": 1, "comments": [{"username": "Virgz Van Møøre", "comment_text": "Como, easier to move around, lots of bars, cafes, shops, restaurants"}, {"username": "Tonsia Keytel", "comment_text": "Train to Varenna, short ferry ride to Bellagio and Mennaggio, which is also very quaint and pretty. Going to Como would be a much longer ferry ride. I would leave early am so you can do all three."}, {"username": "Glenn Todd Webb", "comment_text": "Tremezzo close to Villa Balbianello and Villa Carlotta"}, {"username": "Renae Larcus", "comment_text": "Varenna. It’s a one hour train from Milan and from the train station in Varenna it’s a quick walk to the lake and the ferry to get to other lake towns."}, {"username": "Lisa Abrams Argento", "comment_text": "Varenna."}, {"username": "Joanna Ruvolo", "comment_text": "I would say Como might be a better base and you can say trip to all the other towns. Comp is busier though and more of a little city. There are so many quaint little towns around the lake. Depends what atmosphere you prefer to say in."}, {"username": "Robyn Bullock", "comment_text": "Varenna is fabulous and I enjoyed my stay there. I also stayed in a quieter town Bellano which still had train & ferry access."}, {"username": "Iwona Dygas", "comment_text": "Como is bigger, more means of transport, Varennna is nicer and does have a train station with trains going to Milan"}, {"username": "Jane Morris", "comment_text": "Have you thought of Lake Garda ? it's a beautiful place. Lots of shops and restaurants. You only need one day in Milan"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2198591913873220", "text": "Headed to Naples for four days in a month, and am wondering if there are any nightclubs, or places to dance, or spend the evening enjoying live music that have stood out to anyone?\n\nAlso, we really want to visit Capri, but from everything I’ve read, it’s best enjoyed once the ferries stop for the day - meaning the evening/night time, once the huge crowds of tourists not staying on the island have left.\n\nWe already have our hotel booked in Naples, and we’re not going to adjust that - but would it be completely absurd to take the last ferry to Capri in the late afternoon (whichever the last is), book a hotel for one night on Capri so we can enjoy the hours after the ferries have gone for the day, maybe enjoy the beach and go up to Anacapri (spelling?) the next morning/early afternoon - before heading back to Napoli?\n\nI want us to have the best and most authentic experience in Capri as possible. Does this sounds nuts? Or how would you do it?\n\nAlso, when do the beaches and stores in Capri typically close the last week of August? And are there any night clubs or dancing on the island as well?\n\nI really appreciate any insight. Grazie, and have the best day! ❤️🌻", "link": "facebook.com/groups/1373361046396315/permalink/2198591913873220/", "likes": 1, "comments": [{"username": "Tami Whittlesey", "comment_text": "I do understand the magical draw of Capri. I spent five hours there in October and next spring I will spend 5 nights! It made me laugh when I read, \"Capri- where travel budgets go to die\" 🙂 As long as you go uphill to Anacapri and Monte Solaro., you seem to lose the crowds. I am also a fan of Napoli <3 Have you been to Ischia? Not as dramatic as Capri but hot spring baths and Castel Aragonese are pretty special. Buon viaggio"}, {"username": "Maria Piccolo Stern", "comment_text": "I would go off season 🤷🏻‍♀️but if you can afford it, sure: double book"}, {"username": "Kay Rendall", "comment_text": "Stay in Ana Capri, lots b&b. Less expensive, bus to Capri, may need to get taxi back if staying very late"}, {"username": "Rhona OConnor", "comment_text": "I was in smaller places in Italy.... I didn't see night clubs 🤔"}, {"username": "Marina Maddaloni", "comment_text": "Anima e core\nCapri 😊"}]}, {"id": "2198492193883192", "text": "My apologies if this has been mentioned already but it seems a visa waiver will now be required for US citizens traveling to Europe in 2024.", "link": "facebook.com/groups/1373361046396315/permalink/2198492193883192/", "likes": 6, "comments": [{"username": "Joe Guzzi", "comment_text": "Yes."}, {"username": "Crystal Nicole", "comment_text": "Say what?"}, {"username": "Michaela Chase Desmond", "comment_text": "It cost less than $8USD. The US has required something similar for years."}, {"username": "Wendy Harrison", "comment_text": "ETIAS. Different from a visa. Just a registration process. It'll be online. Only for Schengen countries I believe."}, {"username": "Allison Mir", "comment_text": "And for all of us in the UK 🤯"}, {"username": "Diane Wilkerson", "comment_text": "The start date has not yet been announced. It’s been planned and delayed for years."}, {"username": "Colleen Dawson", "comment_text": "Not a visa.Traveling to Europe now requires you to be registered,sinc\ne once you enter any of the Schengen countries you can travel freely within those countries. It’s also a way track the 90 day rule. Registration is done online and there’s a small fee and valid I think for 3 or 5 years, can’t remember. It should have taken effect late this year but is now pushed back to 2024. Lots of detailed information can be found if you google ETIAS."}, {"username": "Paul Vincent", "comment_text": "Not a visa.....is visa waver for schengen countries....wh\nen introduced (sometime next year, but no date yet)...apply on line...will be valid for 3 years."}, {"username": "Martin-John Rubio", "comment_text": "No! a visa is not required"}, {"username": "Antonia Dosik", "comment_text": "It's not quite a visa but more of a \"registration\".\nVery easy and quick to get."}]}, {"id": "2198688093863602", "text": "Best place to purchase & average prices of:\n\nChains and Saint Medals\nTablecloth", "link": "facebook.com/groups/1373361046396315/permalink/2198688093863602/", "likes": 0, "comments": [{"username": "John Celia", "comment_text": "Where's your exact location"}, {"username": "Brittany Collier", "comment_text": "Sandra Maldonado did I missing something funny? 😃"}, {"username": "Lisa Terry Holtcamp", "comment_text": "Maybe the such varying difference between your list? Or someone like me just hit the wrong thing."}, {"username": "Carmine Castiglia Jr", "comment_text": "The answer certainly depends on what city/cities you plan to visit..."}, {"username": "Deanna Gasparott Kelley", "comment_text": "I bought a gold chain and coin replica charm on the Ponte Vecchio in Florence and my daughter bought a similar one in Amalfi for 1/3 the price. I was shocked!! But a lot if not all of the stores on the bridge had saint medals. Also, the Vatican store had saint medals. (I also saw a Vatican store in the Venice airport)"}, {"username": "Elena Innocenti", "comment_text": "for religious things the widest choice is around vatican city, via della conciliazione and surrounding streets. Many specialized shops"}, {"username": "Sally Warren", "comment_text": "Napoli for bargain stuff especially religious"}, {"username": "Colleen Jennings", "comment_text": "Many churches sell these items."}]}, {"id": "2198689797196765", "text": "Tattoo in Venice\n\nAny recommendations for experienced fine line tattoo artists in Venice?\nWould like to book 11-12 September.\n\nThanks! 🤩", "link": "facebook.com/groups/1373361046396315/permalink/2198689797196765/", "likes": 2, "comments": []}, {"id": "2198690893863322", "text": "Hi, I am trying to book a stay at a hotel in Rome. Their website states to contact them for rates. I received an email from them with their rates, and it is cheaper than any of the third party sites offer. However there is no way to book directly on their website, and the owner is asking for either credit card information or Bank transfer.\n\nThoughts on this? I would love to get the cheaper rate, but want to make sure this seems legitimate. If I do go through with it which option would be safer?", "link": "facebook.com/groups/1373361046396315/permalink/2198690893863322/", "likes": 2, "comments": [{"username": "Betty Alexander", "comment_text": "I’ve done this before, given my credit card details via email. It’s just a guarantee of arrival. I’d be concerned if they didn’t ask. At the end of the day, if they charge without your ok, you can dispute it. But it’s quite normal with smaller places that aren’t your big hotels."}, {"username": "Wendy Lammerant", "comment_text": "If you do this, maybe send the info via what’s app - email is not secure"}, {"username": "Frank Hunt", "comment_text": "I’ve transferred accommodation deposit money securely before and it’s always been ok. I think it was a PayPal transfer back then but there are many ways of doing it and I expect most are fine."}, {"username": "Nadia Mckenna", "comment_text": "I personally would never send my back details/credit card info in an email. But I would pay by bank transfer straight into their account"}, {"username": "Miyuki Kanno Paul", "comment_text": "Bank transfer is very common practice in Italy. But it’s not that easy for us who do not live there. It’s very common to guarantee the booking by providing your credit card information. My most recent booking, for example, is with a B&B. Innkeeper sent me a secure link to make a transaction via WhatsApp. If you feel uncomfortable, then look for a place who takes online booking"}, {"username": "Laura Walker", "comment_text": "Just do a bank transfer from your bank app then you're not giving them your details just the money for the booking."}, {"username": "Kristina Ruk", "comment_text": "And what booking policy says about payment time and cancellation? They are asking for details as guarantee and some of hotels only charge days before arrival or on arrival day if you are not canceling. If they are charging any money as not mentioned in policy you can dispute as people already told you."}]}, {"id": "2198693470529731", "text": "I’m going to Italy next May and I’m having a hard time deciding on hotels in Florence and Sorrento. In both locations I’m torn between staying in the city or in the outskirts of town. The hotels in the outskirts are better with more beautiful views but I don’t know if I want to worry about transportation into the city every time I leave the hotel. Any thoughts or suggestions are welcome. Thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2198693470529731/", "likes": 18, "comments": [{"username": "Roland Trego", "comment_text": "Stay near the center in both places. You want to be able to have dinner and stroll in the evening without walking 30 minutes or taking a taxi/bus to get back to your hotel."}, {"username": "Sue Sherwood", "comment_text": "We were in Sorrento in May and stayed here. It was awesome. The location, service and amenities. The price was very reasonable. I would highly recommend.\n\nMake sure you explore the historic port. It is sooo cool!\n\nhttps://\nwww.tripadvisor.\ncom/\nHotel_Review-g18\n7782-d12790341-\nReviews-Sorrent\no_Apartments_ON\nE-Sorrento_Prov\nince_of_Naples_\nCampania.html"}, {"username": "Molly Elizabeth", "comment_text": "If you are open to an Air BnB, we stayed here for 4 days and would recommend it to anyone. It was about 15 minutes walking from the Duomo and in a really great part of town. Felt less touristy, best restaurants, and such a fun vibe.\n\nhttps://\nwww.airbnb.com/\nrooms/\n14874974?source_\nimpression_id=p\n3_1690154533_dA\n6dBtu2Ae9YlYwU"}, {"username": "Monica Roman-Fazio", "comment_text": "In Florence we stayed at hotel lucchese right across from the water. Sorrento we stayed at hotel gardenia we just came back last week"}, {"username": "Elissa OConnell", "comment_text": "It’s probably always better to stay more centrally particularly if you are short on time."}, {"username": "Lisa Valdovinos", "comment_text": "We stayed in Sant’Agnello at the Hotel Villa Garden. It is a beautiful hotel that overlooks the sea. The staff was so wonderful and accommodating. The breakfast was amazing and they had a pool. It’s about a 20 minute walk to Sorrento."}, {"username": "Wahab Sidharta", "comment_text": "Airbnb"}, {"username": "Sara Jellen Wingard", "comment_text": "We stayed in a hostel run by Ostello Bello, 5 minutes from the train station in Florence. It was perfect for what we needed"}, {"username": "Kim Crutchfield", "comment_text": "I’ve stayed at the St Regis in Florence and the Belastri. Both are on the Arno. One very elaborate (and expensive) the other a smaller boutique hotel (request a balcony room - it overlooks the river). I LOVE the river view - so nice to look out whether in the morning with a caffe or at night with a wine.\nPlease make sure you go to Oltrano (other side of the Arno). There are so many good finds there … from restaurants to shops to peaceful surroundings, musicians. Many of the shops are artisan-owned and love to talk of their craft. We loved it there. The main city of Florence is beautiful also with its architectural beauties, cafes, and HIGH END shops. But if you want things unique to Florence go across the river. I’m missing it!!"}, {"username": "Miyuki Kanno Paul", "comment_text": "Whenever in Sorrento, we only stay at hotels on Via Capo for the view. It’s worth walking 10 minutes into the town"}, {"username": "Lushan Yao", "comment_text": "I prefer staying at city centers because Italian cities are magical by night."}, {"username": "Yvette Pavone", "comment_text": "Stay CITY CENTER"}, {"username": "Carol McDonald", "comment_text": "Does anyone else know about this Visa ETIAS that we need in 2024?"}, {"username": "Jill Tingley", "comment_text": "Bellview serene on cliff in Sorrento. Voted best hotel always stay there close to town walkable"}, {"username": "Barbara Pasteris Allen Hettlinger", "comment_text": "We stayed at this hotel several years ago and loved it for it's gorgeous views. They also have a restaurant and we ate there every night because the food was great and the view at night was just spectacular! We found it to be an easy walk into town and definitely worth the walk for the views. https://\nwww.latonnarella\n.com/"}, {"username": "Lynne Pompetti", "comment_text": "It's the end of July ..."}, {"username": "Elyse Lichtman-Scheiner", "comment_text": "We stayed outside of Sorrento, not by choice. (Airline canceled our flights so ￼we lost our reservation). We took the local train into Sorrento every day, but it took away from our nighttime experience. It was too much to go back-and-forth.\nWe would’ve appreciated being able to take respite in the middle of the day. Having said that, we stayed five stops outside of Sorrento as opposed to one stop, which might’ve made a difference. ￼"}, {"username": "Ann Moore-Pak", "comment_text": "Stay in city close to everything! You wont be sorry!"}, {"username": "Luigia Gray", "comment_text": "I'd stay within the city,at\nleast you just walk out of your hotel and you're there."}, {"username": "Fiona Cameron", "comment_text": "I can highly recommend Alloro BnB in Florence its about a 5-10 min easy walk( even with a wheeled suitcase) from Florence SMN station.\nI travel alone (mature Aussie female) and always feel safe in Florence. You can walk to anywhere from this hotel, even to the other side of the river. I have stayed in their only single room many times and also shared a large double room with a friend who travelled from Spain to meet me in Florence.\nIts a family run establishment and they provide a fabulous breakfast buffet.\nI will be there in September 😊❤️🇮🇹"}, {"username": "Kit Nader", "comment_text": "Always stay central ... you want to be able to be out late and justvpoo back into your hotel when you want to. Otherwise you'll always have thoughts of getting transport back to your hotel! And the extra cost of that."}, {"username": "Jenny Payne", "comment_text": "I stay in Santo Spirito and walk into the main area about 10/15 minute walk as you have so much to look at on your way🌻"}, {"username": "Maria Pace", "comment_text": "Any recommendations\nfor a good place to stay in Bari and molfetta for a few days.\nPrefer to be central. It’s our first time travelling overseas so just trying to gather as much tips as possible"}, {"username": "Caterina Liquori-Culhane", "comment_text": "Our hotel had free shuttle"}, {"username": "Christy Geis", "comment_text": "Several years ago we stayed at Hotel Lungarno in Florence. Gorgeous hotel and perfect location.\n\nhttps://\nwww.lungarnocoll\nection.com/\nhotel-lungarno/"}, {"username": "Bea Kuckens", "comment_text": "When you stay on the outskirts you waste a lot of time going to and from sites / activities. If you are nearby, you can easily return to your lodging for reposo, to freshen up before dinner, retrieve the item you accidentally left in your room, etc. Step out of your door to join others for passeggiata. It's just more of an experience to be more central."}, {"username": "Rachael Richardson", "comment_text": "Stay the other side of the river on the pitti palace side much cheaper, more chilled , vibrant and still only a walk into the main centre"}, {"username": "Barbara Bastianini", "comment_text": "Everyone’s different but I think experiencing the street life of an Italian city during both day time and night time is part of the cultural experience. One I don’t ever want to miss. Plus, access to the sights is always better in the center rather than on the outskirts. Just rolling out of your door in the morning and being able to walk everywhere is a wonderful thing. That proximity makes it easy to get to an attraction before those staying farther away can arrive. So it’s a way to beat some of the crowds. And not having far to go far at night to get to your room after a full day of sightseeing is great for a tired tourist. So whenever possible I always choose the center for both atmosphere & convenience.\n\nI never feel I get to know the city as well if I stay in the outskirts. But again everyone’s different. Others will have different preferences."}, {"username": "Teresa Shawn Lane", "comment_text": "Stay in the city center. You can walk to all the sites and have all the shopping and restaurants at your disposal. My favorite thing to do was go down to the Duomo late in the evening and take in all her beauty with no crowds!"}, {"username": "Lynne Pompetti", "comment_text": "Never been to sorrento."}, {"username": "Lee D'Angelis", "comment_text": "Check with each hotel to see if they have transportation into town. When we stayed in Ischia they had a transport that ran periodically throughout the day."}, {"username": "Susan Monaghan", "comment_text": "I always prefer being near the center"}, {"username": "Sheron Milliken", "comment_text": "I’d stay in town in both places for the ease of walking to restaurants, etc."}, {"username": "Kimberly MacKinnon Cherry", "comment_text": "In Sorrento, it's fine to stay in the main Piazza Tasso. It's lively and not too loud. I have not been to Florence, yet, we are going in March 2024. So I am eager to hear responses"}, {"username": "Rhonda Hope", "comment_text": "First time visiting? Stay in center"}, {"username": "Dee Scandone", "comment_text": "I go to Sorrento every year and got married there. Personally i prefer to be in the thick of it, in the city centre. Most places are not far to walk. if you go there, enjoy."}, {"username": "Andrea Bainbridge", "comment_text": "We like Hotel LaScaletta in Florence, on the other side of the river, great neighborhood to explore, and their roof deck views to die for."}, {"username": "Souley Sakho", "comment_text": "Very nice 👍 place Gambie come"}, {"username": "Tara McCloud Odebrecht", "comment_text": "We stayed in town in Sorrento. It was super convenient. Loved it!"}, {"username": "Rachelle Ethington", "comment_text": "I think you answered your own question,you don’t want to travel every time you leave your hotel."}, {"username": "Simone Pfenninger", "comment_text": "If you stay outside of Florence you need a car. To Fiesole you can take the bus."}, {"username": "Andrea Jane Whittington", "comment_text": "We stayed in Montecatini terme and had great connections by rail to Florence and Lucca"}, {"username": "Carmela Siniscalchi Frattellone", "comment_text": "In Sorrento we stayed at La Badia. It’s a 10\nMinute walk into town. Returning you are waking up a hill. But I loved the hotel. In Florence we stayed at Hotel Machiavelli. 5 minutes from\nTrain and 10 minute walk to the duomo"}, {"username": "Maria Coladangelo Ducca", "comment_text": "You need to decide, depends on your agenda . Are you thereto visit the sights or do you want relaxation and serenity . Make a list and plan accordingly"}, {"username": "Tara Roed", "comment_text": "We opted for a convenient location in Sorrento and it was worth it to us. It was easy to\nWalk to restaurants, shops and to get the ferry. We had a pool\nAnd lemon grove so it checked a lot of the boxes for me and my kids. We took a lot Of ferries and they liked having a nice pool\nA the end of a hot day. It was an amazing hotel. https://\nwww.hotellafavor\nita.com/mobile/"}, {"username": "Virgz Van Møøre", "comment_text": "Stay central. Sorrento : Palazzo Montefusco. Firenze : bnb Santo Spirito Venti"}, {"username": "Jason Hobel", "comment_text": "Is Sorrento we stayed in Casa Evelina Sorrento. It is a 5 minute walk to the train station and 5 minute walk to center of town. In Florence we stayed at Porta Nera."}, {"username": "Greg Saba", "comment_text": "We have driven all over Italy, but not when it comes to larger city centers (and we count both Florence and Sorrento in that description, although Sorrento more so because of its congestion). We dropped our rental car at the airport the last time we were in Florence. Stayed in Oltrarno (photographed),\nthe other side of the Arno. Minutes walk to the center. Day trip train to Siena from there. We long ago gave up on the daytime crowds in Florence, the \"skip the line\" lines, and one tour group after the next. But we like to walk the streets in the morning and love the evening atmosphere. On multiple trips to Sorrento, we also have stayed in the center, used rail to Naples, Pompeii, bus to Amalfi and ferry to Capri. Fortunately public transport in and out of these places is better than cars. We know that rural agriturismos are popular with some, but we enjoy the action in the city centers in the evening, the restaurants, the shops, the passeggiata."}, {"username": "Cynthia Tarantino", "comment_text": "If you want to see the city...then make it easy and stay in the city"}, {"username": "Renae Larcus", "comment_text": "Stay in the city. So much more convenient."}]}, {"id": "2198698170529261", "text": "Hey! Any recommendations for parties/nightlife in the Dolomites between Christmas and New year? Thankyou 😃", "link": "facebook.com/groups/1373361046396315/permalink/2198698170529261/", "likes": 0, "comments": []}, {"id": "2198698313862580", "text": "I tried booking a train using Trenitalia but did not see the route/time I needed available but Trainline had it available. Can someone tell me the reason for this? Also, the fare was non-refundable/no changes and it appears that it only charged me for the 2 adults and not for my two kids under the age of 15. Is this correct?", "link": "facebook.com/groups/1373361046396315/permalink/2198698313862580/", "likes": 0, "comments": [{"username": "Frank Hunt", "comment_text": "Yes and visa versa too, I swap between app if a route doesn’t come up. Don’t know why but that’s the way it is."}, {"username": "Pietro Adami", "comment_text": "Maybe the app is showing Italo trains too (which are not run by Trenitalia)"}, {"username": "Sam Mah", "comment_text": "Trenitalia will have the most up-to-date information."}]}, {"id": "2198702957195449", "text": "Hi everyone, looking at hotels in Rome. Has anyone stayed at Hotel Lunetta Roma?", "link": "facebook.com/groups/1373361046396315/permalink/2198702957195449/", "likes": 0, "comments": []}, {"id": "2198707933861618", "text": "Any good Vespa rentals in Rome? For a couple hours", "link": "facebook.com/groups/1373361046396315/permalink/2198707933861618/", "likes": 0, "comments": [{"username": "Ville Lignell", "comment_text": "The electric scooters are better and you find them anywhere. Just download an app."}]}, {"id": "2198709527194792", "text": "I am looking for advice as well as the official website for booking tickets to Pompeii. We will be arriving by local train from Sorrento. If you have done so, please share which website you booked “skip the line” tickets. It appears as if there are multiple entrances, does anyone know which entrance the “skip the line” tickets utilizes and its accessibility from the train?\nOur plan is to access a self-guided audio tour while visiting.\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2198709527194792/", "likes": 1, "comments": []}, {"id": "2198712253861186", "text": "First time to Venice. I’m trying to figure out how you get from the train station to the hotel. Is it all water taxi? Hotel Antico Doge, this is a possible hotel we are looking at. Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2198712253861186/", "likes": 5, "comments": [{"username": "Jenn Messina Babore", "comment_text": "You can take a vaporetto that costs 9.5€/person one way (Route 1). Or you can walk (includes crossing 3 bridges)."}, {"username": "Joanne Calzaretta", "comment_text": "When y r on the vaporetto do they announce the stops??? Or are there signs at each stop?"}, {"username": "Sandra Rodrigues", "comment_text": "I took the water taxi! It was very good and booked in advance. The service was perfect and Venice is wonderful. https://\nwww.getyourguide\n.com/\nvenice-l35/\nvenice-marco-pol\no-airport-trans\nfer-shared-wate\nr-taxi-t6849/\n?partner_id=RRX2\nS3W&utm_medium=\nonline_publishe\nr"}, {"username": "Mary Gregory", "comment_text": "Take a water taxi"}, {"username": "Renae Larcus", "comment_text": "Water taxi or walk. We did. Venice isn’t that big"}, {"username": "Jane Coutts", "comment_text": "Vaporetto - buy a 1 2 or 3 day pass"}, {"username": "Lisa Valdovinos", "comment_text": "We did a water taxi"}, {"username": "Giovanni Pianigiani", "comment_text": "How about a 20 minutes walk? You're likely to walk way more than that in your stay"}, {"username": "Rachael Richardson", "comment_text": "We walked to ours near arsenale"}, {"username": "Kathy Flood", "comment_text": "Private water taxi. Ask your hotel to arrange. Dragging bags thru Venice would not be enjoyable"}, {"username": "Meredith Sclafani Lacerda", "comment_text": "We did a private water taxi. Someone was waiting for us at the airport and took us to the taxi. Great view of the city on the ride in and ride out to the train!"}, {"username": "Peach Panfili", "comment_text": "Look up the stops and get the Vaporetto (which is basically the Venetian version of public transport), - they leave from the steps in front of the train station, then get off at the stop closest to your hotel and walk. Unless you have money to burn avoid the water taxis at all costs."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Take the vaporetto."}, {"username": "Fran D'Alio Im", "comment_text": "You can buy the vaporetto pass when you walk out of the train station or you can buy it online ahead of time. We bought the 3 day pass online before hand. We brought the print out of the purchase and all we had to do was scan the QR codes from the paper and the machine at the ticket station printed our water passes.. was very easy! I called our hotel ahead of time and asked which vaporetto line we needed to take which was helpful when we arrived."}, {"username": "Liz Stabile DeMauro", "comment_text": "Ask your hotel to arrange a water taxi, it might be cheaper than you getting one at the station. The vaporetto stops at all the stops and getting in that after a long plane ride was long and exhausting."}]}, {"id": "2198711267194618", "text": "We are doing a 2 week trip the first 2 weeks of September. 3 nights Rome, 4 nights Castellina in Chianti, with a day trip to Florence, 3 3 nights Camogli and 3 nights in Venice. Looking for ideas to see Portifino or Cinque Terre from Camogli and any tours in Venice. Have Rome booked. Will take restaurant recommendations for any of these places we will have a car when we leave Rome and drop off when we arrive in Venice.", "link": "facebook.com/groups/1373361046396315/permalink/2198711267194618/", "likes": 0, "comments": [{"username": "Connie Wilson", "comment_text": "For Camogli:\n\nhttps://\nwww.golfoparadis\no.it/en/\ntourist-lines/"}]}, {"id": "2198714207194324", "text": "Please help. Next month is our 25th anniversary and we plan to visit Italy for the first time. Arriving Aug 25th and staying for 10-14 days. We are struggling with deciding between the following trips. Which do you recommend and why?", "link": "facebook.com/groups/1373361046396315/permalink/2198714207194324/", "likes": 18, "comments": [{"username": "Ville Lignell", "comment_text": "Puglia & Basilicata any time. Fewer tourists, many sites to see and awesome food."}, {"username": "Ed Wren", "comment_text": "U will have a good time in any of the places you’ve listed, but south of Naples English is less common and public transportation links fewer. The key, wherever you decide to go, is to relax and not try to do/see too much. It is impossible to see everything on a single trip. Do some significant research before u go so u know what u would like to do and see before u are on the ground in Italy."}, {"username": "Laura Jetton", "comment_text": "Really depends on what you want to get out of the vacation.\nMuseum and history- Rome and Florence.\nLaid back and nature - Swiss Alps- Lake Como\nEtc"}, {"username": "Lisa Adams Robertson", "comment_text": "Normally I'd vote for Sicily or Puglia, but I'm afraid the heat will not make it enjoyable in August. I'd try and stay in the Northern regions, and even go up into the Dolomites."}, {"username": "Mary Fortura", "comment_text": "First itinerary- Venice, etc. Avoid Sicily. It’s a disaster to get into and out of right now due to fires."}, {"username": "Alexis Anderson", "comment_text": "I voted for the North Italy/ Switzerland trip due to August being so Hot and thought maybe it would be less crowded 🤷"}, {"username": "Phyllis Snyder", "comment_text": "Next mont? August 2024? You might be way too late to book accommodations and flights !"}, {"username": "Maureen Rebello Hagerty", "comment_text": "I’d go with the first but I’d skip cinque Terre and visit a few more small towns in Tuscany"}, {"username": "Sande Ricci", "comment_text": "I say the first option but leave out 2 of them."}, {"username": "Eileen Felicelli", "comment_text": "There is no city in the world like Roma. I believe you will go to Italy more than once in your life— just wait!"}, {"username": "Janice Rea", "comment_text": "No Milan. Sorrento. Rome. Florence. Venice."}, {"username": "Jackie Smeigh", "comment_text": "Northern Italy in August due to heat."}, {"username": "DeAnna Pulliam Like", "comment_text": "Cinque Terre and Swiss Alps! It is going to be hot... these sound like good places to be during August! Maybe even French Alps (Chamonix) I've been to Swiss Alps and Cinque Terre and love them both!"}, {"username": "Lauren Vassallo Beattie", "comment_text": "So hard because the north is so different from the south. I loved Rome but also loved Naples, and Sienna... i could retire there."}, {"username": "Rosalba Mancuso", "comment_text": "All so beautiful\nBut italy is somewhere u go more than once. So with that being said ..enjoy each place ..dont rush it."}, {"username": "Afroza Akhter", "comment_text": "My family and I are visiting Italy & Swiss from Aug 16 to Sep 02, Our Itinerary is\n4 nights Rome\n4 nights Florence\n2 nights Venice\n2 nights Milan & Lake Como\n4 nights Interlaken\n1 night Geneva"}, {"username": "Sarah Bullen", "comment_text": "I would definitely recommend a day trip to Pompeii if you are staying near there or driving through there."}, {"username": "Paul Distefano", "comment_text": "Turin-ValD'Aost\na-Courmayeur-Ch\namonix-Milan-La\nke Como-Bergamo. We did it in 5 days it was amazing. With 10 to 14 days you can make it even better."}, {"username": "Romina Lauretig Toscano", "comment_text": "If this is your first time in Italy Rome Venice Florence and cinque terre are a must. Next time you can do the South ;)"}, {"username": "Tremayne Mushayahama", "comment_text": "I heard to avoid the beach cities in August. Like CT, Amalfi etc bcz that's when every Italian take the month off"}, {"username": "Alice Francesca", "comment_text": "Middle of August? Stay away from Rome and Florence.\nWe Italians love to visit those cities in the mezze stagioni (middle seasons: spring or fall) but from June to September they are too hot and we go on holiday by the seaside or the mointains"}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "You really can't go wrong with any of these. We are here now celebrating our 25th! We just left Pompeii and it was fabulous! From that location, you can do many side trips that are only a train ride away. Enjoy your adventures and Happy Anniversary!"}, {"username": "Claudia Amp", "comment_text": "SIENA***"}, {"username": "Claudia Amp", "comment_text": "Fa troppo caldo per stare a Roma o Firenze ora, figuriamoci in Agosto. Go to the lakes, Dolomites or choose a seaside location maybe somewhere in Puglia or a small village in Sicily (Amalfi Coast is too crowded and chaotic now)."}, {"username": "Ludwich Zenia Pretorius", "comment_text": "To me you haven't seen or experienced Italy until you've been to Rome. Bare in mind though that Italy is really hot in summer so the further south you go the worse it gets, if you don't do well in humidity then you should maybe rethink Rome in August."}, {"username": "Claudia Baracco", "comment_text": "I'm from Venice, it gets REALLY hot in summer and it's crowded af, would not suggest to visit it in August"}, {"username": "Jonathan Kancir", "comment_text": "Don’t need to leave Italy to get Swiss alps views and vibes! Noticing the Dolomites aren’t on there and they are 😍😍😍 could add cinque terre and the Dolomites to number 2 if you want to stay within Italy"}, {"username": "Lisa Zarlingo Smith", "comment_text": "First time I did Venice, Florence, Cinque Terre, Tarquania, Ponza and Rome and it was AMAZING~ Yu can stay in Venice for three nights and do a day trip to the Dolomites which would give that \"Swiss Alps\" vibe!"}, {"username": "Daniela Benzoni", "comment_text": "Ciao.\nSe vieni in Italia una volta nella vita sicuramente io al tuo posto farei: Roma, Firenze e citta toscane (Lucca e Siena sono stupende), Venezia e Milano.\nNapoli, costiera Amalfitana e Sicilia sono meravigliose. Ma anche il nord Italia con laghi e montagne è fantastico. Le Alpi tra Italia e Svizzera sono bellissime.\nDipende da cosa preferisci vedere,se più natura o arte.\nPer il cibo... ovunque andrai lo troverai fantastico. C'è una differenza totale tra quello del nord e del sud Italia, tra quello del mare e quello della montagna.\nSe opti per le montagne e la Svizzera considera che rispetto all'Italia la Svizzera è cara.\nBuon viaggio!"}, {"username": "Lucrezia Folger", "comment_text": "1st of all there is a big difference between 10 days and 14 days. I'd op for 10 days which should NOT include arriving and departing on either end. All are amazing, different unique, and beautiful. That being said, I say option 1 but not as many places, Rome, Florence, and Venice are plenty. I'd skip Sicily, Sicily is like its own country, and spending the entire time there is reasonable."}, {"username": "Dave Colleen", "comment_text": "We just celebrated our 30. Venice, Florence, Cinque Terre, Rome, Venice."}, {"username": "Rhona OConnor", "comment_text": "Some areas are totally overrun with tourists.... Massive queues, tickets not available. Head up somewhere like Puglia - very few tourist, you are around Italians, and it's stunning!!!"}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "Venice, Florence, Siena and Cinque Terre. Skip Rome for another trip"}, {"username": "Donna Parrish", "comment_text": "Choice one for first timers! You’ll be back! Then take the others!"}]}, {"id": "2198715947194150", "text": "Last week of august. 2adults and 3 kids age 9,6,2.\nSuggestions on itirary starts with Rome and end in Venice -8nights and bonus for best hotel suggestions please. I am thinking 4rome, 2 Milan (only for Vernon’s express)and 2 Venice. Please suggest", "link": "facebook.com/groups/1373361046396315/permalink/2198715947194150/", "likes": 0, "comments": [{"username": "Jenn Messina Babore", "comment_text": "I would skip Milan personally. Florence is halfway between Rome and Venice if you want to add a third location."}, {"username": "Lisa Valdovinos", "comment_text": "Street food tour in Rome."}, {"username": "Connie Wilson", "comment_text": "Instead of the Bernina Express with young children, you could spend two nights near GardaLand on Lake Garda. You could choose a hotel nearby on the lake or with a pool.\n\nhttps://\nwww.gardaland.it\n/en/"}, {"username": "Peach Panfili", "comment_text": "Milan not really a city that lends itself to children and lots of walking for a 2 year old in Venice as even strollers are tricky with bridges that mostly have steps. Rather than Milan Florence and or Verona might be a better option between Rome and Venice. Also will probably still be hot and crowded."}]}, {"id": "2198720613860350", "text": "We will be in Rome middle of October. Please advice us a venue for our 9 year old grandauther's birthday.", "link": "facebook.com/groups/1373361046396315/permalink/2198720613860350/", "likes": 0, "comments": []}, {"id": "2198721247193620", "text": "Anyone been to crema? And know the easiest way to get there", "link": "facebook.com/groups/1373361046396315/permalink/2198721247193620/", "likes": 1, "comments": [{"username": "Colleen Dawson", "comment_text": "Rome2rio app will give you all the information you need to travel from A-B, options, cost and mode."}, {"username": "Lori DeBlasi", "comment_text": "Yes! Beautiful - Loved it!\nWe took Trenitalia from Milan. It was very easy to navigate the one transfer and inexpensive."}]}, {"id": "2198722267193518", "text": "What is the app for share taxis to work out costs with friends", "link": "facebook.com/groups/1373361046396315/permalink/2198722267193518/", "likes": 0, "comments": []}, {"id": "2198723883860023", "text": "Tonight is the final night of our amazing three week first trip to Italy. We absolutely loved it and this group was a great resource in my planning.\n\nAnyone have recent experience with Florence airport. Our first leg is to Frankfurt with connecting flight back to Vancouver.\n\nHow early should we be there for a 10:25AM flight tomorrow?\n\nWe are staying in Florence and have only carry on. The first leg is economy.\n\nThanks.", "link": "facebook.com/groups/1373361046396315/permalink/2198723883860023/", "likes": 5, "comments": [{"username": "Brian Marcus", "comment_text": "Safe travels! We're heading home after nearly two weeks from Rome tomorrow and very very sad about it!"}, {"username": "Jenn Messina Babore", "comment_text": "At least 2 hours ahead."}, {"username": "Maria LaPietra Guerrero", "comment_text": "2 hours is fine make sure to reserve taxi to get there. We reserved Uber ( not knowing there is no Uber there) and almost missed our flight"}, {"username": "Melinda Brown", "comment_text": "Be there early, check in and go straight to the gate. I almost missed my flight. Because they take a bus to the plane or at least at gate 3 they do.\nGate 1 upstairs\nGates 2 and 3 downstairs\nNice clean airport"}, {"username": "Molly Elizabeth", "comment_text": "The Florence Airport is very small. We got there about 2 hours early and we got our bags checked and through security very quickly. 2 hours if plenty of time! Depending on where you are staying in Florence, you can take the tram and it drops you off right outside the airport."}, {"username": "Paula Brink", "comment_text": "It’s a small airport, if you check in online first 2 hours should be enough. I was there in April doing the exact same flight routing to YVR as you. Mine was one of the first flights of the morning and it took a fewminutes longer than normal initially because they don’t have those automated machines for baggage tags and boarding passes (if you want a paper one). Everyone had to line up for that and bag drop.\nHowever you are doing carry on only so should be just fine as long as your carry on bags meet the Air Dolomiti size requirements.\nHave your hotel book you a taxi the night before, it’s not a very long drive to the airport and I think I paid 24 euro. They prefer cash but will take card."}, {"username": "Patricia Klimchuk", "comment_text": "Was there last year, very small airport. 2 to 3 hours depending on the time of day.They can change gates. You have to take a bus. You walk on the tarmac."}]}, {"id": "2198664637199281", "text": "Ah Roma! Sharing pics of this beautiful city, which was the my teens’ favorite - walking the cobblestone streets and finding something interesting at every turn-history, churches, sculptures, and architectureआणखी and food! Interesting fact-there are many Egyptian artifacts and traces of Egyptian civilization in Rome from Ancient Rome when the Romans had conquered Egypt.", "link": "facebook.com/groups/1373361046396315/permalink/2198664637199281/", "likes": 107, "comments": [{"username": "Colleen Kelley", "comment_text": "Any pointers on tours or dealing with the heat\nWe’re going in august with 13 and 15 year old boy and girl"}, {"username": "Lilly Raymond", "comment_text": "My kids are 15 and 18. They liked going back to see the sights, like the Spanish Steps, Trevi etc. at night. During the day we took lots of breaks to get gelato, local snacks, granita, etc. because it was so hot. I also recommend Janiculum Hill because you can see the entire city abd there are street vendors, music. Our teens really enjoyed a pizza and gelato making class in Florence-someth\ning to consider in Rome."}, {"username": "Tori Clark", "comment_text": "Beautiful pictures. Thank you."}, {"username": "Rebecca Mansori Setareh", "comment_text": "Soo hot🥵🥵🥵"}, {"username": "Nana Esther Bertolino", "comment_text": "Remember the air conditioner is temperature controlled . I would try to re book your trip for October"}, {"username": "Erica Willard", "comment_text": "Megan Sturgeon"}, {"username": "Rob MacFarland", "comment_text": "Just purchase our tickets for November (1st trip to Italy). Can't wait!"}, {"username": "Carmen Loughner", "comment_text": "Judy Maccarelli"}, {"username": "Carmen Loughner", "comment_text": "Debbie Loughner"}, {"username": "Matteo Gallizioli", "comment_text": "did u visit \"cappella sistina\", i'm italian and in my opinion is the best masterpiece of art in the country"}, {"username": "Jeanne Zorich", "comment_text": "Great pictures!! I want to go back"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2198683783864033", "text": "I am looking for ideas to travel from Italy to Switzerland for - short 1-2 days. Any ideas?? Is there a tour on a train?", "link": "facebook.com/groups/1373361046396315/permalink/2198683783864033/", "likes": 0, "comments": [{"username": "Colleen Dawson", "comment_text": "Viator will have some listed."}, {"username": "Vasthi Cheddar", "comment_text": "Not sure about tours but we just took the train from Milan to Bern... there are multiple options to different cities"}, {"username": "Alejandro Gabriel Valenzuela Anghileri", "comment_text": "If you are in Milan and love the Alps you could get Bernina Express from Tirano to St. Moritz"}, {"username": "Katie Mahoney-Salajan", "comment_text": "Thank you so much!🤗"}]}, {"id": "2198674753864936", "text": "So happy to find this group. Hoping to find a good rental in Sorrento next year. 🤞", "link": "facebook.com/groups/1373361046396315/permalink/2198674753864936/", "likes": 1, "comments": [{"username": "Tiffany Hadfield Merrill", "comment_text": "Loved this little hotel! Near everything, and best was the local supermarket for water, fruit, wine & food.\nHotel mignon"}]}, {"id": "2198676000531478", "text": "Are there any travel/ tour companies recommended for Italy? I know of Contiki and Topdeck but i was wondering if theres any others that people recommend", "link": "facebook.com/groups/1373361046396315/permalink/2198676000531478/", "likes": 1, "comments": [{"username": "Cassandra Goodgame", "comment_text": "I have used Audley Travel and Arrividerci Puglia and was very happy with both."}, {"username": "Sigrid Cormier", "comment_text": "Globus or cosmos better?\nAdmittedly, whilst Cosmos and Globus are owned by the same company; Cosmos is the cheaper end of the scale. I found that the only real difference is that the Cosmos Groups stay in 3 star hotels and the Globus Tours stay in 4 star hotels and have a few more meals and better optional excursions included.\nI have used these tour companies, there are others. Carefully read what exactly you will be seeing or driving by, look at their optional tours.\nGoogle where the hotels are located. With Cosmos you’ll be on the outer edge or outside of town, so transit can be difficult on your own.\nGlobus tours usually are in town so you can have a nice stroll, window shop, go to a pub, catch a bus etc."}, {"username": "Beth Heys", "comment_text": "G Adventures and Intrepid. I have travelled with both of them in Europe and other countries around the world and enjoyed them"}]}, {"id": "2198682603864151", "text": "Any suggestions for a rooftop restaurant in Rome? Looking for great food and views. TIA", "link": "facebook.com/groups/1373361046396315/permalink/2198682603864151/", "likes": 2, "comments": [{"username": "Ville Lignell", "comment_text": "https://\nwww.biohotelraph\nael.com/\nraphel-hotel-res\ntaurant-in-rome\n.htm"}]}, {"id": "2198517653880646", "text": "Travelling in November. My husband wants to visit Pompeii with our kids (12 and 14) while I attend a conference in Rome. Any recommendations on how to get there and any tours? Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2198517653880646/", "likes": 4, "comments": [{"username": "Alexander Genschur", "comment_text": "Fast Train to Napoli -> Train (transvesuvio) to pompeii-> visiting -> Same way Back.\n\nPossible in a day."}, {"username": "Elizabeth Harris Moritz", "comment_text": "Train. You can find a local guide when you get there. Supports the local economy. Trains are wonderful and you can get your tickets in advance."}, {"username": "Kathy Flood", "comment_text": "They should also visit Herculaneum."}, {"username": "Maria Brozou", "comment_text": "I think in august will start to operate a train that goes directly from Rome to Pompeii. Try to Google it."}, {"username": "Tara McCloud Odebrecht", "comment_text": "This isn’t going to be super helpful. We took the train from Sorrento and you get off the train right across the street. We took the train to Naples gate for pizza. It was Super convenient.\n\nI can’t find the tour guide info. But the advice I can give is schedule your tour right when they open. You avoid the heat and the crowds. It made it tolerable for our kids. It was great."}, {"username": "Jenn Messina Babore", "comment_text": "It’s worth hiring a guide to walk you around in Pompeii. You can do so when you get there. The kids will be free for entry. Train available from Rome."}, {"username": "Richard Stein", "comment_text": "It's a very simple train ride, Rome to Naples, Naples to Pompeii Trenitalia or CCircumvesuvian\na/Campania Express. One piece of advice, there are three entrances into Pompeii, one at the train stop(Porta Marina) another down the hill (Piazza Esedra) , where all souvenirs are cheaper than by the train stop and another further down on( Piazza Anfiteatro), closer into town. This is the best entrance, with the most too see and enjoy, especially with kids."}, {"username": "Eileen Steiniger", "comment_text": "We did a bus tour (from Rome) of Pompeii through Viator. Really enjoyed it."}, {"username": "Tari Lawson", "comment_text": "Years ago I booked a tour. Basically it was just bus transportation to Pompeii and back with a bathroom stop in the middle. It was inexpensive and a great way for my mom and I to travel to Pompeii. I wasn't comfortable navigating the trains."}, {"username": "Michelle L Williamson", "comment_text": "There is no shade at Pompeii - so dress appropriately and take sunscreen. Also be mindful on the trains if your possessions. We loved visiting Pompeii."}, {"username": "Martin-John Rubio", "comment_text": "Do a search on the home page and there are oodles of info 👍🏽👍🏽"}, {"username": "Luigia Gray", "comment_text": "I'm pleased you are taking your children to\nPompei. Went there a couple of years ago and it was fantastic."}, {"username": "Teresa Fattore", "comment_text": "We organised a tour on a bus and with a tour guide, picked us up at a cafe in the piazza in Rome 😊"}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "Book through Viator and make sure it's Askos Tours. We just had our tour last weekend. These tours are guided by archeologists and in very small groups. Very thorough in all the explanations of what happened. We'd definitely do this tour again in the future. Very reasonably priced too!"}, {"username": "Madeline Caporale", "comment_text": "The new high speed train from Rome to Pompeii only operates the third Sunday of the month. Viator offers day trips.\nAnd this from a Google Search:\nWith several departures per hour, the fast frecciarossa trains from Rome to Naples followed by the local train to Pompeii is the best way to do a day trip on your own. Your travel time from Roma Termini to Pompeii is around 2 hours and the station for Pompeii is right outside the main entrance."}, {"username": "Nakitha Badon", "comment_text": "We took a train that literally drops you off in front of Pompeii and we toured and went back."}, {"username": "Rachael Richardson", "comment_text": "We got a self guide audio tour - went when it opened at 9am much better than a tour ! We went straight to the back of pompeii and worked our way back to the exit - booked through Headout skip the line with self guide audio , teen daughter thought this was better than a tour"}, {"username": "Peach Panfili", "comment_text": "Booking a tour guide is a very good idea and your children will learn a great deal more than if you go it alone."}, {"username": "Jenny Clough", "comment_text": "Be sure to get the air conditioned train! My opinion you should do the tour/guide. So much incredible information that you would never learn without a guide!"}]}, {"id": "2198464490552629", "text": "looking for any travel tips for visiting small towns using Bologna as a base, also tips for Bologna! thanks", "link": "facebook.com/groups/1373361046396315/permalink/2198464490552629/", "likes": 4, "comments": [{"username": "Janice Foote", "comment_text": "Ferrara, Modena, Parma"}, {"username": "Cecilia Christine Costantini", "comment_text": "Visit Ferrara and its beautiful Castello Estense. Easy to reach by train from Bologna."}, {"username": "Scott Perry", "comment_text": "For Bologna, cocktails at Guero on via Goito."}, {"username": "Ville Lignell", "comment_text": "Ravenna."}, {"username": "Monica Sucato", "comment_text": "Ferrara, Parma, Modena"}, {"username": "Louisa Feliziani", "comment_text": "I also recommend Modena. Balsamic vinegar tour is a must ! There’s lots to see. Also Pavarotti’s restaurant is a great dining experience !"}, {"username": "Miyuki Kanno Paul", "comment_text": "Day trip to Ravenna for UNESCO sites.\nFaenza for their famous ceramics"}, {"username": "Stefano Follador", "comment_text": "If you are into wines in Bologna check enoteca mia cantina, is in the city center. They have a wide selection of Italian small producer. Totally recommended.\nA day trip to San Marino is also a nice idea."}, {"username": "Zucchero Candito Kandinsky", "comment_text": "Ravenna, Modena, Parma, Ferrara. Local trains will get you there, tickets are inexpensive. In Bologna check Cantina Bentivoglio, a jazz club with a great restaurant, Mortadella Lab for a great panini, Berberè for pizza"}, {"username": "Gianluca Rivizzigno", "comment_text": "Outside Bologna is Dozza, which is stunning. Lugo is also beautiful. Ravenna is a must. If you visit Faenza, Brisighella is also fabulous.\n\nhttps://\nemiliaromagnatur\nismo.it/en/\ntowns/dozza"}, {"username": "Paula Lazeski", "comment_text": "If possible, visit Ravenna, east of Bologna on the Adriatic. The byzantine churches filled with amazing mosaics are breathtaking."}, {"username": "Shirley Lewis", "comment_text": "thank you SO much! I have written all this wonderful information in my notes, I will certainly report! I have spent a lot of time in Florence, if you need info there; however, it has become so very crowded and is not the Florence I knew years ago 🙁 so now I want to explore these lovely small towns y'all (I'm from Texas 🙂 ) are telling me about!"}, {"username": "Matteo Gallizioli", "comment_text": "Modena (house of Ferrari)\nParma (lovely city with a lot to eat!!)\nRavenna (a lot of story)\nFlorence (not need description...)\nSan Marino"}, {"username": "Graham Hyde", "comment_text": "https://\nwww.google.co.uk\n/\nurl?sa=t&source=\nweb&rct=j&opi=8\n9978449&url=htt\nps%3A%2F%2Fwww.\nda-cesari.it%2F\n&ved=2ahUKEwiSr\nPr3s7SAAxULLsAK\nHbpeDGoQFnoECBk\nQAQ&usg=AOvVaw3\nXjJaY9td6ncZywA\nEzEjn6"}]}, {"id": "2196507520748326", "text": "Has anyone booked a Europe package through Costco travel ?", "link": "facebook.com/groups/1373361046396315/permalink/2196507520748326/", "likes": 0, "comments": []}, {"id": "2197744143957997", "text": "Our trip to Rome in May 23.", "link": "facebook.com/groups/1373361046396315/permalink/2197744143957997/", "likes": 34, "comments": []}, {"id": "2198403663892045", "text": "Edited: We have one day in Florence and one day in Pisa what would you go see in each place? Probably would spend only half day in Pisa", "link": "facebook.com/groups/1373361046396315/permalink/2198403663892045/", "likes": 1, "comments": [{"username": "Tari Lawson", "comment_text": "Definitely go see the David."}, {"username": "Sue Ramsey", "comment_text": "Florence!"}, {"username": "Yolanda Arena", "comment_text": "Florence"}, {"username": "Debra Killian", "comment_text": "Florence"}, {"username": "Ildikó Székely", "comment_text": "Florance"}, {"username": "John Licata", "comment_text": "Two days in Florence.\nDavid, Il Duomo, Uffizi,\nThe best part of Pisa is the choir in the baptistery, designed for them to sing with their own echo"}, {"username": "Joanna Adamczak", "comment_text": "Florence; instead of Pisa I would choose Pienza, Siena."}, {"username": "Donna Labbe", "comment_text": "Florence"}, {"username": "Roger W Ilsley", "comment_text": "Florence"}, {"username": "Nana Parinos", "comment_text": "Uffizi Gallery, Florence"}, {"username": "Tony Indorato", "comment_text": "Another day in Florence"}, {"username": "Frances McDonagh", "comment_text": "Florence defo"}, {"username": "Julie Agarkov Mayblyum", "comment_text": "I don't know if you need a full day in Piza, walking around the main tourist attraction will take about an hour."}, {"username": "Ann Marie Laface", "comment_text": "Florence"}, {"username": "Maria Y Alexieva", "comment_text": "Forget about Pisa. Probably the only boring place in Italy."}, {"username": "Franco De Luca", "comment_text": "You do not need anywhere near a full day in Pisa. You go see the tower and you leave and spend the rest of your time in Florence. Pisa has nothing else to see but that. I have no need to ever go back to Pisa after seeing the tower more than once. Enjoy Florence! So much more to see and do in Florence!"}, {"username": "Jhermie Ortega", "comment_text": "Laine Luis"}, {"username": "Linda Snaring", "comment_text": "I would go to Florence. You do not need a whole day for Pisa. ￼We only spent half a day. I thought Pisa was beautiful!"}, {"username": "Steven Gutin", "comment_text": "No brainer. Florence"}, {"username": "Max Sorber", "comment_text": "Skip Pisa"}, {"username": "Lisa Williams", "comment_text": "Forget Pisa and enjoy 2 days in Florence."}, {"username": "Candy Mattiello", "comment_text": "Florence… the David, The Uffizzi, Ponte Vecchio"}, {"username": "Donna Riffle Hutcheson", "comment_text": "Pisa is beautiful, but you only need a few hours there Be sure to see the Bapistry!"}, {"username": "Patricia Hall", "comment_text": "I would do 2 Days in Florence"}, {"username": "Belinda Cooper Hockings", "comment_text": "Paul Riding"}, {"username": "La Cinzia", "comment_text": "Volterra is much more interesting than Pisa!"}, {"username": "Katie Beth", "comment_text": "We just returned from Florence, and my only suggestion is (for your one day in Florence), try and get \"skip the line\" tickets for the galleries. While we were into Uffizi within 10 minutes, we had to queue for 3 hours to get into Accademia (which was well worth it to see the Statue of David, in my opinion, I was far more impressed than I expected)! Ponte Vecchio as someone else suggested is lovely also, but you can see that and explore the shopping there any time of night, so I would try and book Accademia as early in the morning as possible. Duomo Cathedral was also worth seeing. The good news is as long as you are reasonably fit, everything is within easy walking distance which makes it super simple to get around."}, {"username": "Jon McPheeters", "comment_text": "Skip Pisa. Much more of interest in Firenze"}, {"username": "Peach Panfili", "comment_text": "Forget Pisa and stay in Florence."}]}, {"id": "2198426637223081", "text": "Good morning! Looking for some honeymoon recommendations and inspiration...\n\nWe are doing a destination wedding in Umbria in July 2024 and are planning to honeymoon right after. We will have 10-14 days for the honeymoon and would like to stay in Northern Italy (Florence and above). We want to make the most of our time in Italy, but are also mindfulआणखी that we will want to relax a bit after a busy wedding week.\nSome of our thoughts so far include:\n-Florence (with day trips to vineyards etc)\n-Cinque Terre\n-Lake Como (a must for us, and want to spend at least a couple days here)\n-Venice\n\nAny other must visit towns or locations? Any recommendations on how many days to stay in each location, and the best way to get between them (we don't mind renting a car).\n\nI should note that we need to fly back to the US at the end, so will need to end in a larger city to make catching a flight easier.\n\nThank you in advanced!", "link": "facebook.com/groups/1373361046396315/permalink/2198426637223081/", "likes": 6, "comments": [{"username": "Graham Sherlock", "comment_text": "Get married at home and honeymoon in Italy, avoid all the hassle"}, {"username": "Nóra Fonyogábné Zsebeházy", "comment_text": "Appr. 30 mins by car from Venice:\nDe Stefani winery\nCioccolateria Veneziana\nAlso recommend to visít Caorle with beautiful historical town and long, sandy beach"}, {"username": "Virgz Van Møøre", "comment_text": "Lake Como, you will adore it and never want to come back"}, {"username": "Louise Wilson", "comment_text": "Spend as much time as possible in the Italian Lake District, such as Lake Como or other village, then a few days in Milan for seeing the important sights (the original fresco of The Last Supper) etc, then fly out of Milan. I did this and it worked perfectly, but that was 20 years ago."}, {"username": "Colleen Carollo Oxsalida", "comment_text": "I know you say that Lake Como is a must, but we were there for a day trip in June (Bellagio) and it was ridiculously crowded — to the point that it was not enjoyable. We stayed in Stresa on Lake Maggiore and absolutely LOVED it! It was stunning and sooo relaxing. Our second favorite city that we visited was Verona. Such a great vibe in that city."}, {"username": "Joanne Wright", "comment_text": "My daughter got married in Umbria! It was magical!"}, {"username": "Paul Davis", "comment_text": "After visiting a couple weeks ago, I’m pushing Ortisei as the place to be in the summer. It is one of the most beautiful places in Italy and temps in mid 70s while Florence is in the 90s."}, {"username": "Marcia Levy", "comment_text": "Our son had his destination wedding in Puglia 5 years ago. It was magical.\nNorthern Italy is so fabulous. You can end your trip in Venice and fly home from there. Lake Como and Lago Maggiore and both wonderful. Lago di Garda is gorgeous. Try to stay in just a few places so you can relax.\nOtherwise you will be spending too much time in the car!\nI would recommend renting a car. Congratulations\n. A great way to begin your life together ."}, {"username": "Stefano Follador", "comment_text": "Well Umbria is really nice, somehow a more rustic version of Tuscany.\nMontefalco, Assisi and Orvieto are really nice and in the area there are winery and olive oil.\nIf you heading north in Veneto region I can suggest you to visit Valdobbiadene area. I know it’s where I live but the area is lovely and if you want to do a Prosecco tasting, my family winery is open for you.\nPersonally I suggest you to make a radical decision. In just one trip is hard to fit everything, maybe do less but do more. I mean a day trip to 5 Terre is nice but you’ll just be able to do a couple of pictures and that’s it"}, {"username": "Nancy Koehler Barboni", "comment_text": "Dolomites are lovely! Cortina is beautiful but more of an Alpine feeling!"}, {"username": "Nancy Koehler Barboni", "comment_text": "I love Assi too!"}, {"username": "Tina Petraglia", "comment_text": "I live in Valsolda, Italy, on Lake Lugano (or as the Italians call it, Lake Ceresio). Our town is a tiny, quiet town, 10 minutes from the border of Switzerland, and a 20 minute drive from the town of Menaggio on Lake Como. If you travel around Lake Como, which is certainly more touristy, and are looking for nature and relaxation, check out my area. We’ve got hiking paths, lakeside relaxation with no crowds, natural mountain springs, boat rentals and so much more. I’m biased, but…"}]}, {"id": "2198416437224101", "text": "Hi all I just want some advice on buying a euro rail pass I’ll be travelling through Italy for 2 weeks and other parts of Europe for another 2 what is the best option to choose for the euro rail pass I’ll be traveling between places most days/ every second to third day so will definitely be using the train a lot any suggestions?\n\nThank you in advance", "link": "facebook.com/groups/1373361046396315/permalink/2198416437224101/", "likes": 0, "comments": [{"username": "Johanne Montpetit", "comment_text": "following"}, {"username": "Sam Mah", "comment_text": "Very hard to answer. If you plan and buy rail tickets early, sometimes it can be more cost effective to buy them from the rail providers. If you want flexibility to change destination/\nday/time of travel then a Eurail/ Interrail pass may be best for you.\nSketch out a plan of where you want to go, get on each countries rail service provider sites and work out what the cost is for next week and when you expect to travel, because sometimes the earlier you buy tickets the cheaper they will be. Once you have an idea of prices check to see if there is a Eurail pass that saves you money."}, {"username": "Rhona OConnor", "comment_text": "I just bought the tickets a day or two in advance. Only did 4 journeys so didn't think the rail pass would be cheaper. Worked out ok for us."}]}, {"id": "2198457660553312", "text": "Hi all,\n\nIm planning my first trip to Italy in october.\n\nI have two options for the last 3-4 days of the trip - either go to Florence (2 nights) and Milan (1 night), or go to Naples from Rome and then explore the surrounding areas (3 nights altogether).\n\nWhat are some suggestions?\n\nAlso, what are some reasonable accommodation options in Naples that arent very pricey either.\n\nThanks all.", "link": "facebook.com/groups/1373361046396315/permalink/2198457660553312/", "likes": 0, "comments": [{"username": "Jenn Messina Babore", "comment_text": "I would spend all 3-4 days in Florence and skip Milan."}, {"username": "Morgan Eicher", "comment_text": "Florence and Milan for sure! Lots of amazing heritage, wine and history in Florence. Milan is often overlook but there is a lot to do and has great shopping."}]}, {"id": "2198464437219301", "text": "#italy #Venice #hotelanticheFigure Hotel Antiche Figure ❤️🇮🇹 you have 💯 to us and our stay was amazing 👍#love Frank E. Aita Lynne McInally", "link": "facebook.com/groups/1373361046396315/permalink/2198464437219301/", "likes": 3, "comments": [{"username": "Lynne McInally", "comment_text": "It is directly across from the train station 🚉 we walked to it"}, {"username": "Claudia Clipsham", "comment_text": "Lynne, your pictures are filling me with wonderlust and hunger! (I mean, the food looks amazing!) It looks like you had a glorious trip! Thank you for sharing it with us!"}]}, {"id": "2198464903885921", "text": "Walking tour of Vietri sul Mare this afternoon.", "link": "facebook.com/groups/1373361046396315/permalink/2198464903885921/", "likes": 2, "comments": []}, {"id": "2198468637218881", "text": "Can someone help me understand what I need to climb Mt Vesuvius? We want to do Pompeii then climb Mt Vesuvius. I don’t understand if these are close to each other or not. I have read I need a ticket for Mt Vesuvius too. Do they have cars waiting to take you to the point you climb from or do I need to book something or it’s included with the ticket. It’s confusing to me. Also, is there somewhere like a cafe for those that don’t want to climb it to sit and wait for the others? Help. Thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2198468637218881/", "likes": 3, "comments": [{"username": "Andria Saia", "comment_text": "We took a “tour” that took you part of the way up Vesuvius and then you hike the rest. Don’t know about a place to wait except there are some cafes near Pompeii"}, {"username": "Sigrid Cormier", "comment_text": "There is a small coffee shop where the cable car/lift if. You can stay there and wait. I’ve attached a link for you to review, it will answer all your questions.\nhttps://\nwww.leisure-ital\ny.com/\ntravel-tips/\nvisit-mount-vesu\nvius-everything\n-you-need-to-kn\now/"}, {"username": "Angela Gilmore", "comment_text": "Hi, this is the official website of National Park.\n\nThere are different itinerary, but the one that arrives at the crater is the \"Gran Cono\". You can arrive at the entrance by bus or taxi from Ercolano Scavi (super close) or from Pompei Scavi. I suggest you visit Pompei Scavi first, then go to Ercolano scavi by train and then go to the Vesuvio from there by bus or taxi.\nThe bus or taxi leave you in the parking area which is 1km away from the real entrance to the park and the beginning of the itinerary, but everyone go to the entrance on foot.\n\nPlease, remember that you cannot enter in the park for a tour after 6pm (the park do not close but you cannot enter anymore).\n\nhttps://\nwww.parconaziona\nledelvesuvio.it\n/en/\nvisit-the-park/"}, {"username": "Romana Svítková", "comment_text": "We booked a tour from GetYourGuide, they took us to Pompeii from Napels for a half day tour, then lunch, then they took us to almost the top of Mt. Vesuvius and we climbed the rest ourselselves. Then they brought us back to Naples."}]}, {"id": "2198470027218742", "text": "I know this group is travel tip sharing group. But I can’t think of any other better group to ask for advices. I am from Myanmar. I am going to Venice in coming September for University.\nBut I am struggling to find a single room to live for a year in Venice. I am in several groups of housing.\nI saw many posts of houses for tenants. I always dm themआणखी as fast as I can. But neither of them read and reply our messages🙂. So what is the point of inviting tenants when they have no intention to reply us🙂. All I can think about is this active group.\nI know people in this group are kind and enthusiastic to share great tips and experiences.\nSo if you have any tips about renting a room in Italy\nor if you know someone who rents rooms in Italy, please let me know. I really need you guys’ help.\nThank you so much for your attention.", "link": "facebook.com/groups/1373361046396315/permalink/2198470027218742/", "likes": 6, "comments": [{"username": "Dave Conroy", "comment_text": "Several students have rented my Airbnb room for a month or so while they settle in the UK (not Italy, sorry) and find somewhere else to stay. I suspect it's easier to do that. Many Airbnb hosts offer significant discounts for a week, month, or whatever. It might be worth looking at."}, {"username": "Paula Brink", "comment_text": "Try looking in nearby Mestre. Probably more options and more affordable."}, {"username": "Andrea Marie", "comment_text": "The university should be able to help steer you in the right direction. Contact their student housing office."}, {"username": "Alice Francesca", "comment_text": "Find a room in a cheap airbnb for the first month, in Mestre.When you are there it will be easier"}, {"username": "Marie Beseau", "comment_text": "I believe that, in Venice there are monasteries that rent rooms to students."}, {"username": "Joanne Harte", "comment_text": "You could possibly also live in Padua, it has its own university so there are lots of students and it’s only 20mins to Santa Lucia (the Venice islands) train station. The trains are very regular. I lived in Padua and it was very easy to get to Venice from there. I would suggest accommodation Facebook groups. I used to be in one for Padova and it was very helpful"}, {"username": "Bob Dook", "comment_text": "Commuting is an option you should consider. Last time I visited Venice, I stayed just outside Padua and travelled in and out of Venice."}, {"username": "Samantha Carlo Pessotto", "comment_text": "I would book an air bnb for the first few weeks, once you are there you will meet other people and students and you could house share, local contacts will be more helpful in person."}, {"username": "Cecilia Christine Costantini", "comment_text": "Have you joined any Erasmus group here on facebook, e.g. Erasmus a Venezia affitti case e stanze? You can post a message there saying you are looking for a room"}, {"username": "Cecilia Christine Costantini", "comment_text": "Have you joined this group?"}, {"username": "Cecilia Christine Costantini", "comment_text": "Also this group"}, {"username": "Paul Davis", "comment_text": "Maybe contact some short term rental owners. You may hit one that is fed up with short term gigs and would welcome a year long stay."}, {"username": "Silvia Urbinelli", "comment_text": "It would be much easier to look for a room in Mestre."}, {"username": "Alessandro Iannelli", "comment_text": "the lack of rooms for university students (unless you are willing to pay way too much) is a known problem in Italy, so much so that it's in the news sometimes and that there are discussions in the Parliament about it. It isn't of course always hard (it also depends on the city) or as hard as it is being in your case, but it's a big issue for many students. My advice is to look in neighboring towns, you may end up spending less than living in venice even when taking commuting into account."}]}, {"id": "2198474027218342", "text": "Sadly it’s the leg of our trip!! Heading to Milan from Bellagio but dropping our rental car off first near the airport. Is public transit do-able to get from Malpensa airport to Milan city center? We’re staying at the Aethos Hotel.", "link": "facebook.com/groups/1373361046396315/permalink/2198474027218342/", "likes": 1, "comments": [{"username": "Martin-John Rubio", "comment_text": "Piece of cake 👍🏽👍🏽"}, {"username": "Pietro Adami", "comment_text": "There is a train to Milano Centrale station"}, {"username": "Colleen Dawson", "comment_text": "Yes."}, {"username": "Connie Wilson", "comment_text": "Yes. Take the Malpensa Express train to Milano Centrale Station and then a taxi to your hotel."}, {"username": "Frank Hunt", "comment_text": "Rail is easy."}, {"username": "Stefano Follador", "comment_text": "Milano is a really good city about public transportation"}, {"username": "McKayla Ellsworth Greco", "comment_text": "Thanks everyone!! Worked out great. One more question, can boys wear shorts to the duomo? I see Bermuda shorts could be acceptable?"}]}, {"id": "2198477427218002", "text": "Hi guys,\nI want to travel to italy to do shopping in October, where i can find the best outlet milano or roma ?", "link": "facebook.com/groups/1373361046396315/permalink/2198477427218002/", "likes": 2, "comments": [{"username": "Terry Spincic", "comment_text": "60 km out of Milano on the Genova way"}, {"username": "Princess Queen", "comment_text": "Serravalle scrivia between Genova and Milano,the fox town in Mendrisio Swiss its one hour drive from Milano,Vicolung\no,Fidenza village all near Milano ,La Romana near Rome,"}, {"username": "Daniela Benzoni", "comment_text": "Vicino a Milano trovi Vicolungo outlet (Novara).\nOppure c'è il Franciacorta Village che è sulla strada tra Milano ed il lago di Iseo o il lago di Garda. Ti conviene guardare sui siti se ci sono negozi di tuo interesse."}, {"username": "Elena Innocenti", "comment_text": "The best outlet in Italy is The Mall 1hour far away Firenze (there are bus direct from SMN station to mall), is Luxury outlet (Gucci, Prada, Armani, Versace…) with some casual brands (Nike, Diesel…)\nNear Roma the best is Castel Romano Outlet. You can find a mix of shop, but mostly casual plus some like Versace, Missoni, Philip Plein, Armani…\nI think you can reach by special bus from Termini station, but not sure."}, {"username": "Pietro Adami", "comment_text": "https://\nfirenze.themall.\nit/it"}, {"username": "Romina Lauretig Toscano", "comment_text": "https://\nwww.mcarthurglen\n.com/en/\noutlets/it/\ndesigner-outlet-\ncastel-romano/"}, {"username": "Christiana Xenofontos", "comment_text": "Serravalle outside milan towards genoa"}, {"username": "Chiara Pirrello", "comment_text": "Serravalle Scrivia best outlet in Europe!"}, {"username": "Sarah Hadjinian Kirakossian", "comment_text": "I heard the Mall which is outside of Florence."}]}, {"id": "2198505630548515", "text": "We are going to Italy in August. We will need to travel from Rome to Salerno (then do the reverse trip). Which train is best, Trenitalia or Italo? Do they have multiple stations? We will be staying at the Hotel Shangri-La when we leave Rome, and the Rome Marriott Park Hotel when we return. Will we need to plan for transportation to/from the train? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2198505630548515/", "likes": 0, "comments": [{"username": "Colleen Dawson", "comment_text": "Rome2rio as well as Seat61 are 2 resources to check."}, {"username": "Jenn Messina Babore", "comment_text": "I would go with TrenItalia, but either will work. Roma Termini is the main train station. There is a train that goes to Salerno from there. You can grab a taxi to the station and to the hotel depending on distance."}, {"username": "Alberta Sensale Chirico", "comment_text": "Thanks!"}]}, {"id": "2198478413884570", "text": "Hi, my mum and I are heading to Sorrento on the 20th August for a week. We are wondering what the best restaurants would be and other good sites. We are going to do a boat tour to Capri and see the amalfi coast. I would be interested in doing an Italian cooking class but wouldn’t have any idea on how to book it. Advice would be taken happily!", "link": "facebook.com/groups/1373361046396315/permalink/2198478413884570/", "likes": 4, "comments": [{"username": "Glenn Todd Webb", "comment_text": "Il Buco"}, {"username": "Darryl Vanstone", "comment_text": "We liked Zi’Ntonio, L’Antica trattoria, bistro sorrento, and restaurant Calise in Sant’Agnello."}, {"username": "Leigh Baguley", "comment_text": "My wife and I went to this cooking class. Tony (chef) is amazing and highly recommend it https://\nwww.viator.com/\ntours/Sorrento/\nCooking-in-Sorre\nnto/\nd947-16185P1?m=6\n5553&nid=VR.041\n5f678-08e9-40ef\n-a272-de1931f09\nbc5.VT_EMAIL_TR\nV"}, {"username": "Leigh Baguley", "comment_text": "https://\nmaps.app.goo.gl/\nREimmcSkVaadt1kM\nA"}, {"username": "Leigh Baguley", "comment_text": "Enjoy restaurant is a must. 5 star rating and rhe owners are lovely. We had dinner there 2 weeks ago whilst we were in sorento"}, {"username": "Mike Trento", "comment_text": "Go to la tagliata in Positano for the cooking class and amazing dining adventure. Do Samola pasta bar in Sorrento for sure!"}, {"username": "Mary-Lynn Shapiro", "comment_text": "In Sorrento you must eat at Pizza Da Franco!!"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Go to Anacapri !!!!"}, {"username": "Debbie Schoeneshoefer", "comment_text": "Eat dinner at any restaurant in Marina Grande-which you can walk down to from Sorrento-soooo charming-restau\nrants for amazing seafood in this fishing port. Here is the view from our table one evening."}, {"username": "Janice Rea", "comment_text": "Z’antonio. Go to a lemon grove to eat and drink."}, {"username": "Meredith Holloway Helbon", "comment_text": "Following"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2198479607217784", "text": "Hello,\nRecommendations please for Rome city center (Spanish steps location) hotels, wi-fi, a/c, under $400/night, perhaps rooftop bar…Preferably boutique smaller non chain hotel.\nPlease & thank you\n\nPic of me couple years ago in Florence\nfor picture tax 😊", "link": "facebook.com/groups/1373361046396315/permalink/2198479607217784/", "likes": 23, "comments": [{"username": "John Paul Williams", "comment_text": "Hotel Savoy"}, {"username": "Jason Hobel", "comment_text": "Kame Hall"}, {"username": "Chloë Sint", "comment_text": "Stayed in the Glam Hotel last September. Easily walkable to Trevi Fountain, Spanish Steps, Colosseum. Very modern and chic. Great rooftop bar."}, {"username": "Jennifer Turbeville Hazen", "comment_text": "Dante’s Hell"}, {"username": "John Bruckman", "comment_text": "Hotel Condotti"}, {"username": "Marcus Hiesler", "comment_text": "Hotel 77"}, {"username": "Vernell Carranza", "comment_text": "The best hotel les diamantés Spanish steps suites. Loved it. Bite of the steps.\n\nhttp://\nwww.lesdiamants.\nit/"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Hotel Alexandria … great restaurant outside on the sidewalk .., easy walk to Trevi fountain Spanish Steps etc"}, {"username": "Donna Germann", "comment_text": "I have a reservation at Hotel Scalinata Di Spagna. They have been responsive and look nice."}, {"username": "Matt Collier", "comment_text": "Hotel Eden"}, {"username": "Karen Medeiros", "comment_text": "Check out my Spanish steps at the top of the Spanish steps. Only 6 rooms. If you can get the sweet it is amazing. Double doors to balcony and huge room. Definitely worth the money. You can actually see the Vatican from your room."}, {"username": "Jennifer Sharpe", "comment_text": "Hotel splendid Royal. Amazing roof top bar. $$$$ restaurant but worth it."}, {"username": "Susan Dolin Rothschild", "comment_text": "In September we are staying at the inn at the Spanish steps. We heard it was nice and great location."}, {"username": "Brian Yonks", "comment_text": "Rome Times Hotel. Walkable to everything"}, {"username": "Juli Cope Cunningham", "comment_text": "Inn at the Spanish Steps. Awesome location and could see the steps from our hotel room balcony. Plus has great rooftop bar and rooftop observation area. We had it all to ourselves beginning of May."}, {"username": "Sandy Thomson", "comment_text": "Check out Hotel Forum. Closer to the colosseum but central and checks some of your boxes!"}, {"username": "Meg Reaburn", "comment_text": "Airbnb!"}, {"username": "Michelle Solak", "comment_text": "Check out Parlamento Boutique Hotel! We stayed there last week and were very happy with it. Fits your description here!! There’s a rooftop terrace that can be used from 9am to 10pm and some rooms open up to it also. Very nice staff"}, {"username": "Nancy Lewis", "comment_text": "Tracey Belinda. We loved our hotel.\nSmall, boutique hotel.\nDesigner interiors.\nNothing like it anywhere! Under $400\nThe Valadier.\nNear Spanish Steps too."}, {"username": "Bennett Richards", "comment_text": "That area is now so crowded with tourists that was off putting for us . We like the Monti district. Much quieter. The Hotel Grand Palatino is great and has a wonderful breakfast."}, {"username": "Helen Newlinds Ezzy", "comment_text": "Hotel Barocco - near Spanish steps and trevi fountain - gorgeous small hotel with lovely staff."}, {"username": "Marjie De Villa Lorica", "comment_text": "Relais de la Poste at Via del Corso— 5-10 mins walk to Spanish Steps, Trevi Fountain, Pantheon, Piazza del Popolo, and the high- end shops.\n\nIt is a wonderful small boutique hotel— with friendly helpful staff.\n\nStayed there in Oct 2022- and would book again in the future."}, {"username": "Francesca Campetta", "comment_text": "Try to have a look at \"Laurina33 Luxury rooms\" address: via Laurina 33\n😊"}, {"username": "Peter Cochrane", "comment_text": "We stayed in the Hotel Del Nazioni which is very close to the Trevi Fountain. They serve food too, at a reasonable price which is always a bonus in Rome!!"}, {"username": "Tracey Belinda", "comment_text": "Wow, so many wonderful recommendations\n! Thank you everyone! 😊"}, {"username": "Jean Bennett O'Reilly", "comment_text": "Hotel Condotti. Small boutique hotel. Short walk to Spanish Steps."}, {"username": "Mat PO", "comment_text": "Portrait Hotel checks all the boxes, except the 400/night."}, {"username": "Dawn Britten", "comment_text": "Hotel de La ville. Perfect for you x"}]}, {"id": "2198481383884273", "text": "We will be in Rome, Florence & Sorrento this Aug . I’m looking for a rec where to buy floor or large table vases /pottery. My mother brought some similar vases like thus picture while in Florence 15 plus years ago. She’s too frail to travel back with us. Any suggestions of names of where to go? Thank you!!!", "link": "facebook.com/groups/1373361046396315/permalink/2198481383884273/", "likes": 21, "comments": [{"username": "Pia Reilley Loughin", "comment_text": "I actually purchased two very large floor vases at Homegoods."}, {"username": "Lisa Ann", "comment_text": "https://\nwww.google.com/\nsearch?q=CERAMIC\nHE+D%27ARTE&lud\nocid=1054963092\n5409279762&ibp=\ngwp%3B0%2C7&sa=\nX&ved=2ahUKEwiO\nrNOAy6WAAxWhFjQ\nIHbNtD6IQ_coHeg\nQIGhAB&biw=390&\nbih=658&dpr=3#l\nkt=LocalPoiPhot\nos&lpg=cid:CgIg\nAQ%3D%3D,ik:CAo\nSLEFGMVFpcE55dX\nRYLXJGSFVmbGlrV\nFRkQXBXZ1ZhX3cx\nOHNWc3NMZnNMZ3l\nU"}, {"username": "Betsy Hummel", "comment_text": "You can get one shipped. See image of spoon rest I got while on Amalfi Coast. The have ornaments, vases, oil dispensers, bowls, plates, pitchers, umbrella stands, and even tables. They ship to the US also so you can order online. I also purchased bowl, and coffee mugs. Website is on the back of the spoonrest."}, {"username": "Carly Botelho", "comment_text": "Vietri Sul Mare"}, {"username": "ChristianVito Ze", "comment_text": "Where can I buy this pottery online and get it shipped?"}, {"username": "Paula Lazeski", "comment_text": "Deruta, center of Italian majolica industry, is a town in Umbria, south of Perugia."}, {"username": "Rinie Louw", "comment_text": "In Florence, just past Ponte Vecchio is a showroom/\noutlet with similar pottery articles"}, {"username": "Normandy Georgie", "comment_text": "Sbigoli Terrecotte in Florence. They do the painting right there in the shop and will ship and do special orders."}, {"username": "Miyuki Kanno Paul", "comment_text": "In Firenze, shop at Ricceri."}, {"username": "Maria Cascardo", "comment_text": "Vietri sul Mare, Salerno. We took the train just to check out the town and I was so glad we did. After going to Amalfi and Positano looking for Pottery but was floored at the prices, we were going to give up until Vietri. The same things for 315 in Amalfi was $105 in Vietri. We also met the artist. Fabulous experience."}, {"username": "Anita Shelmerdine", "comment_text": "Anita Shelmerdine"}, {"username": "Alicia Cox", "comment_text": "Prob worth a day trip to one of the places mentioned here as Florence will be over priced & so will Amalfi"}, {"username": "Jeanne Hildebrandt Fedoryk", "comment_text": "When on the Amalfi Coast, if you go to Ravello, we always buy ceramics at this store, and they will ship (very large store)\n\nhttps://\nwww.ceramichecos\nmolena.com/\nstore/"}, {"username": "Kerri Bevilacqua", "comment_text": "Galleria Ponte Vecchio Ceramiche in Florence"}]}, {"id": "2198487010550377", "text": "Booked a tour and saying need to take proof of vacation/masks and ID. Is this still correct? Proof of vaccines is fine although prefer not to wear masks any more. However don't really want to be walking around with my passport in my bag when everyone I speak to says you need to keep an eye on your bags!", "link": "facebook.com/groups/1373361046396315/permalink/2198487010550377/", "likes": 1, "comments": [{"username": "Jenn Messina Babore", "comment_text": "What tour is this? Most no longer require this."}, {"username": "Richelle Trezise", "comment_text": "It might be old requirements. I would email them to double check"}, {"username": "Christine Hunt", "comment_text": "We were in Italy last August, no masks required and can’t remember having to show ID"}, {"username": "Melanie Matthews Stuprich", "comment_text": "We just did those tours as well and they did ask for ID but a picture of one was fine. No masks were required or vaccine proof."}]}, {"id": "2198492520549826", "text": "Hi, I would like to book skip the line Colloseum guided tour. Their website is charging me for kids as well. (12,11 and 6) . Do you know if they refund kids? Has anyone done it? TIA", "link": "facebook.com/groups/1373361046396315/permalink/2198492520549826/", "likes": 0, "comments": [{"username": "Jenn Messina Babore", "comment_text": "You have to select the option for under 18. Some tours still charge for children if a guide is involved and the night tour is not free for kids."}, {"username": "Ilia Avroutine", "comment_text": "It's a good one and we skipped the line"}]}, {"id": "2198493287216416", "text": "Ok, I tried the search but my head hurts. Taking the train from Venice to Florence. We don't want seats that face backwards. Which direction is the front of the train? Car 1 or Car 6 (assuming the train doesn't turn around to where Car 1 is always the front)? 😂🤯😭", "link": "facebook.com/groups/1373361046396315/permalink/2198493287216416/", "likes": 0, "comments": [{"username": "Stacey Esposito", "comment_text": "Ok so I was on the train from rome to venice I booked 8 a 8b 8c 8 d. Big mistake as we were separated by the middle aisle. I should have booked 8a 8b 9a 9b to sit together. And the train changed directions after one of the stops. I get motion sickness and the train was rough for me. This is just me. I'm a hot mess with motion sickness had I realized I would have put on my air sickness patch"}, {"username": "Carolyn Straniere", "comment_text": "We took the fast train from Paris to Lourdes and at first I was sitting backwards (for all of 30 seconds) and then moved to forward facing. I don't tend to get motion sickness but going as fast as we were, I felt queasy. We booked first class and it wasn't crowded at all. There were 3 of us so we had our own little section with a table in the middle.\nBut I don't know if you can tell prior unless you study the seating arrangements and know which way the train is headed."}, {"username": "Brice Blosser", "comment_text": "Ask at the station."}, {"username": "Lisa Kelly", "comment_text": "It changes depending on how the trains have moved around the tracks between destinations."}, {"username": "Gillian O'Callaghan", "comment_text": "I didn't reserve seats. I can't go backwards for more than 30 minutes. If I saw the train approaching I'd just find a seat facing forwards. If the train was stationary and could go either way I asked people or moved."}, {"username": "Ville Lignell", "comment_text": "Ville Lignell"}, {"username": "D'Anna Hohe", "comment_text": "No way to predict. Some stations have the trains going thru while others all come in perpendicular to the entrance (Venice, Rome and Florence are all the latter), so the front of the train coming in is the last car going out.\nYou could get seats facing each other so at least one of you is facing forward."}, {"username": "Maria LaPietra Guerrero", "comment_text": "No way to predict but on one of the ways when we got them facing backwards, I told the conductor I get motion sickness and they moved us to forward facing seats."}, {"username": "Shelley Howard", "comment_text": "u can't predict it .. maybe book a car instead..."}]}, {"id": "2198493797216365", "text": "Hi! I’m looking for a better way to go to Elba Island. Any suggestions ? If I’m flying from US?", "link": "facebook.com/groups/1373361046396315/permalink/2198493797216365/", "likes": 0, "comments": []}]