[{"id": "2205130213219390", "text": "1.) Private driver reccomendations in Montepulciano\n\n2.) Anyone reccomend visiting Bagno Vignoni? Can you take a train from Siena?", "link": "facebook.com/groups/1373361046396315/permalink/2205130213219390/", "likes": 0, "comments": [{"username": "Lisa Wylin", "comment_text": "Hi Brooke 💕🥰"}]}, {"id": "2205131706552574", "text": "Hola grupito. Podéis decirme si las Termas de Saturnia funcionan también en enero? Graciassss", "link": "facebook.com/groups/1373361046396315/permalink/2205131706552574/", "likes": 0, "comments": [{"username": "Carlotta Crespi", "comment_text": "https://\nwww.termedisatur\nnia.it/en/ you can ask them..."}]}, {"id": "2205132179885860", "text": "Just saw this article about train travel in Italy for 2024 and wanted to pass it on to all of you.", "link": "facebook.com/groups/1373361046396315/permalink/2205132179885860/", "likes": 1, "comments": []}, {"id": "2205133126552432", "text": "Beautiful Spello 🌸🌺😍", "link": "facebook.com/groups/1373361046396315/permalink/2205133126552432/", "likes": 19, "comments": []}, {"id": "2205136246552120", "text": "Trying to book direct train from Florence to Naples. Confused pls help which class ?? If I choose bussiness super economy that means bussiness class correct?? We are staying in Sorrento. Hotel will arrange pick up from train station!\nThank you.", "link": "facebook.com/groups/1373361046396315/permalink/2205136246552120/", "likes": 11, "comments": [{"username": "Ralf Eisermann", "comment_text": "Yup. Hit the info button next to each class of business. Super economy generally means no options to change, cancel, or refund. Same on board services."}, {"username": "Jenn Messina Babore", "comment_text": "Business super economy just means the tickets are not changeable. Yes, it is Business class seats."}, {"username": "Joe-Linda Po Agustin", "comment_text": "Yes, you've chosen the business class on the high speed train. Super Economy is cheapest because it does not allow you to make changes. The extra E26 Economy charges is for flexibility to make a change."}, {"username": "Phillip Farquhar", "comment_text": "Yes that’s business. Be careful when booking it’s normally only the 5.40 that’s direct"}, {"username": "Vero Nika", "comment_text": "These prices seem too much tho (even for 2 ppl)..."}, {"username": "Paurenia Patrick", "comment_text": "Make sure you’re going to the right train station. Napoli Centrale is downtown. Afragola is a little further away, not near the city."}, {"username": "Michela Zanni", "comment_text": "If you want to save money you can also buy standard or premium tickets, the seat is always guaranteed. For description click on info symbol near the type of ticket (info in italian only)"}, {"username": "Diane Davis Lawyer", "comment_text": "Whoa! That is expensive! We're taking the same train around the same time and it's half that much. Have you tried using the Omio app? It gives you all of the prices for all of the trains, not just one train line."}, {"username": "Diane LoPriore Pryor", "comment_text": "Trenitalia"}, {"username": "Rachael Richardson", "comment_text": "What company is this seems pricy"}, {"username": "Jacqueline Callaghan", "comment_text": "I booked for two for under $100 on Italo for September"}, {"username": "Claire Dowson", "comment_text": "I’m getting those prices much cheaper on the Trainline app."}, {"username": "Debbie Potter", "comment_text": "At least I'm not the only one who thinks this train app is confusing."}, {"username": "Lee-Anne Stewart", "comment_text": "Definitely recommend seat61 website for train booking advice. Great pages on Italy but covers worldwide."}, {"username": "Miyuki Kanno Paul", "comment_text": "If you don’t mind non-refundable/\nno change deal works for you, yes, it’s a good deal on Frecciarossa"}, {"username": "Vernell Carranza", "comment_text": "Used Omni app for weeks. Loved it. Business was worth the extra $"}, {"username": "Reham Botros Ghali", "comment_text": "Seems really expensive"}, {"username": "Heather Collins", "comment_text": "What do these mean? Are there differences with business class?"}, {"username": "Cynthia Marie", "comment_text": "Are those prices for one or two people?"}, {"username": "Vicky Hall-Newman", "comment_text": "Look at getting an italy pass on the train."}, {"username": "Fiona Cameron", "comment_text": "Dont go to Afrigola! You need centrale\nFrecciarossa 9527 leave Florence 12:14 arrive Napoli Centrale 15:12 business super eco is €123.80 for 2 people on Trenitalia website. Now"}, {"username": "Ashley Czinege", "comment_text": "I took the super economy and it was fine. I just took the train from Napoli Centrale to Milano and it was comfortable. There is a restroom on board. No other food or drink served but I just brought food on board with me and it was a nice ride.\nLooks like the only difference it that the more expensive one offers a change if needed?"}, {"username": "Jakub Pawlowski", "comment_text": "Ufff so lucky we did drove to Italy. This prices looks expensive. €130 of fuel means 1000km seams a good deal."}, {"username": "Dafne Vassetti", "comment_text": "The me&you offer is the cheapest. I see right now from the Trenitalia website that would cost 90 euros for both."}, {"username": "Lucia Chiacchiera", "comment_text": "Ciao! Yes, it always means Business Class BUT the main difference here is that you cannot change the ticket (date or hour!) once you buy them!\n\n(I’m from Florence and I’m currently living in Como for work, I use Trenitalia a lot!)"}, {"username": "Karen Pedersen", "comment_text": "Recently travelled from Naples to Rome in Business.. comfortable and worth it. We were even provided with a snack"}]}, {"id": "2205137263218685", "text": "I am currently in Italy (Sicily, Capri, Rome) and have been surprised by how much cash I have needed (versus credit card)… many transportation forms do not accept credit cards, and some vendors don’t… I even had a restaurant tell me no cards. Just an FYI to plan accordingly.", "link": "facebook.com/groups/1373361046396315/permalink/2205137263218685/", "likes": 95, "comments": [{"username": "Ville Lignell", "comment_text": "Which transportation forms? Vendors of what and where? You always can turn around and pick a next restaurant that does. They can't refuse a card by law."}, {"username": "Tracy Foss", "comment_text": "They definitely prefer cash as there are fees associated with cc some more than others We usually plan cash for cabs ,tips & smaller purchases snacks ect & cc for anything closer to 100 euros. It's not surprising how things can add up but usually min 100-200 a day"}, {"username": "Mark Hamrick", "comment_text": "It is also a question of kindness and efficiency. Cards carry transaction fees and many service personnel (and businesses) greatly appreciate cash payments and especially tips. And I’m a fan of using credit cards for rewards as long as the debt is paid off ASAP."}, {"username": "Emma Olsen", "comment_text": "I am in Cesenatico/\nRimini and you can pay almost everything with card."}, {"username": "Frank Dragna", "comment_text": "We started with $2,000 euros and paid cash for most things(CCard for hotels that weren't prepaid). We loved the convenience of cash. Went to the ATM as needed during the trip."}, {"username": "Aaron Peterson", "comment_text": "CC companies charge them 3% or better for you using your card"}, {"username": "Victoria Russo", "comment_text": "Very surprised credit cards are not accepted. Seems in US, cash isn’t accepted anymore. I think because of COVID & germs"}, {"username": "Tess Galinato Perez", "comment_text": "Hmmm...I travel to Italy a lot (8× as of May 2023 and will go back again in late August) and I had no issues with paying by card everywhere I go, I only used cash for tips, even in Palermo. But then again, I don't ever use taxi unless I absolutely have to."}, {"username": "Iwona Dygas", "comment_text": "The Sicilians don’t like cards, that’s for sure"}, {"username": "Mike Guluk", "comment_text": "This for the info. Same in northern Italy ,Rimini area. Now in Spain cards everywhere"}, {"username": "Leila Myftija", "comment_text": "By law, they can't refuse cards."}, {"username": "Debbie Morton", "comment_text": "You can’t blame them. I’m currently in France and getting slammed with fees every time that I use my CC."}, {"username": "Tam Wong", "comment_text": "I use 99% cc in Europe except the small islands in Greece"}, {"username": "Doug Burke", "comment_text": "Restaurants are notorious for claiming they only take cash AFTER you've eaten for tax purposes. A good habit to get into is ask the host/hostess if they take CC's BEFORE you go in. In one instance I asked and they said \"Yes, we take CC's\". But after our meal we were informed that their CC machine was broken and would need cash. I referenced my conversation with the host before eating because I had no cash. Magically a working machine appeared."}, {"username": "Edmarie Saia", "comment_text": "Off topic…. Has it been hard to travel from Sicily to the northern part? Sicily is a must for us but I’m wondering if it would be to much to travel to the north"}, {"username": "Linda Pitler", "comment_text": "Chase Sapphire preferred. No fees."}, {"username": "Wendy Spano Bracco", "comment_text": "Many of us have said this regarding cash but then the credit card group chimes in that it’s not necessary. There are so many examples of when cash can be needed an the emergencies that can potentially come up. I’m also not starting a verbal argument when a vendor will not accept a credit card. I don’t care what the law is, I’m not doing that on my vacation."}, {"username": "Brenno Bianchi", "comment_text": "If you want to pay a taxi with your card, call it with the app freenow and pay at the end through the app. It is very difficult having a taxi driver accept a payment with a card. The situation is so bothersome and also illegal that today the Antitrust has opened an inquiry about the topic."}, {"username": "Frannie Kaplan", "comment_text": "Yup happens a lot.happened in Greece and Portugal as well. For transport locals have special plastic cards so they don't need to pay cash but lots of travelers don't have them ofc"}, {"username": "Vaishnavi Pattabiraman", "comment_text": "Where did you get the cash from?"}, {"username": "Michela Zanni", "comment_text": "In Italy all shops and restaurants MUST have a pos (credit card reader). It is compulsory"}]}, {"id": "2205136386552106", "text": "Join our virtual experience: https://nextstop-italy.com/virtual-tours/lucca-walled-city/\nYou will virtually stroll through the cobblestone streets, bustling piazzas and old Renaissance walls of Lucca and youआणखी will see the birthplace of local composer Giacomo Puccini.\n\n#medievalart #italytravel #italyiloveyou #virtualworld #italytrip #vacationmood #italygram #tuscany #renaissanceart #renaissancetour #tuscanylovers #tuscanytrail #VirtualTour #art #lucca #luccacity #luccaitaly #bikelovers #history #historylovers", "link": "facebook.com/groups/1373361046396315/permalink/2205136386552106/", "likes": 1, "comments": []}, {"id": "2184458501953228", "text": "Don't miss a stay here...a heaven on earth!\nEvery where you look could be a postcard or picture...you are at La Lupaia, between Montepulciano and Pienza, Lupaia is an ancient farm estate dating back to 1622!🥰आणखी\nDiscover more here: https://www.jdoqocy.com/click-100692842-11552042?url=https%3A%2F%2Fwww.tripadvisor.com%2FHotel_Review-g608934-d1015571-Reviews-Lupaia-Torrita_di_Siena_Tuscany.html", "link": "facebook.com/groups/1373361046396315/permalink/2184458501953228/", "likes": 103, "comments": [{"username": "Fran Wohlenhaus-Munday", "comment_text": "Beautiful!"}, {"username": "Marie Cuzzi", "comment_text": "Gorgeous"}, {"username": "Beatriz Davalos Moreno", "comment_text": "that is what our plans are for when we retire, rent a place like this for a month or two and relax!"}, {"username": "Bethany Stiehl Baker", "comment_text": "It’s beautiful! How did they do meals? Charge to the room? Pay like a restaurant?"}, {"username": "Courtney Brown", "comment_text": "I stayed here in May and it was the best part of my trip to Italy! Hands down the best service, food & atmosphere. Felt like I was in a dream the entire week."}, {"username": "Ruth Akutu Maccarthy", "comment_text": "Splendid"}]}, {"id": "2205079633224448", "text": "Is Torno a good place to stay??", "link": "facebook.com/groups/1373361046396315/permalink/2205079633224448/", "likes": 3, "comments": [{"username": "Chiara Varricchio", "comment_text": "You mean Torino?"}, {"username": "Rachel Gray", "comment_text": "There’s also Tirano"}, {"username": "Vero Nika", "comment_text": "We stayed in Torino in well serviced apartments near the Nizza metro (booked via booking.com and really enjoyed our stay)... I travel alone with 3 kids (7,8,10) and we always bring scooters wherever we go- Torino was fantastic for scooting around with endless smoothly paved arches :)"}, {"username": "Oneida Ann Murphy", "comment_text": "Torno on lake como"}, {"username": "Susan Gutowski", "comment_text": "We stayed at the Palace Hotel in Como and loved it! Took ferry boat tour and got off at all the amazing towns and toured around. Sad we never found the Clooney's, ha!"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2204959833236428", "text": "Morning all, I have one day left in Peschiera del garda. I have a car and two older teenagers. What should I do today? We’ve been to Sirmoine, Desenzano and Garda. I think they’ve had enough of the lake! Any suggestions welcomed.", "link": "facebook.com/groups/1373361046396315/permalink/2204959833236428/", "likes": 3, "comments": [{"username": "Caren Cone", "comment_text": "How about Gardaland? I've never been but heard great things about the rides."}, {"username": "Philip Curnow", "comment_text": "The small and perfectly lively city of Brescia. Maybe offer you teenagers a little Spritz. Gardaland is for kids not older teenagers."}, {"username": "Monica Holbrook", "comment_text": "We were considering staying in PdG. Would you recommend it?? Any lodging or activity recommendations\n? We will be traveling with a 7 and 10 year old. Thanks!"}, {"username": "Jona Guðmundsdottir", "comment_text": "Philip Curnow I love gardaland......\n. and i am a grownup....... :p i also love movieland park, which is not far from Gardaland... it is a different kind of amusement park... one of its rides is a real speedboat trip... and it is very fun to ride."}, {"username": "Philip Curnow", "comment_text": "Exactly. Kids or kids at heart. Not late teenagers looking for a bit of real action."}, {"username": "Philip Curnow", "comment_text": "Great museum in Brescia dedicated to the Mille Miglia The iconic annual motor race to Rome."}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Gardaland"}, {"username": "Judy A-c", "comment_text": "Thanks everyone. We ended up at Gardaland and the kids are having a great time. Maximum queue is 40 minutes so they’ve been able to do everything that they wanted to."}, {"username": "Carlotta Crespi", "comment_text": "Take them to Verona"}, {"username": "Kristina Ruk", "comment_text": "Yeah me too recomend Gardaland.. there are few quite good rides, atractions."}, {"username": "Deirdre McMillen", "comment_text": "What about Canevaland Water park"}, {"username": "Lyn Evans", "comment_text": "Verona is wonderful"}, {"username": "Pietro Adami", "comment_text": "Take them to Gardaland"}, {"username": "Esther Starren", "comment_text": "Verona, Trento, Gardaland"}]}, {"id": "2204994206566324", "text": "Hello, any recommendations for good restaurants in Bologna🙏? We don't look for fancy / touristic places but rather for those preferred by locals. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2204994206566324/", "likes": 0, "comments": [{"username": "Elena Eugeni", "comment_text": "https://\nmaps.app.goo.gl/\nczBSCrJoSAb9fuZE\n6"}, {"username": "Scott Perry", "comment_text": "Guero on via Goito for cocktails. Tell them Scott sent you. 😄"}, {"username": "Huong Worley", "comment_text": "Trattoria dal Biassanot\n\nVia Piella, 16, 40126 Bologna BO, Italia\n+39 051 230644\n\nOsteria Al 15\nVia Mirasole, 13, 40124 Bologna BO, Italia\n+39 051 331806\n\nRecommended by locals. Best meals we had."}, {"username": "Alice Francesca", "comment_text": "Please do not ask for pizza !\nBologna is home of lasagna, tortellini, ragù...so pasta, pasta, pasta!;)"}, {"username": "Manuela Bassetti", "comment_text": "Trattoria Da Vito, Via Mario Musolesi, 9, 40138 Bologna BO, best lasagne of the city\nPane Vino e San Daniele, Via Altabella, 3/a, 40126 Bologna BO, they have really great cheese, ham, salami, and “friggione”, that’s a sort of sauce with onions, tomato and vinegar typical of Bologna\nIf you really want pizza there’s Pizzeria Reginella, Via dell'Arcoveggio\n, 50b, 40129 Bologna BO, the owner is from Naples\nDa Sandro Al Navile, Via del Sostegno, 15, 40131 Bologna BO, it’s not cheap, but it’s probably one of the best restaurant in Bologna\nIf you want fish, Scampo, Via Galliera, 11g, 40121 Bologna BO, it’s a fish shop with a kitchen, they have a counter with different kind of raw fish and you can choose what you want and how you want to have it cooked, the only accept credit card for payment, no cash"}, {"username": "Elena Innocenti", "comment_text": "L'Arcimboldo\nTrattoria del Rosso"}, {"username": "Kathy Kibbe", "comment_text": "We really liked Ahime - very farm to table - lots of veg (but some meat)"}]}, {"id": "2205041013228310", "text": "Hey, looking for some guidance on staying in northern Italy for a few days in October. Up around the lakes somewhere. Smaller town with reasonably priced accomodation and a bit of historical charm. Maybe a good spot to explore the region from by car.\nThanks in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2205041013228310/", "likes": 1, "comments": [{"username": "Alice Francesca", "comment_text": "Lake Garda, Salò."}]}, {"id": "2205046766561068", "text": "Hi I'm traveling solo to Naples, I have 6 days there before going to Rome. I am wondering whether it is better to stay in Naples for 6 nights and do day trips to Sorrento, Amalfi and surrounding areas or whether it is worth staying in Sorrento for a few of those days?\nThank you!! 😊", "link": "facebook.com/groups/1373361046396315/permalink/2205046766561068/", "likes": 0, "comments": [{"username": "Kenia A Garcia", "comment_text": "I preferred Sorrento to Naples. And it’s also easier to do day trips to the Amalfi coast from Sorrento as Naples is a longer ferry ride."}, {"username": "Steven Boozang", "comment_text": "Sorrento, great city and launching point."}, {"username": "Philip Curnow", "comment_text": "Sorrento is a smart town which stretches along the coast and is perfectly positioned for Naples and Amalfi, Cetara etc. You can always drop into Naples at any time, but you may enjoy the evenings in Sorrento more on your trip."}]}, {"id": "2205054016560343", "text": "Palermo or Taormina for a fist time visit to Sicily?", "link": "facebook.com/groups/1373361046396315/permalink/2205054016560343/", "likes": 17, "comments": [{"username": "Fabiana Dieguez", "comment_text": "Taormina!!"}, {"username": "Miroslava Marčaníková", "comment_text": "Taormina"}, {"username": "Michael Messina", "comment_text": "Taormina first, palermo second"}, {"username": "Beatriz Davalos Moreno", "comment_text": "I did not visit Palermo but Taormina is very charming with lots of stores and little restaurants!"}, {"username": "Jill Tingley", "comment_text": "Both"}, {"username": "Tamriko Chanishvili", "comment_text": "Palermo and Taormina"}, {"username": "Rosemarie Mahoney", "comment_text": "Taormina absolutely"}, {"username": "Marjie De Villa Lorica", "comment_text": "Taormina— so lovely with a view of Mt Etna❤️"}, {"username": "Carol Newman", "comment_text": "Taormina"}, {"username": "Riccardo Laganà Yvette Maes", "comment_text": "Both worth a visit ."}, {"username": "Maria Badamo DeSocio", "comment_text": "Two different settings, I would chose Taormina !"}, {"username": "Brian Delvecchio", "comment_text": "Taormina"}, {"username": "John Bruckman", "comment_text": "Palermo!"}, {"username": "Véronique Piercey", "comment_text": "They are sssoooo different. Depends on your interests. If you just want a beautiful landscape without having to leave your front door, Taormina (short distance to Mt Etna as well). If you want to be immersed in the history and architecture of the, arguably, most conquered piece of land on the planet, Palermo. Palermo also happens to be close to Cefalu, which is a great resort town (can day trip)."}, {"username": "Imperia Arcidiacono", "comment_text": "Taormina is a must"}, {"username": "Lisa Giunta", "comment_text": "Taormina! Spectacular!"}, {"username": "Brittney Cassidy", "comment_text": "Both!"}, {"username": "Mike Lanza", "comment_text": "Taormina! It is absolutely beautiful."}, {"username": "April Leblang", "comment_text": "Taormina is beautiful"}, {"username": "Shannon Packard", "comment_text": "Taormina! Hands down, better scenery, better views, better food."}, {"username": "Miriam McCarthy", "comment_text": "Miriam McCarthy"}, {"username": "Tania Vella", "comment_text": "Make sure you no both!!"}, {"username": "Miyuki Kanno Paul", "comment_text": "We did both! We took an overnight ferry from Napoli to Palermo and spent 3 nights. Then picked up a rental car and drove counterclockwis\ne to enjoy the island. Furthest north we drove was Taormina before dropping off the car in Catania and flew back to the mainland. Allow 2 weeks or more to explore the island!!"}, {"username": "Sabrina Lisa", "comment_text": "Taormina! Apple Watch Street partorir in turbina e Sme one number one stop"}, {"username": "Sherry Whorton", "comment_text": "Taormina"}, {"username": "Svetla Zapryanova", "comment_text": "Whole Sicily"}, {"username": "Pamela Barbato Chedid", "comment_text": "Toarmina"}, {"username": "Michał Kolasiński", "comment_text": "Taormina😍😍"}, {"username": "Brian Smith", "comment_text": "Just came back from Palermo, Agrigento, catania, Taormina. Palermo being my least favorite."}, {"username": "Marsico Tina P", "comment_text": "Taormina all the way!!!"}, {"username": "Joe Nuzzo", "comment_text": "Taormina.."}, {"username": "Mary Balistreri Swan", "comment_text": "Taormina"}, {"username": "Sue Gioia", "comment_text": "Taormina"}, {"username": "Theresa Salerno Adams", "comment_text": "Taormina"}, {"username": "Rhonda Hope", "comment_text": "Both"}, {"username": "Terri Boncore", "comment_text": "Taormina"}, {"username": "Marlene Cachia", "comment_text": "Taormina"}, {"username": "Maura Galli", "comment_text": "Palermo"}, {"username": "Mariann T. Ciampa", "comment_text": "Taormina"}, {"username": "Anthony McClure", "comment_text": "Rent a car and see them both."}, {"username": "Troy Davis", "comment_text": "Taormina"}, {"username": "Frank Dias", "comment_text": "Taormina - best place on earth! People, Cannolis, veal meatballs in lemon leaves, awesome ocean, view of the volcano, and a hotel with a cave walkway to enter the beach!"}, {"username": "Adriana Swanson", "comment_text": "I just did both. So different to each other. Loved them both. If staying in Trapani stay in the Centre of the old town and Palermo I stayed in a great apartment in the Main Street via Maqueda. Our apartment was quiet luckily as it’s a noisy street."}, {"username": "Carol Scime-Raiford", "comment_text": "Palermo"}, {"username": "Michela Zanni", "comment_text": "Palermo. Always the capital town first"}, {"username": "Gab Katya Sandler", "comment_text": "Taormina ! White lotus...enough said!"}, {"username": "Tabita Ferraro-London", "comment_text": "What time of year? How much time do you have?\nDo both! With Cefalu along the way 😉"}, {"username": "Michele Sica Selesky", "comment_text": "They are similar but I thought Taormina was great"}, {"username": "Claudia Ponz", "comment_text": "Taormina 👌🏼"}, {"username": "Marlous van der Togt", "comment_text": "Taormina of course."}, {"username": "Lilia Nenovska", "comment_text": "Taormina"}, {"username": "Anthony Vitale", "comment_text": "Get a car see them both.."}, {"username": "Donna Mangone", "comment_text": "Taormina"}, {"username": "Rich Turnbull", "comment_text": "Taormina!"}, {"username": "Meral Kalkan", "comment_text": "Taormina👍"}, {"username": "Agneta Danielsson", "comment_text": "See them both!"}, {"username": "Carlotta Crespi", "comment_text": "Taormina for nature and landscape, Palermo for cultural visits"}, {"username": "Maria Y Alexieva", "comment_text": "Taormina"}, {"username": "Heidi Hutson", "comment_text": "I ❤️ Taormina"}, {"username": "Heath Conn", "comment_text": "Easy - Palermo."}, {"username": "Abdur Sohel", "comment_text": "Palermo obviously 💖"}, {"username": "Eugenio Cannistra'", "comment_text": "Both, Messina you can visit Taormina, Alcantara, Eolian island etc"}, {"username": "Eugenio Cannistra'", "comment_text": "The stait of Messina and Capo Peloro"}, {"username": "Eugenio Cannistra'", "comment_text": "MESSINA Capo Peloro"}, {"username": "Dobrovici Oana Kristina", "comment_text": "Palermo..."}, {"username": "Eugenio Cannistra'", "comment_text": "Taormina"}, {"username": "Oldriska Balouskova", "comment_text": "They are completely different- Taormina is stunningly beautiful and comfortable; Palermo is full of treasures but it is also gritty and edgy."}, {"username": "Eugenio Cannistra'", "comment_text": "Aeolian islands"}, {"username": "Maria Grazia Rizza Costanzo", "comment_text": "Taormina"}, {"username": "Ville Lignell", "comment_text": "Siracusa!"}, {"username": "Maria Daniela Simoncini", "comment_text": "Taormina !"}, {"username": "Philip Curnow", "comment_text": "Throw yourself into the cauldron of Palermo and the marvels which are the city's markets."}, {"username": "Lisa Zoccolillo-Bruno", "comment_text": "Taormina. Palermo is having a tough time with Wildfires."}]}, {"id": "2205060953226316", "text": "Looking for advice regarding driving in Italy - Family of four ... Flying in to Rome and will use public transport in the city - but hope to hire a car and drive to the Amalfi Coast -->Pisa--> Florence-->Maranello-->Venice. I'm expecting the roads to be narrow and winding and I've hear there's not much parking either but we've done driving holidays before. Should I drive or is the train better? Any advice would be appreciated.", "link": "facebook.com/groups/1373361046396315/permalink/2205060953226316/", "likes": 9, "comments": [{"username": "Rachael Richardson", "comment_text": "I’ve done driving holidays before ! Would not recommend in Italy - train all the way\nRoads are horrific"}, {"username": "Elizabeth May La Duca", "comment_text": "Don’t go anywhere without consulting/\nchecking with Google Maps / directions first !!"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "If these are the places and you don’t want to do stops in the middle use trains.\nIn any case don’t drive in Amalfi coast in summer, it’s ok if you go there in autumn. Always ask to your accommodations where to park. Car can be great if you want to have a little more sightseeing."}, {"username": "Bridget Gieseke", "comment_text": "Take the train! Driving in Italy was almost the end of our marriage. The Autostrada is insane. My husband is a good driver and drives with the flow of traffic, however flow of traffic was 220km/hour… which is about 90 mph. Clearly those drivers knew the road and where they were going… we did not. Paying tolls upon exiting was a whole other level of stress. We only drove from Florence to the Tuscan countryside, but managed to get 2 ZTL violations. Take the train!"}, {"username": "Susan Hansen Huckabee", "comment_text": "Train."}, {"username": "Christa van der Merwe", "comment_text": "We just returned from Italy. Wanted desperately to do Val D'Ocre and get a bit out of the touristy areas. Took train Rome to Chuisi in Tuscany. Hired (pre-booked) a car in Chuisi, drove to Pienza area and surrounding areas, Siena and San Gimignano and returned the car in Pisa after 3 days. Loved it. Gave us a true road trip experience.\nMy 1st time overseas. Would recommend it for Tuscany, haven't been to the South.\nWould not drive around Rome or Florence.\nTook the train for the rest of the trip.\nEnjoy"}, {"username": "Monica Roman-Fazio", "comment_text": "Take the train"}, {"username": "Lex Strauss", "comment_text": "Julie Strauss"}, {"username": "Dianne Ellis Patureau", "comment_text": "My advice is DONT!!"}, {"username": "Miyuki Kanno Paul", "comment_text": "What time of the year are you visiting? You need a smaller car than you normally drive. Since you are flying into Roma, take a high speed train to Salerno and pick up your rental car there. We always do so whenever visiting Amalfi coast. Salerno is the east end of Amalfi Coast. Expect difficult driving unless you have driven Big Sur in California. Very narrow road that you may want to fold your side view mirror on your passenger side"}, {"username": "Irene Oda", "comment_text": "There is a car restriction on the Amalfi Coast. Depending on the the license plate number- odd and even ending numbers on alternative days. It's a bit of a hair raising drive."}, {"username": "Vanessa Durkin", "comment_text": "Train definitely"}, {"username": "Jodi Homes", "comment_text": "Do not drive"}, {"username": "Russ Heinemann", "comment_text": "I like driving in Italy. Driving on toll expressways is much better than US Freeways. The back roads are fun."}, {"username": "Diane Davis Lawyer", "comment_text": "Have you researched driving in Italy yet? You also have to have an international diving permit, not to mention the cost of insurance to cover the gap in the $2000 per incident deductible. Add all of that to the fines and laws against driving in restricted historical areas that are very confusing and you have a hot mess...plus uber high cost of gas---close to $8 a gallon last i looked!!!"}, {"username": "Tam Wong", "comment_text": "Train 🚊"}, {"username": "Bellafab Fabrizio", "comment_text": "Trains are so easy! Hire private drivers for the places that you cant"}, {"username": "Maddalena Rinaldi Stankevitch", "comment_text": "I’m in Sorrento now, and there is no way I would have been able to drive. I have hired a private driver today to take us to Almafi coast. We are a group of 5 women with a good amount of luggage’s. May be a bit pricier, but I have preferred to take taxi’s and private drivers."}, {"username": "Brian Marcus", "comment_text": "I'd take train"}, {"username": "Gwyneth Spadaro-Dutturi", "comment_text": "It depends what time of the year you travel. Driving on the motorway is easy and obviously less busy in winter months. If you travel through mountains like Calabria you need snow chains. We always drive to and through Italy and haven’t had any more problems than at home. Years ago it was a nightmare driving in Messina but that has improved now Just don’t go in July to September"}, {"username": "Suzanne Sullivan", "comment_text": "If on a budget, train- if not, I used Daytripper and hired a driver from Rome to Sorrento - we did a side tour of Mt. Vesuvius and hiked the volcano and went to a Limoncello factory/show room and stopped for gelato on the way! Definitely more flexible with a driver ( and more room - we had a minivan ) but more expensive."}, {"username": "Tony Tiricola", "comment_text": "If you are an experienced driver then you will have no problems. Especially if you are from a country that drives on the same side.\nI’m from Australia amd we drive on the opposite side and I have driven Italy from top to bottom and have had no issues. Doing it again right now.\nI agree don’t drive on the Amalfi coast only because it’s very congested and you could get stuck in a traffic jam quite easily. We took a Vespa instead to do from sorrento to Salerno and both my wife and I loved it . Even drove Milan to Bellagio and was no issue whatsoever."}, {"username": "Annette Tamminga", "comment_text": "Friends just got back and drove all over Italy. They had no problems and were able to see small towns which can’t be experienced any other way. They parked outside of Rome proper and took public transportation in metro areas. They had rented homes as a base and kept their luggage there. They had a wonderful time. They said the Amalfi coast was a rush and the driver thought it was fun. 🤷‍♀️. It may help to be comfortable driving the Rocky Mountains and not having a fear of heights."}, {"username": "Katia Taam", "comment_text": "Do not drive."}, {"username": "Fiona Mac", "comment_text": "Use public transport better way to travel around its a great service too"}, {"username": "Jenny Payne", "comment_text": "Great train service in Italy 🌻"}, {"username": "Pegi Fuller", "comment_text": "We had a rental car and spent a week on the Amalfi coast and then drove to Tuscany for another week The coast is a bit more challenging but you get to explore so much more with a car My only advice is if you decide to do Pompeii take the train from Sorrento Easy Peary and no parking headaches Parking is the biggest issue everywhere in Italy"}, {"username": "Debra Quinney", "comment_text": "We have driven in Italy Naples,Pompeii and all down the amalfi coast with no issues if you are an experienced driver just drive carefully we are about to do Pisa ,Virtebo and Florence in sept"}, {"username": "Bill Phillips", "comment_text": "Sounds like a great trip!!!"}, {"username": "Pegi Fuller", "comment_text": "We have driven on all of our Italian vacations HOWEVER we parked the car in Sorrento and took the train to Pompeii after parking woes the first time. Driving the Amalfi coast is challenging but parking is the most difficult part. We drove up to Ravello ( whew) a challenge when we met a bus coming down On the Amalfi coast many cars are missing their mirrors 😳 so make sure you have insurance coverage We did not drive in Rome except to the airport but the drives in Tuscany were easy and peaceful. We usually ventured out for the day and had lunch out and then came back to our villa with wine and groceries before dark. Road signs are almost non existent in some areas.\nStay safe. If you are not a confident driver then stick to a hired driver or public transportation"}, {"username": "Rachel Gray", "comment_text": "You’re definitely not going to want to drive, specially to Amalfi coast. It’s very tight squeeze and you can only drive on certain days in a rental car. There are high shoes trains that will get you everywhere in about half the time"}, {"username": "Monica Colontonio Macho", "comment_text": "We rented a car from Rome and drove to Sorrento. The autostrada is easy, but when you get past Naples and into Sorrento the road is windy and there are not a lot of places to park if you are not familiar with the areas. I went on Pinterest to learn what the road signs mean’t. I would do a train from Rome or Naples to Sorrento, if you are staying anywhere on the Amalfi coast I would take the ferry from place to place or hire a taxi or private driver."}, {"username": "Alice Francesca", "comment_text": "I am Italian. I HIGHLY recommend to use trains.you don't want to drive on the Amalfi coast in peak tourist season."}, {"username": "Rose Stolarek", "comment_text": "No to driving the Amalfi coast"}, {"username": "Colleen Jennings", "comment_text": "Take the train so easy & more relaxing. Restricted parking in cities especially Florence. Trentitalia.it is where you’ll find timetables/\nprices."}, {"username": "Sandra Timi", "comment_text": "We have driven and will be driving on our up coming trip. Know your road rules, no go zones, and research parking ahead of time. Have appropriate insurance and best to have a gps.\nHave fun."}, {"username": "Laura Uribe", "comment_text": "We always use public transportation.\nItaly’s is amazing! If you are determined to have a car, then I would stay outside of the cities and use public transportation to go into town. Between ZTL’s and no public parking, in most of your choices, you will really be limited in your options of places to stay in the cities. The Amalfi coast just claimed a bus drivers life a few months ago. You don’t understand how busy and extremely narrow and packed the roads are until you’ve been there. Good luck whatever you decide!!"}, {"username": "Michela Zanni", "comment_text": "In Amalfi coast roads are narrow. But Italy is full of comfortable highways"}, {"username": "Shelagh Kosinski", "comment_text": "No to driving the Amalfi cost. We have driven in the Alps. My husband was very glad that we had a driver.\nThere are camera speed traps around Florence and areas you are not allowed into without a permit. A camera nailed us on this one. Florence parking is hard to find"}, {"username": "Kit Nader", "comment_text": "Train. Its so much easier."}]}, {"id": "2205063249892753", "text": "Hey looking for recommendations for seaside towns to visit which are fairly close to airports for transfers.\n\nPlanning to visit again in September and loved my first to trips to Italy to Cagliari and Genoa and looking for other fairly large coastal towns to visit with lots to do and see. Any recommendations would be greatfull!", "link": "facebook.com/groups/1373361046396315/permalink/2205063249892753/", "likes": 1, "comments": [{"username": "Colleen Jennings", "comment_text": "Viareggio is 25 mins by taxi from Pisa. Or Marina di Pietrasanta, 40 mins (15 mins from Viareggio). Lovely beaches along this stretch of the coast - going there in September."}, {"username": "Steph Craddock", "comment_text": "Was about to suggest Viareggio too! Easy train ride from Pisa airport. Lovely town, great beaches, well connected to get North or South, hill and mountains nearby too."}]}, {"id": "2204639403268471", "text": "Planning an 8 night trip to Italy next year. Flying in and out of Rome. We’d like to visit Rome, Florence and Venice. Will travel by train. Itinerary suggestions greatly appreciated. Our flight out is 10am from Rome. Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2204639403268471/", "likes": 1, "comments": [{"username": "Yuri Budilov", "comment_text": "All 3 in 8 days? If you are a 1st time visitor to Italy then I would pick just Rome for 8 days. Or perhaps Florence for 5 days and Venice for 3 days."}, {"username": "Fran Fitzpatrick", "comment_text": "That’s a lot of travel for 8 days.Are you flying out of Rome? Maybe do 3 days in Rome then go to Florence and do a day trip to Luca,SanGiamono\n,or Pisa but 3 days in Rome and 3 in Florence then 2 in Venice is doable but lots moving."}, {"username": "Sande Ricci", "comment_text": "Skip Venice. Just do Rome and Florence."}, {"username": "Cathrine Cashwell Lowery", "comment_text": "F"}, {"username": "Jennifer Walp Rydholm", "comment_text": "We are doing 3 nights in Rome, 3 nights in Florence, and 3 nights in Venice. Venice is the shortest time with only 2 full days. We fly out of Venice though otherwise I would likely have skipped it and just done Rome and Florence. It is very doable if you can fly out of Venice."}, {"username": "JeriLynne Clifford", "comment_text": "I would skip Venice and do it next time. Enjoy Florence, do a day trip to Sienna. With all of the moving you are losing a lot of time."}, {"username": "Jennifer Stanek", "comment_text": "It can easily be done. Don’t skip Venice. It’s worth the travel. We landed in Rome and took the train straight to Venice. Finished our trip staying in Rome because we also flew out of there."}, {"username": "Tracy Piko Lawniczak", "comment_text": "We just got back and we flew in and out of Rome.\n\nWe landed in Rome Thursday morning, and had train booked to Venice that day. It’s 4 hours by fast train Rome to Venice. We didn’t do Florence but this might be way to go. Land, travel to Venice, stay there 2 days. Train to Florence stay there x amount of days then train to Rome for remainder of trip."}, {"username": "Valerie Collanton", "comment_text": "If possible you could fly into Rome and out of Venice. That way no backtracking. Rome 3 nights; Florence 3 nights; Venice 2 nights."}, {"username": "Lisa Terry Holtcamp", "comment_text": "Following"}, {"username": "Tam Wong", "comment_text": "Fly into one and out the other then you don’t have to back track"}, {"username": "Patty Stadulis-Hagan", "comment_text": "Venice is amazing!! I book trips to Italy for people if you need help!"}, {"username": "Miyuki Kanno Paul", "comment_text": "Each location deserves at least 3 full days. Can you add another night or two? If not, I would skip one city and have first half 4 nights in either Venezia or Firenze and last 4 nights in Roma."}, {"username": "Alexandra A Welker", "comment_text": "I think departing out of Venice would be so much better time wise so you're not strapped for time returning to Rome to make it to your 10am flight. This is what I would do Rome 3 nights, then head to Venice for 1/2 nights, make my way down to Florence 3/2 nights, and Rome for love more 1 night. Spend that last night in Rome since your flight is in the early a.m."}]}, {"id": "2204669849932093", "text": "Hi. A question to those who have been in a similar situation and willing to share experience with costs. Am I best suited to buy individual train tickets OR 4 day Eurail AT USD412/NZD670 & pay for the smaller journeys in cash. Flight lands in Rome then plan to train to Sorrento for 3 days. Plan to train to Florence for 3 days. Then train to Cinque Terre for 2 days then back to Rome for 3 days before returning home. Any advice will be greatly appreciated.", "link": "facebook.com/groups/1373361046396315/permalink/2204669849932093/", "likes": 2, "comments": [{"username": "Gena Kona-Mancini", "comment_text": "Buying tickets 14 days in advance saves a LOT of money! I looked at the prices of my train tickets individually and then the 4 day pass and it wasn't worth it for me. But note that prices change drastically in different time frames (I had to change my train from Rome to Naples. Paid €15 and to book last minute it was up to like €55)"}, {"username": "Katalina Loredo", "comment_text": "Buy the tickets individually"}, {"username": "Colleen Dawson", "comment_text": "I would suggest individual tickets. If you are sure of your dates and time buying longer distance tickets in advance is cheaper. Trenitalia and Italo are the 2 train companies with apps and websites. There’s also Omio and Trainline third party sellers you can use. Use Rome2rio to plan your travel and check Seat61 website which explains train travel in Italy.\nHave a wonderful time."}]}, {"id": "2204932993239112", "text": "YOUR ideal 3 days 4 nights in Rome.", "link": "facebook.com/groups/1373361046396315/permalink/2204932993239112/", "likes": 0, "comments": [{"username": "Jennette Riches", "comment_text": "1 - historic center (all the traditional sites) 2 - Gianicolo, Trastevere, Isola Tiberina and the Jewish Ghetto 3 - Giardino degli Aranci, Testaccio, Non-Catholic Cemetery and the War Cemetery. Another option is Verano Cemetery and then Esquilino and Monti. This only works for a cemetery-lover like me :-)"}]}, {"id": "2204781789920899", "text": "Recommendations for power converters to allow use of hair dryer.\n\nThanks in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2204781789920899/", "likes": 3, "comments": [{"username": "Connie Iacozza Brazzoni", "comment_text": "Be careful. I used a converter and it fried my straightener"}, {"username": "Meredith Noll", "comment_text": "Check if your accommodation has one. My hotels did so did not have to bring one. Previously someone recommended to buy a cheap one at the farmacia when you land"}, {"username": "Vasthi Cheddar", "comment_text": "Just take a dual voltage or a 240v hairdryer. A converter will need to handle a much higher wattage than your regular hairdryer which will make it much larger and heavier. Not all can handle hairdryers."}, {"username": "Krissy DaRusso", "comment_text": "Leave it at home! Most places here, even my AirBnBs have a hair dryer."}, {"username": "Frank Huber", "comment_text": "My wife just bought a local cheap one ."}, {"username": "Denise Wade Fulmer", "comment_text": "Most hotels furnish a blow dryer. I also purchased on Amazon a blow dryer just for Europe. Amazon carries several adapters. They will tell you European or UK. They are totally different from each other. I have both"}, {"username": "Madeline Caporale", "comment_text": "Unless you want to fry your hair dryer invest in a dual voltage. Using a converter is very likely going to damage yours."}, {"username": "Eden Seery Thornton", "comment_text": "I bought a dual voltage travel hair dryer on Amazon BaBylissPRO Nano Titanium Travel Dryer, Blue https://a.co/d/\nea0r7Cd"}, {"username": "Sue Ellen Thomas", "comment_text": "You still need to purchase appliance with dual voltage!"}, {"username": "Iryna Davie", "comment_text": "Iryna Davie"}, {"username": "Beatriz Davalos Moreno", "comment_text": "your hair dryer wont work if its not dual voltage. My flat iron did not work at all! I bought this hair dryer that worked very well for me in Spain, Italy and France, you will need a converter too, I will give you the two I purchased."}, {"username": "Beatriz Davalos Moreno", "comment_text": "I also added a backpack that seriously helped me a lot"}, {"username": "Beatriz Davalos Moreno", "comment_text": "https://a.co/d/\n9xLk8BS"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Don’t bother. Most if not all accommodations in Italy have hair dryers."}, {"username": "Nancy Lewis", "comment_text": "Just check for dual voltage.\nIf yes then you only need an adapter for plug shape."}, {"username": "Janet Messanelli Bozzone", "comment_text": "Don’t. Invest in a dual voltage ones. The converters are not always effective for high voltage items."}, {"username": "Roxanne Franquelli", "comment_text": "Yes. Be careful. Mine burned out. You can buy a European one on the trip or I think Amazon sells."}, {"username": "Jamie Weston", "comment_text": "You do not need to bring a hair dryer. Almost every single place you stay will have one. I brought my curling iron though, and have a Conair converter that works great for it."}, {"username": "Barbara Hayes", "comment_text": "But a dual voltage dryer. You will only need an adapter then. The converters are awful"}, {"username": "Gavino Reloj", "comment_text": "1) Voltage step down from Italy 220v to US 110v is called a @stepdown transformer! It is not needed in your dryer in the plug says 110v-220v. If not, I don’t recommend buying a transformer!\n\n2) very likely - you will need a plug adapter from US flat (1 is hot and the other is neutral) ! Italy has a round slanting plug ! The plug adapter you can buy from Amazon"}, {"username": "Kim Bend Smolinski", "comment_text": "I purchased a dual voltage dryer and curling iron for our travels. They have worked great in many countries!"}]}, {"id": "2204680723264339", "text": "I would like to ask - any reccomendations of nice Agroturismo in Middel Tuscany around Siena for reasonable price with the possibility to visit some local wineries.... thank you. .", "link": "facebook.com/groups/1373361046396315/permalink/2204680723264339/", "likes": 1, "comments": [{"username": "Philip Curnow", "comment_text": "Borgo Casa al Vento"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "look here https://\nwww.dpbolvw.net/\nclick-100692842-\n12291623?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.it\n%2FHotel_Review\n-g608934-d10155\n71-Reviews-Lupa\nia-Torrita_di_S\niena_Tuscany.ht\nml"}]}, {"id": "2204749443257467", "text": "This will be our first time in Rome. We want to see all the major sites. In what area should we get a hotel?", "link": "facebook.com/groups/1373361046396315/permalink/2204749443257467/", "likes": 1, "comments": [{"username": "Carine Brys", "comment_text": "We got one in the center, near the Pantheon and everything was within walking distance. Vatican City and Trastevere (both on the other side of the river Tiber) were the farthest away. Our hotel was the Colonna Palace, right in front of the Italian Parliament. I can recommend it (nice breakfast, clean rooms with a safe, rooftop terrace) but I've heard you need to book plenty in advance. We had Economy rooms and still had a beautiful view on Piazza Colonna and the Parliament. Not looking at a wall like I had feared. The hotel arranged for private transportation from the airport. It was 60 Euros for 4 people + suitcases. I have learned since that the taxis at the airport have a fixed fee of 50 Euros to the center, but they might not have been large enough with our luggage."}, {"username": "Darren Rogers", "comment_text": "We stayed at Chapter Roma, great location to walk to most places."}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.kqzyfj.com/\nclick-100692842-\n12291623?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.it\n%2FHotel_Review\n-g187791-d39647\n72-Reviews-Rome\n_Times_Hotel-Ro\nme_Lazio.html"}, {"username": "Carol Taylor Tisdale", "comment_text": "I too highly recommend something (we got an Air BnB apartment) in the Pantheon/\nPiazza Navona area. Convenient to so much and full of wonderful food, shopping, atmosphere!"}, {"username": "Leanne Dawn Sutton", "comment_text": "Piazza Navona"}, {"username": "Tam Wong", "comment_text": "Spanish steps"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "In the very center of Rome in the historic district. I like the area around Piazza Navona."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Try Monti area instead, still walking distance with all the monuments (not the Vatican maybe), not overcrowded with tourists, actual Italians live there and the evening is really nice even if not packed like Trastevere."}]}, {"id": "2203785893353822", "text": "These! Absolutely perfect for this trip. For those who haven't heard this, Europeans don't eschew washcloths. These little bits [of compressed whatever] are priceless and YOU NEED THEM! 100 towelettes and 2आणखी travel cases for $12.97 and worth every penny. They just need a little water to expand and they are super strong towelettes. They do not tear or disintegrate at all. No, they aren't terry washcloths, but they are way better than none. 😁\n\nUpdate: I never meant to start a riot over living responsibly with our planet, and I definitely didn't see the \"to use or not to use\" a cloth to wash your face debate coming. I find them helpful when traveling, but that's just me. If they aren't for you, please don't take it as a personal invitation to attack someone who is just trying to share a travel tip. Good grief!", "link": "facebook.com/groups/1373361046396315/permalink/2203785893353822/", "likes": 383, "comments": [{"username": "Jackie Southwell-Hall", "comment_text": "I use a flannel\nFor my face and a sponge or scrunchie in the shower! I use a flannel (face cloth) to remove cleanser/\nexfoliant"}, {"username": "AI Mee", "comment_text": "Are they soapy? Do they sanitize? Or is it just water and a cloth.. like a wet paper towel?"}, {"username": "Yvonne Donnellan", "comment_text": "This is ridiculous. Not sustainable and are they biodegradable, compostable?"}, {"username": "Yvonne Donnellan", "comment_text": "Yvonne Donnellan"}, {"username": "Elaine M Woodward", "comment_text": "The description on Amazon makes them sound like they are toilet paper"}, {"username": "Jenni Harland", "comment_text": "I love my flannels! Maybe it’s a British thing too!"}, {"username": "Lori Greco", "comment_text": "Why dont you just wet a corner of the towel provided and use it?"}, {"username": "Jessica McMichael", "comment_text": "Americans doing all they can to be as unsustainable as possible"}, {"username": "Michelle Plutto", "comment_text": "I bought them also!!"}, {"username": "Karen Gregorchuk", "comment_text": "Courtney Greg"}, {"username": "Antoinette Schultz Vogt", "comment_text": "Christopher Vogt"}, {"username": "Connie Dennis", "comment_text": "I absolutely never use washcloths at home! I'm from canada"}, {"username": "Dulcie Rae", "comment_text": "Humans are the worst. Just a throw away culture. :("}, {"username": "Cheryl Belloff", "comment_text": "So there’s seriously no wash clothes in the hotels"}, {"username": "Tammy Oehler Liggett", "comment_text": "Jamie Welch Kendra Thompson another thing!!"}, {"username": "Brandy Wine Huffman", "comment_text": "Melissa Hayes"}, {"username": "Maria Angela Perrone", "comment_text": "We Italians wash our bodies in the sea 😂😂😂"}, {"username": "Maria Angela Perrone", "comment_text": "Maria Angela Perrone"}, {"username": "Andrea Shelton", "comment_text": "I think the part that’s missing here is that the majority of tourists do not use bidet or the hose.\nIn areas of the world where washing up after using the toilet is expected proper hygiene, the cloths are for drying. Toilet paper is advertised as having superior drying power.\n\nPlease avoid bragging about not cleaning yourself up after using the toilet."}, {"username": "Karen Dittman", "comment_text": "Nice idea"}, {"username": "Liliana Voicu", "comment_text": "With each day, I believe even more strongly that Americans are a different breed"}, {"username": "Jennifer Montague", "comment_text": "American here… have never used a washcloth. Also I do worry about the level of garbage and waste for other countries when I see posts like this."}, {"username": "Renee Beal", "comment_text": "Love them!!!"}, {"username": "Bern Louna Proctor", "comment_text": "Thanks for the tip"}, {"username": "Pam Villies Trikolas", "comment_text": "Yep got these"}, {"username": "Alison Kanak Mazoch", "comment_text": "They don't use washcloths! What else do I need to know/bring. These are a great idea."}, {"username": "Alison Kanak Mazoch", "comment_text": "This feed is soooo funny."}, {"username": "Karen Espinoza", "comment_text": "Wow 🤩\nThanks for sharing"}, {"username": "Camille Mccoy Lmt", "comment_text": "And they are BIODEGRADABLE! 👍"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "I bought a pack of terry clothes in Walmart to take on our trip for $5 and just left them in the hotels !"}, {"username": "Joanne Calzaretta", "comment_text": "Just purchased on Temu. U think I got 20 for $2. Just enough for my trip"}, {"username": "Pao Magnoler", "comment_text": "Use towels!!"}, {"username": "Denise Leslie", "comment_text": "If you can’t flush toilet paper, how do you get rid of oder?"}, {"username": "Holly Gregg", "comment_text": "Perfect 👍. Thank you."}, {"username": "Lisa Adams Robertson", "comment_text": "Remember, they are not flushable!"}, {"username": "Deborah Schroeder", "comment_text": "Are they safe to flush? I have read some of these plug up the drain systems."}, {"username": "Voula Ladas", "comment_text": "Interesting idea . Would be handy to have some for travel for use as a facecloth, wiping spills , or even toilet paper."}, {"username": "Annette Tamminga", "comment_text": "I ordered these and they are as strong as disposable shop rags that come on a roll, only compressed. I was impressed and will be taking them with me on my travels to use in place of wash cloths. You must place them in the garbage for those asking."}, {"username": "Miyuki Kanno Paul", "comment_text": "We had one at the restaurant in Genova. The server poured hot water to the cavity. I dropped the “white tablet” there and the magic happened!"}, {"username": "Rose Porter", "comment_text": "Born in Italy, grew up in Canada and never have I used a face cloth, always hands and sponge for body. I just can’t use something on my face that will pull at my skin. I’d prefer my wrinkles come naturally and speed up the process\n\nThat being said.I see that these are disposable but are safe for the environment? What chemical is used to make them compact?"}, {"username": "Tiffiney Q. Irons", "comment_text": "We bought a travel Loofa, it dried by morning , easy to pack and smaller than this"}, {"username": "Nicole Fuller Fahnestock", "comment_text": "Catherine Ann Newell Galan we were just talking about packing washcloths! LOL"}, {"username": "Sheron Milliken", "comment_text": "I use these when I travel to Italy…they work great for removing makeup."}, {"username": "Linda Corriveau", "comment_text": "This is disposable crap! 😡"}, {"username": "Heather Lee Morris", "comment_text": "Holly Weller I’m getting some !!!"}, {"username": "Gillian O'Callaghan", "comment_text": "Oh way to clog Italy up with more unnecessary rubbish.....she\nesh."}, {"username": "Alicia Cox", "comment_text": "These towelettes are great & I never thought of using them to bathe. I use them as a towelette. I travel with a microfiber wash cloth as it dries really fast."}, {"username": "Heidi Coble Sharer", "comment_text": "I went to the dollar store and bought baby washcloths. They worked well. They are way cheaper and I didn't feel guilty about tossing one after a couple of days."}, {"username": "Ray Haneski", "comment_text": "You might have to use two but the work"}, {"username": "Marianna Mazzuccato", "comment_text": "Omg more garbage.."}, {"username": "Leila Myftija", "comment_text": "We have washcloths in Italy. They're called lavette."}, {"username": "Jessica Petyo", "comment_text": "I brought a shower pouf and Ziploc baggie and used for 2 weeks. Worked great and cost less than $1."}, {"username": "Shelly Miller", "comment_text": "The comments haha 😂 I had no idea this was a thing, I’m an American we use washcloths for face washing, how do y’all wash ya face ? 🤷🏼‍♀️"}, {"username": "Michelle Aldous", "comment_text": "I like puff puffs 🤣"}, {"username": "Mike Flohr", "comment_text": "FFS 🙄🤣"}, {"username": "MaryLynn Capobianco", "comment_text": "Thanks for the tip Susan. I’ve never seen these before but it seems like a great idea for travel! I sometimes use a hand towel to clean off facial cleanser when I wash my face at a hotel but these make more sense and look easy to pack. Sorry you’re getting so much grief when all you did was try to help! Sheesh people!"}, {"username": "Vanessa Allen", "comment_text": "Rachel Jones this is the best convo and comment section ever. Lol"}, {"username": "Janie Gutierrez", "comment_text": "I’m 59 and my whole family has always used washcloths. What do you wash your face with if you don’t use washcloths?"}, {"username": "Sheri Beitner", "comment_text": "I use disposable facial towelettes. Kirkland brand from Costco…use them every day to take my makeup off."}, {"username": "Heather Lynn Smith", "comment_text": "I didn't buy this brand but I already bought a packet. We use face cloths and washcloths.... I have separate ones. I always have and I probably always will. The disposable ones are really only for when we travel."}, {"username": "Jackie Richards", "comment_text": "One more thing added to my Save for Later lol Thank You! Little things you wouldn't think about."}, {"username": "Ricky Price", "comment_text": "Leanne Ravell who’d a thought"}, {"username": "Stacie Morrow", "comment_text": "Just pack one washcloth person, hang to dry after your shower and pop back in your luggage the next day!"}, {"username": "Diana Hesse", "comment_text": "I’m a bit puzzled as to why one would need a washcloth to put soap on the body? Is it for extra friction to remove grime? Why not just use soap?"}, {"username": "Colleen Dawson", "comment_text": "Have been using them for few years now, but for camping."}, {"username": "Mary Ann Mills", "comment_text": "Can they be used in place of toilet paper since I’ve read to carry some with you."}, {"username": "Natasha Schue", "comment_text": "Do people not use their bath towel for their face? I'm so confused by the washcloth debate and genuinely curious."}, {"username": "Joy Justiniani Weide", "comment_text": "Thank you for sharing!!!"}, {"username": "Alessandro Battxi", "comment_text": "washcloth for what? O_O"}, {"username": "Debra Rigler-Arsenault", "comment_text": "I use this type for hiking."}, {"username": "TJ Williams", "comment_text": "Small cloth used for washing the face and body in the shower or bath. Can also be used just for the face at the sink."}, {"username": "Robin Weathers Richie", "comment_text": "Bought these and really happy I did! They came in handy at hotels!"}, {"username": "Sarah Thomas", "comment_text": "I’m with the Europeans on this one. I have never understood the American obsession with washcloths🤷🏼‍♀️"}, {"username": "Daisy Yoo", "comment_text": "I have these"}, {"username": "Melanie Matthews Stuprich", "comment_text": "For all those wondering, and those who have said they provide them in Europe (they really don’t…those are for the bidet to clean up after), Americans like to wash with wash clothes to scrub their body instead of just using soap. It does help to exfoliate and really scrub but I know Europeans do it differently. But as Americans you can’t expect wash cloths like the states when you are staying in a different country. 🤷🏽‍♀️"}, {"username": "Jeff Gentner EA", "comment_text": "I picked up a dozen face/wash clothes at the Dollar Store. Brought one for each hotel I stayed at on a three week trip. Used each day, then left it as I moved on. Worked great!"}, {"username": "Veronica Trejo Beebe", "comment_text": "I just bought a pack 2 weeks ago. I showed my aunt yesterday and she loves them."}, {"username": "Minta Kulas", "comment_text": "This whole conversation cracks me up."}, {"username": "Toni Williams", "comment_text": "Eeewww germy things. They get so full of bacteria 🦠"}, {"username": "Nadia Mckenna", "comment_text": "Are they disposable?"}, {"username": "Barbara Gentilcore", "comment_text": "Flannel/\nWashcloth/\nFacewasher used by people to wash with in the shower/bath. Applies soap to the skin and gives the skin a scrub. I usually travel with my own in a plastic bag with my soap. Some accommodation provide them, some don't."}, {"username": "Mo Dee", "comment_text": "I am in the minority here. I packed a few regular washcloths from home. Washed them with my other laundry and moved them from house to house as we traveled!"}, {"username": "Stjepan Kujadin", "comment_text": "I’m confused… why would you need this?"}, {"username": "Assunta Gargano", "comment_text": "Okay ?????"}, {"username": "Cyndi Riley", "comment_text": "Thx for sharing. Definitely will be buying. We’re doing 10 weeks in Italy next spring. Can’t wait!"}, {"username": "Wyketta Gibson", "comment_text": "There's so much debate in the US around use of a washcloth. For my family we use 1 to wash your face and another 1 to wash your entire body. Once they are wet (after each use) we hang them to dry and then toss them in the hamper to be washed and dried later in the week. The same for body towels."}, {"username": "Andrea Shelton", "comment_text": "The small cloth is used to blot dry after bidet. Even if you do get one in your hotel, rubbing your face with it when you know where its been? If you need a washcloth/face cloth/flannel (whatever you call it), bring it with you."}, {"username": "Lynn Clemens", "comment_text": "Mark Clemens"}, {"username": "Jackie Ames", "comment_text": "I brought a bag they were very useful"}]}, {"id": "2204094993322912", "text": "* updated itinerary with some of your suggestions and corrected port info *\n\nRecommendations for private transport to the port? Not looking to take a bus or shared ride. We’d like to go kind of all out because ,आणखी ‘when in Rome!’ 🙂\n\nMy boyfriend and I are going to Italy in October 2023. We’re spending a few extra days in the embarking and disembarking cities. First is Rome. Advice on the Rome itinerary I created? Thanks in advanced! 🇮🇹🍷", "link": "facebook.com/groups/1373361046396315/permalink/2204094993322912/", "likes": 38, "comments": [{"username": "Krista Blaylock", "comment_text": "We did this exactly the same! You can see the Spanish steps, Trevi fountain and some of the piazzas your first day as you explore!! Have a wonderful time!"}, {"username": "Mercedes Hope", "comment_text": "This looks like a lovely plan! You’ll see so much walking around the city. Have an amazing time"}, {"username": "Gianna Onesi", "comment_text": "Great not rushed!"}, {"username": "Claudia Pace", "comment_text": "The Colosseum, Palatin Hill and Roman Forum are on the same site and often the tickets are sold together. Once you leave it, not sure you can come back. No restaurant on site. Maybe you can bring a lunch in your bag and eat it in the outdoor, but there is no picnic table and I am not sure if food is allowed. Better to verify this part."}, {"username": "Ken Lerch", "comment_text": "If you have any interest in the most magnificent baroque sculpture, look into the Bernini work at the Villa Borghese. But you will need reserved tickets."}, {"username": "Dafne Vassetti", "comment_text": "Colosseum and Roman Forum/Palatine Hill - do you have a guide? If yes, the entire tour lasts 2 hours and you won't be able to break it in two slots.\n\nFor lunch in Colosseum area - try near la Salaria Vecchia/ Monti neighborhood. Otherwise walk to the Jewish Ghetto and either have lunch in any of the restaurants there or proceed to Campo dei Fiori and have lunch in any of the places around the market/close to the square."}, {"username": "Amanda Lee", "comment_text": "When in October are you going?!"}, {"username": "Jeff Gentner EA", "comment_text": "Be sure to stroll through the Trastevere area for dinner. Excellent restaurants. Like a small town in a big city."}, {"username": "Lisa Ann", "comment_text": "You can easily do coliseum, forum, Palatine Hill all in the early morning. Stroll through piazza Navona and visit Pantheon which are close to each other. Would definitely see Trevi fountain in the evening. Less people and more beautiful. Maybe your first evening? Trastevere is an excellent location for an aperitivo and dinner. Wander and get lost in the city…it’s the best! Have fun!"}, {"username": "Brian McGraw", "comment_text": "I like it Good plan!"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "I think you mean you need to get transportation to Civitavecchia to board your cruise not Venice."}, {"username": "Eric Parks", "comment_text": "On day 2, I would have your appetivo in Trastevere and then get a taxi up to the overlook at Belvedere del Gianicolo during sunset (great view of rome) and have the taxi wait for you then head back to Trastevere for dinner. Taxi waiting is worth the extra money as I rarely see available ones up there."}, {"username": "Kiana Cathy-Ann Strong", "comment_text": "I did the Vatican in the morning and colosseum (palatine and Roman) in the afternoon. It is possible if you want to get them over and done with together and have a full day to just explore"}, {"username": "Rachael Richardson", "comment_text": "Coliseum, palatine hill and Roman fort can be done together in one tour,\nYou have to book tickets for pantheon once in there it only takes about 20-40 mins to look round.\nDon’t forget the Borghese gardens and sant Angelo castle near the Vatican"}, {"username": "Gary W Anderson", "comment_text": "Day 3 chk out the Borghese gallery, it’s very nice."}, {"username": "Mon E Guil", "comment_text": "Day 2 see the pantheon first and go early in the morning when it opens. Last time i was there it required booking an entrance time but in the morning when it opens there is hardly anyone there. Also for lunch if you are in the colosseum area I highly recommend Benso 215 https://goo.gl/\nmaps/\nZ2szmC6tiKtbeUB5\n6"}, {"username": "Sonia Smith", "comment_text": "FYI: Make sure your cruise actually leaves from Venice. That’s what we thought but, it leaves fro Ravenna. Luckily our VRBO host mentioned this to us so we were able to make changes."}, {"username": "Christine Ann", "comment_text": "Is your cruise from Venice or actually Ravenna? There’s a huge difference"}, {"username": "Paola Bobko", "comment_text": "Cristina Liso sounds good!\nA suggestion: Off the beaten path, but you might want to include it in your itinerary: knights of Malta keyhole.\nAlso do not miss: via delle quattro fontane, trevi fountain, Spanish steps.\nAperitivo: NH fori imperiali hotel bar, the court, Bernini Bristol terrace.\nAlso you can follow this local page on Instagram: a lot of suggestions on where to have aperitivo in Rome: aperitiviroma\ndinner: cantina e Cucina (Roman food), pianostrada, aroma, il San Lorenzo chinappi.\n\nEnjoy! 🙂"}, {"username": "Marcus Hiesler", "comment_text": "Sharon Hiesler almost what we doing"}, {"username": "Carole Tarlap", "comment_text": "Cancel that cruise AND stay in ITALY .....IMO 🤷 ♥️🇮🇹"}, {"username": "Jim Murphy", "comment_text": "We just got back from Italy and had almost this exact itinerary while there with a couple other stops on your day 2 and came out to almost 20 miles walking that day. It worked out perfectly for us. Enjoyed Rome even more than we thought we would."}, {"username": "Matthew Soohey", "comment_text": "I recommend, if you want a special dinner, make reservations at Imago. Great view and overall great experience. Pricy but worth it!"}, {"username": "Alexandra A Welker", "comment_text": "Your itinerary looks good!! Church out Castel Sant'Angelo, it has a great view of the city...or from Terrazza Viale del Belvedere/\nVilla Borghese area. Spanish Steps is just around the corner. I also recommend City Pass it includes entry to popular attractions, public transport and Hop on Hop off bus."}, {"username": "Andisuari Dewi Sucahya", "comment_text": "Thank you for sharing.. i hv 3 days in Rome and was wondering how to see all u hv listed including Spanish Steps and Trevi Fountain.. may i copy ur itinerary please 🥰"}, {"username": "Mohanad Saddik", "comment_text": "Omar Kharboutli"}, {"username": "Jo Sawyer", "comment_text": "I’m going to be in Rome in September and I have almost exactly the same itinerary planned for myself. I’ve never been so it’s a relief to read the comments about your itinerary."}, {"username": "Noelani Randazzo", "comment_text": "For private transportation use Daniele Your Driver in Rome http://\nwww.connectingro\nmeairport.com/"}, {"username": "Kris Beacham", "comment_text": "Hop online a get a car service."}, {"username": "Raquel Pickering", "comment_text": "Day three do trevi as it's walking distance from Vatican and through some really retty little streets. I will say it's gonna be crowded. We went twice, once in the afternoon around 3ish and it was packed. Went back next day at 7am and it was perfect."}, {"username": "Shannon Marie", "comment_text": "Looks like a good plan to me!"}, {"username": "Marlene Bertino Randolph", "comment_text": "This looks good. Hitting the highlights with time to explore. Rome is so walkable. If you got to Rick Steves he has two Rome walks that hit all the highlights. 😀"}, {"username": "Philip Curnow", "comment_text": "Lots of local people running their own tours. Seems only right to book with them. Drop by the tourist point near the Colosseum for more direct info and prices."}]}, {"id": "2204170796648665", "text": "If you’re looking for a great tour service for the Vatican, check out City Wonders. We had breakfast at the bistro on site and our tour guide was great!!! My mom got lost taking photos and he went to go find her!!! That says a lot! (We had a tour in another city and we lost our guide 3 times!!) We had a great experience all around with our guide with City Wonders! He even volunteered (without us asking) to take photos of us in several spots so we didn’t have to ask complete strangers. I would definitely book with them again!", "link": "facebook.com/groups/1373361046396315/permalink/2204170796648665/", "likes": 2, "comments": []}, {"id": "2204279989971079", "text": "We have arrived back home after our whirlwind of a visit, with 7 nights in Italy total.\nThis is just our experience overall we had a great trip but here are my takeaways. Sorry for the long post!\n\n2 nights Venice - beautiful city but the bridges with large luggage was a nightmare, would definitely book a hotel close to a water bus drop off point 10 euro pp, otherwise you would need a water taxi and preferably one with a lift if you have a fair amount of luggage 😂. Definitely listen when people say pack light! Also one of the days we had was scorching hot and none of the shops have air con 🔥We loved just walking and getting lost and then coming out to a piazza, we also had the most amazing food at De Carletta. Taxis on the mainland were impossible to find, overpriced and there is no Uber etc. We also did not realize they only take cash. But when u are needing to get to a flight you do whatever you need to do to get there. We ended up walking a few km’s with luggage to find one but maybe it was because it was a Sunday. We also found the taxi app couldn’t find our location and to call they don’t speak English 😩\n\n3 nights Sorrento - flew with Ryan air to Naples, we had no problem whatsoever and hand luggage wasn’t looked at. Caught a bus to Sorrento which proved harder than expected to find it was about 800m up the road and bus didn’t have much air con but was an ok way to travel. In our 2 days we spent half a day exploring Sorrento which was enough as there isn’t much there, then went to Pompeii by train which was easy. A guided tour 4.30 tour was perfect as it wasn’t hot🥵 Our second day we did a boat tour to Capri, just our opinion but at this time of the season especially it was very overrated. Crowed, hot and waiting in long lines for the cable car to go to overpriced restaurants and shops. We ended up getting the public bus which proved much quicker. It also didn’t help that we booked late online and I feel our tour was very overpriced, for a trip with 12 people to the island and a short trip around it with a swimming stop, (blue grotto was closed) 160 euro pp. Next time I would book from the mainland directly. Food was amazing in Sorrento especially the orange tree and Qui bistro 🥰\n\n1 night Rome - we caught the ferry to Naples which was great but a 30euro taxi for 7mins drive 😬again no Uber and had to get hotel to call and book, then another 20euro from airport to train. Next time would just take the train from Sorrento. We were supposed to catch the fast train but were rushing and caught the slow train instead so got in one hr late 😩 note to self triple check train numbers! Once in Rome at 11am we did the hop on hop off bus which was great and stopped near all the major attractions. We even got a last minute guided tour of the colosseum at the gate 40 euro pp. We ticked off all of the major places all by 4pm 👌\n\n1 night Florence - We arrived by train to Florence and went straight to our highlight tour of the trip. Booked through viator Fun in Tuscany a horse ride through the vineyards, with a stop at San Grimiono and 3 course lunch with wine tasting at a winery. It was all amazing would highly recommend! Approx 200euro pp 8hrs. They also stored our luggage in the bus and waited when our train was 10 minutes late. That night we went up to Michelangelo’s piazza to watch the sunset, it was very busy so get there early but was amazing 🤩. The final day we walked Florence and seen most of the major landmarks whilst shopping for the best priced leather we found in the markets.\n\nAll in all we had an amazing time even though it was short and we learnt a lot. I hope this was helpful to some ❤️", "link": "facebook.com/groups/1373361046396315/permalink/2204279989971079/", "likes": 89, "comments": [{"username": "Joseph Nesser", "comment_text": "Thanks! Do you mind sharing the link to the horseback riding tour?"}, {"username": "Scott Heran", "comment_text": "Suggestion. Much less luggage next time."}, {"username": "Jenny Lloyd", "comment_text": "Thank you for such an informative and interesting read 👏🏻"}, {"username": "Beverley Ford", "comment_text": "Glad you had an amazing time. I went to Sorrento last year flying into Naples first and then catching a bus which was literally out of the airport and across the car park. Wasn’t very far at all."}, {"username": "Tam Wong", "comment_text": "You had to of missed so much in Rome . Rome is the greatest place to spend days in❤️🇮🇪🇮🇪❤️"}, {"username": "Coco Cole", "comment_text": "Thanks!!"}, {"username": "Dianne Elizabeth Organ", "comment_text": "Thank you for this information! Very helpful. Would you mind sharing the names of the accommodations you stayed at? We are finding that a lot of places are $500-$600 Canadian per night. This is out of our price range since we’re staying for two weeks."}, {"username": "JeriLynne Clifford", "comment_text": "Sounds like you had fun. My husband would have a hard time with that schedule 😂 we have a 3 night minimum because he hates traveling on a vacation."}, {"username": "Marianne Fontana Skrocki", "comment_text": "Look into staying at an Airbnb."}, {"username": "Cheryl Tomkinson-Hunter", "comment_text": "Thanks for sharing your experience. Your schedule is very informative and helpful."}, {"username": "Renee Rundle Stoneham", "comment_text": "FYI taxis…\nYou have to go to a taxi stand to get one.\nIt’s illegal to “hail” a taxi like in US.\nHotels etc will call one too.\nFree Now app will call a taxi.\n\nGlad you had a good time, although it sounds very rushed and lots of traveling from place to place.\nSlow down next trip, soak it in. Less luggage!"}, {"username": "Debbie Keller", "comment_text": "Love your photos"}, {"username": "Kerrie Johnson", "comment_text": "We will be traveling to Rome from Sorrento also. I was thinking of taking the ferry from Sorrento to Naples, taxi to Naples train station, high speed train to Rome. Only 2 of us. Does this sound like a good plan???"}, {"username": "Toi Doden", "comment_text": "Sounds great especially the horseback\nI cannot find that in Viator\nDo you mind sharing that event link as my daughter would LOVE that. Thank you"}, {"username": "Grace Ang", "comment_text": "Can share details of where to take the horse ride pls? We are thinking of renting a car to drive into the suburbs"}, {"username": "Linda Abbatemarco", "comment_text": "Thank you for sharing!"}, {"username": "Bonny S Boggs", "comment_text": "Glad you enjoyed now you’ll have to go back to what you liked!"}]}, {"id": "2204585439940534", "text": "Bella Roma", "link": "facebook.com/groups/1373361046396315/permalink/2204585439940534/", "likes": 74, "comments": [{"username": "Nadia Mckenna", "comment_text": "Great photos"}, {"username": "Veronica Tame", "comment_text": "Veronica Tame"}, {"username": "Viraf NZ", "comment_text": "Beautiful pics just returned a few weeks back. Lovely memories"}, {"username": "Cinzia Colombo", "comment_text": "Roma is a beautiful woman that never gets old! 😀 beautiful pictures!"}]}, {"id": "2204569369942141", "text": "Does the messaging app, \"What's App\" work in Italy?", "link": "facebook.com/groups/1373361046396315/permalink/2204569369942141/", "likes": 107, "comments": [{"username": "Maria Angela Perrone", "comment_text": "Yes. I added the B&B, the car rental, and all the contacts I will have in Italy, to What's App."}, {"username": "Yvonne Ormson", "comment_text": "Almost everywhere in the world—it’s the most common way to communicate 🙂"}, {"username": "Barbara Marie Demaio", "comment_text": "Yes sure does 👍"}, {"username": "Michela Zanni", "comment_text": "yes"}, {"username": "Jennifer Gustafson", "comment_text": "Yes but be careful as it does open it up for scammers but you can block those numbers."}, {"username": "Chalawnda Kelley", "comment_text": "Si!"}, {"username": "Sari Hourula", "comment_text": "Yes it does work in Italy."}, {"username": "Mary Evans", "comment_text": "Mary Evans"}, {"username": "Elizabeth Sierra", "comment_text": "Yep 👍"}, {"username": "Rita Di Giacinto", "comment_text": "Yes‼️"}, {"username": "James Carr", "comment_text": "This question made e laugh because I installed WhatsApp for our trip. Some restaurants will respond to you on WhatsApp before they do on the phone!"}, {"username": "Francine Eaves-Ranft", "comment_text": "Y"}, {"username": "Hina Kazi", "comment_text": "Yes"}, {"username": "Karen Kerr", "comment_text": "Yes"}, {"username": "Colleen Jennings", "comment_text": "It’s great as it’s free to send messages & calls internationally\n."}, {"username": "Lina Costantino Sirianni", "comment_text": "Its what they use"}, {"username": "Vicki Layfield", "comment_text": "Yes it does and it is the best way to contact property owners"}, {"username": "Tricia Holland", "comment_text": "Yes 💯"}, {"username": "Alexandra Gómez Jaramillo", "comment_text": "As long as you have internet, it will."}, {"username": "Rita Bivona Morgan", "comment_text": "Yes"}, {"username": "Tony-Annette Unpingco Ada", "comment_text": "As long as you have data."}, {"username": "Giovanni Pianigiani", "comment_text": "That could be seen as a joke but in facts it's a serious question. Whatsapp obviously works everywhere (well maybe PRK has shut it down?) but in several countries it's not the most common messaging app.\nIn Italy rest assured, several people are using WA as the only way of communicating"}, {"username": "Jennifer Sadutto McKay", "comment_text": "Yes"}, {"username": "Robin Kronick", "comment_text": "Yes"}, {"username": "Philip Curnow", "comment_text": "Is the Pope Catholic?"}, {"username": "Tracey Fairbrother", "comment_text": "Yes works fine"}, {"username": "Hudd Cass", "comment_text": "It works anywhere"}, {"username": "Pamela Hill French", "comment_text": "Yes‼️"}, {"username": "Shannon Capocci", "comment_text": "yes what’s app was really helpful"}, {"username": "D Rochelle Milton", "comment_text": "It’s what I use when I travel internationally\n👍🏾"}, {"username": "Steven Gosling", "comment_text": "Yes"}, {"username": "Christina Andrews", "comment_text": "Yes it does 🙂"}, {"username": "Jamie A White", "comment_text": "Yes it works in Italy/Europe."}, {"username": "Monica Colontonio Macho", "comment_text": "Yes it does"}, {"username": "Donna Hinton", "comment_text": "Yes"}, {"username": "Loran Bertini", "comment_text": "Yes"}, {"username": "Lisa Silverman", "comment_text": "Yes"}, {"username": "Mo Dee", "comment_text": "Yes, and that’s what was always used to communicate with Italian residents."}, {"username": "Susan Stekeur-Wright", "comment_text": "Yes! ❤️"}, {"username": "Julie Brouillette", "comment_text": "Yes it absolutely does. Most restaurants I have made reservations at in Northern Italy use Whats app. Very handy!"}, {"username": "Sandra Greenland Klosowski", "comment_text": "Yes! Yes! Yes!"}, {"username": "Vesela Grigorova", "comment_text": "Yes"}, {"username": "Stephanie Garofalo", "comment_text": "Yes, a great option."}]}, {"id": "2204581443274267", "text": "Looking for a nice place to stay at in La Spezia (3 nights)och in Alassio (3 nights).\nAny suggestions?", "link": "facebook.com/groups/1373361046396315/permalink/2204581443274267/", "likes": 2, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.dpbolvw.net/\nclick-100692842-\n12291623?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.it\n%2FHotel_Review\n-g187824-d17243\n80-Reviews-Nove\ncento_Boutique_\nHotel-La_Spezia\n_Province_of_La\n_Spezia_Liguria\n.html"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.tkqlhce.com/\nclick-100692842-\n12291623?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.it\n%2FHotel_Review\n-g194663-d14028\n663-Reviews-Hot\nel_Riva-Alassio\n_Italian_Rivier\na_Liguria.html"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2204603636605381", "text": "I am just beginning to plan a trip to Italy. I have always wanted to go. I've heard it is difficult to maneuver for the first time.... I am curious as to how other's have managed their first time? Ty :)", "link": "facebook.com/groups/1373361046396315/permalink/2204603636605381/", "likes": 7, "comments": [{"username": "Miyuki Kanno Paul", "comment_text": "Your first step is to purchase a copy of Rick Steves guidebook and narrow down your areas of interest. You’ll start building your itinerary from there. Remember, you are only human that you cannot visit too many places in one day. You’ll do countless miles of walking on cobblestone streets that your feet will be very sore! Rick Steves guide is loaded with wealth of valuable information. That’s where I started by flipping pages.\nHappy Planning!!"}, {"username": "Daisy Yoo", "comment_text": "Not that difficult"}, {"username": "Leanne Bingle", "comment_text": "Elizabeth Colleen Fowler"}, {"username": "Lisa Adams Robertson", "comment_text": "We took a small group tour to get more comfortable for our first time, and then added days to be on our own, after the tour. It worked out great, and we still travel that way."}, {"username": "Jill Brothers", "comment_text": "You can do it"}, {"username": "Sande Ricci", "comment_text": "Our first time was great. We did it all on our own. Flights, accommodation, trains. Not hard to do."}, {"username": "Felicia LoCascio Whitney", "comment_text": "We took a cruise. We got to see several beautiful towns/cities. We hired a private driver for day excursions as there was 20 of us. We went back again to the places we loved the most. Sorrento and the Amalfi coast. I've also used Gate 1 travel."}, {"username": "Jenny Frank", "comment_text": "Not difficult at all."}, {"username": "Sam Sabrina Haney", "comment_text": "We did a Globus Winter Escape tour in March a few years ago and then traveled on our own for another week. We are going again this fall!"}, {"username": "Janice Schollen", "comment_text": "Just returning home from my first trip. Planned it and loved it!"}, {"username": "Diane Davis Lawyer", "comment_text": "I've been planning since March. We go in September. I'm majorly, majorly stressed about getting from here to there in Italy (we are going to four cities). All of of the in between I can handle, but the to and fro is about to overwhelm me. LOL."}, {"username": "Elizabeth Erickson", "comment_text": "I think you are perfectly safe going to the major tourist sites as long as you stay away from the peak season and special holidays like Carnival in Venice. Why would anyone want to skip Florence? I was there for two weeks over the New Year many years ago and it was amazing. Don’t try to cram too many places into a short window of time. I do agree that there are amazing areas that are not overrun with tourists— Lucca and Assisi are two of my favorites."}, {"username": "Cheryl A. Lindo", "comment_text": "I used Google maps street view to scope out where I was staying and map my walking route from the train to my Airbnbs. I was confident knowing my landmarks to watch for as I walked. Florence, Rome, Pompeii- I did get a little lost in Verona, but figured it out."}, {"username": "Tam Wong", "comment_text": "Not difficult"}, {"username": "Vanessa Durkin", "comment_text": "I booked everything myself and travelled alone very easy use booking .com and omio or trainitalia very simple and easy can pay at property fir some bookinfs"}, {"username": "Kathy Dowdell", "comment_text": "Perillo tours"}, {"username": "Elaine C. Macalolooy", "comment_text": "Don't be scared it's not that difficult plus we have Google and Google knows everything. Also, youtube can help you on the little things like how to get a train ticket, how-to read your ticket.. Etc. I find that everyone who has questions about travelling to a different country would have been posted in Google search.\nDo your research and read all the tips you can find, enter your notes on your phone and use it while you're travelling there. Empower yourself !"}, {"username": "Sandra Yee", "comment_text": "My first time, I took a 10/14 day bus tour of Italy. After that first experience which covered all major sights, I went back on my own and just explored the less travelled areas."}, {"username": "D'Anna Hohe", "comment_text": "How difficult it is really depends upon your previous travel experience, your self confidence, and your planned itinerary.\nMajor cities are fairly easy and you will always be able to find people who speak English in tourist areas.\nAs others have suggested, a good guide book will help and will reading tips from Facebook groups such as this one.\nIf you are just starting to plan, you might want to start with a prioritized list of things you want to see and build an itinerary from that. Train travel is relatively easy, but you will want to read advice so that you are comfortable.\nMost people seem to try to cram in too much and travel in Italy is much more enjoyable if you leave time to be flexible and to enjoy the unexpected.\nMembers of this group will be happy to make suggestions and comment on any plans you are considering but you will get many opinions because everyone travels and vacations differently.\nGood luck!"}, {"username": "Dawn Hofmeister", "comment_text": "I planned our trip myself, a 6 weeks trip just in Italy. We just returned and it was easier than I anticipated. Lots of walking! I did schedule a few things that I wouldn’t now…for instance in Venice I pre booked a water taxi that took us from the train station to our Airbnb. There were 5 of us and it ended up costing 70€ and it was a 6 min ride. 😩. Trenitalia was great for making all our train reservations and it kept it all in one place."}, {"username": "Donna Parrish", "comment_text": "Rick Steve’s’ Europe Through the Back Door and Rick Steve’s Italy. Great books! He also has a website www.RickSteves.\ncom\nHe has many shows on PBS also!"}, {"username": "Pam Kimak", "comment_text": "I'm 75 years old, and just returned last month from my 1st trip with my daughter and her sons in their early 20's...that I planned myself except for the train from Rome to Naples and transfers. I went to a local travel agent who helped with that part, along with other good tips. I made hotel reservations directly with both hotels which they appreciated. It was a smooth trip..flying Newark to Rome..3 days, and took a train to Naples with transfers to Maiori on the Tyranian We loved it there..stayed 6 days. We flew back to NJ from Naples. Enjoy!"}, {"username": "Lynn Dye Shell", "comment_text": "Recently returned from our first trip. I researched everything and planned it myself. I was nervous but everything went smoothly, airplanes, trains, hired driver from the airport, cabs, hotels. You can do it 🙂"}, {"username": "Jayne Dawson Meyer", "comment_text": "Just Fine!!! You will too. Its an adventure so treat it as such. Enjoy the journey & destination."}, {"username": "Sarah Campise Hallier", "comment_text": "Went for the first time recently. Study the trains and use them. It was so easy to get everywhere! It wasn’t hard at all."}, {"username": "Marianne Hendriks", "comment_text": "There are many more first times more difficult than going to Italy for the first time."}, {"username": "Pietro Di Sorbo", "comment_text": "You can do it simply and by your own.\nThe important is to planning your trip according your interests (cities arts, museums, Archeologic sites, lakes, Alps and so on) and what period of the year you want to travel (e.g. from November to April maybe is the best period for visiting cities art but not for enjoying sea or lakes).\nBuy an exhaustive book guide, it will be good spend money.\nDon't waste your time rushing from an highlights to another, take some places and visit around."}, {"username": "Irene Oda", "comment_text": "What do you understand by 'difficult to maneuver '- do you have mobility issues?"}, {"username": "Vanessa Durkin", "comment_text": "Not difficult at all trains super efficient people so friendly buses cheap and very easy get you ticket before you board tap on screen thats it very simple have fun"}, {"username": "Dan Wasson", "comment_text": "I used Gate1 for a three destination trip. No problems with anything- hotels were decent, train was great, flights and transfers were included. Great first experience."}, {"username": "Tari Lawson", "comment_text": "My first time I visited on a Mediterranean cruise. We visited Venice, Pompeii, Rome, Florence, and Pisa using local guides, not the cruise ship tours. It was amazing. I went back 2 years later and planned my own trip to Rome for a week. It wasn't difficult. You can absolutely do it."}, {"username": "Annette Giovia", "comment_text": "I went to Italy in 2017, alone. I didn't want to go on tour. I got to see what I wanted to see, when I wanted to see it. Interacted with wonderful citizens wherever I went. I spoke minimal Italian, but got my point across. Many Italians in businesses spoke English, so communicating was not an issue. I stayed in Santa Margherita Ligure in a lovely hotel. I walked into town almost every morning just to mingle with the locals. Watched fishermen unloading their fresh catch of the day. Took a train to Genoa. A ferry to Portofino. Walked 2-1/2 miles there one day too!! I never felt as healthy as I did there, in my whole life! I could go on and on, but I think you get the picture."}, {"username": "John Layman", "comment_text": "The first two times my wife and I went with our church group (Catholic travel )After that we used the travel network out of Morgantown,WV. The agents name is Gary Wong.He is fantastic."}, {"username": "Melanie Matthews Stuprich", "comment_text": "Well the first time I was in Italy was when I moved to Naples at 21 with my husband (that was 20 years ago). I used a lot of rick Steve’s suggestions from his books for tourist stuff since the internet wasnt as robust as it is now and had to be tour guide to a lot of guests. I learned a lot from going around, getting lost (no gps back then), and just not being afraid to explore. We moved away to other countries and now live in Sicily for the last year and half. Now, I google the crap out of places I want to visit and read people’s recommendations\nand plan my trips around what interests us and what other people say."}, {"username": "Shelley Frise", "comment_text": "We are in Italy now and planned our own trip. I started by researching everything I wanted to do and see. Then I looked at the travel time between places and started taken things off the list that were not possible. We wanted to stay in each place 3 nights and I’m finding that is not enough in a 16 day trip. If I had to do it over again I would stay at least 5 days in Tuscany outside of Florence and visit either Sardinia or Sicily for a week. But we prefer quite vacations."}, {"username": "Ken Lerch", "comment_text": "Keep it simple. Don’t cram in too much. Absorb the experience rather than skipping through it. Balance seeing tourist destinations versus sitting in one place for an extended time. Pack light. Only drive if you are an experienced traveler, somewhere. Learn some language. Read a book about where you’re going. Set priorities based on a brutal self assessment of your interests and talent: food/art/\nchurches/\nshopping/\nromance/views/\nhistory/\narchitecture? Whatever major city you visit, stay at least 4 days."}, {"username": "Dana Talusani", "comment_text": "First of all, congrats on your amazing upcoming adventure! I think it's a good idea to prioritize the things you really have to see and then plan around that. There are some wise and lovely people here to help you when you have questions."}, {"username": "Michael Galan", "comment_text": "Heard where?"}, {"username": "Lucrezia Folger", "comment_text": "I'm not sure what you mean as I never experienced it nor heard of people having difficulty maneuvering in Italy. There are so many great ways to travel through the country and being in each city, walking is such a great option."}, {"username": "Matthew Gramitt", "comment_text": "This fall will be our 5th trip to Italy in 2 years. Here's what I would do for my first trip to Italy (and what I in fact did do for my first trip there) though I imagine that I'm probably in the minority:\n\nFirst of all, don't go in the summer or even the late spring or early fall. I would completely black out my vacation calendar from April 21th - September 21th. That still leaves you with 7 months! Unless you just feel that you *must* lay on the beach and get in the water. In which case I would try to avoid July and *for sure* avoid August.\n\nSecondly, and most importantly, don't go to any of the *major* tourist destinations! Venice, Rome, Cinque Terra, Florence, Pisa, Tuscan countryside, Amalfi Coast, and Lake Como. Or, go to just one and for just 1-2 days. The rest of the time should be spent at any number of places that are awesome, which is the vast majority of Italy! Almost everywhere in the country is a tourist destination, and that includes 100s of places that you've likely never heard of! Trust me on this, you will see amazing beauty and culture in other places which will fulfill you and make you feel as if you have had a full vacation while not having to navigate the hordes and compete for all the same services as so many others are also competing for. Not to mention that you will avoid so many of the places that just exist to get those tourism dollars and therefore aren't such an authentic aspect of Italy.\n\nIf you must go in the summer but you avoid the most touristy of tourist areas, you'll find that while others are on pages like this complaining about how busy it is, that you are having a grand time in places with a more manageable tourist population.\n\nThere are loads of places that are jaw-droppingly amazing, similar to the places that are jam-packed that you can go to. Really. You want Lake Como? Go to Lake Iseo (or Lake Garda or Lake Maggiore for busy but not as busy as Lake Como). You want Tuscany? Go to Umbria. You want Rome, go to Bologna. You won't be disappointed. And there's lots of other fantastic places to visit. 100s of places that if any of them were in the U.S. they would be the biggest tourist destinations in the country. But also just as old and special and beautiful as most of what you’ll see in those more famous places.\n\nLoads of us can give you ideas of where to go."}, {"username": "Starla Dawn", "comment_text": "First time last month did great."}, {"username": "Angela Mcnamara", "comment_text": "I did 4 days in Rome first, in February, I had a list of things to do and did them all without queues, rain or any problems. Secondly I did Venice, 4 days also, March this time, again did everything on the list, including Murano & Burano, lovely weather, no problems. The third visit was to Florence, featuring Pisa, 4 days, November, everything on list completed, 1 day of showers so that was the museum day, a third fantastic trip. We made no reservations, ate and drank where the locals did. My next trip will be longer, off peak season, based in Milan, trips to Verona, Bologna, Lake Como and maybe Cinque Terre. Research prior to your trip is essential and prebook your must do things directly with the sight. Enjoy! Such a magical, addictive country!"}, {"username": "Gillian O'Callaghan", "comment_text": "Just spent a month there solo and TBH found it very easy."}, {"username": "Patty Stadulis-Hagan", "comment_text": "Hire a travel advisor! Patty's Life Without Regrets Travel"}]}, {"id": "2204603686605376", "text": "Looking to rent a small private boat/yacht for a day on the Amalfi Coast in May 2024. There are only 4 of us, so it doesn’t have to be a large yacht- but we’d like a Captain and for a “luxury” experience as this will be a big splurge for us. Any experiences or recommendations welcome! 🛥️🍝🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2204603686605376/", "likes": 0, "comments": [{"username": "Caroline Roth Wahoff", "comment_text": "Amalfi Sails!!"}, {"username": "Andrea Arango", "comment_text": "This is who I used last year for 5 of us. The boats are more luxurious than the smaller ones but if that’s what you’re looking for it’s perfect! https://\nwww.magiaboats.c\nom/\n?gclid=Cj0KCQjwo\nK2mBhDzARIsADGb\njeoNgoP8infAUBt\nv9Cts6m2OTeXchm\n62jL8LtJvoMvouN\noOX5-f8qfAaAl37\nEALw_wcB"}]}, {"id": "2204609409938137", "text": "Has anyone used the Alillaguna boat from Cannaregio to Marco Polo Airport. Is it better to get a shared water taxi through GetYourGuide?", "link": "facebook.com/groups/1373361046396315/permalink/2204609409938137/", "likes": 0, "comments": [{"username": "Carlotta Crespi", "comment_text": "Alilaguna from Fondamente Nove is easy to take and much cheaper then a water taxi but you may have to wait and stand n a queue..."}]}, {"id": "2204629349936143", "text": "In 2024, I plan on taking my sons; 9 & 11.5 at that time to Italy with me. My ancestors are from Cosenza and have a hotel closer to Rogliano. I want to stay at for at least two nights. I would also like to do two nights in Rome and maybe a night in Pisa if not to far apart. I can skip Pisa this trip if it is to far out of the way.\n\nAny and all suggestions are welcome on places to stay, eat, visit.", "link": "facebook.com/groups/1373361046396315/permalink/2204629349936143/", "likes": 1, "comments": [{"username": "Alice Francesca", "comment_text": "Skip Pisa."}, {"username": "Gena Diaco Penland", "comment_text": "Skip Pisa and go to Florence! It was our favorite city!"}, {"username": "Miyuki Kanno Paul", "comment_text": "Are you driving then?\nSkip Pisa regardless and save it for the next time"}]}, {"id": "2204636593268752", "text": "We are heading to Sorrento from Rome in a few days. We want to visit Herculaneum and are wondering if we should do that along the way, or wait and do it as a day trip from Sorrento? We need to transfer in Naples (train arrives around noon) and are thinking of leaving our bags at the Naples train station (left luggage storage), spending a fewआणखी hours in Herculaneum, then collecting our bags and taking the last leg of the train to Sorrento. Or, do we wait and do a day trip from Sorrento? it appears we'd be backtracking if we wait and losing a day/time as well. Does anyone have experience with this? What advice can you share?", "link": "facebook.com/groups/1373361046396315/permalink/2204636593268752/", "likes": 0, "comments": [{"username": "Philip Curnow", "comment_text": "Day trip from Sorrento. Even half a day trip to be honest. Better Sorrento as you base than worrying about Naples."}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "look here https://\nwww.viator.com/\ntours/Naples/\nTransfer-from-Na\nples-to-Sorrent\no-with-2hrs-sto\np-at-Pompeii-or\n-Vice-Versa/\nd508-207013P13?p\nid=P00070587&mc\nid=42383&medium\n=link&medium_ve\nrsion=selector"}, {"username": "Miyuki Kanno Paul", "comment_text": "Settle in Sorrento first, then take Circumvesuviana\ntrain to ERCOLANO, the train station for Herculaneum. That’s how we always do when staying in Sorrento"}]}, {"id": "2204639086601836", "text": "How long did it take to get your VAT credit card refund if you purchased in Italy but flew out a different country?", "link": "facebook.com/groups/1373361046396315/permalink/2204639086601836/", "likes": 0, "comments": [{"username": "Huong Worley", "comment_text": "Max is a month, but about 3 weeks for me."}]}, {"id": "2204648549934223", "text": "Thoughts on Collette package tours or Premiere World Discovery Italy package tours ? On time schedule, clean air conditioned hotels and no cancellations is my most important things. TIA.", "link": "facebook.com/groups/1373361046396315/permalink/2204648549934223/", "likes": 1, "comments": [{"username": "Angela Marsala-Gaydos", "comment_text": "Ask them how much time you will be on a bus"}]}, {"id": "2204651093267302", "text": "Hi all. I am travelling from La Spezia to Cinque Terra by train. I’m wondering what town was your favourite? We def want to swim and see the beautiful space. I have two kids 10 and 13. Also if you know what train I take then that’s a bonus!", "link": "facebook.com/groups/1373361046396315/permalink/2204651093267302/", "likes": 1, "comments": [{"username": "Colleen Jennings", "comment_text": "I stayed in Sestri Levante in March - hotel Due Torri. 10 mins walk from the station. It’s right on a bay with beautiful clear water perfect for your kids to swim. Check out trains on trentitalia.it."}, {"username": "Corina Cristea", "comment_text": "Monteroso ( there is a beautiful beach)"}, {"username": "Kimberly Lampros", "comment_text": "Monterosso has a large, sandy beach for swimming. Riomaggiore also has a beach where you can swim but it's rocky."}, {"username": "Merilice Finateri", "comment_text": "We did the same in May.\nMontorosso"}, {"username": "Alice Francesca", "comment_text": "Sestri Levante, Rapallo ♡"}, {"username": "Ilaria Verda", "comment_text": "Levanto for sure"}, {"username": "Rebecca Yeoh", "comment_text": "Monterosso if going with kids, there are a couple of beaches within walking distance. Easy to get to via train from La Spezia."}, {"username": "Pao Magnoler", "comment_text": "Vernazza!"}, {"username": "Pao Magnoler", "comment_text": "You should go to portovenere too, you can go up to the church and have an amazing view!"}, {"username": "Pao Magnoler", "comment_text": "Pao Magnoler"}, {"username": "Autumn Watson", "comment_text": "Monterosso and Vernazza are great for swimming. Trenitalia app has all the tickets you need. Enjoy!"}]}, {"id": "2204659609933117", "text": "Hi\nI am trying to organize my tour to Italy for 3 weeks using train as basic transportation between cities, like to visit Amalfi coast Cinque Terra , Milan ,Rome ,Florence ,Venice,maybe Capri\nDon't know where to start\nAny ideas suggestions where to stay\nThanks 🙏", "link": "facebook.com/groups/1373361046396315/permalink/2204659609933117/", "likes": 2, "comments": [{"username": "Colleen Jennings", "comment_text": "Hi. I’ve been to all these areas on separate trips over the past 40 years.\nGetting round is very easy & trains are very efficient and cheap.\nDecide on an area & stay at least a few nights in each.\n\nI stayed 5 days in Sestri Levante in Cinque Terre end of March - hotel Due Torri. Flew in & out of Pisa & took the train. Trentitalia.it.\nYou can do Florence easily from here & suggest you add Lucca to your itinerary - it’s a beautiful walled city, I was there 2 weeks ago for a concert. Stayed at withinthewalls.\nit\nLook at staying in Oltrano in Florence.\nI’d do either cinque Terre or Amalfi Coast. Enjoy your trip. Italy is the most beautiful place."}, {"username": "Bev Madill", "comment_text": "Alla Marina in Riomaggiore, Cinque Terre, is fabulous, particularly their Atlantis apartment with balcony overlooking the sea. Best to book direct with them. I’ve also stayed in Venice in a great apartment managed by Truly Venice Apartments. Good luck and enjoy."}, {"username": "Rebecca Yeoh", "comment_text": "I just did a similar trip…Rome 4 nights > Positano 4 nights (day trip to Capri) > Florence 5 nights (day trip to Cinque Terre) > Lake Como 5 nights (day trip to Milan) > back to Rome 2 nights. We travelled only by trains. I would book through Trenitalia, highly recommend their speed trains. In Rome I would suggest staying in the Pantheon / Piazza Navona / Campo de’ Fiori areas. In Florence I’d suggest staying somewhere close to the train station/\nDuomo. Florence is a great to use as a base to see Tuscany and surrounds…being close to the station is very handy."}, {"username": "Rachael Richardson", "comment_text": "I booked my flights to Venice and back from Rome , I then worked my way down Italy and back to Rome , booked accommodation, then last booked trains\nVenice\nPisa\nFlorence\nSorrento\nVico Equense\nRome\nUsed booking .com"}, {"username": "Glenn Todd Webb", "comment_text": "First decide how many days and where you want to go. Then decide the order then look at trains."}, {"username": "Glenn Todd Webb", "comment_text": "I would suggest for all those fly into Rome, travel to Amalfi same day, Capri, return Rome, CT, Florence, Milan, Venice, fly home."}, {"username": "Lucrezia Folger", "comment_text": "Start where you fly into, then go in order of the direction of places you want to visit. Days I'd spend in no particular order since I don't know your flight schedule. Rome 5 days, Amalfi Coast 4 days, Cinque Terra 3 days , Milan 2 days, Florence 4 days ,Venice 3 days with a day trip to Borano."}, {"username": "Irina Goykhman", "comment_text": "Rima, we used the train. You can buy family pass for a week or longer, it’s better this way\n\nhttps://\nwww.trenitalia.c\nom/it/\nle_frecce/\nviaggia_da_roma_\naveneziaconlefr\necce.html"}]}, {"id": "2204659809933097", "text": "We're travelling to Italy in autumn (family of 5,planning to rent a car). Staying for 9 days(flights from Milan). We have these cities/towns on the list, but willing to do less as we know it won't be our last trip to Italy😁🇮🇹:Milan, Verona, Venice, Florence & Pisa.\nI would appreciate any suggestions regarding travelling by car in Italy. Our children are teenagers and we're used to walking a lot. Any tips for lovely places to visit in this area? Thank you all for your helpful comments 🌹", "link": "facebook.com/groups/1373361046396315/permalink/2204659809933097/", "likes": 0, "comments": [{"username": "Carlotta Crespi", "comment_text": "5 cities in 9 days will be tight.. you should consider doing just the North (Milan/Verona/\nVenice) or go to Florence and Pisa (and some more of tuscany while you are there)."}, {"username": "Jenny Payne", "comment_text": "Why not use the trains ? They are great? & no trouble to park 🌻"}, {"username": "Roland Trego", "comment_text": "Driving in central and northern Italy is not stressful or difficult. It's very much like driving in the U.S. or Canada. (The Amalfi Coast and Sicily are a completely different story!) Make sure you know what a ZTL is. If you enter one, you will end up getting a very expensive ticket in the mail several months later. Also, speed limits are not well marked in Italy. I use Waze for that. You can set it to alert you (with a noise) that you are exceeding the speed limit. Neither Google Maps nor Waze will tell you when you are actually entering a ZTL. Someone told me that the app ZTLradar will do that, but I haven't used it and cannot vouch for it. Do an online check for European traffic signs. (You'll need to take out the spaces in the links.)\nhttps: // www . autoeurope . co .uk/\ntravel-blog/\ndriving-in-italy\n-what-are-ztls-\nand-how-to-avoi\nd-them/\nIf you rent a car, ask the rental agency how to exit the city without encountering a ZTL. Also, before leaving the rental agency, 𝗮𝘀𝗸 𝘁𝗵𝗲 𝗿𝗲𝗻𝘁𝗮𝗹 𝗮𝗴𝗲𝗻𝘁 𝘁𝗼 𝗰𝗵𝗮𝗻𝗴𝗲 𝘁𝗵𝗲 𝗚𝗣𝗦 𝗮𝗻𝗱 𝗼𝘁𝗵𝗲𝗿 𝗻𝗲𝗰𝗲𝘀𝘀𝗮𝗿𝘆 𝗲𝗾𝘂𝗶𝗽𝗺𝗲𝗻𝘁 𝘁𝗼 𝗘𝗻𝗴𝗹𝗶𝘀𝗵 𝗹𝗮𝗻𝗴𝘂𝗮𝗴𝗲. The manual will only be in the country’s language.\nBy the way, I agree with the opinion that you’re trying to see too much for a nine-day period. Three destinations will be plenty. (And Lucca is a much more pleasant place to visit than Pisa.)\nhttps: // www . autoeurope . com/\ntravel-guides/\nitaly/\nitaly-road-signs\n/\n#:~:text=Parking\n%20spots%20in%2\n0Italy%20are,or\n%20mothers%20tr\naveling%20with%\n20infants/"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "About Pisa I wrote a post about with many tips (around the 12 July). Also there was a post about Pisa with many suggestions of places around it."}, {"username": "Miyuki Kanno Paul", "comment_text": "These cities are well connected with trains if you really want to stretch and do all. You don’t need a car for this. You won’t be able to enjoy each city much as you will be moving every two days or so. Every moving day will take a good 1/2 day of two nights. Think about it.\nIf you are flying out of Milano, save the last night there."}, {"username": "Clarissa Rava", "comment_text": "Don’t drive in Milan. I live there and parking and driving is just a full nightmare, let alone considering that it might rain because its autumn. For the other cities, i can’t tell"}]}, {"id": "2204660753266336", "text": "Good afternoon. Quick question. Is seeing the inside of the Colosseum worth it? We are only in Rome a short time and trying to figure out if we should spend the extra time to go inside to or just see it from the outside. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2204660753266336/", "likes": 44, "comments": [{"username": "Nakitha Badon", "comment_text": "I just did the outside cause of time constraints"}, {"username": "Sam Hammad", "comment_text": "It's like judging the book from the cover 🤔"}, {"username": "Irene Oda", "comment_text": "What do you mean by 'worth it'?"}, {"username": "Vikki Dahl", "comment_text": "Underground tour definitely worthwhile"}, {"username": "Joseph DellaFave", "comment_text": "It is just really a very run down old building in an old section of town. Not much to see."}, {"username": "Mugette Matos-Barber", "comment_text": "Try to get a tour so a guide can give you in depth narrative and help your imagination immerse yourself in it. If you are only walking around and looking into the hole where the arena used to be without a guide you won’t hear the gladiators and the crowds sheering and know the colors of the entrance where the emperor walked by. But if you only have limited time you will be in awe of the exterior just as well."}, {"username": "Lillian Giglia Maniscalco", "comment_text": "Yes we did it lastnight under the stars and was beautiful"}, {"username": "Allison Campbell", "comment_text": "I wAs there in June and we were thinking we would be happy with the outside but ended up doing a tour . So glad we did it was so interesting . Beware. Outside there is no shade. Was very hot the day we were there and prob hotter now . No shade outside . Enjoy ."}, {"username": "April May", "comment_text": "We had a night tour booked and then cancelled a few days before because no tickets were actually available apparently. We rescheduled for a short daytime tour and it was worth it to us. The inside is very interesting and different than I had imagined"}, {"username": "Martha Heller", "comment_text": "Not worth it no matter what time!! Find a nice little trattoria across the street and enjoy dinner and a bottle of vino while you watch the sun go down!!"}, {"username": "Shirley Randall Gottwald", "comment_text": "Down the road, I think you'd possibly regret not seeing the interior. I know I would."}, {"username": "Leila Jane", "comment_text": "To my mind in having taken the tour, you can just look at pictures or drone views of it as it just looks like a bunch of stones in person. I mean this not disrespectfully\n~ only my viewpoint since you said you have limited time. There is SO MUCH else to see in Rome!!!"}, {"username": "Angie Boutzis-Luis", "comment_text": "It’s impressive but if tight for time get a good look at the outside and spend time on other things. The Vatican, the fountains and many squares for sure."}, {"username": "Matt Maniaci", "comment_text": "The best advice I ever got was don’t think of this as your only trip to Italy, think of it as your first trip! The other best advice was don’t go with a checklist, see something you would like to see, get off the beaten path and have an espresso or glass of wine; watch the people - not tourists but the Italians. Enjoy the culture, eat in a cafe, shop for an impromptu picnic. It’s all worth it but remember that it’s about culture! And then plan to come back!"}, {"username": "Maggie B Rios", "comment_text": "Yes, book an early tour"}, {"username": "Stephanie Evans", "comment_text": "It was fine for me but would have been fine to skip it. I’m not a history buff though"}, {"username": "Trevor Ian Wright", "comment_text": "We went with Viator and I would recommend it it 100%"}, {"username": "Sue Ellen Thomas", "comment_text": "Get Rick Steves book….Rome. As I was reading to my family and friends.. people were leaving their tours to listen to what I was reading. Awesome book!"}, {"username": "Doug Burke", "comment_text": "I'd only stay outside if you're a gladiator that has a fight to the death coming up."}, {"username": "Hollis H McGuire", "comment_text": "Outside will do fine. Look at photos in books/Google. It’s a wonderful huge space but Rome is much more. 😘"}, {"username": "Claudine Auclair", "comment_text": "My brother was there recently and said the underground tour was amazing. However he was there for a few days. I think if your cruising and in town for the day only, find a your!"}, {"username": "Nancy Vahl Raske", "comment_text": "Most definitely! You can spend as much time there as you want!"}, {"username": "Jenn D'Antonio", "comment_text": "Yes!"}, {"username": "Kate O'Shea", "comment_text": "While I enjoyed the colosseum underground tour the true highlight for me was the Forum and walking along with Rick Steve’s audio tour."}, {"username": "Anthony Martini Jr.", "comment_text": "Are you kidding?!?!?!?!\n?!\nIt's absolutely worth it, do NOT miss the tour underneath that's not been open long, it's amazing!!"}, {"username": "Theresa Salerno Adams", "comment_text": "Trevi fountain a must"}, {"username": "Tam Wong", "comment_text": "Did anyone do the golf cart tour?"}, {"username": "Toni Colwell", "comment_text": "You could always do a night time underground tour. Completely different perspective than the daytime. Even if it’s in Italian, it’s very cool to see"}, {"username": "Sonia Dunstan", "comment_text": "Yes. Most definitely!"}, {"username": "Dustin Zick", "comment_text": "I think you can only answer that…Me personally, there was no way I wasn’t seeing the inside of the colosseum! But I love that era of history. I will say seeing it from the outside was freaking incredible. So much so I would probably still been satisfied if that’s all I saw. I would recommend seeing it both in the day and night. Spectacular both ways!!"}, {"username": "Renee Rogers Tarrant", "comment_text": "I would do the inside."}, {"username": "Valerie Arnsparger", "comment_text": "Living in Italy and I have had friends visit and have seen it many of times along with other tourist places in Rome, if you do decide to do it I would recommend the underground tour over any other tour of the Colosseum. By far the best one ever!"}, {"username": "Dann Hrusch", "comment_text": "If you buy tickets ahead of time from the official site it's a really short wait to get through security and then you can wander around, take some pics and be out quick. Can probably hit the inside in 30 mins total. The ticket is also good for the Roman Forum, which is right next door and you can do a similar quick tour in 30 mins. The Sistine Chapel is the biggest time eater, in my opinion, but also one of those things that is hard to pass up on."}, {"username": "Jenny Frank", "comment_text": "If u only have a short time would not make going inside the priority."}, {"username": "Shelly Stowell", "comment_text": "Not reallyz"}, {"username": "Gena Kona-Mancini", "comment_text": "YES and try to get to the underground!!"}, {"username": "Matthew Cawley", "comment_text": "Do a 1 day tour of Rome in a day. We had 2 days, 3 nights. Packed tourist stuff into 1 day to explore ourselves the next"}, {"username": "Blanca Gil", "comment_text": "Only you can answer that question."}, {"username": "Jamie Bly", "comment_text": "Driving by doesn’t do justice to walking through it. It really is amazing. Walks of Italy has a great tour of it the Roman forum, and palatine hill. Really well worth it if your into architecture and history."}, {"username": "Cass Pantalone", "comment_text": "Yes. It is very interesting and educational...n\naturally it depends on your tour guide."}, {"username": "Kathleen Roll", "comment_text": "If you can’t fit a tour in - just walk around it- take your photos and marvel in it. Then. Use it as an excuse to return 😂 the last thing you want to do it stress when in Italy 🇮🇹"}, {"username": "Linda Moon Hollingsworth", "comment_text": "Next Stop Italy offers a regular array of virtual tours…including\nthe Colosseum, if you decide to skip going inside.\n\nhttps://\nnextstop-italy.c\nom/\nvirtual-tours/"}, {"username": "Kathy Brophy", "comment_text": "I think it’s a once in a lifetime visit. We did a very informative tour. It’s incredible!!!"}, {"username": "Lucie Thibodeau Davis", "comment_text": "I spent the morning at the Colosseum. We did a guided tour of the Forum, Palastine Hill and finished at the Coloseeum. The lines ti buy a ticket were extremely long! So many people! If you don’t have much time, enjoy the outside and book a tour for inside at another time. The history & stories are really interesting."}, {"username": "Andrea Ferretti- Kearney", "comment_text": "we went inside. This was mainly for my kids and husband who had not been there before. If we were to go again I’d probably would not bother. My sister lives in Italy and said she would rather just do the Roman forum because there was itching in the colosseum, just lots of cats lol"}, {"username": "Becky Menacho", "comment_text": "If the history of it intrigues you, yes. If it doesn’t, an outside view is just fine."}, {"username": "Julie Norris", "comment_text": "Honestly it's nice if you can get there but I prefer the Forum 😀"}, {"username": "Kathleen Fiorini", "comment_text": "Take the tour, so worth it."}, {"username": "Jan Singleton", "comment_text": "Absolutely!!"}, {"username": "Jenny Kendrick", "comment_text": "Yes -we self toured made it quicker"}, {"username": "Naomie Appleby", "comment_text": "We didn't do a tour just went in walked around, my husband tagged onto a tour for abit then wandered around himself while i took the kids (i wasn't interested in the history just the building)but just depends if your interested in the history"}, {"username": "Stacy Oberman Malinow", "comment_text": "1000% yes. We were just there and I wasn't too excited to see the colosseum but LOVED it. So interesting."}, {"username": "Vickie Sneed", "comment_text": "Absolutely 💯 %. It’s All the Words."}, {"username": "Doreen Evans Nicholas", "comment_text": "Go in! It’s breathtaking!"}, {"username": "Dayna Davis Castle", "comment_text": "Yes!!"}, {"username": "Shelly Ann", "comment_text": "See it inside!"}, {"username": "Susan B. Corino", "comment_text": "Yes"}, {"username": "Jill Tingley", "comment_text": "I’d take tour on u tube if dont have time"}, {"username": "Ann Brahmani Bost", "comment_text": "I found the inside of the Colosseum breathtaking."}, {"username": "Leanne Dawn Sutton", "comment_text": "Yes go in!!"}, {"username": "Jim Kelleher", "comment_text": "If you have limited time then by definition you can’t see everything, and you should skip the interior of the Colloseo."}, {"username": "Nicole Gouzoules Sheehan", "comment_text": "We did an excellent City Wonders tour booked through Viator. Paula was an amazing guide!"}, {"username": "Lisa Valdovinos", "comment_text": "Loved it!"}, {"username": "Viviann Cardenas", "comment_text": "Forgot to book in advance. Booked 4 days before arriving to Rome, and only available time was after 5pm. Schedule for 5:10. No lines. Maybe you can do Colosseum at 5 and roman forum at 6 (last entry 6:15)"}, {"username": "Daneda Russ", "comment_text": "Inside visit is worth it! We got underground access tickets but not a guided tour. There was an app-enabled audio guide included with our tickets which was pretty easy to download once we were in the waiting point for our time to start. Our only regret was that we had access to the Forum/Palatine Hill with our tickets but didn’t leave enough time (or energy) to do it properly after our 16:00 visit to the Colosseum (Forum closed at 19:30)."}, {"username": "Randi Beasley", "comment_text": "Absolutely but take a tour for best experience"}, {"username": "Jenny Payne", "comment_text": "Do a night tour , well worth it and use the day for something else 🌻"}, {"username": "Helen Louise", "comment_text": "For me, absolutely. IMO it gives the whole thing context"}, {"username": "JoJo Sisto", "comment_text": "We are in the same boat with limited time and so much to see so we scheduled the golf cart tour to see most of it all and then scheduled some tours of things that are a must 🙂"}, {"username": "Meredith Sclafani Lacerda", "comment_text": "We did a tour inside with a guide, and it was the most magical thing we did while in Rome. Also, my family is a family of history teacher, so it was a must on our to do list."}, {"username": "Patty Patraca", "comment_text": "Do that, May be not foro but coliseo yes"}, {"username": "Krissy Dascoli-Meehan", "comment_text": "If you have a short time, skip inside"}, {"username": "Paige Montecalvo", "comment_text": "We did a guided tour which was 45 mins guided, 45 mins to explore on your own, which was perfect! I really wanted to see the Colosseum floor but we found zero tours about 8 days out from our visit (I checked 100 different options 😩) Just be sure to book well in advance."}, {"username": "Vonda Gaylor McGill", "comment_text": "Can y’all give some insight on all the different tours offered? The floor, underground etc."}, {"username": "Lushan Yao", "comment_text": "I would skip the inside if time is limited. For me, the outside was more impressive, and there’s so much to see in Rome that requires no entrance tickets. Rome is magnificent!"}, {"username": "Veronica O'Neill", "comment_text": "How many days should I stay in Rome.Sounds wonderful.Want to see what I can and need to plan my trip in advance.Travell\ning in May"}, {"username": "Sarah Hartley", "comment_text": "If you haven’t got long, I’d say skip it! Seeing the outside of it would be sufficient"}, {"username": "Kathleen Roll", "comment_text": "I loved the guided tours with the underground due to the way they bring the place to life.\nIt is amazing"}, {"username": "Christa van der Merwe", "comment_text": "I understand your problem, time. If you go in with a tourguide they make you experience what it was like where you're standing. They are so enthusiastic about the period and the use of the Collusium, that you picture everything they describe. It was a flippen hot 41 degrees day, but very special.\nYou will have to make the difficult decision yourself.\nBut if you skip the tour, you wont know what you missed and that's also an option."}, {"username": "Tari Lawson", "comment_text": "I think the inside is worth it. If you skip it, what else will you be able to see? That information could make all the difference."}, {"username": "Norma Lee Chartoff", "comment_text": "stick to the outside if only a short visit. Too many other great things to see just walking around."}, {"username": "Ri Nata", "comment_text": "Io vivo a Roma, e non ho mai visitato l'interno del Colosseo :)"}, {"username": "Beth Spiehler Selvia", "comment_text": "We only walked around the outside and I’m so sorry. Next time I will see the inside. It’s just personal preference really."}, {"username": "John Rudy Valentino", "comment_text": "The history inside the coliseum is monumental. The thousands of gladiators an chariot races.etc....ho\npe I get in"}, {"username": "Cheryl Swiatko", "comment_text": "We did a tour at 9:30 at night and it was totally awesome!! Best thing that we did while in Rome!!"}, {"username": "Chris N Jen Mercado", "comment_text": "Yes! It was amazing!"}, {"username": "Gillian O'Callaghan", "comment_text": "I was very very content to view it from the outside. Childhood dream fulfilled 😍"}, {"username": "Rebekah Lister", "comment_text": "Yes‼️"}, {"username": "Antoinette Schultz Vogt", "comment_text": "Pamela Schnepp Christopher Vogt"}, {"username": "Rachael Richardson", "comment_text": "I went to the inside , it’s good but don’t beat yourself up if you can’t go in ! It’s a beautiful building"}, {"username": "Heather Sechrist", "comment_text": "There are some cool things about the inside but unless you do a guided tour you may never pick up on. However guided tour means more time commitment. I feel that you could do maybe a free online guide through tue forums and outside and understand enough about the history.\n\nI would rather see the pantheon anyway."}, {"username": "Sharon Tee", "comment_text": "I loved the inside of the Colosseum & didn’t do a guide tour. There are plenty of information plaques inside that tell you lots of historical facts"}, {"username": "Stacey Cohen Sturner", "comment_text": "Yes! For us it was. *Just* finished a private Colosseum tour an hour ago and very much enjoyed our guide's stories. Also helped us skip the loooooong lines."}, {"username": "Lloyd Davies", "comment_text": "City Wonders. We did the underground tour. Very limited availability but so good. City Wonders were excellent. We did multiple tours with them. Cancellations with immediate refunds. Any issue - refunds."}, {"username": "Paula DiCicco", "comment_text": "I agree - inside is worth it. We did a group tour and was good but 2 1/2 hours. Lots of interesting info. It was a VERY hot day and out in sun a fair bit. I would try to book as early as possible in the am to beat hottest part of day."}, {"username": "Janet Messanelli Bozzone", "comment_text": "If you don’t want to do a tour, download Rick Steves’ free audio tour and guide yourself around."}, {"username": "Nancy Bonacchi Fritcher", "comment_text": "Yes. I understood the size and scope much more after walking around inside."}, {"username": "Kelly Rae Snider", "comment_text": "I’ll go against the grain. The inside is wonderful BUT with a short availability I think you can see the outside and be happy and continue on your way. The outside has several stunning spots that really captivate the imagination and give you the feel of how grand it is.\n\nI think if you map out alllll the things you want to see and find yourself without enough time, you’ll be perfectly happy to chop the interior of the Colosseum"}]}, {"id": "2204664293265982", "text": "Im planning to visit Italy on 15 sep for one week and I would like to ask for the expected weather will be fine or it will start to be cold specially in como and lugano\n\nanother questions about trip master application i need you reviews about that one ?", "link": "facebook.com/groups/1373361046396315/permalink/2204664293265982/", "likes": 2, "comments": []}, {"id": "2204664813265930", "text": "Hello everyone! Your posts are so useful, so thank you! 🙏\nPlease can someone recommend where to buy reliable Colosseum, Roman forum and Palatone hill tickets? No need for guided tour, nor anything fancy VIP. There are hundrends of options with some questionable reviews so I am lost! I don't know which to trust. We are going in October. Thank you so much for any help! 😊🙌", "link": "facebook.com/groups/1373361046396315/permalink/2204664813265930/", "likes": 1, "comments": [{"username": "Emma Kay", "comment_text": "Just Google official website and you will be fine. Don't buy tickets through a third party site. official sites only."}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nColosseum-and-An\ncient-City-Tour\n/\nd511-109384P1?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "Nicole Gouzoules Sheehan", "comment_text": "Viator site!!!"}]}, {"id": "2204668179932260", "text": "Our Wine from Poggio Sorbello, Cortona & Olive Oil arrived today🍷🍷thank you Christina", "link": "facebook.com/groups/1373361046396315/permalink/2204668179932260/", "likes": 1, "comments": []}, {"id": "2204669133265498", "text": "Will be in Florence in 9 days , spending 4 days there should I venture to Cinque Terre for the day?? Will spend another two days in Siena before returning to Lisbon . Grazie", "link": "facebook.com/groups/1373361046396315/permalink/2204669133265498/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Florence/\nCinque-Terre-Hik\ning-Day-Trip-fr\nom-Florence/\nd519-5070CINQUE?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}, {"username": "Pao Magnoler", "comment_text": "No for one day trip. For 5 Terre at leats 2 days if you want to really dig in the 5 Terre."}, {"username": "Pao Magnoler", "comment_text": "Siena you can do it in one day. I will do 2 days in cinque Terre and 1 day in Siena."}]}, {"id": "2204669619932116", "text": "I am arriving in Rome, heading to Perugia for a couple of days then trying to decide where to go from there before leaving back out of Rome. I've already done Florence, Milan, Civita de Bagnoregio, Siena, Any suggestions?", "link": "facebook.com/groups/1373361046396315/permalink/2204669619932116/", "likes": 0, "comments": [{"username": "Philip Curnow", "comment_text": "Assisi, as you're so close. Montepulciano. Fish lunch by Lake Trasimeno. Spello."}]}, {"id": "2204670636598681", "text": "Wondering about credit cards. How recognizable and accepting are cibc visa or td credit cards", "link": "facebook.com/groups/1373361046396315/permalink/2204670636598681/", "likes": 0, "comments": []}, {"id": "2204671176598627", "text": "Is it easy to get a train from Sorrento to Pompeii and book a tour there? Our hotel has an excursion with the tour, lunch etc but wasn’t sure which way to go.", "link": "facebook.com/groups/1373361046396315/permalink/2204671176598627/", "likes": 0, "comments": []}, {"id": "2204673483265063", "text": "*Lake Como to Bellagio ferry question*\n\nIn mid September, I’m traveling via train from Zurich to Como S. Giovanni train station and was planning to either walk or hop into a taxi to get to the hydrofoil/fast ferry to Bellagio. I understand that these tickets are only sold the day of travel. Has anyone experienced difficulties with getting ferryआणखी tickets during this time of year? Are lines extremely long as they are during the peak summer months? Would you recommend that I just take a taxi from Como S. Giovanni train station instead? I will have luggage and there is 2 of us total traveling.\n\nThanks for your help and insight.", "link": "facebook.com/groups/1373361046396315/permalink/2204673483265063/", "likes": 0, "comments": [{"username": "Glenn Todd Webb", "comment_text": "You have about 5-7 blocks from train station to pier. Lots of cobblestones. We walked much further when we parked to hotel with our carry on. It’s not too bad. But I would do taxi."}, {"username": "Francesca Giovanelli", "comment_text": "You can walk or catch a taxi to Como Lago, and then catch a ferry or a bus to Bellagio"}]}, {"id": "2204679349931143", "text": "Hi I'm traveling tomorrow morning to Milan my daughter and I, we haven't booked any accommodation we there for 2days flying out Thursday evening, some tips and ideas, one more is there mosquitoes please", "link": "facebook.com/groups/1373361046396315/permalink/2204679349931143/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.tkqlhce.com/\nclick-100692842-\n12291623?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.it\n%2FHotel_Review\n-g187849-d61996\n6-Reviews-Nhow_\nMilano-Milan_Lo\nmbardy.html%3Fs\npAttributionTok\nen%3DMjE3NzQ1Mj\nE"}, {"username": "Karen Blackmore", "comment_text": "Yes, there are mosquitos. Not hundreds but we all got a few bites."}, {"username": "Miyuki Kanno Paul", "comment_text": "Mosquitoes are active even in October in Milano😱. They kept us up pretty much all night😱😱"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2204675379931540", "text": "Hello!! My husband and I will be staying at San gimignano and we will be getting there from Rome. What is the best way to get there from Rome? Any insight is appreciated. Also, is it easy to get to Florence from San Gimignano? Thanks! This is our first time traveling to Italy! We are very excited!", "link": "facebook.com/groups/1373361046396315/permalink/2204675379931540/", "likes": 1, "comments": [{"username": "Alice Francesca", "comment_text": "No train station in San Gimignano.\nI would take the train from Florence to Siena (spend a couple of hours there, piazza del campo and the duomo) then rent a car and drive to San Gimignano."}, {"username": "Dr-Jon Warnecke", "comment_text": "There may be a train from Rome to Cortona or Orvieto, where you could get a connection to Siena. Then, take a local bus, or hire a driver for the 30 minutes trip to San Gimignano."}, {"username": "Darryl Rasch", "comment_text": "We had originally planned to take train to Florence from Rome, then bus/taxi to SG, but then rather decided to pick up our rental car in Rome. We will stop off at Saturnia Springs prior to arriving in SG, soaking in the scenery along the way. After a week in SG and 3 days in Venice we’ll return our rental car in Venice before proceeding on.\nDriving will add to our adventure each time we take a wrong turn😎"}, {"username": "Graham Sherlock", "comment_text": "The closest train station to San Gimignano is Poggibonsi, from there you can take a bus to San Gimignano, the buses are just outside the train station."}, {"username": "Tiffany Cinquepalmi", "comment_text": "Thank you for all the input! We have never been there so we don’t know the geography and what goes where. I appreciate it!"}]}, {"id": "2204689569930121", "text": "Also what are some recommend wineries in the Chianti region?", "link": "facebook.com/groups/1373361046396315/permalink/2204689569930121/", "likes": 1, "comments": [{"username": "Stefano Follador", "comment_text": "As a wine producer I suggest you to download FIVI app.\nYou’ll have a lot of small producers that are usually more interesting than big company."}, {"username": "Lainie Bennett", "comment_text": "Help us help you: do you like a lighter or heavier style of red wine? Are you looking for a tasting, tour and lunch or just a quick tasting. Do you have a driver or are you driving yourself and will you you stay in Florence or the countryside?"}, {"username": "Deborah Larsen", "comment_text": "Be sure to make reservations for wine tasting, most of the below named wineries are small family producers and we know them personally. Showing up without a reservation, you may be politely turned away, waisting your precious vacation time. In Italy it would be like showing up to someones home without calling first. Enjoy your time in Tuscany."}, {"username": "Angela Abbate Karklin", "comment_text": "Montemorli - they are a small family owned winery - they’re amazing"}, {"username": "Frank Pallante", "comment_text": "F"}, {"username": "Lisa Talarico", "comment_text": "Badia a Coltibuono, Selvapiana, Poggerino, San Quirico."}, {"username": "Evelyn Trager Jose", "comment_text": "Villa Travignoli https://\nwww.travignoli.c\nom/\nWe had a lovely tour and tasting. The winery is celebrating 550 years this year!"}]}, {"id": "2204694299929648", "text": "Can anyone suggest a food tour and a wine tour close to Rome? 6 of us are foodies and will be there in September after a cruise from Athens. Thanks!!", "link": "facebook.com/groups/1373361046396315/permalink/2204694299929648/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nWine-Tasting-in-\nFrascati-from-R\nome/\nd511-32639P16?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}]}, {"id": "2204695409929537", "text": "Hello! I need help finding two tours:\n\n1. day trip from Verona to Lake Garda;\n\n2. day trip from Venice to a vineyard", "link": "facebook.com/groups/1373361046396315/permalink/2204695409929537/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Verona/\nday-Trip-from-Ve\nrona-to-Lake-Ga\nrda/\nd945-171920P12?p\nid=P00070587&mc\nid=42383&medium\n=link&medium_ve\nrsion=selector"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Venice/\nThe-Prosecco-hil\nls-guided-tour-\nwith-wine-tasti\nng-and-lunch/\nd522-352382P1?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}]}, {"id": "2204706539928424", "text": "Can you pick up a taxi east at the train stations to take you to hotels or best to order them beforehand? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2204706539928424/", "likes": 3, "comments": [{"username": "Colleen Jennings", "comment_text": "Large cities have taxi ranks outside the stations. Smaller places have a number to call on a post outside the station. I’ve never prebooked just queued but tge line moves quickly, depending on the city."}]}, {"id": "2204713563261055", "text": "Hello mates going to Italy this month and i want to explore more cities any recommendations??\nMy journey will start from Reggio Calabria!\nThanks in advance", "link": "facebook.com/groups/1373361046396315/permalink/2204713563261055/", "likes": 0, "comments": [{"username": "Alice Francesca", "comment_text": "Get out of Reggio Calabria as fast as you can;)"}, {"username": "Mario Rossi", "comment_text": "if you have a car, near Reggio Calabria i recommend these beautiful places: Scilla (20 min from there), Tropea, Capo Vaticano."}]}, {"id": "2204716333260778", "text": "Does anyone have any insight on the wildfires in Sicily currently?", "link": "facebook.com/groups/1373361046396315/permalink/2204716333260778/", "likes": 0, "comments": []}, {"id": "2204718723260539", "text": "We are a family of 4 spending 5 weeks. We will be staying in Campobasso for a few days as it is where my husband’s heritage is. Any must do/see places? We would also like to find some information on the family, particularly his Grandfather who owned several buildings (including the theatre) in the area. As both of my in-laws have passed away, the family history went with them as it was never spoken about. Contact was lost when they immigrated to Australia.", "link": "facebook.com/groups/1373361046396315/permalink/2204718723260539/", "likes": 0, "comments": [{"username": "Alice Francesca", "comment_text": "Hi! You should ask both the house of the mayor (il Comune) and the local Church as at every wedding both the groom and bridge had to sign, churches keep track of weddings for decades, sometimes centuries.\nAlso, the local cemetery"}, {"username": "Alice Francesca", "comment_text": "https://\nwww.italia.it/\nen/molise/\ncampobasso"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Try churches and city council. Try to make an appointment with the anagrafe office before arriving, then with some names and possibly addresses you can go to the right church and check with the priest the registries.\nSearch in family papers all useful informations (all names, addresses, dates you can find).\nNear Campobasso there is the Castello Angioino di Civita Campomarano which should be quite beautiful.\nHere some things to do there https://\nviaggi.corriere.\nit/en/europa/\nitalia/\ncampobasso/"}, {"username": "Maria Musumeci", "comment_text": "There is lots to see & do in Campobasso. It's a very beautiful area. Just google search top 10 things to do and see & it looks amazing!!\nYou'll be right in the middle of Italy to either visit the Amalfi Coast or the Puglia Region too. If you can get yourself to Matera, it's spectacular!\nAs the others have said above check with churchs & cemeteries\nIf your search doesn't find anything then there's a guy on FB called \"007 Italian Records\". He helps find Italian ancestors for a small fee. You could ask him if he could help. He has the most interesting stories of how he's tracked down info.\nBut I do feel the local church, local council or cemetery could help. Even talking to the locals helps too. It's amazing how they all know one another, or someone knows someone who knows someone that can help 😉"}]}, {"id": "2204719166593828", "text": "Superbe voyage, Livourne en Toscane, Pompei et Rome.\nNous avons visité les ruines à Pompei et le Vésuve, wow, nous avons adoré! Avec de bons souliers par contre...\nRome, on a visité le musée du Vatican,आणखी chapelle Sixtine, basilique St-Pierre. Beaucoup de monde comme toujours j'imagine, mais intéressant.\nVu le panthéon, la Fontaine de Trevi et le Colisée, de toute beauté!\n\nNous avions réservé à Rome, air b and b, Lo studio di michelangelo, propre tranquille et chaleureux! Un coup de coeur...", "link": "facebook.com/groups/1373361046396315/permalink/2204719166593828/", "likes": 3, "comments": [{"username": "Sarah Gosselin", "comment_text": "Bonjour, question pour vous concernant Pompéi! :) Avez-vous réservé votre billet à l'avance ou est-il possible de l'acheter directement sur place, sans attendre des heures en file? Et puis, avez-vous monté le Vésuve la même journée que vous avez visité les ruines de Pompéi, si oui ce n'était pas trop fatigant? Merci! 😁"}, {"username": "Julie Desjardins David Goldfinch", "comment_text": "Bonjour,\nSi je me trompe pas, tu pouvais acheter les billets sur place ( j'ai entendu dire que c'était moins cher en plus)...Nous, il était environ 10h00 le matin, il n'avait pas beaucoup de monde... Et je vous dirais que ça oris environ 2h30 pour faire le tour avec le guide.\nPour le Vésuve, nous aussi on croyait être trop fatigué pour le faire mais le bus nous a monté vraiment haut. Alors ça été 1h30 à pied, aller-retour et le chemin est vraiment facile, pas vraimente escarpé! La vue est tellement belle, ça vaut la peine...\nLe plus dure pour moi, était l' autobus, j'ai des vertiges et il y a des ravins sur le bord du chemin...sinon c'est de toute beauté!"}]}, {"id": "2204723316593413", "text": "Best place to eat in Rome near Pantheon, and when do I need to make reservations?", "link": "facebook.com/groups/1373361046396315/permalink/2204723316593413/", "likes": 1, "comments": [{"username": "Vivien Paulik", "comment_text": "Do not eat in toursity restaurants. And for an average resturant do not need reservation"}, {"username": "Tara Roed", "comment_text": "5-10 minute walk to roscioli. They take reservations and will take you right away. https://\nwww.salumeriaros\ncioli.com/"}, {"username": "Elena Innocenti", "comment_text": "Fattoincasa is 10min walking distance in Via del Governo Vecchio. No need reservation. Good food."}]}, {"id": "2204728813259530", "text": "Best place to buy a hair straightener near the trevi fountain?", "link": "facebook.com/groups/1373361046396315/permalink/2204728813259530/", "likes": 2, "comments": [{"username": "Jamie Medeiros", "comment_text": "There should be a Sephora close to there."}, {"username": "Dianne Rios", "comment_text": "Pharmacies have them. You just gotta ask"}, {"username": "Kylie Azzopardi", "comment_text": "If you go to Termini train station there is a shop that sells hair styling tools and hair care items 🙂"}, {"username": "Jessica Stewart", "comment_text": "Did you find one and how much did it cost if you did?"}, {"username": "Emily O'Donnell", "comment_text": "I left mine in Florence 3 weeks ago 🥹 probably long gone by now!"}, {"username": "Sam Passante", "comment_text": "A double Campari and orange will straighten your hair out"}, {"username": "Billie-Jean Janaway", "comment_text": "Honestly I wouldn’t bother … the humidity"}, {"username": "Teresa Zagari", "comment_text": "Sephora"}]}, {"id": "2204731079925970", "text": "Have a 3 week trip planned in September. Most of the trip is planned out. Big decision.... travel to Lake Como and Milan or fly from Venice and spend those 3 days in Sardinia? Recommendations and why? Thanks in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2204731079925970/", "likes": 0, "comments": [{"username": "Alice Francesca", "comment_text": "Sardinia, for sure.fly to Olbia and stay in Marinella. Explore the nearby beaches: Cala Moresca, Spiaggia del Principe, Liscia Ruja , Rena Bianca.\nGreat place for aperitivo:San Pantaleo, up on the hills"}]}, {"id": "2204733716592373", "text": "I will need to get from Siena to Rome in October. Was going to just take the train, but now thinking of getting a driver instead. It might be nice to stop in Pienza or elsewhere on the way. Any recs on who to use?", "link": "facebook.com/groups/1373361046396315/permalink/2204733716592373/", "likes": 1, "comments": [{"username": "Alice Francesca", "comment_text": "Stop in Pienza, Chiostro di Pienza is the place to be;)"}]}, {"id": "2204738486591896", "text": "Hi\nTravelling to Italy with my son for the firstvtime, booked my tours for Rome but no train tickets from there to Cinque Terre- Florence- Venice- Milan yet . Stay ing in those places for 3 nights two days. Should I start panicking and book them now. Heading out of Rome on 26 of August.", "link": "facebook.com/groups/1373361046396315/permalink/2204738486591896/", "likes": 4, "comments": [{"username": "Rachel Gray", "comment_text": "Wait to book them until the day of. You doing want to rush around to beat a train schedule. There’s trains that run almost hourly that you can schedule once you make it to the train station."}, {"username": "Maria Marra", "comment_text": "Pre book"}, {"username": "Nadia Nadia", "comment_text": "Any thoughts on booking art galleries or one say tours beforehand?"}, {"username": "Ray Kelley", "comment_text": "You will be fine I went last year and I didn't pre book anything but hotels .the only problem I had was being late to the hotel and they\nCanceled the 4 days I had already paid for but it turnend out I found a room at the top of the Spanish steps a beautiful room little more money but worth every penny."}, {"username": "Karen Blackmore", "comment_text": "The fast trains get more expensive the nearer the time. So depends if you would rather have flexibility or cheaper prices."}, {"username": "Karen Schmidt", "comment_text": "It depends if you care to save money. More expensive as the day gets closer. I always prebook…but I’m a schedule sort of traveller lol"}, {"username": "Diana Granado", "comment_text": "No panicking! Just use trainline.com ! That would be it"}, {"username": "Alexandra A Welker", "comment_text": "Pre book so you don't have anything to worry about when you arrive."}, {"username": "Katie Hooker Thomas", "comment_text": "There’s a fast train from tone to Florence that only takes 1h 20m or so FYI."}, {"username": "Jennifer Gustafson", "comment_text": "I purchased my train tickets ahead of time, and it was nice. They were taken care of, and I didn’t have to validate."}]}, {"id": "2204741186591626", "text": "Has anyone been to the Vino al Vino festival in Panzano? I'm looking for info and it's a little bit hard to find.", "link": "facebook.com/groups/1373361046396315/permalink/2204741186591626/", "likes": 0, "comments": [{"username": "Philip Curnow", "comment_text": "'Vino al Vino - Unione Viticoltori Panzano' - Facebook page"}]}, {"id": "2204738623258549", "text": "Doing a night tour of Colosseum. Do I need a tour for Palatune Hill and Roman Forum or can I walk around and read digns in English to know what I'm seeing?", "link": "facebook.com/groups/1373361046396315/permalink/2204738623258549/", "likes": 0, "comments": [{"username": "Nydia Bryan", "comment_text": "The night tour only lets you see the underground portion of the colosseum and does not include entrance to palatine hill or roman forum. You’d need a separate tickets to view the other areas of the colosseum, palatine hill and roman forum.\nYou can always look for self guided audio tours you can download"}]}, {"id": "2204742426591502", "text": "Ciao everyone! Any recommendations re: Day Trips to Procida/Ischia from Naples or Sorrento? Looking for a group boat tour and unfortunately Viator only offers on Fridays, which do not work with my itinerary. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2204742426591502/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Naples/\nBoat-tour-to-Isc\nhia-and-Procida\n-from-Naples/\nd508-51921P61?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Naples/\nIschia-and-Proci\nda-Experience-b\ny-boat-departin\ng-from-Naples/\nd508-64324P70?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}]}, {"id": "2204744486591296", "text": "I was interested in maybe buying a LV bag in Italy. We will be in Italy 3 days pre cruise then on a Med cruise. How would I file/get the VAT tax back if we are flying back home from Barcelona? Thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2204744486591296/", "likes": 0, "comments": [{"username": "Colleen Jennings", "comment_text": "As the shop where you buy your bag for the paperwork. They’ll want to see your passport. There are machines at airports where you key in the code & the tax is paid into your bank. Did this in Italy so presume it’s the same in other European countries."}, {"username": "Miyuki Kanno Paul", "comment_text": "Barcelona will be the last stop in EU, so you file there. You can buy LV bag in Barcelona, too, by the way😉"}]}, {"id": "2204747683257643", "text": "Hello Italy travelers and citizens! We are headed to Calabria (Briatico near Tropea) at the beginning of September for 9 days. Our rental home is right on the coast. We plan to schedule some day trips from this home base. Has anyone explored Calabria and have must-see suggestions for us? One of our day trips will be to Nicastro near Lamezia Terme to see where my grandfather was from, and we will probably schedule an all-day Aeolian Island boat excursion. We will have rental cars.", "link": "facebook.com/groups/1373361046396315/permalink/2204747683257643/", "likes": 1, "comments": [{"username": "Alice Francesca", "comment_text": "I am Italian and I have been to Calabria.Sorry but once was enough for me.The lack of services, the garbage bags right up to the beach, the cigarette butts on the beach along with plastic bottles left anywhere, dozens of poor lost dogs dying from the heat in the streets without anyone helping.\nNo, sorry but you could have picked a much better option.\nSome parts of Italy are just like the third world and many Italians like me avoid them at all cost.\nDid not mean to be rude, just being honest from my personal experience.\nAh! My credit card got cloned in Tropea on the very first day"}]}, {"id": "2204748026590942", "text": "I know there have been posts about places to stay and I have explored a lot of options. Some are not available and some are super expensive.\nWe have 2 elderly and a teenager in our party. Hoping to find a central hotel in Florence walking distance to main sites. Same for Monterosso ideally a hotel and lastly Bellagio (on the lake), Lake Como.\n\nPool and GYM will be great. AC is a must.\nTIA", "link": "facebook.com/groups/1373361046396315/permalink/2204748026590942/", "likes": 1, "comments": [{"username": "Colleen Jennings", "comment_text": "Look in Oltrano - it’s across the Ponte Vecchio walking away from the Uffizzi."}, {"username": "Alice Francesca", "comment_text": "Please write WHEN you will be going"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Florence https://\nwww.jdoqocy.com/\nclick-100692842-\n12291623?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.it\n%2FHotel_Review\n-g187895-d20297\n3-Reviews-Hotel\n_Croce_di_Malta\n-Florence_Tusca\nny.html%3FspAtt\nributionToken%3\nDMTc1MTg2NzE"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Monterosso https://\nwww.tkqlhce.com/\nclick-100692842-\n12291623?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.it\n%2FHotel_Review\n-g187820-d17841\n14-Reviews-Albe\nrgo_al_Carugio-\nMonterosso_al_M\nare_Cinque_Terr\ne_Italian_Rivie\nra_Liguria.html"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Bellagio https://\nwww.anrdoezrs.ne\nt/\nclick-100692842-\n12291623?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.it\n%2FHotel_Review\n-g187834-d19775\n5-Reviews-Grand\n_Hotel_Villa_Se\nrbelloni-Bellag\nio_Lake_Como_Lo\nmbardy.html"}, {"username": "Miyuki Kanno Paul", "comment_text": "What month of the year are you going? How many of you in your party total? More than likely you will need 2-3 rooms per hotel"}, {"username": "Shalu Ramchandani", "comment_text": "Sorry didn’t include dates. Florence is August 17-20\nCinque Terre 20-23\nLake Como 23-25\nAny recommendations\nappreciated"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Pool and gym in middle August in central Florence and Como will be SOOO expensive, In Monterosso I don't even think it exists something. Check for an apartment on airbnb, for 5 people it will be the best solution, check reviews for the AC (even if now actually is not that hot, especially at night)."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2204748753257536", "text": "I need suggestions on car rental options. There are 6 in our group and I cannot find any rental companies that have suv such as a Tahoe. Chevy traverse or the like. Staying in sorrento and want to drive to Tuscany", "link": "facebook.com/groups/1373361046396315/permalink/2204748753257536/", "likes": 4, "comments": [{"username": "Bonnie Brauner", "comment_text": "I was able to find, at a price, large automatic suvs/mini-vans on the Costco website"}, {"username": "Carmela Siniscalchi Frattellone", "comment_text": "Although their may not be suv. I rented an compact car and got this. I believe it was a Lynks. It fit 5 comfortable and automotive. I def did not need or want it but apparently it was the only automatic left. You may get lucky"}, {"username": "Ruth Mattingly", "comment_text": "A large SUV or van would be difficult to drive there — at least I would not. You would be better off in two cars. The roads are more narrow, as are entrances/\nexits for parking garages. It can be stressful enough in a smaller car. I like to rent the Fiat Tipo, which seats 5 people, but only if they only have carry on luggage."}, {"username": "Ray Kelley", "comment_text": "I don't know if you will be able to find any thing like that and if you do get the insurance ! Your probably going to need it"}, {"username": "Jen Ashley", "comment_text": "Probably cheaper to rent two small cars"}, {"username": "Jaci Rummel", "comment_text": "LocAuto is who I used. Make sure you have an International Driver’s Permit. Get it at any AAA dealer."}, {"username": "John Wilson", "comment_text": "Have you considered Europe’s extensive public transit system? There are good reasons those vehicles are tough to rent in Italy."}, {"username": "JeriLynne Clifford", "comment_text": "Could you possibly take the train to where you are going and use a hired driver from there? We rode in a van to vineyards"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "look here https://\nwww.discovercars\n.com/\n?a_aid=NextStop-\nItaly"}, {"username": "Lauri Savage", "comment_text": "Roads are very narrow and parking is hit or miss. We had a Fiat 500 and there were a few interesting moments. Highways are fine but the side roads are a different story! It was fun though!"}, {"username": "Glenn Todd Webb", "comment_text": "They use smaller cars. Parking is tight. Ask rental what is largest they offer"}, {"username": "Mike Guluk", "comment_text": "Fiat Ducati worked for us a lot of places have them but they sell out quick"}, {"username": "Steve Grossman", "comment_text": "Six people and luggage in european cars is really really not doable. Their cars overall are dramatically smaller than the u s. Try and take a train if you can"}, {"username": "Carole Tarlap", "comment_text": "Take the train to Naples airport and rent there. I got my car from Europcar/ Auto Europe"}, {"username": "Ryan Monahan", "comment_text": "Not many vehicles that big on the road! Search for Van rentals or rent two compacts. We just rented with Hertz. It was cheap and easy."}, {"username": "Barbara Bastianini", "comment_text": "Cars in Italy (and in Europe generally) are smaller than cars in the US. Seating six in one car will be an issue. Plus, the trunk space, even if you can find the same US model you might be familiar with, will be smaller in Italy. So luggage for six people will certainly be a headache in one vehicle as well.\n\nAs far as options maybe look for a van. I think you’d have better luck with that even those aren’t very plentiful either. And it won’t be fun to drive a van on narrow twisty roads. Or you might consider pricing two smaller cars rather than one larger one. That would be my choice in your case. Smaller cars won’t be a problem to locate and parking spaces for smaller vehicles will be much easier to find. A train might suit a group your size better. Or hire a couple of private drivers.\n\nAlso keep in mind that if you need transportation within cities taxis that seat six will be very rare, too. You’ll probably need two taxis. Larger groups are definitely harder to plan for than smaller ones!"}, {"username": "Alice Francesca", "comment_text": "Try and rent a Pulmino or Furgone\nhttps://\nwww.sixt.com/\nminivan-rental/\n?changeLocale=tr\nue"}, {"username": "Janine Emma Lucas", "comment_text": "There’s no rentals because there’s no parking. Be sure to ensure your Tuscany location has parking for such a large vehicle"}, {"username": "Nancy Day", "comment_text": "With that many people did you try private van/driver might be reasonable with 6 people"}, {"username": "Sandy Tadken Shaffer", "comment_text": "Minivan"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "For 6 adults + luggage you need a van but it will be hard to drive and park here.\nI would rent 2 small cars."}, {"username": "D'Anna Hohe", "comment_text": "Parking is next to impossible with a large vehicle. People have them but they must use them only to drive between their city house and their beach house. At least that was what our neighbor did.\nGet two small cars and you’ll have more flexibility."}, {"username": "Laura Tilson", "comment_text": "That sounds very very challenging! The roads are 1.5 cars wide, and parking such a huge car (for Europe) will be a nightmare. See if you can get 2 small cars. And, every time we go to sorento we rent an even smaller car! Hopefully 🤞 you can"}, {"username": "Russ Whitley", "comment_text": "Chevy Tahoe’s don’t really exist in Italy. We ordered a larger SUV and got put into a smaller Peugeot with 4 people and luggage. It was a real squeeze though the narrow roads it was more suited to purpose. So either a Merc or similar style people mover or two cars."}, {"username": "Andria Saia", "comment_text": "You could rent a van"}, {"username": "Cynthia Marie", "comment_text": "Roads are too small for a Tahoe. I would recommend renting 2 or 3 of the smallest cars you can find."}, {"username": "Theresa Bogda Steadman", "comment_text": "We are going from Sorrento to Sienna via train. Renting a car in Sienna. May have to take a few trips to our Airbnb to drop Luggage. Only a group of 4 though."}, {"username": "Donna Watson", "comment_text": "You’re better off taking the train"}, {"username": "Vicki Fien Dykstra", "comment_text": "Jackie Wilson Scheenstra"}, {"username": "Irene Oda", "comment_text": "Ooh sounds like you are going to need a van type. Chevy Tahoe would be very hard to navigate here in Italy. You will have to keep looking."}, {"username": "Melanie Matthews Stuprich", "comment_text": "Chevy is not a car you would see here at all unless it’s an American that has it shipped over. And bigger cars are definitely harder to find as most of small cars for driving and parking. Good luck in your search but I think you will struggle. Might have to get two cars instead if you want to drive. 🤷🏽‍♀️"}, {"username": "Debbi Mayfield", "comment_text": "When is your trip?\nSo for example we booked and paid for our 9 passenger van in January for a September/\nOctober trip. Recently I called the Italy office because my husband shattered his scapula a few days ago and won’t be doing the driving because our van is manual. I was calling to see if by chance they had any automatics so hubby can still do the driving —-me+Paris+driv\ning just to hotel=roulette🤦‍♀️.\nI was told not only do they have no manuals but no vans period. I can assure you there are almost no SUV types as we’d considered in the states. Europes idea of SUV is the size of a Honda CRV lol."}]}, {"id": "2204748806590864", "text": "I am looking for recommendations on hotel accommodations in Monterosso and Florence. Not concerned about price just looking for a great place to stay and good centralized location.", "link": "facebook.com/groups/1373361046396315/permalink/2204748806590864/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Florence https://\nwww.jdoqocy.com/\nclick-100692842-\n12291623?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.it\n%2FHotel_Review\n-g187895-d23296\n3-Reviews-NH_Co\nllection_Firenz\ne_Porta_Rossa-F\nlorence_Tuscany\n.html"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Monterosso https://\nwww.tkqlhce.com/\nclick-100692842-\n12291623?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.it\n%2FHotel_Review\n-g187820-d19673\n0-Reviews-Hotel\n_Porto_Roca-Mon\nterosso_al_Mare\n_Cinque_Terre_I\ntalian_Riviera_\nLiguria.html"}, {"username": "Sandy Radican Shikaly", "comment_text": "Hotel Brunelleschi in Florence!!!"}]}, {"id": "2204749006590844", "text": "How much on average did you guys pay for one day (8-9 hours) touring Amalfi Coast (Positano, Amalfi, Ravello, etc.) with a your own private car with driver? And which month did you go?", "link": "facebook.com/groups/1373361046396315/permalink/2204749006590844/", "likes": 0, "comments": []}, {"id": "2204750236590721", "text": "Hello! I’m looking for a hotel in Sienna that you have stayed in and liked? I’m there for a couple of days. Too many options on Expedia! Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2204750236590721/", "likes": 0, "comments": [{"username": "Stephanie Sposato", "comment_text": "https://\naxustravelapp.co\nm/shared/\nitinerary/\n2237b607-2ef7-40\n62-ac8b-c7db428\n5f0ca?type=with\n-images#booking\n-12"}, {"username": "Stephanie Sposato", "comment_text": "We stayed there. I lived the location as it was a quick walk to town maybe 5 minutes\nIt’s a basic hotel but perfect for us."}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.kqzyfj.com/\nclick-100692842-\n12291623?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.it\n%2FHotel_Review\n-g187902-d10309\n019-Reviews-Res\nidenza_d_Epoca_\nPalazzo_Borghes\ni-Siena_Tuscany\n.html"}]}, {"id": "2204750353257376", "text": "A family friend offered to pick us up at the Civitaveccia port. Are there any restrictions for individuals to pick up from the port terminal?", "link": "facebook.com/groups/1373361046396315/permalink/2204750353257376/", "likes": 0, "comments": []}, {"id": "2204753376590407", "text": "How soon should I book a Hotel in Rome for a May 2024 trip? We usually stay at a Marriott Hotel.", "link": "facebook.com/groups/1373361046396315/permalink/2204753376590407/", "likes": 9, "comments": [{"username": "Jason Hobel", "comment_text": "As soon as you can. Italy books quick so better safe than sorry and you may get better prices too. We went in the 1st week of May and the weather was perfect."}, {"username": "Robin Darmstadt Mancil", "comment_text": "I’ve booked mine for March!"}, {"username": "Penny Bellofatto Westberry", "comment_text": "The W is nice - Marriott brand, as you probably know :-)"}, {"username": "Stacy Giammarino Betty", "comment_text": "All hiltons were sold out for our July 2024 dates 🤷‍♀️ I’d say soon!!"}, {"username": "Michelle Thorpe", "comment_text": "Now"}, {"username": "Jenny Frank", "comment_text": "book now; rates are going to go up a lot once we cross December ...and the hotels are full full full as Italy is the most pop country to be visited right now. I am staying at the scalinata di spagna in sept. got 2022 rates ; the rates have skyrocketed since I booked so happy I booked months and months ago (same with airline tix: my tix is up $500)."}, {"username": "Colleen Jennings", "comment_text": "Book now but I’d get the rate where you can cancel unless you have travel insurance."}, {"username": "Madeline Caporale", "comment_text": "Even if Marriotts in Rome are booked out for 2024 there are plenty of 4 and 5 star hotels available. I would definitely be looking to book now for a May 2024 stay. Check reviews, and if using a booking site you can definitely search by location, stars, amenities and reviews."}, {"username": "Lisa Valdovinos", "comment_text": "We booked our trip 9 months in advance."}, {"username": "ScottandAngie Fuller", "comment_text": "Shelia Migliore"}, {"username": "ScottandAngie Fuller", "comment_text": "Cody Fuller"}, {"username": "Tam Wong", "comment_text": "Today!"}, {"username": "Gillian O'Callaghan", "comment_text": "Now if you want a specific one."}, {"username": "Dawn Rodriguez", "comment_text": "We booked the Marriott Grand Flora in early December and got a great price it was triple the price and points by the end of April. The weather was perfect!!!!"}, {"username": "Susan Tomera Angeletti", "comment_text": "Try the Pantheon Iconic. It’s a Marriott property. Fabulous!"}, {"username": "Barbara Bastianini", "comment_text": "I’d book as soon as you can."}, {"username": "Alexandra A Welker", "comment_text": "Book now! Hotels are easy to cancel if you find one better later on."}, {"username": "Lorraine Saeler", "comment_text": "The hotels that show sold out May and Beyond are not open in the system yet. It’s too early. May is just opening up now for some brands. They wait to set pricing and open when ready. Hilton and Marriott have a max date that inventory is opened and July just finished so not quite open for 24 July. Prices will be the highest as it rolls open. They may adjust down slightly and then back up within the booking window. My hotel just opened for May as August started that I’ve been waiting on."}, {"username": "Maree Peel", "comment_text": "As soon as you can as prices will increase the closer you get."}, {"username": "Denise Geyer Fransko", "comment_text": "Thank you all!"}, {"username": "Denise Townes Giacobba", "comment_text": "Now"}, {"username": "Sharyn Lockwood Allan", "comment_text": "I booked a month ago"}, {"username": "Ivette Lugo", "comment_text": "at least 3 months, hotels book fast"}, {"username": "Mike Loudiana", "comment_text": "Check the Pantheon Iconic, which is a 5 star Marriott. We were able to make reservations for Sept - Oct 2023 back in June. Great location"}, {"username": "Dana Davis", "comment_text": "We loved the Westin Excelsior, a Marriott property"}, {"username": "Tracy Jenkins Winetroub", "comment_text": "You have tons of time!"}, {"username": "Glenn Todd Webb", "comment_text": "December"}]}, {"id": "2204755143256897", "text": "Hi Everyone, I wondered what the roads are like coming in to naples from Bari. We have a hire car and im wondering if it will be crazy or a doable drive in to drop the car off ? Any help is greatly appreciated 🙏", "link": "facebook.com/groups/1373361046396315/permalink/2204755143256897/", "likes": 0, "comments": []}, {"id": "2204755589923519", "text": "Has anyone used Fenix NCC, Fenix Driver Service??\nLooking into them for Florence.", "link": "facebook.com/groups/1373361046396315/permalink/2204755589923519/", "likes": 0, "comments": []}, {"id": "2204756253256786", "text": "Greve in Chianti restaurant recommendations?", "link": "facebook.com/groups/1373361046396315/permalink/2204756253256786/", "likes": 0, "comments": []}, {"id": "2204759169923161", "text": "First time heading to Italy in August!\nMy family and I are trying to book a tour of the Vatican. However we are only in Rome for two days. We have been looking at a bunch of skip the line tours. I know its not the way to do it but since we are strapped for time we are hoping to just get in and get out.\nDo we need to stay with the guided tour theआणखी whole time or can we peel off and head over to the Sistine Chapel before the group does? We know you need longer than 2 hours but that is really all we have time for.\nPlease help this newby out! Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2204759169923161/", "likes": 105, "comments": [{"username": "Elizabeth Lupo DiVito", "comment_text": "We ran through on our own the first time. Second time took a tour and realized how much we short changed our selves the first time. There is sooo much to see and learn about."}, {"username": "Annmarie Chenoweth Burmeister", "comment_text": "Just got back. I booked the 7:30 am private tour with breakfast in the gardens. It was wonderful and not as crowded. Front of line privilege"}, {"username": "Kate Bryant", "comment_text": "Personally I only wanted to see the Sistine Chapel! So I did a quick run through.\nThe Basilica was dark, but I am not religious, so it depends on what you want to see. August is still busy in Italy and can be very hot, so wear hats and plenty of water. Enjoy"}, {"username": "Mary Brandon", "comment_text": "Having been on the tour of Vatican and Sistine & St Peter’s, I can tell you there is only one way to go through to the Sistine Chapel AND all the other tour groups are moving along as well. The crowd is dense (I went in July) and I don’t think you will get there much faster without your group, but break away After you know what time and location to meet your group at end.\nDef. Do a skip the line tour to get in..it’s worth the time & cost.\nSame thing in Florence to see the David in the Accademia or the Uffizi Renaissance art."}, {"username": "Bellafab Fabrizio", "comment_text": "Nah i didtched our tour guide. She spoke way too much"}, {"username": "Milt Lawhorn", "comment_text": "I went for the first time in June, it was amazing! The Vatican museums and the Sistine Chapel, and it is impressive but actually to me it was just overwhelming and it was packed, a whole lot of humanity. I liked St Peters more, they control how many go in at a time so it was less of a zoo. You have to be there before 8:00am or you’ll spend hours in line.\nHonestly there is basically a church on just about every block that will be more impressive than anything you’ve ever seen in the states and they aren’t crowded. Make sure to give yourself time to explore on foot. My wife and I started with a map (available in your hotel) that shows all the major sites and started at the top and worked our way to the bottom which was the Colosseum, and all the places in between we’re actually the coolest part of the day. Be sure to get at least a few hundred Euros from your local bank, you can buy pretty much anything with a credit card but the cash will come in handy believe me.\nHave fun and prepare yourself for the best cappuccino, wine, gelato, and pizza you’ve ever had in your life."}, {"username": "Martha Lee", "comment_text": "Getting in and out of the Vatican takes hours. If you don’t have time you should skip it and do it next time. Really"}, {"username": "Lynne Fricke", "comment_text": "We did the 7.30 am tour with Liv tours a few days ago. It was a 2 hour tour with quick access to St Peter’s afterwards. Hardly anyone else there. I got so much more out of this than when I visited a long time ago with no guide. Also previously thought the Sistine chapel small but with the tour had a new appreciation of it. Highly recommend this tour."}, {"username": "Helene Smith", "comment_text": "We had a tour with only us four and the guide. The other couple did not pitch. I will try and find the link. Make sure you know the entrance! Not in the front but on the side; quite a walk AROUND the front towards the right side. We almost didn't make it! Really a lovely girl with loads of knowledge and energy. (Remember you are not allowed to take photos in the chapel area.)"}, {"username": "Helene Smith", "comment_text": "We had bought 2 bottles of wine just before going there, and they were not allowed inside. But we could leave it at the entrance. AND walk all the way aound again to collect them as you exit in the FRONT of the Vatican."}, {"username": "Israa Abodoma", "comment_text": "If you have little kids 2-3 yo, you skip the queues. They appreciate kids 💕💕💕 When my kids were younger that’s what happened, a women with toddlers, she’s already having enough let her through! Hahaha. If you can book online, you can skip the queues as well. Good luck! It’s a beautiful experience timeless! Enjoy it!"}, {"username": "Ian O'Hara", "comment_text": "You can’t nip in and out of the Vatican museum. It’s an all day job"}, {"username": "Suzanne Sullivan", "comment_text": "I have done a lot of guided tours and most are boring- where I have left the tour to go on my own. However for the Vatican I absolutely loved Elaine - she’s funny, knowledgeable and quirky which added a lot to the couple hours we were with her. She even gave us the opportunity to leave her several times and noone ever did. She was a tour guide for “What a Life Tours” - pm me for me details if interested."}, {"username": "Cindy Giuliani Buda", "comment_text": "Get front of the line tickets & use Rick Steve’s app. He will guide u thru!! Download cities & tours before you go!"}, {"username": "Diana Camardi", "comment_text": "We booked the night tour, less people, cooler...not morning people!"}, {"username": "Joanna Aceves", "comment_text": "I suggest taking notes on what you really want to see. Rome can be a little overwhelming it’s august and it’s tourism season so it’s gonna be packed and extremely hot and humid. Give yourselves time. Rushing from one place to another isn’t good and you’ll stress yourself.\n\nThe Vatican and Sistine Chapel can get packed and over crowded."}, {"username": "Anna Buchan", "comment_text": "I have been following this prior to our one month trip to Italy. We just returned. Very good advice from all. A few things i would suggest definetly see cinque terre, there really is no skip the line you get in and wait like everyone else, definitely book a tour guide for vatican, collisseum, forum, pompeii, do a boat trip to capri the grotto can be a few hours wait, definitely climb pisa, and duomo. Pack light its a pain travelling with lots of baggage for trains. Other than that enjoy every minute your in Italy. Drink, eat and have gelato. The food is somuch fresher in Italy the milk and pasta didnt affect us at all. Enjoy ciao"}, {"username": "Thalia Campbell-Jennings", "comment_text": "The Tour Guys 'Rome in a Day' tour is awesome!!! I just did it as was only in rome 2 days and was worth it!"}, {"username": "Matt Obadia", "comment_text": "There is no way you can see much of Rome in 2 days. Minimum minimum is 4."}, {"username": "Tara Feliz", "comment_text": "You can definitely utilize the skip the line tour, get in, then go on your own. Just let the tour guide know when you decide to leave."}, {"username": "Shena Kennebeck Talbert", "comment_text": "We didn't wait in line, but you did have to stay with your guided tour. The guide is constantly counting heads and they would report you as missing. The place is protected by highly trained guards. ( Although they look like jesters, don't be fooled into thinking they are lightweights.) I can't imagine that your disappearance would be well received."}, {"username": "Stella Cammarano", "comment_text": "We used Get your guide and booked a skip the line entry and did it allon our own.."}, {"username": "Felicity Scates", "comment_text": "The chapel is soo full but is soo beautiful. Leaving your tour to go there would be pointless due to the crowds of people Inside.\nDefinitely pay for skip the queue!"}, {"username": "Beth Schierloh", "comment_text": "We used Viator & the tour was 2.5 hours, meeting for the 7:50AM tour. When we left our guide at 9:30, we were able to visit the grotto on our own. Our guide told us that if we wanted to leave the group anytime during the tour, we could do so."}, {"username": "Flora Johnson", "comment_text": "We got our tickets in advance Vatican Museum included the Sistine Chapel, Colosseum, the Forum… the Papal Audience we didn’t have reservations but lucky enough to get in & saw the Pope."}, {"username": "Ann M. Bookman", "comment_text": "There are a couple of early morning (7:30am) tours that beat the crowds and give you a leg up on the day."}, {"username": "Cynthia Chow", "comment_text": "We did a 3hr small group tour and felt it was very informative, though long. You can leave your group whenever you want and walk on your own if you wish."}, {"username": "Rebecca Deyo", "comment_text": "John Deyo"}, {"username": "Margaret Mackenzie", "comment_text": "It's very structured. What I remember from the Sistine chapel was they let one group and then another lot in. Like waves. We did the Sistine before we got to St Peter's."}, {"username": "Marla Davison Danis", "comment_text": "We used The Tour Guy guided tours for both the colosseum and Vatican. Skip the line was well worth it. Colosseum, Roman Forum and Palatine Hill with a guide was amazing. You get so much knowledge in a quick amount of time (3hrs). The skip the line for the Vatican was also worth it. We stayed with our guide for the beginning and then got separated a bit going through the Vatican. Met back up before the Sistine Chapel. That part is really rather quick. No pictures or video allowed. Then we were on our own for St Peter’s Basillica. We had plenty of time to explore some spots on our own, like Trevi Fountain and the Pantheon (good map and GPS). Make sure you have hats and water bottles. HOT 🥵 and plenty of free, cold water fountains. A mini umbrella came in handy for shade also. ***cover shoulders and thighs is a must for the Vatican! Enjoy!"}, {"username": "Kelly Aynes Zingaro", "comment_text": "Do the early morning guided tour with breakfast after. Starts at 7:30am, it’s only like an hour and a half but you see everything and it’s not crowded as it’s an hour before open to the public. We were done at 9:30, had the opportunity to stay ad long as we would have wanted but by then it was so crowded, we were done. It was a very good and informative tour that wasn’t super long for us and our teenagers. I booked directly on the Vatican site."}, {"username": "Andrea Ferretti- Kearney", "comment_text": "We booked “Vatican: Museums & Sistine Chapel Entrance Ticket” through get your guide. You can choose to get an audio guide or not. We went right in and security was super quick. We spent them most time where we wanted to."}, {"username": "Pam Simpson Wilson", "comment_text": "With the Viator tours we have done the guide usually state if anyone needs to leave early to just return the radio to her before departing"}, {"username": "Chris N Jen Mercado", "comment_text": "I know it may be hard but if you can take the earliest tour if possible. It’s gets busy and hot."}, {"username": "Kris Beacham", "comment_text": "Do the skip the line. (ALWAYS do that. When you see the two hour wait/line it’ll make sense). And the self guided tour. You’ll get a headset and the recordings will walk you through it."}, {"username": "Nancy Webster-Gregg", "comment_text": "Krista Jefferson-here is a Italy page I followed"}, {"username": "Karen Lenthe Redett", "comment_text": "Our guide let us give back the head piece and told us the route to go on our own. I guess you can slide in with another group and be okay or she wouldn’t have said it. We were strapped for time too. They usher you through like cattle to the chapel and we ran out of time to see the actual sanctuary. That’s what we wanted. The place is a maze and too many halls and pushing ppl to enjoy to be honest."}, {"username": "Liz Cottrell", "comment_text": "Oh get the skip the line your or your vacation will be standing in line for hours"}, {"username": "Isabel Salcedo Patterson", "comment_text": "Yes book a tour. The lines are so long for people not on a tour. My tour was at 8:30 and it worked out great. I think it was 2 hours. I just went on trip advisor and booked a tour"}, {"username": "Lee Sorenson", "comment_text": "Hi. I’m searching for leads to renting a large villa or small hotel for two weeks in mid-October 2024 on the Amalfi coast. Names of agencies or individuals welcome. Thank you."}, {"username": "Gaylee Thompson Demlinger", "comment_text": "I was trying to book direct for mid September and was out of luck. Missed my window."}, {"username": "DeanaMarie Yaklin", "comment_text": "You won’t have time to do both. Get there early to beat the crowds. A tour will slow you down, it’s a lot of info"}, {"username": "Lorrie Nolan Masset", "comment_text": "We booked a guided tour of Vatican and Colosseum through Viator for our first of 2 days in Rome the first week of Oct."}, {"username": "Sharon Smith", "comment_text": "Get your tour tickets as soon as possible so you have a set “entry time”. Let your your guide know that once you’re inside you will be peeling off from the group and heading to Sistine Chapel because you’re short on time. This will stop her and the group from trying to wait up for you or look for you. ALSO, buy bottled water from vending machine . They allow you to ￼carry it through!!!"}, {"username": "Karen Gregorchuk", "comment_text": "Courtney Greg"}, {"username": "Jennifer Leigh Zardavets", "comment_text": "I wish we could have left our guide it was too long. If I wasn’t with a big group of family I would have. He was very nice and knowledgeable so that was good but he had the WORST B.O. and breath, plus with the heat I thought i was going to die. And he kept raising his arms up in the air and was talking too close to us. My sister and I tried to trail behind but he kept maneuvering close to us. 😂"}, {"username": "Michelle Hepburn", "comment_text": "Men can wear shorts? Or pants required"}, {"username": "Jodi Homes", "comment_text": "I booked the breakfast at the Vatican & Sistine chapel through Viator. Not cheap but I will NEVER wait in 3+ hour lines again… there’s literally nothing worth seeing for that kind of wait in the heat for me😂happy to pay & get on w my day!"}, {"username": "Janelle Caire", "comment_text": "A quick option is to book a Vatican Gardens tour. After you roam through the Gardens, you are allowed entry into the Sistine Chapel - not all the other rooms. If you book the higher-priced more limited size group, I’m sure your tour guide could accommodate your time schedule.\nI booked it directly through the Vatican website."}, {"username": "Carol McDonald", "comment_text": "If you are there on a Wednesday, book the Papal Audience. I was 10 ft. From the Pope. It was amazing. They you can visit the Vatican after that. Enjoy"}, {"username": "Wendy Yates", "comment_text": "I booked through GetYourGuide . They were fantastic . Don’t stress"}, {"username": "Neville Spargo", "comment_text": "Just a week ago we did the Vatican 7:30am tour with breakfast, it was excellent, the queues were huge! for a lot of our tour many of the rooms had no people at all excepts us! the queue at 7am to buy tickets was down the street, 500+ meters, when we came out it had doubled and gone around the corner, complete mayhem ! We just went straight in and started our tour. see photo here of queue to buy tickets. and the breakfast is great, a real feast!"}, {"username": "Karen Voorhees Simonds", "comment_text": "Go at opening. It is a long walk to get to the Sistine chapel. Through the whole museum. At least 2 ours"}, {"username": "Rikki Fordahl", "comment_text": "Laura A Sutter"}, {"username": "Lauri Datri Anderson", "comment_text": "We booked our tour through Airbnb and it was fantastic. It was only six of us, and it was smooth as ice. Highly recommend."}, {"username": "Jean Williams Bryan", "comment_text": "You learn so much from the tour guide. My opinion"}, {"username": "Heather Keen", "comment_text": "I have never been but to the Vaticain but when I am in Europe I use Viator for all my \"this to do\""}, {"username": "Jade Illiano-Smith", "comment_text": "Book the skip the line at 7am."}, {"username": "Christine Verbeek", "comment_text": "You’ll enjoy but it’s crowded, hot with no air. I’d bring a small portable rechargeable fan you can put in your purse. Hope you get your skip the line. I feel it’s something you should definitely see. Are you there on a Sunday or Wednesday? If you are go to Vatican square for Mass, it’s pretty moving! Enjoy Italia! Also, maybe after your Vatican go to Piazza Navona, find a tiny little side street restaurant and you’ll have the best food. Check out the fountains and the artists. Street artists selling oil paintings in the side streets for 20€, I have 2 from visits, I cherish them. 😊"}, {"username": "Jenny Kendrick", "comment_text": "We just toured it ourselves easy enough to do and exited with a few things from the gift shop"}, {"username": "Melanie Matthews Stuprich", "comment_text": "Listen.. I started to look at things at beginning when I was there a few weeks ago and then about two rooms in and all the crowds, my daughter and I just booked it through every room to see the Sistine chapel and get out of there without having a panic attack for either of us from the heat and the crowds. It still took us at least an hour to rush through. So many people crammed in there it’s insane! I doubt you can leave your group because you will have their listening device for them to be able to tell you things. I would go without a tour and book before going though I’m not sure if it’s sold out or not for august."}, {"username": "Sara Joanne Bedford", "comment_text": "I would just book the entrance ticket and skip the guide if you only have time for the Sistine Chapel tbh the Vatican was the least engaging place on our itinerary whilst in Rome, Pantheon, night walking tour of colosseum, and wandering between Piazza’s far more interesting imo especially when with kids/teens"}, {"username": "Jim Bobrowski", "comment_text": "Jim Bobrowski"}, {"username": "Trevor Ian Wright", "comment_text": "Viator do a good tour"}, {"username": "Fran Fitzpatrick", "comment_text": "Book the tour then tell the tour guide your situation.I think they have to account for everyone at the end of the tour."}, {"username": "Toby Levy", "comment_text": "I booked a Vatican garden tour which included skip the line entry to museums. Bought an audio guide and did it at our own pace. Leave when you’ve had enough"}, {"username": "Maggie Williams Dryden", "comment_text": "Book yourself for early entry. There are so many people, even when you do early entry, it’s hard to move faster than the crowd that you’re in. Two hours isn’t really enough time to see the museum rooms (including the Raphael room which is the coolest part IMO), Sistine Chapel and St. Peter’s Basilica. We arrived for our tour at 7:30 and were done by about 11. Even with a tour, a ticket, and early access, you’ll spend a lot of time waiting in lines because of the sheer volume of people there. Good luck!"}, {"username": "Tracy Piko Lawniczak", "comment_text": "You can leave the tour group, you just have to let the tour leader know."}, {"username": "Pamela Jones", "comment_text": "Just go to Vatican website buy your own skip the line entry tickets. Download Rick Steves free audio guide & map & walk yourselves through. You can go as fast as you like. We did..it was great!"}, {"username": "Steve Grossman", "comment_text": "You can't just head over to the sisteen chapel. The entire tour takes about three hours"}, {"username": "Alice Francesca", "comment_text": "Rome in july and august : no.\nHaving said that, and hoping that someone will finally understand that July and August in Italy are overcrowded and very hot, good luck."}, {"username": "Valerie Nicole", "comment_text": "We booked a Pristine Sistine Early Entrance Small Group Vatican Tour. Walks of Italy highly recommend we were in and out before it got crowded had to meet at 7:15 am but it was worth it!\n\nhttps://\nwww.walksofitaly\n.com/\nvatican-tours/"}, {"username": "Susan Hulsey Watkins", "comment_text": "Do an early entry tour. Worth getting up early for."}, {"username": "Ruth Hackert", "comment_text": "Book today, if available"}, {"username": "Patty Gaskin", "comment_text": "Personally..I would say that if your interest is to just see the Sistene Chapel.i would skip it! I found it very Underwhelming! So much smaller in person. If you were going to use it to then go on to the Basilica which is much more impressive IMHO."}, {"username": "Michelle Rigdon", "comment_text": "If you can book tickets to skip the line without a tour I would. Then go at your own pace through the museum to get to the Sistine Chapel. Then St Peters. I personally wish you could just do the 2 and skip the museum."}, {"username": "Deborah Schroeder", "comment_text": "If all you want is the Sistine Chapel, get a skip the line ticket and walk through one of the most incredible museums in the world with blinders on and end at the chapel. You can't just leave a group, they are responsible for you."}, {"username": "Rose Anderson", "comment_text": "Just be ready for extreme heat- book a tour as early as possible- if you don’t have tickets you will either stand in hot lines for hours or not get in at all"}, {"username": "Jeff McLellan", "comment_text": "I would not rely on any third party tour operator for this. Heard from many people who have had cancellations this summer."}, {"username": "Dawn Weldon", "comment_text": "Context tours is also great"}, {"username": "Mindy Fey Kinser", "comment_text": "Goodness! So many answers here, and no two are alike. ￼ I have visited the Vatican museums four times. Here are my suggestions which I hope will be helpful.\n1) Skip the advice of people that say “don’t go in August “! Yes, it is going to be hot and it’s going to be crowded but I assume your trip is already booked and you will still love it!\n2) ￼ My best bet has always been booking directly with the Vatican Museums website. Be sure to scroll down and click on “more bookable options’. Anything you book on their site is technically a “skip the line“ because you have a timed entry. You will go to the main entrance, show your voucher, then walk into the main lobby area, through security, and pick up your tickets. You can select from a guided tour or a self guided tour. It sounds like you might lean toward the self-guided tour. In that case, you go through the museums at your own pace and arrive at the Sistine chapel on the far end. When you come out of the chapel, you can continue through the museums back to the entrance. You cannot go directly into St. Peter’s basilica, unless you are on a specific outside tour that includes direct entry. That option is not available on the Vatican Museums site.\n3) the only way to avoid some of the heat and crowds in August, would be to book one of the early morning or breakfast tours. These are always highly recommended. Otherwise, any other time of day, the crowds can be overwhelming. Staying with a guide, does give you the advantage of being navigated through some of the most congested areas.\n4) St Peter’s is free to enter from St Peter￼’s Square. Do be aware that the line to enter through security will be daunting. Depending on the time of day and the weather, you might expect to be in line for 2 to 3 hours If you only have a couple of days in Rome, you decide if that is a priority. Also, if you are in Rome, on a Wednesday, the Basilica will be closed in the mornings as pope Francis will be having his public audience in the Square. I can tell you that the basilica IS incredible but there are also many stunning cathedrals and basilicas throughout the city that you can enter at any time without a wait.\n4) if everything is sold out on the Vatican Museums site, there are several good, locally run tour options that might have availability. I highly recommend checking out Katie’s Untold Italy website for recommendations\n, links, and even a discount code or two. I recently booked a private tour for a couple that will be traveling with me in October to see the Vatican and basilica on their 50th anniversary through Liv Tours (via Katie’s link) and the communication has been wonderful.\n5) finally, take all advice with a grain of salt! You do you! Some will say that the Sistine chapel was the highlight of their trip, while others say it is underwhelming. That’s OK!\n￼ Wishing you a magical, memorable, and beautiful trip to Italy. You will keep it in your heart forever. ❤️ ￼"}, {"username": "Jenni Pearl Leavitt", "comment_text": "We booked a breakfast entry at 7:45 without a tour. We were in front of the crowds. There were not many people there with us just a couple days ago mid July when people said it would be insane. We were in and out in about 90 minutes. We just kind roamed through, took pictures, and kept moving. That was enough for us. We all enjoyed it."}]}, {"id": "2204761786589566", "text": "What is a good winery to visit in the triangle of Bari, Matera and Polignano A Mare?", "link": "facebook.com/groups/1373361046396315/permalink/2204761786589566/", "likes": 0, "comments": [{"username": "Valentina Daprile", "comment_text": "Terre di SanVito. Top just outside Polignano"}]}, {"id": "2204763676589377", "text": "Recommendation for places to stay in Lucca please .", "link": "facebook.com/groups/1373361046396315/permalink/2204763676589377/", "likes": 0, "comments": [{"username": "Karen Landini", "comment_text": "We stayed at Palazzo Pfanner and loved it. Depends on the experience you are looking for. http://\nwww.palazzopfann\ner.it/"}, {"username": "Surabhi Bains", "comment_text": "Perle D’Ambra. Wonderful hostess."}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.anrdoezrs.ne\nt/\nclick-100692842-\n12291623?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.it\n%2FHotel_Review\n-g187898-d17411\n810-Reviews-The\n_Tuscanian_Hote\nl-Lucca_Provinc\ne_of_Lucca_Tusc\nany.html"}, {"username": "Lou Trebino", "comment_text": "Grand Universe Lucca"}]}, {"id": "2204776643254747", "text": "Hi all- I will be traveling to Italy end of August (this month) through early September. This will be my first visit and I cannot be more excited for the same.\n\nI plan to visit Rome, Florence and a day trip to Cinque Terre from Florence.\n\n1. What are the must have apps on my phone?\n2. What is an equivalent app to Uber in Italy?\n3. I read thatआणखी water from water fountains are drinkable? Is this true? No risk of waterborne diseases through the consumption of this water? What apps are suggested to find these fountains?\n4. Safety tips to protect my wallet, passport and other valuables during sight seeing. Is it safe to carry these things in a backpack while sight seeing? It is not wise to leave the travel documents in the luggage in my hotel right?\n\nAny responses to my questions above will be super helpful. Thank you in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2204776643254747/", "likes": 8, "comments": [{"username": "Gena Kona-Mancini", "comment_text": "I don't have all your answers but get a fanny pack. Put all your valuables there. We also traveled with a small backpack that has the tie cords on the top rather than a zipper. Not super comfortable but definitely harder for people to get onto.\nCinque terre and Florence, tap water was fine and Rome/Sorrento the tap water tasted like salt/minerals (although nothing made me sick). Keep in mind too that the tap water is never really cold."}, {"username": "Scott Perry", "comment_text": "Rome has water fountains throughout the city called “nasoni”. The water from these fountains is pure and delicious."}, {"username": "Sally Aubrey", "comment_text": "If you click on the Discover Italy group name, and click on the magnifying glass to the right, you can type `water fountains' or `apps' or `safety' and you will find the answers to your questions. I hope you have a lovely trip."}, {"username": "Yvonne Ormson", "comment_text": "Never. Ever. Put valuables in a backpack in any country!!!"}, {"username": "Yvette Pavone", "comment_text": "Deepl for translation\nFlush for bathrooms"}, {"username": "Paula Brink", "comment_text": "Do not carry your valuables in a backpack. Lock your passport and whatever valuables you dont need for the day in the room safe."}, {"username": "Marjie De Villa Lorica", "comment_text": "If planning to take the trains, buy your tickets asap.\n\nTrain tickets get more expensive as the travel days get nearer, and the class you want gets “sold out “ ( as it happened to me🥺)"}, {"username": "Jenny Payne", "comment_text": "Use a cross body bag + a backpack but only keep your not so important documents in the backpack . Commonsense is a must when travelling 🌻"}, {"username": "Marcela Beian", "comment_text": "Backpack in front!"}, {"username": "Rachael Richardson", "comment_text": "Fountain water is fresher than tap water !\nYou just come across them ,\nCross body bag not rucksack\nI used this one and had my passport on me always , never had a problem , i couldn’t even open the zips 😂\nTrain app trenitalia for trains"}, {"username": "Elizabeth May La Duca", "comment_text": "download Google Maps app and don’t go anywhere without first checking with it\nWww.maps.google\n.com / directions"}, {"username": "Laura Uribe", "comment_text": "There is not any one app for cars per se.\nRome has Uber and Free Now\nWe walked Florence our 5 days there or there are taxi’s.\nCinque Terre is walking, train or ferry."}, {"username": "Dawn Hofmeister", "comment_text": "Just returned from 6 weeks…trenitali\na, TheFork, Uber, FREENOW, and ItTaxi were apps I used. These all work great in Rome. Florence was great too, but smaller towns did not have uber and taxi’s were harder to come by unless you called. We used TheFork to make reservations for restaurants and even had some discounts on dinner. Bounce was another app we used to store luggage. It was super easy to use. Fountain water was so refreshing. We found super cold water from a fountain on our walk to the Vatican. Fountains are great, as is the water from the tap. They are less common in other cities tho. I carried our passports in a crossbody everyday as we stayed in airbnbs. Museums everywhere checked ages for free kids tickets. In Rome, I did see police stop a number of people to see their passports. That was the only place tho."}, {"username": "Ka Ben", "comment_text": "I used omio app for train tickets. It is better to buy tickets in advance. They get more expensive as the dates get closer. Always be aware of your belongings. Also in Rome, some might try to put a bracelet on you or give you some kind of trinket, only to ask money in return. Take euro coins with you. Some require coins to use public restrooms/\nbathrooms."}, {"username": "Suzi Hellmundt", "comment_text": "leave all valuables in your air bnb. Wear a cross body bag and keep zipped up. Do not wear flashy jewellery. If in a crowd keep your hand over the zip of your cross body bag. I used my phone for cashless transactions and had the phone in a zipped compartment in cross body bag. Have some cash for small transactions like coffee and gelato and one Euro for the loo. Italy is gorgeous and the people warm and friendly - always helps to say a Borngiorno with a smile when entering a shop or restaurant and a graze at the end."}, {"username": "Dann Hrusch", "comment_text": "I've always traveled with a hidden belt wallet. The one I have now is from Shacke and can find on Amazon. Perfect for passports and a little money. You loop your belt through it and can either carry in your pocket or flip inside your pants to conceal it. As for wallet, I switched to a front wallet years ago and never looked back. Much easier to keep secure in crowded places."}]}, {"id": "2204772229921855", "text": "Pantheon tickets - we now need to purchase ticket to enter- are they all timed entry?\n\nAre people finding they sell out, or am I okay to purchase day or two before? Do the tickets include anything else, like an audio tour?\n\nThanks for any tips and feedback- wasn’t expecting to purchase any entry ticket. so sort of cramming for my trip at the end of august…..", "link": "facebook.com/groups/1373361046396315/permalink/2204772229921855/", "likes": 0, "comments": [{"username": "Angie Davidson", "comment_text": "We just went yesterday and we stood in the no ticket line for about 30 min and we’re able to buy tickets and get in. If you buy them ahead of time you just avoid the line, but my husband waited in line while we got gelato (and him). Basically everywhere we have gone so far you can get in if you don’t have tickets before hand, but you will wait in a long line."}, {"username": "Gena Kona-Mancini", "comment_text": "No times entry you can buy in advance! They don't really care about the timing ans you can buy them online while you're waiting and skip most of the line to purchase"}, {"username": "Trisha MK", "comment_text": "another Pantheon ticket question - I'm trying to purchase tickets and the website won't let me past adding tickets to the cart. There is an error alert. There is no \"paypal\" option. Am I having issues as I'm trying to purchase outside Italy? Thanks for any tips/feedback!!"}]}, {"id": "2204780959920982", "text": "Does Palazzo Brancaccio in Rome have a 2024 NYE party 🎆?\nIs it fun and where to buy tickets?", "link": "facebook.com/groups/1373361046396315/permalink/2204780959920982/", "likes": 0, "comments": []}, {"id": "2204781346587610", "text": "Is Meta a good spot to stay if you are going to be traveling from touring Pompeii one day and the next day ￼going to Positano ???\nThx u", "link": "facebook.com/groups/1373361046396315/permalink/2204781346587610/", "likes": 0, "comments": []}, {"id": "2204862823246129", "text": "Had the most incredible dinner in Florence last night at Antica Trattoria da Tito. The food was incredible, staff were really fantastic and the loud upbeat music really set the mood. I liked how every table (including ours) were loudly talking and laughing the entire time.\n\nHonestly, it is the highlight of the trip so far!", "link": "facebook.com/groups/1373361046396315/permalink/2204862823246129/", "likes": 254, "comments": [{"username": "Jo Ann Ciuffini Forcino", "comment_text": "Do they have pasta or vegetarian dishes? 2 in our group are vegetarians."}, {"username": "Candace Beutell Gardner", "comment_text": "Florence, Italy is famous for beef, not pasta. Lots of good restaurants not far from the cathedral. There you can also find several rooftop bars and cafes where you can sit and enjoy the view while sipping a glass of wine."}, {"username": "Ella Luna", "comment_text": "We were there in June. Delicious food and great ambiance!"}, {"username": "Joanne Diaz", "comment_text": "Do you need reservations?"}, {"username": "Jeanne Eliason", "comment_text": "Loud upbeat music? Glad you mentioned that. I've never been in an Italian restaurant that had any music playing. Sounds like the USA. Can't go anywhere without blaring music."}, {"username": "Ashley Gibbons", "comment_text": "Matthew Gibbons"}, {"username": "Candice Benjes Small", "comment_text": "We still talk about our dinner there! There were two big groups- one all women, one all men- who didn't know each other at the start of the meal but kept chatting, then flirting, then table hopping with each other. Dinner and a show!"}, {"username": "Karen Dwyer", "comment_text": "We ate there our first night in Florence on recommendation of Hotel Hugo- wonderful! And one of our favorite nights"}, {"username": "Brooke Joyce", "comment_text": "Bobby Joyce"}, {"username": "Yateesh Kumar", "comment_text": "Nileema Kumar"}, {"username": "Mary Lou Gillen", "comment_text": "Sound like the perfect setting and a great a great meal!"}, {"username": "Phaedra Adamson", "comment_text": "Nathan Mansfield"}, {"username": "KJ LaVallee", "comment_text": "Baseball caps and tank tops at the dinner table? Not acceptable dinner attire."}, {"username": "Luca Lookone Ferrentino", "comment_text": "Don't people talk and laugh in your country when having dinner together?"}, {"username": "Ricky Price", "comment_text": "Leanne Ravell a place to try"}, {"username": "Karen Cumbo", "comment_text": "We ate there last June. Phenomenal!"}, {"username": "Tanya Maturo", "comment_text": "Fabio Oloferne !"}, {"username": "Lisa Louis Hoffman", "comment_text": "We went there our first night in Italy! Loved it!"}, {"username": "Sandra Paul", "comment_text": "Nadia Lucadamo"}, {"username": "Shaun Fagan", "comment_text": "Deborah Fagan"}, {"username": "Laura Chen", "comment_text": "This place looks very nice and creative😉"}, {"username": "Nadia Nadia", "comment_text": "Ok silly question, are the prices listed on the menu’s? I have been looking at the booking of some restaurants various places, but can’t seem to find the prices"}, {"username": "Christine Malota- Kendall", "comment_text": "I so agree. And “our last supper” planned for our last night in Florence! The tomato soup… oh my!"}, {"username": "Kara Spalding", "comment_text": "I have eaten here twice in two different trips and it is absolutely amazing! Also, The square nearby- Santo Di Spirito? Is super lively fun and a great way to meet locals!!"}, {"username": "Dafne Vassetti", "comment_text": "I am Italian and live in Florence. Tito is my favorite trattoria and fiorentina steak place. It's harder and harder to find real traditional places since everything is being \"eaten\" up by touristy places that serve what tourists want and not the other way around. So hope this place continues to exist for another 100 years ❤️"}, {"username": "Sascha Smith", "comment_text": "Clay Smith what do you think?"}, {"username": "Lisa Wylin", "comment_text": "Bella🥰"}, {"username": "Nathan Earl Stellenberg", "comment_text": "2km's from the hotel we booked, will give it a try. Thanks."}, {"username": "Kieran Edwards", "comment_text": "Stacey Edwards"}, {"username": "Kathy Damaren Ingram", "comment_text": "We loved it there. The food was delicious!"}, {"username": "Julie Angel Bruther", "comment_text": "My kinda place. Thank you for sharing!"}, {"username": "Susie Kanack", "comment_text": "Florence was my favorite city"}, {"username": "Toni Marie", "comment_text": "Just came back from Florence love it there"}, {"username": "Yelena Kruglyak", "comment_text": "Beautiful place, been there last year"}, {"username": "Lucy Lou", "comment_text": "No baseball caps at dinner table!"}, {"username": "Pao Tellez", "comment_text": "Mau Sos"}]}, {"id": "2204931679905910", "text": "We are heading to Florence end of September. Does anyone have any advise on apps to download, places to visit, eat etc? We are there for 4 days!! Also is there a preference between taking currency or paying on card?\nThank you.", "link": "facebook.com/groups/1373361046396315/permalink/2204931679905910/", "likes": 0, "comments": [{"username": "Fetchin Gretchen", "comment_text": "I advise first take this question and paste it into Google Bard AI. It will give you a suggested itinerary etc. Then narrow your questions from there. Once your questions are then more narrow and specific after that initial research, come back here for more targeted advice."}, {"username": "Colleen Jennings", "comment_text": "WhatsApp, apple Wallet for your credit/debit cards. Cards accepted everywhere but take a couple of 100 €’s for cash tips in small denominations."}]}, {"id": "2204958609903217", "text": "Hi , im in Rome. Best places to buy purses and wallets? Not too expensive!! Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2204958609903217/", "likes": 6, "comments": [{"username": "Carmela Noble", "comment_text": "I looove carpisa."}, {"username": "Stacey Esposito", "comment_text": "Massimo leather"}, {"username": "Dana Ioana Baias", "comment_text": "On the beach"}, {"username": "Maria Farhan", "comment_text": "carpisa...Mirad\ni...Melluso...p\nollni...liujo..\n."}, {"username": "Maria Samaee", "comment_text": "This is the store I got couple purses and wallet and belt to bring back to state as a gift, very good quality and cheap price, everyone liked it."}, {"username": "Sue Sherwood", "comment_text": "There is a little shop on a side street next to the Pantheon and the women makes the most beautiful bags, purses and belts. She makes them right in the shop."}, {"username": "Blanca Gil", "comment_text": "Ibiz Roma on Via dei Chiavari\nBeautiful leather bags, totes and small leather goods\n\nhttp://\nwww.ibizroma.it/"}, {"username": "Yateesh Kumar", "comment_text": "Nileema Kumar"}, {"username": "Kristina Michelle", "comment_text": "This place was awesome!! I came back with purses for my whole family they all loved them. It’s a family run business 💗\n\nhttps://\nmaps.app.goo.gl/\nb1jWuzJaQxmmaCoF\nA?g_st=ic"}]}, {"id": "2204962909902787", "text": "Has anyone hired a private driver by the hour to drive from Rome to Florence and made stops along the way.", "link": "facebook.com/groups/1373361046396315/permalink/2204962909902787/", "likes": 0, "comments": [{"username": "Kate Delkou", "comment_text": "Hi guys we were on a cruise & hired our own private taxi/ driver from the cruise port ( which we negotiated with the driver) it was an air conditioned suv there were 4 of us ( wish I got his card) he was fantastic we went from the port in Italy to Sorrento then onto amalfie it was fantastic our time was limited as we only had the day the driver made it fantastic the pictures are amazing find the cruise ports that’s where all the good drivers are"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2204964679902610", "text": "Best places to eat in milan? Also Best pizza recommendations please", "link": "facebook.com/groups/1373361046396315/permalink/2204964679902610/", "likes": 0, "comments": [{"username": "Enes Kiš", "comment_text": "Pizzium via procaccini, near chinatown, the best pizza I have ever tried in my life 😉"}]}, {"id": "2204968019902276", "text": "Tickets booked yesterday for 15night bucket list family trip to Italy!!! Super excited!! In to Milan (land 07:00 sat 15 june 2024), out from Rome (flying 22:00).\nSo many questions...\n\nPlan is to do the no of nights:\nMilan 2-3 (?daytrip to Garda)\nRapallo/Portofino 3\n5terre 3 nights\n“Tuscany” 4 days\nRome 3-4 days (possible daytrips to amalfi)\n\nIआणखी know I need at least a month (months!) but this is the time we have. How would you suggest we allocate the days?\nWe are myself, husband, kids 12,16,18.\nAlready struggling to find affordable (for our budget) accomodation...\nAny possibility of soccer matches in this time? Hubby and son would love it!\nCan we rent bikes in Tuscany region to explore the surroundings?\n\nLots and lots of homework ahead! Cant wait!!!\nOh, we have been to Venice previously.\n\nLooking forward to tips for our planning! Really enjoy this site.", "link": "facebook.com/groups/1373361046396315/permalink/2204968019902276/", "likes": 1, "comments": [{"username": "Elena Innocenti", "comment_text": "Serie A Championship finish end of may, because from 14june to 14july are UEFA Euro2024 in Germany, no soccer match in this period here."}]}, {"id": "2204970446568700", "text": "Hello, my husband and I would like to take our kids ( 6 &15years old) to Italy to celebrate our 20th weddding anniversary September or October time.\nWe thought Rome for 2/3 nights then a more relaxing holiday ( maybe Tuscany) by a pool for 6/ 7 nights. So flying to Rome and train to Tuscany.\nWe haven’t travelled in a long time, youngest has never been abroad. So those of you who have been, any suggestions ? Or obvious flaws in my plan? Any advice gratefully received.", "link": "facebook.com/groups/1373361046396315/permalink/2204970446568700/", "likes": 1, "comments": [{"username": "Alice Francesca", "comment_text": "You will be able to enjoy a pool probably until Sept 15th, in Tuscany .\nAfter that, generally it gets too cold.\nI am Italian and I highly recommend Pienza (check it online) and the Val d'Orcia region if you would like to experience the real Tuscany"}, {"username": "Alice Francesca", "comment_text": "Ps you can still enjoy the warm natural spa water in BAGNO VIGNONI (HOTEL POSTA MARCUCCI).\nLook for it"}, {"username": "Alice Francesca", "comment_text": "Ps : you will need to rent a car in Siena to reach the Tuscan countryside"}, {"username": "Jenny Payne", "comment_text": "Better book your accommodation as it will still be busy🌻"}, {"username": "Lucrezia Folger", "comment_text": "3 days in Rome if that's the longest option."}]}, {"id": "2204987443233667", "text": "I know this topic can get super annoying but has anyone flown from Catania to Naples directly with Malta Air? Any feedback would be greatly appreciated!\nThanks 💖", "link": "facebook.com/groups/1373361046396315/permalink/2204987443233667/", "likes": 0, "comments": []}, {"id": "2205003006565444", "text": "Does anyone have recommendations on shopping in Sorrento - sunglasses, purses, clothes or other unique places? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2205003006565444/", "likes": 0, "comments": []}, {"id": "2205039389895139", "text": "Looking for best restaurants especially for breakfast near the trevi fountain. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2205039389895139/", "likes": 0, "comments": []}]