[{"id": "2202524880146590", "text": "Early stages of planning a 2024 trip, is Holy week a very busy time in Italy (thinking Vatican probably is but what about other areas?).. In this case it is the last week of March 2024, I know it's colder but trying to beat the summer crowds and restricted by school vacations", "link": "facebook.com/groups/1373361046396315/permalink/2202524880146590/", "likes": 3, "comments": [{"username": "Meredith Williams", "comment_text": "we were there this year! no issues!"}, {"username": "Diane Rogers-Gajewski", "comment_text": "I'm planning our trip also during that time. We are arriving in Naples on March 29th and staying 4 days in sorrento as our home base. Then traveling to Rome for 3 days , sienna for 2 days and Venice for 3 . I'm hoping it won't be too busy ."}, {"username": "Frannie Kaplan", "comment_text": "It's not cold it's quite mild\nMight rain though. Yes it's a popular period but nothing unmanageable"}, {"username": "Brenda Watts", "comment_text": "Enjoy"}]}, {"id": "2202504616815283", "text": "Can someone recommend\na boat tour from Palermo Sicily to Mondello beach and Capo Gallo?", "link": "facebook.com/groups/1373361046396315/permalink/2202504616815283/", "likes": 0, "comments": []}, {"id": "2202509453481466", "text": "I'm looking for recommendations for a restaurant in Rome ideal for a large group (14 people). Anyone have experience with reserving a private room somewhere special? We're staying near Villa Borghese (in late October) so bonus points if we can find something in that general area. Thank you for any suggestions!", "link": "facebook.com/groups/1373361046396315/permalink/2202509453481466/", "likes": 3, "comments": [{"username": "Jill Wolder", "comment_text": "look for a hotel in that area. that is your best choice to accommodate a large private party. You can try making those arrangements with your concierge."}, {"username": "Veronica Solimando-Lynch", "comment_text": "I stayed at the villa borghe’s.\nLuxurious!"}]}, {"id": "2202525656813179", "text": "We are planning our trip to Italy in September and one of our stops is going to be the Amalfi Coast. Any recommendations on where to stay? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2202525656813179/", "likes": 3, "comments": [{"username": "Jill Wolder", "comment_text": "positano.hotel le sireneuse or hotel san pietro. concierges at both of these hotels are top and help you plan your stay. they will make all arrangements for a driver and day excursions"}, {"username": "Laura DeCicco", "comment_text": "Portofino isn’t on the Amalfi coast. For ease of ferry use Positano and Amalfi are good places to stay. If you want to stay close to the AC but not on it, Sorrento is a cheaper option."}, {"username": "Kay Rendall", "comment_text": "There r a no of more reasonable accom. as well. Not sure of vacancies for this yr though."}, {"username": "Nathan Earl Stellenberg", "comment_text": "I've gone with Sorrento"}, {"username": "Renae Larcus", "comment_text": "Sorrento"}]}, {"id": "2202525793479832", "text": "Looking to spend a few days in Emilia-Romagna in February. Recommends for best town to use as a base and/or hotel recommendations", "link": "facebook.com/groups/1373361046396315/permalink/2202525793479832/", "likes": 0, "comments": []}, {"id": "2202526420146436", "text": "Sharing photos of the gorgeous Amalfi Coast from our trip a couple of weeks ago. We stayed in Sant’ Agnello by Sorrento and did a day trip to Positano, Amalfi and Ravello. Cooled off one day paddle boarding!", "link": "facebook.com/groups/1373361046396315/permalink/2202526420146436/", "likes": 147, "comments": [{"username": "Sue Holden", "comment_text": "Beautiful"}, {"username": "Kim Robinson", "comment_text": "Toni Helwig Carol Fuzere Laubach 😍😍"}, {"username": "Rachel Rayne", "comment_text": "Rhonda Woolley"}, {"username": "Dawn Etkin", "comment_text": "Lilly , was it a problem getting from Sant’Agnello to Sorrento every time you needed to take a ferry ? (We have booked in Sant’Agnello for May next year .)"}, {"username": "Jo Ann Schwartz Woodward", "comment_text": "Love these photos"}, {"username": "Bettina Villarreal", "comment_text": "Looks amazing!"}, {"username": "Paula Purcell", "comment_text": "Paula Purcell"}, {"username": "Arlene Soriano Concepcion", "comment_text": "Wow, looks like you had beautiful clear days. We were there about 3 weeks ago, it was very hazy however, beautiful nonetheless."}, {"username": "Judy Grayson", "comment_text": "Spectacular!"}, {"username": "Meghan Tan", "comment_text": "Stunning views; great photos taken!"}, {"username": "Coreen McGuire", "comment_text": "Coreen McGuire"}, {"username": "Sylvia Martinez", "comment_text": "Sandy Rodriguez"}, {"username": "Anna Treviño O'Campo", "comment_text": "How long were you there? I have only 6 days for my visit and trying to narrow down to one city or one area. Beautiful!"}, {"username": "Diane Davis Lawyer", "comment_text": "It's about a 5 minute train ride, Sorrento is the next stop after Sant'Agnello."}, {"username": "Kym Delle Coste", "comment_text": "Lisa Kollmann"}, {"username": "Andy Rodal", "comment_text": "Andy Rodal"}, {"username": "Dave Hennessy", "comment_text": "Claire Fleming"}, {"username": "Ariel Alysha", "comment_text": "These photos are amazing 🤩"}, {"username": "Diana Kiley Amedy", "comment_text": "Debbie Kiley"}]}, {"id": "2202527336813011", "text": "Tonight's dinner in Florance. Delicious 😋", "link": "facebook.com/groups/1373361046396315/permalink/2202527336813011/", "likes": 7, "comments": []}, {"id": "2202548370144241", "text": "Starbucks in Termini", "link": "facebook.com/groups/1373361046396315/permalink/2202548370144241/", "likes": 0, "comments": [{"username": "Katie White-Meade", "comment_text": "Would never go to Starbucks.\nAsk a local where the best coffee is."}, {"username": "Robert Janssens", "comment_text": "too expensive !!!!"}]}, {"id": "2202548596810885", "text": "This group has been so helpful.Thank you\nI see many posts about boat tours from Naples to Capri or Positano.Can any one recommend one for a day trip.Grazie Mille", "link": "facebook.com/groups/1373361046396315/permalink/2202548596810885/", "likes": 0, "comments": []}, {"id": "2202549090144169", "text": "Hi all! We have about 5 days on our trip slated for Florence. We are looking for recommendations on a day trip (see photo) versus over night trip to Cinque Terre. we are primarily interested in swimming andआणखी relaxing on a boat while there- any tours or ideas appreciated!\nAdditionally, we want to do Tuscany and/or Chianti. Again- undecided on a day trip versus staying put a day or two in either city. We are three females-mid thirties and we LOVE wine! Not set on spending any specific amount of time in Florence either- just seems like the best option for day trips.\n\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2202549090144169/", "likes": 17, "comments": [{"username": "JeriLynne Clifford", "comment_text": "Chianti is a part of Tuscany. If you want to do wine adventures I highly recommend hiring a driver. We use\n\nhttps://\nwww.montalcinowi\nnetours.com/"}, {"username": "Bill Ulrich", "comment_text": "CT is far better as an overnight — the 3 hrs travel from Firenze each way, leaves little time for each of the 5 towns, and you'd have to coordinate that w/ specific boat times. Beach area is scarce aside from Monterosso and some rocky bits in Manarola. Swimming / boating can be combined by some of the boat tours. Nord Est of Vernazza (which is in your picture) provides boat + swim trips:\n\nhttps://\nwww.nordest-vern\nazza.it/en/\nwelcome/"}, {"username": "Bill Ulrich", "comment_text": "For Chianti-region wine, \"Tuscan Yes\" is a great company that will pick you up in Florence and give you a wide range of wine experiences all around Tuscany. Letizia and Caterina are prompt, reliable and knowledgeable:\nhttps://\nwww.tuscanyestou\nr.com/"}, {"username": "Lauren Ako", "comment_text": "Loved Cinque Terre. I went with an injured knee. But had to see it. Loved Monterossa."}, {"username": "Avril Meredith", "comment_text": "Cinque Terre is amazing. It definitely deserves more than a day trip. 😊"}, {"username": "Laura DeCicco", "comment_text": "We spent 3 1/2 days in CT in May/June after 4 days in Florence. I wouldn’t suggest a day trip from Florence to CT, if you can-stay at least 1 night in CT but 2 or more would be better. It’s also absolutely beautiful at night when the crowds have gone back to their cruise ships or larger towns"}, {"username": "Andrea Arango", "comment_text": "You can easily do a day trip to tuscany and visit a winery for wine tasting and lunch and make it back to Florence for dinner time. I also did a day trip to milan just to go to QC Terme spa which is one of the top spas! I took an early train, spent time at the spa, had lunch there and came back on the last train. Highly recommend QC Terme milan!"}, {"username": "Anthony Sperduti", "comment_text": "Do not go on this day trip if you want to relax\nTrust me"}, {"username": "Molly Elizabeth", "comment_text": "Cinque Terre deserves more than a day trip. Spend a few days there - you won’t regret it."}, {"username": "Michael Messina", "comment_text": "Cinque terre go for it, not one day trip more if you can"}, {"username": "Yolanda Arena", "comment_text": "Definitely worth it. I went for the day and saw lots, of course it would be great to be able to stay a few days."}, {"username": "Megan Leigh", "comment_text": "It really depends on what you want. CT is extremely overrun by tourists. To the extent that, while beautiful, there is very little authenticity left. (Locals have all but vacated the towns- especially over the last 2 years. It's my understanding that they go back to work but relatively few live there anymore.) It's basically a tourist trap. That may be fine for you & exactly what you're looking for. And that's OK. It's popular for a reason.\n\nChianti is in Tuscany. It will be relaxing in a different way."}, {"username": "Yuko Y Smith", "comment_text": "CT deserves more than day trip. If you like to enjoy relaxing in the sun and ocean and swim, you need at least 3days\n\nI was thinking day trip from Florence first but I am glad that I changed plan to stay a couple days in CT"}, {"username": "Jeff McLellan", "comment_text": "Go to Vernazza and stay for at least one night. Book a private sunset cruise with hellocinqueterr\ne and you will be able to see all the villages from the water and have time for a swim."}, {"username": "Cristiana Cheli", "comment_text": "Toscana has a beautiful seaside too (Maremma coast i.e). It doesn’t really make sense to go to Cinque Terre from Florence for just one day.\nAt least you should spend 3 days at Cinque Terre and 2 in Florence."}, {"username": "Danny Zare", "comment_text": "CT deserves a minimum of 2 nights in either Riomaggiore (1st town) or Monterossa (last town). Trains are super easy between the 5 towns.\n\nFor Tuscany, you’ll need a car. Chianti is stunning and deserves a couple nights in a cute B&B to get the experience. Suggest hiring a car in Florence and going out for a couple days.\n\nYou won’t need more than 2 days in Florence.\n\nSide note; could even do a day trip to Bologna. Food capital of the world. Worth a visit!"}, {"username": "Graham Sherlock", "comment_text": "Stay in Lucca, you'll love it and do day trips"}, {"username": "Lee-Anne Coleman", "comment_text": "Vernazza is best enjoyed morning and evening when all the day trippers leave! Definitely overnight. You won’t regret it!"}, {"username": "Nicole Beaumont", "comment_text": "I did the day trip from Florence with Ciao Florence. It’s great to get a taste, we visited 4 out of 5 of the lands. Some places we had an hour or two, some we only had 30ish minutes. I was satisfied as I didn’t want to commit multiple days of my trip to Cinque Terre. I guess it just depends on what you’re looking for."}, {"username": "Jesy Rose", "comment_text": "This feedback Is incredible. We will plan to stay in CT a couple of days. Any favorite hotels or air bnbs?"}, {"username": "Jesy Rose", "comment_text": "Meg Girard Melisande Girard"}, {"username": "Monica Grieger", "comment_text": "We did 2 days cinque Terre\n1 San Gimignano\n2 days siena\n2 days Florence\n\nWe have hated Florence I would have much rather spend my Time in cinque Terre we actually stayed at Levanto amazing!!\nWe from from CT to Florence hence the stop overs etc"}]}, {"id": "2202554903476921", "text": "Hello. I am looking for help with transportation from my Airbnb in Venice to Marco Polo Airport. We are a family of 5 and are staying a few minutes from San Marco/Giardinetti boat stop. Is the alilaguna my best option (considering budget and trip time)? I understand that the alilaguna will take me directly to the airport. Any tips appreciated. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2202554903476921/", "likes": 0, "comments": []}, {"id": "2202559813476430", "text": "We are heading to Rome and interested in a day trip to the Bomarzo monster garden. We will not have a vehicle. Rome2Rio app shows a bus to Attigliano and taking a taxi from there. Does anyone have experience with this? Are taxis easily found in this area? We would need to do the same for a return trip. Any experience or advice on how to make this work would be appreciated. Thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2202559813476430/", "likes": 0, "comments": [{"username": "Cinzia Berletti", "comment_text": "Following...I would like to do the same thing"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "You can take a train from Roma to Orte (be sure to take a regional train for about 5€ and not a fast train with a change)\nThen there is a bus from Orte to Viterbo that stops in Bomarzo."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2202561156809629", "text": "Has anyone taken a Venetian glass blowing class? If so, any recommendations on where to buy tickets?", "link": "facebook.com/groups/1373361046396315/permalink/2202561156809629/", "likes": 0, "comments": []}, {"id": "2202563323476079", "text": "Looking for a great place in Rome for part of our honeymoon. I love boutique hotels and want a great location", "link": "facebook.com/groups/1373361046396315/permalink/2202563323476079/", "likes": 0, "comments": []}, {"id": "2201628436902901", "text": "This will be my first time to Italy along with my children and grandchildren. We are going in April, 2024 and starting from Milan. Would like to travel to other cities in Italy bye taking the train. Heard it’s very easy to get around Italy. Haven’t finalized plans yet but thinking of going to Rome, Florence, Venice and maybe Amalfi coast? Is itआणखी better to stay in hotels or Air Bnb? Thinking of staying 2-3 days in each place? Open to other suggestions? So excited about going and can’t wait to go!! Also, so excited to be part of this group to learn from all of you and your experiences!! Looking forward to traveling again and would appreciate any feedback from all whether good or bad. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2201628436902901/", "likes": 1, "comments": [{"username": "Alice Francesca", "comment_text": "Can you fly into Rome instead? Milan is the least Italian of Italy.\nFor Venice, Florence or Rome one lifetime would not be enough to see it all..but at least 3/ 4 days would work the first time"}, {"username": "Chiara Normanno", "comment_text": "I agree with Alice, if pissible I would fly into Venice and start my tour from there, or do the reverse flying into Naples. You could also choose Rome as your base. As for hotels vs Airbnb it's up to you and your needs, look for the best prices per location."}, {"username": "Vanessa Durkin", "comment_text": "Book tickets on line before you go its cheaper and very easy trainitalua or omio great way to get between cities and well organised. We flew to venice first time very easy to get everywhere from station and buses outside very cheal to hotel think about 2 euris i woukd do venice flirence rome sorrento naples flyy out if naples and look for hotels on booking.com or trip advusor some you can pay at the hotel so you can cancel if necessary with no hassles.have a great time"}, {"username": "Grace Scinto", "comment_text": "Depending on how much time you have, I would spend a day or two in Como as it’s is close to Milan.\nThen allow around 4 hours travelling between each city and at least 3 full days each.\nIf the children are not too young they will love the high speed trains. Make sure they can handle their own luggage and keep it to one wheeled suitcase and small daypack each.\nYouth hostels are relatively cheap and have family rooms. Do some research and see what they are like.\nApartments and Air BnB might suit your purposes better for things like laundry and cheaper for eating.\nGive yourself time to just soak in the atmosphere. Grab a gelato and sit on some steps or a low wall somewhere."}]}, {"id": "2201700440229034", "text": "West Jet… It is worth paying for a seat for the first leg 1.5 hrs to ensure carry on space to avoid checking? 2nd leg we purchased exit row.\nI have never flown them before.\nDo they still board the plane from back to front??\n\nTIA!", "link": "facebook.com/groups/1373361046396315/permalink/2201700440229034/", "likes": 1, "comments": [{"username": "Robin Burrell", "comment_text": "Of course"}, {"username": "Caroline Sands Hugo", "comment_text": "No,they give you a zone,could be front,middle etc.they also load basically isle seats towards the end."}, {"username": "Mandie Cowan", "comment_text": "We booked the longer second leg. We opted out of the shorter flight. I was just trying to save some cash. Lol"}, {"username": "Kristina Russell", "comment_text": "We just returned from our trip and flew westjet. We didn’t have any issues with carryon space, despite the 4 of us travelling carry on only. We got free seat selection, but I’m not sure that made any difference, as I didn’t know what seating zone that would put us in. We were usually zone 3, but even for zone 4 (out of 4), there was room."}]}, {"id": "2202351206830624", "text": "Hi everyone!\nLooking for some advice. Our hotel in Venice was booked through a package where we didn’t get to choose our accommodations. It is the “Smart Hotel Holiday Venice” which is inland and Google mapsआणखी shows it to be a 40 minute to one hour journey to St Marks Square. We have tours and things planned and that is the meeting place for all of them. We expected our hotel to be close by to everything we are doing. When I called the company we booked with I was told that “anything in that area is a 10 minute drive” which makes no sense? I’ve called twice to complain and ask to be moved to a different hotel but they refuse to do anything. So - is the travelling between as bad as it looks? I’m considering just paying out of pocket for alternative accommodations that are closer.\nWe are going to see a few different cities during our trip but Venice is first and this whole thing is stressing me out. I don’t want to start our trip on a bad foot.\nAny advice appreciated. TIA ❤️", "link": "facebook.com/groups/1373361046396315/permalink/2202351206830624/", "likes": 12, "comments": [{"username": "Maria NoBa", "comment_text": "I suggest this one\n\nCentro Culturale Don Orione Artigianelli\nIt is very well located and very clean."}, {"username": "Danielle Ritchie", "comment_text": "I am in same situation - looks to be in same location, from what I am reading, it seems an easy and quick journey into Venice from that area.."}, {"username": "Lynne Maree", "comment_text": "I have found that organised tours never stay in the best places. We stayed in Mestre as part of our tour. The hotel was fine, and bus to and from Venice easy. Loved Venice, and was great to be told the history and see the main sights. Alsovisited Murano and Burano as part of tour. But we are going again in September on our own, and have booked an hotel in Venice, on a canal.\nThe hotel in Rome was also great, but miles from everything."}, {"username": "Lynne Maree", "comment_text": "I have just realised my profile pic was actually taken in a restaurant in Burano!"}, {"username": "Kelsey Larabie", "comment_text": "We stayed in Mestre, right on the bus line. We thought it was quick and easy and affordable to get to Venice. Bus went late too, so it wasn’t a trouble to get off island late."}, {"username": "Jennifer Mastruserio Groneck", "comment_text": "Hotel Bel Sito Venezia\nhttps://\nwww.hotelbelsito\nvenezia.it/ › ... very central, reasonable, great staff and breakfast. You can walk to either end and points in between. No transit needed other than getting there once. Even if you only have one night. Nights in Venice are so different."}, {"username": "Catalina Daniel", "comment_text": "ihmmm… Id say thats a trekk!! but its gonna cost ya! decide whats better for you. Paying a water taxi to come in everyday or paying to stay local??"}, {"username": "Michele Liggett", "comment_text": "Our hotel Al Ponte Mocenigo is in San Polo area of Venice close to everything but in a quiet area. Close to a vaporetto stop."}, {"username": "Frank Hunt", "comment_text": "Mestre is definitely not Venice, that why they call it Mestre. I’ve been to both and I wouldn’t stay in Mestre in a million years. Cut your losses and stay in Venice, you won’t be disappointed."}, {"username": "Cynthia Marie", "comment_text": "I have a hotel in the U.S. I have travel agents book our property though a package. Unfortunately the guests do not realize the whole reservation system they use is Expedia . It states right on the booking confirmation , NOT to mention “Expedia “ to the guest. It’s dishonest as far as I’m concerned.\nI can’t tell you, have many European travel agents use Expedia for making reservations for their customers. You are always better off making your own reservations. They are not doing anything special for you. I’m sorry you have to deal with this while on vacation. Also one more thing to mention is we are cut out of an additional 10% of our rates with these package prices that I have to assume goes to the travel agent. 😥 my rates on Expedia are higher then other booking websites because of this practice. I lean towards Booking dot com when I travel abroad ."}, {"username": "निनावी सहभागी", "comment_text": "Thanks everyone for the info it is much appreciated! I normally would have just booked everything myself but it is my honeymoon trip and I was just wiped from wedding planning. Luckily the rest of the hotels booked look pretty central. It looks like we’re going to look for better accommodations.\nI don’t want to stress about getting back and forth even though some people are saying it’s not too bad."}, {"username": "Casarine Temple", "comment_text": "We originally booked a Rome , Florence , Venice tour that included hotels . We did a little research on the hotels and were ok with all but one … that one did but have an elevator and could not guarantee us a room on ground floor. We offered to pay extra for a ground floor room but they declined . So we decided to not go with that tour and booked tours and hotels ourselves and are happier that we did . We had already booked our flights so that was a non issue ."}, {"username": "David King", "comment_text": "We stayed at the Hotel Palazzo Barbarigo (palazzobarbarig\no.com) and it was worth every penny!\nJust a 2 minute walk to the Rialto Bridge and a 5-10 minute walk to St. Mark’s Square.\n\nVenice is extremely expensive compared to other cities, so if you switch and book your own hotel, it’s gonna cost some $$, but worth it to salvage your plans!!"}, {"username": "Tracey Knight", "comment_text": "I would taxi (10mins maybe 15-20 euro) to Venice Mestre train station and catch the train to Venice Santa Lucia train station. Train ticket is about 2 euro and train ride is 11 minutes."}, {"username": "Maureen Rebello Hagerty", "comment_text": "That’s because you’re on mainland “Venice” (Mestre) not the island. I learned to be very careful when I was looking for airbnbs in Venice! And you can’t drive on the island of venice."}, {"username": "Diana Smith", "comment_text": "Get a hotel in Verona, is half hr by train from Venice, an cost half as much."}, {"username": "Bev Madill", "comment_text": "To be honest if you stay in that area you're going to spend a lot of time getting to the places you want to see in Venice itself plus you'll miss the atmosphere of staying in the area. I feel for you, particularly as it seems the company has sort of misled you. Last year we stayed in an apartment about 5 mins walk to St Marks. It was booked through Truly Venice Apartments. I hope you can sort all this out."}, {"username": "Etschi Bruckner", "comment_text": "you´ll miss the lovely atmosphere in Venezia in the evening when you stay in Mestre - and apart from the boring trip into town, it´s an anticlimax to go back to Mestre - it´s quite ugly!"}, {"username": "Jacqui Hakes", "comment_text": "Everyone’s different - I wouldn’t be happy staying there - the Venice moments I loved most were later in evening wandering - shops closed , alongside canals & deserted streets. If it was me I’d feel frustrated every day o had to leave , and the time of transfers etc would take away from my wandering."}, {"username": "Maria Centritto-Conway", "comment_text": "Mestre is a short train ride away but do try to be closer.\nWe are in a nice resort and have to shuttle back and forth to St. Mark’s Square. I would have preferred something small on the main island with a kitchen and commotion from the alleys. I’m not a resort type of gal, but we made arrangements late and were using hubby’s Marriott points and have 2 children with us.\nI agree with others who say to mention this in a review."}, {"username": "Bellafab Fabrizio", "comment_text": "Can u not pay extra and upgrade ur accomodation"}, {"username": "Bellafab Fabrizio", "comment_text": "And italians 10mintes is about an hour. Everything is 10minutes in itsly"}, {"username": "Paula Pittman", "comment_text": "I loved this hotel, Ca Pisani in Dursaduro area. It’s gorgeous, incredible buffet breakfast included, and very near the Academia bridge and the Guggenheim gallery.\nIt’s your honeymoon, if you can find a lovely hotel inside Venice I would recommend splurging and staying overnight in the city."}, {"username": "Renae Larcus", "comment_text": "We had a similar situation in Prague and it was a big hassle. Yes, Venice is a walking city, but you don’t want to walk that far just to get to things you want to see. Actually, it would be a train ride just to get into Venice! I would try to get something more central. Mestre is not Venice!"}, {"username": "Trish Donison", "comment_text": "Was this tour Air Canada Vacations by chance?"}, {"username": "Katrina Scott", "comment_text": "Personally I wouldn’t stay outside of Venice when going to Venice, it’s so unique I would have been disappointed if we didn’t stay in the city itself"}, {"username": "Phyllis Snyder", "comment_text": "I’m planning my Italy trip myself- and have learned so much from reading Rick Steve’s Italy guide- and videos- he warned about not staying close enough to sites to see. Some travel companies unfortunately often put their clients too far from the action- requiring long transportation.\nIt’s cheaper for them and they get a kick back on doing this! I’d book something closer so you have an enjoyable experience. Do give this company a bad review!"}, {"username": "Dawn Marie", "comment_text": "Hi. You need to do some research, ask the hotel for the shuttle schedule, how often does the hotel shuttle run because the shuttle is 10 mins from the train station, but the tram is 25 mins. How long is the train ride and how long is the walk to meet your tour. Staying in Maestre is a savings. I was going to stay at hotel Antony and instead stayed at Hotel Le Isole near St. Marks, 1k euro for 2 nights, mid May but no trains or shuttles or trams or bridges to carry my luggage"}, {"username": "Federico Permutti", "comment_text": "To be honest, as a Venetian I’d be wary of any company speaking of a “10-minute drive to anywhere” when referring to Venice specifically. I hope they know that any vehicle on wheels won’t get you past Piazzale Roma. I suppose they can (sort of) get away with this on account of the fact that Venice and Mestre are, technically, a single municipality. Of course, they are very different places and realities.\n\nHaving said that, there is a tram that will get you to Piazzale Roma in a little under 30 minutes, and buses in the late evening hours. It’s doable, if a bit of a hassle, especially considering that you’ll have to get to St Mark’s Square from there. Whether you get there on foot or take the vaporetto (waterbus), it’s going to take you at least another half hour - if you walk fairly fast and know your way around."}, {"username": "Valerie Dalal", "comment_text": "Some of these tour companies mislead people. Same thing happened to us traveling through Italy. Most hotels were not even to close proximity as stated on the website - lost precious time and incurred extra costs for traveling."}, {"username": "Elena Eugeni", "comment_text": "The hotel is in Mestre, a different city. So yes, it's at least half an hour. It's way cheaper than Venice and also a lot less crowded, but it's not the most comfortable choice"}, {"username": "Bronny Proud", "comment_text": "Don’t stress. It will work out. But yes, I would suggest to find accommodation on the island as it will be so much easier for you , plus it is absolutely enchanting in Venice."}, {"username": "Olaniran Amusan", "comment_text": "Thank you for sharing!!"}, {"username": "Linda Meneghello", "comment_text": "Stayed in Maestre and took transit to Venice- it is very easy and much cheaper than Venice City"}, {"username": "Esther Starren", "comment_text": "Mestre is not Venice. Totally different atmosphere.."}, {"username": "Shelley McGlothen Zeigler", "comment_text": "You’d have to take the train to Venice first and then a vaporetta to St. marks. I think it will easily take that long. Tour companies book in Mestre to save money. I did it once when I was younger on a tour. It’s not impossible. Just have to plan time and make sure you make it back across."}, {"username": "Kirsten Marie", "comment_text": "How many nights are you staying in the hotel? Traveling back and forth from Mestre to Venice would be time consuming and frustrating one would have to work around water taxis or water vaporettos schedules or the train schedule etc. We absolutely loved staying in Venice. If you did decide to book another place I would try to stay outside of the square where it is quieter and less expensive."}, {"username": "Delia Miscella Wroblewski", "comment_text": "I’ll remember to never use that tour group. It’s really unfair. Would it be very expensive for you to book a closer hotel? How about a car service to Venice and then all you have to do is get to St. Mark’s? I would be very stressed. I hope it works out well and that the hotels in the other cities are in reasonable areas."}, {"username": "Bill Elias", "comment_text": "Their website is sketchy. It says they have a shuttle that will get you there in 10 minutes, which isn’t possible. Maybe they mean it takes you to connecting transit?\n\nCommuting to a vacation isn’t the best - and you’ll then be paying for transit on top of things.\n\nI’d pus to get a refund for that portion and book your own accommodation.\n\nhttps://\nwww.hotelholiday\nvenice.com/\nlocation/"}, {"username": "Laura Uribe", "comment_text": "If you can afford it, I would absolutely book another hotel in Venice and leave a scathing review for the tour company after your trip is done."}, {"username": "Jeff McLellan", "comment_text": "That sucks. I always encourage people to avoid tours because this is not the first time I have heard something similar. So easy to do yourself nowadays. Change it if you can."}, {"username": "Matteo Basile", "comment_text": "I checked the maps and seems your hotel is in Mestre. Actually should be not so bad but this specific hotel is also very far from Mestre train station. I suggest to check directly with the hotel how much can be a taxi for Venice piazzale Roma where you have to take a ferry to San Marco. Consider just the ferry is about 7€ per person per ride. If this solution is too expensive so you can book another accommodation.\nAnyway if is a tour they should provide for the transportation too… or not?"}, {"username": "Giovanni Pianigiani", "comment_text": "Venice is like Disney world: if you decide to spend a few days there, you'll want to be as close as possible to the attractions, to be the first to ride them and stay in until you're exhausted and ready to crash in your bed. Having to drive in and out from your Orlando downtown hotel is going to spoil much of the fun"}, {"username": "Debbie Potter", "comment_text": "This is the exact reason why I book everything myself....you never know what you're gonna get when you go through a third party."}, {"username": "Kim Finger McCormack", "comment_text": "It doesn’t look to be too far outside with a free shuttle. Maps says 14 min drive to near the train station. Then you would have to get a water taxi or walk to St. Marks Sq."}, {"username": "Stephanie Power", "comment_text": "We recently stayed in Mestre and found the city bus quite easy to navigate to get to Venice. Maybe that could be an option? Best of luck"}]}, {"id": "2202325396833205", "text": "Any restaurant recommendations\nfor vegetarians (no eggs or fish) in Rome?", "link": "facebook.com/groups/1373361046396315/permalink/2202325396833205/", "likes": 1, "comments": [{"username": "David Sapienza", "comment_text": "Origano\nCampo De’ Fiori. There are vegan restaurants near there too."}, {"username": "Laura Giammichele", "comment_text": "https://\nwww.google.com/\nsearch?q=ristora\nnti+vegeta+roma\n&oq=ristoranti+\nvegeta+roma&aqs\n=chrome..69i57j\n33i160.9247j0j1\n&client=ms-andr\noid-samsung-ss&\nsourceid=chrome\n-mobile&ie=UTF-\n8&chrome_dse_at\ntribution=1#tre\nx=m_dg:1,m_r:1,\nm_t:gwp,rc_q:ri\nstoranti%2520ve\ngeta%2520roma,r\nc_ui:9,ru_gwp:0\n%252C6,ru_q:ris\ntoranti%2520veg\neta%2520roma,tr\nex_id:x6sZmd"}, {"username": "Laura Giammichele", "comment_text": "\"Rifugio romano\" For me is the best..."}, {"username": "Doreen Patel", "comment_text": "Thank you so much! 😊"}]}, {"id": "2202355000163578", "text": "If you had two nights in Rome. What would be your go to restaurants, keeping in mind that one night we have a tour at the Colosseum at 3:45 PM?? Also, keeping in mind that I have a 16-year-old that will beआणखी celebrating her 17th birthday. We want something authentic. We live in New York. Not looking for fancy or touristy. Looking for memorable.", "link": "facebook.com/groups/1373361046396315/permalink/2202355000163578/", "likes": 3, "comments": [{"username": "Laura DeCicco", "comment_text": "Armando al Pantheon, Da Enzo or Roscioli"}, {"username": "Laura Caputo", "comment_text": "Il sorpasso"}, {"username": "Felicia LoCascio Whitney", "comment_text": "Rhinoceros"}, {"username": "Jan Armstrong", "comment_text": "Tonnarello or Emma"}, {"username": "Darren Rogers", "comment_text": "Pianostrada, Rimessa Roscioli, or good value/\nexperience Maccheroni followed gelato at Gioliti's"}, {"username": "Jeff McLellan", "comment_text": "Tonnarello would be our go to. Might be a bit of a wait but if you are early enough shouldn’t be long."}, {"username": "Elena Innocenti", "comment_text": "La Villetta dal 1940. Is in Via della Piramide Cestia near aventino.\nIs authentic roman cuisine, not turistic, typical pasta dishes (carbonara, amatriciana, cacio e pepe, gricia) are a must, served in a “cofana” a very big bowl.\nAlso remarkable the mix appetizer in a chopping board with different kinds of cheese and cold cuts and the hot appetizer like meatball, beans with rinds and other typical roman dishes.\nI'm Roman and it's one of my favorites, it's out of the tourist area, but I really like it.\nIf you take metro B at colosseo, is 2 stop far away (piramide) and about 300 meters walking distance."}, {"username": "Pam Armenia O'Brien", "comment_text": "This place is walking distance to colosseum. We had a fantastic lunch there."}, {"username": "Laura Uribe", "comment_text": "Be sure to read recent reviews as a lot of places people have loved through the years, no longer have the quality food they once had."}, {"username": "Andrea Newman Rosenblum", "comment_text": "I asked my travel agent, who has planned a trip that is unbelievable, what restaurants she recommends and that is one thing she won’t do. She said a chef that made a restaurant #1 today could leave to go to xyz tomorrow and it could be horrible next week. Basically she didn’t want to give a crappy rec. She said that’s what the concierge is for."}, {"username": "Valentina Saltarelli", "comment_text": "I ‘m from Rome,\nThese are the places that I recommend.\nNo Touristy , good quality Rimessa Roscioli\nFlavio al velavevodetto (Testaccio)\nFafiunche (Monti area)\nOsteria da Fortunata (Pellegrino)\nPizzeria ai Marmi Tonnarello"}, {"username": "Lisa Rotondi", "comment_text": "I had this delicious pasta with eggplant, tomatoes, and olives at Tonnarello. The church of Sta. Maria in Trastevere is just around the corner and a stunner, too."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Check Taverna Agapè and Taverna Trilussa for very good traditional food, Eggs for something traditional with a modern twist.\nAlso check Renato al Ghetto, Roscioli salumeria con cucina (for something on the go at lunch), Felice a Testaccio."}, {"username": "Jeff Gentner EA", "comment_text": "Stroll through the Trastevere area. Many great restaurants. Like a small town in a big city."}]}, {"id": "2202362940162784", "text": "Planning a cruise in May and trying to pick an itinerary that would utilize our time best. One itinerary leaves from Barcelona and the other itinerary leaves from Rome. Planning on arriving a day or two early before we board the ship to site see. Conflicted on which one we should pick. Any recommendations?", "link": "facebook.com/groups/1373361046396315/permalink/2202362940162784/", "likes": 2, "comments": [{"username": "Robert Bélair", "comment_text": "The port in Barcelona is very close to the city centre as for Rome you are by train or transportation more than 1 hour to 1hr 20 to city centre.\nBarcelona is an amazing city.\nI have left cruises from both.\nWe have finished a cruise in Rome and then stayed for 5 days.\nDepending where you finish."}]}, {"id": "2202364403495971", "text": "In Positano are there any 🚕 services or Uber to get you back to your Airbnb/hotel in the evenings of nightlife 🍷🍸in the village? Just don't think we could walk all those steps after an evening of drinking alcohol...yes, we are drinkers.\nWhat were your experiences of how you managed to get around in Positano?", "link": "facebook.com/groups/1373361046396315/permalink/2202364403495971/", "likes": 12, "comments": [{"username": "Nicole Meadows", "comment_text": "At a certain point, taxis and Ubers can’t get into the areas where restaurants are and you still have to go down or upstairs to your restaurant."}, {"username": "Sandy Radican Shikaly", "comment_text": "There is no Uber in Positano"}, {"username": "Renae Larcus", "comment_text": "It’s so small. You can walk. Cars can’t even get into some of the roads"}, {"username": "Sonia Scotto Lubrano", "comment_text": "You still have to walk up. No cars allowed after a certain point."}, {"username": "Pate Mears", "comment_text": "I was so determined to go to Positano for a big birthday, and I was on crutches. I took all those steps up and down. In the evening, we got a recommended driver from the hotel. It is one of my favorite places in Italy and the world. I have travelled a lot, too. Go and enjoy."}, {"username": "Larry M Murray", "comment_text": "Cabs in Positano are expensive"}, {"username": "Carmela Noble", "comment_text": "There is one road that goes through positano and then loops back around and it is very windy and difficult. I can’t see there being Uber or taxis. It’s all quite walkable."}, {"username": "Brad Nelsen", "comment_text": "There is a local ‘Interno Positano’ bus but you need to walk a few minutes up to the road. No Uber and taxis aren’t frequent and are expensive."}, {"username": "Debbie Potter", "comment_text": "Thanks to all who were nice to give me helpful advice and to make sure I was gonna be safe."}, {"username": "Charleen Siegler Schuss", "comment_text": "Don't walk. It's a very narrow street with crazy drivers and scooters"}, {"username": "Joseph DellaFave", "comment_text": "If you’re struggling with an addiction to alcohol, help is just a phone call away, thanks to the 24 –hour AA hotlines."}, {"username": "Laura DeCicco", "comment_text": "There’s no place in Positano a car can go to bring you up the stairs, that’s a job for your feet"}, {"username": "Lianne Buchanan", "comment_text": "It’s a nightmare! We were there last week and it was so hard to get around! Buses were completely full and people were queuing for hours! There were hardly any taxis and when a taxi did come they could charge a fortune and did!\nTotal nightmare! We ended up having to pay euro 50 to go a few km’s!!!!"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Depending on where your hotel is located, there are taxis ….. ￼ enjoy your drinks, I know we di￼d ! But those stairs ugh !"}, {"username": "Haven Houllis Chrysakis", "comment_text": "There is a taxi company and you call the central number and they will send one. It can only take you so far in but it’s better than nothing. I just left today and my girls used it for night time they go 24 hrs here is the number +39 3316891999"}, {"username": "Dianne Ellis Patureau", "comment_text": "All of the Amalfi villages are on cliffs. There was a ton of stone steps everywhere. Maybe pick a Positano restaurant about half way down??"}, {"username": "Cindy Giampietro", "comment_text": "We found the walk up the road much easier than the stairs - and it’s a very pretty walk. Just have to be aware of vehicles at all times and stay to the side of the road. It was one-way traffic where we were, so not that hard to see or hear them coming."}, {"username": "Terina Kwiatkowski", "comment_text": "Taxi to closest spot and walk down much easier lol and definitely enjoy all the wine you can makes walk more enjoyable 🤣🥂"}, {"username": "Jeanette Smith Floyd", "comment_text": "Everyone walks … yes there is taxi & car service but expensive for a short drive. We used this service for private driver up to Ravello & back and also from Naples train station to Positano and back to Naples airport"}, {"username": "Lynette Leone Watkins", "comment_text": "Danny Watkins"}, {"username": "Joshua Pickles", "comment_text": "Sleep on the beach 😂"}, {"username": "Kay Rendall", "comment_text": "Depends where your hotel is, there r a no of good restaurants on the road along the top without going down all the stairs to the beach. This is where I have dinner. I enjoy lunch in the beach area some days. If u share your hotel with me I can give u better advice. September I will be back for 9th time. 3 weeks."}, {"username": "Etschi Bruckner", "comment_text": "there´s not a lot of nightlife anyway - just book a nice place with a terrace overlooking the whole place and drink at home, where bed & toilet are in stumbling distance. double bonus - it´s cheaper anyway and you don´t have to face the crowds!"}, {"username": "Sheila Hagan Holst", "comment_text": "We stayed up in the hills of Positano for five days and came down into the main hub for dinner and drinks nightly. The city bus will bring you back up as close as you can get to your place but you may still have a few hundred steps to climb. Our bus dropped us off right outside The International, where we would have our final nightcap before our climb. Good workout so you can eat more pasta the next day 😉 Hold on to the railing - you’ll be fine 🍷"}]}, {"id": "2202367686828976", "text": "Can somebody confirm that for train tickets, we can use bar code on phone am so not need to print a ticket. Also, do we have to validate if on phone or wait for conductor? Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2202367686828976/", "likes": 0, "comments": [{"username": "Chiara Normanno", "comment_text": "Absolutely, that's the only way I do it and I'm a local."}, {"username": "Manuela Marinello", "comment_text": "Yes, you can"}]}, {"id": "2202367770162301", "text": "My husband and I are going now the first of October, can you please give me ideas of quality places to stay in Rome, Florence, and Sorrento,we are planning days trips from each place. My husband would like good breakfasts if possible, I want nice and good location.\nThank you in advance.\nAnd do you book your excursions ahead of time or when you arrive?", "link": "facebook.com/groups/1373361046396315/permalink/2202367770162301/", "likes": 5, "comments": [{"username": "Maria D'Ambrosio Panzera", "comment_text": "."}, {"username": "Bill Casper", "comment_text": "Look in BOOKING or AIR BNB’S"}, {"username": "Penny Bellofatto Westberry", "comment_text": "We enjoyed the W in Rome."}, {"username": "Steve Grossman", "comment_text": "Get on booking dot com\nType in the name of the city and the price range looking for. Click on the individual hotels and read all of the reviews for those particular hotels. This is the best way to find what you want"}, {"username": "Renae Larcus", "comment_text": "In Florence we loved Hotel Roma. Great breakfasts, close to the train station and you can walk anywhere from there. Concierge helped us with an excursion to Tuscany. Walkabout Tours."}, {"username": "Bea Kuckens", "comment_text": "You might mention your budget so that recommendations\nare something you would truly consider..."}, {"username": "Sue Sherwood", "comment_text": "https://\nwww.tripadvisor.\ncom/\nHotel_Review-g18\n7791-d203130-Re\nviews-Hotel_Can\nada_BW_Premier_\nCollection-Rome\n_Lazio.html"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "If an American/\nBritish style breakfast is important make sure you look for hotels that provide it. Italians have a coffee and a pastry for breakfast, no bacon, eggs and pancakes."}, {"username": "Valerie Collanton", "comment_text": "Last October I stayed at Eitch Borromini in Rome. Beautiful hotel. Very convenient location right behind Piazza Navona."}, {"username": "Darren Rogers", "comment_text": "I still think of the Italian breakfast at Caffe Olimpia - Fresh OJ, Tramezzini, Doppio & Cornetti - EUR12..."}, {"username": "Charleen Siegler Schuss", "comment_text": "Rome Hotel Damaso near Campo died Fiori"}, {"username": "Annick Hupperetz", "comment_text": "When we were on the Amalfi Coast we stayed in Meta di Sorrento right on the seaside. The hotel offered a shuttle bus to Sorrento where the piazza by the ocean is. From that point you can take the Sita bus to Positano and Amalfi. The train to Napoli and Pompeii and the boat to Capri, Ischa and Napoli.\n\nI wish you a great vacation. We will be in Italy next May."}, {"username": "Andrea Newman Rosenblum", "comment_text": "We are staying at Rocco Forte Hotels in both Rome & Florence and they are supposed to be beautiful!"}, {"username": "Caryn Goode", "comment_text": "Rome - Hotel Teatro Pace & Florence, Realis Uffizi. Both terrific locations."}, {"username": "Diane Davis Lawyer", "comment_text": "Book quickly. The Ryder Cup is Sept. 29-Oct 1. It's going to bring folks in the week before and week after. Rooms are going to be more and more scarce in Rome and surrounding areas."}, {"username": "Noreen Velasquez Gabaldon", "comment_text": "Thank you all for your input. You helped me in the right direction."}, {"username": "Kally Trahearn", "comment_text": "I've stayed at:\nRome - Hotel Locarno - amazing but not cheap, not too far from Spanish Steps\nSorrento - Hotel Plaza - less than 1 min walk from main square\n\nBoth hotels do a good continental breakfast - plenty of choices.\nHaven't been to Florence, so can't suggest anywhere, but book up soon as places are usually sold out quickly.\nWherever you stay, enjoy it all."}]}, {"id": "2202374726828272", "text": "Is the five day pass in Florence for Uffizi, Pitti Palace, Boboli Gardens, and the Museum of the Opificio delle Pietre Dure (that's a mouthful!) for 39E each a good idea? We will only be able to sightsee for a day and a half, then we are off to Sant'Agnello/Sorrento.\n\nThe Uffizi, alone, is 26E each for when we will be there in mid-September.\n\nThanks!", "link": "facebook.com/groups/1373361046396315/permalink/2202374726828272/", "likes": 3, "comments": [{"username": "Lushan Yao", "comment_text": "I think it depends if you have time to visit all of them. The official Uffizi ticket includes two smaller museums. One of them is the Opificio delle Pietre Dure which is one of my favorite museums in Florence."}, {"username": "Scott Fridkin", "comment_text": "I bought the 5 day pass, for our length of stay. I thought it to be the best option. The only timed entry you have to select is for The Uffizi, the other museums are whenever you want to go. Academia Museum for David is a separate purchase."}, {"username": "Crystal King", "comment_text": "We bought it and loved it, we forgot to make reservations for the Uffizi and they got us in the next day. We went to 8 museums in 2 1/2 days. So much to see!"}, {"username": "Jennifer Walp Rydholm", "comment_text": "I bought it as the price was good if you intend to see two or more of them imo. I don’t need 5 days but it seemed like the better deal than buying them all separate."}, {"username": "Michela Zanni", "comment_text": "I'm not sure, but few years there was a 72 hours pass (Firenzecard)"}]}, {"id": "2202377353494676", "text": "Thinking about a private tour from Amalfi to Pompeii and surrounding areas. Is Friday or Sunday the best day for that?\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2202377353494676/", "likes": 0, "comments": [{"username": "Chiara Normanno", "comment_text": "Weekends may be busy"}, {"username": "Manuela Marinello", "comment_text": "Better during the week, but it’s high season so it won’t make much difference"}]}, {"id": "2202379476827797", "text": "We are traveling to Amalfi in September. Looking at a trip to Capri. Would Friday or Sunday be best for that trip\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2202379476827797/", "likes": 0, "comments": [{"username": "Steve Grossman", "comment_text": "Whichever day you go have lunch at the hotel villa brunella"}]}, {"id": "2202379516827793", "text": "Thank you all for your guidance and feedback! Planning on going to Rome in May and looking for a recommendation for a good hotel. Where did you stay and did you like it? What was the best and worst part? Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2202379516827793/", "likes": 0, "comments": [{"username": "Darren Rogers", "comment_text": "We stayed at Chapter Roma - 10 minute walking to most attractions, great restaurants around and quick walk across Ponte Garibaldi to Trastevere."}]}, {"id": "2202386173493794", "text": "Hi! Does anyone know a place to store your luggage safely in Venice?", "link": "facebook.com/groups/1373361046396315/permalink/2202386173493794/", "likes": 0, "comments": []}, {"id": "2202394676826277", "text": "Lago Albano🌌", "link": "facebook.com/groups/1373361046396315/permalink/2202394676826277/", "likes": 0, "comments": []}, {"id": "2202411483491263", "text": "Hi everyone, admin pls take down post if not appropriate- since I’ve read about luggages, etc may I ask the group which travel insurance company would you vouch for- will be touring Italy for 3 2weeks. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2202411483491263/", "likes": 0, "comments": [{"username": "Dave Conroy", "comment_text": "If you have access online to any insurance comparison sites I strongly suggest check options according to budget and needs. Quotes can vary hugely as can scores for satisfaction. Also, if you have pre existing medical conditions there are some good specialist insurance companies. I use best cover for best price with best customer feedback. Insurance can be quite niche so general recommendation is not necessarily that helpful. IMO."}]}, {"id": "2202415273490884", "text": "Hi! We’re staying on the outskirts of Florence in Reggello but would like to visit for the day. We have a car but someone suggested that we are best to do a ‘park and ride’. Does anyone have any details or address of where this might be?\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2202415273490884/", "likes": 0, "comments": [{"username": "AgAnne Chrzanowska", "comment_text": "You can park at Villa Costanza parking and use the tram to get to the centre. An alternative is a parking at Fortezza da Basso and a walk to the centre. Villa Costanza https://\nmaps.app.goo.gl/\nyMRTfwdC5iREyCUM\n8\nParking at the Fortezza https://\nmaps.app.goo.gl/\nucairbt2aQqQDh42\n9"}]}, {"id": "2202416230157455", "text": "So in Florence for two days and having a blast. Not to hot not to crowded, don’t feel worried about pick pocketing. Amazing food and had a great golf cart tour with Tucci. We laughed and sang. Learned a lot about Tucci love Florence and stoped at a wine window had a limoncello spritzer.", "link": "facebook.com/groups/1373361046396315/permalink/2202416230157455/", "likes": 6, "comments": [{"username": "Ruth Akutu Maccarthy", "comment_text": "Very nice 👍"}, {"username": "Lorraine May Buttimore", "comment_text": "Wow! That's awesome!"}, {"username": "Richard Gustafson", "comment_text": "Have any contact info for Tucci?"}, {"username": "Alessandro Iannelli", "comment_text": "I've heard about this Tucci guy, and to be honest, I'm not particularly fond of him. I don't dislike him either, but I think it is a bit incoherent to act like some sort of expert of italian culture, or at least herald of it, when you don't know the language."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2202419860157092", "text": "Looking for restaurant recommendations Venice ..", "link": "facebook.com/groups/1373361046396315/permalink/2202419860157092/", "likes": 5, "comments": [{"username": "Larisa Runce", "comment_text": "👂🏻"}, {"username": "Mike Guluk", "comment_text": "try the italian restaurants they should be pretty good"}, {"username": "Robert Bélair", "comment_text": "Trattoria Bar Pontini\nExcellent food, reservations recommended"}, {"username": "Kasia MacDuda", "comment_text": "This was one we loved. Murano."}, {"username": "Mat PO", "comment_text": "If you want fancy, try Oro…"}, {"username": "Denisa Ioana", "comment_text": "Ristorante Ca Dolfin"}, {"username": "Laura Steuart", "comment_text": "We just went to Restaurante Riviera 2 nights ago and had a fabulous meal with awesome customer service! Gorgeous sunset and it’s on the water!"}, {"username": "Elaine King", "comment_text": "Back streets, wonder around,"}, {"username": "Maria NoBa", "comment_text": "I would have gelato at https://\nwww.gelaterianic\no.com/ the best!"}, {"username": "Dave Colleen", "comment_text": "Dolfin Ristorante"}, {"username": "Jenn Messina Babore", "comment_text": "Agli Alboretti"}, {"username": "Hanne Hadsund", "comment_text": "Osteria del duomo a murano"}, {"username": "Hanne Hadsund", "comment_text": "E anche pizzeria ' la perla\" a venezia"}, {"username": "Jacqueline Nisbet", "comment_text": "Thank you everyone I will check them out it’s so overwhelming at first lol"}, {"username": "Kendra Moore", "comment_text": "https://\nwww.tripadvisor.\ncom/\nRestaurant_Revie\nw-g187870-d2188\n038-Reviews-Ris\ntorante_Diana-V\nenice_Veneto.ht\nml\n\nWe just got back last week, happened upon this place one day for lunch, it was really good!!\n\nhttps://\nwww.tripadvisor.\ncom/\nRestaurant_Revie\nw-g187870-d9396\n66-Reviews-Trat\ntoria_Tre_Spied\ni-Venice_Veneto\n.html\n\nHad dinner here when the restaurant we had originally made reservations for didn’t have room for us, it was also really good and the service was top notch!"}, {"username": "John Bruckman", "comment_text": "Il Covo"}, {"username": "Jenn Messina Babore", "comment_text": "Our favorite gelato was at Gelateria Paolin."}, {"username": "Raymond Capkin", "comment_text": "Trattoria Zaccharia was there yesterday"}, {"username": "Chantal Loir", "comment_text": "You have to look for \"Osteria\" there you have fresh and local food. The Venetians go there too."}, {"username": "Russell Weidner", "comment_text": "Russell Weidner"}, {"username": "Cara Bergmann", "comment_text": "Ristorante da Raffaele for sure. The gindolas pass by. Ask to sit outside under the green awning"}, {"username": "John Krug", "comment_text": "Al Covo has been featured in several shows including the late Chef Bourdain. We went 4 times in 2 weeks."}, {"username": "Caryn Goode", "comment_text": "Osteria Barababao. Close to the Realto Bridge. https://\nosteria-barababa\no.business.site\n/?m=true"}, {"username": "Christy L Jones", "comment_text": "We had a dinner across the canal from the train station at a tiny place with delicious fresh seafood dishes. Wonderful experience there. Authentic Italian experience for sure. Trattoria alla Fontana."}, {"username": "Susan Brooks", "comment_text": "Cafe Florian for delicious desserts!"}, {"username": "Laura Bolzic", "comment_text": "Anyone in the back streets, don’t bother overlooking the water or the touristy areas. Ask a local they know best!"}, {"username": "Abigail Jang", "comment_text": "1000 Gourmet. We loved the pizza there"}]}, {"id": "2202425066823238", "text": "Looking for recommendations on hotels near TREVI Fountain", "link": "facebook.com/groups/1373361046396315/permalink/2202425066823238/", "likes": 0, "comments": [{"username": "Alison Dutton", "comment_text": "Trevi Palace just around the corner, stayed there at beginning of June this year. Was clean, comfortable and had really good breakfasts. We only booked a standard double so we didn't have a terrace or a view but we didn't miss it. We did ask for an upper room as we were warned that rooms on the front on lower floors could be noisy."}, {"username": "Alison Dutton", "comment_text": "Extra photo"}, {"username": "Kate Aquino", "comment_text": "Alison Dutton thank you!"}, {"username": "Patti Warren", "comment_text": "Hotel Delle Nazioni was perfect"}, {"username": "Judy Carey", "comment_text": "Hotel Fontana! Staying there in the winter based upon other FB recommendations\n."}, {"username": "Sandra Kent", "comment_text": "Hotel Trevi excellent"}, {"username": "Robert Parinetto", "comment_text": "Hotel Trevi"}, {"username": "Lori Ann", "comment_text": "If you are going in a busy season, I would recommend staying near the Pantheon instead. Still in a great area but the streets are passable. The Trevi area was insanely crowded this week."}, {"username": "Kathy Velocci", "comment_text": "Rome Art Hotel. Just left there this morning. Clean, modern, great staff."}]}, {"id": "2202431926822552", "text": "Those who have done the Prime Vatican experience at 7:30am.\n\nHow does it work how many ppl are in your group? Do they take you straight into the Vatican first and leave breakfast for the end as to avoid crowds?", "link": "facebook.com/groups/1373361046396315/permalink/2202431926822552/", "likes": 0, "comments": [{"username": "John Rodriguez", "comment_text": "We (2 ppl) went yesterday. There were only about 50 people in the prime experience line. We got to line first so we took off first. For context there were hundreds of people waiting in the non-reservation\nline!\n\nThe whole area is the Vatican so not sure what you mean. We went along a hallway then the final area was the Sistine chapel.\n\nAfter they release us at 0930 we decided to do breakfast before self guiding over to St. Peter’s basilica.\n\nOur guide said normally at 0930 all the tours are “off to the races” to be first to breakfast so she got us there quickly. There was so much food we were stuffed!"}, {"username": "Dawn Canada", "comment_text": "We did the prime vip which was just our family of 5 with our guide. Went through the museums first starting at 7:15, then ended in Sistine Chapel which was nearly empty of people except a couple other groups. Our guide was able to talk in the Sistine Chapel and explain things, but later on they don’t allow talking in the chapel. The guide ended after the Chapel and then we went to breakfast at 9:30. After that we could go back through the museums again (now with the crowds), but we went through the Sistine Chapel again. After that we exited and went into St. Peter’s on our own."}, {"username": "Leanda Wall", "comment_text": "We done the breakfast and tour. We had breakfast in the grounds of the Vatican then went thru the vatican for our guided tour. First hour or so was good but then it got very crowded."}, {"username": "Judy Bentz McGee", "comment_text": "Can anyone recommend a tour company to purchase this tour through? The Vatican website is sold out on the dates we need. TY"}, {"username": "Carla Snook", "comment_text": "This might be a silly question, but when you went online to book to the Vatican itself, do you just do the vatican.com ?"}, {"username": "Kimberley Bartra", "comment_text": "Heather Morgan"}]}, {"id": "2202432476822497", "text": "CUSTOMS\nWe left Rome, layover in Paris to Boston where we did customs. We flew Delta/Air France. Doing the check in on Delta app, it talked about downloading the MPC customs app\n\nOMG, this saved us sooo muchआणखी time The line for people who did not have this was about 200 people deep in line. There was no one in the MPC line. There was a dedicated line that said MPC.\n\nWhich was a good thing since we had to run to our next flight.\n\nOnce you land you click that you landed and then all you do is show the QR code and your passport and that’s it.", "link": "facebook.com/groups/1373361046396315/permalink/2202432476822497/", "likes": 217, "comments": [{"username": "Angela Stewart Sessoms", "comment_text": "Is Global Entry the same?"}, {"username": "Tracy Rhodes Johnson", "comment_text": "I use this all the time in Houston! Major time saver!"}, {"username": "Meredith Noll", "comment_text": "Had it for Costa Rica. Very helpful"}, {"username": "Jenny Merrell Hof-Hadwin", "comment_text": "Heard about this app from this group before our trip in June.\nSaved us so much time"}, {"username": "Alexandra A Welker", "comment_text": "Yep, it's amazing to have this makes entering thru Immigration easy. I've been using it since it started in 2014."}, {"username": "Andi Riordan Scott", "comment_text": "Wait - is this like a global entry style of app?\n\nCan it be used in all countries?"}, {"username": "Joy Little Gordon", "comment_text": "We had the same experience in Philly yesterday arriving from Venice! AMAZING!\nI already knew about it prior, so I’d already loaded the app and added my family. Literally answered the questions for Philly MPC while waiting to exit our plane. Super easy and super fast!!💕"}, {"username": "Jim LaSarre", "comment_text": "Tatiana LaSarre"}, {"username": "Matthew R. Meehan", "comment_text": "Krissy Dascoli-Meehan"}, {"username": "Xiomara Perez", "comment_text": "It was a lifesaver in jfk"}, {"username": "Elizabeth Villa", "comment_text": "Lydia Altinbas Ana Isabel Fernandez"}, {"username": "Lisa Szal", "comment_text": "This was the best kept secret we discovered when planning our recent trip to Paris. Literally only 3 people ahead of us when going through customs at LAX. Miracle."}, {"username": "Lisa Szal", "comment_text": "We actually completed the final questions on our app while on the Air France flight getting ready to land in LAX! I guess because we were on the WiFi our photos uploaded and the declaration questionnaire did as well."}, {"username": "Lauren Overton Call", "comment_text": "Victoria Butler Culbertson"}, {"username": "Debbie White", "comment_text": "Christine"}, {"username": "Monica Allison", "comment_text": "Jenni Rodriguez"}, {"username": "Monica Allison", "comment_text": "Suzanna Chao"}, {"username": "Monica Allison", "comment_text": "Maddy Rosencrance"}, {"username": "David King", "comment_text": "Love this!!!\n\nIt’s like Free Global Entry but without the hassle of interviews and applications.\n\nI have shared this info with other passengers who had landed in our plan at Dulles International… and they downloaded the app in time to immediately use it, avoiding the 1+ hour line at Passport Control‼️"}, {"username": "Diane Capra Brand", "comment_text": "Ava Brand"}, {"username": "Riley Nathaniel", "comment_text": "Kellie McKean, noted."}, {"username": "Kathy Menke", "comment_text": "Chelsea Menke"}, {"username": "Shohreh Eshaghian Nazarian", "comment_text": "It’s as good as Global Entry. I love it."}, {"username": "Jadene Kay", "comment_text": "Is there a list of airports that it accepts MPC?"}, {"username": "Charlene Essex", "comment_text": "Cindy Gessner OCallaghan download this app."}, {"username": "Nancy Hepp Butler", "comment_text": "Great information!"}, {"username": "Carlos Gomez", "comment_text": "🤫 shhhhhh keep it a secret 🤐. Lol 😃"}, {"username": "Brandy Wine Huffman", "comment_text": "Melissa Hayes"}, {"username": "Lisa Lord", "comment_text": "Thank you for the tip!!"}, {"username": "Seun On Demand", "comment_text": "Now the line at MPC is about to get long 🤦🏽‍♀️🤦🏽‍♀️"}, {"username": "Sonia Scotto Lubrano", "comment_text": "Shhhhhhh then the line won’t be short anymore 🤣🤣\n(Kidding)\nIts a life saver. Before it was MPC it was mobile passport and it’s saved my ass a ton"}, {"username": "Kim Scholl White", "comment_text": "If we have global entry would we need this?"}, {"username": "Cecile Broussard", "comment_text": "Maureen Judice"}, {"username": "Susan Maxwell", "comment_text": "To clarify - you completed MPC app upon landing in Boston and prior to next flight elsewhere within US?"}, {"username": "Michelle Anderson- Rowland", "comment_text": "Brenna Rowland Keryth Rowland"}, {"username": "Jill Schmidt", "comment_text": "Ronnie Schmidt Julie Marie. Jon Sternoff"}, {"username": "Kevin Ziegler", "comment_text": "Why does JFK not allow this? We are Rome to JFK and we looked into this but it said JFK was not part of it for some reason!"}, {"username": "Christine Ann", "comment_text": "Yes!!!! Same here!!!"}, {"username": "Mina Pisa", "comment_text": "Thank you for the info. I will be flying Delta/Air France from Naples back to Boston with layover in Paris also."}, {"username": "Donna Spencer", "comment_text": "Lynn Mcconnell Jennifer McConnell Benge."}, {"username": "Amy Crisman", "comment_text": "Have loaded and ready for October SLC-Milan Venice to Slc. Both layovers in Atlanta."}, {"username": "Lori Newton Peerboom", "comment_text": "Tracy Piko Lawniczak I have a question about your layover time? We are flying from Rome Air France/delta stopover We have an hour for layover. Is that enough time between flights"}, {"username": "Diane Plott Miller", "comment_text": "Thank you for sharing this information ♥️\nRichard Sheila Wagner\nCarrie Belaire Cormier\nHarold W. Miller\nStanford Cormier\nChristine Gautreaux Richard\nKelly Pousson\nPat Landry Travel Agent"}, {"username": "Angela Dempsey", "comment_text": "Dianne Gerrell did you know about this?"}, {"username": "Lisa Roth", "comment_text": "My daughter and I fly from Italy to Boston on Monday, so I will give this a try. Thanks"}, {"username": "Mira Elezovski", "comment_text": "Tyson Ak"}, {"username": "Tara Easterling", "comment_text": "We did the same in Chicago from Paris a week ago. There was no one in that line. The other line had 2 international flights full of people."}, {"username": "Sarah Beal Elwell", "comment_text": "Thank you!!! Leaving from Boston in 2 weeks 👍🏻 Downloading now…"}, {"username": "Patricia Spinney Loranger", "comment_text": "How does/or does this differ from Global Entry"}, {"username": "Melissa Steen", "comment_text": "Does this work at European airports, or is it only for return to US?"}, {"username": "Mark Andrews", "comment_text": "Totes use this app. It’s great"}, {"username": "Pat Petrello", "comment_text": "How many hours does one need to allow for customs when getting connecting flights? In case the app doesn’t work or not allowed?"}, {"username": "Kim Berg", "comment_text": "So if we are flying home from Rome to Minnesota and we connect in Boston, do we go through customs in Boston? So we have to go through customs and back through security for our flight to MN? I have the app downloaded and everything loaded just not 100% where we go through customs."}, {"username": "Ellen Kerness", "comment_text": "We had global entry, we walked up to a kiosk, put our face in front of it, and walked right out of the airport. No fuss no muss the best."}, {"username": "Maritza Marquez Nickerson", "comment_text": "🤫 don’t let the cat out of the bag 😏"}, {"username": "Michelle Abrams", "comment_text": "Well now the secret is out of the bag!! Yes I whooped through San Francisco in less than 2 minutes last weekend✈️😂"}, {"username": "Yvette Mendez", "comment_text": "What’s the App?"}, {"username": "Stacy Prestigiacomo", "comment_text": "We did this too it was great"}, {"username": "Christina DeWaard Ventola", "comment_text": "Great info! Heading to Italy in September. Thank you!"}, {"username": "Susan Hobrath", "comment_text": "My son and his Wife booked flights separate from mine ...But we are flying together..do we do one form or two?"}, {"username": "Carole Tarlap", "comment_text": "Just like Global Entry."}, {"username": "Joy Colby", "comment_text": "Thank you"}, {"username": "Norm Utech", "comment_text": "what about returning to toronto"}, {"username": "Silvia Arndt", "comment_text": "Thanks for the info!"}, {"username": "Mindy Grossman Sepinuck", "comment_text": "Can you tell me more, do I put our passport info in when we get to Rome? Or when we leave Palm Beach?"}, {"username": "Michele Levesque Semosky", "comment_text": "I believe it is one per family, not per person. So only one form."}, {"username": "Stefanie DiFronzo-Fodera", "comment_text": "Do you know how far in advanced you do it?"}, {"username": "Vikki Hoffman-o'connor", "comment_text": "Just got it…thank you!"}, {"username": "Susan Kirsch Braxton", "comment_text": "Just used in JFK. The best!"}, {"username": "Ryane Sabatelli Garcia", "comment_text": "Lorrie Sabatelli-Harri\ns"}, {"username": "Scott Fridkin", "comment_text": "So you download the info to the app before leaving your departure country, but activate it when you land in the US?"}, {"username": "Lisa Bolte", "comment_text": "Great to know! Thank you!"}, {"username": "Kathy Madison Dahlen", "comment_text": "We’ll be using this app, glad to hear it works great 😊"}, {"username": "Cindy Giampietro", "comment_text": "I was all prepared with this too and clicked on it when we landed in New Jersey but they wouldn’t let me use it when we got to customs (said they weren’t doing it anymore )￼ and we had to stand in the huge line to get through customs. Needless to say, we missed our connecting flight back to California and had to spend the night in New Jersey. ￼"}, {"username": "Denise Chapman Toth", "comment_text": "Thanks for this"}, {"username": "Brittany Richards", "comment_text": "Shhhhhhh don’t share this amazing info so it gets all crowded 😂\nI’m joking. MPC is amazing!"}, {"username": "Liza Vega Santos", "comment_text": "Thanks for sharing. Our layover is Paris from Rome and we’re also flying with Delta/AF next week . Great info. That’s why I love this group, you are all such a great help! 🥰"}, {"username": "Laura McSweeney", "comment_text": "Huge time saver but only good at certain airports"}, {"username": "Diana Acosta", "comment_text": "Tracy Piko Lawniczak we are flying Delta/Air France from Rome with layover in Paris final destination Miami. We have a 3 hr 45 min layover. Was Air France on time? Hoping we will have enough time to get to our connecting flight."}, {"username": "Elizabeth Jayne Harris", "comment_text": "Richard Harris David Harris Melissa Fass"}, {"username": "Debbi Mayfield", "comment_text": "Can you fill any of this out prior to being in Italy?"}, {"username": "Julie Griffin Smith", "comment_text": "Going to use it for the first time when returning from Rome on September 3rd. Excited to see how helpful it is. I have everything entered except the last details of gate, etc."}, {"username": "Tammy Victory Diecidue", "comment_text": "Genny, Nikki, Wendy, Kim, Kim, Judy, John"}, {"username": "Jennifer Walp Rydholm", "comment_text": "I had already downloaded this app for my upcoming trip, and checked to see that our airport is listed. Is there anything in Italy similar that speeds up the line?"}, {"username": "Danielle Balch Blundy", "comment_text": "We used it a few months ago on our paris trip. Major time saver!!!"}, {"username": "Denine Colarossi Pappania", "comment_text": "Can we do this if we have a direct flight Rome to Boston?"}, {"username": "Colleen Dawson", "comment_text": "Although we have Global Entry, we also have Mobile Passport on our phones, as sometimes MP lines are shorter."}, {"username": "Jeff McLellan", "comment_text": "Love that they are finally modernizing things like this."}, {"username": "Coleen Greer", "comment_text": "Thank you"}, {"username": "Susan Maxwell", "comment_text": "Great tip! Thank you for sharing!"}, {"username": "Meredith Williams", "comment_text": "the best!!"}, {"username": "Brian Marcus", "comment_text": "Did it in JFK. Was great."}, {"username": "Shelley Perelmuth Sperling", "comment_text": "We have global entry. Includes tsa pre check"}]}, {"id": "2202438490155229", "text": "Thank you for the input and suggestions we received. Follow up questions: We will only have 7-9 days to spend in Italy. We are highly considering making Sorrento home base and then go places from there. We're more interested in experiencing Italy. We are highly considering renting a car to have more flexibility. Pros/cons? Also, there appears to be many Airbnbs in Sorrento. Has anyone stayed in one that they would recommend? Bonus question: I'd like to take in a scuba dive in that area. Any suggestions/recommendations? Grazie!", "link": "facebook.com/groups/1373361046396315/permalink/2202438490155229/", "likes": 0, "comments": [{"username": "Kay Rendall", "comment_text": "If u stay in Sorrento, stay in the old city, where u can walk everywhere use the bus ferry. Not 1 that is way out or high on the cliffs, the views r wonderful, but hard to experience the real Sorrento. Might be a problem to park though anywhere a block or two fro Piazza Tazzo. The city square. Enjoy"}, {"username": "Pia Jalonen", "comment_text": "We stayed in Sorrento and rented a car. Pros: so much freedom when you don't have to worry about timetables for public transport! A lot faster, too. And you get to plan the routes yourself. Cons: traffic is nuts and the roads are pretty narrow and very winding. And the driver can't have any spontaneous drinks 😄"}]}, {"id": "2202439283488483", "text": "Planning a trip next summer\nBest small town please on lago maggiore\nThank you", "link": "facebook.com/groups/1373361046396315/permalink/2202439283488483/", "likes": 1, "comments": [{"username": "Simone Pfenninger", "comment_text": "Small: Domaso in the north with ferry access to Varenna and others"}, {"username": "Paola Bersano", "comment_text": "I live on lake Maggiore. I can suggest you stay in Stresa, where you can find any kind of accommodation. Then you should not miss visiting the Borromean islands, Arona, Verbania and the garden of villa Taranto. If you have a little more time there is the wonderful excursion \"lago Maggiore express \", you reach Locarno , Switzerland, by boat, and get back by train through Vigezzo Valley, a truly scenic route. You can also spend some time on lake Orta and lake Mergozzo, both very close. You can even reach Macugnaga, at the foot of Monte Rosa, great alpine scenery."}, {"username": "Jose Velez", "comment_text": "I stayed at stresa"}, {"username": "Simone Pfenninger", "comment_text": "Lago Maggiore: Arona (Piemont)"}, {"username": "Bev Madill", "comment_text": "I stayed in Stresa in June. It’s a beautiful town."}, {"username": "Sadie Veitch", "comment_text": "Stresa brilliant. You can to Switzerland by boat and back on train through vigezzo Valley .I loved stresa x"}]}, {"id": "2202439876821757", "text": "It kills me that everyday you see some snarky response to a question on here. And yet if you read other comments, there are always other people providing good advice based on personal experience. This is what people are looking for. I am pretty confident anyone on facebook is aware of google. They are looking for personal experiences not rude replies.", "link": "facebook.com/groups/1373361046396315/permalink/2202439876821757/", "likes": 475, "comments": [{"username": "Alessandro Iannelli", "comment_text": "Big big group, over half a million people, you are bound to find every sort of individual. It's the internet."}, {"username": "Paula Bennett", "comment_text": "Amen"}, {"username": "Bill Elias", "comment_text": "Some people really need a travel agent because they don’t want to even try to do the work. And yes, some are looking for real world advice."}, {"username": "Fetchin Gretchen", "comment_text": "It is truly distressing to see the negative unhelpful posts. Luckily the people who want to provide actual help without judgement predominate. In groups where the opposite occurred, I have left the group. Do not need that kind of negativity in my life."}, {"username": "Carolyn Hassarati", "comment_text": "Agree ,well said ."}, {"username": "Penny Bellofatto Westberry", "comment_text": "Or a snarky response to a comment - like I just experienced on a different post!"}, {"username": "Melissa Welch", "comment_text": "100%"}, {"username": "Eileen Glenane", "comment_text": "Except for the jerks who posted about how they speak Italian in Italy."}, {"username": "Alicia Cox", "comment_text": "💯 and most “snarks” would not say it in person, but lots of confidence behind a screen 🙄"}, {"username": "Debbie Potter", "comment_text": "Love love love this!"}, {"username": "Felicia LoCascio Whitney", "comment_text": "If you don't have anything nice to say- move on!"}, {"username": "Allison Mir", "comment_text": "It is really frustrating to see the sand questions over and over when a simple search of the group using the 🔍 function at the top of the page would bring up all of the most recent posts on the same subject. Would be a good idea to include a FAQ section."}, {"username": "Erica Styan", "comment_text": "Yup well said"}, {"username": "Colleen Dee", "comment_text": "Do you ever clicked on a profile just to see if the person being rude looks like as much of a jerk as they sound? I used to get upset by them, now they just amuse me. ￼ There are a lot of very helpful people ￼here, just scroll past the rude ones."}, {"username": "Alice Francesca", "comment_text": "We are here to help, but after the 50th question about if it s doable to do Lake Como and Puglia in the same day, or coming to Italy in the middle of August expecting some peace and quiet, or eating the best lasagna in Amalfi, it does get a little depressing.\nIt does look like some people land in Italy not having a clue about what to expect, while just a little 5 minute research online would solve all their problems.\nI have travelled to the Usa many times, and always picked my destination (whether it was NY, Tucson, Miami, Newport, etc) AFTER reading a little about it: what to see, what to eat, what the weather would be like.Easy peasy."}, {"username": "Bonnie Loftspring", "comment_text": "Ever Notice how nice & responsive people are to your face but behind the cowardly cover of FB anonymity they can be rude. I’ve learned so much from this site about Italy & where I want to go next. Also learned a bit of How Not To Be!"}, {"username": "Shelley Bowen Glassman", "comment_text": "Exactly!"}, {"username": "Michelle Plutto", "comment_text": "EXACTLY!!!"}, {"username": "Sue Sherwood", "comment_text": "Amen!"}, {"username": "Terry Spincic", "comment_text": "Hi, I am in Italy 30 days, and on this site, same athers pages on facebook which is for tourist in Italy. I didn t found good advice for now...??? I have one for everybody here- don't came in Italy, you will be treated like numbers for rip you of. Bad service, bad hotels, food nothing special you can eat in your country bether. Try you can see same history and see lotoof stolen art... I am so disappointed and angry and I am asking myself why I came here. Bay bay Itali never more"}, {"username": "Ilenia Herrera Lutz", "comment_text": "I understand where you are coming from. However, in order to avoid snarky responses, posters might pause for 30 seconds and avoid asking a question that comes across as rude or lazy (so many in here.). Posts in the vein of “best hotels in Rome, go!,” give that impression easily so dont be surprised to be 🔥 here. At least, take a second to explain your context and phrase your question. At a minimum, show youve done some research and make it clear you are looking for personal anecdotes/\nexperiences."}, {"username": "Sue Swail Bang", "comment_text": "Angela Moore 100% this! Why do people care what questions are being asked. I’ve seen people say “it’s frustrating or depressing or their lazy”.Why do they care so much, it literally has no effect on their life at all!!\nThere’s a scroll function for a reason🤨"}, {"username": "Casie Jen", "comment_text": "Rude people just can't scroll down and always have something smart to say. It doesn't matter if it is asked a million times, no one is obliged to answer it. Someone who's willing to help will help."}, {"username": "Lucrezia Folger", "comment_text": "I agree somewhat, however, when people ask questions that absolutely no one has the answer for, for instance, \"I'm going to be in Italy (no specific place) in mid-Oct. 2024, what will the weather be like?\" This is where Google comes in, you can google trends and past years to get an idea. Or they have not done any, research on the places they are interested in and ask if \"Venice\" or Largo Como, etc, is \"WORTH IT?\" Worth it in what way? Worth it to people you don't know? Worth it as far as time? Amazement? Uniqueness, a Day trip? A Week? There are instances people have to learn to read past posts or Google, and form their own conclusion."}, {"username": "Mimi Malamud Levitan", "comment_text": "some of us are fortunate, seasoned travelers, others may be first timers and simply overwhelmed! Even as a seasoned, experienced traveler, I may have plenty of questions that might make my next adventure better. So share the wealth, and carry on, if, as a FB group member you get frustrated at a duplicate request !!!"}, {"username": "Bill Casper", "comment_text": "Sadly it’s the downside of social media and people venting their anger and it’s cathartic for them. Trick is to not take it personally. It’s about THEIR inner demons, anger, frustration about THEIR lives."}]}, {"id": "2202442933488118", "text": "How do we pay at hotels in milan?\n\nCredit cards? Debits?\nWhen it says, you will pay in local currency what does that mean?\nHelp please", "link": "facebook.com/groups/1373361046396315/permalink/2202442933488118/", "likes": 13, "comments": [{"username": "Gillian O'Callaghan", "comment_text": "I paid with my credit card on arrival. Your credit card provider will convert it from € to your currency. If you want to pay cash you need to use €."}, {"username": "Holli Martin", "comment_text": "Euros?"}, {"username": "Stella Dee", "comment_text": "Pay with a credit card in the local currency."}, {"username": "Romana Svítková", "comment_text": "Local currency is euro. Most hotels accept cash and cards both. Tourist tax is often paid in cash."}, {"username": "Alexandra A Welker", "comment_text": "Credit card in local currency."}, {"username": "Allison Mir", "comment_text": "It means you will pay in Euros as that is the local currency. Some hotels will not accept cash"}, {"username": "Phyllis Snyder", "comment_text": "You want to always use local currency- and at an atm never use the dynamic currency conversion!"}, {"username": "Bill Elias", "comment_text": "Good lord people. It simply means you pay how you normally would.\n\nIf by credit/debit, the currency conversion is done by your card issuer at time of transaction. So whatever their rate is on that day, that’s what you’ll pay."}, {"username": "Myriam Rodríguez", "comment_text": "Pay with credit card in euros always"}, {"username": "Eva McLean", "comment_text": "To answer the part of your question about local currency…. In Italy, the local currency is Euros.\n\nIf you pay in cash, you’ve already paid any currency exchange costs at the time you converted your money.\n\nIf you use a credit card (and I think withdrawing cash from an atm on your debit card as well), you will often see the option to pay in local currency, or converted to the currency of your own country.\n\nIn both cases, your credit card statement will be updated in the currency of your country (euro x exchange rate + any possible exchange fees).\n\nIf you choose to pay in local currency, you are charged in euros and all that stuff happens whenever the charge lands on your statement. That could be several days after the original transaction, at whatever exchange rate is in effect on the day/time it lands.\n\nIf you choose to pay in converted currency, you are charged in your own currency, based on whatever the exchange was at the time of the transaction.\n\nSince markets are volatile and can fluctuate many times during a day, you could be paying a higher rate for a 9am transaction versus a 6pm transaction.\n\nAlso, I’m not 100% sure on this but I think ‘pay in converted $’ may have a hidden fee built in, which makes it look like a higher exchange rate has been charged.\n\nAnd lastly - Never use a credit card to withdraw cash from an ATM unless you understand …. Unlike credit card purchases where interest does not start accumulating until the statement ‘due’ date, ATM cash withdrawals by credit card are considered loans and interest starts accruing immediately.\n\nHope this helps."}, {"username": "Frannie Kaplan", "comment_text": "It means it will be paid in euros, you can't pay in dollars or whatever. You usually pay for your hotel online in advance with debit or credit. It's always easiest to use your credit card as a tourist, and you can normally withdraw euros with your credit card in a reliable atm in the airport."}, {"username": "Anthony Martini Jr.", "comment_text": "EUROS"}, {"username": "Annick Hupperetz", "comment_text": "You can pay by credit card or with Euros."}, {"username": "Ian Beyer", "comment_text": "Local currency just means they run your card in euros. You want this. Your bank will give you a vastly better exchange rate with no commission."}, {"username": "Pietro Adami", "comment_text": "Remember that over 5.000€ you CANNOT pay cash, by law. So if your hotel bill is higher, you must pay with your card"}, {"username": "Sue Holden", "comment_text": "Local currency is euros"}, {"username": "Maria Antidormi Corica", "comment_text": "Euros - haven’t had a credit card knocked bag anywhere"}, {"username": "Patti Porter", "comment_text": "Credit cards with no foreign transaction fee used for purchase and debit cards used to cash out of atm\nYou pay in local currency means that - in Milan you pay in euros and your credit card converts it in your bill to whatever your home currency is and if that’s not euros that’s why you want use card with no foreign transaction fee because if not then you will be charged a percentage fee depending on card how much that is"}, {"username": "Renae Larcus", "comment_text": "Cash or credit card"}, {"username": "Renee Rundle Stoneham", "comment_text": "Pay by however you want. We pay by CC.\n\nWhen they swipe CC they ask if you want to pay in US dollars or Euros… always choose Local currency (Euros) your bank gives you a better exchange rate than the hotel or store etc…"}, {"username": "Tracey Fairbrother", "comment_text": "Just pay when you get there on your debit card"}, {"username": "Steve Grossman", "comment_text": "Pay for everything on your trip with your visa card"}, {"username": "Frank Hunt", "comment_text": "It’s the room rate + the tax, it varies."}, {"username": "Elizabeth Yu", "comment_text": "You will be charged in Euros by the hotel. Your credit card company will convert it to your home country’s currency when it processes the transaction. You will not see your purchase in Euros on your statement. You will see the purchase in your home country’s currency. Also, depending on the credit card you use, you may be charged a foreign transaction fee by the company that issued the card. The foreign transaction fee will be shown as a separate entry on your statement."}, {"username": "Michael Barnes", "comment_text": "Do not used a debit card as a credit card.\nYou are opening yourself up to issues."}, {"username": "Janine Emma Lucas", "comment_text": "ALWAYS choose on the credit card option to pay in LOCAL currency. It is the cheapest conversion"}, {"username": "Miyuki Kanno Paul", "comment_text": "CC. Choose Euro for the currency choice"}, {"username": "Jessica Petyo", "comment_text": "Just like paying resort fees and taxes in the US. We used our regular credit card in Milan. They charge an occupancy tax for each person, plus some additional fees."}]}, {"id": "2202445983487813", "text": "We had an amazing trip to Italy but Day 13 arrived and we were SPENT. We had shopped, eaten, and drank our way through the city and our feet hurt. So the last day before leaving back to the states we booked aआणखी day of reprieve, relaxation, and heaven. If you find yourself in Florence and need to get away from the crowds and heat—I highly recommend this Day Spa. It was a taxi ride away and was the best 6 hours spent (for only 35 Euros). You’re welcome. 😍. #florence", "link": "facebook.com/groups/1373361046396315/permalink/2202445983487813/", "likes": 289, "comments": [{"username": "Helen Stokes", "comment_text": "Does anyone know is there is a place like this in Rome ?"}, {"username": "Donna Diamond-Upham", "comment_text": "Looks fantastic! Did you happen to eat/drink there? Where prices reasonable?"}, {"username": "Stephanie Evans", "comment_text": "Thank you!"}, {"username": "Janet Elizabeth", "comment_text": "Thank you!"}, {"username": "Jessica Zolciak", "comment_text": "Is the day spa different from this one? This looks like €49?"}, {"username": "Leanne Dawn Sutton", "comment_text": "Booking this"}, {"username": "Carol Hayes", "comment_text": "What is the name of the spa?"}, {"username": "Molly Graban", "comment_text": "Dylan Graban"}, {"username": "Jamie Medeiros", "comment_text": "Looks amazing !!!"}, {"username": "Carol Nagle", "comment_text": "Jo"}, {"username": "Jesse Crawford", "comment_text": "Korri Sullivan"}, {"username": "Josephine Khairy", "comment_text": "Fe Fe, Andrew next time 😊"}, {"username": "Ingrid Krantz", "comment_text": "That looks great!"}, {"username": "Dianne Kelly", "comment_text": "Wow"}, {"username": "Tanya Williams", "comment_text": "Thank you. It looks awesome. We’re heading over to Italy in 3 weeks and might need this 👍"}, {"username": "Christa Lumby", "comment_text": "Morgan Eicher Mike Toomey"}, {"username": "Mary Bentley-Bloom", "comment_text": "Amanda Warner,Judie Weingartz, Jenny Weingartz, Taylor Ellis Bentley. Chris Bentley Bring back memories 🥲"}, {"username": "Linda Schauer", "comment_text": "Sarah Marie"}, {"username": "Jody Lynn", "comment_text": "Margaret Ann Schneider"}, {"username": "Beatriz Davalos Moreno", "comment_text": "That sounds great, just came back Wednesday. Wish I would have known about this place, got a 30 minute massage at hotel for 50 euros"}, {"username": "Holly Baldassare", "comment_text": "Adults only, I assume?"}, {"username": "Tanya Bitar", "comment_text": "I did this but in Padua hot springs, best money spent."}, {"username": "Amy Hudson Newsom", "comment_text": "Cindy Jones"}, {"username": "Carolyne Jurasek-Tarry", "comment_text": "We did the same, but in the middle of our trip. We went with another couple. Started in Rome, then went to Florence, they proceeded to Venice and we went to small resort with a lovely pool for 3 nights. We met back up in Naples for a couple nights, back to Rome and flew home."}, {"username": "Kelly Peagler Myers", "comment_text": "Shawnna Chance"}, {"username": "Anna Krasnoperova", "comment_text": "this pricing is just unbelievable! Comparing to what we can get in canada for that amount..."}, {"username": "Nina Rovinelli Heller", "comment_text": "Thanks for sharing this - its going on my list!"}, {"username": "Laura McLaughlin", "comment_text": "Craig Mclaughlin"}, {"username": "Debbie Horton Rough", "comment_text": "Oh my looks like heaven!!! Thank you"}, {"username": "Laura McLaughlin", "comment_text": "Hi I’ve had saved your post and just looking into this, looking at transport there and public transport is an hour at minimum and Uber €70. Is there a better option that Uber here?"}, {"username": "Juliana Acorn", "comment_text": "Wow thank you😍😍😍😍😍"}, {"username": "Juliana Acorn", "comment_text": "What did you book?"}, {"username": "Leigh Ann Wokutch Miller", "comment_text": "Anthony David Vizzoca"}, {"username": "Toni Green", "comment_text": "Looks amazing. Did they offer massages?"}, {"username": "Christina Clifton", "comment_text": "Jared Clifton Spa break in Florence?"}, {"username": "Mia Catalano", "comment_text": "Narelle Catalano next time"}, {"username": "Nina De Martino McDonough", "comment_text": "Great idea!"}, {"username": "Marinor Gilanga Protacio", "comment_text": "Thanks for sharing! We will be in Florence in September 🥰"}, {"username": "Patty Barnes", "comment_text": "Grazie! Bellissimo!"}, {"username": "Bill Casper", "comment_text": "Very cool. We did this often in Spain. We will spend a 1/2 day there at the spa in Florence in late November. Thanks for posting."}, {"username": "Michael Rudder", "comment_text": "Kate Rudder"}, {"username": "Alisa Flores", "comment_text": "Gaylee Thompson Demlinger"}, {"username": "Bill Casper", "comment_text": "How far taxi ride from downtown?"}, {"username": "Michelle Broome", "comment_text": "Sounds like a perfect ending!"}, {"username": "Janice Kinahan Delosh", "comment_text": "Taylor Delosh Kelsey Delosh Madysen Delosh Judith Kinahan-Macdona\nld….\nOn our next visit"}, {"username": "Morgan Eicher", "comment_text": "Christa Lumby"}, {"username": "Ellie Hearfield", "comment_text": "Tiffany Boland Kate George Dannielle Boland Ebony Boland"}, {"username": "Trace Barron", "comment_text": "I wonder if there's something similar in Roma"}]}, {"id": "2202448140154264", "text": "Hello. Going to fly into Milan the first week in October and be in Italy for 2 weeks. Any suggestions on a plan. I have none.\nVisiting my daughter", "link": "facebook.com/groups/1373361046396315/permalink/2202448140154264/", "likes": 0, "comments": [{"username": "Carole Welch Lang", "comment_text": "Go to the lakes (como) Florence, Bologna, Venice"}, {"username": "Chiara Normanno", "comment_text": "Beside what Carole told you, you may explore Milan a little (look up for hidden gems that only locals know), don't forget to pay a visit to Turin and 5 Terre if the weather is merciful. October should yeld nice sunny days."}, {"username": "JeriLynne Clifford", "comment_text": "If you like wine, check out the Langhe region"}, {"username": "Paola Bersano", "comment_text": "From Milan you can easily visit a lot of beautiful places by train, in a day. Lake Maggiore, lake Como, lake Garda. Verona, Bologna, Lugano (Switzerland). But please take your time in Milan, there are so many things to see."}, {"username": "Xiomara Servellon", "comment_text": "I can recommend you the facebook Page of a great Milanista who makes video of the Milán City\nSemplicemente Milano di Andrea Cherchi"}]}, {"id": "2161069144292164", "text": "Guided tour Trulli di Alberobello\nThe UNESCO-listed town of Alberobello is famous for its unique “trulli” dwellings, fairytale-like round stone huts topped with conical roofs that are only found in this area of… आणखी Puglia. Explore the largest concentration of “trulli” with this guided tour through Alberobello’s Rione Monti historic district, home to more than 1,000 of these picturesque buildings. Learn about their history and construction, stopping to visit the Trullo Sovrano and the Church of Sant’Antonio.\nRead more about Guided tour Trulli di Alberobello - https://www.viator.com/tours/Alberobello-and-Locorotondo/Tour-a-piedi-ALBEROBELLO-Visita-guidata-dei-Trulli/d28682-91060P4?pid=P00070587&mcid=42383&medium=link&medium_version=selector", "link": "facebook.com/groups/1373361046396315/permalink/2161069144292164/", "likes": 19, "comments": []}, {"id": "2201350790263999", "text": "NEW UPDATE!!! Omg, new update on luggage dilemma! It was a fraud number I called!! So I’m disputing the charge now with my credit card! I’ll update y’all when the adventure is over! And I’ve always prided myself on knowing when there’s a scam going on! How it happened was I googled “Delta phone number”. And the 2nd option said “Delta airlines phone number” and also said “delta.com”. Then there was a button to press to call “Delta”. But it WAS NOT Delta!! I should have just let my travel agent handle it. But I felt under the gun. Dang!!\n\nALSO: my luggage went all the way through. I did not have to grab it in Paris. Thank goodness. That airport was cray cray.\n\nHere’s an update on my luggage dilemma. If you remember, when I printed my boarding passes for tomorrow’s flight I got a page that said we might have to collect our luggage in Paris and check them back in for our final destination. We’re coming from USA. Anyway, we only had an hour and 20 minute layover and I didn’t think that would work. As a side, flights were taken care of by our travel agent. So I called Delta and because of the class of service we were booked under we were, in fact, going to have to do just that! I had to pay extra to change our class of service. I had no idea that was going to happen. So the fact that some of you responded that you did or did not have to collect your luggage upon arriving at your first point in Europe……that’s why!! It’s your class of service!! I wanted to post this FYI It’s a good example for us all to remember that not everyone has the same experience in traveling and to honor different experiences instead of arguing that “but this is how it was for me so it must be that way for everybody”.", "link": "facebook.com/groups/1373361046396315/permalink/2201350790263999/", "likes": 279, "comments": [{"username": "Kathy Malnasi", "comment_text": "it Has nothing to do with the class service. We flew business class to Italy via Amsterdam, which was our first stop from the United States and everyone must get their baggage in the first point of entry. We only have an hour and 20 minutes out of Charleston called it in to Italy and I’m questioning if we have enough time as well because we do have to get our luggage after we go through customs.￼"}, {"username": "Grace Sulsenti", "comment_text": "Exactly !"}, {"username": "Alexis Anderson", "comment_text": "I'm curious as to the class needed to book to not encounter this issue.... important information to know."}, {"username": "Dana Talusani", "comment_text": "Glad for the update. I've been wondering how this all turned out."}, {"username": "Susan Waltz Dean", "comment_text": "I had a young woman passenger going to MXP (Milan ) yesterday. She was going to a formal wedding in Italy a few hours drive from the airport and her air tag told her her luggage didn’t even make it on the flight she was taking to JFK, so she was quite upset. My advice is if you have anything you MUST have carry it on! I know she could probably find a lovely dress in Milan or elsewhere but she was so stressed and upset. 😥"}, {"username": "Cheryl Trigg", "comment_text": "If you enter Europe in a country that belongs to the EU then the airline can check your luggage to your final destination provided that country belongs to the EU.\nIf a non-Schengen country (UK, Ireland, Romania, Croatia, Cyprus, Bulgaria, etc) then you have to collect your luggage at your first entry into Europe.\nIt also depends on whether the airport has a transit area that keeps you from entering the country. If you have to go thru Customs to get to your next flight, then you have to collect/\nre-check.\nReturning to the US it’s always the first place you land.\nIt has nothing to do with class of travel.\nHope this helps."}, {"username": "Susan Kalister", "comment_text": "Thank you for sharing ❤️Safe travels."}, {"username": "Amie Stone", "comment_text": "Julie Gayde Benden I’ve been to Europe (from Boston) a bunch of times and have never had to claim bags and re check them"}, {"username": "Renee Rundle Stoneham", "comment_text": "This sounds like 2 separate airlines that your travel agent booked you on to get the cheapest price.\n\nNot “class” like economy vs business etc…\n\nI’ve flown economy (lowest class seat) from US to EU many times and have always had luggage checked through to final destination. Never had to pay more etc…\n\nI really hope you ask at checkin to make sure your bags are checked through to final destination.\n\nI’ve never used a travel agent in all my years of travel."}, {"username": "Renee Kremesec", "comment_text": "I would recommend an ITag for your luggage.\nIt wont prevent lost luggage but will help recover it.\nI have first hand knowledge"}, {"username": "Brooke Summerville", "comment_text": "We booked economy class from Australia to Germany with Singapore Airlines. Layover in Singapore and Munich. We were asked by airline staff if we wanted our bags to go straight through to final destination (Hamburg). We said yes. The Munich to Hamburg flight was Lufthansa. We did not use a travel agent. All turned out perfectly. We kept en eye on our luggage on layovers with AirTags and knew when we arrived in Hamburg - they did too."}, {"username": "Michael Widjaja", "comment_text": "That’s new,but then I’m from Indonesia and I flew with eco,premium eco and biz but never had that problem because usually I book the flight that directly arrive in Europe while did the transit in either Singapore or Middle East…."}, {"username": "Tami Sue", "comment_text": "Why couldn't you just check your luggage in Italy and not worry about it?"}, {"username": "Annette Tamminga", "comment_text": "And yet Julie the comments are still a disagreement telling you that you are wrong 🤦‍♀️\nThank you for sharing your experience."}, {"username": "Lisa Silvestri", "comment_text": "Lisa Silvestri"}, {"username": "Brenda Martinez Schafer", "comment_text": "We just flew economy to southern Australia, we didn’t have to mess with our luggage when we got to Auckland as our first stop from LAX. We did when we landed in LAX from Denver."}, {"username": "Tracey Pino", "comment_text": "If you bought from say AA & have layover to pick up ITA for next leg…as long as u bought at same time from AA, u don’t have to recheck. I just did this in June to july"}, {"username": "Rochelle Yngks", "comment_text": "As for my experience, if you fly the same airlines/\npartner alliance, you only retrieve your luggage at the final destination. For example I flew Delta from Wisconsin to Lisbon, Portugal with layover in Detroit and Paris. My flight was with Delta from Wisconsin to Paris. Paris to Lisbon was with Air France which is a Sky Team partner of Delta. My port of entry in Europe was Paris where I went thru border passport control. However my luggage was checked all the way to Lisbon. I retrieved my luggage in Lisbon.\nHowever, while I was planning my trip I saw that easyJet from Paris to Lisbon was cheaper by 50euro. However, if I took easyJet from Paris to Lisbon, I would need to retrieve my luggage in Paris and check in again with easyJet.\nWhat you need to find out if your planes are alliance partners wherein luggage is checked all the way to your final destination. If not, then yes you will need to retrieve your luggage.\nThat is why I never use a travel agent. I have more control of my itinerary if I book tickets myself."}, {"username": "Jasmine Javurek Mergl", "comment_text": "That explanation makes absolutely no sense"}, {"username": "Sheri Beitner", "comment_text": "We’re coming from California and change planes in Canada. Flying Air Canada all the way! Wondering if we will have to do the same, if so, we will do carry on…"}, {"username": "Manuela Rigoni Allen", "comment_text": "That is weird, I go home (Italy) from Atlanta to Venice almost every year, always got my luggage at final destination (via Amsterdam and Paris). Also layover should always be at least 2 hrs if not 3."}, {"username": "Nakitha Badon", "comment_text": "We had an ordeal with ours too. I know the frustration"}, {"username": "Tomas Krivanek", "comment_text": "Honestly i travel quite a lot and my luggage was always checked to the final destination. The only exception was jfk🇺🇸...and our backpacks got delayed 1 day to guatemala🤦‍♂️🤦‍♂️🤦‍♂️ if you do not pick up your luggage it stays. If you miss your connection you loose it...and very probably the next flight would be at your costs and with a delay as the planes are full in this holiday season😉"}, {"username": "Cheryl Trigg", "comment_text": "Julie I looked up Delta class of service and they offer 5 different ones. The cheapest is Basic Economy and that’s probably what your travel agent booked for you. Often you end up in the last rows. Delta probably made you pay the difference to upgrade you to Main Cabin, which is virtually the same except for a fee you can choose your seat ahead of time. Why I don’t know and it shouldn’t affect how your luggage is handled. Sounds like you got a bad deal.\nI had a problem with the weight of my luggage and the gate attendant wanted to charge me excess baggage. I asked her to call her Supervisor, she quickly changed her tune and let it go.\nEnjoy your trip and call a Supervisor on your return. You may get a refund."}, {"username": "Paul Fielding", "comment_text": "Get AirTags"}, {"username": "Robin Bryan", "comment_text": "In my opinion, your travel agent should have known about this. I hope you let him/her know so they know to discuss it with future clients."}, {"username": "Irene Oda", "comment_text": "Interesting situation. Never experienced this before. And yet, we live and learn. Thanks for the update. I will have to check it out."}, {"username": "Maria Badamo DeSocio", "comment_text": "I never had to collect my luggage on a stop over to Italy. I usually fly economy. As long as you book the flights together and using the same airline to your final destination ."}, {"username": "Chip Swalley", "comment_text": "Thank you for posting, a good reminder! Yes, it’s very disturbing WHY people have the need to argue in these groups!"}, {"username": "Susan Brezina", "comment_text": "This happened to me in Los Angeles, CA but it was with Southwest. I didn’t get my refund till I filed a complaint with the BBB"}, {"username": "Colleen Minnich Kane", "comment_text": "Glad it worked out!"}, {"username": "Keli Mauer Sorrentino", "comment_text": "Can I ask what class you were and then changed to?"}, {"username": "Karen Ries", "comment_text": "That seems a really strange reason. If you were booked on a “through” ticket, your luggage would of gone through also. Simple as that. Glad you got it worked out."}, {"username": "Donna Roth Colletti", "comment_text": "Thanks for the info."}, {"username": "Jen Crook", "comment_text": "As far as I am aware with all the travel i have done, if you fly with the same airline, even with a layover, you get your luggage at the final destination. If you fly one carrier to the first stop (layover) you have to collect your luggage and recheck in with your new carrier. Which makes sense as you fly two different airlines in that case ...different terminals, loading ect"}, {"username": "Robin Burrell", "comment_text": "Not exactly saying much good about your travel agent. They booked An 1.20 hr layover and luggage transfer and you had to straighten it out yourself."}, {"username": "Melissa Ribeiro Passos", "comment_text": "Lesson here is CARRY ON ALWAYS 🙄"}, {"username": "Anita DiLorenzo Hall", "comment_text": "Thank you for sharing your experience. Some people just need a reason to argue or people bash. I’m glad it all worked out for you."}, {"username": "Linda Dalelio Williams", "comment_text": "I hate layovers and prefer to fly direct when ever possible .\nGlad it worked\nOut for you"}, {"username": "Sondra Varner", "comment_text": "It must be common enough. Newark airport has an entire section called “Re-Check Bags” after customs. I’m glad you realized and got it sorted out. That could have been a nightmare."}, {"username": "Terri Lynch", "comment_text": "Thank you for sharing"}, {"username": "Mike Guluk", "comment_text": "So basically you were screwed by your travel agent, they booked you the wrong tickets and you had to rectify the problem. Who was your agent?"}, {"username": "Christine Carbone", "comment_text": "I wish you luck with the luggage and safe travels to Italy❤️"}, {"username": "Roxanne Curzi", "comment_text": "I am surpised the travel agent didn't seem to have knowledge of this."}, {"username": "Fiona Cameron", "comment_text": "A very good reason for NOT using a travel agent. Book through the airline website yourself. Take you time and thoroughly check what each “class” of ticket includes/\nexcludes. If you still want to use an agent to book, makes notes of your research and TELL the agent exactly what you want booked and exactly what the price you are expecting to pay. This is what I do, but Im in Australia and have no idea how US travel agents work… or don’t in this case."}, {"username": "Voula Ladas", "comment_text": "Flights were taken care of for you and they booked it like that ? They should’ve known better. Not a very reliable travel agent . Lucky you questioned it . It sounds like you are travelling with different airlines to your destination. By “class “they are not meaning business or economy ,they are meaning you are not flying direct to your destination with the one airline . I have to do the same on my next trip . Only difference is, I booked it myself ,and gave myself ample time to recheck my bags for the next flight ."}, {"username": "Karen Bowman", "comment_text": "Silver lining would be at least you can confirm your luggage arrived on the first leg and didn't get left back at point of departure. Not much consolation but I tried."}, {"username": "Jacqui Hakes", "comment_text": "Amen. The amount of misplaced/ unecessary judgement & criticism on social median is ridiculous"}, {"username": "Lauren Swanteck Myler", "comment_text": "Unfortunately, it sounds like your travel agent messed up and when you asked him/her to help, they made up some excuse that it was because of your class of service. I have never heard of this in many years of travel. If you switched airlines, you would need to get your bags and re-check. Bag has to follow the passenger."}, {"username": "Robyn Mosca Kingston", "comment_text": "I would not be happy within the travel agent. It’s a good thing you researched this."}, {"username": "Marva Cogdill Ballentine", "comment_text": "Yes, I am a basic class person, I’ve always had to collect my luggage once I entered the US, even if it wasn’t my destinations in the US."}, {"username": "Rose Stolarek", "comment_text": "I’m Australian and have never heard of class of service . Here when we fly overseas we check in our luggage to the final destination and even if we change planes , the luggage still gets to the final destination as flights code share\nCan someone explain what class of service is please?"}, {"username": "Wendy Wiederich Ibberson", "comment_text": "Good to know! Thanks for the information!"}, {"username": "Debbie Zornes Ruch", "comment_text": "You should clear customs and immigrations in Paris your 1st european stop. Here you will collect your checked luggage as you finish the customs and immigration check you leave you bag to be put on the next flight. Upon departure from the US check the destinations on the airline luggage tag. Hopefully it will show your final destination."}, {"username": "Mindy Jo", "comment_text": "It also matters where you left from. Some airports and countries don't meet certain criteria or the desired standards of places you pass through. I read something about Ireland and England. We had to go through customs in London after leaving Ireland. Only to check our bags again to reboard."}, {"username": "Veronica Cappello-Mottern", "comment_text": "Thanks for posting, good to know!! We have non stop, but in the off chance we won’t in the future I will definitely remember this."}, {"username": "Vicki Susie Naab Gandolf", "comment_text": "And Paris is a huge airport. It seemed like we walked miles to get to our next flight!"}, {"username": "Susan Lowry Lamb", "comment_text": "Hmmmm, not the best job done by a TA."}, {"username": "Nancy Lewis", "comment_text": "Best answer repack in large carry on allowed and a large back pack for under seat.\nAll your troubles with connection are solved. Stop stressing you’ll make your self sick.\nIf you check luggage ALWAYS put A luggage tracker in bag.\nApple air tag. About $25"}, {"username": "Patsy Luque Mejia", "comment_text": "Well said. There are variables to be considered. Good job researching and preparing for your transfer. 👍🏼"}]}, {"id": "2202270410172037", "text": "Attempting to do COO for our Italy trip next summer and plan to hand wash. What are quick dry underwear for men and women that you all recommended. TIA", "link": "facebook.com/groups/1373361046396315/permalink/2202270410172037/", "likes": 12, "comments": [{"username": "Alex DiBona", "comment_text": "Free Fly and Ex Officio"}, {"username": "JeriLynne Clifford", "comment_text": "Tommy Johns works for us."}, {"username": "Donna Parrish", "comment_text": "What is COO?"}, {"username": "Gillian O'Callaghan", "comment_text": "I take thin, light ones and a pegless clothesline. Dry quickly over night. No idea re brands or where you live."}, {"username": "Rose Anderson", "comment_text": "Microfiber material is comfortable and dries easily"}, {"username": "Linda Miller", "comment_text": "I used the blow dryer in the room to aid in drying things."}, {"username": "James-Kathy Dickerson", "comment_text": "That's what we are doing for 40 days ...they do have laundromats..."}, {"username": "Felicia LoCascio Whitney", "comment_text": "Felicia LoCascio Whitney"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "For the ladies just wear a panty liner that you can throw away and get to use your underwear more than once !"}, {"username": "Susan A. Jasper", "comment_text": "Underwear is the last thing you need to worry about taking up space in your C/O. Remove the bulk with your other clothes items and pack less by bringing a few basic staples and mixing and matching to make more outfits with less."}, {"username": "Michelle Robertson-Leathley", "comment_text": "Book vacation rentals with washers. We are finishing up three weeks with only carry on luggage. It’s been fabulous and everything dries fast in the sun ☀️"}, {"username": "Bill Casper", "comment_text": "Stay at Air BNBS or BOOKING apartments with washer/dryer. Take 3-4 days worth of clothing. Easy with a carry on."}, {"username": "Karen Lawrence Smith", "comment_text": "I got some cooling ones from Duluth Trading that dry fast. Probably REI, Bass Pro Shops may have similar."}, {"username": "Isabelle Avl", "comment_text": "When you are in a town, go to Google Maps and type « lavanderia ».\nYou’ll have all the laundromats nearby"}, {"username": "Carolyne Jurasek-Tarry", "comment_text": "My husband wears SAXX and I wear Jockey for women, no lines underwear. They are very thin and both dry quickly."}, {"username": "Toni Jewett-Chavez", "comment_text": "Thank you everyone. As usual great advice from all. Happy travels to all"}, {"username": "Lisa Nordby Robilliard", "comment_text": "After hand washing your underwear, roll it up in a clean towel, stand on it to squeeze excess moisture out, hang to dry."}, {"username": "Jenn Messina Babore", "comment_text": "If you are going in summer, they will dry within an hour it’s so hot."}, {"username": "Nancy LaMalva Kierstead", "comment_text": "Exofficio"}, {"username": "Dana Green", "comment_text": "Just go commando 😉😎"}, {"username": "Tami Sue", "comment_text": "Look up underwear for working out."}, {"username": "Carol Ryan", "comment_text": "Just don't wear any. LOL."}, {"username": "Jenn Roberts", "comment_text": "Ex Officio"}, {"username": "Mary Brown", "comment_text": "If you are going in the summer, keep in mind you will sweat. There were days I took 4 showers a day and went through 3 pairs of underwear.\n\nWe also did 15 days with COO but 2 of our accommodations had a washing machine.\n\nLastly, to answer your question a thin polyester￼, stretchy looking fabric dries fast.\nFor men underarnour carries them"}, {"username": "Elena Eckley", "comment_text": "Cotton"}, {"username": "Anna Conroy", "comment_text": "I buy new undies once a year. I put aside the old ones (usually 15) to use during trips. I don’t wash them, I throw them out. Also use panty liners."}, {"username": "Patti Tennyson Mounts", "comment_text": "I'm not sure if they still have them, but REI had underwear that is quick dry."}, {"username": "Beverly Kerr", "comment_text": "ALTHEANRAY Women’s Seamless Hipster Underwear No Show Panties Soft Stretch Bikini Underwears Multi-Pack"}]}, {"id": "2201820906883654", "text": "United against cappuccinos after 11.30 am!\n;)\nWe Italians are pretty serious about this;)\n\nHave a laugh everyone..nobody will call the police if you order a cappuccino in the afternoon;)", "link": "facebook.com/groups/1373361046396315/permalink/2201820906883654/", "likes": 43, "comments": [{"username": "Romy Coops", "comment_text": "If I go to a country I respect their culture and rules. If this is the rule then everyone visiting should accept. Annoys me that people want to visit a foreign country but imposes their values and actions on them"}, {"username": "Simona Patrizia", "comment_text": "Il cappuccino puoi prenderlo a qualsiasi ora, al bar. Non chiedetelo al ristorante, come bevanda, insieme agli spaghetti."}, {"username": "Laura Laura Brescia", "comment_text": "Ordering a cappuccino at 9pm with your dinner it’s like ordering champagne at 7am with your croissant 🤣 sorry"}, {"username": "Dimitri Pianese", "comment_text": "It's not a strict rule!! Do whatever you want!! As Italian, I had cappuccino after 12 o'clock but never from lunch on. It would be quite strange to me to have cappuccino after a tasty dish of pasta or a second course but I don't complain foreign people who do that."}, {"username": "Carine Brys", "comment_text": "Ordering cappuccino ends at 11:30 because that is when \"l'aperitivo\" starts! 🤣Order an Aperol Spritz or a Limoncello Spritz. No need to wait till 5 PM in Italy! 🤣"}, {"username": "Marko Lone", "comment_text": "🚫 🍕 🍍"}, {"username": "Isabelle Avl", "comment_text": "Having a cappuccino at the end of a meal or adding pineapple on pizze is a sacrilege against Italian culture 😂 But believe me, it’s ok if you do it.\nThey won’t bite.\n\nThey might raise their eyebrows out of despair though 🙄"}, {"username": "Denis Claros", "comment_text": "unis pour les capuccinos 24/7. surtout avant l'heure du coucher 🙂"}, {"username": "Nicola Ramoso", "comment_text": "It's not a rule, me and my ex-girlfriend ordered a cappuccino once at 2PM and no one batted an eye, and we're both Italians. It's not ideal of course to have one straight after a meal that's true but in general is not something to be scoffed at."}, {"username": "Vesna Komat", "comment_text": "Vesna Ana 😎"}, {"username": "Shirley Lewis", "comment_text": "of course you can order after 11:30 but you're certainly marked as an unsophisticated\nrube 🙂 🙂 along with ordering well done Florentine steak ... which you won't be able to get!"}, {"username": "Paola Bersano", "comment_text": "I'm italian, live in the very north of the country and nobody here rolls an eye when we order cappuccino and croissant at 4 pm 😀"}, {"username": "Donna DelGreco", "comment_text": "I am wondering why anyone would care what others eat or drink. feels like the world might have bigger problems"}, {"username": "Maria Angela Perrone", "comment_text": "It's just a cliché. When I am in Italy I drink cappuccino at any time."}, {"username": "Amy Orosho", "comment_text": "Sono italiana ma non ho alcun problema ad ordinare un cappuccino al bar a qualsiasi ora.\nNessun barista mi e sembrato mai essere troppo turbato dalla richiesta.\nÈ solo una questione di abitudine personale e non facciamola passare per una regola.\nIl bar serve cappuccino a tutte le ore.\nDiverso il discorso per i ristoranti. Solo ristoranti abituati a turisti stranieri servono cappuccino a pranzo o a cena, per gli altri spesso non è nemmeno nel menù."}, {"username": "Mufaro Jamu", "comment_text": "😌"}, {"username": "Terri Brinkman", "comment_text": "According to these sad comments, Italians aren’t allowed to joke-please, tell more….clearly the world needs to learn how to laugh, I would say again, but some of these people are just pathetic and probably never have laughed!"}, {"username": "Daniele Morani", "comment_text": "I'm Italian and frankly this rule is utterly stupid. In Italy we have Caffè Macchiato, Espressino and Cappuccino and they are the same thing: coffee and frothed milk in different quantity. Caffè Macchiato and Espressino are perfectly fine to have in the afternoon, Cappuccino is not. How stupid is that? So tip: if you're in Italy have whatever the hell you want, anytime you want. Nobody would refuse to serve you anything as this is ILLEGAL."}, {"username": "Antonia Dosik", "comment_text": "I have a question that is not to do with cappuccino, but with another thing that is also common in France. Why are there no ceiling fans? In fact no fans of any kind anywhere. The weather is quite warm here in Torino, but not a fan in sight? How come?"}, {"username": "Josephine Rauch Rotunda", "comment_text": "Really not true….most places will gladly make you a Cappuccino anytime of the day…they have gotten over our habits which may be different than their’s. Would you refuse anyone ketchup on their hotdogs!😳🤔"}, {"username": "Laurie Denoni", "comment_text": "Even without the addition I believe most readers could see the humour. I have been told by my relatives that some Italians might stop at the bar in the afternoon for a cappuccino it is not traditional and they would never order one after a meal. Usually cappuccino is mornings with sweet breakfast. Tourists can ask and do whatever. Some travellers are interested and want to follow traditions."}, {"username": "Andrea Romano", "comment_text": "Caffe nero for me🖤"}, {"username": "Manuela Marinello", "comment_text": "I guess they didn’t get the joke 😹"}, {"username": "Michael Widjaja", "comment_text": "When in Italy,gotta have the regular coffee…\n\nAnd of course things won’t be like in the picture in Italy 🤣🤣"}, {"username": "Angela Gilmore", "comment_text": "During winter, I often have a cappuccino in the afternoon.\nI am Italian 😅\nAnd if I wake up at 12am or 1pm I will always have a cappuccino first🙈"}, {"username": "Robýn Kretsçhmər Schuchårdt", "comment_text": "Hopefully I'll have moved on to a spritz by that time"}, {"username": "Miriam McNally", "comment_text": "I'm wondering can one get a T-shirt with this printed on it 😉"}, {"username": "Angela Borghetti", "comment_text": "Does it really matter!!! FFS!!"}]}, {"id": "2201927823539629", "text": "How does one get fromNaples airport to Sorrento and then back to the train station. Travel agent is quoting $500. I know we are going to be tired when we arrive is this worth it? Due to some rude comments I am not dumb and yes I googled options. Maybe I should have asked if anyone used a different reputable transport service? Rude people if you have nothing positive or useful how about you don’t post? I was just telling my son what a wonderful group this is and have been a lifesaver!!", "link": "facebook.com/groups/1373361046396315/permalink/2201927823539629/", "likes": 88, "comments": [{"username": "Jan Darlington Meier", "comment_text": "Notify Moneti family"}, {"username": "Bev Madill", "comment_text": "I recently used a great shuttle service called Transferelax. They were nice people and easy to deal with. Just ignore the rude people. Wish they’d just keep scrolling. Enjoy your trip."}, {"username": "John Wilson", "comment_text": "Looks like there's a shuttle bus to Sorrento from the airport"}, {"username": "Kathleen Doody Gallagher", "comment_text": "We took the driver. There were 5 of us with our luggage and we welcomed the lift. Our trip wasn’t $500, it was about half that."}, {"username": "Melissa Therrien", "comment_text": "We took the bus from Naples airport to Sorrento, was pretty easy, catch it at the airport. Have to buy ticket in airport then walk about a block or two to catch it. Was comfortable but took about an hour and 15 min I think."}, {"username": "Julieta Sommariva", "comment_text": "I was there a month ago. You can take the train from Naples. You have two trains, the Campania ($15) is better but it only departures 3 times a day, if you missed one it could take hours until the next one, on the other hand the circumvesiana train ($4) runs often but be careful because it could get super busy (pickpockets) and has lots of stops. I think it takes 25 more minutes (compared with the Campania) to get to Sorrento. Both do the same route but one is for tourists and the other for locals. Good luck! Feel free to reach out to me if you have any questions!"}, {"username": "Debra Kingston", "comment_text": "You can email your hotel, if staying at one, or google Sorrento or positano transfers.\n$500 sounds high.\n$300-400 sounds more realistic.\nYes, u are smart to take a car service to Sorrento."}, {"username": "Soc Cer", "comment_text": "The easiest way for us is to get a transfer from Naples to Sorrento...righ\nt to your hotel. There are many companies that can transfer you...just google and check out the prices. You can also take a train but it's not as comfortable as the fast train.....crowd\ned, etc. ....you can also take a water ferry/taxi or bus."}, {"username": "Lorrie Nolan Masset", "comment_text": "Try Rome2rio app."}, {"username": "Nancy Cicinelli", "comment_text": "Me and my daughter took bus only 10 euros each and stops at most hotels in Sorrento"}, {"username": "Joan Havard", "comment_text": "Check Rome to Rio site. I think it is 18 euro on Campania Express."}, {"username": "Linda Papavero Snyder", "comment_text": "We are taking a cab from the Naples airport to the waterway and then we are taking a ￼ ferry to Sorrento in the fairy back from Sorrento , I believe it’s only $25 a person each way on the ferry from the Naples port to Sorrento"}, {"username": "Simone Gore", "comment_text": "I am so sorry people are so rude to you . I am organising a trip next year with my daughter my 60th her 30th very special. First time in Europe I am to scared to ask advise on this group very sad"}, {"username": "Sara Bee", "comment_text": "We rented a car in Naples ad we drove. If you don;t feel like doing that, there is a train from Naples to Sorrento and takes about 1 hour and 15 minutes. It will all depend on what time of the day you land.\nIf you have enough days, consider stay in Naples the first night (its absolutely beautiful) and then make your way to Sorrento on the next day."}, {"username": "Linda Tibbles", "comment_text": "Look up Viator shuttle bus transfers. They operate from airport and train station, central. Also, try Get Your Guide. I went with Viator, as the private transfer was over the top. Be warned- big jump in prices charged, if it is a weekend, starting Friday. Good luck."}, {"username": "Tami Sue", "comment_text": "I'm not sure what your time frame is but taking a ferry is an option."}, {"username": "Kelly Benson", "comment_text": "Train is always the best option\nIt’s cheap\nTaxi will be about €120 each way"}, {"username": "Margaret Scott", "comment_text": "I have booked through Viator and much less than you have been quoted. Quite easy to book on line. Good luck and happy holidays. We are arriving on Friday.❤️❤️"}, {"username": "Debbie Zioni", "comment_text": "Curregi bus"}, {"username": "Ionia Mazzocca", "comment_text": "I need to know if there is a bus shuttle service from Bari main railway station to Bari air port. I need to fly to Venice. Thank you."}, {"username": "Etschi Bruckner", "comment_text": "there´s a direct bus from Napoli airport to the trainstation in Sorrento for about 10.- euro - from there you can walk or take a cab to your accomodation"}, {"username": "Carol Kelly", "comment_text": "Try using the Rome2Rio App. It gives you al your transportation options between two points. It includes waking, bus, train, plane etc all sort of options. It includes the details too, distance, time, price estimates,. route . It’s a great App that I use all the time."}, {"username": "Sonya Rogers", "comment_text": "We have done this two ways, the train is simple and cheap, but after a long journey to Naples it's slow hot and tiring. We also have done a private transfer for €100. In my opinion if you can afford to, go with the transfer. Enjoy🇮🇹"}, {"username": "Ruth Hackert", "comment_text": "I asked our Airbnb for a transfer, it was 150 Euros each way"}, {"username": "Bernadette Breen-Shinner", "comment_text": "Get the ferry"}, {"username": "Maree Peel", "comment_text": "Check out the Campania Express train from Naples to Sorrento, it’s a dedicated tourist train that takes 30mins less than the local train. Plus it has air con, dedicated seating and luggage space. It costs about 15eu pp."}, {"username": "Rob Robinson", "comment_text": "Bus from the airport to Naples main train station, 5€ each. Train from the main train station to Sorrento, 3.7€ each. Train takes as long as a taxi."}, {"username": "Susan Hobrath", "comment_text": "I’m using Jack the Driver.. my cousin used him when she went to Italy she highly recommended. ￼ He’s picking us up at the train station and taking us on an eight hour tour to Pompeii Amalfi coast and Postiano. Then to our hotel for 450 for three people. But on the way back, he’s picking us up at our hotel and taking us to the airport in Naples charging us 140 bucks for three people. Seem very reasonable to us. ￼ And no hustle and bustle with trains."}, {"username": "Lorraine Baker", "comment_text": "I've done it several times by transfer booked with Viator. Reasonable prices."}, {"username": "Libertie Oknames", "comment_text": "#admin"}, {"username": "Gina Mingo Alfonso", "comment_text": "Check with the owner or hotel where you are staying? I was able to get a car from Naples Train station to Sorrento for 110 euro for 4 people through the owner. If you want DM me and I can provide the information I have."}, {"username": "Martina Larkin Keighery", "comment_text": "Find the Stazonie office in Naples central station they are very helpful and great service. They have their own carriage on the train. They walk u to the platform. Train for two to sorrento & boat to Capri return for €109. Share a taxi of 6 from the airport for €5pp"}, {"username": "Lianne Buchanan", "comment_text": "We paid Euro 180 from Naples to Praiano x\nBook a private taxi in advance z"}, {"username": "Erica Styan", "comment_text": "We did find a private transfer I’ll look for the company but I believe it was thru Viator and was like 150 pr person"}, {"username": "Shelly Kentner Lehman", "comment_text": "No way I’d spend that to get there, that is to expensive. Just take the train to get there. That’s what we did and it didn’t cost hardly anything. Have fun what ever you decide"}, {"username": "Louise Manticos", "comment_text": "I’ve also researched this. If you would prefer a private driver, it will cost about 98 euro depending on the time of day and how many people. I am doing the reverse.\n\nhttps://\nwww.ziptransfers\n.com/en/\nnaples-airport-t\nransfers/\nnaples-airport-t\no-sorrento"}, {"username": "Arina Aquarius", "comment_text": "Michelle first alibus to naples train station and book the express train from the train station to sorrento for 12.50 each way"}, {"username": "Judith Thomson", "comment_text": "Sorry to hear this has been your experience🌸. We have booked a private transfer with info@guemartrav\nel.com from Naples airport to Sorrento 5 plus luggage for €140. Giulio has been super helpful and we have also booked a private 8 hour tour with them for the next day €400. Hoping this is helpful 🌸"}, {"username": "Arlene Soriano Concepcion", "comment_text": "Assuming that you'll be going straight to your hotel- I would email them directly for options. Mine was able to provide several options."}, {"username": "Jeannie Fritter", "comment_text": "We went from Amalfi to Naples centrale and it was only $160 for us… another company quoted us $140… we used Sorrento limos for $160"}, {"username": "Joy Ascolese Rosini", "comment_text": "We used a car service that we booked through our hotel. We actually booked all except one tour through our hotel and we had an amazing trip"}, {"username": "Melinda Bourke", "comment_text": "I think would be around 150 euro total each way, that is what we paid to Positano from Naples Airport. Ill send u the drivers whatsapp as was recommended from this page."}, {"username": "Debra Zee", "comment_text": "My daughter did this two weeks ago. There is a shuttle bus that goes from outside the airport terminal into Sorrento. It’s super easy and you can buy your tickets online before hand.\n\nThis is what we used a couple times.\nEasy Peasy."}, {"username": "Mel Issa", "comment_text": "Book a transfer through booking.com. We used them last month & they were reliable, professional & well priced. We paid Aud $150 for a tfr from Sorrento to Naples for 7 people plus all our luggage. We were met with a man dressed in a beautiful suit in a Mercedes van. 😎"}, {"username": "Kerrie Johnson", "comment_text": "If I take the ferry from Sorrento to Naples, how far will I be from the Naples train station? I have to then continue to Rome. But I thought it would be nice to do the ferry."}, {"username": "Shelly Stowell", "comment_text": "We did private transfer. 150. But it was at midnight. There is a bus for way cheaper."}, {"username": "Karen Galloway", "comment_text": "Try the Curreri bus from the airport to Sorrento"}, {"username": "Kelly Barfield Burchill", "comment_text": "Clreachnout to him to ask price. He was GREAT"}, {"username": "Christine Broussard", "comment_text": "We are going to catch the ferry as that’s the way you get the view of the coastline all the way to Sorrento and us a lot cheaper"}, {"username": "Jeff Gentner EA", "comment_text": "Well worth it. Nothing like getting off a train or plane, only to be greeted by a driver holding a sign with your name on it. The driver already knows where to take you. Peace of mind. You'll never regret it."}, {"username": "Tracy Perez Abreu", "comment_text": "https://\nwww.rome2rio.com\n/\n\nI usually use this website or Viatour as someone else mentioned. Good luck and have a wonderful time. Safe travels 😊"}, {"username": "Amy Lou", "comment_text": "Use Rome to Rio app. I love it when traveling!"}, {"username": "Ilana Brongiel", "comment_text": "Try daytrip.com. Private drivers and I was quoted $157 each way. Otherwise there is a train that goes from the Naples station to the main are of Sorrento and it’s about an hour."}, {"username": "Angela Marie", "comment_text": "I just searched private transport cost was 140 w/tip he picked our daughter up at the base and meet us at the airport and took us all to Sorrento"}, {"username": "Nadia Dwyer", "comment_text": "Our hotel quoted €130 one way for a pickup from train station just as a guide. If you prefer to diy download the Rome to Rio app & it’ll give you transportation options , prices & route numbers"}, {"username": "Patty Driscoll Servaes", "comment_text": "We rented a car, worked out great"}, {"username": "Lauren Piper", "comment_text": "Why do obnoxious respon"}, {"username": "Elizabeth Garcia", "comment_text": "Take a taxi from the airport to the Naples train station and then take the train to Sorrento. It is very easy."}, {"username": "Gail Bielskis", "comment_text": "The Curreri Viaggi bus from Naples Airport to Sorrento -get tickets online\ntook it in May\nluggage gets stored underneath/15 euro pp\nnice ride\nCampania Express train from Sorrento to Naples\nalso took in May\nget tickets online"}, {"username": "Judy Aaby", "comment_text": "I got on TripAdvisor and hired a driver."}, {"username": "Susan Cantafio", "comment_text": "Sorry someone was rude this web site is to help people"}, {"username": "Mary Iuor", "comment_text": "Don’t listen to peoples comments. Find ways that work for you. I’m sure there are many options and prices."}, {"username": "Theresa Sorrentino Pagan", "comment_text": "Ferry!"}, {"username": "Renae Larcus", "comment_text": "We took the train. Easy"}, {"username": "Christine Pinto Kulp", "comment_text": "Taxi from Naples airport to train station, commuter train called Circumvesuviana\nto Sorrento and then train back to Naples train station. The commuter train is slow but it’s a very difficult drive."}, {"username": "Andresa GB", "comment_text": "Less than 1/2 you can hire a private transfer"}, {"username": "Shanna LaDelfa", "comment_text": "We used Barbaro Car Service for 6 people, both ways. 180 Euro each way. A month ago. They were great!"}, {"username": "Danielle Moselle Hewitt", "comment_text": "We paid for the private transportation each way and it was 500 for the 7 of us and we felt it was worth every penny!"}, {"username": "Vanessa Durkin", "comment_text": "Ferry or train try to book tickets on line with trainitalia or omio also.lots of good advice on trip advisor good luck"}, {"username": "Janine Emma Lucas", "comment_text": "Are you flying into Naples, then directly to Sorrento?\nThen on another day you need to get to the train? Train in Sorrento or Naples? Train to where?"}, {"username": "Rosemarie Furnari Cisluycis", "comment_text": "I booked a private taxi to take us from the Napoli train station to Sorrento with a stop in Hurculaneum. 2 people $200."}, {"username": "Jan Buess", "comment_text": "Just doing private car. I hired one from Positano to Naples airport for 150EU"}, {"username": "Baba Aga", "comment_text": "Shuttle bus (follow the signs outside, ticket is 5euro) or a taxi (around 25 euro) from the airport to Napoli centrale and then a train to Sorrento."}, {"username": "Virgz Van Møøre", "comment_text": "Take the bus ! And get an other travel agent !"}, {"username": "Lesley Nesbitt-Blanchard", "comment_text": "I contacted our hotel in Sorrento and they are arranging a transfer for us for 100 € to pick us up at the train station . When I looked around, it was all kind of the same price, some considerably more."}, {"username": "Yvette Pavone", "comment_text": "Sorey people were rude. Try suntransfers.co\nm."}, {"username": "Michelle Prince", "comment_text": "We got a private transfer through mytransfers.com think it was about £200"}, {"username": "Tracey Purdy", "comment_text": "The house we are staying at in sorrento is run by sorrento vibes. They organised a transfer to and from Naples for 8ppl €150 each way. They’ve also set up private boats for 2 days as well. They’ve bn great to deal with."}, {"username": "Karen Doblo", "comment_text": "We are using Sorrento Ironman Travel for 4 people, pick up at FCO to Sorrento with a stop at Herculaneum .\nCost €550"}, {"username": "Haven Houllis Chrysakis", "comment_text": "I just came back from Positano thru Sorrento to Naples today. We also took the same transfer a few days ago from the train station in Naples to Positano. Used Daytrip it was €221 each way however that was for a large Mercedes van that could fit 7 plus luggage ￼it’s cheaper for smaller cars and will be cheaper because you are only going to Sorrento"}, {"username": "Dina Garrett", "comment_text": "Linda Williams, Julie Franco Mellow, BillandAngala Verley"}, {"username": "Dayna Scinto", "comment_text": "It’s worth paying the extra $$$ for a private transfer V’s train/bus/\nferry in my opinion but all relative to what your budget is."}, {"username": "Andrea Arango", "comment_text": "For a driver I paid about 100 each way. I know there’s some sort of shuttle you can take from Sorrento to the train station too but I’m not sure what the name is"}, {"username": "Nikki Blosser", "comment_text": "I agree people are getting more rude in my travel groups. It is sad."}, {"username": "Kasia MacDuda", "comment_text": "sometimes its cheaper to just rent a car."}, {"username": "Melody Ritchie", "comment_text": "Try mydaytrip.com they were awesome to deal with, we used them twice and quite reasonable prices 😊"}, {"username": "Lucrezia Folger", "comment_text": "WOW!! Have a great time."}, {"username": "Holly Brown", "comment_text": "https://\nwww.rome2rio.com\n/ if you type in your start and finish locations this gives you options and approximate cost! Hope it helps."}, {"username": "Kristine Cameron", "comment_text": "Download Omio and take the train. Super easy and only $3.50!"}, {"username": "Deidre Nicole Williams", "comment_text": "I like to use this website Rome to rio link below . But yes there are many less expensive ways to get to sorrento. If it were me i would take the bus or taxi to Napoli central train station and take a train right into Sorrento . If you have light luggage and arent to tired you could taxi to the ferry and take it over. They have trains leaving every 30 mins to Sorrento . And it looks like the train tickets are quite reasonable like 10pp\n\nhttps://\nwww.rome2rio.com\n/map/Naples/\nSorrento?source=\nadwords&gclid=E\nAIaIQobChMI9q7L\noeu0gAMVeTfUAR3\nd3giaEAAYBCAAEg\nJ0-PD_BwE"}, {"username": "Bethany Morrow", "comment_text": "We booked a private driver in an air-conditioned\nMercedes van from the Naples airport to our hotel door in Sorrento for 150 euro. Well worth it for us after a long day of travel"}, {"username": "Laura Storie Dolinar", "comment_text": "Hello Michelle, not sure of your party size but my brother used daytrip and welcome pickups both were 150-160 one way for 2. He said we’re prompt and professional."}, {"username": "Jamie Carney Moeller", "comment_text": "Michelle Plutto I’m going in October and going to take a ferry from Naples to Sorrento. It’s all about the adventure to get there! Plus, it's about half the time of bus or car and not expensive - under $20 pp."}, {"username": "Phyllis Snyder", "comment_text": "Get Rome2Rio app! Fabulous in getting information on transportation-\nanywhere in Italy."}, {"username": "Rebecca Carroll", "comment_text": "Here’s the reason I would NEVER use scammer. I mean travel agent. They once quoted me 10,000 for three of my friends to travel to Ireland for two weeks. I laughed in her face. We did it for 3,000 for everything… wtaf are these people thinking?"}, {"username": "Cynthia McDonald", "comment_text": "We take the boat or train."}, {"username": "Lisa Walkow Bonchonsky", "comment_text": "We used Transferelax when going from Naples train station to Positano last month. They were great. Very reliable. Totally worth it. I know Sorrento isn't quite as far as Positano, but they charged us $280 round trip, just to give you an idea."}, {"username": "Paula Bennett", "comment_text": "Try Amalfi Coast transfers. We’re being charged that for a full day driver along the coast. Talk to Nena."}, {"username": "Jeanne Hildebrandt Fedoryk", "comment_text": "We used positanolimoser\nvice.com from Naples to Positano for 150e"}, {"username": "Donna Watson", "comment_text": "The train was easy and very cheap"}, {"username": "Anna Criscuolo Gebstadt", "comment_text": "Take the train. Did it many times."}, {"username": "Charlene Noll", "comment_text": "The ALi bus is a bus that circulates about ev 20 minutes between Naples airport, the train station and the port. 5 Euro per person. The bus station is across the street from the train station. U can take a ferry from the port to Sorento, or the train.\n\nRecommend the app Rome2Rio"}, {"username": "Karen Lawrence Smith", "comment_text": "We used TransferRelax and it was about$130 each way"}, {"username": "Karen Lawrence Smith", "comment_text": "You can also use Rome2rio. It will give you all options and $$$"}, {"username": "Brenda Fife", "comment_text": "Try airportstaxitra\nnsfers.com. We’ve used them in several countries. Easy, reliable and worth it to us to have someone greet us, help load/unload luggage and drive us to our door after overnight flight.🤗"}, {"username": "Amanda Martin Rebeka", "comment_text": "We just used the local train and it was fine. Hot and little long, but very inexpensive and efficient and I’d rather spend my money on other stuff!"}, {"username": "Angela O'Donnel", "comment_text": "I just used the bus this morning to go from Sorrento to Naples airport. So easy and cheap. It cost 10 euros took about 1.5 hours. Curreri viaggi is the bus. You book directly online. We arrived very late at night so took a private car there 129 euros, but going back took the bus at 9 am"}, {"username": "Jo Browne", "comment_text": "There is a train from Naples central station to Sorrento. It takes about an hour and costs about 4eur each way per person. Very easy to navigate. We did it about 3 weeks ago."}, {"username": "Melissa Feielin Hawkins", "comment_text": "Just Stayed in Praiano earlier this month. We took a train into Naples. I reached out to our hotel and they arranged a private car to pick us up. Was 100 €\n\nYou also can take the bus for less"}, {"username": "Marcia Slivka", "comment_text": "Amalfidrive4you\n. Excellent service."}, {"username": "Roland Trego", "comment_text": "Someone wants to make a killing! If you take the shuttle or taxi to the Naples train station, this may be useful: Getting to Sorrento from Naples:\nhttps: // www . sorrentovibes . com/\ngetting-from-nap\nles-to-sorrento\n-best-route-202\n3/"}, {"username": "Paris Buchanan", "comment_text": "Luigi De Martino is the best driver! Used him for 17 years you will love him"}, {"username": "Michelle Lien-Burdick", "comment_text": "We rented cars ... I do not recommend unless you have nerves of steel. Good luck!"}, {"username": "Bridget Gieseke", "comment_text": "Arrive in Naples. Check with your lodging about a private car or are you only looking for a day trip?"}, {"username": "Colleen Dee", "comment_text": "It’s too bad your TA did not give you all the options. They work on commission & obviously don’t get one if you take the train & you are right about Google searches - you can get some good results but it’s an overload of info & sadly some scams. This is why this group is so great. ￼ I personally have only been to Italy one time, but I found the trains to be fast, & clean & ￼after a nervous first time figuring it out, very easy to do. FYI traveled to Venice, Rome, Florence & the towns of Cinque Terre. Cinque Terre was a commuter train & not as luxurious but a very fun adventure. Did a wine tour with a company via Viator & it was one of the highlights of our trip."}, {"username": "Nancy Fricke Corsi", "comment_text": "Private transport. Sorrento Transfers"}, {"username": "Monica Roman-Fazio", "comment_text": "Call the hotel you are staying at they might deal with a company. From Naples to sorrento it's a hour and a half we were just there. Our hotel even booked us on tours"}, {"username": "Lynn Crane", "comment_text": "$500??? Wow. No, just book a private transfer. We did JoeBanana, but there are others probably cheaper."}, {"username": "Debbie Potter", "comment_text": "I see a lot of sarcastic rude degrading comments and wish people would stop... if you live in Europe, ...(yes Paul Vincent, I'm aiming that at you).....then you know the transportation system... good for you. But for others who have never been to Europe and just have a simple question about transportation,\nplease be kind and help them kindly. I'm just sick of the degrading comments. We all joined this group to get helpful ideas."}, {"username": "Marsha Ross", "comment_text": "We used an app calked Daytrip and also Simply Amalfi. They both do transportation.\nI enjoyed using them as we didn’t have to drive..they pick you up and drop\nYou off and saves a lot of time!"}]}, {"id": "2202290853503326", "text": "Highly highly recommend ‘The Open Space in Historic City Centre’ in Lucca - found on booking.com - the host Gherard is amazing, had cold water waiting for us and a local bottle of wine! He’s sent us lots of recommendations too ❤️", "link": "facebook.com/groups/1373361046396315/permalink/2202290853503326/", "likes": 49, "comments": [{"username": "Karen Blackmore", "comment_text": "Looks fantastic!"}, {"username": "Dámaris Ojeda Fernandez", "comment_text": "En booking con ese nombre no aparece. Puedes por favor enviar el enlace?gracias"}, {"username": "Rhona OConnor", "comment_text": "Funky looking!"}, {"username": "Liz Shermeto", "comment_text": "Are there local wineries or wine tasting rooms in Lucca you can walk to?"}, {"username": "Kate Morrison", "comment_text": "Interested in his recommendations\n. Have a week jn Lucca in Sept."}]}, {"id": "2202340390165039", "text": "Contemplating trying to do a trip next July/Aug to Italy with my husband, 4 grown daughters and my mother who is in her 70s. Thinking of renting a villa in Umbria with a pool- we like to cook and hike and see different areas. I know trying to do Rome etc will be too stressful with a big group. (Although maybe since we fly in we should spend a day or 2?)\n\nWe would want to have a car or 2 to get around to and from the villa and surrounding areas. Is this realistic? How do we do this and not have to drive in Rome? Could we take a train to the outskirts of Rome and get a car there?\n\nWould it be better to fly into Florence and spend a couple of nights there and then rent a car from there and just avoid Rome? Our daughter lived in Florence for a few months a couple of years ago so she is a little familiar with it.\n\nLooking for a low key trip- not trying to see everything. But would like to be able to get around and go to the local market or to see a beautiful nature spot.\n\nOh- also we are into mushroom foraging (the edible ones:) so if anyone has any suggestions on that we would appreciate!", "link": "facebook.com/groups/1373361046396315/permalink/2202340390165039/", "likes": 2, "comments": []}, {"id": "2202291033503308", "text": "On my last solo trip i wandered around Rome with no map or guide - just wandered. It was fabulous!", "link": "facebook.com/groups/1373361046396315/permalink/2202291033503308/", "likes": 23, "comments": [{"username": "Scott Perry", "comment_text": "The best way to travel!"}, {"username": "Mike Ball", "comment_text": "Love to do that, I’ve never been one for organised tours or having a set plan, you often discover hidden gems doing it this way."}, {"username": "Dave Conroy", "comment_text": "I've seen so many great things off the beaten track ..."}, {"username": "Steve Watkins", "comment_text": "Us too. Perfect way to serendipity"}, {"username": "Krissy DaRusso", "comment_text": "I’m here now trying to do that but it gets so hot and it’s so busy!"}]}, {"id": "2202291150169963", "text": "Any help would be great! Visiting Sorrento in early October, what is best reccomendation to get from Naples airport to Sorrento? Car service? Can anyone recommend one? Also traveling by train from Sorrento to Rome for a day, should we get our tickets beforehand or can we purchase the day of? Also any recommendations for things to see in Sorrento or surrounding towns. I know I’m asking a lot, thanks for your time!", "link": "facebook.com/groups/1373361046396315/permalink/2202291150169963/", "likes": 0, "comments": [{"username": "Sue Sherwood", "comment_text": "Take the ferry. It's much more fun then a car ride..."}]}, {"id": "2202295370169541", "text": "Travel tip when in Rome and you are visiting popular restaurants that don't take reservations for lunch or dinner (I.e. Tonarello, Trattoria da Enzo, Piccolo Buco, Ostaria da Fortunata, etc.)\n\nWhen you arrive at the restaurant and you don't see a line in front of the door don't get overlly excited thinking \"Perfect Timing!\".\n\nThere is always a line just look around to find where it starts. It's usually across the street. Hope this helps!", "link": "facebook.com/groups/1373361046396315/permalink/2202295370169541/", "likes": 1, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2202302906835454", "text": "Hello! Has anyone every used BlablaCar buses? May you please share your experience?❤️", "link": "facebook.com/groups/1373361046396315/permalink/2202302906835454/", "likes": 0, "comments": []}, {"id": "2202303430168735", "text": "Im deciding between these 3 options-\n\n1. Going to Milan and do a day trip to Venice\n\n2. Bari ( will try to visit alberbello)\n\n3. Rome\n\nWhich one do you advice me to go? If you have any suggestions feel free to send me your opinions.\n\nThank you! ☺️", "link": "facebook.com/groups/1373361046396315/permalink/2202303430168735/", "likes": 0, "comments": [{"username": "Deborah Lancaster", "comment_text": "All fantastic! Milan with a trip to Lake Como areas is also nice if you have time."}, {"username": "Francesca Veneziano", "comment_text": "It depends on what you find interesting.myh\nisband and I like Venice the least. It's very touristy, expensive food/drinks at a lower quality, we don't care for touring churches.\n\nWe LOVE Rome! We love the history and the architectural greatness there. You can do so many tours there! We've done the colosseum, the under the trevi fountain, food tours in Trastevere. To us, there is much more to do in Rome. It is tourity there too, but the more you venture and do your homework before traveling, the less likely you are to eat in the tourity areas."}]}, {"id": "2202320356833709", "text": "Has Anyone Done a Dinner Party at a host’s house in Rome that you can recommend? I tried to book with Barbara and Fredricko but they aren’t available on our date. TIA!", "link": "facebook.com/groups/1373361046396315/permalink/2202320356833709/", "likes": 1, "comments": [{"username": "Heidi Moore", "comment_text": "EatWith is a great site for booking this. Here is the one we did and it was a great evening! https://\nwww.eatwith.com/\nevents/\n26854?date=2023-\n08-26&seats=2"}]}, {"id": "2202320776833667", "text": "We will be in Italy 9/23-10/9\nWorking our way from Lake Como down to the Almafi Coast. Looking for the best phone apps. TIA", "link": "facebook.com/groups/1373361046396315/permalink/2202320776833667/", "likes": 1, "comments": [{"username": "Anthony Martini Jr.", "comment_text": "Google translate"}, {"username": "Scott Perry", "comment_text": "Trainline"}]}, {"id": "2202321046833640", "text": "Morning everyone. Wondering if anyone could point me in the direction of pearl shopping while in Italy . I thought I saw a post about this but cannot seem to find it now. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2202321046833640/", "likes": 0, "comments": []}, {"id": "2202323520166726", "text": "Given the changing weather and heat waves, what clothes are recommended to pack for Paris and Barcelona in the month of September? And am what month do the European’s take their holiday!", "link": "facebook.com/groups/1373361046396315/permalink/2202323520166726/", "likes": 0, "comments": [{"username": "Allison Mir", "comment_text": "Most Spanish take their holidays in August - for the whole month if they can afford it."}]}, {"id": "2202324563499955", "text": "We are planning a cruise out of Rome. We have 3 days before and 4 days after. We would love some ideas as to where we should stay and what to see while here. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2202324563499955/", "likes": 0, "comments": [{"username": "Donna Watson", "comment_text": "Definitely The Loft. Great location and very beautiful place. Booking.com"}, {"username": "Francesca Veneziano", "comment_text": "-The trevi fountain (underneath it too!)\n-Tour the colosseum at night (much cooler)\n-The Vatican (they have tours to skip the line)\n-Walking Tours to view major monuments of Rome.\n-Food tours in Trastevere (we loved this but we are big foodies!)\n-Boncis pizzarium (close to the Vatican)\n-I think we booked a few tours online via Air B&B and online by Google searching"}]}, {"id": "2202327253499686", "text": "I am getting ready to book our train tickets. It looks like for the 60+ you have to have a special card but the Me&you tickets have a discount. Other than not being refundable or changeable, is there any other caveat for these I should know about?", "link": "facebook.com/groups/1373361046396315/permalink/2202327253499686/", "likes": 0, "comments": [{"username": "Jennette Riches", "comment_text": "the 60+ generally is only good for Italian seniors due to the card you mentioned. I used the me&you tickets for the best price even though you will lose your money if they are not used, it at least is only a small amount."}]}, {"id": "2202327350166343", "text": "Please recommend a few nice (meaning good food)restaurants in Florence that have vegetarian options as 2 of the people we are going with do not eat meat or seafood. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2202327350166343/", "likes": 3, "comments": [{"username": "Jill Medrano Casey", "comment_text": "All the restaurants we ate at in Florence had some type of vegetarian dish. (We try to eat mainly plant-based). Just ask if the dish is vegetariano."}, {"username": "Laura Uribe", "comment_text": "There are a lot of pastas that don’t have meat or fish. If not, I’ve asked for pasta with olive oil and sautéed tomatoes or order without the meat (ie: Carbonara sans meat). Most restaurants have been very accommodating."}, {"username": "Gaia Almayer", "comment_text": "Brac, in Santa Croce"}, {"username": "Elena Innocenti", "comment_text": "Ribollita and pappa al pomodoro are 2 vegetarian typical dishes you can find in almost all restaurant in Firenze."}, {"username": "AgAnne Chrzanowska", "comment_text": "Osteria Vegetariana in Piazza del Carmine, for example."}, {"username": "Nancy Matheny", "comment_text": "I emailed my hotel in Florence and they provided me with a huge list of restaurants: traditional, vegetarian, sandwich, gelato, cocktail bars etc. I will add part of email for you to see"}, {"username": "Tony Downs", "comment_text": "As long as they are not Vegan any sit down restaurant will have a meal or two to choose from where we ate in Florence. Most are very accommodating. We had a very picky eater that they deleted some ingredients and added others based on diet."}, {"username": "Kristina Russell", "comment_text": "Ristorante Quinoa was delicious and has a beautiful courtyard. My husband is vegetarian, and this was his favourite restaurant from our trip earlier this month."}, {"username": "Mary Ellen Maatman", "comment_text": "We had an amazing meal at Cuculia. It was a $$$ splurge, but so, so delicious. I'm a vegan and my vegan options were out of this world. One of the two or three best meals I've had in my lifetime."}, {"username": "Ana Ka", "comment_text": "I am vegetarian too :). I love OBICA mozarella bar, its really great: https://\nwww.obica.com/\nrestaurants/\nflorence (a ton of options for vegetarians) and also this place: https://\ncantinetta-antin\nori.com/en/ - (they have amazing pappa al pomodoro - traditional tomato \"soup\" with bread and gnocci with spinach that i love!!! Also, Alla Vecchia Bettola has vegetarian tomato sauce pasta - one of the best you will find in Florence."}]}, {"id": "2202327380166340", "text": "Any experience with hotel\nAlbergo Cavalletto & Doge Orseolo in Venice ??", "link": "facebook.com/groups/1373361046396315/permalink/2202327380166340/", "likes": 0, "comments": [{"username": "Lindsey Britten", "comment_text": "Yes. We stayed for a few days in May this year. We had 2 single rooms. Wed booked a twin but were offered these. The rooms are quite small and room decor a little dated but the location is the best thing about this hotel.\n\nI suspect with so much crammed on the island all hotels have smaller than usual rooms unless very high end.\n\nIt’s a 2 min walk to st Marks Square. There is a small canal inlet behind the hotel where gondolas and parked of an evening. Sitting on the small balcony and watching the gondaleres tie up or prepare for the day in the morning was wonderful.\n\nThere’s a nice bar. Lots of good places to eat very close by."}]}, {"id": "2202327533499658", "text": "Hi everyone!\nWe are heading to Rome in September and see the Papal Audience Schedule is now available.\nHas anyone booked a ‘tour’ for this where they have your tickets for you and pick you up from your hotel? At one point I saw one place held a seat for you as well?\nAny advice and suggestions would be great!\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2202327533499658/", "likes": 1, "comments": []}, {"id": "2202330023499409", "text": "Hi! Looking into ways to get from Rome to Sorrento and was told it’s best to take the train to Naples and then private car to the hotel in Sorrento. What’s the average price for that private car?", "link": "facebook.com/groups/1373361046396315/permalink/2202330023499409/", "likes": 4, "comments": [{"username": "Pearl Lucero", "comment_text": "120-140… totally worth it. Especially if they can stop for lunch and wine tasting on the way like we did!"}, {"username": "Steve Grossman", "comment_text": "You can take the train to sorrento and save about seventy euros"}, {"username": "Jennifer Sadutto McKay", "comment_text": "Train taxi or ferry"}, {"username": "Carole Tarlap", "comment_text": "Last year, I went from Rome FCO to Sorrento. I used The Sorrento Shuttle\nShuttle@dtservi\nce.it. We stopped for snacks and the bathroom. 👍💥❤️"}, {"username": "Robin Burrell", "comment_text": "I think the train from Naples to Sorrento is fine. Take the tourist one."}, {"username": "Frances Scannapieco", "comment_text": "I was there last October and the hotel arranged for a car to pick us up from the train station. There was three of us and it was 150 euro."}, {"username": "Diana Sideris", "comment_text": "They charged us 160 for 4 people - we just went last week"}, {"username": "Simone Pfenninger", "comment_text": "Ca. 120 - 150 Euro from Napoli, one way"}, {"username": "Helen Newlinds Ezzy", "comment_text": "120"}, {"username": "Karen Albertyn Wood", "comment_text": "€150 for 4 people"}, {"username": "Karen Louise", "comment_text": "Just did this last week train to Naples short walk to piazza garibaldi then train to sorrento easy enough and cost less than five euros each for that part"}, {"username": "Marc Chomel", "comment_text": "You don’t have to take a car- there’s a bus from I think Napoli Centrale that will take you there . And I am sure there’s a return train/ bus."}, {"username": "Steve Grossman", "comment_text": "I think it's ninety euros.\nI assume you're going to take the train from rome to naples, And there is another train that continues on to sorrento\nfor about twenty euros"}, {"username": "Steve Grossman", "comment_text": "Also see the post below from karen louise"}, {"username": "Shelley Frise", "comment_text": "We used a company called book away and it was a 100 euros for the 2 of us. Great service"}, {"username": "Bev Madill", "comment_text": "Check with a shuttle company called Transferelax. I was very impressed with them."}, {"username": "Melissa Hunt", "comment_text": "Transferelax is 85 euros for 2 people"}]}, {"id": "2202332223499189", "text": "G'Day, anybody been to Puglia in October? Would love some tips. Take a full tour, daily tour with a local or rent a car and go all over with stops in local hotels every 2-3 days. Thanks,", "link": "facebook.com/groups/1373361046396315/permalink/2202332223499189/", "likes": 1, "comments": [{"username": "Elena Marchese", "comment_text": "October is a lovely month in Puglia, you can witness the olives harvest and some religious feasts. Stay in local hotels."}]}, {"id": "2202333350165743", "text": "Has anyone stayed at Hotel Emona in Rome? We are book for a week stay, leaving on Monday evening.", "link": "facebook.com/groups/1373361046396315/permalink/2202333350165743/", "likes": 0, "comments": []}, {"id": "2202336010165477", "text": "We will be arriving in Rome in May and need to get to Bolgheri to our B&B. Is it best to take regionale trains to the bolgheri station and taxi to Bolgheri town? Or should we use a private transfer from Rome all the way. It will be our first day in Italy so I’m nervous. Either way is a long trip from what I can tell. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2202336010165477/", "likes": 0, "comments": [{"username": "Steve Grossman", "comment_text": "Train and taxi is your best bet"}, {"username": "Tania Bourgoin", "comment_text": "There is no train to Bolgheri, the closest station is Cecina. Have you considered renting a car?"}]}, {"id": "2202339616831783", "text": "Planning to visit Milan Summer 2024. My main interests will be Varese (where my grandmother was born), Bergamo (where my great grandfather was born) and Como (where my great grandmother was born). Any recommendations on where to stay and how to travel between cities? We would like to take the train into Switzerland too.", "link": "facebook.com/groups/1373361046396315/permalink/2202339616831783/", "likes": 2, "comments": [{"username": "Giovanni Pianigiani", "comment_text": "Varese and Como are connected with a 50 minutes train which crosses through Switzerland. For Bergamo I'm afraid there's no direct connect and you'll have to go via Milano"}, {"username": "Karen Blackmore", "comment_text": "Recommend Le Funi Hotel in Bergamo. A wonderful place, with very helpful staff"}]}, {"id": "2202319120167166", "text": "Explore the traditional Tuscan town of Lucca: this lovely city will transport you back in time! Our local guide Patrizia will show you the highlights of this enchanting city. You will virtually stroll throughआणखी the cobblestone streets, bustling piazzas and old Renaissance walls of Lucca and you will see the birthplace of local composer Giacomo Puccini.\nJoin our virtual experience: https://nextstop-italy.com/virtual-tours/lucca-walled-city/\n\n#medievalart #italytravel #italyiloveyou #virtualworld #italytrip #vacationmood #italygram #tuscany #renaissanceart #renaissancetour #tuscanylovers #tuscanytrail #VirtualTour #art #lucca #luccacity #luccaitaly #bikelovers #history #historylovers", "link": "facebook.com/groups/1373361046396315/permalink/2202319120167166/", "likes": 3, "comments": []}, {"id": "2201756523556759", "text": "DAY 9 - LOCOROTONDO\nDid you know? Locorotondo means ‘round place’ and this small town is as delightful as its name suggests. Its round historical center is picture-perfect: small alleys and cute balconies!\nWhere… आणखी to stay: Pignarè Trulli...simply magical! A place for relax and discover the Itria Valley just 2 minutes away from Locorotondo and 10 minutes from Cisternino, Alberobello and Martina Franca.\nHave a look here: https://www.jdoqocy.com/click-100692842-11552042?url=https%3A%2F%2Fwww.tripadvisor.com%2FHotel_Review-g1056127-d21345455-Reviews-Pignare-Locorotondo_Province_of_Bari_Puglia.html%23%2Fmedia%2F21345455%2F604619233%3Ap%2F%3Falbumid%3D107%26type%3D2%26category%3D107\n\n\n\n\n#locorotondo #locorotondo_travel #itriavalley #alberobello #cisternino #puglia #pugliaevents #pugliamia #apulianstyle #apuliatravels #apulia #apulianholidays", "link": "facebook.com/groups/1373361046396315/permalink/2201756523556759/", "likes": 37, "comments": [{"username": "Michelle Cotoni", "comment_text": "Is the link for a hotel or private rental?"}]}, {"id": "2202203380178740", "text": "If I’m planning to go from Rome to Venice at night as i’ll move from Rome end of the day to arrive Venice next day early morning,\nWould you recommend night train or itabus ?please help", "link": "facebook.com/groups/1373361046396315/permalink/2202203380178740/", "likes": 0, "comments": [{"username": "निनावी सहभागी", "comment_text": "Up"}, {"username": "Jenn Messina Babore", "comment_text": "Train, but the overnight is longer. I’d take an evening train and get there in 4 hours instead."}, {"username": "Alessandro Iannelli", "comment_text": "Train over bus always, much more freedom of movement."}]}, {"id": "2202209633511448", "text": "I need to buy my train tickets from Rome to Florence and from Florence to Cinque Terre. We would like to use speed trains and first class. How do I go about? Any apps that you will recommend? Any insight will be appreciated.", "link": "facebook.com/groups/1373361046396315/permalink/2202209633511448/", "likes": 8, "comments": [{"username": "Melanie Izzy", "comment_text": "Look up ‘the man in seat 61’. Really great guide in how to book trains and the websites etc. We used this as guide to book out trains in Italy for September"}, {"username": "Suzanne Joslin Oliveria", "comment_text": "Omio app. There is a fast train from Rome to Florence about 90 minutes. Florence to LA Spezia to CT is regional. There is no fast train its about 2 1/2 hours"}, {"username": "Stacey Walker", "comment_text": "I am planning my trip and using Omio App. Just put in the destination / dates and choose the train. So easy."}, {"username": "Elizabeth Dancy", "comment_text": "I used the trentalia app. No issues and easy to use.\nRome to Florence was about $65 first class."}, {"username": "Rhona OConnor", "comment_text": "So many posts ask this question 🙋"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "You can get them at the train station in Rome or on line …. Depending on you schedule"}, {"username": "Virginia Speedy", "comment_text": "I found Italo and Omio the easiest sites to use and book. I don't think there is a fast train direct from Florence to Cinque Terra though."}, {"username": "Jenn Messina Babore", "comment_text": "TrenItalia and book Business rather than First"}, {"username": "Fetchin Gretchen", "comment_text": "I use the trainline app."}, {"username": "Claire Dowson", "comment_text": "I use the Trainline app. Easy to book and change trains."}, {"username": "Margaret Mackenzie", "comment_text": "Rome2Rio"}, {"username": "Fiona Cameron", "comment_text": "Trenitalia website gives you English option but you still have to use Italian place names (Roma, Firenze etc) easy to use, ticket is emailed, you can print paper copy as back up incase there are issues with your phone. You can also choose your seat. You can sort the options that come up when you search by journey time, this will give you the fastest trains."}, {"username": "Correen Pacht-Ralsky", "comment_text": "Frecciarossa 1000 best high speed train in Italy"}, {"username": "Frannie Kaplan", "comment_text": "Trenitalia"}, {"username": "JeriLynne Clifford", "comment_text": "I booked all 3 of my train rides on the Trenitalia app. Paid to upgrade so we could choose our seats and hopefully have room for luggage nearby. Just read the details like changes etc. also don’t forget it is in military time.\n\nI got the tickets and put them in my iPhone wallet.\n\nDoes anyone know if I have to still validate them if I bought them online?"}, {"username": "Jennifer Amen", "comment_text": "If someone already has train tickets, are they able to upgrade to first class when they get to the station?"}, {"username": "Sue Sherwood", "comment_text": "Trentalia. Use the app so if there are delays you get instant notifications. Super easy."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2202217796843965", "text": "So over the last few years I've been to Rome, Milan, Lake Garda, Venice, Verona, Bologna and Florence (San Marino state via Rimini). In a week what could I see for 2024? I go to Italy a few times.", "link": "facebook.com/groups/1373361046396315/permalink/2202217796843965/", "likes": 5, "comments": [{"username": "Silvia Urbinelli", "comment_text": "Torino, Parma, Mantova, sabbioneta, Cremona"}, {"username": "Kay Rendall", "comment_text": "Puglia. It is magic. Different to the rest of Italy. Not large cities, beautiful people"}, {"username": "Frances McDonagh", "comment_text": "I'll admit I do have my sights set on Puglia haven't been to that part of Italy"}, {"username": "Gillian O'Callaghan", "comment_text": "Sicily 👍"}, {"username": "Isabelle Avl", "comment_text": "- Portofino/\nCinque Terre/Lucca/\nPisa and a few miles away, you have the olive route (from Vicopisano to Buti)\n- Puglia is a must.\n-Also the amazing countryside of Tuscany and it’s agriturismi: Follow the wine routes (Chianti, Brunello..)\n- And obviously Costa Almafitana and Ischia/Procida/\nCapri (ideally in May or early June or September, but avoid July 15-aug 15)"}, {"username": "Sande Ricci", "comment_text": "Genoa."}, {"username": "Fetchin Gretchen", "comment_text": "Amalfi Coast"}, {"username": "Bev Madill", "comment_text": "Puglia - Majestic!"}, {"username": "Steve Grossman", "comment_text": "Amalfi Peninsula. We generally spend five nights there. There is a lot of stuff to do"}, {"username": "Stefano Bressanelli", "comment_text": "Lago Maggiore/ lago d'Orta/ lago d'Iseo/ lago di Varese. Ciao."}, {"username": "Austin Briscoe", "comment_text": "Sardinia"}, {"username": "Magdalena Wostal", "comment_text": "Puglia, Como, Toscana , Elba, Sicily , Calabria, Amalfi Cost, Capri👌"}, {"username": "Renae Larcus", "comment_text": "Lake Como, Cinque Terre"}, {"username": "Anita Clayton", "comment_text": "We have been to Rome, Sorrento, Lucca, Florence, Milan and Genoa so far this year. Tropea for us in September"}, {"username": "Sasha Childs", "comment_text": "Sorrento beautiful"}, {"username": "Pate Mears", "comment_text": "Amalfi Coast and Positano and Capri - all are exceptionally special."}, {"username": "Anthony Martini Jr.", "comment_text": "Pisa, Capri, Sicily, and perhaps Tuscany"}, {"username": "Elena Eckley", "comment_text": "ABRUZZO"}, {"username": "Roland Trego", "comment_text": "Le Marche or Puglia.\n𝗟𝗲 𝗠𝗮𝗿𝗰𝗵𝗲:\nMonte Grimano Terme\nMacerata Feltria\nFrontino\nMontefabbri\nCorinaldo\nMondavio\nMondolfo\nAncona\nUrbino\nMontefalcone Appennino\n𝗣𝘂𝗴𝗹𝗶𝗮:\nPolignano a Mare\nLocorotondo\nOstuni\nMartina Franca\nLecce"}, {"username": "Alicia Cox", "comment_text": "Wow - cinque terre area, Sorrento/\nAmalfi area, Tuscany area - pick one."}]}, {"id": "2202220966843648", "text": "Hi everyone. I’ll be in Rome on 19 and 20 September. Tickets to the Vatican are sold out on the Vatican museum site.\nAny advice on how to get tickets?", "link": "facebook.com/groups/1373361046396315/permalink/2202220966843648/", "likes": 1, "comments": [{"username": "Elizabeth Dancy", "comment_text": "Try Trip Advisor or Get My Guide.\nEarly entry guided trips were amazing."}, {"username": "Jenn Messina Babore", "comment_text": "Walk up line but go early"}, {"username": "Rhonda Weinstock", "comment_text": "Viator and CoopCulture might help for tickets."}, {"username": "Daniel Taylor", "comment_text": "Lara Jupp"}]}, {"id": "2202232163509195", "text": "Hi all, has any one used credit cards to get points for free flights? I have heard there are credit cards in America that you can use to spend mobey and earn points and then when your points are enough you can get free flight tickets. How does this work and is it worth to have one? I am from Australia and I am wondering if there is similar credit card in Australia? Thanks for the advice.", "link": "facebook.com/groups/1373361046396315/permalink/2202232163509195/", "likes": 5, "comments": [{"username": "Terry Pisano", "comment_text": "If available, get a card for the initial points only. After that, you're better off using cash back cards unless you use one airline all the time."}, {"username": "Kathryn Healy", "comment_text": "Yes all the time. Capital one and Amex have some great cards."}, {"username": "Kathryn Healy", "comment_text": "Also use the points for free hotel stays."}, {"username": "Patrice Warren", "comment_text": "Capital One card has a great program, and many other cards offer a promotional bonus of 60k to 70k miles just by signing up and making one purchase and paying the yearly fee ~$99 USD. Some even waive the yearly fee. Just do a Google search for the cards offered by major banks/airlines."}, {"username": "Cathy Tyndall Goodrich Drake", "comment_text": "Capital One Venture! 2x points on everything! Can use on any airline or travel related! Wait for the big sign up bonus. Been using ours and it paid for me and hubby airline tickets to Europe! Great customer service. No foreign transaction fees!"}, {"username": "Laura Skrzynski Adams", "comment_text": "If you go online and look for the best travel cards it will show you all the options. There are many good ones"}, {"username": "Jo McGregor", "comment_text": "I found this to be a useful site: https://\nwww.pointhacks.c\nom.au/\ncredit-cards/"}, {"username": "Heather Akstulewicz", "comment_text": "We got Chase Sapphire Preferred cards. They often have sign up bonuses if you spend X amount in 3 months you get 100K airline points. My hubby & I each got one then used the cards for every day purchases for a year & when it was time to book flights we got 1st class from US to Rome for FREE. Just make sure you pay off the card every month because the interest rate is crazy high."}, {"username": "Kate Laidlaw", "comment_text": "We have used our Nab credit card to accumulate Qantas points. Good bonus points upon signing on. Set up automatic transfer from your debit so you don’t pay interest/fees."}, {"username": "Michele Liggett", "comment_text": "Absolutely! Have United Mileage Plus credit card. My accumulated mileage plus bonus for signing up has paid for our flight to Italy."}, {"username": "Jose Velez", "comment_text": "I have a butch of miles cards and for over 25 years have not paid for any long distance flight for 3 people and one or two yearly flights to Europe"}, {"username": "Daisy Yoo", "comment_text": "Almost Al airlines have it , we have citi advantage with AA as we are based in dfw and I also have the one with delta , we got 3 one way ticket with aa to Rome for free paid few $$ for taxes less than 15 , then we fly back with delta from Bologna , at least with the card holder y also get priority group to get on flights sooner and free 1 check bags on domestic flights and some Insurrance for car rental and no international transaction fees"}, {"username": "Celita Stone", "comment_text": "We have not paid for a flight in decades thanks to credit card points. We are in the US."}, {"username": "Bill Elias", "comment_text": "Worth it but know that when redeeming its much easier to buy a base ticket and use points to upgrade.\n\nDepending on the type of base ticket there can also be an up charge. It used to be $550 to upgrade to Polaris with points to Europe.\n\nI have a United card from Chase."}, {"username": "Natalie Cook", "comment_text": "Plenty of credit cards in Australia that do this, we have an Amex platinum. Search up the cards on the Qantas website"}, {"username": "Delaine Remle Botelho", "comment_text": "Yes, best to get a card that earns a transferable point so that you are not tied to one hotel/airline. Chase Sapphire products earn ultimate rewards points which transfer to 12 airline and hotel partners. Good sign up bonuses and 3x points on restaurants, 2x on travel, 3x on online groceries, etc. No FTF."}, {"username": "Julie Norris", "comment_text": "I found that the annual fees on some of the cards don't make it worthwhile for me. I used the Qantas frequent flyer website to book my Emirates flights as I prefer to fly with them but I get points that I'll use for domestic travel later"}, {"username": "Rosslyn Patience", "comment_text": "Maybe you need an American bank account too."}, {"username": "Melanie Izzy", "comment_text": "There are many in Australia. Depends what airlines you fly the most as to which is best for you. Also ensure that the cars you are signing up for has a sign on bonus ie 100,000 Qantas points"}, {"username": "Dareya Pourhamidi Cohen", "comment_text": "We have Capital One. No blackout dates, no foreign transaction fees, no annual fees and we can transfer miles between cards. Can use any airline and can use points up to 90 days past our trip to pay for ALL travel expenses, not only flights."}, {"username": "Kathy Gould", "comment_text": "Look up frequent flyer credit cards in Australia on google Check out the cards for bonus points to sign up but read the conditions carefully to make sure it works for you. I am on the middle of booking flights next year. Join some of the Facebook groups for frequent flyer tips. I learnt a lot there."}, {"username": "Ali Oates", "comment_text": "Yes. We are in Australia and our American Express credit cards give us double reward points. We use them on flights every year."}, {"username": "Irene Oda", "comment_text": "Only use credit cards that will give me mileage points."}, {"username": "Jenny Guinevere", "comment_text": "Go to Point Hacks , they list all the Aussie credit cards that will give you points to get free flights. Either go Qantas (tied to Oneworld airline alliance and Woolworths spending), or Virgin (tied to Velocity and Coles spending). We haven't paid for flights in years"}, {"username": "Christine Watson", "comment_text": "Aussie here, we have a business card (NAB)that collects points and we use them for flights."}, {"username": "Melanie Gitzis Marcus", "comment_text": "Chase Sapphire is a wonderful card for miles. When I signed up it was 90K. I just signed up for Capital One and it was 75K. Chase United Business card was 150K miles. I am currently in Greece with my 2 daughters and we flew free with my miles. We come ever 2 years and only fly with miles"}, {"username": "Melanie Gitzis Marcus", "comment_text": "Follow 10xTravel Insiders group. You will learn very quickly how to band hundreds of thousands of miles and to travel for free"}, {"username": "Lauren Swanteck Myler", "comment_text": "I have a United Chase card and for the amount of $ I spend annually, it is to totally worth it. The card has an annual fee, so you have to look at the benefits and cost of each offer and based on your spending determine if it’s worth it for you. I can see the amount of miles I have when I log into my chase account. You get a pretty substantial amount of miles when you first open the account as well."}, {"username": "Tess Galinato Perez", "comment_text": "There's Facebook groups that specializes in points and miles. I use credit cards for everything but I don't use just one single card. As an example, Chase Sapphire Preferred gives you 2x on travel, 3x in restaurants, online groceries and pharmacies and one point for everything else. Capital One Venture/\nVenture X gives you 2X regardless of the transaction and Amex Gold gives 4X on groceries and restaurants. It might be cumbersome for some people to track these but it is very rewarding once you get the hang of it. I'm currently on a 5 week trip to Europe; I used points for my flight. 🙂"}, {"username": "Jean Williams Bryan", "comment_text": "Check out 10x travel, they have a free course to explain it all."}, {"username": "Tracy O'Brien Boulle", "comment_text": "We did this with a United card and got one free ticket from US to Italy."}, {"username": "Annof RedGables", "comment_text": "Google is your friend. Nearly every bank has some sort of points earning credit card."}, {"username": "Karen Casey", "comment_text": "Qantas reward points"}, {"username": "Carmine Castiglia Jr", "comment_text": "If you have a favorite airline, check to see if they offer a co-branded credit card. American Airlines, for example, offers a Citibank card that earns \"miles\" that can be redeemed for flights or upgrades."}, {"username": "Laura Uribe", "comment_text": "Most if not all airlines have a card. If you fly one airline most often, that is the best choice as they normally pay much better than anyone else. It doesn’t work for us as we live in Tampa and we don’t have a hub airline so almost every flight is on a different airline."}]}, {"id": "2202235933508818", "text": "Ive always wanted to go to Italy but never actually got around to it. We're a family of 2 adults and 2 teenage boys. We're not ones for visiting busy places like Rome but would love been close to some of the beautiful lakes. We usually stay In well equipped static caravans or cottages with a pool.\nPlease can I have some suggestions of area or even accommodation.\nThank you 😊", "link": "facebook.com/groups/1373361046396315/permalink/2202235933508818/", "likes": 0, "comments": [{"username": "Enrico Lecce", "comment_text": "Lake como.... of you prefer lakes .... Florence while traveling south you can stop at many towns on the coastal area....have fun be safe and only ask carabeneri... for directions..."}, {"username": "Alice Francesca", "comment_text": "When?"}, {"username": "Felicia LoCascio Whitney", "comment_text": "Agriturismo are lovely and away from the maddening crowds.\n\nhttps://\nwww.agriturismo.\nit/en/\nfarmhouse/\ntuscany?gclid=Cj\nwKCAjw8ZKmBhArE\niwAspcJ7rWLcKQ4\nD-O0ve8V5msfLkS\n9az_yVvCWVltU7a\nCfoR0jCuqVMFs88\nxoC_mkQAvD_BwE"}, {"username": "Kristina Ruk", "comment_text": "Garda lake area has them too"}, {"username": "Karen Fryer", "comment_text": "Lake Garda has quite a few. I have similar aged boys and we are going to stay at camping del Garda next week. (20 minute walk from Garda land, pools with slides, doesn't look crazy busy). There are a couple of others nearby that offer similar things, or theres Bella Italia if you want a big site. (These are all in pescharia, which we picked due to gardaland + train station)."}]}, {"id": "2202238840175194", "text": "Anyone else excited for next week temps? Hope this stays true when we will be there in august!", "link": "facebook.com/groups/1373361046396315/permalink/2202238840175194/", "likes": 4, "comments": []}, {"id": "2202243650174713", "text": "Hi All! We are planning a trip to Italy next summer with our 9 and 6 years old kids. We are very excited! Is late June considerably cooler than August or not much difference in weather in the individual summer months? Also, it seemed as if June was quite rainy this year. Was that atypical? Thanks so much!", "link": "facebook.com/groups/1373361046396315/permalink/2202243650174713/", "likes": 0, "comments": [{"username": "Alessandro Iannelli", "comment_text": "I haven't checked statistics but this year it definitely felt like there was more rain than usual in June. Is late June better than august, temperatures wise? It's certainly better, but how better is also a matter of luck. Given the choice, I would definitely travel in June, even late June, rather than in August."}]}, {"id": "2202246563507755", "text": "Which small towns will be recommend in Italy", "link": "facebook.com/groups/1373361046396315/permalink/2202246563507755/", "likes": 51, "comments": [{"username": "Donna Jean", "comment_text": "*Following"}, {"username": "Carol Ciotti Lawlor", "comment_text": "Orvieto, Pienza"}, {"username": "Tamara Bazze", "comment_text": "Ravenna"}, {"username": "Karen Haney Logan", "comment_text": "San Gimignano"}, {"username": "熊馬克", "comment_text": "San Gimignano"}, {"username": "Anna Conroy", "comment_text": "Bergamo, Graziano Visconti, Cremona, Padova, Aosta, Torino, Trieste. All in the north of Italy"}, {"username": "Roxana Sandoiu", "comment_text": "Renel Vermaak, Scilla, Bagnara Calabra, Pizzo Calabro (best Tartufo ever), Tropea (try pizza with red onion, the best) - these all are in south, in Calabria."}, {"username": "Barbara Fucci", "comment_text": "San Gimingnano, Voltera, Luca, Sienna Monttepulciano so many"}, {"username": "Wendy Yates", "comment_text": "gallipoli old town . Beautiful"}, {"username": "Suzanne Caprio", "comment_text": "Poppi!"}, {"username": "Caitlin Adamz", "comment_text": "Montereggioni and Vinci"}, {"username": "Denise Kelso", "comment_text": "Domaso is stunning"}, {"username": "Michaela Hlaváčková", "comment_text": "Pavia And Piazenza in the north of Italy"}, {"username": "Festina Mejzini", "comment_text": "Tropea"}, {"username": "Nicole Petrille", "comment_text": "Assisi"}, {"username": "Marija Konori", "comment_text": "Siena."}, {"username": "Marija Konori", "comment_text": "San Gimignano."}, {"username": "Lisamarie Fallon", "comment_text": "San Donato outside Florence\nGreat B&B\nClose to Chianti trail and Badia"}, {"username": "Chiara Callimaci", "comment_text": "In the Marches Region...Jesi,C\norinaldo,Seniga\nllia...."}, {"username": "Nora Coolahan", "comment_text": "Sienna, San Gimignano, Montepulciano,M\nonteriggiano"}, {"username": "Kari Capps", "comment_text": "Assisi"}, {"username": "Letty Geissler", "comment_text": "Pisitano"}, {"username": "Cayla Joy", "comment_text": "Cittadella was a cute arts town! Oldest walled city in Italy."}, {"username": "Marina Patent", "comment_text": "Orvietto in Umbria"}, {"username": "Susan Opp", "comment_text": "Colonatta, Panzano, Livorno"}, {"username": "Kristin Arnos Gossett", "comment_text": "If you're a foodie, don't miss Alba (in Piedmont)."}, {"username": "Renel Vermaak", "comment_text": "So much info\nMuch appreciated"}, {"username": "Debbie Horton Rough", "comment_text": "F"}, {"username": "Miyuki Kanno Paul", "comment_text": "Too many to choose from😅"}, {"username": "Ville Lignell", "comment_text": "Viterbo, Perugia, Gubbio, Pesaro, Ravenna..."}, {"username": "Chris Amato", "comment_text": "Bologna is so overlooked! Some of the best food in all of Italy!"}, {"username": "Laura Cohen", "comment_text": "Siena"}, {"username": "Vito Buono", "comment_text": "Matera - Basilicata"}, {"username": "Maureen Ashford", "comment_text": "Cortona!"}, {"username": "Susan Cantafio", "comment_text": "Puglia"}, {"username": "Stephanie Earl Peterson", "comment_text": "Bari"}, {"username": "Dana Dana", "comment_text": "Limone!❤️"}, {"username": "Vanessa Linney", "comment_text": "Marradi"}, {"username": "Patricia Rada Basili", "comment_text": "Lucca and Viareggio"}, {"username": "Андрій Пляцко", "comment_text": "Recommended for what?"}, {"username": "Avril Samuel", "comment_text": "Greve or Montepulciano."}, {"username": "Carmelina Senese", "comment_text": "Oliveto Citra"}, {"username": "Celeste Hedequist", "comment_text": "San Giuliano\n\nhttps://\nwww.visittuscany\n.com/en/\ndestinations/\nsan-giuliano-ter\nme/"}, {"username": "Kirsi Luomanen", "comment_text": "Viterbo, Civita di Bagnoregio, Orvieto"}, {"username": "Terry Rose", "comment_text": "F"}, {"username": "Franca Leccese", "comment_text": "Formia"}, {"username": "Karen Michelle", "comment_text": "."}, {"username": "Krissy DaRusso", "comment_text": "Treviso (about 30 minutes outside of Venice)"}, {"username": "Donna Mangone", "comment_text": "Castrocielo, Rocasecca, Aquino.\nLocated in the Appenine mountains in the Lazio region."}, {"username": "Donna Mangone", "comment_text": "Donna Mangone"}, {"username": "Donna Mangone", "comment_text": "Donna Mangone"}, {"username": "Donna Mangone", "comment_text": "Donna Mangone"}, {"username": "Donna Mangone", "comment_text": "Donna Mangone"}, {"username": "Donna Mangone", "comment_text": "Donna Mangone"}, {"username": "Donna Mangone", "comment_text": "Donna Mangone"}, {"username": "Carla Pilla", "comment_text": "San Nicola Arcello"}, {"username": "Sandra Monday", "comment_text": "Pienza is one of my favorites in Tuscany 🥰"}, {"username": "Diana Torres M", "comment_text": "Verona!"}, {"username": "Toni Meyer Kelly", "comment_text": "Sperlonga"}, {"username": "Dena Brookhart Whitener", "comment_text": "Donna Wood Robbins Lisa Zink Krebs Barbara Lipsky Nicki Cole Robin Gautney\nClaudia Pullen Cook"}, {"username": "Monica Fernandez", "comment_text": "Vieste"}, {"username": "Sandy Hookerman Kriger", "comment_text": "Lucca"}, {"username": "Rena H Fontaine", "comment_text": "Conegliano, Gimignano"}, {"username": "Paige Brigman", "comment_text": "Conca di Marini"}, {"username": "Emma Jane Hastings", "comment_text": "."}, {"username": "Ковачка Јасмина", "comment_text": "Tuscany!"}, {"username": "Rosangela Di Monaco", "comment_text": "Ferrara 🥰 Forli, Brescia, Modena💖 ( visitare il museo Ferrari)"}, {"username": "Lamiaa Bahaa", "comment_text": "Saló"}, {"username": "Jennifer Stewart", "comment_text": "Lucca ❤️"}, {"username": "Karen Passmore Pickering", "comment_text": "Stresa"}, {"username": "Michela Zanni", "comment_text": "Mantova, Verona, Bergamo, Padova, Bologna (not small), Ferrara, Ravenna in Northen Italy"}, {"username": "Nela Vanjak", "comment_text": "All"}, {"username": "Shelley Gold-Weinberg", "comment_text": "puglia"}, {"username": "Jenni Pearl Leavitt", "comment_text": "Cortona"}, {"username": "Desislava Ajdereva", "comment_text": "Lake Come, you can visit Varenna town :)"}, {"username": "Jenny Crouse", "comment_text": "For what??"}, {"username": "Scott Holmes", "comment_text": "Our favorites were San Gimignano, Lucca, Sienna, and Voltera!!!!"}, {"username": "Norms Garcia", "comment_text": "spello, siena"}, {"username": "Vanessa Linney", "comment_text": "Marradi"}, {"username": "Susan Monaghan", "comment_text": "Orvieto is a quick and easy day trip from Rome!"}, {"username": "Tracy Hood Kania", "comment_text": "Orvieto"}, {"username": "Robin Kronick", "comment_text": "Depends what section of the country you are in; in the north; Modena\n\nLuca I hear is wonderful"}, {"username": "Irma Brown", "comment_text": "Luca italy"}, {"username": "Katia Macri-Roberts", "comment_text": "Tropea"}, {"username": "Jeff Gentner EA", "comment_text": "Assisi, Lucca, Siena, San Gimignano"}, {"username": "Lisa Pritchard", "comment_text": "Casperia"}, {"username": "Nilza Mercado", "comment_text": "Pienza and Montepulciano"}, {"username": "Vanda Stella- Frigo", "comment_text": "So many but my memorable one is Cortina in the north part of Italy. I felt like I could touch the mountains from our windows."}, {"username": "Carey Matthews", "comment_text": "Tropea.\n\nTropea https://g.co/\nkgs/Lex4K7"}, {"username": "Sue Ciolfi Ross", "comment_text": "Mary Kent"}, {"username": "Carmela Noble", "comment_text": "So many small charming towns in Molise that are usually overlooked. It’s where I’m from..💙"}, {"username": "Jack Tabibian", "comment_text": "Santa Marguerita. Next to portofino"}, {"username": "Maria Badamo DeSocio", "comment_text": "Look into visiting the Umbria region , many beautiful small medieval towns."}, {"username": "Meral Kalkan", "comment_text": "San Gimignano,Siena\n,Orvieto,👍"}, {"username": "Steve Watkins", "comment_text": "Orvieto"}, {"username": "Michelle Leonard Kelly", "comment_text": "Lazise"}, {"username": "Dixie Kotylak", "comment_text": "I loved Padua, Siena, San Gimignano….🩷🩷🩷"}, {"username": "Lyn Hogan", "comment_text": "Lucca! Facebook Group called Friends of Lucca offers good info! Hotel Tuscanian or Hotel Ilaria. Enjoy!"}, {"username": "Kerstin Attard Biancardi", "comment_text": "PUGLIA!!! Matera, Alberobello & Polignano a Mare❤️"}, {"username": "Silvia Ann Bucur", "comment_text": "Spello, Assisi ❤️"}, {"username": "Carolyn B-Coakley", "comment_text": "Porta Fino!"}, {"username": "Ann Hannaway", "comment_text": "Bergamo near Milan"}, {"username": "Elizabeth Clifford", "comment_text": "Lucca, montepulciano"}, {"username": "John Arnold", "comment_text": "We're big fans of Tropea in Calabria."}, {"username": "Awilda Martinez", "comment_text": "Bolzano"}, {"username": "Deborah Lancaster", "comment_text": "Fuiggi. I believe I’m spelling it correctly….shor\nt distance from Rome. Always said I’d retire there one day!"}, {"username": "Janice Pesavento", "comment_text": "Assisi"}, {"username": "Susan Shaffar-Redding", "comment_text": "Orvieto!"}, {"username": "Carol Crawn", "comment_text": "Assisi"}, {"username": "Quentin Moore", "comment_text": "San Gimignano, Mennaggio, Vietri Sul Mare"}, {"username": "Jennifer Cederholm-Wasescha", "comment_text": "Itri"}, {"username": "Michael Wilkinson McLaughlin", "comment_text": "Verona is lovely."}, {"username": "Kerrie Beecher", "comment_text": "Lucca"}, {"username": "Helene Wolman Sacks", "comment_text": "LUCCA!!!!"}, {"username": "Mariella Elsano", "comment_text": "In which region???can I suggest San Marino close to Rimini?or I can suggest Monreale near palermo"}, {"username": "Louise Coertze", "comment_text": "Lametzia"}, {"username": "Ashley Denise Baker", "comment_text": "Cortona"}, {"username": "Yolanda Mena", "comment_text": "Bologne"}, {"username": "Sally Sharkey", "comment_text": "San Gimignano"}, {"username": "K M Uí Fhionnaláin", "comment_text": "Lucca😍"}]}, {"id": "2202259613506450", "text": "Can I just say While in Rome I lost my phone while visiting Roman Forum Palatine Hill area. Can I just say a massive thank you to the family who helped us first and rang my phone to which a lad answered I think American who found my phone. They came back to the exit as I had already left before I missed my phone and met me to return my phone. Threeआणखी lovely young lads. I wanted to give them something as an award but they wouldn't accept. Their parents should be so proud of them. Such great kind gentlemen. So happy to have my phone and photos of our beautiful holiday 💖", "link": "facebook.com/groups/1373361046396315/permalink/2202259613506450/", "likes": 1, "comments": [{"username": "Bambi Harris", "comment_text": "So happy for you. What a relief! Wonderful young men"}, {"username": "Sande Ricci", "comment_text": "Same thing happened to me in Florence at the Centrale Mercado but it was my purse that I lost with everything in it including my husbands phone! A wonderful couple found it and answered my husbands phone when the security guard called it. There are wonderful people everywhere!"}, {"username": "Elaine Eitzer", "comment_text": "Honest young men"}, {"username": "Geri Desiderio-Muscara", "comment_text": "❤️"}, {"username": "Kay Rendall", "comment_text": "There r wonderful genuine people all over the world. We must not forget that, at home, or when we r travelling on the other side the world"}, {"username": "Sigrid Cormier", "comment_text": "There is still hope. Those young men are indeed honest and will go far in life."}, {"username": "Joan Alamia Greco", "comment_text": "❤️❤️"}, {"username": "Marianella Flynn-Morales", "comment_text": "Still a lot of great humans out there ❤️"}, {"username": "Patsy Luque Mejia", "comment_text": "Good job young men! 👏🏼"}, {"username": "Theresa Salerno Adams", "comment_text": "Nice"}, {"username": "Jean Bennett O'Reilly", "comment_text": "What a great story!!"}, {"username": "Nikki Delaney", "comment_text": "Awesome so nice to hear when all u hear is about pick pockets"}]}, {"id": "2202261486839596", "text": "So what do you do with leftover Euros? I really don't want to mess with ATM's, so I'd rather start with more than less. Can I sell them back to US bank I got them from? I don't think there is a return trip in our future.", "link": "facebook.com/groups/1373361046396315/permalink/2202261486839596/", "likes": 10, "comments": [{"username": "Jonathan Catoe", "comment_text": "💡Sell them to a friend going to Europe at home at parity (1 for 1) to help them and to help yourself."}, {"username": "Cyndi Stich Bleier", "comment_text": "We keep them for the next trip especially if the exchange rate was good. In fact, we always try to come home with as much as we left with obtained through bank atm when rates are favorable as they may not be next time!!!"}, {"username": "Eden Seery Thornton", "comment_text": "You can convert them back at the bank you got them from."}, {"username": "Jessica Stewart", "comment_text": "I save whatever I have left as little souvenirs/ memories of where I went. When my husband and I go this September I’m starting off with .80 £ from my last trip"}, {"username": "Rhona OConnor", "comment_text": "A lot of airports have a charity collection box for left over currency."}, {"username": "Janine Brailsford", "comment_text": "I saved mine for the next time… only got € 500…. Used my credit card everywhere, practically."}, {"username": "Sofia Helena", "comment_text": "Most places take card, Hardly a need for cash"}, {"username": "Linda Miller", "comment_text": "I traded my Euro for US dollar to friends going overseas"}, {"username": "Maria Al", "comment_text": "I exchanged my pounds at a local bank, but just kept the euros. I didn't have much left anyhow. Give them to kids as souveniers."}, {"username": "Yvonne Lo", "comment_text": "You could also exchange it into the currency you will be travelling next if you don’t need it for something urgent. Also some places have a minimum amount they will exchange back. If it’s small amount maybe spend it all at the airport on duty free eg use all the euros and if you’re short then pay the remainder with a credit card."}, {"username": "Anna Gambino", "comment_text": "Yes you can convert back. I save mine for the next trip if I have left over. My friend wanted to sell me hers when we returned from our last trip to save conversion fees. I bought them from her gladly and now we are planning a second trip. She wished she had save them lol. I spent them already 🤣😎🇮🇹"}, {"username": "Carly Mathes", "comment_text": "You can take them back to your bank in the US and get them changed to USD. I keep mine for future trips to Europe so I start out with some euros. If you don’t anticipate going back though, just take them to your bank. I also like to save a couple small bills and coins as souvenir reminders for myself!"}, {"username": "Keith Crossley", "comment_text": "I get a minimal amount of foreign currency and spend it down at the end. If there's a significant amount left you can change it at the airport. Not the ultimate rate, maybe, but so what."}, {"username": "Scott Perry", "comment_text": "I will message you my address. 😃"}, {"username": "Jeff Overman", "comment_text": "You could sell the Euros to a friend going to Europe - settle on a good rate for both of you"}, {"username": "Shelley Phillips", "comment_text": "Save for next trip"}, {"username": "Alyson Alai", "comment_text": "Yes"}, {"username": "Sh Kaplan", "comment_text": "The bank only takes back a certain amount. If it falls below that they don’t take it back"}, {"username": "Amanda Molinelli DuAime", "comment_text": "Extra euros is for last minute shopping at the airport 👍"}, {"username": "Daddie Russ", "comment_text": "I kept mine for the next trip"}, {"username": "Giovanni Pianigiani", "comment_text": "There's always Red Cross or some other charities' pots in the airport lounge if you want to donate the loose money you're left with"}, {"username": "Tina Marie Suleiman", "comment_text": "Spend them at the airport!"}, {"username": "Linda Brecher Bekoff", "comment_text": "We used to spend them at the airport. Now we save them for our ‘next adventure’. Always like to have 100€ on hand."}, {"username": "Jon Ruple", "comment_text": "Everyone took apple pay from our phone"}, {"username": "Heather Weiss", "comment_text": "I keep mine for the next trip 😀"}, {"username": "Brad Nelsen", "comment_text": "Keep them for next time."}, {"username": "Annette Sparks", "comment_text": "Use them to buy duty free alcohol when returning home."}, {"username": "Penny Bellofatto Westberry", "comment_text": "Keep them for the next trip!"}, {"username": "Sigrid Cormier", "comment_text": "Drop off at any church’s “poor box” or donation box.\nOr\nGive them to someone just arriving at the airport. They could certainly use smaller denominations."}, {"username": "Phyllis Snyder", "comment_text": "Keep for your next fabulous trip!"}, {"username": "Wendy Spano Bracco", "comment_text": "I came back with $10 euros last trip. Not worth doing anything with. The last two days, I pay cash for all the small things/big meal etc if I find I have too much. This usually does the trick."}, {"username": "Jona Guðmundsdottir", "comment_text": "I have always used mostly credit/\ndebet cards... but yes at least you can sell them back to the bank in my country(iceland)... only the bills though and you gett less than you bought them for. So i just keep the leftover currency for a later date... so many europian countries use euro."}]}, {"id": "2200954930303585", "text": "I am spending 2 days in Turin.What are the best places to visit while being there?", "link": "facebook.com/groups/1373361046396315/permalink/2200954930303585/", "likes": 2, "comments": [{"username": "Shiundu Shaushi Fridah", "comment_text": "Thank you so much! 🥰"}, {"username": "Patricia Portas", "comment_text": "Take the Hop-on-hop-off bus."}, {"username": "Dimitri Pianese", "comment_text": "Piazza Castello, Palazzo Madama, Parco del Valentino, Mole Antonelliana (with the museum of cinema inside), Museo Egizio (the second largest Egyptian museum in the world after the one in Cairo), Villa Reale di Stupinigi and Venaria Reale, Sanctuary of Superga with the view over the Alps and many more sights. Remember that Turin was the first capital of the Kingdom of Italy during the XIX century, a very interesting, vibrant and elegant city. I loved it."}, {"username": "Antonio Aloè", "comment_text": "All the piazzas downtown,the Juventus stadium called Allianz Stadium..🤗"}, {"username": "Andrea Bainbridge", "comment_text": "The car museum is great! And the Egyptian museum is fantastic!,"}]}, {"id": "2201938276871917", "text": "We booked 2 hotels on Booking.com and Chase charges us $20 for each transaction!!Prices were in $,no warnings of extra charges....Anyone had anything similar and got his money back???", "link": "facebook.com/groups/1373361046396315/permalink/2201938276871917/", "likes": 0, "comments": [{"username": "Louis Des Forges", "comment_text": "Will be conversion charges charged by Chase. Booking.com makes it clear the hotel charges you in the local currency not your own."}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Chase Sapphire has no foreign transaction fees"}, {"username": "Robert Lawshe", "comment_text": "First, what card did you use to pay with? That could be part of the problem"}, {"username": "Fetchin Gretchen", "comment_text": "You need to get a card without foreign transaction fees for travel. Price you pay for not having such a card undortunately."}, {"username": "Carol Johnson", "comment_text": "Capital one Venture and T-mobile great when traveling.."}]}, {"id": "2202191753513236", "text": "Looking for a personal chef to come to our villa for my 60 th birthday dinner for 8 people in September in the piedmonte area near Alba/Asti . Any good recommendations?", "link": "facebook.com/groups/1373361046396315/permalink/2202191753513236/", "likes": 0, "comments": [{"username": "Lois Wagner Haight Porcelli", "comment_text": "Ask the villa owner"}, {"username": "Jenny Lalor", "comment_text": "Try Airbnb they have experiences and might have someone"}]}, {"id": "2201597450239333", "text": "In Rome and Looking for great pizza places to eat around the colosseum\nTIA", "link": "facebook.com/groups/1373361046396315/permalink/2201597450239333/", "likes": 8, "comments": [{"username": "Bill Guisto", "comment_text": "Remember, pizza in Italy is quite different from pizza in the United States especially New Haven style pizza ￼"}, {"username": "Kalenko Zhang", "comment_text": "最好吃的披萨都在你家楼下！"}, {"username": "Claire Dowson", "comment_text": "Benzo did great pizza"}, {"username": "Elena Innocenti", "comment_text": "Near colosseum not the best place to eat.\nYou can try Pizzeria alle Carrette. Roman style pizza, thin and crunch."}, {"username": "Melissa Feielin Hawkins", "comment_text": "Was just there few weeks ago. There will be a line but This place is Worth the wait!"}, {"username": "Ralph Squire Martuscello", "comment_text": "Just got back and the best pizza that I ever had is in Vico Equense by Sorrento. This is the small and usually comes out 3 feet long! Ask about the pizza wallet and you’ll find the place"}, {"username": "Мария Илиева", "comment_text": "Pizza Re"}, {"username": "Iman Nazaran", "comment_text": "Tortellini and peas"}, {"username": "Frannie Kaplan", "comment_text": "11 comments and only like 4 of them mention a place to eat. People in Rome eqt pizza all the time, no it's not napoletan"}, {"username": "Zoli Berecki", "comment_text": "Az Rail Station is the best ... don't try anything else"}, {"username": "Lisa Conetta-Lee", "comment_text": "There is a place right across the street on the upper level. If you’re facing the colosseum from the upper level where everyone waits to meet their tours, it to the left. There are about 2-3 eateries. It is the one you can only eat inside. It’s small and looks like it would be terrible. No air. However, the pizza was tasty."}, {"username": "Kate Alford Thedorf", "comment_text": "Find your way to Trastevere Roma, Italia. A culinary district, so to speak.. We never had a bad meal."}, {"username": "Anthony Martini Jr.", "comment_text": "Everywhere"}, {"username": "Mat Marturano", "comment_text": "Bonci is good but it is only take away near the cipro metro station so you have to take the metro"}, {"username": "Joe Laricchia", "comment_text": "Any pizza is better in Italy then ANY pizza you will find in the USA"}, {"username": "Anton Raul", "comment_text": "https://\nmaps.app.goo.gl/\nbwbPF2ze2F7hApdf\n6?g_st=ic"}, {"username": "Justyna Leniartek Taunt", "comment_text": "Il rioni a santiquattro is by the colosseum but authetic Roman style pizza. Thin and crispy. Gets really busy and opens at 7pm but is one of the best in town!"}, {"username": "Colleen Criste", "comment_text": "Just spent two weeks in Rome and our favorite was Pizzeria Da Baffetto! We ate there twice! The first time we sat outside in the heat and the line to get in was long. The second time we sat in an upstairs room with air conditioning and that was amazing!💯"}, {"username": "Danny Caringal", "comment_text": "Goose ristorante"}, {"username": "Frank Hunt", "comment_text": "Nope!"}, {"username": "Jonny Turner", "comment_text": "We stayed 4 day in that area. So many great restaurants. Never a bad or even just ok meal. Service at a restaurant near the Spanish steps wasn’t great but even there the food was 👏🏼👏🏼👏🏼"}, {"username": "Shelly Michelle", "comment_text": "I agree with all the Naples comments. We lived there for 2 years and tried pizza everywhere we went. Naples wins hands down."}, {"username": "Lisamarie Bianco", "comment_text": "Trastevere can’t go wrong\nEvery place is yummy"}, {"username": "Catalin Broscaru", "comment_text": "Pizza Re is a must😊"}, {"username": "Anthony Bosco", "comment_text": "Following! Will be in Rome next week"}, {"username": "April Calder", "comment_text": "Li Rioni was recommended by a local from our hotel nearby and it was excellent!"}, {"username": "Claudio Blizzard Indastria", "comment_text": "Piccolo buco is a great suggestion for contemporary canotto.\nPizzarium for teglia romana\nElementare for tonda romana\n\nThere are dozens of other good places around Roma anyway"}, {"username": "Silvia Par", "comment_text": "Petrucci."}, {"username": "Soc Cer", "comment_text": "Anywhere"}, {"username": "Maria Agazzi-Morrone", "comment_text": "Must have…pasta carbonara"}, {"username": "Alessandro Iannelli", "comment_text": "If you want great pizza, or great whatever food you want to eat, places around major tourist attractions are very often what you want to avoid."}, {"username": "Amy Tancredi Hassall", "comment_text": "Caffe Martini! I was there last week and was pleasantly surprised at how good the pizza and everything else was!\n\nhttps://\nwww.caffemartini\nroma.com/en/\ngallery/"}, {"username": "Giorgia Petraia", "comment_text": "Pizza is not even a typical roman dish and it’s probably the plainest thing you can eat in Italy.\nWe eat pizza when we can’t be bothered cooking…"}, {"username": "Sharon Hiesler", "comment_text": "Go to the back streets"}, {"username": "Mohanad Saddik", "comment_text": "Omar Kharboutli"}, {"username": "Elena Eugeni", "comment_text": "https://\nmaps.app.goo.gl/\nD73ETFHA4t9SUD23\n7"}, {"username": "Steve Griggs", "comment_text": "Take the bullet train to Naples 🤣"}]}, {"id": "2201564563575955", "text": "Any suggestions for accommodation in Florence, Monterosso, Sorrento? All the places we look at seem to have bad reviews ?", "link": "facebook.com/groups/1373361046396315/permalink/2201564563575955/", "likes": 2, "comments": [{"username": "Fiona Cameron", "comment_text": "Alloro BnB in Florence. Ive stayed many times and I love it.\nSorrento- Hotel il Nido in the hill above Sorrento but they have an hourly shuttle into Sorrento and back"}, {"username": "Natalie Perrett", "comment_text": "Thanks, I’ll check them out"}, {"username": "Jill Medrano Casey", "comment_text": "Hotel? Apartment? How many people?"}]}, {"id": "2201277033604708", "text": "What’s typical weather for end of May and beginning of June. We are going next year\n\nTo clarify we will be starting in Venice to Florence then to Rome and lastly amalfi coast", "link": "facebook.com/groups/1373361046396315/permalink/2201277033604708/", "likes": 1, "comments": [{"username": "Sandra Shoffner", "comment_text": "Very nice, some hot days."}, {"username": "Giovanni Pianigiani", "comment_text": "Where?"}, {"username": "Rhonda Hope", "comment_text": "Depends on what parts"}, {"username": "Jamie A White", "comment_text": "Italy, big country. It would be like saying, “we’re off to California, what’s the weather like?” Northern CA very different from LA.\n\nWould suggest being more specific."}, {"username": "Noel Flood", "comment_text": "Me too rain mac & not so warm"}, {"username": "Ben Parlopiano", "comment_text": "Where?"}, {"username": "Russell Weidner", "comment_text": "Google to get histrionic information as well as forecasted information"}]}, {"id": "2201562483576163", "text": "Hello! So we’re planning a family trip to Italy, Switzerland and France for next summer. 9 people in total (3 kids aged 1 yr, 6 years and 9 yrs) and 6 adults). We aim to cover Naples, Rome, Florence, Venice, Zurich, Lucerne and Paris. Do you think it’s better to purchase the Eurail pass or is it better to purchase train tickets for each destinationआणखी separately? Also, do train tickets need to be purchased in advance or on the day of travel is fine? Last question, is there a huge difference in comfort between regular train tickets and the business class? Each stop isn’t more than 2/3 hours long so does it really matter? My biggest worry is getting on and off the trains, I hope no one gets left behind 🤦🏼‍♀️. How long do the trains stop for? Is there enough time to board/unboard with all your luggage etc when you’re travelling in such a big group? This will be our first family trip together so feeling overwhelmed! Please bear with me! 🙂🤗", "link": "facebook.com/groups/1373361046396315/permalink/2201562483576163/", "likes": 1, "comments": [{"username": "Rhona OConnor", "comment_text": "Relax. The trains stop for a few mins unlike Japan 😉 there is a guard there to make sure everyone is on the train, then he signals it's safe to depart. The difference in the two classes is the seats are 2+1 rather than 2+2 across, so you have a bit more room. Once you dont have huge luggage it will all fit OK.\n\nI traveled for 2.5 weeks and booked my first two trains then booked 2 days in advance for the rest. Worked out fine. I didn't get the pass, I think there was not much in the difference, I just bought each ticket for each journey using Trainline app.\n\nOn one short 30 min train there was a long line at the ticket machine and I just used the app as I stood on the platform 👌"}, {"username": "Renee Kremesec", "comment_text": "Keep an eye on ALL your luggage\nI have read many have had it stolen from the train.\nWe didnt have any issues. Our luggage was right above our seats"}, {"username": "Lisa Kelly", "comment_text": "On a similar itinerary as you want. We’ve trained everywhere with Eurail passes that I bought in December during a sale. You only need extra reservations with high speed trains, otherwise you can just board the train you want and your Eurail pass is your ticket (you activate it for your day of travel). We bought first class because we did 4 high speed trains. Some trains you can’t even tell what is first class - in France - but there are more seats usually in first class. We have locks in the main compartment of luggage just to make it harder for someone to mess with but there have been no issues with anything. We have the 7 travel days in 30 days pass."}, {"username": "Fetchin Gretchen", "comment_text": "You did not say how long your trip was but here are some answers to your questions.\n\n* **Eurail pass vs. individual train tickets:** If you're planning on doing a lot of train travel, a Eurail pass can be a great way to save money. However, it's important to do the math to make sure that it's actually worth it for your specific trip. You can use the Eurail pass calculator to help you figure out if it's the right option for you.\n* **Purchasing train tickets:** If you're not going to get a Eurail pass, you'll need to purchase train tickets for each destination separately. You can usually buy tickets online or at the train station, though I prefer the trainline app myself If you're traveling during peak season, it's a good idea to book your tickets in advance, especially for popular routes like Rome to Florence.\n* **Comfort level:** There is a difference in comfort between regular train tickets and business class. Business class tickets usually include things like reserved seats, more legroom, and access to a lounge. If you're traveling with a large group, business class tickets can be a good way to ensure that you all have seats together and that you have enough space for your luggage.\n* **Getting on and off trains:** Trains in Europe usually stop for a few minutes at each station. This should be enough time to board and disembark with your luggage, even if you're traveling in a large group. However, it's a good idea to be prepared and have your tickets and luggage ready before the train arrives.\n\nI hope this helps!"}, {"username": "Grace Scinto", "comment_text": "You’re covering the same route we did but we also went to London. Individual tickets were the cheapest because the Italian trains were quite cheap. Use the Swiss Rail site to book the tickets."}]}, {"id": "2201591250239953", "text": "Thankyou for all your advice.\nMy family is organising a train ride from Florence to Sorrento. I have gone into the trenitalia website and it's asking to choose seats. Is standard and FrecciaFamily what I should choose. Will we be able to fit 2 hardcase suitcases.", "link": "facebook.com/groups/1373361046396315/permalink/2201591250239953/", "likes": 1, "comments": [{"username": "Chiara Normanno", "comment_text": "Freccia family is a promotion for families of 2-5 with at least one minor under the age of 15"}, {"username": "Rhona OConnor", "comment_text": "There is space for cases, just be one of the first getting onto the train. 😉"}, {"username": "Anna Gambino", "comment_text": "I just booked the Freccia trains for 3 trips. It was recommended highly on one of my Italy FB pages."}, {"username": "Katalina Loredo", "comment_text": "Make sure you can lift your suitcases above your head so you can put them in the overhead bin. And no you don’t need to choose seats. I didn’t and the app still sat us all together"}, {"username": "Fiona Cameron", "comment_text": "There is also space between seats for cases. I think Freccia Family is like a membership thing, not available for tourists. Just go with whichever fare price you are happy with then it will show you what seats are available in those carriages. Seats are ser out as singles, doubles ( facing back if the sear in front like on a plane) or doubles separated by a table."}, {"username": "Bea Kuckens", "comment_text": "Also, sometimes there are \"quiet cars\" that discourage phone use, lively conversations, etc. - choose according to preference."}]}, {"id": "2201672066898538", "text": "Starting to plan a trip to Italy in February. Not sure where to begin, so leaning on you all for advice! Any tips, recommendations are greatly appreciated!!\n\nMy husband and I are planning to start in Rome. We will have about 1 week in Europe, so thinking a couple days in Rome then possibly take a train from Rome to Paris and spend a few days inआणखी Paris. Has anyone done this? Was it a good plan?\n\nWhat are the must-do things to see/places to eat in Rome in February? Again, no idea where to even begin with planning this amazing trip. Help!! And thanks so much for any advice/recommendations:)", "link": "facebook.com/groups/1373361046396315/permalink/2201672066898538/", "likes": 1, "comments": [{"username": "Chiara Normanno", "comment_text": "If that's your plan I recommend you start surfing the net in search of travel blogs and vlogs that can give you inspiration. Scour any social for pictures and videos, keep track of them and make a list. Place those on a map using Google My Maps or Scout, so you can get a sense of How far are these things located. Look for hotels near public transport if you aren't using a private driver. Your idea is surely feasible but you will have to make choices as to what you'll be sacrificing, Rome and Paris are huge"}, {"username": "Alessia Conter", "comment_text": "I suggest you to take a plane from Rome to Paris. It's faster and cheaper."}]}, {"id": "2201677010231377", "text": "places of interest in south Sicily please\nLike Zoo's or aquariums or any interesting museums", "link": "facebook.com/groups/1373361046396315/permalink/2201677010231377/", "likes": 0, "comments": [{"username": "Alessandro Iannelli", "comment_text": "There's an aquarium in Ortigia. In Priolo, within a natural reserve, you can spot the flamingos, I think that's mostly just august though. There's plenty of museums, maybe one i would suggest in that area is Museo Archeologico Regionale Paolo Orsi in Syracuse."}]}, {"id": "2200726646993080", "text": "Booking your trips who did you all use or did you do yourself? I have never been to Europe and we want to see Rome, Venice;\nFlorence and Sorrento in October of 2023 and not drive. I’m freaking out because I don’t know how to do this? It’s my son and I and im so confused yet I can’t afford to pay 20k. The vacations I’ve found you can’t choose hotelsआणखी or flights and that makes me nervous. I’m trying I really am\nJust so overwhelmed\n\nUpdate! Thank you all\nSo much! Wonderful people on here! I just booked it!! Omg I am going to Europe!! We will be in coach but we are going!! May not be the most glamorous trip but I never thought I would be able to\nGo!! Thank you all!! We are going to Venice, Rome, Florence and Sorrento!! 😆i have worked 3 jobs for this trip!", "link": "facebook.com/groups/1373361046396315/permalink/2200726646993080/", "likes": 39, "comments": [{"username": "Brenda Keeter", "comment_text": "I’ve used AAA in the past."}, {"username": "Rita Liles", "comment_text": "Shannon Scott"}, {"username": "Lisa Hettrick", "comment_text": "We went on a tour with Costsaver tours. We saw all of those places, didn’t have to drive or figure anything out, and had local specialists in each major city. We really liked doing it that way 🤷🏻‍♀️"}, {"username": "Laurie Denoni", "comment_text": "It helps to use a couple of guidebooks. Rick steeves Italy, Lonely Planet"}, {"username": "Debbie Plante", "comment_text": "I started to try and do everything myself and it was too overwhelming. Someone gave me a name and I called her and she has been great to work with. She has arranged all of our transfer, tours etc. I am spending a week in Sorrento and then flying to Palermo Sicily for a week and then Syracusa for a week. I did the flights and hotels ( but I asked her if they were good and in a good location. If I had to change them it wasn’t a problem). But she did EVERYTHING else.\nHer name is Martina and she works for CULTURAL ITALY. They have a web site if you want to contact them. It took all the stress off of my shoulders by taking care of everything."}, {"username": "Robin Burrell", "comment_text": "This is ok to do yourself. First do your plane, going into Venice and out of Rome. North to south. Look on booking.com to book hotel looking at the map and going by recommendations\nnot by star ratings. Download Rome to Rio app to your phone to see how long it is from town to town, download trippit to keep track of reservations, trains, restaurant reservations. Download Trainline to book train tickets. It’s pretty easy. I would go from Venice to Florence to Sorrento and finish in Rome. If you need help just message me and I can help. You absolutely don’t need a car"}, {"username": "Diane Pieri Adiliano", "comment_text": "Booked it all myself. Lot of work. Spending 11 days in Italy for everything around 5500. Flight, hotels excursions, trains for 2. Need to pay for food and goodies."}, {"username": "Kim LaFontaine", "comment_text": "We used Your Own Italy and we’re SO glad we did. Every single detail was covered. Including private tour guides and drivers. She arranged some amazing special surprises. We had a walking food and wine tour of Rome with a master sommelier. HIGHLY recommend!"}, {"username": "Ana Ferreira Ruffel", "comment_text": "I’m going but my church is organizing it!! All I have to do is pay $$"}, {"username": "Christine Pinto Kulp", "comment_text": "Buy a book on travel in Italy such as Rick Steves, Frommers, etc. Use their information to help plan your trip. These books have itineraries that work, information about popular tourist sites, hotel and restaurant information and even travel by car or train. Why reinvent the wheel?!"}, {"username": "Dunia Aldyni", "comment_text": "Travel agent did my trip with my 4 teens 😍😍😍it was amazing 🤩"}, {"username": "Ginna 'Huff' Bloom", "comment_text": "Jennifer Merrell Davis has done an amazing job for my husband and I."}, {"username": "Shelby Cole", "comment_text": "I used gate1travel.com they have a bunch of different trips with or without a full itinerary you can choose from"}, {"username": "Michelle Bergman Davis", "comment_text": "I did it all myself. I used this sight for recommendations\nand then booked most of my guided tours through Viator or Get Your guide, both were fantastic. Google ratings are also very helpful.\nBooking yourself is easy, but some of the research takes a bit of time."}, {"username": "Meryl Friedland Schiowitz", "comment_text": "We used Gate1"}, {"username": "Jennifer Dizon Lagandaon", "comment_text": "I did Costco this month, but October might be off peak. Try calling them vs online and they will try to help you build a package. Goodluck!"}, {"username": "Laura Cary Veeder", "comment_text": "We did it ourselves but always plan about 9 months out. You may have a hard time finding hotels this late. I’d fly in/out of Venice and then take trains down south & leave from Rome. Good luck!"}, {"username": "Gina Stang", "comment_text": "Travel agent"}, {"username": "Susan M Warren", "comment_text": "You can book everything yourself and cheaply. Europe is easy. Take trains, so easy to use and wonderful. Find cheaper hotels or airbnbs. I took my 9 year old to Paris for a week, from Albq, alone, 7years ago and spent $3000 TOTAL including airfare. I got us metro passes for the week that cost $75 total and a museum pass for me for $75 and she was free, so much free or reduced price for youngsters in Europe."}, {"username": "Nellie Sarmiento", "comment_text": "Just google and spend some time reading blogs. Trains are very efficient. Check out also seat 61 website to understand the transport sytem. Book directly at trenitalia and ITALO websites or download their apps. I would suggest to fly in and out in a different city to not waste time. List all museums you don't wanna miss and book directly at their websites. Try getyourguide,vi\nator,booking for activities. I would suggest to involve your family members in planning"}, {"username": "Merry Sterling", "comment_text": "I booked myself, but I recommend a good travel agent."}, {"username": "Nadine HG", "comment_text": "Following"}, {"username": "Jennifer Louise Snedden", "comment_text": "I do it all myself 95% of the time ... start with return flights at beginning and end ... add accommodation for those two spots (easy as if it's one and the same) then I work on destinations in-between"}, {"username": "Jane Eichhorn", "comment_text": "We did a Gate One tour in March/ April. We covered all of those places. The hotels weren’t 5 star, but were very clean and nice. Some modern, some more Old World with character! The price was very affordable. We did the 11 Italy trip. I’d be happy to answer questions."}, {"username": "Jules Blumke", "comment_text": "Exploring on you own is better. You don't want to be on a fixed schedule. I've always planned it on my own. Research each city and then decide what it has to offer."}, {"username": "Rhonda Hope", "comment_text": "Guide books from library and you tube and googling"}, {"username": "Jessica Foley", "comment_text": "We book everything ourselves! Trains from place to place, walk, bus, or use the subway if there's one in each town you'd like to see. Find hotels or vrbos/airbnbs (we did this once in the middle to do laundry so we can have greater mobility with smaller luggage) in your price range with your preferred level of amenities each place. If you don't have strong opinions about how nice things need to be, it can really be pretty affordable. Entrance fees can add up over time...pick a few things that you really care about each place that cost money to see. Maybe book a few skip line passes. These are cheaper through the website of the museum/site than through third parties, and usually have better access anyhow. There's tons of places (churches, parks, historic neighborhoods) that don't cost anything to see! Budget a few hundred extra euro each for other extra things you find to see, snacks, or if you end up at a slightly pricier restaurant on accident."}, {"username": "Michelle Plutto", "comment_text": "I just booked it!! Omg I am going to Europe!! We will be in coach but we are going!! May not be the most glamorous trip but I never thought I would be able to\nGo!! Thank you all!! We are going to Venice, Rome, Florence and Sorrento!! 😆i have worked 3 jobs for this trip!"}, {"username": "Liz Anne", "comment_text": "Just returned from a fabulous trio booked through Costco. Great way to start, then fill in with tours in each city. Very reasonable with choices of hotels in each city. Enjoy your trip!"}, {"username": "Marra Bodkin", "comment_text": "You will never regret it! Enjoy!❤️"}, {"username": "Jeff McLellan", "comment_text": "I booked everything myself. It is not a cheap place to visit."}, {"username": "Grace Sulsenti", "comment_text": "If the 1st time, it's best to take a group tour. It will take you to places & explain things you'd not accomplish by yourself."}, {"username": "Dianne Novak Iadanza", "comment_text": "Try Trafalgar tours. We found them.great for our first trip to Italy. We book them through triple A but you can use them directly as well."}, {"username": "Sierra Behrens Tibbetts", "comment_text": "We booked a VRBO. Had great reviews. We do airbnb or VRBO most of the time and love it."}, {"username": "Bonnie Guy Bingman", "comment_text": "We booked our trip ourselves. Flights, hotels, tours - you can use trains or buses to get from one city to another. It isn't hard to do but it is somewhat time consuming."}, {"username": "Nancy Lewis", "comment_text": "I think you will save lots of $$$ doing it yourself. I’ve done it myself for about 9 trips to Europe.\nYou can go on a real budget trip depending on where you stay and how often you want special meals. That the discretionary part of your budget.\nWe went for 28 days stayed in moderate but very nice hotels. Ate light during the day but hade about 4 or 5 special dinners each week. We are foodies and you can’t go to Italy and not splurge on food.\nWe spent $9000 after airfair, taxis, trains etc.\nHow long are you going to Stay??? Michelle Plutto"}, {"username": "Claire Lewis", "comment_text": "Just download these apps and book everything yourself. Easy as.\n\nBooking dot com\nGetYourGuide\nTrainline"}, {"username": "Sonita Sandhu", "comment_text": "As many suggested a travel agent might be your best bet as it’s your first time. I always book everything myself as I’ve been to Europe a lot and it’s fun but it’s also very time consuming to look at reviews etc. Trains are the best way to travel and easy. You will have an amazing time!"}, {"username": "Shauna Alisch", "comment_text": "Sometimes a cruise is a great idea because all the planning is done for you."}, {"username": "Robert Stone", "comment_text": "Book via Viator. They have personal drivers and guides to make your life easier"}, {"username": "Vanessa Durkin", "comment_text": "Use booking.com for hotels many of which you do t have to pay until you are tgere plus look at skyscanner for flights very easy to boom trains between citues i have done it all myself going to fly to pusa tdain to flirence tgen to puglia train to rome then teain to salerno thhen going to pkmpei and amalfi coast using local buses thdn ferry to capri then flying back from naples got great deals and was really easy. Train tickets are cheap easy to buy online before you go and the trains are frequent good luck"}, {"username": "Vanessa Durkin", "comment_text": "Excuse my typos couldnt edit and athritic fingers sorry"}, {"username": "Laura Jetton", "comment_text": "I used Perillo Tours Travelers Page. We did the North Continental. It was so fun- everything planned for us, did all the excursions and it was about $6k each w/ flights from LAX."}, {"username": "Bea Kuckens", "comment_text": "We have planned and booked all of our trips ourselves, some multi-country, a month at a time. Book a flight that works for you, then fill in the blanks. Plan where you want to go, how long you'll need in each location, then book lodging and last trains (because you can't reserve them as far out). All online at your own pace and you'll learn a lot in your research. Just be organized (I'm a retired accountant so I use spreadsheets. If you are an Apple user, Numbers has a template called Travel Planner that's a great way to start). If you have airline points or are willing to fly economy, you can do three weeks for $10K easily, with nice hotels (4-star or better). We don't spend as much on meals as some people - that could run the budget up. We don't drive in foreign countries - take the train between locations, mostly walk but occasionally take a cab if something is too far or it's late. We didn't know how to do it the first time either - but it all worked out great. You can do it!"}, {"username": "Sally Gallaway", "comment_text": "Hi Michelle\nI used booking.com to see hotels in areas we wanted to visit, then contacted the hotel directly & saved a lot of €!\nWe have had breakfast included in all reservations, have used bakeries for lunches & with a bit of research have found reasonably priced restaurants for dinner (except when my daughter found ones we “had” to go to 🤣). We are foodies so have eaten well.\nI have not used trains in Italy, but found booking through train company in Spain rather than third party easy & much more economical. This went for tours as well. I hope you have a great holiday. You will find a wealth of information on this page & apps like booking.com, Rome 2 Rio. Some sites you do need to book in advance & would recommend this as popular places do book out. We have not used third party websites/\nproviders once & have been more than happy with audio guides.\nWe have kept it to approximately €100/day for food and snacks for 2, including some 5 ⭐️ restaurants.\nSupermarkets are a saving for drinks & snacks 😃\nBest wishes for a fab holiday!"}, {"username": "Jennifer Gesiné Witt", "comment_text": "Find a AAA travel agent. You don’t pay for their services. They can book flights, hotel, trains, and buses if you need them.\nLarge cities usually have a Hop on Hop off bus. I try to start with that the first day so I can see if there is anything I don’t know about that I want to see. Plus they do the driving. Look for deals, buy 24 hour ticket but can use it for 48 hours.\nAlso look to see if the city has a city pass that is good for entry into various places, it’s usually cheaper and faster(special entry line) than buying a ticket at each site.\nYou can also find day trips online. They provide guides, entrance tickets and you bypass the entry line.\nHave a great trip!"}, {"username": "Morgan Baugh", "comment_text": "I tried myself and was overwhelmed!! Got a wonderful TA! She got us booked, got us upgrades, refunds and I am stress free!\nAngiebrandt@cus\ntomtravelprofes\nsionals.com\nIt is a lot of work to book yourself. We are on a 3 day pretrip to Rome then a 10day Mediterranean Cruise. She booked hotel, flights, all transfers etc.\nIt was NOT 20k either."}, {"username": "О. Оксана", "comment_text": "What is this crazy price. Where do u live? It is so freaking easy to book hotels on booking.com, buy train tickets on italo or tranitalia...."}, {"username": "Starla Dawn", "comment_text": "Did it all myself trip in June and decided to go in May. Every part of it worked out perfectly.\n\nYou can do it. And I am not a planner at all."}, {"username": "Ryan Mills", "comment_text": "I just got back from a 12 days in Italy. We went to Venice, Florence, Cinque Terre, Rome, and the Amalfi Coast. We stayed at Airbnb and Vrbo's. We used trains to get around, not cars. We ate at pretty good restaurants. We did this all for about $5,000 a person."}, {"username": "Pao Magnoler", "comment_text": "It's really easy, the best way to do it is book in advance. Instead of hotels you can book airbnbs instead of hotels. You can travel by train and you can use the trenitalia app to book your tickets, or if you are more relax person you can by tickets directly from the train station. If you buy online tickets you don't have to validate them, if you buy the tickets directly from the station you have to validate the tickets, you will find the machines in all the stations. I think 20k is way to much money, how long are you planning on staying?"}, {"username": "Melissa Nelson", "comment_text": "Gate 1 travel"}, {"username": "Diana Hesse", "comment_text": "I do it all myself. First i buy a ticket at the best price on the best airline -early. I decide how i want to travel and if I’ll need a kitchen or washing machine for parts of the trip etc. Then i research accommodation, reading lots of verified reviews, as on booking.com and airbnb etc. then i book my trains as you get better deals further out than on the day. You can get a local train to Sorrento from Naples and a high speed train from Rome to Florence.\nYou need to book now. Don’t be nervous or overwhelmed - relax and enjoy yourself. Get travel insurance."}, {"username": "Christine Pelosi", "comment_text": "I'm sure you can get a lot of tips from this group. I booked a tour because I didn't want to do all the work. However, the next time I'll will do it either myself or have a travel agent arrange everything. I heard if you are a Costco member they will set up everything for you. You just tell them where you'd like to go."}, {"username": "Brenda Martinez Schafer", "comment_text": "We did it ourselves. I bought Rick Steves books, watched his shows, YouTube and another Facebook group, Travel community. I recently give this group, which has been helpful too."}, {"username": "Nadia Nadia", "comment_text": "I am traveling with my son in less than a month, first timer. Started with booking accommodation all cancellation free, now looking at tours and apps for train tickets 😁"}, {"username": "Faith Flanagan", "comment_text": "We used Firebird travel since there were 9 of us and it was excellent\nI highly recommend their service"}, {"username": "Charlotte Perry Henrichs", "comment_text": "Be sure to get travel insurance."}, {"username": "Cynthia Marie", "comment_text": "I love planning our trips.\nFor me the research is just as fun as the actual trip . I can’t imagine putting my vacation in someone else’s hands.\nI own a hotel and many of my European reservations come from Expedia through a travel agency . It states on the reservation, not to mention\n“ expedia “ to the guests. The guests has no idea the travel agent booked their vacation through an everyday booking website.\nTravel agents have nothing special to offer you. They’re using the same resources we have available."}, {"username": "Teresa Bliss", "comment_text": "I used an agent. For booking flights transfer to and from the airport to our hotels. And we are doing the rest when we get there. We are going with the flow."}, {"username": "Raelene Lowe", "comment_text": "Using trains between venice, Florence and Rome very easy and relaxing. I use a spreadsheet when i plan. Dates down the first column, then I have a column which I fill in with accomadation so I know where I'm sleeping each night. I like to book accommodation close to main train stations and walk. then a column with travel arrangements, ie train 8.05, arrive florence 10.00 then a column of things I want to do. Then as I book I colour it green. For example today booked my tickets for a time for shopping mall roof top viewing of canals in venice (free), If you've got beds at night and ensure your first and last night is easy to get to airport on time the rest will flow. Good luck and enjoy the adventure of travel."}, {"username": "Teresa Shawn Lane", "comment_text": "EF Tours. They plan everything\nLots of walking but you see so much!"}, {"username": "Michele Liggett", "comment_text": "We're working with Jayway Travel. They planned all of the transportation once we land in Venice. They gave us 3-4 hotel suggestions in each city and 5-6 possible tours."}, {"username": "Jennifer Colucci", "comment_text": "I have used Central holidays for 4 of my 8 trips to Italy. They are great."}, {"username": "Patty Stadulis-Hagan", "comment_text": "Hire an agent! Patty’s Life Without regrets Patty's Life Without Regrets Travel"}, {"username": "Carol Hamilton", "comment_text": "We used a travel agent friend to book a river cruise and part land package 21 days through travel marvel which included our return flight but as we are coming from Australia we wanted to try see a few more things as it’s so far\nSo we added in a extra 2 1/2 weeks away 5 1/2 weeks in total\nWe got the travel agent to book our hotels (3 star all included breakfast) internal flights ,insurance and a couple of tours ( they know the best areas to stay/safest/\ncentral as they deal with overseas brokers all the time)just told her where else we wanted to go and how long in each destination\nSo she organised most of it as this is our first trip to Europe\nWe have organised our own train travel\nPrivate driver transfer one of the stops and extra tours ourselves as it was cheaper\nFeel better knowing travel agent booked most things and most airport transfers which are all paid before we leave as makes budgeting easier\nThis way suited us as we are 2 mature women on our own others might prefer to organise absolutely everything themselves\nPersonal preference\nWe leave in a couple of weeks so hopefully all works out ok"}, {"username": "Lorrie Nolan Masset", "comment_text": "Planned all on my own for our Oct trip. We did go to AAA for help with train bookings as they use Railbookers and they handled our trains to 4 cities plus 3 transfers to hotels and airport in Venice. We chose VRBO and Airbnb - every few day stays with washing machines to do laundry (packing easy-dry clothing and clothes pins). Read Rick Steves Italy book and watched every youtube video we could find for the cities we are visiting. Booked tours through Viator. Reserve and pay later. Booked airfares for comfort which are direct flights to London on British Airway and then Vueling Air from London to Rome out of Gatwick airport. Then flying BA from Venice to London (spending 2 days there) and direct flight on BA from London to Tampa. Flights on BA are premium economy. Overnight flight so we can sleep on way to London. Have 6 hours to rest and eat in airport before we fly to Rome. Arrive in time to check into monastery and grab dinner and bed for good nights sleep before our morning tour of Vatican and Colosseum the following morning. Going to Sorrento, Cinque Terre, Florence (farmhouse stay in Tuscany) and then finish in Venice. Think our flights are running around $1900 round trip per person. Comfort is important to us and think we will have it with prem econ on long legs. Good luck!"}, {"username": "Cindy Morgan Schmoe", "comment_text": "I used Expedia. I would NEVER use them again. They left us stranded and we had to figure it out on our own.."}, {"username": "Sophia Yager", "comment_text": "I can totally vouch for Patty Stadulis-Hagan! She is amazing!"}, {"username": "Kim Geary Keidel", "comment_text": "A TA booked my flights, hotels, most trains between cities, one transfer from train station to hotel, and two tours. I booked some of my own tours, one train, and a transfer. It was great having her do the hotels and the couple of tours (using her normal tour people). When looking at starting the planning, I was completely over my head. (First trip to Europe.) Her suggestions for cities, etc. were invaluable. (It’s overwhelming!)"}, {"username": "Carol Harding", "comment_text": "First of all you don't need to spend $20,000. Just go to a travel website like Gate1 or Globus and you'll find several options for trips to Italy. You can make a reservation online, and quite often there's some kind of discount available. Don't stress out - it's not as hard as you think. Do this and have a wonderful time!!"}, {"username": "Renee Kremesec", "comment_text": "I did it myself\nWent on a very extensive 7 week trip and was able to save a ton but wish we would have had some professional help.\nWe mostly did airb n b and vrbo rentals and that worked well most of the time.\nIt was more difficult to plan our daily adventures than it was accomodations and flights.\nWe did a few tours in Rome, Tuscany and Ephesus Turkey and are very greatful we did.\nViator and The Tour Guy have a terrific selection to choose from.\n\nIts a good idea not to drive, its very different there and pretty stressful at times. We tried to stay close to the sights we were interested in seeing so we could walk. We walked all over Rome and Florence and then took an Uber or Taxi back to our hotel.\n\nA suggestion\nYou will have to book the popular sights in advance or you may not be able to see them as they book up.\nIts a good idea to do your resesrch and have some solid plans but allow yourselves some time to just explore.\n\nAn ITag to track your luggage is an absolute must.\nOurs and our travel companions luggage was lost 4 times. The Apple Air Tag proved its weight in gold as we were able to retrieve our luggage more easily knowing exactly where it was and let the airlines know. We only had carry on but we were asked to check our luggage due to specific airlines restrictions.\n\nTraveling on the train was a breeze but keep your luggage right above your seat and your purse cross body and zipped tight.\n\nThe food is fabulous and we never had a bad meal anywhere. We cooked some but in Italy it was inexpensive to eat out and added to our adventure.\n\nMostly\nPlan plan plan\nAnd have a terrific andventure and safe journey."}, {"username": "Sandra Maldonado", "comment_text": "We’ve done several trips by ourselves. I’ve done the lakes in a tour. My next one will be solo. I want to go back to Rome, and Orvieto. I’m sure a few more day trips."}, {"username": "Donna Holt", "comment_text": "We booked our flights, airbnbs and trains online. Trains in Europe are great....not like they are (or are not) in Canada. 😀\nI've done it many times."}, {"username": "Brenda Fife", "comment_text": "Have you considered a tour package. Is it just the planning that has you stressed or would you be worried while there about anything going wrong? With a tour you’d have support the whole vacation. Wingbuddy has tours that hit all the places you’ve mentioned and include airfare. Good luck🤗"}, {"username": "Mary Gregory", "comment_text": "I recommend using a travel agent"}, {"username": "Gabrielle Wiseman", "comment_text": "I’ve been to Rome 6 times now (LOVE the city!) so am quite well versed with the place❤️ So I’m happy to offer tips!\n\nSince there are 4 places you want to see, that see fairly spread across the country, it’d be worth looking at trains first (the train network in Italy is great - I highly recommend the apps Trenit! and Omio). It might be worth doing some light research into the places and maybe deciding which cities are your priority, then going from there?\n\nI personally use skyscanner and airbnb for booking flights and hotels and they always work great✨\n\nFreel free to drop me a DM and I’m more than happy to offer any guidance as I’ve been to Italy many times now. (No strings attached/I’m not selling any services to you - I simply love talking about my favourite city/country🥰)"}, {"username": "Linda Miller", "comment_text": "It's very easy to plan your trip yourself! Between YouTube and Google, no need to hire someone!"}, {"username": "Jeanette Ramos-Gonzalez", "comment_text": "I am also going SOLO in October to all the same places and it has taken me hours of research. I started in April by hiring a company called Exploratour... BIG Mistake .... this company was horrible.. to be honest they are independent consultants so all I will say is that the one consultant I had did not provide the services they had promised so I lost my money and began to plan myself. I will tell you that the prices for accommodations and airfare are significantly up since May. I used booking.com for accommodations and compared prices directly with the hotels. I knew exactly the area I wanted to be in each place. I also got a lot of information from this group and booked local tours . I used OMIO to book my trains and I also booked transfers through the hotels. It is a lot of work and the sooner you can get everything booked the better and least expensive..."}, {"username": "Paula Grove Baker", "comment_text": "I used Costco Travel. We get driven from airport to hotel and transfers between locations and a ride back to the airport. We just picked the cities we wanted to visit."}, {"username": "PJ Rodriguez", "comment_text": "First trip to Italy, I bought Rick Steve's Italy book and actually stayed in the places he listed. It was so great to have the descriptions and realistic notes he provides. Now we have the jist of Italy, and other European countries, and owe that success to his books"}, {"username": "Bill Casper", "comment_text": "Go in late November. Use TRIPIT to help You plan. It’s an app. Look at AirBNB and BOOKING for accommodations."}, {"username": "Lisa Valdovinos", "comment_text": "We used a travel agent. Best decision. Like you it was our first time being there. We went to the same places you want to go. She booked our flights, hotels, excursions and transportation.\nWe had no stress. I tried to do myself but was overwhelmed."}, {"username": "Crystal Waltz", "comment_text": "I used Expedia."}, {"username": "Leanne Dawn Sutton", "comment_text": "Get Rick steeves book. Book your flights first then your airbnbs then trains then tours. Figure out where you want to go. For a good price it’s usually best to plan a year ahead….. can you delay to October 24 or even spring 24? I started in January for September but I know I could’ve gotten better deals if I had had a year. My trip is so far about $7000 for myself and my husband 17 nights. We used travel points for the flights. Our itinerary is 4 days rome, 7 Umbria/\nTuscany, 3 Florence and 3 Venice."}, {"username": "Michelle Solak", "comment_text": "I booked it all myself for me and my husband but it was a lot of work 😂 spent a lot of time reading reviews online and recommendations\nin groups like this one\nWe didn’t drive and I would recommend not driving!!\nFor rome we loved Parlamento Boutique Hotel"}, {"username": "Jamie Myers", "comment_text": "Chelsey Kimbrough booked our trip and she’s been great. Especially with me having a million questions and changes 🤦🏻‍♀️"}, {"username": "Laura Torres Palomino", "comment_text": "It took me three months to plan our three week trip. I took my time. Booked the tickets to Rome first, and then began looking into Airbnb’s which were super affordable and just wonderful! I looked for ones that were marked with Super Host and went from there. I also booked our tours in Rome through Viator, and they worked out great! The lines there are super long so pre-booking is a must. For the Vatican, I recommend buying the “before the crowds” option, it costs more but is worth every penny! Avoid the massive crowds that will ensue later where you can’t see a thing except stinky bodies and shoulders! Yikes! We rented a car (which was fantastic!)so I can’t help you with trains and such. I wish you luck and have a great time! 🌹 BTW our time was spent in the Tuscany region…we made a loop north from Rome, went as far north as Florence and came down around Assisi and back down to Rome again."}, {"username": "Beverly Kerr", "comment_text": "TripMasters online. You can customize everything from cities to visit to hotels to transportation."}, {"username": "Patty Maffei", "comment_text": "I’ve found lots of good info in this group. I basically decided when we’re going, and what half of Italy to see and have been taking lots of notes from here"}, {"username": "Reagan Bramston", "comment_text": "Sorry to be negative.... Ummmm, you are a bit late. All reasonably priced hotels & apartments in great locations for Oct 2023 are long gone. Can you change to 2024? Book flights a year out then decide your itinery & start booking apartments/\nhotels. Good luck"}, {"username": "Concetta Insana Scharfa", "comment_text": "Costco has a package called -Sorrento, Rome, Florence and Venice: Your Way- you can pick flights through them (or book your own)- it then includes hotels (you get to pick from a selection) and they arrange train tickets between all the cities and airport pickup and drop off for the beginning and end of your tour"}, {"username": "Doug Burke", "comment_text": "We think half the fun of a trip is planning it yourself. We've gone on maybe 30 trips, all planned by ourselves including one around the world which had several days on the Trans Siberian Railway."}, {"username": "Harris Dee", "comment_text": "I like using Expedia… some others … viatour, get your guide, once in the ground omio and free now"}, {"username": "Janette David Payne", "comment_text": "We went with an agent at Flight Centre, he helped with marking out a calendar and working out where we wanted to go, the order, the length of time staying there, he’s booked most of the accommodation, we’d checked places and prices but he did well, we had other places where we are staying with friends, he sorted the flights and 2 of the trains… but I’ve filled up most days with things to go and see, as well as days where we just walk out the hotel door and either go left or right and see where we end up… lots of studying online, Get your Guide and Google, Trainline and the websites of some of the popular places to see…. we are doing 3 weeks in the UK and then 1 week in France and 2 weeks in Italy (Venice, Florence and Rome) and just plotting a day trip to Positano…. Already thinking we should of got another week off !! Don’t stress, even if you plan to do just do a day, each day… Good Luck and have fun… we’re in Italy in October 😊"}, {"username": "Nora K Brown", "comment_text": "Everett Brown some great suggestions here"}, {"username": "Kevin Miller", "comment_text": "We used tripmasters.com\n. We had a great experience."}, {"username": "Lee Mckay", "comment_text": "Just use the trains. The system is amazing n cheap. Also runs very frequently"}, {"username": "Eileen Muro", "comment_text": "We went thru Costco Travel....Rome,\nFlorence and Venice. Includes hotel...they gave us 3 options of hotels to choose from at each spot. It includes flight and train rides from each place. Also includes ride from airport to hotel and vice versa."}, {"username": "Beatriz Davalos Moreno", "comment_text": "Best places a visited, just got back and I booked it myself! If you have a chance do París too! Funny those were exactly my faves, we visited a lot, went for 23 days and my faves in order were Venice, Paris, Sorrento, Florence and Rome!"}, {"username": "Francoise Coupal", "comment_text": "Take a tour with A1 travel"}, {"username": "Deanna Williams Flora", "comment_text": "Once you start booking use TripIt app. Everything I book I forward and they add it to my itinerary- all the details. I leave Sunday for 10 days w 20 yr old son and first time using it. I’ll let you know how it goes…🥰"}, {"username": "Gaye Norval", "comment_text": "We did it ourselves, first time in Europe."}, {"username": "Tracy Foss", "comment_text": "Map your route book your transportation fast trains , booking.com for hotels , read get your guide & Viator for tours & activities pack your bags travel light & have a positive outlook !"}, {"username": "Debbie Fokas Vacca", "comment_text": "It is overwhelming, but you can book yourself. First book airline tickets then decide how many days you want to stay in each location based on what you want to see. You can take a train from Florence to Venice for the day. It’s an amazing trip!"}, {"username": "Maria O'Callaghan", "comment_text": "If you have never been, I suggest you get a travel agent to do it for you. The 1st time I went I did a bus tour, it gave me an overview of Europe and I learnt what places I wanted to go back to. I now use a combination of Travel agent & do some myself. Airfares I book through travel agent, much easier if things need changing whilst you are away rather."}, {"username": "Stephanie Gandy Riley", "comment_text": "I’m planning my trip myself, mostly because I love the lead up and anticipation. Google flights to get best fares, also capital one travel to use my points. Vrbo for accommodations.\nAnd the trenitalia site for trains. If you are truly stressed, work with a travel agent."}, {"username": "Elizabeth Eddy-Kaufman", "comment_text": "Tripmasters"}, {"username": "Julie Angel Bruther", "comment_text": "Just breathe. Start with your first stop. Research Airbnb (plenty left, I just did it for October & November) pick a place , and how to get to and from there. Then next place. Remember, you don’t have to do it all in one day take your time and re-search the area. ￼\nI even sent questions to the Airbnb host . ￼before I booked. I downloaded the Trainline app(this app will also do intercity trains) to my phone and the ￼Omio app for trains. And the”get guide app” to look at excursion stuff. This is my first time as well."}, {"username": "Gail Dial Harris", "comment_text": "After much research I always plan the trip on my own! Even on cruises I plan excursions on my own! You learn so much and get so much more for your travel dollars!"}, {"username": "Sherry Gilliam Patrell", "comment_text": "We booked through Costco. Everything was taken care of, including transportation to/from Airports, train tickets between cities, flights , hotels. Highly recommend !"}, {"username": "Jennifer Melka Maley", "comment_text": "My $20k budget was a joke .. expect to spend wayyy more. Do a lot of research on your own , know what you want - I’ve been at it for a month plus and if you hire a travel agent PLEASE make sure it’s a solid referral. There are good ones and very bad ones.. you will waste a lot of time and energy and fees if you don’t hire the right one.\n\nI’m doing the same trip as you - but in 2024. 2 nights Venice, 3 Florence , 3 Sorrento & 3 Rome .. let me know if you need any advice ! We are almost finalized !"}, {"username": "Carmela Siniscalchi Frattellone", "comment_text": "I just went to Venice, Florence, Sorrento and my families town. I booked it all on my own. I was overwhelmed at first but once I booked the flight everything fell into place. I found great hotels for about $200 a night. They were rated a 3 star. They were all clean and central located. I used the train to go from Venice to Florence and from Florence to Naples."}, {"username": "Laura Miller Bailey", "comment_text": "I completely understand! I felt overwhelmed too and got a travel agent referral from a friend. Best decision ever! I’m in Ohio USA,"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Did it myself … easy …. All the info is on line just research each city and pick and choose"}, {"username": "Renae Larcus", "comment_text": "Many options. One is to contact TripMasters. Affordable trip,packages that you build yourself and they take care of all the details. The other is to do some research, decide where you want to go and plan it yourself. Between the major towns you can take a train. Very easy. Use Rome2Rio app to see train options. Look at Rick Steves tour books or videos. Very helpful"}, {"username": "Cindy Breneman Hattrich", "comment_text": "I used a travel agency so I dont have to do anything"}, {"username": "Elena Elkind", "comment_text": "Book with trafalgar, for first time, it’s comprehensive, takes you in front of lines for tours, so you have an idea what Italy is all about, then can go next time other places and maybe plan yourself"}, {"username": "Tracy Piko Lawniczak", "comment_text": "Take one step at a time. How many days do you have ? What do you want to do the most! Make a list of the must see things. Leave yourself time for downtown between stuff. Look at hotels in each town and go off of how many days you can afford in each place. Might have to take a place off the list to fit your budget."}, {"username": "Lisa Marie Corcoran", "comment_text": "I planned all of ours for the October and it was no where near $20K. I booked the flights, the VRBO and hotels and I planned the itinerary I wanted and then worked with Mena Forino with Amalfi Coast Transfers to make those plans come to life!"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2201253690273709", "text": "Question about night trains. I am debating about doing a Night train from Sicily to Naples (weird this ex￼cites my kids) but when I look on the site box car fits four and there’s five of us. Has anyone ever did the night trains? Can a box fit 5 and do they care if we put five in a box car? I messaged the train￼ site and have not heard back.", "link": "facebook.com/groups/1373361046396315/permalink/2201253690273709/", "likes": 1, "comments": [{"username": "Miyuki Kanno Paul", "comment_text": "How about overnight ferry from Palermo to Napoli?"}, {"username": "Brenno Bianchi", "comment_text": "You can book all the berths available in a cabin and they don't care, but they don't offer anymore cabins with six berths. The only alternative I see is buying six places in two sleeper cabins that are for three maximum."}]}, {"id": "2201274593604952", "text": "Has anyone gotten tickets for St Peter’s Basilica directly from their website? I don’t want to combine it with another tour and I want to be able to go up in the dome. The website shows some info but not enough to book in advance", "link": "facebook.com/groups/1373361046396315/permalink/2201274593604952/", "likes": 1, "comments": [{"username": "Rita Legge", "comment_text": "Lynn, tickets are not required to visit St Peter’s. You can arrange a third party tour that may include Vatican museums, Sistine Chapel and St Peter’s, but you can go on your own to St Peter’s if desired"}]}, {"id": "2201303680268710", "text": "Anybody care to share their driving/rental car experiences in Italy? The plan would be to pick up in Venice after our stay then drive to Tuscany and ultimately drop off at FCO prior to our stay in Rome. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2201303680268710/", "likes": 0, "comments": [{"username": "Ryan Monahan", "comment_text": "It seems like everyone here says it’s terrible and that you have to take the train. However we rented a car for 14 days, picked up in Rome and dropped off in Verona toward the end of our trip, then took train to Venice. We loved it! We saw SO many things that there’s no way we would have without it. Especially in Tuscany and also up around lake Garda and Valpolicella. Loved our winery visits. I have no idea how we would have done it without the car. Plus the experience of driving was awesome. We spent a few full days just driving around aimlessly, checking things out. Cost about $500USD for the two weeks, plus fuel and tolls. Used Hertz, and it was seamless. My wife and I think it was totally worth it."}, {"username": "Iris Weber", "comment_text": "We always rent a car when we are in Italy. Never had any problems. You are much more flexible than by train. We are always looking for parking places before we get to a town not to get in trouble with ZTL."}, {"username": "Yvonne Donnellan", "comment_text": "Don’t use Italian companies. Very stressful. Try to get you to pay for damages which were already there."}, {"username": "Carol Ciotti Lawlor", "comment_text": "Might I suggest taking a train to Chiusi and picking up a car there?You will already be in Tuscany. Get your International Drivers License from AAA (don’t forget your US driver’s license) and take full insurance. I recommend renting through AutoEurope.com."}, {"username": "Nissa Nolan Foster", "comment_text": "my husband and I always drive in the smaller towns in Italy, but not the bigger cities like Milan or Rome. We have been caught out by ZTL in Bologna but haven't seen the fine yet. He doesn't find it too stressful, would plan for parking in advance if you can. We generally rent from the bigger companies like Avis or Hertz, but in our April trip we used LocAuto which was also fine. We always get an automatic but that inevitably always means for us getting a wagon which is quite big if you wind up in the smaller streets. Hope this helps good luck!"}]}]