[{"id": "2196353420763736", "text": "Recommendations for places to visit on lake Como and best restaurants for lunch with a view? TIA 😁", "link": "facebook.com/groups/1373361046396315/permalink/2196353420763736/", "likes": 3, "comments": [{"username": "Renae Larcus", "comment_text": "Varenna. Albergo Milano eat on the deck."}]}, {"id": "2196357390763339", "text": "Me again... 😆 is it best to book excursions before we come over? Coming to Milan end of September, and if best to book any recommendations with who? Thanks ☺️", "link": "facebook.com/groups/1373361046396315/permalink/2196357390763339/", "likes": 2, "comments": [{"username": "Shirley Lewis", "comment_text": "if you want to see the Last Supper by da Vinci, book now! if there are no tickets, book with a tour group"}, {"username": "Glenn Todd Webb", "comment_text": "Do it before. You don’t want to waste time in country trying to book and good chance they will be sold out."}, {"username": "Steve Grossman", "comment_text": "Viator. Order all tours from the united states."}, {"username": "Connie Wilson", "comment_text": "You’ll want to book The Last Supper as soon as possible.\n\nhttps://\ncenacolovinciano\n.org/en/museum/\nthe-works/\nthe-last-supper-\nleonardo-da-vin\nci-1452-1519/"}, {"username": "Alexandra A Welker", "comment_text": "I'd say book beforehand. That's what I usually do, it gives me peace of mind."}, {"username": "Alexandra A Welker", "comment_text": "I'd say book beforehand. That's what I usually do, it gives me peace of mind."}]}, {"id": "2196358450763233", "text": "Flying from Rome to Catania airport on Tuesday, is the airport functioning? Or the flight will be cancelled?", "link": "facebook.com/groups/1373361046396315/permalink/2196358450763233/", "likes": 3, "comments": [{"username": "Kate Crangle", "comment_text": "From what I’ve seen posted it was supposed to reopen the 19th, but haven’t seen anyone confirm it."}, {"username": "Alona Cruz", "comment_text": "Flying to trapani and shuttle bus to Catania airport from what I’ve read in PUGLIA site"}]}, {"id": "2196361417429603", "text": "Going on a 16 day tour of Italy in August/September. Doing Venice,Florence,Pisa,Rome,Naples and Sorrento.\nItinerary so far\nVENICE 2 days\nBoat transfer\nVivaldi Four Seasons Musici\n\nFLORENCE 2 days\nBruellschis Dome & Cathedral Complex ticket\n\nPISA 1 day\nPisa and Cathedral\n\nROME 4 days\nVatican and Catacombs\n\nNAPLES 1 day\nPompeii\n\nSORRENTO 5 days\nBoat trip to Amalfi\nRelax\n\nWhat else should we do?\nWe have done Colosseum before.\nWe will do Spanish steps Pantheon and Trevi fountain. Is there anything else thats recommended in Rome?\nDo you recommend a tour of Pompeii? We don't get to Naples till lunchtime and plan to do it this day then have a look around Naples in evening.\nWe have also done Blue grotto in Sorrento. Is there anything else you would recommend?\nWhat else would you say is a must? Is there anything free that we can do as think I'm going to have to remortgage for this trip.\nAny restaurant recommendations and any tips gratefully received.\nCelebrating 35 years of NOT being married 😜", "link": "facebook.com/groups/1373361046396315/permalink/2196361417429603/", "likes": 5, "comments": [{"username": "Renae Larcus", "comment_text": "Too bad you don’t have more time in Florence to get out and see Tuscany."}, {"username": "Claire Dowson", "comment_text": "While at the Vatican you must queue for St Peter’s Basillica. It’s breathtaking."}, {"username": "Andrea Neiderhiser", "comment_text": "When we were in Sorrento, we took a shuttle over to Positano in the morning before it got too busy. One of the highlights of our trip for me. I had no agenda here, so when it did start to get a bit busy, I wasn’t bothered at all 🙂"}, {"username": "Shirley Lewis", "comment_text": "if you've never been to Florence you should/must 🙂 see David! the Opera del Duomo is a beautiful museum, not sure what you mean by \"tickets to the dome\", are you climbing to the top? long climb, long line and IMO very overrated especially since you have only 2 days. that ticket includes the baptismal which is beautiful inside and worth a visit. walk across the Ponte Vecchio to the oltrarno (over side of the Arno river) and have a meal and look around, different from the south side of the river. if you're visiting the Uffizi book timed tickets, plan your visit as to what you want to see so you can utilize your time, the museum is huge and can take up valuable hours. August/\nSeptember is going to be HOT and very CROWDED, so be prepared! enjoy ... I love Italy <3"}, {"username": "Charleen Siegler Schuss", "comment_text": "It looks like a great trip. While in Rome, a Piazza Navona, Campo de Fiori in the AM for a quick visit. Also recommend a small delicious museum with beautiful artwork, Borghese Gallery."}, {"username": "Brian Marcus", "comment_text": "I would add a day to Florence! If you can get to San Gimignano I also recommend.\nI loved and so glad I did not miss Pompeii.\nI will gladly skip Pisa forevermore after just a couple of hours there."}, {"username": "Anita Clayton", "comment_text": "Miss out Pisa and do 2 nights in Naples, totally chill in Sorrento."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "I wrote a post here about nice things to do and see in Pisa!\nIn Rome there are many beautiful churches with great artwork: Santa Maria del Popolo, Santa Maria in Trastevere, San Giovanni in Laterano. Also Basilica di San Callisto, Galleria Borghese, a stroll in Trastevere area, in the Jewish Ghetto and Monti hill: they are all great! And check for Gianicolo!"}, {"username": "Friedemann Diederichs", "comment_text": "Skip Pisa, drive to Lucca!"}, {"username": "Lisa Valdovinos", "comment_text": "Take a boat to Capri."}, {"username": "Rachael Richardson", "comment_text": "Florence - wine window 🍷, piazza Michelangelo for free view of city\nRome- pantheon we booked online the day before, worth a look only €5\nPompeii is extremely hot - no shade, we entered when it opened at 9 it takes a good 3 hours but depends on temperature when you visit so afternoon may be ok"}, {"username": "Kathy Pierce", "comment_text": "Take a Pompeii tour, most guides are archeologists. It by far the most fascinating place I’ve ever seen, you do not want to miss a thing by not having someone explaining it to you. I used the GetYourGuide to app to book all my tours. Take an early tour as it gets hot in the day."}, {"username": "Rebecca Knox Housley", "comment_text": "Il Sorpasso is my favorite restaurant in Rome. I would add the Capitoline Museum to do in Rome or Breakfast at the Vatican which you can pre-book directly through the Vatican. No matter what, you’ll have a great time."}]}, {"id": "2196370257428719", "text": "Hi,\nAre there any kid friendly wine tasting options on Tuscany? My son will be 12 yrs old.", "link": "facebook.com/groups/1373361046396315/permalink/2196370257428719/", "likes": 6, "comments": [{"username": "Shirley Lewis", "comment_text": "he can go but he can't taste ... I would have liked to have had my 12 year old taste a little wine so he could calm down 🙂 🙂"}, {"username": "Vanessa Mathisen", "comment_text": "Like, kids can be there or kids can drink? 🤔"}, {"username": "Laura Ortiz", "comment_text": "Italy is more strict than Germany, it said on Google that they have to be at least 18 years old. In Germany, they can be 14 or younger with parental supervision."}, {"username": "Kirsten Abrams", "comment_text": "Umm…"}, {"username": "Abigail Martel", "comment_text": "My sisters and I were all under legal drinking age the first time we went, we had no issues. Poggio antico"}, {"username": "Krissy Dascoli-Meehan", "comment_text": "My kids came w me when we went wine tasting. It was fine."}, {"username": "Catherine Lackey", "comment_text": "My 11 year old was given both wine and limoncello on several meals out, while we were in Italy 🤷‍♀️ We didn't allow her to drink any, of course."}, {"username": "Stacey Miller", "comment_text": "I’m sure the OP is asking for child friendly wineries. They wouldn’t be seriously asking if a 12yo can drink wine 😵‍💫"}, {"username": "Paula Brink", "comment_text": "We went to a wine tasting at Verrazzano in Greve in Chianti with our son when he was 14- he enjoyed it. There were other families there with what looked like younger kids.\nThey had olive oil tasting too and I think you can book to have lunch there."}]}, {"id": "2196370694095342", "text": "First time in Italy. We are looking to visit the coliseum in September. We want to do it on our own . Should we just buy entry tickets from the coliseum site ? Do they do skip the line? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2196370694095342/", "likes": 2, "comments": [{"username": "Paul Anderson", "comment_text": "Buy at the door. Get a night tour as it is very hot. Do the underground tour to see the creek running underneath."}]}, {"id": "2196376487428096", "text": "I am in Rome now with my son , looking for something to do on our last day here that doesn’t involve lots of steps. Looking for any and all not necessarily main tourist attractions", "link": "facebook.com/groups/1373361046396315/permalink/2196376487428096/", "likes": 3, "comments": [{"username": "Dave Colleen", "comment_text": "Cooking class"}, {"username": "Dave Colleen", "comment_text": "Or golf cart tour through bigatours.com"}, {"username": "Kristi Entwistle", "comment_text": "How old? my teenaged kids loved renting pedal cars at the Borghese gardens and riding them around! Beautiful green space w/ lots of shade!! We bought spritzes & followed them around 🙂"}, {"username": "Traci Raymer", "comment_text": "We are doing a haunted Rome semi private walking tour tonight. If you download the Viator app there are lots of options to pick from. Just know there is an added cost for travel to and from activity."}, {"username": "Renee Ettore Suglia", "comment_text": "Basilica San Clemente. You will have to do two flights of stairs down but it’s a church on top of a church on top of a pagan church. And it’s cooler the further down you go (two of the churches are underground). Small fee to go down but the coolest thing we saw in Rome. It’s by the Coliseum."}, {"username": "Nicole Dana", "comment_text": "https://\nroma.escapegameo\nver.it/en/\nindex.php"}, {"username": "निनावी सहभागी", "comment_text": "Thanks everyone!!!!. My almost 70 year old knees will never be the same. We managed and sweated through the day!!! Caio Roma. On to Florence in the morning!!"}, {"username": "Jane Lisa", "comment_text": "Take a golf cart tour."}, {"username": "Vanessa Caretti", "comment_text": "There’s a water park - hydromania which is great fun but I’m not sure how you’d get there - maybe a taxi? (We had our own car)\n\nhttps://\nhydromania.it/"}, {"username": "Clare Lynda", "comment_text": "Take a taxi to the coast"}, {"username": "Fernanda Argomedo", "comment_text": "Picnic a Parco doria pamphilij a beautiful place"}]}, {"id": "2196380914094320", "text": "Hello; questions about train in Italy (rome to Naples)\n\nI have business class train booked with trenitalia.\n\nDo I have to print my online ticket?\n\nHow do I know which part of the train to enter to get to business class or do I get on anywhere and walk through to find the business class area?\n\nThank you 🙂", "link": "facebook.com/groups/1373361046396315/permalink/2196380914094320/", "likes": 2, "comments": [{"username": "Celia Minnucci", "comment_text": "We didn't print our tickets, we just gave our phone. Just ensure that if you purchase tickets at the station (for other routes) you validate it before you hop on. The validation machines are everywhere, the little machine before you get onto the train. On your ticket it will show you what carriage and there is numbers on the actual train. Each carriage is about 10 metres long. We did business class and found it easy. You just get there early to put your luggage in and you have an allocated seat xx"}, {"username": "Shirley Lewis", "comment_text": "https://\nwww.italiarail.c\nom/\nticket-classes-f\nare-rules/\nwhat-does-busine\nss-mean#:~:text\n=Business%20is%\n20the%20second%\n20level,one%20o\nn%20the%20other\n%20side."}, {"username": "Miyuki Kanno Paul", "comment_text": "Unless you purchased through Trenitalia’s app, you should print your ticket. Once you get to the platform, look at the side of each car by the door. You will see the number. Your ticket should look like this"}]}, {"id": "2196382067427538", "text": "👋Hi everyone, could you please recommend any good camping site(for tents)somewhere\non the coast between Venice and Ravenna? Many thanks🙏", "link": "facebook.com/groups/1373361046396315/permalink/2196382067427538/", "likes": 2, "comments": [{"username": "Claudia Amp", "comment_text": "Maybe check the Delta del Po area, Marina Romea, Lidi di Comacchio."}]}, {"id": "2196387020760376", "text": "Hi there,\nbooking my last bit of accomodation for my 3.5week italy trip and needed some advice on the amalfi area. I am solo travelling and was wondering between the following areas where I should stay or should i split my time up between 1-2 places? i am staying a total of 6 days in this area. Any hostel or solo friendly accomodation welcome too!\n· Ravello\n· Amalfi Coast\n· Positano\n· Sorrento\n· Capri", "link": "facebook.com/groups/1373361046396315/permalink/2196387020760376/", "likes": 2, "comments": [{"username": "Kay Rendall", "comment_text": "Positano. Magic. So friendly. relaxed when the tourists go home. Restaurants wherever one chats, sociales. May be more expensive accom, but if u shop around can be found if u r solo. U dont want to be sitting in your b&b alone every night. U should be enjoying Amalfi Coast after daybtrippers leave. During the day u can walk, ferry, bus to explore the area.\nThis will be my 9th stay in Positano, magic, my 2nd alone, will stay 3 weeks. In my 70,s. Started on my early 60's."}, {"username": "Rose Stolarek", "comment_text": "Praiano"}, {"username": "Jenny Payne", "comment_text": "Sorrento🌻"}]}, {"id": "2196388174093594", "text": "Hi fellow travelers this question probably been asked a hundred times, traveling end of this month from Venice to Florence-to Rome what is the nearest station from Venice to Florence staying downtown Florence. I want to book train tickets but not sure what is the nearest station. Your input greatly appreciated.", "link": "facebook.com/groups/1373361046396315/permalink/2196388174093594/", "likes": 3, "comments": [{"username": "Claudia Amp", "comment_text": "Venezia Santa Lucia to Firenze Santa Maria Novella, those are the main stations right in the city centers."}, {"username": "Janet Messanelli Bozzone", "comment_text": "Santa Maria Novella."}, {"username": "Jenny Payne", "comment_text": "I travel a lot in Italy I use Italo train company as they only use a few platforms in major cities so you don’t have to run far usually 3,4,5) something like that 🌻"}, {"username": "Rhona OConnor", "comment_text": "Use Google maps to plan your journey, that will show you the stations."}, {"username": "Jenny Payne", "comment_text": "Lori Sammons major cities are Naples,Rome,Flo\nrence,Milan, if you need to change trains to a local train you most likely will have to go down & up stairs to get to the platform . My other suggestion don’t take the world ,it’s a nightmare to carry it around , have done travelling the world and I now go very light ,if I need something I buy it 🌻"}]}, {"id": "2196391190759959", "text": "Where is the best place to shop in Italy?", "link": "facebook.com/groups/1373361046396315/permalink/2196391190759959/", "likes": 4, "comments": [{"username": "Anthony Parisotti", "comment_text": "Mom and pop stores.\nWhere the locals shop.\nAvoid tourist trap. Everyone thinks Americans are rich, so in a hot spot, you'll pay a premium."}, {"username": "Francesca Malte", "comment_text": "There is no specific place! Obviously you shop Milano or other major cities you get hit harder… smaller cities and towns you will find Saldi ! The mercato always has fun stuff and some good quality for dirt cheap! The mercati differ from place to place as to when they operate. Last week I was lucky in Bari buying sandals at 32 euros or leather for 55 euros a pair."}, {"username": "Stacy Prestigiacomo", "comment_text": "Florence outlets - the mall was amazing!"}, {"username": "Ralph D'Antonio", "comment_text": "If your looking to buy anything leather..it's Florence."}, {"username": "Marie Cuzzi", "comment_text": "Stay out of all the tourist traps … shop at those tiny shops on the back streets"}, {"username": "Claudia Amp", "comment_text": "If you happen to be in Tuscany, visit mercato di Forte dei Marmi (on Wednesdays). They normally have stock from high end brands and you can try to bargain."}, {"username": "Leyla Ozlem Oklu", "comment_text": "Everywhere"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2196391317426613", "text": "Best tours for Colosseum. Seeing underground and floor and palantine hill. Any thoughts?", "link": "facebook.com/groups/1373361046396315/permalink/2196391317426613/", "likes": 3, "comments": []}, {"id": "2196392197426525", "text": "If travelling from France to Italy can I just use my Carte de séjour or does it have to be my passport?", "link": "facebook.com/groups/1373361046396315/permalink/2196392197426525/", "likes": 2, "comments": [{"username": "Noel Chittim", "comment_text": "There are no passport controls in Schengen area of Europe so you shouldn’t need to show your passport even if going through Switzerland"}, {"username": "Kristina Ruk", "comment_text": "You are in different country you have to have travel document with photo, which in Shengen is passport or identity card ;)despite the fact that there is no border control"}, {"username": "Gillian O'Callaghan", "comment_text": "You won't need anything when you cross borders within mainland Europe. When you arrive/leave or pass in/out of Schengen it must be your passport."}, {"username": "Alessandro Iannelli", "comment_text": "Your regular identity card is enough, as it is for all citizens within the Schengen area."}, {"username": "Julie Butters", "comment_text": "Thank you for the information"}, {"username": "Paul Vincent", "comment_text": "Your CDS is NOT a travel document....whi\nlst border checks are uncommon thruout schengen, always best to travel with passport"}, {"username": "Ruth Akutu Maccarthy", "comment_text": "You are still in Europe so you really don't need your passport BUT once I was advised at the airport to still take it along"}]}, {"id": "2196405474091864", "text": "My family is of Italian origin but I live in Canada. Have been to Italy more times than I can count as we still have family there.\n\nI wanted to write a post though about visiting Siena… I’ve been all aroundआणखी Italy however, this was my first visit to Siena and I have to say that it is a MUST see! We took a 3 week trip for my parents’ 50th anniversary and took our kids along too (7, 8 and 15). Everyone enjoyed Siena so much and we wish we would have booked there longer (our stay there was 4 days).\n\nSo, take this as a PSA… if you’re looking for a lovely destination for a few days with or without kids, Siena is a must do!", "link": "facebook.com/groups/1373361046396315/permalink/2196405474091864/", "likes": 230, "comments": [{"username": "Alicia Cox", "comment_text": "100% agree! And good restaurants & good shopping😱."}, {"username": "Amy Sandler Riemer", "comment_text": "Beautiful! Do you recommend a full day there instead of combining with San Gimignano?"}, {"username": "Lois Letterie Cianci", "comment_text": "Love Siena, have been there a number of times, most recently in October. Every trip we take to Italy, Siena is always on the itinerary."}, {"username": "Perla Ivonne Vargas Miranda", "comment_text": "Es bellísima siena me encantó"}, {"username": "Perla Ivonne Vargas Miranda", "comment_text": "Spectacular!"}, {"username": "Luanne Carey", "comment_text": "We loved Siena too! A bit of a claustrophobic climb up the tower but well worth that view. We were only there for two nights but definitely would have enjoyed a longer stay."}, {"username": "Linda Hernandez", "comment_text": "It looks nice"}, {"username": "Joan MacColl", "comment_text": "Lovely place- wished I could have stayed longer"}, {"username": "Mimi Massara", "comment_text": "Did u do a walking tour by chance while u were there?"}, {"username": "Gary Trignani", "comment_text": "We’ve been many places in Italy as well, and Siena is one of our favorite places too! Great photos."}, {"username": "Emily Thelen", "comment_text": "Can you give suggestions on what teens would do if we did a day trip in the winter?"}, {"username": "Carrie Schindler Schwab", "comment_text": "Love Siena!"}, {"username": "Jill Anne Smith", "comment_text": "I agree , Sienna is the most beautiful of cities . We live in Australia but travelling to Milan in September to stay in Verona for a week and then Bolzano in the Dolomites before going to visit family in Switzerland . We have 4 full days in Verona : recommendations\n? Jill"}, {"username": "Wendy Gauci", "comment_text": "I named my daughter Siena after visiting on a tour in 2001, finally visiting there again next year ❤️"}, {"username": "Leone Karzon", "comment_text": "Looks amazing , definitely on my wish list for next year!"}, {"username": "Jeanne Valsi Fastero", "comment_text": "We absolutely love Siena. It’s a must see ❤️❤️❤️"}, {"username": "Caroline Ramirez Randazzo", "comment_text": "I Love Siena! My favorite!!!🤎🤎🤎"}, {"username": "Lisa Rotondi", "comment_text": "Wholeheartedly agree — we were also just there with our teens, for our parents’ 50th anniversary. Everyone loved Siena! 🙂"}, {"username": "Andia Educ", "comment_text": "Je vis au Canada et j'aimerais bien découvrir l'Italie, des hôtels à conseiller ou location Rbnb je suis preneuse."}, {"username": "Sarah Emerson Nelson", "comment_text": "Sigh.. we had to nix Siena as it was the last day of a joint trip and we were exhausted! We did too much \"toursity\" stuff I think and had to sacrifice this great spot. Next time I guess!"}, {"username": "Virgz Van Møøre", "comment_text": "I think this is very personal, been a few hours there, really enough, not much to see, most of the waiters being rather unfriendly despite few people"}, {"username": "Ann Treviño Mears", "comment_text": "We were the day of the Palio and the whole city was abuzz with excitement!"}, {"username": "Amy Gutierrez", "comment_text": "Loved Siena! I bought the most beautiful scarf there! Loved Italy! Fantastic trip!"}, {"username": "Marjie De Villa Lorica", "comment_text": "We are going on a day trip from Florence —to Siena, San Gimignano, Chianti (for lunch) and to Pisa. It is a day long trip with Trip Advisor- Walkabout Tours.\n\nI know it is hurried but given the situation- we opted to take this tour to cover these areas in Tuscany.\n\nWe are also doing a long day trip to Cinque Terre with the tour operator.\n\nKeeping my fingers crossed and hoping for the best❤️🙏❤️!"}, {"username": "Dafne Espinoza", "comment_text": "Glad to hear you had a great time.\n\nDid you rent a car? I am still trying to decide whether to take a day trip from Florence or stay 1-2 nights in Siena. Would prefer not to use a car. It would only be my mother and I."}, {"username": "Yolanda Espinoza", "comment_text": "Precious❤️A me me encantó mucho.\nLastima que fue también povo tiempo\nQ estuvimos allí. Toda la Toscana esta\nBellísima."}, {"username": "Holly Jaffe", "comment_text": "Thank you for sharing!!!"}, {"username": "Lana Zak", "comment_text": "I was about to ask how much is there to see in Siena. Thank you"}, {"username": "Pom-Eric Doland", "comment_text": "My husband and I are going to be in Siena for 3 nights in November with two teenagers. Would you have any recommendations\nof things to keep everyone engaged? We would like to do some wineries too!"}, {"username": "Mimi Massara", "comment_text": "Will be in Siena in September for 2 days, any suggestions on walking tours to see the highlights? Nothing too strenuous we are all in our 70’s . Didn’t really want to do Viator, hoping for more of a local low key person to take us around. Thank you in advance!"}, {"username": "Dr-Jon Warnecke", "comment_text": "Add nearby San Gimignano to the itinerary for a truly medieval Italian village"}, {"username": "Kimberly Lampros", "comment_text": "I loved siena! I hope to go back"}, {"username": "Kate Bella", "comment_text": "Wolf Belasco"}, {"username": "Marcela Martinez", "comment_text": "We will take a day tour to Siena and San Gimignano in September. Can’t wait!"}, {"username": "Cyndi Raybon McKnight", "comment_text": "I agree! Maybe not during the Palio..."}, {"username": "Ashlee Ann", "comment_text": "Can someone tell me what there is to do in Siena. Looking to do a day trip from Florence?"}, {"username": "Elisabeth Ottesen Pedersen", "comment_text": "Do you have any tips on the best places to eat in Siena? I am going to Siena soon 🇮🇹😊"}, {"username": "Ana L Baratta", "comment_text": "Looks beautiful . Linda Hernandez"}, {"username": "Shirley Lewis", "comment_text": "and probably less crowded than Florence, tho Florence is my love 🙂 Siena is wonderful"}, {"username": "Paulette Molasses Sims", "comment_text": "I'm trying to decide if to stay in Siena or Florence for 4 days on our trip next October. Thanks for the info."}, {"username": "Karen Bowman", "comment_text": "Can you share where you stayed?"}, {"username": "Doug Burke", "comment_text": "We stayed in Sienna 5 days and used it as our base to see Tuscany. Loved it."}, {"username": "Renee Rundle Stoneham", "comment_text": "Agree! Sienna was one of our favorite places in our first trip!\nWe only did a day trip, so have to go back!"}, {"username": "Lynn Haldane", "comment_text": "Maja Sikora"}, {"username": "Bob Sullivan", "comment_text": "My first trip in '01 was for a wedding in Siena."}]}, {"id": "2196410070758071", "text": "My husband and I are going to Northern Italy in July of 2024 with a tour. Our second week will be on the Amalfi Coast on our own. Any hotel suggestions in Sorrento? Also should we base ourselves there or stay in Capri also? Should we book day tours anywhere? Recommendations for our free day in Florence/Tuscany also.\nBest way to travel from Rome to Sorrento? As you can see, our first time in Italy. Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2196410070758071/", "likes": 2, "comments": [{"username": "Katia Macri-Roberts", "comment_text": "In Sorrento I stay at the Hilton Sorrento Palace, beautiful pools, food and views. I’ve also stayed a few times at the Grand Cesare Augusto which is also nice but not as nice as the Hilton. Capri is very expensive."}, {"username": "Scott Hunt", "comment_text": "Joan Parenti I am here now\nWe were in Florence and did a few tours , there is one on viator did Sienna , San gimingano , Pisa and lunch at a winery if you like that but was a bit long 12 hours , we also did a Pizza and gelato at a farmhouse best tour on trip\nWe trained to Naples and private driver to Positano\nWe are staying Positano as it is in the middle u can day trip to Amalfi , Sorrento , capri\nThere are ferry’s or get a taxi to any of them time and costs dependent\nWe stayed hotel Maricanto perfect location and had private beach\nOn main beach you have to pay for deck chairs etc this hotel all included\nHope it helps"}, {"username": "Joan Parenti", "comment_text": "Thanks so much!!!!"}]}, {"id": "2196411727424572", "text": "Since Venice will have water strike tmr, any suggestions on half day must see suggestions 😂😂", "link": "facebook.com/groups/1373361046396315/permalink/2196411727424572/", "likes": 3, "comments": [{"username": "Lisa Martinson", "comment_text": "What’s a water strike?"}, {"username": "Ellen Edmonds-Wilson", "comment_text": "Walk to St Mark’s Square and see the Doge’s Palace and St Mark’s Basilica. That will take up half a day."}, {"username": "Jenny Godfrey", "comment_text": "Lido beach?"}, {"username": "Rosanna Hardeman", "comment_text": "Bellinis and people watching or shopping!!!!!"}, {"username": "Graham Sherlock", "comment_text": "Just walk around, the strike should have zero impact on you"}, {"username": "Paola Bersano", "comment_text": "Venice is such a wonderful town, and best visited on foot. Relax, enjoy the views, get lost in the little \"calli\", stop in a bacaro for a spritz with select and some cicchetti."}, {"username": "Nancy Kirby", "comment_text": "Burano"}, {"username": "Anne Ellis Teather", "comment_text": "Water Taxis are way better anyway. Also Venice is a place to just get “lost” in. Or sit at a cafe drink Italian beer and order samples off the menu right on the Grande canal and watch the world go by. A perfect day in my opinion."}, {"username": "Mary Anne", "comment_text": "Walk across the Rialto bridge and check out the fresh markets and the streets behind them. No crowds, lots of locals."}]}, {"id": "2196415350757543", "text": "Looking for AMAZING Truffle dinner experiences in fury at two weeks of November. From Nice to Parma and surrounding areas. Doing my own research but getting confused. Thanks!!!", "link": "facebook.com/groups/1373361046396315/permalink/2196415350757543/", "likes": 1, "comments": [{"username": "Claudia Amp", "comment_text": "Don’t know about truffles but I recommend these two restaurants, among the best in Parma: Trattoria Ai Due Platani (a few km from Parma città) and Ristorante Cocchi (book both in advance, especially Trattoria Ai Due Platani is always full)"}, {"username": "Alice Francesca", "comment_text": "The BEST truffles are from the Piedmont area! Check the international truffle fair in ALBA, in october/\nnovember\nhttps://\nwww.google.com/\namp/s/\namp.theguardian.\ncom/\ndiscover-piedmon\nt-and-alpine-it\naly/2023/jul/\n06/\nkings-of-the-mou\nntain-all-you-n\need-to-know-abo\nut-the-food-dri\nnk-and-produce-\nof-piedmont"}, {"username": "Alice Francesca", "comment_text": "Only one word: Piedmont\nhttps://\nwww.google.com/\namp/s/\namp.theguardian.\ncom/\ndiscover-piedmon\nt-and-alpine-it\naly/2023/jul/\n06/\nkings-of-the-mou\nntain-all-you-n\need-to-know-abo\nut-the-food-dri\nnk-and-produce-\nof-piedmont"}, {"username": "Alice Francesca", "comment_text": "https://\nwww.fieradeltart\nufo.org/en/"}, {"username": "Andrea Gattini Pennington", "comment_text": "Erica Bruno Ruggieri the International White Truffle Fair runs from October to December in Alba, in Piedmont region in between Nice and Parma. They have all kinds of cooking and wine events. Something different!"}, {"username": "Sharon Schwartz", "comment_text": "Just came back from Lake Garda/Verona/\nBologna/Modena/\nParma/Treviso/\nTrieste trip and would be happy to share. Amazing day trip in Parma to prosciutto/\nparmesan/\nbalsamic makers with amazing lunch included.\nYou will not be disappointed!\nDidn’t have truffles though, sorry!"}]}, {"id": "2196416404090771", "text": "Good Morning,\n\nI am planning to travel to Tuscany or Sicily\nI just want to do both if they are close, I want the experience of the beautiful village cafes in the streets wine and beauty.\nI will be there 8 days , what can you recommend ?\nAlso hotel or B&B\nThat is close to everything, I have traveled globally but never to Italy .\nThank you in advance!!", "link": "facebook.com/groups/1373361046396315/permalink/2196416404090771/", "likes": 10, "comments": [{"username": "Simone Pfenninger", "comment_text": "Simone Pfenninger"}, {"username": "Claudia Amp", "comment_text": "They are not close but you can fly from Pisa to Palermo (just an example). So you can do both, just plan well and book your planes from Tuscany to Sicily (which is huge so consider the area you want to visit very well and plan from there)"}, {"username": "Mike Ball", "comment_text": "A little bit of distance between the two regions,\n\nI’ll be honest and say 8 days split between two locations wouldn’t really give you time to fully appreciate either , you would lose a day travelling between the two even if you flew,\n\nI’d decide on one or the other and really try and enjoy the experience rather than rushing it."}, {"username": "Cinzia Bonciani", "comment_text": "Rita Maria Velazquez Harb 8 days will barely cover a small part of the east coast of Sicily or alternatively the west coast & Palermo and Cefalu but it would be a complete rush job as it would with Tuscany. Book a week long tour and pick one destination. For 8 days in Tuscany I would book a tour that covers the main sights - Pisa, Siena, San Gimignano etc"}, {"username": "Jessica Therrien", "comment_text": "Tuscany and Sicily are quite far from each other. I just returned from a trip to Tuscany we spent 10 days and drove around it was perfect 👌🏼You could definitely do it in a shorter period. We just wanted to take our time and relax since I’m pregnant. The heat in the summer is also something to consider in your timeline.\nB&B in Tuscany - we definitely had a great experience at the Castillo di Spedaletto. They have 3 B&B in the castle we stayed at the il Mastio. Amazing experience!"}, {"username": "Megan Leigh", "comment_text": "It seems everyone has adequately addressed the distance, perhaps some folk could make some suggestions on both locations based what the OP is describing to help her inform her decision regarding which region to visit."}, {"username": "Allan Olexa", "comment_text": "We’ve stayed on Sicily twice finding Catania absolutely wonderful. We were there for 10 days just 2 months ago."}, {"username": "Rose Stolarek", "comment_text": "Both areas are very beautiful. I loved Tuscany but Sicily captured my heart . 8 days isn’t a long time to do both justice at all as you will spend a day at least travelling between them . We spent 10 days in one area of Sicily and that wasn’t enough so maybe just do Tuscany and spend the time travelling through and enjoy this beautiful part of Italy"}, {"username": "Dawn Falsinotti", "comment_text": "They aren’t close. I’d go Tuscany."}, {"username": "Valerie Taylor-Crow", "comment_text": "Choose one region or the other if your time is limited."}, {"username": "Phyllis Snyder", "comment_text": "Not really close- but fast train will link you."}, {"username": "Izzie MacDonald", "comment_text": "Taormina is besutiful we booked 2 days stayed 5! Plenty of trips to be had, stay in the upper town ....take the cable car down to the beach..\nWere now in Cefalu for 3 nights..lovely.\n...but hot!!! Lots of nice places to eat in Tairmina & Cefalu..\nMontepulciano is gorgeous, we made a booboo with booking & ended up 7kms away..u need to be right in the centre if u have no car.\nTheres a winery in the main street does free wine tours ..take it really interesting..."}, {"username": "Gianluca Rivizzigno", "comment_text": "you can't do both in 8 days! Choose one area and focus on that. Also, depends on the time of the year, I wouldn't do Sicily in July or August."}, {"username": "Karen Schmidt", "comment_text": "8 days is a lovely amount of time to explore Tuscany and perhaps a bit of the coast. Use Florence or Siena as a base and do day trips for part of your time…and then maybe add Cinque Terre for a bit too. As part of a larger trip we did 4 nights Florence (with one tour to smaller villages and a winery for lunch), and 3 night at a remote winery/farm just outside of Riomaggiore. It was fantastic!"}, {"username": "Michelle Cotoni", "comment_text": "They aren’t close to eachother"}, {"username": "Daniela Parhar", "comment_text": "What I’d do is stay in Florence for 4 or so days ( soooo much beauty there!) and from there travel to other cities like Siena, Lucca, Bologna, Pisa, even Venice…"}, {"username": "Claudia Castellini", "comment_text": "I think if you have only 8 days, you have to choose one of the two region: they are not close and in both there’s really a lot to see!\nI love better Sicily, but it’s just my opinion, actually are both very beautiful!"}, {"username": "Rita Maria Velazquez Harb", "comment_text": "Thank you so much!🤗\nI thank all of you , I am super excited. I guess from what I am reading Tuscany\nWould be the best for the time I am going to be there , and then do Sicily on my next trip .\n\nI will bother you all again and ask for suggestions in where I should stay ?\nI want something quaint with the flavor of Italy not a typical American Hotel I have here or that I travel to on business.\n\nAs for the Summer Heat that is no problem I am From the US in Florida and it can’t get any hotter 😀\nI really appreciate all your time in guiding me and sharing your experience and advice.\nI hope to make my reservations soon once I know where I am going to stay and what airport I should fly into to get to Tuscany.\nI want to just enjoy and relax and no stress and enjoy the beauty of Italy .\nOnce again thank you all so very much ☺️"}, {"username": "Mary Agozzino Derrick", "comment_text": "They are not close"}, {"username": "Nancy Day", "comment_text": "I just spoke to my travel person today about that also.It's doable you can fly from Florence to\nCatania,VERY responsible and if need be Fly back to Rome from there (that's possibly our plan next spring) and back to NJ from Rome"}, {"username": "Nancy Day", "comment_text": "Flight under 2 hrs fr Florence to Catania"}, {"username": "Dianne West", "comment_text": "I'd go Sicily. Can do a lot around Sicily in 8 days"}, {"username": "Steph Craddock", "comment_text": "They're not close. But you could easily fly from Pisa to Palermo or Catania."}, {"username": "Miyuki Kanno Paul", "comment_text": "You will need at least 2 weeks or more to scratch the surface of Sicilia. Take a look at an map of Italia and see how big the island is."}, {"username": "Honour Coote", "comment_text": "Hi I visited Sicily in may this year and I absolutely loved it! Not too hot or cold and I was there for a week and got to explore all of Catania city. I done a excursion trip to the valley of the temples which is full of monuments and Greek temples. I also visited pretty Taormina which has breathtaking views overlooking the blue sea."}]}, {"id": "2196418547423890", "text": "Have a trip planned to Italy in September.\nWhen in Rome going to Vatican, Sistine Chapel, Colosseum do you have to have your shoulders covered as well as your knees?", "link": "facebook.com/groups/1373361046396315/permalink/2196418547423890/", "likes": 3, "comments": [{"username": "Peggy Fisher", "comment_text": "Take a shawl or light sweater, it depends on who is on duty. Wait till you see how tourist dress. Wear your comfy clothes and shoes. I have pictures with men in shorts in the Vatican. I went in September."}, {"username": "Rita Kanten", "comment_text": "Your shoulders will definitely have to be covered. As for knees if your dress or shorts are right at your knees they will probably not say anything. But it sort of depends on the guard. If you plan on trying to get in will knees uncovered I'd take a light shawl just in case so you can tie it around your waist if they object. And the truth is they don't seem to be as strict with men just so the shorts aren't super short."}]}, {"id": "2196417760757302", "text": "Any beach/pool recommendations in Naples for next week please 🙏 🏖", "link": "facebook.com/groups/1373361046396315/permalink/2196417760757302/", "likes": 5, "comments": [{"username": "Virgz Van Møøre", "comment_text": "There is no clean beach in Naples"}, {"username": "Raf Gervasio", "comment_text": "We've booked a private beach and outdoor pool very exclusive Baia delle Rocce Verdi...you need to book in advance"}, {"username": "Jennifer Avrett", "comment_text": "Maybe you can plan a day trip to somewhere nearby with better options. Naples has a big, industrial port and is not a great place to be in the water. Capri, Ischia, and the Amalfi Coast are all great options"}, {"username": "Genevieve Bastien", "comment_text": "Day trip to Capri, Sorrento or Ischia is a great choice :)"}]}, {"id": "2196420794090332", "text": "So excited- all dining and activities are booked for our two week stay in Rome and amalfi coast.", "link": "facebook.com/groups/1373361046396315/permalink/2196420794090332/", "likes": 1, "comments": []}, {"id": "2196422237423521", "text": "Hello, I want to plan a trip to North Italy but only have a week. We will fly to Milan so this will be our base. There are so many options for day trips but we have to be selective. Which day trips do you think are worth it the most?\n\n- Lake Como (will probably definitely visit)\n- Cinque terre\n- Portofino\n- Verona\n- Genoa\n- Turin\n\nI appreciate the opinion of those who have visited any of these areas. Thank you! 🙏🏼", "link": "facebook.com/groups/1373361046396315/permalink/2196422237423521/", "likes": 3, "comments": [{"username": "Linda Brecher Bekoff", "comment_text": "What month- that matters."}, {"username": "Linda Brecher Bekoff", "comment_text": "Weather might be cool in N. Italy but not likely crowded. Easy train from Milan to Cinque Terra. Worth a 2-3 day trip- mostly if you like to hike. Many day hikes- not for the timid. Vertical climb up and down. Not dangerously but physical- hiking shoes and water. If rain, no hiking. We have been to a number of northern towns- loved Turin - medium size city- museums, food, walkable. Look at Asti and Alba too. They are all reachable by train. If you drive, be sure your accommodations include parking. Don’t get the car until you are out of Cinque Terra (they have no need for cars- train/ferry will do)"}, {"username": "Michelle Casillas", "comment_text": "The Dolomites!! Anywhere in the Dolomites. You can take the gondolas for hikes and the most stunning views. Lago di Braies.\nAnd If you choose Verona make sure you visit Lago di Garda."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "If it is 7 full days I’d leave at least two days for Milan, then I would consider Lakes (there is more than one, Como but others are also really beautiful), Tourin (and if you have a car also Langhe area, near Alba and Barolo), Bologna, Ravenna and the Dolomites (but Dolomites you need a car). 5 Terre is really a long drive (3 hours train + plus the train you’ll have to do there) and I wouldn’t do it. Then obviously there is Venice but I assumed that if you didn’t put it in the list maybe you didn’t want it."}, {"username": "Miyuki Kanno Paul", "comment_text": "Genova covers 5 Terre and Portofino. Split your time"}]}, {"id": "2196423854090026", "text": "I will be staying in Capri for a few days. Is it best to ferry from there to Sorrento? What is the best option for transportation from Sorrento to Naples? TIA", "link": "facebook.com/groups/1373361046396315/permalink/2196423854090026/", "likes": 2, "comments": [{"username": "Simone Pfenninger", "comment_text": "Take the ferry Capri to Naples"}, {"username": "Iliana Zlatareva", "comment_text": "Teaub"}, {"username": "Miyuki Kanno Paul", "comment_text": "Direct ferry runs between Napoli and Capri"}, {"username": "Miyuki Kanno Paul", "comment_text": "There is direct ferry runs between Capri and Sorrento.\nFerry runs between Sorrento and Napoli.\nCircumvesuviana\nSorrento Line train runs between Sorrento and Napoli."}]}, {"id": "2196426520756426", "text": "Beautiful Brucoli, Sicilia all to myself 🤌", "link": "facebook.com/groups/1373361046396315/permalink/2196426520756426/", "likes": 23, "comments": [{"username": "Monica Colontonio Macho", "comment_text": "Beautiful!!"}]}, {"id": "2196429860756092", "text": "You can always trust Amalfi's summer", "link": "facebook.com/groups/1373361046396315/permalink/2196429860756092/", "likes": 171, "comments": [{"username": "Andreea Ciobanu-Nicolau", "comment_text": "Wow❤️ what program did you modify these photos?"}, {"username": "Pat Coleman", "comment_text": "Linda Gooch"}, {"username": "Joleen Hart", "comment_text": "Absolutely stunning!\nMakes me so excited for our trip!!! Thanks for sharing!❤️❤️"}, {"username": "Farrah Sweetiepie", "comment_text": "Robert Corpuz\nBeautiful!!! 2 weeks & 2 days left baby! 🙏🏼❤️"}, {"username": "Ann Marie", "comment_text": "Beautiful photos! Do you happen to sell the pdf files of them on Etsy? ❤️"}, {"username": "Julie Cristobal-Bernales", "comment_text": "Lovely photos! What camera lens are you using?"}, {"username": "Amanda Stewart", "comment_text": "What amazing photos!!!"}, {"username": "Stephanie Osborn Rushing", "comment_text": "Wow, leaving beginning of August, can’t wait!"}, {"username": "Linda Charlene Vaughan Osborne", "comment_text": "Absolutely stunning pictures."}, {"username": "Tiana Alexandra Atkins", "comment_text": "Where in Amalfi is this ?"}]}, {"id": "2196431087422636", "text": "Hi, Sardinia, Puglia or Amalfi? Which would you choose?", "link": "facebook.com/groups/1373361046396315/permalink/2196431087422636/", "likes": 121, "comments": [{"username": "Jenny Palmer", "comment_text": "Puglia. Sardina is too hot and Amalfi is too expensive 😂🙈"}, {"username": "Sonia Scotto Lubrano", "comment_text": "Amalfi will be mega crowded but there’s a lot to do in its vicinity.\n\nPompeii & Naples for site seeing\nBoat tours — to capri or procida or ischia.\nThe area in general is rich in history. There’s a town underwater in Baia.\nStunning views. You can stay on the outskirts in another beach town and take a ferry to the coast.\nRent a gommone and tour ischia and visit the natural hot springs there."}, {"username": "Rochelle Winsor", "comment_text": "Sardinia was not much for me."}, {"username": "Alba Jennings", "comment_text": "All 3"}, {"username": "Lulu Rose", "comment_text": "All 3!!!"}, {"username": "JanFrank Mullady", "comment_text": "Amalfi"}, {"username": "Rhona OConnor", "comment_text": "Puglia is so interesting. Lots to do. Not crowded. Amalfi is amazing but totally overrun with tourists!"}, {"username": "Rhona OConnor", "comment_text": "Rhona OConnor"}, {"username": "Aurélie Grard", "comment_text": "Puglia ❤️🫶🏻"}, {"username": "Sheraleigh Sapphire Pope", "comment_text": "Following"}, {"username": "Margaret Helen Holmes", "comment_text": "I live in Puglia the beaches are fantastic i go away to Amalfi in November to see and do"}, {"username": "Diane Spells", "comment_text": "Pulgia"}, {"username": "Timothy Day", "comment_text": "Cala gonone sardinia"}, {"username": "Plamen Gerasimov-Pindo", "comment_text": "И трите, дядо Попе!"}, {"username": "Katherine Allen", "comment_text": "Sardinia for sure"}, {"username": "Lyn Pappas Dahm", "comment_text": "You can’t go wrong"}, {"username": "Lori Mongillo", "comment_text": "Amalfi!"}, {"username": "Elizabeth Grafel", "comment_text": "I’ve not been to Sardinia, nor Puglia."}, {"username": "Julie Smith", "comment_text": "Amalfi!"}, {"username": "Deborah Nash", "comment_text": "We like Amalfi"}, {"username": "Nikki Nestor", "comment_text": "YES!"}, {"username": "Isabel Salcedo Patterson", "comment_text": "I loved Puglia. The beaches were so amazing! Also went to Lecce. It was a beautiful city"}, {"username": "Kristiina Kudjoi", "comment_text": "All of those❣️"}, {"username": "Amar As", "comment_text": "Puglia. All the way!"}, {"username": "Alison Abela", "comment_text": "Puglia 😍😍"}, {"username": "Adriana Sormani", "comment_text": "All"}, {"username": "Adriana Sormani", "comment_text": "But Sardegna is a whole different experience!"}, {"username": "Karoline Bakker", "comment_text": "Verona, Sirmione, lago Maggiore, Caorle, lago trasimeno, Bologna, Rimini and Cattolica, lazio, Umbrie, lago d’Iseo, mergosso, and so much more."}, {"username": "Julie Khenkin", "comment_text": "Puglia !!!!"}, {"username": "Julie Khenkin", "comment_text": "Puglia history , food , beauty , authentic and Prices !!!!"}, {"username": "Ross Lampugnani", "comment_text": "Amalfi"}, {"username": "Julia Muller", "comment_text": "We just returned from Italy and spent a week in Puglia, our first time that far south… couldn’t recommend it highly enough, absolutely loved every second and can’t wait to return!!"}, {"username": "Chris Poole", "comment_text": "Why choose? Flights between them are €30…"}, {"username": "Daniela Parhar", "comment_text": "Sardinia is gorgeous! Haven’t been to Puglia but I have been to Amalfi and would rather go to Sardinia again."}, {"username": "Karen King", "comment_text": "All so different."}, {"username": "Kylie Forrest", "comment_text": "Puglia."}, {"username": "Alina Panaite", "comment_text": "Amalfi 💙"}, {"username": "Rita Sanza", "comment_text": "All of them !"}, {"username": "Sarina Miano", "comment_text": "Sardegna"}, {"username": "Sonny Sky", "comment_text": "Sardinia! We did Amalfi and rime after and 💯 loved Sardinia!!!! So many beaches and lots of hiking! Awesome food!"}, {"username": "Tasha Kathleen", "comment_text": "Sardinia is paradise on earth. Went for a month in 2004, and have been aching to go back ever since. I’d move there if I could."}, {"username": "Elsa Hurt", "comment_text": "Puglia as I've yet to go!"}, {"username": "Rhodora Simas", "comment_text": "I'll go to everyone of them."}, {"username": "Sabine Pressl", "comment_text": "Sardinie"}, {"username": "Fabio De Filippi", "comment_text": "All of them"}, {"username": "Daniela Orecovska", "comment_text": "Puglia"}, {"username": "Vera Morales", "comment_text": "Almafi!"}, {"username": "Deborah Merandi Staud", "comment_text": "Do all 3!"}, {"username": "Robert Janssens", "comment_text": "Puglia !!!!!!"}, {"username": "Cher Gee", "comment_text": "Amalfi 😍😍 it's an absolute bucket list location for me. I can only dream..."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "When? For how long?"}, {"username": "Elisabete Proenca", "comment_text": "Amalfi"}, {"username": "Victor Manolache", "comment_text": "Puglia"}, {"username": "Charly Ricchi", "comment_text": "Sicily"}, {"username": "Pam Long Fruth", "comment_text": "Amalfi"}, {"username": "Sabrina Novo-Rivellese", "comment_text": "Puglia!!!!"}, {"username": "Michelle Thrasher", "comment_text": "Puglia"}, {"username": "Maria Graziella Rincon", "comment_text": "Puglia"}, {"username": "Sonja Leck", "comment_text": "Puglia"}, {"username": "Myrna Joseph", "comment_text": "Sardinia!💗"}, {"username": "Gina Aguilar", "comment_text": "Amalfi"}, {"username": "Constantine Matsos", "comment_text": "Why choose? Go to all three."}, {"username": "Nina Marchese", "comment_text": "Amalfi, and Sardinia"}, {"username": "Frances McDonagh", "comment_text": "I've been to lots of Italy but never Puglia I'm going to go there is I can next year"}, {"username": "Jacqueline Chapuis", "comment_text": "Sizilien! Sardinien hat zwar schöne Strände aber war weniger sbwechslungsrei\nch"}, {"username": "Debra Denton", "comment_text": "Sardinia for a change !!"}, {"username": "Catherine Darsigny", "comment_text": "Amalfi ❤️"}, {"username": "Revd Engin Yildirim", "comment_text": "I agree that it depends on what you like to achieve. Amalfi cost is really good, but whilst I haven't been in Sardinia, I think it maybe offering more a package deal."}, {"username": "Billie Frances Swanda", "comment_text": "Amalfi. Stay at La Perla beautiful view"}, {"username": "Simona Ionică", "comment_text": "Amalfi"}, {"username": "Victoria M. Ohanian-Forte", "comment_text": "Amalfi and then you can also take the ferry to Sardinia!"}, {"username": "Isabel Melo", "comment_text": "All of them...😁"}, {"username": "Nakitha Badon", "comment_text": "All"}, {"username": "Rebecca Wells", "comment_text": "All three!!"}, {"username": "Romana Jirankova", "comment_text": "Puglia !"}, {"username": "Christopher A. Johnson", "comment_text": "Sardinia for beaches."}, {"username": "Maria Petrozzi", "comment_text": "All of them"}, {"username": "Yelena Shakhanova", "comment_text": "All very different . Sardinia - best beaches. Amalfi- just picture perfect and mesmerizing especially Positano.! Most expensive . Puglia - great combo of it all!!!!"}, {"username": "Ann Barrett", "comment_text": "Amalfi, but when cooler!"}, {"username": "Janet Heston", "comment_text": "Sardinia because of ancestry. All are beautiful."}, {"username": "Theodore Meyer", "comment_text": "Sardegna"}, {"username": "Anna Jennings", "comment_text": "Sardinia"}, {"username": "Soc Cer", "comment_text": "ohhhhh...that's\na tough one...they all have their own beauties about them....my answer would be determined by how long you plan to stay. Puglia and Sardinia are beautiful.....p\nrobably less tourists in Puglia....Amalf\ni would be full of tourists but also so beautiful....."}, {"username": "Katherine V. Mehlos", "comment_text": "Amalfi"}, {"username": "Jose Corpuz", "comment_text": "Amalfi"}, {"username": "Barbara Granuzzo", "comment_text": "Our group of 4 are thinking about renting a place in Monteriggioni for 4 nights as a base to explore the Tuscany towns. (Slightly a bit NW of Sienna I think). Opinions?"}, {"username": "Kate Barr", "comment_text": "Amalfi.. but having said I have explored the others which I’d like too.."}, {"username": "Anthony Addonisio", "comment_text": "Amalfi first than Sardinia and Puglia. I want to explore all of Italy……."}, {"username": "Veda Viscosi Bak", "comment_text": "All lol"}, {"username": "Lynette Peter", "comment_text": "Sardinia 👍👍👍"}, {"username": "Dianne West", "comment_text": "Puglia or Sardinia - Amalfi over rated, over crowded and over priced."}, {"username": "Ilaria Verda", "comment_text": "Sardinia for sure"}, {"username": "Lindsay Stewart", "comment_text": "Puglia is beautiful"}, {"username": "Constantino Oraa", "comment_text": "I choose all because they are all beautiful and I want to go there."}, {"username": "Sherifa Abdel Hady", "comment_text": "Sardinia all the way"}, {"username": "Hudd Cass", "comment_text": "Amalfi 100%"}, {"username": "Tom Sutton", "comment_text": "Amalfi for sure"}, {"username": "Karen Costa", "comment_text": "Sardinia as I have visited the amazing Puglia and Amalfi"}, {"username": "Rachel Penn", "comment_text": "Amalfi"}, {"username": "Kamila Marcinek", "comment_text": "Positano"}, {"username": "Sarahjane Zuniga", "comment_text": "Amalfi!"}, {"username": "Tatiana Badgery", "comment_text": "Puglia"}, {"username": "Chantal Loir", "comment_text": "Amalfi for sailing, excursions ect..."}, {"username": "Susan Crews", "comment_text": "Sardinia hands down but shhh keep it a secret 🤫"}, {"username": "Olja Bančić", "comment_text": "Sardina❤️"}, {"username": "Mariateresa Corvini", "comment_text": "Sardinia's beaches are as beautiful as those in the Caribbean but there's not much else to see. Amalfi is beautiful but with few beaches, Puglia has beautiful beaches and also beautiful villages"}, {"username": "Nicolò Mezzasalma", "comment_text": "Sardinia360"}, {"username": "Carolyn Stys", "comment_text": "Puglia"}, {"username": "Dana Paula", "comment_text": "Sardenia."}, {"username": "Maria Cappucci", "comment_text": "Amalfi all the way!!"}, {"username": "Lulules Roberts", "comment_text": "All of the above"}, {"username": "Otilia Dobre", "comment_text": "Amalfi"}, {"username": "Stephanie Clark", "comment_text": "Puglia\n\nThe Awaiting Table Cookery School in Lecce, Italy"}, {"username": "Andrea Jane Whittington", "comment_text": "Sardinia…..Algh\nero"}, {"username": "Angela Nina", "comment_text": "Sardinia"}, {"username": "Izabela Janusz", "comment_text": "Puglia"}, {"username": "Ville Lignell", "comment_text": "Puglia. Amalfi is too crowded by international tourism, Sardinia is a hotspot for Italians."}, {"username": "Kristīne Brice", "comment_text": "Amalfi🩵"}, {"username": "Michelle Louise Pearce", "comment_text": "Puglia is amazing. We had nearly 2 weeks there. This year we’re going to sorrento/\namalfi for 8 days. I would never do a few days in different places in one holiday. You don’t get a real feel for the places you visit. You miss out on so much. Wherever you go, you will love it 😍"}, {"username": "Sue Mizzi", "comment_text": "All amazing places start from Pulgia"}]}, {"id": "2196433357422409", "text": "Looking for recommendations for timing to go to Italy in 2025! Also, where to take my husband who’s a first timer to Europe, when I’ve (gratefully) been a few different times ☀️✈️🫶🏼\n\nI’ve been to Italy twice;आणखी first time we did all the tourist spots during late July (Venice, Rome, Naples, Pomepi, & Sorrento), the second time was for study abroad in May-June and I did new spots (Tuscany - where we were based and did lots of day trips, Florence, Rome, Pisa, Verona, Milan, & Cinque Terre). We both enjoy trips that are a balance of fast paced and relaxation, so trying to find that balance!\n\nSharing this photo from my travels in Manarola!", "link": "facebook.com/groups/1373361046396315/permalink/2196433357422409/", "likes": 65, "comments": [{"username": "Sara Overbagh Hammonds", "comment_text": "You have hit a lot of spots. I have been to Italy twice and I think northern Italy is where it’s at! You can go to Milan and Venice but also cover Lake Como, Lake Garda and the Dolomites and lots more. And that provides fast pace and relaxation. I loved Lake Garda and Dolomites so much. I don’t hear many talk about this part of Italy much but it’s a change of pace, beyond your imagination magical and unlike most standard trips to Italy you will hear about. I love all the places I’ve been to in Italy. I will say the Italian Alps and northern Italy are just a bit different enough"}, {"username": "Julia Muller", "comment_text": "It’s an open slather until you decide what part of Italy you’d like to focus on 🤷🏻‍♀️ We focus our trips on regions as best we can. I have a post that’s gone a little crazy on our trip south of Lake Como/Venice, if you can see it. Otherwise, we’ve done a lot of Tuscany, Cinque Terre, Amalfi coast, Lake shards, Ischia etc in previous trips. Feel free to shoot me any questions once you narrow down your region of choice!"}, {"username": "Maria Coladangelo Ducca", "comment_text": "Best advice take him to places you enjoyed."}, {"username": "Tracy Wrinn Mcdermott", "comment_text": "Try something new for both of you. Maybe the Piemonte region, the Italian Alps and the Langhe wine region if you like that? Or head over to Puglia ( Polignano a mare, Ostuni, and the Adriatic. You could include Matera in the Basilicata region."}, {"username": "Sally Warren", "comment_text": "Go to Sicily or Puglia"}, {"username": "Renae Larcus", "comment_text": "Lake Como or Lake Garda! At Como, we stayed in Varenna. At Garda, we stayed in Sirmione."}, {"username": "Scott Heran", "comment_text": "Go South. Amalfi Coast then Ostuni, Tropea and Sicily."}, {"username": "Lucrezia Folger", "comment_text": "Don’t go from May through Sept. Hot and crowded."}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "Been to Italy 4X…always October. Weather is perfect, crowds less and so is pricing.\n\nHow many places depends on length of your trip.\n\nNORTH\nI’d do Venice, Florence, Tuscany and Camogli (San Fruttuoso and Portofino for day trips). A bit of city, countryside and sea.\n\nSOUTH\nRome, Naples, Ischia, Capri and Amalfi Coast."}, {"username": "Linda Brecher Bekoff", "comment_text": "Late September, early October is our favorite. Crowds less, prices usually less, weather generally amazing. Pick length of stay, look at airfare deals. We often base trip on entry airport and different exit airport. Try not to over schedule- travel from one city to the next can take up to 1 day. Spend 2-4 nights in each location or use a base city with a car (Tuscany, Umbria, Sicily we used Siracusa). I hope you can enjoy the planning as I do. Research and read reviews of accommodations."}, {"username": "Perla Ivonne Vargas Miranda", "comment_text": "Perla Ivonne Vargas Miranda"}, {"username": "Phyllis Snyder", "comment_text": "September and October"}, {"username": "Eemlock Mtlner", "comment_text": "Have a wonderful time!"}, {"username": "Roland Trego", "comment_text": "With two weeks, I think it's good to include Rome, Tuscany (Florence+count\nryside), and Venice; or Tuscany, Rome, and Sorrento/\nAmalfi Coast."}, {"username": "Jono Roland", "comment_text": "You kind of answered your own question.. 🤓 I would have recommended a combo of the key tourist sites in Rome (Vatican City, Spanish Steps, Trevi Fountain, Colosseum etc), Pisa, Tuscany (pick your favourite places (Sienna etc).. I think Cinque Terre would be good or maybe go up to lake Como/Garda). If you have time/ budget take him to Sorrento/\nAmalfi/Capri/\nPompeii? I loved Sorrento… even though this is an Italy page I’d get him to the Greek Islands too if you can (Santorini/\nParos/Naxos/\nMykonos/Crete)… still reckon they’re heaven on earth!😎"}, {"username": "Dianne West", "comment_text": "Head to beautiful lake.maggiore north of.milan."}, {"username": "Mary Agozzino Derrick", "comment_text": "Sicily my dear, Sicily in October"}, {"username": "Carla Marini", "comment_text": "I travel annually to italy and have been consulted by family and friends on Italian travels. We come in the summer to stay on the Adriatic and enjoy sagras. However for touring I concur sept into early October is a good time period. Most people want to experience what we call the trinity- Rome Florence and Venice. Does he have a favorite place in mind? Logistics with your trip is key in ensuring both a relaxing and enjoyable experience. I suggest in Rome stay near the historic center. If Budget allows- you can get a car service to pick you up at Rome hotel early morning and drive to Positano/\nSorrento/\nPompeii and return in evening. Pricey but time effective. In Rome- golf cart tour is my suggestion. Remember to consider travel time when formalizing your itinerary. Enjoy"}, {"username": "Elizabeth Lupo DiVito", "comment_text": "I love end of Sept. Early Oct."}, {"username": "Zay Bribos", "comment_text": "I went in October and LOVED It"}, {"username": "Angela Forshaw", "comment_text": "Beautiful pic."}, {"username": "Nola Bostridge", "comment_text": "Been to Italy many times and I strongly suggest Sardinia as something different … the other great thing we enjoyed immensely was truffle hunting near Sorrento. If you haven’t done Vatican City I would suggest this and also The last supper in Milan . 🙂"}, {"username": "Michele Baron Vold", "comment_text": "May. September. October."}, {"username": "Susan Davis Dodd", "comment_text": "How is mid to end of April?"}]}, {"id": "2196435237422221", "text": "Hi! Any other families of 6 (2 parents & 4 teens) that have travelled to Italy in June & July - both North & South - that have any tips &/or accommodation suggestions?\nProbably looking at Florence, possibly more up this way, Rome, through Calabria & to Sicily.\nIdeally, we would like to do carry on luggage & a hire a car for the entire trip.", "link": "facebook.com/groups/1373361046396315/permalink/2196435237422221/", "likes": 2, "comments": []}, {"id": "2196438217421923", "text": "Hello, looking for accommodation recommendations in Rome for 3 nights for 6 Adults. We will be travelling June 2024.", "link": "facebook.com/groups/1373361046396315/permalink/2196438217421923/", "likes": 3, "comments": [{"username": "Keith Bourget", "comment_text": "We stayed a great airbnb. Near bonci pizza too"}]}, {"id": "2196439280755150", "text": "Hi all! Am flying into Venice mid September from Thursday afternoon til Sunday afternoon. I was planning on doing a day trip taking the train to Florence on Friday but now possibly debating rome instead (though Florence is 2hrs and Rome is 4hr by train). Thoughts or ideas?\nI already booked a few tours in Venice for Saturday 🙂", "link": "facebook.com/groups/1373361046396315/permalink/2196439280755150/", "likes": 3, "comments": [{"username": "Lisa McCusker Sherer", "comment_text": "Book private tours for Venice, lunch In The square amazing"}, {"username": "Nadine Winkler", "comment_text": "Do you know Venice? If not stay there."}, {"username": "Jenny Godfrey", "comment_text": "Loads to do and see on Venice but if your really thinking of going Florence is stunning and easier than going all way to Rome and back. But if you go be aware some attractions you may not get tickets for and they do sell out in advance."}, {"username": "Joseph Ceci", "comment_text": "I recommend Florence over Rome. You can walk from the train station and see the most important sites easily in a day trip from Venice. It’s just not possible to do the same for Rome as it is a huge city. Highly recommend booking a tour of the Duomo that includes skipping the line."}, {"username": "Monica Sucato", "comment_text": "Rome Is too far....you would not have Time to enjoy anything. Unless you can stay over at least one night, I would choose Florence.."}]}, {"id": "2196444190754659", "text": "Has anyone used bellaitaliatours recently for shore excursions? Can't find many reviews, I'm looking for a Tuscany/wine tour from Livorno. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2196444190754659/", "likes": 2, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2196317647433980", "text": "Opinions on driving from Rome to Tuscany?\n\nWe were going to get the train but by the time we arrive we'd be too late to get cat hire (and we can't arrive any earlier) and because of the location of our villa we need it so contemplating driving 🤔\n\nAlso any tips for car hire?", "link": "facebook.com/groups/1373361046396315/permalink/2196317647433980/", "likes": 7, "comments": [{"username": "Frank Hunt", "comment_text": "The airport car hires used to close before midnight so you need to work on that. However driving is easy if you drive on the same side of the road, slightly less if a left hander…..…"}, {"username": "Mike Ball", "comment_text": "Driving in rural Tuscany is very relaxing the larger towns and cities not so much ,\n\nWhereabouts in Tuscany are you planning to be ?"}, {"username": "Jeff McLellan", "comment_text": "How far is your villa from the train station/ car rental place? Can you just take a taxi when you arrive and then come back to get the rental the next day?"}, {"username": "Alice Francesca", "comment_text": "Tuscany where exactly??"}]}, {"id": "2196337627431982", "text": "I am travelling to Italy in September and planning on travelling by train and plan to book in advance, i am in the UK, can anyone advise if the trainline app is ok to use?", "link": "facebook.com/groups/1373361046396315/permalink/2196337627431982/", "likes": 6, "comments": [{"username": "Lorraine Butler", "comment_text": "Yes, I use it all the time here"}, {"username": "Pam Neary", "comment_text": "I’ve used that app and Omio. Both are great"}, {"username": "Delly Tracy", "comment_text": "Try splitting your tickdet between the uk French and Italian train cimpanies to see if its cheaper."}, {"username": "Scott Perry", "comment_text": "I used Trainline all summer. Great app!"}, {"username": "Kay Jenkins", "comment_text": "i have recently used the trenit.it app when I was in Sicily and it was so easy and clear to use, the tickets are emailed to you and are pre-validated."}, {"username": "Deana Miller", "comment_text": "We used the trains all over Italy. Can use the Trainline app no problem"}, {"username": "Gillian O'Callaghan", "comment_text": "I used Trainline for 4 months in UK and Italy. Love it."}, {"username": "Michele Campbell", "comment_text": "I used Trenitalia to book tickets for June and had no problems. Book early for best prices. Can have hard copy tickets or on phone"}, {"username": "Iliana Zlatareva", "comment_text": "Rome2rio"}, {"username": "Claire Dowson", "comment_text": "Trainline is brilliant. Just back from 10 days travelling in Italy by train."}, {"username": "Samantha Houghton", "comment_text": "Yep fine, I used it all the time…. If you’re jumping on a last minute train though- think it’s like 15 minutes before departure though- it won’t let you book on and you’ll have to use the ticket machines."}, {"username": "Helen Pottle", "comment_text": "I used Trenitalia last year and Italo this year"}, {"username": "Tracy Cass", "comment_text": "We travelled all over Italy on the train app it was brilliant and so cheap we couldn't believe it enjoy your travels"}, {"username": "Phillip Farquhar", "comment_text": "I use it every year"}, {"username": "Karen Blackmore", "comment_text": "We've used the Trainline in Italy and it's great. No stress trying to validate your ticket as no need. Some short regional journeys you can't buy on Trainline. Then we used the Trenord machine in the station. Then need to validate on the green machines before boarding, see photo! Just hold ticket against it, and it beeps and shows a tick ✅"}]}, {"id": "2196287757436969", "text": "Me and my wife have a trip planned this coming May to Cortona. Any tips or suggestions on things to do or see would be greatly appreciated.\nWe are planning to fly to Venice first for 2 days, Cortona for 6 and then Rome for 2.\nAny recommendations would be appreciated.", "link": "facebook.com/groups/1373361046396315/permalink/2196287757436969/", "likes": 3, "comments": [{"username": "Cat Furness", "comment_text": "Cortona is one of my favourite places. Take time to wander the streets of the beautiful town. It’s also a great base to visit Arezzo, Montepulciano and Orvieto!"}, {"username": "Steve Grossman", "comment_text": "Too many days in cortona. Add one day to venice and one day to rome"}]}, {"id": "2196288580770220", "text": "I hope I can get some advice ftom my friends here on FB…..I have spent hours checking reviews of car rental companies at the Palermo airport and for almost every review that’s positive I find 5 that say stay away because of excess charges that are added on to your bill after you return the vehicle and are in your way home even after taking allआणखी available insurance …. I don’t know which to believe and wondered if anyone here can provide insight and advice on where to rent from a reputable car company ( not a broker) to avoid these unwarranted excess charges at the Palermo airport.\nI tried hertz and Avis hoping for the best but they are almost 50% higher in price than the other lesser know car rental companies that operate in Sicily.\nThanks in advance for your considerations and advice.", "link": "facebook.com/groups/1373361046396315/permalink/2196288580770220/", "likes": 5, "comments": [{"username": "Angela O'Donnel", "comment_text": "We rented from Drivalia, currently using the car now so will let you know what happens after the return. When we got it we walked around with a phone and recorded the outside, inside, undercarriage. We will do the same thing when we return and have them state the car is fine. But you never know......"}, {"username": "Cynthia Credle", "comment_text": "We used Europcar a couple weeks ago from Palermo Airport. We had no issues. We also had insurance with no deductible."}, {"username": "Lori Greco", "comment_text": "I think it's.worth paying the extra insurance with the company when you book your rental. We had cause to use it years ago and had the amount charged for damage, within days. When you insure with them, you pay zero in the event of damages."}, {"username": "Robin Burrell", "comment_text": "Sixt has always worked well for me. Avis also."}, {"username": "Debra Kingston", "comment_text": "The 5 that say don’t are right.\nIt’s not worth the money, trying to find your way can be very frustrating, your rental car is a moving target. Base yourself somewhere and Ck tour co’s."}, {"username": "Cynthia Marie", "comment_text": "Join hertz member program. We only rent from hertz when abroad. Once our car mirror got hit. We had the additional insurance with hertz , when we returned the car there were no questions asked. Also know that 99 % of credit cards do not offer rental car insurance in Italy."}, {"username": "Miyuki Kanno Paul", "comment_text": "If you can handle the stick shift, you will save a lot😉. I used Hertz in Palermo and returned in Catania Airport without any problems"}]}, {"id": "2196288200770258", "text": "Hi everybody!\nWe are honeymooners, one of our stops is Milan and it also happens to be my husbands birthday on August 3rd. Any recommendations\nfor fun experiences or good restaurants?", "link": "facebook.com/groups/1373361046396315/permalink/2196288200770258/", "likes": 0, "comments": [{"username": "Claudia Amp", "comment_text": "I recommend old historic restaurants like: Antica Trattoria della Pesa, Premiata Trattoria Arlati, Osteria del Binari, Al Garghet, Damn-atrà Ristorante Milanese\n\nOther good options are: Ratanà, Erba Brusca (outside Milano), Risoelatte (60’s house decor, very peculiar).\n\nHave to check their holiday calendar though, might be closed for summer holidays."}]}, {"id": "2196293990769679", "text": "We will be in Rome for a day or two, with the car. Can anyone recommend a hotel with its own parking that’s not too far out from the centre? Thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2196293990769679/", "likes": 0, "comments": [{"username": "Carolina Barnhill", "comment_text": "This one is near the centre and has its own private parking\n\nHotel NH Collection Roma Vittorio Veneto\n06 84951\nhttps://\nmaps.app.goo.gl/\nHo9Ly1Xi763k4dHa\n8?g_st=ic"}]}, {"id": "2196280930770985", "text": "Hi all, is 15 to 30 April warm enough to travel in Italy (first Rome, then Florence and Venice)? How is the weather in second half of April? I need to confirm my flight dates and bookings and i am asking this to see if I can do my trip to Italy around second half of April and then travel to Germany, Swiss and France in May to visit old friends. I really appreciate your advice. Thanks very much.", "link": "facebook.com/groups/1373361046396315/permalink/2196280930770985/", "likes": 0, "comments": [{"username": "Carol Cottone-Kolthoff", "comment_text": "I am also considering April or May to visit Rome and Florence. I look forward to the replies here!"}, {"username": "Veronica Parravicini", "comment_text": "Hi! In Italian🇮🇹\nIt’s spring, meaning you can experience a nice warm weather (20-25º) or cold and rainy days (10-15º). A lot of instability\nI’d say April is better than May because in the last few years May has been really rainy to the point we have floods and landslides… so scary"}, {"username": "Alessandro Iannelli", "comment_text": "if you come in april for two weeks, and visit those cities, you are likely to experience at least a few days of rain, the temperature may be between 10 on the coldest day, especially in venice, or even up to 25 on the warmest day, in rome. personally, i enjoy rome much better in spring than in the summer, i'd rather take some rain than the impossible heat of july or august. also, it will be less crowded and at least in rome probably warm enough to be able to enjoy an ice cream. so if i were you, i would book those tickets."}, {"username": "Deb Williams", "comment_text": "We were in Rome, Florence, Venice & Milan 6/4-25/4/23. Most days started cooler, around 12deg, & ended around 18-19deg. We had 3 days of lite rain, mainly in the morning. We walked around most places, & I was actually warm - spent most days with my jacket around my waist & just in a dress or T shirt. My husband was in jeans & a shirt the whole time. This was our day at the Coliseum, which was indicative of most of our days. ￼\nBook away & enjoy!"}, {"username": "Joe Guzzi", "comment_text": "Switzerland, not Swiss."}, {"username": "Kristina Ruk", "comment_text": "Last first days of May was 24-26;) so just google what is average temperature, but there are exeptions as the heat these days ;)"}, {"username": "Julie Gallagher", "comment_text": "39 degrees today in Athens"}]}, {"id": "2196274214104990", "text": "What is the app called to work out with friends to share taxis", "link": "facebook.com/groups/1373361046396315/permalink/2196274214104990/", "likes": 0, "comments": []}, {"id": "2196260740773004", "text": "The beauty of Cortina d’Ampezzo -Italian Dolomites\n\n📷myself", "link": "facebook.com/groups/1373361046396315/permalink/2196260740773004/", "likes": 64, "comments": [{"username": "Ruth Akutu Maccarthy", "comment_text": "What a beautiful view ✨🥰"}, {"username": "Eileen Milazzo-Elliott", "comment_text": "Allison Elliott"}]}, {"id": "2196099200789158", "text": "Can you use visa or Amex gift cards to try to avoid charges ?", "link": "facebook.com/groups/1373361046396315/permalink/2196099200789158/", "likes": 0, "comments": [{"username": "Barbara Cagnazzi", "comment_text": "Avoid Amex in Europe. Many places do not accept it."}]}, {"id": "2196069740792104", "text": "I am planning my trip in June of next year and starting in Zurich then will be hitting Milan, Venice, Forlimpopoli and Sorrento looking for moderate priced hotel recommendations. Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2196069740792104/", "likes": 2, "comments": []}, {"id": "2196048370794241", "text": "Has anyone bought tickets via the official Uffizi website? Has the general admission (door 3) got long waiting times or is that just for people wanting to purchase tickets on the day?\nTia", "link": "facebook.com/groups/1373361046396315/permalink/2196048370794241/", "likes": 0, "comments": [{"username": "Jeff McLellan", "comment_text": "We did, picked up our tickets 15 minutes for our scheduled arrival time and then smoothly sailed through security (some people are clueless on that process but that is a different story LOL)0"}, {"username": "Deana Miller", "comment_text": "We did and we just skipped the queues and went straight in. Definitely recommend booking this way!"}, {"username": "Nicole Graham", "comment_text": "Perfect thank you! I booked through the official website, hopefully we don’t need to wait in line outside for too long 😂🤞🏼"}]}, {"id": "2196046324127779", "text": "has anyone spent a week or more in Sardina? any recommendations?", "link": "facebook.com/groups/1373361046396315/permalink/2196046324127779/", "likes": 0, "comments": [{"username": "Carolina Barnhill", "comment_text": "Sardinia is big and you need to rent a car to move around (very few buses or trains). North Sardinia is much more expensive and in the summer is busier because beaches are smaller than in the south, that is “wilder” and has wider beaches (but less services). You can ask me more if you want depending on your desires"}]}, {"id": "2196030164129395", "text": "We will be traveling from Florence to Rome for a 13:35 flight departure. I found an italo train that departures around 7:40 am and arrives at the Rome Termini around 9:20 am. We are wondering if this is cutting it too close or should we go to Rome the night before? Depending on the answer, I might have follow up questions. 😀", "link": "facebook.com/groups/1373361046396315/permalink/2196030164129395/", "likes": 0, "comments": [{"username": "Cecilia Christine Costantini", "comment_text": "Go the night before, if there is a delay with your train, you might miss your flight."}, {"username": "Marina Belardo Johnson", "comment_text": "I would not risk… delays and strikes might ruin your plan."}, {"username": "Donna Diamond-Upham", "comment_text": "I can't remember which train line strikes?"}, {"username": "Vikki Grass", "comment_text": "Check Tranitalia to see the departure from termini to Fco, the airport. The ride is not long but the schedule could affect timing. Also, a cab would take longer so if the schedule works out the train is a better option."}]}, {"id": "2196007500798328", "text": "When you had your first travel to Italy, did you travel alone or with someone?", "link": "facebook.com/groups/1373361046396315/permalink/2196007500798328/", "likes": 12, "comments": [{"username": "Maryann D'Allegro", "comment_text": "My grandparents"}, {"username": "Trudi Johnson", "comment_text": "With my partner"}, {"username": "Donna Mangone", "comment_text": "I traveled with 7 other family members in 1987."}, {"username": "Sandra Shoffner", "comment_text": "Went with 3 family members first trip, 3 the next, then 6 the next ( know who's going with you, trip Went downhill first day. If a person is a diva and has to been seen leave her at home).\n2 the next and last month 6 family members.\nI will not take 6 again,4 is a good number."}, {"username": "Bobbie Lane Hausherr", "comment_text": "With high school students in 1988."}, {"username": "Ildikó Székely", "comment_text": "Alone to Firenze!"}, {"username": "Luigia Gray", "comment_text": "With Mum & Dad"}, {"username": "Gillian O'Callaghan", "comment_text": "Went solo for a month.....love solo travel ❤🌎🌏🌍"}, {"username": "Joy Crawford", "comment_text": "With my daughters"}, {"username": "Amanda Jeffers", "comment_text": "Haven't been love to go"}, {"username": "Jason Hobel", "comment_text": "I met my girlfriend there for the 1st and we couldn't have picked a more beautiful country to do so"}, {"username": "Nancy Margaret", "comment_text": "With a group."}, {"username": "Jay Cabrera", "comment_text": "With my girlfriend, my sister, her boyfriend, and some friends."}, {"username": "Carola Blödgen", "comment_text": "I was a kid and travelled with my aunt"}, {"username": "Nicole Beaumont", "comment_text": "Alone! I just went in June."}, {"username": "James DiLeonardi", "comment_text": "With my Daughter"}, {"username": "Roman Veselý", "comment_text": "In year 1992 with my father, brother to Bibione, Venice 🙂 and next with my wife to Roma in year 2019 and in this year in june🇨🇿🙂🇮🇹"}, {"username": "Rebecca A. Baer", "comment_text": "I went alone through a travel agent who arranged a safe trip for me in Italy, Sicily, Athens, Crete, and Ephesus. No hassles, no arguing, just peace, quiet and excellent food everywhere."}, {"username": "Enrico Lecce", "comment_text": "My family"}, {"username": "Charmaine Rehg", "comment_text": "I will be going alone."}, {"username": "Angelina John", "comment_text": "With my husband! Going back soon!¡"}, {"username": "Annette Fordyce", "comment_text": "Lived there as a child, went back for first time as an adult in 2007 with a group, then 5 times with my sisters and once with my three eldest children."}, {"username": "Margorie Madrid", "comment_text": "With husband but it’s pretty safe to do solo as well 🥰"}, {"username": "Rhonda Russell", "comment_text": "We traveled with Trafalgar in 2013, have been back 5 times solo and had no problem"}, {"username": "Marilynn Bauer", "comment_text": "With my husband on a cruise."}, {"username": "Ellie Smythe-Jones", "comment_text": "I have just returned from my first trip, Rome, Naples, Ischia and Sorrento with my husband and 2 grown children. It was amazing and it’s certainly a country I would feel comfortable doing solo travel."}, {"username": "Elaine King", "comment_text": "With others"}, {"username": "Linda Chase", "comment_text": "With my sister on a Trafalgar tour"}, {"username": "Carolyn Lewis", "comment_text": "Solo"}, {"username": "Leslie Evans", "comment_text": "I went on a group tour with ef ultimate break last year."}, {"username": "Cat Furness", "comment_text": "Alone"}, {"username": "Jordan Messina", "comment_text": "alone for 6 weeks."}, {"username": "Michele Sica Selesky", "comment_text": "Just went for the first time with my husband on a tour group in May to Sicily and Rome. Fabulous"}, {"username": "Rosa Butta D'Astolto", "comment_text": "With my parents"}, {"username": "Karen Vanags", "comment_text": "With my Friend Lucy"}, {"username": "Benita Long", "comment_text": "Family and friends"}, {"username": "Virgz Van Møøre", "comment_text": "Alone, best time ever, can't stop since then"}, {"username": "Marie Cuzzi", "comment_text": "Alone for 4 weeks"}, {"username": "Ed Wren", "comment_text": "With someone.\nThat I could turn and say,\n“Look at that!”"}]}, {"id": "2196004764131935", "text": "I have visited many places in Italy but never near Naples- thinking of staying in Chiaia, and touring out from there as opposed to staying in the city center of Naples- any info pro or con would be so helpful and if anyone knows I’d awesome tour guides from there would love to hear thank you so much", "link": "facebook.com/groups/1373361046396315/permalink/2196004764131935/", "likes": 0, "comments": [{"username": "Dottor Peppe Insigne", "comment_text": "Chiaia è il quartiere \"chic\" più vicino al centro ed è ottimo per soggiornare essendo a pochi passi sia dal centro che dal mare. Non te lo consiglio in questo periodo,fa troppo caldo,se riuscissi a venire a dicembre sarebbe il periodo migliore"}, {"username": "Scott Perry", "comment_text": "I stayed in Chiaia for a week last month. A terrific neighborhood and very easy to get to the center via the Piazza Amedeo station."}, {"username": "Angela Gilmore", "comment_text": "Hi! Yes, Chiaia can be a good option. Is a more residential neighborhood but it is near the historic city center or the Lungomare (sea). You can easily move on foot from there and reach all the touristic places of the city.\nIt can be a little more expensive than the historic center, though."}, {"username": "Miyuki Kanno Paul", "comment_text": "We usually hang out in Chiaia❣️the nearest train station is about 20 minute on foot, but it’s not bad. Strolling Lungomare is a treat! Borgo Santa Lucia is fabulous. Have a cocktail at the rooftop bar at Hotel Excelsior(Euros\ntar)"}]}, {"id": "2196004307465314", "text": "We fly into Venice and then rent a car after Venice to head to the Dolomites. Is it easy to find a small ice chest or some type of cold bag to transport some food on our road trip or should we bring one?", "link": "facebook.com/groups/1373361046396315/permalink/2196004307465314/", "likes": 0, "comments": [{"username": "Rhonda Sutherland Farmer", "comment_text": "Following!"}, {"username": "Michelle Casillas", "comment_text": "Depending on what time of year you should be able to find one at the grocery store. The stores here are Conad, Coop, Eurospin, Eurspar, Interspar and many more. There are even Aldi’s here. So you may need to spend some time googling your route from Venice to Dolomites and see which ones are on the way. Also note ice is not a thing here in Italy…..So you may not find actual ice. Sometimes the grocery stores have bags but not very often. So You’ll need to get ice packs."}]}, {"id": "2195967834135628", "text": "Made dinner reservations at La Buchetta located in Florence. Any thoughts from those who have eaten there? Grazie.", "link": "facebook.com/groups/1373361046396315/permalink/2195967834135628/", "likes": 0, "comments": []}, {"id": "2195918007473944", "text": "Please recommend a beach club in Positano! Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2195918007473944/", "likes": 10, "comments": [{"username": "Kelly Rubec", "comment_text": "Arienzo beach club!"}, {"username": "Stacy Prestigiacomo", "comment_text": "Arienzo beach club . We were there 3 weeks ago it was great!"}, {"username": "Robert Osowski", "comment_text": "Arienzo Beach Club!!!"}, {"username": "Linda Love Vines", "comment_text": "Da Ferdinando on Fornillo Beach!"}, {"username": "Yara Yousef Karmout Salman", "comment_text": "What about l’Incanto Spiaggia ?? we booked the sun beds online and paid for it"}, {"username": "Cheryl Callahan Gibney", "comment_text": "We booked LA Scogliera and Arienzo beach clubs. Like Scogliera much better. We had our own platform with stairs to the ocean.\nYou take a short boat ride to Arienzo however very hard to get in and out of the water. Dark rocky beach."}, {"username": "Gina Miano Polizzotto", "comment_text": "Arienzo beach club. Spent 5 days on the beach. We loved it. Restaurant too"}, {"username": "Stephanie Osborn Rushing", "comment_text": "We reserved Scogliera too for our trip in August, heard it was one the “nicest”"}, {"username": "Denise Curtis", "comment_text": "Look at One Fire beach Club."}, {"username": "Paige Garrett-Abohammdan", "comment_text": "Newbie here! Is it recommended to book a beach club in Positano? Or are there beaches where I could just show up on the day?\n\n(Mid September)"}, {"username": "Bianca D'Amore", "comment_text": "Pupetto beach club. I was there last week it was great!"}, {"username": "Melissa Jane DiMola", "comment_text": "LOVED ARIENZO"}, {"username": "Tara Roed", "comment_text": "Arienzo was great!! Pricey but I loved that it was all one price packaged and no surprises. It was a fabulous day. One fire was fun too! There are places to just show up but I liked it not being super crowded. I went with my 18 year old kids and both were fin for them and not too fancy"}, {"username": "Tina Tina", "comment_text": "Fornillo beach at da Ferdinando"}, {"username": "Michelle Solak", "comment_text": "We loved Arienzo Beach Club! Such a fun vibe, great food and drinks, music and lively atmosphere. We also went to Pupetto Beach Club bc we were staying at the hotel and that was a very relaxed vibe, it was the perfect activity for the last day of our vacation. We got a discount for being hotel guests but I think we paid 50 euros together for 2 chairs and umbrella, front row. Drinks and food were great! Lovely water to swim at Pupetto - Arienzo waters were smaller and crowded so we didn’t really swim"}, {"username": "Peter Doyle", "comment_text": "Arienzo I think it has a cool place to eat on top da Adolfo I want to say is the name"}, {"username": "Kelly Huntley Clark", "comment_text": "Da Ferdinando too! Near Fornillo Beach."}, {"username": "Terina Kwiatkowski", "comment_text": "Way cheaper and way better if you drive down the coast about 40 minutes to Maiori €25 for the full day Ocean front bar a few steps away where you can enjoy your A￼ spritz￼￼! Positano and Amalfi is packed with tourism much nicer a little bit further down with the locals! Rent a scooter it worth the drive 🇮🇹🇮🇹🇮🇹￼￼"}]}, {"id": "2195896007476144", "text": "Hi Everyone, Does anyone know the taxi rate from pisa airport to Florence, Thank you 😊", "link": "facebook.com/groups/1373361046396315/permalink/2195896007476144/", "likes": 3, "comments": [{"username": "Silvia Frati", "comment_text": "Pisa airport to Lucca is around 70 euro for a 30 minute drive,30 km. Florence is around 100 km and 1hour and20 minute"}, {"username": "Frank Hunt", "comment_text": "120 Euro"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2195869264145485", "text": "Hi! Opinions on Lake Como or Lake Maggorie, overall experience, Airbnb experiences and is one better for fishing then the other? Are there charter boats available? Thanks so much!", "link": "facebook.com/groups/1373361046396315/permalink/2195869264145485/", "likes": 0, "comments": []}, {"id": "2195823460816732", "text": "Anyone else attending the Harry Styles concert at RCF Arena on Saturday night? If so where are you coming from? My daughters and wife are super excited and should be a great show. Curious how you are gettingआणखी to and from the venue that evening.\n\nWe are currently booked on a normal 1:41AM train that I think cost is €4.50 each.\n\nJust saw that this company has arranged for a special train for concert goers. That’s right 15 minutes for €70 each LOL. Guess it isn’t just Ticketmaster that is taking advantage o f concert goers.", "link": "facebook.com/groups/1373361046396315/permalink/2195823460816732/", "likes": 2, "comments": [{"username": "Katy Haustorfer", "comment_text": "I'm selling a train ticket to Milan station if you were interested"}]}, {"id": "2195533520845726", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2195533520845726/", "likes": 42, "comments": [{"username": "Marcus Tepper", "comment_text": "The colosseum night tour - is it only saturdays? I saw someone else post it’s not but the website says sat only. I’ve been checking for days and nothing ever comes available for the night one"}, {"username": "Erica Martini Cross", "comment_text": "We just booked the Italian night tour. Is it an audio guide or a person?"}, {"username": "Sara Beth", "comment_text": "Funny-I have been here for 10 days-haven’t seen a single mosquito! I packed bug spray too based on what others have said."}, {"username": "Lynne Farrell", "comment_text": "Following"}, {"username": "Rina Calves Fremming", "comment_text": "Great reviews! Thanks 😊"}, {"username": "Michelle Broome", "comment_text": "Love it!"}, {"username": "Sarah Johnson Fercho", "comment_text": "following"}, {"username": "Tori Burdon", "comment_text": "Thx! Kathy Friel- great advice!"}, {"username": "Jhermie Ortega", "comment_text": "Laine Luis"}, {"username": "Tracy Foss", "comment_text": "Sounds like a great trip hoping no mosquitoes in September"}, {"username": "Theresa Sorrentino Pagan", "comment_text": "How much did you tip your tour guides? I don’t want to be cheap and I don’t want to over do it. Thanks"}, {"username": "Preetha Mahadevan", "comment_text": "What does the Costco package cost approx ? Thanks. They always have good deals."}, {"username": "Suzanne Bryant", "comment_text": "Can you just turn up at the colosseum too? As not been able to get tickets online and via a tour guide it’s 5 times the price!"}, {"username": "Heather Smith", "comment_text": "#5 bravo 👏🏻 what a great idea 💡"}, {"username": "Rawan Hanna", "comment_text": "Athair Alshakro"}]}, {"id": "2194023127663432", "text": "I’m looking for a reasonably priced boutique hotel in old town Milan w great air conditioning.\nBooked at Unahotels Galles Milano but thinking it might not be the best choice.\n\nSuggestions Near Duomo?", "link": "facebook.com/groups/1373361046396315/permalink/2194023127663432/", "likes": 0, "comments": [{"username": "Nanci Wilson", "comment_text": "Go to the Leonardo Di Vinci museum near Duomo. I thought I knew about him, but the museum has so much more. We went in as a fluke because it was so hot. I was so glad we did. We just got back on Saturday. Milan was so okay, compared to going up to Como and Bellagio. I wished we’d spent more time up there. It’s 40 minutes from Milan. Absolutely gorgeous!"}]}, {"id": "2195294490869629", "text": "I’m getting stressed about planning our October trip to Italy so I went to AAA to gain some help. The first quote was only for myself and my husband and was $12,000 for private transfers and hotels for 14 nights. Is this about right?\n\nI asked for a new quote to include our adult son who will be joining us and the quote went to $27,000 but itआणखी included train from Venice to Munich to Zurich to Geneva for just the two of us plus lodging and transfers. (after closer look, it included all three of us. He's staying in Venice)\n\nCan I plan this cheaper myself?\n\nEDITED to add: plane tickets were purchased months ago because I kept seeing them increase. So these quotes are strictly hotels, a few tours, trains and some private transfers.", "link": "facebook.com/groups/1373361046396315/permalink/2195294490869629/", "likes": 25, "comments": [{"username": "Lisa Marie Corcoran", "comment_text": "That’s a lot! Way more than it should be! Feel free to PM me!"}, {"username": "Fabio Blarasin", "comment_text": "Yea, you can. If you need any advice feel free to message me."}, {"username": "Betsy McCallum", "comment_text": "I would definitely recommend that you do the planning yourself￼. That seems ridiculously high to me"}, {"username": "Annette Tamminga", "comment_text": "Private transfers are expensive. If you are staying at nice 4&5 star hotels the cost may not be excessive. This group is very budget oriented. I am traveling with a private car/driver and tour guide for 12 days and the cost is $12,000 for one. This includes tickets and tours to daily sites and airport transfers etc. I will be staying at two castles with vineyards and breakfast is included. It is very difficult to compare without seeing details. Some of the private tours are hundreds of euros."}, {"username": "Phyllis Snyder", "comment_text": "Yes! I’m planning my 2 months in Italy myself- I’m using Rick Steve’s guide book (absolutely amazing) - I’m watching some fabulous utube videos & series (Rick Steve’s & others) on every aspect of traveling Italy. Purchase Rick Steve’s guide book! He also has tour audio guides that are free for most sites in Italy so you won’t need to hire an expensive guide."}, {"username": "Larry Reinier", "comment_text": "That’s hilarious"}, {"username": "Ewa Olbrych-Rudzinska", "comment_text": "Do it yourself. If u have any questions ask here. the pricing is absolutely insane . Please don't go for it. you will overpay for everything"}, {"username": "Angela Greatrex", "comment_text": "Could you not fly to a cheaper destination in Europe than fly to Italy .\n\nTrain and buses are cheaper option . Download the Train app. Research one area . Various hotels / Air BB and BB options . Even mobile homes . Italy is dearer to eat one than Malta / Greece .\n\nSome hotels will tell you a local travel agent . Then you can view prices . For example Lake garda to Venice €45 euros return not including Gondala ride . Train maybe cheaper\n\nThere is different Fb groups on different areas of Italy as well . Lake garda .\n\nIt's reasonable from Uk / Scotland to get Europe . My cousin lives in Florida , comes back here then holidays in Europe that way . x"}, {"username": "Marlene Dahl", "comment_text": "Check Perillo tours!"}, {"username": "Hillary Lindsay", "comment_text": "That’s too much in my opinion"}, {"username": "Michael Simon", "comment_text": "I just spent three weeks in italy with four of us with trips to Tuscany, Rome, Florence, Assisi and then to my house near Naples and it cost us each about $3,000 which included rental cars, VRBOs, many meals and tours.\nPlan it yourself."}, {"username": "Michelle McNeil", "comment_text": "I planned our 12 days in italy for 2 adults. We had business class direct flights from NYC to milan. We stayed 1 night in milan. Took train to naples then to sorrento where we spent 2 nights, 1 day in capri. Then ferry to Atrani for 2 nights. Private transfer back to Naples, flight to Sicily 3 nights there with rental car. Then flight back to Milan and then direct flight back to New York city. Including our 3 days in New York we spent $6000 give or take a hundr3d or two. We bought everything we wanted. Includ9ng having some dishes shipped back to the Usa, ate everything we wanted. When we wanted, rented adopters for 3 days, went paragliding, horseback riding and to Mt. Etna. Including travel insurance and upgraded rental car insurance. Your quote seems really high"}, {"username": "Rosilyn Young", "comment_text": "Mark Harris 😳"}, {"username": "Muggy Pierfelice", "comment_text": "We got a great deal tgrpugh Costco"}, {"username": "Crisandra Giorno", "comment_text": "We paid $5k for 10 days in Italy for the 4 of us, we did a private tour of Vatican, Pompeii, Mt vesuvius, boat Ride around Capri, catacombs with flights, food, stay n car rental total....u can def plan cheaper than that. Look on Groupon air inclusive too, they have amazing deals"}, {"username": "Marina Rico", "comment_text": "Hey Janet, Use booking for the hotels or Airbnb and check your trains with Omio. That amount of money for 2 weeks it’s way too much honestly, specially if you came in October."}, {"username": "Erika Reece", "comment_text": "I'm going in October/\nNovember 9 nights..2 Venice, 3 Florence, 4 Rome. Flights, hotels, train tickets, academy tickets in Florence, Vatican tickets (the tours I purchased directly from the sites) all booked myself 2 adults under 4k."}, {"username": "Anne Noel Allen", "comment_text": "Ours will be 4000.00 a piece including air, hotels, car rental, tours and food and incidentals for 14 nights"}, {"username": "Ilaria Verda", "comment_text": "Really expensive, maybe you booked only 5stars hotels"}, {"username": "Kayla Caras Prescott", "comment_text": "Way over priced. Do it yourself"}, {"username": "Ruth Akutu Maccarthy", "comment_text": "Check eDreams and booking website for hotel cheaper rates.\nFor trains: trenitalia.it or italo.it"}, {"username": "Yolanda Hanavan", "comment_text": "Ouch! That is really expensive. I definitely think you’d be able to do it yourself cheaper. I am also visiting Italy for 14 days, but in December near Christmas. I’ve booked lodging for approximately $1820 for the two weeks. I have not booked any excursions yet, but I’m certain they won’t be more than another $1000 at most."}, {"username": "Laura DeCicco", "comment_text": "That’s ridiculous. We were 4 adults, 14 nights, Venice, Bologna, Florence, cinque Terre and one night in Pisa before flight. We stayed in apartments in all cities and only ever had coffee/\nfruit or yogurt in the mornings before we left for the day. Including flights from Canada to Venice and home from Pisa, all accommodations, meals, trains, paid tours (e-bike Florence, pesto experience Manarola) gelatos, Aperitivo, bus tickets, gondola, and water taxis our total was approximately $16000 for all 4 adults"}, {"username": "Judy Carey", "comment_text": "Pure capitalism - unless you have money to spare and don't care, use them. If not, you can totally do this yourself."}, {"username": "Mark R Palladino", "comment_text": "We planned ours with 13 nights, Naples, to Amalfi, to Tropea, to Sicily (Palermo and Taormina) to Bari then to Campobasso region. Rental car included for all days. $3k\nHotels and ABNB stays including 2 nights in a medieval castle!\nLeaves us a lot of $ for food and fun!"}, {"username": "Mary Strachan", "comment_text": "Sounds expensive. I’d do it yourself."}, {"username": "Jim Hash", "comment_text": "Call Costco travel. They’re amazing."}, {"username": "Kenneth Morgan", "comment_text": "We travel can do Italy for $500.00 a day average. And that includes everything"}, {"username": "Jennifer Wells", "comment_text": "Idk the validity of this - but I too was thinking of taking a trip and was going to look into this add I saw on FB"}, {"username": "Michelle Thorpe", "comment_text": "So not exactly the same. But I’m flying jfk to Rome. I’ll be in Rome 4 nights. Hotel costs $322 usd total. I’ll walk and take public transportation.\nThen on to a 12 night Mediterranean cruise with 11 ports. Costs $2500 with excursions. This will end in Jerusalem where I’ll stay three nights. Hotel costs $500. I’ll walk ti and take public transport. So basically. 21 day trip. For around $3500. I’ll have other costs like food and shopping etc but still."}, {"username": "Janet Walls", "comment_text": "Oh my goodness me. That is an extortionate amount (even before you add in the extra person). Admittedly, the flights from the USA are much more expensive than those from England, but for that amount of money I would expect 2 months travel, not 2 weeks!!"}, {"username": "Ellen Edmonds-Wilson", "comment_text": "It depends where you stay. A trip can be worth the cost even if it seems high if the place you stay is beautiful and the location is great. We love a particular hotel in Zurich because it’s old and interesting and the rooms and staff are amazing and are willing to pay for it. We chose a hotel in Rome which has since doubled in price because it was close to the Colosseum and had a pool, but it wasn’t great and had it not been hot we would have been really disappointed. It was cheap but the hotel was not great. Try doing yourself an itinerary and choose hotels and so the calculations of the cost. It depends how confident you are and how you think you’d handle an issue like a train strike. An agent back home could rebook you, otherwise you’d have to sort it out yourself"}, {"username": "Shena R. Barlas", "comment_text": "Yes"}, {"username": "Mack Sperling", "comment_text": "That price is ridiculous."}, {"username": "Donna Brunet", "comment_text": "Me and 3 friends just booked 12 days including air from LA and airbnb's for appx $3000 each. We are budgeting $1000 for food and transfers."}, {"username": "Carol Brewer", "comment_text": "Go to Gate1travel.com . They have amazing trips at a third this price ."}, {"username": "Roxanne Patti", "comment_text": "Accommodation in the major 3 cities, Sorrento/\nAmalfi Coast, and Lake Como towns are very expensive this close to travel date. I booked a room in Rome back in April for a September /October trip for approx, $250/night and wanted to add a day to my reservation a couple weeks ago. They still had availability, but wanted close to $350 a night for the same room!"}, {"username": "Joe-Linda Po Agustin", "comment_text": "You definitely can plan this yourself for a lower price, just involves lots of hours of research and booking. We're going this October - 3 star hotels for 8 nights Milan and 1 night Genoa, plus 11 day cruise, all public transport, no taxis or private transfer, all DIY tours: Flights from Montreal to Milan- $1800, cruise including gratuities, inside cabin only- $2K; hotels incl. city tax, no breakfast $1,400; trains/ferries $700; food, attractions and misc. $1,800; total is around $8K for a couple. But note that I booked everything way in advance for 14 people in our group. I've checked recently and prices have gone up significantly. Also, the cruise is inclusive of meals, accommodation and transport from port to port so it saves us a considerable amount. We're using Milan merely as base for day trips to Venice, Lake Como, Turin . Ship leaves from Genoa so going to Cinque Terre after the cruise. Even squeezed in one day to do Bernina Express from Milan ( via Tirano) to St. Moritz ( have reservations already, tickets come out only 2 months before)."}, {"username": "Dawn Falsinotti", "comment_text": "Are you kidding? This is insane."}, {"username": "Johnna Sebben", "comment_text": "Do it yourself! We saved a bunch."}, {"username": "Clayton Webb", "comment_text": "You can probably do everything for half of the first quote."}, {"username": "LLisa Mac", "comment_text": "Is that including flights"}, {"username": "Kate Bella", "comment_text": "Wolf Belasco"}, {"username": "Susan B. Corino", "comment_text": "That is very high"}, {"username": "Sasha Melia", "comment_text": "I went to Rome from the UK for a week last August, stayed in a 4* hotel and inc flights it was £1200.00 for two of us 🤷‍♀️"}, {"username": "Cathy Ann Mizzi", "comment_text": "We booked Perillo for 14 days in Italy ..Look them up .."}, {"username": "Danielle Lamp", "comment_text": "There are 7 of us going in October for way less… we booked ours through Firebird Tours. Highly recommend!!!"}, {"username": "Alyce Henry", "comment_text": "Check out Costco travel"}, {"username": "Stephanie Vogel", "comment_text": "Ummmm the stress is worth not spending that kind of money"}, {"username": "Michele Hart Clopp", "comment_text": "We are going for 14 days in October it was $4600 each including all hotels, transfers, tours daily, and breakfast daily and about 10 dinners… flights, not included"}, {"username": "Wendy Bevan", "comment_text": "Rip off, I went 5 weeks stayed in 3 star plus hotels and for 2 no more then $15, book it all yourself, book trains on line, one mistake I did was not book a return train which costed $500 and that was not first like we had going and that was $160 Aud"}, {"username": "Traci Raymer", "comment_text": "We are doing private transfer with in Rome because Taxi drivers in crease the quoted price at the end sometimes. We pay before we get in. It’s 120 euros from the airport to the city one way. About $130"}, {"username": "Zarina Shaik", "comment_text": "Wow! That’s insanely high. Something wrong."}, {"username": "Sandra Shoffner", "comment_text": "I always research my own and book my own. Read reviews on places to stay. Talk with the owners ,ask questions."}, {"username": "Belinda Morris", "comment_text": "If you want private transfers, can book directly with MyDayTrip - they allow you to add stops along the way - have used many times and excellent service!"}, {"username": "Rose Marie Allenstein", "comment_text": "WAY too high."}, {"username": "Roxanne Curzi", "comment_text": "This sounds outrageous"}, {"username": "Melissa Camargo Estrada", "comment_text": "Hey there Janet Canter my name is Melissa, I'm a friendly travel freelancer, and I'd be more than happy to help you plan an amazing Italy adventure within your budget! 🇮🇹 Let's make it stress-free! 🤝 Fill out my Travel Inquiry Form https://bit.ly/\nm/\nthetravelarchite\nct_ and we'll cook up a perfect getaway for you, your hubby, and your son. 🍝🍷Feel free to ask me anything!"}, {"username": "Tracy Foss", "comment_text": "It usually takes me about 6 months to plan everything myself this group has been very informative.I use booking.com for hotels & some transportation,\nViator & get your guide for tours & day trips around each area & train system of country going to for usually a 3-4 week trip it does add up quickly but location is important for me I want business class for transportation & smaller group tours but we are in our 60's & need comfort at the end of the day! So wish I'd done more of this in my youth. I just added up everything & it's certainly in the same ballpark doing it myself but I feel with the research I've done I know approximately what to expect when I get there"}, {"username": "Jim Painter", "comment_text": "Do your own planning...you'\nll enjoy the trip more."}, {"username": "Mari Vee", "comment_text": "Have you checked out the itineraries on Trafalgar, Insight, or Costsaver tours? If you’re a Costco member, you get a discount if you book them through their travel website."}, {"username": "Tracy Piko Lawniczak", "comment_text": "If you want someone to plan a trip maybe seek a travel person. Jessica Walden is a great travel agent. I would check with different people so you can have an idea and see price differences."}, {"username": "Jerry Lyubelsky", "comment_text": "Seems high is that with air? Contact Kim Gham\n402-255-7873\nkim@allways-tra\nvel.com\n\nShe’s helped us with both our Italy trips"}, {"username": "Tricia Brittingham Neff", "comment_text": "Yes!!! Our family of 5 is doing 2 weeks in Italy folliwed by a 7nt. Med cruise. Before food/\nspending money we are currently at $13,000 including accommodations, car rental, train tickets, cruise, excursions!! (And I’m a hotel/Airbnb snob!)"}, {"username": "Mary Brown", "comment_text": "Yes!!!!\nWe just went in July. 2 adults and a 12 year old for 15 nights.\nStayed in a mix of Aribns and hotels. Nice 4* hotels in prime spots.\nWe went to Rome, Naples, Florence, Venice and Milan. Used trains and taxis no private transfers\n\nI planned everything myself and used mostly Getyourguide for activities. You can do it with the help from this group!\n\nWe spend in USD:\n$5000 hotels ($260-360 a night)\n$3800 flights\n$530 high speed trains (business class)\n$1700 activities"}, {"username": "Julie Agarkov Mayblyum", "comment_text": "Seems very high! If you want 5 star eveything, maybe, but there are definitely a lot more budget friendly ways to visit Italy."}, {"username": "Anthony De", "comment_text": "Do some research and do it yourself, you'll save thousands of dollars that way..."}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "Try tripmasters for planning on your own. User friendly, decent prices and gives multiple options to tailor the lodging to your style/budget."}, {"username": "Janice Rea", "comment_text": "Yes you can. Start with your flights and then hotels. Then do the rest. Also Costco has great trips all included. I have used them a few times. Great prices and options. Good luck."}, {"username": "Shelly Kentner Lehman", "comment_text": "Yes definitely I spent $5500 for myself for 21 days and brought back $1000 dollars at least of souvenirs booked everything myself. Went to many places Rome, Sicily, Florence, Sorrento, Bus tour to Pisa, San Gimignano, Siena, and Chanti"}, {"username": "Charleen Siegler Schuss", "comment_text": "You can do a better. Was airfare included? Private transfers from where to where?"}, {"username": "Tanya Bitar", "comment_text": "That seems very high. During the summer it’s more expensive. Was it a tour guide from Italy?"}, {"username": "Jason Hobel", "comment_text": "My 12 day trip which included everything from airfare, trains, hotels, food, self entry to the big sites, cancel for any reason insurance, and miscellaneous spending came to $3700.00. I planned the entire trip myself. It was a lot of research but it was fun too and I saved a lot of money doing it myself."}, {"username": "Janet Messanelli Bozzone", "comment_text": "Including flights?"}, {"username": "Lori Sammons", "comment_text": "Try www.Greatvaluev\nacations.com or www.tripmasters\n.com\nWe used them twice in Ireland, 4x in Italy and one time in Spain. It’s all inclusive, flights, hotels and car"}, {"username": "Claire Henderer Haughney", "comment_text": "Yes"}, {"username": "Marie Cuzzi", "comment_text": "That sounds like Way to high!!! Call your local travel agency’s and compare price"}, {"username": "Elena Boetel Sutton", "comment_text": "Yes. Most definitely. I planned for 5 of us for about 4000 each and that included meals and souvenirs. You just have to be frugal in some places. DM if need help."}, {"username": "Mbell Arteaga", "comment_text": "Try to see how much it would cost through Costco travel if you’re a Costco member. They can tailor your trip with different hotels and dates to save money. My husband and I are going next month for 9 days (11 including travel) to Rome, Venice, and Florence and it was ~6K for the two of us including airfare, hotels, private transfer from/to airport in Italy and trains between the cities."}, {"username": "Whitney Allbaugh", "comment_text": "Would probably be cheaper to do it yourself, but if you haven't book anything, and are planning to go in October its not going to be cheap since its considered \"last minute\" in a sense."}, {"username": "Michelle Thorpe", "comment_text": "You’ll be cheaper by half planning it yourself I bet"}, {"username": "Annette Mayer", "comment_text": "Oh yeaaa"}, {"username": "Kerry Montplaisir", "comment_text": "Definitely plan yourself. Google flights. Then look at airbnb then plan excursions. Ask airbnb for private transfers"}, {"username": "Kate Mattis", "comment_text": "Yes planning a 9 week trip (Sept to Nov) to Italy for that amount and staying in really nice apartments in city centers. That includes all trains, tours and flights (business class) I started planning at beginning of year."}, {"username": "Tammy Biasi", "comment_text": "Use Globus\nOurs was for 10 days three adults and was $2500 a person\nIncluded air fair, hotel breakfast and three dinners. It’s a tour but so worth it"}, {"username": "Christine Caudill", "comment_text": "Yes- it is super crazy with demand to go to Italy. I have planned our trip myself and it is no different- actually a little more stressful since many of the hotels we wanted to stay in have been booked for months."}, {"username": "Suzanne Munro", "comment_text": "Yessss!"}, {"username": "Carrie Jaquess", "comment_text": "We spent a total of $10,000-11,000 for our 5-week trip for two of us last Fall. So I’d definitely say $12,000 is too much. Do some research and plan a DIY trip to save big bucks."}, {"username": "Blanca Gil", "comment_text": "That’s crazy. You can plan it on your own for a lower price including nice hotels and well planned tours."}, {"username": "Rhonda Daniels", "comment_text": "Wow! That's about what we are paying for 14 days with a rental car...and we are flying first class. We planned our iwn trip."}, {"username": "Joseph DellaFave", "comment_text": "Do it yourself you’ll save a lot."}, {"username": "Joan Adams Schilling", "comment_text": "We are staying in an apartment in city center…12 days for $1300. Airfare was $3000 for two from the midwest. Transfers arranged by the apartment was $100 R/T. Tours added another $1000. You can do it yourself for cheaper"}, {"username": "Joseph DellaFave", "comment_text": "Why would it go up to 15,000 to add one person when it’s only 6000 each for you and your husband.? ￼I would ask them that."}, {"username": "Kristina Ruk", "comment_text": "Of course you can plan much cheaper ;)"}]}, {"id": "2195375500861528", "text": "Best way to get tickets for a football game, I can get them through the concierge service with my Visa card but the cost is almost triple what I see them sell through the 3rd party sites (I’m a bit nervous purchasing through these sites).I can’t purchase through Ticketone because they don’t accept a North Amerircan phone number. I‘m looking at tha SSC Napoli game October 8 in Naples. I’m thinking of taking my chances and try when I get to Italy in September.\n\n*EDIT* how far in advance do tickets on the team official website go on sale?", "link": "facebook.com/groups/1373361046396315/permalink/2195375500861528/", "likes": 2, "comments": [{"username": "Maria Brozou", "comment_text": "have you tried putting the phone of the hotel you are staying in? Just an idea"}, {"username": "Kylie Marie", "comment_text": "Try PayPal"}, {"username": "Mike Ball", "comment_text": "Buy tickets directly from the club website , I’ve done that myself and it was very straightforward\n. Keep checking the website ,\n\nThey are playing Fiorentina so I doubt you will have trouble acquiring tickets."}, {"username": "Lauren-Jade Roberts", "comment_text": "Club website but Napoli have just won the league. About 20,000 people went to watch their first training session. I can imagine it will be very hard work getting a ticket as all the Napoli fans will buy them"}, {"username": "Alessandro Iannelli", "comment_text": "Don't worry about being redirected to TicketOne, that's simply the website Napoli uses to sell their tickets. So it's the right website, it's not one of those shady third party websites. If anything, avoid other websites other than that one. Tickets for Napoli Fiorentina will probably be available not before September. Notice that the date of the game might be changed, it's possible that it's moved to the day before or the day after, it's something done routinely with every team to accommodate the needs of the television that airs the matches, so if you want to watch it you need to take this into account and plan accordingly with some flexibility."}, {"username": "Petr Mladý", "comment_text": "Hello, I have the same problem. How did you solved it? Looking to buy tickets for this Friday game but I can’t through TicketOne, it won’t let me."}]}, {"id": "2195822204150191", "text": "What is the history of this statute please", "link": "facebook.com/groups/1373361046396315/permalink/2195822204150191/", "likes": 26, "comments": [{"username": "Cecilia Christine Costantini", "comment_text": "The six-meter-long sculpture depicts a group of migrants and refugees on a boat wearing clothes that show they originate from diverse cultures and historical moments. For example, there are a Jew fleeing Nazi Germany, a Syrian departing the Syrian civil war, and a Pole escaping the communist regime.[7] The sculptor of the work said that he \"wanted to show the different moods and emotions involved in a migrant's journey\". - check Angels Unaweres on wikipedia for more info, it doesn't let me post a link"}, {"username": "Barbara Wimboeck", "comment_text": "Unveiled in 2019 the \"Angels Unawares,\" a depiction of migrants throughout history crammed together on a boat with the holy family."}, {"username": "Lena Lai", "comment_text": "Where is this at?"}, {"username": "Fanie De Waal", "comment_text": "Thanks"}, {"username": "Ettore de Vita", "comment_text": "https://\nwww.bbc.com/\nnews/\nworld-europe-498\n86953"}, {"username": "Marilyn Green Marcus", "comment_text": "Count on this compassionate Pope to support this moving work of art."}, {"username": "Debbie Watts", "comment_text": "Elaine Miller"}, {"username": "Deacon Tom Lang", "comment_text": "Tim Schmalz is the sculptor. He gave a presentation to a group I belong to not long before this was installed. Check out TimothyPaulSchm\nalzdotcom."}, {"username": "Deacon Tom Lang", "comment_text": "Tim Schmalz - Thought you’d be interested in this post! Hope all is well."}]}, {"id": "2195825274149884", "text": "Looking for hotel recommendations for Ischia. Can anyone recommend a Facebook book group specifically for people traveling to Ischia?", "link": "facebook.com/groups/1373361046396315/permalink/2195825274149884/", "likes": 0, "comments": []}, {"id": "2195837144148697", "text": "Any suggestions for kids (2,5,8) friendly tours in Rome? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2195837144148697/", "likes": 1, "comments": []}, {"id": "2195838100815268", "text": "We want to take the train to Cinque Terre and we will be traveling with my husband who uses a wheelchair. I have read conflicting reports about the feasibility of this. We know we won’t be able to do or see as much as those with no mobility issues but we are hoping to at least walk around a bit in the towns and have a snack or drink, see a few shops and just get to enjoy the vibe of the area. Possible?", "link": "facebook.com/groups/1373361046396315/permalink/2195838100815268/", "likes": 2, "comments": [{"username": "Kerry Laux", "comment_text": "The train trip along the coast is a nice trip. The stations from memory are at the top of the villages which are in a hill so getting down to the town on the path might be steep and difficult particle in busy times. Some are steeper than others. Porto Venere is a beautiful village at the end of the cirque Terre often over looked but I think the bus station and train station were flat and the village was easier to wander. Best of luck. Other villages along there worth wandering without the steep slopes are Rapallo, Santa Marguerita and Levanto."}, {"username": "Sara Butcher", "comment_text": "Agree with Kerry Laux with enjoying the coast from the train. Get a seat on the right side of the train as you will be closer to the water and a better view. Portovenere is flat and lovely. I spent a few hours there wandering around and had a fantastic lunch. ❤️🇮🇹🇦🇺"}, {"username": "Veronica Parravicini", "comment_text": "Hi!\nYou can definitely go to Monterosso, which is the main “terra” (“cinque terre” means five lands/towns).\nIt’s bigger than the other Terre and not so steep as it’s at sea level and she even as a large beach.\nThen you can visit the other Terre by train or better by boat"}, {"username": "Sarah Price", "comment_text": "We didn’t do it but you can get a ferry from La Spezia that takes you round. Hop on and hop off. This would be an amazing view if you struggle with steps etc"}]}, {"id": "2195849684147443", "text": "Day trip itinerary for lake como?? Must sees? It’s our last weekend for traveling and want to make the most of it!", "link": "facebook.com/groups/1373361046396315/permalink/2195849684147443/", "likes": 0, "comments": []}, {"id": "2195850190814059", "text": "Hello! I have a question for the Vatican, do you know where else you can buy the tickets? On the official website they are sold out..... I was looking at the GetYourGuide app, do you recommend it?", "link": "facebook.com/groups/1373361046396315/permalink/2195850190814059/", "likes": 0, "comments": [{"username": "Sara Beth", "comment_text": "When are you going? We just did the breakfast tour two days ago and it was great we were the first ones there. A couple hours later it was a mad house-too busy to see anything and enjoy-you have to move with the crowds-shoulder\nto shoulder, whatever you do choose an early tour!"}, {"username": "Sarah Price", "comment_text": "Ive been told by a couple of Italians here in Rome that the Vatican is free?! We have t been yet but now I’m worried about tickets."}, {"username": "Karen Louise", "comment_text": "We went Tuesday free to get in the basilica and then 8 euros to climb the dome didn’t do Sistine chapel because of the heat but was easy enough without a guide"}, {"username": "Jeff McLellan", "comment_text": "Look to see if there are Prime tour or VIP Prime tour spots available on the days you want that is what we did."}, {"username": "Marike Harmse", "comment_text": "Ask at the hotel where you stay"}]}, {"id": "2195853744147037", "text": "Looking for recommendations on where I can buy good facial creams and serums in Florence.", "link": "facebook.com/groups/1373361046396315/permalink/2195853744147037/", "likes": 0, "comments": []}, {"id": "2195864190812659", "text": "Question about passport copies please: we will be leaving our passports in the safe and I have emailed my sister copies should we need them replaced. Do I really need a hard copy of them? I hv an anti-theft bag, but I’d prefer not to hv anything else in my bag that I need to keep up with. Thanks everyone! Heading out tonight!💕", "link": "facebook.com/groups/1373361046396315/permalink/2195864190812659/", "likes": 2, "comments": [{"username": "Jessica Gillson", "comment_text": "I didn't but I did have a photocopy on me and on my phone a photo of it. Never needed it for my holiday."}, {"username": "Kristina Ruk", "comment_text": "You have copies for emergency at email and thats ok. If you have experience with loosing it so maybe to carry copy with you its ok.I carry my passport with me (kids passports)all the time and just watching my bag(or put in front).Anyway if you will need to show document so noone will accept a copy of document, they would ask for original.."}, {"username": "Mary Anne", "comment_text": "We were asked to show ours when we purchased goods eligible for VAT. They were happy with the photocopy I had in my wallet, as we kept ours in\nour locked suitcases in our room. Police at railway stations like to see the originals, but we were never asked. (We had passports with us as we were travelling to our next destination each trip.). We hired headsets at Pompeii and they wanted our passports but were happy to take my driver’s licence as a surety. Our hotel in Rome told us we didn’t need to take them everywhere."}, {"username": "Julie Gayde Benden", "comment_text": "Julie Gayde Benden"}, {"username": "Tania Bergman", "comment_text": "If anyone has a health emergency you need you passport. Seems an exception but I have just got back today. So hot people dropping with heat exhaustion"}, {"username": "Carmine Castiglia Jr", "comment_text": "I realize that few seem to care about the actual law, but, \"According to the law DLGS N.286 of July 25th, 1998, it is mandatory that you always carry an international identification document (your passport) whenever you are in Italy, BUT, it doesn’t have to be the original document, it can be a copy.\"\n\nhttps://\nwww.yourtravelto\nitaly.com/\nshould-i-carry-m\ny-passport-in-i\ntaly/"}, {"username": "Gina Rovello Keenan", "comment_text": "I always carry a copy of the passports and credit cards."}, {"username": "Colleen Dawson", "comment_text": "With all the controversies surrounding passports, as an added protection I would also suggest registering with STEP. Google has all the answers if you don’t know what it is."}, {"username": "Lisa Valdovinos", "comment_text": "Had to show it when going to The Vatican and Colosseum."}, {"username": "Janice Finn Clemans", "comment_text": "I kept paper copies in my travelon bag. They fold up small and were accepted everywhere."}, {"username": "Angela Reibel", "comment_text": "We were asked to show ours by officers. We asked the question out of curiosity if copies were acceptable. Answer was no. Actual passport required."}, {"username": "Phyllis Snyder", "comment_text": "Make a high quality color copy to carry with you around town- also carry a copy of your hotel receipt because they by late need to copy your PP. However, if you take a train out to another station carry you actually PP- higher likelihood that’s where they are checking."}, {"username": "Laura Taylor Gregar", "comment_text": "So just photo copy your passport?"}, {"username": "Joy Little Gordon", "comment_text": "Thanks everyone!!"}, {"username": "Amanda Molinelli DuAime", "comment_text": "Every place I have checked in needed the passport also needed it for vat refund purchases"}, {"username": "Ellen Edmonds-Wilson", "comment_text": "If you’re going to hire audio guides at museums etc you should have your drivers license with you to leave in exchange. I wouldn’t leave a passport with them. We had a paper version and an electronic one should we be asked for our passport. In a month we were never asked for it, but when photo I’d was required the licence was fine."}, {"username": "Jennifer Nguyen", "comment_text": "I usually carry a color copy of the passport and leave it in the safe in the hotel. I also take a snapshot of the passport in my phone as a backup.\nOne time I wanted to get a small scarf at the Channel store, they refused to take the copy of the passport. They told me to get the real passport in order to get the VAT tax back. They said it is the company’s policy. Same thing for most of the designer store."}, {"username": "Jill Medrano Casey", "comment_text": "I had both a hard copy as well as having a photo on my phone and it was also saved in my Google Account."}]}, {"id": "2195874307478314", "text": "Has anyone ever done a Vespa Chianti Winery tour from Florence?\n\nOr any suggestion on another Winery tour that they have taken.\n\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2195874307478314/", "likes": 0, "comments": [{"username": "Deana Miller", "comment_text": "We did the Chianti wine tour through viator and you can add dinner on to it. It stops at a lovely little restaurant in the Tuscan hills"}]}, {"id": "2195879224144489", "text": "With an upcoming trip planned and the recent heat wave wondering if we should bring our reusable water bottles. From staying with family and hotels many years ago I know ice machines were few and far between…is that still the case? It’s been 16 years since I have been.", "link": "facebook.com/groups/1373361046396315/permalink/2195879224144489/", "likes": 1, "comments": [{"username": "Cecilia Christine Costantini", "comment_text": "Yes, do bring them! Ice machines are not common, but for example in Rome there are water fountains everywhere and the water is quite cold, as the taps are kept running."}, {"username": "Rhona OConnor", "comment_text": "We don't use ice as much as you do in the USA but if you bring a water bottle with a wide neck people will give you ice for your water."}, {"username": "Gena Diaco Penland", "comment_text": "We brought ours and filled them half way at night and put them in the freezer! Then we had ice in them for when we went out!"}, {"username": "Susan Rathke", "comment_text": "Definitely bring your water bottles and refill them multiple times a day! Italian cities have drinking fountains."}]}, {"id": "2195885287477216", "text": "Hi all,\nWe're planning to spend 3 days in Italy end of August and we were wondering what itinerary you'd recommend, we'll be based in Milan.\n\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2195885287477216/", "likes": 0, "comments": []}, {"id": "2195886444143767", "text": "Naples - anyone used and recommend a boat hire company we can use to hire boat on our own to take to Capri and Ischia exploring for a day? TIA", "link": "facebook.com/groups/1373361046396315/permalink/2195886444143767/", "likes": 0, "comments": []}, {"id": "2195889624143449", "text": "Hi! I would appreciate any advice. We have booked a 3 hour morning tour of the Vatican gardens, museums, and Sistine Chapel. I really want to do St. Peter’s and climb the dome. Can we just walk up and do this after our tour, or do we need to find tickets to purchase for this as well? Thank you in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2195889624143449/", "likes": 0, "comments": [{"username": "Jenny Godfrey", "comment_text": "You buy those tickets there and then go straight up it. As you climb the steps up to Vatican entrance you pass the toilets and lockers door go up steps and on the right sort of hidden is the way, looks like heading for gardens there’s a little gift shop then walk passed then your find the ticket booth. Take a bottle of water. If you go into the main Vatican church you went to far and missed the turning, it’s hard to notice as people usually taking photos of the doors. But the views are amazing from the top."}, {"username": "David Fidgeon", "comment_text": "Ask the people you booked your tour with !"}, {"username": "Shen Min Chue", "comment_text": "You do not need any tickets for general entry to St. Peter's since it is a church and admission is free. The Dome needs a ticket though and you can only buy Dome tickets after entering the basilica. Your booking will take you to the Gardens first then the Museums. If the shortcut passage from Sistine Chapel to St. Peter's is opened for you, you can enter the basilica directly from the Sistine by taking this shortcut"}]}, {"id": "2195888107476934", "text": "When traveling by train between cities (Venice ↔️ Florence) is it better to buy tickets in advance or at the station?", "link": "facebook.com/groups/1373361046396315/permalink/2195888107476934/", "likes": 0, "comments": [{"username": "Karon Patterson", "comment_text": "In advance"}, {"username": "Frank Hunt", "comment_text": "Always, Trainline app."}, {"username": "Dave Colleen", "comment_text": "If you know what you’re buying, buy in advance. I was confused by the options so we bought at the station a couple days before departure with the help of the train guest service"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2195889880810090", "text": "Canadians in Italy... can you tell me if your Scotiabank or TD debit cards worked in cash machines? I've asked my bank but received an ambiguous response to my question.", "link": "facebook.com/groups/1373361046396315/permalink/2195889880810090/", "likes": 0, "comments": [{"username": "Lizzi Denisse", "comment_text": "."}, {"username": "Amy Dreise", "comment_text": "They should work fine. I’ve used my TD bank card to withdraw money from an ATM."}, {"username": "Lorie Robb Gordon", "comment_text": "Make sure your PIN number is only 4 digits"}]}, {"id": "2195893244143087", "text": "Advice please. Best way to get from Sorrento Train Station to Amalfi coast by boat. Thank you 🙏", "link": "facebook.com/groups/1373361046396315/permalink/2195893244143087/", "likes": 0, "comments": [{"username": "Karon Patterson", "comment_text": "You need to get a bus down to the ferries and then get a ferry anywhere you like."}, {"username": "Wahab Sidharta", "comment_text": "Ferry from Marina Piccolo, Sorrento"}, {"username": "Grace Monaghan", "comment_text": "Bus or ferry"}]}, {"id": "2195906737475071", "text": "Can anyone recommend a tour that is good for teens?", "link": "facebook.com/groups/1373361046396315/permalink/2195906737475071/", "likes": 0, "comments": []}, {"id": "2195908974141514", "text": "We only have one day to go to Cinque Terre. Is it possible to do in one day, and if not, what parts of it would you definitely visit?", "link": "facebook.com/groups/1373361046396315/permalink/2195908974141514/", "likes": 2, "comments": [{"username": "Karon Patterson", "comment_text": "Vernazza is the best"}, {"username": "Sara Butcher", "comment_text": "I’d catch the ferry that starts at Monterosso and goes to Portovenere. It stops at each town and you can get off, look around and catch the next ferry. Decide one or two towns to get off and explore. Seeing them from the water is stunning! ❤️🇮🇹🇦🇺"}, {"username": "Carmel Mignone", "comment_text": "F"}, {"username": "Virgz Van Møøre", "comment_text": "No"}, {"username": "Kay Rendall", "comment_text": "Depends where u r travelling from, returning to Milan, Geneva.\nTrain from Genoa to any town by train is easy, also how u r with stairs, steep slopes, what u r seeking, beach, views, the area. Each town is different. 1 day is limited time Enjoy"}, {"username": "Kay Rendall", "comment_text": "That should Genoa"}, {"username": "Jan Flaherty", "comment_text": "F"}, {"username": "Christine Aird Craig", "comment_text": "Yes, it’s rushed but you can. Take the train from la spezia, go to the last village then you can either walk or take the train to the second last and soon. We took the train but walked between the last two villages. Enjoy!"}, {"username": "Sandra Timi", "comment_text": "Big day, train or ferry, start early in town one with breakfast and finish late with dinner at your last town and stop at each town, quick look and/or swim and move on. Enjoy"}]}, {"id": "2195920990806979", "text": "What location on the Amalfi coast would you recommend for 3 day stay?", "link": "facebook.com/groups/1373361046396315/permalink/2195920990806979/", "likes": 120, "comments": [{"username": "Michele Boubede Granito", "comment_text": "Ravello or Amalfi Town and from there go to other towns"}, {"username": "Rita M. Basulto", "comment_text": "Ravello!"}, {"username": "Shellie Anne", "comment_text": "Maiori is the best."}, {"username": "Karlie Durrant", "comment_text": "Minori without a doubt."}, {"username": "Enrico Lecce", "comment_text": "Amalfi"}, {"username": "Sara Kyle Hargett", "comment_text": "Sorrento"}, {"username": "Jaky Huerta", "comment_text": "Positano y de ahí un ferry a capri ⛴️🏝️"}, {"username": "Betty Jo Herbert", "comment_text": "Amalfi"}, {"username": "Anneliese Dietrick", "comment_text": "Positano or capri"}, {"username": "Geraldo Prioriello", "comment_text": "Sorrento"}, {"username": "Fabian VO", "comment_text": "Praiano but if you find a good deal positano"}, {"username": "Tommasina Mele", "comment_text": "Salerno"}, {"username": "Heather Atkinson", "comment_text": "I enjoyed staying in Amalfi."}, {"username": "Domenica Di Lieto", "comment_text": "Maori\nAccess to everything, few tourists, great beach and great restaurants."}, {"username": "Jenny Diel", "comment_text": "."}, {"username": "Diana Skidmore", "comment_text": "Sorrento"}, {"username": "Karen Costa", "comment_text": "Ravello"}, {"username": "Susan Hennessy", "comment_text": "Maori fabulous little port with infinite boats to Positano Amalfi and Capri.\n\nHotel Pietra di Luna\nPrivate beach, pool\n\nFabulous 😎"}, {"username": "Nina Đurić Prodanović", "comment_text": "Sorrento, definitely 👍🏻"}, {"username": "Heyla Louw", "comment_text": "Capri/ Sorrento"}, {"username": "Pam Hughes", "comment_text": "Priano and then visit the rest of the coast from there."}, {"username": "Nadia Greco", "comment_text": "Maiore"}, {"username": "Grace Veniero", "comment_text": "We stayed in Maiori and it was wonderful. It is very walkable and you ￼can get the ferry to the other towns."}, {"username": "Lulules Roberts", "comment_text": "Prianio"}, {"username": "Kathie Iannucci", "comment_text": "Capri … just magnificent"}, {"username": "Inna Rozen", "comment_text": "Maiori"}, {"username": "Stephanie McKnight", "comment_text": "Praiano"}, {"username": "Sarah Skinner", "comment_text": "Am Airbnb yacht on the Amalfi coast"}, {"username": "Debra McCarthy Aberdale", "comment_text": "Sorrento"}, {"username": "Tamara Smith", "comment_text": "Capri"}, {"username": "Rima Sengupta", "comment_text": "I stayed in the beautiful ceramic town of vietri loved it"}, {"username": "Maria Meloni", "comment_text": "Sorrento ❤️"}, {"username": "Marie Di Paolo", "comment_text": "Villa Maria pia in priano"}, {"username": "Tracey Pribisco Omslaer", "comment_text": "Positano !"}, {"username": "Donna Russonello Merlino", "comment_text": "Sorrento"}, {"username": "Sandra Miller", "comment_text": "Conca dei Marini, it's a beautiful village with some great restaurants and it's within easy reach of Amalfi and Positano. No swarms of tourists."}, {"username": "Madeleine Becky Morton", "comment_text": "Positano - so pretty you will feel like you’re in a dream."}, {"username": "Peter Weatherly", "comment_text": "Lucia's house in Prainiano,"}, {"username": "Terri Wilson Moore", "comment_text": "Tracy Goetz Fisher"}, {"username": "JoAnn Jocelyn", "comment_text": "Sorrento! Easy access to entire coast. Up & down!!"}, {"username": "Inbal Franko Veig", "comment_text": "Sorrento"}, {"username": "Jennifer McGinnis", "comment_text": "Sorrento"}, {"username": "Sshona Ssmillie", "comment_text": "Minori or Maiori\n\nBoth very affordable and just quieter yet easy to do day trips from. Honestly I feel Positano is just over rated but love Ravello. The woman out of modern family has just been to Capri and Ravello so expect next year to be worse than ever"}, {"username": "Phyllis Snyder", "comment_text": "I’m going to stay in Sorrento- for the easy accessible to other towns."}, {"username": "Edna Cucksey Stephens", "comment_text": "Posatanio"}, {"username": "Rosario Dychitan", "comment_text": "Ravello"}, {"username": "Maryann McNey", "comment_text": "Ravello ❤️"}, {"username": "Julie Fabrico", "comment_text": "Positano"}, {"username": "Liz Minks", "comment_text": "Nerano. Off the beaten path. More affordable. So hospitable."}, {"username": "Sarah Hernandez", "comment_text": "Praiano!"}, {"username": "Teri Haskins", "comment_text": "Amalfi !!!"}, {"username": "Gary S Miller", "comment_text": "Agriturismo Sant Alfonso in Furore. You will need a car"}, {"username": "Cynthia McDonald", "comment_text": "Sorrento with day trips to Capri and positano"}, {"username": "Desi Dez Rivera", "comment_text": "Alessandra Arlotta Tortora Alessandra Arlotta Tortora has a Hotel right before Almafi Coast breath taking. Highly recommend."}, {"username": "Jo Newton", "comment_text": "Sorrento"}, {"username": "HJ-Diane Soriano", "comment_text": "Positano for sure"}, {"username": "Roseann F Campanile", "comment_text": "Praiano!"}, {"username": "Cari Wilson", "comment_text": "F"}, {"username": "Terri Keener", "comment_text": "F"}, {"username": "Annette Katchan", "comment_text": "We stayed in an Airbnb outside of Sorrento and toured the Amalfi coast stopped at the fjord amazing lunch and swim, Amalfi shopping was fantastic men’s shoes the best deals. Then off to the Grotto fabulous tour and then Ravello stayed at Hotel Graal overnight toured the villas breathtaking. We had a scooter and it was the best way to travel the coast. I would not like to do this on the bus. So a private car service would be better. Enjoy. And definitely try the limoncello spritz."}, {"username": "Tommasina Mele", "comment_text": "Salerno"}, {"username": "Yolanda Arena", "comment_text": "Sorrento"}, {"username": "Emily E. Hanson", "comment_text": "Evan Jackson still seeing mostly sorrento… but also Amalfi too for home base"}, {"username": "Zahrabatool Ali", "comment_text": "Ravello"}, {"username": "Karie Kellam", "comment_text": "I’d pick Positano. I think it’s nice to be there in the evening after the day trippers leave. I would pick the place that appeals to you most and has most activities you want to do."}, {"username": "Carole Tarlap", "comment_text": "Sorrento is not on the Amalfi Coast 🤷🤷"}, {"username": "Anders Carlsson", "comment_text": "Capri"}, {"username": "Dan Carr", "comment_text": "Vietre Sul Mare…great ceramics and limoncello!!!!"}, {"username": "Anna Buchan", "comment_text": "Sorrento"}, {"username": "Nancy Vahl Raske", "comment_text": "Anywhere but not in August"}, {"username": "Chantel Gill", "comment_text": "Atrani …. just stayed there a month ago and loved it , quiet & an easy walk to Amalfi for buses and ferries .."}, {"username": "Daniela Mignone-Murphy", "comment_text": "Michael Murphy"}, {"username": "Monica Villafranco", "comment_text": "We stayed in a villa in Praiano last year. We loved it! Central to the other towns along the coast."}, {"username": "Melanie Grant", "comment_text": "Honestly I was just there ….. save yourself some serious $$$ and stay out of the Amalfi and stay somewhere like Vicco Equensce…. Arguably, I believe it is more beautiful than Amalfi and some of the more popular towns, with stunning views of Mt Vesuvius and a number of the hotels run a free bus to and from the train station multiple times a day …. The bus has a stop a Seiano Beach where you can get a ferry to the tourist spots of Amalfi, Positano etc …. The towns of Amalfi are of course lovely but very busy, you have to pay for beach access and waaaaay more expensive in general….\nI stayed at Hotel Torre Barberra ( amazing views and food with very helpful staff and air con ! )"}, {"username": "Rosa Martins", "comment_text": "Salerno"}, {"username": "Julianne Waatti Kulman", "comment_text": "the town of AMALFI, lovey views, walkable, easy ferry to other places Capri, Positano. Also bus up to Ravello ❤️\nWe stayed at Hotel Luna Convento- great staff, food/\nrestaurant, they have AC and a cliff pool!!! Had parking for our car and we could walk to town easily 🇮🇹"}, {"username": "Deborah A. Nargi", "comment_text": "Ravello"}, {"username": "Jason Hobel", "comment_text": "Sorrento Sorrento Sorrento....did\nI mention Sorrento? Yes, yes did...Sorrento"}, {"username": "Jane Husen", "comment_text": "Ravello ❤️"}, {"username": "Joyce Calderon", "comment_text": "Planning a trip to Sorrento in late October but saw things start to shut down in mid October. Has anyone. Been there in late October? Are ferries still running, are there shopping and restaurants open?"}, {"username": "Susan Hulsey Watkins", "comment_text": "Praiano"}, {"username": "Kim Cicarelli", "comment_text": "POSITANO 100%"}, {"username": "Debi McGrath", "comment_text": "I think it depends what you want to do, for me I want to hike the path of the Gods and be away from the crowds so we are staying in Bomerano."}, {"username": "Oneida Ann Murphy", "comment_text": "Ravello!"}, {"username": "Emma Rocco", "comment_text": "Praiano is the best!!! We’ve been four years in a row. A great small town to be close to Positano yet have a more quiet and local experience!"}, {"username": "Marcela Boggio", "comment_text": "À"}, {"username": "Brooke Miller Busato", "comment_text": "Priano"}, {"username": "Debra Kingston", "comment_text": "Positano!"}, {"username": "Janice Maclean", "comment_text": "Personally love Sorrento. Great buzz about it. Amazing restaurants and shops. Amalfi lovely too. My son got married there but it’s quieter and smaller. X"}, {"username": "Heidi Donato", "comment_text": "Sorrento"}, {"username": "Tan LB", "comment_text": "positano"}, {"username": "Renae Larcus", "comment_text": "Sorrento is great and then travel to other towns from there."}, {"username": "Linda Love Vines", "comment_text": "Positano without question! It’s most beautiful if you stay there and it’s very easy to get to other Amalfi towns from Positano. Sorrento is not on the a Amalfi Coast and isn’t that close."}, {"username": "Susan B. Corino", "comment_text": "Sorrento"}, {"username": "Kate Michelle Eringa", "comment_text": "Minori 1000% not crowded, so much more affordable, gorgeous little town where you can so easily do day trips to positano/\nAmalfi etc"}, {"username": "Lisa DiSalvo Timmoneri", "comment_text": "Sorrento! It was our favorite!"}, {"username": "Karen Kinney Codella", "comment_text": "Sorrento"}, {"username": "JoAnn Bobier", "comment_text": "Praiano it is right in the middle lovely town"}, {"username": "Lenka Hladikova", "comment_text": "Maiori"}, {"username": "Nana Kutateladze", "comment_text": "Positano"}, {"username": "Mirna Al-Qassim", "comment_text": "Sorrento"}, {"username": "Helena S. Stone", "comment_text": "Ravello"}, {"username": "Gommy Shirley Pribisco Brady", "comment_text": "Ravello. Quaint, calm, gorgeous!"}, {"username": "Luigia Gray", "comment_text": "Sorrento & Positano"}, {"username": "Pamela VanderHeagan", "comment_text": "We loved Positano:)) so much to see and explore:))"}, {"username": "Julia Clara", "comment_text": "Sorrento and take day trips from there\nIt’s by far the easiest and has the most happening at night"}, {"username": "Lois Richardson", "comment_text": "Sorrento"}, {"username": "Michael Gallo", "comment_text": "Deanna Pitta Gallo"}, {"username": "Catherine Kelsall", "comment_text": "Cetara - it was about 40 mins on ferry to amalfi but beautiful\nHotel Cetus highly recommended"}, {"username": "Joanne Mirabile DiFrancesco", "comment_text": "Positano or Sorrento"}, {"username": "Rose Stolarek", "comment_text": "Praiano"}, {"username": "Anita Gundersen", "comment_text": "Minori. Quiet and not crowded 🙂"}, {"username": "Deanna Tipton Clemens", "comment_text": "We loved Hotel Miramalfi in amalfi. Highly recommend if you like to swim in the sea"}, {"username": "Denise Luksa Smith", "comment_text": "Hotels in Positano other than the top two that I always hear about?"}, {"username": "Mary Ann Doherty", "comment_text": "Positano was crowded to the point of suffocation. Ravello was gorgeous and barely crowded. We saw lines for busses that travel between towns that were hours long with full busses passing by stops. People waiting for hours in 100 degree heat. Would not count on busses at all. Sorrento is gorgeous and less crowded than Positano. Great location too.\nThat said, it was all lovely and wouldn’t trade a minute of our time there."}, {"username": "Kelly Kay Bartz", "comment_text": "Sorrento, use it as a hub for day trips."}, {"username": "Juliet Schindler", "comment_text": "Amalfi"}, {"username": "Katie Hardman", "comment_text": "Sorrento is a great base"}, {"username": "Sam Mouchamel", "comment_text": "Ravillo"}, {"username": "Alessia KyuLay", "comment_text": "Capri is an island, Sorrento is the Sorrento peninsula (Naples). Amalfi Coast (Salerno) are Positano, Amalfi, Furore, Tramonti, Praiano, Ravello etc. Don't confuse places 😅"}]}, {"id": "2195929207472824", "text": "Moon bridge Venice Italy 💞 🇮🇹🇮🇹🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2195929207472824/", "likes": 43269, "comments": [{"username": "Domenico Zsirai", "comment_text": "Loren Pearson"}, {"username": "Tiny Vercammen", "comment_text": "Nicholas De Donder die moet ik ooit gezien hebben😍😍😍"}, {"username": "Uta Boter", "comment_text": "Uta Boter"}, {"username": "Marleè Johansen", "comment_text": "Em Dorey"}, {"username": "Jo Courage", "comment_text": "Oh I need to see this, how do I find it?"}, {"username": "Kim Raffaele", "comment_text": "Xavier Cotton…did you see this? 🤔"}, {"username": "Reets Lawrence", "comment_text": "Mel David"}, {"username": "Alana Lander", "comment_text": "Very cool"}, {"username": "Kenna Jordan-Lee Zarebski", "comment_text": "Max Johnson"}, {"username": "Wayne Brown", "comment_text": "Karen Brown"}, {"username": "Beck Chapman", "comment_text": "Tanya Large"}, {"username": "Elaine Bowman-Dey", "comment_text": "🫶🏻"}, {"username": "Nikki Hannan", "comment_text": "Jim White"}, {"username": "Laura Faulkner", "comment_text": "Frazer Faulkner"}, {"username": "Maree Noble", "comment_text": "Angie Cook"}, {"username": "Elrika de Bruyn", "comment_text": "Wanda de Bruyn oe jy moet die bietjie verf"}, {"username": "Cindy Lu", "comment_text": "Julian Gomez Moheno"}, {"username": "Vivi Elena Heggelund", "comment_text": "Jarle Henriksen"}, {"username": "Claudie Leduc", "comment_text": "Claude Lefebvre WoW"}, {"username": "Betsy Elizabeth Anne", "comment_text": "Shannon Adams Cooper"}, {"username": "Roxanne Kellogg", "comment_text": "Great picture! 🌙"}, {"username": "Tiana Alexandra Atkins", "comment_text": "Wil Atkins"}, {"username": "Denise Rakich", "comment_text": "So cool!"}, {"username": "Michael Albertsen", "comment_text": "Charlotte Albertsen"}, {"username": "Charlotte Albertsen", "comment_text": "Michael Albertsen"}, {"username": "Claire McStravick", "comment_text": "Kc Käÿ C Mäïñ"}, {"username": "Kit Nader", "comment_text": "But it's not in venice"}, {"username": "Virginia Sudol", "comment_text": "What a fabulous photo! Good job! 💞💕"}, {"username": "Michelle Claire Hart", "comment_text": "Lesley Hart wow"}, {"username": "Ashley Hopfensperger", "comment_text": "Kyle Hopfensperger"}, {"username": "Alkis Karagiannis", "comment_text": "this is NOT in Venice. This is in China!!!\nGoogle it : Crescent Moon bridge in Yongqing Fang, Guangzhou, China"}, {"username": "Alice Bong", "comment_text": "Wow beautiful !"}, {"username": "Amanda Wright", "comment_text": "Kayla Abela - I wanna see this please 🙏"}, {"username": "Jennifer Rix", "comment_text": "Brent Knight"}, {"username": "Louise Turner", "comment_text": "Louise Turner"}, {"username": "Rhio Schulz", "comment_text": "Cheryl Hopgood 😳😳"}, {"username": "Romain Dandois", "comment_text": "Célestine Duquesnoy on l’a pas vu celui là !"}, {"username": "Aaron Kincaid", "comment_text": "Tailor Kincaid"}, {"username": "Elwira Bondar", "comment_text": "Konrad Maciążek"}, {"username": "Mandi Kingman", "comment_text": "Amy Sewell"}]}, {"id": "2195929330806145", "text": "Venice. I’m in love. I may never go home.", "link": "facebook.com/groups/1373361046396315/permalink/2195929330806145/", "likes": 357, "comments": [{"username": "Mary Anne", "comment_text": "Torcello is worth a visit too, just near Burano"}, {"username": "Toni Skinner", "comment_text": "I felt exactly the same ❤️"}, {"username": "MD Monjir Islam", "comment_text": "Excellent enjoy yourself"}, {"username": "Chris Vilsack", "comment_text": "Is it sweltering?"}, {"username": "Donna Holt", "comment_text": "I read an answer to a question once and thought 'Yup. That's what I was afraid of. '\nThe question: What was your biggest mistake purchase for your Italy trip?\nThe answer: Buying a return ticket."}, {"username": "Chantal Campeau", "comment_text": "I know, I was there in June and want to go back!❤️🇮🇹🍝"}, {"username": "Sandra Francano Richards", "comment_text": "Well yeah!"}, {"username": "Carol Potter", "comment_text": "Now this is a great post about Italy!! happy and no stress all the way through￼ the post!!"}, {"username": "Liz Cooper", "comment_text": "Can’t wait.. I’m leaving the 13 th of September. Any suggestions"}, {"username": "Cindy Neilson", "comment_text": "I’ve just come back from Italy (my late father’s birthplace) and from Germany ... so I share the feeling! 😂 Enjoy the rest of your trip ... and yes, it’s very hot there!"}, {"username": "Heather Milotich", "comment_text": "100%"}, {"username": "Sandra Desmond", "comment_text": "Venice is so beautiful and unique hope you went on the gondolas that’s another wow experience and to have your own gondalier"}, {"username": "Catherine Smith", "comment_text": "Lucky lady!"}, {"username": "Patrizia D'Arcangelo", "comment_text": "I really like reading that foreign tourists are happy in my Italy.\nYou are welcome ❤️"}, {"username": "Linda Chase", "comment_text": "An incredibly special place. Planning my fourth visit! It will draw you back!"}, {"username": "Angela Romano", "comment_text": "I left my ❤️ in Venice😥"}, {"username": "Elena Andreea", "comment_text": "Elena Andreea"}, {"username": "Antoinette Vuceric", "comment_text": "I know isn’t it just beautiful? I need to go back…hubby said only 1 venician musk so yeah I need to pick up the other now!😂😂"}, {"username": "Phyllis Bearden", "comment_text": "It's a wonderful feeling."}, {"username": "Angelina John", "comment_text": "I get it!"}, {"username": "Lynne McInally", "comment_text": "Love Love Loved Venice"}, {"username": "Miguel Ramirez", "comment_text": "Heading to Rome next month. Rome ➡️Naples ➡️Florence ➡️Valencia, Spain. Can’t wait."}, {"username": "Cinzia Colombo", "comment_text": "The same feeling I had the first time I visited New York! 😀Thank you for appreciating so much my Country!"}, {"username": "Doris Sommers", "comment_text": "Yes!! I’m with you!"}, {"username": "Mary Sandor White", "comment_text": "I loved Venice."}, {"username": "Amanda Jane Worthington", "comment_text": "Venezia amore 🇮🇹 ❤️"}, {"username": "Karen O'Reilly", "comment_text": "There soon"}, {"username": "Fiorela Zegarra", "comment_text": "You are beautiful"}, {"username": "Valerie Nicole", "comment_text": "I loved Venice! Enjoy!"}, {"username": "Brown Weedy Weegy", "comment_text": "Enjoy and be safe"}, {"username": "Ruth Akutu Maccarthy", "comment_text": "Enjoy yourself!!! Also visit Burano and Murano"}, {"username": "Jack Giacomo Avondo", "comment_text": "Jack Giacomo Avondo"}, {"username": "Sharmini Nair", "comment_text": "I felt the same 🥰"}, {"username": "Robyn Lawson", "comment_text": "It certainly grabs your heart! 💙"}]}, {"id": "2195932280805850", "text": "We are traveling to Amalfi Coast from Naples. Any advice on best way to get from Naples Airport to Sorrento?? Thought about renting a car, but heard not the best idea due to the traffic and parking. Thanks for any suggestions!", "link": "facebook.com/groups/1373361046396315/permalink/2195932280805850/", "likes": 6, "comments": [{"username": "Ellie Smythe-Jones", "comment_text": "We took the campania express from Naples to Sorrento. It was great fun and a lovely way to travel."}, {"username": "Suzie LG", "comment_text": "We had a private driver prearranged. Met us at airport and drove us to Sorrento Hilton Palace!"}, {"username": "Caron Shelley", "comment_text": "Ferry"}, {"username": "Bev Madill", "comment_text": "I used a great shuttle service recently called Transferelax. Easy to deal with and very efficient."}, {"username": "Jayne Dawn Richardson", "comment_text": "Bus outside airport to port. Pick up hydrofoil to sorrento. Best way to arrive ."}, {"username": "Michelle Solak", "comment_text": "We organized a transfer through our hotel and we were so glad that we did! Unless you’re familiar with the roads I wouldn’t recommend renting a car and driving personally"}, {"username": "Angelina McConnell", "comment_text": "Public transport, shuttle and private driver are all options. Definitely would not do a car rental."}, {"username": "Gen Paino", "comment_text": "I organised a private car, highly recommend it especially if travelling with heavy luggage or multiple ppl, so worth it."}, {"username": "Jenny Payne", "comment_text": "Definitely not rent a car. I’m sure I can get a shuttle bus to Naples train station then catch a local train to Sorrento, unfortunately u then need to get a bus , so see how much a driver costs 🌻"}, {"username": "Anthony Taylor", "comment_text": "Local train.It’s cheap but does take over a hour to get thereHassle free👍"}, {"username": "Kath Milburn", "comment_text": "Bus from right outside the airport doors. Just over 10 Euro per person."}, {"username": "Erika Huber", "comment_text": "Alibus €5 outside Terminal, goes to Napoli Centrale and to the port as well."}, {"username": "Lisa DiDonato Hayden", "comment_text": "Sorrento Private Limo - we used them twice while in Italy. Once from the train station in Naples to our hotel in Sorrento and then again from our hotel in Sorrento to my cousin’s home in Bari. Both trips were fantastic and reasonably priced!"}, {"username": "Nicky Advani", "comment_text": "We organised a private car from Naples to Sorrento for 4 of us with baggage for Euro 150."}, {"username": "Paula Brink", "comment_text": "https://\nwww.curreriviagg\ni.it/mobile/\nThis bus goes direct to Sorrento from Naples airport- no need to go into Naples, take ferry etc. 10 euro per person, it’s easy, convenient."}, {"username": "Keith Bourget", "comment_text": "We took the bus its $10 each. Alittle walk from the airport but not too far at all."}, {"username": "Steve Grossman", "comment_text": "Train"}, {"username": "Lisa Valdovinos", "comment_text": "I highly recommend a private driver!"}, {"username": "Dianne Giordano", "comment_text": "We drove from Naples to Positano when we visited several years ago. It was a magnificent drive, we parked at the hotel where we stayed and most of the time walked everywhere, except for a couple of day trips."}, {"username": "Bianca D'Amore", "comment_text": "Try organizing a car service. The traffic is horrendous. There’s minimal to no taxis in Amalfi this time of year."}]}, {"id": "2195932947472450", "text": "Looking for recommendations for packing cubes, electrical afapters/power converters and sling bags. Thanks in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2195932947472450/", "likes": 0, "comments": []}, {"id": "2195933580805720", "text": "Could anybody recommend a reliable taxi or transfer company from Sorrento to Naples airport on a Sunday morning at 8am? What's the average price for a private hire travelling this route? TIA", "link": "facebook.com/groups/1373361046396315/permalink/2195933580805720/", "likes": 0, "comments": []}, {"id": "2195933454139066", "text": "Should I pre book a Gondola ride in Venice, or can you get one by not reserving?", "link": "facebook.com/groups/1373361046396315/permalink/2195933454139066/", "likes": 3, "comments": [{"username": "Jan Pab", "comment_text": "No need to book.\nTip: wake up EARLY & watch the gondoliers prepare for the day. Enjoy the empty Rialto Bridge, take photos, then walk to the dock."}, {"username": "Stacy Prestigiacomo", "comment_text": "No they are all over"}, {"username": "Kay D Barlow", "comment_text": "We just hopped on one , no need to book 😊"}, {"username": "Barbara Kistler Wilhelm", "comment_text": "No need to book. They are everywhere"}, {"username": "Laurie Frainetti", "comment_text": "I was thinking of doing a night gondola rather than daytime- anyone have thoughts on that that has done it? I saw some pics of evening rides and looked beautiful!"}, {"username": "Sarah Campise Hallier", "comment_text": "*were"}, {"username": "Lisa Valdovinos", "comment_text": "We were able to get one easily. There were no lines."}, {"username": "Tanya Luca Chetcuti", "comment_text": "David Chetcuti"}, {"username": "Pong Ac Ai", "comment_text": "I recommend night time and ride the gondola in st marks square and ask the guy to pass the bridge of sighs that would be perfect"}]}, {"id": "2195933864139025", "text": "Hi I’m getting ready to book my trip to Italy for next Spring. Flying out of Philly. Where can I go nonstop flights? The places I want to go are Rome, Venice, Florence, and Amalfi coast. I’m not sure which order. I am at the beginning of this process. HELP!!", "link": "facebook.com/groups/1373361046396315/permalink/2195933864139025/", "likes": 3, "comments": [{"username": "Michelle Solak", "comment_text": "Start north and make your way south! Venice or florence first and end with the amalfi coast. Google flights will show you your flight options - I’ve flown direct from JFK and EWR"}, {"username": "Janice Rea", "comment_text": "Start either south to north or north to south. Naples and Milan are usually cheaper to fly into."}, {"username": "Alexandra A Welker", "comment_text": "You can start from South to North or vice versa. But If you want to go to Italy from anywhere other than Europe, Rome will almost always offer you the most direct flights. Milan tends to have better flight deals than Rome."}, {"username": "Jordan Schmale", "comment_text": "AA Can fly direct to/from Rome and Venice"}, {"username": "Connie Rai", "comment_text": "See below. I can arrange EVERYTHING for you!"}, {"username": "Debi McGrath", "comment_text": "I am flying into Venice and out of Rome. Working my way south and ending in Rome. From Venice we will go to Cinque Terre >Tuscany>overni\nght ferry to Sicily>Matera and area>Amalfi>Rom\ne. I have 6 weeks and will pick up a car in Florence and have until the Amalfi portion."}, {"username": "Nicole Dana", "comment_text": "AA has a nonstop to Rome from Philly."}]}, {"id": "2195936234138788", "text": "Looking for recommendations for electrical adapters/power converters, packing cubes and sling bags. Thanks in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2195936234138788/", "likes": 0, "comments": [{"username": "Jeff Hans", "comment_text": "Following"}]}, {"id": "2195946770804401", "text": "Colosseum at 6am. Soooo amazing!", "link": "facebook.com/groups/1373361046396315/permalink/2195946770804401/", "likes": 13739, "comments": [{"username": "MD Ali", "comment_text": "nice 🇧🇩🇸🇦👌👌👌👌👌"}, {"username": "Margarita Zelaya", "comment_text": "Absolutely gorgeus.Love it."}, {"username": "Beth Harrison", "comment_text": "James Harrison 🤍"}, {"username": "Courtenay Burnett", "comment_text": "Rebekah Nicole Allen wake up sunshine"}, {"username": "Nnadea Nadine", "comment_text": "When we going 🙉 Kevin Dargie 🥰"}, {"username": "Wendy Enfield", "comment_text": "BEST time to go!"}, {"username": "Cheryl Finnegan", "comment_text": "Love this"}, {"username": "Mariza Helena Neves Medeiros", "comment_text": "Beautful Italy 💕"}, {"username": "Nikki Coates", "comment_text": "Always fancied Italy. I used to type the holiday itineraries for Wallace Arnold many moons ago. One day hopefully🤞🍀"}, {"username": "Linzi Thompson", "comment_text": "Deborah we will have to do this! Get there early with no one about 😍"}, {"username": "Shannon Dunn", "comment_text": "Rebecca Johnstone Leigh Stappard"}, {"username": "Alex Boyd", "comment_text": "Shazza Kataya"}, {"username": "Charlotte Marshall", "comment_text": "Lee Marshall 😍"}, {"username": "Marinne Boinet", "comment_text": "Valentine Tetelin 6h du matin, voilà voilà 😂 tu es prête pour notre prochain départ? Mdr"}, {"username": "Shukrani Mlewa", "comment_text": "Ciao"}, {"username": "Amy Gibb", "comment_text": "Tracey Taylor 🇮🇹"}, {"username": "Emma Harris", "comment_text": "Jamie Caldwell how beautiful does this look! 🤩"}, {"username": "Victoria Ruiz", "comment_text": "Jossue Mora para buenas fotos súper temprano jajja"}, {"username": "Nari Mene", "comment_text": "It’s more beautiful at night 😍"}, {"username": "Michael LaMore", "comment_text": "I had an opportunity to walk around the Colosseum late around 11 PM during a cold January night, not a soul around it"}, {"username": "Yi-Hsin Huang", "comment_text": "Nguyen Xuan Loc I will be there"}, {"username": "Fatma Yaricilar", "comment_text": "Nalan Kalkanoglu ben jij dit?"}, {"username": "Justine Rys", "comment_text": "Mrt Chloé j’adore la photo"}, {"username": "Barbara Palińska", "comment_text": "Barbara Palińska"}, {"username": "Carrie Johnson", "comment_text": "Kerry Furniss Kayleigh Buttery"}, {"username": "Amandine Lacaze Gouveia", "comment_text": "Jennifer Boueix Angélique Gouveia"}, {"username": "Kimberly Schall", "comment_text": "🌅"}, {"username": "Lisa Wintermantel", "comment_text": "It is truly amazing!!!!"}, {"username": "Brown Weedy Weegy", "comment_text": "Wow! Amazing!"}, {"username": "Mary Rodríguez", "comment_text": "Yayoi Kumazawa"}, {"username": "Jorge Lara", "comment_text": "Ana Luisa Medellin Palacios 😁"}, {"username": "Shuraima Marchena", "comment_text": "Radjif Maduro"}, {"username": "John Griesi", "comment_text": "John Griesi"}, {"username": "Antony Michael Antony", "comment_text": "Its the body for tho ( fantastic)"}, {"username": "Maria Mcaveney", "comment_text": "Great picture ❤️"}, {"username": "Hector Castro", "comment_text": "Muy bella experiencia!!"}, {"username": "Haylie Rushforth", "comment_text": "Lewis Robinson"}, {"username": "Renata Frková", "comment_text": "Anett Woźnickámy v 5😂"}, {"username": "Alina Ștefania Uruc", "comment_text": "Roxana Poppa Florentina Rusu"}, {"username": "Małgorzata Buzek", "comment_text": "a kiedy tam jest tak pusto?"}, {"username": "Debbie Grayston", "comment_text": "Wayne Dixon can't wait!!😀🥰"}, {"username": "Brachi Rosenberg", "comment_text": "Gali Zini Leibovich 💃😊💃😊"}, {"username": "Andrea Riecká", "comment_text": "Můj sen ❤️"}, {"username": "Jess Wittin", "comment_text": "Alexandra Mawhinney"}, {"username": "Coen Dekker", "comment_text": "When visiting Bruce Springsteen"}, {"username": "Nena Suaréz", "comment_text": "Paulina Suárez"}, {"username": "Dayli Syms", "comment_text": "Robert Alexander Syms I want this photo! 😅"}, {"username": "Kyle Craft", "comment_text": "8am - no tourists!"}, {"username": "RRöss Jonathan", "comment_text": "Breze Bentley"}, {"username": "Muhammad Hussain", "comment_text": "Wow! Amazing!"}, {"username": "Wioletta Jaenicke", "comment_text": "Wioletta Jaenicke"}, {"username": "Wioletta Jaenicke", "comment_text": "Wioletta Jaenicke"}, {"username": "Karine Gasparyan", "comment_text": "🤗🤗🤗🤗"}, {"username": "Θέμος Γκουλιώνης", "comment_text": "Ήταν ανθρωποσφαγείο;\n;"}, {"username": "Ilse van Hamond - Zoontjens", "comment_text": "Loes de Jong vroeg uit de veren of nachtje doorhalen?"}, {"username": "Karine Gasparyan", "comment_text": "Karine Gasparyan"}, {"username": "Karine Gasparyan", "comment_text": "Karine Gasparyan"}, {"username": "Muhammad Hussain", "comment_text": "Muhammad Hussain"}, {"username": "Rosie Power", "comment_text": "Anthony O Callaghan"}, {"username": "Sophie Toulson", "comment_text": "Adam James Toulson"}, {"username": "Ann-Marie Piquita", "comment_text": "Nadine Hattingh"}, {"username": "Rhonda Gilmore", "comment_text": "Reuben van den Dop\nSophie Humphries"}, {"username": "Lisa Griffis Tucker", "comment_text": "Here ya go. Now it's just you in the moment."}, {"username": "Aurore Lagarde", "comment_text": "Je veux y retourné 🥰 Guillaume Jean"}, {"username": "Darren Williams", "comment_text": "Lynette"}, {"username": "Philipp Zass", "comment_text": "Arno Glotz"}, {"username": "Yara Karime Vazquez", "comment_text": "Perlita Cabrera"}, {"username": "Maria Kalogianni", "comment_text": "Letizia Monno soon 😄"}, {"username": "Kaya Whiskin", "comment_text": "Emma Ovenden"}, {"username": "Tamara Esklavon", "comment_text": "Dean Kalfics wordt vroeg opstaan 😅😘"}, {"username": "Lilia Kalache", "comment_text": "Belinda Kalache"}, {"username": "Jo Burns", "comment_text": "Terrific photo. Enjoy!"}, {"username": "Olivier Ricard", "comment_text": "Olivier Ricard"}, {"username": "Mairead Furlong", "comment_text": "Tommie Lee 😍"}, {"username": "Davina David", "comment_text": "Gregory Bonny inspiratie foto 😁🤩"}, {"username": "Kern Szilvia", "comment_text": "Kern Szilvia"}, {"username": "Emma McRuvie", "comment_text": "Jamie id love to see it ♥️"}, {"username": "Diana Miteva", "comment_text": "❤️❤️❤️❤️"}, {"username": "Stefania Moroianu", "comment_text": "Stefania Moroianu"}, {"username": "Joey Messineo", "comment_text": "Myrka Aguilar"}, {"username": "Kayleigh Mcalpine", "comment_text": "Sophie Horn looks like you xx"}, {"username": "Zofia Modrzejewska", "comment_text": "Maj 2023"}, {"username": "Joann Cugini", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Sarah Jordan", "comment_text": "Hayley Jones Kim Hunt🤩"}, {"username": "Liviu Georgescu", "comment_text": "Another iconic place in eternal Rome. I love it❤️"}, {"username": "Claudie Leduc", "comment_text": "Omg you guys! So much appreciation! Thanks for the love! ❤️🥹 Grazie mille per tutto il vostro amore! ✨"}, {"username": "John DiMond", "comment_text": "John DiMond"}, {"username": "Suzie McNeill", "comment_text": "Marie Hird this is when we need to go!"}, {"username": "Anna Przybysz", "comment_text": "28.04.2018 6:27 ☺️☺️☺️"}, {"username": "Michael Lo", "comment_text": "Yubell Velasco 6am is doable"}, {"username": "Maddi Rogers", "comment_text": "Ashleigh Brewer"}, {"username": "Stacey Edwards", "comment_text": "Kieran Edwards"}, {"username": "Frances McDonagh", "comment_text": "Best time to go with the heatwave atm"}, {"username": "Nikki Diane", "comment_text": "Did you do a tour or were you able to get in this early without a tour?"}, {"username": "Laura Zel Kremer", "comment_text": "Wow! Beautiful shot!"}, {"username": "Juno Lee", "comment_text": "Love this picture! We were there in June and tried very hard to take a right angle picture with Colosseum on the back. You did it!"}, {"username": "Bernadette Rugayan Bohn", "comment_text": "Maria, 6am?!? I'm all for it!😁"}, {"username": "Jim Castronovo", "comment_text": "Fantastic hour to arrive there on a summer day!"}, {"username": "Raisa Culver", "comment_text": "Amazing shot!"}, {"username": "Steph Kittles", "comment_text": "The city is beautiful at sunrise. So quiet."}, {"username": "Laura Morgenstern Birman", "comment_text": "What a wonderful photo"}, {"username": "Jamie Roland", "comment_text": "Italy OH HELL YEA"}, {"username": "Lynne McInally", "comment_text": "Just arrived back home and go really early! We couldn't get them so we went at 6:00 pm . Its getting really hot to be out during the day"}, {"username": "Jodi Ann Roche", "comment_text": "Luke Ryan"}, {"username": "Jennifer Ellithorpe", "comment_text": "What a great pic!!"}, {"username": "Heather Dickerson", "comment_text": "Beautiful photo! Mine does not look near this good but it also wasn’t even close to that early, lol"}, {"username": "Jamie Roland", "comment_text": "Oh hell no not wearing birks"}, {"username": "Laura Vandegrift", "comment_text": "so smart! avoid the crowds and the heat!"}, {"username": "Shaked Kapiluto", "comment_text": "Sahar Dagan"}, {"username": "Joanne Whiley", "comment_text": "Rachael Whiley ❤️💕"}, {"username": "Natalie Louise Crabtree", "comment_text": "Ian Whalley 😍"}, {"username": "Danuta Czerniak", "comment_text": "Cudowne miejsce 😍"}, {"username": "María Teresa Rojas Murillo", "comment_text": "Spectacular!"}, {"username": "Clairette Vautour", "comment_text": "Absolutely beautiful"}, {"username": "Jenny McGhie", "comment_text": "Craig McGhie"}, {"username": "Carmen Rincon", "comment_text": "Yes Spectacular!"}, {"username": "Linda Geerlings Dona", "comment_text": "Sabrina Pimenta"}, {"username": "Faith Williams Day", "comment_text": "6am and there’s still people in the background!"}, {"username": "Kelli Gene Blakeman", "comment_text": "Tiffani Webb Leslie Barnhart"}, {"username": "Crista Minnick", "comment_text": "Gorgeous photo!"}]}, {"id": "2195949480804130", "text": "Heading to Italy, and anywhere overseas actually, for the first time in September. This page has been very helpful. I’m traveling alone, and am curious how much and what denominations of coins should I bring? I’ve seen posts about pay toilets, and definitely want to have proper change! Thanks 😊", "link": "facebook.com/groups/1373361046396315/permalink/2195949480804130/", "likes": 0, "comments": [{"username": "Dave Conroy", "comment_text": "You really need a small coin purse and just collect them as you go in change, ie have some notes and pay with them now and again."}, {"username": "Ellie Smythe-Jones", "comment_text": "I carried €1 coins only. I did find that 3 out of our 5 hotels asked for tourist tax in cash only so made sure we had that in hand."}, {"username": "Emma Chadwick", "comment_text": "Public toilets vary from 50 cents to €1 but if you use ones in cafes/\nrestaurants/\nmuseums etc then no charge (obviously have to buy a drink or something)."}, {"username": "Ellen Edmonds-Wilson", "comment_text": "1 euro coins plus 50 centimes will be your friend, but ultimately just gets drink at a cafe and use their toilets for free most of the time. Never not use a toilet when it is free!"}, {"username": "Rosslyn Patience", "comment_text": "Go to the toilet in cafes and bars. You can just order a coffee and use the toilet while there."}, {"username": "Sigrid Cormier", "comment_text": "In Canada currency exchange does not have coin, starts at €5 and up. So when you arrive at the arrive port buy a bottle of water give a €10, then buy a chocolate bar elsewhere same process. Now you have some small change."}, {"username": "Sandra Shoffner", "comment_text": "When you arrive buy something to get coins smaller than 5 euro. Keep those if needed for public restrooms. Some have an attendant and are clean."}]}, {"id": "2195950537470691", "text": "Any suggestions for affordable places to stay close to Salerno with short access to Amalfi during mid August?", "link": "facebook.com/groups/1373361046396315/permalink/2195950537470691/", "likes": 0, "comments": []}, {"id": "2195950827470662", "text": "If you’re in Venice on Friday 21 July you need to know that the vaporetto will be on strike so you’ll need to catch a water taxi or gondola to get around.", "link": "facebook.com/groups/1373361046396315/permalink/2195950827470662/", "likes": 0, "comments": []}, {"id": "2195959177469827", "text": "Hi everyone! Together with my boyfriend we will travel through Italy for two weeks, does anyone have any idea how much might we spend on food (breakfast, lunch and dinner)?", "link": "facebook.com/groups/1373361046396315/permalink/2195959177469827/", "likes": 0, "comments": [{"username": "Jerry Lyubelsky", "comment_text": "We were a family of 4. Breakfast was included at all our hotels. We averaged about $75euro for\nLunch and $100 euro for dinner per day. We ate gelato probably twice a day lol not included in those numbers and don’t forget about buying bottled water we spent about 100euro on that. We drank a lot of water"}]}, {"id": "2195963924136019", "text": "Hi! Has anyone stayed in Praiano? Any recommendations\non places to see or how to get around?\nWill be there early September one week: thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2195963924136019/", "likes": 0, "comments": []}, {"id": "2195966930802385", "text": "Hostel recommendations for Milano ?", "link": "facebook.com/groups/1373361046396315/permalink/2195966930802385/", "likes": 0, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2195967917468953", "text": "Milan, Italy", "link": "facebook.com/groups/1373361046396315/permalink/2195967917468953/", "likes": 1, "comments": [{"username": "Joe Demarco", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Banhisikha Banerjee", "comment_text": "Gorgeous ❤️❤️"}, {"username": "Fayez Ghanem", "comment_text": "Beautiful place I would like to visit again 😘"}, {"username": "Jenny Peltz Phillips", "comment_text": "I am flying in and out of Milan and was going to skip it. You think it’s worth doing a night?"}, {"username": "Renae Gilmore Kulak", "comment_text": "Emilia Kulak"}, {"username": "Elaine Catino Tsangarides", "comment_text": "Did you use an app to get rid of the people in the photos? Great shots!"}, {"username": "Angie Sabia", "comment_text": "Daniel Richter"}, {"username": "Michelle Possingham", "comment_text": "Glenn 😍"}, {"username": "Geraldine Calabrese Anello", "comment_text": "Gorgeous ❤️❤️"}, {"username": "Louise Davies", "comment_text": "Paul Minshull"}, {"username": "Maria Grazia Rizza Costanzo", "comment_text": "Complimenti Claudio Ciardi. Amazing photos of a city I’ve been to so many times, and again in September. Through your photos I feel like I’ve missed out on a lot of places. Thank you for sharing. I’ll make sure to revisit some of my favourite and definitely those I’ve never been to."}, {"username": "Tarn Martin", "comment_text": "Jessica Ayala- close by! Xox"}, {"username": "Desak Fiega Mahayasa", "comment_text": "Cek, dear Panji Prakoso"}, {"username": "Gabrielle Higginbotham", "comment_text": "I would go back in a heartbeat!💜"}, {"username": "Luna Yms", "comment_text": "Mouh Sa"}, {"username": "Maud Innocenti", "comment_text": "Richard Guillemette"}, {"username": "Ashley Nichole Phillips", "comment_text": "Leslie Suarez"}, {"username": "Jennifer Erdman", "comment_text": "Really nice photos!"}, {"username": "Donna Tanner Musick", "comment_text": "Wow...."}, {"username": "Christine Vitiello Cundiff", "comment_text": "Beautiful photos ❤️"}, {"username": "Iris Simons", "comment_text": "Absolutely gorgeous!!! You are really good at taking pictures"}, {"username": "Fanny Alcala", "comment_text": "Hi,do yo make tours in Milán, Assis, Venecia, Lago Di Como?"}, {"username": "Laura Ranucci", "comment_text": "Laura Ranucci"}, {"username": "Karen Albertyn Wood", "comment_text": "Beautiful pics"}, {"username": "Anne Louise Nicholson", "comment_text": "These photos are amazing. ❤️"}, {"username": "Christi LaBarba Erpillo", "comment_text": "One of my favorite cities! You did a fabulous job capturing its beauty!"}, {"username": "陳俊榕", "comment_text": "陳俊榕"}, {"username": "Lisa Smith-Whipp", "comment_text": "Sinead Whipp"}, {"username": "Jamie Holaday", "comment_text": "Really amazing photos. I love your use of perspective!"}, {"username": "Jane Crager Kovacs", "comment_text": "Best place to eat in Milan?"}, {"username": "Daniela Fernandez", "comment_text": "Italia es de los paises mas lindos que mis ojos han visto ❤️"}, {"username": "Dori Reader", "comment_text": "Absolutely gorgeous!!! Any tips on getting around to view all these sites? Thank you!"}, {"username": "Bethanne Glover", "comment_text": "Drew Stiffler"}, {"username": "Mariateresa Corvini", "comment_text": "Bravo!!!"}, {"username": "Lorraine Page", "comment_text": "Absolutely breathtaking 💕"}, {"username": "Rosemary Cedillo", "comment_text": "Bellísima ciudad!!!"}, {"username": "Noha Magdy", "comment_text": "Absolutely amazing\nAdam Hossam"}, {"username": "Jazz Caldwell", "comment_text": "I missed the apt tower with the trees on all the balconies and rooftop garden!"}, {"username": "Caroline Nasrin Afzal", "comment_text": "Thank you. There is always cheap flights to Milan. I was not sure about Milan. Now I know it is worth a visit"}, {"username": "Phyllis Bearden", "comment_text": "All magnificent."}, {"username": "Marta E Gillette", "comment_text": "❤️❤️❤️❤️"}, {"username": "Mia Juhary", "comment_text": "Nalira Azmee 😬"}, {"username": "Lamia Saidi", "comment_text": "❤️❤️❤️❤️"}, {"username": "Mary Lee Quaid", "comment_text": "Wonderful pics. Thanks for sharing!"}, {"username": "Élodie Maureau", "comment_text": "hello good evening how are you I hope that well I am here to make friends and also looking for a serious relationship"}, {"username": "Lina Khasky-Parness", "comment_text": "Beautiful, what camera did you use ?"}, {"username": "Ali Ipps", "comment_text": "Ali Ipps"}, {"username": "Joanna Fowler", "comment_text": "Carmela P"}, {"username": "Mabel Quintana", "comment_text": "Laney Mcgriff"}, {"username": "Carmela Lasaponara Cosh", "comment_text": "Carmela Lasaponara Cosh"}, {"username": "Leanne Burrows", "comment_text": "Rachel Olivia Burton"}, {"username": "Diana T Marlette", "comment_text": "Diana T Marlette"}, {"username": "Nancy Willson", "comment_text": "Great pictures. Wish I could hire you to be my official vacation photographer."}, {"username": "Susan Johnston Szewczyk", "comment_text": "Beautiful every one of these photos!"}, {"username": "Julie Piccione-Salafia", "comment_text": "Dj D.j. Salafia"}, {"username": "Isabella Davis", "comment_text": "Isabella Davis"}, {"username": "Julie Sheridan", "comment_text": "Beautiful photos.Thank you for sharing."}, {"username": "Daiga Vilerte", "comment_text": "Grazie mille👍molto bellissimi foto, molto bellissima cita ❤️❤️😄"}, {"username": "Helle Isaksen", "comment_text": "Lene Kristensen .. man får lyst til et genbesøg 🇮🇹❤️🇮🇹"}, {"username": "Steve Steve", "comment_text": "Awesome photos."}, {"username": "Rose Frowd", "comment_text": "Lauren Perri"}, {"username": "Alicia E Harker", "comment_text": "Great angle of the pictures. Not everyone thinks of looking up ⬆️"}, {"username": "Phil Greengus", "comment_text": "I want to go"}, {"username": "Jan Lumberg Kupczyk", "comment_text": "Beautiful photos"}, {"username": "Valeria Tanco", "comment_text": "Now I’m sad I’ll miss it!"}, {"username": "Jean Bennett O'Reilly", "comment_text": "Beautiful 🤩!"}, {"username": "Mark Palmieri", "comment_text": "Spectacular!"}, {"username": "Patty Farrell Fanzo", "comment_text": "Fantastic pictures!"}, {"username": "Nauman Khan", "comment_text": "Nauman Khan"}, {"username": "Robin Wilfong", "comment_text": "Going on Globus Highlights of northern Italy tour August 25 - Sep 3. Earned discount\nAs I Booked 6 on Avalon Waterways a Globus Company so excited"}, {"username": "Geetha La Magna", "comment_text": "John La Magna"}, {"username": "Maria Chudzinski", "comment_text": "Maria Chudzinski"}, {"username": "Christina Edwards Anderson", "comment_text": "Liz Starley"}, {"username": "Brenda Harris Dixon", "comment_text": "You have some beautiful photos! Great photography!"}, {"username": "Chia Chiang", "comment_text": "Great pictures!!"}, {"username": "Susan Platt Carley", "comment_text": "Amazing photos, thank you!"}, {"username": "Arv S Sachdev", "comment_text": "Amazing shots Claudio Ciardi Thank you for sharing."}, {"username": "Lorrie Smith", "comment_text": "These pictures are amazing!"}, {"username": "Madison Semmens", "comment_text": "Sinead Spry"}, {"username": "Brian Sturkie", "comment_text": "Seema Parmar Sturkie"}, {"username": "Clare Ann", "comment_text": "I'd never really considered Milan before but will do now"}, {"username": "Sophi Bury", "comment_text": "Lily Fulford 🤠🤠"}, {"username": "Charis Beloved", "comment_text": "You have penchant for taking architectural shots aesthetically! A diff perspective of the Italy I know . 👍👏"}, {"username": "Ekaf Tnuoca", "comment_text": "😍😍😍😍"}, {"username": "Ellen Carder", "comment_text": "Always wanted to visit, some day 😃"}, {"username": "Lori Sammons", "comment_text": "What hotel did you stayed in? Going mid August"}, {"username": "Patricia Hunter", "comment_text": "Maria CarnevaleAmanda CarnevaleAli Hunter"}, {"username": "Linda Padilla", "comment_text": "Awesome pictures!"}, {"username": "Jenny Genzale", "comment_text": "These are some of the most stunning images of Milano I've ever seen. Buon lavoro!"}, {"username": "Sam Cowie", "comment_text": "Amazing photos!!! 😍"}, {"username": "Tami Fehn", "comment_text": "Great photos! Nice eye!"}, {"username": "Maureen McGuire", "comment_text": "Stunning photos! Visiting Milan in October on the way back from Sicily!"}, {"username": "Linda Flynn Graeve", "comment_text": "Incredible photos!!!!"}, {"username": "Pamella Hardy", "comment_text": "What's the name of the theater ?!!!!! 😍"}, {"username": "Robin Leisner-Majuta", "comment_text": "These are amazing photos. You really captured the beauty. Thank you for sharing."}, {"username": "Nina Truong", "comment_text": "Stunning photographs!"}, {"username": "Nina Truong", "comment_text": "Quynh Thy Truong"}, {"username": "Linda Cassol Turner", "comment_text": "Love it ♥️"}, {"username": "Margaret Stewart", "comment_text": "Looks fab - think this photographer must be professional. Outstanding pictures 👍"}, {"username": "James Maxwell", "comment_text": "Belle foto!!"}, {"username": "Alicia E Harker", "comment_text": "Alicia E Harker"}, {"username": "Rhonda Wasylowich", "comment_text": "Beautiful pictures!! 😊"}, {"username": "Scott Christino", "comment_text": "Great trip, sorry the photos didn’t turn out."}, {"username": "Kristine Malkewich", "comment_text": "Okay, now I want to add Milan to my itinerary!! Beautiful photos!😍"}, {"username": "Bela Soni", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Ana Luiza Verissimo", "comment_text": "Wonderful pictures! ❤"}, {"username": "Yuko Konno", "comment_text": "Absolutely gorgeous!"}, {"username": "Megan Leigh", "comment_text": "Did you take all of these shots? This is stunning photography."}, {"username": "Connie Schoch Morello", "comment_text": "Connie Schoch Morello"}, {"username": "Denise Dunlap", "comment_text": "These are the best photos I’ve seen in a long time! So clearly you must be a professional photographer-if\nnot, you should be! However, HOW do you take all these pics w nobody in them? Do you only go out at night/early morning or do you “erase” the people? This is my dream - to take photos like this."}, {"username": "Julie Landrum", "comment_text": "Wonderful pictures!!"}, {"username": "Denise Dunlap", "comment_text": "Suzie Dyer, check out these pics!"}, {"username": "Linzi Conway", "comment_text": "Daisie Conway Neil Saulters"}, {"username": "Nilza Mercado", "comment_text": "Elvin Mercado next trip!"}, {"username": "Jyoti Sahni", "comment_text": "Wow— missed Milan on my trip— will have got go back one day"}, {"username": "Robyn Smuin", "comment_text": "Bella Milano 💕💖🤩 grazie per le foto, Claudio!"}, {"username": "Melanie Shofner Gilbronson", "comment_text": "Impressive photos of the great Milan landmarks!"}, {"username": "Kathy Ruff", "comment_text": "Gorgeous next vacay"}, {"username": "Shirley Fraser", "comment_text": "Wendy Jean Fraser gorgeous"}, {"username": "Franca Rocca Martinello", "comment_text": "Would love to visit Milan one day"}]}, {"id": "2195969150802163", "text": "Hello! First time in Italy and we have a wedding in Chianti. Looking for a day/night in another area nearby beforehand. Has anyone stayed at Villa Campestri outside of Florence? Thoughts or other recommendations?", "link": "facebook.com/groups/1373361046396315/permalink/2195969150802163/", "likes": 0, "comments": []}, {"id": "2196001930798885", "text": "How strict are they in Italy about checking IDs for drinking? Will my 17 year old be able to order a beer/wine?", "link": "facebook.com/groups/1373361046396315/permalink/2196001930798885/", "likes": 5, "comments": [{"username": "Tiffany Hadfield Merrill", "comment_text": "Never checked my 18 year old"}, {"username": "Chris Vilsack", "comment_text": "Not at all.. Drinking culture isn't that big in Spain or Italy. You don't see much \"going out drinking\" in these parts. One funny thing I see in both countries is the breakfast beer. Just one, no food, and then off to start your day!"}, {"username": "Alicia Cox", "comment_text": "Lol no wine is water in Italy 😱🤣! And it’s good!"}, {"username": "Michele Drozdowski", "comment_text": "Not at all-here now"}, {"username": "Sandra Keyser", "comment_text": "No problem! I saw much younger children than 17 having wine for dinner! Just life there! I also saw no overly inebriated individuals!"}, {"username": "Catherine Tarazon", "comment_text": "Victoria Regalado"}, {"username": "Friedemann Diederichs", "comment_text": "I was five or six years old when I had my first vino in a ristorante near Rimini."}, {"username": "Alessio Esposito Inchiostro", "comment_text": "An adult can offer alcohol to someone who is 16 or 17 and it's not illegal"}, {"username": "Alessio Esposito Inchiostro", "comment_text": "https://\nwww.laleggepertu\ntti.it/\n531778_un-minore\nnne-puo-bere-al\ncolici"}, {"username": "Monica Roman-Fazio", "comment_text": "Absolutely they were trying to give my 12 year old wine and lemoncello"}, {"username": "Evie Gee", "comment_text": "My son to a winery/\nvineyard with his high school group!"}, {"username": "Lisa Kelly", "comment_text": "Age 16 with parents"}, {"username": "Renee Rundle Stoneham", "comment_text": "Most of Europe if they are with parents it’s fine.\nMost places 16+ for beer & wine 18 for liquor"}, {"username": "Shanna Crotts", "comment_text": "My teens are 18 and never asked abt age"}, {"username": "Hollie Barcheck Juersivich", "comment_text": "My son is 18 and daughter 20, haven’t checked them once. My daughter even asked and they said no."}, {"username": "Ed Braz", "comment_text": "Italians (and Europeans in general) have access to alcohol from a young adult age. And there isn’t a sense that they missed out until they are 21 and have to makeup for lost ‘slugging it’ time. 😢\nYour teenager should have no issue at all! 👍"}, {"username": "Roxanne Curzi", "comment_text": "I went to bars with my teenage cousins when I visited Italy."}, {"username": "Daniela Ricketts", "comment_text": "Legal drinking age n Italy is 18- however if you and your sit at dinner eat and drink, it will be no problem"}, {"username": "Ashley Martins", "comment_text": "No issues, we did wine tasting with our 16 & 17 year old at a winery & they also got fruity drinks such as a Hugo or Spritz here & there."}, {"username": "Daniel Fett", "comment_text": "No problem with alcohol for your daughter at age 17. The Italians apparently have more of a drug problem and have zero tolerance for that"}, {"username": "Lisa Silverman", "comment_text": "Why would you want your 17 year old child to drink alcohol?"}, {"username": "Martin Corona", "comment_text": "Money talks in Italy. U can do whatever"}, {"username": "Karen Cumbo", "comment_text": "There is no drinking age"}, {"username": "Jessica Petyo", "comment_text": "It was offered to our 14 and 16 year olds almost every meal! They always brought them wine glasses when we ordered bottles of wine. They didn’t drink, but it’s safe to say no one was checking IDs at any place we went over two weeks."}, {"username": "Sandra Simatovic", "comment_text": "Don't worry, they don't check and don't care..."}, {"username": "Linda Miller", "comment_text": "Minors are allowed to drink if accompanied by their parents in the US, well at least in Wisconsin. No different when in Italy! 🇮🇹"}, {"username": "Jill Medrano Casey", "comment_text": "Haha, they don't care."}, {"username": "Mary Sandor White", "comment_text": "My Italian grandmother used to give us wine to make us sleepy when I was young. I still get sleepy unfortunately I noticed young people having wine"}, {"username": "Alice Francesca", "comment_text": "Nobody checks because we are not obsessed with getting drunk as soon as it 's legal.Drinking is a cultural and family thing.legal age is 18."}, {"username": "Richelle Trezise", "comment_text": "If the legal age is 18 why would you condone letting your daughter break the rules in a forgien country. We went to the States with our daughter who was 18 and she couldn't drink because the age is 21. It's called following the rules. I am not trying to be mean."}, {"username": "Thuy Tdt", "comment_text": "Idk about Italy but in Germany you can buy beer & wine legally at the age of 16\nI think that won’t be a problem in Italy either"}, {"username": "Mo Dee", "comment_text": "My teens were able to drink wine at our meals without issue. If they went out alone, not sure but…they could drink what I ordered."}, {"username": "Anthony Sperduti", "comment_text": "Never seen anyone checked"}, {"username": "Christine Ann", "comment_text": "Kids can drink if they are with their parent…"}, {"username": "Nicky Heath", "comment_text": "Yes"}, {"username": "Rhona OConnor", "comment_text": "They young people drink very little and I never saw them drunk even at a big music gig. So there is no problem as long as they are responsible."}, {"username": "Jane Allen", "comment_text": "Drinking with a meal is fine"}, {"username": "Mercedes Zapata", "comment_text": "They don’t check ids at all"}, {"username": "Kaitlyn Harp", "comment_text": "Nobody has even asked or checked! Especially at dinner, they just pour the wine!"}, {"username": "Bonnie Loftspring", "comment_text": "I think Europe is rather liberal in allowing underage drinking with their parents. That said I know Spain has Zero tolerance for DUI, which means you will have your license confiscated for life! ( or this was true yrs ago when I was there)"}, {"username": "Enzo Teutonico", "comment_text": "Its not forbidden fruit in in italy."}, {"username": "Julie Webster-Rogers", "comment_text": "Nancy Webster-Gregg Halle Gregg"}, {"username": "Lea Clariss Baduria", "comment_text": "It’s Europe, normally we enjoy wine and beer no o questions ask.. 🥂"}, {"username": "Eric Parks", "comment_text": "From my experience, they don't seem to care. We were at a beach club outside Naples and my 16yo went off for a bit. (Thought he went up to the pool or maybe the restaurant). Comes back about an hour later with a surprise drink in hand for me and looking a bit buzzed. I asked where he had been and he said he had a couple G&T at the bar before coming back to where we were. When asked he said they served him and didn't even ask his age, 16 and looked it."}, {"username": "Roe Gallo Saks", "comment_text": "Yes. Especially if he’s with you."}, {"username": "Roger Almanza", "comment_text": "My 12 year old was doing shots at the bar while telling the bartender how rough he has it in life.\n\nYou’ll be fine 🙂"}, {"username": "Brandy Hines", "comment_text": "They served my 15 year old complimentary wine several times last week when we were there"}, {"username": "Cyn Balog", "comment_text": "The Aperol Spritz was one of my 16-year-old’s favorite things about our last trip. 🤣"}, {"username": "Catherine Watson", "comment_text": "Suzy Ramirez-Santos"}, {"username": "Loreta Berti", "comment_text": "Travelled with my 16 year old daughter and they offered her wine - culture is different in Italy"}, {"username": "Jennifer Avrett", "comment_text": "They will definitely not care. My 13 year old son got a wine glass put in front of him every meal😂"}, {"username": "Letty Veronica", "comment_text": "They don’t care at all. My daughter just turned 17 and at Nanarella our waitress said how old are you? She said 17. The waitress said close enough to 18 and gave her a free after dinner shot 😂"}, {"username": "Kyna Martin Autrey", "comment_text": "My 18 year old never got IDed"}, {"username": "Donna Winter", "comment_text": "Customary in Italian families to allow wine with meals. My Dad always poured a small glass for us at holiday tables."}, {"username": "Moon Avery McCroskey", "comment_text": "My twelve year old sister was offered wine at almost every dinner we went to. They are super relaxed about alcohol, especially if you are responsible with it. A lot of younger children will be introduced to wine with water added to it or given just a little to be included. My youngest sister was able to try a sip of multiple types of wine but decided they weren’t for her!"}, {"username": "Julie Tran", "comment_text": "No issues"}, {"username": "Adriana Rodriguez-Argueta", "comment_text": "Back in 2019 My (then) 17 year old daughter lived and studied abroad in Rome for 6 months. Every time she would go out to eat with her host family (or us when we visited) she was asked by servers if she wanted to other a glass of wine (or after meal liquor) without even asking her for proof of age. She went to many of her local high school parties (Halloween, New Years, etc) and noticed young people drink responsibly and in moderation. She was (and still is) not a drinker and unlike in the U.S., never felt peer pressure from her Italian program or high school friends to drink. Many parts of the world don’t have the drinking problem we see in the U.S. among our youth. As someone who was born and raised abroad, I remembered being taught since a very early age how to drink a very small amount of wine with our meals. To this day (and at 58 years old), I still drink do the same way."}, {"username": "Jennifer Whipple", "comment_text": "My 11 year old ordered baba a rum soaked pastry dish that tasted like it had a whole bottle of rum in it🤣 it's part of the culture for teens to drink wine with their parents. In my opinion they don't care who drinks as long as it's not a child ordering alone."}, {"username": "Charles Holt", "comment_text": "No issues"}, {"username": "Carole Tarlap", "comment_text": "Does he drink in the US🤔🤔🤔"}, {"username": "Sasha Tarasin", "comment_text": "We have found it very relaxed here in Italy"}, {"username": "Marissa McLean", "comment_text": "I think they will have no problem 😉"}, {"username": "Melissa Jane Brown", "comment_text": "My daughter was never asked once in the two weeks we were there (she's 21)."}, {"username": "Reina Pike", "comment_text": "We order a bottle or a carafe and they just automatically bring a glass for our 14 year old 😂"}, {"username": "Annette Cambiaso", "comment_text": "We took 3 teens to Italy and they were all offered wine at each meal."}, {"username": "Justen Billy", "comment_text": "I've seen kids drink wine"}, {"username": "Christina Tassinari", "comment_text": "Def!"}, {"username": "Janelle Urquidez Harris", "comment_text": "My son was 14 and was offered wine at just about every restaurant."}, {"username": "Mandy Miller", "comment_text": "Saw a documentary yes ago about the difference in drinking cultures between European countries.... If I remember correctly.. Italy don't have the same problems that we might have regarding underage drinking and drink driving offences.. And one of the key elements to this was to teach youngsters that it's acceptable to have a drink with evening meals.. Not too much obviously but from the age of i think 13-14 they are taught to drink sensibly 😊.. The contrasting figures in offences was literally staggering!!!!.\n.. They definitely got it correct 🤗"}, {"username": "Frank Hunt", "comment_text": "They don’t care!"}, {"username": "Lauren-Jade Roberts", "comment_text": "We saw two quite young Australian kids with their parents drinking aperol spritz"}, {"username": "Christina Hance Beckett", "comment_text": "Italians drink to enjoy not to indulge. To each their own. We moved over here and the first time we ordered a bottle they brought glasses for everyone."}, {"username": "Jeff McLellan", "comment_text": "From your question it is unclear if you are wanting them to be able to or are worried about them being able to."}, {"username": "Joe Guzzi", "comment_text": "Buying age is 18, and they can be strict. No real drinking age, likewise in Europe in general. Most of Switzerland, except for the Italian speaking parts, buying age is 16."}, {"username": "Joe Guzzi", "comment_text": "Buy, no, drink one that you bought, yes."}]}]