[{"id": "2203028980096180", "text": "I will be in the Termoli area for 12 days and using this as a base to spin off to other one-day visits. Any must see places to recommend not missing. Was thinking of also going to Manfredonia as a second base? Comments? I have no car, travelling by bus/train.", "link": "facebook.com/groups/1373361046396315/permalink/2203028980096180/", "likes": 0, "comments": []}, {"id": "2203054413426970", "text": "Are you able to get a guided tour when you arrive at pompeii ? And has anyone done this ? not looking to book through Viator but if we have to we will.", "link": "facebook.com/groups/1373361046396315/permalink/2203054413426970/", "likes": 1, "comments": [{"username": "Mary White", "comment_text": "We did a wonderful tour with Ada Abbodante. She is on facebook, search for her. She was really passionate."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2203043173428094", "text": "We are planning to travel from Rome to Sicily end of September to mid October. We’re planning on about 10 days to visit Sicily.\nWhat are your suggestions on an itinerary and places to visit on the way to Sicily. We will definitely visit Naples and Pompeii.", "link": "facebook.com/groups/1373361046396315/permalink/2203043173428094/", "likes": 1, "comments": [{"username": "Nancy Koehler Barboni", "comment_text": "Learn some basic Italian phrases. Have lots of patience. Go with the flow. Be prepared for Plan B. Enjoy the journey as much as the final destination! Sicily is one my favorite places in the world❣️"}, {"username": "Mary Agozzino Derrick", "comment_text": "2 days in Taormina,\n3 days in Ortigia ( you can do side trips to say Noto, Marzamemi, Modica...from here or spend the days soaking in Ortigia and the history ofSiracusa)\n1day at Valley of the Temples in. Agrigento and the night in Agrigento..\n4 days based in Palermo with side trips to Monreale, Cefalù...etc"}]}, {"id": "2203039176761827", "text": "We will be in Milan on September 14-15th. Any recommendations for your guides or who to book to see The Last Supper or book tickets direct?", "link": "facebook.com/groups/1373361046396315/permalink/2203039176761827/", "likes": 12, "comments": [{"username": "Steve Grossman", "comment_text": "Check out viator\nThey have everything"}, {"username": "Caitlin Adamz", "comment_text": "I found their website agonizing so I called the hotline. A breeze. +39 02 92800 360"}, {"username": "Donna Mangone", "comment_text": "Www.GetYourGuid\ne.com"}, {"username": "Donna Mangone", "comment_text": "We booked our tour for the Last Supper through GetYourGuide 2 months before we went."}, {"username": "Miyuki Kanno Paul", "comment_text": "Official website is this.\nhttps://\ncenacolovinciano\n.vivaticket.it/"}, {"username": "Virgz Van Møøre", "comment_text": "Official website, always ..."}, {"username": "Kelley Casole Cwiklinski", "comment_text": "Thank you!"}, {"username": "Linda Tibbles", "comment_text": "Look at Viator Web site for Milan. You will be given a time for entry to Last Supper. Entry is by a pre purchased ticket at the time given. Read up on the art before. No point in getting a guide for this."}, {"username": "Kathy McCray", "comment_text": "I am looking for The Last Supper tickets too for the same dates and they are sold out on the official website."}]}, {"id": "2203030943429317", "text": "Have to get from Naples to Milan. Ryan air or the frecciaosso?", "link": "facebook.com/groups/1373361046396315/permalink/2203030943429317/", "likes": 1, "comments": [{"username": "Clarissa Rava", "comment_text": "Pretty much depends on how much you want to spend and what luggage you have"}, {"username": "Brad Nelsen", "comment_text": "Train."}, {"username": "Gianna Onesi", "comment_text": "Frecciarossa!"}, {"username": "Roland Trego", "comment_text": "I personally feel that the train is the best method. The actual flight is, of course, shorter, but when you figure in getting to the airport two hours early and going through security, etc., the train just seems like less hassle. Also, do you want to go to Milan or Milan Malpensa? https: // www . rome2rio . com/map/Naples/\nMilan"}, {"username": "Luca Lookone Ferrentino", "comment_text": "Plane only if it makes you save a lot of money.\n\nTrain is waay more comfortable and gets from city center to city center, without having to wait on a boarding queue etc"}, {"username": "Frannie Kaplan", "comment_text": "Either, just check tje prices first. It is probably easier by train"}, {"username": "Krissy DaRusso", "comment_text": "Train"}, {"username": "Sydney Chakalos", "comment_text": "Train"}, {"username": "Ville Lignell", "comment_text": "Italo trains have good deals if you book in advance."}, {"username": "Miyuki Kanno Paul", "comment_text": "We love Frecciarossa! No weight restrictions or luggage sizes. No security check. Just roll our suitcases and enjoy the ride. Yes it takes 4 hours to Milano Centrale, however, we rather not deal with any airlines unless it’s time to fly home. No luggage lost"}, {"username": "Glenn Todd Webb", "comment_text": "We took fast train from Milan to Naples. Loved it."}, {"username": "Jose Velez", "comment_text": "Anything is better than Ryan air"}, {"username": "Michela Zanni", "comment_text": "Freccia Rossa"}, {"username": "John Bruckman", "comment_text": "Freccia Rossa!!!"}, {"username": "Peach Panfili", "comment_text": "Are you kidding??? Train mate!!"}, {"username": "Pong Ac Ai", "comment_text": "Train"}, {"username": "Donna Gilardone Szwabowski", "comment_text": "Probably train, although Linate is an easy airport to use"}]}, {"id": "2203033456762399", "text": "Best recommendations for Gelato in Firenze please :) read that places with tin lids on the containers are better however not sure if this is the case. Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2203033456762399/", "likes": 13, "comments": [{"username": "Mack Sperling", "comment_text": "In Florence: Vivoli next to Chiesa Santa Croce."}, {"username": "Tracy Silva Samarjian", "comment_text": "My daughter studied abroad in Florence and loved this place. We went there a lot."}, {"username": "Marissa McLean", "comment_text": "The ones with tin lids are more authentic and have less additives, same with ones that don’t have monstrous mountains of gelato or vibrant colours"}, {"username": "Lisa Kelly", "comment_text": "All of it was good. I didn’t have any bad gelato."}, {"username": "Megan Bachman Pollenz", "comment_text": "Megan Bachman Pollenz"}, {"username": "Sheila Cabano", "comment_text": "Absolutely Gelateria Royale piazza santa croce. Taste and mention me 🙂"}, {"username": "Alex Kovacs", "comment_text": "Eduardo’s and Sbrinos!"}, {"username": "Janis Nunez", "comment_text": "Yes tin lids were the best!!!"}, {"username": "Cat Furness", "comment_text": "Perche’ No is amazing 🤩"}, {"username": "Cheryl Blewitt Slavik", "comment_text": "Tin lids preferred and look for artisanal in the name or description."}, {"username": "Melissa Gray", "comment_text": "This location was in the city centre. They also have a location across the river near Piazza St Spirito.\nhttps://\nwww.lasorbettier\na.it/"}, {"username": "Miyuki Kanno Paul", "comment_text": "Perche No"}, {"username": "Antonieta Murillo-Smith", "comment_text": "Venchi is delicious !!"}, {"username": "Angie M. Tarighi", "comment_text": "Best Gelato we had was il Gelato Di Caterina located on Via Roma by the Duomo."}, {"username": "Emma Chadwick", "comment_text": "Gelateria Della Passera"}, {"username": "Paulinha Cã", "comment_text": "Paulinha Cã"}, {"username": "Donna Dougherty", "comment_text": "Donna Dougherty"}, {"username": "Jessica Petyo", "comment_text": "Jessica Petyo"}, {"username": "Danielle Norberg", "comment_text": "Go to San Giminiano and go here and get (I can't remember the actual name, but its basically mint chocolate chip!) It had actual tiny mint chunks in it so it tasted like real mint, not artificial mint."}, {"username": "Laura St James", "comment_text": "Perche No is a must."}, {"username": "Patty Beemer", "comment_text": "My Sugar on Via Ginori. Better than Vivoli, and that’s saying a lot!"}, {"username": "Eli Verdone", "comment_text": "Vivoli\nGelateria dei Medici\nGelateria dei Neri\nGelateria della Passera"}, {"username": "Laura Natalini", "comment_text": "La Strega Nocciola,Vivoli\n, Badiani, Amorino"}, {"username": "Sam Haddock", "comment_text": "Recommended by a local, pistachio was absolutely amazing 🤩"}, {"username": "Blanca Gil", "comment_text": "La Strega Nocciola"}, {"username": "Lusiana Aibef", "comment_text": "La carraia"}, {"username": "Deborah Shaw", "comment_text": "La Strega Nocciola Gelateria Artigianale Firenze Duomo."}, {"username": "निनावी सहभागी", "comment_text": "Thank you all for your great recommendations\n, have tried a few and will try a few more before we leave :)"}, {"username": "Grg Cozzetto Oetterer Mra", "comment_text": "Gelateria dei Neri"}, {"username": "Rosemary D'Atri", "comment_text": "Perche No..."}, {"username": "Diana Sankara", "comment_text": "They may have lids or they may just look like this. Watch out for bright artificial coloring and you'll know what places to avoid"}, {"username": "Ken Lerch", "comment_text": "Vivoli"}, {"username": "Marie Barré", "comment_text": "Vivoli"}, {"username": "Lorri Orwig", "comment_text": "La Strega Nocciola is a great local gelateria right off the Ponte Vecchio. La Sorbetteria has amazing gelato and I think they are in a few locations."}, {"username": "Debbie White", "comment_text": "We spent today in San Gimignano… highly recommend going there for best gelato at the place in the square that says “World Champion”, not World’s Best. Lots of shops too."}, {"username": "Ed Lamb", "comment_text": "I had no bad gelato anywhere in Italy. Just enjoy!"}, {"username": "Linda Petursdottir Simonsen", "comment_text": "Amorino Gelato is incredible. https://\nno.tripadvisor.c\nom/\nRestaurant_Revie\nw-g187895-d1049\n0412-Reviews-Am\norino_Gelato_Fi\nrenze_Via_del_C\norso-Florence_T\nuscany.html"}, {"username": "Eileen Muro", "comment_text": "2 spots that I highly recommend is LA Strega Nocciola.....I tried the white Chocolate and cinnamon and it was amazing"}, {"username": "Meghan Tan", "comment_text": "You want to look for muted, natural colors- nothing that is too bright! Also avoid gelato that is piled high in the case."}, {"username": "Isabelle Avl", "comment_text": "1/ My Sugar (near mercato centrale)\n2/ Gelateria dei Neri (delicious and creative combination of flavors)\nI’m looking for not too sweet or creamy, amazing flavors (especially for licorice and pistachio) and creativity.\n3/ And I forgot about Gelateria La Carraia! (di fronte al ponte)"}, {"username": "Carol Taylor Tisdale", "comment_text": "Vivoli. Near Santa Croce."}, {"username": "Devery Dvorak Cavanaugh", "comment_text": "Perche ‘no"}, {"username": "Devery Dvorak Cavanaugh", "comment_text": "http://\nvivoli.it/en/\nhome-2/"}]}, {"id": "2203033523429059", "text": "Can anyone suggest a private ride service from Naples Centrale train station to Sorrento?", "link": "facebook.com/groups/1373361046396315/permalink/2203033523429059/", "likes": 1, "comments": [{"username": "Sandy Radican Shikaly", "comment_text": "Amalfi Coast Transfers are great!"}, {"username": "Stephanie Collier", "comment_text": "Aldo limos"}, {"username": "Mary Anne", "comment_text": "Guemar travel. Outstanding service."}, {"username": "Kate Carberry Ansart", "comment_text": "Top Excursion Sorrento was awesome!"}]}, {"id": "2203036583428753", "text": "Planning a trip the end of March 2024. Will it be too cold for coastal cities? Does a double bed mean something different in Italy? We are use to a king size bed.", "link": "facebook.com/groups/1373361046396315/permalink/2203036583428753/", "likes": 0, "comments": [{"username": "Elena Eugeni", "comment_text": "King size is a bit larger than matrimoniale, I think around 20 cm.\nMarch is perfect for traveling and sightseeing, but of course Lidi are closed since it's too cold to access the beaches"}, {"username": "Sandy Radican Shikaly", "comment_text": "Double means sleeps two people.. no way a king😳"}, {"username": "Giovanni Pianigiani", "comment_text": "Isn't double (doppio) just two single (separate) beds?"}, {"username": "Roland Trego", "comment_text": "If by \"too cold\" you mean you won't be able to swim, I would say yes. Do a Google search for \"sea temp [city name] March."}]}, {"id": "2203039016761843", "text": "Thoughts on hotels for family if 4 in Rome and by cruise terminal. Need both please.", "link": "facebook.com/groups/1373361046396315/permalink/2203039016761843/", "likes": 0, "comments": [{"username": "Sandy Radican Shikaly", "comment_text": "Rome is an hour away from Civitavecchia cruise port... are you looking for Rome or there?"}, {"username": "Connie Sue Mullenix Lytle", "comment_text": "Might consider one hotel stay in Rome, then take the one hour train ride to the port on embarkment day. That’s what we’re doing! Easier than changing hotels."}, {"username": "Janine Restivo D'Amato", "comment_text": "https://\nwww.twentyonerom\ne.com/"}]}, {"id": "2202871886778556", "text": "Hello,\n\nGlad to be in this group. I just wanted to share that I'm planning to go to Milan for 3-4 days at one friend's place.\nI am on a budget.\nCan you guys suggest which places I should visit in these 3-4आणखी days.\nPlanning:\nLugano(Switzerland) Don't know if I should go by train or bus.\nAny other places?\nI've already been to Venice, Bologna, Rimini.\nThank you.", "link": "facebook.com/groups/1373361046396315/permalink/2202871886778556/", "likes": 18, "comments": [{"username": "Gary W Anderson", "comment_text": "I’d go by train."}, {"username": "Stella Marie McManus", "comment_text": "If you’re based in Milan, you can take the train to Como, then get the ferries around the lake. Also take the train to Lugano."}, {"username": "Yasmine Marie", "comment_text": "We did this tour from Milan"}, {"username": "Yasmine Marie", "comment_text": "And this tour as well"}, {"username": "Yasmine Marie", "comment_text": "Highly recommend both. Yes it's a LONG day of 12 hours but you get to see and do so much. We also took the train for the day to Venice from Milan, it's super easy. You have to go to Milans Central station and it's a straight ride. We took the 7am train ride and had breakfast at the station and took a very late train back so we had the ENTIRE day there. The stop we chose, there's two in Venice, is Venezia Santa Lucia it's the last stop at the end by liberty bridge."}, {"username": "Etschi Bruckner", "comment_text": "Bergamo is lovely and not that far - and so is Brescia!"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Milan ha s already quite a lot things to look. Then Pavia, Bergamo, Crema"}, {"username": "Daisy Yoo", "comment_text": "Turin , Genoa"}]}, {"id": "2203049236760821", "text": "I am starting to plan the details of our October 3 week trip. I will be renting a car from FCO Rome airport. Can anyone point me in the right direction of what car rental agenicies are good or ones to avoid? After reading some experiences I don't want to risk being taken advantage of. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2203049236760821/", "likes": 1, "comments": [{"username": "Steve Grossman", "comment_text": "We always use avis"}, {"username": "Miyuki Kanno Paul", "comment_text": "Are you returning your car back to the location in FCO? If not, use google map to see where you can drop off. That’s where I start researching my prospective rental car agency"}]}, {"id": "2203051833427228", "text": "Salve! Could anyone please share their recommendations for drivers / transfers between Naples train station and our hotel in Sorrento? I will be travelling in October. Thanks in advance 😃", "link": "facebook.com/groups/1373361046396315/permalink/2203051833427228/", "likes": 1, "comments": [{"username": "Sandy Radican Shikaly", "comment_text": "Amalfi Coast Transfers!"}, {"username": "Stephanie Collier", "comment_text": "Aldo limos very reliable"}, {"username": "Mary Anne", "comment_text": "Guemar travel. Great service."}, {"username": "Jake Calderan", "comment_text": "Thank you 😊"}, {"username": "Bev Madill", "comment_text": "I'd highly recommend Transferelax. I used them in June. Efficient and very easy to deal with."}]}, {"id": "2203062383426173", "text": "Anyone know much about Tim sim cards? We purchased the tourist sim for all of Europe while in Rome. Worked in Rome and France for about 2 days and hasn't worked since. We are now in Portugal but as soon as we got to Spain it stopped working. Data roaming is on. It just displays an R. Have tried calling tim but can't get anyone that speaks English.", "link": "facebook.com/groups/1373361046396315/permalink/2203062383426173/", "likes": 0, "comments": [{"username": "Michelle Bartsch", "comment_text": "Not sure about that company, but I do work for a telecom. When moving from country to country you may need to do a network reset in order for it to switch to the new towers."}, {"username": "Frannie Kaplan", "comment_text": "Maybe you need to reconfigure the APN or Portugal opted out of that plan. Probably the first"}, {"username": "Hussein Karout", "comment_text": "Buy an esim from flyesim app"}]}, {"id": "2203050900093988", "text": "I’m doing a little trip to Verona, Vicenza, Padua and Mantua in November (one week). Can anyone suggest places which I’d be stupid NOT to visit - I loathe getting back for someone to say “you did see xxxx, didn’t you?!”\n\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2203050900093988/", "likes": 0, "comments": [{"username": "Stefano Zordan", "comment_text": "In Vicenza\nBasilica Palladiana, Teatro Olimpico, Villa La Rotonda"}, {"username": "Alice Francesca", "comment_text": "http://\nwww.cappelladegl\niscrovegni.it/\nindex.php/it/"}, {"username": "Pietro Adami", "comment_text": "Search “Verona” in this group and you will find a suggested walking tour for Verona in one of my replies to someone’s post (including suggestion for lunch or dinner)"}]}, {"id": "2203062283426183", "text": "Hi, I’m new here, husband and I will be spending 8 days in Italy in 4 weeks, never been before. Initially we had planned for 1 night Venice (flying into and starting here) , 2 nights Florence, 3 nights Rome, and 2 nights amalfi coast. I’m afraid we might be trying to cover too much ground and the trip will be hectic as well as load time traveling.आणखी I’m so torn because we obviously want to see as much as we can, has anyone completed and enjoyed a crazy itinerary like this? Thinking of maybe skipping Venice and just focusing on Florence/Rome/Amalfi coast. Any recommendations?", "link": "facebook.com/groups/1373361046396315/permalink/2203062283426183/", "likes": 13, "comments": [{"username": "Jeff Gentner EA", "comment_text": "It's doable but there's a huge difference between SEEING Italy and EXPERIENCING Italy. You'll see a lot but experience little. We've been to Italy 4 times now and each time we never stay less than 3 days in each location, usually 3 nights. People forget about travel time and unexpected delays."}, {"username": "Maureen Rebello Hagerty", "comment_text": "I would do at least 2 nights in Venice, three on Florence and 3 in Rome. Amalfi coast is nice but I wouldn’t try to squeeze in in with so little time and all that travel between cities. This is coming from\nSomeone (me) who tried to see it all my first trip which was 16 days, because I never thought I’d get back again. And I’ve been back many times"}, {"username": "Suzi Henry", "comment_text": "I would add a night to Venice, as most have recommended. I would likely drop one of the other locations for the best experience."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Don’t miss Venice. Omit the Amalfi Coast this time and spend a few days in Venice."}, {"username": "Grace Sulsenti", "comment_text": "I see your plan as fine.\nWe were in Venice once. Never really interested in returning.\nBut Sorrento & Amalfi- cannot get enough. Loved it!"}, {"username": "David King", "comment_text": "It’s an aggressive itinerary, but we did this:\nFlew into Venice.\n—3 nights in Venice, then all day train to Rome\n—3 nights in Rome… then train to Florence\n—3 nights in Florence (day trips to Tuscan towns and Siena), then train to Bologna.\n—3 nights in Bologna (with daily train daytrips to Verona and Ferrara).\nTrain back to Venice to fly home.\n\nI could have shortened the Bologna stop to one day/night… and possibly cut one of the nights in Florence. However, the further south of Rome you go will really eat up time from your 8 days that you are planning."}, {"username": "Alana Marie Sult", "comment_text": "Personally me, split between Florence and Rome. Don't forget gnocchi at Osteria Santo Sprito and gelato after at La Carraria in Florence and after visiting the Pantheon in Rome stop by Sant' Eustachio for espresso and some \"lobster tails\""}, {"username": "Laura DeCicco", "comment_text": "Venice, Florence and Rome. Skip the Amalfi coast this time"}, {"username": "Pam Gerretsen", "comment_text": "If you are flying in to Venice, then definitely spend more time there. You could do Florence, with day trips to Pisa and/or Lucca, Siena, Orvieto? If you know you are aiming for another trip, fly in to Rome next time and do that, combined with Naples/Pompei/\nAmalfi?\n\nPersonally, I like taking time to just wander, see where we end up. Last week we stayed about 10 minutes from Pompei (first visit to that area) and we went to the local cafe and pizza places every day, chatted with the owners, and got to join the locals in their celebrations of the Madonna- it was so lovely to be part of, and completely unexpected. But I realise everyone is different, do consider what's important for you to see and experience, without pushing it too much."}, {"username": "Shelly Kentner Lehman", "comment_text": "No way you should do all that not enough time.we had 21 days and it was rushed trying to go to many places. Pick a couple places only and hopefully able to do another trip to cover some other places."}, {"username": "Marie Payne", "comment_text": "I agree way too much....dont go to Amalfi ...save that for another time..."}, {"username": "Diana Smith", "comment_text": "You can do this. Especially because I’m 4 weeks things will slow down a bit. Have fun…:)"}, {"username": "Jill Wolder", "comment_text": "How are you traveling from place to place? Venice is magical . Like no place on earth. Are you interested in art ? History? Architecture? Museums? Do some research and then make your edit. Ending on amalfi coast is perfect"}, {"username": "Lauren Ako", "comment_text": "Amalfi is gorgeous but very crowded. i did 2 nites in Rome , 5 nites Positano. we had a wedding there), flew to Genoa. 2 nites in Santa Margherita Ligure.. went to Cinque Terre for a whole day, Florence 3 nites, Bologna 1 nite.. London 8 hours. I felt rushed.. but was a great trip!"}, {"username": "Kit Nader", "comment_text": "Venice is utterly unique ...I'd never skip venice!"}, {"username": "Don Bentivoglio", "comment_text": "A single night in Venice would be a waste of time. Either spend 2-3 nights or skip it."}, {"username": "Kate Carberry Ansart", "comment_text": "We did a 14 day trip to Rome/Florence/\nAmalfi in June and we needed all 14 days to really enjoy each area. We did 4 nights in Rome, 3 nights in Florence and 5 nights in the Amalfi Coast. We wished we had had more time in Florence. The tricky thing about the Amalfi coast is that it isn’t super easy to get to. I would recommend that anyone going there spends at least 5 nights to really be able to see all of the towns and visit Capri.\nWith 8 days, I would split my time between Florence and Rome!"}, {"username": "Barbara Bastianini", "comment_text": "The best advice I can give you is to make your itinerary fit your time frame. Don’t try to make the time fit your ideal itinerary. Because most things can be done, at least logistically. So you’d be able to get to all these places in the time indicated but you certainly won’t have enough time to explore them or to get to know them in any meaningful way. You’ll spend too great a portion of your time transiting from location to location to actually absorb the charm of any place.\n\nEveryone’s different of course but I don’t go abroad to spend my time on trains, on planes, or in a car. I go to experience a different culture, to learn new things, to be enriched, and to enjoy myself. Those things happen from “boots on the ground exploration,”\nnot from rushed transiting around.\n\nKeep in mind that there’s a huge difference between “seeing” something and experiencing it. An itinerary that crams too many places into too few days doesn’t allow for much experiencing. You might have the time to rush from one tourist spot to the next so you can wrap things up in that location just to move on to the next location that you’ll also have to rush through to move onto your next stop. In my book that’s just not pleasant. To let these places work their magic on you you should slow it down a bit. Allow yourself the time to do these types of things; 1. to stroll various neighborhoods at will with no goal in mind, just absorbing the unique charm. 2. To watch a sunset. 3. To enjoy a drink while people watching on a busy piazza. 4. To strike up conversations with locals. 5. To sample every gelato shop you stumble on. 6. To pop into any little mom and pop store that interests you. 7. To wander narrow twisty streets at night until you’re hopelessly lost, then to somehow miraculously find your way back. 8. To detour from your itinerary when something unexpected interests you. And 9. To kick a soccer ball around with a group of kids. These are the things that you sacrifice by moving too quickly. They might seem like small things but when you look back on your travels you find they’re somehow the most important things. These are the things that are fun. That you’ll enjoy doing. Rushing around to see the so called highlights isn’t very much fun & is actually stressful and causes exhaustion.\n\nFor what they’re worth these are my thoughts\n\nSince you’re landing in & leaving from Venice it only makes sense to spend some time in this magical, mystical place. You’re landing there so you can visit it without incurring any additional transportation costs or wasting additional hours transiting to it. You’ll be landing in a unique place that’s one of the most visually stunning cities in the world. So spend a couple days having fun there!!\n\nFlorence and Rome also each deserve more time. (And most importantly, you yourself deserve more time in each amazing place.) So I’d eliminate the Amslfi Coast. Not because I don’t like it, because I do, but because it’s geographically the outlier here. It’s not near your other target locations so going there will make it take longer to get back to Venice for your return flight. Eliminating your farthest flung destination will mean fewer hours spent in transit and more hours available for exploration elsewhere. Plus you’d have two days to pay with. I’d add one of those days to Venice and 1 to Florence. I honestly think you’d enjoy yourself much more that way.\n\nOne thing to remember is to account for travel time when planning. Each time you change cities you’re going to lose one half to one full day of sightseeing time. You have to add the actual number of scheduled travel hours (say two by train just as an example) to the time it takes to check out of one hotel and travel to the station. Then add the time it takes to travel through the streets of an unfamiliar city to get to your next hotel and check in. In even the best case scenario thst two hour train ride actually takes up a good 4 hours of the day. And quite often you won’t have the best case scenario. Because trains, planes, etc can be delayed or run late, you might encounter a train strike. You might hit a traffic congestion getting to your new hotel. So depending on how things go the 2 days you’re allotting to Florence, for example, will actually only be 1 and a half days of sightseeing. And you lose that much time (or probably more) each and every time you change cities.\n\nI don’t want to be negative but I thing it’s important you understand the realities of so much transiting around.\n\nNo one can do everything on any one trip. The key to a successful trip is to do as much as you can realistically do while still having fun in each place. I think your itinerary doesn’t allow for much fun so it should be tweaked to allow time for that.\n\nBut again everyone’s different. You have to design an itinerary that suits you."}, {"username": "Lucrezia Folger", "comment_text": "Skip Amalfi Coast. You'll be back. Venice, Florence, and Rome are more of a travel flow for that short amount of time. 2 nights Venice, 3 nights Florence, 3 nights Rome."}, {"username": "Carol McDonald", "comment_text": "That's a lot, it's possible, but hectic. You don't have to do all that in 8 days, you'll go back, I guarantee it."}, {"username": "Charleen Siegler Schuss", "comment_text": "2 nights in Venice, 2 nights Florence 4 nights Rome with a day trip to Pompeii. There is so much to see in Rome, you will be jet lagged in Venice so 2 nights and Amalfi coast is for the next tim3"}, {"username": "Leanna DePizzo", "comment_text": "Thanks everyone, I found your comments super helpful and I think we decided on Venice for a longer period of time, Florence with a trip out to cinque Terre and finish out in Rome for the biggest chunk. We will catch Amalfi Coast next time we are out there and focus more on the north this go round 🙂"}, {"username": "Khushi Khanna", "comment_text": "I would include Venice and skip Amalfi coast ."}, {"username": "Chrystal Stevens Bisonet", "comment_text": "If you’re not already, join the group “Italy with Kids.” So good!"}, {"username": "Tracy Piko Lawniczak", "comment_text": "Remember the travel time between all these places etc. yes trying to see everything is want we all want just have to go with how you feel as far as I’m the go constantly"}, {"username": "Jo-Anne Redwood", "comment_text": "We do crazy too so we know what where on our next trips. Do what you’re comfortable with knowing you’ll only get a trailer, not the whole flick."}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "In Venice now. So beautiful, I'd hate for you to miss it. A taste of a place is better than not being there. You'll be tired in the end, but glad you saw what you did."}, {"username": "Phyllis Snyder", "comment_text": "Probably skip Amalfi-"}, {"username": "Megan Sampson Olson", "comment_text": "Last summer we took our daughters, who had never been before. We flew into Rome and did three days there, three days Venice and four days Florence. In Florence we did a Tuscan day trip (where you see Pisa and ancient, walled cities.) it was a perfect intro to Italy trip for them. This summer, we are doing an Amalfi week. You don’t want to spend your whole trip packing and getting from one place to another. Enjoy🇮🇹"}, {"username": "Mary Lou Gillen", "comment_text": "I’ve wondered about this for a while now. Why don’t people fly what use to be called “open jaws”? For instance landing in the first town of your itinerary and fly home from your last town in your itinerary?"}, {"username": "Rachael Richardson", "comment_text": "We did 2-3 nights in each destination, it’s very doable.\nI’d skip amalfi and rather do the north ! But that’s just me\nSave amalfi coast and capri fir another time"}, {"username": "Bea Kuckens", "comment_text": "You should decide ASAP and reserve lodging and trains since it will be peak season."}, {"username": "Gina Rovello Keenan", "comment_text": "I would skip Amalfi coast this trip. One night in Venice on day of arrival won’t allow you to see very much. I suggest 2 nights in Venice, 2-3 in Florence and the rest in Rome."}, {"username": "Karen Blackmore", "comment_text": "Where are you flying home from? Personally I would NOT skip Venice, it's so unique."}, {"username": "Doug Burke", "comment_text": "Too much for the time budgeted. I know that it's a great temptation to try to cram in as much as possible but that comes at the expense of not absorbing the things about Italy that can't be photographed."}, {"username": "Franchelle Dorn", "comment_text": "If it’s your first time, get a taste of everything on your itinerary. I certainly wouldn’t skip Venice."}, {"username": "Lisa Wylin", "comment_text": "From my experience, do a professional tour. I’m thinking me and my husband hopefully next year, do a 9-12 day tour, then venture out on our own for a couple weeks. Just my opinion. Tours are the bomb, they do all the work, just pack your bags and enjoy. (I’ve done two ITALY tour with Collette👍)!"}, {"username": "Jerry Lyubelsky", "comment_text": "8 days yes will be too rushed we did that same itinerary in 2019 in 10 and that was perfect. Can you add days OR skip Venice and do it another time with Milan and como"}, {"username": "Alicia Cox", "comment_text": "Only do 3"}, {"username": "Carol Taylor Tisdale", "comment_text": "Agree with others. Skip Amalfi. Definitely add to Venice. Two full days in Florence is doable but you need no less than 3 full days in Rome. Even then... it's a lot to absorb in just 8 days."}, {"username": "Anna Gambino", "comment_text": "Skip either Venice or Amalfi. Amalfi is a lot of territory to cover if that helps you decide."}]}, {"id": "2203078413424570", "text": "Ask for a limoncello spritz in Italy… DELICIOUS!! 🍋🍋", "link": "facebook.com/groups/1373361046396315/permalink/2203078413424570/", "likes": 535, "comments": [{"username": "Melissa Butchbaker Clos", "comment_text": "Yes!!! So good!!!"}, {"username": "Jessica Nichols", "comment_text": "Hugo spritz is my JAM. I love those! I don’t like Aperol"}, {"username": "Paula Butler", "comment_text": "Marla Doane. Yummmm"}, {"username": "Kaye Cockins Harris", "comment_text": "Can’t wait!!! Aug. 20 here we come❣️"}, {"username": "Gretchen Abee Rombold", "comment_text": "My favorite! So refreshing at the beach!"}, {"username": "Renee Rundle Stoneham", "comment_text": "This became my new favorite spritz!\nLove Aperol, but this was so refreshing.\n\nHugo’s are wayyy too sweet for me!"}, {"username": "Francesca Beattie", "comment_text": "Victoria Beattie"}, {"username": "Angel Deslandes", "comment_text": "Allison Stahl"}, {"username": "Richie Agar", "comment_text": "Amanda Agar"}, {"username": "Lisa van Trigt", "comment_text": "Jørgen Schildkamp Euhhhhh… 🙈😅😜"}, {"username": "Kirsten Patterson", "comment_text": "Esther Fankhauser"}, {"username": "Lyn Pappas Dahm", "comment_text": "My favorite"}, {"username": "Stacy Giammarino Betty", "comment_text": "Jessica Bender 🤤 🍋"}, {"username": "Eileen Milazzo-Elliott", "comment_text": "Allison Elliott"}, {"username": "Fiona Dunn", "comment_text": "Paige Dunn"}, {"username": "Chantal Adams", "comment_text": "I know!!!! Better then the regular spritz!!"}, {"username": "Dianne Kelly", "comment_text": "That's all I drank!! Yummy"}, {"username": "Anel Cruz-Hernandez", "comment_text": "Delicious 😋"}, {"username": "Annette Tamminga", "comment_text": "I drink those in Wisconsin but no doubt they are better in Italy."}, {"username": "Lesley Williamson", "comment_text": "Hugo spritz today in Garda .Absolutely gorgeous 😍"}, {"username": "Guelmy Edington", "comment_text": "The best 😍"}, {"username": "Shelly Seifert Lettieri", "comment_text": "Try the Hugo spritz"}, {"username": "Barbara Good", "comment_text": "Tiffany Smith 🍋 🍸"}, {"username": "Melanie Mccullagh", "comment_text": "Bob McCullagh"}, {"username": "Kylie Stefanile-guille", "comment_text": "Adrian Stefanile this is the one for me 😆"}, {"username": "Abigail Greetham", "comment_text": "Eve Cullen"}, {"username": "Michael Bigelow", "comment_text": "Ricky Martinson damn I bet this would have been nice on those hot days"}, {"username": "Katie Anne", "comment_text": "A Hugo is great too! Both so much better than Aperol."}, {"username": "Laura Allain", "comment_text": "My favorite! 🍋"}, {"username": "Jeannette Smith", "comment_text": "Tracy Storer worth a try. 👍 🍋 🍋 🍋"}, {"username": "Lorena Vaccaro Golias", "comment_text": "Kaitie Rose 😋 soon!"}, {"username": "Nilza Mercado", "comment_text": "Elvin Mercado"}, {"username": "Jackie Stapleton", "comment_text": "Aleksandra Chudzyńska-Fuja\nr 👍 xxx"}, {"username": "Cynthia Peraza", "comment_text": "We found them in Florence by the duomo so good"}, {"username": "Luciana Raica", "comment_text": "Hugo spritz is the best, once you try it🍸🥳"}, {"username": "Kuusik Aimi", "comment_text": "😎"}, {"username": "Laura Little", "comment_text": "Yes my favourite drink of my holiday!"}, {"username": "Yvonne Lopez", "comment_text": "Brittney Ziemniak Patricia Ellis"}, {"username": "Len Marturano", "comment_text": "I’ve made these. They are delicious! Can’t wait to go in the fall and alternate these with Aperol spritzes!"}, {"username": "Mary Palazzolo", "comment_text": "So good I got one from the wine window in Florence"}, {"username": "Lisa RC", "comment_text": "Delicious 😋 I now drink it in the states ! 🍋"}, {"username": "Nana Esther Bertolino", "comment_text": "Nana Esther Bertolino"}, {"username": "Paul Olson", "comment_text": "And so refreshing in the summer heat!"}, {"username": "Michelle Evans", "comment_text": "Ashleigh Bennett we are so having these 🇮🇹"}, {"username": "Prue Sutton", "comment_text": "Karen Shepherd Jillian Rogers"}, {"username": "Cindy Neilson", "comment_text": "... the other popular drink is the aperol spritz"}, {"username": "Lisa Boyes Cooper", "comment_text": "Had 3 and it put me on my ass. Be careful with the strength of these drinks. Can be dangerous"}, {"username": "Rosy Valentine", "comment_text": "Yes they are"}, {"username": "Mon Cher", "comment_text": "Nicole Bortolotti"}, {"username": "Kristie Kennedy Wolfe", "comment_text": "My favorite drink while there…. Other than wine!"}, {"username": "Chris Wallsten Kennedy", "comment_text": "Pat Knapp-Wallsten"}, {"username": "Mary Mavraganis", "comment_text": "What is hugo spritz?"}, {"username": "Lisa Gregory", "comment_text": "Jayne Brown-Boer"}, {"username": "Meg O'Toole Grande", "comment_text": "Liz Pretorius, Jacqueline Grande Mullen, Jo McIntosh, Vickie Piacentini and Lisa Eskew Grande I miss these !!!!"}, {"username": "Carla Jane", "comment_text": "Tanya Wyllie ok then😆"}, {"username": "Valmae Carvolth", "comment_text": "Leisa Stevens you and Bren will be into these😁😁"}, {"username": "Belinda Watt", "comment_text": "Kerri Shooter"}, {"username": "Aaron Dean", "comment_text": "Amanda Dean Tena Deans Tony Deans will have to try these"}, {"username": "Paweł Kiepel", "comment_text": "Ask for cedro spritz also... 😍"}, {"username": "Ann Hoyle", "comment_text": "Stacie Lee"}, {"username": "Nicole Gouzoules Sheehan", "comment_text": "That and Hugo Spritz!"}, {"username": "Nicole Condemi", "comment_text": "Hugo was pretty delicious too! 😋"}, {"username": "Caitlyn Rose Feder", "comment_text": "how good are the Hugo spritz!!"}, {"username": "Cindy Breneman Hattrich", "comment_text": "I will get one In august!"}, {"username": "Frances McDonagh", "comment_text": "And Aperol and pistachio liquor 😍😋"}, {"username": "Julie Dellasega", "comment_text": "Here’s a great recipe!"}, {"username": "Simon Stiff", "comment_text": "Jacky Stiff"}, {"username": "Tara Clary Bradshaw", "comment_text": "Once we discovered those, that’s all we ordered. No more aperol spritz for us 🤣"}, {"username": "Sue Fiore", "comment_text": "I add Lemon San Pellegrino instead of Soda to make it more lemony 👌"}, {"username": "Kate McKenzie", "comment_text": "Hannah Bills"}, {"username": "Lupita HC", "comment_text": "Try Hugo spritz, it is also delicious 🤤"}, {"username": "Julie Brazil Dixon", "comment_text": "Tonya Wratchford Kelley 🤣"}, {"username": "Ella Luna", "comment_text": "Yum 😋"}, {"username": "Alice Francesca", "comment_text": "Hard to find anywhere else but the Amalfi coast, where limoncello is from.."}, {"username": "Louise Todd", "comment_text": "Mandy Harrison 🥂"}]}, {"id": "2203079836757761", "text": "We are planning a family vacation next year (late May/early June) and have been back and forth on an itinerary. We tend to enjoy splitting out vacation time between a city and then a more laid back environment. We were looking at Rome-Florence-Cineque Terre for 9 days but now considering splitting time between Rome and Amalfi. I know a day inआणखी Florence won’t do it justice but are there day trips from Rome-Florence that anyone would recommend. And, from Amalfi, is there a day trip that anyone would recommend such as Naples of Capri or someplace else. Thank you for any suggestions!", "link": "facebook.com/groups/1373361046396315/permalink/2203079836757761/", "likes": 3, "comments": [{"username": "Rachael Richardson", "comment_text": "I’d choose Tuscany region and Florence over amalfi"}, {"username": "Marisa Miric Cox", "comment_text": "If you have to do a day trip, Capri, but truly Sorrento, Amalfi & Capri requiere 3-4 days minimum- they are magic beyond anything."}, {"username": "Elyssa Gross", "comment_text": "We did Venice, Cinque Terre, Florence, (Pisa for a couple of hours) and Florence for 9 days this past May"}, {"username": "Susan Lowry Lamb", "comment_text": "It's entirely possible to take the train from Rome to Florence and play on your own if you're interested. It's worth a peak. Often I've had my best luck asking the hotel about day trips, after I've arrived. They know the best ones."}, {"username": "Gregg Pires", "comment_text": "We are 5 people going to Florence, Rome and Amalfi Coast for 2 weeks in September. We used Joe Banana Limos...great people and very reasonably priced and extremely honest.."}, {"username": "Gregg Pires", "comment_text": "https://\nwww.joebananalim\nos.net/"}, {"username": "Maureen Rebello Hagerty", "comment_text": "from Tuscany soooo many beautiful small\nTowns to visit. Lucca. San Gimignano. Siena. The list goes on. I’d choose those any day over the Amalfi coast and Amalfi is my favorite Amalfi coast town lol"}, {"username": "Alana Marie Sult", "comment_text": "Personally could spend most of that time in Florence and Tuscan cities..I would do Florence with some day trips from there and the rest in Rome."}, {"username": "Kate Carberry Ansart", "comment_text": "We did a family vacation in early June for 14 days - Rome/Florence/\nAmalfi Coast. If you want a city and a laid back environment, I would recommend Rome and then a smaller town on the Amalfi Coast. (Positano and Amalfi are great to see, but we loved staying in Conca dei Marini because it was relaxing, quiet and filled with Italians!) We are glad we visited Positano and Amalfi, but definitely would not have had as an authentic experience as we did in Conca. 4 days in Rome is awesome - no day trips required! Too much to see and do there. 😊 While in the Amalfi Coast, definitely visit Capri! We took a private boat tour around the island one day and it really was the highlight of our vacation! We used the company called Amazing Capri Tour - you can find them on Facebook. 😊"}, {"username": "Lucrezia Folger", "comment_text": "9 days isn't much. I wouldn't do day trips with that short amount of time. Stay in Rome, Florence, and Cinque Terra. That is plenty."}]}, {"id": "2203082070090871", "text": "Hi everyone,\nWe are staying in Praiano for 4 days at the beginning of September. We have plans to visit Positano, Amalfi and Ravello as well. I’ve heard the SITA buses are a nightmare.\n\nAre the buses really that bad?\nHow expensive is it to take a taxi back and forth everyday?\nAre the scooters dangerous and how much do they cost?\nMy husband is a bodybuilder at 275 lbs, do the scooters have weight limitations?\n\nJust trying to figure out the best way to travel in between towns on the coast. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2203082070090871/", "likes": 1, "comments": [{"username": "Brad Nelsen", "comment_text": "Buses are fine; people overreact! Just get a timetable (there is a Tourism Office in Praiano); but your tickets before your trip from the ceramics store 100m from Bus Stop 7 and you’ll be fine. The SURA is air conditioned unlike the smaller Global Mobility bus."}, {"username": "Julie Agarkov Mayblyum", "comment_text": "I stayed in Praiano 10 years ago and used SITA buses all the time. They were not a nightmare, completely fine then…. Hopefully they still are"}, {"username": "Andrea Bourke", "comment_text": "We are in praiano now have caught multiple sita buses to link with ferries and it has all been fine ...mind you we did have a car hit one of buses we were on yesterday but apparently that is not unusual 🤣"}, {"username": "Caitlin Adamz", "comment_text": "Buses are fine!! Amazing views and way more relaxing to just let it all pass by. Sit on the right side."}, {"username": "Celia Minnucci", "comment_text": "We stayed in Praiano and caught the SITA busses, they are fine and very easy to go up and down the coast, no issues. It felt a lot safer than being on a scooter (the roads are tight and there are a lot of close calls)."}, {"username": "निनावी सहभागी", "comment_text": "Thank you everyone for your feedback! This makes me feel a lot better"}, {"username": "Gay Polt", "comment_text": "Following- we’ll be there next year!"}]}, {"id": "2203082726757472", "text": "We are planning on taking a train from Venice and staying on Lake Garda for a few days. Is it better to stay in the towns that are right off the rail line? For example,if we wanted to stay in Limone Sul Garda (at the top of the lake) how would we get there after we get off the train? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2203082726757472/", "likes": 2, "comments": [{"username": "Alice Francesca", "comment_text": "Are you going in August? It will be super busy! I lived there, in Salò. Better get off and sleep in Desenzano (more hotels etc) and take ferries to get around.Limone is ok but the most beautiful sights are in Riva del Garda , Malcesine, Isola del Garda, Sirmione.\nMaybe a little less crowded up north, Riva del Garda."}, {"username": "Claire Dowson", "comment_text": "You can pick up a fast boat to get to the north of the lake at 14.20 and gets into its last stop at Riva at 16.35. I actually preferred the bus. Cheaper and goes right along the side of the lake. Pick that up outside the rail station."}, {"username": "Stefano Bressanelli", "comment_text": "Take the boat from Desenzano del Garda. Ciao"}, {"username": "Karen Blackmore", "comment_text": "We stayed in Lazise, and got a taxi from the station. There are buses that run alongside the lake too."}, {"username": "Michelle Dougherty", "comment_text": "I would recommend staying in Desenzano and just using the ferries or private boats to visit the other towns if you are not planning to have a car.\nWith traffic during season (April- September) it can take me the same amount of time to drive from one side of the lake to another as it would to get to Milan.\nBoat is much better and far less of a headache. Bonus points, you won't hear me yelling in both English and Italian at all the other cars 😂😂"}]}, {"id": "2203089526756792", "text": "Just wondering if anyone has tried to capture a family photo while in Florence? My kids are grown & live in different states, just thought it might be a nice opportunity while on vacation together", "link": "facebook.com/groups/1373361046396315/permalink/2203089526756792/", "likes": 0, "comments": []}, {"id": "2203133136752431", "text": "Hi Everyone! What website you are using for booking ferry tickets from Naples to Sorrento? Can we get them at the marina before departure or better to prebook?", "link": "facebook.com/groups/1373361046396315/permalink/2203133136752431/", "likes": 1, "comments": [{"username": "Dave Conroy", "comment_text": "Trainline, Omnio, ferryhopper. Seems sensible to get them in advance, either well in advance or just before to avoid risk of waiting."}]}, {"id": "2203089766756768", "text": "Just about to finish our 5 day trip to Rome from Ireland and we loved it. I loved this group it made the build up to the holiday more exciting if that's possible. All I can offer is that remember everyone's experience will be different as they are staying in different parts of Italy. Your perspective is everything go with the flow and enjoy your break in one of the most beautiful cities. On our trip we had nothing booked but managed we got a two day hop on hop off bus to find out bearings and succeeded in doing most of the big sights like the Colosseum, Palatine Hill, Roman Forum, the Vatican city, Spanish Steps, Trevi Fountain and so much more in between which were all amazing. A massive highlight for me was Villa Borghese this is a fabulous park in the centre of Rome. My husband is a runner and wanted to experience a run abroad so we headed to the park where he proceeded to do his 10k madness I know not for everyone but myself and my daughter scrolled around the park. After a quick stop back at the hotel for his shower we went back to Villa Borghese where we spent the afternoon taking a trip on the little train around the park, a boat trip on the lake which I loved, we visited the Borghese gallery ate lots of gelato. You can also hire bikes golf carts visit the zoo etc. Definitely worth taking time away from the hustle and bustle of the city. We also took a trip out to The Olympic Stadium home to Roma and Lazio which was very reasonable for any football fans. My husband likes to visit the major stadiums in any big cities we visit. Other than that we just scrolled around Italy soaking in the atmosphere, eating and drinking all the fabulous tastes of Italy. I highly recommend if you're visiting Trevi Fountain to eat Pinsitaly Trevi via della Panetteria 12, an absolute gem of a restaurant with very friendly staff and very reasonable. Also we had a fabulous meal at Andrea via Castelfidardo, 30 Roma. The best tip is to bring a bottle to keep refilling at the many fountains around an absolute life saver in the heat. Clocking up Over 20,000 steps a day you will enjoy every pizza, pasta, and gelato you consume. Enjoy Rome it has so much to offer.", "link": "facebook.com/groups/1373361046396315/permalink/2203089766756768/", "likes": 89, "comments": [{"username": "Tracy Foss", "comment_text": "Thank you for sharing! Great suggestions"}, {"username": "Brenda Barrett Dunphy", "comment_text": "You're welcome 😊"}, {"username": "Lisa Jones", "comment_text": "Great post! We loved spending the day at Villa Borghese and all of the galleries in that area too, and we saw some runners😁 they looked so hot😁😁😁 We didn't run in Italy, it was too hot for us, just lots of walking❤️"}, {"username": "Sylvia Martinez", "comment_text": "Thank you for sharing!"}, {"username": "Bonnie Rupprecht", "comment_text": "Very nice"}, {"username": "Beth Heys", "comment_text": "I still haven't got to Villa Borghese after 5 times in Rome. Guess I will have to go back again!"}, {"username": "Katherine AliNuñez", "comment_text": "How was the hop on hop off the bus? I don’t have anything booked for Rome either"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2203090566756688", "text": "We go away every year in Italy in November as its our anniversary my husband has booked Napoli we arriving by train near the centre we have been before and done the normal attraction but we would like to know where to go in the city and take a ferry to’ isca or other islands any suggestions please", "link": "facebook.com/groups/1373361046396315/permalink/2203090566756688/", "likes": 1, "comments": [{"username": "Iliana Zlatareva", "comment_text": "Ischis, Capri and Procida, Amalfi also"}]}, {"id": "2203093410089737", "text": "I am interested in going to Pisa but have seen many of you suggest Lucca instead. I will be staying in Florence so seems possible to see both by train in the same day (eg Florence to Pisa, Pisa to Lucca, Lucca to Florence). Do you agree, and if so, is it necessary to purchase train tickets in advance? Thanks for your help!", "link": "facebook.com/groups/1373361046396315/permalink/2203093410089737/", "likes": 12, "comments": [{"username": "Esther Steinbok Sustersich", "comment_text": "I did both. I went from La Spezia."}, {"username": "Jenna Oatsvall", "comment_text": "We did both in one day; spend more time in Lucca, though. We left Florence early in the morning and it ended up being about a 12 hour day trip. It's very doable!"}, {"username": "Ron O'Brien", "comment_text": "I saw both as a relatively easy to do day trip via train from Florence. Quick stop in Pisa and much longer stop in Lucca. Leave early and come back late."}, {"username": "Louis Des Forges", "comment_text": "The trains are just regional trains-no point of buying in advance as you cannot reserve a seat and the price is the same whether you buy weeks before or 10 minutes before departure."}, {"username": "Nancy Gottesman Mann", "comment_text": "We did both in one day from Florence."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "I wrote a post about Pisa with everything you can see and a walking itinerary from the train station (you can search with the lens), I suggest you to visit all the 3 monuments around the Tower (instead it’s not really important to climb the tower).\nIn Lucca there is not much specific to see except to town is really nice and you can rent a bike and ride around on the city walls.\nI usually suggest to visit Lucca in the morning as Pisa in the morning is overcrowded with 10 minutes influencers and visitors who just want to take a selfie with the tower."}, {"username": "Julie Roberts Clark", "comment_text": "Do both— we did.\n\nWe took a train from Florence to Lucca and spent most of the day there. Left Lucca around 5pm and took the train to Pisa- walked to the tower and took pics (specifically take the train to the stop closer to the tower, it’s not the main one), then back to the train station and train back to Florence in time for dinner!"}, {"username": "निनावी सहभागी", "comment_text": "Thank you all! I am considering this tour: https://\nwww.ciaoflorence\n.it/en/\ntour-detail/199. Thoughts?"}, {"username": "Caitlin Adamz", "comment_text": "You can see Pisa and Luca in one day. Very common day trip. I really like the Italy guidebook by Rick Steves for guidance on the logistics and transportation instructions. I remember he talks specifically about this."}, {"username": "Laura DeCicco", "comment_text": "You can do both and it’d be a shame not to see Pisa while you’re so close"}, {"username": "Daisy Yoo", "comment_text": "No need for tour , we are doing Pisa/Lucca , start early and when u get to Pisa , take a local bus to get to the center instead of walk to , save 20 mins , then u head to Lucca and rent a bike , plenty of time to do both in a day"}, {"username": "Blanca Gil", "comment_text": "You can do Pisa and Lucca in a day. Leave for Pisa early and that way you can have the afternoon in Lucca. Both cities are enjoyable!"}, {"username": "Tess Galinato Perez", "comment_text": "Hi. This itinerary is easily doable in one day by train. Pisa is a quick trip then head to Lucca right away. Although IMO, Lucca is worth more than just a daytrip (I actually stayed in Lucca 2 years in a row, instead of Florence), you can get a quick overview if you spend an afternoon. Create an account with Tren Italia and download the app as this is the best way to get your tickets. For short distances like this itinerary, I don't even book it on advance, I buy my tickets once I'm at or near the train station."}, {"username": "निनावी सहभागी", "comment_text": "Any restaurant suggestions in Lucca? Thanks for your advice!"}, {"username": "Ashley Martins", "comment_text": "Yes, very easy to do same day. Pisa takes a max 2 hours. You can spend several wondering around Lucca, rent bikes, etc."}, {"username": "Andrea Jane Whittington", "comment_text": "Definitely recommend doing both in one day, go Pisa first and then you have more time to spend in Lucca! 😍"}, {"username": "Sherrin Wake Bracci", "comment_text": "Ellie Bracci some suggestions"}, {"username": "Dixie Kotylak", "comment_text": "It’s a bit of a trek from the Pisa train to the actual Pisa tower fyi."}, {"username": "Margaret Simons-Palmieri", "comment_text": "Luca better choice, Pisa not my choice, many street vendors with cheap products in your face. Luca and Sienna preferable"}, {"username": "Renae Larcus", "comment_text": "You can make it a quick stop in Pisa. See the tower and move along to Lucca. So much more to see there!"}, {"username": "Liz Poore", "comment_text": "Looks wonderful!"}, {"username": "Phyllis Snyder", "comment_text": "Yes they are closed to each other and a doable day trip from Florence. Lucca is much prettier."}, {"username": "Frank Hunt", "comment_text": "Just go on the internet and checkout the photos rather than a rush rush trip. Luca is I day, Florence 1 day, Pisa half a day with walk from the rail station to the tower with lunch or whatever, could go on forever but….."}, {"username": "Domenica Calvene", "comment_text": "Yes went to Pisa but stayed in Florence for 1 night.\nTravelled by train."}, {"username": "Sandra Ferrante-Kohn", "comment_text": "Pisa is a one and done. See the tower and then leave. Lucca, on the other hand is charming and full of culture. I do believe you can do both places easily in a day."}, {"username": "Lynn Luken", "comment_text": "Lucca is worth 2 to 3 days, Pisa 1/2 day"}, {"username": "Gregg Pires", "comment_text": "I had a choice between Pisa or Florence and I chose Pisa instead. Boy was I disappointed...\nThere's nothing to see in Pisa."}, {"username": "Bethany Rudy", "comment_text": "We stayed in Lucca. Absolutely loved it. You won’t see all the charm in a partial day"}, {"username": "Amy So", "comment_text": "We did both on our own. We took the 9 something train from Florence SM station and went to Lucca first. It was the 3rd Sunday and the antique market was there. We had so much fun shopping and had lunch and ice cream, also rented a 4 people bike and we biked on top of the city wall. We took a taxi at about 4:30 pm to go to Pisa. Spent a little over an hour and walked to the train station back to Florence. We were back and had dinner at 8:45 in Florence. It was a fun filled day. Did it all on our own. Train tickets were purchased the day of. Our train tickets back were purchased as we were walking from the Leaning tower to the train station at Pisa."}, {"username": "Maria Hott", "comment_text": "see Pisa you are so close, Lucca is gorgeous and for sure fit in Siena!!!!!!"}, {"username": "Gianna Onesi", "comment_text": "No I am told Lucca you need a day"}, {"username": "Heather Mulhearn-Egoavil", "comment_text": "You can do both. I woke up real early went to Pisa (from Florence)for a couple of hours then drove to Lucca for the day."}]}, {"id": "2203131260085952", "text": "How will the weather be in late August in Milan and cities around Milan? Can we swim! 🏖️", "link": "facebook.com/groups/1373361046396315/permalink/2203131260085952/", "likes": 2, "comments": [{"username": "Diana Sankara", "comment_text": "In the pool? Certainly."}, {"username": "Xiomara Servellon", "comment_text": "Certainly , Como lake yes , the weather Is still perfect on August"}, {"username": "Mariella Elsano", "comment_text": "Still fine till the end of August"}, {"username": "Muhammad Arslan", "comment_text": "siii"}, {"username": "Ruth Akutu Maccarthy", "comment_text": "Yess you can swim still hot 🔥"}, {"username": "Jenny Payne", "comment_text": "Hot🌻"}]}, {"id": "2203131900085888", "text": "Any Florence hotel recommendations that could accommodate a family of four? Hoping not to have to book two rooms.", "link": "facebook.com/groups/1373361046396315/permalink/2203131900085888/", "likes": 0, "comments": []}, {"id": "2203136040085474", "text": "What are some central recommendations of places to stay in Tuscany region? Will have a car and want to hit up Montalcino, Montepulciano, Pienza in Val d Orcia region but also want to hit up Greve, Chiantiआणखी region, San Gimignano and possibly Siena... open to hotel, Air bnb and farmhouses. Just trying to find a good centralized location! Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2203136040085474/", "likes": 1, "comments": [{"username": "Alice Francesca", "comment_text": "How many days? In a week I just stay in Val d'Orcia, I go there once a week every year..so many villages abd things to see..Siena is worth a day trip for sure (duomo)"}, {"username": "Katie Tasca Gonzalez", "comment_text": "Siena is a great town, but if you can stay in a smaller town I would say do that. The smaller the better. Orvieto is a nice place too, but a bit further south"}]}, {"id": "2203139393418472", "text": "I will be traveling from Ravello to Rome on Monday October 16. Any opinion on best connection-Naples/Rome or Salerno/Rome?", "link": "facebook.com/groups/1373361046396315/permalink/2203139393418472/", "likes": 0, "comments": []}, {"id": "2202498666815878", "text": "Please, some hidden gems in Naples?! We will be there in september...", "link": "facebook.com/groups/1373361046396315/permalink/2202498666815878/", "likes": 2, "comments": [{"username": "Lynn Francisco Casella", "comment_text": "Tour Pompeii"}, {"username": "Rita Levi Montalbano", "comment_text": "Le vele a scampia"}, {"username": "Valentina Saltarelli", "comment_text": "I recommend Jago Museum new opening .\n\nJAGO is an Italian artist working in the field of sculpture.\nThe sculptures are unbelievable"}, {"username": "Mina Pisa", "comment_text": "👉 National Archeological Museum of Naples - https://\nmann-napoli.it/\n👉 The Veiled Christ - https://\nwww.museosanseve\nro.it/en/\nthe-chapel-and-t\nhe-veiled-chris\nt/\nthe-veiled-chris\nt\n👉 Capodimonte Museum (former royal residence of the Bourbons and Savoia) -https://\nnaplespompeii.co\nm/\ncapodimonte.html\n👉 Naples Underground - https://\nwww.napolisotter\nranea.org/en/"}, {"username": "Yolanda Arena", "comment_text": "Cappella San Severo con il Cristo Velato ( Sansevero Museum and Chapel) via San Francesco de Santis 19. L’orto Botanico, Piazza Plebiscito e palazzo reale.\nPizza at Sorbillo or at Trianon"}, {"username": "Glenn Todd Webb", "comment_text": "Casertes palace, San Martino ( on top of funicular)"}, {"username": "John Bruckman", "comment_text": "Underground Naples…a whole ancient city in itself. Spaccanapoli great neighborhood… Cafe Gabrinus for coffee, Da Michele for pizza."}, {"username": "Carole Tarlap", "comment_text": "Naples Underground....\n.."}, {"username": "Ian Fawkner", "comment_text": "Ride the funicular’s - it’s a mystery tour !"}, {"username": "Valerie Collanton", "comment_text": "Fontanelle Cemetery if it has reopened. Truly fascinating. ."}, {"username": "Heather Lauzon", "comment_text": "Following"}, {"username": "Laura Bolzic", "comment_text": "Plenty to see, the underground, the Amalfi coast, Capri, or explore any of the other islands. The back streets, beautiful churches etc. hotels have all the information you require and can book things for you as well."}, {"username": "Etschi Bruckner", "comment_text": "all the usual stuff - no hidden gems! 😂"}, {"username": "Irene Young", "comment_text": "Pizza in Da Michele, it’s where Eat Pray Love was filmed, best Pizza ever!!!"}, {"username": "Etschi Bruckner", "comment_text": "Convento di Santa Chiara and opposite Chiesa del Gesu nuovo - not \"secret\", but there I usually encounter only a few people ! do you need accomodation - I know some great options?"}, {"username": "Etschi Bruckner", "comment_text": "some of the metro stations are quite groovy - here: metro Toledo"}, {"username": "Etschi Bruckner", "comment_text": "the view from Sant Elm fortress is always a winner - walk up or take the funicular"}, {"username": "Virgz Van Møøre", "comment_text": "Naples : Capodimonte and San Elmo, Via Toledo, Duomo, Chiostro Di Santa Chiara, Lungomare, Castel dell'Ovo, Teatro San Carlo, Palazzo Reale, Piazza del Plebiscito, Monte della Misericordia, Capella San Severo. Taste gelato at Gay Odin, pizza portafoglio, pizza frita, fiori di zucca fritti, sfogliatella. Train to Pompei. Ferry to Ischia, Procida, Capri.\n\nCostiera amalfitana : Sorrento as a base. Go to : Positano, Amalfi, Ravello. The roads are usually busy, better with the ferry. Hike on the path of Gods. You can also take the ferry to visit the islands from there.\n\nEnjoy the Dolce vità !"}, {"username": "Antonio Aloè", "comment_text": "Hidden gems?why the French seal you ask tourists?buy a guide or google.."}, {"username": "Amber Jozsa", "comment_text": "Castellammare di Stabia,\nMetropolitan City of Naples"}, {"username": "Suzi Henry", "comment_text": "Casa Setaro Winery. It’s in Naples. Lovely building where they make the wine. Patio and indoor options with great views. Lovely little three course lunch with wine and olive oil pairings. Food was simple and tasty. Very nice wines. From memory they have some grapes growing there but the main vines are on Mt Vesuvius. You need a reservation."}, {"username": "Annalisa Shulde", "comment_text": "Procida!!"}, {"username": "Miyuki Kanno Paul", "comment_text": "Every single one is a gem. Nothing hidden"}, {"username": "Kathy Smith", "comment_text": "We enjoyed the Naples National Archaeological Museum. Also took a boat from Naples to Ischia. We really enjoyed that."}]}, {"id": "2203134326752312", "text": "TuscanSummer.", "link": "facebook.com/groups/1373361046396315/permalink/2203134326752312/", "likes": 44, "comments": []}, {"id": "2203104586755286", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2203104586755286/", "likes": 2, "comments": []}, {"id": "2203037966761948", "text": "Best places to eat in Sorrento please. Going out tonight 👍", "link": "facebook.com/groups/1373361046396315/permalink/2203037966761948/", "likes": 40, "comments": [{"username": "David Aronovitch", "comment_text": "You’re consistent. I’ll give you that."}, {"username": "Annemarie Resweber Faraone", "comment_text": "Da Franco for THE BEST pizza we had in Italy! We ate a few times! Il Buco for a Michelin star experience"}, {"username": "Ann Marie Laface", "comment_text": "Il Buco\nGreat food and ambiance"}, {"username": "Mélanie Di Minni", "comment_text": "Trattoria da Emilia."}, {"username": "Jordan Messina", "comment_text": "Frankie’s pizza bar!"}, {"username": "Clarissa Lopez Angel", "comment_text": "Inn Buffulito so delish!!"}, {"username": "Billie C. Hay", "comment_text": "Love Ruccio’s.. on the water❤️"}, {"username": "Karen Louise", "comment_text": "O'Parrucchia La Favorita"}, {"username": "Chelsea Gudith", "comment_text": "Came here to say this. TASSO lounge bar!!!"}, {"username": "Jules Blumke", "comment_text": "Zi'Ntonios off Tasso Square.\nTrattoria di Emilia down on Marina Grande\nFranco's Pizzaria near train station.\nAll excellent."}, {"username": "Tracy Punchard", "comment_text": "We in Terrazza delle Sirene watching the sunset ☀️"}, {"username": "Demi Gabriel", "comment_text": "Azz! Hands down best lasagne we have had!\nAlthough go a little earlier as there was a big line last night"}, {"username": "Chris Love", "comment_text": "F"}, {"username": "Jen Milianti Schanaberger", "comment_text": "Enjoy and Frankie's..both\nfabulous!"}, {"username": "Michelle Mathis Harrison", "comment_text": "Donna Sophia’s"}, {"username": "Jill Mundy Browning", "comment_text": "Cucu!"}, {"username": "Jill Edgington", "comment_text": "TavernAllegra Sorrento"}, {"username": "Geoff Roush", "comment_text": "Zi Ntonios!"}, {"username": "Joannie Beiswenger", "comment_text": "Rosa’s"}, {"username": "Massy Boussetta", "comment_text": "Da philippo"}, {"username": "Margaret Allen Oskorep", "comment_text": "Following"}, {"username": "Leslie Moskowitz", "comment_text": "Enjoy Restaurant. It’s very small, but sooooo delicious!"}, {"username": "Leslie Moskowitz", "comment_text": "And the Aurora restaurant! Ran by a family, the food was amazing"}, {"username": "Stacey Nicholas", "comment_text": "Sandy Jenaway Passmore Sarah Chapman Louise Hocknull"}, {"username": "Andrew Scivoli", "comment_text": "Bistro 86, da gigno"}, {"username": "Chelsea Roggeveen", "comment_text": "Following"}, {"username": "Amy Forsythe", "comment_text": "F"}, {"username": "Beverly Barker Snow", "comment_text": "following"}, {"username": "Susan Carney Ash", "comment_text": "In downtown, we adored Enjoy the Little Things Bistro. No reservations, so the line can get long at peak times, but we went there 3 times and had great meals every time!"}, {"username": "Lisa Pupo", "comment_text": "Following"}, {"username": "Steven Marsh", "comment_text": "Fauno’s"}, {"username": "Nathan Onfrichuk", "comment_text": "https://\nwww.soulandfish.\ncom/en/\n\nOrder the tuna!"}, {"username": "Claire Wilson Malone", "comment_text": "We ate at taverna azura at marina grande last night, was lovely!"}, {"username": "Jeff Gentner EA", "comment_text": "Donna Sofia"}, {"username": "Katie Smith", "comment_text": "Following"}, {"username": "Emily LeaTh", "comment_text": "Da Fillipo https://\ninstagram.com/\nristorantedafili\nppo1983?igshid=\nMzRlODBiNWFlZA%\n3D%3D (they will pick you up and drop you back where you’re staying, but you need a reservation for sure)\n\nWe stumbled on"}, {"username": "Christi Anna", "comment_text": "If you’re in town, O'Parrucchiano La Favorita is amazing! If you’re looking for something by the water, Bagni Delfino in Marina Grande is also amazing!"}, {"username": "Cindy Gallen Barton", "comment_text": "Cindy Gallen Barton"}, {"username": "Sergio Milone", "comment_text": "A'Marenna - Sorrento bakery & bistrot\nVia Torquato tasso, 23"}, {"username": "Liz Kosin", "comment_text": "Foreigners Club"}, {"username": "Misty Healey", "comment_text": "This was my favorite place I ate in Sorrento. Nice views from the area around the restaurant too. Antonino Esposito - Pizza e Cucina"}, {"username": "Christine Martin Ross", "comment_text": "Following"}, {"username": "Patricia Diebold-mccarthy", "comment_text": "Every place is amazing"}, {"username": "Gina Romano Peralta", "comment_text": "Pizzeria Tasso (been years but went several times)"}, {"username": "Donny Fischer", "comment_text": "Take a nice stroll down to Marina Grande (access the tunnel behind Hotel Continental). There are some GREAT seafood restaurants down there. Fresh out of the ocean. We love PortaMarina. Soooooo good and great vibe"}, {"username": "Julie Tran", "comment_text": "Cucu!"}, {"username": "Bartek Rybka", "comment_text": "How’s the weather I will be there Tuesday? Little anxious about the heat"}, {"username": "Rose Perez Swartz", "comment_text": "Azz Italian Tavern, wonderful food and not expensive. There’s is a line so get there early."}, {"username": "Dorothy Holder Zmigrodski", "comment_text": "Inn Bufalito — best meal we had in Sorrento"}, {"username": "Liz Marikian-Falvey", "comment_text": "Taverna Allegra"}, {"username": "Todd Gudith", "comment_text": "Tasso lounge bar. Amazing! Fresh, great service."}, {"username": "Lisette Safie", "comment_text": "Donna Sofia!"}, {"username": "Roberto De La Vega", "comment_text": "Donna Sofia. Great place and food!"}, {"username": "Graeme Collings", "comment_text": "Justin’s best steak ever"}, {"username": "John Selvaggio", "comment_text": "Try Cafe Latino"}, {"username": "Tiffany Shane", "comment_text": "We didn’t have a bad meal there! Anywhere you go will be good, I’m almost positive!"}, {"username": "Melina Cribari Merrill", "comment_text": "Melina Cribari Merrill"}, {"username": "Mary-Lynn Shapiro", "comment_text": "Pizza Da Franco!"}, {"username": "Lisa LaBracio Volpe", "comment_text": "Il Buco and Da Gigino"}, {"username": "Katie Smith", "comment_text": "Following"}, {"username": "Nicole Gouzoules Sheehan", "comment_text": "Following!"}, {"username": "Lindsey Dingman", "comment_text": "Aurora! Get the lasagna 🤌. Bolognese is really good too. Pizza looked awesome, but didn’t ever try it. There’s 2 auroras - family owned right next to each other. Both had amazing food, but I liked the service of the one being ran by the ladies. Those ladies were on it and hard working!"}, {"username": "Nadia Granito", "comment_text": "Nadia Granito"}, {"username": "Gina Romano Peralta", "comment_text": "Donna Sofia"}, {"username": "Gianluca Rivizzigno", "comment_text": "Terrazza delle Sirene, ask for a table on the balcony.\n\nOrder Tagliolini Al Limone Con Gamberetti E Crema Di Pistacchio. Still dreaming about it."}, {"username": "Christine Smith- Rodriguez", "comment_text": "Following"}, {"username": "Nancy Brennan Carrow", "comment_text": "Tavern Allegra"}, {"username": "Rebecca Turner", "comment_text": "Lounge Bar Tasso. Our favorite meal of the whole trip, we went two nights in a row because we loved it so much. I believe there may be another restaurant with a similar name, so the address was Via Torquato Tasso, 15, 80067 Sorrento NA, Italy"}, {"username": "Michelle Plutto", "comment_text": "Following"}, {"username": "Elisabeth Pekonen", "comment_text": "Go down to the small Harborplace, great godo!!"}, {"username": "Elisabeth Pekonen", "comment_text": "Sorry food!"}, {"username": "Sasha Childs", "comment_text": "The foreigners club"}, {"username": "Emily Mars", "comment_text": "Following"}, {"username": "Christina Ramos", "comment_text": "https://\nwww.parrucchiano\n.com/en/"}, {"username": "Patrizia D'Arcangelo", "comment_text": "Circolo dei Forestieri.\nA few years ago I had dinner there with my family.\nYou eat very well and you can see a fantastic sunset over the sea"}, {"username": "Laura Maroni Reisiger", "comment_text": "Angelina’s. On the water."}, {"username": "Stephanie Collier", "comment_text": "La Fenice"}, {"username": "Lauren-Jade Roberts", "comment_text": "Soul and fish"}, {"username": "Paul Ryley", "comment_text": "L’Antica trattoria! Awesome food! Best meal I had in all of Italy! Amazing food and a must in Sorrento! Ciao!"}]}, {"id": "2202952796770465", "text": "Thanks for accepting me. I am in love with Italy...been there and planning to go again", "link": "facebook.com/groups/1373361046396315/permalink/2202952796770465/", "likes": 6, "comments": []}, {"id": "2202999890099089", "text": "My husband and I plan on going to southern Italy next September into early October. Is is better to use Sorrento as a home base to see the Almalfi coast or move around? We plan on visiting Naples, Pompeii, Positano, Salerno, Capri and Ravello. My husband thinks we should pick 2-3 different places in the Almalfi coast area for the 2 weeks we plan on staying. I want just 1 place.", "link": "facebook.com/groups/1373361046396315/permalink/2202999890099089/", "likes": 4, "comments": [{"username": "Deborah Schroeder", "comment_text": "I think you should look at the cost and transportation to all the places you want to go and see which is better for you to stay at-1 or 2 bases."}, {"username": "Jenny Payne", "comment_text": "I would pick Sorrento as one place for 4 nights and choose an area, even one of the islands off Naples🌻"}, {"username": "Kally Trahearn", "comment_text": "Sorrento is a great place for a base and it will save you packing and unpacking each time you move location. The Amalfi Coast, Capri, Pompeii and a whole load of other places are all very easily accessible.\n\nWhatever you do, slow down and enjoy it all."}, {"username": "Chiara Normanno", "comment_text": "Option a) you make Salerno as your base and take ferries to visit the Amalfi coast\nOption b) accomm. in Salerno + ferries amount to the same price as a place in the Amalfi coast? Then it's better to book accommodation there and skip Salerno entirely.\nYou may use Naples as a base for Sorrento and Capri but there's a ferry for a day trip in Capri from Salerno as well (different port and company, though).\nYou may even take day trips to Naples from Salerno as well if you don't want to move around too much with luggage.\n\nIf you're trekkers I encourage you to do the Pathway of Gods (Sentiero degli dei) in the Amalfi coast, late september clear days are the best time for it"}, {"username": "Kimberly MacKinnon Cherry", "comment_text": "We used Sorrento as our home base and it worked out great! You can easily visit all that you mentioned and it's less expensive and less crowded than Amalfi Coast"}, {"username": "Lawrence Oreoluwa", "comment_text": "I have meet the best manager in my life time..I have seen many people given testimonies about Mrs Alice James...I decide to message ger and I started with the minimum capital, now I can take care of my family properly... message her now for her guidances on how to make income...\n👇👇👇\n\nAlice James"}, {"username": "Lawrence Oreoluwa", "comment_text": "You'll definitely thank me later for referring you to her\n\n👇👇\n\nAlice James"}, {"username": "Gary W Anderson", "comment_text": "Sorrento is beautiful and convenient, schlepping bags around will cost you a day no matter how you try."}, {"username": "Anna Izzo", "comment_text": "I don’t think staying in Sorrento would be a bad idea given the places you would like to visit. We stayed in this cool little place in Sorrento called U￼nconventional\nSorrento. It was formally a convent. It was pretty new and updated and unique. Rather inexpensive, and a great breakfast was included. Check it out!"}, {"username": "Renae Larcus", "comment_text": "Use Sorrento as home base."}, {"username": "Fetchin Gretchen", "comment_text": "I loved having Sorrento as a base for the Amalfi Coast. Easy to get around by ferry or to take the bus along the coast."}, {"username": "Roland Trego", "comment_text": "It's just a personal preference. I have stayed in both Sorrento and Positano. Sorrento is quite active, with many shops and restaurants and lots of nightlife. The towns on the Amalfi Coast side are smaller and quieter, especially at night after the day trippers have left. My personal feeling is that each time you move you lose about 4 hours. With two weeks, though, one week in Sorrento and one on the Amalfi Coast seems perfectly reasonable. My advice is to choose bases with ferry service. Otherwise, you will have to take a bus or taxi to the ferry when you want to tour the villages. Also, on the Amalfi Coast, be sure to find out how many steps you must climb to get to your accommodation!"}, {"username": "Steve Grossman", "comment_text": "The towns in the peninsula are very very close to each other. And very good buses run all day long between the towns. There is no reason to move from town to town and stay in different hotels. None whatsoever"}, {"username": "Steve Grossman", "comment_text": "The two best base towns are sorento and amalfi. Each town has ferry terminals and bus terminals. You can go anywhere from either town"}, {"username": "Marcia Levy", "comment_text": "We had11 days in May and stayed 6 days in Positano and5 in Sorrento. We loved Sorrento and is a great base to go to Pompeii and Capri. I would stay in Amalfi or Ravello and visit Positano unless you spend 3 days in Positano and 4 in Amalfi. We stayed in Positano and did day trips to Amalfi and Ravello. We did not want to drag around to too many hotels.We like to unpack and relax! Have fun. It will be amazing!\nVisit Ravello for sure. A day trip is enough. The ferries are great unless the weather is bad.\nBest not to jump around too much."}, {"username": "Suzi Henry", "comment_text": "Sorrento is great place to stay. We loved Sorrento itself. Great shopping, restaurants, beach clubs etc. Easy to get to Naples, Pompeii and Amalfi locations."}, {"username": "Laura DeCicco", "comment_text": "*Amalfi"}, {"username": "Caitlin Adamz", "comment_text": "If you want to actually see Naples I would spend one or two nights there. If not then definitely use Sorrento as a home base. My suggested loose itinerary: Naples and then Pompeii on the way to or from Sorrento. From Sorrento you can do positano and amalfi in one day by bus/boat. Another day could be hiking in ravello. And Capri another day with the lots of relaxing and wandering the rest of the time. Then on your last day you could take a boat or bus to Salerno to sight see there and a train from Salerno back to Naples."}, {"username": "Marie Payne", "comment_text": "you dont want to have to wait until 4 pm to check in...you dont want to have to lug luggage ...Id recommend staying in Sorrento..day trip...its wonderful"}, {"username": "Czecie Reyes", "comment_text": "Yes"}, {"username": "Luigia Gray", "comment_text": "Sorrento is where you'd want to stay. Close to all the towns."}, {"username": "Jean Bennett O'Reilly", "comment_text": "We did Sorrento as our base as we visited other towns along the coast. So glad we did. You can cruise into many of the towns."}]}, {"id": "2203010576764687", "text": "Hello\nI’m going to Italy for 6 days mid August, can you please suggest to me a good 4 cities next to Rome Rome in where we there is good beaches, good food , historical places , and nature\nAnd not too expensive 😄", "link": "facebook.com/groups/1373361046396315/permalink/2203010576764687/", "likes": 1, "comments": [{"username": "Lisa Decamps", "comment_text": "I can recommend Naples! You can take the train to Pompeii and combine with a visit to Vesuvio"}, {"username": "Petrina Andreea Pandelea", "comment_text": "Near Rome the beaches are not good. If you drive or go by train direction Civitavecchia, you can go to Maccarese Beach, Ladispoli or santa severa. San Nicola is nice but there is no train station. The sand is everywhere mostly black and the water is dirty. Food is almost everywhere good at places around the beach."}]}, {"id": "2202958520103226", "text": "Hi everyone!\nWe just got back to Canada after our 10 year wedding anniversary in Italy. This was my husband’s first time and my second trip to Italy. Here’s how our trip went and places we’ve stayed and love.\n\nFlew direct Yul-Fco with AC no problem at all even got in early. Stayed in Rome 2 nights at the Damaso Hotel; super central hotel, right by Campo do Fiore, beautiful, amazing staff, highly recommended it. We Armando del Pantheon, this is probably the only place our hole trip that I do not recommend; pasta was extremely salty and overall food not good; it’s clearly become a tourist trap. Had dinner at Pianostrada Laboratorio Di Cucina; beautiful terrace garden and food was great. We did the Vatican 730am breakfast tour; a must, we were all by ourselves with our group in each hall way, yes to see the Basilica we had to go back through the museum with all the people but we simply walked at a fast pasted and got to the side chapel door in about 10 minutes and were able to cut the huge line waiting to get in. Had lunch that day in the basement cellar of Roscioli; amazing, we loved everything we ate and the setting is pretty cool. We then had the night tour of the Colosseum underground that we booked with Get Your Guide ; we were lucky enough ours wasn’t cancel, but I could suggest booking directly with the actual tour company called « Italy With Family », I think your chance of cancellation will be less. We had also book an Italian tour directly with the colosseum just in case but we’re lucky we didn’t need it.\n\nThen took a morning train with Italo from Rome to Florence. I highly suggest booking with Italo. Someone on here had complained about the AC on the trainitalia, well this wasn’t an issue on Italo, the train was basically empty in primo class, train seemed new and ac worked great.\n\nArrived at the Florence terminal we jumped in a cab and headed to Tuscany. I had done a tone of research trying to find the perfect place to stay and let me tell you, I did!! We had a 2 night romance package at this incredible estate called « Torre a Cona » (or Fattoria Torre a Cona). The vineyard itself has existed for hundreds of years but the estate was transformed into this incredible small hotel and restaurant with a Michelin star chef. The property is simply wonderful with a beautiful pool. I would highly suggest staying here soon before they become highly popular, as I’m sure their prices will go up.\n\nWe didn’t want to drive and prices for a driver were to us outrageous, so we took taxis everywhere and it worked out great. We did a wine tour with dinner pairing at our estate, a wine tour of Antinori nel Classico Chianti (highly recommend) and we had dinner at Ruffino winery (dinner was alright, over priced and not our best meal but the gardens with table and music are magical; would suggest going for a drink and appetizers in their gardens only).\n\nWe then had a taxi come pick us up at 6am to take us to Florence where we were to catch a bus tour to Cinque Terre. Even though the tour company said we could bring our luggage on the bus, we opted to drop them off at our hotel first; oh how happy we did. The meeting point is at the train terminal but because buses aren’t allowed at the terminal, they make you walk 10-15 minutes away.\n\nThe tour of Cinque Terre itself is about 12-14 hours there and back. The guides were amazing. They give you the train ticket at the beginning, take you from one town to an other with some info of each town and some free time. Unfortunately the day we were there the sea was extremely rough and our boat part of the tour was cancelled; meaning we lost a bit of that feel/charm of what Cinque Terre really is, but on the last town you really get to experience seeing all the colored homes. The tour was great, but because I had been to the Amalfi coast in the past I would now choose to go back to the amalfi coast over cinque Terre as I find it is simply not as well maintained.\n\nBack to Florence at 9pm, this is where we wished we had had at least a full day in Florence. The people are all so nice the city very charming. But from 9-midnight we made the best of it by eating at this restaurant right next to our hotel called Yellow Bar; OMG best best pasta of our hole trip. My husband even said at the end of our trip that he wished he could just go back there and have one more meal. We stayed at Hotel Cavour; beautiful hotel right by the duomo. We had made a rooftop reservation for 10pm so we could at least have a view of the city; incredible!\n\nShort night sleep, 4 am taxi to the airport to catch our flight to Sardinia. 3 nights at the Hotel Villa Margherita in Golfo Aranci. We again didn’t drive and took a taxi to other beaches, but here during the day you could probably safely drive and see tons of incredible beaches. There’s a well known pizza restaurant called Pizzaria La PechoraViziosa; amazing pizza and even better ambiance (highly suggest making a reservation for upstairs). Sardinia is a beautiful island with thousands of options to stay. Next time we would love to try south, but anywhere the water and sand is simply breathtaking.\n\nFinally, back to the airport by taxi; flew Sardinia-Rome then Rome-Montreal.\n\nWe were the lucky ones, zero delays and everything went without a hitch. We never saw one pick pocket (and I’m a traveler and very aware). Never had to use a toilet without a toilet seat. Was hot only the 2 days in Rome as we were there at the end of the heat wave but then the temperature went back down to normal summer temp. We never found it over crowded; the ones that think haven’t travelled much as there’s way worst out there.\n\nDo what’s right for you. If your nervous about things like getting somewhere then give yourself some extra time. I go to Europe every couple of years and the people, the food, the landscapes are all always magical and good for the soul. Don’t let anything ruin that moment, take it all in.", "link": "facebook.com/groups/1373361046396315/permalink/2202958520103226/", "likes": 27, "comments": [{"username": "Michelle Fuger", "comment_text": "Les photos tres belles et je suis contente que vous avez eu un tres beau voyage"}, {"username": "Cathy Stewart", "comment_text": "Ahh, your post makes me excited to go later this year! Fellow Canadian here, were you able to download the Italo app fine? Wanting to book our train tickets this week and torn between which line to use."}, {"username": "Carmen Martin", "comment_text": "Great photos ♥️"}, {"username": "Deborah Schroeder", "comment_text": "Sounds like the perfect trip. You were so smart to take the time to research and it paid off for you. I stayed at the Hotel Cavour and used the rooftop every night-it is amazing."}, {"username": "Mark Andrews", "comment_text": "Wow. Beautiful posts. My first time ahead. Can’t wait"}, {"username": "Patricia Chavez", "comment_text": "Thank You for sharing your incredible Trip!!\nAlso wanted to say Happy Belated Anniversary!!\nYou did a Amazing Trip Planning.\nLoved all your Photos.\nMay I ask who did you book your stay with for that incredible place in Tuscany?"}, {"username": "Ellen Arnold", "comment_text": "Great report Mel. Sounds like you two had an amazing trip 😊 Belated Happy Anniversary wishes xx"}]}, {"id": "2202960626769682", "text": "What places to enjoy a few drinks late afternoon and evening in rome\n\nAnd\n\nPlaces to see that aren't tours - example Jewish Getto", "link": "facebook.com/groups/1373361046396315/permalink/2202960626769682/", "likes": 0, "comments": [{"username": "Michael Butts", "comment_text": "Latteria in the Trastevere neighborhood. Natural wine bar with great cocktails and small plates also."}]}, {"id": "2202969563435455", "text": "Hello trying to book a train for October from Montecatini terme to Florence but only seeing afternoon trains. Does this mean there are no more trains at 7 am?", "link": "facebook.com/groups/1373361046396315/permalink/2202969563435455/", "likes": 0, "comments": [{"username": "Scott Perry", "comment_text": "I was able to find early trains on Trainline."}, {"username": "JeriLynne Clifford", "comment_text": "Try setting the clock to 12:00 am and it will show them for the whole day"}]}, {"id": "2202970030102075", "text": "Hi everyone. I just saw this article and thought it would be helpful to know.\n----\nHeadline:\nCanadians travelling to Europe in 2024 will need a permit to enter some countries. (Not just Canadians)\n\nCanadians eyeing a trip to certain European countries next year will need to obtain a permit first.\n\nStarting in 2024, Canadian travellers seeking a short-term visit to 30 countries including France, Switzerland, Spain and Greece must apply to the European Travel Information and Authorisation System.\n\nThe permit costs 7 euros, or about $10.25, and can be obtained on the ETIAS website or mobile app.\n\nIt allows travellers to visit for up to 90 days within any 180-day period and is valid for three years, or until the passport used in the application expires.\n\nIn addition to Canada, the new rules will apply to nearly 60 countries including the United States, Mexico, United Kingdom, Australia and Japan.\n\nTravellers younger than 18 and older than 70 years are exempt from payment, as are family members of EU citizens or of non-EU nationals who can move freely in the European Union.\n\nThe official website of the European Union urges would-be visitors to apply for authorization well in advance of a planned trip, and before booking a plane ticket or hotel.\n\nCanadian travellers to most of Europe are currently exempt from needing a visa and only require a valid passport for short stays.\n\nEuropean countries requiring ETIAS also include Belgium, Croatia, Finland, Germany, Portugal, Romania and Slovenia.\n\nThis report by The Canadian Press was first published July 26, 2023.", "link": "facebook.com/groups/1373361046396315/permalink/2202970030102075/", "likes": 1, "comments": [{"username": "Gianna Onesi", "comment_text": "https://\nwww.instagram.co\nm/p/\nCtkERoIIyED/\n?igshid=MzRlODBi\nNWFlZA%3D%3D"}]}, {"id": "2202973220101756", "text": "Taking my 80 y/o MIL, 2 20-something daughters and husband to Tuscany for a week next year. Will rent an AirBnB the whole week and car for day trips. Then…for week 2 sending everyone home except husband….whereआणखी should we go? North to Lake Como….or the Amalfi coast? Have been to Venice, Naples & Florence on prior trips. Like being active…", "link": "facebook.com/groups/1373361046396315/permalink/2202973220101756/", "likes": 0, "comments": []}, {"id": "2202974973434914", "text": "We're planning a 4 night trip to Rome over New Years. There's 4 kids in our group age 1 to 14. Any recommendations of things to do that time of year? Has anyone visited new years eve with kids?", "link": "facebook.com/groups/1373361046396315/permalink/2202974973434914/", "likes": 0, "comments": []}, {"id": "2202974360101642", "text": "Hi, in September, looking to lease a car after Florence to drive to our Air BnB outside of Siena…. We are staying in the country at an agritourismo so want a car for exploring Tuscany…. Is it best to rent in Florence and drive to our accommodation or ride the train to Siena and rent there? Grazie!", "link": "facebook.com/groups/1373361046396315/permalink/2202974360101642/", "likes": 0, "comments": [{"username": "Alice Francesca", "comment_text": "Take the train to Siena and rent it from there.Look for VAL D'Orcia online, especially Pienza and Bagno Vignoni"}, {"username": "Charlotte Paul", "comment_text": "Are you flying in and out of Florence?"}, {"username": "Miyuki Kanno Paul", "comment_text": "Lease if you are renting longer than 3 weeks"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2202977396768005", "text": "We are looking for adventerous activities to do while in the Dolomites and Northern Italy! I am excited to experience the culture, and enjoy the food, history and architecture. But I would also love some ideasआणखी of things to do that might up the adrenaline a little! This was us on another trip to New Zealand to give you an idea! Grazie!", "link": "facebook.com/groups/1373361046396315/permalink/2202977396768005/", "likes": 3, "comments": [{"username": "Elena Eugeni", "comment_text": "https://\nwww.adrenalinead\nventures.it/\nThis one is really fun. Also, from Kronplatz you could try paragliding, it's also for beginners since you could learn with a teacher. In Meran there is a fun bob circuit (on tracks, no need for snow) that is nice, I believe it's called Alpin Bob Meran 2000"}, {"username": "Etschi Bruckner", "comment_text": "nothing like that, but a lot of wonderful hikes, great restaurants, local wines ( like Vernatsch and Lagrein), castles and stunning scenery"}, {"username": "Gioia Clari", "comment_text": "Where are you going exactly, or at least which area in the Dolomites? There are a few places where you can do canyoning, rafting, hydrospeed and such activities - but in general I am sure you won't be disappointed!"}, {"username": "Edoardo Casolo", "comment_text": "In some places they do paragliding"}]}, {"id": "2202977596767985", "text": "My husband, my kids, and I are taking a cruise next year. The last port is Rome. I would be arriving in Rome at around 10 AM and heading back to New Jersey the following day. I’m traveling with my 17 year old twin boys and my 20 year old daughter. Does anyone know of an Airbnb or a hotel that lets you check in luggage early in the morning, that’sआणखी nice and has AC. Also, how would you best spend your day? I would love to take them to the Vatican and to the Colosseum. I think doing both in one day, considering we can’t start early in the morning would be a little too much. ￼Maybe a gladiator class? I’ve been to Rome twice, so I have seen everything myself, but it’s my kids’ first time. ￼Thank you. ￼", "link": "facebook.com/groups/1373361046396315/permalink/2202977596767985/", "likes": 1, "comments": [{"username": "Diane Janovas", "comment_text": "If you can afford it,book a hotel for the day before your arrival and let the hotel know you are not checking in till the next day. I have done this so I can get right into a hotel when my flight arrives"}]}, {"id": "2202979760101102", "text": "Hi 🙂 any recommendations for good restaurants in Milan?", "link": "facebook.com/groups/1373361046396315/permalink/2202979760101102/", "likes": 2, "comments": [{"username": "Whitney Meyers", "comment_text": "Crazy pizza"}, {"username": "Саша Савино", "comment_text": "Absolutely no!\nFor pizza\nGino sorbillo (nearby duomo)\nVincenzo Capuano\nOr antica pizzeria da Michele."}, {"username": "Саша Савино", "comment_text": "For me the best for position/price/\nquality\nRisoelatte cucina casalinga"}, {"username": "Alice Francesca", "comment_text": "When in Milan you don't want to look for pizza( which is from Naples) but ossobuco and risotto alla milanese, for instance, which are the tipycal dishes"}, {"username": "Tom Manno", "comment_text": "Nabucco in the Brera District."}, {"username": "Frank A Colacino", "comment_text": "Stendahl"}, {"username": "Beth Ann", "comment_text": "Salsamenteria di Parma San Babila"}, {"username": "Louise Levy", "comment_text": "Pizza are also delicious there……"}, {"username": "Lorena Scopelliti", "comment_text": "Traditional dishes: Il Tavolino.\nTraditional with a brilliant touch of modernity: Ratanà.\nBoth pretty close to central station.\nPizza: Peperino (close to Corso Como) or I segreti di Pulcinella (Navigli).\nMeat: Top Carne."}, {"username": "Claudia Gonnelli", "comment_text": "My fav is CREANZA ❤️ lovely and cozy place. If you want something more traditional: DAMM-ATRÀ and OSTERIA DEL BINARI."}, {"username": "Peach Panfili", "comment_text": "Peck - not far from the Duomo, 10 Corso Como or go for a wander around Brera."}]}, {"id": "2202982356767509", "text": "What a wonderful lunch. 9 drunks walking. 😆 🤣 😂", "link": "facebook.com/groups/1373361046396315/permalink/2202982356767509/", "likes": 78, "comments": [{"username": "Alicia White", "comment_text": "Loved it there!! I still think about their tuscan stew 😋"}, {"username": "Carol Jones", "comment_text": "😂❤️"}, {"username": "Andrea Farster", "comment_text": "Had the best experience there many years ago!"}, {"username": "Tracy Wrinn Mcdermott", "comment_text": "Did you book ahead?"}, {"username": "Connie Vitale", "comment_text": "Annmarie Geiss"}, {"username": "Michele Power", "comment_text": "So what does something like this set you back I n Italy?"}, {"username": "Lisa Pirone Kaiser", "comment_text": "Loved it there. It was an amazing experience 🍷"}, {"username": "Debbie Potter", "comment_text": "This is awesome... love this"}, {"username": "Becky Lewis", "comment_text": "I LOVE this winery!"}, {"username": "Tania Loprete", "comment_text": "Marisa Tenuta any relations to this winery"}, {"username": "Amanda Watson", "comment_text": "I was thinking of staying overnight here, did u stay or just visit for the day?"}, {"username": "Jessica Stewart", "comment_text": "Omg I want to do this what’s the website?"}, {"username": "Ashley Martins", "comment_text": "We loved it, expect we did not get that yummy steak with our lunch :("}, {"username": "Louise Faggioni", "comment_text": "Louise Faggioni"}, {"username": "Kimberly Cross", "comment_text": "It was amazing."}, {"username": "Marcus Hiesler", "comment_text": "Sharon Hiesler"}, {"username": "Colleen Carollo Oxsalida", "comment_text": "We did the cooking class and wine tasting there. It was awesome!! And yes, we were pretty tipsy after all those tastings!"}, {"username": "Chrissa Matthews", "comment_text": "We are going there in 2 weeks, can’t wait!"}, {"username": "Jana Lynn Longo", "comment_text": "Loved this as well!"}, {"username": "Beverly Berry McFee", "comment_text": "They give you a lot of food!"}]}, {"id": "2202985366767208", "text": "We are staying a few days in Civitavecchia (pre cruise). Any suggestions on things to do in that area or near that area, other than Rome?\nTIA.", "link": "facebook.com/groups/1373361046396315/permalink/2202985366767208/", "likes": 0, "comments": [{"username": "Jackie Hartley Brooks", "comment_text": "Following"}]}, {"id": "2202988463433565", "text": "Hi All, I’m travelling to Milan on 4th Aug. Got to know from few sources that there is some strike at airports in Italy. Has anybody faced issues regarding this? Are flights getting cancelled?\n\nThanks in advance", "link": "facebook.com/groups/1373361046396315/permalink/2202988463433565/", "likes": 0, "comments": []}, {"id": "2202987526766992", "text": "Hello everyone!\n\nI am looking for recommendations of the best places to eat porchetta in Rome and Florence , it is better if they are local places as I think they can have better taste .\nI would still appreciate your recommendations of restaurants where you have eaten good meat.\n\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2202987526766992/", "likes": 5, "comments": [{"username": "Agnese Arnó Ch-Ch", "comment_text": "In Rome I would say Roscioli, in Florence you can have a great porchetta sandwich at I Fratellini."}, {"username": "Jenny Payne", "comment_text": "Markets in Florence called San Lorenzo, you can buy all the cheeses & salami down stairs ,locals all go there as well 🌻"}, {"username": "Chiara Normanno", "comment_text": "When in Rome go to Ariccia to have porchetta"}, {"username": "Carolyn Esposito", "comment_text": "Great pork sandwich across the street from the train station."}, {"username": "Beth Ann", "comment_text": "In Rome: La Norceria di Iacozzilli in Trastevere"}, {"username": "Shirley Lewis", "comment_text": "you will find porchetta some times at street stands or certainly at the markets, San Lorenzo and San Ambrogio"}, {"username": "Elena Innocenti", "comment_text": "In Roma\n\n- Angrypig near Vaticano is quite famous and have many kind of panini and cold cuts.\n- Fraschetta di Castel Sant'Angelo\n- Antico Forno Roscioli near Campo de Fiori. They put inside pizza bianca and it’s delicious. Here you have to try also pizza rossa (only with tomato), supplì (fried rice ball with tomato and mozzarella), and mozzarella in carrozza (fried mozzarella with bread and ham or anchovies)\n- La vita è un mozzico near Piazza del Popolo"}, {"username": "Kara Bolster", "comment_text": "In Trastevere - highly recommend!"}, {"username": "Dafne Vassetti", "comment_text": "Porchetta is from the Lazio Region (Rome), not from Florence. In Florence you can have a Lampredotto sandwich ;)"}, {"username": "Beth Heys", "comment_text": "https://\nmaps.app.goo.gl/\ngF3Rr3L9QLevtRh9\n7?g_st=ic\n\nThis was delicious. Bonus there’s a great gelato place up the road - Frigidarium"}, {"username": "Fiona Cameron", "comment_text": "In Florence there are several places to get porchetta in a panino (sandwich/\nroll) in the san Lorenzo market. one of the most famous is Da Nerbone… but not necessarily the best!!"}]}, {"id": "2202991120099966", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2202991120099966/", "likes": 2, "comments": []}, {"id": "2202997413432670", "text": "Is it true that Discover credit cards aren't widely accepted in Italy? I'd like to use mine since it doesn't charge international fees.", "link": "facebook.com/groups/1373361046396315/permalink/2202997413432670/", "likes": 5, "comments": [{"username": "Jess Galasso", "comment_text": "True.\n\nGet a mastercard or visa"}, {"username": "Diane Davis Lawyer", "comment_text": "I read on here someone had one and it was not accepted anywhere and they could not use it."}, {"username": "Jaime Cleek", "comment_text": "It’s seems it’s mostly a US card. I had a friend try to use in Canada and it wasn’t accepted"}, {"username": "Vivien Paulik", "comment_text": "I have never heard about that card, so I think it is not good in Italy"}, {"username": "Tina Ferrari Cuva", "comment_text": "Very true, use MC or Visa."}, {"username": "Tami Neubauer Foster", "comment_text": "Thank you all! I'm so glad I asked! 💜💜"}, {"username": "Sherri Leis Dillavou", "comment_text": "Discover is not widely excepted in anywhere but the usa"}, {"username": "Yvonne Ormson", "comment_text": "Discover is really a US thing.\nAmex is also much less accepted outside US.\nBest to use visa or MasterCard."}, {"username": "Delia Miscella Wroblewski", "comment_text": "Not accepted"}, {"username": "Colleen Dawson", "comment_text": "Not accepted outside of the USA."}, {"username": "Giovanni Pianigiani", "comment_text": "I've been living Italy for the most part of my 50 years and I have never seen a Discovery logo at any teller"}, {"username": "Carmine Castiglia Jr", "comment_text": "This is what Discover has to say about it"}, {"username": "Anthony Martini Jr.", "comment_text": "No chance."}, {"username": "Justin Sprouse", "comment_text": "Amex snd Discover charge a higher percentage to merchants"}, {"username": "Margaret Fanelli-Granger", "comment_text": "Get a Bank of America Travel Visa card- no international fees."}, {"username": "Frannie Kaplan", "comment_text": "Basically unheard of outside the US. Visa are the most accepted ones in shops etc, followed by Mastercard and Amex. Online you can probably use what you want"}, {"username": "Patti Porter", "comment_text": "It’s true."}, {"username": "Miyuki Kanno Paul", "comment_text": "True. VISA card is the one to carry"}, {"username": "Angela Suits Bradley", "comment_text": "I used my Discover card all over Europe since the 80s. I is widely accepted in major tourist destinations and major cites. More accepted than Amex."}, {"username": "Rita Levi Montalbano", "comment_text": "Im italian and i dont even know whar a discovery card is"}, {"username": "Phyllis Snyder", "comment_text": "Might be good idea to have another one like visa or master card just Incase."}, {"username": "Kim Bagshaw", "comment_text": "AmEx might be a problem except at chain hotels as well. We just traveled Germany and Ireland an were barely able to use it"}, {"username": "Enrico Lecce", "comment_text": "Nope... not highly recommend... not quite useful for business..."}]}, {"id": "2202996000099478", "text": "Using Verona as a base for four nights. Must sees in and about Verona area? TIA!", "link": "facebook.com/groups/1373361046396315/permalink/2202996000099478/", "likes": 0, "comments": [{"username": "Lisa Previte", "comment_text": "Take a wine tour in Valpolicella! Try the Amarone and Recioto! And the olive oil! We did Farina Winery and Borghetto! Amazing! Ship the wines and olive oil home!"}, {"username": "Anthony Taylor", "comment_text": "Visit Venice.About 1 hour by train,we’ll worth it"}, {"username": "Erica Senes Tombesi", "comment_text": "Venezia! And then lago di Garda."}, {"username": "Ingrid Zancoli", "comment_text": "I would suggest Bolca, up in a valley in Verona's province. It's a unique in the world fossil bed, in the Museum you can find extremely rare fish fossils as for example a shark, jellyfish and several fish species found only there. Then 2km away from the Museum, after a short walk in nature you can visit the Pesciara, the old mine where most fossils were found, and for a very cheap ticket you can dig into the mine debris and search for fossils (vegetal remainings are quite easy to be found). Just check the opening hours on their website, i visited It on past spring and the Pesciara was open only during weekends, but maybe during summer it may change."}, {"username": "Melissa Ciske", "comment_text": "Souva is beautiful! Great wine, awesome castle! Vicenza & Padua are a short train ride away from Verona. A little more complicated to get to but absolutely doable (train & bus vs just train) is Marostica. Known for their cherries & a fabulous grapa store"}, {"username": "Paul Simon", "comment_text": "San Giorgio and Garda!"}, {"username": "Assunta Gargano", "comment_text": "In Verona - Been there is 2007, visited the amphitheater, the balcon where Romeo serenaded Juliette, but did not visit the inside of her home it was closed at the time we arrived there. The tomb of Juliette, a little eerie might I say. Their is this beautiful garden before you walk in you will see the bust of Romeo if I'm not mistaken or Shakespeare, many beautiful fountains. And if you are looking for a clean city, Verona is the place. Have fun, stay safe and have a marguerita pizza!"}, {"username": "Mark Andrews", "comment_text": "We are heading to Venice , murano, and lago di grada from Verona"}, {"username": "Kelly Rae Snider", "comment_text": "Last year there was an opera in the Verona Arena and we regret not going even though it was long and obviously all in Italian. Check and see if there’s anything going on in the arena"}, {"username": "Pietro Di Sorbo", "comment_text": "Venice, Padua, Treviso (Why no one mention this city), Garda Lake, Valdobbiadene (Land of prosecco), Cittadella, Marostica, Mantova, Palladian villas, Canova museum in Possagno, the Valpolicella and Amarone Areas.\nChoose among these and other, Veneto Region offer everything for travelers."}, {"username": "Gaynor Williams", "comment_text": "The Dolomites"}, {"username": "Ville Lignell", "comment_text": "Don't miss Vicenza, a lovely city with great architecture. About 40min by train."}, {"username": "Lisa Schuminsky Mingoia", "comment_text": "Thank you all so much!🤗"}, {"username": "Colleen Carollo Oxsalida", "comment_text": "We absolutely loved Verona — such a great vibe to that city. We enjoyed just walking around there. Great market set up in Piazza Erbe to buy souvenirs or grab some fruit and sit on the steps of the old cisterna. From Verona we did a day trip to Sirmione on Lake Garda (which was fabulous) and a day trip to Venice (which I am clearly in the minority because I did not love it!). If you want a recommendation for a restaurant, Locanda degli Scaligeri was one of our best meals of the trip (pizza with sausage and rocket to start and then the Risotto Amarone is a MUST!). If you are looking for a good cappuccino and some morning pastries, La Batida was great — the owner was so nice and there’s a lovely little courtyard to enjoy your purchases."}, {"username": "Antonella Nannucci", "comment_text": "Valeggio sul Mincio..."}, {"username": "Tante Peggyb", "comment_text": "Have a great time!"}]}, {"id": "2203002373432174", "text": "My husband and I have recently returned from our 2 week trip to Italy and are already dreaming of our next trip.\n\nSomething I found really helpful, but haven’t seen mentioned a lot is how to find the fresh waterआणखी drinking fountains around Italys cities. Around the large attractions most fountains are easy to spot- because there is a line; but in less popular areas it was nice to have some help.\n\nWe used the Waidy app- it was incredibly helpful!\n\nOther must have apps for us:\ngoogle translate\nGoogle maps\nEasypark (we rented a car)\nAnd Wanderlog helped us keep up with our itinerary\n\nHope this is helpful for anyone traveling in the next couple months during the heat!\n\nArrivederci", "link": "facebook.com/groups/1373361046396315/permalink/2203002373432174/", "likes": 356, "comments": [{"username": "Ashley Boileau", "comment_text": "Did you find waidy was better than Fontanelle? Was the easy park app pretty accurate? We are renting a car as well, and doing a a day trip to Florence, and spending a couple of nights in venice at a vrbo. Concerned with the best place to park."}, {"username": "Bindu Chauhan", "comment_text": "Water fountains are aplenty around the city..... but very few public wash closets/ washrooms. Is there a handy app that tells you where the wash closets are? I only know of 2 in Rome, one near the coloseum and one near the Spanish steps."}, {"username": "Dixie Kotylak", "comment_text": "Fantastic!"}, {"username": "Dixie Kotylak", "comment_text": "Sean write on cowie"}, {"username": "Nydia Bryan", "comment_text": "Love Wanderlog!"}, {"username": "Patricia Rotondo", "comment_text": "Thank U ! Ironically we too , just got back - a month ago now - but already planning our next trip."}, {"username": "Carolyn Pona-Salvo", "comment_text": "Vic Salvo"}, {"username": "Dianne Kelly", "comment_text": "How did you doing getting around by car? We were thinking of renting one once we leave Venice"}, {"username": "Marissa McLean", "comment_text": "Karen Keehn-Mclean"}, {"username": "Cheryl Ingram", "comment_text": "Angie Terrell Cornett"}, {"username": "Danielle Gervais", "comment_text": "Thank you!"}, {"username": "Daisy Yoo", "comment_text": "I have water nearby app , wonder if it is similar"}, {"username": "Leanne Ravell", "comment_text": "Ricky Price"}, {"username": "Kristin Kerstner", "comment_text": "Nikki Kerstner Rob Kerstner"}, {"username": "Lee Treacy", "comment_text": "Rome to Rio is also fabulous when planning trips. Even just to get around cities."}, {"username": "Immi Walker", "comment_text": "Did you park within the ZLT? Or outside 🙂 just wondering if the app will be helpful for us for parking with our motorhome haha"}, {"username": "Michelle Lowe", "comment_text": "Is the Waidy app only for Italy?"}, {"username": "Lynne Sutton", "comment_text": "Sue San Rebecca Lowry"}, {"username": "Grace Michelle", "comment_text": "Hi thanks so much for the suggestions, can you share what was helpful regarding the parking app :) we travel in Sept and hire a car and anything helpful re that would be really appreciated 😊"}, {"username": "Melissa Naeder", "comment_text": "Cathryn Whitfield\nThis water app seems helpful 🙂"}, {"username": "Kara Alise", "comment_text": "Grazie!"}, {"username": "Michele Bettermann Zito", "comment_text": "The waidy app was great. We uses it all over southern Europe."}, {"username": "Kelliann Faheymullany", "comment_text": "Thank you for sharing!!!"}, {"username": "Giulia Cardamone", "comment_text": "Thank you xx"}, {"username": "Rita Levi Montalbano", "comment_text": "In italy we use \"fontanelle d'italia\" app which means water fountains of italy, maybe you can find some more there"}, {"username": "Larry S Rindner", "comment_text": "What company did you rent a car through? Is EasyPark to help find parking? We are staying in Positano or Sorrento. Heard parking is rough there. Thanks."}, {"username": "Jenny Frank", "comment_text": "bellisimo!"}, {"username": "Hunter Leigh Kreier", "comment_text": "Katelyn Elizabeth Kreier"}, {"username": "Jennifer Gustafson", "comment_text": "I feel like Google maps had a tough time around Italy, especially Venice. But all the rest were great!"}, {"username": "Heidi BL", "comment_text": "Ana F Bond fyi"}, {"username": "Raffaela Ferrari-Romito", "comment_text": "I leave Saturday for Italy. Thank you!"}, {"username": "Tracy Meyers Friend", "comment_text": "Thank you for sharing! I also found the larger cities have their own app for the water fountains. Such a cool idea and history!"}, {"username": "Brian Marcus", "comment_text": "Agree that Waidy Water was very very helpful especially in Rome!"}, {"username": "Sarah Hartley", "comment_text": "Thanks for this! Did you find that the Waidy app was pretty accurate (in that if it said there was a fountain, there was one when you got there)?"}, {"username": "Mohanad Saddik", "comment_text": "Omar Kharboutli"}, {"username": "Greg Lewis", "comment_text": "We’re headed there this Oct. Thanks for the info."}, {"username": "Carmen Martin", "comment_text": "Thank you for sharing ❤️"}, {"username": "Soraya Radwan", "comment_text": "Tony Radwan"}, {"username": "Jane Ortiz Casarez", "comment_text": "Thanks for the info!!! Very helpful"}, {"username": "Alix de Dreuille", "comment_text": "Thank you! I am coming to Rome this Friday. It will be very helpfull."}, {"username": "BillandAngala Verley", "comment_text": "Dina Garrett Julie Franco Mellow Linda Williams"}, {"username": "Sylvie Hogg Murphy", "comment_text": "Yes - great tip! The Roman fountains are called “nasoni” (big nose) for the curved shape of the spigot. You can fill water bottles from the bottom, or plug the bottom with your hand, which will make the water arc upwards from a little hole in the top of the pipe, like a drinking fountain. And it’s always cold and clean!"}, {"username": "Pam Simpson Wilson", "comment_text": "We are here now and are using the”tap” app. Has worked well inVenice"}, {"username": "Brenda Street Oeff", "comment_text": "Staci Webb"}, {"username": "Marla Davison Danis", "comment_text": "Christine Jenkins French"}, {"username": "Donna Spencer", "comment_text": "Lynn Mcconnell Jennifer McConnell Benge. Good to know about water."}, {"username": "Mark Andrews", "comment_text": "Thx for the tips. We were thinking of using waidy app too"}]}, {"id": "2203005510098527", "text": "Hello all! My husband and two teens and I are traveling to Rome in June 2024. We have our Airbnbs booked for the two weeks we will be in Italy. When is the best time to book our round trip flight to Rome? Prices look decent right now, but is there a better time to get the best pricing? Thanks in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2203005510098527/", "likes": 2, "comments": [{"username": "Lucrezia Folger", "comment_text": "If you buy refundable, if the price drops at anytime prior to your flight you can get a refund for the difference."}, {"username": "Fetchin Gretchen", "comment_text": "If in us, 53 days in advance is supposedly best time to book."}, {"username": "Karen Schmidt", "comment_text": "Book now. If all your reservations are set you don’t have the flexibility that great deals require. Plus June is higher season so I doubt it will go down in price by much ( if at all). I’ve been tracking for next May…and things have already gone up a bit . Just make sure you have cancellation insurance or the ticket is somewhat flexible"}, {"username": "Maddalena Rinaldi Stankevitch", "comment_text": "Book when you can , I kept waiting and prices kept going up."}, {"username": "Carol Hayes", "comment_text": "If u have a capital one venture card u can check prices thru them . U can lock in a price and they will notify u if the price drops. They will also tell u when to buy tickets."}]}, {"id": "2161862094212869", "text": "Etna, Wine and Alcantara Tour - Small Groups from Taormina\nMount Etna is Europe's largest active volcano, but you don’t have to climb the mighty peak to experience the natural wonder. On this full-day tour from… आणखी Taormina, hike through the ancient woodlands and lava caves of Mt Etna; indulge in a Sicilian-style lunch and wine tasting; and explore the Alcantara Gorge. Hotel pickup and drop-off is included.\nRead more about Etna, Wine and Alcantara Tour - Small Groups from Taormina - https://www.viator.com/tours/Taormina/Small-Group-Tour-Etna-wine-and-Alcantara-from-Taormina/d4237-14484P3?pid=P00070587&mcid=42383&medium=link&medium_version=selector", "link": "facebook.com/groups/1373361046396315/permalink/2161862094212869/", "likes": 14, "comments": []}, {"id": "2202871453445266", "text": "Hey everyone ! We are coming to Italy (Amalfi coast) for our honeymoon in September! Land in Naples late Monday evening (so going to stay there) and then we have Tuesday-Friday in Amalfi coast and then fly back out Saturday (will stay in naples Friday night). Where is the best place to stay on the Amalfi coast that’s easy to get to everywhere,आणखी positano looks beautiful but is very expensive. Also is there any “must see” places and also what’s it like being vegan there? (As I’m vegan) so excited to come to Italy it’s been my dream place to go for years 💗", "link": "facebook.com/groups/1373361046396315/permalink/2202871453445266/", "likes": 6, "comments": [{"username": "Iliana Zlatareva", "comment_text": "Napoli or Sorrento with day trips"}, {"username": "Laura Uribe", "comment_text": "You have left it very late to make a reservation. You will likely need to choose from what is still available. Amalfi and Positano are very expensive. Maybe try Ravello or Furore as a base. You can then bus and ferry to other locations.\nSalads in Italy are amazing! The vegetables taste so much better than in many places. Congratulations\n!"}, {"username": "Skye Birch", "comment_text": "sorrento is the best base"}, {"username": "Jessica Amacker", "comment_text": "Sorrento, Piano di Sorrento, or Massa Lubrense"}, {"username": "Diane Davis Lawyer", "comment_text": "What are your dates in September?"}, {"username": "Janice Rea", "comment_text": "Sorrento. Take ferry to Capri and Blue Grotto. Take driver to Positano, Amalfi and Ravello."}, {"username": "Caitlin Adamz", "comment_text": "Stay in Sorrento! We did that trip last year and it was incredible. We found a random Airbnb right on the water with a balcony overlooking the fishing boats. If you’re interested I can send the link."}, {"username": "Lianne Buchanan", "comment_text": "I’d recommend Praiano ideal location and lovely town x"}, {"username": "Dafne Vassetti", "comment_text": "I have noticed most people think Sorrento, Amalfi Coast, Naples are all kind of the same thing. Just to give you some insight.\n\nSorrento is under the province of Naples and is the main city in Sorrento Peninsula (it's NOT part of the Amalfi coast!) which is one hourish drive away from Naples (always depending on traffic if traveling by car). Since during weekends or specific days you might be stuck for hours as roads are very small.\n\nAmalfi coast is another one hourish drive from Sorrento (again depending on traffic). Amalfi Coast is not part of Naples, but it's under the province of Salerno (as mentioned by another Italian who commented the post).\n\nAmalfi (which is located in the middle of the coast) coast goes from Positano to Vietri Sul Mare (closer to Salerno). And on the coast there are several little towns other than these 3 (Praiano, Maiori, Minori, Cetara, etc). All alternative (and more cheaper) places where you can stay. Also Salerno would be a good option.\n\nIf you have no intention to visit the city of Naples ( whick is a pity) I would not recommend to sleep in Naples one night and then travel the next day, loosing half a day. Just hire a private driver/\ntransfer to pick you up and bring you directly to your main hotel. Depending if you decide to stay in Sorrento or Amalfi Coast or Salerno, as previously mentioned it's going to be either 1 or 2 hours drive."}, {"username": "Sonita Sandhu", "comment_text": "I second staying in Sorrento as it was more affordable. And I loved it! Yes it’s not on the Amalfi coast but close enough. You can do a day trip to Positano by ferry or hire a car to take you to the coast and visit a couple of the towns. Also Capri is only about 30 mins from Sorrento. Have an amazing time!"}, {"username": "Luah Brewer", "comment_text": "Hey everyone thank you so much for getting me, I actually do have accommodation booked but I read somewhere that it’s quite far away from everything? I’ve attached a picture! Would you recommend I book in sorrento instead? X"}, {"username": "Sofia Helena", "comment_text": "If you rent a car it’s easier to get from further out. We stayed in Nerano for an affordable price. Parking is not fun, but much easier. Staying in the hotspots is a bit overrated anyway. Also, finding vegan food in Italy is veryyyy challenging. I suggest you start looking at menus now."}, {"username": "Starla Dawn", "comment_text": "Sorrento 💜"}, {"username": "Rachael Richardson", "comment_text": "Sorrento a great base, everywhere accessible by boat, train or bus"}]}, {"id": "2202881736777571", "text": "My son is ending his 6 week trip in Rome and he needs a nice place near to all eateries , beach perhaps where he can sleep and relax , washing etc - suggestions by train - Ponza??", "link": "facebook.com/groups/1373361046396315/permalink/2202881736777571/", "likes": 0, "comments": []}, {"id": "2202937700105308", "text": "When is the best time to visit Italy ? Suggestions for a travel guide? This is our first go there. Thanks everyone 😊", "link": "facebook.com/groups/1373361046396315/permalink/2202937700105308/", "likes": 7, "comments": [{"username": "Renae Larcus", "comment_text": "We like May or Sept/Oct. Look at the Rick Steves guides and videos."}, {"username": "Colleen Dawson", "comment_text": "Depends on what you are looking for and where you will be going since it’s a large country from north to south. Skiing in the north during the winter, summer is very hot all over. March/May and September/ October are milder all over."}, {"username": "Jeff Gentner EA", "comment_text": "Fall is best. We have been 4 times in mid September to mid October and it's always been beautiful."}, {"username": "Gary W Anderson", "comment_text": "Best time is after school is in session to slow crowd size. The cooler season should be slower but have no fear. Do be smart and make copies of every important paper, including cards just in case. Don’t put anything in rear pockets. Most people know some English so getting around is doable. Get a Rick Steves or AAA and library books to research, get skip the line tickets and make reservations ASAP. Trip insurance is relatively cheap, check it out. Base out of central locations to minimize moving bags."}, {"username": "Marie Cuzzi", "comment_text": "My favorite times\nMay or September/ October\nPerfect weather mid 70”s during the day mid 60”s at night …"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Research. Get some guide books. Watch Rick Steves and YouTube videos of Italy. This will give you an idea of where you want to visit."}, {"username": "Michela Zanni", "comment_text": "June or September"}, {"username": "Amy Kaye", "comment_text": "Just not summer, way too hot! Our last day is today, and had to visit now to accommodate our schedules, but would have liked to come in fall or Christmastime!"}, {"username": "Joe Guzzi", "comment_text": "After midnight."}, {"username": "ארז בן טובים", "comment_text": "The best time is when you have the mony to afford it"}, {"username": "Anthony Sperduti", "comment_text": "April"}, {"username": "Karen Cumbo", "comment_text": "Depends what you want to do. I love boat rides and beaches and swimming so I like June but others can’t stand heat or crowds …."}, {"username": "Donna Watson", "comment_text": "May/June in my opinion. Not busy yet and comfortable temps"}, {"username": "Lisa Wylin", "comment_text": "I recommend taking a tour, I did two different Collete tours, just pack your bags and enjoy! Especially for your first time in my opinion. Too complicated, stressful etc to do it yourself!\nMy opinion, obviously lots of people are masters at planning there self, but you learn so much on tours, check them out 🥰"}, {"username": "Schalk Van Wyk", "comment_text": "We went in May and early June this year. A bit of rain in the afternoons, but otherwise perfect weather and not too crowded."}, {"username": "Rebecca Yeoh", "comment_text": "May/ June"}]}, {"id": "2202938793438532", "text": "Thank you \"Bella Italia 🤩\"\nOur vacation in Grado.", "link": "facebook.com/groups/1373361046396315/permalink/2202938793438532/", "likes": 5, "comments": []}, {"id": "2202913883441023", "text": "Has anyone explored the Thermal Spas near Garda? Any thoughts or recommendations? Thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2202913883441023/", "likes": 0, "comments": []}, {"id": "2199240057141739", "text": "The Richardo Medici Palace & Museum (garden) on Via Cavour, in Florence, Italy…\n\nThe inside history & art exhibits were wonderful! Great afternoon spent here! 🌠\n\nWe stayed at an AirBnB across the street… a realआणखी treat! Beautiful art & historical palace of the Medici family…\n\nThere is also a great little restaurant behind it in the next street - right at the garden exit - _Ginori Pizza_. … see comments for more info…", "link": "facebook.com/groups/1373361046396315/permalink/2199240057141739/", "likes": 1, "comments": [{"username": "Andrea Romano", "comment_text": "Can’t wait to see for myself"}, {"username": "Prasanna Menon", "comment_text": "Could you share me the link of Airbnb please ? Thank you"}]}, {"id": "2202574730141605", "text": "I would love to hear of your experiences flying into Bologna. Is it a relatively easy airport to get in and out of? Any advice or things to be aware of? Thank you in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2202574730141605/", "likes": 1, "comments": [{"username": "Gina Rapacioli", "comment_text": "I always fly into Bologna it’s super easy and not a big airport I can’t give much advice to do with travel or anything though as my parents pick me up but there is lots of taxis and buses to the centre if you need"}, {"username": "Daisy Yoo", "comment_text": "we will be flying out of bologna."}, {"username": "Tara Dix", "comment_text": "We did it once, was good because not too large."}, {"username": "JeriLynne Clifford", "comment_text": "We have flown in and out of Bologna and the airport is fine.\nWe prefer flying into Milan so we can get a direct flight vs going through another European airport ie Frankfurt"}, {"username": "Scott Perry", "comment_text": "Bologna is a great airport. There is a light rail train that takes you to the train station in under 10 minutes."}, {"username": "Gina Villanueva-Weinzierl", "comment_text": "Airport is improved over the last years. Super easy and public transport was easy."}, {"username": "Maldida La Virgen", "comment_text": "It's an airport. They're all the same. Signs will be in English, just follow them."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2202904293441982", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2202904293441982/", "likes": 1, "comments": []}, {"id": "2202910606774684", "text": "Hi\nIs there anywhere in Italy, preferably near Milan or Rome, where I can experience a white new year or snowfall during the first week of January?\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2202910606774684/", "likes": 1, "comments": [{"username": "Nadia Filice", "comment_text": "You need to go north of Milan. Near the mountains"}, {"username": "Ingrid Zancoli", "comment_text": "Better in the Dolomites..."}, {"username": "Colleen Dawson", "comment_text": "Take the train to Bolzano or Vipiteno and also experience some beautiful Christmas markets."}, {"username": "Esther Starren", "comment_text": "Trento, Bolzano"}, {"username": "Kristina Ruk", "comment_text": "Nothing can quaranty the snow ;) depends on a year.. skiing areas have snow or artificial ;) not always natural snow"}, {"username": "Chiara Normanno", "comment_text": "Besides the other suggestions I'd add Valle d'Aosta/\nNorthern Piedmont Alps"}, {"username": "Leigh Griffiths-Cole", "comment_text": "Go to Milan and do a day trip on the Bernina Express to St Moritz. We did this first week of Jan this year."}, {"username": "निनावी सहभागी", "comment_text": "Thank you for the suggestions. Really grateful 🙏"}]}, {"id": "2202928400106238", "text": "Looking for recommendations for a good tour from Florence to Cinque Terre please? Thankyou!", "link": "facebook.com/groups/1373361046396315/permalink/2202928400106238/", "likes": 1, "comments": []}, {"id": "2202929033439508", "text": "Hi, wondering if anyone has used Trenitalia with 3 changes. I am thinking to buy a train trom Geneva into Milan with 3 changes (see pic below). Is it a good idea? and is there enough time for me to make changes between these?", "link": "facebook.com/groups/1373361046396315/permalink/2202929033439508/", "likes": 3, "comments": [{"username": "Frannie Kaplan", "comment_text": "You can't find anything more direct? It'll be tiring. If one is late is ruins all your connections"}, {"username": "Meghan Lee", "comment_text": "I did Como - Milan - Parma - Levanto - Riomaggiore all in one and it went fine. Just have to check you are leaving enough time in between for connections and account for delays. Most of my trains were delayed by a couple of minutes so it’s something to keep in mind. Try checking each station on maps to see how many tracks it has. If it’s a big station you’ll need more time to find where to go"}, {"username": "Luca Tocci", "comment_text": "First and third change are okay.\nFor the second one, you only have 7 minutes in order to reach the other train, which is kinda risky. Any delay will make you miss your train.\n\nMake sure you have a B plan."}, {"username": "Colleen Dawson", "comment_text": "We travel this route often and have never have to change. There’s a few stops but no changes."}, {"username": "Gina Baltazar", "comment_text": "Direct from Genova to Milan"}, {"username": "Paola Bersano", "comment_text": "There are a few direct trains from Geneva to Milan, no need to change."}, {"username": "Erica Senes Tombesi", "comment_text": "Nope, something is wrong in your resarch.\nThere is a train from Genova to Milano that cost 9.90€ without change, and another, always without change a little bit faster for 13,45€."}, {"username": "Erica Senes Tombesi", "comment_text": "There is a train at 3,45 pm from Genova porta Principe to Milano Centrale in less that 2 hour...for 13,45 €.."}, {"username": "Barbara Wimboeck", "comment_text": "I think there's a mixing up Geneva = Ginevra in Svizzera!"}, {"username": "Federico Permutti", "comment_text": "Is your final destination Malpensa airport, as per the itinerary, or do you need to travel into the centre of Milan?\n\nAt any rate, Domodossola is a small station, so if the train is on time I’d say you will be fine."}]}, {"id": "2202929616772783", "text": "I would be so grateful for some advice. We would love to spend 4 nights in the Emilio Romagna region, exploring all it has to offer. We particularly enjoy good food, wine and cars/Formula 1. We don’t enjoy staying in cities, preferring accommodation in smaller towns and villages. What town/village would you recommend as a base for exploring the region? We will have a car.", "link": "facebook.com/groups/1373361046396315/permalink/2202929616772783/", "likes": 1, "comments": [{"username": "Judy Jamieson Pisano", "comment_text": "One of my favorite places to stay is Antica Corte Pallavicina. It is out of the way but an easy drive to Parma and many other areas of Emilia Romagna. They have a Michelin star restaurant and the owner, Massimo Spigaroli, is famous for the culatello he makes."}, {"username": "JeriLynne Clifford", "comment_text": "We stayed in Rimini for 2 days and Modena for 5. I know that Modena is a City but it is not crazy busy like Bologna. we don’t like cities you and we really enjoyed it!\nWe did stay at a hotel vs Airbnb. The restaurants are amazing. We went to a salumi museum, Parmesan cheese factory, a winery and balsamic vinegar property where we had lunch and a tour. One day we also did a private market tour and cooking class with a local cesarine. So much fun!"}, {"username": "Berndt Weihs", "comment_text": "Modena!"}, {"username": "Schalk Van Wyk", "comment_text": "We had a wonderful week in a fabulous bnb in Monte San Petro. Bologna not far away and Parma, Modena and Ravenna easy day trips."}]}, {"id": "2202930256772719", "text": "We are flying from Paris to Rome and landing at 11:15 pm. We have an airbnb secured but the owner has said that coming in at midnight is too late and they are unable to accommodate us with that check in time, which we understand. We are excited about the rental and would prefer not to cancel, if we don’t have to. Is there a hotel close to the airport that is reasonably priced for a few hours of sleep for 2 adults and 2 girls (age: 9 and 12). Thanks in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2202930256772719/", "likes": 0, "comments": []}, {"id": "2202937306772014", "text": "We are planning a trip to Salerno, Positano and Amalfi in September. What are the best transport options for day trips between Salreno and Positano/Amalfi, please?", "link": "facebook.com/groups/1373361046396315/permalink/2202937306772014/", "likes": 1, "comments": [{"username": "Dawn Muscarnera", "comment_text": "We used blacklane transport"}, {"username": "Rachael Richardson", "comment_text": "Bus or boat"}]}, {"id": "2202937410105337", "text": "This is what you see at the beginning of summer at Passo Giau, Dolomiti\nIg: eu.pozzi\n#dolomites #passogiau", "link": "facebook.com/groups/1373361046396315/permalink/2202937410105337/", "likes": 1, "comments": [{"username": "Michael Rudder", "comment_text": "Kate Rudder"}, {"username": "Pao Tellez", "comment_text": "How do you recommend to get there from Venice ?"}, {"username": "Ruth Akutu Maccarthy", "comment_text": "❤️❤️❤️❤️ Splendid"}, {"username": "Cindy Neilson", "comment_text": "My daughter and I travelled alongside the Dolomites on our way from Venice to Munich ... the Dolomites were spectacular, as was the picturesque Bavarian countryside.\nTruly beautiful vistas."}]}, {"id": "2202897450109333", "text": "Looking for recommendations for a private driver in rome for a week in October. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2202897450109333/", "likes": 1, "comments": [{"username": "Margo Burrage", "comment_text": "F"}, {"username": "Christine Ann", "comment_text": "Italy tours is incredible. We had them for three days this week"}, {"username": "Allison Carlisle Young", "comment_text": "Check out limousinrome.co\nm we had Giancarlo. We really enjoyed"}, {"username": "Billie Begley", "comment_text": "RomeInLimo is excellent. Used them 3 times."}, {"username": "Samantha McKenna", "comment_text": "Take me,I'll drive. 🤣😜"}]}, {"id": "2202901053442306", "text": "Hello,\nPlease help!!\nWanting to travel Italy next year.\nWhat is the best time of the year and what do you all recommend as a tour for a family of 4 with 2 kids aged 10 and 12. We are thinking a trafalgar tour.\nThanks in advance", "link": "facebook.com/groups/1373361046396315/permalink/2202901053442306/", "likes": 1, "comments": []}, {"id": "2202907416775003", "text": "Hi we are a family of 4 looking to visit nice places in Italy with cooler temperatures than Rome. We will be moving from Rome.\nI have 17 and 13 yrs old kids with me.\nSo need to be fun in mornings and nights 😂\nWe visited Rome, Florence and Venice before.\nThank u", "link": "facebook.com/groups/1373361046396315/permalink/2202907416775003/", "likes": 1, "comments": [{"username": "Pietro Adami", "comment_text": "How about Verona, Garda lake and … Gardaland amusement park?"}, {"username": "Berit Irene", "comment_text": "Lido di Jesolo 😊"}, {"username": "Romana Lavrič", "comment_text": "I agree with Gardaland at Lake Garda, many sports activities nearby, Acquapark, even zoo if you're into it and lots of fun. Next option is Mirabilandia near Ravenna, Miniature Italia, Imola where F1 races are held, Rimini with endless sand beach activities and San Marino just because moma needs good shopping. 🙂"}, {"username": "Lisa Quinn", "comment_text": "Capri is an awesome day for teenagers. Take the chairlift, the funicular, eat along the water, and go to the blue grotto. ￼\nPompeii also very cool as it ￼a live history lesson. Have you guys done Pisa?"}, {"username": "Mai Nguyen", "comment_text": "Y"}, {"username": "Nermine Adel Hatata", "comment_text": "We want to do 2 with the option of moving between them by train or car"}, {"username": "Karrie LeBlanc", "comment_text": "Matera and Ostuni"}, {"username": "Caitlin Adamz", "comment_text": "Dolomites! I know other families with teens who loved the adventure activities."}, {"username": "Roxanne Franquelli", "comment_text": "Beach time?"}, {"username": "Roland Trego", "comment_text": "I highly recommend staying in Santa Margherita Ligure, a chic seaside resort south of Genoa. It is heaven in summer and has a good beach, a good selection of restaurants, and quite a bit of night activity. If not there, then in Camogli. It is quieter and not as upscale, but extremely pretty, too. An advantage of staying in Santa Margherita over the Cinque Terre is that parking is much more available. Also, the town is relatively flat, making it much easier to navigate with children and strollers.\nPortofino: Walk there along seaside, 55 minutes (beautiful!)\nCamogli: 10-minute train ride. Good beach.\nCinque Terre villages: About an hour by train from Santa Margherita. Limit yourself to two villages a day. Prettiest villages (in my opinion): Manarola, Riomaggiore, Vernazza (in that order). There is some magnificent hiking there, but the hikes are somewhat challenging. One path, the Via dell’Amore, is easy, but it has been closed and under repair for several years after heavy rains and a landslide. Monterosso al Mare is the only Cinque Terre village with some parking and a decent beach. In the other villages, you pretty much swim among the boulders of the harbor."}]}, {"id": "2202873050111773", "text": "Hi Everyone. We are travelling to Italy in September/October from Australia. I am not sure when to prebook the high speed train tickets and what is the best site to book through for bookings made in Australia? Thanks 😊", "link": "facebook.com/groups/1373361046396315/permalink/2202873050111773/", "likes": 49, "comments": [{"username": "Nuccia La Volpicella", "comment_text": "Does anyone have the link for trenitalia 50 percent discount for over 60s, I am after the link to register."}, {"username": "SAsh Cox", "comment_text": "Book now. I used Italotreno. Prefer them to Trenatalia."}, {"username": "Mary Balistreri Swan", "comment_text": "Oh Wow lots of Aussies going September/\nOctober, great time to go. 🥰"}, {"username": "Bev Nolen", "comment_text": "We are travelling by train all through Europe in Aug/\nSept and we have booked all our tickets, including high speed ones, we made a decision if it was more than 4 hrs on any train we would book 1st class, we will see how that pans out, will be almost qualified tour guides once we finished this trip, booked everything ourselves, trains accom, events,daunting but glad we did it. we are Aussies too."}, {"username": "Rachel Lange", "comment_text": "I booked all my high-speed and activities here . ￼ because I think the whole world is going there at the moment. ￼"}, {"username": "Lauren Vassallo Beattie", "comment_text": "Booked directly through Trenitalia"}, {"username": "Phyllis Snyder", "comment_text": "Fall is still part of the busy season- popular route get booked up- get on Rome2Rio and get your tickets."}, {"username": "Kylie English", "comment_text": "Hey guys is this the right app you mean?"}, {"username": "Geri Elkin", "comment_text": "I booked through Trenitalia before we went over to Italy, around one month before we left. I only brought tickets for the fast trains and brought the regional tickets directly from the railway station over there or online the night before."}, {"username": "Roz Meineke", "comment_text": "Trainline and Omio are two apps I’ve been using. You don’t need to print out tix. Ferryhopper also great for booking ferries!"}, {"username": "Nina Sutcliffe", "comment_text": "We should start an all Aussie travels italy Facebook page to assist with planning for things like best phone/internet options, travel insurance and all things relative to leaving from Australia. See you all in September."}, {"username": "Trena Kennedy", "comment_text": "Will be there too. From Toowoomba ❤️"}, {"username": "Brig Calcagno", "comment_text": "I go every year and I book all my trains on Trainline app"}, {"username": "Linda Tibbles", "comment_text": "Log on to Trenitalia Web site, and you can book your tickets now; pay for them and the save to your phone."}, {"username": "Linda Tibbles", "comment_text": "Great to see all we Aussies visiting Italy later this year. Italy is like a drug- 1 trip is never enough."}, {"username": "निनावी सहभागी", "comment_text": "Thank you everyone for all your advice 😊. I have now booked all my train travel. So good to hear from all the Aussies out there 😊😊."}, {"username": "Gommy Shirley Pribisco Brady", "comment_text": "We just got back from Italy. I had read that you have to be careful about validating tickets, etc. but my daughter bought ours online, so we didn't have to worry about it. The ride from Rome to Naples was beautiful and allows you to see small towns along the way, that you would miss by another mode of travel. We took the Trentalia Fast Train and it wasn't necessary to book first class bc as far as I could tell, all the cars looked the same to me. Enjoy your trip!"}, {"username": "Jacinta Walker", "comment_text": "We leave in 3.5 weeks and I'm booking all essential transport now. Also travelling with 2 kids from Australia."}, {"username": "Carolyn Liddiard", "comment_text": "As early as you can. I used Trainline App and it was easy and worked perfectly! Here in Italy now from Australia"}, {"username": "Sabrina Lafferty", "comment_text": "Treni Italia"}, {"username": "Amanda Ross", "comment_text": "I used the Omio app and booked as soon as tickets became available.\nSome were released 3 months in advance some a bit later."}, {"username": "Jacqueline Rose", "comment_text": "Going to Italy in Oct/Nov. Found this site easy to use and book with. I only wanted point to point tickets and prices are very reasonable to book in advance. https://\nwww.italiarail.c\nom/\ncity-city-ticket\ns"}, {"username": "Rebecca Goldsmith", "comment_text": "We are going in October from Coffs Harbour!"}, {"username": "Kylie Brown", "comment_text": "This aussie going in winter haha"}, {"username": "Lisa Belleri Douse", "comment_text": "And me too, September/\nOctober. Travelling from Sydney 😁"}, {"username": "Ingrid Tangredi", "comment_text": "Wow!!! Definitely an Aussie invasion! Enjoy all 🥰!!!"}, {"username": "Leanne Bingle", "comment_text": "Elizabeth Colleen Fowler re booking tickets. Read some posts for info"}, {"username": "Sharron Joy", "comment_text": "We are there from 15th September to 18th October. Have booked all my fast trains already as a lot of specials. Some Trenitalia and some italo, booked through their websites."}, {"username": "Suzi Hellmundt", "comment_text": "I looked at Rome to Rio app and they find best price and connections then go to Omnio app. Super easy. I booked tickets early as they do get booked out. Go first class if you can and if available - that extra comfy seat is a nice way to relax as you take in the gorgeous scenery. Not all trains have first class though. In Italy I found the trains very well organised, on time, fast with plenty of people around to assist before you board and while you are on board. The Italian train conductors are charming, helpful and look amazing in their outfits."}, {"username": "Wendy Yates", "comment_text": "I’m from Melbourne I used Omio and Rome to. Rio, got the past 4 weeks. So easy . There earlier the cheaper they are."}, {"username": "Debbie Panizza", "comment_text": "No just get them when you are there it’s easy. Incase the other trains are late, you don’t get a refund. The best app is Trainline, and Rometorio is a must. I just went for 8 weeks in April. enjoy. 😀"}, {"username": "Lori Greco", "comment_text": "I recommend to buy directly from Trenitalia. I have found the other operators are slightly more but that they do not even advertise all the available times, so book directly. Much easier!"}, {"username": "Julie Norris", "comment_text": "I'm travelling from Oz to Rome mid October and booked my trains to Naples and from Sicily back to Rome on the Trenitalia website. Business class silent carriage 😀"}, {"username": "Jen Larkin", "comment_text": "We were in Italy in May- Australians here- we only booked trains before we decided where we were going, we make it up as we go. We had medium sized luggage and it was easy. You can fit them between seats, chuck it overhead , but the trains weren’t busy. You’re past the peak so it should be very doable if you book as you go"}, {"username": "Nicole Condemi", "comment_text": "I used italiarail and booked business class from Venice to Lamezia. All worked out fine."}, {"username": "Dunia Aldyni", "comment_text": "My travel agent booked for me 😍😍"}, {"username": "Janell Regimbal", "comment_text": "Trainline app worked great for me! Booked two fast trains with electronic tickets so we won’t have to validate paper ones."}, {"username": "Christine Broussard", "comment_text": "CoMing from cairns in September too!! 🤪\nHope we actually get to meet some Italians not just aussies!!! 🤣"}, {"username": "Christine Broussard", "comment_text": "Going by train from rome to Naples hoping to catch a fast train which is the best one to go with????"}, {"username": "Kathy Card", "comment_text": "OMIO app"}, {"username": "Clare D Indi", "comment_text": "Following"}, {"username": "Clare D Indi", "comment_text": "Is anyone using eurrail pass ? Or all just individual purchases?"}, {"username": "Liette Demanche", "comment_text": "I’ll be there in sept/oct et and I’ve booked all our train with apps Rome2Rio. It was easy. It gives you all the possibilities and you choose."}, {"username": "Nicole Cleaver- Dietze", "comment_text": "I’m going in September as well. From Canada 🇨🇦 I choose to pre book as I know what days and times I want to move from city to city. I used trenitalia website."}, {"username": "Annette Sparks", "comment_text": "Do it now through Trenitalia. We booked ours for September about 3 months ago."}, {"username": "Rachel Cielens", "comment_text": "Oh man, from Australia here also and we were in Italy in January. Oh my oh my I wish we were going back with what sounds like everyone on this thread 😂. We booked through Omio for our trains in Italy. We used rail Europe to book train from Paris to Naples."}, {"username": "Carol Hamilton", "comment_text": "Going in September\nBooked our trains a few months ago with Trainline\nPut a copy on phone wallet and also printed out a hard copy in case"}, {"username": "Justine Garment", "comment_text": "I went with booking Trenitalia direct on web. Also going September. Booked first for 2 long trips and business for rest. Suggest booking ahead (like now) as its still very busy through Italy in September."}, {"username": "Julie Angel Bruther", "comment_text": "Trainline app. Book now"}, {"username": "Kathy Whiting", "comment_text": "From Australia and been here 2mths - Trainline and Italo for Italy and I would be booking now though"}, {"username": "Catherine Toms Bengough", "comment_text": "I used “man in seat 61” website: great advice and all links are listed."}, {"username": "Russ Whitley", "comment_text": "Check out the seat61 web site has a lot of info on Italy trains in Euro section. The main site for booking fast train is Trenitalia"}, {"username": "Janine Bryan", "comment_text": "We are traveling to Italy from Australia in September and have used the Omio app to book all train travel- gives you options of cheapest/ fastest routes etc"}, {"username": "Amanda Carter", "comment_text": "We are in Italy now from NZ and we booked all ours through Trainline. Download the app and book them now. It’s very easy. Also a tip would be to book business/first class as there is more room and there are a lot of travellers with suit cases etc. and there isn’t much in it $$$ wise. Have a the best trip."}, {"username": "Robyne- Robby- Nimmo", "comment_text": "You can’t book trains until a month beforehand"}, {"username": "Robyne- Robby- Nimmo", "comment_text": "The websites are a bit tricky. They tend to drop out a lot. Just travelled from puglia to Napoli a couple of weeks back. First class isn’t really like first class. Was glad we bought our own lunch."}, {"username": "Jane Colliver", "comment_text": "I’m going Sept booked trains through trenitalia website cause I couldn’t download app some trains I also used trenlord as well. I did look on third party sites to find which trains were cheaper because they list all then went to company direct. Copy on phone plus printed version as well."}, {"username": "Christine Broussard", "comment_text": "We looked last night and there are several booking options, seems pretty easy but we are going to run it passed our travel agent this morning\nItalo let’s you tick senior but the prices come up the same…. 🙄"}, {"username": "Janet Ottaiano", "comment_text": "https://\nwww.lefrecce.it/ Trenitalia. Book asap."}, {"username": "Beverley Bedford", "comment_text": "Me too"}, {"username": "Sherrin Wake Bracci", "comment_text": "Another Australian family travelling Italy Sept/October 😃"}, {"username": "Jacky de Beer", "comment_text": "We went to Rome in June and found it cheaper to book train tickets in advance. It gets quite expensive closer to the travelling time"}, {"username": "Sue Levy Avinir", "comment_text": "Trenitalia. Use the app."}, {"username": "Nancy Cioffi Caccamo", "comment_text": "Italo is the best. The trains are cleaner and more comfortable"}, {"username": "Tom Walsh", "comment_text": "Book direct with Italo or Trenitalia."}, {"username": "Penny Hogan", "comment_text": "I use Rome2Rio app. It shows all modes of transportation from A to B and then you can book direct. Have booked bullet trains on Italo but that’s only because of times we wanted. Italo is privately owned. Trenitalia is government owned bullet train. This app will also show flights, ferries, buses & drive options. Worth a look"}, {"username": "Fiona Cameron", "comment_text": "Im going in September, prebooked all train tix on the Trenitalia website, there is an English option but you must use Italian place names Roma= Rome Firenze= Florence etc. Tix are emailed to you and you can print in case there are issues with your phone (buy Airolo esim -iphone for data make calls using Whatsapp or messenger)\nIf you cannot see option for the train you want on the day/time you want just keep checking back every couple of days. Some ling journeys I was able to book mths ago and some still aren’t open for booking.\nHappy travels !! I’ll be there 4/9- 13/10"}, {"username": "Donna Mosley", "comment_text": "We’re coming over in Sept too and booked out tix on Trenitalia website."}, {"username": "Lynn Gill", "comment_text": "I don't know your age, but if you are a Senior here in Australia, you should register as a Senior when booking your train tickets!"}, {"username": "Mari Moore", "comment_text": "Ha ha us too and booked first class seats for longer train journeys on Trainline , super easy . Book as soon as you soon can as big savings when booking earlier !!!"}, {"username": "Leah Nicole", "comment_text": "Vicky Mac the Aussies are coming"}, {"username": "Suzi Burke", "comment_text": "Family of 4 travelling in Sept / Oct too, from the Gold Coast to Europe! Woohooo"}, {"username": "Jenn Messina Babore", "comment_text": "TrenItalia is the direct site. Tickets usually open up about 60 days before. Best time to book is once you know your plans as any promos can fill up and then you pay more per ticket."}, {"username": "Rachael Ann", "comment_text": "I used Italo from Australia in July. Pre-booked a few months in advance. Easy to use on the app or PC. We didn’t have any issues with them and all trips were brilliant."}, {"username": "Shreya Hegde Tandon", "comment_text": "We’ll be travelling from Melbourne Sept 2024 so any tips or info you’d like to pass on post your trip would be greatly appreciated ☺️\nEnjoy your holidays!"}, {"username": "Sarah Kam", "comment_text": "I used the train line app and it was so easy."}, {"username": "Line Gregoire", "comment_text": "I always book on Italo website❤️"}, {"username": "Kiralee Philpot Phillips", "comment_text": "F"}, {"username": "Tanya Cutri", "comment_text": "I'm going next week & booked mine through the Trenitalia app & Italo website. If using the website, make sure you let your bank know before you use your credit card. I'm with NAB and they blocked my card & locked me out of my app bc they thought my card was compromised. Had to go into a branch & prove my identity before they would unblock it"}, {"username": "Trudy Smithers", "comment_text": "We're from Australia and travelling Italy in September too. We are hiring a car and road tripping, and catching a train when we go into major cities. I recommend the Rome2Rio app to help plan your train trips."}, {"username": "Georgia Shorland", "comment_text": "We booked our high speed trains 3-5 days out from when the train ride would be. We booked directly through trenitalia and found it very simple ☺️"}, {"username": "Julia Muller", "comment_text": "We travelled from Australia June/July - can’t believe we’ve been home two weeks😭😭😭 - and booked our train fares through the SNCF app. They even sent physical tickets in the mail, which was a surprise! And if you haven’t already come across it, try the Tripit app to store all your plans - I was always the queen of the folder of printed confirmations/\ntickets etc but decided to use an app this time, and it was fantastic!"}, {"username": "Ella Barassi", "comment_text": "Hi! Also an Australian 🇦🇺\nMy family and I used the Trainline app which was honestly a life saver. You can book easily on the app and then it stores your tickets in the app as well as sending email copy. We printed our tickets but didn’t use printed versions at all"}, {"username": "Sharleen Maxwell", "comment_text": "I was going to buy a eurorail pass... We will be in UK first, then France, Switzerland, Italy. Is buying tickets individually a more common option? Going in Oct too from AU😁"}, {"username": "Lash Mink", "comment_text": "Book earlier to get cheaper prices. Trenitalia ."}, {"username": "Judith Thomson", "comment_text": "We are travelling from oz in August 🤗- booked our train tickets with trenitalia, we needed to amend a booking and they were so helpful, and very responsive 😃"}, {"username": "Rebecca Yeoh", "comment_text": "You can pre-book now via Trenitalia. Make sure you select your seats in advance (upgrade to business where you can, it makes a difference). You just need a QR code when you arrive at the train station which you can print out on your ticket or scan from your email > https://\nwww.trenitalia.c\nom/en.html"}, {"username": "Sian James", "comment_text": "We arrive beginning of September & I booked my tickets this week via Omio. I don't know if booking now has made the tickets any cheaper but its one less thing to think about closer to the time & I picked Omio as I've seen it mentioned in this group quite a bit"}, {"username": "Karyn Bjelke-petersen", "comment_text": "We are all likely to hear aussie accents in September! Visiting then also!"}, {"username": "Noelene Cameron", "comment_text": "I used Trainline app for all my train bookings in UK, Italy and France. Very easy to use and provides multiple choices/\nprices.\n\nhttps://\nwww.thetrainline\n.com/"}, {"username": "Nicole Von Ahn Naturopath", "comment_text": "Hi. We are travelling from Australia at the same time! 💕"}, {"username": "Shannon Cox", "comment_text": "Hi, we're travelling from Australia at the same time too. I booked our train tickets on the Trenitalia website last weekend."}, {"username": "Helen Kalloniatis", "comment_text": "I'm travelling with adult children around Italy in September. Book via Trenitalia, and you'll be able to book seats etc."}, {"username": "Luisa Grant", "comment_text": "Hi I am traveling from Australia as well in october and have booked all our train tickets through the australian trenitalia website. The earlier you do it the cheaper it will be. https://\nitaliatren.com/\nen/\nour_offices_in_t\nhe_world?gclid=\nCjwKCAjwlJimBhA\nsEiwA1hrp5gG-I4\nPtCo9VDpfSQXydf\nZuax59aEEjYcvYt\ndiL5qHor0tHrqNH\nDihoCl3gQAvD_Bw\nE"}, {"username": "Joanne Nacson", "comment_text": "We booked our fast trains through Trenitalia website a few weeks ago"}, {"username": "Meghan Lee", "comment_text": "Australian 🇦🇺 Book through Trenitalia & Italo websites, compare prices & times to find what suites you best before booking. Book asap for the speed trains as they get more and more expensive closer to the date."}, {"username": "Simone Fiebig", "comment_text": "Same for us . My cousin just got back and recommended Omio app."}, {"username": "Kylie Eagleton", "comment_text": "I did trainline and trenitalia - trainline was cheaper for some trips- I’d book now as I did mine last week for October and seats were filling up"}, {"username": "Shannon Watts", "comment_text": "Returned home to Sydney two weeks ago from a month in Sicily and mainland.\nPre booked Trenitalua also. Super easy. Put a soft copy on your phone and print another in case your phone dies. Good service.\nHave fun!"}, {"username": "Kerry Jacobsen", "comment_text": "I think there’ll be more Aussies in Italy than in Australia in September/\nOctober. We’ll be there too!"}, {"username": "Leisa Davis", "comment_text": "Also travelling in September.\nI’ve booked weeks ago using Trenitalia website.\nI also have the Trenìt app on my phone, to always check for strikes."}, {"username": "Toni Rugari", "comment_text": "We will be there too 🇦🇺"}, {"username": "Wendy Linklater", "comment_text": "I am Australian, we are also going in October, been a few times before as well. The easiest app to use is Trainline, it's in Aud, and keeps all your tickets in 1 place, you can go direct for a few $ less, but trainline is so easy to use. Buy tickets as soon as they become available, about 12-16 weeks ahead, as they only get dearer."}, {"username": "Teresa Nadjarian McGrady", "comment_text": "Same going Oct. booked via Omio and trainline"}, {"username": "Toby Levy", "comment_text": "I just got back. Booked all our tickets on italo because the app and website were easy to use and able to be uploaded from Australia (some are not). The one train I didn’t prebook because I wasn’t sure what time I was going to need, I walked into the italo office in Naples train station and bought on the spot. Staff were helpful and was easy."}, {"username": "Herbert Hodgson", "comment_text": "Looks like an Aussie invasion come Sept/October 😊\nWe will be there too. I’ve already booked our train tickets and internal flights etc all very easy."}, {"username": "Clint Fisher", "comment_text": "We will be in italy end of october to"}, {"username": "Leigh Cooksey", "comment_text": "Hi we are just back, try to book first class- way better when you have luggage"}]}, {"id": "2202878516777893", "text": "Just wanted to share this video I took yesterday 🇮🇹🥰\nWe hired a boat with a captain for 7 hours. He organised lunch for us at Tonnarella restaurant where you had to transfer to another boat taxi to get there. It was a very special day ❤️", "link": "facebook.com/groups/1373361046396315/permalink/2202878516777893/", "likes": 16, "comments": []}, {"id": "2202561556809589", "text": "Has anybody travelled from Napoli Beverello to Amalfi on a ferr￼y with NLG? How does it work with luggage and suitcases? Are we allowed to take suitcases on the ferry?", "link": "facebook.com/groups/1373361046396315/permalink/2202561556809589/", "likes": 1, "comments": [{"username": "Kay Rendall", "comment_text": "Naples to Amalfi is fine. Almafi is mainly flat, depending where your hotel is. Time etc. Lots taxis but ask check a price and if it seems ridulous walk away from them. Usually someone will come up quietly and give u a good price.\nThere is a taxi price u can check on line, or Rome rio u might be able to check a price."}, {"username": "Joan Andromidas", "comment_text": "When you purchase your ticket or when you pick up your tickets for the ferry, let them know how many bags you have. I think I paid $3 for my suitcase when I took the ferry from Sorrento to Capri. They don't charge for backpacks which you can put between your feet or on your lap.\nAs you get on the ferry, there's an area where all the luggage goes and you drop your bag there, then you go inside to sit down. You just grab your luggage when you're getting off the ferry at your destination. All the ferry companies I took had the same setup."}]}, {"id": "2202831920115886", "text": "Hi !\nIs someone in Venise and want to share a gandole ? i mean i pay 40e and her 40e ? and we tane pictures for each other . Im alone and i dont want to waste 80e .\nTell me if interested today.", "link": "facebook.com/groups/1373361046396315/permalink/2202831920115886/", "likes": 1, "comments": []}, {"id": "2202862220112856", "text": "Can anyone recommend a private tour company that does underground Colleseum tour in the morning?\n\nWe have been totally screwed over by the The Tour Guy who changed the time by 4 hours and now refuse to refund us. Totally ruined our plans so we won’t a reputable company. We only have 24 hours in Rome which is why we can only do AM tour.", "link": "facebook.com/groups/1373361046396315/permalink/2202862220112856/", "likes": 3, "comments": [{"username": "Victoria Laverty", "comment_text": "Try withlocals.com"}, {"username": "Cheryl Kavanagh", "comment_text": "Hi Tanya, if you download Rick Steves auto you don’t need a guide, 🙂"}, {"username": "Jamie Bly", "comment_text": "Walks has underground tour of coliseum."}, {"username": "Shen Min Chue", "comment_text": "if your day of visitation is more than 30 days away, you should try Coopculture, the official website, there will be no cancellations and no change of timing."}, {"username": "Michelle Bergman Davis", "comment_text": "We used Get Your Guide, and our tour guide was fantastic!"}]}, {"id": "2202838783448533", "text": "This is a query on application of Visa for Italy at VFS, Kolkata, India...need to know the maximum number of days one can apply for visa in advance. As per the website, it is maximum of 180 working days.\n\nRequesting members from India for their experience on the matter please. Thanks in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2202838783448533/", "likes": 0, "comments": []}, {"id": "2202846913447720", "text": "We’re a group of 6-7 women going to Venice in October.\n\n1. Can you recommend where to stay? Something nice, yet affordable? Some apartment perhaps?\n\n2. I will celebrate my birthday during the trip and would like to offer my friends some nice experience / memory. Can you recommend something that is not too costly? Some dinner venue, cooking class etc.? All ideas are welcome!\n\n3. Any other ideas and recommendations on what to see and do are also welcome!", "link": "facebook.com/groups/1373361046396315/permalink/2202846913447720/", "likes": 1, "comments": [{"username": "Angela Brown Walters", "comment_text": "Use the visitacity.com app it is spectacular!!\nShows you what's close to each other, approximate length of time each places takes to visit, days & hours place is open/closed, cost & what tube stop is closest. You will find suggestions of places to visit you haven't heard of and can move things around to fit with your needs. You can enter into the planner sitting at a park and people watching for hours or taking a mid day nap. It color codes each day on a master map so you can visually see what's been planned. I've only used it in London but from what I've seen it will work as brilliantly in almost all cities in the world."}, {"username": "Bev Madill", "comment_text": "I booked a great apartment through Truly Venice Apartments last year. Close to everything and quite reasonably priced. Sounds like you’ll have a lot of fun."}]}, {"id": "2202569080142170", "text": "Hi everyone,\n\nWe’re heading to Italy in about a month. We’ve got everything down pat except for 1 day.\n\nWe’re trying to decide whether to go on an organised wine tour from Florence into the Tuscan countryside, or whether to hire a car and do a self drive tour.\n\nDoes anyone have any tour or self drive itinerary suggestions?", "link": "facebook.com/groups/1373361046396315/permalink/2202569080142170/", "likes": 0, "comments": [{"username": "Bill Ulrich", "comment_text": "Hire Chianti/Tuscan locals to pick you up in Florence, give you a great wine experience, \"Tuscan Yes\" tour:\nhttps://\nwww.tuscanyestou\nr.com/"}, {"username": "Rebecca Yeoh", "comment_text": "I just went in June for 3 weeks and did an organised day trip around Tuscany (from Florence). I loved it so much that it was one of the highlights of the whole 3 weeks. Def recommend, esp being driven around after wineries. I booked through Walkabout Tours 👌🏼"}]}, {"id": "2202570903475321", "text": "Hi! Just wondering what you might recommend for the best \"Rome in a Day\" tour. My 18 year old daughter and I are going in October and have limited time to spend in Rome.\n\nIve been trying to do some research on Walks Tours vs Viator. Same (ish) tours just one is more expensive than the other. Any opinion on which is more reputable?!\n\nThanks in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2202570903475321/", "likes": 3, "comments": [{"username": "Ken Lerch", "comment_text": "If you have gone through the usual sites (trevi, pantheon, coloseum/\nforum, vatican, steps, etc.) and only if you would appreciate what is considered the best example of baroque sculpture, get reserved tickets to see the Bernini sculptures at the Villa Borghese."}, {"username": "Anthony Martini Jr.", "comment_text": "One day isn't enough for any tour. Just the Vatican takes days to see, no colosseum"}, {"username": "Vivienne Smith", "comment_text": "The hop on hop off buses are worth every penny"}, {"username": "Elena Innocenti", "comment_text": "Colosseo, Via dei Fori Imperiali, Piazza Navona (you can have time for lunch in this area), Pantheon, Fontana di Trevi, Piazza di Spagna. If you have time, Villa Borghese with Pincio view."}, {"username": "Marie Cuzzi", "comment_text": "Hop on hop off bus\nSee the colosseum"}, {"username": "Jenn Messina Babore", "comment_text": "Golf cart tour!"}, {"username": "Tracy Foss", "comment_text": "Hop on hop off bus are good for seeing everything or golf cart tour gets you closer to the sites. Never had a problem with Viator"}, {"username": "Matthew Cawley", "comment_text": "We did The Roman Guy tour of rome in a day. Lot of walking but worth it"}, {"username": "Sue Levy Avinir", "comment_text": "I hear the golf cart tours are great"}, {"username": "Bellafab Fabrizio", "comment_text": "Hop on hop off buses or the golf cart tours just dont do a walking tour"}, {"username": "Lisa Martinson", "comment_text": "I’ve had great tours both ways. Some art & history students used to stand outside by the coliseum & give tours for tips. I’ve done a viator as well but make sure you get a guide w a driver."}, {"username": "Sue Sherwood", "comment_text": "Jump on the big red bus. We loved it!"}, {"username": "Karrie LeBlanc", "comment_text": "We are in Rome now. 2 daughters 18 and 20. The main sites and routes are insanely busy. If you have a chance consider adding these less frequented spots that we loved. Doria Pamphilj on Via Del Corso, Musuem of the Baths of Diocletian, Palazzo Colonnade (only open Friday and Saturday morning to 1pm) was stunning and the Barberini National Gallery."}, {"username": "Caitlin Adamz", "comment_text": "Whatever you do, get up early. We had trevi fountain and Spanish steps all to ourselves at 5:30 and St. Peter’s was a ghost town at 6. So worth it."}, {"username": "Donna Mangone", "comment_text": "Trevi Fountain, Spanish Steps, Piazza Navona, Pantheon, Colosseum. Lots of walking but well worth it."}, {"username": "David Hibbs", "comment_text": "The tour guy does a Rome in a day tour. It’s about 6 or 7 hours but you see all the main stuff. Would recommend."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2202580216807723", "text": "Hi everyone 😊\n\nWhat other towns should we consider visiting while we are staying in San Gimignano in September next year? We will have a car.\n\nTIA", "link": "facebook.com/groups/1373361046396315/permalink/2202580216807723/", "likes": 0, "comments": [{"username": "Sue Levy Avinir", "comment_text": "Montereggioni. Volterra"}, {"username": "Ana Stevan", "comment_text": "5 terre - park car in La spezia under train station !!!\nMust see is really very nice plan 1 day ful or 2 day.\nPiza - leaning tower and souronding. 😉😀"}, {"username": "Dr-Jon Warnecke", "comment_text": "Siena, Pienza, Orvieto, Val d'Orcia, Cortona, Perugia, Assisi"}, {"username": "Fetchin Gretchen", "comment_text": "Here are some towns you could consider visiting while staying in San Gimignano in September next year:\n\n* **Monteriggioni\n** is a beautiful medieval town that is only a short drive from San Gimignano. It is known for its imposing walls and towers, and it makes for a great day trip.\n\n* **Volterra** is a larger town than San Gimignano, and it has a more authentic feel. It is known for its Etruscan ruins, its alabaster workshops, and its medieval center.\n\n* **Siena** is a must-visit for any trip to Tuscany. It is a beautiful city with a rich history and culture. Be sure to climb the Torre del Mangia for stunning views of the city.\n\n* **Castellina in Chianti** is a charming town in the Chianti region. It is known for its wine, its medieval architecture, and its views of the surrounding countryside.\n\n* **San Miniato** is a hilltop town that is known for its truffles. It is a great place to visit if you are interested in trying this delicious delicacy.\n\n* **Lucca** is a walled city that is located in the region of Tuscany. It is known for its beautiful architecture, its Piazza dell'Anfiteatro\n, and its Leaning Tower.\n\nThese are just a few suggestions, of course. There are many other great towns to visit in Tuscany. With a car, you will be able to explore the region at your own pace and find the places that you love the most.\n\nI hope you have a wonderful time in Tuscany next year!"}]}, {"id": "2202600146805730", "text": "Is it doable to spend one month in Italy on a 2k euro budget or even less? My husband and i are in our early 70s.. i donot know how to go about it. . Staying in an Airbnb then hop on trains to visit towns. Im scared we might get lost or miss the stops..we are not tech savy. Im thinking our base will be in beautiful Florence. I have visited this place before but have not been to the surrounding towns or cities. Thank you😊", "link": "facebook.com/groups/1373361046396315/permalink/2202600146805730/", "likes": 1, "comments": [{"username": "Bill Ulrich", "comment_text": "The best lodging, on a budget and wanting peaceful stay is with the various monasteries that offer BnB accommodations.\n\n\nhttps://\nwww.monasterysta\nys.com/\n?a=search&locati\non=Italy&_ref=n\navtab"}, {"username": "Dave Conroy", "comment_text": "Worth remembering Airbnb accommodations may often offer week or month (28 day) discounts. My place for a month is 40% cheaper, for example. Also, you can cook and do laundry usually. This will save you. Local buses and trans will be a good option. Learn how to use Google Translate, Maps and Adobe Lens. If you don't want to learn these tools then you will be restricted, and it will cost you more to use taxis or limit your options. Trainline is a good App/website bringing all/most train options together in one place and in English."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Come in autum (Oct/Nov) and as Florence is really expensive choose another smaller well connected town, airbnb will be much much cheaper and you’ll be able to do day trip around both renting a car or by train.\nThis will make you save hundreds of €.\nPisa could be a good choice as it’s super well connected by bus and train in all directions (east-Florence,\nnoth-5 Terre, south) and also with an airport with Ryanair: in autumn you could also do small weekend trips in Sicily or in Puglia."}, {"username": "Joseph DellaFave", "comment_text": "No"}, {"username": "Ruth Akutu Maccarthy", "comment_text": "2k excluding accommodation and flight...it all depends on how many places you want to visit...I think you should make it 4k counting logistics, food , places to visit.\nRegarding the trains don't worry always ask people when you get on, they'll help you"}, {"username": "Ana Stevan", "comment_text": "I would say to come in Italy out of seson and below at least 25 degree. ( and not in of school days - KAOS 🤣😅🫣 FERA AGOSTO) 2.K is a little bit to love. For 1 mounth."}, {"username": "Renae Larcus", "comment_text": "Look into an agriturismo to stay in. I bet you will find it cheaper than an Airbnb."}, {"username": "Laura Uribe", "comment_text": "If you’re talking about staying in Florence and the $2000 is just your lodging, then absolutely. But all inclusive, not likely. The times have changed and inflation is everywhere. Even before COVID, back in 2019 less air, we still spent about $3500 for two when you factor in lodging, food, entrance fees, train and bus fares. Italy train system is super easy. If you download the Trenatalia app, you can buy your tickets online and not have to validate them before you get on the train.\nMaybe cut back to 2-3 weeks? People are super friendly and helpful."}, {"username": "Tracy Foss", "comment_text": "It's probably cheaper to stay in smaller places & take the train into the cities to see the sites"}, {"username": "Julia Titus", "comment_text": "No, $2000 for a month in Florence is not enough, as others said."}]}, {"id": "2202600516805693", "text": "I have a flight from Athens to Venice with a plane change in Rome that is only 1hr10min. Same airline booked directly with ITA airways. Is it correct that they will pass the bag on to my next flight and I just go to the next gate to catch the flight ? If there is a delay will they put me on another flight to get there ?", "link": "facebook.com/groups/1373361046396315/permalink/2202600516805693/", "likes": 0, "comments": [{"username": "Louis Des Forges", "comment_text": "Yes as its within the EU you won't need another security check in Rome."}]}, {"id": "2202601986805546", "text": "We are planning a trip to the Amalfi coast area next May.\n\nLooking for a seaside hotel or resort with pool / water access and terraced views in either Sorrento, Positano or Amalfi. Close to excellent restaurants and bars. Under $1,000 USD per night\n\nAppreciate any recommendations, concerns or suggestions.", "link": "facebook.com/groups/1373361046396315/permalink/2202601986805546/", "likes": 2, "comments": [{"username": "Katherine Azcue", "comment_text": "Hotel continental in Sorrento is spectacular!!!"}, {"username": "Sandy Radican Shikaly", "comment_text": "Grand Hotel La Favorita in Sorrento.. 5 star property.. rooftop pool/bar"}, {"username": "Kally Trahearn", "comment_text": "Hotel Plaza Sorrento has a rooftop bar and infinity pool, really lovely staff in there, great breakfasts and less than a minute's walk from Piazza Tasso."}, {"username": "Gina Romano Peralta", "comment_text": "Hotel Luna convento in Amalfi or excelsior vittoria in sorrento"}, {"username": "Darryl Vanstone", "comment_text": "Hotel Corallo Sorrento in ‘Sant Agnello\nShuttle to sorrento, awesome service, amazing views."}, {"username": "Hannah Hudson Nadler", "comment_text": "We ate dinner at Hotel Miramalfi and it seemed to have all of these things! Gorgeous view and pool. Walkable to the city"}, {"username": "Maria Theresa", "comment_text": "Hotel Poseidon in Positano is amazing!!"}, {"username": "Elena Eckley", "comment_text": "Excelsior is amazing"}, {"username": "Samantha Claire", "comment_text": "Hotel capadimonte in Sorrento"}]}, {"id": "2202602276805517", "text": "￼suggestions on a night tour company for the Collosseum in Rome? Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2202602276805517/", "likes": 0, "comments": [{"username": "Victoria Laverty", "comment_text": "Coop culture\n\nWalks italy"}, {"username": "Nicole Gouzoules Sheehan", "comment_text": "We booked through Viator and had an amazing tour yesterday!"}, {"username": "Frannie Kaplan", "comment_text": "Roma sotterranea? Intineroma?"}, {"username": "Christine Sanci-Gentile", "comment_text": "Mybesttour.com\n\nGolf cart tour"}, {"username": "John Bruckman", "comment_text": "Dragonfly Tours Italy"}]}, {"id": "2202603760138702", "text": "Hi everybody. Great group btw.\nAnybody advice me for good WALKING app for Venice or even for whole country.\nThank you.", "link": "facebook.com/groups/1373361046396315/permalink/2202603760138702/", "likes": 3, "comments": [{"username": "Julia Podgórska", "comment_text": "What do you mean by walking app?"}, {"username": "Giovanni Pianigiani", "comment_text": "In Venice -of course walking 😅 - you can navigate your way with Google maps (and I found out in Pompeii too).\nElsewhere what are you looking for, an app with trails in the countryside?"}, {"username": "Fetchin Gretchen", "comment_text": "Caveat that I have not tried any of these apps I located on a search so please provide feedback if you use any.\nHere are some of the best reviewed walking apps for Venice and Italy:\n\n* **Ecco Venezia!** This app offers a variety of self-guided walking tours of Venice, including historical tours, food tours, and art tours. The tours are available in English and Italian, and you can download them to your phone so you can use them offline.\n\n* **Venice Offline City Map** This app provides detailed maps of Venice, including street names, landmarks, and points of interest. You can also use the app to find walking directions, public transportation schedules, and tourist information.\n\n* **Discover Venice - Venezia Tour** This app offers a variety of walking tours of Venice, including a Grand Canal tour, a hidden gems tour, and a food tour. The tours are available in English, Italian, French, German, and Spanish.\n\n* **Venice Map and Walks** This app provides detailed maps of Venice, as well as a variety of walking tours. The tours are available in English, Italian, French, German, Spanish, and Portuguese.\n\n* **Komoot** This app is not specifically designed for Venice, but it can be used to create custom walking routes anywhere in Italy. The app provides detailed maps, turn-by-turn directions, and elevation profiles.\n\nI hope this helps!"}, {"username": "Gianna Onesi", "comment_text": "Just Trip"}, {"username": "Yulia Teleshevsky", "comment_text": "Thank you everyone for your suggestions, I thing using Google map is easy."}]}, {"id": "2202607490138329", "text": "Hi everyone, we will be in Florence, Rome and Sicily in August/September. I am a keen weaver and would like to know if there are any likeminded people in this group who have visited a weaving studio, weaving related shops or purchased any Italian fibre in these areas that could share some links or recommendations. Wool, flax, linen etc.\nI will also ask in FB weaving groups.\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2202607490138329/", "likes": 2, "comments": []}, {"id": "2202609160138162", "text": "Hello everyone. Planing trip to Northern Italy in mid October. Milan lake como, turin, alba and bologna. Any good recommendations for hotels and restaurants? Any wineries in piedmonte?", "link": "facebook.com/groups/1373361046396315/permalink/2202609160138162/", "likes": 0, "comments": [{"username": "Colleen Carollo Oxsalida", "comment_text": "We stayed here in Bologna. Really interesting hotel (the whole art aspect). It was very nice and had a fantastic breakfast! https://\nen.art-hotel-com\nmercianti.com/\nm2/"}]}, {"id": "2202609730138105", "text": "My group of 9 is going to Venice , Florence, Rome and Naples\n\nI would like to take a hands on tour of cheese making - anyone know of anything like that in one of those areas ?", "link": "facebook.com/groups/1373361046396315/permalink/2202609730138105/", "likes": 0, "comments": []}, {"id": "2202610806804664", "text": "Me and my brother and son are traveling to Rome in August (first time), are there any good swimming spot or ocean spots ?", "link": "facebook.com/groups/1373361046396315/permalink/2202610806804664/", "likes": 0, "comments": [{"username": "Elena Eugeni", "comment_text": "Romans usually go to the seaside for a daytrip in Ostia, Fregene, Anzio e Nettuno, you can reach them by train. If you want to travel a bit more, there are nicer beaches in the Circeo coast (Sabaudia, San felice), which also offers some nice trails for hiking in the national park.\nRome also has a water park called Hydromania. It's quite fun, nothing exceptional but it's loved by teens and families"}, {"username": "Giovanni Pianigiani", "comment_text": "Unfortunately I'd say that the beaches close by are ok if you are in Rome and you want to spend a few hours away from the city heat, but they're not places which people choose for a seaside vacation. Sabaudia is indeed much better but is still a couple of hours away each way"}]}, {"id": "2202610926804652", "text": "Hi we’re doing our first trip from Australia looking at going start /middle of may is this a good time ?\nAlso looking at doing 2 Mediterranean cruises from Barcelona down to Greek islands with Rome stay in the middle\ngood idea ? Going for a month", "link": "facebook.com/groups/1373361046396315/permalink/2202610926804652/", "likes": 0, "comments": []}, {"id": "2202611983471213", "text": "Looking at visiting Italy next March. Is it too cold? Will everything be closed?", "link": "facebook.com/groups/1373361046396315/permalink/2202611983471213/", "likes": 7, "comments": [{"username": "Anthony Attanasio", "comment_text": "I love Italy in winter. There are fewer tourists."}, {"username": "Anna Izzo", "comment_text": "I was there this past March, and it was the end of the off-season, so I think it was less crowded and a little less expensive not that it’s a pricey place anyway, and the weather was fantastic for all of the walking we had to do! Definitely some cooler days but mostly in the 60s. Highly recommend traveling there that time of year"}, {"username": "Berndt Weihs", "comment_text": "Nothing will be closed in March! Yes in August most is closed by \" Ferragosta\" the tradionell italian vacation month.And the tempature depends from the region you want to visit"}, {"username": "Nancy Kirby", "comment_text": "Maybe cold, but all open"}, {"username": "Isabelle Avl", "comment_text": "Why would things be closed in March ? I don’t understand your issue.\nAre you talking about temperatures way below 0 degree, that would eventually keep Italians indoors, hiding until spring comes, like in some places in Canada where they have 2 meters of snow???\nRest assure, people go out in March. They go to work, they travel, you can even ski in March in Italy if you want.\nBut depending on where you are planning to go, (North, Center or South), temperatures range from a high of (14/15 °C) in the south to a low of (0/4°C) in the North.\nSometimes it’s cold, even humid but cool.\nAnd sometimes it even feels like Spring with sunny days and warm temperatures.\nBut it’s a good time to visit places they are usually super crowded."}, {"username": "Gundega Barkane", "comment_text": "Rome end of March was great 18-20 C. One day of hailstorm though and bit chilly in the morning"}, {"username": "Zoli Berecki", "comment_text": "In Dolomits it's ok ... but be sure you're equiped for skiing 😏😏"}, {"username": "Brandy Humphrey Jacobs", "comment_text": "I’m will be there in mArch too."}, {"username": "Meily Orozco Grigg", "comment_text": "Hanging with the locals is the best part. I prefer to travel to a foreign place off season because I get to experience the true pace, routine and people !"}, {"username": "Sally Warren", "comment_text": "Nothing will be closed except for beach resorts. Too cold? Depends where you go."}, {"username": "Jazz Caldwell", "comment_text": "Yes, it will be cold but not intolerable. Just bring lots of layers. I live in Hawaii and it was very cold for me but an extra layer and sometimes two helped. I wouldn't have missed anything about the trip."}, {"username": "Irene Oda", "comment_text": "What us too cold for you? Exactly what do you understand by 'closed' ? Italy is a country, it doesn't open nor close. There is year round population and year round tourists. It doesn't operate like a fairground. Please elaborate more."}, {"username": "Norbert Tóth", "comment_text": "We visited Southern Italy (Bari, Puglia) in March and the weather was perfect. A comfortable 24-26 Celsius"}, {"username": "Theresa Salerno Adams", "comment_text": "No not at all"}, {"username": "John Liddi", "comment_text": "Everything will be closed. Italy is only open in July and August."}, {"username": "Lea Clariss Baduria", "comment_text": "Why would they be close? I’m curious.."}, {"username": "Cyndi Riley", "comment_text": "Best time to go."}, {"username": "Elaine Pettit", "comment_text": "We are going in March 2024, only thing to consider is Easter Sunday March 31\nLoads of Italians in Major cities for the celebrations"}, {"username": "Michela Esse", "comment_text": "YES, IN MARCH WE ARE STILL IN LETHARGY..If you are interested you can find Italians in caves but please, be kind because we are still pretty asleep"}, {"username": "David Davey", "comment_text": "Yes people are still in hibernating 😂"}, {"username": "Jennifer Stanek", "comment_text": "We went in March and that’s when I would go again! Low 70s, not overly crowded except Rome. Amalfi coast had just about everything open even."}, {"username": "Lisa Pro", "comment_text": "I was in Venice last year in end of March. Rainy and chilly but not to chilly need rain coat for sure. Positano in the Melfi coast were the same. A lot of things were closed in Positano . Rome was wide open same with Florence"}, {"username": "Rosina Zim", "comment_text": "Yes, Europe shuts down October-April 😂"}, {"username": "Scott Serafini", "comment_text": "We were in Italy the third week of March weather was in the 40sF overnight and up to high 70s during the day. Beautiful clear sunshine. Coastal tour boats were not operating and the funicular trains were operating the week after we were there. Most things were open"}, {"username": "Lenora Faustino", "comment_text": "I live here. It's always beautiful. Every season has its benefits. March is a little unpredictable, but it's a great time of the year to get away from the 'tourist season' where there are queues for all of the sites and the heat can be overwhelming. I think it depends on what you're looking for: beaches in March no, museums, archeological sites and just exploring the cities yes. Enjoy!"}, {"username": "Lyn Pappas Dahm", "comment_text": "It is shoulder season so weather is unpredictable. I have been in March and was cold and rainy and when it was pretty warm. Everything opens up the beginning of February l things close and Italians take a break after the epiphany to the beginning of February. This is the only down time.\nThe good thing going in March is not crowded! Much more enjoyable and less expensive. GO!"}, {"username": "Diana Schmitt Stansell", "comment_text": "Loved traveling in March- not so crowded 🙂"}, {"username": "David Tucker", "comment_text": "Prefer March, cold but not too bad even for an Australian, an escape from Frb Mar 40degrees days. We found a few extra sites open, we were told so Italians can access. The sea side is more closed. But we still found accommodation and meals. Even a restaurant open just that day on the coast of Amalfi with stunning views and food. A real surprise. Just pulled in and we’re seated.\nThe benefits are the lack of other tourists￼."}, {"username": "Melissa Torres Collins", "comment_text": "We went in April and a few days were nice and sunny and a few days were more on the chilly side. That being said, I am from Texas and we are definitely babies when it comes to cold weather."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Italy is never closed."}, {"username": "Reeham Al-Manaseer", "comment_text": "Yes its cold, no closings but you will not have fun, no outdoor activities at all specially in amalfi coast\nTry end of may much better"}, {"username": "Claire Dowson", "comment_text": "Depends where? We did Rome in February. I’m British and found the weather was perfect for exploring."}, {"username": "Diana Bonifaci", "comment_text": "It depends where and for what. I am from Rome and temperatures are milder than UK but it may rain a bit (or not at all!). The North will be cooler and wetter. Sicily may be mild temperatures but not for swimming"}, {"username": "Lorena Scopelliti", "comment_text": "It’s impossible to predict how much cold it will be next year. Average it’not so cold in March (beginning, middle, end? Cause it counts.), and it also depends where you are going.\nNorth is generally colder in winter, autumn and spring.\n“Will everything be closed” you mean museum, stores, restaurants? Everything will be open: no bank holiday in Italy in march."}, {"username": "Mariya Terzieva", "comment_text": "First time we visited Venice in was March 20th. We were walking around in short sleeves :)"}, {"username": "Noel Flood", "comment_text": "Unpredictable month weather wise a lot will be closed .you'll miss out on the incredible experience that is the Amalfi coast going so early ..I'm back the end of May myself before it gets to busy"}, {"username": "Sara Bee", "comment_text": "March is a little unpredictable. It’s usually cold, by depending on the year and the region, spring can be in the air.\nNothing will be closed…Italy is not a seasonal destination…peo\nple live, work and holiday 365 days per year."}, {"username": "Shane Raymond", "comment_text": "We were there March this year & it is the perfect time of year - weather is Beautiful. Still busy but not overly - we were in Milan / Lake Como / Venice / Florence / Rome / Pompeii / Positano / Amalfi Coast.\nMarch is actually the best time of year to be in Italy ♥️🇮🇹"}, {"username": "Pietro Adami", "comment_text": "Plenty of italians living in Italy all year round; we buy food, eat at restaurants, visit cities and museums … even in March 😂"}, {"username": "Esther Starren", "comment_text": "Depends on where you go. The beachtowns will be closed but in the cities everything will be open as usual"}, {"username": "Vivien Paulik", "comment_text": "Where? Weather is different in different parts of the country\nAnd closed??? People live in Italy, how can it be closed?\nYes, it is not a beach weather, but you csn go easy to any cities and enjoy the food, walk around (if the day is not too rainy) go to museums or any indoor activities"}, {"username": "Liz Russo", "comment_text": "I went to Venice in March 22. It was unseasonably warm. It didn’t rain once. In the day, I wore short sleeves and at night I would put on a light jacket only cuz I chose to dine outdoors to enjoy the air. I got very lucky. I should also state I am a person who is often on the cold side."}, {"username": "Lisa RC", "comment_text": "We were just there end of March the weather was nice!\nLittle chill - just bring a light sweater and jacket"}, {"username": "Anna Izzo", "comment_text": "I was there in March and it was not too cold at least for me. It was in the 60s and low 70s. It’s also the end of the off-season so I think it was a little less crowded and a little less expensive."}]}, {"id": "2202617276804017", "text": "Does anyone have a specific suggestion for a private transfer with potential to make stops from Portoverene to Florence. We are thinking, a drive through the countryside with a stop in a village or town might be more fun and interesting than another train ride.", "link": "facebook.com/groups/1373361046396315/permalink/2202617276804017/", "likes": 0, "comments": []}]