[{"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2194565857609159", "text": "Looking for suggestions. We are planning our trip to Italy leaving on 9/2. We are a family of 5 large adults needing a vehicle big enough to accommodate us and our luggage for 7 days touring around Tuscany. Needs to be an automatic, would prefer 5-6 seater and something that won’t break the bank.\nAnyone with past experience with this? Or knows the models of rentals that have more room than others? We are looking at the Fiat 500L but not sure that will be big enough. Appreciate any advice and suggestions!", "link": "facebook.com/groups/1373361046396315/permalink/2194565857609159/", "likes": 0, "comments": [{"username": "Connie Wilson", "comment_text": "Maybe, if it’s the wagon version."}, {"username": "Pietro Adami", "comment_text": "500, L or not L, is way too small …"}]}, {"id": "2194564030942675", "text": "Today we stay somewhere in Tuscany. We live in vineyard and experience is super fantastic. Together we have our 4 yo son and he enjoyed 🤭 we live in Pggio al Tufo. So nice people are working here. We all are so joyful 😍🍷🍇🇮🇹🍝 even more we got fantastic homemade dinner ❤️", "link": "facebook.com/groups/1373361046396315/permalink/2194564030942675/", "likes": 3, "comments": []}, {"id": "2194563467609398", "text": "Advice needed please. We're looking to travel to Milan, but want to catch a train to Zermatt (Switzerland) to climb the Matterhorn. Is there a train and costs please?\nThanks in advance", "link": "facebook.com/groups/1373361046396315/permalink/2194563467609398/", "likes": 0, "comments": [{"username": "Kirsten Rea Davis", "comment_text": "I used the Rome2Rio app a lot while in Italy. It suggests different types of transportation and the approximate cost. You can also buy tickets direct from them, for convenience, or go through the direct vendor. I have done both with no problems."}, {"username": "Sam Mah", "comment_text": "Look at the Swiss rail service for Matterhorn train tickets (SBB)"}]}, {"id": "2194560840942994", "text": "Looking for suggestions for trip to Tuscany next year for five days. Advice ?", "link": "facebook.com/groups/1373361046396315/permalink/2194560840942994/", "likes": 136, "comments": [{"username": "Gina GC", "comment_text": "Sherri Stephens"}, {"username": "Andi Bush-tyldsley", "comment_text": "Luca"}, {"username": "Marilyn Del Rosso", "comment_text": "Enjoy tutti!!!!"}, {"username": "Plamen Gerasimov-Pindo", "comment_text": "Go!"}, {"username": "Diane DiMartino", "comment_text": "Stay longer"}, {"username": "Rosaria Di Giacomo", "comment_text": "Avoid July and august\nIt’s really hot!\nIf you go in the summer make sure the house has AC\nUnless you don’t care about the heat"}, {"username": "Karen Aldrich DeMonte", "comment_text": "We stayed in a castle in Poggibonsi. It was incredible.\n\nhttps://\nwww.castellodiba\ndia.com/"}, {"username": "Diana Kendros", "comment_text": "First of all five days it’s just not enough time!!"}, {"username": "Jeannette Keith Pompi", "comment_text": "villacastellett\ni"}, {"username": "Roseann Sculli Nardy", "comment_text": "The best thing EVER !! So peaceful"}, {"username": "Ginny Awbery", "comment_text": "any suggestions for best hot springs in Tuscany?"}, {"username": "Rachelle Pachtman", "comment_text": "Lucca is a perfect stop! The rest in Florence."}, {"username": "Diane NM", "comment_text": "KMZero KM Zero Tours - Slow Travel Tuscany\nArianna Cini"}, {"username": "Merle Goodwin", "comment_text": "Go longer……5 days?"}, {"username": "Hakeem Khalil Raza Atari", "comment_text": "نسخہ\n1: نفس میں سختی کا بلکل نا ہونا\n2: مشت زنی کی وجہ سے نفس کا سائز چھوٹا ہوجانا\n3: اگر کبھی سختی آگئی تو چند سیکنڈ میں فارغ ہوجانا\n4: بچہ پیدا کرنے کے قابل نا رہنا\n5: اگر سختی بھی آتی کو مگر ٹائمنگ کا زیرو ہونا\n6: وریکوسیل یعنی خون نا نفس تک نا جانا جس سے سختی تناؤ اور سائز چھوٹا ہوجاتا ہے اور بندہ بیوی کو مطمئن نہیں کر سکتا\n7: سپرمز کا نا مکمل ہونا سیکس کا خیال آتے یا کوئی فلم دیکھتے قطرے آنا،\nاپنے ہاتھ سے نفس کو رگڑنا اور منی نکالنا، بدفعلی کی وجہ سے نفس میں سختی کا نا ہونا، ٹیرھا پن، اور نفس کا بے حد کمزور ہونا۔مباشرت کے بعد کپکپی طاری ہونا،ایک دفعہ ہمبستری کرنے کے بعدوبارہ تیار نہ ہونا,ایک ہفتہ تک جسم تیار نہ ہونا مباشرت کیلئے۔جنسی کمزوری کی علامت ہے،مردانہ کمزوری اور عضوءخاص میں جوش. تناؤ . سختی میں کمی کا شکار ہونا،ہر وقت تھکاوٹ رہنا چلنے سے پنڈلیوں میں درد رہنا،پہلے دن عضو خاص سخت لوہے کی طرح سختی انتشار فل کیپسول بھر لیں ، 40 سال سے کم عمر لوگوں کو ایک خوراک رات کھانے کے بعد دودھ نیم گرم سے دیں اور *40 سال* سے اوپر کے لوگوں کو صبح و شام کھانے کے بعد دودھ نیم گرم سے دیں\nکیپسول کے استعمال سے ٹائمنگ *30سے 50 منٹ* اور سختی برداشت سے باہر ہوگی نفس کی لمبائی اور موٹائی میں فرق واضح نظر آئے گا نفس کا ٹیڑھا پن ، رگوں کا اُبھرا ہوا ہونا ، رگوں کا نظر انا ، اور نفس کی رگوں اور پٹھوں کو مضبوط کرتا ہے جس سے بہت زیادہ سختی آتی ہے انسان عورت کے بغیر نہیں رہ سکتی ٹائمنگ جتنی زیادہ ہو گی آپ کا پارٹنر اس سے لازمی خوش ہو گا عورت کے لئے اصل چیز منزل حاصل کرنا وہ چاہے اس لذت کو بھر پور طاقت اور لوہے کی طرح سخت ٹائمنگ ہونی چاہئے اس کے بھی احساسات جذبات ہیں وہ کیا چاہتی ہے کیسے چاہتی ہے جس طرح آپ چاہتے وہ بھی اسی طرح چاہتی ہے اور آپ اپنے ان قیمتی لمحات کو اپنی شریک حیات کے ساتھ صحیح معنوں میں انجوائے کریں گے\n\n\n*14 دن میں نامرد کو بھی مرد کامل بنا دے گا*\n40 din course\n\n*آرڈر بکنگ کے لیے واٹس ایپ نمبر پر رابطہ کریں* *\n03186400846"}, {"username": "Kathy Pierce", "comment_text": "You’re going elsewhere besides just Tuscany? Take the trene to Pompeii one day, absolutely the most interesting place I’ve ever seen. Go to the main train station in Naples, transfer to the local train, it stops roughly 20 minutes later right at the gate to Pompeii! I forget the train name/line, however if you’re seriously interested I’m happy to look it up for you."}, {"username": "Kate Bryant", "comment_text": "Go to the Acacamia museum, Pont a Vechico, Uficci art gallery! I have not spelt them properly, but just get lost in Firenze! You will find amazing architecture, markets. Catch a bus to San Giminarno, Sienna! I had an apartment in Firenze for 3 months, and the architecture, food, culture is and respect for the locals is stunning!\nSanta Croaca , the Duomo in Firenze is a must. Try and catch public transport as much as possible.\nBuy an Italian/\nEnglish dictionary, which will be a great help.\nLook up always, so you get your bearings! Have fun and enjoy 😉"}, {"username": "Kate Bryant", "comment_text": "I stayed in a Pension near the Duomo and walked and walked everywhere getting lost is a must!\nBut I fear 5 days is not enough time! One needs to slow down and pace your days, without rushing! 🙏"}, {"username": "Alice Francesca", "comment_text": "Pienza:CHIOSTRO\nDI PIENZA HOTEL.stunning former convento from the 1500's.Italian garden overlooking the valley and pool!"}, {"username": "Luigia Gray", "comment_text": "Florence, Pisa, Siena, San Giminiamo, Porto Venere,\nLerici, le Cinque Terre are all beautiful places."}, {"username": "Ann Moore-Pak", "comment_text": "Montepulciano. Yes!"}, {"username": "Nicole Goudey-Rigger", "comment_text": "Did a drive from Rome to Florence and stayed in Orvieto for one night and cortona for two. Would have loved more but we saw a lot."}, {"username": "Billie Frances Swanda", "comment_text": "Florence!!!"}, {"username": "Alfah Nunung Riyanti", "comment_text": "Is it interesting for an teenager boy? I would like to go by car to Italy again."}, {"username": "Rebecca Karr", "comment_text": "Explore and enjoy ☺️"}, {"username": "Barbara Judge", "comment_text": "GO"}, {"username": "Scott Vogel", "comment_text": "La Lucciolaia agrotoirismo a stones throw from San Giminiano is magical!"}, {"username": "Syed Akhtar Abbas Zaidi", "comment_text": "Syed Akhtar Abbas Zaidi"}, {"username": "Lin Challela", "comment_text": "Yes do your own research!"}, {"username": "Lynette Lowes", "comment_text": "David Mellar have you seen some of these places in comments"}, {"username": "Stefano Giudici", "comment_text": "If you do San Gimignano make sure to also check out the nearby fortress town of Monteriggioni.\nEnjoy."}, {"username": "Jo Barber Loughnane", "comment_text": "Monticatini is lovely place to stay."}, {"username": "Chris Baker", "comment_text": "I have many suggestions. PM me if you would like - I work for Dream Vacations.\nVilla or hotel(s)? One location our tour of Tuscany?"}, {"username": "Mary Agozzino Derrick", "comment_text": "Where to stay depends on if you're driving or not, if not stay in Florence...they\nhave an excellent train station should you want to take a day to see Cinque Terre...the Uffizi Gallery really has to be a must ....ask locals where they eat skip the touristy restaurants"}, {"username": "Luciano Bunić", "comment_text": "Livorno"}, {"username": "Robyn Green", "comment_text": "Do not go in the middle box summer 🥴"}, {"username": "Alice Engstrom", "comment_text": "Radda in Chianti: Villa Campomaggio"}, {"username": "Louis Passariello", "comment_text": "Make it for 10 days. You will not be disappointed!"}, {"username": "Cris Saudella", "comment_text": "Siena San Gimignano Florence Elba Island Pisa for sure. Viator or Get your guide let you book tours ahead of time"}, {"username": "John Feudo", "comment_text": "Another vote for Lucca!"}, {"username": "Lara Grom", "comment_text": "Lucca bagno Vignoni @locanda del Loggiato"}, {"username": "Caterina Liquori-Culhane", "comment_text": "Dont miss Almafi . Don't stay the whole time in Tuscany."}, {"username": "Catherine Creamer", "comment_text": "Rent Www.tuscanlucar\ndo.com if you want to stay in your own home yet in an old castle"}, {"username": "Josephine A. Patzel", "comment_text": "Daina"}, {"username": "Hamed Mutabagani", "comment_text": "Garda"}, {"username": "Molly-Marv Forbes Hessler", "comment_text": "This is awesome. Went in 2013 and still make many of the recipes learned there. In fact, just finished baking lasagna that is AMAZING! https://\ntuscanwomencook.\ncom/"}, {"username": "Ann LaGreca", "comment_text": "Arezzo, Lucca, Florence , and any small villages!"}, {"username": "Nancy Bonacchi Fritcher", "comment_text": "Lucca; worth the day trip."}, {"username": "Larry Trent", "comment_text": "Gotta mention Porto Venere..Aka Gulf of Poets."}, {"username": "Mary Carol", "comment_text": "Following"}, {"username": "Aleda Reilly", "comment_text": "Look for B&B’s or SMALL hotels online- choose a village and rent a car! Check in once & May Day trips"}, {"username": "Kimberly Whitaker", "comment_text": "Take a cooking class in Florence. You will have the best time."}, {"username": "Sandy Praeger", "comment_text": "We love Montepulciano, Pienza and Montalcino. Stayed once in Montepulciano and another time in Fabro. Great locations for seeing Tuscany. Wonderful people, food and wine and beautiful country!"}, {"username": "Caroline Croghan", "comment_text": "We stay at Villa Ducci in San Gimignano. It's a real home from home and it's really east to explore Tuscany from there. We're going back in September for our fourth time 💖"}, {"username": "Julie Pulzone", "comment_text": "Stay in Chianti or farther south. We are in Chianti now and went to Montepulciano today- about 90 minutes. Hired a driver to take us so that we could go to wine tastings.\n\nWe are staying at Castello de Gabbiano. Beautiful castle built in the 1200’s and into a small Inn. Large winery operation around the castle. I would read up and figure what you want to see then book a reservation. Considering finding a driver as the transit can be challenging if you rent a car. We did rent. Car twice - driving to Abruzzo and then into Tuscany. Decided on a driver because of wine tasting today. Happy to answer any questions I’d helpful - just PM me"}, {"username": "Scott Cestari", "comment_text": "Take me"}, {"username": "Donette Earl Fox", "comment_text": "I hesitate to recommend the place we’re at now because I don’t want it to get too booked that I can’t come back. Just outside San Gimignano, is PoggioAlloro, a beautiful, organic farm, vineyard, restaurant.I could stay here a month! Very affordable, too."}, {"username": "Darlene Dommermuth", "comment_text": "LaPalazina farm was wonderful.\n\nhttps://\nwww.agriturismol\napalazzinasiena\n.com/en\n\nHave great accommodation, VERY reasonable and close to everything. A hidden gem. We took a day trip to Certaldo from there and did a truffle hunt day. It was AMAZING. A family owned home/farm hilltop/\ncountryside\n\nhttps://\nwww.cucinagiusep\npina.com/\ntuscany-truffle-\nhunting.html"}, {"username": "Dave Nanasi", "comment_text": "Drink lots of Sangiovese-made\nreds!!!"}, {"username": "Carol Gordon", "comment_text": "I stayed at a winery and attended a retreat. Loved it"}, {"username": "Ronald Shaw", "comment_text": "Lucca"}, {"username": "Cindy Berre", "comment_text": "5 days is too short"}, {"username": "Michael Martin", "comment_text": "Get reservations, eat off the beaten path, house wine is often amazing, breakfast is nothing but sweets, the coffee is fantastic, the steak is almost always near raw, 5 days is never long enough"}, {"username": "Jamie Lockhart", "comment_text": "We stayed in Villa Licia. It’s 30 minutes south of Florence."}, {"username": "Stacey Massimini", "comment_text": "Not to be missed: Cortona, Assisi, Montepulciano!"}, {"username": "Kristie Atkinson", "comment_text": "Highy recommend Tenuta Torciano. Spent 2 days there my last trip and planning my second trip there this December. They have lodging, restaurant, driver, winery, amazing tours, great communication!!\n\nhttps://\nwww.torciano.com\n/en/\nVISIT US AT TENUTA TORCIANO,\nWE ARE OPEN 365 DAYS A YEAR!\nWE WOULD LOVE TO HOST YOU AT OUR ITALIAN WINERY\nON WEEKDAYS, WEEKENDS, AND HOLIDAYS.\nCHOOSE YOUR EXPERIENCE:\n᠆ VINEYARD DINNER & WINE TASTING\n᠆ DINNER & TRANSPORTATION\n᠆ VINEYARD TO TABLE LUNCH & TASTING\n᠆ PRIVATE DINNER IN TOWER OF CASTLE\n᠆ WINE TASTING WITH LIGHT LUNCH\n᠆ DINNER & WINE TOUR\n᠆ TASTING EXPERIENCE\n᠆ TRUFFLE HUNT WITH DOGS & GUIDE\n᠆ ITALIAN COOKING CLASS, LUNCH & WINE TASTING\n᠆ GARDEN LUNCH & WINE TASTING"}, {"username": "James DiLeonardi", "comment_text": "Landing in Venezia and after 3 days, take train to Como. I plan to stay Como for approximately 5 days and rent a car to see the Lake District, Liguria, and Tuscany. Take train into Milano. Then take train to Firenze for 3 days and finally train to Roma for 5 days"}, {"username": "Carlie Lee", "comment_text": "Rent a car to really experience the beauty of the countryside"}, {"username": "Cindy S Poortinga", "comment_text": "Melissa IntVeldt"}, {"username": "GiGi Ballabani", "comment_text": "GiGi Ballabani"}, {"username": "Dan Carr", "comment_text": "Find an Agriturismo."}, {"username": "GiGi Ballabani", "comment_text": "I stayed here. Obsoletely breathtaking only one hr from Pisa and Florence"}, {"username": "Jo Ellen Merandi Crowley", "comment_text": "Not long enough"}, {"username": "Dana Neil", "comment_text": "Stay longer!!!"}, {"username": "Terese Cairns", "comment_text": "Not enough time!!! Go see the Palio!!"}, {"username": "Paul Kratt", "comment_text": "Stay home. A plane trip for just five days isn’t worth it. Tuscany—any part of Italy—deserves much more time."}, {"username": "Cindy Young Shelberg", "comment_text": "Lucca"}, {"username": "Catherine Ann Newell Galan", "comment_text": "Culinary trip!"}, {"username": "George Maul", "comment_text": "Truffle hunt."}, {"username": "Ricky Ellis", "comment_text": "I stayed at one hotel in Montecatini and was able to do day trips easily from there."}, {"username": "Sarah Johnson Fercho", "comment_text": "Following"}, {"username": "Sally Ann Tanasi", "comment_text": "Have a wonderful time! Eat at Paolis a 13th century palazzo with frescos of the era. Fabulous food too!!! Have a dinner at the Medici Palazzo. Also don’t miss the Medici tombs sculpted by Michelangelo!! Don’t miss the church of Santa Croce where he is buried along with Enrico Fermi"}, {"username": "Heba Moussa-Kiliski", "comment_text": "borgo san felice, bike wine tour, cooking class, day trip to florence, cheese farm"}, {"username": "Daniel Michael", "comment_text": "Words alone won’t express how thankful I am to you and to your platform. It has been a good opportunity for me and my family thank you. Mr Luke Donald"}, {"username": "Ayita Rain", "comment_text": "Two citiies to keep it simple.\nAny suggestion for hotels geared for mostly adults in milan or Naples.\nOlder now so not wanting family or pet friendly.\nLike a restaurant/ bar in hotel near train and bus line if possible.\nWalking distance to some sights would be great!\nAny hotel names come to mind from those of u lucky enough to have gone before?\n\nI also noted some comments to skip Milan.. reasons?\n\nI wanted Florence, but got outvoted! Lol"}, {"username": "Kylie Stefanile-guille", "comment_text": "We are staying at Montechiaro Wine Estate in Siena in September. They have been fantastic with lots of extra experiences on offer. I found them on Air bnb but I’m sure they have a website as well www.terredellag\nrigia.com"}, {"username": "Ursula Maria Mair", "comment_text": "I’m loving Livorno 😍"}, {"username": "Annette Mayer", "comment_text": "I know you never heard of Ghivizzano. It is very centrally located on a train line and bus line. We stay at Casa la Pace B&B. The hosts are also your tour guides if you chose. Wonderful accommodations with a castle outside your window. Check it out on Trip Advisor"}, {"username": "Allison Ahrens", "comment_text": "Have you been to Italy before? That makes a difference In recommendations\n:).\n\nBest suggestion base camp in one place and day trip to places 🙏"}, {"username": "Julia Muller", "comment_text": "Do not miss Volterra, whatever you do - that town will remain in my memory forever, it’s so pretty!! 🥰"}, {"username": "Marti Byrum Young", "comment_text": "We really enjoyed Cortona"}, {"username": "Graham Sherlock", "comment_text": "Pick a base and stay there and do day trips. I'd pick Lucca or Siena. Florence is too busy and hectic as a base. The true gems of Italy are in the smaller places, the big cities are for show and tell."}, {"username": "Sam Mouchamel", "comment_text": "Florence, sienna and Tuscany the countryside. You would love it."}, {"username": "Maria Sulsona", "comment_text": "My suggestion- go asap!! 😂😂😍"}, {"username": "Theresa Salerno Adams", "comment_text": "I stay in Florence"}, {"username": "Sandie Chandler", "comment_text": "I stayed in Pienza. It was perfect. Central to so many towns in Tuscany. Did a photo tour with Tuscany Photography Tours. Leo was great. He took me to all the best locations to enjoy Tuscany."}, {"username": "Sandie Chandler", "comment_text": "Sandie Chandler"}, {"username": "Rhonda Vilardo", "comment_text": "https://\ntenutasantopietr\no.com/\nFantastic place to stay in a great area that you can take day trips from! Ask for Giuseppe Savignano"}, {"username": "Janice Schollen", "comment_text": "I’d say stay longer!!"}, {"username": "Wendy Norman", "comment_text": "I love Castello di Volpaia it’s a gorgeous old village and vineyard, winery. 3 restaurants, fabulous apartments and pool overlooking the valley. It’s around 1.15hr from Florence in Radda in Chianti region. We visited other old villages each day. Rent a car just on outskirts of Florence main Centre. I’m staying a second time soon 🥰"}, {"username": "Ajay Rabha", "comment_text": "It has been an awesome transformation ever since I met you. So happy I saw your recommendation.\nClick the name below to contact Him for your Bitcoin Trading and Investments. Trust me, You won't regret it.\n👇🏼👇🏼👇🏼👇🏼\nDullavish Rodriguez"}, {"username": "Suzanne Caprio", "comment_text": "Sierra Busch and Creative Edge Travel for off the beaten path small group tours and authentic experiences."}, {"username": "Karen Haney Logan", "comment_text": "Where do I begin? Florence, Siena, San Gimignano, Lucca, Orvieto, the list goes on. Get ready for a spiritual experience"}, {"username": "Maureen Rebello Hagerty", "comment_text": "My suggestion would be ten days"}, {"username": "Steph Smith", "comment_text": "No notes. 🍷"}, {"username": "Gilles Laplante", "comment_text": "3 semaines minimum…"}, {"username": "Steve Grossman", "comment_text": "2 days in Florence. And 2. 2. 3 days in tuscany."}, {"username": "Janet Dietz Anderson", "comment_text": "We are from the US and in our late 60s. We don’t speak Italian and have never driven in a foreign country other than Canada. We were very nervous, but we rented a car for 8 days. We watched YouTube videos and learned what the signs mean. In our opinion this was the best thing we could have done. Google maps worked beautiful. I have no idea how anyone would have been able to navigate that area without it in the past. This freedom gave us so much opportunity to explore. The thing is, we’ve been home for a month and we still keep trying to shift gears while driving our automatic transmission cars. 🤪"}, {"username": "Lisa Missigman Bianchini", "comment_text": "Tenuta di Mensanello was beautiful and their wine is fantastic\nExcellent food had our Sons wedding there in May"}, {"username": "Cosmo Shay", "comment_text": "THANK YOU. GOD, AMEN ❤️🙏👩"}, {"username": "Karrie Volz Foster", "comment_text": "Chianti wine tour!!"}, {"username": "Leia Russell", "comment_text": "Come and do a WoW Sun Tours and live like a Local in tuscany for a week!!"}, {"username": "Danny Murray", "comment_text": "Stay for 10!"}, {"username": "Lisset Berdeal Sassi", "comment_text": "We stayed in a beautiful villa last week. It was in montepulciano. It was amazing"}, {"username": "Lisset Berdeal Sassi", "comment_text": "Lisset Berdeal Sassi"}, {"username": "Lisset Berdeal Sassi", "comment_text": "Lisset Berdeal Sassi"}, {"username": "Lin Challela", "comment_text": "Do your own research. Everyone has different goals and tastes. I suggest you research why you are even going there!"}, {"username": "Susan Dennis Shore", "comment_text": "Love Sienna"}, {"username": "Brian Yonks", "comment_text": "We did a 5 day food and wine tour in Tuscany and Umbria with Caio Andiamo Tour company. This best thing we did."}, {"username": "Shannon Uebelhor Fuhs", "comment_text": "Siena!"}]}, {"id": "2194558267609918", "text": "Hello everyone\nLooking for a place to stay in Ischia. I temporarily booked Hotel Albatros.\nHas anyone stayed there?\nI’m looking for a clean, well air conditioned & close to the beach for a family of 5.", "link": "facebook.com/groups/1373361046396315/permalink/2194558267609918/", "likes": 0, "comments": []}, {"id": "2194557244276687", "text": "We have 4 days to see Rome- any suggestions to beat the heat and walking too much. Is there a suggestion regarding a private car tour for 1 day? This was the only time of year we could all go.", "link": "facebook.com/groups/1373361046396315/permalink/2194557244276687/", "likes": 0, "comments": []}, {"id": "2194556740943404", "text": "Any tips on getting seats together on Economy flights with Delta and IITA airlines? Does getting there early help? We tried to upgrade and told us we could not.", "link": "facebook.com/groups/1373361046396315/permalink/2194556740943404/", "likes": 0, "comments": [{"username": "Lisa Martinson", "comment_text": "Ask at airport or ask someone to switch once of flight."}, {"username": "Nicole Cleaver- Dietze", "comment_text": "Go to the gate podium when the attend shows up and ask what the possibility is to be seated together. I have done it numerous times with delta. Even when I have had no seat assignment until I get to the gate.\nOnly once did they say they could not. And often when I have no seat assigned they put us in the emergency door row which tends to have more leg room."}, {"username": "Gregory Smith", "comment_text": "Don't expect anyone already seated to move for you unless it's to a better seat."}, {"username": "Debbie DiOssi", "comment_text": "Usually you can pay an extra fee to pick your seats. Have you checked for that option on their website?"}, {"username": "Yolanda Hanavan", "comment_text": "Did you purchase “Basic Economy” tickets on Delta? If so, your seats will be assigned at check in. The earlier you check in, the better."}]}, {"id": "2194552837610461", "text": "Does anyone have any tour guides with cars contact info that can do a 2 person tour around the towns near Bari? Eg alberobello & locorotondo?", "link": "facebook.com/groups/1373361046396315/permalink/2194552837610461/", "likes": 0, "comments": []}, {"id": "2194552770943801", "text": "Which cities should i visit in the north?", "link": "facebook.com/groups/1373361046396315/permalink/2194552770943801/", "likes": 0, "comments": [{"username": "Mike Ball", "comment_text": "Milan and Turin are the obvious ones , maybe Bergamo and Brescia as they are stunning and often ignored,\n\nOr somewhere like Udine or Trieste if you fancy travelling a little further."}]}, {"id": "2194550264277385", "text": "We leave for Italy from the US in one week. Stressed about the strikes, anyone know anything on all of that, air traffic, luggage handlers and trains? ETC?", "link": "facebook.com/groups/1373361046396315/permalink/2194550264277385/", "likes": 0, "comments": []}, {"id": "2194545634277848", "text": "How big is a \"large double bed\" all hotels say this along with a twin.Does it separate to 2 singles we will be traveling 3 seniors", "link": "facebook.com/groups/1373361046396315/permalink/2194545634277848/", "likes": 0, "comments": []}, {"id": "2194544797611265", "text": "Hey Yall, looking for recommendations in Taormina... is it best to be in city center or at beach? We're traveling from Centrache and are thinking of leaving the car at the ferry on the mainland and taking alternative transportation Messina to Taormina. Any advice or suggestions welcomed! Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2194544797611265/", "likes": 0, "comments": []}, {"id": "2194537880945290", "text": "We need to get to the airport MXP tomorrow is there a train from Milan central station? Our hotel says only bus or taxi?", "link": "facebook.com/groups/1373361046396315/permalink/2194537880945290/", "likes": 0, "comments": [{"username": "Helen Abbott", "comment_text": "https://\nwww.rome2rio.com\n/map/\nMilano-Centrale-\nStation/\nMilan-Malpensa-A\nirport-MXP"}, {"username": "Helen Abbott", "comment_text": "https://\nwww.rome2rio.com\n/map/\nMilano-Centrale-\nStation/\nMilan-Malpensa-A\nirport-MXP"}, {"username": "Юлия Ян", "comment_text": "Юлия Ян"}, {"username": "Юлия Ян", "comment_text": "That is Google map shows"}, {"username": "Юлия Ян", "comment_text": "It says trains run every 30 min to airport"}, {"username": "Jacki Kleynhans", "comment_text": "Def trains from 6am to 10pm"}]}, {"id": "2194536667612078", "text": "Just had dinner at trattoria Alla Madonna in Venice - delicious", "link": "facebook.com/groups/1373361046396315/permalink/2194536667612078/", "likes": 4, "comments": [{"username": "Kerry Godfrey", "comment_text": "Yum- I always wanted more basil xx"}]}, {"id": "2194536400945438", "text": "I have a series of questions first time traveling to Europe. We will be in Rome for 4 days staying about 5 KM from city center. Then Florence for 4 days. My dad collects Coca-Cola memorabilia and I thought having a coke bottle in Italian would be neat. Is that a thing? Like the glass coke bottles overseas? Sounds silly but he would appreciate thatआणखी more than a magnet or similar. Also restaurant recommendations around our hotels? Staying north of the Vatican around 3 km. In Florence we are near the Basilica di Santa Maria Novella. Open to any recommendations for our stay? Also, is it worth it to take a day trip from Florence to Viareggio or another beach? Best way to travel there?", "link": "facebook.com/groups/1373361046396315/permalink/2194536400945438/", "likes": 1, "comments": []}, {"id": "2194532754279136", "text": "Hi, could you please share your favourite carry-on luggage? I’m looking for the one that won’t fall apart during the trip. Packing small kids that will roll their own so no backpacks please. We need to pack ourselves in one month in Europe 🤣. Trying to do carryons only :)) TIA", "link": "facebook.com/groups/1373361046396315/permalink/2194532754279136/", "likes": 0, "comments": [{"username": "Jill MCanfield", "comment_text": "Look at Monos - very lightweight hard case - has a traditional carry on size and a carry on plus - the plus had the largest internal volume I could find. Monos is my current favorite for personal travel. I also have a Lipault carry on that I use for work travel. Also lightweight, but smaller. Durable. Lipault is a favorite among co-workers."}]}, {"id": "2194519804280431", "text": "Does anyone have any suggestions for a nice camping nearby the beach where you can stay with your camper. We leave Campiglia Maritiema tomorrow, heading for La Spezia, but looking for a nice, clean camping for 2 adults?", "link": "facebook.com/groups/1373361046396315/permalink/2194519804280431/", "likes": 0, "comments": []}, {"id": "2194506477615097", "text": "Hi! Anyone in Milano who are going to the Harry styles concert in reggio Emilia on the 22 of july?🤩", "link": "facebook.com/groups/1373361046396315/permalink/2194506477615097/", "likes": 0, "comments": []}, {"id": "2194518994280512", "text": "We are on Capri this evening only after an amazing day on the water. We had not booked dinner and stumbled across Faraglioni which ticked all the boxes, great food, great wine, great service and great view.", "link": "facebook.com/groups/1373361046396315/permalink/2194518994280512/", "likes": 160, "comments": [{"username": "Denise Curtis", "comment_text": "What boat service?"}, {"username": "Laura Storie Dolinar", "comment_text": "Amazing!"}, {"username": "Judy Charon", "comment_text": "Judy Charon"}, {"username": "Bernadette Sarmiento", "comment_text": "Hello, thanks for your tips. Do I need to make reservations for Faraglioni"}, {"username": "Alicia Yunes", "comment_text": "Hi Jeff!! Do you mind if I ask you how much money are you spending on the trip and how long is it? We’re a family of five and we’re planning to be there next year around March so I want to have an idea, thanks for sharing your trip!🤩👍🏼"}, {"username": "Renee Bruno-Arias", "comment_text": "Was Capri as crowded as they are saying ?"}, {"username": "Shannon Ruffin Pelicano", "comment_text": "Dana Hebert Bendeck look at these pics. Esp swimming in the cave. This is what I wanted y’all to see. ❤️"}, {"username": "Sally Volpe Godin", "comment_text": "Ahhh! Missing it, enjoy it all 🇮🇹"}, {"username": "Carola Blödgen", "comment_text": "You look like a very happy family"}]}, {"id": "2194513590947719", "text": "My husband and I will be in Florence and Rome August 8th for 12 days with our 2 kids. Do you recommend the golf cart tours? Are some better than others? I thought it would be a nice break from walking with a 7 and 9 year old.", "link": "facebook.com/groups/1373361046396315/permalink/2194513590947719/", "likes": 0, "comments": [{"username": "Krissy DiCosola Dziewior", "comment_text": "Anyone have experience with the golf cart tours in Rome?"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2194512977614447", "text": "Cinque Terre or Amalfi Coast? Would love to hear from anyone who has been to both.", "link": "facebook.com/groups/1373361046396315/permalink/2194512977614447/", "likes": 1, "comments": [{"username": "Alexa Etédi", "comment_text": "Amalfi Coast. Of course."}, {"username": "LeAnn Bonkiewicz", "comment_text": "AC.. going back again soon!"}, {"username": "Emmy Delangre", "comment_text": "AC, no doubt!"}, {"username": "Sean Watkins", "comment_text": "I’m going to take a day trip from Rome, hotels are already booked. Is the best way by train to Salerno then ferry?"}, {"username": "Sharyn Wright", "comment_text": "Definitely Amalfi Coast"}]}, {"id": "2194511367614608", "text": "Milan, Italy", "link": "facebook.com/groups/1373361046396315/permalink/2194511367614608/", "likes": 55, "comments": []}, {"id": "2194509810948097", "text": "I just read where there are hundreds of flights all across the country of Italy being canceled today and for who knows how long is the future… I have flight reservations in the month of August and I’m very worried that my entire itinerary with a lot of money being paid to car, rental companies in hotels will be ruined if these flights and strikesआणखी continue in this manner… Can everybody give me an idea on why this is happening how it’s happening and if it will be resolved soon… This is the height of the Travel Season it’s incredibly frustrating to be with this kind of thing would happen all over the entire country", "link": "facebook.com/groups/1373361046396315/permalink/2194509810948097/", "likes": 1, "comments": [{"username": "Julie Conway-Novak", "comment_text": "Italy goes on strike all the time. When we were in Venice they told us the boats and trains were going on strike that day so we went early to catch the boat to get to the train had no problem then the trains were on time too. It happens all the time in Italy. Hopefully everything will be fine"}, {"username": "Connie Defrancesca-Conway", "comment_text": "I remember the many times we went to Italy they would have a strike any time Bobby just go and enjoy every moment ￼it’s just the way the Italians are\nHave fun\nConnie"}]}, {"id": "2194508674281544", "text": "My husband and I will be in Florence the first week of September. We are trying to choose between a Pasta Cooking Class that is highly recommended or reservations at the restaurant La Buchetta which is highly rated. Which would you recommend and why? TIA", "link": "facebook.com/groups/1373361046396315/permalink/2194508674281544/", "likes": 0, "comments": []}, {"id": "2194499930949085", "text": "What type of carry on luggage is acceptable for the tour buses? Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2194499930949085/", "likes": 3, "comments": [{"username": "Kate Whitney", "comment_text": "Backpacks !"}, {"username": "Lisa Martinson", "comment_text": "Back pack small that will fit under seat."}, {"username": "Sigrid Cormier", "comment_text": "My Lug Puddle Jumper bag. It’s about 15 yo still like new….has just short of 1million Km on her….my fav bag. Lots of outside pockets and for bottle of water. The inside one side is a full divider for all your important travel documents."}, {"username": "Michael Barnes", "comment_text": "Small"}]}, {"id": "2194498310949247", "text": "Hi everyone! I am planning to go in italy on October with my mother\nI am confused between Roma and milano / lake of come, i would like to give here a good experience in italy. Also had anyone did the boat tour in lake if come ? For how much it was ?\nAnd how much should expect per day ( transport / food etc..)", "link": "facebook.com/groups/1373361046396315/permalink/2194498310949247/", "likes": 2, "comments": [{"username": "Gloria Maledi", "comment_text": "i live in near como and milan and they are very beautiful but if you have to choose I would go to Rome for sure. Rome is a must"}]}, {"id": "2194497797615965", "text": "Is April or September a more preferable time to visit? Wanted to go during one of the “shoulder months” and wanted to know which is the better option. TIA!", "link": "facebook.com/groups/1373361046396315/permalink/2194497797615965/", "likes": 1, "comments": [{"username": "Lisa Martinson", "comment_text": "Both beginning of April or end of sept will be less crowded"}, {"username": "Jennette Riches", "comment_text": "Those are good months. We were there in May this year and it was a bit cool and rainy, but I have been in May when it has been lovely and warm. So it can be different year to year. April, May, September and October are all good months."}]}, {"id": "2194497790949299", "text": "If you had 9 days in Italy (we are going for 10 but will probably lose a day travel wise) and wanted to see Rome, Florence, Positano and Lake Como how would you split up the days in each location? (I’m open to changing lake como to another location if there other suggestions from individuals who have been before)\n\nThank you for the advice 😊", "link": "facebook.com/groups/1373361046396315/permalink/2194497790949299/", "likes": 13, "comments": [{"username": "Lisa Martinson", "comment_text": "3 Rome 2 Florence, 3 positano (amalfi coast)"}, {"username": "Glenn Todd Webb", "comment_text": "Don’t go to Positano. You will waste too much time it’s so far. Rome , Florence, lake Como is already very tight at 9 days."}, {"username": "Lucrezia Folger", "comment_text": "Rome 4, Florence 3, Venice 2."}, {"username": "Roe Gallo Saks", "comment_text": "Too much traveling. 3 places is enough. Lake Como and the north is another trip."}, {"username": "Stephanie Osborn Rushing", "comment_text": "We are doing Rome, positano Florence in 9/10 days (losing one with overnight travel). Just picked 3 places"}, {"username": "Rhona OConnor", "comment_text": "Take your time, allow time to do nothing, don't try to do too much. Everywhere is very busy, so allow time to enjoy rather than rushing to the next place."}, {"username": "Amy Corday", "comment_text": "4-Rome\n3-Florence/\nSiena\n2-Como\n\nLosing too much time to travel if you include Amalfi Coast."}, {"username": "Morgan Eicher", "comment_text": "We are doing a very similar trip:\n\nMilan 2 days\nComo 4 days\nFlorence 2 days\nRome 3 days"}, {"username": "Rachael Richardson", "comment_text": "That seems a lot unless you just want to do the top half I think you might have to ditch the lake !\nWe only spent half a day in positano - overrated in my opinion (so is Capri) found sorrento a better base.\nFlorence\nSorrento\nRome"}, {"username": "Lydia Springer", "comment_text": "Skip Positano. Three days in Rome, 3 days in Florence with desired day trips (perhaps Cinque Terre or elsewhere in Liguria instead of Positano) and 3 days not just Lake Como but Lake Maggiore as well. Gorgeous!"}, {"username": "Martinez Martin", "comment_text": "Book a room at florence for the entire trip. Then do day trips to each from florence, or even staybover night if you want while still keeping the florence home base."}, {"username": "Phyllis Snyder", "comment_text": "Factor in travel time between towns- Sorrento- to Rome- to Florence."}, {"username": "Gabrielle Wiseman", "comment_text": "I’d personally recommend visiting Lake Garda instead of Como! I feel like there’s more to do and see personally🤍 (I’ve just recently visited the North of the Lake as well as the south). You can also visit Verona in 30 minutes from Garda, or Venice in about 1.5 hours. Also with Lake Garda/Como you’d need to decide which area of the lake you want to stay in! For Como for example I’ve heard it’s better to stay in Bellagio or Varenna.\n\nIt depends on what YOU want to see and do though because you could easily spend all those 9 days in Rome exploring the whole city and the areas beyond (using Rome as your base). If you want to truly experience the city, I’d recommend at least 4 days there.\n\nDepending on how much you want to see/do in Florence, you can even take a day trip there from Rome - the fast trains can take only 1.5 hours to get there.\n\nWhilst I’ve not been to Positano I’ve heard it can be very expensive/it’s overrated (though again I can’t properly comment!) I have been to Salerno in the south though and it was beautiful and very easy to make day trips to the Amalfi Coast and areas along there (also Pompeii if you’re interested in that).\n\nInstead of Positano - if you wanted to enjoy the sea/scenic locations, there’s a beautiful island just off Rome called Monte Argentario which is stunning, and then there’s also plenty of beautiful beaches along the Ligurian coast such as Portofino so maybe have a look at there! It’s also more North so will be easier to get to from Florence/head to Como or other places you want to visit.\n\nIf I was to create an itinery based off what I’ve just said and what you want to see I’d suggest:\n\n4 days Rome (including a day trip to Florence)\n2 days at the Ligurian coast (staying in a beach town/in or near Portofino)\n3 days in Lake Garda (including maybe a day trip to Verona if that’s what you were interested in).\n\nLike I said before, it depends what YOU want to do! What are you interested in most and want to see? Are you okay travelling sometimes 2 hour+ journeys every other day to get to the next place? Maybe do a little more research into the areas you’re interested in and see what you think🥰\n\nFeel free to drop me a DM with any questions, I’ve been to Italy a good amount of times now/travelled through the country and love the country so I’m more than happy to talk about it! (As you can probably tell😂)\n\nHope this helps a lil!✨"}, {"username": "Laura Piccinini", "comment_text": "In my opinion is too much! 3 days in Rome ,2 days Florence (1 Florence and day trip to Siena) , 1 day Bologna , 2day Venezia"}, {"username": "Sara Overbagh Hammonds", "comment_text": "I wouldn’t travel to Lake Como with 10 days and primarily being in central Italy - also including Positano. I would incorporate Cinque Terre instead"}, {"username": "Mary Agozzino Derrick", "comment_text": "You could do it, but I think you're trying to see too much in 9/10 days... don't forget you have to travel place to place, find your accomodations, check in, eat, and then sightsee...for 10 days I'd say spend 3 days in Rome and then Florence 3 days then Venice 2-3 days .. Imho to really experience Italy, slow travel is best, or it all becomes a blur and you don't get the \"feel\" of anywhere you've been...and more than the sights which are truly spectacular, it's the \"feel\" that will make you wanting to go back again and again ...for longer & longer trips"}, {"username": "Sam Sabrina Haney", "comment_text": "Rome, Florence and Lake Como would be better. We took the train to Varenna and stayed there for Lake Como. It was a lovely few days at the lake after touring the bigger cities!"}, {"username": "Elizabeth Lupo DiVito", "comment_text": "That's a lot in 9 days. You'll be spending too long transitioning"}, {"username": "Raf Gervasio", "comment_text": "Last time just before covid we did north basing in Bologna then onto Florence Venice then Rome...\nThis year we're doing more south basing in Naples then Sorrento Capri Positano and our favourite Ischia then a return trip to Rome....I know its costly to do it this way but it's too far to mix north with south"}, {"username": "Suzanne Mills", "comment_text": "Yes, skip Como for Garda, either Limone or Malcesine. No to Riva and Sermione. When in Florence, take the local bus to Fisiole where the vista of the city is spectacular."}, {"username": "Kim Hudson", "comment_text": "Just enjoyed our last day in Rome. We had 3 nights Florence, 3 nights Positano and 3 nights Rome.\nI wouldn’t change a thing except maybe the order of visiting."}, {"username": "Julia Muller", "comment_text": "Firstly, I would cut out one destination - you need at least 3nts anywhere to experience it properly 😊 If I had to cut one of those it would probably be Positano."}, {"username": "Kuzya Kuzya", "comment_text": "Between Lake and Positano - Positano!!"}, {"username": "Immi Walker", "comment_text": "We’re doing two nights in Sorrento and doing a day boat tour to almafi , driving to Rome and staying two , Florence / Tuscany staying 3 and then lake Como for 3"}, {"username": "Tania Romeo", "comment_text": "Ditch Positano completely and do the other areas justice"}, {"username": "Jono Roland", "comment_text": "Maybe give Como a miss and do Cinque Terre or spend more time around Amalfi, even Sorrento."}, {"username": "Jenny Payne", "comment_text": "Every day you travel you loose a day believe I’ve been going to Italy for 16 years and Italians are never in a hurry to do anything , I would do what the other person said base yourself in Florence and do any trips & I would leave out Positano,it is beautiful driving along the coast but it takes a long time to get there🌻"}, {"username": "Courtney Binge", "comment_text": "Thank you everyone! This is very helpful 😊"}, {"username": "Maggie Gpe Banuelos", "comment_text": "I just did Rome 4, Florence and Venice 2 and Milan 2!"}, {"username": "Tanya Coletz", "comment_text": "Depends if you want to do lots of galleries, buildings and museums, if not I’d spend most of my time on the Almafi coast"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "I recommend choosing between Positano and Lake Como, or maybe Venice instead?"}]}, {"id": "2194496630949415", "text": "Looking for a place to buy a suit for husband in Milan that could do alterations if needed in a couple days , not mega expensive ones ?", "link": "facebook.com/groups/1373361046396315/permalink/2194496630949415/", "likes": 0, "comments": []}, {"id": "2194496390949439", "text": "👋👋Hello.\nCan anyone tell me what the rate is to hire a guide for two hours at Pompeii? Two companies that I'm using are quoting 150 Euros but the Pompeii website doesn't specify a price, rather it states the guides will set the price. Does anyone have experience hiring a guide on site and how much did it cost? TIA", "link": "facebook.com/groups/1373361046396315/permalink/2194496390949439/", "likes": 0, "comments": [{"username": "निनावी सहभागी", "comment_text": "Anyone?"}, {"username": "निनावी सहभागी", "comment_text": "👋👋👋Still looking for a response"}]}, {"id": "2194487744283637", "text": "10 day trip around Venice, Florence & Rome. using trenitalia business class train to travel in between locations. Are we better off bringing 2 carry ons or 1 medium sized checked in bag? In terms of having to lug it around. We plan on shopping in Florence & rome too to check some things in. Just wasn’t sure what makes more sense practically.", "link": "facebook.com/groups/1373361046396315/permalink/2194487744283637/", "likes": 0, "comments": [{"username": "Maria Neri", "comment_text": "Definitely 2 carry ons! Just came back used the trains and had a checked bag struggled with it next time will definitely down size"}]}, {"id": "2194484464283965", "text": "Dolce far niente ❤️", "link": "facebook.com/groups/1373361046396315/permalink/2194484464283965/", "likes": 61, "comments": []}, {"id": "2194482344284177", "text": "I have a last minute trip booked for beginning of August. Yes, I know it is hot and crowded. I travel to Italy multiple times a year so I want to avoid the crowded areas and stay somewhere accessible by train from Rome (where I am flying) but that is quaint and somewhere I can relax and recharge and be around more locals than tourists.. I speak Italian fluently so there is no language barrier. Any suggestions welcome. I love Umbria and the Lake Garda region but am open to any and all areas.", "link": "facebook.com/groups/1373361046396315/permalink/2194482344284177/", "likes": 0, "comments": [{"username": "Laura Cardinale", "comment_text": "Maremma, Orbetello, Porto Santo Stefano, Argentario. You can take a train from Rome to Grosseto."}, {"username": "Jon Owens", "comment_text": "Ischia"}, {"username": "Rita Kanten", "comment_text": "Sounds like you know italy pretty well so why are you asking us?"}, {"username": "Alessandra Iozzi", "comment_text": "Ventotene. Train to Formia then ferry."}]}, {"id": "2194481447617600", "text": "Has anyone stayed at the Loly Boutique Hotel in Trastevere?? Thoughts?", "link": "facebook.com/groups/1373361046396315/permalink/2194481447617600/", "likes": 1, "comments": []}, {"id": "2194473284285083", "text": "Hello All,\n\nCan you recommend a hotel on Lido, Venice end of July -early August. I’m traveling with my mom, 7year old daughter, and two dogs. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2194473284285083/", "likes": 0, "comments": [{"username": "Steve Grossman", "comment_text": "I think your only chance might be an Air b b. I wouldn't book your plane tickets until I found something."}]}, {"id": "2194473154285096", "text": "Hello ! We are planning a trip to Rome during the Christmas Holiday,does anyone know if there are any restaurants open Christmas Eve or Chritmas day we are staying near the Vatican.TIA", "link": "facebook.com/groups/1373361046396315/permalink/2194473154285096/", "likes": 2, "comments": [{"username": "Felicia LoCascio Whitney", "comment_text": "Hello. What a special time to be in Italy. Lots of comments if you use the magnifying 🔎 at the top of the page to read hundreds of responses. Looks like many places close doing that time. But check it out for more comments."}]}, {"id": "2194468534285558", "text": "Looking recommendations for 2 night stay in Venice (6/3-6/5/24) Would love walking distance, canal view, ac, and minimum 2 bedrooms w sofa sleeper. Thanks in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2194468534285558/", "likes": 0, "comments": []}, {"id": "2194466990952379", "text": "Hi everyone! Did anyone had good experience with guide in Rome? Would especially appreciate the one who could show us and tell us about Jewish Rome quarter. Thank you very much in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2194466990952379/", "likes": 1, "comments": [{"username": "Estee Rosenbaum", "comment_text": "Micaela Pavoncello"}]}, {"id": "2194456657620079", "text": "Just ordered some plugs, wasn't expecting three prongs! Are these the correct ones for Italy? 🤔", "link": "facebook.com/groups/1373361046396315/permalink/2194456657620079/", "likes": 70, "comments": [{"username": "Michelle McNeil", "comment_text": "That's what I used"}, {"username": "Joe Guzzi", "comment_text": "Sometimes. Italy uses at least three different types. I know, as we have three types at our house in Trieste!"}, {"username": "Joe Guzzi", "comment_text": "They also use the round Schukos in some places.\n\nIn this photo, they have all the bases covered:"}, {"username": "Shannon Pacheco Modin", "comment_text": "I copied this from someone else"}, {"username": "Julian Gomez Moheno", "comment_text": "Cindy Lu"}, {"username": "Joe Bruno", "comment_text": "Yes"}, {"username": "Greg Fetro", "comment_text": "Never send 3\nMust be southern?"}, {"username": "Sanjeeta Ahmed", "comment_text": "Perfect ones for Italy"}, {"username": "Elena Innocenti", "comment_text": "It’s ok"}, {"username": "Susan Marten", "comment_text": "Yes. The middle prong is a ground and is optional"}, {"username": "Renee Rundle Stoneham", "comment_text": "Yes. 3 prong and 2 prong.\n\nHowever, my old 2 prong didn’t work in all outlets because the prongs were too thick. I could usually find 1 plug to use.\nOur other cube adapter worked fine."}, {"username": "Bay Del", "comment_text": "Yes they are"}, {"username": "Kyle Wilcox", "comment_text": "I’d be careful with hair tools. I checked with the front desk before I plugged my hair trimmers in and it fried it. Even though the front desk said it was the correct one."}, {"username": "Carole Tarlap", "comment_text": "I have 2 prong.....all I have ever seen in Italy 🤷"}, {"username": "Neekita Naidu", "comment_text": "In Venice right now two and three work. I have two"}, {"username": "Julie Menassaka", "comment_text": "A 2 prong will also work in Spain but a 3 prong will not."}, {"username": "Susan Marie Bishop", "comment_text": "I’ve used both two and three prongs tbh but I always take both of mine 🤗😀💙❤️🇮🇹"}, {"username": "Mary Whitler", "comment_text": "Most every thing I saw was two prong. You may get lucky or not and find some three prong outlet’s"}, {"username": "Janet Grego", "comment_text": "Rustalyn Hiner York Melissa Thomas Jackie Baxter Maddy Russell Ashlyn Grego Lauren Long Raelyn Kirchhoff"}, {"username": "Juan Carlos Calle", "comment_text": "Yes"}, {"username": "Achim Marke", "comment_text": "For some appliances you need all three. Everything that draws a lot of power. Or if grounding is adviced to avoid blasting fuses cause of short curcuiting. For most appliances two are enough. Just be aware its 240 Volts and 50 Hertz."}, {"username": "Patricia Turner", "comment_text": "My research found that hotels could have both three prongs or two prongs in Italy so I bought both to be covered."}, {"username": "Tracy Middleton", "comment_text": "Eleanor Middleton"}, {"username": "Nicole Beaumont", "comment_text": "I used 2 prongs when I was there last month."}, {"username": "Ellie Hwong", "comment_text": "You’ll find more plugs with 3-prongs then 2. Bring it!"}, {"username": "Diana Ferro-Rodrigues", "comment_text": "They Use both 2 & 3 prongs"}, {"username": "Liliana Shenton", "comment_text": "I have found the 3 prong ones needed for appliances in some homes and the 2 in others 🤪"}, {"username": "Kim Lystila", "comment_text": "I had both and the 2 prong would not work in the hotels I stayed in"}, {"username": "Cherie Compartore", "comment_text": "Following."}, {"username": "Gail Ogilvie", "comment_text": "Thank you so much for all your input everyone. I have a 2 prong as well but ordered these thinking the 2 prong wouldn't fit. I think I'll take both so I have everything covered! Thank you for all your comments 🙏"}, {"username": "Jeff Pope", "comment_text": "Following….."}, {"username": "Mi Reille", "comment_text": "Yes, but in my experience, the 2 prongs (European) also work"}, {"username": "Norbert Tóth", "comment_text": "We were in souther italy and the outlets only “accepted” 2 prongs"}, {"username": "Dale Smith", "comment_text": "Following. We are traveling in September. I believe what we ordered were 2 prong. I've been known to make mistakes though. Lol"}, {"username": "Rhona Veisfeld Modugno", "comment_text": "Ours was 2 round prongs, not 3."}, {"username": "Melanie Adams", "comment_text": "Just there and used 2 prongs"}, {"username": "Nick Trostel", "comment_text": "Was there a month visiting most every major city and attraction, the three prong worked 100% of the time"}, {"username": "Melanie Adams", "comment_text": "You can always get an adapter that has many European options so you can use it throughout Europe in the future as well."}, {"username": "Roxana Maria Olaru", "comment_text": "This is for Italy"}, {"username": "Triskell Young", "comment_text": "Yes! I think they're better than the two prong ones, as the latter can sometimes be loose in some of the sockets (for example those on trains) and fall out (they'd still work, you just have to be more careful). I recently traveled for 6 weeks all over Italy with a 3 prong adapter like this and it worked everywhere. I had a 2 prong one just in case, but never had to use it.\nThe only disadvantage is that you wouldn't be able to use it in other European countries (whereas the 2 prong one you could use in most). But if you're going only to Italy, you're good."}, {"username": "Alessandro Iannelli", "comment_text": "The majority of the appliances in Italy have three prongs, because of the earthing system (central pin), although a few are exempted. In theory, all homes in italy should have electrical sockets with three holes (because of the earthing system), but not all do. So the three-pronged adaptors in theory should be the only ones used because the law requires buildings to have the earthing system, but the two-pronged ones are also used (and maybe are even more common) because they will work in every home, including the ones that haven't updated their electrical system yet."}, {"username": "Michael Messina", "comment_text": "No need two"}, {"username": "Leah Lulu Miller", "comment_text": "The condo where I lived for 3 years had 2 different sized 3 prong outlets. (The prongs themselves were fat or skinny) I had adapters to from fat to skinny and skinny to fat."}, {"username": "Gene Falco", "comment_text": "Some B&B’s will have 3-prong outlets. Most hotels will use the 2-prong."}, {"username": "Marisol Lopez-Nieves", "comment_text": "It will work in Italy"}, {"username": "Brice Blosser", "comment_text": "I’ve only seen two prongs in Italy, Paris, Croatia, Serbia, Greece, North Macedonia, and Kosovo. I have two of these, available on Amazon. They are great. BESTEK 250W Power Converter 3-Outlet and 4-Port USB Travel Voltage Transformer 220V to 110V with Type G/D/M/AU/US Travel Plug Adapters"}, {"username": "Rossella Montanaro", "comment_text": "Qui in Italia viene usata sia quella a tre punte che quella a due 😉"}, {"username": "Lisa Martinson", "comment_text": "I paid a dollar one euro for one in Italy"}, {"username": "Joan Andromidas", "comment_text": "If you buy a two round prong one, it can be used in the three prong outlets. I know this because one of my hotels had the three prong outlets and when I asked, they told me I could insert my two prong one without a problem and it worked fine."}, {"username": "Anne Duell", "comment_text": "I had an adapter that had three prongs and used it in Florence, Sorrento and Rome hotels."}, {"username": "Shonagh Choong", "comment_text": "The places I stayed in Milan and in Menaggio needed these 3 prong, I only had 2 prong which didn't fit 😔"}, {"username": "Annie Gerke", "comment_text": "Yes and 2 prongs work too"}, {"username": "Kristy Ponticello", "comment_text": "We've always taken the 3 prong, never had a problem."}, {"username": "Angela Gilmore", "comment_text": "Yes, correct.\nAnd as someone said there are the skinny and the fat ones. This is the skinny and is better because you can use it everywhere. The fat instead only fits in the fat, of course 😅"}, {"username": "Angela Gilmore", "comment_text": "These are the Italian types. The three skinny prongs is the best, fits almost everywhere."}, {"username": "Linda Boyle", "comment_text": "Venice is the 2 thin prongs"}, {"username": "Dennis Comfort", "comment_text": "We used two prong ones for a month and had no issue. $1 on Rick Steves site"}]}, {"id": "2194456284286783", "text": "Would love to have your opinion about gems not to miss in Matera, Bari and Polignano a mare ! From culture and history to bars-what was a place to adore in this places?", "link": "facebook.com/groups/1373361046396315/permalink/2194456284286783/", "likes": 0, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2194448247620920", "text": "Any tips on bring wine or olive oil back to Canada, is it easier to ship back, or how many bottles can we bring back in our check in bag (wine)", "link": "facebook.com/groups/1373361046396315/permalink/2194448247620920/", "likes": 2, "comments": []}, {"id": "2194440007621744", "text": "I’m going to Italy in Oct. I saw an ad for a prepaid package that you can send dirty clothes home to make room for things to buy and pack. Now I can’t find that ad. Anyone done this? I’m really going to try to carryon!", "link": "facebook.com/groups/1373361046396315/permalink/2194440007621744/", "likes": 27, "comments": [{"username": "Mark Williams", "comment_text": "Just wash them and send home through the mail"}, {"username": "Krissy DaRusso", "comment_text": "Better yet, save the money and wear clothes that can be left behind."}, {"username": "Renee Kremesec", "comment_text": "Its expensive"}, {"username": "Kim Geary Keidel", "comment_text": "We brought compression bags and put our dirty clothes in those to make room for things we bought."}, {"username": "Charlie Louise Moore", "comment_text": "We paid 10 euros from a local selling a suitcase on Facebook market. Then paid £38 to check it in on the flight home. Much cheaper than shipping out items home xx"}, {"username": "Sandra Keyser", "comment_text": "We donated a lot of the clothes we took to a Catholic Charity! We sent two big suitcases back by DHL it was $700. The suitcases we brought home were filled with items purchased in Italy!"}, {"username": "Cyb Quinn", "comment_text": "I asked the front desk if they wanted any clothes for charity. They said yes. I had it all clean and folded."}, {"username": "Kathy Morra Kuloy", "comment_text": "I bring a tote in my carryon and pack my souvenirs in that and carry on the plane. I’ve had leather goods shipped home for around $80"}, {"username": "Rhonda Hope", "comment_text": "I travel with a foldable duffel bag for new purchases"}, {"username": "Wendy Spano Bracco", "comment_text": "Can anyone actually answer OP question?"}, {"username": "Francine Eaves-Ranft", "comment_text": "Here’s an idea. Travel with only underwear and 2 days of clothing. Start accumulating upon arrival"}, {"username": "Julie Smith Gabriel", "comment_text": "Leaving dirty underwear, GROSS!!! Buy a new suitcase to get your souvenirs home, including your dirty underwear and other clothing"}, {"username": "Barbara Bastianini", "comment_text": "One time in a three month multi country trip that involved a season change I washed and folded my dirty out of season clothes and mailed them home."}, {"username": "Jodi Connors", "comment_text": "You could just go to a post office and mail them back yourself. You don’t need to pay for a shipping service."}, {"username": "Jill Cox", "comment_text": "Compression bags!! They roll up to next to nothing"}, {"username": "Bonnie Rupprecht", "comment_text": "Listen! Take your oldest clothes, underwear, socks and throw them away as you wear them. Shipping anything\nFrom Europe is expensive. I do this every year."}, {"username": "Maria Coladangelo Ducca", "comment_text": "I usually pack older clothes . Socks , undies . A pair of comfy older joggers etc then I throw these out . On a daily basis you would be surprised at the room you have for buying the beautiful things . Or pack very very wisely ( I sometimes send things it to the dry cleaners- the hotel can advise)"}, {"username": "Carla Casci Principato", "comment_text": "Or go to Mailboxes Etc and simply ship it home. I've done this 3x"}, {"username": "Monica Roman-Fazio", "comment_text": "I just came home Friday. We had to purchase a extra suitcase and a dufflebag. We paid the extra fee for 2 checked bags. It was cheaper then shipping"}, {"username": "Ann Caruso", "comment_text": "I do this all the time I put unwanted clothes in the donation bin!"}, {"username": "Jacquie Johnston", "comment_text": "I was in Italy Oct 2022 for 21 days, cruise ship, hotels did our laundry a few hotels did not, did it in the sink an hung in the shower. I travel with 3 bras an panties that dry in 30 min. Used 2 carry on size on United, checked one ( it’s free) carried one one ( I’m 69) you youngins can do it. Lol 😄"}, {"username": "Beth Talbert", "comment_text": "We take a duffel bag that folds flat in our carry on. Then on the way back we check one suitcases full of dirty clothes and use the duffel as our carry on with toiletries/\nstuff we need for flight and any souvenirs we bought."}, {"username": "Grace Sulsenti", "comment_text": "I put all the dirty laundry in the bags we check in. Then carry home the gifts & souvenirs to keep them from disappear ing. This, due to prior experience. Believe me. No one wants yr dirty laundry."}, {"username": "Susan Beeman Barness", "comment_text": "After a lot of research, I’ll be using: https://\nwww.sendmybag.co\nm/en-gb/"}, {"username": "Cynthia Marie", "comment_text": "Since I was a little girl my grandfather would visit the village he was raised. He would bring suitcases, so many suitcases, filled with clothing to donate to the church, his family and friends. I also remember he would return with a suitcase filled with the most delicious cheese I have ever eaten.\nI continue that tradition today."}, {"username": "Pam Kimak", "comment_text": "Better yet..learn to travel light ..it can be done. I just came back from Italy for 11 days with my daughter, her 2 sons..23 and 20, and we all had carry ons with room to spare for a few things we bought there."}, {"username": "Louanne Peterson", "comment_text": "I can’t believe these comments. No one has anything better to do than to scold everyone else. We actually just mailed a box of clothes home but I have to say, it was not inexpensive. It cost us $80 to send one medium box home. We also used a hotels Laundry service for a couple bags of clothing which cost about half of that surprisingly. We did not pack heavy but if you are going for a couple weeks or more, it is not easy. Leave clothes, send clothes home or use the Laundry service and pack an empty duffle for souvenirs. But most of all, enjoy all the moments. Side bar- I did come home wishing I would have brought back more but traveling with a family of 4, It can be overwhelming managing."}, {"username": "Linda Coiro", "comment_text": "Take clothes you can leave there. We did and donated them to the Ukrainian refugees by way of the bnb’s cleaning lady. We then could fit all our new stuff in our carryons."}, {"username": "Dennis Comfort", "comment_text": "How about don’t take so much stuff and do laundry s few times. We each took a wheeled carry on and a small day pack and we took one collapsible bag that we filled with laundry coming home (checked that one). We were gone 32 days and all agreed we could have packed lighter. It’s the only way to go I think. Check out Rick Steve’s videos on travel tips and packing"}, {"username": "Richelle Trezise", "comment_text": "Put a smaller suitcase inside a larger one. Then only fill the small with clothes and shoes. Then you have the large checked in one to fill up with stuff"}]}, {"id": "2194439260955152", "text": "My husband and I are traveling to Rome, Florence, and Venice the end of Nov - beginning of Dec for 2 weeks.\n\nWe are looking for recommendations for the best 'day trips' by train from Florence and Venice during that time of year.", "link": "facebook.com/groups/1373361046396315/permalink/2194439260955152/", "likes": 4, "comments": []}, {"id": "2194438154288596", "text": "Planning a fall 2024 trip to Italy and curious if I will have any issues with my food intolerance. I have issues with Sulphites (a preservative mainly in wine or shelf life foods). Are a lot of the pasta sauces made with wine? How much hassle will it be to request no wine in a sauce?", "link": "facebook.com/groups/1373361046396315/permalink/2194438154288596/", "likes": 1, "comments": [{"username": "Ilaria Verda", "comment_text": "Usually wine is used for risotto or to cook meat for stufati, stracotto etc, rare for pasta"}]}, {"id": "2194436007622144", "text": "How can I travel to Venice from Salerno? Would need July 19th coming back July 21th or even 20th? Just quick trip", "link": "facebook.com/groups/1373361046396315/permalink/2194436007622144/", "likes": 0, "comments": []}, {"id": "2194428724289539", "text": "I booked the Cinque Terre day trip from Florence with Got My Guide. Bad idea or good? Going in a few days. Better alternative to get there?", "link": "facebook.com/groups/1373361046396315/permalink/2194428724289539/", "likes": 1, "comments": [{"username": "Jerry Burdick Rutz", "comment_text": "We were 2/2 on bookings with “Got my Guide.” One in Florence and the other in Rome. At first glance we thought it pricey. After the fact, we thought it worth every penny. I hope you have the same good fortune. Happy travels."}, {"username": "Claudia Nobre", "comment_text": "It is a great deal, we did this tour last week with the English guide option, kids loved it! It stops in 4 cities and give us options on what to do in each city on our own. In one city you have time to have lunch and spend time at the beach, water was amazing. The ferry is really quick, I though it would be longer. The bus was great but no bathroom, just as warning. We saw a few people really desperate in the way back to Florence, it takes almost 2 hours."}]}, {"id": "2194421747623570", "text": "FYI in Sorrento, from the ferry:\nWe thought we could walk the short distance to our hotel. With a carry on. 🤦🏼‍♀️\nIt’s a steep climb up a cobblestone path, OR you can take a lift but there is usually a long line a d costs 1,10 euros. We walked!!! Horrible. In the heat with rolling carry ons up the cobblestone road. People must’ve though we were nuts.\n\nSo I assume most people request a taxi.\nIt’s the cutest town though!", "link": "facebook.com/groups/1373361046396315/permalink/2194421747623570/", "likes": 0, "comments": [{"username": "Jann Kinsela", "comment_text": "We’re there taxis available from the ferry when you arrived. We are 4 people and thought we would do the 20 min walk to air bnb. You post suggests not to?"}]}, {"id": "2194332280965850", "text": "Hello, we are a family of 4 ( 2 adults, 11 yr old, 15 yr old).\n1 - is it worth going to Sardinia ? We are going to Sicily. Is it worth going to both?\n\n2 - how does Sardinia compare to Amalfi Coast? For those who have been, which one do you prefer please?\n\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2194332280965850/", "likes": 0, "comments": []}, {"id": "2194292607636484", "text": "First time visiting Italy, thinking of staying in Trevi, Monti or Trastevere Rome for 6 nights. Any pros or cons for these areas, please?", "link": "facebook.com/groups/1373361046396315/permalink/2194292607636484/", "likes": 0, "comments": [{"username": "Ann-Louise Dooley", "comment_text": "We are staying Trastevete area. It had a lot of positive comments about it. Lots of restaurants I hear."}]}, {"id": "2194222534310158", "text": "We are staying in Conca dei Marini and are headed to Amalfi . Does anyone have a great contact for a boat rental in Conca dei Marini or Amalfi for 4-5 hours ? Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2194222534310158/", "likes": 1, "comments": []}, {"id": "2193751714357240", "text": "Traveling to Italy mid November for 8 days.\n\nPlan is 3 days Rome, 3 days in Florence and 2 in Venice.\n\nWhat will the weather be like in each city - so I know how to pack?\n\nGoing with husband and 2 older teens. Looking for nice clean accommodation in each city. I need private bath and sleeping beds for all. Don’t need luxury- just have to haveआणखी clean safe room. I don’t think I want Air B n B. I like having hotel - don’t have to worry about luggage if we need it stored for few hours.\n\nI think what I should have said is 2 full beds or queen beds.", "link": "facebook.com/groups/1373361046396315/permalink/2193751714357240/", "likes": 4, "comments": [{"username": "Maria McGill", "comment_text": "Hotel Perseo in Florence"}, {"username": "Nancy Matheny", "comment_text": "Weather can vary. I would wait until closer to the trip and see what is says. We are going early October and I am planning on 60-70 degrees. You can just Google weather in Rome in November to get an idea. We were there in November 6 years ago and it was about 65-70 degrees."}, {"username": "Serena Mascheretti", "comment_text": "It is hard to forecast the weather now. It normally is mild cool, but the best thing is having layers and windbreakers."}, {"username": "Martha Lee", "comment_text": "Its going to be warm. But I live in a cold climate so its perfect weather for me"}, {"username": "Paula Brink", "comment_text": "You will likely need to book two rooms with four of you. Can you tell us what your budget is per night for accommodation?"}, {"username": "Cindy Corbin Cangelose", "comment_text": "Budget for hotel is about $300 a night."}, {"username": "Pom-Eric Doland", "comment_text": "Us too! Following!"}, {"username": "Allison Mir", "comment_text": "Allison Mir"}, {"username": "Judith Pishnery", "comment_text": "I have a windbreaker (anorak style) with a zip out liner, that has been great in Europe in October & November, (also March, April)"}, {"username": "Gloria Maledi", "comment_text": "I think around 60 degrees. We italians usually wear a coat or a leather jacket for warmer days. I would bring pants, long sleeve tops, trainers, maybe a scarf. Don't bring uncomfortable shoes"}, {"username": "Leah Naylor", "comment_text": "Cindy Corbin Cangelose it may be tough to find 2 hotel rooms for $300/ night - but maybe since it’s off season you’ll have luck."}, {"username": "Karen Schmidt", "comment_text": "I would really rethink the Airbnb. It will be bigger, have a kitchen and the ability to keep food for hungry teens. I find them cheaper than hotels as well so will fit your budget better. Easy to get a 2 bedroom one. Lots of Airbnb’s will store luggage too"}, {"username": "Nancy Lewis", "comment_text": "Cindy Corbin Cangelose. Do you need 3 beds! That would usually be 2 rooms"}, {"username": "Paige Montecalvo", "comment_text": "Not a hotel, but we just got back from Italy and stayed here in this HUGE condo in Rome. It has been owned by the family for years and now they rent it out. You literally overlook the Forum from the massive balcony, and are a stones throw from the Colosseum. Here is a view from the door.\n\nLuggage storage is 100m from the front door, super easy self-store access."}, {"username": "Jenny Payne", "comment_text": "I stay in a 3 star in Rome & Florence ,have been going for a few years now but even 3 star are not cheap they are Hotel Nord Nuova Rome & Hotel Perseo Florence Google price direct & booking .Com both clean & safe🌻"}]}, {"id": "2193053221093756", "text": "We just returned from Italy and it was more than I could ever think it could be.\n\nWe spent a few night in Ravello and a few nights in Naples!! I love both.\n\nNaples was completely safe. No issues and so much to do. I do recommend a hotel for international travel. It helped tremendously with the language barrier and direction.\n\nWe did stay 2 nights inआणखी an air bnb and the host was phenomenal! We had a hiccup and stayed in Pianello- a remote location 1 night and left there earlier and returned to Naples.\n\nThe food was amazing. I highly recommend Sottocoperta,' A Figlia d '' o Marenaro.\n\nExplore the Alley ways there are gems in them.\nWear what you want!!!! Wear sandals with support! I work Birkies the whole time and I was fine.\nPlz see the Gardens in Ravello.\n\nLa Dolce Vita!", "link": "facebook.com/groups/1373361046396315/permalink/2193053221093756/", "likes": 0, "comments": [{"username": "Kay Rendall", "comment_text": "So happy to read your post. I think Italy is magic. Will be there 3/8 from Au my 9th trip. Thus time to discover some areas in Puglia before returning to Positano.\nI will be away 11 weeks, can't wait"}]}, {"id": "2192707227795022", "text": "View from our room in Florence!!! ❤️", "link": "facebook.com/groups/1373361046396315/permalink/2192707227795022/", "likes": 78, "comments": [{"username": "Triskell Young", "comment_text": "That was ours, back in May"}, {"username": "Gina Johannes", "comment_text": "We are at Croce di Malta. It is lovely and has a pool and a rooftop bar!"}, {"username": "Fran Mello", "comment_text": "This was mine"}, {"username": "Barbara Horton", "comment_text": "Are cottages available to rent? Maybe more reasomable,?"}, {"username": "Donna Dougherty", "comment_text": "Our air bnb view!"}, {"username": "Deborah Wigley", "comment_text": "Our view in Florence."}, {"username": "Zehra Fabio", "comment_text": "Zehra Fabio"}, {"username": "Frank Hunt", "comment_text": "Nice.😏"}, {"username": "Sam Hersh", "comment_text": "View from our hotel room in Rome"}, {"username": "Ann Larmore Andis", "comment_text": "Following !"}, {"username": "Kathleen Sarrett", "comment_text": "Kathleen Sarrett"}, {"username": "Ruth Dias", "comment_text": "View from our room in Barcelona June 2023😎❤"}, {"username": "Yahima Oquendo", "comment_text": "From our Airbnb"}, {"username": "Marlene Norris", "comment_text": "Marlene Norris"}, {"username": "Pong Ac Ai", "comment_text": "Pong Ac Ai"}, {"username": "Pong Ac Ai", "comment_text": "Very nice there too"}, {"username": "Leslie Peng", "comment_text": "You can still add it to original post. Just find the edit button."}, {"username": "Colleen Jennings", "comment_text": "Colleen Jennings"}, {"username": "Colleen Jennings", "comment_text": "View from my seat at Norah jones concert in Lucca Friday night."}, {"username": "Simone Minichino-Garofalo", "comment_text": "Viareggio checking in with a view from the terrace on the first night 🇮🇹🇮🇹🇮🇹"}, {"username": "Carmela Siniscalchi Frattellone", "comment_text": "Our rooftop view in Florence."}, {"username": "Susan Vosko", "comment_text": "Susan Vosko"}, {"username": "Susan Vosko", "comment_text": "Susan Vosko"}, {"username": "Faryal Abbas", "comment_text": "Any of you can provide link for your beautiful airbnbs? We are in process of booking ours in Florence ❤️"}, {"username": "Rūta Šaltienė", "comment_text": "View from my hotel room in Maiori, Amalfi coast. September 2022."}, {"username": "Kenia Turcios", "comment_text": "Kenia Turcios"}, {"username": "Roula Lolak", "comment_text": "No view and she got 75 reactions, 128 comments and 1 share, just imagine if she had a picture 🤣😂"}, {"username": "Julie Carnevale-Fraher", "comment_text": "Can you and any AirBnb users with these views share the links to the places?"}, {"username": "Deborah Benedetto DeLaurentis", "comment_text": "Where is the best place to go for a cooking class? Maybe 2-3 hours tops for a class."}, {"username": "Yee Mei Leong", "comment_text": "Can anyone recommend a store to buy murano glass on Venice? We don’t have time to visit Murano Island during our trip…."}, {"username": "Alessandro Iannelli", "comment_text": "It's a philosophical statement, as is: \"our interior room, our heart\". Or she forgot to upload the photo, who knows."}, {"username": "Jay Littleford", "comment_text": "My view from Sienna."}, {"username": "Wayne Viney", "comment_text": "Wayne Viney"}, {"username": "Melanie Matthews Stuprich", "comment_text": "This was the view from my Airbnb in Florence last weekend. Such a great view!"}, {"username": "Fuad Osta", "comment_text": "Waiting for the view!!"}, {"username": "Andrea Romano", "comment_text": "Andrea Romano"}, {"username": "Chip Keyes", "comment_text": "Why…it’s indescribably beautiful!"}, {"username": "Jeff Mills", "comment_text": "I hate Florence. Full of thieves. These two pickpocketed me on the old bridge. Ill never go back. F that city."}, {"username": "Jaime Cleek", "comment_text": "I don't see your picture"}, {"username": "Joe Reams III", "comment_text": "Wow that’s amazing!"}, {"username": "Cynthia Peraza", "comment_text": "Cynthia Peraza"}, {"username": "Katerina Zob", "comment_text": "It happens to everyone sometimes 🙂"}, {"username": "Paulette Molasses Sims", "comment_text": "She has no view!"}, {"username": "Peter Davidson", "comment_text": "Very nice!"}, {"username": "Susan Baum", "comment_text": "From my AirBnB window"}, {"username": "Steve Hinton", "comment_text": "Get a new room. Can’t see anything. 🤔"}, {"username": "Lynnie Foran", "comment_text": "Lynnie Foran"}, {"username": "Kevin Kappel", "comment_text": "Minus the picture?"}, {"username": "Jill Medrano Casey", "comment_text": "Not out our window, but out the front door of our VRBO. Palazzo Vecchio."}, {"username": "Sue McCallum Ross", "comment_text": "View from our Airbnb 😍"}, {"username": "Michael Galan", "comment_text": "Michael Galan"}, {"username": "Brian Osman", "comment_text": "Brian Osman"}, {"username": "Sea Shore", "comment_text": "Lisa Solary Jacoby id like to see too"}, {"username": "Maurice Bastarache", "comment_text": "There you go"}, {"username": "Meenu Singh", "comment_text": "Yeah, that's a real nice view."}, {"username": "Leanne Mason", "comment_text": "Oops I guess it would have helped to make sure the photo got uploaded 🤣. Try this again…\n\nView from hotel in Florence 😊"}, {"username": "Tiffany Williams", "comment_text": "view from our room"}, {"username": "Julie Barrett", "comment_text": "The view from ours in Venezia"}, {"username": "Danielle Johnston", "comment_text": "View from our room in Rome"}, {"username": "Christine Malota- Kendall", "comment_text": "I’ve been to Florence 4 times… last time was just this past summer and this summer my sister and I are bringing my mother… these posts are making me excited for what is to come! They’re gonna love it!"}, {"username": "Kathy Wilkey Smith", "comment_text": "I think the photo is missing."}, {"username": "Nadia Mckenna", "comment_text": "Oooooops! Where’s the photo 🤷🏼‍♀️"}, {"username": "Bev Symes", "comment_text": "?"}, {"username": "S.P. Espy", "comment_text": "I can imagine it!"}, {"username": "Bob Elliot", "comment_text": "I guess there was none!"}, {"username": "Tami Neubauer Foster", "comment_text": "Was it midnight?"}, {"username": "Eileen Dalton", "comment_text": "LOL"}, {"username": "Kerrie Payne", "comment_text": "Any tips for nice restaurants and trips please would be appreciated 😉"}, {"username": "Melissa Bensink", "comment_text": "This is what is wrong with adults. Be better people. ;-) 😉"}, {"username": "Gael Mackenzie", "comment_text": "My view. ."}, {"username": "Lisa Martinson", "comment_text": "Lisa Martinson"}, {"username": "Sherry Shannon", "comment_text": "Beautiful 🖤"}, {"username": "Christine Trisko", "comment_text": "Our view into Piazza Republica from our room ❤️❤️"}, {"username": "Helen McCarthy Yerger", "comment_text": "Leanne you may want to add the picture along with the statement 😂"}, {"username": "Traci Merriman Langill", "comment_text": "View from Florence Hotel Garibaldi Blu"}, {"username": "Andrea Shelton", "comment_text": "Beautiful! Enjoy!"}, {"username": "Maria Musumeci", "comment_text": "My view at night from our tiny bedroom window. ❤ aaah great memories!!"}, {"username": "TRIXIE MARTINEZ", "comment_text": "Incredible view!"}, {"username": "Bonnie Scoullar", "comment_text": "Hope you didn't have to pay extra for that view..."}]}, {"id": "2194952520903826", "text": "The beauty of Naples, Italy", "link": "facebook.com/groups/1373361046396315/permalink/2194952520903826/", "likes": 9259, "comments": [{"username": "Michelle Crawley", "comment_text": "Capris' most famous landmark."}, {"username": "Guy Munoz-giannoni", "comment_text": "Absolument magnifique !"}, {"username": "Kinga Radamska Tarlaga", "comment_text": "♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥\n♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥\n♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥\n♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥\n♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥\n♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥\n♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥\n♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥\n♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥\n♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥\n♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥\n♥♥♥♥♥"}, {"username": "Ana Sanchez Martinez", "comment_text": "Carlos Alejandre Alcázar"}, {"username": "Ana Sanchez Martinez", "comment_text": "Carlos Alejandre Alcázar"}, {"username": "Игорь Порхун", "comment_text": "Bellissima Napoli"}, {"username": "Dayli Syms", "comment_text": "Robert Alexander Syms 🤗"}, {"username": "Jan-Gregory Lillja", "comment_text": "Capri ❤️"}, {"username": "John Griesi", "comment_text": "John Griesi"}, {"username": "Mary Shaughnessy Everett", "comment_text": "Definitely not Naples! Capri is gorgeous!"}, {"username": "Baunoch Árpádné", "comment_text": "Capri nem Nápoly"}, {"username": "Katie Speranza", "comment_text": "Gorgeous ❤️❤️"}, {"username": "Candie Toska", "comment_text": "Absolutely stunning!"}, {"username": "Michael Romano", "comment_text": "Viva Avalino...."}, {"username": "Renata Żmuda", "comment_text": "Capri 😍"}, {"username": "Mihai Ilie-Damaschin", "comment_text": "That's not Naples, it's Capri. The picture is most likely taken from the Gardens of Augustus."}, {"username": "Karina Nowak", "comment_text": "To jest Capri ❤️"}, {"username": "Dart Veider", "comment_text": "I was now In amalfi coast..please never going there in the middle of summer🥵🥵🥵its crazy....to hot,to much tourists,u can breath,and the prices are so big for nothing😪😪COME TO GREECE!we have the best sea and beaches!!"}, {"username": "Mass Amm Rot", "comment_text": "It's Capri, here is naples instead:"}, {"username": "Takàcs Krisztián", "comment_text": "✌️"}, {"username": "Craig Gerard", "comment_text": "Wowww"}, {"username": "Alice Hajdu", "comment_text": "This is Capri. Off the coast of Napoli"}, {"username": "Eveline Hintze", "comment_text": "Eveline Hintze"}, {"username": "Adam Chwieduk", "comment_text": "Capri Island"}, {"username": "Briona Renee", "comment_text": "Ronnie King Pharoah"}, {"username": "Delph Dubois", "comment_text": "J ai la même photo que j ai prise à capri en 2019"}, {"username": "Tina Conforti", "comment_text": "Gorgeous ❤️❤️"}, {"username": "Joseph Patti", "comment_text": "My moms side is from Naples, My dads side is from Sicily.😉😎."}, {"username": "Csilla Markó", "comment_text": "Csilla Markó"}, {"username": "Anita Valdmane", "comment_text": "Neaizsniedzams sapnis."}, {"username": "Charmaine Michaels", "comment_text": "THIS IS NOT NAPLES YOU IDIOTS."}, {"username": "Hadzi Marija Matijevic", "comment_text": "Capri..❤️bila"}, {"username": "Doina Hangiu", "comment_text": "No, is not dirty Napoli, is Capri island!"}, {"username": "Olga Ganzha", "comment_text": "Capri"}, {"username": "Olga Ganzha", "comment_text": "Capri"}, {"username": "Valerie Riou", "comment_text": "Valerie Riou"}, {"username": "Jayne Scotney", "comment_text": "Capri"}, {"username": "Hazel Learmonth", "comment_text": "Maureen Aitken it's almost my picture 📸"}, {"username": "Ivana Živadinović", "comment_text": "😍"}, {"username": "Ildikó Ildikó", "comment_text": "Megyünk!"}, {"username": "Ula Mital Duda", "comment_text": "Bardziej Capri niż Neapol 🤔🤔🤔"}, {"username": "Marina Dřevíkovská", "comment_text": "Capri,krása!"}, {"username": "Magdalena Sroczyńska", "comment_text": "To Capri"}, {"username": "Carme Sanchez Mendez", "comment_text": "Capri Island"}, {"username": "Melanie Hartline Godfrey", "comment_text": "Definitely not Naples! Capri is stunning, as well as most of the Amalfi Coast❣️"}, {"username": "Diana Miranda", "comment_text": "Capri!!!!!!!!"}, {"username": "Grisel Fernandez", "comment_text": "Not Naples. CAPRI"}, {"username": "Keith Ertman", "comment_text": "This Capri 🇮🇹"}, {"username": "Sonia Medinski", "comment_text": "This is Faraglioni rocks on Capri Island"}, {"username": "Lydia Valencia", "comment_text": "Capri"}, {"username": "Lydia Valencia", "comment_text": "That is Capri."}, {"username": "Dana Galia", "comment_text": "Dana Galia"}, {"username": "Mary Pitrone Meo", "comment_text": "Beautiful"}, {"username": "Mary Pitrone Meo", "comment_text": "Capri"}, {"username": "Sylwester Pindelski", "comment_text": "To jest Capri, byłem,pięknie"}, {"username": "Barbie Papa", "comment_text": "Μοιάζουν!🤔"}, {"username": "Jim Fariz", "comment_text": "❤️❤️❤️❤️ Beautiful Italy!"}, {"username": "Christie Main Callea", "comment_text": "That is Capri"}, {"username": "Farolyn DeMars", "comment_text": "Miss this!!"}, {"username": "Eva Winkelbauer", "comment_text": "Capri🫶❤️🫶"}, {"username": "Virgz Van Møøre", "comment_text": "Don't post when you don't know what you are talking about"}, {"username": "Regan Verwey", "comment_text": "Stunning!"}, {"username": "Jayzeus Pineda", "comment_text": "Samantha Samm"}, {"username": "Kris Locatelli", "comment_text": "Only that’s Capri"}, {"username": "Grażyna Zara", "comment_text": "Grażyna Zara"}, {"username": "Mali Tozzi", "comment_text": "I have been here at this exact spot it is Naples"}, {"username": "Nikolina Čačija", "comment_text": "Josipa Ančić 😍"}, {"username": "Nanka Racheva", "comment_text": "Това е Капри, а не Неапол!"}, {"username": "Varga Kata", "comment_text": "💙"}, {"username": "Angel Ritz", "comment_text": "Anthony Ritz is this one of the areas we are going?"}, {"username": "Aristea Spinthaki", "comment_text": "Μοναδικό Kapri"}, {"username": "Ліна Сизоненко", "comment_text": "Capri, not Naples🤗"}, {"username": "Maksim Milokhov", "comment_text": "This is the island of Capri, not Naples))"}, {"username": "Rob Kuiper", "comment_text": "Capri!!!\nIt was amazing boating there"}, {"username": "Leigh Hittner Liesemer", "comment_text": "But this Capri."}, {"username": "Maria Burke", "comment_text": "One day…"}, {"username": "Virginia Mastrogiovanni", "comment_text": "Capri. Absolutely not Naples."}, {"username": "Carla Stamate", "comment_text": "Capri"}, {"username": "Syeda Kehkashan Zaidi", "comment_text": "This is capri"}, {"username": "Anita Kjelstad", "comment_text": "Dette er Capri ☀️"}, {"username": "Maria Naclerio", "comment_text": "This is Capri overlooking the crystal caves, not Naples.....Capr\ni off of Sorrento with Mt. Vesuvious in the background"}, {"username": "Rossana Yaluff", "comment_text": "Esto es Capriiiii"}, {"username": "Hristo Kirchev", "comment_text": "This is Kapri, not Naples!"}, {"username": "Eska Stefania", "comment_text": "Capri is amaizng😍"}, {"username": "János Kis", "comment_text": "Capri"}, {"username": "János Kis", "comment_text": "János Kis"}, {"username": "Paul Conboy", "comment_text": "Capri not Naples"}, {"username": "Evelina Danciu", "comment_text": "Capri 😉"}, {"username": "Lois Marie", "comment_text": "We were here on a boat"}, {"username": "Rafał Dyzma", "comment_text": "Tak. To niezwykły świat. Niezwykła przyroda i niezwykli ludzie"}, {"username": "Dimitri Pianese", "comment_text": "Capri, not Naples."}, {"username": "Roger W Ilsley", "comment_text": "Been there"}, {"username": "Emilia DeCarolis-Tabback", "comment_text": "I think that may be Capri- I have that same picture from\nA few years back…"}, {"username": "Сузана Котевска", "comment_text": "the best of Amalfi Cost, Capri island....it is not Naples"}, {"username": "Matt Henderson", "comment_text": "Capri is in the Gulf of Naples."}, {"username": "Virginie Levier Dodeux", "comment_text": "Mireille Levier can’t wait 🩷🩷🩷🩷🩷"}, {"username": "Maurice Bastarache", "comment_text": "Yeah this is Capri. View from Augustus Gardens. Beautiful spot."}, {"username": "Yuko Konno", "comment_text": "So beautiful ♥️"}, {"username": "Kathy Ann Jones", "comment_text": "Capri, Faraglione Rocks."}, {"username": "Lynda Petralia", "comment_text": "This is Capri."}, {"username": "Dottor Peppe Insigne", "comment_text": "I understand that you didn't study Italian geography at school, but avoid making bad comments"}, {"username": "Julie Wesley", "comment_text": "Absolutely amazing"}, {"username": "Maria Mcaveney", "comment_text": "❤️❤️❤️❤️"}, {"username": "杨莉", "comment_text": "Forgive my mistake, I didn't make a good strategy very carefully"}]}, {"id": "2194957574236654", "text": "If you are visiting Como Lake don't miss Varenna 😍😍😍 .\n✨ Beautiful suspended frontlake\n✨ Beach to swim with fresh water from the mountain\n✨ Bars, restaurants, ice cream\n✨ Beautiful view\n✨ Ferry", "link": "facebook.com/groups/1373361046396315/permalink/2194957574236654/", "likes": 171, "comments": [{"username": "Karen HL", "comment_text": "❤️❤️❤️"}, {"username": "Risa Mwangi", "comment_text": "Wow! Amazing!"}, {"username": "Lidia Costanza-Canlas", "comment_text": "Nice. Where does the ferry go?"}, {"username": "Christine Cesareo", "comment_text": "Judy Alessio"}, {"username": "Marie Simpson", "comment_text": "Demi Quinn Sophie King"}, {"username": "Lisa Mac", "comment_text": "Beautiful thank you for sharing."}, {"username": "Karin Carmignani", "comment_text": "So gorgeous!!"}, {"username": "Jodie Hartshorne", "comment_text": "Did you stay in Lake Como?"}, {"username": "Sue Farrell", "comment_text": "Loved Varenna!"}, {"username": "Sierra Behrens Tibbetts", "comment_text": "What is the weather like there now?"}, {"username": "Renee Bruno-Arias", "comment_text": "Thank you, looks beautiful. I’ll be there in a few weeks😊"}, {"username": "Aurélie Lejeune", "comment_text": "Priscilla Nina 💞⛱️"}, {"username": "Alejandro Gabriel Valenzuela Anghileri", "comment_text": "I grew up in lake Como (Lecco) and I think Varenna is far better than Bellagio"}, {"username": "Jo Courage", "comment_text": "Oh wow I LOVE ❤️ this thank you for sharing, I will definitely bookmark 🔖 this place to visit 🙌👍"}, {"username": "Gary Trignani", "comment_text": "OK, thanks for the suggestion. Putting this on our must see list."}, {"username": "Anne Darpino Lawrance", "comment_text": "You are SO right we stayed there for a week in June and LOVED Varenna ❤️"}, {"username": "Chris Whybrow", "comment_text": "Lisa Jane"}, {"username": "Brenda Petruzzi", "comment_text": "Beautiful"}, {"username": "Claire Dowson", "comment_text": "I much preferred Varenna to Bellagio. It’s beautiful ❤️"}, {"username": "Amy Lonergan Ryan", "comment_text": "It was my favourite too"}, {"username": "Shanene Hood", "comment_text": "Jordan Hood"}, {"username": "Teresa Rivero", "comment_text": "Beautiful! ❤️🇮🇹"}, {"username": "Renee Rundle Stoneham", "comment_text": "We stayed in Varenna in June!💕\nWe liked it sooo much better than Bellagio!"}, {"username": "Reets Lawrence", "comment_text": "Mel"}]}, {"id": "2194962124236199", "text": "We are going to be in Sorrento for 3 days in September and planning on a day trip to Positano, Amalfie and Ravello by private car. Which tour company would be best?", "link": "facebook.com/groups/1373361046396315/permalink/2194962124236199/", "likes": 0, "comments": []}, {"id": "2194962814236130", "text": "Hi, what's people's thoughts on staying in hostels... We are hoping to go for about 6 weeks travelling around..would always want private room with bathroom, have seen quite afew....any recommendations would be great too x", "link": "facebook.com/groups/1373361046396315/permalink/2194962814236130/", "likes": 0, "comments": []}, {"id": "2194975464234865", "text": "We will arriving to Italy in 2 weeks. I remember someone posted about how to get cash (Euros) and I want to re-read the post and cannot find it. Please if you could remind me about this. Thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2194975464234865/", "likes": 0, "comments": [{"username": "Pietro Adami", "comment_text": "Bank ATMs or walk in in banks (with your passport)"}, {"username": "Lucrezia Folger", "comment_text": "ATM attached to any bank."}, {"username": "Krista Ford-Walcer", "comment_text": "You can search up top of this page and all will come up😊"}]}, {"id": "2194965620902516", "text": "Recommendation for early morning coffee / breakfast before hitting the 9am Colosseum tour?", "link": "facebook.com/groups/1373361046396315/permalink/2194965620902516/", "likes": 0, "comments": []}, {"id": "2194967490902329", "text": "Heading to Sorrento tomorrow from Rome with a stop in Pompeii. With the temperature being over 100 degrees, just wondering if you think we’ll still enjoy Pompeii if we don’t have a tour guide? Just not sure some of our family members can take 2 to 3 hours in this hot weather without any shade.", "link": "facebook.com/groups/1373361046396315/permalink/2194967490902329/", "likes": 7, "comments": [{"username": "Ariane Grenier", "comment_text": "I was there today from 10am to 2pm and there is shade if you go before noon. We made plenty of stops along the way, but spent 4h total there. There are multiple water fountains on site. I highly recommend getting a tour guide though, there was not many signs/\ndescriptions of the artefacts."}, {"username": "Eric Maurer", "comment_text": "I would recommend a guide. We had a guide for about the first 2 hours and had a great experience, as soon as the tour was over we were lost on our own. You can get them at the gate, a private guide was 150"}, {"username": "Kim Grodnick", "comment_text": "Thoughts on tour guide vs Rick Steve's audio guide?"}, {"username": "Rachael Richardson", "comment_text": "We went to Pompeii yesterday got there 9am skip the line, went to the back of Pompeii and worked our way back towards the exit much less crowded doing it that way - took 2-3.5 hours and we are all reasonably fit, we just stayed on the shade side ! Plenty of water fountains to refill your bottle, did it ourselves just followed the map we had a hand held audio guide for info\nThere was a breeze yesterday\nAlso I hate guided tours so can’t comment on that side !"}, {"username": "Joanie Corneil", "comment_text": "Yes!"}, {"username": "Angela Genduso", "comment_text": "Skip Pompeii got heat exhaustion and hotel summoned a Dr. Lost three days . Was also disappointed stay in a hotel in Sorrento by the pool."}, {"username": "Nana Tirolese", "comment_text": "We were told by Italian relatives that took us that we should latch on to a group with an English-speakin\ng guide to save money and have a more interesting visit. We did this part of the time. We mostly walked around on our own."}, {"username": "Alex Kovacs", "comment_text": "We did 1230-230 without a tour guide earlier this month and it was hot but it was fine and still enjoyable. Even maps has some of the bigger buildings listed on what they are!"}, {"username": "Nicole Beaumont", "comment_text": "Honestly, you really need someone knowledgeable to help you understand what you’re seeing."}, {"username": "Kim Lehman Johnson", "comment_text": "I’m not sure I’d go to Pompeii even with a tour guide if the temp is 100. Very little shade."}, {"username": "Marilyn Kedves", "comment_text": "Too hot"}, {"username": "Elizabeth Yu", "comment_text": "I would not go there in this kind of heat."}, {"username": "Susan Hulsey Watkins", "comment_text": "If you have family members you are concerned about, I would skip it. It’s not an easy walk, the rock and stone makes everything hotter, and there’s very little shade. There are water and snack vendors all over the street when you leave, but no where to sit and rest. You don’t t want to have someone fall ill from the heat, or physically fall down in there. 😔"}, {"username": "Xiomara Matus", "comment_text": "I noticed the elders in Spain/\nAndalucía (114F) use umbrellas for shade, I’m thinking of bringing one myself."}, {"username": "Elizabeth May La Duca", "comment_text": "Couldn’t pay me to go to Pompei, even in pleasant weather conditions…tooo\no boring for me"}, {"username": "Frank Hunt", "comment_text": "Pompeii is very hot and dusty at the best of times, +40c would be a killer."}, {"username": "Robin Burrell", "comment_text": "Can you go very early?"}, {"username": "Starla Dawn", "comment_text": "I didn’t enjoy Pompeii but I LOVED Ravello, Positano and a beach day at Sorrento"}, {"username": "Jo Ann Schwartz Woodward", "comment_text": "Honestly it will be brutal. Pompeii is incredible but…. Not in this heat"}, {"username": "Renee Rundle Stoneham", "comment_text": "Go early, bring water and an umbrella.\nPersonally I wouldn’t do it as a stop over. Travel days can be tiring enough!\nGo another morning from Sorrento, take the train and get as soon as it opens in the morning.\n\nI absolutely loved it and spent about 5 hours wandering around etc. However this was in April and even though it was raining when we left Sorrento it was sunny and very warm at Pompeii."}, {"username": "Jennifer Rand", "comment_text": "It’s brutal"}, {"username": "Phyllis Snyder", "comment_text": "Take your time take lots of water- stop and rest when overheating. Go early as possible! Don’t miss the opportunity to see this wonder!"}, {"username": "Laura Stevens", "comment_text": "Bring umbrellas. I would hire a guide to make the most of your experience in the shortest amount of time. It will get you out of the heat sooner without feeling like you missed out."}, {"username": "Sandy Conrad", "comment_text": "I would not do it given the temperatures . I’ve been there and there really isn’t any shade . It’s hot in normal summer temperatures…. Not a great time to visit Pompeii"}, {"username": "Gregory Oien", "comment_text": "Avoid Pompeii in the heat!"}, {"username": "Virginia Speedy", "comment_text": "Better off without a tour guide I think...if you're feeling overheated at least you can stop and take your time."}, {"username": "Jennifer Tarin", "comment_text": "Umbrellas and water no matter what you do. Buy a cute small Umbrella (tj maxx has them) to keep in your luggage and a reusable waterbottle. Maybe even take a washcloth to keep damp for the back of your neck should you start to feel off"}, {"username": "Sue Wurz", "comment_text": "We were in Pompeii 3 weeks ago. It was hot and no shade. I had a cooling towel which helped and an umbrella which was a hassle. The restaurant on the grounds charged €10 each just to sit even though we bought lunch."}, {"username": "Maria Al", "comment_text": "We did this two days ago. Fans helped. There is a little shade. We did have a guide and took the two hours. I had an umbrella to help shield some of the Sun."}, {"username": "Neville Spargo", "comment_text": "We were there just 4 days ago ! It was incredibly hot , there is next to no shade as you walk around . We went on a small group tour lead by an archaeologist (ASKOS tours) , he was very good and sensitive to the extreme heat conditions so dog us to the best , most significant areas , I think we did cut it a little short due the conditions. We went on in the afternoon and did the Herculaneum, it was next level hotter ! We added in a driver to get us from Naples to Pompeii and then onto Herculaneum and back to Naples , air conditioned car shared with 6 other people , well worth the extra rather than going by train !\n\nWe are now in Sorrento and it’s still hot , but you have the sea to cool down in 😃\n\nTook bus to Positano this morning from Sorrento, great bus ride ! Then ferry back to Sorrento! Positano was crazy busy, and super hot 🥵🔥"}, {"username": "Lori Greco", "comment_text": "It's all rock, and stone without any shade....so please take water and an umbrella. I'm sure the heat will bounce off the stone too.."}, {"username": "Maria Antidormi Corica", "comment_text": "Pompeii is so so hot! I would highly recommend a tour guide not that it makes it any cooler. Water water and wet towels to get you through"}, {"username": "Kristi Entwistle", "comment_text": "Go early! We were there around 10 am and you could still hide in the shade a bit :)"}, {"username": "Mi Reille", "comment_text": "We went 2 weeks ago and while there is not much shade, there was a breeze. I suggest that you bring an umbrella, which can provide some shade, and water. We went without a guide and spent about 3h."}, {"username": "Mike Ball", "comment_text": "Very little shade in Pompeii, we went a few years ago, it was around 90 degrees that day and it was hard going,\n\nWear a hat , take an umbrella and keep hydrated."}, {"username": "Melanie Lyons Roff", "comment_text": "I used wet towels a week ago and froze fruit boxes! I took fans but they weren’t overly useful. If you self guid make sure you get the right map. We bought a book and map from someone outside the site and the map wasn’t at all helpful! There is shade. There are buildings where you can be inside and buildings where you can find shade.\nThere is also a kiosk and toilet in the main square where you can re-wet your towels. Maybe go, see it and if you leave straight away so be it! Taxi home though as waiting for the bus was the worst part!"}, {"username": "Jenny Payne", "comment_text": "It will be so hot, go early 🌻"}, {"username": "Carine Brys", "comment_text": "Are you intent on going to Pompeii, because there also is Herculaneum which is smaller but better preserved. A guide does help you figure out what it is you are looking at."}, {"username": "Kelly Kay Bartz", "comment_text": "Skip Pompeii, recommend visiting The Palace at Caserta. 👑\nArrive early and rent electric bikes 🏍️ to ride the grounds."}, {"username": "Jill Medrano Casey", "comment_text": "Go early, bring water and umbrellas. We went without a tour guide in June and we regretted it. Even with the audio guide, we ended up wandering around and missing pieces.\n\nHonestly, unless your group is set on seeing Pompeii, I'd probably skip it in this heat."}, {"username": "Niamh Stenson", "comment_text": "I went last week with my 2 teenagers, one was very interested in Pompeii as she studies classics, the other teen not so much. We had Rick Steve's audio guide downloaded, got there for 9.30, it was hot, by 11.30 we stopped in the cafe for a break, no ac in there but it was cooler, left the uninterested teen in there and went back out to finish our own tour. Its manageable but be prepared, its very hot and not a lot of shade."}, {"username": "Kristin Bawden Larson", "comment_text": "Just there a few days ago!! Super hot, but we were there in the morning and there was some shade that the tour guide stopped in to talk to us- our whole family loved it!! For sure I’d say go!\n\n(One of the shops outside was selling mostly frozen water bottles…. I loved having one! Melted fully about 1/2 hour into the tour, but the cold water was great!!)"}, {"username": "Irene Oda", "comment_text": "A tour guide would be awesome- but not in this heat. If you can organize to be at the entrance at 9 am then it might work. The heat is unrelenting right now."}, {"username": "Miyuki Kanno Paul", "comment_text": "Download Rick Steves Audio Guide. You don’t need a tour guide. Wear hat and keep hydrated"}, {"username": "Roland Trego", "comment_text": "Pompeii is wonderful, but even in regular summer weather it can be hot because not very much is covered. People normally spend 2-3 hours, so in this heat, I might recommend against it for health reasons."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2194967617568983", "text": "If you are looking for any tours while in Florence/Tuscany/Cinque Terre, I highly recommend Paola's Florence Tours. We did a walking tour of Florence which included visits to the Academia and the Uffiziआणखी Museum. Our guide, Giuseppe, was very knowledgeable of the art and history of the city. The next day, Paola took us on a wonderful tour of Tuscany with visits to San Gimignano and Siena with a stop for lunch at a family winery. On the next day we embarked on an adventure to Cinque Terre, with stops in three of the villages. Paola was an excellent guide. We highly enjoyed our time with her.\n\nhttps://www.facebook.com/paolasflorencetours?mibextid=LQQJ4d", "link": "facebook.com/groups/1373361046396315/permalink/2194967617568983/", "likes": 0, "comments": []}, {"id": "2194970464235365", "text": "A lot of travellers asking about transfers from Naples train station to Sorrento. We used the below company, 35 euro per person one way. Merceds van, can take large bags. Easy to contact and very reliable.", "link": "facebook.com/groups/1373361046396315/permalink/2194970464235365/", "likes": 1, "comments": []}, {"id": "2194977737567971", "text": "Vatican Question: is there such a ticket as skip the line St Peter’s Basilica without a guide?\nI haven’t seen any on other sites but our date hasn’t come up yet on Vatican site.\nThanks!", "link": "facebook.com/groups/1373361046396315/permalink/2194977737567971/", "likes": 2, "comments": [{"username": "Kerri Bevilacqua", "comment_text": "Are you wanting to see the Vatican Museum, St, Peter’s, or both? Tickets are required for the Vatican Museum, but not for St. Peter’s. There are security lines in both places that you cannot skip. Once you go through security, you are free to wander around St. Peter’s at your leisure in the main areas"}, {"username": "Sherry Eckert", "comment_text": "Wondering. I purchased tour tickets for the museum and Sistine Chapel through the Vatican. Can I just walk into St Peters after the tour? Or do I have to go out and stand in another line to go in?"}]}, {"id": "2194979954234416", "text": "Ischia or Sardinia?", "link": "facebook.com/groups/1373361046396315/permalink/2194979954234416/", "likes": 0, "comments": []}, {"id": "2194481837617561", "text": "Renowned all over the world for the production of its precious Brunello red wine, Montalcino is a fairy-tale place, a medieval village perched on a hill overlooking the beautiful Orcia valley. Join us: आणखीhttps://nextstop-italy.com/virtual-tours/montalcino-tuscany/\n\n#italytrip #italygram #brunello #brunellowine #brunellomontalcino #brunellodimontalcino #montalcino #montalcino🍷 #montalcinotuscany #tuscany #tuscany #tuscanygram #tuscanyitaly #tuscanyexperience #orciavalley", "link": "facebook.com/groups/1373361046396315/permalink/2194481837617561/", "likes": 23, "comments": [{"username": "Ruth Akutu Maccarthy", "comment_text": "Beautiful 😍🥰❤️"}]}, {"id": "2177245262674552", "text": "RENT A CAR IN ITALY - TOP TRAVEL TIPS :\nMost visitors to Italy pick up their rental cars right at the airport. Rome Fiumicino, Milan Malpensa, and Venice Marco Polo are not only the country's busiest airports but also its main car rental hubs. Picking up and dropping off a rental car right at the airport is usually the cheapest option\nChoosing the right rental car supplier is really important. Interrent, Enterprise, and National are the three highest-rated car rental companies in Italy.\nRenting a vehicle for a longer period usually brings the daily price down significantly. A five-day trip might be only slightly more expensive than a three-day trip because of this. If you can, consider exploring Italy for at least a week!\nFamiliarize yourself with the rental conditions such as the mileage and fuel policies before booking a car!\nLearn about the traffic rules and speed limits before your trip — they might be different than in your country!\nIf you plan to drive in the Alps in winter, you might need snow chains — ask your rental car supplier about them.\nBook here for the best price: https://www.discovercars.com/?a_aid=NextStop-Italy", "link": "facebook.com/groups/1373361046396315/permalink/2177245262674552/", "likes": 20, "comments": [{"username": "Kim Butler Oam", "comment_text": "Act. P\nP"}, {"username": "Leesa Martin", "comment_text": "Alex Martin"}]}, {"id": "2194401304292281", "text": "We are travelling to Italy in September and I am wondering if it’s better to take the bus or the train when moving locations? When I look at the train from Rome to Ortona it is longer and more expensive than the bus. Any reason for this? What are peoples preferences? TIA!", "link": "facebook.com/groups/1373361046396315/permalink/2194401304292281/", "likes": 4, "comments": [{"username": "Connie Wilson", "comment_text": "Either works well, so choose the fastest route (but always look at the route). Note that the bus route on Rome to Rio shows bus to Pescara then a change to a train to Ortona. In this case I would take the train, even though that also has a change of trains in Pescara. At least you are at the train station to make the change. Trains usually are best between popular destinations, but Ortona is a bit off the beaten path."}, {"username": "Raf Gervasio", "comment_text": "Don't like bus drivers...train\nis better"}, {"username": "Sorin Srn", "comment_text": "Definitely I would choose the train…\nAnd one of the reasons is that along the ride you will see so much of the beauty of Italy👌"}, {"username": "Shana Woodfield", "comment_text": "If a train doesn’t go there take a bus."}, {"username": "Jane Coutts", "comment_text": "Definitely train"}, {"username": "Sharon Williams Sellers", "comment_text": "Train"}, {"username": "Cynthia McDonald", "comment_text": "We always do the train. I haven't found it to be more expensive though. It's a long train ride though so it's about 40E to get to Foggia via Italo and then 25E to get to Ortona via Trenitalia. So 65E. Agree that you will see some gorgeous countryside. About 6 hours."}, {"username": "Kendall LaCosta", "comment_text": "Thanks all! We booked the train 😊"}, {"username": "Vincenzo Salvia", "comment_text": "Bus !"}, {"username": "Lisa Valdovinos", "comment_text": "Train"}]}, {"id": "2194410957624649", "text": "Hello! I'm looking into purchasing the OMNIA pass as we'll be in Rome for a few days so thinking of getting the 72 hour pass and we're rookies lol, so seems the easiest choice. I have a couple questions: did you have trouble getting tickets for the attractions with the OMNIA pass? Is there an official site to purchase the pass? There seems to be a few websites that you can purchase them on and I want to make sure I buy them from the right source. Thanks in advance 🎉", "link": "facebook.com/groups/1373361046396315/permalink/2194410957624649/", "likes": 1, "comments": [{"username": "Tina Iftody", "comment_text": "I'd like to add that we ha e a 10yr old and some of the attractions (and transit) we want to do say it's free for 'citizens' under 18. I assume that only means kids who live there, not tourists right?"}, {"username": "Ann-Louise Dooley", "comment_text": "I asked this question on this site a few months back and no-one answered me! Am very interested in what suggestions you get. They don't seem popular. ???"}, {"username": "Terri Vermillion", "comment_text": "I did a google search and everyone says there is no such thing as skip-the-line passes. The line you are skipping when purchasing ahead is the ticket line. Nobody skips the security lines."}]}, {"id": "2194412060957872", "text": "Hi all. We are looking for some suggestions of where to go next week in the Milan area. We are in Puglia atm but heading back to Rome on 22nd for a night then have five days free until we need to be in Paris. It is on the third night need to be in Milan to go to a Bruce Springsteen concert. Ideally thinking two nights in Como, Milan for Bruce one night, then looking at somewhere beachside for two nights to relax before heading to Paris. Any suggestions would be great! 😀", "link": "facebook.com/groups/1373361046396315/permalink/2194412060957872/", "likes": 4, "comments": [{"username": "Kay Rendall", "comment_text": "Stay longer in Como, so many villages to visit by ferry. I will be there in August for 8 days"}, {"username": "Dessi Reljan", "comment_text": "Hi, I love Lago Maggiore! Check this flat in Baveno. It is 1 hour by car from Milan. https://\nwww.booking.com/\nhotel/it/\nmagicview-baveno\n-apartment.en-g\nb.html?aid=3041\n42&label=gen173\nbo-1BCAsocUIabW\nFnaWN2aWV3LWJhd\nmVuby1hcGFydG1l\nbnRIM1gDaHGIAQG\nYAQm4ARjIAQ3YAQ\nHoAQGIAgGYAgaoA\ngS4Aryjq6UGwAIB\n0gIkN2NjODI4OTM\ntZmY3Ni00NGY3LT\nk5NDYtMTc4NzRkY\nWVmMjU12AIF4AIB\n&sid=cf5495af8f\n5cb3c673bab33c0\n2ec18de&all_sr_\nblocks=10405215\n01_376719955_2_\n0_0;checkin=202\n3-08-08;checkou\nt=2023-08-10;de\nst_id=-111358;d\nest_type=city;d\nist=0;group_adu\nlts=2;group_chi\nldren=0;hapos=1\n;highlighted_bl\nocks=1040521501\n_376719955_2_0_\n0;hpos=1;matchi\nng_block_id=104\n0521501_3767199\n55_2_0_0;no_roo\nms=1;req_adults\n=2;req_children\n=0;room1=A%2CA;\nsb_price_type=t\notal;sr_order=p\nopularity;sr_pr\ni_blocks=104052\n1501_376719955_\n2_0_0__48240;sr\nepoch=168963439\n9;srpvid=9c58a0\nee99900595;type\n=total;ucfs=1&#\nhotelTmpl"}, {"username": "Monique Swanner", "comment_text": "We're currently at Hotel Berna in milan no crazy frills but we love it!"}, {"username": "Connie Wilson", "comment_text": "If you are heading to Paris by train, then Stresa on Lago Maggiore is on the route. Beautiful town with great hotels, shopping, ferries to the Borromean Islands."}, {"username": "Anne Griffin Andrews", "comment_text": "We’re heading the opposite way from Paris through Milan to see Bruce. We booked a boat trip to see the sights of Como the next day. Says the boat fits up to 5 if you want to join."}]}, {"id": "2194412714291140", "text": "I am not checking a bag for my trip to Italy in September, but I want to bring home wine, limoncello and olive oil. Any suggestions for best, cheapest way to do this. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2194412714291140/", "likes": 44, "comments": [{"username": "Tracy Wrinn Mcdermott", "comment_text": "Maybe purchase at a duty free shop at the airport?"}, {"username": "Bob Lampo", "comment_text": "I’ve had wineries ship my stuff back. They have great packing materials and the shipping co is responsible. It runs about 6-10 per bottle. Cheaper being a full 12 case on a per bottle basis.\nSince usually buy 12-24 per trip it would be hard to check.\nOil and limoncello you’ll have to check since the liquid can’t go into a carryon. Unless you buy it at duty free and the airport or get the merchant to ship to you."}, {"username": "Pong Ac Ai", "comment_text": "In the FCO airport before you are going home the duty free bag is sealed and I do believe they won’t question that as soon as you arrive in the US as long as you keep it sealed"}, {"username": "Jodie Peck", "comment_text": "Ship your clothing home and pack the gifts in your suitcase. Super easy to send just clothing. My daughter sent two large bags and it was about $80. I’m doing that next time!!"}, {"username": "Kateryna Fedyushkina", "comment_text": "Most of the Italian wine shops deliver everything you need"}, {"username": "Kasia Sudol", "comment_text": "Duty free!"}, {"username": "Carlenne Brown Jarvis", "comment_text": "While not the cheapest, we always have the shops ship our wines and such back. We only do carry-on luggage anymore, and that works best for us."}, {"username": "Nathan Onfrichuk", "comment_text": "Would it not be cheaper to just pack it in your suitcase and check your bag?"}, {"username": "Sandra Desmond", "comment_text": "Could you check in 10 kg not to carry on iv checked in 20 kg bag as I’m getting all those aswell"}, {"username": "Brian Yonks", "comment_text": "Mail it at Mailboxes Etc."}, {"username": "Jennifer Belvick Link", "comment_text": "I am going in September and plan on bringing a carry-on for clothing. Our airfare includes a free checked bag. So I am going to check an empty suitcase on the way there and bring all my goodies home in it on the way back.￼"}, {"username": "Bev Ellul", "comment_text": "We have everything shipped by the merchant. It arrives at your door, no hassles at customs and you don’t have to lug it around. Happy husband too as he would be the one carrying it!"}, {"username": "Giovanni Pianigiani", "comment_text": "If you're flying from FCO T1 or MXP T1 you can take liquids in your hand luggage wit6no restrictions. Of course you need to check the stopover location if your flight is not direct\nhttps://\nwww.milanolinate\n-airport.com/\nen/\npassenger-guide/\nnews/\nsmart-security"}, {"username": "Rose Wolschlager Hinman", "comment_text": "I had the winery ship my wine and they also make an olive oil I liked￼ so they shipped that also"}, {"username": "Rose Wolschlager Hinman", "comment_text": "I opted for a check in bag because I knew I was bringing ￼some wine and olive oils back, and other items. which I bought at the end of the trip. But I also had wine and olive oil shipped home from various wineries."}, {"username": "Lisa Martinson", "comment_text": "Ship or check a bag!"}, {"username": "Chanda Davis", "comment_text": "I shipped mine from the store to home"}, {"username": "Janet Messanelli Bozzone", "comment_text": "Visit tenuta torciana winery and they will ship the wines home for you free of charge with a minimum purchase. Buy limoncello at the duty-free shop at the airport. 🙃"}, {"username": "Debi Lubiani DeLoney", "comment_text": "You can always buy a piece of inexpensive luggage while there for souvenirs and check that bag on the way home!"}, {"username": "Petra Meier", "comment_text": "Take some clothing that you like, but don’t want to wear next summer again and that makes room in your luggage for souvenirs and then on the way back, check the bag in. 😂"}, {"username": "Mary Nadal", "comment_text": "My dad’s wife once bought a couple bottles of grappa on our trip and packed them in the suitcase for the return home. One broke and everything in there was soaked in grappa. Pretty sure that suitcase *still* smells like it.\n\nI would recommend having the store ship it for you, or at a minimum make sure it’s sealed in a watertight bag."}, {"username": "Anna Treviño O'Campo", "comment_text": "If you buy in the states try this store in Dallas. They even ship to New York and New York is very familiar with Jimmy's in Dallas.\n\nhttps://g.co/\nkgs/ZLRg24"}, {"username": "Anna Treviño O'Campo", "comment_text": "Anna Treviño O'Campo"}, {"username": "Anna Treviño O'Campo", "comment_text": "Anna Treviño O'Campo"}, {"username": "Sigrid Cormier", "comment_text": "Buy at the duty free in Rome? Airport they put the bottles into a sealed bag and give you proper receipts you can take on plane as hand luggage.\nThe only restriction is how much Liquid your allowed to bring into the USA. You’ll need to check it out.\nIf your travelling with your spouse he too will be allowed to bring liquid from duty free. So you could combine."}, {"username": "Jenny Payne", "comment_text": "Why not have it sent home by the shop? Can’t you buy it wherever you live? We have an Italian store in Perth Australia that you can get it all. I’m sure customs won’t let you bring it 🌻"}, {"username": "Megan Leigh", "comment_text": "Pack an empty foldable duffle in your suitcase. Use that as your carry on and check your suitcase on your flight home."}, {"username": "Jerry Lyubelsky", "comment_text": "Best and prob lay also cheapest might be at the duty free shop at the airport"}, {"username": "Suzanne Mills", "comment_text": "Have the purveyors ship it!"}, {"username": "Lucrezia Folger", "comment_text": "Buy a bag in Italy(flea market) check it on. Buy on Amazon padded wine bags to put wine, oil and limoncello in. I always bring extra bubble wrap."}, {"username": "Allison Mir", "comment_text": "Ship it by courier. No other way unless you check a bag"}]}, {"id": "2194416160957462", "text": "Hi all!\nSo we are taking a driving trip through northern Italy. I really want to stop in Venice for a couple days, but how does that work with a car? I’d just like to have logistics worked out beforehand….\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2194416160957462/", "likes": 6, "comments": [{"username": "Matthew Gramitt", "comment_text": "You park on the mainland and take a boat over. Not too pricey."}, {"username": "Grace Scinto", "comment_text": "We stayed in Mestre and caught the train in."}, {"username": "Paola Bersano", "comment_text": "You can leave your car at Tronchetto parking, on the main land. Then you can take a vaporetto o metromover and then walk to your hotel. Very convenient. Please consider sleeping in Venice, not in Mestre or surroundings, since by night Venice is pure magic."}, {"username": "Renae Larcus", "comment_text": "There is a huge car park right next to the train station."}, {"username": "David Silverstone", "comment_text": "We parked at Garage Piazzale Roma which is about as close to the city centre as you can get. It's also where many of the rental car companies are. From there it's a very short walk to the Vaporetto and water taxis etc."}, {"username": "Pamela Dorigo", "comment_text": "Hi, maybe you can book a hotel in Mogliano Veneto or also in Treviso and then go by train to Venice, you take only 20 or 30 minutes and you have trains around every 30 minutes. Treviso worth a stop also for a walk specially in the evening. it's called like a small Venice also..🙂"}, {"username": "Glenn Todd Webb", "comment_text": "Parking lot"}, {"username": "Sharon Reynolds", "comment_text": "We are just back and the tronchetti parking is very easy to park and find. Short walk round the corner to where the boats are. We got a private boat back to the car down the grand canal and the kids loved it!"}]}, {"id": "2194423567623388", "text": "#sardinia #alghero\nHi everyone!\nI'm struggling a bit to organize a weekend in Sardinia, solo. I would probably have a room in Alghero (arrive late in the evening, anyways I wanted to be in Stintino) and I'd love to see La Pelosa beach,but unfortunately renting a car is probably out of my budget..\nDoes anyone have experience with public transport? Google shows 2 bus lines to that direction but I don't know if these are organized and reliable in the island. Or any recommendations?\nThanks!", "link": "facebook.com/groups/1373361046396315/permalink/2194423567623388/", "likes": 3, "comments": [{"username": "Rhonda Dinzey", "comment_text": "I recently took a bus from Alghero to Stintino, it stops in La pelosa. Here’s the timetable."}, {"username": "Rhonda Dinzey", "comment_text": "It is quite cheap as well. €3.70 or something like this."}, {"username": "Kay Rendall", "comment_text": "Alghero itself is lovely to wander round. There r buses to nearby beaches, about 10 mins check at the tourist info or ticket office at bus stop, just outside the city walls"}]}, {"id": "2194424797623265", "text": "Any feedback from flying Norse Airways? Going from JFK to FCO. Trying to do COO. Any tips welcome!", "link": "facebook.com/groups/1373361046396315/permalink/2194424797623265/", "likes": 2, "comments": [{"username": "Danielle Johnston", "comment_text": "I just flew Norse Thursday. It was great. Not one bad comment about them. We bid to get first class seats for $300 more and got them. But coach was nice as well. I would definitely fly them again and I fly often."}, {"username": "Miyuki Kanno Paul", "comment_text": "What is “COO”??"}, {"username": "Becky Peters", "comment_text": "Taking that same flight tonight"}]}, {"id": "2194412694291142", "text": "Live la Dolce Vita fro your home! Explore one of the world’s most beautiful places: the Amalfi Coast and the three islands of the Gulf of Naples, Capri, Ischia and Procida!\nJoin us: आणखीhttps://nextstop-italy.com/virtual-tours/amalfi-coast/\n\n#positano #positanoview #positanocoast #positanoitaly #amalfi #amalficoast #amalfitancoast #amalficoastitaly #atrani #capri #bluegrotto #procida #ischia #ravello #ravelloitaly\n#virtual #italygram #italytrip #vacation #virtualworld #italytravel #vacationmood #VirtualTour", "link": "facebook.com/groups/1373361046396315/permalink/2194412694291142/", "likes": 81, "comments": []}, {"id": "2193667844365627", "text": "Has anybody gotten a tattoo done in Florence specifically? 🙂 My daughter is thinking about getting one at the end of our trip which will be in Florence and she would love a recommendation if anybody has one! Thank you. ♥️", "link": "facebook.com/groups/1373361046396315/permalink/2193667844365627/", "likes": 3, "comments": [{"username": "Carla Onofrio", "comment_text": "My husband and I did! We went to Florence Tattoo Studio. He was super nice and did a great job! Make an appt ahead of time. I contacted him through messenger."}, {"username": "Joe Waichulis", "comment_text": "Wonderful person filled with artist talent. Hopefully he's still in Florence. Him and his wife travel he's a hell of an artist 🎨. Look him up on Instagram. He works at a tattoo shop in Central Florence"}, {"username": "Sandra Shoffner", "comment_text": "Both my grandsons got them in June, 1 in Siena and 1 in Florence. I don't know the names but they had to make appointments."}, {"username": "Melissa Ropp", "comment_text": "Carla Henry ⁉️"}, {"username": "Alessia Zito", "comment_text": "Alessia Zito"}, {"username": "Sarah Elizabeth", "comment_text": "Sarah Elizabeth"}]}, {"id": "2194371557628589", "text": "We are hiring a car in Florence, then driving to Genoa via Lucca, and need to drop the hired car off near the cruise terminal before getting on our MSC cruise. Which car rental is the best to use for this?", "link": "facebook.com/groups/1373361046396315/permalink/2194371557628589/", "likes": 1, "comments": [{"username": "Keith Crossley", "comment_text": "I had to search to find a rental that met my parameters for pickup / dropoff (finding one vs \"best\"). Turns out Hertz worked for me."}]}, {"id": "2194405577625187", "text": "Where to go in Sardegna? Please share your favorites beaches and restaurants! Grazie!", "link": "facebook.com/groups/1373361046396315/permalink/2194405577625187/", "likes": 1, "comments": [{"username": "Francesca Russo", "comment_text": "Sardegna is whole beautiful. Generally the north is much more expensive than the rest of the island.\n\nAnyway here some beautiful beaches.\n\nSouth:\n- Porto Giunco\n- Cala Cipolla\n- Tueredda\n- Scoglio di Peppino\n- Mari Pintau\n- Costai Rei\n\nNorth:\n- Li Cossi\n- Porto Pollo\n- Tavolara\n- Mortorio\n- San Teodoro\n- La Maddalena\n- Porto Cervo\n- Costa Paradiso\n- Porto Torres"}, {"username": "Greta Pittana", "comment_text": "East coast: the whole Baunei area (cala mariolu, cala goloritzè, cala briala, Cala Luna, Cala sisine…. Some of These beaches are by Reservation or reachable by sea)"}]}, {"id": "2194358714296540", "text": "Which is the best way to get from Napole to Sorrento? And can I do Pompeya from Sorrento?", "link": "facebook.com/groups/1373361046396315/permalink/2194358714296540/", "likes": 2, "comments": [{"username": "Tanya Cini-Kirk", "comment_text": "We used Transferelax private drivers. They were fantastic!"}, {"username": "Ruth Hackert", "comment_text": "Ferry"}, {"username": "Ann-Louise Dooley", "comment_text": "We atre catching the Circumvesuviana\ntrain."}, {"username": "Giuseppe Placi", "comment_text": "I second... Transferelax stopping on the way to Sorrento"}, {"username": "Mo Dee", "comment_text": "We used Campania Express. Felt long and warm."}]}, {"id": "2194052184327193", "text": "Hi there. My husband and I are going to be in Zurich for a week in August 2024 for family wedding. (Leaving the 3 year old at home!) We have been before (my brother in law lives there) and would like to get away for 2-3 nights to Northern Italy. Looking at Turin but could easily be talking into something else. We would be traveling by train. Thank you!\n\nEdited to add - I was an au pair close to Sorrento after college so I don’t feel the need to do central or southern Italy for this quick visit. I never went to any of northern Italy!", "link": "facebook.com/groups/1373361046396315/permalink/2194052184327193/", "likes": 2, "comments": [{"username": "Agnese Arnó Ch-Ch", "comment_text": "Turin is great and very underestimated!"}, {"username": "Lyn Evans", "comment_text": "The Italian lakes are wonderful too. We did Stresa on Lake Maggiore after being in Lauterbrunnen via train. This trip we plan to head up to St Moritz area from Varenna on lake Como by train..so these are options you could also consider. Bergamo as well isn’t far from Milan."}]}, {"id": "2194121194320292", "text": "Hi all...we will be in Florence for 4 nights in October. Looking for recommendations for a pasta/pizza making course.\nAlso looking for day trip tours ( wine and food) to Tuscany...San Gimignano or any other recommendations. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2194121194320292/", "likes": 3, "comments": [{"username": "Ken Lerch", "comment_text": "Cook & Love With Luca (pizza & gelato)"}, {"username": "Nancy Kirby", "comment_text": "Keep two days for Florence at least"}, {"username": "Nicholas William Lowe", "comment_text": "I highly suggest “Antinori nel Chianti Classico” for a wine and food experience. The winery is amazing and the restaurant is great. The tours are great if you can book in time. I am going in August.\n\nhttps://\nwww.antinorichia\nnticlassico.it/"}, {"username": "Lisa Carter Kayton", "comment_text": "We did this one. I signed up through Air B&B. It was a great class with amazing views of Florence. Simone was the host and he was a great teacher."}, {"username": "Maureen McCall Bradley", "comment_text": "We did the pizza and gelato making class with www.walkaboutfl\norence.com\nWe also did the tour of San Gimignano, Sienna, Pisa with wine tasting and lunch.\nWe booked direct."}, {"username": "Debi Wood Swan", "comment_text": "Visit Villa iL Leccio! ❤️ we had an amazing meal there last night!"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2194358067629938", "text": "Has anyone stayed at Hotel Marcantonio in Rome with any insights on your stay ? I know it’s going to be super hot was hoping they have air conditioning and clean rooms.", "link": "facebook.com/groups/1373361046396315/permalink/2194358067629938/", "likes": 0, "comments": []}, {"id": "2194152684317143", "text": "Family of 5 adults planning a trip june 2024. What are your thoughts and opinions on our rough itinerary 🛫\n(Fly into ￼Rome from Perth Australia) Rome 4 nights, Venice 3 nights, Lake como 3 nights, Milan 2 nights, cinque Terre 3 nights, Lucca 6 nights, Napples (Sorrento) 5 nights. 🏖️", "link": "facebook.com/groups/1373361046396315/permalink/2194152684317143/", "likes": 8, "comments": [{"username": "Letty Veronica", "comment_text": "Unless you are flying out of Naples or Rome, it would be more beneficial to do Naples/Rome/\nSorrento (not in that order) then travel north and fly out of Venice or Milan"}, {"username": "Nancy Koehler Barboni", "comment_text": "I suggest only 1 or 2 nights in Venice. Stay in Bellagio on Lake Como for 2 nights. 2 nights in Lucca! Stay in village #2 in Cinque Terra. 6 nights on the Almalfi Coast. Make Sorrento your base and take day trips from there. Naples is known for its margarita pizza. I would not stay overnight in Naples unless you have a very specific reason. I would skip Milan and fly home from Rome."}, {"username": "Laura Piccinini", "comment_text": "All those nighta at Lucca Is too much! You can switch tò Siena and Tuscany area!"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Looks fabulous! Enjoy!"}, {"username": "Jenny Payne", "comment_text": "I’m from Perth and go every year to Italy , myself I would as I show friends around. I try not to back track. Just be aware the small towns often close Saturday afternoons if it is not peak season . Rome I stay in a 3 star hotel near the termini called Hotel Nord Nuova & in Florence love this area called Santo Spirito in airb&b about a 15 minute walk into city but so much to see cafe,shops,bars\nalong the way near Pitti place over Ponto Vecchio. I go either February (winter) & October still beautiful weather most times enjoy 🌻"}, {"username": "Zurey Reyes", "comment_text": "Take carry on bags only!!! Trafic, crowds and very difficult to move from point A to B\nJust came back from Europe"}, {"username": "Tricia Teys", "comment_text": "I would skip Milan and shorten Naples and use those days for Tuscany region 💜 Italy is beautiful...enj\noy"}, {"username": "Suzanne Mills", "comment_text": "Garda lake not Como. Skip Milan. Lucca does NOT need 6 nights, one is fine. Add Florence and fewer days in Sorrento."}, {"username": "Mary Anne", "comment_text": "We are Australian and just home after a month in Italy. We went to Rome for three nights, then down to Sorrento by train and private car from Naples, back to Naples from Sorrento by ferry, stayed in Naples for five nights (loved Naples !) The train goes from Naples to Venice (a bit over five hours), then make your way back to Rome via Como etc or make your way to Venice then fly back to connect to your flight home.\nSo many beautiful day trips into Tuscany from Lucca! We stayed in a tiny village 40 minutes from Lucca for ten days and it wasn’t long enough."}, {"username": "Bev Madill", "comment_text": "I think that sounds fine but I'd try to add another night in the Cinque Terre as you really need a full day to see the villages (not sure if you're doing any walks), another day to venture to Portofino and another day to just wander around. People have differing opinions about itineraries and where to stay and when I read comments I often think they're not factoring in travel time and potential delays (just my opinion). I'd suggest Varenna on Lake Como as it's easy to get to/from and is a good base. Plenty of people say skip Milan and if that means spending more time in the CT you could take it off your itinerary but it's a nice city with some great attractions. If pressed for time you could maybe have one night there (depending on arrival time). I haven't been to Naples so can't comment but 5 nights in Sorrento will give you plenty of time to explore the Amalfi Coast/Capri. Many are saying too many nights in Lucca but it would be a good base to explore Tuscany if you have a car. I've been to Tuscany many times and there's so many small towns to spend time in. Enjoy your planning."}, {"username": "Julia Muller", "comment_text": "Having just returned from our latest adventure, and having spent two nights in Milan to fly home to Melbourne, I would suggest skipping Milan altogether. I felt we wasted two days 🥺\nWe had 3nts in Venice, which I felt was perfect, 4nts in Bellagio (Lake Como) also perfect, and then headed down into a Puglia for 8nts. We have stayed in CT a few times - my #1 fave🙌🥰 - so keep that (I recommend Vernazza as the prettiest, but if you want a bigger beach stay in Monterosso). That’s a lot of nights in Lucca… I would be more inclined to stay in Firenze and do a day trip to Lucca, even an overnight (it is very pretty at night), and then you can do another day trip to another Tuscan town during that time. I assume you’re not staying in Naples, just passing through to Sorrento? Make sure you do a day trip to Capri, and if the weather allows visit the Blue Grotto!"}, {"username": "Leah Naylor", "comment_text": "Looks like a great trip! I think way too much time in Lucca and would consider Florence or Siena as your base while you explore Tuscany. Or Puglia another region to consider. Possibly look into agriturismos. Sorrento makes sense as long as you are doing day trips to Amalfi and I would skip Naples. Same with Milan. It’s a business city and not one to linger with so many other beautiful destinations to see."}, {"username": "Karen Espinoza", "comment_text": "Perfect itinerary\nJust add one more day in Cinque Terre 😊"}, {"username": "Lori Greco", "comment_text": "I'm from Perth too and also agree that you should skip Milan."}, {"username": "Manuela Bonazzi", "comment_text": "Lucca 6 notti è troppo e forse anche Napoli 5 notti a meno che non decidiate di fare anche un po' di mare."}, {"username": "Alexandra A Welker", "comment_text": "Add another night for CT, take 3-4 nights out of Lucca and spend it in Florence, or make Florence your base then visit Lucca and Bologna."}, {"username": "Donna Dougherty", "comment_text": "3 nights in Venice is a lot."}, {"username": "Rosemary Barbetta", "comment_text": "Fly into Venice and out of Rome.\nVenice, Verona, Milan, Como, Florence, Cinque Terre, Naples, Sorrento and Rome……all by train."}, {"username": "Donna Mangone", "comment_text": "Lake Maggiore is beautiful."}, {"username": "Krissy DaRusso", "comment_text": "Venice maybe 2 nights? 6 nights in Lucca is a lot (and I love Lucca). Maybe add that time to Naples or include Florence?"}, {"username": "Laura DeCicco", "comment_text": "Take 4 nights from Lucca, add one more to CT and stop in Bologna for 2-3 nights."}, {"username": "Sande Ricci", "comment_text": "Don't skip Milan. It's a beautiful city. Go to the Duomo and get tickets as early as you can to see the Last Supper. It is like Florence or some other towns? No. It's a metropolitan city with charms all its own."}, {"username": "Phyllis Snyder", "comment_text": "Milan and Naples I’d rethink- spend more time on your other stays."}]}, {"id": "2194220937643651", "text": "Hey there is anybody that is going to the FCO airport tonight? Around 3-4am ? I would happy to join", "link": "facebook.com/groups/1373361046396315/permalink/2194220937643651/", "likes": 0, "comments": []}, {"id": "2194344064298005", "text": "Evening 🙂 I’m looking at travelling to Italy (most likely Verona or Milan), and it looks like the only time I’ll be able to go is the first week of October. I’m concerned the weather isn’t going to be great - could anyone please tell me what the weather is like that time of year (especially in Verona/Milan, but also Italy generally)? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2194344064298005/", "likes": 13, "comments": [{"username": "Staci Wilson Shattler", "comment_text": "It will likely be perfect."}, {"username": "Angela Gilmore", "comment_text": "It's still a good and warm weather. It depends but sometimes t-shirts are needed :)"}, {"username": "Alessandro Battxi", "comment_text": "In the south, will be great. North depends if you are lucky."}, {"username": "Jules Earl-Rossiter", "comment_text": "I always go to Italy the first week of October and the weather is excellent... definitely Tee shirt weather.....🙃"}, {"username": "Rita Kanten", "comment_text": "October is great! It will still be warm but not stifling like it is now. Enjoy!"}, {"username": "Chic Ciccia", "comment_text": "October will be a great time 🍂🍁🌰"}, {"username": "Pietro Adami", "comment_text": "Unpredictable at this time but likely it will be good and if in Verona you might also enjoy the Garda Lake for a daily or 2-3 days tour (rent a car, and drive there, it will be very nice)"}, {"username": "Jenny Payne", "comment_text": "Last year was beautiful, nice and warm so I’m going again this October, going into November so will take a raincoat & layer if necessary 🌻"}, {"username": "Renae Larcus", "comment_text": "October weather is wonderful!"}, {"username": "निनावी सहभागी", "comment_text": "Thank you everyone for your help!"}, {"username": "Bill Bowler", "comment_text": "Beautiful time of year."}, {"username": "Jayne Dawson Meyer", "comment_text": "Beautiful. Temp was perfeft & less crowds."}, {"username": "Patti Farrell", "comment_text": "A lot cooler and more pleasant than the 120 degree weather they have in July and August"}, {"username": "Robin Burrell", "comment_text": "The weather should be perfect, past the summer heat but rains don’t generally start until mid to 3rd week in October."}, {"username": "Liz Ariar", "comment_text": "I was in Milan and Verona November 2022 and it was warm, 25 degrees C for a week"}, {"username": "Suzanne Mills", "comment_text": "It will be fine, but a bit rainy. You’ll be fine! Who cares? Enjoy!"}, {"username": "Roland Trego", "comment_text": "It may rain, but it won't be too chilly."}, {"username": "Esther Wildenberg", "comment_text": "The weather is beautiful in October"}, {"username": "Aurélie Esposito", "comment_text": "I went to Milan at the beginning of September and the weather was great, around 25 degrees C. You should go to Lake Como from Milan, you can take the train, the travel is only 40 mn and it is amazing"}, {"username": "Miyuki Kanno Paul", "comment_text": "It’s hit or miss. Bring an umbrella! We always pack two. Weather is a part of Italian holidays😉"}, {"username": "Sara Gilardi", "comment_text": "A matter of luck, but probably still pleasantly warm"}, {"username": "Phyllis Snyder", "comment_text": "October is perfect time!"}]}, {"id": "2194343127631432", "text": "Just did an unforgettable hot air balloon experience today!", "link": "facebook.com/groups/1373361046396315/permalink/2194343127631432/", "likes": 5, "comments": [{"username": "Kelly Page", "comment_text": "Where? I have always wanted to do that!"}, {"username": "Elena Dompa", "comment_text": "Σοφία Ασβεστά"}, {"username": "Nicky Reid", "comment_text": "Shaun Reid Darran Reid Phil Lindsay this would be awesome!!!"}, {"username": "Regina Phillips", "comment_text": "We will be doing the same thing next week. I’m packing now and wondering what to wear. What is the temperature like in flight?"}]}, {"id": "2194345327631212", "text": "Will be in Sorrento in august and looking for a private transfer from Naples train station. Any recommendations would be greatly appreciated.", "link": "facebook.com/groups/1373361046396315/permalink/2194345327631212/", "likes": 2, "comments": [{"username": "Sandy Radican Shikaly", "comment_text": "Amalfi Coast Transfers"}, {"username": "Tanya Cini-Kirk", "comment_text": "We just used Transferelax and they were great!"}, {"username": "Cynthia McDonald", "comment_text": "I’d just do the ferry. Very enjoyable."}, {"username": "Darlene Dommermuth", "comment_text": "Fabrizio is the owner of All Around Italy. He is wonderful !\n\n+39 334 3346131"}, {"username": "Carmela Siniscalchi Frattellone", "comment_text": "If you’re staying at a hotel have them call for you."}, {"username": "Mary Anne", "comment_text": "Guemar travel"}, {"username": "Christine Golia Brigida", "comment_text": "Amalfidrive4you"}, {"username": "Anita Downey", "comment_text": "Transferelax were the cheapest we found and they were great"}, {"username": "Linda Metallo Casey", "comment_text": "Mena Forino with Amalfi Coast Transfers. She’s the best"}, {"username": "Nancy Fricke Corsi", "comment_text": "Sorrento Transfers"}, {"username": "Sharyn Delbridge", "comment_text": "We asked the accom host in Sorrento and they came and picked us up from Naples."}, {"username": "Giuseppe Placi", "comment_text": "Transferelax\nGuemar\nSorrentocars"}, {"username": "Debbie Lyons", "comment_text": "We have recently used Nico Travelling for transfers to and from Naples train station. Excellent service"}, {"username": "Nicole Bellato", "comment_text": "We have arranged it through our hotel in Sorrento."}, {"username": "Raf Gervasio", "comment_text": "Get the train to Sorrento"}, {"username": "Frankie Rizzo", "comment_text": "Use Francesco many times over the last 5 years"}]}, {"id": "2194346124297799", "text": "Hi me and my 3 friends are coming to Pisa at the end of this week and staying for 3 days. Any recommendations on where to visit? Have looked at going to Livorno and Viareggio. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2194346124297799/", "likes": 1, "comments": [{"username": "Jess Rothberg", "comment_text": "Florence 1 hour by train there is so much to do there, Lucca has an amazing pizza restaurant on the walls"}, {"username": "Friedemann Diederichs", "comment_text": "Go to Lucca instead. Viareggio and Livorno are just crowded with beach tourists right now. Not a lot to see. Lucca will blow you away. Try to lunch at the ristorante on the main plaza."}, {"username": "Tamy Kennedy", "comment_text": "My sister & I are going yo Lucca in Sept & cannot wait!!!"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "If you search I wrote a post about what to see in Pisa!\nA day trip to Lucca and to Florence are also good ideas!"}, {"username": "Miyuki Kanno Paul", "comment_text": "Carrara Marble quarry and have lunch in Colonnata"}]}, {"id": "2194347200964358", "text": "Hello we are planning a trip for next year. With the extreme summer heat as a huge factor this year what month would you suggest we plan to travel?", "link": "facebook.com/groups/1373361046396315/permalink/2194347200964358/", "likes": 0, "comments": [{"username": "Shana Woodfield", "comment_text": "April or October!"}, {"username": "Liliana Voicu", "comment_text": "I went to Milan in May and it was alright, nothing crazy"}, {"username": "Ptt Hotay", "comment_text": "May June , Sep or Oct"}, {"username": "Stacy Derouin", "comment_text": "We went in early June a few years ago-it was beautiful weather. While the later you get in summer, if course the warmer it gets, this year is unprecedented heat, so it's hard to predict what it's going to be like next year at the same time."}, {"username": "Sharon Williams Sellers", "comment_text": "I’ve been in May and September and they were equally awesome. Summers are so hot in Italy is so crowded but things thin out a little bit when summer is over. The weather was perfect."}]}, {"id": "2194353160963762", "text": "Help!\nTickets to Pompei , Is It Better get them online or when you there ?\nExperiences ? Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2194353160963762/", "likes": 2, "comments": [{"username": "Sabrina Tjoelker", "comment_text": "Following"}, {"username": "Jason Craven", "comment_text": "It didn't matter when I was there. The ruins are huge and there was no line. If you want to book a tour guide it'd be better to do that online."}, {"username": "Cat Furness", "comment_text": "I just turned up and bought them at the gate, very easy and quick.\nNote: don’t get sucked in to buying from the people at Pompeii Scavi station, they are cheaper at the entrance."}, {"username": "Mercedes Rotolo", "comment_text": "I pre- purchased all my tickets For every event or special landmark’s in New York through my agent . All the landmarks like , the colosseum, Tower of Pisa , Vatican , Pompeii, even to the opera house . We skipped all the lines because of purchasing them here instead of in Italy . Lines are extremely long and if you go in August like we did - extremely hot !!!! Enjoy !! You will have a lovely time no matter how you get your tickets. 😊"}, {"username": "Jason Hobel", "comment_text": "I bought them when we arrived at the gate. All other sites like the Colosseum I purchased well in advance"}, {"username": "Valentina Frater", "comment_text": "Online and go with tourguide.\nI would recommend 1day trip with tourguide: Pompei and Vesuvio"}, {"username": "David Henry", "comment_text": "First Sunday each month is free entry 😎"}, {"username": "Sharon Williams Sellers", "comment_text": "I’ve been to Pompeii three times. It is one is one of the most awesome places I’ve ever been. I can’t remember for sure, but I think we bought our tickets ahead of time. It’s always better to do that."}, {"username": "Paul Anderson", "comment_text": "Buy them at the door. The ticket office on the south side of Pompey near the train and the amphitheater has very short lines as in on or two people. You can also find guides there if you like. Many of the famous houses have guards at the locked doors for a few euros they will let you in. Also the famous house of the mysteries is out side of town north on the old Roman beach road don’t miss it."}]}, {"id": "2194356867630058", "text": "Can you buy a SIM card in Milan Airport? Thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2194356867630058/", "likes": 4, "comments": [{"username": "Dean Pecorari", "comment_text": "I got mine there last year but the place was closed when I went this year due to after hours so depends on the time you arrive"}, {"username": "Eric Parks", "comment_text": "Yes, there is a desk in the baggage claim area. I bought mine in town though."}, {"username": "Saji Yacoub", "comment_text": "You do not need a sim card, u can use this application, airalo.. 😉"}, {"username": "Goker Erdi", "comment_text": "Dont buy expensive"}]}, {"id": "2194359000963178", "text": "Ciao a tutti!\n\nWe are in Italy right now and I had a lot of requests in a previous post for info on our accommodation. To ensure my response doesn’t get lost (there were loads of comments) I thought I’d drop it in a new post.\n\nHope this helps.\n\nBTW, it’s hot 🥵 (and before the comments start, we knew exactly what we were coming into) our current Airbnb had a pool 🏊🏻‍♀️ 👌🏻\n\n*****************************************\nHi All, to everyone that asked for my recommendation for accommodation I will just post here. There were so many requests so hope that is ok.\n\nVenice - we stayed on the island. The Airbnb was beautiful and on the canal. We had to catch a waterbus across to the mainland, which was no problem but it was €9.50 each way. The villa had one double bedroom and 2 singles were in the living room, along with chairs and a table - it worked ok. There was one bathroom. It was a short walk to a co-op and restaurants. If you want a quiet stay, this is the place. Very clean and host was very helpful. Waterbus also takes you back to the train Termini. Eating was reasonably priced.\n\nCalle delle erbe\nGiudecca, Venice, 30133, Italy\n\nFlorence - we stayed at Plus Florence which is a hostel but we had a private room with 4 single beds and a huge private ensuite. It was about a 10 min walk to the main Termini. The buffet breakfast is cheap. Very close to the markets. A bit of a walk to the pointe vecchio but we stopped along the way for a drink etc. The pool gets busy and very popular with the 20ish year olds but they were no bother. We are a family of 4 and there were other families there.\n\nPlus Florence\nVia Santa Caterina D'Alessandria 15, Florence, 50129, Italy\n\nRome - we stayed in the Vatican area which was not our initial choice but our original accommodation was cancelled on us so we were left with whatever was available on our budget. This apartment is immaculate! 3 double rooms all with ensuites. Great air con. Short walk to the metro which made it very easy to get around. Many restaurants around the area but didn’t offer a great deal if you’re looking to shop. There were markets nearby which offered some cheap clothing. The apartment exceeded our expectations. Host was very easy to deal with.\n\nVatican Townhouse\nViale Giulio Cesare, Vaticano Prati , Rome, 00192, Italy\n\nHope that helps. Let me know if you have any other questions ☺️", "link": "facebook.com/groups/1373361046396315/permalink/2194359000963178/", "likes": 26, "comments": [{"username": "Debbie Grant", "comment_text": "Sent you a pm"}, {"username": "Katherine AliNuñez", "comment_text": "Thanks a lot!"}]}, {"id": "2194363880962690", "text": "Hi everyone! Looking for input: We are headed to Italy (flying in and out of Milan specifically) for the F1 race in late august/early September. We will arrive very early on a Wednesday morning and leave the following Tuesday morning. The race activities are in Monza on Friday, Saturday, and Sunday.\n\nMy question - where should we travel inbetween?आणखी We have no problem hopping on trains to different destinations. We will have Wednesday and Thursday open (day trips or an overnight elsewhere) and then that following Monday.\n\nWe’ve been to Rome and Naples before.\nThinking Venice overnight the first part and then a day trip to lake como after the race? Bonus if you have any tips for the F1 festivities\n\nThanks!", "link": "facebook.com/groups/1373361046396315/permalink/2194363880962690/", "likes": 1, "comments": [{"username": "Glenn Todd Webb", "comment_text": "Lake Maggiore. Visit Stressa and Palazzo Borromeo and palazzo madre on the lake.\nOr lake Como to see villa Balbianello and villa Carlotta."}, {"username": "Patricia Quirk", "comment_text": "Lake Como"}, {"username": "Shana Woodfield", "comment_text": "Lake Como."}, {"username": "Helene Wright", "comment_text": "Menaggio"}, {"username": "Megan Knight", "comment_text": "We were just on lake como and our friends went to lake maggiore. We wished we would have gone there instead! Less crowded and less touristy. 😊 both were beautiful!"}, {"username": "Chris Vilsack", "comment_text": "Lago di Como\nLado di Garda"}, {"username": "Sara Butcher", "comment_text": "I flew into Milan a week before my tour so I could go to the Italian F1 GP! I went to Venice for a few days. Easy by train and about 2.5 hours.\nI only went on race day and I left my hotel at 9am and arrived at my seat at the track at 2pm! ❤️🇮🇹🇦🇺"}, {"username": "Cynthia McDonald", "comment_text": "There’s plenty to do in Milan. Canal area (navigli), duomo/\ngalleria. Or an hour to Verona and spend 2 days. So much there!"}, {"username": "Chiara Bernasconi", "comment_text": "bergamo is a great day trip from monza"}]}, {"id": "2194363044296107", "text": "I need to find a way to get from Messina port to Taormina for a 10am cooking class. I poured over the train schedules and it doesn’t look possible, since I won’t get off the ship until about 7:30 or 8.\nI tried to find a car service or taxi without luck. Will there be taxis outside the ship? Anybody used a car service? Help appreciated.", "link": "facebook.com/groups/1373361046396315/permalink/2194363044296107/", "likes": 1, "comments": [{"username": "Eleni Koi", "comment_text": "You will find taxis available on arrival or you can check the transfer companies at Taormina. They can arrange the pickup for you.\nI also have a feeling that the people organizing your cooking class should be able to assist you on the matter as well. They are all very helpful according to my experience for the last 20++ years"}]}, {"id": "2194366484295763", "text": "So disappointed in this Hotel far from Grand\nThis is what $1000 AU gets you a night ...air conditioning is poor stuffy and tiny ..\nWe have stayed in other parts if Italy and our accommodation has been delightful this is a no go for the money ...be warned.", "link": "facebook.com/groups/1373361046396315/permalink/2194366484295763/", "likes": 67, "comments": [{"username": "Lane West", "comment_text": "Please tell me 1000 AU is like…5 bucks American…"}, {"username": "Tania Labrosciano", "comment_text": "Not okay!!! This wasn’t our experience with room size or accommodations.\nWe just stayed there 2 weeks ago. However, the AC was definitely not great. Definitely complain!!"}, {"username": "Laurie Chaisson Carlo", "comment_text": "There's something to be said for Marriotts, Hyatts and Hilton's. Some might be soso but they usually have standards that are kept.... Easier customer service and great locations... just saying😉💁‍♀️"}, {"username": "Maria Musumeci", "comment_text": "Oh such a bummer!!! Yes I agree, paying $1000aud, you'd expect more. We paid $1000aud per night for our Sorrento hotel (quadruple room) & we had a huge balcony, 2x queen size beds, it was beautiful. Although a small room & bathroom, it was very clean, and the large balcony & amazing views made up for it. I remember sleeping the opposite way round (feet at headboard) so I could sleep watching the Sorrento views through the glass double doors that led onto balcony!! Aaaah the memories!"}, {"username": "Friedemann Diederichs", "comment_text": "Please read reviews on multiple sites before you book. Read only the bad reviews. Best tactic to avoid shitholes like this one."}, {"username": "Nola Bostridge", "comment_text": "Wow that’s shocking !! I’ve always stayed at beautiful places both in Sorrento and Positano and never had that cost or issues. You should definitely report your experience not only to the hotel but on trip advisor as well. So sorry you had this happen"}, {"username": "Shauna Bloom", "comment_text": "Same at Hotel Borromeo. They have no balcony and advertise having. Won't give money back"}, {"username": "Laurie Chaisson Carlo", "comment_text": "Geez, take down your post already... It's too argumentative and nasty! And where are the people ahead of this site? Aren't you supposed to be vetting some of these people and their nasty comments? ￼"}, {"username": "Emma Cropper", "comment_text": "This is terrible but one of the problems for us Aussies is that’s only about 600 euros. I would be soooo disappointed too. You would feel like it shouldn’t be more than 100 euros a night. Everything just seems so expensive as our dollar is poor"}, {"username": "Skye Walford Scomazzon", "comment_text": "We just spent a month in France\nWe felt many times that we were getting ripped off. Companies just Charging far more than usual in compensation of covid ( although, everyone has done it tough, I feel this should no longer be the excuse) it just leaves a negative experience that’s all"}, {"username": "Susan Poric", "comment_text": "This is why I won’t be going to Amalfi and going to Puglia instead. This is appalling for the price!!!!"}, {"username": "Laurie Armstrong", "comment_text": "OMG! I booked here in October!!!! Now I’m nervous 😬"}, {"username": "Jennifer Gadaleta", "comment_text": "Just spread the word, they will get the message"}, {"username": "Cee Esperance", "comment_text": "$1,000 Australian dollar converts to approx. $680. USD?\n$680. USD a night for this room is waaaaaay too much. This looks like a cheap motel-grade room."}, {"username": "Yuko Y Smith", "comment_text": "AU$1000 is us$650. Still very expensive for this room.\nIs Cancun all inclusive is better than Italian resort?"}, {"username": "Patty Omodt", "comment_text": "I always stay in convents or youth hostel’s. I’m ever dissatisfied.\nConvents are the best ♥️"}, {"username": "Julia Muller", "comment_text": "Yikes - that’s a royal ripoff, not a grand hotel!!! 🙈"}, {"username": "Cinzia Wong", "comment_text": "I just looked up this hotel. Wow 4.5 stars. How is that possible?\n\nOne red flag in my opinion is when an air B&B or hotel shows you more pictures of the outside or of the surrounding areas than they do of their different rooms."}, {"username": "Kylie Hall", "comment_text": "Think I’d feel the same! In fact most Aussies would support your argument and back you… try not to let it spoilt your trip if you can’t find an alternative x\n\nTo the others - Saucer of milk anyone? 😆"}, {"username": "Michaela Andrew", "comment_text": "Always look so much better in photos."}, {"username": "Reni Henry", "comment_text": "A night or a few days is it an Airbnb"}, {"username": "June Callahan Kabachus", "comment_text": "June Callahan Kabachus"}, {"username": "June Callahan Kabachus", "comment_text": "June Callahan Kabachus"}, {"username": "June Callahan Kabachus", "comment_text": "Wow so deceiving"}, {"username": "Brittany Tumulty", "comment_text": "Can you post a better picture or a video?"}, {"username": "Sharon Schwartz", "comment_text": "We have had tile floors in Italy before even at more expensive hotels. Its an Italian thing… I think the tiles are pretty!"}, {"username": "Dragan Latincic", "comment_text": "oh no, damnnn… who booked it?"}, {"username": "Lizzie Packer", "comment_text": "That is a lot of money for a room like that! Especially when it doesn't look like the photos on the booking site. I suggest that you put your review on TripAdvisor and on Google."}, {"username": "Layla Maryam Razavi", "comment_text": "This isn’t the full room right? That’s just the roll away cot and there is a bigger bed right? Italy tends not to have great AC. Wouldn’t rely on it. Esp south of Napoli.\n\nIf you’re unhappy you can always try leaving a bad review asap to see if they upgrade your room. Or bribe them for an upgrade."}, {"username": "Julie Can", "comment_text": "Carolyn Hassarati thanks for posting and informing others of your experience. Don’t worry about the rude, disrespectful know it alls ready to shut people down given any opportunity. Hope your trip gets better."}, {"username": "Brooke Oster", "comment_text": "Thanks for the review!"}, {"username": "Kari Cooper", "comment_text": "I can only assume the prices are increased because it's summer and they know it'll book,whereas it's probably suuuuuuuper cheap any other time.\nSo sucky you're dealing with that."}, {"username": "Jiang Yuyu", "comment_text": "Usually their basic room cost around $500/ night in summer . Your price seems much higher , did you book through an agency ?"}, {"username": "Susan Waltz Dean", "comment_text": "Carolyn Hassarati Did you ask for the room you booked after seeing this? I did that the last time I got an unacceptable room (at another hotel) and despite being “full” they found me the room my reservation described."}, {"username": "Jenny Larsen", "comment_text": "Ok lucky you our accommodation in Maiori had a fan that was it. But we only paid $100 a night"}, {"username": "Molly Roberts Siegenthaler", "comment_text": "Go over to the Grand Hotel Cocumella instead."}, {"username": "Henriette Langius", "comment_text": "We are from The Netherlands. Pay between 75 and 130 euro per night for 2 people including breakfast. Even have a night including breakfast and dinner for only 120 euro"}, {"username": "Kathy Holden Reams", "comment_text": "We had the same experience at Hotel Mary."}, {"username": "Liviu Constantin", "comment_text": "Keep paying those huge prices and all will be well. 1000e room in Europe is basically skinning your back while you smile :))"}, {"username": "Karon Patterson", "comment_text": "Poor thing that’s crazy!!!"}, {"username": "Lisa Mic", "comment_text": "Ewwwww we go to Sorrento all the time & our hotel room doesn’t look like that. Tasso Suites is the place to be!!! Just saying!!! Katia OG Battaglia"}, {"username": "Steve Rothstein", "comment_text": "Wow ! Our stay in late May was completely the opposite. Sea view suite was wonderful, as was pool, breakfast, etc."}, {"username": "Sheryl Blasche Pavlak", "comment_text": "Nice or not nice - no idea why anyone would spend that much money on a hotel per night."}, {"username": "John Wilson", "comment_text": "Carolyn, even the tripadvisor reviews look good.they may have different quality rooms , some refurbished and some not. Have you given it to the front desk, threatening to cancel the remainder of your dates with them? There are other accommodations in Sorrento."}, {"username": "Jenny Payne", "comment_text": "If you booked with booking .Com they will definitely look into it for you. I don’t use Tripadvisor as they haven’t had a good rating lately 🌻"}, {"username": "David Gotlieb", "comment_text": "Wow that looks a lot for that price."}, {"username": "Kelle Packard", "comment_text": "Wow that looks awful"}, {"username": "David Gotlieb", "comment_text": "To relieve the disappointment.\n. go to bar pollio to get the best gelato in 🇮🇹 italy in ave corso italia sorrento."}, {"username": "Jason Hobel", "comment_text": "Casa Evelina Sorrento back in April and it was very clean and the gentleman who ran this was super nice and kind and under $200 US a night."}, {"username": "Heather Kramer Mallinger", "comment_text": "It definitely doesn't look like the photos from FB for the hotel, so that's super disappointing."}, {"username": "Deirdre O'Meara", "comment_text": "Throw a strop and get them to move you... go on... and message me back... bet you'll get what you want 😎"}, {"username": "Angelinna Soavescates", "comment_text": "You do realize you are in Italy 🇮🇹"}, {"username": "Clayton Webb", "comment_text": "Nicole Webb 😬"}, {"username": "Patricia Wheat Meza", "comment_text": "That’s terrible. It looks nothing like the pictures they are posting on their site."}, {"username": "Christine Pasieniuk Davis", "comment_text": "What kind of room is that considered?"}, {"username": "Carol Potter", "comment_text": "I stayed in a hotel in Volterra in Tuscany for seven nights in the room looked just like yours but I only paid €700 for seven nights total. It was an old building that used to house nuns and they converted it into a hotel. It was nice for the money but I would have never paid 1000 a night for what you got!"}, {"username": "Jonathan Coombs", "comment_text": "$1000 a night 🤣 you got fleeced"}, {"username": "Andrea Danielle", "comment_text": "I've stayed there twice last year. It was lovely and clean. The photo of the bed is a roll away bed not the main bed. I know because we had asked for one as well. We loved it so much we will be there a third time in 10 weeks. We found the staff to be very friendly and food in the restaurants amazing.\n\nRemember hotels in Italy are not like the big hotels in America. Bathrooms are typically small. There were doors on our closet ...are you showing the closet opened?"}, {"username": "Alessio Esposito Inchiostro", "comment_text": "A 4 star in my zone costs 150 a night maximum, same in Rimini\nWhy would you pick a 1k hotel?"}, {"username": "Rita Bivona Morgan", "comment_text": "we used the website Sorrento Vibes. They have beautiful apartments right in the town. They were reasonable and clean"}, {"username": "Samantha Belinda Albury", "comment_text": "How much is that is US dollars? 😳"}, {"username": "Linda Dalelio Williams", "comment_text": "Wow that’s alarming ."}, {"username": "Connie Dennis", "comment_text": "Geez! That's awful!"}, {"username": "Silvia Sanborn", "comment_text": "Sorry to hear that , they advertise as a 4 star hotel"}, {"username": "Steve Betsy Sillers", "comment_text": "What kind of room did you request? This does not look at all what the hotel looks like on their site."}, {"username": "Alessandro Battxi", "comment_text": "Grand or stars do not always reflect the quality of rooms that you'll take."}, {"username": "Reina Ve Del Oeste", "comment_text": "I paid $100 a night and mine was better than this. Even ibis is better 🤔"}, {"username": "Jim-Holly Ballew", "comment_text": "Those hangers, though! 😂"}, {"username": "Felicia Melo", "comment_text": "My airbnbs were like 250 USD a night and looked much nicer and had multiple bedrooms, kitchen, etc. some even had a really nice view"}, {"username": "Nikki Blosser", "comment_text": "Woah….😧"}, {"username": "Angie Callejas", "comment_text": "We’re a member of Marriott Bonvoy. Our hotels have always been on point. If a Marriott is not available in the area we travel then we are referred to the a sister hotel company."}, {"username": "Terry Spincic", "comment_text": "I know, I am going right now in Itali... Milano, Florence, Roma, Sorento, same shith different packing and prices higher then any ather place - standard not 0 minus 5star.Very disappointed"}, {"username": "Lyn Wise", "comment_text": "That's awful. I've only stayed in airbnbs throughout Europe except for one hotel in Athens. All for$150 - $300 AU.\nI hope you contact them about it"}, {"username": "Catherine R. Aiton", "comment_text": "No response from Carolyn Hassarati?"}, {"username": "Denise Gadsby", "comment_text": "Omg this makes me so mad !!! It’s Italy !! Nothing is all new and shiny ! It’s expensive but it should be clean it is what it is you can not and never compare Italy hotels to anywhere !"}, {"username": "Katie White-Meade", "comment_text": "Sorry for your disappointment.\nReally poor form. Thank you for warning others. Why do others have to be so cynical?"}, {"username": "Linda Slover Bright", "comment_text": "We’re not seeing the entire room in these photos. There’s an AC vent - looks clean; a bathtub - looks clean; closet area - looks clean with plenty of hangers; an extra/rollaway bed - obviously not permanent furniture. Reviews of this hotel are consistently good and the photos of their rooms feature nice furniture. Sorry the price tag was expensive but that’s what travel is during high season."}, {"username": "Carolyn Hassarati", "comment_text": "Ok i appreciated all the support ..\nJust my feelings ,I am comparing this accommodation to others in Rome Venice ect and am disappointed, take it or leave it\nIts so different to the photos I booked with online over 3 months ago . I just wanted to save others the same disappointment.\n\nXx"}, {"username": "Sandra Desmond", "comment_text": "Did you put in a complaint or do a charge back your bank will do this for you"}, {"username": "Barbara Bastianini", "comment_text": "Im sorry you’re unhappy with the hotel. It’s so disappointing when things don’t live up to our expectations.\n\nI think “Grand hotel” is one of those terms that doesn’t have a specific, clearly defined meaning. And that can feel misleading sometimes.\n\nIt seems to me that a lot of old traditional hotels are called Grand Hotels, so that’s what I assume when I hear the name. I automatically substitute “old style” in my mind for the word Grand in a hotel’s name. I visualize an older, historic hotel that was probably top of the line once or architecturally\nsignificant back when it was built. But one that may or may not need updating for current tastes. I think sometimes the best thing about a Grand Hotel might be the location or the view.\n\nBut that’s just me, so who knows? Maybe it really does mean something else that im\nnot aware of!"}, {"username": "Isa Van Wyk", "comment_text": "Oh noooo"}, {"username": "Sally Shamu", "comment_text": "Thanks for posting and advising traveller's. Cleanliness is a basic and is expected especially at a hotel with that price tag, Italy or not."}, {"username": "April Berube", "comment_text": "That doesn’t look anything like the pics on their website or Facebook! Thank you for sharing!"}, {"username": "Adriana Sormani", "comment_text": "No way! I hope you said something to them, was this the room you were shown when you booked it?"}, {"username": "Teresa Heran", "comment_text": "I completely understand. We stayed at the Grand Hotel In Salerno. Total disappointment.\nBait and switch. Nothing was as described or advertised. It’s like they gave up during Covid because the surrounding area and the amenities that are no more is lovely."}, {"username": "Karen Rafte Crowley", "comment_text": "By looking at the photos these photos it looks like a typical European hotel room."}, {"username": "Richard Rodriguez", "comment_text": "Don’t know how you fell into that. We paid $1200/5 nights for a 2 bedroom condominium right on the street in Sorrento that was spotless and modern."}, {"username": "Eliza Hatzivassiliadou", "comment_text": "why on earth do you pay so much money for a hotel??? there is plenty of lovable small hotels, with reasonable prices."}, {"username": "Al Burger", "comment_text": "I'm sorry, I've seen worse in the States. Your pictures are just pictures, What was wrong with each. Ceiling air vent?? Bed that looked like you slept in it alreay or was it the old time flooring? Closet, not enough hangers or were there no doors? Tub didn't look dity, maybe just aged? I've stayed at Hilton Hotels that were a little \"rustic\"."}, {"username": "Benita Hauskins", "comment_text": "So sorry for your experience. I guess the price is for location, location, location."}]}, {"id": "2194369357628809", "text": "I know there is an extreme heat wave right now. We went a few years ago to Rome and the weather and temps were great for touring. Coming again this year same time. Sept 18th - October 5th. Hope it is great weather again.", "link": "facebook.com/groups/1373361046396315/permalink/2194369357628809/", "likes": 2, "comments": []}]