[{"id": "2209359026129842", "text": "What do I pack for trip to Italy (Rome to Venice) mid to late Nov?", "link": "facebook.com/groups/1373361046396315/permalink/2209359026129842/", "likes": 14, "comments": [{"username": "Susan Lowry Lamb", "comment_text": "Mix and match layers."}, {"username": "Diane Rabinowitz", "comment_text": "A light rain jacket and umbrella!"}, {"username": "Donna Caruso", "comment_text": "An outlet adapter"}, {"username": "Sherri Leis Dillavou", "comment_text": "I was there first 2 weeks of December. Wore jeans and nice shirts. Good walking shoes (heals are not a good idea on cobblestone"}, {"username": "Sandra Maldonado", "comment_text": "Check the average temperature in those cities and pack according to the way you handle those temps. When I was in Greece our tour director always had a jacket on. The rest of us were in short sleeves. It’s a very personal thing. I’m always on the hot side."}, {"username": "Basia Szokarski", "comment_text": "Black/gray skinny ankle pants, comfy stylish sneakers, maybe shoe boots, neutral tops, and a couple of versatile outer garments. Rain jacket and umbrella."}, {"username": "Sally Sprinkle", "comment_text": "Make sure whatever shoes or boots you decide on they have thick soles necessary for walking on cobblestone"}, {"username": "Clinton Noel Williams", "comment_text": "A backpack and a glass"}, {"username": "Terry Andino", "comment_text": "PACK LITE!! DO NOT OVER DO IT!!!!!!!!!!!!"}, {"username": "Linda Seckler-Rufkahr", "comment_text": "Layers! Be ready for anything."}, {"username": "Veronica Mendez", "comment_text": "Comfortable clothes, sweaters and walking shoes. Rain jacket, umbrella. Rain boots, very need it in Venice."}, {"username": "David Davey", "comment_text": "What you should pack? Pack euros buy everything you need in Italy 😂😂.\nStarting to get cold in northern Italy but not so cold in south. Good waterproof clothing and shoes."}, {"username": "Zoli Berecki", "comment_text": "Toothbrush and Mastercard"}, {"username": "Suzanne Mills", "comment_text": "An umbrella"}, {"username": "Colleen Church", "comment_text": "Italians say they dress like an onion, thin layers to peel off or put on"}, {"username": "Mat PO", "comment_text": "Loro Piana!"}, {"username": "Nancy Lewis", "comment_text": "Seriously?❤️. What ever you are comfortable in and practical. After you layout all your clothes ti take then takeaway 3 outfits."}, {"username": "Kit Nader", "comment_text": "Layers."}, {"username": "Albert Campagna", "comment_text": "Warm clothing"}, {"username": "Basia Szokarski", "comment_text": "Black/gray pants, comfy stylish sneakers, maybe shoe boots neutral tops and a couple of versatile outer garments. Rain jacket and umbrella."}, {"username": "Billie Frances Swanda", "comment_text": "Hoodies"}, {"username": "Dawn Falsinotti", "comment_text": "Warm clothes."}, {"username": "Monica Marzari-Hailey", "comment_text": "Winter clothes"}, {"username": "Pilar Vasallo", "comment_text": "Same exact timeframe we’re going. Following…"}, {"username": "Anna Sardone Tatak", "comment_text": "Cheaper tickets but cooooldd"}, {"username": "Bill Dest", "comment_text": "Layers. Cooler weather fur sure"}, {"username": "Miyuki Kanno Paul", "comment_text": "An extra jacket/\nsweater. It gets chilly"}, {"username": "John Bruckman", "comment_text": "Good walking shoes…"}, {"username": "Rodger Cravens", "comment_text": "Look at the weather online and figure it out. It's not like we know your tolerance for what the weather will be."}, {"username": "Vince N Cindy Erno", "comment_text": "A coat, something for the rain and comfy boots… make sure your shoes are water resistant as it’s very easy walking around for your feet to get wet if not wearing the proper shoes. I wouldn’t recommend sneakers… Leather boots l, ankle length with a comfy sole. Scarf, jeans layering is a good idea especially if you plan on walking a lot. Don’t forget to hit up the islands of Murano and Burano when in Venice. 😉"}, {"username": "Jen Del Raso", "comment_text": "Comfortable walking shoes."}, {"username": "Linda Pitler", "comment_text": "Layers. And really comfortable shoes."}]}, {"id": "2209361866129558", "text": "Please can you recommend a driver or taxi service for a family of 4 from Verona airport to Lazise\nMany thanks", "link": "facebook.com/groups/1373361046396315/permalink/2209361866129558/", "likes": 3, "comments": [{"username": "Karen Blackmore", "comment_text": "We loved Lazise! We first stayed in Verona then got the train to Peschiara del Garda and a taxi from there. Was ages ago and our booking.com host booked the taxi"}, {"username": "Dorothy Smith", "comment_text": "exclusive cars Verona Ialways use them and love Lazise"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2209363516129393", "text": "Hello! I would like to tent camp Italy. I would rent camping sites. Had anyone done this before? Any suggestions? Beautiful sites?", "link": "facebook.com/groups/1373361046396315/permalink/2209363516129393/", "likes": 0, "comments": []}, {"id": "2209365432795868", "text": "6 years ago, first trip to Italy. We took a couple of stowaway passengers. Made for some great photos at the hotel and Vatican museum.", "link": "facebook.com/groups/1373361046396315/permalink/2209365432795868/", "likes": 4, "comments": [{"username": "Jay Cabrera", "comment_text": "Love it!"}]}, {"id": "2209371709461907", "text": "Sorrento is the perfect base if you want to do day trips to Capri and Positano!", "link": "facebook.com/groups/1373361046396315/permalink/2209371709461907/", "likes": 3, "comments": []}, {"id": "2209389029460175", "text": "PROCIDA", "link": "facebook.com/groups/1373361046396315/permalink/2209389029460175/", "likes": 8, "comments": []}, {"id": "2209396396126105", "text": "PROCIDA", "link": "facebook.com/groups/1373361046396315/permalink/2209396396126105/", "likes": 6, "comments": [{"username": "Van Adair", "comment_text": "2025"}, {"username": "Barbara Aitken", "comment_text": "May 2024"}]}, {"id": "2209094836156261", "text": "Palio in Siena Aug 16 2023. We had to move our trip to Italy from next week to October. We bought 2 tickets to the Palio on Aug 16 with a dinner included the night before with a neighborhood. Any ideas what to do with the tickets? Please help me recover this. They were expensive.", "link": "facebook.com/groups/1373361046396315/permalink/2209094836156261/", "likes": 3, "comments": [{"username": "Kristina Ruk", "comment_text": "What tickets policy says?"}, {"username": "Alison Roberts Yeh", "comment_text": "Oof, sorry to hear it! Can you contact the contrada?"}, {"username": "Angela O'Donnel", "comment_text": "Can you sell them on a third party app? (I'm in the States and use SeatGeek for example)"}, {"username": "AngelLin Monroy", "comment_text": "Just try changing the dates, not refunding."}, {"username": "Ilaria Giorgulli", "comment_text": "There is an Italian Facebook group called “ se non puoi ci vado io”, try there!"}, {"username": "Marti Campbell", "comment_text": "October is a much better time of the year to visit instead of August. Enjoy"}, {"username": "Maria O'Callaghan", "comment_text": "Travel insurance claim"}, {"username": "Rhona OConnor", "comment_text": "Offer them for sale in this group....."}, {"username": "Roxanne Patti", "comment_text": "Try posting on the Siena forum on Trip Advisor."}]}, {"id": "2209397852792626", "text": "PROCIDA", "link": "facebook.com/groups/1373361046396315/permalink/2209397852792626/", "likes": 8, "comments": []}, {"id": "2209412192791192", "text": "Did anybody ever fly with ITA airways? What was your experience and rating?￼", "link": "facebook.com/groups/1373361046396315/permalink/2209412192791192/", "likes": 4, "comments": [{"username": "Rip Lonergan", "comment_text": "I have a flight scheduled with them this Friday. Flight tracker shows it on time every day for departure but two hours before departure. They have canceled the flight every day since July 16."}, {"username": "Aaron Loree", "comment_text": "Did a month ago. No issues at all"}, {"username": "Kathy Young", "comment_text": "I fly with them next month"}, {"username": "Colleen Schimmenti", "comment_text": "Flew round trip last week. Flight was due to leave 4 pm. Delayed until 450, but they told us a few days before. Actually arrived in Rome within 7 hrs. Return flight there was a delay when boarding, they didn’t tell us why. 8 hrs 50 min to JFK. No turbulence R/T. 😀 I would fly them again in the future."}, {"username": "Marty Harte", "comment_text": "Flew round trip from JFK to Rome 2 weeks back. No probs. Friendly service, adequate meal etc. I’d fly again."}, {"username": "Jesus AndLedia", "comment_text": "I flew with them in June and had a great experience, except for delays due to weather. Very comfortable."}, {"username": "Tricia Lanieri Forchetti", "comment_text": "Yes, in June, with no issues at all! IAD to Rome."}, {"username": "Delia Miscella Wroblewski", "comment_text": "I’ve flown them since they took over from Alitalia. I’ve flown economy, premium economy and Business. I always had wonderful experiences. Always in time and always friendly, professional service."}, {"username": "Sharon Krupp", "comment_text": "Was great. We went from Rome to Athens."}, {"username": "Sandra Bongiovanni Memoli", "comment_text": "Thank you! 😊"}, {"username": "Sharon Menegoni", "comment_text": "Flew with ITA Boston to Rome in March, smooth flight, no problems"}, {"username": "Tracey Pino", "comment_text": "Catania to Rome round trip in June & July. Perfectly fine, as a matter of fact they were nicer & more efficient than AA"}, {"username": "James DiLeonardi", "comment_text": "Very good from Roma to Catania"}, {"username": "Robyn L Schmidt-Cali", "comment_text": "Eh. flights delayed. food ok, and seats small. quick flight they made up the time in the air."}, {"username": "Jeff Davis", "comment_text": "Round trip LAX to FCO. Food poor,but otherwise it was fine."}, {"username": "Sophia Jade", "comment_text": "Following as I have a flight ✈️ with them in 2 weeks and interested to know"}]}, {"id": "2209437526121992", "text": "Fantastic trip to Berona, Verona and Torcello today. Ferry rides there and back somewhat chaotic with little guidance but we made it!\nHere's some snaps.", "link": "facebook.com/groups/1373361046396315/permalink/2209437526121992/", "likes": 56, "comments": [{"username": "Jerry Kiger", "comment_text": "Looked like a nice time. Looks like it is north between Verona and across above Venice. Question — considering car rental to drive some of Italy, do you think doable places to park a car? I know most use public trans bus, train, ferry but have 6+ people and want to drive esp that region"}, {"username": "Elizabeth Hartzell", "comment_text": "Where did you take the ferry from?"}]}, {"id": "2209438979455180", "text": "We are spending 3 days of our honeymoon in Venice! Any and all suggestions on must see and do’s? Would love to take a cooking class or wine tasting.", "link": "facebook.com/groups/1373361046396315/permalink/2209438979455180/", "likes": 0, "comments": [{"username": "Dana Talusani", "comment_text": "Congrats! What a romantic place to be on your honeymoon. You just gotta do the gondola ride if you just got hitched. Sure, it's expensive and you feel a little cheesy, but you just gotta. I think some people on this site even have favorite gondoliers, if they are willing to weigh in. Have fun!"}, {"username": "Renae Larcus", "comment_text": "Consider a day trip to Burano and Murano"}]}, {"id": "2209441366121608", "text": "I have a great friend who was married on Ischia last year. Is there anything or a website specifically that you might be able to direct me to to purchase something for them from there? I've seen the liquor made from the thyme etc", "link": "facebook.com/groups/1373361046396315/permalink/2209441366121608/", "likes": 0, "comments": []}, {"id": "2209444632787948", "text": "I have 2 days based in Rome next week - I’m hoping to do two day trips down near the Amalfi coast. What are the best areas that way for day trips?", "link": "facebook.com/groups/1373361046396315/permalink/2209444632787948/", "likes": 1, "comments": [{"username": "Steve Grossman", "comment_text": "The coast is four hour drive away. It's not a day trip from rome"}, {"username": "Steve Grossman", "comment_text": "I would head north to the southern towns of tuscany. There is a bunch of them and you can have a very very nice day"}, {"username": "Karen Schmidt", "comment_text": "Rome is amazing! Have you been? If not, I’d stay there and explore. If yes and you really want out…I’d take a high speed train somewhere and stay there instead"}, {"username": "Miyuki Kanno Paul", "comment_text": "Tivoli"}, {"username": "Neaţă Maria", "comment_text": "You can do it, because I also did it. First of all, take the hi-speed train (frecciarosa) from Roma Termini to Napoli . It's one hour journey. From Napoli to Sorrento take the Circumvesuviana\nexpress (kind of regional train, look on google). After 50 minutes your on Sorento. Near the train station is the bus who will take you to all the little towns on Amalfi coast. I pay for a ticket valid one day. You can get off at any town and then get on to continue. One tip, go as early as you can so you have more hours on the Coast. The train in Italy are awesome so look for info on web."}]}, {"id": "2209448886120856", "text": "Palermo Cathedral. Get a ticket for acces to the rooftop to enjoy amazing views of the city and its surroundings.", "link": "facebook.com/groups/1373361046396315/permalink/2209448886120856/", "likes": 19, "comments": [{"username": "Khushi Khanna", "comment_text": "Hi, do you have to climb a lot of stairs to reach the roof or is there an elevator"}]}, {"id": "2209452016120543", "text": "Has anyone had a tour with Discover Rome Tours? If so feedback would be appreciated regarding your experiences. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2209452016120543/", "likes": 0, "comments": []}, {"id": "2185828381816240", "text": "A little bit of heaven in Sorrento! 🍋\nThe view is unreal, the Grand hotel Sorrento has a wonderful terrace to enjoy the best sunsets and a beautiful panoramic swimming pool overlooking the Mediterranean coast,… आणखी surrounded by palm and eucalyptus trees 😍 simply a dream!\nDiscover more: https://www.anrdoezrs.net/click-100692842-11552042?url=https%3A%2F%2Fwww.tripadvisor.com%2FHotel_Review-g187782-d279184-Reviews-or20-Grand_Hotel_Riviera-Sorrento_Province_of_Naples_Campania.html%23REVIEWS", "link": "facebook.com/groups/1373361046396315/permalink/2185828381816240/", "likes": 9, "comments": []}, {"id": "2172560279809717", "text": "Best of Pisa: Small group tour with admission tickets\nDiscover one of the most important town centers, in regards to European medieval art, and one of the finest architectural complexes in the world. Listen as… आणखी your guide tells you about this square in Pisa, dominated by four great religious edifices: the Cathedral, the Baptistry, the famous leaning tower, and the Camposanto Monument. Enjoy the highlights of Italian medieval architecture in the Square of Miracles on this comprehensive walking tour.\nRead more about Best of Pisa: Small group tour with admission tickets - https://www.viator.com/tours/Pisa/Best-of-Pisa-Small-group-tour-with-admission-tickets/d520-51192P87?pid=P00070587&mcid=42383&medium=link&medium_version=selector", "link": "facebook.com/groups/1373361046396315/permalink/2172560279809717/", "likes": 16, "comments": []}, {"id": "2209328429466235", "text": "Located on a plateau overlooking the gorges of river Nera, Narni is one of the most beautiful villages in central Italy and it is highly worth visiting for its historic medieval towns and fortresses, itsआणखी surprising underground and deliciuos food. Our local guide Patrizia will lead you through the fascinating alleys and Middle-Aged palaces of Narni to discover the beautiful Piazza dei Priori and the Romanesque cathedral of San Giovenale. You will explore a land of myths, legends and ancient history at the very centre of Italy!\nJoin our NEW virtual experience: https://nextstop-italy.com/virtual-tours/narni/\n\n#virtualworld #artlovers #art #vacationmood #history #italyiloveyou #italygram #italytravel #italytrip #medieval #medievalhistory #medievalart #medievalcastle #medievaltimes #medievalarchitecture #narni #narnia #chroniclesofnarnia #chroniclesofnarnia #hiddengems #hiddenplaces #magicalplaces #MagicalAtmosphere #umbria #umbriagram #umbrialovers #umbriatourism", "link": "facebook.com/groups/1373361046396315/permalink/2209328429466235/", "likes": 15, "comments": []}, {"id": "2209301262802285", "text": "Where in Rome someone can reccommend restaurant where you can have cheese wheel pasta made in front of you? Thank you in advance", "link": "facebook.com/groups/1373361046396315/permalink/2209301262802285/", "likes": 67, "comments": [{"username": "Francesca Campetta", "comment_text": "\"Alfredo alla scrofa\""}, {"username": "Kristin Brady", "comment_text": "F"}, {"username": "Karen Landry", "comment_text": "Wonder if this is made anywhere in Sorrento?"}, {"username": "Norma Kalberer", "comment_text": "Aruba also has restaurants that feature this delicious dish."}, {"username": "Jeff McLellan", "comment_text": "People can say whatever they want about this. It was one of the better simple cheese pasta dishes we had on our trip. We went to Roma Sparita in Rome whose cacio e pepe was one of Anthony Bourdain’s favorite dishes anywhere and the tagliatelle flambé from Osteria Pastella in Florence was a better dish. Touristy or not done right it is a tasty dish."}, {"username": "Jeff McLellan", "comment_text": "People can say whatever they want about this. It was one of the better simple cheese pasta dishes we had on our trip. We went to Roma Sparita in Rome whose cacio e pepe was one of Anthony Bourdain’s favorite dishes anywhere and the tagliatelle flambé from Osteria Pastella in Florence was a better dish. Touristy or not done right it is a tasty dish."}, {"username": "Sonia Starinieri", "comment_text": "Trattoria Vechia Roma amatriciana flambé 11euros. Also make a great Carbonara."}, {"username": "Magdalena Graywolf", "comment_text": "Just go to any restaurant with an English menu close to tourist locations."}, {"username": "Claudio Blizzard Indastria", "comment_text": "Just reverse any advices to avoid tourist traps and you'll find it"}, {"username": "Marissa McLean", "comment_text": "This is not a normal Italian thing! It’s something Americans made up, you’ll have a better chance finishing it in the USA than in Italy, I’d probably just go to the one in that tiktok because there’s not an abundance of them"}, {"username": "Fabia Hugo", "comment_text": "Ristorante Alfredo. Been to many restaurants, but this was my most memorable. One of the oldest restaurants in Rome. They do Fettuccine Alfredo in the hollowed out cheese."}, {"username": "Anna Gambino", "comment_text": "Surely not an Italian thing but neither are spaghetti and meatballs or chicken parm in Italy. Best to try local dishes to have an authentic experience but if this is your heart’s desire, go for it."}, {"username": "Lisa Silverman", "comment_text": "This is actually an American dish."}, {"username": "Paola Coppi", "comment_text": "Try Pasta Cacio and Pepe in Rome: it's the same ingredients: real Pecorino romano plus black pepper! Super easy super tasty!"}, {"username": "Paola Coppi", "comment_text": "if in Milan try Risotto ai quattro formaggi (Rice with 4 cheeses) which is similar"}, {"username": "Paola Coppi", "comment_text": "https://\nricette.gialloza\nfferano.it/\nSpaghetti-Cacio-\ne-Pepe.html\n\nTrain yourselves following this recipe. when you get to Italy, first thing you compare them!"}, {"username": "Martin-John Rubio", "comment_text": "Sounds like a tourist thing.....SMH"}, {"username": "Antonio Aloè", "comment_text": "In any restaurant for tourists probably...🤭"}, {"username": "Eric Dorn", "comment_text": "I heard that the CWP is very unsanitary. That’s what I’ve heard."}, {"username": "Lynn Clemens", "comment_text": "Mark Clemens"}, {"username": "Deborah Shaw", "comment_text": "There’s an Italian restaurant near our home (in Utah) that serves this. I love the first few bites then it’s too rich."}, {"username": "Shanda Rieder Kozicki", "comment_text": "I had this in LA and it was amazing."}, {"username": "Leesa Martin", "comment_text": "What are true Italian food traditions? I’m not American so didn’t realise it’s a US thing. Never been to Italy before. Only realised it was a thing at all when looking for information on Italy."}, {"username": "Yiota Mallas", "comment_text": "Alfredo alla Scrofa has it"}, {"username": "Kathleen Knezevich", "comment_text": "Trattoria Vecchia Roma and there were a lot of Italian people eating there. Just fyi. It was delicious."}, {"username": "Tom O'Hara", "comment_text": "We rarely eat pasta in Italy."}, {"username": "Ashley Brancheau", "comment_text": "Alan Hubbard II"}, {"username": "April Leger", "comment_text": "This is Il Ciociaro and it was absolutely amazing! 🤩"}, {"username": "Pam Wilson Berry", "comment_text": "I don’t know about Italy but if you’re ever in Montana we’ve got a great place in Red Lodge called Piccola Cucina Ox Pasture that does it! It’s delicious!"}, {"username": "Jacquelynn DeSimone Larson", "comment_text": "Carfagna's Columbus Ohio"}, {"username": "Carolyn Straniere", "comment_text": "Restaurants geared towards tourists usually. It's considered gimmicky"}, {"username": "Kim Shea", "comment_text": "Following - my son wants this 🙄"}, {"username": "Roza Sham", "comment_text": "My kids really want to try it. Found one but next available is Aug 25. I am here only for 3 days"}, {"username": "Stacey Byerley", "comment_text": "That flambe cheese wheel in Florence. OmG! Best pasta in my life!"}, {"username": "Shelby Violet Mizell", "comment_text": "We had this at Il Ciociaro!!"}, {"username": "Elena Innocenti", "comment_text": "In Roma I think “Da Danilo” have “cacio e pepe” in this way."}, {"username": "Ally Dickerson", "comment_text": "This is soooo not Italian😂 maybe just walk into the closest restaurant to any tourist spot😂"}, {"username": "Alessandro Battxi", "comment_text": "Any tourist traps will have it."}, {"username": "Ian Beyer", "comment_text": "While I’m sure it’s very tasty, it’s giving Olive Garden vibes."}, {"username": "Eva Salas", "comment_text": "In Milan, he sings too."}, {"username": "Jaime Cleek", "comment_text": "This isn't really common but I'd say watching the TikTok will tell you lol"}, {"username": "Nicholas Bozza", "comment_text": "Some people like pasta with their cheese. Lol. Very creative!"}, {"username": "Roza Sham", "comment_text": "Thank you everyone"}, {"username": "Norma Koppe Parent", "comment_text": "Of couse it is important to experience the authenticity of each Country or city, it is also fun to experience some of the touristy things as well. I am sure many Italians havent visited the Coluseum just like many Americans or New Yorkers havent gone to the Statue of Liberty. It all just adds to the fun of vacations and experiencing something new. Have fun and tell us how the cheese wheel meal went."}, {"username": "Frank A Colacino", "comment_text": "Alfredo’s near the Spanish Steps"}, {"username": "Wendy Spano Bracco", "comment_text": "I get this in Delray Beach, FL. It’s a tourist thing in Italy. I wouldn’t be seeking this out as a must do. Just find a good restaurant that makes good Cacio e Pepe."}]}, {"id": "2209269166138828", "text": "Best way to get from Tirano to Ballgio please? Any suggestions would be appreciated 😊", "link": "facebook.com/groups/1373361046396315/permalink/2209269166138828/", "likes": 2, "comments": [{"username": "Stefano Bressanelli", "comment_text": ", Tirano to Varenna by train and ferry boat."}, {"username": "Antonio Aloè", "comment_text": "WTF is Ballgio?🤭"}]}, {"id": "2209309402801471", "text": "a heads up if you have booked hotels through a booking site. I woke up to two emails from the hotels that my bookings were being cancelled due to credit card issues.\nThere was a link directly to the booking site. I called my credit card company and they said there was no attempt by either hotel or the booking site for payment. I contacted the hotels by phone and was told the emails did not come from them and she confirmed my reservation.", "link": "facebook.com/groups/1373361046396315/permalink/2209309402801471/", "likes": 49, "comments": [{"username": "Annette Tamminga", "comment_text": "That is called phishing! Someone was trying to get you to provide credit card information. Delete and move on."}, {"username": "Kim Dixon", "comment_text": "That’s what my friend thought when she booked through a third party site in Rome (can’t remember off hand the name). They wanted copies of passports. She ignored it. We got to the hotel and had no booking. It was cancelled because she hadn’t provided the info. Fortunately the hotel had rooms, but for $25 more a night. Wouldn’t jump the the idea it’s a scam. It’s also why I only book with hotels directly"}, {"username": "Sandi Van", "comment_text": "What website ? I did www.booking.com includes listing for Airbnb and hotel"}, {"username": "Anna Gambino", "comment_text": "When you are in 3rd party websites there are always links to hotel websites. I always book through hotel directly. Saves me time and effort for just this sort of thing. Not sure why people book on those other websites."}, {"username": "Avril Samuel", "comment_text": "It’s quite common to have to send copies of passports now."}, {"username": "Susan Marten", "comment_text": "Ugh! Don’t click links!"}, {"username": "Pam Kimak", "comment_text": "Always deal with with over seas hotels directly making reservations..y\nou will get the best prices, and hotels appreciate it instead of 3rd party booking. I had an issue also with my card company rejecting charge bc it was overseas a \"World wide\" card!"}, {"username": "Angela Neal Hinson", "comment_text": "Thanks for sharing!!"}, {"username": "Giovanni Pianigiani", "comment_text": "this is too generic. What booking site? I have been travelling for years with reputable sites and never had an issue"}, {"username": "Carrie Jaquess", "comment_text": "Would be helpful to know which booking site you used."}, {"username": "Charlene Noll", "comment_text": "I used the same site for a hotel in Greece in September. No issues so far, the hotel (policy) already charged the entire stay to my card."}, {"username": "Trish McIntyre Butters", "comment_text": "A few times I’ve used hotels dot com and arrived at my hotel and they’ve given to room I reserved away. Said they over booked. I might start booking right through hotels."}, {"username": "Julie McNall", "comment_text": "A lot of spam type emails out there at the moment check everything"}, {"username": "Sepi Toloue", "comment_text": "They did that to me also . They canceled my reservation last minute without any explanation, even though my credit card was charged.\nI would never book with them again."}, {"username": "Nichola Harkin-Chipps", "comment_text": "I’m a Director of Sales for Hilton always book directly with hotels or airlines directly …. You’ll be happy you did ."}, {"username": "Bernadette Sarmiento", "comment_text": "Just to share what I observed years ago when I was at Holiday Inn but booked directly through them. There was a small fire on the 8 th floor and we had to leave our rooms and later to find out that we had to gather our luggages and bring it down using stairs as elevators were not working- holiday inn rebooked us at a nearby Marriott hotel but those that booked through a third party had to call the third party to complain- the hotel will not arrange for another hotel. I saw all those guests upset and angry and this is why I don’t book through third party unless I have no choice and I don’t like high floors anymore"}, {"username": "Lori Schach Stockman", "comment_text": "Hotelier here- book direct!"}, {"username": "Mega Mashkor", "comment_text": "Always check the sender actual email, click on the email name. Usually they are Phishing email. It has the hotel/company name but when you click on it, the email will be different."}, {"username": "Lauren Wilstein", "comment_text": "Sounds like a phishing scam. They were prob trying to get your credit card and personal info. I’d change your password if you haven’t already."}, {"username": "Robert Caserta", "comment_text": "No I can confirm that it is a scam my contact came thru the booking . Com and it wasn’t them or the hotel"}, {"username": "Nicole Condemi", "comment_text": "We had this happen, but the hotel had actually realised and had sent us a message to disregard as it was a scam. We called the hotel directly to confirm and all good. Scams are everywhere to be fair."}, {"username": "Sue Simmonds", "comment_text": "what can we trust these days??"}, {"username": "Carmine Napolitano", "comment_text": "Yeah that's supposedly happened to our reservation and Positano but we caught it before we showed up pretty sure our travel agent screwed up though"}, {"username": "Leslie Goodland", "comment_text": "I booked through Booking dot com for all of stays during my 10 week European trip and never once had a problem."}, {"username": "Kejdi Okej", "comment_text": "Ugh l do n t click linkes l"}, {"username": "Isabelle Truong", "comment_text": "When you receive any email that you’re not sure of always click on the sender’s email address and you can see if it’s legit or phishing/scam. I would also never click on any links on the email that I’m not sure. Scammers are getting so clever nowadays even some emails supposedly come from government organisations."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2209260726139672", "text": "Please suggest a place to stay in Sorrento or surrounding area that won’t break the bank! 🤣 Vico equense? Sant agnello?", "link": "facebook.com/groups/1373361046396315/permalink/2209260726139672/", "likes": 1, "comments": [{"username": "Diane Davis Lawyer", "comment_text": "We are going to stay at an Airbnb in Sant' Agnello. It looks lovely with great reviews, reasonably priced as well."}, {"username": "Adrian Astridge", "comment_text": "https://\nwww.hotelmoonval\nley.com/"}, {"username": "Kally Trahearn", "comment_text": "Hotel Plaza Sorrento -great location and very reasonably priced (compared to other hotels in the area)"}]}, {"id": "2209154846150260", "text": "I am going to Florence in September for 3 days, i want to reserve through Airbnb, can u tell me please about the best area to stay in? Thk u", "link": "facebook.com/groups/1373361046396315/permalink/2209154846150260/", "likes": 6, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "look here https://\nwww.jdoqocy.com/\nclick-100692842-\n12291623?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.it\n%2FVacationRent\nalReview-g18789\n5-d10853189-PON\nTE_VECCHIO_SUIT\nE_near_Ponte_Ve\ncchio-Florence_\nTuscany.html"}]}, {"id": "2209257576139987", "text": "Hi do you know a good link where it gives upcoming events in the vicinity of naples, sorrento, capri?", "link": "facebook.com/groups/1373361046396315/permalink/2209257576139987/", "likes": 0, "comments": []}, {"id": "2209261746139570", "text": "Hello, my wife and I will be traveling from montalcino to cinque terre on Aug 25th but we are having a hard time figuring out the most efficient way of traveling between the two. Any suggestions from someone who has made that trip so far? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2209261746139570/", "likes": 3, "comments": [{"username": "Jenn Messina Babore", "comment_text": "Did you check Rome2Rio for options?"}, {"username": "Miyuki Kanno Paul", "comment_text": "Are you on public transportation or driving? How are you going to get to Montalcino to begin with?"}, {"username": "Miyuki Kanno Paul", "comment_text": "Check Google Map. As a reference, I set it as tomorrow at 0600 departure from Montalcino to La Spezia Centrale(gatewa\ny to Cinque Terre and the biggest train station around). It seems like you need a combination of 3 methods of transportation to take. I took a screenshot as a reference to you"}]}, {"id": "2209262822806129", "text": "Thinking of doing a road trip in the north (Emilia romagna) in October any recommendations\nI have family in Rimini do this will be a base x", "link": "facebook.com/groups/1373361046396315/permalink/2209262822806129/", "likes": 1, "comments": [{"username": "Joya Nicastro Cherry", "comment_text": "Maestro Travel Experience is the Best !!!"}, {"username": "Barba Ra", "comment_text": "Go visit Ravenna, Bologna, delta of river Po where you can watch birds (also flamingoes), salt fields in Cervia, Cesenatico, tiny state San Marino..."}]}, {"id": "2209032559495822", "text": "Leave the 31st of this month through the 18th. Itinerary as follows:\n\nLand in Rome: 3 nights\nSorrento: 1 night\nCapri the full next day\nFurore:3 nights\nTuscany: 2 nights\nFlorence: 2 nights\nDolomites: 2 nights\nVenice: 2 nights\nSardinia: 2 nights\nDeparture flight from Rome\n\nThoughts and Recommendations?", "link": "facebook.com/groups/1373361046396315/permalink/2209032559495822/", "likes": 3, "comments": [{"username": "Rose Turdo", "comment_text": "Land in Milan, rent a car and depart from Rome.\nUse Google Maps to make most of travel time.\nMilan to Dolomites to Venice 1 night , through Tuscany to Pisa .. 2 nights Florence ..\nPick your course. Save Rome for last 2 nights before departure."}, {"username": "Scott Perry", "comment_text": "Don’t try to do too much. Packing, unpacking, the actual time spent traveling, and waiting to check into places can take the better part of a day."}, {"username": "Gina Rovello Keenan", "comment_text": "my goodness that is a lot of moving. You are all over the place. You are going to spend a lot of time packing, unpacking and checking in and out of hotels, not to mention all of that travel time! Can you base in 3 cities and do day trips? I would map this out and rethink the itinerary. Eliminate Sardinia."}, {"username": "Elena Innocenti", "comment_text": "Good luck. 🥵\nFurore?"}, {"username": "Miyuki Kanno Paul", "comment_text": "Firenze is in Toscana. Combine Firenze and Toscana, and make day trips from Firenze especially if you are not driving.\nVenezia deserves more than 2 nights.\nAre you renting a car?"}, {"username": "Shelley Frise", "comment_text": "We just came back and moved every 3 days. We enjoyed everything but would prefer a more relaxing trip."}]}, {"id": "2209264199472658", "text": "Anyone who has a schedule for 6 days at rome?! 😊", "link": "facebook.com/groups/1373361046396315/permalink/2209264199472658/", "likes": 1, "comments": [{"username": "Anastasia Elmova", "comment_text": "Check out the Lonely Planet Rome guide, there's a nice 4 day schedule, then add 2 days to relax 😌"}, {"username": "Karrie LeBlanc", "comment_text": "Here are some ideas:\n\nOn a Friday or Saturday visit Palazzo Colonna from 10am-12noon. It is only open mornings. Get ticket onsite and get the one with the garden.\nAfterwards grab a lunch and then tour Gallery Doria Pamphilij Palazzo on via del Corso. Buy ticket onsite and get the audio guide and grab a drink on their new little patio.\n\nAnother day visit colosseum early and walk around the Forum. Have a guide to give you history. Grab a nice lunch.\n\nAnother day wander Trastevere. Stop at historic churches, grab drinks and meat & cheese platter at Mimi e Coco. Head to Twice Vintage shop if you like designer vintage finds. Grab a cappuccino or other coffee drink at Giselda nearby. Visit Almost Corner Bookshop if you like books, the owner has great taste in poetry books.\n\nDo early morning tour of Vatican. Book in advance online direct on the Vatican website small tour with breakfast. Wander and spend the full morning there.\nAfter grab lunch and drinks at Cresci restaurant. Then head to National Gallery of Ancient art at Palazzo Barberini - no advance ticket needed.\n\nAnother day book in advance online a tour of Villa Borghese and then Pantheon tour.\n\nGet up early go to Trevi Fountain, Spanish Stairs and then grab a scooter or walk and have brunch at Coromandel restaurant or Barnum.\n\nTake new high speed train to Pompeii for another day trip."}, {"username": "Miyuki Kanno Paul", "comment_text": "I have spent 7 days in Rome at any given time. What are your priorities?"}]}, {"id": "2208956572836754", "text": "Going to Sorrento Sept 7-14. Booked a tour boat from Sorrento to Capri. After reading how rough water is I’m thinking of cancelling. Has anyone gone in Sept? If so was waters very rough. Also read the ferry is a rough ride too. 🤢😬", "link": "facebook.com/groups/1373361046396315/permalink/2208956572836754/", "likes": 8, "comments": [{"username": "Costero Home", "comment_text": "This will totally depend on the day your travel but be warned, the waters in the area can be rough which makes the journey tough for some."}, {"username": "Rosemary Faccadio Kenyon", "comment_text": "We went in Sept last year and it was perfect."}, {"username": "Dawn Handrahan-Lauchlan", "comment_text": "Day to day it could vary… we went in October and it was perfect"}, {"username": "Marlene Scala", "comment_text": "Hope it isn’t rough we plan on a combo fishing/capri trip beginning of October"}, {"username": "Cindy Vethe", "comment_text": "We are coming mid September as well, and want to do same thing and have been advised to purchase everything ahead of time, but I am thinking of waiting last minute because of the waters and just see how it is. Any thoughts from anybody? ￼"}, {"username": "Debra Quinney", "comment_text": "We went in September from sorrento to capri on the ferry it was fine also did amalfi to postiano and that was ok as well"}, {"username": "Betty Maher", "comment_text": "Went last September was almost perfect. Could not get close to rocks but that was fine with me."}, {"username": "Andrea Arango", "comment_text": "Don’t cancel. Wait until you see how the water is at that time. I went on a boat tour early sept last year and the water and weather were perfect so it really depends on the day"}, {"username": "Elke Vandendriessche", "comment_text": "Cancel not … september could Be great - day by Day decission"}, {"username": "Julie Cowell Oglesby", "comment_text": "We went in June. The boat to Capri was a sit inside one and was covered. I felt a bit sea sick on that one, however the one back from Capri was the faster boat and you could sit upstairs and was open air. I Didn’t feel at all sick on this one. It seemed to cut through the waves rather than the up and down motion."}, {"username": "Joanne Diaz", "comment_text": "Our boat tour cancelled last Sept the day before because weather. We took the Ferry because weather looked good when we woke up. It was a PERFECT DAY"}, {"username": "Cindy Gallen Barton", "comment_text": "We did a boat tour last October, beautiful day sea not rough. And we took the small boat into the Blue Grotto. I sometimes have an issue so I took Bonine for motion sickness and had my sea bands on just in case"}, {"username": "Nathalie Reisman", "comment_text": "Who did you book your tour through? Is it better to do private or the ferry. I have heard the lines for the ferry can be very long."}, {"username": "Whitney Trick-Hector", "comment_text": "We did a private tour , thank gosh because I got so sick as soon as the boat stop and the captain let us swim in the water. We had to turn around an hour into the 4 hour tour."}, {"username": "Christie Lisk Rogers", "comment_text": "We are here now and many days tours have been cancelled. Seas are rough but each day has been different. Some tours off in morning and on in afternoon and Vice versa. Ferries have fun but they are not extremely smooth but okay."}, {"username": "Susan Evangelista", "comment_text": "We took the high speed ferry - indoor seating - this past July from Sorrento to Capri. It took about 30-35 minutes. Smooth waters, no problem. However, if you have a tendency to get sea sick, book a ferry with outdoor seating. We did that a few years ago, it might take longer but you won’t feel as seasick.\nEnjoy!! It’s a beautiful island!!"}, {"username": "Yvonne van Kempen", "comment_text": "Any good accomm tips in Sorrento please."}]}, {"id": "2208893276176417", "text": "Hello :) we are traveling to Venice and then Verona/Garda. On the 14th we will be in Verona or Garda lake for my birthday.\nCan you suggest something special to do in either location ? Something like a wine tasting, special visit, special events ?\nThank you 🤗", "link": "facebook.com/groups/1373361046396315/permalink/2208893276176417/", "likes": 0, "comments": [{"username": "Ike Simoncini", "comment_text": "i do have some realy realy good restaurants for you over there Here's my culinary wish list. We have been coming to bella italia for 13 years and I am a huge fan of culinary delights\nfirst one is right next to the hotel, 5 meters from the campsite\nhttp://\nwww.saligusta.it\n/home.html\nFish restaurant with owner from Sardinia great langoustines (scampi) < fried baby squid with zuccine and mussels in tomato sauce not expensive and children's playground next to it and afterwards you can roll to your mobile home 🙂\nmuch further away in sirmeone and quite expensive but the verry best in whole of garda lake\nhttps://\nwww.risorgimento\n-sirmione.com/\nen/home-2/\nhere we always eat crudite di mare (various types of raw fish) or insalata catlan (lobster salad that is freshly made at your table) in advance and as a main course sea bass or steak cooked in a salt crust absolutely fantastic for dessert, crepes suzette or zabayone are also freshly prepared at your table made in advance\n10 minutes driving on top of a mountain with a realy lovely view there is\nhttps://\nwww.agriturismo2\nlaghi.it/\nwhere paolo the cozy fat italian cook and his wife do everything order here the coteletta milanse (schnitzel) on the bone sliced thin really delicious\nfor a really lovely lunch there is\nhttps://\nwww.marcoedaniel\natime.it/\nits in peschiera they have realy lovely types of culattelo ham and cheeses and all kind of lunch the last one i will mention is in lasize and its a fish restaurant with a lovely wood oven https://\nwww.tavernaorest\ne.it/\ni hope you will enjoy some of these places they are realy ittalian restaurants and not like the many tourist traps for me food is verry important and as half sicilian i know whats real and what not\nif someone visits one of these places let me now if you enjoyed it"}, {"username": "Tanya Bitar", "comment_text": "If you love Amarine or Prosecco, ￼there is plenty of it in that area! ￼We had a private driver, for our Lake Garda experience. We went to smaller vineyards like Pilandro and C￼esari.\n\nIf you are looking for the best restaurant, hands down but is up within the hills (picture attached). Everything is made fresh and by the same family since they opened."}]}, {"id": "2208926612839750", "text": "Have you been to Isola d Elba? It looks lovely. I am sure there are boats that take you there from the mainland. How much time did you spend there?", "link": "facebook.com/groups/1373361046396315/permalink/2208926612839750/", "likes": 0, "comments": [{"username": "Scott Perry", "comment_text": "I decided to go to Elba in 2019 when I realized that one of my favorite Italian tv shows, I delitti del Barlume, was filmed in Marciana Marina. It’s an easy ferry ride from Piombino. I was there for a week and loved it."}, {"username": "Theresa Osterhaus Qualls", "comment_text": "We went there in June for 3 nights and loved it! Also took the ferry from Piombino and we rented a car on the island to get around."}, {"username": "Mike Ball", "comment_text": "Only did a day trip but we loved it and it’s a place we plan to return to for a longer stay ,\n\nFrom what I saw I’d most definitely recommend it."}, {"username": "Barba Ra", "comment_text": "It is beautiful Tuscan island with crystal clear sea and nice beaches. But don't go there in August... it is too crowdy"}]}, {"id": "2209000952832316", "text": "Just back from our trip. I posted already on Rome. Here is some info from our time in Florence.\n\nAccommodation: we booked an Airbnb in Santo Spirito and loved the neighborhood. Great restaurants, small shops, near Pitti Palace but not as touristy and busy as across the river. Loved our 2 bed 2 bath apartment.\n\nhttps://abnb.me/jfTpUF9e5Bb\n\nOn our first day we did a free 2 hour walking tour with Guru Walks, we tipped the guide $50 euros for the 3 of us. It was a great orientation to the history and sites to kick off our time in Florence. You can also book the guide we had directly, she was very knowledgeable and loved the history of Florence. storytellingflorence@gmail.com\n\nRestaurants and food:\nbest meal in Florence was at Oliviero on Via delle Terme, Loggia Rooftop Bar was lovely spot for drinks - book a reservation, Trattoria La Casalinga was very good as well.\nBest spots we found in Santa Spirito for reasonable priced breakfasts and espressos were Pitti Express Caffe and Pitti Bistrot & Bakery, for anyone needing closest thing to Starbucks and milk alternatives Ditta Artiginale Sprone was great and they had great pancakes but not a cheap spot.\nTuscan Taste Florence was a quaint wine shop that also had wine by glass and cheeses. The bakery at end of our street was very good - Forno Pintucci. The gelato close to the bakery was best we had in Florence- Gelateria Artigianale La Sorbetteria on Via Mazzetta.\n\nPitti Palace was amazing. Get ticket that includes gardens only if you are up for a hike but they are stunning. Try to go on day not too hot as palace is warm and gardens are also hot. You do not need to buy in advance.\n\nUffizi - daughters did a walk up to ticket window for 9am and had no issue getting in - was a Friday morning not sure if that mattered, we saw very long lines later in the day for ticket window.\n\nTransport - took train from Rome to Venice and grabbed a taxi at station. taxis easy and friendly. Husband also rented scooters regularly as they were everywhere to grab.\n\nWe took a taxi to and from Florence, 100 euros each way, to do the Tour and Tuscan snack at Frescobaldi. The snack was a delicious charcuterie and 3 glasses of wine in the formal dining room. Loved it.\n\nWe also went to Santa Maria Novella perfumeria. If you love soaps, scents, creams and perfume you must go. The store is stunning and they have been making scents since 1221.", "link": "facebook.com/groups/1373361046396315/permalink/2209000952832316/", "likes": 10, "comments": []}, {"id": "2209010862831325", "text": "Final post with learnings from our trip:\n\nWe purchased the USB fan from Amazon\nbased on someone’s suggestion in this group and glad we did. Provided extra cooling from night stand for me and white noise for my daughter.\nhttps://www.amazon.ca/Hertekdo-Electric-Desktop-Portable-Strong/dp/B07QQW9RGF/ref=asc_df_B07QQW9RGF/?tag=googlemobshop-20&linkCode=df0&hvadid=341833024969&hvpos=&hvnetw=g&hvrand=10251358720207135665&hvpone=&hvptwo=&hvqmt=&hvdev=m&hvdvcmdl=&hvlocint=&hvlocphy=9000857&hvtargid=pla-795517695834&psc=1\n\nThere is no Diet Coke to be found in Rome or Florence. I really like my Diet Coke and all they have is Coke Zero. Literally in 10 days I did not find it once.\n\nBring a water bottle. Rome has lots of the free flowing fountains and we found places to fill up in Florence.\n\nNo issues with pick pockets or feeling unsafe. Use common sense. Don’t dress dripping with jewelry or expensive bags in busy tourist areas.\n\nOnly place we had to show passport was at a store if we wanted them to do the VAT refund paperwork. Which they did and it made it super easy at airport.\n\nAmerican style drip coffee is non-existent. Americano with adding some milk closest to it.\nBring individual coffee packets like those from Starbucks so you can make your own in Airbnb if you want to have aome. Our 2 air bnbs only had nespresso machines and we could then only find americano or espresso pods.\n\nIf you want real gelato don’t eat the gelato piles in mounds. Real gelato is under covered metal lids as melting point is low. The stuff in view trying to entice you has more additives and more like a regular ice cream.\n\nDon’t be afraid to go to places that are not everywhere on social media. Italy has so many great museums, palazzos and galleries beyond the few being over promoted online which mean they are also very very busy.\n\nPls don’t litter. We saw so many tourists being disrespectful with littering. If you have to carry some garbage a bit before you find a waste can just carry it. Don’t leave it on window ledges or toss it to the ground.", "link": "facebook.com/groups/1373361046396315/permalink/2209010862831325/", "likes": 6, "comments": [{"username": "Lori Haines", "comment_text": "Is the voltage ok for italy? I keep reading how curling irons etc burn up if not dual voltage. Looks like it won't take up much room in luggage"}]}, {"id": "2209092382823173", "text": "Thank you for all the shares. Anyone have experience or opinion on the following Rome acommodations for adult fam 4.\nAir Bnb rental by Federicko\nVia Marco Aurelio, 22 Rome, Lazio Italy\n2. Penthouse with terrace:\nVicolo Paganica, 30, Rome, Metropolitan City of Rome, Italy\nPantheon 00186 Rome\n3. Pope’s window\nVia Delle Fornaci 44, Vaticano Prati, 00165 Rome, Italy", "link": "facebook.com/groups/1373361046396315/permalink/2209092382823173/", "likes": 0, "comments": []}, {"id": "2209138246151920", "text": "Is there an anti theft cell lanyard or carrier that you can suggest? Thanks in advance", "link": "facebook.com/groups/1373361046396315/permalink/2209138246151920/", "likes": 0, "comments": []}, {"id": "2209138666151878", "text": "Has anyone booked and/or done a semi private Colosseum tour with Livtours? Love to hear your thoughts…", "link": "facebook.com/groups/1373361046396315/permalink/2209138666151878/", "likes": 1, "comments": []}, {"id": "2209142392818172", "text": "Hi just seeing some photos of Venice flooded.. Wondering if anyone is there atm and if they can tell me is it true or not?", "link": "facebook.com/groups/1373361046396315/permalink/2209142392818172/", "likes": 6, "comments": [{"username": "Kristina Ruk", "comment_text": "Flood ussually in November, December so you might seen those photos"}, {"username": "Carlotta Crespi", "comment_text": "Just small high tides, not \"floods\".. worse case scenario you will get your feet wet in San Marco square"}, {"username": "Stacey Cohen Sturner", "comment_text": "Currently in Venice and can confirm standing water from the past weekend's rain has already cleared. Weather here is perfect."}, {"username": "Devon Grandi Powell", "comment_text": "St marks was flooded on Saturday but I think it has cleared"}, {"username": "Jenny Godfrey", "comment_text": "Here now and St Marks has been flooded usually only for an hour or two a day at lunch time."}, {"username": "Melissa Vocke", "comment_text": "Here now. No flooding anywhere in Venice!"}, {"username": "Danielle Encheff Blunt", "comment_text": "It’s a rarity at this time of year but the tides were high and coming over some of the areas next to the canals and st marks square was flooding every afternoon"}, {"username": "Sabrina Marie", "comment_text": "Yesterday"}, {"username": "Sabrina Marie", "comment_text": "Just random little sidewalks flooded"}, {"username": "Phil Higginbottom", "comment_text": "Just on our way back to Florence on the FrecciaRossa 1000 from a lovely day trip to Venice and we saw no signs of flooding. Enjoy!👍"}, {"username": "Chelsea Clough", "comment_text": "Was there on the 6th and some streets were flooding due to the high tide in the afternoon but nothing horrible!"}, {"username": "Kiana Cathy-Ann Strong", "comment_text": "I went less than 2 weeks ago. Towards the evening the tide began to rise which led to the main area to flood a little. But it was fine all day and only a bit of water pooling in certain areas"}, {"username": "Gift Choopongthanet", "comment_text": "2 days ago from high tide and after rain but a bit quick dry"}, {"username": "Michelle Leclair Walker", "comment_text": "Some Flooding is expected. This was in July 2018."}, {"username": "Carol Taylor Tisdale", "comment_text": "It happens. It’s ok. 🙂"}]}, {"id": "2209151542817257", "text": "Where did everyone book their accommodation? We booked our flights separately. Air BbB, VBO any others out there?? Leaving in 1 1/2 month just starting to plan😱😱", "link": "facebook.com/groups/1373361046396315/permalink/2209151542817257/", "likes": 1, "comments": [{"username": "Kristina Ruk", "comment_text": "I use booking com..if I have time check price with the hotel, sometimes its cheaper, but as I have genius level 3 sometimes cheaper in booking"}, {"username": "Jenn Messina Babore", "comment_text": "We booked direct with the apartment owners than through Airbnb, VRBO, or Booking."}, {"username": "Mike Guarini", "comment_text": "Booking seems to have hotels and apartments good mix to choose from."}, {"username": "Mat PO", "comment_text": "Virtuoso travel agent or Leading Hotels of the World."}, {"username": "Miyuki Kanno Paul", "comment_text": "I use Google Map to get some ideas. Then I use booking_dot_com\nfor location/\nprice research followed by google to find the accommodation’s official website and see if booking is available directly. Some accommodations only use the booking site for everything.\n\nAirbnb and VRBO can be useful but really hit or miss. It has become an apartment rental sites. Often owners are living abroad(in my case they were in Switzerland and Germany) and communications are via WhatsApp. Most locations have no parking, by the way. Read enough comments and photos of the property before making selections.\n\nWhen we have a car, we look into agriturismo. It’s run by agricultural entities and have lodging services as their supplemental income. It is located in rural areas. It’s more like B&B. Some agriturismo offer either “half board” or “full board” dining options. We stayed at agriturismo in various locations such as Alberobello, Montalcino, Santa Venerina, etc.\n\nWhen you do research, you will get to know the areas very well. Knowledge is power!"}, {"username": "Jackie Gotelli", "comment_text": "I always use airbnb! I create a wishlist for the different cities I plan to visit with the dates I’ll be there. I add all potential airbnb accommodations that I like into that cities “wishlist” and then I use the wishlist map to narrow the list down even more based on proximity to city center, transportation,\netc. until I’ve chosen the exact place to book."}, {"username": "Susan Ramirez", "comment_text": "I did a mix of Airbnb and hotels. Rome, Florence and Venice are Airbnb… Paris and London are hotels."}, {"username": "Sam Mah", "comment_text": "We used booking dot com. First we checked ratings and reviews, then ease of access to major attractions and transport. Then we checked to see if we could book directly with the accommodation provider for less. Most of the apartments we got, could not be found with a simple search in google so we usually went through bookings. Most of the hotels ended up being cheaper through bookings for us as we got up to genius 3 level which gives us discounts."}]}, {"id": "2209161806149564", "text": "⚽️ ciao ! considering attending an Italian League soccer game whilst in Italy next April . Any ideas on how to book tickets for a game? Thanks in advance .", "link": "facebook.com/groups/1373361046396315/permalink/2209161806149564/", "likes": 0, "comments": [{"username": "Nicki Herzog", "comment_text": "most event tickets in Italy are through Vivaticket, but I don't think you'll be able to buy yet for next April."}]}, {"id": "2209162949482783", "text": "Heading to Sorrento and Ischia in October. Looking for a decent place to stay, that’s not terribly expensive. Any tour company ideas for day trips?", "link": "facebook.com/groups/1373361046396315/permalink/2209162949482783/", "likes": 2, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.kqzyfj.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187782-d2445\n04-Reviews-Gran\nd_Hotel_Aminta-\nSorrento_Provin\nce_of_Naples_Ca\nmpania.html"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g580214-d2527\n41-Reviews-Hote\nl_Villa_Durruel\ni_Resort_Spa-Is\nchia_Isola_d_Is\nchia_Province_o\nf_Naples_Campan\nia.html ischia"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Sorrento/\nAmalfi-Coast-Day\n-Trip-from-Sorr\nento/\nd947-6530AMALFI?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}, {"username": "Nancy Katchmar", "comment_text": "Great hotel in Ischia. Very reasonable."}, {"username": "Kally Trahearn", "comment_text": "Hotel Plaza Sorrento is very reasonably priced and great location. Lovely hotel."}, {"username": "Louise Inglis", "comment_text": "Parco de General Forio Ischia"}, {"username": "Darla Ehrhard", "comment_text": "https://\nwww.torresantang\nelo.com/\n\nThis is in Ischia, a very friendly, helpful and family owned place."}, {"username": "Robin Barbera", "comment_text": "Grand Hotel De la Villa.. Beautiful hotel, unbelievable breakfast and nice restaurant for dinner"}, {"username": "Nancy Fricke Corsi", "comment_text": "In Sorrento check out Palazzo Jannuzzi Relais. Absolutely beautiful."}, {"username": "Geoff Roush", "comment_text": "Imperial Hotel Tramontano Sorrento"}, {"username": "Ερασμία Γκαρή", "comment_text": "Posidonia Residence ,Ischia."}]}, {"id": "2209195086146236", "text": "My family and I moved to northern Italy back in December. Now that fall is approaching, we are looking to go camping. Does anyone have any favorite camp sites. We don’t mind tent camping either.. Michigan born and raised. Somewhere in the Dolomites region — near Alpe di Siusi would be amazing. Our boys are 12 and 8. 🌲🪵🍂", "link": "facebook.com/groups/1373361046396315/permalink/2209195086146236/", "likes": 2, "comments": [{"username": "Ike Simoncini", "comment_text": "Toscane is lovely and this camping is realy nice https://\nnorcenni.huopena\nir.com/"}, {"username": "Chelsea Gudith", "comment_text": "I don’t have any suggestions, but I’d love to hear more about your move… Michigan girl here, interested in eventually making that move, one day."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2209213626144382", "text": "Please help! Just how busy is free day at the Colosseum? We are only in Rome for 2 full days - one being 1 October 2023. Would you suggest the free day line or booking for the next day?", "link": "facebook.com/groups/1373361046396315/permalink/2209213626144382/", "likes": 1, "comments": [{"username": "Anastasia Elmova", "comment_text": "If you are only in Rome for 2 days, I'd suggest paying for the ticket, lines on free days are insane, you don't want to spend several hours waiting in line"}, {"username": "Costero Home", "comment_text": "Its incredibly busy, buy a ticket instead."}, {"username": "Miyuki Kanno Paul", "comment_text": "Massive madness!"}]}, {"id": "2209215429477535", "text": "Is it a requirement to be up to date on covid vaccinations in order to enter Italy? Do you need to provide proof of vaccination at the airport?", "link": "facebook.com/groups/1373361046396315/permalink/2209215429477535/", "likes": 0, "comments": [{"username": "Barbara McArthur", "comment_text": "I though they had dropped the covid vaccine card as its not an emergency now so who changed it all end of last year."}, {"username": "Emma Whiting", "comment_text": "No to both questions"}, {"username": "Bambi Harris", "comment_text": "no but for traveling to any country it helps to look at their government website for any updates/\nrequirements. Have a great trip!"}, {"username": "Jenn Messina Babore", "comment_text": "No proof required."}, {"username": "Randy Karli", "comment_text": "No"}, {"username": "Liina Vaina Salanoviciene", "comment_text": "No"}, {"username": "Jeanne Eliason", "comment_text": "We still have copied on our phone of CDC white card, from US. Just in case. We were there last in May this year and the answer for that time is No."}, {"username": "Christie Grant", "comment_text": "Just did 7 counties including Italy and definitely NO"}, {"username": "Eric Lange", "comment_text": "Nope"}, {"username": "Murphy Aileen", "comment_text": "No thank goodness"}]}, {"id": "2209236672808744", "text": "Italia Arezzo", "link": "facebook.com/groups/1373361046396315/permalink/2209236672808744/", "likes": 124, "comments": [{"username": "Nadia Mckenna", "comment_text": "Your photos are spectacular"}, {"username": "Baruch Lerman", "comment_text": "Thank you ❤️❤️❤️"}, {"username": "Mary Spizzirri", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Lois Letterie Cianci", "comment_text": "Absolutely stunning!"}, {"username": "Jeanne Eliason", "comment_text": "I love Arrezo. We have our favorite restaurant and go back every year."}, {"username": "Jack Partington", "comment_text": "Been there! It's beautiful!"}, {"username": "Janeen Penner", "comment_text": "We loved Arezzo and look forward to seeing it again!"}, {"username": "Leslie Feuer Orton", "comment_text": "Beautiful, both the place and the photos"}, {"username": "Sally Begaud", "comment_text": "Great pics ! I’m going there next year - any accommodation recommendations\n? 🙏🏽"}]}, {"id": "2209237039475374", "text": "Italia Venezia", "link": "facebook.com/groups/1373361046396315/permalink/2209237039475374/", "likes": 75, "comments": [{"username": "Helen Stokes", "comment_text": "Beautiful photos"}, {"username": "Baruch Lerman", "comment_text": "Thank you!! 🥰"}, {"username": "MaryLou Capobianco", "comment_text": "Thank you for sharing!"}, {"username": "Karin Carmignani", "comment_text": "Stunning pictures!"}, {"username": "Sofia Lucia", "comment_text": "Belleza !!"}, {"username": "Amy Lesslie", "comment_text": "Fabulous photos 🤩"}]}, {"id": "2209247806140964", "text": "Hi,\nAre there any Jewish Bakery’s and shops in Florence please? I know there’s Ruth’s for a proper meal.\nThank you ❤️", "link": "facebook.com/groups/1373361046396315/permalink/2209247806140964/", "likes": 1, "comments": [{"username": "Jenn Messina Babore", "comment_text": "If you Google totallyjewishtr\navel they have a listing of 7 places in Florence that are kosher, including Ruth’s."}]}, {"id": "2209249662807445", "text": "Looking to do about 10 days in Italy late Oct early November. We have done the big cities and are considering.\n- Couple days in Venice.\n- Then off to bologna (with time in verona/padua)\n-and then either lake garda or lake como.\n\nAdditions or subtraction? Love food wine architecture museums and slower pace trip", "link": "facebook.com/groups/1373361046396315/permalink/2209249662807445/", "likes": 0, "comments": []}, {"id": "2209249926140752", "text": "Anyone with missing luggage eventually had it returned?\n\nWe flew from Manchester to Geneva and then Geneva to Rome on the 31st July. I had my luggage in Geneva and then checked it back in. It didn’t arrive in Rome.\n\n5 days later I got an email from Rome to say my suitcase had arrived and was ready to collect so we travelled back from Florence to collect it. They couldn’t find it!! I’ve had no information since,just that they’re looking for it.\n\nWe come home on the 10th. I’m not expecting it back by then just hope I eventually have it returned", "link": "facebook.com/groups/1373361046396315/permalink/2209249926140752/", "likes": 1, "comments": [{"username": "Laura Smith-Pursel", "comment_text": "It took 3 weeks for us to get our bag after it was lost. We wandered around the airport, after being told it wasn’t there, and found it on our own. Three days later we got an email saying they had the bag…clearly their systems aren’t the best. If you can, wander around the airport (if you’re in the area) near baggage claim."}]}, {"id": "2209252876140457", "text": "Planning my walking tour for Milan. Any suggestions for dinner? Authentic, casual and delicious... will probably be near Castello Sforzesco (Vigevano). Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2209252876140457/", "likes": 0, "comments": []}, {"id": "2209140889484989", "text": "Sicily to Amalfi (Sorrento) ferry or fly?? Family of 5, kids aged 13,10 & 7.\nAdvice please", "link": "facebook.com/groups/1373361046396315/permalink/2209140889484989/", "likes": 2, "comments": [{"username": "Maria LoSurdo", "comment_text": "Leaving from where in Sicily? 🇮🇹❤️😊"}, {"username": "Gabriele Fordini Sonni", "comment_text": "Travel times will change alot depending on where you start in Sicily, it's not really a small place. If you're near palermo the plane might be worth it"}, {"username": "Miyuki Kanno Paul", "comment_text": "Overnight ferry runs between Palermo and Napoli. Then hop on another local ferry to Sorrento. Overnight ferry doesn’t have weight restrictions on your luggage. No crazy security screening. You roll your suitcase/\ncarry on luggage to your room and you are set! It’s not a fancy cruise ship, but it is a fun experience after all. We took an overnight ferry from Napoli to Palermo instead of flying. Spent 3 nights and picked up a rental as we were leaving Palermo. Counterclockwise road trip all the way to Taormina, returned the car in Catania and flew back to the mainland(FCO Roma). Two weeks of Sicilia barely scratched the surface. We will return for another weeks in the future"}]}, {"id": "2209135382818873", "text": "Anyone travelled from Venice to Venice Treviso airport who’s able to recommend the best way to get there? We’re a group of 4.\n\nThanks ☺️", "link": "facebook.com/groups/1373361046396315/permalink/2209135382818873/", "likes": 3, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Venice/\nVenice-Private-T\nransfer-Hotel-P\nort-Venice-or-T\nreviso-Airport-\nMestre-TrainSt/\nd522-71989P29?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "Fiona Pimm", "comment_text": "There is a standard water bus. I can’t remember the number but it is very easy to find on the main pier just next to St Mark’s Square."}, {"username": "Karen Doblo", "comment_text": "Get the Rome 2 Rio app. It gives you options, prices and times."}, {"username": "Louis Des Forges", "comment_text": "There is a bus going to Piazzale Roma, download the timetable there 12€ one way €22.\nhttps://\nwww.atvo.it/\nindex.php?lingua\n=en&area=menust\nandard&idpadre=\n25&idmenu=25&ri\ncerca&destinazi\none=treviso+can\nova+airport|treviso%20airp\nort|aeroporto%2\n0di%20treviso"}, {"username": "David Fidgeon", "comment_text": "There’s 4 of you plus luggage, relax and take a taxi !"}, {"username": "Jack Danson", "comment_text": "ATVO bus service - we found it prompt and reliable!"}, {"username": "Carlotta Crespi", "comment_text": "There is a bus from Piazzale Roma to Treviso Airport , and back"}, {"username": "Esther Starren", "comment_text": "There are busses from venice and mestre to treviso airport: atvo and ryanair"}, {"username": "Heather Hills Jacobs", "comment_text": "We used Venice Group Services for our transfers .. they were awesome ..very reliable!!"}, {"username": "Achim Marke", "comment_text": "There are busses"}, {"username": "Karla Danielle Heywood", "comment_text": "we paid for a coach transfer was about £6"}, {"username": "Andrea Thompson", "comment_text": "We booked bus when we booked flights with Ryanair"}, {"username": "Dana Colantuono", "comment_text": "Train and then bus"}, {"username": "Federico Permutti", "comment_text": "As someone mentioned, the ATVO coach is your best option. Timetable here: https://\nwww.atvo.it/\nallegati/\naeroporti/\nlinea_351_-_vene\nzia_treviso.pdf\n\nYou can buy tickets online here: https://\necommerce.atvo.i\nt/ecommerce-fe/\n?idNegozio=6\n\nAlternatively, you can buy them from the ATVO ticket office or even the newsstand/\nkiosk at Piazzale Roma (useful e.g. if you’re leaving very early in the morning and the ticket office is still closed).\n\nI’ve marked the ticket office in red, the kiosk in purple, and the bus stop in orange in the attached screenshot."}, {"username": "Dennis Schlegelmilch", "comment_text": "Get the trenitalia app. There's a convenient and affordable connection by bus and train. Easy to book through the app"}]}, {"id": "2209116612820750", "text": "Any recommendations on best places to visit in Italy at the end of Dec/Jan (winter) Thinking of spending 2-3 weeks there. Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2209116612820750/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "follow us https://\nnextstop-italy.c\nom/\nvirtual-tours/\nbest-of-sicily/"}]}, {"id": "2209097686155976", "text": "My question is what has everyone found most useful?\nI want to download one only!\nRome2rio\nOmio or man in seat 61?\nCheers", "link": "facebook.com/groups/1373361046396315/permalink/2209097686155976/", "likes": 1, "comments": [{"username": "Jenn Messina Babore", "comment_text": "What are you using the app for? I believe Omio and 61 are for trains only. Rome2Rio lists all transportation options with some links to taxi and trains as well as time it takes to get a place based on the mode of transportation.\nIf you want a train app, I’d use TrenItalia as the direct train app."}, {"username": "Diana Hesse", "comment_text": "Rome2Rio and the man in seat 61 are the ones be used most. There weren’t apps for everything when I started traveling Europe. I’d already traveled to many places before I started in Europe without apps, guidebooks or maps."}, {"username": "Susannah Hart", "comment_text": "R2R"}, {"username": "Karen Blackmore", "comment_text": "I didn't like Rome2Rio, came up with some ridiculous routes! For trains the trainline was great as covers all options."}, {"username": "Bridget Gieseke", "comment_text": "I found Rome2Rio super useful when figuring out travel options between cities. Not only is is it for trains, but all other transportation options and an estimate of the cost."}, {"username": "Jaime Cleek", "comment_text": "None of those. I downloaded the apps for the train that I booked from the company"}]}, {"id": "2209086449490433", "text": "Dolomites question: for those that have rented a car any recommendations on the type of car to get? and who did you rent through?", "link": "facebook.com/groups/1373361046396315/permalink/2209086449490433/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "you can rent a panda or fiat 500 x ( small streets) here you can find the best offers https://\nwww.discovercars\n.com/\n?a_aid=NextStop-\nItaly look at hertz or noleggiare"}, {"username": "Cathy McDonald", "comment_text": "Following Would love to know this too"}, {"username": "Costero Home", "comment_text": "Depending on how many people you are, always go small or midsize and if you are from the US or Canada, reserve an automatic. https://\nwww.rentalcars.c\nom/"}, {"username": "Stephen Henn", "comment_text": "I rented a Fiat 500 for the Dolomites. If you’re not comfortable driving a manual shift on steep inclines with sharp curves then you should be sure to rent an automatic shift. Smaller cars are easier on narrow curvy roads. We rented from Hertz through AutoEurope.com. Video the outside of your car at pick up and drop off so you have proof of its condition should issues arise later. Watch for speed cameras as even small villages have them as do all expressways."}]}, {"id": "2209081196157625", "text": "Looking at flights from the US with layovers in Paris-CDG. Would we go through passport control/customs upon arrival in CDG, then again in Italy? For the return flight, would we only go through it once we land back in the US? Trying to plan how much time we need for layovers. Thanks in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2209081196157625/", "likes": 2, "comments": [{"username": "Stephen Henn", "comment_text": "You will go through passport control in Paris, the first Schengen country you enter. Once you return to the US you will go through Customs at the first airport you arrive to. We didn’t go through Customs upon arrival in Italy."}, {"username": "Beth Searight Millar", "comment_text": "Make sure you have lots of time in CDG if you have to switch planes - it is a zoo and can take a long time to get from one terminal to another"}, {"username": "Sarah Pierce", "comment_text": "How about an hour and 20 minute layover at CDG? 😬"}, {"username": "Rip Lonergan", "comment_text": "There is really no rhyme or reason to it but I have been in passport control lines over an hour long at CDG. Just my opinion, I think anything less than two hours when transiting. CDG ￼ is risky, especially with a Terminal change involved. I believe you will find that once you have cleared passport control, upon arriving at a Schengen country, it will not be necessary when traveling to another EU country. THE BIGGEST CHALLENGE REALLY IS THE INCONSISTENCY OF THE PROCESS AT CHARLES DE GAULLE. ￼"}, {"username": "Liette Loiselle", "comment_text": "Flew SEA-CDG-FLR.\nWe had to redo a security check + passport control at CDG. There was a decent line at security.\nThen at FLR, just need to collect luggage and we were done."}, {"username": "Cheri Siener Steen", "comment_text": "We just flew out of Charles de gualle last Tuesday. The line for passport control was almost 2 hours long. We literally almost missed our flight. They held it late which is the only reason we made it. It was a zoo."}, {"username": "Mandy Aycock Jackson", "comment_text": "I would try to stay away from CDG if at all possible. Lol. We had a 3 hour layover and it was barely enough time. Coming back through was equally horrible. We swore to never go through that airport again. 😂"}, {"username": "Joe Visotski", "comment_text": "This is so helpful, how about Amsterdam, how long does it typically take to go through customs there ?\nWe are flying from Boston to Venice and can either stop in Paris or Amsterdam\nTIA"}, {"username": "Ann Brahmani Bost", "comment_text": "That’s why I only fly direct now."}, {"username": "Jules Blumke", "comment_text": "Avoid Paris if you can. It's chaos. Very slow and unorganized. If you have to go there plan on at least 3 hours."}, {"username": "Steve Grossman", "comment_text": "You go through in paris you don't have any choice. There's nothing to go through in Italy. Once you're in an EU country, you can keep going to all the other countries without any paperwork."}, {"username": "Steve Grossman", "comment_text": "That's plenty of time as long as you get on the move and don't futz around"}, {"username": "Marie Payne", "comment_text": "took me 2 hours the last time ...at the CDG airport you have to go to a different terminal to fly to Italy or Greece and you have to go thru control ..."}, {"username": "Andrea Pugliese Salvato", "comment_text": "I had a flight out of JFK NY to Naples with 90 minute layover in Paris. We were delayed departing in NY 1 hour …yes we had to go thru customs ..took so\nLong we missed our flight. Next flight was 4 hrs later. So definitely make a layover at least 2 1/2 hrs …you need it CDG is a huge airport …funny my luggage got to Naples way ahead of me"}, {"username": "MaeLeigh Cf Cervantes", "comment_text": "Only upon entry into Schengen. After that you move freely."}, {"username": "Patricia Spinney Loranger", "comment_text": "Check with your airline."}, {"username": "Patricia Spinney Loranger", "comment_text": "Check with your airline."}, {"username": "Noelene Cameron", "comment_text": "Immigration passport control will only be in CDG if this is your first arrival point into Europe. If you are on the one ticket from US through to Italy, your checked baggage will go through to the Italy destination and you will go through customs there but not immigration passport control. When you check in at your US departure airport, clarify that your checked luggage is checked through to Italy destination.\nCDG is big so ensure you have plenty of time to transfer to your next plane. I would not want less than 2 and 1/2 hours, probably 3 minimum."}, {"username": "Ian Beyer", "comment_text": "You go through passport control only once when entering Schengen."}, {"username": "David Mensi", "comment_text": "Does having global entry save any time?"}, {"username": "Charlene Noll", "comment_text": "First airport entry to EU is where u go thru customs. CDG u also go thru security again. Just flew thru there both ways. Both times had over an hour flight delayed so was glad I originally had a 3 hour layover, was running to my connection, got to gate as they were boarding."}, {"username": "David King", "comment_text": "Why do a layover in CDG???? UGH… pick another city.\n\nWe frequently fly Turkish Air from the US to Europe. We depart from DC…\n\nYes there’s a long layover in Istanbul, but we maximize that as a “bonus day” to have lunch in Sultanahmet (the old city) and our bags remain checked all the way through to our European destination."}, {"username": "Shannon Pacheco Modin", "comment_text": "Our travel agent agent booked us SFO direct to Frankfurt. The Lay over is only 90 minutes until we board to Rome. Hopefully enough time"}, {"username": "Leslie Goodland", "comment_text": "I took the train from Paris to Milan. It was terrific."}]}, {"id": "2209077446158000", "text": "Is it possible to see Val d’Orcia, San Gimignano, and Siena in a day from Florence? Will be with kids and the other adult doesn’t drink, so we won’t be lingering at wineries. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2209077446158000/", "likes": 3, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "yes https://\nwww.viator.com/\ntours/Florence/\nFrom-Florence-Sa\nn-Gimignano-and\n-Siena-Full-Day\n-Tour/\nd519-160271P9?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "La Cinzia", "comment_text": "Se vuoi stare solo in auto e non vedere nulla si..."}, {"username": "Costero Home", "comment_text": "Yes but it will be rushed."}, {"username": "Yuko Y Smith", "comment_text": "I did the same itinerary in one day. If you rental car, It possible. But my Siena stay was rush."}, {"username": "Molly Roberts Siegenthaler", "comment_text": "WAY too much. Take your time and enjoy"}, {"username": "Miyuki Kanno Paul", "comment_text": "It’s a lot of driving in a day that your kids may get bored"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "You can do Siena and San Gimignano on day, Val d’Orcia another one. All together it will be way too much."}, {"username": "Laura Piccinini", "comment_text": "Way too much!!!!"}]}, {"id": "2208266302905781", "text": "Sorento or Amalfi?", "link": "facebook.com/groups/1373361046396315/permalink/2208266302905781/", "likes": 2, "comments": [{"username": "Diana Ioannou", "comment_text": "Both😜"}, {"username": "Daniele Peretti", "comment_text": "Sorrento!"}, {"username": "BatEl Kogman", "comment_text": "Why not both"}, {"username": "Leanne Rynne", "comment_text": "Sorrento but visit Almalfi"}, {"username": "Atiporn Vinaikosol", "comment_text": "I visited both and fell in love Sorrento."}, {"username": "Ken Vecchia", "comment_text": "Venice"}, {"username": "Amy French Baillie", "comment_text": "Sorrento is great as a base for day trips"}, {"username": "Anthony Taylor", "comment_text": "Sorrento.I was disappointed with amalfi.Positano\n,Capri and REVELLO were nicer"}, {"username": "Sandy Radican Shikaly", "comment_text": "Sorrento with day trips to Positano and Amalfi"}, {"username": "Geoff Roush", "comment_text": "Sorrento Imperial Hotel Tramontano Sorrento"}, {"username": "Antonio Aloè", "comment_text": "\"Sorento\" only exists in your phantasy..🤭"}, {"username": "Phyllis Waring", "comment_text": "Both!!"}, {"username": "Mary Lynn Austin Mang", "comment_text": "Amalfi doesn’t have much. Sorrento has everything!"}, {"username": "Laura DeCicco", "comment_text": "Amalfi ONE L not before the M"}, {"username": "Natalee Turpin", "comment_text": "We are staying in Sorrento and doing day boat tours to Capri and another day to Ravello and Amalfi. Can’t wait for October!"}, {"username": "Wahab Sidharta", "comment_text": "Stay in Sorrento, Day trip to Amalfi, Positano & Capri by Ferry."}, {"username": "Jodi Engelmann Mann", "comment_text": "Thank you."}, {"username": "Jean Bennett O'Reilly", "comment_text": "Stay in Sorrento and visit Amalfi and other Amalfi towns."}, {"username": "Mark DeFranco", "comment_text": "Go to Amalfi to take the bus to Ravello. Ravello is beautiful"}, {"username": "Elpida Ioulianou", "comment_text": "Stay in Sorrento and visit Positano and Capri by Ferry"}, {"username": "Dina Garrett", "comment_text": "Linda Williams, Julie Franco Mellow"}, {"username": "Glenn Todd Webb", "comment_text": "Amalfi for the cathedral. But Ravello is better than either."}]}, {"id": "2209073206158424", "text": "Why are people staying in sorrento instead of Salerno ??", "link": "facebook.com/groups/1373361046396315/permalink/2209073206158424/", "likes": 101, "comments": [{"username": "S.P. Espy", "comment_text": "Salerno is not as glamorous, and is not the Amalfi Coast, but I liked it. Seems real. Has plenty of good little restaurants and what appeared to be a pretty vibrant nightlife. And it’s not overloaded with tourists. It also has a huge beach and you don’t have to hike up and down a 1000 ft to get morning coffee."}, {"username": "Grant Smith", "comment_text": "Yhey obviously don't know that you Michael Smith and Ollie Witkowski are in town🤣"}, {"username": "Greg Mills", "comment_text": "Have you BEEN to Salerno?"}, {"username": "Caroline Waters", "comment_text": "Cos I love it there!"}, {"username": "Lee-Ann Paterson", "comment_text": "I’ll be staying in Salerno I’m a couple of weeks. So much more affordable, easy to access and close to the Amalfi Coast. We are taking the ferry to Sorrento for a day trip."}, {"username": "Geoff Roush", "comment_text": "Best place to get to Capri from and it's amazing. Better sunset I think"}, {"username": "Lorena Scopelliti", "comment_text": "Same reason why they stay in Capri and not in Carpi, I guess."}, {"username": "Anthony Campanella", "comment_text": "They chose lemons over inlaid boxes???"}, {"username": "Helen McCauley", "comment_text": "Salerno is fab I'm definitely going back 😎😎"}, {"username": "Dyn Walker", "comment_text": "Sorrento is guess is more accessible to the other islands. We stayed in Sorrento and it’s awesome!!!"}, {"username": "Kerrianne Morris", "comment_text": "Steven Trembath"}, {"username": "Michelle Plutto", "comment_text": "Conca park hotel"}, {"username": "Dubravka Škurla", "comment_text": "Agree I stayed in Salerno last june and it was a Bingo! We rent a scooter to visit Amalfi.\nThen stayed at Napoli, taking ferry to Capri and turn back to Sorrento on dinner. By train to Napoli."}, {"username": "Etienne Jean", "comment_text": "Stayed in both places. From my experience, Sorrento is more for shopping and restaurants. Salerno is very much less touristy and more \"Italian\". If you intend to visit Positano, Capri and other places along the Amalfi coast, I find it easier from Salerno. We loved both places."}, {"username": "Alexandria Forte-Nijssen", "comment_text": "Stayed at the Parco di Principi in Sorrento; amazing!"}, {"username": "Deborah Bird-walters", "comment_text": "Sarah Brown"}, {"username": "Lilia Sharff", "comment_text": "I stayed there because I could not find a decently priced hotel in Sorrento and then from there I went to Amalfi because at the time I went there Positano was so full and so overpriced… and Salerno and Amalfi didn’t disappoint, great cities, great food, great people, less crowds. We still made our way to Positano and Sorrento but next time I visit the Amalfi coast I’ll consider these towns again ❤️"}, {"username": "Patti Daggett", "comment_text": "I personally just love Sorrento. We had so many exceptional experiences there. ❤️"}, {"username": "Sylvia Knoop", "comment_text": "I preferred Sorrento"}, {"username": "Kathy Camilli Jackson", "comment_text": "We are going in September for a month and here is why we chose Salerno.\n\nWe want to experience Italy where the people live vs a tourist town\n\nTo rent a bigger beautiful apartment in Salerno it’s half the cost of staying in Sorrento\n\nYou can take the fast train from Rome and be at our destination instead of taking multiple transportation to get to our home base\n\nInstead of just spending time on the coast we can take trips to Puglia, Sicily ect. With Salerno being a transportation hub you can get wherever we want to go easily\n\nWe plan on grocery shopping and eating at the apartment on the days where not traveling and the cost of everything is more reasonable\n\nJust my opinion. No matter where you stay it’s still going to be a beautiful trip."}, {"username": "Vicki Palmer-Boer", "comment_text": "We did not like Salerno at all. Dirty city. Nothing much to do. Sorrento is amazing."}, {"username": "Beverly Halliwell-Ross", "comment_text": "Sorrento is one of the most beautiful cities on earth!"}, {"username": "Alia El Beheiry", "comment_text": "I stayed in both and that's my take:\nSalerno is definitely more authentic, cheaper, less touristy and nice long beach..\nSalerno is closer to the other side of the amalfi towns (vietri sul mare, minori..etc)\nSorrento is beautiful, more vibrant and closer to positano, capri and amalfi town\nSo my recommendation is to split ur stay between salerno and Sorrento to get the best of both..both are sure worth it"}, {"username": "Debra Kingston", "comment_text": "Sorrento has a nice authentic shopping area w cobbled stone streets. Good restaurants, gift shops, travel agent shops, butcher shop to get food or a sandwich. It has a fishing boat village and is lovely. Easy travel to positano, amalfi and Capri."}, {"username": "Tarah-Lee Cotie", "comment_text": "Salerno is excellent!"}, {"username": "Sue Policicchio", "comment_text": "Domenic Policicchio III\nAngelo Policicchio"}, {"username": "Tessa Hanks", "comment_text": "Dusty McKenna Eckmann"}, {"username": "Jill Reid Hall", "comment_text": "We stayed in Salerno last October, it’s easy to get the ferry to the Amalfi coast or buses. Train station is easily accessible."}, {"username": "Mimmo Buono", "comment_text": "Stay in Salerno. I will be better in Sorrento🤣"}, {"username": "Elizabeth Villarreal", "comment_text": "Eduardo Moreno"}, {"username": "Tomas Krivanek", "comment_text": "Well i passed thru by 🚗 and i remember many women looking like prostitutes around the train station at midnight😉😉😉🇮🇹🇮🇹🇮🇹"}, {"username": "Suzy Coler", "comment_text": "Sorrento has gotten way too touristy and crowded. It used to be a great place, but those days are gone; I am permanently gone from there too…so many beautiful places around the Med, Adriatic, including Dolomites/\nSicily❤️"}, {"username": "Jeanne Hannivig-jones", "comment_text": "Try ponza"}, {"username": "Giselle Veltri", "comment_text": "Hotel Jacarino, Sant’Agata"}, {"username": "Lisa Rizzo Ozmon", "comment_text": "So would this be an amalfi coast home base??"}, {"username": "Esther Newcombe Mahon", "comment_text": "We are going to stay I'm both"}, {"username": "Anita Couto", "comment_text": "You will live it. We left today. Was there for four nights."}, {"username": "Jerasol Winstead", "comment_text": "Sorrento is perfectly located on the Amalfi coast, Clean, pleasant people, affordable, good weather And good food. This was our experienced last week We were there 5 days July 24th til 29th. We love it And planning to visit again."}, {"username": "Lena Larsson", "comment_text": "Se stayed in Salerno. It was great."}, {"username": "Enrico Lecce", "comment_text": "It's cheaper"}, {"username": "Pattie D Taylor", "comment_text": "Let’s just say we booked a hotel in Salerno online and never stayed the night. It’s in the industrial zone! And the hotel had security walls around it. Booked a hotel in Sorrento while in the parking lot of that Salerno hotel. No regrets. Sorrento is beautiful, clean and yes, touristy but for a reason. Took a ferry to Capri from there. My husband and I still laugh about our Salerno Hotel experience to this day-how online booking doesn’t always look like the pictures/place in real life!!"}, {"username": "Monica Marzari-Hailey", "comment_text": "Because Salerno is way out there 🤣🤣🤣 You are closer to everything in Sorrento"}, {"username": "Debra Rabin Tillis", "comment_text": "We stayed in Vico Equense just north of Sorrento. Airbnb was perfect"}, {"username": "Debra Rabin Tillis", "comment_text": "I think that the best and most exciting thing about travel is the exploration of places that you find on your own. I spent time in Vico Equense at an Airbnb. It was such an awesome experience finding local restaurants and taking in the chill of the town"}, {"username": "Nadezh Da", "comment_text": "I have stayed in Sorento only. It is a modern city with a lot of restaurants. Also, it is convenient, and there are ferries to Capri, Amalfi, and Positano. In addition, you can take the train to Naples."}, {"username": "Ann Law", "comment_text": "It’s a lot prettier and you have the Amalfi Coast and Capri."}, {"username": "Adele Mazoudier", "comment_text": "Loved Salerno. Authentic, quieter, ferry and train travel to other great spots."}, {"username": "Wolfgang Nitsch", "comment_text": "They are confused"}, {"username": "Sharon O'Mahony", "comment_text": "Because Sorrento is amazing 👏"}, {"username": "Sophie Smith", "comment_text": "Oh I have LOVED Sorrento! I solo travel and I have had to come back here after Positano. It’s a beautiful place and everyone (workers and locals) are super friendly and welcoming. I can’t speak on behalf of Salerno as I haven’t been but my friends have and have enjoyed it there to. Being a solo traveler it’s important for me to have a feeling of safety and I generally do in Sorrento 🥰 it’s got a heart warming feeling to it and easy access to day trips and transport for else where ☺️ you will love where ever you stay"}, {"username": "Ashley Miller", "comment_text": "Salerno is nice if you like many old men walking around in Speedos. 😂 And even some old Women in Bikinis for that matter."}, {"username": "Aida Perez Castellano", "comment_text": "Sorrento and the Amalfi coast-\nWe took a trip to Positano- I hope I will remember those breathtaking views for the rest of my life!!"}, {"username": "Carol Higgins", "comment_text": "Carol Higgins"}, {"username": "Anna Guzzetti", "comment_text": "Wow so many rude people! she just asked a question ? Trying to decide maybe where to stay?"}, {"username": "Robert Baumann", "comment_text": "Sorrento seemed like a big city to me…"}, {"username": "Tina Tulip", "comment_text": "In Sorrento you don’t have to worry about the many stairs that Salerno, Positano, Praiano or Amalfi among others have. Just easier to get around, that’s my opinion and I’ve been to all these places."}, {"username": "Maria Cascardo", "comment_text": "I’ve stayed in both but fell in love with Salerno. It reminded me of everything my Nonna talked about growing up. Small town, great stores, mostly locals that love tourist and are so kind compared to some areas. Salerno will be my home base when I go back. Short walks to train or ferry to get to other towns. Only advice is don’t trust the ferry schedule. I missed Capri because it said there were 3 that left on Sunday. There was only one. My fault!"}, {"username": "Christine Chimi Inman", "comment_text": "Sorrento is wonderful!"}, {"username": "Robert Malacarne", "comment_text": "We stayed in Vico Equense just out of Sorrento and loved it .\nGive it a go 👍🏻"}, {"username": "Diane Langlois", "comment_text": "Depends on what people like. For my part, for having visit the two, I would stay in Salerno because I like smaller places, less touristic area. But someone who like this kind of pkace, will prefer Sorrento. I found that you can go anywhere from Salerno!"}, {"username": "Tammi Vajda", "comment_text": "Sorrento is beautiful. A lot to do. Wonderful restaurants and shops. Easy to get to and from by train, car ferry or bus. A great place to base yourself. It was one of my favorite places when we visited last year."}, {"username": "Tina Moreman Hunter", "comment_text": "We’re staying in both when we go. Sorrento is more convenient to Naples, Pompeii, Vesuvius, Capri, etc. Salerno and Vietri sul Mare seem more authentic, are closer to the south end of the Amalfi coast and Paestum. We’re also renting a car from Salerno to explore Puglia. If you have enough time, you could definitely try both!"}, {"username": "Rino Maffeo", "comment_text": "Only foreign tourists go to Sorrento.. sorry but those that have no idea what Italy is..!"}, {"username": "Barbara Bastianini", "comment_text": "I’ve been to both. Everyone’s different but I prefer Sorrento to Salerno. It’s just a matter of personal preference for me."}, {"username": "Liz Carlton", "comment_text": "What exactly is your question? People stay where they want to stay and what works for their itinerary. You stay where you want to stay"}, {"username": "Vincent Affinito", "comment_text": "I’d rather stay in Salerno. Sorrento is just to touristy for me."}, {"username": "Kimberly Ketterer Sedita", "comment_text": "Because they want to?"}, {"username": "Suzanne Mills", "comment_text": "Salerno is heavy port city, rather busy. Sorrento is lovely but touristy."}, {"username": "Paolo Mittiga", "comment_text": "The question was sorrento and Salerno that have in common just the initial"}, {"username": "Jan Lumberg Kupczyk", "comment_text": "We sure enjoyed Sorrento. Lovely, clean, jump off point to Capri and Positano."}, {"username": "Donna Watson", "comment_text": "Both are beautiful. We stayed in both cities"}, {"username": "Phyllis Snyder", "comment_text": "Access to transportation."}, {"username": "Laura Schulz", "comment_text": "We'll be staying in Salerno in October"}, {"username": "Tam Wong", "comment_text": "I’m flying Rome and taking the train to Salerno for the night and then ferry to Amalfi then Positano ❤️ ."}, {"username": "David Davey", "comment_text": "Haven’t you ever heard song called Torna a Sorriento? One of top 10 most beautiful place I have ever been."}, {"username": "Sam Nugent", "comment_text": "Because they want too maybe x"}, {"username": "Ivette Lugo", "comment_text": "Good question!!, i currently book 4 nights in Sorrento and plan to go to Pompei, Capri, Amalfi & Positano, I thought Salerno was too far, Hope I didn’t make a bad choice"}, {"username": "Michelle Mean", "comment_text": "Because it’s their choice? 😊"}, {"username": "Bill Elias", "comment_text": "Sorrento has views of Vesuvius."}, {"username": "Krystal Apolinaro", "comment_text": "We spent the day in Salerno and tbh while it was nice there, we were kinda bored after the kids finished swimming. There isn’t a ton to do there, it really just feels like a stop over place for those heading to the Almalfi coast. If I could do it over again I would’ve taken the ferry and headed to the almalfi coast rather than spending the day there. But, we still had a good time with what we did do. Pic of me in the main shopping area of Solerno."}, {"username": "Alicia Cox", "comment_text": "Sorrento is closer to positano & you can do Capri. Salerno approaches from the side where you get to ravello first so the opposite side. There are a few villages before you get to Amalfi if you go from the Salerno side. I think from the Sorrento side it’s positano then Amalfi, so it may be easier if you are driving yourself by car. Also, you can definitely get to Amalfi by boat. I’m guessing you can as well from the Salerno side but idk. So I guess it just depends on where you want to go & your mode of transportation."}, {"username": "Lisa Martinez", "comment_text": "LOVED Sorrento!!!"}, {"username": "Nancy Woods", "comment_text": "Sorrento has the ferries to Amalfi coast Capri Naples Pompeii Herculaneum boats to Positano Amalfi. It’s awesome"}, {"username": "Marian Calhoun", "comment_text": "It I s super beautiful!"}, {"username": "Tami Sue", "comment_text": "I think its easy to get to."}, {"username": "Fetchin Gretchen", "comment_text": "Better place to access the rest of Amalfi Coast by ferry and take coastal bus to Salerno."}, {"username": "Tremayne Mushayahama", "comment_text": "Because Salerno sucks. It's just blah. Sorrento rocks and it's close to many other places"}, {"username": "Richard Meek", "comment_text": "Less mcdonalds?"}, {"username": "Jayne Diliberto", "comment_text": "Sorrento in Mid October... Fall clothes?"}, {"username": "Cathlene Dunn", "comment_text": "We stayed in Salerno. Enjoyed the people there. Drove the coastal highway by car to the other towns…not for the faint of heart. I would do the ferries next time. It is all good!"}, {"username": "Paolo Mittiga", "comment_text": "I was born in Naples , lived in USA for over 35 years , my family is in Naples .. I have been everywhere on the Amalfi Coast and Sorrento Coast but I have never been in Salerno n my life … there is not point of going there"}, {"username": "Laura DeCicco", "comment_text": "I’ve always wondered this as well, Salerno is so much cheaper and the AC is still accessible. It also has more of the local/\nauthentic vibe. If I went back that way I’d definitely stay in Salerno"}, {"username": "Sasha Childs", "comment_text": "I stayed in sorrento, wonderful place x"}, {"username": "Hasan Sayanvala", "comment_text": "Timbuktu vs London"}, {"username": "Meghan Lee", "comment_text": "I stayed in sorreto as it was easier when using public transport. We also wanted to do day trips to Naples, Pompeii, and Amalfi Coast so it was sort of in the middle of those places"}, {"username": "Chris Kane", "comment_text": "Best place to be!"}, {"username": "Vivien Paulik", "comment_text": "Because why we should go to a big city harbor? And not the lovely Sorrento? I do not even understand the instead part. We do not go Sorrento instead Salerno. We go to Sorrento because it is where we want"}, {"username": "Reni Henry", "comment_text": "I stayed Salerno loved it"}, {"username": "Bonnie Regan", "comment_text": "I loved sorrento"}, {"username": "James DiLeonardi", "comment_text": "Good question!! Been to both in October of 2022, Salerno is more of a port city; whereas Sorrento is a resort city. My impression."}, {"username": "Veronika Bisani", "comment_text": "Sorrento is definitely our choice."}, {"username": "Leanne Bingle", "comment_text": "Elizabeth Colleen Fowler"}, {"username": "Denyse Sexton", "comment_text": "Beautiful Sorrento 💕Caruso spent his last days here. We had lunch listening to opera music on our honeymoon it was wonderful. Took a small boat with 4 others around Capri 💕"}, {"username": "Alyson Stanczyk", "comment_text": "We loved Salerno! It was more authentic than sorrento with less tourists so it was so cheap. Salerno was our favorite place we visited in Europe because of the people."}, {"username": "Beverley Hill", "comment_text": "Agreed. Loved Salerno"}, {"username": "Giovanna Rocco Simone", "comment_text": "Dave Simone"}, {"username": "Anthony Mascola", "comment_text": "Cheaper to stay in Solerno...we stayed in a very nice hotel right on the main strip that really hopped at night....we had a car but the ferry boats that go along Amalfi coast towns and Islands are right there."}, {"username": "Manny Manny", "comment_text": "I would do Salerno all day long … also you can do day trips by ferry everywhere . It’s cheaper more authentic and less of a tourist trap. Also idk what everyone is talking about . You literally have a regional train you can take to Pompeii and also to trevi sul mare ..beautiful town knows for ceramic ."}, {"username": "Debbi Mayfield", "comment_text": "As one who isn’t interested in driving or walking the AC but in boating it just all is so much better. We have rented a private boat/captain and will spend our days on the water admiring Positano, Capri, & Amalfi Coast from the water while swimming and snorkeling. No crowds."}, {"username": "Ana Cristina Amas", "comment_text": "Loved Sorrento and would stay there again in my next trip"}, {"username": "Lucy Wong", "comment_text": "Because they have too much money and got nowhere else to spend it!! Anywhere along the Amalfi coast can be so cheap and easily reached from Salerno by bus or traghetto!!!"}, {"username": "Laura Tew", "comment_text": "Because it's nice here"}, {"username": "Don Wayne", "comment_text": "Both are cool places. Salerno def less tourist but still cool!\n\nBar Nettuno’s Brioche gelato in Salerno is sooooo good!!"}, {"username": "Mark Spielman", "comment_text": "Much easier access to Pompeii, Capri, Positano."}, {"username": "Steve Goldun", "comment_text": "Two completely different experiences but you can take the Frecciarossa all the way to Salerno and rent a car there to see tour the Amalfi coast so if you’re short on time or just want to avoid Naples, it’s a good option."}, {"username": "Maria Giordano", "comment_text": "Some cruise ships stop in Salerno, my great grandmother’s hometown. It seems they use it as a jumping off point for tours to Sorrento & the Amalfi coast which are stunningly beautiful locations"}, {"username": "Sherri Leis Dillavou", "comment_text": "I don’t know? Salerno is awesome"}, {"username": "Rino Maffeo", "comment_text": "The whole of the region of Campania coast is beautiful. I live here and it does not matter where you stay or where you are Amalfi or not it’s all amazing and it’s all unique and exciting. Stay where you want ., I suggest Marina di camerota , Palinuro, Castel Abate or Agropoli not as famous but better and beautiful beaches good people with very affordable prices. The real Italy not the tourist traps.. where Italians go fir their vacations..!"}, {"username": "Lynne Fricke", "comment_text": "Have just been to both. Sorento 100 x nicer"}, {"username": "Iris Joan Price", "comment_text": "In Sorrento, I loved the big city vibrancy in a small seaside city. Beautiful vistas. And ferries, trains, or buses to all the places I want visit. I am returning this October after being there last October. I love it."}]}, {"id": "2209064522825959", "text": "Hi, I’m wanting advice please. I’m looking for suggestions on where to spend the last 7 nights of our time in Italy.\nAfter traveling from Rome, Florence, Bologna, Venice and then through part of the Dolomites we end up in Bolzano then Verona.\nI’m not sure whether to stay a couple of days at Lake Garda (if so where is a great spot) and then go towards Cinque Terre or anywhere in between. Our departure flight is from Milan so will spend a couple of nights there before flying out.\nWould love your thoughts. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2209064522825959/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "stay in Sirmione https://\nwww.jdoqocy.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187842-d2385\n43-Reviews-Gran\nd_Hotel_Terme-S\nirmione_Provinc\ne_of_Brescia_Lo\nmbardy.html"}, {"username": "Lauren Neely", "comment_text": "Cinque Terre was our favorite!"}, {"username": "Andrea Bainbridge", "comment_text": "We tacked on Turin this year and were very pleasantly surprised. Only an hour train from Milan. Not as touristy. The largest Egyptian museum outside Egypt. Great auto museum too. Views of the Alps.\n\nAnother great stop and only 45 minutes from the airport is Stresa on Lake Maggiore. We’ve stayed there twice before flights out. Great gardens. Very scenic."}, {"username": "Tonsia Keytel", "comment_text": "Definitely Cinque Terre. Stay in La Spezia and take the train from there, easy to do at least three even four villages in one day. Was there in May, magnificent. Stay close to train station in La Spezia. Villages all close to each other and trains are frequent."}, {"username": "Debbie Milne Jenkins", "comment_text": "We’ve stayed twice in Monterosso - Cinque Terre. From that area you can also get to Genoa by train. Stresa, as noted by someone earlier, is also very nice. Portovenere, I think (Cinque Terre) is also very pretty - so many good choices! Enjoy your trip - you’re hitting some great spots😊"}, {"username": "Lyn Evans", "comment_text": "Adore lake Garda.. Malcesine is stunningly gorgeous and so is Sirmione at the base of the lake(closer to Milan and Verona etc but busier) Bergamo is another opt you could incorporate perhaps."}, {"username": "Miyuki Kanno Paul", "comment_text": "So you technically have 5 nights since you have planned on staying in Milano for 2 nights before departure or still 7 nights? You can visit the Lake region, Torino, Genova(day trip to Cinque Terre), etc"}]}, {"id": "2209062556159489", "text": "Any recommendations for a 2 bedroom Air BnB in Florence please 🙏🏻", "link": "facebook.com/groups/1373361046396315/permalink/2209062556159489/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FVacationRen\ntalReview-g1878\n95-d13942539-Gi\nglio_Viola-Flor\nence_Tuscany.ht\nml"}]}, {"id": "2209062519492826", "text": "I'd love to get some names of popular Italian singers to listen to on Spotify. Something more easy listening than pop/rap genre. any suggestions?", "link": "facebook.com/groups/1373361046396315/permalink/2209062519492826/", "likes": 1, "comments": [{"username": "Diana Hesse", "comment_text": "Andrea Bocelli ?"}, {"username": "Chris ORiordan Dean", "comment_text": "Il volo. A group of young Italian boys. Some of the best voices I’ve ever heard."}, {"username": "Chris ORiordan Dean", "comment_text": "Also an Italian from the sixties. Sergio franchi. Very romantic. And then there is Dean Martin Italian Love Songs. I’m Italian American and it brings back so many memories of my Nonna"}, {"username": "Alessandro Iannelli", "comment_text": "i don't understand it, is it pop ok or not? cause if it's about easy listening, there isn't anything easier than pop. anyways, my suggestion would be the group 883, later max pezzali. or also elisa, the songs in italian (seeing as she also sings in english and probably more so than in italian), her music and her voice are amazing. about \"classics\", as in oldies, the duo al bano and romina power or also mina and gianni morandi."}, {"username": "Phil Murphy", "comment_text": "https://\nyoutu.be/\nnhZIRNxIEvo"}, {"username": "Christine Calleja", "comment_text": "Gigi D'Alessio, Tiziano Ferro, Laura Pausini, Eros Ramazzotti, 883, Marco Masini... These are my favourites of all time."}, {"username": "AnaMaria Uceda", "comment_text": "Antonello Venditi, Michelle Zarillo, Laura Pausini, and to bump it up a little; Giovanotti"}, {"username": "Kathleen Farrugia", "comment_text": "Moda', Marco Mengoni, Umberto Tozzi"}, {"username": "Laura Clipperton", "comment_text": "Eros Ramazzotti"}, {"username": "Lauren Neely", "comment_text": "Pooh!"}, {"username": "Nena Almpanidou", "comment_text": "Marco Mengoni!"}, {"username": "Rose-Anne Portia", "comment_text": "Umberto Tozzi"}, {"username": "Alessio Esposito Inchiostro", "comment_text": "What do you mean easier than pop?"}, {"username": "Tanja Moura Cleary", "comment_text": "“Italy 60s” is on my current rotation"}, {"username": "Mike Ball", "comment_text": "Renee and Renata 😉\n\nIf you know you know 😁"}, {"username": "Ruthie Bader", "comment_text": "Giorgia"}, {"username": "Gianna Onesi", "comment_text": "Andre Bocelli"}, {"username": "Rebecca Yeoh", "comment_text": "This playlist is a vibe"}, {"username": "Anna Auriemma", "comment_text": "Try listening to https://\nopen.spotify.com\n/user/\n8vfm1ffh3bja5nr1\no9sx2f8dh\n\nPlaylists from a radio program on Saturday mornings, WRHU Hofstra University."}, {"username": "Miyuki Kanno Paul", "comment_text": "•Luciano Pavalotti\n•Pino Daniele(especia\nlly if you are going to Napoli)\n•Andrea Bocelli"}, {"username": "Paula Baskins", "comment_text": "Giorgia"}, {"username": "Sally Warren", "comment_text": "Zucchero"}, {"username": "Dana Green", "comment_text": "Luca Carboni, of course! If you want Abba vibes the Viola Valentino."}, {"username": "Liisa M. Valo", "comment_text": "These suggestions 💀😂😂"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2209051182827293", "text": "So I land in Milan on the 18th May at 1:55pm and stay until the 21st! Is it too much if I do a day trip on the 20th to lake Como?", "link": "facebook.com/groups/1373361046396315/permalink/2209051182827293/", "likes": 0, "comments": [{"username": "Karen Blackmore", "comment_text": "It's easy to get to Lake Como on the train from Milan. No need to book tickets. Trenord trains"}]}, {"id": "2209044686161276", "text": "I need information on UBER in Rome and Florence please. Are there ample rides available or it is limited?", "link": "facebook.com/groups/1373361046396315/permalink/2209044686161276/", "likes": 1, "comments": [{"username": "Jenn Messina Babore", "comment_text": "Use ItTaxi app instead of Uber 🤗"}, {"username": "Karrie LeBlanc", "comment_text": "Uber in Rome is connected with the taxis so you get a taxi for normal ride request and we got a large sedan for Uber black request when we needed a larger vehicle. No Uber in Florence. Use the taxi app or just flag one down or go to marked taxi stand."}, {"username": "John Dobos", "comment_text": "Not good in Florence."}, {"username": "Devon Grandi Powell", "comment_text": "We used Uber several times in Rome and it was very very easy and quick. You have the option of selecting a taxi via the Uber app or a regular Uber driver, and included the option of asking for a van if needed (helpful for when we went to the train station with our luggage). You also have the option of asking for an English speaking driver but I don’t think that necessary since it’s so easy with the app giving the address. Each time we used it the car was to us in a very short time. Definitely recommend"}, {"username": "Mike Guluk", "comment_text": "freenow is the taxi app most use"}, {"username": "Brian Osman", "comment_text": "Just use taxi's, much easier"}, {"username": "Regina-Rich Krett", "comment_text": "Uber in Rome was great. That was all we used when we were there."}]}, {"id": "2209037026162042", "text": "We are celebrating our 30th wedding anniversary and planning a trip to Venice,Lake Como, Florence, Tuecany, Rome and The Amalfi Coast. Weather wise and crowd wise. Should we go in April or May. Thank you in advance for your help 😊 truly appreciate it", "link": "facebook.com/groups/1373361046396315/permalink/2209037026162042/", "likes": 0, "comments": [{"username": "Rhonda Smith", "comment_text": "September"}, {"username": "Andrea Bainbridge", "comment_text": "We were in Amalfi, Florence and Lake Como mid April through mid May and it worked great! Not too touristy yet, weather was fine, not hot. Highly recommend"}]}, {"id": "2209016049497473", "text": "On my first trip ever to Florence I’ll be there for 3 days in early October. On day 1 we’ll enjoy the day leisurely seeing the sights there.\nOn day 2, my thoughts are to take the train early to Cinque Terre and visit a couple of the villages there. For day 3 taking a day trip through Tuscany (Pisa, Sienna, San Gimignano). Is this too much for 3 days?", "link": "facebook.com/groups/1373361046396315/permalink/2209016049497473/", "likes": 3, "comments": [{"username": "Karrie LeBlanc", "comment_text": "1 day to explore Florence is definitely not enough and I would feel very rushed to jam 3 cities in 3 days. We just spent 5 days in Florence with only 1 day leaving the city to do a wine tour."}, {"username": "Rhonda Russell", "comment_text": "There is sooo much to see in Florence, please reconsider"}, {"username": "Glenn Todd Webb", "comment_text": "When will you see Florence? I’d much rather see Santa Croce, Santa Maria novella, David, Medici chapel, pitti palace and boboli gardens, uffizi, duomo, Baptistry.\nYou can’t see those 3 towns all in day 3. Pick one."}, {"username": "Suzanne Mills", "comment_text": "Way too much. Florence deserves a week. Cinque terre, 5 days. Skip Pisa. Go to Lucca."}, {"username": "Geraldo Prioriello", "comment_text": "San Gimignano wine tasting Pisa and Siena is a must we did it on day 3 , day 2 ( palazzo Pitti, the gardens , Uffizi and Academia ) can be done but very overwhelming in one day."}, {"username": "Catherine Campbell", "comment_text": "Yep too much"}]}, {"id": "2209011989497879", "text": "My husband and I are finally going to go to Italy in October 2024. I need all the advice I can get so please tell me everything I need to, have, see etc. TIA", "link": "facebook.com/groups/1373361046396315/permalink/2209011989497879/", "likes": 132, "comments": [{"username": "Karen Cumbo", "comment_text": "Hey Rick Steve’s book on traveling to Italy"}, {"username": "Kathryn Kennedy", "comment_text": "Take some money. Follow your heart. Thats it"}, {"username": "Jerry Kiger", "comment_text": "I joined this group for same reason, need. Most say pick 3-4 bases to stay and/or day travel from; days depend but 12-14 seem to be good amount, agree Rick Steves website I just bought guidebook “Italy” the Nov 22 is latest Ed. Initially, fig out how you want to organize your “research” best for you … electronic folders (I have Italy then folders city, cost, apps, etc) … there lot of good tips on this page so decide how to save the info. Once ready to purchase … most seem to flight, hotel, then tours and food places. I’m in the planning phase so same boat. Once you know your cities then research should get little easier to track your spots and not worry about others … since there so many places to visit. Best of luck in your trip .. it is a lot"}, {"username": "Miyuki Kanno Paul", "comment_text": "First of all, please invest in a most recent copy of Rick Steves Italy guidebook. It will save your life. Then come up with a question or two. We can tell if you have done a homework by the kind of questions you will come up with"}, {"username": "Christine Matthews", "comment_text": "get a rick steeve's guide! get advice there!"}, {"username": "Gabriella Strano", "comment_text": "F"}, {"username": "Marie Scarnecchia Wess", "comment_text": "We are going in October also any advice would be helpful"}, {"username": "Armie Pecho-Balce", "comment_text": "We are planning Oct this year Rome Venice and day trip to Florence any advice , where to go, hotels?"}, {"username": "JoAnn Byrd", "comment_text": "We are going end of September start of October. Cruise 🚢 all the way to Greece, Sicily and back up towards Rome."}, {"username": "Lori Armor Bradfield", "comment_text": "Just keep reading on this site, it’s great! Search any topic and there are hundreds of replies, so fun!"}, {"username": "Teri Hansen", "comment_text": "Keep in mind wherever you go, whatever you see, drink & enjoy eating…you can always go again. There’s just too much to experience in one visit. We spent eleven nights in Italy during our four week trip to Europe in June 2022. We will be going back Fall 2024. Touching a few places a second time: Venice & Florence. Enjoy your trip. 🧡"}, {"username": "Deborah Eaton", "comment_text": "Comfortable shoes!"}, {"username": "Roberto Diaz", "comment_text": "Watch your purse and wallet at all times. Specially in tourist spots and transport"}, {"username": "Lois Trapasso Dodson", "comment_text": "That’s when my husband and I are planning to visit!!"}, {"username": "Frank Hurn", "comment_text": "First of all, are you with a tour group or on your own? Next, how will you be getting around, driving, by train, etc.? Pack as light as you possibly can, and I would recommend visiting lake Como, town of Varenna as a starter! Let me know, and I'll give you some more tips, I've been there many times!"}, {"username": "Emily Shupe", "comment_text": "I have a great packing list of things that are so nice to have -if you want me to share just message me!"}, {"username": "Eleanor Stevens", "comment_text": "Following….goin\ng 10/3 this year"}, {"username": "Christine LaMore Meyers", "comment_text": "We are too celebrating 45 years"}, {"username": "Dana Dobbins Gordon", "comment_text": "Exciting!!! I recommend stalking this group. When you come across something that interests you you can use the search function and gather tons of information. Happy planning!!"}, {"username": "Penny Bouchard", "comment_text": "We are doing the same. Going to focus on venice, lake como and cinque terra"}, {"username": "Jane Giuliano", "comment_text": "Following this great post for us newbie travellers! I’m heading Sept ‘24 too!"}, {"username": "Lisa Valdovinos", "comment_text": "We booked everything we could 9 months in advance."}, {"username": "Jerry Chimienti", "comment_text": "Treat it as adventure. Chillax and enjoy the voyage!!"}, {"username": "Sue Policicchio", "comment_text": "Domenic Policicchio III\nAngelo Policicchio"}, {"username": "Stevie Boombatz", "comment_text": "Watch Rick Steve’s on YouTube for italy"}, {"username": "Michael D. Busch", "comment_text": "Fly in to Venice. 1-2 days\nTrain to Florence. Stay at Hotel Grand Cavour. Day trips to Tuscany; walk Florence. 3-4 days.\nTrain to Rome. 2 days. Underground Colessium tour; Vatican; Piazza Narvona; Trevi\nTrain to Naples. Aldo Limos pick up. Stay in Positano. 4-5 days. Day trips to Ravello, Capri, Priano, Sorrento, Vesuvius.\nBack to Naples. Depart."}, {"username": "Connie Rai", "comment_text": "I'm a 30 year veteran Travel Advisor and have traveled just recently with a group for my 22nd time to Italy. I would be delighted to assist you with making and booking your travel\nCall me, Connie at 561-865-7484\nThanks"}, {"username": "Evi Fulford", "comment_text": "Get Rick Steve’s Italy book and start watching all of his Italy shows"}, {"username": "Wendy Gauci", "comment_text": "I downloaded the pin drop app, and then as I come across any places of interest, eateries, shops etc on this group, I pin drop them on a map. I’ve added my accommodation so can see where it is in relation to these. Read the posts in the group and make use of the search functionality to look up your questions is the best tip I can give."}, {"username": "Lisa Hobert", "comment_text": "Pack light it will make it so much easier"}, {"username": "Dominyka Gliožerytė", "comment_text": "Ciaoooo Jamie Webber Santos 👋🏼\n\nUnderstand your excitement 🥳, but Italy is huuuuge, so you better specify the area 😅\n\nIf you need help on Milan/Como, Sicily or Sardegna 🏖️ , ping me on IG 𝐩𝐚𝐬𝐭𝐚_𝐩𝐞𝐬𝐭𝐨_𝐩𝐢𝐳\n𝐳𝐚 and I’ll share some tips and will help you organize 👍🏼 and of course will share the best places to eattttt 🍕 🍝 🤤🤤\n\nCiaooo 🇮🇹🇮🇹👋🏼"}, {"username": "Koh Puay Heng", "comment_text": "I love Alta Badia and Courmayeur. Go check it out."}, {"username": "Luz Paez", "comment_text": "How exciting! My tip is to pack lightly and carry on your luggage."}, {"username": "Debbie Milne Jenkins", "comment_text": "Cinque Terre; Milan for the Duomo, fashion, The Last Supper; Lakes area for scenery, quaintness and Isola Bella; Tuscany for San Gimignano, Verona, Parma, Bologna; Venice for Venice; Naples for Naples, Capri, Sorrento, Pompeii, Amalfi Coast; Rome for Vatican City, Tavestere, Piazza Novena, Coliseum, and more of Rome.\n\nAll of that said, I’d select 2 spots other than Rome to enjoy and explore. I have found that each time I visit Italy I end up in Rome for a day either by flight or cruise so I’ve found that visiting Rome A day at a time has worked for me. There are many spots in Italy that I like more than Rome and, again, have been happy to see it a day at a time."}, {"username": "Al Filizetti", "comment_text": "I can only tell you about my 3 weeks. ￼ It all started by flying into Milan we rented a car an drove to our Airbnb in Ranzanico,Italy\n. We were there three days. Well there we took a bus to Bergamo for the day. After Ranzanico we drove to our 2nd Airbnb in Castelfiorentin\no. Which is in the Tuscany Providence about 40 miles south of Florence we spent the remainder of our time there with trips to Florence , Rome Pisa an Venice. 3 days in Rome and a day and night trip to Venice. Venice was my favorite. If you are going to Rome and need the name of a guide I can recommend one to you. She is excellent and has a degree in art in history. Which was really nice as we toured the Vatican museum, St. Peters basilica ￼, the Sistine chapel. ￼she also does tours of the Colosseum in just about anything in Rome."}, {"username": "Gary Oroian", "comment_text": "Relax and have a great time! Go to restaurants that do not have a menu outside in English! Enjoy some great gelato! Take in all the beauty. If you go to the Vatican do a small group breakfast in the courtyard and avoid the big lines. Have fun! Don’t try to see to much. Enjoy where you are and smell the roses!"}, {"username": "Sabrina Sofia", "comment_text": "Download booking . Com\nYou can add everything to that\nHotels"}, {"username": "Gene Hamilton", "comment_text": "In Rome look into walking food tours we did one there and in Venice the Rome one was amazing\nVenice was ok"}, {"username": "Tara McCloud Odebrecht", "comment_text": "Pick up a Rick Steves book. Helps with planning and lots of great tips!"}, {"username": "Queen Dorcas", "comment_text": "Get the Italy travel guide by Gary Ives on Amazon, that helped me a lot"}, {"username": "Mandy Thurmon McLaughlin", "comment_text": "dowload rome2rio app to help find best ways to travel between cities. My fav was Underground Colosseum tour, Trevi, and Sistine Chapel in Rome, Wine tour out of Florence, shopping in Sorrento, path of Gods Hike in Positano, Bellagio in Lake Como, and Cinque Terre. However, don't pack in too many. You don't want to spend too much of trip on a train and juggling luggage. I loved my travelon anti-theft backpack. Florence Museums need tickets WAY before you get there. Get Vatican tickets online so you avoid the line wrapped around building. Download Free Rick Steves podcast to listen as you walk through tour sites like Sistine chapel. They are way better than the listening tours they sale at each place. Only place I really disliked was Naples, I'll hear complaints for saying it, but truly, it's the sewer of Italy."}, {"username": "Nancy Cicinelli", "comment_text": "I would definitely recommend Almafi coast Capri.. And Positano. Sorrento as your base and also include Almafi then ferry to Ischia is a great place to go and cheaper then the rest"}, {"username": "Cherie Lee Tiscia", "comment_text": "How exciting!!"}, {"username": "Billie Frances Swanda", "comment_text": "Get a frommers guide"}, {"username": "Josslyn Lewis", "comment_text": "My husband and I are going in September 2023, I have been planning for months. Some of the things I’ve learned\n\n1) First decide how your getting around this really truly is an individual decision based on your ability to walk long distances, what your “goals” are, and what your comfort level is! I chose to book transportation to and from airport and take taxis for site seeing stuff due to my mobility issues.\n\n2) make sure you reconfirm all of your reservations a few weeks before you go, just to be sure!\n\n3) make sure you know a little of the language it’s respectful as I’ve heard a lot of people can speak English but appreciate you trying!\n\n4) Have change for restrooms when you out and about.\n\n5) buy a anti theft Fanny pack or purse and carry your passport especially if you utilizing the train system.\n\n6) do not leave personal items such as backpack or purses sitting on restaurant table or benches.\n\n7) leave a copy of your itinerary, passport and a credit card at home where if you happen to loose or get stolen in Italy you can contact someone at home to help you.\n\n😎. Only take a carry on and maybe a backpack pack!\n\nWish me luck!"}, {"username": "Annette Giovia", "comment_text": "Go everywhere you can. Stay there as long as you. Italy is such a BEAUTIFUL country. See Tuscany, Cinque Terre, Rome, Portofino. In Rome visit the Spanish Steps, the Trevi Fountain, Piazza Navona where you can sit outdoors at a cafe and enjoy the artists, music and food.\nI was there in 2017, for 2 weeks. It wasn't long enough. I didn't want to leave. When packing, roll your clothes up. You can get more in your suitcase. Most places have hairdryers in the rooms. No need to being one. Remember to bring a charger and a converter for your phone, camera. The money is easy to figure out there. Lots of Italian business owners speak English. I found it easy to pick up certain words/phrases, so I could talk to them. In any case, they understood me and me them. Walk whenever you can. I didn't go on any tours. Came and went where I wanted when I wanted. As in any country or state you visit, be aware of your surroundings. Walk when you can. You can't imagine all the wonderful things you'll see. Hidden cobblestone \"streets\" and little apartments with colorful doors and flowers everywhere! And most of all, JUST ENJOY YOURSELF!! (sorry this was so long and drawn out but the memories are still fresh in my mind)"}, {"username": "Todd Gaines", "comment_text": "Following"}, {"username": "Ryan Christopher Grasso", "comment_text": "Beautiful Florence!!! Enjoy that city!!! Venice, just get lost wandering!!!"}, {"username": "Frank Knights", "comment_text": "Going the same timeframe. Looking forward to your response…"}, {"username": "Vadim Gotovsky", "comment_text": "We love Tuscany. We fly to Florence, stay there few days, then rent a car and explore hill towns like San Gimignano, Montalcino, Montepulciano, Civita, Siena, vineyards, changing once or twice the base. No way you can visit these towns by train. You can google all these towns, they are simply gorgeous.\n\nP.S. People ask all sort of questions. If you don’t like them , think they are silly just move on, no need for condescending comments. Or politely ask to me more specific if you want to help."}, {"username": "Cindy Holtfreter", "comment_text": "I started by buying Rick Steaves ITALY and getting a map.\n\nI needed to to get a sense of the areas and the experiences. Which one were higher on my list. Which one were the must see for me.\n\nMy list became long and then I took places off my list.\n\nI added days because I want to feel what Italian’s call…. La Dolca Vita. The sweet life. To slow it down. ￼Enjoy!\n\nI also began to read almost all posts of this group and cut and paste pertinent information these categories.\n\nIMPORTANT, HELPFUL AND RESPECTFUL…\nUse the search function for different topics. I bet most of your questions are already answered.\n\n• airlines and comfort\n• Cities… hotels, restaurants, tours, and skip the line tours\n• Using phones - your carrier or e-Sim cards.\n• best apps to use in Italy\n• Money, exchange, cc and how to charge\n• Train, Buses - how to purchase and whether t\nYou need to get ticket punched. Comfort, best companies, type of train… fast, local, etc. what to know and how to use them.\n• passports, (electronic copies, paper copies, why hotels need copies, safest place for passport? In hotel safe or on you)\n• ETIAS, TSA pre-approval, & global entry\n• What to pack and how to pack, luggage recommendations\nand tricks\n• Insurance - through cc, travel insurance, health insurance\n• no tipping, and exceptions\n• VAT Taxes\n\nLast but not least. A friend said that I will enjoy my trip 3 times…\nWhen I plan it.\nWhen I take it and\nWhen I share it.\n\nEnjoy the process. Italy is worth savoring.💕💜💕🙏"}, {"username": "Wendy J. Calvin", "comment_text": "Fantastic!!!!!"}, {"username": "Susan Corrigan", "comment_text": "Book skip the line tours for any of the tourist attractions you want to see! Consider Airbnb/Vrbo rather than hotels… I’ve done both in Italy and prefer the Airbnb ."}, {"username": "Nancy Duplessis", "comment_text": "Advice for this page is take everything with a grain of salt. Do what you like to do whether it’s the beach or museums. Relax and have a drink or sight see. Take the train/bus/\nferry or hire a driver. Wear comfy shoes and clothes. No need for reservations unless you want to eat at an exclusive restaurant. Remember it’s your vacation, no one else’s. Enjoy and be aware of your surroundings. It’s a beautiful country for so many reasons. And very few pickpockets if you’re careful. Oh and order the house wine, it’s better x 10. And have gelato. Every. Day."}, {"username": "Tom Van Fossen", "comment_text": "Read and follow Rick Steves travel guides…….he took us around Italy for 4 weeks…..write or call the hotels, events or travel firms for best advice/prices"}, {"username": "Patty Chimenti Quick", "comment_text": "Get Rick Steves book. He has great ideas that will help!\nWhatever you do, where ever you stay, it will be fabulous! YOU ARE IN ITALY❤️🇮🇹❤️🇮🇹\nENJOY 😊"}, {"username": "Cindy Donaldson Fouts", "comment_text": "Following"}, {"username": "Rick Perry", "comment_text": "I'm right there with you!"}, {"username": "Lisa Rizzo Ozmon", "comment_text": "That’s when we are going to"}, {"username": "Tahia Raq Sharki", "comment_text": "Good luck"}, {"username": "Fah Riseree", "comment_text": "It’s a bit hard to tell since North and South of Italy is quite different. I would like to ask what is it that you like to see? The mountains? The sea and beaches? Historical towns?\nI recommend just choosing either south or north so you can take it easy.\nThe common routes you can try out on your first time in Italy can be the following just to visit almost the main attractions:\n1. Land in Rome(and Vatican)>Floren\nce>Pisa>Cinque Terre>Venice>Mi\nlan>Como>back to Milan to depart\n\nThis route didn’t really cover everything tho…this can take you around 11-12days.\nYet again, we don’t know how many days are you planning to stay…if you have longer days than this, then squeeze in the south main attractions between Rome the following: Naples for the food; Amalfi coast; Positano; albero bello; blu grotto; etc…."}, {"username": "Deanna Gasparott Kelley", "comment_text": "I would suggest that you first decide which cities you would like to visit, then decide which attractions you want to visit, then set your itinerary around that. I recently planned and executed a two week family trip. I listened to this group’s advice to spend less time traveling between cities and more days at each location. I was happy with my choice because travel days were wasted days. Instead, pick a home base and consider day trips with the fast train. I learned a ton from Rick Steves Italy book. Have fun!!"}, {"username": "Mark Spielman", "comment_text": "Read Rick Steve's Italy, planning is almost half the fun."}, {"username": "Susan Perry", "comment_text": "Concur with the above - what areas and how long …. Then research, research, research. Dont forget Rick Steves - awesome travel books!! Have fun!"}, {"username": "Hudd Cass", "comment_text": "My favs are Tropea (best beach in the world). Sicily! Florence (Renaissance beauty). Rome (the history). Amalfi coast. Como is also beautiful 🩵 Ypu can’t really go wrong in Italy!"}, {"username": "Rose Turdo", "comment_text": "Land in Milan rent a car, drop off and depart from Rome.\n4 weeks will get you through much."}, {"username": "Chris Hodgins", "comment_text": "Maria Samaras"}, {"username": "Lindsey Mitchell", "comment_text": "Rick Steve’s Travel Guides are highly informative! Pick some up & also google/ watch youtube videos about places you plan to visit. (Also, get on duo lingo & start learning Italian.) I went to Italy for 2 weeks at 18 - knew zero Italian & again for 2 weeks at 37 (where I had been practicing the language for 6 months on Duolingo.) It’s much more enjoyable when you understand a little bit of the language & the locals will greatly appreciate the effort. Have fun!!"}, {"username": "Kirsten Rea Davis", "comment_text": "Start listening to podcasts- and YouTube videos to get ideas in addition to a good guidebook. You will hear lots of strong opinions on places, some people hate a place while someone else loves it. Start now if you want to learn some Italian-most of the bigger cities have people who speak some English, but I was able to understand so much without having to use my phone because I had learned some. Remember, this is your vacation and you know what kind of traveler you are-some like to be busy while they are there and others like to take it slower-you do you 😊"}, {"username": "Keith Piccirello", "comment_text": "Eat everything walk everywhere see everything taste it all."}, {"username": "Lucrezia Folger", "comment_text": "What does that mean? That's 13 1/2 months away. Plenty of time to do some research online and youtube. Then when you have specific questions that will help."}, {"username": "Monica Colontonio Macho", "comment_text": "Depending on how long you are going to stay, take your time, go slow and enjoy, don’t try to do everything. Pick one attraction you really want to see in each town you visit. Don’t be afraid to walk through “untouristy” places and learn a few phrases in Italian. I don’t speak very good Italian, but everywhere I went the local people loved teaching me the correct way to speak Italian. It was wonderful, Italy is always in my heart."}, {"username": "Caren Murray Kleinman", "comment_text": "We are planning to go to Italy in Sept of next year. I for one, am very happy this was posted. And thank you to the people who actually gave advice. I picked up some great tips on how to start planning for the trip. It can be so overwhelming when you start looking into a trip and the advice of people who either live there or have made one or several trip is really helpful!!!! For those saying figure it out and,then come back…. Why are you here????"}, {"username": "David Hastie", "comment_text": "I will pass you some info when I come back from our trip this October."}, {"username": "Terry Pisano", "comment_text": "I would comb through guided trip tours. Doesn't matter which ones. Get a feel for where you want to go. I wouldn't recommend a guided tour as you can do it all yourself, and that's half the fun! Plan on 3 days per stop. It's a big country, so any more than that and you'll spend too much time on busses or trains. You've got lots of time to plan the trip of your dreams!"}, {"username": "Catherine Campbell", "comment_text": "My suggestion would be to follow all things Italian on Instagram and FB then you can see the things that interest you. From there you can pull together an itinerary"}, {"username": "Keili Adams", "comment_text": "Kim"}, {"username": "Kim Anne", "comment_text": "Following"}, {"username": "Judy Galloway", "comment_text": "Search posts please"}, {"username": "Nada Albarbari", "comment_text": "For how long ?\nHow many cities are you planning to visit ?\nAny preferences?"}, {"username": "Renae Larcus", "comment_text": "Start with some research. Look at Rick Steves. Narrow down your question."}, {"username": "Leena Österdahl", "comment_text": "First, decide which cities you want to see. After that, Google as much information and things to see in the city as possible, so you don't run around like a headless chicken from one place to another. I always make some kind of advance plan where we are heading, when the number of days is limited. I have the maps of all the cities I've been to as memories and there are a lot of them all over Europe."}, {"username": "Mary Lou Gillen", "comment_text": "Perfect month! Beautiful weather not as crowded as summer and everyone is in a better mood. Tell us what parts of Italy you are going to. Keep checking in to this page and you will get tons of advice.\nFor a start, DON’T OVERPACK."}, {"username": "Kate Bryant", "comment_text": "How exciting!! You will adore Italy, there is sooo much to see and do.\nI have lived in Firenze, and used it as my base.\nDo allot of research, as that will be half the fun.\nIt depends on how much time you have.\nLearn a little language, as it will really help.\nHave a wonderful time.🙏"}, {"username": "Steve Bouffard", "comment_text": "How much time do you have?\nIf you’re going to a historical site or special, museum I recommend booking a tour. You will get so much out of it. The cost is minimal compared to what you spend on flights, lodging and food.\nDon’t try to do too much in one day.\nLeave time to wander and soak in the sights, sounds and feel of where you are.\nDon’t worry about reservations at fancy restaurants. There are so many fine, small places to eat.\nDon’t jump from city to city. Park yourself for four or five days and soak up everything you can in an area.\nAir bnb’s are great.\nThe trains are great. Get the apps on your phone and you can purchase your tickets, check train status, pick your seats, etc.\nIf you stay in a big city, get the multi-day metro/bus pass. (In Venice it’s boats!)\nPlan, plan, plan! It’s worth it to book early. Start with a rough itinerary of areas and then focus on specifics.\n\nYou probably won’t be able to do everything you’d like to so try to focus your time."}, {"username": "Amber Butler", "comment_text": "My husband and I went last year for the first time using Tralfarger tours. It was great for our first time. We were exposed to many cities and amazing experiences. We didn’t feel we had enough time in some cities. So, we are going back on our own to our favorite locations. Florence is going to get several days on our next trip! Recommend watching Medici on Netflix, plan several days in Florence, bring comfortable walking shoes for 15-20k steps per day and bring a European plug converter (Amazon)."}, {"username": "John D. Truty", "comment_text": "Following- plan a driving trip - need to focus a bit because in going goal is to “see all of it” 😝\n- not much for museums, or history - but very interested in cuisine, countryside, culture and wife discovering her Italian roots…"}, {"username": "Jeff Gentner EA", "comment_text": "There's a huge difference between SEEING Italy and EXPERIENCING Italy. Think about what you want when planning."}, {"username": "Glenn Todd Webb", "comment_text": "Get a Fodors or Frommers guide. Fly in one major city and out where you end."}, {"username": "Shane McClain", "comment_text": "Depends on where you are going. We did Rome, Bologna and cinque terra"}, {"username": "Doug Burke", "comment_text": "Italy's a BIG country. Asking the above is a little like \"I'm going to the library. What book should I check out?\" A little preliminary research on your part would be helpful. How long do you have and what are your interests?"}, {"username": "Katie White-Meade", "comment_text": "Exactly the above. What do you enjoy. How long are you going for? Vast options."}, {"username": "Michelle Cotoni", "comment_text": "Agree with previous post. What areas are you planning on?"}, {"username": "Gillian O'Callaghan", "comment_text": "That's very broad....make an itinerary, jot down some specific questions, use the search function, then ask questions."}]}, {"id": "2209011289497949", "text": "What’s the weather typically like in late September/early October? Trying to figure out what type of clothing to pack. Rome > Siena/Florence > Venice", "link": "facebook.com/groups/1373361046396315/permalink/2209011289497949/", "likes": 7, "comments": [{"username": "Renae Larcus", "comment_text": "Lovely weather. Pleasantly warm and not too hot."}, {"username": "Wendy J. Calvin", "comment_text": "Agree with Renae Larcus....gener\nally lovely warm days - as you move towards October - can have cool mornings and evenings so jacket or sweater/\ncardigan ( sweatshirt) is a goid idea. Although, you can always buy additional clothing if need be while in Italy. Have fun!!!"}, {"username": "Lucrezia Folger", "comment_text": "Google the past weather conditions for the trend in those areas. It’s anyones guess."}, {"username": "Elaine M Woodward", "comment_text": "I’d like to know about first week of March"}, {"username": "Sheryal Shaw Slade", "comment_text": "Could someone tell me in degrees what range the warm and cool usually are? Thank you"}, {"username": "Donna Egan Mason", "comment_text": "Maybe we see each other 😄"}, {"username": "Jessica Stewart", "comment_text": "My husband and I will be there around the time you stated and I’m planning on sun dresses, jeans, shorts and shirts. I see on Google that typically it will be chilly in the am and evening. I live in south Florida it shows it will be warm during the day"}, {"username": "Ειρήνη Δεγρέση", "comment_text": "You realize of course that from Rome to Venice the distance is big, weatherwise speaking."}, {"username": "Kit Nader", "comment_text": "Warm very nice"}]}, {"id": "2209001729498905", "text": "Flying to Rome this week from Chicago on Turkish airlines, connecting flight through IST. Layover is about 2 hours. Will we have any issues making connection? Do we have to go through customs/passport check? Any recommendations or tips appreciated:)", "link": "facebook.com/groups/1373361046396315/permalink/2209001729498905/", "likes": 0, "comments": [{"username": "Gulay Camurdanoglu", "comment_text": "They ara taking you to trasit rooms\nDon’ t worry"}, {"username": "Kay Rendall", "comment_text": "Is it a transit, or another airline flight."}]}, {"id": "2208999546165790", "text": "Calling all music lovers… 🎶 My husband and I will be in Italy for the first time Sept. 18-30. We’d love to catch a classical concert or musical performance. Looking for recommendations on venues and spots to research. We will be all over - Milan, Como, Florence, Venice, Rome. Where is your favorite spot to catch a local performance? TIA!", "link": "facebook.com/groups/1373361046396315/permalink/2208999546165790/", "likes": 4, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Florence/\nFlorence-Concert\n-and-Dinner/\nd519-2428CAF2B?p\nid=P00070587&mc\nid=42383&medium\n=link&medium_ve\nrsion=selector"}, {"username": "Jenn Messina Babore", "comment_text": "Venice has at least two different Vivaldi concerts in churches."}, {"username": "Todd N Nicole Clarke", "comment_text": "I know I saw one in a church in Venice\nIt was in same square as this place, https://\nterrazza.aperol.\ncom/it/en/\nvenice/\nWe came across it one night just wandering around Venice"}, {"username": "Jessica Stewart", "comment_text": "https://\nwww.google.com/\nsearch?q=concert\ns+in+italy+2023\n+september&clie\nnt=safari&sca_e\nsv=554760131&sx\nsrf=AB5stBjcQPv\nTM2uPKThr-ZUrw0\nG4HZTFig%3A1691\n493191930&ei=Ry\nPSZMWfOIqJwbkPn\nM68sAQ&oq=conce\nrts+in+italy+20\n23+s&gs_lp=EhNt\nb2JpbGUtZ3dzLXd\npei1zZXJwIhhjb2\n5jZXJ0cyBpbiBpd\nGFseSAyMDIzIHMq\nAggAMgUQABiABDI\nHEAAYigUYQzIGEA\nAYFhgeMgYQABgWG\nB4yBhAAGBYYHjIG\nEAAYFhgeMgYQABg\nWGB4yBhAAGBYYHk\njzMlDXB1irKXABe\nAGQAQCYAVmgAaoB\nqgEBMrgBAcgBAPg\nBAcICChAAGEcY1g\nQYsAPCAgoQABiKB\nRiwAxhDwgIKEC4Y\nigUYsAMYQ-IDBBg\nAIEGIBgGQBgs&sc\nlient=mobile-gw\ns-wiz-serp#fpst\nate=tlexp&htiq=\nconcerts%20in%2\n0italy%202023%2\n0september"}, {"username": "Giovanni Pianigiani", "comment_text": "https://\nsantacecilia.it/\nconcerti/\ncalendario-conce\nrti/\nhttps://\nconservatoriocom\no.it/eventi/"}, {"username": "Doug Burke", "comment_text": "Heard an impromtdu one in the Baptistry in Pisa. Acoustics were amazing!"}, {"username": "Nina Hod", "comment_text": "Heard beautiful churches' concerts in Florence and Venice."}, {"username": "Cecilia Hrefna Boye", "comment_text": "Opera in Verona is fantastic 🎼\n\nhttps://\nwww.arena.it/en"}, {"username": "Cecilia Hrefna Boye", "comment_text": "Opera in Verona is fantastic 🎼\n\nhttps://\nwww.arena.it/en"}, {"username": "Linda Chase", "comment_text": "Teatro La Fenice in Venice"}, {"username": "Alberta Brack McAviney", "comment_text": "Check Verona arena."}, {"username": "Miyuki Kanno Paul", "comment_text": "Check Teatro la Scala in Milano. Something may be available"}, {"username": "Donna Gilardone Szwabowski", "comment_text": "An opera at La Scala is always a treat.\n\nhttps://\nwww.teatroallasc\nala.org/en/\nseason/\n2022-2023/\nindex.html"}, {"username": "Maria NoBa", "comment_text": "Try this in Venice it’s 2-3 act opera in an actual palazzo, beautiful!\n\nhttps://\nwww.musicapalazz\no.com/en/"}]}, {"id": "2208997392832672", "text": "Hi everyone! We are trying to locate a delicious Rome vegetarian food tour and I'm not having any luck. I've found some vegan ones, but we are ok with cheese and don't want to omit that. I hope someone has one they can recommend. 😋", "link": "facebook.com/groups/1373361046396315/permalink/2208997392832672/", "likes": 0, "comments": [{"username": "Jenn Messina Babore", "comment_text": "Check eatingeurope dot com and click on the Taste of Testaccio. It is vegetarian friendly. You can also check a review of TripAdvisor, which has overall many positive reviews for this company."}]}, {"id": "2208994482832963", "text": "How many days you recommend in Rome and how many in Florence??", "link": "facebook.com/groups/1373361046396315/permalink/2208994482832963/", "likes": 44, "comments": [{"username": "Praveen Philip", "comment_text": "Life time in Rome"}, {"username": "Joanne Bordignon", "comment_text": "5 days Rome 4 Florence"}, {"username": "LuciaMarianne Arlotto", "comment_text": "6 for eack"}, {"username": "Donna Harrison", "comment_text": "We did 4 days in Rome when we first arrived staying right near Trevi Fountain then 4 days in Florence including a day trip to Siena, San Gimignano and Pisa which also included a beautiful lunch in Local Winery. Then another 4 days at the end of our trip in Rome staying in Prati next to Vatican City 🤗"}, {"username": "Natalya Yun", "comment_text": "We change our route from Rome to Sicily! We in love with Taormina!"}, {"username": "Janine Marie", "comment_text": "We did 4 in Rome and 3 in Florence. There are NEVER enough days in my opinion. 💚🤍❤️"}, {"username": "Debora Mazzierli", "comment_text": "3"}, {"username": "Becky Barlow Moore", "comment_text": "We are in Rome right now. Last day of 7 today then off the Venice. 7 days has been perfect but honestly I could spend another week here."}, {"username": "Iris Feiner", "comment_text": "4 days in Florence and a life time in Rome!! ❤️"}, {"username": "Frank LoStracco", "comment_text": "3 florence. 4 rome, 5 with a day trip from rome"}, {"username": "Joan Romiti", "comment_text": "3 in each"}, {"username": "Diane Badalucco Mussorici", "comment_text": "We did seven nights in Florence but did day trips in Tuscany. And 5 nights in Rome was just about right."}, {"username": "Tony Chow", "comment_text": "At least 4 full days each."}, {"username": "Jerry Chimienti", "comment_text": "We just did 6 in Rome and 8 in Florence. But lots of day trips in each…"}, {"username": "Jenny Kendrick", "comment_text": "Week in Rome, 3 days Florence"}, {"username": "Jennifer Wojack", "comment_text": "365"}, {"username": "Gaye Norval", "comment_text": "4 nights in each just to see the highlights."}, {"username": "Shelley Sclavos", "comment_text": "3/4 in each"}, {"username": "Sara Punis", "comment_text": "2 or 3 for Firenze and min 7 for Roma"}, {"username": "Háló-Tóth Blanka", "comment_text": "In Rome? For me only a lifetime would be enough\n\nKristóf Háló"}, {"username": "Rolyn Paderanga", "comment_text": "5-7 days in Rome then at least you have visited the popular attractio"}, {"username": "Krasen Kris", "comment_text": "For Rome you ll need an eternity"}, {"username": "Per Öberg", "comment_text": "For what?"}, {"username": "Donna Engelman", "comment_text": "I did 5 days in each and would reduce to 3 for Florence and as much time in Rome as possible. Take the train to the south for say trips."}, {"username": "Kimberly Whitaker", "comment_text": "4 days in Rome, the rest of your life in Florence!"}, {"username": "Matt Obadia", "comment_text": "5 minimum in Rome. 4 minimum in Firenze."}, {"username": "Fernando Leon", "comment_text": "In Florence stay 4 Days and go to Pisa , Siena and Montgiano. In Rome Stay al least 3 Days and go to Pompey"}, {"username": "Jessica Silverstein", "comment_text": "2 in Rose 5 in Florence"}, {"username": "Gillian O'Callaghan", "comment_text": "1 in Rome......all the rest in Florence."}, {"username": "Richelle Trezise", "comment_text": "We have booked 5 in Florence and 5 in rome"}, {"username": "Nancy Day", "comment_text": "Has anyone gone to Saturnia thermal baths in Tuscany region"}, {"username": "Nicole Miano", "comment_text": "we did 3 in rome and 2 in florence … perfect amount for us."}, {"username": "Barbara Fucci", "comment_text": "At least 3 each"}, {"username": "Jenny Cuevas", "comment_text": "We stayed 8 days in Rome, 7 in Florence…..hone\nstly, not enough and planning to go back. (Also, a week in Venice/\nMurano, but you didn’t ask for those….however, once you’re in Italy….🤷‍♀️)"}, {"username": "Carla Epifani-Worthy", "comment_text": "5 in Rome because of its size and the multitude of things to see so that you can relax in between. 4 in Florence with one being a day trip into Chianti."}, {"username": "Leena Palevaara", "comment_text": "A year, 🤣😉"}, {"username": "Tony", "comment_text": "5 Rome\n2 Florence\n2 Venice"}, {"username": "Mike Henderson", "comment_text": "At least 3 days in each. I would also recommend investing in a private tour guide. They can make your time much more efficient by bypassing a lot of long lines and more informative."}, {"username": "Tracy Pauls", "comment_text": "You can spend weeks in Rome. I’d say 5 in Rome , 3 in Venice if you have limited time."}, {"username": "Paula Stewart", "comment_text": "As much as you can x"}, {"username": "Kirsten Abrams", "comment_text": "Rome:2\nFlorence: 363"}, {"username": "Angie Barrantes Sotelo", "comment_text": "I did 4 days in Rome and was perfect and 4 in Florence as well 🤍"}, {"username": "Rebecca Yeoh", "comment_text": "Depends on whether you are a city person or scenic person when travelling. I did 4 nights Rome and 5 nights Florence. There is a lot to see within Rome. Florence is an incredible city in its own but also is a great base to explore the surrounds of Tuscany with day trips (and even Cinque Terre)."}, {"username": "Nanette Eustice Gatlos", "comment_text": "3 nights minimum in each"}, {"username": "Anna Coffa", "comment_text": "In Rome a few, in Florence forever. 😊"}, {"username": "Wolfgang Nitsch", "comment_text": "One at the most"}, {"username": "Lorella Calafiore", "comment_text": "365 days in Florence 😊"}, {"username": "Natalie J DeRasmi Saeger", "comment_text": "Never enough."}, {"username": "Suzanne Sorgi", "comment_text": "Forever and a day\nIn love with ITALIA"}, {"username": "Nancy Vahl Raske", "comment_text": "At least 4 in each"}, {"username": "Miyuki Kanno Paul", "comment_text": "Three nights absolute minimum. You won’t get enough though."}, {"username": "Marie Ryan", "comment_text": "3 in each"}, {"username": "Jerry Lyubelsky", "comment_text": "4 Rome 3 Florence"}, {"username": "Bill Dest", "comment_text": "2-3 each"}, {"username": "Debbie Fekete Gene", "comment_text": "Love Florence. Less time in rome and more time in Florence. So much to love about Tuscany !!!"}, {"username": "Cindy Stevenson", "comment_text": "4 in Rome, 2 in Florence"}, {"username": "Ivonne Paváan", "comment_text": "4 and 4 in each place at least"}, {"username": "Marie Montafia", "comment_text": "If you’re into history, you’ll enjoy 5 days in Rome no problem - there is so much to see in this beautiful city & I would do 2 days Florence & 2 days in surrounding Tuscany"}, {"username": "Carmen Marney", "comment_text": "What would you recommend to do in Rome?"}, {"username": "Chrysa Zournatzidou", "comment_text": "4 days in Florence and 5 days in Rome"}, {"username": "Sarah Gibson Oskey", "comment_text": "At least 4 days in Florence"}, {"username": "Julie Casteel", "comment_text": "Just did 3 in Florence and day trip to Tuscany and 4 in Rome. Perfection!!!!!"}, {"username": "Lisa Kelly", "comment_text": "4 nights in Rome and 3 nights in Florence."}, {"username": "Yvonne Burch Mercer", "comment_text": "We did 4 and 4."}, {"username": "Eileen Muro", "comment_text": "We did 3 and 3"}, {"username": "Rosa Butta D'Astolto", "comment_text": "Forever!!❤️"}, {"username": "Pam Armenia O'Brien", "comment_text": "I did 4 days in each"}, {"username": "Kathleen Wallace", "comment_text": "4 days in Rome and a lifetime in Florence 💖"}, {"username": "Caryn Goode", "comment_text": "We did 4 in Florence with 1 day in Sienna & wine tours. 3 in Rome."}, {"username": "Hagar Mohsen", "comment_text": "I love florence more than rome\nIt is an artistic , romantic , fancy city\nRome of course has it is own historical nature but too hot tooo crowded\nWatch out for theft 😢 i got robbed there"}, {"username": "Elena Innocenti", "comment_text": "how much do you like visiting places of art and architecture? the more you like it the longer you have to stay.\n\nAll the people talk about most know place, but Roma have many place outside common tourist routes.\n\nAppia Antica Park, Musei Capitolini, Galleria Borghese, Villa Giulia (most important museum of etruscan art), Gnam (modern and contemporary art museum), you can go to Villa Adriana in Tivoli, Ostia Antica, The Non-Catholic Cemetery (where they are buried Shelly, Keats, Goethe…), Coppedè district, villa torlonia, Giardino degli Aranci (a park with a beautiful view), EUR district (designed for EXPO 1942 by Piacentini, most important place for Rationalism architecture)…"}, {"username": "Kathy Mansk-Billehus", "comment_text": "We did 4 nights in Florence and 3 nights in Rome. We Loved Florence!"}, {"username": "Enrico Lecce", "comment_text": "More in florence less in Rome"}, {"username": "Ewa Olbrych-Rudzinska", "comment_text": "We did 5 and 5 and it was perfection"}, {"username": "Mike Guluk", "comment_text": "3 days 2 nights in each hundreds if other fabulous destinations"}, {"username": "Cindy Fugitt", "comment_text": "At least 5 days inRome and 3-4 days in Florence"}, {"username": "Veronica Mendez", "comment_text": "I would say a week each.. I been 9 times ti Rome and still discovering new places. Florence the same."}, {"username": "Michelle Murphy Margolati", "comment_text": "I think 2 nights is plenty in Rome. It’s very walkable and very crowded. Whatever you decide, enjoy your trip."}, {"username": "Tina Barnes-Grundmeier", "comment_text": "The rest of your life 💜💜"}, {"username": "Kit Nader", "comment_text": "3 Rome....2 florence...2 venice ( you can't not see venice)!"}, {"username": "Maria Harrington", "comment_text": "3 nights in Rome. 3 nights in Florence if plan to do full day trip to Tuscany from there. Enjoy! ❤️"}, {"username": "Barbara Bastianini", "comment_text": "It depends on how much time you have. My first European trip was for three months so I was able to spend 7 days in Rome and 5 in Florence. That was great for a first timer interested in history and art. On subsequent trips I spent less time in each but managed to leisurely visit and enjoy some of the less popular spots and that was great, too!\n\nIf time is a factor I personally would say at least 4 full days in Rome and 3 in Florence. But everyone’s different."}, {"username": "David Pye", "comment_text": "Depends, you can see Florence in a day if you only wish to look around. Rome takes at least a couple of days to see all the main sites"}, {"username": "Bob Lampo", "comment_text": "I would say 4 in each for the full experience"}, {"username": "Kelly Murphy Troup", "comment_text": "We had a really nice VRBO in Florence. Our host was FANTASTIC. He went above and beyond and when we couldn’t find a taxi, he rode the bus with us to the train station and helped us (we didn’t totally understand how the bus worked). Everything was about a 20-30 minute walk but we didn’t mind at all and it was so doable. We had a really nice amount of space and we were right across from the Boboli gardens if you are looking for a place in Florence!"}, {"username": "Ipek Gyi", "comment_text": "Recommendation for a hotel in Palermo for 1 night pls"}, {"username": "Shelly Seifert Lettieri", "comment_text": "We did three in Rome and 4 in Florence perfect"}, {"username": "Lynn Francisco Casella", "comment_text": "A week in each"}, {"username": "Michelle Bergman Davis", "comment_text": "We did 7 days in Florence that included 2 day trips. And we stayed 9 days in Rome. We would have loved a couple extra in Florence since there were some things we would still like to see."}, {"username": "Jon Hotter", "comment_text": "Our family did 5 in Rome, one excursion and 4 in Florence"}, {"username": "Carol McDonald", "comment_text": "Liferime"}, {"username": "Rose Turdo", "comment_text": "2 Rome .. 3 Florence"}, {"username": "Carol McDonald", "comment_text": "Lifetime"}, {"username": "Joanne Crismale", "comment_text": "3 days in Florence and a life time in Rome. This year will be my fifth time in Rome, there is always something more to discover as you peel back the layers."}, {"username": "Nina Sikand", "comment_text": "I did 5 days in Florence but to go to the Uffizi, Academia, Pitti Palace and Boboli Gardens as well as Chianti for a vineyard well 2 tours and even managed an impromptu opera visit loved it all. We bought the Firenze pass."}, {"username": "Laura DeCicco", "comment_text": "A lifetime in each but if you can’t do that then minimum 5-7 in Rome and. 4 in Florence, more if you want to base there and do day trips to the countryside and surrounding towns"}, {"username": "Karrie LeBlanc", "comment_text": "It depends on what you enjoy. Rome in the popular tourist spots is very busy and if that’s all you will do then 3 days may be enough and you might even have had enough of Rome and crowds by that point, but If you plan to wander neighbourhoods and explore and visit less busy but just as amazing musuems and historic sites then you can spend lots of time there as there are so many. Florence is an amazing city to wander and so many day trip options. I would say no less than 3 days but easily more. We have just left after 4 days in Rome (2nd time there) and 5 in Florence and wished we had more time in Florence."}, {"username": "Joanne Wright", "comment_text": "4-5 Rome and 3-4 Florence"}, {"username": "Dawn-Marie Adams Charpentier", "comment_text": "We did 2 weeks in Rome, was great..we walked everywhere, every nook and cranny..our dream came true."}, {"username": "Tamriko Chanishvili", "comment_text": "5 days in Rome and 3 days in Florence"}, {"username": "Teresa Helena Basevi", "comment_text": "Minimum 3 days in each"}, {"username": "Jeff Gentner EA", "comment_text": "In 4 trips to Italy, we have found that a minimum of 4 days in each place lets you EXPERIENCE, less than that, you are only SEEING."}, {"username": "Artur Kiełbasiński", "comment_text": "Rome - 4/5, Florence 3/4."}, {"username": "Dawn Falsinotti", "comment_text": "I’d say 3 in each."}, {"username": "Anthony Taylor", "comment_text": "3 days Florence,4/5 days in Rome"}, {"username": "Geri Elkin", "comment_text": "We did 5 in Rome and 4 in Florence. In both places without including side trips. Rome is so historically amazing 😍 🤩"}, {"username": "Ken Lerch", "comment_text": "I lived in Florence for a year a long time ago. If you aren’t able to dig into each for a slow travel experience and are doing the usual tourist visit: 5 Rome, 4 Florence. And if you doing side trips to places in Lazio and Tuscany, either add days to each or expect to compromise your experience of each."}, {"username": "Martine Huguet-Latour", "comment_text": "We spend 7 days in Florence because our flight was cancelled !It was awesome to just enjoy the city and live like the locals!\n4 days in Rome was perfect but we wish we could have stay in Trastevere for ever!😅"}, {"username": "Tango As", "comment_text": "3 days in Rome"}, {"username": "Lilian Villarreal", "comment_text": "I’d made 6 Rome and 6 in Florence…. Just fine, with the hot temperature and the time we spend walking, just perfect to go to the apartment to relax."}, {"username": "Kevin Andrews", "comment_text": "What do you want to see? If just the highlights 3 days each. You could spend a month both places and not see 1/2 of what is there."}, {"username": "Jerry Rice", "comment_text": "4 days each."}, {"username": "Liz Staab", "comment_text": "3-4 in each city! they’re gorgeous and there’s a lot to see/do/eat/\ndrink 🥰"}, {"username": "Gregg Pires", "comment_text": "3 full days in Florence not counting travel days and 3 in Rome"}, {"username": "To La", "comment_text": "For me, 1 week in Rome and 3 days in Florence"}, {"username": "Eliza Hatzivassiliadou", "comment_text": "3-4"}, {"username": "Tracy Rubenstein Calabrese", "comment_text": "2 in Florence and at least 3 in Roma."}, {"username": "Sue Wurz", "comment_text": "We in Rome this July for 4 days and it was just right. We saw all the “have to” and then a free day to go to Trastavere, Jewish Ghetto and some other sites. 3 days in Florence was enough when I was there a few years ago.\nEnjoy, it’s all beautiful!"}, {"username": "Suzanne Mills", "comment_text": "Minimum 1 week each"}, {"username": "Jenn Smith", "comment_text": "3-4 in Rome and we love a week in Florence!"}]}, {"id": "2208994216166323", "text": "We arriving in Rome on December 29th. We’ll be in Florence for New Years and a few days. Looking for a restaurant on the Arno to see the fireworks. Any suggestions? Driving to Sienna and staying with car for a few days. Where should we explore? Going back to Florence and then traveling to Venice for a few days. Going to Verona for a few days. Then returning to Rome for several days. Anything we should know? What type of weather should we expect?", "link": "facebook.com/groups/1373361046396315/permalink/2208994216166323/", "likes": 0, "comments": []}, {"id": "2208992786166466", "text": "Planning a trip for next Spring. What will be closed Easter weekend?", "link": "facebook.com/groups/1373361046396315/permalink/2208992786166466/", "likes": 1, "comments": [{"username": "Meredith Williams", "comment_text": "we had no issues being there over easter!!!"}, {"username": "Lauren Neely", "comment_text": "Everything was open! But more crowded…plan ahead for tickets and transport at that time."}, {"username": "Elena Innocenti", "comment_text": "Monday after Easter Vatican Museum for sure."}, {"username": "Lexy Kammler Puzzella", "comment_text": "We went over Easter in 2018. We were in Florence and nothing was closed. Some streets were blocked due to the parade they had for Easter by the Duomo but restaurants were all open. We caught a train to Venice that afternoon and everything looked to be open then."}]}, {"id": "2208982559500822", "text": "Looking for Airbnb rental with view of Trevi Fountain. Anyone stay in a great place they can recommend? Also, is that area a convenient location? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2208982559500822/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "look at this one https://\nwww.jdoqocy.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FVacationRen\ntalReview-g1877\n91-d9855727-Fon\ntana_di_Trevi_s\ntunning_view_of\n_the_Fountain-R\nome_Lazio.html"}, {"username": "Miyuki Kanno Paul", "comment_text": "It will be awfully noisy. Please reconsider"}]}, {"id": "2208982386167506", "text": "Going to Bologna, Rome & Milan in a couple of weeks. Is there a card I can buy that will cover admissions to several tourist attractions instead of paying for individual places to see?\nThanks Jacky", "link": "facebook.com/groups/1373361046396315/permalink/2208982386167506/", "likes": 0, "comments": [{"username": "Carmine Castiglia Jr", "comment_text": "For Rome, there is http://\nromapass.it/\n\nFlorence has similar; I presume Milan does as well and maybe Bologna."}, {"username": "Scott Perry", "comment_text": "If you like cocktails, you might want to go to Bologna's Guero on via Goito. Tell them Scott sent you! :D"}, {"username": "Jacky Lomas", "comment_text": "Thelma Laverty"}, {"username": "Christine Harwood", "comment_text": "Hey jealous of this, you could be here selling raffle tickets . Enjoy enjoy Jacky"}]}, {"id": "2208979049501173", "text": "Hello I am thinking of booking for March 2024 or October 2024 I want to take my son 12. Main places we want to visit is Rome, Florence and Venice. We are foodies my son will eat anything. The plan is to eat and drink wine through Italy. Question: which time is better weather? We are coming from Arizona.", "link": "facebook.com/groups/1373361046396315/permalink/2208979049501173/", "likes": 0, "comments": []}, {"id": "2208976076168137", "text": "We have a free day in Florence on a Sunday .. and a free day Rome on a Thursday.\nWould anyone have insight into day trips to Orvieto and/or Civita Bagnoregio? All our main sites are covered along with wine and cooking . Thank you for any suggestions!", "link": "facebook.com/groups/1373361046396315/permalink/2208976076168137/", "likes": 0, "comments": []}, {"id": "2208973346168410", "text": "Going to Milan for 4 nights in October. Any recommendations for restaurants, shopping, or how to dress for the weather?", "link": "facebook.com/groups/1373361046396315/permalink/2208973346168410/", "likes": 0, "comments": []}, {"id": "2208973166168428", "text": "We will be in Genoa the last few days of August until the beginning of th 2nd week of September. We are hoping that the water will be warm enough to swim. Your thoughts?", "link": "facebook.com/groups/1373361046396315/permalink/2208973166168428/", "likes": 0, "comments": []}, {"id": "2208970566168688", "text": "Planning a trip for my 60th. Probably September 2024.\nI want to see sorrento and Capri but want to see real authentic Italy. Off the beaten path, cobblestone streets, shops restaurants etc away from touristy places. Suggestions?", "link": "facebook.com/groups/1373361046396315/permalink/2208970566168688/", "likes": 0, "comments": [{"username": "Linda van Beest", "comment_text": "Go to Calabria. Altomonte, Morano Calabro, Tropea, Fiumefreddo, Civita, etc etc Fly on Lamezia Terme, rent a car and start exploring."}]}, {"id": "2208966572835754", "text": "Hi everyone. We r traveling to Italy soon n rented a car for Tuscany only. Is it true we need an Into license coming from the US to drive in Tuscany. Can anyone let me know. Thank you!!", "link": "facebook.com/groups/1373361046396315/permalink/2208966572835754/", "likes": 1, "comments": [{"username": "Bonnie Brauner", "comment_text": "Yes and you can get it at AAA"}, {"username": "Snapper Chris", "comment_text": "Thank you so much❤️"}, {"username": "Max Sorber", "comment_text": "Read you usually don’t need an international driver’s license to rent a car, but you do need it if stopped by police for any reason\n\nIt just translates your license into many different languages"}, {"username": "Santo Finocchiaro", "comment_text": "Yes, go to triple A if you are member. The International Driver's license cost is about $35 and is good for 3 months. There is no test. It is just a cash transaction. Just a heads up there are tolls on the highways."}, {"username": "Sandra Shoffner", "comment_text": "Yes"}, {"username": "Sandra Shoffner", "comment_text": "Google Driving in Italy."}, {"username": "Miyuki Kanno Paul", "comment_text": "Go to AAA and make an International Driving Permit. It’s good for one year from the date of issue."}, {"username": "Paul Anderson", "comment_text": "Some rental car companies demand an international driver’s license, but it is a joke. pay 20$ and with no test or instruction your given an international driver’s license. It is only about the money. I used to get one but for the last 20 years not. Never been a problem."}, {"username": "Andria Saia", "comment_text": "Yes you need an IDP which just translate your license to Italian - very easy to get at AAA"}, {"username": "Mario Torre", "comment_text": "Yes, legally, if you get pulled over, they need to be able to read your driver’s license. If it is in English or French, you are in big trouble. Could impound your car."}, {"username": "Daisy Yoo", "comment_text": "yes, go to AAA, if u are a member, download the application, get 2 passport type of photos and $20, the license is good for a year, I just got them a months ago and I told them we need them in oct and she wrote to start oct 1st until oct 1st 2024"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2207012059697872", "text": "***What is the best option for accomodation… hotels or airbnb?***\nThanks All!\nI think I’ll do a combination.", "link": "facebook.com/groups/1373361046396315/permalink/2207012059697872/", "likes": 3, "comments": [{"username": "Jon Cheeks", "comment_text": "I would say hotels. We did both. First spot was a renaissance mansion air bnb which was a good experience but after that all hotels with air conditioning."}, {"username": "Mat PO", "comment_text": "Hotel... Always…"}, {"username": "Vivien Paulik", "comment_text": "Where? How many people?\nI say aparment. I prefer it. But others like hotels more. I like being more independent"}, {"username": "Greg Saba", "comment_text": "Airbnb and verb generally provide more bang for the buck (apartments and houses with more space than a hotel and, of course, a kitchen). However, be forewarned that both airbnb and verb are simply listing services. They take little responsibility if you are unhappy with your space. And, more importantly, they provide virtually zero support if the host cancels on you, even if iy is literally at the last second. Hotels almost always will take care of you. Booking dot com is a middle of the road booking agency that sometimes has fewer fees than airbnb, often with the same places, and some of their hosts claim that booking will support you if you are cancelled."}, {"username": "Kris Beacham", "comment_text": "Hotels. Air bnbs are iffy."}, {"username": "Scott H Fɭƴŋŋ", "comment_text": "I've stayed in multiple beautiful airbnb.. all over the world and not once have I had issues"}, {"username": "Antonia Dosik", "comment_text": "It depends. If you are going to be in one place for 5 days or more, I would recommend an Airbnb. You get much more room for less money per night. But you need to supply yourself with your own meals or eat out."}, {"username": "Paula Brink", "comment_text": "Hotels always."}, {"username": "David Perillo", "comment_text": "I’m just finishing up a six week tour. Airbnb all the way. Fantastic. Your part of the neighbourhood. You have your own pad. Like you live their. Most are self check-in and none were iffy. Hotels are good if you need it for just one night."}, {"username": "Carter Boughner", "comment_text": "Hotel… I’ve heard horror stories of Airbnb’s cancelling at the last minute and being filthy"}, {"username": "Trevor Brown", "comment_text": "A combination of both for us worked well. It depends on your budget. Airbnb was always great and remember to read reviews. They also allow you to wash and dry clothes while you are away provided they have those facilities.😀"}, {"username": "Eileen Lonergan", "comment_text": "I prefer hotels"}, {"username": "Enrico Lecce", "comment_text": "Remember it's the location and ambience that surround us which finds our way into happiness..."}, {"username": "Roland Trego", "comment_text": "Last-minute cancellations are certainly not unheard of with Airbnb’s and they leave you in the lurch. One reason I don’t like Airbnb’s is because there is typically a limited time you can check in, and it’s normally sometime in the afternoon (often because the owner or manager has a regular job). If you arrive earlier, you may need to find somewhere to store your bags. If you choose an Airbnb, you need to choose one that has a long history of positive reviews and read each review thoroughly. Even then, it’s my understanding that hosts can have negative reviews removed. If there is an issue when you arrive, you must report it immediately to Airbnb. Don’t wait overnight."}, {"username": "Jerry Kiger", "comment_text": "Question — amount of people? Searched and seemed hotel can only do about 3 people per room. If have 5-6+ … would ABB be better regardless? Thinking apartment type. Thanks any input"}, {"username": "Kn Blanchard", "comment_text": "As a family of 5, we find AirBnB"}, {"username": "Jessica Nichols", "comment_text": "We’ve done a mix of both and it’s been so great. Especially when the Airbnb has washer/dryers!"}]}, {"id": "2208958019503276", "text": "Can anyone recommend a driver to pick up from Naples train station drop off in Sorrento then pick up drop back to train station in the evening? Thankyou", "link": "facebook.com/groups/1373361046396315/permalink/2208958019503276/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Naples/\nPrivate-Transfer\n-from-Naples-ho\ntel-airport-tra\nin-station-to-S\norrento-hotel/\nd508-51921P33?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}]}, {"id": "2208952866170458", "text": "What is the best travel/dual voltage steamer? Could it convert? Packing/compressing clothes into a carry on and would prefer not to be super wrinkled…", "link": "facebook.com/groups/1373361046396315/permalink/2208952866170458/", "likes": 2, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\namzn.to/47kLycS"}]}, {"id": "2208946989504379", "text": "Hey! Looking for suggestions for a winery tour in Montepulciano. Thank you!!", "link": "facebook.com/groups/1373361046396315/permalink/2208946989504379/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/\nMontepulciano/\nMontepulciano-Wi\nnery-Tour-and-T\nasting-Experien\nce/\nd27742-116773P74\n?pid=P00070587&\nmcid=42383&medi\num=link&medium_\nversion=selecto\nr"}, {"username": "Rachael Lynn", "comment_text": "Robbie Padovano"}, {"username": "Bonnie Brauner", "comment_text": "Cool tours by anna"}, {"username": "Kn Blanchard", "comment_text": "I Cipressi Winery\nWe just went last week, it was a great experience at a small family run vineyard"}, {"username": "Stephanie Lee Garcia", "comment_text": "I saw a video on Talosa Winery. Looks pretty."}, {"username": "Jackie Linenthal Tambone", "comment_text": "We toured Fèlsina that is not too far from Montepulciano. Delicious wines and sparkling wine. Very nice people."}, {"username": "Laura Dienzo", "comment_text": "There’s a very cool winery right in the center of the town of Montepulciano. Great wines too! https://\nwww.cantinaderic\nci.it/en/"}, {"username": "Jonelle Bindl Gilden", "comment_text": "Sommeliers Choices with Tom💕"}, {"username": "Terri Dalton", "comment_text": "Lucy Lopardo Tour Guide is the best! She will arrange everything!"}, {"username": "Carol Nagle", "comment_text": "Female owned and really great wine, grappa and olive oil- Solaria amazing!"}, {"username": "Norm Utech", "comment_text": "have lunch at the Borgo tre Rose and also visit Poliziano winery and for olive oil tasting FRANTOIO BURASCHI"}, {"username": "Gabriella Bruyere", "comment_text": "Montalcino nearby: paradiso du frassina where they play music for the vines!!"}]}, {"id": "2208944516171293", "text": "Greetings All 🖐\nI am excited to be bringing my Australian family to Italy in January. I have one part of the trip that I am unsure of. We are using public transport and need to get from Tirano to Madonna with three nights somewhere in between.\nWe are catching the Bernina Express from Switzerland on Friday 5th January arriving Tirano in the middleआणखी of the day. The next place we need to get to is Madonna di Campiglio on Monday 8th January. I have the time between these dates to organise and we prefer a picturesque town to relax in and enjoy a slower few days. Have looked at Bergamo, Brescia and around Lake Como (all look great). I am most conscious of ease of travel. What do you think?\nPS transport to Madonna appears awkward, do you have suggestions for that also? FYI Our kids are 12 and 14.\nThank you 🙏", "link": "facebook.com/groups/1373361046396315/permalink/2208944516171293/", "likes": 0, "comments": [{"username": "Ilonka Sinkeldam", "comment_text": "Train to Varenna and stay there near lake Como. I hope you understand it can be freezing in January…."}]}, {"id": "2208944132837998", "text": "Looking for a hotel for two nights near Pantheon. Want a location central to walk everywhere, with lots of cafes and scenery. Maybe Novana Theatre Hotel?? Anyone know anything about that hotel or welcome any suggestions. Thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2208944132837998/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.kqzyfj.com/\nclick-100692842-\n12291623?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.it\n%2FHotel_Review\n-g187791-d71346\n44-Reviews-Pala\nzzo_Navona-Rome\n_Lazio.html"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.anrdoezrs.ne\nt/\nclick-100692842-\n12291623?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.it\n%2FHotel_Review\n-g187791-d23055\n8-Reviews-Hotel\n_Pantheon-Rome_\nLazio.html"}]}, {"id": "2208943409504737", "text": "Update: based on a lot of advice from my earlier post, we have decided not to rent a car and instead just travel by train.\n\nWe are planning on spending 2-3 days in Florence, where do you recommend for a day trip? Chianti, Sienna, Pisa, or Lucca? We would only have time for one of these places, and of course will have an 18-month old with us if that makes any difference.\n\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2208943409504737/", "likes": 3, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Florence/\nPisa-Siena-and-S\nan-Gimignano-Da\ny-Trip-from-Flo\nrence-Including\n-Lunch/\nd519-6367TOUR7?p\nid=P00070587&mc\nid=42383&medium\n=link&medium_ve\nrsion=selector"}, {"username": "Valerie Nicole", "comment_text": "We did this amazing tour with Walks of Italy that took you to Chianti, Siena, and San Gimignano. Highly recommend! Good luck!\n\nhttps://\nwww.walksofitaly\n.com/\nflorence-tours/\ntuscany-day-trip\ns-from-florence\n/"}, {"username": "Michael Broadwater", "comment_text": "Keep in mind, Chianti is not a city but a wine region."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Day trip definitely Siena and Chianti area."}, {"username": "Chiara Codecá", "comment_text": "Chianti is a whole area, not one place. Lucca is one city, small, stunningly beautiful, very elegant and full of things to see (and great stores). Check it out."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Lucca."}, {"username": "Jim Kelleher", "comment_text": "Siena, no doubt."}, {"username": "Robin Burrell", "comment_text": "Lucca and Sienna were just wonderful, I guess Lucca was my favorite but not by much"}, {"username": "Kate Laidlaw", "comment_text": "We just did a fantastic day tour including wine, cheese and olive oil with Grape Tours from Florence. One of our favourite days of our 4 week Europe trip.\n\n(Do check you can take your bub though)"}, {"username": "Mckoen Lujie", "comment_text": "I will use Florence as a base for day trips to Venice, as we’ve decided to go south along the Italian coast."}, {"username": "Karen Schmidt", "comment_text": "I’ve been to Siena, but not Lucca. Siena is very beautiful, hilly and the train station about 20-25 minutes walk from the center of town. Lucca is supposed to be equally beautiful, flat, with a lovely park on the medieval wall, and the train station very easy to reach . With a toddler, I’d pick Lucca"}, {"username": "Miyuki Kanno Paul", "comment_text": "Siena is an easy day trip destination. It’s worth visiting.\nChianti is a wine region.\nPisa is not much to see after climbing up the steep and narrow stairs to the top of leaning tower. Mind you, that if you are at the top at the “wrong time”, all the bells start pounding and you will be deaf for a few minutes😅.\nLucca makes more sense if compared to Pisa.\n\nIt’s your call"}, {"username": "Jerry Kiger", "comment_text": "Mind if I ask what was deciding factor for you train over car? I’m leaning car with 6+ group, will be Rome, Florence, Venice but also want drive CT, Tuscany. Etc. no right or wrong I’m still considering which 🚂 or 🚗… thank you any input"}, {"username": "Elizabeth May La Duca", "comment_text": "4 days just Florence was barely enough for me [no baby, no stroller] …I enjoyed San Giminiano but very hilly…carry an extra pair of comfortable walking shoes/\nsneakers…cobbles\ntone streets are hard on your hips, legs, feet !! …l would not attempt Siena with a stroller, unless you walk slowly"}, {"username": "Deborah Schroeder", "comment_text": "You can do Lucca and Pisa together easily in 1 day. I went by train the direct line to Lucca from Florence and stayed there all morning and had lunch. Took the train to Pisa, get off at the first stop, it is a short walk from there to the Field of Miracles. You can walk back to that train station, but the trains run infrequently, or you can walk to the main train station and get back to Florence in time for an early dinner. No hills to climb and easy walking all around."}, {"username": "Lean Ni Chleirigh", "comment_text": "If I was travelling with an 18 month old, I would be careful to arrange only one structured activity each day and keep time free for child friendly activities. Find things like parks and playgrounds.\nAlso, when we were in Italy with a 12 month old, the heat caused her to completely change her nap schedule. She did huge naps during the day and was awake much later than normal. She slept in the stroller so it was fine, but if your little one isn’t used to the heat, it might work out that way."}, {"username": "Rebecca Yeoh", "comment_text": "Siena is amazing, the wine region of Chianti is beautiful and not far from Siena. You could perhaps do lunch at a winery…it could also allow a great time for your toddler to run around. I wouldn’t bother with Pisa. It’s honestly just the tower to see, there’s nothing else and it is heaving with tourists. It can be missed."}, {"username": "Sarah Magnusson", "comment_text": "We loved Siena and Chianti. Would recommend you book a tour if you don’t want to drive yourselves as train isn’t that straightforward\nto reach the best areas. We drove with no problems, picked up a rental from Florence near the train station and returned it at the end of the day. It gave us the freedom to visit lots of small villages during the day, was fantastic.🙂"}, {"username": "Leslie Goodland", "comment_text": "Stay in Florence. Plenty to see and do."}]}, {"id": "2208941106171634", "text": "I'm travelling from Australia to Italy.. During my stay I have a flight from Bari to Catania.. Is the procedure the same as for international flights? TIA", "link": "facebook.com/groups/1373361046396315/permalink/2208941106171634/", "likes": 0, "comments": [{"username": "Sally Warren", "comment_text": "No, it’s a domestic"}, {"username": "Fiona Cameron", "comment_text": "What procedures are you concerned about? If you can be a bit more specific Im sure you will get the assistance you need 😊"}, {"username": "Jenny Payne", "comment_text": "I’m Australian and go e dry year to Italy , check how much you are allowed to take ( hand luggage) 🌻"}]}, {"id": "2208939639505114", "text": "From the United States what tour guides would you recommend for first time going to italy", "link": "facebook.com/groups/1373361046396315/permalink/2208939639505114/", "likes": 0, "comments": []}, {"id": "2208936939505384", "text": "Just briefly back in Naples on our return journey from Procida. Struggling to fall in love with the city . ..\nIf you had one day here ,apart from Pompéi and the archeological museum which we saw and loved , what would you do.what made you love the city ? Things you did ,places you went ,where and what you ate which feel super napolitain.\nGrazie Mille.", "link": "facebook.com/groups/1373361046396315/permalink/2208936939505384/", "likes": 0, "comments": []}, {"id": "2208933256172419", "text": "What do I pack for a 23day trip to Europe from 4th week of Aug to mid Sep?\nTips and suggestions please.", "link": "facebook.com/groups/1373361046396315/permalink/2208933256172419/", "likes": 108, "comments": [{"username": "Anne Marie Reynolds", "comment_text": "As little as possible! Don’t do what I did! It’s hot you won’t wear 80% of what you pack!"}, {"username": "Judie Mc Adam", "comment_text": "If it’s like this year at 40 odd degrees light clothes my family are just returning from a holiday camp outside Rome today saying it’s been really hot"}, {"username": "Michelle Bini", "comment_text": "Paracetamol and first aid. European pharmacies can be expensive"}, {"username": "Anne Remosil", "comment_text": "Shop as you go along, weather could be changing from one country to next. 😉"}, {"username": "Eva Szalai", "comment_text": "Raincoat"}, {"username": "Alexandra Marks", "comment_text": "Essentials and buy fabulous things there!! Enjoy"}, {"username": "Jennifer Swift", "comment_text": "Here’s my little trick…\nI pack my fav travel\npillow and then when I need the space for all my new purchases I leave it behind.\nIt keeps me from overpacking at the beginning of my trips and leaves space if I need it at the end. I’ve left pillows all over this planet. 😂"}, {"username": "Louise Wyldbore", "comment_text": "Travel light... trains, metros, buses, stairs etc are difficult if you're carrying alot..."}, {"username": "Rita Follacchio", "comment_text": "Annalise Tahtatzis 🤔"}, {"username": "Leslie Eddy", "comment_text": "Tanesha Eddy 🥰"}, {"username": "Kenly Krag Trigonoplos", "comment_text": "Depends on what you are doing while you are there. According to the comments below I way over pack when traveling to Europe 😂. I have a rolling suitcase and a carry-on. I’m not much for washing clothes while on vacation unless I’m in an AirB&B."}, {"username": "Diane Dillon", "comment_text": "Not as much as I did for 6 weeks! 18.5 kilo on the back…10 plus on the front 🫣.lightweight and layers. 1 good pair of walking shoes. 1 sandals. A wrap or light jacket. Now that said WHERE in Europe"}, {"username": "David Schubert", "comment_text": "Nick 🤔"}, {"username": "Susan Hagy", "comment_text": "Pack enough for 1 week and plan on doing wash maybe twice. Undies you can wash in the sink as you go. Most things should be mix and match\nMabe 2 pants, 1 shorts 2 dresses or skirts. 1 flip flops or water shoes for beach, 1 sandle, 1 sturdy sneakers for lots of walking.\nWe are on our last 3 days of a 4 week trip with Just 1 carry-on each and 1 personal bag for my husband, like a sm backpack with our toiletries and meds, my personal bag is a medium size purse.No worries about airlines loosing our luggage!"}, {"username": "Natalya Yun", "comment_text": "Shorts! Couple of dresses shoes and snickers. But trust me you will still pack more than we need:))"}, {"username": "Esther Misrahi Elting", "comment_text": "Get the packing cubes for your luggage. Best thing ever and easy to pack snd unpack with them!"}, {"username": "Michael Barnes", "comment_text": "Clothes and money."}, {"username": "Barbara Burton Horstmeyer", "comment_text": "I am going the same time for same length. Less is best. I carry either one backpack or one suitcase. 1 blue jean, two skirts, 2 shorts, 4 tops\nFew toiletries as you can get them in europe.\nHave fun!"}, {"username": "Paul Anderson", "comment_text": "Don’t worry to much about it as everything you need can be bought there if you forget something. Bring twice as many underwear as you think you need."}, {"username": "Deborah Benitez", "comment_text": "Wardrobe Staples and check the weather"}, {"username": "Lisa Pedrini", "comment_text": "When I pack to stay with my sister for 4 days I always think if I took exactly the same things I could stay for a month. So pack like you're just going for a few days, with pieces that can layer and coordinate with other pieces. Take a scarf or 2 to make different looks - or buy a scarf there. No more than 3 pairs of shoes including the bulkiest ones that you wear on the plane -- those should be extremely comfortable walking shoes."}, {"username": "Debora Mazzierli", "comment_text": "Good question. Weather this year is pretty crazy.\nNow is warm in Tuscany but last weekend was cold !!!"}, {"username": "Loretta Fabbro", "comment_text": "As little as possible and i went with a carry on"}, {"username": "Robert Chiatello", "comment_text": "Denise"}, {"username": "Deborah Coplein", "comment_text": "Southern Europe will still be hot. Northern Europe will be cooler. England will be rainy. Make sure you have 1 or 2 sweaters and a rain jacket with a hood."}, {"username": "Jules Winter", "comment_text": "You don’t say if you are a single destination or touring. Or what part of Europe you are covering. If it’s a beach holiday you won’t need much other that your swimming cozy, shorts and T’s. Otherwise it really depends on what you’re doing."}, {"username": "Sharon May", "comment_text": "Layers"}, {"username": "Wendy Johnson", "comment_text": "Bring laundry sheets so you can do laundry, since you won’t want to pack for 23 days."}, {"username": "Janene Facey", "comment_text": "Gosh Karyn McCluskey , I did a cull prior to disembark 😂fingers crossed not too much packed once we get to Italy 🇮🇹.. having fab time in London xx 😘"}, {"username": "Marissa Welsby", "comment_text": "Going on Mediterranean cruise on /11 October, what will weather be like then"}, {"username": "Nancy Cicinelli", "comment_text": "Comfort is key carry on should be smaller then you think they charge 100.00 if not especially coming back and back pack... Many airlines on strike too"}, {"username": "Tracy Wagoner", "comment_text": "I'm considering visiting the local thrift store/goodwill for some inexpensive outfits that can be treated as disposable when coming home. This will free up space for souvenirs in the suitcase on the return trip."}, {"username": "Catherine Nichols", "comment_text": "Agree with all the comments to take less outfits, more room for shopping and a lighter suitcase is better. My big tip is packing bags, they were so useful and kept my suitcase neat and organised. I had a cheap set and a proper set from a travel shop, both worked well.\nHave a great trip 😊"}, {"username": "Patty Ham", "comment_text": "What part of Europe? Most of it will still be summer hot."}, {"username": "Michael P. Garcia", "comment_text": "One carry on bag should be all you need. I find one pair of shoes and kicks or foot let’s for around the room are all I need.\nPlenty of places to do laundry or have it done.\nLook at Rick Steves sight for packing advice. Go and have fun.\nEven if I pack too much I find myself drawn to the same outfit every day."}, {"username": "Angel Garcia", "comment_text": "Just so you know this is an AI bot!"}, {"username": "Teresa D'Alessio", "comment_text": "Enjoy"}, {"username": "Anna Williams Johnson", "comment_text": "As little as possible - mostly black."}, {"username": "Deborah Willson", "comment_text": "Following"}, {"username": "Susan Lowry Lamb", "comment_text": "Mix and match layers, and have some laundry done."}, {"username": "Patricia Skea Tsairis", "comment_text": "Shorts, cotton t’s, cotton skirts, ￼sundresses, light scarf to cover shoulders as needed, (stretch cotton undies that go down thighs for skirts & dress), baseball cap or visor, sunscreen, swimsuit, dark sneaks, sandals with arch support. Cotton bra.\nI used to live there, and taught School. Schools didn’t go back until late September because it’s always so hot."}, {"username": "Bill Dest", "comment_text": "A place to clean your cloths when you are over there.Summer cloths for sure."}, {"username": "Tremayne Mushayahama", "comment_text": "My rule is whether it's a week trip or a month or 2 months , I always pack the same carry-on."}, {"username": "Laura Neill", "comment_text": "Some Italians leave the city in august, you might want to chec that out"}, {"username": "Jacqui Bridges", "comment_text": "Sun dresses and sandals, a hat."}, {"username": "Jeni Noriega", "comment_text": "Linen"}, {"username": "Michele DeMotto", "comment_text": "I just got back from a month in Italy and France. I took a large suitcase and a carryon. I ended up leaving/\nshedding clothes all over the place. Way WAY over packed. When it came down to it, I wore the same four linen dresses and a couple of very light weight dresses ( all bought there). The entire wardrobe that I actually wore, fit into my carryon. One last thing, nothing is worse than lugging a heavy suitcase, carryon and purse up several flights of stairs in train stations in over 100+ heat!"}, {"username": "Shari Powers Roberts", "comment_text": "I’d pack for one week and make sure you have access to a washing machine. We spent a month in Paris that way."}, {"username": "Denise Lessard", "comment_text": "Débarbouillette\n."}, {"username": "Lucrezia Folger", "comment_text": "Dress in Layers\nWear extremely comfortable shoes or walking sandals.\nDress in cotton pants, maxi/midi skirts, or leggings.\nWear light cotton T-shirts.\nBring a light cardigan or sweater for when it's cooler.\nBring a travel umbrella or light rain jacket that fits in your day bag."}, {"username": "Russell Weidner", "comment_text": "Pack light and use the local laundries"}, {"username": "Cyndi Wheelock Castillo", "comment_text": "Following"}, {"username": "Diane Pieri Adiliano", "comment_text": "Whatever you like"}, {"username": "Ria Diam", "comment_text": "Depends on the countries....di\nfferent weather on the Mediterranean, different on Northern countries. Which countries you will visit?"}, {"username": "Sandy Michelle Duggan", "comment_text": "As little as possible, I packed far too much. light comfortable clothes,"}, {"username": "Pam Deluca Spicer", "comment_text": "Not much it’s nice weather"}, {"username": "Pam Deluca Spicer", "comment_text": "September you might need a couple of long sleeves it could cooler depending where you are"}, {"username": "Josie Mammone", "comment_text": "Clothes!"}, {"username": "Kevin Stuart", "comment_text": "When I pack always use my hands."}, {"username": "Diane Leesmith", "comment_text": "Keep in mind that If flying between countries in Europe carry on / check in luggage rules eg size /weight is different to that travelling long haul ie USA to Europe."}, {"username": "Diane Leesmith", "comment_text": "Take enough for a week then wash as needed after two weeks. Layers. Prepare for rain.\nPlus depends where in Europe you’re going and weather varies a lot."}, {"username": "Sharon Borg", "comment_text": "Layers is the best as it can get chilly in the evening so having a cardigan and light raincoat in case of rain is helpful."}, {"username": "Miyuki Kanno Paul", "comment_text": "Breathable clothing. Cooling towel or two. Sunscreen. A hat. An umbrella. A light jacket in case it gets chilly in the evening(dependi\nng on where you go). A pair of backup shoes. Flip flops for your accommodations in case your hotel doesn’t supply slippers. Research a potential local laundromat. Have a slack day for laundry. Even if your rental apartment has a washer, usually no dryer. Be prepared to hang dry"}, {"username": "Debi Ann Marie", "comment_text": "I would like to fit in your suitcase please"}, {"username": "Rachelle Ethington", "comment_text": "This is such a no size fits all question. Pack whatever you need, whatever you want. Some people are okay with wearing clothes over and over again, same shoes and one outfit per day. Others like yo dress for dinner, accessories and activity specific clothing and shoes. Do you."}, {"username": "Suzie LG", "comment_text": "A belly bag was very useful to keep all your cash/credit cards in front of you. Also, a light rain jacket with a hoodie in case it sprinkles is helpful."}, {"username": "Cristiane Silva", "comment_text": "Definitely use the rolling method saves a lot room. First 10 comments have great suggestions for what kind clothing to take but my main suggestion to you is: super confortable sneakers/ shoes 2 or 3 .You will be walking all day long. Enjoy your trip"}, {"username": "Billie Frances Swanda", "comment_text": "Cool clothing not warm"}, {"username": "Margaret Temple", "comment_text": "Patience for sure lol"}, {"username": "Allan Jaworski", "comment_text": "5 days worth of clothes, a single pair of comfortable shoes, a computer tablet and smartphone with some good reading, language instruction apps, restaurant reservation apps, Google Maps, and some basic toiletries. Your hotel will help you figure out how to clean the clothes. You can buy anything else you need."}, {"username": "Candace Beutell Gardner", "comment_text": "Color coordinate as much as possible: navy blue, black and Khaki. So 3 pairs of slacks and 5 tops. A week of undies, 1 outfit to sleep in, maybe some slippers. A lightweight jacket for cooler weather and showers. Maybe 2 sweaters and another pair of shoes. Socks -- 7 pair. Small bottle of laundry soap. When you hand wash items, lay them on a towel on the floor. Wrap towel around item and roll it up. Then kneel on it. Won't take long for items to dry."}, {"username": "Elisha Lynn Simon", "comment_text": "Use a back pack and a carry on. Buy clothes from the thrift store. That mix and match. At the end leave the clothes behind and pack your suitcase with souvenirs. Do not overpack."}, {"username": "Phyllis Lahn", "comment_text": "The temps are unseasonably warm this year. I traveled 21 days with a carryon in October a few years back. A lot of the accommodations do not have elevators or porters. My budget was modest, did not stay in 5 star hotels, but Airbnb. Some better than others. If you are lugging a suitcase, train travel is a challenge with a large bag."}, {"username": "Millie Rodriguez", "comment_text": "Sundresses and sneakers"}, {"username": "Susan Cantafio", "comment_text": "I need the same advise"}, {"username": "Kaidi Essi", "comment_text": "Nothing - buy everything there 🙂"}, {"username": "Juliet Lee", "comment_text": "Where in Europe ? Weather varies so much 😜"}, {"username": "Paulyn Hoffman", "comment_text": "Less is More. Pick a color palette…everyth\ning goes with that. The weather will be warm. Maybe a poncho in case of rain. Comfy day shoes with socks and evening flats. A FannyPack for sight seeing. 1 scarf to throw over your shoulders for restaurants with AC, if you sit inside. Suntan lotion. Good foot cream. Copy your Pass Port.."}, {"username": "Imma Marie", "comment_text": "Lots of linen, shorts, light weight clothing"}, {"username": "Sheyla Enrich", "comment_text": "ITA airways allows only 17 lbs carry on! The carry on itself is 5lbs. I can't imagine myself packing two weeks within the limit.🤔🤔."}, {"username": "Anna Prince", "comment_text": "Nike Jordan super play sliders. Or nike Asuna 2 - thank me later 😊 honestly the first one look so cute with Summer dresses. I completely abandoned other footwear 😂 (six weeks here)"}, {"username": "Jerilyn Cunard", "comment_text": "Birkenstocks, for sure!"}, {"username": "Stephanie Saenz Bauer", "comment_text": "Not much take carry in only and do laundry"}, {"username": "Sharon O'Mahony", "comment_text": "It's up to u girl😍don't mean to sound bad, but do what u want"}, {"username": "Susan Derrico", "comment_text": "Black"}, {"username": "Jenny Payne", "comment_text": "Don’t take the world. Linen,silk,cott\non are the only fabrics that I travel with these days + the best sneakers & a pair of leader sandal’s. I have been going to Italy for 16 years and have learnt less is best 🌻"}, {"username": "Tracy Afflick", "comment_text": "Not much August & early Sept are hot. If you find you need something buy it there at the time. 2 of everything. 2 tops, 2 pairs of shoes, 2 pair of pants (1 pair needs to be white) 2 dresses ect. Check out the long term weather patterns for the area of Italy you are going to. Italy is very hot at the moment"}, {"username": "Sany Zadrapova", "comment_text": "Depends which countries in Europe you are visiting… without knowing that we can’t help you 🙂"}, {"username": "Margot Christensen", "comment_text": "Pack as little as possible!!!"}, {"username": "Patti Bauman Widener", "comment_text": "I’m packing for 3.5 weeks in Italy, August 16-September 11.\nThe temps will still be warm. I am taking 2-3 capris, 2 skirts, one nicer dress, hiking pants( for Dolomites), 2 shorts, several tees and tanks, long pants for the plane. No jeans, too heavy for summer, maybe a pair of linen pants. Underwear, swim suit and PJ’s. Haven’t figured out shoes yet. I’ll wear my saucony’s most days, one pair of sandals and hiking shoes. I’ll put in rain gear, a pashmina and one light sweater.\nWe will be in northernItaly and Cinque Terra. We traveled this time of year in Rome Florence, and Tuscany two years ago, it was warm, no need for jeans.\nI’m sure this list will be whittled down by the time we leave next week, as we are staying in Airbnbs and home exchanges, so we will have access to laundry.\nReally hoping to pack lighter than last time."}, {"username": "Jennifer Neese Neal", "comment_text": "Layer your clothing, comfy shoes and a rain coat"}, {"username": "Lorraine Swick Sanfilippo", "comment_text": "Less than you think"}, {"username": "Carole Tarlap", "comment_text": "There are laundromat.....\nwe used them in Rome and Florence. CLEAN and easy. You can also drop off your clothes they will do them for you, than come back and pick them up. Hotels $$$$$$$ 💯 Wished I'd have brought less clothes 🤷💥"}, {"username": "Evy Fredy", "comment_text": "Last fall traveling different cities in Italy by train, I had 2 capris, 3 tee’s which I ended up using only 2 and washing them whenever I could, 1 pair of jeans that I only used once as the weather was still warm, a pair of tights to travel with, underwear socks, toiletries and 2 pairs of shoes, one pair of sneakers and one pair traveling back. Even then I felt like I had plenty of things for 3 weeks ! A sweater that I dragged because it was too warm, only used it on the plane! Don’t stress missing some stuffs, they have plenty of stores in Italy to get what you forgot ! Enjoy and have fun!!"}, {"username": "Diana Occhipinti", "comment_text": "Can't go wrong with this list!\n\nhttps://\nd3dqioy2sca31t.c\nloudfront.net/\nProjects/cms/\nproduction/000/\n014/077/\noriginal/\n586156d1a1849a3c\nb0a2bc1b10693ba\n1/\nRickStevesPackin\ngList.pdf"}, {"username": "Lisa Akira", "comment_text": "Supportive, closed-toe shoes\nSupportive sandals\n2 loose slacks\n2 skirts\n3 nice knit tops\n3 blouses\n1 light cardigan\nPower adapters\nPhone charger\nLight toiletries\nUnderwear\nBathing suit\nDon’t overpack! It’s hard to drag luggage on cobblestones and stairs. If you need something else you can buy it there."}, {"username": "Frank Huber", "comment_text": "I try and book VRBOs with washing machines and I also had some guesthouses that offered washing."}, {"username": "Tissie McClure", "comment_text": "Pack a foldie type bag in the bottom of your suitcase to bring back your souvenirs! ￼ I did that on a 33 day journey through Europe and so glad I did!"}, {"username": "Fabienne V. Massonneau", "comment_text": "Europ comprises a lot cities with different climate in addition to unexpected low or high temperatures for the summer fall season. So pack little, practical for warm/hot weather as well as cold.\nHave your own shoes and fleece & light down feather jacket. Couple shorts, couple jeans, couple nice attire for a fancy night out, few tops (that you can wash) and treat yourself to buying few cloths as a souvenir from where you’ve visited"}, {"username": "Andre Le Huray", "comment_text": "Naomi Murphy"}, {"username": "Bob Lampo", "comment_text": "A light jacket for those cooler nights and occasional rain. Plenty of light stuff for hot days. Depending on how far into Sept, a versatile sweater. Esp if it rains. A small foldable umbrella."}, {"username": "Anita Alam", "comment_text": "There are stairs everywhere - made the poor life choice of carrying a mega suitcase once and it was torture - learned from that, used a small roller suitcase and backpack it was much better. Pack minimally, and what another poster said about lightweight clothes that dry easily. Good walking shoes, soap, small shampoo/\nconditioner, lightweight towel"}, {"username": "Lynette Yager Hansen", "comment_text": "I am going to Ireland/\nScotland for the exact same time! 5weeks. I did it in 1 Check in and backpack. Whew. Warm and rainy.."}, {"username": "Rodger Cravens", "comment_text": "Look at weather.com and determine what you need to bring based on how hot/cold it will be. How do we know what temps you are comfortable in?"}, {"username": "Karyn McCluskey", "comment_text": "Pack as little as possible you can always wash .I’m in Italy for 3 months & have too much luggage 8 dresses , pants ,2 tops 2bathers . I’m wearing same 3 dresses most days ."}, {"username": "Paula Bennett", "comment_text": "I have several dresses/\nskirts, capris, unmentionables,\ntops, sweaters, raincoat, warm sweater( Dolomites) and it is in a carryon. With toiletries."}, {"username": "Jennifer Bernardino", "comment_text": "How about me?"}, {"username": "Carole Wortelmann", "comment_text": "Go to website TRAVEL FASHION GIRLS....they will help you!"}, {"username": "Maxine Righi", "comment_text": "Just go shop there…"}, {"username": "Kay Davis", "comment_text": "Comfortable shoes, no wrinkle clothing!"}, {"username": "Cee Esperance", "comment_text": "If you can, stick to 5 outfits that you can mix and match then change the look with fun summer scarves and custom jewelleries (takes lesser luggage space)"}, {"username": "Kathleen Jarvis", "comment_text": "Pack what you want the more the better it doesn’t matter if you don’t get around to wearing them knowing you can is all that matters can’t be doing with washing while on holiday 😎"}, {"username": "Donna Parrish", "comment_text": "www.ricksteves.\ncom has a comprehensive list"}, {"username": "Cheryl Bastow", "comment_text": "Half of what you think"}, {"username": "Suzy Coler", "comment_text": "Europe is an entire continent; can you be more specific?"}, {"username": "Shannon Confortin", "comment_text": "I packed 4 pairs of shorts, 6 tops, a romper 2 dresses, a cardigan, a sweatshirt and 2 pairs of pants. It all fit in a carryon."}, {"username": "Suzanne McAleese", "comment_text": "Can’t believe you have fitted all that in a carryon well done"}, {"username": "George Haenisch", "comment_text": "Silk underwear to wash out easy, tees, two pairs of shoes\nLose pants or sun dresses\nUr are all set! One decent outfit for a nice dinner, don’t get it dirty"}, {"username": "Raa Austin", "comment_text": "Tracey Provenzale"}, {"username": "Ana Maria Floare", "comment_text": "Your good luck, cause it's a great experience to do that!"}]}, {"id": "2208932079505870", "text": "I'll be visiting Italy from Sep 3 to 8. I don't have a concrete itinerary yet, except for the Papal Audience on Sep 6.\nWill appreciate your suggestions on the best places to visit during our stay. Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2208932079505870/", "likes": 3, "comments": [{"username": "Fabrizio Benedetti", "comment_text": "Piazza di Spagna and near Piazza del Popolo and Piazza Venezia , another Pantheon and Piazza Navona , another Trevi fountain, if you in San Pieter near there is the beautiful Castel S.Angelo , go to the terrace of Castel S. Angelo"}, {"username": "Fabrizio Benedetti", "comment_text": "Another itinerary is Trastevere and Ghetto Ebraico , beautiful place"}, {"username": "Tony En", "comment_text": "How did you book the papal audience?"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Only five days? Just spend it in Rome and soak it all in."}, {"username": "Cleo Forrey", "comment_text": "Has anybody use this ?"}, {"username": "Miyuki Kanno Paul", "comment_text": "It’s not too late. Invest in Rick Steves ROME guidebook. There are tons of information on Roma."}]}, {"id": "2208931356172609", "text": "We are spending two weeks in Italy at the end of September. For six nights we are staying at a vacation rental in Conca dei Marini, any recommendations on things to do in the area? Best way to get around? Stock pic for attention.", "link": "facebook.com/groups/1373361046396315/permalink/2208931356172609/", "likes": 2, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Salerno/\nSmall-Group-Amal\nfi-Coast-Day-Cr\nuise-from-Posit\nano/\nd4736-6439AMALFI\n?pid=P00070587&\nmcid=42383&medi\num=link&medium_\nversion=selecto\nr"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Sorrento/\nAmalfi-Coast-Min\nibus-Tour-with-\nEnglish-Speakin\ng-Assistant/\nd947-136733P34?p\nid=P00070587&mc\nid=42383&medium\n=link&medium_ve\nrsion=selector"}]}]