[{"id": "2198496057216139", "text": "This is a long shot type of question, but here goes. My great grandfather was a WWI Austrian prisoner of war who died in Sicily. Does anyone know how I could find his grave?", "link": "facebook.com/groups/1373361046396315/permalink/2198496057216139/", "likes": 0, "comments": [{"username": "Pamela Carson", "comment_text": "I've been watching those shows on finding your roots.\n\nDo you know what city in Sicily?"}, {"username": "Cecilia Christine Costantini", "comment_text": "In Italy, by law after 30 years of being buried, if relatives do not ask for an extension of the burial \"permit\", bones are moved to the \"ossuary\", and the names of people buried there are not written anywhere, especially in smaller cemeteries."}, {"username": "Cecilia Christine Costantini", "comment_text": "If he died during the 1st WW, I have found this article that mentions names of cemeteries http://\nwww.circolocultu\nralelagora.it/\nprigiiionieriaus\ntroungariciarea\ndellostretto.ht\nml, maybe you can try and write people running that blog circolocultural\nelagora@gmail.c\nom (even though they are from Calabria, not Sicilia) and see if they can help"}, {"username": "Carol Waldron", "comment_text": "Is there an Austrian War Memorial/\nOffice where you can access war records to find where he was buried?"}]}, {"id": "2198497690549309", "text": "Hi All.\nDoing the loop from Milan, Venice, Florence (not locked in yet) Vernazza, then back to Milan. Looking for some off the track lovely stops, but still accessible by train. We discovered montepulciano on our last visit and fell in love. Too out of the way for this trip but if we can find something similar from venice to Vernazza that would be perfect! Thanks 😊\nPS will gratefully accept fave spots and must do’s anywhere on this route!", "link": "facebook.com/groups/1373361046396315/permalink/2198497690549309/", "likes": 0, "comments": [{"username": "Terri Nelsen", "comment_text": "Padua not too far from Venice is great."}, {"username": "Alice Francesca", "comment_text": "Verona or Lake Garda from Milan to Venice.Verona is home of Romeo and Juliet, and has the only roman amphitheater still used for Opera abd concerts (might want to check if you can find tickets, Arena di Verona).lovely stroll in the center to the river , many restaurant to choose from overlooking it.Take the cable car on the other side of the bridge and go up the hill..enjoy the view!\nLake Garda: you will stop in Desenzano.If you only have one day, take the bus from outside the train station to SIRMIONE.there is a medieval casale built on the water, beaches and many shops.If you have a couple of days, take the ferry from Sirmione and get to Riva del Garda or Malcesine."}, {"username": "Lyn Evans", "comment_text": "Lake Garda is absolutely gorgeous(Malces\nine up the lake devine) or Sirmione busier but easier to get to and also lovely, porto Venere is beautiful near cinque Terre and we are going to visit Bergamo this year which I hear is lovely and not too far from Milan. Lucca between Vernazza and Florence another idea."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Lucca?"}, {"username": "Roland Trego", "comment_text": "Lucca. Santa Margherita Ligure/\nPortofino/\nCamogli. Turin."}, {"username": "Suzanne Joslin Oliveria", "comment_text": "Bologna"}, {"username": "Annalisa Francesca Gianna", "comment_text": "Vicenza, Padova and Verona are all not far from Venice by train. Vicenza has many UNESCO villas by Palladio.\n\nPadova has many sights including Prato della Valle. It's a 90,000-square-m\neter elliptical square in Padua, Italy. It is the largest square in Italy, and one of the largest in Europe. Also, book tickets online in advance for the Scrovegni Chapel. You won't be sorry.\n\nVerona has many Roman ruins to include the Arena. Fun fact: if you go to the United Colors of Benetton in Via Mazzini, you won't go to shop. Head downstairs and you'll be greeted by Roman Ruins incorporated into the store."}, {"username": "Miyuki Kanno Paul", "comment_text": "What time of the year are you going?"}, {"username": "Peach Panfili", "comment_text": "From Milan to Venice you’ll pass through beautiful Verona - definitely worth a stop."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Treviso, Revenna, Bologna, Lucca, Pisa, Genova, Pavia, Torino. And then Pistoia, Pietrasanta, San Miniato, Bergamo, Mantova…"}, {"username": "Annette Fordyce", "comment_text": "Levanto is just a few kilometers north of the Cinque Terre, and is a lovely small town. There is an old clock tower which still keeps perfect time, a beach, some amazing gelato and fun stores. You can also rent bikes and ride through an old train tunnel, right along the sea. It’s usually not crowded (I’ve been in March, May, and September) and I count it as one of my favorite places in Italy."}]}, {"id": "2198499643882447", "text": "Can anyone advise on a boat transfer company from Sorrento to Nerano (Lo Scoglio) that’s not a million dollars? I’m getting quotes from 1000 euro and up. That’s crazy. If not that itinerary then please advise on a boat transfer company from Positano to Nerano. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2198499643882447/", "likes": 0, "comments": []}, {"id": "2198500860548992", "text": "Can anyone advise on a boat transfer company from Sorrento to Nerano (Lo Scoglio) that’s not a million dollars? I’m getting quotes from 1000 euro and up. That’s crazy. If not that itinerary then please advise on a boat transfer company from Positano to Nerano. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2198500860548992/", "likes": 0, "comments": []}, {"id": "2198501397215605", "text": "We will be going to Rome Italy in august and bringing two kids with us. Our hotel is offering us airport arrival van and at departure to the port. The hotel is quoting us 95 euro for the van and 280 euro for from centra Rome to the port.\n\nMy question is, how hard is it to get Uber and taxi upon arrival at the airport and for the day of getting to the port.\n\nThanks in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2198501397215605/", "likes": 2, "comments": [{"username": "Elena Innocenti", "comment_text": "Sometime at airport there are long queues for a taxi. For port (civitavecchia?\n) is better reverve in advance.\nRegular taxi fares are\n50euro per car from Airport and 120euro to Civitavecchia.\nBut I think these prices are expensive."}, {"username": "Paul Vincent", "comment_text": "Lots of other options...for eg.\n\nhttps://\nwww.getyourguide\n.com/\nrome-civitavecch\nia-cruise-port-\nl31006/\nport-transfers-t\nc154/\n?cq_src=google_a\nds&cq_cmp=20333\n513222&cq_con=1\n51692526980&cq_\nterm&cq_med&cq_\nplac&cq_net=g&c\nq_pos&cq_plt=gp\n&campaign_id=20\n333513222&adgro\nup_id=151692526\n980&target_id=d\nsa-84666501466&\nloc_physical_ms\n=9055282&match_\ntype&ad_id=6357\n59346190&keywor\nd&ad_position&f\need_item_id&pla\ncement&device=m\n&partner_id=CD9\n51&gclid=Cj0KCQ\njwn_OlBhDhARIsA\nG2y6zNVdr9uMxx8\nWrFuBwJG7Wt4WZJ\nnA6C4eL3Nu0BQzM\nAM3ByRHwkHT40aA\npbpEALw_wcB"}, {"username": "Paul Vincent", "comment_text": "https://\nwww.rome-airport\n.info/in.html"}, {"username": "Jenn Messina Babore", "comment_text": "A standard taxi from Airport to city center is 50€.\n\nWe paid 185€ from Civitavecchia to city center for 7 of us via Rometransferser\nvices.com and would definitely recommend them."}, {"username": "Yvonne Chuang", "comment_text": "Thank you so much everyone!"}, {"username": "Linda Chase", "comment_text": "Our hotel arranged a private car for two of us from the airport for E70"}, {"username": "Lisa Schalig-Winter", "comment_text": "Just left Rome with our 2 kids. We were so hot and tired when we arrived. Having a driver waiting for us with an air conditioned van was worth the money. Due to the extreme heat in July, we relied on Uber black for most of our outings."}, {"username": "Maria Coladangelo Ducca", "comment_text": "Not a time to bargain I. This heat . Italian are on Feragosto. That means in august they either go to the mountains or the sea . . I would advise you to leave as is"}, {"username": "Maureen Rebello Hagerty", "comment_text": "https://\nwww.romeshuttlel\nimousine.com/"}, {"username": "Marjie De Villa Lorica", "comment_text": "From the official website of Civitavecchia Port, there are options for “Personal Transfer” and “Shared Shuttle Service” to/ from Port of Civitavecchia. They also offer Taxi service to/ from the airport/ Rome City Center.\n\nTheir rate was 55 euros from the airport to Rome; and 150 euros from Rome to Civitavecchia Port- for two persons in October 2022."}, {"username": "Lisa Kelly", "comment_text": "We had a private transfer for E80"}, {"username": "Kellie Fogarty", "comment_text": "Use ITtaxi app"}, {"username": "Jeanne Hildebrandt Fedoryk", "comment_text": "Try https://\nwww.romecabs.com\n/booking/\n?s=206&c#go - much more reasonable and very reliable but probably already booked at this point"}, {"username": "Sh Kaplan", "comment_text": "Very hard. Go with what they are offering you"}, {"username": "Tracy Glasgow", "comment_text": "Uber black worked well for us"}, {"username": "Maura Hickey", "comment_text": "Check wetaxi.it, I downloaded the app. When we arrived at Fiumicino, I ordered a taxi and it arrived within a few mins , it's a flat rate of €50 from the airport to the city center, that was for 6 of us. We did the same thing when we were returning home - again €50 for 6 people. We used it one time while in Rome - to go from Termini station to Trastevere and it cost €16. Highly recommend"}, {"username": "Cheri Arrowood-Stanziano", "comment_text": "Express Shuttle’s"}]}, {"id": "2198506507215094", "text": "Hello,\nAny one can tell me please if trainline show platform? Traveling from milan to trento on two different companies (trenitalia then italo) and need to save time", "link": "facebook.com/groups/1373361046396315/permalink/2198506507215094/", "likes": 0, "comments": []}, {"id": "2198509000548178", "text": "In regards to our September Italy tour I called our tour group to ask if we would get to see the inside of the colliseum or only the outside, also do we walk through the Roman Forum or just drive by? The website says “ panoramic” tour. The representative told us that usually yes, we get off the bus and enter the Colliseum and walk the Romanआणखी Forum. However she say this year is so overly crowded that they are having trouble getting tickets. She says if they can’t get us inside they will compensate with something else but we will still walk outside the colliseum walls and have a guided narrated history lesson.\nWe are disappointed to hear this as it’s our honeymoon and my first trip to Italy.\nAnyone else experiencing trouble getting tickets? Even when it’s built into the Italy tour?", "link": "facebook.com/groups/1373361046396315/permalink/2198509000548178/", "likes": 1, "comments": [{"username": "Jenn Messina Babore", "comment_text": "Getting tickets to the Colosseum this year are extremely difficult. There are a limited number per hour depending on your type and many vendors have been canceling tours as a result of not being able to secure tickets. If you want to ensure you go in, you may want to book your own tickets. Tickets are available 30 days ahead of your date and start loading on the Coopculture.it website at 9am local time and approximately every 15 minutes thereafter."}, {"username": "Terry Pisano", "comment_text": "We're on a tour about the same time as you and, like you, I found the descriptions of \"optional excursions\" to be so vague that I called a representative who gave me even less info than you received. So I just started booking things on my own. Hubby and I aren't interested in a drive by colosseum tour, so I booked our own. I've learned so much about these tours, and that you don't really get alot of detail until just a few weeks before, which just doesn't sit well with me. Anyway, we are going to have a beautiful, romantic and forever memorable vacation to Italy and will likely not do a whole lot with the tour other than a roof over our head and transport from one city to the next. Enjoy!"}, {"username": "Romina Lauretig Toscano", "comment_text": "Book on your own"}, {"username": "Peach Panfili", "comment_text": "Go to Verona and take in an opera or similar event at the exquisite arena there."}]}, {"id": "2198508280548250", "text": "Quick question about shipping vs carry on . Around 6 or so bottles of ￼Limoncello? Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2198508280548250/", "likes": 0, "comments": [{"username": "Jenn Messina Babore", "comment_text": "Carry on is only possible if the bottles are under 4 oz / 100mL. You are limited to 5L or approximately 6 wine bottle sized containers in cargo."}, {"username": "Janet Messanelli Bozzone", "comment_text": "You can’t carryon 6 bottles of limoncello unless you get them at the duty free and then you we need to declare them since you will be over the alcohol limit unless you are traveling with others."}, {"username": "Frank Hunt", "comment_text": "I bought a beautiful bottle of limoncello after having a tasting. Got home and it tasted like crap, buyer beware."}, {"username": "Rhona OConnor", "comment_text": "You can buy it at home......"}, {"username": "Jaime Cleek", "comment_text": "You can get it at most liquor stores in the US"}]}, {"id": "2198509717214773", "text": "BUONGIORNO a tutti: Alberobello, Bari (Puglia)", "link": "facebook.com/groups/1373361046396315/permalink/2198509717214773/", "likes": 852, "comments": [{"username": "Phyllis Waring", "comment_text": "Breathtaking!"}, {"username": "Silvie Frener", "comment_text": "Silvie Frener"}, {"username": "Betsabe Malmborg", "comment_text": "Encantador"}, {"username": "Maria Mcaveney", "comment_text": "Lovely!"}, {"username": "Maria Mcaveney", "comment_text": "Love this picture ❤️"}, {"username": "Éva Kőhegyi", "comment_text": "Éva Kőhegyi"}, {"username": "Leonie MacDonald Le Mura", "comment_text": "We visited this beautiful town in May. It is like something from a storybook ❤️"}, {"username": "Tomi Bete", "comment_text": "Tomi Bete"}, {"username": "Annamaria Fiduciamancarella", "comment_text": "Annamaria Fiduciamancarella"}, {"username": "Sabina De Nicolò", "comment_text": "Da favola"}, {"username": "Rosa Pecorella", "comment_text": "Rosa Pecorella"}, {"username": "Lupu Lucica Ionel", "comment_text": "Buongiorno bellisimo!"}, {"username": "SilviaeNelson Fregolente", "comment_text": "Buongiorno bella citta!"}, {"username": "Ada Crudo", "comment_text": "Stupendo..."}, {"username": "Ada Crudo", "comment_text": "Ada Crudo"}, {"username": "Ada Crudo", "comment_text": "Che favola......"}]}, {"id": "2198512580547820", "text": "Hey just going to lovely como lake any apartment or villa to remt for 3 days?\n\nOr good hotel for 4 people 2 rooms", "link": "facebook.com/groups/1373361046396315/permalink/2198512580547820/", "likes": 0, "comments": [{"username": "Virgz Van Møøre", "comment_text": "Alessia's place"}]}, {"id": "2198512887214456", "text": "Colosseum night tour available on Fri 18th August!\nhttps://ecm.coopculture.it/index.php?option=com_snapp&view=event&id=2E4CF2E0-F5B7-7757-4241-0173584374D6&catalogid=06B97E06-CA46-981E-360A-017A9FE4C3F6&lang=en", "link": "facebook.com/groups/1373361046396315/permalink/2198512887214456/", "likes": 7, "comments": [{"username": "Karen Blackmore", "comment_text": "Now Four tickets still available!"}, {"username": "Jenn Messina Babore", "comment_text": "The night tour was fantastic. Loved seeing the underground at night. It’s like having the whole Colosseum to yourself!"}, {"username": "Tania Michelle", "comment_text": "Do they not do night tours on Sunday/Monday?"}, {"username": "Kevin Holmes", "comment_text": "We have been trying to work out when they release the tickets and worked out what we thought was the release time. Only to see three randomly released over the weekend. We sat all night waiting for the night ones last night and woke up and they had all gone for the night we need. Will try again tonight"}]}, {"id": "2198514930547585", "text": "Going on a Mediterranean cruise middle of September for 3￼weeks. What is the weather like and what should I wear?", "link": "facebook.com/groups/1373361046396315/permalink/2198514930547585/", "likes": 0, "comments": []}, {"id": "2198604797205265", "text": "We are traveling from US with kids and are not going to check in any bags. Is it possible to buy sunscreen spray in Rome? If so, what kinda place?thanks", "link": "facebook.com/groups/1373361046396315/permalink/2198604797205265/", "likes": 13, "comments": [{"username": "Agnese Arnó Ch-Ch", "comment_text": "Supermarkets have cheaper options (Nivea, Bilboa, sometimes the supermarket brands, Angstom…), pharmacies usually have more expensive brands."}, {"username": "Bob Sullivan", "comment_text": "You could each carry 3oz worth on the plane until you find it in a store."}, {"username": "Lisa Valdovinos", "comment_text": "Farmacia"}, {"username": "Renae Larcus", "comment_text": "Yes. Everywhere"}, {"username": "Tari Lawson", "comment_text": "I brought a CVS sunscreen stick (70 spf) before I traveled to Italy. It is the size of deodorant and worked great and doesn'ttake up much space. Highly recommend."}, {"username": "Laurie Denoni", "comment_text": "Try to find solid sunscreen sticks before you go. Sunscreen is very expensive in Italy."}, {"username": "Laura Maroney Finocchiaro", "comment_text": "We bought some at the supermarket and it was far better than what we can get in US."}, {"username": "Heidi Hutson", "comment_text": "Any farmacia"}, {"username": "Kim Aranha", "comment_text": "Rome is a very cultured city…they have everything and more"}, {"username": "Georgina Mcauliffe", "comment_text": "Yes you certainly can but what you can't get are the massive containers of very high SPF that the Aus supermarkets sell very cheaply. If I pack a hold case I do always put one of those in - double wrapped and sealed."}, {"username": "Phyllis Snyder", "comment_text": "Italian skincare products are the best in the world!"}, {"username": "Connie Wilson", "comment_text": "Any Farmacia or supermarket."}, {"username": "Alexandra A Welker", "comment_text": "If not comfortable buying in Italy (the pharmacy and convenient store will have them), consider getting the sunscreen stick from Amazon, they are travel size. One stick should be enough for two kids. These are the two I used for my kiddos."}, {"username": "Nandita Goswami", "comment_text": "Every pharmacy on every corner. I got a sunblock with a free after sun moisturizer and the moisturizer is my fave!"}, {"username": "Susan Brown", "comment_text": "Each person traveling can bring quart sized ziploc baggie with all 3.4oz or less liquids in the ziploc inside your carry ons. This is allowed through TSA security checkpoints. I bought this sunscreen at dollar tree store, and it’s 3oz.\n\nhttps://\nwww.tsa.gov/\ntravel/\ntravel-tips/\ntravel-checklist\n#:~:text=Liquid\ns%2C%20gels%20a\nnd%20aerosols%2\n0packed,liquids\n%20must%20fit%2\n0in%20bag)"}, {"username": "Lindsay Thompson", "comment_text": "Yes it is available in shops 🥺"}, {"username": "Lisa Scott", "comment_text": "You can buy it easily but it is MUCH more expensive. We take a 1litre pump pack with us from Australia when we go to Europe with the kids for 4 weeks and that lasts the distance. (1 litre of Coles sunscreen is under $10 here and a small tube was 30 euros in Rome) Won’t work if you’re not checking a suitcase though."}, {"username": "Anne Contini", "comment_text": "From any pharmacy - farmacia or supermarket."}, {"username": "Yvonne Ormson", "comment_text": "🙄"}, {"username": "Maja Vidmar", "comment_text": "🤦‍♀️🤦‍♀️🤦‍♀️"}, {"username": "Shelley O'Reilly", "comment_text": "I bought spray in a village in Tuscany so guessing Rome might have some"}, {"username": "Connie Flynn", "comment_text": "Connie Flynn"}, {"username": "Melanie Lyons Roff", "comment_text": "You can. It is harder to find the larger supermarkets that stock them. They are more expensive and smaller sizes. I found the trigger spray one but haven’t found an aerosol spray while here."}, {"username": "Jennifer Larese Taylor", "comment_text": "They sell it everywhere. If you are worried, buy if after security at the airport you fly from"}, {"username": "Kally Trahearn", "comment_text": "You could also buy it at the airport after going through security, so liquid sizes won't be an issue - that's if you prefer particular brands."}, {"username": "Rose Stolarek", "comment_text": "Absolutely"}, {"username": "Debbie Morton", "comment_text": "Pretty sure that you can buy sunscreen just about anywhere."}, {"username": "Debbie Bowles", "comment_text": "Pharmacies everywhere. All good"}, {"username": "D Rochelle Milton", "comment_text": "Sy Sandblom Google says “that’s a no brainer” lmao 🙄🤣"}, {"username": "Michael Barnes", "comment_text": "Yes, they have stores there too."}, {"username": "Erica Styan", "comment_text": "That sell sunscreen wipes on Amazon."}, {"username": "Cecilia Christine Costantini", "comment_text": "Supermarkets, pharmacies, you ask for Crema Solare or Spray Solare (common brands: nivea, balboa, rilastil ... )"}, {"username": "Sydney Chakalos", "comment_text": "I’m not in Rome but saw it in the pharmacy in Venice so I’m sure it can be found there!"}, {"username": "Pietro Adami", "comment_text": "Any Farmacia will have it, as well as any supermarket."}, {"username": "Carmela Noble", "comment_text": "You can walk into any farmacia or supermercato and get some and probably so much healthier than what we sell in North America. I always stock up on toiletries there !"}, {"username": "Jenn Messina Babore", "comment_text": "We didn’t need any bug spray last week in Rome. (Just fyi)"}]}, {"id": "2198525473879864", "text": "Good Afternoon,\nI am planning to travel to Rome again this September (went exactly the same dates as last year lol) and I don’t want the hassle we had with luggage with EasyJet 😞\nWould anybody know where I can take wine,olive oil and peach tea bottles so I can ship them home safely please? 😳🤔😳🤔😳", "link": "facebook.com/groups/1373361046396315/permalink/2198525473879864/", "likes": 0, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2198531070545971", "text": "We are on our honeymoon here in Italy. 🇮🇹 Currently we are in Chianti region and would love some recommendations on great wineries. We have a car so we can travel.", "link": "facebook.com/groups/1373361046396315/permalink/2198531070545971/", "likes": 2, "comments": [{"username": "Pietro Adami", "comment_text": "If you get near Scansano, look for the “Il Carraio” restaurant. Excellent food and Gaia, the chef and owner, also makes excellent wine ( Morellino di Scansano ).\nThey also have a lovely B&B"}, {"username": "Connie Wilson", "comment_text": "I would agree with all of these!\n\nhttps://\nwww.tuscanynowan\ndmore.com/\ndiscover-italy/\nwine-other-itali\nan-drinks/\nbest-wineries-vi\nsit-chianti"}, {"username": "Valerie Collanton", "comment_text": "We had an amazing wine tour and lunch at https://\nwww.santagnesefa\nrm.com/\n?utm_source=goog\nle&utm_medium=o\nrganic&utm_camp\naign=mybusiness"}, {"username": "S Christian Everett", "comment_text": "https://\nwww.quercetodica\nstellina.com/\nen/home/\n\nIt is private to be sure to have a reservation!\n\nVery beautiful and quiet"}, {"username": "Paul Ryley", "comment_text": "We did Tenuta Torciano and had a fantastic experience! We shipped a few bottles back home that we loved!"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "https://\nwww.antinori.it/\nen/experiences/"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "https://\nwww.guicciardini\nstrozzi.it/\nvisite-e-degusta\nzioni/"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "https://\nwww.gondi.com/\ntenuta-bossi/\ntour-tenuta-boss\ni-en"}]}, {"id": "2198533213879090", "text": "Any recommendations for family friendly affordable places to eat in Venice? Will be there with my two teens (13 and 15) in a few weeks time x", "link": "facebook.com/groups/1373361046396315/permalink/2198533213879090/", "likes": 1, "comments": [{"username": "Joanne Calzaretta", "comment_text": "Following"}, {"username": "Jenn Messina Babore", "comment_text": "What is affordable to you? Price per person?\n\nHere are some suggestions of places we ate last week that we enjoyed…\n\nGelateria Paolin dal 1760 - also have sandwiches, pizzas, and salad in addition to gelato\n\nLe Cafe - same square across the way, pesto pizza with walnuts and salad with chicken were good along with sandwiches (smaller cafe menu was more affordable)\n\nTypically pizzas are big enough to share.\n\nTrattoria Pizzeria Da Roberto - my favorite pizza place of the 3 and we shared pizzas amongst a few of us\n\nYou can also get cicchetti - small open faced sandwiches/\ntapas that are 2-2.5€ each\n\nFor a bigger splurge, we really enjoyed Agli Alboretti."}, {"username": "Dave Colleen", "comment_text": "Dolfin Restaurante"}]}, {"id": "2198533110545767", "text": "We’re staying in Praiano. Wanting to go to Maiori then walk Path of the Lemons to Minori. Google says bus from Praiano to Maiori will take 1hr 15mins but only 45mins by car. Has anyone done this by taxi and which service did you use? We’ve searched a couple of companies and their quotes are over €200!", "link": "facebook.com/groups/1373361046396315/permalink/2198533110545767/", "likes": 0, "comments": [{"username": "Inna Rozen", "comment_text": "20 minutes by boat"}]}, {"id": "2198544377211307", "text": "Visiting Viareggio in mid September, grateful for any restaurant recommendations 🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2198544377211307/", "likes": 0, "comments": [{"username": "Silvia Frati", "comment_text": "La barca, Branzo, cicero, da pachino for pizza"}]}, {"id": "2198563063876105", "text": "Hello! My husband and I were going to utilize the bus system to see the Sistine Chapel, Colosseum, St. Peter’s Basilica etc… when we visit in mid September. Is it slower then for that to be a good option? Or should we do a guided tour?", "link": "facebook.com/groups/1373361046396315/permalink/2198563063876105/", "likes": 1, "comments": [{"username": "Karen Schofield", "comment_text": "It’s how we did it. Very easy"}, {"username": "Austin Briscoe", "comment_text": "If you are able just walk. Most of the things you want to see in Rome are under a mile and you get to take in all the sights and places you would miss if you were in a car or bus. When we were there we just Google maped the walk time and started a little early in case we wanted to stop for some reason, coffee, food, unknown cool places we happened upon."}, {"username": "Jenn Messina Babore", "comment_text": "We taxi’d between the necessary points from our apartment. You can also take the metro."}, {"username": "Desi Taylor", "comment_text": "We used the metro... very easy"}, {"username": "Cecilia Christine Costantini", "comment_text": "Supereasy by metro or bus. You can buy daily tickets//48h/\n72h or 1 week at Metro stations. Colosseo is a metro stop and the Vatican Museum too. With the bus/metro passes you can only hop on and off city buses, when I am too tired and see a bus stop (they are big and yellow or green) I check if any of those buses will take me to Colosseo/\nTermini or whatever other metro station I need, even if it is a detour and hop on the first not crowded bus I see."}]}, {"id": "2198566677209077", "text": "Traveling late Sept, early Oct. would like to reserve some rooftop places in Rome, Florence, Venice, and Amalfi Coast. Thanks for your help and insights. I love this site.", "link": "facebook.com/groups/1373361046396315/permalink/2198566677209077/", "likes": 1, "comments": [{"username": "Carolyn Chambers Rosamilia", "comment_text": "Save rooftop experiences for aperitifs/\ncocktails. The best food in Rome is in small back street restaurants with little or no view."}]}, {"id": "2198574657208279", "text": "Anyone has a nice 4-day itinerary for Rome? Thanks in advance,", "link": "facebook.com/groups/1373361046396315/permalink/2198574657208279/", "likes": 0, "comments": []}, {"id": "2198583370540741", "text": "Can someone make a recommendation for a place to purchase jewelry? Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2198583370540741/", "likes": 0, "comments": [{"username": "Renee Chavez Evenson", "comment_text": "Following"}]}, {"id": "2198586687207076", "text": "Has anyone done Sicily? Planning to go next year in October and would love recommendations!!!", "link": "facebook.com/groups/1373361046396315/permalink/2198586687207076/", "likes": 1, "comments": [{"username": "Merilice Finateri", "comment_text": "Following"}, {"username": "Susan Buckley Thorpe", "comment_text": "Following"}]}, {"id": "2198588967206848", "text": "Need your help! My husband ate at this restaurant in Rome in March 2019. We want to go there next summer when we visit, but we don’t know the name of it. Anyone recognize this restaurant and know it’s name?", "link": "facebook.com/groups/1373361046396315/permalink/2198588967206848/", "likes": 113, "comments": [{"username": "Cathy Heikkinen Vogt", "comment_text": "Stuart Vogt"}, {"username": "Rosangela Plantamura Fiore", "comment_text": "Looks like Ristorante Lagana. It was our favorite too!"}, {"username": "Ashley Denise Baker", "comment_text": "Do you need reservations"}, {"username": "Tonya Chaney", "comment_text": "Amy Clark Kirkpatrick good recommendations\nfor this place in Rome"}, {"username": "Meredith Carney", "comment_text": "Ian Carney"}, {"username": "Sa Ra", "comment_text": "f."}, {"username": "Amanda Simone", "comment_text": "Yes, Lagana! It was our favorite spot when we were in Rome last month!"}, {"username": "Kelly Luikart Josephson", "comment_text": "If you had location on in Google maps, you can go to your timeline to the day you were there in 2019 and be able to figure it out that way."}, {"username": "Susan Buckley Thorpe", "comment_text": "Following! Yes!"}, {"username": "Renee Rundle Stoneham", "comment_text": "If you look at the photo on his phone there should be an “I” for information. It will give you the location on a map. You can then zoom in and find the name of the restaurant."}, {"username": "Tina Santos", "comment_text": "Just wanted to say - you guys are awesome 👍"}, {"username": "Maria Angela Perrone", "comment_text": "https://g.co/\nkgs/mrnGks Lagana\n+39 06 6830 1161"}, {"username": "Rosangela Di Monaco", "comment_text": "Taverna Lucifero. Via del Monte Della Farina ,43 Roma"}, {"username": "Miyuki Kanno Paul", "comment_text": "Lagana. I dined there a handful times"}, {"username": "Renae-Jon Sullivan", "comment_text": "This is the restaurant that I thought is may have been; we were there in 2017… I hope that you find it again."}, {"username": "Tricia Brittingham Neff", "comment_text": "3 blocks from our hotel!!! I’m so excited!!"}, {"username": "Voula Ladas", "comment_text": "Were the pictures taken with an iPhone ? If so you will find it’s location easily by pressing on pic and scrolling up."}, {"username": "Melanie Izzy", "comment_text": "Definitely putting it on the list for our trip to Rome - and it’s only a 3 min walk from our hotel!"}, {"username": "Trace Barron", "comment_text": "Peter Barron another one to add to the expanding list"}, {"username": "Melissa Castro Killen", "comment_text": "Yes, Lagana, we just ate there Friday. It was good snd super close to the Parthenon."}, {"username": "Carmela Tortora Coppola", "comment_text": "Impressive how this group is extremely helpful im Italian living in the US wish I knew about before my travels to italy"}, {"username": "Cherry Rickard", "comment_text": "Just sounds so personal love it and he could make something special that Sandy likes. Xx"}, {"username": "Skye Kennedy", "comment_text": "Yes Lagana. We are staying a couple of fours up from there. They have loads of tables outside. Went past tonight-place was packed."}, {"username": "Joshua Pickles", "comment_text": "Website says they opened in 2000"}, {"username": "Chris Avanzato", "comment_text": "Its close to Piazza Navona"}, {"username": "Michelle Parrott", "comment_text": "This group is great! Thanks for the tip! Will add to our list! Rob!🇮🇹"}, {"username": "Kelley Casole Cwiklinski", "comment_text": "Thanks for the tips!"}, {"username": "Heidi Nichole Clark", "comment_text": "Jamie Elam Lynch we should go to this place for dinner one night!"}, {"username": "Staci Goldstein", "comment_text": "Staci Goldstein"}, {"username": "Aimee Ferrer Busquet", "comment_text": "Eddie Busquet"}, {"username": "Cecilia Christine Costantini", "comment_text": "Laganà, Via dell'Orso, 44, Roma\n\n(I don't personally know it, but ran the second picture through Googlelens app and it came up!)"}, {"username": "Elena Paonessa", "comment_text": "Yes, it’s Lagana’\nGreat restaurant and fantastic service !"}, {"username": "Vickie Hopkins Allen", "comment_text": "Thank y’all so much!!! My hubs wanted to take the fam when we go next year but for the life of him he couldn’t remember the name!"}, {"username": "Lynette Leone Watkins", "comment_text": "What did you have there that you liked so much?"}, {"username": "Maruschka Tuunainen", "comment_text": "Google image search"}, {"username": "Julie Hinton", "comment_text": "I love how helpful people in this group are!"}, {"username": "Dee Dee", "comment_text": "Might this be it???https://\nwww.ristorantecl\neto.it/"}]}, {"id": "2198592677206477", "text": "Do most restaurants, bars, and hotels have decaf coffee?", "link": "facebook.com/groups/1373361046396315/permalink/2198592677206477/", "likes": 0, "comments": [{"username": "Dolly Cote", "comment_text": "Most don’t, I always have a couple decaf tea bags with me."}, {"username": "Sandra Maldonado", "comment_text": "Why would you want that? You’re on vacation, enjoy a good cup of Italian coffee."}, {"username": "Cecilia Christine Costantini", "comment_text": "Yes, you ask for \"decaffeinato\" (or caffè HAG, which is the main brand of decaf coffee). My mom lives in Rome and only drinks decaf, she also gets decaf cappuccino."}, {"username": "Berndt Weihs", "comment_text": "Yes,nearly all bars ,order simply\n\" decaffeinato\""}, {"username": "Giada Todaro", "comment_text": "Of course. Roman here ✌️ and I drink only deca coffee and deca cappuccino"}, {"username": "Jayden Taylor", "comment_text": "Cooper Kelly Riley Carr"}, {"username": "吳冠徵", "comment_text": "Most do (need to pay ~€0.20extra)"}, {"username": "Alice Francesca", "comment_text": "Just order a DECAFFEINATO OR DECA, FOR SHORT.of course"}, {"username": "Alberta Sensale Chirico", "comment_text": "Thanks everyone!"}]}, {"id": "2198593107206434", "text": "Flying into Rome FCO airport in October and will be staying at Hanky Suite. The hotel says they have a shuttle from airport to hotel but I can’t get a reply from them to book the shuttle. Can anyone recommend the best way to get from airport to hotel for two people with 2 bags of luggage.", "link": "facebook.com/groups/1373361046396315/permalink/2198593107206434/", "likes": 0, "comments": []}, {"id": "2198596657206079", "text": "Hi travelling to Italy in mid September for 5 nights and having never been not sure where to start. Currently we are thinking perhaps fly into Venice, stay there for 2 nights then off to Verona and 1 night there before heading to Sirmione for 2 nights and then flying back from Verona.\n\nWould be grateful for any advice on if this itinerary would work and if so any recommendations on things to do/see.", "link": "facebook.com/groups/1373361046396315/permalink/2198596657206079/", "likes": 3, "comments": [{"username": "Connie Wilson", "comment_text": "I would train to Verona as soon as you arrive in Venice, then on to Sirmione and spend your last nights in Venice."}, {"username": "Vanessa Ferroni", "comment_text": "I am biased its all beautiful! Look at logistics of where you are flying to and from. Bus services from Verona and from Venice airport (by boat too should you wish) are good to get to town. Personally one night in Verona is fine, wine dine walk about. There is always tons to see but got to be rational. Venice never tires, loads to see and discover (should you want to see Murano and Burano). Sirmione is beautiful but I haven't been there yet! In Peschiera del garda...there's\nthe Vittoriale D'annunzio's house! Have fun you'll love the beautiful scenery <3"}]}, {"id": "2198599703872441", "text": "For those of you who have been successful packing with only a carry on and a backpack may I ask what carry-on luggage you used. Suggestions for good ones, please. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2198599703872441/", "likes": 28, "comments": [{"username": "Susan Buckley Thorpe", "comment_text": "following"}, {"username": "Nancy Middlebrook Piastuch", "comment_text": "Travelpro. 22 inch"}, {"username": "Karen Smart", "comment_text": "Ebags Motherlode carryon rolling duffel https://\nwww.ebags.com/\nluggage/\nwheeled-duffels/\nmother-lode-carr\ny-on-rolling-du\nffel/\n117749D636.html?\nproductid=11774\n9-D636&country=\nUS&currency=USD\n&couponid=94790\n994&gad=1&gclid\n=EAIaIQobChMI6L\nuB9ImmgAMVIS7UA\nR3KrwQgEAQYAyAB\nEgI5JfD_BwE"}, {"username": "Renee Rundle Stoneham", "comment_text": "I got a 21” hard sided roller from Dillards. Karl Lagerfield is the brand… I was just trying to find something 21” for international carriers.\nIt’s holding up well… 3 overseas trips and many train stations and cobblestones!\nI was not not spending $300 on a suitcase! This one was about 120. On sake.\nThis trip was 15 full days, French Alps and then Italy Lakes Maggiore & Como."}, {"username": "Barbara Pasteris Allen Hettlinger", "comment_text": "I have an older version of this bag from LL Bean and have taken it to Europe several times - on trains, planes, buses, over cobblestones, etc. Has held up well. They also monogram (free if you have LL Bean cc) which is nice to identify your bag. https://\nwww.llbean.com/\nllb/shop/\n121107?page=carr\nyall-spinner-me\ndium-iv&bc=50-5\n16673&feat=5166\n73-GN1&csp=f&po\ns=21"}, {"username": "Susan A. Jasper", "comment_text": "Thanks everyone for the info!"}, {"username": "Susan Annette Wanta", "comment_text": "Biaggio carry-on to check in"}, {"username": "Jadene Kay", "comment_text": "Look for ultra-lightweig\nht luggage. I’ve found the most reasonable cost ones from Ross or TJ Max. Some airlines will weigh your carry-on luggage, mostly European airlines. Buy compression packing cubes from Amazon to optimize your space. And roll your garments tight to put in the cubes."}, {"username": "Cynthia Marie", "comment_text": "I bought carry on luggage at Macy’s, nothing special. So far it’s lasted me 7 years worth of vacations. I vacation a lot! Happily retired. 🤗"}, {"username": "Ashley J Hundt", "comment_text": "Following"}, {"username": "Karen Renzoni Monteleone", "comment_text": "And packing cubes- 14 days, stick to a few colors.."}, {"username": "Austin Briscoe", "comment_text": "Osprey farpoint 55"}, {"username": "Izzie MacDonald", "comment_text": "Just a common or garden backpack nothing fancy..owned it for 20 years!!"}, {"username": "So Heila", "comment_text": "Following"}, {"username": "Barbara Gentilcore", "comment_text": "What are the carry on luggage allowances for the different airlines?"}, {"username": "Dann Hrusch", "comment_text": "Osprey Farpoint/\nFairview 40 pack. Much more comfortable and supportive than many of the alternatives. I've taken the Farpoint everywhere. My wife has the wheeled version and loves it. Also can't beat the Osprey lifetime guarantee."}, {"username": "Jorge Manuel Goncalves Gomes", "comment_text": "Army"}, {"username": "Shawn Galbraith", "comment_text": "Any carryon\n21 inch or 53 cm"}, {"username": "Michael Widjaja", "comment_text": "Did short trips in EU using backpack and cabin bag,I use Rimowa cabin L and mont bell equipment bag,flew with Ryanair so I can pay for 2 carry ons (basically it's a hush hush pay)"}, {"username": "Dina Garrett", "comment_text": "Linda Williams, BillandAngala Verley, Julie Franco Mellow saved"}, {"username": "Cheri Arrowood-Stanziano", "comment_text": "We have purchased 2 AWAY large suitcases, 1 smaller carryon w battery charger for phones/\ncomputers, 1 large duffle. I am looking at the bigger carryon.\nAWAY has an awesome warranty. The clip on my suitcase broke and they replaced the suitcase"}, {"username": "Carol Hayes", "comment_text": "Which backpack? Appreciate responses."}, {"username": "DeAnna Pulliam Like", "comment_text": "1. I used one carry-on backpack for myself. Cotopaxi Allpa 42L. I loved this because it is a backpack (easy to carry around) that opens like a suitcase when you lay it down. I packed light and did not fill the backpack. I easily could have gotten the smaller 35L size - that would have worked even better for me with a little less weight and size. I was able to get away with the 42L size by keeping it light. I think if I had been on a discount international airline, they would have made me check it. A 35L would fit their guidelines. 2. My husband and youngest son used Osprey Fairpoint 40. Those worked well. 3. My oldest son used REI Ruckpack 40L. My husband said he liked that one best because of how much wider it opened at the top than the Osprey."}, {"username": "Linda Robertson", "comment_text": "Monos carry on Plus"}, {"username": "Lori Kearns Cates", "comment_text": "Bric’s. Just remember that some of the airports are much stricter than the US with liquid limits. Be sure they fit in and are in a quart sized see through bag."}, {"username": "Jill MCanfield", "comment_text": "The Monos carry on plus is very slightly lighter (.3 pound) than the away and has the about the same interior volume (47.9L for Away bigger carry on and 48L for the Monos carry on Plus). The lipault carry on is quite a bit lighter, but also smaller. I use the lipault for work travel and it’s held up beautifully. I use the monos for personal travel, because I have the overnighter which holds almost as much as the suitcase and slips easily over the handle. I’ve used the overnighter as my personal item under the seat when traveling within the US or traveling abroad from the US, but it would count as the carry on for a European carrier, so you’d need to check the suitcase if you bring both and travel within Europe."}, {"username": "Carolyn Madl", "comment_text": "Rimowa carryon and mz Wallace’s new backpack with trolley sleeve room to spare for 10 day trip!"}, {"username": "Ashley Johnson", "comment_text": "I have a 21 inch Kenneth Cole suitcase with compression packing cubes."}, {"username": "Tina Fox", "comment_text": "Caribee Traveller Carry on bag 40 L\nWeighs just over 1kg and we have a 7 kg allowance\nI haven’t seen any other cabin baggage that is lighter in weight"}, {"username": "Carol Withey", "comment_text": "I think any right sized bag will do but I selected mine on the lightest to start with. This allows you to pack more."}, {"username": "Kim de Blecourt", "comment_text": "International size Samsonite. Lifetime warranty has served well. All open inside makes easier use of packing cubes / rolling up my items. I use only a personal item & carry-on for two weeks or less."}, {"username": "Mimi Nguyen", "comment_text": "Carryon is the way to go when traveling internationally\n. We are so glad we brought just a carry on bag and a backpack for our 16 day trip to Europe. Seeing the long line for luggage check in reaffirms our decision.\nI bought this for my daughter.\n\nSHIZLIN 1 Pack Collapsible Carry... https://\nwww.amazon.com/\ndp/\nB0BNJ2QT83?ref=p\npx_pop_mob_ap_s\nhare"}, {"username": "Kate Squillacioti", "comment_text": "Away! It was great, the problem actually wasn't the size it was the weight limit. We could have fit so much more in it if we didn't have to keep it around 17 pounds!"}, {"username": "Lisa Abrams Argento", "comment_text": "I se a backpack, ebags."}, {"username": "Sandra Desmond", "comment_text": "My carry on cabin bag is the shell 10kg case they don’t weight as much as the material ones"}, {"username": "Natalie Stamer", "comment_text": "Away!!"}, {"username": "Adriana Rodriguez-Argueta", "comment_text": "My husband and I each have a set of carry-on and check in Travelpro Platinum Elite and love them. We can pick and choose what to use depending on our destination, time of the year (for winter we use the check ins and summer the carry on ones) and length of travel. Bought them at Macys a few years ago and they are still in excellent condition. My husband travels domestically once a month and uses his carry on quite a bit. I would never waste my money on hard case ones; have seen many cracked once they come\nout of carrousel luggage at many airports. Packing cubes work perfectly in the Travelpro."}, {"username": "Brittany Whitfield", "comment_text": "We were very happy with our Cotopaxi 42L on our recent trip! Got tons of compliments too."}, {"username": "Adriana Rodriguez-Argueta", "comment_text": "Pricey but totally worthy"}, {"username": "Janet Dunkin", "comment_text": "Love my Eddie Bauer carry on! Used it for a 17 day trip to England and South Africa with no issues."}, {"username": "Janis Monk", "comment_text": "Delsey"}, {"username": "Meredith Holloway Helbon", "comment_text": "Following"}, {"username": "Laurie Denoni", "comment_text": "Rick steeves 2 wheel."}, {"username": "Stephen Henn", "comment_text": "Travelpro Maxlite 5 International Carry-On"}, {"username": "Antoinette Schultz Vogt", "comment_text": "I bought Kenzie hard side luggage set from Macys for $100. Came with a carry on and a checked bag. ITA size requirements are ridiculous which is why it took me 2 months to find what I needed for cheap! I’m not even using my checked bags! I think we are limited to 17.6 lbs! But it doesn’t say there’s a weight limit in the personal item! Stuff the backpack and removed the stuffing from neck pillow and stuff that with underwear and tshirts! Bringing an extra backpack rolled up to bring back purchases! I will have to check something on the way home!"}, {"username": "Charise Addicks", "comment_text": "I used the AWAY “bigger” carry on. If you are traveling a budget EU airline within the EU, in economy, you would have to check it. If you want to be sure to carry on, get the smaller one."}, {"username": "Nicole Beaumont", "comment_text": "Away carry on and Calpak terra backpack. Both pricey, but I’ll have them for awhile."}, {"username": "JeriLynne Clifford", "comment_text": "Mine was just samsonite. My backpack was the real rockstar. It’s from Everlane"}, {"username": "Larry Reinier", "comment_text": "We use Rick Steve’s . We usually go 4 to 6 weeks"}, {"username": "Lisa Pinder", "comment_text": "July expandable 40L carry one 2.2kg"}, {"username": "Darrah Horton", "comment_text": "Patagonia 70L Black Hole duffel bag, can carry as a duffel or a backpack.\n\nhttps://\nwww.patagonia.co\nm/product/\nblack-hole-duffe\nl-bag-70-liters\n/49347.html"}, {"username": "Lauren Davis", "comment_text": "I have a Delsey hard side and it works great!"}, {"username": "Betsy Davis", "comment_text": "Travelpro platinum elite, hands down!! I have a carry on and a large checked bag. I have used it international, domestically, all over. Amazing luggage."}, {"username": "Sally Iovene Haase", "comment_text": "I would never give up my Tumi international size carry on. In the states, flying internationally\n, small regional airports, puddle jumpers in the Greek islands, it has served me well."}, {"username": "Laura Taylor Gregar", "comment_text": "I cannot find International size carryons on amazon. What’s the diff between international size and regular?"}, {"username": "Mimi Kyle", "comment_text": "TravelPro luggage & we were in Europe for 16 days."}, {"username": "Renae Larcus", "comment_text": "I have some generic brand rollerboard with 4 wheels. My husband has a new Osprey backpack. We do two weeks of travel with these two items and I also carry a backpack."}, {"username": "Michelle Plutto", "comment_text": "I plan on one checked. I can’t imagine fitting everything I want in a carry on and so many times they check your carry on anyhow"}, {"username": "Sue Sherwood", "comment_text": "Pack a folding duffel bag. Put all your dirty laundry in it for the trip home. Provides lots of space for souvenirs. I used an expandable carry-on and backpack. Cross body purse too. I used a swiss gear suitcase from Target $100."}, {"username": "Cathleen Fager", "comment_text": "Travelpro platinum elite in varying sizes and any color but black. Last forever."}, {"username": "Carolyn Straniere", "comment_text": "I love Riccardo by Beverly Hills."}, {"username": "Shannon Marie", "comment_text": "Samsonite"}, {"username": "Monique Swanner", "comment_text": "Joyway from Amazon!! It took the cobblestone streets like a champ and I fit everything in for about 11 days!!"}, {"username": "Erika Meipoom-Jones", "comment_text": "Samsonite hard body"}, {"username": "Cheri Arrowood-Stanziano", "comment_text": "AWAY"}, {"username": "Jennifer Quizon", "comment_text": "Just make sure your carryon luggage is size right- check the airlines and your backpack must fit underneath the seat if u are carrying it on plane also They get picky"}, {"username": "Greg Saba", "comment_text": "Don't forget to pay attention to size. If you plan to fly within Europe, RyanAir has many routes and one of the most restrictive sizing for carry-on bags. Their limit is 55cm x 40cm x20cm and max of 22 lbs. We make sure our carry-ons, even though they can be larger for US airlines, meet those discount carrier standards. Baggage fees on these airlines can quickly consume the bargains you get."}, {"username": "Antonia Dosik", "comment_text": "Lipault It is a French brand available in the US. We are about to leave for a month trip to France and Italy and I am taking my 5 year old carry-on bag which is holding up very well. Lipault is a great brand. I also travel with a backpack. I should add we will have laundry facilities which makes this possible."}, {"username": "Monica Morris Durbano", "comment_text": "Away or Tumi (the domestic size is a bit bigger than intercontinenta\nl. Monos is great too"}, {"username": "Vonda Gaylor McGill", "comment_text": "The Away “bigger carry on” is amazing."}, {"username": "Rhonda Hope", "comment_text": "Lipault spinner"}, {"username": "Desi Taylor", "comment_text": "Ebags Motherlode Backpack"}, {"username": "Lisa McDougal", "comment_text": "We love our AWAY luggage. Pricey but worth it."}]}, {"id": "2198609337204811", "text": "Can anyone advise on an inexpensive ($700/750) chartered boat for the day for 3 people from Sorrento?", "link": "facebook.com/groups/1373361046396315/permalink/2198609337204811/", "likes": 0, "comments": []}, {"id": "2198610630538015", "text": "Hello everyone! I am learning so much and am hoping to plan a trip for 2024. What do you think of January in Italy. Since it is out first trip we are thinking Venice, Rome, Florence,Sorrento....we dont need beach trips.", "link": "facebook.com/groups/1373361046396315/permalink/2198610630538015/", "likes": 0, "comments": [{"username": "Susan Janssen Harshell Stokley", "comment_text": "I have never been but was thinking Jan or Feb as well!! I will retire soon amd can travel when I want, I don't have to go in the summer anymore."}, {"username": "Nicola Ramoso", "comment_text": "Sorrento and Rome might be fine but the atmosphere might likely be a little bit grey and moody unless you arrive during Christmas time"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "It’s winter. If you don’t mind the cold it will be less crowded. Depends on what you are going for. I prefer a little warmer so I can enjoy outdoor cafes etc."}, {"username": "Debbie Potter", "comment_text": "I would say that it's very cold... but to each there own."}, {"username": "Karen Schmidt", "comment_text": "We did a European vacation around Christmas time and into mid January. We spent New Year’s Eve, and the first week of January in Venice, and did some side trips. Although it was cold, it was definitely very manageable, and we loved it! We debated doing some thing similar again this year, around the same time, but opted for may as I’ve never been in spring. The crowds were lovely, the cost was down, and it was magical with the fog. I would definitely recommend. ￼ The picture is of our side trip to Verona around January 2."}, {"username": "Alice Francesca", "comment_text": "Beaches will be closed in winter anyway.It s the cold season, even if how cold it depends.Surely humid and colder in Venice than Rome or further south.Anyway I am Italian and winter is fine."}, {"username": "Cettina Milioto", "comment_text": "Many stores and restaurants are closed in sorrento from January to March. I was so surprised owning that most people close their business because nobody is there and it more expensive to keep it open than to close."}, {"username": "Peach Panfili", "comment_text": "January is mid winter and Sorento and The Amalfi Coast doesn’t really come to life till about mid April."}]}, {"id": "2198610993871312", "text": "Looking to visit tropea. Is it doable with young children? My youngest is 7 mo.. thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2198610993871312/", "likes": 2, "comments": [{"username": "Sandy Tadken Shaffer", "comment_text": "Yes"}]}, {"id": "2198612227204522", "text": "Every time you round a corner or turn your head is a picture postcard.", "link": "facebook.com/groups/1373361046396315/permalink/2198612227204522/", "likes": 104, "comments": [{"username": "Dixie Kotylak", "comment_text": "Got back to Italy from Greece this morning, in Sorrento and it’s absolutely gorgeous! Definitely a must see! On to Naples and Pompeii tomorrow 🥰"}, {"username": "Lisa Petry", "comment_text": "Lisa Petry"}, {"username": "Maria LaPietra Guerrero", "comment_text": "So true"}, {"username": "Susan McHenry", "comment_text": "Absolutely amazing photos💗"}, {"username": "Julie Hinton", "comment_text": "Perfect description!"}, {"username": "Lilly Raymond", "comment_text": "So true!!!"}, {"username": "Tammy Jo", "comment_text": "Great pictures!!"}, {"username": "Tami Fehn", "comment_text": "Fabulous pictures!"}, {"username": "Rose Oliver", "comment_text": "I loved it all"}, {"username": "Paul Davis", "comment_text": "Holly Jaffe: very true!"}, {"username": "Diane Lebel", "comment_text": "Love your pictures"}, {"username": "Tim Collins", "comment_text": "So cute"}, {"username": "Tim Collins", "comment_text": "Sure!"}, {"username": "Maria Ariano", "comment_text": "Thanks! Beauty is in the eye of the beholder ❤"}, {"username": "Joan Scott", "comment_text": "Joan Scott"}, {"username": "Cheryl Tomkinson-Hunter", "comment_text": "Awesome pictures! May, I suggest that you put your signature on your photos. They are beautiful and without a signature they are not known as yours."}, {"username": "Cheryl Trigg", "comment_text": "Great photos, you really captured the essence of Italy 🇮🇹❤️"}, {"username": "Bonnie Apfelbaum", "comment_text": "Your fabulous pictures tell an amazing story💗"}]}, {"id": "2198615583870853", "text": "Going to be in Naples for 3 days. Please give me ideas! We are planning on Capri one day!☺️we are going June 2024", "link": "facebook.com/groups/1373361046396315/permalink/2198615583870853/", "likes": 4, "comments": [{"username": "Virgz Van Møøre", "comment_text": "Naples : Capodimonte and San Elmo, Via Toledo, Duomo, Chiostro Di Santa Chiara, Lungomare, Castel dell'Ovo, Teatro San Carlo, Palazzo Reale, Piazza del Plebiscito, Monte della Misericordia, Capella San Severo. Taste gelato at Gay Odin, pizza portafoglio, pizza frita, fiori di zucca fritti, sfogliatella. Train to Pompei. Ferry to Ischia, Procida, Capri.\n\nCostiera amalfitana : Sorrento as a base. Go to : Positano, Amalfi, Ravello. The roads are usually busy, better with the ferry. Hike on the path of Gods. You can also take the ferry to visit the islands from there.\n\nEnjoy the Dolce vità !"}, {"username": "Janice Rea", "comment_text": "Pompeii"}, {"username": "Cindy Breneman Hattrich", "comment_text": "We go august through September 2023 and one place is isle of capri. Can’t wait"}, {"username": "Lisa Quinn", "comment_text": "Lots of mix and match options:\n\nNaples one day\nSorrento one day\nCapri one day\nPompeii another half\nHerculaneum half\nIschia overnight"}, {"username": "Franco De Luca", "comment_text": "Stay out of Naples. It’s dirty, lots of crime and it’s crazy. However, the Amalfi Coast, Capri and Pompeii. That is where you need to be. And these places are not too far from Napoli."}, {"username": "Kim Swenson", "comment_text": "Definitely do the chair lift in Anacapri!"}, {"username": "Dave Conroy", "comment_text": "Naples isn't for everyone. If you like life, bustling realism, pizza, street art and tons of things to visit (over 100 sites in the city are scoring a minimum 4/5 on Trip Advisor), then it's worth a go. Some prefer 5***** hotels, expensive tours, and never without AC exclusivity. Naples probably won't appeal. I would select 2, 3, or 4 of my own researched priorities, as I assume you know what you're more likely to enjoy, then Pompei and then a day on an island by boat - Capri if you want to, but see your options and choose your preference. I prefer my own research. I rarely listen to opinions as they're often too subjective, more money than sense, or plain wrong. OK, if 100 out of 100 say Naples is a dump, then I'll take some note. But that isn't the case. A great little youtube by Omar Gonzalez Photographer on the Naples vibe and his family trip sums it up for me."}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "Take a trip to Pompeii from Naples! Was there this past weekend and it was the best!"}, {"username": "Meredith Holloway Helbon", "comment_text": "Following"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Sorrento yes then Stay in Anacapri on the other side of Capri …! One of the best small towns"}, {"username": "Ian Fawkner", "comment_text": "You definitely should experience Napoli - it’s chaotic, exasperating and exhilarating all in the same breath but three days might be one too many ?"}, {"username": "Kathy Smith", "comment_text": "Everyone has their own opinions but I just got home from Italy. Naples isn’t for everyone. I only did one night and that was enough. Friends of mine immediately checked out as didn’t like it."}, {"username": "Valerie Collanton", "comment_text": "I stayed at https://\nwww.matildehotel\n.com/ last October. Very nice hotel. Quiet but close to everything."}, {"username": "Valerie Collanton", "comment_text": "Have done a solo trip to Naples and really enjoyed it. The food is amazing. There is a lot to see. That time i stayed at\nhttps://\nwww.partenoperel\nais.it/.\nVery nice boutique hotel near the sea.\n\nLast October I was there with my sister and we stayed at Matilde hotel.\nhttps://\nwww.matildehotel\n.com/. Very nice hotel. Modern rooms. Quiet."}, {"username": "Steve Grossman", "comment_text": "Amalfi"}, {"username": "Danielle Gervais", "comment_text": "Pompei and Sorrento better then Naples"}, {"username": "Genevieve Bastien", "comment_text": "Don’t be negatively influenced by the bad comments from Naples. We were there with our 3 young daughters and felt safe. We ate and stayed in Chiaia and Lungomare and it was really nice. Day trips are so convenient as 50 mins ferry’s or train rides and you are there. Another benefit are the hotels less expensive in Naples so more money for experiences and good restaurants ;)"}]}, {"id": "2198615610537517", "text": "Hi! I’m trying to travel from USA to Alba Island … any advice ?", "link": "facebook.com/groups/1373361046396315/permalink/2198615610537517/", "likes": 2, "comments": [{"username": "Theodore Meyer", "comment_text": "Isola d’Elba? Take the boat from Piombino."}, {"username": "Ken Lerch", "comment_text": "Alba is a town in Piedmont. Elba is an island off the west coast. Do you know where you’re going?"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2198620977203647", "text": "I am planning to do day trips by rental car while in Tuscany. We are based in a small town called Sinalunga. Any personal knowledge of this village? Tips?", "link": "facebook.com/groups/1373361046396315/permalink/2198620977203647/", "likes": 0, "comments": []}, {"id": "2198618590537219", "text": "Any suggestion for pasta making classes in Rome?", "link": "facebook.com/groups/1373361046396315/permalink/2198618590537219/", "likes": 2, "comments": [{"username": "Sarah Lybarger", "comment_text": "Following!"}, {"username": "Kiana Cathy-Ann Strong", "comment_text": "Following x"}]}, {"id": "2198620613870350", "text": "Beautiful Venice!! Burano and Murano❤️🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2198620613870350/", "likes": 40, "comments": []}, {"id": "2198639040535174", "text": "Questions about car rental in Tuscany. Is it best to pick up in Florence? What is the average deposit for a 2 day rental?", "link": "facebook.com/groups/1373361046396315/permalink/2198639040535174/", "likes": 0, "comments": [{"username": "Carole Tarlap", "comment_text": "Deposit? You pay entire price when you pick up the car. Don't forget INSURANCE 💥"}]}, {"id": "2198621673870244", "text": "For me this was one of the highlights of our first family trip to Italy. I get that this is an extravagant away of exploring and touring the Amalfi Coast but as we are renovating next summer we are not likelyआणखी going to be traveling and so instead of celebrating my 50th I decided to celebrate my 49th.\n\nWe went out with Capasecca Yacht for a four day (3 night) mini-cruise. They do offer shorter ones and as this was our first experience ever chartering a boat. The captain (Tony) and mate (Daniel) were great. We had two swimming stops each day. We overnighted in Capri’s Grande Marina, Amalfi’s Marina and Sorrento’s seaport.\n\nPersonally, we all agree that two nights would have been perfect amount of time.\n\nIf anyone has any specific questions about the experience let me know.", "link": "facebook.com/groups/1373361046396315/permalink/2198621673870244/", "likes": 284, "comments": [{"username": "Yelena Larionova", "comment_text": "Following"}, {"username": "Anita Pirone", "comment_text": "Looks amazing. Interested in cost as well and what was included."}, {"username": "Eric Guinn", "comment_text": "Looks awesome!!"}, {"username": "Kim Blanton Ferguson", "comment_text": "So why recommend just two nights?"}, {"username": "Angel Leckner", "comment_text": "What an awesome way to spend some time in Italy!! Thank you for sharing and for also including a link! We are just back from 17 days where we started in Rome and worked our way north to Milan (all inland) and I am already busy planning our return to visit southern Italy!"}, {"username": "Iris Garza", "comment_text": "Danny 👀"}, {"username": "Jennifer Turco", "comment_text": "What a fantastic idea"}, {"username": "Mariposa Mariposa", "comment_text": "So beautiful 🇮🇹🤍"}, {"username": "Debi Murray Lee", "comment_text": "Wow , stunning"}, {"username": "Jane Conie", "comment_text": "Which were your 2 favorite ports to stay at? Thanks for sharing"}, {"username": "Meredith Holloway Helbon", "comment_text": "I would absolutely love to know what this costs, or a website please so I can look into it. Thank you so so much! ❤️"}, {"username": "Jenny Gaines", "comment_text": "Absolutely stunning! Would love more info, we’re heading to Italy next May and are boaters… this looks amazing"}, {"username": "Linda Love Vines", "comment_text": "Amazing!"}, {"username": "Robert Peters", "comment_text": "Hi - I’m on their site…which yacht did you use? Thank you"}, {"username": "Nancy Lewis", "comment_text": "Jeff McLellan Questions! Oh yes I have questions!\nHow many does it sleep and approx price range! Please!\nIs good included or you ate on shore?"}, {"username": "Alicia Cox", "comment_text": "This is AWESOME! I said the next time to Amalfi coast for me is either by boat or private driver! Driving it was terrifying (& im VERY adventurous) & the public bus was not much better as it was super crowded & so hot & we all got so nauseated! What an awesome experience! And Happy Birthday!"}, {"username": "Nathan Earl Stellenberg", "comment_text": "that looks amazing! Whats the cost?"}, {"username": "Gina Tuley", "comment_text": "Sounds amazing!"}, {"username": "Kelly Ladwig", "comment_text": "Looks absolutely amazing"}, {"username": "Carmen Zervigon Everett", "comment_text": "Did you stay on board both nights?"}, {"username": "Marisa Ursini Brancato", "comment_text": "Wow! That’s awesome!"}, {"username": "Michelle Plutto", "comment_text": "Do they have a dingy for rent? 🤣"}, {"username": "Lillian Giglia Maniscalco", "comment_text": "How much?"}, {"username": "Maggie Moyer", "comment_text": "Amazing!! I could stay on a yacht for a month!"}, {"username": "Danny Garza", "comment_text": "Would you mind sending the contact info"}, {"username": "Lisa Mac", "comment_text": "This looks lovely thank you for sharing. We’re the beds clean and comfortable ?"}, {"username": "Krissy Dascoli-Meehan", "comment_text": "Matthew R. Meehan"}, {"username": "Cheryl Tomkinson-Hunter", "comment_text": "What a fabulous way to send off your 40’s and to enter your 50’s! Happy Birthday!"}, {"username": "Elena Schlosser Carlson", "comment_text": "Jeff McLellan I sent you a DM. I would love the contact info to keep in mind for a future trip. Looks amazing."}, {"username": "Jaime Myers Reifschneider", "comment_text": "Yes this is how I want to travel!"}, {"username": "Jamie Keeling Hurley", "comment_text": "This looks amazing! What is the approximate cost of something like this?"}, {"username": "Monica Bazzani-Adache", "comment_text": "That looks amazing"}, {"username": "Tara Roed", "comment_text": "How did you book this? My kids would Love it!!"}, {"username": "Lorraine Klein Lynch", "comment_text": "How many passengers does it fit? What are the sleeping rooms like?"}]}, {"id": "2198632663869145", "text": "We are in San Remo for five days. What should we not miss? Which beaches are good?", "link": "facebook.com/groups/1373361046396315/permalink/2198632663869145/", "likes": 0, "comments": []}, {"id": "2198645903867821", "text": "Three days in Florence", "link": "facebook.com/groups/1373361046396315/permalink/2198645903867821/", "likes": 22, "comments": []}, {"id": "2198649230534155", "text": "All roads lead to Rome!", "link": "facebook.com/groups/1373361046396315/permalink/2198649230534155/", "likes": 1, "comments": [{"username": "Ken Vecchia", "comment_text": "Great picture 💕"}, {"username": "Jay Cabrera", "comment_text": "I miss Rome…"}, {"username": "Anne Contini", "comment_text": "Yes they fo - thankfully. My Rome is beautiful & eternal."}, {"username": "Sabine Dielacher", "comment_text": "Sabine Dielacher"}, {"username": "Romina Lauretig Toscano", "comment_text": "We are close :)"}]}, {"id": "2198650100534068", "text": "Hi all!\nDoes anyone have any recommendations of cafes/restaurants with a view (roof top etc)\nIn or near any of these locations. Pictures too would be greatly appreciated!\n*Venice\n*Florence\n*Rome\n*Ercolano\n\nTIA", "link": "facebook.com/groups/1373361046396315/permalink/2198650100534068/", "likes": 2, "comments": [{"username": "Jessica Petyo", "comment_text": "We stayed at Palazzo Gaddi in Florence a couple weeks ago and the rooftop bar has beautiful views."}, {"username": "Molly Roberts Siegenthaler", "comment_text": "Google Best Rooftop bars (city)."}, {"username": "Nicole Graham", "comment_text": "Jessica Petyo these look fantastic thank you! 😊"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Florence check The Lodge"}, {"username": "Molly Elizabeth", "comment_text": "We did the Loggia Roof Bar in Florence."}, {"username": "Claudia Amp", "comment_text": "Palazzo Guadagni, Caffè del Verone (Museo degli Innocenti) in Firenze, Palazzo Manfredi in Rome"}, {"username": "Sarah Williams", "comment_text": "Hotel Danieli in Venice. Rooftop bar and restaurant. You can do drinks only as a non-resident but only between certain times. Building and view is beautiful and service impeccable https://\nwww.facebook.com\n/\nhoteldanieliveni\nce"}]}, {"id": "2198659360533142", "text": "Has anyone used a app on their iPhone for translation if so which one ?", "link": "facebook.com/groups/1373361046396315/permalink/2198659360533142/", "likes": 1, "comments": [{"username": "Cecilia Christine Costantini", "comment_text": "Use GoogleLens, you take a picture of something and choose the translate option (you need to be connected to the internet to be able to use it)"}, {"username": "Nick Trostel", "comment_text": "The native camera app can quickly translate menus and signs and the built in Translate app is amazing. Both the regular and conversation modes. I have had conversations with people speaking Italian, Spanish, and Chinese so far, flawlessly. It was pretty amazing"}, {"username": "Brice Blosser", "comment_text": "Google translates"}, {"username": "Neville Spargo", "comment_text": "Google Translate app had been very helpful during our Europe holiday."}, {"username": "Hollie Barcheck Juersivich", "comment_text": "iTranslate"}, {"username": "Wendy Kruskall Venti", "comment_text": "Google translate"}, {"username": "Annie Gerke", "comment_text": "SayHi App\nGoogle translate isn’t very accurate"}, {"username": "Vasthi Cheddar", "comment_text": "Google lens... and hit translate"}]}, {"id": "2198667897198955", "text": "Any recommendations\nfor travel between December 25-Jan 2?", "link": "facebook.com/groups/1373361046396315/permalink/2198667897198955/", "likes": 0, "comments": [{"username": "Mike Wiacek", "comment_text": "Following"}, {"username": "Dave Conroy", "comment_text": "Can you elaborate?"}]}, {"id": "2198675593864852", "text": "Sacra San Michele, near Turin. Any advice (getting in, etc.)", "link": "facebook.com/groups/1373361046396315/permalink/2198675593864852/", "likes": 2, "comments": []}, {"id": "2198651520533926", "text": "Hi all I am traveling to Amalfi this fall and I have eczema so I make my own ointments with oils and put into droppers I carry with me to apply when I have a flare up. My question is did anyone traveling from the US to Italy and Italy back to USA have any issues with unmarked bottles in their luggage or face serums, oils, you’d have in your makeup bag? It’s expensive for me to make these ointments and I heard that they will throw away unmarked bottles with oil or whatever in them in people’s luggage. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2198651520533926/", "likes": 3, "comments": [{"username": "Amalia Cristina", "comment_text": "From what I know they took away the 100 ml limit recently, as to the label I don’t know.."}, {"username": "Kimberly Becker Mast", "comment_text": "Bring them in carry on if possible but no one questioned any unmarked cosmetics in decanted containers when I went, and I had a lot of such bottles."}, {"username": "Jennifer Larese Taylor", "comment_text": "100ml limit is still in place for carry on items. However, I decant my cosmetics into smaller containers to take and it’s never been a problem"}, {"username": "Yosha Jimenez", "comment_text": "As long as it’s 3oz and under they shouldn’t give you a problem. I did the same. Brought face oil in a 2oz Amber dropper bottle."}, {"username": "Andrea Marie", "comment_text": "No issue. Use TSA-limit sized bottles (3.4 oz or 100 ml) in your carry-on."}, {"username": "Prisca Aroomoogum", "comment_text": "Only a handful of airports in EU have lifted the liquid restrictions for hand luggage , but for the majority of airports the rule is very much intact.\nIf you can get travel size containers it would be better. It would save you space and weight.\nI have found a link from Pisa airport that pretty much covers the main rules. Wishing you a great trip 🙂\n\nhttps://\nwww.pisa-airport\n.com/en/\nthe-passengers/\ndepartures/\nbefore-departure\n/\nliquids-in-the-h\nand-luggage.htm\nl#:~:text=Restr\nictions%20to%20\nliquids%20carri\ned%20in%20the%2\n0hand%20luggage\n&text=Each%20co\nntainer%20shoul\nd%20have%20a,on\ne%20such%20bag%\n20of%20liquids."}, {"username": "Maria Coladangelo Ducca", "comment_text": "Very true. You need to get a dr. Orders note with a translation and signed. Get it notarized . Not sure contact the Italian embassy here as soon as possible."}, {"username": "Kim Tisot Reinboth", "comment_text": "I’ve never had an issue as long as it was the correct size. Checked bags. No problem at all."}, {"username": "Nydia Bryan", "comment_text": "My daughter has eczema. because Italy has a higher restriction on Ingredients that go in products I’m hoping to find some products I can bring home. Natural products/ ingredients are so expensive in US.\n🤞🏽"}, {"username": "Joshua Pickles", "comment_text": "Make a label"}]}, {"id": "2198654707200274", "text": "We are traveling from Ischia to Sorrento tomorrow but we have a 4 hr wait between our arrival at the port and check in at our Airbnb. I read somewhere there is a place to rent lockers for storage but myआणखी companion has a large check in suitcase so it won’t fit into the lockers. Could anyone give any insight where we might be able to store a it for a few hours near the port? Quick pic and video of Ischia Porto from the Castello d’Aragonese taken over the weekend.", "link": "facebook.com/groups/1373361046396315/permalink/2198654707200274/", "likes": 10, "comments": [{"username": "Debbie Davidson Cvijanovich", "comment_text": "Looks amazing!! Any Ischia notables? We’re there for 6 days in October. Grazie!"}, {"username": "Diane Davis Lawyer", "comment_text": "I could help you if it was Naples, but I know nothing about Sorrento when it comes to baggage lockers. In Naples there are quite a few, including the train station and they all hold large checked bags. Are you arriving in Sorrento by train? Check the train station if so to see if they have any luggage holds."}, {"username": "Lauren-Jade Roberts", "comment_text": "Ask the air b and b. Most checkouts are at 10am so will let you drop your bags off early"}, {"username": "Tammy Jo", "comment_text": "Tessa"}]}, {"id": "2198662407199504", "text": "Hi all wondering if any one has boat schedules from Almafi port to Capri?\n\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2198662407199504/", "likes": 0, "comments": []}, {"id": "2198661503866261", "text": "We have an egg allergy in our group. Is most pasta in Italy egg free or does it just depend on the restaurant?", "link": "facebook.com/groups/1373361046396315/permalink/2198661503866261/", "likes": 1, "comments": [{"username": "Michela Ratti", "comment_text": "Unless it is pasta all’uovo pasta has no eggs in it"}, {"username": "Silvia Frati", "comment_text": "If it is not specified,Dried\npasta (penne,fusilli,\nspaghetti)does not contains eggs. Pasta usually contains eggs (whole or parts) when it is handmade, but not all restaurants do that. Also, it is more common to find tagliolini,tagl\niatelle but also ravioli and tordelli with eggs"}, {"username": "Lisa Rotondi", "comment_text": "As a note, many restaurants in Italy use a number system for allergens and are excellent about labeling."}, {"username": "Alice Francesca", "comment_text": "It is mandatory by law in every restaurant to have the list of allergens on the menu."}]}, {"id": "2198667317199013", "text": "Looking for first-hand good food recommendations specifically for: lunch on the island of Burano, lunch in Vatican City, early lunch near the colosseum, and early lunch in Florence. Thank you in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2198667317199013/", "likes": 0, "comments": [{"username": "Virgz Van Møøre", "comment_text": "In Burano : trattoria da Primo , in Florence bistecca at 13 Gobbi, or peposo at Bondi or tagliere at trattoria Boboli"}]}, {"id": "2198667940532284", "text": "We are planning a trip for May 2024. Our thoughts are to stay in\nMilan\nFlorence\nPositano\nCinqueterre\nRome\n\nHow many days in each is a good amount to stay to see the highlights of the city. TIA", "link": "facebook.com/groups/1373361046396315/permalink/2198667940532284/", "likes": 0, "comments": [{"username": "Andria Saia", "comment_text": "That is a lot of cities (9) - how long are you planning to travel?"}, {"username": "Miyuki Kanno Paul", "comment_text": "Are you flying into Milano and flying out from Roma?"}]}, {"id": "2198668923865519", "text": "My holiday to Sicily cancelled due to fire at catania airport! 🥹anyone else affected?", "link": "facebook.com/groups/1373361046396315/permalink/2198668923865519/", "likes": 0, "comments": []}, {"id": "2198665900532488", "text": "Join us on this exclusive experience! Stay comfortably seated on your sofa and embark on a journey into the heart of Naples, one of the world’s most vibrant cities and marvel at the splendours of the Royalआणखी Palace of Caserta!\nJoin our virtual experience: https://nextstop-italy.com/virtual-tours/naples-royal-palace-caserta/\n\n#italyiloveyou #art #italytravel #italytrip #italygram #history #virtualworld #VirtualTour #vacationmood #naples #naplesitaly #naplesinsider #caserta #casertaitaly #casertapalace #amalfi #amalficoast #amalficoastitaly #napoli #royalpalaceofcaserta #royalpalace #royalpalace", "link": "facebook.com/groups/1373361046396315/permalink/2198665900532488/", "likes": 4, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2198631720535906", "text": "DAY 4 MATERA - GRAVINA IN PUGLIA (27 KM)\nGravina is a \"little Matera\", built on the edge of a ravine, and like Matera , it has an ancient quarter with dwellings and churches hewn out of the rocky hillside.\nWhere… आणखी to stay: Agriturismo Masseria Sant'Angelo, a peaceful typical Italian farmhouse! Discover more: https://www.tkqlhce.com/click-100692842-11552042?url=https%3A%2F%2Fwww.tripadvisor.com%2FHotel_Review-g1077046-d3364386-Reviews-Agriturismo_Masseria_Sant_Angelo-Gravina_in_Puglia_Province_of_Bari_Puglia.html\nDid you know? In Gravina you can walk on the famous bridge which is the first scene of the famous James Bond saga \"No time to die\"🤩\n#jamesbond #gravinainpuglia #puglia #pugliagram #matera #italy #apulia #apulianholidays #apulianlife #apulianstyle", "link": "facebook.com/groups/1373361046396315/permalink/2198631720535906/", "likes": 6, "comments": []}, {"id": "2198609983871413", "text": "Come explore Spello, one of Umbria’s most enchanting places! Join our local guide Patrizia in the exploration of this hidden gem as she walks through Spello’s crooked streets, ancient city gates and pink stone houses. Strolling through the heart of the village, you will be enchanted by the traces of its past: the Roman walls with their well-preserved gates, the remains of the ancient Roman amphitheatre and the thermal baths. You will breath in the art and history of this charming village.\n\nThis is also the best time to visit Spello, considered one of the most ‘flowery’ cities in all of Italy! During this season, the alleys of Spello are transformed into an explosion of colours, the balconies, windows and alleys of the historic center are covered with flowers…you will be literally surrounded by flowers!\nJoin us: https://nextstop-italy.com/virtual-tours/spello-flower-town/\n\n#italytrip #italytravel #vacationmood #virtualworld #medievalart #italyiloveyou #rollinghills #medieval #virtualtour #hilltopviews #umbriagram #umbria #hiddenparadise #umbriatourism #Spello #virtual #flowers #flowerstagram #flowersoftheday #gardenlove #gardenlife #gardeninspiration #hamlet #hiddenplaces #hiddengems #hiddentreasures #hiddenbeauty", "link": "facebook.com/groups/1373361046396315/permalink/2198609983871413/", "likes": 15, "comments": [{"username": "Joanne Calzaretta", "comment_text": "In my next life I want to live in Italy!!!"}]}, {"id": "2185192981879780", "text": "Positano with a view 🥰\nLe Agavi is the first hotel you come to in Positano, an enchanting place, where the sea blends into the sky!\nDiscover more: … आणखीhttps://www.tkqlhce.com/click-100692842-12291623?url=https%3A%2F%2Fwww.tripadvisor.it%2FHotel_Review-g194863-d202899-Reviews-or10-Le_Agavi_Hotel-Positano_Amalfi_Coast_Province_of_Salerno_Campania.html%23REVIEWS", "link": "facebook.com/groups/1373361046396315/permalink/2185192981879780/", "likes": 68, "comments": [{"username": "John Sampson", "comment_text": "I think it's just nice to do your own thing .without having to answer to anybody.Especia\nlly Southern Italy.. so much of it is undiscovered.."}, {"username": "Bonnie Cope", "comment_text": "Absolutely gorgeous!!!\nAmazing photos !\nL❤️VE"}, {"username": "Kim Paetsch", "comment_text": "Is there a beach? Stayed at Pupetto with a beach."}, {"username": "Joe Visotski", "comment_text": "$$$$$$"}]}, {"id": "2198457727219972", "text": "Discover Montalcino from your home! Renowned all over the world for the production of its precious Brunello red wine, Montalcino is a fairy-tale place, a medieval village perched on a hill overlooking theआणखी beautiful Orcia valley.\nJoin our NEW virtual experience: https://nextstop-italy.com/virtual-tours/montalcino-tuscany/\n\n#tuscanyexperience #virtualworld #tuscanyitaly #tuscanytour #italyiloveyou #italytravel #medievalart #hilltown #italytrip #sunflowers #rollinghills #medieval #brunello #montalcino #brunellodimontalcino #brunellowine #orciavalley #tuscanygram #brunellomontalcino", "link": "facebook.com/groups/1373361046396315/permalink/2198457727219972/", "likes": 12, "comments": []}, {"id": "2161075640958181", "text": "The Godfather of the Amalfi Coast\nAvoid driving on unknown roads or taking slow public transportation on this full-day tour of the Amalfi Coast. Visit Positano, Amalfi, and Ravello in one day of sightseeing.… आणखी Highlights include guided commentary while driving along the famous coastline, stopping for pictures, free time for lunch (own expense) and plenty of time to see the main attractions in each coastal village.\nRead more about The Godfather of the Amalfi Coast - https://www.viator.com/tours/Positano/The-Godfather-of-the-Amalfi-Coast/d33602-224058P1?pid=P00070587&mcid=42383&medium=link&medium_version=selector", "link": "facebook.com/groups/1373361046396315/permalink/2161075640958181/", "likes": 40, "comments": [{"username": "Taylah Arnott", "comment_text": "Joel Brincat"}, {"username": "Meredith Holloway Helbon", "comment_text": "Following"}, {"username": "Chris Mattson", "comment_text": "Brett Mat"}, {"username": "Shula Hurvitz", "comment_text": "🇮🇹🥇💯🇮🇹🇮🇱"}]}, {"id": "2197376320661446", "text": "Hello! I'm planning for an early fall trip. What's your favorite town to visit from Rome to Orvieto? Something not crowded, an authentic experience but accessible by train. Thank you for your ideas!", "link": "facebook.com/groups/1373361046396315/permalink/2197376320661446/", "likes": 5, "comments": [{"username": "Alice Francesca", "comment_text": "Orvieto, Spoleto, Spello, Assisi all absolute gems"}, {"username": "Elena Eugeni", "comment_text": "https://\nmaps.app.goo.gl/\nowyf2C7q1CaWUyfY\n9"}, {"username": "Simone Pfenninger", "comment_text": "Pitigliano"}, {"username": "Martine Ferg", "comment_text": "Frascati!"}, {"username": "Cecilia Christine Costantini", "comment_text": "Spoleto is really peculiar because it is quite hilly and there are these underground escalators if you don't fancy walking up the hills that will take you to the main sights."}, {"username": "Cecilia Christine Costantini", "comment_text": "Duomo di Spoleto"}, {"username": "Cat Furness", "comment_text": "Cortona is beautiful 😍"}, {"username": "Carrie Jaquess", "comment_text": "Orvieto is very nice!"}]}, {"id": "2198070970591981", "text": "We have narrowed down our vacation mostly but second thoughts of Naples. Is there anything we would be missing? Florence or Sicily ? We are not big crowd people but wil do Rome and Pompei ruins but thinking less stress may be nice. Booking for October", "link": "facebook.com/groups/1373361046396315/permalink/2198070970591981/", "likes": 3, "comments": [{"username": "Susan Palmer", "comment_text": "Sicily is great but I think is a whole trip to itself. Lots to see."}, {"username": "Cindy Sguazzin", "comment_text": "I think it would be a shame to miss Florence—the birthplace of the Renaissance! Much to see, a beautiful city!"}, {"username": "Jason Hobel", "comment_text": "Skip Naples and stay in Sorrento as a base You can visit Pompeii, Herculaneum and Mount Vesuvius and also hit the Amalfi Coast from Sorrento. Sorrento is a beautiful town on the coast and not as crowded either especially during October."}, {"username": "Paul Anderson", "comment_text": "Oplantas is small but much more beautiful then Pompeii and much less crowded. The Suberban bath in Herculaneumis is very cool and all the skeletons of people who died there are just down below the bath."}, {"username": "Paola Pulga", "comment_text": "La Sicilia è grande, ottobre è un mese fantastico per venire in Italia. In Sicilia vai ancora in spiaggia"}, {"username": "Tiffany Hadfield Merrill", "comment_text": "Can’t speak for Naples because in the heat, we couldn’t see past the port area which looked like downtown LA to me. I hear it’s great though.\n\nSorrento & Florence were our favorites! So warm & welcoming… Sorrento is so quaint!"}, {"username": "Doug Burke", "comment_text": "Sicily should be a completely separate trip. We spent 12 days there and regreted not budgeting a few more. And just seeing Tauromina is not \"doing Sicily. It's crowded and touristy, unlike the rest of Sicily."}, {"username": "John Sampson", "comment_text": "I like the real Italy.. the small unknown areas.Rome,Mila\nn,Florence Naples..yes they are all beautiful but too busy for me..like the small mountain villages. Getting to know the locals..oooohhh\nand the Food!!!!!.....n\not good for the waistline haha"}, {"username": "Meredith Holloway Helbon", "comment_text": "Following"}, {"username": "Stefano Follador", "comment_text": "A region that foreign people usually forget is Puglia, if you are talking about south Italy.\nGreat sea, great food and wines.\nBari deserves a visit, so the Salento area.\nOstuni is wonderful, Otranto is pretty nice as well. Than it depends a lot by what you like to do and all the country is interesting and beautiful.\nI agree with some other people that commented about do the REAL Italy. Is nice to see the highlights but if you have time and the opportunity try to do something different"}, {"username": "Iliana Zlatareva", "comment_text": "Frolence and Cisily are totaly different"}, {"username": "Heather Sechrist", "comment_text": "I would get outside of Florence. There are a ton of charming towns that are easy to day trip to other areas. We are in Siena now and not crowded and very enjoyable in the evenings.\n\nSorrento was crowded. Maybe not when you are going though."}, {"username": "Ian Fawkner", "comment_text": "Definitely do Sicily- loved Messina and a little very authentic Italian town named Pozzallo- if you don’t want crowds or stress and want a real Sicilian experience that’s a place I recommend. Happy Home is the BnB apartment to book - magnificent!"}, {"username": "John Sampson", "comment_text": "Absolutely right..The unknown places in italy have souch to offer.. I have had some amazing trips to beautiful places in italy.i go to the same village every year.i have lived and worked in England all my life.So when I go to italy it's like a different world.so relaxed."}, {"username": "JeriLynne Clifford", "comment_text": "We went last October and only did Emilia Romagna. We went to Bologna, Modena (our favorite)and Rimini. We did not stay in airbnbs, we stayed on hotels. We became a local for 2 weeks and it was wonderful."}, {"username": "Elena Eckley", "comment_text": "Montecatini a spa town west of Firenze"}]}, {"id": "2198145233917888", "text": "Looking for some advice from experienced travellers 😎\n\nWe are coming from the UK and looking at 7-8 days Amalfi and Tuscany in October, not interested in Rome this trip. Do you think these two destinations are doable in this time frame? Should we visit one before the other? I’ve looked at different airports and it doesn’t bother us which we do first, just trying to work out at the least travel time. Has anyone travelled between these two locations from the UK?", "link": "facebook.com/groups/1373361046396315/permalink/2198145233917888/", "likes": 2, "comments": [{"username": "Jenny Payne", "comment_text": "Fly into Naples, local train to Sorrento then bus to Amalfi, depends what you want to see? then you have to get back to Naples fast train to Florence a lot of Kilometres or miles travelling , myself I would spend the time in Sorrento doing day trips to Capri, Positano, Amalfi 🌻"}, {"username": "Dave Conroy", "comment_text": "Short trip duration, long dull time to travel from Florence to Amalfi, or Naples to Florence. I wouldn't. I'd do one or the other. Florence and close by. Or Amalfi/Naples and Amalfi, close by. Be nice to relax not just stopping a day or two, packing up and travelling again, repeat. Plus you're going in October when things on the coast will be restricted."}, {"username": "Sara Punis", "comment_text": "For 7 or 8 days I would choise one destination. In the south you have Naples, Capri, Anacapri, Pomoei, Vesuvio, Amalfitana, Sorento..\nIn Tuscany also so much to see - Florence, Siena, S.Gimignano, Pienza, Bagno vignoni, Cortona, Pisa, Lucca, Montepulciano….\n."}, {"username": "Valeria Cuomo", "comment_text": "From naples to florence the high speed train takes 3 hours. You will miss half day traveling. I advice to visit naples, amalfi coast and capri or Ischia ( beautiful volcanic island with baths terms in front of Naples)"}, {"username": "Colleen Jennings", "comment_text": "Hiya also from UK. I’d do 1 or the other & suggest Tuscany. Fly to Pisa go & spend a couple of days in Lucca - 30 mins by train or take a taxi to Lucca. Then go to Florence & base yourself there for 2/3 days in Florence itself & day trips to sienna, San Giminiano & surrounding area. Do Naples/\nSorrento etc when you have another 8 days spare. Happy hols!"}]}, {"id": "2198348420564236", "text": "Hi all,\nWe are thinking of traveling to italy in the beggining of octocber with our 2 year old.\nCan anyone share thier experience with the weather that time of year and suggest where would be best to be? Thanks 😍", "link": "facebook.com/groups/1373361046396315/permalink/2198348420564236/", "likes": 2, "comments": [{"username": "Alessandro Iannelli", "comment_text": "It's still warm in the south, especially in Sicily. As you move up the peninsula, it gradually gets colder but even in Milan the weather should be fairly good at the beginning of October. I'd say it's one of the best months to travel to Italy, more or less everywhere in the country."}]}, {"id": "2198353693897042", "text": "Today Italy travel tip🤗Roma world theme park….I have not been but looks cool", "link": "facebook.com/groups/1373361046396315/permalink/2198353693897042/", "likes": 1, "comments": []}, {"id": "2198385187227226", "text": "Hi all ….In Taormina right now and looking for any tips to hire a private driver for a half day excursion to Gole Alcantara…. And a small boat for a private charter around the coast\nThankyou !", "link": "facebook.com/groups/1373361046396315/permalink/2198385187227226/", "likes": 1, "comments": []}, {"id": "2198386577227087", "text": "Helloo i am planning to visit Milan city in august. I am staying near city center of milan. I would like to know about safety issues. Milan city center is safe to stay ? Thanks in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2198386577227087/", "likes": 4, "comments": [{"username": "Wilki KJ", "comment_text": "Yes it's safe. Obviously there is some pickpockets as in all cities so just pay attention like you would anywhere else. August is when most Italians have holidays so a lot is shut. Metro, bus, trains are all ok. Walking is fine too"}, {"username": "Virgz Van Møøre", "comment_text": "Much safer than in Paris, anyway always pay attention to your belongings, never leave your bag or phone on a table or chair like in every big cities"}, {"username": "Virgz Van Møøre", "comment_text": "Some visit ideas : Duomo, navigli, Cenacolo, botanical garden, galleria VE II, castello Sforzesco, art nouveau, street art porta Ticinese, basilica San Lorenzo, rooftop bar at Rinascente with view on the Duomo, make sure to book well in advance for the Cenacolo. I stayed at hotel Gran Duca di York it was nice and central."}, {"username": "Alice Francesca", "comment_text": "Why Milan?in August?the least favorite Italian city by Italians.sorry,\njust being honest."}, {"username": "Carol Johnson", "comment_text": "I use the App TRIPIT , it will give you a safety rating on the different location you are going .. eg .. your Hotel it will give you near by restaurant , attractions, trains and other"}, {"username": "Frank Hunt", "comment_text": "The only place I was ever concerned about safety anywhere in Italy at any time was near the central railway station in Rome. Other than that I never gave it a thought at all, Italy is safe."}]}, {"id": "2198398393892572", "text": "Hi There ,sounds great .love Italy..\nA couple of years ago I went with some friends and rented privately from an Italian family\nIt was amazing..Hired car at Bari drove I land to Basilicata. Beautiful mountain village. Lots of walking .Great food etc .I've been four times now.last year 8 of us went there on a cycling trip.they really looked after us. Great people", "link": "facebook.com/groups/1373361046396315/permalink/2198398393892572/", "likes": 1, "comments": [{"username": "John Sampson", "comment_text": "Last year I went over with 5 colleagues. We got really cheap flights. Because we took our bikes I didn't rent a car I arranged a private pick up.\nWe rented in my usual place. It was cool .cycled every day .morning ,afternoon, came back showered,chille\nd out .we arranged a couple of great food nights .amazing time.\nThe roads out there are perfect for cycling and motorbiking. One village just leads to another.went over to Pietrapertosa for the \" volo del angelo\" zip line ..only N hour away .really great time ."}]}, {"id": "2198397737225971", "text": "Hi\nLooking hotel in Bari or monopoli\nAny recommendations\nwould be appreciated", "link": "facebook.com/groups/1373361046396315/permalink/2198397737225971/", "likes": 0, "comments": [{"username": "Joanna Adamczak", "comment_text": "Following"}, {"username": "Lisa Acri", "comment_text": "Followings"}]}, {"id": "2198398563892555", "text": "Discovering Tuscany 🍇 Perfect place for romantic weekedn ❤️ Great place with fantastic wine, delicious food, breathtaking views all around. On site you can try local olive oil, wine, have a picnic on top of the hill, great pool 🤭", "link": "facebook.com/groups/1373361046396315/permalink/2198398563892555/", "likes": 40, "comments": [{"username": "Michael Rudder", "comment_text": "Kate Rudder"}, {"username": "Natasha Welage", "comment_text": "Looks wonderful! What’s the name of this place?"}, {"username": "Lisa Pinder", "comment_text": "Was the pool warm?"}]}, {"id": "2198401753892236", "text": "We booked train tickets through Trainline app from Florence to Sienna. Three questions, how do we get from airport to Santa Maria Novella station and how do we know which train to get on? Our ticket just says time and destination so I’m assuming we don’t have assigned seats? Thx!", "link": "facebook.com/groups/1373361046396315/permalink/2198401753892236/", "likes": 1, "comments": [{"username": "Cheryl Theunissen", "comment_text": "Santa Maria is the main station in Florence. Take a train from airport to Florence Station and there you will change to a train for Sienna. Your ticket will definitely have a train number- you will check on the board, according to your routing and time, which platform to go to. The train number will appear there too. Sometimes the trains come up on the board less than half an hour before departure- keep an eye on the boards, or ask staff."}, {"username": "Vasthi Cheddar", "comment_text": "The tickets will have a train number Find that on the departure board. (2nd column from left) They post the platform about 10-15 minutes prior to departure. (Second to last column on the right)."}, {"username": "Jojo Hanna", "comment_text": "How do you catch a train where you live ?"}]}, {"id": "2198404073892004", "text": "Hi, trying to book some accommodation for Rome end of August and I'm going round in circles! Any recommendations please?? 🙏", "link": "facebook.com/groups/1373361046396315/permalink/2198404073892004/", "likes": 0, "comments": []}, {"id": "2198402940558784", "text": "Any advise or tips on best way to deal with the heat wave? We're headed to Italy AUG 5th - 17th, trying to figure out best way to prepare....thanks", "link": "facebook.com/groups/1373361046396315/permalink/2198402940558784/", "likes": 8, "comments": [{"username": "Caterina Liquori-Culhane", "comment_text": "I just left. Start early in the morning to your excursions. Most streets are narrow offering some shade. Carry a water bottle every where. When I went to pompei I put a wet hankerchief around my neck. Have a hat!"}, {"username": "Maureen Rebello Hagerty", "comment_text": "After doing that once I said never again. Spring or fall for me now"}, {"username": "Rachael Richardson", "comment_text": "Nothing can physically prepare you for the heat here at present - just bring refillable water bottles, umbrella/hand held fan, hats loose clothing and plenty of deodorant! Try not to book any tours between 11-3 go early or late"}, {"username": "Haider Ali", "comment_text": "Next fan!"}, {"username": "Krystal Apolinaro", "comment_text": "We just got back on Sat. It was hot, I’m not going to minimize that. We did skip some stuff, like we did the colosseum tour but skipped the forum and palatine hill. We did stuff as early or later in the day if possible and tried too nap at the hotel during the day when possible. I definitely had to adjust for the heat."}, {"username": "Angela Gilmore", "comment_text": "We are all hoping that August will be a little cooler. In the north of Italy at the moment I believe temperatures have dropped a little. If you are lucky your holiday won't be affected by the heat wave, or at least it won't be as hot as July"}, {"username": "Virgz Van Møøre", "comment_text": "Where in Italy ? The heat wave never lasts for weeks"}, {"username": "Brad Nelsen", "comment_text": "Rest inside between 1pm - 6pm."}, {"username": "Irene Oda", "comment_text": "Take Pepto Bismal chewable- summer diarrhea is a thing."}, {"username": "Becky Menacho", "comment_text": "Do mornings and nights and take shelter mid day lol"}, {"username": "Delly Tracy", "comment_text": "Linen long clothing, stay hydrated, sun block, stay out of the miday heat if you can go to museums, go to McDs they havr aircon hats ,umbrellas"}, {"username": "John Green", "comment_text": "We always have wet wipes to cool off quickly and often. We have been using all the tips given. It’s hot. Be prepared to do things but in a different order than originally planned. Take breaks. Also rehydrate with water and electrolytes. Otherwise you’ll get dizzy. You can get gatorade or something else. Just something to replace the salt your sweating"}, {"username": "Linda Miller", "comment_text": "I'm thinking you'd prepare much like you would at home when it's that hot! 😉"}, {"username": "Stefania Varano", "comment_text": "I am currently in southern Italy and see that the weather will improve over the next few days already. I do agree though that it is best to stay in an air conditioned area in the early afternoon until about 5-6 pm. It is extremely hot during that period and not pleasant to be outdoors."}, {"username": "Nancy Fricke Corsi", "comment_text": "Bring bug spray from US. Last year in August folks were miserable. The Italian products do not work as well"}, {"username": "Anthony Martini Jr.", "comment_text": "Drink plenty of water. There's nowhere to hide when it's 110°"}, {"username": "Tricia Brittingham Neff", "comment_text": "It doesn’t look too bad. The high in Como on the 2nd is only 73!!!"}, {"username": "Shelley Bowen Glassman", "comment_text": "I got cooling clothes from Amazon. They do help, you need to keep getting them wet, but worth it. I’m here in Italy now."}, {"username": "Dave Colleen", "comment_text": "We booked hotels with pools. Toured 7am til about 2 then hung at the pool til 6. Showered and ventured back out for the eve."}, {"username": "Joe Guzzi", "comment_text": "Heat wave ended last Thursday, at least here in the north."}, {"username": "Johnny J. Turpin", "comment_text": "Cool towels and Gatorade. Can get it in powdered mix."}, {"username": "Paul Davis", "comment_text": "Gab Katya Sandler: maybe to late for you but was recently in the Alps. Mid 70s while people were cooking in Rome, Florence, etc. Also some of the most breathtaking scenery in Italy."}, {"username": "Jerry Kiger", "comment_text": "I plan July or Aug … any benefit to either time next year if one better than the other?"}, {"username": "Donette Earl Fox", "comment_text": "Lots of wine cellars and stay at Agriturismo’s with pools…also Lemoncello Spritzers!"}, {"username": "Rema Cardo", "comment_text": "🙄😫🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣\ndo you know any weather magic tricks??? It’s Summer AUGUST hot everywhere .. Omg so silly but thanks for the laugh 👍👍"}, {"username": "Tari Lawson", "comment_text": "We were there this week. Walk in the shade as much as possible, drink plenty of water, take breaks, visit museums and churches, where a wide brim hat."}, {"username": "Beth Andrews", "comment_text": "A wet washer on the back of the neck does wonders."}, {"username": "Larry M Murray", "comment_text": "Wear light clothing, especially linen. Keep out of the sun between 10 and 2."}, {"username": "Laurie Nugent Harvey", "comment_text": "I would bring a small rechargeable fan. The hotels can be very warm and when you have been out in the heat all day, you will appreciate a cool room."}, {"username": "Linda Love Vines", "comment_text": "The mini rechargeable fans were life savers in Rome two weeks ago! Also, we brought collapsible water bottles and filled them with cold water from the fountains. Linen clothing!"}, {"username": "Cugina Jax", "comment_text": "Buy neck fans off Amazon."}, {"username": "Gena Diaco Penland", "comment_text": "We froze half full water bottles over night so we had cold water during the day. There are fountains around, but they aren’t always very cold."}, {"username": "Lucia Ursaki", "comment_text": "Portable fans, freeze your water and also Gatorade to replenish electrolytes. I don’t think I’ve ever sweat so much in my life as I have here these last 2 weeks. Loose, flowy clothing…. Linen is great."}, {"username": "Allan Olexa", "comment_text": "Turn off your AC here to acclimate to higher temperatures. Go out walking now to prepare for the walking in hot weather."}, {"username": "Phyllis Snyder", "comment_text": "Get up early and go- then rest- go out at night. Lots of water to keep hydrated."}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "I bought cooling towels on Amazon. They work great! Spent 4 hours walking around Pompeii ruins yesterday. Very tolerable with that on my neck."}, {"username": "Diana Sankara", "comment_text": "Start your day early, have lunch somewhere nice and cool. Use central hours to visit some place with AC, get back to your place for a short nap then get ready for dinner. Avoid wine during the day, stay hydrated, cover your head whenever in the sun, dress comfortable in linen or cotton."}, {"username": "Kathy Flood", "comment_text": "Next fan!"}, {"username": "Jerry Lyubelsky", "comment_text": "Linen clothing, personal fan possibly with mister, hats, sunglasses, sunscreen(sport\nsunscreen isn’t oily or runny), go/book any sightseeing early, back in hotel from 3-7, the. Go back out for dinner and night time sightseeing. We survived 7/4-15"}]}, {"id": "2198404467225298", "text": "Need advice from those with teens on how they keep them and the PEACE By making sure phones worked on vacation without breaking the bank. We have Verizon in the states and iPhones.\n\nTHANK YOU IN ADVANCE", "link": "facebook.com/groups/1373361046396315/permalink/2198404467225298/", "likes": 2, "comments": [{"username": "Jessica LaRose Cappuccia", "comment_text": "Following"}, {"username": "Alla Pechersky", "comment_text": "Get DIGI sim card, available from TIM or other stores. We bought the physical SIM that has 20 GB plus local calling for 15 euro"}, {"username": "Giovanni Pianigiani", "comment_text": "Can't you just get a local SIM? Depending on the plan, you'll typically get unlimited data for less than 20€ per month"}, {"username": "Lisa Ferreira Morris", "comment_text": "When I was in Portugal last summer I bought a portable mifi device from Vodafone. $50 euros and include 15 days of data"}, {"username": "Alexandra A Welker", "comment_text": "A mobile hotspot/\nwireless portable wifi is the best way to go and most practical. Check with your carrier, they should offer it, Amazon sells them too and you just buy the data. Or get an international plan then the kids can connect by turning on the hotspot from your phone."}, {"username": "Ryan Monahan", "comment_text": "If they need data only, and have recent phone models, use the app Airalo. You won’t find a lower cost way to get them\nData. If they need phoning and texting then get a local sim. We paid €25 each for 70gb, texting and calls when we were there earlier this month. Got them at Rome airport"}, {"username": "Jerry Kiger", "comment_text": "Following"}, {"username": "Dayna Steinberg Cioffi", "comment_text": "My husband and I had the international plans for $100 a month. Teens were fine with wifi in the hotel. We were always busy and on the run and it gave us their attention as well :)"}, {"username": "Dayna Steinberg Cioffi", "comment_text": "You are also dealing with a time difference so that kind of worked in our favor too"}, {"username": "Sarah Lybarger", "comment_text": "."}, {"username": "Laureen Garrido Jimenez", "comment_text": "$10/day Verizon"}, {"username": "Karen Schmidt", "comment_text": "Airalo is great!!"}, {"username": "Harris Dee", "comment_text": "We’re here 3 weeks … Verizon month plan $100….do the $10 a day if u wish … $50 SIM cards work too"}, {"username": "Dollene Christopher", "comment_text": "I had just switched from Verizon to spectrum before my family’s trip to Europe last year… there were 5 of us on one plan- and the price for data was very reasonable! It varied slightly by country- but our 12 day stay cost me an additional $80 that month …. And all of us were using google maps, apps to maneuver public transit, social media- like Snapchat- and other online resources, like google translate. Call your service provider, they’ll walk you through what you need to do. I believe Verizon charges a daily fee for data ."}, {"username": "Jaime Cleek", "comment_text": "I’d make them just use it when you’re under Wi-Fi. Turn it on airplane roams and turn off data roaming."}, {"username": "Lisa Kelly", "comment_text": "We paid $100/per line and paid too much money but I think it was worth it."}, {"username": "Jenny Clough", "comment_text": "My husband got the Verizon 10$ day international plan. He can use the Google maps and look up restaurant reviews and train times.\nMy phone is in airplane mode non stop. I connect to wifi on trains. At the hotel and at 1 restaurants. There is no time to be on social media. I just take all of the photos! Only your main lead traveller needs international access."}, {"username": "Rabun Wiley Neves", "comment_text": "We have Verizon at home. We used esim cards from airarlo while traveling earlier this summer. Can’t make actual calls or texts, but you can through WhatsApp at no additional charge. Worked great for us."}, {"username": "Marsico Tina P", "comment_text": "Once you arrive go to vodaphone and buy a new sim. Unlimited everything for quite cheap !!!"}, {"username": "Jenn Messina Babore", "comment_text": "Airalo"}]}, {"id": "2198406603891751", "text": "Hello everybody!\nI’m going to Italy in September for 4 nights in Assisi and 4 nights in Siena.\nStarted searching for winery tours with lunch and there are soooo many options that I would like to have some indications before booking.\nThank you so much in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2198406603891751/", "likes": 0, "comments": [{"username": "Colleen Carollo Oxsalida", "comment_text": "We did a cooking class (really just pasta making) and wine tasting at Tenuta Torciano and it was fabulous! It says they are 20 minutes from Siena and accessible by train."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2198411520557926", "text": "Would we be crazy to do a day trip to Pisa from just outside Verona?? Have a car and would leave around 8am. Google maps is saying it would take just under 3 hours to drive. Where would we park? Any idea on toll prices? Kids just want to see the tower.", "link": "facebook.com/groups/1373361046396315/permalink/2198411520557926/", "likes": 12, "comments": [{"username": "Bill Palizzolo", "comment_text": "Pisa is not worth it. Worst tourist trap in Italy. Everywhere else we went in Italy was great."}, {"username": "Stefano Follador", "comment_text": "Sincerely Pisa is just the leaning tower and that’s it more or less. From Verona you can spend your day in menu more ways.\nYou can do a round trip around Garda lake, visit dolomites or some wine area: Treviso is a really nice city for example and you have valdobbiadene unesco area just half an out away from it.\nI mean if your dream it’s to go to Pisa go ahead, but it doesn’t make sense to me"}, {"username": "Felicia LoCascio Whitney", "comment_text": "Honestly there are more beautiful sites than Pisa. It was my least favorite part of my trip. Getting through the guantlet of people selling items on the sides of the street was overwhelming and unwelcomed. And I mean literally laid out on the pavement on the side of the roads leading into Pisa. Put this on your back burner and go when you're staying closer to the area."}, {"username": "Renae Larcus", "comment_text": "Not worth the drive in my opinion. Use the time to go to Lake Garda or even Venice. You can park the car near the train station. Or better yet, just do the train from Verona to Venice and spend your time there."}, {"username": "Frances McDonagh", "comment_text": "Go to Bologna that has a more leaning tower than Pisa"}, {"username": "Daniele Morani", "comment_text": "Not crazy at all, Pisa is a really small town and one day there would be perfect."}, {"username": "Lucy Lestingi", "comment_text": "Lol actually I’m staying in Florence. Yesterday my son and I took the train to Lucca and decided to take a train to Pisa before heading back to Florence. I have to say I’m glad we did. We were there about 7ish not insanely crowded. Found a nice place to eat before we took the train back to Florence. I don’t know if I’d drive 3 hours to get there but I’m glad we made the mini detour"}, {"username": "Rachael Richardson", "comment_text": "You only need half a day there so go for it !"}, {"username": "Karen Schmidt", "comment_text": "Pisa (especially the tower) is NOT worth that amount of effort. Save your precious day for something else, and do something closer to you."}, {"username": "Reina Pike", "comment_text": "We just drive to Pisa and parking was easy and very close to the tower. If the kids want to do it — go for it!"}, {"username": "Giovanni Pianigiani", "comment_text": "Toll is 22€ each way - here for the toll calculator https://\nwww.autostrade.i\nt/it/\ntraffico-in-real\n-time.\nI would personally consider the trip insane but it's really an individual choice: in the 6 hours minimum for the return trip (consider right now Google maps is saying 5 hours due to congestion) I'd look for something else closer to Verona but indeed if you have the leaning tower as one of things not to be missed just go for it!👍"}, {"username": "Vasthi Cheddar", "comment_text": "You just need a few hours in Pisa. We took the train from Florence around 5 pm and were back to Florence a little earlier than midnight and that included as much sightseeing as we wanted to do and a wonderful dinner."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Not worth it, no way!! Take them to a beach instead."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "If you are interested I wrote a post here about Pisa so the day is worth it and not just an useless photo to a leaning tower (search in the group with the lens). Actually Pisa is really nice only if you don’t visit it like a sheep tourist who look on google maps for the faster way to the leaning tower!"}, {"username": "Patricia Betty Graham", "comment_text": "Train?"}, {"username": "Josephine Rauch Rotunda", "comment_text": "To me going to Italy, and not seeing the leaning tower is like going to Paris and not seeing the Eiffel tower. They are kids, I say go for it you won’t regret it. True, the only thing to see is the leaning tower’ JMHO… I insisted my family should see it when we were in the area and I don’t regret it to this day. Every time I look at the pictures of my grand kids holding up the tower."}, {"username": "Theodore Meyer", "comment_text": "Don’t waste your time driving to Pisa. Instead drive to Lago di Garda or Vicenza or Padova. Much more to see than the Piazza di Miracoli? JMO."}, {"username": "Francesca Malte", "comment_text": "If it’s something you really want to see go for it! Only thing is if it’s in august good luck! Parking , tourist, heat, etc 😳"}, {"username": "Jennifer Larese Taylor", "comment_text": "If it’s something you want to do as a family go for it."}, {"username": "Sue Gelardi", "comment_text": "Not worth a 3 hour drive IMO."}, {"username": "Janet Messanelli Bozzone", "comment_text": "So many other places to go that would be better than Pisa. If you are itching to drive how about Bologna and Parma?"}, {"username": "Christi Craddock Taylor", "comment_text": "We loved going to Pisa. We walked around the town and had the best gelato! We got tickets and walked to the top. If you go and want to walk up to the top of the tower. Get your tickets first so you know what time to get in line. I loved looking around and seeing every nationality taking the same picture with the tower. Very touristy thing to do but it was a great time. You could maybe be there 2 or 3 hours. Then find another place. We drove to Lucca. Another great town!"}, {"username": "Frank Hunt", "comment_text": "You would be crazy not to do Verona from just outside Verona. 😏 Kidding Verona is lovely but if you went by rail from Verona Station to Pisa you would really enjoy the walk from station to the leaning tower and Church. Nice architecture, city wall, shops etc, most don’t see Pisa."}, {"username": "Lee Anne Ashurst", "comment_text": "The leaning tower was not much to see"}, {"username": "Danielle Gervais", "comment_text": "Lucca is very nice. Pisa look at the tower and the church next to it, est a pizza looking at it, and that’s it"}, {"username": "Diane King", "comment_text": "I find Pisa underwhelming. If I was in Verona I would do Lake Garda, Dolomites or Venice!! Bologna is superb too!!"}, {"username": "Janis Nunez", "comment_text": "Stop in Lucca and then a quick stop at Pisa. Yes, it’s the only thing there, but it’s beautiful. And if you are going to Lucca it’s close and then just head back."}]}, {"id": "2198414557224289", "text": "Thank you admin for allowing me to join this group. We are looking at planning a 3 week trip in September/ October and the amount of tips etc on this group is amazing!!", "link": "facebook.com/groups/1373361046396315/permalink/2198414557224289/", "likes": 1, "comments": []}, {"id": "2198415207224224", "text": "Warning - I bough a necklace for my daughter in Florence and it broke into pieces. I couldn’t believe it. I honestly don’t remember the name of the store, but my credit card and tax form says Old Bridgeआणखी Gallery… I’m sure some of their pieces are fine, but costume jewelry holds up better than this. This was a necklace and we bought it a week ago. She was wearing it and it broke in the pool.", "link": "facebook.com/groups/1373361046396315/permalink/2198415207224224/", "likes": 46, "comments": [{"username": "Shelly Coutu", "comment_text": "Call your credit card company. I bet they will dispute the charge & reverse your payment. It may take a few weeks to process. But, with this pic; you def have a legit case. Best of Luck 🤞"}, {"username": "Angela Gilmore", "comment_text": "You are not in Florence any more I guess.\nSorry to hear this, but it was supposed to be....gold?"}, {"username": "Gale Tower", "comment_text": "Wanted to get an Italian gold chain when visiting, now I’m not sure! 🤔"}, {"username": "Franca Eleftheriades", "comment_text": "Is it supposed to be real gold?"}, {"username": "Elizabeth Florio Campanella", "comment_text": "dispute it"}, {"username": "Merrilee Daniels-Des", "comment_text": "Oh I would definitely dispute that with your credit card company. That’s just horrible!"}, {"username": "Cinzia Bonciani", "comment_text": "That’s bizarre ! It broke into all those tiny pieces? Are you sure she didn’t snag it on something? How on earth did you get all those pieces from the pool?"}, {"username": "Valerie Prindiville Zito", "comment_text": "Is it gold?"}, {"username": "Gina Van Antwerp", "comment_text": "I would have it tested locally to see if it was really gold. So bizzarre."}, {"username": "Alisa Flores", "comment_text": "I’ve ran a jewelry store for 20 years and unfortunately this can happen, especially with chlorine. Chemicals can make the gold brittle where it falls apart, especially if the chain wasn’t solid. It looks like it was probably semi-hollow and if it was lightweight this can happen. Still call your credit company or the store because you’re well in warranty but just wanted to say from a jeweler it does happen."}, {"username": "Grace Scinto", "comment_text": "How did it snap\ninto so many little pieces?"}, {"username": "Gail Linville Ellis Fuhrman", "comment_text": "I bought a leather belt in Florence that came apart before I got home. My husband super glued it back together, but it was not cheap. Jewelry leather ect, thank is not cheap. Just be aware of what you are buying"}, {"username": "Maria LoSurdo", "comment_text": "Must be fake gold! 😱🥲"}, {"username": "Светла Русева", "comment_text": "It’s due to the chlorine"}, {"username": "Enzo Teutonico", "comment_text": "Where the loops are welded was eaten away by the chlorine probably"}, {"username": "Mary Velasquez", "comment_text": "It's not very good quality to start with but, also I never wear jewelry in a pool for fear of what the chlorine might do to it."}, {"username": "Marie Cuzzi", "comment_text": "That’s sad"}, {"username": "Magdalena Tidswell", "comment_text": "Its not gold. I have work my gold necklace for 5 years and never removed it. Has never broken or been damaged. In pool, in spa, ocean or anywhere. Sorry u got tricked looks like it"}, {"username": "Kathy Mcgehee", "comment_text": "I have one like that I got 30 years ago and still wear it everyday."}, {"username": "Gregory Adolfo Rosario Angeles", "comment_text": "I prefer to buy jewelry in my country PERÚ, is much better material in GOLD and SILVER."}, {"username": "Brenda Posey Simon", "comment_text": "“It's not just chlorine that can damage your gold jewellery and diamonds; saltwater can damage them too. Salt causes erosion of soldered gold, silver or platinum elements. As a result, the precious metal may weaken meaning your jewellery could potentially break. The diamonds can also get blemished by salt.”"}, {"username": "Peach Panfili", "comment_text": "Just the name of the shop should have been enough of a red flag. There are numerous shops close by the train station in Milan where necklaces just like that can be had for as little as 5 euros."}, {"username": "Sandra Kent", "comment_text": "I don’t think it was gold I wear mine everyday and when I go swimming in the pool"}]}, {"id": "2198416153890796", "text": "A Sunday morning in Rome (today) 💕", "link": "facebook.com/groups/1373361046396315/permalink/2198416153890796/", "likes": 28, "comments": [{"username": "Miraz Ahamed", "comment_text": "Miraz Ahamed"}, {"username": "Alicja Krampa-Chrabąszczewicz", "comment_text": "Ooooo...skończy\nli remonty, w maju jeszcze nie można było przejechać...👍"}, {"username": "Suom Sopheak", "comment_text": "❤️❤️❤️❤️"}]}, {"id": "2198421923890219", "text": "Does anyone have details about breakfast at Aroma? Looks like they start serving at 7:30am and couldn’t tell imom the website if they do reservations for breakfast or not.", "link": "facebook.com/groups/1373361046396315/permalink/2198421923890219/", "likes": 0, "comments": []}, {"id": "2198434670555611", "text": "Hello new in this group and for a week mow been reading almost all the posts here and you guys are so helpful. We are arriving via cruise ar Civitavecchia and we are planning to go to Rome and Bellagio in Lake Como then flying out of Milan. We are Looking for suggestions for trains or renting a car from Civitavecchia if you are me which optionsआणखी would you go first timer here. Also in Rome do you guys have a kist of website where we can pre purchase all tour tickets (Vatican, Colosseum, etc?) would be nice if an admin of this group could create a doc for recommendations like trains, tour tickets, etc all in one place. Any help is greatly appreciated please and thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2198434670555611/", "likes": 4, "comments": [{"username": "Allison Campbell", "comment_text": "We just got back from 5 weeks in Paris and Italy. We downloaded the Get Your Guide app and we booked all our stuff through there . It saves your tickets etc. Everything in one place ."}, {"username": "Rachael Richardson", "comment_text": "Trenitalia for trains\nTiquets, get your guide or viator for tours or direct through the sites own website is sometimes cheaper - but choose skip the line !"}, {"username": "Paul Anderson", "comment_text": "Before you leave the old city “civilavecchia”\nvisit the Etruscan necropolis. It has some of the most amazing Etruscan tombs in Italy."}, {"username": "Louise Wilson", "comment_text": "I suggest you don't try to drive or park in the center of Rome, only insiders know where you can legally drive, like taxis. It is best to arrange a taxi or private car from the ship, or take the train into the city. From Rome, fly to Milan, spend a few days there to see the important sights, then take the train the l hr. train ride to Lake Como - get off at Varenna, where you can take the ferry around the lake for sightseeing. See the great video on Rick Steves website \"Milan to Lake Como\" for details on hotels, etc. Get tour tickets in Rome by going to the websites for the Vatican, etc."}, {"username": "Paul Davis", "comment_text": "Trains will likely be less expensive."}]}, {"id": "2198437093888702", "text": "Hi there. I would love to purchase a gold Roman coin pendant, but have no idea where a reliable jeweler may be located in Rome. Any thoughts?", "link": "facebook.com/groups/1373361046396315/permalink/2198437093888702/", "likes": 0, "comments": []}, {"id": "2198441490554929", "text": "Help! My luggage has been lost since Monday and I can’t get the Venice Airport or Ryanair to tell me what airport my bag is even at. Is there any hope at this point? I’ve called both and just keep getting the runaround 😞", "link": "facebook.com/groups/1373361046396315/permalink/2198441490554929/", "likes": 27, "comments": [{"username": "Carla Casci Principato", "comment_text": "They'll find it eventually, just make sure to submit all your receipts for your new clothes, shoes, suitcase, toiletries etc. Do not allow them to tell you they'll only give you $150. AND, make sure they know your next hotel/ destination. We had told them we were leaving Florence on a Tuesday after our bag was lost the prior Friday. Since we were renting our car at the airport, I figured I'd check again and after they talked to eo, one went to the truck in the back and came out with my bag! They had found it, didn't tell me and they were going to deliver it to the airbnb we had already checked out of. Good luck!"}, {"username": "Carla Jane", "comment_text": "Darren Bonaccorso, AirTags!"}, {"username": "Maggie Anderson", "comment_text": "Don't travel without air tags"}, {"username": "Cynthia McDonald", "comment_text": "Happened to us years ago. All I can say is to still enjoy the trip-buy underwear and a couple shirts. They kept saying our luggage was found so much of the trip was waiting for the luggage. Just give in. Sorry it happened."}, {"username": "Thomas John Fredrick", "comment_text": "This juts happened to my family! We flew Houston to Amsterdam, layover, Amsterdam to Venice. Of the 8 people we traveled with 6 bags were lost. 3 airtags showed the bags were in Venice the next day so my dad literally went back to the airport and had an airport worker take him to the “lane of the lost luggage” and he found the bags himself. 2 days later 2 more bags arrived and they actually delivered them to our hotel in Venice (KLM airlines). The last bag stayed in Amsterdam for 5 days, arrived in Venice, stayed there 4 days, went to Paris where it never got delivered to our future hotel, and then went back to Venice. We ended up getting it this week, via currier from Houston airport, 3 weeks to the day we lost it 🙈. Thankful it was not lost forever but unfortunate it never arrived with all of my husbands things and our extra toiletries. KLM said they would give up to 500.00 if you saved receipts and filed a claim. We will see if that happens. So sorry this happened to you.\n\nThey told us It’s tough to check bags there right now as it is so so busy and they have limited staff to return the luggage once it is found."}, {"username": "Kamala Moodley", "comment_text": "Turkish Airline lost my luggage whilst traveling from New York to Turkey and then to Cape Town . I made several enquiries, gave up and almost a month later one Sunday evening I get a call asking for my address as they here to deliver my bag ....with everything intact....I was rather surprised and impressed too ...here's hoping this will end positively for you as well 🙏"}, {"username": "Maria Ariano", "comment_text": "I only had this problem once, and it was on a connecting flight from Atlanta to Charlotte. I have traveled in 4 continents."}, {"username": "Janis Nunez", "comment_text": "Italy! I also love Hawaii, but things happen everywhere. If you use common sense then you will be fine. We are here now and it’s been wonderful. I’ve never felt unsafe."}, {"username": "Becky Nelson", "comment_text": "Last summer, I was made to check my carryon bag in Milan. They lost my bag and I still had 20 days and 4 countries left to visit. Since they were short on baggage handlers, they couldn’t tell me if or when I would get my bag back. They had me fill out a lost bag form and gave me a website to keep checking. After 10 days, my claim disappeared so I had no idea what would happen 39 days after they lost it, my bag showed up outside my garage door in Iowa. No email or notifications. It had a FedEx tag on it that showed it had went to Germany, Newark NJ, and back to Germany before finding its way to Chicago and then home. What a mess!"}, {"username": "Mike Guluk", "comment_text": "Right now we have 4 AirTags working, 2 in storage at hotel in Italy 1 in room at hotel and one in Florida on my wife’s key chain\nThey work great I knew they were on plane with me and my arrival in Italy"}, {"username": "Todd Hines", "comment_text": "Airtags provide ZERO recourse....FIL\nE A CLAIM now with the last carrier on your flight.\n\nI waited until the end of our 2 week trip to file for luggage that they promised to deliver and never did. Air France denied coverage because we filed at 14 days."}, {"username": "Dawn Lanette McKinley", "comment_text": "When my bags got lost when I landed in Germany, United Airlines located it and brought it to me two days later. I would think Ryanair would have the same kind of service. I now travel with only a carry-on. Also, if your lost bags caused you to miss another flight, a tour, a hotel stay, ￼etc., you can put in a claim to the airlines and they should reimburse you."}, {"username": "Rachelle Ethington", "comment_text": "Go enjoy your vacation, and buy what you need. Save your receipts, and try to not let this consume you."}, {"username": "Nadia Filice", "comment_text": "Do you have air tags?"}, {"username": "Elyse Lichtman-Scheiner", "comment_text": "When checking luggage, I always take a carry on with at least 2/3 days of clothing and toiletries. If disaster strikes, you’ll at least have something…. Also my husband and I pack both of our stuff in both suitcases incase 1 does not arrive."}, {"username": "Debbie Morton", "comment_text": "Do you not have AirTags?"}, {"username": "Miranda Cifelli", "comment_text": "Mine was left behind in Paris but got it back the next day. Going forward I’m going to take a back pack and a very small luggage"}, {"username": "Keri Smith Estes", "comment_text": "Go to the airline’s website and put in your tracking number on your checked luggage tag. It should tell you where the bag was last scanned. Good luck!"}, {"username": "Susi Menazza", "comment_text": "In case you are not aware, European laws provide more protection than US ones. Make sure to file the report https://\neuropa.eu/\nyoureurope/\ncitizens/travel/\npassenger-rights\n/air/\nindex_en.htm"}, {"username": "Rodger Cravens", "comment_text": "Same happened to me, I just had to wait it out..."}, {"username": "Shelly Seifert Lettieri", "comment_text": "Air tags always"}, {"username": "Kim Butler Oam", "comment_text": "Apple AirTags for tracking is the best way to go, in Australia I could only find them at Harvey Norman. I have a few, you can get other brands I guess but I have apple ones, one in my van, one for my handbag and 2 for my luggage while traveling, you can check that your luggage is actually on the plane with you.\nHope you get it back soon. 🤞"}, {"username": "Elaine Catino Tsangarides", "comment_text": "My luggage was lost for the entire 3 week trip in Italy ( never made it past the Atlanta connection). It was in July and I quickly learned how little you need in the summer! Bought a few outfits and got reimbursed later. Don’t let it ruin your vacation!!!!"}, {"username": "Jenny Frank", "comment_text": "Go shopping"}, {"username": "Susan Cantafio", "comment_text": "Always put tracking tags in you checked luggage and carry on"}, {"username": "Susan Cantafio", "comment_text": "I have mine lost going to Montreal and took 3 days to find i away pack a few things in my husband s bag and in a carry on so I have clothes now with the air tracking tags at least I know where my bag is"}, {"username": "Alicia Dombrowski", "comment_text": "I’d call the airline and speak with them about it. They should be able to help more than the airport. This is why I never check bags anymore and only do carry-ons. You can pack a lot in carry-ons if you have the right luggage and watch videos and learn how to only use carry-ons. Travel compression bags are great! Best of luck!"}, {"username": "Teresa Heran", "comment_text": "I feel for you. Ours was left behind at JFK by British Airways. We had AirTags so we knew before we even landed. Went to customer service immediately to make the claim. Got a reference number and told we’d have it ASAP. We would check on status and be told one thing, check our AirTag and see another story. Finally, 5 days later, when it finally showed up in Naples, we were in Ischia and BA would not deliver to us as promised when we filled out the claim and report. Cost us €150 to send a courier to retrieve for us. Am still waiting for reimbursement of our expenses.\nGood luck and enjoy some new clothes (within Airline reason of course)"}, {"username": "Peter Guzman", "comment_text": "Had a North face duffel bag lost from London to San Francisco, it returned by courier about 2 weeks, they delivered it with all my clothes and goods intact, nothing missing"}, {"username": "MaryAnne Forgione Damiano", "comment_text": "Best to do is use carry on only"}, {"username": "Friedemann Diederichs", "comment_text": "Ryanair sucks. Keep calling.\nNever check bags! Carry on only with these cheapo airlines!"}, {"username": "Angie Formica", "comment_text": "Follow them on FB, Instagram and Twitter. Keep tagging them asking them where your luggage is. After 4 days of tagging them I got my bags back. Ryanair"}, {"username": "Paul Fielding", "comment_text": "AirTags!"}, {"username": "Lester Esterhuizen", "comment_text": "Once my sister in laws luggage 🧳 got lost between Greece 🇬🇷 and Germany 🇩🇪 flying Luftansa.It took about 4 days and they contacted her for a delivery address.She got her luggage 🧳 back.So stay positive 👍.Once also going to New York our friends luggage also never arrived and he also got it back later in that week"}, {"username": "Ashley Cavero", "comment_text": "I just had this issue with JFK to FCO. I didn’t have a transfer but kept getting the run around. We just showed up at the airport today to ask again in person bc everything was via email and nobody responds and just blames each other. They let us check the storage room and sure enough my bag was there but online still said searching for the bag."}, {"username": "Lisa Rognetta", "comment_text": "What is the best air tag alternative for Samsung users?"}, {"username": "Tatiana Dorf", "comment_text": "Ashley Cavero Your lost bag… Was it a carry on? I’m flying Delta and last time I travelled international they made me check my carry at no cost because the cabin was full. I’m terrified of getting it lost 😞 Traveling in 3 weeks"}, {"username": "Egle Barlup", "comment_text": "Rayanair customer service is the worst🥺"}, {"username": "Patrizia Barnes-Fasnaugh Charping", "comment_text": "Did you use Apple AirTags?"}, {"username": "Annette Eadie", "comment_text": "Great opportunity to go clothes shopping!"}, {"username": "Mark Anne Linenbroker", "comment_text": "Get a air tag or tile next time so you can tell them where the luggage is!!!! Hope you get it back!"}, {"username": "Grace Waddell", "comment_text": "Depending on where your staying… we lost everything one year and the concierge took care of everything… had it all there in 2 days somehow. Got us things to make do for the in between … he was awesome."}, {"username": "Rose Stolarek", "comment_text": "Been to Italy many many times, walked the streets in Rome, Venice Florence and Genoa late at night and early morning and never had an issue at all. We have been lucky I guess with never had any luggage go missing . Enjoy Italy beautiful country with beautiful people.."}, {"username": "Rana Umair", "comment_text": "Who in their right mind travels with Ryanair?"}, {"username": "Gi Grogan", "comment_text": "Doesn't help now but I've always put trackers in my luggage. I have air tags in them"}, {"username": "Arianna Reel Cook", "comment_text": "Mine got lost last year for 6 weeks. It took a trip to London, Amsterdam, Florence and then back to Amsterdam.\nIt was stressful but I went shopping, got new clothes and learned how not travel with a check in and survive with 2 dresses, 2 tops, yoga pants and washing my undies in the sink lol\n\nSending a St Anthony prayer for you luggage to find you 🥰"}, {"username": "Sandra Todd Coffey", "comment_text": "Kathy Morra Kuloy 😳🤬🙄"}, {"username": "Maria Petrozzi", "comment_text": "Every where luggage get lost .\nDon’t go if you feel so frightened.\nItaly is beautiful if you go relax and enjoy ☕️🥐🇮🇹"}, {"username": "Martine Huguet-Latour", "comment_text": "Carry on is the best way to travel!"}, {"username": "Elizabeth Grafel", "comment_text": "Yes! My luggage showed up at my destination within two days!"}, {"username": "Roxanne Domes Wilkinson", "comment_text": "Call your travel agent. That’s their job and they can get through to people easily with their connections."}, {"username": "Sarah Emily", "comment_text": "This happened to me on my honeymoon 10 years ago in Naples. The folks at the hotel kept telling me the airport had it, but when I would call the airline, they denied it being there. After 6 days, I went to the airport and demanded they look for it. Ten minutes later, it appeared. I’m sorry for this headache. I did buy all new clothes that were reimbursed by the airline but it wasn’t fun. Thankfully, we are headed back in September to celebrate 10 years and I bought an AirTag this time!"}, {"username": "Peggy Murray", "comment_text": "Carry on which is tough but best option - AirTags tell you that your luggage isn’t with you!!"}, {"username": "Jo Graham", "comment_text": "100% airtags is the way to go. Helps with any anxiety as well. We just had 5 internal USA flights and 4 international and I was relaxed knowing our bags made it to our plane"}, {"username": "David Sardella", "comment_text": "Go shopping buy what you need , enjoy your vacation"}, {"username": "Kim de Blecourt", "comment_text": "We chose Hawaii. And used carry-ons only. But I did make it to the Amalfi Coast in February. Carry-on is the way to go."}, {"username": "Stephanie Nick Nikolaou", "comment_text": "Where were you coming from ? And which airport did you arrive at ? We lost ours and we had to drive back to the Rome airport and retrieve them !!! They will not be if any help in forwarding them to you. Sorry but worse experience ever . I cried a lot !!"}, {"username": "Tim Rowe", "comment_text": "ive started to put Apple Air Tags in my luggage"}, {"username": "Joanne Fish", "comment_text": "How does this work? You tell them where your lost luggage is and then who gets it for you?"}, {"username": "Debbie Plante", "comment_text": "I’m so sorry to hear that but now I’m definitely going to get an air tag for my trip to Italy in October.\nI hope you get your soon 🤞🏻"}, {"username": "Phyllis Snyder", "comment_text": "Do you have travel insurance that covers luggage? If call them asp! Then go buy minimally what you need to go on with your trip."}, {"username": "Nicolette Shagena", "comment_text": "Why is this so common"}, {"username": "Crystal Waltz", "comment_text": "At Marco Polo, my daughter's suitcase was on the carousel but mine was not. We waited until there was no more luggage there. They sent me to a lost luggage desk. My daughter went looking for mine while I was waiting in line and for some weird reason it got put in the unclaimed luggage room and she happened to see it there as my suitcase is very unique so she called me and I was able to get it."}, {"username": "Debbie Potter", "comment_text": "I'm seeing more and more horror stories like this and other situations like luggage being stolen by thieves in Italy and pickpocketing. I'm starting to wonder if I should even plan a trip to Italy or just plan a trip to Hawaii."}, {"username": "Linda Yahn", "comment_text": "Got mine after 8 days going through Ontario and Dublin. Lost for 3 months on way back. Oddly, Aer Lingus site sti says it’s looking for my luggage after the hotel on Ontario had it for 3 months. Aer Lingus won’t answer a call or return one or an email. Will never fly either. Ontario was a madhouse."}, {"username": "James Carr", "comment_text": "Yikes. This reminds me, what is the best place to go shopping in Rome if we find ourselves without luggage?"}, {"username": "Paula Brink", "comment_text": "My son’s luggage still sitting somewhere at Florence airport- he arrived there June 23 and left Italy June 29. He has been back home since July 2- no luggage, lots of back and forth with emails saying it was sent back to him and then, oh no, it wasn’t, it’s still in Florence. 🙄"}, {"username": "Robert Keys", "comment_text": "My wife and I are going middle of Sept. we have our AirTags for suitcases and backpacks and we will split our clothes. Thanks for the information."}, {"username": "Jerry Kiger", "comment_text": "Sure stressful hopefully can buy couple days outfits and enjoy the vacation, while they track down your stuff …"}, {"username": "Yvonne Ormson", "comment_text": "Claim on your travel insurance."}, {"username": "Laura Weir", "comment_text": "So very sorry. Would be good to invest in apple air tags for next trip. Good luck!"}, {"username": "Jeanette Colon", "comment_text": "Italy is not Hawaii, not even comparable. Been to both. I did carry on only and on my trip back to the states from Italy I bought extra goodies and then did check in luggage. Plenty of places where you drop off your laundry then pick up a few hours later and very reasonable so you can pack less. Go to Italy it’s safe there is nothing like it. CARRYON only so you don’t have to spend your vacation thinking of luggage"}, {"username": "Pam Ewouds", "comment_text": "Get on their FB page and let it rip. They don’t like negative FB posts!"}, {"username": "Jay Cabrera", "comment_text": "My luggage was lost for a few days. Got it on my 4th day in Italy. Really wish I had a couple outfits in my backpack. Will not change my mind about going to Italy."}, {"username": "Karyn Potter Gualtieri", "comment_text": "Air tags!"}, {"username": "Tony Palombino", "comment_text": "I was scammed from my airbnb in Rome!"}, {"username": "Kathy Johnson Schaefer", "comment_text": "British Airways lost our luggage. You get no one to answer when you call the airport."}, {"username": "Carol Fisher Castagna", "comment_text": "You can track your bag on the Worldtracer system with your file number.\nRyanair should have this on their website under Baggage Delay. Are you calling the baggage number? Ensure you update your file with accurate details: temporary address + date you are there til. Permanent address.\nEmail, mobile."}, {"username": "Ann Brown-Lynch", "comment_text": "Won’t travel without air tags for this very reason. Best of luck!"}, {"username": "Bianca Balderas-Saenz", "comment_text": "Xavi Saenz carry on only"}, {"username": "Alicia Cox", "comment_text": "Also, you pretty much have to retrieve it yourself as all the airports (including US) are under staffed & people are traveling more since they did not for 2 years."}, {"username": "Karen Williams", "comment_text": "From now on- use a gps luggage device like AirTag."}, {"username": "Benita Hauskins", "comment_text": "🍎 Apple Air Tags 🍎"}, {"username": "John Wilson", "comment_text": "Ryanair isn’t known for customer service. Try asking them publicly on social media ( fb, twitter)"}, {"username": "Lisa Verlinger Guarino", "comment_text": "Air tags"}, {"username": "Sandra Keyser", "comment_text": "I have been to Italy 4 times and have never had a bag lost; however ; this last trip my jewelry case was stolen.\nBritish Airways! They have Fantastic aircrew, but I can not say the same for the thief on the ground crew, who nabbed by black leather jewelry case! I reported it and have heard NOTHING!"}, {"username": "Susan Buck", "comment_text": "Buy new clothes now - and next trip pack only carryons. Hopefully your insurance will cover your losses, and all your new Italian clothes! Have fun shopping!"}, {"username": "Karen Espinoza", "comment_text": "So sorry\nI am so fortunate i have never experienced that.\n😞\nThat happens to Airlines all over the world. Especially during such a busy time right now.\nHope you got the insurance, good luck 🍀"}, {"username": "Francesca Malte", "comment_text": "Ryan air is the worst! I suggest you go to a near by tourist information office and ask them to ck for Ryan air admin number or hub and ask if they can try to call for you! You never know"}, {"username": "Bea Kuckens", "comment_text": "Two words: Apple AirTags"}, {"username": "Kathy Flood", "comment_text": "Go shopping for new clothes and enjoy your vacation. Hopefully your bag will find you at some point"}, {"username": "Marcus Tepper", "comment_text": "Did you have a layover? Wondering if I have concern for lost luggage if we take a direct flight"}, {"username": "Rhona OConnor", "comment_text": "Get on to Customer service on Twitter. That often gets a response."}, {"username": "Tess Galinato Perez", "comment_text": "Some credit cards (i.e. Chase Sapphire) will cover daily purchases of essential items for delayed or lost luggage. Keep all your receipts and documentation."}, {"username": "Carol Taylor", "comment_text": "Mine got lost when I went to Ireland from the US. It never left Orlando! I was traveling with 3 others and they all got theirs. Buy what you need and keep receipts. I got reimbursed. I got my luggage the day before my return flight home! Now I always split my clothes between mine and my husband's luggage so we each have some if one doesn't make it."}, {"username": "Dave Conroy", "comment_text": "Am sorry and I'm sure you'll get it back at some unknown point. One reason I only take carry on. Doesn't help, but airline services are so poor these days you choose to take cargo hold cases you're also choosing to open up to a world of pain through loss, delays, hauling around."}, {"username": "Katja Girinovitch", "comment_text": "Check if you have an insurance. Most probably you do from your credit card or something."}, {"username": "Eden Seery Thornton", "comment_text": "Buy what you need, save your receipts and try to enjoy your vacation. Don’t waste precious time abroad trying to locate that luggage. So sorry BTW!"}, {"username": "Bob Cinquini", "comment_text": "No, all hope is lost.\nMy advice to you is to go to the nearest bar and start drinking heavily!"}, {"username": "Linda Snaring", "comment_text": "My daughter had an AirTag in her suitcase. When it finally got to the Venice airport (6 days later) she could see it was there. She called many times and they told her it was not. Luckily she was still in the area so she went to the airport after talking to many people. She finally got someone to listen to her. She showed the person where her luggage was at the airport. He got keys to the room and there was hundreds of pieces of lost luggage in this room and there was her suitcase. I could not imagine finding a suitcase without air tag."}, {"username": "Frances Scannapieco", "comment_text": "I am sorry this happened to you. It happened to me once too. This is why I split my clothes between the checked luggage and a carry on."}, {"username": "Karoline Bakker", "comment_text": "React (angry) at their social media and let them know you are going to sue them for everything and all your lost holidays ! In the meanwhile you are entitled to buy essentiels for your daily needs. I got € 300 for the first 2 days"}]}, {"id": "2198442200554858", "text": "Hello Everyone. Going to Italy for a 3rd time this November and it’s our 1st time visiting Venice. Question about water taxi to the airport….we have an 8:30 flight coming home and we are staying at an Airbnb right near Rialto Bridge. We need to get picked up between 5-5:30am. Any advice? I know it has to take 30-40 minutes to get to the airport from the center of Venice. Thanks for your advice!", "link": "facebook.com/groups/1373361046396315/permalink/2198442200554858/", "likes": 0, "comments": [{"username": "Gena Diaco Penland", "comment_text": "I believe you can book a private water taxi for about 130€. As we were waiting for the public one, a couple hopped on the private one they booked! I’m not sure how to do that though."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Two choices, private water taxi or Alilaguna."}, {"username": "Melissa Jane Brown", "comment_text": "We pre booked and paid for a private water taxi for pick up at 5.15am. Company was quick to reply to my questions & driver actually arrived a little early. They do charge a little extra for an early morning pick up, though."}, {"username": "Karen Johnson", "comment_text": "We just recently did this. Our tour director booked service for us. They arrived promptly and had us to the airport on time. Was costly (€150) and had to pay cash but worth it as alleviates any stress."}]}, {"id": "2198452973887114", "text": "Hello. This has been such a helpful group. We are flying into Rome in September and would love comments about how to travel from Rome airport to Sorrento. Rent a car or get a private driver or take a train? Any info on the three would be greatly appreciated!", "link": "facebook.com/groups/1373361046396315/permalink/2198452973887114/", "likes": 1, "comments": [{"username": "Alex Kovacs", "comment_text": "Most people will probably say train from Rome to Naples then private driver from there. After doing this recently though, if I was flying in and then immediately going to Sorrento I’d opt for a private driver the whole way if cost isn’t an issue just cause you’ll be exhausted when you land and it’ll be convenient 🤷🏽‍♀️ though the train is very easy, but that’s just what I would do personally! If you’re staying in Rome for a couple of days first, I would just take train to Naples."}, {"username": "Gina Spyker Fairfield", "comment_text": "We took the train from Rome to Naples. Business class seats give you more space to keep luggage nearby, and a porter comes through with a beverage/snack cart (included with your ticket). Then we had a private driver from Naples to Sorrento, with a stop in Pompeii for a few hours. He kept our luggage in the car and stayed with it while we had a guided tour. We used Autoservizi De Martino and were very happy with their service."}, {"username": "Billie Begley", "comment_text": "We took the train fromRome to Naples. Business class as well. It’s not that long of a ride. Driver was there to pick us up. Worked great. We were a group of 7 seniors."}, {"username": "निनावी सहभागी", "comment_text": "Can anyone recommend a private driver from Rome Airport to Sorrento and if so some idea of price? Thank you"}, {"username": "Renae Larcus", "comment_text": "Train from Rome to Naples and local train from Naples to Sorrento is what we did"}, {"username": "Roland Trego", "comment_text": "It's a 3.5 hour drive, so a private driver would certainly not be cheap. I would personally opt for a high-speed train from Rome to Naples, but you'd first have to take a train into Rome. From Naples to Sorrento, you have several options.\nhttps://\nwww.sorrentovibe\ns.com/\ngetting-from-nap\nles-to-sorrento\n-best-route-202\n3/"}, {"username": "Patti Farrell", "comment_text": "I took the train"}, {"username": "Frank Hunt", "comment_text": "Train"}]}, {"id": "2198444770554601", "text": "Bonjourno any tips on what to see in Naples in self ?", "link": "facebook.com/groups/1373361046396315/permalink/2198444770554601/", "likes": 3, "comments": [{"username": "Virgz Van Møøre", "comment_text": "Naples : Capodimonte and San Elmo, Via Toledo, Duomo, Chiostro Di Santa Chiara, Lungomare, Castel dell'Ovo, Teatro San Carlo, Palazzo Reale, Piazza del Plebiscito, Monte della Misericordia, Capella San Severo. Taste gelato at Gay Odin, pizza portafoglio, pizza frita, fiori di zucca fritti, sfogliatella. Train to Pompei. Ferry to Ischia, Procida, Capri.\n\nCostiera amalfitana : Sorrento as a base. Go to : Positano, Amalfi, Ravello. The roads are usually busy, better with the ferry. Hike on the path of Gods. You can also take the ferry to visit the islands from there."}, {"username": "Andre Seiler", "comment_text": "Pizza 🍕 Pizza 🍕\nActually a trip to Cassertas the old Royal Residence is definitely worth a trip"}, {"username": "Ettore de Vita", "comment_text": "Castell dell’ovo\nSan Severo monastery ,\nSpaccanapoli , Via Toledo, teatro San Carlo, palazzo reale piazza pebliscito, via Caracciolo, quartiere riviera chiaia, Vomero district, castel Sant’Elmo, Certosa Museo di San Martino, museo nazionale train 🚂"}, {"username": "Светла Русева", "comment_text": "National Archeological museum"}, {"username": "Maria Y Alexieva", "comment_text": "Eat, as much as you can. Then board the ferry to Capri ⛵"}, {"username": "Lisa Sie Mamola", "comment_text": "Pizza and I went to Pompeii by train for a day… Shopping and food are cheap in Naples…."}, {"username": "Chris Franklin", "comment_text": "There was a wonderful little place where they make Limoncello, alongside another store where they hand carve intricate cameos.(like the necklaces). It was very interesting. The Limoncello Cream was absolutely delicious!"}, {"username": "Alice Francesca", "comment_text": "It s still written BUONGIORNO, anyway;)\nWe Italians don't write HELOO when we arrive in the Us.;)"}, {"username": "Glenn Todd Webb", "comment_text": "San Martino (up the funicular), duomo, next door to duomo is a church with a Caravaggio, archaeological museum, veiled Christ, catacombs, any church you pass. Casertes palace north of the city"}, {"username": "Tami Whittlesey", "comment_text": "I loved the Palazzo Reale and the gardens. Walking the Lungomare Caracciolo at sunset was beautiful."}, {"username": "Ursula Kenny", "comment_text": "If you like football.\nHow about a Naples game in the Maradona stadium 🏟"}, {"username": "Peach Panfili", "comment_text": "The Cristo Velato."}, {"username": "Victor Segovia Jr.", "comment_text": "Maradona murals."}]}, {"id": "2198451570553921", "text": "Hi does anybody know about the tolls from Milan bergamo airport to Limone sul Garda? How much and if you can prepay online or is it when you get there? I’ve looked up online but nothing within the last 8years has been posted. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2198451570553921/", "likes": 0, "comments": [{"username": "Kristina Ruk", "comment_text": "You go and take tickets and when go out pay on a machine ;) can pay cash or credit card"}]}, {"id": "2198437090555369", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2198437090555369/", "likes": 4, "comments": []}, {"id": "2198357297230015", "text": "Hello, planning our honeymoon for Sept 2024 we aim to fly into Rome and spend 10 days in Italy, feedback on the below would be amazing! We love food, wine and scenery! 🍷🏞\nFly London to Rome - 3 nights\nDrive Rome to Florence - 4 nights - inc day trip to Tuscany, Cinque Terre. Would it be better to split and spend 2 nights in Tuscany? Is Cinque Terre… आणखी worth the hype, I have seen alot of mixed reviews within this group.\nDrive Florence to Dolomites - 3 nights - Day 1 - visit Tre Cime di Laveredo and Cadini peaks, Day 2 - Lago di Braies, Santa Magdalena, Lago di Carezza, Day 3 - Alpe di siusi - recommendations on the best areas to stay for Day 1 and Day 2?\nAfter the Dolomites we would drive to Switzerland.", "link": "facebook.com/groups/1373361046396315/permalink/2198357297230015/", "likes": 5, "comments": [{"username": "Sue Kreger", "comment_text": "So much to see in Tuscany, split and spend 2 days there and in my opinion, Cinque Terre is definitely worth it, please walk between two towns, the views, the vineyards, I tend to hear people catch trains and don’t do at least one walk, they are missing out. Vernazza to Manarola was awesome. Great time of year to go, not hot!"}, {"username": "Alice Francesca", "comment_text": "If you go to Tuscany, stick around Siena and the Val d'Orcia.It s the real Tuscan landscapes: vineyards on the hills, cypress, quaint villages.\nTry Chiostro di Pienza in Pienza (former convent of the 1500's with Italian garden and pool) and Bagno Vignoni (natural spa waters at Posta Marcucci hotel) plus Montalcino etc"}, {"username": "Jenn Messina Babore", "comment_text": "I would take a train rather than drive."}, {"username": "Ilonka Sinkeldam", "comment_text": "Day 2 in the Dolomites is impossible if you want to see something. It is quite a long drive from lago di Braies to lago di Carezza. You can not drive fast in tje mountains. Stay the first 2 days in the Dolomites in Bruneck ans then go close to alpe di siusi, for instans Seis, or Castelrotto. You won’ regret going to the Dolomites."}, {"username": "Rhonda Hope", "comment_text": "Tuscany is worth spending time in it’s stunning"}, {"username": "Izzie MacDonald", "comment_text": "We stayed Vernazza..aweso\nme!!"}, {"username": "Alice Francesca", "comment_text": "https://\nwww.facebook.com\n/\n100064499387685/\nposts/\n651322080361099/"}, {"username": "Ryan Monahan", "comment_text": "We just did similar trip. Flew into Rome, stayed 2 nights, 2 nights in Lucca, 3 nights Cinque Terres, 3 nights rural Tuscany, 1 night Florence, 3 nights Sirmione (Lake Garda) then 2 nights Venice. Loved every spot, especially Lucca and Sirmione. Feel free to reach out with any questions."}, {"username": "Colleen Carollo Oxsalida", "comment_text": "Definitely split Florence/\nTuscany/CT. Make sure to get to CT earlier in the day so you have time to go to a town or two that day, and then hit the others the next day. It totally depends what kind of vacation you want – – we wanted something more laid-back, so spent less time in Florence (even though there is a ton to see there.). Personally ￼ I would do one night in Florence, 2 nights in Tuscany, 1 night in CT."}, {"username": "Veronica Parravicini", "comment_text": "Hi, I think you are underestimating\nthe distances😅\nCinque terre are amazing especially in off season like September. But it’s not worth it as a day trip in my opinion as the journey to/from Tuscany can be long (3h each leg) and then you’ll need extra time to go from one terra from another.\nThe trip from Florence to dolomites takes more than 5 hours, and then you’ll need 1-2 hours a day to visits all the places you’ve mentioned.\nI think it depends on what you want to do and if you don’t mind spending a lot of your time driving😅"}, {"username": "Sarah Lybarger", "comment_text": "Shelby Britton"}, {"username": "Molly Elizabeth", "comment_text": "Don't do a day trip to Cinque Terre. If you can, stay there for a night or two. The towns completely transform after 5PM when all the day trippers and cruise ship peeps leave....and it's truly amazing."}, {"username": "Miyuki Kanno Paul", "comment_text": "Pick up your rental car as you LEAVE Firenze"}, {"username": "Jody Patterson Padgett", "comment_text": "A car is more trouble than it’s worth in Florence, absolutely not needed"}]}, {"id": "2198366297229115", "text": "Hoping someone can help\nWe are at Bellagio now and looking at some 18ct gold crosses\nThe prices seem cheap for what I was expecting\nWould it be possible they aren’t real?\nSurely not??\nIt’s a shop on the lake front🤷‍♀️\nThey are anywhere from between 200 and 300 euro though\n\nAlso they have murano mosaic stuff which also seems cheap\nI wondered if these items are infact cheap and getting them from actual Venice /murano they would be cheaper again\n\nThoughts???", "link": "facebook.com/groups/1373361046396315/permalink/2198366297229115/", "likes": 37, "comments": [{"username": "Carol Scime-Raiford", "comment_text": "Gold is about $2000 per ounce. Ask if it is solid gold, gold platted, gold dipped, or silver and then platted."}, {"username": "Sanjeeta Ahmed", "comment_text": "18 ct gold prices per gm are around 42/45 euros.\nCheck weight and calculate accordingly… and definitely look for the hallmark and authenticity certification"}, {"username": "Diana Morgan", "comment_text": "Check for the stamp on it, the jewellery shops on the front are all legit, there's Rose Maria, lovely shop, then another one a couple of shops up from her and then along towards the car ferry is a bigger shop that sells lovely jewellery along with antique china and vases etc."}, {"username": "Joe-Linda Po Agustin", "comment_text": "When we were in a Murano shop, we were warned that many of the” Murano” goods are actually made in China. If you’re headed to Venice, buy in Murano itself."}, {"username": "Rose Stolarek", "comment_text": "Careful of Murano as some comes from China\nBuy in Murano itself"}, {"username": "Bonnie Loftspring", "comment_text": "I found an 18k necklace I loved in the N.Lake area, & I’m sorry I let it go. If you love it, get it! Yes, you want to be sure it is the quality they are stating, but after that, how much cheaper can you get it should not be the final decision, your love of it should. When I went to Venice, everything was more $$"}, {"username": "Izzie MacDonald", "comment_text": "Love Bellagio.."}, {"username": "Janet Messanelli Bozzone", "comment_text": "Always pay with a credit card. This way if you find out it was not authentic you can always dispute the charge. Amex is the best for this if it’s accepted at the shop."}, {"username": "Monica Grieger", "comment_text": "I decided against it considering they got annoyed with me and took the magnifier that she gave me away haha\nThanks everyone"}, {"username": "Maria Aucello", "comment_text": "Too cheap to be gold. Gold is very expensive, especially 18k."}, {"username": "Mary Ann Mills", "comment_text": "It might be 18 ct but it could be hollow. I bought a 14 ct gold bracelet and it broke within 2 months bc it was hollow."}, {"username": "Peach Panfili", "comment_text": "The price of gold is currently about1,750 euros a gram."}, {"username": "Michele Lentz", "comment_text": "We were just there. I don’t think it is fine jewelry. They sent me to another shop for solid gold."}, {"username": "Lauren Smigielski", "comment_text": "Just visited Murano and the glass blowing museum and was told by one of the incredible salesman/\nemployees that 99.9% of all of the items sold in the Venice shops that are advertised as being from Murano are not real and imported from allover- when you buy from the gallery in Murano you’re given a certificate of authenticity along with free shipping & a warranty! Hope this helps 😊"}, {"username": "Maria Gatto", "comment_text": "I think that’s expensive for a cross."}, {"username": "Jan Buess", "comment_text": "I was hoping to purchase a Mary pendant, don't need the necklace, what would you expect to pay? I'm going to Firenze and Positano"}, {"username": "Roula Abaci", "comment_text": "If it’s 18k gold there should be a stamp of the number 750 if it’s 14k which you will most likely not see in Italy it should say 585. If you see 925 on the stamp then it’s silver. These numbers represent the percentage of alloy to the actual medal. So 18k is 75% gold and 25% various types of alloy"}, {"username": "Gail Karnofsky Morris", "comment_text": "Is this the woman? I bought a ring from her for my granddaughter and it turned her finger green. Not 14k as I was assured."}, {"username": "Christine Broussard", "comment_text": "Sounds gold coated only"}, {"username": "Martha Heller", "comment_text": "Certainly not any place that I would buy \"good\" jewelry!! And, the only place that I would buy Murano would be in Murano from a studio!!"}, {"username": "Anne Contini", "comment_text": "If in doubt, which you are, don't buy!"}, {"username": "Thomas Engfer", "comment_text": "!!! Genuine Murano glass is always marked with the \"Verti Di Murano\" certificate of authenticity."}, {"username": "Eva Salas", "comment_text": "I didn’t find Murano cheap. But if you’re asking about a glass dish for 20 euros maybe that’s cheaper than $80."}, {"username": "Bill Elias", "comment_text": "Beware of fake crap from China."}, {"username": "Michael Widjaja", "comment_text": "The 24k gold price is around 62ish usd,if it’s too good to be true,chances are it’s not real\n\nAs a jeweler I’ve seen many fake souvenir “jewellery”,som\netimes the gold content is less than 25%,sometimes the stones are stuffed with tissue paper to make it look bigger,sometime\ns they use base metal shank inside the ring to reduce the gold usage…"}, {"username": "Ann Mechling", "comment_text": "I got a small vase from Murano but it was painted on color (sort of a stained glass look) that eventually flaked off. Make sure the color is from inside the glass."}, {"username": "Jason A Kinser", "comment_text": "Gold is at 2000 US dollars per Troy ounce on the global market currently."}, {"username": "Judie Mc Adam", "comment_text": "If you like it buy it when I was there last year I saw a beautiful little cross kept looking at it every time I passed by one of the glass cabinets on the wall I left it too long and some one else bought it lesson learned going again for three weeks to Bellagio in September for the wine festival And on to Venice for 2 weeks so hopefully I can shop in both places"}, {"username": "Robert Castelli", "comment_text": "Ask them…also, they would be stamp he’d in the back 18K."}, {"username": "Diane Leesmith", "comment_text": "Whilst I appreciate quality and authenticity matter, at end of the day do you like it? Are you happy with the price? It’s still a souvenir bought in Italy."}, {"username": "Denise Russo-Silverman", "comment_text": "I was just in BELLAGIO and was on the water promenade in a very nice jewelry store. It was a pretty big store, but I can’t remember the name of it and it did look legitimate. Make sure it’s not silver plated and dipped it should be solid gold ask them that at least."}, {"username": "Wayne Moschetti", "comment_text": "Monica, ask the jeweler for authenticity ! If they can’t provide it then don’t buy 👎"}, {"username": "MaryBeth Kennedy Owen", "comment_text": "Honestly, if was my understanding that authentic Murano glass has a very specific label indicating that it was handmade. I think it’s a white rectangle"}, {"username": "Ellen Edmonds-Wilson", "comment_text": "At the current price per ounce of gold I would be asking the jeweller the weight of the cross and I imagine you'll find it is gold plated rather than solid gold at that price."}, {"username": "Sergio Milone", "comment_text": "Is it a proper jewellers or a souvenir shop? Check for the 750 stamp on it."}, {"username": "Jaime Cleek", "comment_text": "In regards to gold that doesn’t seem cheap to me. But I don’t wear gold"}, {"username": "Jennifer Larese Taylor", "comment_text": "According to European law, all gold has to be hallmarked. Look for the hallmarks- 750 for 18ct"}, {"username": "Diana Sankara", "comment_text": "In Italy, gold is always marked. A 18 ct object must have 750 engraved somewhere, otherwise it's either coated or fake."}]}, {"id": "2198367170562361", "text": "Wow-the pictures on here are just stunning. I’ve just recently joined this group as I’ve never been to Italy but am harbouring a longing to plan a three week trip- probably April 2025.\nHowever, I’m gluten free and dairy free. I’d love it someone could let me know what the restaurants are like in terms of catering for this?", "link": "facebook.com/groups/1373361046396315/permalink/2198367170562361/", "likes": 0, "comments": [{"username": "Liz Anne", "comment_text": "In Florence now. Came from Rome yesterday. In my experience the menus in most restaurants have codes listed for all the different food allergies, etc. Even on a vineyard tour they gave options. Very accomodating!"}, {"username": "Alice Francesca", "comment_text": "In Italy it s mandatory for every menu to have listed ingredients for people with allergies."}, {"username": "Bambi Harris", "comment_text": "There is a facebook page called Gluten Free Italy. There are plenty of options literally everywhere when you get there. We were there 13 years ago never had an issue finding something gluten free to eat and we will go again this year 🙂 they list their allergens"}, {"username": "Kit Nader", "comment_text": "Pick an area\n... type your requests into the net and I don't doubt sites like tripadvisor will come up with 100s of reviews for food intolerance restaurants"}, {"username": "Ville Lignell", "comment_text": "Gluten intollerance is also an Italian health issue and there are many options, at least in major cities, just check recommendations\non social media or Google."}, {"username": "Cecilia Christine Costantini", "comment_text": "It depends if you are allergic to gluten or intolerant. Some dishes are gluten free (e.g. some friend food), but the allergene might show up in the menu due to cross contamination. You will alm ostonly find dairy free cheeses at vegan restaurants. Dairy free milks almost everywhere. If you go to Rome try Rifugio Romano, it is a vegan restaurant, they have gluten free options, but they do serve traditional Italian recipes, so it is a good compromise if you travel with people who are not intolerant/\nvegan and want to try local food."}, {"username": "Fiona Cohn", "comment_text": "Honestly I found pasta and pizza in Italy no problems!!! I’m convinced their flour is not genetically modified like ours. Had no indigestion or bowel problems"}, {"username": "Colleen Jennings", "comment_text": "Italy is right up there with up to date information on food intolerances. Plenty of gluten free options everywhere. Have fun planning your trip!"}, {"username": "Miyuki Kanno Paul", "comment_text": "Are you a Celiac. intolerant or just avoiding gluten?"}]}, {"id": "2198367943895617", "text": "Hi, we love Italy but have only been as adults, what are recommendations for us with our 8 year old daughter? Sea sun sand is easy to find, but where can we also find children’s activities/fun? Would be summer 24. TIA", "link": "facebook.com/groups/1373361046396315/permalink/2198367943895617/", "likes": 0, "comments": [{"username": "Kristina Ruk", "comment_text": "Near Lake Garda there is Gardaland amusement park. On summer they also have some waterpark activities open"}]}, {"id": "2198385007227244", "text": "What is the best on line tour group to use when booking for the colosseum and Vatican for a trip in September?", "link": "facebook.com/groups/1373361046396315/permalink/2198385007227244/", "likes": 0, "comments": [{"username": "Irina Murphy", "comment_text": "There are sooo many options, depending on how much you want to see in each place. When we were looking we decided what and how much we want to see and then looked who offers what we want"}, {"username": "Jeff McLellan", "comment_text": "I recommend you only Coopculture for Colosseum and Vatican Museums for Vatican. Hard to secure as requires planning and effort but only way to guarantee you get what you book."}, {"username": "Karen Blackmore", "comment_text": "Coop culture website issues tickets 30 days before. So keep an eye on the website, do a practice run! Tricky but I managed to get 5 for the night time tour last September"}]}, {"id": "2198342787231466", "text": "Brescia.Italia.", "link": "facebook.com/groups/1373361046396315/permalink/2198342787231466/", "likes": 3, "comments": []}, {"id": "2198331623899249", "text": "I am in Florence, the city is beautiful. But What are some outstanding places to see here? Any recommendations?", "link": "facebook.com/groups/1373361046396315/permalink/2198331623899249/", "likes": 5, "comments": [{"username": "Cynthia Hernandez", "comment_text": "Cinque Terre"}, {"username": "Pietro Adami", "comment_text": "In town, the Mercato Vecchio at lunchtime !"}, {"username": "Maria Coladangelo Ducca", "comment_text": "Piazza San Lorenzo . It is a hike but you are then looking down at this mediaeval wonderment . There is a restaurant at the piazza. Great gelato as well"}, {"username": "Alice Francesca", "comment_text": "https://\nwww.timeout.com/\nflorence/\nthings-to-do/\nbest-things-to-d\no-in-florence\n\nI would add GIARDINO DI BOBOLI,lovely garden"}, {"username": "Liz Castillo", "comment_text": "Micheal Angelo statue"}, {"username": "Jeff McLellan", "comment_text": "Piazza Michelangelo for sunset is a great spot go early and enjoy the buzz."}, {"username": "Glenn Todd Webb", "comment_text": "David-accademia\nUffizi gallery-birth of Venus\nMedici chapel\nSanta Maria novella\nSanta Croce\nPitti palace and boboli gardens\nPalazzo vecchio\nDuomo, Baptistry"}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "Santa Croce church, climb the Duomo for epic views, David Statue, great eats, fab gelato, wander, sit at a cafe in a piazza."}, {"username": "Kenneth T Williams", "comment_text": "Everywhere"}, {"username": "Cindy Sguazzin", "comment_text": "The Uffizi Gallery!\nThe Accademia Gallery!"}, {"username": "Mary Evans", "comment_text": "Boboli Gardens."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2197780617287683", "text": "Hello all\nWe are travelling to Rome on the 30th for four days and cannot wait. A friend of mine lives there and has done now for a few years, she has very kindly sent me some tips on where to eat / visit etcआणखी with her own recommendations. I’ve attached them on here and I hope they can be of use to anyone who wishes to take a look 👀 👍🏻\n\n*Update - I am so pleased that so many of you have found this guide helpful. I have passed on your thanks to my friend and she is truly overwhelmed at the response this post has gathered. We both hope you all have a wonderful trip - I am on countdown now - 1 week today! ❤️", "link": "facebook.com/groups/1373361046396315/permalink/2197780617287683/", "likes": 844, "comments": [{"username": "Erin Worrell", "comment_text": "Thank you for sharing! We fly into Rome August 5th 😍 this will be such a help 🥰🥰"}, {"username": "Patty Hagye Alcalde", "comment_text": "Wow, this is amazing! Thank you!"}, {"username": "Paula Curro Casey", "comment_text": "Michael Taggart"}, {"username": "Daniel Sahl", "comment_text": "Manny thanks!"}, {"username": "Kerry Littlejohn", "comment_text": "Kerry Littlejohn"}, {"username": "Michelle Cummins", "comment_text": "I was literally about to post a question to the group on recommendations\nfor Rome! Thanks so much 🙏🏻"}, {"username": "Michelle Cummins", "comment_text": "Kim Grace"}, {"username": "Kathy Walker", "comment_text": "Oh my goodness, this is so useful! Thank you! ❤️"}, {"username": "Stephanie K. Cox", "comment_text": "Following!"}, {"username": "Kimberly Podkulski Damhoff", "comment_text": "Thanks!!"}, {"username": "Marci Kuehner", "comment_text": "This is so awesome! Thank you."}, {"username": "Whitney Trick-Hector", "comment_text": "How does she like living there compared to the states ?"}, {"username": "Nic Ní Mhealláin", "comment_text": "Thanks for sharing!"}, {"username": "Jessica Kromer", "comment_text": "Thank you so much for sharing!! Will definitely be putting this to use some day! 😊"}, {"username": "Marisa Gonzalez Eubanks", "comment_text": "Thanks so much!!"}, {"username": "Nancy G Zinck", "comment_text": "Thank you"}, {"username": "Louellen Klints Karthaus", "comment_text": "Thank you!!!"}, {"username": "Sally Weston", "comment_text": "Dean ☝️"}, {"username": "Nancy Willson", "comment_text": "f"}, {"username": "Beth Kolver", "comment_text": "Thank you for sharing 🙏🏻😊"}, {"username": "Judi McFall Crerar", "comment_text": "Thank you!! These are wonderful recommendations\n!"}, {"username": "Cate Klarke", "comment_text": "Rebecca Clarke"}, {"username": "Fiona Cameron", "comment_text": "Thank you!"}, {"username": "Sherif Rashed", "comment_text": "Any outlet near Rome or in Rome itself"}, {"username": "Lauren Overton Call", "comment_text": "Victoria Butler Culbertson"}, {"username": "Tina Tiralongo-Angelone", "comment_text": "🙏🏼"}, {"username": "Cecilia Lopac", "comment_text": "Wow! Thank you!❤️"}, {"username": "Lorraine Hender-Dennert", "comment_text": "Dannielle Blundell\nConor Noone"}, {"username": "Vikki Trigg", "comment_text": "Jason Trigg Kacey Jones"}, {"username": "Rose E. Martinez", "comment_text": "Thanks so very much for sharing. We will be on our way early September and will put your list to good use"}, {"username": "Jo Gleeson", "comment_text": "Thank you for sharing this!"}, {"username": "Chantal Bush", "comment_text": "Wow, that’s amazing! Thank you for sharing 🙏"}, {"username": "Melissa Steyn", "comment_text": "💃🙏🏻🍷"}, {"username": "Jiahui Song", "comment_text": "This is so helpful!!! We will be there in 3 days. Can’t wait!"}, {"username": "Helena Ruth", "comment_text": "Olivia Smyth"}, {"username": "Sharon McGrath", "comment_text": "Great info there, thank you. I would also add Castel Sant'Angelo to the list of places to see."}, {"username": "Tracy Downey", "comment_text": "F"}, {"username": "Barbara Coldren", "comment_text": "Thank you so much. Any tips for Naples?"}, {"username": "George Thurman", "comment_text": "Lots of good hints! Thank you!!"}, {"username": "Alicia Burno", "comment_text": "This is great information for us too. We will be arriving to Rome next week."}, {"username": "Tari Lawson", "comment_text": "I found this gem when in Rome. Highly recommend for lunch."}, {"username": "Sandy Allen", "comment_text": "So nice of you to share!"}, {"username": "Kayong Jojo", "comment_text": "Thank you"}, {"username": "Rachael Richardson", "comment_text": "Down Pio Borgo all the restaurants are good - 5 mins walk from Vatican City"}, {"username": "Suzanne Patrick Bielawski Mackowiak", "comment_text": "Thank you for sharing!"}, {"username": "Tricia O Po", "comment_text": "Thanks so much for sharing!!!!"}, {"username": "Rose E. Martinez", "comment_text": "Thanks so much. We will be in our way early September can’t wait"}, {"username": "Ļena Suhacka", "comment_text": "Thank you for sharing!"}, {"username": "Marion Daku", "comment_text": "Thanks for sharing-this is great"}, {"username": "Kris Scherf Grosman", "comment_text": "This is fantastic! Thank you and your friend👍🏻"}, {"username": "Sharon Theresa", "comment_text": "Thank you!! Great ideas!! Definitely will use them when we go in 2024!!"}, {"username": "Moya Rodgers", "comment_text": "Our trip to Rome in August has just been cancelled by EasyJet But we will be planning another in its place so Thankyou for this"}, {"username": "Jayne Dowding", "comment_text": "Thank you so much. Perfect timing. We have just booked for 4 nights. You have saved me alot of hassle 😍"}, {"username": "Roberto VillaLe", "comment_text": "Excellent, thank you for sharing!!"}, {"username": "Claire Grant", "comment_text": "Karen McWilliam"}, {"username": "Elizabeth Jayne Harris", "comment_text": "Melissa Fass Richard Harris David Harris"}, {"username": "Krissy Myers", "comment_text": "Thanks for the info!! Going in September. Soooooo excited!"}, {"username": "Wendy Moon", "comment_text": "I could also recommend the e bike tour of an evening in Rome, lasts around 4 hours, stopping off for a little food and a glass of wine. Highly recommend . I had not been on s bike for years but absolutely loved it 👌"}, {"username": "John Perrotto", "comment_text": "Gina Perrotto"}, {"username": "Sheron Milliken", "comment_text": "Fantastic! Thank you so much for sharing!"}, {"username": "Monica Hays Reiners", "comment_text": "Great post! So much good information!"}, {"username": "Luz Calzolari", "comment_text": "Thank you for sharing ❤️"}, {"username": "Meredith Carney", "comment_text": "Ian Carney"}, {"username": "Nancy Lembo", "comment_text": "Thank you for sharing! 😊"}, {"username": "Liza Vega Santos", "comment_text": "Thank you for sharing!"}, {"username": "Jenny Ung Hughes", "comment_text": "1"}, {"username": "Nicola Algerino", "comment_text": "I consigli sono veramente ottimi, poi per voi che resterete solo 4 giorni è perfetto. Però Roma è piena di cose da fare ed è anche bello perdersi e scoprire cose nuove! Buona permanenza in Italia ."}, {"username": "Wan Ting", "comment_text": "thanks for sharing!"}, {"username": "Nancy Lynn Glover", "comment_text": "Thank you for sharing!!!"}, {"username": "Carolina Alejandro Clabaugh", "comment_text": "Thank you for sharing!!!"}, {"username": "Yhele Apidga", "comment_text": "Thank you for sharing!!! This is really helpful"}, {"username": "Linda Budden", "comment_text": "Thanks for sharing 🙏🏻"}, {"username": "Mikel Ann Hall", "comment_text": "This is wonderful! Thank you so much for sharing. And thank your friend for compiling this gem! ✨\nI'm heading to Rome in September."}, {"username": "Amanda Williams", "comment_text": "Jody Joseph Kelly Kemble-Manning"}, {"username": "Daisy Yoo", "comment_text": "Rome is more than just the typical spots , the more I do research the more I wish I can stay longer , for example , the galleria colonna is amazing , there are so much more"}, {"username": "Alesha Sparks", "comment_text": "Thank you for sharing, so helpful!"}, {"username": "Rachel Castleberry", "comment_text": "Please thank your friend. This is awesome!"}, {"username": "Heather McIntire", "comment_text": "Thank you! Love this!"}, {"username": "Mikell Afford", "comment_text": "Fantastic will be in Roma in 4 weeks after greece"}, {"username": "Pat Schelling", "comment_text": "Thank you so much….going in November"}, {"username": "Ann-Louise Dooley", "comment_text": "Ann-Louise Dooley"}, {"username": "Helen Kimber", "comment_text": "Shayne Duncan"}, {"username": "BillandAngala Verley", "comment_text": "Linda Williams Dina Garrett Julie Franco Mellow"}, {"username": "Christine Bartfai", "comment_text": "Grazie mille"}, {"username": "Karen Violet", "comment_text": "Thank you for sharing!!! I will be there in 7/31!"}, {"username": "Ronel Gouws", "comment_text": "Rika Greyling ons gaan Oktober"}, {"username": "Ivette Lugo", "comment_text": "Thank you for sharing!"}, {"username": "Lucy Russo", "comment_text": "Thank you! Nothing like tips from a local!"}, {"username": "Harleen Kaur", "comment_text": "This is amazing! Hats off to your friend for putting together all the details! And thank you to you for sharing! 😊🙏🏻"}, {"username": "Laura Polidoro", "comment_text": "Amazing list!"}, {"username": "Bianca Nahir", "comment_text": "Going in the end of August for my birthday! Thank you 😊"}, {"username": "Barbara Hayes", "comment_text": "Thank you for sharing!"}, {"username": "Rawan Hanna", "comment_text": "Rana Yokhanna"}, {"username": "Jim Romaine", "comment_text": "Rayne Romaine Christina Romaine"}, {"username": "Eric Coetzee", "comment_text": "Karin Steenkamp"}, {"username": "Lynette Barbaro", "comment_text": "Thank you so much for sharing. Was watching Stanley Tucci’s show on Italy last night and many of your friend’s suggestions was on the show. Can’t wait for our adventure to Rome in October."}, {"username": "Leesa Martin", "comment_text": "Wow. How fantastic Thank you so much for sharing. 👏😊"}, {"username": "Nancy Curmi", "comment_text": "Thanks so much"}, {"username": "Geetha Rama", "comment_text": "Thanks"}, {"username": "Rebecca Beare-Bath", "comment_text": "Tom Bath"}, {"username": "Lisa Harkins-Sawaya", "comment_text": "Thank you so much for sharing 💕"}, {"username": "Regan Verwey", "comment_text": "Thanks for sharing."}, {"username": "Nichelle Ponce Williams", "comment_text": "Thank you for sharing!!! i will be in Rome for four days before heading on to florence and Venice"}, {"username": "Jo Forssman", "comment_text": "Fiona 👌"}, {"username": "Shannon Horsfall", "comment_text": "This is brilliant! Thank you for sharing."}, {"username": "Nicole Jones Gerbino", "comment_text": "This is so great! Thank you!!"}, {"username": "Linda Pettit Profita", "comment_text": "Very useful info! Thanks for posting."}, {"username": "Andrea Chinnery", "comment_text": "Bonnie Mitchell"}, {"username": "Melissa Valles-Relyea", "comment_text": "Well you’re friend is amazing for putting this together and you’re amazing for sharing! Great tips!"}, {"username": "Michelle Liddelow", "comment_text": "Thanks!!"}, {"username": "Magda Rampal", "comment_text": "Donna Mersin"}, {"username": "Jessica Sneed Olson", "comment_text": "Amazingly helpful!"}, {"username": "Caroline Teague", "comment_text": "Fabulous share, many thanks 👍"}, {"username": "Diana Mondello", "comment_text": "Rosie Petrovski"}, {"username": "Joe Maese", "comment_text": "Thank you for sharing"}, {"username": "Kim Carlton", "comment_text": "Thank you for sharing!"}, {"username": "Audrey Simcoe Cann", "comment_text": "This is so awesome of you to do this. Thank you!"}, {"username": "Lyn Pappas Dahm", "comment_text": "Really great tips"}, {"username": "Debbie Jones Schilling", "comment_text": "Amazing! Thank you."}, {"username": "Cricket Barrazotto", "comment_text": "Thank you!"}]}]