[{"id": "2195381974194214", "text": "Has anyone ever rented a Trullo on Airbnb? And it is worth it?", "link": "facebook.com/groups/1373361046396315/permalink/2195381974194214/", "likes": 0, "comments": [{"username": "Kay Rendall", "comment_text": "Definately a once in a lifetime experience to stay in a trulli house"}]}, {"id": "2195382367527508", "text": "Suggestions needed on the best places to stay in a VRBO in the Tuscany area. Travelling in Sept 2024 and would like a spot that allows for adventures in all directions. Wine tours, scenery, etc", "link": "facebook.com/groups/1373361046396315/permalink/2195382367527508/", "likes": 5, "comments": [{"username": "Charlotte Paul", "comment_text": "Check out The Isabella Experience. Amazing experience and a great location for so many day trips in every direction."}, {"username": "Maureen McCall Bradley", "comment_text": "We booked direct in Florence with Chiara Five Senses. Antonella was amazing! She met us at the property and spent time telling us places to be sure to visit while we were there."}, {"username": "Miyuki Kanno Paul", "comment_text": "Why don’t you consider staying at Agriturismo?"}]}, {"id": "2195383374194074", "text": "Hi everyone, I am wanting hotel accommodation recommendations for Sorrento for 3 nights in September this yr, centrally located to the town square, thanks in Advance 🙂", "link": "facebook.com/groups/1373361046396315/permalink/2195383374194074/", "likes": 8, "comments": [{"username": "Tiffany Hadfield Merrill", "comment_text": "Here now and enjoying our spot!"}, {"username": "Cheryl Kavanagh", "comment_text": "Hi thank you, 🙂"}, {"username": "Tracey Aloi", "comment_text": "We stayed in an apartment on Corso Italia..Casa Scio’ it was beautiful,they stocked us up with drinks,snacks,p\nasta ect"}, {"username": "Frances Scannapieco", "comment_text": "I always stay at Hotel Antiche Mura. Less than 100 feet from town square. Fabulous"}, {"username": "Cheryl Novis", "comment_text": "Hotel plaza great position"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "I recommend checking a booking site to see what is still available."}, {"username": "Janice Rea", "comment_text": "We stayed at Maison Kalea. Reasonable. Near square just up a hill."}, {"username": "Suzanne Sanderson", "comment_text": "Hotel Plaza Sorrento"}, {"username": "Renee Rundle Stoneham", "comment_text": "Hotel Grand Royal.\nNot right in town but east stroll.\nBeautiful ocean front views"}, {"username": "Geoff Roush", "comment_text": "Imperial Hotel Tramontano Sorrento is the best"}, {"username": "Billie Begley", "comment_text": "If you want a nice small boutique hotel. Palazzo Montefusco is amazing. Good prices. Centre of town and made to order breakfast."}, {"username": "Donna Russonello Merlino", "comment_text": "Hotel Plaza Sorrento"}, {"username": "Gina Miano Polizzotto", "comment_text": "Hotel antiche mura"}, {"username": "Donna Mangone", "comment_text": "Our travel agency booked the group at the Hotel Michelangelo a couple of times."}, {"username": "Nancy Fricke Corsi", "comment_text": "Palazzo Jannuzzi Relais. Excellent, had a lift, right in Piazza Tasso"}, {"username": "Valerie Collanton", "comment_text": "Hotel Regina has amazing views. It is in Marina Grande. Short walk from the Centre. It is right across the road from the Bellevue Syrene (which would be my first choice but for the price!)"}, {"username": "Ellie Smythe-Jones", "comment_text": "We stayed in hotel Palazzo Guardati, literally on the square with a lovely pool, excellent views and stunningly friendly staff."}, {"username": "Patti Warren", "comment_text": "Dea Guest House was a perfect location and very quiet."}]}, {"id": "2195387727526972", "text": "I've seen posts about using ATMs to take out money in Italy. Can you use your regular ATM card that you use in the US? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2195387727526972/", "likes": 0, "comments": [{"username": "Jenn Messina Babore", "comment_text": "Yes"}, {"username": "Kay Rendall", "comment_text": "Just make your card doesn't charge international fee. Some banks 4/5% on purchases or ATM fees I have 2 visa debit cards with different banks with no international fees I dont use these cards at home.\nI travelled for 3 mths and the fees were $2000 plus. Plus check the ATM if they accept your card or extra fee. I pay $4 au ATM fee but some can be much higher. Check your bank and advice dates, places of travel, or may be stopped, blocked"}, {"username": "Kay Rendall", "comment_text": "Travelled on a card that charged international transaction fees 1st time.\nNever again"}, {"username": "Miyuki Kanno Paul", "comment_text": "Yes. Make sure that you give your bank and credit card company an upcoming travel notification. You don’t want your cards to be declined due to fraud protection"}]}, {"id": "2195388340860244", "text": "Italy was fantastic, fast paced but just amazing in the countryside and big cities lots do see and do. Just be careful on the Metro/underground in Rone we had our wallet stolen in seconds. Very well worked by around 5 people all pushed getting on the train split us up so my hubby was distracted trying to find me and that’s when they stole his wallet. All over in 10 seconds! Still had a good time but more cautious didn’t use the Metro-again but did catch lots of trains during our trip.hop on hop off bus was well with it in Rome.", "link": "facebook.com/groups/1373361046396315/permalink/2195388340860244/", "likes": 2, "comments": [{"username": "Jenn Messina Babore", "comment_text": "Curious, where was his wallet when it was stolen?"}, {"username": "Pam Kimak", "comment_text": "Just returned..trave\nled trains, walked around Rome most evenings, and never had issues. Ofcourse like anywhere, NYC and metropolitan areas where we live, we kept our wallets in front zipped pockets, and small handbags on a diagonal tight shoulder strap..almost in our armpits."}, {"username": "Ted Kalogeresis", "comment_text": "Italy fast paced? Hardly"}, {"username": "Carol Taylor Tisdale", "comment_text": "We just returned from two large cities: Rome/Paris. I was with two teenagers and although we knew to be aware there were pickpockets, I've got to say that unless you live in a large city and are constantly conscious of the possibility - it's difficult to 'be prepared'. We were cautious about what we carried but were always so busy seeing the sights and navigating our way around - I know we were indeed easy prey. We are just fortunate to not have had an issue. So sorry this happened to you. I wonder if these cuprits are ever caught and punished."}]}, {"id": "2195393570859721", "text": "Planning on doing Italy with our then 2 year old in the end of October. My understanding is Rome and Florence are stroller/toddler friendly, but what about the following places?\n- Venice\n- Pompeii\n- amalfi/positano/storrento\n- lake como\n\nThanks In advance!", "link": "facebook.com/groups/1373361046396315/permalink/2195393570859721/", "likes": 0, "comments": [{"username": "Jenn Messina Babore", "comment_text": "Pompeii will be difficult with a stroller. If they can walk or you can carry them, it will be easier. There are some places a stroller will work. But it is uneven in many places.\n\nVenice is ok in the squares, but again, more of a challenge with a stroller as you will need to lift it every time you go over a bridge.\n\nPositano and Sorrento, there are walking streets that you can easily push a stroller on. There are areas with steps as these are hilly towns on the coast."}, {"username": "Giorgia Petraia", "comment_text": "I don’t think it’s allowed to push a stroller in Pompei, it’s an archeological site and he can’t run nor touch anything"}, {"username": "Cheri Arrowood-Stanziano", "comment_text": "Lots of uneven brick pavers in Rome…maybe consider a child’s back carrier"}, {"username": "Rich Garcia", "comment_text": "How about a small kids wagon. I would try to find one there, then leave it. We saw them at Aldi in Rome."}, {"username": "June Liu", "comment_text": "I just came back from Italy, brought a stroller and hiking carrier, the stroller was hard to use as many of the sites we wanted to see had a lot of stairs, crowded uneven streets with lots of traffic, or don’t allow strollers (Venice, Colloseum, Naples, Capri, Pompeii). We had to fold up the stroller many times on the few days we brought it (Vatican Museum). Highly recommend a carrier, or at least a foldable compact one like the Yoyo."}, {"username": "Bridget Gieseke", "comment_text": "I cannot imagine anything more miserable than pushing a stroller over cobblestones…ma\nybe a carrier? Or maybe leave baby at home?"}, {"username": "Starla Dawn", "comment_text": "Sorrento you could"}, {"username": "Eric Maurer", "comment_text": "The streets in Venice are actually smooth and flat, you just have to get over the bridges."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2195396004192811", "text": "Does anyone know how long the ride by train is from Venice to Rome? Should we bring anything for the ride?", "link": "facebook.com/groups/1373361046396315/permalink/2195396004192811/", "likes": 3, "comments": [{"username": "Rich Garcia", "comment_text": "I believe it was just under 4 hours on the fast train. We took the early morning train, zero transfers. Get business class, it’s worth it. Bought tickets from the Omio app."}, {"username": "Lara Vander Meulen", "comment_text": "We did this last week.. it was 4-4.5 hours. It depends on the stops."}, {"username": "Mary Anne", "comment_text": "It’s about 4 hours. Snack provided in top class. Wi-fi is available on the train. We took extra water."}, {"username": "Jenn Messina Babore", "comment_text": "4 hours - you can bring cards, a book, or your phone."}, {"username": "Joe Guzzi", "comment_text": "Food and wine."}, {"username": "Tania Lediard", "comment_text": "We brought food, water and a bottle of wine."}, {"username": "Rachel Bradfield", "comment_text": "Use the Rome to Rio app, it will give you all the travel I for you need !!"}, {"username": "Eliz Fragoso", "comment_text": "They do sell food on the train and snacks"}]}, {"id": "2195401720858906", "text": "Checking flights Atlanta to Rome for September and quite pricey! Do the prices ever pop down or continue going up the closer you get??", "link": "facebook.com/groups/1373361046396315/permalink/2195401720858906/", "likes": 6, "comments": [{"username": "Mindy Jo", "comment_text": "I bought a package from a travel company. Love traveling with them. Great prices. Ive been to Ireland twice . Once for 1200 for 7 nights with trip insurance, and 1500 for 10 nights with trip insurance. And recently 2075 for 13 nights in italy. Includes round-trip airfare from Billings, Montana (podunk no where), all hotels (which you can choose from many), rental car and all train transfers. Plus breakfast. All hotels are in great central locations too. Plus when I call the company for a question, I get someone on the phone."}, {"username": "Angela Humbles Searcy", "comment_text": "I booked flights from Atlanta to NJ and then from NJ to Rome. It was much cheaper. I booked them in the fall and we left in June. Try looking on a Tuesday. Prices are cheaper on Tuesday and sometimes Monday."}, {"username": "Larry Reinier", "comment_text": "It’s the trend. Money can be replaced memories can’t"}, {"username": "Kristi Pitts Todd", "comment_text": "We booked for Aug back in May from Birmingham to Rome then back from Athens.. paid $1,860 pp RT"}, {"username": "Paula Hornsby Collins", "comment_text": "Yes we need to go from atl to jfk to Rome in sept"}, {"username": "Michael Litzler", "comment_text": "Flying sept 23 out of ATL. Ditto on the prices"}, {"username": "Josephine Enrile", "comment_text": "Please search Incognito” the computer knows your searching for prices so it goes up everytime you search"}, {"username": "Kammey Evans McCord", "comment_text": "We are going in September. Atlanta to Venice was the cheapest option for us and that's a direct flight, no layovers"}, {"username": "Rick Calabro", "comment_text": "Try Cheapoair"}, {"username": "Rosa Valenzuela", "comment_text": "We paid $800 from LAX (for October) of which $200 was for seat selections!!"}, {"username": "Patti Porter", "comment_text": "Hard to say anymore. Travel is still up and airlines are filling flights, as long as they can fill planes at these high prices it’s not likely to drop. But, you never know. You can set up a google flight alert or kayak has a new option to help find cheapest flight. And check airfare out of any other airports you could use"}, {"username": "Lisa Morvant Russo", "comment_text": "I booked in January for Rome in September, prices have really gone up since January."}, {"username": "Kristi Bailey", "comment_text": "I booked in January for my trip to Rome. CVG-JFK-FCO. I kept my Google alerts on for the flight and it's went up almost 2k."}, {"username": "Cheri Arrowood-Stanziano", "comment_text": "Check TAP Air, they have decent fares"}, {"username": "Smush Pappas", "comment_text": "Use a price alert to help u keep eye on price. They fluctuate"}, {"username": "Andrea Shelton", "comment_text": "Flights from Atlanta to Rome in less than two months. The lowest price on the widget right now is on September 5th $925 US and over 30 hours travel time each way."}, {"username": "Kris Beacham", "comment_text": "Not really. They float up and down in the same 3-400 range all year long.\n\nA cheap one will pop up, but it will be 4 stops with a 19 hour layover in Assmanistan. ."}, {"username": "Marisa Brombal D'Emilio", "comment_text": "October to May, I believe, is considered “ low season”. June through to September is “ high season”. Low season is generally less costly for flights."}, {"username": "Lydia Matthews Edwards", "comment_text": "Peoples reading comprehension needs work."}, {"username": "DeeDee Thorburn Heidelman", "comment_text": "Try Skyscanner"}, {"username": "Alice Moy", "comment_text": "Check flying into other cities but it's a little late to find anything cheap. I recently found roundtrip tickets from the Bay Area to Milan for under $800 for next spring"}, {"username": "Tina Million", "comment_text": "We always fly into Paris or Munich and catch Air France or something to Rome. Much cheaper that way we have noticed."}, {"username": "Tami Sue", "comment_text": "You should book at least 4 months a head. Expedia can watch the price for u."}, {"username": "Angela Macias", "comment_text": "Look at New York to Rome and yes the prices do go down."}, {"username": "D Alleyne", "comment_text": "Booked Atlanta to Rome via stopover in London for September with British Airway for $675 pp."}, {"username": "Wayne Matthews", "comment_text": "Alice Matthews"}, {"username": "Jodi White", "comment_text": "Have you tried the app Hopper? They are good at predicting fight prices, what the best time to book is, and whether prices go up or down. They also have a calendar that shows the best rates by date. Good luck!"}, {"username": "Martin Marinov", "comment_text": "Check for summer routes I know Delta seasonal routes direct to Venice and Naples not sure of $$"}, {"username": "Sandra Maldonado", "comment_text": "I fly coach. I find that for a lot of Europe, the airfare is around $1100 plus fees plus seat changes. If you’re willing to go with any airline, any number of stops, you can find tickets for around $800. I do not see a difference in prices from app A to app B. Or the airline site."}, {"username": "Connie Schoch Morello", "comment_text": "Thank you everyone!! We are booked!! Great tips for all!!! ✈️✈️"}, {"username": "Yvonne Donnellan", "comment_text": "They go up in price the closer you get."}, {"username": "Andrea Curry Brown", "comment_text": "Bought mine several months ago. Seems to be going up. Same route same time."}, {"username": "Jennifer Avrett", "comment_text": "Yikes. You're cutting it close. I've been buying my flights 9-10 months out for flying abroad since 2020. They definitely aren't going down."}, {"username": "Misty Christiansen", "comment_text": "Agree. Purchased flights to Italy from Atlanta for September back in February.\nI recently used Expedia price guarantee for our trip to Chicago. I ended up getting a refund of $50 per ticket (x5) because there was a price drop after we purchased. That could be an option ."}, {"username": "Lora Newsom", "comment_text": "Hi"}, {"username": "Ashley LaPrade", "comment_text": "We are also going in September! We decided to fly in and out of Nice France, got round trip tickets for about $800.\n\nI know Rome is quite aways away but the long train rides to get there may be worth it!"}, {"username": "Elena Boetel Sutton", "comment_text": "Yeah. Late winter and early spring this year had the sales. Try signing up for Thrifty Traveler or Going to see if you can catch a sale. They will notify you."}, {"username": "Molly Roberts Siegenthaler", "comment_text": "Try flying Delta ATL to Milan. That’s what we do. And then depart from Rome."}, {"username": "Rachel Michelle", "comment_text": "New York is the cheapest"}, {"username": "Alex Kovacs", "comment_text": "We booked in December for June/July. I was watching it months before then and it kept going up so I just pulled the trigger. I continued watching cause some airlines will give you a credit if the price drops, and they never dropped they just went higher!"}, {"username": "Julie Boyer Orris", "comment_text": "Look at flying out of a different airport than ATL."}, {"username": "Angela Emmitte Tripp", "comment_text": "I booked in February for sept\nWatched prices\nDecided to just do it\nPrices went up\nThey keep going up n down but not less then what I paid"}, {"username": "Julie Romeo Strohl", "comment_text": "I purchased my flights for October 2023 in January 2023 and flight were decent prices"}, {"username": "Ivy J Jackson", "comment_text": "Check the app Skiplagged"}, {"username": "Madeline Caporale", "comment_text": "Usually they continue to go up. Best to book as far out as you can for best prices and seat selections. Not clear, but your are looking at flights for under 12 weeks out. Bear in mind that between weather and air quality from the Canadian wildfires flight changes are possible. Weather delays in Atlanta are frequently an issue in the early fall."}, {"username": "Darcy Hinrichs", "comment_text": "We are going in September, also. We booked our flights at the end of January because we saw that the prices were going up. For the same exact flights, they’re now more than double what we paid."}, {"username": "Angela Emmitte Tripp", "comment_text": "Flights have dropped today from what I can tell\n\nMight be worth looking now"}, {"username": "Amanda Adkins Whitson", "comment_text": "We live in Atlanta. We flew to JFK first and saved thousands of dollars. We are in Rome now."}, {"username": "Teresa Brewer Harkins", "comment_text": "I’ve been looking for September next year, and though they aren’t booking out that far, looks like business class from Nashville Tn could be around $2500/pp 😖😩"}, {"username": "Janice Rea", "comment_text": "Rome is most expensive. Try Milan or Naples"}, {"username": "Elizabeth A McGuirk", "comment_text": "News this morning says prices may drop in August since summer bookings already happened"}, {"username": "Gina Rovello Keenan", "comment_text": "We booked out of Philadelphia months ago and they haven’t changed. Still $$$"}, {"username": "Eliz Fragoso", "comment_text": "Shop on Tuesdays"}, {"username": "Shamra Archer Coposky", "comment_text": "Try the website Hopper. I’ve been watching flights and they tell you when the best time to buy tickets for specific dates."}, {"username": "Janie Osborn Wiltshire", "comment_text": "NY to Milan round trip is the cheapest way to get to Italy.\n\nCheck round trip Atlanta to NY…\n\nMight have to do the travel agent thing on your own!\n\nEnjoy!"}, {"username": "Najeana R. Crandall", "comment_text": "It's 2 months until September. I will mostly only get more expensive from here. I saw sales early spring and haven't seen sales since."}, {"username": "Patty Ham", "comment_text": "You are late already."}, {"username": "Laura Skrzynski Adams", "comment_text": "Tuesday’s are always the best day to book airfare"}, {"username": "Gail Marie Chisholm Johnson", "comment_text": "We went last April to Rome for 144,000 Delta miles. Booked Dublin for early October for 54,000 Delta Miles. Just keep checking, but they won’t come down this close to September."}, {"username": "Frank Hunt", "comment_text": "I don’t think they will come down this year and beyond, plane and staff shortages, price gouging all adding to continuing high prices. Look for specials but it’s going to be expensive to fly for a while."}]}, {"id": "2195403504192061", "text": "We are in Florence for only two days. Would you say stay in town both days or go to the country on one of the days", "link": "facebook.com/groups/1373361046396315/permalink/2195403504192061/", "likes": 10, "comments": [{"username": "Jenn Messina Babore", "comment_text": "Town, too much to see to get to the country too."}, {"username": "Kerry Stutzman Karl", "comment_text": "Day trip to Pisa .."}, {"username": "Jenny Payne", "comment_text": "I have been going to Florence for years + living there , I would stay and see as much as you can fit in . Santo Spirito is a great area over the Ponti Vecchio bridge around the pitti palace, walk up to the top and see the statue of David on the hill , so much to see and do. Research is everything 🌻"}, {"username": "Alex Kovacs", "comment_text": "We had 5 nights in Florence and did 2 day trips (wine tour in the country wide & cinque terre) my favorite days were the ones exploring the city!"}, {"username": "Ellen Edmonds-Wilson", "comment_text": "We spent five days in Florence and didn’t run out of wonderful things to do. It’s gorgeous. Next trip we will do the Tuscan countryside."}, {"username": "Lisa Martinson", "comment_text": "You can do a half day wine tour & lunch at Verrazano."}, {"username": "Kay Rendall", "comment_text": "U r in Florence, just explore, see the sights but enjoy the atmosphere, wander the back streets, observe the local way of life. Check if there r any markets to explore, see how the locals.\nSo much to see in 2 days, why would u want to do a trip elsewhere."}, {"username": "Emma Osbourne", "comment_text": "Went to Cinque Terra one day"}, {"username": "Renee Rundle Stoneham", "comment_text": "With only 2 days explore Florence!\n\nYou can always take a side trip when you leave. Line going to Rome stop in Orvieto or Sienna for a couple hours."}, {"username": "Danielle Ritchie", "comment_text": "I’ve 2 full days and am doing a half day trip to Pisa"}, {"username": "Alexandra A Welker", "comment_text": "Stay in Florence, explore and immerse in the beauty it offers."}, {"username": "Phyllis Snyder", "comment_text": "Maybe a 1/2 day on a wine trip."}, {"username": "MaeLeigh Cf Cervantes", "comment_text": "Stay. You need double that for Florence."}, {"username": "Lisa Hedenberg Nichols", "comment_text": "We did one day/night in town and one day in Cinque Terre - but night back in Firenze. Also has about 1/2 of following day before we had to head to next stop."}, {"username": "Virgz Van Møøre", "comment_text": "Oltrarno"}]}, {"id": "2195406870858391", "text": "Planning a trip for Christmas 2024. Would like to go to Rome, Capri and Sorento areas. Do the trains and ferries run during this time to Capri and Sorrento? Wanted to spend Christmas in Sorrento, but concerned that everything will closed. Anyone been to Capri and Sorrento during Christmas? Any suggestions would be helpful.\n\nMy husband can only take off during Christmas so this is the only time we can go to Italy.", "link": "facebook.com/groups/1373361046396315/permalink/2195406870858391/", "likes": 0, "comments": [{"username": "Kay Rendall", "comment_text": "Capri probably out, because heavy weather, I don't think ferries run after October. Know they don't to Positano. It is winter, cold, no tourists"}, {"username": "Carolina Barnhill", "comment_text": "The weather can be pretty bad. I personally recommend big cities like Rome, Florence and Milan in December"}]}, {"id": "2195407137525031", "text": "Your recommendation to stay one night in Rome, and also any tours that are a must see . I only have one day", "link": "facebook.com/groups/1373361046396315/permalink/2195407137525031/", "likes": 9, "comments": [{"username": "Yvonne Donnellan", "comment_text": "Bio Hotel Raphael. Walk everywhere."}, {"username": "Brooke Heneghan", "comment_text": "Colluseum or Sistine chapel!! X"}, {"username": "Kristine Cameron", "comment_text": "Golf cart tour"}, {"username": "Jenn Messina Babore", "comment_text": "Do a golf cart tour - such a great way to see the city!"}, {"username": "Lisa Quinn", "comment_text": "We did the golf cart tour, my best Tour. ￼ They were excellent. ￼ Rome is essentially split into “two days“. Most do the Vatican/\nSistine chapel one day, and then on the other day, ￼do the Colosseum, Trevi Fountain, Spanish Steps, Pantheon, Capuchin Crypts. If you’re super ambitious, ask the golf cart tour to do everything in one day and start at 8 AM and finish at like 6 PM. If it’s too much, just choose which one of “those days“ interests you more. ￼ inquire soon."}, {"username": "Hudd Cass", "comment_text": "I would go to the forum and coliseum and have a tour in the forum."}, {"username": "Deea Cata", "comment_text": "My favorite spot in Rome was the Gianicolo hill in Trastevere. Seeing the whole historic Rome from there was breathtaking"}, {"username": "Amanda Jane Worthington", "comment_text": "Villa Borghese Art Museum. The Bernini sculptures are breath taking."}, {"username": "Jeff Gentner EA", "comment_text": "Check out Walks of Italy"}, {"username": "Brian Yonks", "comment_text": "Stay at the Rome Times Hotel. Central and walkable to everything"}, {"username": "Lisa Valdovinos", "comment_text": "Colosseum and Vatican"}, {"username": "Phyllis Snyder", "comment_text": "Stay as close to the attractions you want to see- buy skip the line tickets. Or just walk around taking in the sights and sounds and skip standing in long entrance lines- also pick up food from a market or street vendors and avoid sitting in restaurants waiting for service."}, {"username": "John Green", "comment_text": "Hotel Canada is amazing, close to the Metro easy to get around"}, {"username": "Angela Tutt-Callaway", "comment_text": "Thank you all so much. I’ll let you know what we do and where we’ll stay."}, {"username": "Meredith Noll", "comment_text": "Golf cart tour will get you a lot of places"}, {"username": "Starla Dawn", "comment_text": "Hotel Barocco Sauna and Spa rooftop suite"}, {"username": "Dave Colleen", "comment_text": "Started at one hotel in Rome and were unhappy so we switched to Kolbe Hotel and love it here. Also just completed a two and a half hour golf cart tour with gelato. It was GREAT!! I can send you name of company if you’d like."}, {"username": "Anh Ngo", "comment_text": "Viator Breakfast at the Vatican tour a must!"}, {"username": "Sarah Lybarger", "comment_text": "Shelby Britton we should check out the golf cart tours!"}, {"username": "Bennett Richards", "comment_text": "Hotel Grand Palatino Tome. Tight in the middle of all the best of Rome. Must see the Pantheon. A glimpse of what the glory of imperial Rome looked like over 2,000 years ago"}]}, {"id": "2195407627524982", "text": "I apologize if this is an annoyingly repetitive question. I am going to use Trenitalia to book my train tickets and am trying to decide is it is worth upgrading from standard to premium? I am getting the changeable tickets just in case, but I want to pick good seats. Is it a good idea to get seats by the luggage area to keep an eye on your bags?\n\nWeआणखी are taking backpack carryons with most of what we need packed in them, but also will take one checked bag for things we may buy. That way any lost luggage is on the way over is no big deal. But is there room at out seats for our carryons?\n\nWe will be there mid September so I imagine we should take short sleeve and capris style with maybe one light jacket?", "link": "facebook.com/groups/1373361046396315/permalink/2195407627524982/", "likes": 14, "comments": [{"username": "Lynn Crane", "comment_text": "I'm not sure about coach, but my husband and I bumped to business on Frecciarosa and had plenty of luggage space overhead and at our feet. We didn't do COO and had two large checked bags. Never felt scared for our luggage or anything. Very safe and comfy."}, {"username": "Jojo Hanna", "comment_text": "We booked and paid for Premium. 4hours before our trip, at 0400, I got an email saying our seats weren’t available and we were bumped down to a standard carriage. No refund. We put our cases on the seats across from us."}, {"username": "Ellen Edmonds-Wilson", "comment_text": "In the business carriages there’s ample room for luggage storage. Your checked bag can go between seats, in the overhead area if it’s not too heavy to lift, or in the storage area. I took a bike cable lock with me for security and didn’t use it. No thief was easily going to make off with a checked bag and 90 per cent of the passengers were tourists anyway. Italy is safer than some people on this page suggest. Pickpockets are a world wide phenomenon."}, {"username": "Alyce Henry", "comment_text": "Yes,do it,we are here now,done it in Milan,Venice,Ro\nme so worth it special treatment"}, {"username": "Dave Colleen", "comment_text": "Backpacks fit nicely in the storage above your head. There is space between the seats for luggage. Between the seats means your seat and the seat behind you sit back to back. There is a space to slide in luggage there."}, {"username": "Jeff McLellan", "comment_text": "We were amazed how much storage there was over the Business Class seats. One family actually put four large suitcases up above their seats."}, {"username": "Rhona OConnor", "comment_text": "Standard seats have overhead rack for your bags. Some racks near the door. There is more space in the business class as others said. I never felt worried about my bag but just kept an eye on it when the train stopped at a station."}, {"username": "Rose Stolarek", "comment_text": "Yes and you can check your luggage if it doesn’t fit overhead. We just stood near it when the train stopped but never ever had an issue"}, {"username": "Alex Kovacs", "comment_text": "Not sure what the normal seats on the trains look like cause we did the business seats for all of them and it was nice! we each checked a medium size suitcase and they fit in the overhead no problem. If you have a large suitcase I would definitely choose the seats near the luggage to keep an eye on it but that’s just me, a lot of people have no problem putting their luggage on one end then going to sit on the other!"}, {"username": "Heather MacDonald", "comment_text": "Worth the upgrade!!"}, {"username": "Susan Brooks", "comment_text": "I am on the train right now from Venice to Rome. It’s a 4 hour trip and I booked Premium. I’m so glad that I did so. There’s more space and snacks are provided."}, {"username": "Rachael Richardson", "comment_text": "We are in standard seats luggage above head nice train table and comfy seats did not pay premium"}, {"username": "Marina Rosa Moni", "comment_text": "For freccia ? Maybe"}, {"username": "Miriam McNally", "comment_text": "We took 1st class (a small amount € extra) and felt it was worth it, and definitely keep your bags near you to keep an eye (that goes for all trains imo, I had a brand new suitcase stolen on a train in UK so never again!). Also, you get snacks in 1st class!"}, {"username": "Rachael Richardson", "comment_text": "Standard"}, {"username": "Elena Innocenti", "comment_text": "I always booking business seats and if you are lucky there are space between backrests to put luggage.\nYou can choose your seat pay extra before checkout"}, {"username": "Rachael Richardson", "comment_text": "I also took a long flexible bike lock and padlock for when we stored our 3 bags at the end and locked them together on long journeys"}, {"username": "Renee Rundle Stoneham", "comment_text": "I upgrade on trips over an hour. I like having an assigned seat.\n\nThere are luggage racks for large bags.\n\nBackpacks can go in overhead rack above your seat or there is room on the floor of your seat. First class will usually have more room.\nAlso just discovered on my last trip there is room between the seats where they are back to back to slip bags into!"}, {"username": "Phyllis Snyder", "comment_text": "Yes upgrade for more room."}, {"username": "Lora Ruscitti Covington", "comment_text": "Definitely worth the upgrade!!"}, {"username": "Michael Scarpa", "comment_text": "Is business and premium the same?"}, {"username": "Jenny Payne", "comment_text": "I tell you what I have been doing for years in Italy , I use Italo train company that’s my preference, get on the train find your seats & then one person stands near the luggage until train departs, once it’s left the station take your seat ,when it stops again stand near it or get seats so you can watch it. September is lovely I wear linen or cotton pants with linen shirt or cotton shirt, you try and blend in and don’t look like a tourist, Italians in general don’t wear capris pants , I only saying that as you don’t want to draw attention 🌻"}, {"username": "Connie Wilson", "comment_text": "Depends on what trains you are taking and how long the trip is, and whether it is a Frecce (fast) train or regional.\nYou will have plenty of space for your backpacks, either above or behind your seats. If leaving luggage at the luggage racks then pick a seat where you can see the area, or get up and watch your luggage at every stop.\nAs far as clothing goes, again, it depends where you are going. A light jacket or sweater is recommended."}, {"username": "Brenda Carter Lancaster", "comment_text": "Ensure on Trenitalia that when you activate your ticket it\nWill be for\nThe first day of travel. Their website froze on me and put the wrong date and I have been trying since Sunday to speak or online chat! Definitely not how I wanted to spend my days. It’s been an awful experience 🥹"}, {"username": "Corina Cristea", "comment_text": "Yes, Is it good to get seats by the luggage area, see your luggage at all times and get off the train quickly; you have to choose seats towards the ends of the carriage"}, {"username": "Pat King", "comment_text": "Bought cheapest available seats and paid 4 euros extra to pick assigned seats together. Plenty of room for carryon size suitcases in bin above our seats. None of our trips were over 2.5 hours so felt no need to pay extra for upgrades. Did buy well in advance, maybe got some special deals. We did get water and a light snack too but that is not worth paying extra ticket price."}, {"username": "Sarah Nickel Mayo", "comment_text": "How far do you need tk\nReserve tickets. We are not taking Overnifght"}, {"username": "Katie Osterman-DiBlasi", "comment_text": "We did standard, put my huge bag above our head, just heavy and annoying to do but it fit fine (there’s also space in btwn the seats-the ones back to back- to slide your medium/small luggage which we did with my husbands bag). We sat next to each other for all 3 of our trips on the train."}, {"username": "Romina Lauretig Toscano", "comment_text": "Worth!"}, {"username": "Frances McDonagh", "comment_text": "If going far with lots of luggage get premium. We just went bologna to Florence for a day trip so didn't bother"}]}, {"id": "2195408270858251", "text": "Going in September…. Rome\nShould we get skip the line tickets,try on line in August, or get tickets at the Colosseum?\nSame ? for the Sistine chapel???", "link": "facebook.com/groups/1373361046396315/permalink/2195408270858251/", "likes": 2, "comments": [{"username": "Jenn Messina Babore", "comment_text": "Yes, definitely get your tickets in advance for the Colosseum and Vatican."}, {"username": "Jerry Lyubelsky", "comment_text": "Skip the line. Look at Viator for available guided tours too"}, {"username": "Patty Foster", "comment_text": "Post people have said. No 3rd party. Book direct."}, {"username": "Alexandra A Welker", "comment_text": "Book direct to avoid cancellations."}]}, {"id": "2195408427524902", "text": "Is it easy to get a water taxi from the Venice airport to a hotel in the town center or is that something that needs to be arranged in advance?", "link": "facebook.com/groups/1373361046396315/permalink/2195408427524902/", "likes": 0, "comments": [{"username": "Heather Hills Jacobs", "comment_text": "Get your guide! We ordered one in advance so they knew we were coming in and what flight."}]}, {"id": "2195416200857458", "text": "Best day trip to visit wineries near Florence? We will not have a car, so looking for an organized trip.", "link": "facebook.com/groups/1373361046396315/permalink/2195416200857458/", "likes": 0, "comments": []}, {"id": "2195412070857871", "text": "Any tattoo artist recommendations anywhere in Italy? Links to their social media would be even better!!! 😁 thanks in advance!!!", "link": "facebook.com/groups/1373361046396315/permalink/2195412070857871/", "likes": 5, "comments": [{"username": "Leslie BC", "comment_text": "Following 👍"}, {"username": "Francesca Caprino", "comment_text": "Sabina Tattoo, in Rome. The owner has more than 25 years of experience, she has exceptional hand-drawing skills and she speaks english beacuse she is half british https://\nwww.facebook.com\n/veraraotattoo"}, {"username": "Emma Pringle Tinson", "comment_text": "F"}, {"username": "Tara Doyle", "comment_text": "Check out loser studio in Florence"}, {"username": "Tatyana Garcia", "comment_text": "My artist HoriOkami! He books out in advance so it depends on when you go, but I love my tattoos"}, {"username": "Marni Sherwin Grove", "comment_text": "Marni Sherwin Grove"}]}, {"id": "2195421077523637", "text": "Looking for recommendations for wonderful Cooking classes in Lake Como area please 🍷🍝", "link": "facebook.com/groups/1373361046396315/permalink/2195421077523637/", "likes": 0, "comments": []}, {"id": "2195425517523193", "text": "My girlfriends and I are going to Italy in September. Any recommendations on where to stay and what to see in the Amalfi Coast?", "link": "facebook.com/groups/1373361046396315/permalink/2195425517523193/", "likes": 0, "comments": [{"username": "S Christian Everett", "comment_text": "Positano ￼\n\nhttps://\nwww.hotelancorap\nositano.com/"}, {"username": "Marisa DePalma", "comment_text": "Hotel La Palma was gorgeous"}, {"username": "Deanna Tipton Clemens", "comment_text": "Hotel Miramalfi"}]}, {"id": "2195426230856455", "text": "Hello 👋\nWe are visiting Rome, Florence, Venice this October.\nHow early do we need to buy train tickets?\nThank you?", "link": "facebook.com/groups/1373361046396315/permalink/2195426230856455/", "likes": 0, "comments": [{"username": "Brooke Heneghan", "comment_text": "We bought ours on the day x"}, {"username": "Jenn Messina Babore", "comment_text": "If you have children and want to get lower priced tickets, worth booking as soon as you know your plans and tickets are opened up."}, {"username": "Jerry Lyubelsky", "comment_text": "We booked as soon as ticket availability opened up"}, {"username": "Gillian O'Callaghan", "comment_text": "A couple of days before. I used Trainline for all my 13 trips."}, {"username": "Jenny Payne", "comment_text": "I go a lot to Italy and only every buy my tickets the day before or on the day , don’t go in peak hour am or pm as that will be expensive 🌻"}, {"username": "Steven Ciochon", "comment_text": "I just bought them at the train station the day of. Wasn't an issue beside one train I had to book the slow train because all the other trains were booked but I think it was more of a problem on their end than over booking."}, {"username": "Giada Todaro", "comment_text": "In order to get the best price available, buy tickets 4 weeks in Advance. Italo is cheaper than Trenitalia with the same, or better, standards."}, {"username": "Lisa Valdovinos", "comment_text": "We bought everything in advance through our travel agent. Made it a lot easier."}, {"username": "Joseph Ceci", "comment_text": "Just two train trips? Then buy the day before. Side trips, too, and a longer overall visit? Check out the Trenitalia Pass."}, {"username": "Janet Messanelli Bozzone", "comment_text": "You don’t need to buy even high speed trains in advance for those cities. Trains leave frequently and there always seems to be space. If you are going to a destination where there are fewer train options, then a month in advance is probably adequate. If you have solid plans and want low cost tickets, go ahead and book earlier. I prefer the flexibility of buying the same day or a few days in advance."}, {"username": "Renee Rundle Stoneham", "comment_text": "We’ve always bought ours the day before.\nAfter we decided how early we want to leave etc…\nOct is after busy season."}, {"username": "Matthew Cawley", "comment_text": "We bought some on the day. Anything Rome related would 100% buy in advance. First Thurs/Fri of the month is common train strike day"}]}, {"id": "2195433350855743", "text": "How feasible is Murano and Burano in the same day?", "link": "facebook.com/groups/1373361046396315/permalink/2195433350855743/", "likes": 20, "comments": [{"username": "Marthese Briffa", "comment_text": "Yes you can do it very easily. Enjoy! Burano is beautiful!"}, {"username": "Prasangi Gunasekara", "comment_text": "Definitely feasible in one day"}, {"username": "Anthony Sperduti", "comment_text": "Very"}, {"username": "Lisa Martinson", "comment_text": "Very"}, {"username": "Lindy Brophy", "comment_text": "Very feasible. I did it and still time to see some of Venice."}, {"username": "Cyndi Perrotta-Gemma", "comment_text": "Very"}, {"username": "Sherene Pipkorn", "comment_text": "Absolutely feasible. I suggest catching an early water taxi and go to Burano first before the crowds, so you can get great photos, then head to Murano."}, {"username": "Dianne Rios", "comment_text": "We did both super easy and doable"}, {"username": "Martha Gallardo Cuevas", "comment_text": "Very doable."}, {"username": "Vicki Brozovich", "comment_text": "Most definitely!\nLoved all three islands\nPlenty of shopping on\nBurano"}, {"username": "Alessandra Bonafè", "comment_text": "Yes, Murano-Burano-T\norcello starting from venice, book on \"getyourguide\" app"}, {"username": "Lee Rew", "comment_text": "Very!"}, {"username": "Julia Muller", "comment_text": "Super easy!"}, {"username": "David Gotlieb", "comment_text": "Easy."}, {"username": "Roe Gallo Saks", "comment_text": "Easy."}, {"username": "Susan Hansen Huckabee", "comment_text": "Ery"}, {"username": "Lynn Clemens", "comment_text": "Mark Clemens"}, {"username": "Yuko Y Smith", "comment_text": "Yes, we did Murano-Burano-T\norcello in one day. Each island may take one or two hours to see."}, {"username": "Sondra Knap", "comment_text": "We spent a long time in Murano and never made it to Burano but they can both be done....if you don't linger like we did! 😉😆"}, {"username": "Sarah Leonard", "comment_text": "Very easy to do"}, {"username": "Nancy Webster-Gregg", "comment_text": "Julie Webster-Rogers"}, {"username": "Christine Philomena", "comment_text": "Very easy"}, {"username": "Michael Kirkendoll", "comment_text": "If you get a private boat 🚤 you can go to both in 2-3 hrs"}, {"username": "Jackie Ames", "comment_text": "Easy"}, {"username": "Barbara Kistler Wilhelm", "comment_text": "Very feasible!"}, {"username": "Franca Hissey", "comment_text": "F"}, {"username": "Bobby Jo", "comment_text": "Yep 👍"}, {"username": "Anna Buchan", "comment_text": "Feasable and you can also see torcello. Just do a tour it includes the glass blowing as well"}, {"username": "Joe Easton", "comment_text": "Take a private taxi and you can see both easily in same day."}, {"username": "Shelda Halliday", "comment_text": "Easy"}, {"username": "Diane Langlois", "comment_text": "I was told it was and this is what I’ve planned for September"}, {"username": "Tomas Krivanek", "comment_text": "Very feasible. ⛴⛴⛴AM. I did a half day venice then PM"}, {"username": "Mike Ball", "comment_text": "We did it in a day in 2019 , they aren’t particularly large islands so you can take in both very easily in a day."}, {"username": "Jennifer Rix", "comment_text": "Very easy, we did both last year"}, {"username": "Berndt Weihs", "comment_text": "No Problem,even with a good seafoodlunch,on\ne day is more than enough!"}, {"username": "Virgz Van Møøre", "comment_text": "Depends on how much you'd lone to enjoy in each place, doable if you get up early"}, {"username": "Donna Dougherty", "comment_text": "Very easy"}, {"username": "Tyra Ng", "comment_text": "Doable 👍🏽"}, {"username": "Ingrid Zancoli", "comment_text": "You can make It. My advice Is to start with Burano, which Is far, and then head towards Murano, closer to Venice. Even Torcello Island worths a visit, by being the first human settlement in the lagoon."}, {"username": "Kit Nader", "comment_text": "Easy"}, {"username": "Paul Witham", "comment_text": "easy"}, {"username": "Lori Ann", "comment_text": "Very. We just did it. A beautiful way to spend the day. No tour needed. Take the ferry for 25 euros all day pass."}, {"username": "Danielle Johnston", "comment_text": "I’m on a 4 hour tour of them now for $40 through Viator."}, {"username": "Susan Brooks", "comment_text": "Very easy! Go to Murano first and then on to Burano. I went there 2 days ago.\nWalk around Burano, visit the Lace Museum and some shops near there. You will see some ladies in the shops making lace articles.\nHave lunch. We ate at Riva Ristorante. The food was delicious and the staff most hospitable.\nHave some gelato too!\nI hope you enjoy the excursions as much as I did."}, {"username": "Maria Musumeci", "comment_text": "We did it last year & had both done in 4hrs. Only spent an hour at Murana then 3hrs at Burano."}, {"username": "Payel Mahata Dey", "comment_text": "Yes completely - just half day from Venice"}, {"username": "Tracey Eelkema", "comment_text": "Easy to do"}, {"username": "Constance Lee", "comment_text": "I booked tour of these two and another one near by. Can easily do in a day."}, {"username": "Reshma De Cruze", "comment_text": "Can be very easily done in a day. I would suggest having lunch in Burano if you like seafood."}, {"username": "Monica Grieger", "comment_text": "Aaron Grieger"}, {"username": "Robin Weathers Richie", "comment_text": "We just did it last week- yes:)"}, {"username": "Carolyn Schwab", "comment_text": "I've done it a few times, very easy. Burano in particular is beautiful and colourful 🤩"}, {"username": "MaryBeth Kennedy Owen", "comment_text": "Yes"}, {"username": "Rahul Jha", "comment_text": "Doable and advisable"}, {"username": "Amanda Jane Worthington", "comment_text": "Easy, catch a water-bus (ferry), wonderful trip ♥️"}]}, {"id": "2195436697522075", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2195436697522075/", "likes": 0, "comments": []}, {"id": "2195437910855287", "text": "We are going to Italy next October and will do a day trip to Abruzzo to see ancestral family members and home. Besides the family visit (with genealogist probably) what would you suggest we see or do? We will be driving from Rome to Lettopalena and back.\n\nAlso will happily take suggestions for finding family. 🙂\n\nGrazie mille group!", "link": "facebook.com/groups/1373361046396315/permalink/2195437910855287/", "likes": 0, "comments": []}, {"id": "2195464840852594", "text": "I've been planning a trip to Rome the last week in March and it just occurred to me that this is the week before Easter (Tentative dates are March 22-March 29). We would be flying back to the states on Good Friday. What do you think? Would things be shut down? Too crazy busy at this time of year?", "link": "facebook.com/groups/1373361046396315/permalink/2195464840852594/", "likes": 1, "comments": [{"username": "Debbie DiOssi", "comment_text": "Easter week would be the busy week."}]}, {"id": "2195446210854457", "text": "Hi, is it possible to rent a scooter (say 125cc) in Italy using a New Zealand car license? TIA", "link": "facebook.com/groups/1373361046396315/permalink/2195446210854457/", "likes": 2, "comments": [{"username": "Tad Hashimoto", "comment_text": "Incorrect: You don't need a license of any sort to ride a 125cc scooter. Above that, you'll need an international driving permit.\n\nEdit: Sorry, as mentioned below, this is incorrect.\nYou need an IDP for riding up to 125cc. Above that, you'll need an IDP with a motorcycle endorsement."}]}, {"id": "2195447560854322", "text": "We’re going to Rome in a couple of weeks. Then to Venice. We have a 9 year old special needs child. Does anyone know of any accommodations for the tours , trains and other stuff there? Are there any tours she might not be allowed to go to? Any advice would be appreciated. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2195447560854322/", "likes": 0, "comments": [{"username": "Jenn Messina Babore", "comment_text": "You will definitely want to research accessibility. The water taxis on line 1&2 have ramps for accessibility. There are many bridges that do not have ramps and make the island a difficult one to maneuver. Doge’s Palace has limitations on where those with disabilities can go (e.g. the second or bottom floor - forget which) is not accessible."}, {"username": "Tara Roed", "comment_text": "May I ask the type of special need? I recently did positano, Sorrento and Rome with my twins. They are 18 and autistic. We did all the things and found everyone so helpful and kind. I can give you more insight if you let ‘em know what your child’s challenges are.\nMy son walks on the slower side and has to take his time when it comes to steps. He is also can get yore anxious at times. It can be unpredictable. I let the tour guide know at the the beginning of the Vatican tour. They both did an amazing job but she kept her eye out for us. She even came over at the end of the tour to comment on what a good job they did keeping up and listening. She said she was nervous after I pulled her aside. You just never know!"}, {"username": "Alessandro Iannelli", "comment_text": "Regarding Trenitalia, this is the dedicated page (in English) for their services for people with disabilities or reduced mobility: https://\nwww.trenitalia.c\nom/en/purchase/\ninfo_contacts/\ndisabled_passeng\ners.html"}, {"username": "Diane Janovas", "comment_text": "You may want to take the early morning tours as they are less crowded. You need to book those. If she enjoys the vaporetto ( which we did) we rode up and down the grand canal several times and then went to Lido for a longer boat ride. We also wandered around and just enjoyed the area. I would look for playgrounds for her as well. My son and I enjoyed those in London"}, {"username": "Lisa Quinn", "comment_text": "I did a golf cart tour in Rome with my daughter, who has mobility issues. It was amazing. We navigated very easily and escaped from the heat and the tour had skip the line passes. Mybesttour.com"}]}, {"id": "2195450757520669", "text": "What is the best way to get from Florence airport to just outside Certaldo in Tuscany area?\n\nI don’t really want to rent a car as our family will have one at the Villa, but I’m not sure if I should find a taxi (are they expensive for that route) or do a train?\n\nIf train, how do I get to the train station from the airport?", "link": "facebook.com/groups/1373361046396315/permalink/2195450757520669/", "likes": 3, "comments": [{"username": "Joseph Ceci", "comment_text": "Either take the brand new streetcar directly from FLR to the main train station in Florence, or taxi to Firenze Rifredi station. Check the Trenitalia website for schedules and prices to Certaldo, about an hour trip on local commuter train. Then have family pick you up at the station, or taxi to their villa."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2195452584187153", "text": "Hiii guyss!!!!\nI have an up coming trip in August and I was looking the flights from paris to rome, with the airline Transavia. Do guys have any reviews about this Airline?", "link": "facebook.com/groups/1373361046396315/permalink/2195452584187153/", "likes": 0, "comments": [{"username": "Susie Lewis", "comment_text": "My daughter flew with them last year. Budget airline, had no issues, baggage arrived which is a bonus. Think they are affiliated with Air France. Kermit the 🐸 coloured seats."}]}, {"id": "2195453804187031", "text": "I hear it is sooo hot there right now. We arrive next Sunday. Long dresses or shirts a better option?", "link": "facebook.com/groups/1373361046396315/permalink/2195453804187031/", "likes": 5, "comments": [{"username": "Gina Johannes", "comment_text": "Here in Italy now. I find sundresses are the best. It’s been 98 degrees here"}, {"username": "Jenn Messina Babore", "comment_text": "It was 108° in Rome yesterday. Whatever is light and breezy that you are comfortable in is my answer."}, {"username": "Joe Guzzi", "comment_text": "Shorts."}, {"username": "Sandra Desmond", "comment_text": "Shorts , sundresses, skirts all light clothes"}, {"username": "Lisa Schalig-Winter", "comment_text": "In Florence now. It’s a scorcher. Haven’t worn anything I packed. I brought linen, but it wasn’t light enough. Bought lightweight Italian linen pants and blouses at the markets."}, {"username": "Jan Armstrong", "comment_text": "Sundresses and skirts or shorts. Wore strappy tops - nothing with sleeves. And a hat!!"}, {"username": "Renee Rundle Stoneham", "comment_text": "Lightweight linen.\nShorter dresses, linen shorts.\nNatural fabrics in light colors, white, tan etc"}, {"username": "Emily Kelley Arrowood", "comment_text": "I wore sundresses- maxi/midi the whole time with thigh society shorts underneath and it was bearable but be prepared…it is HOT and I’m a Floridian so am used to it."}, {"username": "Lorissa Gill", "comment_text": "pretty sure that's personal preference really"}, {"username": "Julie Tran", "comment_text": "I wore dress"}, {"username": "Julie Tran", "comment_text": "Highly recommend to bring a neck fan for this time of the year"}, {"username": "Maria Coladangelo Ducca", "comment_text": "Long and breezy thin fabric . Linen cotton. Flowy pants"}, {"username": "Dayna Steinberg Cioffi", "comment_text": "Loose sundresses, thigh society cooling shorts, neck fan and cooling towels. Just finished 14 days here and heat didn’t let up once but we made it and made the best of it!"}, {"username": "Maggie Gpe Banuelos", "comment_text": "Cotten dresses were better for me but I made sure to have little lace knee length “knickers” to avoid the inner thigh rubbing rash! 🫢"}, {"username": "Kathy Flood", "comment_text": "Neck fans!"}, {"username": "Kylie Paine", "comment_text": "Lightweight ..my daughter's in Naples atm and said she's sweating from places you shouldn't haha"}, {"username": "Tammy Jo", "comment_text": "Tessa"}, {"username": "Romina Lauretig Toscano", "comment_text": "2 days ago :)"}, {"username": "Jess Ica", "comment_text": "Whatever you are most comfortable in. I could never wear dresses."}, {"username": "Marina Belardo Johnson", "comment_text": "The lightest clothes you have ! So hot 🥵"}, {"username": "Dana Green", "comment_text": "Sundresses, sun hat, sunglasses, umbrella, hand held fan."}, {"username": "Robert Mielewczyk", "comment_text": "Robert Mielewczyk"}, {"username": "Lisa Valdovinos", "comment_text": "I wore dresses."}, {"username": "Anwen Ingram", "comment_text": "Sundresses, but be aware, too much skin showing won't be allowed in some churches. Wear sturdy sandles mine felt apart because the glue melted."}]}, {"id": "2195457200853358", "text": "Could you please suggest for me any tour or packages for our Italy trip?\nThank you in advance ☺️🙏", "link": "facebook.com/groups/1373361046396315/permalink/2195457200853358/", "likes": 2, "comments": [{"username": "Jenn Messina Babore", "comment_text": "It would really help if you put what cities you are visiting. 🤗"}, {"username": "Jean Williams Bryan", "comment_text": "I have gone on Gate One tours. Not in Italy, but really enjoyed their tours. Sign up for emails, sometimes they have good deals"}, {"username": "Debbie DiOssi", "comment_text": "Check Viator."}, {"username": "Ken Vecchia", "comment_text": "Globus very good did a couple"}, {"username": "Brian Osman", "comment_text": "EF GOAHEAD TOURS are great"}]}, {"id": "2195458907519854", "text": "Headed to Italy in 2 days. I just saw in the news that parts of Rome is having power outages due to stain on power grid due to demand from air conditioners. Anyone heard or experiencing this?", "link": "facebook.com/groups/1373361046396315/permalink/2195458907519854/", "likes": 0, "comments": [{"username": "Jenn Messina Babore", "comment_text": "We had a power outage at midnight last night. It was 108° yesterday, so very possible."}]}, {"id": "2195468717518873", "text": "Vale la pena Gardaland?? Que opinan? Que tal el parque temático?", "link": "facebook.com/groups/1373361046396315/permalink/2195468717518873/", "likes": 0, "comments": [{"username": "Erica Verde", "comment_text": "Gardaland è il più famoso parco a tema italiano. Se sei nella zona del lago di Garda e viaggi con dei bambini può essere un modo piacevole per trascorrere una giornata.\nConsidera il caldo se viaggi in queste settimane, per una giornata a Gardaland è necessario portarsi un cappello e vestiti leggeri"}, {"username": "Tim Marina Caldwell", "comment_text": "F"}, {"username": "Jona Guðmundsdottir", "comment_text": "It was at least well worth it when we went..... the last time was in 2017. We also enjoyed the movieland, which is a much smaller but very enjoyable as well. Went there in 2018."}, {"username": "Joe Guzzi", "comment_text": "My kids always loved it until their late teens. Used to go every year. There are also some waterparks and an animal park nearby."}, {"username": "Kristina Ruk", "comment_text": "Worth it, but can be crowded in summer. We were in May on working day so kuds/teens were going for 2/3 times on rides they want. Also it is more convenuent to go bigger kids (from 130cm) as all the good rides are from this height. In summer there is water park included."}]}, {"id": "2195471034185308", "text": "Flying out of Malpensa Milan airport, how early do you suggest for customs and such? Our flight is at 11am and we are staying in Milan city center.", "link": "facebook.com/groups/1373361046396315/permalink/2195471034185308/", "likes": 0, "comments": [{"username": "Jenn Messina Babore", "comment_text": "For international flights, it is typically 3 hours. Domestic, you should be able to do 2 hours."}, {"username": "Gillian O'Callaghan", "comment_text": "You don't go through customs when leaving. For international it's 3 hours, domestic (within EU) then 2 hours."}, {"username": "Frank Hunt", "comment_text": "International, 3 hrs, your airline will always advise this."}, {"username": "Miyuki Kanno Paul", "comment_text": "Malpensa Express takes 50 minutes to Malpensa. Take 7 am train"}, {"username": "Connie Wilson", "comment_text": "I was there two weeks ago and arrived 2.5 hours before flight. No problem. Make sure you factor in the hour it takes from the city center to airport either by bus or train from Milano Centrale."}, {"username": "Donna Gilardone Szwabowski", "comment_text": "At least 2.5 hours"}, {"username": "Alexandra A Welker", "comment_text": "No customs for outgoing flight but you still need to get through security. You need at least 3hrs for international."}]}, {"id": "2195473674185044", "text": "Any suggestions for a “take on board “flight travel backpack for 3 weeks- I’m not an overpacker at all- everything has a purpose. TIA", "link": "facebook.com/groups/1373361046396315/permalink/2195473674185044/", "likes": 3, "comments": [{"username": "Allison Mir", "comment_text": "Depends what your airline hand luggage specifications are"}, {"username": "Jessica Petyo", "comment_text": "The “Luka” line from Calpak is awesome!!! So soft and comfortable. I prefer the duffel since it slides over the luggage handle (backpack does as well) and fit so much stuff. We just returned from a 2-wk trip to Italy and did COO. https://\nwww.calpaktravel\n.com/products/\nluka-laptop-back\npack"}]}, {"id": "2195495420849536", "text": "Doing the Norwegian Gem cruise departing 8/04. What excursions are a must? ☺️", "link": "facebook.com/groups/1373361046396315/permalink/2195495420849536/", "likes": 0, "comments": []}, {"id": "2195497064182705", "text": "My son is going to do a four week study-abroad program in Siena. Besides comfortable walking shoes, what other must-haves should he pack? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2195497064182705/", "likes": 0, "comments": [{"username": "Kathy Vulpis Gribben Sweeney", "comment_text": "Merino wool socks and shirts!"}]}, {"id": "2195500004182411", "text": "Hi, everyone, I like this team very much, and it concentrates all our knowledge and experience in this team, so that we can share each other together and realize the sharing and utilization of resources. I am honored to be one of them. I will visit Italy in September, my choice is Sicily, I need any suggestions, or you can give me any suggestions. For example, should I bring my down jacket or sunscreen🥵😅😰", "link": "facebook.com/groups/1373361046396315/permalink/2195500004182411/", "likes": 3, "comments": [{"username": "Erica Verde", "comment_text": "September is perfect to visit Sicily! Without August crowd and perfect temperatures for sunbathing.\nI suggest a visit to Valle dei Templi in Agrigento and to Noto in the south. For seaside it's very characteristic San Vito Lo Capo or, if you like trekking, the naturale reserve called Zingaro where you can reach beautiful hidden beaches by walk.\nDon't forget to try Sicilian cuisine and the typical recipes of this region like famous desserts (cassata and cannoli) and a lot of delicious pasta recipes."}, {"username": "Kay Rendall", "comment_text": "I have been in Sicily (Erice) a mountain magic village in September so so cold at night, fog, a bit scary we needed jackets, scarfs."}, {"username": "Miyuki Kanno Paul", "comment_text": "If you are going to visit Monte Etna, bring a jacket as it gets cold above 2530 m"}]}, {"id": "2195500277515717", "text": "In the early stages of planning. Italy is so big and has so many places of interest. I am looking to narrow it down to only 3 or 4 places. My husband wants to visit Rome. I want to visit Venice. Which 2 other places are a must see in Italy?", "link": "facebook.com/groups/1373361046396315/permalink/2195500277515717/", "likes": 21, "comments": [{"username": "Kathy Kattic McKee", "comment_text": "Florence, sorrento or Positano"}, {"username": "Katie Osterman-DiBlasi", "comment_text": "Just got back from 2 weeks! 2 days in Venice, 4 Florence (with a day trip to Tuscany countryside), 4 Rome and 4 sorrento (2 day trips, Pompeii ½ day and second was a boat tour to positano and Amalfi). Perfect tasting of each area!"}, {"username": "Suzanne Milani Agresta", "comment_text": "Definitely Cinque Terre or Amalfi Coast!"}, {"username": "Kenneth T Williams", "comment_text": "Go to neither\nFocus upon Florence"}, {"username": "Denise Townes Giacobba", "comment_text": "Florence and Amalfi Coast"}, {"username": "Ines Taprell", "comment_text": "Genova is a great base for Cinque Terre and Pisa and is gorgeous to visit on it's own."}, {"username": "Kathy Dowdell", "comment_text": "Florence\nAmalfi coast"}, {"username": "Luanne Carey", "comment_text": "I highly recommend Florence and Lake Como. We’ve been all over Italy, but we always go back to those places, as well as Rome. We’ve only been to Bologna once but loved it and are planning to go there again next time. I hope you have the best trip ever! ￼"}, {"username": "Kerry Cofrancesco", "comment_text": "Florence Naples"}, {"username": "Rita Sanza", "comment_text": "Sicily and the cinque terre"}, {"username": "Marina Alfidi", "comment_text": "Tra Venezia e Roma fermati a Pisa e Firenze"}, {"username": "Faryal Abbas", "comment_text": "We just planned our trip. We are going to Rome, Florence, Venice and Milan. Planning to do day trips from these major cities as well."}, {"username": "Maria LoSurdo", "comment_text": "Italy isn’t actually a big country. It’s 75% of the land area of California. One of the biggest in Europe but only 72nd biggest in the world. 😊 Probably just seems big as it has so many different terrains and places of interest as you said. 2 other places I’d go are Florence and either Cinque Terre or the Amalfi Coast. 🇮🇹❤️😊"}, {"username": "Elsa Hurt", "comment_text": "Amalfi Coast and Lake Garda."}, {"username": "Berndt Weihs", "comment_text": "For sure Firenze and Verona.\nBoth on the way from Venice to Rome"}, {"username": "Nicole Grieve", "comment_text": "Anyone can recommend where to stay in Florence ?"}, {"username": "Kim Comerford", "comment_text": "For two weeks, Rome, Florence/ Tuscany and Venice. Smaller places like Verona and Bologna are less touristy."}, {"username": "Robbie Lombardi", "comment_text": "Florence"}, {"username": "Eileen Mercieca", "comment_text": "Both of them"}, {"username": "Andrea Brown", "comment_text": "Florence, Amalfi coast cinqueterra,"}, {"username": "Charlotte Nepstad", "comment_text": "Venice is a one time must-see, but you don’t need much time. A daytrip is fine. I like Florence better than both, stay there and take a 2hr train to Venice."}, {"username": "Nancy Kirby", "comment_text": "Florence"}, {"username": "Shawn Kopp", "comment_text": "Look. you don’t have to break the bank .when you visit Italy. just see Rome and Venice on this trip. Come back see a couple ￼more. it’s not really a lot money if you do it right …take your time in each place you visit. enjoy it.if you rush threw anywhere in a week or two. Your not going to remember anything… lol"}, {"username": "Elizabeth Buchanan Sinnes", "comment_text": "Definitely Florence"}, {"username": "Rick Calabro", "comment_text": "Florence and Amalfi coast"}, {"username": "Patti Farrell", "comment_text": "Keep it to yhe Noth of Rome. TUSCANY AND FLORENCE"}, {"username": "Kristen Blue", "comment_text": "I would add Florence and Cinque Terre"}, {"username": "Debbie Potter", "comment_text": "We're planning Venice, Rome and somewhere on the coast, just haven't made up our minds on what city on the coast."}, {"username": "Mindy Jo", "comment_text": "We are going to stay in Milan (i cant find much of interest there so...)for 3 nights. Take a day trip to Lugano Switzerland, and Cinque Terre, then on to Venice for 2 nights, 2 at Florence, 3 in Rome, and 3 in Sorrento."}, {"username": "Lindsy Serrato", "comment_text": "Florence!!"}, {"username": "Valerie Collanton", "comment_text": "My picks are Florence and the Amalfi Coast. I would start in Venice continue onto Florence. Then Rome, ending wherever you decide to stay on or near the Amalfi Coast. My choices for that would be Sorrento or Amalfi. Fly home from Naples."}, {"username": "Elizabeth May La Duca", "comment_text": "Lago Maggiore"}, {"username": "Dr-Jon Warnecke", "comment_text": "Travel just between those two cities! Do Florence, Tuscany (Siena, San Gimignano, Lucca), or Umbria (Assisi, Gubbio, Perugia, Spello, Orvieto)."}, {"username": "Megan Leigh", "comment_text": "Tuscan & Umbrian countrysides...\nlook up \"walking tours of [... insert town names]\" on YouTube. Check out spello, risiglia, Montipilciano, pienza, Assasi, Orvieto, etc. Also check out videos of the Val d'orcia area. *swoon*"}, {"username": "Renee Rundle Stoneham", "comment_text": "I’d stay N of Rome and really leisurely enjoy your stay.\nI’d stay in Tuscany, rent a car and stay in a Agritourismo. We stayed in one in San Gimignano. Still one of best stays!\nFrom there you can do day trips to Florence, Sienna, Lucca, CT etc…\nReturn the car and head to Venice.\n\nDo multi city flight so no backtracking."}, {"username": "Bob Sullivan", "comment_text": "Travel guru Rick Steves says \"Travel like you'll be back again\". Not necessarily that you might ever return but just don't try to fit it all in on one trip. If you're not falling in love with one of the places you've chosen to visit and might have scheduled too many days there, take a daytrip to another place. Two weeks is plenty of time to hit 4 spots. Fly into one city at one end and back home from the other end.\nIf you're looking for a company to give you some ideas, Tripmasters is one that has several multi-city options already with the flexibility to add a day here, subtract one there etc. I used them for my solo 3 city Rome/Florence/\nVenice even after I'd already been to all three places before."}, {"username": "Lee Say Lor", "comment_text": "Florence if u love museums...there\n's a beautiful church with lovely very old paintings on the walls there called santa Maria novella well worth a visit. Walking distance from train station. I like siena too."}, {"username": "Daniela Parhar", "comment_text": "Florence and Puglia"}, {"username": "Candy Mattiello", "comment_text": "Positano, Florence definitely… and Tuscany(San Gimignano, Sienna) or Cinque Terre… forget Venice … but that’s just me…!"}, {"username": "Karen Schmidt", "comment_text": "My daughter and I did Rome (5 nights)-Florenc\ne (4 nights)-Cinque Terre (3 nights) and flew home via Venice (3 nights )last September. It was fantastic! We did a day trip to smaller areas in Tuscany from Florence. We had been to Venice before but loved it so went back again."}, {"username": "Helene Wright", "comment_text": "Siena or La Spezia Menaggio on Lake Como. We just got back!"}, {"username": "Dana Talusani", "comment_text": "We loved Florence and Sorrento. Sorrento is such a lovely Amalfi-adjacent\ncity with great restaurants and day trips boating to Capri and Positano. It's FAR less crowded and just as charming."}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "Florence definitely"}, {"username": "Steve Grossman", "comment_text": "You'll need three days in florence and it's on the way from rome to venice"}, {"username": "Annette Fordyce", "comment_text": "I think a good place to start is to ask yourself what you want to see- do you want to see the usual places that most tourists see? Or do you prefer seeing more off the beaten track places? Do you love old buildings and churches, hiking, shopping, or just taking some down time to sit by the ocean? Plan from there. Rome, Venice, and Florence are a great start if you want to see as many of the “greats” as you can in one trip. If you want something slower paced and aren’t worried about seeing all of the more famous places in Italy, I warmly recommend a few days in Umbria- especially Perugia."}, {"username": "Andrea Fitzgibbins", "comment_text": "I no think Venice lovely but OVER Rated. Depends on your likes. I love Amalfi Coast but expensive."}, {"username": "Jeanette Ramos-Gonzalez", "comment_text": "I will be staying 4 nights in Rome 4 nights in Sorrento 4 nights in Florence and 3 nights in Venice … then taking a few tours.. Amalfi coast … Capri and Cinque terra …"}, {"username": "Alana Marie Sult", "comment_text": "Too many places in too short of time. I would do Rome and Florence. I could spend it all in Florence myself...lol"}, {"username": "Sh Kaplan", "comment_text": "Florence for sure!!"}, {"username": "Shirley Collar Wilson", "comment_text": "Tuscany, Sorrento, Positano, Capri, Amalfi,"}, {"username": "Lisa Minichini-Dowty", "comment_text": "Florence and sorrento!"}, {"username": "Merlene Gilb", "comment_text": "Cinque Terre, Milan, Florence."}, {"username": "Elyssa Gross", "comment_text": "We spent 9 days this past May. We did Venice, Cinque Terre, Florence, Pisa (personal sentimental reasons) and Rome"}, {"username": "Nana Tirolese", "comment_text": "Bergamo or Brescia 😉"}, {"username": "Lucrezia Folger", "comment_text": "The typical 1st timers trip is Rome, Florence, Venice and either Amalfi Coast or Cinque Terra. Depends on how many days you have, do not count the day of arrival and departure as part of your time."}, {"username": "Cindy Fugitt", "comment_text": "Florence especially if you love art."}, {"username": "Jane Eichhorn", "comment_text": "Cinque Terre"}, {"username": "Patricia Breh", "comment_text": "I would only add Florence as a home base and take day trips to Siena, Luca, Pisa, San Giminiano and maybe even an overnight in Cinque Terre."}, {"username": "Patricia Breh", "comment_text": "Also, I agree with everything people are saying about Venice… it’s pricey, filled with tourists and a little kitschy. BUT, it’s an amazing place! I had only ever gone on day trips in the past and this year my husband and I stayed for 3 nights and LOVED IT! We did the sunset gondola ride, day trip to Murano and Burano, ate amazing food, and got lost wandering the little streets… it was unforgettable and I’m so happy we did it. The best part was having it all to ourselves at night when everyone left at the end of the day."}, {"username": "Louis Passariello", "comment_text": "Amalfi and seinna"}, {"username": "Carine Brys", "comment_text": "Sorrento as a home base to make day trips to surroundings."}, {"username": "Alexandra A Welker", "comment_text": "Florence and Cinque Terre!"}, {"username": "Alessia Zito", "comment_text": "Sicily"}, {"username": "Lydia Springer", "comment_text": "Two more places I would choose are the northern Italian lake region (Garda, Iseo, Como, Maggiore) and Florence."}, {"username": "Brooke Heneghan", "comment_text": "Verona or Bologna- in the middle of both so a good stop over too? X"}, {"username": "Carolina Barnhill", "comment_text": "For your first time I probably would go Milan+Lake Como, Venice, Florence, Rome"}, {"username": "Marina Belardo Johnson", "comment_text": "I just did Rome and Amalfi Coast with a super nice Afforable b&b that plans day trips to rome and Amalfi coasts, Pompeii etc"}, {"username": "Connie Wilson", "comment_text": "Florence plus Bologna, Verona, Lake Garda or the Dolomites."}, {"username": "Gail Dial Harris", "comment_text": "Florence"}, {"username": "Lisa Abrams Argento", "comment_text": "How long of a trip are we talking about?"}, {"username": "Jill Medrano Casey", "comment_text": "Florence!"}, {"username": "Tanya Cini-Kirk", "comment_text": "Venice, Viareggio beach(relaxing days), Sorrento w day trips to Amalfi, positano and capri, Rome"}, {"username": "Debi Wood Swan", "comment_text": "I am in Venice now and find it overrated."}, {"username": "Renae Larcus", "comment_text": "Our first trip we did Rome, Florence, Cinque Terre and Venice. Lake Como is North, too."}, {"username": "Lisa Valdovinos", "comment_text": "Sorrento, Capri, Florence."}, {"username": "Phyllis Snyder", "comment_text": "Florence or Siena"}, {"username": "Karen Smart", "comment_text": "Florence! I didn't really know much about it when we went but it ended up being my favorite!"}, {"username": "Friedemann Diederichs", "comment_text": "Florence and the Dolomites. Venice sucks and stinks. Don’t put too many destinations in one trip."}, {"username": "Andrew Mircovich", "comment_text": "Florence and Sorrento"}, {"username": "Victoria Williams", "comment_text": "Florence Milan"}, {"username": "Monica Ramos", "comment_text": "Don't go to Venice. Stay in Rome."}, {"username": "Suzanne Mills", "comment_text": "Florence is mandatory as Lake Garda!"}, {"username": "Nicole Beaumont", "comment_text": "Florence! Also check out Rick Steves Italy book. It helped me plan my trip."}, {"username": "Christine Aird Craig", "comment_text": "Rome, Florence, Verona, Venice, Rome"}, {"username": "Melissa Jane Brown", "comment_text": "You can't not go to the Amalfi Coast"}]}, {"id": "2195514627514282", "text": "Are private/personal vehicles allowed to pick up passengers in the port of Civitaveccia?", "link": "facebook.com/groups/1373361046396315/permalink/2195514627514282/", "likes": 1, "comments": []}, {"id": "2195526404179771", "text": "Hi everyone who is currently in either Sorrento or Amalfi, we are in Sorrento and thinking about getting a boat to Amalfi but concerned about the length of queues and standing in the heat for too long. Would appreciate some wisdom if anyone has been in the last couple of days?", "link": "facebook.com/groups/1373361046396315/permalink/2195526404179771/", "likes": 4, "comments": [{"username": "Darryl Vanstone", "comment_text": "We did two separate boat tours this week. One to Positano / amalfi and one to capri. We opted for the semi private 8-12 people options for both. Our hotel lined them up for us. You need to book a day or two in advance. They pick you up at your hotel and bring you back after. I would highly recommend"}, {"username": "Dayna Steinberg Cioffi", "comment_text": "Our hotel has a whole list a private boats for 4 hours if you want that option they seem to be available."}, {"username": "Corina Cristea", "comment_text": "You coud travel by ferry :\n\nhttps://\nwww.alilaurogrus\non.com/\nFerry-Sorrento-A\nmalfi\n\nhttps://\nwww.ferryhopper.\ncom/en/"}, {"username": "Richard Rodriguez", "comment_text": "We had no problem using the ferries."}, {"username": "Teresa Marina", "comment_text": "I thought the ferry was easy- I had a 1220 and got on at 1210. Went to Positano and arrived in 50 min."}]}, {"id": "2195527274179684", "text": "HELP!!!!!! Does anyone know if there’s any drying option in this machine ?", "link": "facebook.com/groups/1373361046396315/permalink/2195527274179684/", "likes": 2, "comments": [{"username": "Charlie Louise Moore", "comment_text": "I have a similar machine but mine is English. I’m going to say no. X"}, {"username": "Stephen Dawson", "comment_text": "i’m guessing that the blue section is drying"}, {"username": "Jenn Messina Babore", "comment_text": "Can you reach out to your AirBnB host to ask?"}, {"username": "Elena Eugeni", "comment_text": "Elena Eugeni"}, {"username": "Carolyn Esposito", "comment_text": "The washing machines were the hardest to figure out. I suggested to our host to print quick wash directions in English. Good luck"}, {"username": "Lisa Howard", "comment_text": "Probably be quicker to stick it out the window 😂"}, {"username": "Laurie Francis Menk", "comment_text": "Blue side is for drying"}, {"username": "Michael L. Ringoir", "comment_text": "This is a Washing machine. Not a combination/\ndryer. Try the “vidange essorage” to do a quick-spin cycle and hang your clothes out to dry 🙂!"}, {"username": "Alexa Gavazzi", "comment_text": "in 1h the sun would dry it all"}, {"username": "Renee Rundle Stoneham", "comment_text": "Doesn’t appear to have it.\nUse Google Translate and take a picture it will translate it all.\n\nThat how we found quick wash and dry. Picture of sun usually means dry too."}, {"username": "Debbie Grindal", "comment_text": "Google translate app easy & quick have done it for all my places with washing machines not hard 😜 also you can look up the model instructions then just push Aa in search box then translate to English 👍"}, {"username": "Tjaša Jeras", "comment_text": "Symbols with sun are for drying"}, {"username": "Tjaša Jeras", "comment_text": "Tjaša Jeras"}, {"username": "Kerry Montplaisir", "comment_text": "I'd there's a line outside and clothespins hang them.outside"}, {"username": "Brad Beckett", "comment_text": "It will still take hours and hours"}, {"username": "Olive Shuk Ting Daley", "comment_text": "Thank you everyone"}, {"username": "Miroslav Tobiasek", "comment_text": "https://\nwww.manua.ls/\ncandy/\ncsws596twmcre-s/\nmanual?p=4"}, {"username": "Romina Lauretig Toscano", "comment_text": "It is in English :)"}, {"username": "Graham Sherlock", "comment_text": "It's summer. Hang it out it will dry very quickly."}]}, {"id": "2195529367512808", "text": "Hello everyone,\nI am planning a trip to Rome in 3 weeks with a friend. We would like to visit the Vatican Museum but all the tickets are sold out on the official website. Is there an other way to visit this Museum?\n\nWhich website do you use for make à réservation for a visit of the Coliseum?\n\nYour answers will be very helpfull.\n\nThank you very much!", "link": "facebook.com/groups/1373361046396315/permalink/2195529367512808/", "likes": 2, "comments": [{"username": "Jenn Messina Babore", "comment_text": "You can go early and queue for tickets.\n\nFor Colosseum, it is Coopculture.it."}, {"username": "Marti Krauss", "comment_text": "Call the concierge at your hotel"}, {"username": "Joseph Ceci", "comment_text": "This late in the game I recommend booking a tour through Viator or a similar agency."}, {"username": "Matthew Cawley", "comment_text": "Recommend The Roman Guy. We did their 1 day tour of Rome and only booked night before. Was Vatican, collo, roman forum, trevi fountain and lots more. Long day (7-8 hours) but worth it"}, {"username": "Cindy Killingsworth", "comment_text": "Viator"}, {"username": "Lisa Schalig-Winter", "comment_text": "We used Crown Tours for both last week. Tour guides were great. Since it was so hot in Rome, we also rented lime scooters during the late evening and saw all the sights lit up. No traffic or tourists. It was wonderful."}]}, {"id": "2195531610845917", "text": "Can you buy skip the line tickets at the colosseum? We may get a transfer from cruise ship so I’m not sure what time we would get to Rome. Or are we better to buy tickets online? Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2195531610845917/", "likes": 0, "comments": [{"username": "Tegan Harris", "comment_text": "We bought tickets through coopculture and literally walked straight in. No line."}, {"username": "Jenn Messina Babore", "comment_text": "Buy them online if you can get them. They open up 30 days out.\n\nFrom the cruise ship, it all depends on what time you get off the ship, are you dropping your bags at where you are staying,…? Example - we got off the ship at 8am to get our luggage and were in the waiting area at 8:30, when our driver was due to pick us up. Due to traffic, he didn’t get to us until 9am. Then we had to load the bags in the car and didn’t get to our apartment until 10:45am. We had 11:45am reservations and missed them by the time the person gave us the rundown of the apartment and we walked to the Colosseum. So definitely budget extra time (especially if you have a larger group)."}]}, {"id": "2195532307512514", "text": "Hello! I need some help finding a product to treat my boyfriend’s eczema, he left his usual lotion at home 🙄 What can I buy in Rome that can help him?", "link": "facebook.com/groups/1373361046396315/permalink/2195532307512514/", "likes": 2, "comments": [{"username": "Ingrid Zancoli", "comment_text": "Do you remember the lotion ingredients? Go to a drugstore and ask for a similar product. Some medicines can be bought without prescription. If you need a prescription ask to your hotel if they can help you with a call to the medicali ward. There a doctor would write the prescription for you."}, {"username": "Cecilia Christine Costantini", "comment_text": "Maybe this one, show the pharmacist a picture. Eczema is the same word in Italian."}, {"username": "Brian Osman", "comment_text": "Go speak to a pharmacy"}, {"username": "Ana Curbelo", "comment_text": "They have cortisone 10 in Italy"}, {"username": "Karen Schmidt", "comment_text": "The pharmacists are usually pretty great. Just have a chat with one of them . I find that there are usually far better choices than here."}, {"username": "Michelle Robertson-Leathley", "comment_text": "My travel hack is zinc baby butt cream. Works great to heal rashes, chapping, sun burns etc. It’s usually fairly easy to find. Also probiotics like kefir will help repair the gut-tends to be where the eczema is triggered."}]}, {"id": "2195552187510526", "text": "Lake como", "link": "facebook.com/groups/1373361046396315/permalink/2195552187510526/", "likes": 83, "comments": [{"username": "Tami Faso", "comment_text": "Tami Faso"}, {"username": "Renee Dillenbeck", "comment_text": "Did you love it? I’m thinking of bringing 3 teenage boys there for a day trip from Milan and then heading to Lugano. We want to fill our days with the best!"}, {"username": "Katie White-Meade", "comment_text": "Breathtaking"}, {"username": "Roger W Ilsley", "comment_text": "Bucket list"}, {"username": "Marie Cuzzi", "comment_text": "Truly love Como"}, {"username": "Robýn Kretsçhmər Schuchårdt", "comment_text": "Wow, that does not even look real!"}, {"username": "Beth Andrews", "comment_text": "Love this place. I’m going back soon."}]}, {"id": "2195534647512280", "text": "Planning on going to Europe next year July/ August\nFamily of five, how much would you budget. Flights, accommodation, in between flights or hiring a car, food plus spending money", "link": "facebook.com/groups/1373361046396315/permalink/2195534647512280/", "likes": 1, "comments": [{"username": "Alison Ahlberg", "comment_text": "We are a family of 4 just got back (to Australia) cost us around 40k for one month in Italy and Greece\nPs July august will be very hot maybe consider June /July"}, {"username": "Roland Trego", "comment_text": "Search: “budget to Italy family vacation” and numerous ￼ articles will appear. There are so many variables ￼ that it is ￼ difficult to say, plus the reluctance to reveal personal expense information￼.”"}, {"username": "Dawn Burton Hammon", "comment_text": "Also depends how long you'll be going for, types of accommodations,\nwhat part of the country you're flying from, how much of a budget traveler you are, etc. I figure about 5k pp for a 10-day trip. However I'm in the points game and will be using mostly points for flights so that will be more like $2000 rt for all 5 of us (PE ow and econ on return) rather than $6k or more. This is for a trip from PDX to Scotland next May. We will do VRBO where possible rather than 3 rooms too. My kids are all adults now so no sharing pullout. LOL.\n\nI'm going to Italy and Switzerland in the fall and paying around 5k for 16 days with many luxury upgrades."}, {"username": "Jennifer Swayne", "comment_text": "We're a family of 5 - total prob 15k. 12 nights, 4 cities, plane and train tickets, a couple tours, no food budget - we ate where we wanted and ordered whatever. I can't imagine how it would have been more (we stayed in decent airbnbs)"}]}, {"id": "2195537504178661", "text": "If you are planning your trip and you want to explore Capri try to figure out a way of staying over for at least one night. I will admit it was a little manic when we first arrived. But as the sun set, and theआणखी ferries left so did the crowds. We had a lovely early dinner and then spent time wandering around exploring and shopping. As the sunset a light breeze began and the place almost transformed before our eyes.", "link": "facebook.com/groups/1373361046396315/permalink/2195537504178661/", "likes": 89, "comments": [{"username": "Michelle Cotoni", "comment_text": "Taormina reminded me very much of Capri."}, {"username": "Tara Roed", "comment_text": "that makes a lot of sense. I would say the same if positano. Everyone talks about crowds when we stayed there I didn’t feel it was very crowded. Next time maybe we spend a few nights in Capri 😊"}, {"username": "Andrea Mirs", "comment_text": "Avoiding crowds and heat sounds perfect. What time do the ferries leave and how late did you stay out at night?"}, {"username": "Dianna Austin Bessignano", "comment_text": "Thanks for sharing and great to know for the next trip!"}, {"username": "Kimberly Lynne", "comment_text": "We based in Sorrento. I swear next time I will move along the coast to enjoy the towns more."}, {"username": "Jared Mankins Scavotto", "comment_text": "Go to the famous Axel Munthe house if you didn't already. His story was really inspirational"}, {"username": "Marita Bracun", "comment_text": "night time is my fav in Italy and most countries around the world"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2195551527510592", "text": "What to do near Napoli airport? We don’t want to drag our luggage around but we have time before our flight. Any suggestions?", "link": "facebook.com/groups/1373361046396315/permalink/2195551527510592/", "likes": 0, "comments": [{"username": "Jenn Messina Babore", "comment_text": "Check to see if there is luggage storage nearby that you can drop your bags with so you can explore easier. Usebounce.com and others will let you know what locations they have."}, {"username": "Miyuki Kanno Paul", "comment_text": "How much time do you have to kill?"}]}, {"id": "2195554134176998", "text": "Hello everyone !\n\nWe are going with my friend on a trip to « the Pouilles » we have plan to sleep at Bari, Ostuni, Brindisi and Lecce.\n\nWe want to know if you know some good places to take a drink and most ofआणखी important for us, make party 😊 Because last year we where at Pise and Cinq Terre and we couldn’t find some good places to dance ! I just found for now the « Riobo » at Gallipoli.\n\nAlso we have a location car, but do you know if it’s possible to have easily some taxi or Uber ?\n\nThank you to everyone 😌 Have a good day", "link": "facebook.com/groups/1373361046396315/permalink/2195554134176998/", "likes": 0, "comments": [{"username": "Annarita De Adessis", "comment_text": "Hi! I live in Bari and I can tell you that if you wanna stay in the center of the city, there are lots of cool places for drinking such as in Corso Vittorio Emanuele and in Piazza Mercantile but even along the lungomare there are a few. For instance, the old town of Ostuni which is the most famous part is full of nice places such as Bar93.\nHope this was helpful 🙃"}]}, {"id": "2195561427509602", "text": "Hi quick advice for upcoming trip to Florence. We only have like 2.5 days as we arrive on a Friday at lunchtime. We do have tentative a tour to Siena and San Gimignano but it’s a full day and worried it might be better to maybe do a half day somewhere instead so I have more time in Florence. Thoughts??", "link": "facebook.com/groups/1373361046396315/permalink/2195561427509602/", "likes": 2, "comments": [{"username": "Janice Rea", "comment_text": "The tour to Siena and San Gimignano was great. It will be tight but you can see highlights in Florence. I see they have golf carts tours their now. Might be a good option to see Florence."}, {"username": "Jenn Messina Babore", "comment_text": "Personally I would just spend the time in Florence. It goes by so quick and if it’s hot, it will slow down what you can see and do."}, {"username": "Brian Marcus", "comment_text": "We had the same struggle with wanting to spend more time to wander and shop and sightsee in Florence versus going to San Gimignano but SG was gorgeous."}, {"username": "Danielle Ritchie", "comment_text": "I have about the same time in Florence and I’m doing a half day trip to Pisa"}, {"username": "Emily Kelley Arrowood", "comment_text": "We enjoyed our day tour to Siena and San Gimignano."}, {"username": "Karen Schmidt", "comment_text": "We went on that tour as well. We loved it! More so than Florence actually. We are booking again for next May and are staying in Siena instead of Florence"}, {"username": "Bridget Gieseke", "comment_text": "Not sure where you’re traveling from, but if you’re flying into Florence…by the time you get your luggage and go through customs and get to your hotel it will be at least 3pm… if your coming from US, you’ll be exhausted. Not sure what’s important to you to see in Florence… ie the David or the Duomo… but there’s plenty to see… it’s a stunning City."}, {"username": "Frank Hunt", "comment_text": "You need a full day for those 2 towns with lunch and you will love it."}, {"username": "Jeanne Hendrickson", "comment_text": "I could have spent a week in San Gimignano just soaking up the atmosphere and scenery. Don’t skip it!"}, {"username": "Mick Konowal", "comment_text": "My opinion, been to Florence and Siena many times but I still go back. I’ve probably seen David six or seven times. They are amazing places to visit and each time I’ve had a different experience. San Gimignano is also beautiful but much smaller so don’t think you need to spend as much time there. I would concentrate on Siena and Florence (I think Florence requires more time than Siena) and may be half day in San Gimignano. Either way, it’s Tuscany and you can’t go wrong! I believe the Academia where David\nresides is closed Sunday and Monday so make sure those aren’t the only days you are in Florence. Enjoy!"}, {"username": "Kristi N Doug Leonard", "comment_text": "In March, we had 6 full days in Florence & we did the Siena/San Gimignano/Pisa tour. Would never have done that if we only had 2.5 days to enjoy beautiful Florence. Highly recommend a small tour to see the David, walk over/take pictures on the famous bridges & of course see the Duomo."}, {"username": "Ellen Edmonds-Wilson", "comment_text": "Florence is wonderful and there is so much to see and do. Basically you have to decide if a full day outside Florence seeing beautiful things but rushing through is your style or not."}]}, {"id": "2195284454203966", "text": "Anyone with experience on getting Travel insurance with “Insured International” and “Travel Guard “ versus “Allianz “ ?", "link": "facebook.com/groups/1373361046396315/permalink/2195284454203966/", "likes": 2, "comments": [{"username": "Leslie BC", "comment_text": "I've always used Allianz and have been extremely satisfied"}, {"username": "Angela Genduso", "comment_text": "What if you have an existing illness?"}, {"username": "Alejandro Gabriel Valenzuela Anghileri", "comment_text": "I use Allianz when I go abroad and I think it's the best.\n\nThey even take my corpse home if I die 😆"}, {"username": "Linda Pitler", "comment_text": "I’ve had both Travel Guard and Allianz. The latter refunded every cent in February when I couldn’t go to London due to my Mom becoming ill. I had the former for an Italy trip last October but didn’t have to file a claim for anything.\nI liked them both. Pricing depends on your state laws which I wasn’t aware of."}, {"username": "Emma Jane Cross", "comment_text": "has anyone used Tick Travel insurance. ? and have any feedback?"}, {"username": "Pietro Adami", "comment_text": "I used Sevencorners several times, but honestly never needed it so …"}, {"username": "Pietro Adami", "comment_text": "By the way … if medical assistance is needed in Italy, it will be provided by hospitals or Guardia Medica at no, or ridiculously low, cost"}]}, {"id": "2195280327537712", "text": "We are taking a cruise next summer from Barcelona to Rome. After spending two days in Rome, we have been planning to go to Sorrento for 4 or 5 days to relax. I know the heat is going to be horrendous while we are there. Starting to think going north to Como Lake might be a bit cooler and more relaxing? Thoughts and opinions?", "link": "facebook.com/groups/1373361046396315/permalink/2195280327537712/", "likes": 1, "comments": [{"username": "Enrica Palla", "comment_text": "You don't need to move so far. Google \"foresta del Casentinese\": weather is far more cool and the place is astounding."}, {"username": "Erica Verde", "comment_text": "In this period also northern Italy is very very hot. For comfortable temperatures I suggest different locations in mountain or hill, at example Italy is full of beautiful medieval towns on the Apennines. Or you can consider a location on the Alpes"}, {"username": "Alessandro Iannelli", "comment_text": "it's hotter in the south and according to the most recent weather forecasts, the heat should be less severe in the north starting by the 19th or 20th, while the heat wave should last until the 25th in the rest of the country. so my suggestion is going north to lake como, or at least that's what i would do."}, {"username": "Alejandro Gabriel Valenzuela Anghileri", "comment_text": "I stayed three weeks in Como at my parents' home last month and it's hot like hell.\n\nBut not hot as south"}, {"username": "Stacy Derouin", "comment_text": "If you're going next summer, it may not be so horrendous as it is this summer, depending on what month you're planning. This summer is a pretty unprecedented heat wave-it's not normally THIS hot!"}, {"username": "Frank Hunt", "comment_text": "Not correct, the heat is not always extreme and summer starts in June, the Alfi coast can be cooler at times so don’t believe all the hype. If concerned travel early June and enjoy the nice weather."}, {"username": "Lisa Valdovinos", "comment_text": "I found Sorrento to be cooler. We stayed in Sant’Agnello which is a 20 minute walk to Sorrento. Hotel Villa Garden. Beautiful, great staff and a pool. My favorite place in Italy. Was much cooler than Rome."}, {"username": "Holly Weller", "comment_text": "Italian Dolomites"}, {"username": "Carmela Siniscalchi Frattellone", "comment_text": "I personally love Sorrento and would go there. I was just there in June and it wasn’t bad but out of the 3 days we went to the beach 2x and out hotel had a pool so that was part of the 3rd day for me. Look up La Badia hotel. It was clean and quiet."}, {"username": "Tami Fehn", "comment_text": "Do you mind telling what cruise line you are using? I’ve been looking at Mediterranean cruises."}]}, {"id": "2195088810890197", "text": "My family of 5 (3 teens ) will be coming to Italy in March 2024. We will have about 7 days to explore. Where should we go and what should we do? We are flying home out of Roma so that is definitely on the list", "link": "facebook.com/groups/1373361046396315/permalink/2195088810890197/", "likes": 7, "comments": [{"username": "Phyllis Snyder", "comment_text": "For your time frame- stay in Rome and explore nearby places."}, {"username": "Helen Tucker", "comment_text": "Venice, Florence, Rome"}, {"username": "Paul Capicchioni", "comment_text": "I could recommend several places, but assuming air time etc. very hard to do in day five days; previous comment also good advice.\nIn order to enjoy 🇮🇹;\nsay in 5/6 ideal locations would take a minimum of 14 days; any city in Italy in the north or south of Italy you have much traveling time if you want to travel inexpensively.\n🇮🇹😎"}, {"username": "Patti Farrell", "comment_text": "South of Rome. Warmer at that time. Naples, amalfi. Sicily"}, {"username": "Debbie Vinecour Halperin", "comment_text": "We did 8 days this past March and did Rome, Florence and one long day Tuscany tour that included Pisa, Sienna and San Gimignano"}, {"username": "Renee Tanner", "comment_text": "Make sure to do Gladiator School while in Rome . It’s my kids’ favorite memory from there."}, {"username": "Steve Grossman", "comment_text": "You have time to do Florence and Rome. And on the way down from Florence to Rome, you can see some of Tuscan towns."}, {"username": "Antonio Aloè", "comment_text": "Why the French seal you ask tourists?Buy a guide or google...🤭"}, {"username": "Sandra Maldonado", "comment_text": "With 3 teens, the question is: what do they like to do? Art, history, food, beach, nature?"}, {"username": "Lisa Valdovinos", "comment_text": "Sorrento has some nice beaches. Might be too far south for your trip."}, {"username": "Bennett Richards", "comment_text": "Pantheon. Over 2,000 years old. Looks almost exactly the same as it did 2,000 years ago."}, {"username": "Gayle Moores", "comment_text": "Depending on what your teens like there is plenty to see and do! In Rome Take a tour of the Colosseum. It is the largest ancient amphitheater ever built. Take a hop on hop off bus tour around Rome. They stop at different locations where each place has different landmarks to see.You take your time at each stop and the bus picks you back up at designated bus stops around Rome.\nA food tour is also another interesting thing to do.\nTake the fast train to Venice.Take the water bus and go to Saint Mark’s square.Explore on your own waking through the square and lanes.Take a gondola ride together. Visit the Islands Murano and Burano off of Venice! Take a boat ride there.Murano is where the famous Murano glass is made and you can watch them making hand blown glass at the Murano glass factory."}, {"username": "Heidi Maria Farrugia", "comment_text": "Have a look Vanniny in Valdera Tuscany they have many properties and Elisa Vannini will gladly help you I am sure to do a plan !! She’s very good 👍 Highly recommend"}, {"username": "Joe Guzzi", "comment_text": "Gardaland"}, {"username": "Bennett Richards", "comment_text": "Pantheon in Rome will be the most amazing edifice on the planet. Looks almost exactly as it did when Jesus was alive. Over 2,000 years old."}, {"username": "Greg Erikson", "comment_text": "If they have never been to Italy they should see Rome and then keep it close. Florence or Tuscany."}]}, {"id": "2195282210870857", "text": "I will be in Venice in the morning. Can anyone recommend a hotel at a great location in the $300 a night range.", "link": "facebook.com/groups/1373361046396315/permalink/2195282210870857/", "likes": 5, "comments": [{"username": "Jane Lisa", "comment_text": "Anything decent is booked by now. Hope somehow you get lucky."}, {"username": "Brad Nelsen", "comment_text": "Hotel Moresco"}, {"username": "Christi McLachlan Manson", "comment_text": "look on expedia"}, {"username": "Linda Chase", "comment_text": "Hotel Principe"}, {"username": "Deborah Probert Medina", "comment_text": "Does anyone know the San Moise Hotel? If so how was it. I guess last minute you can’t be too choosey"}, {"username": "Lisset Berdeal Sassi", "comment_text": "I just stayed at a hotel last week that was great . Great rooms, rooftop bar and very centrally located. It's called A La Commedia"}, {"username": "Lisset Berdeal Sassi", "comment_text": "Lisset Berdeal Sassi"}, {"username": "Lisset Berdeal Sassi", "comment_text": "Lisset Berdeal Sassi"}, {"username": "Mary Skvarch", "comment_text": "You can possibly find a place in Maestre in a pinch.\nOr a last minute cancellation might come up"}, {"username": "Jessica Petyo", "comment_text": "We just stayed at Sina Palazzo Sant'Angelo and had two Junior Suites on 7/4. Great location!! Staff was very attentive and the breakfast was really good compared to the two other hotels we stayed at in Florence and Milan. Looks like suites are $750/night, but the smaller rooms are less. They also provided us free water taxis to Murano (but Murano is kinda boring), and to the train station."}, {"username": "Deborah Probert Medina", "comment_text": "Walkable to everything?"}, {"username": "Jenny Frank", "comment_text": "my friends stayed the Best Western Olimpia and loved it."}, {"username": "Wallace Clavelle", "comment_text": "Airbnb it 🤔"}, {"username": "Erin Geraty- Durkin", "comment_text": "Hotel Aquarius"}, {"username": "Joanne Calzaretta", "comment_text": "Casa Nicola. We r booked there. Under $250. Looks very nice. Was recommended by someone on this site"}, {"username": "Lisa Valdovinos", "comment_text": "I just looked up the hotel we stayed in and it might be available but may be a bit more than you want to spend L’Orologio on the canal."}, {"username": "Karen Dwyer", "comment_text": "Try Hotel Aquarius"}, {"username": "Anthony Sperduti", "comment_text": "In the morning??\nWhy wouldn’t you book one months ago"}, {"username": "Sonja Thayer", "comment_text": "Carnival palace! Canal view , quiet central area and the best bathroom I have ever seen in a hotel!"}, {"username": "Debbie H DeLoach", "comment_text": "Hotel Al Ponte Dei Sospiri on Calla Larga San Marco"}, {"username": "Thomas Harris", "comment_text": "Hotel Flora. Excellent location. Good luck"}, {"username": "Neekita Naidu", "comment_text": "Just stayed at La Residenza it’s stunning at 177 per night I got"}, {"username": "Frank Hunt", "comment_text": "So 1 days notice, nope!"}, {"username": "John Feudo", "comment_text": "We just stayed at Hotel Campiello and loved it. Just off San Marco."}, {"username": "Val Kilgallon", "comment_text": "Hotel Paganelli - budget hotel but clean and nice. 125E for 1 night, double bed room (courtyard view but hotel faces Venice Lagoon). Good location. Right next to vaporetto stop. 5 min walk, maybe, from St Mark's - over 2 bridges and you are there, easy walk!"}, {"username": "Gemma McQuoid", "comment_text": "Has anyone ever stayed at the Montecarlo?"}, {"username": "Chuck Morton", "comment_text": "How do you not plan more than a day ahead? Sorry if someone already asked this...."}]}, {"id": "2195139830885095", "text": "Did anyone take the Colosseum night tour? How was it?", "link": "facebook.com/groups/1373361046396315/permalink/2195139830885095/", "likes": 2, "comments": [{"username": "Jessica Li", "comment_text": "Following"}, {"username": "Jeff McLellan", "comment_text": "We took it in Italian (was all that we could book). We loved being in there with almost no one else was a pretty surreal experience."}, {"username": "Victoria Laverty", "comment_text": "Brilliant"}, {"username": "Lisa Martinson", "comment_text": "Yes and it was dark so I liked the day tour better."}, {"username": "Kathleen Steffey", "comment_text": "Yes. Unbelievable!"}, {"username": "Gemma Varone", "comment_text": "Can anyone tell me the best provider to book through? I'm currently looking at Coop Culture, but not sure if that's the way to go."}]}, {"id": "2195139684218443", "text": "Has anyone stayed at “n-space Rome guestrooms”? It will just me myself and my partner for 3 nights. We plan to walk most places. Would you recommend? There aren’t many google reviews, but there are a lot on bookings.com", "link": "facebook.com/groups/1373361046396315/permalink/2195139684218443/", "likes": 0, "comments": []}, {"id": "2195130174219394", "text": "Heading to Rome next week with my 9 year old, our Air BNB has AC, but no pool.\n\nBeing out in the mid day peak heat is an absolute NO due to health issues, but the thought of missing 5 hours a day (times 3 days) of time that we’d otherwise be sight seeing is a real bummer…\n\nColosseum your is scheduled at 9 am one day.\nVatican at 7:30 one day.\nNightआणखी time Vespa tour one day.\n(Hoping these times and tours will be enjoyable enough give that they’re not in the hottest part of the day)\nPlanning to do other sightseeing very early morning and after 5/6pm.\n\nWhat recommendations can you give me to do during the day to cool off other than just rest at the Air BNB?", "link": "facebook.com/groups/1373361046396315/permalink/2195130174219394/", "likes": 13, "comments": [{"username": "Janice Rea", "comment_text": "Underground tours. Golf cart tours."}, {"username": "Laurel Cotton", "comment_text": "Maybe an underground tour of the catacombs?\n\nWe also did this indoor activity with our 8 and 10-yr olds. It held their attention.\nhttps://\nwelcometo-rome.i\nt/"}, {"username": "Lisa Jones", "comment_text": "We just got back from Rome ❤️ your tours are at a similar time to the ones we took. It was hard to muster up the courage to do the Roman forum and Palatine Hill after the Colosseum so we spent a small fortune on a gorgeous refreshment break inside at one of the cafes facing the Colosseum in between and ate pancakes, had cold drinks and sat in the aircon! We did this kind of cooling off break often and also ate a lot of gelato!"}, {"username": "Kyna Martin Autrey", "comment_text": "I normally won’t waste time napping mid day on vacation but after 3-4 hour tours early in the morning heat and then lunch with a cocktail, the kids and I loved doing back to the AC for a little nap before heading back out"}, {"username": "Kristin Bawden Larson", "comment_text": "The catacombs we’re about 60 degrees a few days ago when we went! Interesting, and a super great way to cool down! 🙂"}, {"username": "Yvette Pavone", "comment_text": "I wish I could offer you some better advice but I’ve never been to any museums in Rome. Most of the stuff that I take visitors to see is outside."}, {"username": "Karen Blackmore", "comment_text": "Someone previously posted this useful link to pools in Rome https://\nmamalovesrome.co\nm/\noutdoor-swimming\n-pools-rome/\n?fbclid=IwAR13C8\nCevBkEmNyAD2ZL3\nelybmAY-CcjTT_P\n1hOaoPTbdCpdEEu\nBAoEwPfI"}, {"username": "Lucia Evangelista", "comment_text": "You’ll probably find that the pool is unbearable too, as is going to any beach. This weather is relentless and not for the faint hearted.\nWe go out early morning and by 11 max are back home until 7pm then go out again… (me: 56, daughter: 19)."}, {"username": "Sarah Emerson Nelson", "comment_text": "I am back from Italy a week ago, and I either spent afternoons under an umbrella or shaded in some way in a cafe (sometimes overpriced but you only live once), or back at a hotel resting or pooling. It was the only way to beat the heat. I didn’t feel the meat not sad about it because I am RARELY out and about at night back home for days on end so found that that made up for the missed afternoon time.\n\nIn addition, I think we all, myself included, overplay or overdo the tourist attractions feeling like we may never return. Instead if we focus on embracing the local culture we would enjoy our time a lot more. So maybe do a touristy thing in the morning, rest in the afternoon, and enjoy the evening as locals do - especially if you get out of the tourist zone:\n\nThat said, if you can fit it all in and don’t need a vacation from your vacation when you return, you do you in whatever way makes sense."}, {"username": "Elena Innocenti", "comment_text": "Villa Borghese park. And you can also go to Galleria Borghese Museum,"}, {"username": "Fiona Waterland", "comment_text": "Are there any air-conditioned\nmuseums? I found them very useful in Athens and Phnom Penh."}, {"username": "Ellen Edmonds-Wilson", "comment_text": "National Museum has great air con and interesting art - many modern pieces and over 300 Picasso. You could also go see a movie - just choose one that’s showing it in original form rather than dubbed into Italian"}, {"username": "Beverley Milson", "comment_text": "Santa Marinella has a sandy beach about 35 minutes by train from Rome. Small cafes/ bars nearby.\nWe found a tour of Rome’s catacombs was fascinating… history & early Christian church there… underground so cool."}, {"username": "Paul Davis", "comment_text": "Cancel Rome and head to the Alps. Temps in the 70s every day. Look at Ortisei or Cortina d’Ampezzo. Stunning! Places you’ll never forget!\nWalking around in the 90s and even 100s is nuts…IMHO."}, {"username": "Jan Fargo", "comment_text": "So some inside things like museums, and lots of interesting things inside are free or a small fee."}, {"username": "Joe Guzzi", "comment_text": "Long lunch."}, {"username": "Jenn Bildersee", "comment_text": "Was there last week with my 11 + 13 yos. Afternoon breaks are key. Don't feel bad about \"missing out\" - when we tried to push through, it made everyone exhausted and crabby. The things that helped us most were: constant drinking water, bringing a bottle to fill at the fountains, frequent stops for gelato, sitting down to have a cold soda, hats / sunscreen, cool clothing, and we carried a tiny spray bottle to mist ourselves. 🙂 You don't have to skip Rome or spend your time hunting for a pool, just stay super hydrated, rest BEFORE everyone feels miserable, and do what feels fun and good rather than trying to do it all"}, {"username": "Dan Baron", "comment_text": "Catacombs are very cool all day. Borghese gardens has lots of shade, and the museum there will be less crowded than Vatican. Golf cart tour…at least you’re moving with a bit of breeze?"}, {"username": "Jacquie Johnston", "comment_text": "Jump in your shower an then take a nap 💤"}, {"username": "Ann Brahmani Bost", "comment_text": "Everything is open late. You can go out in the evening and nap in the afternoon."}, {"username": "Sally Warren", "comment_text": "Museums"}, {"username": "Frances Younger", "comment_text": "May I suggest you bring - Personal fans (I prefer ones that use USB charging over battery operated), \"cooling towels\" and refillable water bottles.\n\nYou might want to research best clothing fabric for hot weather.\n\nHave a wonderful trip!"}, {"username": "Carol Scime-Raiford", "comment_text": "Another suggestions is to visit Tivoli Gardens. It’s beautiful and “cool” with all the fountains, and water displays & foliage. It’s about 1 hour away by train, 40 min by car or bus perhaps you can arrange with a tour company or hotel or go on your own via train.The quickest way to Villa d'Este from Rome is to catch a direct train to Tivoli station from Termini or Tiburtina. The site is just a short stroll from there. Alternatively, you can catch the Metro Line B to Ponte Mammolo and then get the bus marked to Tivoli. (Not sure of the price) I was there my first time as a young girl and loves it."}, {"username": "Debbie Jones Schilling", "comment_text": "I’ve seen some night time tours of Rome and other cities that look interesting. Would definitely be cooler."}, {"username": "Margie Franzen Springelmeyer", "comment_text": "Pack a little inflatable pool to enjoy at your AirBNB for afternoon breaks!"}, {"username": "Grace Scinto", "comment_text": "Think and act like the locals. The 2-4 hour after lunch break is designed for a nap or rest. Then you go out and wander around till 10 o’clock. You’ll manage to see what you want."}, {"username": "Pam Neary", "comment_text": "You could visit museums. They are generally air conditioned. Take a trip to the coast, it’s only half an hour away on the train 😊"}, {"username": "Mimi Imelda", "comment_text": "In hot European and African countries the locals live as such in the morning and evening when it’s not as hot although it can still be in the mid to high 30s then. Unfortunately we have to either deal with heat or do the same. It’s a different way of living life for you to experience and enjoy in a way that you never would in your own home climate. Rest somewhere cool when it’s too hot for your daughter and then being out late at nights and the early mornings won’t impact too much on having a great time"}, {"username": "Amy Kaye", "comment_text": "I am worried for you - if you cannot be in the extreme heat due to health issues, I think you will have issues. I'm here now and it doesn't matter what time of day, the heat and walking is almost unbearable to me. I am only here in July due to my son's limited schedule (we are visiting him and wife here), and I would never do it again. I wish you well on your trip❤️"}, {"username": "Margaret Crawley", "comment_text": "Google public pools in Rome Italy, and you will find a list and a map of places you can check. Admission prices and hours are listed. There is also a water park—a great opportunity to meet locals too. Guaranteed bragging rights for a 9 year old when school starts again!"}, {"username": "Bee Dub", "comment_text": "I would definitely say don’t feel bad about resting. We went to the Colossuem today but I opted to return back to my hotel while the rest of my party toured. They agreed they should have done the same. They told me they had to stop multiple times just to make it back to the hotel. The ambulance was out there because ppl kept falling out. If you decide to be out, stay hydrated for sure. They said they had to pour water on their heads quite a bit a long the way."}, {"username": "Renee Tanner", "comment_text": "Gladiator School"}, {"username": "Stephanie Sobocha", "comment_text": "I just got back from Rome a few days ago and the heat was really rough, especially for the kids. We are from AZ and this was way worse for us.\n\nIf you have an option we ended up changing hotels to the Crown Plaza because they have a huge outdoor pool. It was the best thing ever for the kids. We ended up having an entire pool day the day it got to be 100 degrees, that pool saved us.\n\nTake breaks during the day and drink tons of water. We saw several ambulances and people fainting from the heat."}, {"username": "Rachael Richardson", "comment_text": "Hydromania if it is open ! Water park saw an ad !"}, {"username": "Charleen Siegler Schuss", "comment_text": "Hit the beach in Ostia a charming town by FCO"}, {"username": "Sigrid Cormier", "comment_text": "Google Rome outdoor public pools. See if there is one close to where you are staying. Could spend the day at the pool and your evening plans going out."}, {"username": "Rhona OConnor", "comment_text": "Rome is a ancient city...... Swimming pools were not invented when the Romans built it. Don't expect the old city to have pools...... Stay outside the old areas if you want modern things. That's the charm of visiting these amazing places..... Its different from home!!"}, {"username": "Jerry Lyubelsky", "comment_text": "We just returned from Rome for 4 days we were out early as well to 8-9am back in the room by two or three for a break back out at 7 PM for dinner and additional nighttime sightseeing. We don’t feel like we missed anything."}, {"username": "Jan Armstrong", "comment_text": "We rested in the afternoons. Then felt refreshed for the evening. We also used Uber a couple of times so we weren’t tired out too early on. Our Collosseum metro return fare for 4 people was 12 euros incl the 25 min walk to our nearest metro. We wished we had got an Uber for 13. Euros each way. Yes more expensive but the Ubers were reliable and air con."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Consider visiting Villa Borghese, the museum is stunning and gives access to the park and zoo, still hot but in the shade.\nAnother possibility if your kid isn’t afraid is a visit in the catacombs, it should be 18/20 celsius degrees max. Catacombe di San Callisto are great!"}, {"username": "Christine Malota- Kendall", "comment_text": "Go to a grocery store/market and make something when you’re resting. Take a cold shower and gather your energy… head out late afternoon and enjoy! We did this last year in Florence and plan to do this again in Rome in august."}, {"username": "Miriam McNally", "comment_text": "The church of San Clemente is a hidden gem in Rome, not sure if it will be near you, but cool in midday heat, has brill underground excavations https://\nbasilicasancleme\nnte.com/eng/"}, {"username": "Miriam McNally", "comment_text": "Also, there's an underground museum under Piazza Navona. I think get out v early each morning, like 8 or so, back for rest in afternoon, then nice shower and out for dinner and sightseeing. Colosseum by night is magical (and they do night tours tho I haven't been on that)."}, {"username": "Carol Scime-Raiford", "comment_text": "Not sure if you have the time to go to the beach one day but Sperlonga is a blue flag (Bandiera Blu) beach: designated for its cleanliness and water quality. 90 minutes from Rome by public transport, it stretches the limits for a day trip. But for clear, shallow waters in a stunning setting – especially at the far southern end near the Grotto of Tiberius – it ticks the boxes. (The closest beach is Ostia 30 min away but that one would be the most crowded or 1 hour away is Anzio which is a good beach as well)"}, {"username": "Bob Sullivan", "comment_text": "Frequent gelato breaks and a portable water bottle to refill at the useful fountains!"}, {"username": "Stacy Giammarino Betty", "comment_text": "Do any of the hotels specifically the crowne plaza offer day passes to use their pool? I know some hotels do this so maybe that’s an option??"}, {"username": "Letisha Withrow", "comment_text": "Santa Marinella beach was pretty nice"}, {"username": "Lisa Silverman", "comment_text": "These are not trips for children, especially in the heat of summer."}]}, {"id": "2195069650892113", "text": "Has anyone from the US traveled to Italy with an infant? My son will be 9mo when we go and I am quite anxious about a few things:\n\n1) His formula. How much should I pack of that? We will be there 12 days.\n\n2) the drastic time change interrupting his sleep schedule. Tips on how to get back to our usual routine once we are back stateside?\n\nAny other suggestions or helpful tips on traveling abroad with a baby would be greatly appreciated. Thank you in advance😊.", "link": "facebook.com/groups/1373361046396315/permalink/2195069650892113/", "likes": 2, "comments": [{"username": "Bee Dub", "comment_text": "I am currently here with my 6mos old.\n\n1. I brought 4 cans of the 12oz formula. We have been in Europe for 12 days as well but in different parts.\n\n2. Surprisingly he adjusted well to this time. He slept on the flight and our flight landed in the morning and we were on the go. So when his body was tired, it was bed time anyway. When he took a midday nap, I just made sure it wasn’t too long.\n\nWe leave tomorrow, so we’ll see how he adjusts back home."}, {"username": "Alejandro Gabriel Valenzuela Anghileri", "comment_text": "I think children are far more adaptable about jet lag than adults"}, {"username": "Abby Fischer", "comment_text": "Following!"}, {"username": "Abby Fischer", "comment_text": "I’ve heard it’s easy to buy formula and diapers once there (of course packing enough for the flight, etc.). Have others done this?"}, {"username": "Debbi Burrill Gilbert", "comment_text": "I lived in Italy when my son was born and traveled to and from the US multiple times. My advice is to get a bulkhead seat, there is more room and some airlines have bassinets that attach to the bulkhead after take off. This allows babies to lay flat and sleep. Also, to help with the change in pressure when the plane takes off and lands have a bottle ready-the sucking helps their ears pop."}, {"username": "Caitlin Lux", "comment_text": "We travelled when my son was 12 months to Europe and I had not started him on cows milk yet in case there were any issues with that. I started buying European style formula about a month before our trip and then just purchased formula there (we were quite lucky that he was never picky and never had tummy issues when switching-we ran the gamut during the bad formula shortages). We packed about 3-4 days worth of diapers and 2 packs of wipes and bought the rest there. We stayed for 3 weeks. Also, did not have too much issue going to Europe as we live in the Midwest and flew overnight (direct) and he slept almost the entire flight. Coming back the flight during the day was pretty much during nap time so he slept about 4 of the 8 hours. A few wacky nights of him waking at all hours but we left ourselves a weekend at home before jumping back into our routine. It was admittedly rough at the time but now such a blip that I can’t even remember details. All the luck and enjoy!"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "In any case if you have to buy it here buy it in supermarkets, the same stuff in pharmacy will be way more expensive.\nI think all depends on where is cheaper and if, once you’re here, you’ll have the time to buy it. Check on amazon.it for a glimpse of the prices (usually supermarkets are cheaper because they have discounts, but amazon can give you an idea)."}]}, {"id": "2190218988043846", "text": "Hotel Touring or Hotel Metropolitan in Bologna? I just can’t decide", "link": "facebook.com/groups/1373361046396315/permalink/2190218988043846/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.dpbolvw.net/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187801-d2027\n79-Reviews-Bout\nique_Hotel_Re_E\nnzo-Bologna_Pro\nvince_of_Bologn\na_Emilia_Romagn\na.html"}, {"username": "Miyuki Kanno Paul", "comment_text": "Choose by the size of the room"}]}, {"id": "2195024287563316", "text": "Hello! I’m looking to plan a trip in September to Northern part of Italy. I haven’t decided on cities yet or location but I know I’d like this trip to be at least north of Rome up to the Switzerland border somewhere. Loooking for recommendations!\n\nThanks in advance ❤️", "link": "facebook.com/groups/1373361046396315/permalink/2195024287563316/", "likes": 4, "comments": [{"username": "Carine Brys", "comment_text": "Lago Maggiore and a trip to the islands on that lake. Stresa has fancy hotels."}, {"username": "Beth Spiehler Selvia", "comment_text": "Enjoy a few days on Lake Como!"}, {"username": "Connie Wilson", "comment_text": "Val d’Aosta is an amazing province with beautiful lakes and mountains. The town of Aosta is known as the Rome of the North for all its Roman ruins. You can easily reach Mt. Blanc from here too. Piedmont is another great place to visit, from its beautiful capitol of Torino to vineyards, mountains and lakes. Lago d’Orta and Maggiore are lovely destinations away from crowds."}, {"username": "Sandra Timi", "comment_text": "Bologna, Venice, Trieste, Slovenia and over to Austria onto Switzerland"}, {"username": "Sande Ricci", "comment_text": "Spend some days in Milan. I know people say to skip it. Don’t. It’s an amazing metropolitan city. Check our Rick Steves on Milan on you tube."}, {"username": "Lisa Valdovinos", "comment_text": "Venice was lovely"}, {"username": "Miyuki Kanno Paul", "comment_text": "•Genova. Loaded with UNESCO sites. Easy access to Cinque Terre to the south and all the way to French borders to the west.\n•Lake region such as Lake Garda, Lake Maggiore, and Lake Como.\n\nNo matter where you go, it’s going to be hot everywhere in Italia"}, {"username": "Sonja Thayer", "comment_text": "Check out Gradara and the Conero Peninsula! Sirolo beaches are lovely. Lake Como area is wonderful. We stood in Onno just a 15 minute drive to Bellagio and it was beautiful."}, {"username": "Sam Sabrina Haney", "comment_text": "Varenna on lake Como was a great place to relax for a few days after a tour. Very slow paced compared to the larger towns but accessible to them by a short ferry ride."}, {"username": "Pauline Fenech", "comment_text": "Lake como"}, {"username": "Beverley Milson", "comment_text": "Venice, Verona, Bergamo, Varenna on Lake Como… all on train line. Also from Varenna train north to Tirano where Bernina Express can take you to St Moritz & beyond."}, {"username": "Beverley Milson", "comment_text": "Venice, Verona, Lake Como. Train from Varenna to Tirano… Bernina Express into St Moritz in Switzerland a possibility."}, {"username": "Jennifer Foster", "comment_text": "Milan then train to Zermatt in Switzerland, nothing like it and well worth the trip"}, {"username": "Marika Radich", "comment_text": "In May I stayed in Stresa which was stunningly beautiful and not too busy at that time of year.\nAlso lucky enough to visit Bologna which was fabulous , a great vibe , wonderful architecture and had the most delicious food."}]}, {"id": "2193906174341794", "text": "Florence Pro tip: Discovered amazing hidden spots for breathtaking rooftop views of the Duomo.\nMost people suggest walking up to Michelangelo Hill which has magnificent views of Florence. But if you areआणखी limited on time or take a break from walking you can go to the rooftop cafe of the Rinascente department store in Piazza del Repubblica (pic#1). There's no coperto (cover charge) & you can just have an espresso. (After 4pm is your best bet & they don't bother you)\nAnother hidden spot (I say hidden because I was shocked how few people were at both locations) is the \"Views on Art\" rooftop bistro at the Hotel Medici (pic #2). There was no hostess or waiters at the time, so we didn't order anything, just took a few pictures & soaked up the jaw dropping views.\nI considered not posting about these amazing spots only so they don't get over crowded thanks to social media but wanted to give back to this great group!", "link": "facebook.com/groups/1373361046396315/permalink/2193906174341794/", "likes": 383, "comments": [{"username": "Hanna Baum", "comment_text": "Thank you for sharing 😊"}, {"username": "Erin Mitchell", "comment_text": "Lori Wroblewski"}, {"username": "Darleen Jones Ellisor", "comment_text": "Jamie Derrick Moore"}, {"username": "Ann Andersen", "comment_text": "Rhonda Diehl"}, {"username": "Ann Andersen", "comment_text": "F"}, {"username": "Shaun Fagan", "comment_text": "Deborah Fagan"}, {"username": "Lisa LeChill", "comment_text": "Quick take your post down now!!! Don’t let the secret out lol"}, {"username": "Nat Alie", "comment_text": "Kirstie Lee"}, {"username": "Lyn Wise", "comment_text": "The Rinascente will only allow you to go up one at a time, unless you go up after 4pm (or have a lunch reservation)"}, {"username": "Nancy Lembo", "comment_text": "Thank you for sharing! 😊"}, {"username": "Lyn Bee", "comment_text": "Thankyou! We will be there in a few months so will check it out!"}, {"username": "Jeff Cobb", "comment_text": "Thank you for sharing!!!"}, {"username": "Gina Johannes", "comment_text": "We went yesterday as well. Lovely!"}, {"username": "Kirstie Lee", "comment_text": "Melissa Durbridge"}, {"username": "Athena O'Connor", "comment_text": "Thanks for sharing. I will check it out when we go 😊"}, {"username": "Maggie Kane", "comment_text": "Great share!"}, {"username": "Terry Pisano", "comment_text": "Adding to my Florence walking tour. Thanks!"}, {"username": "Elizabeth Bernal Bain", "comment_text": "Dwight Jason Bain"}, {"username": "Kathy Brooks Taveira", "comment_text": "Thanks!"}, {"username": "Katherine AliNuñez", "comment_text": "Thanks"}, {"username": "Pamela Heldenbrand", "comment_text": "We read about the rooftop cafe at the Rinascente Department store in a travel publication and visited in 2008, so you’re not letting the cat out of the bag. 😀. Great photos!"}, {"username": "Catherine Shand-Pollock", "comment_text": "Thank you Ann...Will definitely check these out in October x"}, {"username": "Kostas Kanellopoulos", "comment_text": "Melissa Emilia Bevacqua"}, {"username": "Liza Ciaccio", "comment_text": "Lori Sirois Ciaccio"}, {"username": "Shireen Leonard", "comment_text": "Thank you for sharing!We are in Florence right now 🤗"}, {"username": "Marion McGrath", "comment_text": "The library also has an amazing view of the Duomo and a cafe."}, {"username": "Nauman Khan", "comment_text": "Nauman Khan"}, {"username": "Nauman Khan", "comment_text": "Nauman Khan"}, {"username": "Nauman Khan", "comment_text": "Nauman Khan"}, {"username": "Daniel Kassie Karstens", "comment_text": "Marlo Möller Karstens"}, {"username": "Nicole Vidiri Silva", "comment_text": "Matthew Silva Grace Nupieri Silva Louis Silva 😍😍"}, {"username": "Tahera Begum", "comment_text": "Thank you for sharing 👍🏻 so looking forward to visiting Florence for a day trip in august 🙂"}, {"username": "Julie McDonnell", "comment_text": "Emily Gruber Mirjalili This is what I was talking about!!"}, {"username": "Kathy Kibbe", "comment_text": "We had the BEST cocktails on the Renascente rooftop🥰"}, {"username": "Anne Brooks Easter", "comment_text": "Anne Brooks Easter"}, {"username": "Sylvia Kotsopoulos Vocino", "comment_text": "Matt Vocino"}, {"username": "Tracy Foss", "comment_text": "Thank you for sharing! Tips written down !"}, {"username": "Nicole Smith", "comment_text": "Thanks Ann, will go there in September 👍"}]}, {"id": "2194414447624300", "text": "Hello all! Want to select 3 regions/towns as hubs for day trips via train. Love the smaller towns, have been blessed enough to visit the big ones! I know, so broad, but just putting It out there for the more seasoned travelers. We'll be coming from Croatia (bike trip)! Thinking Italian Riviera, Mountain District, Umbria.....but we are totally OPEN! TIA!!!!! Oh, it will be fall or next year!\nEDIT: we won’t be strictly biking on the Italy visit! We will be traveling via train and hubby will rent bikes when appropriate! Sorry I was unclear!", "link": "facebook.com/groups/1373361046396315/permalink/2194414447624300/", "likes": 4, "comments": [{"username": "Linda Brecher Bekoff", "comment_text": "We stayed in Cortona. Great access to Umbria and Tuscany but only with a car. We also loved Alba and Asti up North- both accessible to trains."}, {"username": "Francesca Russo", "comment_text": "Orvieto (Umbria) is a small town but really suggestive.\n\nIdk if it’s easy to go by bike but I don’t think so."}, {"username": "Jim Kelleher", "comment_text": "I always recommend Castiglione del Lago on Lake Trasimeno."}]}, {"id": "2194920200907058", "text": "Hello everyone, just wanted to warn you about a restaurant in Verona situated in Piazza Bra , it is called Mamma Mia . They made us pay 2 the bill . Although we call them before leaving Italy e they told my husband they will send back our money we didn’t received anything, then we also right them on WhatsApp and sent also a mail but they don’t respond .keep safe e stai alert on the payment you make ..", "link": "facebook.com/groups/1373361046396315/permalink/2194920200907058/", "likes": 1, "comments": [{"username": "Alessandro Iannelli", "comment_text": "So, if I understand this correctly, you paid the bill twice by mistake and they refuse to reimburse you? If I got this right, you may want to considere contacting the Italian police by mail or maybe also the credit card company, depending on the situation."}]}, {"id": "2195013510897727", "text": "Foer those of you who share my love of all things Italy I just wanted to share with you a beautiful series I just finished watching on Netflix, it's called \"From Scratch\", apart from the beautiful scenery of Florence and Sicily its the most beautiful love story I have ever seen, you have to watch it!, it's exceptional ❤️", "link": "facebook.com/groups/1373361046396315/permalink/2195013510897727/", "likes": 278, "comments": [{"username": "Daryl Salese", "comment_text": "I loved it! Planning on rewatching and taking notes before our trip 😊"}, {"username": "Christy Vitale", "comment_text": "Also watch on HBO, set in Italy.\nMy Brilliant Friend"}, {"username": "Voula Ladas", "comment_text": "Agree . It’s a great movie ."}, {"username": "Sue Dolman", "comment_text": "Thank you"}, {"username": "Kathleen Coleman", "comment_text": "I loved it too❤️"}, {"username": "Susan Jeans", "comment_text": "Loved it"}, {"username": "Cindy Giuliani Buda", "comment_text": "Sooo good & also sad"}, {"username": "Melissa Crewe", "comment_text": "Vix Louise our next watch? 😍"}, {"username": "Barb Thompson", "comment_text": "Loved it."}, {"username": "Pauline Putt", "comment_text": "Oh my that series made me sob. Beautiful series. Loved it"}, {"username": "Jennifer Belvick Link", "comment_text": "So sad but the most beautiful love story I’ve ever seen. Love, family, friends…it’s just beautiful."}, {"username": "Esther Salameh", "comment_text": "I love this movie Too"}, {"username": "Jillian Wilson", "comment_text": "Loved it too 🩷 can’t wait to experience the fresh produce of Sicily as a result."}, {"username": "Geri Desiderio-Muscara", "comment_text": "I read the book and it was also wonderful!"}, {"username": "Sandra Baxter", "comment_text": "I loved it!"}, {"username": "Kylie English", "comment_text": "Tony Browne Movie night?"}, {"username": "Katie Hardman", "comment_text": "Loved this series"}, {"username": "Donna Sanders", "comment_text": "I am trying to watch this now, having a hard time getting through the first episode because of her fathers attitude"}, {"username": "Laura Taylor Gregar", "comment_text": "Amazing it was"}, {"username": "Jan Buess", "comment_text": "Cried.every.epi\nsode!"}, {"username": "Renzi Rose", "comment_text": "I tried to find those areas in florence, but did not have any luck"}, {"username": "Mona Tobia", "comment_text": "Great mini series. Makes me want to look for books and/or movies set in Italy. We are going for our first time in October. Any suggestions?"}, {"username": "Theresa Wong", "comment_text": "Love the movie"}, {"username": "Joy Price Morriss", "comment_text": "I loved it!!!"}, {"username": "Amanda Douvos", "comment_text": "Just watched it so beautiful 😍"}, {"username": "Linda Deciccio", "comment_text": "Loved this series. A must see!👍"}, {"username": "Maureen Scott", "comment_text": "I just finished Paradise on PBS. Based in Naples. Very good"}, {"username": "Lilian Villarreal", "comment_text": "Thank you for the recommendation,\nI hope\nI’ll find it in Canada.\nI would like to ask if someone went to “Cinque Terre” lately? Do you recommend this place for next week?"}, {"username": "Nicky Firth", "comment_text": "Thanks for that - I’m going to take a look later"}, {"username": "Maria Davi", "comment_text": "I read the book. It is a true story. And, yes, the ending is heart breaking. But a beautiful story nonetheless."}, {"username": "Tammy Jo", "comment_text": "I watched this months ago but am currently watching again. I love it!!!"}, {"username": "Lyn Evans", "comment_text": "Oh I loved that series… real tissue job though. So beautifully filmed and acted."}, {"username": "Lois Letterie Cianci", "comment_text": "I downloaded it on my tablet and watched it on my flight home from Italy in October. I loved it!"}, {"username": "Clara Balzano", "comment_text": "Seen it, so beautiful and sad"}, {"username": "Tara Huss", "comment_text": "Thanks! Can’t wait to watch it"}, {"username": "Esmeralda Del Toro", "comment_text": "I’ll have to watch it, thanks 😊"}, {"username": "Cheryl Kavanagh", "comment_text": "Yes I agree 🙂"}, {"username": "Joe Laricchia", "comment_text": "Excellent movie"}, {"username": "Vera Feeny", "comment_text": "The memoir is really good too!"}, {"username": "Lena Conccicao", "comment_text": "Yes it’s a lovely movie but sad"}, {"username": "Debra Evans", "comment_text": "Absolutely gorgeous movie .. this movie made me love Italy even more .. 💗🇮🇹"}, {"username": "Felicia LoCascio Whitney", "comment_text": "Note to self. Do not watch on a plane especially if sitting next to a non relative. My poor seat mate thought I lost a family member I was sobbing so hard!"}, {"username": "Tony Etheridge", "comment_text": "Joanne Parkinson"}, {"username": "Sheron Milliken", "comment_text": "I loved it and felt it was well done…but have tissues nearby!"}, {"username": "Maryann D'Allegro", "comment_text": "Very sad!"}, {"username": "Lisa Lisa", "comment_text": "It was great"}, {"username": "Jules Blumke", "comment_text": "It is good."}, {"username": "Charlotte Ingram", "comment_text": "Loved it"}, {"username": "Carol Munyinyi", "comment_text": "What a sad love story"}, {"username": "Kate Geer-Armsby", "comment_text": "I ugly cried through most of it!! Yes it was beautiful but saaaaaad."}, {"username": "Cheri Kimple Travis", "comment_text": "LOVED IT!!!"}, {"username": "Tina Capozzola", "comment_text": "Speaking from personal experience, I would not recommend it to anyone who is newly diagnosed with cancer. This caught me by surprise and too close to home."}, {"username": "Laurie Monique", "comment_text": "I watched it. Ugh. It was wonderful."}, {"username": "Faye Pais", "comment_text": "Gorgeous and a sob fest!!!!!"}, {"username": "Christine Bernath Patti", "comment_text": "Letters to Juliett is wonderful too."}, {"username": "Marian Van Soelen Hand", "comment_text": "Just don’t watch on a plane or any public setting! 😭. But so, so good and makes you want to book a flight to Italy immediately! 🇮🇹"}, {"username": "Pam Bate", "comment_text": "Loved the movie, I’m reading the book, it’s really good. Highly recommend."}, {"username": "Joyce Studman Wishner", "comment_text": "Loved it"}, {"username": "Jan Warack", "comment_text": "Totally agree!!!"}, {"username": "Rayna Kerber", "comment_text": "Love that movie"}, {"username": "Teri Depree Martinez", "comment_text": "I agree!"}, {"username": "Kimberly Jerome Kiddle", "comment_text": "It’s a tearjerker."}, {"username": "Mary OLeary", "comment_text": "Mary OLeary"}, {"username": "Carola Blödgen", "comment_text": "A great Billy Wilder film \"Avanti, avanti\" with Jack Lemmon, it was shot on the island of Ischia."}, {"username": "Linda Papavero Snyder", "comment_text": "I loved it and I put Cefalu into our itinerary. We are going to be in Sicily for a week from September 1 to September 8. I have family in Marsala so we are going to spend four days in Marsala and then we are going to spend two days in Cefalu, and two days in Palermo and I cannot wait."}, {"username": "Lee Bailey", "comment_text": "I loved it 🥰"}, {"username": "Stephanie Fenton", "comment_text": "It was great, but definitely sad."}, {"username": "Janet Canter", "comment_text": "I watched it too. Enjoyed it but I had me in tears too."}, {"username": "Nadia Mckenna", "comment_text": "Beautiful series"}, {"username": "Dorothy Smith", "comment_text": "loved it"}, {"username": "Tricia Marshall", "comment_text": "The book is great too and it includes recipes!"}, {"username": "Heidi Hutson", "comment_text": "I just watched it too! Beautiful. ❤️"}, {"username": "Mary Keevers", "comment_text": "I agree I loved it too"}, {"username": "Susan Delli Colli", "comment_text": "Loved ìt!!"}, {"username": "Debi McGrath", "comment_text": "Loved that series."}, {"username": "Jude Finch", "comment_text": "Also highly recommend reading “Still Life” by Sarah Winman. Beautiful book based on a story set in London and Florence. One of my favourite books ever."}, {"username": "Angela Abbate Karklin", "comment_text": "I just started it!!"}, {"username": "Catherine Silvera", "comment_text": "It was ok."}, {"username": "Christine Malota- Kendall", "comment_text": "Loved it! And totally agree! Even my husband liked it!"}, {"username": "Paola Tulley", "comment_text": "I’m sorry you told us about the ending ……. 🤷🏻‍♀️. But I do appreciate you sharing information about Italy"}, {"username": "Linda Brecher Bekoff", "comment_text": "It’s based on a book, a biography. The author reads her own story if you get the audiobook."}, {"username": "Annette Sparks", "comment_text": "I loved it. Such a beautiful true story"}, {"username": "Meryl Blank Lewis", "comment_text": "Couldn’t watch the last episode. Too sad for me.😞"}, {"username": "Meredith Pastore Bleveans", "comment_text": "It gutted me. ❤️"}, {"username": "Cindy Voss", "comment_text": "I’m an ugly crier…so thankful I watched this alone!"}, {"username": "Jeanne Hannivig-jones", "comment_text": "Totally agree... tissues required"}, {"username": "Rena Harris", "comment_text": "Loved it! Cried my eyes out, but worth every tear!"}, {"username": "Tutti Burkett", "comment_text": "My favorite"}, {"username": "Jonalee Wilson Stephens", "comment_text": "Loved it:)"}, {"username": "Cindy Holtfreter", "comment_text": "Thank you for sharing this! I look forward to watching it!\n💕💜💕🙏"}, {"username": "Lorraine Bradley", "comment_text": "OK..\nAm going to do that right now because there's feck all on TV tonight\n📺😂👌"}, {"username": "Tahera Begum", "comment_text": "I have watched From Scratch twice and have also bought the book! ❤️This series is one of the reasons I’m going to Florence in august! So looking forward to it 🙂"}, {"username": "Amy Dobrigna", "comment_text": "OMG, loved it until I realized it doesn't have a happy ending. It's worth watching but be warned it will make you sob and totally ugly cry"}]}, {"id": "2195017164230695", "text": "Has anyone had any experience with flying from Sicily to Rome in the morning and flying back to the States in the afternoon. We are not checking bags. One flight would give us 5 hours and another 2 1/2 hours.", "link": "facebook.com/groups/1373361046396315/permalink/2195017164230695/", "likes": 0, "comments": [{"username": "Miyuki Kanno Paul", "comment_text": "Are both flights operated by the same airlines? Sicilia to Roma is a domestic flight, but you are connecting to an International flight. You may need to check in at the respective airline’s counter if taking a different airline(they do passport check), passport control, security screening, and proceeding to the gate. Usually boarding starts 50 minutes to an hour before departure.\nWhen we flew from Catania back to Roma, there was a major computer meltdown on the airline’s system and caused hours of delay. We were so glad that our return flight home was on the next day"}]}, {"id": "2195017694230642", "text": "Has anyone done a GAdventure tour - any tips or advice?", "link": "facebook.com/groups/1373361046396315/permalink/2195017694230642/", "likes": 1, "comments": []}, {"id": "2195021717563573", "text": "Hey guys , love this chat. Thanks for all your input.\nJust a question about the phone company “orange flex”. I’m with Telstra in Australia and they are far to expensive for the six weeks we are away. Any nice recommendations would be appreciated. Thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2195021717563573/", "likes": 5, "comments": [{"username": "Jennifer Cummings", "comment_text": "We arrive from Australia and go buy SIM card, cheap ."}, {"username": "Kerry Cofrancesco", "comment_text": "Lebara SIM card purchase a monthly at airport covers uk & Europe.unlimite\nd"}, {"username": "Douglas Martin", "comment_text": "Just get a sim and swap it on your phone for the time your away"}, {"username": "Leisa Davis", "comment_text": "I’m from Australia as well and will be using an esim from Sims Direct for my 5 weeks in Italy. No need to change the SIM card with an esim and I get to keep my phone number."}, {"username": "Grace Scinto", "comment_text": "TIM tourist sim. €15 for 30 days of phone calls and data. Get it when you arrive and switch the sims.\n\nhttps://\nwww.tim.it/en/\nlandline-mobile/\ninternational-ca\nlling/\nfrom-italy/\ntim-tourist"}, {"username": "Nicola Amy MacDonald", "comment_text": "Vodafone is what I used, I was there 5weeks €20 a month, 200gb of data was plus calls etc. I had better reception at times than my friends who live there that had different providers."}, {"username": "Neville Spargo", "comment_text": "We are from Australia and agree Telstra daily roaming charge is ridiculous! We have been traveling Europe for a couple of months now through various countries and I brought these sims from prepaid sims online before we left home . Got the 12gb Europe deal, they have worked so well . It is actually through Three UK , the sims last for 30 days so if away longer you need to buy multiple sims and state the start date of each sim when ordering online . Only supposed to be 12gb but I have got up to 28gb one month on one sim !\n\nhttps://\nwww.prepaidsims.\ncom.au/"}, {"username": "Alison Ahlberg", "comment_text": "Just be aware if you use an esim and don’t get your security texts from the bank they can lock your accounts whilst away\nWe’re from Australia as well but with Optus which was only $5/day so we went that way\nFriends with us had their cards locked as they couldn’t enter their net codes"}, {"username": "Kim Smith", "comment_text": "we are going for 6 weeks and we are also with telstra but this trip we are using simcorner...on line.look them up $30 for 30 days so we got 2 cards each"}, {"username": "Amelia Bonannella", "comment_text": "We too are with Telstra. If you go into Telstra, they can change your SIM to an eSIM. Switch the phone off when you get on the plane ✈️ to avoid the $10/day international roaming charge.\nWhen you arrive in Italy, buy a pre-paid SIM and put in your phone. If you use WhatsApp for communications with accommodation, tours and phoning home, it will still work on your Aussie phone number."}, {"username": "Carole Faulks Lear", "comment_text": "Leisa Davis how much is an esim & what site can you purchase one from please? Am also from Australia with Optus which is too expensive for the 8 weeks I will be travelling Europe & Nth Africa."}, {"username": "Ellen Edmonds-Wilson", "comment_text": "I used an Orange Holiday eSIM for two months. Much cheaper than Optus for me, and included calls and data, which many eSims don’t. You buy an initial time/data plan, then register your details for the extension for your preferred time. The top ups are cheaper than the initial eSIM. Check your phone is compatible first though."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2195024650896613", "text": "With 15€ take a drink and see the fountain😎", "link": "facebook.com/groups/1373361046396315/permalink/2195024650896613/", "likes": 75, "comments": [{"username": "Grace James", "comment_text": "🍻"}, {"username": "Eileen Felicelli", "comment_text": "Thanks for sharing that!"}, {"username": "Diane Hamilton", "comment_text": "Awesome.. thank you. Going for the first time in November 🇮🇹\nPerfect view"}, {"username": "Rachelle Ethington", "comment_text": "Deal! $25/ for a martini in Vegas, no view."}, {"username": "Mary O'Sullivan", "comment_text": "Stayed at this hotel - luved it - rooftop bar was a great plus and also that is where their breakfast was served"}, {"username": "Tara Roed", "comment_text": "Great idea!!"}, {"username": "Julie Keir", "comment_text": "Great little bar."}, {"username": "Nicolas Vanden Eede", "comment_text": "Marine Vanden Eede"}, {"username": "Viraf NZ", "comment_text": "Wish I knew before"}, {"username": "Jennifer Smith", "comment_text": "Do you have to be a guest at the hotel to access the rooftop bar?"}]}, {"id": "2195065087559236", "text": "5 days, clinque terre or almalfi coast for 2024. I've just been to Bologna and Florence but not down south of Italy a lot.", "link": "facebook.com/groups/1373361046396315/permalink/2195065087559236/", "likes": 4, "comments": [{"username": "Wolly Valentina Losi", "comment_text": "Amalfi e Pompei."}, {"username": "Tonsia Keytel", "comment_text": "Cinque Terre!!"}, {"username": "Cheri Kimple Travis", "comment_text": "I’m trying to decide too!"}, {"username": "Paul Vincent", "comment_text": "Cinque terre (whilst beautiful) is not south !...if you want \"south\"...try Puglia - Alberobelllo...\nLecce...etc..."}]}, {"id": "2195047614227650", "text": "Hi we're staying in Naples Tue-Fri next week and wanting to travel to Rome one day, Capri another and visit Vesuvius and Pompei. Does anyone have any advice the best way to do this please 🙏. Are trains and ferry's easy enough to book? *photo for the algorithm gods)", "link": "facebook.com/groups/1373361046396315/permalink/2195047614227650/", "likes": 1, "comments": [{"username": "Raf Gervasio", "comment_text": "Train to Pompeii\nFecciarossa train to Rome\nFerry from Naples port direct to Capri...you can do the same for Ischia and Positano....bee\nn told to book the ferry in advance"}]}, {"id": "2195050714227340", "text": "Last Installment!\nMy family of 5 (husband, me, 3 tween/teen boys) recently returned from a 3-week trip to Europe. We visited Paris, Venice, Florence, Pisa, Cinque Terre, Amalfi, Capri, Pompeii and Rome.\nThis group was so helpful in my planning, I thought I would give back by sharing my tips. I have so much to share that I’ve broken up my posts into Packing, Travel with Kids, and Itinerary Highlights. So here are my tips for:\n\n\nITINERARY HIGHLIGHTS\n\n\nVenice\nOur first stop in Italy. We toured the Jewish Ghetto, visited St. Mark’s Square and St. Mark’s Basilica, took the Doge’s Palace Secret Itineraries Tour and went on a gondola ride.\nThis is where – on our FIRST day in Italy, my kids informed me that they’re OVER museums and cathedrals and don’t want to learn anything. First day.\nSo…I think the biggest highlight for the kids was aimless travel on the water taxis. I say “aimless” because I cannot, for the life of me, read the water taxi map. I think one would need to speak fluent Italian plus have a degree in Advanced Nautical Navigation to figure out how to get from point A to point B. Luckily, we got the unlimited 48-hour travel card for 30 Euro, made sure to validate it, and then just rode it around until we got tired and meandered back to our place. It was perfect.\nBTW, since arriving back home, I’ve learned that there are viral TikTok videos of a woman in Venice screaming ATTENZIONE PICKPOCKET!! at would-be thieves. I should note that we didn’t see any pick-pocketers while we were there, but I’m kind of sad we didn’t see the woman, as she’s my new hero (And I’d also love to ask her what brand of caffeine she drinks)\n\n\nCinque Terre:\nWe used this website https://gangwaze.com/cruise-port-traffic\nto figure out which cruise ports would be busiest when, and then set our itinerary for Cinque Terre when the cruise traffic in that location was at a minimum. It worked really well as we had minimal crowds.\nOn our first day, we hiked from Corniglia to Vernazza. We went early (maybe 8 or 9am?) and the path was almost entirely empty, and then got increasingly busy as the day went on.\nOn our second day, we took the Cinque Terre train to Levanto and rented bikes, then rode on the converted 19thcentury railway track through tunnels to Framura. It was a flat 1-hour flat ride with amazing views and no crowds. I HIGHLY recommend this and thank whoever in this group suggested it.\n(One point of note: Levanto shops and restaurants close for their midday “riposo”. We learned this the hard way when we showed up at 1pm and everything was closed. Google is of no help in this matter, and will claim that the completely dark, boarded up bicycle shop you’re standing in front of is actually open! Avoid the inevitable argument with your spouse and visit Levanto either in the morning or after 3pm.)\n\n\nFlorence\nI really enjoyed and would recommend the Uffizi and L’Accademia Galleries. There’s also The Duomo, whose dome is an architectural and engineering marvel. We got tickets to climb the dome, and let me just say that I felt like an Olympian by the time I finished scaling the 400+ steps in the midday Tuscan heat. While taking in the sight of all of Florence laid out before my feasting eyes and waiting the 40 minutes to catch my breath, some of my guilt about my daily repeated intake of gelato, Nutella and all-carbohydrate pasta-and-white-bread dinners melted away. My kids enjoyed the Duomo and Bell Tower climbs a lot more than the art museums.\n\n\nPisa\nYou won’t be shocked to read that the highlight of our half-day in Pisa was climbing the Leaning Tower and also coming up with silly pictures of ourselves manipulating the tower in ways that didn’t include the hundreds of other people ALSO pretending to manipulate the tower for photos. Beholding the landscape, I was just as moved by the Leaning Tower as the scene of people half-frozen in their poses. We all looked like some horrifying combination of Twister and freeze-dance. I cannot fathom what aliens would think of our civilization if they visited Pisa on any given day.\n\n\nCapri\nIn Capri, we rented a private boat through Viator (Tour operator: We Capri), and I could see the pain in our captain’s eyes when we told him we wanted to go to The Blue Grotto. I used to live in NYC and exhibited the same anguished expression whenever out of town guests wanted to visit the Statue of Liberty. But our captain very kindly obliged and after warning us that the wait time could be 1 – 2 hours of pure motor-fuel scented misery, he piloted our boat to the Grotto, and voila, it wasn’t actually that busy. After 40 mins, we got our 5 minutes inside the Grotto and then toured the rest of the island. I think it’s a bit of a crapshoot whether it’ll be crowded but maybe it helped that we went on the early side and it was early June.\nAlso – and I know this is going to cause some controversy, but I have to say it – the best gelato of the entire trip that I had was in Capri. Unfortunately, I don’t remember the name of this place, so mystified was I by this marvelous, velvety substance melting on my taste buds that I wandered around in a stupor. The best directions I can tell you are to take the Funicular up and go to the gelato place across from the statue of the naked woman. I’m totally serious.\n\n\nAmalfi\nDo not go here if you’re allergic to lemons, hate the smell of lemons, have an unspecified aversion to lemons or are triggered by lemons in any way. I had no idea about the lemon thing before we showed up. Our place was right above lemon orchards, and I started to get the hint while showering with lemon-shaped soap after enjoying lemon-balls while drinking limoncello. By the end of your time here, you’ll be dreaming of lemons. I even broke down on the last day and bought a lemon-patterned dress. Why? I have no idea.\nOh right – itinerary highlights. If you don’t mind climbing A LOT, there’s a cantaloupe-themed (ha! Totally kidding!) lemon-themed restaurant. I’m sorry I’m so useless with names but it’s basically up the big hill and keep climbing (en route to the Valle dell Ferriere Nature Preserve). Once you’re dripping with sweat and questioning your decision to listen to me, you’ve arrived! It has 2 patios and around 6 delicious menu items that are all made from lemons.\nAlso, in Amalfi, we rented a private boat from a captain named Sergio, whose info I can pass along to whoever would like. He was great and took us on a 7-hour tour of the Amalfi coast. I could detect his great sense of relief when we told him we’d already been to the Blue Grotto and didn’t desire to go back. His boat wasn’t huge (in fact, the WeCapri boat was bigger) but reasonably fit the 5 of us.\n\n\nPompeii\nMost of the places we visited, we took small-group tours, but in Pompeii I booked a private tour that billed itself as “child friendly”. I booked through Viator and the local company is Italy Tours for Kids. This tour cost more than the others, but I booked it because my twelve-year old boy’s eyes welled up at the idea of seeing plaster casts made from the remains of deceased Pompeiians. I tried to remind him that Mt. Vesuvius erupted over two thousand years ago, and the Pompeiians would all be dead anyway – possibly in even more tragic and horrific ways – but for some reason, that didn’t make him feel any better.\nOur tour guide was named Rossana, and she was amazing. She was engaging, she asked the kids questions, she weaved video and photos in with her dialogue to keep it interesting. She was very knowledgeable and answered all of our questions. I highly recommend.\n\n\nRome\nAh, Rome. If you had asked me before we got to Rome about our experience, I would have said that everything was perfect. Perfect weather, perfect lodging, perfect food, perfect itinerary. Then we got to Rome, and, let me just say that this is where our luck ran out. About everything.\nI’ve already written another post about our lodging in Trastavere. I recommend staying at our place only if you like dysfunctional air-conditioning and a nonstop nighttime jamboree at decibel ten. Interestingly, some of the commenters did say THIS SOUNDS PERFECT FOR ME! And asked for the lodging details. So I guess one man’s exasperating, expletive-laden nighttime torture chamber is another man’s treasure.\nNow, let’s move to the weather. I find The Weather Channel app to be incredibly accurate here in the States. But apparently this technology can’t be replicated for Italy. The Weather app predicted rain for most of the time we were in Italy, and we didn’t get so much as an overnight sprinkle. Temps were in the 70s and sunshine was abundant. My husband and I kept saying to each other, Wow we are SO lucky! Then we got to Rome, where ALL THE RAIN we were supposed to get the previous three weeks CAME DOWN AT ONCE. We were on a Rome Street Food Tour and soon became saturated and blinded by the torrential downpour. For the three days we were in Rome, it rained 50 – 60% of the time.\nAnd…the food. I’ve heard it’s hard to find a bad meal in Italy, but leave it to my resourceful family to find one. We decided to try out a vegan restaurant that claimed to not have any common allergy triggers. Well, let me be the first to caution you: NEVER be the only customers in a restaurant in the center of a crowded town! That should have been our first indicator. And the prices were sky high too, considering that there were no actual ingredients in any of the food! Umm, ATTENZIONE PICKPOCKET!! But, I guess hungry people can make poor choices, so we rapaciously gobbled up our cardboard-tasting pancakes and eggless “omelets” and then fought each other, Roman Gladiator-style, for the prized bathrooms in our lodging. Whatever noises were going on in there were at least drowned out by the nonstop party going on outside. That’s all I have to say about that.\n(And, to preface any inquiries, I don’t know the name of this restaurant. We were busy and just hopped into an empty place. And PLEASE don’t message me THIS SOUNDS PERFECT FOR ME! Because I will know you’re trolling me and that’s simply not possible!!)\nAnd, oh right, the itinerary! How could I forget about our once-in-a-lifetime Underground Colosseum tour, which we booked MONTHS in advance that got canceled four days beforehand due to a nonexistent “political event”? My husband and I frantically searched for replacement Colosseum tours and were not surprised that everything was sold out. I called GetYourGuide in America and spoke to a representative who made good on his pledge to find our family a replacement tour. In the end, we got the Colosseum Arena floor but no Underground. Those of you who actually go on an Underground tour, please post your photos so I can simultaneously drool and weep at your good fortune.\nI don’t want to paint Rome as an entirely lost cause. We did have many good times there. We really enjoyed a pizza-making class and the previously mentioned Colosseum and Street Food Tours. We climbed the Spanish Steps and threw pennies in the Trevi Fountain. We toured the Vatican, St. Peter’s Basilica, Pantheon and Sistine Chapel.\nSo Rome, like the rest of Italy, was filled with great times and memories. Almost all of the food was amazing, the ruins were incredible, the sights were stunning. Yes, we were happy to be back in the USA, with its prevalence of clothes dryers and predictable weather patterns. But Italy will always live in our hearts, and there’s so much more to the country that we haven’t explored! I’m already fantasizing that my next novel will land me a book tour to such fabulous places as Sicily, Milan, Lake Como and Sorrento. And while that’s basically a pipe dream, our pennies in the Trevi Fountain have superstitiously assured us that we will be back!", "link": "facebook.com/groups/1373361046396315/permalink/2195050714227340/", "likes": 774, "comments": [{"username": "Fiona Ferrar", "comment_text": "Thanks for the tip about the ports for cinque terre. But what port did you select? Thanks"}, {"username": "Jen Lim", "comment_text": "How many days were you at CT? Pls post a link where you stayed😊 thank u"}, {"username": "Liana Hegedus", "comment_text": "Well that was a fun read😆"}, {"username": "Stephanie Vanater Cooper", "comment_text": "Fantastic entertaining read! Grazie!"}, {"username": "Mary-Ann Parnell", "comment_text": "Interested to know about private boat tour of Amalfi"}, {"username": "Sue Anderson", "comment_text": "I‘be taken so many notes! Thank you 👏"}, {"username": "Janice Sannicolas", "comment_text": "What an amazing trip and wonderful memories for your family. Thanks for sharing. I’m ready to go back and ride some bikes."}, {"username": "Cindy Holtfreter", "comment_text": "I can’t thank you enough for your post to let me know about your experience in a number of place I would like to visit in 15 months.\nI am already excited!\n💕💜💕🙏"}, {"username": "Delia Timms", "comment_text": "Sign me up for your tour! Apart from the Rome leg. You should be a travel writer! ☺️"}, {"username": "Kay Lennington", "comment_text": "Fantastic commentary 😀"}, {"username": "Aymée Hogbin", "comment_text": "Awesome review!!! We ran through those tunnels in Levanto… when you’re on your own in there, it can be a little bit spooky 🤣 I’m currently in an Airbnb in Athens that sounds a bit like yours in Trastevere 🙉 when do these Europeans sleep?! 🤣"}, {"username": "Michelle King", "comment_text": "Great rendition of your holiday! Thanks for sharing."}, {"username": "Handcock Alison", "comment_text": "Wonderful wonderful post\nI want to go back now"}, {"username": "Christine Broussard", "comment_text": "Fantastic reviews thank you!!! 👍🏼🌺"}, {"username": "Maria Voskanian", "comment_text": "I loved reading your review.\nOnce I’m back in the states I have to find your work and would love to read your books. You’re such an interesting writer 👍"}, {"username": "Debbie Drummond", "comment_text": "Great post"}, {"username": "Carolyn Sheppard", "comment_text": "Loved this - didn’t really have time to read but stayed with it as it was so witty with more than a soupçon of sarcasm😂😂Brilliant !! Not surprised to get to the end and discover you are a writer. Going to look for your book . Grazie x"}, {"username": "Mary Andreotta", "comment_text": "Love informative and entertaining posts like yours. Made me laugh out loud.🤣🤣🤣"}, {"username": "Mary Hornish", "comment_text": "This really is the best post ever! I’m still laughing. And I’m ordering your book!!"}, {"username": "SA Schongarino", "comment_text": "Loved your post! Thank you for sharing!"}, {"username": "Michelle Jopson", "comment_text": "Victoria Russell-Hodge"}, {"username": "Jenny Meffert", "comment_text": "Loved your travelogue. Thank you."}, {"username": "Sandi Cant", "comment_text": "Best review I’ve read so far. Actually read it all the way to end. Will definitely be referring back to this before I go in March next year."}, {"username": "Frances McDonagh", "comment_text": "Great insight I'm back from Italy and San Marino my little heights the wine windows in Florence, getting passport stamped in San Marino and trying pistachio liquor it's way nicer than limoncello"}, {"username": "Frances McDonagh", "comment_text": "Frances McDonagh"}, {"username": "Frances McDonagh", "comment_text": "Frances McDonagh"}, {"username": "Randi Beasley", "comment_text": "You are so funny! I love your writing style and even though the places menton are not on my itinerary I enjoyed reading your post!"}, {"username": "Pao Tellez", "comment_text": "Mau Sos"}, {"username": "Kyuah Lee", "comment_text": "Awesome trips. Love your post!"}, {"username": "Jayme Hirshberg Fingerman", "comment_text": "I’m so glad you used and liked Rossana In Pompeii and loved her! She is the best!"}, {"username": "Krista Blaylock", "comment_text": "Best post ever!"}, {"username": "Mitzi Dewhurst", "comment_text": "What are great review of your trip! Hope you are getting plenty of wear out of that lemon dress:)"}, {"username": "Em Vaws", "comment_text": "This might be the best review ever! I would love to see you whole 3 week itinerary. Trying to do the same next year with 4 adult kiddos. The overwhelm is real."}, {"username": "Joanne Slatter", "comment_text": "Thank you so much this was a great read!"}, {"username": "Carola Blödgen", "comment_text": "What a lovely and witty report, I really enjoyed reading it, with correct spelling and grammar. You will go back to this wonderful country."}, {"username": "Julie Stansell Straight", "comment_text": "🤣🤣🤣 loved this review! Thanks for sharing your experiences in such an honest and entertaining way!"}, {"username": "Julia Ruby", "comment_text": "Lovely family! Informative post, full of humor - my favorite!"}, {"username": "Jayne Dowding", "comment_text": "This is brilliant 🤩 x"}, {"username": "Karen Blackmore", "comment_text": "Excellent post, informative and highly entertaining! 👏 😄"}, {"username": "LaDonna Metcalf Meindl", "comment_text": "What a beautiful family! Thank you for sharing all the good insights. If you wrote notes on Paris, I’d love to read them."}, {"username": "Cassandra Dux", "comment_text": "Thank you so much for this amazing synopsis of your trip! Could you please tell me what your plan was for getting to Venice (and your hotel) from the airport? We are travelling to Venice in September with my parents (age 78 and 80) and I'm trying to make this as easy as possible for everyone! lol!!"}, {"username": "Veronica Schindler", "comment_text": "Loved reading your post!"}, {"username": "Amanda Austin", "comment_text": "Loved the post\nCould you let me know Sergio’s details as leaving for Italy in 2weeks"}, {"username": "Karen Miller Morales", "comment_text": "You literally must be a writer, as this was one of the best trip reports I’ve read. I laughed, smiled and genuinely thought: she should write a book and travel articles, because travel articles are often dull. She’s not dull. Link your book, I’m a fan 🙂"}, {"username": "Paola Bersano", "comment_text": "Love your post! Next time think about visiting lake Como , lake Maggiore and Verona, too. The lady you heard screaming \"beware pickpockets \" in Venice is quite popular in town, there is even a dedicated page here on Facebook 😄"}, {"username": "Katy Kilman", "comment_text": "Aliens in Pisa!! I’m dead ☠️ 🤣"}, {"username": "Kim Kirsten NeeMeglic", "comment_text": "Had a chuckle about the lemon dress as I just bought one in anticipation of my trip to sicily in 2024 and rome/florence etc in 2025 ha ha"}, {"username": "Lisa Hry", "comment_text": "fabulous post. please post a picture of your lemon dress, I love it and am obsessed with all things lemon and I have not been to Italy in 32 years. Going within a year i hope."}, {"username": "Megan Leigh", "comment_text": "I'm just here to say that you are a fabulous writer... and hysterical."}, {"username": "Tricia Weidner Gale", "comment_text": "Such a great write up. Loved your humor and advice."}, {"username": "Lisa Jones", "comment_text": "Great post! Very funny but also informative 😀"}, {"username": "Nancy Baker", "comment_text": "Loved your post👏"}, {"username": "Kristen Contieri Martin", "comment_text": "Love this 😂😂"}, {"username": "Gillian Docherty", "comment_text": "This is a great review I love your craic ☺️"}, {"username": "Stacy Derouin", "comment_text": "What a fabulous read!!"}, {"username": "Pom-Eric Doland", "comment_text": "Thank you for the great post! We are traveling in November with kids (12 and 14), so this is great information!"}, {"username": "Nicole Van Niekerk", "comment_text": "This made my day 😂"}, {"username": "Mirella Pirruccio", "comment_text": "You have a true gift!"}, {"username": "Fiona Ferrar", "comment_text": "Great read. Thanks"}, {"username": "Emily Cassandra", "comment_text": "This is a wonderful write up and you are hilarious! Thank you for taking the time to share"}, {"username": "Holly Summer", "comment_text": "The Amalfi tidbit about the lemons had me chuckling 🍋 “cantaloupe-the\nmed” 😂😂😂"}, {"username": "Heather Stedillie Riedlinger", "comment_text": "This post was informative and hilarious! Thank you!"}, {"username": "Karyn Potter Gualtieri", "comment_text": "Very entertaining writing🤣"}, {"username": "Nicole Benson", "comment_text": "Great tips, thank you"}, {"username": "Cherry Cabrera", "comment_text": "I will surely find the gelato place in Capri! Thanks for all the tips! I enjoyed reading your post :D"}, {"username": "Kelly Ladwig", "comment_text": "What an amazing review. Like, I want to be your friend because you are hilarious"}, {"username": "Jodi Marley", "comment_text": "Great entertaining post thank you for sharing 🌺"}]}, {"id": "2195050814227330", "text": "I’m hearing that the heat in Italy is so bad that people are being told to not use A/C, to save power! Is anybody experiencing this around the Amalfi Coast? Or is it just southern Italy? I’m going to be there 8/6….🤷‍♀️🥵", "link": "facebook.com/groups/1373361046396315/permalink/2195050814227330/", "likes": 2, "comments": [{"username": "Brian Osman", "comment_text": "I haven't heard or seen anything about that"}, {"username": "Jerry Lyubelsky", "comment_text": "We were in Italy 7/5-15 and no one ever said to not use AC"}, {"username": "Bee Dub", "comment_text": "Currently in Italy and no one has said that to me."}, {"username": "Kerrie Johnson", "comment_text": "Thanks everyone!!! I guess it’s fake news!"}, {"username": "Sam Holmes", "comment_text": "Not fake news. A lot of the accommodations have old systems which can not handle the heat. We have been travelling Rome, Amalfi, Naples and the nights are unbearable in the rooms."}, {"username": "Elisabeth Zarapi", "comment_text": "C'est tout de même une conscience, une tendance à adopter... Ce que ns indiquons déjà à nos hôtes en France."}, {"username": "Karen Brennan", "comment_text": "We were in Amalfi the last couple of days , AC worked great. The Power went out a few times last night but always came back on with in 5 minutes"}, {"username": "Neville Spargo", "comment_text": "We are in Sorrento and it is very hot . This afternoon we lost all power to our apartment, twice ! Power grid struggling with demand as temps soar !🥵🔥"}, {"username": "Sharon Walsh", "comment_text": "My daughter lives near Milan and says the heat is stifling."}]}, {"id": "2195051400893938", "text": "We have booked our trip to Rome for early December 2023 and staying at the Hotel Stendhal Rome. Cannot wait! And totally hope the weather is cool (thinking it may be like east coast weather, late fall), but not too cold. We only have a few days but are thinking of seeing Pompeii while there - would tours be open and is taking the train there better than taking a tour bus? Any particular Pompeii tour recommended?", "link": "facebook.com/groups/1373361046396315/permalink/2195051400893938/", "likes": 1, "comments": []}, {"id": "2195063910892687", "text": "I know it’s a heatwave right now but is it normal for the trains to be SO hot, even in business/first class? We only went from rome to Firenze and it was nearly in unbearable. We will go from Venice to naples later in the week and that’s much longer …..is there ever air conditioning?", "link": "facebook.com/groups/1373361046396315/permalink/2195063910892687/", "likes": 26, "comments": [{"username": "Bob Sullivan", "comment_text": "One train from Venice to Naples? You'd better cross your fingers!"}, {"username": "Daniel Michael", "comment_text": "Words alone won’t express how thankful I am to you and to your platform. It has been a good opportunity for me and my family thank you. Mr Luke Donald"}, {"username": "AgAnne Chrzanowska", "comment_text": "Aircon in Italy is set on 24-25C, not 18-19C. We aren't big fans of super cold aircon, when it's 42C outside and you go through a shock getting out from an closed space."}, {"username": "Lori Greco", "comment_text": "They do have air con but it's never cold enough, so it gets stuffy. In fact, it may even be evaporated air"}, {"username": "Shelby Symons", "comment_text": "We have been in Italy for a week and a half now and travelled on numerous trains and the only time it was a sauna was yesterday when we travelled Milan to Santa Margherita. It was a joke! Other than that so far aircon has been great"}, {"username": "Harris Dee", "comment_text": "AC has destroyed family life and community… we used to sit on the stoop into the wee hours … AC has driven most people inside … handheld fans, the bomb!"}, {"username": "Diana Sideris", "comment_text": "We had air conditioning on both trains and travelled from Rome to Florence and Florence to Naples’s"}, {"username": "Kate N Karim Al-Azzawi", "comment_text": "Nope."}, {"username": "Julie Henderson Dandliker", "comment_text": "We traveled from Rome to Bologna in a preferred car yesterday and the temperature was very comfortable."}, {"username": "Giorgia Petraia", "comment_text": "It’s no heatwave, it’s like this every summer all summer long"}, {"username": "Joe Guzzi", "comment_text": "Yes."}, {"username": "Paolo Berardi", "comment_text": "Book frecciarossa"}, {"username": "Ellen Edmonds-Wilson", "comment_text": "Thé aircon was fine from Rome to Venice last week on the Frecciarossa - but all a/c I struggling in Italy with the consistent heat."}, {"username": "Maggie Gpe Banuelos", "comment_text": "The same on their Flex bus!!! The bus was nice looking and comfortable but AC was just a small breeze…My daughter and I were sweating while others didn’t seem to mind🥵"}, {"username": "Christina Lynn", "comment_text": "Is the fast red frecce train?"}, {"username": "Dianne Martin Dittrich", "comment_text": "We have been travelling Italy using both Italo and Trenitalia, non business class, from Roma down to Salerno and up to Florence, Bologna, Milan and Venice since July 14th and all trains have been air conditioned."}, {"username": "Guinness Mydog", "comment_text": "Thé aircon was great from Rome to Florence just this past Monday on the Frecciarossa business class."}, {"username": "Enrica Palla", "comment_text": "Yes it is."}, {"username": "Ann Romanowski", "comment_text": "We are currently on the Frecciarossa (Red train) from Milan to Venice in business class and it is nice & cool.\nThere must be an issue with your train?"}, {"username": "Claire Tarry Rahme", "comment_text": "Claire Tarry Rahme"}, {"username": "John Chandler", "comment_text": "Just did Veneto to Milano. Very comfortable"}, {"username": "Anna Rockon", "comment_text": "No"}, {"username": "Lynne Marler Peters", "comment_text": "Only one of our places did not have good air conditioning. Everywhere else was the temperature we like....cold!!!"}, {"username": "Friedemann Diederichs", "comment_text": "Nope. Not in good ole Italy. And if there is it does not work.\nNon sputare alla carroza!"}, {"username": "Coleen Greer", "comment_text": "Can you buy hair spray, lotions in Italy?"}, {"username": "Gilda Capraro", "comment_text": "Every train I've bewn on ao far this summer, has had AC.\nI'm Currently on a train from Napoli to Cassino, and it has full, nicely chill AC going.\nAlso fewer pax than on the average touristy train routes. So perhaps it's a mix of too may bodies and an AC system set at a temperature higher than what you may be used to in your home country."}, {"username": "Alice Francesca", "comment_text": "Generally ALL long distance trains (Frecciarossa or Italo) have aircon.If they don't, it s because it s temporarly out of service"}, {"username": "Denis Mills", "comment_text": "Ac was great in all of our trains last week"}, {"username": "Virgz Van Møøre", "comment_text": "No, normally it works fine, you should have asked to move"}, {"username": "निनावी सहभागी", "comment_text": "Well good news! Todays train was lovely with AC! I guess we were just unlucky the other day!"}, {"username": "Jane Lisa", "comment_text": "Unfortunately, yes."}, {"username": "Bill Bowler", "comment_text": "That's why we booked early morning trips only. Past experience was horrible."}, {"username": "Kathy Flood", "comment_text": "Lastly week it was fine."}, {"username": "Richard Stein", "comment_text": "Okay, so we did the exact same trip today, and the train was cool no problems with the air. Maybe that car had a problem."}, {"username": "Katie Martinez", "comment_text": "We didn’t have any issues with air conditioning- but these past two weeks was my first trip. We did ride the train several times. Maybe it was just some good luck then. 🤷‍♀️ sorry to hear that you were so hot. That’s pretty awful."}, {"username": "Jennifer Amen", "comment_text": "Yikes!! Putting my handheld fan on my list of things to pack right now!!! 🥵"}, {"username": "Wendy Bey-Sottovia", "comment_text": "We had no problems with air. We used Italo"}, {"username": "Adrianna Hurst", "comment_text": "We’ve experienced both. It was so hot going to Milan, but when we came back it was nice and cold on board. This was on Trenitalia and we were in business class"}, {"username": "Bee Dub", "comment_text": "When got on the train, it was cold but as it got moving it became hot. Not sure if it’s because of more ppl getting on or what. We went from Venice to Rome."}, {"username": "Melissa McCormick", "comment_text": "We used italo and had AC."}, {"username": "Solfrid Helen Borger", "comment_text": "We took Frecciarossa from Naples to Rome today - premium tickets - and it was so good: cold, good Seats and worth every euro👌🇮🇹🤩"}, {"username": "Hope Brown", "comment_text": "The first train we rode today from Pisa to La Spezia was fairly warm. The regional to Vernazza afterward was amazingly and surprisingly cool and comfortable. It all feels like a crap shoot. AC in Pisa was fantastic, AC here in Vernazza is not so great. But still, we’re in beautiful Italy!"}, {"username": "Lauren-Jade Roberts", "comment_text": "We did Naples to Rome and had air conditioning - not freezing but wouldn’t want it but very comfortable given not wearing much clothing just small summer dress"}, {"username": "Samantha May", "comment_text": "our trains were cool end june in Italy"}, {"username": "Stephen Rouse", "comment_text": "All the trains in Italy that I took had AC in them. However, some of the trains that I took in Germany did not have AC in them."}, {"username": "Lorissa Gill", "comment_text": "ours wasnt"}, {"username": "Frank Hunt", "comment_text": "Unfortunately it is hit and miss."}, {"username": "Rachael Richardson", "comment_text": "We have travelled all over on the trains it’s hit and miss with a/c hand held fan and water for me"}, {"username": "Mary Evans", "comment_text": "July and August are the worst time to be in Italy. And Europe is not ax enamored of a/c as we are"}, {"username": "Renee Rundle Stoneham", "comment_text": "It all depends on the train the car etc…\nMost of our longer rides had nice cool A/C\nThe train to and from Milan to Varenna did not. The way there it was hot, no windows to open either. Way back was better, but earlier in day."}, {"username": "Andrea Hirsch", "comment_text": "Yikes! We are doing that trip on Monday. Which train line?"}, {"username": "Jessica Petyo", "comment_text": "We were just in first class from Florence to Milan on Trenitalia a couple days ago and there was AC. It wasn’t super cold, but it was comfortable for two hours."}, {"username": "Marissa McLean", "comment_text": "Air con isn’t as big a thing in Europe as it is in North America unfortunately 🥵"}, {"username": "Carmine Napolitano", "comment_text": "yea its bogus"}, {"username": "Caren Murray Kleinman", "comment_text": "I’m so glad our trip is September/\nOctober…."}, {"username": "Lynn Luken", "comment_text": "Our trains were cool....June"}, {"username": "Kathy Holden Reams", "comment_text": "We had the same issue with trains and buses."}, {"username": "Aymée Hogbin", "comment_text": "We had air con in every business class train we travelled on!"}, {"username": "Ivor A Fortuin", "comment_text": "The best time to go anywhere in Europe is mid Sept - mid Oct.."}]}, {"id": "2195064687559276", "text": "We will be flying on Lufthansa from LAX. Their website states that a carryon can only weigh 8.5 kilos (18 lbs). We prefer NOT to check a bag. Does Lufthansa at LAX actually weigh your carryon bag and enforce this rule? Tks!", "link": "facebook.com/groups/1373361046396315/permalink/2195064687559276/", "likes": 1, "comments": [{"username": "Miyuki Kanno Paul", "comment_text": "It’s been a while since last time I flew on LAX-FRA on LH. It was in a month of October, and nobody asked us to weigh my carry ons. If it’s the peak summer season it may be a different story"}, {"username": "Alla Zats", "comment_text": "Yes, Lufthansa weighs your carry on"}, {"username": "Patty Herrera", "comment_text": "Lufthansa DID weigh our carry ons. Had to put some items in our check in luggage."}, {"username": "Terri Wood Black", "comment_text": "Yes, they checked in US, but not in return trip"}, {"username": "Kel Nicholl", "comment_text": "Yes, they weigh your bags. But 8.5kg is pretty good. Only 7kg from Australia. Pack light."}]}, {"id": "2195064694225942", "text": "Going to Italy in September and I’m starting to book tours. Is the hop on hop off through viator any good.\nOur hotel in Rome is The Republic and it’s 20-25 min drive to coliseum and Vatican. So I thought hop on hop off made more sense. Then it says you can add on from there. Thx", "link": "facebook.com/groups/1373361046396315/permalink/2195064694225942/", "likes": 5, "comments": [{"username": "Steve Grossman", "comment_text": "Excellent idea"}, {"username": "Libby Kelly", "comment_text": "I did it my first time in Rome on day 1 - it helps you get your bearings"}, {"username": "Bob Lampo", "comment_text": "I used the Big Red Bus in Rome and it was a great way to get around. Got me a seat with AC throughout our day too. The 3 day pass is only slightly more than a day pass so it worked great. First day we did a full tour and got off half way and helped us get our geography bearings. Then we planned our events around the stops and it worked great. I think it has 9 or 10 stops in Rome. It gets close to all attractions but most get to congested for the stops to be right there. Very close though."}, {"username": "Mary Anne", "comment_text": "You can buy hop on/off tickets when you get there. Lots of ticket sellers at kiosks near main attractions. No need to buy through third party (and pay extra)"}, {"username": "Troy Dalke", "comment_text": "I am not sure what time your tours are booked. We booked ours as early as possible. Our Vatican tours they want to meet at 7:15am. Not sure when the hop on hope off starts."}, {"username": "Kay Rendall", "comment_text": "Very very hot. In past was stuck in traffic for 1 hr near Colleseum, not moving. So didn't get to see everything. Had to get off and walk. If Rome as busy as they say, may not work well for u."}, {"username": "Elena Innocenti", "comment_text": "I think is near Termini train station.\nYou can take bus 40 from parking outside termini and go to Vatican city.\nFrom termini station metro B, Colosseo is 2 stop away,"}, {"username": "Matthew Cawley", "comment_text": "Prob cheaper to buy from the vendors when in Rome. They are everywhere esp near Trevi fountain. Viator will be more I expect so they get their money/cur"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "I do not recommend the hop on hop off bus in Rome. It is not a good value and cannot enter the historic district. You will do more walking than if you just walk between sites. Then there is also the time waiting for the next bus and hoping it is not already full. You can always grab a taxi to the more distant sites, especially in the heat."}, {"username": "Janet Messanelli Bozzone", "comment_text": "You can get a hop-on-hop-off bus on your own. No need to book through a 3rd party unless there is some kinda voucher."}, {"username": "Jane Lisa", "comment_text": "I wouldn’t use Viator for anything. They are highly unreliable."}]}, {"id": "2195066874225724", "text": "Train help please! 🚊\nAll the train apps say our journey is sold out. Can train tickets still be bought at the stations?\n(Pisa to Sorrento)", "link": "facebook.com/groups/1373361046396315/permalink/2195066874225724/", "likes": 0, "comments": [{"username": "Gina Rovello Keenan", "comment_text": "What dates?"}]}, {"id": "2195081507557594", "text": "Hello! We will be visiting for about 18 days (including travel days) in the fall of ’24. We will likely spend days 2-4 in Venice, days 5-8 in a little town south of Livorno (possibly doing 1-2 day trips: Elba, the Riviera, etc.), days 9-11 in the Val d’orcia area at an agriturismo, days 12-14 in Umbria and days 15-17 in Rome. We will be renting a car for our time in Tuscany but have a few logistical questions:\nWe don’t want to drive in the city centers of Florence or Rome. Where should we rent a car beginning with our time in Tuscany that will allow us to drop back off somewhere before we enter Rome? I’ve been looking at the Hertz sites (and elsewhere) and have hit a roadblock.\nFor the travel between Venice and Tuscany- should we try to stop by Florence for a few hours and then try to rent a car near there and continue on our way? If so- where do we rent that won’t require inner-city driving and what’s the best way to get there?\nIf we were to do a daytrip to the riviera- should we drive to Livorno to park and take a train? Should we drive up to Le Spezia and then take a ferry? Which would be the most cost-effective and least-stressful way to do that?\nIf we decide to do day trips to Elba or the Riviera (on our own, not guided)- how realistic is it to decide once we arrive? We’d really like this trip to be fairly relaxed so we have as little scheduled as possible and just decide as we go.\n(I realize many will say that we’re cheating ourselves out of Florence- but we’re truly fine with just spending an afternoon there or missing it all together. If it makes sense logistically and financially- we’d like to get a glimpse and maybe stroll a neighborhood, city center, one of the gardens or libraries or maybe just see the Ponte Vecchio Bridge but we will not be touring any of the famous sites.) We’re also fine just bi-passing it if it doesn’t make sense. Narrowing our itinerary is difficult and we know we can’t visit all of the places. We’re prioritizing based on our interests.)\nTIA!! ☺️", "link": "facebook.com/groups/1373361046396315/permalink/2195081507557594/", "likes": 21, "comments": [{"username": "Jim Kelleher", "comment_text": "You can rent a car at the Florence airport and drop it off at the Rome airport, thus bypassing driving in both city centers. Definitely take the train to the Cinque Terre."}, {"username": "Sara Kyle Hargett", "comment_text": "We stayed 2 nights at LA Spezia ( Portovenere) it was so nice!! Actually pretty quiet (May). You can take the ferry to the cinque terra towns. For the Amalfi coast, we stayed in Sorrento and booked a full day car tour. It was awesome!!!"}, {"username": "Miyuki Kanno Paul", "comment_text": "How about returning your rental car in Orvieto and take a train to Roma? We did it with Hertz"}, {"username": "Mick Konowal", "comment_text": "Last September I rented a car in Venice and drove down to Rome with stops in Modena, Bologna, Florence and the Adriatic coast. Parking isn’t a major problem as long as you stay out of the city center and beware of the restricted area signs. The car rental place in Venice is outside the city at the airport so it is easy to get to by train or water taxi. In Florence there is a large parking complex about two train stops from the city center. You can park there and take the train in. I’ve done it a couple of times and it’s fairly easy. When I get to Rome if I’m staying there I usually return the car at the airport and take a cab back to my hotel in the city."}, {"username": "Clay Gilmore", "comment_text": "Twice I rented cars in Chiusi in order to stay a little outside of Pienza. After taking train from Florence and Venice. Car rental office across street from train station. Very easy and beautiful driving to and in the Val D’Orcia."}, {"username": "Nancy Lewis", "comment_text": "If you can fit it in, i recommend Lake Como for at least 2 days. I loved it more than CT."}, {"username": "Jennifer Billesberger", "comment_text": "We’re picking up a Hertz rental from the Florence train station and dropping several days later at the Hertz in Orvieto - then training to Rome from there."}, {"username": "Rita Levi Montalbano", "comment_text": "What do you mean for riviera?"}, {"username": "Lauren Velleno", "comment_text": "We rented our car at Enterprise in Arezzo for our stay in Tuscany. Like you, we didn’t want to drive in large city centers like Florence and Rome."}, {"username": "Eileen Rich Gombos", "comment_text": "Pick up car in Florence drop off in Orvieto , train directly to Rome."}, {"username": "Danny Zare", "comment_text": "Just hire a car from airport to airport and that way you’ll avoid cities. I would/have drive in any city except Rome lol.\n\nSide note: 2 nights is MORE than enough for Venice (I’m here right now). Don’t do 4 nights. Spend some extra time in Florence and Cinque Terre. See Bologna, it’s beautiful and literally the food capital of Italy. Or spend a couple extra days travelling the rolling hills of Tuscany. It’s never enough.\n\nEnjoy!"}, {"username": "Keith Crossley", "comment_text": "We're picking a car up in Venice, staying near San G with train to Forenza, moving on then dropping the car in Perugia. Then train to Rome. I think this works for us."}]}, {"id": "2195115180887560", "text": "What good places for leather do you recommend in Naples like a jacket or a bag....I bought a gorgeous bag years ago from Palermo it was hand stitched full of detail", "link": "facebook.com/groups/1373361046396315/permalink/2195115180887560/", "likes": 0, "comments": []}, {"id": "2195084180890660", "text": "We were there last night", "link": "facebook.com/groups/1373361046396315/permalink/2195084180890660/", "likes": 102, "comments": [{"username": "Vanessa Bryant", "comment_text": "Very nice 👍"}, {"username": "Deborah Castelli", "comment_text": "Great photo !!"}, {"username": "Susan McHenry", "comment_text": "Susan McHenry"}, {"username": "Janeal Smith", "comment_text": "Beautiful couple!"}, {"username": "Elena Dompa", "comment_text": "Elena Dompa"}, {"username": "Barbara J. Williams", "comment_text": "Where?"}, {"username": "Carolyn B-Coakley", "comment_text": "Carolyn B-Coakley"}, {"username": "Andrea Romano", "comment_text": "🥂❤️"}, {"username": "Susan Orr", "comment_text": "Great picture"}, {"username": "Roe Gallo Saks", "comment_text": "Lovely photo mate"}]}, {"id": "2195088260890252", "text": "Trying to pick a hotel or apartment for 2 nights in Milan next month. I am traveling with 2 young children. People keep telling me to find something in CityLife or Isola. I am having trouble finding something for reasonable under $250 night. I have found places in Tre Torri. Does anyone know how that area is?", "link": "facebook.com/groups/1373361046396315/permalink/2195088260890252/", "likes": 1, "comments": [{"username": "Ilaria Verda", "comment_text": "3torri is in citylife district."}]}, {"id": "2195096324222779", "text": "Has anyone ever stayed at hotel indigo St. George? I’m nervous the location is far from things we want to see.", "link": "facebook.com/groups/1373361046396315/permalink/2195096324222779/", "likes": 0, "comments": []}, {"id": "2195106284221783", "text": "When do most tours on water and ferries stop on the almafi coast?", "link": "facebook.com/groups/1373361046396315/permalink/2195106284221783/", "likes": 1, "comments": [{"username": "Laura DeCicco", "comment_text": "Amalfi. End of October"}, {"username": "Teresa Marina", "comment_text": "640"}, {"username": "Jennifer Avrett", "comment_text": "31 October the lease for use of the sea expires"}]}, {"id": "2195107277555017", "text": "Hello Italy lovers,\nAm planning to visit capri with my family for 3 days, we booked the hotel already. Any advice to profit the maximum of our staying there? Best restaurants, cafes, beaches, activities ….etc.\nThanks in advance 🌹", "link": "facebook.com/groups/1373361046396315/permalink/2195107277555017/", "likes": 2, "comments": [{"username": "Carine Brys", "comment_text": "We went all the way to the upper level, but wasted too much time on public transportation.\nWe (2) should have ride-shared a taxi with another couple of tourists."}, {"username": "Rachael Richardson", "comment_text": "Hope you have a nice time , but Capri is rammed full of tourists , big waste of money for us on a day trip- over rated and shops are either tacky or for the wealthy,\nHope you have alternate things planned to do on the island as you can’t move 20,000 tourist a day - sorry to be negative but spoke to other people and they thought the same, ruined by greedy tour operators"}, {"username": "Angela Genduso", "comment_text": "You will be fine. The tourist leave on the ferry then you have the island to yourself."}, {"username": "Steve Grossman", "comment_text": "Have lunch at the hotel villa brunella"}, {"username": "Miyuki Kanno Paul", "comment_text": "Get up early, take the funicular down to Marina Grande to catch the FIRST BOAT TOUR in the morning(either with blue grotto or without it). You’ll be the first group to beat all the day trippers/\ncruise ship people coming from all directions. A very few boats are around the island and fabulous! A island boat tour WITHOUT blue grotto will go clockwise and go right through the famous Faraglioni rocks. Catching the first boat ride is THE ultimate advantage of staying on Capri. You’ll thank me😉.\n\n•Hotel Luna’s rooftop bar has the best view for a cocktail.\n•A local merchant sent us to Ristorante Il Geranio. We loved the place so much that we dined there twice during our stay. Probably you can see partial sea view if getting a table outside for lunch"}, {"username": "Martinez Martin", "comment_text": "Definitely take the chair lift to the top of Ana Capri and make sure to get a fresh spun waffle cone from their Gelato place (don't remember the name)"}]}, {"id": "2195108477554897", "text": "I am going to Palermo in 5 weeks when should l rent my car will my gps on plan t mobile work there", "link": "facebook.com/groups/1373361046396315/permalink/2195108477554897/", "likes": 1, "comments": [{"username": "Miyuki Kanno Paul", "comment_text": "You don’t want to drive in Palermo. Are you visiting just Palermo? If renting a car, reserve now from your home country(assumin\ng you are from the States), go to AAA to obtain International Driving Permit(about $20 or so), and pick it up as you leave Palermo. I have ATT and worked fine. Google Map may send you to a dirt roads(and it happened to us!). Download ViaMichelin app as a backup"}]}, {"id": "2195114277554317", "text": "So just spent a week in Italy and you can hate me for what I’m going to say but I’m saying it:\n1. Wear anything you want. No one cares just make sure you have good walking shoes.\n2. We didn’t have any dinner reservations and ate wherever we wanted. All meals were amazing.\n3. We took $500 euros but should have gotten a little more.\n4. Everyआणखी gelato tastes the same so don’t bother looking for a special place.\n5. Didn’t feel unsafe with pickpockets but I was aware of my stuff.\n6. No mosquitoes ￼in sight.\n7. Coffee all day long and meals are whenever your hungry.\nEnjoy!!!", "link": "facebook.com/groups/1373361046396315/permalink/2195114277554317/", "likes": 1655, "comments": [{"username": "Liliana Voicu", "comment_text": "7 isn't true lol. Most restaurants close in the afternoon and open around 7pm, as they respect siesta"}, {"username": "Mary Brown", "comment_text": "All valid points!"}, {"username": "Carol Potter", "comment_text": "That’s the way to go!!"}, {"username": "Eileen Marum Armitt", "comment_text": "I just came bk from Italy and agree with you 100% on all your comments"}, {"username": "Krista Ford-Walcer", "comment_text": "Krista Ford-Walcer"}, {"username": "Lina Stump", "comment_text": "😆 every gelato tastes the same, non e vero. Have you tried Otaleg in trasvere or Venchi"}, {"username": "Anita Bonaminio Krimm", "comment_text": "Love it!"}, {"username": "Jill Gilreath", "comment_text": "Exactly!!!"}, {"username": "Barb Minardi Hornback", "comment_text": "I agree 100%. Don’t waste your time looking for a certain restaurant. They are all good. Eat where your near."}, {"username": "Stephanie Earl Peterson", "comment_text": "I agree with almost everything. Except that we did find one gelato place in the metal tins that was by far the favorite. But every place we went was definitely good. ￼🙂"}, {"username": "Janet Lugar Miller", "comment_text": "Did you have prepaid airbnb or was that part of your 500 euro"}, {"username": "Steve McGinniss", "comment_text": "You're dead weong on the gelato thing. We had it everyday and always somewhere different. There were some places that stoood out compared to others."}, {"username": "Joanne Piscopio Hayes", "comment_text": "Thanks for your positivity!!! I’m going to Italy next month and read so much negativity it kinda worried me a little."}, {"username": "Martha Coco", "comment_text": "Good luck getting in some places because of dress! Otherwise probably good advice"}, {"username": "Claire Dowson", "comment_text": "Mosquitos…. They are about if you are tasty. Lake Como I was eaten alive, managed to prevent them on Garda, but had a few bites in Venice."}, {"username": "Smush Pappas", "comment_text": "Going for 2 weeks. Thinking 800-1000 euro to bring with????\nThoughts??"}, {"username": "Fiona Cohn", "comment_text": "6 is incorrect! They feasted on me."}, {"username": "Erica Verde", "comment_text": "I agree but you have mosquitoes in Italy only in some regions. At example in Po valley (Milan major city) and some area of Sardinia"}, {"username": "Judy Jamieson Pisano", "comment_text": "Eat when you want - as long as you don’t care what you eat. Restaurants are closed after lunch (around 2pm) and don’t open until 7 or 8. So you will not get a full dinner at 5, but you might be able to get a piece vvb of pizza"}, {"username": "Bill Bosco", "comment_text": "No hate, that seemed spot on."}, {"username": "Carlenne Brown Jarvis", "comment_text": "Yes! Mostly 😉"}, {"username": "Kate Bella", "comment_text": "Wolf Belasco"}, {"username": "Greg Saba", "comment_text": "It DOES make a difference where you buy gelato. That is why virtually no one in America has ever duplicated the good ones. Try to buy gelato that has muted colors, is not visible (under stainless lids), and is made on site. Those who have to show their products, especially with bright colors, are trying to attract tourists. There are many fantastic places in Rome but also in many small towns. Tip: Ask for panna (often at little or no cost) if you want fresh whipped cream on top. Photo is from Frigidarium, one of Rome's finest, but there are others such as Teatro and Giolitti (make sure you prepay and they will offer you panna)."}, {"username": "Phillip Self", "comment_text": "Agreed"}, {"username": "Debbie Potter", "comment_text": "Did you find it to be a headache with transportation and getting from point A to B?.... im having second thoughts about booking the trip because of that."}, {"username": "Susan Lowry Lamb", "comment_text": "I'm not sure why people say things like they didn't feel unsafe on the pickpocketing thing. I felt perfectly safe in Barcelona when my wallet was lifted. That didn't change after it got lifted really."}, {"username": "Melissa Freas", "comment_text": "We won't be making any reservations either for the exact reason we want to be able to eat when we are hungry!!"}, {"username": "Amy Kaye", "comment_text": "I'm here now, this is all true. Except for the non-tourist areas, restaurants close from 2-7."}, {"username": "Debra Burroughs Disario", "comment_text": "Totally agree!!"}, {"username": "Maria Angela Perrone", "comment_text": "Danielle, you have a good attitude and can have fun wherever you go.\nAll tourists should feel like you!"}, {"username": "Jennifer Lee", "comment_text": "Agreed"}, {"username": "Diana Lawler", "comment_text": "Thank you for sharing!"}, {"username": "Melanie Lambert Cravens", "comment_text": "All positive!! Thsnk you!"}, {"username": "Aaron Loree", "comment_text": "Truth"}]}, {"id": "2195131450885933", "text": "Heading to Italy this summer and I know it’s going to be hot. Does anyone know if insulated water bottles are allowed in the Coliseum? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2195131450885933/", "likes": 42, "comments": [{"username": "Marilyn Waldorf Reilly", "comment_text": "Yes"}, {"username": "Jill Greco Sailer", "comment_text": "Yes"}, {"username": "Twana Espree", "comment_text": "I just got the green!"}, {"username": "Louanne Peterson", "comment_text": "Yes many many historical public fountains all throughout Rome where the water is cold and amazing and clean, intended for drinking. Steer away from anyone selling water on the streets."}, {"username": "Louanne Peterson", "comment_text": "Roman fountain"}, {"username": "Louanne Peterson", "comment_text": "Louanne Peterson"}, {"username": "Louanne Peterson", "comment_text": "Louanne Peterson"}, {"username": "Ryan Monahan", "comment_text": "I just bought a bottle of water and then reused the empty for 2 weeks. So convenient and weighed almost nothing when empty. My wife stuck it in her purse. The fountains everywhere made it easy!"}, {"username": "Stephanie Chapman", "comment_text": "I took mine. Tho I agree to look for something smaller and refill often. I took my 20oz Camelbak and it worked great."}, {"username": "Gretchen Cabrera", "comment_text": "They are"}, {"username": "Mélanie Dutil", "comment_text": "Oui je recommande fortement. Comme il faut très chaud en ce moment, l’eau reste froide plus longtemps. Toute la famille avons visité le Colisée et on avait ce type de bouteille. Aucun problème à y entrer."}, {"username": "Marsha Rose-Sperduti", "comment_text": "Why carry around this enormous and heavy water bottle in a city full of water fountains?!"}, {"username": "Sally Edwards Rice", "comment_text": "I know that is hot for a lot of people, but I live in Florida and Oklahoma. It feels a lot hotter there. I was wanting to escape August heat, but instead I will be enjoying the beauty of Italy and all the surrounding area and enjoying the same heat. We are going to love it anyway!"}, {"username": "Tanaz Dibagohar Yaghoubi", "comment_text": "It’s hot. I suggest you carry as less as possible, and just buy water bottle for one euro everywhere and you can fill it up or trash them as you see fit."}, {"username": "Alison Ahlberg", "comment_text": "I took my frank green in no problem"}, {"username": "Kate N Karim Al-Azzawi", "comment_text": "Yes & there are water fountains to refill. The water is super cold and refreshing!"}, {"username": "Matthew Cawley", "comment_text": "Yes and can refill bottle inside as well"}, {"username": "Rasha Za", "comment_text": "Too heavy. We just used plastic water bottles and kept refilling them from the awesome fountains all over Rome. Throw it away end of day! U dont want to be carrying extra weight"}, {"username": "Soumya Jonnalagadda", "comment_text": "Yes"}, {"username": "Ellen Edmonds-Wilson", "comment_text": "You’re fine with your own bottle. Museums will often make you put it in the cloak room but outdoors you’re fine"}, {"username": "Charlotte Reid", "comment_text": "Yes but not allowed in the Vatican!"}, {"username": "Eileen Dalton", "comment_text": "Hot ain't the word.....🇮🇹"}, {"username": "Dana Golden", "comment_text": "Yes!"}, {"username": "Michelle Hebert Frederick", "comment_text": "Michelle Hebert Frederick"}, {"username": "Rachael Richardson", "comment_text": "We are here now loads of refill fountains- you need it !"}, {"username": "Joann Lynn", "comment_text": "Thanks I leave in the morning was wondering the same thing"}, {"username": "Rose Wolschlager Hinman", "comment_text": "When I went in October, I took my yeti insulated thermos, and it went everywhere with me."}, {"username": "Maria Fides Nicholson", "comment_text": "Yes and add liquid IV got extra hydration. We brought our hydroflask everywhere even in April."}, {"username": "Liz Zadaya", "comment_text": "Smartest thing I saw someone bring was a collapsible cup w a screw top. So many fountains to use"}, {"username": "Holly Melanson", "comment_text": "Yes"}, {"username": "Michelle Hebert Frederick", "comment_text": "I’m preparing for my trip to Italy and purchased this water bottle on Amazon. Planning to do carry on only and wanted to save space."}, {"username": "Maryanne Calabrese Bressan", "comment_text": "Just my humble opinion those tend to be heavy I Purchased a collapsible water bottle so when I empty, it was much less weight just something to think about two years ago and again this October I’ll be back"}, {"username": "Mi Reille", "comment_text": "We bought ours with no issue last week"}, {"username": "Melissa Ribeiro Passos", "comment_text": "All good\nYETIs are a must (or something similar)"}, {"username": "Amber Ikemoto", "comment_text": "Yes no problem. We brought ours and they worked out great for the hot day."}, {"username": "Tania M. Malave", "comment_text": "We had no problems with ours. I used the simple modern ones, because Yeti’s are really heavy."}, {"username": "Teri Mayo", "comment_text": "Yes!"}, {"username": "Elaine Hayes", "comment_text": "I had no trouble bringing mine in!"}, {"username": "Nicole Laplante-Liquori", "comment_text": "Yes they are!"}, {"username": "David Sapienza", "comment_text": "I was really happy to have my insulated bottle for my month in Rome. Yes I brought it to the Coliseum. There is a great free fill up just next to the entrance"}, {"username": "निनावी सहभागी", "comment_text": "Thanks so much for the responses! I appreciate them!"}, {"username": "Joni Kennedy", "comment_text": "Just make sure it empty going through security at the airport!"}, {"username": "Debbie Horton Rough", "comment_text": "These work great and they roll up… they don’t take up any room"}, {"username": "Kirsten Rea Davis", "comment_text": "And FYI-the water in the fountains around the city are surprisingly cold."}, {"username": "Nancy Caruso Watts", "comment_text": "We had a similar one and made ice, was perfect for the hot days"}, {"username": "Ashley Martins", "comment_text": "Yes, although they get heavy to lug around. We bought a larger plastic one there for under $1 euro & even though doesn’t stay cold, we drank it so fast it didn’t matter."}, {"username": "Tracy Staples", "comment_text": "I’m taking a roll up￼ collapsible￼"}, {"username": "Sonia Smith", "comment_text": "I ordered these. Very inexpensive and light. Over little space to pack matters when going to Italy and a cruise😬."}, {"username": "Susan Kim", "comment_text": "I think so!"}, {"username": "Cindy Cornell", "comment_text": "There are locals who sell iced cold bottled water outside the coliseum but we quickly learned that they weren’t sealed! Who knows where that water came from. 🤮 Bring your own water bottle/water. 😎"}, {"username": "Francine Inga Madera", "comment_text": "Yes you can bring water but I suggest you bring a carrier for that water bottle because you will get tired of walking around with it very quickly. They sell water bottle carriers that you could wear as a Crossbody. I bought mine on Amazon."}, {"username": "Cathy Ruggiero", "comment_text": "I brought mine. It was just a little lighter and I just kept filling it up."}, {"username": "Shannon Confortin", "comment_text": "I had no issue with my water bottle there last summer"}, {"username": "Andrea D'Aleo Knipfel", "comment_text": "Anyone know if you Can you bring backpacks into Vatican?"}, {"username": "Michelle Rendon", "comment_text": "Why would insulated bottles not be allowed?"}, {"username": "Gigi Igle Gonzales Dong", "comment_text": "I walked around Cinque Terre, Naples, Amalfi, Rome, etc. With this. I just pulled out my water bottle so you know it’s a Yeti but I just push it down and I fill it with ice cubes and water. Unfortunately the ice doesn’t melt fast enough snd i run out of water"}, {"username": "Michelle Malarchy", "comment_text": "That will get heavy... have you thought about a camelback or something similar?"}, {"username": "Mark Romano", "comment_text": "Only non insulated are allowed anywhere in Italy."}, {"username": "Rayandra Alexander Seville", "comment_text": "I plan on bringing my same exact yeti but red!"}, {"username": "Bianca D'Amore", "comment_text": "Yea they are and they have fountains that you can fill up all around Rome. Very safe to drink. I was just there last week. 90 something degrees everyday with humidity of about 60-70% to make it feel hotter. Stay hydrated."}, {"username": "Emily Kelley Arrowood", "comment_text": "We had no issues with water bottles in the Colesseum or anywhere else."}, {"username": "Loredana Polichetti", "comment_text": "Yes"}, {"username": "Vicki Susie Naab Gandolf", "comment_text": "We carried them everywhere in a small backpack, never was a problem. It’s so hot right now I can’t imagine there would be an issue."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2195141794218232", "text": "Wondering is it better to catch the Leonardo train to Rome Termini or a cab. We are a family of three.", "link": "facebook.com/groups/1373361046396315/permalink/2195141794218232/", "likes": 3, "comments": [{"username": "Bennett Richards", "comment_text": "A metered cab…. Never a non metered cab."}, {"username": "Miyuki Kanno Paul", "comment_text": "Train. No traffic after all!"}, {"username": "Anne Boettcher", "comment_text": "Train! So easy and fast."}, {"username": "Phyllis Snyder", "comment_text": "Train"}, {"username": "Alexandra A Welker", "comment_text": "Train"}, {"username": "Nakitha Badon", "comment_text": "Train! We did it and it takes you right there"}, {"username": "Eliz Fragoso", "comment_text": "When you arrive at the airport, there is free Internet, you can Google map it and hit the train button and it will tell you what train for your destination and how much it cost and departure times. Enjoy your trip.😎"}, {"username": "Sarah Stiltner", "comment_text": "Train! Super easy"}, {"username": "Pia Reilley Loughin", "comment_text": "For a few Euros more you can take a taxi to your hotel door!"}, {"username": "Dominic Po", "comment_text": "Shuttle $6.19"}, {"username": "Gundega Barkane", "comment_text": "Train"}, {"username": "Carolina Rodrigues", "comment_text": "Cab for sure"}, {"username": "Sam Passante", "comment_text": "Train is easy then cab from Termini to your accommodation if required."}, {"username": "Jan Armstrong", "comment_text": "Th train is great but depends on how long your journey is and how tired, heaviness of bags. We had a driver arranged and loved the 25min drive. We also used Uber as the heatwave got hotter and the drivers were all great."}, {"username": "Allan Olexa", "comment_text": "We always take the Leo…35 minutes from Termini to inside FCO."}, {"username": "Colleen Donovan Quinn", "comment_text": "The Leonardo express was super easy to use to Roma Termini. The station is right in the airport"}, {"username": "Larry Reinier", "comment_text": "Cab is safer"}, {"username": "Janet Messanelli Bozzone", "comment_text": "Take a cab. Worth it!"}, {"username": "Janet Messanelli Bozzone", "comment_text": "Taxi goes right to the door of your hotel. We took the train once. Never again. It was hot and there was a long walk to the train we were taking to Florence."}, {"username": "Maggie Gpe Banuelos", "comment_text": "The train hands down!!!!"}, {"username": "Benita Long", "comment_text": "Rome termini"}, {"username": "John Bruckman", "comment_text": "Take a cab, Termini crowded, lousy neighborhood, chaotic."}, {"username": "Barbara Bastianini", "comment_text": "I prefer a taxi."}, {"username": "Daisy Yoo", "comment_text": "Do a calculation , the train is 14 and taxi is 50 so for just few euros more u get safe trip and u do not need to transfer to metro after u get to train station to ur destination , we are also family of 3 , for sure will do taxi instead"}]}, {"id": "2195146084217803", "text": "Travel Book for exploring Tuscany by car?\nWine and food recommendations included. Please", "link": "facebook.com/groups/1373361046396315/permalink/2195146084217803/", "likes": 1, "comments": []}, {"id": "2195151390883939", "text": "For anyone that missed the opportunity to book Colosseum tickets at the 30 day mark check out the official site a week before your dates. I just booked tickets for entry next Tuesday at 5 pm. I've been watching the last few days and afternoon tickets have been available each day. Good luck!", "link": "facebook.com/groups/1373361046396315/permalink/2195151390883939/", "likes": 1, "comments": []}, {"id": "2195164787549266", "text": "Is it possible to drive yourself around Parma and stop at cheese and ham facilities? Or, is it necessary to go with a guide?", "link": "facebook.com/groups/1373361046396315/permalink/2195164787549266/", "likes": 0, "comments": []}, {"id": "2195178817547863", "text": "I’ll be traveling to Sicily (Noto area) and then Rome in early/mid August. I’m looking for restaurant recommendations for Noto and Rome! Thank you in advance. 😊", "link": "facebook.com/groups/1373361046396315/permalink/2195178817547863/", "likes": 0, "comments": [{"username": "Scott Perry", "comment_text": "Masto in Testaccio"}]}, {"id": "2195154447550300", "text": "Hi all...just wanted to find out the easiest way to book train tickets from Nice to Monterosso. The train exists via the Trenitalia website but I can't click on the ticket to add to cart? First time booking so I might be doing something wrong?:) thanks so much 🙏🏼", "link": "facebook.com/groups/1373361046396315/permalink/2195154447550300/", "likes": 0, "comments": [{"username": "Greg Saba", "comment_text": "You can only purchase tickets within Italy on the Trenitalia app. From seast61dotcom, the Bible for European rail travel: It won't book tickets to or from Nice as a change at Ventimiglia is necessary. The solution is simply to book a ticket using www.italiarail.\ncom between anywhere in Italy & Ventimiglia on the French border, where the Italian trains start/\nterminate, with cheap fares from €9.90 if you pre-book. Then simply buy an open ticket for €8 for the local train between Nice & Ventimiglia at the station, no reservation necessary for these. Or use www.thetrainlin\ne.com which can book both tickets, see the Nice-Italy by train page for more information."}]}, {"id": "2195152770883801", "text": "Staying in Rome for 4 days at the end of October, looking for excursion recommendations and where to book them! I saw Expedia has some excursions, is it worth it to use Expedia? I also saw they have day trips to Almalfi coast - is it worth it? Looking for all recommendations!", "link": "facebook.com/groups/1373361046396315/permalink/2195152770883801/", "likes": 2, "comments": [{"username": "Sarika Mehta", "comment_text": "I’m looking for the same. Possibly interested in going to Pompeii."}, {"username": "Cathleen Huismann Dinubilo", "comment_text": "Viator"}]}, {"id": "2195157637549981", "text": "Desenzano del Garda", "link": "facebook.com/groups/1373361046396315/permalink/2195157637549981/", "likes": 3, "comments": []}, {"id": "2195158807549864", "text": "Vipiteno -Italian Dolomites\n\n📷myself", "link": "facebook.com/groups/1373361046396315/permalink/2195158807549864/", "likes": 49, "comments": []}]