[{"id": "2209583196107425", "text": "Rome colosseum question-\nOn the coop website trying to book, no underground tickets or evening tickets available but this is- is this worth doing without the other parts? Seems like there are plenty of these tickets\n\nMany thanks for any help", "link": "facebook.com/groups/1373361046396315/permalink/2209583196107425/", "likes": 0, "comments": [{"username": "Amy French Baillie", "comment_text": "24 hour ticket was great…"}, {"username": "Karen Blackmore", "comment_text": "Night time tours just been released for early September!"}, {"username": "Dina Witter Pradel", "comment_text": "We enjoyed our daytime tour with a guide much more than the evening Underground tour…we found Palatine Hill and the Forum just as interesting as the Colosseum, if not more, and our guide explained everything about the Underground, so by the time we saw it later at night from a different perspective, it didn’t add much to the experience."}]}, {"id": "2209581672774244", "text": "Has anyone had problems bringing a medical device (cpap machine) onto the flight with ITALIA TRASPORTO AEREO?", "link": "facebook.com/groups/1373361046396315/permalink/2209581672774244/", "likes": 0, "comments": [{"username": "Sue Tamblyn", "comment_text": "I have a Spinal Cord Stimulator. Leaving Rome through security I was frisked twice. No one looked at the official letter I had and they even took my remote from me and temporarily lost it.Not happy’"}]}, {"id": "2209580172774394", "text": "We are traveling Milan-Varenna/Bellagio in September via train. Anyone have information for a private boat tour/operator in Bellagio? We can either pick up the boat in Varenna or in Bellagio. Also, if you have any activities/sites that we must see while in Varenna & Bellagio. Thanks in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2209580172774394/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "look here https://\nwww.viator.com/\ntours/Lake-Como/\n3-Hours-Bellagio\n-Private-Guided\n-Boat-Tour-on-L\nake-Como/\nd26113-112819P5?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}, {"username": "Francesca Giovanelli", "comment_text": "Francesca Giovanelli"}, {"username": "Francesca Giovanelli", "comment_text": "Francesca Giovanelli"}, {"username": "Francesca Giovanelli", "comment_text": "Francesca Giovanelli"}]}, {"id": "2209555772776834", "text": "We have a 10 AM flight leaving the Rome airport on April 26 - we are in Florence the day before and taking the high speed train to Rome. Originally I thought about staying near the airport the night of the 25th, but after reading reviews for Hilton and Hilton garden Inn I’m not sure. Would you recommend staying at one of those places or just staying near the train station in Rome?", "link": "facebook.com/groups/1373361046396315/permalink/2209555772776834/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g656615-d1561\n8676-Reviews-B_\nB_Hotel_Roma_Fi\numicino_Aeropor\nto_Fiera_1-Fium\nicino_Province_\nof_Rome_Lazio.h\ntml"}, {"username": "Sandra Shoffner", "comment_text": "We always stay in Rome the night before in case of issues. You need to be at airport 3 hours before."}, {"username": "Rebecca Yeoh", "comment_text": "I reckon stay near the airport if flight is that early. You need to be there by 7am so might as well. It’s 30 mins via Leonardo Express if you stay near Roma Centrale."}, {"username": "Joe Gelardi", "comment_text": "We stayed at the Hilton a few years ago and it was fine"}, {"username": "Melissa Ciske", "comment_text": "We stayed at the Hilton and loved it! The convenience was awesome but the hotel was nice and added to the experience. It was a nice, no hassle way to end the trip"}]}, {"id": "2209571466108598", "text": "I’ve always wanted to buy an interail ticket for a month and fully travel Italy ! However work annual leave probably wouldn’t allow that. So thinking of splitting it in half, same thing but 2 weeks in either the north or the south, summer 2024 for my 30th birthday. Then the other half another year.\n\nStruggling to decide which to pick north or southआणखी 🤦🏼‍♀️\n\nI want to see tourist hot spots but also get to see the inbetween bits by train travel and hopefully get some off the beaten track experiences to treasure.\n\nCurrently learning Italian and my Nonna was Italian and can’t help feel a connection to the country I want to know and see the ins and outs of.\n\nRecommendations welcome ☺️", "link": "facebook.com/groups/1373361046396315/permalink/2209571466108598/", "likes": 42, "comments": [{"username": "Lucrezia Folger", "comment_text": "Since you splitting it, doing one 1st and then the other, then it really doesn't matter if you start north or south unless it's winter vs summer."}, {"username": "Bella Z. Veksler", "comment_text": "Depending on season, south is very hot in the summer, north is hot but milder so if traveling different seasons over the two years then consider that"}, {"username": "Marella Johns", "comment_text": "South definitely\nI’ve done both\nSouth more hospitable 😀"}, {"username": "Ike Simoncini", "comment_text": "Phoe i wuold say 2 weeks is to short anyway:) and north or south are both good as long as you do'nt go north of lake garda. Not that its not beautifull over there but the food gets a little less. Lake como is more quiet and beautifull than garda but the food is less. In the north as you want to vist citys i would chose florance,venice\nof verona little more south i would do rome afcourse and sicly is realy nice as well it all depends on what you want beach,city or nice litle towns on the coast ofr in the mountains its all possible in italy"}, {"username": "Denise Rohe Frising", "comment_text": "Where is your nonna from? Maybe use that to make your decision unless of course she is from the middle lol"}, {"username": "Rose Turdo", "comment_text": "Rent a car. Land in Milan, leave from Rome. Drive up to Como, to Venice, across Tuscany to Pisz, Florence, Rome, Naples, Almafi, to Alberobello, back to Rome and Arrivaderci.\nPlenty of time to get a great taste of all. Maybe even time for Rimini. Perhaps save Alberobello for next trip with Puglia and Calabria\nGoogle Maps dnd Booking .com are great help. Don't pre book."}, {"username": "Lean Ni Chleirigh", "comment_text": "Depends on your budget and what kind of things you like. South is a bit easier on your budget. It has plenty of Roman and medieval stuff. North is pricier, but it has the iconic cities like Venice and Florence.\nFood is amazing everywhere, but if you are vegetarian, some places are easier.\nIn my opinion, it’s harder to do the south (including Sicily) without a car."}, {"username": "Cashell Sherwood", "comment_text": "Should have mentioned, I have already been to Treviso, Venice & Rome, so wouldn’t need to go to those"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "I recommend not going in the summer if you can avoid it!!"}, {"username": "Bob Dook", "comment_text": "If I were you, I would stay north for the first trip. Why? Because you have written \"summer 2024\". The second trip go to the south, but think Spring or Fall. I do not travel to Italy during the summer - too busy with tourists and can be very hot."}, {"username": "Louis Passariello", "comment_text": "Sounds outstanding, I would say based on the time of the year you plan your trip if it’s summer head north."}, {"username": "Andrea Bainbridge", "comment_text": "We spent a month this April and May only using trains. The Italian train system is a dream! Download the Trenitalia app.\n\n3 hour from Naples to Florence! 180 MPH! Turin to Milan. 1 hour almost 200 MPH. Connections a breeze.\n\nWe are so jealous"}, {"username": "Elizabeth Ciara Collen", "comment_text": "F"}, {"username": "Coral Musgrave", "comment_text": "Sicily."}, {"username": "John Wilson", "comment_text": "Go to eurail.com and check the cost of the Italian passes. Going for two weeks is cheaper than two one-week trips.if you just do the north, you can finish your trip by zipping down to Rome and flying out of Rome and whetting your appetite for a southern trip at the same time.(It’s a 4hour trip from Verona to Rome by train)"}, {"username": "Elizabeth Lupo DiVito", "comment_text": "Where is your family from? I would start there. We just took the train from Rome to Sicily and it was neat because you take a ferry across on the train."}, {"username": "Robin Anderson-Keller", "comment_text": "Start in the south and work your way up. Those that started up north and then went south were a little disappointed."}, {"username": "Suzy Coler", "comment_text": "If you do the northern part, you must visit the Dolomites; they are absolutely gorgeous and not over crowded with tourists!"}, {"username": "Susan Sassoon", "comment_text": "You are young. Get a job there and experience Italian life."}, {"username": "Terri Nelsen", "comment_text": "Definitely agree with several others about the summer being hot and crowded. If you can even move your trip to September it makes a huge difference in temp, fewer peeps, and accommodation prices go down a little."}, {"username": "Claudia Castellini", "comment_text": "If you want to move by train, it can makes sense “divide” Italy in “Adriatic side” and “Tirrenian side” more then north and south.\nThe connection through Appennini are difficult by train, except for the leg Bologna-Florenc\ne (and viceversa of course).\nAbout what area is better… Italy is all beautiful! 💚🤍❤️"}, {"username": "Vicky Hall-Newman", "comment_text": "I am doing this, this year! I just spent 2 and half weeks on holiday from work, then returned to Uk for a week. In that time I travelled to some of Eastern Europe. Then next week I am flying to Germany, coming through the alps by train and reaching Bergamo, where I will fly to Palermo and spent 10 days working my way back up. My work situation is different as I have a child so I am allowed 2 weeks a year unpaid to spend some time with her. So I took that option. Interrailing is awesome"}, {"username": "Rhona OConnor", "comment_text": "If you read the posts in this group everyone is going to the same places... I would avoid them. I went south and loved it, not crowded and georgous places to see."}, {"username": "Sonya Victoria", "comment_text": "South is the best..where was your Nonna from?"}, {"username": "Edoardo Casolo", "comment_text": "Go north, visit Verona and Vicenza"}, {"username": "Shelton McBride", "comment_text": "Depends on time of year. Hotter in south. Avoid the heat. Colder in the north. If you go to Alps or Dolomites, avoid heavy winter and reduced travel. I would start in north in April or May, September or October. Just my opinion."}, {"username": "Bob Lampo", "comment_text": "I would start with a good travel book. Rick Steves or Foders. Well worth taking a few day to read up and plan.\nTrains are best booking as you need them. Very reasonable and train passes rarely pay off."}, {"username": "Sam Mah", "comment_text": "I would factor in where you are coming from and how you're getting there and back. I would make it the easiest quickest way first as that will give you more time for the actual travel first time around. One of the things we found (on a 3 month trip) is we didn't realise how long it would actually take to go as far as we thought we wanted (keeping in mind we could afford to spend more time in some places)."}, {"username": "Janis Belkin Sowell", "comment_text": "It all depends on your interests....bo\nth have tons to offer"}]}, {"id": "2209570186108726", "text": "Going to be in Italy Nov 10-16 for the first time and having a hard time to figure out what attire to take on my trip if y’all could let me know I’d be appreciated it very much !!", "link": "facebook.com/groups/1373361046396315/permalink/2209570186108726/", "likes": 1, "comments": [{"username": "Jenny Payne", "comment_text": "Layer is the key , good pair of leather boots with rubber soles & a warm puffer long jacket. I wear tight thermal clothes 🌻"}]}, {"id": "2209567652775646", "text": "Hi Everyone, we will be in Montepulicano, Tuscany in 10days time and wanting to do a balloon flight for 4adults. I am aware of a company based in Florence that can take us but as a private flight only which is way too expensive.\nI know there was a company pre covid that was located near Montepulicano that did shared flights but they are not replying to emails.\nHas anyone done a shared balloon flight from the Montepulicano area this year and could provide me with contact information.\nThank you", "link": "facebook.com/groups/1373361046396315/permalink/2209567652775646/", "likes": 2, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "look here https://\nwww.viator.com/\ntours/\nMontepulciano/\nBalloons-flight-\nover-Tuscany/\nd27742-21717P4?p\nid=P00070587&mc\nid=42383&medium\n=link&medium_ve\nrsion=selector"}, {"username": "Maryann Collidge", "comment_text": "My question is for anyone that done this, this year.. one suggested is $3200 for 1 hour and one review in 2019."}]}, {"id": "2209564976109247", "text": "Hey everyone!\nIm going to be visiting south Italy end of September and was just wondering what is the best way to get from Naples airport to Sorrento and then from Sorrento to Positano and then from there up to Rome?\nFirst time visting Italy so any helpful tips/must do things to see and visit is greatly appreciated.\n\nThanks\nEmma", "link": "facebook.com/groups/1373361046396315/permalink/2209564976109247/", "likes": 6, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Sorrento/\nPrivate-transfer\n-from-Sorrento-\nto-Napoli-Airpo\nrt-with-minicab\n/\nd947-227297P5?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "Lydia Leyla Cosgrove", "comment_text": "Depends on how much you want to spend! You can get a bus to the train station in Naples and then get a train to Sorrento.\n\nThere is no train between Sorrento and positano so you would get a local bus.\n\nHeading to Rome you could probably get a transfer from positano to Naples train station and then get the fast train from Naples to Rome (it’s only an hour) or get a bus from positano to Sorrento. Train from Sorrento to Naples and then train from Naples to Rome!\n\nMore expensive options are car rental or transfers!"}, {"username": "Renee Willems", "comment_text": "Best way Napels airport to Sorrento is Curreri bus for 10 euros.\nSorrento to positano by sita bus to go and by boat to come back.\nSorrento to rome by train"}, {"username": "Christine Golia Brigida", "comment_text": "Amalfidrive4you"}, {"username": "Rachael Richardson", "comment_text": "Train direct from Naples to sorrento local line no need to book,\nSorrento to positano bus a couple of euros , train back to Rome"}, {"username": "Amy French Baillie", "comment_text": "Campania express train Naples to sorrento (more expensive but more comfortable than circumvesuvia - 15 euros instead of 2.60 euros approx)\nSorrento ferry to Positano and back - buy ticket on the day.\nSpeed train from Naples to rome is just over an hour. Frecciarossa…"}]}, {"id": "2209551576110587", "text": "Planning our trip for April. We will be in Sienna for 2 nights then traveling to Venice. We would like to stop in Bologna for the day to see the car museums. Does the train station have luggage lockers ? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2209551576110587/", "likes": 0, "comments": []}, {"id": "2209547652777646", "text": "What is there to do in Trieste?\nBest way to travel from Trieste to Venice? Any recommendations for someone staying in this area before a cruise?\nThanks so much", "link": "facebook.com/groups/1373361046396315/permalink/2209547652777646/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Trieste/\nMiramare-Castle-\nEntrance-Ticket\n/\nd4239-14982P65?p\nid=P00070587&mc\nid=42383&medium\n=link&medium_ve\nrsion=selector"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Trieste/\nTrieste-cruise-t\nerminal-private\n-transfer/\nd4239-323943P3?p\nid=P00070587&mc\nid=42383&medium\n=link&medium_ve\nrsion=selector"}]}, {"id": "2209541986111546", "text": "Amalfi Coast earlier today 💙💙💙", "link": "facebook.com/groups/1373361046396315/permalink/2209541986111546/", "likes": 12, "comments": [{"username": "Mieke De Cnodder", "comment_text": "I'll be there in october :-)"}, {"username": "Cindy Donaldson Fouts", "comment_text": "Can anyone use the umbrella's and chairs ?"}]}, {"id": "2209537302778681", "text": "Does anyone know the official website to buy ticket for Galleria Accademia in Firenze?", "link": "facebook.com/groups/1373361046396315/permalink/2209537302778681/", "likes": 0, "comments": []}, {"id": "2209517992780612", "text": "i’m looking to book a day trip to milan via train. which station is best to leave from and arrive at?", "link": "facebook.com/groups/1373361046396315/permalink/2209517992780612/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Milan Centrale"}]}, {"id": "2209525616113183", "text": "Hi friends i have a couple specific questions about transport to and from FCO. Our hotel is in Trastervere so it doesn’t make much sense for us to take the Leonardo since regional trains to trastervere station are about as long (27min). We arrive into FCO and three days later pick up our rental at FCO, so i need to travel twice (So id rather notआणखी spend $50 each way on taxis)\nWe are aiming for COO and we are two capable adults. Questions:\n\n- Im planning on buying regional trenItalia tix once there so i can better estimate time and have them already validated on my phone, does this make sense? That way we can get off at Trastervere station\n\n- Can i use the Rome 72hr pass for this regional train? Can i buy the pass online? And if so, do you have the official website? I keep running into fakes. Do you show the pass as if it were a single ticket and does it remain validated for the 72hours?\n\nThank you!!", "link": "facebook.com/groups/1373361046396315/permalink/2209525616113183/", "likes": 0, "comments": [{"username": "Scott Perry", "comment_text": "The Trastevere station could be quite a distance from your hotel. You might want to look into buses from the train station."}, {"username": "Jerry Japczyk", "comment_text": "Tram number 8 go through trastevere you can use your pass"}, {"username": "Jerry Japczyk", "comment_text": "Sorry you can ketch it at the trastevere train station tram number 8"}, {"username": "Jerry Japczyk", "comment_text": "No it is light rail that runs in the city on tracks"}, {"username": "Jerry Japczyk", "comment_text": "From the airport take the fl1 train to trastevere station then take tram number 8 to plaza mastal stop your by Santa maria plazza"}]}, {"id": "2209526899446388", "text": "Does anyone know of an inexpensive car service to get from Rome airport to Tuscany?\n\nWe are also staying in Venice and wondering about the Gondolas. Should we book online in advance or find one on-site? We want a private ride.\n\nThanks!", "link": "facebook.com/groups/1373361046396315/permalink/2209526899446388/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nPrivate-Arrival-\nTransfer-Rome-H\notels-or-Fiumic\nino-Airport-to-\nTuscany-Hotels/\nd511-5476ROMTUSC\nANY?pid=P000705\n87&mcid=42383&m\nedium=link&medi\num_version=sele\nctor"}, {"username": "Paola Barbetti", "comment_text": "Tuscany where??"}, {"username": "Penny Reed", "comment_text": "Discover car is. Great"}, {"username": "Devon Grandi Powell", "comment_text": "You do not need to book gondolas ahead of time - they are numerous and have many locations. You won’t need to share."}, {"username": "Allison Carlisle Young", "comment_text": "Try limousinrome.co\nm he responds quick with quotes and availability. We had good luck and fair pricing with him"}, {"username": "Alicia Burno", "comment_text": "We just went on a gondola. It is 80 euros for the gondola, during the day, and 100 euros at night. You pay cash and right there you get one."}, {"username": "Darcy Jessen", "comment_text": "Movin Rome. We used them 45 euro"}, {"username": "Jennifer St. Germain", "comment_text": "If you aren’t planning on hiring driver to drive you around while you are there rent a car. In Tuscany you need a car. Or stay in Florence and just book tours into Tuscany."}]}, {"id": "2209529856112759", "text": "What's special to do on weekend nights in Florence? any special clubs with international music?", "link": "facebook.com/groups/1373361046396315/permalink/2209529856112759/", "likes": 0, "comments": []}, {"id": "2209527896112955", "text": "a couple in italy for their first time... staying for 3 nights in naples or 3 nights in sorrento?", "link": "facebook.com/groups/1373361046396315/permalink/2209527896112955/", "likes": 7, "comments": [{"username": "Ettore de Vita", "comment_text": "If you renting a car stay all 6 days in Napoli, and go site seeing"}, {"username": "Marella Johns", "comment_text": "Sorrento"}, {"username": "Diana Sideris", "comment_text": "Sorrento if warmer months may to October"}, {"username": "Kally Trahearn", "comment_text": "Sorrento. Every. Single.Time.\n\nGood connections from there to Amalfi coast, Capri, Pompeii, Herculaneum and even Naples"}, {"username": "Flavia Di Bello", "comment_text": "100% in Naples - it’s a beautiful city full of culture, incredible history, architecture and with a thriving food scene. Also it’s a great base from which to visit Sorrento if wanted, or the islands. I’d be happy to recommend things to do! You could spend a week and never be bored.\nAlso… what month are you planning to go?\nAnd out of interest… why an anonymous post? 🤔"}, {"username": "Chelsea Gudith", "comment_text": "*SORRENTO*"}, {"username": "Barbara Bastianini", "comment_text": "Sorrento is my choice."}, {"username": "Danielle Marilyn", "comment_text": "Sorrento"}, {"username": "Amy French Baillie", "comment_text": "Sorrento 😊"}, {"username": "Millie Hayes", "comment_text": "Sorrento"}, {"username": "Anna Gambino", "comment_text": "Sorrento. You can get anywhere from there."}, {"username": "निनावी सहभागी", "comment_text": "Note: this will be October time!"}, {"username": "Jaime Wilson", "comment_text": "Just left Sorrento it was amazing 🙂"}, {"username": "Kimberly MacKinnon Cherry", "comment_text": "Sorrento"}, {"username": "Lorissa Gill", "comment_text": "sorrento"}, {"username": "Debbie Lee", "comment_text": "Not been to Naples but Sorrento is beautiful 😍"}, {"username": "Lucrezia Folger", "comment_text": "Have you read about them both?? Completely different, coin toss."}, {"username": "Shannon Packard", "comment_text": "Sorrento!"}, {"username": "Jasmine Tayla", "comment_text": "Sorrento"}, {"username": "Donna Harrison", "comment_text": "Sorrento hands down 🙌"}, {"username": "Lynn Guerrieri O'Malley", "comment_text": "Sorrento. Hotel Mediterraneo Sorrento"}, {"username": "Joyce Patire Slivinski", "comment_text": "Sorrento. But take ￼ the time for a tour in Naples. ￼"}, {"username": "Graciela Delgado de Saldivia", "comment_text": "Sorrento. Hotel La Minervetta"}]}, {"id": "2209517946113950", "text": "Thanks to this group's tips and info, the trip to Positano was amazing 😇#tickedmybucketlists\nSadly I couldn't try the Positano pizza as I have limited time due to my exploration around the area. I bought the tour- from Rome to Amalfi coast via Get yoyr guide. Our tour guide was informative and so helpful.", "link": "facebook.com/groups/1373361046396315/permalink/2209517946113950/", "likes": 2, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2209516556114089", "text": "Deciding between Cinque Terre and Amalifi Coast for Mid May 2024", "link": "facebook.com/groups/1373361046396315/permalink/2209516556114089/", "likes": 150, "comments": [{"username": "Tiziana Pratt", "comment_text": "Amalfi for me 😎"}, {"username": "Bill Minna", "comment_text": "Amalfi Coast\nQuite a few nearby towns to explore, either by car or bus. Views are spectacular like no other place in Italy.\nDon’t forget to ferry over to Capri"}, {"username": "Carolyn Veivers", "comment_text": "Cinque Terre is the best place in Italia I have ever been to. Been to Italia 3 times now and longing to go back there. The whole of Italia is beautiful. Descent confrontations every day because they are so passionate about everything."}, {"username": "Diana Dietl", "comment_text": "Cinque terre!!!"}, {"username": "Malgorzata Chmiel", "comment_text": "Definately Amalfi, much more to offer 😊"}, {"username": "Vikki McKinley", "comment_text": "Tough one"}, {"username": "Melina Primus", "comment_text": "Amalfi😍"}, {"username": "Kate Bryant", "comment_text": "No brainer!! The Amalfi Coast! You see Sorrento, Positano and you before you get there, see Pompeii! The scenery is breathtaking!\nThe drive down that coast is spectacular! Enjoy 😉"}, {"username": "Marcella Manna", "comment_text": "Cinque Terre hands down"}, {"username": "Marietta Perfetti", "comment_text": "Do both you will be disappointed if you don’t!"}, {"username": "Pinky Re", "comment_text": "Cinque terre"}, {"username": "Gillian Ghent Spengler", "comment_text": "Hands down the Amalifi"}, {"username": "Sonny Timm", "comment_text": "I"}, {"username": "Irene Paonessa", "comment_text": "Amalfi Coast"}, {"username": "Sandra Rego", "comment_text": "Def amalfi"}, {"username": "Anna Topolinsky", "comment_text": "That's a hard one!! But if you have two weeks do both!! Italy has amazing train systems you can be from one coast to the other in one day"}, {"username": "Maria Avino Damico", "comment_text": "Cinque Terre for sure!"}, {"username": "Roobina Sarkisian", "comment_text": "Two different experiences , can’t compare. Each unique on its own"}, {"username": "Julie Hérard", "comment_text": "Amalfi"}, {"username": "Angela Diana", "comment_text": "Amalfi cost!!!! Must be the place"}, {"username": "Maria Villena Villanueva", "comment_text": "Definitely Amalfi Coast! Love nearby towns of Sorrento, Ravello, Capri, Positano. Will go back in a heartbeat❤️"}, {"username": "Maya Erhardt", "comment_text": "Nothing compares to the beauty of the Amalfi Coast. I’ve been to both and would choose Amalfi every time."}, {"username": "Jason Pick", "comment_text": "Amalfi"}, {"username": "Debi Sicurella Krulisky", "comment_text": "Amalfi"}, {"username": "Renee Rundle Stoneham", "comment_text": "To me it would depend on where else your visiting so you don’t waste too much time getting to one.\n\nIf all places you’re visiting are north of Rome etc then CT.\n\nIf going south to Naples etc then AC.\n\nIf you’re staying in Florence or the Tuscany area you can do a day trip to CT."}, {"username": "Dina Garrett", "comment_text": "Linda Williams, Julie Franco Mellow, BillandAngala Verley"}, {"username": "Loredana Fontanini Robichaud", "comment_text": "Following"}, {"username": "Geraldine Brady", "comment_text": "Amalfi coast is just stunningly beautiful. I adore it 🩷"}, {"username": "Dianne Riggs", "comment_text": "Both beautiful you will not be disappointed whichever one you choose"}, {"username": "Kellie Parkes", "comment_text": "Do both 💪🤙😂🥂🌟💕"}, {"username": "Michael Foster", "comment_text": "Amalfi by far… And you have the benefit of Pompeii"}, {"username": "Miranda Fioravanti", "comment_text": "Is als n appel en n peer,\nniet te vergelijken, allebei anders allebei prachtig"}, {"username": "Bethany Cagle", "comment_text": "Adrian Martinez"}, {"username": "Christine Matthews", "comment_text": "ugh. its like choosing between your two children. see both."}, {"username": "Colleen Campbell Bussey", "comment_text": "Amalfi you’ll never need to go to 5C"}, {"username": "Lynn Nelson", "comment_text": "Cinque Terre!"}, {"username": "Kathy Kelm Meinke", "comment_text": "Amalfi"}, {"username": "Debbie Vertucci", "comment_text": "Amalfi"}, {"username": "Kathryn Parker", "comment_text": "Just been to Amalfi. Very beautiful coastline but forget about getting into the water. Too crowded and you will need your thongs to get over all the pebbles!"}, {"username": "Thomas Mitchell", "comment_text": "I spent a month in Italy last summer. If you have to choose between the two, I say travel to Cinque Terre."}, {"username": "Johana Viviana Camargo", "comment_text": "Amalfi 💯"}, {"username": "Heyla Louw", "comment_text": "Cinque Terre for sure, we went this year end May to Amalfi, we could hardly move!!! Thousands and thousands of tourists….perso\nnally i also like Cinque Terre more, do all the villages!"}, {"username": "Stéphanie B-Fournier", "comment_text": "Amalfi Coast!!!!!!!!!!\n!!"}, {"username": "Bianca Neamți", "comment_text": "Amalfi Coast. The wonderful Positano."}, {"username": "Desiree Spiteri", "comment_text": "Both are wonderful but Amalfi is amazing"}, {"username": "Palmira Martinez Romero", "comment_text": "Cinque Terre! Beautiful! Can be visited in 3 days 2 nights!!"}, {"username": "Karen Sheingold Stevens", "comment_text": "Both…. But Cinque Terre is truly magical."}, {"username": "Jessica Krebs Boie", "comment_text": "Following Mary Brey Krebs"}, {"username": "Diane Bryant Abel", "comment_text": "Both"}, {"username": "Darcy Boyd", "comment_text": "Cinque terre"}, {"username": "Robin Runkle Harvey", "comment_text": "Been to both… Amalfi"}, {"username": "Corinne Scarfo", "comment_text": "You really only need 1 day to go through by train.\nIf Amalfi, pick 1 spot, go by boat to explore other areas"}, {"username": "Lisa Bassi", "comment_text": "F"}, {"username": "Vanjyotsna Kv", "comment_text": "are the tickets for May 2024 open already? i mean flights"}, {"username": "April Kasper", "comment_text": "Cinque terre!!!! So beautiful and great hiking!! You will love!!"}, {"username": "John Beilharz", "comment_text": "They are both like Disneyland, but May might be better. Stay in Santa Margherita and train to Cinque Terra. Not as crowded and beautiful"}, {"username": "Michelle Tristram", "comment_text": "Almafi Coastcis stunning. Stay at the Hotel Fontana in the Square next to the Cathedral. Contact Luana directly to book. Its truly amazing & the beach is across the road."}, {"username": "Barbara Beer Brown", "comment_text": "Amalfi Coast\nStay in Positano and take 2 days in Capri. Take a boat to take you there."}, {"username": "Denise Benden", "comment_text": "We recently went to Cinque Terre and it was amazing. I totally recommend it."}, {"username": "Denise Benden", "comment_text": "The train takes about 30 minutes to get from the first city to the last. And you can stop at any of the stops and get back on when you want to go to the next city."}, {"username": "Lynette Garland", "comment_text": "Cinque Terre hands down"}, {"username": "Giulia Cardamone", "comment_text": "Amalfi is gorgeous 🍋🍋🍋"}, {"username": "Denise Forté Beniamino", "comment_text": "do both!!"}, {"username": "Lorena Fanci", "comment_text": "Cinque terre for definite"}, {"username": "Deborah Pearson", "comment_text": "Cinque Terre for sure. It’s awesome"}, {"username": "Laurel Frost Coffey", "comment_text": "I was making the same decision for last year and we went with Amalfi. The landscape is just incredible. The mountains by the ocean are like nothing else. I literally drove in with my jaw dropped. I was so happy with my decision."}, {"username": "Magdalena Wostal", "comment_text": "Both❤️"}, {"username": "Manny Manny", "comment_text": "Do both:)"}, {"username": "Sharon May", "comment_text": "I hope I get to see Cinque Terre before I die. It’s been on my list for 20 years."}, {"username": "Nancy Surprenant Leclair", "comment_text": "Both"}, {"username": "Michelle Birdwell", "comment_text": "Amalfi is beautiful but very small I would only spend couple days there"}, {"username": "Dan Florin", "comment_text": "Cinque Terre first because Amalfi is incredebel"}, {"username": "Theresa Durante Bivona", "comment_text": "Amalfi Coast. Breathtaking and Unbelievable!"}, {"username": "Heidi Bakkane", "comment_text": "Amalfi Coast 👍"}, {"username": "Nora Batarseh-Afram", "comment_text": "Amalfi, but getting in and out, can be a nightmare if you are traveling during high season ￼"}, {"username": "Judy Crooks", "comment_text": "I loved both. We did an eight day self guided walk on the Amalfi Coast and got to experience small non tourist villages along the way. The scenery walking was amazing.\nWe also walked the five villages in Cinque Terra in 2008 snd that was amazing as well. Hard choice."}, {"username": "Barbara Foley-Bott", "comment_text": "Both"}, {"username": "Eva Wijayanti", "comment_text": "Amalfi Coast!"}, {"username": "Lisa Camarda", "comment_text": "Tough decision. Been to both. Conquer Terre see Ted”s explanation below. Spot on."}, {"username": "Janine Garbacz", "comment_text": "Amalfi Coast"}, {"username": "Kylie Norman", "comment_text": "Loved Cinque Terre!"}, {"username": "Kimberly Tracy", "comment_text": "Is December a terrible time to visit Italy?"}, {"username": "Maria Daniela Simoncini", "comment_text": "Amalfi coast!"}, {"username": "Holly Calantoni", "comment_text": "We did both within 10 days, Almalfi coast hands down. We stayed in Positano can’t wait to go back."}, {"username": "Jaymini Bragato", "comment_text": "Amalfi / Positano"}, {"username": "Kimberly Whitaker", "comment_text": "Amalfi coast is beautiful."}, {"username": "Tony D'Andrea", "comment_text": "Omg the 2 best places in all of Italy. If u like to hike that’s an added option for Cinque Terre. But if I’m choosing I’m back to Amalfi I could spend the rest of my life there enjoying the beauty of it all."}, {"username": "Rola Ghazi Moujalli", "comment_text": "We just arrived in Italy and cinque Terre was beautiful paradise beaches and scenery to die for"}, {"username": "Susan Sassoon", "comment_text": "What worries me about train travel is are there escalators or elevators in the stations. My knees are not what they used to be. Climbing stairs would be a problem."}, {"username": "Wendy Doran", "comment_text": "Cinque Terra!!"}, {"username": "Dorothy Press", "comment_text": "Amalfi coast 💕🤗"}, {"username": "Henry Abela", "comment_text": "Both amazing but Amalfi coast tops the list"}, {"username": "Tetyana Tetyana", "comment_text": "I planned my trip to Amalfi month before trip..why need to plan year before…."}, {"username": "Diana Andresen", "comment_text": "Amalfi Coast hands down ! 💓"}, {"username": "Monia Widing-pasuram", "comment_text": "If you have time visit both❤️❤️❤️"}, {"username": "Cath Vinall", "comment_text": "Thames are both amazing places !!!"}, {"username": "John Kinchin", "comment_text": "Cinque Terre and include Porto Venere"}, {"username": "Melanie Lawson Mann", "comment_text": "Amalfi, I did both on the same trip . Amalfi stole my heart . It was beautiful. In saying that we were there in March and it wasn’t busy yet . I don’t know if I would say that during peak season . I have seen some pics of it being really busy."}, {"username": "Tracey Knipe", "comment_text": "Amalifi if you want to swim a lot! Cinque for scenery ❤️"}, {"username": "Margaret Williams", "comment_text": "Tough decision!"}, {"username": "Colleen Cassar", "comment_text": "Amalfi"}, {"username": "Jozef Repka", "comment_text": "Amalfi"}, {"username": "Julie Strauss", "comment_text": "Lex Strauss"}, {"username": "Vivian Scarpino", "comment_text": "I love cinque Terre ❤️ but July is too busy, mid May will be perfect!"}, {"username": "Beth Templeman Brock", "comment_text": "Does it get any prettier than this! AC!"}, {"username": "John Ferr", "comment_text": "Amalfi Coast"}, {"username": "Julie Sorrentino", "comment_text": "Hard choice"}, {"username": "Carole Cascarelli", "comment_text": "Both"}, {"username": "Marianne Aus", "comment_text": "Cinque terra hands down"}, {"username": "Inessa Vysotski", "comment_text": "Forte de Marmi!"}, {"username": "Christina Tsoulou", "comment_text": "Amalfi coast!"}, {"username": "Patricia Magee Maletto", "comment_text": "Amalifi"}, {"username": "Rosalie Devcich", "comment_text": "Do both"}, {"username": "Dallas Leigh", "comment_text": "I lived in Italy for years, and have done both 10+ times. Amalfi for me."}, {"username": "Paolina Lamb", "comment_text": "Don't choose!"}, {"username": "Belinda-Leigh Cooper", "comment_text": "I would say Cinque Terre. I recommend staying in each of the 5 towns. Early morning and late evening best time to avoid the tourists. Then you can take the time to discover how wonderful these little towns are. I hiked to each town but you can train it as well ❤️"}, {"username": "Marie Montafia", "comment_text": "I LOVE the Amalfi Coast and much prefer it over 5 Terre!! It’s one of my favourite places and May is a great time to be there - less tourists!"}, {"username": "Carla Bertozzi", "comment_text": "Mid may is perfect for Cinque Terre, good weather, warm and not too hot, villages not too crowded in that period of the year!"}, {"username": "Hudd Cass", "comment_text": "Amalfi is more of a fav for me."}, {"username": "Rowe Pea Guzman", "comment_text": "Amalfi coast.."}]}, {"id": "2209513896114355", "text": "Still in Rome\n1. Taxi- need to go to an official taxi pick up location with a sign not just hail a cab\nYou can google taxi stand near me\nIf u so manage to get one outside a designated area they will gouge you on price\n2. Get in shape\nWe have been walking 15-20k steps a day\nI sure wish I had prepared and walked more in advance but thankfully their is motrin and wine", "link": "facebook.com/groups/1373361046396315/permalink/2209513896114355/", "likes": 31, "comments": [{"username": "Diane Rogers-Gajewski", "comment_text": "I just said to my husband that I needed to get my steps in!!! Wine doesn't sound bad for an excuse 😂"}, {"username": "Karen Espinoza", "comment_text": "Motrin and wine lol I love that"}, {"username": "Jennifer Lynn Davis", "comment_text": "So I was in Perugia for a week before Rome so that was where I prepared for Rome and trust me Perugia is much worse. Lol. Everything there is straight up or straight down walking. There's no even surfaces. Rome was a cakewalk in comparison. 🤣 For taxis you don't necessarily have to go to a taxi stand. You can use itaxi or Uber to get a taxi from anywhere to anywhere which I had to do several times because I was nowhere near a taxi stand. However when I left to go to the airport there were six taxis lined up at a taxi stand so I had absolutely no problem getting back to the airport on time."}, {"username": "Lorraine Swick Sanfilippo", "comment_text": "I feel your pain, we were just in London. We walked about the same."}, {"username": "Lisa Mraulak Clark", "comment_text": "Also confirm your price before you get in the taxi. We went to the official stand between the Vatican and Castel Sant’Angelo a year ago and a cab driver tried quoting us a ridiculous price (like 50 euros) to go to over to Palazzo Navona. We refused to pay and approached another driver who yelled at the guy trying to rip us off. He was honest and wonderful and refused to take a tip from us. So yes, always get a quote before you jump in a cab even at an official taxi stand."}, {"username": "Christine Malota- Kendall", "comment_text": "Uber black was very inexpensive (compared to taxis) and so easy to use. Download the App. 15 euro for 3 ppl, from pantheon to the Vatican."}, {"username": "Paula Rosati", "comment_text": "Sightseeing is hard work! Training required for all those steps, and break in your shoes before you leave."}, {"username": "Ted Cabot", "comment_text": "They do have Uber in Rome as an option, not very cheap but you know the cost when booking at least"}, {"username": "Marie Andrée Chaloux", "comment_text": "You can use Freenow App. It’s cheaper than Uber. 🙂"}]}, {"id": "2209509569448121", "text": "Italia Firenze", "link": "facebook.com/groups/1373361046396315/permalink/2209509569448121/", "likes": 210, "comments": [{"username": "Nadia Mckenna", "comment_text": "Your photos are just amazing. Are you a professional photographer? I’m loving the food shots 😋"}, {"username": "Sarita Hiremath", "comment_text": "Amazing photography."}, {"username": "Roma H.Shah", "comment_text": "Brought back so many memories....was\nthere in May....sigh! Thanks for the lovely reminder"}, {"username": "MaryLou Capobianco", "comment_text": "Awesome pictures!"}, {"username": "Jenny Lena", "comment_text": "Wonderful picture!"}, {"username": "Denise Incandela Boccio", "comment_text": "Awesome pictures! Thanks for sharing! I will be in Florence in a couple of weeks, my son is getting married there👰🏻‍♀️🤵🏻🇮🇹"}, {"username": "Christine White", "comment_text": "You must have gone in October? People are wearing jackets, the window fashion, and the Halloween candy. Groom reminds me of Stanley Tucci. Love the food photos."}, {"username": "Heidi DeGraf", "comment_text": "Beautiful! I can’t wait to go next May!"}, {"username": "Lois Letterie Cianci", "comment_text": "Great pictures!! My favorite city!! Just booked my hotel room in Florence for next October, can't wait!!"}, {"username": "Christine Hesham", "comment_text": "Carol Hesham"}, {"username": "Havana Ramos", "comment_text": "Olbiz Sagarra"}, {"username": "Loretta Coccodrilli", "comment_text": "Love Italy."}, {"username": "Şerban Babiț", "comment_text": "Denisa Ioana"}, {"username": "Phyllis Waring", "comment_text": "Been there..done this..several times..one of the most beautiful places on earth!! Love..love Firenze!!"}, {"username": "Phyllis Waring", "comment_text": "Phyllis Waring"}, {"username": "Tracy Crouch", "comment_text": "Absolutely gorgeous!!!🥰"}]}, {"id": "2209506472781764", "text": "Advice on getting from Roma Termini to St. Peter's Square at 7am for a Vatican tour? I've done some research but not sure if I'm missing an easier way 🤣", "link": "facebook.com/groups/1373361046396315/permalink/2209506472781764/", "likes": 5, "comments": [{"username": "Rita Scotto Epifanio", "comment_text": "Take the metro A line toward Battistini e get off at the Ottaviano stop and then walk to the Vatican. Or you can also take a taxi.\n\nI was in Rome last week, and the metro is very easy to navigate. If you have an iPhone you can use the maps app and switch from drive to transit and it’ll tell you which metro line to take and which stop to get off of. We got a day pass for the metro for 7 euros a person and we found it very easy to navigate the city that way."}, {"username": "Melissa Cortez", "comment_text": "We did taxi arranged through hotel or schedule taxi with taxi now app or Uber app."}, {"username": "Gena Diaco Penland", "comment_text": "The metro Ottaviano stop is very close to the Vatican! It’s only a short walk from the station."}, {"username": "Heath Conn", "comment_text": "Taxi or walk"}, {"username": "Wendy Spano Bracco", "comment_text": "Taxi prearranged in advance."}, {"username": "Dayna Scinto", "comment_text": "We found there was plenty of taxis around at that time"}, {"username": "Jenny Payne", "comment_text": "I would organise a driver to pick u up ? My driver charges me €50 as my friend in Rome does organise it for me🌻"}, {"username": "Jill Brothers", "comment_text": "Rom to Rio app"}, {"username": "Dana Colantuono", "comment_text": "Use a lime scooter!"}, {"username": "Melanie Sartuche", "comment_text": "Taxi"}, {"username": "D'Anna Hohe", "comment_text": "I’d take a taxi - quicker and door to door. Not that expensive versus metro especially if you have two or three people."}, {"username": "Frank Hunt", "comment_text": "Train"}, {"username": "Rosamaria Piccolo-Robison", "comment_text": "Uber was reliable and easy!"}]}, {"id": "2209496179449460", "text": "I’m booking my flight from LAX to Florence for Feb of next year and the flight I’m looking at has a connection in Paris at Charles de Gaulle airport with only 1hr 25 min between flights. Is that enough time to get through customs?", "link": "facebook.com/groups/1373361046396315/permalink/2209496179449460/", "likes": 7, "comments": [{"username": "Diane Dickerson Roberts", "comment_text": "No!"}, {"username": "Donna Heitmann Clay", "comment_text": "I wouldn’t. We had 1:30 layover. 45 min late and our luggage didn’t make the connection. Spent 2 days in Italy with no luggage."}, {"username": "Lisa Williams", "comment_text": "No"}, {"username": "Christy Powers", "comment_text": "So we are flying from Virginia (us) to Canada then to Portugal. We will have to go through customs in Canada if it’s just a connecting flight?"}, {"username": "Mas Tas", "comment_text": "No. You will have to clear customs and probably claim and recheck your bag."}, {"username": "Juliette Noel Walf", "comment_text": "No"}, {"username": "Tammi Vajda", "comment_text": "We flew through there last year. We had a 2 hour layover. Our first flight was late. We ran like crazy and barely made the flight. Our luggage did not make it. Give your self more time. Paris is a huge airport."}, {"username": "Bob Dook", "comment_text": "Too tight for me. Not a fan of connecting in CDG, but at least it's better than having to change to Orly."}, {"username": "Terri Gliatti", "comment_text": "Risky for sure"}, {"username": "Suzie LG", "comment_text": "We had a stop at Charles de Gaulle from Atlanta to CDG to Naples, Italy. We flew Air France transatlantic who partners with Delta. A fantastic flight!\nWe went through Customs at CDG in 15min. and went directly to our next gate. We were at our next gate in 30min. No problems. It depends on how long the customs lines are. They were very quick. Just looked at my face, my passport, stamped my passport and I was on my way. No words were exchanged with customs agent…not one question!\nEasy peasy! BUT…this was in April before the summer travel crowds!"}, {"username": "Noelene Cameron", "comment_text": "Definitely no. CDG is big and can be chaotic. Because it is your initial entry point into Europe Schengen area You will have to go through immigration and passport control there which can take forever. In my experience You need a minimum of 2 and 1/2 to 3 hours. If your journey to Florence from home departure airport is all on one ticket, your luggage should go straight through to Florence with no need to collect in CDG. You will therefore go through customs in Florence but not immigration passport control"}, {"username": "Ivy Chen", "comment_text": "We had a 3.5 hour layover in cdg and barely made it. They make you go through passport control twice in addition to security. 3 lines you have to wait in and each one is Long!!!"}, {"username": "Arianna Reel Cook", "comment_text": "Nope.\nSide note, Norse Airways is having a sale from LA to London. I just booked that and then a connecting flight to Florence. It was cheaper and I’ll do anything to avoid a layover at CDG lol"}, {"username": "Diane Dillon", "comment_text": "Run!!! It will be VERY tight but not impossible per se"}, {"username": "Paul Anderson", "comment_text": "Yes"}, {"username": "Cheryl Trigg", "comment_text": "You don’t have to go thru customs, just transit. But sometimes you have to change terminals via bus so you could end up running."}, {"username": "Anna Alves-Regalado", "comment_text": "Nope! The airports are a mess these days. Been on 3 flights the last 3 months and all 3 have had delay issues.. One was delayed to the next day .."}, {"username": "Sarah Hadjinian Kirakossian", "comment_text": "We missed our flight s d had to sit in the airport 7 hours for the next connecting flight for us party of 6."}, {"username": "Jessica Petyo", "comment_text": "We just did that exact flight last month with COO and had plenty of time. You can tell passport control you have a short connection and they’ll put you in an expedited line. There isn’t much room for any errors or delays tho! I wouldn’t do it with checked luggage."}, {"username": "Robin Mendez", "comment_text": "I have that flying home so leaving Rome we fly to Paris and then Toronto. I thought I would be going thru Customs in Rome… so will I be dealing with all this craziness I hear about getting bags and going thru Customs in Paris 🤦‍♀️😩"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "You will only have to go through immigration:pas\nsport control not customs, but anything less than two hours is dicey."}, {"username": "Patricia Vlaun Kempton", "comment_text": "It’s doable, but you will have to hustle. I have had similar connecting times from SLC -FLR through CDG on Delta. I had carryon bags—no checked bags. I had to run, but I made it."}, {"username": "Diane Davis Lawyer", "comment_text": "We are flying Air France to CDG from ATL. Then, we're taking another Air France flight to Naples after a two hour lay over. I'm going to assume AF knows what they're doing and we'll have enough time to make our second flight. Did your airline sell you the combined tickets as a flight to Florence? Are both fights the same airline?"}, {"username": "Jeanne Bissell", "comment_text": "Not for me."}, {"username": "Linda Slover Bright", "comment_text": "My daughter and I made it in an hour and 15 minutes in May 2022."}, {"username": "Alexandra A Welker", "comment_text": "So tight, don't risk it."}, {"username": "Richard Dreo", "comment_text": "Usually if you’re buying both tickets from the same airline and they’ve scheduled the layover they have accounted for the necessary time to get from one gate to another including the passport control and security.\n\nIf it’s from separate airlines I would not risk it"}, {"username": "Abe Michelson", "comment_text": "Probably not."}, {"username": "Larry Basirico", "comment_text": "No. Possible? Yes, but not worth the anxiety. I won’t do less than 2 hour layover on international flights, and that’s pushing it. Charles de Gaulle will be your point of entry into the EU, so you’ll go through passport control there. That alone could take over an hour if it’s crowded."}, {"username": "Rosnani Konali", "comment_text": "Even if you are booked thru with luggage checked in all the way to Florence, anything less than 3hrs is risky.\n\nI think you may need to clear immigration in CDG within the airport restricted area , where there may be a Q.\n\nDo you know if you will be landing in the same terminal as you will be departing? Otherwise you will need time to travel between the terminals as well."}, {"username": "Sandy Radican Shikaly", "comment_text": "You will go through passport control in Paris... horrible airport and risking that connection... Customs will be a walk through in Florence if you have nothing to declare."}, {"username": "Charlene Noll", "comment_text": "Charlene Noll"}, {"username": "Ingrid Bowden", "comment_text": "No way!"}, {"username": "Esther Starren", "comment_text": "I once had 50 min to catch a connecting european flight, and really almost had to run to be in time.."}, {"username": "Barbara Dixon Woods", "comment_text": "Not enough time"}, {"username": "Christine Pinto Kulp", "comment_text": "Not enough time. Two to three hours between flights is safest."}, {"username": "Glenn Todd Webb", "comment_text": "Nope. I missed one just like that and had to stay in Paris 4 days."}, {"username": "Vicki Lynn", "comment_text": "Wouldn’t risk it. We missed out flight in Paris and we had 2 hours"}, {"username": "Linda Santucci Fries", "comment_text": "No. That is way too close a call. You’d never get your luggage transferred either. Even one hour is too close."}, {"username": "Renae Larcus", "comment_text": "Risky"}, {"username": "Ted Cabot", "comment_text": "In a word, no"}, {"username": "Rick Pierangeli", "comment_text": "NO"}, {"username": "Tami Sue", "comment_text": "Yes. But you can check out flying into Rome."}, {"username": "Bob Short", "comment_text": "Nope. Consider hiring a concierge service and it might be cheaper than changing your flight."}, {"username": "Virginia Lane", "comment_text": "No!"}, {"username": "Kelly Duplisea", "comment_text": "No way, that’s not going to work at all, sorry"}, {"username": "John Bruckman", "comment_text": "My experience in Paris is process is pretty quick. You shouldn’t have a problem."}, {"username": "Janet Knight", "comment_text": "That’s kinda tight. JMHO. I’d try to book it further apart."}, {"username": "Blanca Gil", "comment_text": "No, it’s cutting it very close. Times vary at passport control/\ncustoms/\nsecurity from 5 minutes to an hour and a half."}, {"username": "Brian Osman", "comment_text": "Wow, you will need to hustle!!!"}, {"username": "BatEl Kogman", "comment_text": "Anything under two hours is risky… in international"}, {"username": "Wendy Wallin", "comment_text": "A bit tight for stressless travel"}, {"username": "Valerie Collanton", "comment_text": "No. It is not enough time as you will have to go through security after you go through passport control"}, {"username": "Felicia Macchia", "comment_text": "If there’s a direct flight from LAX to Malpensa (milan) I would suggest do that and take the train to Florence. Its not a long train ride. Im from NY so I did a direct flight from JFK to Malpensa and drove to florence. (Went with family). At least you do not have to worry about delays from the first flight or missing the connection because of custom."}, {"username": "Debi Lin", "comment_text": "Never….always allow 4 hours"}, {"username": "Alla Zats", "comment_text": "Very tight connection. I wouldn't do it."}, {"username": "Linda Wallace Smith", "comment_text": "I would do anything I could not to have a layover in Paris. It’s a nightmare."}, {"username": "Leni Pop", "comment_text": "I would not risk it, unless it’s the same terminal. Even like that if you have a delay might be tight. Plus you still have to go through security even if you land and leave from same terminal"}, {"username": "Eloise Pilon", "comment_text": "Too stressful, not enough time. Especially when immigration is busy and you need to switch terminals."}, {"username": "David Mensi", "comment_text": "Does the Global entry help speed things up?"}, {"username": "David King", "comment_text": "Not at all. You’ll barely be off the plane and through passport control as your connecting flight takes off without you."}, {"username": "Sandra Shoffner", "comment_text": "I wouldn't trust, we had 2 and when we finally got to our gate they were boarding the last class."}, {"username": "Susan Morlan", "comment_text": "I wouldn’t risk it. Too stressful"}, {"username": "Frances McDonagh", "comment_text": "Little tips book a seat near the top at the aisle on first flight so you can get out quicker, time should be ok if going same airline they allocate that the timing should be ok. Only issue is always is first flight is delayed which is something beyond your control"}, {"username": "Monique Sullivan", "comment_text": "Not enough time to make it."}, {"username": "Frances McDonagh", "comment_text": "If you are switching terminals it makes it difficult I have a frankfurt to Sarajevo connection origin Dublin with 1hr 5 minutes but I have same terminal and no customs. Your airline has given quite short time tbh"}, {"username": "Allan Olexa", "comment_text": "Three months ago, we had a 50 minute connection plus our flight was 10 minutes late landing. We walked fast, almost ran, but made our next flight, even going through passport control. Our checked bags didn’t though."}, {"username": "Tara McCloud Odebrecht", "comment_text": "I wouldn’t do it. It’s possible for sure, but any number of things can go wrong. Passport control at CDG can be very unpredictable. Plus if there are any delays. I like 3 hours for international flights."}, {"username": "Gregory Smith", "comment_text": "I’d look at flying directly into FCO and taking the train. Or even Milan and then taking the train."}, {"username": "Antonio Aloè", "comment_text": "You don't get through customs if you are in transit you just go through immigrartion/\npass control."}, {"username": "Jose Velez", "comment_text": "It is too short, even if you make it, the bags will not"}, {"username": "Mat PO", "comment_text": "CDG is very big and busy… You will have no room for errors there…"}, {"username": "Dana Green", "comment_text": "Yikes"}, {"username": "Victoria Moorhead Murrow", "comment_text": "As long as you are purchasing the flight as a connection (as opposed to booking point to point). It is a legal connect time. Which means IF you misconnect, the airlines are obligated to secure seating on the next available flight."}, {"username": "Mieke De Cnodder", "comment_text": "When i came back from Calgary i had only 1h to my connection flight in Frankfurt. We had to go all the way to the other side of the airport and at costums they had to check my backpack extra. We had to rush and it was very stressful but we made it :-)"}, {"username": "Marion Hohmann", "comment_text": "Let the flight attendants know and, if nice enough will let passengers with a short connection off first. It’s possible if your connecting gate is close..still stressful though."}, {"username": "Julie Slavik Budnik", "comment_text": "CDG is a bit of a hot mess so I wouldn't think that is long enough."}, {"username": "Daisy Yoo", "comment_text": "We will get that route back to the state and the checked back will only be unimportant stuff and dirty cloth . We will however always try to do direct going into (we will have a direct to Rome coming into Italy ) and we leave from Bologna and will have a connection at cdg. To me cdg is 10 times better than Madrid (that is a maze nightmare)"}, {"username": "Jan Womack Hughes", "comment_text": "No"}, {"username": "D Rochelle Milton", "comment_text": "NOOOOO! From my experience no. Unless my layover is 3 hrs or more, every time I route to CDG for connections I make it by the skin of my teeth…. either due to my flight arriving late to CDG (2nd largest/\ntrafficked airport in Eur.), and/ or bc of customs, and terminals. Some will blame (my) cheap airfares…. I’ve spent $$$$ and $ yet still the same.\nTo lessen my stress, I started flying to Eur. via Brussels.\nJust my experience, good luck."}, {"username": "Madeline Caporale", "comment_text": "I certainly would not risk it. At least 2 hours and to be really safe closer to 3."}, {"username": "Stephanie Smith", "comment_text": "It’s only passport control, much faster than a true customs clearance. I’d roll the dice on that if it’s one ticket…."}, {"username": "Jim Campbell", "comment_text": "The airports were our only source of stress. We would definitely do them different. As well as add more time between flights if we had a choice. Because the airlines do not care about customer service at all!!!!!!!!!"}, {"username": "Gil Rodriguez", "comment_text": "I've done it and you need more time..."}]}, {"id": "2209488032783608", "text": "Leaving Positano tomorrow to head to Pompeii one night before heading home. Was thinking of stopping in Sorrento a few hours on the way to Pompeii? Any recommendations for a quick 2-3 hour stop in Sorrento?", "link": "facebook.com/groups/1373361046396315/permalink/2209488032783608/", "likes": 1, "comments": [{"username": "Joan Belserene Forcheski", "comment_text": "We took the trolley ride, which was terrific in the heat. It gives you a quick if of the town & along the water. It’s located on the Main Avenue past the basilica."}, {"username": "Amy French Baillie", "comment_text": "Lovely to wander pedestrian area - shops, restaurants, gelato"}]}, {"id": "2209477562784655", "text": "I’m looking at spending 2nights in Venice, 4 nights in Tuscany/Florence and 3 nights on the Almafi Coast/Sorrento /Capri. Flying into Venice, out of Naples . Taking the high speed train from Venice to Florence, Florence to Naples/Amalfi. I don’t have the details down yet but wondering if this is do-able in 10 days. My first trip to Italy at age 66 and trying to get in as much as possible with hopes of a second trip! Any suggestions would be much appreciated!", "link": "facebook.com/groups/1373361046396315/permalink/2209477562784655/", "likes": 1, "comments": [{"username": "Barbara Harris Staring", "comment_text": "sounds amazing!!!"}, {"username": "Melody Miles", "comment_text": "I have similar itineraries, Mine is 13 days not counting the international travel, I have been to some big cities like Rome, Venice, Florence, Assisi, and Pisa, Still want to revisit but would spend more time to Chinque terre, Amalfi, Positano and Milan , It’s very doable just do more research and I got an apps for Omio and Trenitalia and I will more info on the taxis and also contact my hotels for shuttle. Hope you enjoy and have a safe travel . God bless.."}, {"username": "Carole Tarlap", "comment_text": "It's doable AND rushed💥 Is this including travel times/days🤔 save Amalfi Coast and Sorrento for your next trip. Spend the time enjoying and feeling Italy...do not rush, NO FUN!"}, {"username": "Valerie Collanton", "comment_text": "Very doable. A little rushed so if you can add a couple more days that would be great. Ideally I would want at least 3 days in Venice, 5 in Florence, 4 in the Amalfi Coast. If you can’t add more days still Go ! You will get a taste of each place and maybe come back and spend more time."}]}, {"id": "2209472682785143", "text": "Lago di Misurina is worth a visit when in Italy🥰🇮🇹!", "link": "facebook.com/groups/1373361046396315/permalink/2209472682785143/", "likes": 2, "comments": []}, {"id": "2209470369452041", "text": "Where are the best dinner spots in Rome with real authentic Italian food? Not the tourist traps that are open all day.\n\nLeave suggestions in the comments!", "link": "facebook.com/groups/1373361046396315/permalink/2209470369452041/", "likes": 0, "comments": [{"username": "Anne Gee", "comment_text": "Trattoria Lilli, near Castel S. Angelo was a great little family run place with amazing food. All italians were eating in there.\nhttps://g.co/\nkgs/4rWaoC"}, {"username": "Rhonda Hope", "comment_text": "If you search in search bar in group you will see plenty of recommendations"}]}, {"id": "2209396386126106", "text": "Hello everyone, excited to be part of this group! Travelling in November to Tuscany…\n￼ looking for some recommendations for hotels in the area of Oltrano- ￼ across the river in Florence staying the three nights before going to Siena again some recommendations over there would be lovely with respect to hotel.\n￼ also when we come back flight is very early in the morning and I was wondering if you had some hotel recommendations near the airport.\n￼ looking forward to being part of this group, and thank you all in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2209396386126106/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.jdoqocy.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187895-d2290\n32-Reviews-Plaz\na_Hotel_Lucches\ni-Florence_Tusc\nany.html"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187895-d2029\n65-Reviews-Best\n_Western_Plus_C\nHC_Florence-Flo\nrence_Tuscany.h\ntml"}]}, {"id": "2209368846128860", "text": "Seeking recommendations for a reputable car hire company in Bari airport- with pick up from the terminal. 2 adults, 2 children and 3 large cases. Thank you 😊", "link": "facebook.com/groups/1373361046396315/permalink/2209368846128860/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "look at hertz or noleggiare, here you can find the best offers https://\nwww.discovercars\n.com/\n?a_aid=NextStop-\nItaly"}]}, {"id": "2209363512796060", "text": "Hey Everyone!\n\nAre there any recommendations for must-see wine tours around Florence which are approximately half day to a day in duration? We would prefer if transportation is included, and the more scenic the better! Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2209363512796060/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "look here https://\nwww.viator.com/\ntours/Florence/\nChianti-Region-W\nine-Tasting-Hal\nf-Day-Trip-from\n-Florence/\nd519-24285AGROUP\n?pid=P00070587&\nmcid=42383&medi\num=link&medium_\nversion=selecto\nr"}]}, {"id": "2209453202787091", "text": "Hello friends. I need a bit of help. I would love to visit the Amalfi coast area in October by myself for about a month. I would like to work half time (I can legally do that) and sightsee half time. I would like to rent a small studio with good internet connection and also rent a bike for the entire month. The idea is to make small bike trips आणखी each day (up to 20km return) and longer trips on the weekend. Maybe even a bus trip somewhere (Naples). Where should position myself? I do not need any frills, just the internet and access to bike rental. As I need to work, a hotel room or monastery would not work for me. Thank you very much in advance. 🚲", "link": "facebook.com/groups/1373361046396315/permalink/2209453202787091/", "likes": 0, "comments": []}, {"id": "2209444069454671", "text": "Hi, I’m traveling to Rome with my boyfriend in September. We’re first going 3 days to Rome. After that we want to travel in Italy from monday till saturday so 5 nights. After that we’re flying back from the airport in Rome.\n\nTips on where to go/ what to see/ where to stay?\n\nWe would be very grateful for some tips 😃", "link": "facebook.com/groups/1373361046396315/permalink/2209444069454671/", "likes": 0, "comments": [{"username": "Joanne Wright", "comment_text": "Florence and Tuscan countryside. We did that and I found it a perfect mixture of what Italy has to offer!"}, {"username": "Proper Angling", "comment_text": "Firenze is beautiful from there you can see Pisa and the Cinque Terra villages which are stunning if a little busy at this time of year!"}, {"username": "Ike Simoncini", "comment_text": "Inreed firenze is realy nice and if you are there you should enjoy the toscane landscape dont spend all of your days in the city but book an agriturismo in the area of chianti"}, {"username": "Diana Smith", "comment_text": "You can make as many stops as you want. Italy is all Beautiful! Everyone goes to Rome , Venice, Florence but you can stop on the way and visit Marche, Umbria, Tuscany… not only Florence. Bologna, Milan… you pick. Have fun."}, {"username": "Jenny Payne", "comment_text": "It’s still busy in Italy , so you might want to get organised and think about what area and book. I’m going in October and some places that I picked airb&b had gone 🌻"}]}, {"id": "2209437752788636", "text": "Hello all, looking for some advice. We are travelling to Italy at the end of the month, planning on spending 3 nights in Bologna then 4 near Florence. We are hoping to use the train to travel from the airport and around, maybe to Venice and Milan, still deciding where to visit whilst staying in Bologna. My main question is where's the best place to purchase train tickets and keep the cost reasonable, as I'm finding it a bit of a minefield. We will be two adults, one 16 year old, one 5 year old and a 1 year old.\n\nThanks in advance", "link": "facebook.com/groups/1373361046396315/permalink/2209437752788636/", "likes": 0, "comments": []}, {"id": "2209430896122655", "text": "I’m looking for a driver with Van in Milan to transport 7 people from Munich to Milan", "link": "facebook.com/groups/1373361046396315/permalink/2209430896122655/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "consider rent a van https://\nwww.discovercars\n.com/\n?a_aid=NextStop-\nItaly"}]}, {"id": "2209429992789412", "text": "My wife and I are planning 10 day trip to Sicily in May 2024. Our plan currently is 7 nights in Taormina and 3 nights in Siracusa. Day trips to Etna, Noto, and 1 tbd.\nIt will be our first visit to Sicily, 2nd to Italy. Should I keep things as they are (hotels reserved) or cut 2 days off Taormina for another location/\n\nThanks to all who respond", "link": "facebook.com/groups/1373361046396315/permalink/2209429992789412/", "likes": 0, "comments": [{"username": "Christine Chimi Inman", "comment_text": "We are doing 10 days… split equally between Taormina, Castellammare Del Golfo and Cefalu. IMO….. 7 nights in Taormina is too long. Pick a third location. I suggest Cefalu."}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "follow us https://\nnextstop-italy.c\nom/\nvirtual-tours/\nbest-of-sicily/"}, {"username": "Rhonda Hope", "comment_text": "3 nights in Taormina 3 In Siracusa and don’t miss Palermo"}, {"username": "Greg Saba", "comment_text": "Yes. A good split might be 3 nights Cefalu, allowing visits to places like Palermo, Castebuono, Caccamo. Hike up to LaRocca when in Cefalu. 3 nights in Taormina, allowing for Etna, Savoca, Castelmola. And, 4 nights Ortigia, to see Siracusa, Noto, Modica, Ragusa Ibla, Marzemmi, Catania, Act Trezza."}, {"username": "Bill Gillespie", "comment_text": "Looking forward to our 1st trip to Sicily April 2024, staying in Palermo all 5 days, doing day trips to the rest of the island."}, {"username": "Jeff Florian", "comment_text": "My wife is adament about staying in only 2 bases, with one being Taormina. Would Siracusa (Ortigia) or Cefalu be the best 2nd base. She wants minimum 5 nights in Taormina (with day trips to Etna, Castelmora and Isola Bella)"}, {"username": "Rose Turdo", "comment_text": "You're in Sicily !! TRAVEL !\nWill you be renting a car ?\nWay Too Much Time in Taormina, it's a tourist trap !\nBeautiful to see .... but !"}, {"username": "Lisa Abrams Argento", "comment_text": "I would say flip the days with the towns."}, {"username": "Mary Balistreri Swan", "comment_text": "Go to Cefalu its beautiful"}, {"username": "Starla Dawn", "comment_text": "I absolutely loved Hotel Mea at Lipari Sicily. Ocean view pool view beautiful room and the best food I had in Italy."}, {"username": "Lisa Giunta", "comment_text": "Having done a little bit of sicily, I am now returning and have 8 days ~ staying 2 nights Palermo, 2 night Agrigento, have a car and was wondering if some recommendations\nof other towns worth visiting and how long to spend in each..looking at S.Vito Lo Capo, Trapani, Marsala, sciaca? Have I allowed enough time?"}, {"username": "Roe Gallo Saks", "comment_text": "Palermo?"}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "We were just in Taormina for 3 nights. That was plenty of time. I would suggest adding another city. Sicily was so beautiful; explore more of it."}, {"username": "Lisa Adams Robertson", "comment_text": "Agree that it's too long in Taoromina. There's so much to see in Sicily!"}]}, {"id": "2209428236122921", "text": "I would love some tips for traveling international for the first time in the beginning March to Italy 🇮🇹 we will be doing it through the Adventures by Disney so we won’t have to buy train tickets, etc. Need help more in what to pack, bring and wear. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2209428236122921/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Travel Runner Belt – Stay comfortable all day while keeping your valuables hidden with this money belt. You won’t have to worry about being targeted for theft. ➡️ https://\namzn.to/41JKrje\nPower Plug Adapter - 4 USB Ports Wall Charger - Fast Charging Adapter for 150 Countries - Depending on where you’re coming from you might need an adapter to charge your electronics.\n➡️ https://\namzn.to/3bFvDhh\nAthletic Walking Shoes - No matter your plans for Italy, you know you will be walking a lot, so you will need shoes that can support you while sightseeing. These shoes will keep your comfortable over days of tramping on cobblestones.\n➡️ https://\namzn.to/3bA6ioP\nThe Chestnut 12 Compression Bags for Travel - Space Saver Bags\nJust roll the bag starting from the zipper to push the air out through the valves on the other side of the bag and you are ready to conquer the world with your tiny suitcase packed with all your belongings. ➡️ https://\namzn.to/3QjT5zu\nCollapsible Water Bottle Food-Grade Silicone Portable\nDid you know that in Italy you will find fountains where you can fill up your bottle with drinking water all over the cities?\n➡️https://\namzn.to/3XZZMdj\nTravel Bottles - Cute, small, and easy to store, these space-saving travel bottles are just what you need for your Italian trip. ➡️ https://\namzn.to/3P54nqe\nFoldable Travel Duffel Bag – It will be very useful for your Italian shopping. Extra space to bring home special souvenirs from Italy. ➡️ https://\namzn.to/3BPqu0K\nSolar Power Bank 4 Outputs USB C Quick Charge Qi Wireless Portable Charger with LED Flashlight for iPhone, Tablet, Samsung - Make sure your phone stays charged while you are taking photos or using Google Maps around Italy . ➡️ https://\namzn.to/3BOMoRN\nWomen Pashmina Scarf – It keeps you warm on the plane, an instant outfit improver and useful cover-up if you’re entering churches. When you enter an Italian church you are usually required to cover your knees and shoulders.➡️ https://\namzn.to/3JENTDO\nWine Bottle Protector- The best way to bring your treasured wine purchase back in your checked luggage ➡️ https://\namzn.to/3KzA9MI"}]}, {"id": "2209421042790307", "text": "How do you pay for public transportation. We have to get to the coloseum on our own. Do we use a credit card or euros?", "link": "facebook.com/groups/1373361046396315/permalink/2209421042790307/", "likes": 0, "comments": [{"username": "Jennifer Avrett", "comment_text": "Walk or take a bus. Buy bus tickets at any Tabacchi, cash or card"}, {"username": "Kimberly Moser Horincewich", "comment_text": "You can pay for the metro with a credit card right at the station."}]}, {"id": "2209420829456995", "text": "Do you need to get an international driving permit to drive a scooter?? Or does your local driver’s licence work for that?", "link": "facebook.com/groups/1373361046396315/permalink/2209420829456995/", "likes": 0, "comments": [{"username": "Marcus Hiesler", "comment_text": "International licence to drive in Italy is required."}, {"username": "Claire Fellowes", "comment_text": "What about hiring a car do we need international permit? We have full UK license"}, {"username": "Eleonora Nardone", "comment_text": "No you need to get an intrnational permit"}, {"username": "Antonio Aloè", "comment_text": "You need the same driving license you need for a car although you should get an internatiinal one in your country of residence."}, {"username": "Costero Home", "comment_text": "Can foreigners drive in Italy? Yes, if you're visiting, you'll need to have an International Driving Permit (IDP) along with your legal driving license."}, {"username": "Lorissa Gill", "comment_text": "Yes"}, {"username": "Lisa Warman", "comment_text": "Check your insurance policy too. They may not pay out if you don’t have one. They don’t cost much so best to be safe rather than sorry."}, {"username": "Sharon Milligan Martin", "comment_text": "Just do it. It takes 10 minutes"}, {"username": "Jennifer Avrett", "comment_text": "Yes. They're simple, quick and inexpensive. You need it if you get in an accident or pulled over."}, {"username": "Frank Hunt", "comment_text": "Whether a car, scooter or m/bike you will always need an International driving license to drive overseas, thems the rules.\nSometimes people only find the proper rules when their insurance gets cancelled after an incident or when stopped at a random police stop."}, {"username": "Albert Campagna", "comment_text": "If you have a US drivers license and you’re going to drive an automobile in Europe, you need to get an international drivers permit. And usually get those at AAA."}, {"username": "Jennifer Lynn Davis", "comment_text": "I never actually thought about that. There were tons of people on scooters in Rome but I never thought to ask them if they had to have any kind of special license for them."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2209403849458693", "text": "We will be staying at Airbnb in Venice and Milan, do they provide shampoos and conditioners? It indicates that it comes with a washer, do they provide laundry detergent? Do we have to bring our own? Your advice greatly appreciated! thanks in advance", "link": "facebook.com/groups/1373361046396315/permalink/2209403849458693/", "likes": 5, "comments": [{"username": "Annette Mayer", "comment_text": "You would want to send an email to the host"}, {"username": "Lucrezia Folger", "comment_text": "Can you ask the Airbnb? All are different, no way to no for sure unless you ask."}, {"username": "Shirley Lewis", "comment_text": "IF the Airbnb provides those items, I'm sure it will say in the description, I've usually found I need to provide my own."}, {"username": "Eric Parks", "comment_text": "All I have stayed at (which has been many) always provided them but the quality varied quite a bit. Some was pitiful and I went to a store the next more to get something different. Others have been so good (specifically soaps), that I found out where they bought it so I could get more...one even became my new daily soap. I do also travel with a small bar just in case."}, {"username": "Mary McClintock", "comment_text": "You might want to check their Airbnb posting. Usually lists the amenities. If not, contact your host through the Airbnb site."}, {"username": "Angie Hoff-Hess", "comment_text": "Contact your host"}, {"username": "Molly Roberts Siegenthaler", "comment_text": "Why are you not asking the host?"}, {"username": "Jean Monteforte Capuano", "comment_text": "We stayed in 3 Airbnbs recently. Some provided everything some did not. I would reach out and ask."}, {"username": "Rachael Richardson", "comment_text": "I’d contact the owner , we took our own wash pods , but most only had basic soap etc"}, {"username": "Amanda Jordan Brainard", "comment_text": "I have found the detergent sheets very handy to have since many only provide a little detergent.\nMost I’ve encountered in France and Italy only provide shampoo not conditioner. I brought my own."}, {"username": "Daisy Yoo", "comment_text": "Ask the owner , much more accurate answer that way"}, {"username": "Janet Messanelli Bozzone", "comment_text": "Communicate with your hosts directly. Each one is different."}, {"username": "Yvonne Ormson", "comment_text": "Oh my gosh— these are questions for your Airbnb hosts!"}, {"username": "Tracey Palombo", "comment_text": "I experienced a bit of both. Some had shampoo and no conditioner. Some had soap some didn’t. Some had dish soap some didn’t. I brought laundry pods with me. They don’t talk up much space. I bought shampoo there."}, {"username": "Shari Powers Roberts", "comment_text": "I travel with shampoo and conditioner bars. They work great and don’t take up room in your liquids bag. I also bring laundry detergent sheets."}, {"username": "Renae Larcus", "comment_text": "It varies. Ask your host."}, {"username": "Terri Gliatti", "comment_text": "Detergent sheets and shampoo n conditioner bars"}, {"username": "Alicia Burno", "comment_text": "I am doing that and I brought shampoo, conditioner and laundry sheets."}, {"username": "Sherri Leis Dillavou", "comment_text": "Every Airbnb I used in Italy supplied all of that"}, {"username": "Patti Porter", "comment_text": "It should be in the property info what is provided. It is for all ones I’ve looked at. And if you aren’t sure when read that contact host"}, {"username": "Jamie Bly", "comment_text": "There is no way for any of us to know what the Airbnb you booked will or won’t provide. Contact them directly."}, {"username": "Mary Balistreri Swan", "comment_text": "Best to ask the owner."}, {"username": "Gina Alexander", "comment_text": "Our place provided 2 washing machine packets but I bet you could get more if you asked. I have found in Europe shampoo is usually provided but conditioner was non existent in hotels and rentals"}, {"username": "Lisa A. Scale", "comment_text": "It varies, but I have noticed that not much is provided. I had one not even have toilet paper and another just have 1 roll of toilet paper. No shampoo or conditioner, not even hand soap. One place asked me to empty the garbage but did not provide any garbage bags for the kitchen or bathroom. Best to ask."}, {"username": "Jenny Payne", "comment_text": "I take my own washing sheets that are like tissues, and most don’t have dryers only washing machines🌻"}, {"username": "Michele Rossman", "comment_text": "Just stayed in two and both provided bath items and detergent. I did bring detergent sheets (from Amazon and took no room) and a couple travel bottles. I would shoot them a note tho if you don’t want to bring anything."}, {"username": "Lisa Akira", "comment_text": "Ask your host in advance! I did have those things provided at my air bnbs but best to check!"}, {"username": "Kimberly Lampros", "comment_text": "If they do they'll usually list it under the amenities. The places we stayed last year did not."}, {"username": "Cyndi Riley", "comment_text": "All the AirB&B’s we booked (11 of them) for next year all state if they supply it or not. Look at what this place offers list. It’ll be in bathroom list."}, {"username": "Heather MacDonald", "comment_text": "The ones we stayed in did. One had full size and one had travel size in a cute basket."}, {"username": "Carly Plantagenet", "comment_text": "If not...then there are shops. ."}, {"username": "Kristina Ruk", "comment_text": "Shampoo and conditions ussaly not there"}, {"username": "Cecilia Christine Costantini", "comment_text": "I have just stayed at one and there was just enough laundry detergent to use the washing machine once (we stayed for 8 days, so we bought some). At the previous place there wasn't any. But at the previous one there was a full bottle. So it is a bit of a hit and miss."}, {"username": "Jennifer Lynn Davis", "comment_text": "I bring my own shampoo and conditioner. I would also recommend the detergent sheets because they take up literally no room and are as light as paper."}, {"username": "Helena O'Neill", "comment_text": "I'd say message the airbnb host as they differ in what's provided, ours has been great with answering our questions."}]}, {"id": "2209397496125995", "text": "For single ladies who travel solo: what recommendations for accomodations (hotel, b&b, etc) in Rome (6 nights), Florence (4 nights) and Venice (4 nights)? Traveling in April 2024.\nWant to be close enough for walking most sites, or close to bus, train...but safe areas. Nice places, but not extravagant prices.\nAnd, if anyoine is interested in joining me, let me know. I plan to tour the major sites, museums and churches I missed the first time!", "link": "facebook.com/groups/1373361046396315/permalink/2209397496125995/", "likes": 0, "comments": [{"username": "Lydia Leyla Cosgrove", "comment_text": "I share in a B’nB in Venice Just off San Marco! Very secure and central called - Le Due Corone 😌"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Rome https://\nwww.jdoqocy.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187791-d2407\n419-Reviews-B_B\n_Hotel_Roma_Tra\nstevere-Rome_La\nzio.html"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Florence https://\nwww.dpbolvw.net/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187895-d2307\n23-Reviews-B_B_\nHotel_Firenze_P\nitti_Palace_al_\nPonte_Vecchio-F\nlorence_Tuscany\n.html"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Venice https://\nwww.kqzyfj.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187870-d1545\n8491-Reviews-H1\n0_Palazzo_Canov\na-Venice_Veneto\n.html"}, {"username": "Carmine Napolitano", "comment_text": "i liked the hotel smeraldos location, it was walking distance from the Vatican Piazza novona the pantheon and tristevere.\nPlus there are really good panini orancini gelato places across from there so you don't have to venture far for a quick snack when you're napping"}, {"username": "Edoardo Casolo", "comment_text": "Venice is always safe at night in my experience"}, {"username": "Elizabeth May La Duca", "comment_text": "Www.hostels.com & www.monasteryst\nays.com & convent stays [quiet]"}, {"username": "Amanda Rogers", "comment_text": "Hi - I just arrived back from Italy in May. Travelled a number of towns. Felt so safe everywhere I went. Walked the streets and laneways. In Rome I stayed at HS311 which was a perfect location. Rome was magical and not once did not being safe cross my mind. Enjoy."}]}, {"id": "2209354772796934", "text": "Has anyone used the luggage lockers at Rialto Bridge or St Marks Square? “Stow your bag” or”Luggage Hero”", "link": "facebook.com/groups/1373361046396315/permalink/2209354772796934/", "likes": 0, "comments": []}, {"id": "2209348609464217", "text": "My fiancé and I will be in Rome for our Honey moon in November. What are some restaurants that we need to check out. We want to plan at least one very romantic and fancy night!\n\nAlso what are some of your favorite dive bars?!\n\nAny an all recommendations are appreciated!", "link": "facebook.com/groups/1373361046396315/permalink/2209348609464217/", "likes": 0, "comments": [{"username": "Alexa Keefe", "comment_text": "Thanks in advanced yall 🥹"}]}, {"id": "2209340982798313", "text": "Heading to Italy Sep 3 (Rome, Florence and Venice for 13 days).\nColosseum and the Vatican are givens in terms of tours but we want to venture off the beaten path a bit so…\n\nPlease feel free to answer one or all of these questions! Thanks in advance!\n1. What would you recommend for tours and how far in advance should we book?\n2. Which site is the best for booking them?\n3. What other non touristy things would you recommend?", "link": "facebook.com/groups/1373361046396315/permalink/2209340982798313/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nAncient-Appian-W\nay-Catacombs-an\nd-Roman-Country\nside-Bike-Tour/\nd511-5284APPIAN?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Florence/\nCinque-Terre-Day\n-Trip-with-Tran\nsport-from-Flor\nence/\nd519-6367CINQUE?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Venice/\nMurano-Glass-and\n-Burano-Lace-To\nur-from-Venice/\nd522-3731MURANO?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}]}, {"id": "2209333176132427", "text": "Hello! My husband and I are getting ready to start planning our honeymoon/one-year anniversary trip for next summer 2024. Any advice for first time travelers to Europe? We know we want to spend time around the Almafi Coast, Florence, and Venice. Not sure which order of cities would make the most sense for travel. Would love any and all recommendations! 😊", "link": "facebook.com/groups/1373361046396315/permalink/2209333176132427/", "likes": 0, "comments": [{"username": "Lucrezia Folger", "comment_text": "Depends on where you fly into, that will determine where to start your trip. There are many posts on these 3 cities, plus Rome on this site, since they are always the top 1st travelers destinations. Remember the summer is high-season, crowded, and hotter than, ____. A year away you have plenty of time to start reading up and reading past posts."}, {"username": "Rachel Gray", "comment_text": "Always start with the non-beach places, then end your trip on the coast"}]}, {"id": "2209316542800757", "text": "Any recommendations for tried & true hotels in Trastavere Rome? Other area you would recommend close to sites, restaurants and bars etc.", "link": "facebook.com/groups/1373361046396315/permalink/2209316542800757/", "likes": 0, "comments": []}, {"id": "2209305902801821", "text": "Train question- I will be traveling lightly and wanted to know if anyone has done something like this and how it went.\nThe trains stop in many small towns and I thought to break up a longer trip - Naples to Florence for example by getting off in a town walking around then getting on the next train.\nI am seeing that tickets are valid for fourआणखी hours after departure. Does that mean if you miss a train you can catch the next one?\n\nDo not comment unless you have actually done this or planned it and decided against it for whatever reason.\n\nI know it’s unconventional and something not everybody wants to do.\nTIA", "link": "facebook.com/groups/1373361046396315/permalink/2209305902801821/", "likes": 12, "comments": [{"username": "Alessio Esposito Inchiostro", "comment_text": "Italy is not a movie set. 99.9% of cities are normal cities where people live, not attractions"}, {"username": "Bella Z. Veksler", "comment_text": "Local trains allow you to catch a different train but it does need to be planned, make sure there’s a later train available, we did this in Genoa, walked around the waterfront for a bit and had some lunch then went on to Nice, trains with reserved seats however require u to take that exact train that u booked"}, {"username": "Iris Garza", "comment_text": "They do stop, but only for a few minutes. Before you know it the train is moving. Take something to keep you busy, the rides are not bad at all, especially riding in business or premium. We scheduled ours in the morning and used the time on them to get more rest and go over our itinerary for that day. Beautiful sceneries during the ride."}, {"username": "Bella Z. Veksler", "comment_text": "Naples is definitely a very different vibe compared to Rome or Florence, you’ll get a lot out of visiting different parts of the country!"}, {"username": "Karen Fryer", "comment_text": "We travelled from Florence to Lucca, which involved a change at Pisa. At Pisa we left the station, went to visit the tower, then walked back to get on a later train. All fine. No validation issues because we had validated our ticket in florence. All local trains so no assigned seating."}, {"username": "Tami Sue", "comment_text": "I'll say most stops don't look inviting."}, {"username": "Kristy Bretagne", "comment_text": "If you buy a train pass for Italy you can have unlimited travel within the days you purchased so you could stow your luggage in a locker and visit a city before moving on"}, {"username": "Rachel Doocey", "comment_text": "We’ve just got home from our Italy trip,\nWe did Milan-Florence;\nFlorence-Rome and Rome-Naples all by Train, no delays, no cancellations, very easy to use: I did book business class which gave us extra room for luggage."}, {"username": "Claire Aldus", "comment_text": "Have you considered using an interail pass for Italy ?\nThis enables you to travel and use extra train journeys within your travel pass days . Just a thought x"}, {"username": "Lisa A. Scale", "comment_text": "I purchased a eurail pass and it allows for unlimited travel on a given day. We travelled long distances but stopped at certain places to explore for a few hours. It made the journey so interesting. We were not in a hurry and I did not want to plan too much so this was a great solution as I could book the tickets a few minutes before boarding. One stop we got off and visited Monaco, they do not allow you to store luggage anywhere in that country so we had to carry it but we just got on the Hop on Hop Off bus and enjoyed the sights, then went back to the train and continued on to Italy. I wish i booked for more days than I did as it was very handy to have the ability to jump on and off at will. (With the exception of some trains that require reservations). You can get a pass just for only Italy but we got the global one and travelled from Amsterdam to Italy through Belgium, France, Monaco. Now planning our trip from Italy to Belgium to return home. It’s a great idea to do it! Sorry I can’t answer about normal train tickets. Good luck!"}, {"username": "Bea Kuckens", "comment_text": "It's more work than you think to get on and off, deal with luggage, perhaps a different platform. We did an extra train (three instead of two) going from Brugge to Amsterdam so that we could see the Antwerp station. It was beautiful, but made for a long and exhausting day."}]}, {"id": "2209298802802531", "text": "If anyone has stayed here, I would love feedback on the location. I’ve read its further from the center but in a quiet neighborhood. We lots of IHG points and this is there property. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2209298802802531/", "likes": 0, "comments": []}, {"id": "2209298759469202", "text": "We are staying at the below hotel for 1 night earl Oct from Milan, the next day we are heading to Florence.\n\nVia Case Sparse 10, Domaso\n\nIs the location okay?\nIf not where else could we stay in Lake Como for £115 or less?\nIf so do you have recommendations for while we are there?\n\nआणखीhttps://www.booking.com/hotel/it/lake-como-beach-hostel.en-gb.html?aid=898224&label=hotel_details-sDhXWYQ%25401691496021&sid=90a6fe5220d6e426a60edb1aad514685&all_sr_blocks=100768012_371083010_2_0_0;checkin=2023-10-01;checkout=2023-10-02;dest_id=-116866;dest_type=city;dist=0;group_adults=2;group_children=0;hapos=1;highlighted_blocks=100768012_371083010_2_0_0;hpos=1;matching_block_id=100768012_371083010_2_0_0;no_rooms=1;req_adults=2;req_children=0;room1=A%2CA;sb_price_type=total;sr_order=popularity;sr_pri_blocks=100768012_371083010_2_0_0__5500;srepoch=1691496305;srpvid=bd5a54f523f706bd;type=total;ucfs=1&", "link": "facebook.com/groups/1373361046396315/permalink/2209298759469202/", "likes": 1, "comments": []}, {"id": "2209876682744743", "text": "There is more to Italy than Rome, Florence and its big cities😍! You should also explore the Dolomites in northeastern part of the country and let yourself be surprised by how incredibly stunning they are🥰🇮🇹!", "link": "facebook.com/groups/1373361046396315/permalink/2209876682744743/", "likes": 1, "comments": []}, {"id": "2209879546077790", "text": "Up to the rooftop of Palermo Cathedral", "link": "facebook.com/groups/1373361046396315/permalink/2209879546077790/", "likes": 1, "comments": []}, {"id": "2209898599409218", "text": "We recently returned from our summer trip and thought of sharing this beautiful agriturismo. ☺️\n\nJune, 2023\n\nAgriturismo il Rigo\nVal d’Orcia, Tuscany", "link": "facebook.com/groups/1373361046396315/permalink/2209898599409218/", "likes": 257, "comments": [{"username": "Lisa Tanglao", "comment_text": "They should definitely use your photos for their website. Wow!"}, {"username": "Tania Bourgoin", "comment_text": "Beautiful photos"}, {"username": "Nancy Konte Pizzurro", "comment_text": "Absolutely amazing plus a beautiful little girl!!!!"}, {"username": "Sue McCallum Ross", "comment_text": "Just gorgeous! At first I thought it was where we stayed a few weeks ago! Such a beautiful area."}, {"username": "Toni Underwood", "comment_text": "Again, Authentic and Rustic, just beautiful, thank you for sharing 🩷"}, {"username": "Marlene Velis", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Carol Zook", "comment_text": "It's a beautiful place! We enjoyed our stay there May 2022."}, {"username": "Maria LaPietra Guerrero", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Kim Jordan", "comment_text": "Magic pics ✨"}, {"username": "Dulani Fernando", "comment_text": "Beautifully captured"}, {"username": "Angela Perky Perkins", "comment_text": "Angela Perky Perkins"}, {"username": "Claudine Auclair", "comment_text": "Beautiful! Great pictures. Your daughter had a wonderful time, looking at the pictures. That is what making memories is all about!"}, {"username": "Carol Marsh Foust", "comment_text": "Wow! Your photos are works of art."}, {"username": "Cher Copeman", "comment_text": "Wow! Absolutely stunning photos."}, {"username": "Sue Graham", "comment_text": "Absolutely beautiful!"}, {"username": "Mary Ann", "comment_text": "Your pictures are amazing! Love your sweet little daughter too 🩵"}, {"username": "Dana Green", "comment_text": "I am very interested in doing an agriturismo vacation in Italy. It looks fantastic ! Val d’Orcia is my fave part of Italy."}, {"username": "Fleur de Liz", "comment_text": "Lovely photos! Thanks for sharing!"}, {"username": "Mna Kaur", "comment_text": "Hey is this the place whwre you stayed ? I mean the villa"}, {"username": "Genevieve Ozoa Warshaw", "comment_text": "Genevieve Ozoa Warshaw"}, {"username": "Danielle Balch Blundy", "comment_text": "Wow! Amazing!!!"}, {"username": "Jessica Smith", "comment_text": "Beautiful photos"}, {"username": "Mary Andreotta", "comment_text": "Stunning photos!!!"}, {"username": "Karen M Gahrns", "comment_text": "Beautiful photos! Very artistic. And your daughter is precious."}, {"username": "Gilberto Rosas", "comment_text": "Wendy Isabel"}, {"username": "Jeff Cobb", "comment_text": "Beautiful"}, {"username": "Debbie Helge Casarella", "comment_text": "Bernadette Ferrazoli Clapsis this reminds me a little of the place you stayed."}, {"username": "Jade Hirst", "comment_text": "Gorgeous photos 😍"}, {"username": "Diane Cardamone-Pittman", "comment_text": "Stunning photos"}, {"username": "Paulina Jennifer", "comment_text": "Wow! Absolutely magical"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "wonderful! https://\nwww.anrdoezrs.ne\nt/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g668217-d6106\n27-Reviews-Agri\nturismo_Il_Rigo\n-San_Quirico_d_\nOrcia_Tuscany.h\ntml"}, {"username": "Debbie Horton Rough", "comment_text": "Beautiful"}, {"username": "Ryane Sabatelli Garcia", "comment_text": "Lorrie Sabatelli-Harri\ns"}, {"username": "Annette W Bryant", "comment_text": "Wonderful! What kind of camera did you use?"}, {"username": "Joyce van Hulst", "comment_text": "And what a beautyful little girl 💗"}, {"username": "Charlotte Ingram", "comment_text": "Beautiful 😍"}, {"username": "Sheri Robertson", "comment_text": "Beautiful pictures! What a lovely place!🌻"}, {"username": "Theresa Wong", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Betty Bartlett", "comment_text": "Beautiful memories"}, {"username": "Antonieta Murillo-Smith", "comment_text": "Do you know how close is this place to Florence"}, {"username": "Veronica Schindler", "comment_text": "Beautiful!"}, {"username": "Linda Chagnon", "comment_text": "Looks like this was truly a very special trip…. Congrats👏🌸🦋👳💖"}]}, {"id": "2209848376080907", "text": "Manarola, Cinque Terre", "link": "facebook.com/groups/1373361046396315/permalink/2209848376080907/", "likes": 10, "comments": []}, {"id": "2175921829473562", "text": "Sunset Cinque Terre Boat Tour with a traditional ligurian gozzo from Monterosso\nSail at sunset along the Cinque Terre Coast on a traditional and historic Ligurian boat. This is a wooden Gozzo that was carved by… आणखी a famous shipwright. On board, relax and enjoy local delicacies including various snacks accompanied by prosecco, beer and soft drinks. Learn about the history of the region under the guidance of the ships hospitality. Pass by the Vernazza, Corniglia and Manarola on this journey. Read more about Sunset Cinque Terre Boat Tour with a traditional ligurian gozzo from Monterosso - https://www.viator.com/tours/Monterosso-al-Mare/Sunset-Cinque-Terre-boat-tour-with-a-traditional-ligurian-gozzo/d51036-317618P1?pid=P00070587&mcid=42383&medium=link&medium_version=selector", "link": "facebook.com/groups/1373361046396315/permalink/2175921829473562/", "likes": 86, "comments": [{"username": "Cathy Ann", "comment_text": "Terry Toffolo\nLock it in ✅"}, {"username": "Angela Choe", "comment_text": "Stunning 😍"}]}, {"id": "2209265882805823", "text": "Hello I’m looking to visit Italy for my partners 30th birthday in December. Looking for the slightly warmer destinations if possible and lots to see and do…. Any recommendations please? We’ve been to Rome and loved it! Thank you in advance", "link": "facebook.com/groups/1373361046396315/permalink/2209265882805823/", "likes": 4, "comments": [{"username": "Angela Lynch", "comment_text": "Florence is my favorite! You can take some fabulous day trips from there."}, {"username": "Queen Dorcas", "comment_text": "That’s beautiful, Get the travel guide to Italy by Gary Ives on Amazon and thank me later 😊"}, {"username": "Donna Cafora Shepard", "comment_text": "I love all of Italy but I think there’s so much to do in Naples! Check it out! Even in December it would be great! I know a great place in the historic city center if your interested. Big room. Spotless and a balcony. Naples is also inexpensive compared to most of Italy. I just met my daughter there for two weeks in March and we had a blast! Go to my wall in March and see my pictures. Highly recommend the street food tour and I think that’s only about 40-45€ and you get so much to eat!"}, {"username": "Khushi Khanna", "comment_text": "Sicily would be warm in winter and there is so much to see."}, {"username": "Miyuki Kanno Paul", "comment_text": "“Slightly warmer destinations” in December may be Sicilia"}]}, {"id": "2209268802805531", "text": "Hello all- can you pls recommend restaurants in Sorrento, Amalfi and Positano and Rome.\n\nThank you!!!", "link": "facebook.com/groups/1373361046396315/permalink/2209268802805531/", "likes": 7, "comments": [{"username": "Jules Blumke", "comment_text": "Francos pizzeria & Z'Ntonios in Sorrento."}, {"username": "Howard Bernstein", "comment_text": "Ristorante L’Abiside in Amalfi. Il Fornillo, Mediterraneo, Mirage in Positano. Ate there this past May."}, {"username": "Rakhee Patel", "comment_text": "Sorrento\nMo Mo\nVasame\nFranco pizzeria"}, {"username": "Sab Ahm", "comment_text": "https://\nwww.momosorrento\n.it/mobile/"}, {"username": "Bianca D'Amore", "comment_text": "Sorrento-Donna Sofia\nRome- vladimiros(rest\naurant) San Marco for pizza"}, {"username": "Brad Nelsen", "comment_text": "Positano - La Cambusa and La Tagliata"}, {"username": "Dina Garrett", "comment_text": "Linda Williams, Julie Franco Mellow, BillandAngala Verley"}, {"username": "Lesley Fisher", "comment_text": "Rome but closer to Trastevere but amazing & authentic Italian cuisine! 🇮🇹"}, {"username": "Lesley Fisher", "comment_text": "Also Rome in a little laneway near lots of wonderful bars, restaurants & tourist sights! Just can’t remember exact address! But name on menu may help you 😍"}, {"username": "Lesley Fisher", "comment_text": "Venchi Chocolate & ice cream shop a must! It has a running chocolate stream wall behind the ice cream 🍨& chocolate 🍫 counter! 😋"}, {"username": "Lesley Fisher", "comment_text": "Venchi in Rome! 🍦"}, {"username": "Lesley Fisher", "comment_text": "If near Trevi Fountain you must visit this excellent Italian deli! So much delicious Italian fare! 🇮🇹"}, {"username": "Lesley Fisher", "comment_text": "Gelato bar right opposite the Trevi Fountain!\nGelato was delish! 😋"}, {"username": "Lesley Fisher", "comment_text": "This restaurant in Sorrento… sorry can’t remember name but picture of front of restaurant. It’s in a wider laneway with a few lovely restaurants in a row. Its away from the main restaurants but not too far & we found it by accident when walking along doing some night time shopping! Avoid the tourist trap restaurants near the central part of Sorrento where food seems mass produced & a quick turn over of diners! Better to walk around & look at options down the laneways & away from main hub! 🍝"}, {"username": "Lesley Fisher", "comment_text": "Another picture of restaurant & streetscape. Waiters were professional & lovely too! And the limoncello is to die for & in fact a must when in Sorrento! Lemons are everywhere in Sorrento & the Amalfi coast so you better like lemons! 🍋🍋🍋🍋🍋"}, {"username": "Lesley Fisher", "comment_text": "My meal in Sorrento 🇮🇹"}, {"username": "Lesley Fisher", "comment_text": "Other meal! 🍝"}, {"username": "Seda DC", "comment_text": "Sorrento- Terrazza delle Sirene also known as Foreigners Club, it has fantastic food and the most beautiful view\n\nRome - Osteria Nannarella"}, {"username": "Lesley Fisher", "comment_text": "Evening espresso martini at a bar near the central roundabout/ hub was delish & a great ending to a busy & wonderful day exploring! Sat here as it was open very late & I people watched! Italy’s restaurants & shops open very late fyi as they have their siesta time from about midday to 3pm where shops & most eating places close & reopen for the afternoon aperitif time & evening to late dining! Was Bellissimo! 🇮🇹"}, {"username": "Lesley Fisher", "comment_text": "This restaurant in Sorrento was excellent too! Authentic Italian cuisine & waiters & had laneway dining tables, front indoor restaurant & at the rear down a step of two restaurant area too! A fun & lovely atmosphere we had at the rear as the front of restaurant was booked out! 😍"}, {"username": "Lesley Fisher", "comment_text": "Entry of restaurant"}, {"username": "Meredith Holloway Helbon", "comment_text": "Following"}, {"username": "Lesley Fisher", "comment_text": "Tables at front in the laneway 🍷"}, {"username": "Lesley Fisher", "comment_text": "Rear of restaurant was cosy & intimate too! 🇮🇹"}, {"username": "Lesley Fisher", "comment_text": "My pasta was delicious! 🍝"}, {"username": "Jane Crager Kovacs", "comment_text": "Restaurant recommendations\nin Como please"}, {"username": "Sarah Price", "comment_text": "Parrachiano in Sorrento is amazing! It’s where cannelloni was first invented. So beautiful with fairy lights and under the lemon and orange groves 😍😍"}, {"username": "Patty Murphy", "comment_text": "The restaurant at Hotel La Tonnarella is wonderful. Views are breathtaking and the food is divine. Great service."}, {"username": "Karen Lavoie", "comment_text": "Sorrento - Di Gigino on Via degli Archi!!!! Get the house wine- perfetto!"}, {"username": "Stephanie K. Cox", "comment_text": "Following"}, {"username": "Kally Trahearn", "comment_text": "In Sorrento - La Cantinaccia del Popolo - not high end but definitely a favourite of the locals. Google it, read the reviews. You will not be disappointed. You can't reserve, so get there early and expect to wait until a table is free for the size of your party.\n\nIn Rome - I really enjoyed Restaurant Ad Hoc, Via di Ripetta, Roma. Also, there is a wine shop just down the road from there, which is also lovely: Buccone Vini e Olii.\n\nEnjoy xx"}]}, {"id": "2209269002805511", "text": "If we buy the 3-day Campania artecard that includes transportation and entrance to 2 sites, do we still have to buy transportation (e.g. EAV) tickets separately for our 11-year old child? They only issue the card for adults and youth but not for children younger than 18.", "link": "facebook.com/groups/1373361046396315/permalink/2209269002805511/", "likes": 0, "comments": [{"username": "Miyuki Kanno Paul", "comment_text": "According to the official website:\n\nhttps://\nwww.campaniartec\nard.it/\ntour-item/\ntravel-around-ca\nmpania-region/\n?lang=en"}]}, {"id": "2209271086138636", "text": "I saw someone arguing over which side of the road we drive in italy so just if you are interested on renting a car, we drive on the right side of the road, and the cars have the pilot on the left side of the car. Tips for driving around big cities, always respect priority sign and red lights, don’t drive like you own the road (even if lots ofआणखी italians do that), and dont park outside of parking spots if you don’t want to take a salty fine. (N.B.: even if not common, THEY DO FINE IN BIG CITIES, better not risk it at all! )\nAlso be careful about parking stripes. White stripes, all good. Blue stripes, you have to pay €/hour parking. Yellow stripes are just for loading and unloading, but i see lot of people in Milan parking on yellow stripes and end up getting fined.\nHope you have a great stay in italy 🏎️", "link": "facebook.com/groups/1373361046396315/permalink/2209271086138636/", "likes": 47, "comments": [{"username": "Lorraine Swick Sanfilippo", "comment_text": "Thanks. I may be wrong but I think almost everywhere, except the UK or countries affiliated past or present with the UK, drive on the right."}, {"username": "Manuela Bassetti", "comment_text": "Careful with white lines, in some city there are supplementary sign restricting the parking, for example in Bologna white lines means the parking is only for residents in the city"}, {"username": "Paula Bennett", "comment_text": "Just like US!"}, {"username": "Monica Colontonio Macho", "comment_text": "Grazie mille!!!!! I am saving your post. I study the signs before I come but always forget about the road stripes. Much appreciated!"}, {"username": "Etschi Bruckner", "comment_text": "it ain´t rocket science after all!"}, {"username": "Bill Elias", "comment_text": "Driving in Italy is easy. It's only stressful once you go into cities like Florence, or into hilltowns."}, {"username": "Lisa Todd-Collins", "comment_text": "Howard Todd-Collins"}, {"username": "Jennifer McDonnell", "comment_text": "I remember cursing the ‘kind’ car rental guy after her upgraded our car rental - driving the equivalent of a station wagon through Florence was quite the experience. As I’m Irish I’m used to small streets - but not big cars😆. Driving in Italy was great though - lots of hand gestures to learn."}, {"username": "Paul Anderson", "comment_text": "If you do a buy back car you can throw all those tickets away!!!"}, {"username": "Joanne-Peter Hart", "comment_text": "And this is why I didn’t drive in Italy. I am struggling to walk down a footpath! They not only drive on the wrong side of the road, they walk on the wrong side of the footpath! 😂 😂 😂"}]}, {"id": "2209273082805103", "text": "Best food in Milan please? 🙌", "link": "facebook.com/groups/1373361046396315/permalink/2209273082805103/", "likes": 3, "comments": [{"username": "Саша Савино", "comment_text": "Risoelatte nearby duomo. For pizza always nearby duomo Gino sorbillo."}, {"username": "Fiona Mac", "comment_text": "Da Regina 1985 just off the piazza del duomo"}, {"username": "Dade Lgg", "comment_text": "What are you looking for?"}, {"username": "Christy Lynn", "comment_text": "Signorvino - great views of the Duomo while you dine! Don’t skip the chocolate salami for dessert!!"}, {"username": "Miyuki Kanno Paul", "comment_text": "What is the definition of your “best food” in Milano?"}, {"username": "Laura Cardinale", "comment_text": "Osteria dell’Acquabella"}, {"username": "Lisa Rodriguez", "comment_text": "Osteria da Fortunata...bes\nt homemade pasta! Close walking distance from Duomo"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2209273096138435", "text": "Are open toe strap sandals ok to wear in the Vatican etc?\n\nI have just been reading a few things saying no flip flops and causal sandals and hoping a nice pair will be ok for my daughter and myself.\n\nObviously will be wearing all the other appropriate clothing 🙂", "link": "facebook.com/groups/1373361046396315/permalink/2209273096138435/", "likes": 3, "comments": [{"username": "Devon Grandi Powell", "comment_text": "There are no footwear rules. I wore Birkenstocks and there were all kinds of sandals/flip flops"}, {"username": "Betsie Els Wepener", "comment_text": "Can ladies wear slacks or only dresses"}, {"username": "Allison Stebbins Weakly", "comment_text": "I wore open toed strapped sandals on Aug 3 and had no issues! They really only care if your shoulders and knees are covered and that no one is wearing hats."}, {"username": "Jessica Beghtel", "comment_text": "I saw several women walking around in crop tops with their stomach’s showing at St Peters Basilica today. 🤦🏻‍♀️"}, {"username": "Amanda Bellamy", "comment_text": "Shoulders and knees seemed to be the only issue when I was there. They were giving out some kind of paper type shawl at the entrance to the Basilica to anyone who had shoulders or knees on show. I don't think shoes are an issue. This was last week (Aug 23)"}, {"username": "Julia Titus", "comment_text": "Sandals are fine. When they say “no flip flops” they mean rubber beach flops, not nice leather ones like Tory Burch which are more for wearing in town"}]}, {"id": "2209295062802905", "text": "Suggestions on where to stay from\nBrescia to Trompia Valley to see hhe Valley of Lights ??", "link": "facebook.com/groups/1373361046396315/permalink/2209295062802905/", "likes": 0, "comments": []}, {"id": "2209296292802782", "text": "My travel agent currently booked us 4 days in Seiano during our September visit at the grand hotel Angiolieri. He waiting for a place to open up in Sorrento.\nHas anyone stayed in the town? I noticed it’s on the opposite coast as Amalfi but not far from sorrento.\nMy concern would be day trips over to the Amalfi. Is Seiano to far away?\nThx", "link": "facebook.com/groups/1373361046396315/permalink/2209296292802782/", "likes": 2, "comments": [{"username": "Miyuki Kanno Paul", "comment_text": "It’s 4 stops away from Sorrento on Circumvesuviana\nSorrento line. You will need to get to Sorrento for both SITA bus and ferry service to Positano and Amalfi as well as Capri"}]}, {"id": "2209301729468905", "text": "Does anyone know the carry on size and weight limit for both Delta and ITALIA TRASPORTO AEREO?", "link": "facebook.com/groups/1373361046396315/permalink/2209301729468905/", "likes": 0, "comments": [{"username": "Colleen Dawson", "comment_text": "The best and most correct answer will come from the airline website."}, {"username": "Wendy Spano Bracco", "comment_text": "Go to their websites and the info is there."}]}, {"id": "2209305666135178", "text": "Train question: it was suggested to buy train tickets n advance and on longer trips, upgrade to business class. We are going to several cities. If we miss a train, can we get on the next one if there are seats? Do the tickets have to be validated at the station? I read to validate bus tickets at a yellow kiosk before boarding or be subjected to getting kicked off wherever you might be.", "link": "facebook.com/groups/1373361046396315/permalink/2209305666135178/", "likes": 0, "comments": [{"username": "Miyuki Kanno Paul", "comment_text": "Read the conditions of each ticket purchase option before buying. Some are no change/no refundable at very attractive price"}, {"username": "Scott Perry", "comment_text": "There is typically a bus validation machine-type thingy on each bus, one by the back door and one by the front. I suppose that one could use the train validation machine at the train station to validate your ticket, but I've only used the ones on the buses. Paper tickets for the train definitely need to be validated before you get on the train though, and it looks as though pretty soon we are going to need to validate our electronic train tickets online as well."}, {"username": "Elena Eugeni", "comment_text": "I notice that many are confused about ticket validation .\nAs a general rule, only tickets in which the seat is not reserved should be stamped. A ticket for a train with a seat already assigned, so typically Frecciarossa frecciargento Italo or IC, is already yours and can only be used on that specific train so validation is not needed. A ticket for a regional train is generally without a timetable or assigned seat, you could use it on any train even multiple times, so it obviously needs to be stamped to be in order. When you buy it online, usually in combination with other trains to switch with, it already has an assigned schedule for the regional train as well, so you don't need to stamp it.\nThat's why online tickets should not be validated, it has nothing to do with the way of purchase, but with the exact time and the ticket not usable multiple times.\nFor the same reason, these tickets not to be validated do not allow you to take other trains on the same route at other times. However, in some cases you can exchange them."}, {"username": "Gillian O'Callaghan", "comment_text": "If you book ahead of time on an app then you don't need to validate.\nWhen you book you'll be given options. Read carefully as to whether it's flexible.\nI booked 13 trips on Trainline. None of mine could be used at different times."}]}, {"id": "2209307712801640", "text": "*** Italy July 10 to 25/26, 2024 Recommendations ***\nTraveling to Italy with my daughter of 19, we land in Zurich (specifically so for the Taylor Swift concert) & will make our way through Italy as set-out below. ***Any advice or recommendations for accommodation would be appreciated to make this a trip of a lifetime!\n11 Jul - Zurich to Veniceआणखी (train)\n13 Jul - Venice to Florence (train)\n15 Jul - Florence to Cinque Terre (train, stop in Pisa)(Best place as base to explore Cinque Terre?)\n18 Jul - Cinque Terre to Amalfi (train)(Best place as base to explore Amalfi coast?)\n22 Jul - Amalfi to Rome (train)\n25/26 Jul - Flight back to South Africa 🇿🇦", "link": "facebook.com/groups/1373361046396315/permalink/2209307712801640/", "likes": 5, "comments": [{"username": "Dann Hrusch", "comment_text": "Monterosso is good base for Cinque Terre. It has the most lodging, dining options and best beach. If you're up for it, the hike from Monterosso to Vernazza is incredible."}, {"username": "Trina Owens", "comment_text": "Fellow swiftie here have a blast! The train from Zurich to Venice is quite long and we did Venice last year and had 3 nights and it was perfect. Just a thought!"}, {"username": "Autumn Watson", "comment_text": "Super fun trip! Monterosso is a great spot to base for Cinque Terre. We just did that and it was perfect."}, {"username": "Lisa Ferreira Morris", "comment_text": "Swiftie mom here also! Flying to Lisbon for 4 days May 2024 to see Taylor Swift and then 2 weeks later my pre-planned honeymoon to Greece, Croatia and Italy! My passport and wallet are going to be tired ! 🤣"}, {"username": "Kandice Mountain", "comment_text": "Omg I think this is a thing ..making our Taylor swift in Vienna tickets a family holiday to Europe also for summer 2024\nWe are from Canada 🇨🇦 thinking of Vienna to Croatia or Italy trip .. can’t decide"}, {"username": "Karen Albertyn Wood", "comment_text": "Hi we just travelled through Italy from SA.\nI’m not sure how many days you spending in each place but we found 2 days was not enough. When travelling around you actually spend most of the time getting to the train station on the trains. It was very hot and very busy we were there in July.\n\nWe stayed in Sorrento it was beautiful.\nHave a great time"}]}, {"id": "2209308232801588", "text": "We will be first-time travelers to Rome. Planning on going end of June or early July of 2024. Being a teacher and having a college student makes it a bit difficult for timing.\nShould we make Hotel reservations first, then Flight and activities? We will have Rome as our homebase for the 9 nights.", "link": "facebook.com/groups/1373361046396315/permalink/2209308232801588/", "likes": 4, "comments": [{"username": "Lee-Anne Stewart", "comment_text": "If am fairly clear on dates I often make accommodation bookings that are fully flexible and pay on arrival/week before arrival before I book flights. Sometimes it’s good to lock in price or be sure you have a reservation at your preferred hotel/\naccommodation than risk it still being available. Once flights booked I keep an eye out for better deals and might rebook a non flexible rate if the price is significantly lower."}, {"username": "Renae Larcus", "comment_text": "Flight first."}, {"username": "Brian Osman", "comment_text": "It's going to be sooooo hot 🔥"}, {"username": "Andria Saia", "comment_text": "Flight first in my mind 😊"}, {"username": "Gina Rovello Keenan", "comment_text": "I would do flights first. You have limited options on flights with many accommodation options."}, {"username": "Agne Krause", "comment_text": "Secure flights first, there are plenty of hotels to choose. We got very lucky even last minute during high season! I just returned, and it was hot but absolutely tolerable. It was cold in venice! You'll be fine"}, {"username": "Kim Geary Keidel", "comment_text": "We could only go last week of June and first week of July. It was hot but we had great time! I would do flight then hotel. You might also consider doing Rome a few nights and another location as your home base the rest of the time. Florence is a great home base! There’s so much you can do from there."}, {"username": "Carole DeSimone", "comment_text": "The month of June is perfect.\nFlight first, then hotel which I recommended Hotel Oceana then activities"}, {"username": "Valerie Collanton", "comment_text": "Those weeks are very popular times to travel so I would look for hotels as soon as those dates become available. Right now if is likely too soon. I am looking at April 2024 and many hotels do not have rates for those dates listed yet. You can book flights either at the same time or first if you find a good deal. As to the heat —. It will be hot no matter where you are those weeks (home or Italy) ! So go and have a great time !"}, {"username": "Wendy Lammerant", "comment_text": "We booked our accommodations first — and keeping an eye on the flight prices"}, {"username": "Ashley Martins", "comment_text": "With 9 nights I would divide up into at least 2 places - Rome will get very hot & so many other great cities. I would recommend Rome & Florence (home base for wineries, museums, Sienna, Pisa, etc). or Rome & somewhere along the Amalfi Coast so you can cool off with the ocean. I would find your air fare first (play around with mid week flights for best deals) & then book hotels."}, {"username": "Eileen Muro", "comment_text": "We went thru Costco Travel for flight, hotel ...comes with transportation from airport to hotel and vice versa. Then about 3 months before our trip we started looking into our tickets fir activities"}, {"username": "Sandra Maldonado", "comment_text": "Why don’t you go on spring break? Italy is gorgeous in the spring.\nI always book flight first. Hotel comes next. Determine if you want to take day trips. You do - Tivoli is wonderful. And Orvieto. And Pompeii. Heck, let us all move to Italy. The whole country is gorgeous."}, {"username": "Nancy Vahl Raske", "comment_text": "I’d go early June/ hot in summer- get flight first"}, {"username": "Shelley McGlothen Zeigler", "comment_text": "Flight first. Then lodging. Then trains and activities."}, {"username": "Jeff Chipman", "comment_text": "I always go flights first as they are the hardest piece of the plan to book based on my location in Canada. Once booked, there are many more options for accomodations and attractions."}, {"username": "Pegi Fuller", "comment_text": "We stayed here in Rome Walked from Termini Roma Colosseum, Trevi Fountain, Spanish steps all walking distance Metro station at end of street ( Cavour station) we took to Vatican Termini you can get train to Florence, Naples etc Reasonable and good breakfast\n\nhttps://\nwww.guestreserva\ntions.com/\nhotel-raffaello-\nrome/\nbooking?gclid=EA\nIaIQobChMIl4KZz\nKnOgAMVgimtBh1j\niwwwEAAYASAAEgL\nOFvD_BwE"}, {"username": "Lauran Cantwell", "comment_text": "Always flights...hotel\ns are available at all times, dates and changeable. Flights are not."}, {"username": "Alison Napolitano", "comment_text": "We are considering traveling around the same time. First time for my family. It’s incredible how many hotels and Airbnbs are already booked. Still plenty available but you can see how many are already booked! We plan to book our stays in the next few months. Flights will be booked in winter/spring."}, {"username": "Carrie Stallard", "comment_text": "We just went in June! We booked the flight first then hotels"}, {"username": "Leslie Goodland", "comment_text": "Flight, accommodations,\nactivities. Travel days will take up an entire day, take that into consideration. I was just in Italy during Spring."}, {"username": "Sylvia Kotsopoulos Vocino", "comment_text": "Teacher as well and just got back from an almost 3 week family trip. Read all the heat warnings about going in July/August and lucky for us we didn’t experience the extreme heat! Go ahead and plan your trip when it works for you. You can’t do anything about the weather!"}, {"username": "Pamela S Honeycutt", "comment_text": "Ok my stay was gifted to me for 7 days and then I’m extending to Tuscany …\n\nShould you splurge and go first class over or back?\n\nBasic economy???"}, {"username": "Roxanne Franquelli", "comment_text": "July is hot. August too. But I’m a teacher, so best time for me to go. I booked my flights first. Then hotels. I used google flights to track prices of the flights."}, {"username": "Katie Marie", "comment_text": "Flight first. There are plenty of hotels! Honestly, yes the heat can be bad but the walking is worse. Just plan to take Ubers and you’ll be set! I am here now. A friend didn’t want to come because of the heat and I almost canceled and once I got to Florence it rained and I needed a jacket. The weather changes and who knows if it’ll be hot that week you visit. Just have fun and enjoy the experience! And wear linen 😊"}, {"username": "Renee Martines Angiulli", "comment_text": "We are here now. The first few days were hot but we were fine. If you are staying in Rome the whole time I would look at Airbnb vs hotels. I used a wonderful travel agent but feel I could come again and book on my own. Watch for flights -generally book early to get the best price. Rome is very walkable but plan to walk a lot. 🚕 and hired rides are possible. We walked everywhere except on travel days and to the Vatican. You will have a marvelous time!!!"}, {"username": "Jessica Olivero", "comment_text": "You’ll be fine with the heat. We went in August + had a glorious time"}, {"username": "Graham Sherlock", "comment_text": "Flights first, 9 nights in Rome is way too many, do 3 or 4 nights there then head to Florence."}, {"username": "Basia Szokarski", "comment_text": "Try to go as early as possible....\n3/4 nights in rome max since it's your first stop and then move on.. day tripping will be exhausting."}, {"username": "Karen Curci", "comment_text": "Flight first. Hot and humid then!"}, {"username": "Tracy Foss", "comment_text": "Flight ,hotel then activities."}, {"username": "Jan Armstrong", "comment_text": "Flights first. Then accommodation. Then tours etc"}, {"username": "Rachel Collins", "comment_text": "Always book your flights first!"}, {"username": "Deborah Schroeder", "comment_text": "Look at the FB site Romewise. It will give you in depth on just about everything in Rome. If I may suggest, get a map of Rome and plot the sites you want to visit then look for a hotel that is most central. Will save you a lot of walking. Use a spreadsheet, or just make good notes, of the ticketed sites you want to visit and time, when the tickets go on sale and the website to order the tickets. For all sites, list days open and hours. This will help with planning."}, {"username": "Allan Olexa", "comment_text": "I'm also a teacher so know your schedule. But, please check summer extreme temperatures. We visit annually a week at Christmas experiencing wonderful, mild weather...Napol\ni, Roma, Catania, etc."}, {"username": "Elizabeth May La Duca", "comment_text": "Passport [remember 6 months minimum expiration date requirement], visa, then flights [l get Google flight alerts], then hotel and/or www.hostel.com, www.monasteryst\nays.com , convent stays, airbnb … spend / invest a lot of time with Google Maps / directions , download Google Maps app, download FlightAware.com app , learn travel words [sciopero=strik\ne], expressions…dow\nnload Yahoo Weather app …."}]}, {"id": "2209313026134442", "text": "My girlfriend and I are planning a 3 month retirement vacation celebration to Italy. We are looking for any advice or insights on accommodations in Northern, Central, and the Adriatic coast. We are hoping to rent from local people instead of Air BNB. Any help is greatly appreciated.", "link": "facebook.com/groups/1373361046396315/permalink/2209313026134442/", "likes": 2, "comments": [{"username": "Elena Marchese", "comment_text": "Airbnb is mostly about private families here 😉"}, {"username": "Ike Simoncini", "comment_text": "Wow 3 months i'm jalours:) give me a day causse im netflixing with my wife right now tomorow i will give you some tips im half sicilan and have been almost in all of italy"}, {"username": "Jerry Kiger", "comment_text": "That is awesome … challenge would be to how to find place to stay (local people). Suggest use ABB or VRBO or direct hotel as a 1st phase like 10-14 days in 1 location. Since have 90 days maybe get into Italy like a Rome or Florence to get settled in and maybe train or car rental to some spots … then find the “locals” to explore? Maybe first 30-45 days need to more “tourist” spots in order to find the more out of sight places on back end, if makes sense"}, {"username": "Jim Painter", "comment_text": "Stay in an agriturismo or two (working farm) with cooking facilities/\nBBQ. Get to know the local bread maker, butcher, fishmonger, etc. agriturismo.it"}, {"username": "Lois LaMonica Norton", "comment_text": "I thought you could only stay 60 days"}, {"username": "Sharon Hiesler", "comment_text": "Check out Riccione, beautiful place"}, {"username": "Tracy Wutzke", "comment_text": "https://\nwww.homeexchange\n.com/\n?sponsorkey=trac\ny-764c6\n\nSign up for home exchange using this code (we both get points). We scheduled 90 days in Europe using points and nothing out of pocket other than annual home exchange fee. Amazing experience!! PM me if you have questions."}, {"username": "Avril Samuel", "comment_text": "https://\nwww.borgo-di-sug\name.com/"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "The Adriatic coast go to Puglia Ostuni, Otranto, Lecce are great, but also in the northern part Manfredonia, Vieste are beautiful!"}, {"username": "Patrizia O'Neil", "comment_text": "Airbnb are local people"}]}, {"id": "2209315099467568", "text": "My husband has a CPAP that he is bringing. I want to make sure we have the correct adapter for that machine. I have googled and am getting different results so I’m looking for clarification or directions on what I look for. TIA", "link": "facebook.com/groups/1373361046396315/permalink/2209315099467568/", "likes": 1, "comments": [{"username": "Caren Murray Kleinman", "comment_text": "All you need is a plug adapter. They are almost all dual voltage"}, {"username": "Donna Hinton", "comment_text": "I called the manufacturer."}, {"username": "Patsy Luque Mejia", "comment_text": "Ours are dual voltage. You can check the block on the plug to verify whether your husband’s is. If it is, you need only a plug adapter that works in Italy. Usually, 2 and 3 prongs. I take both."}, {"username": "Patsy Luque Mejia", "comment_text": "Patsy Luque Mejia"}, {"username": "Glen Bentley", "comment_text": "We took hubbies. If from uk just a normal adapter you can pick up anywhere - however a tip. We put a single lead extension in the cpap bag just in case the socket isn’t near the bed. Also we use that bag to pack bits and pieces in."}]}, {"id": "2209315406134204", "text": "Will be in europe (italy, netherlands, germany, etc) late October to early November, what will the weather be like by then? Thanks!!", "link": "facebook.com/groups/1373361046396315/permalink/2209315406134204/", "likes": 0, "comments": [{"username": "Kristina Ruk", "comment_text": "Nobody knows😉google average weather of each country, but who knows what it will be..besides Germany, Netherlands are more far to north and near Baltic sea, so can be warm (as it was like 20-24 last haloween in south of Germany and like +15 in north) or chilly.. so there is always exceptions..Ita\nly can be warmer but slso rainy"}, {"username": "Gundega Barkane", "comment_text": "Very different. Germany will be colder and Italy not that cold"}, {"username": "Alejandro Gabriel Valenzuela Anghileri", "comment_text": "In Italy prepare to find it very variable from day to day"}, {"username": "Gillian O'Callaghan", "comment_text": "Quite a distance between Netherlands and Sicily so will be quite a temperature range. Have a look on Google for averages."}]}, {"id": "2209316006134144", "text": "Traveling with 3 teens and a 4 year old in the month of August. We chose ischia over capri to visit. We have two days on the island. What are the must do’s and sees in ischia?", "link": "facebook.com/groups/1373361046396315/permalink/2209316006134144/", "likes": 1, "comments": [{"username": "Iliana Zlatareva", "comment_text": "San Montano bay Negombo park kids will love it"}, {"username": "Steve Partridge", "comment_text": "Definitely Negombo. They can use the pools and it’s got a great beach.\nCastle Arongonese.\nRound island boat trip with swimming stops."}, {"username": "Sara Ghaytanchi", "comment_text": "Any reviews on pasideon garden?"}, {"username": "Miyuki Kanno Paul", "comment_text": "Terme if you don’t mind the mineral smell(sulfur).\nCastello Aragonese d’Ischia"}, {"username": "Kari Allen Murray", "comment_text": "Rent a boat!"}, {"username": "Jenny Lena", "comment_text": "Very nice 👍"}]}, {"id": "2209322546133490", "text": "My husband and I will be traveling to Italy September/ October 2024 for 4 weeks. Our son is stationed in Naples so plan to start and end there. My husband doesn’t want to plan a lot just go day by day. Is it hard to find lodging this way?", "link": "facebook.com/groups/1373361046396315/permalink/2209322546133490/", "likes": 8, "comments": [{"username": "Andrea Corey Andrews", "comment_text": "I'd plan hotels ahead of time"}, {"username": "Christine Ann", "comment_text": "You definitely need to book your hotels in advance or you may find yourself with nowhere to stay or paying an arm and a leg. It’s very busy"}, {"username": "Rick Schneider", "comment_text": "If you go in October , no problem. This October experiment looking for hotels , will be the same in 24."}, {"username": "Olivia Chadwick", "comment_text": "My fiancé and I are traveling to Italy next month for 2 weeks and have booked about 1/3 of the lodging and winging the rest! You never know how long you want to stay in a particular city"}, {"username": "Paul Anderson", "comment_text": "We just spent 60 days traveling and every night we found a new place to stay. For us it was easy, but we have been doing this for many years. Love having no preset schedule."}, {"username": "Glenn Todd Webb", "comment_text": "If you aren’t picky in where you stay, it can be really fun."}, {"username": "Lucrezia Folger", "comment_text": "No, we do it all the time."}, {"username": "Billie Frances Swanda", "comment_text": "Probably"}, {"username": "Miyuki Kanno Paul", "comment_text": "Napoli has been very busy this year. A friend of mine has a property for Airbnb; booked solid 6 months in advance this year alone"}, {"username": "Jerry Kiger", "comment_text": "Not sure if you son will travel as well, but there may be some “on base” options when traveling (guessing military) there lot of bases in Italy not sure if they provide lodging. Could be good option resupply, mail items back home, etc"}, {"username": "Rose Turdo", "comment_text": "No, it's easy."}, {"username": "Alicia Cox", "comment_text": "I would book ahead of time but you can prob wait until 6 months before 🤷🏻‍♀️"}, {"username": "Diana Smith", "comment_text": "You will be fine. Usually September and October are not too busy."}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "You shouldn't have problems. It's great not having a set schedule."}, {"username": "Kevin Robison", "comment_text": "No problem whatsoever."}, {"username": "Nancy Fricke Corsi", "comment_text": "We were there this past Sept and October and pre-booked all of our lodging. Didn’t want to take the chance of less than desirable hotels. It was quite busy and we were there for 5 weeks. We did not book tours because we wanted freedom to roam and be on our time. Enjoy 🇮🇹🍋🇮🇹"}, {"username": "Gillian O'Callaghan", "comment_text": "No...but more expensive."}, {"username": "Mary Lou Olsen", "comment_text": "Thanks for your help"}]}, {"id": "2209331412799270", "text": "Any tips for Genoa and Portofino??", "link": "facebook.com/groups/1373361046396315/permalink/2209331412799270/", "likes": 4, "comments": [{"username": "Ann Lombardi-Perkins", "comment_text": "Genova is an amazing city. See all that you can."}, {"username": "Ann Lombardi-Perkins", "comment_text": "Ann Lombardi-Perkins"}, {"username": "Linda West", "comment_text": "1)Got to eat at Le Rune in Genoa! The food is out of this world! Should make a reservation though.\n2)Cooking class with Andrea thru Cesarine.\n3) go to Cinque Terre , just an hour away by train, from genova Brignole\nPortofino: castello brown"}, {"username": "Lori Wroblewski", "comment_text": "Erin Mitchell"}, {"username": "Erin Mitchell", "comment_text": "Genova! Do the Paddling Genoas Secret Coast kayak tour on Viator. Totally worth it!\nMy daughter and I stayed in the Hotel Bristol Palace for 3 nights and each day was amazing.\nOur taxi driver suggested Cavour 21 restaurant but we didn’t get to go. We ate at Bigos Cafe one night and it was wonderful."}, {"username": "Cindy Hall", "comment_text": "Genoa is a wonderful city! Amazing food choices abound! For the best Pesto with Trofie go to Trattoria Rosmarino- and I have had lots of Trofie with pesto in Genoa!!! The best pizza is at Strakkino- OMG so delicious.\nLa Locanda del Molo near the marina area has amazing pasta and seafood dishes for reasonable prices. The pasta stuffed with Gorgonzola and roasted pears and walnuts was delicious 😋 We also really enjoyed Cibus13- interesting international cuisine presented beautifully and tasted wonderful. The chefs are 2 women and this restaurant has accolades. I also highly recommend the B&B Piccoli Leoni- the owners are wonderful- Georgio is very accommodating and cooks a terrific breakfast! I live in the US but my Rheumatologist is in Genoa so I know the city well."}, {"username": "Mat PO", "comment_text": "Portofino: Hotel Splendido!"}, {"username": "Dina Garrett", "comment_text": "Julie Franco Mellow"}, {"username": "Miyuki Kanno Paul", "comment_text": "Genova is fabulous!\nYou just hop on a train, snd it takes you to everywhere up snd down the Ligurian coast. To get to Portofino, you buy a ticket to santa Margherita Ligure, get on a bus 782 just outside the station"}, {"username": "Emma Chadwick", "comment_text": "GENOVA\n\nTypical restaurants :\nTrattoria Ugo\nIl genovese ( which has a beautiful terrace )\n\nTo eat something more fast and easy there is:\nIl trofiaio\nSa Pesta\n\nFor an aperitivo, eating a little and drinking before the dinner :\n\nCaffè del Teatro\nOsteria Cicala\n\nAll of the above recommended by our food tour guide in Bologna. Her friend lives in Genova. I particularly enjoyed il genovese. Best pesto pasta.\n\nWe also did a food tour in Genova which was amazing."}, {"username": "Kenzie Masters", "comment_text": "I am currently living between Genoa and Portofino and I recommend that you visit Camogli!! It is a must see! I like Camogli much better than Genoa or Portofino 😁"}]}, {"id": "2209337692798642", "text": "Travelling from Rome to Siena-wondering about the regional bus......Concerned about my luggage being under the bus and someone else taking and claiming as their own before my stop. Do they give you luggage claim checks? If not the bus, high speed train to Florence and regional train to Siena-not sure luggage situation would be any better. Would love to know your thoughts. Bus, Train, or private driver. If private driver do you know of one and approx cost?", "link": "facebook.com/groups/1373361046396315/permalink/2209337692798642/", "likes": 5, "comments": [{"username": "Jenny Payne", "comment_text": "Have taken lots of buses in Italy and my luggage was fine🌻"}, {"username": "Kathleen M Miller", "comment_text": "."}, {"username": "Mary Robinson Boggs", "comment_text": "Does luggage always go under the bus. Silly question I know but we are looking to take some regional buses also"}, {"username": "Catherine Johnson", "comment_text": "A friend had her bag stolen from the bus in Italy. Keep your eye on luggage at any stops. I travelled with her on a similar route 2 years later and all was well. Just take care, you’ll be fine."}, {"username": "Gayle Moores", "comment_text": "I would take the fast train to Florence and the regional train to Siena if you are worried. You will have to place your luggage above on the rack\nwhere you are sitting so you will be able to keep an eye on it.You can always pack a bicycle lock and put it on your bag on the train in case you are not in sight of your luggage."}, {"username": "Rhona OConnor", "comment_text": "Sit in a seat over the luggage compartment and keep an eye on it."}, {"username": "Graham Sherlock", "comment_text": "Take the train, you keep a good eye on your luggage, it's normally right next to you"}, {"username": "Fiona Cameron", "comment_text": "Train to florence then regional train to Siena you can pretty much keep your bags with you. Under the bus situation could be dodgy as you say"}, {"username": "Janelle Wales", "comment_text": "We took high speed trains throughout Italy no issues at all with our luggage.. had it within eyesight all good"}, {"username": "Stacey Miller", "comment_text": "Airtag your luggage=peace of mind, knowing exactly where it is."}, {"username": "निनावी सहभागी", "comment_text": "? the regional train florence to siena......the luggage can be with me in overhead compartment?"}]}, {"id": "2209340819464996", "text": "Can someone please recommend a nice restaurant for my bday in Rome? Something super authentic and fancy? TIA.", "link": "facebook.com/groups/1373361046396315/permalink/2209340819464996/", "likes": 1, "comments": [{"username": "Tracy Wutzke", "comment_text": "Alfredo’s- the original creator of fettuccine Alfredo"}]}, {"id": "2209356636130081", "text": "Stunning Italy🇮🇪", "link": "facebook.com/groups/1373361046396315/permalink/2209356636130081/", "likes": 5, "comments": [{"username": "Teresa Reyes Fortich", "comment_text": "Thanks everyone😃"}]}, {"id": "2209358286129916", "text": "Four American Women are headed to Italy for 10 days in the summer of 2024. Where should we go?", "link": "facebook.com/groups/1373361046396315/permalink/2209358286129916/", "likes": 12, "comments": [{"username": "Stuart Kennedy", "comment_text": "The airport"}, {"username": "Jon Davis", "comment_text": "Capri\nCapri\nCapri\nCapri\nCapri\nrepeat"}, {"username": "Eileen Lonergan", "comment_text": "North"}, {"username": "Stefano Bressanelli", "comment_text": "Explore the northern lakes area...."}, {"username": "Sam Monty Sigler", "comment_text": "We’re doing 11 days. Rome, Venice, Florence, Naples/almafi coast then Rome then home"}, {"username": "Elaine King", "comment_text": "No planning ahead?"}, {"username": "Lisa Roy Schafer", "comment_text": "Everywhere!!"}, {"username": "Beth Casella", "comment_text": "Include Rome, Sorrento, and Venice!"}, {"username": "Roe Gallo Saks", "comment_text": "Use a travel agent"}, {"username": "Kevin Mancino", "comment_text": "If you have never been to Italy, I would strongly suggest to add at least 2-3 more nights. Land in Rome or Venice. Ok say you landed in Rome, Stay 4 nights. Then take the train to Florence 3-4 nights. Then 4 nights in Venice."}, {"username": "Robin Barbera", "comment_text": "Florence: Day trips to sienna, San Giminiano- Toscana, Venice, Bologna. Rome: Day trip to Naples and Sorrento"}, {"username": "Darla Ehrhard", "comment_text": "https://\nwww.torresantang\nelo.com/en/. If you make it to ischia, look at this place!"}, {"username": "Kim Grace", "comment_text": "Michelle Cummins🤔"}, {"username": "Debi Genovese Herrera", "comment_text": "Milan como and the Dolomites"}, {"username": "Lisa Williams", "comment_text": "Get a grip"}, {"username": "Eldulce Dakula", "comment_text": "Good luck and happy birthday"}, {"username": "Rose Turdo", "comment_text": "Alberobello"}, {"username": "Jenny Frank", "comment_text": "ten day: I would do Rome and Venice; 1 day trip from Orvieto when in Rome. what part of summer are you going? are you flying into one city and out another?"}, {"username": "Miklos Verdes Kovacs", "comment_text": "Barcelona 😉💖😎"}, {"username": "Andrew Mircovich", "comment_text": "Sorrento , Rome and Florence"}, {"username": "Princess Queen", "comment_text": "Venice,Portofin\no,Livorno,"}, {"username": "Frances McDonagh", "comment_text": "Too generic post, what is budget, what are interests?"}, {"username": "Esan Sangeles", "comment_text": "Choose only 2 places in Italy that near each other."}, {"username": "David Jack", "comment_text": "Rome. But be careful with you handbags etc.\n\nI don’t normally like crowded places, but loved Rome"}, {"username": "Rebecca Combellack", "comment_text": "Borgo di Colleoli Resort - Tuscany is a must"}, {"username": "Danielle Balch Blundy", "comment_text": "We loved the Tuscany region. It was amazing."}, {"username": "Joanne Crismale", "comment_text": "Broad question, Rome of course then Sicily."}, {"username": "Kai Wilhelm Tell", "comment_text": "Whereever you want."}, {"username": "Leslie Goodland", "comment_text": "Wherever you want! It'll be hot, especially the further south you go. Don't forget your visas."}, {"username": "Janice Vaznonis", "comment_text": "Everyone make a top 3-5 places in Italy they want to go…and see which 2 are on the lists of everyone."}, {"username": "Jessica Olivero", "comment_text": "Tuscany! So beautiful!"}, {"username": "Naomi Barrett", "comment_text": "Capri"}, {"username": "Meredith Williams", "comment_text": "my 3 friends and i loved venice, florence and rome! we went in april!"}, {"username": "Niina Komulainen", "comment_text": "Amalfi coast 💛"}, {"username": "Janine Danino Hook", "comment_text": "Tuscany definately"}, {"username": "Giulio Abbate", "comment_text": "Collebuono.it for an authentic Italian experience"}, {"username": "Leila Juul Petersen", "comment_text": "Lago di Garda 😍🤗"}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "Girls Trip: l’d pick either North OR South for 10 days. 3 nights in each.\n\nNORTH:\nFlorence (day trips to Tuscany), Venice and Cinque Terre or Camogli/\nPortofino.\n\nSOUTH:\nRome, Amalfi Coast, Capri\n\nActivities: Art, Wine tours, History, Cooking Classes.\n\nTip: go earliest as you can in Summer. July and August are overly crowded and scorching hot. If you can travel in late Spring or in Fall…magical."}, {"username": "Danielle Cooney", "comment_text": "If you like wine and food Tuscany/\nFlorence , Verona , Venice and Cinque Terra and if you have time Lake Como !!! It is the total Eat , Pray Love trip"}, {"username": "Jeanne Eliason", "comment_text": "Why summer? Crowded and hot. May and late September and October are lovely."}, {"username": "Annette Giovia", "comment_text": "Portofino, Genoa, Rome, Santa Margherita Ligure, Sorrento, Tuscany, Cinque Terre. EVERYWHERE YOU CAN POSSIBLY GO\nENJOY!!!"}, {"username": "Shelley Phillips", "comment_text": "If you can get to Matera, I highly recommend it!"}, {"username": "Marie Cuzzi", "comment_text": "I’d advise to put it off until September\nSummer is so crowded and hot won’t be enjoyable"}, {"username": "Patty Crowther Pearce", "comment_text": "Where do you want to go? Have you ever been to Italy before? What are your interests? What do you like? Do you have a budget?"}, {"username": "Terry Andino", "comment_text": "Cinque Terre"}, {"username": "Veronica Mendez", "comment_text": "Last summer I arrived in the end of August and was there to the end of September. I loved my route:\nRome\nBari\nMatera\nAlberobello\nPolignano\nMonopoli\nLecce\nGallipoli\nPorto Cesareo\nOtranto\nSta. Maria di Leuca"}, {"username": "Antonio Aloè", "comment_text": "Depends from their intentions,if for sun wine,food en fu..n Rimini and other places in the Adriatic Sea including Iesolo -which is norther ,close to Venice-it would be perfect...🤗"}, {"username": "David King", "comment_text": "We did our first trip to Sardinia this past January and it was amazing! I can only imagine how much better it is in summer (if you can handle the heat).\nOur favorite and longest Italian vacation was a train journey with 3-day stops in Venice, Bologna, Florence, and Rome.\nWe’ve also done several cruises out of Venice and Rome that included stops in Sicily, Naples, and Livorno/Cinque Terre."}, {"username": "Lucrezia Folger", "comment_text": "You four American women have a year to do some research on the places and types of vacations you want to have in Italy. Posting here is very premature, without doing your own research. Fine-tuning your ideas, length of time in your places of interest, maybe activities, etc. But between the 4 of you, I'm sure you can figure it out. Happy to help but you have to do the majority of the planning."}, {"username": "Angela Falletta DiGiampietro", "comment_text": "10 days ? . I would do Florence , Venice . Then off to Sicily . In Sicily I would do Palermo , Favignana , Cefalu , there would be more but not enough days . This cities I mentioned in Sicily are spectacular. Enjoy."}, {"username": "Nancy Day", "comment_text": "Good for you we three senior ladies are going in spring 2024,first time for at least 3wks"}, {"username": "Donna Mangone", "comment_text": "Sienna, Verona, Sorrento, Rome, Florence, Venice, Lake Maggiore ♥️"}, {"username": "Catherine Gately", "comment_text": "We did Florence, Venice and Bologna this summer all by train. Fab! Particularly loved Bologna."}, {"username": "Sanja Opalic", "comment_text": "Caori"}, {"username": "Diana Granado", "comment_text": "Florenceeeeeere\ne"}, {"username": "Ildiko Gyimesi Mikos", "comment_text": "What do the Four American Women like to do??? What are the Four American Women’s interests???? Only then can this vague question be answered."}, {"username": "Kit Nader", "comment_text": "Rome ...then Florence...and end in the most beautiful venice."}]}, {"id": "2209359299463148", "text": "We fly into Rome in May 2024 and out of Milan. Ideally, we want to travel down the coast by train. Can anyone recommend a route please? We have 20 nights!", "link": "facebook.com/groups/1373361046396315/permalink/2209359299463148/", "likes": 0, "comments": [{"username": "Adam Hogarth", "comment_text": "We went Rome - Florence - Cinque Terre (La Spezia) - Milan"}, {"username": "Carole Welch Lang", "comment_text": "Depends on your interests but …\n\nRome, Sorrento. Florence, Bologna, Venice. Como, Milan"}, {"username": "Laura Uribe", "comment_text": "I know it’s not a big tourist destination, but we spent 3 days in Viterbo. It was awesome!"}]}, {"id": "2209389056126839", "text": "Has anyone stayed in Vico Equense, at Hotel Le Axidie? Looking for more information on hotel and area, and if it is easy or difficult it is to access shuttle bus to train station for day trips.", "link": "facebook.com/groups/1373361046396315/permalink/2209389056126839/", "likes": 0, "comments": [{"username": "Dawn Simpson", "comment_text": "Just stayed in Vico Equense a few weeks ago. Loved it! We stayed at Astoria Vico though. (It is directly beside the train station, which was super convenient). The train ride was about 15 minutes to Sorrento, very hot, very packed, and a little grungy train. It was fine though."}]}, {"id": "2209391156126629", "text": "Hello everybody I will be going to Italy for the first time In November and I’m super excited !! Any tips on what type of clothes I should bring along during that time!! TIA", "link": "facebook.com/groups/1373361046396315/permalink/2209391156126629/", "likes": 3, "comments": [{"username": "Jeanne Eliason", "comment_text": "Wow. The first time in Italy. Depends on where you are heading. Google the weather using a weather app. We have had 90 in late October and 50! In the last few years it has been interesting."}, {"username": "Jenny Payne", "comment_text": "Layer as it most likely will at times be raining. Good leather rubber sole boots, puffer jacket with hood & a small umbrella 🌻 I’m leaving early November and I go every year usually January, February love Italy 🌻"}, {"username": "Pamela S Honeycutt", "comment_text": "My first time in Italy next late October/\nNovember…\n\nI will be in middle of Tuscany, Umbria, Soriano nel Cimino…"}, {"username": "Pamela S Honeycutt", "comment_text": "Like Hunter rain boots?"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2209397236126021", "text": "I’m seeing a lot of posts about pickpocketing. I’m planning on carry my valuables in a little bag with me at all times but I don’t want to be carrying my passport everywhere. Is it safe to leave it in my hotel? Also what about leaving things unattended when going for a swim in the ocean?\n\nI appreciate all the posts from everyone in this group. It is helping me prepare for my trip coming up in 2 weeks.", "link": "facebook.com/groups/1373361046396315/permalink/2209397236126021/", "likes": 35, "comments": [{"username": "Anna-Maria Lopopolo", "comment_text": "Rome Venice and Milan are full of pickpockets, mainly at the big attractions and the metro they are literally all over the metro in Rome we saw many"}, {"username": "Brian McGraw", "comment_text": "Anything you leave unattended might not be there when you return.\nLeave nothing of value.\n\nI bought a waterproof phone carrier that I can stick my phone and valuables in to swim.\n\nAnd a security sling bag that’s impossible to pickpocket.\nIf I put my bag down in a crowded area, I clip it to my belt.\n\nAny other valuables will be in the safe at the hotel.\n\nYou want to take photos of your passports and credit cards Just in case.\n\nIf you have a photo of your passport, it’s easier at the Embassy if you do have to get an emergency passport.\n\nI always keep an emergency credit card somewhere other than on my person.\n\nYou will not enjoy being stuck in Europe with no money."}, {"username": "Zeeshan Asghar", "comment_text": "If you don't look like an acceptable shade of color, you'll be stopped for random checks everywhere.\nBy law you need to carry original documents with you, it's also the same law for anyone legally residing in Italy.\n\nIf you're not the right color, you'll also be stopped to check your bags at shopping markets.\n\nEurope is just \"inclusive\" like that.\nIf you understand what I mean by acceptable shade of color and non-acceptable shade of color, then make arrangements accordingly.\n\nGood luck."}, {"username": "Toni Colwell", "comment_text": "I left all valuables except for a small gold chain that could be worn at all times at home. Who needs these things and the added stress it brings while on a vacation? 🤷🏻‍♀️\n\nWe never noticed any pickpockets, we never once felt unsafe or threatened.\n\nWe also had other people take pictures of us (by lending our phone).\n\nYou can have an absolutely amazing, relaxing vacation by being smart and aware of your surroundings.\n\nWe didn’t leave our bags on the backs of chairs or under seats where they were out of sight or unattended. We kept our phones in zipped bags/purses on the front of our bodies. When we boarded public transit, or were in crowded places, we locked the zippers on our backpacks/\nbags, but were still visibly vigilant too.\n\nWe did visit a hot spring and left our bags out of our reach — however, they were visible to us at all times and we locked the zippers, plus used a cable through the lock to attach to the tree.\n\nCould someone still have stolen? Absolutely. But we were not easy targets.\n\nWe didn’t dress above the top, didn’t wear things to make us look like we had a tonne of money, and I personally carried my passport on me at all times, as I felt it was safer with me, then left at hotel/Airbnb etc.\n\nAll this being said: we didn’t visit Naples, which would come with its own set of rules for safety etc. 😊"}, {"username": "Vivien Paulik", "comment_text": "It is safer with you than in the hotel. And if you put your things in your closed bag, nobody will steal it. Just do not carry things in your pocket or opened bag"}, {"username": "Dann Hrusch", "comment_text": "No blanket answer for hotels anywhere in the world. You'll have to assess place by place. Personally I love going to a city where the worst thing I have to worry about is pickpocketing. Way better than worrying about being the victim of a violent crime in many US cities."}, {"username": "Anna Gambino", "comment_text": "I take my passport everywhere. I have said it on other fb pages. You never know when you will be asked to present it AND you never know if there will be some kind of national disaster. Friends of mine were traveling in Norcia, Italy when the last earthquake hit. I would want my official ID with me at all times. Happy to wear it close to my body so as not to lose it."}, {"username": "Michelle Rigdon", "comment_text": "We were just there last week and we were asked for passports at customs and checking into each hotel. We were not asked for passports at anything else. If you purchase something on the more expensive side you can be asked for it or a copy of it for the VAT tax. We weren’t buying anything like that so we never needed it.\nWe carried only what we needed for the day and left everything else locked in the room. We do hide our important things in the room."}, {"username": "Don Bentivoglio", "comment_text": "Stop with the pickpocket stories and fears. You're safer in Italy than in many cities in the US."}, {"username": "Ειρήνη Δεγρέση", "comment_text": "There is no ocean in Italy. One can not go for a swim in the ocean while in Italy, no hard feelings, but one can not."}, {"username": "Emily Ramsay", "comment_text": "I ordered tickets for the Uffizi at a certain time and was told to bring ID"}, {"username": "Fiona Cameron", "comment_text": "Take a copy of your passport when out and about and DO NOT carry your “valuables”in a small bag with you during the day walking around cities, they are much safer licked in hotel safe\nIm presuming “valuables” might mean jewellery or credit cards"}, {"username": "Donna Parrish", "comment_text": "Money belt and bring your passport with you."}, {"username": "Renae Larcus", "comment_text": "We never carry our passports. Take a pic to have on your phone and maybe a paper copy, too."}, {"username": "Mary Grech", "comment_text": "Random check by police on train Marsala-Trapani\n."}, {"username": "Carlo Nasca", "comment_text": "Don't look like a tourist. Don't put all your eggs in one basket; therefore, wallet front pocket, documents front left."}, {"username": "Flora Johnson", "comment_text": "I’ve always carried my passport wherever we go! I had a shoulder purse I keep in front close to me especially in a crowd. In the train it was so crowded someone tried to open my purse I pulled my purse even closer to me & looked at the woman in the eye she got off the train in a hurry… the other Italians saw it & told me “check your wallet “ in English “ they were very concerned. Hate to categorize but she looked like a Gypsy Roma… sometimes the pickpockets would wear a priest habit. So be very careful!"}, {"username": "Paul Anderson", "comment_text": "An over size wallet that is hard for you to get out of your pocket is impossible for a pick pocket to get. Never bring stuff to the beach and use the hotel room safe."}, {"username": "Pao Magnoler", "comment_text": "Lived there 6 years, never been pickedpocket not once, not even in other European countries."}, {"username": "Lucrezia Folger", "comment_text": "Never, ever, no matter what country you're in leave valuables on the beach when you go for a swim. No one knows what hotel you're staying in, however, if it has a safe, use it, but don't forget your items. And yes, you are required to carry your passport."}, {"username": "Pamela S Honeycutt", "comment_text": "Shoes are great for cc’s, cash, DL, …just don’t overload bc then comfort sacrificing on feet!\n\nWhat are you considering as valuables???\n\nLike a watch, diamond necklace???"}, {"username": "Benita Hauskins", "comment_text": "Around the Colosseum we saw a group having to show their passports. A block away we saw another group of people being asked. On the train to Florence we saw 2 seniorly-type couples being asked to show their passports. That's 3 times in 2 weeks. Unless the police allow you to go to the police station to show your original passport (and waste valuable vacation time) keep your passport with you. Attach a little travel lock to your zippers or buy a Travelon bag. At home would you drive without your license?! (Rhetorical question) Don't travel within a foreign country without the proper documentation that's required."}, {"username": "Jenny Kendrick", "comment_text": "We used Travelon anti theft crossbody bags and kept passports in the middle section secured and on us at all times"}, {"username": "Shardul-Neha Purohit", "comment_text": "Kind of sucks to have to be vigilant while also trying to relax and enjoy things…they’re literally opposites…my experience last month…zero incidents…nowhe\nre felt unsafe…didn’t carry my passport everywhere…no one asked for it…you can ask 10 people they’ll say 10 different things but do whatever gives you peace of mind because it really comes down to your own personality"}, {"username": "Wilki KJ", "comment_text": "Over the last 30 odd years I have lived in Italy for 6 years ,I have gone on holiday to various areas of the country from the north to the south, myself, with friends,and with family and I have NEVER felt unsafe or been pick pocketed. Ever. Does it happen? Yes just like it does in cities, towns and villages around the world. I wouldn't leave valuables on the beach unattended though. If you give someone an opportunity they will take it.\nThere are ways to get round it though.\nJust be as safety conscious as you would in any city. There's plenty of anti theft backpacks/ bags you can get but even a normal handbag is fine."}, {"username": "Roxanne Franquelli", "comment_text": "Just keep your things closed. Avoid the doorways on trains, for Id , we have been walking around with with our American drivers license. That’s easier to replace than a passport. I’m white-Italian -every hotel asked for passports. I believe customary. I have a picture copy of my passport on my phone and paper copy too.\nSome ppl are very scared and paranoid in this group. The fear alone makes you a target."}, {"username": "Mike Guluk", "comment_text": "1.most hotels have safes, leave your passport there\n2. Wear a money belt, hard to pickpocket\n3. I have izod walking shorts which have 2 extra front zippered pockets,perfect\nfor a wallet or passports\n\nAnd finally the odds of running into a pickpocket is extremely rare , usually in crowded places like the Trevi fountain.\n\nRelax , enjoy you are safe everywhere in the daytime and as for late evening, would you walk the streets at home?\n\nYou can always find trouble, but not in daylight"}, {"username": "Elana Kruger", "comment_text": "We've been in Italy for a few weeks - besides hotel when you check in we have never been asked for ID / passports. Have always left then in hotel safe.\nEverywhere felt very free & safe.\nMost beautiful country with such friendly people. Enjoy every minute of it & dont worry about anything."}, {"username": "Julia Haggerston", "comment_text": "Wow some people on this group need a good shake! Italians aren’t a thieving racist bunch of people! They are the happiest, friendliest, kindest country I’ve been to. Italians will go into a shop and buy themselves a drink & come out with an extra one and food for a beggar sitting outside, they will go out of their way to help you. The shores of Italy are a jump off point for immigrant boats crossing and easy for people to get from Africa & Eastern Europe like many other countries. I’ve been to some countries where the people are so rude & felt very unsafe but Italy isn’t one of them x"}, {"username": "Allison Campbell", "comment_text": "We got back 5 weeks ago travelling through central italy . Once we were at the hotel we had to show passports (which is like that in most countries we had travelled to￼). Once we checked in, we left our passports locked in the safe in our room in all destinations. We booked most of the things we wanted to do on Get Your Guide and kept the tickets on the app, and were never asked for identification,\nso basically leave your passports in the hotel. We never carried them with us once we were checked in. We booked train tickets on line through Trenatalia. I had an over the shoulder bag and hubby kept phone and wallet in front pocket ."}, {"username": "Andrea Corey Andrews", "comment_text": "You are suppose to have your passport on you if asked and dont have it it can be a hassle. If someone tells you font need to carry it do uour research youll see Leave nothing unattended"}, {"username": "Paula Brink", "comment_text": "Multiple trips to Italy, multiple trips to many other countries- always lock passport in room\nsafe- never a problem.\nAs far as carrying your passport in Italy I never do- have a copy on my phone or I take it with me when shopping (for the VAT refund)\nYour hotel wants to see passport on check in, police may ask to see it at train station when you are travelling from one city to the next.(I have never been asked but it happens)\nThere might be random checks by police elsewhere- I have never seen this but I would think you could show them your passport pic on phone and drivers licence or offer to go back to hotel and get passport if really necessary.\nAt the beach we take only phone and a bit of money, always use beach clubs and they have lockers."}, {"username": "Laurie Frainetti", "comment_text": "I felt so safe everywhere and was just mindful …. Venice, Roma, countryside Latina and Amalfi. We left our passports and felt safe doing so. At the beach, it was a club and also felt totally safe, but also brought very little to the beach.\n\nI was a little panicked before I got here reading all of this and now I’m just mad that I don’t bring a prettier purse!!! 🤣"}, {"username": "Kristina Ruk", "comment_text": "So if you have everything with you so take and passport. Btw never had issues with pickpocketing even walking as familly. Hotels have emergency access to sll safes so I dont trust them.."}, {"username": "Marie Cunningham", "comment_text": "Okay I'm on venice now second night after catching train from Milan. On train they only asked for ticket. Went out today without passport and yesterday and never asked for anything but anyone.\ni did not see any potential pickpockets people out and about.\nDon't stress!"}, {"username": "Naritta Nurit Matheus", "comment_text": "There is no ocean in Italy"}, {"username": "Vlatko Jazz Mushkarski", "comment_text": "Where is the ocean that you are planing to swim in?"}, {"username": "Debbie Milne Jenkins", "comment_text": "We have always safely left our passports in hotel safes. I generally would not leave things unattended on the beach but a workaround is to just bring towels and shoes and leave all the valuables in the room or safely in stored luggage."}, {"username": "Daneda Russ", "comment_text": "Just got pack from Italy last week. We were asked for identity documents at almost every attraction which required timed entry tickets with named entrants (for example visiting The Last Supper in Milan). We were asked at every hotel check in and in some cases when purchasing train tickets (in Levanto when purchasing Cinque Terre regional day pass). We were travelling with a friend from the Philippines and he was asked to produce identity documents a couple of times. If you are a visible minority you will be asked. That said, l don’t know if a copy of passports would have sufficed. We carried our documents with us. Only one attempted pickpocketing on the Rome subway, otherwise we felt pretty safe."}, {"username": "Heather Robson", "comment_text": "Just to keep things in perspective, less than 1% of the more than 10 million tourists to Italy are victims of pickpockets. This group has been helpful in other ways but seems to generate a lot of paranoia around crime."}, {"username": "Don Bussolari", "comment_text": "Lots of good answers. My opinion actually what I believe. Always take it with you. I trust myself before any safe or Hotel Manager. in the EU or US or any other country."}]}, {"id": "2209397542792657", "text": "Best bike tours either Sorrento, Florence or Tuscany please and thank you!!", "link": "facebook.com/groups/1373361046396315/permalink/2209397542792657/", "likes": 2, "comments": [{"username": "Miyuki Kanno Paul", "comment_text": "Bicycles or motorcycles?"}, {"username": "Rose Turdo", "comment_text": "Tuscany,\n\" Tuscany is a region in central Italy with an area of about 23,000 square kilometres (8,900 square miles) and a population of about 3.8 million inhabitants."}]}, {"id": "2209400536125691", "text": "I’m going to Italy in October but we will be on a Cruise . Flying to Venice then getting the ship from there . Will be stopping at different ports in Italy!!! What is the weather like in October and what to pack?", "link": "facebook.com/groups/1373361046396315/permalink/2209400536125691/", "likes": 5, "comments": [{"username": "Vanessa Durkin", "comment_text": "Vanessa Durkin"}, {"username": "Colleen Dawson", "comment_text": "If you are going on an ocean cruise, The departing port is most likely not Venice.The weather recently has been unpredictable, suggest a few days before departure to check again."}, {"username": "Miyuki Kanno Paul", "comment_text": "October can be a hit or miss. I was in Italia for 3 weeks in last October. It is a shoulder season, so be prepared for a sudden weather change. Usually chilly in the morning and the evening, but warm during the day. Depending on where your port of calls are, you may want to carry a light jacket. Layering your clothes are good idea as well. Beach season is definitely over in October, by the way. Don’t forget about packing an umbrella!"}, {"username": "Laura Uribe", "comment_text": "Weather is warm all through October."}, {"username": "Antonio Aloè", "comment_text": "Just google..."}]}, {"id": "2209402409458837", "text": "I have a Regional train question. On one of my trips I will have 4 different transfers. From what I know when I buy my ticket at my departure town it will cover all my transfers. My question is: do I need to validate my ticket at each new transfer/station?", "link": "facebook.com/groups/1373361046396315/permalink/2209402409458837/", "likes": 1, "comments": [{"username": "Colleen Dawson", "comment_text": "If you buy a single ticket from A-B, although you have transfers you only need to validate once. If you have more than one ticket you will need to validate the others."}, {"username": "Colleen Johnson", "comment_text": "Shouldn’t it say”we”? Are you traveling without Mark, now? 😜😆"}, {"username": "Paul-André Panon", "comment_text": "Have you looked into Eurail passes? We once got them through the travel agency in the UBC AMS Nest. You get them for a selected number of days in a month. If you're doing lots of train changes like that, but only travelling on a few days it can be very cost effective, especially if your travel is all in one country. But even across 2 countries it can still give big savings.\nhttps://\nwww.eurail.com/\nen/eurail-passes"}]}, {"id": "2209403766125368", "text": "Best website for train booking Rome-Florence-Venice", "link": "facebook.com/groups/1373361046396315/permalink/2209403766125368/", "likes": 18, "comments": [{"username": "John Bruckman", "comment_text": "Trenitalia.it"}, {"username": "Lalita PosBa", "comment_text": "Trainline.com"}, {"username": "Christine Carbone", "comment_text": "Omio-I booked all my trains through them"}, {"username": "Kateryna Koriavko", "comment_text": "https://\nwww.omio.com/ train, bus, flights and carpool"}, {"username": "Heidi Kastner Simmons", "comment_text": "Omio"}, {"username": "Paul Graafsma", "comment_text": "https://\nwww.trenitalia.c\nom/en.html"}, {"username": "Blanca Gil", "comment_text": "Trenitalia- it’s the National train service\nI always book with them. You can save your tickets on Apple wallet. There is an also an app - you can purchase tickets as well as reminders for your trains coming up."}, {"username": "Dharmi Shah", "comment_text": "Thank you so much 💕. One more question, does 23 months old count as a child ticket ."}, {"username": "Yara Yousef Karmout Salman", "comment_text": "Omio"}, {"username": "Angela Huntenburg Russell", "comment_text": "Trenitalia!"}, {"username": "Brittany Pardue", "comment_text": "I’m guessing Omio and Trenitalia are pretty similar"}, {"username": "Elizabeth May La Duca", "comment_text": "Google maps / directions for options, then go to websites"}, {"username": "Morgan Bradley", "comment_text": "Trenitalia app"}, {"username": "Nora Glenn", "comment_text": "Italo more than 240km per hour"}, {"username": "Iris Garza", "comment_text": "Trenatilia. Change settings to English. Super easy to use."}, {"username": "Dharmi Shah", "comment_text": "Thank you for the information. I downloaded trenatilia and using it to book. Thank you everyone ❤️"}, {"username": "Miyuki Kanno Paul", "comment_text": "Trenitalia.com"}, {"username": "Antonio Aloè", "comment_text": "Trenitalia"}, {"username": "Toby Levy", "comment_text": "Italo"}, {"username": "Heikki Valtonen", "comment_text": "Treni Italia"}, {"username": "Maria O'Callaghan", "comment_text": "Trainline."}, {"username": "Nancy Cioffi Caccamo", "comment_text": "Italo were fantastic"}, {"username": "Vernell Carranza", "comment_text": "First time in Italy and was super nervous…Omni was fantastic…"}, {"username": "Baidurya Chatterjee", "comment_text": "Trenitalia"}, {"username": "Joanne Parkes", "comment_text": "I just used trainline was straight forward and easy"}, {"username": "Katy LeMasters", "comment_text": "Italo gives you a discount code when you register with them"}, {"username": "Joan Alabat Torralba", "comment_text": "Trainline"}, {"username": "Carol Bennett", "comment_text": "Trainline"}, {"username": "Liva Klein", "comment_text": "I book through Omio"}, {"username": "Janette David Payne", "comment_text": "Trainline"}, {"username": "Kally Trahearn", "comment_text": "check out Trenitalia"}, {"username": "Katie Hooker Thomas", "comment_text": "Trenitalia. You can take the fast train to those destinations too."}, {"username": "Natassa Katsouli", "comment_text": "Trainline very reliable and gives you different options . You can download the app and have e-tickets"}, {"username": "Jennifer Lynn Davis", "comment_text": "We used trainline while there."}, {"username": "Jennifer Teusink", "comment_text": "I booked through italiarail 🤷‍♀️ same trip but reversed. Venice-Florence\n- Rome."}, {"username": "Rita Scotto Epifanio", "comment_text": "Trenitalia or Italotreno"}, {"username": "Carlos Arotinco", "comment_text": "Trenitalia"}, {"username": "Dharmi Shah", "comment_text": "Thank you so much!❤"}, {"username": "Judith Lamas", "comment_text": "Trenitalia🚉\nhttps://\nwww.trenitalia.c\nom/"}, {"username": "Maria Vamva", "comment_text": "Check also https://\nwww.italotreno.i\nt/en"}, {"username": "Anna Sanday", "comment_text": "We used the Trainline app. It let us save in Apple wallet. Had no problems at all"}, {"username": "Melissa Marth Paretti", "comment_text": "This app is great!"}, {"username": "Rachel Bradfield", "comment_text": "I use Omio"}, {"username": "Terri Bradford", "comment_text": "Rome2Rio gives you multiple options."}]}, {"id": "2209408439458234", "text": "Breakdown of budgets for Italy", "link": "facebook.com/groups/1373361046396315/permalink/2209408439458234/", "likes": 0, "comments": [{"username": "Alessandro Iannelli", "comment_text": "It can be almost anything you want it to be. It depends on what you want to do, how you want to move (private means? Public transportation?\n), where you want to eat (how often would you go to a restaurant? What kind of restaurants would it be?), what \"extra\" activities you're interested in if any, etc. On the low end, it could be maybe 50 euros a day (apart from accomodation), considering that as a tourist you're still going to move, go places, spend money for activities, museums, etc. It could easily go well 100, 200 (a day) etc if you hire a car, move a lot with you car, do expensive activities, eat every day at a fancy restaurant, etc. Anyways, a decent but not overly expensive restaurant dinner could be from around 25-30 euros, but it can vary a lot. Food, if you go to supermarkets it's not expensive, especially in the south."}]}, {"id": "2209414479457630", "text": "Is Five days enough for Rome and Venice.", "link": "facebook.com/groups/1373361046396315/permalink/2209414479457630/", "likes": 42, "comments": [{"username": "Thomas Fergel", "comment_text": "No bit its a start"}, {"username": "Rebeca LoCascio", "comment_text": "Yes I did 3 in rome & 2 in Venice! Wish we would’ve flipped it though and spent that extra day in Venice"}, {"username": "Scott H Fɭƴŋŋ", "comment_text": "Yes. I did 3 nights in Rome and 2 nights in Venice, last October. Don't listen to anyone saying you can't do it"}, {"username": "Kelly Reagan", "comment_text": "No"}, {"username": "Manny Manny", "comment_text": "Personally if you are just going to do the tourist thing 2 in Venice is enough and 2 in rome is enough . You want to explore and really see Italy than absolutely not ."}, {"username": "Rosanne Valles", "comment_text": "No not at all"}, {"username": "Robert DeLeon", "comment_text": "No way. We did four nights in Rome and three nights in Venice and that wasn’t enough time to see everything we wanted to see."}, {"username": "Alicia Fancher", "comment_text": "In my opinion, you need at least 5 days in each place. There’s so much to see and do, and don’t forget the time you lose traveling between cities and checking in and out of hotels."}, {"username": "Cory Siegenthaler", "comment_text": "Italy is never enough!☺️"}, {"username": "Christine Ann", "comment_text": "No, I was in Venice for 6 and was so sad to leave. I would say you need 5 in each"}, {"username": "Maria Giordano", "comment_text": "So no"}, {"username": "Nancy Cirone Steele", "comment_text": "Nope!"}, {"username": "Abe Michelson", "comment_text": "I think you need a week in Rome. 4 Days in Venice. If I had two weeks. 9 days in Rome & 5 in Venice."}, {"username": "Hamjesnly Chak", "comment_text": "It’s depend on if you plan visit museums or not.. if YES then the answer is No."}, {"username": "Martinez Martin", "comment_text": "Never enough time, but inwould do 2 days in Rome and 3 in Venice."}, {"username": "David Ockman", "comment_text": "It has to be for the average tourist!\nMost only have a weeks vacation…. Do the most you can and surely 4-5 days is GREAT"}, {"username": "Laura DeCicco", "comment_text": "No"}, {"username": "Paula Manzo", "comment_text": "Yes. Plan well."}, {"username": "Janis Nunez", "comment_text": "I’d pick either the north region or the south region for the week. But I do understand if this is your once in a lifetime trip and you don’t plan to return, you should go for it. We just got back from northern Italy and Venice was amazing. I loved Rome when we went years ago, but Venice is magical."}, {"username": "Marie Cole", "comment_text": "Yes."}, {"username": "Karen Schmidt", "comment_text": "It’s a lovely appetizer. It’ll give you a small taste of each city making you want to come back for more. Three in Rome and two in Venice is a good start.￼"}, {"username": "Marie Cole", "comment_text": "Spend more time in Venice vs rome"}, {"username": "Michele Ann Tomao Ruzzano", "comment_text": "Yes, We did 5 days in Rome and 4 days in Venice"}, {"username": "Patricia Siemiontkowski", "comment_text": "I did an 8 week summer session abroad in Rome. Not nearly enough time to travel around the country and to get to know the people! I've been back several times since then."}, {"username": "Barbara Bastianini", "comment_text": "5 days in each would be ok."}, {"username": "Jo Ann Schwartz Woodward", "comment_text": "It’s a good start. Hopefully you will continue to return after being bit by the Italian bug."}, {"username": "Jennifer Gustafson", "comment_text": "No we did 3 in Venice and 4 in time and still wanted more time."}, {"username": "Beth Casey Murphy", "comment_text": "No"}, {"username": "Bob Sullivan", "comment_text": "Depends on what you're going for. If you're not a museum person or you expect you'll be back again, it's a nice taste. Definitely won't see it all but you'll get enough to know whether you'd want to return."}, {"username": "Jennifer Lynn Davis", "comment_text": "If you hit the high lights. I was in Rome for 8 days and didn't get to see everything I wanted to see. Lol. There's a lot!"}, {"username": "Jessica Olivero", "comment_text": "Heavens no!"}, {"username": "Michael Kirkendoll", "comment_text": "Not really"}, {"username": "Joanne Traola Dagato", "comment_text": "Not even close"}, {"username": "Edoardo Casolo", "comment_text": "No"}, {"username": "Virgz Van Møøre", "comment_text": "No"}, {"username": "Ashley Martins", "comment_text": "Not really, I suppose you could do 3 & 2 but you’ll loose half a day traveling between the 2."}, {"username": "Peggy Corcelli", "comment_text": "We spent 5 days JUST in Rome."}, {"username": "Mike Whitaker", "comment_text": "You can see Rome in 3 days and Venice in 2 for sure. You'll be walking 8 to 10 hours a day. I would try Rome for 4 days though."}, {"username": "Cindy Sguazzin", "comment_text": "Barely, but better than nothing!"}, {"username": "Marie Cuzzi", "comment_text": "No way"}, {"username": "Brooke Dowling", "comment_text": "No, I did four days in rome last year and bumped it to 5 this year… with travel time it’s just not enough time"}, {"username": "Liz Mazzare Contadeluci", "comment_text": "No, one or the other"}, {"username": "Suzanne Mills", "comment_text": "Absolutely NO!"}, {"username": "Kelly Bfp", "comment_text": "My son just did 1 week in Rome of a five week vacation. Loved Rome so much!"}, {"username": "Ken Lerch", "comment_text": "Yes, if all you are interested in is the selfie and snapshot tour. But to get “enough” you’ll need much more time."}]}, {"id": "2209429239456154", "text": "When traveling overseas, can I bring my medications in a pill box or are you required to bring them in the official prescribed bottle?", "link": "facebook.com/groups/1373361046396315/permalink/2209429239456154/", "likes": 6, "comments": [{"username": "Alicia E Harker", "comment_text": "Going through your medication is a HIPAA violation, I believe?"}, {"username": "Lorraine Swick Sanfilippo", "comment_text": "They never questioned mine in the UK it was in both my date pack and some bottles"}, {"username": "Barb Krieg-Stepien", "comment_text": "I just returned from Europe. I put our meds in pill box in our carry on and took pics of the rx containers. No problems"}, {"username": "Lori Haines", "comment_text": "Are supplements quesioned?"}, {"username": "Anita Clayton", "comment_text": "Always take ours in pill box and never been questioned"}, {"username": "Shannon Pacheco Modin", "comment_text": "When I go on a cruise I put my pills in a pill container. I do not bring the bottles or my prescriptions. They don’t even look in my bag. And we just throw Acetaminophen into a Ziploc bag. I am also a type 1 diabetic so I have to bring insulin pens and needles and I carry them in my carry on and I have never been questioned. I also wear an insulin pump and a Dexcom"}, {"username": "Sara Beth", "comment_text": "My husband kept his in pill boxes and brought the original scripts just in case. No issues."}, {"username": "Jodi Caracciolo Orvieto", "comment_text": "You can put it in anything."}, {"username": "Jenny Payne", "comment_text": "Also get a letter from your Doctor , have always taken a letter as I’m an asthmatic but never had a problem 🌻"}, {"username": "Laura Uribe", "comment_text": "We put each daily set of pills in a little container like you get from a pharmacy when packaged (think really small ziplock bag). Have never had an issue. The bottles take up too much room with all the regulations on suitcases these days."}, {"username": "Miyuki Kanno Paul", "comment_text": "I bring my prescription medications in original containers showing the label with my name and the name of the prescription. If you are bringing narcotics, it’s better have your prescription labels on the container. Every country has a different regulations and restrictions. You may want to check Italian government’s official website for clarification.\n\nFor example, the country of Japan prohibits anything with Pseudophedrine in it. Back in the US, red Sudafed, in which contains Pseudophedrine,\nis available over the counter and sold as cold medicine. It’s a huge no no to Japan.\nKnow what is legal to bring into the host country"}, {"username": "Carla Vee IsMe", "comment_text": "Who has written scripts anymore? My doc calls them in..."}, {"username": "Joyce Patire Slivinski", "comment_text": "That’s how I brought mine. No problem."}, {"username": "Maxine Cunnyngham", "comment_text": "I have never traveled internationally\nwith my prescriptions in the original bottle, and have never had any problems."}, {"username": "Alicia Cox", "comment_text": "I put in my sorter but I have all the “labels”; you can ask pharmacy to print the labels or just a list. I’ve always been told bring in your bottles, but I haven’t & never was questioned."}, {"username": "Alicia Cox", "comment_text": "But if it’s a controlled substance, leave that in the original bottle"}, {"username": "Sandra Maldonado", "comment_text": "Dispenser box for me. Never had problems in over 30 years."}, {"username": "Suzi Bone", "comment_text": "I just went-can be in any labeled container"}, {"username": "Jovita Ferro Poth", "comment_text": "I had some in their original bottles and some in pill boxes. They never checked them."}, {"username": "GaryandKerry Bell", "comment_text": "Get your doctor to give you a print out of all your Meds and carry that with you. That’s what we do but have never been asked in 38 counties"}, {"username": "Heidi Shaffer Montecino", "comment_text": "You should be fine. I had no issues"}, {"username": "Lane West", "comment_text": "Yeahhh this whole bring the original bottle thing is not going to work for my mom. She takes like 12 different things every day. All those bottles will require a separate carry on suitcase."}, {"username": "Sonya Valentino", "comment_text": "TSA guidelines on prescription medication.\n\nhttps://\nwww.tsa.gov/\ntravel/\ntravel-tips/\ncan-you-pack-you\nr-meds-pill-cas\ne-and-more-ques\ntions-answered"}, {"username": "Sonya Valentino", "comment_text": "Sonya Valentino"}, {"username": "Gwen Reuben", "comment_text": "In 15 years of international travel, since we retired. I’ve never had my medications questioned. I do carry prescription information, just in case. All meds in weekly/daily containers."}, {"username": "Rickie Vivrette Corman", "comment_text": "I had my pharmacist print me off labels and I put them in snack baggies so it was relatively flat! Zero issues."}, {"username": "Frances Spransy Harper", "comment_text": "I have too many to bring the bottles and none are controlled substances. I sort mine into individual little baggies and I have a picture of each pill bottle with all the info. Just got back from the Mediterranean and there were no questions."}, {"username": "Christine Sounes", "comment_text": "Just ask the pharmacy to print the script out. And I’ve never taken my pills in original bottles simpler to put them in day by day little dispensers"}, {"username": "Darcy Jessen", "comment_text": "Brought mine in pill box. No\nProblem"}, {"username": "Pat LeRoux Bales", "comment_text": "I take a lot! Take pictures if prescription bottles and put the meds I a weekly dispensing container. Never had a problem. For as needed opioids I keep them in their containers from the pharmacy"}, {"username": "Myriam Rodríguez", "comment_text": "You can take ur medication in any bottle"}, {"username": "Eileen Bruce", "comment_text": "Medicine should be in original labelled containers and you should have a copy of prescription"}]}, {"id": "2209433312789080", "text": "Here's my culinary wish list. We have been coming to bella italia at lake garda for 13 years and I am a huge fan of culinary delights\nfirst one is right next to the hotel, 5 meters from the campsite\nhttp://www.saligusta.it/home.html\nFish restaurant with owner from Sardinia great langoustines (scampi) < fried baby squid with zuccine and mussels in tomato sauce not expensive and children's playground next to it and afterwards you can roll to your mobile home 🙂\nmuch further away in sirmeone and quite expensive but the verry best in whole of garda lake\nhttps://www.risorgimento-sirmione.com/en/home-2/\nhere we always eat crudite di mare (various types of raw fish) or insalata catlan (lobster salad that is freshly made at your table) in advance and as a main course sea bass or steak cooked in a salt crust absolutely fantastic for dessert, crepes suzette or zabayone are also freshly prepared at your table made in advance\n10 minutes driving on top of a mountain with a realy lovely view there is\nhttps://www.agriturismo2laghi.it/\nwhere paolo the cozy fat italian cook and his wife do everything order here the coteletta milanse (schnitzel) on the bone sliced thin really delicious\nfor a really lovely lunch there is\nhttps://www.marcoedanielatime.it/\nits in peschiera they have realy lovely types of culattelo ham and cheeses and all kind of lunch the last one i will mention is in lasize and its a fish restaurant with a lovely wood oven https://www.tavernaoreste.it/\ni hope you will enjoy some of these places they are realy ittalian restaurants and not like the many tourist traps for me food is verry important and as half sicilian i know whats real and what not\nif someone visits one of these places let me now if you enjoyed it", "link": "facebook.com/groups/1373361046396315/permalink/2209433312789080/", "likes": 6, "comments": [{"username": "Pietro Adami", "comment_text": "Great Choice. I would add La Locanda di Noris near Peschiera del Garda (fish, fairly expensive) and the La Fassa in Castelletto di Brdnzone."}, {"username": "Carool van Kesteren", "comment_text": "Daar zijn leuke en lekkere dingen bij! Ik was daar ooit, hele meer niet gezien vanwege de mist. Polenta os niet mijn favoriete eten."}]}, {"id": "2209435276122217", "text": "Hi. I’m wondering if anyone has used both Airalo esim and WiTourist and which would be better for a 21 day trip across Italy? I just found the WiTourist info and it looks pretty cool. Thanks for recommendations.", "link": "facebook.com/groups/1373361046396315/permalink/2209435276122217/", "likes": 1, "comments": [{"username": "Costero Home", "comment_text": "Airalo by far is the best IMO. We use it for 6 months accross the EU and Morocco every year."}, {"username": "Thilindi Ranasgalla", "comment_text": "Airalo works great"}]}, {"id": "2209448539454224", "text": "If you had to choose, which is best for a day trip from Milan? Lake Como or Lake Maggiore? We only have time left to do one. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2209448539454224/", "likes": 0, "comments": [{"username": "Ike Simoncini", "comment_text": "Como is more beatifull but if you want to do a city trip i would say verona"}, {"username": "Glenn Todd Webb", "comment_text": "Went to both in May. It’s easier to get to lake Maggiore in rental car. Palazzo Borromeo and palazzo Madre are prettier than Villa balbianello, Carlotta, and Melzi on Como. It takes much longer to get to the villas on Como. So Maggiore."}, {"username": "Iliana Zlatareva", "comment_text": "Como"}, {"username": "Karen Blackmore", "comment_text": "Milan to Lake Como is easy by train"}, {"username": "Marilisa Romito", "comment_text": "Bologna"}, {"username": "Suzanne Mills", "comment_text": "Garda!"}, {"username": "Renae Larcus", "comment_text": "I have not been to Maggiore, but Como and Garda are lovely! Quick trips by train from Milan"}, {"username": "Rebecca Yeoh", "comment_text": "Lake Como is so close to Milan. 45 min train trip to Como San Giovanni station, then I’d say about 15 - 20 min walk to the ferry terminal. The ferry will take you all the way up to Bellagio and if you have time then go to Menaggio and Varenna. The ferry trip takes about 2 hours from Como to Bellagio, but as soon as you dock at Bellagio (or whatever your final stop is before heading back to Como), purchase the speed ferry back which is an add on to your regular ticket. Buy the speed ferry ticket hours before you need it as it sells out. If you don’t get speed ferry tickets back then you just get another long scenic ride back to Como."}, {"username": "Judith Pitman", "comment_text": "Thanks for the input! 😊"}, {"username": "Kay Rendall", "comment_text": "In Como now. Long lines to get tickets. 6.30am, took an hr plus to get ticket 9am fast ferry. U can buy a day pass with extra loading to get fast ferry there slow ferry back. However u can't buy return ticket for fast ferry as limited seats, so must purchase for next departing fast ferry. During day lines to purchase tickets 2 hrs plus, crazy. Funicular the same, stood in ticket line for 1 hr yesterday. It didn't move. 1 ticket seller. I am here for 8 days, expected to just jump on a ferry whenever I wanted, like past visits. Not possible."}, {"username": "Lauren Solotar", "comment_text": "Recommendations\nfor places to stay in Lake Como??"}, {"username": "Cathy Newton", "comment_text": "Lake Maggiore"}]}, {"id": "2209459556119789", "text": "If anyone is looking for opera tickets for La Scala (Milan) in September, there are a few available on ticketswap right now!", "link": "facebook.com/groups/1373361046396315/permalink/2209459556119789/", "likes": 2, "comments": []}, {"id": "2209465159452562", "text": "Does anyone know where this is at in Rome?", "link": "facebook.com/groups/1373361046396315/permalink/2209465159452562/", "likes": 39, "comments": [{"username": "Cecilia Christine Costantini", "comment_text": "I think it is there. I am from Rome (although I moved away 24 years ago) and just discovered this place last April 😆😆😆"}, {"username": "Amy O'Grady", "comment_text": "Yes this is it! Thank you!!"}, {"username": "Gina Romano Peralta", "comment_text": "Stunning!!!!"}, {"username": "Reham Botros Ghali", "comment_text": "Yes, we stayed there. It’s right by the Vatican"}, {"username": "Elizabeth Rose", "comment_text": "Daniel Growcott"}, {"username": "Gianna Onesi", "comment_text": "Google says https://\nimages.app.goo.g\nl/\nT4XwdGNo4NP8sNFR\nA"}, {"username": "Gianna Onesi", "comment_text": "Ruins of the Roman Forum my facebook doesn't like the word google lol"}, {"username": "Kendra Fowler", "comment_text": "Beautiful"}, {"username": "Back Stage", "comment_text": "Jewish district"}, {"username": "Carolyne O'Hagan", "comment_text": "Right behind the Altare Della Patria"}, {"username": "Miyuki Kanno Paul", "comment_text": "Ghetto"}, {"username": "Jason Hobel", "comment_text": "I know exactly where this is. It is the ancient road of Clivus Argentarius. It is right next to Monument to Victor Emmanuel II. If you punch in these coordinates on Google Earth, it will take you to that location 41.893808, -12.48445"}, {"username": "Bill Elias", "comment_text": "To the left and behind the wedding cake building.\n\nhttps://\nmaps.app.goo.gl/\nS2kdjSk6FUFE8FWk\n7?g_st=ic"}, {"username": "Elise Wall", "comment_text": "Troy Wall"}, {"username": "Amy O'Grady", "comment_text": "Thank you all for the comments!!"}]}, {"id": "2209463519452726", "text": "“Born from a thought of love and a dream of beauty”, as Giovanni Pascoli wrote, Pienza is known as the incarnation of the ideal city: perched on top of a beautiful hill in scenic Val d’Orcia, Pienza willआणखी enchant you with its charming stone architecture, romantic alleys, world-famous pecorino cheese and picture-perfect landscapes.\nJoin our NEW virtual experience: https://nextstop-italy.com/virtual-tours/pienza/\n\n#italytravel #artlovers #hiddengems #italygram #vacationmood #virtualworld #history #italytrip #medievalarchitecture #medievalart #medievalhistory #medievalcastle #italytrip #hiddengems #artlovers #tuscany #tuscanygram #tuscanyitaly #tuscanytravel #tuscanypeople #tuscanyexperience #pienza #pienzaitaly #pienzatuscany #renaissance #renaissanceart #orciavalley #valdorcia", "link": "facebook.com/groups/1373361046396315/permalink/2209463519452726/", "likes": 6, "comments": []}, {"id": "2209270362805375", "text": "Amazing sunset in Tuscany, Italy.", "link": "facebook.com/groups/1373361046396315/permalink/2209270362805375/", "likes": 8, "comments": []}, {"id": "2209316872800724", "text": "Stifone, Umbria🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2209316872800724/", "likes": 14, "comments": []}, {"id": "2209319449467133", "text": "Would you visit Italy in December?", "link": "facebook.com/groups/1373361046396315/permalink/2209319449467133/", "likes": 1, "comments": [{"username": "Jason Hobel", "comment_text": "I would live there year round if I could. And Italy is beautifully decorated for Christmas 🎄"}, {"username": "Ken Lerch", "comment_text": "And every other month too."}, {"username": "Heath Conn", "comment_text": "I’d visit any month but August. Some months are better than others from a weather perspective. In December, I’d probably stay south of Rome. Puglia or Sicily would be great."}, {"username": "Enrico Lecce", "comment_text": "Absolutely 💯"}, {"username": "Gerhard Kahl", "comment_text": "Napoli Sicily Puglia I 🇮🇹"}, {"username": "Anna O'Connor", "comment_text": "Yes, we went to Rome, Florence & Venice in December. It was magical."}, {"username": "BatEl Kogman", "comment_text": "Xmas 🎄 time!!"}, {"username": "Enrico Lecce", "comment_text": "Italy's Christmas month becomes so festive while creative lighting fixtures circulating obove the homes... everyone is so happy great food.... quite a spectacular view..."}, {"username": "John Bruckman", "comment_text": "Absolutely!!"}, {"username": "John Adams", "comment_text": "My first time in Italy was in December. I would do it again and again."}, {"username": "Annie Yang", "comment_text": "Most definitely!"}, {"username": "Ildiko Gyimesi Mikos", "comment_text": "I would visit Italy any time of the year! December sounds wonderful!!"}, {"username": "Jenn Smith", "comment_text": "Absolutely!! It's amazing in the winter."}, {"username": "Bobbie A. Lewis", "comment_text": "I definitely would. We visited Amsterdam, Germany, France, and Switzerland over Thanksgiving a few years back. It was absolutely wonderful. And the Christmas Markets were a big plus. It misted rain a time or two and we wore medium weight coats a lot of the time. But is was so much better than going in the heat of summer."}, {"username": "Kathleen Pascale Pieper", "comment_text": "Yes. Was in Florence just before Christmas! Beautiful!"}, {"username": "Jay Cabrera", "comment_text": "YES!!!"}, {"username": "Miyuki Kanno Paul", "comment_text": "I would…only if I can hold December vacation days from work😢"}, {"username": "Colleen Dawson", "comment_text": "Will be there this December."}, {"username": "Gina Verdeza Carvajal", "comment_text": "Yes‼️"}, {"username": "Lynne Meyer", "comment_text": "No : nothing open"}, {"username": "Yolanda Hanavan", "comment_text": "I would and I am this year. 😊"}, {"username": "Elaine King", "comment_text": "No, 1 too cold, 2 floods"}, {"username": "Carol Taylor Tisdale", "comment_text": "In a heartbeat!"}, {"username": "Sarah Nachar", "comment_text": "The cold winter doesn’t stop Italians from going out!! I loved it! Less tourists too, although still quite busy with tourists depending where you go. And the winter fashion is 💋 👌"}, {"username": "Kathy Buresh", "comment_text": "Most definitely!"}, {"username": "Rosy Azeri", "comment_text": "Yes, I done booked flight ticket to Milan on december 👍"}, {"username": "Greta Sangster", "comment_text": "I would visit Italy any month of the year ❤️"}, {"username": "Beverly Antonio - Ramirez", "comment_text": "Absolutely.😍"}, {"username": "Rhonda Russell", "comment_text": "Spent last December in Florence. While it was cold and there were a few wet days it’s Italy, always joyful 🇮🇹🍷🍝🍕❤️"}, {"username": "Laura Cangemi", "comment_text": "Yes!! Como has the most beautiful Christmas festival. The lights and decorations are like nothing I’ve ever seen. Whether you celebrate Christmas or not. It is not to be missed"}, {"username": "Hanne Neerup", "comment_text": "Absolut.\nGør det igen til nytår 2023.\nVar der julen 2022"}, {"username": "Emmanuel Bautista", "comment_text": "Yes. The city celebrates Christmas like other European countries."}]}, {"id": "2209356156130129", "text": "🏛️Here is my “ self made “ itinerary for October 5th through the 17th for my husband, my 14-year-old son and myself.\nFly out on Thursday October 5th, land in Rome afternoon Friday the 6th and staying near, piazza Navona. will visit the Spanish steps, Trevi fountain, and the pantheon. Dinner and gelato\nSaturday 7th = sistine chapel & Vatican museum and Evening night tour of Colosseum\nSunday 8th = mass at St. Peter’s and then get car to drive up to Tuscany area-\nSpend Sunday the 8th night, 9th & 10th !?! montepulciano area …I need winery and hotel recommendations ….!! HELP needed here.\nOn 11th drive down to tour Pompeii - ( my son wants to see ) then stay in sorrento nights of 11th & 12th\nOn 13th drive to tropea spend the night there =dinner & walk around the town\n14th drive to ferry to Sicily.\nStay in taoromina 14th and 15th.\n15th drive to Cefalu spend night there.\n16th drive to Palermo - spend one night- fly out 17th from there.\nI have my airfare booked and most hotels - except Tuscany area, looking for advice - Should I spend one more day in Rome or should I keep the three days in Tuscany? Adding- We are pretty well traveled family so the schedule doesn’t really scare me. But advice and tips are welcome -", "link": "facebook.com/groups/1373361046396315/permalink/2209356156130129/", "likes": 15, "comments": [{"username": "Pam Kimak", "comment_text": "I'm exhausted at your itinerary.. and think it's a bit much to do ..personally. I was in Rome with my daughter and her two sons 23 and 2o. We opted to go to Rome 3 days..flew in from ewr..and had one tour ..2 plus hours...at Sistine Chapel.We did alot roaming around Rome with no plans..and had the best time..no dinner reservations..e\ntc..Took a train from Rome to Naples with transfers to Maiori. Stayed in s hotel across from Tyranian Sea,and relaxed on the beach with lovely dinners in town. Didn't rent a car..flew home out of Naples. Great trip."}, {"username": "Rick Schneider", "comment_text": "Wow ! Some long drives in there ! Rome has more history then Tuscany , Palermo more then Cefalu . Drive into Palermo but drop off car , it's a crazy city to drive in. For history on way to Palermo or Cefalu go to Agrigent Calley of Temples...aweso\nme"}, {"username": "Gina Rovello Keenan", "comment_text": "I would consider eliminating Florence this trip. It a 5 hours drive to Sorrento. If you stop in Pompeii that is going to be a VERY long day. I would add a night to Rome and then add to Sicily. That's a lot of movement."}, {"username": "Lheah Bilgera Gearon", "comment_text": "Mark Fern"}, {"username": "James-Kathy Dickerson", "comment_text": "Wow u have done a great job! Sorry I can't help but sounds like an amazing time...have fun!"}, {"username": "Sonia Starinieri", "comment_text": "For Tuscany we stayed near Montepulciano in a hotel called Villa Ambra which we really enjoyed. We took the mezza penzione with breakfast and supper and food was amazing. There are wineries in the town but I would book ahead or there are also open stores that will give you a free tour of their cellars with wine tasting and food. The drive in the Val d'Orcia area is beautiful so stop and take pictures."}, {"username": "Hollis H McGuire", "comment_text": "We love Montepulciano but usually stay for a week. Having said that, I think more time in Rome (Montepulciano is fairly small and easily walkable) and you really should include a few hours at Navona and Campo di Fiori.\nChoose a hotel in the town of Montepulciano. And there are many vineyards to choose from after you get situated there.\nYour Sicily choices are great. Cefalu is often overlooked and it’s worth it!"}, {"username": "Jeff Gentner EA", "comment_text": "Very ambitious itinerary. There's a huge difference between SEEING Italy and EXPERIENCING Italy. Looks like you want to SEE a lot. I've been to Italy 5 times now and have always enjoyed a more relaxed itinerary. Everyone is different. Good Luck."}, {"username": "Barbara Bastianini", "comment_text": "Everyone’s different but I think this is too much for your time frame. I myself would eliminate Tuscany. Since your trip is mostly focused on southern destinations I wouldn’t first go north from Rome only to have to backtrack south to get to my other destinations. Tuscany is kind of the geographic outlier in this itinerary so rather than increasing my transit time I’d use those three days elsewhere. One more day in Rome might be a good idea then two more somewhere in Sicily, maybe Agrigento? Eliminating the detour north just seems to make logistical & geographic sense to me. Plus three days is a fairly long time in Multipulciano, which is pretty small. And I don’t think wineries will be much fun for a 14 year old.\n\nAgain everyone’s different. These are just my thoughts."}, {"username": "Dixie Kotylak", "comment_text": "Driving to Sorrento will be hairy imo….it’s busy and tight roads! The rest sounds lovely 🙂"}, {"username": "Deborah Schroeder", "comment_text": "Rick Steves' book Italy has a listing of hotels that might help you for Tuscany. Montalcino might have a better selection and in the general area. Big wine town. Sounds like a wonderful trip."}, {"username": "Paola Coppi", "comment_text": "Love it! Very happy to see you have chosen also Sicily, in particular Cefalú which is lovely! Don't forget to visit the old Lavatoio (where people washed clothes) and the narrow streets! A tip on your way to Cefalú :stop for a bath in Torre Conca, Finale di Pollina which is a wonderful place. Palermo is an amazing city: Cappella Palatina and Martorana are mandatory!"}, {"username": "Luciane H Azevedo", "comment_text": "I would spend more time in Tuscany instead of Rome but that’s a personal opinion 🤍 if you’re in the Crete Senesi region, I would also see Pienza and Montalcino 🤩 There’s a farm/\nrestaurant in Pienza called Poderei Il Casale, it’s amazing!\nThere’s also an amazing winery in the region of Siena called Luminositá, if you have the time, I’m sure you won’t regret it ♥️"}, {"username": "Katia Macri-Roberts", "comment_text": "Others have posted their helpful information but I just wanted to add that the drive from Sorrento to Tropea is another long one and in my opinion Tropea is worth another night spent to take it all in. Along the way, once you get off the autostrada at Vibo/Pizzo, the towns of Vibo, Pizzo, Zambrone, Briatico, and Parghelia have so much to offer before you get to Tropea and surrounding towns of Capo Vaticano, and S. Domenica. So much history here too. I've been to Italy 17 times (from Australia) and experienced the north but the south has so much to offer that people tend to miss it completely."}, {"username": "Nancy Matheny", "comment_text": "We are staying at Terra Antica in Montepulciano. They are an active vineyard. They have Vespa and 4 wheeler yours. We booked on AirBNB"}, {"username": "David King", "comment_text": "Seems ambitious… I’d spend an extra day in Rome to acclimate to time zone—especially\nsince you’re doing a lot of driving. We always plan a full “rest day” as the first day (very light activities of any, eat and sleep).\n\nOf all our Tuscany winery visits, we had an AMAZING time at Fattoria Lornano—it’s just north west of Siena (a very quick and easy drive)."}, {"username": "Marybeth Obrien", "comment_text": "Can you share where you are staying in Rome. Going in October too"}, {"username": "Lainie Bennett", "comment_text": "Montepulciano Wine Tour of the Historical Cellars\nhttps://\nwww.talosa.it/\nEmail Graziela as a booking for this is needed."}, {"username": "Lainie Bennett", "comment_text": "Let's just say you and your family are super seasoned travelers and the pace of this itinerary doesn't daunting you, have you priced out picking up a rental car and in Rome and returning in Palermo? I cannot imagine that this will be cheap, if it is at all possible."}, {"username": "Nancy Day", "comment_text": "What accommodations in Taormina if you don’t mind"}]}]