[{"id": "2203718333360578", "text": "We land in Rome at 0845 and will head to Naples\nChecked bag\n\nJust wondering what time I should book my train ticket for 2 people", "link": "facebook.com/groups/1373361046396315/permalink/2203718333360578/", "likes": 2, "comments": [{"username": "Dafne Vassetti", "comment_text": "You need at least one hour to exit from arrivals. So let's say you'll be out by 10am at the most. Then you walk (inside the airport) to the Leonardo Express train that brings you to Termini (Rome Centrale Station). Consider another 30 minutes from when you exit the arrivals, arrive to the Leonardo Express and buy your train ticket (you can buy it on spot at the ticket booth counter or at the ticket machine).\nTrains run every half an hour so you might be waiting up to 30 min to leave. I think you might be leaving by 11 am at the latest. Ride to Termini is 30 minutes.\n\nI would buy tickets for Naples around 12:30/1pm to be on the safe side. :)"}, {"username": "Gillian O'Callaghan", "comment_text": "Just get your tickets when you arrive....no stress if your flight is delayed or long queues at immigration."}, {"username": "Jenny Payne", "comment_text": "I would buy a ticket when you get to station, so many things can go wrong 🌻"}, {"username": "Corina Cristea", "comment_text": "You need 3h between landing and train to Naples (to be safe)"}]}, {"id": "2203638920035186", "text": "Vrbo vs airbnb? We've only used airbnb.... is vrbo the same thing? Does Italy use 1 more than the other?", "link": "facebook.com/groups/1373361046396315/permalink/2203638920035186/", "likes": 1, "comments": [{"username": "Robin Darmstadt Mancil", "comment_text": "I love VRBO."}, {"username": "Eric Parks", "comment_text": "Pretty much the same. I've used both."}, {"username": "Miyuki Kanno Paul", "comment_text": "I use both"}]}, {"id": "2203646503367761", "text": "I have read many posts about charging your phone when you are out all day. We found these portable chargers that do not need cords. Just sharing for anyone who may be interested. I just discovered them yesterday", "link": "facebook.com/groups/1373361046396315/permalink/2203646503367761/", "likes": 34, "comments": [{"username": "Pam Gerretsen", "comment_text": "Check the amp hours - I think you need at least 3000 for one full charge at absolute minimum"}, {"username": "Jennifer Bielat Simmons", "comment_text": "This is the one I have. I do like it. I feel it does take a while for my phone to charge though. ￼"}, {"username": "Heather Carni", "comment_text": "I want one like this that I can use with my bandolier case. These are too wide, the case corners are in the way."}, {"username": "Angela Sonaggera", "comment_text": "These are the exact ones I purchased for me & my mom—Anker is a great brand"}, {"username": "Dixie Kotylak", "comment_text": "Thank you for sharing!"}, {"username": "Dixie Kotylak", "comment_text": "Melinda Kempkens"}, {"username": "Sherin FitzPatrick Shanahan", "comment_text": "These were a life saver for my daughter and I on our trip to Europe. We used our phones so much for picture taking and for maps that it is essential!"}, {"username": "Robin DiFeo", "comment_text": "I used the same ones for Italy. Definitely worth it. Only issue I had was o had to remove case for phone to charge!"}, {"username": "Heather Nixon", "comment_text": "Still need a cord to charge it though. I like the ones that you can plug into the wall or use a charger to charge."}, {"username": "Patty Barnes", "comment_text": "Thanks for sharing!!"}, {"username": "Carol Taylor Tisdale", "comment_text": "We love the anker chargers. These look great!"}, {"username": "Jeff McLellan", "comment_text": "I replaced my iPhone with the 14 Pro Max right before our trip and was amazed how much longer the battery lasts versus my iPhone 12."}, {"username": "Ken Del", "comment_text": "We have one, tossed it, never holds connection, even when using hands to hold phone and charger together"}, {"username": "Kay Malick", "comment_text": "Wonderful...and\nthere are also wireless power banks which can charge without inserting pin (through induction), however the phone needs to have wireless charging feature"}, {"username": "Wendy Spano Bracco", "comment_text": "This charger needs no cords, fast charge and multiple charges a day. Nice and light. I bought a second one as a backup in case but most likely not needed. On SALE on Amazon right now for $30!!!\n\nTG90° Cell Phone External Battery... https://\nwww.amazon.com/\ndp/\nB085NNMPK7?ref=p\npx_pop_mob_ap_s\nhare"}]}, {"id": "2203712076694537", "text": "Valley of the Temples, Agrigento", "link": "facebook.com/groups/1373361046396315/permalink/2203712076694537/", "likes": 1, "comments": [{"username": "Dafne Vassetti", "comment_text": "As an Italian, one of my favorite places ❤️"}, {"username": "Kim Mai Yuen", "comment_text": "Gorgeous ❤️❤️. I will go to visit with my daughters to beautiful place in the world at one day"}]}, {"id": "2203766083355803", "text": "An Airbnb story for you to consider in the future. We were in an Airbnb in Fontane Bianche, south of Siracusa in Sicily on June 23 when it was broken into and robbed of all our cash and valuables. We went to the police station (called 112 over five times and no one answered the phone) and made a denuncia. The host of the house came to the station as well and we asked if the house had ever been broken into. He said it had, but it was years ago. He never told us that, nor were there any security measures in place; no cameras, secure locks (we had keys) or a safe in the house.\n\nThis weekend I received a message from someone who is currently staying in the house and he told me HE HAD BEEN ROBBED AS WELL! That is two robberies in less than three weeks! When asked, the host told the current guests that the house had been robbed years ago. He did not mention us nor did he tell the police about our burglary! I also don’t understand how the police can show up to an address and not have it flagged in their system that a crime had occurred in the same place at least twice.\n\nThe current guest and I are in contact and are considering how to proceed.\n\nI am sharing our story as a warning to others. If you have been a victim of a burglary in this house, or one of the houses this company represents, please contact me.\n\nAnd by the way, this house is completely booked this summer and still available for rent.\n\nGrazie!\n\nhttps://abnb.me/4P82aSrVSBb\n\nhttps://www.syrakus-homes.com/index.php", "link": "facebook.com/groups/1373361046396315/permalink/2203766083355803/", "likes": 18, "comments": [{"username": "Selene Oliver", "comment_text": "Maybe it’s the owner of the house that is doing the robbing… I lived in Italy for awhile and one thing you’ll find out very quickly is that they do not work or operate the way we do here in the USA… which means you’ll get little to no help from them. The most you could do to help future tourists is write a review… both of you. I don’t see one single review that anyone was ever robbed… so that place will continue to be booked."}, {"username": "Caroline Croghan", "comment_text": "Did you report this to Airbnb?"}, {"username": "Paula Brink", "comment_text": "What a terrible thing to have happen. One of the many reasons I will never use Airbnb."}, {"username": "Daisy Yoo", "comment_text": "I just read ur review on airbnb, ty for doing so. I personally have never had a bad exp at airbnb and I usually get a superhost and never leave valuables in and always use the one with security camera and smart key. especially in foreign country. really sorry for what happened to u"}, {"username": "Nancy Day", "comment_text": "I'd put the address out there ."}, {"username": "Donna Spencer", "comment_text": "Thanks for letting us know."}, {"username": "Maria Giordano", "comment_text": "Yet another reason I opt for hotels"}, {"username": "Cynthia Marie", "comment_text": "Sounds like an inside job . Terrible for you. I am also an Airbnb host in the U.S. and I’m shocked that abnb would not help you, as well as remove the property from their platform. It’s quite disappointing. I like to stay in properties that use the key coded system. I ask for a special code, this way I know the guest before me didn’t have the same code.\nWe change our key codes daily at our properties and have security cameras . Our guests safety is our top priority. Unfortunately that’s not always the case.\nI hope you can get pass this and enjoy the rest of your trip. 😥"}, {"username": "Susan Antonelle Pauxtis", "comment_text": "I’m so sorry. I noticed his reviews are inconsistent time wise. Maybe he takes the bad ones down (is that possible?) truly sounds like an inside job to me. I hope the last tenants write a bad review too."}, {"username": "Tracy Reilly", "comment_text": "Sounds sus"}, {"username": "Brenda van Valen", "comment_text": "No Airbnb for me."}, {"username": "Laurie Lee", "comment_text": "Sad 😞"}, {"username": "Lisa Decamps", "comment_text": "Considering the area, I would not be surprised if the host had a part in the burglaries…"}, {"username": "Cathy McDonald", "comment_text": "Interesting that prior to your review last one was October last year and may before that."}, {"username": "Voula Ladas", "comment_text": "It just needs one bad apple for something to go wrong . So sorry this happened to you. People use Airbnb’ s all the time globally, and it’s not often you hear about robberies . I was on a bus tour many years ago in Italy and near the end of the tour ,the driver said to everyone on the bus “this is just a short toilet stop. Leave all your valuables on board as I will be back in five after a quick toilet stop “ He hadn’t said that the entire trip. My suspicions rose at this point, so I took everything with me. Sure enough ,when we all returned to the bus , we had been robbed ,and then spent the next 2 hours at the police station putting in reports . That definitely felt like a setup. My point is…..it can happen anywhere, anytime . Hope things get resolved for you. It’s not a nice thing to experience on a holiday."}, {"username": "Laurie Dick", "comment_text": "I wear a discreet belt under my clothes at my waist that contains my cash, cards and passport at all times. I never travel with anything else of value like jewelry."}, {"username": "Cathy Ann", "comment_text": "Terry Toffolo won’t be staying there 🤨😳"}]}, {"id": "2203785680020510", "text": "hi, planning to visit Sardinia in late August for a week , can anyone advice best place to stay (thinking of North side of the island)\nthanks", "link": "facebook.com/groups/1373361046396315/permalink/2203785680020510/", "likes": 1, "comments": [{"username": "Giu Di", "comment_text": "Porto San Paolo is such a cute little village with amazing water and the Tavolara island right in front. Otherwise Maddalena island, absolutely breathtaking"}, {"username": "Alice Francesca", "comment_text": "Easy to fly into Olbia and explore the beaches North of it.Sleep in Marinella (booking dot com ) and see Spiaggia del Principe, Cala Moresca (natural reserve, don't expect bars or sunlounges) Liscia Ruja, Renato Bianca etc\nSan Pantaleo up on the hills has a boho chic vibe, incredible market on saturdays or perfect for an aperitivo at sunset"}, {"username": "Ken Lerch", "comment_text": "Look at the winery/hotel Leda D’Ittiri in Alghero."}]}, {"id": "2203779180021160", "text": "Traveling from Sorrento to Florence- want to stop off and see Pompeii. Any suggestions as to where to store my suitcase for the day- inside train station? Luggage storage unit that’s safe and easy to get to? Grazie", "link": "facebook.com/groups/1373361046396315/permalink/2203779180021160/", "likes": 0, "comments": [{"username": "Cindy Gallen Barton", "comment_text": "We used the storage locker in pompeii and it worked out well. Right at entrance near ticket booth"}, {"username": "Brenno Bianchi", "comment_text": "If google \"luggage storage Pompei\" many websites and location offering storage solutions at different prices"}]}, {"id": "2203839440015134", "text": "Hi all!\nPlanning a week to 10 day trip in october and seeking some information and tips. We'd like to stay in a place surrounded by nature but also not too far from a city with a wide range of great foodआणखी options. More in to lakes and beaches than museums. We'd like the place we stay in to have a pool and perhaps more activities for kids. Any leads?", "link": "facebook.com/groups/1373361046396315/permalink/2203839440015134/", "likes": 0, "comments": [{"username": "Chiara Normanno", "comment_text": "Pretty much anywhere in southern and central Italy works. If in the North you get amazing mountains but you may be far from the sea, although you'll get cool lakes. I'd say go for a Villa rent on airbnb or booking, also have a look at \"agriturismo\" accommodations that offer house or room rent."}, {"username": "Pietro Adami", "comment_text": "Sirmione or any other village in the south of Garda Lake near Verona. Plenty of opportunities, from nature to art, cities etc.\nFrom October 1st Gardaland amusement park open only at weekends"}, {"username": "Yael Teitelbaum - Yankovich", "comment_text": "Dvir Yankovich"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "I would chose the country between Lecce an Otranto searching a place with a pool: Lecce is great, Otranto really beautiful, the food is amazing and the sea will still be warm and at 20 minutes drive (Puglia is very easy to drive)"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2203864046679340", "text": "Please, no negatives or being insulted if you run the hotels there. Staying in Positano. Have water tours there and Amalfi Coast. Any suggestions as far as carrying passports everywhere we go? We have water resistant pouches and would take turns swimming. Just not sure if hotel safes are the way to go? Better paranoid than stuck? We welcome your experienced responses or plans of what to do in this case.", "link": "facebook.com/groups/1373361046396315/permalink/2203864046679340/", "likes": 15, "comments": [{"username": "Carole Tarlap", "comment_text": "I leave my passport on the hotel safe 💥💥 AND carry a copy with me 🤷 I HAVE HAD NO ISSUES 👍 Everyone has their own ideas......."}, {"username": "Jenn Messina Babore", "comment_text": "We only carried copies of our passports on my phone. That was sufficient whenever we were asked."}, {"username": "Pirkko Storer", "comment_text": "You should carry passports with you all the time in Italy. I worked for years with tourists in Rome."}, {"username": "John Mccormick", "comment_text": "Heading to Italy for our 4th time in October. We’ve never brought our passports with us during our days away from hotel or Villa. Never even gave it a thought actually. We just keep in a hidden spot in room, often not even the safe as had a ring stolen from a safe once in Rio de Janiero."}, {"username": "Brenno Bianchi", "comment_text": "The law says, Dlgs 286/1998 at article 6.3 that a foreigner must provide their passport for inspection to a police officer. Failing to do so, could lead to a 2000€ fine or a 1 year of prison."}, {"username": "Nadine Wells", "comment_text": "Never took our passports when were were out and we started in The north of Italy right down to the south. We hid our passports in our room. Take pictures of your passport and use your drivers license as photo id. My phone was always in my possession or in my bag over the hubbys shoulder while he was taking a pic of me and I still could see my bag."}, {"username": "Mary Brown", "comment_text": "Regardless what the actual law is, I would weigh the pros and cons of carrying your passport.\n\nCarry it with you or not?\n\n1. What are the chances of being stopped by authorities asking to see your passport? Will a photo suffice?\n2. What are the chances of your passport disappearing while locked in your hotel room?\n\n3. What are the chances of your passport getting severely damaged, lost or stolen when taking it with you\n\n4. Comfort level having your passport on you vs. left in a hotel safe or hidden in hour underwear stash"}, {"username": "Margaret Simons-Palmieri", "comment_text": "Always carry passports, leave a copy in luggage. Just saw a post where a couple had a room change while out sightseeing came back to hotel all baggage and safe contents moved to new room. Hotels have access to safes"}, {"username": "Nancy Gould Karas", "comment_text": "Best to leave your passport, and one credit card, in hotel safe. If your handbag/wallet is stolen you will have your ID and at least one credit card. Learned this the hard way in Barcelona."}, {"username": "Sylvie Hogg Murphy", "comment_text": "I’m a frequent traveler to Italy and I used to live there. I only ever carried my passport on me during COVID, when it was required, along with your vaccination card, to go anywhere (restaurants, shops, trains, etc). As many have suggested, take a picture of the photo page of your passport, keep it in your phone, and text it to a family member or friend back home - and leave the passport in the hotel safe or otherwise hidden."}, {"username": "Ian Fawkner", "comment_text": "Italian police can and may ask you to produce your passport at any time - happened to us in Venice last June."}, {"username": "Ruth Akutu Maccarthy", "comment_text": "Thieves don't look for passports, they want cash and expensive items"}, {"username": "Diane Leesmith", "comment_text": "Got this from UK gov wen site. Hope it helps.\n\nhttps://\nwww.gov.uk/\nforeign-travel-a\ndvice/italy/\nsafety-and-secur\nity"}, {"username": "Jenny RV", "comment_text": "Never asked for passport when out and about. But I would bring a photocopy with me and leave passport in hotel safe. To be honest I feel much easier once the passport is in the safe."}, {"username": "Robyne- Robby- Nimmo", "comment_text": "Just back last night from a month in Italy. Been about a dozen times over nearly 40 years. We use hotel safes. Often for beach days we leave phones, cards and passports in safes and then enjoy a swim together."}, {"username": "Stacey Esposito", "comment_text": "Ok no getting mad at me please. This is just our experience. We left our passports in hotel safes during our 11 day trip. Our hotels were in rome venice sorrento and rome for our last night before our flight. We had pics on our phones and copies. When traveling between cities I had them in my travelon bag."}, {"username": "Regina-Rich Krett", "comment_text": "We leave our passports in the hotel safe everywhere we go and have never had problems, including several trips to Italy. We carry our passport cards with us and I have pictures of our passport on my phone. The picture is all we needed to show at the colosseum."}, {"username": "D Rochelle Milton", "comment_text": "I don’t carry my passport, it’s left in the safe but I walk about with my passport card/ id."}, {"username": "Andrew Scivoli", "comment_text": "U have to show them when u check in your hotel. Other then that u don’t need them."}, {"username": "Gabriella Villasenor", "comment_text": "Carried a copy and locked original in our suitcase - 3 weeks there and nobody asked to see passports."}, {"username": "Stephanie Garofalo", "comment_text": "Take photos of your documents and have them on your phone."}, {"username": "Hookie Stephanie Trotter Walker", "comment_text": "Always left them in the hotel safe. Never a problem. Never asked for during activities."}, {"username": "Melanie Matthews Stuprich", "comment_text": "Honestly I’ve lived in Europe for many years off and on and never once have I taken my passport with me when doing touristy stuff or even out and about day to day. Also I’ve never used the room safe either (if provided but we do mostly Airbnb) If I’m in a hotel I just put it in my luggage and don’t stress same with Airbnb. If someone is going to steal something out of the room, it’s not going to be our passports most likely. And I would hate to lose it while out and about. But I know official policy is keep your documentation on you at all times. But I’ve never ever had a police officer ask for it while being a tourist though in other posts I’ve seen people say they had it happen. 🤷🏽‍♀️ I’d rather it be safe and explain to a police officer that it’s in my room and maybe they accompany me there vs the chance of it being lost or stolen in a bag while I’m out."}, {"username": "Kim Butler Oam", "comment_text": "I don’t carry my passport but I do carry a laminated copy. I also alarm my room with a portable alarm and another alarm goes wherever I have my passport. Staff are told they can’t enter my room unless I’m there.works well for me 😊"}, {"username": "Marilyn Kedves", "comment_text": "We kept ours in hotel safe."}, {"username": "Barbara Fucci", "comment_text": "We have been to Italy 🇮🇹 6 times & always had our passports taken when we checked into each hotel & Villa in Venice, Tuscany, Sorrento & Rome we had copies of our passports on us at all times we just assumed that’s how it was done because we only got them back when we checked out🤷‍♀️is it different now our last trip was in May of 2019"}, {"username": "Lauren Ako", "comment_text": "i kept my passport in the hotel safes (4 hotels). I was in an ambulance because i fell and the first thing they ask you for is your passport! I had a picture on my phone. Was ok with that.. So definitely I think the safes are fine. We went on a boat to Capri and didn't bring it."}, {"username": "Maria LoSurdo", "comment_text": "I have never carried my passport with me and haven’t needed it!"}, {"username": "Dina Garrett", "comment_text": "Linda Williams, BillandAngala Verley, Julie Franco Mellow"}, {"username": "Brian Osman", "comment_text": "Never carried mine left it in my room"}, {"username": "Jeff McLellan", "comment_text": "Sorry are worried if someone on the boat you are on would take your passports?"}, {"username": "Sonia Scotto Lubrano", "comment_text": "I bring this when I travel and then I attach it to something in the closet where it can be hid."}, {"username": "Lori Sammons", "comment_text": "Been to Italy 4x and here now in Rome so far, copy of the passport are ok and yes, we left our passports in the suitcase hidden and lock, so far, so good"}, {"username": "Paula Brink", "comment_text": "I always leave mine in the safe in the room- multiple trips, never an issue."}, {"username": "Ashley Morris Podraza", "comment_text": "We just left Positano today. I took pictures of the passports and had my phone in a waterproof bag around my neck. We left passports hidden in our hotel. We did not get asked to see passports."}, {"username": "Oldriska Balouskova", "comment_text": "If someone breaks into a hotel safe, they will not care about your passports- to steal a passport is a liability- it’s evidence - it’s best to steal cash - hard to trace"}, {"username": "Skye Birch", "comment_text": "never take mine out, got more chance losing it. put it in the safe or in safe place and enjoy your trip xx"}, {"username": "Renae Larcus", "comment_text": "The never ending conundrum. I guess it’s recommended you carry your passports everywhere. We have been to Italy many times and have never been asked to see our passports. We have pics of them on our phone and carry a paper copy."}, {"username": "Michelle Del Rosario-Brown", "comment_text": "I guess i need to stop listening to the horror stories and trust our safety precautions."}, {"username": "Alicia Cox", "comment_text": "I don’t carry my passport - I leave it in hotel & carry a copy plus picture on my phone. I’ve NEVER been asked except at check in & been to Italy 3 times plus other countries."}, {"username": "Tara McCloud Odebrecht", "comment_text": "We always leave them in the hotel safe. More risky to have them with you. They could be lost or stolen, then you are stuck.\n\nAlso, your drivers license is sufficient identification."}, {"username": "Robin Darmstadt Mancil", "comment_text": "My passport’s stayed in our backpack with a suitcase combo lock the entire time I was in Italy. The backpack was with us wherever we went."}, {"username": "Karen Ries", "comment_text": "Never take my passport out of the hotel."}, {"username": "David King", "comment_text": "We carry our passports EVERYWHERE with us.\nWhy? Because in the event of any kind of natural disaster, earthquake, accident, or other crisis, having your passport with you is absolutely key."}, {"username": "Sharon Milligan Martin", "comment_text": "Take a few photos of passport info and carry with yo"}, {"username": "Ron O'Brien", "comment_text": "Leave them in the hotel safe"}, {"username": "Jacqueline Corry Cicione", "comment_text": "We didn’t take them anywhere. We had a color photocopy and a photo on the phone. They were required at the coliseum, for underground tour and they were fine with photo on phone. We just got back, we’re not asked anywhere."}, {"username": "Lynn Crane", "comment_text": "We brought a chair safe with is. Worked a treat. Let me check for the link..."}, {"username": "Anita Clayton", "comment_text": "25 years of travelling in Italy, 4 times this year and never been asked to show our passport. Ours stay in the safe."}, {"username": "Michelle Murphy Margolati", "comment_text": "Always take copies of passport and Driver's license, plus photos on your phone. Double protection. I have never carried a passport with me unless traveling to New location to stay.\nHowever, I have lost a credit card while in Italy. So be sure to have a back up card."}, {"username": "Patricia Ricci", "comment_text": "Take a photo copy around with you."}, {"username": "Deirdre McMillen", "comment_text": "Just back.from Positano Sorrento Amalfi left our passports in hotel safe all the time"}, {"username": "Renee Rundle Stoneham", "comment_text": "Leave it locked in hotel. 30+ Years if living and traveling abroad. Only time I carry it is travel days.\n\nNowadays with cell phones it’s easy to carry a photo of it. Include the visa stamp if you got one."}, {"username": "Jenny Payne", "comment_text": "Lock valuables in case with a zip tag that has a code on ,that way you know if it has even opened🌻"}]}, {"id": "2203869120012166", "text": "Which is the best place to stay in milan ? Within city center or outskirts of city center ?", "link": "facebook.com/groups/1373361046396315/permalink/2203869120012166/", "likes": 0, "comments": [{"username": "Robin Darmstadt Mancil", "comment_text": "We stayed in the outskirts (near the soccer arena) but had to find a 3 bedroom VRBO. The good news is the metro is awesome in Milan , easy to use, clean and you can get anywhere!"}, {"username": "Miyuki Kanno Paul", "comment_text": "We usually stay one night, so it’s convenient by staying near Milano Centrale"}, {"username": "Annalisa Croci", "comment_text": "Please avoid Milano centrale area, it is one of the worst spots in the city, high risk of crime/\nrobberies. Moscova area, Brera, porta Nuova are all better areas."}, {"username": "Virgz Van Møøre", "comment_text": "Center"}, {"username": "Wilki KJ", "comment_text": "Milan is a city, its no more dangerous than any other, no more chance of pickpockets than any other city. Just be careful like you would anywhere. Lots of good hotels around the train station, the city centre and outwards. It honestly depends on what you want or need and your plans. The metro system is easy to use, as are the city trams, tickets can be bout at stations where you see a T(Tabaccheria) or newsstands."}]}, {"id": "2203870430012035", "text": "I know that a lot of people fly in and then rent a car. If you haven't experienced the high-speed trains of Europe you should try it. These aren't the trains of North America and Italy does it best. This wasआणखी our train from Paris to Milan on Frecciarossa. On the flats between the border and Milan it hit 295 Km/h. My husband was like a kid at a carnival and was hoping it would hit 300 ;) Since that was a long travel day (changed in Milan for Florence) we went First Class and it was more like a tour. We had roomy, comfortable seats, big windows, espresso and pastries. The scenery was varied and spectacular, ranging from the flat agricultural land of France, to terraced vineyards, to snow-capped mountains (and of course tunnels). It was the best travel day EVER.", "link": "facebook.com/groups/1373361046396315/permalink/2203870430012035/", "likes": 5916, "comments": [{"username": "Jennifer Aguilar", "comment_text": "Is it a lot more expensive for first class? I think the regular ticket priced tickets are very affordable"}, {"username": "Oriella Rigoni", "comment_text": "Many years ago I did Venice Paris overnight and it was very comfortable arriving in Paris early morning ready to hit the city and explore its many beautiful sights."}, {"username": "Kat Morse", "comment_text": "We stayed in Milan and used Frecciarosa for day trips to Venice, Florence and Rome. It was amazing. There is a hotel across from the Milan train station that was great, Excelsior Hotel Gallia, a Luxury Collection Hotel, Milan. Highly recommend Italian train travel."}, {"username": "Terry N Susan Brimmer", "comment_text": "I love the trains in Europe. Have done the Chunnel in both directions as well as Paris to Nice and vice versa on the TGV. Lots of other train travel as well. So wish we had something comparable in the US."}, {"username": "Sue Stryker", "comment_text": "We have. They are wonderful"}, {"username": "Rodney Proctor", "comment_text": "Only way to travel Europe. Get a Eurail pass!"}, {"username": "Enolita Castillo", "comment_text": "I love travel on European trains."}, {"username": "Corinna Neve", "comment_text": "The Italians do everything in style! The Frecciarossa is fantastic!"}, {"username": "Neil Ritchie", "comment_text": "Always liked the seating configuration of the Italian trains better than any other trains in Europe. Always had a beautiful vista with the panoramic windows, no blockages from pillars, and space between the back to back seats for small luggage."}, {"username": "Isa GorrEq", "comment_text": "What are you talking about? High speed trains in France routinely go 350 km/hour."}, {"username": "Chris Mooney", "comment_text": "Sighhhhh"}, {"username": "Simon Hicks", "comment_text": "Wendy Stonehouse I’d be pretty excited to hit 300k while sitting back relaxing with a beer 🍻 🚂"}, {"username": "Iram Malik", "comment_text": "We Interrailed through Europe with our three older children last summer and loved the adventure. Do check out the Bernina Express and explore taking a day trip to Lake Como – both accessible from Milan."}, {"username": "Janet Haase", "comment_text": "Japan has brilliant trains now they are the best!"}, {"username": "Carole Sewell", "comment_text": "We travelled on this exact type of train from Florence to Milan and return the same day. It was a fantastic experience and it did reach 300km/hr but was very smooth and quiet. Very different from rail travel in the UK."}, {"username": "Frankie Sullivan", "comment_text": "Yes republicans are the reason trains in North America are 100 years behind!"}, {"username": "Lisa Mcmeekin", "comment_text": "Katie Mcmeekin"}, {"username": "Angeliki Spiliopoulou", "comment_text": "Vangelis Salachas να το παρουμε"}, {"username": "Gerry Thompson", "comment_text": "We were on one of those trains when it went over 300km/hr. However great Italy’s high speed trains are the « normal » ones are not. Come to Switzerland and try our transport system - trains, buses, lake boats all on an integrated timetable and one ticket with get you from A to B even if you"}, {"username": "Debbie McCrea", "comment_text": "Beverly McCrea"}, {"username": "Ruben Espinosa", "comment_text": "Very nice 👍"}, {"username": "Bernadette Staunton", "comment_text": "Patricia Lyons"}, {"username": "James Morson", "comment_text": "Went on one of these trains from Rome to Florence amazing train 🚂 🇮🇹"}, {"username": "Helen Stokes", "comment_text": "Did you book your tickets through a app or just googled thanks"}, {"username": "Robert Knowles", "comment_text": "Indeed rail travel in Europe is quite the way\nA few years ago, We went Venice / Rome. Remarkable"}, {"username": "Giny Jonkeren", "comment_text": "And it doesn,t bring you in the countryside"}, {"username": "Natasha Murphy", "comment_text": "My husband and I did first class from Paris Tanis last summer, and it was awesome! Before we boarded the train in Paris, we went to a cheese shop and picked up a few things. We told them we were traveling, so they wrapped it accordingly. Picked up crackers and jam at a market too. Snacked on this on the train, and in the hotel the next few days in Nice. It was so much fun!"}, {"username": "Danielle S. Pasquale", "comment_text": "Agree!!! 1st class on the frecciarosso! 👌🏽"}, {"username": "Vai Anna", "comment_text": "Je l'ai essayé de rome à naples . Il est terrible !!"}, {"username": "Vai Anna", "comment_text": "Je l'ai essayé de rome à naples . Il est terrible !!"}, {"username": "Billie Condry Morgan Roussel", "comment_text": "Fro"}, {"username": "Christine Keegan Kearse", "comment_text": "The way to go in Europe!!"}, {"username": "Billie Condry Morgan Roussel", "comment_text": "My experience was super 🇮🇹"}, {"username": "Patrick Lang", "comment_text": "They’re great. Unless they’re late and you miss your connection. Then it really giant matter how far they go. We crawled the last 1/2 km into Termini station, arrived 20 minutes late, and missed our connection to Assisi, which only has a few trains going to it, so we were stuck for 2 hours waiting for the next one."}, {"username": "Eric Rodriguez", "comment_text": "Italian trains are marvelous!"}, {"username": "Kathy Udden O'Connor", "comment_text": "Our retirement dream is to live a year in barcelona and take weekly train trips to Europe!"}, {"username": "Claire Smith", "comment_text": "Following this post, some fantastic suggestions xx"}, {"username": "Barbara Moore", "comment_text": "Those trains are great! We do both trains and cars. We enjoy touring the countryside, stopping in little towns, etc.\nBut trains for city to city are great!"}, {"username": "Anton King", "comment_text": "Rome to Naples. Trains are brilliant."}, {"username": "Debbie Esparza Jacob", "comment_text": "This is all we do!! No cars trains, buses and ferries!"}, {"username": "Lorna Irish", "comment_text": "Sinead Elizabeth"}, {"username": "Ginny Buchan", "comment_text": "It's wonderful. We really like a Frecciarossa journey. xx"}, {"username": "Jayne Harrison Webster", "comment_text": "You are so right ! I travelled from Bologna to Florence rtn .. 2 wks ago. These trains are fast very clean & put our rail system in the UK to shame.\nBut that is of course because are networks are privatised so profits go to shareholders not into the system 🙄 I give up don’t get me started please."}, {"username": "Adrienne Gardner", "comment_text": "Thank you for sharing! I’ve bought first class for Rome to Florence in September."}, {"username": "Diane Viau", "comment_text": "We traveled from Amsterdam to London on the train. My only worry was getting on the train with suitcases. I broke my wrist tripping in the Metro Tracks and had to haul things up with one hand. People were kind and helpful. Next time pack lighter! No need for heavy sweaters. They have stores in Europe! Lol"}, {"username": "Aleesha Hussain", "comment_text": "Mehak Afroz"}, {"username": "Patti Ellico Christopherson", "comment_text": "Sounds awesome!!"}, {"username": "Wendy Stonehouse", "comment_text": "Simon Hicks Ben"}, {"username": "Amber Marie Estenson", "comment_text": "I choose trains as often as it’s economically possible in Europe!"}, {"username": "Joanne Lynn Ledoux", "comment_text": "The trains in Italy are the best.We just went to Italy and to get to our different destinations,we\nalways took the train.\nStress free and just amazing.\n\nWho wants to drive in Italy with their crazy driving anyways....🤣🤣🤣"}, {"username": "Doreen Wegmueller", "comment_text": "How long does it take from Paris to Milan?"}, {"username": "Pegi Fuller", "comment_text": "We took a day trip from Florence to Venice via Bologna and back. Great service! The station in both cities was easily accessed"}, {"username": "Claire Ryan", "comment_text": "Drew Ryan 😉"}, {"username": "JoJo Riz", "comment_text": "What is the difference in price to first class?"}, {"username": "Luana Nichifor", "comment_text": "Trying to book Rome to Palermo in December but it looks like they have not opened up the tickets. Is there any other way to book 4 months in advance?"}, {"username": "Anita Doonan Sobotka", "comment_text": "Devon Sobotka Noelle Sobotka"}, {"username": "Sam Simons", "comment_text": "Rome to Naples ,this past May,at 297 Kph......"}, {"username": "Liz Jecks", "comment_text": "Brian ! Maybe …"}, {"username": "Kevin Morrow Jr.", "comment_text": "These are great til something in the track between venice and Milan breaks and you're stuck on the train waiting for 3 hours 🤣"}, {"username": "Carolyn Johnson", "comment_text": "Sounds more fun and relaxing than driving some of their roads!"}, {"username": "Deborah Hill", "comment_text": "Fantastic trains. First class was amazing with comfortable seats, great meal/drink service and clean. I would opt for high speed train service in the US anytime over a plane."}, {"username": "Sarah Edgeler", "comment_text": "Karen Nuciforo"}, {"username": "Mary Gallagher Sullivan", "comment_text": "Just watch your wallet. My husband's was stolen"}, {"username": "Donna Lowe", "comment_text": "How much was your seat in first class in American dollars? Did you buy your ticket in Europe or America?"}, {"username": "Debi McGrath", "comment_text": "I love train travel in Europe, I wish we had them in Canada. Will be in Italy for 6 weeks this fall, car rental for 3 and trains for 3"}, {"username": "Susan Mahoney", "comment_text": "When they are not in strike or so overcrowded you can't breathe 😱"}, {"username": "Caterina Frew", "comment_text": "Frecciarossa is a great service, however in peak times, the price of a train ticket is comparable to a flight fare. Pays to research"}, {"username": "Toni Cellini Kerchersky", "comment_text": "So agree! Fabulous trip!"}, {"username": "Linda Murphy Harrigan", "comment_text": "We are taking the fast train to Venice in Sept!"}, {"username": "Gary-Carol Miller", "comment_text": "We rode the high-speed train in Shanghai!! Great experience👍"}, {"username": "Lisa Findley", "comment_text": "Try Villanueva in Italy to Cannes in France it’s stunning."}, {"username": "Vanessa Cardinale", "comment_text": "Rick ❤️"}, {"username": "Emma Bea Hobbs Stallings", "comment_text": "Absolutely looooove riding the trains in Europe!!!!"}, {"username": "Kim Criswell", "comment_text": "I love thé trains in Europe!"}, {"username": "Bridge Hughes", "comment_text": "I couldn’t agree more. I just finished a one month trip, all trains! Loved (most of) if!"}, {"username": "Rachel Wilkinson", "comment_text": "Paul King"}, {"username": "Dakota Duffina", "comment_text": "Just got back. Loved it! Very quick and super easy to figure it out"}, {"username": "Irene Baxter", "comment_text": "Thank you for sharing!"}, {"username": "Danny Rossi", "comment_text": "Italian trains are fantastic very good value"}, {"username": "Jennifer Zier", "comment_text": "Can you get tickets the day of or should you book in advance?"}, {"username": "Kathy Griffin", "comment_text": "Elva Merriam Shaughnessy what a trip we had on this train! 298km/hr.\nSchweet! Then that unexpected night in Turin, great travels!"}, {"username": "Lisa Schneider-Wettstein", "comment_text": "We took first class train from Germany to Netherlands and it was a fabulous way to travel! Better than flying. Roomy, clean, easy to figure out."}, {"username": "Sandra Bourg Hebert", "comment_text": "We did that years ago. We went from Rome to Florence and back on one day. The next day we went from Rome to Venice and back. Wonderful trip. You didn’t even feel that you were going that fast. There were signs telling you how fast the train was moving throughout the trip. The trains were very clean and safe feeling."}, {"username": "Anna Dawson", "comment_text": "Fantastic experience, we hit 299! So efficient, certainly worth doing."}, {"username": "Louise Finnegan", "comment_text": "Stephen Finnegan"}, {"username": "Nguyen Loan", "comment_text": "Is that make you feel dizzy since it moves so fast?"}, {"username": "Pat Kohlschreiber", "comment_text": "The trains of Europe are wonderful. I spent 35 days there riding the trains to all the countries we visited. First class is wonderful. I wish the United States had trains like that."}, {"username": "Rachel Henstock", "comment_text": "Paul Henstock"}, {"username": "Rubi Escamilla", "comment_text": "Patricia Martinez"}, {"username": "Dan Cauley", "comment_text": "I did Venice, Milan to Rome. The best way to travel"}, {"username": "Louis Short", "comment_text": "I wish the US would have this. It is miserable here."}, {"username": "Eddie Lang", "comment_text": "The problem with these wonderful trains is entirely worthless baggage handling. After a few trips trying to fend off invasive station gypsies, struggling to lift them onto the train amidst crowds of passengers and then having to clutch large rolling luggage which could only be kept in the aisles we gave up in despair. And that doesn’t even account for the many non-functioning\nstation elevators and escalators. If only…"}, {"username": "Vicki Kreymborg Sweeney", "comment_text": "Our train between Milan and Tome DID hit 300 and we took a picture. We too went first class and loved it. I’d recommend training highly."}, {"username": "Jill Cannings", "comment_text": "Jeff Cannings x"}, {"username": "Cristina Zara", "comment_text": "I love traveling on the Frecciarossa!"}, {"username": "Lynn Hughes", "comment_text": "Cerys Davies"}, {"username": "Giuliano D'Aprano", "comment_text": "We did a round trip Milan to Rome. We travelled buisness class.Beautiful"}, {"username": "Misty Williams Corbett", "comment_text": "Toi Doden"}, {"username": "Gordon Stewart", "comment_text": "Mary Baxter 🚂🇫🇷🇮🇹"}, {"username": "Jo Sansom", "comment_text": "We did this from Alicante to Madrid ! Honestly one of the best experiences . Great food , great service but most importantly the space was delightful ! We were also tickled by the speed !"}, {"username": "Marsha Frank Rosenthal", "comment_text": "I saw this. Fantastic!"}, {"username": "Judy Smaguler", "comment_text": "They are so clean and fast. Just be sure you have your ticket in hand when you board"}, {"username": "David Rees", "comment_text": "Took the fast train from florence to Venice fantastic train and so quick we clocked 155mph between florence and bologna"}, {"username": "Jess Ramlal", "comment_text": "A lovely post. I want that experience! Thanks for sharing"}, {"username": "Denise Cricksman", "comment_text": "Went everywhere in Italy on the trains!! Wonderful!!!"}, {"username": "Ellen Sosko-Chialastri", "comment_text": "Took the train from Rome to Florence. I still have the app on my phone and get the occasional update. No other way to go between cities in Italy!"}, {"username": "Tahia Carim", "comment_text": "Thank you for sharing!!!"}, {"username": "Tim Chang", "comment_text": "The rest of the world are quite MORE developed with their infrastructure.\nUS with its car culture -- so much waste of time and energy driving 300 miles, when they can sit and relax..."}, {"username": "Kevin James Cox", "comment_text": "I made the trip from Paris to Milan on an overnight sleeper. My companions were a French man, his wife and her sister. The women spoke no English, the man a bit of English and a few words of Italian. It was a great trip! We arrived in Milan about 6:30 & the man pantomime a sleeping posture with snoring & a big smile 😀"}, {"username": "Diane Mortellite-Saaybe", "comment_text": "Magnificent"}, {"username": "Helen Diane", "comment_text": "Kevin Graham"}, {"username": "Nat Macheda", "comment_text": "One of our trains got up to 325 km/hr. Pretty cool."}, {"username": "Kathleen Bergeron", "comment_text": "We did Milan to Florence years ago!!!"}, {"username": "Hannah Eisenberg", "comment_text": "I LOVE going by train - writing this as we are going back to Florence from Milan on the freccia rossa."}, {"username": "Lauren Neely", "comment_text": "Agreed! 💯"}, {"username": "Renee Newman", "comment_text": "AGREE! We so wish we had this ability at home."}, {"username": "Joan Seaman", "comment_text": "Trains of Europe are amazing"}, {"username": "Sandra Johnson", "comment_text": "Absolutely amazing"}, {"username": "Jane Duffy", "comment_text": "You need to go on Eurostar from London to Paris it does hit 300km"}, {"username": "Susan Nedo", "comment_text": "I'm going on a high speed train in September from London to Paris. I am nervous. Does it feel like you are going that fast?"}]}, {"id": "2203876480011430", "text": "Folks, are there luggage lockers in Rome & Naples train stations? I am asking this coz we will be checking out of the hotel early in Naples to do a full day Pompeii tour and heading to Rome that evening...meanwhile wondering what to do with luggage...thanks for all your help!", "link": "facebook.com/groups/1373361046396315/permalink/2203876480011430/", "likes": 0, "comments": [{"username": "Bev Madill", "comment_text": "Try usebounce.com."}, {"username": "Brenno Bianchi", "comment_text": "Both stations have only one luggage storage company inside, under the name Kibag or Kipoint. It's a state run company owned by the national mail service."}]}, {"id": "2203877240011354", "text": "A little freaked out about changing planes on our trip and our luggage making it with us. Has anyone flown from Miami to PA to Venice with a 2 hr and 44 minutes layover and not any problems changing planes and luggage making to Venice with you?\nThen from Palermo to Istanbul to Miami with a 1 hr 10 min layover same thing?", "link": "facebook.com/groups/1373361046396315/permalink/2203877240011354/", "likes": 2, "comments": [{"username": "Tiffiney Q. Irons", "comment_text": "I just went and had 6 flights with many layovers and 20 people and no lost luggage . However, your chances of a cancelled or delayed flight is high, strikes and shortages are a huge factor, and we got stuck two days in Canada due to a cancelled flight so be flexible"}, {"username": "Gregory Smith", "comment_text": "Even AA probably can’t get the first leg wrong. The second leg…not sure I’d sweat that one given that if your bags are delayed you’re on your way home. In any case I’d always have a carry on at least for the outbound in case bad luck happens."}, {"username": "Jessica Stewart", "comment_text": "Why not fly straight from Miami to Rome?"}, {"username": "Irene Oda", "comment_text": "Are you flying with the same airline?"}, {"username": "Don Bentivoglio", "comment_text": "Depends on where the layovers are. On the positive side, millions of pieces of luggage reach their destination every day without a hitch. We all tend to focus on the bad stories. In 99%+ of cases delayed luggage will catch up to you."}, {"username": "Starla Dawn", "comment_text": "Do carry on problem solved. My 14 year old daughter and I did and it was plenty of room turned out just fine."}, {"username": "Pam Simpson Wilson", "comment_text": "Last wk flew Jacksonville-Ch\narlotte-PA-Veni\nce no issues. We did have air tags in bags just in case"}, {"username": "Alexandra A Welker", "comment_text": "Is your connecting flight under one ticket? It should be fine."}, {"username": "Rhona OConnor", "comment_text": "Stop stressing..... You can't control it. All going well you will be fine. If you don't make the flight it will get sorted out. Just look forward to your holiday!!"}, {"username": "Bernadette Breen-Shinner", "comment_text": "Travel is always a gamble. Pack what you can afford to lose Oprah says.\nThere is magic at airports. Bags find you usually ."}, {"username": "Heidi Littman Meiers", "comment_text": "You're connecting in PHL .... time wise for a connection you should be fine as AA will likely land from MiA and take off for Venice in terminal A ... as for a delay due to weather... we're kind of known for that , luggage should be fine"}, {"username": "Brooke Williams", "comment_text": "We just got back this week! We went from OH to ATL then to Paris! No issues. On the way home we went from Italy to Amsterdam to ATL and OH again! No issues either 🙂 we flew delta"}]}, {"id": "2203880243344387", "text": "Do you need a PIN number with your credit card? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2203880243344387/", "likes": 4, "comments": [{"username": "Dafne Vassetti", "comment_text": "Yes"}, {"username": "Enrico Lecce", "comment_text": "No"}, {"username": "Sandi Van", "comment_text": "No…. Just use your phone to tap easier"}, {"username": "Larry Dash", "comment_text": "No"}, {"username": "Ken Lerch", "comment_text": "Depends. Not for purchases. But if you use it to get cash advances at a bancomat (a very bad idea) you will need one."}, {"username": "Cindy Gallen Barton", "comment_text": "Needed sometimes at ticket kiosks"}, {"username": "Carole Tarlap", "comment_text": "NO"}, {"username": "Tracy Trentham McCauslin", "comment_text": "Thank you everyone"}, {"username": "Victoria Moorhead Murrow", "comment_text": "No"}, {"username": "Jennifer Stanek", "comment_text": "Yes to buy train tickets in the rome airport for the Leonardo Express"}, {"username": "Shawn Galbraith", "comment_text": "You can obtain the pin from you cc company\nI have never been asked for it in Europe but I was asked for it in Canada."}, {"username": "Viviann Cardenas", "comment_text": "Yes"}, {"username": "Daisy Yoo", "comment_text": "No, u can put a pin to prevent cash advance"}, {"username": "Margaret Temple", "comment_text": "I’m traveling with Globus tours soon and they said PIN numbers are now generally required when we make credit card purchases for security reasons."}, {"username": "Terry Pisano", "comment_text": "Not for making a purchase, but yes for getting cash at ATM."}, {"username": "Shelley Frise", "comment_text": "Just make sure you only have a 4 digit pin."}]}, {"id": "2203892290009849", "text": "I have purchased dated/times tickets directly with the museum/Duomo for our desired Florence and Venice attractions. Does this allow me to \"skip the line\" and enter at that time?\n\nThe Skip the line tours for the same attractions through tour companies are double/triple what we've paid and I just don't know if that means my direct tickets have us still standing in the same lines to get in. I would think because it's timed I would be able to just walk in at that time but as we get closer to the trip I'm second guessing myself.", "link": "facebook.com/groups/1373361046396315/permalink/2203892290009849/", "likes": 1, "comments": [{"username": "Jeff McLellan", "comment_text": "For Duomo just be there 15 minutes early and have no larger bags or you will need to go and check them."}]}, {"id": "2203897520009326", "text": "Up early today. Train from Florence to Sorrento with a stop for lunch. Then on to our hotel with a view.", "link": "facebook.com/groups/1373361046396315/permalink/2203897520009326/", "likes": 18, "comments": [{"username": "Geoff Plus Jann Mains", "comment_text": "We are from New Zealand\nWe loved it in Sorrento\n\nHave an awsome time\nJann"}]}, {"id": "2203897703342641", "text": "Lake Orta, Italy", "link": "facebook.com/groups/1373361046396315/permalink/2203897703342641/", "likes": 1079, "comments": [{"username": "Joyce Vazzano", "comment_text": "Joyce Vazzano"}, {"username": "Simone Nicole", "comment_text": "Ric Semreh"}, {"username": "Yony Moscol Claeyssen", "comment_text": "Italia tiene bellísimos paisajes 🇮🇹"}, {"username": "Shannon Cullen", "comment_text": "Lisa Lottinville"}, {"username": "Kim Mai Yuen", "comment_text": "How great and beautiful nice view. Been always I'm thinking to visit in Europe , if I have a chance"}, {"username": "Luca Lookone Ferrentino", "comment_text": "Interesting fact: in Orta San Giulio, one of the villages surrounding the lake, there is \"Villa Crespi\" a luxury hotel whose restaurant is a three Michelin stars, owned by Antonino Cannavacciuolo,\none of the most famous Italian chefs. He's a real celebrity chef."}, {"username": "Maria Grazia Rizza Costanzo", "comment_text": "Dove si trova?"}, {"username": "Peter Laity", "comment_text": "Ann Laity Carly Mcmullan Meredith Wilson"}, {"username": "Bernadette Sarmiento", "comment_text": "Spectacular!"}, {"username": "Leah Louise Reynolds", "comment_text": "Absolutely gorgeous. Can’t wait..we will be there Thursday.🤗"}, {"username": "Lars Ole Bjergvang Bødker", "comment_text": "Helene Bjergvang Bødker 😍😍😍"}, {"username": "Benita Hauskins", "comment_text": "Benita Hauskins"}, {"username": "Davi Silva Santos", "comment_text": "THESE photos are more material for my law of attraction 2023/2024 Me traveling with the person I love around these places...."}, {"username": "Abby Martin", "comment_text": "Claudio Ciardi, I literally just decided to NOT include Orta in my upcoming trip. But… these pics are gorgeous! What do you like to do there?"}, {"username": "Chiara Normanno", "comment_text": "Such a beautiful and underrated region ♥️ but maybe it's better this way"}, {"username": "Stacey Charlton", "comment_text": "Lee Charlton"}, {"username": "Marina Zanelli", "comment_text": "Beautiful...wil\nl be there in mid September. Tku for sharing...these\nmake me even more excited."}, {"username": "Tammy Kitchen", "comment_text": "Beautiful"}, {"username": "Anders Haines", "comment_text": "Thank you for sharing this!"}, {"username": "Kathryn Metcalf", "comment_text": "Joe Christina Boggs"}, {"username": "Ann Gaffey", "comment_text": "￼Beautiful 🌺🇮🇹"}, {"username": "Sherry Coleman Taylor", "comment_text": "Sherry Coleman Taylor"}, {"username": "Bob Fletcher", "comment_text": "Been there a couple of times - well worth going, some of the views are stunning."}, {"username": "Berta-Maria Moldoveanu", "comment_text": "Moldoveanu Marius-Goga"}, {"username": "Joanne Hales", "comment_text": "Sara Challinor"}, {"username": "Md Razib Hossain", "comment_text": "Absolutely gorgeous"}, {"username": "Lidia Sz", "comment_text": "Gorgeous ❤️❤️"}, {"username": "Candace Skelly Crouch", "comment_text": "Because!"}, {"username": "Claire Short", "comment_text": "Gorgeous… Italy is next on my bucket list 🫶🏼"}, {"username": "Kendra Palmer", "comment_text": "Andrew Palmer"}, {"username": "Sarah Prior", "comment_text": "Chris Ascroft"}, {"username": "Alina Rojas", "comment_text": "Alina Rojas"}, {"username": "Vanessa Bryant", "comment_text": "Vanessa Bryant"}, {"username": "Ruth Akutu Maccarthy", "comment_text": "I love it 😍"}, {"username": "Cynthia Tarantino", "comment_text": "How gorgeous!"}, {"username": "Cristian Jimenez", "comment_text": "Karla Pasamos por ahi, de ida y vuelta cuando fuimos a St. Moritz 🤩"}, {"username": "Silvana Villella", "comment_text": "Beautiful. Was there in May."}, {"username": "Renae Larcus", "comment_text": "Not familiar withLake Orta. Where???"}, {"username": "Sylvia Agresta", "comment_text": "Love Italy."}, {"username": "Nana Esther Bertolino", "comment_text": "Gorgeous ❤️❤️ Thank you for sharing"}, {"username": "Maria Del Greco Picciano", "comment_text": "Beautiful"}, {"username": "Charlotte Ingram", "comment_text": "Beautiful"}, {"username": "Di Howard", "comment_text": "Gorgeous photos! Curious as to what kind of camera you are using. You’ve framed these photos perfectly!"}, {"username": "Jen Lundy", "comment_text": "Wow! Stunning photography"}, {"username": "Magda Cardoso Nobre Semedo", "comment_text": "I love it 😍"}]}, {"id": "2203897986675946", "text": "Hotel Regina Sorrento. Room with a view. Beautiful.", "link": "facebook.com/groups/1373361046396315/permalink/2203897986675946/", "likes": 90, "comments": [{"username": "Melody McLean Norburn", "comment_text": "We’re staying there in September so we really appreciate the photos!"}, {"username": "Patty Barnes", "comment_text": "Breathtaking! I would never leave the room."}, {"username": "Theresa Sorrentino Pagan", "comment_text": "Staying there in sept.\nThanks for posting"}, {"username": "Carmela Di Benedetto", "comment_text": "Beautiful! Can't wait to return ❤️❤️❤️❤️"}, {"username": "Brittany Thompson Little", "comment_text": "Was this the only one with sea view?"}, {"username": "Kim Mai Yuen", "comment_text": "How beauty morning ! Can I know where is it located?"}, {"username": "Sandra Perales", "comment_text": "Amazing view!!"}, {"username": "Helen Ladkin", "comment_text": "Loved our stay here in 2014. Fabulous position and rooms at the front along with dining room on the top floor had spectacular views. Small pool and lemon trees for some shade. Our only issue was the function centre across the road played really loud music until very late on our first night. But more gains than pain!"}, {"username": "Vitya Volkov", "comment_text": "Wow, this is really, really beautiful.🥰"}, {"username": "Laura McLaughlin", "comment_text": "Craig Mclaughlin"}, {"username": "Debra Quinney", "comment_text": "That’s where we stayed lovely hotel"}]}, {"id": "2203911663341245", "text": "Hello everyone, my dad is looking for restaurants with good Rabbit/Coniglio. We will be visiting La Spezia, Cinque Terre, Naples, Capri and Rome. Thank you in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2203911663341245/", "likes": 2, "comments": [{"username": "Elena Innocenti", "comment_text": "It’s no easy find coniglio in the menu (and usually menu restaurant change seasonally).\nBut in Liguria (La Spezia) is a typical dish “coniglio alla ligure” and it’s more easy find it.\nAntica Osteria dei Camalli in La Spezia usually have."}, {"username": "Diana Occhipinti", "comment_text": "If you can make your way over to the island of ischia, rabbit is their specialty"}, {"username": "Alice Francesca", "comment_text": "Some regions are famous for their coniglio recipes.one is Liguria ."}, {"username": "Miyuki Kanno Paul", "comment_text": "When you are in Liguria(La Spezia and Cinque Terre), Coniglio alla Ligure can be found. You may need to reserve a head of time, so call ahead and ask. It’s too bad that Ischia, a neighboring island of Capri, is famous for Coniglio all’Ischitana"}, {"username": "John Bruckman", "comment_text": "In Capri go to Gelsomina, not “alla Ligure” but “alla Ischietana”"}]}, {"id": "2203918250007253", "text": "Does anyone have any tips, recommendations for Sardinia? Looking for relaxing beaches before a wedding in Rome!", "link": "facebook.com/groups/1373361046396315/permalink/2203918250007253/", "likes": 0, "comments": [{"username": "Alice Francesca", "comment_text": "Land in Olbia.rent a car from the airport.Drive North to the gulf of Marinella.Many hotels and apartment options on booking dot com.\nMany sandy beaches and turquoise waters! Try Spiaggia del Principe, Stintino,Cala Moresca, Liscia Ruja, Rena Bianca.\nWonderful aperitivo time up in the hills, San Pantaleo"}]}, {"id": "2203922356673509", "text": "I am looking at taking a ferry from Sorrento to Positano. Is there a particular website that is the best to use? Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2203922356673509/", "likes": 1, "comments": [{"username": "Chiara Normanno", "comment_text": "Nlg 's website which is the company running the service"}]}, {"id": "2203923033340108", "text": "AMALFI🩵", "link": "facebook.com/groups/1373361046396315/permalink/2203923033340108/", "likes": 4, "comments": []}, {"id": "2203924076673337", "text": "Hi all,\nSo I have just booked some bargain flights from uk to Milan for early October 🥳 we have 6 days and just trying to decide if it’s best to base whole time in Milan and travel on train to anywhere else we may go, although deciding where is another thing, maybe one of the lakes, Verona? Bologna? Or to travel about and experience night time inआणखी other locations 🤷‍♀️ we will be spending a few days exploring Milan too off course!\nexperienced at using train apps etc and would be up and out early for any potential day trips but any advice would be welcome 😊thanks", "link": "facebook.com/groups/1373361046396315/permalink/2203924076673337/", "likes": 5, "comments": [{"username": "Pietro Adami", "comment_text": "Both Verona and Bologna will be great destinations. Genova, also (nice drive to it too)."}, {"username": "Fetchin Gretchen", "comment_text": "Varenna is a good place to base or Lake Como after Milan."}, {"username": "Alice Francesca", "comment_text": "If you stay in Milan you can see Desenzano and Sirmione on Lake Garda and Verona by train easily"}, {"username": "Dave Conroy", "comment_text": "I would stay in one well connected Milan location with good local amenities to try, like airbnb near sites, supermarkets and restaurants and then train around. More relaxing and helps focus on activity not packing and moving."}, {"username": "Renae Larcus", "comment_text": "Bergamo is not far from Milan."}, {"username": "Chiara Normanno", "comment_text": "Take a look at Turin, great city"}]}, {"id": "2203925220006556", "text": "Has anyone been to Rapallo or Stresa? Things to see or restaurant recommendations appreciated. Thank you!!", "link": "facebook.com/groups/1373361046396315/permalink/2203925220006556/", "likes": 2, "comments": [{"username": "Colleen Carollo Oxsalida", "comment_text": "Stresa was the highlight of our recent trip. It’s beautiful. We did a tour of the Borromeo Islands and had lunch on Fisherman’s Island (Ristorante Casa Bello — upstairs patio with a gorgeous view). We also did a day trip to Lake Como. As far as a restaurant recommendation in Stresa — Il Pappagallo. It was so good we went back after our first meal there. You will need reservations. We also liked Grano Duro."}, {"username": "Chiara Normanno", "comment_text": "I am seconding Borromee Island suggestion, gorgeous scenery"}, {"username": "Rochelle Yngks", "comment_text": "I visited Lake Maggiore last Sept for a week, and made Stresa my home base. Lake Maggiore has a very good public bus system and ferries. I visited Baveno, Arona, Cannero, Cannobio, Lake Orta, Borromeo Islands and Hermitage of Santa Caterina."}]}, {"id": "2203940126671732", "text": "Is it worth driving from Florence to Pisa and then Lucca or should we take train?", "link": "facebook.com/groups/1373361046396315/permalink/2203940126671732/", "likes": 11, "comments": [{"username": "Theodore Meyer", "comment_text": "Definitely the train. Go to Lucca and forget Pisa. Other than the tower, duomo and baptistery there’s not much there. Most of Pisa was bombed during WW2"}, {"username": "Phyllis Waring", "comment_text": "Always take the train!! Very cheap and very very convenient!!"}, {"username": "Jeff Gentner EA", "comment_text": "Train. Driving and Parking are problems."}, {"username": "Lina Stump", "comment_text": "Take the train"}, {"username": "Nancy Kirby", "comment_text": "Skip Pisa, just Lucca"}, {"username": "Ted Koloski", "comment_text": "Definitely worth driving and go to Viareggio, found it by accident and was beautiful"}, {"username": "Scott Perry", "comment_text": "Train!"}, {"username": "Anne Ellis Teather", "comment_text": "I just returned from Italy and visited Pisa and Lucca. Honestly, don’t do Lucca. There is lots to see in Cathedral Square besides Leaning Tower. Also, take the train."}, {"username": "Seán Ó Confhaola", "comment_text": "I prefer Pisa to Lucca. Just saying!"}, {"username": "Lisa Abrams Argento", "comment_text": "Take the train."}, {"username": "Ken Diamond", "comment_text": "Drive"}, {"username": "Rodger Cravens", "comment_text": "Train, my god, what a wasted day of driving that would be."}, {"username": "Kevin Andrews", "comment_text": "Luca Is between Florence and Pisa. I would take the train and taxis. Driving especially in Florence is very hazardous. Many tourist trap cameras. Driving is restricted to residents only in many places in all 3 cities. I got a huge traffic fine 15 months after returning home."}, {"username": "Kevin Andrews", "comment_text": "Watch for bad things in Pisa. Stay away from beggars. Also carry wallet or bags that are small and secure. Scams and pick pockets everywhere. Still the tower and basilica are amazing."}, {"username": "Frank Hunt", "comment_text": "Train"}, {"username": "Lou DiStasi", "comment_text": "We just spent 5 days in Lucca and loved it. Pisa not so much. After the tower leave quick."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Look for a post of mine in this group about Pisa (written around the 12 July), it’s to enjoy the visit avoiding the tourist trap part of the city."}, {"username": "Pao Magnoler", "comment_text": "100% train."}, {"username": "Russell Weidner", "comment_text": "Train. No issues with parking"}, {"username": "Francine Greco Stahanczyk", "comment_text": "Train"}, {"username": "Felicia LoCascio Whitney", "comment_text": "Lucca yes. Pisa meh"}, {"username": "Suzanne Mills", "comment_text": "Train to Lucca and Siena and ditch Pisa"}, {"username": "Alice Francesca", "comment_text": "See Siena instead of Pisa."}, {"username": "Deacon Tom Lang", "comment_text": "TRAIN!"}, {"username": "Jill Moorcroft Penn", "comment_text": "Take the train. It’s very easy."}, {"username": "Alicia Cox", "comment_text": "Train unless ur gonna have a car. IF you do have a car, DO NOT even drive inside the wall in Lucca as you will get a ticket. You must park outside the wall. I speak from experience - drove in, saw the sign, immediately drove out (no parking), got a ticket in the mail 3 months later 😱🙄🤦🏻‍♀️"}, {"username": "Claudia Gonnelli", "comment_text": "Train"}, {"username": "Sharon Milligan Martin", "comment_text": "Train"}, {"username": "John Bruckman", "comment_text": "Drive!"}, {"username": "Ashi Saxena", "comment_text": "Thank you so much everyone for the help !❤️\nWe decided to take the train."}, {"username": "Maggie West Penix", "comment_text": "Train!!!"}, {"username": "Verena Lala", "comment_text": "Easy and better with car"}, {"username": "Rachael Richardson", "comment_text": "Train is quick and so cheap and easy - driving is horrendous"}, {"username": "Ken Lerch", "comment_text": "Trains to either Pisa or Lucca are direct and easy. Pisa's station is a 15-20 minute walk to the tower. Lucca's is across the street from the outside wall. Lucca has virtually no parking inside the walls and it's a waste of time to find it. There is no advantage to using cars in this situation for both destinations."}]}, {"id": "2203946623337749", "text": "I know we can't predict the weather in advance, but what is the weather normally like at Christmas time (End of December)?.. Is it flood season/rainy/or just cold/frosty but dry?...\n\nAlso, is it a busy time or is Venice seasonal? Are there Christmas Markets too?..\n\nThank you....\n\n*Sorry, I should've added, in Venice...", "link": "facebook.com/groups/1373361046396315/permalink/2203946623337749/", "likes": 2, "comments": [{"username": "Colleen Dawson", "comment_text": "Depends on where you are in Italy. We travel to the far north Trento and Bolzano and do get snow.Bolzano, Merano and Vipiteno have beautiful Christmas markets.We will be there this year, so hoping for snow."}, {"username": "Philip Curnow", "comment_text": "Venice is fantastic in Winter. But some months are wetter than most. The rain is usually autumn/early winter. Dry weather is very probable. But humidity is high of course. Less crowds (if any) but New Year could be packed around the Doge's Palace."}, {"username": "Jenny Payne", "comment_text": "Winter🌻"}, {"username": "Kristina Ruk", "comment_text": "It depends of the year.. we were twice in Venice end of December once it was arround +5C, other was +15C... venice ussually has floods in the beginning-mid of December, but who knows what the weather will be"}]}, {"id": "2203249523407459", "text": "Is it worth going to Naples", "link": "facebook.com/groups/1373361046396315/permalink/2203249523407459/", "likes": 96, "comments": [{"username": "Siobhain Welsh", "comment_text": "Exactly what we have been asking ourselves. Do we really want to go there with 3 kids after reading some of these posts? About 2 hrs ago I got sick of reading and just made the decision to book it all in.\n\nWe have travelled so many places with kids and we have always enjoyed the “real” side to places we visit and decided not to change the way we travel and where based on other peoples reviews.\n\nWe like real, gritty, local living and Naples seems to offer that in abundance. I’m f you don’t like it atleast you can say you’ve seen it and not regret it."}, {"username": "Beth Casey Murphy", "comment_text": "I liked Naples. The archeological museum has the treasures from Pompeii, Piazza del Plebiscito, Galleria Umberto I, thé street layout that hasn’t changed since Roman times, not to mention Mt Vesuvius in the background…. there are lots of worthwhile things to see."}, {"username": "Baba Aga", "comment_text": "I absolutely love Naples!"}, {"username": "Mone Nordahl", "comment_text": "Yes ☀️"}, {"username": "Roula Lolak", "comment_text": "Definitely"}, {"username": "Ronald Johnson", "comment_text": "Of course it is. Naples is fantastic"}, {"username": "Julie Kelly", "comment_text": "Naples is to Italy , what Glasgow is to Scotland. Not a tourist chocolate box city, a real living breathing beating heart of a place."}, {"username": "Jessica Thompson", "comment_text": "Beautiful"}, {"username": "Keith Crossley", "comment_text": "That depends."}, {"username": "MsChrista Fl", "comment_text": "Why wouldn’t it be?"}, {"username": "Nina La Pegna", "comment_text": "💯💯💯💯"}, {"username": "Toni Taylor", "comment_text": "Yes, a diamond in the rough."}, {"username": "Gigi Robinson", "comment_text": "Yes"}, {"username": "Candace Beutell Gardner", "comment_text": "Yes! And visit Pompei!"}, {"username": "Andrea M. Guidry", "comment_text": "We enjoyed old town"}, {"username": "Tony", "comment_text": "Yes 2 days"}, {"username": "Axelle Catherine", "comment_text": "Yes"}, {"username": "Vicky Papantoni", "comment_text": "Yes!!"}, {"username": "Lee Mckay", "comment_text": "Sure is."}, {"username": "Massimo Della Vita", "comment_text": "Good luck"}, {"username": "Nadine Sughayyar", "comment_text": "So much!!! Beautiful place!!"}, {"username": "Alessandra Imbriano Hagemann", "comment_text": "Yes"}, {"username": "Sheraleigh Sapphire Pope", "comment_text": "We went in May, best food we've ever had in Italy 🇮🇹 😋\n\nIt's certainly different there and not for the faint hearted (the driving is pure insanity) but well worth the experience in my opinion.\n\nWe have friends that live there so I think it really helped that we had locals as our personal tour guides 😊"}, {"username": "Kezia Zichichi", "comment_text": "What a stupid question."}, {"username": "Timothy Milos", "comment_text": "Strap in and go for the ride. Loud busy dirty crazy, it’s not there for you. Join in, ride the wave, and it’s spectacular."}, {"username": "Sandra Bongiovanni Memoli", "comment_text": "What is the difference between Naples and Rome? City wise. Is Rome more for tourists? ￼￼"}, {"username": "Bill Haenlein", "comment_text": "In the top 10 and number 1 for food!"}, {"username": "Pham Thu", "comment_text": "Yessss"}, {"username": "Suzi Hellmundt", "comment_text": "Yes!!"}, {"username": "Jacques Catherine", "comment_text": "Of course it is ! One of the most fascinating Italian Cities."}, {"username": "Sarah Urciuoli", "comment_text": "Yes"}, {"username": "Elizabeth Erickson", "comment_text": "I love Naples!! The Archeological Museum is worth a trip by itself! Do a food tour. It was a blast. Find one that includes a trip to where limoncello is made."}, {"username": "Susie CB", "comment_text": "Yes!"}, {"username": "Antoinette Fratangelo", "comment_text": "YES"}, {"username": "Jamie Favreau", "comment_text": "My first time in Italy was a week in Napoli for work. I fell in love with the city the first moment I got out of the airport. So much so that I started my two week vacation with my wife in Napoli so they can experience what I did. She loved it! So many little backstreets to get lost in with amazing people operating their businesses. Wonderful food and the best pizza you’ll have in Italy. The Duomo, the underground tours, Mt Vesuvius, quick trip to Pompeii and Herculaneum. But what I really enjoyed about Napoli is the beautiful chaos that a lively city offers and you will not find it anywhere else in Italy! So if you don’t go to Naples, did you really visit Italy???"}, {"username": "Daniela Celi", "comment_text": "Definitely not!"}, {"username": "Lauren Vassallo Beattie", "comment_text": "Yes, yes and yesss"}, {"username": "Daniela G Staibano", "comment_text": "Absolutely!!!!"}, {"username": "Niin Dvali", "comment_text": "Napoli is the place which you cant describe, you have to feel it! Worth it? I think if you will not see Napoli, you will not see real Italy 🫶🏽 food amazing, prices amazing, its also messy and not really safe, but you should experience the spirit"}, {"username": "Jerneja SB", "comment_text": "Yes. Absolutely."}, {"username": "Irene Oda", "comment_text": "What are you looking for? What's worth it to you?"}, {"username": "Linda Nogara", "comment_text": "Yes!"}, {"username": "Philip Curnow", "comment_text": "Is the Pope Catholic?"}, {"username": "Maria Saraceni", "comment_text": "Si"}, {"username": "Gabrielle Goodenough", "comment_text": "Absolutely 💯"}, {"username": "Anna Nardone", "comment_text": "Anna Nardone"}, {"username": "Michelle Malarchy", "comment_text": "Yes, and the surrounding areas."}, {"username": "Ishbel Raffle", "comment_text": "I stayed at an Airbnb on Via Tribunali. It was the top floor of a palazzo and had the most amazing views of Vesuvius, the rooftops and the sea from the rooftop patio. Perfect location for enjoying the historic centre of the city. A weekend wasn’t enough- loved every minute"}, {"username": "Sally Hartmann", "comment_text": "Yes it’s an experience!"}, {"username": "Lydia Aceves", "comment_text": "YES!!!"}, {"username": "Judy Matthews Barrientos", "comment_text": "Yes"}, {"username": "Marus Lopez", "comment_text": "Definitely yes!!!"}, {"username": "Volney Cothran", "comment_text": "Yes. Naples is an amazing and beautiful city. And the people there are fantastic."}, {"username": "Leigh Bosworth", "comment_text": "Definitely - as one of the past leading cities of the world, there is so much historical culture in Naples, it would be almost a crime to overlook it.\n\nIf, however, your enjoyment of a holiday is all about beach, sunbathing, drinking at poolside, then probably not.\n\nThe first time I ever visited, I was a little cowed by the noise, the different approach to rubbish jettisoning, the 'unmanicured' appearance of the outside of residences - but get past the initial unfamiliarity, go inside someone's home and really see the lifestyle of the city's inhabitants and you should quickly appreciate all of it."}, {"username": "Michael Greenhalgh", "comment_text": "Definitely yes. Ignore all the negative comments you read. I go for long weekends it's absolutely brilliant. As with any city or large town you have to have common sense and not go walking dripping in jewellery or your wallet on show. Iv never had any problems at all. Loads to see, the locals are great, brilliant food and your only a train ride from sorrento, about an hour\nEnjoy"}, {"username": "Eva Thunell", "comment_text": "Yes!"}, {"username": "Janet Ciantar Sultana", "comment_text": "Yessss"}, {"username": "Tori Renner-Suarez", "comment_text": "Yes!"}, {"username": "Cindy Bessel Talerico", "comment_text": "Yes a thousand times yes!!!"}, {"username": "Karen Consoli", "comment_text": "NO"}, {"username": "Rebecca Wilcox", "comment_text": "No, not worth it"}, {"username": "Benjamin Joseph", "comment_text": "Loved it. Went to the original pizza place. The wine sucked but best pizza in my life. Have to do Pompeii as well imo"}, {"username": "Joy Price Morriss", "comment_text": "YES!!!!!!!"}, {"username": "Anna Barraza", "comment_text": "Yes!!"}, {"username": "Kelly Peagler Myers", "comment_text": "Shawnna Chance"}, {"username": "Taylor Mignacca", "comment_text": "🙄🙄🙄🙄🙄"}, {"username": "Christine Ann", "comment_text": "Everyone has the right to their opinion….\nI appreciate yours as well. Have a good night."}, {"username": "Susan B. Corino", "comment_text": "Susan B. Corino"}, {"username": "Martinez Martin", "comment_text": "Nope, other than Pompeii . . . Super dangerous."}, {"username": "Wendy Anne Breuer", "comment_text": "Loved Naples. I have been there twice."}, {"username": "Sally Warren", "comment_text": "It is fabulous! Gritty and real, exuberant and friendly. Best museum!"}, {"username": "Suzanne Issa", "comment_text": "Yes‼️"}, {"username": "Linda Smith", "comment_text": "I loved Naples"}, {"username": "Debi Ruberto", "comment_text": "Was there in May.\nBeautiful city but trashy and very smelly. Furniture floating on the beach."}, {"username": "Suzanne Mills", "comment_text": "Yes 100%"}, {"username": "Vicki Nicoletti", "comment_text": "It's one of the craziest places I've ever been to I wish I would have taken film of the place but you gotta stop there for a day check it out."}, {"username": "Rosa Andreef", "comment_text": "I adored Naples especially Christmas Alley but sadly was pickpockets on train even though I had zips and bag in front of me. It was when I got on train. They stole my phone with all my months photos. And another woman i knew\nthe same day who was disabled was mugged. So be careful. Also if disabled it is very very difficult to get a taxi. Otherwise enjoy this lovely city"}, {"username": "Manon Cote", "comment_text": "I loved visiting Naples…I got to experience both sides ..the residential area and the tourist area…the people were so inviting."}, {"username": "Erika Kl", "comment_text": "I just went to Naples in may, definitely don’t stay near the train station or to the eastern part of the port. But it is a big city with a lot going on. There is a lot to see there and we had a great food tour. You’ll get a very Neapolitan experience and it’s not super touristy. Also it’s a great place to visit nearby islands and the Amalfi cost. Feels a lot like the Italian version of Los Angeles"}, {"username": "Line Gregoire", "comment_text": "Absolutly!!!"}, {"username": "Dianne Buscema-Gerogianis", "comment_text": "Absolutely!!! Loved Naples!! We stayed at the Hotel Santa Lucia--- ot was wonderful!"}, {"username": "Connie Manuel Fontenot", "comment_text": "Denise Wright Bellard"}, {"username": "Martin L. Epperly", "comment_text": "Yes"}, {"username": "Enolita Castillo", "comment_text": "YES!!!"}, {"username": "Enolita Castillo", "comment_text": "Luca Lookone Ferrentino & Angie Martin, WELL SAID!"}, {"username": "Pam Brace Merrick", "comment_text": "No"}, {"username": "Franchelle Dorn", "comment_text": "Yes."}, {"username": "Sherri Leis Dillavou", "comment_text": "I loved Naples! Pizza! Cathedral! The people were awesome. I was there during the holidays and the Christmas markets were awesome"}, {"username": "Mayra Houston", "comment_text": "No"}, {"username": "Stevie Boombatz", "comment_text": "Hell yes !"}, {"username": "David Davey", "comment_text": "Naples is arm pits of Italy having said that take a funicular nice view of city. In 1966 I had first pizza with onion on it also ate meter long spaghetti 😂😂"}, {"username": "Maile Ehlers", "comment_text": "I just spent two nights in Naples and it completely exceeded my expectations. The fear mongerers on these websites made me believe it was unsafe as a solo female traveler and I just overall wasn’t looking forward to it. But it blew me away - everyone was so nice and welcoming, there was so much to see and do, I never felt unsafe than any other city… and the FOOD! Don’t overlook Naples."}, {"username": "Erin Ryan Spera", "comment_text": "Yes! Food is amazing. Do a food tour! And also visit Cafe Gambrinus!"}, {"username": "Lydia Springer", "comment_text": "In my opinion, the question \"is it worth it\" is rather offensive. The enjoyment of a destination is subjective for each individual. I guess I just don't understand why people want to be told where to go which is what \"is it worth it?\" really means."}, {"username": "Fanceen Gironta", "comment_text": "BRAVA"}, {"username": "Gissela Collis", "comment_text": "Yes"}, {"username": "Angie Mattin", "comment_text": "Naples is busy, authentic, genuine and full of life! It’s not your typical tourist attraction, there’s no ‘beautiful coastline’ (though the port with Vesuvius in the back is a good view), but it’s definitely worth seeing if you enjoy culture and good food!"}, {"username": "Popo Plouf", "comment_text": "Il n y a pas une seule ville en Italie qui ne mérite pas d être visitée....... my God certaines gens et leur manque de culture......."}, {"username": "Deborah Kane Edstrom", "comment_text": "Of course it is!"}, {"username": "John Joseph Gardella", "comment_text": "Roberta Todisco please comment. We loved Naples..."}, {"username": "Maria Filippiadou", "comment_text": "Fabulous city....great vibe..."}, {"username": "Elaine Marinari", "comment_text": "Yes!"}, {"username": "Jeff McLellan", "comment_text": "We only had a morning there did a two hour guided tour with Ludovica from Ludoviguida and we all wish we had more time. It is an amazing city rich with history and beauty. If you judge it based solely of the urban Centre and historic area you need to explore it more. We had a great lunch in a neighbourhood we would never had explored unless we had connected with our guide. Following our guided tour our guide arranged for a driver to take us see other parts of the city before taking us to the Napoli Afragola station for our train."}, {"username": "Lise Stott", "comment_text": "There is no place in Italy that isn’t worth it ! It’s all amazing"}, {"username": "Mary Iuor", "comment_text": "Yessss!! Hidden treasure"}, {"username": "Dalia Gonzalez Jensen", "comment_text": "Yessss"}, {"username": "Fafo Elkablie", "comment_text": "NoOo"}, {"username": "Carolina Alejandro Clabaugh", "comment_text": "Yes 💯"}, {"username": "Miklos Verdes Kovacs", "comment_text": "No.✔️"}, {"username": "Natia Akhalashvili", "comment_text": "Definitely yes and if you’d like to learn about this magic city try to attend on the football match of Napoli"}, {"username": "Raf Gervasio", "comment_text": "Yes best food best culture best everything....w\ne're going next month for 11 nights...dad was Neapolitan we're taking his ashes home to the village where he was born 91 years ago....it'll be emotional especially seeing family for the first time since dad's passing but we want to enjoy the city of my father gots lots of excursions planned"}, {"username": "Senan Haugh", "comment_text": "Yes !!"}, {"username": "Senan Haugh", "comment_text": "We stayed in this amazing small hotel right in middle of city.. summer 2022..\nhttps://\nwww.sweetsleepna\npoli.com/\n.. loved the city. Mad of course but full of character, amazing food and craic."}, {"username": "Anne Mc Namara", "comment_text": "I flew into Naples on the way to Sorrento ,but didn't get to see any of it as our flight was delayed so long we got to hotel at 3.30 am.Will definitely go back and spend a few days in Naples."}, {"username": "Kate Piszczek", "comment_text": "For me big NO ,it was my biggest disappointment 🙈"}, {"username": "Παττυ Πάττυ", "comment_text": "Naples is so beautiful but dangerous right??"}, {"username": "Pam Gerretsen", "comment_text": "Naples is quite different to other areas of Italy, but I still loved it. After reading very mixed reviews, I wasn't sure what to expect, but it was fab ( I can see why people might not like it - but I'd say give it a chance!)"}, {"username": "Terina Kwiatkowski", "comment_text": "Definitely good for a night or two great shopping and pizza!"}, {"username": "Natalie J DeRasmi Saeger", "comment_text": "YES!!!!!"}, {"username": "Bonnie Rodgers Henderson", "comment_text": "Love Naples and the food. Great museums"}]}, {"id": "2203377743394637", "text": "I hope this amazing group can help me! 🙏 I'm overwhelmed planning my own itinerary. We're heading to Italy for a wedding the 1st wk of October for 8 days <not including travel days>. Flying in/out of Rome & heading South. Planning 3 days in Rome, 2 in Sorrento, 2 in Positano then back to Rome to fly home.\nTrying to fit in all the fabulousआणखी highlights posted here but can't narrow it down. Would love a golf cart tour of Rome, a Vatican tour, Pompeii, a cooking class & a convertible tour of the Amalfi coast.\nWhat are the \"MUST\" things to do?? <FYI - going with my husband who's not too keen on museums. 😘>", "link": "facebook.com/groups/1373361046396315/permalink/2203377743394637/", "likes": 0, "comments": [{"username": "Jenny Payne", "comment_text": "Hope you have book your accommodation? as it will still be busy🌻"}, {"username": "Julie Koenig Cooper", "comment_text": "How exciting!! We’re going October 2! We have a Vatican and culinary tour booked so far! The convertible tour of the coast sounds fun! Our plan right now is to spend 2 days in Rome then head to Florence to check out wineries! We have friends that own wineries so I’m sure they will show us a great time!"}, {"username": "Chiara Normanno", "comment_text": "I think one day in Sorrento and one in Positano are enough, they're small. So on the second day in Sorrento you could visit Pompeii or Naples and on the second day in Positano you may have a look around the Amalfi Coast (Amalfi, Furore, Minori, Vietri etc)"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2203602476705497", "text": "Hi! We are checking into a small hotel in Pompeii today and was told to text when we got there. I have just tried to send a test message to the number but it is not connecting! Does anyone know if there is something I should be doing to text an Italian number from a UK phone? Any help would be appreciated 😊", "link": "facebook.com/groups/1373361046396315/permalink/2203602476705497/", "likes": 1, "comments": [{"username": "Brian Smith", "comment_text": "Are you using what’s App? Correct country code? +39?"}, {"username": "Cecilia Christine Costantini", "comment_text": "Adding +39 in front of the number. Maybe they meant whatsapp text and not text message?"}, {"username": "June Quagliariello", "comment_text": "Use whatsapp"}, {"username": "Alessandro Iannelli", "comment_text": "most italians use the app whatsapp to communicate via text, so first off i would use that, if you haven't. second, if you want to use sms, i assume you have to add +39 before the number, if you don't have an italian sim card."}, {"username": "Daisy Yoo", "comment_text": "whatsapp text :)"}, {"username": "Bill Casper", "comment_text": "Use WhatsApp"}, {"username": "Ilonka Sinkeldam", "comment_text": "Add +39 for Italy , remove the first 0."}, {"username": "Yvonne Ormson", "comment_text": "WhatsApp them."}, {"username": "Irene Oda", "comment_text": "If all else fails go to a neighbour or next business for help. Locals know each other. That's what happened to us several years ago. Neighbor connected us."}]}, {"id": "2203603880038690", "text": "Hello! Is it cheaper to get a tour from Florence to Pisa or to travel independently? If you recommend a tour, which one? We don’t want to stay for long at Pisa. We are a family of 4 and the two of us are young children. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2203603880038690/", "likes": 1, "comments": [{"username": "Matteo Basile", "comment_text": "For sure is cheaper the train. If you go to the station of Pisa san rossore than you can walk to piazza dei miracoli and after move to the centre"}, {"username": "Daisy Yoo", "comment_text": "no need for tour, u just take a train, then walk or take a local bus to get close from train station to leaning tower and need 30 mins to an hr there, that is it. so I would combine pisa with another location like lucca."}, {"username": "Renae Larcus", "comment_text": "Do it yourself. Plus a tour will drag it out. You can do Pisa quickly on your own and on your own schedule"}, {"username": "Alessandro Iannelli", "comment_text": "it is of course cheaper to do that independently. you can simply take the train in the morning, spend the day in pisa and then go back to florence."}, {"username": "Marya Hayat Khan", "comment_text": "Thank you 🙏🏼🤗"}, {"username": "Domenica Calvene", "comment_text": "Do it yoursef if you only want to see Pisa then move on.We stayed a few hours then went to Florence for 1 night."}, {"username": "Gary W Anderson", "comment_text": "Don’t need a tour to see a leaning tour, return to Florence and take the tour time in Tuscany."}, {"username": "Ana Ka", "comment_text": "I agree. We did Pisa rather quickly… and on our own. Did the leaning tower, the baptistery and campo santo. We used appy guide video tour on our phones and it was sufficient."}]}, {"id": "2203608180038260", "text": "Greetings from South Africa! We are planning a trip to Italy early next summer. We have 3 kids aged 14, 12 and 10 (a girl and 2 boys) We are looking to go somewhere that has lovely beaches, blue water and greatआणखी food but still authentic Italian. We were thinking Puglia may be a good option? Given our kids are young, we are hoping to find a hotel for 5 nights which we could use as our base, that is 4 or 5 star, which has a pool and is well located with easy access to beaches (access to a private beach would be a plus) as our kids are not keen to move around from one hotel to another. We’d book 2 rooms - one for the kids and one for us. If anyone has stayed somewhere that fits this description, please let me know. Otherwise, looking for input on what area/village is best located to look for somewhere appropriate? Thanks for your help 🙏\nPhoto credit: Lonely Planet", "link": "facebook.com/groups/1373361046396315/permalink/2203608180038260/", "likes": 1, "comments": [{"username": "Steve Goldman", "comment_text": "I’ll find you some places, we just got back from Gallipoli, it‘s incredible down there. And I’m living in Rome now. I’ll send you a message when I figure out how!"}]}, {"id": "2203609003371511", "text": "Hi , looking for some guidance and opinions. My hubby and I have 7 days in Italy and wondering how to split the days between Rome, Florence and a day trip.\nConsidering 5 days in Rome. Is this too many (& why)?\nWe have 2 days in Florence and wondering if we spend 2 days in Florence or one day with one day on a tour of local Tuscan villages.\nWhat are your recommendations?", "link": "facebook.com/groups/1373361046396315/permalink/2203609003371511/", "likes": 2, "comments": [{"username": "Rimsha Javaid Chaudry", "comment_text": "2 nights in Florence. Then a night in a Tuscan town/village. Then 4 nights in Rome!"}, {"username": "Daisy Yoo", "comment_text": "5 days in rome is not too long, we will be staying for 5 whole days and wish I can do 7. all depends on how much of rome u want to see beyond the typical tourist spots. there are so much more to rome than those. since u just have 7 days, I may do 4 in rome and 3 in florence and actually leave from florence. florence needs 2 whole days and the other one u can do a pisa/lucca as a day trip or siena/san G .. we will be staying in florence for 4 whole days."}, {"username": "Tracy Piko Lawniczak", "comment_text": "We did 4 nights in Rome and, 1 day was a travel day from Venice, one day was a trip to Capri. Rest of time we saw a lot but also didn’t get to see everything. Lol. Lots lots to see in Rome. So that many days you have planned might just be good. All depends on your list of must see"}, {"username": "Ron O'Brien", "comment_text": "Spend all 7 days in Rome and do your day-trip from there. Orvieto?"}, {"username": "Lydia Springer", "comment_text": "Three days in Rome, four in Florence with a day trip."}]}, {"id": "2203627070036371", "text": "Florence to Sorrento .\n\nWhat is the easiest , cost effective way ?\n\n🙏 thank you 🙏", "link": "facebook.com/groups/1373361046396315/permalink/2203627070036371/", "likes": 3, "comments": [{"username": "Dave Jackson", "comment_text": "Its a long drive that 🤪\n\nMight be better flyin into Naples"}, {"username": "Terri St Amand", "comment_text": "Following"}, {"username": "Sara Beth", "comment_text": "Rome2Rio is a great website where you can see all of the ways to travel from A to B-fastest, cheapest, etc…"}, {"username": "Katie Ehlers", "comment_text": "Rent a car to be honest…."}, {"username": "Cat Furness", "comment_text": "Train"}, {"username": "Kate Piszczek", "comment_text": "Train"}, {"username": "Laura DeCicco", "comment_text": "Rome2rio"}, {"username": "Dennis Comfort", "comment_text": "Train"}, {"username": "Lisa DiDonato Hayden", "comment_text": "Private driver! Saves time and isn’t as pricey as you’d think. We took a train from Florence to Naples and then the drive from Naples to Sorrento. It cost us the same as the second train and saved us from waiting around for a ferry (the other option). We used Sorrento Private Limo for two separate drives on our trip and they were great!!"}, {"username": "Luigia Gray", "comment_text": "Train"}, {"username": "Paula Stewart", "comment_text": "Train"}, {"username": "Lisa Shaw", "comment_text": "🙏 Thanks everyone for your help , looks like we might use train and ferry or private driver ."}, {"username": "Jono Roland", "comment_text": "Train then ferry."}, {"username": "Michela Esse", "comment_text": "Train"}, {"username": "Michael Stefano", "comment_text": "I can only say what I did... take the train from Florence to Naples. Then take private transfer from Naples to Sorrento. Worked perfectly."}, {"username": "Diane Davis Lawyer", "comment_text": "Train. You have to change trains in Naples to a different line."}, {"username": "Roland Trego", "comment_text": "Rapid train from Florence to Naples. Then this (you need to take out the spaces): https: // www . sorrentovibes . com/\ngetting-from-nap\nles-to-sorrento\n-best-route-202\n3/"}, {"username": "Tom Duffy", "comment_text": "Train florence to Naples...hired car from Naples to Sorrento"}, {"username": "Matt Davey", "comment_text": "Florence to Naples on an express train, then get a taxi from the station (they have set prices to each town across Amalfi) or a private driver to Sorrento - I think the taxi was about €130 when we went last month 👏🏻"}, {"username": "Neal Bainto", "comment_text": "train all the way. you'll get too see mt. vesuvius if you take train from naples to sorrento"}, {"username": "Birgit Temme", "comment_text": "By train"}, {"username": "Kelly Clark", "comment_text": "Train to Naples and then a second train to Sorrento which is an experience in itself! Very short walk into Sorrento from train station."}, {"username": "Suzanne Mills", "comment_text": "Train"}, {"username": "Jihan Adem", "comment_text": "Absolutely not a private driver!!!\nUnless you can beat this price…"}, {"username": "Elizabeth May La Duca", "comment_text": "Google Maps"}, {"username": "Julie Tran", "comment_text": "Train to naples then private driver"}, {"username": "Robert Parinetto", "comment_text": "Train to Naples. Then private transfer."}]}, {"id": "2203627223369689", "text": "I have visited a few cities in Italy in the past years during the autumn / winter so I am pretty familiar with the accommodation & transportation matters. I have been dreaming of doing a summer vacation and I am torn between Sicily and Sardinia. Our main issue is that we want only sandy beaches and small towns (not cities) to stay in. Whichआणखी location is better in your opinion? Are there any particular small towns with seafront that you would recommend? Any specific hotels with a logic price and super clean - nothing fancy (150-200 euro per night/room)?", "link": "facebook.com/groups/1373361046396315/permalink/2203627223369689/", "likes": 1, "comments": [{"username": "Daisy Yoo", "comment_text": "I am not into beaches, however I know both sicily and sardinia have seperate FB groups that will help u even more, u can join them and ask that and exit one once u deciding on which to go."}, {"username": "Alice Francesca", "comment_text": "Sardinia hands down!\nFly into Olbia.\nRent a car from the airport.\nDrive North about 25 minutes, to Marinella, eccellente apartments for rent, with seaview and cheap (on booking dot com).enjoy the sandy beaches and turquoise waters of Costa Smeralda ( the emerald coast, for good reasons)\nMy favorite: Liscia Ruja\nStintino\nCala Moresca\nRena Bianca\nSpiaggia del Principe\nBest place for aperitivo: San Pantaleo up on the hills, boho chic vibes.\nCuisine: try SEAFOOD FREGOLA"}, {"username": "Helen Ladkin", "comment_text": "Sandy beaches=Sardini\na, from what I have heard."}]}, {"id": "2203629443369467", "text": "Photo idea for anyone in Pisa!! 😜😜", "link": "facebook.com/groups/1373361046396315/permalink/2203629443369467/", "likes": 20434, "comments": [{"username": "Sonia Franklin", "comment_text": "Silvi Franklin Margaret Curson"}, {"username": "Sonia Franklin", "comment_text": "Silvi Franklin Margaret Curson"}, {"username": "Peter Rasmussen", "comment_text": "I loathe these idiots."}, {"username": "Ally Elizabeth", "comment_text": "Katie Bretl hahaha I'm gonna make Dad do this."}, {"username": "Donna Evans", "comment_text": "Michelle Stevenson\nHayley Sanders"}, {"username": "Amata De Ruiter", "comment_text": "Tatjana Kapitein voor als je gaat 🤣🍦"}, {"username": "Sam Prasadh", "comment_text": "Here's our specila effcets picture, Haha!"}, {"username": "Filiz Sefket", "comment_text": "Filiz Sefket"}, {"username": "Annie Micale Webb", "comment_text": "For those criticizing: When we visted Pisa and got a personal tour of Pisa from a distant cousin and her father who is a hospital administrator with an office overlooking the plaza where the tower is, I resisted doing the touristy photo with our native Pisan relatives standing right there. My husband said \"pose holding it up.\" \"No, shhhhh, not with real Italians here, how embarrassing.\" And my older cousin, the hospital administrator in his beatuiful italian accent said \"would you like to do the standard pose?\" So very sweet. So, have fun people! Respect the landmarks, learn all about them, then have your fun and take your photos how you please!"}, {"username": "Andrea Lucier", "comment_text": "Boring and doesn't look like ice cream"}, {"username": "Glenda Barile", "comment_text": "That is unsanitary! Think of the kids!"}, {"username": "Deborah Benedetto DeLaurentis", "comment_text": "This is the best!"}, {"username": "Mark A. Zucker", "comment_text": "A good one ☝️"}, {"username": "Mark Pettiglio", "comment_text": "Absolutely fabulous"}, {"username": "Céline Linthout", "comment_text": "Ellen De Meyst ik daag je uit!!!!"}, {"username": "Susan Muriella", "comment_text": "Love this one 👍🏻"}, {"username": "Helaine C Zagaro", "comment_text": "Best photo!"}, {"username": "Karen Gregory", "comment_text": "Thank you for making me smile!"}, {"username": "Buc Christopher", "comment_text": "Just a matter of time before the cone topples over..."}, {"username": "Courtney Tigue", "comment_text": "Mary Lapp"}, {"username": "Janet Dykstra", "comment_text": "Sona Olivia Awe, this would have been perfect!!"}, {"username": "Shyamlee Bhambore", "comment_text": "This one's do good 👍 ☺️"}, {"username": "Kirst Jane", "comment_text": "Richard Hughes your next photo opportunity"}, {"username": "Mary A Holland", "comment_text": "Very cool!! Great job!!"}, {"username": "Eva Vass", "comment_text": "Eva Vass"}, {"username": "Curtis N Lucia", "comment_text": "Ummmm. Just no"}, {"username": "Yostina Narouz", "comment_text": "Creative! 😂😂"}, {"username": "Angela Ralston Lowe", "comment_text": "Kelly Rice Zunich"}, {"username": "Debra Therese", "comment_text": "Jodi Moresco 🤣🤣🤣"}, {"username": "Phil Higginbottom", "comment_text": "Love it! Not see. That before but might have to get the kids to do that when we visit.🤣👍"}, {"username": "Brian Johnson", "comment_text": "tbh I was a little disappointed with all that, I wasn’t there very long but it was very cheesy to me, everywhere you looked people were posing for the photo. It’s a shame because it really is beautiful"}, {"username": "Ellie McCoy", "comment_text": "Best ive seen yet"}, {"username": "Annette Giovia", "comment_text": "Cute!!"}, {"username": "Marion Welsh", "comment_text": "Love it!"}, {"username": "Teresa D'Alessio", "comment_text": "Fantastic shot"}, {"username": "Kim Lehman Johnson", "comment_text": "Awesome!"}, {"username": "Deana Lynn", "comment_text": "Cortnee Hogans"}, {"username": "Mary Heller", "comment_text": "Jenny Heller Morehouse\nWe gotta!"}, {"username": "Nikki Blosser", "comment_text": "Good one!!"}, {"username": "Steve Paterson", "comment_text": "Ali Paterson 🍦 🤣"}, {"username": "Glenys Scrofani", "comment_text": "Georgia Bailey 😆"}, {"username": "Alison Winrow", "comment_text": "Claire Louise"}, {"username": "Lester Smith", "comment_text": "That's actually better than most."}, {"username": "Katie Marie Parkes", "comment_text": "Ben Field"}, {"username": "Elizabeth Bernal Bain", "comment_text": "For those of you who aren’t American, when you get ice cream at a drug store, they have scoopers that put the ice cream in this cylinder shape. Yes, it does look phallic but I assure you it’s not…right?"}, {"username": "Sheila Cabano", "comment_text": "ma ti prego :-"}, {"username": "Celine de Bruijn", "comment_text": "Shirley van Unen"}, {"username": "Amirah Suraya", "comment_text": "Sinar Yahaya"}, {"username": "Danny Gardner", "comment_text": "Sarah Jo forgot to do this. Need to go back now 🇮🇹"}, {"username": "Manvinder Kaur", "comment_text": "Manvinder Kaur"}, {"username": "Beck Chapman", "comment_text": "Tanya Large totally one for Amelie!!!"}, {"username": "Mandy Campbell Macintosh", "comment_text": "Love it 😀"}, {"username": "Kim Aranha", "comment_text": "I think the “officials” realize that these kind of photos bring lots of people to Pisa and bring money to the community- gelaterie, shops, trattorie ….\nI live in the Bahamas and we put up with droves of tourists wearing next to nothing (skimpy bikinis - large bodies) walking down the Main Street of our Capital city but they bring funds to our economy. It would be nice if they covered up …. But they don’t!\nI would rather they take crazy photos!\nSometimes you have to go with the flow …."}, {"username": "Lauren Vassallo Beattie", "comment_text": "We did it a bit different, my back kick 😅"}, {"username": "Samone Malloy", "comment_text": "Mindi Mae Malicoate"}, {"username": "Lauren Vassallo Beattie", "comment_text": "Side kick"}, {"username": "Jorge Lara", "comment_text": "Buza Ana Luisa Medellin Palacios 📷👀"}, {"username": "Shirley Mironoff Grieveson", "comment_text": "Love it!"}, {"username": "Mylene Hunt", "comment_text": "That’s a fantastic photo."}, {"username": "Jane Ronec", "comment_text": "Excellent"}, {"username": "An Ma", "comment_text": "On that place walked the best artists of the entire history of the mankind, on that place the history was made :he Etruscan were there, then the Romans, the Longobards than it became the core of the Pisan Republic. In that place the heros that set free the southern Italy, Corsica and Sardinia from the Saracens received the the blessing from the Pope. Than so on till the defeat against Genova and the incorporation in the Florentine state... But the American barbarians crowding that place they don't care about who stepped that soil before them , they just want to take a cringe picture to post on the social media"}, {"username": "Riley Grieveson", "comment_text": "Hannah Maleski"}, {"username": "Denise Leslie", "comment_text": "Very cool photo 😊"}, {"username": "Sephora Cutajar", "comment_text": "I tried to flick it back 🙃🤪"}, {"username": "Sally Giles", "comment_text": "Susan Frank 😘"}, {"username": "Angela Emmitte Tripp", "comment_text": "Diana Ingram I laugh everytime when I see a picture ---I hard such a hard time getting it right....oops..\nlmao"}, {"username": "Dana Golden", "comment_text": "Love love love this"}, {"username": "Judy Watson", "comment_text": "😆"}, {"username": "Graham Martin", "comment_text": "Kelly Mcgrattan 😂"}, {"username": "Bernie Dwyer", "comment_text": "Vicky Dwyer 🤣"}, {"username": "Anne Ingham", "comment_text": "That's a good one."}, {"username": "Carol Hall Tucker", "comment_text": "Too cute..very clever"}, {"username": "Roy Slootheer", "comment_text": "Awesome 👏"}, {"username": "Erica Duarte", "comment_text": "Patty Trejo 🤩"}, {"username": "Raymond Capkin", "comment_text": "Pisa tacchio"}, {"username": "Tiffany Nichole", "comment_text": "So cute!"}, {"username": "Htun Htet Aung", "comment_text": "Htun Htet Aung"}, {"username": "Amanda Stewart", "comment_text": "Karen Stewart 😂 photo ideas"}, {"username": "Lisa Long", "comment_text": "Lisa Long"}, {"username": "Jen Lundy", "comment_text": "Fabulous"}, {"username": "Ed Enfield", "comment_text": "Excellent!"}, {"username": "Cindy Sguazzin", "comment_text": "So infantile!"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "I wish at least 1/2 of the people doing these photos actually walked in the monuments and red 3 lines about them and the art inside and spent more than half an our there. And I wish at least 1/4 of them took the time to walk to the Piazza dei Cavalieri (not mentioning the other stuff).\nPisa wouldn’t be so awfully destroyed by 1 hour tourists."}, {"username": "Pam Borchert Wildrick", "comment_text": "Great picture!"}, {"username": "Mary Jade Chan", "comment_text": "Best one ever ... 🤩"}, {"username": "Kim Aranha", "comment_text": "Fabulous"}, {"username": "Roberta Andrechick Niedt", "comment_text": "This is the first time I’ve seen this version. Very clever!"}, {"username": "Mark R Palladino", "comment_text": "If you are going to do this at least don’t have tourists in your icecream! Barbaric! Lol"}, {"username": "Anita Bonaminio Krimm", "comment_text": "Perfect!"}, {"username": "Adrienne Haines", "comment_text": "Reilly Hubbard!!!!!!! 😂"}, {"username": "Scarlett Tran", "comment_text": "Scarlett Tran"}, {"username": "Здравко Здравков", "comment_text": "Dimitrina Zdravkova"}, {"username": "Tony Sousa", "comment_text": "Very cool photo !!"}, {"username": "Meera Sathaye", "comment_text": "This is the most common one"}, {"username": "Sue Allanby", "comment_text": "We did the one where you are pushing it over (hence the lean)."}, {"username": "Gillian Dansie", "comment_text": "Channe Moore Justin Dansie .\nVery cool... we need some ideas 😂"}, {"username": "Michela Zanni", "comment_text": "Original..."}, {"username": "Rachel Castleberry", "comment_text": "❤️"}, {"username": "Yara Karime Vazquez", "comment_text": "Perlita Cabrera"}, {"username": "Martin-John Rubio", "comment_text": "Great shot"}, {"username": "René Gómez", "comment_text": "My wife hated mine and said I need to grow up"}, {"username": "Krissy DaRusso", "comment_text": "Well done!!"}, {"username": "Josie Flores", "comment_text": "I love this one…"}, {"username": "Lia van Hyfte", "comment_text": "Infinity JP-Anja😝"}, {"username": "Maureen Hayes", "comment_text": "😎"}, {"username": "Eugene Klein", "comment_text": "Maybe spend more time studying what that tower is, rather than repeat for the Million's time"}, {"username": "Chrystal Stevens Bisonet", "comment_text": "Cute!"}, {"username": "Frances McDonagh", "comment_text": "Trivia tower is more leaning in Bologna"}, {"username": "Ken Vecchia", "comment_text": "Different"}]}, {"id": "2203632310035847", "text": "Spello, Perugia - July 2023\nThe most beautiful little city i’ve ever seen ❤️", "link": "facebook.com/groups/1373361046396315/permalink/2203632310035847/", "likes": 483, "comments": [{"username": "Kay Malick", "comment_text": "Its a lovely city...i think the whole Umbria region is like this...Assisi, Perugia Spello etc..."}, {"username": "Lois Letterie Cianci", "comment_text": "Awesome pictures! I plan to be there next October and after seeing these photos, I can hardly wait!"}, {"username": "Michael Rudder", "comment_text": "Kate Rudder"}, {"username": "Margaret Sleep", "comment_text": "Margaret Sleep"}, {"username": "Khoa Ngo", "comment_text": "I have been to Spello and I agree to you! Absolutely stunning"}, {"username": "Cindy Voss", "comment_text": "Catherine Sharp Nanci Moll"}, {"username": "Lynn Dawson", "comment_text": "Gorgeous- thanks"}, {"username": "Angela Choe", "comment_text": "Angela Choe"}, {"username": "Caroline Richards", "comment_text": "Absolutely stunning!"}, {"username": "Simone Nicole", "comment_text": "Ric Semreh"}, {"username": "Carmen Peng", "comment_text": "Wow 🤩"}, {"username": "Fiona Douglas", "comment_text": "Robyn Friedrich wow"}, {"username": "Leanne Dawn Sutton", "comment_text": "Leanne Dawn Sutton"}, {"username": "Urška Šoštar", "comment_text": "Marko Farazin"}, {"username": "Glessie Castillo", "comment_text": "Beautiful 😍"}, {"username": "Rachel Blears", "comment_text": "Karl Blears"}, {"username": "Jason Sumner", "comment_text": "Fantastic pics"}, {"username": "Scott Heran", "comment_text": "It’s a gorgeous little town."}, {"username": "Joyce Madonna", "comment_text": "Joyce Madonna"}, {"username": "Renee Klunk", "comment_text": "Gorgeous ❤️❤️ I will be going there in October! Any specific recommendations\nto see and eat? I only have two days there"}, {"username": "Gail Diederich Merki", "comment_text": "Gail Diederich Merki"}, {"username": "Pamela J. Roe", "comment_text": "Pamela J. Roe"}, {"username": "Sritama Som", "comment_text": "So beautiful ❤️"}, {"username": "Maria Musumeci", "comment_text": "Omg I looooove Perugia 😍"}, {"username": "Chris Ciantar", "comment_text": "Yusepha Polidano"}, {"username": "Karen M Gahrns", "comment_text": "Gorgeous ❤️❤️ Denise Weninger!"}, {"username": "Shelton McBride", "comment_text": "I will be there 4 nights in October!"}, {"username": "Louise Carmody", "comment_text": "Very nice, I was there last week"}, {"username": "Sue Graham", "comment_text": "How long do you need to see the town? It looks small"}, {"username": "Robert Barretto", "comment_text": "been there"}, {"username": "Carol Sellen Ferrero", "comment_text": "Shhhhh please don’t tell anyone I stayed in this lovely town too One of the places not over run w tourists It has so much charm I’m glad you enjoyed it there and thanks for bringing back boatloads of memories"}, {"username": "Gianna Onesi", "comment_text": "Love Perugia beautiful!"}, {"username": "Nylevet Elias Arroyo", "comment_text": "this is beautiful 😍😍😍"}, {"username": "Charlotte DUva", "comment_text": "Beautiful! Is this in Tuscany?"}, {"username": "Beth Ann", "comment_text": "Spello is lovely. It is in Umbria near Assisi"}, {"username": "Xiomara Servellon", "comment_text": "Who lives there , It feels as in a tale 🤗"}, {"username": "Wendy Isabel", "comment_text": "Gilberto Rosas"}, {"username": "Diana Janbeih", "comment_text": "Diana Janbeih"}, {"username": "Enolita Castillo", "comment_text": "Been there...love Spello"}, {"username": "Tanya Heenan Gammon", "comment_text": "Gorgeous pictures"}, {"username": "Donna Kate", "comment_text": "Martin Taylor"}, {"username": "Michele Trial Westerman", "comment_text": "Michele Trial Westerman"}]}, {"id": "2203633450035733", "text": "20-22 Oct: Rome (jet lag recovery on 20 Oct)\n\n22-24 Oct: Cinque Terre\n\n24-28 Oct: Florence / day trip to Pisa, Lucca\n\n28 Oct-30 Nov: Venice\n\n[away to another country]\n\n10-12 Nov: Rome (only 1 full day is available)\n\nShould I drop 1 city?\nAssuming first and last day is usually allocated for travelling. Would appreciate suggestions.\n\nTIA ☺️", "link": "facebook.com/groups/1373361046396315/permalink/2203633450035733/", "likes": 2, "comments": [{"username": "Scott Perry", "comment_text": "Look up the melatonin regimen for dealing with jet lag. It’s really helped me."}, {"username": "Isabella Banfi", "comment_text": "I would drop Venice and do only Rome, Cinque Terre and Florence (without day trips). Consider that it will take some hours to travel between all places, if lucky without some delay 😅"}, {"username": "Dafne Vassetti", "comment_text": "Do Florence first and then Cinque Terre since it's closer to Rome."}, {"username": "Alexandra A Welker", "comment_text": "I think the schedule is good. I would add one night in Rome. Do not skip Venice. I don't usually experience the jet lag going to another country, only when I return home. But what I find helpful is not to sleep at all the day I arrive, I just go and hit the ground running plus lots of coffee. 😃"}, {"username": "Diane Davis Lawyer", "comment_text": "We have a similar amount of time with our itinerary. We fly into Naples on September 17 (although leaving US on16th). We will spend one night, then take the train to Rome. Two nights in Rome, then train to Florence for two nights. After that it's back to Naples for four nights in Sant'Agnello (Sorrento area) and then two final nights in Naples. We've been booked since March and I've worked and reworked our time in each place numerous times trying to decide what gives us optimal time in each city. I've decided unless we had a month, there's no way to have enough time to see all we want to see. I keep second guessing myself, but I've decided to keep this schedule. I do wish I had arranged it so we could just stay in Florence for five nights and venture out from there, then spend the remaining time in Sorrento area. Rooms are now at a premium or nonexistent so it is what it is. Sigh."}]}, {"id": "2203642840034794", "text": "Can someone vouch for how the atmosphere and food quality are at Antica Trattoria da Tito? I’m looking forward to it, but some reviews are scaring me a bit! 😅", "link": "facebook.com/groups/1373361046396315/permalink/2203642840034794/", "likes": 0, "comments": [{"username": "Dafne Vassetti", "comment_text": "What reviews?? I live in Florence. One of my favorite super local restaurant in Florence. Staff is always nice, food is great, prices are good considering the quality. I always go there with friends and family. I live in Florence. It's still a real local place. I usually have Fiorentina steak (not to be served with french fries EVER). It has a 4.6 review on trip advisor are you sure you are not checking the wrong place? There is a Tito restaurant in another area of Florence, Antica Trattoria Is in via San Gallo."}, {"username": "Dafne Vassetti", "comment_text": "The atmosphere is real. Waiters and owner will get mad if you order a well cooked fiorentina steak. It's one of the few restaurants in Florence where tourists are not in charge so you will have to stick to their rules. Which is great because staff is the most rappresentative\nof the Florentine culture you can get in Florence"}]}, {"id": "2203643420034736", "text": "Best town on lake como to stay for few days??!!", "link": "facebook.com/groups/1373361046396315/permalink/2203643420034736/", "likes": 0, "comments": [{"username": "Glenn Todd Webb", "comment_text": "Tremezzo next to villa Balbianello and villa Carlotta."}, {"username": "Shane Macdonald", "comment_text": "Varenna…quite a few restaurants and probably the nicest town in my opinion. I like Mandello del Lario too which has a lido and is more chilled"}, {"username": "Dominique Maillet", "comment_text": "Highly recommend Varenna."}, {"username": "Bev Madill", "comment_text": "Loved Varenna."}, {"username": "Tricia Lanieri Forchetti", "comment_text": "Agree! Varenna!"}, {"username": "Letha Logan-Dardani", "comment_text": "Looking for suggestions on quant local restaurants with great food and views in Amalfi/\nPositano area.\nWe will be there September 10th to 16th\nStaying in Sorrento\nThank you !!"}, {"username": "Kathy Burns Doer", "comment_text": "I was happy in Bellagio!"}, {"username": "Trevor Brown", "comment_text": "Mandello del Lario. Ferry and train and plenty of Airbnb options."}, {"username": "Debbie Reed", "comment_text": "Bellagio for first time visit. A fantastic base for day trips and once day tourists have departed it’s not frantic and absolutely magical. Highly recommend Hotel Centrale Bellagio for old style hospitality and authentic atmosphere."}, {"username": "Virgz Van Møøre", "comment_text": "Como"}, {"username": "Virgz Van Møøre", "comment_text": "Como !"}, {"username": "Oneida Ann Murphy", "comment_text": "What about Torno?"}, {"username": "Rita Bates", "comment_text": "Bellagio is so pretty ♥️"}]}, {"id": "2203647486700996", "text": "Question….do we need to bring our COVID vaccine cards to Italy? We are heading there tomorrow.", "link": "facebook.com/groups/1373361046396315/permalink/2203647486700996/", "likes": 0, "comments": [{"username": "Diana Ferro-Rodrigues", "comment_text": "No"}, {"username": "Sara Beth", "comment_text": "You wouldn’t even know Covid was a thing"}, {"username": "Eleni Koi", "comment_text": "Of course NOT"}, {"username": "Frannie Kaplan", "comment_text": "Those travel restrictions/\nrequirements have been dropped in the whole EU"}, {"username": "Alicia Burno", "comment_text": "Thanks for the info."}, {"username": "Kelly Aynes Zingaro", "comment_text": "No"}, {"username": "Gitte Ebbesen", "comment_text": "🤣"}, {"username": "Laura McSweeney", "comment_text": "No"}, {"username": "Shelby Mathis Snyder", "comment_text": "No"}, {"username": "Shannon Pacheco Modin", "comment_text": "I always have mine in my passport book"}]}, {"id": "2203646853367726", "text": "Can someone tell the train station names in Rome, Florence and Venice. Thanks all.", "link": "facebook.com/groups/1373361046396315/permalink/2203646853367726/", "likes": 4, "comments": [{"username": "Pietro Di Sorbo", "comment_text": "Rome two main station Termini and Tiburtina, Florence Santa Maria Novella, Venice Santa Lucia"}, {"username": "Cindy Laporte", "comment_text": "Stazione Roma Termini\nStazione Firenze Santa Maria Novella\nStazione di Venezia Santa Lucia"}, {"username": "Dafne Vassetti", "comment_text": "There is also the train station Mestre in Venice. Many of the high Speed trains arrive there, then you get the regional train for Santa Lucia which is 10 min away."}, {"username": "Greg Baker", "comment_text": "Rome there’s termini and tiburtina as the bigger ones, Florence is Santa Maria Novella, and unsure for Venice sorru"}, {"username": "Russell Weidner", "comment_text": "Google"}, {"username": "Pong Ac Ai", "comment_text": "Termini in Rome Venezia s. Lucia in Venice and Firenze SMN in Florence"}, {"username": "Albert Campagna", "comment_text": "Rome; Stazione di Termini\nFlorence: Santa Novella"}, {"username": "Pao Magnoler", "comment_text": "Rome: Roma Termini\nFlorence: Santa María Novella\nVenice: Venezia Santa Lucia."}]}, {"id": "2203651613367250", "text": "Has anyone used the CityRedBus to do Ferrari, Balsamic tasting, Parmesan tours from Bologna/Modena? I’m confused which balsamic tour and which dairy would be best?? The private tours are all very expensive ie 300euro which is more than I want to pay to eat cheese and balsamic 🙂 .", "link": "facebook.com/groups/1373361046396315/permalink/2203651613367250/", "likes": 0, "comments": []}, {"id": "2203653400033738", "text": "Hi friends. About to pull the trigger on a trip in late May/early June - I want to commemorate the trip with a Gucci purse I have my I on…can anyone advise what cities you think I’d have the best luck - and also, if you know if the prices are any different? Gracie Tutti!!", "link": "facebook.com/groups/1373361046396315/permalink/2203653400033738/", "likes": 16, "comments": [{"username": "Maddalena Rinaldi Stankevitch", "comment_text": "Just left the one in Rome, wasn’t thrilled with their display choices ."}, {"username": "Joanne Smith", "comment_text": "Milan"}, {"username": "Nicole Beaumont", "comment_text": "Went to Gucci in Milan, didn’t buy a purse but they looked like they had quite a large selection."}, {"username": "Kelly Huntley Clark", "comment_text": "Florence! where the flagship store is. 🙂"}, {"username": "Patricia Condon Goldberg", "comment_text": "What you see now they may not have next year. But the Gucci outlet outside of Florence is amazing"}, {"username": "Lisa Schuminsky Mingoia", "comment_text": "Has anyone been to the outlet in Sanremo? Wondering if it’s a big selection."}, {"username": "Stephanie Smith", "comment_text": "I’ve been to the Florence and Milan stores. Both are fabulous!! Congrats!!"}, {"username": "Giuliana Vaccari", "comment_text": "Has anyone been to the one in Naples or Capri? Thoughts?"}, {"username": "Kate Whitney", "comment_text": "I was on a guided tour and missed a lot of these stores except for Prada Capri that I didn't find anything at . Best of luck on your search!!!"}, {"username": "Tracey Pino", "comment_text": "Gucci outlet in Sicily too! Got almost 50% off US price"}, {"username": "Mat PO", "comment_text": "There is an outlet mall just outside of Florence. They offer very good discounts and you can claim your VAT refund there…"}, {"username": "Helen Layton Brechler", "comment_text": "Go see this guy at the store\nGet there right when they open\nTake what you want down\nFrom the wall\nThe purses go fast"}, {"username": "Amy Schmelzle Walsh", "comment_text": "Gucci Garden in Florence - my daughter got a beautiful bag you can only get there- and the style was much less than in US"}, {"username": "Donna Gilardone Szwabowski", "comment_text": "There are Gucci outlets\nLook at Gucci Italian site for prices\n\nhttps://\nwww.gucci.com/\nit/it/"}, {"username": "Renee Kolb Kiel", "comment_text": "Following"}, {"username": "Chrissa Matthews", "comment_text": "Look at the Gucci Garden and Osteria in Florence- can eat lunch or dinner, shop and Gucci museum"}, {"username": "Susan Kilgore", "comment_text": "Are there any great leather purse values in Venice?"}, {"username": "Richard Gustafson", "comment_text": "Gucci"}, {"username": "Chris Avanzato", "comment_text": "Florence!"}, {"username": "Roxie Pint Tobin", "comment_text": "When I bring up Gucci or Gucci outlets in Milan this shows up! Are these stores that carry Gucci or how do you know which one to go to🤷🏼‍♀️🤦‍♀️"}, {"username": "Jennifer Smith", "comment_text": "The original store is in Florence so it is sort of fun to shop there. They are wonderful. You can go to the Gucci site and change you country to see what it will cost. It may take you a bit to figure out what to select because it changes to Italian. I just count down on the English screen and the count down the same on the Italian screen. Then you can see the bags"}, {"username": "Jennifer Smith", "comment_text": "Prices should be the same through out Italy. You can also purchase at the airport as you are leaving but you take the chance of them not having it. Those purse already have the duty removed so you don’t have to get a refund. Also you might want to look at your first city if it is one that is hard to find."}, {"username": "Jennifer Smith", "comment_text": "If you don’t see what you want ask they have lots of understock"}, {"username": "Celeste Germany", "comment_text": "Can you still get VAT refund from a purse bought at the outlet?"}, {"username": "Cortnee Hogans", "comment_text": "Deana Lynn"}, {"username": "Joann Lynn", "comment_text": "Just outside of flornce is a outlet store several outlets. That are 2/3 off of the normal price which is to say a 500 key chain is only 150 so I would say yes it’s cheaper but only if you go to the outlet"}, {"username": "Maria Magali Giacalone", "comment_text": "They have the Gucci store in the airport! Next time I go that’s where I plan on making my purchase…I’d recommend knowing what you want and calling ahead-"}, {"username": "Kelly Barfield Burchill", "comment_text": "Venice had some nice shops"}, {"username": "Rashelle Lynne", "comment_text": "I had a wonderful experience at the Gucci store in Rome’s airport. I bought two bags, and the prices were so good, the second one was almost free compared to what I would’ve paid in the US"}, {"username": "Jenny Payne", "comment_text": "Rome , Florence,Milan , I would go to the department store Rinascente, I\n🌻"}, {"username": "Kristina Ruk", "comment_text": "Milan is the capital of fashion😀"}, {"username": "Wendy Spano Bracco", "comment_text": "The prices are the same. You can look on the website."}]}, {"id": "2203656150033463", "text": "I'm looking to travel from Florence to Bellagio. Any tips on best way to get there? Or if I should book trains and ferry's in advance. One site told me I could take to Milan Centrale then another train to Varenna and then short Ferry ride to Bellagio but I'm unable to find ferry info/tix online.", "link": "facebook.com/groups/1373361046396315/permalink/2203656150033463/", "likes": 0, "comments": []}, {"id": "2203656006700144", "text": "Vatican stairs, Rome!", "link": "facebook.com/groups/1373361046396315/permalink/2203656006700144/", "likes": 48, "comments": [{"username": "Darren Williams", "comment_text": "Lynette"}, {"username": "Diane Hamilton", "comment_text": "Spectacular!🇮🇹"}, {"username": "Salas Susie", "comment_text": "I remember being on those stairs!"}, {"username": "Bill Elias", "comment_text": "The altar boys never had a chance. 😆"}, {"username": "Roma H.Shah", "comment_text": "Walked down the spiral on my way out of the gift shop area in the Vatican...just this last May"}, {"username": "Chris Hyatt", "comment_text": "Well they’re not in Rome, they’re in Vatican City."}]}, {"id": "2203659883366423", "text": "we should all be doing this!", "link": "facebook.com/groups/1373361046396315/permalink/2203659883366423/", "likes": 7, "comments": [{"username": "Andrea Herbold K.", "comment_text": "I was just watching the videos on Instagram. She's a hero! Love it!\nhttps://\ninstagram.com/\ncittadininondist\nratti"}, {"username": "Kati Tor", "comment_text": "Attenzione pickpocket!"}]}, {"id": "2203660133366398", "text": "Lake Como & Lake District\nAfter some advice please. Heading to Italy in july/august 24. We haven't been to the lakes area & wish to go. Lake Como is what we were thinking but after seeing the massive crowds this year, could anyone suggest an alternative? One of the other lakes or a lesser know town on Lake Como but still picturesque & accessible to sight seeing. Many thanks", "link": "facebook.com/groups/1373361046396315/permalink/2203660133366398/", "likes": 8, "comments": [{"username": "Simone Pfenninger", "comment_text": "Lago di Como: Domaso in the north with ferry access to other places\nLago d'Orta\nLago Iseo\nLago di Garda: Salo"}, {"username": "Theodore Meyer", "comment_text": "Lake Garda"}, {"username": "Alice Engstrom", "comment_text": "Hotel Olivedo I. Varenna"}, {"username": "Marianne Hendriks", "comment_text": "Lake District is in the UK."}, {"username": "Toni Williams", "comment_text": "Lake como is around 160km long. There are so many beautiful places to explore. For some reason people are only interested in seeing bellagio. It’s lovely, but not the only place to see!"}, {"username": "Sandra Mueller-Hofner", "comment_text": "Go to Lago di Garda and there to the Westcost. Not crowded, not so expensive and so beautiful. I recommend Gargnano, Gardone Riviera and salo!"}, {"username": "Ryan Monahan", "comment_text": "We just spent 4 days at Lake Garda and absolutely loved it."}, {"username": "Beth Spiehler Selvia", "comment_text": "Tremezzo"}, {"username": "Mel Peci", "comment_text": "Lenno, and Menaggio both great towns on Lake Como. Less tourists than most of the others and beautiful towns. Both have ferry stops."}, {"username": "Colleen Corner", "comment_text": "Lake Maggiore is absolutely beautiful. Stay is Stresa. Lovely little town"}, {"username": "Marilene Sagaz Lanza", "comment_text": "Lago Lugano. Já fica do lado suíço. E lindo e tem um passeio de barco lindo."}, {"username": "Tina Petraglia", "comment_text": "Come to Lake Ceresio (aka, Lago di Lugano)! I’m from Pittsburgh, but live in Valsolda, Italy, on Lake Lugano, about 4 km from the Swiss border. We are about 20 minutes from Menaggio, a popular tourist destination on Lake Como, so you could find an AirBnB in Valsolda (for less money and practically no crowds) and travel by bus or rental car to Lake Como and even visit the Swiss city of Lugano."}, {"username": "Toni Marie", "comment_text": "Lake maggiore is nice"}, {"username": "Claire Dowson", "comment_text": "We stayed in Lierna. Was a ten minute train ride to Varenna. Boat from there to Bellagio and the west side. Trains not busy."}, {"username": "Kimberly Bos", "comment_text": "We just got back from Lake Iseo. It was just gorgeous and very affordable."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Lake Maggiore (Stresa and Isole Borromee), lake Garda and La ke d’Orta."}, {"username": "Rosemary Barbetta", "comment_text": "Garda"}, {"username": "Suzanne Mills", "comment_text": "Lake Garda. Malcesine or Limone. Not Riva or Sermione."}, {"username": "Rose Stolarek", "comment_text": "We stayed at Lake Lugano , was fantastic. We have also stayed on Lake Como at Varenna and that was wonderful and not busy .You can stay at other towns on Lake Como or even Lago Di Garda , Lago Maggiore"}, {"username": "Rosslyn Patience", "comment_text": "Can you still just turn up and buy a ticket at the villas on the lake at Como."}, {"username": "Tracy McKean", "comment_text": "I agrée with Stressa on Maggiore. If you get a chance go to Lake Orta for lunch and a visit to the island."}, {"username": "Mar Iposa", "comment_text": "We chose to go to Lake Lugano in Switzerland for this reason and loved it! Beautiful area with a small beach and you can rent a paddle boat. Food was delicious!"}, {"username": "Debbie Reed", "comment_text": "Another vote for Lake Maggiore! Base yourself in beautiful Stresa, so much to see and do. The Borromean Islands are a must visit via the local ferry. Do not miss the white peacocks on Isola Bella!"}, {"username": "Mark Spielman", "comment_text": "Lago Maggiore from Stresa to Ascona is hard to beat. The Ciento Valley is so close."}, {"username": "Clelia Minucci", "comment_text": "Vico lake. Is small and not crowed. Is near Roma, bolsena lake and bracciano lake."}, {"username": "Elaine Catino Tsangarides", "comment_text": "We stayed in como in late may. Met a couple who stayed a much lesser known town and found the ferry schedule was not as frequent for their town which they felt was a mistake. Bellagio is the most crowded but best located for ferry schedules ( shorter rides etc). Como was less crowded and a bit of a lovely surprise w good ferry schedules but longer to to places like Varenna."}, {"username": "Barbara Marie", "comment_text": "Going to stresa in lake maggiore. Beautiful and significantly less a night than lake como"}, {"username": "Blanca Gil", "comment_text": "I love Varenna. Last summer, we spent 4 nights in Varenna. You can ferry to other towns. There is a beach area, lots of restaurants, some shops, train station is nearby."}, {"username": "Laura Pugsley", "comment_text": "Just travelling back from a wonderful week in Lake Garda. We stayed in Riva del Garda and didn’t find it crowded at all and heaps to do. Visited limone, malcesine (both easily accessible by boat, bus and car) and Sirminone. All absolutely beautiful but sirmione v crowded but worth visiting we so different to the other towns."}, {"username": "Marian Van Soelen Hand", "comment_text": "We are here now at Villa Belvedere in Argegno and it is lovely! Went to Tremezzo yesterday for lunch at the Grand Hotel Tremezzo and ate on their patio and loved it! Argegno is small and very quiet. Tremezzo was busier but still wonderful. Stay away from Bellagio - it was a nightmare with crowds."}, {"username": "Renae Larcus", "comment_text": "Lake Garda is bigger so the crowds may be more spread out. We stayed in Sirmione. Loved it. In Lake Como we stayed in Varenna"}, {"username": "Temponi Luca", "comment_text": "Lake Garda is still the best and from there you can go to Verona and to Brescia that is a NOT known city ( where i m from ) with a roman temple and domus and a fantastic castle!\nAnd from garda lake you can move to all italy!"}, {"username": "Gianna Onesi", "comment_text": "If your in that vicinity you should go see Bellagio!"}, {"username": "Glenn Todd Webb", "comment_text": "I was there in June. It wasn’t like the recent photos in Italian papers but July and august are the most crowded.\nStay in Tremezzo on West Bank. You will be right next to villa Carlotta and villa Balbianello and can take the ferry to Bellagio to villa Melzi.\n\nWe loved Stressa on lake Maggiore. Much less crowded and palazzo Borromeo and palazzo Madre are the best."}, {"username": "Stefano Bressanelli", "comment_text": "Lago Maggiore / lago d'Orta (Amazing!)/ Lago d'Iseo/ Varese and its lakes and valleys.."}, {"username": "Bea Kuckens", "comment_text": "Opting for Lake Garda you could stay in Verona. From there Venice is only an hour by train, also."}, {"username": "Michelle Dougherty", "comment_text": "My kids always ask to go to Como. I still don't understand why.\nWe live ON Garda. It is bigger, beautiful and not nearly as crowded but still plenty of fun!"}, {"username": "Alice Francesca", "comment_text": "I would just pick another month.June or september.July and August all the lakes and cities and beaches will be overcrowded..it\ns peak touristic season and Italians go on vacation en masse in August.I lived on Lake Garda and july and august is impossible.(esp\necially august)."}, {"username": "Sarah Campise Hallier", "comment_text": "We just got back from Lake Como. Stayed in Moltrasio. It wasn’t crowded at all! Didn’t need reservations anywhere. The actual town of Como was a little crowded but we never waited for anything. Moltrasio was the perfect little town with a wonderful restaurant - La Baia. We loved it!! We easily caught the ferry to multiple towns over the course of three days."}, {"username": "Donna Mangone", "comment_text": "Lake Maggiore is a beautiful area. I was there September in a beautiful hotel."}, {"username": "Michela Zanni", "comment_text": "Garda and Iseo. Much better than Como"}, {"username": "Lyn Evans", "comment_text": "Love Malcesine on lake Garda and travel up mt Baldo on cable car for stunning mtn scenery. Also visit Limone and Riva del garda from there. Sirmione is wonderful too but a bit busier than Malcesine."}, {"username": "Sara Joanne Bedford", "comment_text": "We enjoyed Malcesine in Lake Garda last year and spent a few days in beautiful Verona.\n\nThis week we have had a few days in Bergamo - hidden gem, a day trip to Brescia - both Italian cities of culture 2023 - tourists but in no way overcrowded. We’re now enjoying a week at Riva di Solto on Lake Iseo - much quieter than Garda and Como 😊"}, {"username": "Marilyn Baron", "comment_text": "I love Bellagio. You can take a ferry around the lake and get off on any stop to sightsee. I’ve been twice and stayed once in Menaggio and once in Bellagio and loved Bellagio. I didn’t like the other lakes as much. Lake Como is the most beautiful place."}, {"username": "Etschi Bruckner", "comment_text": "All the other lakes are less touristy and more authentic - and even on lake Como I know a lovely place - even with a little beach - where it´s great. just avoid the places that get mentioned frequently!"}, {"username": "John Selvaggio", "comment_text": "Try the hotel Villa Flori in Cernobbio on Lake Como, less crowded than other towns but nearby and beautiful"}, {"username": "Isabella Banfi", "comment_text": "I’m from Como, I would suggest you to go on the Lecco side of the lake to avoid the crowds. Orrido di Bellano, Varenna, even Lecco are beautiful! Otherwise, I would recommend to visit some of the villas like Villa del Balbianello, Villa Carlotta or Villa Monastero, booking the ticket in advance on their website. They’re beautiful historical palaces and they have amazing views on the lake. Avoid the most touristic places like Bellagio! Unfortunately July and August are not the best months to visit Italy as Italians themselves have annual leave in those months 🥲"}]}, {"id": "2203660320033046", "text": "Hi does anyone know about e-bike self guided tours? Approx 5 to 7 days. There will be 4 of us in our 50’s - we are all fit and healthy. Where would you recommend to do a self guided e-bike tour (happy to doआणखी lots of km in a day stopping along the way) where there are lots of towns/villages, cafes, wineries, things to stop and look at along the way with beautiful scenery? And why would you choose this ? area? Thank you 🙏", "link": "facebook.com/groups/1373361046396315/permalink/2203660320033046/", "likes": 1, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2203662563366155", "text": "Hello,\nPlease help!!\nWanting to travel Italy next year.\nWhat is the best time of the year and what do you all recommend as a tour for a family of 4 with 2 kids aged 10 and 12. We are thinking a trafalgar tour.\nThanks in advance", "link": "facebook.com/groups/1373361046396315/permalink/2203662563366155/", "likes": 0, "comments": [{"username": "Chiara Normanno", "comment_text": "Best times are early autumn/early spring"}]}, {"id": "2203667036699041", "text": "Where is the best area/hotels to stay in Naples, Italy?", "link": "facebook.com/groups/1373361046396315/permalink/2203667036699041/", "likes": 1, "comments": [{"username": "Michael Butts", "comment_text": "My wife and I recently stayed three nights in Naples at Hotel Piazza Bellini. Great hotel and experience and will definitely stay here next time we are in Naples."}, {"username": "Hermineh Topalian", "comment_text": "See this hotel cheap and best"}, {"username": "Denise Diaz Costantino", "comment_text": "Has anyone stayed at the Grand Hotel Parkers in Chiara?"}, {"username": "Sabrina Lafferty", "comment_text": "We just stayed at boutique hotel Santa Chiara right on the spacca Napoli was great in every way ."}, {"username": "Virgz Van Møøre", "comment_text": "Napolart bnb"}, {"username": "Genevieve Bastien", "comment_text": "Daily Napoli / Napoli tree in Chiaia was great. There with our kids. Hosts were super helpful and nice"}, {"username": "Philip Curnow", "comment_text": "Maybe Vomero"}, {"username": "Cynthia McDonald", "comment_text": "Stay at bb niapollis bellini near piazza Dante. Great central location!"}]}, {"id": "2203674656698279", "text": "Looking to book the Vatican and Colloseum fast track tickets without the tour but most seem to just offer tours as well which we dont want to do. Anyone have any good sites that just offer entrance", "link": "facebook.com/groups/1373361046396315/permalink/2203674656698279/", "likes": 2, "comments": [{"username": "Lorraine Hender-Dennert", "comment_text": "Following"}, {"username": "Shen Min Chue", "comment_text": "Get tickets from their official sites"}, {"username": "Mike Crawford", "comment_text": "Depending on when you are trying to go, to these sites.\nThe Vatican will open up the days, 2 months prior to your date, late afternoon in the US, 5pm (MST) and the Colosseum is 30 days at 9am local italian time, 2am (MST).\nWe booked through offical sites."}, {"username": "Philip Curnow", "comment_text": "It's a real problem getting a simple entrance ticket to both places. The international OTAs buy everything up front and then resell, and upsell (guided tour, skip queue etc). The Rome authorities are aware of this. Opposite the Colosseum near the metro station is an official Rome tourist point. Ask them when you get there. And never buy or interact with hawkers offering tickets/help."}, {"username": "Karen Gregorchuk", "comment_text": "What is the official site for Vatican?"}]}, {"id": "2203676820031396", "text": "We are headed to Naples on a cruise ship. I am not interested in any of the excursions offered through the ship. I am thinking of a Pompei or Hercularium tour, but would like to avoid the cameo factory. I am thinking of going it on our own. Has anyone used a tour company just on the dock? I have also thought of a catamaran so we can get out on the water and see the pretty. There maybe time for both. Any advice?", "link": "facebook.com/groups/1373361046396315/permalink/2203676820031396/", "likes": 0, "comments": [{"username": "Dafne Vassetti", "comment_text": "You can get a private tour and strongly recommend Ercolano!"}, {"username": "Max Sorber", "comment_text": "https://\nwww.toursbylocal\ns.com/\nshoreexcursion"}, {"username": "Max Sorber", "comment_text": "https://\nwww.whatsinport.\ncom/"}, {"username": "Max Sorber", "comment_text": "We took taxi to train station\nTook by Local train to Pompeii then hopped local train again to Sorrento\nHad lunch\nThen took hydrofoil back to dock in Naples\nOur cruise ship was on same dock as hydrofoil"}, {"username": "D'Anna Hohe", "comment_text": "Herculano was great. Take a taxi. Find from Pompeii are at the archeological museum. Also worth a visit in Naples."}]}, {"id": "2203680123364399", "text": "I have a question about medical services. I’ve heard Italy has free medical care for tourists. I was going to buy medical insurance for us, because my husband has had a heart attack which created heart failure. It’s been almost 3 years and he is doing great. He also has a defibrillator, so he has his own personal paramedic on board. Lol. ￼he willआणखी need to bring a months worth of his medication’s which I was going to put in pill organizers. Do we have to have the prescription bottles with us traveling from the U.S? So two part question. I just need facts. Or where I can get the answers ❤️ . Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2203680123364399/", "likes": 0, "comments": [{"username": "Karen Baxter", "comment_text": "Mine all come in blister packs in boxes and I carry what I need without the boxes but I do carry a copy of my prescription to show that they are all prescribed to me. It’s way too many boxes to carry them all and I would never travel without the insurance. I hope you both have a lovely holiday 😊"}, {"username": "Michael Weniger", "comment_text": "TSA guidelines on prescription medication.\n\nhttps://\nwww.tsa.gov/\ntravel/\ntravel-tips/\ncan-you-pack-you\nr-meds-pill-cas\ne-and-more-ques\ntions-answered"}]}, {"id": "2203697243362687", "text": "Generally speaking when it says pools being open is seasonal, when does the season end?", "link": "facebook.com/groups/1373361046396315/permalink/2203697243362687/", "likes": 0, "comments": [{"username": "Emma Basilico", "comment_text": "Usually june to first weeks of september"}]}, {"id": "2203701003362311", "text": "Hi, just wondering if there is a tour company that takes travellers from Venice to Cortina and takes care of ski lessons, equipment plus clothing, ski lift passes etc. family of four, three are beginners it would be wonderful if we could have someone help us with clothing, equipment and have lessons organised. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2203701003362311/", "likes": 0, "comments": []}, {"id": "2203700486695696", "text": "Will be arriving on a cruise ship to Ravenna. Should I stay and explore Ravenna? I know there was a monumental flood there so wonder how much can be seen, or should I take a bus excursion to Bologna instead? And can anyone provide info on how long a nonstop bus trip would take to get from Ravenna to Bologna? Hoping to do a food tour there if the bus trip is only an hour. If longer, will miss tour start time", "link": "facebook.com/groups/1373361046396315/permalink/2203700486695696/", "likes": 1, "comments": [{"username": "Manuela Bassetti", "comment_text": "The flood in June didn’t touch the city of Ravenna but only the countryside. You can visit the entire city in a day, it’s really small. The trip to Bologna by car takes an hour, by bus it’s probably an hour and half, there’s also a regional train that takes an hour and half."}, {"username": "Miyuki Kanno Paul", "comment_text": "Ravenna is worth staying for UNESCO sites"}, {"username": "Alice Francesca", "comment_text": "Ravenna is a town so rich in history! Once capital of the Western Roman Empire! Dante is buried there!\nhttps://\nfullsuitcase.com\n/\nravenna-best-thi\nngs-to-do/"}, {"username": "Molly Roberts Siegenthaler", "comment_text": "Some of the most exquisite Byzantine mosaics can be found in Ravenna. It is one of the jewels of Italy and should not be missed!"}, {"username": "Shannon Madison", "comment_text": "Ravenna is a cute town but you don’t need more than a day to explore it"}, {"username": "Pietro Adami", "comment_text": "Ravenna is worth a full day at least. For dinner or lunch get a taxi to Marina di Ravenna to the “Trattoria Cubana da Irma e Pino”, despite the “Cuba” reference, excellent local fish plates (and huge portions)"}]}, {"id": "2203705033361908", "text": "For those suggesting Sorrento as the base for a few days in Amalfi coast......what would you do if you had a dinner in Amalfi and need to get back to Sorrento around the 10pm hour? Bus? Private car? Ferries are not running that late.\nWe plan on taking a ferry there in the afternoon, meeting others who are staying in Ravello, sightseeing and then having a 7:15pm dinner with them in Amalfi. I see it is 1 hour drive back to Sorrento. Thoughts? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2203705033361908/", "likes": 9, "comments": [{"username": "Billie Begley", "comment_text": "Book a private driver."}, {"username": "Sandy Radican Shikaly", "comment_text": "Amalfi Coast Transfers... private driver"}, {"username": "Nancy Brennan Carrow", "comment_text": "Private driver"}, {"username": "Andrea Bourke", "comment_text": "1 hour at least with private driver ..we took private driver yesterday from prariano to sorrento at 6.45 am and that was 45 minutes with little traffic and almalfi further away"}, {"username": "Terina Kwiatkowski", "comment_text": "￼ personally I would stay in Amalfi it’s so close to everything there’s tons of hotels and Airbnb‘s renting a scooter is a great option or having a taxi or a driver! Buses have been very delayed and full of people!￼￼"}, {"username": "Starla Dawn", "comment_text": "Private driver 💯"}, {"username": "Starla Dawn", "comment_text": "I loved basing in Sorrento fyi"}, {"username": "Doris Callender", "comment_text": "Definitely book a private driver, it’s worth every penny. We used the company listed below for our entire trip. They are fabulous! Hope you have a great trip. 🍋\n\nSorrento Scialone Travel"}, {"username": "Jeff McLellan", "comment_text": "Private driver 100%"}, {"username": "Diana Sideris", "comment_text": "We did a taxi back from Positano last week ( 10pm) to Sorrento and they charged us 150 euro . I will assume it will be much more as Amalfi is further away . When I inquired on private driver it was more then the taxis"}, {"username": "Joe Esposito Sr", "comment_text": "Use Positano Car Service. Excellent!"}, {"username": "Shelagh Kosinski", "comment_text": "We used a private driver"}, {"username": "Elizabeth Comeau Farnham", "comment_text": "Sorrento Choice is amazing!!!"}, {"username": "Genoveva Mora", "comment_text": "Call Gaetano Franza\nGreat local driver .\n\n+39 339 7909294"}, {"username": "Carmen Zervigon Everett", "comment_text": "What is the latest s ferries run from Amalfi to Sorrento or to Capri? Would be May."}, {"username": "Maria Coladangelo Ducca", "comment_text": "Get privatevdriver.\nSorrento is wonderful .. it is worth it"}, {"username": "Rose Giancaspro Gadaleta", "comment_text": "Thank you everyone!"}]}, {"id": "2203706293361782", "text": "Who has everyone used for planning (flights, hotels, trains, and excursions). I want a semi guided trip but also want some free time with my family tour guide free. Looking to start in Venice and work our way down, ending in Rome. Definitely want some coastal towns in the mix for beach days. Hoping this is about 10/11 days. I have seen many of these websites online but want to hear from people who have actually used them or a travel agent you used and loved.\n\n***My mom will be 75 on this trip so planned transportation is a must\n\nThanks!!!", "link": "facebook.com/groups/1373361046396315/permalink/2203706293361782/", "likes": 5, "comments": [{"username": "Matt-Kathy Stavely", "comment_text": "We are going to use Globus independent in September. It is a private tour with hotels, trains, half-day tours in each city, and English speaking host provided. Then the rest of the time is on our own. They only go to the main bigger cities.￼"}, {"username": "Bill Casper", "comment_text": "Download TRIPIT as it gets linked to your email. Has all my flights, accommodations,\ntrain rides, etc."}, {"username": "Bea Kuckens", "comment_text": "We plan and book everything ourselves directly with airlines, lodging and sites. We usually use Trainline to book train tickets. That way we are assured that lodging, transportation and activities are exactly what we want. If we want a guide, we just do a specific tour for a day or part of it. Regardless of planned transportation,\nthe old city centers are vehicle-free and cobblestone, so make sure that will work for your mom. Some places (like Rome) offer golf cart tours that will get her closer to sites without much walking."}, {"username": "Starla Dawn", "comment_text": "Booked it all myself. Went last month. Decided to go 2 months prior. Everything worked out perfectly. And I’m not a natural born planner by any means.\n\nBest tip: check addresses of places/things you want to do and book stays close by.\n\nAlso private drivers are the way to have a relaxing vacay."}, {"username": "Stacy Derouin", "comment_text": "Once we identified where we wanted to visit, we used a travel agent to help us find hotel reservations as well as the private tour times and places we wanted. He also gave us tons of recommendations\nfor things to do/visit in our down time. We found a TA really helpful in decreasing our stress!"}, {"username": "Gina Spyker Fairfield", "comment_text": "We used our regular travel agent, She Plans Travel Co. Renee Cross, Travel Advisor. I gave her a list of areas/\nthings we wanted to see and do, and she planned our perfect custom itinerary. It included some small group tours, private tours, hotels, trains, private drivers, and recommendations for dining, additional things to do on our own, etc."}, {"username": "Katie Ehlers", "comment_text": "LuxTravel Katie"}, {"username": "Brenda May Schindler", "comment_text": "Following. Has anyone used tripmaster.com? This was recommended but never heard of it!"}, {"username": "Liz Anne", "comment_text": "We used Costco. They are very flexible and organized flights, transfers, hotels, and trains between cities. All I had to do was book tours."}, {"username": "Patty Stadulis-Hagan", "comment_text": "Patty's Life Without Regrets Travel. Would love to help!"}, {"username": "Cindy Morgan Schmoe", "comment_text": "Stay away from Expedia."}, {"username": "Michele Saletros", "comment_text": "…"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Do your research for hotels in Venice. Look for ones near an Alilaguna/\nvaporetto stop with no bridges to cross or a hotel that has a window where a private water taxi from the airport can drop you right at your hotel."}, {"username": "Usha Lalwani", "comment_text": "I would highly recommend Nyssa from Click and Trip ."}, {"username": "Diane Pieri Adiliano", "comment_text": "Booked it all myself."}, {"username": "Julie Koenig Cooper", "comment_text": "We used AAA to plan our trip!"}, {"username": "Jennifer Ann Taylor", "comment_text": "TripMasters!!"}, {"username": "Lisa Bair DeMola", "comment_text": "We booked through Costco, the travel agent was exceptional with helping us customize our trip. The included car service picks you up at airport as well as transfers you between locations.\nI’d also recommend private tour guides, I’m trying to find the company we used, I believe they were students/or employed in art or history related fields. It was so much nicer to tour at our own pace and not struggle to hear in a larger group."}, {"username": "Nancy Matheny", "comment_text": "Christina Ricci-Campagnon\ne"}, {"username": "Kim Catania", "comment_text": "Enchanting Travels- Derek Krantz- worked w us to plan an amazing custom trip for us."}]}, {"id": "2203707010028377", "text": "Anyone stayed at Hotel Golden in Rome? Any feedback? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2203707010028377/", "likes": 0, "comments": []}, {"id": "2203710086694736", "text": "We will be in Venice at the end of July (2024) and I’m looking for hotel recommendations. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2203710086694736/", "likes": 2, "comments": [{"username": "Cinzia Berletti", "comment_text": "Hotel dei Mori"}, {"username": "Renae Larcus", "comment_text": "Hotel A La Commedia. Near the Grand Canal. Lovely."}, {"username": "Brian Delvecchio", "comment_text": "Hyatt on Murano island"}, {"username": "Linda Boyle", "comment_text": "Hotel Al Ponte Mocenigo San Polo"}, {"username": "Dave Colleen", "comment_text": "Hotel Moresco. They gave us a welcome gift, bottle of Prosecco, right on the canal, 10 minute walk to train, happy hour food every evening, and breakfast included. Room was nice and nice good size bathroom. To top it off the staff was great!"}, {"username": "Frances Scannapieco", "comment_text": "Hotel Al Ponte Antico, Venezia. On the Grand Canal. Fabulous"}]}, {"id": "2203718646693880", "text": "Does anyone know of beach clubs in sorrento positano or amalfi that I can serve beach chairs online? Traveling there In a few weeks and don’t want to wing it. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2203718646693880/", "likes": 0, "comments": []}, {"id": "2203736166692128", "text": "Best restaurants to book for a nice dinner. Doing 1 reservation per place in Rome, Florence and Venice. Rome will be our wedding anniversary and we’re on our honeymoon. Also best rooftop bars with a nice view in each. Thanks so much! This group has been amazing.", "link": "facebook.com/groups/1373361046396315/permalink/2203736166692128/", "likes": 1, "comments": [{"username": "Alice Francesca", "comment_text": "Eitch Borromini rooftop bar overlooking Piazza Navona has no equal (Rome) ..it s an upscale restaurant too\nAlso: Hotel de Russie, Stavinskji bar and restaurant.A hidden garden in the center of Rome.\nCheck them online"}, {"username": "Marc Rosenfeld", "comment_text": "Acqua Al 2 in Florence. Excellent!!!"}, {"username": "Dana Talusani", "comment_text": "Il Latini in Florence! Also, the Westin hotel has a great rooftop bar with incredibly views of the city."}, {"username": "Pat Cray", "comment_text": "The Kraft Hotel in ￼ Florence has a Wonderful rooftop restaurant and bar beautiful view!"}, {"username": "Andrea MacDonald Milham", "comment_text": "Following! We will be in all of these cities next summer and would love recommendations\n!!"}, {"username": "Kathy Davenport", "comment_text": "We loved Florence, Venice, Rome, Sorrento, Amalfi Coast, Positano and Tuscany!!"}, {"username": "Chantal Corneau", "comment_text": "Maïté Riel"}]}, {"id": "2203739630025115", "text": "We will be in Italy next week. We will be driving through parts of Tuscany. What do you suggest we do with our bags? I’m terrified to leave them in the car(in the trunk not visible). I have 3 kids so carrying them all day isn’t an option. We will be in Orvieto, Pisa and Lucca. Is there secure parking? Do we store them somewhere? Leave someone with the car?", "link": "facebook.com/groups/1373361046396315/permalink/2203739630025115/", "likes": 25, "comments": [{"username": "Lynnie Silverman", "comment_text": "Skip Pisa"}, {"username": "Caroline Linton", "comment_text": "Janice Carbone 🚗"}, {"username": "April Nowobielski Marron", "comment_text": "We ran into this in Costa Rica. We tried to never leave anything in the car, but sometimes it was unavoidable. What we did was when we'd leave one destination, we'd pack everything in the back (it was an SUV) and then use a bike lock to lock all of the stuff together and we latched that to the inside of the car. Make sure you have dark colored suitcases or a blanket if you end up with an SUV. When we got to where we were going, we never went near the back of the car or gave any indication there was stuff in the back."}, {"username": "Anita Clayton", "comment_text": "From some posts on here I don't understand why anyone of a nervous disposition would visit Italy as it's made out to be sone crime ridden ghetto not the beautiful country that it is."}, {"username": "Maria Helms Mosca", "comment_text": "So for those suggesting a storage place, curious how that works? And how is that really safer than just leaving your stuff (obviously don’t rummage through it when you get out and make sure it’s covered, etc)? The stuff is being stored specifically where everyone knows you’re leaving it there…..how are items secured, guarded, etc at the storage places? I do a good bit of traveling, both abroad and domestic and I’ve really never felt like my belongings were more unsafe than right here in the US. 🤷🏼‍♀️"}, {"username": "Marie Payne", "comment_text": "Pisa isn't worth it...skip it...gypsies are known to frequent there ..."}, {"username": "Frannie Kaplan", "comment_text": "Hey, pisa is skippable IMO, but to answer your question will you not be sleeping anywhere? Normally they let you leave your luggage in reception both before and after your check-in/check out. It sounds daft but the easiest option is to break up your belongings and hide them in separate parts of the car where not visible including under the car seats..you can also leave only clothes with a photocopy of your ID inside and bring your more valuable stuff on your person"}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "We just drove on Tuscany this weekend. Left bags in trunk. Nothing visible. No problems."}, {"username": "Louise Faggioni", "comment_text": "Arriving in Pisa with luggage from train…isn’t there a storage unit there & can I get it without App?"}, {"username": "Jen Alexitch Rachow", "comment_text": "They have alarms you can get for hotel doors I wonder if they could be rigged to cars or if they have portable alarms for cars? Worth checking out."}, {"username": "Nancy Day", "comment_text": "If you can look in vehicle and see any luggage don't leave car unattended"}, {"username": "Kylie Bull", "comment_text": "Do hire cars have alarms?"}, {"username": "Desiree Dube", "comment_text": "Pisa has luggage storage at the train station (I think 5 euro per bag for full day) and if you just have smaller bags I’d recommend StowYourBags near the train station as well (pay by the hour)."}, {"username": "Jocelyn Marquez", "comment_text": "I got pickpocketed on a public bus to the Leaning Tower of Pisa. It can happen to you. They target tourists."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "I wrote a post about Pisa in this group around the 12 July where I wrote a walking itinerary that takes you to the Tower through the nice area and not the roads where one-hour tourists pass and all the scammers are.\nThe itinerary starts from the railway station but just in front of the railway station there is an underground park in Piazza Vittorio Emanuele (not the cheapest park unfortunately) where I find very difficult to imagine robberies (in any case leave nothing visible!) Then you can walk twenty minutes and reach the Tower in all safety.\nThe problem is that everyone tries to see the tower in ten minutes and they all park really near it where all the scammer are: if you watch a map the Tower is not in the city center (where the river is) but it’s on a side (long story behind this position) just near a very cheap suburb.\nThe walking itinerary goes from Piazza Vittorio Emanuele to Keith Haring murales (fun for the kids), Corso Italia, you cross the river, Borgo Stretto, Piazza dei Cavalieri and the Tower (it’s 3/4 minutes longer than the shortest road but you will only walk in nice roads full of shops and things to see)."}, {"username": "Jenny Payne", "comment_text": "Myself I would always have a base and go off by train, as it’s not worth the risk for me and I go to Italy twice a year ,so far been very lucky haven’t been targeted as I for one blend in and my clothes are very Italian clothing, no caps, flip flops, young ones seem to wear what’s in fashion , most Italians wear linen ,cotton pants & shirts or t shirts, look at Pinterest that tells you a lot🌻"}, {"username": "Annette Tamminga", "comment_text": "I wonder why someone found this funny? Store your luggage at a locker facility."}, {"username": "April McDill Steele", "comment_text": "You’ll be fine in Orvieto and Lucca. Not sure about Pisa"}, {"username": "Gracy Grace", "comment_text": "Been once — it’s enough for a lifetime!!!"}, {"username": "Gracy Grace", "comment_text": "Italy in general isn’t safe especially Rome ! But Budapest and Prague weren’t better either. Creepy-looking people lurking everywhere after 6 pm. We were almost robbed in the public train while on our way to Vatican in B-road day light. Don’t trust Naples either — just too dangerous after 6 pm. I live in Europe and I don’t trust staying out after dark in Rome and for Eastern cities."}, {"username": "Martha Hughes", "comment_text": "We have traveled a few times in a car for a month with suitcases and other goodies in the trunk. Here is what we have always done: after out of sight from the rental agency, removed all stickers on the exterior of the car; threw water and dirt on the car; tossed empty bottles, crinkled new papers, kids soccer balls or what ever toy or ball we could buy that was cheap in the car where it could be seen along with anything else we thought would like we were not worth robbing; and parked with our trunk firmly against a tree or wall."}, {"username": "Crystal Angersola", "comment_text": "My Italian boyfriend + I had all of our belongings stolen from his car in Pisa. They were in the locked trunk. Thank God we had our passports and valuables with us."}, {"username": "Micaela Codi", "comment_text": "Just dont park where a tourist would park… spot a “business area” and blend in with all the cars of people who go to work. Have your belongings in the car trunk (maybe keep the valuables in a backpack always on you), and after parking the car do not even consider opening the trunk. Just pretend there’s nothing there and lock the car. Any bigger parking would have security cameras, so just don’t park it on the road.\n\nYou can Google for “Parcheggio sorvegliato” on Google maps. It’s parkings with guardians and cameras.\n\nLeave the inside of the car a bit dirty and untidy (empty water bottle, maybe a sweatshirt, paper tissues).\n\nNo sense to park with your trunk against tree or wall, if they rob you they will break the glass, they usually don’t force the locks."}, {"username": "Brian Sturkie", "comment_text": "Most crime is opportunistic. Make it difficult. We brought a long cable bike lock. We lock our suitcases together when not with them. I always back into parking spots when possible that make it hard to open the trunk."}, {"username": "Linda Tibbles", "comment_text": "Look up online, luggage store sites."}, {"username": "Jennifer Gadaleta", "comment_text": "I have downloaded an app for storing luggage ext, it's called Stasher"}, {"username": "Abigail Lippmann", "comment_text": "How about leaving your bags in a lift car in Pompeii? We won’t have the option to leave them at the train station as we are going onto Amalfi."}, {"username": "Teresa Hoffman", "comment_text": "I felt unsafe in Pisa. The gypsies were bold!"}, {"username": "Mariann Sam", "comment_text": "Thanks for the heads up."}, {"username": "Sandra Kadlick", "comment_text": "What is best fora cell phone in Italy, new SIM card in your smart phone or new cheap phone? From Canada"}, {"username": "Alex Whitcombe", "comment_text": "We just did all of those towns last week and didn’t have any problems at all."}, {"username": "Jeff McLellan", "comment_text": "Sadly the trunk is where pretty much everyone who would want to steal your bags will assume they are. Do your best to park somewhere where there is activity. Personally when I am in a similar position I will drop my family off somewhere so that when I park it is just me getting out of the car and I never open the trunk. Have never had an issue even in areas where I likely should have LOL. We had a van with a driver, in Pisa there were a lot of sketchy looking people milling about so we were glad to have a driver to stay with our bags."}, {"username": "Miyuki Kanno Paul", "comment_text": "You should be worried. If anything is visible from the outside while parked, your car becomes a prime target."}, {"username": "Laura DeCicco", "comment_text": "We stored out luggage in Lucca. If you get the Bounce app or the Stasher app you can look for luggage storage nearby."}, {"username": "Alice Francesca", "comment_text": "Don't waste much time in Pisa.just 1 hour to look at the toner and leave.Siena is a must see."}, {"username": "Laura Uribe", "comment_text": "As long as they are not visible, I think you’re fine. We haven’t had to leave ours but our trunk has never been broken into in the many times we have visited Italy."}, {"username": "Judy Jamieson Pisano", "comment_text": "Don’t worry about leaving bags in the car, especially if they can’t be seen. We do this all the time and never had an issue. Just make sure your car is locked."}, {"username": "JeriLynne Clifford", "comment_text": "I know this might sound silly, but as the former wife of a police officer, back into a parking space, if possible. If it’s dark, park by a street light. ￼Don’t leave things in the car that scream I am a tourist."}, {"username": "Matteo Basile", "comment_text": "These places are quite safe you can stress less and leave in the car just avoid to leave high value objects inside"}, {"username": "Brian Johnson", "comment_text": "Leave them. It’s fine"}, {"username": "Michelle Murphy Margolati", "comment_text": "Anonymous,I understand. Lately I have had men, \"scammers\" asking to be friends or making comments that I have no intention of answering."}, {"username": "Pam Gerretsen", "comment_text": "Orvieto has parking near St Patrick's well, it's paid parking, in a busy area."}, {"username": "Lauren Swanteck Myler", "comment_text": "Download the app Bounce. Someone posted about it the other day. You can search to see if the towns have storage lockers. I searched Lucca and they do. Good luck."}, {"username": "Lauren Swanteck Myler", "comment_text": "Lauren Swanteck Myler"}, {"username": "Michela Zanni", "comment_text": "Look for a cover parking"}, {"username": "Stefano Zordan", "comment_text": "It might come as a surprise but…\n\nI’m Italian living in Italia, my family is 4 of us.\nWe do travel and have holidays in Italia, sounds weird I know but we do.\nNever thought about our luggage in the car boot, apart for the normal common sense of not leaving things on sight, which I believe applies for every traveler in every country so…\nSorry but I don’t have any helpful suggestion"}, {"username": "D'Anna Hohe", "comment_text": "Question for the Italians in the group. Does anyone know if rental cars in Italy are easily identified as such - ie special plates, certain number series, etc.\nThis was once a problem in the US because anyone looking at the plate could tell it was a rental.\nWhen we lived in Rome we heard about cars being broken into at some tourist locations, but it wasn’t clear if it was random or targeted in some way.\nIf a rental car can be identified in some way, then it would seem that the only option would be to store bags elsewhere because no amount of common sense precautions would help."}, {"username": "Amy So", "comment_text": "You have to do what you have to do. Lucca and Orvieto should be okay. Just to go paid parking lot and you really should be fine. I would put an AirTag in the luggages and try not to get anything out of the trunk when you park so no one sees that you have your luggages in there. Have fun. I love all the places but Orivieto to Pisa is a good 3 hours drive. Where are you staying? Maybe consider staying in Orvieto for a couple of nights and Lucca for another 2?"}, {"username": "Jodi Homes", "comment_text": "Be VERY cautious in Pisa. Not worth taking the time to visit compared to other areas. Only place we felt unsafe was by the Tower. A gang (gypsy type) surrounded us & wanted my husbands watch & our iPhones. It was terrifying for our children. Very gritty & sketchy IMO first hand opinion. I would just skip Pisa"}, {"username": "Carol Ryan", "comment_text": "I dont blame people posting anonymously, probably because of all the 'Karens' who give such nasty replies."}, {"username": "Ken Lerch", "comment_text": "in each of those towns, check to see if the train stations have luggage storage. But even if they do, pack in such a way that any important docs always stay with you such as passports, prescriptions, a few days of meds, electronics, etc. Suitcases should be safe in the trunk but be careful not to be seen rummaging through suitcases in trunk in public. (It's the same advice to never count your money in public). Should they be stolen, it's only clothes. An additional piece of equipment to consider (out of paranoia) is to get a piece of aircraft cable with loops at each end, maybe 6' and a padlock. Easily rolled up and carried in a suitcase. Most trunks will have some sort of metal loop attached to the frame. Run the cable through the suitcase handles and padlock to the inside of the trunk. We have done this on trains where we can't monitor our luggage at the end of the car: we just loop them together. One more little defense. But overall, crime is less prevalent in italy than in the U.S. Relax, breathe."}, {"username": "Joe LaLonde", "comment_text": "I was in Orvieto a few weeks ago and where I parked seemed like the main place to do so. It was multiple stories with the lower levels rather dimly lit, it’s then a series of stairs/\nelevators/\nescalators to get up into the actual town, so the garage is a bit isolated. That said, I parked on the lowest, worst lit floor and had belongings out of sight in the trunk overnight and everything was fine. I wouldn’t leave anything of tremendous value, but I’d have no worries doing it again."}]}, {"id": "2203739746691770", "text": "Can you suggest a fast train from Rome to Montererosso, Cinque Terre?", "link": "facebook.com/groups/1373361046396315/permalink/2203739746691770/", "likes": 0, "comments": [{"username": "Roland Trego", "comment_text": "There isn't one. The best you can do is just under 4 hours. https: // www . rome2rio . com/map/Rome/\nMonterosso-al-Ma\nre"}, {"username": "Philip Curnow", "comment_text": "Trains from Rome (Italo for example) all require a change in Florence to arrive in La Spezia. 4 hour 30 mins trip in all"}, {"username": "Michela Zanni", "comment_text": "No fast trains. Intercity from Roma to La Spezia then Regionale from La Spezia to Monterosso (stops also in the other villages of Cinque Terre). But it takes almost 5 hours. Check Trenitalia website for timetable"}]}, {"id": "2203739766691768", "text": "Can you suggest a fast train from Rome to Montererosso, Cinque Terre?", "link": "facebook.com/groups/1373361046396315/permalink/2203739766691768/", "likes": 0, "comments": [{"username": "Anna O'Connor", "comment_text": "Download the Trenit! App and it will give you all the options for the day you want to travel."}, {"username": "Dafne Vassetti", "comment_text": "No fast train for Monterosso. You get the fast train for La Spezia. From la Spezia you get the regional train that brings you to Monterosso."}]}, {"id": "2203747150024363", "text": "Hi\nTravelling to Rome next month , just wondering what’s best with transfers into hotel from airport . Private transfer or taxi , train . Transfer with my airline app seem quite expensive . We’ll be a family of 4 travelling .\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2203747150024363/", "likes": 0, "comments": [{"username": "Jennette Riches", "comment_text": "taxi is a flat rate of 50 Euros. If 4 people take the train into Rome and then a taxi or metro from the train station it actually works out cheaper by taxi as long as you get a larger taxi that has room for all your luggage...trave\nl light and it will be possible. the benefit of door to door service is worth the cost of a taxi and there are always plenty available."}, {"username": "Nancy Fricke Corsi", "comment_text": "You can do taxi but we really preferred private car. They will accommodate 4 and luggage. Also depends on how far you are going. Make sure when you deplane and go into the airport to have your passports ready to show policizia as they do screen also upon arrival. Rome is the largest and busiest airport in that country and is a hub to many other country connections."}]}, {"id": "2203749090024169", "text": "Someone posted that even though they had on a money belt, their valuables were stolen and they lost everything. That's just awful!\n\nSo, what are you using/wearing to ensure your valuables are safe, both men and women? I purchased two banana sling type purses with zippers on the back side, but they are not anti-slash. Money belts look bulky for my husband, but if we can find one that's less bulky, he can get one.\n\nIdeas? Tips? Suggestions?\n\nThanks!", "link": "facebook.com/groups/1373361046396315/permalink/2203749090024169/", "likes": 22, "comments": [{"username": "MaryBeth Kennedy Owen", "comment_text": "I wore a small crossbody that held a few cards, my phone and a lip color. I wore a shirt and mid skirt combo and when I’m crowds, I slipped my purse into the waistband and under my skirt. Worked perfectly!"}, {"username": "Mary Palazzolo", "comment_text": "I was very scared about this problem. I have not had any problems in Florence just be careful like you would be any city"}, {"username": "Shannon Pacheco Modin", "comment_text": "I plan on bringing very little while I am out. Leave my valuables in the hotel"}, {"username": "Marty Harte", "comment_text": "Here almost a week all over Rome. Traveled to Naples 1/2 day and been to Positano as well.\n\nI have a cross body small bag but haven’t used it once. Just keep wallet in front pocket with a backpack for water, cooling towels etc. i was nervous for me and kids reading this site but it’s been fine. Just have your wits about you and be safe."}, {"username": "Danielle Baca", "comment_text": "So sad but it happens. I always roll my eyes when people think it’s stupid when people ask about it. I have Italian family and friends in Florence and they are very well aware of this happening. The thieves almost always target tourists but do go after citizens sometimes.\n\nI wear an under the shirt money belt for my passport and credit cards when in certain areas. Like up around my bra band. In a small purse I carry a small amount of cash and hand sanitizer.\n\nJust be aware in busy areas, don’t stare at your phone. If you have to look something up stand with your back against a wall."}, {"username": "Leila Schludecker", "comment_text": "My backpack has a small pocket with zipper on the side of my back. Never had problems\n\nJust don't act too suspicious and don't carry a lot of Wörth with you"}, {"username": "Ted Allen Hart", "comment_text": "Had a younger friend in his 40s boo hoo my suggestions when he went to Italy. He lost literally everything including his luggage in less than 5 mins after he arrived to Italy and left the airport. EVERYTHING! He was too embarrassed to tell me how it happened. He's a good looking guy so I suspect the pickpocket person was an attractive woman. He still won't tell me what happened months later."}, {"username": "Beth Shetz", "comment_text": "Safety pin the bags to your body. That way if the strap is slashed the purse is still attached. Also, pin the zipper to the bag, so it can’t be easily opened. Split up your valuables. Put some money and a credit card in different zipper compartments"}, {"username": "Barbara Kistler Wilhelm", "comment_text": "Just beware. If you are on subway and someone causes a disturbance be extra cautious of belongings. Thats when they hit . They cause a commotion and you are looking around. I was a victim on the subway in Rome."}, {"username": "Brian Marcus", "comment_text": "I wore a small pack, mostly on my back, I would shift to my front when we were in crowded places. My gf looked out for me, I tried to do same for her. We weren't overly paranoid, just conscience and cautious. Common sense goes a long way. The biggest issue we experienced, I left my beloved water bottle on the train lol."}, {"username": "Cindy Frenette Pawley", "comment_text": "I had friends there last week in an Airbnb. The thieves came through the window, while they were sleeping. Took passports, money & jewelry. It’s no joke."}, {"username": "Francoise Coupal", "comment_text": "Don’t carry a lot of cash"}, {"username": "Laura Skrzynski Adams", "comment_text": "My husband bought the safe from pick pocket pants. They are on Amazon, the brand is Rhone. Very comfortable as well"}, {"username": "Susan Annette Wanta", "comment_text": "If the crossbody, anti-theft bag is visible, you are a target. Locals don’t use them. If you use a “Rick Steves” type money belt for your pp, large $$ and extra credit cards, UNDER your clothes, that is probably safe. I do carry a bag with “comforts”. But I know that it and the contents could be lost, stolen or forgotten at any time. I don’t but put any valuables there. Be aware of your travel group, (don’t let anyone fall behind alone) and your surroundings as you would in any large city, on any day of week."}, {"username": "Helen Louise", "comment_text": "I didn’t realise it was such an issue. I am from uk and have been to Italy umpteen times & have never had any problems"}, {"username": "Christine Smith- Rodriguez", "comment_text": "Robert Rodriguez"}, {"username": "Schalk Van Wyk", "comment_text": "I have shorts with zip pockets. The zips are quite difficult to open. You don’t need wads of cash - almost everybody takes contactless credit cards."}, {"username": "Barbara Brosnan", "comment_text": "I used my Lululemon belt bag all through Italy earlier this summer and had no issues. Just kept it in front of me and was aware of my surroundings. My husband and sons all used money belts under their clothes, and even my less attentive son was fine."}, {"username": "Michael Widjaja", "comment_text": "Usually I travel in winter so I got jacket and long sleeve hoodie covering my watch,I put my passport in my inner jacket pocket\n\nFor other valuables I wear money belt inside my thermal undies\n\nDepending on the place I’m visiting,I wear anything from big waterproof equipment backpack to Hermes slingbag (filled only with pocket umbrella,sungla\nsses,scarf etc)"}, {"username": "Imperia Arcidiacono", "comment_text": "I left my phone with all my cards and ID at a restaurant in Sicily and when I went back they had it in the safe for me."}, {"username": "Jennifer Walp Rydholm", "comment_text": "Ok don’t call me crazy. I have a messenger bag that zips. I put a carbine/latch to lock it. Then I have a rfid zippered pouch for my cards/money that I put inside another zippered pocket inside. It is attached to the zipper through an O ring. So 3 zippers and the wallet is attached. Even if they cut the side or bottom, the zippered compartment is not attached to the side. I tether my phone to my purse as well. I then keep half my stuff in another place but that is also tied to the inside of my purse. Nothing is absolute but there is no quick taking anything out of my purse. Hopefully they will see how hard it is for me to get in it and stay away 😂. And I keep it in front of me so there is a double thick canvas strap in the back."}, {"username": "Patti Porter", "comment_text": "I use travelon that has slash proof, but I’ve also never had anyone try cut my purse off of me, so I feel like what you have will probably be ok. The main thing is to pay attention to yourself, your belongings and your surroundings."}, {"username": "Desiree Dube", "comment_text": "https://\nwww.amazon.com/\ngp/aw/d/\nB06XBKN584?psc=1\n&ref=ppx_pop_mo\nb_b_asin_title I use this anti theft purse! Cost is good and it’s decently cute 😊"}, {"username": "Annof RedGables", "comment_text": "I have a backpack with a clip up flap that goes over the zip and then put a carabiner through the zip tabs so they are locked together. I also wear the backpack on my front in crowds. If they can get into that, good luck."}, {"username": "Erika Boerner Parziale", "comment_text": "So curious - traveling to Italy for the first time in Sept. where do you keep your passports when traveling? I felt like it was better to have with us in a protected crossbody but now I’m wondering if we should leave it in our hotel. But I don’t love that idea either. Thanks for any info"}, {"username": "Sheila La", "comment_text": "I am a woman and I always travel alone. I’ve been to the Amazon, places in South America and the Caribbean, Manhattan, Paris, Italy, Barcelona, Dublin, etc. I’ve never been robbed.\nFrankly, I try not to look like I’d be worth robbing. No expensive clothes or jewelry. One small pouch around my neck that I can put down my shirt. It only carries passport, some euros, one credit card and lipgloss.\nI also am very aware of my surroundings (aren’t most women who are alone?) and if I need my resting bitchface, I’ll put it on.\nI know it could happen to me but I see what some other tourists look like and frankly, if I were shady, I would salivate at the easy pickins’. I mean no offense and as a woman who has worked with many victims of violence, I am adverse to victim blaming, but some people just ooze vulnerability.\nThat being said, while I haven’t been robbed, “there but for the grace…”."}, {"username": "Mark Freid", "comment_text": "Honestly, I had a thin profile money belt hidden inside the waist of my shorts. My wife carried a very small Crossbody bag always in front of her. We didn’t encounter any issues. ￼ we never felt like we had to actually protect ourselves except proactively on the metro.\n￼"}, {"username": "Rupal Pujara", "comment_text": "How do you keep your phone safe?"}, {"username": "Lori Ann", "comment_text": "Pick pockets are actually well dressed and look more affluent. Often young women. Will be carrying something to use to conceal - like an umbrella or jacket."}, {"username": "Lara Swerczek", "comment_text": "Baggallini womens Securtex®... https://\nwww.amazon.com/\ndp/\nB07WS33SHQ?ref=p\npx_pop_mob_ap_s\nhare"}, {"username": "Tania Lediard", "comment_text": "Pickpocket proof pants. My husband loves his. They have shorts too"}, {"username": "Blanca Gil", "comment_text": "I wear the money belt, for my husband and I, with passports and emergency cash. I always keep it under my clothes. I’ve seen people who wear money belts over their clothes or across their body, I wouldn’t do that. The money belts are hot and uncomfortable, but after awhile, I don’t think about it."}, {"username": "Shelley Perelmuth Sperling", "comment_text": "That’s crazy"}, {"username": "Shelley Perelmuth Sperling", "comment_text": "Susan Miller Rubin Santandreu what was your experience ? These pickpocket stories are plentiful"}, {"username": "Wendy Spano Bracco", "comment_text": "The best advice to to pay attention to your surroundings. Not look lost, confused, looking up. I use a crossbody purse with pockets, zippers. I don’t intend to change that. I have that Lululemon belt and would not be using that. If it turns, someone could easily get in it, same if you wear it across you. I’m certainly not wearing it under my clothes."}, {"username": "Billie Begley", "comment_text": "I wear a cut proof cross shoulder bag. When we are in busy areas my husband walks behind me."}, {"username": "Wendy Harrison", "comment_text": "Slash proof is good, for sure. Crossbody. And pay attention, always."}, {"username": "Stephanie J Stevenson", "comment_text": "Contrary to popular belief, most people don’t get pickpocketed."}, {"username": "Lynda Schroeder", "comment_text": "Slash proof crossbody and RFID blocking clip stash pouch"}, {"username": "Glen Bentley", "comment_text": "Look confident, don’t wander around dubious areas, use your gut instinct. Money belts should be hidden from sight. Spread your money around your body. Never, ever put your wallet or purse in your back pocket. Don’t brandish your money openly. Be aware of your surroundings."}, {"username": "Jenny Nicholas", "comment_text": "I’ve had friends personally be victimized by pick pocket. The best advice they said, after they got their stuff back was, be aware of your surroundings. They work in pairs. One person to distract you, the other to get the goods. If you have anything that zips, keep that in front of you and with you hand on the zipper. These types of transactions had only happened in close quarters on the train, that was it. I live in Italy and have had no issues, been here since March. Tight, close quarters is where it will happen. They won’t hurt you, they just want your stuff. Don’t be afraid to travel or explore Italy. She’s beautiful, there’s so much history and beauty."}, {"username": "Maureen MacIsaac Timothy", "comment_text": "People that were walking right in front of us on the Spanish Steps were attacked by 5 girls, they went through his zipper pocket pants and her cross body bag less than 4 seconds\nMy husband tried getting the girls off of him, but they new what they were doing, they were probably 14 years of age\nIt was horrible\nThere was no way of stopping them\nThey came and left within seconds"}, {"username": "Matteo Basile", "comment_text": "Just avoid to have all together and have a big amount of money. Go to atm and take what you need"}, {"username": "Larry Dash", "comment_text": "I wear clothing arts pick pocket proof shirts and pants. Expensive but worth it. Plus I try to avoid crowds when I can and always walk with an air of authority even though I’m faking it at times! No problems in Rome, Paris or NYC"}, {"username": "Debbie Zornes Ruch", "comment_text": "Don’t look like a tourist. Leave the expensive jewelry and clothes at home. Avoid clothes and accessories with labels.\nStay alert."}, {"username": "Wendy MacKinnon", "comment_text": "I have a Travelon slash-proof crossbody with zippers that clasp shut. I wear it in front all the time. Amazon has a great selection of different styles and sizes."}, {"username": "Kerri Bevilacqua", "comment_text": "Was the money belt under their clothing? The main thing is to not carry all your valuables in one spot. Some women will wear a bra stash to hold some cards and cash and then carry a small amount in a cross body bag. I’ll post photos of some things as comments below this post."}]}, {"id": "2203750503357361", "text": "Folks, are there luggage lockers in Rome & Naples train stations? I am asking this coz we will be checking out of the hotel early in Naples to do a full day Pompeii tour and heading to Rome that evening...meanwhile wondering what to do with luggage...thanks for all your help!", "link": "facebook.com/groups/1373361046396315/permalink/2203750503357361/", "likes": 5, "comments": [{"username": "Dana Talusani", "comment_text": "Your hotel should not have an issue stowing your luggage there for the day, usually."}, {"username": "Khushi Khanna", "comment_text": "Check out bounce. They have storage near stations in many cities."}, {"username": "Lisa Gaimaro Sullivan", "comment_text": "Yes! We stored our luggage right at the Naples train station. It’s on the main floor and I want to say it was 24 euros for 4 pieces of luggage for 3 hours."}, {"username": "Renae Larcus", "comment_text": "Yes.Also check out the Bounce app"}, {"username": "Rachael Richardson", "comment_text": "Yeah they are everywhere just Google luggage storage near where you want to be"}, {"username": "Lesley Vullo Pino", "comment_text": "You can pay to store them in Napoli train station.. there’s a place inside .. also there’s a luggage drop off on a side street near the train station"}, {"username": "Jenny Payne", "comment_text": "Ask at the hotel can you leave your luggage, my hotel in Rome allows me to leave it for weeks at a time🌻"}, {"username": "Sondra Varner", "comment_text": "Pompeii has free luggage storage"}, {"username": "Victoria Marchetti", "comment_text": "Make sure make a reservation for them before you arrive"}, {"username": "Steve Grossman", "comment_text": "Check them at the hotel where you're staying and pick them up later"}, {"username": "Yvette Pavone", "comment_text": "Stasher.com will help you find luggage storage"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2203750536690691", "text": "North of sardinia recommendations to base our stay please? I’m confused between San Teodoro, Palau, costa smeralda area 😁 please help!", "link": "facebook.com/groups/1373361046396315/permalink/2203750536690691/", "likes": 0, "comments": []}, {"id": "2203756606690084", "text": "What can u tell me about hotel Donatello in Rome?", "link": "facebook.com/groups/1373361046396315/permalink/2203756606690084/", "likes": 0, "comments": []}, {"id": "2203758850023193", "text": "Please give me all the Lake Como tips with a toddler. We’re staying 2 nights in Lake Como and then flying out of Milan the next day. Haven’t booked a hotel or any activities yet.\n\nThanks!", "link": "facebook.com/groups/1373361046396315/permalink/2203758850023193/", "likes": 0, "comments": []}, {"id": "2203774376688307", "text": "I am looking for a centrally located town in Tuscany for 3 days in early September. We will be traveling ultimately from Florence and final destination is Rome. We will have a car and can take day trips. We have 3 free days to fill. Any suggestions would be greatly appreciated!", "link": "facebook.com/groups/1373361046396315/permalink/2203774376688307/", "likes": 1, "comments": [{"username": "Renae Larcus", "comment_text": "Siena or La Lucciolaia Agriturismo - San Gimignano is wonderful. Easy to get to places in Tuscany from there if you have a car. Parking will be harder in Siena but there are two large car parks inside the walls"}]}, {"id": "2203774500021628", "text": "We are staying in Sorrento for 5 days including the day we arrive and leave by train around the end of October. Debating whether we should hire a private car with driver for one day to tour Amalfi Coast. Is it doable by public transit? Or maybe take ferries? With the amount of time we have - we are thinking of this itinerary:\nDay 1 - Pompei inआणखी Morning, Sorrento in afternoon\nDay 2 - Capri\nDay 3 - Positano\nDay 4 - Amalfi, Ravello, Atrani, etc.\nDay 5 - morning in Sorrento and leave for next city up north\nWhich ones will be best to do with public transit, boat/ferry, and private car with driver?", "link": "facebook.com/groups/1373361046396315/permalink/2203774500021628/", "likes": 0, "comments": [{"username": "Donna Kate", "comment_text": "From what I've picked up in this group Pompeii is best done with train and Capri, Positano by boats in Sorrento. This is what we will do in 3 weeks time when we visit"}]}, {"id": "2203776553354756", "text": "We would like to spend a couple of months in Sicily in February - April timeframe. Yes, we know the weather can be a bit cooler. We would like a place in a town, preferably seaside, where we can walk and immerse ourselves. Any suggestions on towns and places (Airbnb/vrbo/hotel)? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2203776553354756/", "likes": 1, "comments": [{"username": "Gayle Moores", "comment_text": "Cefalu is a beautiful,charm\ning smaller seaside town to stay at.We got to see it on a daytrip on our last visit to Italy.Close to Palermo which is the capital only an hour away by train.Cefalu has a Norman Arabic cathedral which is considered a UNESCO heritage site.Worth a visit.Cefalu is also close to other towns to visit as well."}]}, {"id": "2203781476687597", "text": "Was going to buy a HOP on hop off bus tour in Rome as it is my first time to see the sites just for the day October 1 ( Sunday)\nThe reviews are not very good with comments on full buses and poor service\nAnybody there right now that can comment..?", "link": "facebook.com/groups/1373361046396315/permalink/2203781476687597/", "likes": 0, "comments": [{"username": "Philip Curnow", "comment_text": "There are a few of hop on hop off tour services. Be aware that the open top has little shade and the lower decks offer not much of a visual experience. Greenlines is a historic local tour brand. Maybe try them first."}]}, {"id": "2203787233353688", "text": "I’ve heard that Naples is a very unsafe area and I was really excited to go there. Can anyone share experiences in that area?", "link": "facebook.com/groups/1373361046396315/permalink/2203787233353688/", "likes": 7, "comments": [{"username": "Marty Harte", "comment_text": "Went yesterday from Rome. It has its own charm. Never felt unsafe. We walked through one neighborhood recommended. Nice with charm. Wakes over to path along water then stopped for pizza at L’Antica Da Michelle.\n\nOverall good but 1/2 day was fine for us.\n\nMany large cities are smelly, dirty etc, NYC included where I’m from. I felt more safe here."}, {"username": "Sam Jones", "comment_text": "I would go to Italy before America 😝"}, {"username": "Tony Palombino", "comment_text": "Naples is perfect. Stay in Centro area"}, {"username": "Maria Brozou", "comment_text": "we stayed near the historical center and it was really vibrant and nice. Best pizza ever and the people were really friendly and accommodating. We loved Napoli."}, {"username": "Joseline F R Simonsson", "comment_text": "Stay home"}, {"username": "K M Uí Fhionnaláin", "comment_text": "Napoli é bellissima.My favourite Italian city..ancient,i\nnteresting,hist\norical, beautiful.We have been 3 times and stsyed in the historical centre along Via dei Tribunali.Like every city anywhere,you have to be mindful of your surroundings."}, {"username": "Diane Leesmith", "comment_text": "Just be sensible of the areas you go to, aware of your surroundings and keep your bag etc close. Like most cities worldwide there is crime and some types of crime perhaps more prevalent 🤔"}, {"username": "Sue Holden", "comment_text": "I went 5 years ago by train from Sorrento at no time did I feel unsafe. People were friendly . Really enjoyed my visit there and will return in 3 weeks time for a day trip whilst I am on holiday in Italy 🇮🇹"}, {"username": "Carol Malthouse", "comment_text": "We went for the day and felt fine, obviously keep an eye on your belongings but fab city with so much to see cobbled streets are amazing and visit the monastery of santa chiara"}, {"username": "Starla Dawn", "comment_text": "I did not like Naples and was very happy to leave and be whisked away to Sorrento where I loved it there."}, {"username": "Julie Tran", "comment_text": "I just went there last week, I don't recommend it ￼"}, {"username": "Anne Sarno-mcilwrath", "comment_text": "Totally fine, went last August. 0 issues. Just be aware of your surroundings. No worse than NYC or Boston"}, {"username": "Karla Acuña", "comment_text": "I was there last Friday. It was wonderful & unique. Locals are nice + great food!!! 🥰"}, {"username": "Michael Simon", "comment_text": "I love Naples and I’ve been there several times. It’s busy, vibrant, lived in, far less touristy than Rome.\nIf you go, take all the usual precautions: no jewelry, don’t t look like a tourist, wear a money belt, if you have a purse make sure you wear it across your chest and have a strap that has a steel or metal strap inside of it."}, {"username": "Udo Stolarczuk", "comment_text": "I went in 2016. Stayed at the hotel right across the street from the train station. Great hotel, great view. But the neighborhood not so great. There were daily demonstrations,\nmost young Arab men. I enjoy walking the neighborhoods and not the tourist areas. Did not feel safe at all exploring the area. Luckily I just Naples just to spend nights there. Did day trips to Positano, Sorrento, Capri, Mt Vesuvius etc."}, {"username": "Pat Cirillo", "comment_text": "I spent January in Naples (most of it alone). It is a VERY bustling city, but has lower crime rates than Milan and Rome. We loved it so much we are considering purchasing our retirement home there. It is very large. Much to see. The Chiaia area is quite posh and certainly not unsafe. I’ve been ALL over Italy and Naples is clearly one of my favorites. Like any large city I wouldn’t walk alone late at night flashing valuables."}, {"username": "Robin Kronick", "comment_text": "I was only there for less than 48 hours and I really regret that I did not do spend more time there! Yes it is a little gritty .. most cities are! But the food and people were lovely .. will definitely return"}, {"username": "Susan Marie Bishop", "comment_text": "I ventured to Naples on my own for a few days as hubby couldn’t get the time off. Absolutely fabulous few days. The culture, the food, the architecture, the narrow streets with motorbikes whizzing up n down with mum, dad and their children on them…. The Diego Maradona shrine, paintings of Sophia Loren all over the walls ( who was runner up in a beauty contest when she was about 14) it’s an absolutely fantastic, fascinating place if u can look beyond the graffiti n rubbish that is around in many of the streets.🤗💙❤️🇮🇹 I’m venturing back in October 🤗🇮🇹❤️💙 most definitely a yes from me 😀🤗💙❤️ not all of true Italy is prestige n exceptionally clean but that doesn’t mean it isn’t worth visiting and experiencing the true wonders and characters that live there 🤗💙❤️🇮🇹 for me personally it was a fabulous experience to add to my wonderful memories of conquering Italy bit by bit 😀🤗💙❤️🇮🇹and I’ve travelled around quite a bit of Italy over the years 😃🤗💙❤️🇮🇹"}, {"username": "Susan Marie Bishop", "comment_text": "I ventured to Naples on my own for a few days as hubby couldn’t get the time off. Absolutely fabulous few days. The culture, the food, the architecture, the narrow streets with motorbikes whizzing up n down with mum, dad and their children on them…. The Diego Maradona shrine, paintings of Sophia Loren all over the walls ( who was runner up in a beauty contest when she was about 14) it’s an absolutely fantastic, fascinating place if u can look beyond the graffiti n rubbish that is around in many of the streets.🤗💙❤️🇮🇹 I’m venturing back in October 🤗🇮🇹❤️💙 most definitely a yes from me 😀🤗💙❤️ not all of true Italy is prestige n exceptionally clean but that doesn’t mean it isn’t worth visiting and experiencing the true wonders and characters that live there 🤗💙❤️🇮🇹 for me personally it was a fabulous experience to add to my wonderful memories of conquering Italy bit by bit 😀🤗💙❤️🇮🇹and I’ve travelled around quite a bit of Italy over the years 😃🤗💙❤️🇮🇹"}, {"username": "XLesley-Anne Gordon", "comment_text": "i went alone last year and didnt feel unsafe at all, i really enjoyed it, there a different vibe to it than rome etc but i wouldnt say worse."}, {"username": "Patty Hagye Alcalde", "comment_text": "Stayed in Naples for 2 nights in April and loved it! We were not near the train station. We took a walking tour of Naples and loved it. The waterfront was also amazing! I didn't find it to be full of trash where we stayed, near the large castle and opera house, and it was walkable to many places and sights. To me, Napoli is an ancient city with so much to discover. Sorry you had a different experince! Went to several amazing restaurants as well. I would definitely go back!"}, {"username": "Jo Ann Di Giamo", "comment_text": "I never had any problems or felt unsafe"}, {"username": "Teresa Moore Livingston", "comment_text": "I’m here now, staying in Caserta area. A coworker was mugged outside his hotel a couple months ago in Naples. One of the reasons I chose to stay where I am. As I drive toward Naples every day for work, the litter gets worse. They use the side of the roads to dump their trash. I have never seen a place like it before. I would not recommend staying in Naples!"}, {"username": "David Pye", "comment_text": "Two days ago outside our hotel"}, {"username": "Ashley Kang", "comment_text": "We stayed in Naples for 2 days. I didn't feel unsafe but there are so many motorcycles honking every 10 seconds. Exhaust fumes, really busy traffic and the town is old. I did not like Naples. Food was good though."}, {"username": "Lauren Vassallo Beattie", "comment_text": "I loved it, never felt unsafe. The food is amazing, the people are friendly and it has so much character. (For context im from Australia where it's really safe.)"}, {"username": "Sherry Shannon", "comment_text": "My least favorite place in Italy. There’s so many nicer, cleaner places than Naples. I wouldn’t go back. Thieves staring us down in the train station. Walking through piles of trash on the sidewalk to get to out hotel. You are close to some really beautiful places on the coast. Head towards Amalfi."}, {"username": "Diana Morgan", "comment_text": "Not safe we got robbed on the tube, would never go there again"}, {"username": "Liz Cooper", "comment_text": "I was there just before covid. I loved it."}, {"username": "Susan Chojnacki", "comment_text": "Not one of my favorite places once was enough for me but you should always be careful of your surrondings no matter where you are home or away"}, {"username": "Genevieve Bastien", "comment_text": "We were there with our 3 young girls\nAnd we never felt unsafe\nWe stayed in Chiaia and did the Spanish quarters etc\nEnjoy ! Pizza is great ;)"}, {"username": "Ildiko Gyimesi Mikos", "comment_text": "I was just there for 4 days in late June-early July. No worries. Never felt unsafe. It was fantastic! Food amazing! Go!!"}, {"username": "Cassandra Goodgame", "comment_text": "I was there 5 days last September and felt very safe. Walked at night and never had any feelings of negativity. It's a real city, not a tourist trap. It is just different. The food is amazing and you can visit Pompeii and a few islands. I recommend and loved it there."}, {"username": "Debra Fabrico", "comment_text": "For the people that said they didn’t feel safe can you give us any examples why? It can’t be because of the litter you felt unsafe. Has anyone had an unsafe experience?"}, {"username": "Lyn Pappas Dahm", "comment_text": "It is safer than NYC any day!! I’ve been, and I would gladly go again. Naples is raw and it’s real. It’s people are amazing and the food is absolutely wonderful."}, {"username": "Cindy McLean Gillespie", "comment_text": "My husband and I were there last September...we had a wonderful time! Great food, friendly people, so much history, and never felt unsafe. We stayed in the historic city center, on Dante Square. We're going back in April '24 because there was so much we didn't see!❤️"}, {"username": "Sue Sherwood", "comment_text": "We were just there in April. It's a big City! Just be mindful of your purse when you are in crowded areas. The food is amazing and the people were wonderful. Not my favorite city but we found aome really amazing places to visit."}, {"username": "Carole Tarlap", "comment_text": "ANY....ANY.... big city Can be UNSAFE 🤷 PAY ATTENTION TO YOUR SURROUNDING 💥"}, {"username": "Brittny Lynn Selleck", "comment_text": "Thank you everyone! We will have to keep it on the agenda ☺️"}, {"username": "Valerie Collanton", "comment_text": "Did a solo trip and had no issues. I felt just as safe there as any big city. Fantastic place to visit."}, {"username": "Miyuki Kanno Paul", "comment_text": "Napoli has been “cleaned up” quite a bit. It’s nothing different from any other cities nowadays. I even made a solo trip to Napoli and stayed an apartment in Quartieri Spagnori for almost 3 weeks in 2016. We go back to Napoli twice a year😉"}, {"username": "Patricia Cheyne", "comment_text": "Had no issues when we went & felt totally safe"}, {"username": "Anthony Sperduti", "comment_text": "It’s not unsafe\nJust a big busy city\nIt’s the New York City of Italy"}, {"username": "Rosaria Di Giacomo", "comment_text": "No true\nI was unsafe 30 years ago"}, {"username": "Samantha Houghton", "comment_text": "I’ve just spent 3 days there alone as a young female traveller (Pompeii prior to that). I walked from the train station, wandered amongst the back streets to my hotel, went to the sights in the centre, ate alone on an evening and then took a local bus across town to another local hotel near the airport…\nNaples had a very different feel to Tuscany/ Rome/ Pompeii/ amalfi etc… all the places I’ve been before. For me, it felt a little daunting in comparison just because it’s so busy but I honestly didn’t feel unsafe. The people on the local bus helped me out with where to stop, staff helped me in restaurants and at the metro stations, locals said hi when I walked past, I asked for directions etc and everyone I came across was so helpful. I speak a little Italian which helped and I think was appreciated. Would happily go back. Honestly go places with an open mind, do some research and enjoy yourself! One persons like is another’s dislike…."}, {"username": "Larry Reinier", "comment_text": "It’s not any different than any other city"}, {"username": "Tammy Wirick", "comment_text": "Spent day and a half there on my own before joining tour. Had an easy time of it getting around on public transit, finding places to eat. Walked everywhere and felt very safe. Lots of it, like anywhere, is being aware of surroundings, not looking for trouble and having purpose. Realize there are times people do everything right and bad things happen but I wouldn’t give Naples a bad rap"}, {"username": "Mary Brown", "comment_text": "Naples is real, amazing food, less touristy. I suppose you can call it gritty but once you look past it it’s amazing. The history and the culture is incredible. Watching people drive and being in traffic was an amazing cultural experience. You get to see true local people living in their busy city.\nThere is lots to do in Naples and it’s a great base to see Capri, Amalfi Coast, Pompeii and Vesuvius.\n\nWe stayed in the Chiaia district close to the Castel dell'Ovo.\nIt was magical to see the sea, the ships coming and going, the sunset. Families leisurely walking enjoying their evening.\nI say anyone should experience it for themselves"}, {"username": "Danielle Baca", "comment_text": "So it’s a big city. Comparable to nyc maybe. It’s got the good and the bad. I was actually attacked by a homeless man there last year but something about the city is special still"}, {"username": "Frank Hunt", "comment_text": "Never had a problem"}, {"username": "Lina Stump", "comment_text": "I have zero desire to visit. So many other places to go to"}, {"username": "Laurie Denoni", "comment_text": "We stayed in Il Convento right in the Spanish Quarter for 3 nights. Never felt unsafe. Loved Naples. Do some research of course to find what you’d like to visit"}, {"username": "Bonnie Rodgers Henderson", "comment_text": "Great museums, food and people. Itlike any big city. Keep your valuables close and don't let them out of your sight. Same advice for any large city anywhere, including the US."}, {"username": "Anne Gee", "comment_text": "It is wonderful."}, {"username": "Meredith Holloway Helbon", "comment_text": "Following"}, {"username": "Martin-John Rubio", "comment_text": "#1\nDon’t believe all you read"}, {"username": "Yvette Pavone", "comment_text": "You’ll be fine, just pay attention"}, {"username": "Karen Romberg Arlan", "comment_text": "It was the only train I was uncomfortable in. Not pleasant at all."}, {"username": "Kelsey Larabie", "comment_text": "We adored Naples. We stayed in the Chiaia area and I’d highly recommend it. We used transit and wandered the streets and felt fine."}, {"username": "Sally Warren", "comment_text": "September last year. Stayed in an AirbnB. Did a guruwalk through the Spanish Quarters with a great guide who totally enlightened me about Napoli, historically and socially.\nThe guided walk changed everything for me.\nWe visited the Archaeological Museum which is fantastic! It has the best stuff from Pompeii.\nWe loved the food, lots of great street food apart from pizza. Fabulous seeing our neighbours buying from street vendors and having produce delivered to second floor balcony via a bucket on a rope.\nI felt safe at all times.\nThe Neapolitans are known for their exuberance, sentimentality,\nmusic, and humour. The most famous Italian comedian was Toto, and there is a street dedicated to him in the Spanish Quarters.\nDo yourself a favour and do a guided tour, it will help you understand why Maradona is seen as such a hero."}, {"username": "Anna O'Connor", "comment_text": "We stayed in the Centro Storico (old town ) area and didn’t feel unsafe at all. Naples is heaving with people, so suggest you keep your purse close as you would in any crowded area. We loved our time there."}, {"username": "Cindy Gallen Barton", "comment_text": "I had heard that also prior to us visiting. I never felt unsafe while we were there ( day trip) it is kind of gritty and dark but seemed ok"}, {"username": "Victoria Moorhead Murrow", "comment_text": "I stayed in Naples in the centro historico district for 3 nights.. I never felt unsafe!"}, {"username": "Karen Schofield", "comment_text": "It’s a big city with nice and not so nice bits.\nLike any city the ports and stations are where it’s most ‘hairy’.\nWe were fine wandering about lost, but we are used to big cities…"}, {"username": "Lauren Elizabeth", "comment_text": "We based ourselves in Naples in 2019 for 9nights and never felt unsafe, just be mindful of your belongings, particularly down by the train station area. We stayed in a lovely b+b, “Hermes rooms for tourists” and the owners were so friendly and helped us plan our trips - Pompeii, Herculaneum, sorrento/\namalfi, ischia 😊"}, {"username": "Kelli Pilkington", "comment_text": "We were there 2 days ago, we were cautious after reading various comments. First impressions outside Napoli Centrale weren’t great but the further away from there we go the nicer it was. We enjoyed our time but it’s like anywhere really, be mindful of your surroundings and you’ll be fine"}, {"username": "Sonia Scotto Lubrano", "comment_text": "So Napoli gets a bad rep, but it’s really turned itself around.\n\nYou need to watch out at the train station - but that’s at every train station. (Pick pocketers)\n\nBut even this year when they posted “most dangerous Italian towns” Naples moved way down on the list.\n\nInfact all I keep hearing about down here is how unsafe Rome is becoming. (& Milano has the most crime per capita at the moment)\n\nI went to Naples twice in the last month and it’s the safest I felt there, ever."}, {"username": "Michael Galan", "comment_text": "Heard where?"}, {"username": "Christine Sanci-Gentile", "comment_text": "We just went last month and it was not pleasant. Could not believe the litter. Did not seem safe at all. We stayed across from the train station so it could have been the area but I would not go back after the experience we had."}, {"username": "Gianna Onesi", "comment_text": "It's more common sense like anywhere when travelling watch your stuff don't leave your wallet out and you should be fine."}, {"username": "Scott Perry", "comment_text": "I stayed in the Chiaia neighborhood. Very nice area, and only a couple of metro stops to the center."}]}, {"id": "2203788476686897", "text": "Hello! How long does it take to get through Naples Airport? We are travelling to Naples in August and wanting to explore Naples for a couple of hours before heading to Sorrento.\nOur flight arrives Naples at 10:40 AM and was wondering if we have enough time to eat pizza and catch a 2:20 PM train to Sorrento?\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2203788476686897/", "likes": 1, "comments": [{"username": "Louis Des Forges", "comment_text": "Are you travelling on a flight from within the Schengen Zone or outside (ie UK or US). If it's the latter depends on how fast passport patrol is, can sometimes take a long time if a lot of flights from the UK arrive at the same time. I would just buy the ticket on arrival in case of any unexpected delay or cancellation."}, {"username": "Dave Conroy", "comment_text": "See what great pizza places are within easy walk or cab from the central station and just make sure you leave time to get back and catch the train. if flight is late, just bad luck."}]}, {"id": "2203789993353412", "text": "Does anyone know a Beach Club in Amalfi Positano or Sorrento that will take online bookings to reserve beach chairs looking to go in a few weeks and don’t want to wing it when I get there. Thanks guys!!!", "link": "facebook.com/groups/1373361046396315/permalink/2203789993353412/", "likes": 8, "comments": [{"username": "Tara Roed", "comment_text": "Arienzo is all online. I even paid for the whole day ahead of time. One fire takes your reservation with a credit car but doesn’t charge. That one toy book through what’s app. They were both fun but Arienzo my favorite"}, {"username": "Stephanie Osborn Rushing", "comment_text": "We booked la scogliera online"}, {"username": "Inna Rozen", "comment_text": "L’incanto online"}, {"username": "Victoria Brkić Amodio", "comment_text": "Da Ferdinando in Positano has an online reservations link on their instagram page. Quick walk from the ferry port, good food, not crazy pricey and a little more laid back atmosphere."}, {"username": "Michelle Solak", "comment_text": "All the ones I checked out were online! Arienzo was our fav"}, {"username": "Rachael Richardson", "comment_text": "Take a bank loan out first 😂 very expensive , overcrowded , so make sure you pick location wisely"}, {"username": "Brooke Williams", "comment_text": "Just got back from Positano a few days ago. Arienzo beach club was the best! 10000% worth it compared to what you’ll pay for the other beach clubs!"}, {"username": "Maria Urdi", "comment_text": "We did L’Incanto today I booked online. It’s the beach where the port is."}, {"username": "Elie Loummer", "comment_text": "Pupetto beach club in Positano was wonderful! Just around the corner from the port and you get clearer water, great food and price"}, {"username": "Kayla Bates Santoro", "comment_text": "I was able to make a reservation ahead of time for One Fire Beach Club in Praiano (it does have boats that bring people from Positano)!! I spoke with someone over WhatsApp a few months ahead of time to make the chair reservations. They didn’t charge our credit card until day of, though 🙂."}, {"username": "Kirstie Jane", "comment_text": "Natalie Sydes, Glenn Malisauskas, beach club day??"}, {"username": "Cheryl Callahan Gibney", "comment_text": "We went to both La Scogliera and Arienzo, both can be booked online. We liked Scogliera better, we had a great location with steps to the sea."}, {"username": "Brad Nelsen", "comment_text": "Book One Fire Beach or La Gavitella in Praiano. 5mins by boat; lots of fun."}, {"username": "Tess McDade", "comment_text": "Bagni Salvatore in Sorrento takes reservations via FB messenger!"}, {"username": "Colita Ellis Wittenkeller", "comment_text": "We arrive next week. How far in advance do we need to book?"}, {"username": "Yanely Cruz", "comment_text": "I booked L’Incanto .. you can even order food and drinks directly with the bar code !"}]}, {"id": "2203792603353151", "text": "I’m going to Rome at the end of September going into October…we are going to rent a car and drive either to Florence or Naples. We are trying to decide which one?\n\nAlso, we are wanting a self guided tour to the Vatican and colosseum. Where did you all buy your tickets from and should we consider doing a guided tour?\n\nI appreciate any suggestions!", "link": "facebook.com/groups/1373361046396315/permalink/2203792603353151/", "likes": 85, "comments": [{"username": "Janis Belkin Sowell", "comment_text": "FLORENCE FOR SURE!"}, {"username": "Julie Cook", "comment_text": "Yes Florence is preferable though gets very busy and the Amalfi coast if you have time. Don't bother with a car as parking is difficult in these areas. Would also recommend Venice and the lake regions of Italy.\nPre-book skip the queue tours for the Vatican and Colliseum in Rome. Have fun!"}, {"username": "DrMarylean Wroten", "comment_text": "Viator"}, {"username": "Jim Hash", "comment_text": "Florence or Naples is tough. I worked in Naples (NATO) and now we live part of the year in Florence. If art is your thing, then Florence, you won’t be disappointed."}, {"username": "Kelly Siegmann", "comment_text": "Florence instead of Naples for sure!! Yes take a guided tour. There is so much history and you will not understand it all without a guide!"}, {"username": "Lorraine Short", "comment_text": "Florence absolutely. Skip Naples. It’s a bit gritty."}, {"username": "Kate Bryant", "comment_text": "Firenze is a must! I had an apartment in Firenze for 3 months, made it my base, caught buses, trains etc.\nNaples is great, but it’s really the Amalfi coast that is magnificent. Sorento, Positano is amazing.\nGo to your local travel agent, pick their brains, and google how you find a guided tour.\nHave an amazing time! Italy will change your lives , architecture, history, culture, food and the people!\nGet lost!!! You will discover amazing places! And look up when you are walking, so you get your bearings! I used to love getting lost. Be mindful of the Gypsies! They are the only down side, especially in Rome at the train station!\nHave a wonderful adventure! 🙏"}, {"username": "Kate Bryant", "comment_text": "Buy an Italian/\nEnglish dictionary, and strongly advise going to your local Dante Allergie to learn the basics!"}, {"username": "Suzi Hellmundt", "comment_text": "You can stop off on way to Sorrento in Naples - I loved Naples - just the Italy I wanted to see - amazing food, shopping much cheaper than northern cities, gorgeous sights"}, {"username": "Lucy Wilent", "comment_text": "Federico Pelegrino tour guide phenomenal & will not disappoint. He was born in Rome. We had a private tour & dinner in the gardens at the Vatican."}, {"username": "Graham Lambert", "comment_text": "Take the train instead Fantastic Italia Trains"}, {"username": "Arthur Boyce", "comment_text": "Florence is great for artistic culture…Naples and south are great for lifestyle culture…"}, {"username": "Steve Hinton", "comment_text": "Would not recommend driving around Florence. Best to take a train and walk the city."}, {"username": "Carol Polichnowski", "comment_text": "Parking\nAlways The consideration\nWhen renting a car\nVs using the trains\nWhich\nAre really great in Italy"}, {"username": "Paula Genthner", "comment_text": "Viator"}, {"username": "Deborah Thomas Shull", "comment_text": "Guided tour because you gain entry faster and you won't waste time getting lost in the Vatican. They cover the high points and you can wander after if you feel like it."}, {"username": "David Leineweber", "comment_text": "Naples 10 years ago was amazing and the food is fantastic. Easy boat ride over to Capri that was phenomenal and food unbeatable.\nWe did a private boat ride around the island and saw Sophia Lauren’s house.\n\nWe are going to Rome, Venice and Florence next year. Can’t wait 😜"}, {"username": "Shirley Roberts", "comment_text": "Florence for sure! I didn’t think that much of Naples."}, {"username": "Christine Matthews", "comment_text": "take a train to florence. just google tickets for vatican and colosseum. buy them at least a month out as they sell out."}, {"username": "Rick Weingart", "comment_text": "I've spent at least 10 weeks in Florence and haven't seen everything...So\nmuch Renaissance history including the Uffizi Gallery and the Academy where Michaelangelo's\nDavid is...All within walking distance of The Ponte Vecchio.\nThe Amafi Coast is fabulous but I would take a train to Salerno and then hire a driver or take the Amalfi Road bus to Ravello, Amalfi and Positano...❤️ 🇮🇹"}, {"username": "Mike Alioto", "comment_text": "Definitely Firenze!"}, {"username": "Svetlana Spivak", "comment_text": "It’s all depends on HOW LONG you are planing to stay in Italy !"}, {"username": "Lex Strauss", "comment_text": "Julie Strauss"}, {"username": "Kristy Hanks Strickland", "comment_text": "Florence for sure, it is magical, plan to take your time, and plan to go again. We did Rome for 5 nights then 7 nights in a small town above Sorrento and did day trips to Naples, Sorrento, Capri, and Amalfi coast. The next time we started in Venice, then to Italian Riviera and to Florence and Tuscany. This time we are going to Lake Garda, meeting family in Tuscany and going to Florence and the Italian Riviera, Cinque Terre again."}, {"username": "Kim Carlton", "comment_text": "Florence is magical! I liked guided tours of the Vatican and Coliseum. The guides have so much information that you would never learn on your own, plus it’s much easier to navigate these sites with a guide. That’s just my opinion, and depending on your style, self guided may be a better choice for you. I loved my Vatican tour, but I was less impressed with the guide and organization of the Coliseum tour. There are so many options for the tours!"}, {"username": "MaryBeth Reed", "comment_text": "We were there last year for 2 1/2 weeks and it depends. Have you ever been there before? I suggest doing the touristy things the first time to get them out of the way, then return to discover all the other hidden gems that Italy has to offer. We spent an afternoon and evening in Naples and I'd love to go back. Florence is a great city with lots to see! We also spent 5 days in Positano and saw the surrounding towns. But our greatest time was spent on the east coast where no one really goes. Puglia is an AMAZING area! We loved Alberobello, Matera, Italy, Locorotondo, Ostuni, Polignano a Mare."}, {"username": "Louise Savage", "comment_text": "My son has just done a tour of Italy - Milan, Venice, Bologna , Florence and Cinque Terre .\nHe said Florence was the place he could have stayed for longer\nLots to do and the best of all the other cities combined in his opinion. X"}, {"username": "Angel Devine", "comment_text": "Thank you sweetheart ❤️"}, {"username": "Nancy Surprenant Leclair", "comment_text": "Naples is not recommended... Crime wise"}, {"username": "Shelton McBride", "comment_text": "Go to Florence. Time is valuable. Don’t spend it standing in lines."}, {"username": "Jason Naz", "comment_text": "For getting around Rome . I walked everywhere and discovered amazing places ..alot of side streets etc"}, {"username": "Mick Streff", "comment_text": "Compare Viator and GetYourGuide for tours.\nWe’ll be in Rome Sept 19-24, then a little SE of Florence 24-28, then to Milan."}, {"username": "Helene Kalfas", "comment_text": "Go to Florence Naples is very dirty we just got home we did a guided tour of the Vatican but our own with the Colosseum be careful with purchasing tickets online the company’s are canceling and no money back"}, {"username": "Jamie Favreau", "comment_text": "Drive to Florence but train it to Naples. Naples is a whole new world to drive in 😂"}, {"username": "Kerri Pianalto", "comment_text": "Ryder cup golf tournament in Rome the end of September- keep that in mind when booking things-🤷‍♀️🤷‍♀️"}, {"username": "Nicola Morgans", "comment_text": "Firenze"}, {"username": "Amenyo Abraham", "comment_text": "I’ll recommend you get a travel guide Journeying through Rome by Stalwart Halves on Amazon. It contains useful information, hidden gems, transportation and accommodation recommendations\n, culture, etc which will make your trip stress"}, {"username": "Claudia Van Oostrum", "comment_text": "Kelli Gene Blakeman Tiqets worked perfectly fine for us gor booking with Colosseum and Vatican City. When you’re not in high season you could also book direct at the sites: you just need to know when they open their bookings: some open up a month ahead, some 3 months ahead.\nFor a visit to Vesuvius we booked direct as we do not want a guide there.\n\nhttps://\nvesuviopark.viva\nticket.it/\nit?qubsq=6257457\n3-03ba-4f69-a2f\n6-a2d49ac06585&\nqubsp=0d7901b9-\n9292-4379-89a7-\n8d96ca9e8924&qu\nbsts=1690877144\n&qubsc=bestunio\nn&qubse=vivatic\nketserver&qubsr\nt=Safetynet&qub\nsh=31fbf8018c6d\n0a51c65c1cf6801\n5edcc"}, {"username": "Jennifer Verraneault", "comment_text": "We took their train system from Tuscany to Florence for the day, it was easy on the train & Florence was spectacular!"}, {"username": "Allen Lowe", "comment_text": "Add Orvieto to your list. Just got back to the US on Friday. We toured all over Italy. Cinque Terre, Orvieto & Verona we’re top favorites."}, {"username": "Jenny Kendrick", "comment_text": "Check out Viator tours. Florence was beautiful"}, {"username": "Kim Briggs", "comment_text": "Both Naples and Florence are accessible by train. Parking is a huge issue in both cities."}, {"username": "Sally Hartmann", "comment_text": "Train"}, {"username": "Robert Behm", "comment_text": "We are in a tour group EF travel they get them all for us! We have a set time and just walk in."}, {"username": "Amelia Smith", "comment_text": "I wouldn’t do Naples, as my Italian friend suggested to me, it’s not safe. As for Florence, it’s one of my favourite city breaks. Take care & enjoy the wonderful country."}, {"username": "Robbie Lombardi", "comment_text": "Florence for sure. Sorrento is amazing"}, {"username": "Debbie George", "comment_text": "Florence!"}, {"username": "Beverly Cardelli", "comment_text": "Naples"}, {"username": "Susan Hardy", "comment_text": "Take a train to Florence. Parking is horrendous."}, {"username": "Wanda Ashburn", "comment_text": "Naples"}, {"username": "Suzanne Shea-Simpson", "comment_text": "May I suggest GetYourGuide.co\nm\nWe used them for all our tours and transportation to/from airports for Italy, London, Ireland, Paris, and Spain trips as well as our family trip out west (Yellowstone, Grand Tetons) Montana, Idaho, Wyoming, and Utah last year. Our Europe travel we book through Tripmasters.com….."}, {"username": "Shirley Mallory", "comment_text": "I would consider a guided tour. You will see sooo much more than doing it on your own. That’s what we did. Your tour guide will get you in places you would otherwise not be able to. Enjoy!"}, {"username": "Shirley Mallory", "comment_text": "You will love Sorrento."}, {"username": "Fiorenza Bruni", "comment_text": "Better check into driving into Firenze. I don’t believe you can drive into the city center any longer."}, {"username": "Patti Farrell", "comment_text": "I'd pick Florence because you can drive through Tuscany And maybe stay and explore fir a few days"}, {"username": "Liz Del Signore", "comment_text": "Guided tours are better, especially at the forum and other ruins, or you'll miss what everything means"}, {"username": "Ilona Elliott", "comment_text": "The driving will be easier in Florence. Naples and Amalfi are pretty crazy roads and traffic."}, {"username": "Annmarie Chenoweth Burmeister", "comment_text": "I just got back. I bought my Vatican tickets from the Vatican official site. I spent the extra $$ for the breakfast in the gardens tour. It was wonderful, less crowded and well worth it"}, {"username": "Mazzeo Diane", "comment_text": "I loved Naples and Florence was OK"}, {"username": "Melissa McWilliams", "comment_text": "We will be there the same time! Rome to sorrento and then sorrento to Florence gonna train but if you want to ride share at all let me know."}, {"username": "Raf Gervasio", "comment_text": "Florence is amazing but if you like pizza then you won't get a better one on the planet outside Naples plus the food and cakes like babba and sfogliatelle ....its got to be Napoli"}, {"username": "Gene Alligood", "comment_text": "We did road trip from Geneva, Switzerland to just before arriving at Italy, turned in car, took short train ride and cab to rental car agency ‘saved us $1500 doing this’ then drive to Rome, Cinque Terre, down Amalfi Coast to Naples, took ferry to Capri to stay over, leaving car at ferry parking lot, then drove back up to Rome to fly home. It was a fantastic experience and we loved every part of our trip❤️😀!!"}, {"username": "Hudd Cass", "comment_text": "I found the guided tour at the forum amazing. I’ve been without it many times but would definately fo it again!"}, {"username": "Patty Bauer", "comment_text": "Driving in the countryside is nice but I would never drive in the large cities. Florence is very easily seen by walking. Mostly walking in Rome but did do reservations for Vatican and Colloseum. Well worth it. Otherwise your in line for hours. Also get tickets ahead to see the David. I'm not typically a fan of tours but certain places it's better."}, {"username": "Alon Carmichael", "comment_text": "Florence"}, {"username": "Patty Bauer", "comment_text": "I can give you a referral for an apartment in Rome if you need it. Lovely woman located near Campo di Fiore. Also have a contact in Florence near Ponte Vecchio."}, {"username": "Chris Avanzato", "comment_text": "Florence is exquisite and many sites—-great food and shopping. Naples is very dirty and unsafe. No comparison."}, {"username": "Leigh-Ann Ohren Jones", "comment_text": "We loved Firenze!! We did not make it to Naples."}, {"username": "Leigh-Ann Ohren Jones", "comment_text": "If you end up doing the Vatican, I would get a tour guide. Even if it’s a group that you’re with, they’re just so well-versed in pointing out the important pieces of art and other artifacts that you may miss along the way."}, {"username": "Billie Frances Swanda", "comment_text": "Go to Florence."}, {"username": "Cathy Ricci", "comment_text": "I'll be in Italy in September also were taken the train everywhere hopefully not on strike"}, {"username": "Jeff McLellan", "comment_text": "Naples with a great guide is a game changer. We had an amazing two hour tour with Ludovica from Ludoviguida and all wished we had more time."}, {"username": "Stanley Ball", "comment_text": "The Vatican is free to go in to. Don't buy tickets, it's a scam."}, {"username": "Luanne Aiello Quarato", "comment_text": "I would drive to Florence for your first time and I definitely would have a guided tour for the Vatican, the lines are horrendous and you will get so much more out of the tour, have a wonderful time!"}, {"username": "Anthony Attanasio", "comment_text": "Florence not Naples."}, {"username": "Brandi Hill", "comment_text": "Make sure get an international drivers permit!"}, {"username": "Lynne Pompetti", "comment_text": "Naples is much closer than Florence but Totally different. It depends on your goals fur your trip. Huw much time do you have. Driving in Italy is very difficult. Do you have international driving licenses?\nTake the train to Firenze after one day in Naples (you could spend 3-4 days in Rome) and enjoy it's beauty."}, {"username": "Beth Weishaupt", "comment_text": "We got a private tour guide at the Vatican and it was a great decision. Private guides no all of the in's and out's of the Vatican. they know how to skip long lines too. I felt it was money well spent. The owner of our hair BnB arranged the guide for us."}, {"username": "Linda Tibbles", "comment_text": "Recommend catching the fast train- a lot easier on stress levels, and probably cheaper ,too. Just get a taxi from train stop to you hotel. Go to Viator or Get Your Guide to find skip the line day tours for the sights you want to see. You won't regret it, once you see the crowds and line ups."}, {"username": "Nicole Musto", "comment_text": "Florence…"}, {"username": "Jeanine Welch", "comment_text": "Make sure you get your IDP.. we are going in October and are getting a car as well"}, {"username": "Martha Hughes", "comment_text": "You can learn as much from an audio tour, but the benefit of a tour is that the tour guide will have clout with the Vatican people, and you may be allowed to stay longer in an area if needed, where as an individual you would not be. The printed material the guides have at the Colosseum are fantastic."}, {"username": "Sally Ann Tanasi", "comment_text": "Definitely Florence the heart of the Renaissance so much to see there. Definitely buy a prebooked tour of the Sistine Chapel see the Vatican museum you can wander the Vatican on your own the gardens are beautiful."}, {"username": "Gina Rabotino Pelle", "comment_text": "FLORENCE hands down.\nYou can book guided tours on booking.com or Viator"}, {"username": "Ruth Redlener", "comment_text": "Take the train!"}, {"username": "Rebecca Carroll", "comment_text": "We drove from Rome…. Just know none of the toll booths are in English. But trust me you’re going to want a car to drive to Florence and go through Tuscany"}, {"username": "Elizabeth Erickson", "comment_text": "I loved Naples but Florence is a must."}, {"username": "Connie Schoch Morello", "comment_text": "I do not recommend driving in Naples! It’s crazy busy!"}, {"username": "Helayne Lewis Levitt", "comment_text": "I bought tickets direct on the site"}, {"username": "Jason Naz", "comment_text": "I'm in Australia and got all my tickets for sight seeing around Rome online before I left Australia"}, {"username": "Stacey Crain", "comment_text": "Florence is the place to go 100% and yes, do a guided tour of Vatican City. I would also pay a little extra to get an early tour before the place gets packed. Also, make sure you’re not wearing shorts, midriff tops or tank tops in Vatican City. You must wear sleeves and at least cropped pants."}, {"username": "Karen Ackerly", "comment_text": "Been many times and when I took my son and did guided tour I really enjoyed it more. Much better experience. Did not like Naples and would go North to Florence and Stop in the small hilltop towns along the way. I enjoy the drive but I only drive during the day and I park in the big public parking outside the cities and shuttle in. I don't drive in the cities. A Rick Steves book is very handy and he offers tips for self guided tours and his auto tours are good."}, {"username": "Jenna Loxston", "comment_text": "F"}, {"username": "Patricia Skea Tsairis", "comment_text": "Florence. Driving in Naples is like volunteering to be a gravedigger during the Black Plague - why would you? (Sorry, had to).\n\nI don’t know much about roam tours because I lived there, but my friend has a tour company, and she’s it’s highly regarded.\n\nhttp://\nwww.romanholiday\ntours.com/\nRoman_Holiday/\nWelcome_to_Rome%\n21.html"}, {"username": "Raquel Pickering", "comment_text": "Self guided all the way! We had a three hour guided tour and we basically were shuffled from room to room, never stopping long, not able to investigate rooms or art at our leisure. Wish we had got the self guided. BUT make sure you get skip the line self guided. We used get your guide."}, {"username": "Joy Crawford", "comment_text": "Do your own tour of Vatican. Less cost same amount of things to see and you can take your time tours you are rushed"}, {"username": "Linda Collins King", "comment_text": "Angel Devine"}, {"username": "Allan Olexa", "comment_text": "Parking is limited or nonexistent."}, {"username": "Lorrie Nolan Masset", "comment_text": "The Ryder Cup is just outside of Rome Sept 29-Oct 1. FYI\nWe arrive night of Oct 2. We booked the Viator tour of Vatican and Colosseum our first day in Rome. When we leave Rome we booked train with AAA thru Railbookers and are staying in Sorrento. They arranged a transfer for us from Naples train station to our hotel in Sorrento. We are taking a boat tour through Viator of Amalfi coast with a stop in Positano."}, {"username": "Alysha Jade Byrne", "comment_text": "Florence!!"}, {"username": "Steve Grossman", "comment_text": "Walking tours of the Vatican. No line, and you will get headphones And your experienced guide will do the rest"}, {"username": "Maria Urdi", "comment_text": "Rome to Salerno quick 1.5 hour fast train. We stayed in Minori. HIGHLY RECOMMEND ! You can ferry to Amalfi, Sorrento, Positano, Capri. And the views you will never ever get if you were driving. Minori Is beautiful and a great home base as the other islands were great to visit. But it was nice to come back to a little quiet."}, {"username": "Steve Grossman", "comment_text": "We have always driven that route. People will try and talk you out of driving and take the train. But in a car, you can stop everywhere and see all the things you want to see and move on. It gives you a lot of freedom."}, {"username": "Lauren Vassallo Beattie", "comment_text": "Good luck driving in Naples it's next level crazy 🤪 😅, so is Rome but not as bad. The roads are narrow, got to push in when driving to get anywhere and the roads are really uneven. Tuscany yes and the amalfi coast or anywhere out of the major cities, unless you are from there and are used to it, get public transport or private transport. I loved Naples, both Florence and Naples are two completely different cultures. Naples is gritty, full of history, rich deep cultural traditions, the food is amazing and the people are warm and friendly. If u want to shop Naples if significantly cheaper for everything. Florence and Tuscany is full of beauty and exquisite works of art, rolling hills, awe inspiring scenery and amazing gelato. Pretty much in Florence you walk, look at art, eat and repeat lol. Both very different experiences, both worth the visit."}, {"username": "Bennett Richards", "comment_text": "Stay at the Hotel Grand Palatino in the Monti district great location with a fantastic breAkfast. Go to Firenze for the day . A 1 hour 15 min ride on the bullet train from Roma. The take a train from Roma to Sorrento. Stay in Sorrento and Rent a Vespa and drive up the Amalfi coast highway. Most beautiful drive in the the world."}, {"username": "Mary Agozzino Derrick", "comment_text": "Naples or Florence? I'd day hands down Florence"}, {"username": "Yara Karime Vazquez", "comment_text": "Perlita Cabrera"}, {"username": "Mary Evans", "comment_text": "Viator has great options"}, {"username": "Chris Sicker", "comment_text": "Florence 🤓👍"}, {"username": "Kris Carr", "comment_text": "We are planning on driving from Venice to Dolomites - recommended or no??"}, {"username": "Monika Marković", "comment_text": "Viator for buying any type of tour tickets etc."}, {"username": "Deborah Schroeder", "comment_text": "I don't think you need group tour for the Vatican Museum or St Peters. Just get a skip the line first thing in the morning, do your homework on what you want to see and the history about it. As for the Colosseum, just walk around it and you will be amazed. If you want to go inside, then again skip the line first thing in the morning and do your homework. Have a great trip."}, {"username": "Jamie Peterson Delgado", "comment_text": "Guided tour for the Vatican but you don’t really need a guide for the colosseum. Buying through Viator will allow you to skip the line and save you HOURS of wait time to get in."}, {"username": "Jennifer Jennifer", "comment_text": "100% without a doubt get the guided tour with a skip the line ticket.\n\nGo to Florence it is fabulous"}, {"username": "Rose Stolarek", "comment_text": "Would not drive in Naples"}, {"username": "Elaine Armstrong", "comment_text": "You will need a car in Tuscany so just rent one there, check out the Val D’Orcia and satay in Montepulviano it’s fabulously beautiful and the heart of Tuscany. Take the train to other destinations…we\ndid that and it worked out nicely!"}, {"username": "Nancy Fricke Corsi", "comment_text": "Guided tour for sure"}, {"username": "Jenny Payne", "comment_text": "I only train, two worst cities to have a car, I go every year and only train 🌻"}, {"username": "Darlene Dommermuth", "comment_text": "Florence 💯!!!!!"}, {"username": "Marilyn Kelly", "comment_text": "The guides move you around like a school trip + shout their orders at you"}]}, {"id": "2203796336686111", "text": "I will be in Rome for about 9 days. Is there a City Pass that give you access to all attractions and transportation for a week? Or is it best to buy individual passes to places of interest?", "link": "facebook.com/groups/1373361046396315/permalink/2203796336686111/", "likes": 2, "comments": []}, {"id": "2203796376686107", "text": "Are water bottles allowed inside the art museums, or do they have to be contained inside a bag? (Was planning on just carrying a small purse & hold my water the whole time)", "link": "facebook.com/groups/1373361046396315/permalink/2203796376686107/", "likes": 0, "comments": []}, {"id": "2203802103352201", "text": "Can someone suggest an amount of euros needed for 3 weeks in Italy. I’m finding not many banks are providing this service and our bank is charging a fortune. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2203802103352201/", "likes": 0, "comments": [{"username": "Pietro Adami", "comment_text": "You will mostly pay with your card so … maybe 300€ per person .. and if you need more, get them at a Bank ATM with your card"}]}, {"id": "2203804396685305", "text": "What is everyone's favorite authentic food spots/restaurants in Rome, Florence, and Prianao?\n\nI am looking for nontourist spots and more authentic places with amazing food. Does not have to be inexpensive. Amazing views are a +.\n\n\nMost of the restaurants on TikTok/Instagram are all very touristy, trying to go for something not in that direction.\n\n\nDishes… आणखी I am interested in:\nCarbonara (of course)\nTruffle Pasta\nFlorentine Steak\nNeapolitan Pizza\nRoman Pizza\nPanino's\nGnocchi\nArtichokes\nSeafood (I am allergic to clams, mussels, & scallops but any other shellfish/seafood is perfectly fine)\nTuscan Wine\nI am very open to any dish and 100% willing to try other things I am very adventurous when it comes to food, these are just some things on my bucket list. Thank you in advance for any recommendations!", "link": "facebook.com/groups/1373361046396315/permalink/2203804396685305/", "likes": 4, "comments": [{"username": "Laura DeCicco", "comment_text": "Carbonara-Rosci\noli in Rome\nartichokes-Nonn\na Betta-Jewish Ghetto, Rome\n\nUse the search option for more answers"}, {"username": "Tara Roed", "comment_text": "Yes I second roscioli. All of their pastas were amazing. Sadly artichokes are out of season now"}, {"username": "Elena Eugeni", "comment_text": "For Roman-style pizza I love love love Elementare Trastevere"}, {"username": "Samantha Boyke McFall", "comment_text": "Cacio e Pepe is a must in Rome too! We went to Roma Sparita 👌👌 i heard most restaurants in the Trastevere area of Rome are amazing!"}, {"username": "Lesley Vullo Pino", "comment_text": "Non touristy and the best Truffle gnocchi in Firenze at I' MANGIARINO !! Antonella was awesome!"}, {"username": "Nancy Kirby", "comment_text": "Florence- Trattoria Anita"}, {"username": "David Johnson", "comment_text": "I had a truly scrumptious saltimbocca at Ercoli in Trastevere. I went to Italy last September and I’m still thinking about it"}, {"username": "Tony Campanella", "comment_text": "Rome: Vladimiro\nFlorence: Bucca Mario\nPraiano: Trattoria da Armandino"}, {"username": "Nicole Gouzoules Sheehan", "comment_text": "A few favorites, all delicious and reasonable. Mastrociccia, Osteria St. Ana (crispy artichoke was to die for), Mimi e Coco Trast (Trastevere), Dilla (not far from Spanish steps)."}, {"username": "Suzanne Mills", "comment_text": "I suggest asking the locals not tourists here!"}, {"username": "Alice Francesca", "comment_text": "In Rome: Roma Sparita, Matricianella and Nonna Betta in the jewish quartiere for artichokes"}, {"username": "Michelle Rigdon", "comment_text": "I’m Praiano we loved Il Pirata (their pasta Nerrano) is wonderful!\nThe truffle pasta was great at Kasai\nWe are going to La Strada tonight and have heard it’s one of the best in town.\nThe fish of the day (usually a Sea Bass or Snapper) was delicious at all the places in town as well."}]}, {"id": "2203806130018465", "text": "We will be in Rome Sept. 4-6 and I regret not buying our tickets yet!! What sites would you recommend booking a tour for, and what sites can we just buy a skip-the-line ticket for (if needed at all). The Vatican is already sold out so I will have to purchase a ticket/tour from an agency. Any other Rome tips welcome as well, as it's our first time!", "link": "facebook.com/groups/1373361046396315/permalink/2203806130018465/", "likes": 3, "comments": [{"username": "Jessica Palladino", "comment_text": "Do not use crown tours! They scammed us over 600 dollars."}, {"username": "Gianna Onesi", "comment_text": "Do Skip the line on Get your Guide or Viator"}, {"username": "Liz Cooper", "comment_text": "Just relax and enjoy the city. So much to do. Take a Metro to see the great basilicas. The art and the buildings are so amazing. Walk the streets, sit and drink coffee or Prosecco and people watch. See great monuments as Romans do: as part of fabulous streetscapes, go to less tourist visited areas like EUR, the monumental buildings there that Mussolini had built to try to rival Ancient Rome, walk in the parks on the Appian Way and elsewhere, eat great food,. The list could go on for pages."}, {"username": "Linda Yanni", "comment_text": "You will need tickets to get in the Borghese Gallery, gorgeous sculptures. I think you have to pay $5 to get into The Pantheon, but hopefully you can still show up and walk in after paying. Golf cart tours?"}, {"username": "Katie Ehlers", "comment_text": "Agency and tour companies don’t have extra tickets. If it’s sold out, it’s sold out. As an advisor, don’t fall for buying from someone that could likely cancel on you."}, {"username": "Barbara Coldren", "comment_text": "Use Travelocity"}, {"username": "Michele Levesque Semosky", "comment_text": "Tickets for the Colusseum for your dates have not even gone in sale yet! They appear 30 days in advance, so get familiar with the website coopculture.it now. They will sell out or be limited to some times of the days, but you can still do it!!"}, {"username": "Lisa Valdovinos", "comment_text": "We went on a street food tour. We had amazing food and learned a lot about the city."}, {"username": "Gail Fraioli", "comment_text": "Buy your tickets 🎫 it will make your life easier. Take a Vatican tour well worth it."}, {"username": "Sonita Sandhu", "comment_text": "Get your guide or viator! Hopefully you are able to get into the Vatican. I booked 2 months in advance as that’s the earliest you can do. I know many people don’t realize how fast they go especially now with everyone traveling. If not you will have to come back again one day! This was my 2nd trip and only went to the Vatican as last time it was closed last time. It’s fun walking around and seeing all the other sites."}, {"username": "Roland Trego", "comment_text": "Can you get book the Galleria Borghese?"}, {"username": "Maria Urdi", "comment_text": "Do a tour. Try Airbnb Experiences and Viator for city tours and others to places of interest"}]}, {"id": "2203808263351585", "text": "Headed to Piedmont region this week. Are there any recommendations\nof towns we must go to?", "link": "facebook.com/groups/1373361046396315/permalink/2203808263351585/", "likes": 0, "comments": [{"username": "Anna O'Connor", "comment_text": "Alba is lovely. It has a fabulous market which fills all the squares every Saturday."}]}, {"id": "2203812070017871", "text": "Looking for authentic Italian restaurant in Civitavecchia", "link": "facebook.com/groups/1373361046396315/permalink/2203812070017871/", "likes": 0, "comments": [{"username": "Gaetano Guttadauro", "comment_text": "Seriously"}]}, {"id": "2203819456683799", "text": "Any recommendations for hotel near Milan LIN airport? Just need one night to sleep before flight. Nothing too fancy and nothing dumpy either. Lol", "link": "facebook.com/groups/1373361046396315/permalink/2203819456683799/", "likes": 0, "comments": []}, {"id": "2203821500016928", "text": "Will be in Milan for a night in September!!! Is it the type of Italian city we can walk around and just find a place to eat while sightseeing or should we make a reservation??? Suggestions for dinner??? Will be there for my 50th birthday 🎂", "link": "facebook.com/groups/1373361046396315/permalink/2203821500016928/", "likes": 1, "comments": [{"username": "Laura Adams", "comment_text": "Someone help a girl out here 😂"}, {"username": "Jeff Gentner EA", "comment_text": "If you are around the Duomo area, you should be fine walking around. There are several restaurants in and around the Galleria and we never needed reservations for two, as there are plenty of choices."}, {"username": "Jeff Gentner EA", "comment_text": "Ravizza for Happy Hour. Not far from the Duomo. Cocktails come with complimentary food - enough for a light meal."}, {"username": "Maria F. Ruiz", "comment_text": "There are many good restaurants in the Brera district, not far from the Duomo, but not in a touristy area. Walk Via Mercato and go into the little streets."}, {"username": "Renae Larcus", "comment_text": "I don’t think you will need reservations. But not to be a travel grump but we had the worst pizza of our lives in a Milan restaurant. It was near the Galleria and probably too touristy. You will find something good I’m sure"}, {"username": "Seda DC", "comment_text": "Osteria Serafina, need reservations. Best food in Milan ."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2203828403349571", "text": "Question about car rental and ZTL, sorry if it’s been asked before but I couldn’t find the answer when using search tab..\nwe’re returning our rental in Florence and the drop off site looks to be in city center. How can I avoid ZTL zone if I need to go in the city center to drop the car off.\nThank you in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2203828403349571/", "likes": 1, "comments": [{"username": "Pietro Adami", "comment_text": "Usually customers get, when returning the car (or arriving at hotels) a temporary permit “ex post”. The employee or concierge communicates the plate number to the local police and they will issue the permit and withdraw the fine. Better check with the rental company"}, {"username": "Steve Grossman", "comment_text": "Put the address in your g p s And it will take you directly there on the correct road"}, {"username": "David Silverstone", "comment_text": "The ZTL zone is only some streets in the centre. Google maps will direct you around those streets."}, {"username": "Stacey Esposito", "comment_text": "The car rental company puts your license plate into the system so you don't get a ticket. We rented from hertz for 2 legs of our trip and this is how they explained it to us. Additionally if your hotel is in the ztl zone the hotel puts your license plate into the system. Our hotel in florence was in the ztl zone. My husband dropped us off before returning the car. I told the hotel Manger as we were checking in and he just asked for our plate number."}]}, {"id": "2203837706681974", "text": "Headed to Verona in a few weeks. Are there any must see things that require advance booking?\nOr is it fairly ok to book day of while there?\n\nWe’d like to see the arena, “Juliette’s balcony”, piazza.\n\nThanks.", "link": "facebook.com/groups/1373361046396315/permalink/2203837706681974/", "likes": 0, "comments": []}, {"id": "2203838040015274", "text": "Hi all. We were looking at Tour companies for Rome and Florence. We saw Headout and Viator. Most reviews favored Viator. We will be spending 3 nights in Florence and 5 in Rome. And Yes we will be traveling mid August. - Business trip - We are excited to go and experience Italy. We have never been before. Any comments or suggestions would be helpful. Thank you in advance. Stephanie", "link": "facebook.com/groups/1373361046396315/permalink/2203838040015274/", "likes": 1, "comments": [{"username": "Katie White-Meade", "comment_text": "Viator was completely dodgy for us. What was in the add was not on offer when we arrived."}, {"username": "Renae Larcus", "comment_text": "Look at Walkabout Tours from Florence."}, {"username": "JeriLynne Clifford", "comment_text": "Try Get Your Guide. Never had a problem"}]}, {"id": "2203839480015130", "text": "My favorite view of Lake Como from our hotel room♥️", "link": "facebook.com/groups/1373361046396315/permalink/2203839480015130/", "likes": 20, "comments": [{"username": "Hardeep Natt", "comment_text": "Which hotel"}, {"username": "Dámaris Ojeda Fernandez", "comment_text": "Que hotel?"}, {"username": "Denise Incandela Boccio", "comment_text": "Denise Incandela Boccio"}]}, {"id": "2203845570014521", "text": "Looking for recommendations for restaurants in Rome that are not touristy, delicious and reasonable prices.", "link": "facebook.com/groups/1373361046396315/permalink/2203845570014521/", "likes": 0, "comments": [{"username": "Scott Perry", "comment_text": "Masto in Testaccio is pretty great."}]}, {"id": "2161880160877729", "text": "HOTEL DON FERRANTE 5* - PUGLIA\nA romantic and charming getaway for two\nDon Ferrante is a charming house in Monopoli Old Town, an ancient fortress on the reef, close to the sea, in an enchanting atmosphere.From… आणखी the moment you wake up, the sea breeze will follow you for the whole day, whilst the calm sea will be your soundtrack as you fall asleep.This stunning boutique hotel only has 10 rooms, meaning that this is the perfect place to seek peace and romantic moments. Unwind, relax and wonder if life can get any better than this…\nBook here for the best price: https://bit.ly/3NZqbmQ", "link": "facebook.com/groups/1373361046396315/permalink/2161880160877729/", "likes": 5, "comments": []}, {"id": "2203160506749694", "text": "DAY 11 - MARINA DI TARANTO\nThe sand is so transparent that the water takes on Caribbean hues, especially on days when the wind is blowing from the north 😍\nWhere to stay: Masseria Bagnara\nA small masseria, hidden… आणखी in the backyard of a small village, close to the city of Taranto and only a 1 km from the sea...simply magical!\nHave a look here: https://www.dpbolvw.net/click-100692842-11552042?url=https%3A%2F%2Fwww.tripadvisor.com%2FHotel_Review-g2370789-d1886914-Reviews-Masseria_Bagnara_Resort_Spa-Lizzano_Province_of_Taranto_Puglia.html\n#taranto #puglia #masseria #apulia #beach #BeachLife #beachvibes #beachlover #sea #sealovers #seascape #woderful #apulianholidays", "link": "facebook.com/groups/1373361046396315/permalink/2203160506749694/", "likes": 7, "comments": [{"username": "James-Kathy Dickerson", "comment_text": "Beautiful going in Nov...any info greatly appreciated"}]}]