[{"id": "2200032813729130", "text": "Any recommendations for the best places to eat in Taormina? We don't have a specific cuisine, just looking for great experiences.\nThanks for any input! I'll be there in 13 days!!!", "link": "facebook.com/groups/1373361046396315/permalink/2200032813729130/", "likes": 0, "comments": [{"username": "Alice Francesca", "comment_text": "Taormina = cannoli.The freshest ones at Minotauro"}]}, {"id": "2200031280395950", "text": "Good friend just returned from Italy/Switzerland. She was telling me to cross the border from Italy into Switzerland it is €70 EACH TIME😱. Is this accurate? Is the tag/toll good for only thet time and date or is it good for a week?\nThis is NOT the €40 fee tag to drive in Switzerland. Hoping someone here has information.", "link": "facebook.com/groups/1373361046396315/permalink/2200031280395950/", "likes": 0, "comments": []}, {"id": "2200030180396060", "text": "Just announced that starting in 2024 ALL Americans visiting Europe MUST have a ETIAS VISA accompanied by their Passports to enter Europe. Can anyone enlighten me on this subject? I am a bit confused.", "link": "facebook.com/groups/1373361046396315/permalink/2200030180396060/", "likes": 1, "comments": []}, {"id": "2200029663729445", "text": "I’m going to Florence next week and I’m wonderring if there’s a fee, or need a ticket to go climb the Duomo?\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2200029663729445/", "likes": 16, "comments": [{"username": "Vasthi Cheddar", "comment_text": "Yes. You need the Brunelleschi pass and it gives you access to everything. 30€ pp"}, {"username": "Brian Johnson", "comment_text": "Last time I went inside I don’t recall a fee just to enter, but it’s been some years. Yes to climb."}, {"username": "Jim Kelleher", "comment_text": "You absolutely have to buy the ticket in advance. They limit the number of people in the dome at a time so you cannot just walk up and buy that ticket."}, {"username": "Evelyn Trager Jose", "comment_text": "What Vasthi said! You also can climb Bell Tower with that pass and you have three days to see all the things connected to Duomo - baptistery, museum, bell tower, and church (church is free but you get the short line)."}, {"username": "Mike Crawford", "comment_text": "https://\nduomo.firenze.it\n/en/720/\nbrunelleschi-pas\ns"}, {"username": "Glenn Todd Webb", "comment_text": "You need an advanced purchased ticket"}, {"username": "Albert Soifer", "comment_text": "A ticket to the top balcony can be purchased when you get there. You lower level is free to enter as of last year."}, {"username": "Julie Ouellette", "comment_text": "Thanks! I bought the tickets 😄🇮🇹"}, {"username": "Fred Pugeault", "comment_text": "Surtout de la patience 😉"}]}, {"id": "2200027693729642", "text": "Has anyone driven a rental car in and around Siena… I’m going on late September and thinking of renting and driving around Tuscany for a couple of days", "link": "facebook.com/groups/1373361046396315/permalink/2200027693729642/", "likes": 1, "comments": [{"username": "Simone Pfenninger", "comment_text": "Pretty easy, but I advice you to book a hotel with parking/garage in house!"}, {"username": "John Selvaggio", "comment_text": "Definitely ok. I rented a Tesla from Hertz at Rome FCO airport and drove it all over Tuscany with no problem. Parking also no issue. Be sure to visit Pienza. It was surprisingly beautiful!"}, {"username": "Sedalise Hernandez", "comment_text": "We have! Very easy!"}, {"username": "Renae Larcus", "comment_text": "Yes. Either have a hotel with parking or there are also two large parking areas inside the walls."}, {"username": "Sandra Shoffner", "comment_text": "We always parked at the San Francisco parking lot easy to find."}, {"username": "Joe Ducey", "comment_text": "We rented in Florence and drove to Montalcino. Florence was a bit of a hassle for pick up and drop off as it was right on the edge of the ZTL, but driving around Tuscany was a blast."}, {"username": "Kathy Tully Sexton", "comment_text": "We are here now. Picked up our car in Pisa. Stayed inside the walls of San Gimignano and now Montepluciano. It is nerve wracking to drive inside the walls to drop luggage but very cool. I would do it again in a heartbeat. Check your hotel as one we had to park in the paid public lot and the other had spots allotted in a remote lot. Both were a bit of a walk."}, {"username": "Laura Uribe", "comment_text": "A large area of Siena is ZTL. Make sure your hotel is outside the walls or that the owner is letting the police know your license plate number. There are a lot of tickets to be had if you drive where you’re not allowed."}, {"username": "Doug Burke", "comment_text": "We did that and after the first night parking it in the VERY expensive parking garage, I parked it in the neighborhood to the west past the soccer stadium for free. A little walk but not a big deal (for me anyway). And I only had to note which streets had no parking for that particular day because of street sweeping. Worked VERY well."}, {"username": "Ryan Monahan", "comment_text": "We just did, and absolutely loved driving around there."}, {"username": "Carole Tarlap", "comment_text": "Be sure to get an International Drivers license. You can get one at AAA. ALSO....get FULL coverage 💥"}, {"username": "Manuel Macias", "comment_text": "Rented from Hertz in Florence"}, {"username": "Judy Jamieson Pisano", "comment_text": "There is a very convenient parking garage east to get to from the ring road."}, {"username": "Alice Francesca", "comment_text": "Yep! Drive south towards Pienza and the Val d'Orcia!\nHotel Chiostro di Pienza"}, {"username": "Santo Finocchiaro", "comment_text": "We rented a car at the FCO Airport. Drove to Orvieto, the to Cosole d'elsa which is part of Siena. Highway driving is easy, but there are tolls. If you don't have an itlalian easy pass. You can use cash, just look at the signs that have a picture of a coin."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2200026783729733", "text": "Looking for advice on getting from one city to another. This is our draft itinerary of the middle part of our trip:\n\n\nPompei to Matera - we are considering a bus (tour Pompei in the morning then there is one bus about 3:40pm )\nMatera to Bari - Spend a couple of nights in Matera then we are considering a bus to Bari (1 hour bus ride)\nBari to Tropea - Spend a couple of nights in Bari, then we are considering renting a car ( the closest drop off seems to be the airport an hour train ride away. so 3.5 hour drive, then 1 hour train ride)\nTropea to Reggio Calabria - Couple of nights in Tropea then we are considering taking a train. (Trenitalia 1.5-2 hour ride)\nReggio Calabria to Siricusa - One night in RC then ferry to Messina, then train to Siracusa (3 hour train ride, Trenitalia)\nSiracusa to Cefalu - Couple of nights in Siracusa then considering train (5+hours Trenitalia) or hiring driver (drive is about 3 hours) or rent a car.\nCefalu to Palermo - Few nights in Cefalu then train to Palermo\nPart of the reluctance to just rent a car for this entire segment is that it seems hard to drive in the cities, hard to park in the cities, reluctant to drive through mountains, and pick up/drop off does not seem convenient in some areas.\n\n\nHow are the roads driving through the mountains from Siracusa to Cefalu? from Bari to Tropea? From Pompei to Matera?\nWould the cost of hiring a driver compare to the cost of renting a car?\nAny bus companies better than others, companies to avoid?\nWe are open to switching the order around somewhat.", "link": "facebook.com/groups/1373361046396315/permalink/2200026783729733/", "likes": 0, "comments": [{"username": "Agnese Arnó Ch-Ch", "comment_text": "Hiring a driver will be much more expensive.\nAll the places you are going aren’t too difficult to drive in, a part from Bari and Palermo maybe. Just ask the places you are sleeping in to help you with the parking, when you arrive there you can move by bus in the city but you’ll be able to visit the surroundings by car. By car you’ll be able to see much more, do some beautiful detours and stop in every little village you’ll like: you’ll enjoy the countryside and the stunning places you will be visiting.\nI think one night in Matera will be enough to see all there is to see, unless you want to have a relaxing break or visit the surroundings.\nI’d add a night in Bari and maybe switch it with somewhere slightly more south like Ostuni to enjoy other places in Puglia (Ostuni, Lecce, Otranto are stunning) and not have to drive too much."}]}, {"id": "2200018910397187", "text": "Yes.... it is one of these questions - Grape Stomping with Feet (but not part of a tour!!!!).\n\nWe will be staying in Tuscany, near Volterra, for 2 nights. My mother-in-law is so excited to do the grape stompingआणखी experience. I see tours from and back to Florence that include this as part of a day trip (at an undisclosed location), but I don't want a day trip.. some wine tasting and grape stomping we can drive to would be perfect.\n\nAnyone know vineyards or locations I can contact that may have this tourist part-trick available without the whole day/tour commitment?", "link": "facebook.com/groups/1373361046396315/permalink/2200018910397187/", "likes": 0, "comments": [{"username": "Benedetta Vanni", "comment_text": "My opinion: your request is very naive and shows an idyllic idea of this country. Harvesting grapes and making wine is a job for professionals, not a game for tourists.\nInfo: grape harvest happens between mid august and mid september so the first thing you should do is plan the right timing for your trip."}]}, {"id": "2200008353731576", "text": "I am trying to get a ticket from the Colosseum official site directly. Technically the tickets for each day become available exactly 30 days sooner, same time as the first ticket. Before that time the days show blocked and you can’t really click and choose anything, but what I see everyday is that on the exact time, the new day gets unblocked withआणखी no availability for any tickets. It seems like the 30 day rule is just a formality. Any thoughts on why this happens? When I keep looking during the day, some random spots within 30 days becomes available once in a while, but it’s very random. I am not sure why the new day opens up with no availability right off the bat! Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2200008353731576/", "likes": 0, "comments": []}, {"id": "2200003590398719", "text": "Looking for a private or semi private day tour from florence to Tuscany. Any recommendations ?", "link": "facebook.com/groups/1373361046396315/permalink/2200003590398719/", "likes": 1, "comments": [{"username": "Patty Gaskin", "comment_text": "i would like to know too"}, {"username": "Allison Carlisle Young", "comment_text": "Try limousinrome.co\nm they had one"}]}, {"id": "2200001493732262", "text": "Hello everyone! New here and first post😊. I will be traveling to Italy in September, be in Venice for a few days, going on a cruise, and returning for a couple more days.\n\nMy question is this, we get off the ship on Sunday, fly out of Marco Polo on Tuesday BUT REALLY want to go to Rome before we leave!!! Is this doable?", "link": "facebook.com/groups/1373361046396315/permalink/2200001493732262/", "likes": 0, "comments": [{"username": "Heather Hills Jacobs", "comment_text": "Venice Group Services helped us with private transfers and that made it all possible!"}]}, {"id": "2200000757065669", "text": "Please I need advise… i don’t know if anyone have experience this before.. We arrive in Milan today.. our place is few steps away from Duomo… our day didn’t start well.. 2 out 4 rooms we booked were not ready for check in.. last room we finally check in at 5 pm.. after settling in our room not even an hour later power went out… until now as amआणखी typing no power.. thank goodness there’s a breeze and its not too bad… but now as we are getting ready to sleep we find bed bugs… we were already in contact with the place the manager said if there’s a room he can put us he would… i tried calling one place but to no avail… just checking if any recommendations that’s centrally located or any feed back.. ideas on how to best handle this situation at this point.. thank you all i advance", "link": "facebook.com/groups/1373361046396315/permalink/2200000757065669/", "likes": 0, "comments": [{"username": "Don Dennis", "comment_text": "I feel bad for you, I would be on the next can I could get and find somewhere else to stay. I wonder if insurance would cover additional expenses because old bed bugs?"}, {"username": "Graham Sherlock", "comment_text": "First thing I would do is get your luggage off the ground and lock it shut tightly, you don't want bugs getting in there or you will take them everywhere with you, including back to your home country."}, {"username": "Dave Conroy", "comment_text": "This sucks badly. How did you find this place and what are you paying per night."}, {"username": "Jennifer Neri Hodges", "comment_text": "If you are able wrap luggage up in garbage bags to keep bed bugs out of your things"}, {"username": "Diane Bolinger", "comment_text": "It’s been said to store your luggage in the bath tub to keep bed bugs from getting into your luggage. Read this years ago."}, {"username": "Rhonda Lyons Erkie", "comment_text": "Please tell me your are not at the Hilton heading to Milan next week"}, {"username": "Rachel Doocey", "comment_text": "We are currently in Uptown Palace Hotel, it’s about 10 minutes walk from the Duomo but it’s a lovely hotel x"}, {"username": "Yekcim Krej", "comment_text": "which hotel are you staying? is it the corner duomo hotel?"}, {"username": "Suzanne Felder", "comment_text": "Name of hotel please ! 🙏"}, {"username": "Laurie Denoni", "comment_text": "May be due to the major storms in Milan?"}, {"username": "Sh Kaplan", "comment_text": "Can you tell us the name of the hotel?"}]}, {"id": "2199999957065749", "text": "I’m trying to plan a trip to Italy for next summer and I’m trying to decide how much we can do. How long do I need in each of these places? I know everyone’s opinions are going to vary….we’re just trying to get different people’s opinions. Thank you.\n\nAmafali coast\nNaples\nRome\nFlorence\nMilan\nLake como\nVenice", "link": "facebook.com/groups/1373361046396315/permalink/2199999957065749/", "likes": 9, "comments": [{"username": "Sandy Radican Shikaly", "comment_text": "The Amalfi Coast is 25 miles with 13 towns... pick a couple... you need at least 3 days in a city or you will only be packing and unpacking.. take high speed trains between major cities.. That is a big itinerary unless you have a lot of time."}, {"username": "Amy Sandler Riemer", "comment_text": "I was recommended to 2 days Venice, 2 days Florence, unless you want to see every museum then maybe 3. then venture to smaller Tuscany towns. For example we are staying 3 nights Florence and one night in Siena to see Siena and San Gimignano. 3 days Rome is enough for most. Milan 1-2 days."}, {"username": "Manuela Bonazzi", "comment_text": "Milano si può evitare senza rimpianti."}, {"username": "Marie Cuzzi", "comment_text": "Summer is the busiest and hottest time of year I would push your trip to mid September into October the weather is perfect\nMid 70’s during the day and 60’s at night and tourist season is over"}, {"username": "Renae Larcus", "comment_text": "Sorrento instead of Naples and see the Amalfi Coast towns from there as a base"}, {"username": "Ann Marie", "comment_text": "In my opinion you can see the key highlights of Milan and Venice in one day. If you stay in Milan for two nights you can do a day trip to lake Como. Florence, Rome and the coast require a few days. I would skip Naples."}, {"username": "Roland Trego", "comment_text": "Amalfi Coast: 4-5 days\nNaples: 1.5 days including Pompei\nRome: 3-4 days\nFlorence: 2 days, + 2 days for Siena, Lucca, and/or San Gimignano\nMilan: 1 day for historic sights\nLake Como: 3 days\nVenice: 2 full days and nights"}, {"username": "Michelle Solak", "comment_text": "Depends what you want to see!\nI would say\nVenice 2 nights\nRome 3 nights\nAmalfi coast 4 nights\nPersonally I’d skip Naples\nHaven’t been to to the others but if I were going to Florence I’d do 2-3 nights"}, {"username": "Nancy Day", "comment_text": "We have at least 3 weeks planned for the spring .Hard to fit all in.So we thought another trip after that.We are thinking Rome, Florence ,\nVenice, Sorrento (day trip to Matera & Alberobello and Capri) & Sicily"}, {"username": "Cheri Arrowood-Stanziano", "comment_text": "Just remember that Italy is oppressively hot 🥵 in July and Aug"}, {"username": "Anna Alves-Regalado", "comment_text": "Danny Regalado"}, {"username": "Angela Gilmore", "comment_text": "I would do\nAmalfi coast (choose a couple of towns) 4 days\nNaples (including Pompei) 2-3 days\nRome 3-4 days\nFlorence 4 days and I would see also other cities near it\nVenice 1-2 days\nI would skip Milan or use it only as bese for Como Lake"}, {"username": "Abe Michelson", "comment_text": "My attitude is go big or go home. How long is this trip. Honestly to give it Justice. You need a month. For 99% of us right now. That isn’t possible. You are seeing a lot of Italy in this trip. Even with high speed trains it will eat at your time.\n\nEither Do Rome & Naples and Amalfi.\n\nOr Do Florence & Tuscany fur say 5-7 days with day trips to Sienna, Bologna, Pisa & Lucca and Winery’s\n&\nRome or Venice. Venice you probably need 3 days top. Rome. A full Week.\n\nDo Florence, Milan, Lake Como & Venice."}, {"username": "Roula Abaci", "comment_text": "Amalfi and Naples 4 days\nRome 3 days\nFlorence 4 days\nMilan 1 day\nLake como 3 days\nVenice 2-3 days\nYou definitely need two good weeks for all this\nAnd I would fly into Milan and fly out of Naples so your not criss crossing the country. Save Amalfi for last because after all those cities your going to want to just relax by the beach. No need to stay in Naples it’s a day trip so just stay on the Amalfi coast. My favorite towns are Minori or miaori. They have great beaches and are not as crowded as some of the other towns."}, {"username": "Marina Belardo Johnson", "comment_text": "Amalfi coast 3 days\nNaples 3 to 5days\nRome 3 to 5\nFlorence 3\nMilan 1\nLake como 1\nVenice"}, {"username": "Cheryl Novis", "comment_text": "I would do 3 to 4 days in most places but would definitely leave out Naples. Lake Como maybe 2 days. I never went to Milan so can’t say. You can do a day trip from Florence to sienna and the wineries. I went to Amalfi last and stayed in Sorrento- did day trips to Capri and Positano and Amalfi we went beginning of June it got hot but nothing like July August"}, {"username": "Jenny Payne", "comment_text": "I love Naples, but a lot don’t so rather than feel disappointed I would do Rome, Florence, lake Como stay in Bellagio & do a few islands , Milan one day ( I’ve been to Milan a few times not that keen) then do Venice on your way bk to Rome if that’s where u fly out from + depends on how much time you have and every day u travel u loose a day as most hotels and airb&b’s can’t get in till after 3pm🌻"}, {"username": "Luca Lookone Ferrentino", "comment_text": "Naples has as much to see as Rome or Florence. People saying \"skip Naples\" don't know s*it about Naples, they've probably walked 200 meters outside the station just to get a pizza on the way to Sorrento. Naples needs a bit of an effort by the visitor before approaching its complexity."}, {"username": "Michela Esse", "comment_text": "Skip Milan.\nAdd more nights to Rome."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Avoid going in the summer if you can!"}, {"username": "Barbara Bastianini", "comment_text": "Everyone’s different. These would be my suggestions based on my own interests and style of travel.\n\nAmalfi Coast 3 or 4 nights\nRome 5 nights\nFlorence 3 or 4 nights\nMilan 2 nights\nLake Como 2 nights\nVenice 3 or 4 nights.\n\nNaples is not a favorite with me so I’d skip it to have more days in the other places. But, truthfully, I’d be tempted to skip Lake Como too. It’s beautiful but just doesn’t appeal to as much as the other destinations do. But again, everyone’s different. And it all depends on what you want to do in each location"}]}, {"id": "2199999840399094", "text": "Hi Folks. I am planning to travel Italy this October for 10 days trip. But I haven't been started looking at locations and attractions to visit.Is it too late to start planning for this Oct? Can you all please give me suggestions on the places(cities) to visit. Should we also book the trains now for this journey? Thanks much in advance. Highly appreciate the response.", "link": "facebook.com/groups/1373361046396315/permalink/2199999840399094/", "likes": 0, "comments": []}, {"id": "2199998100399268", "text": "Those of you who have visited Rome and Florence in mid/late October: I wonder about the wait time in lines to see the major sites. Will have advance tickets. I am sensitive to heat, especially when standing on my feet for a long period. Will have a reflective umbrella with me. I could also bring a “collapsing stool”. Is this advisable?", "link": "facebook.com/groups/1373361046396315/permalink/2199998100399268/", "likes": 0, "comments": [{"username": "Benedetta Vanni", "comment_text": "In mid-late october you are more likely to find rain rather than heat."}]}, {"id": "2199994887066256", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2199994887066256/", "likes": 0, "comments": []}, {"id": "2199986013733810", "text": "What is the best tour of St. Mark's Basilica, Doges Palace and Dungeons?", "link": "facebook.com/groups/1373361046396315/permalink/2199986013733810/", "likes": 1, "comments": []}, {"id": "2199985327067212", "text": "Which train company…Italia business class or Trenitailia exec class?", "link": "facebook.com/groups/1373361046396315/permalink/2199985327067212/", "likes": 0, "comments": [{"username": "Elena Innocenti", "comment_text": "Trenitalia have:\nStandard - Premium - Business - Executive\nItalo have:\nSmart - Prima - Club\n\nYou can compare\nStandard - Smart\nBusiness - Prima\nExecutive - Club\n\nPremium is like premium economy on some airlines.\n\nPlus Italo have option Executive “Salotto” up to 4 seat in private area.\n\nIn my opinion Business and Prima worth the price difference."}, {"username": "Carol Johnson", "comment_text": "Executive only 10 seat in the cart + a waiting private lounge for only Executive passengers"}]}, {"id": "2199993883733023", "text": "I am a novice and looking to book our 1st overseas trip. Approx 3 weeks. I was thinking of possibly doing a 15day coach tour covering Paris,Rome,Florence,Venice,Amsterdam, London and Swiss Alps.. then a week in italy at a destination of our choosing. There are deals through flight centre Australia. We are mid 40s are we too young for the coach tours? Any advice given would be greatly appreciated.", "link": "facebook.com/groups/1373361046396315/permalink/2199993883733023/", "likes": 4, "comments": [{"username": "Fetchin Gretchen", "comment_text": "Not too young but so many cities in so few days seems like the getting to and from will take away a lot. Better to concentrate on no more than 3 cities as your base and maybe day trips from there. But these cities have so much to offer, even my living 2 months or more in many of them was only enough for a surface view!"}, {"username": "Joanne-Peter Hart", "comment_text": "Not too young. Currently on a coach tour in Slovenia. Half are retired, hubby and I in our fifties, our son in his twenties, a couple mid thirties, and the rest forties. I believe the average age of coach tours is fifties. It is our first European trip and loving it - go for it. But perhaps narrow it down to one country in 15 days, at the most two - the number of places that tour is going to is too much.\nWe also decided no way would we drive on the other side of the road, so coach trip seemed the best option."}, {"username": "Veronica Teixeira Borrageiro", "comment_text": "A cruise is always another option, to see a few countries, but also that you can unpack your bag, for the length of the cruise."}, {"username": "Alice Francesca", "comment_text": "In 15 days? No, to have a flavor of every place you have mentioned you would need at least 4/5 days each..pick the cities you really want to see.And use low cost flights if visiting different countries."}, {"username": "Doug Burke", "comment_text": "The 7 places you referenced in 15 days???? Sure, you'll get those photos of you all in front of the iconic backdrops before you rush off to the next photo shoot so you can post that to you FB page, but you won't be experiencing any of the richness and culture of any of those places. You're treating Europe like it's a theme park and you have to go on all the rides.\n\nEliminate about half those and for those that are left enjoy the things about them that can't be photographed."}, {"username": "Katie White-Meade", "comment_text": "Trip a Deal I have heard are great. Sometimes have 2 for price of 1. Have travelled with Trafalgar and can recommend. Then you can perhaps choose a place to spend time."}, {"username": "Lora de Vries", "comment_text": "For your first overseas trip, cut it down to only a few countries. You will get to enjoy and relax as well. I can totally understand you wanting to do as much as possible especially as this is your first trip, but it may be a bit overwhelming. I've been traveling ever since I was born, and I love it, but it may well be too much for you guys. Whatever you do, enjoy!"}, {"username": "Peach Panfili", "comment_text": "Unless all you want to see is the inside of a bus or train, 5 countries in 15 days is madness"}, {"username": "JeriLynne Clifford", "comment_text": "Our rule of thumb is 3 days in each city. You want to not just see the must sees but feel the culture of the city/country."}, {"username": "Dann Hrusch", "comment_text": "Personally I would skip the Coach tour. I've always planned my own trips and enjoy figuring out the logistics. Public transportation in Europe is incredible, and I would take a train over bus any day. Flights within Europe are often inexpensive too. London to Paris or Amsterdam flight could end up being the fastest and cheapest option. I'd start with a map (real or digital) put some pins where you want to go and start connecting dots and figure out a few routes, then start allotting days and see what you come up with. You might decide it's too ambitious and remove stops, or you might see that another place is on the way and add it."}, {"username": "Melissa Jane Brown", "comment_text": "That sounds like a great trip. No, you're definitely not too young. My 21 year old daughter & I have just been on a 12 day Trafalgar tour of Italy and I was worried that my daughter would feel left out, but no. There were about 6 others on the tour around her age and even 2 young kids with their parents."}, {"username": "Sara Butcher", "comment_text": "I’ve been in 3 organised tours with Insight. They seem to have 40+ age on their tours and their coaches have a lot of legroom so for tall people (me) it was great. I found the tours called ‘Country Roads’ are slower paced with 2-3nights spent in each place and more free time. I loved the Northern Italy and France tours. Add on extra days at the starting and ending points to allow you to do more exploring ❤️🇮🇹🇫🇷🇦🇺"}, {"username": "Joy Buenaflor", "comment_text": "The best way to see a lot of Europe in little time is through an organized tour. Then just go back to the ones you really enjoyed. I did it when I was 21 and met people my age and some younger. I had a great time."}, {"username": "Joanne Nacson", "comment_text": "If the coach tour ticks your boxes in terms of cities and sightseeing - they provide a wonderful overview, your luggage is taken care of, you have a guide, you get easy access to all major sites. However you are often stuck eating at “tourist traps” and hotel buffets. Sometimes hotels are out of town - so check that too. I think a combination of the two as you have suggested is great."}, {"username": "Helen Ladkin", "comment_text": "Also from Australia and as part of a 5week trip to Europe we toured some of Italy with Insight. Our tour had 2 nights in each city apart from 1 night in Assisi. The pace can be quite hectic but we chose to stand down from most of the optional tours so we could investigate a city on our own. Think our tour was 14 days, so to cram all those countries into 15 days, I think most of the sites would be drive by, not a tour. Loved our tour director, driver and our luggage was taken care of."}, {"username": "Alison de Lisle", "comment_text": "We’ve just done 9 days in Croatia which we organised ourselves and we are about to start a two week tour through Italy with GAventures. It’s a small group tour with varying ages. We’re early 50’s which is the older end of the spectrum. I picked this tour as there is plenty of free time and you organise your own sightseeing at each location so I’ve organised visits to museums, an e-bike ride from Lucca to Pisa, visit to the Vatican etc. We stay approximately 2-3 days in each location. I wanted a tour that would take the hassle out of the travel arrangements and to meet some like minded travellers but without being on a very rigid schedule.\nAlso, as a fellow Australian I’ve had very mixed experiences with Flight Centre. Make sure that they select your seats for all of your flights at the time you book. Something our Flight Centre agent did not do. You end up with the worst seats in the middle back and with flights taking 14+ hours, followed by another 7hrs it’s matters where you sit!!"}, {"username": "Sally Warren", "comment_text": "Just book a return flight to Rome. Then do Rome, Florence, Tuscany, maybe Puglia. Public transport is great and a coach tour is boring."}, {"username": "Lara Anderson", "comment_text": "Far better off doing a cruise, unpack once and wake up in a new port nearly every day with the whole day to explore"}, {"username": "Katia Macri-Roberts", "comment_text": "I've been doing bus tours since my early 20's. Definitely good to do for your first overseas trip as everything is included and usually there are no line-ups to get into places and you also make good friendships with your coach mates. Trafalgar, Cosmos and Insight are all great. Perhaps do a tour of Italy (smaller mileage to cover) and then have a week of your own travel once you get your bearings. 15 days to cover all those km's throughout Europe means you'll be on a bus most of the day. Italy is relatively small and each great destination is only a few hours away so you will have way more time to explore and experience. If you are contemplating the south of Italy, I can help you with that. (The south is very different to the north.)"}, {"username": "Susan Murphy", "comment_text": "I've travelled both independently and on coach tours. You can gain a lot of information from the tour leaders and it takes the hassle out of getting from point A to point B, but my main complaint is that they insist on dropping you for hours in the middle of nowhere to shop. I travel to see the country, not to shop. They should offer an alternative for those not interested in retail therapy"}, {"username": "Wendy Morgan", "comment_text": "Have a look at Expat tours online, we are in our 50’s from NZ and are currently on our 6th tour with them, this time to the Balkans. They cater for all ages and give you opportunities to explore independently instead of being led around like a sheep! 😊"}, {"username": "Raymond Capkin", "comment_text": "I'm 68 and too young for coach crap....live a little."}, {"username": "Kathryn Gibson Mirabito", "comment_text": "I am from New Zealand and my husband and I booked everything ourselves - didn't go through a travel agent. We are doing \"Planes, trains, and automobiles\" and the odd ferry. going to France, Italy, Greece, Scotland and England. It is so easy to do and you get to do exactly what you want to. 15 days is not enough time to go to all of those places, you won't even \"scratch the surface\". Especially with the price of the flights to and from Europe.\nWe used a site called Rome2Rio to get a lot of information on transport and used Booking.com to book accommodation.\nGood luck with your planning. Hope you enjoy your trip :-)"}]}, {"id": "2199983353734076", "text": "Heads up, travel to the EU in 2024.", "link": "facebook.com/groups/1373361046396315/permalink/2199983353734076/", "likes": 0, "comments": []}, {"id": "2199972730401805", "text": "Going to Varenna and staying here. Any suggestions for day trips or activities in and around Varenna? Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2199972730401805/", "likes": 0, "comments": [{"username": "Achim Marke", "comment_text": "Boat trip? 😁"}, {"username": "Carolina Barnhill", "comment_text": "Carolina Barnhill"}, {"username": "Carolina Barnhill", "comment_text": "Carolina Barnhill"}, {"username": "Ruth Akutu Maccarthy", "comment_text": "There are two gardens in Varenna. The one I love most is Villa Cipressi!!!!"}]}, {"id": "2199969160402162", "text": "How do I go to Bellagio from Lago Como Station? And best site-seeing", "link": "facebook.com/groups/1373361046396315/permalink/2199969160402162/", "likes": 0, "comments": []}, {"id": "2199967543735657", "text": "Has anyone had problems with shipping the wine to Arkansas? I know when I went to Napa I tried to join a wine club and they said they could not ship into my state but maybe if it’s not part of a subscription I will not have any issues.", "link": "facebook.com/groups/1373361046396315/permalink/2199967543735657/", "likes": 0, "comments": []}, {"id": "2199931457072599", "text": "Anyone ever stay at the Portico D'ottavia Hotel, in ROME, near the Pantheon?\nIs this a good area to be based for 3 nights to tour around?", "link": "facebook.com/groups/1373361046396315/permalink/2199931457072599/", "likes": 0, "comments": [{"username": "Gerry DeJohn", "comment_text": "No normally when I'm in Rome I stay at Motel 6 LOL"}, {"username": "Lisa Mooney Finnegan", "comment_text": "Not our hotel, but we stayed 1 mile from the Pantheon and it was centrally located. We walked to Travestere and the Jewish Ghetto from there as well."}]}, {"id": "2199966093735802", "text": "We are traveling to Rome and Florence in two weeks. What are some good souvenirs to bring home to the kids, and where do I find them? Three boys ages 32, 19, and 18 and two girls ages 31 and 25. Thanks!!!", "link": "facebook.com/groups/1373361046396315/permalink/2199966093735802/", "likes": 8, "comments": [{"username": "Lisa Valdovinos", "comment_text": "There are many street vendors that have a lot of souvenirs."}, {"username": "Cecilia Christine Costantini", "comment_text": "This chocolate. Ever piece of chocolate contains a little note with love/\nfriendship quotes in Italian/\nEnglish and a couple more languages."}, {"username": "Teresa Shawn Lane", "comment_text": "Leather belts and leather purses! Street vendors have cool lights that shoot up like helicopters for younger kids!"}, {"username": "Lisa Schalig-Winter", "comment_text": "Leather in Florence!"}, {"username": "Kathy Flood", "comment_text": "Have wine shipped home!"}, {"username": "Shannon Packard", "comment_text": "I agree with the leather belts, purses, wallets or other leather items, but I recommend buying them from an authentic leather store not one of the street vendors. You will see, every street vendor sells the same items and they aren’t really made in Italy."}, {"username": "Bonnie Loftspring", "comment_text": "For the girls, stretchy Murano bead bracelets, easy to pack, & very popular now you can find them! I wish I had bought more. Or, the leather bracelets, my daughter got me one in blue snake w silver catch, luv it!"}, {"username": "Laura McSweeney", "comment_text": "Olive Oil, hand painted olive oil bottles, spice packets for pasta"}, {"username": "Cherie M VanCleave", "comment_text": "Leather belts or wallets for the guys\nCameo jewelry for the girls or leather handbags"}, {"username": "Elizabeth Yu", "comment_text": "Leather wallets, coin holders, Italian hard candy"}, {"username": "Jenny Payne", "comment_text": "I go a lot and I buy only t shirts with Italy on for young ones, my older boys don’t want me to buy anything as they are all in fashion 🌻"}, {"username": "Christine Malota- Kendall", "comment_text": "I’ve brought home cookies that I bought in the grocery store. Scarfs for the women… leather wallets for the guys?"}, {"username": "Christine Malota- Kendall", "comment_text": "In Florence, for the ladies, these bracelets. They are in a store along the Arno. The past 2 times I visited the owner and bought a few to bring home for family.\nHere is the address:\n\nMadani (store)\nLungarno degli Acciaiuoli, 28/red, 50123 Firenze FI, Italy"}, {"username": "Tracy Foss", "comment_text": "Do you buy them clothes or apparel at home that they wear ? From my experience they don't, it's easy to get carried away buying gifts ect when traveling ( I had to buy a big suitcase to come home from England Scotland & Ireland full of gifts) not really appreciated It was our trip not theirs ! We brought food items home from Spain OK I guess. Now I just bring the grandchildren trinkets & t-shirts. Every family is different and I also realize as much as I can get caught up in the moment & a buying frenzy most of the stuff I think I want I don't really! Just my thoughts & opinions"}, {"username": "Jenny Payne", "comment_text": "Kathy Flood we have Italian food & wine shops in Australia, so for me I would t be bringing those type of things back 🌻"}, {"username": "Debbie Jones Schilling", "comment_text": "Maybe wine that you can only get in Italy. Something local. I hear many wine shops will ship back home."}, {"username": "Fran Monopoli", "comment_text": "My son collects Hard Rock shirts\nThere is a Hard Rock Cafe in Rome! The shirt says Hard Rock ROMA! It’s a great souvenir"}]}, {"id": "2199958550403223", "text": "Hello!\nMy husband and I will be spending one week in Praiano before heading off to Florence then Rome.\n\nDo you think it’s doable to do a day trip to Sicily? Best places to visit or transport\nTrain or ferry.\nThank you 🥰", "link": "facebook.com/groups/1373361046396315/permalink/2199958550403223/", "likes": 1, "comments": [{"username": "Alice Francesca", "comment_text": "If you spending just one day visit Taormina"}, {"username": "Oldriska Balouskova", "comment_text": "You cannot do a day trip from Praiano to Sicily - it’s too far"}, {"username": "Giovanni Pianigiani", "comment_text": "I think you need to put things in perspective: Sicily is only the size of Vermont but with the population of Alabama and the historical heritage spanning some 3000 years: hard to pick a single place for a quick one day tour (not to mention it's about 6 hours drive from where you are)"}, {"username": "Pietro Di Sorbo", "comment_text": "No!"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2199958063736605", "text": "We are going on a Cruise (Oceania) starts in Monaco then ends in Venice. We have booked 3 rooms for us at hotel Olimpia Venice. We will stay 2 nights. Any one stay at this hotel?\nAny suggestions? We will need transportation for 6 from cruise ship to hotel and transportation to sight see. This is 9/22-10/4. Thank you for any advice.", "link": "facebook.com/groups/1373361046396315/permalink/2199958063736605/", "likes": 0, "comments": []}, {"id": "2199956947070050", "text": "What adapter or charger should I buy to use my USA hair dryer/straightener and iPhones:iPads in Italy? Please advise.", "link": "facebook.com/groups/1373361046396315/permalink/2199956947070050/", "likes": 0, "comments": [{"username": "Madeline Caporale", "comment_text": "Do not take a 110 hair appliance to Europe, in all likelihood you will ruin it. Highly recommend that you purchase a dual voltage prior to leaving or purchase something in country. With that said, all you need is an adapter with USB ports built in."}]}, {"id": "2199952737070471", "text": "Hi everyone,\nWhich glass making class would you suggest in Murano would you suggest? I see they are all over. Very cool.", "link": "facebook.com/groups/1373361046396315/permalink/2199952737070471/", "likes": 0, "comments": []}, {"id": "2199957617069983", "text": "What to do in capo vaticano and is there a train to rome tks", "link": "facebook.com/groups/1373361046396315/permalink/2199957617069983/", "likes": 0, "comments": [{"username": "Miyuki Kanno Paul", "comment_text": "Google Map shows that you can take trains to the nearest station. Set the departure at 0500 and see if the schedule fits you"}]}, {"id": "2199954417070303", "text": "My husband and I are traveling to milan, genoa, cinque terre, Florence, bologna, Rome, Naples, Sicily, Tuscany and Parma in October. Can anyone recommend a cheese making tour/ experience in any of these locations?\nThank you in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2199954417070303/", "likes": 1, "comments": [{"username": "JeriLynne Clifford", "comment_text": "We went to a Parmesan place outside of Modena that was lovely but it is not hands on but a tour. Also went to a balsamic place and it was so interesting"}, {"username": "Stefano Follador", "comment_text": "In Parma area I suggest you a visit to busseto or roncole verdi. Really nice cheese producer (parmigiano reggiano and grana padano) and prosciutto or culatello."}]}, {"id": "2199952913737120", "text": "My fiance and I are planning to elope in Italy next year, and are looking for any advice/tips. We were leaning towards Lake Como, but vendor prices are higher than I expected so we're also considering other options with lakeside or seaside backdrops.", "link": "facebook.com/groups/1373361046396315/permalink/2199952913737120/", "likes": 1, "comments": [{"username": "Benedetta Vanni", "comment_text": "There are a number of other lakes in northern Italy: Lago d'Orta, Lago Maggiore, Lago di Garda...\nAnd in central Italy: Lago Trasimeno and Lago di Bolsena.\nAll of them offer beautiful views, hiking, sailing, local production of wine and/or olive oil. Check them out!"}, {"username": "Joana Voglino", "comment_text": "Positano!!"}]}, {"id": "2199952500403828", "text": "Lake Orta, not so famous, not so crowded but very beautiful.", "link": "facebook.com/groups/1373361046396315/permalink/2199952500403828/", "likes": 4, "comments": []}, {"id": "2199938753738536", "text": "Has anyone toured Cinque Terra on their own without a scheduled tour. Having a hard time finding the right one for our group that takes you by train to 3 - 4 of the villages and then also takes you out on the water. Ready to give up and just go on our own but wondering how difficult it is to get around. Would appreciate any input/suggestions. We are going to be in Lucca in October and will take a train to LaSpezia. Thanks in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2199938753738536/", "likes": 7, "comments": [{"username": "Dianne Metcalf", "comment_text": "We toured on our own and like it much better than a tour. It’s a beautiful area. If you need hotel recommendation in Lucca let me know. I loved Lucca too."}, {"username": "Debbie Ribolini", "comment_text": "We stayed two nights there and couldn’t do a boat ride due to rough water but bought an all day train pass and just went to the villages on our own. Very easy and inexpensive."}, {"username": "Russ Heinemann", "comment_text": "We stayed in Lucca, had a car. Drove to La Spezia, then the train to Cinque Terre. Hiked between villages. I think the views are what counts. Didn't stay overnight."}, {"username": "Linda West", "comment_text": "Very easy to navigate on your own. Get the train card in La Spezia and you can ride the train as much as you want. Hike one of the trails. Beautiful views! Take a sunset cruise (prebook) for breathtaking water views of the 5 villages."}, {"username": "Colleen Robinson", "comment_text": "We explored on our own and loved it. Easy to jump on trains to each town and nice not to be on a schedule. If you have time hiking and views are amazing. If you get a nice day, jump on the ferry at riomaggiore and go all the way to monterosso to see the views from the water and work your way back exploring each by train."}, {"username": "Connie Wilson", "comment_text": "I think very few people take tours to Cinque Terre unless it’s for a day. Very easy to travel between each village either by train and/or boat. Just need to research and know what to expect. Here’s a good website:\n\nhttps://\nwww.cinqueterre.\neu.com/en/"}, {"username": "Leslie Bland Wilson", "comment_text": "We bought the train pass and went to all of the villages in one day ! It was quite easy in our own . ( The ferry was not running because of windy conditions .)"}, {"username": "Domenica Calvene", "comment_text": "it's very easy...Do it on your own...\nCatch the train to la spezia,we stayed 2 nights here...then get a ticket for the ferry( if weather permits otherwise train goes to all 5 towns).... near the dock area or street with flags....which will take you to all towns..hop on hop off.Last ferry at monterosso is at 17.30pm.\nExplore the places but be warned hot and hilly and oh so beautiful."}, {"username": "Colleen Jennings", "comment_text": "Very easy to do it yourself. I based myself in Sestri Levante in March (hotel Due Tori 4*) and it was so easy to get about by train - & inexpensive too. I also visited Pietrasanta for a day, 1 hour by train from Sestri."}, {"username": "Patricia Portas", "comment_text": "Yes we did it. It's very easy. You just need to learn the ways to travel from one village to the next (hike, train, ferry). Villages are small, you don't need help to go around."}, {"username": "Amanda Kelly", "comment_text": "Marion Daku"}, {"username": "Alice Francesca", "comment_text": "Remember to wear proper trekking shoes"}, {"username": "Mary Kitch", "comment_text": "Exodus does a hiking tour there."}, {"username": "Bill Gumpenberger", "comment_text": "Go to your public library check out Rick Steves Italy guide book. He has all your answers"}, {"username": "Renae Larcus", "comment_text": "We have been to CT twice. Both on our own. We stayed in Monterosso . Easy to get around. We hiked between the towns. Can also take the train or the ferry. By train the towns are like 5 min apart."}, {"username": "Liz Cooper", "comment_text": "Gone several times on my own. The train is great. You walk a lot. It’s a series of villages on cliffs facing the ocean. Train from La Spezia."}, {"username": "Bev Madill", "comment_text": "It's very easy to do by yourself. Trains are plentiful and you can just take your time wandering around the villages. I'd suggest a day trip to Portofino (train to Santa Margherita Ligure then boat to Portofino) and to Porto Venere (by boat from Riomaggiore). The Trenitalia website will be useful. CT is magical."}, {"username": "Megan Mundy", "comment_text": "I did a tour with CiaoFlorence and it meets your requirements! Totally easy to do by yourself though."}, {"username": "Nancy Gottesman Mann", "comment_text": "We just trained and walked each village in one day. Not difficult to do at all but very crowded. Start at one end and get a day pass on the train to move from town to town."}, {"username": "Rosslyn Patience", "comment_text": "We toured on our own 2 times. You can get a boat or train between the villages. You can do the walk between Vernazza and Monterosso along the coast.The trip to La Spezzia was nice. You can even go to Genoa for the day. There is the beach too. The boat to Porto Venere starts at Monerosso and stops at Vernazza, Manarola and Riomaggiore."}, {"username": "Chris McLaughlin", "comment_text": "Been a few times and never had a tour. Just buy the train or ferry pass and visit the villages at your leisure or you can hike between the villages. No tour needed"}, {"username": "Donna LaSella", "comment_text": "I just did my own thing. Coming from Milan we stayed in Monterosso and hiked to the next village from there and then to the next. We started early and could spend as much time as we wanted. We took trains to the villages we couldn’t hike to because of rock fall and we also took trains to get back. We did an excursion on a boat to see the villages from the water. If yiu don’t care to hike , the trains are easy to take and you don’t need a tour to do it."}, {"username": "Mike Drelicharz", "comment_text": "We have. It’s easy to around the villages. The train connects them all as does a walking trail."}, {"username": "Maria O'Callaghan", "comment_text": "We stayed in Levanto the boat starts from there. We took the boat to Riomaggiore. From there we walked the Via Del Amore to Manerolo which was lovely. From there we took the train back to Levanto, stopping at all the villages along the way.\nEnjoy 😀"}, {"username": "Phyllis Snyder", "comment_text": "I haven’t gone yet but going solo next fall- planning my 4 days in CT myself. Using Rick Steve’s Italy guide- highly recommend it! Also his website -& utube videos!"}, {"username": "Cheryl Trigg", "comment_text": "We used My Tours from Florence. Did all villages and then back to La Spezia by boat from the last village. Stopped at one place en route. Full day, wonderful."}]}, {"id": "2199951483737263", "text": "Help!\n\nWe are scheduled for 2 tours to the Colisseum on Sunday.\n\nOne tour with guided tour, arena floor and Roman forum/Palestine hill access - 3.0hrs for $300euros\n\nOr\n\nColisseum tour with access to arena floor no Palestine hill access 1.5hrs for $200 euros.\n\nI have 2 kids who probably won’t like being in the heat for 3hrs - should we skip Palestine hill/Roman forum?", "link": "facebook.com/groups/1373361046396315/permalink/2199951483737263/", "likes": 0, "comments": [{"username": "Ty Levine", "comment_text": "There is no Palestine hill in Italy. I think you mean Palatine Hill.\n\nThe forum is very interesting and if you have a good guide you’ll learn more about Roman life during that time than inside the colosseum."}, {"username": "Erica Senes Tombesi", "comment_text": "I still remeber my visit to forum when i was a kid. A Dream. Also my mother rembers the same day, a nightmare. 40°C. But i still think it's worthy."}, {"username": "Jay Cabrera", "comment_text": "Wear hats"}]}, {"id": "2199948687070876", "text": "Would you recommend hiring a private guide for Pompei or just explore on our own?", "link": "facebook.com/groups/1373361046396315/permalink/2199948687070876/", "likes": 0, "comments": [{"username": "Robin Caddell", "comment_text": "Yes, 1st thing buying tickets saved us a long wait in line at Sorrento train station. Pompeii is HUGE, tour took a couple hours with good information, then you can explore other areas."}, {"username": "Sara Kyle Hargett", "comment_text": "Definitely a guide. You won't know what your looking at"}]}, {"id": "2199946360404442", "text": "Hello all. I had posted this information earlier in the year but due to the situation at the time, we postponed our Italy trip to next year.\nI have wrote down some areas my husband and I would like to visit. We have 2 weeks to spend.\nPlaces to visit: Rome, Naples/Pompei on the way to Sorrento, Bari, Florence, day trip to Pisa, and the countryside in Tuscany. Please be kind to me is I understand Tuscany is a region? I am not familiar with Italy so not sure if I said that right.\nI have a few questions. Here is one.. Are they any recommendations to stay in the countryside of Tuscany? Like I said please be kind and correct me where I am saying something wrong.\nThis is my rough agenda..\nFly into Rome stay for 2 days, take a train down through Naples, Pompei to Sorrento and stay for 2 days in Sorrento. Take a train to Bari and stay for 2 days. I know Bari is out the way but this is where my great grandmother is from and I would like to visit there. Then take a train up to countryside of Tuscany which I am guessing we would have to go to Florence first and drive to the countryside? Stay in the countryside of Tuscany for 2 days (again I do not know the names of the towns there). Drive back up to Florence and stay for 3-4 days. then visit Pisa for a daytrip, take a train back to Rome and stay there for 1-2 days since we will be flying back out of Rome.\nI know that is a lot of information to read. I am open to suggestions and advice since we are not a seasoned tourist of Italy.\nI am looking into hotel costs and such this week so I can somewhat come up with a financial figure to save for.\nThanks everyone in advance :)", "link": "facebook.com/groups/1373361046396315/permalink/2199946360404442/", "likes": 1, "comments": [{"username": "Benedetta Vanni", "comment_text": "You are right: Tuscany is a region. Firenze, Pisa, Siena, Lucca, Arezzo are some of the towns located in this region."}, {"username": "Phyllis Snyder", "comment_text": "It’s doable- be sure to factor in travel time between cities. How many total days will you be in Italy? One town that’s on my list while I’m in Florence is Siena. I’m also going to Lucca. Both are easy train ride from Florence."}]}, {"id": "2199944620404616", "text": "Small quaint town recommendations\nsouth of Rome. Can be inland or coastal.", "link": "facebook.com/groups/1373361046396315/permalink/2199944620404616/", "likes": 0, "comments": [{"username": "Benedetta Vanni", "comment_text": "Browse the area of \"Castelli Romani\""}]}, {"id": "2199939573738454", "text": "Please could I ask for advice regarding the following-\n\nThe accommodation we are looking at for our trip in December is based in the Regola area.\n\nThose in the know, is this a suitable area to base ourselves in? Or should we consider other areas?\n\n(Please note that our currency is almost 20:1 😳😳😳 which makes traveling in Europe super expensive and we do not have a big budget.)\n\nThank you for any thoughts you can share!", "link": "facebook.com/groups/1373361046396315/permalink/2199939573738454/", "likes": 0, "comments": []}, {"id": "2199936377072107", "text": "I'm working on my scrapbook from our last trip to Italy (2017) and I realized that I don't recall seeing posts about the Scrovegni Chapel in Padua. It's really a must-see! Padua is a lovely town, only a shortआणखी train ride from Venice. The Chapel is truly spectacular, and the restored frescoes are breathtaking! Reservations are a must, as they only allow 25 people into the chapel at a time; that's also part of the beauty of it, as you don't feel sandwiched with lots of other people. The flip side of that is that you have limited time to stay in the chapel, as there's another group waiting. If you're looking for an easy day trip from Venice, this is just the thing. Enjoy!", "link": "facebook.com/groups/1373361046396315/permalink/2199936377072107/", "likes": 2, "comments": []}, {"id": "2199933397072405", "text": "We will be in Rome for two days in April 2024 - any suggestions as to where to stay for best two day experience? I was looking at places near Vatican City and also near the Spanish Steps. Our budget is about $250 night.", "link": "facebook.com/groups/1373361046396315/permalink/2199933397072405/", "likes": 0, "comments": []}, {"id": "2199932230405855", "text": "outlet adaptors? we will be starting in Switzerland, then Italy then Greece... suggestions for outlets for phone charging etc.? Thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2199932230405855/", "likes": 0, "comments": [{"username": "Beth Oakes Thomas", "comment_text": "Tom, you can get an universal international converter on Amazon for around $20. Most have a couple USB ports as well,"}]}, {"id": "2199930593739352", "text": "Planing to visit Naples area for 4 days in September. Any recommendations\nhow to see the main sites in that area? Ex. Capri, Pompeii, amalfi\nStruggling to decide to spend a day in each area or have a home base in one of the areas.", "link": "facebook.com/groups/1373361046396315/permalink/2199930593739352/", "likes": 1, "comments": []}, {"id": "2199930463739365", "text": "Hello, it is feasible to tow a caravan from the uk to Italy?? Other half thinks it won’t be a problem but I think there are a few big hills in the way!!!", "link": "facebook.com/groups/1373361046396315/permalink/2199930463739365/", "likes": 0, "comments": [{"username": "Paul Vincent", "comment_text": "Go the river/coastal route to avoid mountains.\nAs Treebeard said, always liked heading south...always seemed like going downhill !"}, {"username": "Alasdair MacDonald", "comment_text": "We drive most summers in Europe and have seen a few caravans from the UK in Italy. We also see many from the Netherlands, Germany and France in Italy too as there are many great camping sites in and around the Lakes area in northern Italy.\nThere are probably a few ways to go avoiding the hills, down towards southern France then into Italy though if you wanted to go through Switzerland ( it's truly stunning) then there are plenty of tunnels that go through the Alps rather than facing some of the tighter alpine passes 😁"}, {"username": "Pam Gerretsen", "comment_text": "Tolls are higher if you go south through France, we use the tunnel, and go Belgium, Luxembourg (cheapest diesel en route), back into France, and then Switzerland. You need a vignette for Switzerland, (which covers you for the whole year) and then into Italy where you will pay tolls to get anywhere. (Car from Palma to Napoli was approx €50). I have seen caravans on San Gottardo pass, but you can use the tunnel instead. I would avoid the tunnel on a Friday or Saturday though, plan for mid-week and/or early morning as the queue can be 10km+ with a 2 hour wait. Via Michelin is a good site to give you an idea of fuel and toll costs."}, {"username": "Marc Paronio", "comment_text": "My dad used to do this in the 1970's taking the overnight ferry to Lehavre or Cherbourg and driving to a place called Vallorbe in Switzerland, before continuing to Italy to a place between Milan and Turin. The 'hills' were only an issue for one of the cars he had, and he soon got rid of that!"}]}, {"id": "2199929963739415", "text": "Hi in Italy next week. Car hire question. Do the cars have sat nav or is it necessary to hire. Looking at types of cars and know they normally come with sat nav as standard", "link": "facebook.com/groups/1373361046396315/permalink/2199929963739415/", "likes": 0, "comments": []}, {"id": "2199921700406908", "text": "Best hotels to stay in Venice with a child near to attractions?", "link": "facebook.com/groups/1373361046396315/permalink/2199921700406908/", "likes": 0, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2199918473740564", "text": "Any unique tours you found in/near Venice, Florence or Rome?", "link": "facebook.com/groups/1373361046396315/permalink/2199918473740564/", "likes": 0, "comments": []}, {"id": "2199911790407899", "text": "🇮🇹 Turin, Italy 🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2199911790407899/", "likes": 1481, "comments": [{"username": "Tim Curry", "comment_text": "David King - this is one Italian city we still need to get to. These pictures are stunning."}, {"username": "Smyth Jason Michael", "comment_text": "Megan Leigh"}, {"username": "Rosemarie Walker", "comment_text": "All of this in Turin, amazing photos, I will put Turin on my trip plans as it looks beautiful 🤩"}, {"username": "Lynne Baronet", "comment_text": "Such beautiful pictures, thank you for sharing."}, {"username": "Linda Yanni", "comment_text": "Beautiful photos"}, {"username": "Amanda Igoe", "comment_text": "Thanks for putting names to these places just beautiful"}, {"username": "Jo Just-Jo", "comment_text": "Wow what absolutely stunning images. I am excited for my first Italian adventure with Naomi commencing in 10 days 💖"}, {"username": "Stephanie Scott", "comment_text": "Ginetta Zamprogno"}, {"username": "Diana Karen Martinez", "comment_text": "Leo Garnica"}, {"username": "Tracey O'Brien", "comment_text": "We just spent a week in Turin it was fabulous"}, {"username": "Vitya Volkov", "comment_text": "Wow, beautiful."}, {"username": "Johanna Porras Ceron", "comment_text": "Amazing, going in November 🙏"}, {"username": "Fanie Bekker", "comment_text": "Johmari du Preez"}, {"username": "Tricia Loder", "comment_text": "Absolutely gorgeous!!!Mayb\ne one day I’ll see it in person.😊"}, {"username": "Kim Aranha", "comment_text": "Fantastic - bring on your Rome ( Centro Storico and Trastevere) photos I am sure you have some"}, {"username": "Daniela Sciuto", "comment_text": "Jonathan Lopes"}, {"username": "Lisa Zarate", "comment_text": "Siti Ng Valentina Tamiazzo 🥰"}, {"username": "Elena Paladino Flood", "comment_text": "Elena Paladino Flood"}, {"username": "Zoe Jones", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Ųnï Qůē", "comment_text": "Ųnï Qůē"}, {"username": "Marion Deléglise", "comment_text": "Sylvain Willaume"}, {"username": "Marc Chomel", "comment_text": "Thank you Claudio. My mother was from Torino and I am writing a story about Torino during the war. My cousins still live there. Mario Napoli"}, {"username": "Michele Trial Westerman", "comment_text": "So beautiful!"}, {"username": "Pearl Lucero", "comment_text": "Gorgeous!"}, {"username": "Sophie Griffith", "comment_text": "Stunning!"}, {"username": "Roos Poelarends", "comment_text": "Nico Poelarends😍"}, {"username": "Kevin Huang", "comment_text": "My Torino"}, {"username": "Fiore Verastegui", "comment_text": "No he visitado Turin. Pero me encantaría esta allí . Fotos bellísimas. Gracias por compartir"}, {"username": "Burcu  Evran", "comment_text": "Ben G Caporella"}, {"username": "Davic Alex's", "comment_text": "Gorgeous ❤️❤️"}, {"username": "Carolyn Schwab", "comment_text": "Hoping to go to Turin next year 🤞🏻 I’ve seen lots of Italy and really fancy going there 🤩"}, {"username": "Kez Ridsdale", "comment_text": "Kez Ridsdale"}, {"username": "Inga Bidina", "comment_text": "Inga Bidina"}, {"username": "Julie Strudwick", "comment_text": "Lee Stewart here we come. Ken Strudwick, Kym Banks"}, {"username": "Michelle Creed", "comment_text": "Thankyou for sharing your spectacular photos with us . Turin is obviously a beautiful city and one to put on your bucket list 😊😊"}, {"username": "Inesa Spencer", "comment_text": "Stephen Spencer"}, {"username": "Glessie Castillo", "comment_text": "WOW! This is beautiful 😍"}, {"username": "Cindy Michelin", "comment_text": "Love your pics!"}, {"username": "Pamela Rolison Giordano", "comment_text": "Beautiful photos, Claudio! Turin is a beautiful city!"}, {"username": "Sonia Scalzi", "comment_text": "A city often missed but should not be as it is superb"}, {"username": "Herbert Hodgson", "comment_text": "Tama Hodgson actually looks like some awesome spots thereb"}, {"username": "Anne Herrmann-Fields", "comment_text": "These photos are Spectacular!!!!"}, {"username": "Catherine Hunt", "comment_text": "Beautiful!! Thank you for sharing these with me."}, {"username": "Leanne Brand", "comment_text": "Such beautiful photos. I need to go back to Turin!"}, {"username": "Stephanie Anne Mercado", "comment_text": "Lovely pictures! The image quality and composition are just superb! What camera and lenses did you use?"}, {"username": "Noreen Nelson", "comment_text": "Beautiful photography."}, {"username": "Trân Harris", "comment_text": "Joel Harris"}, {"username": "Alex Macchia", "comment_text": "Gab Murray Macchia"}, {"username": "Emilee Bond", "comment_text": "Just spent 4 days there. Wasn’t crowded. Didn’t encounter any other American tourists. Surrounding wine region is delightful."}, {"username": "Bianca Betts", "comment_text": "Loveeee Turin"}, {"username": "Sheri Dettman", "comment_text": "Going in September. Can't wait. Great shots!! I have that same camera but quit bringing it so that I didn't have to lug it around. You have made me reconsider!"}, {"username": "Regina Novak", "comment_text": "Beautiful pictures"}, {"username": "Fanie Bekker", "comment_text": "Demiche Bekker"}, {"username": "Becky Wright", "comment_text": "Tim Wright"}, {"username": "Kathleen Julian Conrad", "comment_text": "beautiful photos"}, {"username": "Bonnie Loftspring", "comment_text": "Wow, all this is Turin? Might have to be my next Italy experience"}, {"username": "Lidia Sz", "comment_text": "Amazing 😍"}, {"username": "Emad N Rasul", "comment_text": "Asra Nzar"}, {"username": "Laura Hamm Bowman", "comment_text": "Gorgeous photos"}, {"username": "Светлана Булдакова", "comment_text": "Турин прекрасен!!!"}, {"username": "Paula Thompson", "comment_text": "Beautiful photographs! ❤ Thank-you for sharing!"}, {"username": "Irene Aloise Eger", "comment_text": "Thank you for sharing! Spectacular pictures. Denise Rangel Chris Eger now I want to go to Turin."}, {"username": "Frederick Rühr", "comment_text": "Beautiful photos."}, {"username": "Susan Fischer Swanson", "comment_text": "Another spot to add to the list."}, {"username": "Byron Christie", "comment_text": "Michelle Christie😱"}, {"username": "Carey Joel", "comment_text": "Great photos Claudio! Nice to see some pictures of Turin. 🇮🇹"}, {"username": "Elias Gerges", "comment_text": "Zeina Al Helou Gerges our village ♥️"}, {"username": "Tammy Kitchen", "comment_text": "Tammy Kitchen"}, {"username": "Wanda Vicari", "comment_text": "Beautiful"}, {"username": "Ionia Mazzocca", "comment_text": "Ionia Mazzocca"}, {"username": "Louise Davies", "comment_text": "Paul Minshull"}, {"username": "Mark Story", "comment_text": "Anna Duhon"}, {"username": "Tina Gallo Scola", "comment_text": "Tina Gallo Scola"}, {"username": "Annmarie Corfiati", "comment_text": "Wow! Amazing!"}, {"username": "Marie Elena Sparacino", "comment_text": "Fabulous photos !! Grazie !"}, {"username": "Liz Cottrell", "comment_text": "Absolutely beautiful pictures!"}, {"username": "Susan Brewer", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Rena Harris", "comment_text": "Outstanding! I was there a few years ago, visited the Turin Cathedral and was blown away, Also Superga and the story surrounding her. I can’t wait to go back!"}, {"username": "Preetha Mahadevan", "comment_text": "The images are phenomenal!"}, {"username": "Donna Burgess", "comment_text": "Absolutely stunning!"}, {"username": "Susan Duwall", "comment_text": "Susan Duwall"}, {"username": "Kim Mai Yuen", "comment_text": "Absolutely stunning! I have been last year ago at 2021"}, {"username": "Ange Paste", "comment_text": "YaNah DeVeyrah"}, {"username": "Oleashia Woronowicz", "comment_text": "Ava Krier"}, {"username": "Carmela Suppo", "comment_text": "Love Torino. My husband was born there and his dad was also born there"}, {"username": "Sheley Bressler", "comment_text": "These photos are incredible!"}, {"username": "Ellen Watson", "comment_text": "Jessica Kate Sibson, Donna Briggs, Hannah Elizabeth 🇮🇹"}, {"username": "Arlene Meadows", "comment_text": "Karl Meadows, stunning photos"}, {"username": "Nick Trostel", "comment_text": "Kamron we should have stayed here"}, {"username": "Lynne O'Brien", "comment_text": "Lynne O'Brien"}, {"username": "Ana Luiza Verissimo", "comment_text": "So wonderful! ❤"}, {"username": "Corina Ioniță", "comment_text": "Amazing photos!"}, {"username": "Marcia Hattman Colucci", "comment_text": "Stunningly beautiful shots!"}, {"username": "Billy Nash", "comment_text": "Every photo is awesome! 👍🇮🇹"}, {"username": "D Rochelle Milton", "comment_text": "Magnificent ♥️"}, {"username": "Louise Eva", "comment_text": "Mark Ward You’re going to Turin as part of your holiday, aren’t you?"}, {"username": "Loretta Barry", "comment_text": "Love 💕 your pictures…Thank You for sharing"}, {"username": "Angela Perky Perkins", "comment_text": "Absolutely stunning photos of beautiful places."}, {"username": "Patty Barnes", "comment_text": "Absolutely stunning!\nDevo imparare fotografia come Lei."}, {"username": "Thanh Huong Le", "comment_text": "Amazing ❤️"}, {"username": "Asia Piskorz", "comment_text": "Too stunned to speak"}, {"username": "Debra Daley", "comment_text": "Wow! Beautiful pictures"}, {"username": "Taylissa Kuhn", "comment_text": "Okaaaaay well this is a catfish Brielle May Caylee Fyffe Christie Marsh"}, {"username": "Kayla Sammut", "comment_text": "Joanne Zahra"}, {"username": "Hali Aiona", "comment_text": "Reeve Danielle"}, {"username": "Alicia E Harker", "comment_text": "Feel like I was just on a trip, and it was to Turin Italy!! Thanks for sharing..📸"}, {"username": "Sally Begaud", "comment_text": "Wow - more absolutely Amazing photos 🤩"}, {"username": "Anum Baloch", "comment_text": "Amazing pictures. Did you use camera or phone for these? Curious"}, {"username": "Paulette Molasses Sims", "comment_text": "Beautiful. I'm trying to locate this beautiful place on the map of Italy. ❤️"}, {"username": "Kirsten Haight Cianci", "comment_text": "These photos are truly spectacular. Thanks for sharing them!"}, {"username": "Angela Elsley", "comment_text": "I’ll be there in Sept seeing cousins!"}, {"username": "Paula Brink", "comment_text": "Gorgeous photos Claudio! Torino has been on my list for a while 🤩"}, {"username": "Josefina Riquelme", "comment_text": "Sebastian Riquelme"}, {"username": "Allison Glover", "comment_text": "Cathy Windsor\nLiv Windsor\n\nwow didn’t realise Turin was such a big town"}, {"username": "Patti Choy Semple", "comment_text": "Spectacular photos, makes me miss Italy 🇮🇹"}, {"username": "Patty Maffei", "comment_text": "Holy sheesh the pictures are amazing"}, {"username": "Jenny Meffert", "comment_text": "Stunning photos. Thank you for sharing."}, {"username": "Marg Ryan", "comment_text": "Amazing captures of these beautiful buildings 💙"}, {"username": "Janet Desrochers", "comment_text": "Absolutely gorgeous!!! ❤️"}, {"username": "Bunny Brown", "comment_text": "Spectacular!"}]}, {"id": "2199909663741445", "text": "Need specific directions. Coming into Lugano from Zurich by train. Need to get take C12 bus from Lugano to Menaggio.\nIs bus stop within 10 minute walk from train station? Is it Castagnola? Do we get on without a bus ticket and driver stops along the way for us to hop off and buy ticket? Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2199909663741445/", "likes": 0, "comments": []}, {"id": "2199909400408138", "text": "Hi all. For those that have traveled, what apps can you recommend that you found helpful-finding wine windows, public restrooms, maps and any others that were beneficial to you? TIA", "link": "facebook.com/groups/1373361046396315/permalink/2199909400408138/", "likes": 0, "comments": [{"username": "Meredith Williams", "comment_text": "google maps was a must for walking directions. i have heard ppl mention flush for bathrooms, but we had no problems finding them"}]}, {"id": "2199909230408155", "text": "Vatican website sold out for September date i needed for tour. Can anyone recommend specific Viator tours for Vatican and Colosseum?", "link": "facebook.com/groups/1373361046396315/permalink/2199909230408155/", "likes": 0, "comments": [{"username": "Laura Taylor Gregar", "comment_text": "I ended up booking at Livtour the early breakfast Vatican tour"}, {"username": "Jay Parekh", "comment_text": "for Colosseum, book direct via Coop Culture which is the offical site. TIckets go live 30 days before the date you want to do the tour. If you see sold out, or not enough tickets avail to what you need, keep trying. It opens up and after 5 hours I had mine which included the underground tour."}, {"username": "Bill Elias", "comment_text": "Context Travel is top notch I’ve used them in Rome and London.\n\nhttps://\nwww.contexttrave\nl.com/cities/\nrome?campaignid=\n19502146055&adg\nroupid=14286476\n3417&adid=64422\n8258873&utm_agi\nd=142864763417&\nutm_campaign=%7\nBcampaignname%7\nD&utm_source=go\nogle&utm_medium\n=cpc&utm_term=p\nrivate+tour+rom\ne&utm_content=6\n44228258873&hsa\n_acc=2543526726\n&hsa_cam=195021\n46055&hsa_grp=1\n42864763417&hsa\n_ad=64422825887\n3&hsa_src=g&hsa\n_tgt=kwd-410442\n353703&hsa_kw=p\nrivate+tour+rom\ne&hsa_mt=b&hsa_\nnet=adwords&hsa\n_ver=3&gclid=Cj\n0KCQjwiIOmBhDjA\nRIsAP6YhSWb0KWT\n4CLRGOwhZtdg_zW\nKKl6RVsANgX-Yvg\nGUGA4QmOuC18khZ\nqQaArxfEALw_wcB"}, {"username": "Domenic Belfiore", "comment_text": "We booked through the tour guys. We were there last week. They were great."}, {"username": "Lisa Pirone Kaiser", "comment_text": "We booked the early tour for the Vatican and it was wonderful. https://\nwww.whatalifetou\nrs.com/\n?utm_source=GMBl\nisting&utm_medi\num=organic"}]}, {"id": "2199907377075007", "text": "In Florence right now and very keen to try the pasta Alla Ruota (cheese wheel pasta)\nAny recommendations please?\nCan’t get into Osteria Pastella, anyone know of any others?\nThank you 😊", "link": "facebook.com/groups/1373361046396315/permalink/2199907377075007/", "likes": 0, "comments": []}, {"id": "2199900220409056", "text": "Hey everyone. My family is headed to Florence and Venice in a few weeks. We are so excited. I have two teenage boys who are sneaker heads. Are there any shops that sell sneakers and/or second hand sneakers in these two cities? Also, are there any must dos for teenagers? Thanks in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2199900220409056/", "likes": 0, "comments": [{"username": "Elena Innocenti", "comment_text": "In Firenze live about 400.000 people. Do you think they don’t buy sneakers? There is 2 Foot Locker in the center of the city, one is very close to Cattedrale."}]}, {"id": "2199899843742427", "text": "For those in Rome our airbnb host, Lucca, recommended this place where locals eat!! I loved it!!!", "link": "facebook.com/groups/1373361046396315/permalink/2199899843742427/", "likes": 3, "comments": []}, {"id": "2199893727076372", "text": "Need a rest after visiting Trevi? Walk over to via del Tritone to Rinascenti Dept Store. Shop if you want or head up escalators to roof top cafe for refreshments and a view. From there you can see the Basilicaआणखी di Andrea della Fratte (St Andrew of Thickets). Walk around corner from store to see this beautiful church with an interesting history.\nContinue up street to Triton Statue in Piazza Barberini. Then turn left to go to the Capuchin Crypt (bone church).", "link": "facebook.com/groups/1373361046396315/permalink/2199893727076372/", "likes": 1, "comments": []}, {"id": "2199893620409716", "text": "I have started planning for a family vacation in June/July 2024. The hotels are either sold out or very expensive. Is this due to it being so far out or are hotel already at capacity? Should I book now or wait?? Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2199893620409716/", "likes": 10, "comments": [{"username": "Marie Cuzzi", "comment_text": "You are traveling at peak tourist time do it is possible they are sold out but it could also be too far out"}, {"username": "Elaine King", "comment_text": "Booking.com"}, {"username": "Cheri Arrowood-Stanziano", "comment_text": "Check VRBO or ARBNB"}, {"username": "Lisa Valdovinos", "comment_text": "We booked 9 months out."}, {"username": "Karen Schmidt", "comment_text": "For some, it’s too soon. I contacted one of the hotels I wanted to stay at next May , and he said next year will be released sometime in October. For Airbnb, there are lots of availability, but each day I check there are more and more. I think you’re just too soon. ￼"}, {"username": "Jennifer Nguyen", "comment_text": "I check the hotel in Italy for next year and they said SOLD OUT. When I checked the whole month calendar. It said sold out for the whole month and all the way up to 2025. I realize that it is unavailable, I don’t know why they put SOLD OUT instead of not ready or unavailable. Right now hotel only schedule for reservations up to April only.\nI have to check back in few weeks to see. I even chat with the hotel customer service to make sure and they said the calendar not ready for June schedule."}, {"username": "Kim Grace", "comment_text": "I’ve just made sure and booked up fir May ..Rome/Naples& sorrento..good luck"}, {"username": "Nana Tirolese", "comment_text": "Sure you want to go in July??"}, {"username": "Suheil Sylvia Shatara-Hajjar", "comment_text": "They are expensive and people book very early being fully refundable. Book now and keep looking and make changes as you see better options"}, {"username": "Christine M Machacek", "comment_text": "I already booked my airbnb for Sept 2024 in Rome."}, {"username": "Andrea Paquette Haber", "comment_text": "I booked all mine on hotels . Com"}, {"username": "Juanita Belinda Garza-Ybarra", "comment_text": "Check on trip master to see what is available. That is what we used to plan our trip"}, {"username": "Sandi Van", "comment_text": "I did everything thru Booking.com"}, {"username": "Michelle Lenhart-Freebairn", "comment_text": "Try booking.com"}, {"username": "Rachael Richardson", "comment_text": "Try air bnb or booking . Com"}, {"username": "Diane Davis Lawyer", "comment_text": "I much prefer AirBnB over commercial hotels. You can find real gems and bargain prices. Just read the reviews, read the amenities, house rules and check in/check out times, along with location and you'll learn everything you need to know. I only book fully refundable. I've been using AirBnB or VRBO all over the US and Europe for years and have been very pleased overall with our stays."}, {"username": "EG Reyes", "comment_text": "Czecie Reyes"}, {"username": "Peach Panfili", "comment_text": "July and August are high season and also very hot and humid. It’s also summer school holidays in Europe - most expensive time of the year to travel and the least appealing weather wise."}, {"username": "Jayne Dawson Meyer", "comment_text": "Wait"}, {"username": "Jeanne Hildebrandt Fedoryk", "comment_text": "They usually open up a year in advance and worth booking early. If there’s a particular hotel you want, email them and ask when booking will open"}, {"username": "Shelley McKeown", "comment_text": "Could it be because of the olympics being on?"}, {"username": "Stephen Thomas", "comment_text": "I was also looking to book some BnB space at a place we previously stayed at for 2024 and everything said “not available”. I emailed the place and they responded that had not open their bookings that far out. I would wait."}, {"username": "Alicia Vargas", "comment_text": "I had no issues booking a year out through Booking.com."}, {"username": "Lee Anne Ashurst", "comment_text": "They don’t have 2024 rates yet will later this year"}, {"username": "Nicole Schipplock", "comment_text": "I've got all my accommodation booked already for September 2024, I made sure I booked early, with the games in Paris finishing a few weeks before my trip I didn't want to take the chances of everything booking out, I've booked all air b&b's though"}, {"username": "Sharyn Lockwood Allan", "comment_text": "Book now!"}, {"username": "Nathalie Hiller", "comment_text": "I think it's because you're booking in high season. Either that or they don't have prices yet. I am booking only 2-3 months from my holidays and never had problems. But we never travel in June/July/\nAugust. Try contacting the hotels directly. Sometimes they have more available dates and better prices."}, {"username": "Joy Buenaflor", "comment_text": "I have made reservations for all our accommodations October 2024. Email the hotel"}, {"username": "Phyllis Snyder", "comment_text": "Well many people book way ahead with options to cancel- they change their plans and rebook or cancel. It’s tough to navigate this aspect of travel. Also some hotels window to opening for booking till the new year."}, {"username": "Suzanne Hendriks", "comment_text": "Booking options aren’t usually open yet. Some are possible from January to book for summer, some from late October. Maybe you can try booking.com. If you have the chance book for June. In July everybody has summer holiday and for visiting cities it is usually very hot. We live in the Netherlands and have visited Italy for many times."}, {"username": "Kristina Ruk", "comment_text": "Too far..thats why writing \"sold out\""}, {"username": "Barbara Bastianini", "comment_text": "Some places sell out extremely far in advance these days. So sold out is a distinct possibility. I’d suggest emailing the particular hotels you’re interested in to ask them what the situation is. If they’re not booking yet they might tell you when booking will start. If there’re sold out you can keep checking to maybe get in on a cancellation."}]}, {"id": "2199892273743184", "text": "A few days ago, I read a debate about tipping or not. I am Italian and I can tell you how things are in many restaurant settings.\n\nFirst of all, tips are often divided among the entire staff. Many waiters and chefs are seasonal workers, so they work for 4-6 months. Hourly wages in certain places can be as low as 3-4 euros! Not everyone, but really many are underpaid and exploited 7 days a week. Therefore, in my opinion, if the service is friendly and the food is good, leave a tip!\n\nThe taxi situation is quite different. Their salary is good. While not all taxis are the same, in Italy they are notorious for taking advantage of tourists who are unfamiliar with the routes, thus significantly increasing the fare. They are also known for refusing to accept card payments and insisting on cash in order to evade taxes.\n\nIt is advisable to search on YouTube for any video related to \"taxi fare scams in Rome\" to get a better understanding of the issue. These videos can provide real-life examples of tourists being overcharged or deceived by taxi drivers.\nSo be very careful if you decide to leave a tip.\n\nEnjoy your travel! 😊", "link": "facebook.com/groups/1373361046396315/permalink/2199892273743184/", "likes": 118, "comments": [{"username": "Meghan Tan", "comment_text": "I wrote that I tip 10% at restaurants in Italy (more if service was really great!) and was lambasted. So many people saying don’t- but the food service industry is not easy and pay is not that good. I am glad you posted this."}, {"username": "Alessandro Iannelli", "comment_text": "1. It's not the customer's job to pay you, it's the employer's. If a dish costs 8.50 rest assured I will pay 8.50 and not a penny more (except coperto, where it applies). You want me to pay that dish 11? Write that price on the chart and I'll choose whether to sit and order it. If the day ever comes when we are heavily pressured into tipping, I will learn how to cook 2. Italians should stop hurting themselves by voting for the parties that are the enemies of workers, and their wages would immediately go up. Heck, we are seeing it these days, we have those who want to increase minumum wage, and those who don't. You would think the choice is obvious... The resources are there, they just need to be distributed better."}, {"username": "Bonnie Qn", "comment_text": "I was scammed in Rome by a taxi that charged me more than what the meter said. I chose to not fight it because it was 2 euro but he would have gotten a better tip from me had he been honest."}, {"username": "Peach Panfili", "comment_text": "Question - having said you are Italian, why have you posted anonymously?"}, {"username": "Victoria Russo", "comment_text": "Thank you for this information"}, {"username": "Alessandro Battxi", "comment_text": "I'm Italian, I can confirm that tipping the taxi is not worth, most of them are not declaring all the taxes and trying to scam tourists with higher fares, card payments broken. So, if you want to tip, tips tours or restaurants only if you believe the service and the experience are worth it."}, {"username": "Claudia Amp", "comment_text": "You make it sound like Italians want to keep underpaid workers in their situation. It’s not like the issue only touches the restaurant industry; there are a lot of underpaid workers in different job areas and they do not get tips; the girl folding your stuff in Zara and forcing herself to smile while helping you find something in the store isn’t making millions but yet she isn’t getting any tips for doing her job, the immigrant tomato pickers in the South being exploited aren’t even getting a near decent minimum pay nor humane work conditions, a waiter working in Pinchiorri might be better off than an elementary school teacher. Do we really want to feed into a system that condones tipping instead of tackling the issue from the root? We have to fight for decent minimum wage and humane working conditions for all and not debate about tipping which should remain a matter of choice and preference. Making it look like Italians are cheapskates attached to their wallets is unfair, we do not want that ultra capitalistic lifestyle imported, it does more harm than good. Tipping should not be the norm but an exception, a reward for going an extra length in making an experience memorable; tipping isn’t a standard to live by, fair and adequate wages is the standard to strive for."}, {"username": "निनावी सहभागी", "comment_text": "And one last thing, be careful with list prices and what you actually pay.\nMy husband is Irish, visibly Irish, we live in Venice and we happened to receive a very expensive bill because we were speaking English. As soon as I asked for an explanation in Italian and my Venetian accent, the owner immediately apologised and presented another bill. Did this happen to you too Alessandro Battxi?"}, {"username": "Rebecca Beare-Bath", "comment_text": "What is the most secure ride app (like Uber) do you suggest for Rome / Italy?\nI am looking for an app that shows you and tracks the route and cost in advance and does not allow the driver to switch to cash payment."}, {"username": "Karen Espinoza", "comment_text": "Thank you for sharing\nVery helpful"}, {"username": "Cynthia Marie", "comment_text": "I don’t believe this to be true in all of Europe. I know first hand because my husband is European.\nIf this were true they would tip when they are traveling, and they don’t. I sometimes think when this is posted , it is by restaurant workers trying to get travelers to tip when not required. IMO"}, {"username": "Heiress Kasmir", "comment_text": "Why would anyone want to tip based on what you’ve just explained. So the seasonal worker who is underpaid and exploited in your own words is forced to share that tip with the non seasonal worker. My guess is if they are cruel enough to exploit seasonal workers they will not behave better over a non traceable CASH tip."}, {"username": "Michelle Plutto", "comment_text": "Is Uber better?"}, {"username": "Jenny Payne", "comment_text": "I always tip if I’m happy with the service & the meal. I’m Australian and I still tip if the food & service is good, we do get paid well but still if I’m happy I’ll do it 🌻"}, {"username": "Cheryl Rockhold Rader", "comment_text": "Sounds to me as if Italy is not that different than US. You can’t be sure who is paid well without tips and who isn’t. We want to tip those who need it and who provide great service. But I don’t want to tip just because and I don’t like the currant system that lets employers not pay their employees properly."}, {"username": "Agnes Sax", "comment_text": "I have friends who live in italy and they have said the tip is included in the price of the food so do not tip unless the service is exceptional."}, {"username": "Agnes Sax", "comment_text": "Just ask why don't we tip those who wait on us at Macdonalds, or burger king yet when we go to a coffee house, they expect tips. Makes no sense."}, {"username": "Alicia Estes", "comment_text": "So what would you recommend to avoid the taxi problem?"}, {"username": "Claudio Blizzard Indastria", "comment_text": "Tipping taxi drivers sounds quite crazy from an actual italian perspective.\n\nAnyway i concur restaurants staff is not always well paid, tipping them is not that bad."}, {"username": "Ruth Pellow", "comment_text": "We always tip when eating out unless the service is appalling! Minimum of 10%. We live in Greece and they are paid extremely low wages so tips are gratefully received."}, {"username": "Jein Jj", "comment_text": "They charged me 330ml coca cola for 6 Euro. When asking about it the owner pretend I wasn't there. The meal wasn't good at all. Another restaurant add 6euro for 2 people. I don't know what is that. I guess they add themselves the tip."}, {"username": "Robyn Taylor", "comment_text": "As an Australian who has just returned from the US and Italy I found tipping to be a constant frustration. I objected to paying the nominal 15-20% tip in the US - particularly when the service wasn’t up to a high standard. The insistence of US tourists to tip when they travel makes it so much more difficult and uncomfortable for those of us that don’t come from countries where tipping is not expected. Our employees are paid a standard fair minimum wage and this should be the case in every country. Finally, our dollar was getting us .67 US and .63 Euro. So once we bought 2 basic $10 or 10 Euro meals and a couple of drinks then added on even a basic tip multiplied by the many meals that we contributed to the economies of both countries it added up to a substantial amount. Yes, certainly tip in Italy if the service is outstanding but please don’t make it the norm just because that is the case in the US."}, {"username": "Brent Sportsman", "comment_text": "I’d say check the bill to decide if you want to tip. A lot of restaurants include a service charge per person."}, {"username": "Lisa Marie Corcoran", "comment_text": "We hired a private driver for our trip and they are also handling all of our tours while we are there. All the cost of the tours and car service will be paid ahead of time so what % should we tip our driver daily?"}]}, {"id": "2199892087076536", "text": "I know this is a long shot, but does anyone recognize this bridge? My grandfather spent time in Tuscany and Florence during WWII. We are in the area and haven’t come across any possibilities.", "link": "facebook.com/groups/1373361046396315/permalink/2199892087076536/", "likes": 0, "comments": []}, {"id": "2199888403743571", "text": "Spent 5 weeks in Italy this spring with focus on biking some more off the beaten path areas like Puglia, Trabocchi coast in Abruzzo, and Trento in the north (south Tyrol area). Also did some nice hikes andआणखी daytrips in Abruzzo from Vasto and car daytrips in Puglia. Did a lot of usual tourist spots like Amalfi, Sorrento, Bologna and Milan, but the biking/hiking in these places were our favorite part of the trip. Easy paths with regular and ebikes, all rentals. Anyone interested in biking (especially as daytrips) might enjoy these areas. Any questions, I'd be glad to elaborate.", "link": "facebook.com/groups/1373361046396315/permalink/2199888403743571/", "likes": 35, "comments": [{"username": "Tania Bourgoin", "comment_text": "Beautiful scenery that you may not have seen otherwise 🚲🏞️"}, {"username": "Harriet Hoffman", "comment_text": "Was the biking around one town and out lying areas? Or point to point?"}, {"username": "Tracy Foss", "comment_text": "Beautiful you are lucky ! It is not a trip possible for us"}, {"username": "Shannon McGowan Wells", "comment_text": "This trip looks great. My husband and I are going to Italy in late September. He is very excited about biking in Finale Ligure."}, {"username": "Giovanni Pianigiani", "comment_text": "Lovely but... Trento is NOT South Tyrol!🧐"}]}, {"id": "2199887027077042", "text": "Now we need to apply for a visa to travel to Europe from US. 🤷🏻‍♂️", "link": "facebook.com/groups/1373361046396315/permalink/2199887027077042/", "likes": 228, "comments": [{"username": "Joe Guzzi", "comment_text": "Why?"}, {"username": "Becky Menacho", "comment_text": "2024, if that date sticks 🤪"}, {"username": "Mike Drelicharz", "comment_text": "Not exactly. As I understand it, the process will be much different than obtaining a Visa to travel to China for example. It will cost a nominal amount of money ($7.00 comes to mind) and can be done shortly before your trip. It’s not in effect yet."}, {"username": "Stephen Dawson", "comment_text": "it’s not a visa it’s pre clearance just like the usa has in place with ESTA and it’s not in place until next year"}, {"username": "Carol Taylor Tisdale", "comment_text": "It's no big deal but I'm just trying to figure out why?"}, {"username": "Dana Sammon Saunders", "comment_text": "My husband was saying it's under $10 and good for 3 years.... he goes often to Europe so was glad it's an easy thing.... china was another story...."}, {"username": "Giuliana Vaccari", "comment_text": "Not until next year.."}, {"username": "Laura Bastos", "comment_text": "No,ETIAS is not a visa. It's a migration permission. But probably it will be available until 2024, system isn't ready yet."}, {"username": "Maureen Rebello Hagerty", "comment_text": "Yes but it’s too early to apply. You can sign up for notifications for when they start taking applications"}, {"username": "Raisa Culver", "comment_text": "It’s a small fee and they’ve informed us about it a few years ago. Covid just delayed it. 🤷🏽‍♀️"}, {"username": "Nouara Nekachtali Bouzidi", "comment_text": "For your information European have to do that for years now before entering the US… so no big deal!"}, {"username": "Lisa Lisa", "comment_text": "2024"}, {"username": "Carmela Noble", "comment_text": "All Europeans are required to have an ESTA (and have been for years) to enter the US so not sure what the fuss is all about 🤷🏻‍♀️"}, {"username": "Jenny Frank", "comment_text": "It is NOT a visa. just a form to raise revenue LOL; whopping 7 euros"}, {"username": "Julie Brouillette", "comment_text": "7€ it starts in 2024 and it only takes 10 minutes to get approval and will be valid for 3 years. It is more or less for them to track your 90 days in the Schengen countries. Google ETIAS"}, {"username": "Sheila Anthony", "comment_text": "As a uk citizen I have always had to get an ESTA before coming to the US"}, {"username": "Phyllis Snyder", "comment_text": "Go to the official Italy government web site- it details all requirements to enter ."}, {"username": "Sarai Johnson", "comment_text": "It’s not a visa …"}, {"username": "Michael EIkady", "comment_text": "Maria EIkady"}, {"username": "Lucy Lou", "comment_text": "No different from me getting an ESTA."}, {"username": "Krystle Waggy Konečný", "comment_text": "It’s no big deal, it’s just a way for them to make money off of us. Who could blame them? We’ve been doing it to them for years."}, {"username": "Jose Velez", "comment_text": "Not yet"}, {"username": "Hermineh Topalian", "comment_text": "You noy need visa travel to Europe"}, {"username": "Trevor Jones", "comment_text": "Everyone does. Starts in 2024. Also UK. I assume like going to the USA gives the government opportunity to do some extra checking and revenue"}, {"username": "Debbie Morton", "comment_text": "Everyone has to apply for an ESTA to travel to the US 🤷‍♀️"}, {"username": "Susan Bice Adams", "comment_text": "Does this apply to Canadians too?"}, {"username": "Alisha Young", "comment_text": "It is what it is. If you love to travel $7 is a small price for an experience that will last a lifetime."}, {"username": "Kim Gierhart", "comment_text": "No biggie. Online simple and get response in about an hour"}, {"username": "Lisa Martin", "comment_text": "2024"}, {"username": "Kim Briggs", "comment_text": "It our job as a tourist to follow the international rules, country protocols etc. it’s their country, not the tourists. They have a new rule, if I want to go to italy, I will fill in the paperwork. Easy peasy"}]}, {"id": "2199885610410517", "text": "Please advice on travel agent íes for trip next year in July…so very nice and helpful community!", "link": "facebook.com/groups/1373361046396315/permalink/2199885610410517/", "likes": 0, "comments": []}, {"id": "2199882277077517", "text": "What is the best backpack to fit under airline seat?", "link": "facebook.com/groups/1373361046396315/permalink/2199882277077517/", "likes": 15, "comments": [{"username": "Anne Swigard", "comment_text": "Are you flying international carriers or European carriers? The latter have different size allowances. Be sure to check them out."}, {"username": "Kathy Flood", "comment_text": "After my last flight I will only put a small canvas bag under the seat in front of me. I think the area has gotten smaller."}, {"username": "David Riegel", "comment_text": "just a guess, but I'm gonna say a small one. 😉"}, {"username": "Sascha Lee", "comment_text": "I used this for 21 days and it fit under the seats including the smaller a/c\n\nhttps://\nwww.amazon.com/\ndp/\nB09NR95LFW?ref=p\npx_pop_mob_ap_s\nhare"}, {"username": "Alan Simpson", "comment_text": "This is small light and is the correct size for for most airlines however airlines vary"}, {"username": "Linda Miller", "comment_text": "It depends on your airlines requirements!"}, {"username": "Krystal Apolinaro", "comment_text": "My daughter got a BÉIS expandable and hers fit under the seats, even the smaller euro planes."}, {"username": "Sheila Manganello Paul", "comment_text": "Anything squish able"}, {"username": "Fuad Osta", "comment_text": "Well check the rules of the airlines you are flying with"}, {"username": "Vonda Gaylor McGill", "comment_text": "https://\nnordace.com/en/\nproduct/\nnordace-siena-ii\n-smart-backpack\n/\n\nMy daughter used this Nordace backpack when she was during her study abroad in Italy in the beige color. Highly recommend."}, {"username": "Annette Mayer", "comment_text": "I just returned from flying TAP. They were very restrictive with size and weight. I used what is generally my day pack for under seat . It's a New Outlander that folds up very small into itself and is very lightweight. Love it"}, {"username": "Benedetta Vanni", "comment_text": "I've been using the Nordace Siena for a couple of years now on Ryanair, ITA and Volotea flights. Great style and value."}, {"username": "Cindy Holtfreter", "comment_text": "I wanted to find a back pack that would count as personal and then take my carryon luggage.\n\nI have a collapsible bag for when I come home. I will put purchases like wine in the carry for checking. And laundry and back pack to go on board. in the bag.\n\nHere are the dimensions I used…\n\nUNITED AIRLINES\n* CARRY ON - 9 in x 14 in x 22 in\n\n* PERSONAL ITEM - 9 in x 10 in x 17 in (Got it!)"}, {"username": "Melinda Brown", "comment_text": "Northface"}, {"username": "Laura Storie Dolinar", "comment_text": "Osprey daylite plus"}, {"username": "Kay Rendall", "comment_text": "Depends on airline. I have found that under seat bag in Australia is 1.5cm too long for ITA, even though height, width is way under. Wish me luck I arrive 3/8 from Australia and immediately transfer to ITA. Not possible to buy something smaller on wheels in Australia. Because these r standard sizes for Au.\nDon't want to put in hold, because medication, MU, expensive clothes, walking shoes that I can not, may not be able to replace where I am going in Puglia, if my luggage is lost. I have travel insurance, but not always enough for delayed, lost luggage."}, {"username": "Robyn Jones Bohan", "comment_text": "My daughter has a Cotapaxi backpack for her European travels."}, {"username": "Krista Bartlett Featherstone", "comment_text": "Following"}, {"username": "Kristen Nicole", "comment_text": "Josh Shouldice"}, {"username": "Pat Petrello", "comment_text": "F"}, {"username": "Sarah Jane", "comment_text": "Tumi backpack. I have the celina and it has a lot of multifunction pockets."}, {"username": "Jonathan Coble", "comment_text": "We're still working on finding the right backpack/\ndaypack ourselves. Regarding flight sizes this has helped us: https://\nwww.worldtravele\nr.com/pages/\ninternational-ca\nrry-on-size. There are airlines not listed, so I would check with the specific airline you're going to use."}]}, {"id": "2199879077077837", "text": "Please any Capri Hotel recommendation, thank you very much", "link": "facebook.com/groups/1373361046396315/permalink/2199879077077837/", "likes": 0, "comments": [{"username": "Anna Mustafina", "comment_text": "quisisana, the best one!"}, {"username": "Mat PO", "comment_text": "La Palma is the newest luxury hotel in the island. It is magnificent. JK Place, Tiberio Palace and Capri Palace are also all really nice."}, {"username": "Tom Manno", "comment_text": "Hotel Maresca in lower Capri. Middle of the road pricing for Capri.Nice rooms, good location. Very short walk to the funicular to go up to Capri town."}, {"username": "Meghan Konopka", "comment_text": "If you don’t mind the Anacapri area, Albergo Senaria was a great spot!"}, {"username": "Jill Wolder", "comment_text": "Quisisana."}, {"username": "Ted Koloski", "comment_text": "Cesar Augustus..the best"}, {"username": "Gina O'Donnell", "comment_text": "Capri Tiberio Palace"}, {"username": "Annmarie DiVola Giordano", "comment_text": "Punta Tragara. Amazing !"}, {"username": "Kathleen Hill", "comment_text": "Boat trip around the island is amazing!"}, {"username": "Virgz Van Møøre", "comment_text": "Stay in Ischia 😂"}]}, {"id": "2199873930411685", "text": "Hi. First post here,\nI have read the guides but not much is posted about Puglia. We are family of 4. Looking at pasta making and boat tours. We are staying out near cassano Della murge we have a car. Staying till sun am. Any recommendations please. We have been to Bari old town. Pollagino a mare and arberello. All amazing places.\nLove this part of Italy. Coping ok in the heat.\nThanks.", "link": "facebook.com/groups/1373361046396315/permalink/2199873930411685/", "likes": 1, "comments": [{"username": "Anna Whitfield", "comment_text": "We can recommend. Matera a beautiful place."}]}, {"id": "2199872800411798", "text": "I will be studying abroad in Milan this fall. Any recommendations?", "link": "facebook.com/groups/1373361046396315/permalink/2199872800411798/", "likes": 0, "comments": [{"username": "Benedetta Vanni", "comment_text": "Get yourself a good umbrella and monthly tickets for public transportation (the company operating transit is named ATM)"}]}, {"id": "2199872647078480", "text": "Currently in Sorrento- we were supposed to have a private boat tour tomorrow of amalfi coast and Positano, but it got canceled so to supposed rough seas.\n\nWe’ll now have 24 hours in Sorrento and just want to ultimate relaxing day with our 9 year old… eat, shop, see something beautiful.\n\nWhat are your recommendations for an easy relaxing day in Sorrento?", "link": "facebook.com/groups/1373361046396315/permalink/2199872647078480/", "likes": 0, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2199866490412429", "text": "I'm wondering when is best time travel to italy when is not to hot or cold??", "link": "facebook.com/groups/1373361046396315/permalink/2199866490412429/", "likes": 43, "comments": [{"username": "Tina Wheeler Verstrate", "comment_text": "We've traveled the whole country in early September and again in late December. I have to say September was by far better. Some days were a bit warm, especially the further south we went, but it was SO nice not freezing our backsides off!"}, {"username": "Amira Zayed", "comment_text": "May and June then October"}, {"username": "Kristi Jack-Rodgers", "comment_text": "We went for two weeks this past March and it was lovely!! Beautiful weather. We are Canadian and it was around 20 c daily and sunny and just lovely."}, {"username": "Martha Huckaby", "comment_text": "October"}, {"username": "Rami Nicolas Koudsieh", "comment_text": "Early June or mid September."}, {"username": "Bernadette Moran McDowell", "comment_text": "Sounds like a goldilocks and the 3 bears question."}, {"username": "Nicola Lynch", "comment_text": "Going in November for my birthday"}, {"username": "Scott Bingman", "comment_text": "We went to Milano once and then drove on to the Tuscany region the end of Feb & first part of March.\nIt was wicked cold in the evenings and at night, but mid 60o’s and 70o’s during the day. Started out with a sweater in the mornings walking along Cinque Terre, but by after lunch it was pretty warm! That was the only time in Italy we weren’t sweating to death. All other times we’ve tried May, June, July, August and traveled other parts of Italy and Ughhhhh they were pretty miserable hot, and too many people. Unless you plan on swimming in pools and the Sea. Then that is good time to go. Capri was awesome for boat rides and swimming in the sea and to see the different grottos.\n\nMy pick of the year for traveling around Italy is end of Sept., Oct. November, Feb., March., and April.\nFound it to be beautiful and less crowded.\n\nGo Italy 🇮🇹 it never gets old!"}, {"username": "Gianna Onesi", "comment_text": "September!"}, {"username": "Audrey Owen", "comment_text": "We went May 29-June 8th and it was perfect 👍 not to hot, not cold, not to busy, not raining 🌧️"}, {"username": "Brian Osman", "comment_text": "Late April early May"}, {"username": "Maria Cappucci", "comment_text": "June or September."}, {"username": "Anna Ciolino Di Bennardo", "comment_text": "May, June, September and October"}, {"username": "Daniel Milby", "comment_text": "We went this year April 19 to May 3. It was about 55-60 at night. And about 65-77 during the day. We did see some rain (rainy season) but not as much as predicted."}, {"username": "Nicole Provost Hightower", "comment_text": "We went last year end of October into November snd it was PERFECT"}, {"username": "Kezia Zichichi", "comment_text": "When Giorgia Meloni is no longer in office."}, {"username": "Dawn Falsinotti", "comment_text": "March, April, October, November"}, {"username": "Silvana Villella", "comment_text": "May and early June, September and October"}, {"username": "Nancy Adams", "comment_text": "I am booked for the end of September for 10 days for my 60th. Rome, Pompeii, Amalfi Coast and Sorrento."}, {"username": "Rose Cianci Gallucci", "comment_text": "October - perfect weather. Need a sweater at night."}, {"username": "Mariam Morgan", "comment_text": "May is a rainy season..tricky"}, {"username": "Kari Leigh", "comment_text": "We went at the end of April - early May and it was perfect!"}, {"username": "Franca Eleftheriades", "comment_text": "October"}, {"username": "Gundega Barkane", "comment_text": "March, April"}, {"username": "Iveta Kanaityte Valioniene", "comment_text": "Spring , autumn"}, {"username": "Cynthia Marie", "comment_text": "If you research the weather, it never really gets that cold in Italy south of Florence. Unless you’re from the desert, then you may feel differently. For me I like the winter months for traveling through cities. Cities are a bit smelly in the summer heat. I have beautiful beaches at home so no need to travel for that. Our preference is after Thanksgiving and before Easter."}, {"username": "Diana Smith", "comment_text": "September/ October"}, {"username": "Marlene Bertino Randolph", "comment_text": "October"}, {"username": "Louise Faggioni", "comment_text": "I’ve found May/June and Sept/ Oct to be most beautiful and best weather…."}, {"username": "Sue Sherwood", "comment_text": "We were there end of april and 1st week of May. The weather was perfect."}, {"username": "Marie Caulfield", "comment_text": "Who cares"}, {"username": "Unacceptable Fringe Minority", "comment_text": "We’re planning to go in May. Found June is ok too."}, {"username": "Kimberley Jade", "comment_text": "Summa Angel"}, {"username": "Lise Stott", "comment_text": "I went in May and it was amazing"}, {"username": "Elizabeth A McGuirk", "comment_text": "October"}, {"username": "Janet Clattenburg", "comment_text": "April to may"}, {"username": "Marianella Flynn-Morales", "comment_text": "September did it for me ❤️"}, {"username": "Sandra Keyser", "comment_text": "May and September! I have been there in August, May, Sept., and October."}, {"username": "Irene Mikalef", "comment_text": "Early March"}, {"username": "Donna Austin", "comment_text": "October"}, {"username": "Elizabeth Medina Ynosensio", "comment_text": "Mid March was glorious! Seriously best weather ever!"}, {"username": "Dalia Abrahami", "comment_text": "October April."}, {"username": "Michael Lo", "comment_text": "Yubell Velasco"}, {"username": "Blanca Gil", "comment_text": "November - not too cold in 2021."}, {"username": "Yulichka Crowther", "comment_text": "October, May"}, {"username": "Gina O'Mara", "comment_text": "what is a good itinerary for a 2 week trip in 2024 (oct or Nov)…. also if you have recommendations\non hotels, villas, etc. that would be great too! Celebrating a few of us turning 60!"}, {"username": "Ginger DiGalbo Katz", "comment_text": "SEPTEMBER"}, {"username": "Nila Sendzik", "comment_text": "September and early October. The crowds are gone and the weather is delightful. Ciao!"}, {"username": "Carol McDonald", "comment_text": "Sept / October"}, {"username": "Sherri Leis Dillavou", "comment_text": "I went the first week of December and it was around 60s during the day. The Christmas markets and lights were fabulous"}, {"username": "Pauline SassyNana DeRose", "comment_text": "May or October"}, {"username": "Tina Thibodeaux", "comment_text": "October"}, {"username": "Robyn Green", "comment_text": "May Is great, always go then,👍😊"}, {"username": "Carlos Arotinco", "comment_text": "October"}, {"username": "Allana Frank", "comment_text": "We are going May 24 booking accommodation already"}, {"username": "Pui Quing", "comment_text": "Mid May- Early June. When not much tourist and the weather just nice not that cold or hot."}, {"username": "Paulette Nielsen", "comment_text": "We went in October both times we spent time in Italy💜"}, {"username": "Cathy Alafaci", "comment_text": "It’s Italy anytime is perfect 👍"}, {"username": "Fiona Smith", "comment_text": "September October for sure"}, {"username": "Joan Romiti", "comment_text": "October and September also depends on north or south.."}, {"username": "Simone Pfenninger", "comment_text": "Mid June"}, {"username": "Diane Plott Miller", "comment_text": "Been in November and it was wonderful. Going back this November."}, {"username": "Cess Kearns", "comment_text": "October"}, {"username": "Romina Lauretig Toscano", "comment_text": "September and October and April and May"}, {"username": "Mandy Gee", "comment_text": "May or early June and September"}, {"username": "Sara Kyle Hargett", "comment_text": "May"}, {"username": "Andrea Helle Myers", "comment_text": "We went end of September into first week of October last year and it was pretty comfortable. A few warm/hot days in Rome but nothing too crazy or different than we have at home. We're from Michigan."}, {"username": "Mieke Demoen", "comment_text": "September"}, {"username": "Ashley Gardner", "comment_text": "We went in the end of April it was 70 everyday"}, {"username": "Rebecca A. Baer", "comment_text": "September"}, {"username": "Annette Mayer", "comment_text": "We go in October"}, {"username": "Robbie Flaherty", "comment_text": "April"}, {"username": "Linda Jane Richardson", "comment_text": "June and September"}, {"username": "Silvia Urbinelli", "comment_text": "October"}, {"username": "Tracey O'shea", "comment_text": "We are going late Dec to cross off my bucket list.. to experience our first white xmas..so excited☃️(from Aust)"}, {"username": "Selene Oliver", "comment_text": "May & October"}, {"username": "Denise Lynn Frick", "comment_text": "Hands down September, May can be iffy and this year it rained most of May"}, {"username": "Rob Nolt", "comment_text": "We went to Florence, Venice and Rome at the end of March, beginning of April and it was perfect."}, {"username": "Yvonne Carreno", "comment_text": "We went end of November, beginning of December. It was nice because the cities were all decked out for Christmas. The down side was some places like Cinque Terre were basically closed down"}, {"username": "Alon Carmichael", "comment_text": "I love september/ october"}, {"username": "Sharon Menegoni", "comment_text": "March was wonderful this year!"}, {"username": "Gayle Barnes Schwartz", "comment_text": "What’s it like in November, December in Rome, Florence?"}, {"username": "Alice Francesca", "comment_text": "Just a piece of advice from an Italian here: we visit the città d'arte (cities of art) in the middle seasons (september to november or march to may) to avoid estreme cold or hot temperatures.No\nItalian ever thinks of going on holiday in Rome or Florence in august.In the summer (june to august) Italians head for the seaside or the mountains."}, {"username": "Antonio Ferranti", "comment_text": "20 years ago - before the world passed the point of no return."}, {"username": "Lisa Marie Corcoran", "comment_text": "We are going in October so I hope the weather will be plesant!"}, {"username": "Michelle Formosa", "comment_text": "September"}, {"username": "Darlin Merino-Avalos", "comment_text": "Sept-Oct"}, {"username": "Antonietta Marchetta Chiocchi", "comment_text": "September is beautiful"}, {"username": "Mariann T. Ciampa", "comment_text": "September"}, {"username": "Paulette Molasses Sims", "comment_text": "Following!"}, {"username": "Tina R Wells", "comment_text": "We went this year (mostly mid to Northern Italy) the last week in April thru the first week in May and it was perfect for walking around. Not warm enough yet to get in the water though."}, {"username": "Lynn Francisco Casella", "comment_text": "California Mediterranean weather cycles hot summers wet winters"}, {"username": "Frannie Kaplan", "comment_text": "Around Easter but that's when all the other tourists go. September. October if you don't want to spend any time in the water or any outdoor activities"}, {"username": "Mandy Miller", "comment_text": "I'm going January!!!! 😁.... I mite have mentioned it before on here 😬😂... I don't care 😅... I'm gonna wrap up... And enjoy 🤗... Its my 60th and I'm spending it in Rome 😍❤️... Eeeeeeekkkk"}, {"username": "Ginger Smith Simpson", "comment_text": "March was nice"}, {"username": "Renae Larcus", "comment_text": "May or Sept/Oct are the best months for us."}, {"username": "Sheryl Elizabeth", "comment_text": "Here now, very hot 🥵 I’d say late May or September, that’s what we plan for next time"}, {"username": "Florida Elizaga Freeman", "comment_text": "We’ve been to Italy several times and we always come in September, the weather is perfect and less crowded. We were there last September again."}, {"username": "Elaine King", "comment_text": "I'm going in May, I don't want to go in winter, I can't take the cold, check out the yearly temps"}, {"username": "Raelyn Werbish Zeilinger", "comment_text": "Husband and I going Dec 2024 no crowds and no heat!!"}, {"username": "Eve Tang", "comment_text": "I did Sicily in mid September, it’s sunny and dry, still managed to have a dip during the day."}, {"username": "Lisa Pro", "comment_text": "Apirl for me every year is perfect. Some rain but cool and pleasant"}, {"username": "Anthony Sperduti", "comment_text": "April"}, {"username": "Dana Marie", "comment_text": "October"}, {"username": "Charlotte Lowe", "comment_text": "We went in March and it was fabulous!"}, {"username": "Nikki Nestor", "comment_text": "Too"}, {"username": "Irene Paonessa", "comment_text": "Anyone’s guess these days"}, {"username": "Mario Lewis", "comment_text": "We always go during Lent. Weather is perfect. Tourist traffic is just beginning and locals are active with religious activities and seasonal foods."}, {"username": "Donna Snow", "comment_text": "May or October"}, {"username": "Martin Gilchrist", "comment_text": "October"}, {"username": "Jerome Burdi", "comment_text": "Been there in October. Found it very comfortable. Going this September."}, {"username": "Patti Aparo", "comment_text": "My sister and I visited in mid October and it was beautiful!"}, {"username": "Nadia Greco", "comment_text": "May"}, {"username": "Brad Nelsen", "comment_text": "May and September"}, {"username": "Mary Lou Gillen", "comment_text": "October is our favorite time. Weather is beautiful. Not as crowded and kids included college are back in school."}, {"username": "Desiree Chetty Paliam", "comment_text": "End May was fine for us"}, {"username": "Cindy Dill Rosenthal", "comment_text": "We were there in October- Rome, Florence, Sorrento and wine country. It was in the 70s"}, {"username": "JoAnn Jocelyn", "comment_text": "I went Nov 8-20 and it was magical! Day trip to Pompeii was actually HOT. Weather was similar to San Diego weather"}, {"username": "Sylvia Martens", "comment_text": "Januari"}, {"username": "Tricia Bean Scott", "comment_text": "April/May or September/\nOctober."}]}, {"id": "2199871180411960", "text": "Hi, we are a family of five looking to go to Italy next year from the UK. We quite fancy doing some cities and some chill out beach time in between Kids will be 11, 12 and 14 so not overly young but still need to be occupied to a certain extent and certainly kept active and off their phones!\n\nDoes anyone have a suggested itinerary. We will probably be going end of June/ start of July 2024.\n\nThanks very much in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2199871180411960/", "likes": 0, "comments": []}, {"id": "2199870470412031", "text": "Booking a Itsly vacation from 12/21-1/4/24 and have some questions on booking tickets a head of time for sight seeing . Will I need book ahead for tickets for the popular sights in December and for restaurants ?", "link": "facebook.com/groups/1373361046396315/permalink/2199870470412031/", "likes": 0, "comments": []}, {"id": "2199868693745542", "text": "Can anyone suggest a taxi company to pre-book with for short ride from La Spezia Centrale to the Hertz Car Rental place there? We realize it’s only a few km, but will have our luggage with us and don’t want to walk or take a bus.", "link": "facebook.com/groups/1373361046396315/permalink/2199868693745542/", "likes": 0, "comments": []}, {"id": "2199861310412947", "text": "hello everyone! First time in Rome next month, and since i want to hit the basics, is the Roma pass worth it? and if so, any recommendations or tips on how to get the most out of the pass?\nthank you!!", "link": "facebook.com/groups/1373361046396315/permalink/2199861310412947/", "likes": 0, "comments": []}, {"id": "2199848423747569", "text": "hello. in rome now and with my father who uses a wheelchair. looking for a driver that could show us around town. please send any recommendations. we’re a party of 6.\nthank you.", "link": "facebook.com/groups/1373361046396315/permalink/2199848423747569/", "likes": 0, "comments": []}, {"id": "2199846880414390", "text": "How often does Leonardo express run from Fiumicino airport to Roma termini? We arrive at 8am and need to catch the train from Roma termini to La Spezia.", "link": "facebook.com/groups/1373361046396315/permalink/2199846880414390/", "likes": 1, "comments": [{"username": "Sara Beth", "comment_text": "Sara Beth"}, {"username": "Sara Beth", "comment_text": "Sara Beth"}, {"username": "Connie Wilson", "comment_text": "https://\nleonardo-express\n.com/en/\nen-leonardo-expr\ness-tickets/"}]}, {"id": "2199844473747964", "text": "Venice in the summer…need dinner reservations or not so much?", "link": "facebook.com/groups/1373361046396315/permalink/2199844473747964/", "likes": 0, "comments": []}, {"id": "2199842193748192", "text": "Central train station in Pisa… 💗\n\nI’ve added more photos…. Of the station, baggage drop, views of the city, & where we ate lunch. 💖\n\nI ❤️ Pisa!!", "link": "facebook.com/groups/1373361046396315/permalink/2199842193748192/", "likes": 22, "comments": [{"username": "Vasthi Cheddar", "comment_text": "Taken at night on our way back to Florence"}, {"username": "Jeidy Christina Duarte", "comment_text": "My sister lives in Pisa 💗"}, {"username": "Mike Ball", "comment_text": "Used that station a few times in recent years ."}, {"username": "Benedetta Vanni", "comment_text": "The square was recently renovated: much better than before!"}, {"username": "Janet Canter", "comment_text": "Is there a train from the Livorno cruise port to Pisa?"}]}, {"id": "2199842093748202", "text": "Thank you all for the great suggestions, tips and recommendations . This group is wonderful resource.\nComing from the USA, what is the recommended form of payment? Should we get euros or use debit card or credit cards? Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2199842093748202/", "likes": 0, "comments": []}, {"id": "2199840550415023", "text": "RECOMMENDATIONS/TRAVEL TIPS\n\nHey!\nWe are taking a cruise from italy next may! The ship starts in Ravenna, but we wanted to stay some days in italy before we leave. Any good places around Ravenna to visit or things to do? How many days should we stay before we go?😇 Can be out of town if traveling there is easy! Google was not too helpfull🙈\nThank you for any tips!", "link": "facebook.com/groups/1373361046396315/permalink/2199840550415023/", "likes": 0, "comments": []}, {"id": "2199837440415334", "text": "looking to surprise my partner with a romantic dinner in rome, florence, venice or milan. on a budget but if it’s worth it i’ll splash out?\n\nbest recommendations within walking distance from CBDs please!\n\ntia xx", "link": "facebook.com/groups/1373361046396315/permalink/2199837440415334/", "likes": 0, "comments": [{"username": "Alessia Zito", "comment_text": "What is it cbd? I only know cannabinoids with this name🤣"}, {"username": "Despina Tsathas", "comment_text": "Restaurant Mazze in Rome, however you will need to make a reservation. We just went there and was amazing. A little pricy but worth it for us. It is also in Rome CBD 🙂"}, {"username": "Mat PO", "comment_text": "Oro at the Cipriani in Venice."}, {"username": "Claudia Amp", "comment_text": "Venissa in Venice (maybe try the osteria contemporanea which has lower prices) or La Zucca (my favourite place in Venezia, food is amazing and the ambiance is lovely); Garghet in Milano (but it’s a bit outside of the city, beautiful ambiance though) Osteria del Binari, Al Fresco; in Roma Rimessa Roscioli is one of my favourites, in Firenze, Santo Bevitore, Le Lune"}, {"username": "Paul Davis", "comment_text": "Oh please don’t “splash out!” What does that mean??"}, {"username": "Brian McGraw", "comment_text": "Trattoria dall Oste in Florence.\nBistecca alla Fiorentina.\n\nhttps://\ntrattoriadallost\ne.com/en/"}, {"username": "Cathy Tabaku", "comment_text": "If you’re big on seafood, Golden View in Florence!! My husband and I celebrated an anniversary here, it’s perfect especially if you get seated on the edge of the river rather indoors. Or La Giostra, it’s become quite touristic over the past couple years but we had our first date here almost 10 years ago so it’ll always hold a special place in my heart haha. Ambient lighting with twinkle lights overhead, great service"}, {"username": "Katelyn Klawinsky", "comment_text": "Tonarello!!!!! In rome! So good"}, {"username": "Sherry Gilliam Patrell", "comment_text": "We did a beautiful, romantic dinner cruise in Venice. I can't remember the name but it's literally the only one when you look up dinner cruise in Venice. It departed near St Mark's Square."}, {"username": "Frannie Kaplan", "comment_text": "La feluca in Venice, I don't remember the others"}, {"username": "Isabella Banfi", "comment_text": "Delicatessen in Milan (ask to sit in the loggia)\nTrattoria Napoleone in Firenze\nIdylio by Apreda in Roma (expensive but def worth it for a romantic dinner)\n\nAll not touristic places and very romantic 🥰"}]}, {"id": "2199836223748789", "text": "I will be in Sorrento from Sept 29th to October 5th. What area of Sorrento is a good place to stay. I will be traveling solo and there isn't much for hostels in the area. Also will not have a car so easy access to busses and ferries are a necessity.\n\nAlso appreciate any other tips for 5 days in Sorrento for a solo traveler looking to meet people and explore and have a great experience.\n\n1st time in Italy as well.\nThanks!!!", "link": "facebook.com/groups/1373361046396315/permalink/2199836223748789/", "likes": 0, "comments": []}, {"id": "2199835170415561", "text": "Hi,\n\nAfter many thoughts and research , I have finally decided travelling to Florence in April with a family of 5 ( 2 adults and 3 children aged 12, 8 and 6 ). I am tentatively looking from April 1- April 11th ( Total of 9 days visiting places). My breakdown will be as follows :\n\nFlorence ( Free & Easy ) & 1 day with Guided Tour\nPisa & Lucca ( 1/2 day in each city)- Free & Easy\nSiena ( 1 day ) -Free & Easy\nTuscany - (1 day ) - Guided tour\nCT ( Free & Easy ) and also looking for a cooking class and art class if it’s available.\n\nI would like to ask whether is there any recommendations as below:\n\nFlorence -Suggested number of days\n- Recommended Guided Tour\n- Suggested Air BnB in Florence (preferably near Duomo)\n\n5 Terre - Suggested number of days\n- Cooking Class and Art Class\n- Suggested Air BnB in Monterosso\n- And the hiking trails : Is there an order that I could follow ? I am looking from Easy to Moderate trails because of the children. And planning to explore the 5 towns on different days. And from which town should I start with the hike first ?\n\nThis is our very first trip to Europe as a family hence many questions. I look forward hearing your valuable suggestions.\n\nThank you very much !", "link": "facebook.com/groups/1373361046396315/permalink/2199835170415561/", "likes": 0, "comments": [{"username": "Claudia Amp", "comment_text": "SIENA not SIENNA 🥺"}, {"username": "Jennette Riches", "comment_text": "here is some info on hiking Cinque Terre https://\nwww.cinqueterre.\neu.com/en/\nfootpaths-cinque\nterre"}]}, {"id": "2199833343749077", "text": "Few tips for those who travel by train in Italy.\n\nBuy tickets in advance so you can get cheaper rates through Trenitalia or Italo apps and websites.\n\nYou only need to VALIDATE paper tickets for regional/local trains (TRENO REGIONALE) before you board your train; paper tickets for INTERCITY, FRECCIABIANCA, FRECCIAARGENTO, FRECCIAROSSA and ITALO do not need to be validated cause they serve as reservations (they have date/time stamp and seat assigned). Forgetting to validate will get you fined. Validating machines are found all over the platforms.\n\nTickets both physical or digital may have to be scanned prior to accessing the platforms or they may be checked by station personnel at the access points leading to the platforms.\n\nCarefully check train number and not the train type or destination on the station display to know exact departure platform, delays, cancellations etc. Do not base yourself on your destination cause it may not be the final destination of the train’s journey.\n\nSome stations are huge with long or far away platforms, make sure you get to your platform at least 10 mins before set time. Sometimes platforms aren’t announced until very last minutes, stay close to access points so you can hurry to your platform once it’s displayed.\n\nMake sure to double check coach and seat number before boarding to avoid walking the whole train and creating traffic onboard.\n\nSecure luggage on overhead racks if possible above your seat; or store your luggage in between seats in front of you so you can have them visible at all times.\n\nHead to the doors a few minutes before leaving the train especially if your destination is not the final stop.\n\nYou can follow the route through the Infomobilità section on the Trenitalia app Italo app or Google map to see the train stops. Normally stops are announced but you may miss it if it’s dark, noisy etc.\n\nMain train companies are Trenitalia (state owned) and Italo. Trenitalia operates both local and fast trains whereas Italo operates only fast trains.\n\nThe main connecting train stations are:\n\nRoma Termini\nMilano Centrale\nBologna Centrale\nFirenze Santa Maria Novella (SMN)\nNapoli Centrale\nVenezia Santa Lucia (S. L.)\n\nThese stations all have fast trains connecting them via Italo or Trenitalia. Some parts of Italy do not have fast trains (especially coastal areas and some southern parts of the country.)\n\nAlways look for the CAPOTRENO for any info while on the train. In the stations go to info points operated by Trenitalia or if travelling with Italo, find their info points.\n\nTicketing machines for Trenitalia and Italo are different. Not all stations have operating ticket offices (only a handful in bigger train stations) so beware.\n\nHope this helps.", "link": "facebook.com/groups/1373361046396315/permalink/2199833343749077/", "likes": 4, "comments": [{"username": "Scott Perry", "comment_text": "Thanks!"}, {"username": "Mbell Arteaga", "comment_text": "We will be traveling between cities and taking trenitalia. These have a set time on the ticket, do they need to be validated? I didn’t see this company listed above where you said it didn’t have to be validated but I wanted to make sure. Thank you in advance!"}]}, {"id": "2199822337083511", "text": "Someone brought up the restaurant Laganà in Rome yesterday and several people said they’d be staying nearby. Another incredible place close in Ponte is La Fraschetta di Castel Sant’Angelo. The owner of anआणखी Airbnb I stayed in a year or two ago recommended it (the first screenshot) and he wasn’t lying, the carbonara is amazing. I’ve returned a few times and I always get that, so can’t speak on their other mains. But their prosciutto e bufula and the bruschetta mix make for great starts and are huge, so best to plan on sharing. Reservations aren’t required but often necessary, especially for dinner. I was there a couple weeks ago and arrived right as they opened at noon, within 20 minutes they were full. Price is reasonable, the primi pastas are 10€ I believe.", "link": "facebook.com/groups/1373361046396315/permalink/2199822337083511/", "likes": 5, "comments": []}, {"id": "2199806513751760", "text": "Looking for recommendations for our 3 week trip to Sorrento next September. Looking for B&B or apartment for 2 couples. Preferably 2 bedrooms and 2 baths! Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2199806513751760/", "likes": 0, "comments": []}, {"id": "2199804410418637", "text": "Do I have to buy tickets to the Colosseum for my four kids who are all under eleven?", "link": "facebook.com/groups/1373361046396315/permalink/2199804410418637/", "likes": 0, "comments": []}, {"id": "2199802433752168", "text": "Looking for input. I am getting ready to book a boat tour of Capri. I want to see the Blue Grotto (so please don't tell me not to waste my time) The tour I am looking at goes to the grotto early in the morning. Will the water be illuminated? Has anyone gone first thing? I read the best time is between 12-2pm but that the wait times can be super long.", "link": "facebook.com/groups/1373361046396315/permalink/2199802433752168/", "likes": 0, "comments": []}, {"id": "2199800960418982", "text": "Need guidance for The Colosseum. Trying to buy tickets for my wife and I, and we have 4 kids 11 and under. Are the kids free? Where do I “purchase” their free ticket from Coop Culture?\n\nOur dates in August are available currently which is great, but I definitely need to get moving.\n\nThanks all in advance!\n\nFeliz Ebora Santos", "link": "facebook.com/groups/1373361046396315/permalink/2199800960418982/", "likes": 0, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2199790320420046", "text": "We're traveling from Florence to Priaiano in early October and wondering the best way to get to our Airbnb... thinking train from Florence to Naples, then private transfer?", "link": "facebook.com/groups/1373361046396315/permalink/2199790320420046/", "likes": 0, "comments": []}, {"id": "2199790300420048", "text": "Outside of Pompeii I don’t want to do the touristy sites. I want to be immersed in day to day life. Olive groves and farm life. Homemade meals and wine making. Can anyone recommend websites or locales that I can research about this? I want to do this in and around Tuscany/Rome/Amalfi Coast. I do plan to stop in Naples just to have pizza. I just saw Viator website and the Sorrento farm tour is the type of experiences I am looking for but in each area. TIA!", "link": "facebook.com/groups/1373361046396315/permalink/2199790300420048/", "likes": 0, "comments": []}, {"id": "2199781497087595", "text": "We’re due to fly to Naples next week but I’m a little worried due to the heat and how safe it will be actually going to Italy? Any suggestions? Xx", "link": "facebook.com/groups/1373361046396315/permalink/2199781497087595/", "likes": 0, "comments": [{"username": "Dave Conroy", "comment_text": "Yes, just go ... and be sensible with the heat. Alternatively, cancel everything and stay home. Only you can decide what you're comfortable with, but check official sources to help with your personal decision."}, {"username": "Cat Furness", "comment_text": "It’s actually cooled right down today and it’s gonna be like this for at least the next week 😊"}, {"username": "Allison Taeger Wilson", "comment_text": "We've been in Rome the last 3 days it's been hot but not unbearable, stick to the shade and drink lots of water. Felt totally safe we've been in all the major tourist sites and no issues - we just said no politely to any street vendors and kept moving."}, {"username": "Stephanie Osborn Rushing", "comment_text": "We leave in a week or 2 and highs are 80s down on amalfi coast. 90s in Rome. Think we missed the heat wave. 🙌🏻"}, {"username": "Marilyce Arbelo", "comment_text": "Highly recommend LMNT or Ultima electrolytes. Drink at the beginning of the day so that helps with hydration. It helps me to avoid the light headedness/ headaches/heat exhaustion more easily. Obviously, lots of water throughout the day too.\n\nI’m in Rome now and it is hot, but bearable. Pack breathable clothing, dresses, sun hat, etc. Tour in the early mornings and evenings. That has helped us to beat the crowds too!"}, {"username": "Alessandro Iannelli", "comment_text": "It shouldn't get hotter than 33 in the next 2 weeks in Naples. As for safety, the usual rules apply, the ones you would follow anywhere you go on vacation."}, {"username": "Glenn Todd Webb", "comment_text": "Safe as anywhere in heat. Drink a lot and pace yourself"}, {"username": "Debbie Osborn", "comment_text": "I’ve been praying for the weather to be cooler for your trip. Thank you LORD!"}]}, {"id": "2199779387087806", "text": "We arrived home. Must say waking up in the middle of the night in your own house is confusing after being away for three weeks and staying in eight different places.\n\nI have received many requests for full details of our trip and once I get caught up on work stuff I will put a post together. But as I know people are actively planning their own trips will share some details of our itinerary and accommodation happy to answer any questions as this group was a great resource for my planning.\n\nDays 1-4: Florence in large three bedroom apartment (can be booked as AirBnB but I booked with Apartments Florence), tons of stairs but the location by Mercato Centrale and the two rooftop decks made it worth it.\n\nVan with driver from Florence to Vernazza with stops in Siena (1 hr), San Gimignano (2 hrs - grabbed lunch) and Pisa (1 hr) was well worth the money. Our driver was great like having someone uncle or poppi drive you around.\n\nDays 4-7: Stayed in Vernazza which after visiting all five towns in Cinque Terre was 100% our favourite. We explored all towns by foot and train. We LOVED Carattino 12 where we stayed that we have booked with Cinque Terre Vacation. Ruth was by far the most amazing host I have ever dealt with and the apartment was amazing. On our final night there booked a five hour sunset cruise with hellocinqueterre which was the highlight of our weekend there. They are based out of Manarola and were amazing. Seeing the towns from the water was amazing and you could even arrange to visit a few or stop for swimming if your time allows.\n\nTrain from Vernazza to La Specia and connecting train to Rome.\n\nDays 7-11: Rome (yes this was a lot of time but we knew it was going to be the hottest part of our trip and we were planning on going back to our apartment in the afternoon every day which we did). As we were there for more days we were not rushed at all which was great as it game us a chance to relax and enjoy the city and all it had to offer. We stayed in a massive four bedroom apartment that was located in Ponte which we thought was a great location.\n\nCaught train from Rome to Naples and changed to the Campania Express to continue our travel to Sorrento (the journey on the Campania Express was one of the only crappy parts of our entire trip, wish we had just booked a van)\n\nDays 11-13: Sorrento we booked Raffaele’s place through AirBnB. Was a strange place in the end as it was four bedroom units with ensuites off of a main corridor. Would be great for couples or people traveling together that want their own space but for a family was weird. It was centrally located and clean. The area was a bit loud at night but got the sense that a lot of Sorrento is loud at night on a weekend. Fun town though. On the Sunday (day 12) we were picked up by a driver to head back up to Pompeii and Herculaneum for a private tour that I had arranged. The guide Ludovica from Ludviguida was just amazing, we had originally found her though Tours with Locals but easier to book her directly through her Instagram or website. Driver took us back to Sorrento after the tours.\n\nDays 13-16: Capri and Amalfi Coast we were on Capasecca for this time and it was amazing and super memorable. Pretty big splurge but do not regret it for one second. Being on a boat avoided traffic and allowed us to be in Capri and Amalfi after the day trippers had left which is a completely different experience. The girls all loved Capri so next time we will likely stay there for a few nights and arrange day trips by chartering a boat to visit other towns if we want.\n\nDays 16-17: Booked van with driver drive us to Naples for the night. Had just planned on late dinner and sleeping there but aftr having met Ludovica we arranged last minute to have a tour of her beloved home city Naples the morning before we left. We did a two hour tour with her and only wish we had had more time but will be back.\n\nTrain from Naples to Bologna and then out to Parma.\n\nDays 17-19: Parma we just stayed at the Novotel as there were very limited options when we booked as it was late change to our itinerary to go to the Harry Styles final concert of his world tour. The hotel staff was great, hotel was clean and we got one of the few adjoining rooms which made us happy (when were were told the room numbers were 322 and 329 by front desk we were not expecting them to be adjoining). We didn’t really get a chance to explore the town or area but did squeeze in a tour of a cheese factory which was fun and cool to see.\n\nDays 19-20: Train back to Florence via Bologna. This was the only missed train connection of our trip. Had booked a hotel for our final night just because meeting someone for keys for one night seemed like dumb idea. In the end it was the most amazing finally night we could have hoped for with an absurd room upgrade. The hotel had a small outdoor pool in a garden setting and staff were great. We will definitely stay that next time we are in Florence.", "link": "facebook.com/groups/1373361046396315/permalink/2199779387087806/", "likes": 75, "comments": [{"username": "Monique Gomez", "comment_text": "Can you send links for Florence apt and Rome apt? Thank you!!!"}, {"username": "Tracy Foss", "comment_text": "What hotel was your last night?"}, {"username": "Walace Garroux Sampaio", "comment_text": "Could you tell me the name of the hotel in Florence ?"}, {"username": "Margo Burrage", "comment_text": "Your day driver from Florence, please!"}, {"username": "Kathy Morra Kuloy", "comment_text": "I booked Ludovica from your recommendation!\nThank you! Looking into a driver from Sorrento to Pompeii. Do you remember the cost by any chance?"}, {"username": "Liznel Aixa Rodriguez Tapia", "comment_text": "F"}, {"username": "Mary Stinnett Boggs", "comment_text": "Thats lot of places to visit!! Thanks for sharing your experiences!"}, {"username": "Darlene Maurer", "comment_text": "What a fabulous trip!! You even included a concert with one of your favorite artist😃\nThank you for sharing with us!"}, {"username": "Scott Perry", "comment_text": "I’m never disoriented in places I stay at while traveling, but as soon as I get home… Weird."}, {"username": "Sandra Wilder Austin", "comment_text": "I love that you fit in the Harry Styles concert 💕💕"}, {"username": "Melissa Ciske", "comment_text": "Can i get the link to the apartment?"}, {"username": "Debra Bianco", "comment_text": "Hi - what size yacht did you rent and for how many people? Thank you. Yours posts have been very helpful"}, {"username": "Erin Freeman Harris", "comment_text": "What company did you use for a private transfer with tout from Florence to Cinque Terre?"}, {"username": "Guiseppi Salerno", "comment_text": "Where did you stay in Florence ?"}, {"username": "Kathy Schieber", "comment_text": "Could you also send me the links for the Florence and the Rome stay ￼"}, {"username": "Deborah Wilson Melton", "comment_text": "Wow what great information, sounds like you had it all planned out to a T. Bravo 👏👏👏"}, {"username": "Debra Bianco", "comment_text": "Thank you for your help…1 last request…the link for your Rome accommodations?\nThanks"}, {"username": "Mariët Eertman-Heemstra", "comment_text": "Sounds as a really wonderful and fantastic vacation!!! Didn't you know about the village of Ravello with the 2 villa's with an amazing famous view over the Amalfi Coast? Or didn't you had any time left for that?\nWould also love to see some of your pictures!!"}, {"username": "Ruthann Isbell", "comment_text": "Keri Popiel"}, {"username": "Katherine AliNuñez", "comment_text": "Beautiful family trip."}, {"username": "Yolie Marroquin", "comment_text": "Lol"}, {"username": "Guiseppi Salerno", "comment_text": "What is name of Hotel in Florence with a pool….thanks"}, {"username": "Joo Kheng", "comment_text": "Can I check the price of hiring a driver for two days?"}, {"username": "Donna Dillon", "comment_text": "Hi - how much was the boat tour in CT please?"}, {"username": "Tutti Burkett", "comment_text": "What driver service did you use in. Florence?"}, {"username": "Ivette Lugo", "comment_text": "Thanks for sharing!!"}, {"username": "Ilaria Giorgulli", "comment_text": "My compliments for your organizational skills! I’m Italian and I’m taking notes!😁"}, {"username": "Sandra Robinson", "comment_text": "Rough budget please"}, {"username": "Jenni Richardson", "comment_text": "I am looking for a 3broom place for late Dec in Rome. Where did you stay in Ponte Jeff McLellan?"}, {"username": "Kerry Jacobsen", "comment_text": "Just read through all your posts. Loved it. You have presented an honest and entertaining overview of your experiences and I sense your warmth and humility. We are heading that way in 7 weeks, although our budget is much more restricted than yours, I am now even more excited about our trip. Your posts are informative and helpful and I appreciate you have taken the time to share your thoughts and in so doing help other travellers. I am an Australian and Australians love Canadians. I hope you can visit our country some time, if you haven’t already."}, {"username": "Kristen Fuller Muscato", "comment_text": "Thanks for train info from Naples to Sorrento. Had heard that local train is bad, we’re definitely doing the bus or a driver instead. 👍🏼"}, {"username": "Teresa Allyn Hunt", "comment_text": "What was your awful experience on the train to Sorrento? Was thinking on doing the same thing in September."}]}, {"id": "2199778753754536", "text": "We are leaving Sicily to Rome with ITA then we are taking Norse to Jfk New York. Does anyone know if we have to claim our luggage in Rome and then re check them in ?", "link": "facebook.com/groups/1373361046396315/permalink/2199778753754536/", "likes": 0, "comments": []}, {"id": "2199777480421330", "text": "We’ve just booked an air bnb\nNizza on Viale Nizza Campania. Has anyone stayed here or nearby before? Any recs for a nice pizza/pasta restaurant pls? TIA", "link": "facebook.com/groups/1373361046396315/permalink/2199777480421330/", "likes": 0, "comments": []}, {"id": "2199777073754704", "text": "What's the best, scenic, safe and cost efficient way of transportation to get from:\n\n1. Naples airport to Ravello?\n\n2. Ravello to Florence?\n\n3. Florence to Milan?\n\nWithout renting a car? Thanks in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2199777073754704/", "likes": 0, "comments": [{"username": "Anne Swigard", "comment_text": "Trains for most if not all of your travel."}]}, {"id": "2199750077090737", "text": "Good Morning,\nTraveling to Rome, Florence, and Venice this week. Going to stay 3 days/nights in each. Traveling with my daughter who wants to take a day trip to Cinque Terre. Considering we are not in each city for very long, is this worth an entire day trip? If you have done a day trip and used Viator or Get Your Guide, can you possibly link which tour you did? Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2199750077090737/", "likes": 0, "comments": [{"username": "Lisa Weil Verebay", "comment_text": "Have a great time. Italy is beautiful. I haven’t been to Cinque Terre but it is supposed to be great and I have used Viator several times and the tours were great😊"}, {"username": "Caryn Levy", "comment_text": "Karen Violet, have a great time!! I loved Rome the most, but Florence and Venice are beautiful! So glad you a taking the trip with your daughter ❤️"}, {"username": "Julie Landry Laviolette", "comment_text": "Have a wonderful time Karen Violet ! I know you will make great memories. I went to Cinque Terre years ago and it was very beautiful. Michelle Hager Ostrander just recently went with her daughter, Emily, who was in high school with our kids."}]}, {"id": "2200231157042629", "text": "We are staying in Stresa, and I am looking for ideas on what to do the day my husband will be at the Monza Grand Prix. Any ideas please?", "link": "facebook.com/groups/1373361046396315/permalink/2200231157042629/", "likes": 0, "comments": [{"username": "Ryan Shearer", "comment_text": "Watch it in a bar?"}, {"username": "Nikki Hawkings", "comment_text": "Haha read the post first and then looked at your name. I thought, oh Lisa is looking for something to do that day!"}]}, {"id": "2200237477041997", "text": "#sardinia\nHi there!\n\nI'm going to Sardinia, Alghero this weekend. My plan was to see La Pelosa beach. I realized that I need to book my spot on the beach, 48 hours ahead. I am actually a bit stressed if I will not be able to get one cause they are running out very quickly...I will try 6in the morning when they open up.\nThat's the only reason I chose Alghero so I really want to see this beach ..🙂🙈\n\nDoes anyone have any tips/tricks for that? Is it easy to book early? Is there any other way to have one if I miss this..?\nThanks a lot! 🙂", "link": "facebook.com/groups/1373361046396315/permalink/2200237477041997/", "likes": 0, "comments": []}]