[{"id": "2213250222407389", "text": "Has anyone stayed at the Hotel Golden near the Spanish Steps? I’m tentatively booked for September 2024", "link": "facebook.com/groups/1373361046396315/permalink/2213250222407389/", "likes": 1, "comments": [{"username": "Robyn Lawson", "comment_text": "No but i have stayed in Trevi Palace very close to Trevi Fountain. It was fabulous. 😊💙"}]}, {"id": "2213204445745300", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213204445745300/", "likes": 44, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 8, "comments": []}, {"id": "2213103522422059", "text": "We are going on a cruise next Sept to Greek isles, we are planning to get to Rome maybe 5 days before our cruise so we can tour Italy for a few days. We are a family of 11. ( 6 adults and 5 kids). Can someone recommend the cities to visit and how long to stay? I'm currently looking for a travel agent that will help with transfer and accommodations. We are coming from the U.S. thank you in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2213103522422059/", "likes": 4, "comments": [{"username": "Mandy Pusateri", "comment_text": "We are doing the exact same thing next month!! We are flying into Rome, spending three days there, and up to Venice for two days. We are still trying to figure out some things that we want to do, but we are slowly getting a plan together.\n\nWe leave for our cruise Sept. 17th!"}, {"username": "Sylvia Kotsopoulos Vocino", "comment_text": "We just did something similar. Flew into Venice and stayed 2 nights, trained to Milan for 2 nights and a day trip to Lake Como. Trained to Florence for 3 nights. Trained to Civitavecchia to catch a cruise (Amalfi, Barcelona, Mallorca, Marseilles and Pisa) then Rome for 4 nights! Flew home to Canada from Rome!"}, {"username": "Sue Knuth Walters", "comment_text": "Can you tell me what cruise line in Greece you are doing. I’m looking for ideas."}, {"username": "Dawn Falsinotti", "comment_text": "I would stay in and around Rome. There us plenty to see and do. Traveling with 11 people is no easy task. Maybe a day trip to Pompeii?"}, {"username": "Rosa Zordan", "comment_text": "Highly recommend the help of a travel agent for such a large group. But should be a lot of fun. Stay in one place and travel by train or bus to areas of interest for day trips."}]}, {"id": "2213183325747412", "text": "Hi everyone, I’m new to the group! 👋🏻 😊 I’m looking at booking a long weekend to Rome in April 2024 and considering the following 4 hotels. Has anyone stayed at them before? Would love a personal review, I’ve had a quick look on trip advisor already - thank you in advance.\n\nThe Glam Hotel\nHotel The Building\nHotel Mozart\nRome Times Hotel", "link": "facebook.com/groups/1373361046396315/permalink/2213183325747412/", "likes": 4, "comments": [{"username": "Vadim Gotovsky", "comment_text": "I think opinions you might get here would be no better or worse than those that you see on google, booking or tripadvisor. I have been using those sources to look for hotels for many years and 99% it was to my expectations. One thing to be careful about is when there is high rating with only few reviews. Good luck."}, {"username": "Jenny Frank", "comment_text": "Look at Scalinata di Spagna"}, {"username": "Elana Kruger", "comment_text": "We just stayed at Hotel Nazionale - great hotel & fabulous central position"}, {"username": "Lisa Ric", "comment_text": "Vivo a Roma e posso consigliarti di evitare la zona limitrofa alla stazione termini."}, {"username": "Anne Riemer", "comment_text": "I have Rome Times Hotel booked for March, based on reviews on Trip Adviser and Google, so hoping it meets my expectations"}, {"username": "Davie Ren", "comment_text": "Stayed twice at the Glam, it is a lovely hotel, modern decor, great,freindly staff, amazing food and a great rooftop bar and restaurant. It is very central to all the sightseeing about 15 min walk to Trevi. Will always recommend the Glam!"}, {"username": "Ryan Martinez", "comment_text": "My research recently I must confess nobody handles cryptocurrency I've, had the privileged of working and investing with he and must say his the best.\nAnthony Mambafx Rodriguez"}, {"username": "Nicky Massey", "comment_text": "I always stay at hotel forum! Love the roof top restaurant and then bar on the roof of that!"}, {"username": "Ashley Gustafson", "comment_text": "We will be staying at the rome times hotel next month!"}]}, {"id": "2212672249131853", "text": "I am a big Limoncello fan. I’ve already booked a Limoncello tour in Amalfi Coast when I’m there in October (first time in Italy). I’m curious, are there any recommended brands or labels I should be on the look out for while there? What is and where do I find the best Limoncello in Italy?", "link": "facebook.com/groups/1373361046396315/permalink/2212672249131853/", "likes": 53, "comments": [{"username": "Annemieke van Eijk", "comment_text": "Monte e mare"}, {"username": "Susan Rathke", "comment_text": "My cousin claims Sorrento has the best Lemoncello."}, {"username": "Elaine Phillips", "comment_text": "Capri was my fav"}, {"username": "Darlene Bonura", "comment_text": "The best limoncello Is the One you make at home!"}, {"username": "Christine Harris Veneziale", "comment_text": "LOTS of stores give u samples but when u get home to the states make it for the holidays it’s soo easy and delish I even make a low carb version"}, {"username": "Rita Davoli-Conti", "comment_text": "I haven’t found one I don’t like!"}, {"username": "Scott Bauerle", "comment_text": "Scott Bauerle"}, {"username": "Nat Cleary", "comment_text": "Youll end up trying them all when you go anyway. Every restaurant gave us a shot after each meal lol\nOn the lemoncello factory before Sorento they give you three to try when you arrive. The double distilled one was like liquid fire haha"}, {"username": "Jan Wightman", "comment_text": "F"}, {"username": "Gayle Moore", "comment_text": "We got. Lemoncello from Amalfi (homemade), Sorrento and the airport. The Amalfi was slightly richer in flavor but the others were great and it was easy to purchase at the airport !"}, {"username": "Behindthelens Skeeter", "comment_text": "I was told the Italians drink melonchello more then lemonchello. Lemonchello is more for tourists"}, {"username": "Debbie Nelsen", "comment_text": "F"}, {"username": "Kimberly Jo", "comment_text": "I did a pasta making class while in the Amalfi Coast, and the people who owned the property made their own Lemoncello. Out of all the Lemoncello we tasted, the authentic homemade was by far the best. My advice is to maybe search for a family owned brand where you can purchase an authentic bottle while touring around. 🍋🥂 Enjoy!"}, {"username": "Catina LaBorde Drouillard", "comment_text": "Just an FYI, Valerie Bertinelli has a great limoncello recipe if you want to try to make it. It's not hard. Just takes time."}, {"username": "Robin Kaiser", "comment_text": "This maker is in Sorrento. The shop is in town and they allow you to taste."}, {"username": "Gillian Bache Tidd", "comment_text": "Can't go wrong !!"}, {"username": "Charles McCloskey", "comment_text": "Make a batch I do once a year"}, {"username": "Kelli Lewis McElroy", "comment_text": "Limoncello di Capri is my favorite."}, {"username": "Jeff Overman", "comment_text": "After we got home from a trip to Italy, a friend poured some Lemoncello for us and it was delicious. We asked where it came from. The answer: Wegman’s grocery store (here in the US)!"}, {"username": "Laura Olmstead Montanaro", "comment_text": "The one we went on in sorrento was amazing! Wine tasting, limoncello tasting, olive oil tasting and balsamic tasting in one place!"}, {"username": "Michael Imbelli", "comment_text": "Readily available in the USA. We keep bottles in the freezer. Try to buy adorable limoncello ceramic glasses while there. 🙌"}, {"username": "Kathy Shears", "comment_text": "I have a lemon tree & a few years ago I made my own limoncello! It really turned out pretty good & tasted just as yummy as what we had in Italy."}, {"username": "Dora Varga", "comment_text": "A Paula Brown limoncello tour!!"}, {"username": "Kelly Rennie", "comment_text": "You're going to the right place. You can't go wrong buying while on the tour. Any of the stores in Amalfi sell Limoncello made there."}, {"username": "Jeannine Egdorf Phelan", "comment_text": "Jeannine Egdorf Phelan"}, {"username": "Patricia Cabrera-Savoy", "comment_text": "Gilda"}, {"username": "Cheryl Swiatko", "comment_text": "We were told to put our bottles in the fridge when we got home."}, {"username": "Kathy Van Zant Mowdy", "comment_text": "When you get home, make your own! No, it’s not the Amalfi lemon but it’s fun to make. Google recipes. Meanwhile, we learned on a tour in Sorrento that the Limoncello sold in souvenir type shopped is made with powdered lemon, not the peels steeped in alcohol. Buy from a bar or wine shop! Enjoy a Limoncello Spritz for me!"}, {"username": "Gina DeCrescenzo", "comment_text": "Almost every place will allow you to taste and many places make their own homemade. Have fun trying them all!"}, {"username": "Julia Muller", "comment_text": "We found a ripper while in Puglia, and were super excited to find it in the duty free at Milan airport!! Brought home two bottles. It’s called Pallini 😋 Turns out it’s made in Rome!"}, {"username": "Santo Finocchiaro", "comment_text": "Whichever lemoncello you choose it'll be outstanding. It comes in different flavors, Creamchello, pistachiochello\n, Orangechello, Lemon and orangechello combined. Look for the little grocery stores and you will buy it at half price. They are all over the towns. You just have to know what to look for. Maybe you can ask a loco and I'll tell you where the grocery stores are"}, {"username": "Carine Brys", "comment_text": "I think I was told that the good brands need a label on it. I.G.P. or sth like that."}, {"username": "Carine Brys", "comment_text": "I looked it up! Limoncello is a lemon liqueur that originated in Italy. The Limoncello I.G.P. label stands for Indicazione Geografica Protetta (Protected Geographical Indication) and is used to certify that the lemons used to make the limoncello come from a specific region1. For example, the Limone Costa d’Amalfi I.G.P. label certifies that the lemons used to make the limoncello come from the Amalfi Coast1. The Consortium for the Protection of the Amalfi Coast Lemon I.G.P. is production, and cultural dissemination of the “Sfusato Amalfitano” lemon responsible for enhancing and protecting the quality."}, {"username": "Karen Bowman", "comment_text": "Am interested in this tour as well! Can you share details or name?"}, {"username": "Andria Saia", "comment_text": "Literally every restaurant will make their own - it is ubiquitous 😊"}, {"username": "David Ockman", "comment_text": "I see that our Italian cooking class at NONNA FLORA allows you to make your own meal to eat and then is served with LIMONCELLO—- might be fun for you ???\nThis is is SORRENTO I believe …. So not far"}, {"username": "Terri Woodall", "comment_text": "I'm also doing a lemoncello tour in Almalfi in October!"}, {"username": "Pattyandkevin White", "comment_text": "Can you get limoncello in Tuscany? And/or are there limoncello tours in Tuscany or Cinque Terre?"}, {"username": "Amber Pena", "comment_text": "Capri!"}, {"username": "Barbara Linnville", "comment_text": "Which tour did you book?"}, {"username": "Nikki Buxman", "comment_text": "Most places make their own"}, {"username": "Alicia Cox", "comment_text": "I got mine in Sorrento but you can find it all over & probably cheaper in a market or grocery. Just look for the label that says it’s authentic like a previous person commented on. Some places will let you taste it first. The crème one is really good 😃"}, {"username": "Rhona OConnor", "comment_text": "Wait till you have a Lemenchello Spritz 🍹 😁"}, {"username": "Beth Spiehler Selvia", "comment_text": "We got ours in Positano but you will find it everywhere. We even had some in Switzerland because it was an Italian man that owned the restaurant !"}, {"username": "Joanna Priestley", "comment_text": "You have to go to Minori and stop in the Gamberdelli store, they make the Lemoncello there in front of you, it was our favorite! The bus ride to Minori is about 15 min from Amalfi! And if you go there get the lemon dome cake from Sal Di Riso? We think that is the name! It’s amazing"}, {"username": "Evelyn Trager Jose", "comment_text": "Made (and bought) in Sorrento. Note the 35 % ABV 🍋😍"}, {"username": "Kim LaFontaine", "comment_text": "We tried a sample of limoncello at a small store in an Amalfi market. It was delicious and we bought some bottles. Got home and it tasted like straight Pine Sol. I don’t know if it got hot on the plane in our luggage and changed the taste or it was a total bait and switch. We literally couldn’t drink it. My friend who was with us said hers was the same."}, {"username": "Karen Ries", "comment_text": "Just don’t buy the ones in duty free on the way home. Mass produced and available in the US. I looks for labels I can’t find here."}, {"username": "Stella Saracco Garofalo", "comment_text": "Our tour director took us to a place in Sorrento for a tasting of 5 different lemon cello one stronger than the other and some candy. Everything in the store was made with lemons. We saw a similar store in Capri. Everyone enjoyed the samples."}, {"username": "Lauren Wilstein", "comment_text": "Just curious what limoncello tour you booked? We were looking for one in Amalfi too."}, {"username": "Lynn Barnett Head", "comment_text": "How do you transport it home? Will they ship?"}, {"username": "Tracey Turner", "comment_text": "Hang on!!!!! There's a Limoncello tour?????\n😱😳😁❤️"}, {"username": "Serna Teixeira", "comment_text": "In Amalfi, Distilleria Amalfitana- little shop on the square where they make it there!"}, {"username": "Desiree Miller Kessel", "comment_text": "If you want limoncello try and head to Menton. It is on the French/Italian border not too far from Genoa. If you have time and can get there do so. It is so so charming"}, {"username": "Lisa Bair DeMola", "comment_text": "This was our favorite, they’re located in Sorrento. We had it shipped to our home."}, {"username": "Judy Thomas", "comment_text": "Ravello! North of the town of Amalfi."}, {"username": "Kerrin Barassi", "comment_text": "Buy the tea towel that has the recipe & make it at home when you get back! Very easy & will go down a treat on its own or as a limoncello spritz 🍋🍸🍋🍸"}]}, {"id": "2213050272427384", "text": "Hello all, need some guidance with buses please. Need to get from Lake Garda to Treviso tomorrow. I believe the best route is take train from Lake Garda to Venice and then bus to Treviso. Where do I catch the bus to Treviso /buy tickets from Venice Train? Is there a better way to get to Treviso? Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2213050272427384/", "likes": 1, "comments": [{"username": "Chris N Lynn", "comment_text": "https://\nwww.rome2rio.com\n/map/\nLake-Garda-Hoste\nl-Salò/Treviso"}, {"username": "Paige Higginbotham", "comment_text": "Hi Margaret! You can take the train from Peschiera del Garda to Treviso. Should take about 2 hours."}, {"username": "Carm Parent", "comment_text": "We did Venice Maestre - Treviso is beautiful and one of my fav hidden gems"}]}, {"id": "2213067765758968", "text": "Hello\n\nCurrently in Sicily but returning to Rome. Could anyone tell me “The Pasta Queen” recommendation for the patisserie near the Spanish Steps? Where abouts and the name of it please.\n\nThank you", "link": "facebook.com/groups/1373361046396315/permalink/2213067765758968/", "likes": 5, "comments": [{"username": "Gina Christopher", "comment_text": "."}, {"username": "Joanna Flamini", "comment_text": "Go to her blog and download the rome guide. You can find the link in her IG account"}]}, {"id": "2213070369092041", "text": "I've been in Sicily with family for 2 weeks in the countryside. Heading to Rome and then Florence with my husband. I desperately want to shop for some clothes but not at an outlet mall. What is the best area in Rome and Florence to do this?", "link": "facebook.com/groups/1373361046396315/permalink/2213070369092041/", "likes": 2, "comments": [{"username": "Lisa Ric", "comment_text": "A Roma via del Corso, via Condotti e Piazza di Spagna"}, {"username": "Lorene Vallish Phelps", "comment_text": "Down from Spanish steps in Rome"}, {"username": "Jenny Payne", "comment_text": "Main Street in Rome called via del corso & all the little streets around Florence are great ,all have great boutique shops and also the street In Florence is via del corso 🌻"}, {"username": "Janie Moore Kidd", "comment_text": "Thank you 😊 ❤️"}, {"username": "Patti Seei", "comment_text": "Via del Corso in Rome is beautiful with many stores to find clothes and accessories."}, {"username": "Kejdi Okej", "comment_text": "Down from spanish steps in Rome"}]}, {"id": "2213073369091741", "text": "Hi! Im planning a trip to italy next summer with my husband and our son. It will be our first time trip with a baby (1 year and 3 months) so i would like to know with cities are more suitable for a family vacation. Is amalfi coast ou cinque terre good to walk with a Baby?\nThank you.", "link": "facebook.com/groups/1373361046396315/permalink/2213073369091741/", "likes": 1, "comments": [{"username": "Bea Kuckens", "comment_text": "Cinque Terre is pretty hilly and lots of stairs. Whether stroller or backpack, might be a bit difficult..."}, {"username": "Jenny Payne", "comment_text": "Wt month ?this summer in Italy has been so hot , I would think twice if u have small children 🌻"}, {"username": "Serenna Davies", "comment_text": "Just remember summer is usually very hot. April/May or Sept good times to visit. Less tourists too."}, {"username": "Wendy Wallin", "comment_text": "Having been to Amalfi Coast & the Cinque you would need a back pack for the baby cos too many steps for a stroller. My pick would be Lake Como area where you can stay in Bellagio & visit other towns around Lake Como by boat. All are stunning destinations so when you do a bit more research it will probably fall into place."}, {"username": "Rosa Zordan", "comment_text": "I think your son is too young."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 8, "comments": []}, {"id": "2213084802423931", "text": "We are currently in France travelling to Italy, and booked all our traintickets via the trainline app 3 months in advance. I make this post only to warn everyone. Please do make sure that your trains do still run/ excist 72 - 24 hours before your specific train runs ( on the SNCF connect app), because SNCF discontinued 2 of our trains for specificआणखी times, and we first realised it when we enquired at the service station where we waited for our connecting train. This first train's tickets we lost and had to order 2 very expensive taxi's, but could luckily cancel the other tickets.", "link": "facebook.com/groups/1373361046396315/permalink/2213084802423931/", "likes": 4, "comments": [{"username": "Sunny Lang Fan", "comment_text": "You can’t get refund if they cancel the train ?"}, {"username": "Jenny Godfrey", "comment_text": "Our train was cancelled at the stop in Florence, they had sent an email to say we needed to go to another station as it wouldn’t stop at the main one but sadly husbands phone was on airplane mode so we didn’t get it till it was to late. He spoke to them\nAnd they rebooked us on another train a but later that day that would come to main station. We didn’t have to pay any extra for those tickets and we didn’t lose any money! Always go and speak to the company you booked with as they try and get you on the next train at no cost if it’s their fault."}, {"username": "Fetchin Gretchen", "comment_text": "For future, do not book quite so far in advance!"}, {"username": "Pao Magnoler", "comment_text": "Just a tip. Don't book train tickets so far in advance! Don't worry you will find trains, you can purchase them 48 hours before your trip."}, {"username": "Laura Uribe", "comment_text": "That is exactly why I don’t book until a few days before travel. I have had bus and train planned to have both cancelled."}, {"username": "Diana Hesse", "comment_text": "What is SNCF please?"}, {"username": "Leslie Feuer Orton", "comment_text": "I would think trainline would have notified you"}]}, {"id": "2213096085756136", "text": "I have had several people tell me that we shouldn’t rent a car and drive in Italy because it is chaotic at best. We had planned to rent a car in Florence and in Naples to drive to Colle di Fontanelle near Sorrento.", "link": "facebook.com/groups/1373361046396315/permalink/2213096085756136/", "likes": 2, "comments": [{"username": "Kristina Ruk", "comment_text": "It is the same as in any other big country"}, {"username": "Kejdi Okej", "comment_text": "It is the same as in any other big country"}, {"username": "Emma Whiting", "comment_text": "It's not the same as in any other big country, we don't drive like the Italians do here in the UK lol. Its certainly a different way of driving, personally I'd find it too stressful but it's not impossible."}, {"username": "Catherine Saillant", "comment_text": "Italy has a great highway system but you need to understand the local driving customs. Most highways are two-lane and the left lane is reserved for passing and, apparently, speeding. So expect an inpatient Italian driver to get up in your rear bumper, honking, if you don’t move to the right fast enough to let him pass. Driving in cities can be chaotic with unfamiliar round-a-bouts, poorly marked roads and aggressive drivers. Naples was a nightmare, the worst by far in my extensive travels around Italy. You need nerves of steel to drive there and along the Amalfi coast where drivers keep their mirrors turned inward to avoid scraping them off when passing on the oh-so-narrow streets. After a while you get used to it all and before you know it you will be honking for slower drivers to move to the right!"}, {"username": "John Jessup", "comment_text": "Family of 4.. rented in Avignon.. Drove all through southern France and into Italy and around for 3 weeks., Italian riviera, La Spezia, Lucca, Pisa, Florence and to Rome.. no issues.. ok well cost of rental car was an issue but the driving itself fine"}, {"username": "Maria Oliva Marchal", "comment_text": "Florence is a tight, tight city. I wouldn't want to drive in there. I can only imagine how hard it is to park. Unless you stay outside the city and park it and leave it."}, {"username": "Janet Bell", "comment_text": "It’s not worse then any big city/country. It’s a little learning curve cause you need to learn their laws. Go for it."}, {"username": "Jerry Kiger", "comment_text": "City Vs Open Roads. I plan to rent, hopefully still planning, but cities not advised or city restrict driving (Venice) or pay curb parking. Open roads as stated above have nice freeway system and good way to explore the open areas. Reminders are get car insurance, don’t leave items in car, gas can be expensive, toll roads … but esp if bigger group think rental not bad idea. Depends on the person … good train system but buying tickets, changing trains, maybe need catch bus or taxi to visit same places … so depends on you. Lot of people just drive like military people get stationed there and mainly drive cars but yes more time in country the easier to drive."}, {"username": "Keith Al-Dijaili", "comment_text": "They told me the same and I did it anyway . You learn how their ways are just like you do anywhere else ."}, {"username": "Janet Messanelli Bozzone", "comment_text": "You don’t need a car for Florence unless you want to drive in the countryside and visit the smaller towns and wineries. A car is more of a liability in those cities. If you don’t want to take a train to Sorrento hire a driver. 🤔"}, {"username": "Nicole Craig", "comment_text": "It is chaotic but totally doable. Be aware of ZTL’s or you may end up with $$$ in fines a year after your trip."}]}, {"id": "2213096395756105", "text": "We are planning a trip to Italy in September 2024. This is our 2nd time there but our best friends first time. Let me know your thoughts on the itinerary.\nFly into Venice 2 nights,\n3 nights in Florence (will do day trip to Pisa & Cinque Terre)\n2 nights in Rome\n1 night in Esperia (home town of my husbands family)\n3 nights in Naples (day trip toआणखी Capri)\n3 nights in Sorrento (day trip to Positano)\n3 nights in Ischia (my husband was born there)\nThis is 17 nights not including any travel time. It is a LOT to do. Any suggestions would be appreciated for experiences, things to do and dining.\nThanks!!", "link": "facebook.com/groups/1373361046396315/permalink/2213096395756105/", "likes": 7, "comments": [{"username": "Chiara Normanno", "comment_text": "Idk maybe extend your time in Florence or Rome and cut back on Sorrento? One day is enough to visit it if it's affecting your time in much bigger cities"}, {"username": "Carine Brys", "comment_text": "When in Sorrento or Naples you could also do Pompeii or Heculaneum (smaller but better preserved), a trip to Paestum (impressive Greek temples + museum), shopping in Sorrento, a trip up the Vesuvius. We also had a trip to an olive/lemon farm with authentic lunch onsite."}, {"username": "Donna M. Horn", "comment_text": "Add a day in Florence to do more day trips and explore and turn Naples/\nSorrento into 5 days in Sorrento because you can easily day trip both areas from Sorrento without the unnecessary check in and out process."}, {"username": "Rose Turdo", "comment_text": "Land in the Milan fly out of Rome, rent a car and do the loop. Google maps is your friend.\nMake time for Bolsena Lake and Alberobello, you won't regret it."}, {"username": "Alicia Cox", "comment_text": "I would skip cinque terre & see Tuscany & don’t spend an entire day in Pisa as some of the other towns are better like sienna, Lucca, Volterre, San Giamignano & others as well."}, {"username": "Leslie Goodland", "comment_text": "You'll wish you had more time in Venice."}, {"username": "Lucrezia Folger", "comment_text": "Yes, skip Naples & Capri and add those days to magnificent Rome, 5 nights in Rome, 3 nights in Florence with no day trips, so much to see and be and do in Florence. you have too much traveling for all these places in a short amount of time. Ischia is 100% better than Capri. Venice 2 nights,\n3 nights in Florence\n5 nights in Rome\n1 night in Esperia\n3 nights in Sorrento/ Positano.\n3 nights in Ischia"}, {"username": "Chris Avanzato", "comment_text": "Forget Pisa, and Naples. Stay in Sorrento 6 days, day trips from there."}, {"username": "Gillian Chantrelle", "comment_text": "Don’t forget Pompeii and/or Herculaneum when you are in Naples and Capri when you go to Sorrento."}, {"username": "Margaret Meagher", "comment_text": "Don’t go near Sorrento - very disappointing & not traditional"}, {"username": "Margaret Meagher", "comment_text": "Don’t bother with Sorrento very disappointing"}, {"username": "Suzanne Mills", "comment_text": "Skip Pisa. Cinque Terre deserves at least a week."}, {"username": "Pat Cray", "comment_text": "Skip Naples"}, {"username": "Donna Cafora Shepard", "comment_text": "Looks good. When you’re traveling, leave early and make plans to drop off your luggage so you don’t waste a day. I do travel planning for people and what you described is very doable."}, {"username": "Donna Cafora Shepard", "comment_text": "Join the groups in Sorrento and Naples for what to see, where to go and how to get there. “Naples! Chaotic, Fun and misunderstood! “"}, {"username": "Donna Parrish", "comment_text": "Why 3 nights in Naples and 3 nights in Sorrento? They’re very close in proximity. Maybe one or the other and still do day trips. Capri at night is magical, btw! Add the other nights to Rome and Venice. CT and Pisa day trip is too much in one day. No desire to see Tuscany?"}, {"username": "Jenny Godfrey", "comment_text": "Venice needs more than 2 days. Pisa we did an afternoon at from Florence and it was fine. Your fitting way in to short time and if that doesn’t include travel time you need to think about that and any possible delays."}, {"username": "Kally Trahearn", "comment_text": "So, definitely see Pisa as you will always want to otherwise, however, you only need an hour or so for that and it's a bit underwhelming, however, make it a full day by jumping on the train to Lucca straight after.\n\nSkip Naples in favour of Sorrento. You can do Pompeii, Herculaneum, Capri and Positano/\nAmalfi all from Sorrento and they're easy to each by train, bus or ferry depending on where you're going.\n\nThink about how much time you are taking to pack/unpack each time, so cutting down on a hotel will help with that.\n\nAll sounds very exciting. Relax and have fun"}, {"username": "Paul Anderson", "comment_text": "Sounds less like a vacation and more like work."}, {"username": "Valentina Bachi", "comment_text": "Day trip to Cinque Terre from Florence is challenging, I suggest you skip it. Pisa instead is doable and so Siena and Lucca."}, {"username": "Donna Frendreis Blum", "comment_text": "Skip Naples & Pisa is a photo opp"}]}, {"id": "2213097999089278", "text": "Hello, I am staying in Florence on 24th of August till 27, is it too hot there? Or how you know, will temperature decrease as much to walk in the streets without passing away 😂", "link": "facebook.com/groups/1373361046396315/permalink/2213097999089278/", "likes": 2, "comments": [{"username": "Katie Marie", "comment_text": "No it was fine! Rome was very hot. It rained one day in Florence and was chilly the next. The other days were hot but not unbearable like Rome."}, {"username": "Allan Olexa", "comment_text": "I just looked at the Weather Channel...highe\ns at 100F the next week with lows in the upper 60s. The long range has temperatures predicted lower 90s to upper 80s."}, {"username": "Alessandro Iannelli", "comment_text": "Currently, the weather forecast for those dates in Florence is a highest temperature between 32 and 35 °C. So it will be quite hot during the peak of the day but certainly not so hot that it's unbearable, you will enjoy your time in Florence."}, {"username": "Sylvia Kotsopoulos Vocino", "comment_text": "Just returned and the weather was surprisingly pleasant. Not as hot as predicted."}]}, {"id": "2213126272419784", "text": "Hello all - I am hoping someone here may have some information for me. Our flight is scheduled to depart the US on Sept. 28 and land in Venice on September 29, but I see on the official website (for strikes) that an airport strike has been scheduled for 24 hours on the 29. I am assuming this means the flight will not be able to go forward/land - can anyone confirm that this is what it means? I really appreciate it. This is my first time to Italy.", "link": "facebook.com/groups/1373361046396315/permalink/2213126272419784/", "likes": 8, "comments": [{"username": "Jenny Payne", "comment_text": "Did you read that from the official Italian website?"}, {"username": "Kejdi Okej", "comment_text": "Did you read that from the official italian website ?"}, {"username": "Kari Cooper", "comment_text": "Was it a national strike or only specific to certain regions?\nSometimes they only one or two regions and the others aren't affected.\n\nIf it is national, your flight may get canceled or, just delayed.\nMay be worth it to see if you can either leave a day sooner, or fly in to Switzerland or Austria & train it down."}, {"username": "Carolyn Danielson Sanchez", "comment_text": "Can someone please link the website so I can check on this? Would this also include train strikes? ￼"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Make sure you purchase travel insurance."}, {"username": "Carol Fisher Castagna", "comment_text": "Contact your airline"}, {"username": "Alessandro Iannelli", "comment_text": "It's hard to answer your questions. Disruption to normal traffic is very likely, but to what extent, who knows. With the last strike, some flights were cancelled, around 30% according to some data. It's also possible (not likely though) that a strike is later retired, and in certain cases (also not likely, but has already happened) that the hours of the strike are later reduced. Best to keep in touch with your airline."}, {"username": "Tina Santos", "comment_text": "I’m also traveling the 28/29 to Florence but I’m not seeing anything that far out on the site you posted. Do you have a screen shot?"}, {"username": "Liz Weirath Vogel", "comment_text": "I am planning to arrive into FCO the morning after a 24-hour general national strike. Does anyone know if airport operations typically resume normally quickly after a strike?"}, {"username": "Susan Dolin Rothschild", "comment_text": "We are traveling from US to Italy. Detroit to Rome on a delta, September 4. How do I find out if there are strikes during this period?"}, {"username": "Jenny Frank", "comment_text": "in the past few months strikes were announced and did not happen at all or was kind of a slow down...its too far off to make decisions. Furthermore go into the commissioner's website and put in your exact dates of travel: and you all see for your region what the issue is: so I am departing Venice 9/30 and I can see on 9/29 train strikes and airport HANDLERS striking (not the airlines) but does impact luggage if you are checking luggage on. bookmark the calendar."}, {"username": "Diane Davis Lawyer", "comment_text": "We're missing that by the skin of our teeth! We fly out at noon on the 28th!"}, {"username": "Betty Cours Damisch", "comment_text": "Yikes"}, {"username": "Chris Landry", "comment_text": "Here is a good Italy Strikes 101. If the strike goes forward your flight could be cancelled but for sure be prepared to have carry on.\n\nhttps://\nitalybeyondtheob\nvious.com/\ntravelers-guide-\nstrikes-italy/"}, {"username": "Diane Davis Lawyer", "comment_text": "Ugh, they're also striking nationwide on September 16 between 10:00 AM and 6:00 PM. We arrive in Naples at 11:30 AM. It appears to be the Air Traffic controllers so I'm guess we won't be taking off from CDG when planned, there'll be no one working the towers when we land. Geez."}, {"username": "Bellafab Fabrizio", "comment_text": "The flight will go ahead but getting through the airport will take hours when you arrive in Italy. This happened to us too"}, {"username": "Annette Brin", "comment_text": "I had this on my return to states last month. The strike was ground support nationwide in Italy. Original flight was MXP-ORD-Den . I ended up switching to a Munich-Denver. I took train from Lake Como to Munich day before. I recommend getting travel insurance. The flight I was originally booked on ultimately did take off but was delayed 3 hrs and i would have misconnected in Chicago."}, {"username": "Robin Cole", "comment_text": "I had that happen on a flight from San Francisco to Venice 2 days before I was to embark on a cruise. Didn’t know anything about it until I got to the airport. The flight was to stop in Frankfurt before going to Venice. The airline representative got me on the last seat from Frankfurt to Florence and then I had to train up to Venice at my own expense. Apparently the strike only affected certain airports including Venice and the whole thing was over in a few hours…while I was on the train. 😡"}, {"username": "Tracey Fairbrother", "comment_text": "We have landed in Naples during a baggage handlers strike before and tui staff our package holiday company off loaded luggage themselves we were through within an hour"}, {"username": "Anjali Kacker Mehrotra", "comment_text": "This happened to me in December -the airline automatically changed our flight from that day to the next day —— we had to call the hotel and change our arrival date as well but it was ok"}, {"username": "Laura Uribe", "comment_text": "Some flights will be canceled. It happens all the time. Hopefully you will just have a long wait through immigration."}, {"username": "Cynthia Marie", "comment_text": "I went through london LHR airport during a strike. It only affected certain departments. I had no problems or delays . Take a deep breath, you’re going to Italy! Enjoy"}, {"username": "Rebecca Yeoh", "comment_text": "Looks like it is just baggage, would taking hand luggage help? I'd do that just in case.\nHere is the website for strikes: https://\nwww.commissioneg\naranziasciopero\n.it/\ncalendario-sciop\neri"}, {"username": "Debbie Freedman Katz", "comment_text": "Watching this thread. We go in October. I remember reading certain Friday's had train strike but can't remember where I saw that"}, {"username": "Jill Greenberg", "comment_text": "We are also landing on the 29th, in Rome, first time to Italy, would anyone know if the train strike is all companies or just Trentalia and would that also include the Leonardo Express?"}, {"username": "Jennifer Rose", "comment_text": "Following"}, {"username": "Lynn Bartkowski-Marino", "comment_text": "My friends just had the same thing happen. Baggage handler strike on the day they were arriving. They changed their flight to a day later, and lucky thing they did, because it was canceled"}]}, {"id": "2213128012419610", "text": "We're traveling to Italy in late September and early October. Trains from Florence to Venice to Sorrento to Rome. All the plans are in place except for the trains. I'm not comfortable with my understanding of the train system. Any suggestions to make things go smoothly or things to watch out for?", "link": "facebook.com/groups/1373361046396315/permalink/2213128012419610/", "likes": 4, "comments": [{"username": "Sab Ahm", "comment_text": "We used trenitalia app to book our trains. Pretty straight forward- I personally picked a fare that was modifiable. I was then able to change the date or time easily on the app with no fare. change."}, {"username": "Ibbu Mohd", "comment_text": "Use Italo app to book trains n book seats. Private company, less yo no chance of strikes. Better if you book iterinary from venice to florence to rome to sorrento."}, {"username": "Chiara Normanno", "comment_text": "It's really that easy, you book a ticket from Trenitalia/\n.italo (app or web) by choosing the stations and the date, you keep your pdfs with the tickets info and have them with you once you're boarding. You get to the station at least half an hour earlier the first times to get acquainted with how it works, you show your tickets if requested to enter the platform area, you monitor the departures screens by looking at departure time and train number (not station name as it can be different)."}]}, {"id": "2213132235752521", "text": "I’m looking at a Mediterranean cruise, but it doesn’t include Venice, which is in my opinion a must see, so I’m thinking about staying in Rome a few more days after the cruise and then traveling by train to Venice.\n\nMy question is what recommendations do you have for inexpensive but centrally located places to stay in Rome and Venice?\n\nIn addition, where do you go to schedule tours in advance in Rome?", "link": "facebook.com/groups/1373361046396315/permalink/2213132235752521/", "likes": 5, "comments": [{"username": "Elana Kruger", "comment_text": "We just did that\nFlew into Rome & out of Venice.\nCaught train after cruise - was so easy.\nStayed @ Hotel Nazionale in Rome & Palace Bonvecchiati in Venice - both so central & good."}, {"username": "James-Kathy Dickerson", "comment_text": "Where is your cruise departure port"}, {"username": "Marilyce Arbelo", "comment_text": "We stayed at the Augusta Lucilla Palace and had a great experience! It was 5 minutes walk from the Rome Termini station so it was super easy to get everywhere!"}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "Use Viator to schedule any tours you plan to take. We had wonderful experiences with them."}, {"username": "Fetchin Gretchen", "comment_text": "I use the GetYourGuide app and Airbnb app to book tours and experiences."}, {"username": "Laurel Buchanan Layton", "comment_text": "We stayed at 207 Inn, near the Vatican. We were right by a metro station, so easy to reach other sites. Very affordable, clean, exceptional staff, breakfast brought to our room, elevator, wifi, a/c,... I'd definitely stay there again if I'm lucky enough to ever go back."}, {"username": "Kathi Urie", "comment_text": "Toursbylocals.c\nom"}, {"username": "Santo Finocchiaro", "comment_text": "This is a cruise out of Venice I believe in October"}, {"username": "Alicia Cox", "comment_text": "Just got back from a cruise first of June that was supposed to include Venice, but Venice has decided to enforce their bans on cruise ships. We went to Ravenna instead & there were shuttles by the cruise line to Venice or you could take a train. It would have been a really long day, but you may want to check with the cruise line as that may alter your plans."}, {"username": "Robyn Lawson", "comment_text": "Domus Ciliota in Venice.\nHotel Mozart in Rome.\nEnjoy the beauty no matter where you stay!"}]}, {"id": "2213136819085396", "text": "I am considering to reserve a seat with Daniele, chef/owner of Bolognese Cooking at Drogheria degli elefanti in Bologna.. Has anyone cooked with Daniele? Cheers.", "link": "facebook.com/groups/1373361046396315/permalink/2213136819085396/", "likes": 1, "comments": []}, {"id": "2213138212418590", "text": "We have a dilemma and would love some help deciding where to stay -\n\nCurrently at the end of our 16 day trip, we have 4 days in Positano. We planned on doing 1 day trip to Capri, then hanging out on the beaches and relaxing for the other days. Is it worth staying in Positano? Or should we stay somewhere else?\n\nI was debating shortening my stay inआणखी Positano to 1 day then staying in another town along the coast, as I’ve heard Positano is just so expensive and not worth it. Then of course hear the opposite as well.\n\nWe are torn and can’t decide. I’d like to save money but I’d want to ensure we’re in a town that has beach access. Positano is obviously a dream in pictures but have heard it’s not enjoyable sometimes due to tourists and how small it is. The place we planned on staying at has a pool but am also considering we have to eat 3 meals there each day and am worried it’s going to be so expensive.\n\nSorry for rambling, thanks so much for the help in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2213138212418590/", "likes": 23, "comments": [{"username": "Graham Sherlock", "comment_text": "The beaches in Amalfi Coast are not great"}, {"username": "Venessa Menzagopian", "comment_text": "Positano is very expensive and it's pretty small we based ourselves in Sorrento and went to Positano twice and took a ferry to capri. Personally I preferred sorrento as a base its more affordable. Ravello is also nice to see and you can do a private tour with a shuttle bus easier to get around which can take you to positano, amalfi and ravello"}, {"username": "Cathie Showalter", "comment_text": "I enjoyed Positano. It is small, but the views are worth it. Ravello is a gem on the Amalfi coast—it’s considered the “balcony of Amalfi.” Capri is beautiful as well, but not worth staying. One of my favorite places to visit was Siena—in Tuscany."}, {"username": "Shellie Godden", "comment_text": "I just returned from staying in Amalfi, Positano & Sorrento\nWould definitely recommend staying in Sorrento & doing a boat trip to Positano\nSorrento has so much more to offer, easy to walk around everywhere, so many restaurants & shops. You can jump on the train to Pompeii, day trip to Salerno or many other places"}, {"username": "Pam Kimak", "comment_text": "Check out Maiori on the Tyranian Sea..My family and I loved it there.We were there in June/July for a week. Great town and restaurants. We stayed at Hotel Panorama across from beach and boardwalk."}, {"username": "Luanne Aiello Quarato", "comment_text": "I loved staying in Sorrento, ferries are right there to take you to Capri and Ischia. Loved positano too, not sure where I would stay the next time, but don’t miss Ravello too. Little farther up but beautiful. It’s all beautiful! You will love wherever you stay."}, {"username": "Diane Bryant Abel", "comment_text": "I'd like to live in Positano!"}, {"username": "Donna Cafora Shepard", "comment_text": "I’ve stayed in Positano a few times, Praino, Sorrento AND Naples! They’re all great depending on you, what you’re after, and the location! Positano is pretty big and if you’re not down by the water, you need to take a bus."}, {"username": "Dan Lehew", "comment_text": "Positano was amazing.. we stay for 5 nights. Love hotel pupetto with its own beach and a 10min beautiful walk to city center. Much quieter"}, {"username": "Barbara Bastianini", "comment_text": "I’ve stayed in several different towns on the Amalfi Coast . My absolute favorite is Ravello. . I’d recommend you visit it."}, {"username": "Jono Roland", "comment_text": "Maiori or Sorrento. Maiori is less expensive."}, {"username": "Debi Ann Marie", "comment_text": "Have you considered Ravello?"}, {"username": "Bethany Sargent", "comment_text": "Take the ferry to Ischia and spend a couple of nights in Forio. Lots of beaches and sunsets"}, {"username": "Kelly Delany", "comment_text": "We stayed in prainio and positano much preferred prainio"}, {"username": "Angie Baumgartel Conley", "comment_text": "I loved Positano! I went solo and stayed 5 days and wished it was longer! Also stayed 5 in Sorrento and preferred Positano even though Sorrento was great too"}, {"username": "Jill Mansbury Jansen", "comment_text": "We loved Positano and it was just as beautiful as expected. We were there in April so beaches weren’t crowded. Im sure they will be busy now.\n\nI didn’t find the food to be crazy expensive. A huge breakfast was included at our place so we really just grabbed a snack someplace at lunch and then a nice dinner.\n\nWe did a boat tour along the coast which was relaxing and beautiful. I think a lot of them build in swimming when it’s warm.\n\nYou could do a trip to Ravello and there’s a couple gorgeous hikes also"}, {"username": "Christine Broussard", "comment_text": "Sorrento for sure"}, {"username": "Julie Saritag", "comment_text": "Im amazed people keep talking about beaches. You don’t go to the amalfi coast for beaches. Horrible pebbly things or bathing platforms. Sorrento is a great base. Amalfi is gorgeous. You can get around easily by bus or train. If you need to relax then make sure your hotel has a pool. Capri is very expensive and not as nice as places on the coast."}, {"username": "Sony Ucciferri", "comment_text": "I will be staying in Salerno close to everything affordable and beautiful"}, {"username": "Bill Gillespie", "comment_text": "SERIOUSLY consider Maiori. Not as many people, great beach And get the hydrofoil ferry to go to Amalfi, Positano and Capri, what more could you ask for?"}, {"username": "Elisabeth Zarapi", "comment_text": "Pensez ISCHIA, rustique car restée naturelle"}, {"username": "Nicola Morgans", "comment_text": "stay"}, {"username": "Zanna Darcy", "comment_text": "You only live once. Stay at the pool and beach in Positano and indulge yourself. It sounds fabulous. When you're back in your regular life and having a blah day, you'll have that wonderful memory"}, {"username": "Rebecca Wilcox", "comment_text": "We liked Capri better so stayed there and it's cheaper than Postitano. We had great air BNB's our whole 3 weeks in Italy. We were able to have a small kitchen so we only ate out at night! It was wonderful!"}, {"username": "Inga Thomas Davis", "comment_text": "Just returned from Positano. We had a million dollar view. Very very beautiful. Getting to the beach is almost impossible and there were so many people I don’t know how you would ever relax. We took a day to Capri. Again very crowded but well worth it. The shopping was fun but realize you are walking downhill or uphill. I am very glad I was there but it’s a difficult city to get around in. Just my opinion."}, {"username": "Barbara Hughes", "comment_text": "Postano in 1 day is more than enough...truly beautiful but small"}, {"username": "Emily Penxa", "comment_text": "Stayed in Positano for 4 nights and Capri for 2 and loved both places! I wish I would’ve stayed one more night in Capri and one less in Positano but very glad I did experience staying there! There just isn’t much to do there after dinner it gets very quite. Capri had more going on at night! But would’ve missed so much if I only did a day trip to either places"}, {"username": "Ebony Craigie", "comment_text": "Sorrento was perfect to stay, very central and beautiful. We found a day in Positano was enough and you can take a trip to Capri from Sorrento - also a day there is more than enough.\n\nSorrento also has beautiful beach clubs and yummy food (if you look properly)"}, {"username": "Vanessa Durkin", "comment_text": "Try salerno novotel 4 star across from beach can get boats to all other places for day trips"}, {"username": "Pamela Roderick", "comment_text": "these comments are so appreciated!!! i’m in the process of putting my life long dream together .. my grandfather immigrated from Italy as well as other family so i’ve always wanted to go! i was in Europe twice in the last 2 yrs and was with others so i didn’t go… still kicking myself! but planning now!"}, {"username": "Stephanie Osborn Rushing", "comment_text": "We stayed in positano and I’m glad we did bc when the tourists came we had somewhere to go versus being trapped in positano day trip. We had a three day there and did public beach/hotel pool, boat trip to Capri, and then beach club last day. Was just the right amount"}, {"username": "Bellafab Fabrizio", "comment_text": "Stay in positano….. u wont regret it. It doesnt have to be expensive if u dont want to. U get the most amazing panini for 8 euro each from the deli they make the fresh for you. There is a supermarket/\nfruitshop/deli right down the stairs of the church. Get lunch there! Breakfast there is a little pasticceria with the most amazing crossaints u will ever eat! I need to get the name…… dinner can be pricey if u want a proper sit down a pizza is 19 euro but now more than what we pay at home"}, {"username": "Maxine Fenton", "comment_text": "Minori is beautiful."}, {"username": "Renae Larcus", "comment_text": "Sorrento as a home base offers more options."}, {"username": "Sue Cornish", "comment_text": "Personally I would avoid the almafi coast\nExpensive and over rated\nGo to Santa margarita and Portofino"}, {"username": "Suzanne Carver Musashe", "comment_text": "Great picture ❣️we stayed in Ravello and loved it."}, {"username": "Caterina Liquori-Culhane", "comment_text": "Depends. I've only been there gor day trips. Very small but great views.Depends on your hotel. We git reasonable lunch but dinners are expensive. So is shopping. More shopping and restaurants in Sorrento. Amalfi is nice too. Not as pricey"}, {"username": "Debi Sicurella Krulisky", "comment_text": "Sorrento is a great home base. Not so hilly"}, {"username": "Linda Brecher Bekoff", "comment_text": "Whatever you choose, bring water socks- this was a lifesaver for us!! Ocean full of rocks and pebbles."}, {"username": "Lorraine Marie Zalepa", "comment_text": "Stay it’s beautiful in positano"}, {"username": "Grace Sulsenti", "comment_text": "Sorrento!\nSorrento!"}, {"username": "Sherrie Gillespie", "comment_text": "We are staying at Posa Posa"}, {"username": "Mandy Jonas", "comment_text": "Stay in Sorrento"}, {"username": "Amy So", "comment_text": "If you have 4 days, stay in Sorrento. The food there is considerably cheaper and you can get to Capri, Positano and Amalfi Coast and Ravello by bus and or ferries. We did a day trip to Positano and did not enjoy it becuz everything y was expensive at the beach. There were tons of stairs and crowded."}, {"username": "Roseann Vignieri-Mizrahi", "comment_text": "I enjoyed Māori as my home base when in amalfi. I took the ferry to positano, and any where else I wanted to be. I loved the little town I stayed in and would highly recommend it."}, {"username": "Colleen Campbell Bussey", "comment_text": "Capri in the evening is like no other. Many hikes there as well, which most people never experience in 4 hours!"}, {"username": "Fetchin Gretchen", "comment_text": "Positano is so tiny and so hilly, it is far better to base in Sorrento. Take the bus along the coast to Serrano for great views and otherwise ferry between locations. Sorrento has an elevator so you will not be walking up and down so many hills."}, {"username": "Rebecca Yeoh", "comment_text": "Yes, definitely stay in Positano. It is a completely different experience than just visiting for a day. It is very quiet before the crowds arrive and after they have left, you feel like you get the place to yourself. We had breakfast included, we usually were out and about for lunch and then for dinner we mixed it up with either a restaurant or we went to a deli that sold caprese bread rolls, which I will say, was one of the most delicious things I ate in Italy! We also bought wine from the supermarket and enjoyed from our balcony. There is also the good ferry connections to Capri and Amalfi. Positano all the way!!"}, {"username": "Bill Haenlein", "comment_text": "Try to stay at !east 1 night on Capri a day trip is so many tourist it's hard to see the beauty of Capri,when the mobs you will understand why travelers thru the ages have said\"Capri is the most beautiful place on earth!"}, {"username": "Bill Haenlein", "comment_text": "when the mobs leav"}, {"username": "Skye Birch", "comment_text": "sorrento"}, {"username": "Pam Hughes", "comment_text": "Sorrento is an amazing place to base yourself. Priano is great on the coast ."}, {"username": "Lisa Aho", "comment_text": "Look at Praino. You can see Positano from there and it’s easy to get there but A LOT less expensive."}, {"username": "Sarah Luisa Hughes", "comment_text": "Sorrento 100% as a base. You can do Positano and Amalfi as a day trip, Capri as a day trip, and then spend your other days wandering round Sorrento, and going to the beach."}, {"username": "Melissa Jane Brown", "comment_text": "Have you considered Maiori?? Lovely town and you can catch the ferry to various other places on the Coast."}, {"username": "Margaret Meagher", "comment_text": "Don’t go near Sorrento…too packed & hard to find true Italian restaurants."}, {"username": "Sarah Emerson Nelson", "comment_text": "If you want to relax at a beach, I would not pick a small, busy beach like Positano. Look for somewhere less busy or off the Amalfi Coast if you are also trying to save money, or splurge on a place that is in between villages for more relaxation.\n\nThere isn’t really a beach in Sorrento either, but I preferred it as a base over the Amalfi coast."}, {"username": "Dana Gill", "comment_text": "Gina Kohel this confirms our decision to stay in Sorrento! 🍋"}, {"username": "Bob Deahl", "comment_text": "Positano IS worth it"}, {"username": "Jean Ragozzino", "comment_text": "Stay in Positano. It’s magical. Go to Ravello for the day also. Great cooking class-Mama Agata."}, {"username": "Carine Brys", "comment_text": "We loved Sorrento as a home base."}, {"username": "Jenny Payne", "comment_text": "It is expensive why not stay in Sorrento, can’t help u with braces as I go in October or winter as where I come from in Australia Perth we have great beaches and I live close to a few 🌻"}, {"username": "Chiara Normanno", "comment_text": "Yeah it's not the right time of the year, too crowded. Maybe if you hire a private boat to take you to a smaller secluded beach it could be worth it. If your mind is set on saving money though, you could take base in Salerno and take day trips with ferries along the coast but it could end up being even more stressful this time of the year. See if you can find accomm. in Minori, Maiori, Cetara, Conca dei Marini, Atrani... They have lovely beaches as well. Dont forget a half day visit to Amalfi.\nIf you feel adventurous but seek peace, consider Cilento coast"}, {"username": "Amy French Baillie", "comment_text": "We stayed in sorrento as a base for day trips… loved it"}, {"username": "Amy Lombardi", "comment_text": "I went back and forth on this too and decided to stay in Praiano."}, {"username": "Rose Turdo", "comment_text": "Go to the Puglia"}, {"username": "Christie Lisk Rogers", "comment_text": "We stayed in Priano last week and visited Positano. It’s just crowded but didn’t think it was anymore expensive. The weather this week was limiting on ferry trips and private water taxis but we did take the bus to Amalfi 😳😳which is not for the faint of heart. It’s not a short ride from Sorrento to Positano but certainly not bad"}]}, {"id": "2213157595749985", "text": "Can anyone recommend a small group day tour from Milan to Lake Como and Bellagio? TIA", "link": "facebook.com/groups/1373361046396315/permalink/2213157595749985/", "likes": 1, "comments": [{"username": "Francesca Giovanelli", "comment_text": "You can catch a train to Varenna and then a ferry to Bellagio and other villages, otherwise a train to Como lago and then a ferry"}]}, {"id": "2213182095747535", "text": "The weather is turning rainy in the Dolomites and I'm not sure where to go ... Help pls. I'm camping and not really keen on cities or beaches. I like to go for a easy/moderate hike and just want to see mountains. Or shall I Risk getting soaked? I've recently been to Slovenia when the rain was bad and would like to stay dry ☺️ Any advice appreciated", "link": "facebook.com/groups/1373361046396315/permalink/2213182095747535/", "likes": 1, "comments": [{"username": "Manuela Bassetti", "comment_text": "The weather for the next week in the Appennini between Emilia Romagna and Toscana is great, with mount Cimone, Abetone, Corno alle Scale there’s a lot to see and hike"}, {"username": "Rob Den Haan", "comment_text": "Don't know which Dolomites you are in, but our weather apps all say its great weather for the next 2 weeks. Ok, there is a chance of rain, but that's always the case. My advice: stay."}, {"username": "Etschi Bruckner", "comment_text": "doesn´t look like it´s getting rainy - I´m going there myself soon!"}, {"username": "Paul Anderson", "comment_text": "Cross to the other side of the mountain"}, {"username": "Mitzi Monday", "comment_text": "Don't camp and be upset when it rains. That's part of it"}]}, {"id": "2211084899290588", "text": "Matera , Italy 🇮🇹 Matera is an ancient city. It is the third oldest city in the world, after Aleppo and Jericho, with over 10,000 years of history. The rock cave Matera is became a UNESCO World Heritage Site in 1993. @follower ❤️🇮🇹💖🌎", "link": "facebook.com/groups/1373361046396315/permalink/2211084899290588/", "likes": 3, "comments": []}, {"id": "2212860799112998", "text": "Hi in 4 weeks we will be staying in tuscany. We will stay in the chianti district in between fiorence and sienna at camping-norcenni-girasole. I have been doing my home work and for the last couple of moths i have been doing research on the restaurants in the neigbourhood. I'm a foodie with pasion and have made a nice list but you never know wich places are realy outstanding if anyone knows some of these places or a realy realy good restaurant in this area please let me know. https://www.tripadvisor.nl/Restaurant_Review-g676810-d15513592-Reviews-Osteria_Corte_De_Frati-Figline_e_Incisa_Valdarno_Tuscany.html https://www.tripadvisor.nl/Restaurant_Review-g580240-d1061793-Reviews-Il_ristoro_di_lamole-Greve_in_Chianti_Tuscany.html https://www.tripadvisor.nl/Restaurant_Review-g887275-d4128665-Reviews-Osteria_del_Gusto-San_Giovanni_Valdarno_Province_of_Arezzo_Tuscany.html https://www.dariocecchini.com/accoglienza/?lang=en https://www.tripadvisor.nl/Restaurant_Review-g2533412-d7171699-Reviews-Vivenz_Ristorante-Levane_Province_of_Arezzo_Tuscany.html https://www.tripadvisor.com/Restaurant_Review-g656697-d1513276-Reviews-Ristorante_La_Cantinella-Terranuova_Bracciolini_Province_of_Arezzo_Tuscany.html https://www.tripadvisor.nl/Restaurant_Review-g676810-d26407254-Reviews-Tenuta_il_Palagio-Figline_e_Incisa_Valdarno_Tuscany.html https://www.tripadvisor.nl/Restaurant_Review-g676810-d2442714-Reviews-Convivio_in_Casagrande-Figline_e_Incisa_Valdarno_Tuscany.html https://www.tripadvisor.nl/Restaurant_Review-g656697-d1817367-Reviews-Osteria_Locanda_Il_Canto_del_Maggio-Terranuova_Bracciolini_Province_of_Arezzo_Tus.html https://www.tripadvisor.nl/Restaurant_Review-g616196-d2082648-Reviews-Ristorante_Badia_di_Coltibuono-Gaiole_in_Chianti_Tuscany.html https://www.tripadvisor.nl/Restaurant_Review-g580240-d8456959-Reviews-Vitique-Greve_in_Chianti_Tuscany.html https://www.tripadvisor.nl/Restaurant_Review-g16808551-d19450225-Reviews-Fabri_Home_Restaurant-Ponte_Agli_Stolli_Figline_e_Incisa_Valdarno_Tuscany.html https://www.tripadvisor.nl/Restaurant_Review-g737120-d1007444-Reviews-Osteria_del_Borro-San_Giustino_Valdarno_Province_of_Arezzo_Tuscany.html https://www.tripadvisor.nl/Restaurant_Review-g676810-d3153447-Reviews-Gli_Ostinati_Bar_Osteria-Figline_e_Incisa_Valdarno_Tuscany.html", "link": "facebook.com/groups/1373361046396315/permalink/2212860799112998/", "likes": 4, "comments": [{"username": "Deborah Larsen", "comment_text": "This is guessing that you will have a rental car correct?"}, {"username": "Kejdi Okej", "comment_text": "This is guessing that you will have a rental car correct ?"}]}, {"id": "2213075292424882", "text": "Air France security question, please!\n\nWe are taking AF from ATL -->CDG-->Naples. We have a 1 hour 45 minute layover. We have two smaller carry on bags. We arrive at terminal 2E at CDG but are leaving fromआणखी terminal 2F.\n\nThe way I'm reading the info on AFs site, it indicates we do not have to go through security at CDG, only border patrol.\n\nHas anyone done this lately and was that the case for you, no security check? Thanks!\n\nAlso, a good website to check if you're flying AF and have a layover in Paris: https://wwws.airfrance.us/information/aeroport/conseils-correspondances-paris-cdg-ory", "link": "facebook.com/groups/1373361046396315/permalink/2213075292424882/", "likes": 1, "comments": [{"username": "Charlene Noll", "comment_text": "You will go thru security at CDG like TSA. Just did this last week. There r several posts about this already. Search the group posts for CDG or Paris airport"}, {"username": "Doug Dombrowski", "comment_text": "I just did this Wednesday/\nThursday. Basically just went through security like you would at ATL but faster and didn’t have to take your shoes off"}, {"username": "Melanie Shoemake Eason", "comment_text": "I’m going on the same flight in September.. my understanding was that I wouldn’t do a security check until I got to Naples 🤔"}, {"username": "Leo Nekuda", "comment_text": "We flew to Europe last month(came back 2 days ago). We had to go thru a checkpoint, or whatever it's called. They want to see your passport and make sure it's you. Then they give a stamp and that's it. This is done in the first country you enter in the EU. Took us almost 25 min to get thru it as the lineup was quite long."}, {"username": "Mil Myvegas", "comment_text": "We flew Air France to Florence three weeks ago and from Naples to LAX last week. Both had a layover in CDG and we had to go through passport control and security (TSA equivalent) both times. We also had a tight connection of 1 hour 45 minutes on our flight into Florence. It’s a long walk from terminal 2E to 2F, so be prepared to walk and fast so that you make it through passport control and security and to your connecting flight. Be ready for a bottleneck on the return flight through CDG. If you are traveling with anyone under 18 years of age on the return flight in CDG you will be required to go through the passport control line for families and this line moves slow."}, {"username": "Debbi Mayfield", "comment_text": "Is there a website one can find this info? I’ve seen there is a break until Sept 5, which likely means it may ramp up after that! (It a bit of a truce so as not to create chaos during the end of summer?)"}]}, {"id": "2213083475757397", "text": "Do you recommend that I purchase all of my Euros before I leave for my trip\nIn September or purchase them in Italy ?", "link": "facebook.com/groups/1373361046396315/permalink/2213083475757397/", "likes": 2, "comments": [{"username": "Stuart Flinn", "comment_text": "We know we'll be going to Europe every 2-3 years, so we watch the exchange rates and buy 1000€ whenever the rates are favorable. As it happened, our cruise ship was offering a better exchange than our bank through ATM."}, {"username": "Colleen Dawson", "comment_text": "That’s entirely up to you. As someone who travels internationally\noften, I usually get some currency of the country I am visiting. I carry a credit card usually one that does not charge fees as I use the card for most purchases as well as my atm card.If I need more cash I will use an atm 🏧 attached to a bank, in Italy they are Bancomat, not free standing atms ."}, {"username": "Sue Holden", "comment_text": "Before your trip I always do"}, {"username": "Barbara Krot Barrett", "comment_text": "Yes. We are going in two weeks and we got 400. Will need more after we get there I am sure."}, {"username": "Gillian O'Callaghan", "comment_text": "It's your choice. I got a little cash from an ATM on arrival."}, {"username": "Bea Kuckens", "comment_text": "WE order them from our bank before we go. That way we can hit the ground running and not have to bother with an ATM."}, {"username": "Kejdi Okej", "comment_text": "We order them from our bank before we go . That way we can hit the ground running and not have to bother with an atm."}]}, {"id": "2213096509089427", "text": "Any supermarket with cheap gluten free?", "link": "facebook.com/groups/1373361046396315/permalink/2213096509089427/", "likes": 1, "comments": [{"username": "Renee Brezovsky", "comment_text": "I don’t know about pricing, but Celiachamo Lab in Rome is all gluten free."}, {"username": "Ingrid Zancoli", "comment_text": "Some supermarkets as for example Despar or Coop have their own GF brands, which are cheaper than the usual brands and with same quality."}]}, {"id": "2213117215754023", "text": "I am flying Aer lingus from Chicago to Dublin and then Dublin to Naples soon.\n\nDoes anyone NOT recommend checking a bag?? I just can’t imagine fitting everything I need in a small enough checked bag for the trip.", "link": "facebook.com/groups/1373361046396315/permalink/2213117215754023/", "likes": 3, "comments": [{"username": "Ashley Reneé Harris", "comment_text": "We used Aer Lingus when we flew in (using them again to fly back on Thursday). They didn't lose the two checked bags we brought with us."}, {"username": "Irene Oda", "comment_text": "I've always checked bags."}, {"username": "Patti Porter", "comment_text": "I feel like Dublin airport has pretty good reputation. Personally, I have always checked a bag. I want more with me than fits in carryon, plus I like to buy stuff if I want to."}, {"username": "Kris Beacham", "comment_text": "Check your bags.\n\nGet air tags. They’re great."}, {"username": "Fetchin Gretchen", "comment_text": "go ahead and check a bag. Most of the time, they make me check my wheeled carry on anyway. You might as well have what you want with you. Just if you are making lots of train trips, you cannot carry really big bags as you won't find much space, then may end up standing and guarding your bags the whole train ride if you do not want stolen!"}, {"username": "Michael Imbelli", "comment_text": "Safe travels ✈️ I did ten days with a carry on and backpack. No problem. Rinsed clothes and ready to go the next day."}, {"username": "Rhona OConnor", "comment_text": "We are quiet good at looking after passangers here in Ireland 🇮🇪 😁"}, {"username": "Tara Dix", "comment_text": "Shouldn't be a problem, but pack wisely just in case there is. Put essentials, medications etc in hand luggage as always, but also put some of your clothes in hand luggage too. It also depends on how much moving around you plan to do once there? If lots of changes of location, then less luggage is always easier."}, {"username": "Shari Powers Roberts", "comment_text": "I never check a bag. We always stay in apartments so we have a washing machine however, if you’re in a hotel you can always find a place to do laundry."}, {"username": "Basia Szokarski", "comment_text": "Travel light...you'll be so much happier. We only travel with carry on. We bring extra duffel for shopping and check in in way home"}, {"username": "Brian Shaw", "comment_text": "Myself the Mrs. and granddaughter did 2 weeks across Italy with nothing but carry one, no issues. We flew Air Lingus on the same route other than a DC departure. The ease of a carry on simply can’t be beat. If you’re traveling around Italy you’ll also be very happy to only have a carry on."}, {"username": "Maureen Rebello Hagerty", "comment_text": "Every time I fly through Dublin it is always my worst customs experience….alw\nays"}, {"username": "Heidi McPhillips", "comment_text": "Carry on only\nWhen you return….. you have to go through customs in Dublin then go to connection to get home\nAbsolute nightmare"}, {"username": "Bev Fisher", "comment_text": "We’re going to Italy from the UK via Monaco for 19 days - all 3 of us are checking bags! Personally, I don’t want to think about laundry while I’m on holiday! I want to take my own toiletries and I don’t want to look like my clothes have been squished into a backpack!\nBtw - I’ve recently flown UK to US with Aer Lingus via Dublin for the first time and it was by far the easiest trip I’ve made in all my 50 years of transatlantic flights!"}, {"username": "Kristen Haywood", "comment_text": "I am a habitual bag checker. I don’t like the process of lifting my bag to an overhead bin. I’m on the short side and don’t have a lot of upper body strength. I’ve never had a bag lost by an airline. I trust the airline to do their job and get me and my bag to the desired location."}, {"username": "Stephanie J Stevenson", "comment_text": "I never check if I can avoid it, can’t think of a good reason to do so."}, {"username": "Sally Sharkey", "comment_text": "Check and out an air tag in it."}, {"username": "Courtney Champagne", "comment_text": "Loved Aer Lingus! Check your bag I regretted not doing it and was left with a sore shoulder for days"}, {"username": "Deborah Schroeder", "comment_text": "I think some concerns come from carrying the luggage up and down stairs and on and off trains. If you can manage it without help, then do it. If you find it is too much then size down. I check a bag and have a tote I carry on the plane with all the important stuff, just in case."}, {"username": "Kathy Boyle", "comment_text": "Check your bags and buy air tags. We have been travelling for 40 years and never had a problem."}, {"username": "Leah Rose", "comment_text": "Put an air tag in your bag. I just did this same exact flight. They lost my luggage. Naples is notorious for losing bags. They took me through 4 massive rooms of lost luggage before I even found mine.\n\nLuckily, they were able to scan it the second day I was there, so we took the time to just go pick it up. The other lady I was with looking for her bag hadn’t seen her bag in 3 weeks."}, {"username": "Paula Monforte", "comment_text": "Get an air tag. I’ve never had my luggage lost before only with Aer Lingus. You get the bag back but air tag helps as they aren’t good at providing updates. Also, if there’s plenty of time in between flights hopefully should be okay."}, {"username": "Antonia Dosik", "comment_text": "We travel with carryons and a backpack each. We do this on a regular basis. However, we have access to a washing machine, which makes it easier. There is a rule of 3 when packing: Three bottoms, three tops, three sweaters. That makes 27 outfits. If you go to 4 you have 64 outfits. I use scarves and lightweight jewelry to make things more individual."}, {"username": "Niamh O'Flaherty", "comment_text": "Aer Lingus will take care of you Which airline are you travelling to Naples with?"}, {"username": "Linda Pitler", "comment_text": "Air Tags. The best $29.00 you’ll ever spend. They’re great."}, {"username": "Lorraine Puz Morgan", "comment_text": "My niece wears layers of clothes to eliminate luggage. Love that girl ♥️"}, {"username": "Edmond Nolan", "comment_text": "FYI j fly aer Lingus 10 plus times a year and there service is amazing and never loose bags reccomend you join aer club too"}, {"username": "Dann Hrusch", "comment_text": "We never check bags. You can check in for most flights on-line and not wait at an airport counter, no waiting by the baggage claim after a long flight, nothing to drag around, nothing I have to put in special areas on trains, no extra fees..."}, {"username": "Karen Curci", "comment_text": "Check your bags (except for medication.) The feeling of freedom after doing so is awesome!"}, {"username": "Camille Mccoy Lmt", "comment_text": "Take your checked bag. I go twice a year with no problem."}, {"username": "Carm Parent", "comment_text": "No issues on many different flights with checked luggage ( pack light so you can bring souvenirs )"}, {"username": "Charlie Charnigo", "comment_text": "Hundreds of thousands of people check their luggage every day, less than 1% lose their luggage. You only hear from the folks that lose their luggage, just like you only hear from the folks that got pick pocketed."}, {"username": "Jenny Payne", "comment_text": "How long are you going for? If is less that 2 weeks you can do it . Backpack a good size for you to carry + had a few zips, cross body bag + cabin size case, if your staying in airb&b you can wash your clothes and I only travel with cotton,linen,si\nlk and take those washing sheets for doing your laundry. One pair rubber soles sandals + 2 pairs of sneakers, most comfortable you can find 🌻"}, {"username": "Kejdi Okej", "comment_text": "Hundreds of thousands of people check their luggage every day less than 1 lose their luggage . You only heir luggage , just like your only hear from the folks that got pick pocketed ."}, {"username": "Silvia Lucchinetti", "comment_text": "For peace of mind put an apple tracker in your luggage, at least, even if lost, you will know where it is!"}, {"username": "Santo Finocchiaro", "comment_text": "We put a carry on luggage in a check in luggage. Once in italy the empty check in luggage was filled with gifts, wines, oils, lemoncellos and so on that we bought."}, {"username": "Stacy Derouin", "comment_text": "I haven't lost a bag in over 40 years of flying, and we always check bags. I know there's a risk, but it's worth it to us."}]}, {"id": "2213125702419841", "text": "I’ve been to Milan, Rome and Venice where should I go next?", "link": "facebook.com/groups/1373361046396315/permalink/2213125702419841/", "likes": 172, "comments": [{"username": "Paul Dyke", "comment_text": "Barbados"}, {"username": "Shan Telle", "comment_text": "Verona"}, {"username": "Yelhsa M Nehpets", "comment_text": "My sister would recommend Florence xx"}, {"username": "Ike Simoncini", "comment_text": "Sicily"}, {"username": "Carolina Lamb", "comment_text": "Lake Como, Florence,Tuscan\ny,Capri, Almafi,"}, {"username": "Chris Nichols", "comment_text": "Positano"}, {"username": "Ingrid Rommetveit Vae", "comment_text": "Cinque Terre😍"}, {"username": "Ann Schneid", "comment_text": "Florence/\nTuscany!!"}, {"username": "Caryn Goode", "comment_text": "Florence. Amalfi Coast."}, {"username": "Christiana Xenofontos", "comment_text": "Florence, cinque terre, lake como, lake garda"}, {"username": "Marlies Sciberras", "comment_text": "Dolomites (Bolzano, Merano, Ortisei, Bassano del grappa)"}, {"username": "Maria Pica", "comment_text": "Sorrento"}, {"username": "Igor Petrov", "comment_text": "If you choose between trees three cities - Rome"}, {"username": "Josien Damoiseaux-Strijkers", "comment_text": "Amalficoast , Capri 🥰"}, {"username": "Toni Marie", "comment_text": "Florence"}, {"username": "Kirsten Rea Davis", "comment_text": "Sardinia ❤️"}, {"username": "Roberta Maria", "comment_text": "Florence 💯"}, {"username": "Cindy Sherman", "comment_text": "Lecce!"}, {"username": "S'kay Dannie", "comment_text": "Please take me with u.. and join you to your next venture.🙈😄😊🗣️💋💞🎶🎶🎵"}, {"username": "Juan P Poggio", "comment_text": "Firenze is a must!"}, {"username": "Monica Roman-Fazio", "comment_text": "Florence, Sorrento, capri"}, {"username": "Lupita HC", "comment_text": "Florence, cinque terre 💕"}, {"username": "Benita Long", "comment_text": "Pompeii,Florenc\ne"}, {"username": "Moniek Brands", "comment_text": "Home? 😉"}, {"username": "DrMarylean Wroten", "comment_text": "Florence, Pompeii"}, {"username": "Darrell Hickey", "comment_text": "Florence, and the rest of Tuscany."}, {"username": "Jennifer Garder Cheney", "comment_text": "Florence!!!!!!"}, {"username": "Mohanad Saddik", "comment_text": "Florence"}, {"username": "Stephen Clarke", "comment_text": "Portugal"}, {"username": "Nicole Petrelli", "comment_text": "Cinque Terre, Florence, Amalfi Coast"}, {"username": "Dee Banks", "comment_text": "Florence for sure"}, {"username": "Fabio Clemente", "comment_text": "Any cities in Italy are beautiful. Just pick one"}, {"username": "Sandy Radican Shikaly", "comment_text": "Florence!!!!"}, {"username": "LeLi Giorgadze", "comment_text": "Florence 💫"}, {"username": "Jack Tabibian", "comment_text": "Portofino/ cinque terre area or puglia"}, {"username": "Ken Vecchia", "comment_text": "Ft. Lauderdale"}, {"username": "Frankie Reda", "comment_text": "Positano"}, {"username": "Jamie Lakes", "comment_text": "Florence."}, {"username": "Inger Svensson", "comment_text": "Firenze♥️"}, {"username": "Donna Dougherty", "comment_text": "Interlaken Switzerland"}, {"username": "Rachel Collins", "comment_text": "Lake Como"}, {"username": "Graciela Vargas", "comment_text": "Florence"}, {"username": "Servet S Sökmen", "comment_text": "Amalfi coast, Cinque terra, Portofino, Luca, Siena"}, {"username": "Antoinette Riccobene Finizio", "comment_text": "Amalfi coast, Tuscany or Sicily ❤️❤️"}, {"username": "Ania JL", "comment_text": "Start going to different regions now. I’ve done all the major cities first and then Amalfi, Puglia (twice now), Tuscany, cinque terre, Sicily, lake grada or como. Going to Sardinia and Dolomites next! There is sooo much more to Italy than the big cities! But if you’re looking for a city.. Florence would be my pick too!"}, {"username": "Patrizia Sangiovanni", "comment_text": "Sardegna"}, {"username": "Rita Davoli-Conti", "comment_text": "Florence of course!"}, {"username": "Kim Geary Keidel", "comment_text": "Florence (and surrounding areas)"}, {"username": "Monika Kruszyńska", "comment_text": "Cinqe terre :)"}, {"username": "Robbie Flaherty", "comment_text": "Florence, Pisa and Verona"}, {"username": "Kathrin Wirth", "comment_text": "Florence, Neapel, Capri ❤️"}, {"username": "Bill Elias", "comment_text": "Umbria."}, {"username": "Marianne Tamborella Zimmerman", "comment_text": "Sicily"}, {"username": "Camilla Carlberg", "comment_text": "Toscana ❤️🇮🇹"}]}, {"id": "2213130755752669", "text": "Can someone clarify please, I’m looking at trains to get around during September but the site is stating that a Global pass is for Europeans only?", "link": "facebook.com/groups/1373361046396315/permalink/2213130755752669/", "likes": 1, "comments": [{"username": "Lora de Vries", "comment_text": "I think there are two types of passes. The one you are talking about may only be for European citizens and permanent residents of the EU. Someone on here may have a better idea. Try google to see what comes up."}, {"username": "Ishbel Raffle", "comment_text": "The Eurail pass is for non-Europeans. Do look at costs as it’s not always worth it - trains in Italy are not that expensive especially if booked in advance"}, {"username": "Sam Mah", "comment_text": "Is this a Eurail/\nInterrail pass? Interrail for EU. Eurail for non EU. There is an Eurail and Interrail travellers fb page btw."}, {"username": "Arlene Desmarais Ouellet", "comment_text": "I’m finding it extremely overwhelming. My husband and I are both in our mid 60’s and will be travelling mainly to Italy but would like to visit neighbouring countries. We thought the train would be the best way to go, now we are thinking of renting a car for 3 weeks. I’m worried about highways, the Autobahn, lol, the Alps, and of course the winding coastal roads in Italy. Any suggestions, please.\nThank you."}]}, {"id": "2213135579085520", "text": "Instead of taking the high speed train I'm considering a private transfer from Florence to Rome with stops for a Brunello wine tour and Orvieto. Does anyone know of any companies that I can contact for this? I contacted Cool Tours with Anna and she is not available on the date we are looking for. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2213135579085520/", "likes": 11, "comments": [{"username": "Allison Carlisle Young", "comment_text": "Try who I used from rome to Florence limousinrome.co\nm"}, {"username": "Donna Winter", "comment_text": "Sorry I have no info for you but your daughter is beautiful💕"}, {"username": "Gaye Watkins", "comment_text": "We loved Orvieto"}, {"username": "Carolyn Stys", "comment_text": "Access Italy"}, {"username": "Tracey Purdy", "comment_text": "Look up Mydaytrip"}, {"username": "Dana Birdwell Shofner", "comment_text": "Try romeinlimo.com"}, {"username": "Chris Landry", "comment_text": "Check with Lorenzo All Around Tuscany. He is amazing and a sommelier. I spent a great day with him."}, {"username": "Dayna Scinto", "comment_text": "Joe Banana"}, {"username": "Tara Doyle", "comment_text": "We booked for September with Joe Banana and so far their customer service has been outstanding!! Accommodating little changes and additions with very quick replies! Can’t say enough good so far."}, {"username": "Andrea Johnston", "comment_text": "Rainbow tours is wonderful"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 8, "comments": []}, {"id": "2213136469085431", "text": "What is best way to get from Bari airport to hotel? Are there ride-sharing options available?", "link": "facebook.com/groups/1373361046396315/permalink/2213136469085431/", "likes": 1, "comments": [{"username": "Colleen Dawson", "comment_text": "Rome2rio app will give you all the information you need, cost, time and mode of transportation."}]}, {"id": "2213137825751962", "text": "I thought this great group would find this interesting!\nI was antiquing and got this TWA brochure from 1959. A lot less people coild afford to fly back then and the seating was much more spacious. There is a price list inside. The cost of chicago to Rome back then was the equivalent to $6980 (in today's money)!", "link": "facebook.com/groups/1373361046396315/permalink/2213137825751962/", "likes": 2, "comments": [{"username": "Georgie Davis", "comment_text": "Wow! Travel was probably only for the rich"}]}, {"id": "2213152325750512", "text": "Traveling to Italy at the end of November (Venice 3 days, Naples/Pompeii 3-4 days, Rome 3-4 days). We want truly authentic Italian food while we're there. Questions: 1) At that time of year would reservationsआणखी be necessary? 2) Recommendations on the best (most authentic - not catering to Americans) restaurants in each place. Been doing research but appreciate the input from those of you who live/have visited before. (Image for attention only).", "link": "facebook.com/groups/1373361046396315/permalink/2213152325750512/", "likes": 1, "comments": []}, {"id": "2213152409083837", "text": "Dear Group,\n\nSo I am planning my trip to Como. Since my hotel is in Milan, I am confused if I should make the Itinerary of Lake Como for a day trip on my own, or should book a guided tour with cruise. I am definitely on a budget, but I am little scared to do the tour myself with my friends. Any suggestions would be appreciated, and if I do it myself then what and how I should book the stuff.", "link": "facebook.com/groups/1373361046396315/permalink/2213152409083837/", "likes": 1, "comments": [{"username": "Jenny Payne", "comment_text": "I’m going from Milan by train to Lake Como then I’ll take a ferry to Bellagio and we are staying 3 days but will do and island cruise 🌻"}, {"username": "Ibbu Mohd", "comment_text": "Early morning From milan centrale take TRENORD train directly to Varenna. Explore all lake como, return from como to milan via train.\nTheres your 1 day.\n\nview lake como ferry schedule n Purchase tickets online\n\nhttps://\nwww.navigazionel\naghi.it/en/"}, {"username": "Rita Sharma", "comment_text": "We did tour on day 1 - Lake Como and St. Moritz . 2nd day took a train from Milan to Varenna .ferry from Varenna to Bellagio and back to Varenna . Train from Varenna back to Milan ."}, {"username": "Claire Dowson", "comment_text": "As people have said, if it’s just for the day, train to Varenna (my favourite) which changes in Lecco on the way from Milan. Boat to Bellagio, back to Varenna, Bellano or Lierna for the train via Lecco to Milan. It’s a lovely journey up the edge of the lake."}]}, {"id": "2213155469083531", "text": "hey all. i’m currently in Rome with my best friend but looking to come back again next june with my mam who has osteoporosis. what hotels would you recommend that are within walking distance to everything?", "link": "facebook.com/groups/1373361046396315/permalink/2213155469083531/", "likes": 2, "comments": [{"username": "Bea Kuckens", "comment_text": "Depends on the sites you want to see. Something that is an easy walk to Colosseum, etc. will be a hike to Vatican City. A lot of people recommend the golf cart tours to cover a lot of the city with less walking."}]}, {"id": "2213164809082597", "text": "We have a spare day in Pisa and a car thinking of doing a trip to Lucca is it worth it or any other suggestions for a day trip from Pisa but not cinque Terra to far for the day and hotels are fixed so can’t stopover", "link": "facebook.com/groups/1373361046396315/permalink/2213164809082597/", "likes": 7, "comments": [{"username": "Kim Freda", "comment_text": "San Gimignano"}, {"username": "Laura Uribe", "comment_text": "Love Lucca but arrive early as most places close by 1:00. Last time we did a day trip (2022) we grabbed a bite but missed most places as they had closed for the afternoon."}, {"username": "Seán Ó Confhaola", "comment_text": "Just back from Pisa. It’s a fabulous destination . Been to Lucca a many times as well. It’s only a short 25 minute drive from Pisa to Lucca. I usually use the SS12 route. We’ve stayed in both places and in between as well. I prefer Pisa, great restaurants and quiet in the evenings when the tower watchers go home."}, {"username": "Maureen Ashford", "comment_text": "Lucca is amazing!"}, {"username": "Suzanne Mills", "comment_text": "Big NO to Pisa 😖\nLucca and Siena are worth a trip."}, {"username": "Maureen Rebello Hagerty", "comment_text": "Lucca is DEFINITELY worth a trip"}, {"username": "Krissy DaRusso", "comment_text": "I’m a huge Lucca fan! Also recommend Viareggio."}, {"username": "Andre Le Huray", "comment_text": "Naomi Murphy"}, {"username": "Jennifer Gustafson", "comment_text": "Pisa takes an hour Lucca is wonderful!"}, {"username": "Joy Croake", "comment_text": "Absolutely worth going to Lucca...my favourite town!"}, {"username": "Ali Everson", "comment_text": "Lucca is lovely. Great food outside tourist circle as well. 💞🤩🤗"}, {"username": "Rosa Zordan", "comment_text": "Try San Gimignano"}, {"username": "Graham Sherlock", "comment_text": "Lucca is Italy's best town"}, {"username": "Anna Buchan", "comment_text": "Luca is nice"}, {"username": "Bay Del", "comment_text": "Why not visit Tuscany, Siena and San Gimignano. And maybe get a wine tasting tour?"}, {"username": "Donna Cafora Shepard", "comment_text": "Lucca is beautiful! I’ve stayed there a couple times. At night there’s a horse and buggy ride you can take around the city.\nI’ve gone to Cinque Terre for the day several times. From Pisa it isn’t that far and not difficult. I just read they finally opened the via dell’Amore again! It’s worth it just for that. I take the train to Riomaggiore, and that’s where the walk starts. Then I take the ferry to Vernazza and when you’re done,take the train back to Pisa. It’s very easy!"}, {"username": "Kylie Michelle", "comment_text": "100% Lucca absolutely worth the visit 🫶"}, {"username": "Chiara Normanno", "comment_text": "Pisa - La Spezia is very close. You park your car there and then move around Le Cinque Terre with trains, as it is supposed to be."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Definitely go to Lucca!"}, {"username": "Penny Cato", "comment_text": "Lucca is not far from Pisa… we took a local bus. The bus driver sang all the way…..thankfull\ny he had a great voice🇦🇺🇮🇹🥂🥂💕"}, {"username": "Pat R Bradley", "comment_text": "Go to Lucca"}, {"username": "Debra Quinney", "comment_text": "Well I think the overriding suggestion is Lucca so that’s where we will go thanks for all your help"}, {"username": "Costero Home", "comment_text": "Lucca is well worth it, a beautiful place to visit."}, {"username": "Deborah Torries", "comment_text": "Loved Lucca"}, {"username": "Carol Watson Pivor", "comment_text": "Love Lucca❤️❤️❤️"}, {"username": "Tammy Wells Mock", "comment_text": "I was underwhelmed with Lucca.\n\nWe spent the day there traveling from Sienna to Cinque Terre. I wish I had spent more time in Tuscany instead.\n\nMaybe my expectations were too high?"}, {"username": "Isabel Salcedo Patterson", "comment_text": "I loved Lucca!!! Worth it."}, {"username": "Colleen Jennings", "comment_text": "Definitely go to Lucca! It’s a charming old town and very compact. Easy to park just inside the city walls. Small windy streets with stunningly beautiful churches & old buildings. Hire a bike & cycle round on the city walls (4k long) & you’ll get a great view from 20 feet up! Lots of shade from the trees if it’s hot. Stop at a deli & pick up a picnic selection to have on the many grass areas or stop for lunch in the only caffe up on the wall. Or have lunch in one of the trattoria’s in Puazza Dell’Anfiteatro\n. Visit Puccini’s house. I go to Lucca every year - just love it! Happy travels."}, {"username": "Elena Eckley", "comment_text": "I would drive to Montecatini"}, {"username": "Kathy Ann Jones", "comment_text": "Lucca is lovely! Puccini was from there. There are daily concerts at 7 pm in the church of San Giovanni. Enjoy your trip!"}, {"username": "Dianne Metcalf", "comment_text": "We loved Lucca"}, {"username": "Kejdi Okej", "comment_text": "We loved lucca"}, {"username": "Di Billups Mbe", "comment_text": "Lucca is magical a must do"}, {"username": "Jenny Payne", "comment_text": "Love Lucca 🌻"}, {"username": "Jill Wolder", "comment_text": "Sienna"}, {"username": "Anita Clayton", "comment_text": "Lucca is lovely."}, {"username": "Rhonda Russell", "comment_text": "Lucca is amazing"}, {"username": "Elaine Wilson", "comment_text": "Lucca well worth a visit"}, {"username": "Diana Odoroaba", "comment_text": "Siena"}, {"username": "Rose Turdo", "comment_text": "Rimini or Bolsena Lake\nThe drive is wonderful."}, {"username": "Rose Turdo", "comment_text": "Viareggio"}, {"username": "Lyndsey Ryan", "comment_text": "Lucca definitely ❤️"}, {"username": "Patti Bauman Widener", "comment_text": "Love Lucca! Go!"}, {"username": "Nicky Massey", "comment_text": "Lucca is brilliant! I prefer it to Pisa"}, {"username": "Christie Lisk Rogers", "comment_text": "Lucca will be one of my favorite cities forever. It was filled with kind people and lots of history"}, {"username": "Chloe Gallagher", "comment_text": "Lucca is lovely"}, {"username": "Renae Larcus", "comment_text": "Yes Lucca is wonderful. Rent bikes and ride around on top of the wall!"}, {"username": "Chiara Codecá", "comment_text": "Lucca is a gem, absolutely worth a visit."}, {"username": "John Jessup", "comment_text": ".. Lucca hands down.. great for a day trip or more"}, {"username": "Robin Burrell", "comment_text": "La Spezia, Camogli, Chiavari, Santa Margarita, Bogliasco, Genoa, Nervi."}, {"username": "Fiona MacCann", "comment_text": "Lucca is beautiful have just been there and highly recommended it. Although we did take a wrong turn and ended up on the motorway toll road. Not sure how we pay the ticket, if it’s need or what to do with the ticket any advice would be appreciated!"}]}, {"id": "2213165722415839", "text": "Our last 5 nights in Italy were in Matera and Maratea similar in name but vastly different.\n\n... Matera had 3 nights in one of the oldest continuously inhabited sites in the world.\n...Stayed in a cave hotel so cool with an amazing view of the Sassi area. Palazzo degli Abati excellent staff and beautuful bar /restaurant with great views. Highly recommend\n....Did day trip to Alberobello so gorgeous but swamped with people was good for day trip although maybe if you stayed overnight might get a different experience\n...Best $100 euro we spent was on a private guide through Matera he was fantastic and spent 3 hours walking us through the sites of interest ..unfortunately he didn't have a business card so cannot give you details. We booked through our hotel and his name was Giuseppe which will be of no help 🤣 but there seemed to be a number of guides doing same thing .\n...The Sassi area was full of great restaurants but not far from there was heaps of restaurants and bars full of locals with a great vibe\n\nFor our last two nights in Italy my partner said let's find somewhere all the Italians holiday at and somehow found Maratea. What a find .We drove through several hours of mountains and spectacular views to arrive at this little coastal town and the only international tourists were us. The views rivalled the Almalfi cost at a fifth of the price We stayed at the Hotel Martino which we loved . It had its own private beach with a bus to get you there .\n\nWhat a wonderful 3 weeks we have had in Italy ..the only thing I would change is no 2 night stays .Just not long enough as you only get 1 full day and unfortunately 2 of our favourite places were 2 night stays and just not enough. Already thinking of our next Italy trip and it will be less places ...more time... so Arrivederci until next time ..now on to next leg of trip Greece 😄", "link": "facebook.com/groups/1373361046396315/permalink/2213165722415839/", "likes": 282, "comments": [{"username": "Katie Turnbull", "comment_text": "Gorgeous"}, {"username": "Nikki Bramma", "comment_text": "Spectacular!"}, {"username": "Anna Kabebe", "comment_text": "Anna Kabebe"}, {"username": "Fiona Douglas", "comment_text": "Thank you for sharing 😘"}, {"username": "Gillian Docherty", "comment_text": "Looks gorgeous"}, {"username": "Rita Sanza", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Joy Mcburney", "comment_text": "Such an interesting area of Italy. Thanks for this!"}, {"username": "Renee Marie", "comment_text": "Wowwww"}, {"username": "Kathy Fryer", "comment_text": "Fabulous photos! Thanks for sharing these"}, {"username": "Alicia Cox", "comment_text": "Looks awesome!"}, {"username": "Elisabetta Komenda", "comment_text": "Wonderful photos. Thank you for sharing!"}, {"username": "Carm Michalenko", "comment_text": "I’ve heard many wonderful things about both of those areas. Thanks for sharing your experience. It’s on the list. 🇮🇹"}, {"username": "Karen Costa", "comment_text": "Have visited these both amazing towns. Maratea because of statue of Christ The Redeemer. The drive up to stature not for faint hearted 😱"}, {"username": "Maria Giordano", "comment_text": "Gorgeous! Mind sharing the name of your hotel in Matera?"}, {"username": "Denise Incandela Boccio", "comment_text": "Absolutely beautiful! I loved the cave you stayed in. Thanks for sharing!"}, {"username": "Tam Wong", "comment_text": "Beautiful, where are you going in 🇬🇷 Greece ? I love 🇬🇷"}, {"username": "Ann Casale Grosso", "comment_text": "Absolutely gorgeous!! So you compare it to the Amalfi coast? As beautiful?"}, {"username": "Dan Williams", "comment_text": "So cool. Just booked. Thanks for the tip"}, {"username": "Leslie Feuer Orton", "comment_text": "Beautiful! Sounds like a great trip."}, {"username": "Roberta Andrechick Niedt", "comment_text": "Great pictures and tips! Thanks for sharing."}, {"username": "Kelly Peagler Myers", "comment_text": "Shawnna Chance"}, {"username": "Mary Andreotta", "comment_text": "Love hearing about different places like this!!!"}, {"username": "Judith Tobin", "comment_text": "Thanks for some great tips. I have 10 days in Puglia next month including 2 nights in Matera."}, {"username": "Leanne Dixon", "comment_text": "Thank you for sharing. Getting pointers for my future planned trip. Great pictures."}, {"username": "Rose Carlos", "comment_text": "MESSAGGIO PER QUALSIASI TIPO DI SERVIZIO RECUPERA IL TUO ACCOUNT DALLA\n❌NESSUNA TRUFFA\n📱TRUFFA\nTRUCCO SU FACEBOOK\n📱TRUCCO SU WHATSAPP\n📱HACK DI INSTAGRAM\n📱HACK DI TELEGRAMMA\n📱RECUPERO DELLA PASSWORD\n📱RECUPERO PASSWORD GMAIL\n📱TIKTOK TRUCCO\n📱HACK DEL TWEETER\n📱RECUPERO DEL SITO WEB\n📱RECUPERO DEI GIOCHI\n📱RECUPERO DI VALUTA CRYPTO\n📱RECUPERO HACK ROBLOX...."}, {"username": "Lisa Wylin", "comment_text": "Thank you for all your info and sharing. Beautiful, interesting photos! I’ve been to Matera and Alberobello, too. We stayed in a Hilton Garden Inn in a huge green field just outside of the city, pretty and surreal💚"}, {"username": "Eve Ottavino", "comment_text": "Stayed that in room in May!"}, {"username": "Victoria Russo", "comment_text": "Looks like an amazing visit"}, {"username": "Sara Smile", "comment_text": "Thank you for sharing! The hotel is amazing and that view!!! Stunning!"}, {"username": "Margie West", "comment_text": "Thank you for sharing ❤️Do you recommend your tour guide? How do I get in touch with him?"}, {"username": "Theresa Caruthers Ansbaugh", "comment_text": "What’s the name of the hotel? It looks beautiful"}, {"username": "Sally Staltare", "comment_text": "Absolutely gorgeous!!!❤️❤️"}, {"username": "James-Kathy Dickerson", "comment_text": "Beautiful"}, {"username": "Anna Auriemma", "comment_text": "Stunning!"}, {"username": "Cindy Breneman Hattrich", "comment_text": "So cool!"}, {"username": "Sheila La", "comment_text": "Sold.\nIt’s now on bucket list."}, {"username": "Elaine Wilson", "comment_text": "Looks amazing"}, {"username": "Kejdi Okej", "comment_text": "Absolitely gorgeous ♥️♥️"}]}, {"id": "2213180432414368", "text": "Best places to stay in Tuscany ? Xxx", "link": "facebook.com/groups/1373361046396315/permalink/2213180432414368/", "likes": 4, "comments": [{"username": "Prena Patel", "comment_text": "Following"}, {"username": "Leslie Gould Hutto", "comment_text": "Following"}, {"username": "Wendy Isabel", "comment_text": "X2"}, {"username": "Michael Broadwater", "comment_text": "It depends.... Tuscany is a very large region, what cities do you wanna see? There are villas, agriturismos, airbnbs, hotels, etc."}, {"username": "Paola Barbetti", "comment_text": "It really depends on your preferences and on what you expect from a vacation. Tuscany offers a lot of history, art, architecture, and also great food and wine, splendid countryside landscapes, but also beaches, and you can hike and bike, and also enjoy hot springs (not so fun in Summer though). You can have an incredible array of options…but perhaps your question is wrong…you should ask yourself: how “my best place”should be? ☺️🤩"}, {"username": "Diana Belorusets", "comment_text": "Castello di Gargonza"}, {"username": "Kejdi Okej", "comment_text": "Castello di gargonza"}, {"username": "Juliette Sastrowitomo", "comment_text": "I Recomend La Forra in Montegonzi Chianti"}, {"username": "Renae Larcus", "comment_text": "La Lucciolaia Agriturismo - San Gimignano was so great!"}, {"username": "Sharon Mc", "comment_text": "Following"}]}, {"id": "2213160739083004", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213160739083004/", "likes": 5, "comments": []}, {"id": "2177245709341174", "text": "RENT A CAR IN ITALY - TOP TRAVEL TIPS :\nMost visitors to Italy pick up their rental cars right at the airport. Rome Fiumicino, Milan Malpensa, and Venice Marco Polo are not only the country's busiest airports but also its main car rental hubs. Picking up and dropping off a rental car right at the airport is usually the cheapest option\nChoosing the right rental car supplier is really important. Interrent, Enterprise, and National are the three highest-rated car rental companies in Italy.\nRenting a vehicle for a longer period usually brings the daily price down significantly. A five-day trip might be only slightly more expensive than a three-day trip because of this. If you can, consider exploring Italy for at least a week!\nFamiliarize yourself with the rental conditions such as the mileage and fuel policies before booking a car!\nLearn about the traffic rules and speed limits before your trip — they might be different than in your country!\nIf you plan to drive in the Alps in winter, you might need snow chains — ask your rental car supplier about them.\nBook here for the best price: https://www.discovercars.com/?a_aid=NextStop-Italy", "link": "facebook.com/groups/1373361046396315/permalink/2177245709341174/", "likes": 16, "comments": [{"username": "Agneta Danielsson", "comment_text": "Fiat 500🇮🇹"}]}, {"id": "2213152119083866", "text": "Perched on top of a beautiful hill in scenic Val d’Orcia, Pienza will enchant you with its charming stone architecture, romantic alleys, world-famous pecorino cheese and picture-perfect landscapes.\n\nJoin our NEWआणखी virtual experience: https://nextstop-italy.com/virtual-tours/pienza/\n\n#italytravel #artlovers #hiddengems #italygram #vacationmood #virtualworld #history #italytrip #medievalarchitecture #medievalart #medievalhistory #medievalcastle #italytrip #hiddengems #artlovers #tuscany #tuscanygram #tuscanyitaly #tuscanytravel #tuscanypeople #tuscanyexperience #pienza #pienzaitaly #pienzatuscany #renaissance #renaissanceart #orciavalley #valdorcia", "link": "facebook.com/groups/1373361046396315/permalink/2213152119083866/", "likes": 25, "comments": []}, {"id": "2209365256129219", "text": "The Godfather of the Amalfi Coast\nAvoid driving on unknown roads or taking slow public transportation on this full-day tour of the Amalfi Coast. Visit Positano, Amalfi, and Ravello in one day of sightseeing.… आणखी Highlights include guided commentary while driving along the famous coastline, stopping for pictures, free time for lunch (own expense) and plenty of time to see the main attractions in each coastal village. Read more about The Godfather of the Amalfi Coast - https://www.viator.com/tours/Positano/The-Godfather-of-the-Amalfi-Coast/d33602-224058P1?pid=P00070587&mcid=42383&medium=link&medium_version=selector", "link": "facebook.com/groups/1373361046396315/permalink/2209365256129219/", "likes": 20, "comments": []}, {"id": "2213047145761030", "text": "Best colosseum and Ancient Rome tour ? Would like to see the arena floor as well? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2213047145761030/", "likes": 1, "comments": [{"username": "Brandy Robertson Phillips", "comment_text": "Viator has great tours"}, {"username": "Jenn Messina Babore", "comment_text": "Direct on Coopculture.it"}, {"username": "Mandy Pusateri", "comment_text": "I am wondering the same thing. Why do some people say it's better to buy tickets from Coopculture.it rather than Viator? I know Coopculture is the official Colosseum website, but other than that, I don't understand the difference of why one is better than the other."}, {"username": "Trevor Ian Wright", "comment_text": "Viator do a great tour"}, {"username": "Paul Anderson", "comment_text": "There is no floor left. The floor that is there was built for a movie in the 1900s. The original floor has been gone for centuries."}]}, {"id": "2213048205760924", "text": "My family and I will be spending Christmas in Italy. Are there any places we should visit? We will be there for two weeks.", "link": "facebook.com/groups/1373361046396315/permalink/2213048205760924/", "likes": 15, "comments": [{"username": "Kevin Andrews", "comment_text": "Christmas Mass at the Vatican?"}, {"username": "Diana Smith", "comment_text": "Rome, Naples, Milan,Florence and everything in between. Make random stops … you will not be disappointed…:)"}, {"username": "Chiara Normanno", "comment_text": "If you like snow you could consider skiing in the North mountains"}, {"username": "Melissa J. Webster Groenewegen", "comment_text": "The Vatican to hear the Pope’s message"}, {"username": "Marscha Fransisca Debora Basdew", "comment_text": "Vatican"}, {"username": "Ricky Ellis", "comment_text": "Go to Naples and the street where they make all types of nativity sets. Pretty incredible!"}, {"username": "Max Perletta", "comment_text": "Sure you will not find places to visit in Italy. Better you go in Swiss. There you will find a lot."}, {"username": "Chloe Gallagher", "comment_text": "Salerno was amazing over Xmas & midnight mass in Rome"}, {"username": "John Adams", "comment_text": "Piazza Nuvona, Rome! You want be disappointed"}, {"username": "Kejdi Okej", "comment_text": "Go to naples and street where they make all types of nativity sets . Pretty incredible l"}, {"username": "Paula Debattista", "comment_text": "Milan christmas market"}, {"username": "Veronica Mendez", "comment_text": "Il presepio al Vaticano and Assisi. In Bari there is the St. Nicholas (Santa Claus) Catedral and you can find beautiful and original Christmas decorations. Christmas markets and decorations of streets around Italy. The churches have Christmas concerts and If you spend Christmas and New Year, Capodanno in Campo di fiori is a lot of fun. On January 5 there are many street markets selling Befanas."}, {"username": "Vivien Paulik", "comment_text": "- Alto-Adige area (montains)\n- Venice (sightseeing and markets)\n- Gubbio (very lovely)\n\n(I do not say Rome and Vatican because Christmas time and religion"}, {"username": "Lorraine Swick Sanfilippo", "comment_text": "Are restaurants etc open on Christmas?"}, {"username": "Enrico Lecce", "comment_text": "Visit Salerno they make such an amazing Christmas decorations quite festive and fun..."}, {"username": "Pietro Di Sorbo", "comment_text": "How you can see from the before posts in Italy Christmas is a very heartfelt celebration so you can find something of special quiet everywhere.\nAnyway if you already know Italy and its cities arts (Rome, Florence, Venice, Siena, Verona and so on) you could spend your time somewhere in the Dolomities, there are a lots of villages and the atmosphere is fun and magic, especially if you are able to skiing.\nIf you are not to far from Naples you can visit the San Gregorio Armeno street in Naples, particular for the exhibition of handcrafted nativity scenes.\nFor a crazy, but not for everyone experience, the last day of year in Naples could be, in bad or fun way, something of unforgettable.\nIf you have never been in Italy Christmas time is maybe the best time to visit cities art."}, {"username": "Alejandro Gabriel Valenzuela Anghileri", "comment_text": "I would like to go to Trentino (eg. Bolzano, Trento, Bressanone) to see Christmas Markets. They are more like Mittel European than Italian but they're awesome\n\nhttps://\nwww.mercatini-di\n-natale.bz.it/\nalto-adige/\nbressanone/"}]}, {"id": "2212510945814650", "text": "We got to Florence two days ago and have been enjoying every minute.\n\nAnnual vacation time. Many parts of Italy will be taking vacation from August 15th until the end of the month. Smaller stores and restaurants will be closed but many will be open.\n\nFirst off is accommodation. We are at Hotel Hilda which is just a few short blocks from the Duomo. We walked from the train station to the hotel in about 15 minutes with one large suitcase and a smaller one. Just watch for bikes, motorcycles, vespas and cars. The hotel is amazing with a large suite including a kitchen, nice sized bathroom, sitting area and large open bedroom. Very friendly management. Grocery stores close by for some juice, wine, breakfast options etc.\n\nSecond is restaurants. You really can have your pick of dozens of restaurants. We enjoyed the restaurant just outside our hotel that the manager recommended for both breakfast and dinner. We also dined at Trattoria ZaZa and Trattoria Dall’Oste.\n\nThird is timing for meals. No problem in finding a regular breakfast of eggs or omelettes. We did tend to eat around 10 am and hold out until dinner. If you are used to eating dinner around 6 or 7 pm you will have no problem. It is much busier by 8 or 9 and you will have to wait if no reservation. We did not make reservations anywhere due to this plan.\n\nFourth. You will pay for regular ‘still’ water so you may want to let that go and either drink before you head out or bring your own. It costs anywhere from 2 to 4 euros which we found too much. Beer and wine is quite reasonable though.\n\nCooking class. There are many to choose from but we chose Small Group Pasta Class from scratch with seasonal ingredients in Florence Italy. This is a small group of only 8 people but you can get up to 12. Chef Vary was so much fun and had a wonderful way of teaching and interacting with the group. Highly recommend.\n\nDuomo. We could not get into this attraction. You should book well in advance or try lining up for hours in the hot sun. We decided to forgo this and visited other museums and historical buildings in the area. If you want a good hill to climb, check out Piazza Michaelangelo for a breathtaking view of the city. Many go there for the sunset as well.\n\nWatch out for the distractions that will lead to pick pockets. It can be someone flipping a coin and letting it drop so you pick it up or a fast chance game while someone else is patting you down. Just always be aware and don’t get caught up.\n\nOtherwise we felt very safe. Husband carried wallet in front pocket and I used my purse as a cross body bag and always had zippers to the inside and one hand holding the strap. Try to use a bag with a thick strap as they are harder to cut through or grab.\n\nSafe travels and hope this helps.", "link": "facebook.com/groups/1373361046396315/permalink/2212510945814650/", "likes": 17, "comments": [{"username": "Elena Innocenti", "comment_text": "In Italy it would be forbidden to consume food or drink brought from you in a restaurant or bar. Also water because, by the law, restaurants are responsible for all you can eat and drink while you are there.\n\nSometime let go on with tourist, but it is advisable to not encourage do this."}, {"username": "Sunny Lang Fan", "comment_text": "Can I have the info for the cooking class ? Where and name ? How far in advance do you need to book the cooking class ?"}]}, {"id": "2213058182426593", "text": "Walking down the alley and run up on this !!! Nothing short of magical ! #godfather #italy", "link": "facebook.com/groups/1373361046396315/permalink/2213058182426593/", "likes": 1, "comments": [{"username": "Angela Whitton", "comment_text": "Kevin Dunne - your double.👍 xxx"}]}, {"id": "2213062122426199", "text": "Genova, Liguria. Italy......", "link": "facebook.com/groups/1373361046396315/permalink/2213062122426199/", "likes": 30, "comments": [{"username": "Shirley Preissler", "comment_text": "Wonderful picture!"}]}, {"id": "2213064262425985", "text": "Is there a daily Mass at the Vatican?\nI assume you can purchase a Rosary there…can they be blessed?", "link": "facebook.com/groups/1373361046396315/permalink/2213064262425985/", "likes": 17, "comments": [{"username": "Diana Ferro-Rodrigues", "comment_text": "Usually On weekdays, mass is held at 8:30 AM, 9 AM, 10 AM, 11 AM, 12 PM and 5 PM. On Sunday and Holy Days, mass is held at 9 AM, 10:30 AM, 11:15 AM, 12:15 AM, 1 PM, 4 PM, 4:45 PM and 5:30 PM. You can purchase rosaries at the stores in Vatican City"}, {"username": "Rocchina Rachel", "comment_text": "They don’t sell on Sundays. Pope spoke “blessed the crowd” today from his window."}, {"username": "Melissa Revette Miller", "comment_text": "I bought a rosary and some other religious items there and left them to be blessed. They had them sent over to my hotel later that day for me to pick up from the front desk."}, {"username": "Lauren Hamilton", "comment_text": "Do they have Saturday afternoon masses? If not at Dr Peter’s, how about near Vatican museum?"}, {"username": "Irene Oda", "comment_text": "There us a Vatican store- even at the airport in Rome."}, {"username": "Julie Gayde Benden", "comment_text": "Yes, at the Vatican store (which is just outside the square) you can have any religious item blessed. You will fill out a page with your name and hotel and it’ll get delivered to your hotel that evening. I just did that last week."}, {"username": "Evie Gee", "comment_text": "They sell pre-blessed rosaries."}, {"username": "Rachel Collins", "comment_text": "Rosaries are pre blessed"}, {"username": "Carolyn Esposito", "comment_text": "I bought beautiful rosary beads as we were leaving the museum."}, {"username": "Jennifer Satter", "comment_text": "Jessica Baumgartner"}, {"username": "Chrystal Stevens Bisonet", "comment_text": "The pope blesses items at his Wednesday audiences. It’s a general blessing. You can also ask priests to bless your items. Blessed items cannot be sold."}, {"username": "Liem Nguyen", "comment_text": "When we were there in May, we purchased rosaries from stores outside the Vatican as well as the Basilica’s store. We took them to the confessionals and respectfully asked one of the priests to bless them. It was a moving experience, as the priest touched each one and asked us to share each of the persons’ names getting the rosaries. We also brought in small glass vials purchased both outside and inside the Basilica, asked one of the deacons to fill the vials from the spring inside the Basilica, and they were also blessed by one of the priests while we were there."}, {"username": "Joyce Parisi Hall", "comment_text": "I did buy a rosary there,and while walking the grounds I saw a priest and asked him to bless them.He couldn't have been happier to oblige.There a priests all over and I'm sure any one of them would be happy to do so."}, {"username": "Marie Cuzzi", "comment_text": "You can buy rosaries however they need to be left behind to be blessed"}, {"username": "Catalina Daniel", "comment_text": "yes, for mass & from what I understand the pope makes his appearance on Wednesday’s. Also gift shop is loaded w souvenirs. Holy water vials, rosaries, shoals … 📿 all that"}, {"username": "Sigrid Cormier", "comment_text": "5 hrs ago at one of the Vatican gift shops, I purchased a vial of blessed holy water along with a couple of blessed rosaries. The items were labeled as blessed by the Pope so it must be true. These were for friends who were quite ill. They were deeply appreciative."}, {"username": "Patti Bauman Widener", "comment_text": "You can purchase rosaries in the Vatican museum bookstore. Take it to mass at St. Peter’s or any mass to be blessed."}, {"username": "Stacy Prestigiacomo", "comment_text": "Beautiful , inexpensive ones at the register in Vatican store"}, {"username": "Leslie Goodland", "comment_text": "Not a rosary story, but still good.\nI was recently in Italy. Found God at the Duomo in Milan. There were a couple of gift shops at The Vatican and I ended buying a beautiful small purple cross necklace. I put it on once outside, it hasn't come off since."}, {"username": "Mavi Mercader", "comment_text": "Ff"}, {"username": "Debbie Milne Jenkins", "comment_text": "My daughter-in-law\npurchased rosaries for her family and she made the purchase and the store in Vatican City delivered the rosaries to the front desk at the hotel after they had been blessed."}, {"username": "Jacinta McGarry", "comment_text": "When we were in the chapel there was a priest off to one side giving blessings personally. Just lined up and made your request."}, {"username": "Rosa Zordan", "comment_text": "Yes and yes"}, {"username": "Mel Anne", "comment_text": "We went to Benediction there then Mass at Saint-Sulpice in Paris"}, {"username": "Kate Farrell", "comment_text": "Yes , and you an get masses said, you receive a lovely mass card, and the donation is up to you…"}]}, {"id": "2213038265761918", "text": "We want to go to Rome and then to Amalfi/Capri in late April/early May. Is it too cold still for Amalfi at this time and do we fly back out of Naples?", "link": "facebook.com/groups/1373361046396315/permalink/2213038265761918/", "likes": 2, "comments": [{"username": "Gayle Moores", "comment_text": "On my last trip to Italy we travelled to the Amalfi Coast in early May and the weather was quite warm but not hot like Summertime.We were in Capri and was even warmer but got cooler on the ferry when we left in the afternoon.We did have one day when it rained and was cooler but cleared up in the afternoon.I recommend you take a travel umbrella and a lightweight jacket in case it rains.\nThe closest airport to the Amalfi Coast is in Naples."}, {"username": "Dina Garrett", "comment_text": "Linda Williams, Julie Franco Mellow, BillandAngala Verley"}]}, {"id": "2213042142428197", "text": "Ristoro Di Lamole, absolutely the best meal since arriving, amazing view on the drive up, personable service and the food are to die for, beats all the Italian restaurants I’ve had thus far including in Canada. Highly recommended if you are in the Chianti region.", "link": "facebook.com/groups/1373361046396315/permalink/2213042142428197/", "likes": 30, "comments": [{"username": "Ike Simoncini", "comment_text": "Its already on my list:)"}, {"username": "Phyliss Hutchison", "comment_text": "What town"}, {"username": "Paula Brink", "comment_text": "Glad to know it’s still good- we ate there in 2008! It was fantastic."}, {"username": "Rose Man", "comment_text": "I’d eat there 🤣"}, {"username": "Maud Palmen", "comment_text": "Michael Sloen"}, {"username": "Kejdi Okej", "comment_text": "Glad to know it ,s still good we ate there in 2008 l it was fantastic."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 8, "comments": []}, {"id": "2213043839094694", "text": "Has anyone been to Brindisi, Portofino and Sicily? Need suggestions on what to see and what to not bother with… please", "link": "facebook.com/groups/1373361046396315/permalink/2213043839094694/", "likes": 2, "comments": [{"username": "Sarah Luisa Hughes", "comment_text": "Portofino and surrounding towns are beautiful. Would advise staying in Santa Margherita, its bigger and has lovely restaurants, bars, hotels and a nice beach, or Camogli is fabulous too. Get the ferry into Portofino for the day from Santa Margherita. You can get the train to Camogli from SM too, only one stop. Looking at going to Brindisi myself so i will follow this post!"}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "Portofino…take boat to San Fruttuoso (remote beach cove with amazing water and seaside dining) for the day. There’s a charming lighthouse bar with fab views at end of cliff easy walk from Portofino. Great coastal walk to Santa Margherita.\n\nWe stayed in Camogli and loved the vibe. Authentic and local. We hiked to San Fruttuoso and took the boat back. Next day boat to Portofino, walked to Santa Margherita and train back to Camogli. Love that entire region. Amazing landscape, food and people."}]}, {"id": "2213033435762401", "text": "Has anyone been successful in doing a copycat version of the White Bean/Vegetable soup from Trattoria Sostanza in Florence? Most amazing flavors.\n\nGoing to try to replicate even though I know I won’t be able to “truly” replicate!!! Any leads please 🙂 this was it. When I tell you amazing….I mean AMAZING!", "link": "facebook.com/groups/1373361046396315/permalink/2213033435762401/", "likes": 5, "comments": [{"username": "Paola Pulga", "comment_text": "the secret to a good bean minestrone is sautéed with onion, celery and carrot before throwing the beans"}, {"username": "Francine Greco Stahanczyk", "comment_text": "There was a dish at a restaurant that I really liked. I emailed the restaurant and asked if they would share the recipe. They did."}, {"username": "Deborah Larsen", "comment_text": "I find that many places still use the ole Cubetto di Brodo type stock cubes, what Americans would call a bullion cube as a flavor enhancer. I am super sensitive to the MSG that most contain, and can always tells when I have ingested it. Of course there are some Italian restaurants that make their own stock, but if you are trying to re-create a dish, without luck it may be this one ingredient that you are missing. I was surprised when I moved here how many home chefs and family restaurants still rely on these cubes for cooking."}, {"username": "Judy Charon", "comment_text": "This soup looks and sounds delicious. I’d love to have the recipe/\ningredients. Please share if you have it."}, {"username": "Andrea Hirsch", "comment_text": "Update! I made this recipe below. Definitely not a replica, but it was yummy and everyone LOVED it! https://\nwww.sipandfeast.\ncom/\ntuscan-white-bea\nn-soup/"}]}, {"id": "2212743165791428", "text": "Hi\nI am going to Italy in October with 3 friends my job is to find out about tickets for the Uffizi Gallery. Is it worthwhile to pre-book and which tickets do you recommed?", "link": "facebook.com/groups/1373361046396315/permalink/2212743165791428/", "likes": 1, "comments": [{"username": "Sophia Lin", "comment_text": "If you are able to get there by 8:15am, you can get tickets right away"}, {"username": "Amy French Baillie", "comment_text": "Super easy to purchase online from uffizi…book an early entry time to avoid crowds…can also get a passport which is a ticket to uffizi, pitti palace and boboli gardens to use within within 5 days of your booking time. Booking time is for the uffizi, then can use for next few days to see other sites (and bypass lines) on the ticket. Used passport couple of weeks ago - was great."}, {"username": "Sab Ahm", "comment_text": "Booked online directly."}, {"username": "Jeff Gentner EA", "comment_text": "Book as much as possible before departure. Save time and stress."}]}, {"id": "2212935689105509", "text": "Advise please, my husband and i will be travelling to Italy during October and plan on doing a guided tour of Pompeii whilst in Naples.\nIs it difficult/ time consuming to take the train from Naples to Pompeii and meeting the guide there, Or should we rather opt for the pick up option in Naples instead?", "link": "facebook.com/groups/1373361046396315/permalink/2212935689105509/", "likes": 2, "comments": [{"username": "Skye Birch", "comment_text": "its a breeze... its so easy will cost you a few euros... get the circumvesuviana\nfrom naples about 30 mins and the transtation is bang outside the entrance to pompei"}, {"username": "Jenny Payne", "comment_text": "I would organise to meet the guide at Sorrento train station & go from there, but check out how much from Naples and see if it is much different in price first🌻"}, {"username": "Nadia Ali", "comment_text": "I did that a few weeks ago, got the train/\ncircumvesuviana from Naples Garibaldi was easy - go to the main train station, downstairs and left all the way to the info office at the end (opposite the gates for the trains) get your ticket there, check your change before you turn away, go through the gate down to platform 1, it's about a half hour/45 minute ride, however aim to get the train before the one you actually need (I e earlier train) they often run late.\nIf you have Google maps that will help too.\nHope this helps and enjoy!"}]}, {"id": "2212940842438327", "text": "What is the best way to get from Naples airport to Sorrento after 7:30PM? Ferry stops running before that and the Capania Express (train) doesn’t run that late, and a private transfer is like 80$ per person, Uber is also 100$", "link": "facebook.com/groups/1373361046396315/permalink/2212940842438327/", "likes": 7, "comments": [{"username": "Carmine Napolitano", "comment_text": "...private transfer"}, {"username": "Anita Clayton", "comment_text": "We paid 110€ for 2 people and luggage in a private transfer in May. Check the airport coach timetable."}, {"username": "Yvette Pavone", "comment_text": "Suntransfers.co\nm"}, {"username": "Kendall Davern", "comment_text": "A private transfer for $80 is actually a good price"}, {"username": "Virginia Lane", "comment_text": "Www.seahorsecar\nservice.com"}, {"username": "Lydia Leyla Cosgrove", "comment_text": "The last train goes at 22:14 from napoli garibaldi apparently!\n\nhttps://\nwww.eavsrl.it/\nweb/sites/\ndefault/files/\nORARI%20NAPOLI%2\n0SORRENTO%20dal\n%2017%20Luglio_\n0.pdf"}, {"username": "Janine Emma Lucas", "comment_text": "Flixbus"}, {"username": "Rose Turdo", "comment_text": "Spend the night in Naples. There's a great hotel called Hotel Ferrari outside the city."}, {"username": "Rita Davoli-Conti", "comment_text": "Change platforms - it costs EUR 5 with Vesuviana"}, {"username": "Jan Buess", "comment_text": "Private transfer is what we are doing to Positano, 150EU"}, {"username": "Fetchin Gretchen", "comment_text": "Please verify this information is still valid from my search results!\nThe best way to get from Naples airport to Sorrento after 7:30PM is to take a shuttle bus. The Curreri Viaggi bus is the only direct airport shuttle service that runs late, with the last departure from the airport at 7:30PM. The bus costs 10 euro per person and takes about 75 minutes to get to Sorrento. The bus stop in Sorrento is located in the piazza in front of the Circumvesuviana\ntrain station.\n\nHere are the steps on how to book a Curreri Viaggi bus ticket:\n\n1. Go to the Curreri Viaggi website and select the \"Naples Airport Shuttle\" option.\n2. Choose the date and time of your travel and the number of passengers.\n3. Enter your contact information and payment details.\n4. Print out your ticket or show it on your phone to the driver when you board the bus.\n\nHere are some other shuttle bus services that you can consider:\n\n* Sorrento Coast Shuttle: This service also runs late, with the last departure from the airport at 8:30PM. The bus costs 15 euro per person and takes about 90 minutes to get to Sorrento.\n\n* PrenotaBus: This service offers a variety of shuttle bus options, including a late-night service that departs from the airport at 10:00PM. The cost of the late-night service varies depending on the number of passengers.\n\nI hope this helps!"}, {"username": "Anne Mc Namara", "comment_text": "Take the train from Naples. Trains are very cheap.Trains run till after 10pm"}, {"username": "Ange Pappas", "comment_text": "Jason Pappas"}, {"username": "Anthony Taylor", "comment_text": "Local train.Don’t need to pre book.It’s takes over a hour,but cheap as chips"}, {"username": "Paula Brink", "comment_text": "https://\nwww.curreriviagg\ni.it/mobile/en/\nnaples-airport-s\nhuttle/"}, {"username": "Wolfgang Nitsch", "comment_text": "What kind of answer are you expecting"}]}, {"id": "2212953969103681", "text": "Please recommend a nice and beautiful hotel for stay In Rome,I'm from Lesotho", "link": "facebook.com/groups/1373361046396315/permalink/2212953969103681/", "likes": 3, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187791-d1378\n735-Reviews-Dom\nidea_Hotel-Rome\n_Lazio.html"}, {"username": "Brandy Robertson Phillips", "comment_text": "Hotel Academia. Is near Trevi fountain, we loved it"}, {"username": "Jill Wolder", "comment_text": "Hotel Hassler Roma"}, {"username": "John Bruckman", "comment_text": "Budget?"}, {"username": "John Spensieri", "comment_text": "Lunetta Hotel!"}, {"username": "Jeff Oster", "comment_text": "The Westin Excelsior Rome"}, {"username": "Amber Pena", "comment_text": "Hotel hassler on top of the Spanish steps"}, {"username": "J. Richard Laberge", "comment_text": "Waldorf/Hilton Cavalieri"}, {"username": "Yane Cas", "comment_text": "Hotel Cecile"}]}, {"id": "2212909062441505", "text": "Does anyone have any experiences of staying in Florence in late September? Would be great to learn about best hotel, living accomondations (outside or in Florence?), best way to get around (rent a car?) and what not to miss when going there? 🙂 very grateful for any tips & tricks.", "link": "facebook.com/groups/1373361046396315/permalink/2212909062441505/", "likes": 2, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.discovercars\n.com/\n?a_aid=NextStop-\nItaly"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.jdoqocy.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187895-d2329\n63-Reviews-NH_C\nollection_Firen\nze_Porta_Rossa-\nFlorence_Tuscan\ny.html"}, {"username": "Jeanne Eliason", "comment_text": "Yes. We have been many many times over the last 12 years. I highly recommend Hotel David. Lovely location as we walk \"downtown \" in 15 minutes. On Michelangelo \"street \". Wine, beer, other drinks and great snacks. Buffet breakfast. Walk up the hill to the piazza . Go all the way up the hill to a church with gorgeous cemetary beautiful the church. Don't remember the name and sounds unusual to go there however once you have been you will understand why. We spent an hour amazed at hundreds of small Italian like miniature houses that held the dead. And statues that rival museums. Take the city bus or taxi to Fiesole and see a view of Florence that is awesome. Great places to eat. Google it. The Florence hop on hop off bus also goes there"}]}, {"id": "2212647929134285", "text": "What is the cheap web site to search tours in Europe? Please recommend. Thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2212647929134285/", "likes": 5, "comments": [{"username": "Glenn Todd Webb", "comment_text": "Travelmasters"}, {"username": "Melanie Izzy", "comment_text": "Expedia, Viator, Trip Advisor, Get your guide all have plenty of tours"}, {"username": "Tanya Lee Knightly", "comment_text": "Get your guide"}, {"username": "Madeline Caporale", "comment_text": "When booking tours through Viator or other sites be sure to check the name of the tour operator and look up reviews. Both quality and price may vary. Any tours by third parties for museums, Vatican and Colosseum may be subject to cancellation if the tour operator cannot procure tickets. Upside, most have refund policies. Booking your own will require work and tickets will be non-refundable.\nChoose the option that works for you."}, {"username": "Nadia Davidenko", "comment_text": "Did anyone reserve through exoticca web site?"}, {"username": "Fetchin Gretchen", "comment_text": "I use the getyourguide app for day trips and short tours. Or Viator app. For longer tours, there are Rick Steve's tours and Overseas Adventure Travel or OATTravel websites."}, {"username": "Figen Dayan", "comment_text": "Nothing is cheap anymore here in Europe. Unfortunately the good old budget travel days are over."}, {"username": "Karl Wilder", "comment_text": "Stay away from where are you Tour and get your Guide because they are just resellers in the market prices up. Look for activities that interest you and then book directly with the activity provider."}, {"username": "Jamie Lockhart", "comment_text": "Viator"}, {"username": "Nathan Earl Stellenberg", "comment_text": "Of all the tour sites I had been on, Touradar appeared to be the best priced."}, {"username": "Manon Beaucage", "comment_text": "Viator"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "There are no cheap tours. The cheapest way is to plan it yourself."}, {"username": "Debra Quinney", "comment_text": "I use Headout every time you buy a tour you get a discount on the next one and earn credits"}, {"username": "Nadia Davidenko", "comment_text": "Thank you guys"}, {"username": "Carole Tarlap", "comment_text": "There are LOTS on Facebook....sea\nrch there."}, {"username": "Charlie Charnigo", "comment_text": "Just remember you get what you pay for. The FB travel groups are filled with complaints from people that tried to save a $€£¥ only to have it cost them more in the long run. Develop a budget based on transport, lodging and food…and go from there."}, {"username": "Mia Catalano", "comment_text": "Viator"}, {"username": "Sherri Leis Dillavou", "comment_text": "Cheap isn’t the best idea. Just book stuff yourself"}, {"username": "Santo Finocchiaro", "comment_text": "Depends on what you are looking to do"}, {"username": "Noelene Cameron", "comment_text": "I used Get Your Guide for a lot of mine."}, {"username": "Wendy Gauci", "comment_text": "I’ve found free walking tours in Rome & Florence, haven’t been yet so don’t know what they are like? https://\nwww.eventbrite.i\nt/e/\nflorence-free-to\nur-myths-and-le\ngends-of-floren\nce-a-gold-city-\nregistration-26\n697339461\n\nhttps://\nromesultimatefre\netour.com/"}, {"username": "Maureen McCall Bradley", "comment_text": "We went direct with WalkaboutFloren\nce and found an amazing Certified Guide - Vanessa Tonarelli for everything Florence."}, {"username": "Suzanne Shea-Simpson", "comment_text": "Tripmasters"}]}, {"id": "2212673879131690", "text": "Hello everyone, I have narrowed down our accommodation choices in Rome to the following:\nNavona Garden Suites\nNavona Stay\nLa Residenza del Sole al Pathenon\nAny advice on which one to choose, price, rooms, location are all great. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2212673879131690/", "likes": 1, "comments": []}, {"id": "2212707972461614", "text": "Hi everyone! I’m dreaming about going to Rome. Its on my travel-bucketlist for as long that i can remember..I hope 2 go in September or October. Is it safe to travel alone as a woman? Experiences or tips are much welcome.\nI’m kinda nervous to go by myself..\n\nThank you for replying\nCiao\nMelissa Vlieghe", "link": "facebook.com/groups/1373361046396315/permalink/2212707972461614/", "likes": 18, "comments": [{"username": "Fatme Sadul", "comment_text": "It’s safe, just be aware of your surroundings, also is walk friendly and in case of using public transportation is easy and safe as well. Try to book major sightseeing in advance and go earlier as possible to avoid the huge crowds 🙂 me personally like crowded Rome, I visited 4 times during different seasons and all the times I enjoyed a lot."}, {"username": "Leslie Goodland", "comment_text": "Go! I recently spent 10 weeks traveling solo through Paris, Italy and Spain. Trip of a lifetime! 👍👍😻"}, {"username": "Sarah Hartley", "comment_text": "I went to Rome on my own at 21 and felt safe - so much so I’ve gone back to Italy alone since, and am going again 🙂\n\nMy tips are the same for people on their own or in groups - be aware of your surroundings, and make sure that the areas you’re visiting are safe. Also be aware that there are people (normally by the tourist places) that will try and con you into buying bracelets and stuff!"}, {"username": "Michael Wilkinson McLaughlin", "comment_text": "I go by myself all the time! You’ll go once by yourself and then realize it’s easy-peezy lemon squeezy!"}, {"username": "Karina Lutz", "comment_text": "We will be there in the beginning of October. 😀"}, {"username": "Holly Clifton", "comment_text": "It safe, just be aware and don’t stop for conversation, don’t tell anyone you are traveling by yourself, keep your belongings close. I used these guiding rules as I traveled all avross EU by myself."}, {"username": "Debbie Seidenstricker", "comment_text": "I’m also thinking of going alone in November. Worried about language and transportation to and from cities by myself."}, {"username": "Jennifer Lynn Davis", "comment_text": "I did it by myself in June!"}, {"username": "Chris Landry", "comment_text": "70 yo female, two months in Italy solo. Three weeks in Rome. Loved it. Never felt fearful. Will do it again!"}, {"username": "Angela Marsala-Gaydos", "comment_text": "I recently booked a 17 day solo tour to Venice, Florence, Rome, Almafi and Sicily in mid Oct. It’s my first solo\nand I am a bit scared but also excited. It’s a challenge but with a tour your hotels, transportation and daily guided tour will give a sense of security."}, {"username": "Victoria Moorhead Murrow", "comment_text": "Definitely !"}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "Go!\n\nI did a solo Rome trip for a week in November 2021…a special treat for my 60th. It was liberating, exciting and soulful. Never felt unsafe. I stayed at a lovely boutique inn: Parisii Relais Luxury. Stylish. Fabulous breakfasts. Gracious service.\n\nI wandered late at night and early morning. Had Trevi fountain to myself. Savored churches and art museums (fav was Palazzo Barberini).\n\nHighly recommend Castel Sant’Angelo for a drink with St Peter’s Duomo views and amazing sunset at its rooftop. I loved this area and Biblio bar nearby. Stone’s throw to Vatican. Highly recommend the night tour of the Vatican museums. My fav highlight…linge\nr and be the last one out of St. Peter’s basilica and Sistine Chapel. Breathtaking!"}, {"username": "Mary Youssef", "comment_text": "Absolutely do it alone\nI remember those days when I traveled by myself\nI did what I want when I want\nI am in Rome now with 2 kids - not easy but I am doing it for them"}, {"username": "Rose Turdo", "comment_text": "YES, done it several times and it's incredible you can stop and go at your leisure. Driven all through Italy and Sicily alone. In fact going to venture up to Switzerland France Andora and Barcelona this year.\n\nAlways be aware of your surroundings, watch for people following you and avoid walking streets at night as it's very easy to get turned around.\nChoose accommodation with restaurant and bar on premise.\n\nAre you only going to Rome and how are you getting there ?\n\nWill you be traveling through Italy if so my suggestion is rent a car the freedom is incredible. No carrying baggage wherever you go, just lock it in your trunk."}, {"username": "Keith Al-Dijaili", "comment_text": "Very safe"}, {"username": "Valerie Collanton", "comment_text": "I have traveled solo all over Italy, including a Rome many times. No issues. If it is your first time to Rome, you might want to do a small group tour. Context travel has several options for small groups you can join I also enjoy doing at least one cooking class when traveling solo."}, {"username": "Laurie Francis Menk", "comment_text": "Yes!"}, {"username": "Amber Pena", "comment_text": "I travel solo mostly"}, {"username": "Rachel Gallacher", "comment_text": "I went to rome for my first solo trip. Loved it and felt safe. Booked group tours x"}, {"username": "Melissa Vlieghe", "comment_text": "Thanks for all the replies and sharing your personal experiences! 😉I’m reading every single one! I think its just “making the jump” that’s the most scary thing about it. Once you arrive it wil be liberating and everything will be fine, i want to believe that, its just my head sometimes 😜But if you think about it to much you will never do it… It will be my second time in Italy.\n\nWent to Venice with my partner two years ago,it was also so beautiful and it had such a vibe and atmosphere 😍Think Rome will be even better"}, {"username": "Carl Ylda Salazar", "comment_text": "There are a number of solo women travel groups out there, for single women and those with husbands or significant others that have no interest in traveling."}, {"username": "Rebecca Yeoh", "comment_text": "Definitely safe! Book your hotel in the areas of the Pantheon / Piazza Navona / Campo de’ Fiori. It’s the best area for first time visitor, walk to everything!"}, {"username": "Serenna Davies", "comment_text": "Have some 1:1 Italian lessons."}, {"username": "Paula Brink", "comment_text": "You can do it! I so love my solo trips.\nI usually book some small group walking tours so I am not always alone."}, {"username": "Nicole Beaumont", "comment_text": "I traveled around Italy for 3 weeks in June and felt completely safe. My only tip, which also applies anywhere you’d travel solo, is just to be aware of your surroundings. Also, if you use a purse, wear a crossbody and keep it in front of you. I always had my hand on it too."}, {"username": "Rhonda Russell", "comment_text": "I am here now. I feel safe, but am aware of my surroundings especially in the crowded areas. All I carry for the day is my phone with a lanyard that is around my wrist, and in the phone case I have a travel card and €20. Enjoy and smile, it’s amazing"}, {"username": "Rhona OConnor", "comment_text": "I travel alone but get bored with my own company...... So I book group tours and activities. Travel Department are great if you want to join a group and really see an area with guides each day."}, {"username": "Donna Cafora Shepard", "comment_text": "I’ve been on my own but I would definitely say to stay in the historic city center. I love the 9Albergo Cesari but they recently were sold and upgraded and their prices went through the roof. If it’s too expensive, look at it on a map, and find the closest thing to it. This area is in the center of everything on a pedestrian path with tons of tourists all the time. You can freely walk around day or night. I’ve stayed in other areas before where I did not feel safe."}, {"username": "Amanda Rogers", "comment_text": "Hi - I just travelled places in Italy solo including Rome. I’m late 50s and had an incredible time. Not once did I not feel safe. Just go for it……honestly I loved very minute."}]}, {"id": "2212741452458266", "text": "This might be a long shot, but thought I would ask anyway. I would love to do a cooking class in Tuscany area, however I am a coeliac (cannot eat gluten) does anyone know of any cooking classes around Italy that accommodate intolerances? 🤞🏼", "link": "facebook.com/groups/1373361046396315/permalink/2212741452458266/", "likes": 1, "comments": [{"username": "Cecilia Christine Costantini", "comment_text": "In Florence you have this https://\nwww.mamaflorence\n.com/\ncorso-cucina-cel\niaci-firenze"}, {"username": "Pamela Sheldon Johns", "comment_text": "https://\nwww.poggio-etrus\nco.com/\nfood_wine.html\nnear Montepulciano. Special orders don't upset us 😊"}]}, {"id": "2212809785784766", "text": "I ❤❤ Italy !", "link": "facebook.com/groups/1373361046396315/permalink/2212809785784766/", "likes": 29, "comments": []}, {"id": "2212842312448180", "text": "How easy is Turin to get around in for a wheelchair user .\nAfter pushing my lovely gorgeous wife I take it there is plenty good pitstops for wine , beer and coffee.", "link": "facebook.com/groups/1373361046396315/permalink/2212842312448180/", "likes": 1, "comments": []}, {"id": "2212597889139289", "text": "Has anyone rented a car and toured around the country?", "link": "facebook.com/groups/1373361046396315/permalink/2212597889139289/", "likes": 5, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.discovercars\n.com/\n?a_aid=NextStop-\nItaly"}, {"username": "Karen Ebert", "comment_text": "Yes, multiple times. It’s a great way to see a lot of quieter places."}, {"username": "Matthew Livio Conti", "comment_text": "Yes. It’s great to be on your own schedule."}, {"username": "Sheba Siddiqui", "comment_text": "Yes! Amazing."}, {"username": "Charla Goff", "comment_text": "Do you search for hotels that provide parking and where you can easily walk around?"}, {"username": "Shannon Packard", "comment_text": "Yes 🙌🏼, and it was amazing!"}, {"username": "Sherri Leis Dillavou", "comment_text": "Driving in Italy is challenging"}, {"username": "Jona Guðmundsdottir", "comment_text": "So far i have only tried using a rental car in Italy... never taken a train or a bus there. Still we managed to go to italy for 5 years om a row... we usually just rent an apartment/room in a small village/town or in the country. Mostly from airbnb and booking. And so far no fine...."}, {"username": "Mario Giberti", "comment_text": "In 2000 drove 1000 mi around Sicily in a week. Went all over the island . Awesome time . You have to brake to let people passing you back in if an oncoming car appears."}, {"username": "Lauri Savage", "comment_text": "Yup. Part of the adventure and it was great! Our little Fiat was a blast!"}, {"username": "Enrico Lecce", "comment_text": "Enrico Lecce"}, {"username": "Kenneth T Williams", "comment_text": "We do every time"}, {"username": "Keith Al-Dijaili", "comment_text": "Yes !! Best experience ever !"}, {"username": "Adele Mazoudier", "comment_text": "Yes. From Naples, south around the boot and along the east coast to Venice. Also in Sardinia and Sicily. (Australians). You need to consider parking when you plan where to stay/stop. We were often in out of the way places and it was April/May so not such a problem."}, {"username": "Connie Iacozza Brazzoni", "comment_text": "Yes. Its amazing to drive through Italy. Especially the smaller towns."}, {"username": "Mike Ball", "comment_text": "I’ve driven in Puglia and Tuscany, found it a very relaxing experience, avoided driving into the bigger towns and cities, we usually caught the train as parking is an issue at times ,\n\nHaving a car is the best way to explore the little hidden gems and small towns away from the crowds."}]}, {"id": "2212606945805050", "text": "We are looking for recommendations for a pasta making class with wine tasting in Tuscany. Ideally it would include transportation from Florence or the train station. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2212606945805050/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Florence/\nCooking-Class-at\n-Medieval-Castl\ne-in-Tuscany/\nd519-7219P7?pid=\nP00070587&mcid=\n42383&medium=li\nnk&medium_versi\non=selector"}, {"username": "Karen Nicholls", "comment_text": "We just completed pasta making class that included a tour of the local market. It was absolutely fantastic. Made 2 pasta dishes from scratch plus tiramisu. It was five minutes from the train station.\nCourse was “Wanna be Italiano”\n\nhttps://\nwww.florencecook\ningclasses.com/"}]}, {"id": "2212622482470163", "text": "Who makes the lightest wheeled backpack?", "link": "facebook.com/groups/1373361046396315/permalink/2212622482470163/", "likes": 1, "comments": [{"username": "Jackie Travis Trutter", "comment_text": "Following"}, {"username": "Debbie Zornes Ruch", "comment_text": "High Sierra"}, {"username": "David Horgen", "comment_text": "Traveling in Italy right now. It's been two weeks. Using a carry on and a small personal bag. It's been perfect. I love this bag. It rolls well with the extended handle, or quickly becomes a backpack if needed. I've done both depending on the situation. Lightweight too"}]}, {"id": "2212588805806864", "text": "Beautiful Venice", "link": "facebook.com/groups/1373361046396315/permalink/2212588805806864/", "likes": 58, "comments": [{"username": "Adam Apple", "comment_text": "Great apple deals\nMessage me now"}, {"username": "Hanna Malak", "comment_text": "Hanna Malak"}, {"username": "Lashawn Bennett", "comment_text": "My favorite place!!"}]}, {"id": "2212512015814543", "text": "Any suggestions on a cooking class in Sorrento and in Florence?", "link": "facebook.com/groups/1373361046396315/permalink/2212512015814543/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Florence/\nFlorence-Cooking\n-Class-Learn-Ho\nw-to-Make-Gelat\no-and-Pizza/\nd519-5049ITALY_P\nIZZA?pid=P00070\n587&mcid=42383&\nmedium=link&med\nium_version=sel\nector"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Sorrento/\nSorrento-Cooking\n-Class/\nd947-6530COOKSCH\nOOL?pid=P000705\n87&mcid=42383&m\nedium=link&medi\num_version=sele\nctor"}, {"username": "Lindsey Dingman", "comment_text": "Chez barrone cooking school 🤌"}, {"username": "Jamie Lockhart", "comment_text": "We use Kitchen Chez Nous in Florence. They were wonderful!!!"}, {"username": "Kristi Britt-Stearns", "comment_text": "We loved moma lulu’s in Sorrento"}, {"username": "Jessica Asquith Hemphill", "comment_text": "We did the cooking lab in Florence and loved it!"}]}, {"id": "2212529485812796", "text": "Trying to book a private taxi with Motoscafi in Venice to get from the airport to my hotel. When I put in my date it is unavailable. It has Aug 28 - Sept 10 blocked out for “public events”. Can anybody explain this?", "link": "facebook.com/groups/1373361046396315/permalink/2212529485812796/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Venice/\nPrivate-Limousin\ne-Transfer-Veni\nce-Airport-to-V\nenice-City-Cent\ner-by-Car-and-W\nater-Taxi/\nd522-12418P1?pid\n=P00070587&mcid\n=42383&medium=l\nink&medium_vers\nion=selector"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Historical Venice Regatta Storica 2023: 3 September 2023"}, {"username": "Jenny Godfrey", "comment_text": "I wouldn’t stress you come out of the airport and walk to the boats plenty of water taxis ready to take you across. Worst case you can get the public ferry to the nearest stop to your hotel. Also plenty outside train station in case you arrive by train."}]}, {"id": "2212555989143479", "text": "Searching for renting one bedroom / apartment close to Mostra d'Oltremare from 28Aug till 2Sept\n\nAny recommendations!?", "link": "facebook.com/groups/1373361046396315/permalink/2212555989143479/", "likes": 1, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 8, "comments": []}, {"id": "2212560932476318", "text": "Any recommendation for a nice, idyllic restaurant/pizzeria in the Bologna region?", "link": "facebook.com/groups/1373361046396315/permalink/2212560932476318/", "likes": 1, "comments": []}, {"id": "2213024712429940", "text": "What are the Best inexpensive places to stay in Florence?", "link": "facebook.com/groups/1373361046396315/permalink/2213024712429940/", "likes": 3, "comments": [{"username": "Cyndi Riley", "comment_text": "Depends on what you want. We do AirB&B’s\nLook at price. Read what they offer, read reviews. I search a lot till I find the one that will suit our needs. And good prices."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Check a booking site for prices and reviews. Inexpensive means different things to different people."}, {"username": "Nancy Kirby", "comment_text": "Hotel Alessandra is a reasonable and wonderful hotel"}, {"username": "Shelley Frise", "comment_text": "Also try Vrbo. I agree research the properties and read the reviews. We stayed in a lovely apartment in Florence"}]}, {"id": "2212740095791735", "text": "I am going to Lecce for 4 days in November, any ideas and nice places where I can stay?", "link": "facebook.com/groups/1373361046396315/permalink/2212740095791735/", "likes": 2, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.jdoqocy.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FAttractionP\nroductReview-g1\n94791-d17824244\n-Orecchiette_Co\noking_Class_and\n_Wine_Tasting_i\nn_Lecce-Lecce_P\nrovince_of_Lecc\ne_Puglia.html"}]}, {"id": "2212489092483502", "text": "Looking at our 5th trip to Italy in April 2024! Recommendations for Tuscany (Siena, Lucca, Cortona) and in the Pisa/Cinque Terre area.\n\nIt’ll be us and our (almost) 3 year old (this will make it 3x in Italy before his 3rd birthday!)", "link": "facebook.com/groups/1373361046396315/permalink/2212489092483502/", "likes": 8, "comments": [{"username": "Ryan Monahan", "comment_text": "Sounds like an awesome trip. Very similar to the one we did in July!"}, {"username": "Kejdi Okej", "comment_text": "Soundds like an awesome trip very similar to the one we did in july"}, {"username": "Nicole Rebecca Louise", "comment_text": "Have you got anything booked for accommodation in Lucca? Have a great recommendation if not!!\n\nWe would also recommend Inpasta and Gelateria Paniko in Lucca, also Dante and Gentucca for pizza - it was fantastic!"}, {"username": "Amber Pena", "comment_text": "Siena is my fave! Been there 8x aNd it’s consistently nice"}, {"username": "Rose Turdo", "comment_text": "Bolsena Lake\nUmbria\nAlberobello"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Write this post about Pisa about a month ago https://\nwww.facebook.com\n/groups/\n1373361046396315\n/permalink/\n2190794237986321\n/"}]}, {"id": "2212440152488396", "text": "We want to visit our son in November while he is studying in Rome. We will have 7 or 8 nights. I would love to go to amalfi coast but doesn’t sound like the weather is best that time of year for that. Any recommendations on where/what we should do?", "link": "facebook.com/groups/1373361046396315/permalink/2212440152488396/", "likes": 3, "comments": []}, {"id": "2212471062485305", "text": "This maybe a odd question but I am wondering about the adaptor for iPhone and Apple Watch’s do I need to buy a special plug ?", "link": "facebook.com/groups/1373361046396315/permalink/2212471062485305/", "likes": 2, "comments": [{"username": "Nicole Cleaver- Dietze", "comment_text": "If you already have European plug then no if your U.S. or Canadian you need a plug adapter. No voltage converter needed. Your in phone already is dual voltage.\nI bought 2 plug adapters my self with the usb connection. However it all depends on what iPhone you have. My 13 used USB."}]}, {"id": "2212478955817849", "text": "Looking for recommendations on a central hotel in ROME we can stay at after our cruise. Will have 5 kids (ages 1-13) and won’t be renting a car. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2212478955817849/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187791-d2361\n34-Reviews-Hote\nl_Abruzzi-Rome_\nLazio.html"}, {"username": "Elana Kruger", "comment_text": "We just stayed at Hotel Nazionale - great hotel & so central"}, {"username": "Ilana Brongiel", "comment_text": "With that many of you I might consider an AirBnB or VRBO. Stay near Trevi, pantheon or Campo di Fiori/Navona. It’s hard to find actual hotels that will sleep that many unless you get multiple rooms."}, {"username": "Kejdi Okej", "comment_text": "We just stayed at hotel nazionale great hotel & so central"}]}, {"id": "2212481995817545", "text": "Hi! My husband and I are going to Italy end of September through October - we are staying in Rome, Florence, Venice and Lake Como. We want to begin booking tours and tickets but it's a bit overwhelming with all the options. What are \"must book ahead\" places and what are recommendations for what to tickets/tours to book for those places? (i.e. - theआणखी colosseum+ roman forum combined ticket vs separate skip the line tickets, what tour/time for the Vatican areas, combined vs separate tickets for the Galleria dell'Accademia+Uffizi Gallery+Duomo, etc.) Specific tours/tickets recommendations from personal experience as well as general advice are both welcome and much appreciated! TIA!", "link": "facebook.com/groups/1373361046396315/permalink/2212481995817545/", "likes": 6, "comments": [{"username": "Jenny Payne", "comment_text": "Definitely book uffizi & Accademia on line for Florence ,as since Covid Italy is really busy with tourists. I have been going a long time to Italy every year and if you only have a few days in each book. For Rome I take friends and show them around ,so for the Vatican I suggest they go very early or late in the afternoon say 2pm I think head phones are good to do ,but depends how long u want to stay & I suggest night tours for the Colosseum,it is amazing . In Florence if u have time go to The Santa Maria Novella it is a old beautiful building 🌻"}, {"username": "Michelle Bergman Davis", "comment_text": "For the Colosseum book the underground tour, it is amazing.\n\nIn Florence I highly recommend the St Marks and Doges’s Palace after dark tour.\n\nIn Venice we booked a 6:45am tour of the Duomo so we were there as security opens the Duomo, we then we’re the first in able to claim to the top before anyone else was there. We had about 15 minutes at the top of the dome to ourselves before other groups got up there. It was spectacular."}, {"username": "Brittany Pardue", "comment_text": "Following"}, {"username": "Sandra Maldonado", "comment_text": "What are the things you’d love to see? Those are the must see things for you."}, {"username": "Jeff McLellan", "comment_text": "Prime or Prime VIP tour of Vatican at 7:30AM is the only options I would do must book it in advance direct with Vatican Museums is best options.\n\nColosseum with underground access direct with Coopculture is only way you guarantee you get in. Effort is required to secure tickets but worth it.\n\nDavid tickets book up a lot sooner than I realized so look at those and keep your eyes on it."}, {"username": "Nicky Massey", "comment_text": "I would not book tours in Venice, better to explore on your own.\nFlorence book ahead for visit to the galleries. But try and go early as less people."}, {"username": "Cindy Haviland", "comment_text": "Following"}]}, {"id": "2212527645812980", "text": "Recommended Airbnb in Florence and Lucca please", "link": "facebook.com/groups/1373361046396315/permalink/2212527645812980/", "likes": 2, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Florence https://\nwww.kqzyfj.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187895-d1471\n324-Reviews-B_B\n_Il_Cielo-Flore\nnce_Tuscany.htm\nl"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Lucca https://\nwww.jdoqocy.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187898-d1540\n813-Reviews-B_B\n_Corte_Dei_Nobi\nli-Lucca_Provin\nce_of_Lucca_Tus\ncany.html%3FspA\nttributionToken\n%3DMjE3NjE3Njc"}, {"username": "Joy Jones", "comment_text": "Appartamento Giulia in Lucca. Great space and location."}]}, {"id": "2212498699149208", "text": "What is the best place to go for a Christmas and New Years?", "link": "facebook.com/groups/1373361046396315/permalink/2212498699149208/", "likes": 4, "comments": [{"username": "Jason Hobel", "comment_text": "The big cities or small towns. Italy does the holidays with beauty and respect. You can watch several YouTube videos on it. I hope to be in Italy during Christmas one of these years."}, {"username": "Wouter van Dam", "comment_text": "Sydney (AUS) 🇦🇺🇦🇺♥️"}, {"username": "Enrico Lecce", "comment_text": "Salerno"}]}, {"id": "2212547302477681", "text": "Anyone know a decent hotel in Rome for a few days in October", "link": "facebook.com/groups/1373361046396315/permalink/2212547302477681/", "likes": 13, "comments": [{"username": "Lori Spears Strahan", "comment_text": "We did Airbnb and it was wonderful!"}, {"username": "Debbie DiOssi", "comment_text": "Hotel Artemide is wonderful!"}, {"username": "Marie-Carlos Delgado", "comment_text": "Hotel Diana"}, {"username": "Norma Kalberer", "comment_text": "Hotel Nord Nuovo on Via Giovanni Amendola 3"}, {"username": "Jon Hotter", "comment_text": "St regis"}, {"username": "Marla Glodich", "comment_text": "Harry's Bar Trevi Hotel"}, {"username": "Jerry Lyubelsky", "comment_text": "We have stayed at Residenza Antica twice. Close to most major attractions. It used to be an old monestarty"}, {"username": "Yane Cas", "comment_text": "Excelsior"}, {"username": "Gary Fossaceca", "comment_text": "Hotel San Francesco"}, {"username": "Stephanie Blasko", "comment_text": "Hotel Gregoriana."}, {"username": "Joy Croake", "comment_text": "Hote Accademia..5 mins to Trevi Fountain"}, {"username": "Bob Deahl", "comment_text": "Residenze Farnese"}, {"username": "Mark Spielman", "comment_text": "Booking.com can refer you to hundreds"}, {"username": "Maria Vamva", "comment_text": "The code hotel next the Spanish steps and Franklin feels the sound at Prati area . There sre so many hotels in Rome"}, {"username": "Jo Quigley", "comment_text": "La Griffe Hotel"}, {"username": "Kimberly Glowaski Allee", "comment_text": "We stayed at Hotel Alphi. Grocery store and taxi across the street. (Cafes too) elevator and we had a terrace too. Rooftop terrace. Walking distance to the train. Lots of fun places to eat at the train station. Have fun!\n\nDo a street food trip. It was awesome."}, {"username": "Mitch Price", "comment_text": "Hotel barocco. Brilliant hotel, impeccable service and close to everything"}, {"username": "Debbie Lee", "comment_text": "We stayed at The Glam Hotel and absolutely loved it!"}, {"username": "Nancy Lewis", "comment_text": "Greates designer boutique hotel. La Valadier. Good prices. Fantastic location near Spanish steps and Piazza Del Popolo."}, {"username": "Michelle Rovere", "comment_text": "Artimedes is apparently fantastic"}, {"username": "Elena Eckley", "comment_text": "Guilio Cesare, MichaelAngelo"}, {"username": "Cindy Frenette Pawley", "comment_text": "We are at the River Palace. It’s close to everything with beautiful rooms and reasonable price. You can include breakfast if you’d like."}, {"username": "Joannie Beiswenger", "comment_text": "Hotel Cicerone clean great breakfast and close to everything"}, {"username": "Gary Lyons", "comment_text": "The W is fantastic."}, {"username": "Jeanne DeSalvo", "comment_text": "Hotel Isa! Great rooftop!"}, {"username": "Jodi Shiffman Silverman", "comment_text": "Baglioni"}, {"username": "Albert Makram", "comment_text": "River palace"}, {"username": "John Green", "comment_text": "Hotel Canada, amazing staff, clean, nice rooms, stayed for 9 days no issues"}, {"username": "Lisa Conetta-Lee", "comment_text": "Paco di Principi"}, {"username": "Mirsada Miki Mikica", "comment_text": "We loved\nRelais Fontana Di Trevi Hotel!! Amazing roof top for breakfast and drinks at night!!"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187791-d1378\n735-Reviews-Dom\nidea_Hotel-Rome\n_Lazio.html"}, {"username": "Jonathon Lipsin", "comment_text": "Thanks for the info."}, {"username": "Matt Johnson", "comment_text": "There are 1000's of them."}, {"username": "Sandra Potter", "comment_text": "I stayed at the IQ Hotel\nI would definitely go back\nVery clean hotel, great staff and walking distance to Colosseum, Trevi, Spanish Steps."}, {"username": "Kejdi Okej", "comment_text": "Thanks for the info."}, {"username": "Kathy Velocci", "comment_text": "Rome Art Hotel. Just stayed there 2 weeks ago. Close to Trevi, modern rooms, very clean and great staff"}, {"username": "Jeni Noriega", "comment_text": "NH collection Roma"}, {"username": "John Spensieri", "comment_text": "Hotel Lunetta, near piazza Navona"}, {"username": "Elana Kruger", "comment_text": "We just stayed at Hotel Nazionale - was great & so central"}, {"username": "Gary Bailey", "comment_text": "We stayed at the G-Rough in February, it was fabulous"}, {"username": "Elvira B. DiPietro", "comment_text": "The Alexandra"}, {"username": "Patrizia Sangiovanni", "comment_text": "Airbnb, I was there a few weeks ago, host was fantastic, place was gorgeous and close to everything. Let me know if you need contact info"}, {"username": "Joanne Llerandi", "comment_text": "Hotel Locarno!!"}]}, {"id": "2212612095804535", "text": "Looking for a good hotel or Airbnb in Rome for two nights in Mid Oct before our cruise.? Suggestions?", "link": "facebook.com/groups/1373361046396315/permalink/2212612095804535/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187791-d1378\n735-Reviews-Dom\nidea_Hotel-Rome\n_Lazio.html"}]}, {"id": "2212553609143717", "text": ". How difficult is it for someone from the US to rent a car and drive in Italy?", "link": "facebook.com/groups/1373361046396315/permalink/2212553609143717/", "likes": 40, "comments": [{"username": "Fabio Clemente", "comment_text": "You don’t need any international driver license if you are not staying more than 3 months"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "here you can find the best offers https://\nwww.discovercars\n.com/\n?a_aid=NextStop-\nItaly"}, {"username": "Colleen Dawson", "comment_text": "Not difficult. You will need an International Drivers Permit from your local AAA office, credit card, patience and your wits about you. Some on this forum will tell you a permit is not needed as some rental agencies might ask for one, but if stopped for any reason you will need to show proof of having one.We get one frequently, hubby is native Italian, so he drives. Enjoy your trip."}, {"username": "Jenna Buterbaugh Hailey", "comment_text": "Don’t drive if you can avoid it.."}, {"username": "Gene Alligood", "comment_text": "Not difficult at all!!! Arrange your car ahead of time and roads are same as US. We did 18 day road trip from Geneva Switzerland, to Rome, down to Cinque Terre, down the Amalfi Coast to Naples, out to Capri and back up to Rome to fly home. Driving was no problem; used my GPS and would do it again😀"}, {"username": "Cyndi Riley", "comment_text": "Do your research on insurance. Make sure it covers everything, even a break down. Some don’t."}, {"username": "Holly Clifton", "comment_text": "You do not need an international drivers license, it’s not difficult just get proper insurance through the rental car. Now driving, parking, etc is something else. Each city will be different with amount of parking, etc so rent a smaller vehicle to fit into available spaces."}, {"username": "Michael EIkady", "comment_text": "Italy has plenty means of transportation by trains, drivers and planes"}, {"username": "Keith Al-Dijaili", "comment_text": "Super easy ! I went to Avis last week rented the car drove all over Naples , Rome , Florence and Pisa"}, {"username": "Matthew Livio Conti", "comment_text": "The IDL is for “show” only. You don’t need it to rent or pick up the car. Cops don’t ask for it - but if by some fluke they do… you better have it."}, {"username": "Keith Al-Dijaili", "comment_text": "You don’t need an international license. Italy and America have an agreement that we can drive with our own license"}, {"username": "Heath Conn", "comment_text": "Simple. I’ve done it many times. Driving in Naples is different."}, {"username": "Chris Atkinson", "comment_text": "Easy! You don’t need international drivers license. A valid US or Canada is sufficient. Go with full coverage from rental. Best deals I’ve found over the years are through Europcar. Book in North America through website before you travel. It’s as easy as using a car rental app off your phone…."}, {"username": "Michelle Murphy Margolati", "comment_text": "We had a car in Tuscany so we could get to places easy. It was great. I wouldn’t drive in the cities. Very congested and parking is not easy."}, {"username": "Pearl Lucero", "comment_text": "Not hard, get an International driver’s license at AAA. And you are set. Navigating the Italian signs is another thing altogether. NEVER drive in Milano!! Or Rome/Florence. You only need a car to travel through Tuscany/Umbria etc."}, {"username": "Roe Gallo Saks", "comment_text": "Easy peasy. However, not advisable on the Amalfi coast for a several reasons - it’s dangerous, nightmare to park and you can on drive on designated days."}, {"username": "Christy Lynn", "comment_text": "Super easy. Drove all around Milan and countryside. Lots of round-a-bouts but super easy to navigate and drive."}, {"username": "Jim Garner", "comment_text": "I'm doing it right now (greetings from the Aosta Valley). We used trains exclusively on our last trip and they are great! This trip, we wanted to tour some of the more rural areas and chose to drive. I've found that finding a charging station is more challenging than I had anticipated but it has worked out just fine. No real problems to speak of."}, {"username": "Nick Pignatello Jr.", "comment_text": "Easy. Can’t be timid otherwise never get anywhere. Careful where you park Open window use hand gestures and horn."}, {"username": "Cerese Nadine", "comment_text": "Not difficult at all. I have done it. Rented a car from FCO and drove to, around, and back from Positano. When you are on the A-1 just watch. When you see hazards go on be prepared to break."}, {"username": "Tina Bellitto", "comment_text": "Easy did it in October"}, {"username": "Vadim Gotovsky", "comment_text": "We do it all the time. Our vacations wouldn’t be so exciting and enjoyable without it. There so many places that is simply impossible or practical to visit if you have no car. Driving in Italy is not that difficult as you might think. Just avoid driving in large cities.\nRenting a car is easy. Book in advance on any reliable web site. I drive equally well stick or automatic but if you only drive automatic it can be more expensive but not much and availability is less. So book far in advance.\nCheck with your CC whether they provide coverage(many do) then decline all add on insurance at rental company.\nAnd get international driver license for peace of mind in case cops ask for it. You don’t need it to rent a car.\nThat’s about it. Good luck!"}, {"username": "Etschi Bruckner", "comment_text": "have you ever driven in another country ( Canada doesn´t count) ?"}, {"username": "David Perillo", "comment_text": "You can ofcourse but as others have said. It can be a nightmare. If you’re goal is to see major towns and cities. Train is the way to go. If you want to go off the beaten track then sure. Rent a car. And be sure to get the maximum insurance on offer."}, {"username": "Mauricio Sanhueza Kegan", "comment_text": "Depends on where you go. In big cities avoid it. In the country side or Sicily is a must. In my opinion"}, {"username": "Jess Baloh Wuslich", "comment_text": "Easy"}, {"username": "Mala Himraj", "comment_text": "Simple.. I just did it"}, {"username": "Jenny Frank", "comment_text": "Easy"}, {"username": "Michelle Cotoni", "comment_text": "I wouldn’t recommend driving yourself. I think it would add much stress to your vacay!"}, {"username": "Adele Long", "comment_text": "Not difficult at all. You will need to get an international license."}, {"username": "Beth Hiner", "comment_text": "Not difficult at all. Go to AAA and get an International Driving License."}, {"username": "Bob Lampo", "comment_text": "Not really. Need an international drivers permit. Around $20 at a AAA office. Better learn the road signs and not just the international signs, learn the worded signs. You’re wasting time and money driving in a city. Don’t park unless you know it’s public parking.\nOnly drove in areas like the Tuscan or southern or Sicilian countryside. A waste anywhere else.\nTrains taxis and walk are by far the best"}, {"username": "Jaime Cleek", "comment_text": "Need an international drivers license. Get familiar with the ZTL(I think that’s the acronym) zones and get the insurance they offer"}, {"username": "Ruth Mattingly", "comment_text": "And buy insurance from the car rental company at the counter."}, {"username": "Sarit Rolnik", "comment_text": "You just need an International Driving license"}]}, {"id": "2212563579142720", "text": "Hi, can u please recommend a very good hotel to stay in Milan or airbnb . I need it to be near all the shopping places and near the station.\n\nThank u", "link": "facebook.com/groups/1373361046396315/permalink/2212563579142720/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.dpbolvw.net/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187849-d1213\n0410-Reviews-NY\nX_Hotel_Milan-M\nilan_Lombardy.h\ntml"}, {"username": "Cindy Gallen Barton", "comment_text": "Park Hyatt is not far from station and right near the Galleria Vittorio Emanuele II"}]}, {"id": "2212658789133199", "text": "Recommendations for Olive oil farm visits in Tuscany please", "link": "facebook.com/groups/1373361046396315/permalink/2212658789133199/", "likes": 5, "comments": [{"username": "Charlotte Paul", "comment_text": "What time of year?"}, {"username": "Erin Grosh", "comment_text": "We had a lovely tour of Frantoio Tisarelli in July. It was a tasting with extra snacks as well. It’s not processing season right now, so their machinery wasn’t running but we got a great explanation of how it all works. It was a surprise highlight."}, {"username": "Lora Ruscitti Covington", "comment_text": "We went here and it was wonderful.\n\nhttps://\nwww.countryslowl\niving.com/"}, {"username": "Jim Kelleher", "comment_text": "Ravagni, just outside Anghiari"}]}, {"id": "2212860929112985", "text": "Hi, we are due to go to Rome on 26th August. After reading the advice about crowds am slightly nervous as travelling with kids. I only discovered this group recently 🙂 Wished had found it before making the bookings.\n\nWe are staying in Hu Roma camping village near Rome Aurelia. Just wanted to check how is the area and anything to be aware about.\n\nMany Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2212860929112985/", "likes": 1, "comments": [{"username": "Agne Krause", "comment_text": "We just got back. There were crowds, but absolutely manageable. We went on tours either late or early in a day. I was worried so much about crowds and heat before our trip because of these fb groups, but everything was perfect!"}, {"username": "Jocelyn Blanke Sia", "comment_text": "We’ve been travelling in Italy for 3 weeks with kids, it is what you make it. It’s been great!"}, {"username": "निनावी सहभागी", "comment_text": "Thanks 😊"}, {"username": "Bianca Balderas-Saenz", "comment_text": "There is crowds but it’s manageable we have had a very good experience. To avoid the crowds we have been doing every early\nMornings, heading back to rest during the hottest time of the day, and then coming back out at night."}, {"username": "Santo Finocchiaro", "comment_text": "You can Google the hotel address. When it comes up. It will show you what is around the area. Yes there will be lots of tourist. Try to plan ahead."}]}, {"id": "2212865195779225", "text": "Hello! Seeking advice from a local!\nI need to get a document posted to Italy while I’m on holidays. I heard I can get it sent to a post office to pick up if I put the words “Fermoposta” after my name. Does that sound correct? And then just put address of closest post office on the envelope under my name? Thank you so much! (I also saw there was a fee to do this and that’s ok. Just checking this process will work!)", "link": "facebook.com/groups/1373361046396315/permalink/2212865195779225/", "likes": 1, "comments": [{"username": "Leila Jane", "comment_text": "Can you do it electronically instead? The Italian post office was notorious for losing or not delivering mail when I lived there."}]}, {"id": "2212866749112403", "text": "Any recommendations (good or bad) of which tour group to choose from Florence, to visit Siena and pisa on a day trip? Bonus points for smaller tour groups for a party of 5 :)", "link": "facebook.com/groups/1373361046396315/permalink/2212866749112403/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Florence/\nTuscany-Day-Trip\n-from-Florence-\nSiena-San-Gimig\nnano-Pisa-and-L\nunch-at-a-Winer\ny/\nd519-5070TUSCANY\n?pid=P00070587&\nmcid=42383&medi\num=link&medium_\nversion=selecto\nr"}]}, {"id": "2212762065789538", "text": "Going to Italy in April and have purchased tons of excursions for the time that we are there. I want to give the brochures to all of the places that we are going to as Christmas gifts to my family in their new luggage on Christmas. Where can I get the brochures for these places in color? I’ve looked on line and I think I can get them for some places but not sure how to get all of them. Any ideas?", "link": "facebook.com/groups/1373361046396315/permalink/2212762065789538/", "likes": 3, "comments": [{"username": "Rachael Richardson", "comment_text": "I normally go on website or internet print pictures with an explanation and laminate if I’m giving as gifts some places don’t have brochures now sadly"}, {"username": "Tracy Foss", "comment_text": "Can't you print them in colour?"}, {"username": "Kejdi Okej", "comment_text": "I normally go on website or internet print pictures with an explanation and laminane if l m giving as gifts some places don t have brochures now sadly"}, {"username": "Sigrid Cormier", "comment_text": "Ask very nicely at a travel agency? Or at the local tour company?"}, {"username": "Fetchin Gretchen", "comment_text": "Check with tour operators or tourism boards.\nGoogle search provided some links to tourism boards in Italy:\n\n* **ENIT - Italian National Tourist Board:** This is the official tourism board for Italy. They have a website in English with information on all regions of Italy.\n[Image of ENIT - Italian National Tourist Board website]\n* **Visit Italy:** This website is also run by the Italian government and has information on all regions of Italy.\n[Image of Visit Italy website]\n* **Italia.it:** This website is a collaboration between the Italian government and the private sector. It has information on all regions of Italy, as well as city and town guides.\n[Image of Italia.it website]\n* **Regional tourism boards:** Each region in Italy has its own tourism board. You can find a list of regional tourism boards on the ENIT website.\n[Image of Regional tourism boards in Italy website]\n* **City tourism boards:** Each major city in Italy has its own tourism board. You can find a list of city tourism boards on the Visit Italy website.\n[Image of City tourism boards in Italy website]\n\nI hope this helps!"}, {"username": "Rhona OConnor", "comment_text": "Make it up like a, little book your self. Use something like Canva or PowerPoint or you can get photo books online that you fill in the photos and text. That would be a great gift!"}]}, {"id": "2212909432441468", "text": "Ciao ♥️ I am going to Venice and Florence. And I'm wondering what's the cheapest way to get from Venice to Burano? And another question. How can you get from Florence bus station Villa Costanza to city centre? And where can you pay for a transport ticket? Any any idea what is the best thing to see in Florence? I will be there only for one day. Thanks so much and sorry for my English ☺️", "link": "facebook.com/groups/1373361046396315/permalink/2212909432441468/", "likes": 1, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 8, "comments": []}, {"id": "2212914175774327", "text": "Can anyone suggest a coastal location for a day trip from either Rome or preferably Florence? We'll be travelling by train so it needs to be easily accessible by public transport or organised trip.\n\nAlthough I am beyond excited for our adventures around Italy I would really like one day of relaxation on the beach/coast & ideally a dip in the sea! 😎", "link": "facebook.com/groups/1373361046396315/permalink/2212914175774327/", "likes": 2, "comments": [{"username": "Marna Somariva", "comment_text": "From Florence you can easily reach Viareggio by train. Nice promenade with art deco architecture and long sandy beach (not free beach)"}]}, {"id": "2212900835775661", "text": "#italy #italien #roma", "link": "facebook.com/groups/1373361046396315/permalink/2212900835775661/", "likes": 23, "comments": []}, {"id": "2212918545773890", "text": "Firenze", "link": "facebook.com/groups/1373361046396315/permalink/2212918545773890/", "likes": 8, "comments": []}, {"id": "2212929062439505", "text": "Hello👋🏼\nDo you have any recommendation for a small sweet not so tourist village near Rome?\nMax 2 hours by train❗️\nThank you 😊", "link": "facebook.com/groups/1373361046396315/permalink/2212929062439505/", "likes": 1, "comments": [{"username": "Valentina Saltarelli", "comment_text": "Calcata\nCaprarola\nOrvieto\nGaeta"}]}, {"id": "2212949075770837", "text": "If you’re traveling on the trains, I’ve taken some pics that might help you out.\n1. Here’s a labeled picture I made that tells you how to read the screen (at Roma Termini, probably similar at other stations but I don’t want to assume). I know some have given tips on what to look for but I’m a visual person so if I had this, it would have made it a little less stressful.\n2. General picture of layout of some of the platforms.\n3. If you decide to use the bathrooms at the station, you’ll have to pay 1 euro, plus side, the gates like the one shown below take credit cards (you will see a screen on the top of the metal compartment, this was the exit gate)\n4. Once you head to your platform, you’ll come across these gates where you’ll have to scan the QR code on your ticket to pass.\n5. On each car you’ll find the train car number followed by the seats available closest to the door.\n6. We had base business seats, this was our seat space.\n7. The luggage rack above the seats was the main space I saw for storage. That white luggage is a large one and the green one is medium sized. My husband had to help another passenger put her white luggage up there because of the size and weight.\n8. Screen on the train that tells you about upcoming destinations.\nIf I’ve got any information wrong, please let me know so I can edit my post. I don’t want to misdirect future passengers!", "link": "facebook.com/groups/1373361046396315/permalink/2212949075770837/", "likes": 499, "comments": [{"username": "Marina Trainor", "comment_text": "Peter Bella"}, {"username": "Linda Brocksmith", "comment_text": "Thank you so much!"}, {"username": "Patricia Archuletta", "comment_text": "Thanks!!!!! Blessings to you!"}, {"username": "Jane Pryor", "comment_text": "Thanks so much"}, {"username": "Kelley Koboldt", "comment_text": "Jane Wetzel- great tips"}, {"username": "Marie Gilchrist", "comment_text": "Such a thoughtful post, thank you"}, {"username": "Franco Gengotti", "comment_text": "Bravo Mbell!"}, {"username": "Giovanna Galeano", "comment_text": "Great information. Thank you"}, {"username": "Gretchen Barretto", "comment_text": "Mel CastilloJoash Isaiah CastilloJoachim Miguel Castillo handy!"}, {"username": "Justine Goodman", "comment_text": "Thankyou so much for doing this. I am very much a visual person too so really helpful especially seeing it will be my first time there."}, {"username": "Andie Clark", "comment_text": "Great info thanks!"}, {"username": "Janette David Payne", "comment_text": "Thank you so much … by October, with all the information this wonderful group shares, we’ll look like we’ve been here before !!!"}, {"username": "Caroline Neave", "comment_text": "Great information and post 🙌🏼"}, {"username": "Diane Smith Frederick", "comment_text": "Thank you!"}, {"username": "Judi Lynn Durham", "comment_text": "Are there folks there to help you… it just seems so confusing, I have never done this before"}, {"username": "Melissa Hayes", "comment_text": "Brandy Wine Huffman we are going to be lost 🤣🤣"}, {"username": "Claire Duffy", "comment_text": "Thank you - very helpful 🙏🏻"}, {"username": "Kaye Old", "comment_text": "Anita Hamilton"}, {"username": "Carrie Lamm Bishop", "comment_text": "Thank you!"}, {"username": "Stella Marca", "comment_text": "Thank you so much for taking the time to share all this information. My sisters and I are going to Italy to our home town at the end of the month and I’m quite nervous about the trains."}, {"username": "Patrizia Greco", "comment_text": "Mbell Arteaga there were not another luggage place where you don’t have to lift it up ?"}, {"username": "Daniela Horth", "comment_text": "Awesome info! Are there signs on the platforms indicating where each numbered train car will stop when the train arrives? … So you know on which section of the platform you should stand to be near the right train car? We almost missed a train in France a few years ago as we had to sprint to the other end of the platform lol."}, {"username": "Deborah Wilson Melton", "comment_text": "Great info, so many people look at destinations and get really messed up. The # is the important one"}, {"username": "Colleen Jennings", "comment_text": "This will be so helpful to so many travellers - thank you for posting."}, {"username": "Sarah Lynn", "comment_text": "Once you scan your tickets to enter the platforms, you will no longer have access to a restroom until you're on the train."}, {"username": "Salia Ricciardelli", "comment_text": "Great idea!!"}, {"username": "Sandie Nicole", "comment_text": "Bridie Kennedy"}, {"username": "Brenda Harris Dixon", "comment_text": "Lauren Nicole Dixon"}, {"username": "Roxy Nardella", "comment_text": "Thank you, thank you. That was very considerate of you. I hope to travel next year with my family so this is a very helpful post to add to my information file that I’m collating 😊"}, {"username": "Teena Leuba", "comment_text": "Thanks for info. Denise Bibby"}, {"username": "Jan Buess", "comment_text": "TY!"}, {"username": "Molly Daniels VanDeRiet", "comment_text": "Thank you for posting this, from one visual learner to another."}, {"username": "Robin Bryan", "comment_text": "This is a wonderful post with helpful information. Thank you!!"}, {"username": "Cleo Forrey", "comment_text": "Great post! Thank you"}, {"username": "Eileen Milazzo-Elliott", "comment_text": "Allison Elliott you probably already saw this"}, {"username": "Melissa Cortez", "comment_text": "Excellent post for others to get a visual."}, {"username": "Nydia Bryan", "comment_text": "❤️❤️❤️❤️❤️"}, {"username": "Suzie Mendoza", "comment_text": "We are planning our trip for May. Very helpful. Thank you."}, {"username": "Rhi Marie", "comment_text": "Matt Scott like my comment so I can come back to this"}, {"username": "Natasha MacMillan", "comment_text": "Grm Funcoola"}, {"username": "Todd N Nicole Clarke", "comment_text": "This was our luggage space in business class on our train"}, {"username": "Todd N Nicole Clarke", "comment_text": "Todd N Nicole Clarke"}, {"username": "Julie Innes", "comment_text": "Kane Innes"}, {"username": "Nicole Levich", "comment_text": "Mike Levich"}, {"username": "Mugette Matos-Barber", "comment_text": "This is the kind of posts that we want to see more. I am also a visual learner and obsess about which way to go when we get off the trains. I love using the google little man to walk around the map 😀Thanks so much for this post!!"}, {"username": "Melissa Gracie", "comment_text": "Awesome thank you"}, {"username": "Cathy Ann", "comment_text": "Thank you 😊"}, {"username": "Lorraine Croker", "comment_text": "Thank you for sharing"}, {"username": "Lorraine Demers Melanson", "comment_text": "Lisa Moore, Christiane Fera, Rachelle Demers. Good info on trains here"}, {"username": "Deanna Haynes", "comment_text": "This is great, thank you! Very helpful🤓"}, {"username": "Ange Cimino", "comment_text": "This is fantastic thanks for taking the time to share."}, {"username": "Andre Le Huray", "comment_text": "Naomi Murphy"}, {"username": "Tracey Finney", "comment_text": "Thanks so much Mbell. This is very helpful. We are travelling to Italy in 28 days. Very excited. We will be catching a few trains and this information is so helpful. Hope you have a great holiday😊"}, {"username": "Carmen Kitchen", "comment_text": "Mbell, you are a good person. Thank you. 🌻"}, {"username": "Rebecca Yeoh", "comment_text": "Great post! Another thing to add is that the platform number sometimes doesn't appear on the board until 10 mins before your train departs. I think they do it this way so that there aren't crowds of people waiting on the platform, making it harder for people to exit the platform."}, {"username": "Jeanette Ramos-Gonzalez", "comment_text": "How far are these screens to the actual platforms ?? And are there clear directions to get to the correct platform ?"}, {"username": "Tammy Moore", "comment_text": "Thank you so much. How much in advance can you get your train tickets"}, {"username": "Tammy Moore", "comment_text": "We are going in Oct. And we have booked our trip through Cosco too. When did they book your train tickets. And did you have any issues with your trip booking through Cosco??"}, {"username": "Sam Mah", "comment_text": "I love it when people take the time to fully explain things to others on a help page, unlike those really annoying people that like to deride others when they find a post/question they don't like (just scroll past if you don't like something)."}, {"username": "Nancy Deslandes", "comment_text": "Sarah :)"}, {"username": "Anna-Maria Lopopolo", "comment_text": "Thank you as I had read a lot of alarmist post about lack of places to put your luggage and it’s not safe which is not true"}, {"username": "Tina Salser Greer", "comment_text": "Thank you for sharing!"}, {"username": "Paulette Deschenes", "comment_text": "Thank you! Very helpful!"}, {"username": "Maria Caccavale Howard", "comment_text": "Great post and so much helpful info. Love all the pics they really help a lot. So nice of you to take the time to do this. Heading there in September and appreciate this info so much!"}, {"username": "Tim Hill", "comment_text": "Thank you"}, {"username": "Karina Rounaque", "comment_text": "We are family of 4 and would be taking 3 (28”) large luggage. Do you think will fit on the rack or there is other area for large luggage."}, {"username": "Donna Spencer", "comment_text": "Lynn Mcconnell"}, {"username": "Donna Parrish", "comment_text": "Grazie!"}, {"username": "Kay Jenkins", "comment_text": "What a very useful post, thank you for the info and the time taken to explain the images"}, {"username": "Peggy Frain", "comment_text": "So helpful! Thanks😁"}, {"username": "Cindy Whittaker Fulkerson", "comment_text": "Nicole Murphy"}, {"username": "Francesca Veneziano", "comment_text": "One thing to add is that when you look at the final destination that literally means the final destination. We were confused this past week because our ticket said to Lemezia but the board said Reggio Calabria. We booked the \"direct\" train so we literally thought the train went directly to Lamezia without stopping.\n\nIt was our first time on a train so that's coming from a newbie standpoint."}, {"username": "Pamela Ruesewald Litton", "comment_text": "Carol Ruesewald Hajovsky"}, {"username": "Julie Koenig Cooper", "comment_text": "Thanks for sharing!"}, {"username": "Erin Lynch Montellione", "comment_text": "So nice of you to share all of this information."}, {"username": "Mindy Relos Penrose", "comment_text": "Brett Penrose"}, {"username": "Cindy Holtfreter", "comment_text": "You are an earth angel. Thank you. So very helpful and settling.\n💕💜💕🙏"}, {"username": "Grace Rogers", "comment_text": "Thank you so much for this. This will be useful for us in 2 weeks ❤️"}, {"username": "Diane Davis Lawyer", "comment_text": "Here's another!"}, {"username": "Matt Henderson", "comment_text": "The thing that I found confusing about the trains in Italy was stations with names similar to those of a city’s main train station."}, {"username": "Kristen Smith", "comment_text": "Thank you so much!!"}, {"username": "Annette W Bryant", "comment_text": "Thank you!"}, {"username": "Kerri Tobin Hanson", "comment_text": "Thank you!!!"}, {"username": "Denise Pirchio Zappia", "comment_text": "I can’t thank you enough!!!!!!!"}, {"username": "Lois Midkiff", "comment_text": "Lori Potter Farmer Carey Spencer Mooney"}, {"username": "Diana Steyn Levine", "comment_text": "thank you - great info ❤️"}, {"username": "Elizabeth Yu", "comment_text": "This is great! Thank you very much for posting this."}, {"username": "Lorrie Leffel Wolfe", "comment_text": "Lisa Spalding Richter, Tammy Pitcock, Pam Spalding Carter"}, {"username": "Sharon Lee", "comment_text": "Thanks 🙏"}, {"username": "Mandy Tiffen", "comment_text": "Great post! 👍 Thank you!"}, {"username": "Mandy Pusateri", "comment_text": "Wow!! Thank you!!"}, {"username": "Leila Perez", "comment_text": "Ben Perez Sherry Bruno"}, {"username": "MaryLou Capobianco", "comment_text": "Very helpful, thanks"}, {"username": "Linda Marie DeBoo", "comment_text": "Thank you!"}, {"username": "Alane Riley", "comment_text": "Thank You!"}, {"username": "Barbara McCarthy Genovese", "comment_text": "Thank you for sharing"}, {"username": "Gay Bell DiBartolomeo", "comment_text": "Gayla Faye Bell"}, {"username": "Suzanne Barnes Porcellato", "comment_text": "Thank you so much for taking the time to share this information. I am heading to Rome in a few weeks and a little scared about navigating the trains"}, {"username": "Piyuma Jayasundara Boteju", "comment_text": "Thank you for sharing."}, {"username": "Joanita Wiens", "comment_text": "Kris Harder"}, {"username": "Piyuma Jayasundara Boteju", "comment_text": "Piyusha Boteju"}, {"username": "Ashley Kirby", "comment_text": "Is scanning the QR code the same as validating your ticket?"}, {"username": "Pam Lewis", "comment_text": "Thanks"}, {"username": "Cam Ross Clow", "comment_text": "Great info, Thanks for posting!!"}, {"username": "Cathy Saultzman", "comment_text": "Donna Clemons Curry"}, {"username": "Karen Duynhoven", "comment_text": "Very helpful thank you!"}, {"username": "Karen DeSena Corrao", "comment_text": "Thank you. Can you buy tickets the day of traveling?"}, {"username": "Beth Erica", "comment_text": "Rhea Katz Kleeblatt"}, {"username": "Krystal Apolinaro", "comment_text": "This is great info. I wish I had known this before travel!"}, {"username": "Amy Stolp", "comment_text": "Thank you"}, {"username": "Lisa Soto-Fiscella", "comment_text": "You are awesome! Thank you so much. I’m also a visual learner. Saving this post. Traveling the end of September."}, {"username": "Tracy Foss", "comment_text": "Thanks"}, {"username": "Tony Tiricola", "comment_text": "Steven Tiricola"}, {"username": "Mary Elaine Hauser", "comment_text": "Catherine Suzanne helpful train info"}, {"username": "Mary Elaine Hauser", "comment_text": "Thank you so much for sharing to help others! Will be very helpful for us."}, {"username": "Coco Cole", "comment_text": "Thanks!"}, {"username": "Caroline Muir-Varanesi", "comment_text": "Michael Varanesi"}, {"username": "Chiara Normanno", "comment_text": "Great job! I wanted to do the same but thought that people don't use search bar for even the little most repetitive things so I gave up lol but kudos"}, {"username": "Cherie Coe", "comment_text": "Quentin Coe"}, {"username": "Trish Dominguez-Perez", "comment_text": "Wow, super helpful, thank you!"}]}]