[{"id": "2201108860288192", "text": "Hi, I saw a post about visiting smaller cities in Italy. I really enjoy local culture over crowded tourist spots. We are interested in the Amalfi Coast region for a trip next September. What cities would you recommend? Grazie 😊", "link": "facebook.com/groups/1373361046396315/permalink/2201108860288192/", "likes": 1, "comments": [{"username": "Alice Francesca", "comment_text": "Amalfi is super turistic.;) everyone in this group goes there"}, {"username": "Robin Burrell", "comment_text": "It’s a mob scene. Not culture, it’s beautiful, but not what you just described you are interested in."}, {"username": "Brad Nelsen", "comment_text": "For a smaller, village feel, go to Praiano, Maiori or Minori."}, {"username": "Gina Rovello Keenan", "comment_text": "Very interesting post. Have you been to Italy before? When I think of culture over crowded tourist spots, the last place I think of is the Amalfi Coast. While there are smaller, quieter towns than Sorrento or Positano, I think of the Amalfi Coast as a resort area with the beach. If you want culture over tourist I would think of Bari, Tuscany, Sicily, or Emilio Romana regions/areas. Just my opinion."}, {"username": "JeriLynne Clifford", "comment_text": "We love the small towns in Tuscany, Emilia-Romano and Piedmonte. We immerse ourselves in the culture. The cities are beautiful for sure but not our focus"}, {"username": "Roland Trego", "comment_text": "The Amalfi Coast is enormously popular for a reason. In peak season, yes, it is very busy. In the evening, many of the day trippers return to Sorrento, and it gets quieter. If you are going in September, I don't think you will experience the crowds many are describing. Honestly, all of the villages are wonderful. My favorite is Positano. Ravello is wonderful, too. If you are going to stay on the Amalfi Coast (instead of in Sorrento or, say, Capri), I personally suggest choosing a village with ferry service. If you want to take the ferry, you don't want to first have to take a bus or taxi to get to it."}, {"username": "Dan Adams", "comment_text": "Ravello is awesome and easy access to everything Amalfi."}, {"username": "Sarah Williams", "comment_text": "Amalfi and Positano are much more beautiful in the evening when the boatloads of day tourists have gone. In the day you can skip the crowds and walk the path of the gods or visit minori or maiori or even walk the 20mins over to Atrani from Amalfi."}]}, {"id": "2201183846947360", "text": "Are there any special rules for parking for a few hours visit in Perugia, Assisi, l’Aquila, and Castelmezzano, please? I mean something like limitation during the day/areas etc. Or we can just find any parking place and pay the fee? (we will be accomodated elsewhere). Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2201183846947360/", "likes": 2, "comments": [{"username": "Benedetta Vanni", "comment_text": "Blue lines = metered pre-paid parking --> look for machines in the area, carry coins\nZTL = you cannot enter the area, that's reserved for residents\n\nBut: as for Perugia, leave your car in a free parking lot in the valley and take the mini-metro uphill!"}, {"username": "Giovanni Pianigiani", "comment_text": "This sign means you can park, but just for the specified amount of time (you must indicate at what time you started parking)"}]}, {"id": "2201110603621351", "text": "Euros. I did a search on this site, but didn't see anything on suggested increments? I assume you should take smaller bills for tipping and such. Is there a need to take larger increments? We will be using a cc for restaurants and larger purchases. Thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2201110603621351/", "likes": 7, "comments": [{"username": "Liz Cooper", "comment_text": "Smaller is good"}, {"username": "Jaime Cleek", "comment_text": "Get smaller bills not 100"}, {"username": "Penny Bellofatto Westberry", "comment_text": "Italian merchants love when you give them coins, in my experience. They seem to always need and welcome same."}, {"username": "Sue McIntyre", "comment_text": "I don’t even like to bring 50s! The smaller the better. And save your coins for the toilets or small tips."}, {"username": "Miyuki Kanno Paul", "comment_text": "Smaller bills are always better."}, {"username": "Judy Jamieson Pisano", "comment_text": "Many places won’t accept large bills because they don’t keep a lot of change, and there aren’t many places to change large bills. Banks will not do it."}, {"username": "Lauran Cantwell", "comment_text": "5s & 10s with a few 20s thrown in there."}, {"username": "Jim Kelleher", "comment_text": "You should have coins for tipping. Coins come in increments as large as €2, and excluding maybe a tour guide, that’s a typical tip amount, if at all. Tipping isn’t the custom in Italy not because consumers are less generous, but rather because workers are better compensated."}, {"username": "Marsha Luring", "comment_text": "Our hotel broke 50s when needed"}, {"username": "Kris Beacham", "comment_text": "A lot of their denominations for smaller bills are actually coins. Like $1 or 2. There isn’t much tipping as they have VAT on meals. If you’re using a Cc for means you’re fine. You’ll really be using cash for off the part spots like farmers markets etc where some thing may be cash only.\n\nYou can get them at an atm there. The exchange rate or fees is basically peanuts. Like .50 here or there depending on the day. It you so hit an ATM get like 2-300 at a time and don’t waste fees $20 yourself to death."}, {"username": "John Green", "comment_text": "Take small bill, had large bills and had a hard time getting broke to smaller ones. Even went into a bank and the said, no change."}, {"username": "Domenica Calvene", "comment_text": "You don't need to tip...small amount of cash is good for markets & taxis.Euros for toilets.I used both."}, {"username": "Marissa Wilson", "comment_text": "Coins needed for some public restrooms!"}, {"username": "Maria Brozou", "comment_text": "Smart trick. When you take out money at the atm force it to give you 20ies. For instance 130 or 80. It will give you 50+4*20 and simply 4*20. However if you withdraw let’s say 200 it will be 4*50."}, {"username": "Graham Sherlock", "comment_text": "You need very little if any cash, use your CC."}, {"username": "Christine Flavia", "comment_text": "In Tuscany & Umbria now. Small bills & 1 & 2 € coins a void thing. Must have for toilets- usually 1coin. Bottles of water usually 1"}, {"username": "Cindy Frenette Pawley", "comment_text": "I just went to order mine at the bank. They said they can request small bills but not the increments I requested. They told me I Jane to just take what the exchange gives me."}, {"username": "Renae Larcus", "comment_text": "Small bills. It’s basically tip and gelato money. 😄"}, {"username": "Frannie Kaplan", "comment_text": "You don't need to tip but 5 and 10 are the smallest bills or you cN use Coins. Not everyone breaks or accepts 100 eur bills"}, {"username": "Vasthi Cheddar", "comment_text": "I exchanged 500€ in 5s, 10s, and a few 20s before traveling."}, {"username": "Steve Grossman", "comment_text": "You tip with coins only. One or two euros per person max"}, {"username": "Alexandra A Welker", "comment_text": "5s,10s,20s"}, {"username": "Raquel Pickering", "comment_text": "5s and 10s and handfull of coins for tipping."}, {"username": "Heather Lynn Brown", "comment_text": "We went to banks and used their ATM's and were able to request smaller increments. Fees were very low when you used a bank Instead of an other ATM.... like 2$. We Requested 20s and did fine the entire time."}, {"username": "Clarissa Rava", "comment_text": "I work in a shop and we are happy with credit cards and coins but remember that not everyone in italy accept credit cards because they don’t want to pay taxes. Avoid those places and always ask if you can pay with card before buying anything. Groceries shops always accepts card payment and some of them don’t even have the cashier working during summer so only automatic register (but you can pay with cash on them as well)"}, {"username": "Tammy Obgurn-Rice", "comment_text": "Larry Rice"}]}, {"id": "2201201266945618", "text": "How do we pack pasta sauces, lemoncello, wine from Italy in checked-in bag? Will it not break since it’s glass? Any packing instructions required so it doesn’t break?\n\nThanks for help ! Pic to get attention", "link": "facebook.com/groups/1373361046396315/permalink/2201201266945618/", "likes": 3, "comments": [{"username": "Jenn Messina Babore", "comment_text": "I put our bottles in an old (clean) sock and then in a large ziplock bag surrounded by clothes. We had 4 bottles of wine and 6 bottles of olive oil and they all went in cargo through 4 different bags. Not one broke. We also had pasta, no issues. Plus one bottle of pesto."}, {"username": "निनावी सहभागी", "comment_text": "Thanks for the information!"}, {"username": "Kimberly Lynne", "comment_text": "I purchased most my olive oil in cans. One came home dented but no leaks. I had glass jars of pistachio cream that I wrapped in clothing.\n\nWe used one half a suitcase for these purchases, padding with clothing and also wrapping in ziplock bags.\n\nOur wine and Limoncello we split shipping with travel friends."}, {"username": "Karen Ries", "comment_text": "I always bring bubble wrap with me and the Built wine bags for bottles."}, {"username": "Suz Wilson", "comment_text": "Where did you find pistachio cream?"}, {"username": "Dawn Wilhelm Harvey", "comment_text": "I packed some bubble wrap for this reason and my parking cube set came with a waterproof bag and shoe bag I didn’t use for other items but I still packed them so I could put the wrapped bottles in them for the trip home - a little extra protection in case something broke."}, {"username": "Bronwyn O", "comment_text": "There are inflate-able bubble wrap bottle protectors you can buy, they take up very little space until you inflate them."}, {"username": "Linda Miller", "comment_text": "Bubble wrap, there is bottle shaped bubble wrap also."}, {"username": "Alicia Vargas", "comment_text": "I use my clothes to wrap around the bottles and cushion with more clothes in between."}, {"username": "Maria O'Callaghan", "comment_text": "Pack it well, I had a bottle of Scotch break, my clothes were soaked & it ruined a new dress I bought 🙁"}, {"username": "Sigrid Cormier", "comment_text": "I bring bubble wrap with me. Package in 5hat then double plastic bag it.\nThen I make sure the bottle is in the middle of the suitcase with nothing hard next to the bottle(S). So far no problems."}]}, {"id": "2201218323610579", "text": "I’ve worked sooo many hours figuring out our plan for my 40th for me and my husband. Beginning of September. 6 nights. We’re spending first and last night in Rome and the rest in Sorrento. Here’s our plan. Please tell me what you think! I am a mom of two little kids and I don’t stay up late or party much. 😆\n-Depart US at 2:45. Take melatonin and try to sleep on the plane (hoping to fall asleep around 7pm Texas time. Will try to be falling asleep by 8pm a few nights before we leave).\n\nDay 1\n-Land in Rome 8:00am (1am to us), leave bags with hotel in piazza navona, go to a cafe/hang/explore. Go with rome time. No naps.\n- do Heart of Rome walk around sunset, spend about 2 hours: Shop, visit pantheon, Jewish ghetto, end in campo di fiori for dinner. (Or maybe do it backwards and end for dinner at Spanish steps area?)\n\nDay 2:\n-prime experience Vatican tour with breakfast. (Already booked)\n-Check out of hotel, board train to Naples, stop long enough to have pizza.\n-private car pick up to take us to hotel de la ville. Check in, relax, explore Sorrento, beach maybe?\n\nDay 3: Amalfi\n- this is still very up in the air. I think we’ll ferry out to see the view of the coast from the water. Then start in amalfi/bus to Ravello, have lunch, hang out, explore. Car to positano. Hang out on the beach, have dinner. Private car home.\n\nDay 4: capri\n- sleep in, do whatever, shop, etc in Sorrento.\n- capri night tour, departs at 3:30. Do the grottos, find a beach (which one?), have dinner and head home by 11:00. 😴\n-considering ischia instead of capri 🤔\n\nDay 5:\n- no plan! Enjoy Sorrento.\n\nDay 6: back to rome\n- relax in the morning\n- somehow get to pompei/Vesuvius on our way to rome via Naples since it’s on the way.\n- no plan once we get to rome, maybe visit colosseum, a museum, not sure? Do a golf cart tour? 🤷🏼‍♀️\n- dinner somewhere fun.\nStay at a hotel- haven’t decided what area yet for our last night. Maybe with a view of the colosseum?\n\nDay 7: fly home\n- flight leaves at 2pm, so take it easy morning, get bf, leave for hotel around 11am\n- arrive at airport at 11:30am. Leaving us 2.5 hours to get to the plane.\n\nThank you!!", "link": "facebook.com/groups/1373361046396315/permalink/2201218323610579/", "likes": 31, "comments": [{"username": "Lauren Swanteck Myler", "comment_text": "You would need another week to really explore these areas. I wouldn’t do this, but this may be all of the time you have and since you feel strongly about where you want to go, I wouldn’t want to dissuade you."}, {"username": "Jenny Payne", "comment_text": "Book soon your last night in Rome as it is still very busy since Covid🌻"}, {"username": "Basia Szokarski", "comment_text": "Ok you will most likely not sleep on a flight departing at 3pm. On arrival is when you'll be sleepy. Hope you can check in early, but if not, please take a nap for about 2 hours when you do check in. This nap will keep you going till 10-11pm. Otherwise you'll be falling asleep at 6/7pm and then waking up in the middle of the night wide awake and sleepy again in the morning when you should be going out. Save the melatonin or an otc sleep aid to take when you go to bed for the night to help you sleep through the entire night.\nAlso when you do take that nap...set your alarms several feet from the bed to force you to get up. It will be really hard initially however after an hour, a shower and cappuccino I promise you'll feel much better. This is the advice most people thank me for."}, {"username": "Sonita Sandhu", "comment_text": "That’s an ambitious plan! There is so much to see and do in Rome. Just make sure you book your tix in advance for the Vatican. It’s nice to walk around and just enjoy the food and sites. I spent 4 days in Sorrento last summer and I loved it. Was my first time there and did half day trip to Pompeii on train. I booked a tour guide and they met you at the Sorrento train station. Easier to do that. Half a day out on Capri. It’s nice but expensive. Ferry ride to Positano on another day. Make sure to go early. I d didn’t and didn’t have much time there. Ferries don’t go that frequently. I would leave pizza in Naples out. I haven’t done it before and didn’t feel like I was missing a anything."}, {"username": "Bennett Richards", "comment_text": "I would stay in Sorrento… Rent a Vespa and drive yourself up the Amalfi coast highway. My wife is terrified of motorbikes but her memory of that drive is the best of our trips to Italy. It’s safe and you can stop whenever you want. You can get a hovercraft from Sorrento to Capri. Sorrento is incredible and had one of the best hotels around. The Hotel Bellevue Syrene. You look straight down 1,000 feet to the water. Fantastic restaurant. A stay you will NEVER forget."}, {"username": "Nikki Blosser", "comment_text": "You mention “bf” twice. What does that stand for?\n\nDay three sounds like a lot. I think the time it takes to ferry around, bus to Ravello to explore it won’t leave much time for Positano too. Might choose between the two spots.\n\nCurious, you have rented a private car to drive you to Positano? Then it waits around for you and you get driven back to your home base in Sorrento? If so…may I ask how much this service is costing? (Or is it renting a car for two different car rides/two reservations) I am not interested in renting a car and driving that area so am interested in doing a private 🚙 too!😁\n\nI have read Ischia is a more relaxed place to visit. (If you are looking for that type of experience) Capri is more fast paced (& more expensive) I thought I would want to do Capri but after much research, I am thinking my plan will be Ischia instead.\n\nDay six is too packed. Travel takes more time than people think. Taking the train to Naples then on to Pompeii to explore then taking train on to Rome…you would not have much time for Rome that night. It would probably be more of just arriving, dinner, packing and sleeping. As others have suggested, you might consider skipping Pompeii in order to leave more time to explore Rome. (You will not regret it)\n\nYou might be able do your planned schedule. I of course am only one opinion. I am a fast paced person and thought I had left enough time in each of my destinations but after all was said and done, we needed more time in each spot to truly experience Italy. We are dying to go back but now know we need to plan less so we enjoy more! If that makes sense 😂 Wishing you a wonderful vacation! 🌺"}, {"username": "Frank Dragna", "comment_text": "Timeshifter app to help with jet lag."}, {"username": "Nancy Gospo", "comment_text": "It’s an ambitious itinerary. Keep your day 1 plans to a minimum and be prepared for an early dinner/early to bed since you will be sleep deprived. Day 6 seems unrealistic. You could spend an entire day at Pompei.\nAll great ideas but you’ll need to be realistic about what you can see and enjoy in the time you have."}, {"username": "Ruthie Chiaia", "comment_text": "Here’s my jet lag hack- Not sure if it’s an option from your US departure city but if I travel transatlantic flights from NYC I look for morning flights. I keep busy (usually working) the entire flight. You arrive later in the evening CET go have a light bight to eat and go to bed local time. Wake up the next day and you just beat the jet lag.\n\nTry Virgin Atlantic"}, {"username": "Carmen Zervigon Everett", "comment_text": "I think grotto closes at/before 5 ish"}, {"username": "Linda Corigliano", "comment_text": "A new train service began in July between Rome and Pompei. Check this out. We also booked the same hotel in Sorrento for this October. Please give us your feedback.\nYou’re only 40! Do what you can and have fun!! 💐🥂"}, {"username": "Georgina Mcauliffe", "comment_text": "Increase your time away to 10-14 days if you can change your flights if you are seriously dead set on that itinerary. Unless you prove to be one of those very few people who can sleep anytime I would not imagine you will sleep at all on the plane at that time of day. So you will never last until sunset unless you are the sort that clubs all night and works all day in normal life. So nap as suggested above on check in or go to bed after an early dinner on first night. Pompeii - if you really want to see that you should start very early and go there and back first then to Rome getting luggage en route. I would scrap Pompeii and go to the Villa Borghese that afternoon and the Colosseum in the evening when you get back to Rome."}, {"username": "Sylvie Hogg Murphy", "comment_text": "Breakneck pace, but I totally get wanting to fit in all the things you’ve been dreaming about. How about going to Pompeii for half a day on day 5 (Sorrento overnight)? There isn’t much to *do* in Sorrento in terms of specific sights or activities — it’s just a lovely place! — so this could be an idea to fill part of that unplanned day. Sorrento -> Pompeii -> Rome in a day is impossible. I used to lead tours down there - it’s more than you might think in terms of the travel time and general friction of train stations etc etc. I 💯 recommend Capri over Ischia for this particular trip as it’s just SO much more impressive. (I ❤️ Ischia, but it’s a different thing .. Capri gives you a THRILL.) Absolutely do the Blue Grotto. It’s touristy - and it’s FUN! For Rome, if your heart is set on going into the Colosseum, book skip the line tickets. Any other questions about Rome, I am happy to help - was a tour guide there for years! Have a great time!!!!"}, {"username": "Lorna Schwarz", "comment_text": "We just did a European vacation.... Landed what was 2am our time. Powered through until 2am home time which was 9pm Ireland time. We kept moving during the day and didn't oveat. It was worth it. The next day we had no jet lag as we slept the night away and woke up on Ireland time. reat. Good luck and have a great time"}, {"username": "Alicia Cox", "comment_text": "I think the Amalfi/ravello day may not have time for that AND positano - prob one or the other.\nI don’t think you will have time for Pompeii.\nI also think Rome is getting short changed.\nIt will still be very crowded in sept."}, {"username": "Kerrie Johnson", "comment_text": "Your plan is very similar to mine!!! We do: Ravello daughter’s wedding!! There 6 days. Then Sorrento for 4 nights, Rome 3 nights, fly home Saturday morning! Doing the golf cart tour in Rome! Walking eating tour in sorrento, farm visit in sorrento."}, {"username": "Kally Trahearn", "comment_text": "Think what you are doing sounds great, but probably for someone who isn't going to get much rest or relaxation. Unless you are out of the hotel by 6am each day, you are not going to fit it all in easily.\nI would suggest that you choose Positano OR Ravello as it's too much to try to do both in one day.\nI don't understand all these people telling you to ditch Pompeii - it's absolutely amazing. Do it in the morning as a half day from Sorrento, perhaps on day 5, so you still have the afternoon to chill. The train takes you straight there, but make sure you are booked with a guided tour as it's not something you can easily do without one. Vesuvious is just a mountain that is a bit smokey at the top, nothing special and if you were to ditch anything, ditch that.\n\nWhatever you do, relax and enjoy it, rather than try to tick things off a list. Certainly have a wish list but don't beat yourself up about it if you don't do everything on the list. There's always next time."}, {"username": "Iris Joan Price", "comment_text": "I flew in and out of Rome FCO last year. The airport is huge and we were told to allow 3 hours before departure from Rome before our flights. We needed every minute of those three hours, so don't cut it too close. Our flight out was in the early morning and we had to get a cab at 5:30 am when there is no traffic and only a half hour drive from Rome's center to the airport by the coast. You may need to leave more time on that last day if you want to make your departing afternoon flight. Also, trains in Naples area to and from Sorrento are tricky. The ticket office sold us tickets for the local train instead of the tourist train (which makes less stops). Pompeii, we were told, is vast and a short tour won't do it justice. We did Herculaneum tour instead with virtual reality glasses to see what things looked like before its population was essentially vaporized (unlike Pompeii that was buried in ash, so if you are more interested in seeing the results of being buried alive, Pompeii is your go-to). And If you are going to try to grab a pizza in Naples between disembarking from your train and getting picked up by your driver, have you thought what you will do with your luggage? I had the same dilemma and did not want to walk it to a locker a few blocks from the train station by myself while I explored for a couple of hours in Naples, so I missed out on pizza and spending time at the archeological museum there which houses many artifacts from the cities that Vesuvius destroyed. I would maybe leave a day or at least half a day to explore Naples if I get there again, which I hope to do someday. Sorrento is lovely and Franks Pizza has lines out the door and down the street if you want great pizza. What we saw of Capri was crowded and somewhat disappointing except for the panoramic views from on high and the ferry around the island. You can take the funicular up to the town when you get off the ferry for a couple of euros and skip the tours that nice little old men will try to scam you on (we fell for that when getting off the ferry from Sorrento to Capri.) Have a fabulous time! You have a lot planned for a short time and that is the problem with Italy--too much to see and love about it, and always too little time!"}, {"username": "Krystle Waggy Konečný", "comment_text": "You should book a day trip to Pompeii on that day you have no plans. I used Get Your Guide and it came with train tickets; the guide meets you at the train station in Sorrento and you’re with him the whole way through. It was very worth it! You come back and still have time to do whatever else when you come back to Sorrento!"}, {"username": "Doug Burke", "comment_text": "Sounds like an excellent trip filled with quality over quantity. The making of memories. It's refreshing to see someone not trying to cram in 7 cities in 7 days!"}, {"username": "Lucrezia Folger", "comment_text": "The whole point is to eat at the Jewish ghetto!! best food in Rome. Don't ear in the high tourist areas."}, {"username": "Lucrezia Folger", "comment_text": "Way, way, way too much."}, {"username": "Karen Ries", "comment_text": "leave no later than 10am for the flight home!"}, {"username": "Karen Ries", "comment_text": "I agree with the person who says to do Pompeii on day 5 and get to Rome earlier on Day 6."}, {"username": "Nikki Niks", "comment_text": "We did this trip and more with a toddler. You can do it! We walked all over Rome in less than 48 hrs. We saw everything except Vatican City (we are already booked to see it 2024) Rome has amazing food and breathtaking sites… see as much as you can. We didn’t do any tours as it wastes a ton of time. Especially because you aren’t in Italy very long.\nI would skip Capri it takes up a whole day … there’s too much to see on the coast. Taking a private yacht is a must. That was our favorite day.\nWe did Pompeii on the way to Amalfi. Our private driver kept our luggage in the car until we were done. I’m sure you can do that on your way back to Rome or on your way to Amalfi. Definitely get the pizza in Naples - it’s best pizza in the world. I still dream about it lol.\nIn Amalfi we walked everywhere. We found amazing beaches and food. Have fun! Oh yeah visiting Italy is not a vacation it’s see as much as you can and doing as much as you can until you’re so exhausted! But that’s living 😉"}, {"username": "Kimberly MacKinnon Cherry", "comment_text": "Definitely do Pompeii it's amazing. But make sure to get a guide so you know what you're looking at. We used Sorrento Food Tours. This included transportation,\na guided tour, then wine tasting and lunch at a winery. It was a great day trip."}, {"username": "Marc Chomel", "comment_text": "Okay. First you will be exhausted when you get there, jet lag etc. Rest up, at least until the afternoon . There’s a lot in Rome to see. Do as much of it as you can before you leave for Sorrento. And when you get there, by train or bus, stay in the town, enjoy it, and take tours via Aviator etc from the port to Capri, Pompeii, Vesuvius.\n\nAnd you can get to Positano from there by ferry. Don’t drive."}, {"username": "Miriam McNally", "comment_text": "There's a very good museum under Piazza Navona (I notice your hotel is at Piazza Navona), it's not \"dungeon\" like but is under the square. We really enjoyed it!"}, {"username": "Vikki Grass", "comment_text": "Ok only read through day one in Rome and yes, push through, no naps. Helps adjust quickly to time zone. Campo di Fiori is a 8-12 noon for market place and then it folds up and is gone for the day. Spanish steps and geloto great end of day. IMO"}, {"username": "Marybeth Obrien", "comment_text": "Can you share your hotel going in October"}, {"username": "Ginger DiGalbo Katz", "comment_text": "Hard to do ischia in one day. I love 4 beaches all over island. And the thermal parks. I go for a week every year. I stay at the most wonderful hotel. All inclusive and they pick you up at ferry. I adore that island"}, {"username": "Ginger DiGalbo Katz", "comment_text": "Pompeii is 30.min south by train of Naples. You are cramming a lot in...it is really hard to do anything for a half day...unless you don't sleep"}, {"username": "Diana Smith", "comment_text": "So… 8 o clock in the morning in Rome is 2 AM our time. Looks like a nice itinerary just don’t know how you will stop in Pompei on the way to Rome … what will you do with your luggage? Also try to get to the airport 3 hrs before your flight. Have fun!"}, {"username": "Rosemary Barbetta", "comment_text": "You’ll arrive home exhausted.\n-I liked Ischia\n-Pompeii and Vesuvius are a full day.\n-Pizza at the train station in Naples????? There won’t be time after Pompeii\n-remember there are only 24 hours in a day (6 are for sleeping)"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Whoa! Quite a whirlwind. Don’t think you can do all that and appreciate what you see in six days."}, {"username": "Lisa Valdovinos", "comment_text": "Enjoy!!!"}, {"username": "Jolene Jackson", "comment_text": "Definitely stay in the Monti area. Restaurant Aroma has a beauty view of the Colosseum at sunset"}, {"username": "Stephanie Evans", "comment_text": "This seems like too much I fear you won’t even enjoy Rome and the traveling takes time and Sorrento is a haul! Did this trip last year!"}, {"username": "Roberta Higgs", "comment_text": "A lot on your plate me thinks, stay in Sorrento get the train to Pompeii from Sorrento. Easy to pick up the train from there. Plus am ignorant and curious, what the chuff is a golf cart tour fgs"}, {"username": "Marilyn Caladine", "comment_text": "One tip. In Sorrento ask directions to the municipal gardens (next to hotel Tramontano)turn\nleft and you will see a kiosk where you buy tickets for the lift which takes you down to the port and ferries for Capri/Ischia. It saves you the long walk down and up again. Good luck. Enjoy and try and find time to stand and stare 🤣🍋"}, {"username": "Rachael Richardson", "comment_text": "Not many beaches in sorrento it’s all boats walks and rough coastlines\nWe fitted in lots like this on our trip, if you fit you’ll be fine , squash it all in"}, {"username": "Rhonda Hope", "comment_text": "Way too much in such a short visit"}, {"username": "Anna Gambino", "comment_text": "Seems like a lot. I’ve been on a couple of small group tours and we did a lot. It was sometimes exhausting. I don’t think I would try to do Pompei. Ravello is gorgeous. I much prefer leaving time for just strolling and taking Italy in."}, {"username": "Valerie Collanton", "comment_text": "I think it sounds great. You can always adjust along the way if it seems like too much. Enjoy !!"}, {"username": "Fiona Cameron", "comment_text": "Much too much for 6 days."}, {"username": "Gabriella Villasenor", "comment_text": "Trevi fountain is walkable from Spanish steps area - sorrento is gorgeous ( nice shops) really nice atsmophere at night- wish we would of had time to reserve a spot like at Peter’s beach. We also did a tour of the vatican is was worth the $. You can get pompeii on the train from sorrento, hope you have cool weather it was brutal when we went earlier this week - we had stuff planned almost every day too! Some afternoons off or mornings off - we wanted to see everything 👍\nHave a great time!"}, {"username": "Kelli Lewis McElroy", "comment_text": "Are you flying from DFW? Sounds like the same flight we are taking on September 3rd."}, {"username": "Angela DiGianni Nocera", "comment_text": "Looks like good itinerary\nDon’t miss Sistine chapel\nIn Rome\n\nTrain to Pompeii\n\nCapri is worth trip from sorrento\nAnd just watch\nThe people\nEnjoy the food\nAnd wine\nAnd smell\nOf lemons\n\nU will be back🙏🏼👍🍷"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "You’re cramming too much in one day… you need more time in each city you’ll be exhausted."}, {"username": "Kathy Flood", "comment_text": "Book one of the golf cart tours in Rome. Do it on your first day there. You might be too tired to walk around but you should be able to stay awake on the golf cart and then go to bed early."}, {"username": "Lisa Marie Corcoran", "comment_text": "So we vacation like you…we can rest when we get home! Looks like a fun plan. We are going in October and only have 4 nights in the Amalfi Coast area so we have plans like these. If you have any questions about tours/\ntransfers/\ndrivers please let me know! We are using Amalfi Coast Transfers and they are doing all of our driving for us! We are doing Pompeii on the way back to Naples and they are handling all of that!"}]}, {"id": "2201228743609537", "text": "Road trip from Paglia to Venice!! Any thoughts please?", "link": "facebook.com/groups/1373361046396315/permalink/2201228743609537/", "likes": 0, "comments": [{"username": "Alice Francesca", "comment_text": "You mean Puglia?"}, {"username": "Carole Tarlap", "comment_text": "Train"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2201230653609346", "text": "Hi I will be in Italy for a month. I will be flying into Milan and then city hopping by train. From Milan I will be going to Venice, Florence (Pisa too for the afternoon), Rome, Naples, Capri, Amalfi Coast (Positano, Amalfi Town, Ravello and Sorrento).\nThen from there I fly into Catania and head to Syracuse, then back to Catania, Mount Etna Area,आणखी Taormina, Cefalu and then Palermo.\nI already have all my hotels and a pretty good list of things to do in each city.\nBut I will take any recommendations on places to eat.\nBest Gondola ride to take in Venice.\nWhere to take a cooking class. I would like to do one in Northern Italy and Sicily. Any info on the trains to each city.\nI know to book first class for trains. But there are a few websites for that. I didn't know if one is better than the other to do that on.\nAlso any info on climbing Mount Etna.\nAnd any tips you think are important or what are must bring items.\nTIA have a great day!!!", "link": "facebook.com/groups/1373361046396315/permalink/2201230653609346/", "likes": 1, "comments": [{"username": "Miyuki Kanno Paul", "comment_text": "Regarding Monte Etna, wear sturdy shoes as volcanic soil can hurt you if not covered. The weather up on the mountain CAN change drastically in a matter of minutes. I had to wear a thick lined jacket as soon as the sun disappeared in the clouds in October morning. It is the easiest to approach from the south at Rifugio Sapienza. Take a funicular up and transfer to ATV (extra fee). We drove from our agriturismo in Santa Venerina via Zafferana Etnea.\n\nAs for train, Trenitalia’s official website/app and Italo’s official website/app are the best. Trenitalia probably works the best for your travel. If they have the same routes, compare the schedule and price"}, {"username": "Nina Hod", "comment_text": "If you can, spend a day in Bologna on your way from Venice to Florence."}, {"username": "Monica Patil", "comment_text": "Perfect thanks I’m an experienced hiker but I’m looking for a guide still. So this helps much appreciated! Good to know the trains are not the best I will look into buses!"}, {"username": "Julie Angel Bruther", "comment_text": "I’m taking train from Naples to Taormina. About 61/2 hrs. I want the experience and train to ferry experience as well. I didn’t think too bad."}, {"username": "Matteo Basile", "comment_text": "For trains use Trenitalia and Italo apps /websites directly. No need to book 1st class only, especially on local trains. If you need more detailed info on trains just ask or dm.\nI suggest one stop in Bologna for sure one of the best places to take a cooking class!"}, {"username": "Jenny Payne", "comment_text": "I have trained all over Italy. Works well for me & Palermo is a great place in Sicily , lots to do , take a train to a town called Cefalu about one hour from Palermo, y can’t get any close to the beach unless u were walking on the beach + another bus to a town called Mondello lovely beach & we were there in October, weather was great . If u drink white wine , it is beautiful around Mt. Etna to do with the soil around the volcano 🌻"}, {"username": "Bev Madill", "comment_text": "Book trains directly with Trenitalia (or Italo if they service the route you want to take). Websites are easy to use. That's a big itinerary for a month so I hope you're not rushed. If you're looking for a private shuttle from to/from Napled/\nSorrento I highly recommend Transferelax. We based ourselves in Sorrento and did day trips to Capri and Positano. I've only driven in Sicily so can't comment on public transport there. Have a wonderful time in magical Italy."}]}, {"id": "2201232766942468", "text": "Brand new to this site. Planning first trip to Italy. Would you recommend a guided tour of Italy or plan your own? If tour, which ones have you used?", "link": "facebook.com/groups/1373361046396315/permalink/2201232766942468/", "likes": 4, "comments": [{"username": "Miyuki Kanno Paul", "comment_text": "We always plan on our own unless the specific site requires a mandatory guided tour. Invest in Rick Steves guidebook and download his audio app. That’s more than plenty, and it will save you time and money"}, {"username": "Jenn Messina Babore", "comment_text": "We plan on our own. I prefer not to be in a big tour group and do our own thing."}, {"username": "Dave Conroy", "comment_text": "Plan myself so I can do what I want and when. Way cheaper but even if I was rich I'd do the same. I like flexibility and the moment more than tourism tick box."}, {"username": "Stacy Derouin", "comment_text": "We plan on our own with the help of a travel agent. We don't like the confines of a big tour group and prefer to plan our own things."}, {"username": "Mary Anne Richert", "comment_text": "Thanks for the info. We aren’t world travelers. Is it still doable to plan your own trip if not an experienced traveler?"}, {"username": "Scott Perry", "comment_text": "I would think planning your own trip totally doable, even if you aren’t an experienced traveler. Be careful though of trying to fit too many different places into your itinerary."}, {"username": "Jamie Bly", "comment_text": "We had great success using your local tour guide. I highly recommend these private tours. Locals know the area and can get you where you want in a short period of time. We also did a few tours with walks that were fabulous."}, {"username": "Lisa Valdovinos", "comment_text": "We had a travel agent who planned everything. Any of the tours we did were small groups (we are not usually tour people)."}, {"username": "Gillian O'Callaghan", "comment_text": "I've just spent a month there solo with no tour. It really is doable and easy......booking.com for all accommodation, credit card for purchases and debit card to get a few € from ATM, Trainline for 13 train bookings. Felt safe the entire time."}, {"username": "Jill Wolder", "comment_text": "First time - a tour would be the best way to go. You would see and learn more. I think Perillo Tours is the best way to go."}, {"username": "Lisa Pirone Kaiser", "comment_text": "We planned it on our own and used Rick Steves book as a helpful guide. It was easy to tailor to our preferences."}, {"username": "Jeff Gentner EA", "comment_text": "There's a huge difference between SEEING Italy and EXPERIENCING Italy. If you want to just see, go on a tour. To experience it, you should plan your own tour. How long will you be in Italy ? We've been to Italy 4 times now and would gladly share experiences."}, {"username": "Renae Larcus", "comment_text": "I am not a tour person but if it’s your first time you might check out TripMasters. You pick the itinerary and they do the details. You are on your own once you get to each city, but tours are optional. Very reasonable. That’s what we did our first trip to Italy."}, {"username": "Juliet Conti Dale", "comment_text": "Gate1 Travel"}, {"username": "John Layman", "comment_text": "I think you owe it to yourself and talk to a reputable travel agent tell them what you want and expect."}, {"username": "Bonny S Boggs", "comment_text": "Rick Steve’s books & internet search will help you! Enjoy"}, {"username": "Jerry Lyubelsky", "comment_text": "Use a travel agent but tour it on your own"}, {"username": "Lisa Adams Robertson", "comment_text": "We do both! Our first trip was a wonderful tour of Sicily by Amber Road Tours, but we also planned time on our own in Rome before and after the tour (since we flew from the US, in and out of Rome.... plus I just HAD to see Rome!). We've continued that way of traveling, combining a tour with time on our own to relax and explore."}, {"username": "Matt-Kathy Stavely", "comment_text": "We are doing a Globus independent tour. Trying this for the first time in September. Our hotels, trains, and a tour in each city is included, along with an English speaking host. We are doing Rome, Florence and Venice and we have a day and a half of free time in each city. ￼ this seems like a good fit for us with some structure and some free time.🤞🤞"}, {"username": "Stephanie Stevens Burke", "comment_text": "We just got back from our first trip. 3 weeks. Naples, Amalfi Coast, Rome, Florence plus Tuscany, Cinque Terre. We loved looking and finding AirBnBs and planning. It felt like it”extended” the trip as we talked and thought about it for months before. We had several tours of important places but mainly the explored. We didn’t have any specific restaurants to go to—-as we found places when we were hungry."}, {"username": "Felicia LoCascio Whitney", "comment_text": "Our first trip we used a tour guide. Then we were on our own for other trips."}, {"username": "Connie Rai", "comment_text": "I am a 30year experienced travel advisor and just returned from taking a group on 2 wk trip. I always suggest organized tours. You can arrange all you want on your own but never get the actual experience and knowledge doing that. There are Travel pros that have these trips and have well-planned and no guess work to deal with. I have lead groups around the world and numerous times to Italy. Remember reading the best travel books when you are trying to focus on the site you are visiting is nothing like being lead by a professional, knowledgeable a and experienced guide. There are great small group tours too. Call me: Connie at 561-865-7484"}]}, {"id": "2201242310274847", "text": "Visiting Italy for 10 days at the end of the month.\n\nWe are doing 3 days in Rome and the remainder in the amalfi coast (hoping to stay in positano or nearby- have not booked yet, anywhwre to look besides Airbnb and Expedia? -\n\nDo you think it’s worth it to stay on the island of capri for two nights or is a day trip sufficient?", "link": "facebook.com/groups/1373361046396315/permalink/2201242310274847/", "likes": 0, "comments": [{"username": "Miyuki Kanno Paul", "comment_text": "Capri is super expensive for everything. However, it’s worth paying for 2 nights if you can score a view. The greatest advantage of staying in Capri is that you will beat all the day trippers ferrying from all the direction while you are taking the first boat tour available in the morning. We did both day trip and spent 2 nights there to experience it. This is the view from our room on Capri."}, {"username": "Kay Rendall", "comment_text": "Not sure u will find any accom in Positano or Capri at this late stage. I booked Positano in April, only gave me a room.because I had stayed 8 times. Booking.com might have something available late cancellation\nOr even put up something asking for b&b in area, for x people. Have seen private posts on Puglia for vacancies, last minute"}, {"username": "Meghan Tan", "comment_text": "You are going in just a few weeks? Most accommodations are fully booked."}, {"username": "Kristina Ruk", "comment_text": "Booking com try to look. And if google can find direct contacts, so can get better prices"}, {"username": "Kylie Paine", "comment_text": "My daughter stayed 6. Nights in Salerno and used that as her base she caught the ferry to Capri ,an 8 hr boat cruise that stopped at Amalfi and Positano"}]}, {"id": "2201246773607734", "text": "In July 2024 we (a couple in our 60’s) are staying in Milan for 4 days after a Mediterranean cruise. We are going to Como one day but would also like to visit a quiet country village, any suggestions?", "link": "facebook.com/groups/1373361046396315/permalink/2201246773607734/", "likes": 2, "comments": [{"username": "Alice Francesca", "comment_text": "I am Italian and cannot think of a quiet Country village near Milan..the outskirts and surrounding area are hyper industrialized.\nBetter head to Verona by train.\nYou will love it.The town of Romeo and Juliet, the magnificent Roman Arena still used to this day for opera and concerts, the quiet restaurants by the river, the view from the hill .."}, {"username": "Karen Schmidt", "comment_text": "Where does the cruise end?"}, {"username": "Connie Wilson", "comment_text": "I would suggest Orta San Giulio on Lago d’Orta, Arona or Angera on Lago Maggiore. Beautiful lakeside villages that can be reached by train from Milano (and are closer to Malpensa Airport than Milan itself). To reach Angera you’ll take the ferry from Arona.\n\nhttps://\nwww.summerinital\ny.com/guide/\narona\n\nhttps://\nwww.e-borghi.com\n/en/village/\nVarese/425/\nangera\n\nhttps://\nwww.e-borghi.com\n/en/village/\nNovara/75/\norta-san-giulio"}, {"username": "Roland Trego", "comment_text": "Bergamo, la citta alta"}, {"username": "Lee-Ann Paterson", "comment_text": "Jenny, I would stay 1 night Milan and 3 in Varenna on Lake Como. Meet me for lunch when we get home and we can chat."}]}, {"id": "2201253493607062", "text": "Sorrento", "link": "facebook.com/groups/1373361046396315/permalink/2201253493607062/", "likes": 242, "comments": [{"username": "Roger W Ilsley", "comment_text": "Love Sorrento"}, {"username": "Marilyn Caladine", "comment_text": "Me too. My second home 🍋"}, {"username": "Andrew Mircovich", "comment_text": "My favorite city anywhere ! We had our daughter ms wedding in Sorrento this past May and had 94 attendees"}, {"username": "Judy Skyberg Limmer", "comment_text": "Beautiful!"}, {"username": "Karin Chlebecek", "comment_text": "Karin Chlebecek"}, {"username": "Tiffany Hadfield Merrill", "comment_text": "Love Sorrento!❤️🍋"}, {"username": "Tracey Dawn Pike", "comment_text": "I'll be there in 20 days ❤️"}, {"username": "Christine Redhead", "comment_text": "Love Sorrento been once fell in love 🥰"}, {"username": "Ευη Πολυζου", "comment_text": "I love it!"}, {"username": "Ewelin Ka", "comment_text": "Piękne Sorrento🤩 mam nadzieje ze zobacze jeszcze raz 🥰"}, {"username": "Fiona Mac", "comment_text": "Stunning"}, {"username": "Zsanett Szlovák", "comment_text": "Zsanett Szlovák"}, {"username": "Amy Frederick Snyder", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Mia Jane Dunn", "comment_text": "Daniel Dunning 😢"}, {"username": "Šárka Janowska", "comment_text": "Šárka Janowska"}, {"username": "Colette Mc Erlean", "comment_text": "Gorgeous ❤️❤️B there on Sunday..😊👍Donna MccannFerris Teresa McKillop"}, {"username": "Lois Marie", "comment_text": "It was beautiful!"}, {"username": "Lynda Edwards", "comment_text": "I love Italy ♥️"}, {"username": "Stefanie Decroix", "comment_text": "Sofie Descamps"}]}, {"id": "2201256006940144", "text": "Hello! First time poster here. Hoping to visit Italy for the first time next spring with my husband. So many amazing places to go and things to do, it’s over whelming. We want to ‘experience’ the country rather than ‘see’ it, we want to live like locals. Due to the time of year, we have decided to visit central to southern Italy. We would love some advice for your favourite places off the beaten path. All and any suggestions would be appreciated! Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2201256006940144/", "likes": 3, "comments": [{"username": "Rhona OConnor", "comment_text": "I spent a week in Bari and really enjoyed it, not many tourists. Went on a couple of day trips including Alberobello to see the Turulo houses."}, {"username": "Dave Conroy", "comment_text": "He needs to be clear what that means to find it. A lot of locals will live in poverty, so I'm sure he has some alternative ways. You both might also get bored. But I agree. Much tourism is tick box done this and that without engaging with a place or people. Speaking Italian will help."}, {"username": "Matteo Gallizioli", "comment_text": "Florence is a MUST\nthen something \"smaller\" Siena, Lucca, Pisa\nthen something \"very small\" San Gimignano, Orcia valley, Monteriggioni"}, {"username": "Lucrezia Folger", "comment_text": "How many months do you plan to go, to “live like locals?” A home base and then travel out from there ? To discover “off the beaten path,”you need to walk in areas off the beaten path, eat where you stumble upon restaurants where locals take their families because for the most part people cook at home."}, {"username": "Connie Wilson", "comment_text": "I would suggest staying in an agriturismo. So many to choose from, and a great way to immerse yourself in rural Italian life.\n\nhttps://\nwww.agriturismo.\nit/en/\n?gclid=CjwKCAjwz\no2mBhAUEiwAf7wj\nksarMIIswq9ik3a\n4S0BVa6VEmUVbRF\n8RpWiKgLTnSEf3h\nEOtXjKNWxoCAkQQ\nAvD_BwE"}, {"username": "John Sampson", "comment_text": "Hi.if you really want to sample the real Italt,not tourist areas ,.I recommend Puglia,Basilica\nta ,places like that. Beautiful unspoilt mountains lìttered with small picturesque villages and some beautiful historic towns like matera.i go every year and rent privately .bnb ..I love it.. if you need any further info give me a shout."}]}, {"id": "2201257773606634", "text": "Please share best way to get from FCO to Florence around 7:00-8:00AM by train.\nWhich app? Which train? Which stops? Which class? 2 adults w/ minimal luggage - preferably not separated from luggage. THANKS IN ADVANCE!", "link": "facebook.com/groups/1373361046396315/permalink/2201257773606634/", "likes": 3, "comments": [{"username": "Miyuki Kanno Paul", "comment_text": "FCO on Leonardo Exp to Roma Termini. Then take high speed train such as Frecciarossa or Italo to Firenze SMN.\nTrenitalia app for Frecciarossa.\nItalo a for Italo.\nBook higher class of service you can afford"}, {"username": "Rhona OConnor", "comment_text": "I used Google maps to plan my journeys then Trainline to book my tickets. There are just 2 classes, ordinary tickets are fine, 1st class had a bit more room and less noisy."}, {"username": "Jenn Messina Babore", "comment_text": "TrenItalia - you can book the tickets from FCO to Florence."}, {"username": "Sandy Michelle Duggan", "comment_text": "trenatalia"}, {"username": "Sandy Radican Shikaly", "comment_text": "Two high speed companies Trenitalia and Italo... other sites are third party booking sites"}, {"username": "Sara Beth", "comment_text": "Trenitalia app. Book Leonardo express to rome termini then fast train (1.5 hrs) to Santa Maria Novella Florence."}]}, {"id": "2201261106939634", "text": "Looking for hotel recommendations in Venice. We just returned last week from our italy trip but my husband threw his back out 8 days in and did not get to see any of Venice. Poor guy literally spent the last 3 days of vacation bedridden in the hotel. I am hoping to surprise him with 4-5 days in Venice in the spring to make up for it. We stayed at the NH Collection Venezia Grand Hotel Palazzo dei Dogi which was absolutely beautiful, but may want something more central next time. All recommendations are welcomed. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2201261106939634/", "likes": 2, "comments": [{"username": "Billie Begley", "comment_text": "We always stay at Hotel Olimpia. Close to the trains,vaperatt\no and bus. It is on a small canal. Beautiful breakfast and really nice bar for an evening drink."}, {"username": "Ibbu Mohd", "comment_text": "Hotel aquarius"}, {"username": "Gay Bell DiBartolomeo", "comment_text": "The Gritti or JK Marriot."}, {"username": "Frances Scannapieco", "comment_text": "Hotel Al Ponte Antico, Venezia. Small boutique hotel on the Grand Canal. Fabulous"}, {"username": "Bethany Stiehl Baker", "comment_text": "Hotel Flora\nQuaint hotel! Beautiful outdoor space."}, {"username": "Debby Finn Martino", "comment_text": "Just came back from Venice. We had an amazing stay at The St Regis!"}, {"username": "Roxanne Frymire", "comment_text": "Hotel A la Commedia is a wonderful place. Not right on the Canal but very central location. The staff is great and there is a nice rooftop bar."}, {"username": "Kim Geary Keidel", "comment_text": "Splendid Venice. We loved it!"}, {"username": "Susan Conway", "comment_text": "Hotel Saturnia - it was fabulous."}, {"username": "Megan Tarleck Jensen", "comment_text": "Una Hotel Venezia - wonderful location, lovely staff and great breakfast💙"}]}, {"id": "2201262400272838", "text": "We land in Rome and then catching the train to Naples. We have approx. 3 free hours to sightsee In Rome. Are there services that would pick us up at the airport and take us sightseeing and a quick bite to eat then drop us off at the train station? Can anyone recommend a service? TIA", "link": "facebook.com/groups/1373361046396315/permalink/2201262400272838/", "likes": 0, "comments": [{"username": "Sandy Michelle Duggan", "comment_text": "it takes a good 20 to 30 mins to get into Centre of Rome and, taxis really have a long line, I hope you get to see some of this beautiful place, just don't leave yourself short of time."}, {"username": "Jenn Messina Babore", "comment_text": "3 hours really won’t be enough time with having to go from airport to the city center and then to the train station to go to Naples (assuming your flight arrives on time, etc.). You could hire a taxi that would show you a bit around before having to catch your train but timing is definitely tight."}, {"username": "Khushi Khanna", "comment_text": "It may take a couple of hours to clear immigration and teansfer to Rome city, so your plan may nit be practical. BTW there is a direct bus from FCO to Naples, which will save you time bypassing having to come into Rome city."}]}, {"id": "2201263323606079", "text": "Trying to figure out VAT … does that include the taxes from the hotels ?", "link": "facebook.com/groups/1373361046396315/permalink/2201263323606079/", "likes": 1, "comments": [{"username": "Pietro Adami", "comment_text": "Hotels, in addition to the room price, also charge the “tassa di soggiorno), a daily tax which may vary from town to town"}, {"username": "Maria Brozou", "comment_text": "No it does not. Only goods you can carry. Not services"}]}, {"id": "2201269023605509", "text": "Attn: World travelers! We have an opportunity to go to Italy, France, London or Spain for 6 days. Where would you go? I don't care about doing it ALL ... I'd rather go to just 1 or 2 places. Should I do a few cities in 1 country can i do London & Paris! I would love Spain! We plan on going back in 2 years for 15 days so I can do so much more then.", "link": "facebook.com/groups/1373361046396315/permalink/2201269023605509/", "likes": 28, "comments": [{"username": "Sara Kyle Hargett", "comment_text": "No problems at all in Italy. Just be aware because of the crowds."}, {"username": "Jennifer Louise Snedden", "comment_text": "Barcelona is amazing! Paris I enjoyed, but that was a few years ago ... but I would visit again! Anywhere else in France would be awesome. London is always a winner so much to see and do, but believe it is currently $$$. It has been 20+ years since I visited Italy, maybe it's time!"}, {"username": "Karen Beckham", "comment_text": "I personally would do two cities if you only have 6 days\n\nBarcelona is a beautiful city with so much amazing buildings, history and the wonderful beaches. I’ve been to a lot of Europe and it’s one of my favourite places. It’s also easy to get around with the hop on hop off buses or just walking. Stay on La Rambla.\n\nRome should be on you list too… no words can describe it .. history … beautiful buildings ….."}, {"username": "Steve Grossman", "comment_text": "London and paris would be a good bet for that amount of time. And there's so much to do."}, {"username": "Steve Grossman", "comment_text": "And you get to travel by train to Paris. And you don't have to wait 3 hours for checking at the airport."}, {"username": "Grace Scinto", "comment_text": "Keep it simple. Go to London for 3 days. Catch late afternoon Eurostar to Paris and 3 days there. Leave fromParis"}, {"username": "Cindy Breneman Hattrich", "comment_text": "I have been to England and wales and Ireland and Scotland and Paris. Going to Italy in august. Do them all!"}, {"username": "Nancy Lewis", "comment_text": "Only France"}, {"username": "MaeLeigh Cf Cervantes", "comment_text": "France but skip Paris. We just did 5 weeks in Italy and 2 in France and I wish we would’ve done the reverse"}, {"username": "Jazz Caldwell", "comment_text": "Paris, London or The Amalfi coast of Italy...next trip see more of Italy!"}, {"username": "Basia Szokarski", "comment_text": "ITALY"}, {"username": "Nancy Vahl Raske", "comment_text": "Italy all the time!!"}, {"username": "Mike Flohr", "comment_text": "Spain."}, {"username": "Marina Gorenshteyn", "comment_text": "for 6 days is only london- Paris, rome- Florence or madrid- Barcelona just to scratch the surface"}, {"username": "Anna Treviño O'Campo", "comment_text": "Gosh I need to print all these comments and plan my itinerary! I love this group! Thank yall so much!!"}, {"username": "Anna Treviño O'Campo", "comment_text": "\"Well I've never been to heaven but I've been to Oklahoma\" Well there's at least that! Lol"}, {"username": "Renee Kremesec", "comment_text": "Paris"}, {"username": "Rosemary McClenaghan", "comment_text": "When are you thinking of going?"}, {"username": "Margaret Carman", "comment_text": "Seville in Spain as long as it’s not August! X😎"}, {"username": "Daniela Parhar", "comment_text": "I wouldn’t miss Florence"}, {"username": "Nicki Trueman", "comment_text": "Spain to relax, Italy to explore."}, {"username": "Arta Goldman", "comment_text": "Now is a beach season. Go to Italy, Puglia or Sicilia and just relax as the Italians do 😎"}, {"username": "Nichola Sowden", "comment_text": "If you come to the UK I would definitely try to fit in a visit to Edinburgh, beautiful old unspoilt city. Loads to do and see. Scotland is a country that’s not to be missed!"}, {"username": "Dori Sze Lok", "comment_text": "Paris"}, {"username": "Sam Hersh", "comment_text": "We were in Italy last year none of us got pick pocketed. Where your handbag on you zipped and in front of you and be aware"}, {"username": "Laura Schulz", "comment_text": "If you have 6 days- stay in one country. London is fabulous . Going to Italy in the fall- so many regions to see so, if you decide to go- pick north or south. I hear Spain is wonderful and plan to go soon."}, {"username": "Brenda Mikels Bunch", "comment_text": "We did London(and area) & Paris in one trip. Easy/quick flight to Paris or take the Chunnel- train under English Channel. Easy and a couple of hours"}, {"username": "Jess Galasso", "comment_text": "Six days - one country - two cities max."}, {"username": "Sarah Rogers Zakala", "comment_text": "I’ve been to all that you listed. Hands down Italy!!"}, {"username": "Karen Busch", "comment_text": "Italy is my first choice, Spain 2nd. I’m not into France or England. I have been to all."}, {"username": "Sheila Finzer", "comment_text": "Italy"}, {"username": "Donna Gilardone Szwabowski", "comment_text": "If you fly between countries you could do two countries\nEx fly into Barcelona fly to Rome, fly home from Rome. Would give you a taste of two countries"}, {"username": "Terri Estright", "comment_text": "Italy is my favorite. I've been to London, Paris, Monaco. I would forever return to Italy. Never have been to Spain, but I've been to Italy 5 or 6 times, all over."}, {"username": "Dawn King", "comment_text": "I’m English and you could easily do London and Paris in 6 days. I didn’t love Paris but enjoyed seeing the sites."}, {"username": "Matthew Gramitt", "comment_text": "It depends on what time of year, what you like to do - see cities and culture, small but beautiful villages, relax in nature; and who the “we” is - you and a partner, whole family (what ages?), and more."}, {"username": "Christine Meyer Brunette", "comment_text": "Our friends just did 3 days in London and took train and did 3 days in Paris. They did and saw a lot. I did a tour in Europe once and we did Rome 2 days, Florence 1 day and Venice 1 day, among many other places and it was more than enough at the time."}, {"username": "Dennis Jones", "comment_text": "We just returned from Italy…it was an incredible trip!\nWe did Venice, Florence, Rome, and Sorrento with a few half day trips to Pisa, Assisi, Pompeii, and Capri…We loved Venice! For six days…maybe Venice and Florence?\nDid London and Paris many years ago…also a good choice!"}, {"username": "Bill Casper", "comment_text": "Spain. Madrid-Sevilla-\nMadrid."}, {"username": "Nancy Sunshine", "comment_text": "London and Paris"}, {"username": "Sharon Bowns", "comment_text": "I’m not a fan of Paris."}, {"username": "Elena Innocenti", "comment_text": "Barcelona"}, {"username": "MaryLou Capobianco", "comment_text": "I would pick one only. I think Spain for 6 days."}, {"username": "Ivette Lugo", "comment_text": "never been to spain, but Italy is definitely a must!"}, {"username": "Chris Aman Florian", "comment_text": "London is so easy to get around. Also loved Rome. Can do the big things in both pretty easy.\nI did like Nice, France. Beach, marketplace and easy travel to Monaco, St Paul de Vence, and Eze."}, {"username": "Annette Giovia", "comment_text": "DEFINITELY ITALY for the whole 6 days!!"}, {"username": "Lina Stump", "comment_text": "6 days??"}, {"username": "Lydia Springer", "comment_text": "For me it would be Italy. And for 6 days only I'd visit two places only. Destinations could also depend on time of year (crowds, weather, etc). In my view, 2 days in each place plus travel time would be a minimum to stay."}, {"username": "Janice Leonard", "comment_text": "Spain 🇪🇸. Barcelona is my 2nd fave big city! To fly into Madrid, rent a small car & drive along the coastal towns is dreamy. Enjoy"}, {"username": "Paraone Gloyne", "comment_text": "They are all wonderful. 6 days is tight."}, {"username": "Diane Badalucco Mussorici", "comment_text": "Italy and France. Florence and Paris are my two favorite cities in the world."}, {"username": "Pete Wilson", "comment_text": "You don't say time of year which may help guide you i.e winter maybe limited options of flights to your entry point, Summer extreme heat or congestion. All four countries have fantastic points and from reading it would appear Spain maybe has been pulled for a longer excursion at a later date? Trying to cram too much in can be tiring and actually detract from your holiday. If you can narrow down what you do/don't want to do then that may point you to a country i.e do you want walking/sight seeing/\nmountains/food/\ntheatre shows/weather will you drive/ use public transport etc, is it hotels/Air Bnb/cruise etc. Look for the things that are high up on your list and then enjoy planning how you can tick some of them off. Obviously your budget may come into play as well. Whatever you choose just get excited :-)"}, {"username": "Lisa Adams Robertson", "comment_text": "What time of year? I would pick based on weather, since all of those are wonderful options!"}, {"username": "Liz Berretty Waterbury-Vallero", "comment_text": "You can do France in 6 days. We did it in 6 days last year"}, {"username": "Erin Bromfield McQuay", "comment_text": "London!"}, {"username": "Daisy Yoo", "comment_text": "London if u love museums , I could stay in Bristol h museum for a week, I would not attempt to go more than just one place , so much to see and exp , Spain needs more time"}, {"username": "Lynn Weber", "comment_text": "Spain or Italy 🥰"}, {"username": "Sonita Sandhu", "comment_text": "Been to all of them and enjoyed all! Agree best to go to one country and really enjoy it. London and Paris could be an option as flight or train is quick. There is so much to do in London and even in other surrounding areas, ie. Windsor, Stratford Upon Avon. Next time go to Italy for more than a week."}, {"username": "Albert Soifer", "comment_text": "In Spain by all means do Barcelona and Madrid. In Italy you should do Florence and Positano time and distance permitting. Venice will be cray crowded but is a must see. Of course Rome is Rome. In six days I would probably concentrate on 3 days in Madrid and 3 days Barcelona."}, {"username": "Colleen Jennings", "comment_text": "You’ll be very welcome in London! So many great places to visit - the V & A, the Science Museum, Covent Garden, great shopping, wonderful open spaces & gardens, theatres especially The National, wonderful restaurants & places to eat. Wherever you decide to visit, have a fab time!"}, {"username": "Bonny S Boggs", "comment_text": "Italy or Spain"}, {"username": "Lisa Martinson", "comment_text": "Not enough time so just see Italy. Rome & Amalfi coast. 3 days each."}, {"username": "Cynthia Marie", "comment_text": "You can’t go wrong. Out of the 3, I would go to London. I absolutely love walking the streets of London. We visit there several times a year. Lucky me, my husband is English and we visit my in laws. Paris I have absolutely no interest, Spain is also a great choice. We have only been to Spain once on a cruise so I really can’t comment. Have you been to Rome! Aww Rome, I could live there. It is absolutely wonderful. Wherever you choose, how a safe journey. Life’s too short not to travel and explore."}, {"username": "Yvonne Ormson", "comment_text": "Because it’s just a few days I’d recommend one country—althoug\nh you’re not going to see much. The Eurostar trip from London to Paris is pretty great though and then you’ll see a tiny bit of 2 countries 🤷🏼‍♀️"}, {"username": "Glenn Todd Webb", "comment_text": "6 days is enough for just 1 major city and a day trip or 2. If you love Spain go there. You definitely can’t do 2 countries in only 6 days. When you decide which country/city, can give more detail. But get a Fodors or Frommers guide to where you decide."}, {"username": "Laraine McDonald", "comment_text": "If you’ve not been in London go there, otherwise Italy"}, {"username": "Samantha Dutto Pierre", "comment_text": "Italy. I would do all 6 in Rome. If you want to see more then Rome and Florence."}, {"username": "Jennifer Pace Kirby", "comment_text": "I’d say London or Italy but I haven’t been to Spain. We did three nights in Paris from London. We loved London. Paris was fun to see and magical in it’s own way. We absolutely loved Italy (Rome, Florence, Pompeii, Venice) and London the most."}, {"username": "Donna Winter", "comment_text": "I’d say forget London and do one country"}, {"username": "Roxanne Franquelli", "comment_text": "I’d would either Italy one area or spain one area. Really see and discover one section. Good luck and enjoy!"}, {"username": "Elaine Catino Tsangarides", "comment_text": "I’d pick one- Italy and then decide a region rather than the 3 famous cities (Rome Florence and Venice) especially if you’re planning to go back. I spent 12 days in late may/\nearly June in Milan, como and Cinque Terre. Another we did 5 days in Tuscany at a B&B 6 km south of Siena and rented a car. Good base to explore Siena, Florence, montepulciano, montalcino, etc. and you can add Rome or explore Naples-amalfi-sorren\nto-capri depending on how active you want to be. First time I get an overview and then I return for more leisure and depth."}, {"username": "Barbara Bastianini", "comment_text": "Of your target countries I’d go to Spain. I’d pick one place that has several good day trip options. Madrid maybe, with days trips to Segovia, Avila, and Toledo. You’d have plenty of variety or just be able to go slow and get to know Madrid if you’d prefer. Or Barcelona as your destination city , with day trips to Girona, Figueres , Tossa Del Mar, or Besalu possibly. Or Seville with day trips to Jerez de la Frontera, Cadiz, and Italica as possibilities. Each of these would showcase a major city with smaller towns as a contrast and would provide you with a nice variety of great sightseeing. You can take as few or as many of the day trips as suit you, but the options are always there."}, {"username": "Melissa Gipson", "comment_text": "Paris & London"}, {"username": "Michelle Solak", "comment_text": "So many great options you can't go wrong! I think there are certain factors at play here. Would it be your first time to Europe / these countries? If yes I think London and Paris could be a good trip (or I also know some people who stayed in London and took a day trip to Paris with the high speed train). I would save the longer trip for Italy :)"}, {"username": "Susan Monaghan", "comment_text": "Rome with some day trips would be very doable within your timeframe. You need at least a few days in Rome, see Sorrento and some of the the Amalfi Coast. Be sure to do a day trip by train to Orvieto. I think Florence is worth the trip, as well! I would skip Naples…."}, {"username": "Patsy Luque Mejia", "comment_text": "Should you choose Italy, I think for 6 days all of it should be spent in one or two cities, with possible day trips to neighboring cities.\nBut, if you want to see several countries in 6 days, then consider:\n1. Paris and London. We loved Paris. Many beautiful sites, and it’s big enough to find quaint streets to wander through.\n2. Spain, San Sebastián Basque region with two or three days across the border in France touring the French Basque region, or possibly Bordeaux (it’s like a smaller Paris with a more layback vibe).\nThis is just my two cents. Either way, lucky you! Happy travels."}, {"username": "Roger Pajo", "comment_text": "The gothic district in Spain is pretty cool. Obviously we are all big Italy people on this page but Barcelona!!! Can’t mess with that! Have fun!"}, {"username": "D Rochelle Milton", "comment_text": "Spain, Italy, London 💖"}, {"username": "Vera Feeny", "comment_text": "I would think of what kind of place do you want to visit- big cities, cities on the coast, mtns, small towns etc. That may help to narrow it down to one area. If you stay in a big city there would be options for day trips too"}, {"username": "Kris Beacham", "comment_text": "You’re ok with Paris and London. Especially logistically. It’s only a couple hours by train."}, {"username": "Vanessa Durkin", "comment_text": "London to paris kess travelling morr time to enjoy yourself"}, {"username": "Susan Lowry Lamb", "comment_text": "I've gotten to do a lot of traveling over the years. I'd go to Italy, and play around Italy. When you do large cities like London and Paris? You're spending a ton of time getting around. My family prefers smaller more walkable places. Like Florence."}, {"username": "Jen Alexitch Rachow", "comment_text": "If given the option I always choose Italy but 6 days is not long enough unless you do one city like Florence and one day trip from there honestly. Can’t speak about Spain, never been but it is on my bucket list😀"}, {"username": "Rosanna Hardeman", "comment_text": "Go to London if you only have 6 days. Do not do both london and Paris in only 6 days, especially if you’re going back. Six days equals only 4 days, as 2 days are travel days."}, {"username": "Gwyneth Spadaro-Dutturi", "comment_text": "Depends when you want to go. Also do you want a seaside, lakes, mountains, cities, small towns, agricultural areas, forests. How are you travelling and from where?"}, {"username": "Johnny J. Turpin", "comment_text": "They are all amazing"}, {"username": "Karen Schmidt", "comment_text": "I think it depends on the time of year. Right off the bat I would say London and Paris. Fly into one, 3 nights…take Eurostar …3 more nights. It would give you a snippet of 2 famous cities. I loved both those cities…and Paris is in my top 3."}, {"username": "Dann Hrusch", "comment_text": "I would spend the 6 days in Paris and London. Then with the 15 start in Rome, up to Florence, hug the coast through the riviera, Monaco, then quick hop from Marseille to Mallorca and then over to Barcelona."}, {"username": "Jaime Cleek", "comment_text": "6 days each or the whole\nTrip?"}, {"username": "Michelle Murphy Margolati", "comment_text": "I would do one country for the six days. My choice would be Italy."}, {"username": "Andrew Mircovich", "comment_text": "Italy do 3 days in Rome and 3 days in Sorrento"}, {"username": "Rhona OConnor", "comment_text": "I like France but not Paris till after the Olympics. It's all under construction 🚧 Italy but not the overcrowded places. Spain has lots to offer both culture and relaxing beaches. I would just do a two stop trip so you get to enjoy the local life"}, {"username": "Alice Francesca", "comment_text": "Depending on when you are going, summer in Spain can be overwhelming if you are visiting Andalusia.I was in Sevilla in June and it was 44 degrees celsius outside,so that limits the time you can actually walk around."}, {"username": "Anna Gambino", "comment_text": "My vote is always Italy 🇮🇹 So many cities and small towns north and south. I’ve been 5 times and it’s never enough."}, {"username": "Olga Gallant", "comment_text": "My vote is Barcelona 😎"}, {"username": "Susan Aspite", "comment_text": "Go where you have the most direct flight"}, {"username": "Jennifer Larese Taylor", "comment_text": "You could easily do London and Paris- three days in each, take Eurostar between the two, easy. Or you could do a city in Spain, like Barcelona. You could also do Florence with day trips to other Tuscan cities"}, {"username": "Mo Dee", "comment_text": "With 6 days as the limiter, I’d pick Paris, France. Make sure one day is spent heading to Versailles."}, {"username": "Lauren-Jade Roberts", "comment_text": "London and Paris is easy as can get the Eurostar"}, {"username": "Roland Trego", "comment_text": "Sure! Two days in London and four in Paris would work fine. Also, it’s easy to spend six days in Paris or Rome with day trips to several destinations."}, {"username": "Miyuki Kanno Paul", "comment_text": "Just 6 days aren’t enough to do all. Choose just 1"}, {"username": "Annette Mayer", "comment_text": "Which place calls put to YOU? Go there. For 6 days pick one base, in one region and day trip from there. Keep in mind every day you change home base is time to pack up, travel, check in, settle in. You've given up a day of exploration."}, {"username": "Jules Blumke", "comment_text": "Too much. You'll want to have time to enjoy each place."}, {"username": "Janis Nunez", "comment_text": "6 days I would do Paris or London."}, {"username": "Sandra Salisbury", "comment_text": "I don’t think you can see Italy in 6 days"}, {"username": "Denise Adams", "comment_text": "Do you like to see the scenery or famous sights etc, traditional Spain? Italian countryside, or sights, Colluseum etc?"}, {"username": "Amber Pollick", "comment_text": "I'd recommend one country and then decide what type of vacation you want to have; the locations you listed are all very different.\nPersonally I'd pick either Spain or Italy, they both have big cities with beautiful architecture but they're slower paced and you also have the option to relax on the beach."}, {"username": "Marie Montafia", "comment_text": "Italy!"}, {"username": "Amalia Cristina", "comment_text": "You can’t do it all anyway, not even in one country or even in half of the country so yes focus on one area that interests you the most. Where are you curious to go? What kind of experience would you like to have? Big city like London and Paris? Or more relaxed like the countryside of Tuscany?"}, {"username": "Victoria Williamson Brattoli", "comment_text": "Did London and Paris in April. London is amazing Paris was ok"}, {"username": "Penny Bellofatto Westberry", "comment_text": "Paris"}, {"username": "Lucrezia Folger", "comment_text": "Pick 1, 6 days isn't much, they are all good choices."}, {"username": "Jennifer Smith", "comment_text": "London and Paris"}, {"username": "Ana Ferreira Ruffel", "comment_text": "Portugal is not on your list but that’s where I would suggest… next Spain… even Portuguese people want to go on vacation to Spain… 😆 I will be going to Italy and reading about it is not sounding very good…. I feel like I’m going to get ripped off or pick pocketed as soon as I land!! 😠 (spent a month in portugal last year and never worried about it.. saw 1 drunk and 1 psych) London is a nice city as well and yes you could probably do London and Paris in the same trip.. I’ve never been to Paris.. my daughter has and (she has Eiffel towers all over her house and on her body 🤦‍♀️) and was highly disappointed !! Although she would most definitely go back.. lol but outside of the tower she said it was dirty and a bit sketchy!! So SPAIN it would be for me!!! (Or portugal)"}, {"username": "Donna Roth Colletti", "comment_text": "Italy"}, {"username": "Renae Larcus", "comment_text": "6 days? Italy. That’s it. Italy."}, {"username": "Laura DeCicco", "comment_text": "Italy, always Italy."}, {"username": "Eve Pizzano", "comment_text": "Italy. Hands down."}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "6 days Italy …."}, {"username": "Alaska Lee-Ann", "comment_text": "I would stick with one country but I would skip Paris. It is too crowded and overwhelming. I would do Spain or Italy for sure!"}, {"username": "Rhonda Hope", "comment_text": "Pick 1 place"}]}, {"id": "2201285730270505", "text": "I just want to say how great this group is and how helpful many of you have been while we planned our trip to Italy (and Greece). The most magical 15 days . So thankful for every minute spent on our summer vacation😎We visited Rome, Venice , Milan, Mennagio, Bellagio and Varena😍Just a few of many, many pictures 😊🥰", "link": "facebook.com/groups/1373361046396315/permalink/2201285730270505/", "likes": 97, "comments": [{"username": "Dixie Kotylak", "comment_text": "Beautiful shots! ❤️❤️❤️"}, {"username": "Janine Brailsford", "comment_text": "Incredible photography!\n\nGreat eye!\n\nLove it!!! ❤️🌠🌠🌠🌠🌠❣️"}, {"username": "Pam Borchert Wildrick", "comment_text": "Wonderful pictures! Thanks for sharing!!!"}, {"username": "Marilyn Gross", "comment_text": "Need a guide for Jewish quarter in Venice and rome"}, {"username": "Brian Marcus", "comment_text": "Ditto. Minus Greece lol. Maybe next year!"}, {"username": "Susan Kuja Noll", "comment_text": "Did you do a cruise? Trying to figure out an itinerary with the same places for next year."}, {"username": "Daniele Margheri", "comment_text": "Beautiful pictures"}]}, {"id": "2201286230270455", "text": "For men, are plain, chino style shorts always okay for dinner? Preference for dining will be on less touristy places, mid range, no fine dining.\n\nOr are pants definitely necessary in this case?\n\nTraveling beginning of September from Rome area down to Sicily area.", "link": "facebook.com/groups/1373361046396315/permalink/2201286230270455/", "likes": 14, "comments": [{"username": "Jenny Payne", "comment_text": "Most Italian men wear linen pants or linen shorts to the knee I’m sure any type of fabric will be fine. Have a look on Pinterest they tell you everything 🌻"}, {"username": "Renae Larcus", "comment_text": "They will be fine"}, {"username": "Benedetta Vanni", "comment_text": "Nobody will tell you \"you cannot get in\" with shorts. You do not have to wear long trousers but if you want to do it like we do it, you should. It's our tradition to be a little more elegant in the evening, we like dressing up a little bit and it's deemed respectful of the style of the venue where we're at."}, {"username": "Jennifer Larese Taylor", "comment_text": "Absolutely fine"}, {"username": "Dayna Scinto", "comment_text": "Yes 👍"}, {"username": "Alice Francesca", "comment_text": "Italian men in cities generally never wear shorts for dinner, only long trousers.it is considered ok if you are by the seaside, more relaxed while you are on holiday"}, {"username": "Graham Sherlock", "comment_text": "Wear what you want"}, {"username": "Jeff Odom", "comment_text": "Get linen pants for that time of year. So comfortable and cool compared to jeans or regular cotton chinos"}, {"username": "Frank Dragna", "comment_text": "I wore shorts and linen slacks(off Amazon for $30). Was comfortable, and to be honest no one gave a $hit."}, {"username": "Brian Marcus", "comment_text": "You'll see everything."}, {"username": "Steve Grossman", "comment_text": "The only place you need to wear a long pants is the vatican. You can wear whatever you want to restaurants"}, {"username": "Elena Innocenti", "comment_text": "If restaurant don’t have dress code you can. Usualy italian during holiday wear short, in the cities it is less common, but you can see many different style.\nit also depends on the type of restaurant.\nit’s difficult to see men in tank for dinner."}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "Been in Italy almost 2 weeks already. People wear whatever they want. Dressy or casual, it doesn't matter."}, {"username": "Jill Medrano Casey", "comment_text": "Totally fine."}, {"username": "Vanessa Durkin", "comment_text": "Think its a bit poor taste in Rome where people dress quite elegantly for dinner some coastal.places it would be ok"}, {"username": "Anna Gambino", "comment_text": "I would advise pants in the evening."}, {"username": "Troy Dalke", "comment_text": "I have been thinking about packing 2 pairs of pants and a few nicer shirts. But I did not want to pack dress shoes. But then I do not want to dress up and wear sneakers. Still undecided about dress shoes. Going for 22 days and everyone says pack light."}, {"username": "Grace Sulsenti", "comment_text": "I've never seen grown Italian men wear shorts in Italy nor Sicily. Shorts are typical for young boys there."}, {"username": "Desiree Miller Kessel", "comment_text": "There were a couple restaurants where you could NOT get in to dinner with shorts in Venice and Rome. People dress up more in Europe in general. Definitely recommend a pair of pants"}, {"username": "Desiree Miller Kessel", "comment_text": "Some churches require knees to be covered for women"}, {"username": "Nina Balsamo", "comment_text": "Wear linen or light cotton pants. Classy, elegant, but still cool in the heat. You’ll look great, but will be comfortable too 👍🏽 my husband always wears long pants for dinners out, unless we’re in America. 🤷🏽‍♀️"}, {"username": "John Rodriguez", "comment_text": "I’m here now and I haven’t put on pants one time!"}, {"username": "Diane Leesmith", "comment_text": "You can get presentable trekking/\nwalking trousers that zip off into shorts."}, {"username": "Lori Van Tassel Pinco", "comment_text": "No one cares what you're wearing. The Italians are living their lives, definitely not worrying about what tourists are wearing.\nRegular restaurants shorts and a dress shirt are fine. If you're going someplace fancier obviously dress accordingly.."}, {"username": "Chiara Bettaglio", "comment_text": "Have to say that also us, Italians, are going dining into shorts in summer if it's not fine dining or upper level restaurants. Just go!\nA big no no on flip-flops instead! Just wear sandals or sneakers."}, {"username": "Maria Gatto", "comment_text": "Just wear nice shorts, pants are not mandatory"}]}, {"id": "2201287436937001", "text": "Rome Heat vs Texas heat? Is it comparable? We’re going soon and I’m trying to get ready but we’re used to Texas heat so hoping it’s at least similar but not worse 😅 I bought the handheld fans any other things we should take to Make it bearable. We will be out early mornings then probably head back to hotel for rest before coming out again in the evenings.", "link": "facebook.com/groups/1373361046396315/permalink/2201287436937001/", "likes": 18, "comments": [{"username": "Jaime Cleek", "comment_text": "I think it's pretty humid there and hot. The big key when you're at home is your not out exploring for long days and walking miles and miles so the heat can really get to you"}, {"username": "Melanie Panzella", "comment_text": "I believe the issue is the heat index. If humidity is high a temperature feels much less comfortable than low humidity. I was able to compare all in a single day,\nA 112 degree temp. with 7%\nhumidity vs. a 85 degree day with over 70% humidity. There are charts to calculate the heat index, meaning what the air \"feels like\". A high heat index number registers oppresive meaning uncomfortable."}, {"username": "Jenny Payne", "comment_text": "Why does everyone go when it’s so hot in Italy? So many other months to choose?🌻"}, {"username": "Kerri Bevilacqua", "comment_text": "I’m from Alabama. We were there a year ago, and the heat and humidity absolutely rivaled what we’re used to here. It was over 100 degrees for multiple days of our trip. Being surrounded by cobblestones and stone buildings that absorb and radiate the heat, being out in it more than we’re used to, and then AC NOT being what we’re used to was definitely challenging. We used the handheld fans, cooling towels, and electrolyte packets to help us. We also did what you’re planning to do in that we’d get out early, do several things, and then we’d go back to the hotel to rest and cool off when the locals do. We’d get back out at dinner and then stay out late walking around. Take small packable fans for your hotel room to help circulate air."}, {"username": "Lydia Howell", "comment_text": "Depends on where in Texas. Rome vs Amarillo, Rome takes more out of you. Rome vs Houston? You’ll die in Houston."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "You cannot compare. Are you out walking for hours every day in the Texas heat or spending most of the day in air conditioning?"}, {"username": "Nancy Lewis", "comment_text": "The Cold Cloth. You dampen it and put it behind your neck as it evaporates it cools down."}, {"username": "Susan Dolin Rothschild", "comment_text": "Can you post a link to the handheld fans you are taking? Battery? Hook on your phone?"}, {"username": "Donna Hall Ortego", "comment_text": "I live in Texas and was in Rome at the end of May. It was about the same, hot. I had a friend just leave there and she said it was super hot. If you are from Texas, you can do this. Drink plenty of water and try to find the shade. As in everywhere, it is cooler where there is grass and trees."}, {"username": "Brenda Cox", "comment_text": "Order some togo Gatorade packets.. This really helped me.."}, {"username": "Bonnie Rupprecht", "comment_text": "Cooling towels a must"}, {"username": "Jennifer Neri Hodges", "comment_text": "Fans and cooling towels. There are plenty of fountains to wet them at"}, {"username": "Yeye Cabrera", "comment_text": "Bring an umbrella, hat and suntan lotion"}, {"username": "Sandra Howard", "comment_text": "Our flight just landed, we did the colosseum in 107 temps. Take an umbrella, drink water and your fans."}, {"username": "Katrina Koger", "comment_text": "This is what I’ve been wondering!!!"}, {"username": "Joy Price Morriss", "comment_text": "Very comparable. I lived in Naples and it was almost identical except for the extreme TX humidity!"}, {"username": "Kay Pearce Lees", "comment_text": "We are going the first of September. I hope it’s cooler then."}, {"username": "Cynthia Santos Vasquez", "comment_text": "I was in Rome last summer, Texas heat is brutal but we have plenty of options to cool off. Your home, your car, etc. AC in Italy is not prevalent, it’s hard to get a break from the heat. Make ac in your Airbnb or hotel a priority. Dress light, plan activities early morning, take a break during the hottest time in the day and go back out in the afternoon. Stay hydrated and enjoy!"}, {"username": "Lisa Louis Hoffman", "comment_text": "We are from Dfw. We were there July 2-10. It was brutal, not gonna lie. It’s not hotter than Texas BUT I personally don’t plan to be outside in full sun in Texas walking 5-10 miles a day. 😂☠️"}, {"username": "Amy Kaye", "comment_text": "Last week was unbearable for me. We were in Houston last year and thought this was worse, but last week was the the hottest it's been in 5 years I was told. If I had a choice, I would never come here in summer again!"}, {"username": "Robyn Gregory", "comment_text": "What about the ac on trains? I’m a little worried about that …🤷🏻‍♀️"}, {"username": "Vickie Constable", "comment_text": "We were there the first two weeks of July. Very humid which made the heat worse. We live in Dallas, TX and I thought it was hotter due to the heat index from humidity. Rome was the worst. Pompeii was pretty hot too. Dress appropriately and lots of water. Pedialyte or Liquid IV daily. You’ll be good!"}, {"username": "Andrea Hirsch", "comment_text": "I live in NC and we get 90-105 and 60-100% humidity. When we arrived in Rome the weather was 95-102 and the heat was unlike anything I have felt. It was so hot it took me and my son down. Like we were operating at 60% of our normal. My husband and older son handled it better. But it wasn’t the heat itself-it’s the throngs of people, hot bodies close together in places, and a lack of effective a/c. Very few places have anything close to what we consider to be effective a/c. So when you add these factors to the heat, it’s hot. But you do what you can do. If it means an extra shower, rest time, extra gelato, etc, do it. We bought electrolyte tablets to help. And the handheld fans. Cold wraps for the neck."}, {"username": "Irene Oda", "comment_text": "When are you traveling? Think of this, even though you are used to heat in Texas- are you outside walking the streets and sight seeing? We brought and used cooling towels. These helped a little."}, {"username": "Dena Champagne", "comment_text": "You’ll be fine.\nJust prepare yourself for the main difference, their AC is not our AC. I really only struggled at night with my hotel room being warm. It was manageable though."}, {"username": "David Horgen", "comment_text": "I live in Palm Springs. We've been over 115° for weeks. I'll be in Rome in 3 days. Hoping it's comparable"}, {"username": "Erin Martaindale Shenkir", "comment_text": "What part of Texas? Humid southeast or dry western? Very different in Texas, itself."}, {"username": "Eileen Muro", "comment_text": "Blue wet towel is a must!! We just got back from Rome, Florence and Venice. We actually didn't have hand held fans....we wore fans around our neck from Walmart, blue towel and hydroflask. The water stations all over helps to wet those towels. Also take sunscreen and a hat!....and sunglasses. We are from Fresno, CA. We get in the hundreds here but the humidity in Italy is sooo much worse. We were taking 3 to 4 showers a day"}, {"username": "Mimi Nguyen", "comment_text": "We were there a few days ago. It wasn’t as bad as Texas heat. I see people wearing neck fans. They may work better than handheld ones."}, {"username": "Tamie L Godbold", "comment_text": "I feel like this isn't very specific because Texas heat varies depending on what part your referring to same goes for Italy heat, depends on what part of Italy your talking about. To me if you want a more accurate answer you need to be more specific. Not just more specific locations but time of year (month) as well."}, {"username": "D'Anna Sullivan", "comment_text": "I live in San Antonio and just returned from Rome on Sunday. It was way more hot/humid in Rome with the heat wave. I used a neck fan and just expected to be sweaty if I went outside. I wore light cooling or moisture wicking clothes as well. No makeup. Helps that I have lash extensions and micro bladed eyebrows. 😂 and people are right about restaurants there. They might have their AC on, but it’s not sufficient."}, {"username": "Deborah Larsen", "comment_text": "I moved here from Austin. The biggest difference for me is no ceiling fans, low or no AC and not much ice to be had for a cold drink. There is just no break from the heat and that can wear on you, day after day. The coolest part of my day is when I am in my own car with the AC on full blast. The rest of the time just sweating to the oldies as they say!"}, {"username": "Christy L Jones", "comment_text": "I was in Texas last summer and Rome this year. I would say it was very similar. Hot and muggy"}, {"username": "Jennifer Leslie Rivas", "comment_text": "I'm here now...from south tx. And its not as bad buuuut there's hardly any relief from the heat. So do things in the morning, take breaks midday and take cabs/ ubers instead of walking 40 plus minutes."}, {"username": "Marty Harte", "comment_text": "Here now in Rome. From NYC used to humidity, here not as much. AM’s have been cool low 70’s, just came back to hotel 2pm it’s hot but we just finished a long 1.5 miles walk to hotel. Been to Tx many times. Your summers I think are more brutal with humidity.\n\nWe have fans and cooling towels for all, haven’t used them yet in 3 days."}, {"username": "Gena Diaco Penland", "comment_text": "We are used to Florida heat and I felt like Rome was a little worse! We found that freezing half-full water bottles over night helped to have cold water during the day. There are fountains all over, but the water is t super cold. I’d also take those cooling towels. We wished we had them!!!"}, {"username": "Kate N Karim Al-Azzawi", "comment_text": "Well, we're from Florida and we knew it was going to be hot. It was crazy hot! The fans will help alot, I also brought a very small umbrella and put it in my purse and yes, I did have to use it and I want to be super clear - I'm not someone who uses an umbrella when its not raining!😂 EVER. It was just tough to find shade in some places. Also, there are water fountains all around the city and they are awesome! VERY COLD. Take water bottles and fill them at the fountains. They were a godsend. We didn't have any cooling towels with us but alot of people were wetting their cooling towels in the water and that looked like a great idea!"}, {"username": "Rebecca R. Russo", "comment_text": "Heat is the same but very challenging to cool off.....very little ac, ice or cold beverages."}, {"username": "Margaret Mks", "comment_text": "We were in Rome in June. Houston is worse than Rome! It was hot but not unbearable. Luckily the airbnb were we stayed in Rome had amazingly cold ac in the bedrooms."}, {"username": "Randy Aull", "comment_text": "I have found it to be not nearly as bad as some places in the states. I actually think the lack of very cool AC helps, as you don't hit that wall of hot when you walk out the door. So your body acclimates better to the heat."}, {"username": "Margi Haberli Kvitek", "comment_text": "Can be hard to find AC. That's the difference. :-("}, {"username": "D'Anna Hohe", "comment_text": "Depends on where in Texas. I used to be in marching band and the big difference can be the humidity. Some places in Texas are dry and so not quite as bad.\n\nIt’s not that dry in Rome and many of the buildings are dark stone so they soak up the heat during the day and and radiate it back during the early evening.\nAlso, AC is not very prevalent, so research your lodgings very carefully. And, I guarantee the levels in restaurants will not be what you are used to."}, {"username": "Phyllis Snyder", "comment_text": "From what people are saying the major difference is that you’ll be doing a lot of walking and standing in lines- keeping hydrated and resting periodically is important."}, {"username": "Kathy Flood", "comment_text": "Get the fan that hangs on your neck!"}, {"username": "Suzanne Calpito Ragsdale", "comment_text": "I ran into 6 Texans on separate occasions when I was there and we all laughed about the people who told us it was so hot in Italy. But we were also there late June early July right before temps spiked there.\n\nI was just in Vegas where it was 111 and as dry as can be. THAT kind of hot is worse because it is like standing in a preheated oven. It felt WAY more painful, but I could still handle it because I’m from Texas.\n\nThat said, you can get some relief inside, but restaurants and buildings are not as cool as you are used to. I could absolutely get relief in my hotel because it was cold in the room.\n\nSo if you can go out early and get back to the hotel during the hottest part of the day. Italy is definitely open late!"}, {"username": "निनावी सहभागी", "comment_text": "Thank you all for all the helpful info! Ordering cooljng towels and collpsable water bottles now"}, {"username": "Susan Lowry Lamb", "comment_text": "You'll be fine."}, {"username": "Toni Jewett-Chavez", "comment_text": "For those of you using fans and umbrellas. Are the fans the handheld ones that you wave back-and-forth or the battery operated ones? And when you use the umbrellas do you find yourself bumping into people like is it very crowded that they get in the way?"}, {"username": "Paige Hicks", "comment_text": "Take the towels that you can wet and put around your neck"}, {"username": "Brittany Armstrong", "comment_text": "It’s pretty much the same. I was just in Texas and I thought it felt like Rome in July"}, {"username": "Kathy Morra Kuloy", "comment_text": "Cooling towels and fans to hang on your neck! The heat and sweat are real! You’re out in it all day on tours, walking, which may include steep inclines. Not like at home where you can cool off by staying indoors. I’m from Florida and have never sweated so much!"}, {"username": "Lissa Wahlen Goodwin", "comment_text": "Same heat but you’re out and about seeing all the sites when in Rome, as opposed to staying in the A/C in Texas."}, {"username": "Marie Ring", "comment_text": "From the Austin area- went to Rome in early august for a bday/\nanniversary trip a few years ago. Read reviews to never go to Rome in august but we did because of the date. It was 100 every day. I wore a hat, cotton clothes and light in color. The ac is not like in Texas at all. The mornings are nice there and I’d recommend the bus or taxi in the mid day. We went back and showered at lunch, and then before dinner and then after dinner. We were a hot mess but loved every minute of Rome. We have been back since then in early June and late June and it’s so much cooler. Have fun- you’ll love it!"}, {"username": "Sue Gelardi", "comment_text": "The difference between Rome heat and Texas heat is that in Texas, everything is air conditioned to the max."}, {"username": "Kyna Martin Autrey", "comment_text": "I’m from houston and thought the same thing. The difference is many businesses and restaurants just don’t have AC that compares to Texas so there was no where to cool off in the fashion you do here. I felt like I stayed warm the entire time there"}, {"username": "Tracy Foss", "comment_text": "The difference you'll find is in Texas you go from Air conditioning to the air conditioned car & so on. In Italy you'll have to wander around in the heat most places aren't air conditioned like north america 🥶 Have a great trip !"}, {"username": "Renee Rundle Stoneham", "comment_text": "Temp wise it’s the same.\nHowever, at home in TX are you outside walking around a city with lots of concrete? Think being outside for hours in Houston.\nUsually you are going from A/C car to A/C stores etc. COLD A/C in your house.\n\nSo you will feel the heat more simply because you are out in it and exercising and sweating.\n\nA/C in Europe is not like A/C in the US. Think cold is 72-75F. Also there are regulations for using it, most hotels the A/C is set at 75 or above during the day for conservation laws. Ours in Milan had a sign at the desk. So your room will be cool during midday but not cold.\nWhen you leave in the morning close the curtains/\nshutters! It will help keep the sun/heat out of the room.\n\nWater is your friend! I bring power pedalyte in case we get dehydrated."}, {"username": "Christopher A. Johnson", "comment_text": "Texas heat (Houston/\nDallas) is more intense than anything you will get in Italy. Absolutely."}, {"username": "Stacey Esposito", "comment_text": "Cooling towels saved the day in Rome. I thought my son was going to pass out until I was able to get to a bathroom to wet it"}, {"username": "Rasha Za", "comment_text": "July august is better than austin now!! Even houston is cooler than austin so really depends where in texas you’re from. Thing is, if you’re walking the whole time it will feel worse, since we dont really go outside in the summer in Austin."}, {"username": "Jenn Messina Babore", "comment_text": "It is hot but less humid. Water, fans, and breaks should help."}, {"username": "Mo Dee", "comment_text": "I’m from Houston and returned from Italy last week. Some posts here had me a little scared of the hell I’d be in BUT it was fine.\n\nIt was not as hot as here, but close! It was not as humid, which matters so much. The cobblestones send heat back at you from the ground; that wasn’t my favorite.\n\nThere were days my teens didn’t wake up early enough to do anything before 11AM and I still enjoyed my time out. I always had my little umbrella and a personal fan. I had a cooling towel but the only time I used it was during my HIGH NOON Colosseum tour and the Vatican Museum tour that was so crowded despite being booked for 8AM.\n\nTo add some color; I’m a soccer Mom and former baseball Mom (son switched to football in high school) so I’m used to spending long days out in our Texas heat but I always have a personal fan and shaded chair. I can sometimes get a migraine if I don’t drink enough water or if I end up in full sun because I brought the wrong chair. I never even got a regular headache in Italy. 🙂"}, {"username": "Eric Parks", "comment_text": "Rome was like a DFW heat, but not quite so high. It's not like a Houston heat with the oppressive humidity."}, {"username": "Jazmin Avila", "comment_text": "It’s the same. Some days were more humid than others. The only thing that’s not the same is AC. Most establishments will not have super cool ACs like we’re used to in the states. So overall just prepare to be more on the hotter side the majority of the day. Hotels usually have fine ACs though."}, {"username": "Lori Wroblewski", "comment_text": "Its not near as hot as Texas"}, {"username": "Pia Reilley Loughin", "comment_text": "I’m in Rome now and it is hot but not bad. Usually a breeze and if in the shade it’s fine.\nIt was over 100F when we arrived and now around 90 the past few days.\nNot bad at all.\nBut like Mo Dee mentioned, the cobblestones reflect the heat right back to you!"}, {"username": "Vernell Carranza", "comment_text": "We are from California and have been traveling for the past 8 days in the heat…hand fans a must! Early mornings and late nights are great. Is it hot and humid? Yes. But, your in Italy, it’ll be great!!! Enjoy your trip!! Light cloths are a must. Linen and cotton."}, {"username": "Rachel Gray", "comment_text": "From Texas, currently in Greece but was just in Italy. It’s hot as crap lol, not even comparable. Cool towels saved us, I highly recommend getting some before your trip"}, {"username": "Laura Smith-Pursel", "comment_text": "In my opinion…it’s worse but only because finding AC or a really cold drink to take the edge off can be nearly impossible. In Texas you could step into any restaurant and get AC and an ice water and then head back out feeling slightly refreshed. Can’t do that here which, to me, makes it more difficult to cool down. I still love it here but I live here so I don’t have a choice lol"}, {"username": "Hollie Barcheck Juersivich", "comment_text": "It’s over you’re good!! My last day as yesterday and it was bearable."}, {"username": "Evelyn Brown", "comment_text": "I'm from Texas, and live in Milan. Similar heat, high humidity, weak air conditioning. We use hand held fans when we are out."}, {"username": "Joe LaLonde", "comment_text": "Texan and was just there a couple weeks ago. Not as bad as Texas, I found the humidity wasn’t nearly as bad. I flew back into DFW and instantly noticed the difference. But as said above, AC over there isn’t always as good as we’re used to. My Airbnb in Rome had one unit in the living room, which didn’t quite get the bedroom as good as I’d prefer."}, {"username": "Susan Hutson Hoss", "comment_text": "We have quite a run of 100 degree days in Texas this summer so probably hotter here. But, we use the AC here and I sense that they minimize usage in Italy. That could make it feel as hot cause harder to find places to cool off?"}]}, {"id": "2201293056936439", "text": "Best hotels to stay in Rome? Early October stay looking for 3/4 stars and nothing that breaks the budget but want something comfy and safe. Location would be somewhere safe but metro easy to access.\n\nThanks!", "link": "facebook.com/groups/1373361046396315/permalink/2201293056936439/", "likes": 0, "comments": [{"username": "Becky Picone", "comment_text": "We just stayed at the Hotel Delle Nazioni and I cannot recommend it enough! It is steps away from the Trevi Fountain, and a quick walk to both the Spanish Steps, lots of shopping, and the Pantheon. Great coffee/\npastries/gelato/\nrestaurants all around. It also had a great staff and a nice buffet breakfast. We booked out 6months so it was very reasonable- not sure what it’ll be like booking now.\nHave a wonderful trip!!!"}]}, {"id": "2201300323602379", "text": "Looking for some guidance on how to book fast speed trains on Trenitalia! Is there a way to know if a train is high speed other than comparing the times? What kind of average cost between high speed and regular for Rome to Florence, booking about 3/4 months in advance?", "link": "facebook.com/groups/1373361046396315/permalink/2201300323602379/", "likes": 2, "comments": [{"username": "Dave Conroy", "comment_text": "Well time is the definition of a high speed train. Check Trainline for options as it's a bit clearer imo."}, {"username": "Stacey Esposito", "comment_text": "The fast trains says ferriarossa I know I'm spelling it wrong, but you will see that need to the train. Also check to make sure you don't need to make connections. I booked from rome to venice with no connections so you have to look. I'm attaching a screen shot for reference"}, {"username": "Paola Pulga", "comment_text": "on the Trenitalia website it says Freccia rossa"}, {"username": "Rose Stolarek", "comment_text": "Frecciarosssa trains are fast but if you go on the treniitalia site you. An see how long it takes to get to a place and what are the stops"}, {"username": "Jenn Messina Babore", "comment_text": "Tickets are only available 30-60 days out for TrenItalia typically."}, {"username": "Jenny Larsen", "comment_text": "Also don’t depend on them we booked Frecciarossa fast train and it was an hour late . Didn’t matter for us just saying"}, {"username": "Todd N Nicole Clarke", "comment_text": "I used the Trainline app, I was able to see both trains and all the times, chose my class and seats and always had problems with other sites, the tickets then went into my apple wallet"}, {"username": "Ibbu Mohd", "comment_text": "Book italo, better."}, {"username": "Clelia Minucci", "comment_text": "Only the trains named \"FRECCIA\" are high speed train. Freccia rossa, freccia argento e freccia bianca.\n\nThe trains named INTECITY or REGIONALE are definitely NOT high speed"}, {"username": "Michele Levesque Semosky", "comment_text": "I much prefer Omio"}, {"username": "Steph Craddock", "comment_text": "If it's a fast train there will be the word Freccia there.\nFreccia, Intercity then regional trains are the slowest"}, {"username": "Sarah Louise", "comment_text": "We booked off trenitalia about one month in advance- Rome to Florence (just got to Florence today) and purchased the \"you and me\" package and we paid 30 euro each (not sure if that is a good deal or not).\nThe experience was seamless and very convenient"}, {"username": "Arianna Reel Cook", "comment_text": "I like the Omio app"}, {"username": "Richelle Trezise", "comment_text": "Look at time we have booked trenitalia fast train florence to rome"}, {"username": "Frank Hunt", "comment_text": "Trainline app, it’s the best thing since apps began.😂😂"}]}, {"id": "2201305793601832", "text": "Need some help. I have booked a train from Sorrento to Rome. The first train, which I believe is a local arrives at Naples Piazza Garibaldi. I have 20 minutes for a connection that departs from Napoli Centrale. The second connection is Rome Termini to Airport. I only have 10 mins for this connection. Will this be enough time? Any suggestions are appreciated.", "link": "facebook.com/groups/1373361046396315/permalink/2201305793601832/", "likes": 5, "comments": [{"username": "Dave Conroy", "comment_text": "If you're lucky and have light bags, why not. If you're unlucky and have lots of heavy bags, likely no. Basically it depends irrespective of the answers you get."}, {"username": "Cat Furness", "comment_text": "I would think you are pushing it very close. From experience, the train from Sorrento usually runs late & you need to get up to the top of the station to get the next train? It’s a bit of a walk."}, {"username": "Miyuki Kanno Paul", "comment_text": "There will be so many people transferring at Roma Termini. It would be wise to have more time than 10 minutes to FCO."}, {"username": "Barone Raffaele Cortese", "comment_text": "Dovresti prendere la circumvesuviana\nda sorrento a Napoli centrale. Ti consiglio di partire con netto anticipo dato che non è mai puntuale"}, {"username": "Kelly Rae Snider", "comment_text": "The local train from Sorrento to Girabaldi/\nCentrali is often late. The “all trains run in time in Europe” failed to mention the southern Italy exception. The train from Termini to the airport is called the Leonardo Express and you don’t need to book it in advance. I would save that one to purchase when you actually arrive.\n20 min from arriving at Napoli Centrale to departure is enough time if nothing is delayed and your light footed. I’d give yourself more time for the very likely event of delays."}, {"username": "Amalia Cristina", "comment_text": "No way from Rome Termini to the airport!"}, {"username": "Laura Uribe", "comment_text": "The Leonardo Express from Rome Termini to the airport runs every 15 minutes. Just choose one of the next trains so you have enough time to make the transfer."}, {"username": "Sue Sherwood", "comment_text": "We were just there. We took a car from sorrento to Napoli and then the train to Rome. We took a car to the airport."}, {"username": "Phyllis Snyder", "comment_text": "10min is an issue! Can you reschedule?"}, {"username": "Jeff McLellan", "comment_text": "Won’t be if the train is delayed at all. Almost every train we took ended up behind me missed a connection to Florence and had to book seats on a later train to ensure we actually got to Florence around 5PM instead of 9PM"}, {"username": "Marianna De Maio", "comment_text": "The station is the same. Napoli Garibaldi is Napoli centrale, they are just call differently to make the distinction in between the tracks for the local train and the fast train. Napoli centrale is just upstairs, that said tough, I would go way earlier, the station is pretty busy and the circumvesuviana\nis constantly late"}, {"username": "Giorgio Zanichelli", "comment_text": "20 minutes is easy, 10 minutes is also easy if there's no delay"}]}, {"id": "2201307363601675", "text": "If one was to do a week in Switzerland, a week in Croatia and 3 weeks in Italy, may I ask which way you would go about doing it for those that may have done Europe", "link": "facebook.com/groups/1373361046396315/permalink/2201307363601675/", "likes": 2, "comments": [{"username": "Tijana GH", "comment_text": "It depends when in a year. Geographically Switzerland - Italy - Croatia or the other way around. It depends also, where your incoming flight is coming to."}, {"username": "Mel Peci", "comment_text": "This year, we landed in Milan, picked up a lease vehicle and drove clockwise around the Adriatic, then caught the ferry from Dubrovnik to Bari. We then made our way to Rome and flew home there. We covered, Italy, Austria, Slovenia, Croatia and Montenegro. (3 months)"}, {"username": "Paul Vincent", "comment_text": "Switzerland- Italy - ferry bari-dubrovnik."}, {"username": "Ian Fawkner", "comment_text": "Croatia- Italy - Switzerland for me"}, {"username": "Barba Ra", "comment_text": "Between Italy and Croatia is Slovenia. You won't regreted if you will stop by"}, {"username": "Rhona OConnor", "comment_text": "Bring lots of money for 🇨🇭 I found lucerne georgous but very expensive."}, {"username": "Sondra Varner", "comment_text": "I think it depends on what you have planned to do? I just got home last night from Italy/\nSwitzerland. We had SO MUCH planned in Italy that we decided to do that first so that we could spend our time in Switzerland more relaxed."}, {"username": "Gina Gourlay-Blackberry", "comment_text": "If you needs tips for Switzerland, I’ve lived there so happy to help with recommendations\n. How are you travelling between countries?"}, {"username": "Laura DeCicco", "comment_text": "Croatia-ferry to Bari, and Switzerland after Italy. That way you’re moving north as it gets warmer"}, {"username": "Connie Wilson", "comment_text": "I would fly into Zurich and spend most of the time in the mountains and lakes of the Berner Oberland. Taking the train to northern Italy, you can stop for a night in Zermatt to see the Matterhorn. Continue on to Lago Maggiore and spend a couple of days in Stresa, before heading to Milan and beyond. I would end up in Venice for an easy trip to Croatia, where I’d relax on the beautiful beaches before heading home."}, {"username": "Megan Leigh", "comment_text": "I would start in Italy as it's the most crowded and you're heading into high season. Then probably Switzerland just because it makes geographical sense to do so and then down to croatia when the weather will be great for the islands (assuming you want to visit the islands). On the other hand, if you're wanting to spend more time on the mainland, maybe visit croatia second so that it's not unbearably hot and then head north."}, {"username": "Diana Smith", "comment_text": "First Italy, drive to Switzerland and drive or take a ferry to Croatia."}, {"username": "Sonita Sandhu", "comment_text": "Loved Croatia! Flights from Rome to Split are 1 hr. I started in Italy and then spent 10 days in Croatia on a cruise that takes you to 5 islands and then flew back to Rome from Dubrovnik. You will love it!"}]}, {"id": "2201309526934792", "text": "To anyone who hired a car or multiple cars while in Italy, how long was it before you got your 'block' payment back. If ever. We have been back for over a month and still nothing.", "link": "facebook.com/groups/1373361046396315/permalink/2201309526934792/", "likes": 4, "comments": [{"username": "Giovanni Pianigiani", "comment_text": "What is the block payment?"}, {"username": "Joe Guzzi", "comment_text": "They have a year to pay."}, {"username": "Daria Dandolo", "comment_text": "You should have gotten it back the same day when you returned your car."}, {"username": "Debbi Mayfield", "comment_text": "Did you pay that when rented online or st the car rental counter? I’m wondering because my husband is gonna die if it’s more than the $6500 we’ve paid since Feb for a sept trip"}, {"username": "João Petinga", "comment_text": "We got ours a day after signing the check-out form. I always make sure to ask when the it’s released and I’ve never waited more than a week"}, {"username": "Lisa Reeve", "comment_text": "Ours will be 2000€ which is AUD$3500 😮. Hope they don’t hang on to that for too long after we drop it back 🤦‍♀️"}, {"username": "Libby Hurcombe", "comment_text": "Do they still take a block payment if you take out full cover insurance ?"}, {"username": "Angela Cagna Gaberel", "comment_text": "A week"}, {"username": "Domenica Calvene", "comment_text": "If you mean payment then around 5 days"}, {"username": "Graham Sherlock", "comment_text": "Another reason never to drive in Italy"}, {"username": "Simone Pfenninger", "comment_text": "1 week"}, {"username": "Naritta Nurit Matheus", "comment_text": "We gave cash."}, {"username": "Matteo Basile", "comment_text": "Normally is up to 15 working days. If is already a month just ask via email to them"}, {"username": "Alexandra A Welker", "comment_text": "My friend went to Turkey in mid May and she didn't't get her deposit back for 8 weeks (even though they said it will be returned in 6 weeks) so she disputed with her CC. I would do the same."}, {"username": "Rosa Defilippis", "comment_text": "I cancelled mine and it took 25 days and 3 emails before I got my money back"}, {"username": "Fleur de Liz", "comment_text": "Mark Mojica"}, {"username": "Ivonne Gonzalez", "comment_text": "You need to harass them. Same happened to me and I received my payment within 2 weeks from arrival."}, {"username": "Deborah Coram", "comment_text": "When we returned the car. We hired with Avis and budget."}, {"username": "Katrina Scott", "comment_text": "They don’t take it if you have full coverage, which is a lot more but worth it for piece of mind in my opinion, especially while we were in Naples and Amalfi Coast"}, {"username": "Lynn Uimonen", "comment_text": "Just got the deposit back, took a full week."}, {"username": "Yvette Bachour", "comment_text": "I got mine back within 1 week"}, {"username": "Grace Sulsenti", "comment_text": "We only used Avis (or Hertz). Never had a 'block payment '"}, {"username": "Carol Hayes", "comment_text": "Amex covers insurance for car rentals so I don’t buy extra insurance at the rental place. Does it work the same way in Italy? Thanks."}]}, {"id": "2201310726934672", "text": "Searching for feedback on our planned itinerary, arriving into Venice on September 30th, flying out of Rome on October 10th.\nVenice (2 nights)\nCinque Terre (2 nights)\nFlorence (1 night)\nTuscany (2 nights)\nNaples (1 night)\nRome (2 nights)\n\nWe’re aware it’s a lot of travel - we want to try and see each of these places, with our biggest priorities and hopes of doing a few cooking classes, relaxing at a winery/agriturismo in Tuscany, and seeing some of the well known historical landmarks.", "link": "facebook.com/groups/1373361046396315/permalink/2201310726934672/", "likes": 7, "comments": [{"username": "Graham Sherlock", "comment_text": "Instead of CT, Florence, Tuscany ... just base yourself in glorious Lucca and do day trips to these places. You don't want too much packing and unpacking."}, {"username": "Jess Armour", "comment_text": "Maybe look to cut out Naples? It’s a long way to head south for just one night"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Too much. You will spend most of your time on trains and checking in and out of hotels."}, {"username": "Paul Ryley", "comment_text": "Cut out Naples extra day in Tuscany or Rome!"}, {"username": "Tanya Ramsey", "comment_text": "More in florence... its amazing!!"}, {"username": "Rhona OConnor", "comment_text": "Traveling between places takes time.... I think you need at least 2 nights in each place. We stayed 3 nights. 1 Travel, 1 sightseeing, 1 relaxing and wandering."}, {"username": "Lisa Kelly", "comment_text": "I’d take out one of these three to make it more doable: Cinque Terre, Tuscany or Naples. If you stay in Florence for 3 days you can take a day trip to Siena or CT. You’re kinda zigzagging all over which will cause too much travel time."}, {"username": "Lucrezia Folger", "comment_text": "Venice (2 nights)\nCinque Terre (2 nights)\nFlorence (3night)\nRome (3 nights)"}, {"username": "Steve Grossman", "comment_text": "You are going to be in the car or the train a lot. Sorry this trip just doesn't work.\nRethink it and spend a minimum of two nights in each city"}, {"username": "Sande Ricci", "comment_text": "6 places in 9 days is way too many. Pick 2, maybe 3 tops. You will be spending all your time traveling and checking in to your hotels!"}, {"username": "Anita Clayton", "comment_text": "Stay 3 nights in Florence and do a day trip to Cinque Terre. I love naples but for 1 night I would miss it out"}, {"username": "Phyllis Snyder", "comment_text": "Florence 1night?"}, {"username": "Julie Agarkov Mayblyum", "comment_text": "There will not be much relaxing with this itinerary. I would definitely recommend to nix Naples this time around. Also, 1 night in Florence only gives you half a day there. I would (and did during one of my trips) stayin rural Tuscany not far from Florence for 3 nights, and visit Florence as a day trip. This is to minimize constant checking in and out of hotels, etc."}, {"username": "Diana Granado", "comment_text": "Cut Naples and add one more day to Florence"}, {"username": "Dominique Tarplin", "comment_text": "Hi! I would certainly cut out Naples and spend more time in Florence. Keep in mind, Florence is in Tuscany so it’s one in the same. You wouldn’t want to miss the Ufizzi gallery, the David, Ponte Vecchio, the leather market, and all the other amazing sites to see there. You can take a day trip to the Chianti Hills for a wine tour and cooking class. You could also hop over to Pisa or Siena for a day trip if you want. We made Florence our base for 4 nights and did all of the above and more. Enjoy your trip! You’re going to have a wonderful time ❤️"}, {"username": "Charleen Siegler Schuss", "comment_text": "Don't stay in any town less than one night is my advice. Taking the train uses up a lot more time than the published 2 hr train ride."}, {"username": "Danielle Gervais", "comment_text": "Cut Naples go to Sorrento and from there go visit Capri and come back to Sorrento/ from Sorrento you can see the gulf of Naples, Capri ( it’s a short ride) and you also have a view of the Vesuvio"}, {"username": "Leanne Dawn Sutton", "comment_text": "Venice 2 Florence 3 Tuscany 2 Rome 3"}, {"username": "Kim Finger McCormack", "comment_text": "I would fly into Florence and cut out Venice and stay somewhere between Florence and Cinque Terre so you can do day trips and the cooking classes/\nwineries. Head into Southern Tuscany and explore for a few days/nights, then head to Rome for 3-4 nights."}, {"username": "Pam Kimak", "comment_text": "I'm exhausted just reading about your plans. My daughter,her sons and I just returned from an 11 day trip, flying out of Newark NJ. We were going to go to Florence, Rome, and Maiori, but she thought it would be too much..and she was right. We decided to pass on Florence, and spent 3 nights in Rome and had one morning tour at Vatican. We took a train to Naples and ar transfer to Maiori...a beautiful town with many restaurants.. staying at a hotel across from the Tyranian Sea. A wonderful trip!"}, {"username": "Renee Rundle Stoneham", "comment_text": "I’d combine Tuscany and Florence into 3 nights in Tuscany and do a day trip to Florence. (Not a Monday as the Academia & Ufuzzi are closed)\nThat eliminates switch accommodations and unpacking etc and saves time!\nYou can also combine CT and do day trip there too and have 6 nights in Tuscany! That sounds more relaxing to me while still getting to see all the places you want.\nFlorence or Lucca is a good central location to see both Tuscany & CT.\n\nSame with Rome and Naples. Stay in Rome and do a day trip by train to Naples. It’s direct and very easy!\nOr I would cut Naples and enjoy Rome! You can never have enough days in Rome.\nYou can do a day trip to Pompeii from Rome if you really must see it.\n\nOr… cut Venice and do Tuscany, Rome and Sorrento."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2201315260267552", "text": "I understand kids are free at the colosseum.\nHow do I get their tickets?\n\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2201315260267552/", "likes": 1, "comments": [{"username": "Jenn Messina Babore", "comment_text": "Coopculture.it if you can get tickets, you will see the option. Not all tickets are free for the kids. The main entry are free, but anything with a tour guide will be additional."}, {"username": "Ben Parlopiano", "comment_text": "Is that worded correctly? LOL"}, {"username": "Bellafab Fabrizio", "comment_text": "Viator easy and self guided. Hated the guided tours they take way too long"}]}, {"id": "2201317306934014", "text": "Calm and beautiful, the Amalfi coast😎", "link": "facebook.com/groups/1373361046396315/permalink/2201317306934014/", "likes": 74, "comments": []}, {"id": "2201318310267247", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2201318310267247/", "likes": 1, "comments": []}, {"id": "2201318856933859", "text": "I have greatly appreciated the information I’ve received from this group. I’m now looking for some suggestions. We have our trip booked to fly into Venice, travel to Cinque Terre, Florence and Rome for the last two weeks of August. Everything has been booked for some time.\n\nWe now find that we may have the option of adding a week to the start ofआणखी the holiday. We would likely still fly into Venice, but a week earlier. I don’t want to mess with the accommodations we already have booked. I‘m looking for suggestions of where to spend that extra week knowing that we will be coming back to Venice to resume our originally planned trip. Oh - we have two middle school aged kids. Any suggestions of where to stay for that week?", "link": "facebook.com/groups/1373361046396315/permalink/2201318856933859/", "likes": 2, "comments": [{"username": "Jenn Messina Babore", "comment_text": "Can you just change the dates of the accommodations already booked? You may want to look at the Lake Garda or Como area, but coming back to Venice may not make the most sense."}, {"username": "Renae Larcus", "comment_text": "Not far to Lake Como or Garda. Also Verona"}]}, {"id": "2201326743599737", "text": "Florence question….is the time slot chosen for the Brunelleschi pass to climb the dome? Do we need to pick a time slot to climb the bell tower? It says I have 3 days to visit the sites with the pass. Do those 3 days begin after the time slot I picked or can we go a day before the chosen time slot?", "link": "facebook.com/groups/1373361046396315/permalink/2201326743599737/", "likes": 0, "comments": []}, {"id": "2201320523600359", "text": "Does anyone have advice about visiting the Duomo in Milan and how much time is recommended to tour it?", "link": "facebook.com/groups/1373361046396315/permalink/2201320523600359/", "likes": 0, "comments": []}, {"id": "2201327626932982", "text": "Has anybody stayed at the Hotel Romanico Palace & Spa? I’d love some personal reviews and hidden gems. TIA", "link": "facebook.com/groups/1373361046396315/permalink/2201327626932982/", "likes": 0, "comments": []}, {"id": "2201331430265935", "text": "Hello. Will be in Rome for 8 nights in October. We believe we want to go outside Rome 1 or 2 days. We KNOW we want to go to Orvieto. We are trying to decide if we take the train to Orvieto for the day one day, and then a train to another town on another day…OR…do we rent a car…drive “somewhere” north of Rome(which could be to a town OR just aआणखी scenic drive)…stay a night wherever we go and/or in Orvieto that night…visit Orvieto that 2nd day and drive back to Rome at the end of that day. Note-we do not want to go to Florence or Pisa on this trip. We plan to do another trip at some other time where we can spend a couple days in that area. Also-any tips on renting/returning cars in Rome are welcome.", "link": "facebook.com/groups/1373361046396315/permalink/2201331430265935/", "likes": 1, "comments": [{"username": "Jenny Payne", "comment_text": "Take the train to Orvieto & the other place is Tivoli train as well beautiful gardens 🌻"}, {"username": "Cindy Sguazzin", "comment_text": "Please consider a day-trip to Tivoli. It is so very beautiful, refreshing, and fascinating from an historic perspective."}, {"username": "Roxanne Patti", "comment_text": "Train to Orvieto from Rome was easy and cheap! We did hire a driver to bring us back to Rome b/c it was a day trip and we wanted to stay later. It seems like the train schedule was kind of limited - might have been a Sunday. To stay later meant being at train station in Rome late and then trying to get a taxi to hotel and it made my friend and I uncomfortable. Probably wasn’t really anything we should have worried about."}, {"username": "Alice Francesca", "comment_text": "Check Spoleto too\nhttps://\nwww.thegeographi\ncalcure.com/\npost/\none-day-in-spole\nto-itinerary"}, {"username": "Graham Sherlock", "comment_text": "Take the train to Orvieto, spend a night or two there, you will be so glad to get out of Rome"}, {"username": "Roland Trego", "comment_text": "If you are open to renting a car, I highly recommend seeing Orvieto, then either Civita di Bagnoregio (30 minutes south of Orvieto) or Pitigliano (1 hour west of Orvieto).\n\nDAY TRIPS FROM ROME.\n+Orvieto (by train) Very enjoyable.\n+Villa d’Este (by train) Popular.\n+Ostia Antica (by train) Popular.\n+Naples (high-speed train).\n+Reggia di Caserta (by train). Lavish royal palace often compared to Versailles. Impressive grounds with fountains.\n+Castel Gandolfo (by train) Summer home of the Pope with beautiful grounds and large lake in a volcanic crater.\n\nDAY TRIPS NORTH OF ROME WITH CAR RENTAL:\n+Calcata Vecchia (Lazio). Yet another tufo village, this one quite small.\nLake Bracciano towns (Lazio): Bracciano, Anguillara Sabazia, Trevignano Romano*\n+Palazzo Farnese (Viterbo), about halfway between Lake Bracciano and Civita di Bagnoregio, has interesting architecture. Good for an hour’s visit and lunch.\n+Civita di Bagnoregio***(V\niterbo) (must-see) 1h35m north of Rome, or 30m south of Orvieto\nSoriano nel Cimino (Viterbo)\nCaprarola: Villa Farnese* (Viterbo)\nBagnaia: Villa Lante* (Viterbo)\n+Pitigliano (Tuscany)***(. Also magnificent. Built on tufo. (must-see)"}, {"username": "Rhonda Weinstock", "comment_text": "Hotel Virgilio in Orvieto is a small boutique hotel right across from the Duomo and in the center of town. Very quiet, air conditioned and very nice workers. This is IF you stay a night or two. It’s lovely!"}, {"username": "Rhonda Weinstock", "comment_text": "Rhonda Weinstock"}]}, {"id": "2201337210265357", "text": "Hello Everyone! My fiance and I are going to Italy on our honeymoon end of October. We plan on visiting multiples places over 15 days. Was just wondering if anyone knows lots of information about trains as we have decided driving might be to much for us! Any information would be greatly appreciated. 😁", "link": "facebook.com/groups/1373361046396315/permalink/2201337210265357/", "likes": 2, "comments": [{"username": "Sandy Michelle Duggan", "comment_text": "The trains are so easy to navigate and so comfortable and reliable"}, {"username": "Jenn Messina Babore", "comment_text": "Trains are very easy to use and navigate. TrenItalia will have info on the trains."}, {"username": "Alice Francesca", "comment_text": "Trains are the way to go."}, {"username": "Renae Larcus", "comment_text": "Easy. Go to Rome2Rio app for routes and tickets. Also Trenitalia"}, {"username": "Gianna Onesi", "comment_text": "Trenitalia is the best app no third party vendor."}, {"username": "Rhona OConnor", "comment_text": "I did 4 train trips for the first time this year. Worked out very well 👌 we stayed close to the stations in each place which was easy. Trains are punctual so be there in lots of time. I used Trainline app to book about 2 days in advance."}, {"username": "Laura Uribe", "comment_text": "Italy has an amazing public transportation infrastructure.\nIf you can’t get there by train, then a bus works well. The only time a car would be better would be if you’re visiting small towns in the center of the country. Congratulations\n!"}, {"username": "Nancy Koehler Barboni", "comment_text": "Love the trains! However, driving the Chianti road was amazing! So amazing that we turned around and did it again! 🤪"}, {"username": "Robin Burrell", "comment_text": "Trains are easy to take. Watch a you tube video or two to get the hang of it. I use Trainline app to order tickets. I find it easy to use and your tickets are stored on site, no need to validate them at the station. Just get on, drink wine, watch the scenery. Download Rome to Rio app on the phone to see distance time and routes between towns or even addresses"}, {"username": "Tricia O'Leary Keane", "comment_text": "Trains are the way to go … we’re travelling from The Cinque Terre Italy to Rome atm and so easy by train 💕💕"}, {"username": "Tonsia Keytel", "comment_text": "Trainline app, it’s very easy to use."}, {"username": "Connie Wilson", "comment_text": "This explains train travel in Italy perfectly! Download the TrenItalia App to search schedules and purchase tickets.\n\nhttps://\nwww.seat61.com/\ntrain-travel-in-\nitaly.htm\n\nhttps://\nwww.trenitalia.c\nom/en.html"}, {"username": "Steve Grossman", "comment_text": "We have driven in italy forty one times. With g p s on your phone you can't get lost. The crowds will be gone by the end of october. When you drive you can go where you want when you want. An example would be if you are in tuscany and going to many towns, you need a car, Unless you want to pay for a driver for the day.\nPaying a driver for the day is the equivalent of three days worth of rental car. Think about it it's not difficult"}, {"username": "Bea Kuckens", "comment_text": "https://\nwww.thetrainline\n.com/\nen-us?msclkid=9c\n6d577415401cd22\n34433b007e2ee1f\n&utm_source=bin\ng&utm_medium=cp\nc&utm_campaign=\nEN-US_Brand_%5E\n_%5E_%5E_Trainl\nine_Phrase_BSH1\n5E8&utm_term=tr\nain+line+eu&utm\n_content=EN-US_\nBrand_%5E_Train\nline_%5E_%5E_%5\nE_Europe_%5E_Ph\nrase&gclid=9c6d\n577415401cd2234\n433b007e2ee1f&g\nclsrc=3p.ds"}, {"username": "Brittany Simms", "comment_text": "Thank you soo much everyone!!"}]}, {"id": "2201340000265078", "text": "I want to go to the Synagogue and Jewish Museum in Florence. The websites directs me to Vivaticket and I set up an account to try to buy advance tickets. When I put this venue in Vivaticket, it tells me they cannot find this venue. I tried English and Italian. Has anyone gotten tickets for the Synagogue & Museum thru this site. Would love any tips. I do not want the aviator tour. Thanks so much", "link": "facebook.com/groups/1373361046396315/permalink/2201340000265078/", "likes": 0, "comments": [{"username": "Fran Haskell", "comment_text": "We went many years ago. I don't think we needed tickets. Try to call local Chabad"}, {"username": "Ellen Lefkowitz", "comment_text": "We used a wonderful tour guide for this very same experience. Pm me if you want her info !"}]}, {"id": "2201344990264579", "text": "Do I need tickets for the colessium for kids\nHow do I book those on coopculture\n\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2201344990264579/", "likes": 4, "comments": [{"username": "Gina Christopher", "comment_text": "I am wondering the same. Seems to be an issue with thier site recently."}, {"username": "Andrea Sontz", "comment_text": "They recently changed their system. You get them at a ticket booth on site the day you go. I found after I had already bought a ticket for my daughter and emailed them. But it might be better to pay in advance then have to wait on a long line."}, {"username": "Sharon Teoh", "comment_text": "Aren’t they the reduced tickets on the website? I need to get one too and was told reduced tickets are for kids."}, {"username": "Yuko Y Smith", "comment_text": "Me and my husband went colosseum last May without reservation.\n\nNo tickets ware sell on the site, the only way we get inside of Colosseum was join\nTour guide group tour. It cost 100€ for two.\n\nThree month ahead of Reservation is must!"}, {"username": "Gaynor Williams", "comment_text": "Go to ticket office at the Forum. Queue much smaller."}, {"username": "Heather Baumann", "comment_text": "You can choose the reduced ticket online when booking your own ticket."}, {"username": "Megan O'Brien Kinsella", "comment_text": "Was just there today! Please note about children/\nminors need proof/\nidentification to enter. I’ve been carrying passport paper copies."}, {"username": "Sunny Lang Fan", "comment_text": "What is the age limit to considered kids ?"}]}, {"id": "2201346446931100", "text": "Thank you everyone for your amazing info and comments. I'm finding it quite overwhelming and am trying to keep our trip fairly simple. We are going to Rome and Florence in October and I'm trying to book our hotels. We want to walk to all of the sights in both places and stay in midrange accomadations. Recomendations please. If we took the train from the airport is it easy to walk to our hotel with luggage and later get to the train to Florence? Thank you so much.", "link": "facebook.com/groups/1373361046396315/permalink/2201346446931100/", "likes": 4, "comments": [{"username": "Ann LaGreca", "comment_text": "Get a good street map of both cities, map out what sites you want to walk to and go from there . Rick Steve’s guidebooks have excellent street maps."}, {"username": "Laura Uribe", "comment_text": "Honestly, to be close to the train station is a bit of a haul to the sites. Plus, the area around the train station can be a little rough imo. To see if it feels walkable to you, go to Mapquest. Put in the train station address and then the address to your hotel. Same applies to Florence. We took a cab to our hotel in both places."}, {"username": "Diane Davis Lawyer", "comment_text": "Try AirBnB. We have beautiful ones in both places that are in great locations and great prices."}, {"username": "Bill Casper", "comment_text": "Try booking or air bnb for reasonable prices."}, {"username": "Cynthia Marie", "comment_text": "I use google maps for reference. I’ve always find it very helpful when searching for a hotel."}, {"username": "Tari Lawson", "comment_text": "I stayed at Princeps Boutique Hotel. It is near the train and Colosseum. Unsure of prices as I had credit from 2020. It was very nice."}, {"username": "Kristina Ruk", "comment_text": "I search on Booking com, put location I want and then turn on hotels on a map ;)"}, {"username": "Alice Francesca", "comment_text": "In Florence there are very nice hotels also in the area of the station, which is absolutely fine.In Rome you might have to walk 10 minutes to Monti, the closest quarter with nice hotels."}, {"username": "Megan Tarleck Jensen", "comment_text": "We stayed at Hotel Porta Faenza in Florence - easy 5 min walk from train station. Wonderful staff and breakfast and easy to walk to sites!"}, {"username": "Debbie Cooper Goldman", "comment_text": "We stayed at palazzo Castri 1824. Walking distance to train, good location, great breakfast"}]}, {"id": "2201383260260752", "text": "Hi All,\n\nFor those who have been to Puglia, specifically, Trani, Lecce and Matera what were some of the highlights of these towns?", "link": "facebook.com/groups/1373361046396315/permalink/2201383260260752/", "likes": 1, "comments": [{"username": "Kay Rendall", "comment_text": "Matera was the highlight. Staying a cave hotel. Exploring the sassi. The cave restaurants. The views, lights at night. The rock church.\nAlso Ostuni, the old city was magic to stay for a few nights. No cars, all narrow alleys. The views from the top of the wall."}, {"username": "Sally Warren", "comment_text": "Lecce: the beautiful baroque architecture, the Duomo and museum. Funky boutiques and a Roman amphitheatre.\nMatera: find the Dali sculptures, walk to other side of the torrente Gravina and up to the lookout Belvedere Murgia Timone.\nAperitivi in open air caves."}, {"username": "Cameron Smith Bradley", "comment_text": "Matera is simply magical. I would have loved more time there. Check out Polignano a mare. So incredibly beautiful."}, {"username": "Kay Rendall", "comment_text": "Poliginano La Mare this year. 6 weeks Puglia. Can't wait"}]}, {"id": "2201384463593965", "text": "Most comfortable waterproof long distance walking shoe for sightseeing. TIA", "link": "facebook.com/groups/1373361046396315/permalink/2201384463593965/", "likes": 36, "comments": [{"username": "Yhele Apidga", "comment_text": "@Vessi the best!!"}, {"username": "Janie Gutierrez", "comment_text": "Brooks makes a waterproof women’s shoe. It’s a Ghost 24 GTX"}, {"username": "Gordon Cooper", "comment_text": "Skechers or On Cloud running shoes. We just did 5 weeks in Italy and I wore my Skechers every day walking 10-15 km per day"}, {"username": "Holly Gregg", "comment_text": "Dansko. I walked all over Italy last year w mine. Was there 3 weeks. Couldn’t believe how comfortable they were. Came home bought more in other colours."}, {"username": "Barb McGillivray", "comment_text": "All Birds! Mizzles. 3 of travelled Ireland we all wore All Birds. ❤️❤️❤️"}, {"username": "Andrea Wurm", "comment_text": "My feet for some reason really like New Balance. Maybe not the cutest tennis shoes but my feet feel like heaven."}, {"username": "Jean Oh", "comment_text": "From Fitflop - flip flops 🩴 r the best in summer. Surprisingly comfy."}, {"username": "Jessica Gilson", "comment_text": "Frankie 4"}, {"username": "Genny Zimmer Painter", "comment_text": "I have found that what works for some does not work for others. Go try on several different styles."}, {"username": "Dorothy Press", "comment_text": "I used Hokas and Clarke sandals for our 3 week trip in Italy-Sicily."}, {"username": "Annmarie Chenoweth Burmeister", "comment_text": "You want to break in whatever shoes you buy! I’m here now and my new expensive sneakers gave me awful blister the first day. I’ve been wearing my birks the rest of the week. No issues"}, {"username": "Holly Girgenti", "comment_text": "Vessi - comfy and waterproof"}, {"username": "Heidi Johnson Deckert", "comment_text": "ON brand!"}, {"username": "Kim Seibert", "comment_text": "M. gemi-Italian leather sneakers. Over 20,000 steps each day and very comfortable"}, {"username": "Helene Wolman Sacks", "comment_text": "Allbirds!! So comfy from the second I put them on!"}, {"username": "Tamara Gordinskaya", "comment_text": "Ecco has some good models. Just got these myself 🙂"}, {"username": "Jane Hopkins Rosner", "comment_text": "https://\nwww.googleadserv\nices.com/\npagead/\naclk?sa=L&ai=DCh\ncSEwiq9-uem7WAA\nxVtMq0GHXxhBDQY\nABAPGgJwdg&ohos\nt=www.google.co\nm&cid=CAASJuRoR\niAh5HsJnN_IZQ4n\n5ghwZ5zmCMAI4t7\nF6dXNwMsZps2pJ4\nsX&sig=AOD64_3y\n6jSecDvAC2hc84p\ntIugNGCKKEA&cty\npe=5&q&ved=2ahU\nKEwjqgeKem7WAAx\nUXJEQIHSbqBNsQw\ng8oAHoECAUQFA&a\ndurl"}, {"username": "LonDeb Peterson", "comment_text": "*"}, {"username": "Jennifer Gustafson", "comment_text": "I loved my sketcher sandals 8-12 miles a day in them all over Italy!"}, {"username": "Renee Schoenbrun Rubin", "comment_text": "P448 are great Italian sneakers. Very comfy"}, {"username": "Asia Cartlidge", "comment_text": "Teva"}, {"username": "Ellen Martin Weglarz", "comment_text": "Vessi"}, {"username": "Diane Ambrose", "comment_text": "Keens"}, {"username": "Anna O'Brien", "comment_text": "Bessie"}, {"username": "Joannie Beiswenger", "comment_text": "Teva sandals"}, {"username": "Suzanne Elliott Champitto", "comment_text": "Hokas"}, {"username": "Heather Trapp Robinson", "comment_text": "Vessi- super comfortable and waterproof! My husband and I wore them in Italy in October! I wore with pants and long skirts! Love Vessi shoes!!"}, {"username": "Noelene Cameron", "comment_text": "I bought these Ecco shoes in London and truly, they are the most comfortable walking shoes I have ever had."}, {"username": "Deanna Dailey Bruneau", "comment_text": "https://\nolukai.com/\n?gclid=CjwKCAjwt\n52mBhB5EiwA05YK\no0ZEqeuA0bpKe_B\n2qKZy5rQbiSYFOP\nLQ0RO2JEe-jxxQU\ngIV3h-7mBoCjb0Q\nAvD_BwE"}, {"username": "Elena Innocenti", "comment_text": "Nike Pegasus Trail in GORE-TEX save my life."}, {"username": "Marilyn Mercier", "comment_text": "On"}, {"username": "Robyne- Robby- Nimmo", "comment_text": "Buy geoxx brand there"}, {"username": "Lynne Salierno", "comment_text": "Isle Jacobsen Tulip sneakers - washable/\nwaterproof"}, {"username": "Fran Nelson", "comment_text": "Vessi"}, {"username": "Ann Marie Luvera Matrulli", "comment_text": "I would say it depends on each individual’s feet. What is comfortable for me may not be comfortable for you"}, {"username": "Angela Hollis", "comment_text": "Hokas"}, {"username": "Jackie Richards", "comment_text": "I love mine. Boys & Girls Water Shoes... https://\nwww.amazon.com/\ndp/\nB082CZ2LTV?ref=p\npx_pop_mob_ap_s\nhare"}, {"username": "Cindy Dill Rosenthal", "comment_text": "Hokas"}, {"username": "Stephanie Birchenough", "comment_text": "I wore Olakai’s the entire time I was there. Walked and sailed all around Amalif coast for two weeks"}, {"username": "Sharon Roberts Crossley", "comment_text": "Brooks"}, {"username": "Kate Whitney", "comment_text": "Birkenstocks !"}, {"username": "Rob McMahan", "comment_text": "Go to a running specialty store and get fitted. Do you pronate/\nsupinate? Do you need orthotics? Can you get away with a lightweight running shoe or do you need more structure? Dont forget good socks and break your new kicks in before the trip."}, {"username": "Karen Robertson Fitterer", "comment_text": "I love Hokas and Brooks sneakers. Dansko sandals are my favorites."}, {"username": "Gianna Onesi", "comment_text": "Goto Running room and they will help you. Not all shoes fit the same on each person"}, {"username": "Eric Parks", "comment_text": "I like Hoka Bondi and Brooks Ghost. I've picked up a few pair of Ghost14 (prior model) for $50-60/pair lately. Got them stored for when I burn thru my current pairs. :)"}, {"username": "Terrie Aldridge", "comment_text": "Keens"}, {"username": "JB Valles", "comment_text": "Just wear something you’ve already broken into and doesn’t hurt your feet. I treat all my travel footwear with this and never had to worry about them getting dirty or having wet socks/feet."}, {"username": "JB Valles", "comment_text": "JB Valles"}, {"username": "Marilyn Gross", "comment_text": "Bzeez"}, {"username": "Andy Pflaum", "comment_text": "We have found the Italians care a great deal about footwear and fashion, and that they walk everywhere. So, I suggest you pack light and when you get there make some time to stop in the stores. Pick out some nice sandals like they are wearing (and my wife and daughter like), maybe some casual, but upscale men’s shoes (like I like), and enjoy walking around. When our feet get tired that’s our sign it must be time for coffee, gelato or apéritifs. I still have the treads I bought in Milan a couple years ago, as does my daughter, and every time I put mine on I’m transported right back to my wonderful holiday. Just a thought."}, {"username": "Rosanna Hardeman", "comment_text": "I wore my Stan Smith sneakers for 12 hours in the rain at The King’s coronation. Then wore them the rest of my stay and still wear them. I actually have 3 pairs now because they are so comfortable and versatile. Wear with shorts, dresses, skirts, pants and no sunburnt feet or twisted ankles, and no slipping."}, {"username": "Anthony DeSimone", "comment_text": "Nike makes a trail sneaker I brought 6 different colors. I hiked all over Italy with them without any foot issues"}, {"username": "Dawn Marquez Maciaszek", "comment_text": "Teva!!"}, {"username": "Arianna Reel Cook", "comment_text": "My adidas superstars were the best for my feet while I was in Italy.\nThey go with just about every outfit and super comfy."}, {"username": "Carol Scott", "comment_text": "On"}, {"username": "Susan Beeman Barness", "comment_text": "These are what used as they’re comfortable but still supportive best of all waterproof"}, {"username": "Michael Widjaja", "comment_text": "People do have different feet but my usual walking shoes are salewa trektail and Adidas free hiker GTX....you can also check Asics and Salomon with gore tex"}, {"username": "Elsa Wurster", "comment_text": "Well, I walked every step in Tevas. I brought athletic shoes but never used them. Teva Tirra. 15 days of walking and climbing stairs! In 90 degree weather with dresses and shorts!"}, {"username": "Nancy Koehler Barboni", "comment_text": "Hands down Brooks ( Ghost)"}, {"username": "Christine Bartfai", "comment_text": "Vessi..walked 2weeks in UK /Ireland in wet spring..but feet were dry"}, {"username": "Brooke Summerville", "comment_text": "Merrell"}, {"username": "Jackie Scott Ford", "comment_text": "Native"}, {"username": "Cindy Bemis Ehster", "comment_text": "On cloud"}, {"username": "Sonia Smith", "comment_text": "Sonia Smith"}, {"username": "Kerry McMillen", "comment_text": "OBO s"}, {"username": "Darlina MX", "comment_text": "Teva"}, {"username": "Brenda Servoss", "comment_text": "Oboz"}]}, {"id": "2201388243593587", "text": "Just wondering people's thoughts of luggage tags. I'm travelling from Australia via Doha which is a 2hr stop over. Then going onto Barcelona. I'm worried our luggage won't make the change of planes. I've heard about air tags but I don't have a iPhone. I have Samsung. I've enquired about tags but say only good for things close by. What do people use in there luggage to keep track of it? Something with a bigger coverage.", "link": "facebook.com/groups/1373361046396315/permalink/2201388243593587/", "likes": 29, "comments": [{"username": "Murene Cassai", "comment_text": "I bought Tile $40 from JB Hi-fi. Does the same thing as an Apple Airtag. You put the app on your phone, link the tile to the app then your phone can tell you where the tile is. Seems to work."}, {"username": "Christine Ashton", "comment_text": "Just back from Europe definitely recommend the Apple tags!\nAll our luggage for 6 of us no worries. We heard stories from other people who had lost luggage"}, {"username": "Pamela Atkinson", "comment_text": "We used ours last year when there was a huge back log at Heathrow. At the end of the day our bags were there when we got off the plane. They indicate the area where it is not precise spot."}, {"username": "Пиер Пепи", "comment_text": "It will."}, {"username": "Crystal Waltz", "comment_text": "My daughter used a tag on our trip. It was super awesome as she knew where her bag was the whole time."}, {"username": "Sarah Lynn", "comment_text": "Get a tile. $25"}, {"username": "Andrea Bahyl", "comment_text": "Dave Bahyl"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Carry on"}, {"username": "Lauren Swanteck Myler", "comment_text": "Can’t hurt to throw a tile in your luggage, but try not to worry about something that probably won’t happen. Remember, you only here the complaints, not the bazillion passengers who never had an issue."}, {"username": "Lynn Crane", "comment_text": "If you use Samsung, Tile tags will work the same as airtags."}, {"username": "Bennett Richards", "comment_text": "Luggage tags should be visible… BUT Apple Air Tags are a MUST❗️❗️❗️❗️❗️❗️"}, {"username": "Leonie Collins", "comment_text": "My daughter has just flown from Perth to Doha to Serbia then to Bosnia with Qatar and air Serbia\nHer luggage was checked the whole way\nIt’s been 7 days and she still does not have her luggage\n\nBut we are think it’s in Serbia somewhere being a different airline.."}, {"username": "Vikki Hoffman-o'connor", "comment_text": "Qatar Air is one of the best airlines. We’ve used them many times with no issues at all."}, {"username": "Michael Widjaja", "comment_text": "I think there’s airtag app for android as well,but I heard good things about tile\n\nUsually I fly with Qatar and have had no problems with my luggage (except being overweight which isn’t the airline’s fault but my own fault)"}, {"username": "Daisy Yoo", "comment_text": "not sure if this is your first time fly through doha, is it Qatar airline? for our family, never again. if u have a delay or anything... u will know why I say never again. best of luck. ur luggage will make it, from our exp through doha to somewhere else, however, maybe not be other things and if u are flying qatar, absolutely the worst customer service and they have no emotions and will just ignore you. also not sure how they operate in australia, make sure you arrive at the airport 3 hrs before, they have no electronic boarding pass or electronic check in for boarding pass or etc. everything will needs to manually line up, they do however process fairly quick considering as they will have 12 ppl on counter or more"}, {"username": "Alicia Cox", "comment_text": "I use air tags but have iPhone."}, {"username": "Joselle Dubs", "comment_text": "We use Tile from Officework.\nWith Singapore Airlines, in their app you can see where your luggage is.\nSo download your airline's app and check if the have luggage tracking feature just like the one's with Singapore Airlines.\nAll the best."}, {"username": "Patricia Culcasi", "comment_text": "I used the Tile for Android. My luggage was delayed and I was able to track it and I knew when it was delivered to my hotel in Paris the next day"}, {"username": "Donna Hammen Taylor", "comment_text": "Use airtags AND use 2 luggage tags .one of mine became lost but luckily had an extra"}, {"username": "Mara Versitano", "comment_text": "You need Tile pro as the standard tile has limited bluetooth distance where as the pro is able to use other samsang users from across the world. Couldn't find it anywhere. Jbhi does not carry the pro. I ordered it from a NZ electronic store PBTech Still waiting for it to arrive"}, {"username": "Christina Beuchert Guerricagoitia", "comment_text": "I think the way tags work is they ping off of other phones, like air tags ping off off other iPhone and Android off of other androids. Maybe I am wrong?"}, {"username": "Claire Lewis", "comment_text": "I’d be more worried about the other things that happen to women at Doha airport…"}, {"username": "Maria Musumeci", "comment_text": "I believe Tile is our best option, they apparently come very close to the Airtag. Samsung ones aren't quite as good. I've got a Samsung phone, but kids have iPhone, so when we did 4 weeks across Sicily, Italy & Dubai, we got the airtags x4. But really didn't need them as never lost our luggage! Even flew Ryanair domestically through Italy with no issues 😉"}, {"username": "Michelle Schultz", "comment_text": "We have sumsung tags but flew emirates and they don't allow smart tags or batteries so we didn't take them had no issues."}, {"username": "Irene Oda", "comment_text": "I bought 'Tile'. Worked great. Was able to track luggage 100%"}, {"username": "Denise Coman", "comment_text": "We recently flew from Australia with Qatar via Doha, then onto Vienna and later home via Doha , out of Zagreb, Croatia. All flights with same airline which I feel may limit the risk of lost luggage. However, they were strict on the 7 kg carry on, I had to point out that medical equipment I was carrying should not count as part of the 7 kg allowed."}, {"username": "Alan Johnston", "comment_text": "I have Samsung and their tracker tags work great!"}, {"username": "Stuart Flinn", "comment_text": "There are Galaxy tags and they work well. I put one in each of our checked bags and knew where they were at all times."}, {"username": "Gi Grogan", "comment_text": "I have a Samsung but it works if you have a MacBook or iPad too"}, {"username": "Joannie Beiswenger", "comment_text": "When you check your luggage you are given a scannable tag which I believe they can track your luggage from."}, {"username": "Maria O'Callaghan", "comment_text": "I have the Air Tags, they can be tracked from anywhere. You can get something similar for Samsung"}, {"username": "Elena Innocenti", "comment_text": "Usually in Doha are very fast to manage luggage.\nI have many stopovers there, even with only 1:30h of connection and I always had my luggage at destination."}, {"username": "Dave Conroy", "comment_text": "Check out Tile. The best solution is carry on only."}, {"username": "Jennifer Louise Snedden", "comment_text": "I have travelled through Doha numerous times with very short connection times my luggage has always arrived with me at my final destination."}, {"username": "Sarah Louise", "comment_text": "I have a Samsung and use a \"smart tag\", I haven't had any issues with the signal requiring another smartphone to track the location of my bag :)"}, {"username": "Fiona Rieger", "comment_text": "Never had a problem with Qatar"}, {"username": "Sandy Michelle Duggan", "comment_text": "we went from Australia to Venice with a stop over in Dubai, and Athens to Dubai and back to Perth, not a single issue, luggage was always at my final destination, I looked into airtags also, but was becoming super paranoid by so many things."}, {"username": "Sammii Fletcher", "comment_text": "We recently flew to Rome from Australia via Qatar with a stopover in Doha and had no problems at all. Dont worry about the people that say only take carry-on luggage. They don't realise that from Australia you can only take a small bag no more than 7kg. The Qatar staff we encountered we pretty strict about that too.😊"}, {"username": "Amelia Bowers", "comment_text": "2 hours is definitely enough for your luggage to make it. My luggage has only not made it when a delayed flight gave me a 30 minute layover. But even then it was delivered the next day to where I was staying. My best advice to you is to pack a clean t shirt and underwear, plus your toothbrush, into your carry on. That way you can survive a day if your luggage is delayed. Tracking your bag is not going to make any difference if it doesn't make your flight. It's unlikely to get lost, worst case scenario is one day without your bag."}, {"username": "Anne Elizabeth Adams", "comment_text": "Just make sure that you take an extra pair of knickers in your carry on, plus any absolute essentials & valuables"}, {"username": "Lisa Simmons", "comment_text": "Take a picture of your luggage and it’s brand and size .\nHave your contact details and ph include country code +61 and your details on the outside and also inside eg in a zipped section.\nPack afew personal items in your hand luggage eg a summer change of clothes . Sometime an 1 x outfit of yours - into if traveling with someone else their case and via versa .\nUsually the airline is good but just incase .\nPs also hand luggage for any medical needs .\nAs with the tractors people can see where their bags are but cannot get in ph contact with the airline to retrieve - various airlines most will on send to your hotel so have details at hand .\nPlan for the worst . But all should be good. Qatar is usually excellent ."}, {"username": "Paulette Otano", "comment_text": "Tile for android phones"}, {"username": "Jenny Payne", "comment_text": "I travel a lot & I do use AirTags + name & phone inside your case+ a photo inside & outside of your case so if it does get lost u have a photo🌻"}, {"username": "Lora de Vries", "comment_text": "I´m assuming you are flying with Qatar Airways, since you have a layover in Doha? Doha International is a good airport and we have travelled a few times via Doha without any problems. We travel Business class, so luggage is tagged through to the destination country and tagged as priority. However, even their Economy class luggage is handled well, so with a 2 hours layover, there shouldn´t be any problems. For Samsung, you can use Smart Tags. Just make sure that when you check in, your luggage is tagged all the way through to your final destination."}, {"username": "Graham Sherlock", "comment_text": "I dont see any point knowing where your luggage is if it's lost, it's still lost and until it arrives it's still lost."}, {"username": "Todd N Nicole Clarke", "comment_text": "We arrived back in Australia this morning we used AirTags because we have an iPhone it was great we could see the location of the bags most of the time. We had a very short change over in Poland and they labeled our bags with short layover. Also we have done the whole trip with checked in luggage I always just had a change of clothes etc in by carry on. It was hard at times but I wouldn’t change it and when you get there you realise you aren’t the only ones"}, {"username": "Alexandra A Welker", "comment_text": "I have an Android and I use Tile, it's in Amazon. There are other brands too, search for Bluetooth trackers."}, {"username": "Richelle Trezise", "comment_text": "We can't buy galaxy tabs here in Aus unless you want to spend double by getting them shipped from USA and Apple don't work on samsung. We are flying with Etihad and we aren't using any We are just going to 🤞 and pray"}, {"username": "Ramon Cardona", "comment_text": "I always use them"}, {"username": "Lisa Nordby Robilliard", "comment_text": "I have travelled recently from Australia with Qatar via Doha to Europe with no problems. I’ve travelled extensively for decades and the only time I’ve had a problem with luggage not arriving at my destination was once in the mid 80’s."}, {"username": "Susan Rathke", "comment_text": "In addition to Air Tags, there are also Tiles which are for a different type of cellphone than IPhone. Worth the investment!!"}, {"username": "Sonia Scotto Lubrano", "comment_text": "I think Samsung has tiles\nI’ve flown a million times. Yearly to Italy (but from US) and thank god have never lost my luggage even on short layovers (1 hour). My family who has lost their luggage get it delivered to their front door/hotel within a couple days.\n\nI do pack a carry on with essentials. 2 underwear. 2 outfits. Socks. Bathing suit. That way if it gets lost I can buy laundry soap and hand wash all my stuff if needed.\n\nId never travel with just a carry on but that’s just me 😅"}, {"username": "Matteo Basile", "comment_text": "Just ask at check in to mark your luggage as “short transfer” sometimes they do… anyway 2hrs is usually more than enough to transfer the luggage"}, {"username": "Eric Parks", "comment_text": "I use Tile and have a Samsung. I tracked my son (via his bag) in Switzerland when his phone died while I was home in Texas. Someone with an Android does need to pass by at some point for it to be spotted, but same goes for any tag."}, {"username": "Susan Capalbo", "comment_text": "I purchased a Tile on Amazon. It's compatible w Samsung, works well n easy to set up."}, {"username": "Liz Havard", "comment_text": "We travel a lot. Have flown Australia/UK round trip at least 15 times as a family of 4 and never lost any checked in luggage so I wouldn’t worry about what’s not likely to happen but I do always label luggage with onward address and phone number just in case.\nAll bags are barcoded too with a label on check in/drop off and you keep the matching receipt which I always stick to my passport until I get my bag back. This identifies luggage quickly."}, {"username": "Laura Smith-Pursel", "comment_text": "You can also put a sheet of paper with your contact information inside each bag (or the outer pocket if your bag has one) so if the tag becomes detached, they can find you."}]}, {"id": "2201396150259463", "text": "Hello,\nWe are staying at blue george apartments in calle dragan in venice. Can anyone tell me how far from all the main attractions this is and is it an easy find to main area of venice tia", "link": "facebook.com/groups/1373361046396315/permalink/2201396150259463/", "likes": 0, "comments": [{"username": "Jenn Messina Babore", "comment_text": "I would suggest using maps and putting in Rialto Bridge and St. Mark’s Square. It’s about a half mile walk, so not too far."}, {"username": "Meghan Tan", "comment_text": "Use google maps to enter the hotel’s address."}]}, {"id": "2201398146925930", "text": "We are going to Italy in October. We would like to see about a private tour of Rome. Has any one have positive experience. Looking for any recommendations\n. Thank you !", "link": "facebook.com/groups/1373361046396315/permalink/2201398146925930/", "likes": 40, "comments": [{"username": "Cathy Begley Brunker", "comment_text": "Benvenuto Tours."}, {"username": "Sandi Ardissone Lynch", "comment_text": "Rome Italy Tours , ask for Max. He’s fantastic!"}, {"username": "Eva Reichel", "comment_text": "Following"}, {"username": "Zarine Batli", "comment_text": "Yes and Vatican too"}, {"username": "Ron Levasseur", "comment_text": "I would recommend the Scavi tour under the Vatican."}, {"username": "Francine Lapointe", "comment_text": "Il you are going for more than 1 day I would recommend a gastronomical walking tour. Off the beaten path and where the people live. Market, cheese shop , charcuterie. We did a private tour. Best experience ever"}, {"username": "Georgia Beth Ridenhour", "comment_text": "Eating Europe has great culinary and cultural tours that get you away from all the tourist traps. Not only is the food great, but it’s a cool way to learn about the history and secrets of different neighborhoods and areas."}, {"username": "Dan Adams", "comment_text": "Carla Zaia is wonderful, Rick Steves recommended. carlaromeguide@\ngmail.com"}, {"username": "Marianne Parks", "comment_text": "Golf cart tour rome"}, {"username": "Phyllis Snyder", "comment_text": "I’m reading Rick Steve’s guide of Rome- he lists 5 well established, creative and competitive Rome walking tour companies: Walks of Italy, Europe Odyssey, Through Eternal, The Roman Guy, Miles & Miles Private Tours. Rick Steve’s is a seasoned and respected and reliable travel expert- he personally endorses any guide he mentions in his books."}, {"username": "Stephanie Lee Garcia", "comment_text": "Thank you for all the input as I needed this too!"}, {"username": "Donna Mangone", "comment_text": "I remember going on a private tour of Ancient Rome in March 2012. It was arranged by Collette Tours. We did the Sicily tour and added a couple of days in Rome."}, {"username": "Debbie Nelsen", "comment_text": "Following"}, {"username": "Diane Dickerson Roberts", "comment_text": "Golf Cart Tour. You will see more in 1/2 a day than you would see in two days on your own. We have done it before and will do it again this September. It can be customized for what ever you are interested in seeing. The guides are able to cut through back alleys and avoid all the traffic. You won’t be disappointed!"}, {"username": "Kelli Barnes", "comment_text": "Angie Smith"}, {"username": "Sandy Bloem", "comment_text": "Joe Bannana tours are fabulous!"}, {"username": "Lydia Matthews Edwards", "comment_text": "www.roma-bella.\ncom\nXimena is a fantastic guide!"}, {"username": "Bitsy Bruton", "comment_text": "The Vespa sidecar tours are so much fun! Our guide, Luca, was amazing! So funny and knowledgeable."}, {"username": "Henry Bunn", "comment_text": "We will be right behind you."}, {"username": "Hagar Mohsen", "comment_text": "It is a nice city but take care\nI had been stolen there so be careful🙄"}, {"username": "Mary Skvarch", "comment_text": "Yes! Ferdinando Badaglaccia of Rome in Tours is great. We always call him when we go to Italy!"}, {"username": "Alesya Rakitin", "comment_text": "We just came back from Italy, Rome and https://\nwww.facebook.com\n/\nchiara.antonelli\n.tourist.guide?\nmibextid=LQQJ4d was amazing !"}, {"username": "Wendy Bright", "comment_text": "Cheryl Power golf cart tour and local guides sounds great"}, {"username": "Jodie Kephart Thorpe", "comment_text": "We are also going in October. Booked a night time golf cart tour."}, {"username": "Michelle Nelson-Harrison", "comment_text": "Our walking food tour was our favorite!"}, {"username": "Karen Meany", "comment_text": "Gabriele Borello\nThisisItaly Tours & Transfers."}, {"username": "Cynthia Y Guadalupe", "comment_text": "Contact Francesca Della Fede at https://\nwww.arrivedercir\nomatours.com/\n\nShe is fantastic and will customize your tour!"}, {"username": "Leigh Melville", "comment_text": "We were there in January and on our first day we did a vespa tour of Rome. It takes about 3 hours and I would highly recommend it. A wonderful way to get an overview of the city, see many highlights and learn something. They also took us to the best gelato stop."}, {"username": "Davor Dragičević", "comment_text": "Roma eat has archeologist to be your tour guide, small group, very professional."}, {"username": "Robert Templeton", "comment_text": "Watch out for those hungry lions."}, {"username": "Catherine Campbell", "comment_text": "Follow livevirtualguid\ne on Instagram. She shows you really interesting places and does personal tours too which have great reviews."}, {"username": "Carissa Lawson", "comment_text": "My family of 4 used Touring Italy and it was fabulous!"}, {"username": "Francesca Clark", "comment_text": "Gianluca de Francesco"}, {"username": "Phyllis Bruno Hatala", "comment_text": "Rudy Grimaccia is fantastic ! He is personable and educated to share the history and art around Rome"}, {"username": "Jenn Messina Babore", "comment_text": "Have you considered a Golf Cart Tour? Fantastic way to see Rome with a guide."}, {"username": "Kasia Sudol", "comment_text": "Messaged you."}, {"username": "Terri Clark", "comment_text": "Following."}, {"username": "Mary Kelly Stevens", "comment_text": "Chiara Antonelli Tourist guide We highly recommend Chiara. She is an excellent tour guide who is\nvery knowledgeable and provides incredible small group tours in Rome. 🇮🇹❤️"}, {"username": "Mike Henderson", "comment_text": "Highly recommend Fabio Leotta. You can find him on Facebook. We’ve used his tour services multiple times."}, {"username": "Debra Burroughs Disario", "comment_text": "Viator"}, {"username": "Allison Carlisle Young", "comment_text": "We used limousinrome.co\nm. One day tour all over rome. Dropped us for lunch. We saw a lot! Giancarlo was great"}, {"username": "Barbara Kistler Wilhelm", "comment_text": "Golf cart tour"}, {"username": "Charlotte Dean", "comment_text": "We just did an amazing private driver with Matteo at Mia Limo. Not sure if he does tours but is from Rome and wonderful. He took us private to Positano and Sorrento and we have used for other transfers."}, {"username": "Debbie Crawford McCown", "comment_text": "Paul Costa is the absolute best guide."}, {"username": "Donna Spencer", "comment_text": "Following. Lynn Mcconnell"}, {"username": "Donna Striks", "comment_text": "What can you expect weather-wise in October? Is a coat needed or just a sweater or light jacket? Thanks!"}, {"username": "Iman Nazaran", "comment_text": "Following"}, {"username": "Nancy Adams", "comment_text": "What golf cart tour would you recommend with 4 adults and a 4 year old? We will be in Rome the end of September."}, {"username": "Angela Brevetti-Cantone", "comment_text": "Not a tour but I highly recommend taking a Cooking in Rome class with chef Andrea. He is amazing ! It was one of the highlights of our trip. Cooking Classes in Rome"}, {"username": "Paul Costa", "comment_text": "HiLynda, please message me with more details"}, {"username": "Kristena Stalker", "comment_text": "Following"}, {"username": "Brenda D'Amico Andrzejewski", "comment_text": "Yes! Through Viator"}, {"username": "Robin Barbera", "comment_text": "Viator.com"}, {"username": "Elisa Yancovich", "comment_text": "Vitalia tours they are awesome"}, {"username": "Christine Sanci-Gentile", "comment_text": "Mybesttour golf cart tour was amazing!"}]}, {"id": "2201409320258146", "text": "Hi! I’m traveling to Italy the first week of Sept. We are staying in Capri. Does anyone have any recommendations for private boat tours of Amalfi from Capri?\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2201409320258146/", "likes": 0, "comments": [{"username": "Heather Hurley", "comment_text": "Following"}, {"username": "Amy Ptak Walsh", "comment_text": "We used this group in June and they were great\n\nhttps://\nwww.mbsblucharte\nr.com/mobile"}]}, {"id": "2201416036924141", "text": "I want to spend an evening in Positano, but the last Ferry to Sorrento leaves too early. Is it easy to get an Uber or Taxi to Sorrento? Is there a bus that runs late? Does it depend where in Positano I am if I want an Uber or Taxi? Thank you in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2201416036924141/", "likes": 0, "comments": [{"username": "Brad Nelsen", "comment_text": "Uber doesn’t operate here. Taxis are expensive. Google SITA bus timetable."}, {"username": "Kay Rendall", "comment_text": "Think last buses r perhaps 9pm. Plus may be totally packed, coming out of Amalfi, so will not stop for u. Even if u r at the bus stop. Taxi, transfer, book is 150 euro this year. May even be more late in the evening. But would need to book ahead. I will return for 9th time this year and will pay 150 euro to Naples or Sorrento."}, {"username": "Meredith Holloway Helbon", "comment_text": "Following"}, {"username": "Sandy Radican Shikaly", "comment_text": "No Uber"}, {"username": "Jeff McLellan", "comment_text": "The number of people I saw waiting for the bus when we were there was nuts. I would just buck up for a taxi or arrange a car service, you only live once."}]}, {"id": "2201434900255588", "text": "We are travelling to Lezzeno , Lake Como area and was wondering if anyone could recommend some restaurants in that area?", "link": "facebook.com/groups/1373361046396315/permalink/2201434900255588/", "likes": 0, "comments": [{"username": "Greta Eberbach", "comment_text": "F"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2201437283588683", "text": "Heading to Italy next May with my husband. Planning on l￼anding in Rome (4 nights), wanting to do Ischia (4 nights), and Siena (4 nights) as a base for Tuscany. I have time to add either 2 nights to Tuscany (we would spend them in Lucca) or head a little further south right after Rome to Matera. If we did Matera, I would take one day away fromआणखी Ischia so it would be 3 nights each for both. We will only be taking trains. No car rental for sure. ￼ We will most likely fly out of Florence so will be there for one day. I was just there last October, so I don’t feel the need to go back quite yet￼. ￼For those that have done Matera and Tuscany on the same trip, did it seem easy enough and reasonable…. and not too stressful with all the travel? ￼ Although I’ve been to Italy a handful of times, ￼ this is the first time my husband is really ￼going to experience ￼it (he’s been Venice and Verona), and I want him to see a good sampling. Need to convince him to retire here part time lol! Any suggestions, ideas, or other options I haven’t thought of are much appreciated! ￼", "link": "facebook.com/groups/1373361046396315/permalink/2201437283588683/", "likes": 3, "comments": [{"username": "Robin Burrell", "comment_text": "It’s not at all easy to get to Matera from Rome. Will take many train or bus hours. 7 or so. It will take 2.5 hrs to get to Lucca. As much as I recommend Matera for a taste of Italy unlike any other, I think I would opt for Lucca. Southern Italy is a trip all by itself and having a rental car is a big plus. I think you need to download app Rome to Rio. It tell you distance, times by different transportations\nbetween towns. Italy is bigger than you think and you are naming towns areas very far apart. Im afraid you will spend a lot of time on the road. Fine if it’s a long trip, not so much if you have limited time."}, {"username": "Steve Grossman", "comment_text": "Where are you planning on getting a boat to ischia?"}, {"username": "Roland Trego", "comment_text": "I'd skip Matera--not that it isn't impressive, but the trip will simply be too long."}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Arrezzo and Cortona … easy by train…. Or Poppi …. Charming !"}, {"username": "Fiona Cameron", "comment_text": "Cortona, can recommend a fabulous BnB if you’re interested.\nMatera is a LONG train ride from Rome with at least 3 changes and probably a bus at the end as not sure where closest stn is to Matera."}, {"username": "Charleen Siegler Schuss", "comment_text": "Matera is magic. Stay in a sessi,"}, {"username": "Alicia Cox", "comment_text": "I think you will need a car or a driver in Tuscany - think spaced out rolling land - not big cities. At least we had a car. 🤷🏻‍♀️"}]}, {"id": "2201453356920409", "text": "Looking for recommendations\non wheel chair rentals in Florence & Rome. TY", "link": "facebook.com/groups/1373361046396315/permalink/2201453356920409/", "likes": 0, "comments": []}, {"id": "2201471636918581", "text": "Hello all! I would love for some guidance.. It’s my first time traveling and my routes are Milan-Chamonix-Lyon-Paris. I’ll be arriving next week and meeting my relative in Milan and we will head straight to the hotel in city centre. May I know what is the best and inexpensive way to head to the hotel? If i’m able to clear the custom fast, we willआणखी probably be out at 930pm. I’m thinking to take the airport express (Terravision).. is it safe?\n\nAlso, i’m worried about strikes and with the hail storms that happened few days ago.. I do hope it won’t affect our trip otherwise we will probably be staying in our hotel instead.. As for transport card for Paris, what do you all recommend? I’ll be there on a saturday.. Getting a Navigo Pass doesn’t work for me as it starts from Monday to Sunday.. I’m thinking to get a 10tickets pass?\n\nAny advice is appreciated, thank you! Ps, i’m really concern about safety.", "link": "facebook.com/groups/1373361046396315/permalink/2201471636918581/", "likes": 0, "comments": []}, {"id": "2201474910251587", "text": "Hello\nhave any of you been to cinque terre with a 2 year old baby. worth it? Should I take pram ?", "link": "facebook.com/groups/1373361046396315/permalink/2201474910251587/", "likes": 1, "comments": [{"username": "Rus Bianca Cristiana", "comment_text": "A few years ago I saw a lot of people with kids and prams- most of them yoyo babyzen or light w prams. I think it will also be useful a baby carrier but depends on you and how are you feeling comfortable with this. The little one may enjoy the ice cream or local pastries but definitely he is too small to appreciate the location , the views . As a matter of fact for adults it is absolutely amazing! One of the best places I've ever been!"}, {"username": "Magda Wysocka", "comment_text": "Thank you so much!❤ We got 2 boys 7 and 2 years old I think 7 years old will be love it ."}, {"username": "Karen Schmidt", "comment_text": "We were there at the beginning of October last year and thought it was PACKED. Our host informed us it was actually quite quiet so I can’t even imagine how it would have been in a higher season. The trains were really full, the streets were full…both of us really didn’t enjoy it for the most part. Monterosso was the only town with a bit more wiggle room and I think would be manageable with a pram. You’d still need to catch the train though…"}]}, {"id": "2201482066917538", "text": "The photo where the blue dot is an area where we walked back from Trastevere and came across a cool area with lots of restaurants, great evening vibe but didn’t feel to touristy. I just screened shot when I was around that area. Hopefully anyone can figure out the general location", "link": "facebook.com/groups/1373361046396315/permalink/2201482066917538/", "likes": 125, "comments": [{"username": "Cecilia Christine Costantini", "comment_text": "The green area next to the blue dot is Piazza Cairoli"}, {"username": "Jan Armstrong", "comment_text": "Yes we stayed in Trastevere and walked that route a lot to the centre via Arenula and Piazza Cairoli. Emma restaurant is nearby and we had a fantastic meal there. Just over to the left of the blue dot you have Campo do Fiori which has a great atmosphere in the evening"}, {"username": "Olivia Ong", "comment_text": "Thanks for sharing ❣️"}, {"username": "Rich Garcia", "comment_text": "I believe that is the Jewish Ghetto. We stayed in an Airbnb right around that area."}, {"username": "Nahele Magpie", "comment_text": "Dovrebbe essere via dei Giubbonari.\nIt should be via dei Giubbonari."}, {"username": "Rebecca Arey", "comment_text": "Campo de Fiori. We stayed here in an Airbnb for a week. Tons of restaurants and little shops, busy but not as crowded as other touristy areas around Rome and- in my opinion- we found better food here and Trastevere than in other places. Definitely a great place to check out!"}, {"username": "Carmen Zervigon Everett", "comment_text": "Safe area for solo woman traveler to venture out in early evening?"}, {"username": "Carolina Alejandro Clabaugh", "comment_text": "Thank you for sharing!"}, {"username": "Tanya Luca Chetcuti", "comment_text": "David Chetcuti"}, {"username": "David Riegel", "comment_text": "Rome"}, {"username": "Lisa Kelly", "comment_text": "Monti?"}, {"username": "Valentina Saltarelli", "comment_text": "Yes Campo de Fiori"}, {"username": "Barbara Bastianini", "comment_text": "Based on its location in relation to the other landmarks (the theater of Marcellus and the monument to Victor Emmanuel) I’m guessing that area might be the Jewish ghetto\nWhich is a really nice neighborhood."}, {"username": "Charlotte Den Decker", "comment_text": "Giolitti… definitely worth a visit!!"}, {"username": "Kim Aranha", "comment_text": "I think it is Campo dei Fiori and Piazza Farnese - look at where Piazza Navona is"}, {"username": "Kim Aranha", "comment_text": "No, I think the Jewish Getto is down via Dei Giubbonari and off Via Arenula"}, {"username": "Martha Hughes", "comment_text": "Not too far from Campo de' Fiori ... I also loved this area (but even in December was not void of tourists, when I was there)."}, {"username": "Erin Magee", "comment_text": "Thanks"}, {"username": "Erin Magee", "comment_text": "Here it is around this area"}, {"username": "Austin Briscoe", "comment_text": "Campo Di Fiori."}, {"username": "Carmen Zervigon Everett", "comment_text": "Any recommended hotels here?"}, {"username": "Tracy Silva Samarjian", "comment_text": "I stayed there it was a great area!"}, {"username": "Kyla Love Martin Millard", "comment_text": "Here are the street names and the restaurants you are looking for."}, {"username": "Bazza Greaves", "comment_text": "Thanks for sharing will defo give it a go next week"}, {"username": "Blanca Gil", "comment_text": "Campo dei Fiori and Jewish Ghetto area. Both beautiful spots in Rome."}, {"username": "Ann Szamboti McCafferty", "comment_text": "Campo de fiori"}]}, {"id": "2201485130250565", "text": "How do you find good drivers to take you away from busy areas? Are there sights you can use or ask at hotels or info centres?? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2201485130250565/", "likes": 1, "comments": [{"username": "Miyuki Kanno Paul", "comment_text": "What city are you talking about?"}]}, {"id": "2201490646916680", "text": "If anyone is flying in or out of Malpensa Milano Airport this hotel was very comfortable, clean, excellent customer service, very affordable, 10 minutes from airport. I paid 89 euros for a king bedroom. They do have a shuttle service for 10 euros roundtrip per person.", "link": "facebook.com/groups/1373361046396315/permalink/2201490646916680/", "likes": 22, "comments": [{"username": "Patty Barnes", "comment_text": "Thank you! I was looking for one for October. 🙏"}, {"username": "Matteo Basile", "comment_text": "I’ve been there many years ago. Was good that time too"}, {"username": "Dr-Jon Warnecke", "comment_text": "Shuttle to the airport, or downtown?"}]}, {"id": "2201493026916442", "text": "I’m looking at taking my mum to Venice for her 80th birthday for 4 nights in October. Is any time in October better early or late? Any recommendations where to stay and where to go including restaurants please", "link": "facebook.com/groups/1373361046396315/permalink/2201493026916442/", "likes": 2, "comments": [{"username": "Mike Guluk", "comment_text": "hotel rialto if she is mobile"}, {"username": "Vanessa Durkin", "comment_text": "Dont eat neat the square way too expensive but takec leisurely dtroll up to station area we had lovely food in a variety of restaurants there and not expensive"}, {"username": "Meredith Williams", "comment_text": "we loved h10 palazzo canova, by the rialto!"}, {"username": "Phyllis Snyder", "comment_text": "Special!"}, {"username": "Mat PO", "comment_text": "Hotel Cipriani! It’s fabulous! It’s restaurants are amazing too."}, {"username": "Laura Uribe", "comment_text": "Make sure where you stay has an elevator if she is unable to do stairs. It’s not uncommon for a 4 or 5 story place not to have an elevator. Ground floor is zero. First floor is the same as second floor in many countries."}, {"username": "Alice Francesca", "comment_text": "Better early october.Venice can get pretty humid at the end of the month.\nBe careful as many hotels are in historical palaces and there might not be an elevator."}]}, {"id": "2201109783621433", "text": "This question is for anyone in Sicily right now. I’m scheduled to arrive in Catania on August 11, spending a month on Sicily. I understand the airport was damaged by a fire. We are scheduled to spend a week in Teromina Cefalu and working our way around to Palermo in our rented car.", "link": "facebook.com/groups/1373361046396315/permalink/2201109783621433/", "likes": 6, "comments": [{"username": "Rip Lonergan", "comment_text": "Can anyone in Sicily now or have any recent airport experience provide any insight? ￼"}, {"username": "Amanda Garcia", "comment_text": "This angle looks spectacular. Thanks for sharing."}, {"username": "Alessandro Iannelli", "comment_text": "You don't have to be in Sicily to know the answer to your questions. First off, the airport of Catania: it should be fully operative by the first of August, that's what the president of the Sicily region said. Even if it isn't by that date, it will almost certainly be by the 11th, when you are scheduled to arrive. As for the weather, it's too soon to tell what the temperatures will be when you arrive. The emergency situation seems to be behind, though it's impossible to predict whether something similar could happen again this summer. Bonus info: between the 11th and the 16th there are good chances of insane traffic jams (in all of Italy), in case you are going to rent a car."}, {"username": "Danielle Cannova", "comment_text": "Here now, no active fires believe airport is opened now"}]}, {"id": "2201110386954706", "text": "Is there a standard rate for taxis from Rome airport to hotel in Rome? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2201110386954706/", "likes": 14, "comments": [{"username": "Marianella Flynn-Morales", "comment_text": "There is a train that can take you to a halfway point then catch a cab"}, {"username": "Anthony Martini Jr.", "comment_text": "Yes"}, {"username": "Paola Bobko", "comment_text": "Taxi 50 euro or fast direct train every 15’ for 14euros. It is actually faster than taxi as it takes 30’"}, {"username": "Arike Shrestha", "comment_text": "€ 50 or just Uber it"}, {"username": "Miyuki Kanno Paul", "comment_text": "Within the city wall, it’s fixed at €50"}, {"username": "Helene Kalfas", "comment_text": "We were just there we paid 50 euro"}, {"username": "Liz Miller-Boone", "comment_text": "We used UBER in Rome"}, {"username": "Victoria Stewart", "comment_text": "Catch the train ……from airport to Rome"}, {"username": "Neville Spargo", "comment_text": "Just did this trip this morning from Rome, (our apartment was an 8 minute walk from the Colosseum ) to FCO and it was 50 euros , set price !\n\nI even saw this rate clearly marked on a sign on the door of every taxi too. Seems very well regulated."}, {"username": "Jenny Larsen", "comment_text": "Yes it’s 50 €"}, {"username": "Sheryl Elizabeth", "comment_text": "Yes, fixed rate €50\nUsed it a few days ago, and written on taxi door too"}, {"username": "Jenny Larsen", "comment_text": "We booked a taxi through the Uber app they then cancelled the Uber app call so it was 50€ it’s a state set rate and they cancelled the Uber rate . Taxis are great"}, {"username": "Christine U Michael Borg", "comment_text": "How much from Ciampino airport to Rome station please? Is there a fixed rate as well?"}, {"username": "Antonio Aloè", "comment_text": "Take the train to Termini station and save money.."}, {"username": "Cynthia Marie", "comment_text": "Yes fixed rate from airport to city central. After a long overnight flight it was nice to grab a cab and get to our rental without much fuss . Go outside of the airport to the taxi line. Avoid all men trying to help with your luggage in the airport claiming to be taxi driving. Go outside to the taxi line. Easy peasy. Safe travels"}, {"username": "Sha Mohammed", "comment_text": "5o uros in last September."}, {"username": "Wojciech Milcarz", "comment_text": "60 Euro"}, {"username": "Nicole Gouzoules Sheehan", "comment_text": "Yes. We took a taxi from airport this morning to hotel near trevi fountain for 50 euros."}, {"username": "Michelle Prince", "comment_text": "50 euro"}, {"username": "Elena Innocenti", "comment_text": "50 euro from/to mura aurealiane aera / Fiumicino airport"}, {"username": "Enrico Lecce", "comment_text": "No.."}, {"username": "Ghada HM", "comment_text": "I paid around $30"}, {"username": "Romina Lauretig Toscano", "comment_text": "Sure"}, {"username": "Rochelle Winsor", "comment_text": "Take a bus or train way cheaper and a great experience, $6- 10\nTaxis around $60"}, {"username": "Maurice Bastarache", "comment_text": "€50 flat rate"}, {"username": "Josie Mammone", "comment_text": "400 euro 😂"}, {"username": "Michèle Nardelli", "comment_text": "About $100 aussie"}, {"username": "Wayne Solis", "comment_text": "Congratulations\nDeano👍"}, {"username": "Stephen Flynn", "comment_text": "50€"}, {"username": "Shane McClain", "comment_text": "Ours seemed to be $50 euros every time"}, {"username": "Valerie Lim", "comment_text": "Valerie Lim"}, {"username": "Janis Dolce", "comment_text": "Yes! Fixed rate"}, {"username": "Antonello La Ferrara", "comment_text": "50 euros fixed fare. If they will charge more they trying to rip you off."}, {"username": "Ildiko Gyimesi Mikos", "comment_text": "50 euros fixed fee"}, {"username": "Fran Monopoli", "comment_text": "€50"}, {"username": "Nilza Mercado", "comment_text": "Yes $50 as per the taxi rate chart"}, {"username": "Bobbi-Ann Barnes", "comment_text": "We paid around 55 for a private transfer- he was waiting at baggage claim for us!"}, {"username": "Marvin Kim", "comment_text": "what kind of cars do they use fir taxis?"}, {"username": "Liz Castillo", "comment_text": "Yes 35 Eros or more"}, {"username": "Ian Beyer", "comment_text": "Take the train!"}, {"username": "Robert DeLeon", "comment_text": "Fifty Euros."}, {"username": "Sean Gritton", "comment_text": "Yes"}, {"username": "Sean Gritton", "comment_text": "MAKE U SURE YOU GET IN THE LINE FOR TAXI... PPL STAND ON THE OUTSIDE SAYING THEY ARE TAXI'S AND CHARHE X2 MORE"}, {"username": "Cathy Hayes", "comment_text": "Take the train ,so easy & cheaper"}, {"username": "Andrea Brown", "comment_text": "50 euro fixed from FCO to Rome “within the Aurelian walls” - there are different fixed rates to other airports. These rates are also posted on the door of the white taxi so when they try and tell you more point to the sign. It also includes bags"}, {"username": "Olga Olga", "comment_text": "I didn’t even hear that somebody take a taxi from airport, it’s fast train from airport"}, {"username": "Robin Barbera", "comment_text": "￼ Take the Leonardo express"}, {"username": "Traci Raymer", "comment_text": "White taxi’s are 50 euros. It’s posted on door. If you have more than 5 people it might be 10 or so more per person. Or at least that was our experience last week."}, {"username": "Lynn Francisco Casella", "comment_text": "Hotel vans"}, {"username": "Sara Beth", "comment_text": "50"}, {"username": "John Bruckman", "comment_text": "Yes 50 euros"}, {"username": "Mira Elezovski", "comment_text": "Tyson Ak"}, {"username": "Frank Hunt", "comment_text": "50 Euro to Airport is fairly standard from airport may be topped up. Get the train then a taxi if concerned."}, {"username": "Jesse Pacheco", "comment_text": "And arm and leg."}, {"username": "Paolo Macera", "comment_text": "So much cheaper with the train!!!"}, {"username": "Catherine Silvera", "comment_text": "YES! And make sure the tax you get into has the government placard on the side. There are gypsy taxi drivers, who are awful."}, {"username": "Eliza Ibarra", "comment_text": "Good question!!"}]}, {"id": "2201120726953672", "text": "Looking for recommendations for quaint, charming towns we could take the train to from Florence. We're hitting all the tours and things to do in Florence during our trip but we have a full day we'd like to use to explore off the beaten path a bit. Hit me with your favorites! Thanks in advance for your help!", "link": "facebook.com/groups/1373361046396315/permalink/2201120726953672/", "likes": 4, "comments": [{"username": "Carolyn Chambers Rosamilia", "comment_text": "Anything accessible by train will not be quaint and off the beaten track. For that you will need a bus or rental car and more time."}, {"username": "JeriLynne Clifford", "comment_text": "I would invest in a driver. We’ve hired them to take use to wineries etc.\n\nhttps://\nwww.montalcinowi\nnetours.com/"}, {"username": "Jason Hobel", "comment_text": "Lucca is awesome and walking the wall at evening time is about as perfect as perfect gets. San Gimignano and Siena are amazing too. There are so many nice towns in the Tuscany area and in Umbria too like Assisi, Perugia and Spello too."}, {"username": "Khushi Khanna", "comment_text": "I second Lucca. Also Volterra."}, {"username": "Liz Anne", "comment_text": "Just did a day trip from Florence with Viator. We visited Siena, San Gimignano, had lunch on a vineyard, and Pisa. All beautiful with an excellent guide."}, {"username": "Robert Sullivan", "comment_text": "Fiesole is terrific for a day trip"}, {"username": "Nic Nic", "comment_text": "Definitely Lucca"}, {"username": "Benedetta Vanni", "comment_text": "By train from Firenze:\n- Lucca: city walls, churches, squares, art exhibitions\n- Pisa: tower, cathedral, museo nazionale di San Matteo, art exhibitions in Palazzo Blu, award winning gelato at De Coltelli\n- Pontedera: Museo Piaggio (the Vespa company) right across the street from the station\n- Siena: no need to explain\n- Colle Val d'Elsa (+ 15 minutes by bus from the station of Poggibonsi): the river Elsa (explore!), the old town on the hilltop, high end gourmet restaurant Arnolfo\n- Viareggio: long walks on the Lungomare (waterfront), beach, seafood restaurants, shopping"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Arrezzo"}, {"username": "Fiona Cameron", "comment_text": "Cortona"}, {"username": "Elena Eckley", "comment_text": "VERNAZA in Cinque Terra. Montecatini a spa town west of Firenze"}]}, {"id": "2201117926953952", "text": "Going to Florence next week I know I read someone here to buy the best leather in what store? Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2201117926953952/", "likes": 3, "comments": [{"username": "Scott Perry", "comment_text": "Benheart is a great store. Obama has a Benheart jacket."}, {"username": "Lushan Yao", "comment_text": "The Leather School of Florence is a good place to start. Everything is handmade in Florence. They also do monograms free of charge if you like."}, {"username": "Sandy Radican Shikaly", "comment_text": "The leather school behind Santa Croce"}, {"username": "Blanca Gil", "comment_text": "Infinity Firenze at Borgo Santi Apostoli"}, {"username": "Kurt Tilton", "comment_text": "Ponte Vecchio Florence and Gerardo Moradei are my favorite. Right on the Arno"}, {"username": "Gina Gourlay-Blackberry", "comment_text": "We were told by a salesman at a reputable leather shop (can tote all the name now) to be careful not to purchase from the stores that have the same bags on repeat. They are not authentic but cheap imports branded with Made in Italy."}, {"username": "Ilene Tobey LaMalfa", "comment_text": "Ilene Tobey LaMalfa"}, {"username": "Jill Greenberg Minton", "comment_text": "It also may depend on what you are looking for. I went to leather school a couple weeks ago looking for a handbag. I honestly did feel there was a large selection for that."}]}, {"id": "2201180216947723", "text": "Have been in Rome for a couple of days, first trip without the kids. Could anyone recommend gifts to take home for 3 and 7 year old boys because I am struggling to find things? Thanks x", "link": "facebook.com/groups/1373361046396315/permalink/2201180216947723/", "likes": 3, "comments": [{"username": "Maecy Orfano", "comment_text": "If there’s a Lego store in Rome, get the Vespa Lego set! I got one while in Florence (wasn’t initially expecting to buy anything, just got it on a whim lol) and loved it!"}, {"username": "Maecy Orfano", "comment_text": "Chocolate/\nsweets are always nice too 🙂"}, {"username": "Sigrid Cormier", "comment_text": "A Pinocchio wooden puppet. The story originated from Florence, Italy."}, {"username": "Dr-Jon Warnecke", "comment_text": "Christmas Ornament"}, {"username": "Tara Roed", "comment_text": "Got my niece and nephews some cool little helmets at the colosseum, a book about it, candies and cookies and euro coins. And I got everyone bookmarks. They loved all of it. They just like little stuff I find. They actually really loved the money. One of my nephews asked if I had any rocks. I did bring some back from the beach in Positano and he loved that too"}, {"username": "Stacey Esposito", "comment_text": "The gladiator sets with chest cover helmet and sword."}]}, {"id": "2201182210280857", "text": "Thank you everyone for all of your great advice! I am wanting decide if purchasing leather boat shoes would be more sensible in the US, or in Rome or Venice. Please advice. We will be in Venice first.", "link": "facebook.com/groups/1373361046396315/permalink/2201182210280857/", "likes": 0, "comments": []}, {"id": "2201183963614015", "text": "Looking to do a day trip from lake como (staying in bellagio) to somewhere in Switzerland. Let’s hear your best recommendations!", "link": "facebook.com/groups/1373361046396315/permalink/2201183963614015/", "likes": 0, "comments": [{"username": "Carolyn Ross", "comment_text": "following"}, {"username": "Lyn Evans", "comment_text": "We plan to go to Alp Grum for lunch from Varenna. If travelling before mid sept be aware there’s a part bus leg between Sondrio and Tirano as there’s trackwork going on. At Tirano you get on the Bernina express or Regional train. Best option is to research on Trenatalia and Swiss direct rail sites. I didn’t think our daytrip would be possible when I looked at Rome2Rio but I then researched on the direct train sites and it is. It will be a big day but worth it."}, {"username": "Ashley Abernathy", "comment_text": "We are staying in Bellagio in august and just booked a day tour to St Moritz. Private driver takes us to Tiranao train station, from there we take the Bernina Express to St Moritz. We explore for a few hours and then the driver picks us up and takes us back to Bellagio with stops at small Italian towns on the way back."}]}, {"id": "2201186230280455", "text": "Pvt guides: going to Florence mid Sept 2023. Would like to hire a driver for the day for 4 adults. Does anyone have any recommendations on pvt drivers? We want to explore small towns in Tuscany. Also any suggestions on what to see there, are welcomed. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2201186230280455/", "likes": 1, "comments": [{"username": "Colleen Robinson", "comment_text": "We hired Andrea for the day. He picked us up at our hotel at 9 and dropped us off at 6.. He was extremely knowledable about the area and wineries and spoke very good english. He charged us 520 euros for the day. You could ask him to take you to certain places or ask for recommendations\n. It was our favourite day. I suggest searching areas to see in the val d'orcia area and tell him what you are interested in. Some like exporing the country side, cypress trees, exploring towns and churches. You can taylor it to your interests You can email him to get a quote and information .\n\na64.vignoli@gma\nil.com"}, {"username": "Marie Barré", "comment_text": "He’s likely already booked for September but this is who we use:\n\nhttps://\nalessandrocammil\nli.wordpress.co\nm/"}]}, {"id": "2201187490280329", "text": "I have seen many posts regarding booking trains. We are arriving in Rome and need to grab the high speed train to Florence. We are arriving right before noon from the US. I was planning on waiting till we landed, and arrived at ROMA terminal before we purchase tickets. I am concerned on being able to get tickets. Question: if we book let's say a 2:00pm train and we arrive early or LATE, how easy is it to change trains? TIA", "link": "facebook.com/groups/1373361046396315/permalink/2201187490280329/", "likes": 6, "comments": [{"username": "Jojo Hanna", "comment_text": "Wait until you get to the station to buy tickets. No stress if your flight is delayed or you’re kept waiting at the airport."}, {"username": "Rachael Richardson", "comment_text": "There was plenty of room on all the trains we went on , quite frequent to main places"}, {"username": "Karen Schmidt", "comment_text": "I’d be tempted to wait. You might pay more, but at least you won’t be out of money if there is a big delay. Otherwise, you can buy an open type of ticket that let’s you board any train for that destination."}, {"username": "Wendy Farrell", "comment_text": "We’re here now and have just booked everything on the day. No problems at all. Download one of the train apps. I used Italio."}, {"username": "Elizabeth Friera", "comment_text": "Can someone please explain exactly how to get from FCO to Florence via train? Thanks in advance."}, {"username": "Tracy Piko Lawniczak", "comment_text": "We pre booked and ended up having way to much time. So we went to change it and our ticket kind there was no trains available. So we had to book another ticket. But we were able to book the new train that wasn’t available for change 🤷‍♀️. I did changeable but guess not the right changeable ticket."}, {"username": "Wendy Gauci", "comment_text": "Maybe look into Club Executive class for Italo with a flexible fare, then if you arrive at Roma Termini early, you’ve got an executive lounge you can rest in with food/drinks. I haven’t experienced it myself, so someone else who has should be able to tell you more. I’m investigating it for when we have to check out of our accommodation in Rome at 10, but can’t check in for Florence until 2, so thinking of relaxing there for a couple of hours. https://\nwww.italotreno.i\nt/en/the-train/\nlounge-italo-clu\nb"}, {"username": "Mia Catalano", "comment_text": "We had tickets booked. We arrived early, as long as you have a ticket, the lady said it is fine to go early. So we left on the earlier train to Roma termini, before getting on the high speed train to Florence. This meant that we had a bit of extra time at the train station in Rome to get something to get and relax a bit! 😀"}, {"username": "Nadia Filice", "comment_text": "Never a problem to get tickets from FCO airport. Then transfer at Rome Termini and go directly to Florence. No need to pre purchase tickets."}, {"username": "Bill Casper", "comment_text": "They will be $$$& if you wait."}, {"username": "Pat Petrello", "comment_text": "F"}, {"username": "Andrea Ferretti- Kearney", "comment_text": "Whatever you decide to do, I would suggest allowing enough time. I’d rather wait another hour than to miss the train which is what happened to us while going from Milan to Rome."}, {"username": "Catalina Daniel", "comment_text": "If you want to get them now be sure they are refundable/\nchangeable. ours were NOT & lost out on them. Knowing what I know now… Id wait"}]}, {"id": "2201189880280090", "text": "De we need to book very in advance for trains? We will go from Rome to Bologne an dafter to venise. Is there many trains, what are the main station I should look? Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2201189880280090/", "likes": 1, "comments": [{"username": "निनावी सहभागी", "comment_text": "Up"}]}, {"id": "2201190416946703", "text": "Hello! Last minute opportunity to visit Italy mid September for 10-12 days. Suggestions and tips would be appreciated as well as thoughts on airline carriers out of NY. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2201190416946703/", "likes": 1, "comments": [{"username": "Meghan Tan", "comment_text": "Italy is large- where are you going? Many hotels are already booked for September; most major airlines fly out of NYC directly to either Milan or Rome."}, {"username": "Bill Casper", "comment_text": "3-4-5. (Days in each place) Venice-Florence\n-Rome."}]}, {"id": "2201191620279916", "text": "Where can a nervous, first-time traveler to Italy get detailed instructions on getting from the Rome airport to Assisi by train?", "link": "facebook.com/groups/1373361046396315/permalink/2201191620279916/", "likes": 4, "comments": [{"username": "ويني ديلاكروز راموس", "comment_text": "Same here"}, {"username": "Scott Perry", "comment_text": "Take the Leonardo Express to Roma Termini first. They leave every 15 minutes. Once at Roma termini, go to the ticket machine. You can select English. It’s pretty straightforward\n, but make sure you validate your paper ticket. You can do this at machines marked, if memory serves, “convalidare.”"}, {"username": "Anthony Martini Jr.", "comment_text": "Google maps can tell you once u are there"}, {"username": "August Thick", "comment_text": "Download Rome to Rio app."}, {"username": "Jill Brothers", "comment_text": "Rome to rio app"}, {"username": "Annette Fordyce", "comment_text": "Also- the train station is at the bottom of the hill, and it’s a short bus or taxi ride to the section of town on top of the hill. There are still things to see in lower Assisi (Basilica of Saint Claire), but most of the things people come to Assisi for are hill top."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Rome2Rio.com"}, {"username": "Linda Miller", "comment_text": "Try searching YouTube!"}, {"username": "निनावी सहभागी", "comment_text": "Y’all rock, thank you!"}, {"username": "Phyllis Snyder", "comment_text": "I’m going to do that trip by train. Go on Rome2Rio.com and get information."}, {"username": "Blanca Gil", "comment_text": "Once you are at a Roma Termini, you can purchase tickets to Assisi at the ticket machines or on the Trenitalia app. Trains to Assisi later in the day have a change either in Foligno or Spoleto. When you arrive in Assisi, you can take a taxi or purchase a bus ticket into town San Francesco direction. Bus tickets can be purchased at the shop at the end of the train platform."}, {"username": "Ginger DiGalbo Katz", "comment_text": "Take train from airport to central termini train station in Rome. You can buy tickets ti assisi there"}, {"username": "Martin-John Rubio", "comment_text": "Don’t be nervous… But be excited!… It’s so easy to move around nowadays… I would recommend trying ￼the\nRome2rio app…it’s EZPZ"}, {"username": "Laura DeCicco", "comment_text": "Rome2rio"}, {"username": "Alessandro Iannelli", "comment_text": "Just go to trenitalia.com and buy the ticket there, the cheapest ticket is 20.70 euros. A word of warning: the train station of Assisi is not exactly within Assisi, there's around half and hour of waking uphill to get to the town proper, of course there's also a bus."}, {"username": "Amy Kaye", "comment_text": "Watch your pockets! This is not a exaggerated concern, I swear to you! Speaking from experience, we thought we were bring careful 🙄"}, {"username": "Cynthia Marie", "comment_text": "Rome2Rio is a great source for information. I use it quite often in many countries while traveling."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2201193330279745", "text": "Hotel suggestions for Rome with airport, transportation close to everything reasonable price", "link": "facebook.com/groups/1373361046396315/permalink/2201193330279745/", "likes": 3, "comments": [{"username": "Tracy Walker", "comment_text": "Hotel Tiber"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "There is no free airport transportation.\nSet taxi rate is 50€."}, {"username": "Bennett Richards", "comment_text": "Hotel Grand Palatino in the hip Monti district. Great location, great staff, great breakfast. 7 min walk from the Forum and Colosseum, Trajan’s column, a bit longer walk to the Baths of Caracalla, Piazza Navona, Spanish Steps or the Pantheon.\nYou can have the hotel pick you up by from the airport with a private car $50 Euros.\nReally great location."}, {"username": "Steven Pumilia", "comment_text": "You need to be more specific with your question. Do you want to visit Rome? And tour for several days? Or do you want a close by airport hotel for a layover? Which airport?"}, {"username": "Sonita Sandhu", "comment_text": "I liked staying in Piazza Navona area. I took the Airport Express train to Roma termini and then a taxi to hotel. But if it’s more than 2 people better to take taxi."}, {"username": "Mindy Grossman Sepinuck", "comment_text": "Thx all ! My travel agent friend sent me up with a pick up with a private driver, and we are staying at the"}, {"username": "David Riegel", "comment_text": "all depends what you consider is reasonable"}]}, {"id": "2201194586946286", "text": "I was just reading how they found emperor Nero’s Theater during a renovation of a Four Seasons hotel in Rome. That story is interesting enough but the last sentence in the story said this.\n\n“News reports have said the hotel is expected to be open in time for the Vatican’s 2025 jubilee, when an estimated 30 million visitors and pilgrims are expected to visit Rome.”\n\nIn case you didn’t know about this jubilee in 2025, you may want to avoid Rome at that time or, maybe you want to be a part of it. In any event, be aware.", "link": "facebook.com/groups/1373361046396315/permalink/2201194586946286/", "likes": 3, "comments": []}, {"id": "2201204466945298", "text": "Going to Puglia next June, what are some awesome tours or cooking classes to do? We have over a week there!", "link": "facebook.com/groups/1373361046396315/permalink/2201204466945298/", "likes": 1, "comments": []}, {"id": "2201207133611698", "text": "Recommendations for a specific car service or option from Ravenna port to Bologna airport please. Coming back from a cruise (Royal Caribbean)and need to be picked up around 7:00 am", "link": "facebook.com/groups/1373361046396315/permalink/2201207133611698/", "likes": 0, "comments": [{"username": "Brenno Bianchi", "comment_text": "The bus number 90 or a taxi will bring you to Ravenna train station. There every hour there is a regional train that for 8€ will bring you in 1h 11min to Bologna Train station. Inside the station there is a people mover called Marconi Express that will bring you in 7 minutes inside the airport."}]}, {"id": "2201205640278514", "text": "I'm about 30 days out from my trip to Italy. We have just a couple days in Naples, we are not planning to see Pompeii. Would a day trip be feasible to Sorrento or am I going to miss being in Naples two days? Any thoughts?", "link": "facebook.com/groups/1373361046396315/permalink/2201205640278514/", "likes": 0, "comments": [{"username": "Sonia Scotto Lubrano", "comment_text": "I think a day trip to Sorrento is totally doable from Naples."}, {"username": "Barbara Brosnan", "comment_text": "Honesty, I’d prefer Pompei to Sorrrento. Sorrento was a nice base, we did Capri, Agerola, Path of the Gods and Pompei from there. Sorrento had some decent restaurants and some nice shops, but other places were more interesting to us."}, {"username": "Cassandra Goodgame", "comment_text": "Take the ferry over to Ischia. I loved it there."}, {"username": "Glenn Todd Webb", "comment_text": "Sorrento has nothing more to offer. Stay in Naples. Lots to see. Archaeological museum, San Martino on top of funicular ride, Casertes palace, duomo, catacomb, San servino and the veiled Christ. Don’t waste precious time traveling back and forth."}, {"username": "Barone Raffaele Cortese", "comment_text": "Se hai intenzione di andare al mare,Sorrento è una tappa obbligatoria. Pompei ad agosto è abbastanza sconsigliata,fa\ncaldissimo ed il sole batte forte, come Napoli città.\nIo ti consiglio vivamente di portare costume e maschera subacquea e di andare a punta campanella o ai bagni della regina Giovanna,poco distanti da Sorrento ma con un mare meraviglioso."}, {"username": "Suzanne Mills", "comment_text": "Pompeii is a must!"}, {"username": "Kath Milburn", "comment_text": "Definitely do Sorrento. Trains run regularly and it is well worth a visit."}, {"username": "Cindy Sguazzin", "comment_text": "I think it’s a pity not to see Pompei, those ruins and what they represent are unforgettable!"}, {"username": "Paola Bobko", "comment_text": "Emily Waugh I would definitely re-evaluate Pompei.\nIf you’re into art/history, I would say it is a must-do.\nI would not suggest Naples, I think You can skip that. There are more interesting spots, that are cleaner, safer less chaotic and more tourist friendly.\nSorrento is a nice town, but for somebody who is coming for the first time and probably will not come back soon, I would not put it on the must-do list. It is not that wow honestly; You can do Capri instead (or Ischia), or go to any other town in the Amalfi coast (my top 3 are Ravello, Positano, Vietri sul mare) in this order. Enjoy! 🙂"}, {"username": "Marilyn Caladine", "comment_text": "Naples is dominated by Vesuvius, buildings, noise, poverty, richness, extremes, real life. Sorrento is 1 1/2 hours drive (train ride) away and as you are half way on your journey the scenery changes to colour, beauty, richness. The further south you go Positano, Amalfi it gets even more stunning. Maybe get the ferry to Procida or Ischia or Capri. These are the islands near to Naples and you get away from the madness of the traffic? If you are there in August bear in mind the heat (Pompeii no shade) and it is the Italian holiday season. I think I would head for Ischia, Procida on a ferry, nice and cool and beautiful 🍋"}]}, {"id": "2201208310278247", "text": "Hi all,\nI’m wondering if anyone had any experience in renting a wheelchair in Rome and in Sorrento a week each or anyone knows how I can do that", "link": "facebook.com/groups/1373361046396315/permalink/2201208310278247/", "likes": 0, "comments": []}, {"id": "2201208700278208", "text": "Hi everyone! I've gotten a lot of great insights and read wonderful stories from this group! I'm going to be solo travelling soon and plan on swimming a lot and I don't think I'll feel safe leaving my phone on the beach. Does anyone have a recommendation for a good and affordable waterproof mobile holder that I could bring with me when swimming? Also I'm from Sweden!", "link": "facebook.com/groups/1373361046396315/permalink/2201208700278208/", "likes": 0, "comments": []}, {"id": "2201216183610793", "text": "Good evening folks,\n\nI’m solo travelling in Turin soon…\n\nSo I’ll be flying into Torino Airport, I haven’t booked accomodation as of yet. Where is the best place to stay, that’s not too far from the airport but it reasonably central to everything ?\n\nAlso, is Turin an easy city to get around. What are the best things to do over a 1 week period ?\n\nThank you\nLove from Scotland 🏴󠁧󠁢󠁳󠁣󠁴󠁿\n♥️", "link": "facebook.com/groups/1373361046396315/permalink/2201216183610793/", "likes": 4, "comments": [{"username": "Connie Lubinsky", "comment_text": "I just spent a month in Turin and loved it. Valentino Park, palazzo castello, Musea Reale, Superga, Veneria. I’m not a museum gal but everyone says the Egyptian Museum and the Cinema museums are a must. I did not have a car and walked or took the metro,\nBus or tram everywhere. It’s a beautiful city and there is much more to see them I have listed here."}, {"username": "Connie Wilson", "comment_text": "We love Torino and were just there in June. We stayed in Casa della Contessa, very centrally located, quiet rooms and a delicious breakfast. We bought the three day Torino + Piemonte card which is a great deal for many sites. Visited the amazing Egyptian Museum, took the elevator to the top of Mole Antonelliana for wonderful views of the city, toured the huge Automobile Museum, and took the Venaria Reale bus to visit this amazing palace of the Savoys. There are so many beautiful piazzas and palaces in the city center. You are just a short train ride from Alba and Asti for day trips to the wine region. Another beautiful city to train to is Ivrea. The hunting lodge of Stupinigi is incredible and can be reached by bus. We used WeTaxi exclusively for getting around the city - download the app and book your ride, having the choice to prepay.\nEnjoy this amazing, elegant city that often is overlooked.\n\nhttps://\nuntolditaly.com/\nepisode-055-pied\nmont-with-olivi\na-windsor/\n\nhttps://\nen.casadellacont\nessa.com/\n\nhttps://\nwww.turismotorin\no.org/en/\nyour-trip/\ntorinopiemonte-c\nard\n\nhttps://\nwww.museocinema.\nit/en/\nmuseum-and-ma-pr\nolo-foundation/\nmole-antonellian\na\n\nhttps://\nwww.miomyitaly.c\nom/\nvenaria-palace.h\ntml\n\nhttps://\nwetaxi.it/"}, {"username": "Alice Francesca", "comment_text": "Hello! I Am from Turin and si glad you will be coming here!\nPick a hotel in the center.\nAll the major attractions are in walkable distance, apart from Reggia di Venaria\nDon't miss this , just ask about the bus that takes you there\nhttps://\nlavenaria.it/"}, {"username": "Ccaitlinn Sscanlann", "comment_text": "Adris Razwan hope you got a big suit case I can fit into 🤣x"}]}, {"id": "2201217250277353", "text": "Best no show socks that will dry overnight after being washed ?", "link": "facebook.com/groups/1373361046396315/permalink/2201217250277353/", "likes": 2, "comments": [{"username": "Cathrine Cashwell Lowery", "comment_text": "Bombas!"}, {"username": "Kerri Bevilacqua", "comment_text": "I second Bombas! And they helped me to not get blisters"}, {"username": "Lisa Gaimaro Sullivan", "comment_text": "I don’t know about drying, but bombas do stay up and not roll down into your sneakers which is a plus. They are pretty thin so will probably dry quickly. They are also pretty expensive."}, {"username": "Dianne Metcalf", "comment_text": "Wrightsocks cool mesh hands down are the best we have found. Rinse them out at night with shampoo from hotel, roll in towel to get excess water out hang up & they will be dry before morning."}, {"username": "Brenda Mikels Bunch", "comment_text": "Ondo socks are the only no show socks I can wear that don’t slide down- including Bombas. The are thin enough the would dry quickly/ overnight."}, {"username": "Joan Markey Barbero", "comment_text": "Ondo"}, {"username": "Jessica Stewart", "comment_text": "I wear keds no show never had a problem they have a gripper on the heel"}, {"username": "Elaine King", "comment_text": "Purchase before your trip and test the socks,"}, {"username": "Linda Ruckert", "comment_text": "Feetures"}, {"username": "Joan Belserene Forcheski", "comment_text": "Darn Tough Wool socks. All varieties. Made in Vermont. Wash and dry ready next day. And lifetime guarantee."}, {"username": "Donna Nicoletti Guiffreda", "comment_text": "Sketchers , nice and thin ,dry quickly"}, {"username": "Bianca D'Amore", "comment_text": "Bombas"}, {"username": "Judy Carey", "comment_text": "You'll be hit or miss with everything except Bombas. Once you try them, well, you'll be hooked!"}, {"username": "Beth Scanlon Donnelly", "comment_text": "Bombas"}]}, {"id": "2201217490277329", "text": "I’m planning a trip through Italy and was interested in Ischia? Has anyone stayed on that island? I’m on a few sights and don’t see too many people talking about it. Any thoughts or suggestions are appreciated. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2201217490277329/", "likes": 1, "comments": [{"username": "Angela Marsala-Gaydos", "comment_text": "It’s beautiful-only spent a few hours there but it’s worth a visit"}, {"username": "Carin Corriero Volpe", "comment_text": "Beautiful island, stayed a couple of days 2016, going back this fall."}, {"username": "Sigrid Cormier", "comment_text": "Booked for 2 nights in Sept. looking forward to the thermal baths."}, {"username": "Gianna Onesi", "comment_text": "It's beautiful island so I hear"}, {"username": "Billie Begley", "comment_text": "We are going there but on a day trip from Sorrento."}, {"username": "Lisa Adams Robertson", "comment_text": "The castle is pretty interesting. We stayed 3 nights and had an all day private boat tour of the island booked, but it was canceled due to high swells. I've read raves about the spas and thermal pools, but we didn't experience any of that, so if you're a spa person, check those out. Picture from the castle."}]}, {"id": "2201225083609903", "text": "Just an FYI - starting in 2024 an ETIAS will be needed to travel to European Schengen countries. You apply on line and it takes a few days or 30 days to receive. It’s good for 3 years entry- and is put on your passport. Not sure how applying it to the passport is done. Just be sure to complete this application and get results way before traveling!", "link": "facebook.com/groups/1373361046396315/permalink/2201225083609903/", "likes": 57, "comments": [{"username": "Marie Cuzzi", "comment_text": "I read about this\nI wish you could just apply for it without having a travel plan in place"}, {"username": "Rip Lonergan", "comment_text": "I look today and they aren’t taking applications yet"}, {"username": "Cynthia Marie", "comment_text": "Oh thank goddess, we are leaving Italy for England, right before the new year. 😊\none less thing to worry about 😊"}, {"username": "Maria Cosentino Tavian", "comment_text": "Rick Tavian"}, {"username": "April Nowobielski Marron", "comment_text": "It's really not a big deal. Most people will be approved in seconds if everything is in order. It's not even starting on January 1. It's just some point in 2024. I looked into it today bc my son leaves for his study abroad on 1/9 to Greece"}, {"username": "Cindy Sguazzin", "comment_text": "Does this apply only to Americans?"}, {"username": "Neika Toota Kelley", "comment_text": "Most will be approved in seconds its not a visa but a visa waiver is considered just a travel document it costs just over $7 American it’s good for 3yrs once approved if not approved in seconds may take a few days didn’t see anything that stated may take more then a few days for approval says to go through this process before booking but also says needs some EES program in place before can actually start it up and the EES program isn’t expected to be in place until summer of 2024. Once it is up and running there will be a 6month Grace given where you will still be allowed in then an additional period where if you’ve not traveled to the EU since it has been inacted then it will still be ok to enter so we have some time. My family will travel to France and Italy in April so I’ve done a good bit of research."}, {"username": "Erica Babb", "comment_text": "I heard they are trying to make the date for this after the Olympics in Paris?"}, {"username": "Sandra Yee", "comment_text": "Thank you very much for spreading the word"}, {"username": "Esther Steinbok Sustersich", "comment_text": "This makes no sense. This means when I apply I must know first country I plan to go to. So I must pretty much have a ticket booked because depending on flights I might be connecting in a different country to the one I’m actually going to."}, {"username": "Joe Guzzi", "comment_text": "What's the big deal? The US already has had such a system in place for more than a decade!\n\nAnd it's sure better than the old days when you actually needed to get a visa!"}, {"username": "Sylvia Doherty", "comment_text": "I believe that all Schengen countries will be requiring a visa from travellers outside the Schengen area"}, {"username": "Alexandra A Welker", "comment_text": "Yeah, I came across the article about this in June. It's not that big of a deal, at least we don't have to apply every year."}, {"username": "Carine Brys", "comment_text": "There is no need to stress over this, just one more piece of paperwork. It's exactly the same thing as the form (waver of visa) that the US requires from non US citizens when visiting the US. Except the US calls it an ESTA, it costs 21 USD and is also valid for 3 years."}, {"username": "Lora de Vries", "comment_text": "We (EU nationals) have to apply for the ESTA when we visit the US/Canada and it costs much more than the ETIAS will. We have been doing this for years prior to visiting the US and Canada. Also, the US wants to know who will be visiting in terms of security and the EU will do the same as well and about time too. This new rule will not only apply to Americans, but to other visa exempt nationals, who want to visit the EU.\n\nETISA is pre clearance in order to visit our EU countries. Trust this clears up some of your doubts."}, {"username": "Michelle Creed", "comment_text": "So if I am traveling out this Christmas and not coming back till after the new year, do I need to get this visa?"}, {"username": "Joe LaLonde", "comment_text": "Australia has required something similar, including for Americans, forever. And theirs costs more and doesn’t last as long. It’s really not that big of a deal, but it’s good that it’s such a hot topic so that people will know and be prepared."}, {"username": "Renae Larcus", "comment_text": "It’s not even available yet if you look at the website"}, {"username": "Delaine Remle Botelho", "comment_text": "Thanks for the info!"}, {"username": "Selin Demirci", "comment_text": "Yes but I already apply for a schengen visa each time. What is this new thing?"}, {"username": "Helen Louise", "comment_text": "We need one from the UK….another Brexit bonus 🙄"}, {"username": "Fetchin Gretchen", "comment_text": "These days your tickets, global entry, visas are digitally attached so they show up on a scan of your passport."}, {"username": "Adam Nuaimi", "comment_text": "Who will go to Europe they dont have money even to disinfect mosquitoes"}, {"username": "Yasmine Marie", "comment_text": "I read three months not three years. Just another way to make money like everywhere else."}, {"username": "D Rochelle Milton", "comment_text": "Some have known about ETIAS for awhile but people are feeding wrong info to others.\nFor those continuing to visit Europe, 2014 these are the countries that will require a valid ETIAS visa waiver on arrival in their territory: 23 EU Members 👇🏾\n\nPlus 4 Non-EU Members: Switzerland, Norway, Iceland, and Liechtenstein.\n\nI pulled from the ETIAS data base."}, {"username": "Sandi Coady-Frost", "comment_text": "Note. You need to apply on line at least 4 days (96 hrs) before your departure flight."}, {"username": "Brenda van Valen", "comment_text": "I understood the site wasn’t open yet."}, {"username": "Scott Seneca", "comment_text": "FYI 3 years or less if your passport expires before the 3"}, {"username": "Gerard Condo", "comment_text": "They found yet another way to rip off the tourist.....alr\neady paying a per day tax in lots of countries.....🤬"}]}, {"id": "2201226813609730", "text": "Hello trying to book train tickets through Omio. Is it normal to ask passengers names, do they ask for ID?", "link": "facebook.com/groups/1373361046396315/permalink/2201226813609730/", "likes": 1, "comments": [{"username": "Ibbu Mohd", "comment_text": "Book via trenitalia or italo, directly from trains, dont book via thirdparty"}, {"username": "Katalina Loredo", "comment_text": "Don’t book through third party apps. Book direct with the train comments that are listed in the comment above. And yes the train websites do ask for names and birthdays"}, {"username": "Victoria Laverty", "comment_text": "Do through conpany direct"}]}, {"id": "2201231230275955", "text": "Ciao a tutti!\nAlthough I do not intend to die, I planned to see Venice in early October for 3 days only 🥰\nIs there any chance to find places where Venetians go and tourists don't give a damn about?\nDo I have any chance to find a beach in Lido open or are there free beaches? (Yes, I know, it's funny to go all the way from Greece to Italy to swim, but first, I do not have great expectations and mainly, I'm a year round swimmer who wants to swim all kinds of seas.)\nI'm not a tourist, I'm a traveller and I love to speak italian.", "link": "facebook.com/groups/1373361046396315/permalink/2201231230275955/", "likes": 0, "comments": [{"username": "Alice Francesca", "comment_text": "You have never heard of the beaches and sea of Sardinia in Italy, evidently;)"}]}, {"id": "2201233936942351", "text": "First time staying in Umbria, looking for recommendation on villages to visit within 30mins of Orvieto. Has anyone been to Orte? Will go to Lake Balsena , Assisi, and Citiva di Bagnoregio.", "link": "facebook.com/groups/1373361046396315/permalink/2201233936942351/", "likes": 5, "comments": [{"username": "Romilly Farina", "comment_text": "We stayed in Montefalco and loved it!!! Such a small village but a couple of excellent restaurants, wine bars and shops."}, {"username": "Janet Hitzeman Lynch", "comment_text": "Assisi for sure!"}, {"username": "Dr-Jon Warnecke", "comment_text": "Siena, Cortona, Volterra, Perugia, Assisi, Todi, and then Spello, Spoleto, and Cascata delle Marmore waterfalls a little further away! A walk along Lake Trasemeno is nice also. I lived in Perugia 4 years!"}, {"username": "Melanie Baffes", "comment_text": "Assisi, Civita, and Arezzo!"}, {"username": "Melanie Waters Hearsch", "comment_text": "assisi was lovely!! also enjoyed Gubbio"}]}, {"id": "2201239360275142", "text": "We are going in October. landing at 6:45 am in Milan on a Sunday. Not planning on checking bags as long as there’s room for our 4 carry ons. We will need to catch a train from Milan airport to Verona. How much time should we leave between airplane landing time and train departure time?", "link": "facebook.com/groups/1373361046396315/permalink/2201239360275142/", "likes": 3, "comments": [{"username": "Jenny Payne", "comment_text": "I would just buy my train tickets when you arrive at the station? anything can happen ? Flight delayed 🌻"}, {"username": "Gina Spyker Fairfield", "comment_text": "It took us 10 minutes to clear passport control when we arrived in Milan last September. We didn’t have checked bags either and were on our way out of the airport 15 minutes after deplaning."}, {"username": "Benedetta Vanni", "comment_text": "Milano has 2 airports: Linate and Malpensa. They are far apart so the answer depends on where you are landing."}, {"username": "Miyuki Kanno Paul", "comment_text": "You need to take Malpensa Express to Milano Centrale(50 minute ride) in order to connect a train to Verona. Don’t buy tickets until you physically arrive at the train station"}, {"username": "Miriam McNally", "comment_text": "May be possible to get a fare that allows for change of train or cancellation \"If the fare booked allows it, tickets can be refunded from your Trainline account.\n\nYou can also refund your tickets directly at the station, if the fare you have selected allows you to do so.\n\nItalo\nIf the fare booked allows it, tickets can be cancelled directly on Italo's website under the 'Manage Journey' section.\""}]}, {"id": "2201243410274737", "text": "Does anyone want to buy my full experience coliseum tickets off me for 2 adults this Saturday July 29th at 1015am? Booked directly via coopculture. DM me if interested.", "link": "facebook.com/groups/1373361046396315/permalink/2201243410274737/", "likes": 0, "comments": []}, {"id": "2201243646941380", "text": "Taking the ferry from Naples to capri tomorrow. Any recommendations?", "link": "facebook.com/groups/1373361046396315/permalink/2201243646941380/", "likes": 6, "comments": [{"username": "Catherine Dauth", "comment_text": "The best is Early in the morning a lot less people we took the 800 o clock ferry."}, {"username": "Sam Mouchamel", "comment_text": "Enjoy it great destination"}, {"username": "Hermineh Topalian", "comment_text": "Give me details"}, {"username": "Marie Cuzzi", "comment_text": "Enjoy it"}, {"username": "Genevieve Bastien", "comment_text": "Go to Marina Piccola and do the chairlift if you can from Anacapri"}, {"username": "Mary Anne", "comment_text": "Go early to the ferry terminal at Naples, especially if there are cruise ships in port. Take water and a hat, and sunscreen. Don’t buy water off the vendors walking around selling it as it can be old bottles refilled. Be cautious in the crowds at the terminal.\nFerries are a great way to travel around."}, {"username": "Gene Alligood", "comment_text": "As you get closer to the island make your way to exiting ship.\nWe stayed over in Capri and booked our own private boat tour of the island; it was magnificent!"}, {"username": "Les Forrest", "comment_text": "Make sure it's sea worthy"}, {"username": "Joe Easton", "comment_text": "Grand Quisisana for drinks. 😎"}, {"username": "Enrico Lecce", "comment_text": "Take the super boat"}, {"username": "Enrico Lecce", "comment_text": "Enrico Lecce"}, {"username": "Frank Hunt", "comment_text": "Yes, make sure the Italians and others don’t push in front of you getting on the ferry.😏"}, {"username": "Mike Trento", "comment_text": "La Tagliata for lunch. Best experience ever!!"}]}, {"id": "2201246710274407", "text": "I am trying to pack light but have a question on dress code. When going to dinner at night in Milan can you wear shorts and sneakers for guys? Or do you need to dress up more?", "link": "facebook.com/groups/1373361046396315/permalink/2201246710274407/", "likes": 4, "comments": [{"username": "Stephanie Smith", "comment_text": "Totally depends on where you eat"}, {"username": "Bonnie Loftspring", "comment_text": "Nice place? be stylish, men too, but casual. Men are very stylish in Milan. Every other store is a men’s boutique. No, not shorts. Light weight slacks, collared shirt"}, {"username": "Connie Wilson", "comment_text": "Milan is an elegant city - best to dress nicer than a day at the ballpark."}, {"username": "Gianna Onesi", "comment_text": "Milan is the city of fashion need to dress the part."}, {"username": "Kristina Ruk", "comment_text": "Common we are tourists not for fashion definately. If not fancy restaurant so no need to dress up. Even I (women) went with shorts, cause why overpack first of all 🤣"}, {"username": "Sutheree Lovell", "comment_text": "Get take out and a bottle of wine find a lovely place and make your own fun!"}, {"username": "Wallace Clavelle", "comment_text": "I did collar shirts or linen shirts with shorts and shoes"}, {"username": "Cynthia Marie", "comment_text": "I guess that would depend if you’re going to a pizzeria or a restaurant. I think slacks, shirt and proper shoes would be more appropriate for a restaurant, even a casual one."}, {"username": "Glen Bentley", "comment_text": "No. You will feel so under dressed. Light wear smart trousers and a loose linen shirts."}, {"username": "Paola Bobko", "comment_text": "Mike Guarini Italians like to dress up, sometimes to overdress. As you are a tourist, you will be more easily forgiven, even in fancier restaurants.\nThough, I would say a stylish casual, polo/shirt & long pants for men would be the most appropriate.\nQuick question: are you going to spend your holidays in Milan? Why did you chose this specific city? Not much to see apart 2-3 highlights and not even on my top 10 in Italy….\nAnyways, enjoy! 🙂"}, {"username": "Giovanni Pianigiani", "comment_text": "If go to dinner in shorts and t-shirt you'll simply stand out as the American tourist, as opposed to the ofyen overdressed Italians. But nobody will deny you admission unless it's a very top class place with probably a dress code."}, {"username": "Glenn Todd Webb", "comment_text": "That’s fine"}, {"username": "Delia Miscella Wroblewski", "comment_text": "It depends on the restaurant."}]}, {"id": "2201122086953536", "text": "Hi people,\n\nI want to travel from Naples to Amalfi and want to know what are the means of transport from Naples to Amalfi and vice versa. Also can you help me with the website through which I can book the ticket.", "link": "facebook.com/groups/1373361046396315/permalink/2201122086953536/", "likes": 5, "comments": [{"username": "Lisa Pro", "comment_text": "Private car was the best for us."}, {"username": "Corina Cristea", "comment_text": "https://\nwww.ferryscanner\n.com/en/ferry/\nresults"}, {"username": "Sandy Radican Shikaly", "comment_text": "Amalfi Coast Transfers"}, {"username": "Anthony Taylor", "comment_text": "Local train from Naples to sorrento.It does take about 1 hour 20,but as cheap as chips and can get ticket on the day at the ticket office"}, {"username": "Phyllis Snyder", "comment_text": "There’s the regional train companala is better than the slower circumvesuviana\n, there’s a bus , and a ferry. And an expensive taxi or private drivers."}, {"username": "Ibbu Mohd", "comment_text": "Ferryhopper"}, {"username": "Diane Davis Lawyer", "comment_text": "I would take a ferry. It's going to be the least expensive means of getting there."}]}, {"id": "2201123050286773", "text": "Traveling to Italy, Greece and then home and I’m wondering if there’s any place that’s better to fly into and out of in Italy and Greece. September 2024￼ we’re taking about a 3-4 week trip to italy and Greece. Tentatively, I think we would like to spend five days to a week at the Amalfi coast and then go up to Florence for 5 to 7 days. After thatआणखी we plan on heading to Greece and going to Santorini for around five days and then Crete for around five days. Does anyone have any suggestions on the best route to take when it comes to flying into Italy then from Italy to Greece and then back home? We will start in Utah and end in Utah. ￼ It’s possible we could shorten some of the stays in a couple of those places and add another place. thanks for the info. ￼", "link": "facebook.com/groups/1373361046396315/permalink/2201123050286773/", "likes": 2, "comments": [{"username": "Dann Hrusch", "comment_text": "Depends on what you're looking for by \"better\". If you're talking cost then Rome and Athens usually has the least expensive option for entry/exit. I'd fly into Rome, then trains to Amalfi and to Florence. Get a cheap flight to Athens from Rome or Florence. Then use Athens as your hub for island hopping and your return flight home."}, {"username": "Corey Anthony", "comment_text": "I did a trip Italy and Greece in 2019 and was going to fly home from one of them until I found it saved me $800 to fly out of Paris instead and that was after the cost for the short flight to Paris. The downside was I stayed 2 nights in Paris and spent more than $800 on food and hotel but I felt like it was still much better than flying home from Italy or Greece."}, {"username": "Erica Senes Tombesi", "comment_text": "What are you looking for? Becouse in my personal opinion amalfi cost is so overrated. if you looking for art and history you can't not miss Roma and Venezia. If you looking for amazing beach check on Sardegna and Sicilia or Puglia."}, {"username": "Phyllis Snyder", "comment_text": "Just an fyi to all travelers going to Schengen areas to double check if you have all the required documents- just read USA citizens holding a passport traveling to Italy need to go on line and apply for a ETIAS. Good for 3 years. And it said it might take 30 days to get your results and document. So just be sure you have all the doc needed."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2201133080285770", "text": "Hi All! We are headed to Italy very soon and want to do a tour of The Coliseum and Pantheon, but want to make sure we buy from a real company. Can anyone suggest a good ticket company? TIA!", "link": "facebook.com/groups/1373361046396315/permalink/2201133080285770/", "likes": 2, "comments": [{"username": "Jeri Olson Huston", "comment_text": "How about right from the actual websites for those two locations?"}, {"username": "Lisa Pro", "comment_text": "Go right to there web site is ur best bet. That’s what we did."}, {"username": "Vanessa Mulquiney", "comment_text": "When is very soon? It’s peak season and I can tell you the Colosseum and the Vatican have been booked out for weeks"}, {"username": "Margo-Danny Warum", "comment_text": "I have 2 Colosseum tickets for Saturday morning if your interested to buy off me. It was booked direct. Dm if interested."}, {"username": "Phyllis Snyder", "comment_text": "Purchase direct to the official website is best! 3rd party sites are more expensive and people are reporting that they their tour was canceled last minute by theses agencies. The official website is www.coopculture\n.it. I believe the ticket window opens 30 advance and 9:00am Italy time."}, {"username": "Lisa Valdovinos", "comment_text": "Viator"}, {"username": "Domenica Calvene", "comment_text": "Turtle tours rome in a golf cart organise a night tour, fantastic."}]}, {"id": "2201137146952030", "text": "Our tour for 10/1 which was paid in full for the Accademia in Florence was just canceled by Roman Guys Tours. We are desperate to see Michelangelo’s David. Please give me suggestions as to how to get tickets for the Accademia . Thank you in advance for your advice!", "link": "facebook.com/groups/1373361046396315/permalink/2201137146952030/", "likes": 9, "comments": [{"username": "D'Anna Hohe", "comment_text": "Book directly with the museum site. You don’t really need a guide."}, {"username": "Barbara Brosnan", "comment_text": "We used Cristina from With Locals and she was amazing."}, {"username": "Jacqui Smalley", "comment_text": "Viator does tours of Academia"}, {"username": "Gina Gourlay-Blackberry", "comment_text": "If you are wanting tickets on 1st October, they are free. Academia is one of the cultural institutions that offer free tic on the first Sunday of each month. We did it last month; go early and line up. We were in the door in under 15 minutes. I’d ask for a refund from your tour company too!"}, {"username": "Cynthia Cahoon", "comment_text": "It’s because you are going the first Sunday of the month and no bookings are required because it is free entrance. Unfortunately you will have to battle the lines so suggest you get there early."}, {"username": "Krissy Dascoli-Meehan", "comment_text": "I bought them on get your guide the day of. Good luck."}, {"username": "Heather MacDonald", "comment_text": "I got mine the day before just last week."}, {"username": "Mike Jamison", "comment_text": "LivTours. Ask for Raffi. She is amazing on the tour and will give you a personalized tour. She buys the tix."}, {"username": "Marian Van Soelen Hand", "comment_text": "We used Viator! Super simple, met them yesterday with our confirmation and were in Accademia within 10 minutes."}, {"username": "Linda Snaring", "comment_text": "Buy a Rick Steves travel book. He will tell you how to buy the tickets ahead of time and even get an appointment so you don’t have to wait in any lines. We have done this twice. And seeing the David is so awesome!!!!"}, {"username": "Kelly Murphy Troup", "comment_text": "www.italianvist\natravel.com\n- Franscesca was amazing! So knowledgeable and gave us all of the history of the David. It was a great tour- highly recommend!!!"}, {"username": "Michelle Bergman Davis", "comment_text": "Buy a ticket thru Viator if you want a guide, or just buy directly through the museum. You can easily pick a time slot."}, {"username": "Mimi Mary", "comment_text": "Just lookup skip the line,you really don’t need a tour guide unless you want to learn it’s history,we used Walk tour"}, {"username": "Anne Boyd Hayward", "comment_text": "I believe I read somewhere that the first Sunday of the month is free- will be packed . Rick Steves says to avoid that day at all costs . We are going October- scheduled tour to avoid the 1st Sunday. Not sure if my info is correct but worth looking in to."}, {"username": "Jeff McLellan", "comment_text": "Book directly only to avoid disappointment.\nNot sure if your day is flexible because the 1st is a Sunday as others have mentioned.\n\nThere is availability for the 3rd. There is no bookings available for the 2nd of October.\n\nhttps://\nwww.galleriaacca\ndemiafirenze.it\n/en/"}, {"username": "Joanne Dunphy", "comment_text": "Well here goes… hubby & I are planning a trip to Italy May 2024.\nWe plan on arriving on Rome for 3 days\nFlorence 4 days\nSorrento 4 days Venice 21/2 days\nThoughts??"}, {"username": "Joanne Dunphy", "comment_text": "Well here goes… hubby & I are planning a trip to Italy May 2024.\nWe plan on arriving on Rome for 3 days\nFlorence 4 days\nSorrento 4 days Venice 21/2 days\nThoughts??"}, {"username": "Bea Kuckens", "comment_text": "We ALWAYS book directly with the venue. Too much can go wrong with third-party tour operators. We also prefer to do our own thing and go at our own pace."}, {"username": "Jerry Lyubelsky", "comment_text": "Check Viator"}, {"username": "Carolyn Madl", "comment_text": "We purchased Skip the line with Viator and just use their headset at museum for 6 euro. it’s worth not standing in several hour lines in the heat and moving onto the next thing to see!"}, {"username": "Jo Ann Ciuffini Forcino", "comment_text": "Thank you all so much!💕"}, {"username": "Rachael Richardson", "comment_text": "There are plenty of replicas to see for free !"}, {"username": "Renee Rundle Stoneham", "comment_text": "Ummm\n10/1 your date is the first Sunday of the month.\nIt’s free for everyone.\nJust go no ticket needed. I’d go early because of crowds.\n\nOtherwise pick another day and buy directly from The Academia."}, {"username": "Susan Brooks", "comment_text": "If you’re staying in a hotel contact the concierge. The concierge can recommend tours for the Accademia and can purchase the tickets for you.\nThe tour company I used was Via Cavour. There are others too."}, {"username": "Lisa Wright", "comment_text": "We got tickets with Get Your Guide in June"}, {"username": "Deb Shoppach Montanaro", "comment_text": "If your dates are flexible, Academia is open late in the evenings on Tuesday and Thursday"}, {"username": "Jo Ann Ciuffini Forcino", "comment_text": "Thank you all for being so helpful!"}, {"username": "Karen Ries", "comment_text": "that is why they canceled your lour, they are not allowed to sell tours on the free Sundays. had the same problem in Rome for the coliseum."}, {"username": "Sue Levy Avinir", "comment_text": "Interesting comment about that day that it’s free. It’s not an expensive ticket so I would go a different day and early to avoid the crowds. IMHO"}, {"username": "Laurel Nation", "comment_text": "I just booked on official website for Accademia for October 6 at 8:15."}, {"username": "Michelle 'Salzwedel' Bobholz", "comment_text": "Check “Through Eternity” tours."}, {"username": "Mary Ellen Maatman", "comment_text": "I think my husband bought them ahead of time directly from the Accademia. David is glorious, so good luck--you will find a way to see him!"}, {"username": "Patti Porter", "comment_text": "Are there no tickets available directly from Academia? We got ours a month out"}, {"username": "Tracy Wrinn Mcdermott", "comment_text": "https://\nwww.galleriaacca\ndemiafirenze.it\n/en/visit/\nCheck the official site"}, {"username": "Kathy Johnson Schaefer", "comment_text": "My mom got them directly from the Accademia too. It was packed when we went and they were running behind on the admission times. There are two lines. Both were long but I suspect it will be better in October."}, {"username": "Wesley A Spear II", "comment_text": "We used Paola Migliorini and it was a great experience. She can be reached at +39 3476572611. Her husband was actually our guide and we didn’t have to wait in any lines. For reference, the booking was under the name of Jennie Spear."}, {"username": "Sue Levy Avinir", "comment_text": "Definitely book direct from their site if available. We booked the early morning timeslot 8:30. I highly recommend. You get right in and no one is there. Your heart will stop for a second as you turn the corner and see David and you are almost the only one there. So worth it."}, {"username": "Mariko Brackett Hendrickson", "comment_text": "That's the first Sunday of the month. Museums are FREE!"}, {"username": "Jennifer Neri Hodges", "comment_text": "LivTours - highly recommend them!"}, {"username": "Grazia Mottinelli", "comment_text": "On the first sunday of each month National museums are free"}, {"username": "Laura Uribe", "comment_text": "Try their website"}]}, {"id": "2201139953618416", "text": "Should we book Rome to sorrento train tix in advanced?", "link": "facebook.com/groups/1373361046396315/permalink/2201139953618416/", "likes": 5, "comments": [{"username": "Cara-lyn Alpin", "comment_text": "Yes I believe they are cheaper"}, {"username": "Sandy Radican Shikaly", "comment_text": "Rome to Naples high speed train is less expensive if booked ahead... local commuter train then to Sorrento or hydrofoil or private driver"}, {"username": "Jason Hobel", "comment_text": "Definitely worth booking ahead to save some money."}, {"username": "Enrico Lecce", "comment_text": "Yes"}, {"username": "Tom Cannon-Bailey", "comment_text": "What site to use for the train tix?"}, {"username": "Jeff Gentner EA", "comment_text": "Do as much in advance as possible. Save yourself anxiety and stress."}, {"username": "Andrew Mircovich", "comment_text": "No just buy the tickets at the station"}, {"username": "Tanya Cini-Kirk", "comment_text": "Buy in advance! We paid $50cdn for 4 tix months before our trip from Naples to Rome. Missed the train and had to buy on the spot $200cdn!! 😳"}, {"username": "Lisa Valdovinos", "comment_text": "We did"}, {"username": "Anne Nelson Mason", "comment_text": "YES!"}]}, {"id": "2201141360284942", "text": "My husband and I are headed to Italy in September. Our first time. We are starting off at the Amalfi coast 9/14-9/17 and looking for hotels around there… Sorrento or Ravello. Many are already booked. We are looking for great views, rooftop bar and close to the restaurants and shops. I appreciate all the input. ￼ or does anybody know any great travel agents? I’ve been looking on this site for weeks now and it’s very overwhelming, yet very helpful. Thank you!!", "link": "facebook.com/groups/1373361046396315/permalink/2201141360284942/", "likes": 9, "comments": [{"username": "Laura Uribe", "comment_text": "You likely have left it too late to get exactly what you want and will need to choose from what’s still actually available."}, {"username": "Sandy Radican Shikaly", "comment_text": "Oh my... many hotels sell out at least 6 months in advance.. I book about 9 months ahead.. a few high end hotels may have availability or in smaller towns on the Amalfi Coast."}, {"username": "Kally Trahearn", "comment_text": "Have you looked at Hotel Plaza Sorrento? It's a great place, but not sure whether they have any availability left. Alternatively, look at Booking.com and perhaps go for an apartment. Sorrento will be cheaper to stay in than Amalfi Coast. Hope you get something."}, {"username": "Susan Weitzenfeld Rosen", "comment_text": "Check in Salerno"}, {"username": "Stephen Henn", "comment_text": "Check Bookkng.com for availability and then contact venue directly."}, {"username": "Jolie Lubitz-Centazzo", "comment_text": "In Sorrento the Grand Hotel Capodimonte. It’s in and ideal location and beautiful! We stayed there in June, loved it!!!"}, {"username": "Gina Romano Peralta", "comment_text": "Hotel pupetto in positiano is amazing."}, {"username": "Gina Romano Peralta", "comment_text": "Sorrento excelsior vittoria"}, {"username": "Valerie Collanton", "comment_text": "Hotel Regina in Sorrento has amazing views."}, {"username": "Brad Nelsen", "comment_text": "Try Hotel Le Fioriere in Praiano."}, {"username": "Brad Nelsen", "comment_text": "Try Hotel Le Fioriere in Praiano."}, {"username": "Robin Barbera", "comment_text": "Sorrento- Grand Hotel De La Villa. Very nice hotel . I wouldn't use a travel agent but you snoozed too long."}, {"username": "Emma Whiting", "comment_text": "We stayed in the Hotel Bristol, Sorrento when we went in April. Highly recommend it!"}, {"username": "Steve Grossman", "comment_text": "September has nearly been sold out since march. Get on the computer immediately and see what you can do otherwise look at airbnb's that are left"}, {"username": "Marilyn Caladine", "comment_text": "Hotel Bristol , Sorrento has amazing views. Rooftop bar. 10 mins walk to town. Situated on a hill. This is the view from rooftop bar 🍋"}, {"username": "Robert Delmond", "comment_text": "Will you have a car? Hotel Due Golfi in Sorrento. Magnificent views of the Bay and Vesuvius."}, {"username": "Rod Fick", "comment_text": "The Hotel Marincanto in Positano was great when we went. And staff was excellent too; helped us with day trips etc."}, {"username": "Elizabeth Amiss Carrico", "comment_text": "Hotel Belair....up the hill, probably a 15 minute walk into town....I just checked the price, it has more than quadrippled since 2015"}, {"username": "Lisa Valdovinos", "comment_text": "We stayed in Sant’Agnello which is a 20 minute walk to Sorrento. The Villa Garden. We loved it. It has a pool but no roof top bar. It has beautiful views and the staff is wonderful."}, {"username": "Jane Lisa", "comment_text": "Good luck making decent reservations so close to your trip."}, {"username": "Maria Thompson", "comment_text": "Positano- Il San Pietro has magnificent views and stellar service."}, {"username": "Samina Jassani", "comment_text": "We are staying here. Heard it’s pretty good with rooftop"}, {"username": "Christine Broussard", "comment_text": "We are staying at Mediterranean suites, it looks lovely, has anybody stayed there??"}, {"username": "Jill Tingley", "comment_text": "Bellview serene in Sorrento on cliff. Voted best!"}, {"username": "Lorraine Mann", "comment_text": "Grand Hotel Aminta was pretty awesome! Great pool and awesome shuttle to town every 30 minutes. Great breakfast and dinner there too!!"}, {"username": "Cheryl Novis", "comment_text": "Hotel plaza also great position and has a roof top bar and pool - great location"}, {"username": "Sonita Sandhu", "comment_text": "I stayed at Hotel Astoria Sorrento which is tucked in the town. So no views or rooftop bar but this worked for me as I was on my own and good location. Booked 2 months before."}, {"username": "Kathy Palazzolo Szalach", "comment_text": "Following"}, {"username": "Sue Sherwood", "comment_text": "We stayed at the Sorrento One Apartments. Had the one room with a balcony and it was awesome. Great location!"}, {"username": "Diane Davis Lawyer", "comment_text": "Your best bet is AirBnb, honestly, unless you can spend hundreds per night for a hotel room. We arrive in Naples on the 16th and leave for Rome/Florence on the 17th, returning to the Naples area on the 22nd for the remainder of our time and leave on the 28th. I've looked at many, many hotels and AirBnb locations since I booked our airline tickets in March, and repeatedly, AirBnB ends up consistently having the best locations, amenities and prices. We've stayed in many AirBnB or VRBO locations in the US and Europe and overall have always been happy with our decision. We have a very nice one booked for Sant'Angello, close to Sorrento, for the end of our trip--we will day trip from there. We had a gorgeous one booked on Capri in a villa but I got antsy about being isolated on an island at the mercy of weather and the ferries to get back to Naples for our flight home."}, {"username": "Kimberly Milo Fay", "comment_text": "You might not get those great views this late in the game. I booked 2 months ago for last week of September/\nfirst week of October and the pickings were slim. Good luck!"}, {"username": "Kimberly Milo Fay", "comment_text": "You might have better luck in Ravello.\nI was referring to Sorrento as being difficult to find a hotel now."}]}, {"id": "2201145706951174", "text": "Traveling Airfrance and I have a roller carry-on bag that is 1- inch width over dimensions on website. Will this be an issue?", "link": "facebook.com/groups/1373361046396315/permalink/2201145706951174/", "likes": 4, "comments": [{"username": "Dave Conroy", "comment_text": "Maybe, impossible to be sure. You may be lucky, like I was on Turkish and my ticket said Dave and my passport David. He noticed, mentioned it wasn't allowed, but decided to let me through. He could have chosen different. Your bag may not be noticed."}, {"username": "Wendy Wallin", "comment_text": "Stick to the rules & you want have to worry about it."}, {"username": "Melanie Sartuche", "comment_text": "We flew Air France in April/May, and on one flight, they asked people to gate check their carry ons, when few people volunteered, they measured and weighed every carry on, and checked them. It didn't seem to affect us because we were in business class, at least that's what I think."}, {"username": "Emma Whiting", "comment_text": "I flew with a different airline and they checked everyone's hand luggage, and a group who had bags that didn't fit were taken out of the line and not allowed on until it was sorted. You might be fine but you won't know until you get there!"}, {"username": "Susan Kuja Noll", "comment_text": "I flew them a few weeks ago. Thought I had a small enough bag, but they made me check it. They combined the weight of my backpack and suitcase."}, {"username": "Diana Acosta", "comment_text": "Flew Air France and they weighed my carry on and personal item together and then made me check in my carry on because both items together exceeded the weight limit. They were very strict."}, {"username": "Phyllis Snyder", "comment_text": "Heard they’re very strict!"}, {"username": "Jill Medrano Casey", "comment_text": "Possibly."}, {"username": "Jill Wolder", "comment_text": "Be prepared to check your bag."}]}, {"id": "2201145793617832", "text": "Recently returned home after an amazing two and a half weeks in Italy. Our itinerary was:\n\n1. Landed in Naples ——>drove to Matera in Basilicata, spent 3 nights there.\n\n2. Drove to Monopoli in Puglia, stopped in Alberobello for a half day visit on our way to Monopoli. Stayed 3 nights in Monopoli, spent lots of time on the beaches, did a day trip to Polignano a Mare.\n\n3. Drove to Praiano on the Amalfi Coast, stayed 4 nights in Praiano. Hiked the Path of Gods, visited Positano for a day, and ate at some excellent restaurants.\n\n4. Drove to Atrani on the Amalfi Coast, stayed 4 nights in Atrani. Took a ferry to Capri and did a two hour private boat tour around the island, visited nearby Amalfi and took a cooking class in Ravello. Also did a 2 hour sunset cruise one evening and an excellent 4 hour Amalfi Coast private boat tour.\n\n5. 2 nights with family in Naples and surrounding area.\n\n6. Return flight from Naples.\n\nThere were many memorable highlights from our trip. Our research and careful planning definitely paid off. Although there were a few mistakes we made for sure, I wouldn’t change a thing! (except renting a smaller car, my husband booked the car and he thought he was getting a great deal on a bigger car.)\n\nWe’ve both been to Italy several times. This was our first time in the southern areas.\n\nHappy to answer any questions about our itinerary!", "link": "facebook.com/groups/1373361046396315/permalink/2201145793617832/", "likes": 7, "comments": [{"username": "Renee Bruno-Arias", "comment_text": "What did you love about Praiano?"}, {"username": "Lin Tank", "comment_text": "How was the drive to Matera and then to Puglia? How was driving within Matera? We are debating car or public transportation.\nMy husband is concerned about finding parking within the city areas. I am concerned about the country roads."}, {"username": "Nancy Day", "comment_text": "Going to Italy in Spring\n(1st time)for at least 3 weeks..We are 3 senior ladies want to go to Matera and Alberobello from Sorrento on Day trip .Do you suggest doing an overnt there and than drive back or can we do it in one day.If overnt we will rent a car if day trip get a driver .Thinking a driver will he affordable if split 3 ways"}, {"username": "Sylvie Hogg Murphy", "comment_text": "That sounds absolutely wonderful!"}, {"username": "Kay Rendall", "comment_text": "Having stayed in all these areas. I dont think it is possible. Matera is magic, stay in a Cave hotel, at least 2 nights so much to explore. Was there 7 nights, lots stairs up and down cave hotels, cave restaurants, rock caves.\nAerebello is also magic with only hundreds of original truli houses left. Magic at night This area is not a day trip, specially from Sorrento. It is whole different part of Italy to experience, explore, learn about and savour"}, {"username": "Fiona Boys", "comment_text": "Any accomodation recommendations\nin Monopoli and Praiano?"}]}, {"id": "2201155040283574", "text": "Arriving Bari on Wednesday for a week with my daughters, then fly to Bologna before travelling down to Rome. From New Zealand, just wondering if the fires are going to effect out travel plans? So devastating for everyone over there😪", "link": "facebook.com/groups/1373361046396315/permalink/2201155040283574/", "likes": 0, "comments": [{"username": "Alice Francesca", "comment_text": "The fires are in Sicily."}, {"username": "Vanessa Mulquiney", "comment_text": "The fires are throughout the south like every summer, not only in Sicily but it’s particularly bad there and difficult to get under control because of the heavy wind. There are also big fires in Calabria and Sardinia. I have heard about fires in Puglia generally, but not Bari specifically (it’s most likely under control perhaps?). The only advice is to keep an eye on Italian news sites (with the translator on) or BBC etc if that’s easier (they get the news from Italian sources anyway). It’s an ever changing beast obviously, who knows what things will look like next week. I live in Rome and we’re thankfully untouched except for the stifling heat"}]}, {"id": "2201159240283154", "text": "Ηallo there, planning a short trip in Tuscany for May 2024. Starting from Florence and spending only one day there (Florence is a separate trip itself), we have four days for Tuscany. Any recommendations for places to visit?", "link": "facebook.com/groups/1373361046396315/permalink/2201159240283154/", "likes": 1, "comments": [{"username": "Whitney Meyers", "comment_text": "Montefollonico\nPienza\nMontepulciano"}, {"username": "Alice Francesca", "comment_text": "Absolutely!\nPienza,Montepul\nciano, Montalcino, Bagno Vignoni (hot natural spa waters at Posta Marcucci hotel)\nhttps://\nwww.italia.it/\nit/toscana/\ncosa-fare/\npienza-citta-ide\nale"}, {"username": "Alice Francesca", "comment_text": "Stay here: CHIOSTRO DI PIENZA.\nCHECK ON INSTAGRAM"}, {"username": "Alice Francesca", "comment_text": "Alice Francesca"}, {"username": "Alice Francesca", "comment_text": "Alice Francesca"}, {"username": "Alice Francesca", "comment_text": "Alice Francesca"}, {"username": "Alice Francesca", "comment_text": "Alice Francesca"}, {"username": "Carolyn Madl", "comment_text": "Hire Debora from her website, a bite of Tuscany, and also plan a cooking class at her home with husband chef Ryan! Very reasonable and fabulous people!\nDebora does many tours from cheese making to wine tasting and visiting many other places!"}, {"username": "La Cinzia", "comment_text": "Volterra!"}]}, {"id": "2201159316949813", "text": "Hi all, I’ve booked a trip to Venice in October, I’ve seen lots of posts on here about walking around with a backpack, for a man is a backpack suitable enough, or these over the cross body bags I’ve seen people mentioning.\nSuitable enough to carry things like a water bottle, snacks, passport, things like that.", "link": "facebook.com/groups/1373361046396315/permalink/2201159316949813/", "likes": 4, "comments": [{"username": "Lisa Valdovinos", "comment_text": "My husband used a crossbody bag and held a lot."}, {"username": "Tari Lawson", "comment_text": "I wouldn't trust a passport or money in a backpack. If you do, I would suggest the addition of a money belt to keep things safe."}, {"username": "Gianna Onesi", "comment_text": "Do you really need to carry a passport around? I am seeing different views"}, {"username": "Jenny Payne", "comment_text": "Crossbody bag definitely for documents, & packback for all the things you want to carry ( get one with a few zips) & u always but those tags on the zips or small locks 🌻"}]}]