[{"id": "2200232290375849", "text": "Ciao everyone!\nHas anybody stayed in ASSISI?\nAny tips about wineries with food ( lunch) in the area ( 30 minutes by car maximum)?\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2200232290375849/", "likes": 0, "comments": []}, {"id": "2200240520375026", "text": "Looking for accomodation recommendations in Verona for family of 5, 2 adults 3 teens. Will be there in December for one night.", "link": "facebook.com/groups/1373361046396315/permalink/2200240520375026/", "likes": 0, "comments": []}, {"id": "2200244983707913", "text": "Advice…. Has anyone ever stayed in either of these properties in Venice. Have whittled down to 2…….. first address is Hidden Gem in Venice and second is Hotel… Ca’Brigadine Carabba. Thank you xx", "link": "facebook.com/groups/1373361046396315/permalink/2200244983707913/", "likes": 0, "comments": []}, {"id": "2200243937041351", "text": "Currently in Sorrento and have been a little underwhelmed by our food so far…Any recommendations for some great pasta within walking distance of the city center?", "link": "facebook.com/groups/1373361046396315/permalink/2200243937041351/", "likes": 8, "comments": [{"username": "Janice Rea", "comment_text": "Z Antonio. Went to great place at Marina too."}, {"username": "Danielle Nicole", "comment_text": "Enjoy the little things bistro . Delicious food and wonderful owners. There may be a long wait but worth it\n\nhttps://\nwww.tripadvisor.\ncom/\nRestaurant_Revie\nw-g187782-d1939\n3924-Reviews-En\njoy_the_Little_\nThings_Bistrot-\nSorrento_Provin\nce_of_Naples_Ca\nmpania.html"}, {"username": "Kristin Bawden Larson", "comment_text": "The food was good, the service was wonderful, and the sunsets were unreal!\nIf you are up for a 20 min walk, or can get a taxi, we LOVED La Terrazza in San’Agnello- which is the next town over from Sorrento!\n\nhttps://\nmaps.app.goo.gl/\n2RyYGfApXW1UCFj1\n8?g_st=ic"}, {"username": "Nancy Brennan Carrow", "comment_text": "Tavern Allegra"}, {"username": "Marissa Mc Ardle", "comment_text": "Enjoy the little things Bistrot and the Taverna sorrentina both really good"}, {"username": "Sasha Childs", "comment_text": "The foreigners club is lovely"}, {"username": "Danielle Benvenisti", "comment_text": "Loved La Lanterna, Accento and Donna Sofia"}, {"username": "Dayna Steinberg Cioffi", "comment_text": "O’Parruchiano at La Favroita and Dona Sophia"}, {"username": "Aimee-Jane Weaving", "comment_text": "La Limonaia - fabulous restaurant, literally eating with the lemon trees! Even better with a fresh shot of limoncello at the end!"}, {"username": "Lisa Minichini-Dowty", "comment_text": "Well I do NOT\nRECOMMEND https://\nwww.google.com/\nsearch?q=O%27Par\nrucchiano+La+Fa\nvorita&ludocid=\n155758949557007\n25700&ibp=gwp%3\nB0%2C7&sa=X&ved\n=2ahUKEwj5kK7yw\na2AAxVnFFkFHVCa\nAkwQ_coHegQIGhA\nB&biw=320&bih=5\n01&dpr=3"}, {"username": "Valerie Collanton", "comment_text": "Had a great meal at da Gennaro Ristorante. It was a few years ago so hopefully it is still just as good. The restaurant il Buco was also really good."}, {"username": "Annette Eadie", "comment_text": "Annette Eadie"}, {"username": "Melanie Black Azar", "comment_text": "Il Buco was amazing, been a few years though."}, {"username": "Amanda Richards", "comment_text": "Go to places in back streets and that don’t have menu in English on display"}, {"username": "Julie Tran", "comment_text": "Cucu !"}, {"username": "Mary Anne", "comment_text": "A bit if a walk from Sorrento, but worth it. The terrace bar at the end of the street (Crawford) is good for a meal too, with amazing sunset views."}, {"username": "Meredith Holloway Helbon", "comment_text": "Following"}, {"username": "Deb Eastwood", "comment_text": "Has anybody hired a car and driven from milan to lake como and surrounds, if so, whats the drive like around t lake como, what's the parkung like"}, {"username": "Norma Kamhieh Alshehabi", "comment_text": "Tasso Sorrento - great atmosphere and fabulous food\nQui Sorrento"}, {"username": "Alisha Thornley", "comment_text": "Highly recommend Enjoy - our favourite repeat visit when we stayed in Sorrento recently ."}, {"username": "Victoria Brkić Amodio", "comment_text": "Thank you so much for all the wonderful recommendations\n! Trying to research them all to figure out where we’ll go for our remaining meals.\n\nLast night we had a fantastic meal at Ristorante da Filippo. It’s not super close to the city center, but they’ll send a shuttle to pick you up!"}, {"username": "Dana Curcic", "comment_text": "got to azz! best pasta and pizza of my life"}, {"username": "Cheryl Novis", "comment_text": "We had a good meal at Blu Water Sorrento"}, {"username": "Leonie Nossbaum", "comment_text": "We loved AZZ - went there a few times. It’s closed on a Sunday."}, {"username": "Kally Trahearn", "comment_text": "Try this place: La Cantinaccia del Popolo - my favourite place to eat in Sorrento. Nothing fancy, quite rustic and very popular with the locals. Hope you enjoy it"}, {"username": "Mary-Lynn Shapiro", "comment_text": "Da Franco Pizza for the win!!!"}, {"username": "Alice Francesca", "comment_text": "It s in Positano, on the beach.Family run restaurant for decades.\nLe tre sorelle."}, {"username": "Alice Francesca", "comment_text": "Don't want to hurt anybody's feelings, but I see many Americans ordering lasagna or pasta carbonara on the Amalfi Coast.We Italians have hundreds of typical disces that are best eaten from where they are originally (because we know they use the best, fresh ingredients they bought at the local market)\nSo, once and for all: lasagna is from Emilia Romagna, where Bologna is.\nPasta carbonara, cacio e pepe, from Rome .\nWhile in Amalfi try instead the rich local cuisine : mozzarella, tomatoes, seafood pasta, seafood dishes, pasta alla Nerano (zucchini and a very specific cheese called provolone del monaco).\nYou know how sensitive we are about food;), but please do just a little research♡"}, {"username": "Jules Galloway", "comment_text": "Torna a Suriento Trattoria. About a 10min walk uphill from the town centre but I promise you it’s worth it. One of the best meals I had in all of Italy, and the owner was lovely."}, {"username": "Judy Gagliano Demarco", "comment_text": "in Sorrento ristorante bagni Delfino"}, {"username": "Bianca D'Amore", "comment_text": "Donna Sofia was VERY good"}, {"username": "Natalie Parton", "comment_text": "Fauno bar pasta was amazing"}, {"username": "Laura Uribe", "comment_text": "I think that the overwhelming number of tourists and finding employees have really hurt the restaurant industry. We spent two months last fall and most places were only okay. I will say, the second best Carbonara I’ve ever had in my life was at a little cafe that most people just walked past. It ended up being a great locals spot. Get off the main drag and ask where the locals eat."}, {"username": "Alison Harris", "comment_text": "Foreigners is awesome"}, {"username": "Lindsey Dingman", "comment_text": "Aurora! Best lasagna I’ve ever had!!"}, {"username": "Stephanie Evans", "comment_text": "If you want an amazing view check out the Foreigners club! The food was good too….not my favorite of the trip but we ate there 2 days in a row lol!"}, {"username": "Matthew Cawley", "comment_text": "Cant think the name of it now but best meal of pur whole holiday (but pricey) was in Sorrento\n\nThe place had a greenhouse type setting/vibe and was down the lanes/alleyways"}, {"username": "Anita Clayton", "comment_text": "I agree go where the locals eat, it has always been hit and miss but over the last few years with the increase in both tourists and restaurants I feel the quality has gone down especially with pasta."}, {"username": "Renee Rundle Stoneham", "comment_text": "Caruso’s one of the best meals we had.\n\nApertivo at Foreigner’s club, great view at sunset.\n\nhttps://\nwww.ristorantemu\nseocaruso.com/"}, {"username": "Diane Loutfi", "comment_text": "L’Antica Trattoria. And of course Delfins in the Marina!!!"}, {"username": "Dana Talusani", "comment_text": "You definitely have to reserve because the restaurant is tiny, but the best meal we had in Sorrento by FAR was at La Cucina Del Gusto. Chef Carmen is an absolute gem and the food was very good value for such inredible food. Chef Carmen also teaches cooking classes, if you are interested."}, {"username": "Marie Cuzzi", "comment_text": "Get of the Main Streets tourist traps eat where the locals eat"}, {"username": "José Marina", "comment_text": "mandami la tua data di nascita e ti dirò cosa vedono gli angeli nella tua vita amorosa❤️🇮🇹"}, {"username": "Andrea Mankin Taalman", "comment_text": "I would love to know the places that weren’t the greatest so I avoid those!"}, {"username": "Cheryl Evers Glass", "comment_text": "Tavern Allegro. Couldn’t get in for dinner. Had a wonderful delicious lunch there."}, {"username": "Rose Perez Swartz", "comment_text": "Try Azzi Taverna there is normally a line but the food is so worth is."}]}, {"id": "2200247483707663", "text": "Hi. What is the easiest route from Verona to Rome please..with 2 children.", "link": "facebook.com/groups/1373361046396315/permalink/2200247483707663/", "likes": 1, "comments": [{"username": "Giovanni Pianigiani", "comment_text": "Have you checked by bus? https://\nglobal.flixbus.c\nom/"}, {"username": "Denise Digatono Lomauro", "comment_text": "Look at the Rome2Rio app or website"}, {"username": "Peach Panfili", "comment_text": "Train."}, {"username": "Ruth Akutu Maccarthy", "comment_text": "Train from Verona di Milan then from Milano to Rome"}, {"username": "Karen Schmidt", "comment_text": "Train is super easy!"}]}, {"id": "2200247923707619", "text": "Hi everybody!\nCan you please inform me about the cost from Naples’s airport to the center?\nAre there taxi at the airport or private transfer?\nThank you 😊", "link": "facebook.com/groups/1373361046396315/permalink/2200247923707619/", "likes": 0, "comments": [{"username": "Dave Conroy", "comment_text": "The Ali bus goes direct to the central station in the city centre and also somewhere near the ferry terminals. There are taxis (careful of scams) and fixed price taxis and private transfers that you can book in advance. Check the airport website."}, {"username": "Miyuki Kanno Paul", "comment_text": "€25 taxi"}, {"username": "Diane Davis Lawyer", "comment_text": "Has anyone flown into Naples recently? Wondering how long the wait is getting through customs (if that even happens coming in) and getting your bags after getting off the plane? I'm trying to plan things but have no idea how long this part is going to take us! We will be there mid-September! Thanks!"}]}, {"id": "2200249137040831", "text": "We are flying British Airlines from Newark to Naples next May. Will we go through customs in Naples or on our layover? Thank you.\nWhen we flew Icelandic airlines, we went through customs at the layover. The weather caused us to depart late and they rushed everything so we would make the next flight.", "link": "facebook.com/groups/1373361046396315/permalink/2200249137040831/", "likes": 0, "comments": []}, {"id": "2200255073706904", "text": "Has someone from this page stayed and visited San Marino please ?", "link": "facebook.com/groups/1373361046396315/permalink/2200255073706904/", "likes": 1, "comments": [{"username": "Huong Worley", "comment_text": "We went to San Marino for the day from Bologna. It was beautiful and totally doable for a day."}, {"username": "Ken Lerch", "comment_text": "Yes."}, {"username": "Geraldine Caggiano", "comment_text": "It’s beautiful! You should visit."}]}, {"id": "2200259030373175", "text": "Has anyone been to Perugia? Were going to San Feliciano, near Lake Trasimeno. Recommendations? Thank you :-)", "link": "facebook.com/groups/1373361046396315/permalink/2200259030373175/", "likes": 0, "comments": [{"username": "Benedetta Vanni", "comment_text": "The area of Lago Trasimeno is great for hiking on the surrounding hills ( https://\nwww.sharry.land/\nit/homepage )\nRomantic dinner on the shores of the lake is a must (Castiglione del Lago and Passignano are two lovely small towns over there)."}, {"username": "Antonio Aloè", "comment_text": "Perugia is beautiful like all Umbria.Go to Assisi,Orvieto,\nSpoleto,Gubbio,\nTodi,Bevagna,Mo\nntefalco etc..."}, {"username": "Scott Perry", "comment_text": "Dempsey's for cocktails in Perugia!"}]}, {"id": "2200275963704815", "text": "Do you need an international driving permit to rent a car in Italy?", "link": "facebook.com/groups/1373361046396315/permalink/2200275963704815/", "likes": 19, "comments": [{"username": "Brian Johnson", "comment_text": "Last time I went I did not have one. Rental company kinda blustered about it a bit but then rented me the car anyway."}, {"username": "Rosaria Bishop", "comment_text": "Cindy Rittenberry"}, {"username": "Steven Fletcher", "comment_text": "Better to be safe than sorry. It’s only 20 dollars on AAA"}, {"username": "Christine Sanci-Gentile", "comment_text": "Yes! Rental car company asked for it first thing."}, {"username": "Christopher Levon", "comment_text": "AAA check it out"}, {"username": "Jenn Smith", "comment_text": "Yes! When we picked up our rental we saw a couple get turned away from their reservation because they didn't have one. Also it's super easy, quick and cheap to get one."}, {"username": "Ted Larson", "comment_text": "The answer is no and yes.\nWhile it’s possible to rent the car you wouldn’t have any insurance.\n\nThe rental company doesn’t care because your liable for damage no matter what."}, {"username": "Jennifer Holbert", "comment_text": "AAA can hook you up for about $20."}, {"username": "Miyuki Kanno Paul", "comment_text": "Yes! Go to AAA"}, {"username": "Perry Locke", "comment_text": "Not this again!"}, {"username": "Suprit Roy", "comment_text": "An IDP is a certified translation of your actual license.\nLocal governments can be fussy if your license is not in a language used locally.\nBest to carry one in case you are stopped by a cranky policeman!"}, {"username": "Susan Dillon-Centofanti", "comment_text": "Better to get one. Why take the chance, not expensive."}, {"username": "Kai Wilhelm Tell", "comment_text": "O my god…"}, {"username": "Steven R Perusse", "comment_text": "If you don't get an international DL the car rental company will charge you more money for insurance, that happened to my son."}, {"username": "Eliazar Putera", "comment_text": "No"}, {"username": "Chris Musch", "comment_text": "A permit is the least of your problem, it’s knowing how to drive like a local and constantly pushing the horn."}, {"username": "Jenny Larsen", "comment_text": "The rental company will want to see one"}, {"username": "Rob Nichols", "comment_text": "I got one from AAA for about $40 bucks, but it was never checked by anyone. Not even the car rental place."}, {"username": "Joe Guzzi", "comment_text": "Only if you are not from the EU/EFTA"}, {"username": "David Horgen", "comment_text": "If you're not sure, just go ahead and get one. Took me about 5 minutes at AAA"}, {"username": "Phyllis Snyder", "comment_text": "Yes"}, {"username": "Al Filizetti", "comment_text": "Not sure , but I got one anyway. I got it through AAA for less then $30 good for a year."}, {"username": "Christina Dunbar", "comment_text": "We were asked for it from rental company"}, {"username": "Jorge Manuel Goncalves Gomes", "comment_text": "Yes. But if you don't have it it is not a problem."}, {"username": "Julie Koenig Cooper", "comment_text": "Our travel agent told us we need to. It’s only $30"}, {"username": "Mike Adams", "comment_text": "No but you need one to DRIVE THAT RENTAL."}, {"username": "Sandy Radican Shikaly", "comment_text": "Sandy Radican Shikaly"}, {"username": "Sandy Radican Shikaly", "comment_text": "Sandy Radican Shikaly"}, {"username": "Michael Widjaja", "comment_text": "Yes"}, {"username": "Brooke Summerville", "comment_text": "Where are you coming from?"}, {"username": "Michael EIkady", "comment_text": "AAA with a photo and like $50 for a year"}, {"username": "Sandra Cran", "comment_text": "My question is...how easy is it to drive in italy. Are there lots of crazy drivers. No disrespect intended"}, {"username": "Morgan Keller", "comment_text": "I had to show mine when I rented our car."}, {"username": "Carolyn Hassarati", "comment_text": "No we are here and No"}, {"username": "Hunter Hughes", "comment_text": "Yes"}, {"username": "Dan Fulton", "comment_text": "$20 plus $6 for the two required photos at AAA, valid for 1 year from the date you identify your trip starts. I got mine from AAA in May but good for 1 year from Sep 1 2023."}, {"username": "Tommo Thomson", "comment_text": "Around 50 bucks do it on line and get it emailed to yourself"}, {"username": "Shelley Howard", "comment_text": "you do i am required to for my rental car .. its in my booking .. but some don't bother.. for the few dollars they cost I don't see why people don't.."}, {"username": "Claude Gagnon", "comment_text": "For the little price it will cost you, you should have one in case."}, {"username": "Lina Stump", "comment_text": "Si certo"}, {"username": "Joseph DellaFave", "comment_text": "No. 7 trips over and renting every time never had one."}, {"username": "Charlene Lanser Kosegi", "comment_text": "No"}, {"username": "Enrico Lecce", "comment_text": "No"}, {"username": "Enrico Lecce", "comment_text": "I wasn't ask for an international license when I rented a car in italy"}, {"username": "Brian Osman", "comment_text": "Google! You will see you need one."}, {"username": "Dan Wentarmini", "comment_text": "Yes, rented cars twice in Italy had to show international permit both times."}, {"username": "Tony Broad", "comment_text": "Yes,got done for illegal parking it was the first thing the police asked for"}, {"username": "Abbey Wood", "comment_text": "Not really, you just need an European passport and any driving license"}, {"username": "Mary Palazzolo", "comment_text": "Yes $20at AAA"}, {"username": "Rodger Cravens", "comment_text": "Do you need a license to drive in the US? Only if you get caught...\n\nSame with this, you need it when you need it - you had better have it when you need it...\n\nIt's fast, cheap and easy. Why not get it?"}, {"username": "Brent Sportsman", "comment_text": "We rented a car with hertz and all they asked for was US drivers license. No issues!"}, {"username": "Linda Miller", "comment_text": "Yes"}, {"username": "Randy Webb", "comment_text": "Triple A will provide the license you need, we took 23 people to Italy January 2019, every couple had a car rental but all most every couple got a $400.00 ticket sent to them a month after they arrived back from vacation.. the ticket was for driving in a neighborhood that didn’t allow traffic.. you will regret driving is my opinion.. sounds wonderful but it was a nightmare, we drove from Milan To Florence…. Once in Florence our group took the train to Rome, Venice and other stops instead of driving. the train system is so good you can go anywhere you want by train.. we are returning to Rome and Naples January 2024 but will never drive in Italy again."}, {"username": "Sal Priorello", "comment_text": "No. Just rented a car there last month."}, {"username": "Nancy Incorvaia Mullin", "comment_text": "Yes. $20 with AAA and it’s good for a year. Better be safe then sorry"}, {"username": "Robert Delmond", "comment_text": "Yes indeed!!!"}, {"username": "Roslyn Tidmarsh", "comment_text": "If you have an accident over there your insurance covers with an international license"}, {"username": "Frank Hunt", "comment_text": "Yes, if you want you insurance cover to be valid. Your choice, your risk."}, {"username": "Frank Hunt", "comment_text": "Yes"}, {"username": "Rosaria Bishop", "comment_text": "Yes you do! You may never have to show it but it’s better to be safe than sorry"}, {"username": "Stephen Dawson", "comment_text": "some rental car companies will rent without some required it\nHowever you need one or a certified translation of your drivers lic to comply with Italian law fines range from 80 to 300 euro if your stopped\n\npolice may of course use there discretion\n\nyour insurance may also be impacted"}, {"username": "Sandra Shoffner", "comment_text": "Yes,read driving in Italy."}, {"username": "Rick Calabro", "comment_text": "Did not have\nOne in November and was not asked to have one"}, {"username": "Robert Atkinson", "comment_text": "Technically yes. But likely won’t be asked to show it (unless you are pulled over or have a vehicle stolen or damaged)"}, {"username": "Paul Vincent", "comment_text": "Always recommended.."}, {"username": "Edward Tacchi", "comment_text": "If you have a valid driver’s license in the USA, you are good to drive in Europe for up to 90 days. I had no issues renting a car and drove thru many European countries for nearly a month."}, {"username": "Chantal Campeau", "comment_text": "Yes you do!"}, {"username": "Sarit Rolnik", "comment_text": "If you get stopped by a policeman you will need to show him your international license,so yes you need one 👍😊"}, {"username": "Robin Barbera", "comment_text": "Yes and you need it in case you get stopped"}, {"username": "Ian Maximillian Spatz", "comment_text": "Yes"}, {"username": "Elaine King", "comment_text": "Yes"}, {"username": "Leonardo Solorzano", "comment_text": "Yes"}, {"username": "Marshenjew Benji", "comment_text": "Yes I just got back and rented from Budget rental car, my advice is don't if you can avoid it"}, {"username": "Brian Harrison", "comment_text": "Just came back and I was asked for international drivers license when I rent the car."}, {"username": "Harris Dee", "comment_text": "Yes but no"}, {"username": "Praxedes Cotrina", "comment_text": "NO!\nYou don’t!\nI just left"}, {"username": "Antonello La Ferrara", "comment_text": "Yes if you come from outside the EU"}, {"username": "Maria C Sapien", "comment_text": "No"}, {"username": "Anil Shah", "comment_text": "Yes. Very easy to obtain one at AAA."}, {"username": "José Marina", "comment_text": "mandami la tua data di nascita e ti dirò cosa vedono gli angeli nella tua vita amorosa❤️🇮🇹"}, {"username": "Connie Iacozza Brazzoni", "comment_text": "Yes"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2200261850372893", "text": "Venice, Italy", "link": "facebook.com/groups/1373361046396315/permalink/2200261850372893/", "likes": 2, "comments": []}, {"id": "2200276683704743", "text": "Monterosso train station #reels #reelsinstagram #instagram #trending #viral #explore #love #instagood #explorepage #reelitfeelit #follow #photography #fyp #reel #instadaily #reelsvideo #like #आणखीmemes #foryou #music #facebookreels #facebook #facebookviral #reelsviral #reelsviralvideo #reelstrending #trendingnow #reelstrendingvideo #facebookpost #riomaggiore #monterossoalmare #manarola #corniglia #vernazza #cinqueterre #laspezia #reels2023 #ristoranteilgabbiano #paanokumitasafacebookreels #facebookreelssahod #facebookreelsearnings #metaverified #metaverifiedaccount #facebookreelsmonitization #facebookreel #fbreels #facebookreelssettings #facebookreelsincome #facebookreelsplaybonusprogram #facebookreelsvideo #facebookreelseligibility #facebookreelsviral #facebookreelspayout #facebookverified #bonassola #levanto #adsonreelsfacebook #adsonfacebookreels #adsonreelsmonetization #monterossobeach #monterosso", "link": "facebook.com/groups/1373361046396315/permalink/2200276683704743/", "likes": 1, "comments": []}, {"id": "2200284223703989", "text": "HI, my boyfriend and I are planning a trip the first week of September to south Italy flying into Rome from New York and staying for 7 days. I’d like to see the Tuscany region and Amalfi Coast or Sicily (undecided as to which yet). Just wondering if anyone has any recommendations as to where to stay in Rome, Tuscany and/or things to do? Also, any advise as to which would be better Amalfi or Sicily? Thinking of only staying in Rome for 1 night.", "link": "facebook.com/groups/1373361046396315/permalink/2200284223703989/", "likes": 0, "comments": []}, {"id": "2200289410370137", "text": "Hi everyone. I’m from Canada. When travelling to Italy is it best to purchase a SIM card there rather than adding a travel package to your phone before leaving? If so, where can you purchase?", "link": "facebook.com/groups/1373361046396315/permalink/2200289410370137/", "likes": 1, "comments": [{"username": "Julie Brouillette", "comment_text": "Canadian here. Buy an esim card at the airport when you arrive. We use Vodafone. Usually around 15€ for 35 gig. You can Hotspot other phones to it. I suggest taking an old cell with no apps installed. Battery will last all day. If you need to contact anyone at home use What's app"}]}, {"id": "2200289750370103", "text": "Best way to book tickets to Milan Duomo including rooftop please.", "link": "facebook.com/groups/1373361046396315/permalink/2200289750370103/", "likes": 0, "comments": []}, {"id": "2200290400370038", "text": "Our Travel agent is saying if we want to see Florence we need to fly there then Rome and then Sorrento and fly out of Naples? Is this right? We ditched Sicily but trying to figure out what are the must sees in Florence and is Venice a must see? This will\nMost likely be my only trip to Italy but not keen on hotel hoping every few days. Or do I just need to get over it? My son wants to see the ruins, I want a vineyard and the beach 😀", "link": "facebook.com/groups/1373361046396315/permalink/2200290400370038/", "likes": 8, "comments": [{"username": "Mindy Marshall Lavin", "comment_text": "It depends on where you are coming from. I think you need to connect from somewhere else in Europe to fly to Florence. Rome Milan Venice more accessible for direct flights"}, {"username": "Achim Marke", "comment_text": "Venice got a beach Florence not"}, {"username": "Lucrezia Folger", "comment_text": "All these places your asking if they are a “must see”, please read a little about them so you know the answer. So much to just easily google. These places are like no other on earth, they are one of a kind. Your travel agent is trying to get you from one direction to the next without back tracking, but fly in and out of where ever you like."}, {"username": "Philippa Tony", "comment_text": "Go on a cruise"}, {"username": "Phyllis Snyder", "comment_text": "How many days are you in Italy?"}, {"username": "Phyllis Snyder", "comment_text": "Might skip Sorrento- flying into Rome train to Florence fly out of Venice. If Sorrento is a must a little backtracking is involved."}, {"username": "Elisa Bernstein Wolfe", "comment_text": "We flew into Naples and spent 3 nights in Sorrento, then took the train to Florence for 2 nights, then took the train to Rome for 3 nights and flew home from Rome. It did mean we went a little out of our way in the middle. I can't really remember why our travel agent decided to set it up that way, but I did like the idea of flying out of Rome because I felt it had more flights out if one got cancelled or delayed. We wanted to fly direct to Italy from NY/NJ so she was also working with that."}, {"username": "Renee Rundle Stoneham", "comment_text": "You don’t “need” to do that, with that said you won’t back track in your schedule doing it that way.\n\nFlorence is more $$$ to fly into and most flights will have a connection in Rome anyway.\n\nI’d it this way:\n*Fly into Rome stay a few days there.\n*Train to Florence stay a few days there.\n*Train to Sorrento (or Naples then ferry or car to Sorrento) stay a few days. Pompeii is an easy day trip from Sorrento on the local train.\n*last night in Naples then fly home from there.\n\nOf course you can easily do this as a RT from Rome. We did almost this same itinerary with RT Rome. We stayed in San Gimignano and saw more of Tuscany with a day trip to Florence.\n\nRT flight from Rome will most likely be your cheapest option."}, {"username": "Brian McGraw", "comment_text": "Your travel agent is telling you that because it makes the most sense geographically.\n\n\nWe found that the flight was direct, and cheaper if we fly to Rome.\n\nHigh speed trains are fast in Italy.\nRome to Florence in 1:33. €34\nFlorence to Naples in 3:13 €52\n\nVenice is worth seeing, but unless you want to hotel hop, you may not have time for it"}, {"username": "Dann Hrusch", "comment_text": "Just a consideration - but into Florence and out of Naples might be logistically optimal but flying out of Rome might be half the cost is you don't mind backtracking a little. That said, you will want to hotel hop. Pick your entry and exit cities and take trains from city to city figuring for about 3'ish hours for travel between each."}, {"username": "Julie Griffin Smith", "comment_text": "We are flying into Milan, immediately training up to Como for 3 nights then back down to Florence for 3 nights, then to Sorrento for 5 nights then up to Rome for 2 nights then back to the USA. We have multiple day trips and tours at each place."}, {"username": "Julie Romeo Strohl", "comment_text": "We fly into Rome, train to Florence, train to naples, stay in Sorrento, fly out Naples, over 10 days"}, {"username": "Laurie Ladouceur Schmitt", "comment_text": "We are flying into Rome, then train to Florence, then train to Sorento. And flying home out of Naples"}, {"username": "Susi Kunz", "comment_text": "We fly into Naples, visit Amalfi Coast and then head to my Grandparents villages then onto Florence and Rome and depart back to US from Rome"}, {"username": "Jo Ann Perrotta Solimando", "comment_text": "Fast train from Florence to Venice. Yes it is worth seeing. Easy to get there and back. Easy ride to Tuscany from Florence also… we hired a driver. Pretty ride."}, {"username": "Starla Dawn", "comment_text": "I loved basing out of Sorrento had a beach day a boat day and a trip to the Amalfi Coast and ruins day."}, {"username": "Madeline Caporale", "comment_text": "Have not checked flight prices but may be that flight to Florence is less than to Rome (I believe smaller airport). I believe many cruise lines have persons fly into/out of Rome and then transfer to the port at Civitavecchia. From Florence it is an easy train ride to Rome. From Rome can also get a train to Sorrento. From Sorrento it is a shorter distance to Naples than to return to Rome. Again, a flight out of Naples may be less costly and easier than from Rome."}, {"username": "Stephanie Evans", "comment_text": "We did Rome, Florence then Sorrento and flew out of Naples home"}, {"username": "Barbara Bastianini", "comment_text": "The Florence airport is a smaller one. I think you’d find many more options for direct flights to either Milan or Rome so I’d consider those options as well. Of course that depends on where you’re flying from and what season you’re flying. ( I strongly prefer to fly direct rather than be faced with connections so Florence would probably not be my choice for that reason alone. Once time I did fly to NYC from Florence but had to connect in Milan.)\n\nKeep in mind that there are usually several different ways to travel. Which is why I prefer to plan independently instead of using a travel agent. I know what’s best for myself. Maybe the travel agent doesn’t want to take the time to research each possibility. But another option would be to fly round trip to Rome and make a circuit of the cities you plan to visit. Or to fly into Milan then go in order to Florence, Rome snd Sorrento flying back from Naples or going back to Rome to fly out. There are several possibilities. i’d research all the options and decide which best suit my needs. Remember that you can usually plan your ground itinerary around almost any international flight arrangements.\n\nAnd as far as “must sees” anywhere only you can know what is a must see for you. It really depends on your personal interests and preferences. You might want to read a few travel guides to get a feel about what attractions appeal to you."}, {"username": "Debbie Potter", "comment_text": "That's why I don't go through a travel agent. It seems like they plan it how they think would be best for you. Do it your way and how you wanna do it... ditch the travel agent."}, {"username": "Sandra Monacelli McNall", "comment_text": "I am giving up o. Florence as we just don’t have enough time . Flying to Rome, the. Naples, the. Amalfi coast"}, {"username": "Tari Lawson", "comment_text": "How long will you be there? I think if it's your only trip, Venice should be on it."}, {"username": "Dennis Jones", "comment_text": "We flew into Venice, then to Florence, Rome, and Sorrento…flew out of Naples."}, {"username": "Mike Drelicharz", "comment_text": "Rome - Florence - Venice. Ruins in Rome, vineyards near Florence & beaches near Venice. Plus all sorts of great other stuff in those 3 places."}, {"username": "Monique Swanner", "comment_text": "No! Take the train. Cheaper to fly into Rome"}, {"username": "Michèle Nardelli", "comment_text": "Don’t discount returning to Italy - I went for a month and still feel as though I missed so much. Trains are pretty easy if you travel with light luggage (I was alone and managed ok). Easiest to fly into Rome - you can take trains to Venice, Florence, Milano, Naples all only a few hours. My best advice is work out what you really want to see - do research -and work around that. And then plan to go back some day and do the rest 😊"}, {"username": "Fiona Cameron", "comment_text": "How long have you got in Italy ?\nYou can get a high speed train from Rome to Florence in about 2 hrs"}, {"username": "Francoise Coupal", "comment_text": "If you’re able to, you can easily take the trains. It is absurd to think that you have to fly to every city. Ditch this travel agent, horrible advice."}, {"username": "Nancy Koval", "comment_text": "No. Fly to Rome or Milan. Whatever is cheaper. And then take the trains."}, {"username": "AnnaMarie Izzo Zoghby", "comment_text": "We flew into Rome, stayed a week and then took the train to Florence"}, {"username": "James-Kathy Dickerson", "comment_text": "Use the trains save money and they are fast... train Florence to Rome, we have taken the train between Rome and naples twice so glad we did. ...bonus beautiful country side. In naples schedule a day tour to Sorrento and if you have time go to Pompei not far from Naples or take a ferry to Capri if you will be in naples a few days. Have fun!"}, {"username": "Karen Bowman", "comment_text": "How much time do you have? We are flying in to Venice, 3 nights, then on to Florence, for 2, Tuscany 4, sorrento 3, Positano 2 and back to Rome for 4 then fly home from there. 3 weeks.\n\nIf less than that and those are the places you want to see yes that makes sense."}, {"username": "Diane Plott Miller", "comment_text": "When I was looking for flights it was cheaper to fly into Rome than the other cities."}, {"username": "Courtney Soloff England", "comment_text": "I’m flying in / out of Rome but starting in Florence 🙂"}, {"username": "Shawna Mcdonald Sapp", "comment_text": "We are flying into Rome, going to Florence and flying out of Venice."}, {"username": "Lisa Valdovinos", "comment_text": "We started in Rome, 4 days, Sorrento, 3 days with day trip to Capri, Florence, 4 days, and then Venice for two days. Was perfect!"}, {"username": "Teresa Chiovaro Cowley", "comment_text": "Fly into Rome, Trains are great and high speed. Don't skip Lake Como!"}, {"username": "Roxanne Patti", "comment_text": "I think your agent is saying that to avoid you backtracking. However, the train between Rome and Florence is easy and fast. From the US, the air RT from Rome is significantly cheaper anytime I check than flying in one city and out another. For me, Rome was always much cheaper than RT any other major city. 🤷‍♀️ The logistics of Rome to Naples/\nSorrento and back is more time consuming. So I’d check prices of flying into Naples and out of Rome - not worrying about the short train ride to do Florence. If your interest is ruins and beach, then maybe Venice isn’t a “must”.🤷‍♀️"}, {"username": "Kathy Flood", "comment_text": "In Naples book a day with https://\nwww.facebook.com\n/taxitournapoli. He will take you to Pompeii and Herculaneum, Pompeii - but after that he will take you to a winery! We did this earlier in the month and it was fantastic. He even arranged a guide for Pompeii and Herculaneum - which is really recommended!! Enjoy."}, {"username": "Alicia Cox", "comment_text": "How long is your trip?"}, {"username": "Nancy Day", "comment_text": "We are planning at keast 3 wks next spring, Sicily is in our plans.You can fly fr Florence to Sicily ,inexpensive ."}, {"username": "Alicia Cox", "comment_text": "I would see Rome for sure.\nI would stay outside Florence & see Florence & try to see a few towns in Tuscany - maybe stay in one. Don’t remember distances (& will you have a car) but towns we visited & just loved - Lucca, Siena, Volterre, San giamignano.\nSorrento is gorgeous & you could also see Capri from there &/or positano/\nAmalfi (but do those by boat or personal driver out of Sorrento). You could do highlights of Florence in a day if u want more time in small towns. Tuscany is my favorite!\nVenice is kind of a must see although it’s not my favorite. That said I love Murano & burano via water taxi out of Venice. So just not sure how ur time is but I would stay in one place at least 3 days & maybe do some day trips.\nTuscany requires a car. So that may also determine what u can do"}, {"username": "Meredith Sclafani Lacerda", "comment_text": "We had planned Boston to Sicily (stuck in Paris due to strike) so flew from Paris to Venice, train from Venice to Florence, train from Florence to Rome, train from Rome to Naples (Sorrento/\nPositano area), train from Naples to Rome and Flying home from Rome to Boston. Definitely a lot of moving around but we planned to start vacation with a beach and end vacation with a beach and all of the sites in between!!"}, {"username": "Jessica Stewart", "comment_text": "We’re flying into Rome and out of Rome but traveling by train to our destinations."}, {"username": "Pam Kimak", "comment_text": "We flew into Rome and spent 3 days there ..Hotel Concordia..cent\nrally located. We took a beautiful train down to Naples..nice scenery it was and J&J Transfer again to Maiori...across\nfrom Tyranian Sea beach/ boardwalk. We stayed at Hotel Panorama,( very pleased) and there are others there as well.Both hotels were rooftop breakfasts included. Flew out of Naples to Newark, NJ."}, {"username": "Shelly Frick Brunnenkant", "comment_text": "We are flying into Rome and out of Venice\n3 nights Rome\n4 nights Tuscany (opted for some relaxation rather then Florence we will go for a day)\n3 nights near Genoa ( family from there so want to see where grandparents were from)\n3 nights Venice\nWe have a car when we leave Rome until we get to Venice."}, {"username": "Erin Bromfield McQuay", "comment_text": "We flew into Rome and did day trips to Florence and Sorrento by train."}, {"username": "Lisa Adams Robertson", "comment_text": "Venice is such a unique place, and with rising seas, its days may be numbered. That said, only you can decide what interests you. Italy draws you back and we have our third trip coming up, and we'll make it to Venice this time. Our first trip was a tour of Sicily and it was incredible. We flew into Rome, spent a few days there (a MUST on my bucket list), then flew to Palermo to start the tour.\n\nTry not to stress too much, wherever you go will be wonderful, and you'll likely go back to see more. Just try not to go during the hottest months if you avoid it."}]}, {"id": "2200291507036594", "text": "If you are flying in/out of Milan and need a place to stay near airport, let me suggest La Casetta Malpensa. It is a bed and breakfast and is so well done and comfortable. There is an airport shuttle but a taxi is $15-$20.", "link": "facebook.com/groups/1373361046396315/permalink/2200291507036594/", "likes": 0, "comments": []}, {"id": "2200297400369338", "text": "Has anyone had that “once in a lifetime” memorable Airbnb find in Italy?\n\nLet’s share!", "link": "facebook.com/groups/1373361046396315/permalink/2200297400369338/", "likes": 0, "comments": []}, {"id": "2200299650369113", "text": "Hi,\nHas anyone done a cooking class in san Gimigiano or Bologna? Looking for any recommendations. Or anything we must visit while in these areas. Wineries that have a cooking class?\n\nThanks everyone! You are great help!", "link": "facebook.com/groups/1373361046396315/permalink/2200299650369113/", "likes": 0, "comments": []}, {"id": "2200318997033845", "text": "Can anyone recommend any hotels in ortisei for a family of 5. No car. TIA", "link": "facebook.com/groups/1373361046396315/permalink/2200318997033845/", "likes": 0, "comments": []}, {"id": "2200302933702118", "text": "I have been trying to find, download ferry schedule Lake Como. Como/Bellagio. However having problems. Will be there 3/8 so help.please. Grazie", "link": "facebook.com/groups/1373361046396315/permalink/2200302933702118/", "likes": 0, "comments": []}, {"id": "2200310550368023", "text": "SIM card\n\nHas anyone ever bought a SIM CARD from Amazon to use for travelling in Italy ?!?\n\nThank you ☺️🙏🏼", "link": "facebook.com/groups/1373361046396315/permalink/2200310550368023/", "likes": 0, "comments": []}, {"id": "2200321277033617", "text": "In Bari with friends...", "link": "facebook.com/groups/1373361046396315/permalink/2200321277033617/", "likes": 13, "comments": []}, {"id": "2200324200366658", "text": "Hi what esims are people using?", "link": "facebook.com/groups/1373361046396315/permalink/2200324200366658/", "likes": 0, "comments": []}, {"id": "2200333770365701", "text": "Looking for recommendations for a pasta making class for Rome or Lake Como. We had one scheduled and it was just canceled. Thanks so much!", "link": "facebook.com/groups/1373361046396315/permalink/2200333770365701/", "likes": 0, "comments": [{"username": "Stacy Prestigiacomo", "comment_text": "We did this one through air bnb a few weeks ago it was great . Small town outside Rome took a 20 min train ride"}]}, {"id": "2200329690366109", "text": "I having been checking temps in Como, Bologna, as I will be there. Seems at moment 27 degrees is Max. Has the heatwave passed by.\nWas expecting temps mid 30's plus. Has the weather changed. Anyone there now.", "link": "facebook.com/groups/1373361046396315/permalink/2200329690366109/", "likes": 2, "comments": [{"username": "Cecilia Christine Costantini", "comment_text": "It is changing, some rain and storms in the north. Slighly cooler in Rome."}, {"username": "Pietro Adami", "comment_text": "Looks like it is over, at the moment, at least in the north"}, {"username": "Brenno Bianchi", "comment_text": "Yesterday in Milan there was a very strong storm that did a lot of damage and knocked down trees in the avenues. The circulation of public transport in the city has not yet returned to normal because several sections of the electric cables of the cablecars have been torn down."}, {"username": "Alice Francesca", "comment_text": "Yes, much better now"}, {"username": "Sonal Parekh", "comment_text": "Yes we are leaving Florence now and then yesterday and today so far have been great temperature wise!!!!! Believe it was in the 70s the last two mornings."}]}, {"id": "2200336047032140", "text": "#DeliciousFood #goodfood #lambchops #meat #agneau #venice #italy #bestrestaurants #Trattoria Al Gazzettino #Gazzettino #italianfood #italie #Venise #travel #beautiful #goodprice #reels", "link": "facebook.com/groups/1373361046396315/permalink/2200336047032140/", "likes": 0, "comments": []}, {"id": "2200336363698775", "text": "Hi all,\n\nLooking for a restaurant recommendation for Sorrento/S. Agnello area that is suitable for a group of 16, moderately priced food and hopefully with a wonderful view!\n\nNot going until September so will be booking in advance due to group size :)\n\nThank you! 🍕🍝🍷", "link": "facebook.com/groups/1373361046396315/permalink/2200336363698775/", "likes": 0, "comments": []}, {"id": "2200338523698559", "text": "There are 6 of us taking a trip to Italy in early October. We will be staying in Tuscany/Florence for 3 days and need recommendations on renting a van/SUV so we can all ride together while visiting some of the small towns and wineries. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2200338523698559/", "likes": 0, "comments": []}, {"id": "2200341537031591", "text": "Maybe this is a dumb question, but how accessible are taxis in the Florence/Tuscany area?\nMy daughter and I will be there in September and I’m looking at beautiful Airbnb’s that are outside of Florence in the countryside. We are not renting a car however, so I am wondering if we would kick ourselves for being outside o￼f Florence when we have a few tours booked in the heart of the city. We just really want to stay in the countryside but will that be too difficult if we are not renting a car?", "link": "facebook.com/groups/1373361046396315/permalink/2200341537031591/", "likes": 3, "comments": [{"username": "Dave Conroy", "comment_text": "I'd email the AirBnBs and ask if there's a bus service. It could be more manageable than trying to get an available taxi at a reasonable price in the countryside."}, {"username": "Simone Pfenninger", "comment_text": "Inconvenient all over Italy - you need the reception/\nrest./bar to call one for you (if the taxi can stop in front of the hotel) and or walk to a taxi stand and WAIT.\nI personally like to use taxis everyhwere but was upset/anoyed many times in Italy"}, {"username": "Kathy Whiting", "comment_text": "Check out the public transport near the air bnb - taxis are a nightmare to obtain when you need them in Florence and you cannot hail one and when we needed one for travel to the airport at 10am in the morning - none available nor at taxi stands."}, {"username": "Stephanie Osborn Rushing", "comment_text": "We are staying in Tuscany country side and hotel is quoting us 230 euros each way to go to Florence. The private car transfers are so expensive! But I don’t see another way around it."}, {"username": "Annette Mayer", "comment_text": "I stay at a place walkable to a train that is convenient to Florence"}, {"username": "Valerie Collanton", "comment_text": "We had difficulty calling a taxi when we stayed in the Florence hills last October. I know of no taxi app for Florence where you can order one. (Maybe one exists but we did not find it). As to calling one —I understand Italian and can speak some. BUT just getting beyond the automated message to actually speak to someone was impossible because it was spoken so fast. I could not understand it to move to the next step. That’s just my experience— maybe others have been more successful. But I don’t see how you will call for one if you aren’t very very good in the language."}, {"username": "Avril Samuel", "comment_text": "My daughter lives outside of Florence but there is a good bus service."}, {"username": "Amanda Richards", "comment_text": "Bus & train services are good but taxi in countryside not reliable."}, {"username": "Linda Slover Bright", "comment_text": "Check out the itTaxi app. I use it in Florence but I’m not sure if it works outside of Florence."}, {"username": "Paula Brink", "comment_text": "Unless you want to pay $$ for private transfers you are best to book a place on the train line or with bus service to Florence. Otherwise maybe rent a car."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "It will be difficult unless the airbnb has a bus stop nearby.\nRelying on taxis or private drivers to go back and forth will be expensive and frustrating.\nIn any case you won’t be able to have a stroll in Florence in the evening and you’ll be very limited in your restaurant choice.\nAlso it is very nice (and easy) to drive around in the countryside, full of little villages and beautiful spots, and staying there without a car you’ll miss most of it."}, {"username": "Bev Madill", "comment_text": "During a recent visit I found there were plenty of taxis at the main train station but getting a taxi elsewhere was a nightmare even if I tried to order one hours prior. No Uber there either. It's a personal choice if you want to stay out of town but in my opinion being in the city centre was amazing. I'd talk to your Airbnb host. I've found bus services in Tuscany are usually pretty good. Enjoy your trip."}, {"username": "Helen Ewing", "comment_text": "We tried to hire a taxi or uber from Impruneta, which is literally 15 minutes drive from the centre of Florence and we had no luck using the apps. Locals helped in the end by calling for us, but it took them nearly an hour to get through."}, {"username": "Mitch Blackwell", "comment_text": "I stayed in Greve in Chianti for a week. Highly, and I mean highly, encourage you to either rent a car or stay closer to Florence. Tuscany countryside is beautiful but if you have interest in exploring it’s tough (and costly) to do that without renting a vehicle."}, {"username": "Mary Passeri", "comment_text": "Not a stupid question at all. Outside of the cities taxis can be extremely difficult to get and expensive.\nThey will charge you twice...in that you pay for them from their starting point and the journey to your destination. So if they are coming from the town to pick you up you pay for that. Also beware of taxis/\ncabs as we think of them and cars with drivers...which are much more expensive. I loved in Italy for many years and got caught out by this only last year our 'cab' turned out to be a (very casual)driver service"}, {"username": "Deborah Larsen", "comment_text": "https://\nwww.euronews.com\n/my-europe/\n2023/07/27/\ncatching-a-taxi-\nin-italy-is-nea\nrly-impossible-\nheres-why"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2200352607030484", "text": "Hello. We are looking for private transfer (a pick up at Rome airport and going to Vico Equense).\nCan someone please recommend a private transfer?\nThankyou", "link": "facebook.com/groups/1373361046396315/permalink/2200352607030484/", "likes": 0, "comments": [{"username": "Naoh Tyteen", "comment_text": "We compare transfer companies and prices at here https://\nairporttransfer.\ncom/\nfco-rome-leonard\no-da-vinci-fium\nicino-airport-t\nransfers"}]}, {"id": "2200349113697500", "text": "Looking for suggestions on the best way to get from Salerno to Matera", "link": "facebook.com/groups/1373361046396315/permalink/2200349113697500/", "likes": 0, "comments": []}, {"id": "2200352847030460", "text": "Hello\nI will go visit Urbino\nAny tips or suggestions\nThanks 😊", "link": "facebook.com/groups/1373361046396315/permalink/2200352847030460/", "likes": 1, "comments": [{"username": "Jocelyn F. Hild", "comment_text": "Urbino is one of the most beautiful Renaissance cities in Italy. The university city has an impressive artistic heritage and offers a perfectly preserved old town (centro storico) and a lively ambience, which is also shaped by the city's many students."}, {"username": "Sherri Leis Dillavou", "comment_text": "Have fun!"}, {"username": "Rhonda Weinstock", "comment_text": "We just got back from Urbino. My son was studying there for 6 weeks at the university! It’s lovely, picturesque with lots of delicious cafes and restaurants. Try Sugar Cafe for an aperitivo and an aperol spritz! Tell them Andrew from America sent you! They are so nice there! Enjoy! Lots of hills but worth the trip! ❤️"}, {"username": "Benedetta Vanni", "comment_text": "Definitely visit the Palazzo Ducale and if you can find a guided tour that will be worth your money"}]}, {"id": "2200359493696462", "text": "Need help on where I can leave my carryons safe after checkout hotels, while I’m hanging for the next train.\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2200359493696462/", "likes": 0, "comments": []}, {"id": "2200359947029750", "text": "Hello, I’m going to Venice, Florence and Rome next week. I was wondering if I can just pay for everything in euros cash or do I need to get a card?\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2200359947029750/", "likes": 6, "comments": [{"username": "Paul Anderson", "comment_text": "We pay cash for everything. When we get home we will have no leftover bills. People like cash!"}, {"username": "Paul Vincent", "comment_text": "You may, but carrying large amounts of cash always a risk."}, {"username": "Rhona OConnor", "comment_text": "Some places are card only. Carrying large amounts of cash is inviting problems. Best to Use a debit card and a small amount of cash."}, {"username": "Lisa Valdovinos", "comment_text": "We used both."}, {"username": "Domenica Calvene", "comment_text": "I've used both no issues."}, {"username": "Colleen Dawson", "comment_text": "Yes you can, but carry a card for back up. I personally don’t like using a card for small things as I don’t want a big cc bill when I get back home."}, {"username": "Teresa Shawn Lane", "comment_text": "Euros or card work fine."}, {"username": "Rachael Richardson", "comment_text": "Cash is king in Italy ! Don’t worry if you don’t have a card but I would always take one as a back up"}, {"username": "Jules Earl-Rossiter", "comment_text": "I always take cash... definitely the way to go....🙃"}, {"username": "Melissa Reyes", "comment_text": "We used euros only our whole trip"}]}, {"id": "2200360047029740", "text": "Question arrived after booking the private tour at Coliseum. Is there actually tours on Sundays? or because it’s free, there are no tours? Could someone clear this up for me? Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2200360047029740/", "likes": 0, "comments": []}, {"id": "2199771073755304", "text": "Hello,\n\nCan you please help me. I’m going to Italy with my best friend from 29 Sep to 5 Oct. Here’s the tentative itinerary.\n\n29.09 02:40 - Arrive at Rome Fiumicino - Sleep\n\n29 Sep, Day 1: colosseum, Roman Forum, Palatine Hill, Piazze Navona, Pantheon, Trevi Fountain, Spanish steps\n\n30 Sep, Day 2: Vatican museum free & St Peters Basilica, Trastevere\n\n01 Oct: Travel early from Rome to Florence\n\n01 Oct, Day 1: Basilica Santa Crose, Ponte Veccio, Piazza Della Signiora, Piazza Della Republica, The Baptistry of St John, Cathedral Santa Maria Del Flore, Piti Palace, Bell Tower, Duomo, piazza Michelangelo\n\n02 Oct, Day 2: Day Trip to Cinque Terre\n\n03 Oct, Day 3: Boboli garden [not a must]\n\nTravel during the evening from Florence to Venice\n\n03 Oct, Day 1: Sleep\n\n04 Oct, Day 2: Realto Bridge, library acqua Alta, gondola ride, Santa Maria, St Marks Basilica, Bridge of sigh, the doge palace, piazza San Marco, scala contarini del bovolo, Rincocito adorable, pescaria San Bartolommeo, colourful canal, Arte laguna prize, scalzi bridge\n\n05 Oct, Day 3: Explore what we haven’t been able on day 2\n\n05 Oct 16:55 - plane leaving Venice Marco Polo\n\nIs it doable? What would you modify? Also since we will be arriving late in Rome, will we have transport to reach our accommodation.\n\nNothing has been booked yet except our air tickets. Can you recommend some good and budget accommodation. We are going to Jordan right after.\n\nThank you 🥰", "link": "facebook.com/groups/1373361046396315/permalink/2199771073755304/", "likes": 7, "comments": []}, {"id": "2199770003755411", "text": "Hello! Does anyone have any Airbnb or hotel recommendations for Verona? We are a family of four. Traveling with a five year old and one year old. A hotel with a babysitting service would be preferred, if you have used the service yourself. Thanks so much!", "link": "facebook.com/groups/1373361046396315/permalink/2199770003755411/", "likes": 0, "comments": []}, {"id": "2199753683757043", "text": "First time traveling to Italy.\n\nSomeone can give me information / explain how, which online page of how can we move by train between Venice, Milan, Verona? Also how to validate the ticket so as not to get a fine (as I see on tiktok) ?\n\nCould I go to Milan and Verona on the same day? or a day for each? (we will be traveling to Venice next week but weआणखी want to go to other places outside of Venice and take advantage.)\n\nHow can I go to Venice island from Mestre (since we will stay outside of Venice as such)? any advice? tips? What options do they have to go to the island? Can I book in advance ?\n\nSorry, it's a bit overwhelming because it's an unexpected trip and no advance planning at all.\n\nThank you in advance !!", "link": "facebook.com/groups/1373361046396315/permalink/2199753683757043/", "likes": 1, "comments": [{"username": "Scott Perry", "comment_text": "Rome2rio is a great site for planning travel."}, {"username": "Chris N Lynn", "comment_text": "Use the Trenitalia.com website or app.\nBonus, when you buy from the app your tickets are automatically validated."}, {"username": "Bill Casper", "comment_text": "Trenitalia or Trainline."}]}, {"id": "2199751397090605", "text": "Can anyone recommend a tour company that does Monsteratt, Sagrada, Gruel Park in 1 tour? Have 6 people need a guide.", "link": "facebook.com/groups/1373361046396315/permalink/2199751397090605/", "likes": 0, "comments": []}, {"id": "2199747913757620", "text": "Good Morning from Florida, USA! I am leaving for Italy in a few days and I wanted some information on who to tip and approximate amounts. I always tip on the higher end in the US, but I keep hearing that tipping isn't a thing in Europe. I do not want to be disrespectful and not tip properly. My travel agent says that she always tips 20-25 percentआणखी of restaurants in Italy. But friends say gratuities are included and if you want to throw a few extra euros for great service, it's appreciated and you have to let them know ifs for the server. Can I get some opinions on how tipping is done? I'm also staying at some very nice hotels and I will be asking the concierge for some help. How much should I tip them and do I do it at the end, or after each time I ask for service? I apologize, I am not a seasoned overseas traveler. Going to visit my daughter who is studying abroad and then we are heading to Italy. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2199747913757620/", "likes": 6, "comments": [{"username": "Romina Lauretig Toscano", "comment_text": "At restaurant you leave 1/1.5 euro per person. That's enough."}, {"username": "Cecilia Christine Costantini", "comment_text": "Italian here: Not obligatory to tip, but we (Italians) always leave a few coins to round up the bill, e g. If your bill is 62 euros, you might round up to 65. If you get coffee and the barista is nice and quick, you might drop 10-20 cents in the tip jar. If there is no tip jar, leave those cents directly on the bar, next to the empty coffee cup (we don't sit to have coffee, we stand). People are likely to tell you: no tipping. It doesn't mean waiters won't appreciate it if you tip, they will obvioisly be grateful. If you read coperto on the menu, it refers to a sort of fixed cost to cover table cloth, napkins, cutlery (mostly in the city center; in Rome, in my neighbourhood - outside the center - they don't charge it. They might charge bread separately. Some touristy places charge \"servizio\". But tips are not included and you cannot tip using your credit card. If you did, the owner of the business would get that money (and pay taxes)."}, {"username": "Giuliana Vaccari", "comment_text": "This might be helpful! Saw it posted from someone else in the group. Also, hello from a fellow Floridian 🌴"}, {"username": "Sandra Shoffner", "comment_text": "They will be happy with any amount you give them.They are paid a regular wage and don't rely on tips"}, {"username": "Lisa Valdovinos", "comment_text": "We tipped everywhere and the same as we do in USA"}, {"username": "Lucy Lou", "comment_text": "Countries in Europe all have different practises, the countries aren't all the same. As a general rule of thumb tips are at your discretion and not normally added on unless a large table\n\nThe most common ways are 10% of total bill or rounding up the nearest 10"}, {"username": "Marie Cuzzi", "comment_text": "I always tip and I tip as if I was in the US unless service is awful … I have had servers tell me I’ve overpaid and they tried to give me back money ( that would rarely happen in the US)\nThey are so appreciative of what ever is given to them"}, {"username": "Neil Dunning", "comment_text": "We tipped the same as we do in Florida if the service was good and it was great in Positano"}, {"username": "Louisa Curvelo", "comment_text": "No tips ....\nPeriod"}, {"username": "Mary Brown", "comment_text": "You are not in the US. Respect other cultures and customs.\nIt’s not in European culture to tip the way you tip in US."}, {"username": "Kimberly MacKinnon Cherry", "comment_text": "Tipping is not mandatory in Italy. In a full service restaurant we tipped 10%, and the wait staff was appreciative. Take out , no tip needed."}, {"username": "Roland Trego", "comment_text": "Tipping in Italy\nhttps://\nwww.travelandlei\nsure.com/\ntravel-tips/\nguide-to-tipping\n-in-europe-hote\nls-restaurants-\ntaxis-tours\n\nhttps://\nwww.afar.com/\nmagazine/\ntipping-101-when\n-to-tip-in-ital\ny-and-how-much-\nmoney-to-leave"}, {"username": "निनावी सहभागी", "comment_text": "Thank you all very much for all the excellent advice and tips! Very helpful!"}]}, {"id": "2199662683766143", "text": "Have rented an apartment in Verona for 3 months and am from Australia. Been here 3 weeks and too many places of beauty to single out but if I must its Lago di Braies in Italian Alps...took my breath away.", "link": "facebook.com/groups/1373361046396315/permalink/2199662683766143/", "likes": 82, "comments": [{"username": "Leesa Martin", "comment_text": "Sounds amazing\nIs it part of the Dollarmites? Where would you suggest to stay? We are hiring a car from Venice, hope to stay 2 nights and then 2 nights at lake Garda then back to Venice for our flight\n\nIs it a hike or a look out?"}, {"username": "Pietro Adami", "comment_text": "Raymond Capkin, on a “I feel lazy” day, take a quick tour to the Ponte di Veja, and have lunch at the Trattoria there. Short drive from town (20-25 minutes, approx), a 10 minutes walk, for an out-of-the-sche\nmes destination."}, {"username": "Michele David", "comment_text": "Thank you for your suggestions. My husband and I will be staying a week in Borgo Roma, Verona. What is the distance to Lago si Braies from Verona? We will be going to Lake Como for the completion and third week of our trip. Mille Grazie"}, {"username": "Lora de Vries", "comment_text": "Stunning!!"}, {"username": "Cathy Saultzman", "comment_text": "3 months. I’m so jealous 🤪"}, {"username": "Patricia Wagner", "comment_text": "We were there a week ago! Beautiful"}, {"username": "Lushan Yao", "comment_text": "Beautiful indeed! May I ask how you rented the apartment? I would love to stay in Italy for 3 months if I get the opportunity."}, {"username": "Dave Conroy", "comment_text": "Great stuff. Proper get-to-know-a-c\nountry trip."}, {"username": "Lisa Abrams Argento", "comment_text": "IT is absolutely breathtaking. We were there in June."}, {"username": "Sarit Rolnik", "comment_text": "I agree,I love this lake 🥰"}, {"username": "Annabella Pojer", "comment_text": "Love Verona do yourself a big favor and have dinner at trattoria tre Marchetti in via tre Marchetti fabulous 🥰"}, {"username": "Phyllis Snyder", "comment_text": "3 months of total bliss!"}, {"username": "Norma Bagley", "comment_text": "So beautiful 🤩"}]}, {"id": "2199743040424774", "text": "Good morning!\nLooking for advice on Sorrento to calabria and then to Sicily?!", "link": "facebook.com/groups/1373361046396315/permalink/2199743040424774/", "likes": 1, "comments": [{"username": "Julie Tran", "comment_text": "When? Because its currently not a good time to be there right now in sicily i had friends who had to evacuate due to the massive wildfire right now"}, {"username": "Niamh O'Flaherty", "comment_text": "Dont miss Tropea!"}, {"username": "Greg Saba", "comment_text": "How much time in Sicily? It is a large island. We have done trips of less than a week and some for a month or longer. A month isn't enough to see the whole island, even though we got in 76 of the 100 cities, towns and places we wanted to visit."}, {"username": "Michele Boubede Granito", "comment_text": "Stay in Taormina when you go to Sicily\n\nTrain goes from Calabria to Sicily via a ferry… yes the train goes on to the ferry"}, {"username": "Diane Petonito Giordano", "comment_text": "In Calabria go to Tropeo beach"}, {"username": "Clara Caputo", "comment_text": "Train from Salerno to Calabria"}, {"username": "Lina Stump", "comment_text": "Sicily do Palermo, Agrigento, Taormina, Erice, Monreale very old very beautiful, sellenunte, segesta"}, {"username": "Julie Angel Bruther", "comment_text": "I booked a train from Naples to Taormina. 61/2 hours I think. Direct. (Of course ferry) thru Trainline app . All daytime travel"}, {"username": "John Lapinsky", "comment_text": "GO!"}]}, {"id": "2199741267091618", "text": "Any recommendations for the nicest restaurant in La Spezia area. Not particularly looking for the Michelin star options.", "link": "facebook.com/groups/1373361046396315/permalink/2199741267091618/", "likes": 0, "comments": []}, {"id": "2199740587091686", "text": "Will anyone be in Rome August 6-13?", "link": "facebook.com/groups/1373361046396315/permalink/2199740587091686/", "likes": 0, "comments": []}, {"id": "2199740280425050", "text": "Looking for private ￼boat tour recommendations off the Amalfi coast departing out of ￼ Sorrento! Any information is greatly appreciated! TY", "link": "facebook.com/groups/1373361046396315/permalink/2199740280425050/", "likes": 0, "comments": [{"username": "Cori Finch", "comment_text": "Lauren Reavis Robbins"}, {"username": "Denise Lynn Frick", "comment_text": "Check out Luxama Travel"}]}, {"id": "2199738100425268", "text": "looking for a hotel, apartment in Bologna for 2 weeks, 2nd week of September not more than about 200€ per night ... in the center if possible", "link": "facebook.com/groups/1373361046396315/permalink/2199738100425268/", "likes": 0, "comments": []}, {"id": "2199736240425454", "text": "Hello ,\nTrying to book airport shuttle autostradale from brescia to bergamo airport but could not find option for my baby less than 2 years\n1.are they allowed to board\n2.do we need a car set like flixbus\n\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2199736240425454/", "likes": 0, "comments": []}, {"id": "2199734377092307", "text": "My husband and I returned from our Italy trip just two days ago, and it exceeded all of our expectations. An unexpected delight was a visit to a lovely little hilltop town called Orvieto, about 90 minutesआणखी north of Rome. As part of our bus tour, we knew nothing about it, but we found it to be charming and delightful in every possible way, it was definitely a highlight of our trip. We had only a couple of hours to explore, but we wish we could have spent the rest of the day! Orvieto is perched high up on a rock cliff, we rode a little cable car up a steep hill and there it was with 360 degree views of the countryside below. We loved strolling through the streets filled with flowers, vines and pretty shops, it looked like it came straight out of a storybook! Then we came across a stunning cathedral that took our breath away! It was covered with ornate, colorful carvings that shone in the sunlight. We did not want to leave this place! If you have a bit of extra time in your itinerary, I highly recommend a visit to Orvieto, you will not be disappointed!", "link": "facebook.com/groups/1373361046396315/permalink/2199734377092307/", "likes": 723, "comments": [{"username": "Colleen Lee", "comment_text": "4 night stopover in Orvieto is always on our itinerary."}, {"username": "Marla Wiese Compa", "comment_text": "Just came home from Italy and Orvieto was one of our favorite stops. We are at a restaurant with best meatballs that I have ever had. The scenery, the shops, and overall quaint town was AMAZING!"}, {"username": "Olga Plitt", "comment_text": "Absolutely gorgeous!!! Totally I agree. Staying outside of major cities is the way to go. We stayed in Cortona in 2018 and took train to Florence and Siena from there. Would do it again in a heart beat."}, {"username": "George Haenisch", "comment_text": "The Church there is an amazing find!"}, {"username": "Paula Marsiglio Nave", "comment_text": "Just got back from Italy in mid-June. We didn’t have a chance to visit this little town. One of our stops was Tuscany for 4 days. There are so many of these little towns there. We felt that way about Pienza."}, {"username": "Viviane Van Braeckel", "comment_text": "Orvieto and Bagnoreggio are great ! Visit also : Viterbo and Villa Lante in Bagnaia ! Bomarzo (parco dei mostri with kids)!Montefias\ncone for the wine 😉 Lago di Bolsena … Pitigliano . What a great region 🤩"}, {"username": "Wendy Anne Breuer", "comment_text": "Loved orvieto!!!!"}, {"username": "Paula Andrea Von Burg", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Kristen Taylor", "comment_text": "I adore Orvieto."}, {"username": "Phyllis Snyder", "comment_text": "It’s on my list of day trips from Rome! Great photos!"}, {"username": "Theresa Salerno Adams", "comment_text": "Love Orvieto"}, {"username": "Irene Oda", "comment_text": "Orvieto also has beautiful ceramics."}, {"username": "Sabrina Bourgeois Heltz", "comment_text": "Loved Orvieto. Didn’t stay there but did a day tour there after staying 2 nights in Cortona. If you love Orvieto you would love Cortona as well. Both have the same vibe… small, quaint, food, wine, shops, churches, sights. Pure Joy! ❤️"}, {"username": "Carol Rojas", "comment_text": "Could you share which tour took you here?"}, {"username": "Bob Miller", "comment_text": "Orvieto is one of the most enchanting towns in Italy. The funicular ride is a blast, and town is charming with many historical sites."}, {"username": "Danielle Gervais", "comment_text": "Orvieto has wonderful wines\nItaly is beautiful!"}, {"username": "Teresa Townsend", "comment_text": "Omg it looks amazing 🌸"}, {"username": "Mary Lou Gillen", "comment_text": "Such beautiful pictures."}, {"username": "Jessica Jordan", "comment_text": "Beautiful!"}, {"username": "Jenny Larsen", "comment_text": "Just know that only the slow train goes to Orvieto no fast trains stop there saying that we had the whole carriage to ourselves"}, {"username": "Heather Van Olst", "comment_text": "Agreed! We came upon Orvieto by accident while driving from Rome to Tuscany. We veered off our route to check it out & were completely enchanted. One of our favourite finds 👍"}, {"username": "Beverley Milson", "comment_text": "Absolutely gorgeous!!! I spent 3 nights in Orvieto when their annual religious festival was on… simply loved it! Views from city walls were spectacular!"}, {"username": "Russell Weidner", "comment_text": "We spent a night there. Magical"}, {"username": "Cindy S Poortinga", "comment_text": "Suzanne Kindhart Weatherman"}, {"username": "Marcus Hiesler", "comment_text": "Sharon Hiesler"}, {"username": "Colin Hough", "comment_text": "Thankyou for sharing"}, {"username": "Maryann Vandewoestyne", "comment_text": "Everything about Italy is amazing. So hoping to go back some day."}, {"username": "Denise Beaudoin", "comment_text": "Denise Beaudoin"}, {"username": "Melissa Smith", "comment_text": "Shhhhh… don’t tell anyone 😂 we are definitely booked to stay there in October and super excited"}, {"username": "Gina Hassett Hunt", "comment_text": "Thank you for sharing! Will be there in August!"}, {"username": "Jo Courage", "comment_text": "This looks amazing, thank you for sharing this information. These stunning little gems 💎 are the treasures we want to visit and explore on our trip to Italy 🇮🇹 next year…. Just wonderful to know 🫶🏻"}, {"username": "Debby Gould", "comment_text": "Love Orvietto"}, {"username": "Joanna Allsop", "comment_text": "Went there years ago it is such a beautiful place"}, {"username": "Carmel Napolitano-mancarella", "comment_text": "❤️ Orvieto one of my favourites ❤️"}, {"username": "Marianne Alford Osentoski", "comment_text": "Easy to catch train to tgere from Rome. Great center for ceramics"}, {"username": "Maria Hott", "comment_text": "it is a beautiful place. magical 💕"}, {"username": "Robert Bickel", "comment_text": "Same. One of our favorite finds on our trip."}, {"username": "Pat Morgan", "comment_text": "I went to Orvieto on my trip with Globus in 2018. Such a cute little town! Loved that cathedral!"}, {"username": "Nada Zakkour", "comment_text": "It looks charming.. Thank you for your post .. Definitely, try to visit it ♥️"}, {"username": "Lisa Vivolo", "comment_text": "thank you for posting!"}, {"username": "Jenny Larsen", "comment_text": "I also stayed in Orvietto amazing surprise st Patrick’s well blew my mind the food was the best I had in Italy also the theatre was amazing"}, {"username": "Janet Hitzeman Lynch", "comment_text": "Orvieto is a favorite! I have stayed there twice for art retreats a week at a time. ❤️ feels like home to me"}, {"username": "Cathlene Dunn", "comment_text": "Yes! Orvieto is a favorite of mine. We stayed there for 6 days. There are so many things to do nearby too! It is a great place to stage for day trips to wineries, lakes, gardens and other small towns like Civita di Bagnoregio!"}, {"username": "Hue Nguyen", "comment_text": "Yeah Orvieto is so nice and it’s located in region Umbria. Next time you would also visit Assisi where i live. It is famous too. It takes around two hours and a half by bus from Rome"}, {"username": "Nancy Ely", "comment_text": "I was in Orvieto in 1963, 60 years ago, studying the Etruscan civilization. Next time, plan to go at harvest time — it’s an unforgettable experience."}, {"username": "Maria Petrozzi", "comment_text": "Spent 4 days so much to see did a day trip to Bagnoregio\nSo much to explore"}, {"username": "Tiffany Boland", "comment_text": "Dannielle Boland"}, {"username": "Ken Feltham", "comment_text": "Great post thanks! We will be spending 2 nights Orvieto at the end of August 😀"}, {"username": "Suzie LG", "comment_text": "Yes, we went there also. It was quaint, charming and totally unexpected beauty!"}, {"username": "Richelle Trezise", "comment_text": "We are going there while we are in rome as a day trip by ourselves"}, {"username": "Paula Purcell", "comment_text": "Paula Purcell"}, {"username": "Jenny Larsen", "comment_text": "Jenny Larsen"}, {"username": "Jenny Larsen", "comment_text": "Jenny Larsen"}, {"username": "Jenny Larsen", "comment_text": "Jenny Larsen"}, {"username": "Jenny Larsen", "comment_text": "St Patrick’s well"}, {"username": "Jenny Larsen", "comment_text": "You walk down and up"}, {"username": "Jenny Larsen", "comment_text": "Theatre"}, {"username": "Adam Wilmot", "comment_text": "Jocelyn Wilmot"}, {"username": "Sandra Salisbury", "comment_text": "Looks so beautiful ☀️"}, {"username": "Alex Whitcombe", "comment_text": "We visited Orvieto a few days ago and you are right it was picture perfect. Lucca is another amazingly gorgeous town as well with a path on top of the wall that you can take all around the city, so pretty."}, {"username": "April McDill Steele", "comment_text": "We had the same experience! It ended up being our favorite stop out of 17 days!"}, {"username": "Kellise Solomon Jones", "comment_text": "Absolutely gorgeous!!! We went there in June. It was so quaint"}, {"username": "Guiseppi Salerno", "comment_text": "Love Orvieto….” Under the Tuscan Sun “"}, {"username": "Michelle Wilson", "comment_text": "Looks beautiful and a great day escape from bustling Rome. If I catch a train from Rome termini, is it far to walk from Orvieto station? TIA 😊"}, {"username": "Leanne Dawn Sutton", "comment_text": "On my list!"}, {"username": "Jo Ann Schwartz Woodward", "comment_text": "Beautiful images"}, {"username": "Claire Mccourt", "comment_text": "Thanks for sharing!! Beautiful!"}, {"username": "Ed Novak", "comment_text": "Found Orvieto to be a quaint little town and the duomo is quite impressive. The town can be seen in one day without rushing. It is regularly suggested as a day trip from Rome. If staying in Rome the train ride is an hour long and then the cable car up to the hilltop city.\nThe views are very nice when up on the hilltop looking out to the countryside.\nThere isn’t very much outside the train station at the bottom of the cable car ride, which is located directly across the street from the train station."}, {"username": "Pam Hughes", "comment_text": "I have stayed there overnight, it was our first stop after flying into Rome and picking up a hire car. Beautiful town and a great first stop on the way out from the airport."}, {"username": "Toni Mair-Redmond", "comment_text": "Beautiful"}, {"username": "Lorin B. Bridge", "comment_text": "We were there a month ago and loved it. All over Italy. Its the best."}, {"username": "Michelle Pagnott Curtis", "comment_text": "Loved Orvieto..."}, {"username": "Alyson Dietrich Pawlik", "comment_text": "We loved Orvieto too! An absolute gem!! We were there in June and highly recommend it."}, {"username": "Lyn Evans", "comment_text": "It’s so beautiful"}, {"username": "Jacki Cincotta", "comment_text": "We are off to Italy from Australia in 8 weeks time and are staying in a lovely apartment in Orvieto for 1 week. I can't wait!! 💖"}, {"username": "Kerrin Barassi", "comment_text": "The BEST carbonara is in a tiny trattoria in Orvieto."}, {"username": "Richard Petronio", "comment_text": "Orvieto has always been a favorite city of mine."}, {"username": "Mary Thomas", "comment_text": "Janeal Smith I may have missed it in the many comments but you said you did a bus trip - are you able to tell me the name as I would love to add this to my itinerary - I am travelling solo so I like to add in a few tours as well as doing my own exploring - Thank you"}, {"username": "Maria Badamo DeSocio", "comment_text": "Umbria is a magical place! Glad you enjoyed one of its beautiful towns!"}, {"username": "Delwyn Ellis", "comment_text": "Thank you for sharing! It’s wonderful when you find these little lesser known gems. 😍"}, {"username": "Allison Glover", "comment_text": "Stevie Breanna"}, {"username": "Robyn Amos", "comment_text": "Fabulous!"}, {"username": "Denise Leslie", "comment_text": "Stunning photos"}, {"username": "Angela Black", "comment_text": "This is a video of Locanda Rosati in Orvieto - stayed here in mid-June. Amazing!! Very friendly and accommodating hosts!"}, {"username": "Cindy Voss", "comment_text": "Catherine Sharp Nanci Moll"}, {"username": "Karen Giuliano", "comment_text": "Want to visit… it’s on our list"}, {"username": "Bonnie Rupprecht", "comment_text": "Yes Orvieto is the best"}, {"username": "Felicia Bogden", "comment_text": "I’m planning to go there on my way to Assisi in September. Thank you so sharing!!\nI’m so excited!!!"}, {"username": "Laura Storie Dolinar", "comment_text": "Beautiful pictures. So glad we are planning a stop here it looks wonderful!"}, {"username": "Marg Ryan", "comment_text": "I loved Orvieto which I'd never heard of before our trip"}, {"username": "Julie Bennett Carson", "comment_text": "Orvieto is \" a must see\" town. Absolutely charming!!!"}, {"username": "Beth Burrow", "comment_text": "Ed Burrow"}, {"username": "Jill Reid Hall", "comment_text": "Beautiful, thanks for sharing."}, {"username": "Rita Sanza", "comment_text": "Rita Sanza"}, {"username": "Eileen Cushing Kosar", "comment_text": "We loved it there too!"}, {"username": "Gina Romano Peralta", "comment_text": "Wow this is great to know. I’d love suggestions of hotels"}, {"username": "Gloria Pelullo", "comment_text": "Love Orvieto"}, {"username": "Laurel Jaramillo", "comment_text": "That’s where my ancestors are from (my great grandfather)"}, {"username": "Marie Burns", "comment_text": "Thank you for sharing!"}, {"username": "Veronica Wyatt", "comment_text": "Try exploring some of hilltop villages in Umbria like Assisi, Spoleto, Spello, citta della pieve etc. Umbria is beautiful!"}, {"username": "Lisa Adams Robertson", "comment_text": "Yes! We took a break from the intensity of Rome and did an easy day trip to Orvieto and loved it! The church, the well, and the catacombs were all very interesting! Gorgeous views, too! Side note: beware of the self cleaning toilets at the train station. If someone holds the door for you to go in after them, don't do it! It happened to the lady in front of me, and she got washed (much to the amusement of her family!)."}, {"username": "Melanee Maranto Adams-Chappell", "comment_text": "Love Orvieto! Spent 4 nights there last year. We rented a car and explored Cortona, Assisi, and other villages. Loved every minute there!"}, {"username": "Karen Hendershot", "comment_text": "Carol Hendershot Jennings"}, {"username": "Krissy DaRusso", "comment_text": "I just arrived in Rome today from Florence and feel a bit overwhelmed! Will definitely check out Orvieto."}, {"username": "Tiffany Massengale Wier", "comment_text": "Agreed! We loved Orvieto too! So beautiful"}, {"username": "Cathy Baer", "comment_text": "What tour company did you use?"}, {"username": "Mary Young Hojnacki", "comment_text": "Thanks for posting.Spendin\ng a night in October"}, {"username": "Amber Ikemoto", "comment_text": "We absolutely loved it. We were there in June and felt the same way in terms of storybook. Had one of our best meals there too."}, {"username": "Jeanne Valsi Fastero", "comment_text": "We loved Orvieto ♥️"}, {"username": "Debbie Correa", "comment_text": "Kennetha Sanchez def want to stop here for a few hours and lunch"}, {"username": "Diane Petonito Giordano", "comment_text": "I have been to small towns in Italy & I truly enjoyed them. No crowds to deal with the people are warm & welcoming."}, {"username": "Halie Haefele", "comment_text": "Grant Gerk"}, {"username": "Mariët Eertman-Heemstra", "comment_text": "Great pictures of a fantastic vacation!! 🍀🍀🍀"}, {"username": "Angelina John", "comment_text": "It's one of our favorite places!!!!"}, {"username": "Caterina Liquori-Culhane", "comment_text": "I ve been there gorgeous. Our tour didn't have it. What tour did you use?"}, {"username": "Caterina Liquori-Culhane", "comment_text": "Looks alot like assisi"}, {"username": "Joe Arndt", "comment_text": "I too love the little alleyways and they are everywhere!"}, {"username": "Molly Mammarella Mullins", "comment_text": "For a day trip from Rome what is the best way to go? Train? Not interestedin a bus.."}, {"username": "Julie Mccall-Sandhofer", "comment_text": "All of these wonderful posts just make me want to stay in the hill county of Tuscany and Umbria. I do want to visit Florence, Rome and Venice but this looks like my kind of place - beautiful scenery, great wine, good food and less crowds."}, {"username": "Ann Larmore Andis", "comment_text": "I’ve been same on a bus tour it is magical"}]}, {"id": "2199734240425654", "text": "Looking to cruise to Italy next year. What’s the best time to go? Are there any groups going?", "link": "facebook.com/groups/1373361046396315/permalink/2199734240425654/", "likes": 0, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2199732940425784", "text": "Has anyone toured the Academia during evening hours?", "link": "facebook.com/groups/1373361046396315/permalink/2199732940425784/", "likes": 0, "comments": []}, {"id": "2199731090425969", "text": "Cannot say enough good things about Pianostrada Laboratorio di cucina - I have been following them on FB for some time now and it was a must do for Day 1 in Rome. A family run business that is all aboutआणखी produce and how best to serve it to customers is always a winning combination. Aubergine fritters to start in a tomato sauce followed by pasta for me and a sensational steak for my wife. Accompanied by an excellent Brunello de Montalcino. Shared desert of peach sorbet with fresh peaches and a crumb seal the deal. Delicioso, a must do on any visit to Rome.", "link": "facebook.com/groups/1373361046396315/permalink/2199731090425969/", "likes": 0, "comments": []}, {"id": "2199722257093519", "text": "Garda", "link": "facebook.com/groups/1373361046396315/permalink/2199722257093519/", "likes": 48, "comments": [{"username": "Vanessa Bryant", "comment_text": "Vanessa Bryant"}, {"username": "Lorraine Baker", "comment_text": "Lorraine Baker"}, {"username": "Alicja Krampa-Chrabąszczewicz", "comment_text": "Uwielbiam to miejsce, jest magiczne💕"}]}, {"id": "2199721533760258", "text": "Has anyone used a private boat service in Santa Margherita Ligure or Camogli? I would just like a short boat ride to take photos from the water and to take in the views. (nothing super expensive or fancy) 🚤", "link": "facebook.com/groups/1373361046396315/permalink/2199721533760258/", "likes": 0, "comments": []}, {"id": "2199605533771858", "text": "*edit* has anyone done #4?* Colosseum advice! This is the most important thing we want to see in our trip. Ticket sales allegedly open at 130am my time and I stayed up till 3am refreshing the window and never had a chance to get guided or unguided tix. They're instantly gone. I really don't want to book with a 3rd party, pay 2-3times as much and have them cancelled last minute. Those who've done it, how big of a deal was it to do the arena floor or the underground? So many questions.\n1. What's in the 'arena'? Will we miss much if we don't go there?\n2. Will it be that much better if we get a guided tour or would it be just as well listening to Rick Steves? Are there other audio tours out there as well for it?\n3. Those with parco memberships, it says on the website they don't include the arena but I read somewhere that someone just showed their membership card and they were allowed on/in the arena.\n4. Another membership question - thinking maybe the best thing for us to do is get the membership, book the underground night tour (extra cost) one night, then go the next day and do the rest of the colosseum. Any thoughts on this?\n\nThanks in advance, the information in this group has been so helpful!", "link": "facebook.com/groups/1373361046396315/permalink/2199605533771858/", "likes": 30, "comments": [{"username": "Randy Steinberg", "comment_text": "Most overrated thing in Italy, in my opinion."}, {"username": "Tari Lawson", "comment_text": "It is very hard to get the night tour. I wanted to do that but was not able to get tickets. I have done regular admission, underground, arena, as well as 3rd tier. All are good. If you can only get the regular admission, you will still see almost everything, just from farther away."}, {"username": "Kasia Sudol", "comment_text": "Get a tour guide!"}, {"username": "Patty Gaskin", "comment_text": "Great question. I was wondering the same thing"}, {"username": "Maicka Palomares", "comment_text": "Reggie"}, {"username": "Jenn Messina Babore", "comment_text": "1. The arena is just the floor that overlooks the underground. You can get a similar view from other areas, so it’s not a must do but honestly get whatever tickets you can grab.\n\n2. A guided tour helps you better understand what you are looking at. If you can’t get one, Rick Steves audio tour is a good alternative. You can also visit without any tour info.\n\n3. ParCo has a link to book tickets that are just for entry. You have to grab the same tickets everyone else is vying for, just you don’t pay extra, since you have the membership. So while it is included, you still have to try and get tickets with the underground included.\n\n4. ParCo was our backup plan if we couldn’t get regular tickets. I got regular tickets with an archaeologist, which unfortunately we were too late to hear the speech and ended up with just entrance. We also got night tour tickets to see the underground. Really awesome to see."}, {"username": "Steve Grossman", "comment_text": "The Coliseum was the most underwhelming Part of our trips to rome. On subsequent trips we didn't even go there. The vatican complex is the jewel of all roman trips."}, {"username": "Dann Hrusch", "comment_text": "I'm not a fan of tours as much prefer to wander at my own pace. I buy tickets ahead of time from the official website ,(colosseo.it),\nhowever you won't be able to enter the arena. It also can be a little confusing where to enter. If there's a big line outside, that's for people buying tickets. Should be a separate queue just to the right of it and you can basically walk right in after a security check."}, {"username": "Darlene Saverino Murray", "comment_text": "Musement tours. Floor tour really explains the history. Also includes Skip the line.... And oh my the lines!!!"}, {"username": "Jeff McLellan", "comment_text": "We considered the Colosseum as something we were going to do once on our first trip and likely not do again (unless we have grandkids at some point). The underground was pretty amazing/cool to see and in our opinion was a very important part of our visit to the Colosseum."}, {"username": "Kathleen Roll", "comment_text": "I have done the Colosseum 3 times - on 3 separate trips with different people and I have done a guided tour on each occasion and would not hesitate to do it again. To actually see how the gladiators and animals were in their ‘cells’ how the water was pumped in. The lifts that went up to the arena.\nEach time it was different and the atmosphere under that arena floor is amazing and last year when I went with my teenager they had opened more underneath it was great.\nThe guides we had really know their stuff.\nLoved it"}, {"username": "Cheri Arrowood-Stanziano", "comment_text": "Look on Viator and book a tour, many options"}, {"username": "Elizabeth Lupo DiVito", "comment_text": "We just went and did a guided tour to the arena floor. We had been to Rome before and had regretted not going to the coloseum, it was probably one of the most disappointing things I've done in Rome. Our guide was nice, but we couldn't understand him. There are so many fascinating things to see in Rome I wouldn't spend too much time in the Coloseum. We were only there for a week and I had other things I would have liked to spend more time at in Rome. Glad I saw it, but don't need to do it again ever."}, {"username": "Lester Smith", "comment_text": "Last time I was in Rome you couldn't do anything in the colosseum because of stabilizing work being done. Yes it's been that long. I do want to get back there some day. Where I go its more than a day trip."}, {"username": "Rhonda N Rick Nicholson", "comment_text": "Private tour, we have done it twice and been to areas we would not have seen on our own or understood. A guide book can’t replace a real person, plus the time you save by skipping the long lines is worth it. This is usually a trip of a lifetime, so see as much as you can"}, {"username": "Lisa Valdovinos", "comment_text": "We did a small guided tour and we were able to skip the long line. We did underground and above. We had tickets in advance."}, {"username": "Laura Taylor Gregar", "comment_text": "Jackie Ahern"}, {"username": "Erica Murray", "comment_text": "We did the underground tour a few weeks ago and loved it 😊"}, {"username": "Rachael Richardson", "comment_text": "Not sure if you can do the underground without a tour - we got ours cancelled and had to rebook just the normal arena , so never got to go underground!\nA lot of people I spoke to said the tour is amazing on a night with the underground ,"}, {"username": "Lynn LaColla Barnsback", "comment_text": "We hired a private guide. She was an archeologist who and done digs in the forum/. When you know what you are looking at and have an expert it comes alive. It was simply amazing. Our group of 4 adults were mesmerized. We are however lifelong learners and readers. A photo op would never have been enough."}, {"username": "Ann Heidger Pequeno", "comment_text": "Bobby Pequeno 🇮🇹"}, {"username": "Billie Begley", "comment_text": "We did walks of Italy they do an excellent tour. Don’t miss the underground. It is one of the biggest parts of the Colosseum in my opinion. Seeing the area where the gladiators and animals were kept. You need to stand there and Really take it in. It was a brutal place in all reality. To see the charred walls where they had their fires to keep warm. People just Look at the exterior. You need to learn about what the guides will tell you about Blood and Bread day and what they did to feed their families."}, {"username": "Karen Schmidt", "comment_text": "We did the “gladiator tour”. Brought us to the arena floor via a different gate that the gladiators used. The colosseum was great…don’t get me wrong…but it didn’t take my breath away like the one in Verona did. THAT one was so incredibly amazing imo. When I come with my husband in May we’ll book a tour (again) because he is really wanting see it but I think we’ll do the night time, underground one"}, {"username": "Wallace Clavelle", "comment_text": "I booked with them."}, {"username": "Annette Giovia", "comment_text": "Just don't carve your initials ANYWHERE in ITALY."}, {"username": "Suzy Coler", "comment_text": "If this is your top gotta see, do it and don’t leave any venue unturned in Rome!"}, {"username": "Janet Isaacs Lanza", "comment_text": "Our experience with the Colosseum yesterday was....our guide was excellent and very passionate about her knowledge but she was very very hard to understand. To the point that we missed a lot of info. We just did the arena and as huge as it is, there really wasn't much to see. It all looks the same. I was told after our tour that the underground is the way to go."}, {"username": "Cathie Winnie", "comment_text": "Going to Rome at the end of September. Staying for 3 days/\nnights. Want to do skip the line and private tour of the Vatican, colleseum, catacombs. Any recommendations on who to use and any other suggestions like a ghost tour?"}, {"username": "Maree Rose", "comment_text": "Arena floor and underground guided tour. It was fabulous and loads of information.\nWe booked through Get your guide"}, {"username": "Marla Davison Danis", "comment_text": "The Tour Guy guided tour with colosseum, Palestine hill and Roman forum so worth it! We did not go to the arena or gift shop but so interesting! We felt like we learned and saw so much!"}, {"username": "Linda Krisel Shapiro", "comment_text": "Do an underground guided tour. It is fascinating, a must see. When in Rome...."}, {"username": "Lester Esterhuizen", "comment_text": "The first Sunday of the new month entry is free 👍.Also most attractions"}, {"username": "Jenny Frank", "comment_text": "just go online 30 days before you want to go; tix are released all day long you will get what you need; just refresh and be patient;"}, {"username": "Matthew Cawley", "comment_text": "On our Rome in a day tour we did the upper level but were left to wander when finished. We went down to the arena and took the pics. All tours will talk about everything so wouldnt worry about that."}, {"username": "Jill Medrano Casey", "comment_text": "My 18 year old daughter went to Italy on a school trip in 2022 and we went this summer. With school they did not do the arena floor. She told me that the main thing she wanted to do on our trip was to see the Arena floor because she felt like she had missed so much. After we did it, she told me it was so much more meaningful by including the floor + having a guided tour."}]}, {"id": "2199505490448529", "text": "Hi Italian lovers\nMy husband and I are travelling to Italy in September and October this year and decided to be spontaneous regarding accommodation and travel. But seeing all the posts about booking months or even a year in advance makes me think. Should I freak out? We are in our 50s and 60s and are not the type of people who like to plan ahead asआणखी we feel it is limiting our flexibility. Ok, looking forward to all your replies confirming me we ll still be able to catch trains and won't have to sleep on the streets 🤣🤩🙏💕\n\nEdit: thanx everyone for sharing your thoughts and experiences. I have now gotten a good understanding and decided to turn off commenting 🙏💕", "link": "facebook.com/groups/1373361046396315/permalink/2199505490448529/", "likes": 36, "comments": [{"username": "Sandra Kingsley", "comment_text": "Just book your accommodation thru booking.com with free cancellation."}, {"username": "Jeanne Mcnamee Bates", "comment_text": "I went to Italy this year for a month rented a sprinter van had the time of my life, had very little plans loved places I’ve never heard of it was amazing parked outside the huge cities and taxied in;-)"}, {"username": "Danielle Gervais", "comment_text": "Look at Expedia etc we just finished booking different hotels for September , lots of hotels but start doing it"}, {"username": "Kyra Savoie Miles", "comment_text": "What type of places do you look for? Chain hotel, smaller hotels, AirBnB?"}, {"username": "Andrea Farkas", "comment_text": "We just got home from a round trip. I didn't book anything in advance, we decided in the morning which direction we were going, I usually booked the accommodation on the booking website in the afternoons. So, go ahead :-)"}, {"username": "Megan Clune", "comment_text": "I haven’t booked any accomodation for Italy in October/ November. Having said that I have booked Greece and Turkey for September."}, {"username": "Iris Joan Price", "comment_text": "Last year, the second week of September, my neighbor and I were just getting to know each other and she and I decided that we both wanted to go to Italy. We booked our flights four weeks out and started to piece together two itineraries that started together in Sorrento, then took each of us to two separate parts of Italy, and brought us back together in Rome for our last four days the first week of November. We had no issues finding accommodations,\ntours, ferries, or trains, a month in advance, or when unexpected things came up or opportunities presented themselves, on the spur of the moment. She was 59 and I was 70 years old at the time. Aside from the tours of major attractions (which you may or may not be interested in), our experiences would indicate you have little to worry about. Book the big things first and don't worry about planning every single detail way ahead. Leave room for some spontaneity. Meanwhile, that was my friend's first trip abroad and now she is about to start a yearlong world wide travel odyssey on her own which she has outlined for about 6 months but will book as she goes knowing that she will have more flexibility as to what exactly she wants to do once she is in each country."}, {"username": "Jenny Meffert", "comment_text": "I wouldn’t risk it. It could be disastrous."}, {"username": "Pina Tome", "comment_text": "Word of advise. I am a ta and I have clients that are doing Italy also same time as you. They can't find hotel availability so now they are calling me to find something for them. Unfortunately it seems eveything is going to Italy in the same time frame. Good luck!"}, {"username": "Tal Burdejny", "comment_text": "Last year i travelled Italy from May-October. Peak season. Just like you i was spontaneous. Never had any problem get great accommodation, hotels/\napartments on the day or even 1-2 days before.\nAs for train tkts, the earliest i booked was the evening before, most of the time while walking to the train station. Trains are going every 10-20 min between the big cities. Never had a problem with either\nEnjoy"}, {"username": "Sarah Emerson Nelson", "comment_text": "Not sure if someone else posted this, but...\n\nMaybe book cancellable accommodations.\nThat way, if you love where you are you can be flexible. Having just jammed in way too much in a short period of time, I highly recommend keeping the same accommodations for at least three nights and doing day trips from the same hub, rather than always being on the move with luggage.\n\nAlso, book the \"big stuff\" that you would be sad to miss out on. If you don't care about any of it, just go with the flow and you'll be happy with the flexibility.\n\nI don't THINK trains will be a problem, but I defer to experts. I saw prices go up from when I first planned, so I think if you are again flexible, it's less of an issue, but if you don't want to miss a morning somewhere, book in advance."}, {"username": "Marg Ryan", "comment_text": "Might need to book your accommodation. The Ryder Cup is on in Rome during that time\nWe booked accommodation ages ago 😊"}, {"username": "Tracey Fairbrother", "comment_text": "We often book spontaneously if flights are cheap and we fancy a few days in Italy."}, {"username": "Ashley Spuhler", "comment_text": "You’ll be fine. We do trips on a whim all the time to foreign countries. We always find accommodations & I have 5 people in my family. You can easily find accommodations for just 2. My go to app is booking . com & there is always something avail on there. Just try to book at least 24-36 hours in advance."}, {"username": "Tracy Amin", "comment_text": "We went in October rented a car no tours basically did our own thing it was the best trip ever"}, {"username": "Lisa Atchison", "comment_text": "That is what my husband and i are doing now. We are I our early 40's and trying to stay around €150/night. We have booked at least two of our hotels/air bnbs as we were on the train headed to the town. We have a general itinerary for which towns we wanted to be at on what dates, but we have changed that up a bit as we go. We are having a great time and have not had trouble finding places to stay. We check reviews and pick the best rated ones that meet our needs. Hostles are a last resort and we have not had to do that yet. (Two weeks in) It's not always perfect but we are quite happy!"}, {"username": "Karen Baxter", "comment_text": "We only book our accommodation and make plans as we go"}, {"username": "Lynette Dine", "comment_text": "We went for the whole of last October\nDid not book\nSome places are about to close for winter and will be glad to have you"}, {"username": "Vic Mossa", "comment_text": "That’s the only way we travel. We book our first night when we arrive and our last night before we return home. In between we map out where we want to go. We rent a car and book our hotels or B&B’s as we go. Great adventure and have been doing this for 35 years. Never had a problem. Going to Sicily in November and doing the same thing."}, {"username": "Brittanie Neaves", "comment_text": "Hostels are fun!"}, {"username": "Kim Kirsten NeeMeglic", "comment_text": "Sept Oct being world cup months\nNo ways\nDont risk it!\nMany hotels already over booked"}, {"username": "Julie Ryan", "comment_text": "We’re going for 3 weeks sept/oct. Haven’t booked anything yet except for the flights there and back. I’ll book accommodation in the next few weeks but trains when we’re there. Been doing it that way for 40 yrs! All part of the adventure! Enjoy and don’t worry."}, {"username": "Virginia Routley", "comment_text": "Suggest you investigate accom on Booking.com just to get a sense of availability and prices for you dates. I just checked what we’d booked for Sept and prices have risen."}, {"username": "Yvonne Carreno", "comment_text": "Be spontaneous!!! It’s the best experience"}, {"username": "Rachael Richardson", "comment_text": "I would do this somewhere like America but not sure if it works in Italy ! I booked at least 6 months in advance"}, {"username": "Michelle Del Rosario-Brown", "comment_text": "If money is no object then more power to you! We had to book everything 6 mos in advance after shopping around and researching tours. Drivers are extremely expensive! One thing is that renown restaurants with cliffside views in Positano/\nAmalfi Coast were booked way in advance and we're such huge fancy foodies! I'd at least find plane tickets now unless your dates are flexible. Either way you choose, i believe some sort of stress exists. But it's all in the ways you chose to look at things. Wishing you the best time ever!!!"}, {"username": "Kylie Pritchard", "comment_text": "I’m in my 50’s and my husband in his 60’s. We just did our first trip ever and only booked Rome and Paris. The rest was by the seat of our pants. We rock backpacks and traveled on all sorts of transportation.\nWe mostly stayed in Airbnb booked the day before we arrived. We went for 3 months and only just got back. It’s crowded and busy but if you’re not expecting 5 star you can always find a place. We also stuck to a very tight budget"}, {"username": "Linda Spiers", "comment_text": "Family of 5 travelling in Sept/Oct too. Organising only some of our accommodation this coming weekend. We don’t like being locked in to too much either."}, {"username": "Amanda Richards", "comment_text": "Depends on where you are going. The season officially ends 31 October so busy until then"}, {"username": "Anita Benedickte", "comment_text": "I’m travelling through Italy now without any plans, and it has not been any issues getting accommodation anywhere. I only use Google maps when I arrive in a location, and there are always a lot of hotels and privat rentals to choose between. I have never traveled without plans earlier, but this has been a great experience 😊"}, {"username": "Sandra Maldonado", "comment_text": "In one of our trips to Italy, we never booked in advance. Every new town we got, we found a place to stay upon arrival. It was fun!"}, {"username": "Anne Davidson", "comment_text": "I suggest you book the first few days at least. I like to know where im going to sleep"}, {"username": "Kerry Green Richardson", "comment_text": "September 28-October 1 is the Ryder Cup in Rome. Hotels that week seem to be very crowded. They golf tournament could bring in 50k people per day"}, {"username": "Matthew Cawley", "comment_text": "We booked trains, coaches night before. Day trip of Rome the day before. You dont need to forward plan BUT it will help you to enjoy your time more when in Italy"}, {"username": "Joanne Nacson", "comment_text": "Why don’t you book accom with free cancellation as a back up?"}, {"username": "Sonya Alford Griffin", "comment_text": "Sounds adventurous. I'm also traveling with a group late Sept/early Oct. In particular, the Ryder Cup is in Rome 9/25-Oct 1 so finding accommodations near there may be more challenging. Enjoy!"}, {"username": "Debbie Potter", "comment_text": "For a trip like that you need to plan way in advance for your accommodations and tours. But, ive always been a planner for at least flights and accommodations.\nGood luck on finding a great place to stay."}, {"username": "Michael Widjaja", "comment_text": "I think Italy is less busy in those months,so you won’t need to book everything in advance,pre covid I travelled in October,arrived\nin Rome at night and the day after I left for Assisi,I went to termini around 10am to buy the train ticket for 2pm train…still available and still inexpensive\n\nI also booked the hotel in Rome and Loreto around a week before"}, {"username": "Penny Williams", "comment_text": "Everything is more expensive last minute. It's easier on the hosts if they know who is coming. Train pricing is dynamic and last minute tickets are more expensive than advance purchase. Maybe look at a Eurail pass for flexible train but pre-book a few cancellable rooms so you can cancel if plans change."}, {"username": "Atet GC", "comment_text": "Our trip is August 2024 and here we are planning already the reason why I am here. Everyone being helpful so far thank you."}, {"username": "Rick Rodriguez", "comment_text": "The quality if lodging won't be ideal."}, {"username": "Janine Emma Lucas", "comment_text": "If you find flights and hotels…everythi\nng else can be spontaneous"}, {"username": "Jenny Payne", "comment_text": "I’m going in October, and if you want to stay in a particular area I would book as it is busy all the time since Covid. I was in Italy this year in February (winter) and was busy🌻"}, {"username": "Marie Ring", "comment_text": "We book out months in advance but use hotels.com or booking.com. We have never had an issue and used them for years. We choose accommodations that are fully refundable until a few days before the actual check in date. This gives us the flexibility to cancel if needed. Also sometimes better options pop up as people may cancel. This holds a place for us and we can cancel if needed!"}, {"username": "Christine Caudill", "comment_text": "We are going in sept/beg October and I we have struggled with the accommodations we wanted- definitely busier this year after the typical tourist season."}, {"username": "Peter Morgan", "comment_text": "I think it’s important to book the first couple of nights in advance so that you are certain to be okay those initial days. After that, once you’re there, do whatever your heart desires. I bet you’ll be fine"}, {"username": "Judy Aswege Daley", "comment_text": "As a traveler that hates to be hauled around in a mob of people on a tour or have every second planned, I’m totally with you in allowing room for spontaneity. Personally I think many people don’t take the time to just be and soak up the culture."}, {"username": "Donna Dillon", "comment_text": "I wish you all the best. It seems half the world is in Italy at the moment. I’ve been booking for a year."}, {"username": "Wade Bailey", "comment_text": "I would not want to spend precious time in Italy looking on a phone to find a place when I could have done it before I left home."}, {"username": "Bea Kuckens", "comment_text": "The longer you wait, the less selection and more expensive. We have booked hotels, then watched the rates go up significantly with each passing month. As soon as we book our flights we decide on an itinerary and then start looking at lodging. Usually about 10 months out. We are booked for next spring and some of the Air B& B's have an \"early bird discount\"... and other bookings already. As soon as train schedules are released, we book those (usually two - three months out)."}, {"username": "Dianne Lloyd", "comment_text": "You may find places to stay but my only concern is that the best spots may be booked out and you will have to 'settle' for a lumpy bed in a dodgy location for the night. You may also find yourself spending half your travel day googling/\nwalking to find your next accommodation, particularly in the popular locations. I would book at least where you need 2+ nights and try to wing the rest. Enjoy your trip."}, {"username": "Jen Alexitch Rachow", "comment_text": "At the very least have the first few days accommodations reserved!"}, {"username": "Theresa Sorrentino Pagan", "comment_text": "Hotels were the first thing I booked, I then built the trip around that. I wanted to stay in specific areas. I did middle of the line as far as pricing went."}, {"username": "Lesley Johnson", "comment_text": "I’m going in October for a month and still haven’t booked all my accommodation but when I do book I have been able to find numerous options"}, {"username": "Joanna Ruvolo", "comment_text": "When I travel, I usually plan the “big events”. Flights, certain hotels/\nhostels, rental cars etc. But I let a lot fly. I got an awesome room in Sicily for €36 the day off. Right by the beach."}, {"username": "Diana Himes", "comment_text": "It’s great to be spontaneous if everyone agrees and are able to make decisions quickly. We like to have an itinerary as a starting point and give ourselves the flexibility to deviate. Nothing worse than everyone staring at each other trying to figure out what to do, where to eat etc. because they haven’t considered the options ahead of time."}, {"username": "Lynne Neeley", "comment_text": "We just returned from Luca and Montepulciano. No reservations u til the night before we arrived. Had a blast. We are in our late 60s. Go for it."}, {"username": "Tina Bohman", "comment_text": "Anybody know how busy Rome is after Christmas"}, {"username": "Marinor Gilanga Protacio", "comment_text": "Going to Italy in September. I am a planner. Booked our hotel in Hilton Sorrento last year and was able to get good rates. I love to research and plan in advance to get good deals. I opted to have a private transfer from Rome to Sorrento and found this company that gave us a good deal. I also booked our tours directly from Hilton Sorrento. Booked our train from Naples to Florence and booked our tour for one night then will take the train to Rome before heading back home. Hope and pray all goes well."}, {"username": "Susan Cantafio", "comment_text": "We have been booking for the last 6 months but doing two other countries as well as Italy"}, {"username": "Dave Conroy", "comment_text": "I'm heading to Naples in mid-October. I have been tracking accommodation. A lot has gone. The very specific area I want to be in had a load of options 2-3 months back. Now the options are all a bit away from transport. so it adds to the hassle. I have a place booked with free cancellation but I still look as I'm always after the best location, price, and vibe. I would book TBH, or you'll end up paying for more expensive places, which may be Ok for you or not, and places less convenient. I have also booked a long-distance fast train. On several timed services when I specifically wanted to go there were not many seats available. Again, if you want to maximise your convenience then book ahead. If you're happy to rock up and catch whatever, then you can wait. I am like you and like to be flexible. For some things, it's just less hassle big picture-wise to book."}, {"username": "Eileen Lonergan", "comment_text": "I always travel spur of the moment I only book first night and last night and fill it in as we go along toured Puglia just this May no problems"}, {"username": "Starla Dawn", "comment_text": "I planned my detailed trip to Italy with my teenaged daughter last month after deciding to go just 4 weeks prior. It all worked out perfectly!"}, {"username": "Alessandro Battxi", "comment_text": "I never book in advance."}, {"username": "Robyn Lawson", "comment_text": "Just consider….. You will pay more booking at the last minute."}, {"username": "Karyl Engler DeMonte", "comment_text": "If you don’t have hotel rooms, good luck. We started booking in June for italy/Sicily in September/\nOctober and had a hell of a time finding good accommodations."}, {"username": "Lucrezia Folger", "comment_text": "I book the 1st few days, and then a day or two before I move to a different location. Sometimes I arrive in a place and walk into hotels, look at the rooms and then decide. Never \"freak-out\"."}, {"username": "Milana Paul", "comment_text": "A lot of hotels offer free cancellation, that works well in case your plans change allowing flexibility while also securing a place to stay."}, {"username": "Bonnie Rodgers Henderson", "comment_text": "I spent 11 weeks in Europe this year. I only booked a week or so in advance to create flexibility in travel plans. I had no problems. I would never book that far in advance. I like to be able to adjust my trips based on being able to make last minute changes. Been doing thus for 40+ years without issues on 4 continents"}, {"username": "Terrie Jackle", "comment_text": "Ryder Cup on Rome and Fashion Week in Milan. I'm traveling the same time frame as you."}, {"username": "Monica Sucato", "comment_text": "If you are very flexible in terms of when, how AND where, no problem!"}, {"username": "Paul Anderson", "comment_text": "We are In Slovakia now and have been traveling for two months now. We have general plans but nothing booked. It has given us freedom to change plans as we go. We are in our 60s and found it to be very easy. We have a car so that gives us even more freedom. It is super easy to find accommodations on the internet."}, {"username": "Ruth Pellow", "comment_text": "We fly to Italy in 3 weeks and only booked about 6 weeks ago...."}, {"username": "Christopher A. Johnson", "comment_text": "You will always find something available on booking.com, but it might not be exactly where or what you want."}, {"username": "Diana Smith", "comment_text": "Hi, it looks like you don’t have an itinerary, therefore should be easy to find accommodations.\nIf you want to visit Venice book a hotel in Vicenza, only half hr away from Venice by train & half the price. If you want to see Florence but you can’t find a place to stay go to Siena or even Bologna. Trains are so convenient to travel with…You should be fine in Rome, is a big city but just in case… we stayed at the Memphis Hotel very clean and central. Have fun…:))"}, {"username": "D'Anna Hohe", "comment_text": "I’m sure you’ll be fine but likely won’t have the choices you might have had if you had booked in advance, so possibly more steps to climb, lack of AC, further from city center, etc. and you may not be able to find space on the fast trains, so you might have to take the regional ones. It really comes down to your comfort level and flexibility."}, {"username": "Bob Dook", "comment_text": "I'm in my seventies and I wing it. Not much help, I know, but no need to panic. Travel light."}, {"username": "Susan A. Jasper", "comment_text": "Only my humble opinion but tourism has increased greatly in Italy since the pandemic, I would have a reservation in place for at least the first few nights so you aren't scrambling. Then, decide the rest while you're there."}, {"username": "Silvia Urbinelli", "comment_text": "Don't worry. You'll be fine. No need to book in advance."}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "September is the new Summer. Quite busy. October thins out. I book lodging (and still tweak) early in my planning mainly because I’m selective of where I stay (location, style, price, but above all…experience)\n. If you’re good with simply cleanliness, you’ll have no problem finding a decent place. Spontaneous travel is a mindset! I use booking dot com religiously for lodging. Sounds fun! Enjoy!!"}, {"username": "Nancy Jane Oster Burleigh", "comment_text": "This post gives me major anxiety! Ha! I’m such a planner. We are going first 2 weeks in October, and have been booking since February.\nGood luck!"}, {"username": "Betty Stilt", "comment_text": "You can always find a hotel room near an airport or train station."}, {"username": "Barbara Coldren", "comment_text": "Put your faith in God and you will have a roof over your head❤️❤️🎶"}, {"username": "Colleen Jennings", "comment_text": "Go for it! Book as you normally do, you’re sure to find accommodation where you want to stay. Happy hols!"}, {"username": "Dee Scandone", "comment_text": "We go to Sorrento every year and have to book a year in advance. It’s very popular."}, {"username": "Valerie Collanton", "comment_text": "September and October are popular months for travel to Italy. Especially September. But October was still fairly crowded when I was there last year. Especially in Rome. If you are planning on going to popular spots you should book in advance. Otherwise you may find nothing available or rooms that are less than desirable"}, {"username": "Richard Meek", "comment_text": "Depends if you have your heart set on specific things/places, most overplanners do."}, {"username": "Dianne Kelly", "comment_text": "I would book accommodations for sure!"}, {"username": "Stephanie J Stevenson", "comment_text": "Honestly, I hate traveling with an itinerary. It’s not like you are traveling with an entourage."}, {"username": "Karen Pedersen", "comment_text": "16 of us showed up in Rome 2 weeks ago to receive an email the Air B&B had double booked on the morning we arrived. Fortunately we found alternate accommodation in the middle of Rome to fit all 16 of us."}, {"username": "Kim Hosking", "comment_text": "You will always find accomodation- but if you have a particular place in mind and it’s popular book it - been booking for a trip in 2024 and already a couple of places booked out."}, {"username": "Reina Ve Del Oeste", "comment_text": "I went on a spontaneous trip last september. Had no issues finding bookings. Stayed at Ibis"}, {"username": "Fetchin Gretchen", "comment_text": "All the good places book quickly so you may have tro6ble with the spontaneous approach. But if you get a base for the duration and travel from there you can be more spontaneous or flexible."}, {"username": "Rhona OConnor", "comment_text": "I just booked my trains 2 days in advance.... But then I was not in Rome, Florence ect as everyone here appears to be. I had no problem in late June."}, {"username": "Alicia Cox", "comment_text": "Spontaneous & flexibility is great & I likely would not book a year ahead myself, but I would definitely start booking now for a trip that is 2 months away. We just googled & read reviews, but that was pre-COVID. It seems last year & this year have been travel on steroids 🤣. A post just today gave recs for several air bnb’s.\nGood luck & HAVE FUN!"}, {"username": "Alejandro Gabriel Valenzuela Anghileri", "comment_text": "Living in Italy, every time I decide to... go to Italy I book at the last minute, and always find a place to stay 😆"}, {"username": "Annette Sparks", "comment_text": "You are more adventurous than me. We are there August and September and have had our accommodation booked for 9 months. Enjoy you trip!"}, {"username": "Peach Panfili", "comment_text": "How refreshing - travel is such a wonderful adventure. The best travel experiences I’ve done and those from which I’ve learned most have been the ones with the least amount of fore planning."}, {"username": "Doug Burke", "comment_text": "We've spent 40 years traveling spontaneously and have never had a big problem. Small problems from time to time but never big. We've lways found a room but we go in the off season...April or October.....don\n't what it would be like in August. We only line up rooms ahead of time for the first and last nights."}, {"username": "Steve Grossman", "comment_text": "I think you can travel.\nWithout reservations in October. But you definitely will need them in september"}, {"username": "Lynn LaColla Barnsback", "comment_text": "Italy is HOT and I don’t mean temperature. I love the serendipity of travel but I only get a little each year due to Hubbys position and I don’t want to miss the big sites because I did not plan and there are no tickets left. It took me 3 trips to France to see Versailles and 3 to London for crown 👑 jewels due to precious poor planning. I am to old to\nGo back everywhere to see things I missed! I don’t want to be stuck waiting for a train for most of the day because I didn’t plan. Also I like day tours and private tours. Need to plan for these too. The flexibility comes from the unscheduled time in each day on my trips."}, {"username": "Celia Minnucci", "comment_text": "We were in Italy in July and parts of our trip were flexible. We booked some Rome accomodation while we were on the bus & 30 minutes before we arrived. They were also discounted."}, {"username": "Marina Belardo Johnson", "comment_text": "Depending of where you want to stay ! I would book now and plan … small b&b the ones that makes you save money they fill up quickly. Hotels with many rooms they will have space but more expensive."}, {"username": "Francine Lanham", "comment_text": "Dean Stanmore"}, {"username": "Heather Baumann", "comment_text": "I am normally a very spontaneous traveler and will book hotels as we are driving to the next city lol but I started looking and the hotels looked rough price wise so I booked what I could this time around! We are going mid august though so super crowded time frame."}, {"username": "Risa Seelenfreund", "comment_text": "Maybe book a hotel for your first night only? That way you know you have a place to sleep after a day of travel."}, {"username": "Phyllis Snyder", "comment_text": "Italy this year is seeing a tremendous increased demand for tourism! However, if you can narrow down where you want to stay and for how long that would increase probability in finding accommodations.\nIf you’re looking at lesser visited destinations your in better position to find accommodations-\nand booking train tickets for popular destinations might be a problem- but I think that part can be worked out."}, {"username": "Barbara Bastianini", "comment_text": "I’d like to tell you everything will be fine. But honestly I can’t. There was a time in the past where I traveled spontaneously without hotel reservations. (I’m fact I did it for a full three month time period once.) But the reality in these days of mass tourism can make that very difficult. You might be able to find spur of the moment accommodations but depending on your particular destinations it’s more likely that you won’t. It’s also probable that the few available rooms will be at the extreme edges where fewer people travel. Either the bottom level, cheapest places where most people do not want to stay or the highest priced luxury ones that most people can’t afford could be your only options. You could easily be faced with the choice between a dingy, dilapidated. dirty room or one that costs a few thousand dollars a night. With the third possibility that there might be no room at the inn at all. To me that’s just very stressful.\n\nI’d suggest formulating a general itinerary that includes the number of nights you think you’ll need in each location. I’d book a room in those places but leaving the days unscheduled to have some flexibility in exploring. Of course that runs the risk that you might not be able to gain admission to a few attractions, especially in the more popular destinations, but that’s easier to deal with than not finding a hotel room and might strike a good balance between over planning and spontaneity.\n\nI know from experience that spontaneity doesn’t feel so great when you can’t find a place to lay your weary head at night.\n\nAs far as trains we’ve driven for the past 30 plus years so I haven’t taken the trains in ages. But I know many routes require reserved seats now. So that might be something to consider, too.\n\nWishing you luck!"}, {"username": "Felicia Melo", "comment_text": "I would start looking now. The longer you wait the less options available and the more expensive"}, {"username": "Graham Sherlock", "comment_text": "Book your first week and take if from there, I travelled 3 months in Italy last year and only booked my next lot of accommodation the day before I left."}, {"username": "Mac Lacková", "comment_text": "You would be more than okay. We actually did it yesterday in Rimini, walked into the hotel and booked the room, and it was cheaper than it was a month ago when we thought about booking it. Same 10 days ago in Turin. Have a fantastic time 🙂"}, {"username": "Anita Clayton", "comment_text": "I have never seen Italy as busy as this year it's as though the whole world has decided to holiday there. We only booked Sorrento accommodation in March for May. In June I booked our Lucca accommodation in February but booked as and when we decided on our next destination, Florence, Milan and Genoa were booked a couple of days before. Same with trains and a flight home."}, {"username": "Janet Messanelli Bozzone", "comment_text": "Tourism is up dramatically everywhere in Europe. I would not risk not finding a spot (check previous posts on people not be able to find accommodations when canceled), so I would at least book cancellable reservations in advance. Then you can search around if your plans change. You can wing it for the trains and some tourist attractions."}, {"username": "Roland Trego", "comment_text": "If you're not on a tight budget, I don't see any problem. However, good accommodations get fully booked early for a reason. The mediocre and bad places are what's left over, and there's a chance you will end up paying last-minute high prices for them."}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "I think you'll be fine. We actually just had to add on a night to one of our stays this past weekend in Pompeii and had no trouble. It's really nice not to be locked down to a time schedule."}, {"username": "Patricia Condon Goldberg", "comment_text": "Last October my husband and I only had a one way ticket to Rome. We stayed 5 days then decided where to next. And next after that until we decided to fly home. It was the most fun we ever had."}, {"username": "Brian McGraw", "comment_text": "I’m just gonna be completely candid with you.\n\nYou’re going to the most popular international destination in the world.\n\nDuring ￼wine crush.\n\nAnd you’re expecting to find accommodations easily.\n\nYou probably will, but you’re going to pay out the nose for it.\nAnd it won’t be nearly the level of accommodation and service you expect.\nOr the experience that others who planned ahead are having.\n\nI think your obsessive need to be adventurous and not plan anything is a little ridiculous.\n\nWhen people tell me they had a bad time in Italy, this is usually how it starts\n\nThe best hotels are already sold out for Sept and Oct."}, {"username": "Tyffany Tubajon", "comment_text": "Depending on where you're going and what your budget flex is like. . for example, I booked Amalfi, as accommodation in my price range & my \"musts\" (under $500/nt) was almost NIL."}, {"username": "Jenny Lane", "comment_text": "Hi! I am here now, solo. I booked about 3-4 weeks out and have been very pleased with my accommodations.\nGo for it!"}, {"username": "Joe LaLonde", "comment_text": "Normally I book far in advance with Airbnb, but while in Rome a couple weeks ago I decided to rent a car for a few days and check out some of the smaller towns/villages in Lazio. I winged it on the hotels and had no problem at all. The first ones I went to in both Orvieto and Tivoli had availability and both were right around 90€ a night, which I didn’t think was bad given the season and their locations."}]}, {"id": "2198234097242335", "text": "Gday what combination of train, plane and car is the best, less stressful and quickest way to get from Sorrento to Saturnia? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2198234097242335/", "likes": 0, "comments": []}, {"id": "2200344327031312", "text": "Fly virtually to Sicily! Our expert guide will lead you on a virtual journey through this beautiful island, to explore the most beautiful places of Sicily.\n\nJoin our virtual experience: आणखीhttps://nextstop-italy.com/virtual-tours/best-of-sicily/\n\n#medievalart #italytravel #italyiloveyou #virtualworld #italytrip #vacationmood #sicily #sicilylove #sicilyitaly #sicilytravel #sicilyessence #sicilytourism #sicilypictures #TAORMINA #taorminasicily #cefalù #cefalusicily #ValleyoftheTemples #syracuse #ortigia #ortigiaisland #palermo #palermo #archaeology", "link": "facebook.com/groups/1373361046396315/permalink/2200344327031312/", "likes": 2, "comments": []}, {"id": "2156274151438330", "text": "Masseria Seppunisi Tour - Mozzarella and Burrata experience\nIt rises in the Murge plateau between the Itria Valley and the gates of Salento, it has origins of the sixteenth century. Its business has four… आणखी generations that for decades has preserved the traditional spirit of the Apulian farms. The protagonists of this zootechnical reality are the cows. Every day they are milked and their high quality milk, used in the company's dairy, becomes the main source from which it all begins. The commitment of expert hands in the production of latex and cheeses at km0, guarantees our customers freshness and goodness.\nRead more about Masseria Seppunisi Tour - Mozzarella and Burrata experience - https://www.viator.com/tours/Taranto/2-Hour-Private-and-Guided-Visit-to-Mozzarella-and-Burrata/d28840-359263P1?pid=P00070587&mcid=42383&medium=link&medium_version=selector", "link": "facebook.com/groups/1373361046396315/permalink/2156274151438330/", "likes": 5, "comments": []}, {"id": "2199777617087983", "text": "Please could I get some advice about getting from Genoa to Sorrento🙏🏻🙏🏻", "link": "facebook.com/groups/1373361046396315/permalink/2199777617087983/", "likes": 3, "comments": [{"username": "Rachel Bradfield", "comment_text": "The Rome to Rio app is good for travelling options. Train via Rome and Naples but quite a long journey 7hrs"}, {"username": "Anita Clayton", "comment_text": "Fly, that’s a long train journey."}, {"username": "Miyuki Kanno Paul", "comment_text": "As for public transportation,\nthere are two options. You have to get to Napoli Centrale by going:\n\nOne is to take a high speed train from Genova(either Principi or Brignole) to Roma Termini, transfer to another high speed train to Napoli Centrale.\n\nAnother option is to take an Intercity or high speed train to Milano Centrale, transfer to another high speed train to Napoli Centrale.\n\nOnce you have reached Napoli Centrale:\n\nOption 1\nGo underground path to Piazza Garibaldi/\nCircumvesuviana station. About 5 minutes on foot. Take Circumvesuviana\nSorrento Line to Sorrento.\n\nOption 2\nTake a shuttle or taxi to Molobeverello port and catch a ferry to Sorrento.\n\nSince it’s a long distance, it will be a long day. Get to the station as early as possible. And I highly recommend purchasing high class of service on both high speed trains. It’s worth paying for"}, {"username": "Vinny Diorio", "comment_text": "On FACEBOOK?"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Rome2Rio.com"}, {"username": "Patti Koscal", "comment_text": "Swim???😜"}, {"username": "Claudia Amp", "comment_text": "Maybe a flight from Genova airport is best option if you find it. You have to change trains and that’s kind of a hussle especially if you have delays and miss connections. There’s a direct train from Genova to Napoli (Intercity, not Freccia high speed) and it’s about 8hrs long journey."}, {"username": "John Bruckman", "comment_text": "Train to Naples… Ferry to Sorrento. Easy."}, {"username": "Tony Nestola", "comment_text": "Look up “Rome to rio”app."}, {"username": "Susan Stevens", "comment_text": "Thanks for the info. Really appreciate the help🤗"}, {"username": "Grg Cozzetto Oetterer Mra", "comment_text": "I suggest the site\nwww.rome2rio.co\nm"}, {"username": "Barbara Hughes", "comment_text": "Train.or plane from Genova to Naples, then transporter to Sorrento"}, {"username": "Robin Burrell", "comment_text": "Train. Will go from Genoa to Rapallo, change train to Rome, change to high speed to Naples. Then either take the train to Sorrento, or a bus or private transport"}, {"username": "Jono Roland", "comment_text": "Trains are good to Naples or Salerno and various ferries are good after that. Local buses and trains travel from these places too but you can get private drivers from the ports. I used Welcome Pickups app. 🤓❤️🇮🇹"}, {"username": "Annabella Pojer", "comment_text": "Trains"}]}, {"id": "2199796087086136", "text": "We are going to travel around Italy by train. Is there a good app for looking at regional train schedules and buying tickets?", "link": "facebook.com/groups/1373361046396315/permalink/2199796087086136/", "likes": 7, "comments": [{"username": "Cindy Hall", "comment_text": "Trainline"}, {"username": "Pietro Adami", "comment_text": "Trenitalia app"}, {"username": "Miyuki Kanno Paul", "comment_text": "Trenitalia app"}, {"username": "Chris N Lynn", "comment_text": "trenitalia.com/\nen.html"}, {"username": "Rhona OConnor", "comment_text": "I used Trainline.... No problem"}, {"username": "Dave Conroy", "comment_text": "Trainline is very clear and simple"}, {"username": "Sam Mah", "comment_text": "Use Trenitalia. It is the local train service providers site. If you cannot download the app you can still register with their online service to book."}, {"username": "Connie Wilson", "comment_text": "TrenItalia\n\nhttps://\nwww.trenitalia.c\nom/en.html"}, {"username": "Gillian O'Callaghan", "comment_text": "I used Trainline to book 13 trips in Italy. I liked how it covered all trips, made booking easy, kept tickets in chronological order, sent emails too and the QR codes are great."}, {"username": "Bill Casper", "comment_text": "Trainline or Trenitalia."}, {"username": "Jeidy Christina Duarte", "comment_text": "Trenitalia Frecciarossa e Italo Treno there are two high-speed trains in Italy, you can look on the site, (Frecciarossa.i\nt and italotreno.it) if you want to visit each region there is the regional train (Trenitalia), But always go first to the stations, unfortunately regional trains in Italy are very late, i recommend it so you can organize."}, {"username": "Matthew Cawley", "comment_text": "Trainline, trev and italo to buy. Googlemaps to plan it out"}, {"username": "Benedetta Vanni", "comment_text": "Trenitalia.com (or equivalent app). Trenitalia is the main train operating company in Italy (both high speed and regional).\nItalotreno.it is another company's website for high speed trains only."}, {"username": "Frank Hunt", "comment_text": "Both Trainline first and Trenitalia apps, when one doesn’t pick up your destination often the other will."}, {"username": "Richard Turner", "comment_text": "When I use the trenitalia app it only gives me travel solutions for the next day (and it warns me that it is travel for the day after I selected). I would have to select the day before I travel to get the day I need. Crazy. Any thoughts?"}, {"username": "Gay Bell DiBartolomeo", "comment_text": "Gayla Faye Bell"}]}, {"id": "2199798953752516", "text": "How hard is to break 100 euro bills?", "link": "facebook.com/groups/1373361046396315/permalink/2199798953752516/", "likes": 28, "comments": [{"username": "Meg Roberts", "comment_text": "Aidan Dick"}, {"username": "Gregory Hawkins", "comment_text": "Go to a really nice restaurant! Other than that get smaller bills!"}, {"username": "Nancy Brennan Carrow", "comment_text": "Our hotels were able to break them but I recommend getting smaller euros"}, {"username": "Anne Dominijanni-Lemons", "comment_text": "Carry only small denominations. W￼hen I was in Capri I had to go to a local bank to break my 100s."}, {"username": "Reshma De Cruze", "comment_text": "We had 100’s and 50’s and didn’t have any issues"}, {"username": "Beverley Bedford", "comment_text": "Never had any problem with 100's"}, {"username": "Tracy Glasgow", "comment_text": "I even felt bad breaking 50 euros"}, {"username": "Jayne Dawson Meyer", "comment_text": "No issues for us."}, {"username": "Roland Trego", "comment_text": "People don’t generally want to take them."}, {"username": "Achim Marke", "comment_text": "You mean to exchange? At any serious and professional destination of sales and services"}, {"username": "Shelley Howard", "comment_text": "Go to supermarket"}, {"username": "Andrew Rubery", "comment_text": "Don’t use cash use a debit card or Apple Pay."}, {"username": "Bill Reynolds", "comment_text": "Give them to your wife and see"}, {"username": "Melanie Matthews Stuprich", "comment_text": "Depending on how much your purchase is most places are going to struggle to give you back change for such a large bill. Go to a bank and see if they will trade it for smaller bills. Or wait until you are out to dinner with a bill close to that or over and use it there."}, {"username": "Fábiocska van der Olasz", "comment_text": "They're not that much stronger than printer paper"}, {"username": "Donna Holt", "comment_text": "I ordered from my bank about €200 in €5s and €10s. Might be a couple of €20s in there. Will used credit cards and Google Wallet as well."}, {"username": "Brian McGraw", "comment_text": "We carry some cash in Italy.\nMixed to 100s.\nRestaurants usually take the larger bills and some will give a cash discount.\nFor Tips, shops, markets and bathrooms, it’s good to have some cash on hand.\n\nMost purchases, I make with my Revolut card hooked up to Apple Pay.\n\nI recommend setting up a Revolut or Wise card well in advance of your trip.\n\nRevolut and Wise have the added convenience of being able to convert to currency to Euros instantly.\n\nDon’t use your primary debit or credit cards when traveling abroad.\nMove money into a stand alone account, as you need it.\n\nIf you get scammed, they only got what’s in your Revolut account rather than gaining access to your checking.\n\nI don’t even take my debit card on the trip."}, {"username": "Jeanne Mistler Buring", "comment_text": "Small bills, exchange them for 1 and 2 Euro coins when you can"}, {"username": "Jodie Grzeschka", "comment_text": "I used my $100s at supermarkets. They see plenty of cash so no worries for us."}, {"username": "Joey Clark", "comment_text": "I asked for smaller bills when I bought euros from my bank before our trip and ended up with like €800 worth of €100’s. 🤦‍♀️ But we didn’t have any issues breaking them during our trip."}, {"username": "Rosemarie Di Bella-Torley", "comment_text": "We just returned from a 9 week trip and took cash including 100 euro bills. I had no problem at restaurants etc paying in cash with the larger denominations."}, {"username": "Jennifer Eads Kegley", "comment_text": "I struggled a bit with this. Most places (understandbly)\ndidn't want to/couldn't made change. My bank only gave me 100s! I found large stores and grocery stores were most willing. When we went to fast food places or restaurants and spent more thnlan 50€, it was easier to break them there."}, {"username": "Augusta Barna", "comment_text": "200€ and 500€ are now impossible to break, unless you go to a bank (but you’ll have problems there too).\n100€ is pretty easy, remember that (almost) everywhere they should take credit card. 😉"}, {"username": "Maria Antidormi Corica", "comment_text": "Not good. I learnt my lesson last time I was in Italy. This time I asked for 5, 10, 20 and 50 bills. I’ve still got a lot of 50’s left if that gives you a clue"}, {"username": "Natalie Baruch", "comment_text": "We had 50s and 100s and had no problem using them."}, {"username": "Crystal Waltz", "comment_text": "We used our 100 euro bill (bank gave us one when we got euros) on our 100 euro evening gondola ride."}, {"username": "Sipra Roychoudhury", "comment_text": "You would need to pay city tax in cash at the hotels"}, {"username": "Monica Roman-Fazio", "comment_text": "Never had a problem Breakin a 100"}, {"username": "Caroline Nasrin Afzal", "comment_text": "I use €100 all the time. I have never had an issue. More with a €200. And I think 500 is out of circulation"}, {"username": "Christie Grant", "comment_text": "Here now and not a problem at all especially paying for meals"}, {"username": "Juliet Lee", "comment_text": "Don’t take cash at all"}, {"username": "Krissy DaRusso", "comment_text": "I just bought a 39€ sweatshirt and took the opportunity to pay with a 100€. I had to take the bills my bank had to offer me!"}, {"username": "Frank Dragna", "comment_text": "I took 100 all the way down to 5's. That is what Wells Fargo fedexed me. Worked fine. If I felt the need to have a smaller bill, I did it at the front desk. Did enough dining out, shopping etc.. To easily use the 100E notes."}, {"username": "G.Y. Harvey", "comment_text": "facing the same problem, my bank gave me mostly 100E bills and just a handful of 10E ((("}, {"username": "Amanda Molinelli DuAime", "comment_text": "My hotel broke one here or there for me"}, {"username": "John Rodriguez", "comment_text": "You can go broke in 15 secs! So pretty easy! Lol"}, {"username": "Emma Osbourne", "comment_text": "It’s very difficult to break them. They seem to have a difficult time breaking 50s and 100 bills."}, {"username": "Bill Elias", "comment_text": "Any reputable hotel you stay at should be able to break it for you."}, {"username": "Dylan Reeves", "comment_text": "Not hard. You’ll be fine."}, {"username": "John Barone", "comment_text": "All the shops will pretend that they can’t make change no matter what denomination bill you give them, it’s best to have a variety of bills and coins with you."}, {"username": "Peter Apostolo", "comment_text": "Rock, paper - no scissors!"}, {"username": "Giovanni Pianigiani", "comment_text": "It's easier with a 75€ bill"}, {"username": "Tomas Krivanek", "comment_text": "They look strange at 100€. Everything above is moreless nogo🤦‍♂️🤦‍♂️🤦‍♂️🇪🇺🇪🇺🇪🇺"}, {"username": "Ian Fawkner", "comment_text": "About as hard is it is to get them !"}, {"username": "Christopher Brown", "comment_text": "We had a few and had no problems in restaurants using them."}, {"username": "Rene Sosa", "comment_text": "If you buy something for €99.95 I think you’ll be good."}, {"username": "DeAnna Pulliam Like", "comment_text": "I didn't even know there were 200 & 500 denominations! 🤑 Thankfully, the bank machine only gave me 50s as the highest denomination and 20s as well. I would have preferred all 20s. I didn't really like having to use the 50s for smaller purchases. I would try to use those at the grocery stores where you insert the bill in a machine and it has an automatic change dispenser. 😊"}, {"username": "Rita Kanten", "comment_text": "Pretty much impossible. Maybe at a bank but not many retailers will break it."}, {"username": "Jolie Carbone", "comment_text": "Very much depends where you do it and what time of day you do it. If you give it to a small shop early in the morning they might have some complaints (they don’t have the change for it yet) but generally grocery stores, malls, big brand names will break one for you no problem. I suggest you get something smaller just to be safe."}, {"username": "Todd Hines", "comment_text": "Folks in the cities selling bracelets will break em for ya 😉"}, {"username": "Melissa Jane DiMola", "comment_text": "I’m pretty sure they are very easy to rip"}, {"username": "Deb Myers", "comment_text": "Banks are open from 10 am to noon, when you can find a BANK!\nATM fees are expensive"}, {"username": "David Gawler", "comment_text": "Cashless society is becoming the new norm. No cash only card."}, {"username": "Linda Miller", "comment_text": "Good luck with that!"}, {"username": "Carolyn B-Coakley", "comment_text": "Hardly any one wants them. They will tell you it’s no good! Beware!"}, {"username": "Josef Maciejewski", "comment_text": "Took 500s for convenience and even the bank would not touch them"}, {"username": "Heather Bovard", "comment_text": "The banks gave us a few hundreds and it was not easy to use in lots of places"}, {"username": "Leila Jane", "comment_text": "There used to be a problem with counterfeit Lira back in the 80's when I lived there for a couple years. I was once given a counterfeit 50,000 Lira note (worth approximately $25 at the time) in change for a bigger Lira note when I bought some items at an open air market. Then I went to another vendor to buy something else - using the Lira I had just been given. They accused me of using counterfeit money and screamed at me. I'm lucky they didn't call the carabineri (local police). It sounds like the euro notes are better regulated and maybe not as subject to counterfeit scams. Probably Italian vendors are still shy of the larger denominations, though, after what was a problem in the past."}, {"username": "Clint Madsen", "comment_text": "No problem buying jewelry!😎"}, {"username": "Sara Zangenberg", "comment_text": "Depends on how much Italian leather you plan to buy. 😉"}, {"username": "Chris Vilsack", "comment_text": "50s are better. But if you're in the tourist spots, and spend a decent amount, they won't care"}, {"username": "Maria Leitner", "comment_text": "Here now, hotels will give you change, if they have it."}, {"username": "Jeanette Smith Floyd", "comment_text": "20’s are best"}, {"username": "Lina Stump", "comment_text": "Umm 🤔"}, {"username": "Lina Stump", "comment_text": "Lina Stump"}, {"username": "Marion Albers", "comment_text": "Almost all places"}, {"username": "Larry Dash", "comment_text": "Easy they rip up easy!🤣"}, {"username": "Joe Guzzi", "comment_text": "A lot easier than a 500."}, {"username": "Carmine Napolitano", "comment_text": "I did not get the happiest looks when I tried to use my fifties"}, {"username": "Vasthi Cheddar", "comment_text": "warning, several places did not have enough change for my 20's when buying 16.50 worth of gelato 🙂 or small change."}, {"username": "Dymphna Clohessy", "comment_text": "Best have €50s, some stores may not take €100 notes."}, {"username": "Luigi Albarella", "comment_text": "It's harder to keep them;)!"}, {"username": "Edmond Nolan", "comment_text": "Don’t get 100s , 200s or 500s only get 10s 5s 20s 50s"}, {"username": "Maria Ariano", "comment_text": "Give it to me, I'll show you"}, {"username": "Clarissa Rava", "comment_text": "I am italian and i never used a 100 bill in my whole life. Better keep 5,10,20 and 50."}, {"username": "Emily Kelley Arrowood", "comment_text": "Hard. Take lots of 1, 2 and 5 euros."}, {"username": "Jessica Biggs", "comment_text": "No one every wants my 50s. I try to break those when I’m in a grocery store with an automatic change dispenser though"}]}, {"id": "2199740863758325", "text": "Can anyone recommend hotels in Rome for next July for a few nights?", "link": "facebook.com/groups/1373361046396315/permalink/2199740863758325/", "likes": 3, "comments": [{"username": "Whitney Meyers", "comment_text": "Hotel trevi"}, {"username": "Lello Ercole Di Baia", "comment_text": "The BlueHostel"}, {"username": "Frank Dragna", "comment_text": "Sini Bernini Bristol. We had a great stay there in late May before moving onto the Borgo Egnazia in Puglia. Breakfast was amazing."}, {"username": "Grg Cozzetto Oetterer Mra", "comment_text": "Hotel de Russie"}, {"username": "Grg Cozzetto Oetterer Mra", "comment_text": "Hotel Raphael"}, {"username": "Lynn Francisco Casella", "comment_text": "Hilton Cavalieri THE BEST"}, {"username": "Bea Kuckens", "comment_text": "Do you have a budget in mind? General location? How many people?"}, {"username": "Ted Briggs", "comment_text": "Grand Hotel Plaza"}, {"username": "Joanne Robertson", "comment_text": "Palazo navona, great hotel"}, {"username": "Joanne Robertson", "comment_text": "Palazzo navona, great hotel"}, {"username": "Frannie Kaplan", "comment_text": "Bnb is OK or just hotels?"}, {"username": "Lori Mongillo", "comment_text": "St. Peter Sweets Vincenzo is amazing. Three minute walk to Vatican. Breakfast is included!"}, {"username": "Kateryna Fedyushkina", "comment_text": "De Russie"}, {"username": "Kateryna Fedyushkina", "comment_text": "Or Hassler"}, {"username": "Ken Vecchia", "comment_text": "Massimo deseglio"}, {"username": "Penny Bellofatto Westberry", "comment_text": "We enjoyed the W."}, {"username": "Amber Frick", "comment_text": "We stayed at The Hive, near the train station!"}, {"username": "Steven Daubert", "comment_text": "Grand Hotel Fleming by OMNIA hotels"}, {"username": "Mary Bagdasian", "comment_text": "Hotel near airport?"}, {"username": "Maria Vamva", "comment_text": "The code hotel, next to Spanish steps"}, {"username": "Raymond Capkin", "comment_text": "Tule Inn..my daughter stayed there last night and gave it great reviews...locat\nion and price terrific."}, {"username": "Jessica Palladino", "comment_text": "Hotel Alexandra was great. Easy to walk to all the things and super friendly staff"}, {"username": "Dorothy Bush", "comment_text": "Hotel Diocleziano Rome. Great hotel."}, {"username": "Tommasina Mele", "comment_text": "HiSuite"}]}, {"id": "2199840453748366", "text": "Just found this wonderful website! I’m planning a trip through the Puglia region and then want to hop over to Croatia as well. Anyone know of a planning website like this one for Croatia?", "link": "facebook.com/groups/1373361046396315/permalink/2199840453748366/", "likes": 5, "comments": [{"username": "Frank Dragna", "comment_text": "Puglia? Look into the Borgo Egnazia. Ruined us for any other property."}, {"username": "Jeidy Christina Duarte", "comment_text": "Puglia is great, i can recommend Bari, Altamura (a very nice little village), Otranto, Polignano a Mare, Alberobello and if you can see the Salento sea and take a dip even better!"}]}, {"id": "2199848917080853", "text": "Boungiorno!!\nI just returned from a 3 week trip which included 11 days in Italy and to pay it forward, I will share my experience, what worked and didn't work. We flew non-stop Miami-Zurich. Visited family and then flew ITA Zurich to Rome.\n\nROME\nWe arrived from Switzerland, a Schengen country, so for anyone wondering, there is no need to go through passport control once in the Schengen region. We traveled this leg of the trip COO and personal bag.\n\nWe had a private transfer prebooked for 60 Euros which took us from FCO to the hotel in the area of the Pantheon.\n\nWeather-hot, but manageable. The first few days in Rome were delightful. Last day got into the 90s but only 28% humidity, so this FL girl was fine. Clocked on average 20-21K steps daily.\n\nRoma is busy, crowded, dusty and WONDERFUL!!\n\n-Vatican (early admission with breakfast). Booked directly through the official website. By 7:30, the lines were long including the skip-the-line line, which moves fairly fast once the third party tours go in. If you book directly, there is a separate line with no wait, as they let you in up to 15 minutes prior to the timed ticket. There is another line inside to exchange your voucher for actual tickets. That moved fairly fast.\n\n-Saint Peter's Basilica- the lines are long to get in. If you go to the Vatican Museum you can go in after the Sistine Chapel. We didn't, (my mom was done walking at that point :) )so we decided to go the next morning. No lines early. By the time we left the lines were incredibly long (although they move fairly fast). We had the Basilica almost to ourselves for a while. Within a couple of hours, everyone was on top of each other. While there, visited the Grotto.\nI attempted to get tickets to the Scavi ahead of the trip by wasn't able to secure them within the time we had available -one excuse to go back.\n\nWhen visiting the Basilica, make sure you have tops that cover your shoulders and your dress is below the knees. I wore long wide-legs pants and short sleeves to make it easy. (otherwise you have to drape the blue cover over you! not fun in a hot day)\n\n-Trevi. We visited it a few times (since we were so close to it). It was busy, but plenty of room for photo ops. Everyone, except the instragram divas, was very polite and accommodating and moved out of the way to let others have their pictures.\n\n-Pantheon. Get tickets ahead of time. You will still wait in line, but only with the people with tickets for that hour (they are 1 hr time slots ie. 10-11, 2-3, etc, not timed exactly). The lines for tickets were long. One for cash, one for CCs. They wrapped around, even at 9AM. We had tickets for the first hour they opened.\n\n-Golf Cart tour. We booked through Rolling Rome. Eduardo was AMAZING! we had seen some of the attractions so I asked him to take us to his favorite places in Rome. He obliged, including his favorite gelato place. Oh my! don't miss Neve di Latte! Amazing. It was a private tour, so we had the freedom to go places away from the typical route.\n\n-Colosseum. We had booked an underground/arena tour through LivTours. The underground portion was cancelled a few weeks before we left, so they rebooked us in a semi-private tour that included everything else. Our guide was magnificent. We had a blast and he even explained portions of what we could see of the underground. There was only one other family with us with two young boys and he was very attentive to them and really took the time with them and my mom (83 y/o). I cannot imagine doing the Colosseum in a large group. If you can, go for private or semi-private tours.... or try to get tickets directly from Coopculture.it.\nBTW, it was hot, but there is plenty of shady spots so we didn't have much of an issue (but remember, I'm from Florida :) )\n\n-Roman Forum/Palatine Hill. We got tickets to visit on our own. We had the Super Forum tickets and the extra money is well worth it. There are a few extra sites that are simply amazing. We really enjoyed Santa Maria Antiqua with Oratorio. (Plus they are nice and cool and offer a break in the heat if traveling in the summer)\n\n-We visited several churches, including Santa Maria Maggiore. Enjoyed several galleries but mostly spent the free time sightseeing and exploring Rome. Five days were not enough.\n\nFLORENCE\nThe city is simply amazing! The art oozes out of every building. Being in the architectural and design field, I was in heaven!\n\n-Ufizzi. It's a most. But plan for at least 4 hours. There is so much to see and we didn't get to finish it -and that wasn't even stopping to read a lot. We didn't have a tour, so we took our time, and breaks and then ran out of time LOL. We were there 3 hours and missed a few areas. We will return.\n\n-The Accademia. We had 8:15 tickets. There were only a handful of people inside and we got to spend as much time as we wanted visiting David and the rest of the gallery. By the time we left (about 1 1/2 hours later) the crowds inside were quite large and outside the line wrapped around the corner. Get tickets. There are lines with the time and you just line up in the correct time slot. It's easy. It's also wheelchair friendly -if you are traveling with someone a little tired (like my mom :) )\n\n-We had tickets to the Duomo's complex. If you want to get inside the church itself, you must get there early. It's free but the lines are long. The Baptistery is under renovations, so you can see the walls but not the actual baptistery (another excuse to go back!)\n\n-Palazzo Ricardi Medici is small, but worth a visit. You don't need tickets ahead of time. It can be visited in an hour.\n\nThere were other attractions, all worth visiting. (The view from Michaelangelo Piazza is gorgeous) We only had 3 1/2 days in Florence and felt that we covered a lot of ground just walking around, but will definitely would love to spend more time visiting Ufizzi and Palazzo Vecchio.\n\nSide trip to PISA.\n\nThis was planned at the last minute. Took the local train from Florence to Pisa at 5PM. It was crowded, hot and a true 'local' experience.\n\nThere are a few interesting sights in PISA including the main attraction -the leaning tower. But all took about a couple of hours to visit.\n\nAfter that, we strolled away from the touristy area and came to a really nice restaurant, where we had an amazing dinner.\n\nTook the train back to Florence and arrived close to midnight. All in all, it was a great side trip, never to come back again. (But I recommend a visit at least once. The architectural details and history of the tower are worth visiting and seeing)\n\nMILAN\nWe were here 2 days. Visited the main attractions, including the Duomo, Gallery and a little shopping :)\n\nThis city has more of a 'European' vibe. It reminded me a lot of Boston (USA) in some ways (for reference, I lived in Boston for 32 years). The old and the new coexisting.\n\nFrom here, we took the train to Bern. It was Ciao Italy. Until next time.\n\nAs general notes:\n\nRestaurants - we only made one reservation for dinner in Rome, and although excellent, not the highlight of the culinary experience.\n\nMay not be a popular opinion here, but most restaurants ARE open during the afternoon. We encountered only one that was open for drinks and just crossed the street to 3 that were open.\n\nWe had gelato every.single.day. :) in all cities. We visited Scudieri quite a bit while in Florence as they were closest to our hotel, but we just didn't have one bad gelato anywhere. Same for meals. Unplanned, unscheduled, totally worth the flexibility. You won't starve in Italy.\n\nBathrooms - never paid to use a single toilet room.\nPisa was the most challenging one as it was inside McDonals at the train station and it was dirty and could go in only by punching a code printed on a receipt from them. My code didn't work, so a few of us went in when someone came out.\nThe Roman forum toilet rooms (we used 4 of them) were clean, but out of toilet paper, but I learned in this group to take the ends of rolls with me everywhere. Only had to use them there. Thank you to whoever suggested that!!\n\nTrains - we travelled high speed Frecciarossa from Rome to Florence and Florence Milan. Fairly inexpensive and super convenient. We had booked tickets ahead of time, so perhaps that made a difference. We travelled Business Class and then first class on the train to Bern.\nYou need to find the train number on the board. A few minutes before the scheduled time, they will post the platform. You need to hurry up if you have a slow walker :)\n\nTaxis - No issues in Rome. Our hotel or restaurant would call them and they always showed up on time, and no one tried to 'scam' us. They are harder to come by in Florence. It was a bit of a challenge on day, but we managed to find one eventually.\n\nThe rates are higher on Sunday. Just be aware of that.\n\nFinally, what to wear.\nStop obsessing about what to wear. My dress style is relaxed casual. (not torn anything...:). I took what I wear at home. (I live in a tourist town, surrounded by tourists... :) )\nMost of what I took had shoulders (no spaghetti straps, etc) so I didn't have to worry too much about going into churches. Having said all that, people wear what they want! You are on vacation. Enjoy your favorite style and go with it. Be comfortable. You will never be like the locals. They dress nicely. But they are also not out and about all day. Dress nice, but comfortable -whatever that means for you- and you will be fine. No one cares.\n\nThings I took that were MUSTS.\n-Laundry detergent sheets and universal sink plug. Too much gelato meant a few stains. Plus it allowed us to keep up with washing a couple of tops in the sink.\n\n-Portable fan. This was a life-saver. Italians (Europeans in general) have no concept of COLD AC LOL. All our hotels had good AC, and 2 of them didn't have the card on the controls, so they could run all day if we wanted to. Still they never felt cold enough for me, so having the little fan was the ticket!\n\n-Hairdryer and Conditioner. This girl has to have her hairdryer, so I have one that is for travel only (not dual voltage, but 240v). Hotels have them, but not strong enough for my hair. Also none of the hotels had conditioner.\n\n-Comfortable shoes. I mostly wore my Aetrex sneakers, a pair of Aetrex sandals for 'dressier ocassions' and Vionic sneakers. My feet didn't hurt or got tired even with all the walking we did.\n\n-Linen. You will thank me later. Wrinkles and all. Stylish and comfortable.\n\n-Euros. We took about 500 with us. CC are accepted everywhere, but we left tips in hotels, tour guides, etc. and also used cash for small purchases. We found that some places wouldn't even have small change for cash purchases.\n\nThings that I didn't use\n-Rain jacket. It won't make the trip next time (unless it's in the 'rainy season'. Didn't take a whole lot of room, but totally unused. There is plenty of cover or you can buy a cheap umbrella is needed.\n\n-I used all the outfits I took, but some more than others. What seems cute at home (or even in Switzerland/France), were not the most comfortable ones in Italy. Again, linen is king.\n\n-Selfie stick. Can't use in some museums and if we wanted group pictures, we just asked another tourist to take ours in exchange for taking theirs. It was fine, but also we were a party of 3 (in Rome) and 4 in Florence.\n\n-Hydration packs. Just drink plenty of water. Save the agony of the taste and weight they add. There are water fountains everywhere.\n\nLast words\nGo with the flow! We had not major issues. We carried our passports EVERYWHERE. Did not need them once, including getting on the trains. I had a medium size travelon crossbody with a passport pouch inside attached to the bag where I kept cash and passport.\n\nWe never saw pickpocketing, but I also didn't take the metro or busses (except to Pisa). I kept the bag in front of my body and used a lanyard for my phone. It came in handy as I almost dropped it a couple of times.\n\nI know this has been a long post. If you are still reading, I hope you found it helpful! Most of all, ENJOY ITALY!!! It's wonderful. Relax, have fun and most importantly, plan a trip back! I'm already working on it. 😍", "link": "facebook.com/groups/1373361046396315/permalink/2199848917080853/", "likes": 933, "comments": [{"username": "Pamela J. Roe", "comment_text": "Thank you for sharing!"}, {"username": "Wanda Moratelli", "comment_text": "Thank you very much for all of this information ! I will be traveling in a few weeks and your comments regarding transportation to laundry detergent answered so many questions! From one Floridian to another, grazie!\n\nGina V Zerella"}, {"username": "Chaiyou Duffy", "comment_text": "Love Switzerland and Italy!"}, {"username": "Taylor Mignacca", "comment_text": "For the bathrooms, not to sound dumb. I’ve heard mixed things that you do have to pay for bathroom. I am going to Rome, Sorrento, and Naples. Is it true or not?"}, {"username": "Suraya Naidoo", "comment_text": "Beautiful pics. Thanks for sharing."}, {"username": "Stephanie Ratcliffe", "comment_text": "thank you"}, {"username": "Karen Ambler Young", "comment_text": "Great info! Thank you."}, {"username": "Andrewina Piazza-Davies", "comment_text": "Thanks so much for the post , you have answered many questions , we are heading to Italy September for a wonderful 5 weeks. Love your outfits !!!!"}, {"username": "Preetha Mahadevan", "comment_text": "Great tips and Fotos ❤️ Thank you for sharing!"}, {"username": "Cheryl DiVitale", "comment_text": "Great tips, thanks!"}, {"username": "Shannon McGowan Wells", "comment_text": "Did you get your euros before you left or at the airport?"}, {"username": "Rachele Amalfitano", "comment_text": "Thanks for this post."}, {"username": "Jennifer Cook", "comment_text": "Kathy Zink Russell… a great read!!!"}, {"username": "Dorothy Press", "comment_text": "Great tips. We also did a 3 week trip this past May 30-June 23. Amazing! The Scavi tour we did in 2019, go back, it’s well worth it."}, {"username": "Elizabeth Bernal Bain", "comment_text": "Dwight Jason Bain 3 weeks in Europe and 11 of those in Italy. Maybe we can hit London and Paris if we trim some Italy stuff."}, {"username": "Stacy Hallman", "comment_text": "Great post! Very helpful."}, {"username": "Jj Bernard", "comment_text": "Love this."}, {"username": "Anne Ingham", "comment_text": "Excellent, thank you."}, {"username": "Patricia Cruz Lopez", "comment_text": "Florence and Milan-my favorites! Been there multiple times and going back November and March!!! Your “review” was on point!!! Felt like I took a tour as I was reading! Thank you!!!"}, {"username": "Yostina Narouz", "comment_text": "Too helpful!!\nThanks for your effort & time to share such an amazing review 😊"}, {"username": "Handcock Alison", "comment_text": "Do you have a Switzerland post please\nThis post for Italy is amazing with lots of great information"}, {"username": "Gianna Onesi", "comment_text": "Thank you for this. How was the Pantheone thinking of going in the fall?"}, {"username": "Anna Kabebe", "comment_text": "What a great and detailed post! Thanks for sharing your trip 🤩"}, {"username": "Kelly Ciombor", "comment_text": "Couple questions for you. We’re coming from FL as well (Orlando). How do the heat and humidity compare? We’ll be there in June.\nAs for hotels, do you look for anything specific in terms of AC to get what you’re used to? My 13 yo had hypoglycemia and sometimes gets overheated and just plain runs warm. Would like to have the option of a brief rest with good AC if necessary.\nLastly, I’m looking at the early morning Vatican tour as well. If we finish the tour, exit the Sistine chapel and go to the museum, we’ll be able to bypass the Basilica lines for entry? Just checking that’s what you did.\nThanks for any info!"}, {"username": "Nicole Powers", "comment_text": "This was very informative!"}, {"username": "Alec Skalka", "comment_text": "Carly Nicole"}, {"username": "Ernesina Scala", "comment_text": "Read it all. I am Italian and I also live in Florida but I enjoyed reading your notes and I agree. By the way I was born in Rome so I appreciate the pics. I am in Italy now. South headed to Bologna and Tuscany"}, {"username": "Alison J Fleck", "comment_text": "Hi where did you eat in Pisa? Looking to eat lunch here."}, {"username": "Vasthi Cheddar", "comment_text": "Jim Healey Diana Healey"}, {"username": "Christina DeWaard Ventola", "comment_text": "Wonderful recap and very helpful! Thank you!"}, {"username": "Leticia Barabba", "comment_text": "Super helpful!"}, {"username": "Diane Garvey", "comment_text": "Thanks! Beautiful pictures!"}, {"username": "Carolyn Danielson Sanchez", "comment_text": "Please share your secret to keeping your white sneakers white! In dusty Rome! I’m so nervous about wearing mine, but they are my favorite Hokas! ￼\nThank you for such an informative post!!"}, {"username": "Andrea Zulch", "comment_text": "What app did you use to prebook your transfer from airport. I have discovered that there are no trains running at the time we arrive in fco airport."}, {"username": "Jennifer Hansen", "comment_text": "Thanks for sharing"}, {"username": "Jacki Cincotta", "comment_text": "Great post, yes I did read the entire thing. Thanks for the tips. I can't wait to get there!"}, {"username": "Erica Senes Tombesi", "comment_text": "As italian can I say that this are amazing tips! And you dress so nice!"}, {"username": "Eunice Wa Mwaniki", "comment_text": "Great insights, thank you"}, {"username": "Nancy Favila Wong", "comment_text": "Great post !"}, {"username": "Glenda De Cooker", "comment_text": "So helpful. Thank you 😁"}, {"username": "Joanne Smith", "comment_text": "Good info glad u enjoyed the trip"}, {"username": "Benedetta Vanni", "comment_text": "Public toilets in Pisa: https://\nwww.pisamo.it/\nwp/\nbagni-pubblici/\n\nAlso: there is a toilet in the train station other than McDonald's one!"}, {"username": "Rhona OConnor", "comment_text": "Carolyn some info for you here...."}, {"username": "Sheila Schiffman", "comment_text": "Thank you!"}, {"username": "Jaclyn Raé", "comment_text": "the influencer we all need 🥰"}, {"username": "Jenny Meffert", "comment_text": "Fabulous post. Thankyou for sharing your tips and information."}, {"username": "Shirley Fraser", "comment_text": "Great post Wendy Jean Fraser"}, {"username": "Sue Woolf", "comment_text": "Hana"}, {"username": "Sharon Johanssen Kamholz", "comment_text": "Great post!!"}, {"username": "Joya Nicastro Cherry", "comment_text": "Bravo 🇮🇹Awesome review !\nThank you for taking the time to be so detailed !\nI too am a FL gal living in a touristy town."}, {"username": "Lisa Hoffman Goldberg", "comment_text": "Russell Goldberg"}, {"username": "Anj Pl", "comment_text": "Harsh Patel"}, {"username": "Annette Sparks", "comment_text": "Thanks for the information. Who did you use to collect you from the airport in Rome?"}, {"username": "Deacon Tom Lang", "comment_text": "Awesome post all around!"}, {"username": "Coreen McGuire", "comment_text": "Great info....thank you!"}, {"username": "Moomai Pena", "comment_text": "Thanks for sharing your experience!! This is helpful for my trip in December!!! 🙂 How early did you go to St. Peter's Basilica to avoid the long line?"}, {"username": "Teresa Heran", "comment_text": "Thank you for your comment about conditioner. I got blasted for observing that. 😂 I’m glad someone else experienced it."}, {"username": "Sharon Ellis", "comment_text": "Wonderful, practical and informative post.😊"}, {"username": "Sharon Ellis", "comment_text": "Wonderful, practical and informative post.😊"}, {"username": "Martha Regina de Hernández", "comment_text": "Luis Arturo Hernández Castro"}, {"username": "Sony Ucciferri", "comment_text": "Thanks a million"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "One question …. When were these taken and where are the people ?"}, {"username": "Connie Dennis", "comment_text": "Love this post? Thank you"}, {"username": "Sylvia Martinez", "comment_text": "Sandy Rodriguez"}, {"username": "Alisa Cesario Willman", "comment_text": "Fellow Floridian here (originally) and after my first trip to Italy this year, I'm also planning my next trip. What an amazing country and experience! Thanks for your post. Loved it!"}, {"username": "Colleen Wolff", "comment_text": "Thank you! This was very helpful. So glad you had such a nice time. Love the pictures!"}, {"username": "Ann Wolanske", "comment_text": "Thank you for taking time to share all that information."}, {"username": "Shweta Desai", "comment_text": "What website did you use to book? Thanks"}, {"username": "Eileen Lynch Johnson", "comment_text": "Thank you for a very informative and valuable travel post for Italy! I like how positive you are and go with the flow…..that is how a vacation is supposed to be. Of course, there is time spent on preparing for tours, making sure you see what you want and the best way and time to do it but I love how you also have lots of flexibility and just enjoyed each and every site! You really gave great information and thank you for taking the time to share this! Truly awesome and so helpful! 🎉🎊❤️"}, {"username": "Jennifer Erdman", "comment_text": "Great photos!"}, {"username": "Kelley Casole Cwiklinski", "comment_text": "Thanks for sharing, great tips! We are arriving on September 3rd, will I still need a fan?"}, {"username": "Mary Stinnett Boggs", "comment_text": "I'm reading this as I am on vacation in Florida! Thank goodness for ac! Being from Texas, I'm also used to the heat, but Florida humidity is something else! I'd rather stay cool, so my trip to Italy will be in April! Hopefully less crowded too! Loved your travel tips and adventures!"}, {"username": "Patricia Archuletta", "comment_text": "Thank you for the info!!!!"}, {"username": "Karen Stewart", "comment_text": "Vasthi Cheddar thank you so much for your helpful advice.\nMy (near 31 year old) daughter Amanda Stewart and I will be in Amsterdam (4 nights), Paris (5 nights) and Italy (for 7 nights 🌙 ) .\nFor 6 of our 7 in Italy (Rome, Florence and Venice) we will be with a tour company. Our 1st night in Rome will be just us.\nTho I've been to Amsterdam and Paris before (albeit 1 night each place in 91) Italy is a first for both of us.\nWe are looking forward to our trip.\nManda will be using her wheelchair as she has some physical disabilities but can walk short distances.\nTho some places we are seeing in Italy are included with the tour there are a few optional tours and some free time available for us to visit Vatican and sistine, trevi, etc. But limited time so we need to be aware of our must do's and the ones we hope to do/see.\nIn Amsterdam and Paris we are completely on our own. With our local travel agent we will be booking some of our attractions for Amsterdam and Paris in advance before we leave NZ (we go in Nov) and with the tour company dealing with Italy we might add on 1-2 of the optional tours.\nI'm going away for 2 weeks this coming weekend(within my own country) but when I return (day before my daughter's birthday) we will start planning properly at what we want to do/see in Europe.\nAfter Venice we fly to Queensland for a week(Manda) or 2 (me).\n\nI think our 2 biggest concerns in Europe is our safety (ie pickpockets etc) and wheeling the wheelchair across cobbled streets. And probably the 3rd particularly in A and P will be making sure we get the right transportation.\n\nWe will take on board much of what you have adviced.\nMany thanks"}, {"username": "Teresa Callahan Kitchen", "comment_text": "Thank you"}, {"username": "Rob Tait", "comment_text": "Good read"}, {"username": "Leslie BC", "comment_text": "Great review. Thank you ✌️"}, {"username": "Beverly Buschmann Miller", "comment_text": "Beautiful pictures! And your outfits are adorable"}, {"username": "Cheryl Lindsey", "comment_text": "Your pictures are gorgeous!!"}, {"username": "Lisa Gonzalez Propri", "comment_text": "Thank you for your post!\nYou answered a lot of my questions as if you had read my mind! I am also from Florida we are flying On ITA. Direct flight from Miami to Rome. It’s our belated Honeymoon so we are also doing a 10 day Italy/ Greece cruise. I’m debating whether I can do COO. Can you give me some details on the COO and personal item you used. Did they weigh your personal item?\nI have the same crossbody purse wondering if you took that onboard also. I also booked the nighttime underground private tour through Viator. (I hope they don’t cancel)\nWe are also visiting Florence and Naples on our cruise. I have excursions booked but I need to book the skip the line tickets but I’m not sure about scheduling exact times for the accademia and uffizi.\nNot sure if we have time to do both since we are doing Pisa and Florence that day\nWe are getting dropped off in Florence early afternoon and will have approximately 31/2 hours on our own. Any advise you have is appreciated."}, {"username": "Cindy Vethe", "comment_text": "Great post! Thank you for sharing 😊❤️"}, {"username": "Jan Henry", "comment_text": "The C"}, {"username": "Ann Phillips", "comment_text": "Thanks for sharing."}, {"username": "Erin Lynch Montellione", "comment_text": "Thank you!"}, {"username": "Helen Kimber", "comment_text": "Shayne Duncan helpful"}, {"username": "Mary Andreotta", "comment_text": "Great recap! Thanks!!"}, {"username": "Valerie Morton", "comment_text": "Robin Jaeschke Jasper"}, {"username": "Kathy Fryer", "comment_text": "Kathy Fryer"}, {"username": "Natasha Schue", "comment_text": "Ryan Schue Great breakdown of the tours!"}, {"username": "Charles Broussard", "comment_text": "Well done!"}, {"username": "Sue Swail Bang", "comment_text": "Vasthi Cheddar can I ask what hotel you stayed at in Florence?"}, {"username": "Paul Davis", "comment_text": "Vasthi Cheddar: I just read your post…just kidding; longest post ever!\nI’m amazed at all the people that do read these long posts. Glad you had a great trip."}, {"username": "Jeannie Kennedy Pitsch", "comment_text": "Great post! One question: you mentioned wheelchair at Uffizi. Do they have them to borrow? There or at Accademia?"}, {"username": "Kimberly Ann", "comment_text": "What an awesome post ! Thank you for this great info ☺️🙏🏻"}, {"username": "Lisa Latella Hoefling", "comment_text": "Great posts. Very helpful information. Thank you for sharing"}, {"username": "Karen Frazer", "comment_text": "Thank you so much for your wonderful post.\nWe also have tickets early VIP with breakfast purchased on official site my question is once we’ve done that how and where do we go to get to basilica etc"}, {"username": "Rita Gee Herring", "comment_text": "Thank you! Very helpful!"}, {"username": "Marcus Hiesler", "comment_text": "Sharon Hiesler"}, {"username": "Kadie Mcgugan", "comment_text": "Cameron Holliday"}, {"username": "Nancy Deslandes", "comment_text": "Sarah 😊"}, {"username": "Monica Saluja", "comment_text": "Hariti Saluja"}, {"username": "Mariposa Mariposa", "comment_text": "Thank you for this🇮🇹"}, {"username": "Jessica K Goeller", "comment_text": "Julie Johnsen"}, {"username": "Fran Odgers", "comment_text": "Fiona Cornish"}, {"username": "Nina Truong", "comment_text": "Amazing post, photos and tips. Thank you! Approx what time did you arrive at St Peters Basilica in the AM? Vasthi Cheddar"}, {"username": "Donna Kay Thomas Grimes", "comment_text": "Thanks for info was helpful !"}, {"username": "Ewa Olbrych-Rudzinska", "comment_text": "Great optimistic post . Thank you"}, {"username": "Denise Bibby", "comment_text": "Teena Leuba"}, {"username": "Helen Brazeau", "comment_text": "Excellent post and thank you for taking the time to write it and for being so thorough! I hadn’t heard of the universal drain cover idea before and that makes so much sense. I often wash favorite tops and more and never thought about that. I love that you got so many steps in too. My kind of traveler! You experience everything so much better on foot and you get a real feel of the vibe of the town when in between the touristy spots. Not to mention all the extra cool stuff you’d never encounter otherwise. Great photos also."}, {"username": "Keith Crossley", "comment_text": "Very nice post! A couple of questions:\n- we may skip the Coloseum, but still interested in other ancient parts. Could you get any access?\n- what did you use to take the pictures?\n- how did you get up the hill in Florence? Walk. Bus. Taxi?\n- I am thinking, if we have to choose, Uffizi over Academia. Thoughts? Especially, since there's a David replica on its original site.\n\nThanks!"}, {"username": "Camille Riordan", "comment_text": "Thanks for all the great tips!"}, {"username": "Kelley Morais", "comment_text": "Vasti Vasthi Cheddar…i am also in US going to Italy for 1st time in October. (Have never been to Europe). Pantheon ticket questions. Did you purchase online or in person? If online, what website? And did you purchase while you were still in the US? And do you know what the first entry time is? Please and thank you."}, {"username": "Joyce Scherdin", "comment_text": "Beautiful photos"}, {"username": "Michelle Jesperson Penny", "comment_text": "Thank you- loved this"}, {"username": "Carol Hayes", "comment_text": "Great post thanks for the info. Very helpful!"}, {"username": "Amanda Stewart", "comment_text": "Karen Stewart cat is wait to see most of these in November"}, {"username": "Iman Sh", "comment_text": "Thank you for all the details!"}, {"username": "Nina De Martino McDonough", "comment_text": "Your pictures are beautiful! Love your purse too!"}, {"username": "Cheryl Zito", "comment_text": "Can you wear capri leggings under a dress when you visited the Basilica? Do you need to wear dresses below your knees to all churches in Italy?"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Excellent… maybe writing a tour book is in your future !!!"}]}, {"id": "2199853373747074", "text": "Can I convert US cash to euros when I arrive? I do not have an atm card.", "link": "facebook.com/groups/1373361046396315/permalink/2199853373747074/", "likes": 11, "comments": [{"username": "Kim Geary Keidel", "comment_text": "I didn’t have a debit/atm card before our trip. My bank was able to print one for me on the spot. (I also had my bank order me euros to take with me. Took like 2 days.)"}, {"username": "Gillian O'Callaghan", "comment_text": "I'd get a debit card.....I always travel with 3 cards in different places. But yes you can exchange money but you pay to do so."}, {"username": "Bill Shafer", "comment_text": "Here is our recent experience in Rome, with exchanging currency\n\n$1,000.00 to Euros\nexchange rate .94 /1.06.\nNewark Airport €830.00\nRome airport €726.00\nRoma train station €820.00\nAcross from train station, €875.00\nIn front of train station by snack bar\n€900.00\n\nIf you feel the need to have euros the moment you land, only get a small amount at the airport. Wait until you get into the city and go to a ATM at an actual bank, they will charge less fees and have a better conversion rate. The airports and train stations are a rip off.\n\nUsing a credit card that doesn’t charge international fees, is the best way to go."}, {"username": "Kathy Bennett", "comment_text": "I got a Visa travel money card from my bank. Just load it with enough for your trip. Really easy. I also purchased Euros from my bank before my trip so I had cash for think like taxis, buses and gelato! 😊"}, {"username": "Donna Heitmann Clay", "comment_text": "I went to a money exchange to change Dollars to Euros in Venice. It was not pretty what I got for my $400."}, {"username": "Jose Velez", "comment_text": "Get an atm card before you go and credit card without exchange cost"}, {"username": "Maria Coladangelo Ducca", "comment_text": "Yes but I would do it here!"}, {"username": "Joanne Tedeschi Piscione", "comment_text": "Change here at your bank as much as you think you will need. You should do at least a week before you go. We had a hard time in Greece looking for places to exchange & then we paid a fee. Also we used credit cards as well"}, {"username": "Kris Beacham", "comment_text": "Yeah but it will cost you more.\n\nYou’re better off with a credit card doing the exchange. See if your card has foreign transaction fees. If not use that card for everything.\n\nJust prepay the card before you leave or while you’re on your trip."}, {"username": "Brian Osman", "comment_text": "Get it from your bank before you leave"}, {"username": "Brian Osman", "comment_text": "And get an ATM card 😂"}, {"username": "Kay Sloan", "comment_text": "It’s a pain - get a card ."}, {"username": "Paula Brink", "comment_text": "For anyone who hasn’t done their trip yet: do not take US cash and then exchange it once you are in Europe- this has gone the way of the traveller’s cheques, and I mean this in the nicest way possible. It is much easier and cheaper to just withdraw cash from an ATM that belongs to a bank ( not one of those freestanding ones you see at the airport or in shops etc)\n\nI like to have some euro when I leave home and my bank has them so I just pick them up a few days before, then I use ATMs and my credit card. My bank has an arrangement with different banks overseas so I don’t pay ATM fees when I use overseas ATMs - check your bank to see if they have this arrangement."}, {"username": "Pam Studstill Stump", "comment_text": "Get an ATM card. I don’t know why you don’t have one, seriously."}, {"username": "Frank Hunt", "comment_text": "Get a Wise card and transfer your local currency in and convert to Euro. Draw out as cash (fee free limitations) or pay as a credit card."}, {"username": "Robin Anderson", "comment_text": "Get them before you go. The exchange rate at the airport is terrible. I think it was 1.34 per euro vs. my bank which was 1.09."}, {"username": "Alexandra A Welker", "comment_text": "If you're in the US, you can get euros at Triple A as well (if your bank doesn't offer it )"}, {"username": "Russell Weidner", "comment_text": "Get an ATM card. Period"}, {"username": "Nancy Lewis", "comment_text": "Get Euros at AAA. NO FEE GOOD EXCHANGE RATE or at your bank here.\nIf you have no debit card I assume you have a credit card. A little difficult to check into hotel without a card.\nIf you are taking a few thousand dollars keep it in the safest place possible."}, {"username": "Nancy Lewis", "comment_text": "You will usually pay a large fee in the money exchange stores or at airport. You loose big time."}, {"username": "Rickie Vivrette Corman", "comment_text": "Thanks everyone. I have a credit card that I’m using with local currency. I am also using apple\nPay but some small stores don’t take. Or at street vendors. Thanks for the info. I’ll use my card for more euros!!"}, {"username": "Melissa Reyes", "comment_text": "I went to the bank here and converted cash to euros"}, {"username": "Michael Barnes", "comment_text": "Do it before you leave. There is a Travelex stand in most international airports."}, {"username": "John Mazurek", "comment_text": "You can convert at the airport you depart from usually in the US. We found most of Europe is now either credit card or phone payment, don’t take a lot of cash!"}, {"username": "Anamica Roy", "comment_text": "Try Wise"}, {"username": "Debbie Grindal", "comment_text": "Get a Travel Money card fantastic accepted nearly all places we’ve been over 8 weeks in Europe just drew out small amount of cash for really little things 👍"}, {"username": "Seadoo Paul", "comment_text": "Your bank usually can do the exchange for you at a lower rate."}, {"username": "Mariann T. Ciampa", "comment_text": "Who is your bank? Most can get euros for you before you depart. The exchange rate is usually much better here."}, {"username": "Brian McGraw", "comment_text": "Get a Revolut card to use just for your trip.\nTook about a week to receive mine in the mail. You can swap currencies in your account."}, {"username": "Janine Emma Lucas", "comment_text": "Before you leave. Do you have a credit card? Best to charge most meals, tours to that in local currency Keep cash for tips, small snacks, busses etc"}, {"username": "Linda Rose Hayser", "comment_text": "Yes but rather do it before you leave"}, {"username": "Anthony LoBue", "comment_text": "Do not do at airport. I lost 80 changing 300 to euros"}, {"username": "Nick Cittadinni", "comment_text": "I went to my local bank and they ordered Euros for me"}, {"username": "Rickie Vivrette Corman", "comment_text": "I didn’t Bring enough. I am in Spain for two weeks before going to Italy. I’m actually trying to find where to get more in Spain. Most places take cards but small mom and pops and boutiques don’t."}, {"username": "Ascencao Firth", "comment_text": "Yes if you want to give away money……dm me I love ❤️ 💰 money, I’ll help u xx"}, {"username": "Janet Brune", "comment_text": "It’s good to have euros. But credit cards are safer and less to loose US dollars."}, {"username": "Ken Diamond", "comment_text": "Use credit cards to buy anything that you buy or when you eat in restaurants the credit card companies will give you a good exchange rates when your bill comes use cash only for small items"}, {"username": "Patti Porter", "comment_text": "Not easily. Easier to get debit card for your bank account. Even better is go online and get one from Charles schwab and they refund any atm fees charged."}, {"username": "Queenie Mah", "comment_text": "I highly recommend exchanging in your city before you leave. I compared the rates at local exchanges in Italy and they actually charge more in fees. Otherwise, it is typically better to exchange locally..just not in Italy"}, {"username": "Lauren-Jade Roberts", "comment_text": "Definitely best to get a debit card and withdraw from the atm - you get the rate that banks exchange between themselves then and don’t pay currency bureaus a margin"}, {"username": "Patrice Warren", "comment_text": "I also ordered euros through my bank, received them in 2 days."}, {"username": "Jim Hinckley", "comment_text": "Visa is accepted all over Europe"}, {"username": "Joe Guzzi", "comment_text": "Took for small \"cambio\" places, they will give the best rates, even with USD, far better than banks."}, {"username": "Marie Cuzzi", "comment_text": "Yes go to any bank just be aware of the hours"}, {"username": "Valerie Goulds", "comment_text": "May I suggest getting a pre loaded debit card from AAA. This way you can withdraw Euros from ATMs. You can reload the card. The card is secure. I have used mine for 4 different trips to Europe with no issues."}, {"username": "Allison Mir", "comment_text": "Get a Revolut visa debit card - best exchange rate everywhere"}, {"username": "Elizabeth Miller", "comment_text": "Yes, use Apple Pay as well"}, {"username": "Edward Tacchi", "comment_text": "My recommendation is sticking with banks, not money changing kiosks."}, {"username": "Lucy Lou", "comment_text": "In Europe use Revoult card, best Euro exchange rate around and can top up in seconds I am just back from Spain and used every day No transfer fees, no charges and not carrying money about 100% the best way."}, {"username": "Sandra Keyser", "comment_text": "We used mostly an ATM or go to a bank!"}, {"username": "Carolyn B-Coakley", "comment_text": "Carolyn B-Coakley"}, {"username": "H Raymond Fasano", "comment_text": "Yes"}, {"username": "Lillian Gucciardi Nahas", "comment_text": "Get an ATM card. You’ll get current exchange rate and should avoid fees."}, {"username": "Tony-Annette Unpingco Ada", "comment_text": "Don't do it. Get whatever euros you need beforehand, the conversion in country sucks."}, {"username": "John Rodriguez", "comment_text": "Pay with a credit card! It’ll convert for you!"}, {"username": "Sam Mouchamel", "comment_text": "Yes"}, {"username": "Enrico Lecce", "comment_text": "Yes"}, {"username": "Enrico Lecce", "comment_text": "You can now withdraw from an ATM in Europe if your have a debit card"}, {"username": "Jim Painter", "comment_text": "Get a card..."}, {"username": "Teresa Marina", "comment_text": "Rates are so terrible in Italy at the Bancomat. Try to get euros before you go."}, {"username": "Lisa Martinson", "comment_text": "Yes at the airport or a bank."}, {"username": "CT Loque", "comment_text": "Yes at the airport they have several exchange place but its very low i changed $100 for 70"}, {"username": "Alex Dodge", "comment_text": "Yes, but you will pay a premium. I would save cash for places that won’t take a credit card."}]}, {"id": "2199848033747608", "text": "Come explore Spello, one of Umbria’s most enchanting places!\nThis is the best time to visit Spello, considered one of the most ‘flowery’ cities in all of Italy! During this season, the alleys of Spello areआणखी transformed into an explosion of colours, the balconies, windows and alleys of the historic center are covered with flowers…you will be literally surrounded by flowers!\nJoin us: https://nextstop-italy.com/virtual-tours/spello-flower-town/\n\n#italytrip #italytravel #vacationmood #virtualworld #medievalart #italyiloveyou #rollinghills #medieval #virtualtour #hilltopviews #umbriagram #umbria #hiddenparadise #umbriatourism #Spello #virtual #flowers #flowerstagram #flowersoftheday #gardenlove #gardenlife #gardeninspiration #hamlet #hiddenplaces #hiddengems #hiddentreasures #hiddenbeauty", "link": "facebook.com/groups/1373361046396315/permalink/2199848033747608/", "likes": 25, "comments": []}, {"id": "2199829050416173", "text": "Day 6 - Alberobello\nDon't miss this incredible event during summer: from Saturday 22nd till Sunday 30th July 2023...Alberobello Light Festival!\nWhere to stay: Trulli Holiday, Albergo Diffuso\nA perfect, magical,… आणखी romantic Trulli experience!😍 If you want an authentic well serviced experience in an unique village atmosphere then stay here! Have a look here: https://www.dpbolvw.net/click-100692842-11552042?url=https%3A%2F%2Fwww.tripadvisor.com%2FHotel_Review-g580227-d1164498-Reviews-or10-Trulli_Holiday_Albergo_Diffuso-Alberobello_Province_of_Bari_Puglia.html%23REVIEWS\n\n\n\n\n#alberobello #alberobellotrulli #alberobelloexperience #alberobellolights #magicalmoments #magicalplace #magicalvibes #Romantic #apulia #apulianholidays #apulianlife #apulianstyle #dolcegabbana #trulli #trullilovers #trullihouses #puglia", "link": "facebook.com/groups/1373361046396315/permalink/2199829050416173/", "likes": 9, "comments": []}, {"id": "2177036979362047", "text": "BEST BAGS to bring for Italy! 😉\n🔹 For Minimalist Travelers: Travelon Mini Shoulder Bag\nThe Travelon Classic bag is ideal for who prefer a small travel bag or for sightseeing days where you don’t need to bring as much with you. This slim anti-theft shoulder bag offers a locking main compartment, an RFID pocket for a passport, credit cards slots, and adjustable shoulder straps\n➡️ https://amzn.to/3UOg1dq\n🔹Best Backpack with Safety Features\nThis is the best anti theft backpack for travelers who want to have a stylish option with all the benefits of a safe travel bag.\nThe main compartment has RFID blocking card and passport slots, an open top wall pocket, zippered wall pocket and tethered key clip with LED light. There’s a hidden slash pocket under the flap, perfect for sunglasses or a smartphone\n➡️ https://amzn.to/3KO7XVt\n🔹 Best Money Belt\nAnother comfortable option is a money belt, this item is easy to wear all day. Equipped with two, separate zippered pockets, you can easily organize your currency in one pouch and other documents in another ➡️ https://amzn.to/3okMrA5\n🔹 Travel Security Belt\nThe dual-function Pacsafe money belt is versatile and practical for a reasonable price. This product acts as a belt and a wallet and provides the perfect way to travel safely with cash on hand.\nThe best part about this money belt is that most pickpockets won’t even notice you’re wearing it ➡️ https://amzn.to/41mFux9\n🔹 Best Carry On Set with Cup Holder and USB Port\nThis is a great luggage set. It has a neat cup holder and if you charge the battery pack inside it you can charge your phone right in your suitcase ➡️ https://amzn.to/3oFdaYd\n🔹Foldable Travel Duffel Bag – It will be very useful for your Italian shopping. Extra space to bring home special souvenirs from Italy. ➡️ https://amzn.to/3BPqu0K\n🔹 AirTags\nApple AirTags help you keep track of everything from wallets, backpacks and keys. Another clever way to use them? Attach the tracking units, to your luggage in case your bags get lost or stolen while traveling ➡️ https://amzn.to/3okMbRD\nSafe travels! 😉\n#bag #antitheft #italy #moneybelt #backpack #whattowear", "link": "facebook.com/groups/1373361046396315/permalink/2177036979362047/", "likes": 7, "comments": []}, {"id": "2199790807086664", "text": "my painting of Venice", "link": "facebook.com/groups/1373361046396315/permalink/2199790807086664/", "likes": 212, "comments": [{"username": "Mary Pena", "comment_text": "Beautiful so peaceful looking."}, {"username": "Susan Lowry Lamb", "comment_text": "I'll take it."}, {"username": "Jessica Thompson", "comment_text": "Wow!!! 👏🏻👏🏻👏🏻👏🏻👏🏻"}, {"username": "Joe Arndt", "comment_text": "Great work!"}, {"username": "Susan McHenry", "comment_text": "Susan McHenry"}, {"username": "Elvira Lelli", "comment_text": "Beautiful artwork looks so real 🤩"}, {"username": "Andrea Romano", "comment_text": "Very lovely"}, {"username": "Michele Trial Westerman", "comment_text": "Absolutely talented! First time I ever saw a cover for the boat...I miss Italy"}, {"username": "Susan Buckley Thorpe", "comment_text": "Wow. So real!! Beautiful piece!♥️"}, {"username": "Gretchen Cabrera", "comment_text": "Gorgeous 😍"}, {"username": "Rachel Parrish", "comment_text": "Absolutely stunning!"}, {"username": "Patty Barnes", "comment_text": "Beautiful!"}, {"username": "Maria Ioannou", "comment_text": "Stunning !!!"}, {"username": "Carmen Martin", "comment_text": "You are so talented Joseph . ♥️"}, {"username": "Gina Rovello Keenan", "comment_text": "Beautiful!"}, {"username": "Shelby Dean Mayorga", "comment_text": "Looks like a picture!!!\nBeautifully painted! ❤️"}, {"username": "Molly O'Brien Luke", "comment_text": "Gorgeous!!!"}, {"username": "Samantha R. Howlett", "comment_text": "Samantha R. Howlett"}, {"username": "Donna Agostino Wish", "comment_text": "Wow"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2199716340427444", "text": "Just a heads up for anyone not following news around Mediterranean wildfires...main focus has been on situation in Rhodes but be aware that fires have occurred, are occurring in Italy...Puglia/Calabria/Sicily in particular...best to check your planned locations.", "link": "facebook.com/groups/1373361046396315/permalink/2199716340427444/", "likes": 6, "comments": [{"username": "Klara Święs", "comment_text": "Does anyone is currently in Sicily? Do you know if there is some organized evacuation from Nicolosi (village near Etna)? My mother-in law is currently there... Travel agency persuade there is no such a need, but the fire is spreading"}, {"username": "Pascale Mendillo", "comment_text": "Is it safe to travel to Naples we’re suppose to be going there next week and I’m not entirely sure anymore"}]}, {"id": "2199716753760736", "text": "ok need recommendations\nwe are traveling the end of September\nlanding in Naples\nwant to spend one night there\nthen hit Pompeii for a tour\nthen hit\nAmalfi area— where to stay here?\nshould we stay Rovello/Minori??\n\nPositano\nSorrentino\nCapri\n\nback to Naples\n\nHotel/places to stay?\nthings to do?\nrestaurants ?\nwhat can I not miss?\n\nGo! Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2199716753760736/", "likes": 3, "comments": [{"username": "Barbara Lardaro-Cazemier", "comment_text": "Nancy Sorrentino-Dill\non My cousin knows A LOT about that area. I will call you when I am back in NY. 🇮🇹🇮🇹"}, {"username": "Scott Heran", "comment_text": "La Bussola in Amalfi."}, {"username": "Scott Heran", "comment_text": "Minori is a great place for a home base. Ferry to Amalfi, Positano, etc."}, {"username": "Tami Whittlesey", "comment_text": "As far as Naples goes, I am a fan and would encourage you to have a room in the Historic Center off Via Toledo or on the Lungomare near the Castel Ovo. Also, I have enjoyed the services of Naples Grand Tour for both a Naples and Pompeii tour. Buon Viaggio"}, {"username": "Marissa Wilson", "comment_text": "I recommend Hotel Palazzo Decumani in Naples. It's super close to Centro Storico, very nice and clean rooms, friendly/\nhelpful staff, good breakfast."}, {"username": "Barbara Pasteris Allen Hettlinger", "comment_text": "Take a ferry from Naples over to the island of Procida for a day trip. Beautiful island with breathtaking views, not a lot of tourists, and wonderful to just wander around and explore. Restaurants along the waterfront. Definitely worth considering."}, {"username": "Mary Bagdasian", "comment_text": "Best area/hotel in Amalfi?"}, {"username": "Amanda Richards", "comment_text": "I always stay in Atrani, just next to Amalfi but smaller and quieter. Amalfi is 7 mins walk where you can get ferry to Capri, Positano, Sorrento etc. Be warned the Amalfi coast is very steep hills, so you need a good basic level of fitness. On average you will go up or down hundreds of steps every day. Yes you can get buses however you will spend a lot of time in traffic jams. It is a beautiful part of the world."}, {"username": "Lori Lardaro Whitman", "comment_text": "We stayed here 10 years ago. We rented a car and drove to Sorrento, Positano and other places in the area. Beautiful place with great views. Easy to boat over to Capri.\n\nhttps://\nwww.villeinitali\na.com/villa/\nlannunziata"}]}, {"id": "2199718050427273", "text": "Arnoriver, Firenze", "link": "facebook.com/groups/1373361046396315/permalink/2199718050427273/", "likes": 9, "comments": []}, {"id": "2161850390880706", "text": "Sorrento Farm and Food Experience including Olive Oil, Limoncello, Wine tastingExperience - and taste - the Italian farm to table process on a three-hour food tour. Convenient transportation takes you from your… आणखी Sorrento hotel to a fourth-generation farm. Explore the olive and lemon groves, before observing about the wine, oil, and honey making making processes. After a generous sampling of the farm’s products (including its limoncello), your visit concludes with a filling lunch and dessert.\nRead more about Sorrento Farm and Food Experience including Olive Oil, Limoncello, Wine tasting - https://www.viator.com/tours/Sorrento/Sorrento-Farm-and-Food-Tour/d947-16261P3?pid=P00070587&mcid=42383&medium=link&medium_version=selector", "link": "facebook.com/groups/1373361046396315/permalink/2161850390880706/", "likes": 21, "comments": [{"username": "Kim Grace", "comment_text": "Michelle Cummins"}]}, {"id": "2199600850438993", "text": "Hi everyone, thanks for letting me join the group. We're Planning on visiting Sorrento and the Amalfi coast next year and was wondering what's the best month to visit, May or June? Also any advice on the best places to stay on the Amalfi coast with regards to views and central location to bars and restaurants.\nWe're really looking forward to visiting.\nThanks x", "link": "facebook.com/groups/1373361046396315/permalink/2199600850438993/", "likes": 4, "comments": [{"username": "Donna Mangone", "comment_text": "May"}, {"username": "Steve Grossman", "comment_text": "May for sure. June has now become just like july and august"}, {"username": "Billie Begley", "comment_text": "We go in September. Weather is great. Tourists are down. But for an alpine would do early June. We stay in Sorrento. Easy to get to Capri and Amalfi. Hotels are\nLess. Lots of nightlife and restaurants."}, {"username": "Renae Larcus", "comment_text": "May! June will be hotter and more crowded."}, {"username": "Romina Lauretig Toscano", "comment_text": "May or early June"}, {"username": "Alison Bird", "comment_text": "Thankyou all for the advice, can't wait to start planning our trip 😊xx"}, {"username": "Phyllis Snyder", "comment_text": "June for warmer weather for boating."}, {"username": "Angela Marsala-Gaydos", "comment_text": "Mid May to mid June - just came back and the weather was perfect"}, {"username": "Jono Roland", "comment_text": "June."}, {"username": "Lucrezia Folger", "comment_text": "May, somewhat fewer tourists. I stay in Positano everytime, there are restaurants, do you mean \"bars\" as in coffee? That's where coffee is served, called bars. I don't think there are dinking alcohol bars as in the states."}, {"username": "Debra Genovese", "comment_text": "I think it's important to remember that the Olympic games are on in France next year during the summer so Europe will be busy.. it will be important to book early as the influx will be crazy."}, {"username": "Dee Scandone", "comment_text": "I would say June, as we used to go in May every year, but it can rain a lot in May so we changed it to June and that was fine. We got married there in September 2014 so we now go every year In September for our Anniversary."}]}, {"id": "2199692810429797", "text": "Hello, I was wondering if you have a suggestion for my last night in Rome, before my flight. I don't want my taxi from the hotel to the airport to be too expensive. Is there a neighborhood nearby that is still enjoyable for one night only? Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2199692810429797/", "likes": 4, "comments": [{"username": "Greg Saba", "comment_text": "The closest \"neighborhood\" to FCO airport is Fiumicino. We have been there many times, but, on our last trip, we stayed there and found the riverfront area to be a pleasant walkable waterfront surprise. Not as crowded as places in Rome, but plenty of restaurants in this fishing community. There is also a long beach for those with a bit longer stay. All right adjacent to the FCO runway. Lots of fresh seafood, but we also had some great pizza."}, {"username": "Romina Lauretig Toscano", "comment_text": "Fiumicino Town...you can also eat good quality fish on the waterfront...."}, {"username": "James-Kathy Dickerson", "comment_text": "Book Hilton by the airport free 24 hr shuttle"}, {"username": "Marie Thrash", "comment_text": "Hello, has anyone taken the tour of Rome, Florence and Venice with Globus?"}, {"username": "Miyuki Kanno Paul", "comment_text": "Fiumicino. A lovely town just for one night before heading back to FCO"}, {"username": "Stephen Henn", "comment_text": "We usually stay at Hotel Tiber in Fiumicino. They have a shuttle to the airport for about 6€/person. Affordable and nice."}, {"username": "Benedetta Vanni", "comment_text": "If you don't want to spend money for a taxi, there are trains from Roma Termini station to Fiumicino Airport.\n1) regional trains, quite a number of stops, might take an hour or so, very cheap\n2) Leonardo train, no stops, takes half an hour, costs 14 euros if i remember well.\n\nGo to trenitalia.com and search from \"Roma Termini\" to \"Fiumicino Aeroporto\""}]}, {"id": "2199651073767304", "text": "US Citizens. UK Citizens. Australian Citizens. Et al.\nStarting in 2024, you’ll need to have a visa to travel to Italy and the EU.\n\nRules are changing.\nDon’t sleep on this if you have a trip planned forआणखी next year.\n\nhttps://abc7chicago.com/visa-to-visit-europe-in-2024-us-citizens-new-requirements-for-traveling-americans-will-need/13542133/?fbclid=IwAR3wkOujWQT9QlztYR8Ytko9RYdt84flv65UWXqFhzfuvMXb_Iz1UAbMjGc_aem_AQULwnBRldKD4VSG3Wo69SK-CW4jNlaCCeYBVclkiX4vgBuzbVnoN69IgDDSyB3Tmcc&mibextid=2JQ9oc", "link": "facebook.com/groups/1373361046396315/permalink/2199651073767304/", "likes": 2, "comments": [{"username": "Anna Izzo", "comment_text": "Kay Maria"}]}, {"id": "2199215610477517", "text": "Looking to plan a 10 day trip- need some help- want to start in rome for a quick day then head to amalfi coast - positano- naples- capri- sorrento and end in milan. Can someone help or tell me best way to do this?\n\nDo I stay at one location and just take ferry to all those places or stay 2 days each location and change hotels?", "link": "facebook.com/groups/1373361046396315/permalink/2199215610477517/", "likes": 3, "comments": [{"username": "Katie Marie", "comment_text": "I planned this whole trip out but ditched it haha. You’d want to take the train from Rome or fly into Naples. Then ferry to one of the ports on the amalfi coast… Sorrento is the closest. Then you can jump from sorrento to positano then Capri."}, {"username": "Miyuki Kanno Paul", "comment_text": "If you want to start from Amalfi coast, then you need to fly into NAP(Napoli) —> Molobeverello Port—> Ferry to Positano or Amalfi. If you are flying into FCO(Roma), then first you take a train to Roma Termini, take a high speed train to either Napoli Centrale or Salerno —> Ferry to either Amalfi or Positano.\n\nSorrento is a great base for ferry rides to Positano, Amalfi, Capri, and Napoli. Once your coastal/\nisland trips are finished, stay in Napoli. Take a high speed train up to Milano Centrale(roughly 4 ish hours).\n\nOr use Napoli as a base and hit all the coastal destinations by ferry. If you choose rail system, Circumvesuviana\nSorrento Line will take you to Sorrento in 90 minutes.\n\nIf I were you, I would fly into Napoli, take a ferry straight to Capri, then another ferry to Positano or Amalfi, ferry to Sorrento, then Napoli.\nIn fact, just two months ago, we did exactly what I just described above except day trip to Positano while staying in Sorrento and omitted Amalfi"}, {"username": "James-Kathy Dickerson", "comment_text": "Train is super easy from Rome to Naples...then in Naples take the ferry to Capri and to the out sites..."}, {"username": "Stephanie Osborn Rushing", "comment_text": "We are about to do this trip. Starting in rome so we can fly direct, and the heading to Pompeii via Naples. Private car supposed to pick us up in Pompeii and take us to hotel in positano where we will be staying."}, {"username": "Kate Carberry Ansart", "comment_text": "That’s a lot of ground to cover in only 10 days. Any particular reason you want to visit Milan? If it were me, I’d do Rome and the Amalfi coast and skip Milan."}, {"username": "Amanda Richards", "comment_text": "I would go Rome - Naples then Sorrento (day trips to Positano, Capri & Ravello) then fast train Naples to Florence on to Bologna then Venice. Milan is fine but it is a big city and a bit soulless."}, {"username": "Nicole Cleaver- Dietze", "comment_text": "We are staying In Sorrento to do Capri island and Amalfi coast/ Positano"}]}, {"id": "2199221607143584", "text": "Has anyone done this tour? The day I have to go see The Last Supper the tickets are sold out but I could go this way. This tour was recommended by Rick Steves. Looks great, just wondering if we skip the line with this tour?", "link": "facebook.com/groups/1373361046396315/permalink/2199221607143584/", "likes": 1, "comments": [{"username": "Leesa Martin", "comment_text": "Follow"}, {"username": "Sarah Lybarger", "comment_text": "This looks interesting! We will only be in Milan for half a day, before we fly home the next morning. Might have to see if we could book this tour for the late afternoon/\nevening!"}, {"username": "Miyuki Kanno Paul", "comment_text": "Make sure that the ticket to Cenacolo Vinciano is INCLUDED"}]}, {"id": "2199229243809487", "text": "Just arrived Lake Como after 4 spectacular days in Venice. This is what you call a \"room with a view\". I LOVE ❤️ ITALY 🇮🇹 Hotel Bellavista, Menaggio", "link": "facebook.com/groups/1373361046396315/permalink/2199229243809487/", "likes": 99, "comments": [{"username": "Marie Cuzzi", "comment_text": "Bellissima"}, {"username": "Shelly Ranck", "comment_text": "Do you mind sharing hotel or Airbnb link??"}, {"username": "Jean Grimes", "comment_text": "Anywhere on Lake Como there is a beautiful view!!"}, {"username": "Mariët Eertman-Heemstra", "comment_text": "They predicted bad weather over there unfortunately, hope you are lucky!!"}, {"username": "Denise Incandela Boccio", "comment_text": "Breathtaking!"}, {"username": "Michele Liggett", "comment_text": "We are doing similar trip, 4 days Venice, 1 day Milan, 4 days Bellagio in Lake Como. Any recommendations\nfor Venice trattoria or osterias?"}, {"username": "Samira Parker", "comment_text": "I'm here too, same hotel, top floor balcony! Enjoying the breeze and the lightning show in the distance."}, {"username": "Amy Parker", "comment_text": "View from our Airbnb in Blevio"}, {"username": "Lorraine Baker", "comment_text": "Lorraine Baker"}, {"username": "Pauline Mokhethi Dolo", "comment_text": "Pauline Mokhethi Dolo"}]}, {"id": "2199320283800383", "text": "Recommendations of places to stay near/in rome, I wish I could say cost doesn’t matter, but it does, we are expecting 3 days, 5 people. I would like some thing with character, but it does not have to be in the city center. I know if you leave the hustle and bustle prices get a little better willing to do bnb, my husband says no hostels. (Goingआणखी April 24, so air conditioning is not important), all the hotels I have booked leading up also charges per person, so the price looks good until I hit total. Hoping to keep it between 800-1200 US dollars, really would like it much lower.", "link": "facebook.com/groups/1373361046396315/permalink/2199320283800383/", "likes": 3, "comments": [{"username": "Miyuki Kanno Paul", "comment_text": "So your budget is USD 800-1200 for 3 nights to accommodate 5 people? Which city in Italia are you talking about? How many adults in your party? Consider renting a villa or house"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Are you squeezing everyone in one room …. Ages ? Where ?"}, {"username": "Cecilia Christine Costantini", "comment_text": "I see all these options on booking dot com. I looked for apartments with 2 rooms for 5 people."}, {"username": "Rhona OConnor", "comment_text": "Use Booking.com they charge per room. Their reviews are accurate and you can use the map to find locations. I use they all the time. They have hotels and apartments."}, {"username": "Deborah Schroeder", "comment_text": "You really want to stay in central Rome as that is where everything is happening. If you look around the central train station, not so great at night but better prices. Moving west from the train station into the Monti area, you might find something there."}, {"username": "Jaime Webber", "comment_text": "We are in the best Airbnb that has Colosseum views from our balcony. It’s by far the best one we’ve stayed in over the past month that we’ve been here. It’s HUGE and has an elevator in the building. I can post the link to the Airbnb too if you want more info."}, {"username": "Maria Brozou", "comment_text": "Check out villa San Lorenzo maria. Not that far from the center and prices are pretty good. Nothing fancy though."}, {"username": "Laura Jetton", "comment_text": "https://\nwww.monasteries.\ncom/en-GB/\ncountries/\nIT?gad=1&gclid=C\nj0KCQjw5f2lBhCk\nARIsAHeTvlgl8_R\nkl8l9Rc86qK168R\nVDguLMFVazp-2Xu\n732_usBQvH60xpV\nrW0aAv57EALw_wc\nB"}]}, {"id": "2199381727127572", "text": "Hi fellow travellers. We’ll be in Milan, Venice, Florence, Rome and Sorrento over the next month and looking for an amazing Italian pasta cooking class in any of those cities. One that includes drinking, dancing and having a great time, any recommendations?", "link": "facebook.com/groups/1373361046396315/permalink/2199381727127572/", "likes": 1, "comments": []}, {"id": "2199383997127345", "text": "Do I need to buy train tickets in advance or can I buy them at the station?", "link": "facebook.com/groups/1373361046396315/permalink/2199383997127345/", "likes": 3, "comments": [{"username": "Linda Miller", "comment_text": "You can buy at the station, don't forget to validate! Buying your ticket from your phone is the easiest I found!"}, {"username": "Anthony McClure", "comment_text": "You can buy them at the station or online"}, {"username": "Elena Innocenti", "comment_text": "Italo and Frecce is better booking in advance to save money."}, {"username": "Michael Galan", "comment_text": "If you buy in advance and your flight is delayed then you are out of luck.\nAs soon as you know you are on time, book them on Omio"}, {"username": "Sandy Radican Shikaly", "comment_text": "Much less expensive booked way in advance"}, {"username": "Lynn Francisco Casella", "comment_text": "No"}, {"username": "Sharon Bowns", "comment_text": "I like to have all my documents in hand before I travel."}, {"username": "Tonsia Keytel", "comment_text": "Trainline, easy to use, avoid long lines at station."}, {"username": "Stefano Bressanelli", "comment_text": "Regional trains : you can make ticket even One minute before.\nIntercity and High Speed trains: you must make ticket to reserve place aboard."}, {"username": "Angelina John", "comment_text": "At the station"}, {"username": "Vasthi Cheddar", "comment_text": "You can buy at the station, but in general high speed trains are cheaper if booked ahead of time"}, {"username": "Nadia Filice", "comment_text": "At station. Give yourself time to buy them."}, {"username": "Albert Soifer", "comment_text": "You can buy them at the station but make sure you know the exact station/city you are going, Iin Italy there are 2 systems, EuroRail and Italian Rail, make sure you know where you are going and which Rail you will need. Generally in Italy city to city will be Italian Rail and it will be Euro will be between countries."}, {"username": "Frank Hunt", "comment_text": "Use the Trainline app and save all the hassles at a busy station and always prebuy in busy periods."}, {"username": "Clint Madsen", "comment_text": "Beware of the station attendants that “help” you purchase your train tickets, check your tickets carefully as we had to pay an extra 100 Euros to return to Florence from Venice last fall to catch the only train. Our helper booked us an extended stay of a week, we never were able to recoup our loss as we were referred to their website to straighten things out. 🤬"}]}, {"id": "2199387330460345", "text": "Hi there! Planning a 10th anniversary trip for my husband and I. Italy is our destination. We will have 7-8 nights (not including travel there/home).\n\nWe want to explore, eat amazing food, and soak up everything Italy has to offer. I know we can’t possibly see the entire country in that time. But could we reasonably explore Florence, Rome, and theआणखी Amalfi coast in that amount of time? How should we split it up? Should we eliminate one? We want to enjoy somewhat luxury accommodations as well.\n\nOur anniversary is in March, but I’ve been told we should wait and go in May. Any merit to that?\n\nWe are so excited for this trip and I love planning, so send me all the tips and advice! 🙂", "link": "facebook.com/groups/1373361046396315/permalink/2199387330460345/", "likes": 6, "comments": [{"username": "Raelyn Werbish Zeilinger", "comment_text": "Hi ! I am also planning an anniversary trip for my husband and I am planning fly into Rome and do 3 days, train to Florence and spend 3 nights and do a day trip Tuscany and then train Venice for a few days then fly home with maybe quick stop Paris , seems all flights Venice stop Paris way back anyway , nights as well spend a few days !\nGood luck with your planning ! I’ll look forward to the comments on your post to help me as well !"}, {"username": "Steve Grossman", "comment_text": "Amalfi Peninsula is usually a four or five night stay. So save that for another trip. You can do a great trip to Florence Rome with Tuscany in between.. You will have a chance to drink some incredibly good wine. Enjoy. Absolutely go in may"}, {"username": "Emily Pearce", "comment_text": "I'm going next June. We're doing 4 nights in Florence, 2 nights in Amalfi, 3 nights in Rome. We're coming from a week in Switzerland so not able to do any longer. If we could, we would probably add an additional night in the Amalfi coast.\n\nHope this helps, enjoy your anniversary trip! 🙂❤️"}, {"username": "Dana Talusani", "comment_text": "If you are dead set on the Amalfi coast, yes, I would definitely wait until May. So gorgeous then!"}, {"username": "Phyllis Snyder", "comment_text": "ASP purchase Rick Steve’s Italy travel guide! And start watching all the wonderful utube videos about traveling Italy!"}, {"username": "Grg Cozzetto Oetterer Mra", "comment_text": "As an Italian that lives in Tuscany, for only 7 full days, Rome ( 4 days ) and Florence ( 3 days ) maybe a day trip to Pisa or Siena"}, {"username": "Courtney Soloff England", "comment_text": "We are going for my 40th birthday (leaving Saturday!!) and we are doing just that. Florence, Rome & Positano. I'm so excited."}, {"username": "Nikki Niks", "comment_text": "We flew to Rome and did 2 days. We saw everything possible except Vatican City. We did a ton of walking with a baby. We took the train to sorrento and did the Amalfi coast for 7 days. 5-7 in Amalfi at least."}, {"username": "Michelle Solak", "comment_text": "I haven’t been to Florence but I would probably do 2 nights Florence, 2 nights rome, 3 nights amalfi coast. Also depends what you want to do in each location 🙂"}, {"username": "Margo Desjardins", "comment_text": "Hi , I’m flying into Rome but don’t want to stay there"}, {"username": "Margo Desjardins", "comment_text": "Oops pressed the wrong button, I’ve been to Rome so we Want to do Venice, Florence and the Amalfi coast , my question is should I start in Venice and work my way to Florence and the the amlfi coast or do the coast first and then back to Venice."}, {"username": "Roland Trego", "comment_text": "I would split your time between Rome and the Amalfi Coast. Four days on the Amalfi Coast and three in Rome."}, {"username": "Jeff McLellan", "comment_text": "One night in Rome wouldn’t be worth it."}, {"username": "Daisy Yoo", "comment_text": "U will\nNeed to skip 1 for sure , for me 7-8 days is hardly enough for just Rome and a bit of Florence . Unless u do not need any side trip from Florence , I am doing 5 days in rome (and I do not think it is enough as Rome is far more than just the typical places ppl visit) Florence itself needs 2 full days (again more than just what ppl say u need to see) then there are at least 4 places not far from Florence u should visit , that also needs at least 2 whole days"}, {"username": "Louise Savage", "comment_text": "I am looking at travelling to Sorrento and surrounds in early November. Is this a good time to visit?"}, {"username": "Crystal Harte", "comment_text": "For that amount of time I would suggest fly into Rome to arrive morning or midday stay at least three nights in Rome then choose either going to Florence or Almafi (depending how much you love the ocean) I would choose Almafi and go in May (though I loved Florence). We just spent 13 nights in Italy in May and it was awesome and yes rent a car (on the day you leave Rome) or hire a driver to take you to Almafi. We took a taxi $50 euros flat rate back to the airport first thing in the morning to rent a car and drove to Positano. Stayed in amazing Air bnb and had incredible dinner overlooking the water but be ready for a lot of stairs and hills. Parking was 50 euros a night in Positano. If you stay longer then add more places. We did 3 nights Rome, 1 night Pompei, 2 nights Positano, 1 night Florence, 2 nights Cinque Terre, 1 night Milan, 1 night Venice, 1 night Tuscany and that was a lot of travelling in a car and well planned out. I would go back and stay a week in Positano or a week in Tuscany. Whatever you choose will be great it just depends what you want to see so make a list of must sees then choose, you can’t go wrong but you can always go back to Italy again."}, {"username": "Terry Pisano", "comment_text": "Definitely not enough time for all 3. What would you see in Rome for one day/night? Save Florence or Amalfi for another trip."}, {"username": "Donna Winter", "comment_text": "For a short stay and your want to see the most, I would recommend a tour. Trafalgar does an excellent job and you will not be disappointed. You will also have all the legwork done for you. Have a fantastic trip"}]}, {"id": "2199385777127167", "text": "Looking for AirBNB recommendations for Venice, Cinque Terre, Florence, Tuscany and Rome. Thinking we’ll fly into Venice and fly out of Rome for a 2 week trip. Planning to rent a car in Florence or Sienna for our Tuscany stay which will probably be our longest stay for 4 to 5 days. It will just be my husband and me. Looking for great hosts and notआणखी to pricey. We love traveling and staying at Air BNBs and have had so many wonderful stays and adventures due to a host’s recommendation. We are likely traveling next fall (2024) or the following spring and yes I’m a planner. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2199385777127167/", "likes": 125, "comments": [{"username": "Jen Alexitch Rachow", "comment_text": "In Florence I stayed at one in 2019 which is no longer listed near Santa Croche Church. It was quieter and walkable to all the sites. The thing about Florence is that you can walk from one end to the other is 30 minutes passing all the major sights along the way. If you stay in Oltrarno stay close to the Arno. I looked at many Airbnbs that overlooked the river that looked beautiful and affordable. In November I am staying in one right on Piazza San Lorenzo overlooking the Medici chapel. Looks great. I read the reviews and make decisions in where to stay based on the positive experiences I see."}, {"username": "Bev Madill", "comment_text": "For the Cinque Terre, I can highly recommend Alla Marina apartments in Riomaggiore, particularly their apartment called Atlantis with a balcony overlooking the sea.\n\nhttps://\nwww.allamarina.c\nom/index-en.php"}, {"username": "Lorrie Nolan Masset", "comment_text": "We are going on Oct. 2023. Have reserved VRBO farmhouse in Tuscany, just outside of Florence. We have an Airbnb in Riomaggiore, Cinque Terre, ￼ another Airbnb in Venice. In Rome, we are staying in a monastery, and in Sorrento we found a vacation apartment throughbooking.\ncom. I can’t say I recommend them till I stay there. ￼"}, {"username": "Lisa Jackson", "comment_text": "Follow"}, {"username": "Ryan Monahan", "comment_text": "Great plan. We did the reverse, into Rome and out of Venice. Book a private water taxi from the airport to your hotel or bnb in Venice. The ride into the city will be such an amazing way to start your trip!!!"}, {"username": "Ryan Monahan", "comment_text": "We LOVED Hotel David in Florence. Also included parking which is awesome if you have a rental car. We also loved Il Centro in Manarola. It was an amazing room, great for a couple. PM me if you need info on either."}, {"username": "Stephanie Saenz Bauer", "comment_text": "Just got back and stayed at 3 great airbnbs all with helpful owners. I will try to forward in messenger."}, {"username": "Stephanie Saenz Bauer", "comment_text": "Stephanie Saenz Bauer"}, {"username": "Stephanie Saenz Bauer", "comment_text": "Stephanie Saenz Bauer"}, {"username": "Stephanie Saenz Bauer", "comment_text": "Stephanie Saenz Bauer"}, {"username": "Cheryl Caferro Shul", "comment_text": "Following"}, {"username": "Fiorenza Bruni", "comment_text": "For Tuscany, try the agriturismo Podere San Bartolomeo…tran\nquil, beautiful, wonderful proprietors Roberto (a retired doctor) and Gabriella. Roberto Taviani"}, {"username": "Alexandra Kassianos Matthews", "comment_text": "Following!!!! ❤️❤️❤️"}, {"username": "Heather Lynn Brown", "comment_text": "Stay in the pescile area by san gimignano! We stayed at hotel pescile... beds were just OK but everything else was perfect! Decent price, big room, balcony, near a restaurant and wineries."}, {"username": "Lenee Jorgenson", "comment_text": "The NH Collection has a Boutique Hotel in Rome that is special. Try it!"}, {"username": "Angela Humbles Searcy", "comment_text": "We stayed in Piombino, Italy and drove to Florence and surrounding areas. It is the most adorable town. Loved it! Did AirBnb all over Italy. So fun to get to know the locals. Have a great time!"}, {"username": "Jud Luli", "comment_text": "En san gimigniano para alojarte agriturismo Cesani...cerca de Montepulciano Albergo Montecarlo"}, {"username": "Diane Langlois", "comment_text": "Stay tune I’m doing exactly that itinerary this September for 17 days but have rented only one AirBnB, in Siena. And I am a planner too. You’ll know it all !"}, {"username": "Tracey Sedorovich", "comment_text": "Careful where you stay in CT. The train runs right through and if you’re too close to it, you’ll hear it all night long."}, {"username": "Lynda Miller", "comment_text": "We stayed at some fantastic Airbnb’s on our recent trip. All in good locations with brilliant hosts and spotlessly clean. Can highly recommend all three. Scala 42, Simona’s place in Rome. Rio di San Barnaba Flat in Dorsodura, Elena’s place in Venice. Montepulciano Downtown Storico, Lorenzo’s place in Tuscany."}, {"username": "Sue Z. Beers", "comment_text": "I don’t have any recommendations\nfor AirBNB, but I can give you the name of a terrific tour guide in Venice."}, {"username": "Donna Miceli Agostino", "comment_text": "I highly recommend Ludovisi Airbnb in Rome"}, {"username": "Taryn O'Neill", "comment_text": "https://\nstayinriomaggior\ne.com/\ncinque-terre-gue\nstrooms-jk-rent\nals/"}, {"username": "Jadene Kay", "comment_text": "Whatever you do, DON'T rent a car IN Florence. It's very difficult to maneuver getting out of Florence (even with GPS). We rented a car near the train station and found getting out of Florence but also returning the car was challenging. We used GPS and went exactly what it said and we received a traffic ticket from the EU (about 4 months later) for entering a restricted zone which was about 2 blocks from the rental car company and we had no idea. I would suggest taking a train to a smaller town and renting from there."}, {"username": "Joyce Zaccaria Testa", "comment_text": "Any Airbnb recommendations\ndown south in Capri? Surrounding areas,\nPositano?"}, {"username": "Jill Dempsey", "comment_text": "My new place in the Cinque Terre will be ready by then. I was just there for 6 wks & now my contractor is adding a couple bathrooms & ac. Its in Corniglia, the village right in the middle. This is from my 4th floor, the rooftop oceanview terrace. Its fabulous!"}, {"username": "Donna Brown Oliphint", "comment_text": "Loved Florence. Would love two days just for the Uffizi gallery."}, {"username": "Joanna Journet", "comment_text": "Valdirose bnb just outside Florence, 12 min train ride into Florence. The most beautiful place I’ve stayed in all the bnb’s I ve been to in Italy."}, {"username": "Kelly Keim", "comment_text": "I too and planning a trip with a group of girlfriends. Someone mentioned today to look at a personal driver. Apparently cheaper than hire car and even the train. Does anyone have thoughts or experience on this?"}, {"username": "Elana Zlatkin", "comment_text": "In tuscany we used farmstay, recommend. IL Segreto di pietrafita with a views of San Gimignano towers. Visit Tenuta Torciano Winery 10mins away, ans a must experiences"}, {"username": "Lydia Springer", "comment_text": "Explore VRBO and use the filter where you can select top reviews only. Put in your requirements. Expand the photos and review them carefully. Read the reviews carefully. That's the most important part. If you have questions contact the host. Their response will show what kind of host they are and what type of service you can expect. In my experience, they are always happy to provide information. With this search criteria you are pretty much guaranteed a good outcome. That has been my experience."}, {"username": "Joan Lapera", "comment_text": "Use booking.com"}, {"username": "Deborah Schroeder", "comment_text": "Get the car in Siena."}, {"username": "Brad Nelsen", "comment_text": "Rome: Little Queen Relais"}, {"username": "Cassie Ann", "comment_text": "I did a similar trip- minus Venice. Loved driving from sienna. My Airbnb was in cinque terre / manarola and not up the hills. The people hauling luggage up all those steps were miserable. I’m sure they had good views though!"}, {"username": "Susan Van Note", "comment_text": "The place I stayed is probably too big for your party, I’d recommend you stay across the River while in Florence."}, {"username": "Billie Frances Swanda", "comment_text": "Look in Frommers guide"}, {"username": "Victoria Marchetti", "comment_text": "Make sure you check if there AC if you are traveling in the hot months. We over looked that detail and half our places did not have AC and it was warm till it cooled off at night."}, {"username": "Sharon Hunt Scarpa", "comment_text": "Wonderful info! We are doing almost the exact same this September"}, {"username": "Maria Piccolo Stern", "comment_text": "I haven’t read all of the comments, but I’m sure someone has said it’s not too early to book. If you try to find something right now for September, you wouldn’t be able to!"}, {"username": "Hilary Pickett", "comment_text": "In Venice right next to the La Feniche Theatro… on third floor with a balcony… beautiful place in San Marco."}, {"username": "Jan Buess", "comment_text": "That was my attitude to book my vrbo unit. It's nothing fancy but in the city center but the real reason was Silvia the host. She got so many great reviews and tho I booked super early, she has been wonderful and patient. Going there in about 6 weeks and can't wait. The vrbo # is 895548ha. Hope this helps!!"}, {"username": "Nancy Gottesman Mann", "comment_text": "We are staying in “monterosso rooms” that I booked on booking.com. Great location and great host!!!"}, {"username": "Bernadette Sarmiento", "comment_text": "Hi all, for those that have stayed in Rome, if given a choice for Airbnbs location, where is there more to explore - Parione or Campo Marzio? I appreciate your input 🤔😉"}, {"username": "Renee Dillenbeck", "comment_text": "I looked up a couple of the places mentioned and they were $600 a night. I’m curious what is inexpensive? I’m coming the end of October and doing a similar trip and looking for places to stay because we just need convenient places to sleep. I was looking at monasteries or an agriturismo for 4 of us."}, {"username": "Mia Catalano", "comment_text": "We’ve just left Florence, we stayed in an apartment called the “Giardino Della Fortezza apartment” highly recommend! It’s owned by “clean bnb” they have apartments all over Europe. We also did a day tour to Cinque Terre which was so good and well organised! My personal opinion, I wouldn’t stay in Cinque Terre unless you enjoy hiking and the beach 😀"}, {"username": "Michelle Iske", "comment_text": "Just stayed here in June! Absolutely beautiful!! In the thick of Tuscany!!!"}, {"username": "Debi McGrath", "comment_text": "I'll let you know when my trip is done in October, this is the same route I am doing, I am also adding in Sicily and amalfi and small part of Basilicata. I am there for 6 weeks. Booked Airbnb throughout."}, {"username": "Brenda Martinez Schafer", "comment_text": "We loved this place! The view was amazing. https://\nabnb.me/\n23gSQ7yfJBb"}, {"username": "Alisha Young", "comment_text": "Skyloft in Rome!!! It’s absolutely beautiful and the location is perfect. This place is hands down 5 ⭐️! You have the top floor and the views of the terrace is stunning!! Close walking distance to everything and the best part is the sweet lady who owns the loft, Frances. She’s such a nice person and goes above and beyond for her guest."}, {"username": "Alisha Young", "comment_text": "View from rooftop at Skyloft in Rome.\n\nI also would not recommend driving in Siena as the town has a ban on driving in the town center and the streets are extremely narrow.\n\nIf you would like Frances info I would be more than happy to give you her contact information."}, {"username": "Leanne Dawn Sutton", "comment_text": "I would add a week! If you can"}, {"username": "Ian Fawkner", "comment_text": "Sweet Home in Siena and Lovely Balcony in San Gimignano are two recommendations\nfor you Julie."}, {"username": "Wendy Wood Cullum", "comment_text": "We stayed in Pienza at a working farm\nWe had a large apartment . It was cheap. Casella turugi 8. Look up agritourism"}, {"username": "Rachel Adam", "comment_text": "Nothing wrong in planning Julie ! You have the identical plan as we do next April 👏"}, {"username": "Becky Lewis", "comment_text": "Awesome hosts! Very travel friendly. They had maps marked with food recommendations\n, sites and walking distances, met us at door and helped carry our luggage, walked us through the flat and showed us how to work everything, sent suggestions through Instagram messages while there, place is decorated with lots of travel and language guides. Flat is up 3 flights of stairs"}, {"username": "Becky Lewis", "comment_text": "Great location in central Rome right around the corner from the Pantheon. We walked everywhere and it was doable. Perfect location, 2 bathrooms, several flights of stairs to get to the flat, perfect location in Rome...can't say that enough."}, {"username": "Becky Lewis", "comment_text": "This place was huge, 2 bathrooms, really nice rooftop terrace. Location was ok, about 25 minute walk to the Coluseum and same to Spanish steps. Seemed to be in a more residential area of Rome, modern streets (not cobblestone), not close to attractions but close to food and quiet location. Host was very attentive."}, {"username": "Christine M Machacek", "comment_text": "I found a place in Rome near the Trevi Fountain and Pantheon through the Airbnb. The address is Via di Pietra, 84, Rome, Lazio, Italy. The place looks nice. I’m staying next Sept."}, {"username": "Lea Brannam", "comment_text": "😍"}, {"username": "Joanie Corneil", "comment_text": "Too much in such a short time."}, {"username": "Rhona OConnor", "comment_text": "Check Booking.com for apartments. Less issues than with Airbnb. Don't try to do too much. Allow time to sit absorbing 🇮🇹"}, {"username": "Melissa McCormick", "comment_text": "Casa Angelina by Giuliana in Venice. It was the perfect location. She was a great host. She managed our taxis to and from the airport/\ntrain station. She had dinner recommendations. It was clean and not over priced. It was a 4 bedroom 2 bath and a kitchen. I highly recommend especially with the location being close enough to walk most places but just outside the business of Venice. Felt like we got more of an authentic point of view."}, {"username": "Mariposa Mariposa", "comment_text": "Interested in getting this information as well."}, {"username": "Sande Ricci", "comment_text": "We stayed in a great VRBO in Florence in Santa Maria Novella Square called Giotto Apartment. $139.00 a night. I don't think I'm allowed to share the link. It was great. Clean and close to the train and everything you would want to see."}, {"username": "Amy Sandler Riemer", "comment_text": "Message me."}, {"username": "Fetchin Gretchen", "comment_text": "Look for superhosts with recent great reviews. You need to see what's available for your dates etc so no one can really recommend specific places as they could all be booked for dates needed."}, {"username": "Amy Sandler Riemer", "comment_text": "We are doing the same in October but starting in Verona 2 nights, then Venice 3 nights, Florence 3 nights and Siena 1 night, cinque terre 2 nights, Rome 4 nights and Milan one night. Hope it’s not too much. We are family of 4 with two sons who are 21 and 24. We are packing light with each a carry on and personal item, using cubes in carry on. Using trains and buses between places."}, {"username": "Alice Francesca", "comment_text": "https://\nwww.italia.it/\nen/tuscany/\nthings-to-do/\npienza-the-ideal\n-city\n\nThe best place to stay in Tuscany. From Siena drive south about 1 h and a half to the Val D'Orcia.There you will find the authentic Tuscan scenery: rolling hills, cypresses, lovely medieval villages.\nIn Pienza I always stay at CHIOSTRO DI PIENZA RELAIS.It' s a former convent from the middle ages, with stunning views of the valley.\nIn BAGNO VIGNONI you can unwind at the spa of the POSTA MARCUCCI hotel.natural warm spring water, two large pools in a garden.\n\nPlease check all the above on google.\nEnjoy!"}, {"username": "Kristi N Doug Leonard", "comment_text": "These were the Airbnb’s we stayed at in March. They were both great & even better than the pictures. Both situated in local areas, but close enough to walk to & or catch buses/trains/\ntaxis & the main attractions.\nFlorence one was in Firenze & the Rome one was in Trastevere.\nWe absolutely loved our 2 weeks in Italy!"}, {"username": "Lisa Ferraro Breitbach", "comment_text": "In San Lorenzo della Costa, there is an Airbnb called \"the barn among the olive trees\", hosted by Claudio. It's rustic, but clean, simple and quiet. There are steep stairs to the send floor, but it was comfortable and the hosts are amazing!"}, {"username": "Dann Hrusch", "comment_text": "Lots of AirBnBs to pick from in Cinque, but I definitely recommend getting one with a balcony. As for Tuscany, consider staying at a winery. We stayed at the Salvadonica about 45 mins south of Florence and loved it. Beautiful grounds to wander, pool, did a wine and olive oil tasting, has a great restaurant..."}]}, {"id": "2199389853793426", "text": "Has anyone stayed in Montecatini ?\nAny tips ? We are staying at Montecatini LHP Hotel Montecatini Palace.", "link": "facebook.com/groups/1373361046396315/permalink/2199389853793426/", "likes": 0, "comments": [{"username": "Kath Milburn", "comment_text": "Yes. Stayed a couple of nights. Take the funicular up to the old part and have an evening meal. All the tables are on a slight slope so great fun can be had. Beautiful sunset to be seen from there. Enjoy."}]}, {"id": "2199390900459988", "text": "I just want to say again that I so enjoy this group with your pictures, your helpful hints, your amazing stories.", "link": "facebook.com/groups/1373361046396315/permalink/2199390900459988/", "likes": 8, "comments": [{"username": "Mikel Ann Hall", "comment_text": "Me too! ✨"}, {"username": "Patty Maffei", "comment_text": "Me too"}, {"username": "Mary Mol", "comment_text": "Me too"}, {"username": "Tracy Foss", "comment_text": "👍"}]}, {"id": "2199393300459748", "text": "Are the seats in the main cabin on an American Airlines flight comfortable enough 4A 9 hour flight from Chicago to Rome?\nIs it worth paying double for the premium seat?", "link": "facebook.com/groups/1373361046396315/permalink/2199393300459748/", "likes": 14, "comments": [{"username": "Bonnie Loftspring", "comment_text": "I have paid my dues to life & family, now it’s me! I go best seat possible, get there like a human being, get treated beautifully. Yes, the cost was frkn crazy, my kids will get less inheritance, lol!"}, {"username": "David Westerfield", "comment_text": "We flew Dallas to Dublin last year on American and we paid a little extra just to have extra legroom and that was absolutely worth it. I'm 6'1\" and I would definitely do that again."}, {"username": "Greg Struthers", "comment_text": "We flew from ORD to FCO last month, and I had purchased Premium Economy for us. Not exactly sure how it worked out this way, but when I went to select our seats, I was able to select Business Class seats/pods without any additional upgrade. I've flown a few times to & from Europe in regular economy and can say the splurge for this trip was well worth it and was absolute luxury to us. Our return flight (from London) on British Airways was Premium Economy, but it was just the \"regular\" seats with a bit more room -- still better than regular economy, though. If you're the type of person who's able to fall asleep on takeoff and not wake up until landing, or if you don't need a lot of room to stretch out, save your money and go economy. Otherwise, if you have the budget, give some serious consideration to an upgrade."}, {"username": "Meg Thornton", "comment_text": "On American, I usually pay a smidge more to get the first row of economy seating. I take sleepy medicine when I fly, so it’s not really worth it for me to pay too much more - plus I’d rather spend the money on experiences and more vacations!"}, {"username": "Tara Dix", "comment_text": "I quite regularly fly transatlantic, and the regular seats are fine. Save the money to do something fun when you get there!"}, {"username": "Karen Smart", "comment_text": "We did Main Cabin Extra which is a little more leg room but only $120 more. Didn't want to spend anymore than that on the flight."}, {"username": "Alba Fekete", "comment_text": "Premium and coach are the same seats just with more leg room first class are larger or wider seats"}, {"username": "Hannah Woods", "comment_text": "We are in Rome currently and just flew that same flight from row 26. Was not too bad but could have used the extra leg room"}, {"username": "Denise Ward", "comment_text": "We survived it. It was tough, but I got up and stretched a lot. I even changed into stretchy pants after takeoff so I could curl up a little easier, then changed back before landing so I didn't look like I was in pj's lol"}, {"username": "Andrea Stewart Graham", "comment_text": "It was really uncomfortable for me and I’m only 5’1”. I didn’t get any sleep. Ours was 11 hours though. If you can afford it, would pay."}, {"username": "Annette Tamminga", "comment_text": "All depends where you are in life. When I was young, I flew economy, and now that I am older and can afford it I never fly less than business class."}, {"username": "Jeff Petrilla", "comment_text": "Put your flight into seatguru.com so you can see what seat specs you’ll have on the plane you’ll be on. Maybe that will help you decide."}, {"username": "Mary Ann Mills", "comment_text": "We are flying delta air in late September. I just called yesterday. There are no upgraded seats available for us. The planes are going to be packed."}, {"username": "Carol Taylor Tisdale", "comment_text": "It’s worth the upgrade. Absolutely."}, {"username": "Tracy Foss", "comment_text": "If u can afford it YES"}, {"username": "JeriLynne Clifford", "comment_text": "Yes! We did the premium economy last year to Italy. The flight back got cancelled so we got stuck in main and the comparison was palpable.\n\nWe could sleep overnight so we could stay awake when we got to Bologna.\n\nIf you can swing it, I say go for it."}, {"username": "Renee Rundle Stoneham", "comment_text": "They are the same MC seats as domestic with the same legroom etc…\n\nThey are fine. Are they super comfortable? No. Adequate.\n\nI have always flown economy seats, (3 trips to Europe last year) this year I booked PE seats. They were only $400 more RT, not double the ticket price! I searched times and connections etc and got the cheapest PE seats. Business was 3x the ticket price.😱\n\nBut PE seats are a game changer for me! Soooo much more legroom, nice wide seats, plenty of arm rest room on center seat etc… felt very pampered ( for an economy girl!😂)\n\nSooo if you’ve got the money… go for it!"}, {"username": "Lee D'Angelis", "comment_text": "Fly premium economy if you can."}, {"username": "Patsy Carol Wicker", "comment_text": "If you don’t have an assigned seat, you may be able to get on the app you used and select a more desirable seat for approx 40.00. I did it a a trip to Rome and Barcelona recently. Good luck and have a wonderful trip."}, {"username": "Peggy Frasca Prichard", "comment_text": "We splurged on business class for our flight to Rome in September. Actually looking forward to it. Delayed 30th anniversary and we’re worth it!"}, {"username": "Phyllis Snyder", "comment_text": "You can prepare yourself for long haul flights to make it as comfortable as possible- even with economy seating. I’ve been watch several utube videos on this very topic. Very helpful information!"}, {"username": "Kim Smith", "comment_text": "Try flying from Australia economy.. 9 hours is only the first stop over !!"}, {"username": "Melissa Reyes", "comment_text": "We did main cabin to and from Barcelona . It was annoying when the people in front of us put their seats back . My legs did swell on the way back"}, {"username": "Shelley Howard", "comment_text": "was for me for 13hrs ...rather spend my money on better stuff .."}, {"username": "Marie DeMarco", "comment_text": "Yes it is the dream liner is not that great for a long flight like that"}, {"username": "Dann Hrusch", "comment_text": "Not worth it to pay more. Ten of thousands of people sit in those seats everyday for 9 hours or longer and are just fine. You'll be talking about Rome for years to come. Seats on the plane will barely be an afterthought."}, {"username": "Stacy Marie", "comment_text": "I divide the price difference for the upgrade by the amount of hours in the flight and see if I want to “make that much an hour” to sit an a less comfortable seat. ￼"}, {"username": "Kim Crozier", "comment_text": "Mary Ann Mills try to get at least an exit row"}, {"username": "Mike Drelicharz", "comment_text": "Yes, they are comfortable enough. It is not worth paying double for more comfortable seats."}, {"username": "April Vernon", "comment_text": "Pay double!!!!!"}, {"username": "Ian Beyer", "comment_text": "Depends on the seat and the aircraft."}, {"username": "Jena Wehmeyer Seibel", "comment_text": "Depends on your height and size. If you’re over 6ft not a lot of leg room. If person reclines in front of you takes up a lot of that leg space- are you ok with that? If so good to go. If need to stretch legs often etc then should upgrade to plus or whichever has more leg room. Helps a ton."}, {"username": "Brenda Dsouza", "comment_text": "nope"}, {"username": "Meg Bowen Beauchamp", "comment_text": "I’m a flight attendant . That route is serviced by a 787. I’d say they are okay for 9 hours. If you can get row 24 or row 12 in MC that’s ideal. For me, I’d pay extra for Premium Economy."}, {"username": "Paige Wood", "comment_text": "They were pretty bad but we survived and spend the money on experiences for our trip instead.\nTo put it into perspective, it’s less seat and leg room than a southwest flight"}, {"username": "Tricia Johnson Blakney", "comment_text": "If it’s an overnight flight, we always go for premium or business. That way we can try to get some rest. We stick to MC for the way home because it’s usually a day flight. That’s a good way to save you a little money."}, {"username": "Dave Anderson", "comment_text": "I’ve travelled a lot to Europe and China. I will say business class is much more comfortable than main cabin seating. You just have to decide if the big fare increase is worth it. My wife and I are flying direct from DTW to Rome in Sept and seated in main cabin. 9 hrs is tolerable vs 16 hr flight time to China; that would be rough in MC!"}, {"username": "Rebecca Carroll", "comment_text": "First class is nice when you get a free upgrade but we get there at the same time I’d rather just get the cheapest tickets and spend more money once I get there"}, {"username": "Donna Hinton", "comment_text": "We did economy, it was ok."}, {"username": "Sonia Scotto Lubrano", "comment_text": "I fly yearly to Italy EWR-NAP and always in MC bc I’m cheap 😆"}, {"username": "Lauretta Strysik Carroll", "comment_text": "Same flights - and doing premium seats. Especially going there. We feel it’s definitely worth the extra money - getting more comfortable seats and only two in the row."}, {"username": "Paula Bodden", "comment_text": "In my opinion well worth the upgrade to premium economy."}, {"username": "Monica Colontonio Macho", "comment_text": "Pay for premium and book the very first row, you will have more leg room. We were very happy with it."}, {"username": "Bobbie Lane Hausherr", "comment_text": "They’re comfortable enough if it’s all you can afford‼️"}, {"username": "Raelyn Werbish Zeilinger", "comment_text": "I just flew Ireland and back 7 hours and was in main cabin and totally fine , cause alls you do is watch movies and sleep on an overnight flight anyway ! Save money for food , hotels and excursions! Plan on booking Italy next year and will stick to the main cabin as well , flights are expensive enough right now , but gosh looking at people in first class I was jealous! ( my husband 5’11 and had no c/0)"}, {"username": "Meredith Holloway Helbon", "comment_text": "We won’t do anything less than premium economy. We flew economy once back from England - and never, ever again. If you have long legs - it’s not even a bougie thing - it’s just that your knees will literally be IN the seat in front of you. It’s ridiculous.\n\nWe fly premium economy to Italy in a month, and business back. Sometimes the extra money is just worth it. The difference in the way they treat people between premium economy or higher, and economy, is also outrageous. I’ve never in my life felt as much like a third class citizen as I did sitting in economy. Never, ever again.\n\nI say it’s absolutely worth upgrading."}, {"username": "Kim Geary Keidel", "comment_text": "My son in law is 6’7” so he wouldn’t fit in economy. We all opted for Premium Economy and we’re glad we did. It was worth the extra cost to us."}]}, {"id": "2199394353792976", "text": "I have a limited time in Florence . Woukd you choose the Vespa tour or fiat tour? Two adults", "link": "facebook.com/groups/1373361046396315/permalink/2199394353792976/", "likes": 1, "comments": [{"username": "Pao Magnoler", "comment_text": "Vespa!"}]}, {"id": "2199399307125814", "text": "I have been researching The Tour Guy to see all the sites in one day. We are staying at The Westin. One review said they were not returned to their hotel and had to take a taxi. Does anyone have info about this? Also when they say “Skip the Line”, is it really saving us time?", "link": "facebook.com/groups/1373361046396315/permalink/2199399307125814/", "likes": 1, "comments": [{"username": "Cindy Gallen Barton", "comment_text": "We used The Tour Guy for a skip the line tour of the Vatican. They were great, we were in before many of the other tour groups and got to the Sistine Chapel at opening so it was not as crowded. Tour guide was terrific. We also did a Capri boat trip which was also excellent. There was pick up and drop off at hotel. I saw that some tours only had hotel pickup, you need to really read the description of what is included. The Tour Guy is also great if you call with a question."}, {"username": "Lisa Valdovinos", "comment_text": "We did skip the line and it was worth it. Those lines are really long and we went right by them."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2199401997125545", "text": "It would be very interesting to just manage with carry on only as I always take too much and I experienced the large suitcases over the cobblestones! I can't find the comment that I wanted to answer in regards to Carry on luggage limits.\nI live in Australia and our National carrier Qantas hand luggage limit is 7Kg Economy, 10Kg Premium Economy. It is the same for Etihad and Emirates that I have also travelled with.\nWhat is the secret?", "link": "facebook.com/groups/1373361046396315/permalink/2199401997125545/", "likes": 3, "comments": [{"username": "Yvonne Ormson", "comment_text": "Buy ultralight carry on luggage. Laundry services (wash/dry/\nfold) are everywhere so you really only need a week’s worth of clothes. We are retired and travel for months at a time with just carry on. So much easier and you can buy anything you need :-)"}, {"username": "Fetchin Gretchen", "comment_text": "Secret is you wear the sane things every day or buy there. However they are checking roll bags on many flights these days."}, {"username": "Ryan Shearer", "comment_text": "Ultralight case. Soft sided canvas is probably the best and you can easily do carry on. Family of 4 and we had 7.5 a person."}, {"username": "Robyn Lawson", "comment_text": "I am from Aus too. I usually take a small suitcase (with 4 wheels ) and check it in, plus a carry on smaller bag. Usually works well. 😊"}, {"username": "Sharon Bowns", "comment_text": "You can Google Erica’s and Emirates."}, {"username": "Lisa Kelly", "comment_text": "We’re midway through 3 weeks with only a small carry on each. And I realize I brought things I really didn’t need. Doing laundry is the key. We’ve had W/D at a couple Air B&Bs and a laundry service at another. We have no trouble on the trains and watch those with lots of luggage struggle."}, {"username": "Andrea Bainbridge", "comment_text": "We spent 6 weeks in Italy and Switzerland with carry on only. Underwear and shirts easily washed out in a sink.\n\nRemember no one cares what you’re wearing. I wear a lot of black! 😃"}, {"username": "Gillian O'Callaghan", "comment_text": "You need to check the measurements on individual websites."}, {"username": "Stefanee Woodham", "comment_text": "This is what we took for 6 weeks 12 countries we are from Nz flew qantas and Emirates and lots of other airlines. Our bags were from Kathmandu 35 litres go from backpack to suitcase . No problems at all with any airline train or boat re carry on highly recommend"}, {"username": "Jann Kinsela", "comment_text": "US hand luggage has different bag dimensions and not the 7kg carry on limits that we have in Australia."}, {"username": "Graham Sherlock", "comment_text": "Just check on their websites"}, {"username": "Sandy Michelle Duggan", "comment_text": "we just travelled with Emirates Aust to Italy, it was 7kg carry on 30kg checkin"}, {"username": "Sandy Michelle Duggan", "comment_text": "We took checkin backpacks, and I packed far to much, and it was heavy to carry around"}, {"username": "Shelley Howard", "comment_text": "The secret Is 99% of people who travel carry on are not like us from Oz or nz .. seems like most American airlines don't have weight limits just size limits .. im checking in a med sized bag and my carry on fits inside it.. so its not heavy.. im going for 2 months si 7kg is 2 outfits...my case is 55ltr and has backpack straps and wheels only 1.9kg empty .. so far it's at 12kg packed .."}, {"username": "Sherrin Wake Bracci", "comment_text": "We are travelling from Australia for 5 weeks and doing carry on only. It is very easily done. Check the website for each carrier. We are flying Singapore into London, Ryanair to Italy and Malta and home with Emirates."}, {"username": "Jenny Payne", "comment_text": "I go a lot to Italy from Australia, I use Qatar, I wear a crossbody + backpack & carry on small case that isn’t a problem for me🌻"}, {"username": "Melinda Bourke", "comment_text": "I didnt take carry on ( from Aus) but we did take small bags to check in ( 50 litre rip curl) and a foldie each.it was easy!"}, {"username": "Melinda Bourke", "comment_text": "Also i fitted heaps in those bags!!"}, {"username": "Cynthia Marie", "comment_text": "Each airline is different. I would refer to your airline website. We travel 4-6 weeks at a time. We each, pack a carry on with one under the seat bag. We find doing laundry once a week is easier than pulling a huge suitcases. Have a great trip!"}]}, {"id": "2199404937125251", "text": "Anyone visited Ravenna?\nWe currently have 3/4 of a day plus our overnight stay booked as a sort of “down day” from all the rest of the trip.\nIt’s all the usual suspects of the general region.\nRome, La Spezia, Cinque Terre, Florence and Venice.\n\nIt looks small, quaint, easily explored and relaxing. The Byzantine mosaics look intriguing and the beach-ish area.\nHowever I’ve not seen it mentioned much at all.\n\nI’m interested to hear if anyone else has visited it and enjoyed it.\n\nThanks!", "link": "facebook.com/groups/1373361046396315/permalink/2199404937125251/", "likes": 8, "comments": [{"username": "Pietro da Rimini", "comment_text": "There are multiple churches with fabulous Byzantine mosaics! Definitely worth a visit."}, {"username": "Gina Rovello Keenan", "comment_text": "We spent a day there while staying in Bologna. Its lovely. The mosaic work is beautiful. I recommend it!"}, {"username": "Kathy Damaren Ingram", "comment_text": "We took an antique train there and spend several hours. Definitely worth a visit."}, {"username": "Stefano Follador", "comment_text": "It’s a great choice. A little out of the mega tourism circuit, but still know all over the world. Totally deserved a visit especially if you are into Roman history.\n\nAbout food, don’t forget to try the piadina. It’s a must do."}, {"username": "Kathy Kibbe", "comment_text": "The mosaics are gorgeous!!! Get tickets early - small walkable area but mosaics are in several sites. Dante’s tomb is there as well…"}, {"username": "Louise Caffrey", "comment_text": "We stayed in lido de Pomposa last year and had a fantastic family holiday. Must see: Comacchio, san marino and bologna, ferrari museum in modena!"}, {"username": "Silvia Urbinelli", "comment_text": "Ravenna is a pearl! Go! Don't miss San Vitale!"}, {"username": "Bronwyn O", "comment_text": "One of my favorite places in the world."}, {"username": "Miyuki Kanno Paul", "comment_text": "Loaded with UNESCO sites within walking distance, Ravenna is a very walkable gem. Make sure that you get reservations for Mausoleo di Galla Placidia because only certain number of very small group can enter there for exact 5 minutes. Walk to the official ticket office in town and buy a combo tix regardless of visiting all sites on the ticket. This is the only way to enter the famous Mausoleo. Weekend can be very difficult, so reserve early! If you have a car, you can drive to Rimini and Republic of San Marino in one day"}, {"username": "Bonny S Boggs", "comment_text": "Have wanted to go for awhile while in Venice thanks for info"}, {"username": "Clare Davison", "comment_text": "Flat comfy shoes...so much beauty to see!"}, {"username": "Khushi Khanna", "comment_text": "Loved the mosaics. Recommend a conducted tour . Then you can go back to enjoy them at leisure."}, {"username": "Ingrid Zancoli", "comment_text": "Italy Is full of hidden treasures, I just wonder why most people visit always the same 3 or 4 places..."}, {"username": "Barbara Bastianini", "comment_text": "Ravenna is a nice city. But it is a city so I myself wouldn’t call it quaint. Parts of it can be bustling. It wasn’t a “down day” for us, it was a destination. We wanted to see the incredible mosaics and we spent a few days enjoying ourselves as we\ndid.\n\nSo I think it’s an excellent stop. And the fact that it isn’t mentioned much is all the better. Italy is full of amazing places that are too often overlooked because 90 percent of tourists flock to the same 10 percent of places. Branching out from the “usual suspects” is a great thing to do. You can often explore without being elbow to elbow with thousands of other people as you discover some wonderful places overlooked in the age of mass tourism.\n\nWishing you a fun time in Ravenna."}, {"username": "Virginia Whitelaw", "comment_text": "It is very small & manageable in a day! I loved the mosaics - they are breathtakingly beautiful!"}, {"username": "Susan Morlan", "comment_text": "Loved it! The mosaics are truly amazing. Visited as a side trip between Venice and Florence in 2018 (?). My travel buddy wanted to go, I knew nothing about Ravenna. Those mosaics have “stayed with me” ."}, {"username": "Dawn Hofmeister", "comment_text": "Ravenna is amazing! We took a tour with Tours by Locals and we did a tour that took us to see 3 sites for mosaics and were told all about them. Then we went to a master mosaic artist and we made our own mosaics. It was super fun! Kids had a great time.\n\nBologna was great! We spent 10 nights there and we had a blast eating our way around the town. We also did a private gelato making class and it was so much fun. Now, we are gelato snobs and cannot eat just any gelato. 😆"}, {"username": "Paola Pulga", "comment_text": "Ravenna is wonderful. Crazy mods, wonderful Basilica of San Vitale. It eats very well"}, {"username": "LouAnn Walker Berry", "comment_text": "Loved Ravenna! The mosaic tiles tour is great! Really amazing!"}, {"username": "LouAnn Walker Berry", "comment_text": "Go to @Ristorante Ai 45 Ravenna and get the Tiramisu! SO good!\nAlso Ristorante Ai Battibecchi was excellent!"}, {"username": "Sylvie Hogg Murphy", "comment_text": "LOVE Ravenna! Mosaics & piadine ftw! Go to Ca’ de Vèn, which is like if there was a wine tavern at Hogwarts."}, {"username": "Lisa Scott", "comment_text": "Love it"}, {"username": "Tess Wethey", "comment_text": "Definitely worth a visit…in addition to the extraordinary mosaics, you can visit the tomb of Dante. Near the tomb, a magnificent cloister where we happened upon an outdoor recital. Gorgeous. Easily walkable distances, and although we weren’t in Ravenna to shop or dine, we would have been spoiled for choice. So yes, great choice!"}, {"username": "Silvia Aha", "comment_text": "The basilica of San Vitale is a favourite of mine"}, {"username": "Benedetta Vanni", "comment_text": "Please please please get off the beaten path. You will not regret it! Just because a town or a province is not talked about on the social media, it doesn't mean it's not worth visiting. So, yes, go to Ravenna! And go to Parma, Pisa, Treviso, Trieste, Lago (Lake) Trasimeno, Viterbo and surrounding areas."}, {"username": "Kim Newton", "comment_text": "We stayed one day in Ravenna in June prior to cruising. It has a lovely, small historic centre, the mosaics are gorgeous and well worth a visit. 24 hours was probably enough though. We spent two days at the beach after the cruise, the beach is fantastic but a word of warning, take insect repellent, we were eaten alive by mosquitoes. We stayed at a very nice hotel in Punta Marina, Terme Beach resort."}, {"username": "Ana Ka", "comment_text": "Omg Loved Ravenna!!!! If you go make sure to see the marvelous churches with Byzantine mosaics!!!"}, {"username": "Rosemary Cataldi", "comment_text": "Ravenna is amazing! A little more bohemian vibe but lots to see! The mosaics, Dante’s tomb, the Basilica of San Vitale, the Mercato are all wonderful! Less tourists as well! Great food and friendly people. I highly recommend it!"}, {"username": "Liz Cooper", "comment_text": "The mosaics will amaze you!"}, {"username": "Yelena Shteynvil", "comment_text": "The Byzantine mosaics of Ravenna are breathtaking! We did a day tour from Bologna, booked a tour of 3 UNESCO sites through Getyourguide site. Glad we did it. We really enjoyed the tour. The Ravenna itself is a very pretty walkable city.\nWe had a very lovely day there, lots of cute stores and restaurants."}, {"username": "Jessica Palladino", "comment_text": "My cousin has a beach bar there. It’s lovely!"}, {"username": "Huong Worley", "comment_text": "We spent the day there on the way to Bologna and it was lovely. Basilica of San Vitale is a must. If you visit during high season, I recommend purchase ticket in advance to avoid waiting in line in the heat."}, {"username": "Jaime Cleek", "comment_text": "It looks amazing"}, {"username": "Alice Francesca", "comment_text": "Ravenna is beautiful, but overlooked like so many other beautiful places in Italy.If it s your first time in Italy it's obvious you want to see the usual Rome/Florence/\nVenice...but there are HUNDREDS of enchanting towns/ lakes/\nmountains/\nbeaches in Italy!\nWe Italians spend most of our week end discovering new places! Try Umbria (Assisi, Orvieto, Spoleto, Spello) or Sardinia with its turquoise Caribbean like beaches, or Lake Garda or Lake Maggiore and their islands full of gardens! What about Piedmont and the hilly Langhe Region, secondo to beauty just of Tuscany? And my hometown, Turin, 2000 years old, first capital of Italy: majestic, elegant, royal palaces, excellent cuisine!"}]}, {"id": "2199405800458498", "text": "Hello, I looked at-TrenItalia site to book tickets for a Sunday in September from Rome to Venice. It takes me to the next date. They can’t all be sold out and I also checked another Sunday in August just to be sure. Does the Trenitalia high speed train not run on Sundays?\nItalo site has the tickets available for a Sunday. It seems to have trainsआणखी of 4 hr. Duration as well. Does it matter which train I take? Is premium class on Italo comfortable?\nRail.ninja seems to be easier to navigate. And it lists the Italo trains.\nI have read some posts in this group about trains but still unable to decide where to buy. Thank you for the advice.", "link": "facebook.com/groups/1373361046396315/permalink/2199405800458498/", "likes": 2, "comments": [{"username": "Victoria Laverty", "comment_text": "Italio great"}, {"username": "Giada Todaro", "comment_text": "Italo is cheaper than Trenitalia and has the same, if not better standards. Both are high speed trains. Premium Class is confortable and there are served some snacks. I usually buy economy (confortable aswell) and upgrade it to premium when Italo makes some special offer (no big difference between economy and premium). Italian here ✌️"}, {"username": "Billie Begley", "comment_text": "We have always used ItaliaRail to book."}, {"username": "Michele Levesque Semosky", "comment_text": "I like Omio to compare different modes of transportation and EASY to use!"}, {"username": "Miyuki Kanno Paul", "comment_text": "Adjust the date/time. It will show.\nConsider purchasing higher level of service you can afford since you will be stuck on a train with strangers for 4 hours."}, {"username": "Joy Buenaflor", "comment_text": "It could be from the time zone you’re booking from. You’re computer/phone has a date and when it translate to the site it’s whatever the equivalent day/time. This happened to me (California)."}, {"username": "Robyn Lawson", "comment_text": "It does run in Sundays . We just booked Rome to Venice fir September. Hope u manage to get tickets. 😊"}, {"username": "Linda Johnson", "comment_text": "I find trainline.com easy to use"}, {"username": "Silvia Urbinelli", "comment_text": "Buy Italo. I even prefer it compared to Frecciarossa."}, {"username": "Lauren Slann", "comment_text": "I had the same issue yesterday. Just sent the time to way before you actually want it. For example, to see the 8am trains I set it to close to 1 am and then it pulled my results"}]}, {"id": "2199407873791624", "text": "Which lake Como or Garda??", "link": "facebook.com/groups/1373361046396315/permalink/2199407873791624/", "likes": 29, "comments": [{"username": "Paula Barnett", "comment_text": "Went to Como in June . Breathtakingly beautiful and not at all full of tourist at that time .."}, {"username": "Nancy L. Banks", "comment_text": "I did both."}, {"username": "Peter Weishar", "comment_text": "Como"}, {"username": "Lena Albinsson", "comment_text": "Garda😍"}, {"username": "Tracey Sumner Rothamel", "comment_text": "Como"}, {"username": "Michele Baron Vold", "comment_text": "Either. Loved Bellagio and small towns around it."}, {"username": "Dave Jackson", "comment_text": "Como 👍👍"}, {"username": "Ross Lampugnani", "comment_text": "Garda"}, {"username": "Kelly Hanberg Rosati", "comment_text": "Robin Seiwerath"}, {"username": "Giani Masucci", "comment_text": "Garde il y a plus de chose a faire"}, {"username": "Andrea Schlosser", "comment_text": "Como ❤️"}, {"username": "Irene Prountzou", "comment_text": "Como by far!"}, {"username": "Sharon DeMarco", "comment_text": "Lake Como is the most beautiful place in the world!"}, {"username": "Ann Matthews", "comment_text": "Como"}, {"username": "Mandy Gee", "comment_text": "Sirmione at Lake Garda ❤"}, {"username": "Sharyn Wright", "comment_text": "Loved lake Como. Stayed in Bellagio known as the jewel of Lake Como"}, {"username": "Ine Snel-Hendriks", "comment_text": "Como!!!😍"}, {"username": "Nausherwan Ahmed", "comment_text": "Lago Maggiore or Lago Orta"}, {"username": "Elizabeth Afeltra", "comment_text": "Garda lake"}, {"username": "Sherrie Jones", "comment_text": "Garda"}, {"username": "Andrew Sella", "comment_text": "Maggoire. 🙂"}, {"username": "Dale Ciaccio", "comment_text": "Como"}, {"username": "Jose Velez", "comment_text": "Garda"}, {"username": "Delfino Lorenzo Jr", "comment_text": "Both"}, {"username": "Celeste Richardson-Foster", "comment_text": "Lake Garda"}, {"username": "Ruth Wieshuber", "comment_text": "Both 😍"}, {"username": "Margaret Franklin", "comment_text": "Maggiore"}, {"username": "Nicola O' Malley", "comment_text": "Garda"}, {"username": "Sharon Reilly", "comment_text": "Garda, all the way for me!"}, {"username": "Naidene Agostini", "comment_text": "F"}, {"username": "Tim Dixon", "comment_text": "Both but Como more."}, {"username": "Geraldine Doran", "comment_text": "Garda beautiful but very touristy."}, {"username": "Howard Abroms", "comment_text": "como"}, {"username": "Kim Willekens", "comment_text": "We did both. But now we always come to Lago Di Bracciano. Not so many tourists. And less chance for bad weather like the last days at the other lakes..."}, {"username": "Annette Blanchard", "comment_text": "Love Malcesine and Arco on Lake Garda. Absolutely stunning area and if you enjoy walking or chairlifts up mountains you can get up Monte Baldo directly from Malcesine"}, {"username": "Colleen Dawson", "comment_text": "Lake Garda."}, {"username": "Claudia Marcon", "comment_text": "lake Garda hands down"}, {"username": "Mihai Valentin", "comment_text": "Dejan Karola"}, {"username": "Carla Trampe", "comment_text": "Lake Como!"}, {"username": "Jocelyn F. Hild", "comment_text": "Both"}, {"username": "Kie Francis", "comment_text": "Garda"}, {"username": "Marion Patricia Needham", "comment_text": "No doubt Garda every time fabulous"}, {"username": "Kathy Schieber", "comment_text": "Which ever one is closest to George Clooney?"}, {"username": "Marija Miletić Fludernik", "comment_text": "Both❤️"}, {"username": "Brooke Barron", "comment_text": "Garda!!!!"}, {"username": "Andreea Margineanu", "comment_text": "Both!!❤️🫶"}, {"username": "Sally Hakim Boice", "comment_text": "Garda!"}, {"username": "Ina Smit", "comment_text": "Both are beautiful. ⚘️"}, {"username": "Neya Kapitanidi", "comment_text": "I like Garda more"}, {"username": "熊馬克", "comment_text": "Garda, and ... Lugano lake is also very nice"}, {"username": "Maria Straface Campbell", "comment_text": "Garda!"}, {"username": "Nina Hod", "comment_text": "Both!"}, {"username": "Margaret Cachia", "comment_text": "Both"}, {"username": "Natalja Petrasun", "comment_text": "Lake Como❤️"}, {"username": "Dessi Reljan", "comment_text": "Lago Maggiore! The best one!"}, {"username": "Ieva Petrauskaitė", "comment_text": "Lake Garda as it has less tourists and feels more relaxed than Lake Como."}, {"username": "Antonio Aloè", "comment_text": "Lago di Garda all the life"}, {"username": "Michelle Leonard Kelly", "comment_text": "Garda 100%"}, {"username": "Claire Tarry Rahme", "comment_text": "Tayla Tanna"}, {"username": "Justyna Włodarczyk", "comment_text": "Garda"}, {"username": "Kevin Nicosia", "comment_text": "Lake Garda with a base at Lazise for travelling around"}, {"username": "Christine Karaki", "comment_text": "We’re going to Lake Garda, Limone Sul Garda specifically. I chose Garda because it’s on the way down from the Dolomites as we head to Tuscany. 🙂 Como is pretty far out and closer to Milan."}, {"username": "Jill Tingley", "comment_text": "Como"}, {"username": "Anna Fancellu", "comment_text": "Following"}, {"username": "Jolie Carbone", "comment_text": "Como"}, {"username": "Josien Damoiseaux-Strijkers", "comment_text": "Garda lake😍🥰"}, {"username": "Christine Bernath Patti", "comment_text": "Garda. Just came back. Not packed with tourists, accessible to so many town by ferry."}, {"username": "Emilio Zamora", "comment_text": "Como"}, {"username": "Nancy Lewis", "comment_text": "Como"}, {"username": "Colleen Carollo Oxsalida", "comment_text": "Visited all three lakes (Garda, Maggiore, and Como) in June and my favorite was Maggiore, followed by Garda. Both were as lovely as Como, but way WAY less crowded."}, {"username": "Katie Centrella Jenio", "comment_text": "Lake Garda. Stay in Malcesine. And take ferry across to Limone and Riva del Garda…"}, {"username": "Tony Foti", "comment_text": "Como"}, {"username": "Lesley Richardson", "comment_text": "Both 🇮🇹"}, {"username": "Mieke Demoen", "comment_text": "Garda: you can hire a boat !"}, {"username": "Billy Nash", "comment_text": "Riva"}, {"username": "Arne Støen", "comment_text": "Garda, Gardone Riviera :)"}, {"username": "Kelly Havlin", "comment_text": "Lake Como! Stay in Varenna."}, {"username": "Satu Vikman", "comment_text": "If you have kids, Garda has more activities for them."}, {"username": "Agneta Danielsson", "comment_text": "Garda 💖"}, {"username": "Risa Mwangi", "comment_text": "Wish one day I will visit the places eg Lake Garda,Maggiore n Como🙏🙏"}, {"username": "Pui Quing", "comment_text": "i went both."}, {"username": "Carmen Buhagiar", "comment_text": "Both are nice 👌"}, {"username": "Äli Ditmann", "comment_text": "Lago Iseo 🇮🇹☺️"}, {"username": "Alice Francesca", "comment_text": "I am Italian and I much prefer Lake Garda.don't drive around, just chiuse a hotel in Desenzano or Sirmione and travel North to South: Riva del Garda, Malcesine and mount Baldo, Salo'( take ferry to Isola del Garda).\nhttps://\nwww.isoladelgard\na.com/en"}, {"username": "Asia Cartlidge", "comment_text": "Garda"}, {"username": "Luca Lookone Ferrentino", "comment_text": "Iseo"}, {"username": "Connie Florio", "comment_text": "Both are beautiful!! Too hard to choose"}, {"username": "Chantal Séguin", "comment_text": "Garda!! Hô yes, Malcesine..."}, {"username": "Jenny Larsen", "comment_text": "We stayed at lake garda at a monastery"}, {"username": "Dan Wentarmini", "comment_text": "Melissa Wentarmini, Karen Hackstock, Erick Hackstock"}, {"username": "Amanda Scarsbrook", "comment_text": "Lake Garda is so much more accessible. Both beautiful but Garda allows you to see far more places if you only have a short time there."}, {"username": "Gemma DeVoldre", "comment_text": "Como"}, {"username": "Ville Lignell", "comment_text": "Garda, it embraces three regions. A lot of nice places to see."}, {"username": "Pascale Paanakker", "comment_text": "Iseo !!"}, {"username": "Tamriko Chanishvili", "comment_text": "Lake Como. Bellagio"}, {"username": "Camilleri Twizi", "comment_text": "Garda"}, {"username": "Jessica Asquith Hemphill", "comment_text": "Just did lago Maggiore and it was beautiful and great food and shopping area"}, {"username": "Yiannos Zornis", "comment_text": "Lake Garda by far."}, {"username": "Helen Davies", "comment_text": "Lake Garda by far"}, {"username": "Stefano Bressanelli", "comment_text": "Why not discover the gorgeous lake Iseo and its Montisola? We have a lot of northern super lakes!"}, {"username": "Sonja Stöckli", "comment_text": "lago di como🥰"}, {"username": "Kim Angel", "comment_text": "Garda"}, {"username": "Shane Macdonald", "comment_text": "Como is beautiful wherever you are. U always have a beautiful backdrop as the banks of the lake are usually near. Lake Garda is not as beautiful but the towns are bigger and much nicer with many interesting things to see"}, {"username": "Rita Markou", "comment_text": "I have been to both, very different places, hard to compare enjoyed my time at both and would return again"}, {"username": "Peter Goraczko", "comment_text": "Yes!"}, {"username": "Virgz Van Møøre", "comment_text": "Como"}, {"username": "Daniela Ricketts", "comment_text": "Garda"}, {"username": "Verena Lala", "comment_text": "Garda or Lago maggiore 😍"}, {"username": "Leanne Rynne", "comment_text": "Como is absolutely breathtaking but Garda while not as pretty has more going on ."}, {"username": "April Berube", "comment_text": "Mark Berube"}, {"username": "Gail Naylor Bottone", "comment_text": "Lago Maggiore, beautiful"}, {"username": "Sanne Juventina", "comment_text": "Garda 100% 😊"}, {"username": "Diana Brown", "comment_text": "Como"}, {"username": "Dade Lgg", "comment_text": "Como definitely better but they are both amazing it depends what you are looking for"}, {"username": "Miranda de Crom", "comment_text": "Como!!!!!!"}, {"username": "Eija von Schoultz", "comment_text": "Como assolutamente"}, {"username": "Kimberly Bos", "comment_text": "Lake Iseo!"}, {"username": "Alicia Boldreghini George", "comment_text": "Garda!"}, {"username": "Morgan Bradley", "comment_text": "Go to Malcesine on lake Garda my wife and I eloped at the castle there"}, {"username": "Sydney Chakalos", "comment_text": "Garda! We were just there and loved it!!"}]}, {"id": "2199412133791198", "text": "I’m trying to rent a care in Sienna for 5 days. Is 755$ CAD reasonable to you ?", "link": "facebook.com/groups/1373361046396315/permalink/2199412133791198/", "likes": 5, "comments": [{"username": "Anthony De", "comment_text": "Seems expensive, we're going to Croatia on the 17th of August, we paid $785 for 16 days..."}, {"username": "Leopoldo Conti", "comment_text": "If drop off point is Siena I recommend Auto Motocicli Perozzi, 70€/day maximum"}, {"username": "Ingrid Davis", "comment_text": "I rented a car for 8 days and it was $500 at Europcar."}, {"username": "Diane Langlois", "comment_text": "Thanks everyone for your input"}, {"username": "Diana Boucher", "comment_text": "I usually rent a car from the us companies if you're from the us"}, {"username": "David Riegel", "comment_text": "it up to you to decide what you think is reasonable to spend your $ on while on Vacation."}, {"username": "Donna Gilardone Szwabowski", "comment_text": "Yes"}, {"username": "Kateryna Fedyushkina", "comment_text": "Not more than 80€ a day,remember 😊"}, {"username": "Jolene Morrow", "comment_text": "$2100 for 18 days-we always buy the extra insurance bc in Italy you almost have to, lol."}, {"username": "Lora Ruscitti Covington", "comment_text": "We rented a car with Avis in Tuscany for about $300 for 5 days. I thought that was reasonable."}, {"username": "Shannon Confortin", "comment_text": "Our one day car rental in Florence was 1/2 that in CDN so I would be happy with that for 5 days"}, {"username": "Joo Kheng", "comment_text": "i am trying to rent from Rome and drop off in Pisa.. but I found it quite expensive about euro 120 per day"}, {"username": "Alice Francesca", "comment_text": "It depends on the car.A Fiat 500 is around 70 Euros per day."}, {"username": "Martin Marinov", "comment_text": "I always go with Avis but also depends if you get the full coverage or not."}, {"username": "Imer Dervishi", "comment_text": "Use QeeQ app, or qeeq . Com to find cars."}]}]