[{"id": "2198315680567510", "text": "First time poster 🖐 Hello🤩\nI have a question: my husband and I are thinking of buying an interrail ticket to travel Germany, France and Italy for 4 weeks in September and October.\nHappy for any hints and ideas please 🙏 The Europe ticket costs € 700 per person.\nWe live in Australia and I am German and are super excited about our upcoming holiday. Thank you in advance 💕", "link": "facebook.com/groups/1373361046396315/permalink/2198315680567510/", "likes": 4, "comments": [{"username": "Rhona OConnor", "comment_text": "Look at the cost of individual journeys v the interrail ticket. I decided to buy separate tickets as it was easier and more flexible. Worked out fine."}, {"username": "Denise Keegan", "comment_text": "Do your research on the cost of each (major) train trip you'll want to do. We're heading over for 6 weeks next March (from Aus also), and it will be a lot cheaper for us pay for separate tickets."}, {"username": "Leila Myftija", "comment_text": "I'll ask my daughter if you'd like.\nShe organized a +30 day Interrail trip through 7 countries for herself and 6 friends."}, {"username": "Kimberley Jade", "comment_text": "Can I ask who you are flying with? I’m trying to arrange a trip also."}, {"username": "Kim Smith", "comment_text": "Has anyone done a train trip.. day trip from Rome to Venice? Thinking we can do it but unsure .. return trip would be very late afternoon so do trains run later ? And is it good scenery on trip"}, {"username": "Penny Williams", "comment_text": "We recently did a month long trip catching trains through France, Switzerland, Italy, Germany and Austria. It was a lot cheaper to buy tickets seperately for each journey as long as your itinerary is set and you buy in advance"}, {"username": "Virgz Van Møøre", "comment_text": "Sounds expensive, depending on how many stops you want to make. Compare the prices, not sure if individual tickets would not be cheaper."}, {"username": "Sam Mah", "comment_text": "Do go on the Interrail/\nEurail FB page to ask questions. Definitely worth it if you want flexibility. We have done 1 month UK, 2 months Europe and we found if we had purchased rail tickets without the pass, the 1 month in UK would have covered the full cost of our 3 month Global pass, which means we were virtually travelling for free for the 2 months in Europe. 🙂"}, {"username": "Bea Kuckens", "comment_text": "On two separate trips of multiple countries in Europe, we found it more cost-effective to book individual trains for each leg of the trip than to get a pass."}]}, {"id": "2198321787233566", "text": "Travelling very soon for the first time. Staying in Campania, what is the easiest way to get around to visit other places?", "link": "facebook.com/groups/1373361046396315/permalink/2198321787233566/", "likes": 0, "comments": [{"username": "Mariya Terzieva", "comment_text": "Forget about the car. Driving around Campania in high season is like hell. Use public transport - SitaBus is a great way. They travel all around Campania, you buy 24-hours ticket for 10 euros and you hop on and off everywhere you like.n"}, {"username": "Ville Lignell", "comment_text": "The region is very well covered by the rail network which covers many spots untouched by mass tourism."}, {"username": "Angela Gilmore", "comment_text": "Do you mean places in Campania (Naples, Pompei, Sorrento, Amalfi...) or do you mean other cities in Italy (Rome, Florence, Venice...)?"}, {"username": "Alex Dodge", "comment_text": "Capri, Naples. Amalfi are all easy to reach. I live in the region so I’d suggest the islands of ischia or Procida over Capri. Ercolano over Pompeii the Reggia di Castera palace is beautiful and Star Wars was filmed there. The villages of Benevento and Castera Vecchia are nice but definitely need a car. Driving here seems high stress and I don’t recommend it DT for timid drivers. Also the pest pizza in Italy is in the mountains near Naples. A noce drive and worth the trip. Pepe in Granì reservations are a must."}, {"username": "Miyuki Kanno Paul", "comment_text": "What city/town Campania are you staying?"}, {"username": "Roland Trego", "comment_text": "Campania is a very large region. Can you be more specific as to where you are staying?"}]}, {"id": "2198321813900230", "text": "We are staying in Sorrento towards the end of September. We have a day arranged for a private driver to take us to Positano and we were going to work our way down the steps and take a ferry to Amalfi. Would we have time to include Ravello as many people have posted that it is gorgeous. What would be the quickest way to get there from Amalfi -आणखी taxi? (we are a family of 4). How long do most people spend in each town? Also what's the best way to get back to Sorrento from Amalfi? We don't particularly want to hire a driver for the whole day and prefer to move about in our own time. Appreciate your suggestions. Many thanks", "link": "facebook.com/groups/1373361046396315/permalink/2198321813900230/", "likes": 0, "comments": [{"username": "Jenny Payne", "comment_text": "Bus, but check and see what time the last bus leave’s Amalfi 🌻"}, {"username": "Pam Hughes", "comment_text": "Leave early. Take the bus to Ravello and back then bus back from Amalfi. Pretty easy to wander around the main area of Ravello...have lunch up there then bus back and spend rest of time available wandering around Amalfi."}, {"username": "Frances Scannapieco", "comment_text": "I have been several times. To truly enjoy each city I would only do two in a day. Remember the travel time between each city takes away your visiting time.\nI personally love Ravello but three cities in one day is too much in my opinion"}, {"username": "Billie Begley", "comment_text": "We did all three with our private driver. It was great. We did not find it too much and we were a group of seniors."}]}, {"id": "2198333520565726", "text": "Salve! Your posts have been extremely helpful to us this past year in planning our 2-week trip, so i wanted to return the favor. These were our experiences, which I hope you find helpful. It’s really long and detailed, so please excuse the length.\nMy wife teaches, so we can only go away in July. Because we knew it would be hot, we purposely looked for hotels with A/C and private bathrooms in each room. That was non-negotiable.\nIn Rome we stayed at the Napoleon. It was a very nice and reasonable place, with great staff and a decent breakfast. None of the major attractions are nearby, but there’s a Metro stop right outside the door. We didn’t use it—we only traveled by taxi that we called for on the FreeNow app (which was terrific, until it wasn’t—sometimes they can’t find an available car.) When that happened, we switched to Uber (working with ItTaxi) or walked a bit to a different location and tried again.\nBe ready to use more euros than you think, mostly for tips, water and snacks. We brought $300 in Euros. We barely made it out even.\nThe first night we ate at Felice a Testacccio, because of recommendations we found in this group. It was super. The cacio e pepe and ravioli were extremely fresh and tasty. We made reservations, but they weren’t necessary at 7:00pm when the restaurant opened.\nWe then took a Rome by Night tour, which was a fun way to start the trip. We had a great guide, and learned a lot of interesting stories we wouldn’t have heard on any other tour about the “dark side” of Rome. It was their version of a “ghosts and mystery” tour.\nThe next morning we did the Rome in a Day tour, a 7-hour tour in 98 degree heat. Several people left the group during the tour because of the heat, although our outstanding tour guide, Karolina, did her best to always find us shady spots to stop. We started at the Vatican and saw all the major attractions, with “skip the line” tickets—a must-have, especially in this heat. Karolina couldn’t have been any better, and it was well-worth the 5.5 total miles walked in this heat. Although some really struggled with the heat, I’m 63 with a heart condition and I did just fine. Hat, plenty of water (or Gatorade/electrolytes) and a bandana to wipe my face and neck were key. The one thing I really wish I brought with me were Crystal Light packets. The only cold drink you’ll find in Italy with no sugar (other than water) is Coke Zero. I don’t drink Gatorade either, but I wish I had some powdered mix for my water bottles. We did buy collapsible water bottles through Amazon. They worked fine. Public water is plentiful in Rome—much less so elsewhere—but keep in mind that once it goes into a non-insulated bottle in 98 degree temps, it gets warm quickly (it’s not all that cold to begin with). So I think a small Hydroflask or insulated bottle is best. And when buying drinks in cafés and restaurants, remember to ask for a glass with ice. Otherwise you may not get one.\nTo set the record straight, I’d say at least 30% of the visitors in the Sistine Chapel were in shorts or dresses that didn’t cover their knees. We saw no one turned away. So yes, covering knees and shoulders is a sign of respect and is demanded on signage inside the Vatican, but in 98 degree heat no one seemed to worry about it. And yet the next day I stopped into the Basilica di Santa Maria Maggiore, wearing shorts and a t-shirt (same as many of the men). Ten minutes after entering, I witnessed an usher telling two different women wearing shorts that they needed to cover their knees, and he had something they could throw over them. No acknowledgement whatsoever of me or the other men in shorts.\nThe Trevi Fountain was magnificent, but I was surprised at how little open space there was around it. Lots of shops and restaurants within coin-tossing distance. And I saw the little rooftop cafe that one of you posted about, which looks right down to the fountain area. Based on what I’ve read here in the past, I expected 1000 people waiting to toss their coins. There were maybe a couple hundred tops. Easy in and out.\nThe Roman Forum is massive and impressive—my favorite part of the tour. But also the place with the least amount of shade.\nThe Coliseum was fun to see, but by that point we were wiped.\nDinner at Mimi e Coco Trast was very good—not quite as great as Felice. The starters were outstanding, and we shared an entree that was good. They have several different versions of “spritzes”—worth trying. The host convinced us to split a tiramisu, which was okay, and she then brought us two complimentary limoncellos. The limoncello in Italy isn’t as thick and sweet as what we buy in the states.\nAll gelato is good gelato, especially when you’re in Italy. Venchi has the best.\nThe pizza here is also amazing, regardless of the thickness of the crust.\nGo into any and every basilica you pass, regardless of its outward simplicity. You’ll be astounded by the beauty and magnificence when you enter.\nTrain to Florence cancelled thanks to Trenatalia union strike. Spent waaaay too much time in the customer service area trying to determine options before deciding to just rent a car and drive to Florence. Cost an extra $250 including gas and insurance (always buy the insurance driving in Europe!). But we got there. Food and gelato are great everywhere—pizza still outstanding. Hotel Paris is in a terrific location, but that’s the extent of the praise for it.\nHotel Napoleon in Rome was an 8, losing its two points only for location. This hotel in Florence gets a 10 for location and not much for anything else. Small, old rooms, no ironing board or iron for us to use (as if I’m not wrinkled enough), and a spider crawled along the bed while we sat there. There are a bunch of hotels right in Piazza Santa Maria Novella that look much nicer.\nDinner at I’Raddi, based on a friend’s recommendation. $53 for the two of us, which included a bottle of wine. I spend $14 for a glass at our favorite Italian restaurant back home.\nSkip the line tickets for the Uffizi—not sure we needed to spend the extra money because I only saw 20-30 people in line. Lots to see in the Uffizi…we spent about two hours there (so, so hot, even though it’s air conditioned).\nWalked the streets and piazzas. Didn’t go into Il Duomo. Had dinner right next to it at Le Botteghe di Donatello. Good bistecca (if you like eating raw meat), and my wife’s pizza was as good as all the others. Serenaded throughout dinner by a violinist and clarinetist playing in the piazza.\nYou have to get to Venchi for chocolate and/or gelato (we got both and they were super). As we sat outside the store eating, a man turned on his iPhone and speaker and began singing incredible opera music. Amazing.\nOh, and we got scammed out of only $5. A man came up and asked if we were from the states. I tried to ignore him but he engaged my wife. He gave her two little figurines and 3 bracelets for our children. He then handed me two leather belts, which I tried to refuse. He showed us a photo of his (or someone’s!) one year old twins, and asked for money. I handed him $5, and he asked for $10 saying he gave me two leather belts (that were rolled up so I don’t even know if they had holes in them). I said no, and gave him the belts back. So we walked away with two little figurines and 3 bracelets. He walked away with $5. Then I had gelato.\nThe next day, we had skip the line tickets for the Accademia. It was well worth both the time and the extra money. Fascinating exhibit, and Il David is magnificent. We found a café for iced coffee right outside, which made my wife happy. After roaming a bit through the central market area and seeing tent after tent of the same exact things – leather bags, belts, and T-shirts, we had lunch at a cafe in Santa Maria Novella. So many of you have said don’t eat right in the piazzas, but the pizza was good, and we were under a canopy with a cool mist spraying on us. A worthwhile stop. During the height of the afternoon heat—only 93° today so a little cooler than it has been—I used that time to do laundry. A total of 8 euros to wash and dry at a local laundromat. Pretty easy. Having 30 minutes in between each cycle also gave me another opportunity to roam around and explore Firenze.\nDuring those two cycles, the temp rose to 96 again. So hot I actually drank a Powerade, which I never do.\nDinner at La Giostra that night, based solely on Facebook recommendations from these blogs. Thank you for that! Great place, excellent food, slow service. They did add a cover charge of $3pp, which many places have done, but they also put on the bill “Gratuity not Included,” which I thought was strange. I gave them way more than they deserved, but the food was still worth it.\nGelato at Venchi again, because we can. Same opera singer was out crooning, so another great night.\nNever an issue with pickpockets or feeling unsafe—anywhere in Italy. As a matter of fact, I never used my fanny pack. I carried any cash and credit cards in one front pocket of my shorts, and my phone in the other. Never needed my passport or even a copy. Anywhere but when traveling.\nMade it to Venice easily on the train—no problems in either station. It’s nice when there’s no strike! Took a way-too crowded vaporetto to Piazza San Marco, and walked only 400 feet to our hotel, the Campiello (very nice).\nTurned right around and did a glass factory tour and demonstration in Murano—no big deal and their goal is to get you to buy thousands of dollars in glass. We caught the next boat back after the demonstration.\nHad dinner right by the water. For those of you who keep warning others about “tourist trap” restaurants, here’s my take. These places may be $3 more per person for meals, but the food is still better than anything we have in the states, and sitting under a tent in 95 degree weather with a bit of a sea breeze makes it well worth it. For every meal we’ve had on a back street somewhere, we’ve had one under a tent with a beautiful setting. I’ll gladly take them both.\nNext was the Venice in a Day tour. BTW, we used Viator for everything and didn’t have a single issue.\nWe also walked a LOT at night—Venice is alive! No issues, and a lot was open later in the evening (11:00ish—which is late for us!)\nEasy transport to the airport in Venice via Alilaguna. We weren’t flying out, but renting a car to drive to Lucca. That turned into a horror show, because renting through Expedia got us a car through Ecovia. The only problem is you show up at the rental car offices at the airport, and Ecovia doesn’t exist on the signs (they’re at the Autovia booth), so it took me an hour to just find them. I’m amazed at how few people at the airport spoke English and tried to be helpful! Not many!\nBy the time I found them, the agent told me my car rental was cancelled because I showed up more than two hours after my flight landed. That’s because we flew in 9 days ago! Our rental agreement was from July 18-22, but they saw we flew in on the 10th and assumed we didn’t pick it up. Expedia has no phone number, so all you can do is chat with an agent online, which wasn’t all that helpful and took forever. I finally went to the Budget counter and got a car. Lesson to be learned—rent from the companies you know!\nStopped in Verona along the way (my wife teaches a lesson in Romeo & Juliet), and that was very, very nice. Great lunch and a nice walk through the town to Juliet’s house.\nMade it to Lucca in our rental…nice ride through the countryside. Btw, drivers in Italy (not sure if they’re locals or tourists) don’t believe in using turn signals. They drive up right behind you close enough to peek in your back seat, flash their high beams, then zip by you and cut you off. They also like to drive along the center line until they decide which lane they’d ultimately like to be in. So frustrating!\nI love Lucca! The Hotel Ilaria is amazing, and we had a fabulous dinner tonight at Canuleia.\nBtw, I did one full load of laundry after about 5 days (Firenze), then washed other things in sinks as necessary. That lasted me two weeks with a carry on.\nIt seems like everyone in the country smokes cigarettes, even in this heat. It’s particularly bothersome sitting outside to dine, and having someone light up next to you while you’re trying to enjoy your meal.\nWoke up and rode a bike along the outer wall of Lucca—great experience! The hotel offered bikes for free (along with snacks and drinks through the day—love the Hotel Ilaria!)\nBest experience of the trip—a Cesarane cooking class through Viator. It was just my wife, a young woman who came by herself, and me at the home of an incredibly nice local woman. She taught us how to make tagliatelle, gnocchi and tiramisu. All three were fantastic (he says modestly). She also provided a great wine, good stories, and an explanation of how and why we make pasta certain ways. Loved it, and we invited her to visit us on her next trip to Boston.\nThe next day, we had another amazing experience. Drove to San Gimignano and did a winery tour at Fattoria Il Piano. Two and a half hours, between the guided tour and the tasting of FIVE wines, plus some really good food. So worth the 90 minute drive each way.\nWe walked along the wall today—so beautiful and relaxing. Did some shopping (great stuff!), then went to the Puccini concert, which they do nightly in a gorgeous church. Amazing opera singers and pianist! Such a good decision. Finished it off with a very nice meal in the Anfiteatro Romano.\nFinal full day, drove from Lucca to Rome. Checked into an airport hotel, the Riviera. It was awful! It was near the beach—which was in a seedy area. Might explain why the room smelled like dead octopus. A long, dark hair greeted us in the sink. We checked out right away—lost our money because we prepaid—and got a room at the Airport Hilton. We made up for it by going into Trastavere and eating at Felice a Testaccio again—ending our trip the way we began. We then walked 1.5 miles (needed the walk!) to Venchi for one, final, awesome gelato. Venchi has the best in any city you find one!\nOne final thought. As helpful as everyone is in sharing on this site, so much of what I have read is personal opinion or perspective, not necessarily fact. So, if you’re looking for facts, you might want to go directly to the venue/source for an answer.\nGlad to be going home after two weeks, but I’ll miss my ancestors’ homeland. Ciao for now. And Grazie Mille for all your recommendations this year!", "link": "facebook.com/groups/1373361046396315/permalink/2198333520565726/", "likes": 163, "comments": [{"username": "Lisa Jones", "comment_text": "Great account of your travels and some excellent tips and recommendations\n!"}, {"username": "Dave Conroy", "comment_text": "The best advice in this interesting piece: '... so much of what I have read is personal opinion or perspective, not necessarily fact. So, if you’re looking for facts, you might want to go directly to the venue/source for an answer.' This saves potentially a huge amount of stress in the moment."}, {"username": "Angie Morris", "comment_text": "Very helpful. Thanks😊"}, {"username": "Cecilia Christine Costantini", "comment_text": "About the spider, in Italy we say: Ragno porta guadagno (A spider will bring money/\nearnings), so go and buy a lottery ticket!"}, {"username": "Judy Dimino Olsen", "comment_text": "Thanks for taking the time to share! Glad you enjoyed your time there!"}, {"username": "Theresa Jacobellis", "comment_text": "I read every word and felt as if I was right there with you. Love how you pivoted when necessary. Sounds like an amazing trip."}, {"username": "Brenda Harris Dixon", "comment_text": "Lauren Nicole Dixon - lots of good info here"}, {"username": "Mary Hamilton", "comment_text": "Thank you. Was the cooking class in Lucca and wine tour in San Gimignano? Could you send links to book please?"}, {"username": "Margo Burrage", "comment_text": "How was the airport Hilton?"}, {"username": "Ornella Osborne", "comment_text": "Really enjoyed reading your review"}, {"username": "Indrani-Siddhartha Basu", "comment_text": "Excellent"}, {"username": "Glenda De Cooker", "comment_text": "Thanks for this. So helpful as we look at doing a trip next year. 😁"}, {"username": "Jon Stubb", "comment_text": "Wonderful well written post. Thank you for taking the time to share"}, {"username": "Michelle Murphy Margolati", "comment_text": "I am looking for a winery in San Gimignano. We will be there in September. Your trip sounds amazing."}, {"username": "Tricia Brittingham Neff", "comment_text": "We plan on stopping in Verona on our drive from Venice to Lake Como. Did you feel safe leaving your car parked with your luggage in it for your time there?"}, {"username": "Tricia Brittingham Neff", "comment_text": "Also , we booked on the beach in Lido di Ostia on our last night…is that area seedy??"}, {"username": "Cindi McLain Lokey", "comment_text": "Thanks for your take!"}, {"username": "Cynthia Crowe McSwain", "comment_text": "What is Viator? An app?\n\nThanks for your trip account! Very helpful."}, {"username": "Karen O'Neill Brown", "comment_text": "Great post! Thank you for sharing 😊"}, {"username": "Kathy Stephens Rubin", "comment_text": "Do you need to make train reservations between cities in advance? Or once you’re there?"}, {"username": "Susan Newlove", "comment_text": "Enjoyed this full and honest account of your travels ,thankyou"}, {"username": "Catherine Quinn Mergen", "comment_text": "Very nice review if your experiences, thank you!"}, {"username": "Jerry Kiger", "comment_text": "Good info … wondering how do you rent cars inside Italy … possible to do on spot or reserve prior?\nAlso, see you did a lot of attractions … did you get tickets prior or can get most once there? Know depends on time of year, etc? Thank you"}, {"username": "Jean Faulkner Miller", "comment_text": "Sounds like a great trip…thanks for all the helpful tips!"}, {"username": "Paula Brink", "comment_text": "Sounds like a great time!\nJust a note about the iron and ironing board- these are not provided in hotel rooms in Italy generally due to fire safety regulations. You can usually ask to have one sent to the room and they will whisk it away after you use it."}, {"username": "Terry Pisano", "comment_text": "Thanks for the interesting and informative review! Sounds like you had the perfect attitude in some unbearable heat. Also, I fully expect that there will be hiccups in our upcoming fall trip, as you confirmed, but you took them in stride! Nice!"}, {"username": "Carol Breeden DeMarco", "comment_text": "Good report!"}, {"username": "Toni Jewett-Chavez", "comment_text": "I hear alot about spritzes? Is that carbonated water?"}, {"username": "Carolyn Danielson Sanchez", "comment_text": "I just bought my tickets to Accademia on their official site. Are these the skip the line tickets?"}, {"username": "Barb Windoloski", "comment_text": "Personally, I LOVED \"going\" to Italy with you two! Thanks for all the photos"}, {"username": "Catherine White", "comment_text": "Beautifully written, thank you for sharing your experience!"}, {"username": "Jenny RV", "comment_text": "Wonderful account of what sounds like an amazing trip. Some very useful tips there so thank you for sharing."}, {"username": "Gretchen Barretto", "comment_text": "Thanks for sharing ! Joash Isaiah CastilloMel CastilloJoachim Miguel Castillo"}, {"username": "Trace Barron", "comment_text": "Great review.. thanks"}, {"username": "Gwen Cooke", "comment_text": "Sounds wonderful!"}, {"username": "Anita Palmer", "comment_text": "Bravo!!"}]}, {"id": "2198333630565715", "text": "Hi can anyone confirm if Eurail global pass say 15 days in 2 months includes trenatalia trains within Italy- not just international connections into Italy but say Venice to Florence/ rome to Naples etc please. Mixed answers on website", "link": "facebook.com/groups/1373361046396315/permalink/2198333630565715/", "likes": 0, "comments": [{"username": "Sam Mah", "comment_text": "There is an Interrail fb page you can join. Yes it includes most trains in Italy. Also read Man in seat 61 which has some of the best international rail information, including Eurail/ Interrail."}, {"username": "Brenda Keeter", "comment_text": "If you go to Eurail.com, you can see all their routes and rail companies included."}]}, {"id": "2198338283898583", "text": "Buongiorno.\nCan someone recommend a relatively smaal and quaint town in the Dolomities, a hotel, with an outdoor pool, somewhere where we can get to without a car.\nGrazie!!", "link": "facebook.com/groups/1373361046396315/permalink/2198338283898583/", "likes": 1, "comments": [{"username": "Connie Wilson", "comment_text": "Ortisei or Castelrotto, both reached by train and bus. Look for hotels in these villages that fit your need."}]}, {"id": "2198320460567032", "text": "Discover the everlasting beauty of Pisa and its iconic monuments and Let yourself be captivated by the architectural jewels of Pisa!\nJoin us: https://nextstop-italy.com/virtual-tours/pisa-pearl-of-tuscany/\n\n#आणखीitalygram #vacationmood #renaissanceart #italytravel #virtualworld #italyiloveyou #virtualtour #tuscany #tuscanytour #tuscanyitaly #tuscanyexperience #pisa #pisatower #leaningtowerofpisa #leaningtower", "link": "facebook.com/groups/1373361046396315/permalink/2198320460567032/", "likes": 29, "comments": []}, {"id": "2198315643900847", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2198315643900847/", "likes": 11, "comments": []}, {"id": "2198315277234217", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2198315277234217/", "likes": 1, "comments": []}, {"id": "2198280423904369", "text": "Hi, we're off to Siena for a long weekend, any tips and thing not to miss. X", "link": "facebook.com/groups/1373361046396315/permalink/2198280423904369/", "likes": 5, "comments": [{"username": "Kristian Strebør", "comment_text": "We’re going at Easter so following!"}, {"username": "Bill Ulrich", "comment_text": "Porta del Cielo tour at Siena Duomo"}, {"username": "Heather Sechrist", "comment_text": "They had a summer music series last night. It was beautiful!"}, {"username": "Alice Francesca", "comment_text": "Rent a car and drive one hour south to the Val d'Orcia region.discover\nthe real Tuscan landscape and quaint villlages\nhttps://\nwww.italia.it/\nen/tuscany/\nthings-to-do/\npienza-the-ideal\n-city\n\nAlso Bagno Vignoni, San Quirico d'Orcia and Monticchiello"}, {"username": "Dr-Jon Warnecke", "comment_text": "Visit San Gimignano, Val d'Orcia, Orvieto, Montepulciano. If time allows, Umbria is Italy's \"Green Heart\""}, {"username": "Steve Watkins", "comment_text": "The cathedral"}]}, {"id": "2198287823903629", "text": "Hi fellow travellers!! I'm going to visit the Amalfi coast very soon (but staying in Sorrento) and I am still wondering if it's best to do it by boat or by car. All advices are welcome. Thank you 😁", "link": "facebook.com/groups/1373361046396315/permalink/2198287823903629/", "likes": 13, "comments": [{"username": "Skye Birch", "comment_text": "I did boat.. and by local bust that you can get outside the train station (sit on the right hand side) cost €2"}, {"username": "Wahab Sidharta", "comment_text": "Take Ferry from Marina Piccolo, Sorrento to get around Amalfi Coast"}, {"username": "Tula Smallman", "comment_text": "Ferry is really easy. Driving looks horrific 🙈"}, {"username": "Renae Larcus", "comment_text": "Can also take the SITA bus from Sorrento to other AC towns."}, {"username": "Grace Monaghan", "comment_text": "Do not drive"}, {"username": "Phyllis Snyder", "comment_text": "I’m going next fall- plan on ferry."}, {"username": "Allison Campbell", "comment_text": "We hired a car but wouldn’t bother as traffic terrible, streets so narrow . Heaps of buses and ferry’s . We were going to take the car back early ."}, {"username": "Tara McCloud Odebrecht", "comment_text": "Ferry. Do not recommend the bus - all of our kids weee sick and there was someone vomiting in her purse. Ferry was perfect."}, {"username": "Carolyn Hassarati", "comment_text": "Did both , private boat was amazing"}, {"username": "Katherine Azcue", "comment_text": "Go by boat and return by car!"}, {"username": "Roland Trego", "comment_text": "Definitely not by car."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Ferry or car service."}, {"username": "Jerry Kiger", "comment_text": "Following … what is the distance or how long would take Sorrento to Amalfi? Say ferry 30 min, 1-2 hours? Thx"}, {"username": "Yvette Pavone", "comment_text": "We need more info! Are you arriving by train or plane and what time do you arrive"}, {"username": "Shana Lippé", "comment_text": "Thank you everyone!! Boat it will be 😊"}, {"username": "Cindy Giampietro", "comment_text": "Not travel related, but if you are going to positano and want to get in the ocean, I would recommend water shoes. The rocks are painful and make it hard to navigate your way into the water"}, {"username": "Darryl Vanstone", "comment_text": "Private boat from sorrento is the way to go in my opinion"}]}, {"id": "2198308380568240", "text": "Hi all, so we arrive in Naples for 4 days on Tuesday. So far we plan to explore Naples on the first day, booked to go to Pompeii Wed, Rome Thu and Capri Fri. I am looking for suggestions where to go Wed afternoon after a morning at Pompeii if anyone could help please? 😊", "link": "facebook.com/groups/1373361046396315/permalink/2198308380568240/", "likes": 1, "comments": [{"username": "Laura Walker", "comment_text": "Not fancying a hike up Vesuvius in the heat either"}, {"username": "Mary Anne", "comment_text": "The Archeological museum is a great place to go after Pompeii. They have a terrific Pompeii exhibition."}, {"username": "Genevieve Bastien", "comment_text": "You could try the vineyard Cantina Del Vesuvio. Cooking class or visit the vineyard part. Beautiful grounds."}, {"username": "Ville Lignell", "comment_text": "If you're not afraid of the heat you could visit Paestum. You can easily get there by train."}, {"username": "Bambi Harris", "comment_text": "Herculaneum :-)"}]}, {"id": "2198309417234803", "text": "We will be doing a number of long distance trains in Italy Aug/Seot. Are masks still a requirement on trains?\nTIA", "link": "facebook.com/groups/1373361046396315/permalink/2198309417234803/", "likes": 2, "comments": [{"username": "Cecilia Christine Costantini", "comment_text": "No, not anymore"}, {"username": "Kristina Ruk", "comment_text": "Nope"}, {"username": "Oldriska Balouskova", "comment_text": "Absolutely not"}]}, {"id": "2190794237986321", "text": "#Pisa #tuscany\nHi everyone, since many of you are bummed about Pisa because they end up in tours that only show the Tower and leave you in the most horrible part of the town I thought of writing some indications to let you enjoy the visit on your own and don't feel like you wasted your day just to see a leaning tower.\nPisa is very easy to visit on your own. If you drive there, consider parking far from the tower, as near it there are two parking very expensive and usually crowded and you’ll easily get a fine ending in forbidden roads. Lungarno Buozzi is good road to park or in parcheggio Paparelli (not on wednesday or saturday, the parking becomes a market).\nWhen you arrive in Pisa train station consider 20 minutes walk to the tower BUT when setting google maps put two middle stops or you will find yourself walking the shortest road (by 3 minutes) but miss all the good spots.\nSo at first walk towards the Keith Haring mural (the largest in the world), then to Borgo Stretto (a porched road with some nice shops, easier with the sun), then to Piazza dei Cavalieri (where a beautiful Vasari palace is, now a University, and a Church that, when it is open, has original flags from the Crusades ) and at that point go to the Tower. It will be a much more pleasant walk.\nWhen visiting the Tower visit also the Cathedral, the Baptistry and the Cemetery, they are stunning and worth a visit (there is also a great museum, Museo dell'opera del Duomo, maybe you don't want to overdo, but you can go there to grab a coffee in its bar which has a stunning view on the tower).\nNear the tower Grand Hotel Duomo has a great terrace on the roof where you can have a drink or dinner at sunset with a beautiful view.\nClearly there are other really good things to see: near the tower there is the first university botanical garden in the world, not far a stunning little medieval museum called Museo di San Matteo, the Museo delle navi Antiche, the only museum in the world with original roman vessels in display… it all depends on how much time you have!\nTo eat: you must run away from everything near the tower, you can go to Osteria dei Cavalieri for really good traditional tuscan, Pomodoro e Mozzarella for a really good pizza, Osteria di piazza for simple traditional tuscan in a nice little square with only a few dishes every day. If your don't want to sit but just grab something on the go look for Pizzeria Montino and taste a chickpeas sort of flat bread called cecina and a pizza quarter. Around thees places there are many little restaurants where almost only Italians go.\nIce-cream, one of the best rated in Italy: De Coltelli!\nIf, by chance, your are there for the evening go long the river, it's an University town, so lots of bars and students having fun!\nPhotos of my friend Carlo Cafferini, a stunning photographer, of the San Rossore Park, just outside Pisa, and of some buildings!", "link": "facebook.com/groups/1373361046396315/permalink/2190794237986321/", "likes": 51, "comments": [{"username": "Paulinha Cã", "comment_text": "Thanks a lot for all information. How many hours do you recommend (not including museum) to walk around and have a meal?"}, {"username": "Mary Stinnett Boggs", "comment_text": "Thanks for these specific tips! Very helpful!"}, {"username": "John Schlosar", "comment_text": "Yes, all that, but don't neglect to see the Camposanto Frescoes. Close to the Field of Miracles. The restoration work is also amazing to see and great progress is being made! https://\nwww.opapisa.it/\nen/events/\nthe-frescoes-of-\nthe-monumental-\ncamposanto-of-p\nisa/"}, {"username": "Rebecca Van", "comment_text": "Perfect! Thank you! ❤️"}, {"username": "Victoria Russo", "comment_text": "Great information. Thank you"}, {"username": "Laura Jetton", "comment_text": "This is great info! Brandon!"}, {"username": "Nicole Reid", "comment_text": "Thank you! We are staying in Pisa for 3 days 😊"}, {"username": "Alexis McNamara", "comment_text": "This is great. Ty. Do you know if we need to reserve luggage storage ahead of time at the train station or nearby? We arrive at 8:30."}, {"username": "Denise Bibby", "comment_text": "Teena Leuba"}, {"username": "Claudia Amp", "comment_text": "Aggiungerei che per mangiare, soprattutto in questo periodo, è molto carino Il Gufo Bistrot in piazza Vittorio Emanuele, cucina casalinga con servizio self al Numeroundici in Via San Martino e se si vuole mangiare non italiano, buono Al Madina, ristorante libanese (ottimi shish di agnello e hummus incredibile) sempre in via San Martino; un bar carino per aperitivo con vini naturali e tapas mediterranei è Duende in via Curtatone.\n\nDa Pisa, potendo, suggerisco di andare a visitare la bellissima Certosa di Calci/\nMuseo di Storia Naturale dell’Università ci di Pisa."}, {"username": "Bolero Lam", "comment_text": "Good info"}]}, {"id": "2197788570620221", "text": "Heading to Italy In October. We have 7days before our cruise and 3 days after. Planning to do Rome Venice and Florence. 2 couples. What are some good hotels that won’t break the bank but close enough to the center of things ? Thanks In advance", "link": "facebook.com/groups/1373361046396315/permalink/2197788570620221/", "likes": 5, "comments": [{"username": "Lisa Quinn", "comment_text": "In all 3 cities or just Rome?"}, {"username": "Dorota Jedidi", "comment_text": "Venice-Hotel Antigo Trovatore🙂🙂"}, {"username": "James-Kathy Dickerson", "comment_text": "WE are leaving on a cruise on Oct 27 also any chance u r leaving out of Trieste"}, {"username": "Elena Kalm", "comment_text": "Following"}, {"username": "Elena Kalm", "comment_text": "I am interested in Rome"}, {"username": "Peter Barron", "comment_text": "In Rome we are staying at co.sleep, which does sound odd for a hotel name. It’s not far from the Vatican. We got a room with a spa and breakfast included for a great price."}, {"username": "Kathleen Mignogna", "comment_text": "James-Kathy Dickerson we leave out of the Rome area on the 12th"}, {"username": "Carmela Siniscalchi Frattellone", "comment_text": "I just stayed at Hotel Machiavelli in Florence. It’s near the train station and a 10 minute walk to Uffizi Gallery and Duomo."}, {"username": "Rachael Richardson", "comment_text": "We used booking . Com you could get 2 bedroom apartments if you are happy on sharing , much better value , fridge and freezer and washers in most - all ours were fantastic for all 3 locations - just filter them to get the best result"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Hotel Alexandria in Rome"}, {"username": "Jennifer Turbeville Hazen", "comment_text": "In Rome, Dante’s Hell (booked on booking.com). It was steps from the pantheon which means it’s close to trevi, Spanish steps, piazza navona, too. Breakfast is provided at giolitti’s. It’s clean, easy to find, and the AC is excellent. In Venice, hotel Tintoretto was cheap and adequate."}, {"username": "Renae Larcus", "comment_text": "In Florence Hotel Roma. In Venice A la Commedia Hotel"}, {"username": "Lisa Quinn", "comment_text": "Venice\n\nhttps://\nangelibb.com/"}, {"username": "Lisa Quinn", "comment_text": "Florence :\n\nhttps://\nwww.relaisdelduo\nmo.it/"}]}, {"id": "2197765737289171", "text": "Hi all,\n\nI am torn between these 2 undecided months. I would like to visit Florence , Pisa & Lucca ( both on the very same day ) - as my children loved the movie Lucca and also Amalfi Coast . My tentatives dates are a week of end of May or a week end of Oct .\n\nI would love to spend longer either in April ( Easter term break or July - summer termआणखी break ) but my kids can’t take the heat and dislikes crowds.\n\nBetween May and Oct, which would be a suitable month to visit the above beautiful gems ? And how many days should I need to explore Florence ? This is our very first holiday trip to Europe.\n\nOr should I firstly explore Naples, Amalfi Coast and etc on its own and then plan another comeback to Florence , Pisa & Lucca. I do not want to be overwhelming too. And could I keep Naples as my base exploring these lil gems ? Look forward hearing valuable advise.\n\nThank you", "link": "facebook.com/groups/1373361046396315/permalink/2197765737289171/", "likes": 2, "comments": [{"username": "Alice Francesca", "comment_text": "You mean LUCA the movie? Luca is a first name in Italy (Luke), Lucca is a town in Tuscany, which is lovely but has very different surroundings from Luca the movie.If you are looking for those, you should try the Cinque Terre or Lerici (google it)"}, {"username": "Rachael Richardson", "comment_text": "Pisa / Lucca same day\nFlorence at least 2 full days\nAmalfi coast would need a bit longer as positano, sorrento, amalfi and other towns are spread out so 3-4 days\nPersonally with young kids I’d choose Florence/\nTuscany area even parts of Rome . Not sure how old your kids are ?"}, {"username": "Roland Trego", "comment_text": "Take out the spaces. https: // mamalovesitaly . com/category/\nitaly-with-kids/\npage/2/"}, {"username": "Roland Trego", "comment_text": "Take out the spaces.\nhttps: // mamalovesitaly . com/category/\nitaly-with-kids/\npage/2/"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "About Pisa I wrote a post about it, so you can see it actually enjoying it (you can search with the lens).\nLucca is near Pisa, you can do both in one day (Lucca is 3 hours tops, rent a bike and ride long the walls, then visit via Fillungo and piazza dell’Anfiteatro\n). I suggest to do Pisa in the afternoon, much less crowded.\nIf your kids loved the movie Luca then you must go to 5Terre: Vernazza is the town you are looking for, it’s a nice one day trip."}, {"username": "Bea Kuckens", "comment_text": "October. From Easter on is very busy, May can be hot."}, {"username": "Melissa Castro Killen", "comment_text": "Luca is based on the towns of Cinque Terre. From Pisa about 1.5 hrs."}]}, {"id": "2198009433931468", "text": "Augusta, Sicily sunset! Bon appétit 🤌", "link": "facebook.com/groups/1373361046396315/permalink/2198009433931468/", "likes": 3, "comments": []}, {"id": "2198011853931226", "text": "Was in Venice. Firsthand witness to the heat! I can endure heat pretty well, but the humidity was high, too. I now know why there are so many gondolas and boats- there’s a lot of walking by foot if you don’t catch a boatride.", "link": "facebook.com/groups/1373361046396315/permalink/2198011853931226/", "likes": 44, "comments": [{"username": "Tuyet Thi Nguyen", "comment_text": "Tuyet Thi Nguyen"}, {"username": "Jackie Macleod", "comment_text": "But all of Venice is completely walkable, we always do. Alilaguna from the airport, the vaporetto only to other islands. Walking and discovering places is what we love about Venice"}, {"username": "میر ہادی", "comment_text": "Wow, that sounds like an amazing experience! I've heard that Venice is beautiful but can be quite hot and humid in the summer months. It's great that you were able to explore the city and take in all the sights!"}, {"username": "Kelly Tabor", "comment_text": "Hit the record store. Second floor overlooks the plaza and has a lovely breeze. Lunch too!"}, {"username": "Pam Borchert Wildrick", "comment_text": "Keep a sense of humor and enjoy!!!"}, {"username": "Pam Borchert Wildrick", "comment_text": "No"}, {"username": "Mona Ruff-Root", "comment_text": "What does the women wear? . I’m going in October and I’m trying to take a small suitcase ."}]}, {"id": "2198012363931175", "text": "Positano restaurant suggestions-gro\nup of 10- prefer more authentic and off beaten track instead of touristie. TY!", "link": "facebook.com/groups/1373361046396315/permalink/2198012363931175/", "likes": 4, "comments": [{"username": "Oldriska Balouskova", "comment_text": "Off the beaten track in Positano? Next to impossible"}, {"username": "Alfonso Ingenito", "comment_text": "Go to other less known or tourist destinations like Atrani, I personally love CETARA"}, {"username": "Alice Francesca", "comment_text": "Le tre sorelle , right on the beach.I am Italian and this is THE best restaurant."}, {"username": "Stacey Book", "comment_text": "You could also ask for help in the Cerca app - they have local concierges for positano I think"}, {"username": "Linda Love Vines", "comment_text": "There are two restaurants in Montepertuso above Positano. They both provide transportation to and from your hotel. We went to Il Ritrovo (amazing authentic food and sea views)and the other,which we didn’t try but lots of people have recommended is La Tagliata. Both have great views! Both could accommodate a large group."}, {"username": "Kim Hudson", "comment_text": "https://\nwww.ilritrovo.co\nm/\nWe were there last week. Loved this restaurant. They provide a shuttle service. Our mean was excellent and the view was beautiful.\n\nWe also liked Lo Guarracino. The walk there was fantastic!"}, {"username": "Caryn Goode", "comment_text": "Seraceno D’Oro."}, {"username": "S Christian Everett", "comment_text": "Perfect …. Casa Mele.\n\nNot a tourist trap!\n\nWe’ve been 4 times now and it is the best meal we’ve found in the Amalfi Coast\n\nhttps://\nwww.casamele.com\n/"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2198013240597754", "text": "Beautiful Santa Magdalena\n-\nItalian Dolomites\n\n📷myself", "link": "facebook.com/groups/1373361046396315/permalink/2198013240597754/", "likes": 37, "comments": [{"username": "Monica Colontonio Macho", "comment_text": "Bellissimo!"}, {"username": "Lee Anne Reed", "comment_text": "Love the Dolomites"}]}, {"id": "2198014230597655", "text": "I’m in the process of planning my own trip for October. We want to go to Rome, Florence and Amalfi coast. Can you please recommend the best way to plan this transportation wise. Thank you so much.", "link": "facebook.com/groups/1373361046396315/permalink/2198014230597655/", "likes": 4, "comments": [{"username": "Elena Kalm", "comment_text": "I am interested too"}, {"username": "Rhona OConnor", "comment_text": "I used Google maps to work out the transport by train. Then booked the first two journeys on the Trainline app. Booked my accommodation on www.booking.com staying close to the train station so I was not dragging by bag too far. Worked out very well."}, {"username": "Alice Francesca", "comment_text": "Train! Easy !"}, {"username": "Glenn Todd Webb", "comment_text": "Fly into Naples. Take private hire to Amalfi destination day of arrival (most convenient but more expensive than train>bus And it’s easier to go on day of arrival than to have this last part of trip and try get back to Naples and catch plane early am when on end of trip). Leave Amalfi private hire to Naples trains, train to Rome, leave Rome train Florence. Fly home."}, {"username": "Kim Hudson", "comment_text": "We literally just got home from this exact trip. Flew into Florence. Train to Naples and private car to Positano. Private car back to Naples and train to Rome. The only change I’d make is the order."}, {"username": "Anita Pirone", "comment_text": "Exactly what we want to do !! Will be following this post 🥰 the only thing I read or someone mentioned can’t remember now is do Rome first since it’s so hectic 🤷🏻‍♀️ thoughts ?"}, {"username": "Raf Gervasio", "comment_text": "Train every time it's cheap comfortable and fast especially the Fecciarossa"}]}, {"id": "2198014027264342", "text": "Hello,\nFOr a Gondola ride in Venice, I found online: Christian's relaxing gondola rides, unfortunately no phone number or website to book. Does anyone ever ride with him and has the phone number/information to contact him, or knows how to book?", "link": "facebook.com/groups/1373361046396315/permalink/2198014027264342/", "likes": 0, "comments": []}, {"id": "2198015390597539", "text": "Wondering if we should buy a rail pass or not. Any advice would be appreciated.", "link": "facebook.com/groups/1373361046396315/permalink/2198015390597539/", "likes": 0, "comments": [{"username": "Jan Armstrong", "comment_text": "Do you mean for Rome or further afield?"}, {"username": "Nicola Ramoso", "comment_text": "If you're planning to travel around Europe yes otherwise no.\n\nThe only train pass that I know of that is available in Italy lets you travel for 3 or 5 days (depending on which you buy) with regional trains only, good for exploring a specific region (like Tuscany or Veneto)."}, {"username": "Anthony Sperduti", "comment_text": "Only if you are going to get on a train"}, {"username": "Sam Mah", "comment_text": "Where do you want to go and for how long. Do you want flexibility or will will you book ahead. It depends on what the answer is to those questions."}, {"username": "Robin Barbera", "comment_text": "Unless you are\nGoing to be in Europe\nFor an extended period of time and constantly moving. I don’t think it is worth it"}]}, {"id": "2198020673930344", "text": "Any recommendations on transportation from Sicily Airport to Taormina?", "link": "facebook.com/groups/1373361046396315/permalink/2198020673930344/", "likes": 0, "comments": [{"username": "Mike Ball", "comment_text": "Which airport?"}, {"username": "Jenny Licciardi", "comment_text": "From.catania airport to Giardini naxos 180 euros taxi I think.it maybe the same to Taormina"}]}, {"id": "2198021973930214", "text": "Family flying Montreal direct to Rome next week - 6 hour wait before flight. What time does Air Canada allow you to check baggages and check in ? Might check bags and go out to eat in Mtrl to kill time. Also are you allowed duty free to be brought on carry on? (alcohol etc) ? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2198021973930214/", "likes": 0, "comments": [{"username": "Alessandra Pasteris", "comment_text": "Hi. Another Montrealer here. We are currently in Italy and flew direct from Montreal to Rome as well. You need to be there 3 hours prior to your flight. My advice if you’re flying with younger kids is to do the YUL Express registration which allows you to fast track security instead of wait the line. That’s a free service. https://\nwww.admtl.com/\nen/guide/\nyulexpress-servi\nce\n\nAlso, we access the National Bank lounge. If you’re not a national bank card holder, there is a small fee to enter but it’s worth waiting in there with access to food and beverages than waiting at the gate.\n\nHope this helps."}, {"username": "Valda Walsh", "comment_text": "Call Air Canada to ask. Coming in the opposite direction (returning from Rome) we went early to the airport and they would not check the bags until it was the earliest time to check bags (I think it was 3 hrs prior to boarding). It was Air Canada but it mighta been a Rome airport thing.\nWhy 6 hrs early? Are you flying into MTL from somewhere? If not flying, avoid arriving at the airport and store luggage in town and roam. I know there is one at the train station"}, {"username": "Rhona OConnor", "comment_text": "Check in opens 2/3 hours before your flight. They ask that you do not arrive before that. I would not risk checking in the leaving the airport 🙄 lots of restaurant, shops and seating in the airport."}]}, {"id": "2198023093930102", "text": "👋 We have been quoted €60 each way for a taxi journey from Pontedera train station to our accommodation at Peccioli next Wednesday which is a 15 taxi journey…. Can anyone say whether this is a normal price or whether by keeping fingers crossed for a taxi at 21:00 at the train station we will find a cheaper ride? 🚕", "link": "facebook.com/groups/1373361046396315/permalink/2198023093930102/", "likes": 1, "comments": [{"username": "Louis Des Forges", "comment_text": "Is this through a 3rd party company? They will probably be adding on commission."}, {"username": "Brenno Bianchi", "comment_text": "In Pontedera there are just 6 taxis in total, find one would be quite lucky"}, {"username": "Alyssa Culverwell Ostergren", "comment_text": "How many people? If it’s for a larger vehicle it makes sense."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Pontedera-Pecci\noli is not 15 minutes, but more likely 15 kilometres…"}]}, {"id": "2198023173930094", "text": "Can anyone recommend a reasonable company to book holidays to Calabria or hotel to book directly? TIA", "link": "facebook.com/groups/1373361046396315/permalink/2198023173930094/", "likes": 1, "comments": [{"username": "John Sampson", "comment_text": "Hi Linda,I went to Basilicata a couple of years ago and we rented privately from an italian family. It was amazingh.we hired a car from Bari and drove inland about 90mins.Great little mountain village.Not tied to anything. The accommodation was great and everything was so reasonable. We always do it now.it might be a good option for you guys"}]}, {"id": "2198023730596705", "text": "I have tried to figure this out on my own and find the official website so confusing. I only have 1 day in Rome and it happens to be a Wednesday. We are flying out on Thursday morning. The only \"wouldn't mind doing\" for my husband who has not been before was to try and go in St. Peter's Basilica. I know the Pope audience is on Wednesdays and itआणखी looks like you can not enter the basilica while that is taking place. If I understand correctly it IS open after this. While he wants to do this, he hates crowds and lines, so I'm thinking (based on lots of suggestions on here and other places) that since we are going to just do this on our own (no tour) we should plan to go near closing time - so that is the plan.\nI just need to confirm if it will actually be open after the audience, and about what time would this be over and admission be possible? And, I see it closes at 6:30 on the date we are there. Does this mean people are admitted inside up to 6:30 or you need to be out of there by 6:30?", "link": "facebook.com/groups/1373361046396315/permalink/2198023730596705/", "likes": 0, "comments": [{"username": "Cecilia Christine Costantini", "comment_text": "The Pope Audience starts at 10.30 and finishes at 12. The Basilica is open afterwards. I would go at around 5.30pm to be on the safe side, (lines can be up to 1 hour long) to have enough time to clear \"security\" and see the Church. They don't normally let you stay long after 6.30, or at least that is my experience in several churches in Rome. However, if your husband really dislikes crowds, I would say Santa Maria Maggiore, San Giovanni in Laterano or San Paolo Fuori le Mura are also very impressive Basiliche. San Paolo is outside the city center (metro B line, 4 stops from Colosseo, 10 minutes) and not many tourists go there."}, {"username": "Carol Potter", "comment_text": "I happen to be there on a Wednesday And Just got in line around 930 for the pope service at 10 and we got right in and stayed through the whole service with no problem. Nobody said a word.￼"}]}, {"id": "2198026667263078", "text": "Hi Everyone! Does anyone have any private car/tour recommendations that’ll pick you up from Rome (FCO) airport, take you to drop off bags in hotel and then do a day trip to Pompei? Thanks in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2198026667263078/", "likes": 0, "comments": [{"username": "Giuseppe Placi", "comment_text": "Transferelax\nSorrentocars\nGuemar\nWorldtour"}]}, {"id": "2198030513929360", "text": "Hi. Looking for folks who've recently flown Air France from the states!\n\nWe are traveling to Italy (Naples, Rome, Florence and Capri) in September, flying Air France from Atlanta. I am hoping to find someone who has flown Air France recently and can advise me regarding their carry on rules. I know the size of the carry on and they state theyआणखी allow: 21.7” l x 13.8” w x 9.9” h (55 x 35 x 25 cm) including wheels and handles. I am seriously stressing out trying to find a soft side carry on that small, the smaller ones are so small they fit under the seat! Most in the stores are 23\" tall with wheels, at least. Hard sides are smaller but we do not want to purchase a hard sided carry on.\n\nMy question is how strict is AF when it comes to the carry on size? I'm about ready to buy one and take it the Atlanta airport and try to fit it in their sizing template they have at the baggage check. Delta and other carriers allow taller sizes than Air France.\n\nAny Air France flyers who've flown from the states to Italy who can advise me as to how you handled the carry on sizing? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2198030513929360/", "likes": 2, "comments": [{"username": "Rhona OConnor", "comment_text": "Check in a bag and then you have no stress. Just don't fill a big bag that you can't lift!"}, {"username": "Chuck Morton", "comment_text": "Just adhere to the regulations and no problems! I find it amazing that people keep asking if it's OK to disregard the size limits!"}, {"username": "Lisa Silverman", "comment_text": "Are you flying air france booked by NCL? If so, it's actually Delta"}, {"username": "Stephanie J Stevenson", "comment_text": "Here’s my observation. If you bag is close to regulation size, it won’t likely be measured and checked based on size. Rarely do airlines use the sizers for all passengers. That said, you may have to check depending on who is at the gate and your boarding position. I wouldn’t sweat an inch or two and I’d also be prepared to check if asked."}, {"username": "Dayna Steinberg Cioffi", "comment_text": "We just flew Air France 2 days ago Naples to Paris to JFK/NYC. We did not carry on but i can tell you that many carry on roller bags were being gate checked bc the flight was almost full and they weren’t allowing any more on. So its never a guarantee. And the overhead bins were pretty small. One roller bag and it was full."}, {"username": "Holly Ng", "comment_text": "We just came back from Europe flying on Air France. We had 21” Travelpro carry ons with spinner wheels and had no problems fitting them into the overhead bins."}, {"username": "Patty Foster", "comment_text": "They are out there. You just need to look at more then typical retail stores. Away I believe had and option. We had a local luggage store that carried more brands. Unfortunately, most are more expensive. We went with Eagle Creek. Sort of a soft sided bag. Mine is 13.75 x 22 x 9. Figures crossed 2mm won’t be an issue.\n\nhttps://\nwww.eaglecreek.c\nom/"}]}, {"id": "2198033717262373", "text": "Hi! I have a question on Milan Duomo lift access - I read there is a lift (with a rooftop ticket), but they do not allow to use it down. Is it for real? No exceptions? how do elderly people make this tour? I am afraid if we take all 250 steps down, the rest of vacation will be supplemented by double dose of ibuprofen ((( any insight is appreciated...", "link": "facebook.com/groups/1373361046396315/permalink/2198033717262373/", "likes": 0, "comments": [{"username": "Carmine Castiglia Jr", "comment_text": "I don't know the answer to your question, but any elevator that goes up must come back down, right? No idea why they would insist that it makes the down trip empty..."}]}, {"id": "2198040390595039", "text": "We have 7 hours in Trieste Italy before we board our cruise...any suggestions on must sees? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2198040390595039/", "likes": 1, "comments": [{"username": "Gaia Alessi", "comment_text": "Miramare castle. SanGiusto castle"}, {"username": "Amina Zena", "comment_text": "Cavana, Napoleonica ( prosecco), Muggia"}]}, {"id": "2198033963929015", "text": "Does Tap work in Italy with phone?", "link": "facebook.com/groups/1373361046396315/permalink/2198033963929015/", "likes": 0, "comments": [{"username": "Bill Shafer", "comment_text": "￼ If you’re talking about Apple Pay, yes."}]}, {"id": "2198037000595378", "text": "Hi, My husband and I are planning a three week vacation in Italy. We will spend our first week in Tavernelle Val Di Pesa as à base and from there by car we wish to visit the surrounding villages in Tuscany. We are familiar with this area but have not been there for quite some time. Does anyone have suggestions for charming villages and quaint restaurants to explore. Thank you for any references", "link": "facebook.com/groups/1373361046396315/permalink/2198037000595378/", "likes": 0, "comments": [{"username": "Alice Francesca", "comment_text": "Hi!I am from Italy and the Val d'Orcia is what you are looking for! Google Pienza, Bagno Vignoni, Montalcino, Monticchiello and San Quirico d'Orcia.\nStay at Chiostro di Pienza or Posta Marcucci hotel in Bagno Vignoni (natural spa water pool!)Best wine and cheese (pecorino di Pienza) enjoy"}]}, {"id": "2198041263928285", "text": "This group was really useful when planning our 4 days in Sorrento - here’s some pics! Day 1 Pompeii and lunch at a vineyard. Day 2 chilling on the piers in Sorrento. Day 3 - small boat trip to Amalfi and Positano. Last day by the pool before late flight home 🇮🇹🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2198041263928285/", "likes": 235, "comments": [{"username": "Julia Glickman", "comment_text": "Beautiful photos 🇮🇹😍"}, {"username": "Nicole Parker", "comment_text": "We have 4 days in Sorrento planned for next year. Thank you! Who did you do your small boat trip with?"}, {"username": "Timmy HiFive", "comment_text": "Sally Lobbezoo Jason Sumner"}, {"username": "Susan Duwall", "comment_text": "Great photos"}, {"username": "Heather Hurley", "comment_text": "Looks wonderful! Wondering about the boat trip…. Was it private? Full day or half day? And how much? Hoping to book for September"}, {"username": "Rebekah Riley", "comment_text": "Lunch at the vineyard was that part of you tour to Pompeii or were these separate? Do you remember the name of the tour companies you went with for these tours and for the boat? Both sound up our alley for our trip in April 😊"}, {"username": "Diane Bowler", "comment_text": "Beautiful photos, I’m there in September and would love to take the boat trip. Are the beaches public or due you have to pay?"}, {"username": "Andrea Franco Roberts", "comment_text": "Who did you use for the boat trip?"}, {"username": "Diane McWilliams", "comment_text": "Where did you stay in Sorrento?"}, {"username": "Diane Hamilton", "comment_text": "I wonder if there are any boat tours in November. Rome 3 days, Florence 2days Venice 2days"}, {"username": "Joyce Iannicelli", "comment_text": "Looks like a Great Time! Wonderful Pictures!!"}, {"username": "Paul Davis", "comment_text": "Great pix!"}, {"username": "Donna Edwards", "comment_text": "Thanks, we are going there in Nov."}, {"username": "Meredith Holloway Helbon", "comment_text": "Can you please tell me about your vineyard lunch after Pompeii and where that took place? This sounds divine. ❤️"}, {"username": "Mary Lou Gillen", "comment_text": "Beautiful pictures!"}, {"username": "Sue Beckett", "comment_text": "Hi what accom did you stay in Sorrento please"}, {"username": "Martin-John Rubio", "comment_text": "Great pictures 🥳"}]}, {"id": "2198051627260582", "text": "Hotels in Venice are so pricey! Travelling in November. Please share your hotel recommendations - thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2198051627260582/", "likes": 2, "comments": [{"username": "Kristina Ruk", "comment_text": "We stay in Venice town (not the main island). We ussually travel by car, but there is public transportation to the island. So it isnt so pricy."}, {"username": "Karen Blackmore", "comment_text": "Hotel Ala is great! No idea of your budget though."}, {"username": "Alice Francesca", "comment_text": "Pricey in November? I have just checked and you can get a 4 star hotel with spa at less than 150 Euros per night."}, {"username": "Katie Kopecky", "comment_text": "Hotel Wildner"}, {"username": "Kathy Flood", "comment_text": "https://\nwww.royalsanmarc\novenice.com/#/. We loved it here"}, {"username": "Danielle Johnston", "comment_text": "We liked this place. It was close to train and taxis and includes a nice buffet breakfast."}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "Most fabulous apartments! We stay at the Skyline penthouse near Saint Mark’s. It’s dreamy and soooo reasonable! https://\nanestinvenice.co\nm/\n\nGreat options for families."}, {"username": "Sarah Bullen", "comment_text": "Hotel Venezia. Not in the historic part but a quick tram/ bus ride away from Venice itself."}, {"username": "Lisa Close", "comment_text": "Hotel Rio ☺️ reasonable and about a 2 minute walk from St. Marks square!"}, {"username": "Renae Larcus", "comment_text": "Hotel A La Commedia"}, {"username": "Lisa Valdovinos", "comment_text": "Hotel L’ Orologio. It’s on the canal. Very nice."}, {"username": "Linda Chase", "comment_text": "Hotel Principe"}, {"username": "Carrie Fraser", "comment_text": "We have booked the Columbina, for November, looks good for us, a family of 4 and brekkie included!"}, {"username": "Nick Cittadinni", "comment_text": "JW Marriot"}, {"username": "Farrah Louise", "comment_text": "We stayed near Marco Polo airport and travelled into Venice daily it was only a 20mins train journey and was very easy to navigate. X"}, {"username": "Shelby Symons", "comment_text": "we recently stayed at Hotel Bonvecchiati and it was great and location was really good too"}, {"username": "Ruth Mattingly", "comment_text": "Hotel Kette. Was reasonable in April, and near Piazza San Marco. On a small canal."}, {"username": "Emma Rolls", "comment_text": "Vanessa B&b its a 30 min bus journey and fantastic. Pool aswell 👍"}, {"username": "Renee Bell", "comment_text": "We are booked at the best western continental in September. Check that one out"}, {"username": "Reshma De Cruze", "comment_text": "Hilton Molino Stucky Venice we stayed here and it was great"}, {"username": "Phyllis Snyder", "comment_text": "In Rick Steve’s travel guide has he listed an accommodation booking service called Cross-pollinate\n/ www.cross-polli\nnate.com. It’s a booking service for private rooms and accommodations in the old centers of Florence, Rome and Venice, rates start at $35 per person . Might take a look."}]}, {"id": "2198052747260470", "text": "Any private transportation information from Napoli to almalfi anybody recommends please share info", "link": "facebook.com/groups/1373361046396315/permalink/2198052747260470/", "likes": 0, "comments": [{"username": "Giuseppe Placi", "comment_text": "Transferelax\nSorrentocars\nGuemar\nWorldtour"}, {"username": "Sandy Radican Shikaly", "comment_text": "Amalfi Coast Transfers"}]}, {"id": "2198052530593825", "text": "To all ￼ the first time travelers that ask questions ￼ in regards to taxis train getting around from one place to another. It is very simple, google your destination, and it will give you options how to get there by train car or walking. It even tells you the price. Safe Travels .😎🥂", "link": "facebook.com/groups/1373361046396315/permalink/2198052530593825/", "likes": 1, "comments": []}, {"id": "2198054933926918", "text": "Planning a trip the second half of April fly into Rome and exploring Tuscany with a stay in Florence and a visit to Pisa. Originally I wanted to do next summer and have more time but I’m thinking it will be more comfortable (weatherwise) in April with smaller crowds. Any feedback from anyone who has travelled during this time is appreciated. I know it doesn’t cover nearly all of what I would like to get to but I’m thinking I’ll just have to go back again.", "link": "facebook.com/groups/1373361046396315/permalink/2198054933926918/", "likes": 0, "comments": [{"username": "Alice Francesca", "comment_text": "Skip Pisa and visit Lucca and Siena instead."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2198055167260228", "text": "Hello.I'm planing to visit Italy,in octomber.My doughter has birthday and as a present i want to make unforgateble trip for her. She is 14 I want to start from Rome and which cities would u recomend.", "link": "facebook.com/groups/1373361046396315/permalink/2198055167260228/", "likes": 2, "comments": [{"username": "Kristina Ruk", "comment_text": "Venice and Florence.. but as a teenagers mum also hope your likes all the history and sigthseeing😉as mine prefer to look on a phone🤣"}, {"username": "Brooke Heneghan", "comment_text": "Verona is beautiful and a good base for day trips to Venice and lake Garda x"}, {"username": "Silvia D'arienzo", "comment_text": "Salerno costiera amalfitana e cilento"}, {"username": "Chelsea Johnson", "comment_text": "i think she’d love the amalfi coast!!"}, {"username": "Phyllis Snyder", "comment_text": "What is she into? History, nature, shopping, beach, sports, hiking, biking?"}, {"username": "Lisa Valdovinos", "comment_text": "We did a cooking class in Florence in a small group. It was a lot of fun. I bet they have them in the areas you want to visit."}, {"username": "Bill Casper", "comment_text": "Venice for sure. Taking our 15 year old daughter there for her quinceañera, 15th birthday; a wedding like birthday celebrated in all of Latin America. Also Sienna near Florence. Florence is very close to Rome by the Renfe trains. Like 1:45 or so. Florence is the birthplace of the Renaissance, so if she’s into art and incredible architecture spend some time there with a day or overnight trip to Sienna."}, {"username": "Kylie Paine", "comment_text": "Paris has the fondue restaurant which is all over tiktok I'm sure she would love that at her age .."}]}, {"id": "2198057043926707", "text": "Hi\nWhere can we have a nice good pizza or Italian pasta near the center? We are a group of 20 with different ages.", "link": "facebook.com/groups/1373361046396315/permalink/2198057043926707/", "likes": 0, "comments": [{"username": "Carly Plantagenet", "comment_text": "Centre of where"}, {"username": "Alice Francesca", "comment_text": "From North to South you can surely have a decent pizza and pasta ANYWHERE IN ITALY"}, {"username": "Angela Gilmore", "comment_text": "What city? 😅"}, {"username": "Gillian O'Callaghan", "comment_text": "Hi Heba....it would help to know which city or town you're in. Another option is to ask your accommodation staff. Enjoy."}, {"username": "Colleen Dawson", "comment_text": "Since you did not specify the city, my go to is Green Tower in Trento."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "You need to split up and go separate ways in small groups."}, {"username": "Frank Hunt", "comment_text": "Ah, a lovely pizza in the town centre of Tuscania, north of Rome.\n\nhttps://\nwww.italythisway\n.com/places/\ntuscania.php"}, {"username": "Randy Steinberg", "comment_text": "Randy Steinberg"}]}, {"id": "2198056157260129", "text": "So my husband is the sweetest. He's taking to Italy Late September. I've got a big trip to plan quickly. We are going to Florence first and a must is the Amalfi coast. Would prefer to fly in and out of Rome as it seems to be the best priced plane tickets. Any suggestions of 1 or 2 other places we could visit within 6 hours of Rome? I love the water.", "link": "facebook.com/groups/1373361046396315/permalink/2198056157260129/", "likes": 3, "comments": [{"username": "Kristina Ruk", "comment_text": "Venice, Florence ;)"}, {"username": "Alice Francesca", "comment_text": "You will see wonderful sea on the Amalfi Coast and Capri ,stick around there.Ponza and Ischia both worth a boat trip too."}, {"username": "Lieben Rutgar", "comment_text": "Lucky girl, enjoy!"}, {"username": "Hale Fitzgerald Heather", "comment_text": "Cinque Terra"}, {"username": "Dave Conroy", "comment_text": "You have to factor in the reduced cost of choosing Rome but the added costs of the necessary transfers. I would get a guide book. Sit down for an afternoon, relax and choose the places you must go to. Work out the most sensible route cost and distance wise. Book the tickets and remember you can fly into one city and out another. Again, this can be less, same or mosre cost, so you need to do a simple calculation Time and hassle is another cost. personally I would rather miss places than put myself through a lot of complexity and hassle. Much depends on the duration you'll be there. Being in a country for a week vs a month or 3 months are all very different in how you might approach priorities and plans."}, {"username": "Wade Bailey", "comment_text": "Fly into Venice then out of Rome/ Naples or vice versa. Backtracking to Rome to fly home costs you a half day."}, {"username": "Kit Nader", "comment_text": "Venice obviously! There's no where on earth like it. You won't regret it and you'll never forget it!"}, {"username": "Matthew Cawley", "comment_text": "Sorrento (2 hours on coach). Tuscany regions"}, {"username": "Lisa Valdovinos", "comment_text": "We flew into Rome and out of Venice. Venice was really nice and so is Florence. We also visited Sorrento. They’re all wonderful!"}, {"username": "Bill Casper", "comment_text": "Venice\nMilan\nFlorence\nSienna\nNaples"}]}, {"id": "2198060623926349", "text": "Uffizi/Boboli Garden question:\n\nWe have a Uffizi 2:00pm tour booked, Express tour(2hrs). I know it is late and might be a more crowded. We have a full day Siena/San Gimignano the day before. Plan was to have a slow morning. Do lunch then do the Uffizi tour. After we were thinking to walk over and see the Boboli Gardens from about 4:30 to close atआणखी 6:30. Then take a taxi to Piazzale Michelangelo for the sunset at 7:30pm. (Taxi because we did not feel the climb to the top to Piazzale Michelangelo). Or we could do the Boboli Garden another day and just slowly work our way to Piazzale Michelangelo from Uffizi.", "link": "facebook.com/groups/1373361046396315/permalink/2198060623926349/", "likes": 1, "comments": [{"username": "Rachael Richardson", "comment_text": "You could fit that in the gardens are lovely but not that big , you can do in 2 hours , the viewing point Michelangelo is not far from the top exit"}, {"username": "Ana Ka", "comment_text": "I would take a taxi to Piazzale Michelangelo...\nespecially in the summer when it's hot. As for Bobboli is quite pretty, but in my opinion, good, but not amazing... The history of bobboli is fascinating though; here is a lovely video about how these gardens started and how exotic their plants used to be back in the days: https://\nappyguide.com/\nstories/\nboboli-gardens"}]}, {"id": "2198067030592375", "text": "We leave in 5 days for our dream 20 day trip to Greece and Italy.. we’re staying in Athens, Santorini, Mykonos, Rome, Venice, Sorrento and Florence - a day trip to Amalfi.. what are your packing tips? We’re a family of 5.. my kids are daughter 22 and 2 sons 20 and 18….how much clothes would you take?? I have packed but thinking I’m going to re do and take things out .. currently I have 20 dresses and 3 shorts….", "link": "facebook.com/groups/1373361046396315/permalink/2198067030592375/", "likes": 43, "comments": [{"username": "Rhonda Hope", "comment_text": "You can pack 50 dresses will you wear them all no"}, {"username": "Bronwyn O", "comment_text": "I traveled with 4 outfits for my 16 day trip earlier this year. It worked, although I wouldn’t have minded a 5th."}, {"username": "Thressa Oliver", "comment_text": "Hoping all the wild fires do not effect your trip🙏🏼"}, {"username": "Bill Casper", "comment_text": "We always take 4-5 days of clothes and stay at Air BNB’s or Booking apartments that have washing machines on long trips."}, {"username": "Elaine O Herlihy", "comment_text": "I always buy clothes when Im away. At markets etc. Great have something different when you are home. No way would I bring 20 dresses. Buy a few when you are there."}, {"username": "Carlyn Renee Hampton", "comment_text": "Most hotels have laundry facilities. So pack less is you can. Also, when I have traveled I take too many shoes. So maybe reevaluate that. Packing cubes are an easy way to help keep organized and a laundry bag (mesh or just grocery bags) have an amazing trip!! Safe travels."}, {"username": "Miyuki Kanno Paul", "comment_text": "Santorini will be BRUTALLY HOT. The ray of sun will sing your skin, and you WILL feel the intensity of it."}, {"username": "Martha Heller", "comment_text": "Wow! 20 dresses? I don't even own that many!! I try to pack super light! For 20 days...I picture 4 dresses, 2 skirts ( no shorts), 2 pr pants, 4 shirts, one light weight blazer, 1 large scarf/wrap, 2 pr shoes (sandals and comfy walking shoes) Everything should be mix and match.\n\nHave a wonderful time!!"}, {"username": "Lesley Vullo Pino", "comment_text": "Unpack some of that… Wash and rewear . You’ll be so much happier in the long run"}, {"username": "Stanley Wong", "comment_text": "It’s very hot in Greece right now. Pack more lightweight clothing. Where do folks do their laundry when they are on these month long vacation? Hotel laundry is very expensive. Any good tips finding local laundromat?"}, {"username": "Wendy Byrnes", "comment_text": "No more than:\n4 shorts,\n6 shirts( tshirts if preferred- include 2 evening tops)\n3 dresses max\nOne pair of long pants for nighttime.\n12 sets of underwear and socks.\n2 pairs comfortable walking shoes.\nNo one (besides your family) will see you repeat an outfit.\nI guarantee you will shop."}, {"username": "Jan Cowhey", "comment_text": "Seems like a lot of dresses to me….my thinking is that you will be in different places so if you stick to basics and rotate, you would only need perhaps 6 dresses…..a couple of t-shirts and maybe two skirts that can be worn with any of the t-shirts. Have a great time."}, {"username": "Jocelyn Pettitt", "comment_text": "Flat shoes or sandles, summer dresses, hat and sunglasses.\n\nI hardly wore pants when I was in Italy, it was mostly summer dresses which are so light and versatile.\n\nHave a great trip! Both Italy and Greece are dream places to go!"}, {"username": "Lisa Hry", "comment_text": "Hi Jasmine,\nMay I ask if you are crushing between them or how you are doing this? I would love something similar"}, {"username": "Carmen Hinde", "comment_text": "I just returned from a 24 day trip, almost the exact itinerary. Things I learned for my next trip: 1) I will invest in more cotton and linen flowy shorts, tops and mid-length dresses. 2) I don't need long maxi dresses. 3) mix&match swimwear (tops&bottons).\n4)one smart swimsuit cover up. 5) breathable sneakers. 6) leather strapped sandal. 7) canvas type slip on shoe (Bob's or espadrille) 8) no jeans were needed. 9) loose/flowy/\nairy linen or cotton pull on pants. 10) a linen/cotton/\nchambray long sleeve shirt to go over tops or dress. 11)One breathable cap (you can get a sun hat there if you really need it) and sunglasses. Shopping is very easy and appealing in Italy/Greece. HAPPY TRAVELS!!!"}, {"username": "Linda Pitler", "comment_text": "I’d cut the dresses in half. If you have access to laundry I’d cut it even more.\nHave a wonderful time."}, {"username": "Emma Bunning", "comment_text": "Not an answer to your packing questions but just a heads up to check the news regarding fires in Greece at the moment."}, {"username": "Christine Byrne", "comment_text": "Pack a change if clothes in your carry on JIC luggage is misplaced."}, {"username": "Dann Hrusch", "comment_text": "No matter how long the trips is, I pack for 5 days and do laundry as I go. This method has worked great on several 15-21 day trips."}, {"username": "Jane Esposito Gagliano", "comment_text": "Way too many dresses"}, {"username": "Frannie Kaplan", "comment_text": "I hope you're staying somewhere with a washing machine. It was 39 degrees today"}, {"username": "Katherine Smith", "comment_text": "Carry on only. 2 dresses, sweater or light jacket. 1 pair of pants/ leggins. 3 -4 tops/ shorts. 2 pIIr of shoes. That's it. You will be so much happier if you don't have to drag all that around. Wash clothes when able."}, {"username": "Jennifer Wojack", "comment_text": "Wow! Sounds amazing"}, {"username": "Gabi Thomas Chaplin", "comment_text": "make sure atleast 3 dresses cover knees and shoulders- several cathedrals and some other sites require it. i took mostly dresses on our trip as well and loved it because it was so hot and my dresses were light and flowy- even my maxi dress that i wore to the Vatican"}, {"username": "Louise Savage", "comment_text": "Apologies if this has been mentioned already but the weather in Europe is exceptionally hot ( record breaking temperatures) at the moment so above all I would take cool , light comfortable clothing , water bottles to fill up and perhaps some sort of fan.\n\nHave a wonderful time all the places you are visiting are beautiful"}, {"username": "Donna Mulligan Bushka", "comment_text": "Dresses roll up small - I would pack all 20! I would bring 2 pairs of shorts and two tanks tops. Have fun!"}, {"username": "Sheryl Elizabeth", "comment_text": "OMG drop at least 15 of the dresses, take the shorts and a few tops, I wish I’d left the dresses behind"}, {"username": "Ειρήνη Δεγρέση", "comment_text": "Take into account the really high temperatures in Greece and Italy. Long sleeved, light coloured clothes, preferably white, breathable natural material, cotton or linen, no petreleum stuff, good quality sunglasses. The hat you will buy it on spot, we have wonderful ones."}, {"username": "Marianne Taillon", "comment_text": "This would be a dream trip for me! Enjoy!"}, {"username": "Dixie Kotylak", "comment_text": "Take 5 dresses."}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Pack light …. You have to carry all that around … wear the same outfit 3 times…. You don’t need as much as you think …1 carry on per person. It’s going to be hot and crowded…. Cool clothes! Have fun !"}, {"username": "Sande Ricci", "comment_text": "I brought a carryon and a backpack for 16 days. Didn't wear half of what I brought. Next time no backpack. It will make travel so much easier."}, {"username": "JeriLynne Clifford", "comment_text": "Do not check a bag if you don’t have to. Trust me! We did 2 weeks with back pack and carry on. Also, your children are all adults. They each get the same. I pack an empty duffle bag and check it on the way home so I have room for purchases."}, {"username": "Cindy Corrigan", "comment_text": "If you are looking for an amazing driver in Athens reach out to Manos Karystinaios - he took amazing care of us all day, I’ve had other friends use him and he’s an absolute pleasure (and he will take you to all the best things to see in Athens!!) his price is very reasonable- he will even pick you up from the airport. Tell him I sent you!!"}, {"username": "Renee Rundle Stoneham", "comment_text": "20 dresses!😱\nThat’s 1 dress every day you’re gone.\nYou have 7 cities so 14 times you’re hauling bags etc…\n\nLess is more. Do laundry 1-2x\nPack for 2 weeks.\nYou’ll only need 2-3 shoes tennis shoes & 1 sandal, walking, so much walking… no heels (cobblestones)\n\nI just did 15 days France and Italy. Carryon roller and backpack! Smaller suitcases are easier to haul around and upstairs etc…\n\nIt’s hot!! So hot!!!\n\nYou’re kids are definitely old enough to pack and haul their own suitcases."}, {"username": "Pat Felice", "comment_text": "As my Dad used to say: “Bring half the clothes and twice the money” Smart man!"}, {"username": "Rachael Richardson", "comment_text": "I took a portable washing line it was brilliant ! Used it all the time"}, {"username": "Harriet Hoffman", "comment_text": "Spoiler- I just got back from 3 weeks in Europe, ended in Rome! I had a carry on suitcase so I did not check it- I love to wear dresses. I had 15 dresses!!! All my dresses were flowy, thin light weight material-polyes\nter- plus 2 pair of shorts, 2 pairs of pants-2 tops- same thin material. I took one dressey jacket- for over the dresses. I wore everything and changed from day to night. ALL those dresses packed so thin! I did pack a week before to make sure I could fit it all and carry- roll it. I also wore saucony trainers with all my dresses👗 and short like underwear for the dresss!"}, {"username": "Cindi McLain Lokey", "comment_text": "Cindi McLain Lokey"}, {"username": "Michele Baron Vold", "comment_text": "Probably way too much. Also, it is very hot. Take bike shorts for under the dresses or walking in the heat will also be uncomfortable. Wear white gym shoes and take flat sandals for night. Do you have any dresses like from Athleta that you can rinse and hang. Keep three things for night and just repeat. I would take longer skorts (3) and very light tanks or tshirts (8) for day Dresses for night (3) maybe a pair of light flown pants in linen or thin cotton. Your day clothes will be sweaty but not the night stuff. Gym shoes of Birkenstocks for day and leather flip flops for night. You will not use jackets or sweaters so packing should be easy. I took nylon underwear and washed it in the sink. Use body wash or shampoo to wash out stuff."}, {"username": "Chris O'Brien", "comment_text": "View Amazing Walking Tours on YouTube\nMy daughter age 22 and friends are staying in Monti area of Italy and traveling to Venice and Positano . Watching a few of these videos ( recent days of heat captured). It helps them visualize, pack and get a feel for present day Europe. They are planning on many Instagram photo opportunities. Videos enabled them to pack half of what they thought they required. Clothes, Shoes etc.\nJust a thought 💭"}, {"username": "Krystal Apolinaro", "comment_text": "Nothing polyester. Cotton and linen only. The polyester stuff just sticks to you. Under pack. You will re-wear your favs anyways and will buy more stuff. I brought 6 outfits for a 10 day trip and ende￼d up only wearing two things for half a day."}, {"username": "Gina Rovello Keenan", "comment_text": "Do any of your hotels have laundry access? If not bring dresses you can wash in the sink and hang to dry overnight. I personally do not think you need to bring one dress for every day. For our first trip, I made sure our b&b had washer. We did a load at night and hung them to dry. For 12 nights we only brought clothes for 5-6 days."}, {"username": "Paige Montecalvo", "comment_text": "Spent 33 days in Europe in June. I brought 8 dresses and it was perfect (one I didn’t even wear). If you’re planning on visiting churches, bring one that covers knees and shoulders. The men will also need pants. My husband brought one pair of jeans and one pair of his moisture wicking golf pants. He was very sweaty in jeans even back in June, so do not recommend lol! As others have mentioned, it’s hot, and I’m not sure how you guys travel but we are adventurous. So I also brought 3-4 pairs of Lulu/Athleta shorts and 2 Athleta skorts which got a ton of use. Same with athletic tops/Tees. Also recommend 4-5 swim suits and a couple cute coverups you can rotate. I bought the Andie Tulum swim suit (LOVE!), and wore that with shorts and a kimono style cover up and it worked great for some of our all day adventures that involved beach and water.\n\nFor walking I brought my Reef cushion vista (most comfortable sandals ever… even wore them in Positano with many hills and steps and zero issues), as well and my white Vejas. Easy to wear with shorts or sun dresses. Threw in a couple other sandals/slides that don’t take up a ton of space.\n\nOne big miss for me, I didn’t realize the water shoes were needed for the rocky beaches. Reef and Archie’s have very cute options.\n\nLastly compression packing cubes, labeled with what’s inside is a game changer."}, {"username": "Susan A. Jasper", "comment_text": "Everyone tells me to pack and then go and remove 50% of it and repack."}, {"username": "Luigia Gray", "comment_text": "My advice is to pack light. You won't need all\nthat gear and you will kick yourself for bringing so much."}, {"username": "Shelby Mathis Snyder", "comment_text": "Will you have easy access to washers? If so, we did a similar trip and packed 5 outfits each. Worked perfectly and honestly had a few things that were never worn during our 3 weeks because we ended up shopping a little bit."}, {"username": "Anna Gambino", "comment_text": "I have been to Italy 5 times in the last few years. Overpacked for the first 4. I went in June this year and almost got it right. Pack things that match each other and bring less than you think. You can wash clothes if needed like everyone says. If you wear makeup, bring less. Leave hair dryer home. You won’t use yours. Pack comfortable shoes, leave heels home. Dresses are in fact good because the are a whole outfit."}, {"username": "Yessika Morales-Diaz", "comment_text": "We went to Hawaii for 10 days, family of 6...kids age 13 and 5 year old twins plus grandma....we totaled 4 carry ons....I packed 4 outfits, 3 swimsuits for each, 1 sweatshirt or hoodie, 1 cold weather outfit and did laundry as needed. We rented a penthouse with laundry in it. It was a huge time saver. I realize Italy has that fashion component but as a tourist with young kids I prioritize comfort and efficiency."}, {"username": "Ania Kubica", "comment_text": "Three dresses are plenty !"}, {"username": "Pauline SB", "comment_text": "Hi Jasmine! We just came back from 21 days. Pm me if you have questions. I think packing depends on what you plan to do and your interests. I had lots of dresses (over 10) but we like to dress up and go for nice dinners etc. as well I wore cotton dresses with runners in the daytime. I think I wore shorts only once or twice. I took a few of my workout outfits as I used gym and also wore for some of the sightseeing that involved stairs/hikes. It is really hot so although I took a light sweater and shawl there was no need for it. PS- I also bought a few dresses along the way mostly linen."}, {"username": "Starla Dawn", "comment_text": "Carry on only. You’ll be glad you did."}, {"username": "Alicia Cox", "comment_text": "My advice is cut it at least in half & if possible get it in a carry on as there r lots of travelers now & lost luggage is definitely a legit issue. Also, just carrying/\nrolling your luggage esp with all the crowds can be a hassle. Also, packing & unpacking every every 2-3 days with more stuff is a hassle. I have learned over the years I overpack & end up bringing back at least a third of my clothes unworn. I also don’t worry so much about difft purses or shoes, but instead I change up my look with jewelry (not the expensive stuff) & that doesn’t take up much space. But it’s your trip, so you have to do what you like. Main thing is comfort. You can hand wash & also take a travel size of febreeze 😬. You can also take some older clothes that you either toss or donate & that frees up space for bringing back souvenirs. I’ve learned to take less over the years, but still can improve myself. BTW - awesome trip for you & your kids! Have a BLAST & safe travels. DO PACK a light weight rain jacket with a hood & then you don’t have to worry about an umbrella. And don’t forget your sunscreen 😀"}, {"username": "Alicia Cox", "comment_text": "Oh yes - I LOVE my packing cubes esp with packing & unpacking; I roll my clothes & put them in packing cubes."}, {"username": "Christi Craddock Taylor", "comment_text": "Look at The abundant traveler on you tube. She has lots of videos and has been super helpful on packing tips, etc. She suggested 2 dresses, 2 shirts and 2 shorts/shirts. On our honeymoon 4 years ago to Greece we over packed. Luckily we stayed at one location but learned to pack less two years ago when we traveled to Rome. We had a car so wasn’t too bad having more luggage. In a few months we’re going to Amalfi coast and packing less since a lot of stairs and walking and no car. Someone said they ended up staying out all day and wearing same outfit. I think this happens more than we think and will need less clothes. Enjoy your vacation!!"}, {"username": "Alicia Cox", "comment_text": "All great advice with one exception for me - the toiletries! I take my own but in travel sizes that will be allowed in carry on. Last year my luggage got left in Scotland & I had to first thing in Ireland find a few tops & my toiletries. I was ok with the tops I found, but not the toiletries 🤣. I guess I’m a skincare & hair care snob (I have curly hair). I had to waste time & money buying stuff I threw out. Just my opinion 🤷🏻‍♀️; everyone is different."}, {"username": "Dayna Steinberg Cioffi", "comment_text": "Use compression bags. They allow you to pack so much more. Its boiling hot wearing things twice was pretty much out of the question for us. Lots of dresses were great to keep cool! If you can do do laundry its helpful but we didnt have any easy time finding a place in Rome and the one we found o would NEVER recommend. Enjoy!"}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "Pack light! You'll be in different cities so you can re-wear outfits. Carry-on for us for an 18 day trip. You don't want to lug around big suitcases. As we traveled to another city today, we saw people struggling with large suitcases on and off the train. This may sound gross, but although we're extremely sweaty and showering 3-4 times a day, our clothing doesn't smell. There are opportunities to wash clothing and since it's so hot, everything dries quickly (we've had balconies to hang clothes to dry)."}, {"username": "Jennifer Melka Maley", "comment_text": "One word~ CARRYON. And you will need half the amount you mentioned…"}, {"username": "Rhonda Hope", "comment_text": "Leave room for fantastic shopping"}, {"username": "Colleen Sommerin", "comment_text": "Sun dresses - I took 6 for 3 weeks but did wash. Didn't wear shorts or pants at all. I could have taken half the amount of things as I really only worse light dresses. I wore comfortable flat sandals."}, {"username": "Tracy Reilly", "comment_text": "I travel all the time.\n20 days - 3 dresses, 3 tops, 3 shorts/ pants.\nMake sure they all mix and match.\nI always live by the rule - 1 on, one off and 1 in the wash."}, {"username": "Dianne Lloyd", "comment_text": "20 dresses!!! Do the 'JOY' cull. . . only take those that you know you will wear and not those that are a maybe. Nobody cares what you wear (as opposed to the intagramers who think people do). Leave room to buy things . . . you are going to Italy!"}, {"username": "Jennifer Johnson Mayes", "comment_text": "I am finishing the trip you are about to do - kids are 22, 20 and 16. I overpacked! We did laundry a few times in our apartments but if you don’t have that, bring half of what you said (10 dresses and tanks/shorts/\nskirts) and hand wash in sinks and let things air dry out at night. Both Italy and Greece are in high heat waves so you don’t need any jeans or sweaters, not even at night"}, {"username": "Melanie Izzy", "comment_text": "I feel your pain I am the WORST over packer!"}, {"username": "Sally Warren", "comment_text": "2 dresses 2 shorts 1 skirt. 3 t-shirts, 2 linen shirts."}, {"username": "Irene Crystal-Farrell", "comment_text": "We spend time in Rome and Sorrento last summer & did a lot of walking so I'd recommend comfortable footwear /sports runners for days & change to sandals for evenings out. 20 dresses is definitely too many as 2 mins a day can do laundry of a dress, swimwear & underwear & it's dry in no time. Would also recommend fine cycleshorts for under dresses in that heat to prevent chaffing if walking a lot. About 6 light dresses & couple of light shorts & tops is plenty as you're travelling a lot & have to carry it each time🔥💪🏼🎒\nMegan Crystal-Farrell read comments for packing tips x"}, {"username": "Peggy Temte DeCecco", "comment_text": "Have you heard of a capsule wardrobe?\nMaybe ten pieces that mix and match.\nEx: a dress, a skirt, slacks, 2 pr of shorts with interchangeable\ntops tees, a blouse, and sweater."}, {"username": "Robyn Donnachy", "comment_text": "Deanne Carey so many good tips"}, {"username": "Enrica Palla", "comment_text": "We have washing machines in Italy, and also automatic laundries. You don't need 20 dresses trust me"}, {"username": "Nicola Morgans", "comment_text": "20 dresses is crazy. your making life hard for yourselves. 4 outfits including dresses. dresses can be day or night. one outfit on .one outfit drying. one outfit in the wash and one outfit spare. 1 bather and rinse it out every night and dry by morning. walking sandals. evening sandals. I personally have stopped taking heels as Italy has so many cobbled streets its best to wear flats. sarongs instead of towels x2 dry faster and much smaller. 2 shorts and cardigan or light jacket for evening. absolutely no toiletries just a toothbrush and buy everything when you get there. nothing white. ive got this down to an art. if you have any space put another dress in . but only one. light luggage makes all the difference."}, {"username": "April Cremer", "comment_text": "It’s so hot. Pack tank tops and moisture wicking things. Portable fans and light weight reusable water bottle."}, {"username": "Doug Burke", "comment_text": "Twenty dresses??? For twenty days? WAY overpacking.\n\nIt always amazes me that folks who are perfectly happy knocking around their house and neighborhood for a week in the same T-shirt, shorts and sandels, when they go on a trip for the same length of time, they take six outfits and four pairs of shoes."}, {"username": "Yukti Verma Agarwal", "comment_text": "Just back from Greece and Italy - it’s going to be very hot and whatever you wear will be in sweat! So carry breathable cotton linen or viscose dresses or cotton shorts , something that you can wash and mix n match too . I’d say 5-6 dresses and 3 shorts with lots of strappy tops, t-shirts, etc. Always good to carry light as you will have to lift or pull your luggage through cobbled streets and stairs and you are also going to buy from there 😊"}, {"username": "Cynthia Guillen", "comment_text": "My son is on a 20 day trip to Italy with Texas A&M. The leader of the group,who goes on this trip every year, recommended packing for 9 days. They will do laundry while they are there."}, {"username": "Tara McCloud Odebrecht", "comment_text": "Pack as much as you can fit in a carryon and backpack. Less is more. I only took a big\nSuitcase one time and it was miserable. Never again. In our family, everyone gets a carryon and backpack. Our kids are 20, 18, 14 and we just got back from 2 weeks in spain. You would be amazed at how many dresses can fit in a carryon. Be thoughtful about the clothes. I am working hard to find dresses that are very lightweight. Long heavy dresses can take up a lot of space. For two weeks I went for a split of shorts / tops and dresses. I think I had 10 dresses / 8 shorts / 12 tops / 1 swimsuit / 2 PJs / 1 pants / 1 cardigan (last two are primarily for the plane). This is was too much. I always over pack - but only in a carryon and backpack.\n\nWe have done 31 days in carryons. My husband and son pack extra light and sometimes hit laundry while we are traveling."}, {"username": "Elaine Embleton", "comment_text": "Or better again, bring the basics, comfy walking shoes, a few t-shirts to cover shoulders in the sun and then I always shop there for some pretty and lightweight sun dresses."}, {"username": "Tijana GH", "comment_text": "Pack light as you will probably buy some summer dresses on your trip :) better have some space for memories :) also, Mykonos is a party island and pretty pricey, so be careful there. If you still have a chance, maybe take a look to go somewhere else. Maybe Crete, if you can make it, or Paros or Naxos."}, {"username": "MaeLeigh Cf Cervantes", "comment_text": "I saw advice on this page a week or so ago that was brilliant - lay all the money and clothes and shoes that you plan to bring out. Take half the clothes and shoes and double the money."}, {"username": "Sshona Ssmillie", "comment_text": "Jasmine, your kids are old enough to carry their own suitcases and if you can carry or pull yours then honestly sod it and take everything you want because it’s your holiday and you know what you want to wear and how comfortable you will be. The only thing I will add is take a pair of comfy robust shoes for Athens and Italy, you will do lots of walking. For 10 days I had 23kg allowance and my suitcase weighted in at 22.8. And I brought home stuff I hadn’t worn but didn’t give a toss.plus all these people who are washing stuff in holiday!! That’s not a holidays that chores in a different location for me no washing, cooking or cleaning it a NO1 holiday priority"}, {"username": "Richelle Trezise", "comment_text": "Are you staying in airbnbs if so take heaps out and wash. Your kids are adults they can do their own and carry their own."}, {"username": "Felicia Landis", "comment_text": "What ever you can fit in a carryon and back pack. Did a month last summer and that’s how we rolled anything more for luggage will be cumbersome and make moving difficult. Have a great trip"}, {"username": "Jon Ruple", "comment_text": "I mainly used socks and undies, pack light"}, {"username": "Melissa Castro Killen", "comment_text": "It is hot! I would take 3-5 outfits only. Buy whatever you need, when there - there are lots of cute clothes for sale, you will want to shop! I do recommend taking conditioner and a washcloth."}, {"username": "Patti Warren", "comment_text": "I highly recommend trying to reduce what you have to a carry on suitcase and a small duffle or backpack so you don’t have to deal with the headache of checking your bags at the airport and lugging them around. The lines to check in your bags are extremely long and lots of people lose their luggage."}, {"username": "Izzie MacDonald", "comment_text": "We've been in Italy 5 weeks with carry on only..1 pr sport sandals, 2 dresses..1 pr togs..1 shorts..2 singlets..1 light sweatshirt....5\nx undies..rinsed every night no dramas.."}, {"username": "Soc Cer", "comment_text": "To me it's personal preference...I always over pack because I love outfits...LOL..\n...but for most, the lighter, the better.....espe\ncially when travelling to different destinations because you'll be hauling all those luggages around with you...."}, {"username": "Katalina Loredo", "comment_text": "Don’t take such a large suitcase. If you’re taking trains, make sure you can lift your luggage above your head because that’s where the suitcases go. If you can’t pick it up, then you’re bringing too much! Use packing cubes and fold the clothes to their length. I’m with my mom right now on day 10 of our vacation and I brought 5 dresses, 3 pants, 2 shorts, and 5 shirts. I overpacked but it all fit in one packing cube"}, {"username": "Patricia Quirk", "comment_text": "3 or 4 shorts, 6 tops (including 2 that you can wear either day or night) 3 dresses. It is hot. We are in Rome and finishing up a 10 week holiday. Travel light and take some detergent to do hand washing - you’ll need it. Your bag seems manageable early but when a you start moving it is a hassle.\n\nPlus it is sale time in Italy!"}, {"username": "Chelsea Gudith", "comment_text": "Just came here to say… everyone saying to hand wash dresses…. That WAS my plan, but the sinks here in my AIR BNB are too small to wash my XL dresses, and it’s too cold in here (not complaining, actually thrilled), for a dress of mine to dry. We’ll be taking our clothes to the laundromat after our 4 days in Rome before we move down to Sorrento.\n\nI’ve been wearing two separate outfits a day because I’m so sweaty from the morning, that my clothes don’t dry before we go back out again at night."}, {"username": "MaryBeth Kennedy Owen", "comment_text": "You are over packing. Take things that you can wash in the sink and pack detergent. Dragging large suitcases around everywhere is hard… I would pack for , at max, 10\nDays… and a small bottle of detergent! Maybe even 7 days! Enjoy! I’m in Greece right now and have come from Venice"}, {"username": "JoLynn Waters", "comment_text": "Portable laundry soap sheets, portable fans, power strip, European plug, portable clothes line, blue tooth speaker for music and audible books."}, {"username": "Krissy Dascoli-Meehan", "comment_text": "I can attest to how hard it is to travel with a lot of luggage. If you can pack lighter, you will be happier."}, {"username": "Rachael Richardson", "comment_text": "Overpacking I took about 5-6 dresses 3 pairs of shorts and lots of strappy tops ! I did not get changed that often - most days we stayed out all day and just had lunch and tea out, you will be a sweaty mess no one cares what you look like , one pair of sturdy sandals and a pair of trainers"}, {"username": "Ruth Micallef", "comment_text": "Skip amalfi and go to Ravello"}, {"username": "Ruth Micallef", "comment_text": "I would definately change to summer dress for an evening out followed by a nice stroll. Linen, and thin shirts/shorts dresses for during the day. Its very hot. Comfy shoes are a must"}, {"username": "Daniela Raffio", "comment_text": "We've just been in Rome for 3 weeks. 3-4 dresses, 2 shorts, 1 skirt and 2 light summer trousers."}, {"username": "Rhona OConnor", "comment_text": "Make sure you can lift and carry your own bag.... Lots of steps and you must be able to lift your own bag onto trains. Lots of opportunities to wash clothes."}, {"username": "Angela O'Donnel", "comment_text": "You are going to shop also. I've been in Sicily for 2 weeks now and brought 3 tank tops, 3 dresses, one pair of light pants, 2 shorts and 2 skirts. Everything I can mix and match and I do laundry every few days."}, {"username": "Debbie Knowles", "comment_text": "We have just come back from a trip to Rome, Venice, Florence and 2 stops at Lake Garda. I rolled my clothes for the first time and put them in zip lock bags. I could live out of the suitcase, easily see what I had, dirties in their own zip lock and surprisingly few creases. I may have been slow to this party but boy it was a game changer. There were public lauderettes we saw in a couple of destinations if that helps"}, {"username": "Anna Fedele Di Luigi", "comment_text": "Pack light clothes !! Denim is too hot in my opinion. Shorts and tanks and light dresses is the way to go. Also pack electrolytes in this heat you will need them."}, {"username": "Maggie Williams Dryden", "comment_text": "It is so, so hot here right now. Your clothes each day will be completely drenched in sweat. Plan accordingly depending on how interested you are in having to wash things and hang them to dry.\n\nIf you go anywhere near the donkeys in Santorini- your clothes will pick up that smell and you won’t get rid of it.\n\nIf you’re doing dresses, consider shorts to prevent chafe.\n\nDon’t skip Santorini- it’s amazing!"}, {"username": "Leone Karzon", "comment_text": "20 dresses! Yikes. Definitely repack and take most of those out. I travel for 6-8 weeks and take a couple of shorts, one long pants, assorted t-shirts and tops and 3-4 dresses."}]}, {"id": "2198067523925659", "text": "Looking for recommendations and contact for a driver in Milan …TIA", "link": "facebook.com/groups/1373361046396315/permalink/2198067523925659/", "likes": 0, "comments": []}, {"id": "2198069047258840", "text": "We will be in Florence the first week of October for 3 days. I’m trying to decide whether to stay at Ricasoli Garden Relais or Grand Hotel Baglioni. They are both close to popular attractions. We won’t be spending much time in our room so, open to suggestions from others on which one to stay at.", "link": "facebook.com/groups/1373361046396315/permalink/2198069047258840/", "likes": 0, "comments": []}, {"id": "2198069963925415", "text": "Staying 3 days in Florence. All recomendación to go to Pisa and Amalfi.\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2198069963925415/", "likes": 18, "comments": [{"username": "Elyssa Gross", "comment_text": "I went to Pisa for a few hours but did it for personal reasons. My grandfather, when in the army, was there and took a picture in front of the Tower. When my mom went for the first time, she took one as well and had them put together for my grandfather. This May was my first time as well as my son’s, so I wanted to add to it. 4 generations"}, {"username": "Liz Miller-Boone", "comment_text": "Stay in Florence. It needs all 3 days"}, {"username": "Rachael Richardson", "comment_text": "Pisa on train for half a day or Lucca or both on one day - amalfi from there ? Way too far, stay in Florence /Tuscany much nicer !"}, {"username": "Em Marie", "comment_text": "We did this tour!\n\nIt was incredible!!!\n\nCheck this out from Viator, it looks amazing!\n\nHorseback ride, visit to S.Gimignano, tuscan lunch, wine tasting, Chianti winery\n⭐️⭐️⭐️⭐️⭐️ 5.0/5 (208 Reviews)\nFrom $285.77\nhttps://\nwww.viator.com/\nen-CA/search/\n70927P4?mcid=642\n43\n\nIf you don't have the Viator app already, download it\nhttps://\nmy-viator.onelin\nk.me/y0Xw/\nc4ddd6d9"}, {"username": "Peach Panfili", "comment_text": "Please check a map - On a good day Florence to Amalfi is almost 6 hours."}, {"username": "Nancy Jones Bruscino", "comment_text": "Pisa is nothing."}, {"username": "Kevin Andrews", "comment_text": "A day trip to Cinqueterra is a option or Lucca isn’t far from Florence."}, {"username": "Sandra Desmond", "comment_text": "I loved Pisa the security was unreal protecting the leaning tower of Pisa I had seen previous people were saying it’s dirty around there to be honest I didn’t see it I was so glad I did my kids loved it too"}, {"username": "Mary Lou Gillen", "comment_text": "Skip Pisa. It just one photo and nothing else. We did it and it was meh…\nLuckily we were with a tour group. Took a picture, walked around the area about 30 minutes, got back on the tour bus and went to our next destination. It’s really a big nothing."}, {"username": "Shane McClain", "comment_text": "Visit the duomo and get the sandwich. It’s amazing. We went for the day and it’s awesome. David statue but need skip the line tickets. A must"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "I wrote a post about Pisa if you check with the lens in the group, so you don’t get bummed by using your day “just seeing a leaning tower”…"}, {"username": "Rick Schneider", "comment_text": "Pass on Pisa , go to Sorrento"}, {"username": "Katherine AliNuñez", "comment_text": "Wow 🤩"}, {"username": "Jennifer Gustafson", "comment_text": "Amalfi is harder to get around and it take a day to get there via train/ferry. Stay in Florence do little day trips out an hour in Pisa will be plenty, train to Lucca so beautiful to explore and day trip to San Gimignano do a wine pairing and explore the town. Explore Florence in later afternoon Uffizi, shopping, the streets are lit and it’s beautiful at night."}, {"username": "Theresa Hayes", "comment_text": "I’m going next year and all my friends say Siena is their favourite place."}, {"username": "Elizabeth Buchanan Sinnes", "comment_text": "Florence is so full of things to see. We were there for a week and didn't see it all. We did do a day trip to Pisa on the train, but I would not do that again. It wasted a day we could have seen Academia museum in Florence."}, {"username": "Sarah Shepherd", "comment_text": "San Gimignano for sure!!!"}, {"username": "Margorie Madrid", "comment_text": "Didn’t like Almafi much with all the crowds in June but enjoyed Florence and Pisa 😍"}, {"username": "Sandra Zamora Guerrero", "comment_text": "You can spend the three days in Florence and not get to do or see all you want but if you really want to see other places, day trips, like everyone said, Luca, San Gimignano, Siena. You can do Pisa in the morning and be in Lucca in the afternoon. But Florence itself has so so much to see"}, {"username": "Marissa McLean", "comment_text": "The you can do pisa in a half day, amalfi is pretty far to do a day trip from Florence, we did it as a day trip from naples and just took the train there"}, {"username": "Yara Karime Vazquez", "comment_text": "Perlita Cabrera read comments"}, {"username": "Jenni Gardiner", "comment_text": "If you’ve only got 3 days in Florence then I’d spend them all in Florence\nThere are so many amazing things to do and see.\nIf you do do a side trip - San Gimignano or Sienna"}, {"username": "Lamberte Bertrand", "comment_text": "We loved Pisa, the unique view from the tower. We went inside the Tower, Baptistry, cathedral and graveyard."}, {"username": "Richard Turner", "comment_text": "Consider Cinque Terre vs amalfi."}, {"username": "Martha Heller", "comment_text": "Only 3 days? Stay In Firenze! So much to see and do!"}, {"username": "Shama Patel", "comment_text": "Following"}, {"username": "Gina Scavetta", "comment_text": "Viator has a half day tour of pisa with skip line tower and guided tour of the church . it was very good."}, {"username": "Sheryl Elizabeth", "comment_text": "If you’re going to visit Pisa, keep going and do Cinque Terre, as good as Amalfi, you won’t be sorry and so much less travelling from Florence than to Amalfi"}, {"username": "Diane Badalucco Mussorici", "comment_text": "Orvieto\nIs stunning! Also Lucca or\nSan Gimignano.\nSkip Pisa"}, {"username": "Elena Eckley", "comment_text": "Montecatini is a beautiful spa town west of Firenze"}, {"username": "Alice Francesca", "comment_text": "The only thing to see in Pisa is the area around the leaning tower.Not really pretty otherwise.Try Lucca instead."}, {"username": "Jason Hobel", "comment_text": "Skip Pisa and check out Lucca or San Gimignano or Siena or Amalfi or Sorrento. Pisa is a bit disappointing and so crowded too.."}, {"username": "Katherine AliNuñez", "comment_text": "Thanks!"}, {"username": "Ville Lignell", "comment_text": "Amalfi is nowhere near Tuscany. You need first to travel to Naples, then organise how to get to the peninsula. I warmly recommend to enjoy central Italy and leave Amalfi for another journey."}, {"username": "Nana Kutateladze", "comment_text": "Definitely skip Pisa. Stay in Florence, take early morning walk, before day trippers arrive."}, {"username": "Phyllis Snyder", "comment_text": "Pisa is closer- but I’d go to Lucca instead. Amalfi is fabulous but much further away- and to see it takes time as it isn’t easy to get around. You’re time is short."}, {"username": "John Licata", "comment_text": "Stay in Florence or Amalfi"}, {"username": "Laura DeCicco", "comment_text": "Amalfi coast for a day trip from Florence is not the greatest idea. It’s a 5 hour drive one way, by train it’s 4 hours and then another 1 1/2 hours by bus. Don’t skip Pisa, you can do Lucca and Pisa in the same day."}, {"username": "Laura DeCicco", "comment_text": "If you’re desperate for a day trip from Florence, also consider Fiesole, Siena or Bologna."}, {"username": "Ken Vecchia", "comment_text": "Don’t miss Pisa an awesome sight in person"}, {"username": "Russell Weidner", "comment_text": "Lamole!! Then Tenuta d Ricavo"}, {"username": "Angelina John", "comment_text": "Stay in Florence if you only have 3 days! Enjoy it!"}, {"username": "Nancy Kirby", "comment_text": "You cannot go to Amalfi from Florence as a day trip"}, {"username": "Nancy Kirby", "comment_text": "Three days in Florence would keep you busy btw"}]}, {"id": "2198072247258520", "text": "Any recommendations for an Italian cruise?? Have never been to Italy and thought it might be a great way to see more places…", "link": "facebook.com/groups/1373361046396315/permalink/2198072247258520/", "likes": 0, "comments": []}, {"id": "2198075907258154", "text": "Booked a Mediterranean cruise through Viking for the beginning of October. They have no Colosseum tours. We are only in Rome from 10:30 - 4:30 . Any recommendations on how I could do a tour of the Colosseum and still see the Spanish steps and Trevor Fountain. I know I don’t have time for the Sistine Chapel.", "link": "facebook.com/groups/1373361046396315/permalink/2198075907258154/", "likes": 1, "comments": [{"username": "Colleen Jennings", "comment_text": "Take a taxi to the the colossseum then another to the Spanish steps."}, {"username": "Miyuki Kanno Paul", "comment_text": "You mean your ship is departing at 4:30 pm from the port?"}, {"username": "Helen Ladkin", "comment_text": "If Viking are organising the transport and you only have a few hours, maybe a wander to the Spanish steps, the Trevi fountain and perhaps you could book a ticket for the Pantheon for mid day. Piazza Navona is close by and all walkable."}]}, {"id": "2198076707258074", "text": "Top vineyard tours with food in Tuscany?", "link": "facebook.com/groups/1373361046396315/permalink/2198076707258074/", "likes": 0, "comments": [{"username": "Marc Spiegel", "comment_text": "Antinori"}, {"username": "Colleen Carollo Oxsalida", "comment_text": "Tenuta Torciano"}]}, {"id": "2198078593924552", "text": "Talk to me about covering your shoulders entering churches. We are traveling in August. Is a pashmina to cover the shoulders enough? Can we wear shorts in the churches if we have our shoulders covered?", "link": "facebook.com/groups/1373361046396315/permalink/2198078593924552/", "likes": 0, "comments": [{"username": "Edoardo Casolo", "comment_text": "Yes it is and as long as the knees are covered"}, {"username": "Peter Seller", "comment_text": "knees and shoulders covered"}, {"username": "Jaclyn Aloise-Cotgreave", "comment_text": "Would it work to have a pashmina to wear around shoulders and shorts that at just at the knee? Going to be hot 🥵"}, {"username": "Eileen Steiniger", "comment_text": "Recommend a light scarf over pashmina due to heat. There were vendors of scarves outside every church."}, {"username": "Carol Potter", "comment_text": "Just follow the rules and enjoy because eventually you’ll be back in some air-conditionin\ng."}, {"username": "Eric Maurer", "comment_text": "Just got back and went to St. Marks, St. Peters, Sistine Chapel and numerous smaller churches. I saw people with shorts in all of them. Most of them will give you a cover for your shoulders if you need one. The Capuchin crypts were selling them for €1"}, {"username": "Vasthi Cheddar", "comment_text": "Some churches do not enforce it, but you should ALWAYS cover your shoulders and knees out of respect.\nMost major sites, including St. Peter's Basilica, Duomo in Florence, etc will enforce it and will even ask you to cover your back if it's exposed. I watched a young woman in front of us as she was handed a cover because she had a nice dress (shoulders and right length) but the back was open. Alas, they noticed as she went by and gave her the infamous blue cover."}, {"username": "Andrea Corey Andrews", "comment_text": "Knees and shoulders. Shoulders covered golden now cover knees simple and easy"}, {"username": "Felicia Melo", "comment_text": "At the Sistine chapel they loosely enforced shoulders being covered, but literally EVERYONE was wearing shorts. It was way too hot. In the smaller churches they didn’t even enforce the shoulders being covered tbh."}, {"username": "Cindy Sguazzin", "comment_text": "Pashmina- Yes, Shorts No."}, {"username": "Angel Leckner", "comment_text": "Vendors everywhere sell thin shawl like scarves for €10. Use for shoulders. Knees covered are a must and yes, they are turning folks away. Open midriff (front or back) was also being turned away.\n\nFor knees, wear linen capri pants or bring a pair and slide them on before entering a church."}, {"username": "Marissa McLean", "comment_text": "I always plan my outfit around the churches, usually I will also visit multiple churches in one day so I don’t have to be fully covered multiple days in my trip. On those days il wear a long dress and bring like a button up or scarf to cover my shoulders"}, {"username": "Sally Warren", "comment_text": "So easy to wear a linen shirt over a tank top. It protects from the sun too."}, {"username": "Dayna LaFond", "comment_text": "When I went the other week, men in shorter shorts were being allowed in, but women were not if the knees were showing. Wear shorts and take an elastic waistband skirt and put it over your shorts when you plan on visiting those places."}, {"username": "Janet Messanelli Bozzone", "comment_text": "Long shorts are usually OK and a pashmina is fine and even probably too much. A thin scarf is just as good. I used to take a lightweight gauzy shirt to cover knees, just in case."}]}, {"id": "2198078757257869", "text": "Maiori vs Priano to visit Amalfi coast cities with toddler. Public transportation, train station, walking with stroller", "link": "facebook.com/groups/1373361046396315/permalink/2198078757257869/", "likes": 1, "comments": []}, {"id": "2198079450591133", "text": "Hi all. I’m searching a nice place, not too expensive in Italy (BnB or appartement with own kitchen and bathroom) for me and my teenager boy, with a good location. Not to far driving from Brussel.\nCan anybody help me, please.\nTnx in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2198079450591133/", "likes": 0, "comments": [{"username": "Kristina Ruk", "comment_text": "Brussel in Belgium?? Not far? Are you aware that from Brussels till Italy is at least 14 hours drive ;)"}]}, {"id": "2198079840591094", "text": "We will be staying on the Amalfi coast in September.I’m looking for guidance from anyone who has driven the coastal road recently ( Positano-Amalfi). I would like to keep my rental car for the week but not if I will be stuck in traffic for hours. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2198079840591094/", "likes": 0, "comments": []}, {"id": "2198082973924114", "text": "What is the guidelines for tipping in Italy?", "link": "facebook.com/groups/1373361046396315/permalink/2198082973924114/", "likes": 29, "comments": [{"username": "Rasha Za", "comment_text": "No need to tip"}, {"username": "Meghan Tan", "comment_text": "I usually tip around 10% (and many Italians- especially the younger ones- leave about 10% as well) It’s not required. Working in the food industry is not easy and that little extra is always appreciated."}, {"username": "Pam L'abbate-Ameduri", "comment_text": "We always tip in Italy. Just a personal thing"}, {"username": "Frannie Kaplan", "comment_text": "Tipping is not required though it's appreciated a lot. Not Italy but when I last went on holiday to Portugal I tipped 10 eur to a waitress on an expensive meal and I round up on the taxi and other similar services. I do the same in a good restaurant or cocktail bar in Italy\nNow I have a good job but remember salaries in half of the EU are as low as 8, 900 maybe 1000 euros. Still too low for the cost of living so it really does make the difference if 2 or 3 people tip in a day"}, {"username": "Claudia Amp", "comment_text": "Not mandatory; it’s to your discretion. They”ll appreciate but no one is going to chase you down the street because you didn’t tip. If they ask or charge you with a tip, know that they are trying to rip you off. The extras are marked as “coperto” and “servizio”, often it’s just “coperto” which goes from 2 euro and up per person depending on the restaurant; some few restaurants, especially high end establishments,\ndo not charge “coperto”. Always check the menu for these charges."}, {"username": "Ray Kelley", "comment_text": "Thier is no tiping in italy just leave the change."}, {"username": "Billy Nash", "comment_text": "Always tip…..Always…….\nWe come every summer for 2 months and we’ve never left a meal without taking care of our server."}, {"username": "Rodger Cravens", "comment_text": "Same as it has been every other time this has been asked. Use the search function for research on the subject."}, {"username": "Mike Adams", "comment_text": "Generally not done.\nI tip taxis sometimes\nAnd hair cutters.\n\nCutting hair is personal and I have had some GREAT haircuts— lots of care lavished on me .\n\nWith tip still less than the US"}, {"username": "Susan Lelyveld", "comment_text": "We generally tipped while in Italy. Sometimes more than others if service was out of ordinary, but always left something"}, {"username": "Phil Marshall", "comment_text": "Don’t it’s already included in their ridiculous pricing."}, {"username": "J Pierce", "comment_text": "Not expected."}, {"username": "Stephanie Prater", "comment_text": "If you tipped on the actual service you would leave very little. I found it once you sat down you may not find anybody circling back to see what you need for at least 20 minutes and then expect another 20 minutes after that before you receive a cocktail and then God knows how long before you’re actually receiving a￼ meal. It’s a test of patience for sure, but food just usually divine.🙏"}, {"username": "Ottavia Mot", "comment_text": "No tipping required in Italy at the restaurants/\nbars. You can leave a tip however some places charge for coperta -white table linen and in some places prices for a meal are steep especially in big cities like Rome etc."}, {"username": "Elizabeth Afeltra", "comment_text": "No tipping at all."}, {"username": "Edwin N Anita Siregar", "comment_text": "Remember tipping is personal choice not a guideline .\nWhen life blesses you financially don’t raise your style of living . Raise your standard of giving."}, {"username": "Lee D'Angelis", "comment_text": "No need to tip"}, {"username": "Aries Mar", "comment_text": "No tipping policy in Italy. U can leave a tip if u want to but weird fact, when we went to Amalfi especially Positano, they were imposed and it was on the bill, indicating how much is the tip. The taxis in amlfi also, theyre expecting a tip."}, {"username": "Sheila Manganello Paul", "comment_text": "You don’t have to but, you can if you feel like it"}, {"username": "Cat Jofus", "comment_text": "It’s Italy, not USA"}, {"username": "Chuck Sims", "comment_text": "Dont"}, {"username": "Sal Priorello", "comment_text": "It’s your money. Tip if you feel they deserve a tip. I just spent 3 weeks traveling all over Italy. I tipped all servers, bar tenders, baristas & housekeeping. Each and every person expressed appreciation. I find it crazy when people post on here that the Italians are offended by tips. That’s absurd!"}, {"username": "Brad Nelsen", "comment_text": "No need."}, {"username": "Mel Peci", "comment_text": "Don't!!!! This it Italy not America!!"}, {"username": "Marianella Flynn-Morales", "comment_text": "I tipped because I think it shows appreciation. A couple of people told me not to as it’s offensive to some?? I’m the kind of woman who listens politely then I do what I want to do because it makes me happy 😂😂"}, {"username": "Katie Giffuni", "comment_text": "Not required but if you think the service was good you can"}, {"username": "Willie Ruiz", "comment_text": "You don't"}, {"username": "Jennifer Cook", "comment_text": "Kathy Zink Russell Sean Russell Laura Petsch Hawks"}, {"username": "Lauren Marie Harper", "comment_text": "Americans in Italy now 👋🏻! We typically round up the bill if we sit. For example, if the bill is €67, we will round to €70. I can confirm in our experience so far, it is appreciated. Not the same as tipping 20%, etc., in USA for sure. But more as a graceful thank you for the really great service."}, {"username": "Mandy Gee", "comment_text": "5 - 10%"}, {"username": "Sarai Johnson", "comment_text": "Don’t tip. Don’t turn it into America.\n\nThink of the long-term effects"}, {"username": "Chip Keyes", "comment_text": "Chip Keyes"}, {"username": "Diana Wilson", "comment_text": "I leave tip chamber maid.waiters\ntaxis"}, {"username": "John Flores", "comment_text": "Bill Williams - We were just in Italy last month for 2 weeks. Rome, Florence, Venice and Milan. Tipping is not required or expected, however we felt leaving a tip was the right thing to do, especially if the service was good. When paying by credit card you don’t have the option to leave a tip so we always gave them some euros as a tip and they were most appreciative of the gesture.\nSome places charge $2-$5 euros just for seating but the cost of the food and drinks were so inexpensive it wasn’t a big deal. I will say, Milan was the one place we found to be the most expensive for food and drinks.\nOur experience in the 4 cities we visited was amazing, customer service was far superior compared to what we are familiar with back home. We can’t wait to go back. Enjoy your trip!"}, {"username": "Mike Raio", "comment_text": "I think you have to do what you think is appropriate…."}, {"username": "Annie Nelhams", "comment_text": "Simple- it’s not required in Italy"}, {"username": "Jim Painter", "comment_text": "Please do NOT export American tipping culture to Europe...or elsewhere."}, {"username": "Jo Ann Perrotta Solimando", "comment_text": "We were told that no tip was needed. Included in food bills… we did tip our drivers just because well it’s a hard habit to break"}, {"username": "Sh Kaplan", "comment_text": "We had viper to and servizio in the last place we ate at in Rome. I was so angry because the owner then insisted I also leave a tip. What a jerk !!"}, {"username": "Luigia Gray", "comment_text": "Don't have to tip."}, {"username": "Pat Dreker Demeraski", "comment_text": "Tipping is not mandatory anywhere but it is appreciated everywhere including Italy."}, {"username": "Lisa Reitano", "comment_text": "Apparently you don’t"}, {"username": "Lisa Valdovinos", "comment_text": "We tipped everywhere."}, {"username": "Mercedes Rotolo", "comment_text": "No tipping - an American thing"}, {"username": "Anthony Parisotti", "comment_text": "No need, maybe €2 at the most"}, {"username": "Steve Savva", "comment_text": "Don’t do it"}, {"username": "Bill Elias", "comment_text": "Read any guide book. No tip is required when dining. You can leave spare coins if you want to get rid of them.\n\nAnd the cover charge is not a tip, so do not deduct it from the bill or anything.\n\nIt’s not that hard people."}, {"username": "Rebecca Branta", "comment_text": "We tipped a few Euro after nice dinners if we had great service or food, otherwise no. Isn't it refreshing to tip for SERVICE or FOOD and not because you have to!!! That is was tipping should be in the first place."}, {"username": "Eric Hvezda", "comment_text": "Don’t!"}, {"username": "Lisa Jagodzinski", "comment_text": "I too because I have friends that live there and are Italian. They say these waiters do not make very much. Unlike the French or Swiss who are paid a much better wage."}, {"username": "D Rochelle Milton", "comment_text": "Tipping in the US has become outlandish and outrageous! With that said, I’m planning my trip so when it comes to tipping I’m listening to natives from that land (Italy), not pseudo visitors turned Italian because they’ve visited a few times. You want to tip, then tip; you don’t want to, don’t and that’s ok but don’t try humbling/ shaming others that do on top of the different service charges. I don’t understand why it’s a debate. Like many here I travel the globe and I tip, whether it’s an established rule or not."}, {"username": "William Blanton", "comment_text": "Tip as much as you want, you’ll never go broke rewarding good service."}, {"username": "Andrew Mircovich", "comment_text": "You don’t have to tip it is not expected . However if you receive exceptional service a 10% tip is more than adequate"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "You don’t…. Unless you really like him or her … and the food in Italy is so ￼ expensive so if you include an extra 20 $30 for a tip it’s no big deal !!"}, {"username": "Rose Stolarek", "comment_text": "Not necessary."}, {"username": "Jeff Oster", "comment_text": "Chad Oster"}, {"username": "Sarah Bird", "comment_text": "Paul Bird"}, {"username": "Heidi Harris", "comment_text": "You should a registered refuse site. 😂"}, {"username": "Lisa Masotti", "comment_text": "No tipping! It’s already calculated in the ‘coperto’. Let’s not let the American culture of tipping infestate the world. American employers expect the customer to pay for wages in ‘tipping’. They are ‘cheap’"}, {"username": "Fiona Ineson", "comment_text": "Tips are included as others are saying. Be mindful of this as we have experienced in both France and the UK, when some servers know you’re American, they try to get additional tips from you."}, {"username": "Jono Roland", "comment_text": "Only if their service goes above and beyond! It’s not expected."}, {"username": "Alice Francesca", "comment_text": "I am Italian.Tipping\nis not mandatory but if you round up the amount at the restaurant or cafe'if you were happy , they will apprezzate it.\nMany Americans don't seem to understand that is normal to pay 2 or 3 Euros per person for the coperto (tablecloth and breakfast basket) .\nIt 's not tipping and it 's used in Spain and France too.You should expect this to be the rule and not complain about it."}, {"username": "Cindy Neilson", "comment_text": "Whatever your conscience tells you"}, {"username": "Sonia Scotto Lubrano", "comment_text": "It’s not customary to leave tip\nIt is in tourist towns as they’re trying to profit off the fact that in America tipping is standard practice.\n\nI’m in a non tourist town and we round up to tip.\n\nSo, if dinner was €51, we’d leave 55. If gelato was 3 euros. I’d leave a 20 or 50 cent coin.\n\nIf everyone went out to a fancy dinner and it was 450 euros I’d leave like 10 euros.\n\nBut you really don’t have to."}, {"username": "Kim Hosking", "comment_text": "Most of the comments below have some validity - it’s very variable what the expectation is as distinct from the rule BUT you can count on the closer you are to a touristy location the more you will pay and the greater expectation of a tip of some sort or a table charge etc"}, {"username": "Leila Myftija", "comment_text": "Not expected or mandatory, so tip as you please."}, {"username": "Rosi Wendt", "comment_text": "All included in the bill"}, {"username": "Morena Federici", "comment_text": "In Italia non è assolutamente obbligatoria la mancia. Se ve la chiedono protestate, rifiutatevi e dite che chiamerete la Guardia di Finanza. Ugualmente se vi aggiungono sul conto il costo del servizio, non esiste proprio.\nSi pagano solo cibo, bevande e il coperto (se previsto)."}, {"username": "Sue Guerrini", "comment_text": "I never tip, I’m Australian.\nUnless of course the service is exceptional."}, {"username": "Alison Mary", "comment_text": "Who doesn’t like money?? Always tip!"}, {"username": "Patrizia D'Arcangelo", "comment_text": "In Italy there is no obligation to tip but if the waiter has been good and kind, it is polite to leave him a tip.\nIn Italy we have the common saying: \"il resto mancia\" (It means something as \"I leave the rest to the waiter as tip\")\nSo, for example, if you go to a restaurant and they ask you for 57 euros, you leave 60 euros and you can Say \"il resto mancia\" (in this way the remaining 3 euros are a tip for the waiter).\nI hope I explained it well... it's hard for me to speak in English"}, {"username": "Jay Greco", "comment_text": "Servers are paid a normal wage so it is not needed -- but it is appreciated especially in touristy areas and I think a good idea to leave a tip. US is the only country that has an exception in the minimum wage laws for servers, which I think is a jim crow era remnant."}, {"username": "Tracy Glasgow", "comment_text": "Tracy Glasgow"}, {"username": "Lalita PosBa", "comment_text": "Customer service in Italy is very poor. And it look like they are in a bad mood most of the time. Lol!"}, {"username": "Anita Grzeszkiewicz", "comment_text": "It's do as you feel is right for you and the situation, there's now law that states it's mandatory... if you want to, then tip and if you don't want to, don't tip"}, {"username": "Sue Knapper O'Callaghan", "comment_text": "We found service/cover charges are added everywhere. Often you go to a counter to pay and they never give you the option to tip. I didn’t tip"}, {"username": "Jos Recine", "comment_text": "They should be tipped at least 10%. Most of these waiters get minimum wage, do a good job and work their butts off then in the end don’t get a penny. They deserve better.., but in the end to answer your question it’s not mandatory to tip in Italy"}, {"username": "Giada Todaro", "comment_text": "Italian here ✌️ of course no mandatory, but I can assure you that tips are always welcome. Reading some comments it seems that give a tip look like an offense, but I can guarantee it's more than appreciated"}, {"username": "Charlene Noll", "comment_text": "Not required. I left a couple Euros when the waiter was very helpful w translation and description of the menu items I was challenged by"}, {"username": "Art Doss", "comment_text": "No need"}, {"username": "Robin Barbera", "comment_text": "You don't have to tip, they get a regular salary but if you want to tip do not leave it on the table.. Hand it to the waiter. The table charge reparto is for the table and not the service."}, {"username": "Amalia Cristina", "comment_text": "No tipping!!!"}, {"username": "Zeeshan Asghar", "comment_text": "Don't tip.\nSome people take offence here.\nIt's not America, people are paid a livable wage here."}, {"username": "Paul Vincent", "comment_text": "Rule #1 - don't...\nRule #2 - follow Rule number 1..\n\nPs, a few loose coins or rounding up is OK...but do not feel obliged..."}, {"username": "Mel Peci", "comment_text": "Don't, it's Italy, not America. Don't Americanise everything!"}, {"username": "Karen Van Den Bosch", "comment_text": "Frank Van Den Bosch"}, {"username": "Francesca Malte", "comment_text": "No tip just round up! I wish the states was this way! Ridiculous what we pay just to go get a haircut!"}, {"username": "Ian Beyer", "comment_text": "Not required."}, {"username": "Izzie MacDonald", "comment_text": "No tipping"}, {"username": "Bonnie Loftspring", "comment_text": "Yes, there is a Coperto, expect it, it is a service charge, for bread & their service, but that is Not a tip, leave a tip, depending on “tier” of eatery, I left 5-10%, because I am a generous person & I appreciate their service. Summer tourists are very important to their personal economy."}, {"username": "Joe Guzzi", "comment_text": "There is none."}, {"username": "Ilaria Verda", "comment_text": "Tips are Not mandatory. In a restaurant if you have a very good service leave a little tips"}, {"username": "Dimity Betar", "comment_text": "No guidelines, I never tip in Italy"}, {"username": "Kristina Ruk", "comment_text": "No tipping ussually but lots of places in touristic area include service fee. It was like 4eur/ person in Venice, Verona and less in Garda region"}, {"username": "Daniele Morani", "comment_text": "Rule number 1: don't."}, {"username": "Alejandro Gabriel Valenzuela Anghileri", "comment_text": "No tipping"}, {"username": "Todd N Nicole Clarke", "comment_text": "We had one place tell us when they brought the bill that the tip wasn’t included and that we needed to leave a cash tip, food and service was average so no tip"}, {"username": "Cecilia Christine Costantini", "comment_text": "No obligatory tipping, but we (Italians) always leave a few coins to round up the bill, e g. If your bill is 63 euros, you might round up to 65. If you get coffee and the barista is nice and quick, you might drop 10-20 cents in the tip jar. If there is no tip jar, my dad leaves those cents directly on the bar, next to the empty coffee cup (we don't sit to have coffee, we stand)."}, {"username": "Rana Umair", "comment_text": "Tipping is not mandatory but I tip if I get great service regardless of where I am. 5 to 10 euros will make their day. Always give cash in their hands or the house will keep the tips in some places."}, {"username": "Douglas Martin", "comment_text": "The wait staff are paid a salary hence don’t work for tips but there is a $4 service charge but you get bowl of nice fresh bread if you want to give tip for great service go ahead"}, {"username": "Cecilia Christine Costantini", "comment_text": "If service is impressive and quick and the food was amazing, you might tip a little more (compared to simply rounding up, e.g, 62 euro bill 》 you pay 65 euro if you feel like it . Still, not obligatory. Do not leave 1, 2, 5 cents coins."}, {"username": "Kai Wilhelm Tell", "comment_text": "In Europe 10 % are normal. It is a question of style, not of the country."}, {"username": "Tero Niemi", "comment_text": "When you go into restaurant, please be prepared that they will charge you extra for the table and maybe service as well. So you have lost 10-15e before even ordering anything.. 😅 we went to pizzeria and bought 5 x8e pizzas. And couple of waters. Bill was like 65e. 10e table, 5e service, automatically added to the bill. I left no tip."}]}, {"id": "2198083657257379", "text": "When in Florence, do not use Italy-Museum to buy tours, we got scammed by the company, despite spending 89 euros 6 weeks ahead to ensure we would see everything, they only showed us the cathedral, museum and Bell tower. Reasoning for not climbing the Dome or going into crypt was that the tickets were sold out! Complained to head office and wasआणखी told the tour guide bought the wrong tickets! Refunded 10 euros...what a joke. I asked for a full refund as tour was not what was advertised or supplied and have got a wall of silence. There was another couple of tour who were Spanish and they not only got ripped off too but the tour guide could hardly speak Spanish. So avoid Italy-Museum at all costs. Lesson learned. Dont bother with guided tours!", "link": "facebook.com/groups/1373361046396315/permalink/2198083657257379/", "likes": 0, "comments": []}, {"id": "2198087483923663", "text": "Hello, going to Italy end of October into November, Venice 3 days, Florence/Tuscany 5 days and Rome for 5 days. Looking for good places to stay that don’t break the bank. Appreciate any tips, Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2198087483923663/", "likes": 0, "comments": []}, {"id": "2198091657256579", "text": "Looking for suggestions for best bus options to get a family of 4 from Naples Centrale train station to Sorrento. We thought this might be the best option vs. the small train or ferry, as we are traveling with 2 seniors. ￼Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2198091657256579/", "likes": 1, "comments": [{"username": "Alice Francesca", "comment_text": "Are you going now? Ferry still the best option as it is peak tourist season. It will be almost impossible to drive on the Amalfi Coast"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Hire a car service for the most comfortable and stress free transport from Naples to Sorrento, door to door directly to your hotel., baggage handled, etc. well worth the cost."}, {"username": "Roland Trego", "comment_text": "Getting to Sorrento from Naples:\nhttps://\nwww.sorrentovibe\ns.com/\ngetting-from-nap\nles-to-sorrento\n-best-route-202\n3/"}]}, {"id": "2198089643923447", "text": "Taormina Sicily looking for lodging for a couple need great ac, walk to restaurants. Budget friendly do not need frills. Suggestions?", "link": "facebook.com/groups/1373361046396315/permalink/2198089643923447/", "likes": 0, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2198088660590212", "text": "A group of about 8+ want to go to wonderful 🇮🇹 Italy. I know you all talk a lot about planning yourself but most would like a company in charge to arrange and be there with us. We want to be there at least 10 days. Any suggestions to a company to guide us?", "link": "facebook.com/groups/1373361046396315/permalink/2198088660590212/", "likes": 0, "comments": [{"username": "Pk Yeung", "comment_text": "We used Travellocal.com for our recent trip to Croatia. They are a platform to arrange local agents to organize and arrange your trip. We were quite happy with their Croatia agent. Take a look at their website and decide."}]}, {"id": "2198087983923613", "text": "Should you book a tour on viator or wait until you get tomyour hotel concerige?", "link": "facebook.com/groups/1373361046396315/permalink/2198087983923613/", "likes": 1, "comments": [{"username": "Bill Shafer", "comment_text": "Never book a tour on via tour, always book through a local company."}, {"username": "Jennifer Smith", "comment_text": "Following"}]}, {"id": "2198090657256679", "text": "👋 I’ll be flying into Rome, getting a rental and driving to Assisi. I have my drivers permit. Any other suggestions? Tollbooth? will I need euros or do the rentals come with a scan device on the vehicle?", "link": "facebook.com/groups/1373361046396315/permalink/2198090657256679/", "likes": 5, "comments": [{"username": "Rita Levi Montalbano", "comment_text": "I dont think the rentals give you the so called \"Telepass\" unless u ask and pay for that. However, you can pay by cash or even with the credit card (via contactless) so i dont think you really need that"}, {"username": "Matthew Kennedy", "comment_text": "You can pay cash or card, if you google Italian tolls it explains what to do and what lane to use. Always make sure you get a card on entry."}, {"username": "Bassam N Ziadat", "comment_text": "when going in tolls you pick the card, when out of tolls you scan the card, you can pay either cash or by card,toll between Florence to Rome 17.5 euro, small disctances aroud 5 euro"}, {"username": "Loretta Spahmer", "comment_text": "Watch the signs above the booths and make sure you don’t enter the telepass only lane(s). On exit You’re looking for a picture of bills and coins or credit cards."}, {"username": "Monica Colontonio Macho", "comment_text": "We made sure that we had plenty of change for the toll, it made life so much easier. I didn’t ask of there was a toll scanner. I drove through Rome up to Orvieto and Florence and the country side. For the most part I stayed in the right lane in case I was too slow for anyone in the left lane. Watch the signs, you can go to Pinterest and search “road signs in Italy” that helped me a lot. Do the speed limit. Lol (you will be going way slower than everyone else) but it beats getting a ticket a few months later on your credit card. I loved driving in Italy"}, {"username": "Jazmin Avila", "comment_text": "Get a ticket on entry of the toll but you can pay card or cash. Our rental did not come with a scannable tag, I don’t think many rentals do."}, {"username": "Carmela Noble", "comment_text": "Cash at toll booths. Don’t lose the ticket you get when you get on. It can be a hefty price once you get off if you’ve lost it"}, {"username": "Jose Velez", "comment_text": "You pay with credit card or cash. Read the signs since on my way to lake como I found a toll payment by internet (I can read italian due to my Spanish and 40 years of traveling to Italy). I always keep a photo of my rental (before and after) for any claims. So I entered my plates on the website and had 2 pending charges on my travel dates so I paid them. Watch were you go in cities or you will collect a few tickets since some cities the traffic is limited to local and hotels guest. I have never got speeding tickets in the autostrada but in cities the speed traps are working"}, {"username": "Yvonne Donnellan", "comment_text": "Buy a Telepass in advance. Makes life much easier."}, {"username": "Micheal Gunner", "comment_text": "You can pay by credit card depending on your card I found that a international credit card that I obtained from the bank did not work and when I read the fine print on the PDS it said exactly that it would not work on some toll booths. It was easier to pay in cash or buy a Telepass in advance"}, {"username": "Shawn Kopp", "comment_text": "Get plenty of change …and relax our first time we were so nervous…lol .it was for nothing.it’s easy .have fun i love driving in Italy .Assisi as a matter of fact .it’s beautiful enjoy"}, {"username": "Letisha Withrow", "comment_text": "We drove around a bit and toll charges ranged from 1.25- over 40 euros"}, {"username": "Janet Walls", "comment_text": "I would always buy the additional collision damage waiver insurance, for peace of mind."}, {"username": "Danny Zare", "comment_text": "I am currently driving around Italy now. Things I have learnt:\n\n1. Always go to the Buglietto lane (cash/card) and not the Telepass lane. Looking for a lane with a white billboard with pictures of cards and coins only. Not the yellow board. Did this mistake on the 2nd day and ended up at the other end without a ticket and a €70 fine.\n2. Some tolls are just paying when you go through without a ticket but majority you get a ticket at the point of entry and insert it at the exit point and pay\n3. Tolls are bloody expensive here. Example, did the 9 hour drive from Venice to Polignano A Mare and paid >€70 in tolls lol. So have a CC handy."}, {"username": "Graham Sherlock", "comment_text": "Take a train driving is nothing but hassles, costs, fines etc etc for 12.70 euro you can be there in two hours and not a worry in the world."}, {"username": "Laura Uribe", "comment_text": "When you get a ticket upon entering a toll road or highway, be sure to present it when departing the road to the toll booth operator. Otherwise they charge you the cheapest amount and send you a fine plus the bill for what you should have paid."}, {"username": "Robin Barbera", "comment_text": "If you haven't driven before in Italy..... DONT. If you must always stay on the outskirts of the towns you are going to because you will never be the same."}, {"username": "Marilee Racobaldo Petruno", "comment_text": "Do not drive in Rome!!"}, {"username": "Tammy Lynn Schmitt", "comment_text": "How long did it take you to get your permit? I filled my note and send it by mail a couple weeks ago and still haven’t seen or heard anything."}, {"username": "Allieca Paterson", "comment_text": "Very important to save you coming home to find you have fines! If you don’t know about ZTL’s do a google search on “ZTL zones in Italy”\nHave a great trip 😊"}, {"username": "Brian Johnson", "comment_text": "Watch out for those narrow one way streets randomly ending without warning in Assisi, putting one’s rental car backing skills to the test"}, {"username": "Jaime Cleek", "comment_text": "There is an easy train to Assisi too"}, {"username": "Jonathan Nickens", "comment_text": "You will still need to bring your US state drivers license, in addition to your passport. The IDP is not necessarily a substitute for your actual drivers license."}, {"username": "Kimberly Becker Mast", "comment_text": "I drove Rome to Orvieto, then to Assisi the next day on the toll roads and they all took cards. Just stay on the A1"}, {"username": "Carrie Thompson", "comment_text": "David Thompson"}, {"username": "Lieke Hertecant", "comment_text": "Rental car don’t have scan device for automatic drive thru. Take the lane for cash and card . We are in Pisa area with car from sunny cars and pay at the tollbooth with visa card. Just scan the toll ticket( billejeto ) and hold your visa card at the wireless pay button untill you get arrivedecci . 👍🏻\nFyi: from pisa to Lucca (one way- €6)\nVisa is in Europe the most common credit card!"}, {"username": "Sherrie Hamner Williams", "comment_text": "We just drove from Assisi to Rome about a month ago. I can’t remember all of the details on the toll booths, but we had no issues at all. Keep a decent supply of euros with you, follow the signs, and you will be just fine! ￼Enjoy your trip!!"}, {"username": "Jen Ashley", "comment_text": "definitely don’t come with a telepass. The tolls do take card though. You have to be in the right lane for the card.\n\nThis website gives great tips. I found the highways very easy. I do NOT recommend city driving- get the car and get out of town. Otherwise you risk fines entering the ZTLs and the roads are not well marked in cities.\n\nhttps://\nmominitaly.com/\ndriving-in-italy\n/"}]}, {"id": "2198094750589603", "text": "Overlooking Bay off Naples...Mount Vesuvius... our accommodation... 💜", "link": "facebook.com/groups/1373361046396315/permalink/2198094750589603/", "likes": 1, "comments": [{"username": "Annita de Palma", "comment_text": "Absolutely stunning!💕"}]}, {"id": "2198095587256186", "text": "Saw this town months ago online ( bucket list one for me ) tick... 💜Alberobello is a town in Italy's Apulia region. It's known\nfor its trulli, whitewashed stone huts with conical roofs💜", "link": "facebook.com/groups/1373361046396315/permalink/2198095587256186/", "likes": 0, "comments": []}, {"id": "2198096590589419", "text": "Hey guys: looking for Hotel recommendations\nin Rome for 2 nights, two beds for mother and daughter, any suggestions ?", "link": "facebook.com/groups/1373361046396315/permalink/2198096590589419/", "likes": 0, "comments": [{"username": "Tiffany Hadfield Merrill", "comment_text": "My daughter & I stayed at hotel Triviho last week… felt safe & in a good location 👍🏻"}]}, {"id": "2198098290589249", "text": "Is there enrail global pass route from Florence to London ?", "link": "facebook.com/groups/1373361046396315/permalink/2198098290589249/", "likes": 0, "comments": []}, {"id": "2198099637255781", "text": "We have a family of 5 and are looking for lodging for next summer in Venice, Lake Como, Cinque Terra. We will not have a car so we want somewhere close to towns/restaurants. Any recommendations for either hotels that can accommodate 5 or AirbN rentals you loved?", "link": "facebook.com/groups/1373361046396315/permalink/2198099637255781/", "likes": 0, "comments": []}, {"id": "2198105687255176", "text": "Returned to the states yesterday. I've gone a whole day now without gelato. My body is doing weird things.", "link": "facebook.com/groups/1373361046396315/permalink/2198105687255176/", "likes": 178, "comments": [{"username": "Elyssa Gross", "comment_text": "I went through pizza, gelato and spritz with drawl when I got back in May😂😂😂"}, {"username": "Nhora Andrea Holmes", "comment_text": "Jennifer O'Neill Patterson this post is us!!!"}, {"username": "Jazz Caldwell", "comment_text": "Absolutely! While in Italy I ate gelato every single day. And that is always my first advice to people traveling there."}, {"username": "Alison Dutton", "comment_text": "First day back home went and bought Aperol and prosecco to make the spritzer."}, {"username": "Nana Esther Bertolino", "comment_text": "Gelato withdrawal !!!!!!!!!!"}, {"username": "Joe Ducey", "comment_text": "“Gelato tutti i giorni!” was our motto last year on our trip."}, {"username": "Dana Golden", "comment_text": "Same here. I’m going thru withdrawal."}, {"username": "Bryan-Leisa Arnold Wesley", "comment_text": "Casey Robertson, this sounds like you and Bryan. Lol"}, {"username": "Sandra Maldonado", "comment_text": "That’s nothing! Wait until you get withdrawals from Italy itself. You’ll realize there’s just one fix: to book the next trip back."}, {"username": "Mary Fornataro", "comment_text": "You have pvsd. Post vacation stress disorder. Get some rest and drink plenty of fluids."}, {"username": "Lyn Pappas Dahm", "comment_text": "I have always said that someone needs to create a genuine gelato company, they would make millions!! I have yet to have food gelato in the US. Everything else we can get."}, {"username": "Brian Bovero", "comment_text": "I had gelato withdrawals for about a week after coming home. Became part of my daily routine in Italy as there was a shop on every block."}, {"username": "Mike Makofske", "comment_text": "I still can't understand why we can't make gelato in the US that matches what you get in Italy. But you just can't get it here."}, {"username": "Sandi Van", "comment_text": "Sandi Van"}, {"username": "Melissa Klarberg", "comment_text": "Girl I feel you"}, {"username": "Kristine McIntyre", "comment_text": "Noooooo, we need the gelato!"}, {"username": "Ewa Olbrych-Rudzinska", "comment_text": "wea re still recovering after a month spent in Italy. coming back is harder then i thought"}, {"username": "Kayla Blanchard Garritt", "comment_text": "Rickie Garritt\nShellie Guidry\nBrooke Guidry"}, {"username": "Laurel Riola", "comment_text": "I hear ya!"}, {"username": "Helen Salazar", "comment_text": "I know!"}, {"username": "Helen Salazar", "comment_text": "Gloria J. Fernandez Lydia Yount Alexia Fernandez Spivey Carson Spivey..\nNEXT YEAR?"}, {"username": "Nicole Ortiz", "comment_text": "Nicole Ortiz"}, {"username": "Luanne Carey", "comment_text": "100%! Hahahaha!"}, {"username": "Lisa Gaimaro Sullivan", "comment_text": "I hated the first day I went back to work after coming home. I walked in and was immediately hit with work questions... the nerve. Lol. I could not get my mind out of the clouds. I definitely felt that I should be eating a croissant and drinking a cappuccino somewhere instead."}, {"username": "Rachel Adam", "comment_text": "Yep ! Italy changes you 🥰☕🍨"}, {"username": "Andrew Hsu", "comment_text": "Make you’re own at home!!!! 💚🤍❤️"}, {"username": "Karen Ries", "comment_text": "It is the taste of my coffee that suxs after a month in Italy. Man, they make great coffee."}, {"username": "Johanne Montpetit", "comment_text": "Love it!"}, {"username": "Karen Pelfresne", "comment_text": "I understand 👍"}, {"username": "Annette Giovia", "comment_text": "Yeah, it's withdrawl symptoms. Went thru the same thing. My aches and pains are back. No more feeling 100% like when I was there."}, {"username": "Sara Lynn Paris Catalano", "comment_text": "Nothing compares to 🇮🇹"}, {"username": "Cardythe Riggs", "comment_text": "I know the feeling!"}, {"username": "Christine Y. Van Aken", "comment_text": "I know the feeling!"}, {"username": "Krystal Apolinaro", "comment_text": "I don’t know how to act without a cappuccino, sliced fruit, and a croissant for breakfast ￼"}, {"username": "Todd Smith", "comment_text": "I get it."}, {"username": "Mary O'Sullivan", "comment_text": "The Italy/gelato withdrawal is a real thing - beware future travelers 😉"}, {"username": "DeAnna Pulliam Like", "comment_text": "Truth! 😆"}, {"username": "Brian Marcus", "comment_text": "Oh man there's no question!!"}, {"username": "Tammy Carpentier", "comment_text": "Meghan Navarro"}, {"username": "Jim Kelleher", "comment_text": "When you go to a so-called Italian restaurant back here in the US, be prepared to be disappointed."}, {"username": "Denise Lanini-Re", "comment_text": "Trader Joe’s has some"}, {"username": "Shawn Galbraith", "comment_text": "This is real🤣"}, {"username": "Nancy Jane Oster Burleigh", "comment_text": "Nancy Jane Oster Burleigh"}, {"username": "Kim Accardo Dunn", "comment_text": "Can't wait to indulge! I have 10 months to lose weight before we go !"}, {"username": "Sue Pruitt Murasky", "comment_text": "My worst fear🤣🤣🤣 tooo funny!"}, {"username": "Jan Fargo", "comment_text": "That is the thing we really missed. Some days we had 2, all flavors were delicious. Nothing quite like it here."}, {"username": "Maggie Gpe Banuelos", "comment_text": "Yep 💯"}, {"username": "Ginger Bandy Davies", "comment_text": "April Thomas Carpenter totally you"}, {"username": "Crystal Waltz", "comment_text": "I returned two days ago. I can't sleep past 5:30 am. Making my coffee stronger than normal. Ate an olive for breakfast. Serious craving for an aperol spritz."}, {"username": "Sian Hull", "comment_text": "Aldi in the UK and costco sell it so might be worth trying them places"}, {"username": "Kelly Ann", "comment_text": "Gelato 🍧 withdrawal is real!!! 😂\nI’d give anything to be in Tuscany with fresh gelato 🤤"}, {"username": "Ruth Akutu Maccarthy", "comment_text": "Ruth Akutu Maccarthy"}, {"username": "Maria LaPietra Guerrero", "comment_text": "I totally am missing gelato. It’s been 4 weeks today and I’m still in withdrawal from daily gelato 😭"}, {"username": "Joe Laricchia", "comment_text": "It will continue doing weird things until you go back 👌🏼"}, {"username": "Greg Kopp", "comment_text": "Coffee/wine/\ngelato withdrawal is hell."}, {"username": "Kirsten Abrams", "comment_text": "I’m calling it — get-together next summer — brunch at my air b ‘’n b on via Bufalini on July 8 (my 55th birthday)!"}, {"username": "Karen Espinoza", "comment_text": "Lol"}, {"username": "Juno Lee", "comment_text": "We just gone to Salt and Straw yesterday, I almost spat out the ice cream. I'm spoiled by the gelato from our trip in italy last month."}, {"username": "Vicki Susie Naab Gandolf", "comment_text": "I miss my croissant for breakfast and, of course, the 3 servings a day of gelato!"}, {"username": "April Thomas Carpenter", "comment_text": "Ginger Bandy Davies definitely 🤣"}, {"username": "Trace Barron", "comment_text": "Thoughts and prayers 🙏🤣🤣🤣🤣"}, {"username": "Kirsten Abrams", "comment_text": "I, too, am praying for you. And myself as I will be returning home next week and might just leave my body here. 🙄"}, {"username": "Lee D'Angelis", "comment_text": "Same for me without a amarena cornetti"}, {"username": "Hollie Barcheck Juersivich", "comment_text": "I feel like that is how I’ll be with the Spritz’s!!"}, {"username": "Monica Colontonio Macho", "comment_text": "That is the truth, when I came home it was the coffee I had withdrawal from. Forget Starbucks, give me Italy any day!"}, {"username": "Dr-Jon Warnecke", "comment_text": "And let me guess...you have to return to work also!!!"}, {"username": "Joe Guzzi", "comment_text": "In the US gelati are known as popsicles and ice cream."}, {"username": "Bonnie Loftspring", "comment_text": "I’ve yet to even find a decent gelato in the states."}, {"username": "Sabra Licopoli Rivel", "comment_text": "Just thinking about it does that to me!"}, {"username": "Jo Lacina", "comment_text": "Same here😂 upon returning home I went on a search for gelato , Aperol and I had to buy a cappuccino maker 🤦🏼‍♀️ Withdrawals for sure . Can’t wait to go back ❤️"}]}, {"id": "2198108767254868", "text": "Going to italy next year, Bologna for two months, then Umbria. Need some inside info as lonely planet guides dont have much on hidden gems", "link": "facebook.com/groups/1373361046396315/permalink/2198108767254868/", "likes": 1, "comments": [{"username": "Alice Francesca", "comment_text": "You will fall in love with Umbria! Try Assisi, Spello, Spoleto, Orvieto."}, {"username": "Jim Kelleher", "comment_text": "Piacenza is about an hour’s train ride from Bologna. It’s the very definition of a hidden gem."}, {"username": "Alexandra Kassianos Matthews", "comment_text": "Following! I’m going to Umbria in October too!!!"}, {"username": "Scott Perry", "comment_text": "Guero for cocktails in Bologna."}, {"username": "Manuela Bonazzi", "comment_text": "Se stai a Bologna per così tanto tempo fai un salto a Ferrara anche solo per un giorno..merita davvero."}, {"username": "Diane Schillace", "comment_text": "Not sure about Bologna but Parma is an hour by train. They have a great parmesean making/\nprosciutto tour. (Think we used viator). Then onto Moderna for the balsamic vinegar tour!"}, {"username": "Rhona OConnor", "comment_text": "I didn't 'get' Bologna, found the south around Bari much nicer..... But I might have been a bit unlucky and not found the gems."}, {"username": "Kate Farrell", "comment_text": "I found nothing interesting about Bologna, a typical university City… would skip it and Pisa is my advice to anyone going to Italy.."}]}, {"id": "2198119010587177", "text": "Can anyone recommend a skip the line Vatican tour that only does St Peter’s Basilica, including the Dome and St Peter’s Tomb? (Apparently only a certain number of tickets for the tomb each day?) I think I saw a 7.30am tour but cannot find it now. It would be for a Saturday in September.\nWe will have our children with us so not wanting a long tour as they may get bored quickly 🙈.\nOr do you suggest just getting there really early?\nWhat time do you think that line starts adding up??\nThank you in advance 🙏🏼", "link": "facebook.com/groups/1373361046396315/permalink/2198119010587177/", "likes": 0, "comments": []}, {"id": "2198119083920503", "text": "Travelling on a last minute trip to Cinque Terre and Florence this week. Looking to get a small tattoo to remember the trip. Anyone have any recommendations for good places to get fineline tattoos, ideally in Florence and that takes walk ins/late bookings! Thank you 😁☺️", "link": "facebook.com/groups/1373361046396315/permalink/2198119083920503/", "likes": 0, "comments": []}, {"id": "2198119200587158", "text": "Suggestions needed. We’re thinking of traveling to Italy in late December and into early January for 2 weeks. We’re thinking Rome for a couple days (been before), Amalfi/Positano for a few days, maybe Capri (been before) then Sicily (never been). Probably Palermo? We’d love suggestions on where to go, what to do. We’d have a car. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2198119200587158/", "likes": 0, "comments": [{"username": "Jenny Payne", "comment_text": "Think Amalfi/\nPositano not much will be happening, I would go to Palermo in Sicily, great town & do your research and see what is open over that period 🌻"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Best to stay in the cities in the winter, not much happening on the Amalfi Coast and the islands."}, {"username": "John Sampson", "comment_text": "Lots of lovely unknown places and villages in basilicata and calabria on way to sicily.very scenic.very family friendly and beautiful.might\nbe good..I lovr it"}, {"username": "Bud Robinson", "comment_text": "I love Venice in the winter. Beautifully quiet."}]}, {"id": "2198120173920394", "text": "Hello, my flight is landing in Milan Bergamo airport with a late night arrival, which's the best option to stay in for that night : Milan, Bergame or any other suggestions are welcome.\nCan anyone recommend appartements or hotels in Bergamo as well as Milan ? We are a family !\nThanks a lot !", "link": "facebook.com/groups/1373361046396315/permalink/2198120173920394/", "likes": 0, "comments": [{"username": "Pietro Adami", "comment_text": "Are you moving around by train / public transport after landing, or planning to rent a car and drive?"}]}, {"id": "2198126423919769", "text": "FIRST TIME TO ITALY! If you could book one restaurant reservation in each city, what would it be? Milan, Venice, Florence, Sorrento, Rome❤️❤️❤️❤️❤️", "link": "facebook.com/groups/1373361046396315/permalink/2198126423919769/", "likes": 0, "comments": []}, {"id": "2198122033920208", "text": "Any restaurant recommendations in Abano Terme or surrounding areas? We are spending 4 nights at one of the spas in the middle of our month long trip for a few days of relaxation.", "link": "facebook.com/groups/1373361046396315/permalink/2198122033920208/", "likes": 0, "comments": []}, {"id": "2198126827253062", "text": "Hi, aside from discover cars, are there other reliable rental car agencies please? TIA", "link": "facebook.com/groups/1373361046396315/permalink/2198126827253062/", "likes": 0, "comments": [{"username": "Sandra Shoffner", "comment_text": "Yes, research a lot of big agencies."}, {"username": "Greg Saba", "comment_text": "We always use AutoEurope (based in US) or their partner Kemwel . They are a highly regarded broker, so you can compare prices with various agencies. One advantage is that they often provide a full insurance option for less than the price of the surprise amount and hard sell at the desk. Makes bookings easy and hassle free."}, {"username": "Carrie Choi", "comment_text": "I always use Rentalcars.com which is reliable and easy."}]}, {"id": "2198127390586339", "text": "Is April/May better or September/October? Hoping to do Rome, Florence and Sorrento.", "link": "facebook.com/groups/1373361046396315/permalink/2198127390586339/", "likes": 0, "comments": []}, {"id": "2198133027252442", "text": "We will be traveling through the Tuscan region in September - can anyone suggest a nice winery tour with lunch?\nWe will be staying in Rapolano Terme (near Siena) and Parma.\nThanks!", "link": "facebook.com/groups/1373361046396315/permalink/2198133027252442/", "likes": 0, "comments": []}, {"id": "2198130950585983", "text": "Looking at tours to Italy. We are between Trafalgar and Perillo. Looking for feedback from others who have been on either tour. Want to know all the positive and the negative from your personal experience to help us make our decision.", "link": "facebook.com/groups/1373361046396315/permalink/2198130950585983/", "likes": 0, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2198141537251591", "text": "Probably a stupid question but is 1 hr 45 mins layover USA to London Heathrow enough time to clear customs before catching connecting to Naples?", "link": "facebook.com/groups/1373361046396315/permalink/2198141537251591/", "likes": 0, "comments": [{"username": "Rosemary McClenaghan", "comment_text": "Maybe"}, {"username": "Fatima Larios", "comment_text": "London airport is massive."}, {"username": "Julie Dillon", "comment_text": "Depends on which terminals you arrive and depart from. If the ticket is booked as one trip & same airline then if you miss the connection the airline should re-book you on the next flight. Call AA before you depart and ask their policy"}, {"username": "Meg Gajda", "comment_text": "No"}, {"username": "Shelley Howard", "comment_text": "I would say no .. I think anything under 2 hrs is risky..."}, {"username": "Karen Mason", "comment_text": "If your flying the same airline maybe enough time as you will come in and depart from the same terminal. If your luggage goes to your final destination you don’t have to clear customs it’s only if you collect your bags and have to check them in again at Heathrow that you’ll go through customs. If you go to another terminal you will need to clear security again. Which would be tight"}, {"username": "Dinh Nguyen", "comment_text": "Why do you need custom clearance if you just transit at Heathrow Airport?\n\nYou need only move from the arrival terminal to departure gate, no need any custom clearance"}, {"username": "Chris Hyatt", "comment_text": "No"}, {"username": "Darrell Kimbrough", "comment_text": "Nope!"}]}, {"id": "2198141583918253", "text": "Does anyone have a recommended itinerary for one day trip to Ischia.\nWe plan to be on the first ferry out of Sorrento and return on the last ferry. We are thinking of visiting some gardens, a castle, and thermal baths and/or beach. Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2198141583918253/", "likes": 0, "comments": []}, {"id": "2198145113917900", "text": "I am looking for the best place to stay in Lake Como before travelling to Tirano for the Bernina Express.\nWhat village should we stay in to enjoy Como for 4 nights.\nThank you in advance", "link": "facebook.com/groups/1373361046396315/permalink/2198145113917900/", "likes": 0, "comments": [{"username": "Lyn Evans", "comment_text": "We will be staying in Varenna end Aug and planned a daytrip up to Alp Grum for lunch before heading back. We planned to train Varenna to Tirano then change to a regional train rather than Bernina Express as we have done this before. However, I have seen a bus portion added to the trip from Varenna to Tirano that was previously a direct train journey. Can anyone shine light on this and if the connections are timed well. I’m worried we now won’t have time for lunch at Alp Grum before heading back to Varenna the same afternoon. I imagine they do try time this for the Bernina Express departing Tirano."}, {"username": "Virgz Van Møøre", "comment_text": "Stay in Como"}, {"username": "Nancy Koehler Barboni", "comment_text": "Bellagio! Take boat excursions around Lake Como."}, {"username": "Maria Villanueva", "comment_text": "We loved Bellagio.❤️ Stayed on the lake in a lovely hotel called Belvedere. Took the boat to the surrounding towns around Lake Como.👍😊🇮🇹"}, {"username": "Greg Saba", "comment_text": "Varenna is convenient for both the train and its great ferry access to see all the lake from Menaggio to Bellagio to Como. And, the villas across the way and even a peek from the ferry at George Clooney house. There's a great deli in Bellagio that starts the day with the biggest pile of fresh bread rolls. Perfect place to get a picnic lunch to be enjoyed a short walk away at the Villa Melzi Gardens. Our most memorable picnic ever. Best gelato options are in Menaggio and Como. If you don't mind a pleasant hike, Villa Balbianello, on a striking point, has been in films including Casino Royale, where It doubled as a hospital for the recovering James Bond (Daniel Craig)."}]}, {"id": "2198145487251196", "text": "We will be in Rome for two days after our cruise and we are looking for recommendations\nfor tours that combine the Colosseum and Vatican. Hoping to see the best of both in one day.", "link": "facebook.com/groups/1373361046396315/permalink/2198145487251196/", "likes": 0, "comments": [{"username": "Karon Patterson", "comment_text": "Good luck!"}, {"username": "Jaime Cleek", "comment_text": "Book them yourself at the official sites"}, {"username": "Jay Parekh", "comment_text": "Book coliseum direct 30 days before your dates in Rome https://\nwww.coopculture.\nit/en/city/\nrome/"}]}, {"id": "2198148000584278", "text": "Last time I was in Italy most of the hotels we stayed in did not have “smart” TVs to use our apps. We used our laptop to watch a movie after a long day of sightseeing. How is it now, more modern, updated TVs ?", "link": "facebook.com/groups/1373361046396315/permalink/2198148000584278/", "likes": 13, "comments": [{"username": "Denise Wallace", "comment_text": "Took a USB stick full of movies it was Brill as I always like to watch it late at night and fall asleep 😴 💤 x."}, {"username": "Lisa Valdovinos", "comment_text": "We also like to unwind this way after a log day. We ended up watching shows on our phone. I did watch an Italian cooking show. It was easy to follow along."}, {"username": "Jeanette Colon", "comment_text": "Exhausted by the end of the day, crash the minute you hit the room and up early to hit the ground running and soaking it all in."}, {"username": "Randy Laub", "comment_text": "How long ago was your last time in Italy?"}, {"username": "Rhona OConnor", "comment_text": "It's very random. When you want one it's not there!!"}, {"username": "Lydia Springer", "comment_text": "I usually stream on my laptop for a short time at the end of my day. Don't need a tv."}, {"username": "Maria Ariano", "comment_text": "Go to the nearest osteria and watch old guys play briscola or scopa. I bet you'll learn a truckload of new words 🙂"}, {"username": "Jeff McLellan", "comment_text": "Even our 10 year old never asked to turn on the TV once. Just chill with some wine and call it a night."}, {"username": "Kathy Holden Reams", "comment_text": "Just got back last week. No smart tv’s"}, {"username": "Joe Reams III", "comment_text": "Still only dumb TVs. But it’s fun watching American TV shows overdubbed in Italian."}, {"username": "Wendy Martin", "comment_text": "We did watch some Italian TV and my husband enjoyed Italian cooking shows!\n🍝🧀🧄"}, {"username": "Joanne Nacson", "comment_text": "If this is important to you best to reach out to your accommodations"}, {"username": "Yannis Almpanoudis", "comment_text": "ever heard of chromecast 🙄"}, {"username": "Maria Coladangelo Ducca", "comment_text": "I NEVER bother with tv . Go to a piazza have a nightcap and breathe in La dolce vita( in the evenings Italians go for passeggiata in piazza , gelato and catch up with their neighbours"}, {"username": "Maureen Rebello Hagerty", "comment_text": "It’s still in Italian soooo"}, {"username": "Julie Campbell", "comment_text": "Well I love to travel and see the local sights but I also like a bit of TV before bed or in the morning with my coffee. We spent 3 weeks in egypt travelling and had limited but at least several good cable channels everywhere we went. In Italy however we had none in any of our mix of 3 and 4 star hotels in sorrento, naples or Rome."}, {"username": "Gil Rodriguez", "comment_text": "Ours in Rome came with all the apps. We didn't watch much but it was available"}, {"username": "Vera Feeny", "comment_text": "Depends, but one airbnb we stayed at had a smart TV. Not the hotel in Florence though"}, {"username": "Neville Spargo", "comment_text": "They all seem to have smart TVs BUT they are not connected to the internet so none of the smart apps like Netflix for example work !"}, {"username": "Sandra Kingsley", "comment_text": "We are in Italy at present and so far all our accommodation have had tv with Netflix and youtube"}, {"username": "Betsie Els Wepener", "comment_text": "Free Wi-Fi in hotels?"}, {"username": "Tony Palombino", "comment_text": "Do whatever you want, you want to watch TV , watch TV, you’re on vacation! Doesn’t matter where you are, do what you want!"}, {"username": "Jessica Therrien", "comment_text": "We’ve seen a mix of both smart tv and not. You can do screen mirror. We also carry an HDMI cable in case."}, {"username": "Heidi McPhillips", "comment_text": "I actually watch local tv including children’s shows to try and work on my language skills\nI find that a very fun part of international travel\nAlso AirBnB so in the evening we walk around and meet locals.\nI come home feeling I got so much more of an authentic experience\n❤️❤️❤️"}, {"username": "AK Kaygen", "comment_text": "Wow. You had time for movies? While in Italy?"}, {"username": "Lauren Vassallo Beattie", "comment_text": "I just watched Italian cartoons when i woke up and ate breakfast. Yes I'm a grown arse woman 😅"}, {"username": "Michael Albertsen", "comment_text": "The most American thing on the internet today.\n\nCongratulations\n, you won mrs."}, {"username": "Christine M Machacek", "comment_text": "I would only have it on while I'm getting ready in the morning as background noise."}, {"username": "Barbara Bastianini", "comment_text": "Everyone’s different. My favorite thing about travel is getting away from technology. After a long day of sightseeing we like relax with a drink and conversation on a nice piazza.\n\nSince I don’t even turn on a TV when I’m away I can’t say what they’re like. So I’d suggest emailing each hotel you’re interested in to ask specific questions about what’s provided. Because I suspect the answer will be different at each place."}, {"username": "Pat Felice", "comment_text": "Wow! Lots of condescending answers here😬 How about if y’all can’t answer her question, then don’t say anything?\nThanks to those who actually did respond appropriately. Very helpful."}, {"username": "Nicola Ramoso", "comment_text": "It always depends on where you go.\nAlways bring a laptop or a Roku/Fire TV stick with you just to be sure"}, {"username": "Frank Hunt", "comment_text": "Same, next to useless."}, {"username": "Lauren-Jade Roberts", "comment_text": "All air b and bs we stayed in had fire sticks and Netflix. We didn’t use them though so not sure how well they worked"}, {"username": "Fran Monopoli", "comment_text": "We never have time to watch television while on vacation so no idea what hotels have"}, {"username": "Rosa Morabito", "comment_text": "Who has time to watch movies? Aren’t you exhausted already!"}, {"username": "Sandy Cence", "comment_text": "We spent a week in Italy and never once turned on our TV. 🤷🏻‍♀️"}, {"username": "Rachael Richardson", "comment_text": "Same , just take an iPad or a pack of cards like we do"}, {"username": "Felicia Melo", "comment_text": "Some of my airbnbs had smart TVs while some of them didn’t. So I guess it depends"}, {"username": "Patricia Quirk", "comment_text": "Take cards!"}, {"username": "Kit Nader", "comment_text": "I took a memory card and I could put it in the tv to play a movie late at night when back in the room"}, {"username": "Paula Brink", "comment_text": "I never turn on the tv when I’m in Italy. 🤷‍♀️"}, {"username": "Ewa Żołądek", "comment_text": "1st world problems 🙄"}, {"username": "Blanca Gil", "comment_text": "Only watch the Italian news in the morning."}]}, {"id": "2198154243916987", "text": "I’m set to arrive in Rome at 8.30 pm and will be taking the Leonardo express train to termini station. My hostel is a 5 minute drive/ten minute walk. I’m not comfortable with the idea of walking by myself at night on day 1 (especially if flight is delayed and it’s even later). However, is it likely that a taxi will even agree to take me considering it’s such a shot trip?", "link": "facebook.com/groups/1373361046396315/permalink/2198154243916987/", "likes": 4, "comments": [{"username": "Pietro Adami", "comment_text": "Get Uber"}, {"username": "Jenny Payne", "comment_text": "Definitely, look up RometoRio app. & that will tell you how much it will cost, can you use google maps? as it will be busy with lots of tourists around . I lived in a street 10minutes from the termini called Via Agostino deprisits . I think if it is close they may try and rip you off?🌻"}, {"username": "Pearl Lucero", "comment_text": "Walking is fine at night as Italians are out late especially now since it’s so hot!"}, {"username": "Cecilia Christine Costantini", "comment_text": "Tell me where you have to walk to, I will tell you how safe it is (I am from Rome). There are always lots of people in that area, if you study the itinerary beforehard, nobody will bother you."}, {"username": "Lisa Kelly", "comment_text": "10 euro minimum for the short trip. Don’t do Uber and dont get a taxi through Uber. Pricey and unreliable."}, {"username": "Tony-Annette Unpingco Ada", "comment_text": "You can take a taxi or Uber if you feel the area is not safe for you to walk. Only you can make that decision"}, {"username": "Rhona OConnor", "comment_text": "If it make you feel safe get a taxi.... From the rank just outside. Of course they will take you."}, {"username": "Harris Dee", "comment_text": "U won’t be alone … streets are crowded after sunset til wee hours … love the cafe culture"}, {"username": "Angelo Adamo", "comment_text": "you will have no issue walking and cab will be approx 10 to 15"}, {"username": "Nana Tirolese", "comment_text": "Yes....our hotel was 2 minutes from the train station and it was fine. He shouldn't charge you more than €20."}, {"username": "Rachael Richardson", "comment_text": "Metro ? Cost only €1.5\nOr walk there are people about all the time late , they don’t eat until 9/10pm they still queuing for restaurants then !"}, {"username": "Romina Lauretig Toscano", "comment_text": "Use app itTaxi"}, {"username": "Graham Sherlock", "comment_text": "Walking is fine, enjoy"}, {"username": "Monique Swanner", "comment_text": "I would walk. . Really not worth the taxi there. It's much harder to get one than it is out of the states"}, {"username": "Kaja Hvistendahl Fløstrand", "comment_text": "If you are staying at Generator or Yellow Square - just walk there, so close"}, {"username": "Dana Green", "comment_text": "You’ll be fine. 🙌🏻"}, {"username": "Nakitha Badon", "comment_text": "Do an Uber! We always had luck. But you should walk. It should be safe"}, {"username": "Gillian O'Callaghan", "comment_text": "My hostel was 5-10 minutes walk away too. The area is well lit and there will be lots of people around but..... if you have to walk NW from the east side I wouldn't do it and would get a taxi even if it's a short way. Have fun."}, {"username": "Frank Hunt", "comment_text": "Depend which way you are walking, if you go into the ghetto near the station you might be in trouble, but keep to the main streets and you will be fine, it will still be busy pat midnight."}, {"username": "Sepi Toloue", "comment_text": "I just got a transfer shuttle van from the airport to the hotel , that was by the termini . But that was a few years ago. There are shuttle signs in the airport. It was 15 euro per person at the time"}, {"username": "Maureen Rebello Hagerty", "comment_text": "Oh I’d walk in a heartbeat"}, {"username": "Lauren Davis", "comment_text": "I never had an issue getting a taxi after leaving the train station. You can also call a taxi through the Uber app. Safe travels!"}, {"username": "Jennifer Avrett", "comment_text": "You should absolutely walk"}]}, {"id": "2198156617250083", "text": "I watched a YouTube video of a traveling couple that went to a restaurant in Italy i think either Rome, Florence and there were lemons hanging from the ceiling there was a set of stairs it was incredibly beautiful and the food looked amazing and then I fell asleep and the video passed and now can’t locate it. Does anyone have any idea what restaurant that might have been?", "link": "facebook.com/groups/1373361046396315/permalink/2198156617250083/", "likes": 0, "comments": []}, {"id": "2198158373916574", "text": "Planning to stay somewhere in the Italian Lakes district relying on public transport. Looking for a reasonably priced area to stay which is convenient to catch ferries, buses or trains. Hope to visit Lake Como and Lake Maggiore. Would love to skip across the border to Laguno. Many thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2198158373916574/", "likes": 1, "comments": []}, {"id": "2198158497249895", "text": "Hi All, seeking advice on whether to prebook the train from Florence to Le Spezia for a day trip to CT in mid September or will there be available seats on the day. Trying to avoid a bad weather day if we can. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2198158497249895/", "likes": 0, "comments": [{"username": "Laura Bartoli", "comment_text": "No need to prebook. Moreover if you take a \"treno regionale\" you cannot book a seat: for example florence-pisa + pisa- la Spezia (around 2.5 hours, 15€ one way). You can book a seat only on the \"frecce\" trains or on the \"intercity\" trains that are usually faster but much more expensive (around 33€ Ome way)"}]}, {"id": "2198179417247803", "text": "Ok…. I am torn and would like some advice. We are flying into Rome (mid October) and my plan was a few days there, then Naples for two days, the Amalfi for 3 and then head to Paris. My daughter wants to go to Venice….. so should I stick with the busy multi plan or just do Venice from Rome???? First time travelers for I’m torn….. but want a wonderful experience.", "link": "facebook.com/groups/1373361046396315/permalink/2198179417247803/", "likes": 3, "comments": [{"username": "Pat Cirillo", "comment_text": "Do you mean substitute Paris for venice? Or squeeze Venice in? If former, yes. Venice should be seen my everyone at least once. If latter, no. That’s too rushed and too much time traveling for that # of days."}, {"username": "Kristina Ruk", "comment_text": "Venice you should see once in a lifetime. So as you will be so near ;)"}, {"username": "LC Willis", "comment_text": "Lots of unrest in paris - might need to ensure book things you can cancel if need be\n\nI wld stay in the vicinity you are in ie italy- and do venice this trip. Make sure you wander away fr the shops lots of photographic moments"}, {"username": "Rina Speronello", "comment_text": "Scip Paris and do Venice instead"}, {"username": "Cindy Sguazzin", "comment_text": "Yes, by all means you must experience the unique and historic beauty of Venice!\nAnd please, do not miss Florence either. Naples and Amalfi can wait, in my opinion!"}, {"username": "Rhona OConnor", "comment_text": "Paris is under construction for the Olympics... Lots of road works, statues with hording and it's impossible to get tickets for big museums ect. Skip Paris on this trip."}, {"username": "Robyn Lawson", "comment_text": "Yes leave Paris for another trip. Venice is a must visit that you will absolutely love!"}, {"username": "Kylie Paine", "comment_text": "My daughter (22) has just done - Paris 3 days to Rome 3 days to Naples 2 days ...she is in love with Paris, her favourite so far she said it was so beautiful and she could easily live there ...but in saying that she is now doing Amalfi coast for 6 days staying in Salerno so she'll probably have a new favourite lol"}, {"username": "Luigia Gray", "comment_text": "Yes, skip Paris and do Venice instead. She won't be disappointed."}, {"username": "Kirsten Haight Cianci", "comment_text": "Since your responses suggest that Paris is NOT going to be removed from your itinerary, I would agree with those who suggest skipping Naples/Amalfi and going to Venice. If you have all 5 of those days to work with, you could easily take the train from Rome to Florence first, then continue on to Venice. Venice and Florence are amazing! 🙂 (but it's hard to go wrong in Italy...) <3"}, {"username": "Jennifer Nguyen", "comment_text": "I think it is best to divided out and not doing everything all at once because you will be too tired to enjoy anything. Especially if you are first time travel to Europe. Last year we went to Rome for one week and took a 7 days cruise around Florence/Pisa, Corsica, Cannes, Barcelona, Majorca, and Naples/\nPositano.\nNext year we plan to go to Venice, Lake Como, Milan for 1 week in the Northern Italy and 1 week for Amalfi, Sorrento, Naples, etc. in the Southern Italy. We went to Paris and Nice 5 years ago. We have to divided all out because check in and out of hotels and take a train to travel from point A to point B lose 1 day for transportation and relocation.\nWe checked out of the hotel around 9 am after breakfast. We took the taxi to the train station. We took the train from Paris to Nice and waited around a bit. By the time the train went down South couple of hours later. Checked in the hotel around 5 pm and unpacked the luggage, showered and went to dinner and the day was pretty much over. That’s why I always consider go from one hotel to another hotel in another city as 1 day of loosing just for traveling."}, {"username": "Harris Dee", "comment_text": "Venice Rome Paris is magical enough"}, {"username": "Debbie Potter", "comment_text": "You will regret missing Venice"}, {"username": "Laura Uribe", "comment_text": "Whatever you decide, you need to do it now. Rome is almost completely booked towards the end of October due to a golf event which means you will be competing with others who also haven’t booked yet and need to change their plans. Have fun!"}, {"username": "Meredith Williams", "comment_text": "venice stole my heart ❤️"}, {"username": "Danielle Gervais", "comment_text": "Rome, skip Naples and go to Sorrento on a the Amalfi cost see Capri ( boat) and Pompéi, ( excursion) Florence then Venice, can you skip Paris? It’s a lot . I would keep Paris for another time."}, {"username": "Jen Lew Nontha", "comment_text": "I loved venice. I prefer it over amalfi. The food was amazing, the waterways were my favorite (no cars!!), and it was just a romantic city. I went to Sorrento/capri and they were expensive and the food wasnt that great."}, {"username": "Meg Reaburn", "comment_text": "A day trip with an early start is feasible from Rome"}, {"username": "Bronwyn O", "comment_text": "Personally liked the Amalfi coast a lot more than Venice. I’m glad to have seen Venice once but don’t have much desire to go back, but the Amalfi coast was so much fun. It’s really up to what y’all prefer - if she really wants to see it and will regret missing out, go do it, even for just a day. If not, consider what appeals to you.\n\nVenice- canals, glass products, a gorgeous basilica and more “recent” history.\n\nAmalfi coast - cliff/small mountain terrain on the coast, food products (lemons, olives, pistachios, etc), different also unique churches, hiking, easy access to Pompeii area, close to a sunken city (Baiae)."}, {"username": "Diana Smith", "comment_text": "I think you can do it all. Go to Rome, from there take the train to Naples, the Amalfi coast is only 1hr away …spend a day there, come back to Naples, spend the day and then book a flight to Venice. Have fun , whatever you decide!"}, {"username": "Jacquie Johnston", "comment_text": "We trained from Rome to Venice Oct 2022, we were in Italy 21 days"}, {"username": "Christine Broussard", "comment_text": "The Amalfi coast is a holiday all on its own"}]}, {"id": "2198180873914324", "text": "lake Como one day itinerary help please\n\nCan anyone who has spent one day from Milan to lake Como please share what you did?\n\nI am thinking to catch train to com early morning, then get a ferry ticket to travel back to varenna and then catch train from varenna back to Milan. The only things I wanted to do aside from a bit of wwalking around was toआणखी see one villa - barbianello seems to be a favourite - have a nice lunch with an amazing view and take in nice views on the lake - which I’m thinking we will get from ferry or is it worth taking a separate boat tour?\n\nThank you", "link": "facebook.com/groups/1373361046396315/permalink/2198180873914324/", "likes": 0, "comments": []}, {"id": "2198183153914096", "text": "Going to Sicily. How are the beaches?\nSandy, rocky???? Do you need water shoes? Are there cabanas to change into bathing suits? Showers?? We are staying in Trapani....good beaches close?\n\nAny other suggestions on tbings to fo with our base in Trapani???\n\nI have been to Italy a few times but not to Sicily. Thanks in advance for your help🇮🇹🇮🇹🇮🇹🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2198183153914096/", "likes": 57, "comments": [{"username": "Claudia Castellini", "comment_text": "Beaches can be sandy and rocky as well, you’ll find both; water shoes can be useful, but not necessary.\nCabanas and showers are not guaranteed at all.\nGo to Isole Egadi (just in front of Trapani, you can take day trips and will find beautiful beaches), to Erice (nice village on the top of a hill), to San Vito Lo Capo and Scopello (beautiful beaches), to Segesta (Greek theater where you also can see a piece in the evening, beautiful experience!).\nYou will need a car for most of these destinations.\nIn Trapani, eat typical cous cous (with fish) and enjoy you vacation, you’re going to visit a beautiful area! 💙"}, {"username": "Fetchin Gretchen", "comment_text": "Caveat that while I lived 5 weeks in Sicily in 2016, I did not visit all of these beaches or places suggested!\n\nThe beaches in Sicily vary in terms of sandiness and rockiness. Some of the beaches in Trapani are sandy, such as Spiaggia di San Giuliano and Spiaggia delle Mura di Tramontana. Others, such as Cala Rossa and Cala dei Turchi, are more rocky.\n\nIf you are planning on swimming in the sea, it is a good idea to bring water shoes, even if the beach is sandy. This is because the seabed can be rocky in some areas, and water shoes will help to protect your feet.\n\nThere are cabanas to change into bathing suits and showers at some of the beaches in Trapani. However, it is a good idea to check in advance, as not all beaches have these facilities.\n\nHere are some of the good beaches close to Trapani:\n\n* **Spiaggia di San Giuliano:** This is a long, sandy beach with clear blue water. It is a popular beach for families, and there are plenty of facilities, such as cabanas, showers, and restaurants.\n\n* **Spiaggia delle Mura di Tramontana:** This is a smaller beach, but it is just as beautiful as Spiaggia di San Giuliano. The sand is a little more coarse, but the water is just as clear. There are also a few cabanas and showers on this beach.\n\n* **Cala Rossa:** This is a small, secluded beach with clear turquoise water. It is located in a nature reserve, so it is a great place to go for a swim and relax in the sun.\n\n* **Cala dei Turchi:** This is a beautiful beach with white sand and clear blue water. It is located in a cove, so it is a great place to go for a swim and escape the crowds.\n\nHere are some other suggestions for things to do in Trapani:\n\n* Visit the **Trapani salt pans:** The Trapani salt pans are a UNESCO World Heritage Site. They are a beautiful place to visit, and you can learn about how salt is made.\n\n* Explore the **Erice Castle:** Erice Castle is a medieval castle that is perched on a hilltop overlooking Trapani. It is a great place to visit for stunning views of the city and the sea.\n\n* Take a boat trip to **Egadi Islands:** The Egadi Islands are a group of islands off the coast of Trapani. They are a great place to go for swimming, snorkeling, and hiking.\n\n* Visit the **Mazara del Vallo Cathedral:** Mazara del Vallo Cathedral is a beautiful cathedral that is located in Mazara del Vallo, a town about 30 kilometers from Trapani.\nPs, my favorite places in Sicily are Taormina, Corleone and the Mafia museum and the small village where Cinema Paradiso was filmed, whose name I forget. Also the Catacombs in Palermo are awesome.\nI hope this helps!"}, {"username": "Ewa Pankowska", "comment_text": "In Trapani beach is sandy no need for shoes.\nWhen you go to Favignana (is really worth) shoes can be usefull in some places (cala rossa) and not necessary in the others (cala azzura - sandy, lido burrone).\nVery beautifull in Zingaro - cala capreira has white, smooth stones (we didn’t use shoes and had no problem, some people had shoes ). Scopello - in some places shoes were usefull but not necessary."}, {"username": "Debbie Whittle", "comment_text": "If you have a car drive to Scopello - the Tonnara de Scopello is well with a visit."}, {"username": "Kim Maresca Kilty", "comment_text": "Very rocky. Water shoes are a must."}, {"username": "Leslie BC", "comment_text": "Any good beaches on or around Messina?"}, {"username": "Michelle Plutto", "comment_text": "Following"}, {"username": "Margaret Pantusa", "comment_text": "San Vito\nCastellamare\nErice (not a beach but a lovely hill town)"}, {"username": "Alessia Zito", "comment_text": "In sicily you can find all types of beaches, it depends on the area, for safety bring water shoes, there are both with fine sand, gravel, stones.\nThe most beautiful beaches in the Trapani area are: Tonnara di Scopello, Riserva dello Zingaro, cala capreria, Macari, castellammare del golfo, cala mazzo di sciacca, cala calazza castelluzzo, punta tramontana marsala, baia santa margherita, san vito lo capo,\nthese are the closest beaches but the most beautiful are in the islands, you can take a ferry to the egadi islands, all very beautiful, crystal clear sea and unspoilt nature.\nthe most beautiful in my opinion is favignana, but marettimo and levanzo are also very beautiful.\nYou can also visit the salt pans of marsala and trapani, erice, the temple of segesta, grotta mangiapane,"}, {"username": "Carole Mackewich", "comment_text": "Cefalu has a wonderful sandy beach and is a lovely town with great little shops and excellent restaurants!"}, {"username": "Michele Baron Vold", "comment_text": "Taormina is my favorite. Take a cooking class."}, {"username": "Melissa Miceli Alomia", "comment_text": "San Vito Lo Capo, best beach in Trapani in my opinion. White sandy beach, crystal clear water,\namazing restaurants and shops and everything is in walking distance. No cabanas that I saw but there may be some 🤷🏼‍♀️ You can rent lounge chairs and umbrellas daily."}, {"username": "Patty Ham", "comment_text": "Go to the sea salt producing area. And DO NOT miss the small island of San Pantaleo just off Trapani across the shallow lagoon. Absolutely amazing Phoenician ruins from 4th century BC. You literally walk through fields of ancient pots just sitting on the ground untouched. It is unbelievable."}, {"username": "Joanna Ruvolo", "comment_text": "Castellamare de golfo beach. Sandy, but it’s not the best beach around. Scopello is about 10 mins away and beautiful. You’ll need a car to get there."}, {"username": "Joanna Ruvolo", "comment_text": "This is Riserva Naturale Orientata dello Zingaro in Trapani. It’s a beautiful perserve with several little coves like this. You have an easy walk to reach them. This is rocky."}, {"username": "Joanna Ruvolo", "comment_text": "This is Palermo. Don’t remember which beach but all sand and super clear. San Vito Lo Capo is another sandy beach that people say is one of the most beautiful beaches. It’s about an hour from Palermo. I can’t find the pic. But we did find a cool little cove area that was not touristy that was so beautiful. I also stayed on the east coast and there were several sandy beaches there. All depends. Either way, Sicily is beautiful. Enjoy!"}, {"username": "Marco Campoli", "comment_text": "I love the American s that ask about beaches…..Ameri\nca beaches are average."}, {"username": "Fabio De Filippi", "comment_text": "That area is wild and extremely beautiful,almos\nt untouched by the humans,go to the island of Favignana,there\nis a boat in marsala..its absolutely stunning,over there you can rent an electric bike and see the beaches..you can find also a couple of beaches where you have shower and cabana"}, {"username": "Elizabeth Lupo DiVito", "comment_text": "Depends on the beach. In Taormina we needed eater shoes. In Mondello outside Palermo sandy and wonderful"}, {"username": "Arianney Dacumos", "comment_text": "Mondello Beach is a nice sandy beach , tonnara di scopello is beautiful too 😊"}, {"username": "Raf Gervasio", "comment_text": "Mondello is a gorgeous sandy beach"}, {"username": "Gwyneth Spadaro-Dutturi", "comment_text": "Buy some books like Rough Guide. Get a decent map and drive orotund and explore"}, {"username": "Gianluca Rivizzigno", "comment_text": "Always bring water shoes. You'll never know."}, {"username": "Silvia Scholz Natal", "comment_text": "Be aware of the Airport problems right now in Catania 🙋‍♀️"}, {"username": "Christine Pinto Kulp", "comment_text": "Going to Sicily in the fall. Will be looking at responses to your post! Enjoy your trip! Bruce Kulp see helpful responses to post."}, {"username": "Bryanna Gonzalez", "comment_text": "Flavia Aguilar"}, {"username": "Chris Catanese", "comment_text": "Bring water shoes"}, {"username": "Janis Hartley", "comment_text": "Janis Hartley"}, {"username": "Elizabeth Lupo DiVito", "comment_text": "Mondello Beach is nice and sandy. We rented a chair which came with cabana use and restrooms. We did he same in Taormina but not as sandy"}, {"username": "Dorothy Press", "comment_text": "It was beautiful 💕 Not rocky or needing shoes. This was on the Catania side of the island by Scilcli."}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "We were just in Termini, on the northern shore of Sicily, and Taormina, on the eastern shore. Both were rocky. You'd probably like to have something on your feet."}, {"username": "Pamela Dingli", "comment_text": "Yes water shoes are a great"}, {"username": "Fiona Currey", "comment_text": "Watch White lotus season 2!"}, {"username": "Jon Ruple", "comment_text": "Taormina is great. We swam off a boat, beautiful water"}, {"username": "Lisa Jones", "comment_text": "Isola Bella near Taormina is beautiful, I wish I had reef shoes the rocks were difficult to walk on 😁 but this is on the other side of the island, I'm not sure about the beaches near Trapani."}, {"username": "Alice Francesca", "comment_text": "Just google beaches in Trapani..\nhttps://\nwww.scent-of-sic\nily.com/\nsicily-travel-gu\nide/\nbest-beaches-tra\npani/"}, {"username": "Nicola Morgans", "comment_text": "don't worry about changing cabanas just get your stuff off and change quickly honestly no one is watching you. yes a good idea for neoprene water sandals mine were 5 quid from Lidl."}]}, {"id": "2198186403913771", "text": "Hi everyone! Just wondering what are some must do’s for Milan and best authentic restaurants! Thanks so much!", "link": "facebook.com/groups/1373361046396315/permalink/2198186403913771/", "likes": 0, "comments": []}, {"id": "2198188193913592", "text": "I remember the public bathrooms used exact coins in the past. Do they still?", "link": "facebook.com/groups/1373361046396315/permalink/2198188193913592/", "likes": 0, "comments": []}, {"id": "2198189147246830", "text": "Can anyone suggest travel guides? We will be in Sicily and then would like travel guides to be able to drive and visit places we want to go in Umbria and Tuscany? Are there any reasonable ones?", "link": "facebook.com/groups/1373361046396315/permalink/2198189147246830/", "likes": 0, "comments": []}, {"id": "2198194727246272", "text": "Rented vila in levanto. Things to do in the area? Cinque terre for sure. Any places are must go? Anynof the 5 towns more appealing? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2198194727246272/", "likes": 0, "comments": []}, {"id": "2198196740579404", "text": "I must be missing something! I downloaded the trainItalia app and am trying to register. United States is not an option for a country of residency? What am I missing?", "link": "facebook.com/groups/1373361046396315/permalink/2198196740579404/", "likes": 5, "comments": [{"username": "Karon Patterson", "comment_text": "Use Omio app"}, {"username": "Lorraine Butler", "comment_text": "Look for stati Uniti"}, {"username": "Harris Dee", "comment_text": "Same issue … it’s in Italian … look under S"}, {"username": "Mary Anne", "comment_text": "Stati Uniti is Italian for United States."}, {"username": "Kim Kirsten NeeMeglic", "comment_text": "Try the website not the app"}, {"username": "Grace Shepherd", "comment_text": "Omio app works amazing, has your own currency and better for planning journeys - get that!"}, {"username": "Laura Walker", "comment_text": "Trainline App is great"}, {"username": "Tiffany Hadfield Merrill", "comment_text": "I tried too, gave up & used omio"}, {"username": "Claudio Blizzard Indastria", "comment_text": "Stati uniti"}, {"username": "Wahab Sidharta", "comment_text": "Trainline"}, {"username": "Penny Williams", "comment_text": "Omio and Trainline are better as there are more choices than just Trenitalia trains. They also have Italia Rail trains."}, {"username": "Krissy DaRusso", "comment_text": "Try searching under S or N. It’s there but it’s the Italian version. Sorry I can’t be more specific but I remember I couldn’t find it either."}, {"username": "Noelene Cameron", "comment_text": "Try the Trainline app."}, {"username": "Karen Blackmore", "comment_text": "For regional trains (i.e. not the fast ones) Trainline is better, as has the Trenord trains. Some short journeys can only buy at the station. Then need to validate in the station , green machines"}, {"username": "Sam Mah", "comment_text": "Use Trenitalia online service."}, {"username": "Lynn Crane", "comment_text": "Stati Uniti"}, {"username": "Heather Baumann", "comment_text": "I had the same problem and even after finding it, it wouldn’t take so could register."}, {"username": "Fetchin Gretchen", "comment_text": "You are not missing anything. The Trenitalia app is only available to users who reside in Europe. The United States is not included in the list of supported countries. This is because Trenitalia is a state-owned railway company in Italy, and its services are primarily intended for residents of Europe.\n\nIf you are planning to travel to Italy, you can still use the Trenitalia app to purchase tickets. However, you will need to create an account with a country of residence that is supported by the app. You can use a friend or family member's address in Europe, or you can use a virtual mailbox service.\n\nHere are some of the countries that are supported by the Trenitalia app:\n\n* Austria\n* Belgium\n* France\n* Germany\n* Greece\n* Italy\n* Luxembourg\n* Netherlands\n* Portugal\n* Spain\n* Switzerland\n\nI hope this helps!"}, {"username": "Karina Aguilera", "comment_text": "Use Omio App."}, {"username": "Blanca Gil", "comment_text": "As others have stated look for “Stati Uniti.”"}, {"username": "Vijay Almeida", "comment_text": "We was able to register and buy tickets on the Trenitalia app. The app is not the most user friendly - See if you have any space in any of the fields. Both before and after. We live in the US"}, {"username": "Debra Rigler-Arsenault", "comment_text": "Doesn’t work in Canada but I’ll download the minute we land in Frankfurt on our stopover to Rome."}, {"username": "Patty Foster", "comment_text": "Trenitalia and Italia, let me register. I believe it is down a ways and United States of America, I think. It is there though."}, {"username": "Frank Hunt", "comment_text": "Try the trainline app"}, {"username": "Gay Bell DiBartolomeo", "comment_text": "Stati uniti"}, {"username": "Irma Hurlbert", "comment_text": "Try United States in Italian"}, {"username": "Peach Panfili", "comment_text": "Trenitalia with an e"}, {"username": "Claire Rich Luce", "comment_text": "Hi Michelle. Are you going to Italy?"}]}]