[{"id": "2194784570920621", "text": "Anyone saty at Best Western Hotel Cavalieri Della Corona or Hotel delle fiere? Can I have your opinion", "link": "facebook.com/groups/1373361046396315/permalink/2194784570920621/", "likes": 0, "comments": []}, {"id": "2194784480920630", "text": "#Ischia, #Italy", "link": "facebook.com/groups/1373361046396315/permalink/2194784480920630/", "likes": 119, "comments": [{"username": "Elena Dompa", "comment_text": "Elena Dompa"}, {"username": "Shula Hurvitz", "comment_text": "🇮🇹💯🎯💥🥇🇮🇱"}, {"username": "Debbie Plante", "comment_text": "Be there soon 🤗🤗🤗🤗"}, {"username": "Margaret Sleep", "comment_text": "Margaret Sleep"}, {"username": "Roger W Ilsley", "comment_text": "Love Italy"}, {"username": "Melinda Neufeld", "comment_text": "Would you recommend Ischia over Capri?"}]}, {"id": "2194784010920677", "text": "#Amalfi #Coast #Italy", "link": "facebook.com/groups/1373361046396315/permalink/2194784010920677/", "likes": 85, "comments": [{"username": "Erina Bourassa", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Nauman Khan", "comment_text": "Nauman Khan"}, {"username": "Gigi Aloha", "comment_text": "Are those drinks called Comparis?"}]}, {"id": "2194782237587521", "text": "Venice was the busiest city in Italy that we visited a few days ago but the most unique and memorable. We stayed on the Grand Canal, but with over 400 bridges across 150 canals, there are many quieter areas andआणखी neighborhoods to enjoy and other islands to visit. Our favorite neighborhood was Cannaregio, where where many Venetians and students live. We celebrated my husband’s birthday with a boat tour and went to the Murano to see the glass artisans.", "link": "facebook.com/groups/1373361046396315/permalink/2194782237587521/", "likes": 271, "comments": [{"username": "Cheryl KBillk", "comment_text": "Did you take the tour in Murano or just go on your own? Thank you and Happy Birthday"}, {"username": "Vicky Woeste", "comment_text": "Happy Birthday to your husband! Did you stay at Air Bnb ?"}, {"username": "Marie Bryer", "comment_text": "Did Venice smell"}, {"username": "Christine Philomena", "comment_text": "We stayed in the Cannaregio area and loved the quieter area. We did of course go to the Grand Canal area but LOVED where we stayed.\n\nWe did the hop on hop off boat pass and went to Murano, Burano and Torcello.\n\nHappy bday to your hubby!"}, {"username": "Leah Canady Raney", "comment_text": "We just got back from our trip. We ended our stay in Venice, I agree it was beautiful!"}, {"username": "Paige Montecalvo", "comment_text": "We were there just a few weeks ago. I always see mixed reviews on Venice… we absolutely loved it there and wanted a few more days to explore. I personally thought they had the best gelato too (we were in Venice, Rome, Positano)"}, {"username": "Tara Roed", "comment_text": "Looks amazing!! May have to include Venice on my next trip."}, {"username": "Jennifer Smith", "comment_text": "Great pics! We’re actually staying on a canal in Cannaregio so this post makes me feel better about our location. May I ask the details of the boat tour?"}, {"username": "Katie Smith", "comment_text": "You always here stories of peoples bad experiences on gondola rides in Venice. Can you post where you found your boat tour? I love that it had cocktails and snacks. Lilly Raymond\nThank you so much!!"}, {"username": "Mary Evans", "comment_text": "I love Venice"}, {"username": "Jessica Petyo", "comment_text": "We were just there two weeks ago, and it was actually the quietest for us! I just wish I hadn’t listened to everyone saying “you only need a day there.” It was magical and I want to go back! 💚🤍❤️"}, {"username": "Carol Cadena", "comment_text": "Carol Cadena"}, {"username": "Jen Lim", "comment_text": "what hotel did you stay at?"}, {"username": "Lilly Raymond", "comment_text": "Hotel Antiche Figure Venice\n\nhttps://\nwww.hotelantiche\nfigure.it/\n?utm_source=goog\nle&utm_medium=o\nrganic&utm_camp\naign=GoogleMyBu\nsiness#/"}]}, {"id": "2194779374254474", "text": "Any places for horse riding near Milan?", "link": "facebook.com/groups/1373361046396315/permalink/2194779374254474/", "likes": 0, "comments": []}, {"id": "2194770970921981", "text": "Any recommended tour guides for Pompeii and Herculaneum?", "link": "facebook.com/groups/1373361046396315/permalink/2194770970921981/", "likes": 0, "comments": [{"username": "Glenn Todd Webb", "comment_text": "Easy car tour Naples gave us a good one. And pick up/drop off at hotel."}]}, {"id": "2194774927588252", "text": "Trying to plan a trip to Italy next year for 6 people. Does anyone have a travel company they would recommend?\nPrivate tour if possible. Thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2194774927588252/", "likes": 0, "comments": [{"username": "Lisa Valdovinos", "comment_text": "We used Avanti for tours and excursions."}, {"username": "Ron Bialecki", "comment_text": "I used Corleone travel they made me a offer I couldn’t refuse. One of my friends actually got to sleep with the fishes. We got to pet a horse on its head. Only problem was a couple of the car rides there where a little shotty. But all in all it was great can’t wait to do it a second and third time although I feel the third time probably won’t live up to the first two but it will still be liked."}]}, {"id": "2194765680922510", "text": "How much is it to take an Uber or have a driver from a well rated company from Florence to central Rome? I will have baggage and no help, not sure how easy the train stations are in terms of elevators/escalators. Any companies that you could recommend would be helpful.", "link": "facebook.com/groups/1373361046396315/permalink/2194765680922510/", "likes": 3, "comments": [{"username": "Pong Ac Ai", "comment_text": "Firenze SMN is nice but if you got lots of baggage you need a cab"}, {"username": "Pat Francis Moslow", "comment_text": "I have used a company called Daytrip to go from city to city within Europe. My experience has been very very positive, and I would use them again in a heartbeat. They’re not cheap, but their drivers are awesome and reliable.￼\nmydaytrip.com"}, {"username": "Valerie Collanton", "comment_text": "I used Florence Limousine Service from Naples to Rome. It was 300 euro. They were great. I would email them for a quote. info@florenceli\nmousineservice.\ncom"}, {"username": "Miyuki Kanno Paul", "comment_text": "Many train stations do not have elevators or escalators that you have to go up and down the stairs with your luggage. When I do solo trip, I still bring my usual big suitcase, rollerboard, and a tote as usual regardless. I didn’t have any issues making two trips to and from the platform"}, {"username": "Rhona OConnor", "comment_text": "Every station I went to had lifts or escalators. I didn't have a problem with my bag..... But you must be able to lift it yourself. Trains work very well for getting around."}, {"username": "Mary Anne", "comment_text": "It’s only three or four steps into and out of the train. Stations have elevators but we only needed to use one in Lucca in the eight train trips we took. Everywhere else was flat to the platform."}, {"username": "Lindsay Storry", "comment_text": "The fast trains are incredible! Smooth travels, wifi, and much faster journey than a car. Our journey btw Florence and Rome was only 1.5hrs while the drive will be about 4hrs depending on traffic. The train station in Florence is small and one level from entry to platform. As mentioned above, it’s just getting your bag(s) onto/off the train. I saw people being very helpful with other people’s bags as well."}]}, {"id": "2194751130923965", "text": "I am just beginning to plan a trip to Italy. I was thinking of going with a tour company but they all list hotels. Do any tour agency use Airbnb or equivalent. I really don't want to stay in hotels.", "link": "facebook.com/groups/1373361046396315/permalink/2194751130923965/", "likes": 0, "comments": [{"username": "Ginny Richardson Lapham", "comment_text": "I’m starting to plan and was wondering the same."}]}, {"id": "2194121020986976", "text": "Hello travelling friends… any suggestions on restaurants in Sperlonga & best day trips to arrange. Travelling family. Kids: 14 & 16. Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2194121020986976/", "likes": 1, "comments": [{"username": "Romana Svítková", "comment_text": "There's a bus that goes from the airport directly to the main train station. We took it last year, it was a short journey."}, {"username": "Romana Svítková", "comment_text": "https://\nwww.naples-airpo\nrt.info/bus/"}]}, {"id": "2194750350924043", "text": "The beautiful canals of Venice from a few days ago- an incredibly unique and memorable city!", "link": "facebook.com/groups/1373361046396315/permalink/2194750350924043/", "likes": 170, "comments": [{"username": "Carol Taylor Tisdale", "comment_text": "Indeed it is. Just returned from my 5th visit and I'd go again tomorrow!"}, {"username": "Mike LeClear", "comment_text": "Stunning pictures!"}, {"username": "Tracy Kirk", "comment_text": "It rained the whole time we were there - glad to see it in sunnier times."}, {"username": "Cheryl KBillk", "comment_text": "So beautiful we go in November."}, {"username": "Julia Muller", "comment_text": "Gorgeous shots - we spent three nights there at the end of June (third visit) and loved it too!!"}, {"username": "Mary Marzacco Krzykowski", "comment_text": "My favorite place!!!"}, {"username": "Andrea Romano", "comment_text": "Andrea Romano"}, {"username": "JoAnn Wheeler", "comment_text": "JoAnn Wheeler"}, {"username": "Carol Cadena", "comment_text": "Carol Cadena"}, {"username": "Paulette Chinn", "comment_text": "Paulette Chinn"}, {"username": "Manny Patricia Botelho", "comment_text": "Manny Patricia Botelho"}, {"username": "Lisa Lowe", "comment_text": "Beautiful pics"}]}, {"id": "2194748237590921", "text": "I apologize if this was mentioned here. Starting to plan activities and train tickets for October trip. How far in advance did you reserve your train tickets? Also do you recommend which tour of colosseum as there’s many and some are guided some not. There’s night, regular ticket, tour with underground ticket, skip the line ticket. It’s overwhelming. Any advice?", "link": "facebook.com/groups/1373361046396315/permalink/2194748237590921/", "likes": 0, "comments": []}, {"id": "2194139590985119", "text": "Really quaint, cute hotel here in Sorrento. Quiet and adorable 🍋", "link": "facebook.com/groups/1373361046396315/permalink/2194139590985119/", "likes": 64, "comments": []}, {"id": "2194701260928952", "text": "We are flying to Florence for a wedding next May. When should we look to book flights for the best routes and most economical airfare rates? We are traveling from the US (Texas).", "link": "facebook.com/groups/1373361046396315/permalink/2194701260928952/", "likes": 1, "comments": [{"username": "Cheri Arrowood-Stanziano", "comment_text": "I would sign up for a farewatcher site. At present it is too early to book flights"}, {"username": "Stephanie Osborn Rushing", "comment_text": "Use google tracker, we bought flights on American out of dfw and used google tracker and saw flights dropped almost 500 per ticket! AA changed it for us and we have 1300 credit, but you have to jump on it quick"}, {"username": "Miyuki Kanno Paul", "comment_text": "IAH-EWR/ORD/\nIAD, then to FCO if taking United. From FCO, take a train to Firenze SMN station. Less flight connections, less losing baggage. Remember, there is a positive baggage match from USA to any International destinations, which means that your checked bags will not go if you are not physically onboard the International flight"}, {"username": "Daisy Yoo", "comment_text": "I do not know what part of Texas are y but there is a direct flight from dfw to fco, then y can stay in Rome for few days then train direct to Florence"}, {"username": "Alexandra A Welker", "comment_text": "A bit too early to book now, sign up for a flight tracker and get updates on prices. Also, you can fly from other cities besides Florence or Rome, try Venice and compare the three."}, {"username": "Gregory Smith", "comment_text": "Price out flying into Milan (MXP), Venice (VCE), and Rome (FCO) and then look to take the train from any of these gateway cities. Florence (FLR) is small and will have a limited number of flights but the city is well connected via high speed rail. Make sure you understand the limits of Basic Economy tickets if you purchase those (most people should buy regular economy). Use Italrail site to estimate the cost of rail tickets. https://\nwww.italiarail.c\nom/\ncity-city-ticket\ns"}, {"username": "Becky Smart", "comment_text": "I’ve been watching flights from Seattle/\nPortland to Florence for next May as well. I found flying into Bologna or Rome was cheapest. Also found that making a pit stop in London was also pretty affordable and added another destination to the trip."}, {"username": "Monique Swanner", "comment_text": "I would do DFW to fco (Rome) it was the cheapest for us when we travelled."}]}, {"id": "2194730427592702", "text": "Looking for a recommendation for a driver to take us from Rome to Sorrento. I'm a little nervous about the train.", "link": "facebook.com/groups/1373361046396315/permalink/2194730427592702/", "likes": 16, "comments": [{"username": "Kyna Martin Autrey", "comment_text": "I don’t have an answer but the train is really very easy"}, {"username": "Lisa Valdovinos", "comment_text": "We took train from Rome to Naples then had private car to Sorrento. Train station is little crowded but we figured it out."}, {"username": "Cettina Milioto", "comment_text": "Marco Accettola"}, {"username": "Liz Fleming Dever", "comment_text": "Train was super easy. We rented a car to go to Sorrento. Driving is challenging but can be done. Good luck!"}, {"username": "Suzanne Mills", "comment_text": "I would be more worried about a driver!"}, {"username": "Darryl Vanstone", "comment_text": "We took the fast train from Rome to Naples. Was fast and easy. Then a driver from station to our hotel. Would be super expensive to use a driver from Rome to sorrento and would take a long time"}, {"username": "Kristin Bawden Larson", "comment_text": "For reference… we just arrived home yesterday and our last 2 stops were Rome and Sant’Agnello (one train stop from Sorrento).\n\nI got a quote￼ for a driver to take our family of six and luggage from Rome to Sorrento area and it was €550. Instead, we took the train to Naples, and then had a driver pick us up in Naples and take us to our Vrbo. Paid €160 for that trip… But again, it was six of us plus luggage.\nWorked out awesome!!!"}, {"username": "Dayna Steinberg Cioffi", "comment_text": "We did the train to Naples and then private car from the Naples train station to our hotel."}, {"username": "Mary Evans", "comment_text": "Don’t be. Trains are great in Italy"}, {"username": "Chris Vilsack", "comment_text": "The Italian countryside is so beautiful\nYou will ❤️ the views from the train"}, {"username": "Christine Golia Brigida", "comment_text": "Amalfidrive4you"}, {"username": "John Mccormick", "comment_text": "We have done it two times and are doing it a third time this October. We always take a driver because we just find it so much easier when you have your luggage at Rome airport and see a driver with your name on the sign and simply walk into the car with air conditioning and you’re on your way and your next stop is Sorrento or Positano in our case. They cost about $500 and we did it￼ for the two of us. if money isn’t the issue it’s much easier and I find it to be very relaxing."}, {"username": "Denise Tenn", "comment_text": "The Italian trains were brilliant! Go first class if can as lots of room, comfy seats & snacks thrown in too! The views along the way are amazing too!"}, {"username": "Rachael Richardson", "comment_text": "Train all the way easy peasy! We have done loads while we here it’s so easy"}, {"username": "Lynn Guerrieri O'Malley", "comment_text": "We did both 2 weeks ago. 4 of us with luggage took the Biz Class train from Rome to Naples… then private driver from Naples train station to Sorrento Hotel. On the return, we had a private van take the four of us with luggage from our hotel in Sorrento to our hotel in Rome. It was a 3 1/2 drive and cost €600. In my opinion, the train is a much better way to travel and significantly cheaper"}, {"username": "Christine Piche", "comment_text": "Train is hreat, take business class"}, {"username": "Kateryna Fedyushkina", "comment_text": "Fast train (Italo ) to Naples-1 h journey\nHydrofoil from Naples to Sorrento (45 min) -Alilauro/\nCaremar web site"}, {"username": "Sally Volpe Godin", "comment_text": "The train Rome to Napoli was great. Recommend the Frecciarossa high speed train through Trenitalia. Clean, comfortable, reasonable…upgr\nade to premium! Then we hired a driver to pick us up Napoli to Sorrento."}, {"username": "Jonathan Goetzel", "comment_text": "We took the train with our 5 year old twins and all our luggage. Pretty easy. The train to Naples was very nice but the train to Sorrento was a regional train and not as nice and comfy but got us to where we needed to go. An added benefit with the train meant we had time to have a genuine Neapolitan pizza. There is a notable pizza place across the street from the train station."}, {"username": "Valerie Collanton", "comment_text": "I used Florence Limousine Service to go from Naples to Rome. They were great. They provide service all over Italy. info@florenceli\nmousineservice.\ncom."}, {"username": "Frank Hunt", "comment_text": "Trainline app, book online, turn up at the station, job done."}, {"username": "Robin Burrell", "comment_text": "Rome to Naples train is excellent. If you aren’t comfortable taking the train specifically for tourists get a driver for Naples to Sorrento"}, {"username": "Raf Gervasio", "comment_text": "The Fecciarossa is amazing from Rome to Naples then get a train to Sorrento"}, {"username": "Virgz Van Møøre", "comment_text": "You should me more nervous about the driver 😂"}, {"username": "Linda Miller", "comment_text": "Train is awesome!"}, {"username": "Lee Say Lor", "comment_text": "The train is super efficient and clean and comfortable"}, {"username": "Jenny Larsen", "comment_text": "The trains are fantastic clean fast . They even have cleaners ON a the trains cleaning during the trip."}, {"username": "Virginia Speedy", "comment_text": "If you think you'd be nervous about the train, you'll be s-------g yourself with a driver! Best stick to the train."}, {"username": "Melissa Feielin Hawkins", "comment_text": "Just ￼paid 600 to go from Praiano to our hotel in Rome last week. Had first class tix on the bullet train and 1/2 way to Naples the train employees went on strike. Guess it’s common there.\n\nOur driver was awesome though. The Hotel we stayed out arranged all our transportation while there. Keep in mind private drivers in luxury cars have 10plus years experience as drivers after completing Italy bus driver and taxi services. So to me considering how bizarre driving in the villages are and in Rome it’s worth the $."}, {"username": "Katie Hardman", "comment_text": "Train from Rome to Naples then driver to Sorrento"}, {"username": "Mike Ball", "comment_text": "The trains are fine and it’s a very straightforward\njourney. Rome to Naples then Naples to Sorrento,\n\nMuch cheaper than hiring a driver."}, {"username": "Jason Hobel", "comment_text": "No issues with the trains. The high speed trains are a smooth ride and easy to navigate in the train stations. We used the trains all the time"}, {"username": "Steve Grossman", "comment_text": "If you can lift your luggage onto the train there's nothing else to worry about. You're talking about spending hundreds of extra dollars to go to the same place"}, {"username": "Anne Mc Namara", "comment_text": "Get the train. So much cheaper. We got the Train from Naples to Sorrento. Really nice journey. Don't waste money on a driver. Italy is very expensive and a trip like that would cost so much. Save the money and use it for beautiful food and boat trips from Sorrento to Capri, Almafi and Positano"}, {"username": "Felicia LoCascio Whitney", "comment_text": "Driver on Rome"}, {"username": "Michelle Russell", "comment_text": "Trains are great"}, {"username": "Edel Robbins", "comment_text": "Trains are so easy and great 😊 just remember to validate your paper ticket. We used the Trainline app 👍"}, {"username": "Alex Kovacs", "comment_text": "Train from Rome to Naples is easy - recommend getting a private driver from there. (Guemar travel or joe bananas)"}, {"username": "Dennis Comfort", "comment_text": "Trains are great save the money"}, {"username": "Marika Radich", "comment_text": "Trains are much cheaper and easy to book online or at the station . Seats are comfortable ."}, {"username": "Jennifer Piovesan", "comment_text": "Use Transferelax from Sorrento to Naples and then take the train to Rome. It was so nice (and air conditioned)"}, {"username": "Terry Spincic", "comment_text": "You must be reach person soon you looking for driver 200+km to Sorrento. Helicopter is cheaper"}, {"username": "Lisa Walkow Bonchonsky", "comment_text": "We took the train from Rome to Naples last month. Booked tickets in first class. It felt super safe and was very inexpensive. It was a good experience. We use Transferelax for transportation from the Naples train station to Sorrento. They were very reliable and reasonably priced."}, {"username": "Tiffany Hadfield Merrill", "comment_text": "Train was very easy. And I’m a stresser!"}, {"username": "Carole Tarlap", "comment_text": "I used The Sorrento Shuttle last year. shuttle@dtservi\nce.it They were wanting for me with a sign when I got off the plane after going through all the stuff you go there. We made a bathroom/ snack stop in the way. 👍👍❤️"}, {"username": "Eileen Marum Armitt", "comment_text": "We use \"Jack the Driver\". Just google him!"}, {"username": "Renee Kremesec", "comment_text": "The high soeed train us just wonderful"}, {"username": "Jennifer Sadutto McKay", "comment_text": "Literally just took the train, so easy and great. More comfortable than flight."}, {"username": "Carmela Siniscalchi Frattellone", "comment_text": "Do not be nervous about the train. I used it 2x last month. First going from Venice to Florence and the second going to Florence to Naples. It's super easy and comfortable."}, {"username": "Mary Brown", "comment_text": "What are you nervous about taking the train?"}, {"username": "Pong Ac Ai", "comment_text": "In the train make sure your eyes always with your stuff and don’t ever sleep it’s just a one hour travel from Rome to Naples"}]}, {"id": "2194729700926108", "text": "Hello!! Planning to stay in Rome, we’re landing in the airport FCO which hotels are good to stay at that would be close to the Colosseum?\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2194729700926108/", "likes": 0, "comments": [{"username": "Cheri Arrowood-Stanziano", "comment_text": "There are some super nice VRBOs right up street from Coliseum. We stayed at one for a week, 1700. We used Express Shuttle and for our ride from the VRBO to airport for 2 ppl, it was 35 euros. We walked everywhere after first taking the Hop on bus to get lay of land….walked 8-12 miles a day"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2194728410926237", "text": "Hello, we are a family of 4 ( 2 adults, 11 yr old, 15 yr old).\n1 - is it worth going to Sardinia ? We are going to Sicily. Is it worth going to both?\n\n2 - how does Sardinia compare to Amalfi Coast? For those who have been, which one do you prefer please?\n\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2194728410926237/", "likes": 0, "comments": [{"username": "Danielle Pearce", "comment_text": "Bump"}, {"username": "Kay Rendall", "comment_text": "If u have children then the beaches in Sardinia would probably be better. White sand and clear water on most beaches. Where as Amalfi Coast is grey sand and lots rocks that people jump off. Have been to both, and stayed 3 weeks in Sardinia, but didn't stay in a beach area itself, so can not recommend.\nI personally love the Amalfi Coast, but dont go to the beach to swim.\nPuglia has some lovely beach areas. Closer to Sicily"}, {"username": "Kay Rendall", "comment_text": "If u just went to 1 area then a few days perhaps, but not sure how difficult to get around by public transport. I spent 7 days Alghero\nIn the old town, flew in direct, some nice beaches 5 min bus ride with chairs or some beautiful ones more deserted further away. Some tours to do. 5 days Olbia, not recommended. 8 days Calghari. Great town to explore, then flew out.\nBelieve there r great beach areas between these. Travelled by bus, train."}, {"username": "Kay Rendall", "comment_text": "Happy to help. Travel Italy every year prior to covid, as a 70 plus female, solo, so many people have helped me enjoy my travels.\nBack in August for 11 weeks. Enjoy, relax, Italy is so magic"}]}, {"id": "2194725124259899", "text": "Help please. May 2024\nFlying into Rome, staying 3 nights pre cruise. Cruise finishes in Venice. Unsure where to go from there, flying out of Milan 5 days later. we are a couple in our 50’s. Thinking 2 days Venice. Looking for a slower pace or something different for last 3 nights.\nAppreciate any recommendations as my head is 😵‍💫😵‍💫", "link": "facebook.com/groups/1373361046396315/permalink/2194725124259899/", "likes": 3, "comments": [{"username": "Pamela Dorigo", "comment_text": "Hi, perfect staying 2 days in Venice, if you really want something relaxing you can travel to the Prosecco hills in a hotel or b&b with pool, May is not a busy moment and you will find surrounded by hills, green, prosecco vineyards, a lot of relax and food to enjoy. Or you can stop maybe in a quiter city like Verona or Garda Lake. May is the perfect month, not too hot and not too crowded but already all is open."}, {"username": "Glenn Todd Webb", "comment_text": "2 days in Venice. Go to Milan for 3. Day trip to Stressa on lake Maggiore to see palazzo Madre and palazzo Borromeo."}, {"username": "Robyn Lawson", "comment_text": "Go over to Lake Como C and Bellagio for a few delightful days. 😊"}, {"username": "Tony Mancini", "comment_text": "I would definitely see the last supper in Milan and the Duomo. Also do some shopping there. Venice is a unique city and very special."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Stay in Venice. There is so much to explore there besides the top tourist attractions. Train to Milan a day before flying home."}, {"username": "Louise Wilson", "comment_text": "3 nights in Milan would be ideal for a tour of Milan's important sights, especially the original fresco \"The Last Supper\", then take a 1 hr. train ride to gorgeous Lake Como, for 2 nights. Rick Steves website has a great video \"Milan to Lake Como\" by train, and his fave hotel in the village of Varenna. Go by ferry to tour all the beautiful villages - especially Bellagio. Ask the captain of the ferry to point out the lakeside villa of George and Amal Clooney :)"}, {"username": "Tina Johns", "comment_text": "ok thanks for your suggestions.\nGoing to head to lake Como.\nAny suggestions on nice small hotels/b and b’s?\nIs it best to hire a car from Venice or take the train?\nThanks for your input 🥰"}, {"username": "Elena Eckley", "comment_text": "Stay in Venice see Murano, Burano and Lido at your leisure"}]}, {"id": "2194723857593359", "text": "Hi all, just curious if anyone has taken the train from Munich to Rome…? We know it will be long, but we thought it would be a nice to go through the Alps and see the Italian countryside. I imagine that most people would fly.", "link": "facebook.com/groups/1373361046396315/permalink/2194723857593359/", "likes": 0, "comments": []}, {"id": "2194723014260110", "text": "Has anyone taken the train from Nice to Santa Margherita?", "link": "facebook.com/groups/1373361046396315/permalink/2194723014260110/", "likes": 0, "comments": []}, {"id": "2194717334260678", "text": "I’ve seen videos of hand crafted sandals being made in Capri. Is this a thing anywhere else in Italy? I’d love to do it but not planning on visiting Capri this trip.", "link": "facebook.com/groups/1373361046396315/permalink/2194717334260678/", "likes": 2, "comments": []}, {"id": "2194715987594146", "text": "Going in September, planned everything with Travel by Luxe, very happy with what they offered us👍", "link": "facebook.com/groups/1373361046396315/permalink/2194715987594146/", "likes": 0, "comments": []}, {"id": "2194715367594208", "text": "I am planning a trip to Italy for next May 2024.\nWe are flying into Rome and home from Venice. We want to go to Florence and the Cinque Terre also.\nWe will be taking trains from city to city.\nSince I am not familiar with the train system does it make sense to go from Rome to Florence to Cinque Terre to Venice?\nOr Rome to Cinque Terre to Florence to Venice?\nI would like to use high speed trains if possible.\nThank you in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2194715367594208/", "likes": 8, "comments": [{"username": "Agnese Arnó Ch-Ch", "comment_text": "Io would do Rome, 5 terre, Florence, Venice."}, {"username": "Marisa DePalma", "comment_text": "Take a tour\nSo easy &\nWorth it"}, {"username": "Maria Laura Del Pace", "comment_text": "Oh yes, that's possible with high speed trains! I'm not sure about reaching 5 terre by high speed trains, but I guess you can go to Genova or La Spezia (in the same region) with a high speed train and then take a slower one to reach the coast :)"}, {"username": "Isabella Banfi", "comment_text": "That’s perfectly doable! You can use high speed train from Rome to Florence, then train from Florence to La Spezia and from there the train that goes to Cinque Terre. From Cinque Terre you go to Genova and from Genova to Venezia (this one is not a high speed train, it takes around 4h). Just check the possible itineraries on the Trenitalia website ☺️"}, {"username": "Dennis Comfort", "comment_text": "I don’t think high speed trains go to Cinqe Terre. We did take one from Naples to Florence. Quite nice."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "I would do Venice first, then CT, Florence and Rome."}, {"username": "Steve Grossman", "comment_text": "Your first route that you mentioned is the 1. 2 follow"}, {"username": "Steph Craddock", "comment_text": "Rome to Florence (you would have to change trains anyway at Florence) Florence - 5 Terre ,- Venice"}, {"username": "Aurélie Esposito", "comment_text": "It take 2 hours to go from florence to cinque terre ! There is a stop at Pise if you want to see the tower !"}, {"username": "Claudia Amp", "comment_text": "Roma, 5 Terre (train from Rome to LaSpezia) then go to Florence and from there take fast train to Venice."}, {"username": "Claudia Amp", "comment_text": "You can also get to the 5 Terre with a direct train from Rome; Intercity or Frecciabianca trains going to Genova or Milano from Rome sometimes stop in Monterosso. Or just take Frecciabianca or Intercity from Rome to LaSpezia directly and take the express to 5 Terre"}, {"username": "Merilice Finateri", "comment_text": "We went from Milan to Santa Margherita to LA Spezia to Rome. U can go either way"}, {"username": "Alexandra A Welker", "comment_text": "Yeah, you can do that route, in that order. The train is super easy and has lots of time options."}, {"username": "Simone Pfenninger", "comment_text": "Rome-Florence-C\ninque Terre-Venice"}, {"username": "Joy Divine Sholty", "comment_text": "This is exactly the same itinerary I'm using in October. I've been concerned I'm trying to cover too much. Flying into Rome - Florence - CT - Venice using trains. Someone else I know went to CT several years ago on a Viator tour. I can't find the same one which included train and boat round trip. Does anyone know a tour like that and who runs it?"}, {"username": "Lisa Zarlingo Smith", "comment_text": "Rome to LaSpezia/\nCinque Terra, to Florence, to Venice - I did basically the opposite in June 2022 and it was PERFECT. Rome to La Spezia would be the longest trip (3-5 hours depending on train) - then to Florence is 2- 1/2 hours and to Venice is about 2- 1/2 hours."}, {"username": "Loredana Polichetti", "comment_text": "Roma, Firenze, cinque terre and Venezia"}, {"username": "Bennett Richards", "comment_text": "Yes. Bullet train. Was just on one 2 months agoGreat."}, {"username": "Daniel Michael", "comment_text": "Words alone won’t express how thankful I am to you and to your platform. It has been a good opportunity for me and my family thank you. Mr Luke Donald"}, {"username": "Nadia Nadia", "comment_text": "I was told by a travel agent ythe best way is Rome to La Spazia (I am going to be staying there and train/ hike to other villages) so not to lug my luggage. Then to Florence because of train paths , she suggested I place cinque terre before Florence,"}]}, {"id": "2194709414261470", "text": "looking for suggestions for the best backpack to take (we are traveling with one european carry on and one backpack each) my husband's backpack is too big.\nFeature:\n-slash/cut proof/less likely to be stolen\n-small enough for airplanes/trains\n\ndo these exist?", "link": "facebook.com/groups/1373361046396315/permalink/2194709414261470/", "likes": 0, "comments": []}, {"id": "2194699214262490", "text": "Looking for some good 3 star hotel recommendations in Rome and Venice please? Planning to spend 3 nights in Rome and 2 nights in Venice.", "link": "facebook.com/groups/1373361046396315/permalink/2194699214262490/", "likes": 0, "comments": [{"username": "Karon Patterson", "comment_text": "We stayed in Lido next to Venice which I highly recommend and the Hotel was excellent and it’s called Hotel Rigel, wonderful"}]}, {"id": "2194698940929184", "text": "Going to Italy in October. How far in advance do you recommend reserving train tickets? I hear to lol at trenitalia and Italo and compare prices.", "link": "facebook.com/groups/1373361046396315/permalink/2194698940929184/", "likes": 5, "comments": [{"username": "Jennifer Gadaleta", "comment_text": "I'm after the same information for trains and tours ect"}, {"username": "Victoria Laverty", "comment_text": "Earlier the better as price goes up\nItalio not government owned\n\nBook direct through company\n\nFirst class more room bags"}, {"username": "Jason Hobel", "comment_text": "I booked my tickets two months ahead. I am not sure if you can book earlier than that. You can also sign up for their newsletter and they sometimes offer discount codes too. I used Italo because it suited my schedule better."}, {"username": "Carmine Castiglia Jr", "comment_text": "I'm willing to accept the *possibility* that it may be a good idea to reserve train tickets in advance of high tourist season - like right now. But, October?\n\nFWIW, we have never purchased train tickets in advance and have never not been able to get on the very next train, whether a local train or a high-speed train between major terminals such as Rome-Florence-B\nologna-Milan-Ve\nnice."}, {"username": "Corina Cristea", "comment_text": "Some days ago"}, {"username": "Miyuki Kanno Paul", "comment_text": "I purchase train tickets in advance only if I know what I want a very specific car and the departure time. For example, certain early morning and evening trains tend to sell out due to popularity among business travelers."}, {"username": "Reshma De Cruze", "comment_text": "I just got back and purchased tix the day before or in some instances on the day. Didn’t have any issues."}, {"username": "James Johnson", "comment_text": "I booked tickets on Italo a couple months ago. Now the same exact trip is about $42 more. So the earlier the better it seems."}, {"username": "Pam McIntyre", "comment_text": "We don't usually book trains too far in advance, but saw they had low stock of the \"me and you\" sale on trenitalia for Sept so I took advantage and booked all of our national city to city trains. We'll book any regional ones at the time. However, it looks like we'll have a problem on the 24th of September with a Trenord strike in Lombardy. We have tickets on the Bernina Express for that day and need to get to Tirano from Varenna 😫"}, {"username": "Rita Levi Montalbano", "comment_text": "You can buy them even a week or a day before, you dont need to be so provident"}, {"username": "Neekita Naidu", "comment_text": "I’m here now and I’ve booked everything a day before or on the day. Being peak season I have found the Italy trains to be better than the French for the long Trips get the reserved seat."}, {"username": "Ilaria Giorgulli", "comment_text": "for high speed trains the earlier you book, the less you pay. It’s 100%sure that purchasing whitin the same week prices are higher. Go for a flexi fare, so you can change day/time. And yes, look both Italo & Trenitalia to find the best offer"}, {"username": "Tracey Purdy", "comment_text": "We go sept and Oct and I purchased ours over a month ago."}, {"username": "Jane Wilson", "comment_text": "I was looking at Trenitalia site last week and getting ideas of routes, prices, classes etc and then booked yesterday (so week later)\nI noted definite increase in fare prices. If you know where and when you want to travel, probably pay to lock it in earlier if you want to save some 💶💶"}, {"username": "Grace Monaghan", "comment_text": "Im here now and have just booked a few days before… havent had a problem."}, {"username": "Peter Davidson", "comment_text": "While standing on the platform using a phone."}, {"username": "Voula Ladas", "comment_text": "I’m using the trains in October, and have already purchased my tickets. Purchased a flexible ticket though so I can change dates if I need to . I just like to be organised . Buying in advance also saves you some money, but I’m fairly sure you can buy tickets closer to your departure date without issues in October. Enjoy your travels ."}]}, {"id": "2194695544262857", "text": "Good evening from Canada.\n\nA transportation question for you Italy lovers.\n\nIs there an easy way to get to Varenna from Valpensa airport? We will be tired after the flight so I want it easy. I found a direct train to Como, so I decided to stay in Como. I’m asking just in case there is something I just couldn’t find. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2194695544262857/", "likes": 0, "comments": []}, {"id": "2194694817596263", "text": "We will be driving from Conegliano to Barolo in October. Looking for a small village to stay along the way. Not fans of big cities- thanks in advance", "link": "facebook.com/groups/1373361046396315/permalink/2194694817596263/", "likes": 0, "comments": []}, {"id": "2194694150929663", "text": "Ok, I downloaded the two train apps. We will be traveling by train 3 times while in Italy. Both companies have travel pass options.\n1. Good option?\n2. Does it mean your tickets are free for the amount of times you purchase your pass for?\n3. Does it mean you can book closer to riding since you do not have to worry about specific tickets. I assumeआणखी there is a way to check seat availability along the way so if filling up, you can book? Are their limitations to where you can go?\n\nThank you. I did try the search bar and didn’t see anything specific to my questions.", "link": "facebook.com/groups/1373361046396315/permalink/2194694150929663/", "likes": 0, "comments": [{"username": "Stacy Derouin", "comment_text": "Our hotel had a shuttle pick us up, so if you're staying in a hotel, that's a great option. Outside of that, taxi definitely."}, {"username": "Rhona OConnor", "comment_text": "I just booked 3 days in advance and had no problem. There was always free seats. There are lots of trains..... But I was not in Rome or the very busy places everyone appears to go to."}]}, {"id": "2194664180932660", "text": "Im researching a lot about transportation and I'm finding that it can be stressful to use the train system especially with luggages. We prefer to rent a car, but heard that the roads are dangerous everywhere in Italy. How does everyone do the transportation visiting city to city? We plan to stay 3 days in each city, but don't want the hassle of trains and carrying luggage. How does everyone do it?...please help, because I'm almost ready to throw in the towel altogether with planning the trip because of stressful transportation.", "link": "facebook.com/groups/1373361046396315/permalink/2194664180932660/", "likes": 16, "comments": [{"username": "Greg Saba", "comment_text": "What is your itinerary? We have rented and leased cars many times. Driving in Tuscany, Umrbia, Puglia, Sicily, Sardinia, Calabria, Campania, Marche and areas along the Adriatic, Dolomites, some lake areas, and from large city airports to those places quite easy. We don't drive in Rome, Florence, Naples, Amalfi coast. We had a car in the Italian Riviera and parked it for a week because trains were more convenient and no parking issues. Also easy to combine cars and trains or other public transport. I suggest you whittle down your luggage. We have traveled easily all over Italy and Europe, sometimes for months at a time each with one small carryon (to meet European discount carrier limits) and one backpack, and we never wear everything we bring. In the smaller towns, we have always found parking a short walk from our accommodations,\nand not an issue with limited luggage."}, {"username": "Jill Medrano Casey", "comment_text": "Use the trains! They are easy to navigate and then everyone gets a break. My husband is usually our driver and loves driving, but he was so happy to be the passenger and enjoy the views from the train."}, {"username": "Katie Osterman-DiBlasi", "comment_text": "Having big luggage can be annoying on a train, but we were always one of the first ones on the train at the station and my husband could throw my big luggage in the overhead area. I saw other people getting help from others around them though. There’s also luggage storage behind the seats, we slid my husbands medium luggage in btwn. What’s more annoying with a big luggage is walking with it through the city to your hotel in my opinion"}, {"username": "Alla Pechersky", "comment_text": "Trains are so much better than car. We rented a car for one stretch of our trip and didn't enjoy it all. Parking is stressful, driving is stressful, btw cars are mostly manual transmission not automatic. Cars are much smaller here, maybe problematic with suitcase and if you get a bigger car, then the issue with parking and driving is more problematic. Also filling up with gas or diesel is also very expensive.\nTrains are extremely comfortable, spacious and relaxing."}, {"username": "Douglas Godesky", "comment_text": "We drove ~ 1000 miles over 10 days (1 to 3 nights per town), and had zero issues, in fact driving gave us so many more random diversions that we would regret is we had missed those towns and sights, as well as ability to stop at an Italian highway rest stop, you should not miss them, great food cooked by real people, bargains, as well as simply a fun experience. We drove everywhere, highways, small and large towns, etc., just planned the parking in advance to the extent possible and even parking was not hard. Zero stress, oh, well, getting used to the toll booths, one time we thought the bucket took cash and with stress learning how to use the tool booth threw in a $10 Euro and jammed up the machine! I doubt we would ever bother with trains, fun yes, but far too captive to so many issues, limitations, etc. Car = freedom."}, {"username": "Sandra Timi", "comment_text": "We are driving soon again but you do need to plan ahead of time. Know your “no go zone” areas and if you need to enter to go to your accommodation, for example, advise in advance for an exemption. Know some basic road rules, if there are odd/even drive days, drive at your speed, have an international driving licence, prepare to know where to park and/or prepay parking where you’re going but most of all have fun. We always have fun and have had no issues."}, {"username": "Brent Chapman", "comment_text": "The roads are not dangerous everywhere. I’ve driven a lot of places there with no problem. It’s actually much better than in the US because people actually follow you the driving laws for the most part. My last trip we went to the Amalfi coast and didn’t drive there because of what I’d read, but the trains and boats to get there was easy. I wouldn’t hesitate to drive anywhere else. Just be careful and look at the rules of each town to make sure if you can drive into the city center or not."}, {"username": "Rebecca Arey", "comment_text": "We took the trains everywhere. It was super easy and the trains are full of other people carrying luggage. We took a carry on suitcase and a backpack. There are overhead storage racks on trains as well as stori mg things in between seats. Usually only a couple of stairs getting into stations or there’s ramps if you need them. Honestly don’t stress about this part. It was the best thing we did to get around"}, {"username": "Sandi Van", "comment_text": "Taking the train gave us the few hours to rest .. especially we were going different places every few days"}, {"username": "Rita Sanza", "comment_text": "I'm here now and I'm using the train. First class and book before. No problems. I was born here and I definitely would not drive"}, {"username": "Claire Buccini", "comment_text": "Driving requires confidence and vigilance to stay out of the fast lane. Parking is what it is, but with planning you can easily handle it. If inside rome city centre you definitely don't need a car so maybe plan your visit to suit."}, {"username": "Cheylynn Parker", "comment_text": "Trains"}, {"username": "Nuno João Teixeira", "comment_text": "I traveled with fresccia rossa and no problem."}, {"username": "Mark Williams", "comment_text": "Use first class or business class on the trains and you're golden. If executive class is in the budget that's even better. Just don't skimp out with the cheapest possible options and it'll be a breeze"}, {"username": "Steph Haggarty", "comment_text": "The trains are really easy. Just give yourself enough time so you’re not rushed."}, {"username": "Carol Taylor Tisdale", "comment_text": "You’ve received tons of great advice! We’ve done both and love both. Google You Tubes about going through toll booths and about parking and garages. The only place you don’t drive into are the big cities. The train system is awesome and again there are some you tubes addressing particular train stations. Luggage is not an issue on trains if you just don’t carry lots of bags or really heavy ones. It’s an adventure and whichever way you choose - you’ll return having learned lots and then will be the ones offering up advice!!"}, {"username": "Michele Drozdowski", "comment_text": "We’re here now-rented a car. Just make sure you pick automatic if you cant drive stick. Side roads can be very narrow."}, {"username": "Kristin Bawden Larson", "comment_text": "Just got back last night! After coming from Paris, we stayed in Venice, Rome, and in the Sorrento area!\n\nThe driving may not be dangerous…. We didn’t see one accident while we were there…. But I will say, it’s very different than in the states. I love driving, but I am not sure I’d feel comfortable driving in many places where we were. Many streets were tiny, one ways switch to two ways and then back, tons of mopeds and scooters going in and out of the cars…. And the times we had hired drivers, I followed along with Google maps- and it would have taken us twice the time to get anywhere without knowing the “local” ways to get there.\n\nWe found the trains to be awesome for our family of 6. What worked best for us was to prebook transportation (many people I found on this page or through Vrbo owners) when we first arrived in a city. So someone met and took our family to where we were staying in each city. Took out a ton of the stress!! Then, once we leaned the city’s train system, it was super easy to travel locally that way and then take the train to the next city. (Prebook trains between cities)\n\nIf you’re going anywhere we went, let me know if you’ve got any questions about our trip 🙂"}, {"username": "Nancy Brennan Carrow", "comment_text": "We were a bit nervous but the fast train was very easy from Naples to Rome. Get there 20-30 min early, the board will show the platform # for your train about 15 mins before boarding. Then, go to that platform and board the train. We got business class so we had plenty of storage space and business class only costs a few dollars more. We loved the train."}, {"username": "Catherine Hatfield-Fuster", "comment_text": "We did trains and private transfers to the trains from the hotels. It was really not a big deal."}, {"username": "Kerry Stutzman Karl", "comment_text": "I’m hitting multiple cities now. TRAINS are the way with a few dollops of taxi rides, depending on distance (ie, from station to hotel or vice versa)\nAnd carryons. I would NOT tote heavy baggage!"}, {"username": "Amy Sandler Riemer", "comment_text": "We’re going to 6 places and planning on using train. Going to each take a carry on and backpack or small bag that goes on carry on handle"}, {"username": "Mike Laudick", "comment_text": "I cannot say that I have ever had a problem on an Italian trip driving or taking a train. However if you are bringing 3 suitcases each that may be a problem on a train.\n\nI would not recommend during in Florence, Rome, Naples or Palermo."}, {"username": "Iris Joan Price", "comment_text": "Trains, but if you rent a car, you can go to places that are not served by trains. If you are able to afford it, hire a private car with a driver that speaks English and can serve as a guide. I have friends who did that for their entire trip last year. Not something my own budget would allow, but may be the answer for you. Other than that, booking an all inclusive tour where they take you to set places by tour bus and arrange everything seems like it would alleviate your concerns and is the reason such tours are so popular and numerous. Then you can relax about luggage and transport and just enjoy the sights."}, {"username": "Jason Hobel", "comment_text": "Use the trains, it is the easiest way to get around Italy and the fastest too. Italy is an adventure in so many ways. Don't stress about it, go have fun and live life."}, {"username": "Irene Oda", "comment_text": "It depends on which cities you plan on visiting. What's your itinerary. Some cities like Florence- no need for car. Trains are by far the easiest. Driving isn't hard but you have to have your wits about you. It's also different driving in north than the south."}, {"username": "Phyllis Snyder", "comment_text": "Maybe rethink your packing? Reducing your luggage? Train system is very efficient in Italy."}, {"username": "Pat Hooper-Bruins", "comment_text": "You could look into the option of a bus service. We used flexi bus from Sienna to Rome although the bus was travelling from Milan to Naples via Rome. It pays to book your seat. We had the two front seats of the bus and it was very comfortable."}, {"username": "Miyuki Kanno Paul", "comment_text": "We have no problem traveling with our big suitcases on and off the trains, ferries, etc. Two 26 inch suitcases, a 22 inch rollerboard, one duffle bag, and one tote. That’s how we travel in Europe. We only rent a car when traveling countryside or regions where driving is the best solution"}, {"username": "Shelley Bowen Glassman", "comment_text": "I loved the trains. But, with luggage it is a little tricky. We now get private drivers. Ask your hotels for referrals or your travel agent."}, {"username": "Chris Vilsack", "comment_text": "The Italian countryside is so beautiful. In the USA (if that's where you're from), we are always in a car. The train system in Europe is excellent, for the most part safe (keep your eyes peeled no matter what country you're in, and you have luggage around), and you get to enjoy the scenery as you train thru farmland, old towns, mountains, going by lakes, etc.."}, {"username": "Allan Olexa", "comment_text": "Trains are great…both high speed and local. Rural driving is easy. City driving is chaotic with little or no parking…don’t."}, {"username": "Helen Abbott", "comment_text": "I did my first Europe + first solo this year. Trains were truly fine even for this 60 year old. Would have been overwhelmed by navigating and parking."}, {"username": "Roger Pajo", "comment_text": "Trains, all day long. When planning from home it does seam daunting. When there you quickly realize how easy it was and laugh at how stressed you were while planning that phase"}, {"username": "Billy Stocklin", "comment_text": "Train is great and easy. Download app so you get gate # quicker. Thats the only stressful part until you get used to it but its really not a big deal."}, {"username": "Vera Feeny", "comment_text": "Trains may be stressful if you have a ton of luggage, but if you have an amount that is easy to carry & pull you should be fine. Trains generally had room for luggage above and behind seats and there were larger racks for big bags. Fortunately we were able to keep all our bags right by us."}, {"username": "Jim Hinckley", "comment_text": "Trains in Italy are great"}, {"username": "Kim Geary Keidel", "comment_text": "We found the trains were so easy! We don’t have public transportation like that where we live in US. I was stressed about it but it was great!!"}, {"username": "Steve Grossman", "comment_text": "The roads aren't one speck more dangerous than they are in the united states."}, {"username": "Karianne Earner Sparks-Dillaha", "comment_text": "The trains are really easy to use. Have you ever taken a train? If so, you can do this! If not, you can still do it. Many people travel in Italy with suitcases."}, {"username": "Dinah Slifkin Paritzky", "comment_text": "If you are really unhappy driving or taking a train, and you have the budget, hire a private driver"}, {"username": "Tracy Foss", "comment_text": "Trains are easy to go business class,unless you can afford to hire a private driver"}, {"username": "Jessica Petyo", "comment_text": "We just returned yesterday after being there for two weeks. Six of us used the trains no problem, and I was surprised how easy it was after reading comments before we left. It’s definitely helpful to have smaller bags and we only had a carry on suitcase and backpack for each person. We also rented a car for a week in Florence since we had a villa in Siena. Driving was no problem around Tuscany if you stay out of the city centers. All the standard map apps worked great - Google, Waze, and Apple. The hardest part was figuring out some of the public parking ticket booths since they were all different."}, {"username": "Lori Van Tassel Pinco", "comment_text": "We used the trains and had zero problems with 2 pieces of luggage plus 2 carry ons. We booked our trains in advance and always tried to do the earlier trains. We also booked business class. Cost a little more but was worth it.\nWe also made sure to get to the trains with plenty of time to spare. Cuts down greatly on the stress.."}]}, {"id": "2194692404263171", "text": "Hello all! Any suggestions of cooking class for a family of 4 in Florence.\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2194692404263171/", "likes": 1, "comments": [{"username": "Kim Catania", "comment_text": "Towns of Italy - Florencetown Cooking Class. Amazing! Market and bakery tour, then fabulous cooking class."}, {"username": "Rosa Palmer", "comment_text": "Accidental Tourist!"}, {"username": "Debbie DiOssi", "comment_text": "Pizza and gelato class on Viator. It was great. Right on the edge of Florence in the hills."}, {"username": "Jay Parekh", "comment_text": "Anyone take pasta making classes? Can they accommodate no eggs?"}, {"username": "Trinity O'Neal", "comment_text": "Are you staying in a hotel or airbnb type place?"}]}, {"id": "2194688324263579", "text": "Hi All, I promised to do this post on what I do to keep cool in the tropics where I live, far North Queensland Australia on the Great Barrier Reef and when I’m in Bali where I actually spend a few months aआणखी year. I’ve captioned the photos.\nI hope this information helps some of you that don’t handle the heat well. Good luck and enjoy your travels.\nThere’s the obvious things to do like wear a hat, sunscreen, which should be applied at least 30 mins or more before you go out so it has time to sink into your skin, if I don’t do this I find it just makes my face sweat more and runs into my eyes. It can sting. So apply early.\n\nDon’t worry about your bare arms, who cares, it’s too hot, I’m 65 and my arms show their age but in the heat I won’t wear a sleeve, t shirts etc because they make you feel hotter. Go sleeveless and if you want you can put a super light scarf over your shoulders. A small travel umbrella is great also to keep the sun off.\nCheers\nKim 🌸", "link": "facebook.com/groups/1373361046396315/permalink/2194688324263579/", "likes": 104, "comments": [{"username": "Bethanie Kingston", "comment_text": "a wet frozen face washer is the aussie dream."}, {"username": "Trista Negrete", "comment_text": "Thank you so much for these GREAT tips! What a kind & helpful person you are to take the time to share your ideas!!😎"}, {"username": "Carolyn Esposito", "comment_text": "Great ideas. Thanks"}, {"username": "Trista Negrete", "comment_text": "Kira Negrete"}, {"username": "Leza Marinesi", "comment_text": "Yes! We do this with our cooling towels, especially when we just went to Walt Disney World in Florida. They worked great!"}, {"username": "Melaine Morrow", "comment_text": "Great ideas 💡"}, {"username": "Janis Hall Bockelman", "comment_text": "Great ideas!! Thanks"}, {"username": "Cynthia Waldrop", "comment_text": "I have one of these … similar to your cooler bag, but the sides are made of freezer gel packs. I put the bag in my freezer and then I can take anything that I need to keep cold (snacks) and bottled water and it keeps cold all day. I live in NC and play tennis in the heat. I also keep my cooling towels in here."}, {"username": "Deborah Moos", "comment_text": "I live in Germany and have owned 3 neck fans. Cannot cook in Summer without it. Wear it all over town while out shopping. Lifesaver!"}, {"username": "Georgeann Farinacci Greene", "comment_text": "Thanks Kim!! Took me a minute to figure out what a face washer was until I looked at the pics (wash cloth in the US). My bucket list to get to Australia & Bali someday!!"}, {"username": "Kim Butler Oam", "comment_text": "I should have mentioned that you wet the face washer r then freeze it. Sorry folks with Bethanie mentioning that I realised I hadn’t. 🙄😎"}, {"username": "Shirley L Jones", "comment_text": "These are also a Godsend! Filled with a gel, you can just wet them or put in the fridge for a real chill. They tie around your neck and cool you right down!"}, {"username": "Voula Ladas", "comment_text": "Hi Kim I like your ideas , especially the fan . With the ice pack idea ,do many of the hotels in Italy have a fridge that can freeze an icepack? I find even at home, the hotel fridges are not that cold ."}, {"username": "Mary Stinnett Boggs", "comment_text": "Thank you for these great tips!"}, {"username": "Andrea Willis", "comment_text": "Thank you for sharing your excellent ideas!"}, {"username": "Tracey Palombo", "comment_text": "Wow great tip. I’m definitely doing this😍"}]}, {"id": "2194684330930645", "text": "Any advice on train from Milan to Genoa, any Geona hotel recommendations for a short stay….. then heading toward Cinque Terra where we’re set up. Thanks!\nHappy travels everyone.", "link": "facebook.com/groups/1373361046396315/permalink/2194684330930645/", "likes": 0, "comments": []}, {"id": "2194677177598027", "text": "Can anyone recommend the best restaurant in Reggio Emilia?\nAnd best/cleanest laundromat?\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2194677177598027/", "likes": 0, "comments": []}, {"id": "2194676400931438", "text": "Given the current situation with the heat in Italy, is there a difference in the AC at US based hotels (Hilton, Marriott etc) vs a smaller Italian hotel. I understood there’s charm with the local hotels that may be missing but heading over in June and will be traveling with a 13 yo that doesn’t handle overheating all that well (plus hasआणखी hypoglycemia) and my 70+ mother. Would love to be able to head back to the hotel and cool off if necessary. We’ll be in Rome, Sorrento, Florence and Venice so might not be possible in all locales but I thought it might be worth asking", "link": "facebook.com/groups/1373361046396315/permalink/2194676400931438/", "likes": 3, "comments": [{"username": "Shannon Madison", "comment_text": "Yes . I found that the us based hotels had Better Ac. Italy ac is not the same as US ac , so just prepare for that too ."}, {"username": "Kathy Flood", "comment_text": "In vemice we stayed at the royal San Marco and the ac was amazing!!!"}, {"username": "Lori Ann", "comment_text": "Our ac has been great. All Italian hotels. In Venice, we stayed at Hotel Colombina."}, {"username": "Michelle Casillas", "comment_text": "Italian AC is not as strong as US. They usually have a wall unit that tries to cool the entire room instead of vents. Not to mention the windows don’t have the sealant that US does so heat comes in easier as well. So just know it doesn’t usually get as cold in the Italian hotels. I’ve stayed in all locations listed with comfortable temperature of AC in Italian hotels. But we also keep our house at 25c so it depends on what temp you’re accustomed to."}, {"username": "Eleni Koi", "comment_text": "You mention that you will be traveling in June. This is not a month of heatwaves or extremely hot days. The classical buildings that have been converted into hotels have so thick walls that no modern structure can compare to them in terms of how it feels inside. In such properties AC in June may not even be needed."}, {"username": "Meredith Sclafani Lacerda", "comment_text": "We are at Rosa Salva Hotel in Venice and the AC is wonderful."}, {"username": "Lyn Wise", "comment_text": "We are staying in tiny bed and breakfast and the air con is amazing..."}, {"username": "Kathy Gaston D'Amico", "comment_text": "We are at Al Codega Hotel in Venice right now. The AC is amazing, and the breakfast is fabulous! A great place!"}, {"username": "Heather Sechrist", "comment_text": "None of the places we’ve stayed so far would have worked for you size wise, but we actually look hard for older buildings with mini splits. It turns into a little ice box!"}, {"username": "Dayna Steinberg Cioffi", "comment_text": "We are used to sleeping at 66F in the US so we like it cold. AC was great at Splendid Venice, Grand Hotel Minerva in Florence and D’Inghlittera in Rome. Parco di Principi in Sorrento took a day to get cold and is now great. Some hotels control the ac centralized so even though you have thermostat in room it may not get as cold. We are here in the heatwave."}, {"username": "Frank Hunt", "comment_text": "Yep, AC usually works in big US hotels……"}, {"username": "Michelle Solak", "comment_text": "We stayed at a boutique hotel in Rome and the AC was strong and perfect! No problems."}]}, {"id": "2194675917598153", "text": "Any hotel recommendations in Florence?", "link": "facebook.com/groups/1373361046396315/permalink/2194675917598153/", "likes": 1, "comments": [{"username": "Maria McGill", "comment_text": "Hotel Perseo Firenze"}, {"username": "Lori Sammons", "comment_text": "Thank you. 😊"}, {"username": "Meredith Williams", "comment_text": "we loved Plaza Hotel Luchessi"}, {"username": "Rebecca Resic-Pittorino", "comment_text": "Hotel cavour"}, {"username": "Lynn Francisco Casella", "comment_text": "Always Hilton"}, {"username": "Mélanie Côté", "comment_text": "In case you are open to AirBnB, fantastic location, great host and beautiful appartment!\n\nhttps://\nabnb.me/\nSxwCp6EKxBb"}, {"username": "Jerry Lyubelsky", "comment_text": "We just stayed at Strozzi Palace for 3 nights. It’s close to everything, it’s a boutique hotel and they offer breakfast."}, {"username": "Debbie DiOssi", "comment_text": "Tornabuoni Suites or Ponte Vecchio Suites"}, {"username": "Suzi Gioffredi Lincoln", "comment_text": "We’ve stayed twice at Hotel Torre Guelfa. LOVE!!"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2194674830931595", "text": "Anyone with experience of 10 days \"Italian Scene\", by Costsaver-Costco?", "link": "facebook.com/groups/1373361046396315/permalink/2194674830931595/", "likes": 0, "comments": []}, {"id": "2194655947600150", "text": "Hi everyone!\n\nDoes anyone have any recommendations for opera in Rome and where to buy tickets?", "link": "facebook.com/groups/1373361046396315/permalink/2194655947600150/", "likes": 0, "comments": []}, {"id": "2194654770933601", "text": "Hello,\nI have visited: Lucca, Pisa, Florence, and tomorrow, Viareggio. I have two kids, one almost 3 years old and other one 8 years old. Could you please give me a suggestion where to go to? We had planned to go to Cinque Terre. However, it is so hot and going around with the kids “only” for the sightseeings, not doing an fun activity with them, that we are more likely to giving up Cinque Terre. Any advice will be welcomed. 😊", "link": "facebook.com/groups/1373361046396315/permalink/2194654770933601/", "likes": 0, "comments": []}, {"id": "2194653387600406", "text": "We will be arriving in Rome around 7am. I'm wondering about taxi availability early morning. The hotel said they could arrange car service for 100 euros. This seems pricey - maybe? We are staying near the Trevi fountain.", "link": "facebook.com/groups/1373361046396315/permalink/2194653387600406/", "likes": 16, "comments": [{"username": "Patti Porter", "comment_text": "That’s not that early, plus you have get luggage plus thru customs"}, {"username": "Mik Long", "comment_text": "Get the train from the airport. Depending on the time you want to travel, it will cost betwen €8 and €14 !!!"}, {"username": "Karoline Bakker", "comment_text": "Flat rate is € 50"}, {"username": "Bonnie Loftspring", "comment_text": "Taxis are very aware of when flights are coming in, you won’t have any problem, but go through taxi line"}, {"username": "Lisa Quinn", "comment_text": "Download the app “my way“ and do a rideshare.\nBut also, taxis are pretty easy from Termini and the Trevi fountain is only a 10 minute right away. It shouldn’t be more than €15 at that time in the morning. I just did all of it last week. ￼"}, {"username": "Laura Nausadis Bieber", "comment_text": "I would say since you’ll just be arriving and you’ll have your luggage and you’ll be tired it would be great to have a nice car waiting for you to bring you to your hotel. At least that’s what we did and it was wonderful. Have a great trip!"}, {"username": "Rita Kanten", "comment_text": "Ignore everyone telling you to take a bus, or a train or the subway. If this is your first trip to Rome all of that can be a bit confusing and getting your luggage thru can be difficult. 7am is not early for taxi. There will be a line of them outside the airport. Do not pay your hotell 100 euro. As others have said, 50 euro is the flat rate. Enjoy your visit!"}, {"username": "Jill Cox", "comment_text": "Train!! Goes right to termini"}, {"username": "Mary Paron", "comment_text": "Taxi $50 max anywhere in Rome. It’s regulated"}, {"username": "Janice Rea", "comment_text": "Yes. There are taxis. Take the car service. It is worth it. Taxi lines are often very long!!!"}, {"username": "Tom Duffy", "comment_text": "Take the Leo Express to the Roma Termini train station then taxi or walk to your hotel...if your Hotel is near Trevi then it is only a short walk."}, {"username": "Leah Canady Raney", "comment_text": "We paid 70 euros for a black car service. It depends on how much luggage and people."}, {"username": "Stella Dee", "comment_text": "Taxi is a flat 50 euros"}, {"username": "Kay Rendall", "comment_text": "Romecabs for transfer. Book on line. Reliable. Same price as taxi from rank and no hazzles"}, {"username": "Kim Schmanke", "comment_text": "Our party of four took a taxi from FCO to city center. The rate is regulated at 50€. If you get in line at the airport, you should be getting a legit, regulated taxi. You may need to wait for a larger vehicle to join the line to accommodate all your luggage, however. Taxis should accept credit card but some seem to play a scam that their card reader isn’t working. Agree upon entry thr payment method. Or have euros handy. Enjoy!"}, {"username": "Daniel Michael", "comment_text": "Words alone won’t express how thankful I am to you and to your platform. It has been a good opportunity for me and my family thank you. Mr Luke Donald"}, {"username": "Jono Roland", "comment_text": "We used Uber which usually sends a taxi but at least the price is paid for up front and you don’t have to pay cash for a regular cab."}, {"username": "Peggy Felix", "comment_text": "If you don’t want the uncertainty of getting a taxi, book welcomepickups.\nFor € 89 the driver will wait at the arrival hall with your name and drive you in a Mercedes van. Worth it if you like convenience."}, {"username": "Theresa Skipper", "comment_text": "We used Welcome pickups to arrange transfers both ways, polite helpful drivers, reliable. Recommended"}, {"username": "Ellen Edmonds-Wilson", "comment_text": "Plenty of taxis at that time. It’s a fixed fee to central Rome. Just get a taxi."}, {"username": "Jenny Payne", "comment_text": "Go on line and order a driver , I pay €50 from airport to my hotel 🌻"}, {"username": "Chris Brennan", "comment_text": "The first taxi ride from the airport into Rome you take, will be a major white knuckle experience! I spent half the time with my eyes closed. They love tailgating."}, {"username": "Diana Himes", "comment_text": "Taxi is a flat 50 Euro. The train is 14 Euro per person to Termini. Just make sure you count out your money to the taxi driver out loud so that it’s clear what you are handing him or her. The biggest taxi scam is when they claim you handed them a smaller bill than you did and then demand more money. Also, if they get your luggage out of the back and then ask you to come back to the cab interior to pay, that is part of their scam as they will separate you from witnesses during the money exchange. Generally, taxis are safe and reliable but it’s important not to set yourself up to be taken advantage of."}, {"username": "Nancy Vahl Raske", "comment_text": "50 euros at airport for 4 people"}, {"username": "Michelle Cutrone Van Duyne", "comment_text": "100 euros is cheap. Isn’t it easier after a long flight to have someone waiting with a name sign, assist with luggage to a comfortable car with wifi and water bottles?\nor\nDo you prefer to have to carry your luggage in extreme hot temperatures to wait on a long lines and get in a dirty taxi to save 40 euros?"}, {"username": "Cheryl Swiatko", "comment_text": "Plenty of taxis available at this time of day."}, {"username": "Jenn Ds", "comment_text": "The other tip is download the FreeNow app. You can order a taxi anywhere with it and payment via apple pay. Very convenient. If its busy though it can be hard to get a taxi."}, {"username": "BJ Webster Smith", "comment_text": "We arrived in Rome on the 13th during the train strike. A counter at the train station arranged us a shuttle straight to our hotel for $15/pp. It was great."}, {"username": "Elizabeth Grafel", "comment_text": "We paid 50 euro for a taxi and we stayed near the Spanish steps and walked everywhere and took a bus to the Coliseum and back."}, {"username": "Renae Larcus", "comment_text": "Or take the Leonardo Express right from the airport."}, {"username": "Rita Levi Montalbano", "comment_text": "There are a lot of scams around the taxi service, expecially in rome and with the tourists. My suggestion is to avoid as much as you can the usage of taxi, walk or use the metro when it's possible. If you have to take a taxi, try to check online if there is a flat rates for that type of route"}, {"username": "Linda Snaring", "comment_text": "We always arrange car service through our hotel. It’s really worth it!"}, {"username": "Jerry Lyubelsky", "comment_text": "It’s a 30+ minute ride from FCO. Our arranged pickup from hotel by Trevi to FCO for 4 with luggage was $100e. If arriving at Rome termini that’s way too much."}, {"username": "Stephanie Osborn Rushing", "comment_text": "That sounds about right, our hotel said 70 euros for 3 people and luggage near Spanish steps. I’m all for convenience at this point"}, {"username": "Rhona OConnor", "comment_text": "It's a bit like the USA..... when you come out of the airport there is a taxi rank with lots waiting. There is a police transport option."}, {"username": "Alison Dutton", "comment_text": "We stayed near the Trevi fountain, when we arrived we caught a taxi from the airport for 50 euros but the driver couldn't drive us right to the door but dropped us a short distance away. Going back we were picked up from the hotel but it was early morning so fewer people, I think it depends on the driver."}, {"username": "Renee Kremesec", "comment_text": "Taxi is easy\n1 line to wait in\nNot too long\n50 Euro fixed rate from Airport to Rome Center\n3 people easy!"}, {"username": "Anne Mc Namara", "comment_text": "We booked a shuttle bus in the train station. It cost €55 between the 4 of us. But you are sharing with other people."}, {"username": "Robyn Lawson", "comment_text": "That seems about right in cost for a car to pick you up from the airport. We booked one to take us not far from Trevi. 105 Australian dollars. 😊"}, {"username": "Victoria Laverty", "comment_text": "Heaps taxis and 50 euro"}, {"username": "Aurélie Esposito", "comment_text": "Bus are available from the airport very early and go straight to Termini Station. From here you can easily go to Trevi fountain"}, {"username": "Danielle Johnston", "comment_text": "I paid $55 from airport to hotel. Same area"}, {"username": "Lynair Bergman", "comment_text": "Cost us 50 euros"}, {"username": "Lori Spears Strahan", "comment_text": "We set up pick up for 55 euro from airport"}, {"username": "Wendy Spano Bracco", "comment_text": "I booked Mary Roma going the opposite way at 7am from my hotel. 70e."}, {"username": "Steven Ciochon", "comment_text": "I went at the beginning of may. And it only cost me 50 euros to get into Rome from the airport."}, {"username": "Phyllis Snyder", "comment_text": "Leonardo express from airport to termini station is fast and inexpensive- or just tax a taxi from outside the airport-"}, {"username": "Pong Ac Ai", "comment_text": "That’s horrible"}, {"username": "Jennifer Larese Taylor", "comment_text": "Jennifer Larese Taylor"}, {"username": "Gundega Barkane", "comment_text": "7 AM is not that early."}, {"username": "Teresa Chiovaro Cowley", "comment_text": "This is horrible. The hotel should call a taxi for you."}, {"username": "Cindy Bafaloukos", "comment_text": "Taxis are at the airport and are fixed price into Rome, just go to the designated taxi stand!"}, {"username": "Alexandra A Welker", "comment_text": "€100 is expensive. Go to the taxi stand and get one for cheaper. Or you can take the train if you don't have much luggage, Leonardo Express from the Airport to Roma Termini then change to A line/towards Battistini and that will take you to Spanish Steps."}, {"username": "Carmine Napolitano", "comment_text": "We always arrange a pickup from major stations or airport I've seen taxi lines 2 hours long people fighting over taxes"}, {"username": "Brian McGraw", "comment_text": "Not that pricey Historic Rome is 30 minutes away from the airport by car or train\n15 miles away.\n\nThere is a train that runs from the airport to Roma Termini if the cost of private transit is out of the budget."}, {"username": "Amber Evans", "comment_text": "ask locals/Google to have an idea of what your trip should cost and if nothing else, ask the driver before you get into the car. I noticed rometorio website shows different ways of traveling from point A to B as well as listing a price range of what it might cost. I usually take Leonardo express to Termini and then can take metro to piazza barberini stop which was near a hotel I’ve used a few times. I’ve also jumped in a taxi from Termini. In Florence I now walk from train station to my hotel, even when I’ve stayed across the river, since I know where I’m going. otherwise stand in the taxi line outside the station . I have my hotel help me pre -schedule airport pickup for early flights. If you don’t pack light I would opt for taxi ."}, {"username": "Bennett Richards", "comment_text": "I would recommend a different hotel. Trevi area is hugely crowded and loads of pickpockets. We stayed at the hotel Grand Palitino. Way less crowded, 3 blocks away from colosseum and forum they provided pickup by private car from FCO for around $50.\nThis hotel has an incredible breakfast buffet included… A block away from a fun hot spot for locals."}, {"username": "Lori Van Tassel Pinco", "comment_text": "So worth it. Spend the money if you can. They're waiting there when you land. It's so much easier."}, {"username": "Yvette Pavone", "comment_text": "TAKE THE TRAIN I TO THE CITY CENTER. AND THEN THE SUBWAY"}, {"username": "Janet Messanelli Bozzone", "comment_text": "I think it’s 50 euros fixed for cabs….and 60 if you hire a service. The hotel quote seems high. Check out Stefano’s Rome Cabs. You have to pay more if you need a van. I believe we paid 80."}, {"username": "Mirko Bellagamba", "comment_text": "from the station Termini, you can take the underground line A and get off at \"Spagna\". if you have the hotel near the fountain it's convenient."}, {"username": "Jenn Ds", "comment_text": "Lots of taxis at airport- assuming you are coming to FCO, its 50 euro flat rate to center of Rome."}, {"username": "Carine Brys", "comment_text": "Yes, 100 Euros seems like a lot. Our hotel arranged for our transportation (close to the Pantheon, so also center of town) and it was 60 Euros."}, {"username": "Ildiko Gyimesi Mikos", "comment_text": "Taxis at 7 am at the airport are no problem. Get into the taxi line there. It’s a flat 50 euro ride to the Rome city Center. Easy!"}, {"username": "Allison Carlisle Young", "comment_text": "Get a quote from limousinrome.co\nm"}, {"username": "Miyuki Kanno Paul", "comment_text": "If your hotel in Roma in within the city wall, it’s a flat rate of €50"}, {"username": "Kaja Hvistendahl Fløstrand", "comment_text": "I second the taxi, but they only take three people. The train is 14/person and the taxi drivers at Termini are likely to charge you 20/25"}, {"username": "John Cosenza", "comment_text": "Just left Rome three hours ago and it’s 50. We stayed by the coliseum"}, {"username": "Claudia Amp", "comment_text": "Take a taxi, they have flat rates to the city."}, {"username": "Jeff McLellan", "comment_text": "They have Ubër which also includes taxis which is a game changer."}, {"username": "Rachael Richardson", "comment_text": "Can you use the metro ?"}]}, {"id": "2194653320933746", "text": "Does anyone know a good place to eat in Portofino (around the castle area)on a Wednesday? Looks like many restaurants are closed on Wednesdays. Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2194653320933746/", "likes": 0, "comments": []}, {"id": "2194651800933898", "text": "Hi arriving in Rome for 6 nights 5 days stay in later part of August . I know will be semi recovering from long flight next day. Please hit me with plans (travelling with 21 year old). We both love sightseeing walking, art .", "link": "facebook.com/groups/1373361046396315/permalink/2194651800933898/", "likes": 2, "comments": [{"username": "Gary W Anderson", "comment_text": "Make all reservations NOW tickets and skip the line both may not be available. Make copies of all important papers and cards. Travel safe, eat well and enjoy gelato."}, {"username": "Jan Smith", "comment_text": "F"}]}, {"id": "2194650040934074", "text": "Can someone suggest a great pizza making class in Florence for a reasonable price? Thanks so much.", "link": "facebook.com/groups/1373361046396315/permalink/2194650040934074/", "likes": 0, "comments": [{"username": "Ken Lerch", "comment_text": "Cook and Love with Luca."}]}, {"id": "2194648434267568", "text": "Flying into Milan and flying home from Venice have 12 days. Recommendations appreciated", "link": "facebook.com/groups/1373361046396315/permalink/2194648434267568/", "likes": 0, "comments": [{"username": "Gary W Anderson", "comment_text": "If your staying north I recommend Milan for a few days then maybe Cinqua Terra for a couple then train to Florence with quick stop in Pisa. Florence for 3 or 4 days with guided tour of Tuscany then Venice for the rest."}]}, {"id": "2194648387600906", "text": "Traveling to Florence, Montepulciano and Bologna in October. I would love some restaurant recommendations.", "link": "facebook.com/groups/1373361046396315/permalink/2194648387600906/", "likes": 2, "comments": [{"username": "Scott Perry", "comment_text": "If you are a cocktail fan, go to Guero in Bologna. Tell them Scott sent you. 😁"}, {"username": "Liz Bendelac", "comment_text": "osteria acquacheta in Montepulciano. You will have the best steak of your life. Tell Julio - the capellini’s sent you."}, {"username": "Ana Ka", "comment_text": "I can only recommend for Florence as I know it best, so here is my advice...\n\nMy absolute favorite restaurant is Alla Vechia Bettola. Until recently, it was a hidden gem known only to locals, but now, a few tourists have started discovering this place, leading them to expand the restaurant a bit. The signature red sauce pasta they serve is unlike anything I've ever tried before; it's ridiculously good. To reach this place, you have to walk through Oltrarno, which allows you to experience the local life more intimately as it's a bit less touristy. Just make sure to book in advance, as it's almost impossible to get a table otherwise. Another fantastic option (a bit more upscale) is Cantinetta Antinori, offering traditional Tuscan food with excellent cuisine and charming decor.\n\nFor lunch, I usually frequent either the mozzarella bar OBICA or Fishing lab. If you're a fan of fish, Fishing lab is also a great choice. Don't miss the stunning frescoes on the second floor! For a quick snack, the must-try is the tiny truffle panini with prosecco at Procacci. While it was recently purchased by new owners and might not be as amazing as it used to be, it still holds a special place in the hearts of Florentines.\n\nAdditionally, I absolutely love the restaurant at Hotel Calimala, and that's saying something because I usually don't like hotel restaurants. I believe this one is related to the famous Israeli chef Ottolenghi, which might explain why the food is exceptionally good. Their brunch is fantastic, and the Angel rooftop bar is a well-kept secret gem in Florence. :)))"}, {"username": "Ana Ka", "comment_text": "Oh, and if you go to Montepulciano, I really loved the tour by appy guide tours. It was amazing."}]}, {"id": "2194646914267720", "text": "Hi ! I will be arriving in Florence on a tuesday, 9h35 am. I was wondering if there was always taxi available or if I should book a private transfert to my hotel ?\n\nThank you !!", "link": "facebook.com/groups/1373361046396315/permalink/2194646914267720/", "likes": 0, "comments": []}, {"id": "2194646280934450", "text": "Hi there, wanting to know how easy it is with small children 1.5yr old and a 4 yr old in Italy when hiring a car? Booster seat hire etc? We are not going to big cities and the local transport is buses so not really ideal.", "link": "facebook.com/groups/1373361046396315/permalink/2194646280934450/", "likes": 0, "comments": []}, {"id": "2194472584285153", "text": "Do hotels in Italy, have a washer and dryer available for a fee? Thanks in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2194472584285153/", "likes": 19, "comments": [{"username": "Samantha Sparkman", "comment_text": "Wash it in the sink and line dry it. I washed a lot of my stuff in the tub at the hotels and just hung it to dry in my room ❤️"}, {"username": "Neville Spargo", "comment_text": "So far for us it’s zero, one advertised guest washing facilities available which we mistakenly took as a washing machine etc that guests could use ! NO ! It was not, it was put it in a bag and send it off and pay lots of euros 😂 but laundromats are around and reasonable price . In Florence did a large load ( big machines ) for 4 euros and dry for another 4 euros . Lovely cafe/\nrestaurant right across the lane way where we had a lovely lunch ( best tiramisu we have ever had) until washing and drying done ✅. Very different matter for apartments etc but not many have a dryer too."}, {"username": "Dany O Murillas", "comment_text": "Buy a bar of soap (detergent) and wash it when you take a shower easy Peezy"}, {"username": "Joanna Aceves", "comment_text": "Not that i have ever seen or known."}, {"username": "Lydia Brown", "comment_text": "Not to my knowledge"}, {"username": "Frank Hunt", "comment_text": "They don’t always have a lift so I’m not optimistic for you.😏"}, {"username": "Susan Taylor", "comment_text": "Cheryl Murphy-Smith if"}, {"username": "Elizabeth Grafel", "comment_text": "Not usually. We stayed in Florence and there happened to be one a few doors away. But most have laundry service."}, {"username": "Kevin Andrews", "comment_text": "It all depends on the hotel but must cities have small laundromats near hotels"}, {"username": "Charlotte Lowe", "comment_text": "Bring washcloths"}, {"username": "Marika Radich", "comment_text": "Some do . At our hotel in\nStresa is was €10 to use the washer & dryer .\nAll the other places had laundry service but was very expensive .\nWe used laundromats in Sorrento .\nWe only book Airbnbs with a washer and dryer in between hotels."}, {"username": "John Lapinsky", "comment_text": "Most do have washer & dryer able for guests. Just inquire when checking in."}, {"username": "Juliana Sorano Xavier", "comment_text": "We had our laundry done in Rome. I dropped the bags off and picked them up 3 hours later, folded and clean. It was great! Paid 12 euros for a big bag to wash/dry and they do it for you. No need to wait."}, {"username": "Shawn Galbraith", "comment_text": "None of mine did\nLaundry facilities were easy to find in towns"}, {"username": "Jim LeSire", "comment_text": "Air bnb places often do."}, {"username": "Colleen Campbell Bussey", "comment_text": "The sink is what I use! Remember you are not going to see the same people 2x"}, {"username": "Enrico Lecce", "comment_text": "I would recommend utilizing outside services... there business outside the hotels who would wash and dry for a respectful price..."}, {"username": "Eliz Fragoso", "comment_text": "I go to the laundromat it takes me about 40 minutes to wash and dry and a couple of euros"}, {"username": "Barbara Bastianini", "comment_text": "I haven’t found washers and dryers provided to guests in any Italian hotel. But many hotels we’ve stayed at over the years provide laundry service for a fee. You can find a list with prices per piece in the closet. You send your laundry and it’s usually returned cleaned and folded the next day. That’s pretty common.\n\nIf you don’t like that option you can hand wash some things in your sink and hang them to dry overnight. Also, many cities have laundromats."}, {"username": "Jody Ŧ Madding", "comment_text": "We saw several self serve and laundry service places that charged by the kg. Might google map search “self serve laundry” when you’re narrowing down hotels."}, {"username": "Jess Allen Gerard", "comment_text": "While in Rome we used a local laundry service. We dropped off and picked up the next day, very affordable."}, {"username": "Sherri Leis Dillavou", "comment_text": "All my airbnbs did. I’m never going back to a hotel. For less money you get an entire apartment. No noisy neighbors at 2 am. No kids running the halls. Your own kitchen, washer and dryer, most of the hosts can tell you anything you need to know. Quieter"}, {"username": "Pietro Adami", "comment_text": "Mostly not. But you can look for self-service laundries and take care of your clothes"}, {"username": "Linda Arnold", "comment_text": "What is approximate cost of drop off and pick up. Do the locals do this also?"}, {"username": "Hope John", "comment_text": "Careful. We were in Europe for three weeks. No laundromat. Washing service was very expensive. We hand washed our clothes. Lot of issues because we took jeans and they don’t dry over night. Try to take light clothes if you can."}, {"username": "Naritta Nurit Matheus", "comment_text": "Nothing is for free in the Europe. In the hotels it is extra service and you have to pay for it."}, {"username": "Joanne Ferreira", "comment_text": "Best to hand wash and bring clothes pins - many have laundry lines to hang clothes to dry"}, {"username": "Gina Bernaitis", "comment_text": "We used one in two out of 5 of our hotels!"}, {"username": "Melissa Klarberg", "comment_text": "No, hotels didn't. Some airbnbs or private residences have washers... very rare to find a dryer"}, {"username": "Caroline Langlois", "comment_text": "https://\nwww.mec.ca/en/\nproduct/\n5036-920/\nwash-bag?gclid=C\nj0KCQjwk96lBhDH\nARIsAEKO4xZgAqg\nip1Af1Nr1jjWgQs\noKKWLhxikO9BRdE\nR0VBGKbbK0bMwGf\niJ4aAvivEALw_wc\nB"}, {"username": "Marisa Brombal D'Emilio", "comment_text": "When we were in Florence 6 years ago we went to a laundromat and did our own laundry. While our close were washing my husband and I took turns going into the surrounding shops!"}, {"username": "Julia Haggerston", "comment_text": "Our hotel in lake Garda had one onsite x"}, {"username": "James Carr", "comment_text": "All I have to say for any country, any hotel is to double check those prices! Friend of mine’s wife had all their clothes washed at a resort. She misread the per article price as the price for all of it.\n\nIt was ridiculously high, like $15 per article or something like that. Burned their remaining cash."}, {"username": "Lynda Petralia", "comment_text": "Most hotels have laundry service. But be forewarned. Could be very pricey! Check first!"}, {"username": "Valentina Daprile", "comment_text": "It is not common but you should ask the hotels directly"}, {"username": "Marilyn Caladine", "comment_text": "I think there is a laundry opposite the hospital (near the corner and fruit shop)"}, {"username": "Pauline SassyNana DeRose", "comment_text": "I always found a local laundromat"}, {"username": "Wolly Valentina Losi", "comment_text": "Non moltissimi."}, {"username": "Kristen Taylor", "comment_text": "Dryers are hard to find in Italy. I have my laundry done at a locally owned laundromat on Via Magenta (near the Termini). Well priced & delightful people - overnight service for me."}, {"username": "Nadele Clark", "comment_text": "We didn’t in Rome, Florence or Venice. We went to the laundromat"}, {"username": "Elisa Gall", "comment_text": "Some do but the cost between 3 to 5 euros"}, {"username": "Beata Zabek", "comment_text": "Yes we were in Lake Come they were everywhere"}, {"username": "Paul Anderson", "comment_text": "Stay at an Airbnb. Every one we stayed had had a washer"}, {"username": "Oriana Delle Cave", "comment_text": "Oriana Delle Cave"}, {"username": "Ron Wright", "comment_text": "It depends. But most have a service. But check the prices first. One of my kids had his laundry done and it costly."}, {"username": "Ildiko Gyimesi Mikos", "comment_text": "Typically they do not have washer and dryers. Most places offer a laundering service for a fee."}, {"username": "Nancy Cicchino Knoeller", "comment_text": "We found a local laundromat when we were in Rome last year"}, {"username": "Phyllis Snyder", "comment_text": "Some have laundry service- and there’s all laundromats around town- ask your hotel. Many arbnb accommodations have washers. You need to ask or see on their websites."}, {"username": "Carmine Napolitano", "comment_text": "Stayed like five places in Italy had no such luck we used laundromat got a bottle of wine and drink on a dock in Venice while we wait"}, {"username": "Jose Velez", "comment_text": "it depends I have stayed in Hotels in Spain and Portugal that had an all in one washer/dryer on the same machine and included one pod of soap"}, {"username": "Lynn Francisco Casella", "comment_text": "Hilton Cavalieri has everything. You can’t go wrong"}, {"username": "Shirley Collar Wilson", "comment_text": "Not that I ever saw, but there was a public laundromat a few blocks away we used."}, {"username": "Alexandra A Welker", "comment_text": "There's also a laundromat as an option. I've used them, the ones close to my hotel. I drop off my stuff then go to dinner or get a snack/window shopping while waiting. :)"}, {"username": "Elvie Rodriguez", "comment_text": "Some of the self laundry places we used throughout Italy will wash and fold for a reasonable price. Hotel prices could get pretty pricey."}, {"username": "Sally Wilkinson", "comment_text": "We found a local laundromat in Montecatini and a bakery across the street! Perfect ."}, {"username": "Jim Hash", "comment_text": "We’ve never seen them in hotels in Europe. We go for weeks/months at a time. Walking a few blocks to a coin operated laundromat has become one of my dirty pleasures. Mostly because I can sit outside and enjoy a beer/aperol."}, {"username": "Elizabeth Lupo DiVito", "comment_text": "Not usually, but lots of laundromat around."}, {"username": "Joseph DellaFave", "comment_text": "Call or email your hotel and ask them."}, {"username": "Rebecca Lawless Crawford", "comment_text": "Ours did our laundry. It was a bit pricey but worth it!"}, {"username": "Kathy Ann Jones", "comment_text": "Like in the US, it depends on the hotel."}, {"username": "Allison Mir", "comment_text": "Not always"}, {"username": "Russell Weidner", "comment_text": "If they don’t we have used independent laundromats. Not an issue."}, {"username": "Robin Weathers Richie", "comment_text": "None of the 8 hotels we have stayed at had washers and dryers except one ( which was a Hilton) however it was always takeN - 1 washer and dryer for entire hotel."}, {"username": "Terry Spincic", "comment_text": "In Italy nothing is free"}, {"username": "Daijee Anne Krzyzanowski", "comment_text": "Terry Spincic that was why poster was asking if you could find a washer/dryer FOR A FEE. 🙂"}, {"username": "ShyneBenjie Gonzales", "comment_text": "Some b&b has\nIf you prefer to stay in hotel there’s a lot of laundry self service shops in chosen vicinity"}, {"username": "Ilaria Giorgulli", "comment_text": "Mainly not"}, {"username": "Jane Allen", "comment_text": "If you ask hotel they may let you use theirs or can direct you to one"}, {"username": "Brian McGraw", "comment_text": "You could look for an Airbnb and filter for Washer and Dryer.\nOtherwise just find a local lavanderia.\nJust about every town has one.\nSome will have machines to pump coin into.\nSome will have full drop off service.\nSome have full pickup and drop off service even.\n\nIf you’re going to do laundry, Bring detergent and fabric softener sheets in your bag, no liquid. And a laundry bag.\n\nSome hotels will offer laundry service, at hotel prices.\n￼Pay per piece."}, {"username": "Victoria Williams", "comment_text": "I washed in the room and hung them all over. It worked and cheaper"}, {"username": "Crystal King", "comment_text": "We found a nice laundromat in Venice and one in Milan. Both included detergent in the price. Very reasonable prices."}, {"username": "Rachelle Elle Anderson", "comment_text": "Dryers aren’t too common but most Airbnb have washing machines"}, {"username": "Sara Jellen Wingard", "comment_text": "Ours did"}, {"username": "Dina Zaid", "comment_text": "It depends on the hotel"}, {"username": "Mary Patzke", "comment_text": "Look for a Speed Queen. You can do laundry there. (Be sure to select the English version for instructions! It can be ugly when you don’t! 😜)"}, {"username": "Carole Tarlap", "comment_text": "There are laundry mats.....I have used them in Florence and Rome. Both easy and CLEAN 💥👍"}, {"username": "Steve Albert", "comment_text": "Call ahead"}, {"username": "Rachael Richardson", "comment_text": "There are public laundry’s and we stayed in apartments through booking . Com some of them had washers and really spacious\nHotels you normally have to pay"}, {"username": "Marianne Kathleen McCrary", "comment_text": "It’s no difference than the US. Most hotels don’t have washers you can use, but, there’s most likely a service available."}, {"username": "Sherry Shannon", "comment_text": "Try to find a laundry mat near activities. Their wash and dry cycles are longer and there’s nowhere to hang out and wait. You will have to leave your laundry and come back to check on it."}, {"username": "Linda Wallace Smith", "comment_text": "Not that we ever saw in the month we were there. You can pay them to do it for you, but it’s very expensive!"}, {"username": "Nicole Webb", "comment_text": "Clayton Webb"}, {"username": "La Rosa Jeanette", "comment_text": "Some"}, {"username": "Al Burger", "comment_text": "We have already purchased Tide Laundry Sheets from Amazon for our trip to Italy in the fall. Laundry in the sink.\nWe were amazed when we were in Ireland last year, to washer and dryers, outside at gas stations."}, {"username": "Nancy Lewis", "comment_text": "Some"}, {"username": "Carol Scime-Raiford", "comment_text": "You can easily find laundromats"}, {"username": "Diana Wilson", "comment_text": "None I know off"}, {"username": "Deea Cata", "comment_text": "Europe does not care for dryers :) let nature take its course (the drying) 😆"}, {"username": "Raf Gervasio", "comment_text": "We don't do hotels just apartments with all the comforts of home"}, {"username": "Mary Brown", "comment_text": "I’ve never come across a hotel that has self service washing machines.\nHotels typically provide a ￼dry cleaning/\nlaundry service and charge a lot per piece. Like $3 per pair of underwear.\n\nYour best bet is too look for an apartment with a washer. Dryers are not as common in Italy although our Airbnb in Florence, had washer and dryer.￼\n\nYou can also go to laundromat"}, {"username": "Carine Brys", "comment_text": "The hotel we stayed at had a laundry service available. The list with pricing was in our room."}, {"username": "Claire Buccini", "comment_text": "We just find laundromats and get a gelato or a drink in between cycles."}, {"username": "Roxanne Boccardi", "comment_text": "It’s the same as the U.S. some do some don’t ."}, {"username": "Sigrid Cormier", "comment_text": "Google for a Lavandreria in your area."}]}, {"id": "2194443444288067", "text": "We are planning to visit Verona and my son who’s a photography student wants to visit Lago di Braies to get some photos for his course, what is the best way to do this? Are there tours directly from Verona or bus/train? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2194443444288067/", "likes": 0, "comments": []}, {"id": "2194488327616912", "text": "Suggestions for the best pasta in Rome with decent pricing please!!!", "link": "facebook.com/groups/1373361046396315/permalink/2194488327616912/", "likes": 20, "comments": [{"username": "Gilda Capraro", "comment_text": "Bacco in Trastevere gets my vote. Or Nannarella"}, {"username": "Emma Louise Peterson", "comment_text": "Emma's!"}, {"username": "Michele Wade", "comment_text": "Just keep away from Restaurants near big attractions and ones with pictures on the outside!"}, {"username": "Dimity Betar", "comment_text": "The peroni restaurant 🙌"}, {"username": "Antonio Aloè", "comment_text": "What a dummy question..."}, {"username": "Linda Haavig", "comment_text": "Osteria di Fortunata in Campo di Fiore!"}, {"username": "Jeff Gentner EA", "comment_text": "Sorry, have to laugh. We've been to Rome 5 times. Never had a bad meal. Stroll through the Trastevere area and you can't go wrong! If you spend time trying to find a specific restaurant, you'll get frustrated and possibly disappointed. Enjoy!"}, {"username": "Alex Kovacs", "comment_text": "The duck pasta at cipasso 🙂 we made a res the day of or day before"}, {"username": "Hale Fitzgerald Heather", "comment_text": "Hale Fitzgerald Heather"}, {"username": "Cindi Carrillo", "comment_text": "Right around any corner. Didn’t have a bad meal once while we were there.\nHit the off the beaten path."}, {"username": "Raul Obras", "comment_text": "Raul Obras"}, {"username": "Nick Trostel", "comment_text": "There’s a restaurant every 10 feet with great pasta, just get one with a decent crowd and a price range you like"}, {"username": "Dorene Van Bibber", "comment_text": "It’s Rome …go sit where ever your heart directs you & enjoy. It’s Italy …wonder & find your place."}, {"username": "Frank Hunt", "comment_text": "Is it me or are these questions getting really silly?"}, {"username": "Miklos Verdes Kovacs", "comment_text": "Penne !🤔😉😎"}, {"username": "Lara Grom", "comment_text": "Sora margherita Jewish ghetto"}, {"username": "Luciana Morino", "comment_text": "A via dei Balestrari (campo de fiori) troverai una cacio e pepe,una gricia ed una amatriciana da leccarsi i baffi a prezzi ottimi♥️"}, {"username": "Mariposa Mariposa", "comment_text": "Saving all of these recs for my trip next year"}, {"username": "Christina Lynn", "comment_text": "Da Enzo and Taverna Trilussa"}, {"username": "Angie Deeprose", "comment_text": "Its italy 🇮🇹 all the pasta is the best 🤌"}, {"username": "Bill Elias", "comment_text": "Never had a bad meal in Rome. Walk around and look at menus. That’s half the fun of traveling."}, {"username": "Simone", "comment_text": "Trattoria Luzzi via Celimontana, near Colosseo."}, {"username": "Annette Gonzalez", "comment_text": "Tonnarrello Trastevere Roma, Italia"}, {"username": "Maryanne Cristina", "comment_text": "Nanarella"}, {"username": "Jodi Bruno Rojas", "comment_text": "Was here last week. Fabulous.\nFlávio al Velavevodettoia\n\nVia di Monte Testaccio 97\nTel 06 5744194"}, {"username": "Carol Potter", "comment_text": "Well so far I’ve seen every restaurant in Rome mentioned. Wouldn’t you rather pick your own and not depend on somebody else’s tastes which may be totally different from yours.? Just go enjoy your trip and find your own special place and I’m sure it will probably be there when you go back the next time."}, {"username": "Dewy Rain", "comment_text": "I would ask the question \"which restaurant has bad service\" there are restaurants everywhere to choose from"}, {"username": "Alice Francesca", "comment_text": "Matricianella."}, {"username": "Norma Kalberer", "comment_text": "Alfredo's"}, {"username": "Maria LaPietra Guerrero", "comment_text": "Alfredo e Ada. Delicious, authentic, only a few tables and pasta was about 13 euros. We met a linguistic professor there who told us he has been eating there for 60 years."}, {"username": "Silvia D'arienzo", "comment_text": "Tonnarello"}, {"username": "Steve Grossman", "comment_text": "Any restaurant you like"}, {"username": "Tanya Cini-Kirk", "comment_text": "Nannarella in Trastevere. Best and most authentic pasta we had in Rome!"}, {"username": "Shawn Kopp", "comment_text": "Everywhere 🥸"}, {"username": "Kirstine Smillie", "comment_text": "Any suggestio s for best gluten free pasta ?my daughter is coelic"}, {"username": "Jill Rosenfeld", "comment_text": "Tonarello"}, {"username": "Elena Innocenti", "comment_text": "La Villetta - Via della Piramide Cestia.\nOstiense area near aventino.\nFor me, as a roman, one of the best places to eat typical roman pasta like carbonara, cacio e pepe, amatriciana…"}, {"username": "Konstantinos Georgakakis", "comment_text": "Everywhere was really good, but Trecca was my favorite."}, {"username": "Martin Rudolph", "comment_text": "Trastevere"}, {"username": "Marscha Fransisca Debora Basdew", "comment_text": "Mimi e coco\nAntica Osteria di Pietra\nIl Sorpasso\nGood prices and great food 😋😋😋"}, {"username": "Stefan Van Suetendael", "comment_text": "https://\nwww.salumeriaros\ncioli.com/"}, {"username": "Marissa Vergnetti", "comment_text": "We fell In love with contraluce in Trastevere. A new restaurant (1 year old) and the pasta was amazing. Mostly locals there.\n\nhttps://\nwww.contro-luce.\ncom/"}, {"username": "Patrizia D'Arcangelo", "comment_text": "\"Popi Popi\"\nVia delle Fratte di Trastevere"}, {"username": "Anton Raul", "comment_text": "Ristorante la Nuova Piazzeta, in proximity of Colosseum. Best of the best!"}, {"username": "Daniela Silva", "comment_text": "Pastificio Guerra"}, {"username": "Rachel Manz", "comment_text": "Ad Hoc- the carbonera tasting menu was amazing and they kept giving us free add on like sparkling wine, cookies, extra courses"}, {"username": "Stacy Prestigiacomo", "comment_text": "El faciolaro near trevi was delicious"}, {"username": "Laura Piccinini", "comment_text": "\"Felice a Testaccio\" or \"Eggs\""}, {"username": "Lewis RC", "comment_text": "Osteria de Fortunata had the best carbonara I've ever had."}, {"username": "Ildiko Gyimesi Mikos", "comment_text": "Best pasta??? Are you kidding me?"}, {"username": "David Solo", "comment_text": "No disrespect but if you want good restaurant reviews, go to Yelp or Google “Best restaurants in Rome” and find a restaurant in your budget. Otherwise ask at your hotel where they would go do a nice dinner with their family. Ask a local. Otherwise, you are just asking fellow tourists."}, {"username": "John Bruckman", "comment_text": "Taverna Trilussa"}, {"username": "Eileen Marum Armitt", "comment_text": "pasta dishes are all very reasonably priced!"}, {"username": "Janet Messanelli Bozzone", "comment_text": "Define reasonable."}, {"username": "Steve McGinniss", "comment_text": "Barzilai Bistro on Via Panisperna 44 00184 - mostly locals. Amazing pasta carbonara. Local wine was killer. Reserve in advance (we tried to walk in but they were booked for the nite so made a reservation for the next day)"}, {"username": "Sarah Breneman Patterson", "comment_text": "As long as it’s not across from a tourist trap, you will find amazing pasta anywhere!!"}, {"username": "Carol Taylor Tisdale", "comment_text": "Oh my. When you get there you’ll discover why you are asking an impossible question!♥️"}, {"username": "Kimberly Borg", "comment_text": "Everywhere 🥰"}, {"username": "Joe Reams III", "comment_text": "Trattoria Della Stampa was small but very friendly and had delicious pasta."}]}, {"id": "2194642500934828", "text": "Dear Friends, I need advice. I’m in Milan for one day only and need to take care of shopping business. What are the best places to shop for interesting clothes and shoes? Not looking for big name brands, mostly things for under $200. I would love a shopping mall or a street with interesting stores where I can hassle for 3 hours and buy several beautiful items for myself and my husband.\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2194642500934828/", "likes": 0, "comments": [{"username": "निनावी सहभागी", "comment_text": "Any ideas?"}]}, {"id": "2194640144268397", "text": "Hello! We are a family of 4… 2 teenage boys… travelling from Naples to Venice via Sorrento and Rome.\nWe are thinking Pozzuoli then Vico Equense then Rome?\nWould really love a chill / beach area between Rome and Venice. Would Rimini be a good idea?\nAlso, thinking … trains until Rome then pick up a car and drive to Venice?\nAny recommendations at all would be fabulous!\nThanks soooo much! ☺️", "link": "facebook.com/groups/1373361046396315/permalink/2194640144268397/", "likes": 0, "comments": []}, {"id": "2194637304268681", "text": "Going to do a 16 day tour of southern Italy & Sicily this September. How many Euro should my husband & I bring? (Tour includes highlights transportation & some dinners). Tips are included as well. Just not sure how many Euro we should purchase ahead of our trip.", "link": "facebook.com/groups/1373361046396315/permalink/2194637304268681/", "likes": 0, "comments": [{"username": "Scott Perry", "comment_text": "It might be easier to just rely on ATM’s while you’re there, rather than carrying a lot of cash. You can pay with credit and debit cards most places too."}, {"username": "Allan Olexa", "comment_text": "Pay with US credit cards! We get just a few cash euros at an ATM there inside a bank using our no fee debit card. Our only cash expenses are for small purchases below the credit minimum, street markets, and tips."}, {"username": "Rhona OConnor", "comment_text": "Use a card. It's acceptable in just about everywhere."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "You can bring 400€ so you don’t have to find an ATM when you arrive and you have a small backup, then rely on credit cards. If you find yourself needing more you’ll just go to an ATM"}]}, {"id": "2194636337602111", "text": "what's the best size for carry on luggage? My husband thinks it's crazy that I would want to carry my luggage, but I keep seeing these horror stories about checked luggage being lost, stuck at the airports, etc. I've never had a problem with luggage, but I've never traveled that many places internationally. We plan to travel in 2025 to Italy forआणखी 2 weeks and Greece for an additional two weeks. I already know that overpacking is a huge mistake but want to know the best tips and tricks! I'm a woman who uses a hairdryer daily and has a specific beauty regimen (don't laugh..surely some women my age of 55 understand the struggle!) I know I can wear hats, throw my hair up, etc, but I still want to look nice and feel good when traveling. Thanks!!", "link": "facebook.com/groups/1373361046396315/permalink/2194636337602111/", "likes": 56, "comments": [{"username": "Patti Porter", "comment_text": "The size that your airline allows you to carry on, varies by airlines"}, {"username": "Frank Hunt", "comment_text": "Never over think the problems of travel, chances are it just won’t happen."}, {"username": "D'Anna Hohe", "comment_text": "Yvonne Ormson I don’t disagree with you but the OP has not specified how much of Italy they are trying to see. If they aren’t moving around a lot, traveling with just a carryon may not be necessary. They are most concerned about lost luggage which may not be a factor by the time of their trip.\nI lived in Rome from 2015 thru 2019 and due to the illness of a family member in the US, I made multiple trips each year in addition to my other travel to locations in Europe. I always checked a bag and only one time was one delayed (for one day) when returning to Rome. The current lost baggage disasters are not the norm. If the Op ends up spending a week each in two locations, checking bags may be just fine."}, {"username": "Alicia Vargas", "comment_text": "You're seeing the exceptions, not the rules. No one is posting their \"my luggage arrived as it's supposed to\" stories."}, {"username": "Robin Burrell", "comment_text": "Dresses. Done. Makeup minimal or you can watch it slide off your hot face. They have blow dryers, don’t need to take it. Easier to haul around a smaller suitcase"}, {"username": "Debbie Potter", "comment_text": "Following"}, {"username": "Maria Coladangelo Ducca", "comment_text": "Ditch the hairdryer! Get your hair done .Hairdressers are everywhere. .Send clothes to the dry cleaners. Simplify your regime for skin.Cleanser , sunscreen for face and nightly ampules( Elizabeth Arden has tiny ones .) . This might be a time to just go for it and try new things!"}, {"username": "Suzie Russo-Sek", "comment_text": "I put all my grooming stuff in a travel tote bag and carry it on with me. If flying business class they place priority tag on your luggage, I’ve never had a problem and your suitcase gets unloaded on the carousel first."}, {"username": "Nancy Bagwell Perry Hodges", "comment_text": "Check a bag with contents you can do without! Why should u care what hubs opinion is. Let him check his bag! Ur bag ur belongings! Have peace of mind n enjoy ur trip with ur carry on n tote bag!"}, {"username": "Linda Barba", "comment_text": "Does anyone know if the airlines weigh your carry ons? I am planning to fly Lufthansa but want to make sure of the weight if you need to be at exact or under the carry on limit"}, {"username": "Kate Squillacioti", "comment_text": "We just got back from 10 days in Italy, each with a carry on and it worked out awesome!!! We each has the smaller carry on from Away and one backpack and it was the easiest thing ever. I watched so many people struggle with so much luggage and we breezed through everything from the airport to the towns."}, {"username": "Michele Baron Vold", "comment_text": "See if your hotels have hair dryers. Lots do and they are compatible with their electricity. I never carry on. Tried it last year for the first time. It was horrible and hard to get it up in the carrier. Each airline has rules about carry on size. Four weeks away is a lot of stuff to fit in a carry on. Unless you have opportunities to do laundry. Having said that, stick with a color scheme like black and white. Use packing cubes. No more than 3 prs of shoes ( one that you wear)."}, {"username": "Ann Law", "comment_text": "Wear your favorite things. There are laundry’s all over."}, {"username": "Evija Gintere", "comment_text": "Fyi i went to Rome this June for a week and my observation was - too many people are taking carry-on bags nowadays.Both planes (to and back) had to remove some of the bags and check them in eventually.So prepare yourself for that."}, {"username": "Lisa Flanders", "comment_text": "If you heed no other advice…\n\n~Pack as lite as possible!!! (You’re going to need room for what you buy.)\n~Cobblestones EVERYWHERE!!!\n~And more stairs than you’ve ever seen in your life! Up/Down/Up/Down\n🥵😱🤦‍♀️"}, {"username": "Claudia Pace", "comment_text": "The size of carry on luggage accepted varies slightly from one Airline company to the other. (In another group people shared the dimensions of carry on accepted on board.) In one of our flights, the flight attendant told us that if we could not store the luggage in the overhead bin in a perticular way, he would have it checked, so you may want to verify with your Airline first.\nIf you have a connecting flight with a short period of time to go throught customs, it’s easyer if you only have carry on luggage.\nIf you travel by train, the overhead bins are not very big either. You might need to stow it at the end of the wagon. Some people are not confortable with this, so it’s better to think about it while making a choice at home.\nIf you plan to be in Italy during summer you might want to consider that the weather is hot and humid, your hair & face skin could be impacted. It might influence your décision on products you will need abroad."}, {"username": "Ellen Edmonds-Wilson", "comment_text": "Consider how many million bags get checked for flights. It’s a tiny proportion which get lost and even fewer are lost forever. We travel with checked in bags. My bag weighs 16kg or so. I’ve hauled it up the three steps onto the train and down again across Italy but never needed to do more than that. The platforms at stations were flat where we travelled and the taxi drivers or water taxi people put it in their boot. One tiny hotel didn’t have a lift and we were on the third floor, but the Porter took our bag up. I decant makeup into containers smaller containers for shorter trips but for a month take travel sizes. The body cream ran out two days before we left - but who knew that they had shops in Italy which sell everything you could possibly need? Even insect repellant and sunscreen?"}, {"username": "Jane Skeffington", "comment_text": "I wouldn't worry about it yet as so many things could change between now and then. Your trip is two years away."}, {"username": "Iris Weber", "comment_text": "Check with your airline about size of carry on luggage allowed. If it’s too big or too heavy you will have to check it in. The rules for that are totally different from one airline to the other. I myself travel a lot, not only within Europe but also to Asia and America and never had any trouble with my luggage. And don’t forget to check what is allowed in carry on luggage."}, {"username": "Karen Vanek-Korn", "comment_text": "I had reservations at first but I have traveled successfully to Europe using a carry on and backpack. I’m always thankful I did when faced with narrow spiraling staircases to my room, hotels with no elevators and trying to maneuver through the streets, transportation,\netc. Keys to success are stick to two predominate wardrobe colors, follow the rule of thumb that each piece of clothing should be used to make two outfits, instead of bulky sweaters, plan on warmth if needed through layering pieces (light weight sweater over a top), bring some accessories like a scarf or necklaces/pins that don’t take up room but create a new look. Depending on the season I limit myself to a walking shoe/sneaker, a boot/sandal and a dressier pair of flats. Wear your heaviest shoes/clothes when flying. There are smaller sized travel hairdryers that fold. I’ve never had a problem finding a laundry mat or use the hotel laundry service. Travel size bottles for your toiletries can be found on Amazon or get the refillable empty bottle and fill yourself. As for carry on size, be sure to check the specific sizes for your airlines. They do vary. Rick Steves website has packing lists, etc. that follow this philosophy. It’s very doable and you can still look nice while being comfortable."}, {"username": "Elaine Travis", "comment_text": "Was just in Europe for a month with just a carry on and small backpack I ended up purchasing a curling iron there even with the proper converter mine was getting way too hot most hotels and Airbnb have dryers"}, {"username": "Connie Dennis", "comment_text": "Same old same old questions every day!"}, {"username": "Debbie H DeLoach", "comment_text": "We used Apple Air tags for our checked luggage"}, {"username": "Lauren Vassallo Beattie", "comment_text": "When I travelled the best advice I got, don't stress do what you want, worst case you need to purchase new clothes and a suitcase."}, {"username": "Linda Yahn", "comment_text": "My luggage didn’t arrive in Torino for 8 days after I arrived. On the way back…..didn’t get it for three months. Wine was fine, cheese total ruin."}, {"username": "Terri Wood Black", "comment_text": "Check with the airline. It’s not only size but weight too."}, {"username": "Dann Hrusch", "comment_text": "Just easier to travel light, not wait around for baggage claims, have peace of mind, etc. Osprey has a great wheeled backpack (Fairview/\nFarpoint 36L) that meets carry on requirements."}, {"username": "Izzie MacDonald", "comment_text": "Well, I'm 65, have travelled round Italy from N to S for the last 5 weeks with a backpack only!!\nEasy on trains & buses ..far too hot to struggle with suitcases as I've seen many do..\nI leave the hotel looking reasonably presentable ....& don't worry bout anything else!! Oh..except where to get food n wine pronto!!"}, {"username": "Bambi Harris", "comment_text": "I am only doing carryon but we are only going a week. It might be tight, but if you are still considering going that route there are many youtube videos on packing lightly (layering clothes to create different outfits, that sort of thing). Have a great time!"}, {"username": "Jessica LaRose Cappuccia", "comment_text": "What size is good for a 2 week stay. Trying not to overpack and never been...."}, {"username": "Miriam McNally", "comment_text": "You'd need to check on airlines' websites, for example Ryanair permissible cabin bag sizes are smaller than others. I usually only bring carryon, and have a hairdryer with brush on the end, it saves me tons of space and works brilliantly on my hair. Vacuum bags are also good for maximising your space. There are countless vids on Youtube of how to pack small."}, {"username": "Sarah Emerson Nelson", "comment_text": "I’ve travelled both ways - checked luggage and carry on only. I understand the reasoning for both. This summer I travelled to Europe and Morocco and knew I’d be navigating cobblestones and hills so opted for carry on - and specifically a backpack, which made me feel a bit like I was back in my youth! But it was much easier than if I’d been lugging a large suitcase on narrow streets with lots of people. But I did feel a bit juvenile at times - not my usual professional self - and yet who cares?\n\nThat said, if I were to do a regular carryon suitcase in the future, which I would for other trips, I would make sure the measurements fit all airlines I’m using. My backpack was no problem (Osprey 55L, large and daypack so carryon plus personal item), as it was soft so could conform to the shape of hard suitcases and any airline specs. However, I saw people get turned awa to check their carryon for being an inch over size, or being 2 pounds/kilo over weight - though I’m sure not all airlines check. One of my travel companions was overweight and oversized very marginally and worried at every checkin but no one checked… so it all comes down to what stress you want to live with. Rules, comfort, stress…\n\nHope this helps offer a nuanced response."}, {"username": "Sharon Zadik", "comment_text": "I have a good dual voltage flat iron. I bought it in a local salon. I always take it with me when I travel. I use whatever hairdryer is available."}, {"username": "Chris Vilsack", "comment_text": "Don't pack a lot\nYou can wash things in a sink\nOr a local laundromat\n\nAnd lost luggage is so rare\nI travel a ton\nIt happened once\nAnd they ran me my bag to my apt un Madrid the next day"}, {"username": "Elizabeth Dancy", "comment_text": "It’s not so much about lost luggage… that is an issue don’t get me wrong but it’s more about ease of traveling. Lugging a big piece around would not be fun. I’m seeing it all over London and you can see the look of regret in their faces."}, {"username": "Alexandra A Welker", "comment_text": "20-21\". I have Samsonite brands, hardshell because it's lightweight. Europe flights/\nairlines are more strict with their carry on luggage vs US."}, {"username": "Susan Levine Solomon", "comment_text": "Apple air tags are a great way to keep track of where ur bags are! Just incase they do get lost."}, {"username": "Mary Lou Gillen", "comment_text": "I purchased two bags a month ago just to have on hand. Advertised as carry on 22in luggage with wheels by Swiss Air. My daughter and one of her children were going on vacation to Virginia for a week. I told her to take these bags because they are carry on types of luggage. She got as far as boarding the plane when she was told she had to check them. She was flying on Southwest which I guess was her first mistake. Plus a six hour delay coming home. No holiday and mid week.\nAnyway now I’m afraid to use this luggage myself since I would probably be going to another country. I’m afraid if I’m told I have to check my 22in carry on luggage I’ll get so damn pissed off I will ruin my trip. What airlines actually let you use advertised carry on luggage?"}, {"username": "Gina Christopher", "comment_text": "Sorry to the people who have ever had thier luggage lost, but statistics show the chances are less than 1 percent. Life is full of gambles...just enjoy!!!"}, {"username": "Laura Bortolamiol", "comment_text": "My brother family of four travelled with carry on.\n\nSometimes travelling we can’t keep the same hair regime like home.\n\nI was just in Cuba and had to let my hair do it’s own thing. 😛"}, {"username": "Kathleen Roll", "comment_text": "In the UK they can be tiny! Airline dependent.\nI have always taken hold luggage to Italy."}, {"username": "Sandra Ferrante-Kohn", "comment_text": "I agree with so many others. Pack clothes that don’t wrinkle and fold easily. Use clothing that you can mix and match. Two pair (only) of comfortable shoes and one jacket. Personally I found using vacuum storage bags a wonder because I could get more into them with less space and when you need to close them up a second time any decent hotel will let you use a vacuum to do so.\nI use a duffel style nylon carryon. It takes less room, but holds a great deal. I have one change of clothing (just in case there is a problem with the rest of my luggage) and I carry my medications with me. Remember, short of medications there is nothing that you could accidentally leave at home that you can’t purchase there.\nHave a wonderful time. Italy is glorious. We will be taking trip #5 in late September."}, {"username": "Pong Ac Ai", "comment_text": "One carry on and I back pack that doesn’t require check in luggage is the best do laundry every 4 days hope it works"}, {"username": "Jeri Coleman Wiser", "comment_text": "Mine was 21\", European airline size. There are 5 adults in my family from 28 to 63 years and we each managed to cram what we needed into our carryons and an under the seat backpacks. I didn't bring ALL my lotions and potions, but I did bring some. I had never traveled carryon only before, but I didn't regret it. We had transfers to and from the airport, but still had to lug suitcases up stairs, onto trains, boats and taxis, over bridges and cobble stones. Tons of great info on packing lite available. Lots of travel size options. Most hotels and Airbnbs have hairdryers. We also went to Italy and Greece. I brought a compact duffel to use for my souvenirs on our flight home. Enjoy you travel planning!"}, {"username": "Harris Dee", "comment_text": "Checked or carry on … do both"}, {"username": "Sally Iovene Haase", "comment_text": "When I travel abroad I travel with a hard sided Tumi international sized carry-on, an expandable Knack convertible backpack (this bag is expandable, can be used as a backpack or tuck away the straps and it goes over your luggage handles and most importantly it fits under the airline seat) and a foldable packable duffle. I recommend a hard sided carry-on and not a fabric piece because they can be overstuffed. I have observed international airline attendants targeting people with soft sided pieces making them measure their bags before allowing them to board. My Tumi has been to many countries and on many airlines without issue. It is expandable which is helpful for the trip home. For the trip home I usually use my Tumi for anything that I've bought that might be breakable, toss my clothes in the packable duffel, check both pieces and just bring my Knack bag on the plane for the ride home. If you plan on taking private transportation from the airport to your destination, by all means check whatever size suitcase you'd like, but if you're changing locations or countries and you're schlepping your own bags on and off trains, remember you're not a body builder nor a pack mule."}, {"username": "Brian Osman", "comment_text": "Check in early and you won't have a problem with your luggage, it's the late comers that have problems"}, {"username": "Trish Ellis", "comment_text": "I’m with hubby. Do not want to carry or roll a piece of luggage through airports, bathrooms, eateries, etc. I carry on basic makeup and medications. The rest gets packed. Over 35 international flights and only 2 delays. That was years ago. we checked in to our hotel and took a walk the bag. When we got back the bags were in our room."}, {"username": "Autumn Barber", "comment_text": "Hotels will have hair dryers and shampoo. Take conditioner. Roll your clothes. Take travel detergent packets. I washed tops. No bulky clothes."}, {"username": "Fetchin Gretchen", "comment_text": "Lately almost always my carryon rollbag must be checked as well...at the gate."}, {"username": "Don Bentivoglio", "comment_text": "Lost and/or delayed baggage are a very small percentage of the bags handled by the airlines. We tend to hear some of the \"horror stories\", but don't read about the millions of travelers who simply pick up their luggage at the carousel and move on to their vacation."}, {"username": "Mike Adams", "comment_text": "Most hotels and Air BNB S have hairdryers.\n\nYou can do 4 weeks out of a carry on.\n1 pair good walking shoes\n1 pair comfy shoes for indoors\n1 pair flip flops - pools, spas ets.\nPack thin clothes made from fabrics you can wash out and will dry easily and quickly.\nThink layers.\n\nAllowable carryons in for European budget airlines are smaller than American ones. By about 4 “.\n\nGo to Tumi website and check out dimensions of US vs European carryons.\n\nHave a great trip!"}, {"username": "Kathy Holden Reams", "comment_text": "We are here now in Rome and have been here for ten days. I’m so glad we only did carry on because it’s not only your luggage getting lost but also rolling it through the streets to your destination. It’s brutal in this heat!"}, {"username": "Julie Saritag", "comment_text": "I wouldn’t do it. It’s too stressful cramming what you need into a carry on and different airlines have different sizes. Pack your suitcase. Put a change of clothes and underwear in hand luggage just in case. For every horror story there are a million stories that are good."}, {"username": "Lee Say Lor", "comment_text": "The size approved by airlines"}, {"username": "Peter Guzman", "comment_text": "Peter Guzman"}, {"username": "Peter Guzman", "comment_text": "Peter Guzman"}, {"username": "Peter Guzman", "comment_text": "Peter Guzman"}, {"username": "Ann Applegarth Veith", "comment_text": "Carry it on......carry it on....carry it on."}, {"username": "Zoe Croasdale", "comment_text": "The beauty regime is an issue. All liquids creams etc have to put through security separately in hand luggage. I am the same in that I love my lotions and potions! Getting out a plastic bag full of stuff, checking sizes etc would just be a pain."}, {"username": "Lisa Verney", "comment_text": "We did 10 days hand luggage only recently to another European destination. I'd highly recommend it, you don't waste time in queues checking in or retrieving your luggage.\n\nDon't take a hairdryer, most places have them and you can always check at reception desk if there's not one in the room.\n\nGet sample sized makeup and skincare, a lot of beauty counters do them for free with a purchase and as you've got time you can start collecting them now or you can purchase minis from almost all brands now. Most places also have shampoo or shower gel so either don't buy them or get them in country.\n\nMini hair brushes are a great space saver and overnight curls do wonders for making your hair look nice.\n\nPacking cubes seem daft but they really help organise your stuff for ease.\n\nFlat shoes pack small and wear your boots/trainers.\n\nA small packing laundry bag and a carabiner clip to pop it on the outside of your bag in country to keep separate from your clean clothes and means you can take things to a launderette easily so you can pack less.\n\nTake thin dresses/skirts so you can get more outfits in. Dresses in particular make an entire outfit and are easily dressed up or down. A thin waterproof jacket and one nicer jacket that can be used for dinner (wearing the heavier one to travel).\n\nPlain t-shirts dress up or down nicely. Take a pair of thin \"work style\" trousers.\n\nA good sized scarf that can double as a wee blanket/wrap for colder moments.\n\nA hat is a great idea, just make sure it works with most of your outfits, or an extra carabiner to clip it to your bag.\n\nLook up \"capsule wardrobes\" so you can make sure all the clothes you take work together easily.\n\nHand luggage sizes differ greatly between airlines do just make sure to check any you know you'll be flying with."}, {"username": "Monique Swanner", "comment_text": "I believe mine is 21 inches and about 15"}, {"username": "Christina Beuchert Guerricagoitia", "comment_text": "I just came back from 11 days in Spain. I really never thought I would do a carryon luggage. But the personal item backpack helps a lot. The issue is you can only carry 1 quart size of liquids, so if your beauty regime includes a lot of bottles they take up a lot of space. But to my surprise I was able to fit a lot of clothes because I did multiple shorts with multiple tops and mix matched. I even over packed! I wish I never brought my big floppy pretty hat, it was a pain to carry, and my head was too hot to wear in 100 degree. If you bring a big hat, wear on plane and have some sort of clip to attach to luggage. I measured my luggage to meet my airline and it was perfect, 22 inch. I think you really need to pay attention to wheels. Definitely 4 wheels, but mine are smaller, but since measurements include wheels I got more luggage space, half inch maybe? It is over 10 years old so I am going to get a new one for Italy. I will caution shoes, you don't need any heels, and I over packed sandals, maybe 3 max. I like to pack a few weeks prior and start to take things out as i rethink my over packing. You CAN do it!"}, {"username": "Jacquie Johnston", "comment_text": "In 35 years of travel I’ve had 1 bag show up 3 days later."}, {"username": "Rachael Richardson", "comment_text": "We checked in me bag with toiletries and other items that need to be checked, otherwise we looked at our airlines bag dimensions and carried on bags,\nAs for hairdryers every place has then , but If you come to Italy at this time of year you will look a sweaty heap most of the time , no one really cares , unless you are staying in really posh places, then you may need to dress up a bit! I’m 50 look after myself but on holiday I just go with it ! I will never see anyone again , if you travel when it’s cooler then maybe you will look better but in 40 degree heat and 63% humidity no one looks good ! X"}, {"username": "Renee Rundle Stoneham", "comment_text": "21” including wheels.\nTake a tape measure with you.\nTJ Maxx usually has good selection, Macys Dillards etc…\n\nI’m 57 and did 15 days in France and Italy with just carryon and backpack.\nWe did hiking in France before heading to Italy, so that put a little spin as I needed hiking shoes which are bulky!\nOtherwise you only need 2 pairs of shoes.\nPack socks other small items inside shoes.\nUse compressed packing cubes.\nWe did laundry 1/2 through before heading to Italy."}, {"username": "Gillian O'Callaghan", "comment_text": "The best size is the one that meets your airline requirements...\n.all of the airlines."}, {"username": "Shirley L Jones", "comment_text": "No one posts about a successful arrival of bags!\nIn 35+ years of international travel I have never had a missing checked bag."}, {"username": "Carla Vee IsMe", "comment_text": "Check w your airline about what size they allow for carryon"}, {"username": "Stephanie K. Cox", "comment_text": "Following"}, {"username": "Renee Kremesec", "comment_text": "On our recent trip\nLuggage was lost 4 TIMES.\n2 carry ons they asked me to check and 2 of my families checked luggage.\nDO YOURSELF A HUGE FAVOR AND GET APPLE OR ANDROID AIR TAGS.\nThis proved its weight in GOLD. We could track our luggage and got our bags back much quicker.\n\nI did take a blow dryer but NEVER needed as there was one in every AirBnB and hotel so I wouldnt waste space.\nYou will need a converter if you are plugging a straight iron or blow dryer in. NOT just a european plug but a Voltage converter or anything you plug in from the USA will short out.\n\nI had a carry on of just clothes and put everything else in a back pak I bought online.\nIt worked well and I traveld for 7 weeks."}, {"username": "Renee Tanner", "comment_text": "Each airline has specific measurements for what it considers ‘carry-on’ and ‘personal item’. That info will be in their website."}, {"username": "Madeline Caporale", "comment_text": "Check your booked airline(s) for size and in some cases weight limits. If using multiple airlines, use the most restrictive so it will work with each carrier. Note that your boarding order may require gate check even if you are within limits. Remember to check the overall dimensions that include the total height of wheels and handles. Read specs of luggage carefully. Many that claim to be 21 inch are not when including wheels and handle."}, {"username": "Robyn Lawson", "comment_text": "I always have checked in my main case and never had a problem, and have flown Internationally\nmany times. Just go with a good airline. Check in your case 😊"}, {"username": "Holly Summer", "comment_text": "2025?! At the moment there’s more issues with luggage being lost etc as there are more strikes and less workers at airports and airlines post covid as travel rebuilds. By 2025 - this will be quite different. I’m a travel agent and have travelled extensively - never had any issues with lost luggage personally."}, {"username": "Judith Fuller", "comment_text": "Check the size for the airline you are using."}, {"username": "Rhona OConnor", "comment_text": "You can check in luggage. 99% of the time it arrives no problem. I do it always. I bring about 14kg in my bag.\nYou can get a tracker or airtag for your bag so if it gets lost you know where it is as the app tells you.\nAs for your hair..... The heat/humidity will be take care of that despite your best effert. But everyone is in the same situation."}, {"username": "Linda Love Vines", "comment_text": "Large suitcases are really tough to manage on ferries (Greece if you are going to multiple islands ) and trains. It’s SO worth it to bring a roomy backpack as your personal item, and a wheeled carryon that fits the airline specs. Bring a foldable bag to check on the way home in case you buy anything. We used compression packing cubes and it really helped. Also, crazy hair here so the most important liquids to me are conditioner, hair oil etc. Every place I’ve ever stayed has had a hair dryer."}, {"username": "Carolyn Adams Brown", "comment_text": "Be careful with your baggage weight. Both lufthansa and swiss airlines weighed our carry on baggage. My carry on had to be checked on our flight to Rome."}, {"username": "Laura Jetton", "comment_text": "I did a carry on for 4 weeks- is doable- just need to do laundry a couple times.\nStill get an AirTag for your luggage and your purse, and a phone leash so you can keep your phone close.\nThe AirTag can even help you find your way back to the hotel. 😃\nThe hotels have hairdryers, but if you must, take a compact one.\nEnjoy your trip."}, {"username": "Karen Schmidt", "comment_text": "My daughter and I went last September. We checked smaller suitcases/\nbags. They are too big for the overhead, but easily manageable for us on the trains. The key to the bags is having really good wheels and packing cubes. Ours have extra large, meant for trekking kind of wheels. They convert to backpacks if we want (but in Europe I’ve not used that feature yet). We never take a hair dryer, but my daughter did buy herself a flat iron in Amsterdam. I like not being restricted with my purchases if I have liquids. This way they can go into the bag. Example… a bottle of liquor, specialty, balsamic, etc. I also don’t like to worry about overhead space on the planes.I put an apple tracker in each bag. So far we’ve been lucky ￼"}, {"username": "Michele Drozdowski", "comment_text": "Check your airline for their size requirements. Carry on is the only way to go. Definitely don’t overpack and dont bring anything long for the summer."}, {"username": "Rasha Za", "comment_text": "And dont travel Lufthansa unless its business or 1st class"}, {"username": "LoriKerry Palmer", "comment_text": "I put everything in a carryon for 3 weeks in tally and still didn’t need it all!"}, {"username": "Lisa Quinn", "comment_text": "I don’t check luggage. We just had our laundry done in the two weeks that we were there. It was amazing, and so freeing! ￼"}, {"username": "Cindy Santa Ana", "comment_text": "Just got back from 18 day trip using a 40 L backpack that I carried on. I had 4 sundresses, 4 tops, 2 skorts and sandals and a hairdryer. I took laundry sheets and booked Airbnbs with washing machines. I bought 2 shirts and another sundress while there and other souvenirs like earrings that fit in my bag. It's doable, easy to get on trains and easy to get around without lugging bags over uneven roads. I even travel in the US with just my backpack now and haven't checked luggage in 4 years!"}, {"username": "Laura Torres Palomino", "comment_text": "I packed a several pull on/fitted skirts and tees…rolled them up and lined my carry-on with them. A thin/\nlightweight cardigan to wear on the plane and when visiting churches. Airbnb’s are awesome and inexpensive, you can do laundry in most. Wear your heaviest walking shoes and jeans on the plane. Take one pair of comfy sandals. You can buy makeup and lotions/\ntoiletries over there."}, {"username": "Sarah Longman", "comment_text": "Please don’t let the horror stories rule your travel. I’ve travelled a fair bit, international, and domestic. I have never had to deal with lost luggage. Yes, I’ve done up to three flight changes, to get back and forth to Italy in the past two years. I did a carry on and checked one bag. All was good."}, {"username": "Elizabeth Hewitt", "comment_text": "As someone who had their luggage “held” by striking airline workers for 26 of our 28 day trip, here is my advice:\n- if you’re going to carry on, create a capsule wardrobe of mix & match items in base colors (black, white, khaki, navy), pack some lightweight scarves to add color, take a pair of sandals and a pair of tennies and then buy anything else you want/need there\n- if you’re going to check luggage, pack at least 2 outfits in your personal carryon and distribute a few other outfits in everyone else’s luggage so if one or more people “lose” their luggage you all still have something to wear\n- book at least one airbnb with a washing machine on your trip so you can do laundry & wear things again"}, {"username": "Sonny Ash", "comment_text": "Just remember, unless you're with a tour group it's unlikely you will see the same people two days in a row, Don't over pack. Easy for me to say, I'm a dude."}, {"username": "Joan Andromidas", "comment_text": "As a rule of thumb, whenever I check a bag, my carry-on has extra underwear and two outfits, in addition to anything else I need that couldn't be easily purchased at my destination."}, {"username": "April Blair", "comment_text": "Pack a carry on and checked bag. Packing cubes are your friends."}, {"username": "Jaci Rummel", "comment_text": "We just got back from a European cruise and stay overs in Italy and Greece. We bought new luggage that was small enough for carry on. I decided we would check one bag. I look like Albert Einstein without hair tools but took nothing for styling other than product. Even with the small bags, I overpacked, so choose your clothes then cull again!\nPlan to go to a salon at least once. Well my bag broke so I bought one large bag. It was actually nice to only have 1 carry on to deal with and on our stop over in Paris at 1 AM!\nWe got our luggage just fine!\nTake what’s comfortable. It’s better to check your bags than fumble with smaller bags and be a target.\nFind clips and hats for your hair.\nHave fun."}, {"username": "Anna Treviño O'Campo", "comment_text": "Get an air tag they said ... u can find your luggage they said. Apparently, u know where your lost luggage is but no one is going to go out of their way to follow the tag and go get it. I've heard \"stories\" where an airline employee did follow a tag to go pickup luggage found on air tag but that's not their job. Our flights don't just stop they \"change\" but I'm just gonna take my chance."}, {"username": "Allison Mir", "comment_text": "Depends on your airline and often what ticket you’ve bought"}, {"username": "Lauren-Jade Roberts", "comment_text": "Take a checked bag, there's no way you'll want to wear the same clothes in two quite different places for a month!"}, {"username": "Sandra Desmond", "comment_text": "I’m checking in a 20 kg bag plus I carry on bag with me on the plane if you have medication or anything important to you bring it with you"}, {"username": "Rose Anderson", "comment_text": "The size and weight restrictions for regional flights in Europe are smaller than in the US/with the major carriers. If you will be taking any of those smaller flights, you might want to consider that. Also consider if you will be taking trains or a water taxi (Venice) because you will have to haul your own bags up and down the steps and keep track of all of that. Lastly, unless you have a car taking your from airport to hotel and back or between the train station, you will be walking with your luggage and there tends to be a lot of stairs every place and uneven ground. So, consider what you can manage. Also, consider the time of year because in the summer the heat is VERY oppressive and hauling your bags only adds to that. We were with friends last week whose luggage never arrived and they bought all new clothes etc. But other friends had no issues-- so I would trust checking a bag but be more concerned about hauling things around in between. The less you bring the better off you will be. Also, I never used my hairdryer-- literally every place we stayed had one."}, {"username": "Iris Joan Price", "comment_text": "You do not want to be schlepping large suitcases everywhere with you, only what you can comfortably handle alone and keep track of, even if you are traveling with others. I know all about the \"health and beauty regimens,\" as I have been over 55 for quite a while. Do not take a hairdryer, curling, or flat iron. Every hotel and any worthwhile Airbnb provides a hair dryer, and local women do not fuss with their hair. If you want to splurge on yourself, spend a day at a salon while away. Whittle down all your usual \"must haves\" to what would I need in worst case scenario (Rx meds, for example). Pack and then unpack what does not fit and is not an absolute necessity. You are traveling to see other countries, not your own face in the mirror no matter how lovely you are (and we all are or have the potential to be beautiful on the outside as well as from within). I am as vain as the next person and normally obsess about extra pounds or a strand of hair out of place, but when traveling, the sooner you let go of all those worries, the more enjoyable and memorable your trip will be. Allow space for the unexpected and welcome the experiences. We travel to take a break from our usual lives, right? Let go of all but the essentials and leave your worries at home."}, {"username": "Jenny Payne", "comment_text": "I’m a big van of Samsonite luggage mine has lasted so far 16 years travelling around the world & 2 Italy every year . I think they have made the cabin one smaller than the one I have but still is excepted on major airlines. I’m lucky I have curly hair so don’t use a hair dryer. A tip don’t take the world, lay it out and start culling,if u think u might need it u won’t ,believe me it is hard work getting on & off trains, and only take liquids in small bottles 🌻"}, {"username": "Doug Burke", "comment_text": "We've had these two carry-on bags for 25 years and they've been great for probably 30 big trips including one around the world part of which was on the Trans Siberian Railway. Everything goes in these including my wife's hair dryer."}, {"username": "Kristin Lynn", "comment_text": "Been traveling internationally\nfor years and only travel with carry on suitcase and a backpack. Compression cubes are your friend. Roll your clothes. Have a color theme that you can just switch out a piece of the outfit for evening wear, scarves to make things dressier…Here is the compression cubes that I use: COVAX 4 Set Compression Packing Cubes, Travel Luggage Organizers and Storage Packing Cubes, Blue https://a.co/d/\n0oQ6o8b"}, {"username": "Kanika Thet", "comment_text": "I’d recommend have a Medium Size suitcase for check-in, and have a small carry-on or duffle bag with some clothes and essentials with you. Yes, there are some stories about late or lost luggages but 80-90% are fine. But good to take precautions.\n\nI’d recommend invest in AirTag. I have never experienced a late/lost luggage yet, but as precautions all my luggages now have their own AirTags. Especially when you travel between cities, and need to store your luggages at a designated area away from your seats. You’d feel safer, knowing where they are.\n\nChoosing when to travel is important as well. If you come in the middle of peak/holiday period, it tends to get crazier with the crowds and chaos, so the chances are higher, but if you come during non-peak or at the beginning of the peak, most likely you’ll be fine."}, {"username": "Annette Heckhausen", "comment_text": "Keep in mind, that Airlines in Europe can be very strict with carry on luggage. Means that sizing of allowed carry on luggage offen differs from US measurements. Also most major european Airports check the weight of your carry on. As it mostly may not exeed 8kg, you may not be happy with just around 5kg of clothes and stuff as luggage itself weighs around 3kg.\nFrom the US you might make it with your heavier carry on, but dont count on beeing safe while traveling around Europe.\nThe big problems with lost luggage were last summer due to lack of staff.\nMuch better now. So why the hassle, take your suitcases!"}, {"username": "Paulette Molasses Sims", "comment_text": "You'll definitely need a checked bag because you're traveling to more than one country for a month."}, {"username": "Jill Speck", "comment_text": "This is the size I took for a month in Europe. And I took too many clothes, as it turned out!\n\nAlmost every place you stay will have a blow dryer. I wouldn’t waste the space to take one."}, {"username": "Rose Stolarek", "comment_text": "We spent two months in Europe all luggage was fine"}, {"username": "Donna Johnson", "comment_text": "There is an awesome Facebook group Travel Fashion Girls® (Official TFG Community)\nJoin this group and you will get all the tips and pointers you will ever need for traveling COO (carryononly)"}, {"username": "Irene Oda", "comment_text": "When are you traveling?"}, {"username": "Julie Adams", "comment_text": "My best packing advice is to make sure each item of clothing you pack pairs with something. I’ve had a bad habit in the past of just packing everything I like but then I get to my destination and I don’t have pants that look good with this shirt and I need different shoes with that outfit and then it doesn’t get worn at all. Find out if there is laundry facilities near where you are staying. There almost always is a laundromat somewhere close but your host will know (or hotel concierge). I’d any day rather pay for laundry services than schlep too much around with me again."}, {"username": "D'Anna Hohe", "comment_text": "If you aren’t traveling until 2025, wait until closer to your departure and check on the situation. This situation of cancelled flights and lots of lost luggage is really since post CoVid, and hopefully it will be corrected. Then you can decide if the nature of your trip, such as lots of movement by train, is a good reason to travel with only carry-ons."}, {"username": "Matthew Livio Conti", "comment_text": "2025?"}, {"username": "Lisa Valdovinos", "comment_text": "We used Apple Air Tags that tracked our luggage."}, {"username": "Miyuki Kanno Paul", "comment_text": "Check your airline’s carry on policy first before investing in any bags. Every airline has a different policy especially if it’s an intra-Europe low cost carrier. What is ok for one airline is not ok for others"}, {"username": "Lora de Vries", "comment_text": "You are stressing way too much and I think not enjoying the idea and planning of your trip, which is two years away. A lot can change with the situation at the time you travel i.e. flights, airports etc. Carry as much as or as little as you want, when the time arrives. Don't be put off with the horror stories and the pressure to do carry on only. Look at hotels and what they offer in terms of a hair dryer etc. Even though we normally stay in 4*&5* accommodation, I still carry my own brands of shampoo and conditioner etc., as that is my preference. Just be comfortable with the way you want to look on vacation, and like you, I feel the same way about looking and feeling good!!"}, {"username": "Desiree Jimenez", "comment_text": "I have both Eagle Creek and Pacsafe luggage and Pacsafe backpack and purse.\nPacking cubes are lifesavers with carry-on luggage.\nI have medication, documents, etc. readily available in my backpack (which stays with me at all times and is locked)."}, {"username": "Jo Ann Perrotta Solimando", "comment_text": "All hotels we stayed in had hair dryers"}, {"username": "Steve Grossman", "comment_text": "Not saying it can't happen but I am a million miler on three different airlines and I have never lost a piece of luggage."}, {"username": "Jackie Hartley Brooks", "comment_text": "I am curious as to why everyone is so afraid of 'losing' luggage. #1 As mentioned you only hear the horror stories. No one posts \"oh, we picked up our luggage 70 times without issue\" #2 While admittedly, I would be beyond annoyed at the inconvenience/\ntime wasted, since nothing of value is in my checked luggage, just go buy whatever you need. #3 Our checked bag is not that much bigger than a carryon, but it is worth it to me not to have to stress over packing. #4 There is always the chance that you will have to check your carryon. In over 50 years of travel as family+ plus husband who traveled extensively for work, we have only had 1 delayed 2 days. That was on the way home, but , naturally, it was the 1 that had a Portuguese Man of War in a plastic bag that son HAD to have for Sharing. 🤣🤣"}, {"username": "Phyllis Snyder", "comment_text": "Hi- heavy luggage can affect your ability to enjoy your vacation. Mainly because lugging them around crowded places and up & down trains & stairs. Best to rethink what is absolutely necessary. Ask your accommodations if they have hairdryers- and laundry access- and Italy has fantastic beauty products that can be purchased when you arrive."}]}, {"id": "2194635727602172", "text": "has anyone on here experienced renting a car in Bricen/Bressenone? i found it hard to find one in smaller town; we’re gonna stay in Brixen and exploring Val di funes and Seceda. Any recommendation a reliable local rental car there?", "link": "facebook.com/groups/1373361046396315/permalink/2194635727602172/", "likes": 0, "comments": []}, {"id": "2194635504268861", "text": "We need recommendations on where to stay in Cinque Terre. Having difficulty finding rooms. We do not have a car and would like to be in town.", "link": "facebook.com/groups/1373361046396315/permalink/2194635504268861/", "likes": 0, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2194633894269022", "text": "Hi Everyone!\n\nWe are debating whether we should exchange dollars to euros here at home, or wait to get to Italy. What has everyone’s experience been? What is the conversion rate in Italy today? Thank you so much!", "link": "facebook.com/groups/1373361046396315/permalink/2194633894269022/", "likes": 2, "comments": [{"username": "Glenn Todd Webb", "comment_text": "Don’t. Take few hundred US. Withdraw from atm when you land. Use credit card for almost everything"}, {"username": "Kristina Ruk", "comment_text": "As going to every country its better to change in Italy. Of course the best to withdraw from ATM or pay with card if it is possible"}, {"username": "Kristi Pitts Todd", "comment_text": "I got euros from my US Bank. They sent via FedEx to me in 2 business days. No extra charge. Just easier and convenient for me."}, {"username": "Chris Vilsack", "comment_text": "I would bring it. And use a credit card without an fx transaction fee. If you don't know the various fees, just Google it."}, {"username": "Line Gregoire", "comment_text": "Wise debit card, lowest rates i've seen"}, {"username": "Stephanie J Stevenson", "comment_text": "Always when we arrive. So easy."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Please do a search. This gets asked multiple times a day."}, {"username": "Simone Pfenninger", "comment_text": "Discover Italy | Best Places and Travel Tips\nGood evening\nI've got a question Why can't I like answers or comment on answers anymore?\nThanks for the explanation !"}, {"username": "Anthony Sperduti", "comment_text": "Do it home"}, {"username": "Rebecca Branta", "comment_text": "Don't get many Euros! We are smart, experienced travelers and fell into this trap and were SO upset. We used our credit card for almost everything but then there is tipping guides, tipping at restaraunts, cabs so we went to exchange only $130 USD and we only got back $80....we almost cried. We only need a small amount to pay cash for taxi to the airport and tips...it was so ridiculous!"}, {"username": "Alexandra A Welker", "comment_text": "I recommend exchanging some from home with your bank (if in the US Triple A can exchange too) and then just use CC when you're in Italy."}, {"username": "Laura Piccinini", "comment_text": "You can use card everywhere"}, {"username": "Roxanne Galari La Rosa", "comment_text": "Chris Vilsack thank you!"}, {"username": "Larry Dash", "comment_text": "I always exchange some at home, use my cc and only cash for small purchases, gelato, water, tips etc\nAt least for me, I feel more secure knowing I don’t have to deal with an ATM. I’m ready to hit the ground. That’s just me though."}, {"username": "Lisa Valdovinos", "comment_text": "Do it here. It is cheaper and less of a hassle. If you get your euros there make sure to go to an ATM attached to a bank."}, {"username": "Teresa Bliss", "comment_text": "I'm getting my euros from my bank. And if I need more then I will get in Italy."}, {"username": "Victoria Marchetti", "comment_text": "It's free to exchange at your bank at least USBank. Airport charges 20% commission plus fees. If you take $ out of the ATM reject all conversions and let your bank get the best rate for you."}, {"username": "Ilene Tobey LaMalfa", "comment_text": "You can find a bank in Italy to get Euros but they aren’t always easy to find. Don’t use the change counters or Euronet ATM’s in the airport or the hotel desks to get Euros. Best exchange rate is at their banks."}, {"username": "Raf Gervasio", "comment_text": "We use post office travel card so easy"}, {"username": "Elisha Lynn Simon", "comment_text": "Use a bank ATM. In Croatia the machine ate my card and the words came on the screen showed temporarily out of order. Luckily the bank was open. The teller opened it from inside and I got my card back."}, {"username": "Maria Coladangelo Ducca", "comment_text": "Exchange your money at home"}, {"username": "Rosa Morabito", "comment_text": "So hard to get cash in Italy. Take some with you but you don’t need a lot. CC is used everywhere."}]}, {"id": "2194632630935815", "text": "Can anyone please tell me their experience at getting a taxi from the train station at Varenna to our accommodation. We will probably arrive late afternoon/early evening on a Monday and don’t want to be pulling our bags further than we have to. Were there taxis waiting at the station or does anyone have contacts they found reliable? Appreciate any recommendations. Cheers", "link": "facebook.com/groups/1373361046396315/permalink/2194632630935815/", "likes": 0, "comments": []}, {"id": "2194539900945088", "text": "Will be traveling to Italy in October and will have 2 days in Rome. Looking for a reasonably priced hotel that is central to many attractions, as well as recommendations for a private guide.", "link": "facebook.com/groups/1373361046396315/permalink/2194539900945088/", "likes": 0, "comments": []}, {"id": "2194626664269745", "text": "What's best way to travel from Genoa to Sestri Levante?", "link": "facebook.com/groups/1373361046396315/permalink/2194626664269745/", "likes": 1, "comments": []}, {"id": "2194631704269241", "text": "We are staying in sorrento - best way to get to the Path of the Gods hike - privte driver? bus? Ferry??", "link": "facebook.com/groups/1373361046396315/permalink/2194631704269241/", "likes": 1, "comments": [{"username": "Terese Barth Flynn", "comment_text": "Enjoy Italy!"}]}, {"id": "2194630417602703", "text": "We are US citizens, For colosseum tickets from coopculture, if the kids aged from 18 to 25, are the tickets free? Do they need full ticket or reduced ticket. It is very confusing to choose.\nDo we need guided tour for colosseum? Or is the full access ticket enough from coopculture website?\n\nI appreacite the answer.", "link": "facebook.com/groups/1373361046396315/permalink/2194630417602703/", "likes": 1, "comments": []}, {"id": "2194628960936182", "text": "Hi there, I’m looking for recommendations for a private boat trip from Sorrento that is suitable for travel with an 18 month old toddler? Has anyone done something similar recently? 😄", "link": "facebook.com/groups/1373361046396315/permalink/2194628960936182/", "likes": 0, "comments": []}, {"id": "2194627507602994", "text": "Planning a day trip from Sorrento! Do you recommend Amalfi, Positano, or Capri?\n(We will already be doing a day trip to Pompeii)", "link": "facebook.com/groups/1373361046396315/permalink/2194627507602994/", "likes": 0, "comments": []}, {"id": "2194627304269681", "text": "When you booked hotels in Italy did you say how many people would be in the room? or just book what you needed with the beds you needed?", "link": "facebook.com/groups/1373361046396315/permalink/2194627304269681/", "likes": 0, "comments": []}, {"id": "2194626120936466", "text": "Hi anybody stayed at this hotel and could give me any recommendations to a nice restaurant something special to book for my hubby birthday please 🙏🏼", "link": "facebook.com/groups/1373361046396315/permalink/2194626120936466/", "likes": 3, "comments": [{"username": "Allister Gardiner", "comment_text": "We will be staying at that hotel from 26th to 30th of this month😎 I hope the A/C is working🤞🏻"}, {"username": "Manon Beaucage", "comment_text": "Nice hotel! Ask them for recommendations\nfor restaurants!"}, {"username": "Mark Baillie", "comment_text": "F"}]}, {"id": "2194625647603180", "text": "Anyone take the day trip from Rome to the amalfi coast with boat tour and lemonchello tour ?", "link": "facebook.com/groups/1373361046396315/permalink/2194625647603180/", "likes": 0, "comments": []}, {"id": "2194624734269938", "text": "Headed to Pisa for a stopover next week. Do I need to reserve a luggage locker at stowyourbags.comahead of time or can I wait and likely get one at the train station if arriving 8:30 am? (It looks like it’s a little bit of a walk to the former and I’m traveling with my parents)", "link": "facebook.com/groups/1373361046396315/permalink/2194624734269938/", "likes": 0, "comments": [{"username": "Alexis McNamara", "comment_text": "?"}]}, {"id": "2194624160936662", "text": "Hello, we are doing a trip of a life time to Europe in September and I really need to find some great compression travel socks.\nWe are in New Zealand.\nAny recommendations would be welcome 🙏", "link": "facebook.com/groups/1373361046396315/permalink/2194624160936662/", "likes": 0, "comments": [{"username": "Carolyn McCormick", "comment_text": "Hi Lisa - as a suggestion - maybe try your local Pharmacy. Xx"}]}, {"id": "2194624247603320", "text": "How many of the main points of interest are you able to see in one day in Rome? Considering the tour-skip the line pass? TIA!!", "link": "facebook.com/groups/1373361046396315/permalink/2194624247603320/", "likes": 0, "comments": []}, {"id": "2194614377604307", "text": "Has anyone stayed at the hotel Constantini in Florence? Can you share your experience please? Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2194614377604307/", "likes": 0, "comments": []}, {"id": "2194612847604460", "text": "Going to Urbino next year, any suggestions to visit near by?", "link": "facebook.com/groups/1373361046396315/permalink/2194612847604460/", "likes": 0, "comments": []}, {"id": "2194612617604483", "text": "Can you bring in a backpack while touring the Vatican with a tour group?", "link": "facebook.com/groups/1373361046396315/permalink/2194612617604483/", "likes": 13, "comments": [{"username": "Stephanie Earl Peterson", "comment_text": "We carried a small backpack. We found something somewhere on their website with dimensions allowed. ￼"}, {"username": "Lee-Ann Kolenski Matalski", "comment_text": "We brought one in and weren’t questioned. It had snacks and water in it."}, {"username": "Jaison John", "comment_text": "Yes I went in today and brought in an Osprey Daylite backpack"}, {"username": "Anthony Sperduti", "comment_text": "Yes"}, {"username": "Melanie Manasseh", "comment_text": "Most places will allow backpacks and bags but most places also have security checks."}, {"username": "Anne Contini", "comment_text": "There are back packs and then there are back pack so a small one is OK but something the size of a military backpack would certainly be frowned upon and throughly searched ic not forbidden."}, {"username": "Shelby Cofer", "comment_text": "Yes! You’ll just have to pass it through the little security scanner (along with everyone else) and you’ll be all set!"}, {"username": "Kim Geary Keidel", "comment_text": "Yes. There is a security check and metal detector."}, {"username": "Laura Weir", "comment_text": "Laura Weir"}, {"username": "Bill Bowler", "comment_text": "There are rules in regards to maximum size allowed"}, {"username": "Joannie Houk", "comment_text": "Yes keep it close. Often they get stolen when you sit to pray. Cameras everywhere so it shouldn’t happen"}, {"username": "Joannie Houk", "comment_text": "Dress Conservative"}, {"username": "Cynthia Peraza", "comment_text": "My tour said no backpacks allowed but since we were inside I saw a ton of people with them. I think as long as they’re not huge, you’re fine."}, {"username": "Eng Yew Lee", "comment_text": "If you keep it small you can take it along with you. If you bring a large backpack, you’ll have to check it in"}]}, {"id": "2194610064271405", "text": "I’m heading to Bologna and Venice in November. Suggestions on day trips from Bologna and where to eat in both places would be appreciated!", "link": "facebook.com/groups/1373361046396315/permalink/2194610064271405/", "likes": 0, "comments": []}, {"id": "2194609024271509", "text": "Are there Uber or taxi services from Florence to Tuscany Chianti Classico region? I don’t want to rent a car. What’s the best mode of transportation? What wineries would you recommend to visit?", "link": "facebook.com/groups/1373361046396315/permalink/2194609024271509/", "likes": 0, "comments": []}, {"id": "2194608694271542", "text": "Question? I’m flying Lufthansa economy do they allow a carry-on and a personal item like a back pack free or do I need to pay for carry-ons since I’m flying economy? If I need to check a check does anyone know the price per bag?", "link": "facebook.com/groups/1373361046396315/permalink/2194608694271542/", "likes": 0, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2194606947605050", "text": "For anyone crossing their legs between sites, this is a good sign. If only there were more, but it's a start! It's cutely called a P-stop", "link": "facebook.com/groups/1373361046396315/permalink/2194606947605050/", "likes": 0, "comments": []}, {"id": "2194603447605400", "text": "A couple of questions about ROME…\n1-how early can you get into the Vatican?\n2-how late can you get to the Vatican?\n3-can you get tickets to go into the Vatican on your own without a tour?\n\nThank you! We are flying into Rome before taking the train to Florence. We’d like to see what we can get done either the first night that we get in from theआणखी airport or early the next morning… Feeling like the Vatican may be the most extreme, regarding crowds and heat I want to try and get them in as late as early as possible… I’m thinking everyone else is thinking the same thing lol, thanks in advance for your help ￼", "link": "facebook.com/groups/1373361046396315/permalink/2194603447605400/", "likes": 5, "comments": [{"username": "Beth Padva Monahan", "comment_text": "Louellen we had tickets this morning before it opened to the public. It was a private tour though and we were able to go in at 8:00. I think it opens to the public at 9:30. The line to get in was so long you should definitely look into getting skip the line tickets. Our tour guide told us this is the hottest week it has ever been in Rome. Lucky us! Hopefully it will be much cooler when you’re here."}, {"username": "Lauren-Jade Roberts", "comment_text": "We had skip the line tickets for the Vatican, which were at 11am, the queue was massive around 10.30, we got out around 2.30 and there was almost no queue."}, {"username": "Sandi Van", "comment_text": "-They open at 9\n-Tickets with breakfast starts 7:30\n-Tours get you in 8am (1 hour before they open for the public) it helps because it’s not as crowded especially in this heat, we were there last Thursday."}, {"username": "Anel Van Zyl", "comment_text": "The latest tickets we could get recently was 15h30. There was no waiting time for us to enter (bought via Get your Guide). There were people lining up to still buy tickets then; the line was about 20m long I think. The museum was still very full."}, {"username": "Amy Stolp", "comment_text": "Are the early breakfast tickets sold only through the Vatican or other tours?"}, {"username": "Debbie Milne", "comment_text": "Louellen Klints Karthaus we did an after hours tour of the Vatican at night . We were in a group of a dozen people it was awesome ! The whole place was virtually empty. We even sat on chairs staring at the ceiling of the Sistine Chapel it was amazing. The company we used was The Roman Guy and i think Walks of Italy offer it too."}, {"username": "Laurie Gresens Lewis", "comment_text": "Be sure you are dressed appropriately or you won’t get in."}]}, {"id": "2194601640938914", "text": "Any recommendations for a private transfer service within Tuscany (Sarteano to Grossetto) in September? Most companies I’ve come across only travel between major cities/towns. Thanks in advance for any advice.", "link": "facebook.com/groups/1373361046396315/permalink/2194601640938914/", "likes": 0, "comments": []}, {"id": "2194600974272314", "text": "As someone who grew up in Italy, and goes home to Italy yearly I wanted to share some thoughts on weather.\n\nIt is getting harder and harder to compare year to year the weather.\n\n2-3 night ago at 1-2 in morning areas of the Veneto were hit with large and violent hail. Many had windows and vehicles damaged. Is this normal? No.\n\nWe were there in October 2022, and it was the hottest October recorded in quite a while.\n\nCame back in May 2023. It hadn't rained since before we were there in October. We brought the monsoon from Florida. It flooded Emilia-Romagna and it was devastating.\n\nI've lived in Florida for 18 years and it keeps getting progressively hotter and hotter year over year.\n\nAll this to say that, while we can compare and say what it normally is or should be during a time frame, is not a guarantee. The world is changing and so is the climate.\n\nI don't recommend people go to Italy nor Florida in the middle of summer because it's not enjoyable but if that's the only time your kids are out and you can take vacation just remember to stay hydrated, wear sun block, have a hat, sunglasses...and make the best of it. 😀", "link": "facebook.com/groups/1373361046396315/permalink/2194600974272314/", "likes": 2, "comments": []}, {"id": "2194589620940116", "text": "If you have timed tickets for the Colosseum do you have to go there first or can you visit the forum or Palentine hill first the day before and then go to the colosseum at your timed entrance the next day. I think I read the tickets are good for 24 hours?", "link": "facebook.com/groups/1373361046396315/permalink/2194589620940116/", "likes": 0, "comments": [{"username": "Shen Min Chue", "comment_text": "The indicated time is for the Colosseum. You can visit the Forum and Palatine Hill first as long as the specified entry time for the Colosseum thereafter is wthin the 24 hours time frame. Forum and Palatine Hill must be done together in the same entry visit."}]}, {"id": "2194541787611566", "text": "What's the best/easiest app to buy train tix for first timers? Tia", "link": "facebook.com/groups/1373361046396315/permalink/2194541787611566/", "likes": 7, "comments": [{"username": "Michael Galan", "comment_text": "Airalo"}, {"username": "Connie Wilson", "comment_text": "TrenItalia. I use it every year - you can look up routes and stops, purchase tickets and reserve seats, and print or save tickets to your wallet and phone.\n\nhttps://\nwww.trenitalia.c\nom/en.html"}, {"username": "Jordan Schmale", "comment_text": "Omio"}, {"username": "Janette YesPlease", "comment_text": "I used the Rome2Rio app to figure out when and where I wanted to go and then went to the official website to purchase tickets. If anything happens, delays, strikes, or needing to change my itinerary, it is easier to make adjustments."}, {"username": "Tammy Wunsch", "comment_text": "I use Trainline. Using it also in France this year."}, {"username": "Gillian O'Callaghan", "comment_text": "I love Trainline....wo\nrked before arrived, gives all trip options from both companies, details of journey stops, stores tickets in chronological order, QR codes work well."}, {"username": "Miyuki Kanno Paul", "comment_text": "Trenitalia app"}, {"username": "Sam Mah", "comment_text": "Trenitalia for Italy."}, {"username": "Alexandra A Welker", "comment_text": "Trenitalia"}, {"username": "Trish Dooley Thorp", "comment_text": "Trainline"}, {"username": "Linda Miller", "comment_text": "Trenitalia"}, {"username": "Bob Lampo", "comment_text": "I used Trainline which covers all train lines. E tickets worked great. I used it even to avoid last minute train station lines and the pesky ticket vending machines"}, {"username": "Vera Feeny", "comment_text": "I used Eurorail since we were traveling in France too. It lets you buy from multiple rail companies."}, {"username": "Jessica Petyo", "comment_text": "Trenitalia"}, {"username": "Nick Trostel", "comment_text": "We used both Trenitalia and Italo apps for different journeys and fast trains etc. I would probably use an app that searches both at once next time I’m there."}, {"username": "Loredana Polichetti", "comment_text": "Trenitalia or Italo"}, {"username": "Frank Hunt", "comment_text": "Trainline first option and Trenitalia, you need both occasionally."}, {"username": "Grace Monaghan", "comment_text": "Rome2rio .. then they direct you to the best option"}, {"username": "Nancy Rogers Caradonna", "comment_text": "I prefer Trainline. Never had a problem and had to cancel and rebook with no refund problems."}, {"username": "Susie CB", "comment_text": "Rome2Rio…. It also helps me understand off there are transfers and which stop when there are multiple stops with similar names… I’ve really only seen this in Germany and Belgium"}, {"username": "Katie Starnes Berry", "comment_text": "I feel like Trainline is the best. Every time I’ve tried to use Trenitalia I’ve gotten confused"}]}, {"id": "2194600037605741", "text": "My husband and I are planning a trip for next June. We are hoping to spend 1 or 2 nights in Naples and would love some hotel recommendations.", "link": "facebook.com/groups/1373361046396315/permalink/2194600037605741/", "likes": 1, "comments": [{"username": "Sabrina Tjoelker", "comment_text": "Following"}]}, {"id": "2194598160939262", "text": "Hi All, I have been obsessed with this group for months, and have a way better idea of things now, so thank you for the help. That said, I am starting to consider Mediterranean cruise, instead, for various reasons. As I take more time to make decisions, I wonder if anyone on this page has feedback on how seeing Italy via a cruise, compares. Iआणखी realize it is way different. My goal is to get to Italy no matter what, one day. Just considering this as an option for next summer.\n\nAnyone on this page do it as a cruise guest???? Wondering if, while in each port for the day, gives a decent enough time to do a couple things. Again, I know it’s nowhere close to the same… just wondering if it’s still great?? 😊\n\nThanks, in advance. 😊", "link": "facebook.com/groups/1373361046396315/permalink/2194598160939262/", "likes": 1, "comments": []}, {"id": "2194597500939328", "text": "Hello everyone. We are visiting Italy in mid October. If I should choose between visiting /staying in Amalfi coast and Cinque terre , in Mid October, what is your recommendation?", "link": "facebook.com/groups/1373361046396315/permalink/2194597500939328/", "likes": 0, "comments": []}, {"id": "2194594614272950", "text": "Help quick! Family members bought Skip the line tickets for 13:00 (1pm) tomorrow for Vatican and Sistine. I remember how hot and crowded it was in June with no AC and saw someone needing medical attention. I am now scared and persuading them to return the tickets, even if they lose money.\n(Admins, please anon because of the distant family who don't know)", "link": "facebook.com/groups/1373361046396315/permalink/2194594614272950/", "likes": 0, "comments": []}, {"id": "2194593894273022", "text": "My tour ends in the morning and the plane to my next stop (Rhodes) doesn’t take off til 10 pm. Think I’ll be able to leave my baggage in hotel? Thoughts on what I can do in that time? Staying at crowne plaza. Thanks!!", "link": "facebook.com/groups/1373361046396315/permalink/2194593894273022/", "likes": 0, "comments": []}, {"id": "2194592524273159", "text": "We are flying into Rome and catching a flight to Palermo from there - how much time should you give yourself to get through customs etc??", "link": "facebook.com/groups/1373361046396315/permalink/2194592524273159/", "likes": 0, "comments": []}, {"id": "2194591850939893", "text": "Coming to Italy in September for a cruise out of Ravenna\n\nFlying into Marco Polo 2 days prior to cruise departure then staying In Venice 2 days after the cruise before flying home.\n\nBest way to get two and from Marco Polo/Venice fo Ravenna.", "link": "facebook.com/groups/1373361046396315/permalink/2194591850939893/", "likes": 1, "comments": []}, {"id": "2194591350939943", "text": "Looking for non-tourist restaurant in Rome. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2194591350939943/", "likes": 0, "comments": [{"username": "Shawn Hibbard", "comment_text": "Ask locals where they eat or look for menus posted that are not in English."}]}, {"id": "2194576327608112", "text": "August 16 would be 30 days from now but Coop Culture shows they have not released the night Colosseum tour in English yet for that date. The Italian tour does have tickets on August 16 open right now. Any ideas? I changed my settings so my clock is on Roman time.", "link": "facebook.com/groups/1373361046396315/permalink/2194576327608112/", "likes": 0, "comments": [{"username": "Adam Rojas", "comment_text": "It’s 30 days from the hour of the tour. Hope you get a tour."}]}, {"id": "2194573494275062", "text": "Hi everyone.,\nWe purchased air tags as we are concerned about the connecting flight and bags not getting transferred. No need to comment on bringing CO only. I totally understand the benefits of that, but not going to work for this trip. Have any of you noticed that your bags were not on your plane before takeoff? Could you do anything about it, like notify airline staff?\nThanks for you input", "link": "facebook.com/groups/1373361046396315/permalink/2194573494275062/", "likes": 10, "comments": [{"username": "Victoria Laverty", "comment_text": "All transfers in italy bags arrived 8 of us travelling"}, {"username": "Julie Adams", "comment_text": "Air tags only work if someone in a close proximity has in iphone. I've traveled and saw my bag wasn't close, but it ended up on the plane after all. They aren't going to hold the plane for your bag, so your best course of action is ignoring it until you land and check on it then. No sense in stressing unnecessarily; the vast majority of the time it's fine."}, {"username": "Elizabeth Tenaglia", "comment_text": "I have noticed that with AirTags, there is a lag in location. In other words, you may not be getting the most up-to-date information. Our said that one of our bags was not on the plane and separate from all of the others, but we managed to get all of our bags just fine. also for what it’s worth, I have an apple AirTag on my son’s retainer case, which helps me track him throughout town. It’s never completely quite accurate and sometimes is behind and it’s transmission.￼ also, I totally understand about having to check bags. Not everybody can bring a carry-on in every situation and let’s face it with everybody bringing carry-on bag, eventually the plane isn’t going to be able to accommodate all of those either."}, {"username": "Miyuki Kanno Paul", "comment_text": "If your flight is from USA to a foreign country, positive bag match will be in effect. Your physical presence onboard and bags must match prior to the departure for an International destination"}, {"username": "Colleen Dawson", "comment_text": "Traveling all over the world, one of my safety check is know the city airport code and check to make sure the luggage tags match the code.Some are very similar. I have had my luggage tag to go to San Jose, Costa Rica instead of California, be vigilant. Mistakes do happen."}, {"username": "Joanne-Peter Hart", "comment_text": "We had flown from Sydney, Australia, via Dubai, UAE, Zagreb, Croatia and then Ljubljana, Slovenia. We had all our bags with us. On my husband’s phone the air tags showed them, with a time lag, where they should be, but on my iPhone my son’s bag was showing it still in Sydney for over a day. We both have the same Apple ID. Wired."}, {"username": "Cameron Smith Bradley", "comment_text": "There can be a lag. But my sister noticed it with her flight and alerted the flight attendant. They said that it was likely on board. It was not and arrived two days later. Her air tags helped her to know where it was and to track."}, {"username": "Ryan Shearer", "comment_text": "2 out of 3…then the 3rd caught up. Just a lag in the tag not the bag."}, {"username": "Steph Haggarty", "comment_text": "I’ve had a lag.\n\nA friend noticed her bag showed it was another part of the terminal and let the flight crew know. They made a call and the bag made it."}, {"username": "Patty Oaks", "comment_text": "If your bag doesnt show on board the aircraft they arent going to hold the departure to look for it. They should forward it on the next available flight after verifying you actually traveled to that destination."}, {"username": "Ted Larson", "comment_text": "Look at it this way….. 97% of luggage gets through normally….Yes the tags are great to locate where lost luggage is……..relax."}, {"username": "Cherie Saliby-Puszynski", "comment_text": "True story. We went to Italy 3 weeks ago. Put an AirTag in each of our checked bags before leaving. Missed our Montreal to Venice connection due to late flight; spent over 2 hours trying to find our luggage. It showed on the Montreal airport tarmac at 7:30 pm. Even at 11 pm. No one at airport could get to area on tarmac because “gate is closed and locked”. Got a call the next morning that our luggage was in Venice. It was helpful tho in locating where one piece of luggage was when Air Canada lost it on our return and we didn’t receive it for four days."}, {"username": "Annalisa Francesca Gianna", "comment_text": "This happened with Star Alliance group. ORLANDO to DC arrived on time no delays or issues. Get to gate and check airtags. Bag is are no where near the plane. Bring it up a few times to the gate agent and was told it wasn't an issue. Almost to Germany and realize that they are still in DC. Lufthansa steward was at least proactive in telling me where the lost baggage office was to get claim started since we had a layover before getting to Verona. (Verona is a small airport and it would have been after 5 pm when we landed on a Friday.) It still took almost 6 days out of a 13 days trip to get them. We did have travel insurance and since it took so long we were each allowed 500 to replace anything we needed. Fortunately, i have family there so it wasn't too much of an inconvenience but I would say get the insurance. It's worth it."}, {"username": "Robin Tower", "comment_text": "When I first arrived at Ft Lauderdale, one of my bags said the location was the Atlantic Ocean. Just a lag, everything was fine. Air tag helped us find our golf bags located differently than luggage."}, {"username": "Jacqui Hakes", "comment_text": "Honestly o think if travelling atm, best to expert the worst- missed connections, lost bags etc, be prepared to get by with whatever’s in hand luggage/ buy essentials wherever you are… and then anything that happens “ better then that” is like a gift"}, {"username": "Brian Shaw", "comment_text": "You’ll possibly know where they are, or aren’t but as far as doing anything about it, no."}, {"username": "Kim Hunter Groop", "comment_text": "On a recent flight, before we left the gate, I got a text message from Delta saying my bag was on the plane."}, {"username": "Diana Himes", "comment_text": "When the bags are in bins on the larger planes, the air tag signal can be blocked. You will see the last location the bags transmitted from. This can lead you to think the luggage didn’t make it on the plane or accidentally got loaded on the wrong plane. Some airlines are allowing you to track the bag tags which helps."}, {"username": "Yvette Pavone", "comment_text": "I always ask they to tag it priority when traveling international"}, {"username": "Albert Zarb", "comment_text": "Just a note I love my AirTags as they are in your suitcase in hotel / car you just track them when you are out and about and you alway find you way back to the hotel, I actually put one in the hire car so we could find it as well"}, {"username": "Ellen Edmonds-Wilson", "comment_text": "Never had an issue with our air tags on numerous international and domestic flights. You’ll not need to worry really until you land and see where it is."}, {"username": "Jaime Webber", "comment_text": "If your bags go missing DO NOT LET THE AIRPORT SEND TO YOU WITH A COURIER!! Just go back and get it yourself. They lost my sons bag June 26 & we now have to go back to BLQ from Rome to get it before we leave next week. The courier held it with no communication this whole time & never delivered while we were in Florence for the first week. They all use ONC CORP just google them. You do not want to be at the mercy of them!!"}, {"username": "Tiffany Chehova", "comment_text": "Me too! Had a connection in Paris and tags showed my 2 luggage’s left there. We were anxious the whole flight… but relieved when my luggage’s were at the carousel. Stressed for nothing!"}]}, {"id": "2194573227608422", "text": "Any recommendations for an Airbnb in Agropoli or Paestum. 4 adults. 2 rooms beachfront. Would appreciate personal recommendations. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2194573227608422/", "likes": 0, "comments": [{"username": "Jim Botti", "comment_text": "Vecchio Saracino - Carola1801. Wonderful hosts, great accommodations,\nand a 5 Star restaurant. My family gas been staying there for more than 25 years. Mention my name when cooking."}]}, {"id": "2194569157608829", "text": "🇮🇹We will be visiting Italy in late December/early January with our 11&13yo girls. We have 1 night in Bologna. Looking for recommendations/tips for the following:\n1- Best Food tour in Bologna\n2- Ferrari test drive/ Museum in Modena\n\nThanks!", "link": "facebook.com/groups/1373361046396315/permalink/2194569157608829/", "likes": 1, "comments": []}, {"id": "2194569080942170", "text": "Hello!\nPlanning our first trip ( hubby and kids 11,9) to Italy June 2024!\nAny hotel recommendations that can accommodate 4 and budget friendly would be appreciated! Planning for Florence, Rome, Sorrento or Positano. Thank you so much!! Also how in advance should we be booking accommodations?", "link": "facebook.com/groups/1373361046396315/permalink/2194569080942170/", "likes": 1, "comments": [{"username": "Mary Agozzino Derrick", "comment_text": "It's never to early ...we use to always book 10-12 months in advance and always got what we wanted that way"}, {"username": "Sabrina Tjoelker", "comment_text": "Following"}, {"username": "Hope Nazzaro", "comment_text": "Following"}, {"username": "Lisa Valdovinos", "comment_text": "We booked 9 months in advance. In Sorrento we stayed at Hotel Villa Garden. It was wonderful. It’s actually in Sant’Agnello which is a 20 minute walk to Sorrento. We love it there. It was Boutique hotel overlooking the sea and it has a pool."}, {"username": "Martinez Martin", "comment_text": "We used all Airbnb's when we went at Christmas time and they were significantly cheaper. Only issue is they cannot be self check-in. It's law that they have to get a picture of your passport so you have to coordinate a time to meet the home owner/ manager."}, {"username": "Dayna Steinberg Cioffi", "comment_text": "Florence - grand hotel Minerva or Plaza Lucchessi. Rome Hotel D’Inghliterra. Parco do Proncipe was the only hotel in Sorrento that we could find with connecting rooms."}, {"username": "Alison Ahlberg", "comment_text": "These air bnbs were great for our family of 4"}, {"username": "Francesca Lo Cascio Anemone", "comment_text": "Following"}]}, {"id": "2194566070942471", "text": "Recommendations\nfor Sorrento hotels ?\n\nThank you.", "link": "facebook.com/groups/1373361046396315/permalink/2194566070942471/", "likes": 9, "comments": [{"username": "Marika Radich", "comment_text": "Maison Tofani"}, {"username": "Victoria O'Toole", "comment_text": "Hotel minerva. Beautiful hotel. Amazing views and wonderful staff"}, {"username": "Melonie Rycroft", "comment_text": "Hotel Eden 5 minutes walk to Piazza Tasso 10 minutes walk to sorrento port perfect location ❤️"}, {"username": "David Murszewski", "comment_text": "We stayed at a Monastery fabulous close to everything with breakfast included , couldn’t do enough for us , very nice accommodation also"}, {"username": "Carol Coleman", "comment_text": "Marina Grande great location, lovely views, comfortable and wonderful breakfasts included!"}, {"username": "Tara Roed", "comment_text": "We stayed here and it was amazing. Great location too. We needed a triple and it was very comfortable\n\nhttps://\nwww.hotellafavor\nita.com/mobile/"}, {"username": "Sandy Radican Shikaly", "comment_text": "Grand Hotel La Favorita.. 5 star!!"}, {"username": "Reham Botros Ghali", "comment_text": "Gardenia"}, {"username": "Darryl Vanstone", "comment_text": "We are just outside sorrento in Sant’Agnello, staying at Hotel Corallo Sorrento. Beautiful views and has a free shuttle hourly to and from sorrento. A short 5 minute drive. I would highly recommend this place"}, {"username": "Marilee Racobaldo Petruno", "comment_text": "Hotel Corallo"}, {"username": "Lisa Baglio Garrison", "comment_text": "We just stayed at the Grand Hotel Capodimonte! Beautiful hotel with breathtaking views. Easy 10 minute walk into town."}, {"username": "Cettina Milioto", "comment_text": "We stayed at Hilton sorrento beautiful. Ask for the renovated rooms"}, {"username": "Lauren Pennachia-h", "comment_text": "Anyone stayed at the hotel continental? 🙂"}, {"username": "Gina Bernaitis", "comment_text": "We enjoyed hotel del corso! Has everything you need to rooftop is so beautiful in the middle of all the cute shops and a 5 min walk to the marina for food!"}, {"username": "Pam Gross Kovitz", "comment_text": "Hotel La Favorita. So charming and on the water. Great location as well.\n\nhttps://\nwww.hotellafavor\nita.com/mobile/"}, {"username": "Anthony Colachicco", "comment_text": "Hotel Bellevue Syrene, Sorrento"}, {"username": "Daren Smith", "comment_text": "Please ￼"}, {"username": "Lisa McMurchie", "comment_text": "Vickie McMurchie"}, {"username": "Renee Rundle Stoneham", "comment_text": "Hotel Grand Royal"}, {"username": "Pearl Lucero", "comment_text": "Hotel grand DeVille! Rooftop pool, big balcony looking out to mt Vesuvius and the marina down below. 10 min walk to piazza Tasso"}, {"username": "Mary Grube-Juengel", "comment_text": "Hotel Corallo"}, {"username": "Sarah Higgins", "comment_text": "Grand Hotel Continental****\n-Sorrento"}, {"username": "Julie Chadwick", "comment_text": "Hotel Grand Capodimonte. 5 cascading pools, several restaurants and bars , food amazing and 10 minutes into town centre."}, {"username": "Jacqui Warsama", "comment_text": "Hotel Bristol is lovely or Conca Park"}, {"username": "Meredith Noll", "comment_text": "Hotel Conca Park was Great"}, {"username": "Carol Cole", "comment_text": "Wendy Bartram"}, {"username": "Anne Mc Namara", "comment_text": "Hotel Tourist. Has a pool, Breakfast included.5 minutes walk from the train Station and a couple of minutes walk to a lovely square with lots of restaurants and main shopping areas"}, {"username": "Phyllis Snyder", "comment_text": "When?"}, {"username": "Manuela Bussler Sweeney", "comment_text": "Has anyone stayed at Hotel dei Congressi in Castellammare. We're staying there in October,but have no clue where abouts it is in Sorrento. How close we would be to the water or city."}, {"username": "निनावी सहभागी", "comment_text": "Any one stay here ??"}, {"username": "निनावी सहभागी", "comment_text": "All\nThe good hotels\nAre booked ☹️"}, {"username": "Joanna Priestley", "comment_text": "Palazzo Marziale!! Perfect location and absolutely beautiful, staff is amazing!"}, {"username": "Tom Manno", "comment_text": "Continental."}, {"username": "Wahab Sidharta", "comment_text": "Airbnb"}, {"username": "Maria Iantomasi Scott", "comment_text": "Hotel grand’ flora - has a pool\nNot sure if sold out\nI would call\nGreat location\nU can walk everywhere"}, {"username": "Clare Boxer", "comment_text": "Hotel Conca Park Sorrento"}, {"username": "Tiffany Hadfield Merrill", "comment_text": "So cute here!"}, {"username": "Denise Tenn", "comment_text": "Try Airbnb’s- brilliant!"}, {"username": "Carla Chammas Eid", "comment_text": "Luiselle Charming Accommodation\nnear the train station, walking distance to downtown and the Marinas. very nice and cosy for a couple."}, {"username": "Tamriko Chanishvili", "comment_text": "Hotel Plaza Sorrento"}, {"username": "Tanya Cini-Kirk", "comment_text": "Hotel Rivage"}, {"username": "Donna Mangone", "comment_text": "Hotel Michelangelo"}, {"username": "Dottor Peppe Insigne", "comment_text": "try to find something in Sant'Agnello if you don't want to spend a lot, it is the town before Sorrento and you can also reach it by walking"}, {"username": "Lisa Martinez", "comment_text": "Hotel Conca Park is beautiful loved it!!"}, {"username": "Lisa Boyes Cooper", "comment_text": "Sorrento city hotel was very good to us and right near centre"}, {"username": "Ann Marie Laface", "comment_text": "La Favorita"}, {"username": "Julie Tran", "comment_text": "Hotel rivage"}, {"username": "Debbie Tungate", "comment_text": "Hotel Conca Park Sorrento came back from here last week. Beautiful hotel 👍"}, {"username": "Robin Barbera", "comment_text": "Grand hotel de la villa"}, {"username": "Julianne Waatti Kulman", "comment_text": "Hotel continental views, staff, location, pool, breakfast. They have parking also. The best"}, {"username": "Grace Monaghan", "comment_text": "Casa Lucia is beautiful… we just spent 4 days there. Walking distance to everywhere and the staff are wonderful."}, {"username": "Elie Loummer", "comment_text": "Agreed that Hotel Sorrento city was gorgeous! Great location near the centre but so quiet, amazing rooms and breakfast! Also affordable!"}, {"username": "Donna Miranda Tamburrino", "comment_text": "We just stayed at Grand Hotel President … lovely views nice pool and a shuttle into town. Wonderful staff also ."}, {"username": "Carmela Siniscalchi Frattellone", "comment_text": "La Badia. Quiet clean hotel with a pool"}, {"username": "Paul Witham", "comment_text": "Minerva is lovely , Bristol is more lovely"}, {"username": "Chanel Demanuele", "comment_text": "Hotel Sorrento City\nCentral location & absolutely beautiful !"}, {"username": "Janine Marie", "comment_text": "Sorrento Palace…we stayed last September…Gorge\nous and great location! 💚🤍❤️"}, {"username": "Chris Kane", "comment_text": "Hotel Vesuvius! Amazing"}, {"username": "Sarah Wood Armstrong", "comment_text": "Villa Oriana Rellais"}, {"username": "Kelly Roland Thompson", "comment_text": "Grand hotel Royal"}, {"username": "Suzanne Sanderson", "comment_text": "Hotel Plaza Sorrento"}, {"username": "Debi Sicurella Krulisky", "comment_text": "Belair"}, {"username": "Emmy Delangre", "comment_text": "Grand hotel aminta"}]}]