[{"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 8, "comments": []}, {"id": "2213839579015120", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213839579015120/", "likes": 11, "comments": []}, {"id": "2184458878619857", "text": "Don't miss a stay here...a heaven on earth!\nEvery where you look could be a postcard or picture...you are at La Lupaia, between Montepulciano and Pienza, Lupaia is an ancient farm estate dating back to 1622!🥰आणखी\nDiscover more here: https://www.jdoqocy.com/click-100692842-11552042?url=https%3A%2F%2Fwww.tripadvisor.com%2FHotel_Review-g608934-d1015571-Reviews-Lupaia-Torrita_di_Siena_Tuscany.html", "link": "facebook.com/groups/1373361046396315/permalink/2184458878619857/", "likes": 65, "comments": [{"username": "Sophia Jensen", "comment_text": "Where was this taken?"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Lupaia https://\nwww.dpbolvw.net/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g608934-d1015\n571-Reviews-Lup\naia-Torrita_di_\nSiena_Tuscany.h\ntml"}, {"username": "Julie Hinton", "comment_text": "Love that area! I stayed in Montefollonico.\nKind of in between the two towns. Beautiful!!! Stayed at La Chiusa. Went to a week long cooking\nSchool."}, {"username": "Kristy Bretagne", "comment_text": "$1100 per night is unfortunately not in the cards for most people."}, {"username": "Cathy Ann", "comment_text": "Terry Toffolo 👌"}, {"username": "Leo Sy", "comment_text": "There is also a swimming pool wow very comfortable"}]}, {"id": "2185834465148965", "text": "Paddle boarding tour from Sorrento to Bagni Regina Giovanna\nThere’s one surefire way to escape the Amalfi Coast’s crowds: get on the water. With this small-group tour, you’ll meet your guide, get acquainted with… आणखी your paddleboard, and head out on the crystal waters toward Punta del Capo. Once arrived, you’ll beach your boards and either head to explore the Roman villa of Pollio Felice—which dates back 2,000 years—go for a swim, or simply enjoy the exquisite, uncrowded views. Read more about Paddle boarding tour from Sorrento to Bagni Regina Giovanna - https://www.viator.com/tours/Sorrento/Paddle-boarding-tour-from-Sorrento-to-Bagni-Regina-Giovanna/d947-284551P1?pid=P00070587&mcid=42383&medium=link&medium_version=selector", "link": "facebook.com/groups/1373361046396315/permalink/2185834465148965/", "likes": 6, "comments": [{"username": "Sophia Jensen", "comment_text": "It's really great to be here. What's the weather like there lately?"}]}, {"id": "2213627669036311", "text": "Any reviews for Tenuta Sovestro, just outside of San Gimignano?", "link": "facebook.com/groups/1373361046396315/permalink/2213627669036311/", "likes": 1, "comments": [{"username": "Jessica Olivero", "comment_text": "We stayed there + loved it! The rooms are clean + the pool is gorgeous! Also, they give you the most amazing olive oil shampoo — we couldn’t get enough. The breakfast spread is wonderful as well."}]}, {"id": "2213281335737611", "text": "This post is for whomever is in Italy right now.\nCould you post pics of your train’s seats with the train line name and whether you used economy, business or first class?\nI’m piggy backing from Mbell Arteaga’sआणखी post with her amazing pics of train station gates and monitors with instructions.\nLooks like there are several train companies with different seating arrangements and if we had visuals of each one it would be of great help!\n\nTIA if anyone cares and remembers to do this 😃\n\nPic of my search of all train lines in Italy. Which ones are the faves??", "link": "facebook.com/groups/1373361046396315/permalink/2213281335737611/", "likes": 0, "comments": [{"username": "Chiara Normanno", "comment_text": "Uhm those aren't train lines specifically, those are stations, train routes and train types mixed. Do you need seating pics of Frecciarossa? Frecciaargento?\nRegional trains? Frecciabianca?"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "In Italy there are two national train companies: Trenitalia, the public one, that runs several types of trains (Frecciarossa -the fastest- Frecciargento, Frecciabianca -slightly slower- generally referred as Le Frecce, Intercity, Regionale -slower but with more stops, so if you need to go to a smaller city you’ll probably want one of them) or Italo, the private company (only fast trains named Italo, very few lines).\nThen there are some small local trains like Malpensa express, Circumvesuviana\nor small local companies like Trenord (only in Lombardia)."}, {"username": "Jeanne Eliason", "comment_text": "Jeanne Eliason"}, {"username": "Rhona OConnor", "comment_text": "I don't know what train lines I traveled on, that was not an issue for me - just booked using Trainline app..... Booked day, time, destination, class and seat. All worked out well."}, {"username": "Charlie Charnigo", "comment_text": "This will answer all your questions and even ones you haven’t thought of…\n\nhttps://\nwww.seat61.com/"}, {"username": "Rebecca Yeoh", "comment_text": "Trenitalia EuroCity Milan > Como, 1st business"}, {"username": "Rebecca Yeoh", "comment_text": "Trenitalia Frecciarossa Milan > Rome, business (I was taking a photo of the barista machine)"}]}, {"id": "2213634665702278", "text": "We leave on the 26th for 2 weeks. I understand the weather is still very hot.", "link": "facebook.com/groups/1373361046396315/permalink/2213634665702278/", "likes": 14, "comments": [{"username": "Claire Fellowes", "comment_text": "Here in Milan now and it’s 34 degrees"}, {"username": "Kejdi Okej", "comment_text": "Here in milan now and it s 34 degrees"}, {"username": "Jay Parekh", "comment_text": "It’s tolerable"}, {"username": "Toni Tucci Corsanico", "comment_text": "We leave on the 27th! 🇮🇹"}, {"username": "Cindy Frenette Pawley", "comment_text": "Yes, we are in Rome today. It’s bearable but if you schedule any tours try to get the early morning."}, {"username": "Gommy Shirley Pribisco Brady", "comment_text": "And bring some of those cool rags. They were life savers for us when we were there in July. All the fountains that are everywhere have ice cold water in them and you can wet the cool rags and get relief. I bought ours on Amazon!"}, {"username": "Michelle Broome", "comment_text": "Everywhere is hot all over the world. Summer is the worst to travel! Yikes! And from all I have read, air conditioning is lackluster compared to American standards."}, {"username": "Paul Anderson", "comment_text": "Stay in the hills outside of the cities. Visit the mountains."}, {"username": "Cristina Luna", "comment_text": "Do people typically walk around with umbrellas for sunshade? I don’t want to be the annoying tourist with one in the way of others."}, {"username": "Sandy Connell", "comment_text": "Sandy Connell"}, {"username": "Jill Kalman", "comment_text": "Is Amalfi coast a bit cooler?"}, {"username": "Wendy Spano Bracco", "comment_text": "We leave one Sept 1. I’m following the weather apps. I’m not worrying about what the weather is today or next week. The temps are showing a drop by then."}, {"username": "Chrissa Matthews", "comment_text": "Very tolerable"}, {"username": "Urszula Augustyn", "comment_text": "Ohh yeah"}, {"username": "Andrea Robinson", "comment_text": "Liguria is 29 ish each day going up to about 32 degrees c !"}, {"username": "Kimberly ZDuffy", "comment_text": "Highly recommend bring a cooling towel. Just left Barcelona which was in the 90’s. Hubby purchased cooling towels on Amazon. I wasn’t convinced we needed them. But, oh they are amazing!!!"}, {"username": "Michelle Anderson- Rowland", "comment_text": "Just buy one of the fans that go around the neck. It helped for me. Yes it's hot but we are from Florida and it is hotter there 🤷"}, {"username": "Rocco Cusano", "comment_text": "We’re leaving on the 27 th !!"}, {"username": "Phyllis Flowers", "comment_text": "August is always the hottest time nothing new also a lot of crowds."}, {"username": "Mark Spielman", "comment_text": "You can always head up to South Tyrol, or Ticino where the Alps can cool you down."}, {"username": "Jen Belsito", "comment_text": "We leave in 2 sleeps! Aug 16 whoohoo"}, {"username": "Tissie McClure", "comment_text": "Reschedule! I just got back and we about died in Greece, Italy, and France! Now Paris was cooler and so was London. I would never go back in July again! With all the walking and the museums without air-conditionin\ng with that heat it is just atrocious! The less clothes the better!"}, {"username": "Dawnielle Castledine", "comment_text": "We are also coming on the 26th!"}, {"username": "Marichu Alojado Rivera", "comment_text": "Flying to Rome September 1st, will stay for 5 days and travelling to Tuscany on the 6th for destination wedding of my niece 😍"}, {"username": "Valentina Bachi", "comment_text": "Weather depends much on where you go; currently north and central Italy is rather hot while South is better due to nice winds. End of the month should be cooler more or less everywhere."}, {"username": "Tina Arluna", "comment_text": "It’s funny you mention the weather because after reading so many posts regarding the heat -I was prepared. Then I realized everyone can tolerate hear differently. I don’t think it’s as bad as most are saying."}, {"username": "Kena Cook", "comment_text": "In Rome now. We did the Coliseum on Saturday and the Vatican on Monday. The walk was hot but doable. You're sticky afterwards but it's worth it. Milan was beautiful last week, not hot at all."}, {"username": "Kevin P. Wrenn", "comment_text": "We have been in Rome, Sorrento, Matera and Arbarobello and the weather has been great. Fabulous in Sorrento and a little warmer inland but still quite nice!!"}, {"username": "Helen Knowles", "comment_text": "We leave on the 26 th August too 🇮🇹"}, {"username": "Julie Calabrese", "comment_text": "Accuweather.com does a monthly forecast. I have looked up every place we are going so I can plan clothing better."}, {"username": "Marlene Sanz-Rodriguez", "comment_text": "Yes 94-95 dry!"}]}, {"id": "2213636405702104", "text": "I have planned strike questions. I hope someone who lives in Italy or has lived through strikes in Italy will have the answers!\n\nI don't understand quite how they work. There are two planned strikes for when we will be in Italy. One is a rail strike that affects Italo, nation-wide. Naturally, we are scheduled to travel that day. The other is air traffic controllers, nation-wide.\n\nThe rail strike is scheduled for September 17-18, beginning at 3:00 AM on the 17th until 2:00 AM on the 18th, so 23 hours. We will be traveling at 8:30 AM on the 18th. Does this mean the trains will be backed up? How do we find out if our train will go that day at all if they are backed up?\n\nThe second strike is for what I think is air traffic controllers on September 16 from 10:00 AM to 6:00 PM, although I don't think this one will affect us (but not positive) as we land at 11:30 AM on September 17. In this case, do planes just not take off from or for Italy that would be landing during the time period of the strike since there is no traffic control? I'll assume it will back up traffic for a day or two?\n\nWe don't typically experience this level of strikes in the US with such regularity, so I'm not sure of how stikes like these work or affect travel, locally and nationally. BTW, there are a LOT of planned strikes for local transportation all over Italy for September. You may want to check the strike calendar, just be sure you have Google translate on so you can read it properly--put in dates that would affect you. I'll add the link: https://www.commissionegaranziasciopero.it/calendario-scioperi?page=0", "link": "facebook.com/groups/1373361046396315/permalink/2213636405702104/", "likes": 1, "comments": [{"username": "Vickie Love Hooper", "comment_text": "When we were there in July, there was a rail strike. We were trying to get from Venice to Trieste- we were told the strike would end at 3pm. It did, exactly at 3. I bought tickets to leave at 3:15 I believe and we left right on time. I’m guessing all the people with tickets exchanged them for a later time a lot."}, {"username": "Joëlle Simard", "comment_text": "I follow this publication to get the answers, because I will also be traveling on these dates"}, {"username": "JoJo Sisto", "comment_text": "Following as we are planning to leave Rome on the 17th am to Naples and already have tickets booked ugh"}, {"username": "Kathi Rose", "comment_text": "Does anyone know about a train strike Sept 15 - Rome to Bari?"}]}, {"id": "2213643275701417", "text": "First time traveling to Italy next month. What are things you have to declare at customs? I use nicotine pouches. Is that something I'd have to declare", "link": "facebook.com/groups/1373361046396315/permalink/2213643275701417/", "likes": 3, "comments": [{"username": "Jaime Cleek", "comment_text": "I think it’s only on your way out. We flew from Boston to Dublin to Naples and didn’t talk to a single person"}, {"username": "Sandy Radican Shikaly", "comment_text": "If you are arriving from the United States.. say in Rome.. you will go through passport control/\nimmigration.. retrieve your luggage.. then customs which will be a walk through lane \" nothing to declare\" since you are just arriving there with no purchases to declare... when returning home if you made purchases in Italy you will declare them in the United States."}, {"username": "John Layman", "comment_text": "No problems with bringing smokeless tobacco.You better bring it,not sold in Italy"}]}, {"id": "2213641749034903", "text": "We are travelling to Capri from Sorrento. What is the best way to get to Capri and which is the best blue grotto boat tour of the island?", "link": "facebook.com/groups/1373361046396315/permalink/2213641749034903/", "likes": 4, "comments": [{"username": "Fiona Mac", "comment_text": "Go to main marina plenty boat trips last one comes back about 5.30\nGo to annacapri it's stunning less busy"}, {"username": "Megan Lewis", "comment_text": "Following"}, {"username": "Denise Tassone", "comment_text": "Following"}, {"username": "Tomas Krivanek", "comment_text": "There are public ferries from Sorrento. On capri you catch a boat...there are plenty of them"}, {"username": "Maria Antidormi Corica", "comment_text": "So so busy. We staying in Sorrento which is beautiful. In Ravello today. Stunning and quieter"}, {"username": "Laurie Ladouceur Schmitt", "comment_text": "I found this helpful. https://\nwww.earthtrekker\ns.com/\none-day-in-capri\n/"}, {"username": "Tanya Dufour", "comment_text": "following"}, {"username": "Kimberly Lynne", "comment_text": "We booked a private tour through Viator. Our smaller group got us to and in the grotto quickly. Our guide was able to expedite some other lines as well. Well worth the premium."}, {"username": "Fetchin Gretchen", "comment_text": "choice of ferry or hydrofoil. ferry is about 45 minutes, hydrofoil 20 minutes, but much more expensive. Some of the best Blue Grotto boat tours judging from reviews (as I have not taken in a while) from Capri include:\n\nCapri Boat Tours: This company offers a variety of boat tours, including a tour of the Blue Grotto, a tour of the island, and a sunset cruise.\n\nAnacapri Boat Tours: This company offers a tour of the Blue Grotto that departs from Anacapri, which is the town on the other side of the island from Capri. This tour is a good option if you want to avoid the crowds in Capri.\ncan book via GetYourGuide app\n\nPrivate Blue Grotto Boat Tour: If you want a more private experience, you can book a private boat tour of the Blue Grotto. This is a good option if you are traveling with a group or if you want to avoid the crowds.\n\nNo matter which boat tour you choose, be sure to book your tickets in advance"}, {"username": "Terry Pisano", "comment_text": "Doing a ferry from castellammare port in sorrento, then a viator tour that includes blue grotto (if available that day)."}, {"username": "Iman Nazaran", "comment_text": "Following"}, {"username": "Nidhi Khanna Bansal", "comment_text": "Following"}]}, {"id": "2213646525701092", "text": "Hello! I have never been to Italy before but I’m trying to plan a surprise trip for my partners birthday! I have lots of questions haha I’m thinking 4/5 days, I think there’s more that interest us in Rome but also want to go Venice to go on a gondola, is it possible to do a couple days in each? Can anyone recommend a nice hotel in the city centre of either? And any things that are a must see/do in either of these places? Thank you ☺️", "link": "facebook.com/groups/1373361046396315/permalink/2213646525701092/", "likes": 4, "comments": [{"username": "Valentina Bachi", "comment_text": "From Roma you can easily take a fast train to Venice, but with 4/5 days only I would not advice you to do both."}, {"username": "Dann Hrusch", "comment_text": "Three nights Rome and two in Venice would be enough to see major sites and have some great memories. That said, you're biggest expense will be airfare, so if you're already paying that, then consider adding a couple of days to spend more time in either city or add Florence."}, {"username": "Ana Ka", "comment_text": "I would do only one place like Valentina suggested"}, {"username": "Ana Ka", "comment_text": "I did that too for my parents long time ago 🙂. They visited Rome and Florence… was amazing trip they say."}, {"username": "Shirley Lewis", "comment_text": "do one city only in your 4/5 days ..."}, {"username": "Julchen Zamora", "comment_text": "If you are planning a “surprise” be aware that this is a public group, meaning even if your partner is not part of this group if he/she has Facebook she/he could see it"}, {"username": "Pam Kimak", "comment_text": "Take a few more days..traveling\ntakes up 2 days. I recently went and was counting on flights being ontime..it just doesn't happen that often. The plan was to arrive at 8 a.m. and flight was delayed almost 4 hrs...half flights were canceled that day so we were lucky to take off at all. So we really only had half a day on our first day. Coming home,more hourly delays and then returning to ewr had to stand on line 40 minutes to show our passports to get back into U.S.. So my advice is, don't play it too close with your scheduling."}, {"username": "Julie Koziol", "comment_text": "There is so much to see in Rome. I’ve done a lot of research on things to do and places to go. I’m going with a tour group that’s doing Italy in 14 days. They are only spending one day in Rome. They are doing the Sistine chapel, Vatican museums, St Peter’s, the Colosseum and the Roman Forman. One day is not enough. So, I’m going 5 days early. I’m going to do the Hop on Hop off bus for 3 days and 1 evening. I’m going to download Rick Steves free audio tours. I’m also going to do a nighttime food golf cart tour. They have scooter tours, tipsy tours and shopping tours. Just look on FB. Plus, I plan on doing a lot of walking to just explore."}, {"username": "Bill Gillespie", "comment_text": "Many rooms to choose close to Pantheon, it's centered between Piazza Novella, the Vatican, St. Peters, the Colloseum, Trevi and the Spanish steps. You'll be very very busy in Rome, would normally recommend at least 5 nights in Rome, in your case, 3 and 2."}, {"username": "Jeff McLellan", "comment_text": "I know time and budget may be limited but if you are traveling from US or Canada I honestly could not image going to Italy for the first time for only 4/5 days especially trying to do more than one city. I would never do it if your flight was not direct either, we have delays both ways."}, {"username": "Sara Burrow", "comment_text": "4/5 days is not enough to see Rome & Venice as Venice is in the North part of Italy & Rome in the South. You will spend too many hours traveling. I would save Venice for a future trip & visit Rome with a day trip to Amalfi Coast, a day in Rome, & then go to Florence."}, {"username": "Vinayini Murty", "comment_text": "And remember you will both have jetlag! That made our schedule wonky for a few days. I came from Canada. I agree with those who recommend a longer trip, particularly given the cost of airfare. Of you only have 4-5 days pick another place closer to your home..."}, {"username": "Lucrezia Folger", "comment_text": "4-5 days, plenty to do in Rome. The gondola will always be there as it's a tourist thing."}, {"username": "Barbara Bastianini", "comment_text": "Everyone’s different but with only 4 or 5 days I’d spend the whole time in Rome."}, {"username": "Sara Butcher", "comment_text": "You can catch the fast train from Rome to Venice. You can definitely see a lot of both cites in that time. My favourite of the two is Venice. I normally get a train around 9-10am to go to the next city. That way I get up, have breakfast and go to station. You won’t get caught up somewhere and risk not making your train.\nIn Venice last trip, I stayed at Splendid Venice StarHotel. It’s 2 mins behind St Mark’s and is on a canal to make arrival/\ndeparting via water taxi easy. Definitely consider water taxi for arrival, nothing more stunning! ❤️🇦🇺"}, {"username": "Rebecca Yeoh", "comment_text": "For Rome, stay in the areas of Pantheon / Piazza Navona /\nCampo de’ Fiori – best for first time visitors. Easily walk to major sights of the city and enjoy the atmosphere of one of the greatest cities on earth! If you need a hotel recommendation…Ho\ntel Smeraldo 👌🏼 https://\nwww.smeraldoroma\n.com/en/"}, {"username": "Jenny Frank", "comment_text": "Venice and Rome are 4 hours apart ."}, {"username": "Karen Curci", "comment_text": "Our favorite hotel in Rome is Mecenate Palace. Within walking distance of the train station, which you can get to with the train from the airport. The hotel is right across from Santa Maria Maggiore."}]}, {"id": "2213657495699995", "text": "Buongiorno a tutti. I am looking for some recommendations/advice. I am planning on going to visit family in Asiago, Italy in late November/early December. The closest airports to Asiago are Bologna, Verona, Venice or Milan. We are not planning on renting a car and will be travelling by train or bus from the airport to Asiago. I am looking for suggestions as to which is the best route to Asiago, that has some nice points of interest to stop along the way, between the airport we land in and Asiago. Thanks for your time.", "link": "facebook.com/groups/1373361046396315/permalink/2213657495699995/", "likes": 2, "comments": [{"username": "Suzanne Joslin Oliveria", "comment_text": "Check rome to Rio app from all those cities. It will show all.of your options"}, {"username": "Fetchin Gretchen", "comment_text": "The best route to Asiago from the four airports you mentioned depends on your interests and budget. Here are a few options:\n\nBologna: This is the closest airport to Asiago, and it is also the most affordable option. You can take a train from Bologna Centrale station to Asiago. The journey takes about 2 hours.\n\nVerona: This airport is a bit further from Asiago than Bologna, but it has more flight options. You can take a train from Verona Porta Nuova station to Asiago. The journey takes about 2.5 hours.\n\nVenice: This airport is the furthest from Asiago, but it is also the most popular tourist destination in Italy. You can take a train from Venice Santa Lucia station to Asiago. The journey takes about 3 hours.\n\nMilan: This airport is also a popular tourist destination, but it is not as close to Asiago as Bologna or Verona. You can take a train from Milan Centrale station to Asiago. The journey takes about 3.5 hours.\n\nIf you are looking for a route with some nice points of interest to stop along the way, I would recommend flying into Bologna and taking the train to Asiago. You can stop in the town of Vicenza, which is known for its beautiful architecture.\n\nYou can also stop in the town of Marostica, which is known for its annual chess tournament that is played in the streets.\n\nIf you are flying into Verona, you can stop in the town of Verona, which is home to the famous Verona Arena.\n\nIf you are flying into Venice, you can stop in the city of Venice itself, which is a UNESCO World Heritage Site."}]}, {"id": "2213626752369736", "text": "Spello, the city of flowers! Join us: https://nextstop-italy.com/virtual-tours/spello-flower-town/\n\n#virtualtour #umbria #umbriatourism #italy", "link": "facebook.com/groups/1373361046396315/permalink/2213626752369736/", "likes": 3, "comments": [{"username": "Zara Moore", "comment_text": "I'm happy that I didn't ignore the opportunity to become a winner from Davis I gave listening ears to her mentorship and got my profits without stress, I appreciate your tireless efforts Davis Harrison"}]}, {"id": "2213263955739349", "text": "So.. have been planning my dream Italian trip for months . 8 months to be exact. I always wanted to go to Italy. I was so looking forward to going to this country with my two kids and husband .\n\nWe were all ready , packed and with only 4 hours left for the flight my son started having severe stomach pain. Rushed him to the ER , he had to have appendix surgery and we came home 2 days later .\nMissed the flight , all but one airbnbs returned 50% . All of the attraction tickets I bought through official websites do not have any cancellation option so I will have to start calling them tomorrow . Only cancellation that happened was via Viator .\nI don’t know how to feel. I am extremely relieved that my son didn’t get sick in the air or in Italy but I am so extremely lost now with what to do next.\nBought my plane tickets through a third party and they are of no help when I tried to reschedule. I am constantly on the phone . As of now they are saying don’t be hopeful on the air ticket refund. I will keep trying .\nHad so much fun planning this trip.. this group was nothing but wonderful. Just wanted to share my story here .please keep my family in your prayers .", "link": "facebook.com/groups/1373361046396315/permalink/2213263955739349/", "likes": 73, "comments": [{"username": "Helen Layton Brechler", "comment_text": "Deny the charges"}, {"username": "Sally Staltare", "comment_text": "Hopefully you will get all your monies back\nThank God your Son is ok ❤️❤️🙏🏼🙏🏼"}, {"username": "Jenny Kendrick", "comment_text": "So sorry to hear your going through this."}, {"username": "Christine Alesia", "comment_text": "I’m so sorry this happened, but thankfully it didn’t happen while overseas. I’m so glad he is ok.\nGood luck trying to reschedule, how awful to lose all that money. Hopefully some let you pick new dates."}, {"username": "Lynn Alsandor", "comment_text": "We were in the same boat when a hurricane hit our home town. Hours of phone calls and never was fully reimbursed. I will never not go through a travel agent or not have insurance. So glad your son is ok."}, {"username": "Ruth Dias", "comment_text": "😪🤕🙏❤"}, {"username": "Alicia Cox", "comment_text": "So sorry, but glad your son is ok. That could have ended really badly. Maybe get a copy of the hospital bill & that will give you some additional credibility with some of these vendors to get your money back. Good luck!"}, {"username": "Ramona Rodriguez", "comment_text": "🙏🏽"}, {"username": "Silvia Arndt", "comment_text": "I feel as if everything happens for a reason..now was not the time to go to Italy. You and your family will get there and have an amazing time ❤️"}, {"username": "Rosanna Hardeman", "comment_text": "Be thankful that you weren’t in flight and had his appendix rupture.\n\nHopefully, you can rebook and enjoy your trip at a later date."}, {"username": "Linda San Paolo", "comment_text": "Wish you the best in recovering and refunded..... this happened to me and alot of people during COVID-19 I was very lucky that I could rebook....hang in there and I hope you get a fair deal!"}, {"username": "Nana-nomie Morales", "comment_text": "I’m so sorry this happened to you, but more importantly your son is ok, healthy and full of life ❤️ I hope and pray you make it to Italy one day 👏🏼\nWe are planning on going in 2025 with family and friends\nI wish your family the best ❤️🙏🏼"}, {"username": "Debbie Jones Schilling", "comment_text": "Praying you get your money back and you get to Italy one day. That would be super disappointing. My heart goes out to you. Glad you’re son is well."}, {"username": "Kathleen Chaudhari", "comment_text": "My family of 6 had to cancel 2 trips to Alaska, once in 2020 because of covid and then in 2021 when my sister unexpectedly passed away. Both times we rescheduled everything for the very next year. I was shocked how many Airbnb’s allowed us to transfer our reservations. Tour companies, too. Email them about your sons hospitalization\nand ask them for some grace — even those with a “no refund” policy did allow us to transfer. Good luck!"}, {"username": "Peter Nagafuchi", "comment_text": "It’s only money Your son is alive and well. You are very fortunate to have dodged a bullet. Italy will always be there."}, {"username": "Ruth Francis", "comment_text": "So sorry for you. I hope you had travel insurance..!!"}, {"username": "Sarah Rogers Zakala", "comment_text": "I’m so sorry to hear this happened. I am sending good thoughts to you that all the things you have to do to cancel go as smoothly as possible."}, {"username": "Kerry Jacobsen", "comment_text": "I am so sad to read what happened. I wish there was something I could say to help. I can’t imagine how disappointing this would be. I hope that knowing so many people care brings you some comfort."}, {"username": "Rosslyn Patience", "comment_text": "Travel insurance is a must. I hope everything Is alright now and your son is better. It would have been a nightmare experience."}, {"username": "Sandra Keyser", "comment_text": "So very sorry 🫂"}, {"username": "Tamala Mallett Moore", "comment_text": "🙏🏾🙏🏾🙏🏾"}, {"username": "Donna Cafora Shepard", "comment_text": "I’m so sorry that happened to you. Always get travel insurance! You never know what will happen. The night before we were scheduled to come home, my son got the flu and had a fever of 104. There was no way he was getting on a plane. We took him to a hospital and they said he couldn’t fly for five days. There was no charge at the hospital and they gave us a note that he couldn’t fly. I called the airlines right away to cancel our flight and see if they could get us on another one. The trouble was it was the week between Christmas and New Years and all the planes were full! Finally they got us on one New Years Eve but had to bump us up to business class because all the other seats were filled. When I got home I contacted our travel insurance company and they were great! They covered the balance on our airfare and even asked if I had receipts for the extra nights for rooms and food! We stayed with friends so we didn’t have any extra expenses but they were ready to cover those too!"}, {"username": "Lynne Roy", "comment_text": "While you may not get a refund, you may get credit to use your tickets to book a different trip. The typical caveat is you need to travel before the 12 month expires - and often the 12 months is from when you made the original reservations - not the departure date."}, {"username": "Kay Lennington", "comment_text": "I can imagine how disappointed you are and yet grateful at the same time. I hope you're able to go soon."}, {"username": "Norma Marr", "comment_text": "I’m so sorry. This happened to us in 2020. We planned an Italian trip and cruise. Sixteen day trip. We couldn’t go due to Covid and I have poor immunity. You should be able to get refunds from everyone you booked with, with just a letter from your sons dr. That’s how we did it. I hope it works for you. Good luck. 👍"}, {"username": "Leslie Goodland", "comment_text": "God had that happen for a reason. That's how you have to look at it."}, {"username": "Jerry Cowper", "comment_text": "So glad your son is recovering. Perhaps you could talk with your travel insurance insurer and check and see what you are able to claim. Good luck and hope your son fully recovers quickly."}, {"username": "Heather Cohn", "comment_text": "Ugh 😣 so sorry 😢 but glad your son is ok. Maybe write a letter to the airline and include a doctor note validating your sons surgery maybe the airline will have some empathy for your situation"}, {"username": "Heather Cohn", "comment_text": "Did you have trip insurance? If so, contact them immediately to see what they will reimburse. obviously that will not make up for the disappointment but at least you will have that money back to try to plan your trip again. I think planning your trip for a future date and giving yourself something to look forward to may ease the disappointment of this trip not working out"}, {"username": "Jodie Kenny", "comment_text": "Never travel overseas without travel insurance. Medical emergencies alone can cost hundreds of thousands. A small price to pay for piece of mind."}, {"username": "Bea Kuckens", "comment_text": "Next time get travel insurance."}, {"username": "Carolyn Adams Brown", "comment_text": "I am sure you are very disappointed. We had planned a trip to Rome, Venice and Paris prior to Covid. I spent a year planning it and had to cancel everything. Plane and train tickets, tours, lodings etc. I really feel your pain. God be with you."}, {"username": "Mitzi Monday", "comment_text": "So very sorry!!"}, {"username": "Renae Larcus", "comment_text": "Heartbreaking. Hopeful that you can recover some of your housing and ticket costs. We used to buy airline tickets through a third party but no more. I have heard too many horror stories about trying to get a refund. Good luck! Did you have travel insurance????"}, {"username": "Maxine Cunnyngham", "comment_text": "I’m so sorry. Hopes and prayers you get your money back. ❤️"}, {"username": "Nellie Corizzo Adams", "comment_text": "So sorry 😢"}, {"username": "Beverly Rushing", "comment_text": "This is a great reason to use a good travel agent. Let them do the work and they will fight for you if you have a prob. Trust me they have tones of inside info and what you pay them is soooo worth it.....and it is really very little for all the work that they do for you. I truly hope everything works out for you."}, {"username": "Kristy Earnshaw", "comment_text": "Travel insurance?"}, {"username": "Linda Brookings Hull", "comment_text": "👏"}, {"username": "JoAnn Sgarlata Simmons", "comment_text": "Do not give up ! Constant calls! I went through this when Covid hit. Nobody wanted to refund me, I continued with calls and letters and went up the chain of command. I was merciless. Finally it started and the refunds started. I received all monies back 100%. Wishing you the best of luck and praying that your dream may come true for you and your family once again!"}, {"username": "Marianella Flynn-Morales", "comment_text": "Afrin so sorry this happened. For flight tickets to reschedule, try calling their corporate office. This was a situation not in your control at all. Tell them your happy to scan over all the hospital info and ask for a manager. Then say your flexible ( hopefully) on leave date. My daughter’s boyfriend had terrible food poisoning and missed his flight. I waited in line and asked for a manager explaining the situation. Showed the ER docs and he was set up on the next flight out. Hope this helps."}, {"username": "Julie Hinton", "comment_text": "I’m so sorry!!! You will get there. Don’t give up hope. Took me 4 years! I got there in 2021. Cried when we landed."}, {"username": "Michele Shamel", "comment_text": "I wonder if you asked the owner of the b&b if they can just book you another week instead of only getting 50% back. You had a medical emergency. That is if you want to go at a later date."}, {"username": "Ivette Lugo", "comment_text": "prayers"}, {"username": "Sonia Smith", "comment_text": "🙏"}, {"username": "Angie De La Garza", "comment_text": "Glad your son is ok. Xoxo"}, {"username": "Tracey Pino", "comment_text": "Glad ur son is safe"}, {"username": "Jonalee Wilson Stephens", "comment_text": "That’s so heartbreaking! Glad your son is ok but you must also be devastated. Hope you get some refunds!!"}, {"username": "Cheryl Barowski", "comment_text": "Glad your son made it to hospital in time. Your travel insurance should cover most of that cost and reimburse you for whatever you didn’t get reimbursed for. Also check with your credit card company."}, {"username": "Domenica Conserva", "comment_text": "Sorry to hear this! As long as your son doing well the rest doesn’t matter!\nTravel insurance is so important…"}, {"username": "Sandra Ferrante-Kohn", "comment_text": "This advice is akin to closing the barn door after the horse got out, but for future travel I suggest you purchase travel insurance. A similar situation happen to me and fortunately with the aid of this policy we were able to recoup our cash outlay with proper documentation (doctor’s form).\nI am so sorry this happened to you, but happy your child is well."}, {"username": "Shirley Clark", "comment_text": "So very sorry."}, {"username": "Flavel Rogers", "comment_text": "So sorry to hear about your trip, but glad that your son is doing well. Keep trying and send them the ER and other documents."}, {"username": "Judith Tobin", "comment_text": "Assume you have travel insurance?"}, {"username": "Jo-Anne Redwood", "comment_text": "So sorry!! How scary!! Glad he’s ok. If you don’t have insurance, look at the policies for your purchases which may have a medical clause.\n\nSome may be willing to give you a credit or voucher instead like they did during Covid.\n\nI’m sure others have way better advice. What a nightmare. I will suggest though to keep a running log off who you call, their id, case number and response.\nDuring the Covid mess, there were many companies that said they would reimburse us, and then didn’t, and I had to follow up many times, but I had at least some information that I can call back with like a case number or a persons name"}, {"username": "Linda Yahn", "comment_text": "I am so sorry! But i appreciate your kind and gentle spirit where you aren’t about trashing anyone! In my prayers."}, {"username": "Nansi Foster", "comment_text": "Glad your son is doing well and that is the most important. Good luck with the rest of your problems about refund your money 😢 hope you had a plan to be fully refunded everything, because it is going to be hard. 🙏❤️ unfortunately some companies they don’t really care about us but only for the profit if you don’t have a plan to get back your money say good bye to them.. 😌 I’m sorry 😞 but think positive your son is doing well!! 🙏😊"}, {"username": "Sheryl Vasconcelos", "comment_text": "Glad your son is ok.\nHope you can go to Italy another time."}, {"username": "Lucy Thornton", "comment_text": "Hope your son is ok, but don't let them away with charging you, did you have free cancellation on your properties booked? Flights through a third party are notorious, hope your son is OK and I hope you had insurance x"}, {"username": "Gina Winterstein", "comment_text": "Did you have travel insurance?"}, {"username": "Jenny Payne", "comment_text": "Do you have insurance?"}, {"username": "Alyson Alai", "comment_text": "I’m so sorry. The good news is that your son is safe and well."}, {"username": "Lexie Enlow", "comment_text": "I’m so sorry 😞"}, {"username": "Paula Bennett", "comment_text": "I am so sorry about the timing of the appendicitis! But so thankful, as you are, that it happened prior to flight! H￼is life is worth more than those refunds! You’ll get there! I wish your family the best and pray there are some decent people out there that will refund some money. My advice is travel insurance. Hope recovery is uneventful! Prayers for your family!"}, {"username": "Cyndi Riley", "comment_text": "Just curious, did you take the insurance out on your AirB&B’s I have booked them and did this. Wondering if it was a waste of my $$? Mt CC is insured too. Thx! Glad your son is ok. Hope you get great results from all your bookings."}, {"username": "Suriya Amy", "comment_text": "I hope your travel insurance can help? Get you as much back as possibly to get your trip re planned! Sounds like you all need a holiday now! X"}, {"username": "John Chandler", "comment_text": "Good luck with your son. If you paid by credit card there may be insurance attached as part of conditions especially with Amex."}, {"username": "DerricknCatherine Fejarang", "comment_text": "We always buy travel insurance with cancellation and pre-existing medical coverage. It came in handy for us on multiple occasions in the past: lost item/luggage, flight cancellation, and last month for medical reasons. Even though my credit card has cancellation and interruption, I still add travel insurance for peace of mind and added benefits. I hope you’re son recovers well🙏🏼 Atleast you were home and it did not happen while you were out of the country."}, {"username": "Lorraine Swick Sanfilippo", "comment_text": "You didn’t have trip insurance?"}, {"username": "Michelle Evans Greene", "comment_text": "I’m so sorry"}, {"username": "Mark Arsenault", "comment_text": "Does your travel insurance not cover that?"}, {"username": "Donna DeBiasi", "comment_text": "Sometimes the third parties will use the excuse that the airline/hotel won’t reimburse. If that’s the case go directly to the vendor and ask if they will assist you . You will definitely need to show a doctor’s note. Glad your son is on the mend. ❤️"}, {"username": "Brenda Pappalardo", "comment_text": "Prayers"}, {"username": "Annette W Bryant", "comment_text": "So sorry"}, {"username": "Kate MH", "comment_text": "Check your insurance, some of them can help You with the tickets."}, {"username": "Nancy Komatz", "comment_text": "I'm so sorry...hoping your son will be fine and that you'll recover financially. I hate spending the money on travel insurance with all other cots so high, but I think it's well worth it. Check your credit card's to see if there's any insurance there, or if they can go to bat for you to prevent any charges that haven't gone through yet. Hope there's a silver lining in this for your family."}, {"username": "Ana Ka", "comment_text": "I hope your son is better!… but yeah not everyone is understanding and willing to return money 😔. Hopefully, you can get some of it back… and surely you can do another trip soon 😍"}, {"username": "Mike Adams", "comment_text": "“Non refundable “. Often means\nNo cash refund BUT CREDIT for future flights.\n\nTry that tactic"}, {"username": "Mike Adams", "comment_text": "Good luck"}, {"username": "Anne Rodgers DeMaio", "comment_text": "Sending prayers. I had a similar situation in 2019. And had some insurance but not on my hotel in Priano - I was simply asking for a credit as we still hoped to eventually go. No response. I ended up disputing the charge on my credit card and got a full refund. Good luck!"}, {"username": "Jade Murray", "comment_text": "Your travel insurance should cover medical cancellation, check with them 😊"}, {"username": "Lorissa Gill", "comment_text": "call your travel insurance"}, {"username": "Denise Ward", "comment_text": "Oh no! I'm so glad your son is ok, and thankful it did not happen in mid air. Prayers you get your money back and can rebook."}, {"username": "Karen Molinari", "comment_text": "Sorry to hear about your son’s illness and best for his recovery. My thought is that the many travel vendors aren’t as forgiving or generous with refunds due to the fact that they’re trying to recoup income lost during the pandemic. If they’re unwilling to do a refund, ask for a credit to use within a certain timeframe. Airline tickets probably won’t refund, but again, you can try the credit route. It might be helpful to get a doctors note that your son had to have emergency surgery at the last minute. Best to you."}, {"username": "Karen Pauls", "comment_text": "I'm so sorry to hear about your son. I hope he will be OK. I had a similar medical emergency in May and had to cancel our June trip to Europe. We were lucky in that most of the excursions I pre-paid, we got refunds for. The ones I hadn't prepaid - hotel etc - I just cancelled with no penalty. We got 80% of our rail tickets back. We didn't get refunds for some of the smaller airlines but got a letter from them saying we were \"no-shows\" - which we provided in our insurance claims. My sister had bought cancellation/\ninterruption insurance and she just got all her money back. I filed an insurance claim with my credit card and am still waiting but I'm sure it'll come through. Definitely get a letter from your son's doctor, outlining his illness and that he was unable to travel. Hopefully the companies will refund you - or at least provide a credit for what you have paid. I hope you can reschedule your dream trip and it will be even more wonderful. We are already planning a re-do for next year."}, {"username": "Gommy Shirley Pribisco Brady", "comment_text": "So sorry, but glad to hear your son is ok."}, {"username": "Kathryn Zurcher-Baglien", "comment_text": "Ohhhh what a sad turn of events! Glad your son is better but don't give up on the Italy dream. Make sure you provide documentation on the emergency surgery and hopefully that will help recoup some of the cost."}, {"username": "Wendy Morelli", "comment_text": "So sorry …..but hope you will get your dream trip soon! 🥰🥰🥰🙏🙏🙏👍👍👍"}, {"username": "Barbara Bastianini", "comment_text": "I’m so sorry this happened to you. I can imagine how disappointed you are.\n\nBut as someone who was involved in a life threatening accident in Rome that required hospitalization\nand surgery I have to say I’m glad his problem\nhappened here instead of in Italy. To be honest, I received excellent medical care there and they saved my life. But it’s very frightening and psychologically\ndifficult to deal with a medical system you’re unfamiliar with. And where you maybe aren’t fluent with the language. (I can say some common phrases in Italian but medical terms were beyond me.). Then there’s the financial aspect. Before leaving the first hospital I had to pay 24 thousand Euros for my stay of three days plus surgery. The second hospitalization\nwhich lasted two full weeks was additional. I can’t even begin to tell you how stressful it would have been to face those worries in a foreign country on top of concerns for your sons health.\n\nOn the bright side, as I said before, I was treated very well by the doctors and hospital staff. All of my hotels were extremely cooperative and refunded my non refundable payments in full. I hadn’t expected that but was certainly happy they did it. I had purchased flight insurance which covered my missed flight back home. I was also lucky in that my home medical insurance reimbursed me in full for the amount I had to pay the Italian hospitals. And my insurance also paid for a first class flight ticket to get me home as well as paid for a nurse to accompany me.\n\nSo although you were unlucky with what happened, in another way you were lucky it happened before your trip not while you were on it.\n\nHere’s what I learned from my own experience.\n1. Buy medical insurance for each trip. Most US policies do not provide for the reimbursement mine did. But you do need to have coverage while abroad.\n2. Buy flight insurance. It’s cheap\nbut so important if something happens.\n3. Be sure any insurance you have provides for evacuation home.\n4. Always book directly with the provider (the airline or the hotel itself, for example) because the third party is just another layer of bureaucracy you have to deal with if something goes wrong.\n5. Stay in a fully staffed hotel not a vacation rental. The help provided by the hotel staff was invaluable to me. From going with me in an ambulance, to making arrangements to extend my husband’s longer than intended stay at reduced rates, to making phone calls for us I honestly can’t imagine how we’d have navigated the situation without their kindness and help. They did so many things, both little and big, to help\nus out during our nightmare. I’ll be forever grateful to all of them.\n6. Take along an extra high limit credit card to be used only in case of an emergency.\n\nNone of this will help you right now. But I wanted you to know you’re not alone in having had a trip ruined by medical issues. I’m proof that anything can happen so I hope passing on what I learned might somehow help to prevent struggles in the future.\n\nAnd of course, I hope your son is fine and healthy now. That’s really the most important thing."}, {"username": "Genevieve Hunt", "comment_text": "I’m so sorry for this. Such a huge disappointment."}, {"username": "Lyn Pappas Dahm", "comment_text": "I’m very sorry this happened. Thank goodness your son is OK. I’m sure you’re very disappointed. You didn’t get to go. Always book these trips for the travel insurance. Things unexpectedly can come up at the last minute as in your situation. I never go to Europe without travel insurance."}, {"username": "Dora Llizo", "comment_text": "Glad your Son is ok I understand the airlines do not return your money but you should get Credit for when you able to go again"}, {"username": "Peggy Fisher", "comment_text": "So sorry!!! Happy your son is fine."}, {"username": "Graham Sherlock", "comment_text": "Your sons health is the most important, but it would be painful chasing up refunds etc good luck"}, {"username": "Lauren-Jade Roberts", "comment_text": "Should be a valid claim for travel insurance"}, {"username": "Patricia Foley Mastrorilli", "comment_text": "Thank goodness you were not in the air when thos happened or even on your trip! Such a bummer! Hoping you get a lot of your money back. Ugh..."}, {"username": "Robyn Lawson", "comment_text": "Sorry that all this happened…..but Oh my I think you really got lucky with your son not getting sick on flight or in Italy. All things happen for a reason. Wishing you happy replanning and getting done money back. 😊💙"}, {"username": "Claire Seears", "comment_text": "Travel insurance?"}, {"username": "Oriana Delle Cave", "comment_text": "Your Son is ok, everything else is decoration…"}, {"username": "Caitlyn Rose Feder", "comment_text": "Surely you took out travel insurance? Seems pretty clear cut / no pre existing so you should not have any issues claiming the non refundable costs back."}, {"username": "Kristina Ruk", "comment_text": "Try to offer the tours in this grouo maybe someone will be happy to buy it from you and you get st least some money. Wish you good health sometimes life happens"}, {"username": "Kristin Kornack", "comment_text": "If you bought travel insurance you may file a claim for this."}, {"username": "Sarika Mehta", "comment_text": "Thank goodness your son is better! Sorry you’re going through this hassle."}, {"username": "Sherri Wills", "comment_text": "Reschedule the trip asap"}, {"username": "Marcia Levy", "comment_text": "So glad your son is well.\nTake one thing at a time to try and see what you can go back. Will they allow you to rebook for the future with any airb and b or attraction tickets and give you a credit? Keep trying.\nBooking directly with airlines is\nThe way to go for when you rebook your trip! Along with trip insurance."}, {"username": "Joy Johnson", "comment_text": "So sorry"}, {"username": "Yvonne Ormson", "comment_text": "You can claim on your travel insurance 🙂"}, {"username": "Chrystal Stevens Bisonet", "comment_text": "I’m so sorry you had to cancel your trip! Thankful your son is ok!"}, {"username": "Judith Fuller", "comment_text": "So glad your son is okay. You'll get through the cleanup from your trip and will go another time when it will be even better."}, {"username": "Phyllis Flowers", "comment_text": "Wow so sorry to hear about your son. You didn’t have trip insurance I assume. The most important thing is your son is ok. Lessons learned always buy trip insurance, go to a reputable agency. Trip insurance is cheap. Will your credit card stand behind this cancellation perhaps they can help?"}, {"username": "Nydia Bryan", "comment_text": "Wishing your son good health, good outcomes on cancellations and refunds.\nYour trip is only delayed."}, {"username": "Kay Campbell Guzowski", "comment_text": "So glad you could see all the blessings of the timing - but so disappointing. Travel insurance is just a part of our travel budget now- I hope that you find some with the cards you died!"}, {"username": "Jodi Vosilla", "comment_text": "So sorry I always take travel insurance with elderly parents at home.. and unknown problems.. it costs a little more but gives me peace of mind .. had to use it once so far"}, {"username": "Joan Fogelberg", "comment_text": "Oh dear Mom. I am a grandmother and feel so sorry. But you hit the nail on the head! Your precious son is safe❤️"}, {"username": "Casey Hanna", "comment_text": "Provide documentation from the doctors office to all companies you made purchases with. That might help!"}, {"username": "George Thurman", "comment_text": "🙏🙏🙏"}, {"username": "Ruth Degiorgio", "comment_text": "Sorry about your son . Maybe you can claim through your insurance! Hope you had an insurance after all ."}, {"username": "Cindy Sguazzin", "comment_text": "So very sorry—life can deal some nasty blows!"}, {"username": "Jacky Lomas", "comment_text": "Afrin where do you live?"}, {"username": "Donna Nicoletti Guiffreda", "comment_text": "Glad your son is on the mend! So sorry for you situation now. I have never booked a trip , or tour or hotel reservation without checking the refund /cancellation policy"}]}, {"id": "2213595552372856", "text": "Is this a legitimate website for tickets ?\n\n", "link": "facebook.com/groups/1373361046396315/permalink/2213595552372856/", "likes": 4, "comments": [{"username": "Diane Davis Lawyer", "comment_text": "Yes, but you always risk cancellation when using resellers. You can book directly with the Colosseum 30 days out from when you plan to go. They even offer guided tours direct."}, {"username": "Kejdi Okej", "comment_text": "Yes but you always risk cancellers . You can book directly with the colosseum 30 day out from when you plan to go . They even offr guided tours direct."}, {"username": "Mandy Pusateri", "comment_text": "We just bought our tickets this morning from the official colleseum website for a guided tour in September. Way cheaper than other tour operators."}, {"username": "Jessica McMahon", "comment_text": "I booked this exact tour today on Headout for Sept 5th since I missed the memo on booking 30 days out direct on the website 🤦‍♀️ Cheapest option I could find with knowing the cancellation risk everyone says with third party. Took a chance anyway, will follow up in 3 weeks 🙃 When in Rome!"}, {"username": "Jaime Cleek", "comment_text": "If you keep an eye on the site you will get a ticket. They frequently release them"}]}, {"id": "2213460859052992", "text": "I want to enquire about an apartment in Milan, which is showing on booking.com named as Panoramic luxury penthouse 6people” … but cant trace on google.\nCould u all plz help me on this wjether I should go aheadआणखी for such bookings as its a paid booking.\n\nLink to the apartment is shared below- https://www.booking.com/hotel/it/panoramic-luxury-penthouse-6-people-milano.en-gb.html?aid=2311236&label=en-in-booking-desktop-SoQWfYhAMBURf0HSQntj1AS652796016141%3Apl%3Ata%3Ap1%3Ap2%3Aac%3Aap%3Aneg%3Afi%3Atikwd-334108349%3Alp9061848%3Ali%3Adec%3Adm&sid=553eb4191ca3d5d3f9e18f722b3e5922&all_sr_blocks=1057056601_377904024_6_1_0&checkin=2023-09-10&checkout=2023-09-15&dest_id=-121726&dest_type=city&dist=0&group_adults=4&group_children=0&hapos=4&highlighted_blocks=1057056601_377904024_6_1_0&hpos=4&matching_block_id=1057056601_377904024_6_1_0&nflt=mealplan%3D1&no_rooms=2&req_adults=4&req_children=0&room1=A%2CA&room2=A%2CA&sb_price_type=total&sr_order=popularity&sr_pri_blocks=1057056601_377904024_6_1_0__143075&srepoch=1691943269&srpvid=cab4720e7a530039&type=total&ucfs=1&activeTab=main#map_closed", "link": "facebook.com/groups/1373361046396315/permalink/2213460859052992/", "likes": 1, "comments": [{"username": "Fiona Cameron", "comment_text": "Nope. Don’t book anything that doesn’t have a free cancellation up to a certain date, booking usually offers a much lower rate if you pre pay and accept “no refund” policy. Personally I think its better to pay a slightly higher rate with refund eligibility."}, {"username": "Ishbel Raffle", "comment_text": "You can choose the free cancellation for a little extra. It’s new on the site so no reviews yet- might be perfectly ok. The address is on the listing if you click through to Select Rooms"}, {"username": "Cecilia Christine Costantini", "comment_text": "Never book something non-refundable and that has no reviews, esp. If it is expensive. I booked (refundable) something similar in Rome last year and luckily a few people stayed there before me and I could cancel. They said 'luxury' and people were rating it an average of 4/10 because it didn't match the photos and it was dirty. Luckily I could cancel my booking at no cost. They soon removed it from booking because reviews plummeted to 1/10. You can get lucky, or extremely unlucky. Don't risk it. Or wait for it to get a few rwviews."}, {"username": "Maureen Purcell", "comment_text": "I don't get why people say don't book anything non refundable. If your going your going. Just looked at it it's fine. I just booked a boutique hotel in Milan for next month which is non refundable."}, {"username": "Kejdi Okej", "comment_text": "But this is such nicely placed at the centre .. should we not go for this then ? Kindly advise then"}, {"username": "Beverly Kerr", "comment_text": "I skip over the listings with no reviews"}, {"username": "Sally Warren", "comment_text": "It is not in the location indicated on the map. The photos are not in or near piazza Duomo."}, {"username": "Joe LaLonde", "comment_text": "The apartment listing, and this post, are both a little fishy."}, {"username": "Martin-John Rubio", "comment_text": "Move on….too many other reportable ones I’m sure"}]}, {"id": "2213461435719601", "text": "Staying two nights in Rome, post cruise in early Nov. Looking at reasonably priced hotel options with access to public transportation, since we will not have a car. Is it still too crowded near Trevi fountain to stay in a hotel near there that time of year? Also, Queen and king size beds seem non-existent in Rome and maybe Europe in general. Is that a fair assessment?", "link": "facebook.com/groups/1373361046396315/permalink/2213461435719601/", "likes": 3, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.jdoqocy.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187791-d2031\n81-Reviews-Hote\nl_Condotti-Rome\n_Lazio.html"}, {"username": "Fiona Cameron", "comment_text": "Try this place but only book direct, not through 3rd party sites\n\nResidenza Praetoria Roma\nHere’s the email\n\ninfo@residenzap\nraetoria.com\nIve stayed many times, very close to Termini station, very clean, and queen beds!"}, {"username": "Ishbel Raffle", "comment_text": "Rooms are small in city centre hotels in Europe - hence small beds. If you’re happy to take public transport perhaps hotels on the outskirts will offer larger rooms/beds"}, {"username": "Mandy Pusateri", "comment_text": "We are staying three days in Rome before a cruise and found a great AirBnB."}, {"username": "Tracy Wrinn Mcdermott", "comment_text": "In my experience a “double” in Europe is often two singles(twins) put together or closer to a queen size. They are larger than a typical American “double/full” sized bed."}, {"username": "Fetchin Gretchen", "comment_text": "Yes, it is still too crowded near the Trevi Fountain to stay in a hotel near there in early November. The fountain is one of the most popular tourist attractions in Rome, and it is always crowded, even in the off-season. If you are looking for a reasonably priced hotel with access to public transportation,\nI would recommend staying in a hotel in a less crowded area, such as Trastevere or the Monti neighborhood.\n\nAnd also yes, queen and king size beds are not as common in Europe as they are in the United States. The standard bed size in Europe is a double bed, which is about the size of a twin bed in the United States. However, there are some hotels that do offer queen and king size beds, but they may be more expensive.\n\nHere are some reasonably priced hotels in Rome with access to public transportation:\n\nHotel Forum: This hotel is located in the historic center of Rome, near the Colosseum and the Roman Forum. It has a metro station right outside the door, making it easy to get around the city. The hotel has a variety of room sizes, including double, twin, and family rooms.\n\nHotel Raphael: This hotel is located in the Monti neighborhood, a short walk from the Trevi Fountain and the Spanish Steps. It has a bus stop right in front of the hotel, making it easy to get around the city. The hotel has a variety of room sizes, including double, twin, and family rooms.\n\nHotel Santa Maria: This hotel is located in the Trastevere neighborhood, a lively and charming neighborhood with a lot of restaurants and bars. It has a metro station within walking distance, making it easy to get around the city. The hotel has a variety of room sizes, including double, twin, and family rooms.\n\nI hope this helps!"}]}, {"id": "2213404955725249", "text": "Hi, I'm after recommendations of the best area of Italy to go for tours/accommodation that focuses on the slow food movement and organic food - even cooking classes that you gather your own ingredients and then cook etc. Even better if anyone can recommend somewhere near Amalfi Coast/Sorrento or near Florance? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2213404955725249/", "likes": 1, "comments": [{"username": "Rob Pek Proietti", "comment_text": "Tuscany is the best region IMO. Food, landscape, wine, islands, etc... I lived in California for many years and helped lots of people planning their dream tour of Tuscany. Now I moved back to Italy. How many days? My main recommendation is not trying to visit as many places as possible... you can only see/enjoy a handful of places in one or two weeks.. then of course each person has is own interests and travel style so, depending on your budget and number of travelers, I would suggest to contact someone that does custom tours for small groups."}, {"username": "Valentina Bachi", "comment_text": "I believe in Florence/\nChianti area there should be plenty of those :)"}]}, {"id": "2213415139057564", "text": "Thanks for the add, all! I’m planning my first trip to Italy in October! We can only go for 7 days 😢. We (my 27 year old son and I) will be based in Bologna and are planning 3-4 day trips by train. Where are the “must go” cities y’all recommend?", "link": "facebook.com/groups/1373361046396315/permalink/2213415139057564/", "likes": 3, "comments": [{"username": "Diane Davis Lawyer", "comment_text": "That's a very subjection question, depending on what your likes are personally. We are going to Florence, Rome, and Amalfi region. We fly into and out of Naples. If you're a museum and art person, then Florence. If you like architecture and ancient history, Rome. If you're going for the sea and scenery Amalfi or Cinque Terre. If you love rolling hills and beautiful landscapes, Tuscany. Honestly, can't see how you can go wrong in Italy. I've not seen any pictures on this group from anywhere in all of Italy that haven't been breathtaking. Enjoy! Good luck!"}, {"username": "Nadia Waugh", "comment_text": "You're very well situated to visit Venice and Florence, but also, take advantage of the region you're in: if you're a foodie, Modena and Parma are easy to get to, and on the coast you have Ravenna as well...have a great trip!"}, {"username": "Valentina Bachi", "comment_text": "From Bologna with fast train you can easily go to Florence, Venice, Milano, and Rome. South of Italy would be a bit distant."}, {"username": "Ana Ka", "comment_text": "I would be careful with Parma though. Had a bad incident some years back (we were almost attacked by a group of 10 youngsters ) and recenmy friends car was mugged there (glass broken, things stolen). But all the other towns mentioned are amazing 🙂"}, {"username": "Beth Ann", "comment_text": "Florence, Venice, Verona, Padova, and you could try also to get to the Southern parts of Lake Garda like Sirmione - you are well situated to see all those cities and also to enjoy Bologna which is a great city!"}, {"username": "Laura Piccinini", "comment_text": "Modena, food and motors, UNESCO site.\nAlso seaside for food and stroll (Rimini or Riccione)"}, {"username": "Rhona OConnor", "comment_text": "The Lamborgini factory and museum might interest him. 40 mins on the bus from Bologna."}, {"username": "Rhona OConnor", "comment_text": "Rhona OConnor"}, {"username": "Gianna Onesi", "comment_text": "It's a good area you can get to Florence by train, Lucca, Pisa"}, {"username": "Debra Abrams", "comment_text": "Thanks for all the great comments! We chose Bologna because it’s so centrally located and easy to get to other cities, but we have such a limited amount of time, so the real question is, WHERE should we go? We are not as much into churches and historical sights as we are foodies and would love to shop and explore quaint neighborhoods. So if you only had a handful of days to travel from Bologna, where would you absolutely want to go?"}, {"username": "Fetchin Gretchen", "comment_text": "That sounds like a great trip! Here are a few \"must go\" cities in Italy that are a short train ride from Bologna:\n\n* **Florence:** The capital of the Tuscany region, Florence is home to the world-famous Uffizi Gallery and the Accademia Gallery, where you can see Michelangelo's David. Florence is also a great city for wandering around and exploring the narrow streets and alleyways.\n[Image of Florence, Italy]\n[Image of Uffizi Gallery, Florence, Italy]\n* **Siena:** This beautiful medieval city is known for its Piazza del Campo, a large square with a shell-shaped fountain. Siena is also home to the Leaning Tower of San Gimignano, a 14th-century tower that is one of the most iconic landmarks in Italy.\n* **Pisa:** This city is home to the Leaning Tower of Pisa, which is one of the most recognizable landmarks in the world. Pisa is also a great place to visit if you are interested in history and architecture.\n* **Modena:** This city is known for its balsamic vinegar and its Ferrari museum. Modena is also a great place to visit if you are interested in food and wine.\n\nIf you are interested in art and history, I would recommend visiting Florence and Siena. If you are interested in food and wine, I would recommend visiting Modena. And if you are interested in seeing a unique landmark, I would recommend visiting Pisa.\n\nNo matter which cities you choose to visit, you are sure to have a great time in Italy!"}, {"username": "Lucrezia Folger", "comment_text": "In 7 days, (not arriving and departing as part of those days) Bologna and 1 other place."}, {"username": "Catherine AleXandra", "comment_text": "Just did Bologna as my epicenter. Train to Florence soooo fast! High Speed train. Super flexible. Easy tickets. Can always catch the next one.\n\nBologna is perfect! Omg it’s so much cheaper compared to other cities. So laid back. Best food. You will love it!!! I’m excited for you.\n\nYou could go to Florence in less time than it takes for most people to commute to work.\nA fast 40 minutes.\n\nThe Florence station connects to the bus terminal. From there you can go anywhere in Tuscany.\n\nVenice 1.5 hours. Stay overnight and see San Marco square at night."}]}, {"id": "2213410965724648", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213410965724648/", "likes": 1, "comments": []}, {"id": "2213333129065765", "text": "A great weekend in Cefalu Sicily!😇", "link": "facebook.com/groups/1373361046396315/permalink/2213333129065765/", "likes": 6, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "wonderful https://\nwww.jdoqocy.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g194726-d1409\n9400-Reviews-Cl\nub_Med_Cefalu_S\nicily-Cefalu_Pr\novince_of_Paler\nmo_Sicily.html"}, {"username": "Jen Belsito", "comment_text": "We will be there in a few weeks."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 8, "comments": []}, {"id": "2213334545732290", "text": "Looking recommendations for private water taxi’s from Venice Airport to our hotel. Any suggestions?", "link": "facebook.com/groups/1373361046396315/permalink/2213334545732290/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Venice/\nPrivate-Limousin\ne-Transfer-Veni\nce-Airport-to-V\nenice-City-Cent\ner-by-Car-and-W\nater-Taxi/\nd522-12418P1?pid\n=P00070587&mcid\n=42383&medium=l\nink&medium_vers\nion=selector"}, {"username": "Heather Hills Jacobs", "comment_text": "We used the “Get Your Guide” app!"}, {"username": "Jim Bobrowski", "comment_text": "This is the official water taxi. It was 140eu for private water taxi to our hotel. No reason to use viator or get your guide they are 3rd party.\nhttps://\nwww.motoscafiven\nezia.com/en/\n?gclid=Cj0KCQjwo\neemBhCfARIsADR2\nQCsoAzNrZbGPDM0\nq7541ZOw159yvxk\n6KuzW_A6httAk9k\neSBw5Y6OqMaAqkP\nEALw_wcB"}, {"username": "Maggie Lodge", "comment_text": "Mr Alvise (Private) always use him ...Very reliable +393483230278 just give him a call"}, {"username": "Anne Fredsall Michelini", "comment_text": "Our concierge called one for us"}]}, {"id": "2213335449065533", "text": "I am a single older female traveling to Rome in October. I join a tour on Saturday but my flight arrives on Thursday evening at 8:30. Any recommendations for a good but inexpensive hotel? Perhaps one with a shuttle from the airport to the hotel?", "link": "facebook.com/groups/1373361046396315/permalink/2213335449065533/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.dpbolvw.net/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187791-d1292\n3883-Reviews-Me\nininger_Roma_Te\nrmini-Rome_Lazi\no.html"}, {"username": "Helen Ladkin", "comment_text": "What hotel is your tour using in Rome? It might be easier to stay there the extra nights. The hotels usually have a private transfer option or you could catch a cab."}, {"username": "Bea Kuckens", "comment_text": "If you're meeting at the airport, I'd stay at a hotel near the airport instead of going into the city and back out again."}, {"username": "Rick Lozano", "comment_text": "We too arrive late. Staying at the Hilton Garden Inn, not cheap, but a lot less than in Rome. They do have a free shuttle from the airport to the hotel."}, {"username": "Véronique Piercey", "comment_text": "You could stay in Ostia near the ruins/beach. Very close to airport and would be a bit nicer scenery than the airport"}]}, {"id": "2213346089064469", "text": "Traveling with a group of six to Florence the last week of September. We would like to hire a private tour guide to pick us up in Florence, take us to Pisa and then possibly San Gimignano or Lucca. Any recommendations for a private tour guide? Looking at the train/bus routes looks intimidating for 1st time travelers to Italy. But I'm sure we could figure out the train to Pisa and meet a guide there if that is more available.", "link": "facebook.com/groups/1373361046396315/permalink/2213346089064469/", "likes": 6, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Florence/\nPrivate-Tour-Luc\nca-and-Pisa-wit\nh-Typical-Pastr\ny-Tasting-and-O\nptional-Lunch/\nd519-24286PRIVAT\nE?pid=P00070587\n&mcid=42383&med\nium=link&medium\n_version=select\nor"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Florence/\nPrivate-Tour-of-\nSiena-Pisa-and-\nSan-Gimignano-f\nrom-Florence/\nd519-6367P34?pid\n=P00070587&mcid\n=42383&medium=l\nink&medium_vers\nion=selector"}, {"username": "Ana Ka", "comment_text": "I would replace Pisa with smth else. Didn’t like that town as much. Choose from Lucca, San Gimignano, volterra, monteriggioni… even lucca and San Gimignano alone would be sufficient… you don’t want to run through these towns in one day 😌… would be too much."}, {"username": "Colleen Robinson", "comment_text": "Andrea picked us up at our hotel at 9 and dropped us off at 6.. He was extremely knowledable about the area and wineries and spoke very good english. He charged us 520 euros for the day. You could ask him to take you to certain places or ask for recommendations\n. It was our favourite day. You can email him to get a quote and information\n\na64.vignoli@gma\nil.com"}, {"username": "Gianna Onesi", "comment_text": "Paul http://\nwww.tuscantourgu\nide.com/"}, {"username": "Bea Kuckens", "comment_text": "Don't be intimidated by the trains. There's a first time for everything. We did it for the first time in our mid-sixties and it hasn't stopped us yet 😉 For everything you ever wanted to know about train travel, check out https://\nwww.seat61.com/"}, {"username": "Rebecca Yeoh", "comment_text": "If you don’t mind travelling with other people in a coach, the tour with Walkabout Tours I did was amazing, one of the best days of my whole trip. The lunch at the winery in Chianti was 👌🏼 https://\nwalkaboutflorenc\ne.com/tours/\nthe-best-of-tusc\nany-in-one-day-\ntrip-from-flore\nnce"}, {"username": "Maria O'Callaghan", "comment_text": "A few years ago, we use Maurizio. He was good, on time, smartly dressed & very passionate.\n\nhttp://\nwww.mauriziobell\nini.com/"}, {"username": "Valerie Collanton", "comment_text": "We used Florence Limousine Service for a full day private tour for 5 people that included tour of Chianti are, two wineries one with lunch, San Gimignano and Castellini in Chianti. Tour guide was great. They will customize to what you want. You can reach them at info@florenceli\nmousineservice.\ncom"}, {"username": "Kim Geary Keidel", "comment_text": "We used Belitaly Tours. I got the name/\nrecommendation from this site (or another FB Italy travel page). It was great! Beki will make suggestions and plan the tour based on your needs. He picked us up at 9 and dropped us off at 5ish. It was 550 euros. So worth every penny!"}]}, {"id": "2213350245730720", "text": "What l need help with is how to get around wheres the best places to stay. Where to start with planning. 🙄", "link": "facebook.com/groups/1373361046396315/permalink/2213350245730720/", "likes": 3, "comments": [{"username": "Shelley Howard", "comment_text": "start with a travel book and you tube pick your places u want to see .."}, {"username": "Rhona OConnor", "comment_text": "Go talk to a travel agent if you really don't know what you want. They will make suggestions."}, {"username": "Laura Uribe", "comment_text": "Decide where you would like to go. Are you the person that enjoys museums, churches and large cities or do you more enjoy the smaller town vibe and rolling hills? That is where you start. Allow yourself 3-4 days per city so you can have time to enjoy the city plus maybe a day trip or two. Once you’ve decided where you’re going, where do you want to stay? Are you a hotel person or are you more into apartments?\nWe travel via train and like to stay in the city center so Booking .com is a great resource.\nGood luck!!"}, {"username": "Etschi Bruckner", "comment_text": "I would also suggest the purchase of a travel guide ( with lots of photos)"}, {"username": "Kejdi Okej", "comment_text": "Start with a travel book and you tube pick your place u want to ees .."}, {"username": "Kally Trahearn", "comment_text": "Public transport everywhere - it's really easy to use and gets you to almost anywhere you need. Just make a plan of where you'd like to be then download Rome2Rio app - for all sorts of directions and then Trenitalia app for train info, where you can buy tickets online. Enjoy."}, {"username": "Lucrezia Folger", "comment_text": "1st, how long are you going for, weeks, months? #2 what places are you traveling to?"}, {"username": "Mary Agozzino Derrick", "comment_text": "Try Rick Steve's travel book....on Italy, and the other book on Sicily ....we can't possibly answer your question without know what your interests are, how long you're going for, etc"}, {"username": "Sande Ricci", "comment_text": "All depends on what you like. I was there this year and went to Rome, Florence etc. next year we are going to Genoa for 2 weeks and do some day trips and an overnight trip or 2. Genoa is very underrated which is fine with me."}, {"username": "Angela Marsala-Gaydos", "comment_text": "I suggest you look at organized tours and read where they take you. This may help you get a head start on your planning"}, {"username": "Renae Larcus", "comment_text": "Look at Rick Steves guides"}, {"username": "Fetchin Gretchen", "comment_text": "To get a first pass suggestion test run google Bard and tell it the proposed month, number of days, things you like to do, cities or areas on your list and ask for suggested itinerary. Then edit your searches from there."}, {"username": "Gianna Onesi", "comment_text": "Do some research Italy is beautiful everywhere depends what you are looking for."}, {"username": "Cris Wimer", "comment_text": "Watch Rick Steves Italy utubes and other folks to choose where you want to travel. That is step one because transportation will depend on what area you are going to. This will also determine if you need lodging near a train station or if you need parking."}, {"username": "Sam Mah", "comment_text": "Have you ever been before? If not the must do cities are Rome, Florence and Venice. The issue at the moment is that they are very crowded. You might just choose cities for what they are famous for so go to visit Bologna for the food or Pompei for the interesting history....the sort of things you're interested in."}, {"username": "Barbara Bastianini", "comment_text": "I always visit my local\nLibrary to check out several different travel guides. Reading them helps me know what places appeal to me. Then I start planning."}]}, {"id": "2213354369063641", "text": "What activities are there to do in Como Italy in the winter?", "link": "facebook.com/groups/1373361046396315/permalink/2213354369063641/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Lugano/\nLugano-Bellagio-\nand-Cruise-Expe\nrience-from-Com\no/\nd26381-6404P36?p\nid=P00070587&mc\nid=42383&medium\n=link&medium_ve\nrsion=selector"}, {"username": "Francesca Giovanelli", "comment_text": "In Como city most of shops and attractions are open in the winter, but around the lake in the smaller villages are closed. Famous gardens are closed. Villas are closed. Restaurants and shops are closed."}]}, {"id": "2213270165738728", "text": "Hi everyone, I’ll be travelling in Florence mid September with my mother in law and teenage daughter and I’m wanting to book a tour. Is cinque Terre discovery escape tour worth doing? Or is walking it alone at our own pace good enough? TIA 😊", "link": "facebook.com/groups/1373361046396315/permalink/2213270165738728/", "likes": 0, "comments": [{"username": "Jeanne Eliason", "comment_text": "Will you travel to Cinque Terre and back in one day? Just mentioning it because it's about 2 1/2 hours from Florence by train or car. That does not include parking or waiting for trains. So figure 6 hours travel time. We tried it and thought, never again. We would stay there for a day or 2. As for your question we just took our time and walked to one town."}, {"username": "Anne Noel Allen", "comment_text": "Take a small group tour from Florence. You will be gone 13 hours. 2 hrs there and 2 back. More than enough time to get a taste of the towns."}, {"username": "Rebecca Yeoh", "comment_text": "I did the day tour from Florence to Cinque Terre…it’s not great. It’s the kind of place that needs more time so I didn’t get the best out of it…it’s so quick that it is hard to take it in. Took us 3+ hours to get La Spezia alone (where you jump in the train that goes to CT) because there were road closures in La Spezia. I’d recommend a tour of Tuscany if you haven’t organised one. A tour of Tuscany was one of my fav days of the whole trip. Check out Walkabout Tours."}, {"username": "Kejdi Okej", "comment_text": "Take a small group tour from florence . You will be gone 13 hours . 2 hrs there and 2 back . More than enough time 2 back . More than enough time ti get a taste of the towns."}]}, {"id": "2213354515730293", "text": "Looking for ideas in Genoa Italy without a tour or guide. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2213354515730293/", "likes": 1, "comments": [{"username": "Lisa Martinson", "comment_text": "You may want to look at viator or trip advisor to book some walking tours."}, {"username": "Karyn McCluskey", "comment_text": "We did hop on hop off bus for 2 days it was good to get your bearings. Then we went to Boccadassae beach for swim we found free 1 . We caught Casella train lovely old train ."}, {"username": "Aaron Peterson", "comment_text": "https://\nwww.acquariodige\nnova.it/en/\nplan-visit/\n?gclid=Cj0KCQjwo\neemBhCfARIsADR2\nQCubGN3N9Rqk6YZ\nEmtvSDFUfZ8HJPP\nRviZS8fIKvBDVYE\nzMDdfx7S38aAh3i\nEALw_wcB"}, {"username": "Francesca Giovanelli", "comment_text": "https://\nwww.visitgenoa.i\nt/en/homepage"}, {"username": "Francesca Giovanelli", "comment_text": "https://\nwww.visitgenoa.i\nt/en/rolli"}, {"username": "Grazia Maria Giordano", "comment_text": "Go to Porto antico band visit the aquarium and the Galata museum. Get lost in the vicoli of the historic center. Visit the duomo di San Lorenzo and palazzo ducale. Get thectrain tobNervi and have a walk in the gardens and on the passeggiata. Walk in corso italia towards boccadasse and have a gelato there. Go to Camogli and take the boat to San fruttuoso and Portofino. Plenty to do in Genoa"}, {"username": "Ali Everson", "comment_text": "Karyn McCluskey yes all those suggestions are great."}]}, {"id": "2213280149071063", "text": "I'm traveling to Milan in September from the USA. I use Zyn out here( tobacco free nicotine pouches) are these legal in Italy? I can't find any information about them.", "link": "facebook.com/groups/1373361046396315/permalink/2213280149071063/", "likes": 1, "comments": [{"username": "Georgina Mimi Griffiths", "comment_text": "We struggled to find them in Italy but travelled in and out of the country with them with no problem."}]}, {"id": "2213282375737507", "text": "Hello All!! I need help in mapping out a trip to Sicily! I will be in the Amalfi Coast for work and have four days to venture off and I’m thinking the Sicilian region because I’ve traveled the northern region. I don’t know if I should fly into Palermo or Catania! I definitely want to visit Taormina but as of now that’s as far as I’ve gotten! Withआणखी the four days I have I want to pack In the most and stay somewhere that is central to have day trip options. Any suggestions, routes, activities, restaurants, and any other suggestions are welcome!! Thanks I’m advanced! 😊", "link": "facebook.com/groups/1373361046396315/permalink/2213282375737507/", "likes": 2, "comments": [{"username": "Tina Bellitto", "comment_text": "Fly into Catania,do Taormina, Syracuse,not you only have 4 days"}, {"username": "Mary Agozzino Derrick", "comment_text": "Well if you want to see Taormina then fly into Catania and split your time between Taormina and Ortigia..."}, {"username": "Etschi Bruckner", "comment_text": "Catania would be the place to fly in, when you want to discover the east coast - but attention: at the moment the airport is closed - due to the latest mount Etna eruptions. After every eruption it´s super interesting to check out the lava chambers on the volcano ( of course with a certified guide!!). A rental car ( in that case, I´ve got some really nice spots for you!) gives you more flexibility - and visit Taormina as early as possible before tourists invade it like ants! If you need some peace there, have a drink at the Belmond Hotel next to the entrance of the amphitheater - not a bargain, but just the view is worth it!"}, {"username": "Kejdi Okej", "comment_text": "Fly into catania , do taormina syracuse , not you only have 4 days"}, {"username": "Fetchin Gretchen", "comment_text": "Here is a possible itinerary for a 4-day trip to Sicily from the Amalfi Coast, with stops in Palermo, Monreale, Cefalu, Taormina, and Catania:\n\n**Day 1:** Fly from the Amalfi Coast to Palermo. Check into your hotel and spend the afternoon exploring the city. Visit the Palermo Cathedral, the Palace of the Normans, and the Vucciria market. In the evening, enjoy a traditional Sicilian dinner at a restaurant in the old town.\n\n**Day 2:** Take a day trip to Monreale, a town located about 15 kilometers from Palermo. Visit the Monreale Cathedral, a UNESCO World Heritage Site. In the afternoon, take a train to Cefalu, a beautiful seaside town. Spend the rest of the day relaxing on the beach or exploring the town.\n\n**Day 3:** Take a bus to Taormina, a picturesque town located on a cliff overlooking the Ionian Sea. Spend the day exploring the town, visiting the Greek Theater, and enjoying the views. In the evening, enjoy a romantic dinner at a restaurant with a view.\n\n**Day 4:** Take a train to Catania, the capital of Sicily. Spend the day exploring the city and visiting the Cathedral of Sant'Agata. In the evening, take a flight back to the Amalfi Coast.\n\nThis is just a suggestion, of course, and you can adjust the itinerary to fit your interests and preferences. If you are interested in history and culture, you may want to spend more time in Palermo and Monreale. If you are looking for a relaxing beach vacation, you may want to spend more time in Cefalu and Taormina. And if you are interested in adventure, you can definitely make time for a hike to the top of Mount Etna.\n\nI hope this helps!"}, {"username": "Rosa Zordan", "comment_text": "Palermo and Taormina. Fly to one or the other then train/bus unless you're game enough to drive."}, {"username": "Amy Lombardi", "comment_text": "I am headed there next month. I did a ton of research. I’m starting in Cefalu and then headed to Taormina for a few days with a day trip there to Syracuse and Ortigia (tried to get to Noto as well but the dates didn’t work out.)"}]}, {"id": "2213598952372516", "text": "We are going to visit Venice and Florence soon. If you can recommend us some good-value for money restaurants and places where you can eat some pizza portions or maybe take away italian food\n\nWe will be so grateful! ☺️", "link": "facebook.com/groups/1373361046396315/permalink/2213598952372516/", "likes": 2, "comments": [{"username": "Edoardo Casolo", "comment_text": "Pizza portions?"}, {"username": "Kejdi Okej", "comment_text": "Pizza portions?"}, {"username": "Cindy Sguazzin", "comment_text": "Takeaway?"}, {"username": "Dawn Falsinotti", "comment_text": "Italians don’t do takeaway in general."}, {"username": "Emma Chadwick", "comment_text": "Gustapizza in Florence. We didn’t personally try it but it was recommended to us and our bedroom window looked out over it. They always had a queue for both sit in and take away and the queue would start before they even opened most days. It’s near Pitti Palace."}, {"username": "Stephanie Dean", "comment_text": "I like Farini in Venice for Pizza."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Mercato in Florence. https://\nwww.mercatocentr\nale.com/"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "There is pasta takeaway in Venice.\n\nhttps://\nwww.google.com/\nsearch?q=pasta+t\nakeaway+venice&\nie=UTF-8&oe=UTF\n-8&hl=en-us&cli\nent=safari"}, {"username": "Melanie Fuger-Dolan", "comment_text": "Florence; Yellow Bar restaurant was AMAZING. Pasta restaurant. Prices were also very good"}, {"username": "Katie Marie", "comment_text": "Just got back from Florence! I found a lot of take away spots.\n\nAll’anticio for take away sandwiches. Not sure if I spelled that right… 10 euros max\n\nWent to a local restaurant… I believe it was L’Antica Pizzeria Da Michele. Had a pizza for 8 or 10 euros and it was so good and filling because of the flour they use.\n\nAlso, Shake Cafe by the Uffizi museum was so good for take away or sit down. Something refreshing and healthy if you need it!\n\nAs far as take-away, it will be the same price if you sit inside usually. They charge a fee for sitting on the patio so if you are trying to avoid that fee that is all I would advise against! They are used to tourist wanting to go sit by the water etc."}, {"username": "Kelly Huntley Clark", "comment_text": "There's a place near Santa Croce in Florence that sells pizza slices out of a window...called\nFo Caccia la Notte. 🙂"}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "Pizza da Zorma in Venice was absolutely the best pizza ever! We were just there 2 weeks ago. It's a little take-out place in a more \"local\" area of Venice. Google the location; you won't be disappointed. We ordered Pizza Zorma! I could taste it now, it was so good. People just sit on the sidewalk next to the canal outside the place."}, {"username": "Cris Wimer", "comment_text": "Florence….\nhas a street with several take away sandwich shops. We split one for 6€.\nFor dinner…local, good and reasonable….Tra\nttatoria Roberto\nNeed a burger? Rooster Cafe. Should have split this as well. Could only eat half….so big!"}, {"username": "Tari Lawson", "comment_text": "Arte Della Pizza in Venice is a take out spot with amazing pizza."}, {"username": "Fetchin Gretchen", "comment_text": "Caveat: Check first that are still available as many places have changed hours or closed since covid. This is based on google and tripadvisor reviews mostly, since I have not been to these cities since before covid:\nHere are some good-value for money restaurants in Venice and Florence where you can eat pizza portions or take away Italian food:\n\nVenice:\n\nOsteria Al Covo: This restaurant serves traditional Venetian cuisine at affordable prices. They have a variety of pizza options, as well as other dishes like pasta and risotto.\n\nBar Bacareto: This bacaro (wine bar) is a great place to try cicchetti, which are small plates of Venetian food. They have a variety of pizza options, as well as other cicchetti like fried fish and meatballs.\n\nGambero Rosso: This restaurant is a bit more expensive, but it is worth it for the amazing food and atmosphere. They have a wood-fired oven that they use to make their pizzas, and the ingredients are all fresh and local.\n\nFlorence:\n\nAll'Antico Vinaio: This restaurant is famous for its schiacciata, which is a Tuscan flatbread. They also have a variety of pizza options, as well as other Tuscan dishes like ribollita and lampredotto.\n\nTrattoria Za Za: This restaurant is a bit more casual, but the food is still delicious. They have a variety of pizza options, as well as other classic Italian dishes like pasta and risotto.\n\nEnoteca Bruni: This wine bar is a great place to try some local wines. They also have a small menu of pizza and other dishes.\n\nI hope this helps!"}]}, {"id": "2213598059039272", "text": "HI. I have a question about Italia air. I am having trouble finding a carryon that fits their dimensions. Their dimensions are 21.7 x 13.8x 9.9. I have one that is 19x14x8 and one that is 22x13x10. Will either of these work? Have any of you had any experience with it. I have practiced packing and I’m under the weight limit. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2213598059039272/", "likes": 0, "comments": []}, {"id": "2213598635705881", "text": "Hi all! Just wanted to pass along our rental car/driving experience in Italy. We rented from Europcar online prior to our arrival from the US and picked up the car at Termini train station in Rome. Syncing our phone GPS to the car display, we found that navigating throughout the country was not difficult at all. We drove from Rome to central Italyआणखी and the east coast. We encountered toll booths along the way but always entered manned toll booths in case we had any issues. Prior to our departure we easily returned the car to the car rental center (onsite) at the airport in Rome and literally walked 5 minutes to the Hilton Airport Hotel to spend the night before our departure the next day. Based on our experience I would not hesitate to rent a car again in the future. Just be sure to request an automatic transmission of you’re not comfortable with a manual.", "link": "facebook.com/groups/1373361046396315/permalink/2213598635705881/", "likes": 40, "comments": [{"username": "Jerry Kiger", "comment_text": "Nice thank you for the info. I too want to rent. Early planning but Rome 1st then maybe rental to CT, Tuscany (not sure Florence) and head north into Verona & Venice regions … know lot use train systems but really want to drive and enjoy the open roads and pull over when see something exciting. Looks like overall doable … know parking may be issue at places, gas, tolls but thinking about doing the same … thanks for info"}, {"username": "Fatima Oliveira", "comment_text": "Thank you for this info 👍"}, {"username": "Angie Tripp", "comment_text": "Thanks for the info! We are renting a car in Florence to travel around Tuscany."}, {"username": "Jennifer Burrell", "comment_text": "Bryan Burrell"}, {"username": "Gwenn Frank Selzer", "comment_text": "We’re dropping car off at Rome Termini station. Will we be encountering any ZTLs on the way there? Do you think it will be easy to drop off there?"}, {"username": "Teresa Kallish", "comment_text": "Thank you so much for this info! Did you rent directly from Europcar or go through a third-party site? We are picking up in Rome, but returning in Naples so it seems we have less options and probably an extra charge."}, {"username": "Heidi BL", "comment_text": "Ana F Bond"}, {"username": "Patty Maffei", "comment_text": "What about parking in some of the larger cities ?"}, {"username": "Mary Carbone Hogan", "comment_text": "Was it much more to rent the gps with the car? Was it like using Apple Play?"}, {"username": "Ryan Monahan", "comment_text": "Had a similar experience to yours. Rented from Hertz at Rome Termini, returned it 14 days later in Verona then hopped the train to Venice. Had Zero problems. Loved having a car!!!"}, {"username": "Sam Gamlin", "comment_text": "Sharie Dee"}, {"username": "Sandy Tadken Shaffer", "comment_text": "Just rented a car for 7 weeks…. Hated the hybrid as no charging in the south … really wanted a diesel"}]}, {"id": "2213599052372506", "text": "Which apps are a must ! Taxi, Ubers just help getting round? Thanks all", "link": "facebook.com/groups/1373361046396315/permalink/2213599052372506/", "likes": 5, "comments": [{"username": "Gary Fossaceca", "comment_text": "Rome2rio"}, {"username": "Jerry Lyubelsky", "comment_text": "U can use the Uber app for a taxi if it’s busy though it won’t find one or they just don’t show up"}, {"username": "Elisa Martini Stepancic", "comment_text": "Uber,bolt , world 🌎 time ,currency conversion"}, {"username": "Sara Voorhees", "comment_text": "Free now. Rome2rio. Flush. City mapper. Xe currency converter."}, {"username": "Mary LoFrumento", "comment_text": "U we worked well in Rome the few times we needed it"}, {"username": "Greg Baker", "comment_text": "AppTaxi for Florence. Uber and others are non existent there. We were able to use that in Rome as well"}, {"username": "Venette Macalinao", "comment_text": "FREENOW in Rome"}, {"username": "Kejdi Okej", "comment_text": "U we worked well in rome the few times we needed it"}, {"username": "Sara Beth", "comment_text": "I didn’t need any. Used the taxi stands and taxis were always plentiful."}, {"username": "Phyllis Waring", "comment_text": "iTranslate!!"}]}, {"id": "2213599912372420", "text": "Hi we are looking to go to Italy end of May 2024 from Florida. Venice would be the closest airport as we are going to Verona , lake garda and Dolomites. However willing to go to any airport if ticket is better. The prices I am getting are doubled for reg economy for what I paid last May for comfort plus on Delta. Anyone finding good fares from US for next May/June and what airline? I am just hoping that after this summer the prices will drop a bit. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2213599912372420/", "likes": 2, "comments": [{"username": "Rachel Gray", "comment_text": "Look at Google Flights. It compares majority of the airlines"}, {"username": "Kejdi Okej", "comment_text": "Look at google flights. It compares majority of the arlines"}, {"username": "Donna Parrish", "comment_text": "Milan is close to that area as well. Try using apps like Hopper and Skyscanner to find flights. You can plug in the actual dates if your trip to get exact pricing."}, {"username": "Kari Cooper", "comment_text": "Don't forget to get the visa ahead of time also. Those are starting in 2024!"}, {"username": "Ike Simoncini", "comment_text": "I think prices are only getting higher and you should book now"}, {"username": "Virginia Lane", "comment_text": "Milan"}, {"username": "Colleen Dawson", "comment_text": "We fly to Milan often and take the train or rent a car to go to Trento."}, {"username": "Jenny Frank", "comment_text": "Maybe reposition thru Atlanda; Philly or NY ...Newark has lowest taxes so often tix much better ."}, {"username": "Bonnie Rodgers Henderson", "comment_text": "Checkout Milan"}]}, {"id": "2213601459038932", "text": "Hi everyone! I'm pretty new here, but already overwhelmed with information. Thank you guys for sharing pictures and tips!\n\nI will be a first time traveler in Europe and solo at that. (Darn you, Eat Pray Love 😅). I'm pretty settled on taking the Globus Italian Vista tour which goes from Rome to Milan with stops in Assisi, Florence, Venice and Lake Como. I'm just wondering if anyone has taken this tour? If so, did you feel rushed at the excursions? Was there time for shopping? Anything you hated or loved? How were the hotels?\n\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2213601459038932/", "likes": 3, "comments": [{"username": "Ana Ka", "comment_text": "I would do the trip by myself otherwise you will have to be always on someone else’s schedule. Otherwise the itinerary looks good… booking trains and museum tickets is so easy these days! 😉"}, {"username": "Elaine M Woodward", "comment_text": "As a first time traveler to Europe I would do the same"}, {"username": "Kejdi Okej", "comment_text": "As a first time traveler to europa l would do the same"}, {"username": "Angela Marsala-Gaydos", "comment_text": "I booked a tour of Italy that gives you free time after morning tours, small group and includes only breakfast. I prefer to eat at restaurants of my choice. Take a look at Firebird Tours."}]}, {"id": "2213602389038839", "text": "We (2 of us) will be in Rome 2 days. Do we need dinner reservations or can we walk in when we’re ready to enjoy dinner?", "link": "facebook.com/groups/1373361046396315/permalink/2213602389038839/", "likes": 4, "comments": [{"username": "Pam Kimak", "comment_text": "I was there with my family in late June for three nights and never made a dinner reservation.We got dressed for dinner,and walked a few blocks from our hotel, and checked out menus and at different places. We were greeted and seated with wonderful service and amazing meals."}]}, {"id": "2213188069080271", "text": "I'm looking at doing this in one day:\n3 hour tour:\nColosseum, Roman Forum, Arch of Titus, Palatine Hill\n\nGeneral walk by:\nBasilica of San Pietro,\nPiazza Venezia,\nTrevi fountain,\nPantheon\n\nAnother tour:\nJewish Ghetto.\n\nIs this feasible?\nHow long would it take me?", "link": "facebook.com/groups/1373361046396315/permalink/2213188069080271/", "likes": 2, "comments": [{"username": "Deborah Schroeder", "comment_text": "You can do the Colosseum in the morning then walk just a wee bit east and north to San Pietro-need to go inside-maybe 30 minutes-watch open times. Piazza Venezia, you walk through it on the way to the Trevi Fountain, give yourself an hour just for sightseeing. Pantheon west from there maybe 10 minutes. Keep walking west from the Pantheon and you have the Jewish Ghetto, another 10 minutes. If you visit the Pantheon, have a ticket ready to go. I don't know if you need a tour of the Jewish Ghetto unless you have a specific desire for that. Just have a good map and study so you feel comfortable with all the walking. I recommend Google Earth just to see where everything is in relation to each other."}]}, {"id": "2213232369075841", "text": "Has anyone flown Air France? If so are the carry on dimensions and personal bag exactly like their website states or is 1/2 inch larger a problem?\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2213232369075841/", "likes": 0, "comments": []}, {"id": "2213223562410055", "text": "Posting anonymous because I want to be a surprise. Can you recommend a photographer for a QUICK photo shoot in Venice for a special occasion. Not looking a long day", "link": "facebook.com/groups/1373361046396315/permalink/2213223562410055/", "likes": 2, "comments": [{"username": "Karen Landini", "comment_text": "What town?"}, {"username": "Gina Rovello Keenan", "comment_text": "Check with your hotel"}, {"username": "Juliana Acorn", "comment_text": "Check instagram too"}, {"username": "Tara Wilson", "comment_text": "If you search in the group for photographer…yo\nu can find posts from people that have hired photographers. 😊"}, {"username": "El Bee Gee", "comment_text": "I recommend flytographer"}, {"username": "Toni Colwell", "comment_text": "We used Enzo from Airbnb experiences and we were very happy with his work — reasonable price too!\n\nhttps://\nabnb.me/\nrHHSLDcIgCb"}, {"username": "Natalie Gauci", "comment_text": "Following"}]}, {"id": "2211996232532788", "text": "I have now been home a week from my 3 month stay in Italy 🇮🇹\nHere are some stats from my trip!\n*Days away: 88\n*Flights: 7\n*Trains: 14\n*Buses: 1\n*Trams: 10\n*Towns visited: 27\nRome, Florence, Fiesole, Siena,आणखी Lucca, Cortona, Montepulciano, Salerno, Amalfi, Sorrento, Pompeii, Bari, Matera, Alberobello, Monopoli, Polignano a Mare, Lecce, Otranto, Torre dell’Orso, Gallipoli & Brindisi.\n*Tours: 4\n*Steps done : 984,870\n*Kms walked: 770.57\n*Best part of my trip: staying a month in Florence with a family to experience the Italian life…absolutely amazing, something that will stay with me forever!!!\n*Worst part of my trip: the weeks jet lag I had when I returned home\n*People met & now friends for life: too many to count\n*Memories made: immeasurable", "link": "facebook.com/groups/1373361046396315/permalink/2211996232532788/", "likes": 1490, "comments": [{"username": "Cindy Clayton", "comment_text": "What a beautiful experience!"}, {"username": "Kisha FreetoBme Williams", "comment_text": "Love this! I’m here now for 3 weeks in Southern Italy."}, {"username": "Berta Memetovic", "comment_text": "Wow! That's awesome"}, {"username": "Lisa D'Amico Schiavone", "comment_text": "Love this! I'm going next month cannot wait ! Glad you had a great time !"}, {"username": "Cla Liv", "comment_text": "Next time the North 😉"}, {"username": "Patty Hartman", "comment_text": "Wow! Good for you!"}, {"username": "Natalie Youngblood", "comment_text": "Wow such an amazing experience !!!"}, {"username": "Linda Hussey Shantz", "comment_text": "That's awesome! Congratulations\n!\nSo fortunate to be able to do this!\n…. And there’s still so much more to see\n…. Italy!!!👏👏"}, {"username": "Maria Figuerola", "comment_text": "Maria Figuerola"}, {"username": "Sar Ah", "comment_text": "Did you do this by yourself ? How did you find family etc"}, {"username": "Kathy Huart", "comment_text": "Kathy Huart"}, {"username": "Lenore Knock", "comment_text": "Is Lucca a town that has enough life for a month’s stay?"}, {"username": "Connie M. Palazzo Bimonte", "comment_text": "Wow! You are one lucky gal!"}, {"username": "Robyn Smart", "comment_text": "Well done you I hope to have those stats when I return, mighty effort I say"}, {"username": "Theodora Barbari", "comment_text": "Είσαι πολύ τυχερή κοπέλα"}, {"username": "Bernadette Crisafulli Bradfield", "comment_text": "What an experience!!! A once in a lifetime opportunity!!! ❤️🇮🇹"}, {"username": "Abigail Munson", "comment_text": "Abigail Munson"}, {"username": "Adriana Facchinelli", "comment_text": "Don’t stop , visit also north Italy !"}, {"username": "Rumiana Doncheva", "comment_text": "I visited Italy in April and I'm still sick of it.."}, {"username": "Janis Burke", "comment_text": "A grand trip"}, {"username": "Irene Pappas Renzulli", "comment_text": "How Awesome! I’m cruising in the Mediterranean & will stop at Florence & Rome, etc…. LOVE ITALY!!!"}, {"username": "Doreen Mazza", "comment_text": "I can’t wait 2 go back again, for my 4th time 👍👏🇮🇹Even if u go back 2 the same place’s, your experiences will be totally different…such a beautiful country!!! The jet lag is so 💯 worth it!!!"}, {"username": "Karen Allin", "comment_text": "I often go to europe for a month find jet lag not too bad but i work shift work so maybe used to sleep disruptions\nFriends say melatonin helps for a short time"}, {"username": "Tina Kaminow", "comment_text": "What a wonderful experience. Was this a solo trip?\nCurious since for the last 18 trips(since my husband died ) most of my annual trips to Europe were solo and fabulous\nMy longest was 2 months spent in France and Italy\nSolo and fabulous\nI spent time in each stop , no overnight or 2 day\nStays\nI felt I got to know a bit about each city and town\nDiscovering hidden side streets, wonderful truly local restaurants, taking buses and trains everywhere\nI have so many fabulous memories that I treasure I meant for the last 18 years not trips since some years I was fortunate to make 2 trips"}, {"username": "Jennifer Loehwing Mele", "comment_text": "Goals 🙌🙌🙌😎😎😎"}, {"username": "Dianne Giordano", "comment_text": "Love Italy."}, {"username": "Lucy Thornton", "comment_text": "Love it❤️"}, {"username": "Carol Kopec", "comment_text": "What a wonderful Italian vacation you were able to have! ❤️"}, {"username": "Jan Studin", "comment_text": "I love this."}, {"username": "Jan Studin", "comment_text": "I was in Italy last year for 9 weeks. I had such a hard time with re-entry. I too have friends for life. Going back next year G-d willing. I always want to add a new area of Italy. My favorite country."}, {"username": "Djamel Chikh", "comment_text": "Bonjour tout le monde et BRAVO princesse 🙄🤗"}, {"username": "Dawn Pribis", "comment_text": "Amazing! We leave for Italy next Sunday from Montana. Any last minute advice for 3 rookies?"}, {"username": "Irene Karen", "comment_text": "Living the life………good for you!"}, {"username": "Marissa La Paglia", "comment_text": "What does a person have to do right in life to be able to travel to Italy for 3 months?????? 😭"}, {"username": "Nina Rovinelli Heller", "comment_text": "My husband and I leave from US in a few weeks for 3 months in the Marches. Beautiful area, very uncrowded. Can’t wait! All our family will then join us there for Thanksgiving."}, {"username": "Md Razib Hossain", "comment_text": "That's awesome! Congratulations\n!"}, {"username": "Debi Lubiani DeLoney", "comment_text": "That’s my dream!!!"}, {"username": "Richard Leonardo", "comment_text": "Lucky you"}, {"username": "Mirsada Miki Mikica", "comment_text": "I would definetly love to stay for a month in Florence♥️"}, {"username": "Elizabeth Arteaga", "comment_text": "Elizabeth Arteaga"}, {"username": "Sania Junejo", "comment_text": "Sania Junejo"}, {"username": "Louis Passariello", "comment_text": "Wow what a trip, sound you have a trip of a life time!"}, {"username": "Berdie Brady", "comment_text": "I remember your posts from Gallipoli in the middle of the heatwave! You were brave and adventurous👍🏾\n\nNow it’s ferragosto weekend and the weather is spectacular and this California girl is off to her beach cottage!\n\nSo glad you enjoyed Puglia🌞"}, {"username": "Teresa Rivero", "comment_text": "Congratulations\n! What an amazing experience! You will treasure it for the rest of your life.\n👏🥰❤️ 🇮🇹"}, {"username": "Veena Singh", "comment_text": "Awesome! Congratulations\nHow did you find the family in Florence to stay with? Would love to do it"}, {"username": "Laila Bøndergaard", "comment_text": "Lyder som en super oplevelse.\nJeg kan anbefale at bruge workaway.info. Vi har haft mennesker boende fra hele verdenen i Danmark ( også italienere). Du kan sagtens finde “host” i Italien 🇮🇹 Fantastisk måde at lære andres lande kultur på 👏🏼"}, {"username": "Adriana Sormani", "comment_text": "Fabulous experience, I tell every young person to do this!!\nI spent a semester in France and then stayed with my relatives all over Italy!"}, {"username": "Lien Tran Griffin", "comment_text": "Wow! That's awesome!"}, {"username": "Irene McManus", "comment_text": "Sounds wonderful, how do you find a family to stay with, are there companies that can help with this? thank you so much in advance."}, {"username": "Linda Cullere", "comment_text": "Wow you are blessed to be able to visit."}, {"username": "Silvana Tahiraj", "comment_text": "How much for your trip in total? Thinking of doing sth of the same nature, currently for a month inn Germany staying with fam"}, {"username": "Linda Whitman", "comment_text": "Wow what a trip!"}, {"username": "Liz Parkhouse", "comment_text": "We spent an idyllic month in Florence 4 years ago. A truly amazing experience! 🇮🇹"}, {"username": "Tina Helm", "comment_text": "What a treat of lasting memories 🇮🇹"}, {"username": "Hazel Jeanette Kenny", "comment_text": "This sounds epic! 🙌🏼"}, {"username": "Debra Donnelly Burek", "comment_text": "How did you find a family to stay with? Was it relatives? I did a month in Europe since I can work from anywhere as well"}, {"username": "Margaret Townsley", "comment_text": "Sounds like an amazing adventure trip cat would love to see your pictures of these beautiful places one life here on earth live it well and you have well done 😊"}, {"username": "Maria Mandaliti", "comment_text": "Dream come true!"}, {"username": "Kate Bryant", "comment_text": "Wow! That's awesome! I did that once too a long time ago, and it’s the best thing Iv ever done. Good on you. 🙏💕"}, {"username": "Ann May Pirri", "comment_text": "Love love Florence! Sounds like you had great experiences. Way to travel"}, {"username": "Robbie Anderson", "comment_text": "Where did you go? What were the best travel connections? Any advice to do or not?"}, {"username": "Vika VS", "comment_text": "Sounds like a great time !👍🏼I like the statistics data made as well ☺️!"}, {"username": "Elizabeth Hartzell", "comment_text": "Congratulations\n! Sounds amazing! But weeks of jet lag? That does not sound fun! Any tips on how to avoid it? My daughter is doing 2 weeks in Tokyo then home to the US less than 24 hours before we head to Italy for 3 weeks. She starts back to college 5 days after we get home and her program is very competitive 😳"}, {"username": "MaryLynn Capobianco", "comment_text": "What an amazing trip! I’m guessing you’ll be back!"}, {"username": "Rubin Urban", "comment_text": "Cat Furness sounds amazing. Could you share basic information on your lodging and especially in Florence."}, {"username": "Smush Pappas", "comment_text": "Congratulations\n🎉❤️"}, {"username": "Maria Guzman", "comment_text": "How much is it for all trip?"}, {"username": "Silvia Sa", "comment_text": "Did you know the family or is it like an exchange experience?"}, {"username": "John Watson", "comment_text": "Congratulations\n! That's awesome!"}, {"username": "John Watson", "comment_text": "I did that back in 1976."}, {"username": "Susan Sassoon", "comment_text": "Sounds wonderful. Good\nFor you !!!!"}, {"username": "Bonnie Cope", "comment_text": "Sounds Amazing ❤️ you must be in mourning now that you’re home ! I was and I was only there for 2 weeks ! ❤️Love Italy❤️"}, {"username": "Pam Wilson", "comment_text": "Fantastic"}, {"username": "Ann Gaffey", "comment_text": "Unforgettable memories ❤️🇮🇹"}, {"username": "Nicola Algerino", "comment_text": "Dovremmo tutti fare esperienze di questo tipo, viaggiare e conoscere nuovi posti , usanze e culture diverse"}, {"username": "Dawn Falsinotti", "comment_text": "On my bucket must to spend a month in Florence. Wonderful for you."}, {"username": "Jacki Aragon Riley", "comment_text": "I’m staying 2 months. Will be working too. I have a few specific questions. May I pm you?"}, {"username": "Michelle McNeil", "comment_text": "Sounds amazing. I need a travel buddy"}, {"username": "Patty Barnes", "comment_text": "Wow! That's awesome!"}, {"username": "Khadija El Bouhati", "comment_text": "❤️❤️"}, {"username": "Luanne Carey", "comment_text": "My husband and I are planning to do the three months in 2025 as well!"}, {"username": "Jo Ann Ciuffini Forcino", "comment_text": "That's awesome! How did you go about making arrangements for a month in Florence with a family?"}, {"username": "Melissa Smith", "comment_text": "Yep! Not looking forward to the jet lag for sure"}, {"username": "Leanne Bingle", "comment_text": "Leanne Bingle"}, {"username": "Linda Shanks", "comment_text": "Wow! That's awesome!"}, {"username": "Sandra DiOrio", "comment_text": "Loved Italy !!!Florence and Tuscany , Rome , amalfi coast ! Just beautiful !\nTrip on my bucket list ! 😂"}, {"username": "James L. Comfort", "comment_text": "Be sure you visit Florence to see the statue of David. It is also awesome"}, {"username": "Norita Schottler", "comment_text": "Lucky you: My favorite country to visit"}, {"username": "Cathy Kerr", "comment_text": "Would you mind if I messaged you to ask about your Florence home stay?"}, {"username": "Anna Tantaro", "comment_text": "Can I please DM you?I was a host family, would love to ask some questions. Returned from Puglia in June to cold Australia 🇦🇺"}, {"username": "Toni Marie", "comment_text": "Sounds amazing"}, {"username": "Helen Lettieri-Haaland", "comment_text": "Just back from my first trip to my father home town in Celico, Italy and tours, trains and ferries from Rome down to Calabria!!!❤️🇮🇹💚\nI’m so in love with Italy and can’t wait to return!\nDon’t count the miles, count the unforgettable moments!❤️\nThat was on my fortune cookie when I returned and could not be truer!"}, {"username": "Kerri Armitage", "comment_text": "If I was young again I'd do this in a heartbeat"}, {"username": "Rosa Zordan", "comment_text": "When are you going again!!! Sounds like you're are now an addict!!! Heehee"}, {"username": "Mazzeo Diane", "comment_text": "Sounds so phenomenal"}, {"username": "Darlene Graham", "comment_text": "How wonderful!"}, {"username": "Trish McIntyre Butters", "comment_text": "What type of work accommodates a 3 months holiday? I read many posts about how long people spend away and I wonder if anyone works anymore 🤣"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 8, "comments": []}, {"id": "2213259862406425", "text": "PSA when getting off on train at your stop be ready 5 minutes before and press button to open door - if you have kids have them beside you and hustle - we didn’t press the button and missed the stop. The doors do not automatically open! The train captain was unhelpful and really rude. Refused to help and was a bully. I speak fluent Italian so was not lang barrier .", "link": "facebook.com/groups/1373361046396315/permalink/2213259862406425/", "likes": 37, "comments": [{"username": "Alessandro Iannelli", "comment_text": "If it can be of any consolation, it has happened to me twice, despite being Italian and using trains all of my life. You can't get distracted or you lose your stop. Sorry for the rude train captain, that shouldn't happen."}, {"username": "Rachael Richardson", "comment_text": "It can be easily corrected, the more you get stressed the worse you feel , just get off next stop , take a breath and go back to the stop you need !"}, {"username": "Krissy DaRusso", "comment_text": "It’s funny you say that because when you press the button, there isn’t much “press” to it so I always wondered if it opened automatically or if it’s bc I pressed it."}, {"username": "Shirley Lewis", "comment_text": "we missed a stop once because the door wouldn't open despite every effort of numerous people! we had to go to the next stop and then go back, luckily there are a lot of stops on local trains!"}, {"username": "Jona Guðmundsdottir", "comment_text": "This happened to me once in uk... the train doors (i orginally wrote tram but then remembered that it was a train...) didnt open on it own... and as we didnt know how to open them we missed the stop and had to go one stop further."}, {"username": "Brenda Keeter", "comment_text": "Good tip!"}, {"username": "Lisa Adams Robertson", "comment_text": "Oh wow, thanks. I never noticed that."}, {"username": "Frances McDonagh", "comment_text": "In Ireland and UK tram and trains you press the door open only exception is buses are automatic"}, {"username": "Kathi Urie", "comment_text": "Yep we waited and to jump off while it took off🤪"}, {"username": "Michelle Plutto", "comment_text": "This isn’t like the trains going from Naples to Rome and Rome to Florence right? This is the local local trains? Sorry probably a dumb question but would rather know ahead of time 🤣"}, {"username": "Paula Bennett", "comment_text": "The more I hear about the rudeness and pick pockets the more I wonder if I should have chosen the British isles!"}, {"username": "Mike Adams", "comment_text": "Happened to me too"}, {"username": "Tracey Fairbrother", "comment_text": "You missed your stop he was just doing his job"}, {"username": "Jacqui Hodge", "comment_text": "Are these the fast trains ? Or the regional ones?"}, {"username": "Denise Chapman Toth", "comment_text": "Oh, so you have to press a button to get the train to stop- it doesn’t just automatically stop at each station?\n\nWell that’s good to know before you go! 🙂"}, {"username": "Olga Plitt", "comment_text": "It happened to me in Edinburgh Scotland taking train from airport. Got off and went back only to find out we needed to go further and press the button to get off.Lol we laughed out heads off. We can read English. Have fun,its vacation."}, {"username": "Maria Vega", "comment_text": "This might be a stupid question but how do you know what the next stop is. Do they announce it or is it visible in the train car."}, {"username": "Cheryl Swiatko", "comment_text": "We learned that lesson the hard way, too."}, {"username": "Denise Bibby", "comment_text": "Teena Leuba"}, {"username": "Martin-John Rubio", "comment_text": "Common sense for this that travel the trains 😆"}]}, {"id": "2213260209073057", "text": "Hi, Im going to visit Milan in November and I want to take the Bernina express from Tirano but I heard that it’s impossible to visit St Moritz in those dates, do you know what else can I do in this train? Thanks 😊", "link": "facebook.com/groups/1373361046396315/permalink/2213260209073057/", "likes": 2, "comments": [{"username": "Andrea Bainbridge", "comment_text": "We took the Berninia express to Chur and we’re pleasantly surprised with this town."}, {"username": "Silvia Roth", "comment_text": "Of course you can visit St Moritz all year round (I live there) but not all cable cars are open"}, {"username": "Sam Mah", "comment_text": "We stayed in St Moritz for a couple of nights and tbh there is not a lot there to see. (We were there in May and half the shops were closed as the owners were on holidays) I guess if you're a rich skier it's the \"place\" to be in winter. I agree Chur is cuter and there are heaps of other nice places to stay in that area."}]}, {"id": "2213187832413628", "text": "Where do you go to get the best price tickets for the early breakfast at the Vatican along with the tours?", "link": "facebook.com/groups/1373361046396315/permalink/2213187832413628/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nSistine-Chapel-b\nefore-the-Crowd\ns-Complete-Vati\ncan-Tour-with-B\nreakfast-prior-\nto-Entrance/\nd511-7559P9?pid=\nP00070587&mcid=\n42383&medium=li\nnk&medium_versi\non=selector"}, {"username": "Jenn Messina Babore", "comment_text": "Directly on the Vatican’s website."}]}, {"id": "2213222112410200", "text": "We are in Venice for 2 days to end our amazing holiday in Italy but one thing I was never able to get was a really good tiramisu that was more than just a cup of whipped cream and cocoa powder on top , we've been unlucky with restaurants I think lol. Can Anyone recommend somewhere really good to get tiramisu in Venice please?", "link": "facebook.com/groups/1373361046396315/permalink/2213222112410200/", "likes": 0, "comments": []}, {"id": "2213222232410188", "text": "Hi 🤗 looking for some suggestions. Staying in Rome for 4 nights then down by Sorrento for 6 nights. We have 2 more nights in our trip. What would you recommend that’s an easy stay in between Sorrento and Rome? Excited to see what you guys recommend. I’m not too familiar with all the little gems in between these big cities. Thank you!☺️", "link": "facebook.com/groups/1373361046396315/permalink/2213222232410188/", "likes": 1, "comments": [{"username": "Chiara Normanno", "comment_text": "How came so many nights for a small town like Sorrento and so little time for the capital city, if I may ask? I think one day to visit it is enough, use the rest to explore the whole area and the islands"}, {"username": "Kally Trahearn", "comment_text": "I would suggest that when you're done in Rome, you go directly to Sorrento. From there, if you were to take a day each to do Pompeii & Herculaneum, Capri, Positano/\nAmalfi, you'd could also pop over to Ischia if you wanted and still have time to relax and enjoy Sorrento.\n\nYou could also add another night to Rome and go to Florence for the day too."}, {"username": "Theresa Salerno Adams", "comment_text": "You could stay in Naples go to Pompeii then take ferry to Sorrento the next day"}, {"username": "Rosa Zordan", "comment_text": "You need a book like this."}]}, {"id": "2213222669076811", "text": "Hi we are travelling to Italy early October for a conference( Verona) and spending a few days in the Northern areas. Any suggestions of what to see and where to go?", "link": "facebook.com/groups/1373361046396315/permalink/2213222669076811/", "likes": 0, "comments": [{"username": "Chiara Normanno", "comment_text": "Venice, Lake Garda, Bologna"}, {"username": "Kejdi Okej", "comment_text": "Venice , lake garda Bologna"}, {"username": "Erica Senes Tombesi", "comment_text": "Venezia, lake of Garda, Padova, Trieste"}]}, {"id": "2213122262420185", "text": "Hello. Have any ladies visited a hair salon in Venice\nI would like a recommendation for\na blow dry bar for a\nspecial occasion?", "link": "facebook.com/groups/1373361046396315/permalink/2213122262420185/", "likes": 2, "comments": [{"username": "Jill Wolder", "comment_text": "Ask your concierge at hotel"}]}, {"id": "2212999799099098", "text": "EDIT 2: I talked to the airline and was told that the short layover time was within their parameters as it’s 6 minutes more than the minimum. So, we’re just going to have to have a zen frame of mind while they try to fix the problem after we haven’t made the connection. The option, if we choose to change our flight, is to pay any costs associatedआणखी with doing so. Then we would be responsible. 🙄\n\nQuick question: On our return from Italy in late Oct to the US, there is a stop and plane change In Atlanta of ONLY 30 minutes. I’m thinking this is going to a problem. Thoughts? Suggestions? I called the airline (Delta) but was faced with over an hour of waiting.\n\nEDIT: This is the second stop after returning to the US. First stop in D.C. And the timing was changed by the airline.", "link": "facebook.com/groups/1373361046396315/permalink/2212999799099098/", "likes": 3, "comments": [{"username": "Mitzi Monday", "comment_text": "You'll never make it...sorry!"}, {"username": "Elise Garner", "comment_text": "Need more time for sure!"}, {"username": "Terry Massaro", "comment_text": "Cant be done"}, {"username": "Lani Skyles", "comment_text": "Not enough time!"}, {"username": "Terry Hamlet", "comment_text": "Message them through the Delta App"}, {"username": "Don Bentivoglio", "comment_text": "Definitely not long enough in Atlanta. Surprised that your TA or even the airline would allow such a short time."}, {"username": "Holly Clifton", "comment_text": "That’s super right. Most airlines are not on time these days so it’s risky."}, {"username": "Ashley Binkley Fiorelli", "comment_text": "Atlanta is a large airport and you will not be able to get between terminals with any breathing room at all in 30 mins."}, {"username": "Caron Quinn Mills", "comment_text": "That’s not enough."}, {"username": "Terry Pisano", "comment_text": "She said it's her 2nd stop in US, so should not deal with customs in Atlanta. That's still tight. I look at FlightRadar24 app to see what terminal and gate the incoming flight has been landing and the outgoing flight is leaving from. That is not a guarantee of what it will be on the day you are flying but it's usually pretty consistent."}, {"username": "Jennifer Brothers", "comment_text": "Unless your next flight is the same terminal you won’t make it. I’ve literally sprinted through Atlanta and still missed a connection."}, {"username": "Diane Davis Lawyer", "comment_text": "Unless your departing flight is on the same terminal and side by side gates, you will likely not make that connection. Deplaning could take 15 to 20 minutes of that time. If you are a FF Skymiles Member with Delta, you should be able to call a different phone number and speak to a CS rep for frequent fliers: 800-323-2323 for CS."}, {"username": "Marilyn Vadeboncoeur Picariello", "comment_text": "y so many stops?!"}, {"username": "Lisa Abrams Argento", "comment_text": "Only if you didn’t have to change planes. That is a set up for disaster. No way."}, {"username": "Michelle Pedersen Kemmerer", "comment_text": "If it’s your 2nd stop in the US, it’s like any other layover you would have. 30 minutes in ATL is tight. I would definitely see what other options you have."}, {"username": "Debbi Mayfield", "comment_text": "As someone flying to Italy and home to Atlanta there is zero way this will be enough time. It IS Delta’s hub but you’ll be flying into the Domestic part of the terminal which is basically chaos on a good day."}, {"username": "Allan Olexa", "comment_text": "Oh, passport check in DC? If your ATL connection is in the same terminal, you may make it. Might you be able to select the call back option with Delta?"}, {"username": "Ethan J. Felsing", "comment_text": "Tweet at them. That's how I get through to United"}, {"username": "Laura Uribe", "comment_text": "DC is where you will go through customs and immigration so that’s not an issue but they usually quit letting people board at 20 minutes before flight so just getting on the plane will be a challenge."}, {"username": "Barbara Bastianini", "comment_text": "Yes. I think that’s a problem."}, {"username": "Katie Ries Samson", "comment_text": "We just went through Atlanta to go to France with 1.5 hour layover and barely made it due to a slight delay on takeoff and then Atlanta is a huge airport!!"}, {"username": "Sandra Shoffner", "comment_text": "Will never make it, I always hope for 2.5 or 3 hours in Atlanta. If I can help.it I try not to go through there."}, {"username": "Laurie Francis Menk", "comment_text": "How much time in DC?"}, {"username": "Michelle Broome", "comment_text": "Geez! Thirty minutes barely is long enough for a bathroom break!"}, {"username": "Rosemary Giuffre", "comment_text": "Unless u have global entry and you are a track star 1/2 hour isn’t going to cut it!"}, {"username": "Suzanne Carver Musashe", "comment_text": "Nope. You won’t make it even better by close call. You will have to go through customs"}, {"username": "Kari Kunkel Anderson", "comment_text": "I’m a flight attendant\nIf it was your first stop no chance.\n\nSince it is your second stop after already clearing in DC\nThe airline has a minimum in each airport for scheduling connections.\n\nIf it is the same airline your likely in the same terminal in ATL and shouldn’t have a problem you just can dilly dally or wait in line at Chick-fil-A 😂\n\nI personally would stick with what the airline schedules you and if there is a problem with the connection it is on them"}, {"username": "Jan Buess", "comment_text": "Do you have at least 2 hours in DC? That's where u will have to go thru customs. If you are flying Delta, u might be ok as it is just a stop over, no customs"}, {"username": "Kris Beacham", "comment_text": "That’s waaaaay too tight. The only way you might make it is less than 30 minutes is if you had Global Entry.\n\nBut you’ll probably have to do the luggage deal and recheck it.\n\nDelta has a service where you can leave your number and they will call you back when they free up."}, {"username": "Maxine Cunnyngham", "comment_text": "That’s what I’ve been told by airlines too. Twenty-five minutes is enough. Laughable."}, {"username": "Kim Dixon", "comment_text": "If that’s your first stop in the US, you will have to go through immigration and customs. Yes, that’s way too short. You’d barely make it if it was just a domestic connection"}, {"username": "Ashley Henley", "comment_text": "As someone from Atlanta, that is not enough time unless you depart from same terminal and then, no guarantees. I would try to rebook for later connecting flight."}, {"username": "Jaime Cleek", "comment_text": "That’s very very very tight"}, {"username": "Shannon Thomas", "comment_text": "Def not enough time in atl."}, {"username": "Leila Jane", "comment_text": "The Atlanta airport is huge and congested with people. You won't have nearly enough time for a plane change - it takes almost that amount of time to get off the plane if you're seated in the back."}, {"username": "Stangle Shepard", "comment_text": "Call early in the morning, around 5 or 6. Definitely less wait time"}, {"username": "Chuck Morton", "comment_text": "Not a chance! You have to do customs and immigration. Even with global entry you don't stand a chance."}, {"username": "Kimberly MacKinnon Cherry", "comment_text": "Definitely not long enough to go thru customs"}, {"username": "Renae Larcus", "comment_text": "Nope. I wouldn't do it."}, {"username": "Paula Rosati", "comment_text": "Not enough time and it will stress you out after your relaxation in Italy."}]}, {"id": "2213229939076084", "text": "We’re going to Italy next April. Currently I have reservations at the beginning of our trip in Venice and Modena, and at the end of our trip in Rome. How critical is it that I book nights in Florence or other stops in Tuscany? Or will we do okay playing it by ear? I love to not have to stick entirely to a plan, but I also don’t want to stress out about finding last minute accommodations. TIA ❤️", "link": "facebook.com/groups/1373361046396315/permalink/2213229939076084/", "likes": 1, "comments": [{"username": "Debbie Milne Jenkins", "comment_text": "You might try booking accommodations that have reasonable terms for cancellation to give you more flexibility with your plans. I find accommodations that are nice, reasonably placed and in great locations get booked in advance."}, {"username": "Colleen Jennings", "comment_text": "Agree with the post above - book them now. You’ll probably get a more favourable rate too."}, {"username": "Kejdi Okej", "comment_text": "Agree with the Post above\nBook them now . You ll probably get a more favourable rate too."}, {"username": "Chrystal Stevens Bisonet", "comment_text": "I would definitely book now. April starts to be busy and, depending on when you’re going, the beginning of April will be very busy with it being Easter."}, {"username": "Ana Ka", "comment_text": "Book now to get better rates! Just book with a cancellation option if you change your mind. And dont skip Florence! Don’t know anyone who didn’t fall in love with this town."}, {"username": "Valerie Collanton", "comment_text": "You need to book. I would not play it by ear. Especially for Florence. It shouldn’t be crazy crowded but it will be busy."}, {"username": "Jerry Kiger", "comment_text": "Think flights and hotels or ABB people agree are must haves to at least get to Italy and sleep somewhere. I want that flex too of deciding on the fly but seems hotels might be risky but does depend how many traveling, if picky where to stay, etc .."}]}, {"id": "2213232782409133", "text": "San Marino 🇸🇲 is the fifth-smallest country in the world and the world's oldest republic. It is also one of the richest countries in the world 🌎#sanmarino #rimini #italy #richest #oldest #smallest #unestco @followers ❤️🇮🇹💖🌎", "link": "facebook.com/groups/1373361046396315/permalink/2213232782409133/", "likes": 2, "comments": [{"username": "Bill Elias", "comment_text": "They'd be unprepared if someone invaded them. ;)"}]}, {"id": "2213235035742241", "text": "Hi\nIf you were going to Rome on an 8 night package in December, would you go to Venice or Florence on a day trip? There is also option of Tuscany day trip lunch and wine.\nI realize Florence is closer.\nThanks for your thoughts or any other ideas.🍷🍷", "link": "facebook.com/groups/1373361046396315/permalink/2213235035742241/", "likes": 1, "comments": [{"username": "Lee Hostettler", "comment_text": "Florence"}, {"username": "Jenn Messina Babore", "comment_text": "Venice is 4 hours each way by train, so not really a day trip option. If you plan to stay overnight, then Venice. Otherwise Florence due to distance."}, {"username": "Colleen Jennings", "comment_text": "Florence - magical Christmas lights & beautiful shop windows."}, {"username": "Kejdi Okej", "comment_text": "Florence magical christamas lights . Beautiful shop windows ."}, {"username": "Patricia Foley Mastrorilli", "comment_text": "Florence"}]}, {"id": "2213236075742137", "text": "Arriving mid Oct - Thinking of doing a day trip, taking train to Pompei from Rome (rather than joining a tour). Anyone know if there are local tour guides on site to join when I arrive. Where do I locate them or best to join a tour coming from Rome? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2213236075742137/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Pompeii/\nPompeii-small-gr\noup-tour-with-a\nn-Archaeologist\n-and-skip-the-l\nine-included/\nd24336-23258P113\n?pid=P00070587&\nmcid=42383&medi\num=link&medium_\nversion=selecto\nr"}, {"username": "Jenn Messina Babore", "comment_text": "There are many tour guides at the entrance of Pompeii."}]}, {"id": "2213236549075423", "text": "anyone successfully used Movin Rome to get from FCO airport to their hotel/airbnb? There are a lot of mixed reviews...", "link": "facebook.com/groups/1373361046396315/permalink/2213236549075423/", "likes": 0, "comments": []}, {"id": "2213240639075014", "text": "Planning a trip next September, really enjoyed out experience in Scotland and Ireland with top notch small group tours for the trip. Can anyone recommend any comparable for Italy? We will have a group of about 8-12 going and really don’t want to do all the planning myself, loved having a guide with us to show us hidden gems and recommendations and seamless transition from one place to another.", "link": "facebook.com/groups/1373361046396315/permalink/2213240639075014/", "likes": 0, "comments": [{"username": "Jerry Kiger", "comment_text": "Hello, sorry I don’t have any advice as I am early planning myself. I saw your bigger group and curious if you had tips or thoughts about traveling bigger group? Maybe that what you question is asking\n\nI’m wondering about sleeping, not sure apartments will fit that many people, travel by train or car rental, etc. if have any planning thoughts would appreciate it, sorry know you asked a question and I’m asking you a question LoL"}]}, {"id": "2213243199074758", "text": "Looking for great hotel in Rome. Only there 3 days so I would like it to be in a great location and luxurious but it doesn’t need to be over the top", "link": "facebook.com/groups/1373361046396315/permalink/2213243199074758/", "likes": 10, "comments": [{"username": "Gay Bell DiBartolomeo", "comment_text": "Locarno, or St Regis Grand."}, {"username": "Colita Ellis Wittenkeller", "comment_text": "We really enjoyed the Westin for our 3 night stay. They have a great restaurant for pizza, drinks and snacks. Rooms are big and beds are comfy."}, {"username": "Lyndsey Ryan", "comment_text": "Hotel Degli Artisti Roma great roof top terrace and location"}, {"username": "Ilaria Giorgulli", "comment_text": "Hotel degli artisti or “donna Camilla Savelli” this is an highlight in rome, amazong"}, {"username": "Judy Hassett", "comment_text": "Hotel Raphael walking distance to almost all tourist sites. Piazza Navona a stones throw away. Rooftop terrace fab food, buffet breakfast, service and rooms are comfy and gorgeous."}, {"username": "Veronika Bisani", "comment_text": "The First Roma Dolce"}, {"username": "Kristína Polovková", "comment_text": "Little Queen Suites"}, {"username": "Hajar Rmt", "comment_text": "Navona colors"}, {"username": "Catherine Hatfield-Fuster", "comment_text": "The First Roma Arte... they were amazing. Not over the top, but always anticipating needs."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Great location and what you might call luxurious are mostly not compatible if you want to stay in historic Rome."}, {"username": "Helen Clark", "comment_text": "Hotel Barocco. I have only stayed there for the past 10 years, since I found it. Best service in Rome. Immaculate and exceptional but reasonably priced. Check out high reviews on Trip Advisor. Small boutique hotel so heavily booked."}, {"username": "Gary Bailey", "comment_text": "G-Rough near piazza Navona, you won’t be sorry if you like small boutique hotels"}, {"username": "Melissa Vocke", "comment_text": "The Maalot- cool eccentric boutique hotel with excellent service."}, {"username": "Elaina Toriello Scozzari", "comment_text": "We just stayed here in April. Fabulous hotel! Parco dei Principi Grand Hotel & SPA"}, {"username": "Mary Ann", "comment_text": "Albergo del Senato is a great choice as far as location and luxury. It's more expensive than some of the others but you can walk to everything you want to see easily. Great food around every corner, The Pantheon, Rome, right outside your window and a rooftop cafe make them a stay worth splurging on."}, {"username": "Charis Duff", "comment_text": "Hotel Indigo Rome, such a cool hotel with a rooftop bar"}, {"username": "Angelina Dattini", "comment_text": "Anantara Palazzo Naiadi Rome Hotel."}, {"username": "Tissie McClure", "comment_text": "Hotel Bolivar was great! Close to the Trevi Fountain, and we could get all around Rome from our hotel by walking a couple of blocks and catching a bus going to the train station and then catching a big bus hop on hop off! So easy to do! We went to several countries on this 33 day trip, and Rome was the easiest one to get around in! ￼"}, {"username": "Amy Pernell Cavers", "comment_text": "Rome Edition! New, great location, part of Marriott Bonvoy."}, {"username": "Sandy Burton", "comment_text": "The Hive"}, {"username": "Amy Schmelzle Walsh", "comment_text": "The Pantheon Iconic Rome hotel is small but in a great location and service was very good"}, {"username": "Joy Croake", "comment_text": "Hotel Accademia…5 mins from Trevi fountain"}, {"username": "Jennifer Foster", "comment_text": "Hotel TriviHo Fantastic location walking distance to everything and beautiful rooms. Tour guide was exceptional 💯"}, {"username": "Mary Jane Crawford", "comment_text": "The Inn on the Spanish Steps was so nice! Great location too"}, {"username": "Rebecca Yeoh", "comment_text": "Hotel Smeraldo, amazing location. Right next to a bakery that the locals line up for 👌🏼 https://\nwww.smeraldoroma\n.com/en/"}, {"username": "Kim Cowoski Hoff", "comment_text": "Hotel Splendid Royal! Not far from Trevi Fountain. absolutely beautiful. Restaurant is amazing and roof top bar is spectacular!"}, {"username": "Don Mchugh", "comment_text": "Clarice. Or close to that name"}, {"username": "Chloe Hyatt", "comment_text": "Sophie Terrace Hotel, the staff were amazing and most landmarks were about a 25 min walk apart from the Vatican. Plus the terrace up stairs is incredible!"}, {"username": "Stephanie Sposato", "comment_text": "River Palace Hotel"}, {"username": "Maree Peel", "comment_text": "Liberty Boutique Hotel"}, {"username": "Amber Pena", "comment_text": "Hassler!"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.dpbolvw.net/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187791-d1750\n6625-Reviews-NH\n_Collection_Rom\na_Fori_Imperial\ni-Rome_Lazio.ht\nml"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.anrdoezrs.ne\nt/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187791-d7134\n644-Reviews-Pal\nazzo_Navona-Rom\ne_Lazio.html"}, {"username": "Rebecca Allan", "comment_text": "Hotel 87 really lovely and ideal location."}, {"username": "Kejdi Okej", "comment_text": "Hassler l"}, {"username": "Kejdi Okej", "comment_text": "Hassler l"}, {"username": "Maria Teresa Manzo", "comment_text": "Mercure Roma Centro Colosseo"}, {"username": "Elana Kruger", "comment_text": "We just stayed at Hotel Nazionale was great & central"}, {"username": "Debby Finn Martino", "comment_text": "Love the Hassler!"}, {"username": "Trevor Ian Wright", "comment_text": "Una Roma hotel"}, {"username": "Margarita Lipkin", "comment_text": "Palazzo Scanderbeg. Amazing amenities and service, steps away from Trevi. Room service breakfast included."}, {"username": "Linda Hornsby", "comment_text": "Can anyone recommend a travel agency to help plan out my trip and make air and hotel arrangements?"}, {"username": "Jill Wolder", "comment_text": "Stay at the Hassler"}]}, {"id": "2213249785740766", "text": "We are travelling to Italy in May next year. Will be in Milan for 4 nights. I am not sure where is best area to stay.\nAny suggestions for accomodation in a central location?", "link": "facebook.com/groups/1373361046396315/permalink/2213249785740766/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.dpbolvw.net/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187849-d1213\n0410-Reviews-NY\nX_Hotel_Milan-M\nilan_Lombardy.h\ntml"}, {"username": "Jenn Messina Babore", "comment_text": "Are you going to other cities in Italy? I think you could cut down your time in Milan and maybe go to Lake Como or Garda?"}]}, {"id": "2213248935740851", "text": "Trying to decide how much time to spend in Florence and Almafi Coast. I only have about 8 days to be in Italy. Part of me wants to only visit the north and come back for the south of Italy… any ideas? My girls are in Florence for study abroad so i want to make the most of the trip and not feel rushed.", "link": "facebook.com/groups/1373361046396315/permalink/2213248935740851/", "likes": 6, "comments": [{"username": "Judite Lopes", "comment_text": "Spend 8 days in Florence and nearby cities and then come back to visit other regions…"}, {"username": "Jenn Messina Babore", "comment_text": "I would do a separate trip for the south. You could do Venice or Cinque Terre with Florence."}, {"username": "Etschi Bruckner", "comment_text": "take your time to discover Firenze and Toscana with your girls!"}, {"username": "Dawn Falsinotti", "comment_text": "I’d stay in Florence and explore a bit if Tuscany and save the south for another time."}, {"username": "Ellen Segal Tacher", "comment_text": "I wish I had just split the north and the south. I got a tiny taste of each now I have to go back. I recommend Lake Como Hilton as a base if you have Hilton points."}, {"username": "Ana Ka", "comment_text": "Do 4 days in Florence and 3 in Tuscany to see their small towns like San Gimignano , Volterra, Lucca, Cortona… that region will be enough for one visit 🙂. Otherwise too much travel time if you go all the way to Amalfi…"}, {"username": "Dee Cola Charlton", "comment_text": "I agree. I could spend the whole 8 days between Florence and Tuscany alone.\nSpend one whole day on a Tuscan wine tour and/or a cooking class."}, {"username": "Lucrezia Folger", "comment_text": "Stay in the north, visit the south as you said next time."}, {"username": "Cindy Sguazzin", "comment_text": "Stay north this time!"}, {"username": "Erin Bykowski", "comment_text": "Having traveled all over Italy, I’d recommend Florence and Tuscany or Florence and Venice. Tuscany is dreamy and beautiful and Venice is magical and mysterious. Depends if you want more countryside or more city. I’d pick Venice hands down for a first trip."}, {"username": "Penny Cato", "comment_text": "Stay in Florence then you could take day trips to Lucca and Cortona by train both are beautiful towns 🇦🇺🇮🇹🥂💕💕"}, {"username": "Tracy Wrinn Mcdermott", "comment_text": "My first trip was Rome and Southern Italy for 2+ weeks. This time it’ll be Venice, Florence and Northern Italy for 2+ weeks. Don’t rush, enjoy Florence and the area. Maybe add Venice, the Lakes, or Cinque Terre instead of Amalfi."}, {"username": "Kim Geary Keidel", "comment_text": "We did four nights in Florence, which was basically 3 1/2 days. We did day trips to other areas out of Florence. We definitely could’ve spent more time there!"}, {"username": "Katie Mahoney-Salajan", "comment_text": "Thanks for confirming this!! I see so many beautiful places, but I don’t want to miss the experience either! ❤️"}, {"username": "Lydia Springer", "comment_text": "If you want to spend time on the coast, stay in the northern area and visit Cinque Terre. Also, Siena, Lucca, and more of Tuscany."}, {"username": "Sarah Carr", "comment_text": "Stick with Florence and nearby towns. In addition to being rushed, when you try to see too many places on vacation, you spend a lot of your time in transit, time that could have been spent experiencing a place more deeply."}, {"username": "Fetchin Gretchen", "comment_text": "Just go with your gut and spend the time in Florence for half the time and Lake Como area--Varenna base, the rest, and from there boat to the other sights."}, {"username": "Diane NM", "comment_text": "Florence with day trips to the Tuscan countryside ! So many towns and villages, vineyards, wineries to visit.\nCheck out Fun in Tuscany for tours… Vespa, horseback, wine tours! They are located in Florence and provide transportation for all excursions!"}, {"username": "Jenny Payne", "comment_text": "I love Florence + have lived there often , make that your base and do day trips, Siena,Lucca,Are\nzzo the lust goes on and on 🌻"}, {"username": "Susan Hulsey Watkins", "comment_text": "Don’t forget about Siena!"}, {"username": "Pam Gerretsen", "comment_text": "Stay in Florence and do day trips - Lucca, Cortona (lovely shops, cafes, restaurants and views), Castiglione del Lago, Perugia, Orvieto - we drive from the UK, but I think they are all accessible by train."}, {"username": "Pegi Fuller", "comment_text": "Explore Monterriggione,\nVolterra, San Gimi, Siena, Lucca, Fiesole So much to see in that region! I would save Amalfi for another trip! It is worth a week on it’s own!"}, {"username": "Russ Heinemann", "comment_text": "Stay in Florence and venture out into other parts of Tuscany. Siena, Pisa, Lucca, Val d' Orcia."}, {"username": "Georgina Mcauliffe", "comment_text": "We love Florence - and I would really want time to explore down the backstreets, go t Fiesole and find little bar ff the beaten track places each night on your way back to wherever you are staying to drink aperitifs and nibble antipasti without thinking about packing and moving too much. I think you would love the Tuscan countryside and towns (cant miss Siena, San Gimignano, Arrezzo and Lucca) so honestly I would recommend staying around there this time and getting to see all the things the girls want to show you."}, {"username": "Colleen Campbell Bussey", "comment_text": "Stay north, Florence, Verona, maybe lake Garda & Venice are worth 8 days"}, {"username": "Tissie McClure", "comment_text": "If I had it to do over again, I would spend most of my time in Rome, as so much more there to do than in Florence! ￼"}, {"username": "Abe Michelson", "comment_text": "4&4 or 3&5."}, {"username": "Jeannine Carta Hanson", "comment_text": "Stay in the north and go to Tuscany. So many towns to visit."}, {"username": "Basia Szokarski", "comment_text": "Yes just stay north"}]}, {"id": "2213186292413782", "text": "Visiting the Vatican City tomorrow - dress says covered shoulders and no shorts / skirts - wondering how strict and if that applies to kids in this heat?", "link": "facebook.com/groups/1373361046396315/permalink/2213186292413782/", "likes": 11, "comments": [{"username": "Sara Braun", "comment_text": "Just went two days ago and made sure all 5 of us complied with the dress code, even buying pants for my son… and they didn’t check at all."}, {"username": "Carolyn Hall Raffo", "comment_text": "They are strict."}, {"username": "Dawn Haupt Hendricks", "comment_text": "It’s the Vatican follow the rules"}, {"username": "Dani Miller", "comment_text": "I’ve been to the Vatican 3x and every time I wore a dress, however I always made sure the days I went the dress went below my knees. As for shoulders, I would bring a really light cover-up, like mesh material so it didn’t make me hot but was still respectful. Many churches in and around Europe require modesty and they do enforce it. Always carry a light shall because sometimes you accidentally stumble upon beautiful churches and often are free to go see the inside as long as your modestly dressed 😊"}, {"username": "Sandra Inzerra", "comment_text": "I was there today. No shorts shorter than your knees and shoulders need to be covered. They supplied a small sheet for my daughter and I to wrap around our legs."}, {"username": "Ange Pappas", "comment_text": "Was there a few days ago. Yes they are strict. We bought a scarf and covered our shoulders."}, {"username": "Amanda Marie Genna", "comment_text": "They give you a shawl to cover up if needed I was just there two weeks ago"}, {"username": "Diane Leesmith", "comment_text": "Simple rule - dress modestly - men/women cover shoulders and knees ( no mid riff showing), sometimes ladies cover heads too. Showing Respect"}, {"username": "Diane Janovas", "comment_text": "Yes it does."}, {"username": "Glenn Todd Webb", "comment_text": "Consider it will be strict. Don’t gamble. Follow the rules. It’s the seat of a world religion."}, {"username": "Lucrezia Folger", "comment_text": "It applies to everyone."}, {"username": "Jennifer Gustafson", "comment_text": "Very strict. We wore longer sundresses and wore a shawl over our shoulders."}, {"username": "Paulyn Hoffman", "comment_text": "Even your children need to follow the rules. So, they should wear long pants and no T shirts tomorrow. It’s only 1 day."}, {"username": "Rich Rice", "comment_text": "Went today. In churches / cathedrals only. Dress/shorts around knees. Shoulders covered. Sandals seemed to by fine. My wife wore opened sandal, pretty much a flip flop. It’s not hot in buildings."}, {"username": "Vanessa Garces", "comment_text": "They would give you something to cover up. But yes they are strict and have guards checking before entrance"}, {"username": "Nancy Day", "comment_text": "Shoulders and knees must be covered"}, {"username": "Tissie McClure", "comment_text": "I would worry more about the 900+ steps you’re gonna have to do in that heat as no air conditioning in most of it!"}, {"username": "Caterina Liquori-Culhane", "comment_text": "Young girl in iur group stopped for not covering her knees"}, {"username": "Aimee Owens", "comment_text": "It depends on the guard looking at you. My tour guide got barked at because she didn’t have her shawl on fast enough. The rule is much stricter for women’s shoulders than men’s knees I can tell you that"}, {"username": "Suzanne Carver Musashe", "comment_text": "Yes and yes unless skirt is past knees"}, {"username": "Sascha Lee", "comment_text": "Never too early to teach respect."}, {"username": "Stefanie Malone", "comment_text": "I've been to the Vatican twice and we did not chance it. Of any of the churches, they will enforce."}, {"username": "Becky Barlow Moore", "comment_text": "I was just there last week and saw them turn away people who were not dressed with knees or shoulders covered"}, {"username": "Sara R. Anderson", "comment_text": "If ever I go there again I am going to go butt naked and let the flab fly..."}, {"username": "Rosa Zordan", "comment_text": "Yes"}, {"username": "Deborah Kane Edstrom", "comment_text": "It is not about heat or anything else. It’s about respect. Dress appropriately."}, {"username": "Logan Payne", "comment_text": "Shoulders are strictly enforced some flexibility on length of shorts or skirts would advise knee length or longer."}, {"username": "Richelle Tye", "comment_text": "Can we wear long skirts"}, {"username": "Nikoo Watson", "comment_text": "Wow.....some people here are really harsh to the original poster! They were only asking! Asking shows that they would like to be respectful to the rules. Surely there is no need for the rude replies 😕"}, {"username": "Helene Kalfas", "comment_text": "My daughter wore short they were fine my husband wore shorts."}, {"username": "Guy Rutter", "comment_text": "Prepare to be pestered by the men selling shawls outside if you remotely look like you haven’t covered up."}, {"username": "Jennifer Avrett", "comment_text": "Everyone, regardless of age, needs to dress respectfully. It's not hard. Bring a light scarf"}, {"username": "Melissa Johnson Pero", "comment_text": "Just longer shorts and cover shoulders inside the basilica with something, or wear short sleeves instead of sleeveless, and no hats. Not a huge deal."}, {"username": "Gabriela Palacios-Flusk", "comment_text": "Bring a throw/scarf. They are very strict, particularly on the shoulders."}, {"username": "Carmel Maisano", "comment_text": "Just went today.\nBring a scarf to cover your shoulders and ensure your shorts or dresses are long enough to cover your knees"}, {"username": "Wendy Spano Bracco", "comment_text": "The shorts are supposed to cover the knees. I found them to be so ugly so I found nice lightweight golf pants and joggers online at Bonobos for my Husband. I will be wearing a maxi and a shawl. I’m not looking to complicate this."}, {"username": "Nat Cleary", "comment_text": "If they see anyone showing too much they give them a throw sort of thing to wrap around themselves"}, {"username": "Amanda Bellamy", "comment_text": "I was there last week and they were stric t on this as you entered the Basilica. They were giving out paper type shawls to cover up shoulders and knees. A couple of teenage girls in my tour wearing strappy summer tops were asked to cover up."}, {"username": "Bailey Smola", "comment_text": "They usually don’t stray from that rule even for kids, especially at the Vatican. You will be asked to cover up if they even allow you past security"}, {"username": "Jaime Cleek", "comment_text": "We had an early morning tour a few people were wearing shorts. It all depends who you end up with that they can turn you away so just make sure shorts go down to knee or cover"}, {"username": "Andrea Fowler", "comment_text": "I just left. We adhered to it but there were women/kids there that had knees showing and some shoulders, even some midriffs. I was shocked and even annoyed since I went out of my way to buy clothes because I forgot about this when packing and then read if beforehand. But I would rather be safe than sorry and not be able to get in."}, {"username": "Shannon Confortin", "comment_text": "I wore shorts last year with no problem. They were longer shorta"}, {"username": "Atet GC", "comment_text": "I have strong faith for Catholic we always dress “appropriately”\nwhen going to church no matter where in the world it is. Weather or temperature is out of the question."}, {"username": "Anna Gambino", "comment_text": "I have never seen so many conflicting answers as I have on this question. I plan on visiting in October. Will cover shoulders and knees. Not a huge deal I suppose except for when it’s 100 degrees. Would suggest bringing a scarf to at least cover shoulders. Btw I was in Minori in June and didn’t expect to visit a church that day. The church had a basket with scarves to cover up. I’m guessing the Vatican would have a hard time supplying that many."}, {"username": "Ildiko Gyimesi Mikos", "comment_text": "I’m sure it depends on the attendant at the door"}, {"username": "Aurora Villegas Flores", "comment_text": "Yes, strictly enforced. It’s a matter of respect for the church(es)"}, {"username": "Jenny Frank", "comment_text": "Your kids need to be dressed respectively they need to learn !!!! Why should rules be diff for them?"}, {"username": "Karen Robertson", "comment_text": "We went in October and I took a scarf but I was surprised at the number of people that didn’t have sweaters/\nshawls etc. I would say take a shawl but if you don’t need it don’t use it"}, {"username": "Mary Ann", "comment_text": "no bare shoulders - no shorts. period. easy enough for everyone to do."}, {"username": "Jill Medrano Casey", "comment_text": "When we were there at the end of June on a hot day, I saw some people with knees showing turned away, some allowed in. One guy was offered a scarf to wrap around his legs by security. I think it just depends on who is working the front of the Basilica at the time. I didn't want to take any chances so we all dressed appropriately. 🤷‍♀️"}, {"username": "Alice Byrne", "comment_text": "I was there 4 days ago and watched a family of young kids be asked to leave before the young children refused to cover their shoulders and knees.\nThey provide light sheets to cover with but it’s really not hard to find a t shirt and some lingers skirts or shorts for a couple hours while inside"}, {"username": "Martha Seim Burch", "comment_text": "Some people get through and some do not….we saw multiple people being turned away. With the long lines I would not risk being turned away at the door….you will want to see it! It’s beautiful! Just cover shoulders and knees and know that it won’t be an issue:)"}, {"username": "Martha Heller", "comment_text": "I always have a large light weight scarf just in case. I've seen people turned away at many churches in Europe!"}, {"username": "Dann Hrusch", "comment_text": "It's a real shame that adherence to antiquated beliefs outweighs the comfort and well-being of the innocent, but such is the world we live in. That said, I've worn shorts to the Vatican museum multiple times, but dress more appropriately if entering St. Peter's."}, {"username": "Andrea Hirsch", "comment_text": "We went last month, it was 100+ degrees, literally checking people for appropriate attire. Even saw them telling men to take off baseball hats. My teens wore pants. Not worth the chance. It’s the respectful thing to do too"}, {"username": "Karoline Bakker", "comment_text": "Shorts and skirts knee length are ok"}, {"username": "Alicia Cox", "comment_text": "PEOPLE respect the church, respect the rules, don’t be obnoxious tourist & be prepared to get turned away if you choose to not follow the rules. NOT ROCKET SCIENCE 🤦🏻‍♀️"}, {"username": "Melanie Drapeau Meadows", "comment_text": "We were there this morning. You need to be covered for the Sistine Chapel and the Basilica. Our tour guide did mention that it didn’t apply to kids under 14. Can’t confirm though. As indicated they have cloth wraps that they hand out."}, {"username": "Nancy Kirby", "comment_text": "Bring a layer for kids they can take off when not there"}, {"username": "Dawn Falsinotti", "comment_text": "Not sure why so many people have a problem with this."}, {"username": "Bellafab Fabrizio", "comment_text": "Still applies to kids"}, {"username": "Karen Landini", "comment_text": "They don't relax the modesty requirement for heat. Cover shoulders and knees."}, {"username": "Michele Rossman", "comment_text": "I was there last week in heat. When you say kids (meaning young elementary) if their shorts are longer it is fine. Skirts that are touching knees are fine. Modesty is key. We had in our group a tall teenager with athletic shorts on and they gave him a piece of thin fabric to wear as a skirt. Pull the shorts down if you are concerned. Men is the same. All men with shorts I saw had longer shorts touching knees. Note my family just wore thin pants Vatican/church days out of respect but I get it."}, {"username": "Vivien Paulik", "comment_text": "Yes, for kids too. In Vatican City you can go around in anything, what you meant is go to churches, Basilica is anywhere not jusz in the Vatican City. Respect the relugion!\nCover shoulder and knees. It does nor have to be full long, just under knee! And you can put scarf on the shoulders when you go inside, so problem solved"}, {"username": "Venette Macalinao", "comment_text": "Still applies. Make sure everyone has their shoulders and knees covered"}, {"username": "Christine Bacci", "comment_text": "You can actually dress normally and wear a wrap around your shoulders. They do not enforce this strictly. We wore tanks and shorts due to heat and a $5 shawl around our shoulders and were fine everywhere in Rome. They usually don’t even look at the men and there are so many people they are more concerned with keeping everyone moving"}, {"username": "Francisca Lis", "comment_text": "No debes mostrar rodillas ni hombros.\nEn los hombres se soluciona, por ejemplo, con pantalones tipo montañero que llevan pantalón corto y mediante cremalleras se ponen dos piezas para convertirlos en largos. Al salir te los quitas.\nLas mujeres pueden llevar un pañuelo o fular sobre sus hombros.\nPueden llevar falda de largo normal, a la rodilla, no minifalda ni shorts.\nO un pañuelo/pareo para anudar en la cintura y convertirse en una falda larga."}, {"username": "Robert Brenner", "comment_text": "They'll give you a sheer lightweight cover up there if they have an issue."}, {"username": "Sylvia Kotsopoulos Vocino", "comment_text": "Kids too!"}, {"username": "Lora de Vries", "comment_text": "The weather is irrelevant! It is respect for the Church (all Churches all over the world) and also showing respect for the people worshiping inside."}, {"username": "Mairin O'Rourke", "comment_text": "we were in Piza last week. Kids were fine (including adult size teen in longer athletic shorts and jersey). I raised ire wearing a maxi dress with flutter sleeves to mid arm but it was fitted with elastic and that seemed to make them think it was imodest. Got in and girls in string tops."}]}, {"id": "2213254645740280", "text": "Has anyway booked guided tours of Colosseum through Expedia? Any thoughts who to best book through?", "link": "facebook.com/groups/1373361046396315/permalink/2213254645740280/", "likes": 0, "comments": [{"username": "Jenn Messina Babore", "comment_text": "Best to book direct at Coopculture.it"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nA-break-from-the\n-city/\nd511-132779P24?p\nid=P00070587&mc\nid=42383&medium\n=link&medium_ve\nrsion=selector"}]}, {"id": "2213188705746874", "text": "Staying in Almafi for 7 days Sept 2023 ... Looking to visit Positano, Sorrento and Capri.\nWhat are the must do and must see?\nWhat is best way to travel from Almafi to visit these places?", "link": "facebook.com/groups/1373361046396315/permalink/2213188705746874/", "likes": 0, "comments": [{"username": "Jennette Riches", "comment_text": "bus, taxi, or boat."}, {"username": "Glenn Todd Webb", "comment_text": "Ravello-Villa Rufolo and Villa Cimbrone are the musts."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 8, "comments": []}, {"id": "2213255625740182", "text": "Tell me an itinerary of 1 day in Rome. I have a fill day to see sighets and want to make the best day of the stops. Please include the best way to get around. What would you see?\n\nI have a night tour of Colosseum booked on day 1, bullet train day trip to Naples and Pompeii day 3.\nTrain to Civieteccchia on day 4 and day 5 get on cruise ship.\n\nNeed to have a good plan for day 2\n\nAlso booked a whole day at Vatican area after the cruise.", "link": "facebook.com/groups/1373361046396315/permalink/2213255625740182/", "likes": 0, "comments": [{"username": "Kally Trahearn", "comment_text": "Just walk about and use Google Maps to these locations:\nStart at Spanish Steps > Trevi Fountain > Pantheon > Piazza Navona\n\nThink if you take your time, you can see all these places without rushing and fit in a nice coffee en-route and lunch somewhere around Piazza Navona. People watching is also great fun."}, {"username": "Hilary Bullard Locklear", "comment_text": "Go check out the website your guy.com or watch their video on YouTube"}]}, {"id": "2213258169073261", "text": "Hi there…looking for advice please. We are travelling between Naples-Sorrento-Rome-Cortona-Pisa-Florence-Modena-Verona and Venice in Nov/Dec this year. We are hoping to use the trains to commute, but I can see there are a number of different lines/companies (e.g. trenitalia/Italo Treno etc).\n\nAny advice as to which one to travel with? I also understand that timetables only come out 60-90 days in advance..is that correct?\n\nAny suggestions/recommendations would be greatly appreciated 🙏", "link": "facebook.com/groups/1373361046396315/permalink/2213258169073261/", "likes": 0, "comments": [{"username": "Andrea Bainbridge", "comment_text": "Download Trenitalia App. Works like a dream."}, {"username": "Karen Blackmore", "comment_text": "Trainline app will give you all the options. Can then book direct if prefer."}, {"username": "Kejdi Okej", "comment_text": "Download trenitalia app. Works like a dream."}, {"username": "Cathy Dickie", "comment_text": "Trish Murphy"}, {"username": "Cathy Dickie", "comment_text": "Is this the app?"}, {"username": "Tamika Parkin", "comment_text": "We used trenitalia! No problems at all. Super easy babe"}, {"username": "Ibbu Mohd", "comment_text": "Use 'italo' trains, book direct with them.\nPrivate company, less to no chance of strikes. Book seats in advance."}]}, {"id": "2213260079073070", "text": "I am travelling to the Amalfi Coast in July 2024. I have 4 nights in Sorrento and am planning 2 nights in either Praiano or Amalfi but wondering which of these 2 would be my better option to be able to travel around - ferries/busses as I would like to have dinner in Positano one night", "link": "facebook.com/groups/1373361046396315/permalink/2213260079073070/", "likes": 0, "comments": []}, {"id": "2213266625739082", "text": "Can anyone review: HOTEL BELLEVUE SYRENE in SORRENTO ?\n\nThis will be our hotel 🏨 for our vacation 2024", "link": "facebook.com/groups/1373361046396315/permalink/2213266625739082/", "likes": 0, "comments": []}, {"id": "2213265685739176", "text": "Can anyone review: BAGLIONI HOTEL REGINA\n\nour hotel 🏨 in Rome for 2024", "link": "facebook.com/groups/1373361046396315/permalink/2213265685739176/", "likes": 2, "comments": [{"username": "Suzanne Sunnaborg", "comment_text": "I suggest you use trip advisor and look at the reviews. I use it for EVERYTHING, restaurants, tours and hotels."}, {"username": "Jodi Shiffman Silverman", "comment_text": "Loved. Charming. Fabulous breakfast. Amazing staff. Very European. Great location!"}, {"username": "Mario Torre", "comment_text": "€1100/night, ouch!"}, {"username": "Melissa Elliott", "comment_text": "It’s great! I book my clients there often. I love that they are part of Virtuoso and I can give them lots of perks. It’s in a quieter area of Rome but still close enough to walk to all the major attractions (Trevi, Pantheon, Spanish Steps). You’ll love it."}, {"username": "Debby Finn Martino", "comment_text": "Was just there last month for the 2nd time. Great hotel, staff, rooms, breakfast. Good location, not a far walk to Spanish Steps"}, {"username": "Lori Fahmie Alecci", "comment_text": "Loved this hotel! Beautiful interior but what I remember as a huge standout was that the water pressure in the shower was killer!! Lol"}, {"username": "Daniella Grossman Kreiner", "comment_text": "Stayed there last March. We had two rooms (traveling with teenagers) that connected through a private hallway where we could lock the outer door. It’s in a great location and had a nice breakfast."}, {"username": "Rosanne Messina Gentile", "comment_text": "Would this hotel be a one night stay over ? Flying into Rome about 9.00pm leave next morning from station at 10.30am?"}]}, {"id": "2213268825738862", "text": "Which app is better to use in Italy ? Maps or Google Maps?", "link": "facebook.com/groups/1373361046396315/permalink/2213268825738862/", "likes": 4, "comments": [{"username": "Mike Bigg", "comment_text": "Waze!"}, {"username": "Mike Bigg", "comment_text": "The on and off ramps in Italy are super short. Google is very confused as sometimes there are multiple ramps. I have the latest iPhone but find Waze is the best for navigation. But use google maps to find a good kebab place eat"}, {"username": "Christiana Xenofontos", "comment_text": "We used google Maps and it was very convenient"}, {"username": "Max Perletta", "comment_text": "In Italy we still use carrier pigeons !"}, {"username": "Sandra Kingsley", "comment_text": "We just came back from Europe and mainly used Apple Maps as it told you where the speed cameras were! We also used Apple Maps for walking from our accomodation to places of interest!"}, {"username": "Carmen Ramona", "comment_text": "Waze."}, {"username": "Deniz Bircan", "comment_text": "Good old fashion physical map"}, {"username": "Shannon Confortin", "comment_text": "I have been using maps for 3 weeks no issues"}, {"username": "Bill Shafer", "comment_text": "I love Apple, but Google maps is so much better. You can also download it for offline use. Waze is owned by Google."}, {"username": "Allan Olexa", "comment_text": "We use Citymapper and Google Maps. They both work very well."}, {"username": "Sabiha Syed Shaikh", "comment_text": "Google maps."}, {"username": "Brice Blosser", "comment_text": "Google.\nIf you want an offline map, look into before you leave. I’ve use maps.me as well for offline. Otherwise, you might use your data, if you don’t mind."}, {"username": "Kn Blanchard", "comment_text": "Google maps was great in recognizing where all the speed cameras were. Had no issues going from Naples to Amalfi to Florence and everywhere in between"}, {"username": "Joey Teo", "comment_text": "We used both Waze and google maps during our road trip (2 handphones) in June.\n\nFor Italy, Waze not as good (if France then uses Waze) as Google map. When using google map, remember to on the sound as it will prompts (special sound) when there’s speed camera (a orange box) about 350m ahead, after passed the speed camera it will also prompts with another type of sound."}, {"username": "Ian Beyer", "comment_text": "Waze, probably. Google maps is terrible about labeling streets."}, {"username": "Seán Ó Confhaola", "comment_text": "Google maps were great when walking but was confusing while driving. Missed a junction turn off and it redirected me onto obscure roads that didn’t bring me to my destination."}, {"username": "Angie Chianelli", "comment_text": "City Mapper"}, {"username": "Johnston Williamson", "comment_text": "Note if for driving a rental. We were able to change the language in our rental navigation system settings to English. Having this and google maps on cell was great! Especially for all the small roundabouts etc"}, {"username": "Jennifer Lynn Davis", "comment_text": "Google maps"}, {"username": "د. ئاری قادر موکریانی", "comment_text": "Maps me is best"}, {"username": "Debra Hayman", "comment_text": "Whichever you prefer"}, {"username": "Tricia Bean Scott", "comment_text": "Google maps"}, {"username": "Jaime Cleek", "comment_text": "Both work"}, {"username": "Vivien Paulik", "comment_text": "Google map"}, {"username": "Sam Mah", "comment_text": "Try citiymapper as well."}, {"username": "Justin Palyu", "comment_text": "If you’re driving, neither account for ZTL zones so be careful."}, {"username": "Val De Leon III", "comment_text": "Waze"}, {"username": "Csilla Horvath", "comment_text": "Waze"}, {"username": "Austin Briscoe", "comment_text": "Google maps, and download the area you are traveling in so you can use it with no data signal."}, {"username": "Lee Martin", "comment_text": "Google maps is great until you do the walk, it might be me though 🤣"}, {"username": "Courtney Lynn", "comment_text": "The app city mapper is really helpful for the big cities! Google is good for places of interest but I prefer Apple Maps if I’m driving. City Mapper also has a walking option"}]}, {"id": "2213260265739718", "text": "So this is the Fontana Di Trevi at 11pm tonight. Crazy.", "link": "facebook.com/groups/1373361046396315/permalink/2213260265739718/", "likes": 33, "comments": [{"username": "Bethany Lane", "comment_text": "It was lovely and quiet this morning and they were cleaning it so nobody could get close 😂"}, {"username": "Larry Dash", "comment_text": "Yuck"}, {"username": "Jesse Crawford", "comment_text": "Korri Sullivan"}, {"username": "Yvonne Ormson", "comment_text": "That whole area is such a zoo this week. So happy to be staying in Trastevere, which is a beautiful oasis of calm and has all the best places to eat and drink :-)"}, {"username": "Elnara Mektiev", "comment_text": "Too crowded!"}, {"username": "Ange Cimino", "comment_text": "Wow that’s nuts Adam Carroll"}, {"username": "Antonio Aloè", "comment_text": "Tourists you know...😑"}, {"username": "Chris Hyatt", "comment_text": "Well it is middle of the summer holidays! 🙄"}, {"username": "Debra Waghorn", "comment_text": "Peter Waghorn"}, {"username": "Dominic Lelièvre", "comment_text": "Everyone taking the sames pictures as Google, nice 👌"}, {"username": "Steve Vinny", "comment_text": "This is why I'm glad i am going in september and not now. All the breeders will have no choice but to stay where they are since the kids will be in school heh heh."}, {"username": "Ursula Kenny", "comment_text": "Wow still crazy busy 🙈"}, {"username": "Mona Sidhu Samrari", "comment_text": "Crazy. Go sleep ppl"}, {"username": "Diane Fitzpatrick", "comment_text": "We went at night so lovely and hardly any crowds🥰"}, {"username": "Paula Bennett", "comment_text": "Oh my! Stacy Bennett"}, {"username": "Myshell Wallaby", "comment_text": "Kaylene Sheedy omg"}, {"username": "Fei Dadulla Miranda", "comment_text": "Yikes"}, {"username": "Alicja Krampa-Chrabąszczewicz", "comment_text": "Alicja Krampa-Chrabąszczewicz"}]}, {"id": "2213262892406122", "text": "Can anyone give me their review of their TOUR OF LATIUM COUNTRYSIDE THROUGH WINE AND HISTORY and the CARPINETTI WINERY ?\nThis is in Anagni .", "link": "facebook.com/groups/1373361046396315/permalink/2213262892406122/", "likes": 0, "comments": []}, {"id": "2213263329072745", "text": "Curious, looking into train tickets for an October trip. I reserved a premium ticket for two (round trip) for $258.00, Rome to Venice. Does this seem high or about average? Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2213263329072745/", "likes": 2, "comments": [{"username": "Jim Bobrowski", "comment_text": "I paid that total for 3 people business class on trenitalia for 1 way for Venice to Florence, Florence to Rome, Rome to Naples. What is a premium ticket? Which company."}, {"username": "Jenn Messina Babore", "comment_text": "That seems high for Premium. Who did you book through and did you use any discounts for 2? Like Me&You on TrenItalia."}, {"username": "Jenny Frank", "comment_text": "Did u compare companies?\nI have 5 1st class tix Rome Venice for a drop under 500."}, {"username": "Kejdi Okej", "comment_text": "Did u compare companies l have 5 1 st class tix rome venice for a drop under 500."}, {"username": "Jenny Breier", "comment_text": "How far in advance are you able to book?"}, {"username": "Erin Bykowski", "comment_text": "About right for premium. Business class is fine too if you are looking to save some money."}, {"username": "Rhona OConnor", "comment_text": "Check the same journey on the Trainline app"}, {"username": "Valentina Bachi", "comment_text": "I assume it is a fast train so yes the price looks ok to me for 2 ppl round trip"}, {"username": "Richard Harris", "comment_text": "Elizabeth Jayne Harris"}, {"username": "Melody Brothers Ipolito", "comment_text": "Anyone use Omio?"}, {"username": "Suzanne Munro", "comment_text": "Use rome to rio app gives all the options"}]}, {"id": "2213264299072648", "text": "Can anyone give a review of the: TOUR OF THE JEWISH GHETTO AND TRASTEVERE WITH KOSHER TASTING ?\nThis is in ROME", "link": "facebook.com/groups/1373361046396315/permalink/2213264299072648/", "likes": 1, "comments": [{"username": "Jana Adams Birenbaum", "comment_text": "Which tour company? Ours canceled hours before the tour!"}]}, {"id": "2213264775739267", "text": "I’m allergic to Soy. Does anyone know most of the food is safe?", "link": "facebook.com/groups/1373361046396315/permalink/2213264775739267/", "likes": 0, "comments": []}, {"id": "2213266129072465", "text": "We just returned from an amazing trip to Italy and wanted to share some of the highlights as you were all so helpful to us! If you need additional info, please do not hesitate to ask. We flew round trip, Boston to Rome and on arrival day took a connecting flight with ITA Airways to Venice. Our itinerary was: 2 nights Venice, 3 nights Ortisei (Dolomites), 3 nights Florence, 2 nights Chianti and 4 nights Rome. 2 nights in Venice: 1. Stayed at Corte de Gabriela (lovely boutique hotel with a charming courtyard, great location, wonderful and attentive staff.) 2. Viator tour of St. Mark’s and Doge’s Palace – Walks of Italy - excellent tour guide. 3. Day trip to Burano using the public water taxi. Loved it. 4. Drinks at Pitti Palace right on the Grand Canal – what a treat! We loved Venice – there is a surprise waiting at every turn! Departure day: Trenitalia from Venice to Bolzano via Verona, with round trip car service from Bolzano to our Hotel. 3 nights in Ortisei – in the Western Dolomites. This is a very beautiful village, with access to spectacular hikes and stunning views. 1. Stayed at the Hotel Gardena Grodnerhof (exceptional hotel, our favorite of the trip. Customer Service really excels here! Breakfast is phenomenal; you would not believe the selection. The bar area is incredible. Delicious dinners too!) 2. Hiked the Seceda trails. 3. Hiked Alpe de Suissi. Very sad to leave! Departure day: Trenitalia from Bolzano to Firenze. Give yourselves ample time with train connections (we had 20 min). The train from Bolzano to Bologna was delayed so we missed our connection to Firenze. Scrambled to find another option. Luckily, we had downloaded the ITALO app and were able to get seats on that train as Trenitalia was sold out for the rest of the day! 3 nights in Florence: 1. Stayed at Hotel Spadai (great location and icy cold AC but for me, it fell short in other ways, just felt too boxed in. Most rooms in cities are smaller but something about the layout here and breakfast on the highest floor (with little to no ac). It was just ok for me. Hotel staff, nice. 2. Viator tour of Accademia (incl David) and climb of the Duomo Cupola was great. 3. With Passepartout, visited the Uffizi Gallery, Pitti Palace and Boboli Gardens. The latter two were ok in comparison to the Uffizi, one of the most amazing art galleries we have visited, ever. 4. Ate lunch one day at the Mercato Centrale – upstairs. Everything was so delicious. 5. Piazza della Signoria – stunning, especially at night. 6. Piazza della Republicca, love the cafes there. This is also a stunning piazza. 7. Piazzale Michelangelo – challenging walk up, but well worth the view of Firenze. 8. Ponte Vecchio – it’s all jewelry stores but beautiful. Departure day: round trip car service from Firenze to Castellina in Chianti. 2 nights in Castellina in Chianti: 1. We stayed at Castello La Leccia, a gem, with breathtaking views of the countryside from this winery/agriturismo on a hill. Truly a special place and a close second to Gardena Gardenerhof. 2. Beautiful pool which we enjoyed on arrival day. 3. Private tour with Corrado di Pompeo with Tourscany. He was wonderful. His goal is to ensure that you have a great experience. With Corrado, we visited in one day: Siena (gorgeous), San Gimignano (also gorgeous with the most delicious gelato at Dondoli), and Monteriggioni (smaller and beautiful). We also visited two wineries, including Poggio Amorelli, where we had a delicious lunch and wine tasting. Departure day: Trenitalia from Florence to Rome, with car pick up at train station. 4 nights in Rome: Stayed at the Hotel Locarno – lovely, trendy boutique hotel near Piazza del Popolo. 10-minute walk to Piazza di Spagna but about 20-25 min to most other places. This was just fine for us, given that the food in Rome was spectacular! 2. Liv Tour of Vatican Museums, Sistene Chapel and St Peter’s Basilica. 3. Liv Tour of Colosseum and Roman Forum. 3. Visited Fontana di Trevi, Piazza Navona, Campo de Fiori, and the Pantheon. 4. Visited the Cappuccini Crypts. 5. Visited the Borghese Gardens. 6. Visited Trastevere twice for dinner. Rome was our favorite city. It is lively and offers jaw dropping historical sites, beautiful churches, delicious food, and warm and gracious people. Admittedly, we tossed farewell coins into the Trevi Fountain, hoping to return someday soon. Safe and happy travels to all!", "link": "facebook.com/groups/1373361046396315/permalink/2213266129072465/", "likes": 82, "comments": [{"username": "Lee Hostettler", "comment_text": "Sounds like a magical trip\n\nYes, you will want to return. After our first trip we had a ten year plan to have a home in Italy and travel 2-3 times per year.\n\nThank you for sharing"}, {"username": "Cleo Forrey", "comment_text": "Thanks for sharing…we’ll be there in 3 weeks."}, {"username": "Kejdi Okej", "comment_text": "Thanks for sharing ... We ll be there in 3 weeks"}, {"username": "Mugette Matos-Barber", "comment_text": "Fabulous trip!"}, {"username": "Kathie Mish Gatten", "comment_text": "Thanks so much for sharing\nHeading there next May, just in the planning phase can’t wait"}, {"username": "Carole DeSimone", "comment_text": "Thanks for sharing!"}, {"username": "Deborah Moos", "comment_text": "Great post! Rome is so special! All of Italy is special! Happy for you! We loved Mercato Centrale, too!☺️"}, {"username": "Pegi Fuller", "comment_text": "Great trip with impeccable planning on your part. We also loved Castellina in Chianti, Monteriggioni, San Gimi (delicious Ribollita here) and I would add Volterra for spectacular views. We had a villa outside San Gimi for a week one year. Easy access to many areas of Tuscany ( we had a rental car)\nIn Rome we stayed at Hotel Raffaello on Via Urbana. Walking distance to Colloseum, Termini Roma, Spanish Steps and Trevi Fountain. Also had a Metro station at the end of the street to go to Vatican and Trastevere.\nAnother place of beauty that we stayed was I Grande Toscana near Arezzo and Cortona. They have suites or Apartments, a pool, winery and delicious breakfast. At the time we were there it was run by two Italian sisters that had been born in Montreal, Canada and moved back so their English was terrific!\nWe have rented villas on the Amalfi Coast twice and that is fantastic as well!\nSo many beautiful places in Italy to consider. We have been back three times and we still haven’t been to the Dolomites, Lake Como, the Adriatic coast or Sicily!! Future visit planning yet to come lol!"}, {"username": "Ellen Flack Stewart", "comment_text": "Thanks for sharing."}, {"username": "Dianne Campbell", "comment_text": "Grant Campbell"}, {"username": "Karen Edl", "comment_text": "Thank you for the detailed info. We go in October 😊"}, {"username": "Kimberly Dunn Spelman", "comment_text": "Thank you for sharing. Which Liv tour of the Vatican did you do? Was it early access? Breakfast? And how was it? Thanks for any info."}, {"username": "Sarah Lybarger", "comment_text": "Thankyou for sharing. Going to be in Rome the first week of November. Having such a hard time deciding where to stay! Lol"}, {"username": "Marcela Martinez", "comment_text": "Thank you for your tips. Our trip is getting closer. Our adventure begins in one month 😎"}, {"username": "Jackie Oyler Confalone", "comment_text": "Who did you use for car service?"}, {"username": "Bonny S Boggs", "comment_text": "Thanks for info Italy is fantastic glad you enjoyed"}, {"username": "Susan Sassoon", "comment_text": "Thank you for taking the time to share all this info."}, {"username": "Wilma Resta", "comment_text": "Wonderful places you visited. Thanks fir sharing!"}, {"username": "Meredith Hill Bishop", "comment_text": "Great info! Thanks for sharing!"}, {"username": "Terry Rebisz Vlosich", "comment_text": "Thank you for your post. I am going to the Dolomites with my adult daughter in a month. We are staying in Castelrotto after a night in Bolzano. Your post makes me reconsider whether we should switch to Ortisei. Any advice? It sounds like an easy commute from Bolzano."}]}, {"id": "2213267452405666", "text": "I am planning to travel Italy, however I could manage just 4 days .\n\nAny suggestions which all places I should not miss.\n\nI am travelling alone hence flexible to travel Mostly dependant on public transport.", "link": "facebook.com/groups/1373361046396315/permalink/2213267452405666/", "likes": 0, "comments": []}, {"id": "2213266885739056", "text": "Can anyone recommend a white wine tasting in Tuscany - San Gimignano … home of the best whites in Italy ?", "link": "facebook.com/groups/1373361046396315/permalink/2213266885739056/", "likes": 0, "comments": [{"username": "Diane NM", "comment_text": "Tenuta Torciano"}]}, {"id": "2213268345738910", "text": "We are staying in Massa Lubrense in September, any tips or “must see/do” would be appreciated! Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2213268345738910/", "likes": 0, "comments": []}, {"id": "2213268522405559", "text": "Can anyone review: ITALIAN COOKING CLASS AT NONNA FLORA ￼\n\nThis is in SORRENTO for our 2024 vacation", "link": "facebook.com/groups/1373361046396315/permalink/2213268522405559/", "likes": 0, "comments": []}, {"id": "2213269925738752", "text": "Can anyone tell me if this will work for plugging in blowdryers in Italy?", "link": "facebook.com/groups/1373361046396315/permalink/2213269925738752/", "likes": 9, "comments": [{"username": "David Horgen", "comment_text": "They've been everywhere we've stayed"}, {"username": "Debbie Riffe Fulco", "comment_text": "I booked all my Airbnbs in Italy with hair dryers. Took my own straightener but used it on lowest setting. I learned my lesson. In Wales, I burned my hair and caught a small fan on fire."}, {"username": "Madeline Caporale", "comment_text": "Make sure any hair appliances you take with you are dual voltage, Not doing so you will likely ruin your beloved styling tool, risk injury, and risk blowing out the power in your room and/or the building. Dual voltage travel hair dryers and other appliances that heat up can readily be purchased in the US prior to your trip."}, {"username": "Mary McClintock", "comment_text": "If at all possible, use the hairdryer supplied by the host (hotel, Airbnb, VRBO, etc). Converters have not always done what’s expected."}, {"username": "Jeanne Eliason", "comment_text": "I have been told by our host that he will provide a hair dryer. In his small village of Sinalunga he tells us not to use any hair dryers or other appliances for hair. \"Not good for our old electricity \". Not sure what he means however I use his Not so good hair dryer. I bought an Italian hair straitener because that's very important to tame my out of control hair !"}, {"username": "Michael Messina", "comment_text": "Yes , for sure"}, {"username": "Ian Beyer", "comment_text": "No, this is not a converter."}, {"username": "Debbie Keller", "comment_text": "What is needed for charging iPhone from U.S. ?"}, {"username": "Katty Veneno Perez", "comment_text": "No blow dryers at all they won’t work here in 🇮🇹 bring a portable ac 😜"}, {"username": "Sue Ellen Thomas", "comment_text": "Purchase a dual voltage hair appliance"}, {"username": "Walaa Hosny", "comment_text": "This will work, but you have to be careful for the voltage, it is 220 , better to use the one on the hotel, but for charging your you can plug it directly and it will work, get one with 4 or 5 USB and one converter, that is what I did and it worked"}, {"username": "Gavino Reloj", "comment_text": "This is an adapter to plug in Italian receptacle (220 volts) for use of US appliance (110volts)! It is not convert Italian voltage (220volts) to US voltage (110volts). However, if for example your hair dryer is multi voltage ( see it in the plug), where is says 110v - 220v, then you’re good to use it. You can use the usb picture above to charge your smartphone!"}, {"username": "Jennifer A Lo", "comment_text": "Yes we used one that is similar a￼nd had no problems"}, {"username": "Rita Rodriguez Falciani", "comment_text": "Yes hotels have hairdryers"}, {"username": "Elaine King", "comment_text": "You will need a converter"}, {"username": "Virginia Rosas", "comment_text": "Hotels that we stayed at had adapters."}, {"username": "Jimmy Caravoulias", "comment_text": "Yes as long as it is dual voltage"}, {"username": "Ruth Hackert", "comment_text": "I think adapter for Italy is 3 prongs in a row"}, {"username": "Barb Krieg-Stepien", "comment_text": "I just used this adaptor for my iPhones and AirPod charger in Vienna and Italy. Also for my dual volt curling iron. Worked great! As long as your appliance supports 220 volt. Will work! Why waste time shopping for things when you get there?\n\nMost Airbnbs, hotels, airports, airplanes, and trains have usbs to charge also."}, {"username": "Paul N Marietta Dodson", "comment_text": "They have blow dryers in every hotel."}, {"username": "Debbie Thompson Rowland", "comment_text": "Yes if your hair dryer is dual voltage. You must change the voltage in order to not burn it out."}, {"username": "Melissa Geesaman Tomlinson", "comment_text": "That worked for a straightener in France."}, {"username": "Alex Dodge", "comment_text": "NO!"}, {"username": "Francisca Lis", "comment_text": "No hay secador en tu hotel o apartamento? Suele haber en todos los alojamientos..."}, {"username": "Julie Okerlund", "comment_text": "Yes but you need a blow dryer that has the proper voltage"}, {"username": "Michael Alea", "comment_text": "Look at video it answers all the questions"}, {"username": "Sharon Roberts Crossley", "comment_text": "Don't take your blow dryer. It will probably die"}, {"username": "Amy Schmelzle Walsh", "comment_text": "I used an adapter similar to that with a dual voltage dryer I ordered on Amazon- it worked well- I had to use a different adapter in Paris (or it could have been Geneva or London)🙈"}, {"username": "Amanda Elias", "comment_text": "It’s so hot you won’t want to blow dry!!!"}, {"username": "Belinda Cooper Hockings", "comment_text": "I have always used the hotels hairdryers and I am someone who can’t go without washing my hair and blow drying it every day 😳"}, {"username": "Scott Perry", "comment_text": "I think you actually need a voltage converter. Might be easier to buy a hair dryer once you’re there."}, {"username": "Mike Bigg", "comment_text": "No. It will melt. Go to LIDL in Italy. Buy a hair dryer for 9€. Or UNIEURO for 19,99€ if you’re fancy"}, {"username": "Vincent Affinito", "comment_text": "Probably not"}, {"username": "Kim Dixon", "comment_text": "first off, you'd have to ensure your hairdryer is 110/220, 50/60 hz. If it is, then you can use it in Italy by just using an adapter. If not, you can't use unless you have a transformer (often referred to as a converter). Second, that looks like a central european plug (large prongs). Italy has a 3 smaller (and sometimes larger) prong system. You'd need an adapter for that"}, {"username": "Susan Marten", "comment_text": "You’ll need a dual voltage dryer."}, {"username": "Jonathon Micklitsch", "comment_text": "My wife actually bought a small travel size hairdryer that you could flip a switch to conver voltage. You still have to use a plug adapter to fit their plugs. I think it was around $120."}, {"username": "Brice Blosser", "comment_text": "No. Several ask this question. American products are 110-120v 60Hz, Europe including Italy are 220-230v 50 Hz. If you want to kill your products, just get a plug adapter. If you don’t want to, you need a converter. This goes for phones too; if they are not able to be used on the higher voltage system. I’ve used these for years. https://\nwww.amazon.com/\nBESTEK-Converter\n-3-Outlet-Trans\nformer-Adapters\n/dp/\nB076S2WGYL?pd_rd\n_w=7m2ka&conten\nt-id=amzn1.sym.\nd6de0d9a-b966-4\ne97-9c0f-b9688b\n6db068&pf_rd_p=\nd6de0d9a-b966-4\ne97-9c0f-b9688b\n6db068&pf_rd_r=\n4EV0168CZ50FS73\nJMFY2&pd_rd_wg=\nKdwCo&pd_rd_r=5\n66dc259-c46f-4f\nbf-8926-889ae62\nbe022&pd_rd_i=B\n076S2WGYL&psc=1\n&ref_=pd_bap_m_\ngrid_dv_rp_0_2_\nsc"}, {"username": "Janina Yoder", "comment_text": "The hotels/airbnb usually provide hair dryers.."}, {"username": "Melissa Potenzo", "comment_text": "If you hair dryer is dual voltage, yes. Mine is and that is exactly what I used. My hair dryer worked fine there and still working fine at home."}, {"username": "Marlene Sanz-Rodriguez", "comment_text": "Yes"}, {"username": "Paul Anderson", "comment_text": "Yes. If you need another they sell them cheap in every grocery store."}, {"username": "Maria Teresa Calvaruso", "comment_text": "Yes"}, {"username": "Ibraj Andela", "comment_text": "Yes. We used the same thing in Greece this summer"}, {"username": "Kyle Wilcox", "comment_text": "I wouldn’t chance it. Just use the hotel dryer or buy a cheap one there."}]}, {"id": "2213277292404682", "text": "Does anyone know (roughly) how much a taxi would be please from Marco Polo Airport to.....? Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2213277292404682/", "likes": 0, "comments": [{"username": "Gianna Onesi", "comment_text": "How would we know that? Go on the Rome to Rio or google"}, {"username": "Grazia Mottinelli", "comment_text": "I've checked the address. Is It an hotel in Venezia Mestre? According to their website they're 14 km from the Airport ( 15 minutes by car or taxi) 🤷"}, {"username": "Elena Marcuzzo", "comment_text": "This is the website of one of the taxi services, and says around 50€, but you can check by your own! https://\nwww.radiotaxiven\nezia.com/it/\ntariffe/\ncalcola_tariffa.\nphp"}]}, {"id": "2213273419071736", "text": "Visiting Italy in January. Staying in the Amalfi area. Does anyone know how much is closed and which is the best town to stay in in winter …. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2213273419071736/", "likes": 1, "comments": [{"username": "Donna Cafora Shepard", "comment_text": "Most of the coast is pretty closed in the winter. They’re resorts. Sorrento was magical T Christmas but I’ve fallen in love with Naples. So much to see and do there! Even in the winter. I just went in March for two weeks and met my daughter. We had a blast. There’s a city under Naples you can tour, the Veiled Christ is awesome! Bono was just there! Then there’s Christmas alley, the archeological museum, we went to the Royal Palace in Naples and the one in Casserta! We went back to Pompaii. We did a street food tour that was incredible. They have Apertivo. When you order drinks they give you snacks too! We saw amazing churches! If you see one, definitely go in and look! You never know what you’re going to find. Join the Naples group and you can see all things to do with pictures. Also food is the best in Italy and one of the least expensive. Same for accommodations.\nIf you have any specific questions I’m happy to help!"}, {"username": "Wolfgang Nitsch", "comment_text": "Texas usa"}, {"username": "Gina Rovello Keenan", "comment_text": "I would rethink staying at a coastal resort area in January. Most will be closed and ferries don’t run."}]}, {"id": "2213279665737778", "text": "Thank you for the very useful feedback on an itinerary I posted a few days ago. It was so helpful. I have updated it with the feedback in mind and was wondering if people thought this version is better? It’s aआणखी long trip and I don’t want to stay in the bigger cities, but have tried to move around less and centre my stays to enable day trips. The “notes” column is ideas for what to do/see in the regions.", "link": "facebook.com/groups/1373361046396315/permalink/2213279665737778/", "likes": 35, "comments": [{"username": "Khushi Khanna", "comment_text": "Matera is magical at night once the lights come on in the Sassi. I would plan overnight there."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "From Pontedera to Pisa it’s 1/2 hour drive, I wrote a post about Pisa about one month ago with a nice walk from the station to the Tower avoiding the overloaded tourist part. I suggest an afternoon visit with an aperitivo in the bar of the Museo dell’Opera del Duomo with a stunning view.\nIn Pontedera, if you like, there is a cute little museum about Vespa motorcycles (it’s where the Vespa was born and are still made). It’s a short visit but quite funny."}, {"username": "Kate Schurink", "comment_text": "I believe 2 nights in Genoa will be enough. We stayed 2 nights but with the timing of transport to and from we had almost 3 full days and it was too much, we were bored there. All you need is an afternoon/\nevening to explore Genoa and a full day to visit Portofino (which was amazing). Although, I just remembered there are many pretty towns along the coast on the way to Portofino so with the extra full day you could visit those by train!"}, {"username": "Kate Schurink", "comment_text": "Also in Dubai you have to visit the desert!!! Go dune bashing, ride a camel and see belly dancing. You’ll find tours that combine all of these + more in one day. I lived there for 13 years and it’s the one thing we always recommend to people who ask"}, {"username": "Federico Permutti", "comment_text": "Is there a particular reason why you want/need to fly from Milan to Zurich and then take the train to Lucerne, as opposed to hopping on a train in Milan and changing somewhere on the way to Lucerne? It’s only about 3 hours by train from Milan with one change, and 4h30 from Desenzano (close to Sirmione) with two changes.\n\nOther than that, this looks like a great itinerary with plenty of stuff to see."}, {"username": "Terry Pisano", "comment_text": "Trip of my dreams! Enjoy!"}, {"username": "Brenda Keeter", "comment_text": "Awesome trip!"}, {"username": "Tracy Wrinn Mcdermott", "comment_text": "Fyi I’ve taken the Bari to Rome train. It was scheduled to take 4hrs, but took at least 6 hrs with delays. Just give yourself some extra timing on things. Your itinerary looks great! I have to agree, Matera is magical at night."}, {"username": "Chiara Normanno", "comment_text": "If you're going after the 5th of september, make sure to take a reservation at I Masanielli after visiting Reggia di Caserta, it has been the best pizza ranked for years"}, {"username": "Helen Ladkin", "comment_text": "Your trip sounds wonderful. We cruised the Suez in the opposite direction from Dubai to Barcelona. Lots of sea days which we love. Enjoy every minute."}, {"username": "Annette Mayer", "comment_text": "That is one amazing trip. How long did it take you to put it all together?"}, {"username": "Marianne Hendriks", "comment_text": "While based at Pontedera, maybe you have time to visit the Thursday morning (08.00-12.30) market in Empoli. Around 300 stalls with food but also lots of good quality cloths, winter coats, underwear, handbags , household appliances etc. San Miniato (your truffle hunting place) is beautiful! Best hairdresser ever! Good aperitivo on Sundays at Soul."}, {"username": "Jennifer Lynn Davis", "comment_text": "I love Perugia!!!! 😁 Don't forget an aperol spritz at Dempsey's!! I wish I could remember the name of the gelato place we went to that was amazing but they are all good!"}, {"username": "Pegi Fuller", "comment_text": "What an amazing trip! I hope you will come back on here when you are done and recap it for us!"}, {"username": "Fernando Leon", "comment_text": "Go to Vicenza when you are going to Verona. And if you can go to Pompey when you are in Rome"}, {"username": "Jo Tunnicliffe", "comment_text": "May I ask what time of year you are doing Ischia and Capri? Purely because depending on the weather ferries may not operate as they should, if you stayed mainland Amalfi, Positano, Sorrento you then have the choice of ferry, bus, car hire or circumvesuviana\nas alternative transport, driving on the Amalfi coast is an experience in itself but the views of it from the sea are also awesome"}, {"username": "Maria Falcone Sedgwick", "comment_text": "Keep in mind that Ischia and Capri are islands. Each time you want to go and see any of the sites you have listed you will need to take a ferry. You may want to consider shortening your time on one of those islands or both and staying on the mainland so that you can see the sites you have listed.￼ your transportation from the mainland will be much easier if you do so. Even if you stay on the coast, you can still take ferries to each of the villages along the coast, but getting there from Capri every day would be an adventure."}, {"username": "Gayle Moores", "comment_text": "The only advice I would offer is to stay in Sorrento instead of Ischia. It has good port access to Ischia,Procida and Capri so you can do daytrips.Also good access from the port to Amalfi Coast towns.It also has a train station than can take you to Naples and then transfer to the train that takes you to Caserta.Sorrent\no also has the Sita bus at the train station that runs along the Amalfi Coast.I would use this if the ferries are not running due to rough seas.\nApart from that I think your itinerary is a very good one and staying in each region for longer periods is a great way to see these places. Have a safe and wonderful journey!"}, {"username": "Ntokozo Bhiya", "comment_text": "Woaaahhh this is a very long holiday.\n\nAre you not going to be super exhausted?"}, {"username": "Layla Maryam Razavi", "comment_text": "I think this is much better. I personally for long trips like having a base and getting to know the neighborhood and leaving space for rest days and to do laundry or chill. And not having to pack so much and lug your stuff around is nice.\n\nI think this is good but did wonder about Ostuni. It’s beautiful but if you like beaches some of the most beautiful are toward otranto or even the very south tip. And water should still be warm. And lecce is highly underrated. I hate to add things to a full list but I am a beach girl and would hate to miss those.\n\nLast thing I will add - part of the joy of extended trips for me is unstructured time. If you rely on trains (which in most of Europe you should) or private car (good call far south) you will have the freedom to choose if you want to stay longer or leave sooner, if you want to skip a town on your list to hang with locals you meet in town or to go to a more unknown small village or cove where locals go. This was the joy of south Italy for me - the little enclaves and one street towns that were not in any guide book. Our lives are so scheduled and programmed as is. You’re giving yourself a gift of freedom and time and I hope you will use it. 🌺\n\nEnjoy your adventure and let us know how it goes ✨"}, {"username": "Josue Rdz-Cantu", "comment_text": "Monopoli! Check out\nPizzosteria L'isola Che Non C'è .. you won’t be disappointed 👌🏻"}, {"username": "Maureen King", "comment_text": "Oh my goodness\n\nI'm exhausted just reading this\n\nThis is so exciting just reading it though !!!!\n\nHave a fantastic trip !!!!"}, {"username": "Karen White-Zywusko", "comment_text": "Following"}, {"username": "Ivette Lugo", "comment_text": "Can you adopt me and take me with you? Enjoy it to the fullest"}, {"username": "Jean Paulroc", "comment_text": "Jean Paulroc"}, {"username": "Reivis Preston", "comment_text": "Thank you for sharing your itinerary."}, {"username": "Jerry Kiger", "comment_text": "I was like WOW how\nMany days … 7, 5, 10 … LoL sounds awesome. Please post later how went, I’m interested in your rental car experiences as I want to rent and drive Florence, Tuscany, north into Verona n Venice areas"}, {"username": "Tomas Krivanek", "comment_text": "Do you really plan to make trips to Napoli / Hereklaneum from Ischia? 🤔🤔🤔🇮🇹🇮🇹🇮🇹"}, {"username": "Tomas Krivanek", "comment_text": "And on Capri I would stay just 1 night...Amalfi recommended instead"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 8, "comments": []}, {"id": "2213279932404418", "text": "Hello from NZ! Travelling with my twin girls aged 16, we have the choice to spend a night in Bologna and a night in Venice and we have one extra night to add on to either city - go!! 🙏", "link": "facebook.com/groups/1373361046396315/permalink/2213279932404418/", "likes": 3, "comments": [{"username": "Colleen Jennings", "comment_text": "Bologna for sure! It’s a great city, lots of younger people as it has a university right in the centre. 1 night there just isn’t enough, imo."}, {"username": "Rachel Carson", "comment_text": "Bologna Jacq’s. 1 night in Venice is enough. 😘"}, {"username": "Linda Chase", "comment_text": "Venice"}, {"username": "Stacy Prestigiacomo", "comment_text": "Venice"}, {"username": "Suzanne Joslin Oliveria", "comment_text": "2 nights bologna"}, {"username": "Felicia LoCascio Whitney", "comment_text": "Bologna!"}, {"username": "Jacqs Ellen McCorkindale", "comment_text": "Thank you all xx"}, {"username": "Rosa Zordan", "comment_text": "Definitely Venice."}, {"username": "Sara Butcher", "comment_text": "For me, Venice every time! Just can’t get enough ❤️🇮🇹🇦🇺"}, {"username": "Marisa Gazzotti", "comment_text": "Bologna, then take a tour to Modena, see and visit Ferrari factory and museum visit houses are available in English...you might just wanna buy one 🤣🤣🤣"}, {"username": "Fetchin Gretchen", "comment_text": "Bologna and Venice are both great cities, and it is hard to choose between them. However, if you are traveling with your twin girls aged 16, I would recommend spending one night in Bologna and two nights in Venice.\n\nHere are my reasons:\n\nBologna is a great city for food lovers. It is known as the \"Food Capital of Italy\" and is home to many 5 star and Michelin quality restaurants. Your girls will love trying all the different pasta dishes, pizzas, and gelatos.\n\nVenice is a unique city that is built on canals. It is a great place to take a gondola ride and explore the city's many bridges and narrow streets. Your girls will love getting lost in the magic of Venice.\n\nThere are more things to do in Venice for teenagers. There are many museums, art galleries, and historical sites to visit. There are also plenty of shops and cafes where your girls can spend their time.\nIf you do decide to spend an extra night in Venice, I would recommend staying in the San Marco area. This is the most central part of the city and is close to all the major attractions.\n\nI hope this helps!"}, {"username": "Mey Brouwer", "comment_text": "Sounds awesome Jacqs, when are you guys off there? I joined this group not long ago, looking at ideas for next year. Been to Rome, Florence and Milian so looking at other options."}, {"username": "Beth Ann", "comment_text": "I would stay the extra night in Bologna or travel out to Verona"}, {"username": "Jennifer McDonnell", "comment_text": "Venice - it’s completely unique whereas wonderful as Bologna is the magic of Venice will wow the twins - not to mention the Insta updates that are usually central at that age."}, {"username": "Pamela Jones", "comment_text": "Take them to Venice - it's a forever memory!"}]}, {"id": "2213282925737452", "text": "Any suggestions on cooking classes in Rome? Thanks in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2213282925737452/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nFettuccine-Pasta\n-Making-Cooking\n-Classes-in-Rom\ne-Piazza-Navona\n/\nd511-348924P2?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "Frank Zocco", "comment_text": "Casale Alessandri Umbria. Chef Federico is great! He does classes in Umbria and it is absolutely worth it. He may still do classes in Rome. It’s worth checking out. Took my family there in June and we all had a wonderful time.\n\nhttps://\nwww.casale-aless\nandri.com/"}]}, {"id": "2213285845737160", "text": "Please no hate on this post 😜 So I have been on this page for months getting all the advice that I can for our 1st 2 week vacation in Italy. I am so ready and prepared, HOWEVER there is one thing I have not seen addressed. So I’m going to chance it and hope not too many of you give me too much grief….Here it goes… I know, I know we are in Italyआणखी for 2 weeks and WILL enjoy as much Italian food as possible, BUT what if we crave other types of food such as Mexican or Chinese/Thai or Indian. What are the Best ways to find such places in Rome, Florence or Amalfi Coast (Sorrento). If we ask our hotel concierge for suggestions, will it be rude? 😬. Just FYI, I love Italian food so much we are going to Bologna for 2.5 days JUST for the ITALIAN food. 😍❤️", "link": "facebook.com/groups/1373361046396315/permalink/2213285845737160/", "likes": 72, "comments": [{"username": "Avril Samuel", "comment_text": "https://\nwww.romeing.it/\nflorence/\nbest-internation\nal-restaurants-\nin-florence/"}, {"username": "Scott Perry", "comment_text": "Guero in Bologna for cocktails!"}, {"username": "Jenny Frank", "comment_text": "App The fork"}, {"username": "Marita Doctolero", "comment_text": "Trip advisor is a good guide 😊"}, {"username": "Caitlyn Rose Feder", "comment_text": "We are 4 weeks in and we’re craving Indian! Found amazing Indian in Florence at crown of India. But I haven’t seen many non Italian restaurants around. We had to google and specifically find one"}, {"username": "John Wilson", "comment_text": "If you need a break,The general gathering spot for backpackers from the English diaspora in European cities are the Irish Pubs. They tend to serve Americana ( cheeseburgers, nachos, club sandwiches, Bud on tap). For ethnic foods, just google it - “Chinese food in Genoa “ for example , then check the restaurant out on yelp and tripadvisor."}, {"username": "Valerie Nicole", "comment_text": "While in Rome we found this nice brewery and had some beer and a pulled pork sandwich as well as Malaysian good one day for lunch! Both yummy!"}, {"username": "Vicki Brozovich", "comment_text": "We found an Irish Pub in Rome!"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "In Florence there is a GREAT Vietnamese called Com Saigon, near Viareggio there is a super Thai called Elefante Bianco.\nIn Rome and Milan there are great Asian and African restaurants, I think also Mexicans!"}, {"username": "Kelly Rae Snider", "comment_text": "We currently live in Naples and find it very hard to find any ethnic food outside of Italian. Google Maps can point you to some but, they aren’t plentiful. Sorrento you’ll be hard pressed to find much outside of Italian."}, {"username": "Todd N Nicole Clarke", "comment_text": "No judgement we had a day catching the train and then did an e-bike tour, it was hot, and we were buggered, walked past Maccas and it was the great, simple and ice cold coke"}, {"username": "Alyson Alai", "comment_text": "In larger cities you will be able to find other types of food. Italians who travel enjoy other foods too. Google it wherever you are"}, {"username": "Ludi Lelis Hostetler", "comment_text": "The Prati neighborhood near the Vatican had several Asian restaurants."}, {"username": "Kerron Worsdell", "comment_text": "In my experience, it’s quite difficult to find non Italian restaurants in Italy."}, {"username": "Jaime Wilson", "comment_text": "Found a great Japanese restaurant in Sorrento!"}, {"username": "Pop Cha", "comment_text": "We found that's Chinese food and Ramen shops both taste were not good in Italy and very hard to find except you are in the main city such as Milano or Venezia"}, {"username": "Lucía E Melgoza", "comment_text": "I’m Mexican, last year in Florence we happened across this place. Not authentic food but good enough for a change. Also I couldn’t tell you how to get there 🤣 but there is places to eat food other than Italian 😉 (we had a big Italian meal earlier that day)"}, {"username": "Joe Pisano", "comment_text": "Joke right?"}, {"username": "Mary Beth D'Agosta", "comment_text": "I’m reading this as I sit at an all you can eat sushi spot in north Rome 😂I needed a break and this was all that was open during Ferragosto! Just google Thai food near me or whatever you’re craving and it’ll pop right up. No issues whatsoever"}, {"username": "Jenn Messina Babore", "comment_text": "Use TripAdvisor and search by cuisine."}, {"username": "Giorgio Zanichelli", "comment_text": "no authentic mexican anywhere in italy unfortunately.\nMilan has a huge historic chinese community so it's full of authentic chinese food, possibly the best in europe"}, {"username": "Rickie Vivrette Corman", "comment_text": "I was a bit under the weather and wanted something familiar. I’d been experimenting with so many different foods during the three weeks. First Spain then Rome.\n\nI ordered some Burger King to our flat with Glovo! Super good, familiar and FAST! 😋 Lol it’s just what I needed."}, {"username": "Lyn Pappas Dahm", "comment_text": "That is exactly what Hard Rock is for!! I normally cave in about my seventh day and want something totally different. I end up finding hard rock wherever I go. Roma also has other restaurants and you don’t always have to get pasta as your meal."}, {"username": "John Morrison", "comment_text": "I was at Lake Garda, I wasn't particularly looking but I saw several Japanese, some Indian and Chinese restaurants"}, {"username": "Anna N. Battaglia", "comment_text": "You will absolutely have no problem finding good restaurants of food other than Italian (Chinese, Indian, Mexican, Japanese etc.), especially in the cities. Feel free to ask the hotel for advice or search on tripadvisor, and also enjoy this aspect of Italian culture (who more and who less, we really like to experiment with different cuisines without loving the Italian one any less :))\nEnjoy your trip!"}, {"username": "Lauren-Jade Roberts", "comment_text": "There is a good mexican in Travestre rome. A nice suchi place in sorrento."}, {"username": "Rhona OConnor", "comment_text": "There are other options in most places. Italians like variety too. I was very disappointed with the food in Bologna. I thought it was a bit dumbed down for the tourists 🙄"}, {"username": "Robin Burrell", "comment_text": "TripAdvisor lists restaurants by ratings."}, {"username": "Rita Sharma", "comment_text": "Used Fork app and had Indian food one evening in Milan and received a discount as well via App"}, {"username": "Kathy Smith", "comment_text": "Enjoy your trip. I dont have any great recommendations\n, but I definitely hit a wall and enjoyed some other types of foods."}, {"username": "Colleen Jennings", "comment_text": "Hi. You’ll find all types of cuisine in Italy but mainly in larger cities. Have a look on Tripadvisor for the place you’re staying in & click on the relevant tab to find different cuisines."}, {"username": "Anne Davidson", "comment_text": "I just googled chinese and Indian restaurants in Florence for example and a few came up. I would just check out menus and try them"}, {"username": "Jan Armstrong", "comment_text": "A great Indian restaurant in Trastevere called Jaipur"}, {"username": "Fiona Mac", "comment_text": "Thia restaurant in Sorrento looked good"}, {"username": "Danielle Townsend", "comment_text": "Just google it while you are there. I type gluten free in maps and google does the rest... shows me all places with gluten free food in the area I'm at... good luck and enjoy!"}, {"username": "Kiki LaFemme", "comment_text": "Get on Uber Eats, search the food you want & go there. Or order in. I use it to find restaurants all the time."}, {"username": "Karen Blackmore", "comment_text": "Sure the hotel concierge won't think it rude. Our hotel in Milan had an Argentinian Restaurant and a Japanese restaurant next door!"}, {"username": "Etschi Bruckner", "comment_text": "Italians also like different food - no offence or problem to ask for it!"}, {"username": "Carrie Swanson", "comment_text": "Not a silly question. I’m\nSure Italy has amazing multicultural food too."}, {"username": "Bill Gillespie", "comment_text": "In the decades of going to Italy I've never seen a Maxican restaurant."}, {"username": "Jonathan Coombs", "comment_text": "Tons of different options like anywhere else in the world. Try google search before you go"}]}, {"id": "2212589605806784", "text": "Anyone travelling from Australia installed an eSim (data only)into their iPhone?\nI’m on a Telstra plan & have been advised to physically take my sim out. Is there a way of avoiding this? I was thinking that turning roaming off as well as being in “airplane mode” would eliminate telsta charges, but now I’m not so sure the eSim would work. Thoughts?!", "link": "facebook.com/groups/1373361046396315/permalink/2212589605806784/", "likes": 3, "comments": [{"username": "Marie Cunningham", "comment_text": "I'm an Android telstra girl and bought Esim from Holafly online with unlimited data and local calls.\nCan readily turn one esim over or back to telstra as I need to get text messages etc. Cheers"}, {"username": "Jaime Cleek", "comment_text": "If you’re in airplane mode your other sim won’t work"}, {"username": "Leonie Collins", "comment_text": "Just turn off mobile data and your Telstra sim will not be charged"}, {"username": "Wayne Simmonds", "comment_text": "I have an Australian Voda esim and a physical sim from the local provider, works great. Just gotta set your primary data number in settings."}, {"username": "Marcus Hiesler", "comment_text": "Turn mobile and roaming off. And use wifi everywhere. Or just use it $10 a day for telstra. We are in our 3rd week and ha e just used it and wifi where we can."}, {"username": "Rachel Wright", "comment_text": "The e-sims are super easy and you can leave your physical sim in. We have a data only and its been so nice not having to find free wifi all the time. It’s better to leave the Telstra one in, then you know you can turn it on, pay the $10 and make an emergency call if you need too. One you download the esim you turn off mobile roaming for the Telstra sim and turn on the esim."}, {"username": "Karen Maddaford", "comment_text": "Holafly we are using"}, {"username": "Louise Mch", "comment_text": "Here are screen shots. My esim is called ‘Travel’. You have to make sure you have data roaming off for your home sim and on for your esim. You still get the text message each time you move countries but it doesn’t charge you."}, {"username": "Susan Trenear", "comment_text": "Hi, we are currently in Italy in Sicily at the moment on week 4 of 5. It has been amazing. We have bought 2 phone one is with Telstra and stays on flight mode and remains in the hotel to txt and WiFi call from whatsapp (no charge fir WiFi calls) and emails. the other has a sim direct data only Europe sim. This has been great for maps and local call txt for restaurant bookings etc. This sim has a total of 30GB for 28 days. If you do turn your telstra phone on it will cost $10 per day and you only get 1GB.\n\nHope this helps."}, {"username": "Sue Simmonds", "comment_text": "get your guide.... business, hire a wifi dongle, normally can pick up from airport, I used one for 7 days in Dubai, brilliant!!"}, {"username": "Rhonda Russell", "comment_text": "I leave my phone on Flight Mode, turn off data and use free wifi. Google Maps Offline is great"}, {"username": "Ted Larson", "comment_text": "Yes…we used an Orange travel Esim…worked great throughout Europe…….very handy to have when navigating."}, {"username": "Debbie Morton", "comment_text": "I bought an Airalo sim but it just didn’t work so I’ve been paying the $10 per day with Telstra."}, {"username": "Joanne Sharam", "comment_text": "Charli"}, {"username": "Jo McManus", "comment_text": "Jan I’m here now using an eSIM. I was told to take out my SIM, but I haven’t because you get on option of ‘Primary’ (your regular number’ and your travel eSIM (which you can name what you want). I’ve just turned off my Primary. I’ve received zero texts etc because it’s turned off. So far so good!"}, {"username": "Tonina Smith", "comment_text": "Go to Telstra and ask them to embed your current physical sim, making it an esim. They will also show you how to swap between sims and how to access data yet phone calls etc."}]}, {"id": "2213288562403555", "text": "Are there any golf courses near Rome? My son-in-law wants to go golfing. Will have a day to just relax before heading to Civitavecchia for cruise.", "link": "facebook.com/groups/1373361046396315/permalink/2213288562403555/", "likes": 0, "comments": []}, {"id": "2213290265736718", "text": "Thank You for supporting and sharing all the views and suggestions.\n\nI just wanted to know that, I am going to land at the airport of Rome and will stay Italy for 2 weeks, so just wondering that where should I buy the sim cards and of what service providers.", "link": "facebook.com/groups/1373361046396315/permalink/2213290265736718/", "likes": 0, "comments": [{"username": "Kay Rendall", "comment_text": "I went to Vodaphone shop and they were very helpful. Great coverage. Use Whatsapp for overseas calls, texts."}, {"username": "Christine Ann", "comment_text": "This is my favourite, which I use every time I travel https://\netravelsim.com/\n?utm_source=unb&\nutm_medium=goog\nle-search-esim&\nutm_campaign=ES\nIM_Search-14529\n836621&gad=1&gc\nlid=Cj0KCQjwoee\nmBhCfARIsADR2QC\nsJT6syiChWcFz_P\nHdain4JSOeKXVW5\nFRjz_1s222lAxGr\n57dcWJFYaArc8EA\nLw_wcB"}, {"username": "Carrie Jaquess", "comment_text": "We've had great luck with TIM. Show them your passport and ask for the \"Travelers Plan\" (or maybe called \"Tourist Plan\"). No contract required; initial cost of $40-50 for the sim card and then $10 month for text adn phone calls, renewable as needed at the rate of $10/month. You can keep the sim card and reactivate it when you return to Italy for the same program."}]}, {"id": "2213291485736596", "text": "We live in southern California and would like to bring a small gift to thank those we spend time with in Italy - cooking in their home, etc. Welcome help with what they might appreciate from our area? TIA", "link": "facebook.com/groups/1373361046396315/permalink/2213291485736596/", "likes": 16, "comments": [{"username": "Lisa Nordby Robilliard", "comment_text": "I have noticed a few people mentioning peanut butter, I think most of the western world make their own peanut butter, I for instance prefer my local version with no additives (like sugar or preservatives or emulsifiers)"}, {"username": "Fetchin Gretchen", "comment_text": "Definitely Sees Candies! Or perhaps a fun calendar of beautiful California scenes."}, {"username": "Cathy Mammarella Melvin", "comment_text": "Dish towels and aprons were a hit for us. They also gave those to us. Make sure they are made in the USA and not China though."}, {"username": "Matthew Livio Conti", "comment_text": "Bourbon. Always. We are the only place that makes it, and even America-bashers\nrespect it."}, {"username": "Barbara Bastianini", "comment_text": "Our own Italian family likes little momentos. Something unique to the US or to the particular area you’re from. They like t shirts from our sports teams and the universities we’ve attended. They love team logo baseball hats. Native American things are appreciated, necklaces, dream catchers etc. Amish quilted pot holders. For really little kids or babies a “someone in California loves me” onesie or shirt would me nice. When they visit us they like to take back souvenir shot glasses.\n\nI honestly think it doesn’t matter what you take. They’ll appreciate the gift no matter what it is."}, {"username": "Susan Hulsey Watkins", "comment_text": "Some kitchen linens embroidered with the California poppy (state flower). In addition to some Ghirardelli goodies. Something yummy and consumable, and something that they’ll be able to use and think of you each time."}, {"username": "Mony Ortiz", "comment_text": "Sees Chocolates!"}, {"username": "Tami Sue", "comment_text": "Something local to ur area. A special candy shop. If u don't have one maybe sees candy"}, {"username": "Ibraj Andela", "comment_text": "Kitchen towels with California’s map"}, {"username": "Nancy Lewis", "comment_text": "A great California wine."}, {"username": "Alicia Cox", "comment_text": "Maple syrup is a great idea! So are pecans. Maybe candy esp if kids involved, but I mean Italian desserts plus gelato - kinda checks sweets for sure. But nuts are a great option even peanuts esp since their main nut is hazelnut."}, {"username": "Dawn Lanette McKinley", "comment_text": "I live in northern California, about an hour from San Francisco. Before I leave on a flight abroad, I purchase $20 worth of SF keychains that have real pictures of the city, ￼ not the cartoon ones. I hand these out to people that help me on my trip, i.e., the train conductor that helps me find my couchette, or a young person that points me in the right direction. They love it! I also take with me a couple ￼small music boxes shaped￼ like the cable car that plays, “I left my heart in SF.” I save these for those that really left an impression on me. I left one with a little old lady that ran their family hotel and I went back two years later and she had it proudly displayed. ￼ I also stop at the Jelly Belly Factory and purchase small bags to hand out. ￼ I love my travels in Europe, and I love making people smile by leaving them with a small token of appreciation that represents the area that I live. ￼"}, {"username": "Maria Musumeci", "comment_text": "Bring some Californian souvenir tea towels, you can never have too many! Comes in handy in the kitchen. Otherwise a souvenir wine stopper, or City Lights Tote Bag (can never have too many totes!) or even a travel book or coffee table book."}, {"username": "Zarine Batli", "comment_text": "Ca pistachios"}, {"username": "Lisa Conetta-Lee", "comment_text": "When we said we were from California, they shared that they know California for wine. They liked California wine. Can have company ship to them."}, {"username": "Nina Curone", "comment_text": "My cousin's wife wanted no-bake cheesecake box mixes! That's what they asked us to bring, and she went absolutely crazy over them!"}, {"username": "Julie Pulzone", "comment_text": "I had this same question and I asked my cousin as I was going to take Twizzlers and starburst plus peanut M&Ms. Decided to send a note and will have wine delivered from a wonderful local vineyard that they never visited. That said I think it is super nice to take a small gift for those involved with your activities- california wine would be nice - maybe dried fruits or nuts from CA. I also think you could go to the Venchi store and purchase a small box of wonderful Italian chocolates."}, {"username": "Bob Cinquini", "comment_text": "Sports shirts and hats.\nNo Dodger crap tho!!!\nLol\nSeriously stuff like Yankee hats or Raider or Cowboy stuff.\nAnd actual cowboy (real cowboys) stuff"}, {"username": "Jennie Gillham Flores", "comment_text": "I bought hand towels from Arizona. They have cactus on them and a map of AZ."}, {"username": "Jessica Peter", "comment_text": "Your local farmers market might have some unique locally made trinkets you could buy. Local and original are fun things to show off, but they should represent you because the memory they attach to it will be if the people who came and cooked with them from California (I think you said you’re from CA) and they can show it off with pride and nostalgia or at least have something that reminds them of the memories you helped make 🙂"}, {"username": "Carol Gordon", "comment_text": "I am an artist and I bring my art note cards when I travel to give as gifts."}, {"username": "Laura Torres Palomino", "comment_text": "I bought beautiful reusable shopping bags from T.J. Max. Then I precut satin ribbons and also packed thank you cards. They were easy to back lying flat in my bag. I left one at each Airbnb we stayed at. Rolled the bag up and tied with a bow."}, {"username": "Lori Moratto", "comment_text": "When I visit my family I always bring local products from my area, I.e. jams, wine, other locally produced products."}, {"username": "Betty Serrate", "comment_text": "In and Out t-shirts, Dodger 🧢 hats and Disneyland merch."}, {"username": "Diane Leesmith", "comment_text": "Some wine but that adds weight and fragility to your luggage. Trinkets of area or tea towels , something linked to Hollywood or Disney ( wine stopper with Mickey Mouse 😃). I’ve never heard of Sees so that might be good too.\nSurprised to see suggestions of M&Ms, starburst and kit-Kat which are definitely available in France (and of course UK).\nAt end of day it’s the thought and consideration that is appreciated whatever you give."}, {"username": "Cassie Collins", "comment_text": "Sees Candy or something local"}, {"username": "Bradd Fisher", "comment_text": "Christine Caudill we live in Yorba Linda. We like to do the same, and are in Italy right now. This year, we put together a small gift basket of keychains and stickers that were SoCal beach specific as well as an espresso mug from Starbucks that says “Los Angeles”. (not that we like Starbucks, but it was cute and regional), I grabbed some taffy sticks(pumpkin,\ncaramel, orange, root beer) from Sees(No chocolate because i personally like any European chocolate better than sees), and we went to the beach area (Balboa specifically) and grabbed Salt water taffy. In addition, I bought some mini Maple syrup jugs from Amazon and included this in the gift basket.\n\nFor the people we knew really well, we brought bottles of whisky that they cannot get easily in Italy. (But not easy to pack these)\nNot perfect, but it is NOT easy to figure out what to bring.\n\nI know Rosie Chiovari who lives in Northern Cal brings some Ghirardelli chocolate along with the story of its origin, which is excellent considering the Italian Heritage!"}, {"username": "Rhona OConnor", "comment_text": "Light things like Tea Towels, hand made soap, pens and keyring are good.\n- Peanut butter is widely available in Europe. - Europeans have very good quality chocolate and don't tend to like US chocolate."}, {"username": "Amanda Jordan Brainard", "comment_text": "I saw a server with pens from all different kinds of places on his apron- thought that was fun"}, {"username": "Marg Ryan", "comment_text": "I take aussie key rings, aussie calendars and pens. All of our hosts loved them."}, {"username": "Maria Timpano Borowitz", "comment_text": "I bought several 1/2 pound handpicked boxes of Sees candy.. I had them wrapped and put a little ribbon on. It’s definitely a slice of California.. it’s not extravagant but it was greatly appreciated. Enjoy your trip !"}, {"username": "Gina Romano Peralta", "comment_text": "Following"}, {"username": "Heath Conn", "comment_text": "Our Italian friends like the following when we visit:\n\nPeanut butter\nTeriyaki sauce\nBisquik / pancake / waffle mix\nMaple syrup\nBBQ sauce"}, {"username": "Suzy Palmer", "comment_text": "Southern CA here too! What a lovely idea!"}, {"username": "Cindy Pinckney Sisto", "comment_text": "T-shirts and /or baseball caps if sports fans. Just like we buy T-shirts to take home"}, {"username": "Angie Martin", "comment_text": "A supposed list of hard to find ingredients in Italy if you want to take some treats. (Idk how factual this list is)\nhttps://\nwww.google.com/\namp/s/\njennyblogs.com/\nblog/2019/2/13/\nhard-to-find-ing\nredients-in-ita\nly%3fformat=amp"}, {"username": "Joshua Pickles", "comment_text": "Peanut butter"}, {"username": "Anna Ciolino Di Bennardo", "comment_text": "They love chocolate for sure. They also love brand name items like guess, MK, Nike"}, {"username": "Diana Smith", "comment_text": "Bring some maionese, theirs is not that great! Some pancake mix, maple syrup, strawberry twizzlers & some chocolate from here…I know they have so many good ones there but they still like some from here. ( Russel Stover)."}, {"username": "JoAnn Wheeler", "comment_text": "Any kind of American Candy. Jolly Ranchers is a big hit."}, {"username": "Rachelle Ethington", "comment_text": "Most of California’s best is from NorCal, Sees, wine, sourdough bread."}, {"username": "Mary Carbone Hogan", "comment_text": "Zip lock bags"}, {"username": "Leslie Goodland", "comment_text": "Magnets"}, {"username": "Lisa DeLeo", "comment_text": "They have everything.\n\nBut… they don’t have Pecans there…\nMaybe T-shirts from California…\n\nI personally would just bring fresh flowers… or a bottle of wine from their region.\n\nWhere will you be cooking in homes during your stay?"}, {"username": "Lisa Minichini-Dowty", "comment_text": "Napkins and wash cloths😂"}, {"username": "Laurie Denoni", "comment_text": "We bought an expensive wine from the region of our relatives where we were staying. They were thrilled because they would not splurge on wine themselves"}, {"username": "Santo Finocchiaro", "comment_text": "I would bring them a good California wine. Yes California wine. Also this is what my cousin ask me to send him in Milan."}, {"username": "Laureen Garrido Jimenez", "comment_text": "Peanut butter!"}, {"username": "Peter Morgan", "comment_text": "Some small item that’s peculiar to your region in the US or something from the US would be good. If the people in Italy have children you can gift them something kids like. Their parents will appreciate that just as much\nIt doesn’t matter what it is or how much it cost\nI gave stamps and coins from Australia to children of people I met years ago and they loved them"}]}, {"id": "2213296482402763", "text": "Looking for non tourist trap Italian restaurants in Rome.\n\nSuggestions please and thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2213296482402763/", "likes": 4, "comments": [{"username": "Elena Innocenti", "comment_text": "Roman style\n- La Villetta (Via della Piramide Cestia)\n- Fattoincasa (Via del Governo vecchio)\n- Da Danilo (Via Petrarca)\n- Eggs (Via Natale del Grande)\n\nGourmet/Roman\n- Roscioli\n\nEmilian\n- Colline Emiliane (Via degli Avignonesi)\n\nFish\n- Bistrot del Mare (Via dei Banchi Nuovi)"}, {"username": "Antonia Dosik", "comment_text": "Use Gault Millau website"}, {"username": "Scott Perry", "comment_text": "Masto in Testaccio"}, {"username": "Amy Resnick Wolf", "comment_text": "Colline Emiliane is amazing! Highly recommend it"}, {"username": "Valentina Saltarelli", "comment_text": "Street food\nTrapizino (testaccio)\n\nTraditional cuisine\nFlavio al Velavevodetto\n\nPalmira ( Monteverde)"}, {"username": "Stacy Prestigiacomo", "comment_text": "El faciolaro was delicious! We went 2x"}, {"username": "Eleana Flores", "comment_text": "Depends on area you’re going to be in, but these were our top 2 from last week ☺️\nOld Bear, Giulietta Vino e Cocina"}, {"username": "Laura Nausadis Bieber", "comment_text": "Giulio Passami l’olio was fantastic! We went twice!"}, {"username": "Brian Osman", "comment_text": "Head for the back alleys and find your own"}, {"username": "Jen Milianti Schanaberger", "comment_text": "Osteria de Fortunata. Love it!!"}, {"username": "Ted Cabot", "comment_text": "second for Roscioli, also their cafe next door in the mornings for a maritozzo\nAdd Seu Pizza Illuminati to the list, one of the best pizzas in the world. Reserve ahead"}]}, {"id": "2213291439069934", "text": "Hello there I’m driving from Milan to Gordevio in Switzerland. Do I need to do anything before I go across the boarder.. thank you so much !!!", "link": "facebook.com/groups/1373361046396315/permalink/2213291439069934/", "likes": 1, "comments": [{"username": "Wendy Byrnes", "comment_text": "If there is no check point they will never know!"}, {"username": "Jack Li", "comment_text": "Need buy highway fee if your car plate is not Swissland, 40EU."}, {"username": "Kejdi Okej", "comment_text": "Need buy highway fee if you car plate is not swissland , 40eu."}]}, {"id": "2213294209069657", "text": "With a planned stike on the 29th sept. I'm wondering do trains still run at a limited scheduled or do they stop completely. Trains here in Aus run as per a public holiday. We have a day trip plannedto Lake como via train. Should we change the date or leave it.", "link": "facebook.com/groups/1373361046396315/permalink/2213294209069657/", "likes": 2, "comments": [{"username": "Lyn Evans", "comment_text": "Can I please ask where you found these dates listed to check the dates we will be there?"}, {"username": "Cheryl Kavanagh", "comment_text": "If there is a train strike how would you travel from Rome to Sorrento thanks 🙂"}, {"username": "Gina Brown", "comment_text": "I’m trying to figure this out, too. Original plan was was train from Verona to Milan that day"}, {"username": "Cynthia Cahoon", "comment_text": "I am trying to find out the same for the 2/10 and I am getting mixed reports from everyone. It’s just so confusing 🤦‍♀️"}, {"username": "Brenno Bianchi", "comment_text": "These two are not national strikes, one concern only Calabria region, the other Foggia province (both are in the South)"}]}, {"id": "2213295782402833", "text": "Hi all, does anyone have any recommendations of day tours in puglia area? We are staying in polignano a mare in September. Thanks in advance", "link": "facebook.com/groups/1373361046396315/permalink/2213295782402833/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Lecce/\nValley-Ditria-fu\nll-day-tour-Cis\nternino-Alberob\nello-and-Polign\nano-a-Mare/\nd22769-33499P3?p\nid=P00070587&mc\nid=42383&medium\n=link&medium_ve\nrsion=selector"}]}, {"id": "2213296345736110", "text": "Hi everyone 👋\nI would love to get some advise/ opinions please 🙏.\nMy husband & I will visiting Italy in mid September & super excited. Just wondering what the crowds will be like in regards to catching trains. I see a lot of stories on tick tok & other platforms & the crowds are horrendous 😳\nWill this be the case come mid Sept? What are people’s experience with public transport in particular train transportation?", "link": "facebook.com/groups/1373361046396315/permalink/2213296345736110/", "likes": 12, "comments": [{"username": "Regina-Rich Krett", "comment_text": "We love traveling by train in Italy. I buy tickets in advance with assigned seats so we can choose where on the train we will be."}, {"username": "Jeanne Eliason", "comment_text": "Thus depends on what kind of trains you are talking about. We travel in the Tuscany region on regional trains. Only trains that are busy are the ones heading to Florence and then by busy I'm not saying there is no room. When qe go between small towns like Siena or Orvieto from Sinalunga we may be the only people in our section. Kids sometimes going to school. Maybe 10. As far as big cites like Rome or Naples, yes it is crowded. If you are able to go in May or October it's better. We stick to Tuscany and Umbria regions and take the lovely completely stress free local trains. We have even helped Italian tourists when they are questioning if they are on the right bin or tract."}, {"username": "Ana Ka", "comment_text": "I think you will be fine. Just book in advance."}, {"username": "Kejdi Okej", "comment_text": "I thinky you will be fine . Just book in advance."}, {"username": "Diane Davis Lawyer", "comment_text": "There's a rail strike planned for mid-September for one day. It's scheduled for 3:00 AM on Sept 17 to 2:00 AM Sept 18. We are traveling on the 18th but at 8:30 AM. It's the Italo lines."}, {"username": "Rhona OConnor", "comment_text": "You will be fine. Get to the station about 30 mins before the train is due, then when the platform is announces on the board go straight to the platform.... You will be fine."}, {"username": "Jeanne Eliason", "comment_text": "If you are on regional trains like the ones we use you buy your tickets from a kiosk. No announcements of any kind, not even in SMN train station ( Florence ). Just a scrolling electronic board that posts your bin about 30 minutes before the train arrives. You can buy tickets in small towns from tabacco shops if they are open. I'm posting this because not everyone takes high speed trains with classes. There are no designated 1st or 2nd. All the same."}, {"username": "Christine Pinto Kulp", "comment_text": "Many times we have experienced trains and buses in Italy. People tend to cram themselves on board both- shoulder to shoulder so watch your belongings. However, on trains, if you are able to make a reservation (some local trains you can’t), you will have a seat. Be sure to arrive at the station early, go to the track as soon as you know the number and stand and be assertive about boarding! Also, note that some tracks are quite a hike from the main terminal, especially with the local trains so know where you are going in the station and give yourself plenty of time."}, {"username": "Jenny Heller Morehouse", "comment_text": "I booked most of our trains in advance. A few had assigned seats, others did not. It was intimidating at first, but gets easier. Just watch the boards. This was an EXCELLENT video we watched beforehand. Clarified a lot and made the experience more smooth.\nhttps://\nyoutu.be/\n0KSKiVjng8o"}, {"username": "Wendy Spano Bracco", "comment_text": "How can anyone know what is going to happen mid September? Travel is at an all time high this year. Summer is always the worst. Hopefully the crowds of summer will lessen. Just plan accordingly. We are taking a train September 8th from Florence to Rome and booked ahead."}, {"username": "Teresa Whitehouse", "comment_text": "It shouldn't be too bad in September, the holidays are over and most locals are back to work and school. There are also a lot less foreign tourists about, specially down here in the south. A perfect time to visit actually."}, {"username": "Bea Kuckens", "comment_text": "We have taken trains all over Western Europe, including Italy. It can be crowded at the larger stations even during \"shoulder season\" and people can be rude, but it always works out. Travel light (long platforms, steps into coaches). Smaller / older stations may not have elevator or even working escalator. It's a wonderful way to travel. Book in advance, select your seat to have a full window and be forward facing. Some coaches have two levels of seating - although the view is great from the second level, hauling our luggage up a tight, curved staircase wasn't fun. A great source of info is a website called The Man in Seat 61. Enjoy your trip!"}, {"username": "Roletta Ng", "comment_text": "We took the train from Rome to Florence today and it was very easy to find our way. We pre-booked tickets in business class and had assigned seats. Very impressed by how smooth our journey was, it was our first time and we were a bit apprehensive about how it it would."}, {"username": "Sara Butcher", "comment_text": "Last trip I travelled in Sept and used trains all the time. Only train to Paris was full. Stations weren’t crowded except for La Spezia for the regional train. ❤️🇮🇹🇦🇺"}, {"username": "Valerie Collanton", "comment_text": "It will be crowded. But it is not so bad. Stand near the departure board so you can see on which platform your train arrives. As soon as it is posted, head there. You will be fine."}, {"username": "Rosa Zordan", "comment_text": "Still busy but take a breath and just go with the flow. Remember you're on holiday and have all day to get there or hells bells even the next day!"}]}, {"id": "2213296895736055", "text": "Thank you for your suggestions Florence it is. Now ideas please not on the tourist trail", "link": "facebook.com/groups/1373361046396315/permalink/2213296895736055/", "likes": 16, "comments": [{"username": "Jeanne Eliason", "comment_text": "What do you mean by tourist trail?"}, {"username": "Debra Quinney", "comment_text": "Everything is on the tourist trail"}, {"username": "Fetchin Gretchen", "comment_text": "some ideas for things to do in Florence that are off the beaten path:\n\nVisit the Boboli Gardens: These beautiful gardens are located behind the Pitti Palace and are a great place to escape the crowds. You can wander through the gardens, admire the fountains and statues, and enjoy the views of the city.\n\nTake a walk across the Ponte Vecchio: This iconic bridge is one of the most popular tourist destinations in Florence, but it's worth visiting even if you're trying to avoid the crowds. You can cross the bridge and admire the views of the Arno River, or stop to shop at one of the many jewelry stores. If you don't want to shop--visit the bridge early am before the tourists come.\n\nPonte Vecchio Florence\nExplore the Oltrarno neighborhood: This district is located on the other side of the Arno River and is a great place to find hidden gems. There are small shops, cafes, and restaurants, and it's a great place to get away from the crowds.\n\nVisit the San Lorenzo market. This market is a great place to find fresh produce, meats, cheeses, and other local products. It's a great place to experience the local culture and to do some souvenir shopping.\n\nTake a cooking class: There are many cooking classes offered in Florence, and they're a great way to learn about Italian cuisine and to try your hand at making some classic dishes. Find on airbnb experiences or getyourguide app.\n\nVisit a museum off the beaten path: There are many museums in Florence that are not as popular as the Uffizi or the Accademia. The Bargello Museum, the Museum of the History of Science, and the Museum of Musical Instruments are just a few examples."}, {"username": "Dr-Jon Warnecke", "comment_text": "Fiesole, Lucca"}, {"username": "Nancy Kirby", "comment_text": "You must see touristy things there- if you don’t want to miss much of what it has to offer. However, add on other things too- Boboli gardens, San Miniato, walking the piazzas in the evening and ppl watching, leather school in Santa Croce, Bargello"}, {"username": "Dan Carr", "comment_text": "If you want true authentic Italian culture…I recommend booking an Agriturismo.\n\nhttps://\nwww.agriturismo.\nnet/"}, {"username": "Cheryl Gorfinkle", "comment_text": "Rick Steves book"}, {"username": "Nancy Kirby", "comment_text": "Oh and go eat your way through central market"}, {"username": "Frank A Colacino", "comment_text": "Day trip to Parma!"}, {"username": "Ana Ka", "comment_text": "I would go to Sovana, Etruscan sunken roads, pitigliano, arezzo, monte oliveto maggiore, barga…. Got all these recommendations\nfrom appyguide and really enjoyed them. Haven’t yet seen all, so still need to go back 😅… https://\nwww.getyourguide\n.com/\nsiena-l435/\ntuscany-discover\n-hidden-gems-wi\nth-world-s-top-\nexperts-t484689\n/"}, {"username": "Ana Ka", "comment_text": "And for Florence off the beaten path: magi chapel, san marco museum, brancacci chapel, cloister of the scalzo, last supper in sant’appolonia ❤️"}, {"username": "Bill Elias", "comment_text": "Literally all of Florence is common tourist track."}, {"username": "Jeff Mayernik", "comment_text": "This is great, thanks. Saved it for reference since we're spending June next year in Florence. Well, probably 'near' Florence because I'm a cheap SOB and I'd rather ride some buses than pay downtown rental prices 🤣"}, {"username": "Russell Weidner", "comment_text": "Explore the neighborhoods on foot, go into the small restaurants and eateries. Absorbing it all."}, {"username": "Maria Giordano", "comment_text": "Florence itself is a must imo - the Accademia & Uffizi for certain. I highly recommend heading to a few hilltowns & a winery or two as well."}, {"username": "Bronwen Jones", "comment_text": "Florence is very pretty but very touristy. We loved the food market (Mercado?) most."}, {"username": "Diana Granado", "comment_text": "Well… last time I stayed in hotel and there were some people in a balloon"}, {"username": "Laura Uribe", "comment_text": "I don’t see how you can do non tourist things in Florence. It’s an amazing town but you need to accept that there is no such thing as non tourist these days."}, {"username": "John Gallo", "comment_text": "Okay go to Niccolò Machiavelli House in San Casciano\nIts 12 miles from Florence\nBeautiful Vineyard and lanscape"}, {"username": "Tricia Teys", "comment_text": "Pitigliano is a really gorgeous town"}, {"username": "Missy Kupillas", "comment_text": "There’s a wonderful outdoor market with amazing leather goods. It’s called the San Lorenzo Market. We got some lovely things there. ￼ Google says it’s hours are 7-2 Mon thru Sat but I would def do my research if interested. Hope this helps, Italian leather is beautiful."}, {"username": "Mack Sperling", "comment_text": "The Vasari Corridor if it is open. https://\nwww.uffizi.it/\nen/\ncorridoio-vasari\nano"}, {"username": "John Gallo", "comment_text": "John Gallo"}, {"username": "Maggie West Penix", "comment_text": "Cappucinnos at Caffe Caffè del Teatro Niccolini. Amazing! (Tell Andrea Maggie said hi!)\nSpritz at Caffè Gilli.\nDelicious lunch or aperitivo at Formaggioteca Terroir.\nMuseo degli Innocenti.\nScuola del Cuoio (school of leather)"}, {"username": "Gillian O'Callaghan", "comment_text": "You're a tourist in a large Italian city. There'll be tourists at local markets and possibly football matches etc. How about renting a car and getting out into the suburbs, villages and smaller towns?"}, {"username": "Milt Lawhorn", "comment_text": "I don’t want to be a wet blanket but there are some pretty cool touristy things to do in Florence, don’t miss out because you have some aversion to appearing like a tourist, after all that’s exactly what you will be."}, {"username": "Stephen Webster", "comment_text": "Yes I agree Florence!"}, {"username": "Ursula Kenny", "comment_text": "Lucca a short train ride from florence.\nloved it 😍"}]}, {"id": "2213298819069196", "text": "We’re from Australia. Any tips on the best way to withdraw from the ATM in Italy? I recall reading that there’s a difference in what method you should use to get a better deal on exchange but can’t for the life of me remember. 🤔", "link": "facebook.com/groups/1373361046396315/permalink/2213298819069196/", "likes": 19, "comments": [{"username": "Sandra Timi", "comment_text": "Exchange very bad at the moment. We enquired just for interest at a booth in Milano, for every $1.00aust=€0.48\n, CBA travel card got €0.56. Transfer better.\nUnless you have someone in Italy who can go into the bank for you to do, suggest bring your own cash or use card of some sort."}, {"username": "Leanne Bingle", "comment_text": "Elizabeth Colleen Fowler"}, {"username": "Kathy Whiting", "comment_text": "From Australia been in Italy for a few months, use bank ATM's and initially not accepting conversion, however when we checked the conversion rate with our bank in the last couple of weeks, often the conversion at the ATM better. We just have a debit card with Great Southern Bank who reimburse any fees we are charged, so easy anywhere across Europe."}, {"username": "Susan Trenear", "comment_text": "Hi we are currently in Sicily and also from Australia 🇦🇺. Because of this forum I investigated a WISE Account and honestly the best thing I could have done. They offer the highest exchange rates and cost $0 when using bank ATM (BNL/BNP or Unicredit) or it is easy to use eftpos ( we never tap, insert to ensure the amount is correct) I have tried Commonwealth travel cards, HSBC and the WISE card runs rings around them. Easy to use and keep a track of spending."}, {"username": "Rhonda Russell", "comment_text": "I have a St George Worldwide Wallet card. You can watch the rate and load it when you want. It also has no fees attached."}, {"username": "Pamela Jones", "comment_text": "Kiwi here. Use the ATM's at the banks only. They are mostly outside & you present your credit card at the door it unlocks , you go thru & it locks behind you. That keeps you safe. Then use your credit card in the machine. When it asks you if u want to use the local exchange rate - say no ( or cancel) then withdraw cash. The local exchange adds another percentagge on top."}, {"username": "Anthony Campanella", "comment_text": "I have an American bank account and have found that Monte Paschi banks are the best (no service charge, no international fee). My bank charges 1% to use them. Monte Paschi is everywhere in Italy."}, {"username": "Sandy Michelle Duggan", "comment_text": "I've just come back, we used a westpac travel wallet card and transferred aus dollars to euros and just withdraw as normal from ATMS."}, {"username": "Jodi Nichole Toohey", "comment_text": "Jodie Jeans - we got the Wise card"}, {"username": "Suzanne McAleese", "comment_text": "Has anyone used the AirNZ one smart card in Italy"}, {"username": "Wayne Beecher", "comment_text": "We just returned from 4 weeks in Italy. We used an Australia Post Travelcard for everything. Very easy to reload from your main bank account. Did not have any trouble tapping and purchasing anywhere and also withdrawing from an ATM anywhere. My wife and I had a card each. A couple of times the tap function didnt work but the insert function did."}, {"username": "Penny Hogan", "comment_text": "Hi all! Also from Australia and travelling with 2 other couples. Thinking of getting a Wise card so we can all deposit money onto it and pool our money. Does anyone know if money can be deposited from different accounts or it has to be set up to only come from the one account/\naccount holder? Thanks everyone. First time over there and we are very excited!!"}, {"username": "Trevor Brown", "comment_text": "My advice is get yourself a travel money card and load it up with euros before you leave. The card is accepted everywhere and is much more practical than carrying cash. We used very little cash when in Italy."}, {"username": "Trevor Brown", "comment_text": "A better deal may mean only a few cents here and there so don’t worry about it."}, {"username": "Tracey Turner", "comment_text": "Travelling to Italy next week with a Wise card. When using the card do you press Credit or Savings? 🇮🇹"}, {"username": "Judith Tobin", "comment_text": "A Wise card works well but there are other products on the market in Australia where you can withdraw without foreign currency conversion fees. You may of course have to pay an ATM fee but that depends on the actual bank providing the ATM. I’m heading to Italy soon and intend to mainly tap or use a fed free credit card."}, {"username": "Rosslyn Patience", "comment_text": "I have a Wise card and my husband has a U Bank card. Just heard this morning the Aussie $ has dropped again."}, {"username": "Michelle McCormack", "comment_text": "Is the UP card just as good because I have just opened an account with them for overseas ? Maybe I should have opened a wise account ?"}, {"username": "Graham Sherlock", "comment_text": "Ask you bank in Australia which ATM in Italy is the best for you to use and any fees involved. I was paying 3 euro per withdrawal in Italy, despite my bank BankSA telling me it would be free (it may have been the italian fee though I guess) anyway 3 euro was fine and the exchange rate was good. But best to set up a separate account in Oz with your bank that you can transfer dollars into online then convert them in your account to euros and just use a debit card linked to that new account to pay for stuff if you don't want to use a CC. Bring a spare card too in case you lose your primary debit card."}, {"username": "Saravanan Alex", "comment_text": "https://\nwise.com/invite/\nahpc/\nsaravanana90"}, {"username": "Marie Goff", "comment_text": "Im from Oz and travelling October could you please advise how do you get a wise card ?"}, {"username": "Clare D Indi", "comment_text": "Using revolut card. I compared wise and revolut seems a bit better for us. Different levels free to join very easy. If you feel you need a lot of cash withdrawals they have an option for that. Can add friends through a link and you get a cash bonus."}, {"username": "Maria Musumeci", "comment_text": "We took €1000 Euro with us, that was exchanged in Australia & used our new credit card only, for a 4 week trip to Italy. We used online banking to transfer the amount used daily into Cc at the end of the day. The rate at the time was .63/.65 Euro to our dollar. But the bank exchanged our transactions at .68 with no fees, so we were better off using the Cc as better rates, not that it's a huge saving, but better than nothing!\nCan't believe the exchange is .59 currently 😱"}, {"username": "Donna Dillon", "comment_text": "I have used and will be using again the CBA travel money card. Load with EURO and make withdrawals or tap."}, {"username": "Caroline Waters", "comment_text": "Withdraw in Euros. Only go to banks. Not street ATM's the charges are too high"}, {"username": "Rene van Dyk", "comment_text": "Just used my normal cards in the many bank ATM available. Withdraw a few days budget in Euros and that has worked for the past 12 years"}, {"username": "Carol Fayers", "comment_text": "If you have a Travelex card they will continue to charge you a monthly fee while it’s not in use. I forgot to close mine in 2019 and en"}, {"username": "Julia Muller", "comment_text": "Just ensure you use the ATMs at the big banks, not the little random ones you often find in piazzas etc where they rip you off blind!"}, {"username": "Tilla Olivier", "comment_text": "Use a Cash Passport instead of a Credit Card. No commission and much safer. Just draw as usual."}, {"username": "Jason Lee", "comment_text": "Melissa Lee"}, {"username": "Judi Lynn Durham", "comment_text": "Judi Lynn Durham"}, {"username": "Sara Butcher", "comment_text": "I organised a Travelex card and transferred AUD to euro before I left (transferred when exchange was up) and then withdrew in euro from euro. Worked well and I could transfer extra dollars while away ❤️🇮🇹🇦🇺"}, {"username": "Meredith Schultz", "comment_text": "Only ever withdraw in Euros. Don’t opt to have the transaction converted to AUD when prompted - that exchange rate won’t be in your favour."}, {"username": "Mark Horrocks", "comment_text": "Use a bank atm not a commercial atm on the street."}, {"username": "Mark Horrocks", "comment_text": "Will save you around 4 €"}, {"username": "David Silverstone", "comment_text": "We setup a travel card with Commonwealth and preloaded with euro's. It's a debit card that you can use at any ATM to withdraw cash in euro's without any conversion charges. Also top it up via internet banking app."}, {"username": "Rebecca Yeoh", "comment_text": "Fellow Aussie 🙋🏻‍♀️ I got a WISE card which is a multi currency bank card. It was brilliant, you convert AUD to Euro in an app and can have several accounts for different currencies (so you don’t get hit with extra fees). When you need more you top it up from your AU account. I was receiving transfers within minutes from my bank. I also liked that you could “freeze card” via the app in case something happened to the physical card. You just withdraw from an ATM like normal. Word of advice though, make sure you have a back up card available, or Apple Pay. My mum had her card eaten by a bank ATM. It was a Saturday, bank was closed, so we could do nothing about it!"}, {"username": "Elisabeth HA", "comment_text": "If there’s a choice always say local currency on ATMs or EFTPOS"}, {"username": "Rhona OConnor", "comment_text": "It's not difficult... Just some ATM machines charge a fee and give a bad rate. They will all give you Euros. Use a debit card that does not charge cross boarder fees per transaction."}, {"username": "Maria O'Callaghan", "comment_text": "I’ll be using a debit card from my Macquarie Premium Savings account. No international transaction fees & great exchange rate. It’s an at call account & pays 4.9% int. Worth checking out."}, {"username": "Judy Ipper Mulholland", "comment_text": "As said above, only use bank atms or you’ll pay huge ATM fees. We’re using WISE for almost everything. 👌🏻"}, {"username": "Dunia Aldyni", "comment_text": "I used travel money oz card and add the app on my phone to transfer money from my account to the travel money oz account was good 👍 and also my debit card with NAB bank I setting it on travel 👍it works great"}, {"username": "Helen Ostler", "comment_text": "Always ‘decline conversion’"}, {"username": "Costero Home", "comment_text": "Use WISE, https://\nwise.com/"}, {"username": "Mitch Craig", "comment_text": "Alison Craig"}]}, {"id": "2213297362402675", "text": "Ok this question is about Cell phone, cellular data, and vpn needs for Italy.\n\nWe have AT&T and I phones.\nI plan to call my carrier about travel plans. I hear people talk about Italy SIM cards but I don’t even know if my phone uses a sim.\nHas anybody experience with AT&T and I phoned abroad? Is there something I need to purchase to prepare? Also should I download a vpn browser or will safari work ok on my phone?\nAny advice is welcome!", "link": "facebook.com/groups/1373361046396315/permalink/2213297362402675/", "likes": 7, "comments": [{"username": "Holly Puglia", "comment_text": "It’s $10/day, $5/day for each additional line for a daily international plan with AT&T. They will charge you for a maximum of 10 days per month. You can always turn your phone on airplane mode if you don’t want to be charged for the day. Personally, if it’s just for vacation I would just do the daily option. Your phone should automatically switch to the international daily rate when you leave the country. You will get a text message."}, {"username": "Virginia Lane", "comment_text": "Your phone will need to be unlocked, if you want to buy a SIM card or use esim. I use Nordvpn and it’s easy to set up on iPhone. You mostly need a vpn, if you are going to use WiFi."}, {"username": "Amanda Molinelli DuAime", "comment_text": "Att charges 10$ a day for phone. I’ve heard the 2nd phone is only 5 but we never activated my husbands over there since we were together 24/7. They also only charge for 10 days in a billing cycle. We were there for 16 and only got charged for 10 days."}, {"username": "Holly Clifton", "comment_text": "I just put an international plan on my phone and it manages the cost to a known plan cost."}, {"username": "Serna Teixeira", "comment_text": "AT&T international plan works very well. You would have the same plan in Europe that you have at home. You are charged $10/day for the first phone and $5/day for the second phone - capped at 10 days and then it is free. The 10 days is per billing cycle, so if you billing cycle is the 1st to the 25th and you are overseas for 20 of those days, you pay for 10 of them=max of $100 for one phone or $150 for two. You used both our phones everyday all day for $150. But watch your billing cycle. If it falls in the middle of your trip, you will pay for more than 10 days."}, {"username": "Corey Ringa", "comment_text": "We were just in Italy last week and have AT&T. We added the international plan on our phones. First phone is $10 per day, each other phone on the same plan is $5 a day. If you don’t use it daily then they won’t charge you and the max they will charge is for 10 days. The service worked great there."}, {"username": "Dann Hrusch", "comment_text": "With Verizon, you just go on-line and active the international plan. I think it's like $10 per day that you use it. Nothing extra to buy or do with your phone aside from change a few settings. We've used in multiple countries with no issues other than spotty coverage once in a while. Almost positive AT&T works the same way."}, {"username": "Mary Ann Brown", "comment_text": "You can use Airalo for data and what’s app to get in touch with family and friends"}, {"username": "Ken Franz", "comment_text": "Plenty pleased with the Maya mobile eSim we got. One iPhone and one Android, both have worked vreat"}, {"username": "Annette Mayer", "comment_text": "I just use WhatAppto txt and call. I get wifi by going to a Cafe or I'm my room.\nIf you want to use a Sim card, make sure you have an unlocked phone"}, {"username": "Holly Taylor", "comment_text": "iPhone 14 has esim. I use Airalo to buy eSims when I travel. Has worked great so far"}, {"username": "Ria White", "comment_text": "Or get yourself over to easySim.global and buy a data eSim and turn on your hot spot. It’s really easy to use, and great value (especially as they are offering 20% off at the moment). Unlike many of these products, they use all the major networks in most countries so have brilliant coverage"}, {"username": "Karen Curci", "comment_text": "We have AT&T and I can verify what's being said here about the international plan. Also, you can download WhatsApp and make your friends and family do that, too. It's free to use."}, {"username": "Ray Rovello", "comment_text": "I think last year I upgraded for 100$ for the month and discontinued it when I arrived home"}, {"username": "Merry Sterling", "comment_text": "I have T Mobile and purchased the International Plan for one month. It was $50. Phone, text, data. No issues or overages.\nItaly, Spain, France, and Greece"}, {"username": "Vickie Marie", "comment_text": "I have AT&T and my phone worked beautifully.\nThose in our group, with various esims, had difficulties."}, {"username": "Donna Stevens", "comment_text": "I have an iPhone and the international plan on att. No problems"}, {"username": "Anna Ciolino Di Bennardo", "comment_text": "We have Verizon and my daughter went to Italy, and I called Verizon and they charge me $100 for 30 days unlimited everything"}, {"username": "Pamela Martin", "comment_text": "Do the international plan. It maxes out at $100 for your line per billing period. We have done three international trips this year both have iPhones and AT &T. International plan worked fantastically"}, {"username": "Miyuki Kanno Paul", "comment_text": "I have ATT and has no problems. International Day Pass is $10 a day. If you plan on purchasing a SIM, you must request ATT to unlock your iPhone prior to departure. The new SIM you purchase locally will have a new Italian phone number"}, {"username": "Sandy Burton", "comment_text": "My daughter and I have Att iPhones and we just added international coverage when we went so we could use all our features and texting. It’s an extra $10 a day for the first line, $5 for the second line. Not bad for full use of our phones."}, {"username": "Linda West", "comment_text": "AT&T international plan\n$10 per day for one phone in the plan, $5 per day for the rest of the phones on the same plan. I think the MAX for each phone is $100 per month. Just activate the international plan and it only charges if u use it"}, {"username": "Charlotte Perry Henrichs", "comment_text": "Yes, just returned from England. AT&T charges $10 a day for the first ten days, I believe. Per device. WiFi usage is free. They will send u a message as soon as you get there."}, {"username": "Diane Rabinowitz", "comment_text": "AT&T was great for traveling in Italy! I had a different carrier this summer and got an Italian SIM card that was a big pain! I’m getting AT&T again before next international travel. (I accrued no additional charges in my 2weeks in Italy in 2022 with AT&T)."}, {"username": "Melissa Nelson", "comment_text": "I called AT&T before I left and they gave me all the info I needed. You can purchase a plan specifically for traveling to other countries. Don’t forget you will need a special plug-in for use in Europe in order to charge your phone."}, {"username": "Lee Treacy", "comment_text": "I always just get a local sim in the country I travel to.\niPhones have sims. Swap it out and use the local sim - way cheaper than global roaming. Swap it back when on your homeward flight.\nYou’ll have your local number not your home country number .. but will still be able to use all the usual apps in your phone and safari."}, {"username": "Valerie Cummings", "comment_text": "Why not just use wifi and either Telegram or WhatsApp"}, {"username": "Laura Brode George", "comment_text": "If your phone is unlocked and you have an esim, you can get an esim from Airalo to use overseas. Super easy and inexpensive."}, {"username": "Blanche Glenn Welborn", "comment_text": "AT & T has $10 a day international plan. Covers all phones on your plan. Once you set it up it automatically works anytime you travel abroad. When I land in another country it just sends me a text saying you are now using the plan. Very simple."}, {"username": "Randy Karli", "comment_text": "Samsung S21 Ultra"}, {"username": "Yolanda Ann Stout", "comment_text": "We were just in Italy, May of this year. Our phones worked fine. I did not even call prior to leaving."}, {"username": "Pam Kimak", "comment_text": "You could call or visit At&T for information regarding your trip and service...I believe it's a $10 a day charge."}, {"username": "Santo Finocchiaro", "comment_text": "We had issues with our Verizon phones. Might be cheaper to buy a prepaid phone in itlay to use."}, {"username": "Peggy Fisher", "comment_text": "Whatsapp is free and you can call and text everyone. I'm from the USA I know it works there."}, {"username": "Christina Beck", "comment_text": "AT&T has an international day pass. It’s $10 a day and mimics your current plan. ￼"}, {"username": "Colleen Dawson", "comment_text": "I think AT&T is similar to Verizon, we have Verizon and works very well even in the mountains. International plan is $10 per day or if you go longer there’s a $100 month plan, but look at your billing cycle as it coincides with it. Also we get 12 days free per year."}, {"username": "Brice Blosser", "comment_text": "We have AT&T. Just use your current provider. It’s like $10 a day but up to a certain amount per billing cycle. If you have a newer phone, with eSIM they might not be able to program it. Then you’ve wasted time trying. Better to just use what you have and go tour / vacation. We did not have any issues, from the north to to the south. It worked great."}, {"username": "Heather Kearney", "comment_text": "Depends on the type of iPhone. If you have an iPhone 14, this only uses eSIM"}, {"username": "Jessica Stewart", "comment_text": "Go to your service provider pay for an international plan and yes you should be able to use whatever web browser you normally use."}, {"username": "Evie Gee", "comment_text": "I've always used my ATT phone with the international plan ($10/day) without issue."}, {"username": "Allan Olexa", "comment_text": "We have used and been very satisfied with Verizon International plans. But, this time, we decided to save quite a bit by buying an Orange Travel esim. It’s downloaded like an app. There are quite a few data/phone minutes plans available. We just turned them on arriving in Europe…easy to do on the Connections screen. The sims worked great."}, {"username": "Kejdi Okej", "comment_text": "Gi to your service provider pay for an international plan and yes you should be able to use whatever web browser you normally use."}, {"username": "Tracy Young", "comment_text": "AT&T works best for international plans and service signal. This is what I have for work travel with an iPhone. Call in advance and tell them that you want an international plan. Once there, you will get a text and it’s active as soon as you use it. My family has Verizon and same process and has always worked fine everywhere around Italy and Europe. Only international service issues have been in Australia and remote areas."}, {"username": "Cindy Gallen Barton", "comment_text": "Att has an international plan. $10 per day and I think they have a max number of days charged in a billing cycle. You need to add the int calling feature to your plan. It can all be done online. I used and was fine."}, {"username": "Bailey Smola", "comment_text": "The last time I was in Europe, my phone didn’t work at all, even with a Verizon international plan, but they still charged me astronomical roaming fees. If I could go back in time, I would’ve either bought a SIM card out there, or a pre-paid phone."}, {"username": "Ruth Hackert", "comment_text": "AT&T is $10 a day , if you use it.\nI switched to TMOBILE unlimited text & data & .25 cents a minute for calls."}, {"username": "Erica Kleinberg Tiomno", "comment_text": "I have ATT&T. I was able to use my phone for $10 per day for an international plan. I think the most you are charged is $100 for 10 days."}, {"username": "Sherri Leis Dillavou", "comment_text": "I just text. It’s free. No problem. I can say what I want in text"}, {"username": "Charlie Charnigo", "comment_text": "Went to Ireland last year. Me and my 2 college student kids kept our Verizon phones in airplane mode and just used WiFi. Everyplace has it. It was never an issue. We would just log in at the pub or at the B&B. You can download Google Maps and Translate to use offline. Worked like a charm."}, {"username": "Donna Hartsell", "comment_text": "I’m in Italy now, I use the International Day Plan with ATT, and I use my VPN using WiFi at the hotel, works great!"}]}]