[{"id": "2206020983130313", "text": "Hi! I am just starting the planning phase for an Italy trip. How is the weather in mid to late October? The ultimate for me would be Rome, the Amalfi coast, and some other sites. I’m not a beachgoer, so going to the beach is not a dealbreaker. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2206020983130313/", "likes": 8, "comments": [{"username": "Graham Sherlock", "comment_text": "Perfect time to travel"}, {"username": "Linnea Kay Wammack", "comment_text": "You can google average temperatures by month."}, {"username": "Jenny Payne", "comment_text": "Last year when I was in Italy October was great warm & im going again this year so my clothes are all cotton, linen, silk with an umbrella & cardigan. It has changed as I have been going for 16 years as I stayed 3 months and always left mid October & it was freezing 🌻"}, {"username": "Laura DeCicco", "comment_text": "Perfect weather!"}, {"username": "Cindy Gallen Barton", "comment_text": "Went to Rome and Amalfi last year at that time. 70 and sunny for 12 days"}, {"username": "Roland Trego", "comment_text": "The first half of October is better than the second half. The rainy season typically kicks in towards the end of the month."}, {"username": "Steve Grossman", "comment_text": "I have been there many, many times in October. And the weather has been good for me. With global warming who knows that may change a little. I think you will be safe. Glad you're going to amalfi. It's our favorite place"}, {"username": "Philip Curnow", "comment_text": "This post seems to be a wind up. Rome is always Rome so go. You might get lucky for Amalfi and find an Indian summer. Frankly, what are you after for a vacation?"}]}, {"id": "2206054053127006", "text": "My husband and our 4 kids are planing a 6day road trip in October to Florence (1day) and Rome (3days). Mind that we live 5h away from Florence 🙂 So my question is did anyone stay outside of both cities, because the acomodations are cheaper and we have a car. Any suggestions? And how is the parking in the centre or is it better and is it easy to go to the centre by public transport? Thay you for your help 🙂", "link": "facebook.com/groups/1373361046396315/permalink/2206054053127006/", "likes": 0, "comments": []}, {"id": "2206058953126516", "text": "Hi guys 😊 I wanna solo travel with my car and my two doggies in north Italy for 2 to 3 weeks in September. I would like to go to the 5 lands, lac guarda, lac Iseo, Bergamo, Lecco, lac d’orta, then come back to Livorno. Please, any tips for a solo traveler ? What are your favorite place to visit in this area of Italy ? Many thanks 🌸", "link": "facebook.com/groups/1373361046396315/permalink/2206058953126516/", "likes": 0, "comments": [{"username": "Alessandro Iannelli", "comment_text": "hi. i assume you come from within the european union, otherwise it would be complicated to let the dogs into the country. if it's the case, so if you indeed come from a country in the u.e., you need proof of vaccination against rabies (and said vaccination has to be valid of course and done over 21 days prior to coming into the country), and proof that the dogs are microchipped. as for tips, if you travel with the canines i would prefer places in the nature so of course the lakes are a great option. also, cool places, like the mountains, dolomites are renown for their beauty."}, {"username": "Md Anisar Rahman", "comment_text": "dc"}]}, {"id": "2206108543121557", "text": "Whats the fastest way to get from Venice to manarola cinque terre", "link": "facebook.com/groups/1373361046396315/permalink/2206108543121557/", "likes": 8, "comments": [{"username": "Yuri Budilov", "comment_text": "go to Google Maps and select the mode of transport there, car or train/bus. You can also fly from Venice to Genova and take a train or rental car from Genova"}, {"username": "Enzo Teutonico", "comment_text": "Really fast gondola."}, {"username": "Jennifer Cummings", "comment_text": "Train"}, {"username": "Ryan Hacon", "comment_text": "Walking 🚶‍♀️"}, {"username": "Philip Curnow", "comment_text": "Obviously a NCC chauffeur driven Mercedes"}, {"username": "Carlos Kinosian", "comment_text": "Train"}, {"username": "Dawn Baxter", "comment_text": "Fast train to Florence then to cinque Terre -"}, {"username": "Joe Guzzi", "comment_text": "Motorcycle"}, {"username": "Mike Parrent", "comment_text": "Teleport"}, {"username": "Laura DeCicco", "comment_text": "Fast train. Venice to Florence to La Spezia to Cinque Terre. Rome2rio app is helpful"}, {"username": "Rino Maffeo", "comment_text": "Take the Nina Pinta or Santa Maria around the boot.. it’s a little longer but spectacular..😏🤣 but seriously fasted is a helicopter ..!"}, {"username": "Gary W Anderson", "comment_text": "Train is my guess"}, {"username": "Debbie Milne Jenkins", "comment_text": "Took this route in 2019 - easy train ride as Laura described. Rome2Rio is a great resource."}, {"username": "John Wilson", "comment_text": "Private jet. But the train is fairly quick"}, {"username": "Ian Beyer", "comment_text": "I would imagine teleportation would be the fastest, but it’s somewhat impractical 😁"}, {"username": "Alex M Moretti", "comment_text": "Fun way, Rent a car. See the sites.\nWe did, was fantastic 5 days."}, {"username": "Andy Lucas", "comment_text": "🚁"}, {"username": "Sande Ricci", "comment_text": "4 hrs 7 minutes to Genoa then train to Cinque Terre"}]}, {"id": "2206133463119065", "text": "Hello everyone,\n\nDo you have any recommendations for an accommodation in Venice?", "link": "facebook.com/groups/1373361046396315/permalink/2206133463119065/", "likes": 0, "comments": [{"username": "Billie Begley", "comment_text": "Look up Hotel Olimpia. Have stayed there 4 times. Great hotel. Great Breakfast and ideal location."}, {"username": "Frances Scannapieco", "comment_text": "Hotel Al Ponte Antico, Venezia. On the Grand Canal. Fabulous small boutique hotel."}, {"username": "Annette Mayer", "comment_text": "We like airbnbs. It's home and I can do laundry part way through the trip."}, {"username": "Heather Hills Jacobs", "comment_text": "Hotel Continental .. canal view rooms.. it has a dock for easy water taxis!!"}, {"username": "Debbie DiOssi", "comment_text": "Ca Segredo is wonderful!"}, {"username": "Helen Pottle", "comment_text": "Art Angelo was good and central"}]}, {"id": "2206155869783491", "text": "Recommendations for Hotels in Rome .....", "link": "facebook.com/groups/1373361046396315/permalink/2206155869783491/", "likes": 8, "comments": [{"username": "Ochola Anyango", "comment_text": "Okay"}, {"username": "Cheryl Novis", "comment_text": "Hotel Smeraldo - great position and actually recommended by Rick Steves"}, {"username": "Rachel Bradfield", "comment_text": "Ponte Sisto - near the Ponte Sisto Brige and lots of lovely restaurants along the river bank 🇮🇹"}, {"username": "Gary Fossaceca", "comment_text": "Hotel San Francesco!"}, {"username": "Antonio Rodrigues", "comment_text": "Rose Garden Palace Roma\nhttps://\nwww.rosegardenpa\nlaceroma.com/"}, {"username": "Benita Long", "comment_text": "Hotel colosseum"}, {"username": "Tricia Lanieri Forchetti", "comment_text": "Courtyard Marriott Rome Central Park. Great views and great restaurant."}, {"username": "Angela Cook Marshall", "comment_text": "Boutique Hotel Campo de’ Fiori. I was just there last week. It’s beautiful and in a wonderful area.\nHotel staff was amazing"}, {"username": "Marilyce Arbelo", "comment_text": "We stayed in the lucilla Augusta Palace and have had a great experience. Breakfast is not included. 5 minute walk to termini train station which took us everywhere pretty quick! (Airport, Cruise port, Vatican City, colosseum, Spanish steps, etc.)"}, {"username": "Stacy Derouin", "comment_text": "Hotel Stendahl was lovely and well located!"}, {"username": "Julie Casteel", "comment_text": "Hotel Bernini."}, {"username": "Wendy Moon", "comment_text": "Hotel 55"}, {"username": "Jodi Shiffman Silverman", "comment_text": "Baglioni. Great location and super friendly staff."}, {"username": "Andrew Mircovich", "comment_text": "Hotel Lancelot . Very nice hotel with rates around 200€ per night . Great free buffet breakfast . Hotel is in a lively residential neighborhood of Cielo with lots of restaurants and bars. Colesseum is a 10 minute walk"}, {"username": "Emma Butcher", "comment_text": "Hotel Nazionale"}, {"username": "Marian Calhoun", "comment_text": "Stayed there last week. Enjoy dinner in rose garden. Right across from JS embassy"}, {"username": "Becky Hewitt", "comment_text": "Hotel 87 fantasic place 10 mins from the train station and easy to get to most attractions within walking distance from hotel"}, {"username": "Starla Dawn", "comment_text": "@Hotel Barocco\nSauna & Spa Suite"}, {"username": "Jennifer Nguyen", "comment_text": "Beautiful hotel with bus shuttle provided to go to town.\n\nhttp://\nromecavalieriwal\ndorf.guestreser\nvations.com/\n28949/\nbooking?msclkid=\nb6e0f64c332519d\nb0a4892814e2d4f\n4f"}, {"username": "Linda Santucci Fries", "comment_text": "The Singer Hotel. Darling boutique hotel, in a great location"}, {"username": "Caryn Goode", "comment_text": "Hotel Teatro Pace. Close to the Piazza Navona."}, {"username": "Liana Kamenova", "comment_text": "Barcelo"}, {"username": "Maggie LW", "comment_text": "IQ Hotel Roma"}]}, {"id": "2206164009782677", "text": "Italia Lago Maggiore", "link": "facebook.com/groups/1373361046396315/permalink/2206164009782677/", "likes": 9, "comments": []}, {"id": "2206205809778497", "text": "Cheapest airport to fly into that’s still close to Rome!!", "link": "facebook.com/groups/1373361046396315/permalink/2206205809778497/", "likes": 23, "comments": [{"username": "Jackie Richards", "comment_text": "Rome lol"}, {"username": "Jill Medrano Casey", "comment_text": "Why wouldn't you fly into Rome?"}, {"username": "Brian Gerada", "comment_text": "Ciampino Rome"}, {"username": "Carlos Arotinco", "comment_text": "Just take a train. Super cheap lol"}, {"username": "Steve Chovan", "comment_text": "Rome😂"}, {"username": "Nick Cittadinni", "comment_text": "Do any airports anywhere work like that where there a “cheap” airport to flying into regardless of where ur coming from and time of year? You Don’t fly much do you?"}, {"username": "Brogan Calloway", "comment_text": "Instead try and find a cheaper airport to fly OUT from."}, {"username": "John Bruckman", "comment_text": "You only have two choices… 90% of flights fly into Fiumicino only charters and a few Ryan Air flights fly into Ciampino which is a bit closer to the city."}, {"username": "Alicia Cox", "comment_text": "When you google flights, do it incognito or they Jack the price up every time you check.\nSometimes more direct flights that may cost a little more are well worth it for less chance of mess ups. Google Clark Howard & he will give you tips on which days to book/travel/\nhow far out is best. I can’t remember the specifics."}, {"username": "Melissa Elliott", "comment_text": "Naples or Bologna are typically less expensive"}, {"username": "Tami Sue", "comment_text": "Rome would probably be the cheapest."}, {"username": "Christopher A. Johnson", "comment_text": "Close is relative. Fly into Naples and take ITALO TREN to Termini. Same amount of time from FCO, but nicer ride."}, {"username": "Pam Hartsoch", "comment_text": "Try Florence and grab the fast train to Rome"}, {"username": "Giovanna Nina Grieco", "comment_text": "pisa x it’s not the airport it’s the company you buy the tickets from ? easy jet and ryan air same flights"}, {"username": "Rosanna Hardeman", "comment_text": "Rome."}, {"username": "Sherri Leis Dillavou", "comment_text": "I’d stick with Rome"}, {"username": "Georgina Mcauliffe", "comment_text": "Milan and Bologna are my picks when coming from Australia - much easier to get in and out of than Rome."}, {"username": "Maria LoSurdo", "comment_text": "Just fly into Fiumicino, Rome as it’s the most convenient!"}, {"username": "Anna Saloranta", "comment_text": "That would depend where you are flying from, and on what carrier"}, {"username": "Janelle Urquidez Harris", "comment_text": "Rome.."}, {"username": "Patti Porter", "comment_text": "Use google flights, put in departing airport and for destination just put Italy"}, {"username": "Nancy Middlebrook Piastuch", "comment_text": "I mostly use Milan no matter my final Italian destination"}, {"username": "Jeannine Duguay", "comment_text": "Rome"}, {"username": "Michelle Sultana", "comment_text": "Ciampino"}, {"username": "Michelle Parkinson", "comment_text": "Rome!"}, {"username": "Stevie Boombatz", "comment_text": "When we went last may it was the northern airports that were less expensive like Milan or venice"}, {"username": "Carol Kelly", "comment_text": "Milan MXP"}, {"username": "Doreen Shaner", "comment_text": "Less expensive for us in North Carolina to fly in to Milan-about$250\n-$300."}, {"username": "Elisa Di Dea", "comment_text": "Usually cheaper flights going into Naples rather then Rome"}, {"username": "Mandy Cocchieri-Marsman", "comment_text": "Perugi"}, {"username": "Stjepan Kujadin", "comment_text": "This depends on many factors"}, {"username": "Jaime Cleek", "comment_text": "Where are you traveling from? Do you have an airline preference? What time of year?"}, {"username": "Luca Lookone Ferrentino", "comment_text": "Where are you flying from?"}, {"username": "Bojana Naumovska", "comment_text": "Treviso"}, {"username": "Noemi Alexandra", "comment_text": "Ciampino, or fiumicino.\nThese are cheap airports."}, {"username": "Graham Sherlock", "comment_text": "Try Frankfurt"}, {"username": "Frannie Kaplan", "comment_text": "Both are relatively the same, it's your airport you leave from that affects the price. Ciampino is small but their night time transport is not good from the airport so you have to take a cab to the metro. Fiumicino is large but connected to a lot of services, buses taxis train etc. Both are easily connect to the city center.\nThe airport you're leaving from will affect your price"}, {"username": "Rhona OConnor", "comment_text": "Dublin? 🤔"}, {"username": "Carmine Recine", "comment_text": "Everyone wants cheap and than something goes wrong they are first to say what happened! So do your homework and layout the pros and cons because I’ve seen it cheap is not better"}, {"username": "Ninni Karjula", "comment_text": "Overall flying into Rome is cheaper than some other cities in Italy."}, {"username": "Irene Oda", "comment_text": "What do you mean by 'cheapest airport to fly into\"?"}, {"username": "Alessandro Iannelli", "comment_text": "occasionally, travelling to a small airport, a bit far from a big city, can be cheaper enough that you may save money even taking into account the difference in bus/train fares. two possible examples: perugia rather than roma fiumicino/roma ciampino, and (probably the most known example of this in italy) bergamo instead of milano. search engines like kayak or skyscanner can help with this sort of things."}, {"username": "Mark Spielman", "comment_text": "ZRH, then you can experience Ticino (upscale Italy), on your way south."}, {"username": "Michael Barnes", "comment_text": "Fiumicino? I mean unless you are already in the EU, the airport itself isn’t driving the cost savings. From the states it’s timing and airline, not necessarily destination airport there that drives the cost.\nIf you came here looking for a “try Naples by way of Venice through Munich saves you 75% every time” kind of answer..\nThere isn’t one."}, {"username": "Alexandra Gómez Jaramillo", "comment_text": "Milan was cheaper last year by 250 US dollars."}, {"username": "Philip Curnow", "comment_text": "Ciampino, but you'll be flying on a Ryanair from somewhere in Europe."}, {"username": "Seán Ó Confhaola", "comment_text": "Pisa."}, {"username": "Anna Gambino", "comment_text": "I leave from NY. Even our 3 airports vary in price. I just keep looking for flights 10 months before. I have found Milan to be the least expensive at times but that doesn’t help if I’m going to southern Italy where I need to fly to Naples. I just booked the cheapest flight I’ve seen to Rome for next April. Helpful is a credit card where you can use points toward your flight. Chase United explorer cards now allow you to use points TOWARD your flight as opposed to having to have enough points for the entire flight. I’ve not seen that before."}, {"username": "Colleen Dawson", "comment_text": "Sometimes it’s not necessarily the airport but the airline. Norse is one to consider but then look at the add ons to the ticket.This is presuming you are traveling from the USA."}, {"username": "Kn Blanchard", "comment_text": "We found Naples the cheapest coming from Boston"}, {"username": "John Wilson", "comment_text": "Not a great question. It depends on where you’re flying from, and the individual airline deal with it he airport. Air Canadas home airport in Italy is Fiumicino, you just need to get your butt to Toronto for the departure."}, {"username": "Anthony Martini Jr.", "comment_text": "Amsterdam"}, {"username": "Dana Colantuono", "comment_text": "I flew into treviso and out on ciampino. Smaller airports have less taxes and the flights are cheaper. So it depends where you're coming from will determine what airport you can fly into because small(er) airports/\nairlines only fly into small airports.\n\nGood luck"}, {"username": "Anthony Sperduti", "comment_text": "That’s not how it works"}, {"username": "Robert Lawshe", "comment_text": "Is that a statement or a question?"}, {"username": "Alessandro Battxi", "comment_text": "wrong question"}, {"username": "Karen Cumbo", "comment_text": "Rome"}, {"username": "Tom Glassburner", "comment_text": "Thanks for all the comments. Probably wasn’t the best worded question lol. We are going to drive to DC and then fly into Rome. Narrowed it down to a couple of flights with long layovers in countries of interest. We try to save as much as we can on the initial flight then upgrade once we are in the airport. Sometimes we get lucky on the flight out but usually we get an upgrade on one of the legs and it gives us lounge passes in the countries with the layovers. We then can recharge, grab some food and get ready to hit the city lol"}, {"username": "Tom Glassburner", "comment_text": "Virginia usa"}, {"username": "Diane Davis Lawyer", "comment_text": "Is this a trick question like who's buried in Grant's tomb?"}]}, {"id": "2206213926444352", "text": "Hello\nI need help with my Italy itinerary. I’m traveling to Italy after 4 days in London. There 6 adults and 2 kids.\nI will have 7 days. I know I want to go to Florence. Can someone help me where should I go next. Milan Rome etc ??\nI will be flying home from London.\nWhat is better option fly or train ?\nAny Airbnb/ hotel recommendations ?\nThis last minute plan ( family members bucket list)\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2206213926444352/", "likes": 6, "comments": [{"username": "Linnea Kay Wammack", "comment_text": "We loved Cinque Terre, Florence and of course Venice. The Vatican and Colosseum were fantastic but Rome is so crowded. Google some itineraries for ideas."}, {"username": "Lisa Quinn", "comment_text": "How old are your kids?"}, {"username": "Lisa Quinn", "comment_text": "Where are you flying into? ￼\nWhich London airport are you flying home from? These factors weigh in on my response."}, {"username": "Dafne Vassetti", "comment_text": "Go to Milano. You can fly directly from London and there is a great train transportation system.\n\nYou can use Milano as a base and have 1 day trips to Verona, Como area, Bergamo(Capital\nof culture for 2023) What to see in Milano - Cathedral, going up the Cathedral, Castello Sforzesco, Pinacoteca di Brera (which takes probably at least half a day), Brera neighborhood, visit Teatro La Scala, have aperitivo in the Navigli area. Kids would love visiting the Leonardo Da Vinci Museum and maybe renting bikes in the Sempione park.\n\nAlso from Milano, you can easily reach Florence and maybe stay there 2 nights."}, {"username": "Sam Mah", "comment_text": "I agree with Rome, Florence and Venice for first time to Italy travellers."}, {"username": "Lucrezia Folger", "comment_text": "3 days Florence, 4 days Rome."}, {"username": "Glenn Todd Webb", "comment_text": "7 days=2 major cities. Rome or Venice would be recommended. Take train to other city."}, {"username": "Linda Pitler", "comment_text": "4 days Rome, 3 days Florence. Bear in mind you also have to allow for travel days, so that 7 days might actually be 6, so adjust accordingly."}, {"username": "Janet Toellner", "comment_text": "Use a travel agent!"}, {"username": "Laura Jetton", "comment_text": "I would stay in Florence and do day trips to Pisa and Tuscany. There is sooo much to do in Florence, 3 days wasn’t enough for me, and I didn’t have a 6 year old.\nI just think it would be less stressful not having to change locations."}, {"username": "Alexandra A Welker", "comment_text": "Two suggestions: Venice, it's a different experience from other cities and it's close to Firenze using fast trains. But Rome is also different and has lots of history, close to Firenze as well. Tough choice but those are my recommendations\n."}, {"username": "Beatriz Davalos Moreno", "comment_text": "I just came back from a trip there, I would recommend if you have not been in Paris, fly to paris it is beautiful. Two nights should be enough and flight from London to Paris should be cheap. I would then go to Rome and after maybe Venice and Florence. Those were my 4 favorite cities, I went all over in Italy, France and only Barcelona in Spain but Venice, Paris, Florence and Rome were my absolute favorite, besides Sorrento that is!"}, {"username": "Eugene Klein", "comment_text": "Honestly if you only have 7 days with so many people including kids you are better off staying in Florence and take day trips. In addition to wealth of art and culture and food in Florence, your group can take a train or tour to Siena, Piza, Lucca Arezzo and many other places in the area. No need to waste time on transit, hotel change etc. which eats up lot of time"}, {"username": "Annabella Pojer", "comment_text": "Fly and up to you re where? Lakes districts lovely and Tuscany / Umbria"}, {"username": "Alexis McNamara", "comment_text": "Just finishing a trip w teens and 75 yo parents. I’d say consider your kids and set yourself up for success! Work in a golf cart tour, e-bikes, pizza/gelato/\npasta making or a swim. I did Rome, Venice, Florence and 5 terre. Kinda wish I’d done garda lake instead for a break but also then would not have seen Venice!"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Fly to Florence and stay there: 1 day trip to Venice, 1 day trip to Pisa and Lucca (in Pisa be sure to show the kids the Keith Haring painting, the church in Piazza dei Cavalieri with flags of the real arab pirates from the Crusades and to climb the tower, in Lucca in the morning hire some bicycles and ride long the walls), 1 day trip to Siena and the Chianti area, then 1 day trip either in val d’Orcia or 5 terre.\nYou will have seen plenty of stuff, done speed train to Venice, the kids will have enjoyed nice places (Monterosso in 5 terre is the town from the movie Luca, Leaning Tower, gondola rides, bike rides, climbing to the roof of the Cathedral in Florence, gelato, high speed train…) all without changing hotel every 2 days."}, {"username": "Alicia Cox", "comment_text": "If you only have 7 days then I would say Florence & Rome"}, {"username": "Alicia Cox", "comment_text": "Be aware carry on requirements in Europe are different than the USA (smaller size in Europe) - not sure where ur home is."}, {"username": "Linda Tibbles", "comment_text": "Probably Rome over Milan, to cater for everyone's interests and ages. Have been with high school students in Milan, and really ,apart from the duomo, it is just a large city."}, {"username": "Patty Stadulis-Hagan", "comment_text": "Hire a travel advisor"}, {"username": "John Bruckman", "comment_text": "In my opinion if you have only 7 days stay in Tuscany -skip Rome and Milan… enjoy your time in one area without racing around… go to Siena, San Gimignano, tour the Chianti region, maybe Lucca. If anything, drive up to Bologna and visit for a couple days."}, {"username": "Jodi Thornton Lindsey", "comment_text": "F"}, {"username": "Sopra la Roccia", "comment_text": "Sopra la Roccia"}, {"username": "Sopra la Roccia", "comment_text": "Se arrivi da londra arrivi dal nord europa. Volo per MILANO poi scendi la penisola puoi fare Bologna Firenze, Lucca, Roma e via a svendere o risalire"}, {"username": "Pietro Di Sorbo", "comment_text": "In seven days I would suggest you to don't rush from an highlights to another so visit only two places, maybe Rome and Florence.\nBut it depends from period of the year and your interests (art, culture, tradition, beaches, landscapes, Archeologic sites, landscapes and sceneries and so on), e.g. in summer you could visit 5T and North big lakes or Amalfi Coast, Capri, Ischia, Procida and Naples."}, {"username": "Sandi Marella Johnson", "comment_text": "Since there are 6 adults plus 2 children I would suggest spliting your days between Florence and Rome..fly into Rome and make this your base..look into renting an AirBB, stay in Rome for 3 days I would suggest renting a car and day trips to Florence and other places in between..fly out of Rome back to London. Leave Milan for another time.."}, {"username": "Nikki Blosser", "comment_text": "Rome. Unless you want to see The Last Supper and the Basilica in Milan. Maybe Sforza Castle too"}, {"username": "Stacey Miller", "comment_text": "Murano, Venice, Florence, Tuscany\nare all beautiful places. Save Rome for another time."}, {"username": "Pegi Fuller", "comment_text": "I would go to Florence and stay there. You could take a train to Venice for the day. We did. It’s about 2.5-3 hours but takes you right into the heart of Venice from the heart of Florence. Then 1 day trip to Cinque Terre. Take the water ferry to the 5 towns, go to the Beach in Monterosso and then take the train back through the 5 towns. 3 days in Florence and then train to Rome for last two days and fly out of Rome\nPS: Paris needs a trip by itself. City and then beaches of Normandy Lots of history makes the war much more real to youngsters"}, {"username": "Helen Riley Sturgeon", "comment_text": "Rome in limo they can help you!!!!"}, {"username": "Juliet Lee", "comment_text": "Depending when you are going - fly into Bologna- 2 nights food capital of Italy - train to Florence 3 nights - train to Rome 2 nights - fly to UK"}, {"username": "Alice Francesca", "comment_text": "I am Italian.I would see Florence and Rome as a first time traveller.\nIt would be easier to.rent through airbnb a nice apartment with 2/3 bedrooms"}]}, {"id": "2206384903093921", "text": "Hi we will be in Milan in Sept, any advice how to get to lake como, bellagio and varenna. TIA", "link": "facebook.com/groups/1373361046396315/permalink/2206384903093921/", "likes": 1, "comments": [{"username": "Lyn Evans", "comment_text": "Catch a 1hr train from Milano Centrale to Varenna. Bellagio is ferry across from Varenna."}, {"username": "Denise Van Rensburg", "comment_text": "Thanks for the info."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2206230566442688", "text": "I would like to set up a tour to italy any agencie recomendations", "link": "facebook.com/groups/1373361046396315/permalink/2206230566442688/", "likes": 8, "comments": [{"username": "Colleen Dawson", "comment_text": "A great website to check is vacations to go. Several tours are listed and based on what you are looking for you will find something. From escorted to independent, luxury vs economical, length of stay, number of days.Once you find one, then book directly with the tour operator."}, {"username": "Carole Welch Lang", "comment_text": "Italy4Real is great!"}, {"username": "Gina McFadden", "comment_text": "Insight Tours"}, {"username": "Judy Orloff", "comment_text": "Trafalgar or Globus"}, {"username": "Georgeann Pavlinic", "comment_text": "Perillo is the top!"}, {"username": "Teresa Shawn Lane", "comment_text": "EF Tours"}, {"username": "Lara Grom", "comment_text": "Livtours for families and small groups"}, {"username": "John Bruckman", "comment_text": "Dragonfly Tours Italy… the best."}, {"username": "Jayne Dawson Meyer", "comment_text": "Perilo Tours THE BEST!!"}, {"username": "Donna Mangone", "comment_text": "Gocollette.com"}, {"username": "Tracy Krause", "comment_text": "Magi"}, {"username": "Esther Greenslade", "comment_text": "Get your guide app very good"}, {"username": "Steve Wolfrom", "comment_text": "Do you want to go with a group or by yourself?"}, {"username": "Lynda Petralia", "comment_text": "You will pay a lot more going through a tour company. If you can do it yourself, that’s best. AAA will also do it at no cost if you are a member."}, {"username": "Eileen Glenane", "comment_text": "Arts and leisure tours"}, {"username": "BatEl Kogman", "comment_text": "Dragonfly tours Italy\nRoberto Maria Rinaldi"}, {"username": "Brian Osman", "comment_text": "Go Ahead Tours are great, check them out, absolutely no problems"}, {"username": "Jeanne Zorich", "comment_text": "Globus"}, {"username": "Steph Kittles", "comment_text": "The tour guy( originally the roman guy) was amazing"}, {"username": "Jennifer Colucci", "comment_text": "Central Holidays"}, {"username": "Kathy Kelm Meinke", "comment_text": "EF Go Ahead Tours"}, {"username": "John Hansen", "comment_text": "Firebird Tours - they gave a group of 11 of us a custom tour in Sicily that leveraged their buying power at hotels, so great value. Had first rate tour guides (usually 4 hours a day, sometimes more), a relaxed pace, our own driver and minivan - highly recommend!"}, {"username": "John Layman", "comment_text": "The “Travel Network” in Morgantown,WV. The agents name is Gary Wong. Have used him for years,he is fantastic."}, {"username": "Dave Schickling", "comment_text": "Do it on your own"}, {"username": "Greg Fetro", "comment_text": "VIATOR"}, {"username": "Theresa Salerno Adams", "comment_text": "Tripmaster"}, {"username": "Rosemarie Mahoney", "comment_text": "Tripmaster"}, {"username": "Stephanie Norton", "comment_text": "GAdventures. They’re great for all ages and have a local guide."}, {"username": "Tony Perrotta", "comment_text": "We just spent 14 days in Sicily and Italy ! Best trip we ever took ! NOT A SINGLE GLICH !\nIt was Excellent !\nCheck out\nTRAFALGER TOURS !"}, {"username": "Mary Gregory", "comment_text": "Avanti tours"}, {"username": "Heidi Maria Farrugia", "comment_text": "Vanniny in Valdera Tuscany ! You won’t regret it"}, {"username": "Robin Barbera", "comment_text": "Do it your self. It is fun and you can will enjoy the experience. Check out sites like Viator for day tours"}, {"username": "Mercedez Cueva", "comment_text": "@Northern Plains Travel Teri Nistler is amazing! I’m headed to Italy for the first time mid September and she planned it all and will also be joining our group. She had great connections in Italy and is based out of the US."}, {"username": "Scott Cooksey", "comment_text": "We utilized Globus and had a terrific experience. Zero complaints"}, {"username": "Russell Weidner", "comment_text": "Allison Beatty Tours"}]}, {"id": "2206316846434060", "text": "First time travelers to Italy, want to visit the Compania region; will land in Naples. Looking for suggestions for a 7 day trip there. Also a side note im babymooning so looking more into shopping, leisure, relaxation and good food. Recommendations and places to go and where to stay is highly appreciated!", "link": "facebook.com/groups/1373361046396315/permalink/2206316846434060/", "likes": 0, "comments": []}, {"id": "2206350109764067", "text": "Hi ! We have holday to Toscana .... and need transport from aiport Pisa to Viareggo ... you know some people taxi or transport better... thanks all. :)", "link": "facebook.com/groups/1373361046396315/permalink/2206350109764067/", "likes": 1, "comments": [{"username": "Brenno Bianchi", "comment_text": "Between Pisa and Viareggio there is regionale train every 30 minutes for 3.90€.\nThe airport and Pisa Central Station are directly connected by a people mover."}, {"username": "Iveta Kraviarová", "comment_text": "Thanks for the info."}]}, {"id": "2206371969761881", "text": "Who stays in Gallipoli?", "link": "facebook.com/groups/1373361046396315/permalink/2206371969761881/", "likes": 2, "comments": [{"username": "Cat Furness", "comment_text": "I just came back from a 3 month stay in Italy & spent 7 days in Gallipoli !!"}]}, {"id": "2206384906427254", "text": "Hello everyone\n\nI’m visiting italy from 1st sept until 12th sept. How would the weather. Do i have to bring a jacket ? Or its gonna be hot ?\n\nPlus, For trains, i didnt book onlinr for florence to cinque tere, and then bavk to Florence next day.\n\nIf i wont book online, i would be able to get tickets ftom railway station?", "link": "facebook.com/groups/1373361046396315/permalink/2206384906427254/", "likes": 1, "comments": [{"username": "Gianna Onesi", "comment_text": "For weather I would bring a sweater and check online for upcoming weather..You can buy tickets at the train station"}]}, {"id": "2206483713084040", "text": "Hi, we are going to Bergamo on October 24th and stay until November 4th. Probably renting a car( family of four). What itinerary do you recommend? I am kind between going to Venice and Dolomite’s or exploring Bologna and the cities close to. Also the weather, I don’t know how it will be.\nThanks in advance❤️🙏🏻", "link": "facebook.com/groups/1373361046396315/permalink/2206483713084040/", "likes": 0, "comments": []}, {"id": "2206291136436631", "text": "Hubby & I will be in Florence the end of May… any hotel recommendations? Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2206291136436631/", "likes": 2, "comments": [{"username": "Sandy Radican Shikaly", "comment_text": "Hotel Brunelleschi in the center is wonderful!"}, {"username": "Jeanne Eliason", "comment_text": "Check out Hotel David. Close enought to walk to sights however nestled in trees. We go twice a year and always go there. Taxi from airport about 22 euros. Great restaurants nearby that locals frequent. Plus a fantastic breakfast in their covered patio or inside. Wine and beer and snacks at 7pm. The rooms are gorgeous."}, {"username": "Jeanne Eliason", "comment_text": "My one suggestion is to book now any place you find. I waited to book Hotel David and luckily I got their last rooms this Oct. Most places let you cancel with full refund if necessary."}, {"username": "Joanne Dunphy", "comment_text": "Is walking to sites closer in the Gavinana area or Santa Maria Novella? Thank you"}, {"username": "Joanne Dunphy", "comment_text": "Is it closer to walking to sites if you stay in the Gavinana area or Santa Maria Novella ? Thank you"}, {"username": "Nancy Kirby", "comment_text": "Hotel Alessandra"}, {"username": "Pat Cray", "comment_text": "The Kraft Hotel is lively! Beautiful rooftop views with restaurant and bar!\nRooms are nice and spacious!!"}, {"username": "Mat PO", "comment_text": "Portrait, Four Seasons and Villa San Michele."}, {"username": "Rebecca Yeoh", "comment_text": "The Frame Hotel. A building with incredible history and great location👌🏼"}]}, {"id": "2206395963092815", "text": "One day in Verona. Top tips?", "link": "facebook.com/groups/1373361046396315/permalink/2206395963092815/", "likes": 0, "comments": [{"username": "Philip Curnow", "comment_text": "Make sure you see the River"}, {"username": "Cláudia Santos", "comment_text": "I am leaving today from Verona. In my opinion, in one day:\n1 - Go to Castel Vecchio and bridge Scalieri, arco di Gavi;\n- after, come back and go to the arena, take fotos in Piazza Bra (in my opinion you haven't enough time to go inside the arena but you can see if you want...)you have a direct street in front of the castel that goes to Piazza Bra.\n2 - Then go to Piazza Erbe, Julieta House and Piazza della Signoria.they are all near by!\n3 - Go to Ponte Pietra/ bridge and the castel of S. Peter to see the city.\n4- In the return, if you have time and if you want, go to the Bosari gate and near Castel Vecchio you have the S. Zeno Church. I really enjoy it, and i don't go to see them usually ( the church). I dont know when it is closed... i went at 15 p.m. but i had two days...\n5 - To eat, near the arena, with a \"coberto\" fee lower that in Piazza Bra ( they charged me coberto and service fee in piazza bra!!), you have a pizzaria named Crocca, very nice, big individual pizzas and other plates, with \"the fork\" discount, if you make reservations in the app.\nENJOY!!\nITs a small but lovely city!!"}, {"username": "Tim Edkins", "comment_text": "Get a Verona card"}, {"username": "Paul Anderson", "comment_text": "See a show in the Roman amphitheater"}, {"username": "Sam Gamlin", "comment_text": "Attend the Opera - incredible experience at the arena in Verona. I’ve been each time visiting Verona and would definitely go again 🇮🇹❤️🥂"}, {"username": "Lynour De Leon Cerenio", "comment_text": "Watch out for pickpocketers all the time!"}, {"username": "Roni Ingram", "comment_text": "Thanks for all the tips! Turning off comments now 😊👍"}]}, {"id": "2206349846430760", "text": "Looking to travel from Florence to Assisi just for the day. Any recommendations? Train vs private driver or tour?", "link": "facebook.com/groups/1373361046396315/permalink/2206349846430760/", "likes": 1, "comments": [{"username": "Brenno Bianchi", "comment_text": "There is around every two hours a fast regionale train from Florence to Assisi; it takes 2 hours 34 minutes and costs 16.10€"}]}, {"id": "2206413623091049", "text": "I’m overwhelmed with all the tour options of the colosseum. Can I get your advice on which we should chose. We want inside and with a guide. I just checked Get your Guide and there are like 20 different options. What’s the best value? We just want inside. Our own tour is already doing the outside. Or is there a better company to go with? Or person? Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2206413623091049/", "likes": 0, "comments": [{"username": "Cheryl Caferro Shul", "comment_text": "Following"}, {"username": "Victoria Laverty", "comment_text": "Coop culture official site\nUndeground fascinating"}, {"username": "Karen Blackmore", "comment_text": "There are many, many posts on this in this group! Coop culture website is best as won't get cancelled and is direct so much cheaper. Go on sale exactly 30d before. More sometimes released 7 days before."}, {"username": "Marty Harte", "comment_text": "I booked an evening tour 5-7pm through Viator and it wound up being through City Wonders. Carlo was great."}]}, {"id": "2206463916419353", "text": "Anyone travelling and looking for a guided walking tour I recommend an app called VoiceMap.\nJust did a 1.5 hour tour of Nice (I know that’s in France but there are tours for all around) and it worked so well. Narrator gave just the right amount of information and anecdotes and it provided a gps map with the audio attached to it so the lady would start talking when you get to the particular corner of the road, even if you decide to stop for lunch etc. (bonus only €10).", "link": "facebook.com/groups/1373361046396315/permalink/2206463916419353/", "likes": 2, "comments": [{"username": "Jennifer Walp Rydholm", "comment_text": "The price is only 10euro? I couldn’t see the price on the app."}]}, {"id": "2206196076446137", "text": "I’m going to Tuscany in mid September. Wanting to do a hot air balloon for my husband and I. Any recommendations? Also want to do Capri to walk around, lay at the beach, see the blue grotto and anything else that is a must. Any suggestions for capri? Do I do a tour or is it cheaper to catch a boat or ferry?", "link": "facebook.com/groups/1373361046396315/permalink/2206196076446137/", "likes": 1, "comments": [{"username": "Sam Dubyak", "comment_text": "Take me\nR u going to be back 1st part of oct?"}]}, {"id": "2206019733130438", "text": "Hi,\nI'm visiting Rome and I'm not sure if it's because all the walking that I have been doing around Italy, but my legs started turning red and swallow. Never happened to me before. Have any of you had to visit ever the ER in Rome? What are your suggestions?\nThank you", "link": "facebook.com/groups/1373361046396315/permalink/2206019733130438/", "likes": 33, "comments": [{"username": "Terri Moore", "comment_text": "Air travel. Get some compression socks."}, {"username": "Julie Edgington Griffin", "comment_text": "Disney Rash. I let mine go way too far! I was on a whirlwind trip with students last summer in Europe. Soak a washcloth in ice /cold water and prop up legs. Finally got a pair of compression tights / socks in Rome. I did go to the ER in Spain, but wasting a day waiting and the fact that there’s not much that can be done was not worth losing a day"}, {"username": "Cynthia Cahoon", "comment_text": "Definitely Disney rash/golfers rash. I got it’s Dubai walking around in extreme heat. Looks worse than it is and eventually goes away."}, {"username": "Jodi Paisner", "comment_text": "Last year, while in Rome, my knee blew up and I became unable to bear weight on it. The concierge at my hotel called a doctor to come see me. He was very helpful. I did try to get to an ER but the taxi driver we found didn’t understand English."}, {"username": "Teri Blaydes", "comment_text": "There’s an English speaking clinic I went to when I broke my arm in Italy and had the best experience."}, {"username": "Cheryl Bales", "comment_text": "Happens to me all the time on the golf course. Did you have sunscreen applied? Along with lotion and heat with sweat? Does it burn and itch?"}, {"username": "Jay Cabrera", "comment_text": "Try a pharmacy, they may be able to help you"}, {"username": "Cheryl Bales", "comment_text": "Hot"}, {"username": "Carol Polichnowski", "comment_text": "Go to\nER"}, {"username": "Eddie Williams", "comment_text": "Go to Dr. El medico. This looks nasty"}, {"username": "Colleen Williams", "comment_text": "It looks like cellulitis. Go to a doctor."}, {"username": "Lisa Morrell Korb", "comment_text": "I went to a clinic in Italy. With something this obvious you won’t need to speak Italian. They do have “tourist” clinics that essentially have an English speaking staff person. Our hotel helped us find one. Ironically, the day I went the English speaker wasn’t working. Made my way with google translate easy enough."}, {"username": "Fahimeh Akhavan", "comment_text": "Seyed Emamamzadeh"}, {"username": "Cee Esperance", "comment_text": "Please go to the ER.\nYour emergency medical insurance covers ER cost and whatever meds you need. And make sure you read your emergency medical insurance policy to find out if you need to let them know before treatment.\nSorry but i don't think anyone here is qualified to make a medical assessment. And if there is one, it would be difficult to determine what it is by just looking at the picture.\nPlease do yourself a favor and seek medical assistance asap."}, {"username": "Arous Rn", "comment_text": "Go see a doctor. Then bring all the receipts and submit it to your health insurance company for reimbursement. Or if you've purchased travel insurance, contact them to see if they'll cover anything. But yes! Please see a doctor."}, {"username": "Debbie Silver Cazares", "comment_text": "I had this when I was there too. All over my arms as well. It came on with some nausea. We think it was heat rash . I got over heated. ￼First time in my life. It went away and peeled. I put some Cortizone cream on it."}, {"username": "Marylou Coppola", "comment_text": "I agree with DISNEY Rash. I am a Disney World pass holder and get this every time for the past 7 years. Didn’t even know that was a thing until it happened to me."}, {"username": "Loretta Lemmo", "comment_text": "Same thing happens with me. I think it’s related to heat, humidity, sweat, sunscreen and insect repellent. And mine affects me in the same place, lower leg. I also had a nasty bug bite on top of all this which became infected and I went to the emergency tourist clinic in Venice. Antibiotics cleared it up but I have remnant discoloration that’s still healing from 6 weeks ago."}, {"username": "Rita Wersan Savio", "comment_text": "I’m heavy this happens to me when it’s hot, sweaty and I’m doing a lot more walking then my body is used to."}, {"username": "Ruby Kwan", "comment_text": "Looks like a heat rash! Exactly what my sister’s legs looked like after spending time on the beach in Mexico. Some people are ultra sensitive to heat and sun. And she only got it on her legs. ￼"}, {"username": "Evy Fredy", "comment_text": "I had exactly for the first time these redness on only one leg and swollen ankles! I put some cortisone creams and took some antihistamine meds that I brought with me in case of allergies! It happened last fall in Rome when it was still warm and I was walking a lot all day! I didn’t go see a doctor but the pharmacist whom advised me to do exactly what I did already. It took a few days and went away on its own! I hope everything will be ok, no need to go to the ER!"}, {"username": "Cindy Wesely", "comment_text": "In Spain a friend went to ER. Was there 5 hrs. $25"}, {"username": "Diane Davis Lawyer", "comment_text": "If you go to a public hospital ER the cost will be minimal. Italy offers tourists the same medical coverage as citizens. Good luck. They mostly do not speak English. Take a translation app with you."}, {"username": "Carrie De Chiara Schauer", "comment_text": "My son got Disney rash walking so much in Rome in the heat. He elevated legs and rested one day and it was better. Best to get checked if you’re in doubt."}, {"username": "Jonathan Contessa", "comment_text": "We call it Disney rash here in Florida. From all the walking"}, {"username": "Bev Symes", "comment_text": "Compression stockings are a must. this is actually the beginning of this problem."}, {"username": "May Greece", "comment_text": "It happened to my husband, we have been there 10 days ago, but don't worry it will take about one week and everything will be ok"}, {"username": "Catherine Hardy", "comment_text": "My friend and I got this same rash while in Italy, and the pharmacist said is was something called “Disney Rash“ - caused by excessive walking and combined with heat I think. They gave us some cream product (cortisone maybe). It usually affects women over 50. I went away after a few days."}, {"username": "Pat LeRoux Bales", "comment_text": "I also had that happen I am not a walker so my body must have been warning me I was doing too much. It went away on its own"}, {"username": "Jocelyn Tomlinson", "comment_text": "Kathryn Tomlinson"}, {"username": "Sue Levy Avinir", "comment_text": "Try Doctors in Italy. They will see you virtually for pretty good price."}, {"username": "Holly Jacobs", "comment_text": "When I was in italy my ankles and feet swelled which never happened before from all the walking but no rash. Just swelling. It went down as soon as we left rome. The Vatican and coliseum back to back with a catacomb tour in there and then a Pompeii 14hr day trip on day 3 and that will do it I guess! Lol. Crammed so much in last September but I am dying to go back. It was an amazing trip regardless!"}, {"username": "Kay Matthews", "comment_text": "I had similar after walking around Disney Florida. People there call it Disney rash. Caused by the heat humidity and walking lots. It did settle down. Was at just the back of my legs\nObviously not saying this is what yours is, I have no medical knowledge. Just saying what I had."}, {"username": "Victoria E. Rodriguez", "comment_text": "It's cellulitis. You need antibiotics asap"}, {"username": "Cesidia Baugniet", "comment_text": "Go to the farmacia- theres always a doctor there can help"}, {"username": "Maureen Inbornone-Sanders", "comment_text": "I get that also it's just from walking. It will fade away. Not a problem."}, {"username": "Rose Tarkazikis", "comment_text": "Just go"}, {"username": "Nicole Leggett", "comment_text": "I had the same thing- too much walking on cobblestones. Vasculitis. Put your feet up!"}, {"username": "Lise Geoffroy", "comment_text": "Je porte des bas de contention en été lorsque je dois marcher beaucoup et cela est super !"}, {"username": "Meredith Mabee-Biss", "comment_text": "We could have been leg twins!"}, {"username": "Karen Gregorchuk", "comment_text": "Courtney Greg"}, {"username": "Karen Gregorchuk", "comment_text": "Bela Kay"}, {"username": "Lynne Gates", "comment_text": "“Golfers rash”. I don’t golf but get it when it’s hot and humid just like your photo."}, {"username": "Angela DiGianni Nocera", "comment_text": "Visit pharmacy\nIn Rome\nCool water\nFeet up\nTake cool showers\n\nDrink lots water\nGo pharmacy\nGet cream etc\n\nMake sure\nSo don’t ruin trip\nGood luck"}, {"username": "Angela Genduso", "comment_text": "Pharmacies in Europe can help they might make recommendations\nsuch as Doctor meds etc. Very different than America"}, {"username": "Tricia Cypriano Brasseur", "comment_text": "I had a friend get this but from being in the ocean. She had to get meds from doctor. It was something in water that caused it."}, {"username": "Dawn Handrahan-Lauchlan", "comment_text": "I get this frequently when I’m in hot climates and walking a lot… it’s called Disney Rash in Florida USA. Is EIV exercise induced vasculitis. Had it 3 weeks ago while in Rome, and it lasted a few days but left once my body acclimatized to the weather and walking"}, {"username": "Erin Callagy Wollard", "comment_text": "This happens to me as well. Put ice on it. It's leaky veins."}, {"username": "Bob Elliot", "comment_text": "If it is cellulitis, you should see a doctor immediately. Not in a day or two when you get to Sorento and You won't know if it is cellulitis unless you see a doctor. Go now, not later."}, {"username": "Jodi Kaus", "comment_text": "Got that in Rome from excessive heat and walking on hot pavement all day. Cooled down and it slowly dissipated."}, {"username": "Shannon Ruffin Pelicano", "comment_text": "I get this every time I walk all day (Europe or Disney World). It does go away on its own but continued walking could make it worse. I try to always wear compression socks (only knee high necessary) when I know the walking will be for long periods. It definitely helps tremendously!! Also elevate your legs as much as possible. Do enjoy your trip!!"}, {"username": "Christi Mcfarland Jennings", "comment_text": "I had the same type of rash when I went to Disneyland. I was told by my Dr that it is caused by walking so much in the heat. Google “Disney Rash” or Golfers rash”. It is a vasculitis."}, {"username": "Ioana Coco", "comment_text": "Allergic to sun?"}, {"username": "Sandra Vilters-boer", "comment_text": "You can visit a local doctor. No need to run to a hospital. They can diagnose this and If needed they send you to a hospital for further examinations"}, {"username": "Trinity Sign", "comment_text": "Did you get bit by mosquitoes? If it is that...you have cellulitis from it and it is very painful and can spread quickly...you will need doxycycline 100 mg for 10 days ..that's what happened to me and my son, but I know this happens so I asked my Dr to prescribe before leaving."}, {"username": "Laura Connors", "comment_text": "It is exercise-induce\nd purpura. I get it every year when I travel to hike in hot countries. It is not cellulitis so don’t waste your time in an ER. Treatment includes icing and elevation and sometimes topical corticosteroids\nor oral anti-inflammato\nries which you can get in any pharmacy in Italy. It will go away when you go home but may return when you walk a lot in the extreme heat. You can Google it for more info. Good luck"}, {"username": "Gary Butler", "comment_text": "Yes it’s the small nats in the standing water on streets"}, {"username": "Ana Ferreira Ruffel", "comment_text": "This are some of the symptoms of cellulitis… is your skin pitted, hot, blisters, fever? Chills? If yes to any then maybe cellulitis.. but like everyone else is saying it’s most likely heat related!!l thank you for asking the question on here… as it is obvious it has happened to others as well and now we got a good lesson on what we can do in case of an emergency!! Of course we should never get medical advice from fb but it is good to know what it could possibly be so as to do our own research and make smart decisions!"}, {"username": "Linda Paster Oliva", "comment_text": "Was in Italy in May. Walked all over Venice, Florence and Sienna with swelling in both ankles but the itching and resulting redness started in Rome. We noticed a lot of weeds growing adjacent to and scattered on walking paths. Fortunately Rome was our last stop. I wore compression stockings on the plane and the itching worsened. It was very hot in NY and after hours in the airport I ripped everything off in the car on the ride home and the itchiest ankle was beet red. At the time I believed it was poison ivy and treated it as such"}, {"username": "Mer Riggieri", "comment_text": "Disney rash is a nickname for exercise-induce\nd vasculitis (EIV). It typically occurs when a person performs prolonged exercise, such as walking, golfing, or running, in hot temperatures. Although it typically resolves by itself, a person can elevate the leg and take NSAIDS to help reduce the symptoms."}, {"username": "Matthew Sherrington", "comment_text": "My wife’s leg is exactly like this and it is cellulitis. Go to the doctor asap x"}, {"username": "Helen Terra", "comment_text": "You should see a doctor."}, {"username": "Michelle Cotoni", "comment_text": "Could be similar to “Disney Rash” where your skin reacts from doing a lot of walking when it is hot out."}, {"username": "Mike Goode", "comment_text": "I could be heat rash, but is also an asymptomatic sign of Covid. Especially if you have been vaccinated. Get a Covid test."}, {"username": "Susan Salerno Brundage", "comment_text": "Just go to pharmacy. Happened to me in Florence. They will give you antibiotics"}, {"username": "Julie Saritag", "comment_text": "Cellulitis you need antibiotics and see a dr"}, {"username": "Jan Taylor", "comment_text": "Yes, I have gone to the ER in Firenze. I went by ambulance after a fall, where I split my eyebrow open. EMT's were great. We were able to communicate. I was wheelchaired to Triage -just like at home. Info was taken, BP, temp, the usual. Then placed in a hallway with other patients in wheelchairs. (This is their way of Observation - as nurses and doctors can keep an eye on you as they pass by.) My doc was able to communicate well enough for me to understand. She stitched me up. Then I was returned to the hallway to wait for CT and Xrays. Once finished, I was released to the cashier. All services were free, except the CT and Xrays. I paid $242. Yup, that's all!"}, {"username": "Sian Gowers", "comment_text": "It looks like Cellulitis ! Need antibiotics"}, {"username": "Lisamarie Bianco", "comment_text": "Same thing happened to my mother in law a few days ago in Rome. Go to Farmacia and they will be very helpful and give you a cream and some suggestions."}, {"username": "Tammy Orders", "comment_text": "I had the same thing while in Disney. Disney rash. It’s from a lot of walking in the Heat. It’s fine. Just doesn’t look so pretty. Took mine about a week to finally completely go away. Unless your legs are swollen I would not go to a dr."}, {"username": "Tammy Orders", "comment_text": "Google “Disney rash”."}, {"username": "Gail Wilson", "comment_text": "No coffee lots of lemon and a heap of water and hydration cream"}, {"username": "Peggy Ryan Lundgren", "comment_text": "Better safe than sorry. I’m not a medical professional but you don’t want to play with a bacterial infection. It should be free to go to the ER."}, {"username": "Anna-Maria Lopopolo", "comment_text": "F"}, {"username": "Helen Starkey", "comment_text": "That’s vasculitis. My husband gets it in summer. Elevate and rest."}, {"username": "Lauren-Jade Roberts", "comment_text": "Looks like cellulitis"}, {"username": "Helen Starkey", "comment_text": "Google Golfers Vasculitis"}, {"username": "Helen Wake", "comment_text": "This is not a medical info page... please see a professional, not a FB travel group. And don't ask as an \" anonymous participant.. \"."}, {"username": "Chelle Dillon", "comment_text": "Do not delay medical attention, looks like cellutitus. This is an infection that can enter the bloodstream and cause death in a short time once it does."}, {"username": "Kathleen Krepley", "comment_text": "This is exercised induced vasculitis\n\nhttps://\nwww.ncbi.nlm.nih\n.gov/pmc/\narticles/\nPMC5828891/"}, {"username": "Karen Kowalski", "comment_text": "Please see a Doctor and don’t get medical advice from Facebook."}, {"username": "Madelyn Palod", "comment_text": "Your hotel will be able to connect you with a travel doctor."}, {"username": "Erin Surmacewicz", "comment_text": "Google \"Disney Rash.\" This is heat and exercise induced vasculitis. Mine looked exactly the same. It's broken capillaries under the skin from so much walking in the heat when you're not used to it. It will clear on its own."}, {"username": "Marlene Brown Babb", "comment_text": "We were in Italy last year four couples, and five of the eight of us had legs that looked like that! Our legs have never swollen or had the rash before either! Our first time overseas. We went to a pharmacy I believe it was actually by the Trevi Fountain. It was hard to communicate with them so the pharmacist actually looked at our legs and came back with. I believe Benadryl and Hydrocortisone.\nIt helped greatly and gradually went away. Heat rash and swollen from the heat. It was also itchy."}, {"username": "Valery Bautista", "comment_text": "Stephanie Beltrán Beltrán gordita, mira"}, {"username": "Clarissa Rava", "comment_text": "Pharmacist in italy can gives you some tips or advices as long as they know so you should go to a pharmacy and ask them directly. Otherwise, if you feel like its needed you can go to the ER. Public medical assistance in italy is free and you only have to pay for medicine."}, {"username": "Linda Stranix", "comment_text": "It happened to me also in Italy in June was just from heat and walking started wearing compression stocks and kept my legs elevated at night was gone before I came home"}, {"username": "Maria Marsili DeChent", "comment_text": "That happened to me also in Rome. I got to Sorrento and the pharmacist gave me some cream that didn’t help. He said ice and keep your feet up. But what worked best was swimming in the sea all day. Good luck"}, {"username": "Elena Rodriguez", "comment_text": "🙏🏼🫶"}, {"username": "Colleen Dawson", "comment_text": "Before you start taking medical advice on this forum , please do a web visit with doctorsinitaly.\nIt’s a great resource for travelers needing medical help in Italy."}, {"username": "निनावी सहभागी", "comment_text": "Thank you! Thank you, so much for all your advice. I really appreciate it💕\nI'm wearing compression socks and will visit a Dr. in Sorento (my next stop). You guys are the best 🙌"}, {"username": "Tricia Harman", "comment_text": "I had exactly the same rash when in Italy a few weeks ago it lasted a couple of weeks, it didn’t bother me just looked weird. Then it slowly faded away. I didn’t see a doctor, unless it is uncomfortable I wouldn’t worry too much."}, {"username": "Tracy Thacker", "comment_text": "Golfers vasculitis. Some people get this visiting Disney. I get it in bands around ankles or even upper thigh . Looks like to me but I’m no Dr. I just play one on FB 😂"}, {"username": "Bhavika Patel", "comment_text": "Sorry I don’t have an answer. But I visited Rome in 2012 summer and had the exact same reaction. It was hot and we were walking everyday. I used to alternate ice and warm salt water soaks every evening and it resolved itself"}, {"username": "Marianne Mia", "comment_text": "The same thing happened to me for some reason, I had a antihistamine and I happened to have some canestan cream and it went away."}, {"username": "Enery Castellanos", "comment_text": "Omg! My daughter developed it on her face! It’s been a nightmare and never saw a Dr.\nWe are now in Spain and seems to be getting better but it also started in Rome."}, {"username": "Dawdaw Samaha", "comment_text": "I would go to the Er or see a physician to get to the bottom and enjoy the rest of the trip"}, {"username": "Raewyn James", "comment_text": "I'm not a nurse or Dr but my husband had something similar in our summer this year and it turned out to be a Staf infection"}, {"username": "Frank Waegeman", "comment_text": "To much wine"}, {"username": "Marijana Occhibove", "comment_text": "Definitely go to hospital . It looks like cellulitis."}, {"username": "Michelle Ellis Diller", "comment_text": "Hoping you are better so you can enjoy vacation"}, {"username": "Raquel Pickering", "comment_text": "Looks like it could be contact dermatitis. I got it when I went to Singapore with the massive humidity. Also cellulitis as mentioned on other posts. Mine was hot, tight and irritated when touched."}, {"username": "Steven Shannon", "comment_text": "Fluid retention and circulatory problems in the lower extremities. If your a diabetic; this could be a clear symptom. Could be the blood in the capillaries surfacing and the fluid would manifest as the swelling. If they are sore and tight, that would be my thought. Heat rashes are usually hyper localized."}, {"username": "Rebecca Emery", "comment_text": "I got back last week and had a similar reaction, not quite as bad. Prickly beat.\nCool regular showers and elevate feet when you can. I also used some heat rash cream to soothe it.\nIf it doesn’t settle get it checked!"}, {"username": "Sandra Desmond", "comment_text": "I’m prone to cellulitis you have pain with that ho into the pharmacy there very good if it is cellulitis you need 2 different type of antibiotics , Rome is a killer so much walking\nBest of luck if it’s cellulitis has to be treated as it travels to the blood stream"}, {"username": "Elie Loummer", "comment_text": "I had very similar in Rome!!!!!! Did you wear compression socks on the plane???"}, {"username": "Robin Barbera", "comment_text": "Ask somebody at the hotel for a name of a doctor if it doesn’t get better and they usually see you the same day right away, but sounds like actions the other person said may work"}, {"username": "Chantal Adams", "comment_text": "I had the same thing I Rome bother ankles. Had had before knew it wasn’t dangerous it’s called « Purpura d’effort » in French. Lots of inhabituel walking and heat will cause this. I put polysporin on it night & morning, put my feet up at night but continued walking and it went away in two days just have a few dots now."}, {"username": "Leila Jane", "comment_text": "My legs did the same exact thing when we walked all over Venice in 100 degree heat a few years ago. I was 72 at the time and taking strong meds for cancer so thought it had something to do with one of those two things. I elevated my legs all night but could not go on another walking excursion the next day. It did gradually subside but I missed our 2nd day in Venice and my legs have never done this again since."}, {"username": "Romy Coops", "comment_text": "I had a similar thing, no where near as bad but it was definitely a shock when I saw both legs after flights and in the heat in the US recently. Are you on blood thinners or Aspirin? Apparently the swelling and capillaries bursting. Make sure you wear compression stockings when practical e.g at night. It clears up in a few days with elevating your legs and massage. If you get Short of Breath - see a doctor immediately. I spoke to my doctor on return and she concurred that it was a combo of flight swelling, heat swelling and extra walking. Elevation, compression and rest."}, {"username": "Alessandro Iannelli", "comment_text": "I would go to the pronto soccorso (equivalent of the er) but be aware that could take anywhere from 1 to 12 hours. It's what I would do nevertheless. Option B, you could at least go to a pharmacy and see if someone is willing to have a look at it and prescribe something."}, {"username": "Joan Klein-Rosenbaum", "comment_text": "After visiting a theme park, a person may sometimes find that they have a rash on their ankles and lower legs. Disney rash, which gets this nickname from the popular theme park, is actually exercise-induce\nd vasculitis (EIV). EIV is also known as: golfer's"}, {"username": "Mike Alioto", "comment_text": "Heat rash- apply a lot of sunscreen. Cold compress may help too"}, {"username": "Nanette Mlynarczyk Nelson", "comment_text": "I tend to have allergic reaction to hotel laundry detergents when I travel, if it only happens where you're exposed to sheets, could be the culprit. Benadryl is your friend if that's the case. Cellulitis doesn't usually occur on both legs like that, that would be highly unusual. Could be heat rash."}, {"username": "Liza Vega Santos", "comment_text": "I saw a family from the tour we had yesterday, they all had those on their legs, too. I hope they’re not itchy? You can go to a nearest pharmacy they’ll advise you what medicine is best. I had mosquito bites when I went to Pisa, a pharmacist from Roma Termini was very helpful."}, {"username": "Mike Jamison", "comment_text": "That literally happened to my wife while we were touring roam in 105 degree heat. Ended up being heat rash and healed up in a few days."}, {"username": "Reina Pike", "comment_text": "http://\nmobile.060608.it\n/en/\naccoglienza/\nservizi/\nemergenze-e-nume\nri-utili/\nguardia-medica-t\nuristica.html#:\n~:text=Emergenc\ny%20Medical%20U\nnit%20for%20Tou\nrists,Services%\n20%2F%20Hospita\nlity%20%2D%2006\n0608.it"}, {"username": "Amanda Jane Worthington", "comment_text": "I visited the emergency department of Florence’s Santa Maria Nuova Hospital in 2014 after a fall. They were fantastic! So thorough, so professional, so knowledgable. In fact I thought they were better than an Australian emergency department. I would recommend you go to the emergency department for peace of mind. And if you’re Australian there is NO charge because Italy & Oz have a reciprocal arrangement 🇮🇹 ♥️"}, {"username": "Valerie Dalena", "comment_text": "Cellulitis?! See a doc!!"}, {"username": "Lauren Vassallo Beattie", "comment_text": "It could be so many things, heat rash, cellulitis, allergy best see a dr."}]}, {"id": "2206191289779949", "text": "Which would be the best accommodation to pick in Florence of the 5 options? It’s our first time.\n\n*The Airbnb is the red house on the map.\n\nTIA 😌", "link": "facebook.com/groups/1373361046396315/permalink/2206191289779949/", "likes": 4, "comments": [{"username": "निनावी सहभागी", "comment_text": "Can someone kindly advise on the best location(s) 🙏🏻"}, {"username": "Frank Hunt", "comment_text": "No idea but being near a rail station might be handy"}, {"username": "Саша Савино", "comment_text": "Absolutely 2! Other Numbers so far."}, {"username": "Cathy Tabaku", "comment_text": "1,3,4 are nice areas but more of the “suburbs” and are outside of the city center so if you don’t want to spend all your time navigating public transportation and traveling to destinations, you should go with 2 for sure. Consider the boulevard encircling the center as your guide to stay within"}, {"username": "Rob Kitchen", "comment_text": "2 if not 5"}, {"username": "Bonnie Clarke Chipman", "comment_text": "I think 2 would be the best location."}, {"username": "Blanca Gil", "comment_text": "I would go with 2 as it is closer to the city center. The locations are outside of the center of town."}, {"username": "Sande Ricci", "comment_text": "We stayed in a VRBO in Santa Maria Novella square. It was great! Close enough to the train and walking distance to everything!"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "2 and 5. 5 it should be super central but slightly less touristy, more a place for Italians."}, {"username": "Kath Milburn", "comment_text": "2"}, {"username": "Dafne Vassetti", "comment_text": "I live in Florence and I am Italian. Please, do either 3 or 5. 4 and 2 will be frustrated for you to move around. From 3 and 5 you can literally walk everywhere."}, {"username": "Angie Tripp", "comment_text": "."}, {"username": "Yuko Y Smith", "comment_text": "2or 5"}, {"username": "Kevin Smith", "comment_text": "5"}]}, {"id": "2206247163107695", "text": "Starting to look for flights to Venice/Rome from Boston for next June. Cheapest flights are through Tap (Air Portugal). Looking for reviews of this airline. TY !", "link": "facebook.com/groups/1373361046396315/permalink/2206247163107695/", "likes": 0, "comments": []}, {"id": "2206257389773339", "text": "Travelling to Italy, France, Spain and Switzerland next year. Need to get a local SIM card. Where would be the best place. I’ve been told to stay away from airports! Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2206257389773339/", "likes": 1, "comments": [{"username": "Daniele Zarka", "comment_text": "Can your phone take e-sim? Airalo is the easiest thing ever"}, {"username": "Jenny Payne", "comment_text": "In Italy I use the company called Tim, but go on Line first and see what they charge and take a photo of it as I got caught in Florence and the young man told me €50 was the only price & that was from Tim company I was so cross as every year I go & could get a sim for a lot less. Was not good for the company as when I came bk to Australia told everyone don’t use that company ,was only one person to said that 🌻"}, {"username": "Frannie Kaplan", "comment_text": "One with the most beneficial fees with switzerland as it's outside of the EU"}, {"username": "Jackie Gotelli", "comment_text": "I use the company Three each time I go to Europe (and when I lived there for 5 months). You can purchase a short term plan for a SIM card or even a Wi-Fi hotspot depending on your needs. You can search for storefronts through the city you’re landing in."}]}, {"id": "2206262103106201", "text": "Has anyone stayed at Hotel Piazza Bellini in Naples? Recommendations for one night on way to Sorrento….", "link": "facebook.com/groups/1373361046396315/permalink/2206262103106201/", "likes": 0, "comments": []}, {"id": "2206263906439354", "text": "Best (while still reasonable) hotel in Florence for 2 nights next July?\n\nAlso going to be eloping 💍 while there, recommendations for where that can be done?", "link": "facebook.com/groups/1373361046396315/permalink/2206263906439354/", "likes": 0, "comments": [{"username": "Sandy Radican Shikaly", "comment_text": "Hotel Brunelleschi!!!\n!"}]}, {"id": "2206264619772616", "text": "I'm planning a 10 day trip to Italy next September and I'm having a hard time narrowing down which cities to visit. I'm not much of a history buff, and I'm thinking of sticking mostly with the south, but I'm open to suggestions/advice!", "link": "facebook.com/groups/1373361046396315/permalink/2206264619772616/", "likes": 0, "comments": []}, {"id": "2206265086439236", "text": "We are trying to find best smaller towns , places to see, places to eat near genoa and verona ... would love advice", "link": "facebook.com/groups/1373361046396315/permalink/2206265086439236/", "likes": 0, "comments": [{"username": "Aaron Peterson", "comment_text": "Near Verona go to Bassano Del Grappa near Genoa go to Santa Margherita Ligure"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2206272613105150", "text": "Hi looking for a great tattoo artist in Florence!\nAny recommendations\n??", "link": "facebook.com/groups/1373361046396315/permalink/2206272613105150/", "likes": 2, "comments": [{"username": "Albert Campagna", "comment_text": "Michel Angelo Bonarotti"}]}, {"id": "2206273959771682", "text": "My husband and I are trying to squeeze in Pompeii/Mt. Vesuvius on the last day of our trip (10/6). We will be coming via Ferry from Amalfi town with the earliest arrival of 10:40. Our Pompeii tour starts at 12. Our Mt. Vesuvius tour starts at 3:30 and ends at 6:30. Long story short the ferry times, train times, bus times, tour times, etc.आणखी essentially have left us to find our own transportation from Naples Ferry Port to Pompeii Archaeological Park and back. I am having trouble finding a transfer that will pick us up from the Ferry Port.\n\nDoes anyone have any recommendations of a taxi service or am I missing any alternative options?\n\nWe chose the ferry because it was relatively cheap, quicker, and will have great views. But if it will ultimately set us back then I’m willing to cancel it.\n\nThanks in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2206273959771682/", "likes": 0, "comments": [{"username": "Jaime Cleek", "comment_text": "A train may be easier with a better time table"}, {"username": "Edoardo Casolo", "comment_text": "There should be a direct train"}, {"username": "Tom Duffy", "comment_text": "What I have read about the ferry is that in rough weather they get cancelled. I believe there is a train that takes you right to Pompeii or you can hire a Driver. RAINBOW is the name of one that I have seen on this thread"}, {"username": "Diane Davis Lawyer", "comment_text": "Try Rome to Rio app. It will give you all options available."}]}, {"id": "2206276669771411", "text": "Planning a trip to italy in October can you recommend for me a place in these cities:\nMore important location, location, location\nClose to city centers\nMilan\nFlorence\nSalermo\nNapoles\nGracie mille", "link": "facebook.com/groups/1373361046396315/permalink/2206276669771411/", "likes": 0, "comments": [{"username": "Jeanne Eliason", "comment_text": "I've recommended Hotel David before on this site. It's within walking distance of \"downtown \" and is on Michelangelo street. So walking up the hill to that piazza is fun. Plus the cemetery at the top is something to see. I know. Cemetery? It is like nothing I've ever seen before."}]}, {"id": "2206341869764891", "text": "What time does public transport start? I need to get to Rome airport by 6:30am to fly out to Athens.", "link": "facebook.com/groups/1373361046396315/permalink/2206341869764891/", "likes": 0, "comments": [{"username": "Jaime Cleek", "comment_text": "Check the schedules on the websites\nThere is a shuttle I think from the train station to the airport. Also likely can catch a taxi"}, {"username": "Carmine Castiglia Jr", "comment_text": "If you can get yourself to Roma Termini (the main train station), you can take the Leonardo Express train directly to FCO. Or, ask at your hotel's front desk about arranging a taxi, either to Termini or directly to FCO.\n\nhttps://\nwww.rome-airport\n.info/\nleonardo-express\n.html"}]}, {"id": "2206306879768390", "text": "Hello from Tokyo. I have a concern regarding custom once arrive at the airport in Rome. I have a birthday gift for my friend( Apple watch). Are they going to tax me for it? Thank you ! 🙇🏼‍♀️", "link": "facebook.com/groups/1373361046396315/permalink/2206306879768390/", "likes": 1, "comments": [{"username": "James Saxton", "comment_text": "Keep the receipt."}]}, {"id": "2206346643097747", "text": "Those of you who have traveled with Insight Travel on Best of Italy Tour, any additional attempts to upsell on stuff after Venice?\n\nThe Murano glass tour felt like such a monumental waste of time… 10 minute glass blowing demonstration (I’ve seen one before elsewhere and it honestly wasn’t any different) followed by an hour of high pressure sales. To think we paid of this is kind of frustrating.", "link": "facebook.com/groups/1373361046396315/permalink/2206346643097747/", "likes": 0, "comments": []}, {"id": "2206349129764165", "text": "Ciao fellow travelers. I am planning a 15 night Italian vacation. 5 of those nights I plan to spend in Tuscany. My husband and I are huge wine fans and will spend time touring different wineries and small towns in the hills of Tuscany. We are looking for recommendations of a great agriturismo to stay at. We want something authentic where we could possibly take a cooking class, and a bonus if the accommodations have cats and such running around(I’m a big animal fan). Thank you in advance for your recommendations!", "link": "facebook.com/groups/1373361046396315/permalink/2206349129764165/", "likes": 0, "comments": [{"username": "Alice Francesca", "comment_text": "https://\nwww.montalcinowi\nnetours.com/\nwhat-to-see/\nthe-val-dorcia/"}, {"username": "Sedalise Hernandez", "comment_text": "https://\nwww.google.com/\nsearch?q=pensier\ni+di+cavatina&i\ne=UTF-8&oe=UTF-\n8&hl=en-us&clie\nnt=safari\nWe absolutely loved this place! Close to Siena! Very personable!!"}, {"username": "Linda Mascaro", "comment_text": "Cook in Tuscany"}, {"username": "Pam Armenia O'Brien", "comment_text": "Querceto di Castellina"}, {"username": "Starla Dawn", "comment_text": "We had the best time at this Farm To Table Winery and loved horseback riding in Tuscany.\n\nhttps://\nwww.tripadvisor.\nca/\nAttractionBookin\ngDetails-a10164\n31795-a_reserva\ntionId.D5Qa__2D\n__H858BKKSKZJYT\n-a_reservationT\noken.d694lmobi9\n95pbyrx3qs8jnqc"}]}, {"id": "2206377316428013", "text": "My reel from Colosseum from recent visit… I myself only cant get over it 🫠 happy to share 🏛️", "link": "facebook.com/groups/1373361046396315/permalink/2206377316428013/", "likes": 35, "comments": [{"username": "Pam Lewis", "comment_text": "thanks"}, {"username": "Donna Hinton", "comment_text": "Very cool! It is an amazing place.."}, {"username": "Cindy Neilson", "comment_text": "Probably my favourite theme song 🙏"}, {"username": "Sylvia Martinez", "comment_text": "Beautiful! Is the Colosseum open to the public everyday?"}]}, {"id": "2206387799760298", "text": "what is the best place to park your car if you go to florence in august?", "link": "facebook.com/groups/1373361046396315/permalink/2206387799760298/", "likes": 0, "comments": [{"username": "Lou Silluzio", "comment_text": "Australia 🇦🇺"}, {"username": "Maria LoSurdo", "comment_text": "Why would you drive?? Where from?"}]}, {"id": "2206392069759871", "text": "Please help!! We are heading to Italy next Friday for 17 days, first stop is Rome. We’ve had to plan this trip rather last minute and are desperately looking for tickets for a Vatican/Sistine chapel and a separate coliseum tour. Anyone know where to get last minute tickets?? Family of four, looking for Aug 13 and 14. I’m so stressed about this😩", "link": "facebook.com/groups/1373361046396315/permalink/2206392069759871/", "likes": 5, "comments": [{"username": "Sarah Hadjinian Kirakossian", "comment_text": "Get your guide has two tours in 1 day package. We did it and were very satisfied."}, {"username": "Effie Gatanas Kontolios", "comment_text": "I used Liv Tours snd booked a semi private tour. It was wonderful!"}, {"username": "Sue Levy Avinir", "comment_text": "We used crown tours for Vatican and Sistine chapel and booked thru Viator for colosseum which outsourced to another company. Use the tour apps. I also saw a lot of The Tour Guy everywhere. be offers. Just check"}, {"username": "Jessica Palladino", "comment_text": "I used Crown Tours and we were completely scammed. I would advise against them"}, {"username": "Cindy Morgan Schmoe", "comment_text": "Expedia"}, {"username": "Farheen Rahman", "comment_text": "How much do these tours cost for a family of 4? Two adults and two children? Just want to get an idea so don’t scammed while booking. Thanks."}, {"username": "Angie Davidson", "comment_text": "Or just wait in line to buy tickets. The line the other day was about an hour. From our experience a couple days ago, most things you can just wait in line. We bought tickets ahead of time so we didn’t have to wait in the lines, but I didn’t realize you can just wait and buy tickets."}, {"username": "Lauren Slann", "comment_text": "Keep checking coopculture, the refresh tickets and have plenty in august right now"}, {"username": "Terry Pisano", "comment_text": "First I would beg you to stop stressing! So much to see and do that if worse comes to worst, you save those for another trip and enjoy the beauty that will surround you! I do hope you get the tickets you want!"}, {"username": "Allison Taeger Wilson", "comment_text": "Check the Co-op Culture site 7 days before you want to go I had my choice of times and experiences for the Colosseum booking directly with them."}, {"username": "Karen Blackmore", "comment_text": "Don't stress! The Colosseum often have tickets released via Coop culture website 7d before. Recommend Tiqets for St Peter's Basilica dome climb in Vatican city. Looks like the Vatican main website tickets are sold out. But there is plenty to see in Rome, so just enjoy it!"}, {"username": "D'Anna Sullivan", "comment_text": "City Wonders."}, {"username": "Preston Denney", "comment_text": "Try CityWonders tours"}, {"username": "Roxanne Curzi", "comment_text": "Try the breakfast at the vatican"}, {"username": "Tania Bourgoin", "comment_text": "Get a RomaPass, they have dedicated reservations for the Colosseum and Roman Forum, as well as the Villa Borghese"}, {"username": "Stephanie Lubin", "comment_text": "Download the APP “Get your Guide” check that out .. you will be fine."}, {"username": "Eileen Muro", "comment_text": "We bought our Coliseum/ Forum tickets thru Viator. We went with The Tour Guy for our tour. No complaints"}, {"username": "Jazz Caldwell", "comment_text": "Forgive me..."}, {"username": "Michelle Prince", "comment_text": "we used get your guide for our Vatican tour and do e the early morning one when it wasn't so crowded"}, {"username": "Carole Gucozumian Roche", "comment_text": "Vous avez des places pour lemes musées du Vatican + chapelle Sixtine le 14 à 8h30 avec visite en groupe en italien ! Ca vous permet de rentrer sans faire la queue, et au pire vous quittez votre guide et votre groupe et vous visitez seuls!"}, {"username": "Laura Irmina", "comment_text": "Calm down, please!😁 there is so much to see in Rome. In case you don't buy the tickets, just see the Colosseum from the outside (still stunning and there is really not much to see on the inside). St. Peters Basilica is free and breathtaking, while Vatican Museums are extremely crowded, I couldn't even take a closer look on anything because of people flowing😆 it will be a great trip anyway, I promise you!"}]}, {"id": "2206397843092627", "text": "Hi everyone - we are staying in Porto Rotondo in Sardinia beginning October - first time! Will be there for 4 days and have a hire car. Just wondering if anyone has been in that area what would be some of your recommendations of places to visit. We fly in and out of Olbia. Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2206397843092627/", "likes": 0, "comments": []}, {"id": "2206419983090413", "text": "Worst experience with Eternal Tours Rome!\nBooked a very expensive tour to Pompeii with them. When I inquired (day before tour) when I will receive our train tickets, they told me I have cancelled the tour 18 hours before tour starts! What a shock! They said they are busy with the refund, and can’t change anything. Refund? As this is aआणखी non-refundable tour if tour was cancelled by you. I am so disappointed! One of the reasons I decided to visit Italy was to visit Pompeii. Luckily my tour operator organized a new tour with City Wonders! Absolutely excellent!", "link": "facebook.com/groups/1373361046396315/permalink/2206419983090413/", "likes": 4, "comments": [{"username": "Jaime Cleek", "comment_text": "At least you had another option."}, {"username": "Ian Fawkner", "comment_text": "Also be wary of the crew that corral you off the train into a small room - appear to be offering you official options and advice - purely a rip off - just keep walking left along the road to the entry point of the site - plus there are free restrooms inside the facility."}, {"username": "Carmine Recine", "comment_text": "Viatours you never go wrong very good operator"}, {"username": "Aaron Peterson", "comment_text": "Go to Herculaneum"}, {"username": "Melanie Matthews Stuprich", "comment_text": "Glad you had another option! That would be very frustrating and if I lived anywhere near you (used to live in Naples but now many years later I live in Sicily) I would have taken you myself if you didn’t find a new tour! It’s hard to know who to trust when booking tours for sure. We just always went ourselves when we lived there 20 years ago. We actually got to visit for the first time this spring after so long and my husband booked a private tour guide, it was amazing! But always fearful of things getting canceled last minute!"}, {"username": "Cristina Samuels", "comment_text": "Cancel the charges with your credit card"}]}, {"id": "2206426606423084", "text": "Hello everyone! We are planning to travel from Naples to Amalfi and plan on stopping in Pompeii. QUESTION: Where can we leave our luggage 🧳 during the day? Thank you in advance ❤️🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2206426606423084/", "likes": 1, "comments": [{"username": "Sarah Bond", "comment_text": "There’s luggage storage at the entrance to Pompeii. Lockers for smaller bags and a ticket system for bigger bags.\n\nJust be aware that there are two train stations. The main station is about 1.8kms from the entrance. The smaller station is right at the entrance.\n\nTaxi quoted me €20 one way to the main station. Not ideal with a 20kg backpack but I was so outraged with the price I think I stomped the whole way there 😂"}, {"username": "Jenny Payne", "comment_text": "Why can’t you leave your luggage where you came from Naples? if it is a hotel they will hold it for you , I would imagine? My Rome hotel do it for me🌻"}]}, {"id": "2206452239753854", "text": "Hi. My husband and I will be in the Dolomites for 3 nights from the start of October and are wondering which would be the best town to stay in without a car. We would like to visit Lago di Braes, Santa Magdalina, Tre Cimi, Val di Funes. Alp di Suesi Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2206452239753854/", "likes": 0, "comments": []}, {"id": "2206459589753119", "text": "About how long does it take at around 10;30 am to get your bag and go through passport ? Thank u. Landing in Milan.", "link": "facebook.com/groups/1373361046396315/permalink/2206459589753119/", "likes": 1, "comments": [{"username": "Ian Fawkner", "comment_text": "…depends what’s in it …"}, {"username": "Irene Oda", "comment_text": "It depends on how busy the airport is- how many flights the ground crew has to process the planes. Nit only that depending where you are coming from- how many officers are there for passport and customs. Allow for 2-3 hours at least."}, {"username": "Karen Blackmore", "comment_text": "Nobody knows! 🔮"}, {"username": "Bellafab Fabrizio", "comment_text": "Lol the day we landed there was a strike……… so pick a time….. any time at all. Also depends on how many planes land at the same time"}, {"username": "Bellafab Fabrizio", "comment_text": "If you traveling on an EU passport no time at sll its just if ur a foreigner. They have a no wait line for citizens"}]}, {"id": "2205992593133152", "text": "Recommendation for hotels near Rome FCO that is offer transportation to the city center", "link": "facebook.com/groups/1373361046396315/permalink/2205992593133152/", "likes": 0, "comments": []}, {"id": "2205875536478191", "text": "Hi. I'm going to be in Tuscany in late Sept early Oct. I'm trying to pack as little as possible. I'm starting my trip mid Sept in Sicily, so I'm packing sandals. My question, is it still warm enough to wear sandals in Tuscany by the time I arrive there?\n\nJust so you know, I will already have my Saucony runners. I'm thinking more along the lines of appropriate shoes with a nice dress. The sandals I will be taking would be perfect but not if it's too cold to wear them. Thank you everyone.", "link": "facebook.com/groups/1373361046396315/permalink/2205875536478191/", "likes": 10, "comments": [{"username": "Enrica Palla", "comment_text": "Generally no."}, {"username": "Gina Rovello Keenan", "comment_text": "I would check il Meteo for the weather before you go."}, {"username": "Greg Saba", "comment_text": "They don't allow flip flops, but we both hiked Cinque Terre in covered sandals on a very warm day in late September. And have spent many days all over Italy including Tuscany, lakes, and Dolomites in September and October with sandals. There may be days in October when you might want a sweater, mostly in evenings, but sweaters and sandals do go together."}, {"username": "Bea Kuckens", "comment_text": "Thin leather soles aren’t the best choice for the ancient cobblestone streets. No padding and no traction. A sport-type sandal will provide the most stability and comfort."}, {"username": "Anna Gambino", "comment_text": "It is still warm mid to late September."}, {"username": "Jeanne Eliason", "comment_text": "We always travel to Tuscany, think Orvieto, Arezzo, Siena, Montepulciano and around that area. I have always worn sandals and we walk a lot. If I would need other shoes well I am in Italy. They sell shoes."}, {"username": "Jeanne Eliason", "comment_text": "Sorry we go in October and May."}, {"username": "Alice Francesca", "comment_text": "Get a pair of comfy sneakers"}, {"username": "Fiona Mac", "comment_text": "Wear sketchers there comfy n some really nice styles too"}, {"username": "Mike Guluk", "comment_text": "yes"}, {"username": "Caroline Croghan", "comment_text": "I've had loads of beautiful, sunny times in Tuscany in September. Definitely bring sandals but also comfortable sneakers in case of an odd showery day. I've never been cold"}, {"username": "Pegi Fuller", "comment_text": "We were in Tuscany in late September,early\nOctober and sandals were just fine. It was lovely during the day and cooled down to sweater weather in the evening"}]}, {"id": "2199229177142827", "text": "Flying into Venice, staying in Venice (2) nights, then going to hit the road in a rental car. Really do not want to go back to the Venice Airport to get the car. Has anyone picked up a rental in Venice metropolitan (piazzale roma)? Also planning on returning the car in Rome FCO. Recommendations🙂", "link": "facebook.com/groups/1373361046396315/permalink/2199229177142827/", "likes": 1, "comments": [{"username": "Sunny Lang Fan", "comment_text": "Following"}, {"username": "Penny May", "comment_text": "Following"}]}, {"id": "2204503829948695", "text": "Hello! When travelling with a group, how do people pay at restaurants? Is it frowned upon to ask for separate bills? Should we be paying by Euros, or can we all pay separately with Credit Card? TIA!\n\n*Edit* Thank you everyone! I received the answers I was looking for, so I turned off the comments. 🥰", "link": "facebook.com/groups/1373361046396315/permalink/2204503829948695/", "likes": 4, "comments": [{"username": "Kathryn Meltzer", "comment_text": "I would not expect them to split the bill. Use the app Splitwise to keep track of who owes what and then just pay each other later."}, {"username": "Wendy Spano Bracco", "comment_text": "They don’t really need to split the bill. When they come with the machine, just tell them how much to charge for each card. I wouldn’t do this with more than a few cards though. Three friends and we split the bill sometimes 1 all cash and the rest on a card. Other times, 2 cards. Yes, paying all cash per person for a large group is always the way to go. I would not want to be dealing with apps of who owes what."}, {"username": "Krissy DaRusso", "comment_text": "I’d definitely figure that out on your end! Keep track and send money through Venmo or cash."}, {"username": "Lori Wroblewski", "comment_text": "They do not like to split the bill"}, {"username": "Rachael Richardson", "comment_text": "They split the bill if you want just work it out yourselves and tell them how much you each want to pay ! We didn’t have a problem , somethings we even paid some cash some card"}, {"username": "Diane Leesmith", "comment_text": "Have a Kitty"}, {"username": "Lora de Vries", "comment_text": "Separate bills could be a problem. Why don´t you each pay for what you eat and drink and put in a little for a tip (if you so wish), this way it is fair to everyone? This way if someone orders something much more expensive be it drink or food, they just pay their fair share instead of splitting the bill equally, otherwise someone else has to pay more for the extra expensive consumed and this could cause some stress when the next meal and bill comes around."}, {"username": "Sandy Radican Shikaly", "comment_text": "Separate checks is not common there.. bring cash"}, {"username": "Manuela Bassetti", "comment_text": "It really depends, there are places where you can tell what you ordered and pay just that, places where they divide the total for the number of people and everyone will pay the same, and there are places that don’t split the bill. It’s a good idea to ask when you arrive so you know what to expect when it’s time to pay. Also, it’s not legal for restaurant (or shops or taxi) to not accept credit cards"}, {"username": "Veronica Bossi", "comment_text": "We are in Italy rn. In Lucca it was not an option and in Rome it is not an option. I am traveling with my bf and family we are 7 people and we have to keep track of who eats what to then pay back the one person paying."}, {"username": "Jay Parekh", "comment_text": "If you trust who you’re with, use SplitWise app. It’s great for this use case."}, {"username": "Betty Stilt", "comment_text": "Separate checks is time-consuming for the server who may be very busy."}, {"username": "Carrie Jaquess", "comment_text": "If you’re family or close friends (as opposed to people you just met on your tour group) I highly suggest everyone paying a set amount into a kitty from which restaurant bills are paid. This only works if you trust the people you’re sharing with to not consistently over-order or to at least supplement the kitty if they’re frequently the only one who orders more to eat/drink than the others. When the kitty needs to be fed, everyone kicks in the same amount. We’ve done this on several trips with extended family members and it either for us."}, {"username": "Amy Schmelzle Walsh", "comment_text": "They did not split any bills for us! We traded off and if I would have known I would have used splitwise"}, {"username": "Tami Sue", "comment_text": "Take turns to pay"}, {"username": "Penny Chevront", "comment_text": "Four of us just got back from two weeks in Italy. Used Splitwise for everything including taxi fares, so easy. Paid up upon returning to the US."}, {"username": "Beth Stratton-Woodland", "comment_text": "Just travelled with 3 other families. Get the bill. Each family uses their phone calculator to add up what their family ordered. All restaurants allowed 4 different credit card transactions but won’t separate the bill for you. The final day of our trip we had it down to a science."}, {"username": "Annie Micale Webb", "comment_text": "Another vote for Splitwise app. It makes it so easy to keep track and settle up at the end of the trip."}, {"username": "Patty Barnes", "comment_text": "Thank you for asking this specific question. I was wondering the same thing."}]}, {"id": "2205869336478811", "text": "Hoping to get some recommendations on where to stay near Florence. We are not traveling until October 2024 so I have the luxury of time. Very interested in agriturismo and thinking it may be best to stay outside but near Florence. We want to take day trips to Bologna, Reggio Emilia and possibly Chianti. Where do you recommend staying to allow usआणखी to take several day trips to the north and south areas of Tuscany. TIA\nAlso -doesn’t have to be a farm house but love the idea of our view being the rolling hills and grape vines 😁\n\nEdit-forgot to mention we will be renting a car in Florence so we have access to even remote areas.", "link": "facebook.com/groups/1373361046396315/permalink/2205869336478811/", "likes": 2, "comments": [{"username": "Kathy Kibbe", "comment_text": "Fiesole is just above Florence - beautiful views but a quick, inexpensive bus trip to Florence from the town square - so easy to get to the train station to get to Bologna, etc. You can also book drivers/tours to places in Tuscany (Chianti, etc) from Florence."}, {"username": "Karen Michelle Lucero", "comment_text": "Following; Kristin Huff"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2205992613133150", "text": "IMPORTANT PIZZA ANNOUNCEMENT 📣🍕\n\nIf you’re ever staying or passing through Positano Mele Pizza & Grill is an absolute MUST. Best pizza I have ever had and nothing has compared to it since! I believe there is 2आणखी Mele restaurants in Positano, this one is the one hidden away & down some stairs.\n\nI broke my rule of never going to a place twice while travelling as there’s too much choice and im always wanting to try as much as I can, but this was too good to not go back again.\n\nFirst night was pizzas and the second time we got the seafood. The seafood was unbelievable, fresh and amazing flavours!\n\nChilled atmosphere at this particular Mele restaurant, service was also amazing, friendly staff. They even made me a cocktail that wasn’t on the menu which was 11/10.\n\nI honestly couldn’t fault anything about this place!", "link": "facebook.com/groups/1373361046396315/permalink/2205992613133150/", "likes": 6, "comments": [{"username": "Meredith Williams", "comment_text": "we went twice too!"}]}, {"id": "2205993209799757", "text": "Has anyone used Marinobus to travel across Italy? The trip we need to take, Naples to Molfetta (Puglia region), would require 2 regional trains and one high speed over 4.5 hours. Or we could take a Marinobus direct for 3 hours and less cost. Renting and driving ourselves is not an option! I don't see many people taking a bus so I'm wondering about it!", "link": "facebook.com/groups/1373361046396315/permalink/2205993209799757/", "likes": 1, "comments": [{"username": "Alessandro Iannelli", "comment_text": "Sure, why not. Sometimes I take buses to move from one place to another, if you can get to your destination in just 3 hours that's great."}, {"username": "Laura Uribe", "comment_text": "We’ve taken several different buses and never had an issue. I wouldn’t hesitate to do so."}]}, {"id": "2205997646465980", "text": "Advice on getting from Roma Termini to The Sistine Chapel please? Is the tram easy, just tap on tap off? Or do I need to download an app? Thank you 🙂", "link": "facebook.com/groups/1373361046396315/permalink/2205997646465980/", "likes": 5, "comments": [{"username": "Greg Saba", "comment_text": "If you are able, it's an easy and safe one hour walk through lots of interesting and notable parts of Rome."}, {"username": "Eric Parks", "comment_text": "I'd take the metro to Ottoviano then walk the rest."}, {"username": "Toby Levy", "comment_text": "What tram ??! Walked past the tram lines, over the tram lines and alongside the tram lines for over a week and never saw a tram!!"}, {"username": "Mark Boyce", "comment_text": "Metro Orange line goes from Temini to the Vatican area. https://\nwww.rome.net/\nmetro"}, {"username": "Philip Curnow", "comment_text": "Take the Metro A from Termini to the Ottaviano stop. Simple as that. Buy a regular ticket for €1.50."}, {"username": "Frannie Kaplan", "comment_text": "No, there's a bit on foot even if you take the metro"}]}, {"id": "2205998143132597", "text": "Who has used Travel Zoo for their Italy trip? First time planning a big trip and was recommended this site. Yay or Nay and why?", "link": "facebook.com/groups/1373361046396315/permalink/2205998143132597/", "likes": 0, "comments": [{"username": "Yesi Lopez", "comment_text": "I used tripmasters"}, {"username": "Karen Schmidt", "comment_text": "I love travel zoo for lots if things…but wouldn’t use them to plan a trip to Italy"}]}, {"id": "2206012849797793", "text": "Hello! We actually have a car rental with a drop off at Naples airport. The planning is to take a cab to get in the center of naples for our 2 days trip in the city.\n\nI’m wondering: could it be a better plan to drop off the car at the train station? I have this option, but my first thought was that there would be too much chaos and trafic to drive into the city😄\n\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2206012849797793/", "likes": 0, "comments": [{"username": "Ona Gardemeister", "comment_text": "I'd prefer leaving the car at the airport, the traffic in Naples is pretty chaotic. We once left the rental car to a carage in the city centre for our two day trip and it was not very pleasant to drive in the city. But of course, if You enjoy driving in the chaos and are used to it, leave the car in the city centre :)"}]}, {"id": "2206005966465148", "text": "my painting of an archway in Viterbo", "link": "facebook.com/groups/1373361046396315/permalink/2206005966465148/", "likes": 82, "comments": [{"username": "Andrea Romano", "comment_text": "Andrea Romano"}, {"username": "Abla Tannous", "comment_text": "Amazing, especially the lights and shadows"}, {"username": "Beverly Bovo", "comment_text": "Absolutely amazing"}, {"username": "Valerie Noyer", "comment_text": "Spectacular!"}, {"username": "Andrea Zimmerman", "comment_text": "Beautiful! 👏"}, {"username": "Janet Milone Cataldo", "comment_text": "A great talent !"}, {"username": "Patty Gaskin", "comment_text": "Amazing!! You're very talented!"}, {"username": "Cari Berdut", "comment_text": "Very impressive!"}, {"username": "Christine Rickert", "comment_text": "Not an easy scene to paint! You’ve done a great job!"}, {"username": "Virginia Sudol", "comment_text": "You are so talented! 💞🌸💕"}, {"username": "Annette Giovia", "comment_text": "BEAUTIFUL!!"}, {"username": "Robyn Lawson", "comment_text": "Love your work. Such talent 😊"}, {"username": "Grace Romano", "comment_text": "Grace Romano"}]}, {"id": "2206014546464290", "text": "Looking for advice about travel from portofino to Rome by train? Should I prebook - it looks as though there are several different trains with 1 or 3 changes.\nIs the train station easy to access - we will be coming from a cruise ship.\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2206014546464290/", "likes": 0, "comments": [{"username": "Rhona OConnor", "comment_text": "The stations are easy to access. Most have lifts to the platforms. There are steps up to the trains and you need to be able to lift your own bag onto the train and possibly onto the overhead shelf. Depending on your journey you may have to change trains."}]}, {"id": "2206021589796919", "text": "I love all of the travel tips this group shares, it's so helpful! We are taking the 11/9 bus from the Via Garibaldi station in La Spezi to Porto Venere - can we bring our standard 'carry on' luggage on the bus or in storage under the bus? Size will be approx 22x14x9 inches.", "link": "facebook.com/groups/1373361046396315/permalink/2206021589796919/", "likes": 0, "comments": []}, {"id": "2206030293129382", "text": "What fun things are there to do in Assisi with kids? Our tour passes through there and honestly after the Vatican I’m really up for skipping on the tours and just go do something fun with the kids to pass the time.\n\nI might go visit St. Mary of the Angels by myself early in the am but doubt they will find it interesting.", "link": "facebook.com/groups/1373361046396315/permalink/2206030293129382/", "likes": 2, "comments": [{"username": "Vivien Paulik", "comment_text": "Walk around and enjoy the scenery while you eating gelato. Assisi is not a big city"}, {"username": "Dr-Jon Warnecke", "comment_text": "Take a hike up Monte Subasio to walk around the castle ruins. Great views from there. My 8.5 month pregnant wife and I hiked it. She went into labor 12 hours later! Lol"}, {"username": "Amanda Gartner Franklin", "comment_text": "Our kids (6 and 8 ) really enjoyed the castle ruins and Eremo delle Carceri. There are also fun squares including one with a mini carousel. It’s a beautiful, quaint town that is great to just walk around without an agenda as well."}, {"username": "Caterina Liquori-Culhane", "comment_text": "The streets are so cool. It medieval. The view is fabulous. Lots of cute shops and pastries."}, {"username": "Nancy Kirby", "comment_text": "Go climb the hills up to the tower which they can climb"}, {"username": "Joe Green", "comment_text": "I visited Assisi after several days in Rome. Honestly, it's just so different. I visited the basilica and Francis tomb, then wandered up to the Poor Clare's church. Great pizza in the Square outside. Great shops. Very different from Rome."}, {"username": "Dafne Vassetti", "comment_text": "I would not skip the tour, having a guide for St Francis Church is a plus. Such a better experience than the Vatican (in my opinion). Once you are finished with the tour, you can walk up the castle as the others have mentioned. Kids will enjoy it.\n\nSanta Maria degli Angeli Is located in the modern part/lower part of the city. Not sure you will be able to go there if you are stopping in the upper part (which is the area people visit and most interesting part of the city)."}, {"username": "Melanie Baffes", "comment_text": "The kids might enjoy the hike up Mt. Subasio to Francis' hermitage. The carousel was on Piazza Santa Chiara but I notice they took it down last week, and I'm not sure it's back up. Try Bibenda for a lovely dinner, for pizza, Lievitum Mater."}]}, {"id": "2206031823129229", "text": "Anyone see these kind of drinks in Rome? CBD infusion, I do like one to unwind and relax just wondered if there is anything similar I would be able to find there?", "link": "facebook.com/groups/1373361046396315/permalink/2206031823129229/", "likes": 1, "comments": [{"username": "Rita Levi Montalbano", "comment_text": "No i think there arent"}, {"username": "Sar Ah", "comment_text": "There are cbd shops in sorrento so you might be lucky xx"}]}, {"id": "2206036029795475", "text": "Is it true that the only way out of the train station in Cinque Terre is up 300 steps? Coming by train from Florence.", "link": "facebook.com/groups/1373361046396315/permalink/2206036029795475/", "likes": 28, "comments": [{"username": "Maria Antidormi Corica", "comment_text": "There’s an elevator at Monterosso. I found that on last day! Definitely not 300 steps"}, {"username": "Steph Craddock", "comment_text": "There are 4 station. Corniglia is the only one with steps yes 300) there is a shuttle bus..but it gets packed."}, {"username": "Ashley Morris Podraza", "comment_text": "Only in Corniglia. There’s 350 of them. It wasn’t too difficult though!"}, {"username": "Santina Cotela Pezzin", "comment_text": "1. Some also have lifts you can use from train station itself to bottom into town if you have luggage - vernazza\n2. There’s a bus service in corniglia to take you into town. I think it was about 2 euro!!\n3. Vernazza is flat and town starts basically from train station and then 5 or 10 min walk takes you to the water. Very easy walk\n\nThis is from someone who fractured their ankle prior to leaving"}, {"username": "Dafne Vassetti", "comment_text": "From Florence you usually take a train to La Spezia (very walkable) and then from there you get the train to move back and forth between the 5 towns of Cinque Terre. Where is your hotel?"}, {"username": "Nathan Earl Stellenberg", "comment_text": "Any idea how many to climb in LA Spezia? At least I'm going to be fit as hell when I'm done with Italy, lol"}, {"username": "Arianna Reel Cook", "comment_text": "There’s a bus 🚌"}, {"username": "Louise Whittle", "comment_text": "Monterosso train Station takes you to a flat promenade with a little rise and fall to the opposite side. Riomagiore train station descends into the village to the harbour but there are steep steps both left and right to explore the village. Corniglia has a bus stop, albeit very crowded to run you up to the village. Something for everyone so don't worry 😉 The views are amazing ✨️"}, {"username": "PJ Rodríguez Núñez", "comment_text": "Is not true ! Corniglia have more steps but not the others. Riomaggiore was my favorite."}, {"username": "Anne Carroll", "comment_text": "The water bus is another way to access the The Cinque Terre. The scenery is fab from boat. We got it from La Spezia. It’s public transport to the area."}, {"username": "Kay Rendall", "comment_text": "Vernessa has few steps and a lift from the train platform to the village. There r some accom with many stairs and wonderful views, but some within the village, with hardly any. We stayed there in a b&b no stairs, right next to harbour. MAgic\nThen trained to all the other villages, a day each."}, {"username": "Paul Anderson", "comment_text": "There are five train stations. Which one?"}, {"username": "Melanie Fuger-Dolan", "comment_text": "Only one stop has 372 steps. But there’s a shuttle bus to go up to that specific town. The rest have the steps in and out of the train station"}, {"username": "Carly Moore", "comment_text": "Does anyone know how long it takes to hike from village to village? Is it really hard? I’ll have two kids with my 13 and 11. Thanks"}, {"username": "Fetchin Gretchen", "comment_text": "Yes, that is true for the Corniglia train station. Corniglia is the only village in Cinque Terre that is not located on the coast, but rather on a hilltop. The train station is located at the bottom of the hill, and the only way to get to the village is by climbing the 380 steps of the Lardarina staircase.\n\nIf you are coming by train from Florence, you will first arrive at the Monterosso al Mare train station. From there, you can take a local train to the Corniglia train station. The train ride is only about 5 minutes, but it is important to note that there are only a few trains per day that stop at Corniglia.\n\nIf you are not up for the climb, there is a shuttle bus that runs from the train station to the village center. The shuttle bus costs €1.50 per person, and it runs every 10-15 minutes.\n\nHere are some other things to keep in mind if you are planning on visiting Corniglia:\n\n* The village is very small, so it is easy to get around on foot.\n* There are no cars allowed in the village, so you will need to walk or take the shuttle bus to get around.\n* There are a few restaurants and shops in the village, but it is not a large tourist destination, so there are not as many options as in the other villages of Cinque Terre.\n* The views from the village are amazing, so be sure to take your time and enjoy them!"}, {"username": "AnaMaria Uceda", "comment_text": "From the five towns, that’s Corniglia. It was great to visit it but not to stay since you’d have to do those steps every day and more than once. However, they have a mini bus that will take you up the town but I never used it so I’m not sure how it works."}, {"username": "Debbie Zornes Ruch", "comment_text": "Only at Corniglia are there that many steps. There was a free shuttle running when I arrived."}, {"username": "Georgia Taylor", "comment_text": "I’m not sure if someone has said this already but if you get the Cinque Terre day pass for the train the bus up to corniglia from the train station is included & back down also 😊"}, {"username": "Maria LoSurdo", "comment_text": "Not at Monterosso!"}, {"username": "Jessica Garcia", "comment_text": "Daniel Garcia"}, {"username": "Kelly Aynes Zingaro", "comment_text": "Corniglia yes, not in Monterosso."}, {"username": "Fariha Ahmad", "comment_text": "Kashif Ahmad"}, {"username": "Cindy Grace", "comment_text": "Take the ferry"}, {"username": "Deborah Larsen", "comment_text": "Only in town of Corniglia. There are 365 steps to be exact, we stay there often as it is less visited than other towns for this reason. There is also a shuttle bus to the top."}, {"username": "Yvette Pavone", "comment_text": "Absolutely NOT"}, {"username": "Linda Heath", "comment_text": "Great question"}, {"username": "Lori Werfel King", "comment_text": "Start in monterosso and you’ll be walking DOWN the stairs at Corniglia which is the one you’re referring to. Then just take train on to riomaggiore from there. Best tip we got!"}, {"username": "Sue Kreger", "comment_text": "Marissa McLean I agree , stayed in\nLa Spezia , then caught the train to CT."}, {"username": "Kathleen M Slattery", "comment_text": "Monterossa was fine"}, {"username": "Mindy Lujan MacQuiddy", "comment_text": "There are steps all over Italy 😅\nAt any train station, up and down the platforms, in your hotels, stairs everywhere."}, {"username": "Alice Francesca", "comment_text": "It is called 5 terre because there are 5 villages . Get more info about each single one of these."}, {"username": "Sandra Yee", "comment_text": "I think it depends on which of the towns. There is a town famous for all its steps (I think Corniglia)but there is supposedly an trolley or bus there."}, {"username": "Ken Lerch", "comment_text": "There are obviously five (cinque) towns. Most all load directly into town. You'll have to check each of the towns."}, {"username": "Ryan Monahan", "comment_text": "Not true. That’s Corniglia. The towns all have steep sections but it’s quite navigable if you are in decent health. For example we stayed in Manarola and our room was easy, out of the train: walk 2 min through the tunnel, cross the street and walk up it about 50’. Then we went up one flight of stairs and into our door. Wasn’t hard at all."}, {"username": "Laura DeCicco", "comment_text": "Cinque Terre is not one train station, there are 5 and they all have steps but I believe someone has exaggerated the number of them to you"}, {"username": "Vivien Paulik", "comment_text": "Cinque Terre has cinque towns, so have to be more stations. But it basically a lot of steps everywhere, so if you do not like walking, it is not for you"}, {"username": "Sandra Yee", "comment_text": "Just in case you’re interested, there is a Cinque Terre Italia group that has many knowledgeable participants. 😁👍🏼☀️"}, {"username": "Deborah Schroeder", "comment_text": "You are talking about Corniglia and it is 380 steps I think. But if you have a train ticket, you can ride the bus for free. No elevator. All train stations in CT have stairs to get to and from the tracks. Nothing more than any train station."}, {"username": "Greg Saba", "comment_text": "All those steps in Corniglia are fairly gentle."}, {"username": "Judy Aaby", "comment_text": "Have been twice. The only station like this is Corniglia. I based myself out of Vernazza and walked or trained to all of them. Also there is a ferry which goes to all, except Corniglia. The steep cliffs prohibit landing.\nThat said, if you stay in Vernazza and want to avoid steps, pay attention to where you rent. There are steps going out of town to many of the Airbnbs…."}, {"username": "Terri Dalton", "comment_text": "We took a private transport from Florence to Monterosso. It was fabulous. We worked with Arianna and friends."}, {"username": "Rebecca Yeoh", "comment_text": "The town with the steps (Corniglia) has a small bus that takes people up and down from the station to the town. It’s very regular."}, {"username": "Amelia Bonannella", "comment_text": "Check which station you arrive into. Some trains go to La Spezia or Levanto, then you catch the regional train to the 5 villages of the Cinque Terre"}, {"username": "Michelle Scholtz Bain", "comment_text": "I was there in May - Corniglia has the 300 steps. We stayed in Monterosso and the train station was in between old town and new area and totally flat. The train station was close to our hotel!"}, {"username": "Shelby Symons", "comment_text": "We based ourselves in Manarola and the only stairs that one had was to get out of the station other than that it was flat walking same with Monterosso and Vernazza. Corniglia has a hill to get up to the village itself but you can catch a little community bus that comes every 10mins which we did as we didn't want to walk 😂"}, {"username": "Brad Nelsen", "comment_text": "Depends which of the 5 towns you’re referring to. There is a train station at each town."}, {"username": "Dora Nicolaou Moussoulidou", "comment_text": "I was there last May and visited all five villages. There are steps in Corniglia but there is also a bus taking you to the top so no need to worry! I’m not great with steps, either! Everything is doable!"}, {"username": "Kim Hull", "comment_text": "I stayed in Vernazza and there’s a lift"}, {"username": "Bellafab Fabrizio", "comment_text": "Non in monterosso"}, {"username": "Marissa McLean", "comment_text": "Cinque terre is 5 towns so they’re all different"}, {"username": "Puja Ray", "comment_text": "Can i buy pass online earlier or i can buy it from there only ? I’m coming to italy from canada in sept first week ?"}]}, {"id": "2206039583128453", "text": "Our golf cart tour for Aug 15 was just cancelled by Emotion Club Tours. Has anyone taken a golf cart tour recently that they can recommend?", "link": "facebook.com/groups/1373361046396315/permalink/2206039583128453/", "likes": 1, "comments": [{"username": "Kerrin Barassi", "comment_text": "Turtle tours"}, {"username": "Linda Chase", "comment_text": "LivTours"}]}, {"id": "2206042356461509", "text": "Going to Perugia for 5 and a half days. Any activities/places to visit with 3 kids (ages 3-15)? Will there be taxis at the airport or should I book airport shuttle in advance pls? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2206042356461509/", "likes": 0, "comments": [{"username": "Alessandro Iannelli", "comment_text": "Perugia airport is extremely small. I flew from there once and I only recall there being one bar, and no taxi (I took a bus from and to the airport). Anyways, I believe you can request a taxi service, there are local companies you can call for that."}]}, {"id": "2206042836461461", "text": "We only have one day in Rome. What are the top places we should see?", "link": "facebook.com/groups/1373361046396315/permalink/2206042836461461/", "likes": 5, "comments": [{"username": "Anthony McClure", "comment_text": "Vatican, castle st. Angelo, then walk around and see Spanish steps, Trevi fountain and the pantheon. Prato ares has great restaurants as well as a huge market."}, {"username": "Phyllis Flowers", "comment_text": "The Vatican, Spanish steps, trevi fountain. That should take a day"}, {"username": "Erwin Andres", "comment_text": "1.The Vatican ( St Peter's Basilica and Museum)\n\n2 . Trevi Fountain and the other sites surrounding the area.\n\n3. The Colloseum\n\nDo the Vatican in the morning if you want to see the basilica and the museum because the lines are crazy during the day! After that Trevi Fountain and the other sites surrounding it such as the Pantheon. By the afternoon you should be able to visit the Colloseum with the crowds dying down 😌\n\nBut depending on your schedule hope you have enough time to do what you want to do! Enjoy your time in Roma 💪"}, {"username": "Kassi Garan", "comment_text": "Spanish Steps, Pantheon, and Trevi are all walking, short stops. Start at Spanish Steps and work way to Pantheon. From Pantheon eat lunch at/in the Piazzo Navona. Then taxi to Colossuem for a tour or just see it from road and taxi on over to piazzale giuseppe garibaldi (park) for sunset w views of city. Then, walk down hill to Trastevere for dinner/drinks. It’ll be an action packed day and you’ll be tired but you will have DONE IT! lol"}, {"username": "Barbara Ellen", "comment_text": "Take a on and off bus tour. You can see all the sights and get off where you want to take pictures then take the next bus. Not a long wait in between. It was great!"}, {"username": "Diane Davis Lawyer", "comment_text": "https://\nwww.hotels.com/\ngo/italy/\nvisit-rome-24-ho\nurs"}, {"username": "Aj Bevilacqua", "comment_text": "If I had one day, I’d probably do the Roman forum, coliseum and Capitoline museum. They are all very close. Then you’d still have time to run by some of the sites like the pantheon and Trevi later in the evening around dinner time."}, {"username": "Igor Petrov", "comment_text": "Piazza Venezia, Trevi Fountain, Pantheon, Piazza Navona, and just walk on small streets between Navona and Spanish Steps. Don’t spend all the day trying to see everything, the day/week/month is not enough. But try to see small streets and people around, catch the atmosphere."}, {"username": "Tricia Harman", "comment_text": "Do the hop on hop off bus"}, {"username": "Berndt Weihs", "comment_text": "The center with Pantheon,Spanis\nh treps,Fontana di Trevi,Piazza Navona!!,Campo di Fiori or Trastevere for a lunch,the Colosseum and the Vatican but both from outside,your time is not enough for more."}, {"username": "Philip Curnow", "comment_text": "Can I suggest you end your day in Rome watching the sun majestically set over the city from the Gianicolo hill behind Trastevere. A view and a moment you will remember forever."}, {"username": "Kelly McChurch Rehn", "comment_text": "Hands down a golf cart tour and you’ll see it all."}, {"username": "Shaun Fairbairn", "comment_text": "They didn’t build Rome in a day 😉"}, {"username": "Shaun Fairbairn", "comment_text": "Why only one day? Do you have a day to kill before a flight out?\nWith the on ground logistics( waiting in lines, transport between attractions) there’s only so much you can accomplish. Vatican needs a whole day alone."}, {"username": "Frannie Kaplan", "comment_text": "For only one day enjoy the colosseum and eat somewhere in Monti or trastevere"}, {"username": "Gianna Onesi", "comment_text": "Pantheone"}, {"username": "Ian Beyer", "comment_text": "The top of the Sistine chapel, the top of fountains, the top of the Spanish Steps, the top of the Coliseum…"}, {"username": "Lisa DiDonato Hayden", "comment_text": "My husband and I did a Vespa sidecar tour and it was amazing! Hit all the main tourist spots!"}, {"username": "Mike Adams", "comment_text": "Take the hop on hop off bus- it hits all the top sites go around a. Couple of times and get off at what interested you the most"}, {"username": "Patricia Turner", "comment_text": "Something different besides the usually go up the glass elevator in the Altar of the Fatherland monument- speculator views of Rome. It’s amazing! Tickets are on line and inexpensive."}, {"username": "Elizabeth Brown Atkinson", "comment_text": "Extend your stay lol.. you there is a tour that does Vatican and Colosseum in one day… I would\nDo that"}, {"username": "Stephanie Earl Peterson", "comment_text": "Do a tour. We saw almost all the big sites in one day."}, {"username": "Lina Costantino Sirianni", "comment_text": "The colosseum, palatine hill and the trevi fountain"}, {"username": "Laura Arboleda", "comment_text": "Colloseum, trevi fountain and walk as much as you can to see the area. Beautiful!"}, {"username": "Laura Arboleda", "comment_text": "Golf cart tour would help because of time"}, {"username": "Alex Hicks", "comment_text": "Tours at the colosseum and the Vatican then walk by trevi fountain, pantheon and altar of the fatherland"}, {"username": "Ludwich Zenia Pretorius", "comment_text": "Have you ever been to Rome before?"}, {"username": "Kathleen Roll", "comment_text": "Depends what you like - history, art, sculpture, food, wine or religion etc."}, {"username": "Kirsty White Brien", "comment_text": "Heather Winbank"}, {"username": "Maria Brozou", "comment_text": "if you skip the vatican completely you can start at the colosseo and walk to pantheon & fontana di trevi and finish at the spanish steps all in just one day."}, {"username": "Phyllis Waring", "comment_text": "Trevi Fountain..Collo\nseum...Vatican"}, {"username": "Rebecca A. Baer", "comment_text": "Vatican, Colleseum, Trevi Fountain"}, {"username": "Mike Parrent", "comment_text": "I hope you have enough time to get out of airport"}, {"username": "Natalia Ottesen", "comment_text": "St. Peter 's Cathedral, Galeria Borghese"}, {"username": "Nancy Brennan Carrow", "comment_text": "I suggest doing a Golf cart tour so you get to see all the main sites in a couple hours. If planning to go to Vatican or Colosseum, pre book skip the line tours in advance."}, {"username": "Susan Lowry Lamb", "comment_text": "I'd buy the hop on hop off bus, go around a full time, then make the choice."}, {"username": "Wendy J. Calvin", "comment_text": "Maybe look into golf cart tours....in 3 to 4 hours you will see all the highlights...no\nt in detail though.\nLivtours.com; The Roman Guy; Viator; etc."}, {"username": "Shannon Uebelhor Fuhs", "comment_text": "St Peter’s Basilica and Trastevere area in the evening for dinner! These were the 2 highlights for us. Do the Vatican museum tour only if you can get a 7:30am tour. We enjoyed St Peters more than the museum anyway.\nFill in the afternoon with quick pics at the the historic sights (trevi, Spanish steps, etc) which you can walk to or take a golf cart tour."}]}, {"id": "2206046119794466", "text": "Has anyone travelled to Venice mid to late March? How was the weather? Did it prevent you from doing any activities or tours that you wanted to do?", "link": "facebook.com/groups/1373361046396315/permalink/2206046119794466/", "likes": 0, "comments": [{"username": "Rita Levi Montalbano", "comment_text": "Late march will be fine and most likely quite warm, around 18-20°. I was in venice multiple times in december-januar\ny and it was really doable"}, {"username": "Linda Chase", "comment_text": "I spent the last week of March in Venice. It was perfect!"}]}, {"id": "2206081159790962", "text": "We are going to Italy in September starting off in Venice. We have a cooking class scheduled, otherwise open. Do you think we can just see this area without a tour? I was going to checkout the basilica, market and such on our own. I know everyone has said wait to book gondolas as there are plenty when you get there. Thx", "link": "facebook.com/groups/1373361046396315/permalink/2206081159790962/", "likes": 0, "comments": [{"username": "Jackie Macleod", "comment_text": "Very very easily on your own, no need for tours. Just walk, it's small."}]}, {"id": "2206054149793663", "text": "Hello! I am in the beginning stages of planning our first international trip. There will be 7 of us total. This is my middle daughters high school graduation trip. I usually love planning our trips, but I’m getting a little overwhelmed.\n\nI think I need to look into a travel agent that specializes is in Italy. I need help with finding good closeआणखी hotels/VRBO, help with transpiration and restaurants to try. I already have an itinerary and all of our tours lined up that we would like to do. But it’s always helpful to learn new information. Can you please recommend an amazing travel agent that you have used and would highly recommend. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2206054149793663/", "likes": 3, "comments": [{"username": "Vanessa Stack Reese", "comment_text": "I found out when I booked mine- similar situation, we had 9 people- I tried to use a travel agent, but they can’t book Airbnb or Vrbo… so I went on my own, and found the most incredible houses! If you need recommendations\nfor Airbnb in Florence, Cinque Terre, lake como area, or Tuscany- we stayed in some amazing ones! Ps- Airbnb is much better in Italy and more common than Vrbo"}, {"username": "Nicole Beaumont", "comment_text": "No agent recommendations\n, but I planned a 3 week solo trip and used Rick Steves guidebook."}, {"username": "Greg Saba", "comment_text": "Be cautious with Airbnb and VRBO. If the host cancels, even minutes before your arrival, they provide little to zero support unlike hotels. You will be on your own. We had this happen recently, and we have seen many similar complaints on BBB site (including fake listings). Yes, you will get your money back, but no other help."}, {"username": "Jerry Kiger", "comment_text": "Any ideas on cost difference Travel Agent Vs Plan Own? Have same question … stress of planning for 6+ people or just paying TA to plan it out. Saw above comments lot good input …"}, {"username": "Jeff McLellan", "comment_text": "Where would you like to go?"}, {"username": "Jenny Frank", "comment_text": "You got his!\nWhat are your dates? What's the itinerary?\nAs to flying look at Air France or Delta.\nHotels?: how many rooms do u need?"}, {"username": "Katie White-Meade", "comment_text": "What area are you? Australian?"}, {"username": "Mike Guluk", "comment_text": "Send me your plans I am not an agent but I can give good free advice. Since you are obviously smart enough to have done your research you can easily book properly on your own. Might a tweak or 2 but Italy is easy. We have travelled the country extensively for 15 yrs my daughter lives there"}, {"username": "Mindy Marshall Lavin", "comment_text": "There have been a lot of comments on here the past couple of months about getting cancelled last minute, arriving at the location and it being not what was pictured and also of getting robbed. Be careful"}, {"username": "Gregg Pires", "comment_text": "Contact Nunzia at Joe Banana Limos...we booked our own airbnb's, but she took care of everything for our party of 5 for our 2 week stay in Florence, Rome and the Amalfi coast. Super honest, great integrity and very reasonably priced. We were also refered to her by a family of 12 that used her in June."}, {"username": "Margo Desjardins", "comment_text": "Can you send me the names of where you stayed in Florence and Sorrento please"}, {"username": "Stacey Esposito", "comment_text": "We stayed at bemate piazza navona 4 bedrooms 3 bathrooms full apt. Amazing in historic center walked to piazza navone trevi fountain angel castle ( still jetlagged not sure of proper name) st peters basilica. There was a taxi stand at corner so when it was too hot we grabbed a cab. In Venice we stayed at bemate rialto. It was a little hard to find but then again we got lost alot in Venice I mean a lot. It was right near the rialto bridge"}, {"username": "Bea Kuckens", "comment_text": "We have always stayed in hotels but we have multiple Air B & B's (all Superhost / lots of great reviews /\ncancellable) reserved for next year. We also have back-up reservations with hotels that can easily be cancelled online within 24 hours (hopefully won't be needed). Most hosts will also leave a list of restaurant recommendations, taxi instructions, etc. (Some have already provided this information to us many months out). A few will arrange car service from the airport or train station at reasonable rates. You don't need a travel agent, you just need to be thorough and organized. If you are an Apple user, Numbers has a template called Travel Planner that's a great start in organizing your plans."}, {"username": "Michele Liggett", "comment_text": "We're working with JayWay Travel for a customized trip for 2. Very happy with them. They gave us several hotels to pick from for each city. They are making travel arrangements like train, airport transfers to hotel, asked what type of tours we'd lijevto do and gave us a list to pick from. In the US I usually make all the plans myself but was not comfortable doing that in Italy especially since we don't speak Italian. I checked reviews for the hotel choices before picking one."}, {"username": "Cindy Leis", "comment_text": "Kris Levy :Donovan Travel"}, {"username": "Monica Roman-Fazio", "comment_text": "We used railbookers they booked our hotels and train tickets. They booked some of our tours also. I would definitely recommend viator for some tours. We took the gold carry tour in Rome and it was the best tour we took the whole trip. It took us everywhere even places we would never see it was great it was 4 of us and we loved it"}, {"username": "Pam Sibbald", "comment_text": "I would get a travel agent to book your hotels and trains. All tours you can book yourself but it is so nice to have the other stuff arranged for you with no extra cost."}, {"username": "Linh Doan Nguyen", "comment_text": "Lavishly Travel they know Italy very well."}, {"username": "Ann Treviño Mears", "comment_text": "We used Cultural Italy to help us with the part of our trip in Rome. They were amazing. They booked our train tickets from Florence to Italy, arranged for us to picked up at the train station and taken to our hotel, booked a golf cart tour on the afternoon of our arrival, booked private tours of the Roman Forum/\nColosseum, and arranged our transportation from our hotel in Rome to our hotel at the airport. Them taking care of everything really made the trip stress free and enjoyable!"}]}, {"id": "2206059769793101", "text": "We will be flying to Rome in Nov. and would like to stop and visit the sights before going to the hotel. I have read not to leave bags in the car, but have found bag lockers? What’s your experience?", "link": "facebook.com/groups/1373361046396315/permalink/2206059769793101/", "likes": 6, "comments": [{"username": "Lisa Talarico", "comment_text": "one thought is to go to the hotel and many will let you leave your bags before check in. if lucky, your room might even be available early :-)"}, {"username": "Phyllis Flowers", "comment_text": "I would just go to the hotel, freshen up then head out, check the bags at the front desk"}, {"username": "Alice Francesca", "comment_text": "Ask your hotel for an early check in.otherwise most hotels will let you stare your bags even before your room is ready"}, {"username": "Irene Oda", "comment_text": "Correct- do not leave bags in the car."}, {"username": "Joshua Pickles", "comment_text": "Don’t even leave a straw in your rental car"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "You are renting a car to visit Rome?"}, {"username": "Kevin Robison", "comment_text": "\"The sights\" aren't easy to visit via car because Rome is filled with them. You will also have to figure out how to avoid ZTLs. I've driven in Rome, but I'm normally going to one destination. If you hire a driver, they will have access to places you can't drive.\n\nMaybe hire a driver who picks you up at the airport and drives you around Rome for a few hours. Then, when you're ready to leave Rome after your stay there, pick up your car from Termini on your way out of the city."}]}, {"id": "2206061496459595", "text": "We are planning a trip to Italy. Do you recommend the train between cities? Do you book your tickets in advance or get them at the station when you are traveling between cities?", "link": "facebook.com/groups/1373361046396315/permalink/2206061496459595/", "likes": 0, "comments": [{"username": "Colleen Dawson", "comment_text": "The website Seat61 is a great resource for train travel in Italy."}, {"username": "Alice Francesca", "comment_text": "Trenitalia.it\nBook in advance"}, {"username": "Jeanne Eliason", "comment_text": "Where are you going? What airport are you flying into? Include more info for more decisive information please."}, {"username": "Rebecca Yeoh", "comment_text": "I second Trenitalia. The high speed trains are amazing. Pre-book your tickets (and choose your seats) ahead of time. I found in some cases that business class wasn’t too much more than economy. It’s worth the extra money as you get a snack and drinks (I even got complimentary wine on one of them)."}]}, {"id": "2206078939791184", "text": "In September, We are staying in Amalfi, can anyone recommend any beaches to go to?", "link": "facebook.com/groups/1373361046396315/permalink/2206078939791184/", "likes": 1, "comments": [{"username": "Ettore de Vita", "comment_text": "Lido Ravello"}, {"username": "Virginia Speedy", "comment_text": "Minori was lovely."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2206079473124464", "text": "And ciao from Cervinia, Valle d'Aosta region!the mountains on the NW of Italy .\nSpectacular places, perfect weather..and no crowds!", "link": "facebook.com/groups/1373361046396315/permalink/2206079473124464/", "likes": 65, "comments": [{"username": "Mark Andrews", "comment_text": "Looks like Germany country Beautiful"}, {"username": "Maria LaPietra Guerrero", "comment_text": "Looks gorgeous"}, {"username": "Geoff Plus Jann Mains", "comment_text": "Beautiful ❤"}]}, {"id": "2206112333121178", "text": "Hey, folks!\nBest places to eat and visit in Salerno?", "link": "facebook.com/groups/1373361046396315/permalink/2206112333121178/", "likes": 8, "comments": [{"username": "Tommasina Mele", "comment_text": "Giagiu"}, {"username": "Tommasina Mele", "comment_text": "Salerno Centro"}, {"username": "John Gugliucciello", "comment_text": "John Gugliucciello"}, {"username": "Julia Popova - Atanasova", "comment_text": "And what about the boats to Positano, Amalfi, etc. - is it better to use them, or the bus? Some tips&tricks 😇 We will be visiting the area in the middle of August."}, {"username": "Iman Nazaran", "comment_text": "Following"}, {"username": "Joan Belserene Forcheski", "comment_text": "Definitely visit the basilica of Salerno. So interesting."}, {"username": "Lucy Wong", "comment_text": "Al Dente spaghetteria. Must try if you like spaghetti !!!"}, {"username": "Lucy Wong", "comment_text": "Also take a short train ride to see Paestum 🤩"}, {"username": "Enrico Lecce", "comment_text": "My home town...."}, {"username": "Enrico Lecce", "comment_text": "Any where along the beach shore are many restaurants"}, {"username": "Dan Pieri", "comment_text": "Osteria nonna Maria,hole in the wall restaurant, my best dinner in Salerno last year as we were there 5 days!"}]}, {"id": "2206121263120285", "text": "Best way to travel from Rome to Praiano", "link": "facebook.com/groups/1373361046396315/permalink/2206121263120285/", "likes": 1, "comments": [{"username": "S.P. Espy", "comment_text": "I did this recently. Train to Salerno. Transfer from Salerno to Praiano. I’m a fan of Discovery Salerno for the transfer."}, {"username": "Brad Nelsen", "comment_text": "We caught fast train to Naples then had a driver pick us up for 1hr 30min drive there."}, {"username": "Kim Shea", "comment_text": "How far is the drive from rome to sorrento ? Is it driveable ? Or is the train better ?"}, {"username": "Kathy Smith", "comment_text": "We did the high speed train from Rome to Naples then a private transfer to our Villa in Praiano."}, {"username": "John Bruckman", "comment_text": "Train to Naples, ferry to Positano or Amalfi… taxi/car to Praiano"}, {"username": "Carolyn Hill Leptich", "comment_text": "We picked up a car at FCO and drove to Praiano, and then all around. :)"}, {"username": "Jennifer Gustafson", "comment_text": "Directions I received from someone living in Fiore: train from Rome to Salerno and then ferry to Amalfi. I’m not sure if ferry stops in Praiano or if you get off in Amalfi and taxi/bus to Praiano. We got off in Amalfi and took a taxi to our place in Conca dei Marini this way."}]}, {"id": "2206124093120002", "text": "Would you recommend City Wonder Tours or Liv tours?", "link": "facebook.com/groups/1373361046396315/permalink/2206124093120002/", "likes": 1, "comments": [{"username": "Christine Golia Brigida", "comment_text": "City wonders"}]}, {"id": "2206130133119398", "text": "Things todo in Turin?", "link": "facebook.com/groups/1373361046396315/permalink/2206130133119398/", "likes": 0, "comments": [{"username": "Gillian O'Callaghan", "comment_text": "Depends what your interests are....download\nVisit a City app. Have a look under \"things to do\" and \"things to see\". Decide what appeals."}]}, {"id": "2206133383119073", "text": "Going to Italy for two weeks in September with two lifelong friends. Kinda last minute. I’m responsible for lodging and adventures in Tuscany. Will be there for 3 days and nights. Help! Recommendations please and yes we like wine! TY!", "link": "facebook.com/groups/1373361046396315/permalink/2206133383119073/", "likes": 5, "comments": [{"username": "Tracy O'Brien Boulle", "comment_text": "I haven’t stayed here but the place and their activities looked amazing with good reviews.\n\nhttps://\nwww.belsentiero.\ncom/"}, {"username": "Felicia LoCascio Whitney", "comment_text": "San Gimagnano\nMontepulciano\nPoggio Antico winery\nEtruscan tombs"}, {"username": "Lora Ruscitti Covington", "comment_text": "Il fontanaro organic farmhouse is amazing. They have cooking classes and close to drive to other towns and wineries."}, {"username": "Susan Streed McNaughton", "comment_text": "A day and night in Florence, magical."}, {"username": "Alice Francesca", "comment_text": "https://\nwww.montalcinowi\nnetours.com/"}, {"username": "Donna Wood Robbins", "comment_text": "Dena Brookhart Whitener"}, {"username": "Dena Brookhart Whitener", "comment_text": "Donna Wood Robbins Lisa Zink Krebs Nicki Cole Robin Gautney\nBarbara Lipsky\nClaudia Pullen Cook"}, {"username": "Angela Abbate Karklin", "comment_text": "Fratti montemorli winery"}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "Val d’Orcia region: Montalcino, Montepulciano and Pienza. Look into Villa Ciccolina"}, {"username": "Heidi Maria Farrugia", "comment_text": "Find some central, rent a car and have fun! Which airport are you flying into ? Have a look Casa Marylou in Tuscany"}, {"username": "Ian Fawkner", "comment_text": "Definitely Siena and San Gimignano….love\nd these BnB’s !"}, {"username": "Linda Mascaro", "comment_text": "Check out Cook in Tuscany, it’s a beautiful place, delicious food, close to a wonderful winery, Pienza and Cortona are close too."}, {"username": "Craig Marshall", "comment_text": "Florence and Sienna for sure"}]}, {"id": "2206137053118706", "text": "Restaurant post:\nWas in Rome last week and ate at \"Trattoria Da Teo\", the service and food were great! The tiramisu was the best we've ever had (extreme statement but true), highly recommend if you have the chance to go.\nWe lucked out and got a table inside without a reservation however I'd suggest you make one instead of chancing it.\nHappy dining :)", "link": "facebook.com/groups/1373361046396315/permalink/2206137053118706/", "likes": 1, "comments": []}, {"id": "2206147893117622", "text": "Going to Venice in Nov with hubby & another couple plus 1 friend for 3 nights. (5 adults total). Are there recommended places to stay 2 rooms with 1 room for 3 adults 2 beds? Hopefully away from accommodations that might flood during rainy days. Coming from Marco Polo airport staying 3 nights in Venice & taking the train to Rome before a 15 day cruise. We are also arriving at 730pm at the airport.", "link": "facebook.com/groups/1373361046396315/permalink/2206147893117622/", "likes": 0, "comments": []}, {"id": "2206151929783885", "text": "Does anyone know if airlines have check in kiosks or the ability to check in for flights on the apps versus standing in the long lines at Rome airport? I know last year they didn’t and it causes huge lines that take hours to wait on!", "link": "facebook.com/groups/1373361046396315/permalink/2206151929783885/", "likes": 2, "comments": [{"username": "Colleen Dawson", "comment_text": "If you are flying internationally\n, you have to check in at the counter as your passport needs to be verified. That is why most airlines will recommend that you give yourself at least 3 hrs for check in to departure."}, {"username": "Tess Galinato Perez", "comment_text": "I just flew in last night, with British Airways, from Denmark to LHR to San Diego. Some airlines, if you have a frequent flyer account with them and provided your information ahead of time, will allow you to check-in 24 hours prior. I was also able to download my boarding pass."}, {"username": "Gena Kona-Mancini", "comment_text": "Not sure where you are flying to but we flew to Canada yesterday, got to the airport 2.5 hours in advance, checked in online (air cannada/air transat), checked our bags at the kiosk and were through security within 25 mins."}, {"username": "Annette Mayer", "comment_text": "No matter where you fly there is a TSA security line. TSA clearance makes it happen quicker\nAnd we all queue up to board yhe plane. Unless you are a celebrity lol"}, {"username": "Shelley Howard", "comment_text": "Depends on the airline .. we could but still had to go to the counter just a smaller line ..."}, {"username": "Lani Skyles", "comment_text": "The lines are horrible, no offense to the Italians, but Rome￼’s airport is the worst experience I’ve had, with travel."}]}, {"id": "2206152786450466", "text": "Where on the mainland of Italy are there beaches that rival those on Sardinia?", "link": "facebook.com/groups/1373361046396315/permalink/2206152786450466/", "likes": 21, "comments": [{"username": "Chic Ciccia", "comment_text": "Chic Ciccia"}, {"username": "Carole Cantella Motz", "comment_text": "Tropea is simply beautiful!"}, {"username": "Anxhela Papa", "comment_text": "Zamira Gjura"}, {"username": "Senan Haugh", "comment_text": "Calabria, Calabria ... oh eh and Calabria !"}, {"username": "Diana Ferro-Rodrigues", "comment_text": "Tropea Calabria"}, {"username": "Kate Mancuso", "comment_text": "Just bite the bullet and go to Sardinia. YOLO! 😆"}, {"username": "Antonello La Ferrara", "comment_text": "San Vito lo Capo, Sicily"}, {"username": "Roberta Guidetti", "comment_text": "Nessuna parte"}, {"username": "Lauren Pasquali", "comment_text": "San Vito lo capo"}, {"username": "Lorenzo Katja Cusumano-Diederen", "comment_text": "capri"}, {"username": "Augusta Barna", "comment_text": "Puglia, Calabria and, of course, Sicily"}, {"username": "Jennifer Cederholm-Wasescha", "comment_text": "Geata, sperlonga, formia"}, {"username": "Yelena Shakhanova", "comment_text": "Porto Cesario was magical . Punto prosciutto supposedly Aldo but personally didn’t go."}, {"username": "Mike Parrent", "comment_text": "By the ocean"}, {"username": "Tom Staples", "comment_text": "Amalfi"}, {"username": "Georgina Mcauliffe", "comment_text": "Favignana. The Zingaro reserve near Scopello. Scala dei turchi. San Lorenzo. Better food in Sicily than Sardinia."}, {"username": "Giulia Cardamone", "comment_text": "Sicily. Zingara National Park"}, {"username": "Julie Khenkin", "comment_text": "Calabria and Puglia . Would go with Puglia"}, {"username": "Amanda Albert Notaris", "comment_text": "Forte Dei Marmi"}, {"username": "Carola Blödgen", "comment_text": "The Adriatic side of Italy, in the east has lots of wide sandy beaches and parts of Liguria"}, {"username": "Irene Oda", "comment_text": "Non rival to be honest. Some that have been mentioned already are very nice. But non are equal."}, {"username": "Claudio Blizzard Indastria", "comment_text": "Calabria, Puglia and even some areas of Lazio have stunning beaches.\n\nIf we can include sicily, then there's a completion indeed"}, {"username": "Desislava Plachkinova", "comment_text": "Pescoluse, Puglia"}, {"username": "Virgz Van Møøre", "comment_text": "Calabria and Puglia"}, {"username": "Rose Turdo", "comment_text": "Lecce, Puglia\n\nDino, Calabria"}, {"username": "Elisa Herza Tuzio", "comment_text": "Sicily, Calabria,Puglia\nare stunning"}, {"username": "Andre Caria", "comment_text": "Some beaches mentioned are nice and maybe wonderful. But that doesn't make them any close to the wonders of the Sardinian beaches"}, {"username": "Gordon Rose", "comment_text": "Salento"}, {"username": "Magdalena Tutak-Bik", "comment_text": "Puglia Salento"}, {"username": "Melanie Fuger-Dolan", "comment_text": "Was just in Sardinia, felt like we were in Bora Bora the water was so clear and pure turquoise."}, {"username": "Vanessa Tuveri", "comment_text": "Mmmmm no can do said the Sardinian in me .\nThere are similar beautiful places , Puglia , Calabria , sicilia ."}, {"username": "Laura DeCicco", "comment_text": "Tropea(Calabria\n) or Puglia"}, {"username": "Alice Francesca", "comment_text": "Just like Sardinia, no place.\nBeautiful beaches in Puglia or Sicilia.\nCalabria has its beauties too but very few services"}, {"username": "Susan Carbone Beattie", "comment_text": "Thank you everyone!"}, {"username": "Mi Sh", "comment_text": "Calabria"}, {"username": "Cindy Sguazzin", "comment_text": "Lignano Sabbiadoro! Check it out, as well as others nearby on the glorious Adriatic!"}, {"username": "Katia Macri-Roberts", "comment_text": "Tropea Calabria"}, {"username": "John Todarello", "comment_text": "CALABRIA"}, {"username": "Anna-Maria Orodan", "comment_text": "Tropea, Calabria"}, {"username": "Anna-Maria Orodan", "comment_text": "Anna-Maria Orodan"}, {"username": "Magdalena Tutak-Bik", "comment_text": "Puglia -\nYou mean crystal water?\nOn the east coast sandy long beaches among rocky cliffs. West - Ionian coast - mostly long Long sandy Beaches with shallow water."}, {"username": "Magdalena Tutak-Bik", "comment_text": "I caraibi del solento."}, {"username": "Magdalena Tutak-Bik", "comment_text": "Magdalena Tutak-Bik"}, {"username": "Magdalena Tutak-Bik", "comment_text": "Ionian"}, {"username": "Rob Green", "comment_text": "Following"}, {"username": "Lívia Čajová", "comment_text": "Polignano a Mare, Puglia"}, {"username": "Ella Rooke", "comment_text": "Calabria- capo vaticano is absolutely stunning"}, {"username": "Emanuele Semproni", "comment_text": "Salento, Sicily"}, {"username": "Giovanna Bontempi Ness", "comment_text": "Puglia"}, {"username": "Tom O'Hara", "comment_text": "Corsica."}, {"username": "Susan Palmer", "comment_text": "Rimini has nice soft sand beaches"}, {"username": "Maria Christina", "comment_text": "Great question! Can’t wait to see the answers and hopefully check them out one day!"}, {"username": "Stjepan Kujadin", "comment_text": "Nowhere"}, {"username": "Lori Greco", "comment_text": "We travel.from Perth in Western Australia to have a beach holiday in Sardinia, whose crystal clear water and white sands are unmatched. I've looked many times at going to Puglia but the sand is yellow and for that reason we keep going back to Costa Smeralda, , Stintino, Villasimius and Capo Boi."}, {"username": "Antonella Pinna", "comment_text": "Sardinia is unique"}, {"username": "Sandra Di Liso", "comment_text": "Puglia - Porto Cesareo"}, {"username": "Paulette Otano", "comment_text": "What do you think of Salerno?"}]}, {"id": "2206154553116956", "text": "Panning a one night trip from Milan to Portofino. Any suggestion on the most efficient way to get there? Is it worth going for just one night?", "link": "facebook.com/groups/1373361046396315/permalink/2206154553116956/", "likes": 0, "comments": []}, {"id": "2206157479783330", "text": "We will be in Milan and want to head to Portofino and then onto CinqueTerre or La Spezia for a couple of nights. Does anyone have suggestions on how best to accomplish this - private driver? Train? Bus? We really don’t want to spend one night in Portofino just see it on the way.", "link": "facebook.com/groups/1373361046396315/permalink/2206157479783330/", "likes": 2, "comments": [{"username": "Tonsia Keytel", "comment_text": "Milan to La Spezia by train, very easy. Stay close to station and then take train to Cinque Terre, stops at all the villages. Very easy!!"}, {"username": "Linda West", "comment_text": "Train"}, {"username": "Robin Burrell", "comment_text": "Train to Santa Margarita then ferry to Portofino. Back to Santa Margarita then train on down to Cinque Terre."}, {"username": "Steph Craddock", "comment_text": "Train to Santa Margherita Ligure then bus , ferry or walk to Portofino. Buses go every 20mins, ferries every hour. Walking takes an HR. Back to train and get off wherever your going. (May need to change at Sestri Levante or Levanto."}]}, {"id": "2206154883116923", "text": "We are booked to visit Italy in October, our return flight into the US has been cancelled 2 times. We rebooked, just curious if this has happened to anyone else & are people having flight issues getting back to the US?", "link": "facebook.com/groups/1373361046396315/permalink/2206154883116923/", "likes": 4, "comments": [{"username": "Diane L. Martin", "comment_text": "We’re going in October as well. Our flight was changed, went from a 3 hour layover leaving at 3 to a 10am flight with 7 hour layover."}, {"username": "Kim Shea", "comment_text": "What airline ???"}, {"username": "Yolanda Hanavan", "comment_text": "So far I’ve been lucky. No changes yet. I’m crossing my fingers that it stays this way. I’m not flying until December, so I have a way to go."}, {"username": "Eric Parks", "comment_text": "I've had it happen before with AA and Delta"}, {"username": "G.Y. Harvey", "comment_text": "ours got changed too by American, with arrival to a completely different airport, not home))) the impression is it is a computerized \"optimization\",\nbecause we called American right away and they changed it like no problem. But yeah, it is disturbing, when you trying to plan your connections..."}, {"username": "Maria Villanueva", "comment_text": "Yes, happened to my husband and I last July with British Airlines. Canceled our flight home, instead of a one stop layover, we had 2. Our flight from Rome was delayed, so we missed our connecting flight home to LAX. We had to spend the night in London, no vacancies anywhere due to all the canceled flights. We finally found one, which was extremely expensive $500, and pretty much a rat hole!🥵"}, {"username": "Troi Ann Nunez Reppart", "comment_text": "Yes. Without notifying us American canceled half of our flight in November. Yesterday I happened to go online to check what city our layover was in and noticed we had Venice to London and then nothing to the US. They canceled the London to Charlotte leg and weren’t going to tell us until checkin 🤷🏻‍♀️. It took 1.5 hours on the phone. But the agent was extremely nice and helpful."}, {"username": "Allison Mir", "comment_text": "Make sure have robust travel insurance in place asap"}, {"username": "Christy Powers", "comment_text": "American is horrible. Had a horrible experience with them and Charlotte two weeks ago."}, {"username": "Oksana Yarosh", "comment_text": "This is a wider problem than just Italy. Seeing issues with AA and British airways in other FB travel groups I'm following."}, {"username": "Theresa Sorrentino Pagan", "comment_text": "I refuse to take AA for any big flights. They are the worst, they cancel or delay flights constantly"}, {"username": "Carol Weynand Simpson", "comment_text": "Happened to us yesterday , for an October return flight !"}, {"username": "Mary Ann Mills", "comment_text": "My return flight has changed3 times. Very frustrating."}, {"username": "Mary Ann Mills", "comment_text": "Ours is Delta flight."}, {"username": "Michele Liggett", "comment_text": "We're using United from Milan. Hoping our flight doesn't get canceled."}, {"username": "J Kevin Dennis", "comment_text": "Sas sold part of their routes , jhad to rebook w downgrade class"}, {"username": "Roxanne Patti", "comment_text": "Mine has been booked for about 9 months. A couple days ago they changed my return flight and it was adding 2 additional hours. My original flight is still available. I called and said the change was unacceptable and I’m back on original flight."}, {"username": "Jennifer Erdman", "comment_text": "I haven’t had any issues with Delta. I am sorry you’re experiencing that. A friend seems to have a ton of issues with American Airlines."}, {"username": "Jo Ann Ciuffini Forcino", "comment_text": "Ours changed to a 12 hour layover at JFK to get home to Florida so we had to find 2 new flights coming home because we don’t want to sit at an airport for 12 hours. Our flight going to Rome had a departure time change. We booked flights 6 months in advance to avoid problems but that hasn’t happened. Hopefully it won’t change again."}, {"username": "Irene Oda", "comment_text": "It did happen to us last year. Flight with Air Canada canceled. We stayed on the phone with Air Canada until they rebooked us. My husband was on hold for 3 hours. The airlines must rebook you. Air Canada booked us a return flight with a partner airline - Air France. Requires some patience and persistence. No issues this year with our trip."}]}, {"id": "2206165413115870", "text": "Best Gelato we have had in Rome Come il Latte!!! Pistachio blew my mind. Not green. Brown and the most nutty, delicious, creamy, fresh…mind blown 🤯🤤🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2206165413115870/", "likes": 83, "comments": [{"username": "Iman Nazaran", "comment_text": "What’s the name of the store?"}, {"username": "Laura St James", "comment_text": "I was there and it was amazing! And the sweetest people running the place."}, {"username": "Jess Ica", "comment_text": "That's how you know the pistachio is good, when it's tan. Green is fake."}, {"username": "Jay Cabrera", "comment_text": "God, I miss the gelato…"}, {"username": "Janice Vaznonis", "comment_text": "Will have to try it out in October"}, {"username": "David Perillo", "comment_text": "Just done 6 weeks in Italy. And I can assure you. Not all gelato are equal. Some are ok and some are out of this world."}, {"username": "Diana Bonifaci", "comment_text": "Where is it?"}, {"username": "Halie Haefele", "comment_text": "Grant Gerk 🤤"}, {"username": "Marianna Holloman", "comment_text": "We walked an hour and a half each way to eat gelato there! Worth it!"}, {"username": "Justyna Leniartek Taunt", "comment_text": "Yes!! Love Come il Latte! Try Giolitti too!"}, {"username": "Eileen Muro", "comment_text": "Had this pistachio Gelato in Florence....so yummy"}]}, {"id": "2206165809782497", "text": "I’m trying to see if I have the correct website to book directly through the Vatican. It does not show any dates for 2024? Is that possible or could I have the incorrect website? Do they offer “before opening tours”? Is it the “Vatican Museums” on the website that I would book? Thanks so much!", "link": "facebook.com/groups/1373361046396315/permalink/2206165809782497/", "likes": 1, "comments": [{"username": "Chris N Lynn", "comment_text": "Way to early. 60 days only"}, {"username": "Nancy Moran", "comment_text": "This is the official page for buying tickets direct for Vatican museums. Currently, the calendar only seems to go through December 2023.\nhttps://\ntickets.museivat\nicani.va/home/\ncalendar/visit/\nBiglietti-Musei"}]}, {"id": "2206173616448383", "text": "Hi! I have a question for people who visited QC TERME MILANO. It is worthy the price? Do you recommend this place to relax and new experiences? Please help!\n\nPhotos for attention 😗", "link": "facebook.com/groups/1373361046396315/permalink/2206173616448383/", "likes": 0, "comments": [{"username": "Alice Francesca", "comment_text": "QC Terme has different spas all over Italy.I have never been to the one in Milan, but usually they are very good.\nIt will not be a natural spa spring water thought.\nThe most beautiful ones are QC Terme Pre'Saint Didier (real warm spa water and incredible views of the Alps)"}, {"username": "Laura Cardinale", "comment_text": "Is a nice and quite relaxing place BUT avoid weekends!"}]}, {"id": "2206173726448372", "text": "Recommendations for a reasonably priced hotel for a family of 5 in Cinque Terre please? Ideally in or near Monterosso al Mare. Also- how many nights would people recommend here and is it worth stopping in Genoa first? We are heading from Nice to Florence to Venice. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2206173726448372/", "likes": 0, "comments": []}, {"id": "2206177136448031", "text": "I know this is a long shot BUT 19 years ago my husband and I celebrated our first anniversary in Italy. We stumbled across a little pizza place that sold their pizza by the Kilo!! I swear it was in the Vatican area but let’s be honest….my memory is a bit blurry!! Does anyone know if a place like this still exists?? We’ve been talking about it for 18 years and my kids want to find it!!!🍕🍕🍕🍕🍕🍕🍕🍕🍕🍕🍕🍕🍕🍕🍕", "link": "facebook.com/groups/1373361046396315/permalink/2206177136448031/", "likes": 0, "comments": [{"username": "Elena Eugeni", "comment_text": "I guess you are taking about Pizza al taglio. There are dozens or places like this near the Vatican, I believe it's almost impossible to return to the one you remember. My advice would be going to one of the current best shops for Pizza al Taglio in Rome (Pizzarium or Roscioli in that area) and enjoy it"}, {"username": "Elena Innocenti", "comment_text": "For sure is pizza al taglio style. Very popular in Rome.\nAlso Forno Monteforte (via del pellegrino) is good."}]}, {"id": "2206177616447983", "text": "Sorrento", "link": "facebook.com/groups/1373361046396315/permalink/2206177616447983/", "likes": 9, "comments": []}, {"id": "2206179119781166", "text": "https://www.nationalgeographic.com/travel/article/italy-hikes-cinque-terre-path-of-love", "link": "facebook.com/groups/1373361046396315/permalink/2206179119781166/", "likes": 2, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2206183706447374", "text": "Hello, do i need a ETIAS (European Travel Information and Authorization System) Application form to visit Italy this year of 2023? Thank you in advance for your assistance.", "link": "facebook.com/groups/1373361046396315/permalink/2206183706447374/", "likes": 3, "comments": [{"username": "Colleen Dawson", "comment_text": "No."}, {"username": "Shelley Perelmuth Sperling", "comment_text": "2024"}, {"username": "Valerie Collanton", "comment_text": "It goes into effect some time in 2024. Date not announced yet."}, {"username": "Voula Ladas", "comment_text": "No they haven’t set a date for that to commence yet . Officials are saying it will commence next year now ."}, {"username": "Carole Tarlap", "comment_text": "Next year.....they don't have a date yet."}, {"username": "Christine Carbone", "comment_text": "Meet ETIAS, the European Travel Information and Authorisation System - Coming in 2024."}, {"username": "Gianna Onesi", "comment_text": "I posted the info"}, {"username": "Jamie Bly", "comment_text": "It was suppose to be November 23 but I believe it was extended"}, {"username": "Ruth Pellow", "comment_text": "No"}]}, {"id": "2206184083114003", "text": "We want to spend half a day visiting Herculaneum in September. We would like to join an English speaking walking tour. Do we need to book in advance or can we buy tickets in Herculaneum on the day? We’ll be travelling by train from Sorrento. Thanks in advance. 💚🤍❤️", "link": "facebook.com/groups/1373361046396315/permalink/2206184083114003/", "likes": 0, "comments": []}, {"id": "2206185199780558", "text": "Hey:) going to Italy for our honeymoon in September and would love recommendations for private/ tours and car service in Venice, lake como, Florence and siena (Tuscany) also looking for higher end place to stay with canal view in Venice all other areas are booked❤️ as of now we are also booked at rosewood castiglion del bosco and wondering if it’s worth the amount we are paying or if someone has another fancy recommendation?", "link": "facebook.com/groups/1373361046396315/permalink/2206185199780558/", "likes": 3, "comments": [{"username": "Alice Francesca", "comment_text": "While in Siena rent a car and drive south to the VALLE D'Orcia region (about 1 hr 1/2).it s the real Tuscan landscape and lovely villages (Pienza and others) look for it!"}, {"username": "Katie White-Meade", "comment_text": "Positano- il San Pietro de Positano.\nLift to beach\nCliff top pool\n5 Star service"}, {"username": "Heather Hills Jacobs", "comment_text": "Domenico at Venice Group Services is awesome!! He will help you!!"}, {"username": "Elena Eckley", "comment_text": "Check out the Marriott it is on a private island"}, {"username": "Dafne Vassetti", "comment_text": "For Florence get in touch with Ciao Florence :)"}]}, {"id": "2206207676444977", "text": "Help with places to stay in Puglia & the best things to do/see\nGrazie in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2206207676444977/", "likes": 0, "comments": [{"username": "Iliana Zlatareva", "comment_text": "Vieste"}, {"username": "Virginia Speedy", "comment_text": "Best way to find out is to search 'Puglia' on this group's page. You will get heaps of comments, experiences, restaurants, etc."}, {"username": "Magdalena Tutak-Bik", "comment_text": "Salento - arbelobello a must see, lecce, Castro marina and Santa Cesarea Terme at once- you can go on a boat trip along the coast and see caves. You can stay in Otranto - cafes, old castle etc. 5km from otranto cava di Bauxite -"}, {"username": "Magdalena Tutak-Bik", "comment_text": "Sant Andrea, grotta dell poesia, zinzulus cave, Santa Maria do Leuca, Gallipoli - and beaches - alimini, Baia dei turchi, pescoluse, lido Bora Bora, padula Bianca, I caraibi del salento, otranto beach,\nTry sea food, and pasticiotto, gelato, focaccia ❤️"}, {"username": "Саша Савино", "comment_text": "Grotta palazzese in polignano a mare."}]}, {"id": "2206198693112542", "text": "We will be in Bologna for 4 nights. Any thoughts about day trips from there? Is Parma, Italy worth visiting, or should we go to Florence to visit places we missed?", "link": "facebook.com/groups/1373361046396315/permalink/2206198693112542/", "likes": 1, "comments": [{"username": "Romilly Farina", "comment_text": "I loved Verona. It was smaller. Amazing restaurants. Amazing tours. One of my favorite towns in Italy."}, {"username": "Chiara Codecá", "comment_text": "Bologna is surrounded by beautiful hills full of osterias, and the local cuisine is one of the best in Italy. Parma historical centre is nice, but if you haven't seen Florence I'd do that first. From Bologna you can reach most places easily by train, including Venice and Pisa, you might want to check that out."}, {"username": "Jim Kelleher", "comment_text": "Parma is absolutely worth visiting. Fabulous food (even better than Bologna despite what everyone thinks) a few beautiful museums, lots of terrific shopping and it’s completely walkable. Can’t say enough good thinks."}]}]