[{"id": "2207147923017619", "text": "We are at the tail end of our tour of Italy. Many criticized our itinerary, however so far it worked for our family like a charm! We didn’t have an extra day anywhere, nor did we need additional time. I was in Italy many times before, but this was the first time we came on a family trip with a 17 and 20 year old. We needed to make an itinerary which would be a perfect introduction to Italy, so when they travel on their own in the future they can explore further. I knew if I tried to “jam in” too much that everyone would be overwhelmed and they would not remember anything. We planned a versatile trip that suited everyone!\n1. We landed in Rome and we had 2 nights and 2 full days in Rome. It was soooo much fun! We had the colosseum tickets purchased ahead of time and that was the only thing we prebooked. We went to St Peter’s Basilica and we were at the square when the Pope showed up in the window 😮 (didn’t book a tour) and it was a unique experience. We went to the fountain, the steps, Navona, Pantheon (I saw the inside in the past and I really couldn’t wait in line for an hour to get in this time around), and of course, we had dinner twice in Travestere- it was enchanting. We didn’t book any restaurants, just went there and stumbled on many charming trattorias. We also used the shared scooters A LOT! That was FANTASTIC for the entire family. Highly recommend!!! We are in Milan right now and are just about to hop on scooters to zoom around Milan.\n2. Next stop Florence- we rented a car in Rome on our way out of the city and took the side roads through Tuscany towards Florence. We stopped along the way to a random vinery for tasting and bought some wine, as well have lunch at a authentic local restaurant we found somewhere in Chianti. We came to Florence late afternoon. All hotels we booked for this trip were “in the middle of happening”. It was important for us to have a liberty of walking in and out together or separate from the kids, we all needed our freedom. That is why the central location of accommodation was key. Ps, while in Rome we bought 2 SIM cards with prepaid data that we used to keep connected, as wifi “is not really a thing across Italy”. We brought 2 spare phones and bought 2 cards with 20gb each so we always had internet and it was way cheaper that using our roaming plans on our phones. Back to Florence- the only thing we have pre-booked was tickets for Galleria dell Academia. We skipped Uffizi this time. We also had a reservation for Za Za and we were not impressed. The food was ok but it seemed like a tourist attraction. It is way too big and there is a line up even with a reservation. So many smaller better places to eat Florentine steak.\n3. Last minute we spent a night in San Gimignano. BEST DECISSION EVER! Instead of driving there walking for hours and then driving back, you get to explore this beautiful hilltop town at your own pace. That way we experienced fully San Gimignano and it was up to the kids if they wanted to see some of the other towns.\n4. We had a 3 day break at a seaside and we chose Viareggio. It was fantastic! It was a break from the crowds, but also a break from all the tourists lol. I don’t think we saw anyone who was not Italian in Viareggio. We did a stop at Pisa and Luca on our way from San Gimignano. But those couple of beach days were a necessary break for us.\n5. Next stop was Milan. The original plan was to stop at one of the cinque terre towns or Portofino, however since it was raining along the coast we decided to go via Bologna and Modena and stop at the Ducati and Ferrari museums. The kids loved that 😁. Today we are exploring Milan and tomorrow we are heading toward Vicenza.\n6. On our way to Vicenza we will stop in Sirmione for lunch and a quick stop in Verona to see the Juliette’s house. Sleep in stunning Vicenza.\n7. Last stay is in Venice. On the way to Venice we will stop in Padova. And then drop off the car at the Marco Polo airport from where we will take a water taxi to Venice (not the Alilaguna, which made us soooooo sick last year). We have 1 night in Venice but since our flight is late in the evening, I reserved a room in the hotel\nFor one more day so we have somewhere to shower and rest before our flight. That is it! I hope it can help someone with similar interests and pace like our family. ❤️", "link": "facebook.com/groups/1373361046396315/permalink/2207147923017619/", "likes": 143, "comments": [{"username": "Tracy Wrinn Mcdermott", "comment_text": "Sounds perfect!"}, {"username": "Jennifer Amen", "comment_text": "Sounds like it’s been an amazing trip! I’m sorry people criticized your itinerary but so glad you still did what was best for your family!!! Safe travels 😊"}, {"username": "Heidi Maso", "comment_text": "complimenti"}, {"username": "Maribeth Tessicini", "comment_text": "Sounds like a fantastic trip!!! My son lives in Vicenza and our family is going to see him there (first time) in December...can'\nt wait! Thanks for sharing, I really enjoyed hearing about your experiences!"}, {"username": "Kathleen M Miller", "comment_text": "Using the shared scooters sounds like a great idea. How do you do this? Is there an app you use? It sounds like you had a great trip."}, {"username": "Cyndi Riley", "comment_text": "Wow! We will be there 10 weeks next spring. Can’t wait to explore this beautiful country."}, {"username": "So Heila", "comment_text": "Following"}, {"username": "Bev Symes", "comment_text": "thanks for info. definitely useful"}, {"username": "Stella Saracco Garofalo", "comment_text": "Sounds like a wonderful trip and well planned."}, {"username": "Elaine Wilson", "comment_text": "Sounds great. Any recommendations\nfor Milan"}, {"username": "Bryan Toole", "comment_text": "We had the best ever spaghetti alle vongole in a beach-side restaurant in Viareggio. So good we returned for lunch there on two later trips! I heard from Italian waiters in other towns that they are famous for their clams."}, {"username": "Susan Pierce", "comment_text": "Perfect! 👍🏼😃🇮🇹❤️"}, {"username": "Cindy Mamet Cardile", "comment_text": "Loved reading this -good for you !"}, {"username": "Deborah Shaw", "comment_text": "Thanks for posting your thoughts on Za Za. I’ve been going back and forth about booking a reservation there. I’ve decided to skip it and to find another place off the beaten path for dinner. Just the two of us and we eat early so don’t anticipate it being difficult to get in somewhere. Please elaborate on the shared scooters. Are they the ones you use a credit card for? When you weren’t riding them, is there a way to “lock” them so that they remain where you left them so you can resume riding them after visiting a site?"}, {"username": "Andrea Celli Zeitvogel", "comment_text": "This sounds absolutely perfect. Love the Viareggio stop - so smart! You gave them a taste so they will want to go back!"}, {"username": "Jillian Puerto", "comment_text": "Thank you for sharing ❤️"}, {"username": "Colleen Blogg", "comment_text": "Did you book some or all of your accommodation before you arrived or was it booked a day before? Sounds wonderful"}, {"username": "Jamie Higgs", "comment_text": "Great info! Thanks for sharing ❤️"}, {"username": "Janette David Payne", "comment_text": "Sounds amazing… love the “spur of the moment” thing.. we are in first into Venice, then Florence and Rome in 8 weeks time … we do have things booked but some days are just walking out of the hotel and deciding wether to walk left or right…. Enjoy the rest of your holiday!!!"}, {"username": "Cee Esperance", "comment_text": "Glad you didn't let the negative comments alter your plans."}, {"username": "Carol Burns", "comment_text": "Great details! Would love to hear more about Milan and Florence if you can share what you enjoyed there plus any tips on restaurants. We go in Sept. Currently planning: Milan, Verona (& Lake Garda), Venice, Bologna, Cinque Terre, Lucca, Florence & Tuscany day trips, Perugia & Umbra day trips, Pisa for flight home and quick view of tower. Any tips on any of those, ideal duration, thoe not worth visiting etc would be most appreciated!"}, {"username": "Julie Emr", "comment_text": "Love this!!!\nGood for you! ♥️\nThere seems to be way too many rude, condescending people in this group now."}, {"username": "La Cinzia", "comment_text": "Near San Gimignano you can find Volterra, more ancient!"}, {"username": "Suzanne Norosky", "comment_text": "Very nice write up on your trip .. 😀"}, {"username": "Katherine AliNuñez", "comment_text": "Is cheaper to rent a car than go by train?"}, {"username": "Katherine AliNuñez", "comment_text": "Great trip! That’s what my trip would look like. Nothing crazy just enjoy on our own pace"}, {"username": "Keri Smith Estes", "comment_text": "Sounds like an amazing trip! Good job momma (yes, I’m assuming, lol)!\nYou are making beautiful memories with your kiddos!❤️✈️⛪️🏛️🍝"}, {"username": "Merle Goodwin", "comment_text": "This was a great read!!! You are hitting 90% of the towns we are to in 3 weeks !!! Cant wait like every time we have another trip to our favourite country!!! We keep finding cities we have not seen! Ty"}, {"username": "Karen Cutler Merrigan", "comment_text": "How long was this trip?"}, {"username": "Ike Simoncini", "comment_text": "If you still have yo go to sirmeone go and eat at risorgimento thats by far the best place to eat and im an half italian foodie"}, {"username": "Tonsia Keytel", "comment_text": "Sounds like an amazing trip, thanks for taking the time to write this."}, {"username": "Gina Rovello Keenan", "comment_text": "Great information! We are thinking about renting a car in Florence to drive to Venice with a stop in Padova, all in the same day. How easy was it to drive and park?"}, {"username": "Gayle Moores", "comment_text": "What an amazing trip!I have been to Italy twice moving around by train. Some of the places you mentioned are on my list to see next time. I also love San Gimignano.Thank\ns for sharing and helpful info for the next trip to Italy."}, {"username": "Jeff McLellan", "comment_text": "We took similar approach to you as this was the first trip to Italy for all four of us. Blew of Venice for the final Harry Styles concert of his world tour as the girls out voted me but will do that and spend more time in Tuscany when we do Switzerland."}, {"username": "Angie Tripp", "comment_text": "."}, {"username": "Jerry Kiger", "comment_text": "Looks like awesome trip. I am\nPlanning this time next year so your info if great to consider.\n\nQuestion — I’m stuck between planning hotels every night vs some freedom to explore and see what find. Did you plan hotels in countryside spots, what thoughts on travel in Aug and pre planning most Vs finding hotels, plans once there?\n\nQuestion — phones. About how much did the 2 phones cost? I have ATT, might do as you did buy and throw away after\n\nQuestion — did most hotels have rental car parking? Might rent to drive town to town to explore country side spot, maybe trains not sure\n\nThank you any info … sorry so many questions appreciate info esp those traveling right now"}]}, {"id": "2207234899675588", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2207234899675588/", "likes": 5, "comments": []}, {"id": "2207235826342162", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2207235826342162/", "likes": 1, "comments": []}, {"id": "2207236506342094", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2207236506342094/", "likes": 0, "comments": [{"username": "Cece Francis", "comment_text": "Where is this ?"}]}, {"id": "2207237239675354", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2207237239675354/", "likes": 5, "comments": []}, {"id": "2207237973008614", "text": "Hi! ISO best family hotels for 4 (2 adults and 2 kids 9 + 10) on Lago di Gardo, Venice and Florence. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2207237973008614/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Lake Garda https://\nwww.dpbolvw.net/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g194883-d2334\n69-Reviews-Du_L\nac_et_Du_Parc_G\nrand_Resort-Riv\na_Del_Garda_Pro\nvince_of_Trento\n_Trentino_Alto_\nAdige.html"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Venice https://\nwww.anrdoezrs.ne\nt/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187870-d1086\n740-Reviews-Hot\nel_Indigo_Venic\ne_Sant_Elena-Ve\nnice_Veneto.htm\nl"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Florence https://\nwww.kqzyfj.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187895-d2290\n17-Reviews-Gran\nd_Hotel_Baglion\ni_Firenze-Flore\nnce_Tuscany.htm\nl"}, {"username": "Billie Begley", "comment_text": "Venice look up Hotel Olimpia. Have stayed there 4 times. Great hotel. Good prices. Fantastic breakfast. Closer to train and bus station and vaperatto."}, {"username": "Marg Johnson", "comment_text": "The best western Bologna outside the train stn in Mestre has family rooms. Less expensive than staying in tourist area and commuter train ,5 min , to grand canal cost 1.5 euro and runs non stop until 11 pm"}, {"username": "Marialuisa Angela", "comment_text": "When are you going??"}]}, {"id": "2207305886335156", "text": "For those of you who have experienced both, should i do a day or night tour of the colosseum? Im between early morning before it gets hot or the night tour. I’d like to do the underground and wasn’t sure.", "link": "facebook.com/groups/1373361046396315/permalink/2207305886335156/", "likes": 3, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "night tour https://\nwww.viator.com/\ntours/Rome/\nColosseum-Night-\nUnderground-Tou\nr/\nd511-360021P1?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "Rimma Kofsman", "comment_text": "."}, {"username": "Victoria Laverty", "comment_text": "Its very difficult to get tickets to night undeground and unless booked with coop culture direct site otherwise often 3 rd party sites cancel at last minute"}, {"username": "Melissa Hunt", "comment_text": "It doesn’t look like Coop Culture offers that tour beyond August 31. They didn’t release any tickets for September 1 or 2."}, {"username": "Ibbu Mohd", "comment_text": "Night tour is best, away from excessiv heat. Book directly via coopculture. If u cannot get english tours, get italian tour and use google translator app."}, {"username": "Diane Grimes", "comment_text": "Dawson Andrew"}]}, {"id": "2207302876335457", "text": "Has anyone stayed in the Prati area of Rome? Our hotel (NH Collection Roma Centro) is there, and looks to be about 1.5 km from a lot of the main attractions. What’s the vibe in this area like for shopping and dining?", "link": "facebook.com/groups/1373361046396315/permalink/2207302876335457/", "likes": 0, "comments": [{"username": "Stephen Henn", "comment_text": "We’ve stayed in Prati area several times. It is a safe area and we had no problems finding restaurants. Not big shoppers so can’t answer to that. We rode the Metro and walked to get around Rome."}]}, {"id": "2207331502999261", "text": "Is it better to rent a car too tour Tuscany or Scooters??", "link": "facebook.com/groups/1373361046396315/permalink/2207331502999261/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Car https://\nwww.discovercars\n.com/\n?a_aid=NextStop-\nItaly"}, {"username": "Enrico Lecce", "comment_text": "Car"}, {"username": "Enrico Lecce", "comment_text": "Enrico Lecce"}]}, {"id": "2207335389665539", "text": "Does anyone have restaurant recommendations in Ischia?🤗", "link": "facebook.com/groups/1373361046396315/permalink/2207335389665539/", "likes": 0, "comments": [{"username": "Sarah Soave", "comment_text": "Following!"}]}, {"id": "2207336522998759", "text": "We would like to do our own day trip from Rome to the Pompeii ruins at the end of August. I am looking at trains and everything is sending me to Torre Annunziata Centrale rather than Pompeii Scavi as I entered. Am I doing something wrong? Could they be all booked up already? Should I just book to Napoli Centrale and then figure out the next leg when I get there? Any suggestions are appreciated!", "link": "facebook.com/groups/1373361046396315/permalink/2207336522998759/", "likes": 1, "comments": [{"username": "Michele Fiore", "comment_text": "Hi, there is Actually the train that does Rome to Pompeii"}, {"username": "Michele Fiore", "comment_text": "I suggest you to use trainline the price is around 18€, text me if you need help"}]}, {"id": "2207345472997864", "text": "Hello, question is there any free (public) beaches in Venice / Mestre (main island)?", "link": "facebook.com/groups/1373361046396315/permalink/2207345472997864/", "likes": 0, "comments": []}, {"id": "2207355889663489", "text": "Hi, we are going Sorrento soon, do men need to wear long pants to restaurants in the evenings or are smart shorts ok. Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2207355889663489/", "likes": 8, "comments": [{"username": "Barb Krieg-Stepien", "comment_text": "I was just in Rome and Positano. No long pants needed. Everyone in shorts except a few locals who wear linen. It’s really really hot and humid. Only reason to wear long linen pants is to help contain the sweat running down your legs."}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "They’re fine …. that’s all my husband packed !!"}, {"username": "Nicole Gouzoules Sheehan", "comment_text": "Shorts fine!"}, {"username": "Patricia Hardiker", "comment_text": "Great thank you"}, {"username": "Stacey Esposito", "comment_text": "Everyone wore shorts"}, {"username": "Michele Runge Tapp", "comment_text": "We just got back from there - u see it all! Linen pants, nice shorts, athletic shorts etc"}, {"username": "Rachael Richardson", "comment_text": "Anything - no one cares unless it’s posh !"}, {"username": "Kay Rendall", "comment_text": "Amalfi Coast, long shorts have always been accepted\nAm in Como at moment, all the men, in long shorts, dress shirts Relax and enjoy"}, {"username": "Kit Nader", "comment_text": "Wear whatever you want"}, {"username": "Suzanne Mills", "comment_text": "No"}, {"username": "Don Bentivoglio", "comment_text": "Only when accompanied by a backward baseball hat and sandals"}, {"username": "Larry Reinier", "comment_text": "Come as you are. No"}, {"username": "Jill Medrano Casey", "comment_text": "You can wear smart shorts or even dumb shorts. The intelligence level of your shorts will not matter. 😉"}]}, {"id": "2207237953008616", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2207237953008616/", "likes": 3, "comments": []}, {"id": "2207239423008469", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2207239423008469/", "likes": 4, "comments": []}, {"id": "2207239893008422", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2207239893008422/", "likes": 2, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2207239949675083", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2207239949675083/", "likes": 3, "comments": []}, {"id": "2207240326341712", "text": "I am Canadian renting a car in Tuscany in August. Are there any quirky road rules, signs anything I should be aware of?", "link": "facebook.com/groups/1373361046396315/permalink/2207240326341712/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.discovercars\n.com/\n?a_aid=NextStop-\nItaly"}, {"username": "Pietro Adami", "comment_text": "Get, and always keep with you when driving, your international driving license"}, {"username": "Pietro Adami", "comment_text": "If you come across a car which flash their lights to you ( a ) car accident : danger ahead (as per our traffic rules), or ( b ) speedcheck / police ahead (as per … italian habits).\nIn both cases, better slow down!"}, {"username": "Sandra Shoffner", "comment_text": "Google Driving in Italy, it will tell you everything you need to know."}, {"username": "Corina Cristea", "comment_text": "ZTL (https://\nen.wikipedia.org\n/wiki/\nLimited_traffic_\nzone)"}, {"username": "Steph Craddock", "comment_text": "Make sure you have your passport on you when driving, as well as international driving license and driving license. (And not a copy)"}, {"username": "Gary Fossaceca", "comment_text": "Stop signs are but a suggestion….. lmao!"}, {"username": "Krissy DaRusso", "comment_text": "This might seem silly, but check how to fill the gas and what kind of gas is needed. It’s one of those things you take for granted until it’s needed. 😂"}, {"username": "Lori Wroblewski", "comment_text": "Just do not rent with Surprice (Autone) they are absolutely horrible"}, {"username": "Stefano Zordan", "comment_text": "If you have a driving license you should know road rules, quirky or not quirky…\nThat should be sufficient?"}, {"username": "Karen DiRienzo", "comment_text": "Watch for signs that tell you it is a restricted area to drive. Got caught with that several times and ended up with several tickets months later."}, {"username": "Costero Home", "comment_text": "Speed cameras are everywhere, even the ones that look like they do not work, they do! You will receive a ticket via your rental car company, so be aware and watch your speed."}, {"username": "Stephen Henn", "comment_text": "Motorcycles use the white line between lanes to pass so watch your mirrors. If you’re not passing a car, move out of the left lane as Italians honor the “left lane for passing only” rule, you’ll get run over otherwise! When we were in Tuscany, there were a lot of bicyclists on the narrow curvy roads which made it difficult to pass. Be patient."}]}, {"id": "2207244693007942", "text": "Hi, I am looking to do the Amalfi coast next September. We will be flying in and out of Naples and will have 7-10days. We want to do Pompeii. But apart from that we just want beautiful views, which is obviously a given! I would love help deciding on where to base ourselves so we can get the best out of the area. Happy to move around but would want to stay in each place for a couple of nights. Thanks in advance ☺️", "link": "facebook.com/groups/1373361046396315/permalink/2207244693007942/", "likes": 4, "comments": [{"username": "Nicole Gouzoules Sheehan", "comment_text": "Sorrento!!"}, {"username": "Anna Buchan", "comment_text": "Stay in sorrento. Pompeii is amazing but get a guide so much more interesting."}, {"username": "Holl E Bee", "comment_text": "If I was you I would stay in Sorrento for most/all of your time and plan day trips to Amalfi coast- this is what I did last summer!"}, {"username": "Jeff McLellan", "comment_text": "Sorrento for a few nights and then I would definitely move on to Capri for at least two or three nights and do boat trips from there exploring Capri and head to other towns. Capri after the day trippers left was the highlight of our time on Amalfi Coast."}, {"username": "Roland Trego", "comment_text": "With 7-10 days, 2 locations will work fine. I love Positano."}, {"username": "Alicia Cox", "comment_text": "Sorrento for sure!"}, {"username": "Tam Wong", "comment_text": "What about Salerno?"}, {"username": "Donna Russonello Merlino", "comment_text": "Sorrento"}, {"username": "Maria Delaney", "comment_text": "You may want to confer with Taxi Mister Cab Driver-Naples & Amalfi coast- as to where to stay and book a tour to go to Pompeii."}, {"username": "Nancy Brennan Carrow", "comment_text": "We stayed in Sorrento and took a shared boat tour to Capri one day and the next day took a shared minivan tour of Amalfi Coast. We stopped for 1 hour in Positano, 1.5 hrs in Amalfi and 1.5 hrs in Ravello. Both tours recommended by Rick Steves through mondoguide.it . They were great and we loved Sorrento!"}, {"username": "Starla Dawn", "comment_text": "Sorrento my new 1st love"}, {"username": "Deborah Nash", "comment_text": "We are going next May and will be starting in Sorrento, then staying in Praiano and Amalfi. Praiano is much cheaper than Positano and quieter. Must do a day trip to Ravello!!"}, {"username": "John Mccormick", "comment_text": "So based on what you are requesting, Positano will definitely have the best views. Sorento is ￼great, but larger and ￼you need to know where to stay to get a view. Almost everywhere you would stay in. Positano has incredible views. People always talk about how crowded it is but that’s always during the summer and towards the beach area and lower part of town. The charm of Positano is walking higher up the hill, side on the winding streets and stairs. It is also a great base location for ferry access to all the towns along the coast as well as capri."}]}, {"id": "2207245779674500", "text": "Hi! I’m planning to visit Florence in early October this year. What are your suggestions on the best things to do/see and eat while there?\n\nWe enjoy food and wine so def interested in a private driver to bring us to check out some wineries in Tuscany. Also we are interested in some cooking classes or checking out some great restaurants, history and shopping.😊\n\nThanks in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2207245779674500/", "likes": 2, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Florence/\nSmall-Group-Ital\nian-Cooking-Cla\nss-in-Florence/\nd519-5049COOKING\n?pid=P00070587&\nmcid=42383&medi\num=link&medium_\nversion=selecto\nr"}, {"username": "Jerry Kiger", "comment_text": "Side question … how far is the distance between Florence and Tuscany … wondering if good to “day visit” to T or stay Florence 1-2 days then Tuscany area add’l days? Or stay Tuscany side and day visit to Florence? Thx any info"}, {"username": "Janis Belkin Sowell", "comment_text": "We are going and will stay in Florence 2 nights and then stay in Sienna 6 nights and do day trips all around the hills and villages"}, {"username": "Caterina Liquori-Culhane", "comment_text": "Uffizi Gallery and see the David in another gallery. They are near each other"}, {"username": "Karrie LeBlanc", "comment_text": "We are just leaving Florence now. Loved it. We did a walking tour with guru walks our first full day to orient ourselves and it was awesome and shared great insights of what to look for in city for rest of our stay. The guide was wonderful and she shared her direct email if you want to book. storytellingflo\nrence@gmail.com\n\nWe loved Pitti Palace and Bobli gardens. You don’t need to book in advance but try to go on day not so hot as lots of walking in garden and building is warm.\n\nWe wandered in churches that were open and free and beautiful history.\n\nWe visited the Frescobaldi Nippozzano estate for the tour and Tuscan snack. It was a great experience. We just took taxi there and back from Florence was $100 euros each way by taxi. Did not want to book a whole day driver.\n\nWe had a lot of gelato in Florence and this was the best\n\nhttps://\nmaps.app.goo.gl/\nLoJxsbVVSK8i9t1q\n7?g_st=ic"}]}, {"id": "2207266249672453", "text": "So if there's 2 of us & a gondola is shared (with strangers) does the gondolier split the 80€ if the cost is per gondola?", "link": "facebook.com/groups/1373361046396315/permalink/2207266249672453/", "likes": 3, "comments": [{"username": "Vivien Paulik", "comment_text": "The whole gondola is 80€ so you can share it with others"}, {"username": "Carol Hamilton", "comment_text": "Hey I’m also wondering does the gondolier prefer cash or is card ok"}, {"username": "Joyce Sponcia", "comment_text": "Should you tip him or not?"}, {"username": "Viraf NZ", "comment_text": "Yes upto 5 people"}, {"username": "Philippa Tony", "comment_text": "Do gondola take credit cards"}, {"username": "Sabrina Marie", "comment_text": "How do you get on a shared one as a single rider?"}]}, {"id": "2207026563029755", "text": "Hi weird question…does anyone know how long it takes to get from San Zaccaria-Piazza San Marco water taxi stop in Venice to Piazzale Roma stop using private water taxi ? ( need to avoid stops to make it there faster if possible.) Google maps only shows walking and the water bus with stops. Thanks for any info about private taxis or faster routes with less stops.", "link": "facebook.com/groups/1373361046396315/permalink/2207026563029755/", "likes": 0, "comments": [{"username": "Vikki Hudson", "comment_text": "Anyone?"}, {"username": "Karen Blackmore", "comment_text": "Ask where you are staying. They should know. A private water taxi will be much quicker but a lot more expensive."}]}, {"id": "2207294376336307", "text": "We want to plan a trip to Italy in September 2024 for 6-8 family members. It’s our first time and definitely want to see Rome, Amalfi Coast, Pompeii, possibly Florence or Venice for 12-14 days total. Should we use a travel agent or book on our own? Any suggestions or recommendations would be appreciated.", "link": "facebook.com/groups/1373361046396315/permalink/2207294376336307/", "likes": 4, "comments": [{"username": "Jerry Kiger", "comment_text": "I’m in same boat and been watching postings suggestions. Some say travel agent (but have cost but also can help if problems), some say use an “internet agent” such as Costco or AAA for broad flights n hotels. Depends if traveled internationally\nprior to do on own, if want lot of plans or just arrive and freedom to relax … there lot online and apps to help ie Viator, Trenitalia or Rome2rio - trains. Hard question for sure …"}, {"username": "Billie Begley", "comment_text": "We did it all\nOn our own for a group of 7 We flew into Venice. Spent 3 nights in Venice at Olimpia Hotel. Booked a walking tour and skip the lines into the bell tower and evening tour of St Marks. Then train to Rome for 4 nights. Booked all\nOur tours in advance. Used RomeInLimo and Walks of Italy. Then onto Sorrento for 5 nights. Used Sorrento as our base. We did a boat tour around Capri to the Blue Grotto plus another full day on Capri on our own. One day touring Amalfi Coast. Booked a private driver who took us to Mt Vesuvius to hike the Volcano then Herculaneum. Next tour from Sorrento we did Pompei. In Sorrento we booked Palazzo Montefusco. Excellent small boutique hotel. Excellent breakfast. Centre of Sorrento. Rome we booked Hotel Barocco. Have been there 4 times. Private guides for Amalfi we used Ciro la Motta he is the Best Guide you can get. Hope this helps."}, {"username": "Billie Begley", "comment_text": "We travel a lot. We always book our own airfare and hotels. If you have an issue you don’t want a third party involved."}, {"username": "Jay Parekh", "comment_text": "I booked all hotels via Expedia."}, {"username": "Marjie Gignac", "comment_text": "It costs the same amount of money to have an experienced travel agent help you book your trip or you do it on your own. We have been to Europe 3 times and we always use an agent. I don't want to have to worry about the small details. I want a guy holding my name up waiting for me at the airport. Same cost. You have to figure out what your peace of mind is worth."}, {"username": "Angela Genduso", "comment_text": "Use a travel agent they get a small percentage of what they book. It doesn't cost you more and if theirs a problem they take care of it. NOT A TOUR"}, {"username": "Regina-Rich Krett", "comment_text": "I always book our own travel. I tried a travel agent once a long time ago and had issues with my flight connection while at the airport and I had major issues dealing with it because it was booked by a travel agent so the airline didn’t want to deal with me and I couldn’t get hold of the travel agent after hours. I have never used a travel agent since that happened and I just book everything myself."}, {"username": "Stacey Cohen Sturner", "comment_text": "We used a travel agent and would do the same again in a heartbeat. She nailed our itinerary at a cost commensurate with what we would've paid on our own. It's been perfect. Also appreciate the agency loads the schedule and documents into an app (AXUS) for easy access."}, {"username": "Marie Cuzzi", "comment_text": "I always use a travel agent it’s piece of mind for me …"}]}, {"id": "2207282243004187", "text": "Hello. I am traveling Italy in october after first week. From naples want to go to the amalfi coast. To explore amalfi coast in limited time(2days) what will be the best option to stay? Sorrento or positano? Please suggest a proper itinerary. Thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2207282243004187/", "likes": 0, "comments": []}, {"id": "2207299319669146", "text": "Is modern Pompeii a good place to stay?", "link": "facebook.com/groups/1373361046396315/permalink/2207299319669146/", "likes": 0, "comments": []}, {"id": "2207328632999548", "text": "Is it possible to do a day trip to Amalfi whilst staying in Rome? I am unable to book somewhere in Amalfi as it’s so last minute. Just not sure if it would be worth it :)", "link": "facebook.com/groups/1373361046396315/permalink/2207328632999548/", "likes": 5, "comments": [{"username": "Carmine Napolitano", "comment_text": "its 8+ hrs round trip"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "yes look here https://\nwww.viator.com/\ntours/Rome/\nPompeii-Amalfi-C\noast-and-Posita\nno-Guided-Small\n-Group-Day-Trip\n-from-Rome/\nd511-3731P159?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "Khushi Khanna", "comment_text": "Check if you can book in Salerno. Then take a boat trip to the Amalfi towns"}, {"username": "Flavia Di Bello", "comment_text": "Personally I’d say it’s too far for it to make much sense and be enjoyable. But a day trip to Naples is only 45 mins away by train. Well worth it! I’ve done often day trips the other way around, to Rome from Naples.\nPompeii is a great option too as you can take a train connection from the main train station in Naples."}, {"username": "Virginia Lane", "comment_text": "Yes, we did a day trip with a tour."}, {"username": "Elizabeth Tenaglia", "comment_text": "We went on an actual tour (early morning meet in Rome) about a 14 hour day and we didn’t get to spend much time in any one place but got to see it at least in order to know if next trip we wanted to spend more time there. I think it was with it for what we wanted."}, {"username": "Marty Harte", "comment_text": "We did a bus tour with ferries last week through Viator (city wonders was the guide). 7am Leave rome to Salerno then Ferry to Positano for few hrs then ferry to Amalfi for 2 hours then back to Salerno and bus home. Looong day but glad we did it for the small taste of that area. I think we were back at bite around 10pm."}, {"username": "Robin Burrell", "comment_text": "Train to Salerno then ferry to Amalfi, or Positano. Or Capri. It will be a full day and if I was coming back again wouldn’t do it but if this is likely your last chance have a fun day!"}, {"username": "Stephen Henn", "comment_text": "What dates are you thinking of going to Amalfi coast?"}]}, {"id": "2207339372998474", "text": "Any tips on getting from the cruise port on the amalfi coast to beaches and shops?", "link": "facebook.com/groups/1373361046396315/permalink/2207339372998474/", "likes": 0, "comments": [{"username": "Sandy Radican Shikaly", "comment_text": "Ferry port? The Amalfi Coast is 25 miles long and 13 towns.. where do you mean?"}, {"username": "Christina McCollough", "comment_text": "You can hire a car, or get your steps in."}, {"username": "Maria NoBa", "comment_text": "I would take a ferry to Amalfi but a bus to Positano and walk down. Otherwise you’ll be going uphill. You can take a ferry back once you reach the bottom of the hill."}, {"username": "Nick Brown", "comment_text": "U dont take a bus. some people have been there... u get the ferry. the bus is cock a block. take an hour. and u could be standing most of the way"}]}, {"id": "2207340959664982", "text": "So y’all helped me choose Venice, Florence and Rome for our first Italy trip in late February/early March. We will have 9 hotel nights. Trying to decide between splitting evenly 3/3/3 or doing 2 in Venice, 3 in Florence (with day trip to Tuscany) and 4 in Rome. What do y’all think? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2207340959664982/", "likes": 7, "comments": [{"username": "Angela Siragusa", "comment_text": "Have been multiple times to all 3 cities. Your last 2/3/4 might be best for first time."}, {"username": "Brice Blosser", "comment_text": "3/3/3 is a good split."}, {"username": "Meredith Williams", "comment_text": "i think 2 in venice is plenty"}, {"username": "Rose Anderson", "comment_text": "Totally depends on what you want to do- do you prefer tours of art and history? Then spend more time in Rome and Florence- but are there other areas you want to see near those cities? Tuscany region near Florence - Sorrento and Amalfi coast near Rome-"}, {"username": "Susan Tipsord", "comment_text": "If you have 2 nights for Venice, I would consider staying in Verona and taking one day for Verona and 1 [long] day to see Venice, Murano & Burano. Venice is one hour by train from Verona."}, {"username": "Annette Giovia", "comment_text": "Stay AS LONG AS YOU CAN IN ITALY. If I had known it'd take me FOREVER to get back there (still trying) I would have NEVER left to come back stateside on my first visit!! Just go everywhere you can for as long as you can."}, {"username": "Sylvie Hogg Murphy", "comment_text": "Which city will you be starting in? Consider that the first day/night is for getting adjusted to the time and recovering from the overnight flight. It’s good for strolling and getting oriented but I wouldn’t plan on doing any major sightseeing. So, just factor that in. Rome is obviously the biggest, with the most to see and do (it goes waaaaay beyond the Colosseum and Vatican), so you could easily spend 4 nights. For Florence, 3 nights is good for seeing the main sights and also adding in a day trip. Venice for 2 nights is great, as it’s small and you can cover a lot of ground (and water) in a relatively short time. But if you’re starting out in Venice, not Rome, 3/3/3 might be the way to go."}, {"username": "Karen Schmidt", "comment_text": "I think 4,3,2 is a great breakdown assuming you land in Rome. If you land in Venice, I would do 3,3,3"}, {"username": "Gail Dial Harris", "comment_text": "Rome was my least favorite of the three!"}, {"username": "Sandy Radican Shikaly", "comment_text": "Rome 3 Florence 4 ( with one day trip out) Venice 2"}, {"username": "Kristin Goetz Smith", "comment_text": "We are traveling near that same time and doing 3 Rome (bc I know the first night we’ll be dead lol), 3 Florence, 1 Bologna, and 2 Venice. We are using one of the Florence days to do a day trip for wine tastings hopefully."}, {"username": "Rebecca Yeoh", "comment_text": "I’d swap one night from Rome for Florence. It’s a great place to use as a base to see surrounds (Tuscany, Cinque Terre, Pisa)."}, {"username": "Dixie Kotylak", "comment_text": "Your 2 3 4 split sounds perfect to me! 👌🏻👌🏻👌🏻"}, {"username": "Eileen Muro", "comment_text": "We did 3/3/\n3. In Venice we took the public transportation...wat\ner bus and went to Burano and Murano. Then another day we went to Verona."}, {"username": "Maureen Rebello Hagerty", "comment_text": "If you’re going to do a side trip in Florence I would do 2/4/3"}, {"username": "Mel Devereux", "comment_text": "I'd take one from Rome and add it to Florence or Venice. But I enjoyed Florence and Venice much more than Rome :)"}]}, {"id": "2207343202998091", "text": "Want to travel to several cities throughout Italy for our trip next year. Pros and cons of going through an escorted tour or doing everything on our own. Recommendations please!", "link": "facebook.com/groups/1373361046396315/permalink/2207343202998091/", "likes": 3, "comments": [{"username": "Roxanne Boccardi", "comment_text": "It depends on what you want to see . Major cities or the small towns in between."}, {"username": "Andresa GB", "comment_text": "It depends the kind of traveller you are.\nI like to do things on my own, I choose some tours but will do things because I like to plan trips.\nBut my mom hates to do that on her own, she loves to buy a ready package and just go with the flow.\nSo, it really varies from one person to another"}, {"username": "Jerry Kiger", "comment_text": "Maybe pick 1-2 schedule/\nbooked tours to lock in incase tickets hard to get, but then allows the freedom to make own schedule on the fly once there?"}, {"username": "Trisha Shipman", "comment_text": "Cost wise…is it cheaper to go with a tour vs your own plan?"}, {"username": "Lori Charlene", "comment_text": "We’re gonna wing a lot of it, we want to rent a car, go on the train, rent scooters. We also want to experience hostels, air B and b’s, and hotels. We will do most on our own but do a few tours. We will be going for no less than 3 wks. Any tips welcomed. We’re from Canada and are planning on going in June 2024."}, {"username": "Stacy Derouin", "comment_text": "We did a little of both and it worked beautifully for us. We had no interest in participating in a larger tour group, so our travel agent helped us plan private ground transportation that allowed us the flexibility we wanted, along with schedule private or small group tours to the historic sites we wanted a guise for. The rest of the time we just poked around and explored-it was wonderful."}, {"username": "Susan Tipsord", "comment_text": "We were in Rome this week and had a private tour guide (an Italian tour guide who works in Naples and in Rome) that our Italian friend set up for us. She was amazing! She met us the first day and we did sites in Rome, and the second day we did ancient ruins and Vatican City. Each day was about 3 hours and then she took us to a local place for lunch. 3 hours of walking and listening in the crazy heat was perfect for us. We then had the afternoon to explore on our own and shop. The cost for our group of 10 was extremely reasonable as well. She was excellent at listening to what we wanted to see and sensing when we were ready to keep going. She had lots of human interest facts as well. Definitely the best part of our Rome experience."}, {"username": "Angela Marsala-Gaydos", "comment_text": "I am booked for a tour that takes you to all the highlights and leaves you free time in the afternoon\nIt’s all planned with transportation and a small group of less than 8. Firebird Tours"}, {"username": "Greg Saba", "comment_text": "First of all, we understand that travel comes in all forms and expect that. We have been going to Italy once or twice a year for 20 years, have been all over including Sardinia and Sicily (where we now own a second home). We always do it ourselves. The planning is half the fun. We want to choose our own lodging facilities. We want to be on our own timetable, and we want to change our plans, when possible, on the fly and maybe due to weather conditions. And, we know there are different kinds of packages, but, for sure, we have zero interest in following a group leader with a flag, sitting on buses every day with people we might not like or having group meals in places we would never select. Our experience is that most packages are significantly more expensive than doing it yourself."}, {"username": "Irene Oda", "comment_text": "It really depends on what type of person you are some people are very comfortable with organizing trips overseas- accommodation and places of interest. The are ok with sifting through an enormous amount of information. Other people are just fine with professionals doing all that work. Some people do a mixture. You are asking the question- I'm guessing you haven't started you're at the beginning?"}, {"username": "Laura Uribe", "comment_text": "I’m club self planned. Tours tell you when to get up (think 6am) to put out your luggage, breakfast at 7 or 8 and in the bus right after. You also can only scratch the surface of a city when you only have an afternoon there. We are on vacation so we don’t want that kind of regimentation. Whatever is best for you! Some people love it. Have fun whatever you decide!"}, {"username": "Starla Dawn", "comment_text": "On your own. Freedom. Flexibility. Fun."}, {"username": "Theresa Sorrentino Pagan", "comment_text": "To each their own, but at first I was going to go with a tour group who plans the whole thing. The more I thought about it, did I really want to be with 20 other people I don’t know traveling on a bus having almost all your time scheduled. I decided to figure out how I wanted yo travel, where I wanted to stay, and then what I wanted to see. I’m so happy I decided to plan it on my own and we leave in three weeks.\nAgain, some want every thing figured out and planned for them. Just do what you think will make your trip the best for you"}, {"username": "Laura Fournier", "comment_text": "Tours are easier as they do all the work but you are on their schedule. Both are good just depends on what you like. Cruises are also a good option to see highlights but no change of hotels"}]}, {"id": "2207342362998175", "text": "I’m trying to buy pantheon tickets through the official website. The purchase keeps getting declined. It says to call my cc company so I did and it says it is on the merchant end. I tried 2 different cc. Has anyone else had a problem?", "link": "facebook.com/groups/1373361046396315/permalink/2207342362998175/", "likes": 0, "comments": [{"username": "Heike Fleming", "comment_text": "We went 2018 and didn't need any tickets."}, {"username": "Nydia Bryan", "comment_text": "Others have had the same problem but had luck paying with PayPal"}, {"username": "Jaime Cleek", "comment_text": "when its declined does it give you an error?"}]}, {"id": "2207347936330951", "text": "I am thinking of buying ticket on trenitalia but can anyone explain to me what the + sign means? Does it mean that i need to go off my 1st train and change to another train? How do I know how far it is betweenआणखी each other if i need to change it?\n\nAlso is it safe for 2 people to walk back from the SM Novella station to our stay near uffizi at 8pm nightime during early September ? Just wondering as i see the daylight is longer in the summer months 🙏🏻 thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2207347936330951/", "likes": 5, "comments": [{"username": "Jennifer Garder Cheney", "comment_text": "I can’t help you with the train, but I have walked from the train station to the Piazza Della Repubblica area many times and yes it is a very safe area!"}, {"username": "Marilisa Romito", "comment_text": "That simply means it is the combination of two trains.\nYou have one change, but still inside the same train station (central Pisa). Just need to change platform to get the second train.\n\nConcerning the distance between platforms, the number of platform might change. On the screens of the first train you can see all details of the departure next trains 🙂 anyway, Pisa train station is not that huge, it will be easier than expected"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "2 trains, you have to change at Pisa"}, {"username": "Carmine Castiglia Jr", "comment_text": "And, Pisa has a tiny train station - just four tracks if I recall correctly. Worst case is you will need to take the tunnel under the tracks to reach the other side."}, {"username": "Alessio Esposito Inchiostro", "comment_text": "Are you using an automatic translator or did they really translate La Spezia with Spice? 😪"}, {"username": "Dawn Burton Hammon", "comment_text": "It looks like arrival is at 6:01 pm, not 8:00"}, {"username": "Nellie Sarmiento", "comment_text": "Yes, it's safe. Dinnertime starts at 8pm so there will be people"}, {"username": "Lucie Belle-Isle", "comment_text": "You have 2 train numbers…therefo\nre 2 different trains. I would not worry to much about missing the second one. The scheduling usually takes into account the time of arrival of other trains that may connect."}, {"username": "Nancy Moran", "comment_text": "Daylight savings time doesn't end until October 26, so light shouldn't be a huge problem."}, {"username": "Jill Medrano Casey", "comment_text": "That walk would be fine. We stayed in Piazza Della Signoria in June and walked that route and in that area at all times of the day and night. Never felt unsafe in the slightest."}, {"username": "Debbie DiOssi", "comment_text": "Uffizi is near Piazza Della Signoria, which is a little past Piazza de Republica. Both areas are very safe, plus there will still be a lot of people out at 8:00. However, if you’re going to have a lot of luggage, it’s at least a 😉 20 minute walk on mostly cobblestone roads n"}, {"username": "Fiona Cameron", "comment_text": "Very safe to walk, I have done it many times … “mature female” travelling solo, never ever felt unsafe.\nTrying to figure out train thing for you"}, {"username": "Fiona Cameron", "comment_text": "Ok this train in only a little longer journey and there are no changes. Not sure what date you plan to travel but i searched sept 12th. I will be staying in Florence from 7th to 10th!! My hotel is 10 min walk from SMN station and I walk all over Florence day and night.\n😊"}, {"username": "Tracey Fairbrother", "comment_text": "2 trains the numbers shown will be on the carriages you change at pisa"}, {"username": "Ian Beyer", "comment_text": "How far between them won’t be known until the day of and the individual track assignments."}, {"username": "Helen Stokes", "comment_text": "F"}, {"username": "Matteo Basile", "comment_text": "Actually looks very clear that are two trains (two train numbers) and your change is in Pisa centrale."}]}, {"id": "2207349469664131", "text": "Planning to go to Italy next May we are going to Rome,Florence and Amalfi Coast. I am a bit unsure on where to go in Amalfi. I heard Sorrento is nice I love the lemons and i would like to see Capri. Any suggestions where to visit in the Amalfi for our first trip to Italy?", "link": "facebook.com/groups/1373361046396315/permalink/2207349469664131/", "likes": 0, "comments": []}, {"id": "2207358739663204", "text": "sorrento rainbow this afternoon x", "link": "facebook.com/groups/1373361046396315/permalink/2207358739663204/", "likes": 11, "comments": [{"username": "Giovanna Nina Grieco", "comment_text": "Giovanna Nina Grieco"}, {"username": "Wendy Carter", "comment_text": "Gorgeous ❤️❤️"}]}, {"id": "2207359546329790", "text": "For those of you who have also been to Vienna, Austria, is it worth a stop there since our flights would be a lot cheaper to fly into there for a day or two before heading to Venice?\nI am traveling with teenagers and they think seeing another country would be nice. That means we see one less location in Italy though. I’m torn!", "link": "facebook.com/groups/1373361046396315/permalink/2207359546329790/", "likes": 15, "comments": [{"username": "Rhona OConnor", "comment_text": "Do it. It's a wonderful city. Lots of music in Vienna, and the Spanish Riding School, they might enjoy seeing them perform."}, {"username": "Аделина Маринова", "comment_text": "Vienna is very nice"}, {"username": "Debbie Milne Jenkins", "comment_text": "Especially nice for your teens to visit another country - sucre torte and Schonbrunn Palace might be of interest."}, {"username": "Donna Gilardone Szwabowski", "comment_text": "Vienna is beautiful! Worth a visit for sure"}, {"username": "Jack Partington", "comment_text": "Vienna is awesome. I would spend at least 2 full days there."}, {"username": "Tricia Wisehart", "comment_text": "Vienna is beautiful!"}, {"username": "Renee Dillenbeck", "comment_text": "Thanks everyone. I guess I need to go!! Now I have to decide what to cut out from our trip. Rome, Florence, cirque Terra, Lake Como, or the train to the Swiss Alps. This will be end of Oct/beg of Nov this year."}, {"username": "Roxanne Boccardi", "comment_text": "Stop and see everything , life is to short ."}, {"username": "Ruth Pellow", "comment_text": "I am traveling to Vienna (stay for 6 days) from where I live in Greece and from there down to Naples (for 7 days) and will be staying on the coast near Pompeii"}, {"username": "LaDonna Metcalf Meindl", "comment_text": "I recommend going to the Vienna ballet. I can’t remember the name of the art museum, but we were stunned at the art we were able to enjoy at leisure, almost by ourselves the entire time."}, {"username": "Simone Pfenninger", "comment_text": "100%Vienna is a fantastic town!"}, {"username": "Paul Anderson", "comment_text": "The money you save will be less then the cost of transportation to Venice. If you like history and grand architecture then Vienna is great."}, {"username": "Laurie Francis Menk", "comment_text": "Vienna is beautiful!"}, {"username": "Marina Marinushkina", "comment_text": "Vienna is definitely worth a visit!"}, {"username": "Nydia Bryan", "comment_text": "Vienna is definitely a place to visit"}, {"username": "Gail Dial Harris", "comment_text": "Yes indeed!"}, {"username": "Gillian O'Callaghan", "comment_text": "Fabulous city to visit 👍"}, {"username": "Stella Dee", "comment_text": "Yes! Well worth the time to stop in Vienna."}, {"username": "Ville Lignell", "comment_text": "Absolutely. The ÖBB Vienna-Venezia night train brings you Venice."}, {"username": "Suzanne Mills", "comment_text": "I love Salzburg"}, {"username": "Ian Woods", "comment_text": "Definitely - my relations come from Hungary and each time I fly to Budapest from Australia I always also visit Vienna. It is one magic city and if you are travelling to Europe, in addition to Italy you should not miss Vienna but please allow 3 or more days at a minimum."}, {"username": "Margaret Layden", "comment_text": "Austria is my favorite country in all the world. So beautiful. So worth it."}, {"username": "Beth Cockman", "comment_text": "I love Vienna! Lots of pretty sights and delicious food."}, {"username": "Jun Cee", "comment_text": "yes. easy to hop into the city center from the airport so you can stay near the airport and ease the outbound trip the next day."}, {"username": "Angie Davidson", "comment_text": "Vienna is amazing, took our kids there last year and honestly it is the prettiest city we have been to. Everything is so grand!"}, {"username": "Ali Everson", "comment_text": "Vienna is beautiful and you will love it if you go. 💖"}, {"username": "Tracy Foss", "comment_text": "Definitely ! It's a beautiful place to see"}, {"username": "Lisa Abrams Argento", "comment_text": "Yes, I loved Vienna."}, {"username": "Jessica Stewart", "comment_text": "I loved Vienna when I went a few years ago"}, {"username": "Renee Rundle Stoneham", "comment_text": "Vienna is wonderful!\nWe had 1.5 days and wish we had more!!\nThe tram is a great way to get around the city."}, {"username": "Kristina Ruk", "comment_text": "As long as you land there its of course interesting and worth it;) Vienna is a stunning city ;)"}, {"username": "Laura Irmina", "comment_text": "Vienna is absolutely gorgeous. Great idea even for a walk!"}, {"username": "Nuša Šuklje", "comment_text": "Vienna is beautiful!"}, {"username": "Eleni Koi", "comment_text": "I second all above comments. You should not miss the opportunity"}, {"username": "Silvia Scholz Natal", "comment_text": "Vienna is one of the most beautiful city in Europe ! Go if you can 👍🏼👍🏼👍🏼"}, {"username": "Bonnie Rodgers Henderson", "comment_text": "Go,it's a great place to visit, lots to see and do"}, {"username": "Shari Powers Roberts", "comment_text": "As everyone has said, Vienna is a beautiful city. Definitely go!"}, {"username": "Zuzana Murínová", "comment_text": "Vienna is a really beuatiful city, you can see beuatiful sightseeings there, a lot of art and culture, you can eat there well, you can experience a very nice walk there in the city center"}, {"username": "Manuela Bussler Sweeney", "comment_text": "It's gorgeous there. You won't regret it!"}, {"username": "Eva Perocsenyi", "comment_text": "And then how would you go to Venice? Another flight? It's 9 hours by bus."}, {"username": "Lisa Roth", "comment_text": "Vienna is beautiful"}, {"username": "Etschi Bruckner", "comment_text": "I live in Vienna - of course it´s worth it! And you get really cheap flights on ryanair to Venezia ( and lots of other places) - that´s why I visit Italy a lot!"}, {"username": "Susan Lowry Lamb", "comment_text": "Absolutely."}, {"username": "D Rochelle Milton", "comment_text": "Beautiful city!! Go where Mozart & Freud called home 🖤"}, {"username": "Angela Genduso", "comment_text": "Omg I loved Vienna its a beautiful city"}, {"username": "Lydia Springer", "comment_text": "My opinion - a big yes!"}, {"username": "Randy Laub", "comment_text": "Vienna hasn't been voted \"The Most Livable City in the World\" for nothing. https://\nwww.smithsonianm\nag.com/\nsmart-news/\nvienna-most-liva\nble-city-2023-1\n80982434/"}, {"username": "Andrea Celli Zeitvogel", "comment_text": "Vienna is beautiful and soo historic. Take a cruise down the Danube … see the Vienna waltzing, Home of classical music. Lots to see and not just for adults. I loved it at 23."}, {"username": "Fetchin Gretchen", "comment_text": "Vienna is one of the finest cities in the world so absolutely yes!"}, {"username": "Venette Macalinao", "comment_text": "I love Vienna. Beautiful city."}, {"username": "Rip Lonergan", "comment_text": "Absolutely! ￼ I have traveled extensively visiting 59 countries and I can tell you I thought Vienna was incredible. There’s so much to see in and around Vienna I believe it will surprise you."}, {"username": "Michelle Risser", "comment_text": "I took an overnight train from Venice to Vienna and back ! Loved that experience as well"}]}, {"id": "2207337862998625", "text": "Must I book bullet train tickets from Milan to Naples in advance?", "link": "facebook.com/groups/1373361046396315/permalink/2207337862998625/", "likes": 2, "comments": [{"username": "Tania Lediard", "comment_text": "If you want to guarantee availability and best price, then you should book in advance."}, {"username": "Michael Messina", "comment_text": "Yes for sure the only way"}, {"username": "Gillian O'Callaghan", "comment_text": "Day before is fine."}, {"username": "Paola Iampietro", "comment_text": "Yes"}]}, {"id": "2207298606335884", "text": "In Florence now. Help me find an open wine window! Thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2207298606335884/", "likes": 124, "comments": [{"username": "Cathy Trail Smith", "comment_text": "I’ll be in Florence next month! How do you pay for the wine and what do you do with the glass when you’re finished? I need Wine Window Etiquette!!!!🍷🍷🍷🍷🍷"}, {"username": "Anna Alves-Regalado", "comment_text": "Danny Regalado"}, {"username": "Pam Hartsoch", "comment_text": "You can Google a map. That’s what we did"}, {"username": "Debra Rigler-Arsenault", "comment_text": "Is there a wine window tour to the ones serving wine?"}, {"username": "Maurice Bastarache", "comment_text": "Babae is a good one"}, {"username": "Jill Berg", "comment_text": "There's a map online"}, {"username": "Deb Porter", "comment_text": "Call Stanley Tucci, he knows where they are."}, {"username": "Nicole Kielly-Coleman", "comment_text": "Bronte 🍷"}, {"username": "Terri Sileo", "comment_text": "What is a wine window?"}, {"username": "Debbie Horton Rough", "comment_text": "Follow"}, {"username": "Tissie McClure", "comment_text": "Our golf cart driver took us to this one, but it wasn’t open until 11 AM!"}, {"username": "Jennifer Louise Snedden", "comment_text": "Debra Quinney I was going to ask the same question 🤣"}, {"username": "Alicia Dee", "comment_text": "Google it, there’s two. Both long lines of instagramers. There’s nothing much to it so I didn’t even bother to wait, I just went to another place for wine."}, {"username": "Kellie Flegg", "comment_text": "Natalie Answerth"}, {"username": "Melina Millar", "comment_text": "Jill James these look like fun 🍷"}, {"username": "Sera Wright", "comment_text": "Kyle Goodwin"}, {"username": "Pia Reilley Loughin", "comment_text": "Pia Reilley Loughin"}, {"username": "Lisa Pro", "comment_text": "There all over the place"}, {"username": "Sarah Esposito", "comment_text": "Babae!!"}, {"username": "Joni Kennedy", "comment_text": "It’s by the glass, so you can sit in the square and watch !"}, {"username": "Diane Manchester", "comment_text": "I was there this summer. It was a little touristy, but I loved it"}, {"username": "Diane Manchester", "comment_text": "Very nice guy served the wine."}, {"username": "Victoria Marchetti", "comment_text": "Babet! and the food inside was amzing as well...our best meal was one of the best our wntire trip to Italy"}, {"username": "Diane Manchester", "comment_text": "If you go to the tourist bureau, they will tell where some are located. I did and I had a fun time at this one."}, {"username": "Elizabeth Colleen Fowler", "comment_text": "Leanne Bingle lol 😂"}, {"username": "Lisa Hartert", "comment_text": "I think there’s one by Dante’s church/house? 🍷"}, {"username": "Rainha Jane", "comment_text": "Daryl Clark"}, {"username": "Jason Berard", "comment_text": "Jason Berard"}, {"username": "Eliza Hatzivassiliadou", "comment_text": "BABAE"}, {"username": "Elizabeth Colleen Fowler", "comment_text": "Leanne Bingle"}, {"username": "Grazia Mottinelli", "comment_text": "Try and have a look at this website buchettedelvino\n.org there's a list of them and their address"}, {"username": "Jean Flannery Mehrkens", "comment_text": "Matt Mehrkens Shannon Jean Sarah Mehrkens Molly Mehrkens we will need to find a wine window when we are in Florence"}, {"username": "Tiffany Shimunek", "comment_text": "Laura, Ruth and Chris, we must add to our list of \"must dos\"! Cin cin 🍷"}, {"username": "Jihan Adem", "comment_text": "There is one I found…"}, {"username": "Bonnie L Maraia", "comment_text": "Karen Vieira Maraia we need to do this"}, {"username": "Bob Lampo", "comment_text": "https://\nwww.theintrepidg\nuide.com/\nwine-windows-in-\nflorence/"}, {"username": "Jessica Asquith Hemphill", "comment_text": "Went to this one last week"}, {"username": "Jessica Asquith Hemphill", "comment_text": "And this one"}, {"username": "Tracy Walker", "comment_text": "Find the restaurant Babae ￼ it’s next to that🍷"}, {"username": "Jacqui Du Chenne McKenzie", "comment_text": "Go on the bicycle tour you will see them . It’s also the best way to see Florence."}, {"username": "Shelley Frise", "comment_text": "We seen a few while visiting Florence but not sure where they are"}, {"username": "Sharon T Dwyer", "comment_text": "I have decided that rather than search endlessly for a wine window, I will prefer to sit at a lovely sidewalk cafe sipping wine and being served. Looking forward to just watching Italy pass before me."}, {"username": "Bev Gronow", "comment_text": "Cross the ponte vecchio bridge from ufizzi and bear right towards via Santo spirito. Card only payments. Enjoy!"}, {"username": "Dana Talusani", "comment_text": "Babae wine--give it a shot! I am sorry that people are rude jerks and laugh/tell you to Google. There are so many snotty arseholes on this site and it's a shame."}, {"username": "Frances McDonagh", "comment_text": "Cantina de pucci"}, {"username": "Frances McDonagh", "comment_text": "Frances McDonagh"}, {"username": "Cerese Nadine", "comment_text": "YouTube!"}, {"username": "Angie Smith", "comment_text": "Rob Smith I want to find one of these when we are in Florence."}, {"username": "Joanne Fish", "comment_text": "What is a wine window?"}, {"username": "Amy French Baillie", "comment_text": "Via del pucci"}, {"username": "JoLynn Stecher Munro", "comment_text": "JoLynn Stecher Munro"}, {"username": "JoLynn Stecher Munro", "comment_text": "JoLynn Stecher Munro"}, {"username": "Melissa Doran", "comment_text": "Melissa Doran"}, {"username": "Janis Nunez", "comment_text": "We found only open 2 in Florence."}, {"username": "Catherine Stewart", "comment_text": "Can’t recommend a window. But WHOLY recommend enotecca Alessi just near the duomo for wine tasting 👌👌👌👌"}, {"username": "Carrie Jendrasheske", "comment_text": "Renee Dawn"}, {"username": "Jodi Lynn", "comment_text": "Babae...just over the Ponte vecchio then turn right....can't miss it on the left a few streets down!!"}, {"username": "D'Anna Sullivan", "comment_text": "How did I not know about this? I left 2 1/2 weeks ago! Was only there a few hours though."}, {"username": "Linda Ryan", "comment_text": "Are there any in Rome?"}, {"username": "Linda Ryan", "comment_text": "Are they exclusive to Florence? Spending a few days in Rome and would love to find one!"}, {"username": "Laura DeCicco", "comment_text": "Babae"}, {"username": "Marcus Hiesler", "comment_text": "Sharon Hiesler"}, {"username": "Katie Marie", "comment_text": "Currently here too. I understand the frustration with the comments about googling it lol. Just because the restaurant is open doesn’t mean they are using the wine windows."}, {"username": "Joseph DellaFave", "comment_text": "Make a left down Main Street"}, {"username": "Kim Hull", "comment_text": "The one I went to is called 'Buchetta del Vino' - it'll come up in Google Maps. This is what it looks like"}, {"username": "Vasko Lingurovski", "comment_text": "https://g.co/\nkgs/Mvr9LQ"}, {"username": "Amie Michael- Hickel", "comment_text": "I found this one. Very close to the cathedral."}, {"username": "Margene Jones", "comment_text": "Margene Jones"}, {"username": "Amie Michael- Hickel", "comment_text": "Amie Michael- Hickel"}, {"username": "Robin Beseda-Haxhijaj", "comment_text": "Here’s the one we went to!"}, {"username": "Patsy Luque Mejia", "comment_text": "Osteria Belle Donne"}, {"username": "Cherie Horne Duda", "comment_text": "There were 2 open when we there a few weeks ago...one is attached to a really good restaurant https://\nwww.belledonneos\nteria.it/"}, {"username": "Candis Morgan", "comment_text": "Bernie Morgan"}, {"username": "Julie Brazil Dixon", "comment_text": "Babae's!!! We loved that place!!"}, {"username": "Bonnie Manter", "comment_text": "Vivoli gelato"}, {"username": "Christopher Walsh", "comment_text": "Look to your left"}, {"username": "Eileen Muro", "comment_text": "Eileen Muro"}, {"username": "Amy Prince Johnson", "comment_text": "I went to Babae last week!"}, {"username": "Kevin Smith", "comment_text": "Babae in Piazza Santo Spirito\n\nhttps://\nmaps.app.goo.gl/\n7JUPGhgJ74y7Puuw\n5?g_st=ic"}, {"username": "Debra Quinney", "comment_text": "What is a wine window ?"}, {"username": "Anthony Sperduti", "comment_text": "You just kind of come upon them\nIf you walk around a bit\nYou will see them"}, {"username": "Kate Laidlaw", "comment_text": "Buchetta del vino firenze into Maps. Fun!"}, {"username": "Katie Caisley", "comment_text": "Saw this thismorning in Florence near the Arno bridge"}, {"username": "Marisol Lopez-Nieves", "comment_text": "If you google it it will show you the location from where you are, and provide the best route, is the fastest way to find it"}, {"username": "Elena Mattei Ruiz", "comment_text": "Yes, the struggle is real! 🤣."}, {"username": "Karyn Sternberger Sikorski", "comment_text": "https://\nbuchettedelvino.\norg/\nhome%2520eng/\nmaps.html\n\nIf you scroll down the is an interactive map"}, {"username": "Judy Charon", "comment_text": "Thanks for sharing the information folks. Looking forward to this."}, {"username": "Debbie Fekete Gene", "comment_text": "Was just there last month and couldn’t find one open. They were all closed"}, {"username": "Alex Hicks", "comment_text": "Alex Hicks"}, {"username": "Kelly Casper", "comment_text": "HELP! Flying into Rome & out of Milan. In desperate need of help figuring out the three places to stay during our trip of 12 days. Which cities or regions would be most central to get to other places for possible day trips? Places we must see? I’ve got to decide this today and book hotels. Any help will be greatly appreciated!!! Coming the end of August. 🙏🇮🇹🎉"}, {"username": "Victoria Mailloux", "comment_text": "I also struggled to find one when I was there!"}, {"username": "Jenn Lackey", "comment_text": "Babae"}, {"username": "Lori Mongillo", "comment_text": "https://\nwww.solosophie.c\nom/\nflorence-wine-wi\nndows/"}, {"username": "Gina Rovello Keenan", "comment_text": "Google it"}, {"username": "John Bruckman", "comment_text": "Just google it… it’s easier"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2207297976335947", "text": "Hi! First time travelling to Italy here looking for suggestions.\nI’m flying into Malta in October for 4 days, then want to visit Italy for 5 days. I definitely want to visit Rome & Vatican City. Other areas of interest include Florence, Venice…. Then fly home from the last spot.\n\nAny itinerary suggestions to capture the highlights on this short trip? Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2207297976335947/", "likes": 0, "comments": [{"username": "Susan Tipsord", "comment_text": "Been here 8 days, and we've visited Verona, Venice, Florence & Rome. Florence was my favorite, followed by Verona, Venice & finally Rome. We found that as we moved south, our enjoyment sadly did not. . I would definitely do Florence. The shopping, especially for anything leather, is fantastico! Sitting in cafes on the piazzas, for aperitivo and people watching, is nothing short of sport. The best advice we got was to only plan for 2-3 nights in Rome. I'm so glad we did. The historical sites are amazing, but I did not like Rome."}, {"username": "Greg Saba", "comment_text": "You have to decide what YOU like to see and do. Some think Florence is heaven; others, like us, can't stand the crowds. Both Florence and Rome are overrun with tourists. Rome is a bit more spread out. We always enjoy Rome (been there a couple dozen times), nonetheless, but Florence, we've been twice and probably not again. Of course, we are all different. Four days in a relatively small island of Malta will work for you. The last time we were there, we stayed in the peaceful three island area off Valletta and traveled by ferry and bus. Trying to tour Italy in five days is simply too much. We are aggressive travelers might consider, for a first time visit, Rome for 3 days and Venice for two if you want two different experiences. Or, for something different, take the ferry to Sicily and go to Ortigia and Taormina. Italy has so many wonderful spots: Amalfi coast, Puglia, Umbria, Tuscany, the northern lakes, the Dolomites and Italian Alps, the Italian Riviera, Cinque Terre, Sicily, Sardinia and many, many more. We can relax and enjoy any of those places that will be a much different experience than the usual Rome, Florence and Venice trip."}]}, {"id": "2207294343002977", "text": "Best place for a quick lunch in Rome near the Colosseum?", "link": "facebook.com/groups/1373361046396315/permalink/2207294343002977/", "likes": 9, "comments": [{"username": "Samantha Glidden", "comment_text": "Ristorante Pizza Forum Roma- Forno a Legna. I send my travel clients there all the time and haven't heard anything negative"}, {"username": "Jon Cheeks", "comment_text": "Don’t know the name of the restaurant we went to after the tour. We were beat and tired so just walked across the street and went to the 2nd one we saw. It was pretty good."}, {"username": "Chiara Antonelli", "comment_text": "I clementini"}, {"username": "Suzanne Mills", "comment_text": "Too touristy, go local back streets."}, {"username": "Kippregge Logan", "comment_text": "Mcdonalds"}, {"username": "Maria Gregory", "comment_text": "We went here after recommendations\n, it’s across the road from the colosseum and really close to the train station. Great food, drinks and service\n\nhttp://\nwww.ristorantela\nbiga.it/biga/"}, {"username": "Ken Vecchia", "comment_text": "There aren’t any"}, {"username": "Andrea Corey Andrews", "comment_text": "There's several local restaurants near there to eat"}, {"username": "Broderick Kelly", "comment_text": "Bocconcino is within walking distance. We were staying near the Colosseum last week and were faced with that same question. We were not disappointed. Good food and good service."}, {"username": "Notarstefano Na Kori", "comment_text": "If you want a good meal and don’t want to pay ridiculous prices than find a local one a little bit from the Colosseum. Restaurants around tourists places are very expensive and not the best quality"}, {"username": "Arike Shrestha", "comment_text": "Kathmandu fast food nearby if you want something different from pasta and pizza."}]}, {"id": "2207289319670146", "text": "Traveling to Lake Garda , specifically Near Malchesine, what is the best way to get there from the Milan airport? Ty", "link": "facebook.com/groups/1373361046396315/permalink/2207289319670146/", "likes": 0, "comments": [{"username": "Pietro Adami", "comment_text": "Which Milan airport? Malpensa, Linate or Bergamo ?"}]}, {"id": "2207276859671392", "text": "My wife and I are taking a train from Naples to Rome and see 2 different trains (Bullet Train Italo and Italia Rail). They're the same price for Executive or Business. Does anyone recommend one versus the other? Thanks in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2207276859671392/", "likes": 2, "comments": [{"username": "Lisa Aho", "comment_text": "Look at how long each is because sometimes that is different. I did Italo today and it was great."}, {"username": "Philip Curnow", "comment_text": "Stick to Italo if you thought it was great. Trenitalia has got better since Italo upped the competition"}, {"username": "Line Gregoire", "comment_text": "Italo is great!!"}, {"username": "Jay Littleford", "comment_text": "Italo it is. Thanks all!!!"}, {"username": "Sandy Radican Shikaly", "comment_text": "Italo and Trenitalia are very similar.. slight preference to Italo.. Italia Rail is a booking site"}, {"username": "Susan Tipsord", "comment_text": "I think it also depends on your route. There isn't always a choice. We had good luck with both, but the Italo app was more user-friendly."}, {"username": "Marty Harte", "comment_text": "We did rome to Naples on Trenitalia bullet train last week. Think it was 45 mins. We did a day trip no luggage so didn’t upgrade. Way back we took earlier train back and had to pay small fee for what I think was business. Outside of snacks and nicer leather seats I didn’t see a huge diff.\n\nTrains themselves were very efficient."}, {"username": "Shannon Madison", "comment_text": "Italo is private owned and I thought generally nicer."}, {"username": "Chiara Codecá", "comment_text": "Goodness, Frecciarossa Trenitalia all the way. Italo has good service, but they cram too many seats per car. It's packed, and I hate it."}, {"username": "Ibbu Mohd", "comment_text": "Italo -private company, so less to no strikes."}]}, {"id": "2207275026338242", "text": "I’m trying to look for underground night tour tickets for the Colosseum in September. I know they are only available 30 days beforehand, but none of the dates are showing up as available. The schedule says they are doing them to September. Does anyone know if they will have September tickets available, or do the tours only go through August?", "link": "facebook.com/groups/1373361046396315/permalink/2207275026338242/", "likes": 1, "comments": [{"username": "Melissa Hunt", "comment_text": "I’ve been trying to get an answer to that for a week. I’ve sent two emails to Coop Culture with no response. When I’ve had the concierge call them (I speak zero Italian) all they tell them is you have to wait 30 days and the website will show what’s available. Since they never released tickets for sep 1 or 2 I’m assuming they don’t offer it in September. Their statement on the website is very misleading to say it’s offered May to September. Maybe “to” doesn’t mean “through”."}, {"username": "Karen Robertson Fitterer", "comment_text": "I have the same question!"}]}, {"id": "2207273419671736", "text": "I was wondering what website people find good deals for flights to Italy was just checking on Expdia its over 1600 per person and when it's good time to buy it for next June 24\nThanks 🙏", "link": "facebook.com/groups/1373361046396315/permalink/2207273419671736/", "likes": 10, "comments": [{"username": "Elizabeth Jayne Harris", "comment_text": "Download hopper set the dates your going to and from and it gives you updates as the prices go up and down"}, {"username": "Monica Roman-Fazio", "comment_text": "We flew emirates this past June out of jfk it was the best airlines I dealt with. It was also the cheapest we booked the end of jan"}, {"username": "Jennifer Melka Maley", "comment_text": "Book now! And book direct. We just did for early June flying into Venice from Philly ,American Airlines. . Cost a fortune already 😕 $8k for 4. And that economy with slightly upgraded seating but not much. Still losing sleep over it…"}, {"username": "Donna Spencer", "comment_text": "I booked my October flight back in January $1300. Tulsa/Dfw/Rome return."}, {"username": "Kim Jensen-Lueders", "comment_text": "We just booked our on Delta for next June. We have 6 traveling together so we want to be together 😁. Don’t think you will get a much better price than you found, but double check what you are getting for that price."}, {"username": "Tracy Wrinn Mcdermott", "comment_text": "Try Skyscanner app. You can set an alarm to be notified of price drops"}, {"username": "Madeline Caporale", "comment_text": "You usually cannot book international flights much further out than about nine months. Best place to find all options is Google flights, then book directly through the airline. When you book you may want to also purchase travel insurance. Due to extreme weather, wildfires, and other events airlines have been making changes to flight schedules-some are minor, others are cancelations."}, {"username": "Gillian O'Callaghan", "comment_text": "It might help to edit and say where you are and the currency the 1600 refers to 🤔"}, {"username": "Irene Oda", "comment_text": "Looking at the moment is the right thing. We normally just look. Things should change around November. That's when we book."}, {"username": "Kristin Goetz Smith", "comment_text": "I use google flights. I play with the dates and locations and then track various flights to get price updates. I usually do this for several weeks and book my trips based on the best flight prices. Watching them for a few weeks allows me to see how they’re fluctuating. I see flights to Rome in the $600 range February/\nMarch. They go up from there once you move into April and later. Just depends on how flexible you can be with your dates."}, {"username": "Delphinia Salamin", "comment_text": "Maybe wait to look again in December. It’s too early to book for next June"}, {"username": "Melissa Wuerthner", "comment_text": "We used Priceline and got two round trip tickets from Newark NJ to Milan for about 1500.00"}, {"username": "Frank Hunt", "comment_text": "Where from?"}, {"username": "Shivonne Yarden", "comment_text": "Following: flying out of SFO in June."}, {"username": "Tami Sue", "comment_text": "Check every day and clear ur searches. Expedia has a price watch option."}, {"username": "Lisa Ferreira Morris", "comment_text": "Just booked our multi city flights in June 24 BOS➡️ATH and FCO ➡️ BOS on Delta Comfort +. Way more than I anticipated but you only live once! 😅"}, {"username": "Lynn Kennon Staggs", "comment_text": "Purchased airfare in July for September and October round-trip. $1700 for 2. Only search in incognito mode on Google. When I did not do that price went up $1000."}, {"username": "Rimma Kofsman", "comment_text": "Thank you very much ❤️"}, {"username": "Charmaine A. Caros", "comment_text": "Seems with revenge travel to Europe prices are only going up. I already book my April trip."}, {"username": "Jessica Morgan", "comment_text": "Check out Condor Airlines to get to Europe, then regional airline to Italy. Great airline and good prices."}, {"username": "Jennifer Brothers", "comment_text": "Book now, we purchased tickets 8 months ago and prices have only increased for our Sept 28 departure. Delta one used to be $4500 and it’s now $9900"}, {"username": "Annette Mayer", "comment_text": "Download the Hopper app. They track fight prices and let you know when it's a good time to buy"}, {"username": "Michael Spiekermann", "comment_text": "Start with Google flights to get a rough idea of prices.\nThen try Skyscanner also to get options.\nOnce on Skyscanner you will see options for other , lesser known ticketing venders.\nExamples : ASAP tickets, WOW ticketes.\nI recently discovered “Jetcost” has the least expensive flight options from L A to FCO.\n\nPriceline and Expedia don’t offer the best and least expensive flights . They are the most popular but do not show the best options.\n\nAlso, which day of the week you fly can change your price by hundreds of dollars. Use a site that gives you prices for each day of the week ; outbound and the return"}, {"username": "Donna Holt", "comment_text": "Also booking Tuesday nights seems to be best prices as well. Not sure why."}, {"username": "AngelinaandRobert Gunn", "comment_text": "Cheapoair.com is a good website to look."}, {"username": "Pamela S Honeycutt", "comment_text": "Flying from DFW TO Rome 2024-end of October…thank you for all the helpful tips!"}, {"username": "Fetchin Gretchen", "comment_text": "53 days in advance if from USA according to LifeHacks. Then get Expedias price protection plan."}, {"username": "Yolanda D Wells", "comment_text": "Tripmaster.com"}, {"username": "Jan Buess", "comment_text": "I opened a Chase Sapphire card, got a ton of points and no transaction fees and used their travel section and purchased 2 round trip from MB to Rome for $1200 total. Great deal, hope it helps!"}, {"username": "Anna Sardone Tatak", "comment_text": "I paid $2500 a person this year in June. summer is an expensive ticket it’s their peak time, i would book as early as now for June or latest January"}, {"username": "Lee-Anne Stewart", "comment_text": "From where and 1,600 what?\n\nExpedia is good for searching for for flights but you are generally best to book directly with the airline. Also worth noting that if not a direct flight Expedia sometimes bundle single flights at a good price BUT and it’s quite a big ‘but’ you may not be protected if you miss a connecting flight. Whereas if you book directly within an airline on one ticket they are responsible for booking you on next flight at no cost and your hold baggage can usually be checked right through to final destination.\n\nI do use them a lot for hotels though and have often gotten better deals than directly with the hotel.\n\nAlso flight prices are way more expensive post covid. Supply doesn’t necessarily meet the pent up demand and some airlines haven’t reinstated full timetables so they can push the price up."}, {"username": "Jocelyn Blanke Sia", "comment_text": "Kayak, search there to show the cheaper days to fly. Then can book wherever you want."}, {"username": "Wendy Spano Bracco", "comment_text": "Is this economy, business etc. June is one of the most expensive times. I’d be booking June now but that’s just me."}, {"username": "Greg Saba", "comment_text": "Experts opine that the sweet spot for booking international travel is usually 3-4 months before the flight. We use skyscanner and google flights to see what's going on, but we prefer Delta and usually look at their calendar to see cheapest prices (since we usually have no fixed travel dates. Some airlines are just now beginning to post June 2024 flights. Depending on the economy and winter travel, you may see some more aggressive pricing for next June. Right now, increased summer travel has made travel companies a bit optimistic."}, {"username": "Denis Claros", "comment_text": "Start with google flights in incognito mode"}, {"username": "Janet Canter", "comment_text": "I booked 6 months out but I had been looking for three months prior. When I was finally (financially) ready to purchase they had doubled in price so I went ahead and purchased. Initially I was finding one stop flights. By the time I booked I ended up with two stop flights. I wished I had booked earlier.\n\nThe other reason I didn’t book right away was because I didn’t have the itinerary planned out. Once I knew the starting and ending point is when I purchased. Now trying to fill in the plans from start to finish."}, {"username": "Jenni Vail", "comment_text": "Use the “track this flight” option on google flights. I started doing that for a trip for next year. The price already went up $600. Since I started tracking."}, {"username": "Antonina Vicari Dundas", "comment_text": "I booked in jan for end of july from Toronto to palermo 1200pp"}, {"username": "Julie Raab", "comment_text": "I just booked our flights last night for 4 people for June and it was $1100 each. I’ve been watching costs and got creative with one way flights. Outbound is Denver thru Calgary to Rome. Return is Naples thru Lisbon to Chicago and using miles for cheap flights from Chicago to Denver."}, {"username": "Anthony Martini Jr.", "comment_text": "Priceline"}, {"username": "Theresa Sorrentino Pagan", "comment_text": "Are you flying out of the US? Look at Norse out of JFK direct flight. They have business class that comes with all your luggage, 2 meals, larger seats and the recline further back. Economy will be cheaper."}]}, {"id": "2207273203005091", "text": "The hotels in Positano are working out too expensive. I had planned two days in Sorrento, four days in Positano and three days in Amalfi. Can anyone suggest another place instead of Positano?", "link": "facebook.com/groups/1373361046396315/permalink/2207273203005091/", "likes": 31, "comments": [{"username": "Rachael Richardson", "comment_text": "Just stay in sorrento"}, {"username": "Pat Llewellyn Fauver", "comment_text": "https://\nwww.palazzomurra\nno.com/\n\nLittle village outside of Sorrento. Absolutely perfect location!"}, {"username": "Amanda Stephens-Lee", "comment_text": "We have just left Porto Venere and loved it! Not as busy as the Cinque Terre and a good variety of accommodation and no need to book in the restaurants."}, {"username": "Yolie Marroquin", "comment_text": "Stay longer in Sorrento and just do day trips to Positano and surroundings. We stayed in Sorrento years ago for 10nts 👍🏼 and liked having this spot as a base and we easily ventured out to other areas from here 😀 and we didn’t feel like we missed out not actually staying on the Amalfi Coast 😉 Another visit we decided to stay in Minori for 5nts, which is actually the AC and again we easily were able to visit all the places we wanted. It’s nice to be able to just unpack once and get settled in one spot and then venture out from there 😉"}, {"username": "Kyna Martin Autrey", "comment_text": "We stayed in vico equinse, right outside of Sorrento. Lovely view but very small and not much to do and dining option were not very good (worst meal ever there). However, it’s short train ride to Sorrento, where I wish we had spent more time. Doing it again, I would stay in Sorrento, but it’s a good option for a possibly cheaper stay if you don’t mind jumping on the train."}, {"username": "Valerie Gandolfi Stiff", "comment_text": "Priano!"}, {"username": "Soffía Snædís Sveinsdóttir", "comment_text": "Vico Equense, we stayed there last year and loved it. Great restaurants too"}, {"username": "Michelle Symons", "comment_text": "We used Sorrento as a base & went out for day trips to Positano, Amalfi & Revello"}, {"username": "Monika Zoubourlis", "comment_text": "Just enjoyed 4 days in Sorrento with my family and absolutely loved it 🙌🏻"}, {"username": "Sandi Bland", "comment_text": "What are your dates?"}, {"username": "Kimberly Lianne Mariscal", "comment_text": "Praiano is right next door and looks super cute."}, {"username": "Lynn Crane", "comment_text": "Montepertuso has an AirBNB that I looooove."}, {"username": "Kim Shea", "comment_text": "Anyone know this hotel ??"}, {"username": "Mary Elaine Hauser", "comment_text": "Got a nice place in Praiano for upcoming stay. Heard good bus transport from there"}, {"username": "Nadia Ali", "comment_text": "Try Praiano? It's between Positano and Amalfi 😊"}, {"username": "Lynn Macri", "comment_text": "Tropes in Calabria ! Same view but better beaches and less $"}, {"username": "Maria Cappucci", "comment_text": "Sorrento was our home base. We took day trips to Positano and Capri. Loved it. Also less crowed."}, {"username": "Nancy Ann Paolino", "comment_text": "Sorrento as your hub"}, {"username": "Coral Jones", "comment_text": "Try Praiano or Ravello. Praiano is right next door to Positano and much cheaper."}, {"username": "Ewa Olbrych-Rudzinska", "comment_text": "Any other place . The further the better"}, {"username": "Carrie Duffy VanderMolen", "comment_text": "We stayed in Vietri sul Mare and loved it. If we returned we would stay in Maiori or Minori or Atrani. You can get anywhere by ferry. Don't miss Ravello!"}, {"username": "Sam Jones", "comment_text": "We just stayed in a place just above Amalfi called Due Torri (2 towers), it was fantastic value and the staff there were amazing"}, {"username": "Tracy Nadel Heffez", "comment_text": "Priaino. Just came back!"}, {"username": "Heather Bonetti", "comment_text": "Capri, Ana Capri San Michele was beautiful. We were just there."}, {"username": "Janis Belkin Sowell", "comment_text": "Ravello"}, {"username": "Linda McNelis", "comment_text": "Following"}, {"username": "Liz Hill", "comment_text": "Use Sorrento as a base. There’s loads of buses to and from Positano throughout the day."}, {"username": "Victoria Marchetti", "comment_text": "Pianello just up the mountain. Stayed at a lovely air b n b with a pool. Bus ride or scooter right down to coast."}, {"username": "Aimeelee Tillett", "comment_text": "We love to stay in Praiano. Perfect home base to exploring Amalfi coast."}, {"username": "Candace Simas", "comment_text": "Hotel Pellegrino in Praiano. You will not regret it!!!! Small boutique family owned hotel. Hotel shuttles you free of charge wherever you need to go. 15 minutes from Positano. Food at the hotel is some of the best I’ve ever eaten. Immaculately clean. Hotel staff is beyond helpful."}, {"username": "Catalina Daniel", "comment_text": "We stayed at an airbnb & sorrento & day tripped it"}, {"username": "Anamaria Vancea", "comment_text": "Ravello"}, {"username": "Lori McKannan Rombold", "comment_text": "If you’re up from an adventure, Nocelle is a small village above positano. There are fabulous Airbnb’s and a bus ride takes you down (15 min ride) to Positano all day long. There are wonderful restaurants on the way and in the village, a small alimentare and amazing views!!! It’s the best of all worlds."}, {"username": "Shannon Goff Flanagan", "comment_text": "Try Villa Rosa in Positano. Good option if available. We only could get 1 night there."}, {"username": "Sierra Behrens Tibbetts", "comment_text": "Try VRBO/airbnb?"}, {"username": "Laura Cardinale", "comment_text": "Stay in Praiano!"}, {"username": "Lydia Brown", "comment_text": "Try Praiano mid coast"}, {"username": "Vicky Pierro Altamura", "comment_text": "I loved staying in Sorrento and taking day trips to Positano, Capri and Amalfi"}, {"username": "Pauline Dell'Oso", "comment_text": "Salerno"}, {"username": "Suzanne Mills", "comment_text": "Ravello"}, {"username": "LoriKerry Palmer", "comment_text": "If you are going to do the walk of the gods, we stayed in Agerola. So much less touristy!! We stayed at Costa Blu and it was fantastic! Great little restaurants nearby. Also stayed in Ravello 3 nights and loved it."}, {"username": "Catherine Avery", "comment_text": "Stay in Sorrento longer. We were there 7 nights and loved it!"}, {"username": "Anna Gambino", "comment_text": "Maiori, Minori. You don’t need to stay in Positano. You can do a day trip there."}, {"username": "Ken Feltham", "comment_text": "We are staying in Vico Equense, it is cheaper but looks lovely"}, {"username": "Yana Jarman", "comment_text": "Not sure of hotel prices but Ravello was glorious! I hope to stay there next time."}, {"username": "Michelle Lea", "comment_text": "Stay longer in Sorrento\n\nhttps://\nmaps.app.goo.gl/\nwQR8f5rRqg5WFtPL\n6\n\nStefano is awesome!"}, {"username": "Linda DeCarlo", "comment_text": "Maiori."}, {"username": "Marion Welsh", "comment_text": "Atrani"}, {"username": "Ivette Lugo", "comment_text": "you have to buy hotels at least 90 days, i got a good price, i look now and its 3 times more expensive"}, {"username": "Cathy Ruggiero", "comment_text": "Praiano!!"}, {"username": "Stewart Cameron", "comment_text": "Ravello"}, {"username": "Tanica Hesselgesser", "comment_text": "We liked Maiori/Minori. Not too touristy and had a beach!"}, {"username": "Tracey Turner", "comment_text": "Praiano . ❤️"}, {"username": "Wendy Farrell", "comment_text": "We stayed in Maiori and loved it. Caught the ferry down from Naples so saw all the other places-Positano\n, Amalfi etc from the water. Then caught a ferry to Salerno to catch our train back to Rome."}, {"username": "Khushi Khanna", "comment_text": "Check out Salerno."}, {"username": "Tracey Fairbrother", "comment_text": "Stay in Sorrento so much nicer than positano. Imo positano looks best from a boat"}, {"username": "Fonzy L Wass", "comment_text": "We stayed at the Cetus hotel in Cetera, loved it. No crowds, has its own private beach, a view from every room, great service and food too!"}, {"username": "निनावी सहभागी", "comment_text": "Thank you all for the advice. I really appreciate you all taking the time to reply ❤️"}, {"username": "Amber Gomes", "comment_text": "Praiano! 10x better in my opinion and a 5 minute water taxi ride to Positano"}, {"username": "Jules Blumke", "comment_text": "I thought Minori was very nice."}, {"username": "Philip Curnow", "comment_text": "Maiori or Vietri sul Mare. Stayed in both"}, {"username": "Lee-Anne Stewart", "comment_text": "Stay longer in Sorrento and take a day trip or two to Positano ?"}, {"username": "Rachael Lynn", "comment_text": "I plan on staying at Sorrento and going to Positano for day trips to their beach"}, {"username": "Chiara Normanno", "comment_text": "You can stay longer in Amalfi and take day trips to Positano"}, {"username": "Samina Jassani", "comment_text": "We are staying here next month."}, {"username": "Lisa Lord", "comment_text": "Stay longer in Sorrento and make a day trip to Positano. We stayed in Positano in 2018 and totally picked the wrong hotel. Although it was beautiful, Positano is all hills. From the front door of our room just to get to the street was 197 steps up! Be very careful where you stay if you book in Positano. Again, so beautiful, be sure to stay in the right area to get around easily."}, {"username": "Kim Hull", "comment_text": "Sorrento is so lovely, I'd stay there over Positano any day. I stayed at Sant'agnello which is a 5 minute train ride from Sorrento and much cheaper to stay at. This was my rooftop view for AU$97 a night.... You can get an elevator down to the harbour and a ferry straight to Capri island, then ferries going to Positano, Amalfi, Sorrento."}, {"username": "Shelby Symons", "comment_text": "Base yourself in Praiano and do day trips from there! We did that and the accom prices were a lot better and it wasn't as busy either"}, {"username": "Danielle Moritz", "comment_text": "We stayed in Praiano right off the bus stop and loved it! Easy to do day trips."}, {"username": "Theresa Sorrentino Pagan", "comment_text": "Stay in Amalfi"}, {"username": "Tricia Lanieri Forchetti", "comment_text": "We absolutely loved Hotel La Bussola in Amalfi"}, {"username": "Karyn Sternberger Sikorski", "comment_text": "Praiano is beautiful and not crowded. Most hotels have a view of the ocean. Easy to get everywhere from there"}, {"username": "Teresa Heran", "comment_text": "Amalfi, Praiano"}, {"username": "Elaine Jefford", "comment_text": "Minori is much cheaper and a great base for the whole Amalfi coast"}, {"username": "Jennifer Melka Maley", "comment_text": "Stay in Sorrento and day trip"}, {"username": "Susan Landers", "comment_text": "Maiori"}, {"username": "Susan Landers", "comment_text": "Or Minori"}, {"username": "Carmel Maisano", "comment_text": "Maori"}, {"username": "Joan Belserene Forcheski", "comment_text": "Hotel Villa Romana in Minori. Lovely clean & beautifully maintained hotel w/great bkfast included. Short walk to ferries & public buses. Not a mob scene of tourists. We’d definitely stay there again."}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Maiori https://\nwww.dpbolvw.net/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g194806-d2772\n00-Reviews-Regi\nnna_Palace_Hote\nl-Maiori_Amalfi\n_Coast_Province\n_of_Salerno_Cam\npania.html"}, {"username": "Maureen Buccelli", "comment_text": "We stayed right next door to Amalfi in Atrani. It’s literally 10-15 minutes. We stayed in Pallazo Ferraioli. Lovely 4 ⭐️ hotel. 75 steps to hotel but someone will help you with your luggage. Beautiful rooms. Fabulous included breakfast. Staff is so wonderful. There is a spa on property as well. I believe we paid $1600 US for 5 nights. Good luck!"}, {"username": "Angela Siragusa", "comment_text": "Stay in Amalfi or Sorrento and take the boat to/from Positano for the day/evening."}, {"username": "Barb Krieg-Stepien", "comment_text": "Just spent 4 days in Positano. It’s absolutely beautiful but very expensive. Day trip is all you need. Not a lot to do and a ton of stairs."}, {"username": "Kimberly MacKinnon Cherry", "comment_text": "Ravello is nice. Not sure if it's a lot cheaper though. You could also try Salerno"}, {"username": "Keri Catoe", "comment_text": "Salerno was much less expensive than anywhere else and there is a ferry that you can take to Positano. You can also stop in Amalfi. It also stops in Minori which was our favorite stop. I actually liked it more than Positano."}, {"username": "Jess Baloh Wuslich", "comment_text": "We enjoyed Praiano"}, {"username": "Angie Boutzis-Luis", "comment_text": "Currently in vietri. It’s perfect. Same appeal, less crowded. You can take the ferry and spend the day in any of the other spots, including amalfi and Positano."}, {"username": "Ally Dickerson", "comment_text": "No need to stay in Amalfi but it’s fine for a day trip, Sorrento is the only place I felt truly had a bit of culture left, Positano was disappointing aswell. Stay in Sorrento or Vietri or perhaps Pompei or a smaller village and focus on day trips. Sorrento is also the best connected city"}]}, {"id": "2207271306338614", "text": "Im looking at booking to go to Puglia. We will be flying into Brindisi. And possibly staying in 2 places over the week. Any recomendations, must sees, or places to avoid. We use public transport so want to be in good locations, looked at Monopoli, Ostuni, Polignano di Mare, Alberello. They all look beautiful!", "link": "facebook.com/groups/1373361046396315/permalink/2207271306338614/", "likes": 2, "comments": [{"username": "Sarah Luisa Hughes", "comment_text": "Any advice would be appreciated!"}, {"username": "Susan Cantafio", "comment_text": "Susan Cantafio"}, {"username": "Susan Cantafio", "comment_text": "We are heading there to second week of sept"}]}, {"id": "2207265749672503", "text": "Hey everyone!\nI’m coming to Italy at the end of the month and I have a few questions:\n1. Trains- Where do I book it? I travel with luggage and my hotels are booked so I’d rather book the trains in advance?\n2. I have 3 days in Florence area- do you recommend going to Cinque Terre even for one day? If not, what do you recommend to do?", "link": "facebook.com/groups/1373361046396315/permalink/2207265749672503/", "likes": 4, "comments": [{"username": "Marina Rosa Moni", "comment_text": "Trenitalia\nGo to cinque terre"}, {"username": "Alana Marie Sult", "comment_text": "Me personally I do not book a train until I get there. Flight delays and train strikes could set you back. I get through the airport and then get my train. I use the Omio app and have not had any issues. Unless you book a refundable ticket. I usually dont"}, {"username": "Renae Larcus", "comment_text": "CT is great but it deserves more than a day. See some of the towns of Tuscany while you are in Florence. Do a day trip. And there’s plenty to see in Florence!"}, {"username": "Deborah Schroeder", "comment_text": "If you want to travel a distance it is usually cheaper to book in advance but not necessary. I always go first or business class because of ease with luggage. I would not do CT because of the time involved and the crowds. Instead, you can train to Lucca and Pisa for a day, do a wine tour or a Tuscan town tour instead. Trust me, you will not be bored in Florence."}, {"username": "Anat Kriger", "comment_text": "Hadar Kriger"}, {"username": "Gabriele Fordini Sonni", "comment_text": "1. Always book from the Trenitalia website, don't buy from intermediares/\nthird parties (Trainline might be an exception). You can also download the Trenitalia app and buy/view your tickets there, which will be sent to any specified email once you buy them anyway. There's no need to print them.\nPrices go up once you start to approach the day departure. You might pay a 50€ ticket 120€. There's plenty of room for luggage.\nUse Google Maps and equivalents to do a preliminary plan of your route."}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Florence/\nCinque-Terre-Hik\ning-Day-Trip-fr\nom-Florence/\nd519-5070CINQUE?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}, {"username": "Kerry McMillen", "comment_text": "We used Omio for train tickets. Use it for buses also. Painless"}, {"username": "Lucrezia Folger", "comment_text": "3 days, explore where you are, Florence."}, {"username": "Rebecca Yeoh", "comment_text": "I just went to Florence in June. Book your high speed trains on the Trenitalia site. I went to CT for a day but I have to say it was a bit meh. It deserves more than a day so I didn’t experience it the way should be experienced. A day trip to Sienna, San Gimignano and lunch at a winery was one of the highlights of my trip."}, {"username": "Michelle Bergman Davis", "comment_text": "I used the TrainLine app for all of our reservations and it was so convenient and very easy."}, {"username": "Ibbu Mohd", "comment_text": "Use italo trains, directly from website. Private company, less to no strikes. Make sure to reserve seats."}]}, {"id": "2207265453005866", "text": "Ciao, Girl’s trip to Italy in October. This group has been incredibly helpful in our planning, Thank you! Our last leg is visiting Venice. We’re traveling by train into Venice, (Venezia San Lucia) station. Our hotel is the Hotel Carlton on the Grand Canal, in Santa Croce. I have three questions please:\n1) Does anyone know this hotel and/or area?आणखी I.e, Are they nice? Safe? Good Resturants?\n2) What’s the best way to travel back to our hotel from the San Marco area at night (9 or 10pm)?\n3) How best to travel to the Venice airport (VCE) from our hotel the morning we depart?\nWe would very much appreciate your experience. TIA", "link": "facebook.com/groups/1373361046396315/permalink/2207265453005866/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Venice/\nPrivate-Limousin\ne-Transfer-Veni\nce-Airport-to-V\nenice-City-Cent\ner-by-Car-and-W\nater-Taxi/\nd522-12418P1?pid\n=P00070587&mcid\n=42383&medium=l\nink&medium_vers\nion=selector"}]}, {"id": "2207261309672947", "text": "Recommendations for private driver transfers from Bellagio to Portofino?", "link": "facebook.com/groups/1373361046396315/permalink/2207261309672947/", "likes": 1, "comments": [{"username": "Rita Long", "comment_text": "Mena Forino Almalfi transfer"}, {"username": "Jose Velez", "comment_text": "Rent a car."}, {"username": "Lindsay Paige", "comment_text": "Are you going to Italy?"}, {"username": "Tiziana Martinello", "comment_text": "Blabla car an app to travel together with other people"}]}, {"id": "2207260699673008", "text": "How is the parking at Santa marguerita. We are driving from Lucca and then walking to portifino.", "link": "facebook.com/groups/1373361046396315/permalink/2207260699673008/", "likes": 0, "comments": []}, {"id": "2207255099673568", "text": "We will be in Lucca for two weeks in the beginning of September. We will have a car and will be exploring the Riveria. We will drive to LA Spezia and take the train to cinque terre. We would like to see porta fino. Is there parking in Santa marguerita. I know parking in porta fino itself is out", "link": "facebook.com/groups/1373361046396315/permalink/2207255099673568/", "likes": 0, "comments": [{"username": "Steph Craddock", "comment_text": "Yes there is plenty of parking in Santa Margherita, then you can walk or take ferry or bus to Portofino. Buses every 20mins. Ferry every hr"}]}, {"id": "2207237449675333", "text": "I’ve booked a lunch at Maestro’s at Villa Treville but is there anywhere else that’s comparable that you’d recommend with respect to the beautiful views? We are on the Amalfi Coast for 5 days so we are happy to venture a bit further out if needed. Thank you!!", "link": "facebook.com/groups/1373361046396315/permalink/2207237449675333/", "likes": 1, "comments": [{"username": "Carol Polichnowski", "comment_text": "Carol Polichnowski"}, {"username": "Elise Wall", "comment_text": "Eve Wall check this view"}, {"username": "Voula Ladas", "comment_text": "Wow what a great view !"}, {"username": "Emma-Jane Garbutt", "comment_text": "Is this a photo of Maestro’s?"}, {"username": "Emma Louise Leafe", "comment_text": "Also wondering the same"}, {"username": "Fiona Cameron", "comment_text": "Im sure the view is fabulous, but is the food any good? It will no doubt be very $$ because of the view, but is it worth it if the food is rubbish?? I comment because I too have made this mistake, at different venues with equally fabulous views. 😊"}, {"username": "Christine Broussard", "comment_text": "Where is this please?"}, {"username": "Anna Brooke Herrington Harris", "comment_text": "The top of the Eden Roc hotel in Positano has good views also. Could have a cocktail or food."}, {"username": "Karrie Doyle", "comment_text": "Amy"}, {"username": "Liva Klein", "comment_text": "Try restaurant La Tagliata. They have a shuffle bus and have to be booked in. Best experience I ever had in the restaurant. Although it was back in 2019. We paid 40 euros each and didn't know what's coming. Oh my, by 5th course none of us could physically eat. Leave alone the guy with guitar involving all the guests to sing popular Italian songs and do all sorts. Food in Positano was generally really nice. Spent a week in there back then"}]}, {"id": "2207236726342072", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2207236726342072/", "likes": 2, "comments": []}, {"id": "2207236243008787", "text": "I loved Assisi. A much needed break from the crowded streets of Venice and Florence. Also one of the locations where “just follow the smells, you can’t go wrong with dining” is actually not a trap. 😂\n\nI’d honestly go back and spend three days there. So serene.", "link": "facebook.com/groups/1373361046396315/permalink/2207236243008787/", "likes": 150, "comments": [{"username": "Jennifer Walp Rydholm", "comment_text": "The one place we won’t get to visit that I really wanted to see. Maybe next time."}, {"username": "Christine Malota- Kendall", "comment_text": "I LOVE Assisi!!! Assisi Carrie’s my soul."}, {"username": "Martha Jayne Frew Thompson", "comment_text": "Totally agree! Assisi was gorgeous and relaxing. We had the best night’s sleep there of any of the 14 we spent in Italy!"}, {"username": "Angela Cistolo Tomko", "comment_text": "Favorite city when we visited last October"}, {"username": "Toni Marie", "comment_text": "Very peaceful and st Francis was inspirational"}, {"username": "Gram Jane", "comment_text": "Loved it too"}, {"username": "Jenny RV", "comment_text": "Anybody able to recommend a nice and central hotel here?"}, {"username": "Barbara Bastianini", "comment_text": "I have spent several days in Assisi . If you go back to do that you’re in for a real treat!"}, {"username": "Toni Polito", "comment_text": "One of my favorites towns"}, {"username": "Chrystal Stevens Bisonet", "comment_text": "It’s such a breath of fresh air after Rome!!"}, {"username": "Melanie Baffes", "comment_text": "I've been to Assisi four times and just returned from a month there. So relaxing, peaceful, spiritual! I also found it to be a very welcoming community."}, {"username": "Bill Elias", "comment_text": "Stayed there twice. It’s peaceful. I love Umbria. I hope you didn’t miss St. Clare’s clothes on display."}, {"username": "Dr-Jon Warnecke", "comment_text": "Birthplace of my daughter. So much beauty and history."}, {"username": "Ken Lerch", "comment_text": "My first experience with Assisi was over 50 years ago, traveling alone. 'Got there with the train, not remembering how i got up the hill. Roamed the streets, felt the presence of Frances and Claire. Late in the day I began asking locals sitting in the piazzas for suggestions for a lone traveler for the night. I was taken to a house, introduced to an old lady who agreed to put me up for the night in a spare bedroom for a nominal cost. We ate her soup and drank her wine across her kitchen table. I woke early, watching the sun rise across the valley below. Coffee and toast, a handshake of gratitude, and I was on my way once again. Assisi is a magical place, the nights even more so than the days. It can't be rushed."}, {"username": "Julie Owens", "comment_text": "I agree and did. Then felt sad leaving there."}, {"username": "Gia Kaul", "comment_text": "Just came from Italy and we stopped in Assisi on a bus tour for a few hours. Definitely wish we had more time there."}, {"username": "Linda Chase", "comment_text": "Have been twice and hope to return. There is something about Assisi that calls you back."}, {"username": "Roland Trego", "comment_text": "That town in manicured!"}, {"username": "Barbara Tabor", "comment_text": "Interesting, I had read that Assisi was very crowded/\ntouristy. I did find some interesting wineries nearby. We are staying in Spello and Assisi is doable by bus."}, {"username": "Rhonda Daniels", "comment_text": "Wow! I expected so many more people!"}, {"username": "Andrea Bledsoe", "comment_text": "I've been interested in this small city. Sometimes quiet and quaint are the true vessels to a wonderful vacay experienced"}, {"username": "Patti Bauman Widener", "comment_text": "I loved Assisi. I hope I get to go again."}, {"username": "Pauline Newton", "comment_text": "Yes -so special."}, {"username": "Denise Eberhard", "comment_text": "We went to Arezzo and felt the same way. No crowds. Beautiful duomo and fantastic food. Enjoy Italy!"}, {"username": "Behindthelens Skeeter", "comment_text": "You would like Maiori as well then."}, {"username": "Debi McGrath", "comment_text": "It's on my list of places to see in Tuscany....it keeps growing."}, {"username": "Mackenzie Torres", "comment_text": "I stayed in Hotel Sole for two weeks! Great hotel and family owned and operated! Wonderful town!"}, {"username": "Mary Ellen Maatman", "comment_text": "We loved Assisi, too. But it wasn't \"serene\" on a July Sunday. There were hundreds of people there to see the Basilica and St. Francis' tomb. That said, it was the best behaved huge crowd I've ever seen--seriously\n. A continuous line of visitors, all awaiting their turns and processing in an orderly and respectful fashion. Many things in town were closed because it was Sunday, but it was still a good visit. And it's a stunning locale."}, {"username": "Nat RD", "comment_text": "Genevieve"}, {"username": "Dawn Falsinotti", "comment_text": "One of my favorite places."}, {"username": "Donna Hinton", "comment_text": "I agree Assisi was a welcome surprise, the beauty was amazing!"}, {"username": "Joan Morrison", "comment_text": "How do you get to Assisi from Florence without a rental car?? And how far is it?"}, {"username": "Caterina Liquori-Culhane", "comment_text": "We were then on our tour. Great pictures"}, {"username": "Stephen Fabus", "comment_text": "Oh Yeah"}, {"username": "Caterina Liquori-Culhane", "comment_text": "Where did you stay over night? Our hotel was not central\nWe weren't happy with the location"}, {"username": "Melanie Bucci", "comment_text": "I just got back from Italy and LOVED Assisi!!"}, {"username": "Patrick Aleta Wieneke", "comment_text": "One of our favorite places in Italy. It deserves much more than a stop on a bus tour, so go back if you have the chance. Wander the back streets and climb into the hills for spectacular views."}, {"username": "Linda Johnson", "comment_text": "Tx for the post I’ll be there soon"}]}, {"id": "2207235206342224", "text": "Anyone have restaurant recommnedations for vegans in Italy? We are starting in Venice, going to Modena and then working our way South to Almafi coast|Naples region. Thanks so much!", "link": "facebook.com/groups/1373361046396315/permalink/2207235206342224/", "likes": 0, "comments": [{"username": "Philip Curnow", "comment_text": "You won't be welcome in Modena. Is fish vegan?"}, {"username": "Jeanne Eliason", "comment_text": "It is going to be difficult. My son is a vegan. Try pasta with spicy sauce however make sure cheese is not on top. Most wines are not strictly vegan. Bread is often vegan. And no. Fish is not vegan."}, {"username": "Jeanne Eliason", "comment_text": "The Ultimate Guide to Vegan Italian Food. Just Google this. Not so difficult I guess. Having vegans in our family I am used to vegans cooking."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "In Italy there are some traditional dish naturally vegan: caponata, pasta al pomodoro, pasta aglio alio e peperoncino (you can safely ask these two pasta in almost every restaurant) schiacciata, panzanella, pappa al pomodoro, artichokes (carciofi) alla romana or alla giudia, fagioli all’uccelletto,\nminestrone, ribollita, pasta e fagioli.\nModena will be the hardest as the food there is very meat based.\nhttps://\nwww.gamberorosso\n.it/notizie/\nstorie/\ntutti-i-piatti-t\nradizionali-ita\nliani-che-sono-\nanche-vegani/"}]}, {"id": "2207235139675564", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2207235139675564/", "likes": 2, "comments": []}, {"id": "2207234943008917", "text": "Is there any train service to Montenerodomo? Or would the best way to get there be to rent a car?", "link": "facebook.com/groups/1373361046396315/permalink/2207234943008917/", "likes": 0, "comments": []}, {"id": "2207234559675622", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2207234559675622/", "likes": 5, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2207234536342291", "text": "Looking to book Micheal Angelo’s David when we come to Florence if I book a skip the line ticket to enter does this include David or is there another entrance fee just to see the statue there seems to be so many options", "link": "facebook.com/groups/1373361046396315/permalink/2207234536342291/", "likes": 5, "comments": [{"username": "Shirley Lewis", "comment_text": "if you book the Academia you see David ... there might be options to book Academia, Uffizi, Pitti Palace together if you're iterested"}, {"username": "Marina Rosa Moni", "comment_text": "Accademia has the david that's it\nYou go there you see it, one ticket"}, {"username": "Stacey Esposito", "comment_text": "You book the academia and you see David. There is no much interesting art there too in addition to the David. There are actually i think 5 Davids spread throughout Rome. You can google it as I don't remember exactly where we saw them."}, {"username": "Marjie De Villa Lorica", "comment_text": "Have just booked our Accademia Gallery admission tickets for this September (16 euro/person).\n\nIf you go to the Accademia Gallery website, you are given two options: a) just tickets to self-guided tour of gallery; b) tickets plus some add-ons\nhttps://\nwww.accademia.or\ng/buy-tickets/\n\nFor Tuesday and Thursday---the Museum is open until 20:00-20:15 (8:00 pm-8:15 pm)."}, {"username": "Gillian O'Callaghan", "comment_text": "Book an Academia timed entry. You may still have to queue. It's not a huge gallery and David is basically first. There's lots of unfinished works which I found interesting."}, {"username": "Sue Levy Avinir", "comment_text": "Book directly with the Accademia site. I recommend first thing in the morning and you will be the only one there. Download Rick Steves Audioguide italy to your phone and he will walk you through step by step. Lots to see there including musical instrument history. Definitely book direct. We did the 8:30am. Well worth it."}, {"username": "Catalina Daniel", "comment_text": "Nope. All included w admission"}]}, {"id": "2207234463008965", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2207234463008965/", "likes": 1, "comments": []}, {"id": "2207234199675658", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2207234199675658/", "likes": 0, "comments": []}, {"id": "2207233713009040", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2207233713009040/", "likes": 5, "comments": []}, {"id": "2207229586342786", "text": "Have been following posts for about 6 weeks now. Thanks to all for good info!!Question: We are staying at the Rome Times Hotel for a few days in October. Does anyone know this hotel? Tips? Especially interested in restaurants in the area. Would love to be able to walk to dinner. My hubby is a beer drinker, which Pilsner type of beer, would you recommend?", "link": "facebook.com/groups/1373361046396315/permalink/2207229586342786/", "likes": 0, "comments": [{"username": "Philip Curnow", "comment_text": "Just ask for one. There aren't many options in Rome. \"un pilsner grande, grazie\""}, {"username": "Carmine Castiglia Jr", "comment_text": "Peroni, of course!\n\nhttps://\nperoni.it/"}, {"username": "Pat Packard", "comment_text": "Thanks for the info. We will check it out!"}]}, {"id": "2207227716342973", "text": "Pls suggest any good restaurants and things to do in Positano", "link": "facebook.com/groups/1373361046396315/permalink/2207227716342973/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Positano/\nCapri-Boat-Tour-\nfor-Small-Group\ns-from-Positano\n/\nd33602-136733P9?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}, {"username": "Alexa Johnson", "comment_text": "There was a restaurant in the hotel Savoia that we absolutely LOVED. It was on the pricier side but had really good seafood risotto.\n\nChez Black is a super famous place. I found the food to be ok, decor/\natmosphere is what you are paying for there.\n\nThere are so many gelato places and pizza places that we ate at without even planning - just walked by it and asked for a table.\n\nThere’s a small restaurant that’s a bus ride away that have rave reviews, I want to say it has Trattoria in the name. We didn’t do it but have heard excellent recommendations\n.\n\nNo matter what you’ll have so much fun!"}]}, {"id": "2207226863009725", "text": "Hi has anyone ever booked a tour thru CIT Tours specifically ones from Florence and Tuscany packages?We are doing a five night Splendours Florence and Tuscany package with them in September. Would appreciate hearing any reviews or opinions", "link": "facebook.com/groups/1373361046396315/permalink/2207226863009725/", "likes": 0, "comments": []}, {"id": "2207130239686054", "text": "Bonjour\nQue me recommandez vous comme jolie itineraire de visite dans le centre de Gênes merci d avance pour vos réponses", "link": "facebook.com/groups/1373361046396315/permalink/2207130239686054/", "likes": 0, "comments": []}, {"id": "2207179083014503", "text": "Hello\n\nIf anyone has a moment, could you have a look at this (long trip) itinerary and provide feedback on whether you feel this is doable, and/or if there are places/attractions that would be better? The trip is through September, October and November. Thank you in advance! 😊", "link": "facebook.com/groups/1373361046396315/permalink/2207179083014503/", "likes": 154, "comments": [{"username": "Gabriela Sylvester", "comment_text": "I’d go to Sirmione one of the Verona days as it’s driving distance"}, {"username": "Kristen Taylor", "comment_text": "TAKE ME WITH YOU!!! SOINDS DIVINE!"}, {"username": "Teri Hansen", "comment_text": "While in Interlaken, take the local train to the Jungfrau (purchase in advance). It’s a beautiful trek up the canyon through Lauterbrunnen & Wengen."}, {"username": "Jen Alexitch Rachow", "comment_text": "That looks FABULOUS!"}, {"username": "Jamie Sova Mulder", "comment_text": "The Island of Capri is beautiful if you can do this while in Naples."}, {"username": "Charissa DelVecchio", "comment_text": "You don’t need 4 days in Venice for sure"}, {"username": "Charleen Siegler Schuss", "comment_text": "Looks great. Too much time in Venice. Turn your car in and re rent another in Venice. You will pay more for parking than lodging. Think about getting rid of the car in big cities. Have a blast"}, {"username": "Mishaela Nobbs", "comment_text": "Highly recommend staying in sorrento verses Naples. We enjoyed it way more and it’s easy to do day trips to the surrounding areas"}, {"username": "Michelle Risser", "comment_text": "I love that you included Perugia ❤️ lovely hill town"}, {"username": "Deborah Ceccato", "comment_text": "Itinerary ideas Rochelle Ceccato"}, {"username": "Suzy Fanucci Schmidt", "comment_text": "Naples—-The Veiled Christ…don’t miss it!! buy tickets ahead if time online"}, {"username": "Elizabeth Bernal Bain", "comment_text": "That is an EPIC vacation"}, {"username": "Miyuki Kanno Paul", "comment_text": "Scratch Lancellotti castle and replace with Reggia di Caserta"}, {"username": "Nicole Sadeghi", "comment_text": "Following"}, {"username": "Gina Schatz Chamberlain", "comment_text": "Don’t miss Assisi (close to Spello), stay in Sorrento not Naples, Central Market in Florence - underwhelming to me, Florence, wish I had done only 3 days tops, Florence - Ponte Vecchio and Statue of David?, consider some cooking classes (Walks of Italy) as they were highlights of our trip, Rome - just wander and be present - you will discover little gems around every corner, Rome - Campo de Fiori (loved), have coffee in Piazza Navona, go to major attractions (Trevi and Spanish Steps) early."}, {"username": "Cindy Drover-Davidson", "comment_text": "OMG, this sounds AMAZING!!!!! You will have an absolute blast!"}, {"username": "Kelly Mcgrattan", "comment_text": "Graham Martin"}, {"username": "Karen Tozza-Mozza", "comment_text": "I wouldn’t stay 5 nights in Naples. We did 3 & it was the least favourite city on our trip x it’s"}, {"username": "Brenda Petruzzi", "comment_text": "So happy for you, hopefully we will be able to do some of these wonderful towns🙏🏻❤️"}, {"username": "Gaëlle Wild", "comment_text": "Following 🍕♥️"}, {"username": "Gabby Miller", "comment_text": "Ian Schuster"}, {"username": "Rose Turdo", "comment_text": "Yes, and then some."}, {"username": "Nicole Alexander Taule", "comment_text": "Ummm…can I come with you?? 🙋🏼‍♀️"}, {"username": "Marie Sciocchetti", "comment_text": "If you’ve never been, you should definitely see the Vatican and Sistine chapel in Rome. The castle in Naples is temporarily closed. Instead, I suggest you do Pompeii, Mount Vesuvius Sorrento, Capri and Amalfi coast. In Venice, unless you’re really interested in watching the glass blowing, I would skip it and explore other parts of Venice. But do Burano. In Florence, I suggest the Accademia Gallery which has Michelangelo’s statue of David as well as other sculptures and paintings.\nYou’ll want to check schedules for days open to sites you decide on and some may require you to purchase tickets ahead of time."}, {"username": "Claudia Van Oostrum", "comment_text": "If you can and have not already been there, add Vaticancity (min 2days) to your list, whilst in Rome area. Even when you’re not religious it is impressive to see. See Rome in a quick an different way; take a bycicle tour from Bici e Baci.\nPuglia: stay as long as you can. Very relaxed region of Italy and very beautiful. We are on a 35-days trip through Italy (north-south- and now back north again) with our 2 kids and we absolutely loved Puglia. We stayed 1 week in a Trulli in Locorotondo and did day trips from there. Loved Matera! Would stay 1,5 day and 1 night. Visit Alberobello max 3 hours. Too busy too hectic. Sooo many nice Trulli to stay at in Valle d’Itria regio🥰. Visit Ostuni and Cisternino. A tour through grotte de Castellano is highly interesting. Enjoy!!!"}, {"username": "Joanne Bordignon", "comment_text": "Make sure you see Naples museum for body casts as they are not in Pompeii"}, {"username": "Jymie Sam Totiel", "comment_text": "Mark Totiel"}, {"username": "Elena D'angelo", "comment_text": "Yes to Naples\nAs it is not the hotter season it will be beautiful"}, {"username": "Howard Bernstein", "comment_text": "Skip Naples and stay in Sorrento or Positano for the Amalfi coast and Capri."}, {"username": "Renee Swart", "comment_text": "Anonymous participant, please post your final itinerary once you've made your changes. Would love to see it and do give feed back after your trip. Sounds amazing."}, {"username": "Chiara Bettaglio", "comment_text": "Seems a bit tight to stay in Verona and visit Parma Modena and Bologna, wouldn't it be better to stay in the area, like in Modena and explore there?"}, {"username": "Lynn Giantomaso", "comment_text": "If you’re going to Perugia . Assisi is nearby and it’s unique"}, {"username": "Maria Van Gerven", "comment_text": "Bernie Van Gerven"}, {"username": "Amy Carroll-Saravana", "comment_text": "April Sangalang Richard"}, {"username": "LC Willis", "comment_text": "More time in matera less in alberobello\nDo the stay and explore in matera and just a drive by and stop for a couple of hours in alberobello\nSwitch their timing around"}, {"username": "Deborah Larsen", "comment_text": "Monteriggioni is closer to Siena than Volterra."}, {"username": "निनावी सहभागी", "comment_text": "Meg Kerr Appleton"}, {"username": "Layla Maryam Razavi", "comment_text": "This is so much and the route is unexpected, I did each of these as separate three week trips on their own, maybe it’s because your trip is long it seems tiring no? For me I stayed in Rome as a home base then did a lot of the shorter trips as excursions for a couple nights via train. Also in Tuscany seven days is good but why stay in volterra? Lucca is far more picturesque"}, {"username": "Gelinda De Grandi", "comment_text": "Instead of Modena or Parma, visit Borghetto, lazise, torri del Benaco, peschiera del garda"}, {"username": "Jenna Murdhen", "comment_text": "Ashveer Bansy"}, {"username": "Carmel Napolitano-mancarella", "comment_text": "Great amount of time in each place!! That's what we do, Naples 5 days perfect! Try going to Amalfi coast for a day trip, very easy from Naples port, catch a ferry or train to Sorrento, I like the ferry if not next time, love your itinerary!"}, {"username": "Monika Vicanova", "comment_text": "You want to go south to north and in 45 days in Italy trying to see it all, hope you like travelling all the time, it is just too much for me to even read. 7 days in Volterra and every day other city. I would stay in Siena and explore tuscany from there. Forget Cinque terre, horribly full of tourist, you will have the same just warmer in Amalfi. You have excluded Rome, have u been before? U havent been to Italy if u havent seen Rome. In Umbria would add Assisi for sure and Orvieto."}, {"username": "Morgan Dragicevich", "comment_text": "Leigh Brown"}, {"username": "Catherine Campbell", "comment_text": "Naples\n1. The archeological museum (where all the finds from Pompeii are kept) not open on a Monday\n2. Funicular railway to take in the view from St Elmo across to Capri and Vesuvius\n3. The veiled Christ in San Sanservero chapel (jaw dropping)\n4. There is a Banksy painting somewhere\n5 Herculaneum\n\nWhy do pizza making when you will be surrounded by so much history?"}, {"username": "Erika Reyes Aguilar", "comment_text": "Amazing itinerary!! While in Volterra and San Gimignano you must check out Montepulciano great wine tasting and also Twilight (New Moon) location ❤️"}, {"username": "Sasha Melia", "comment_text": "I would be adding a lot more to see in Rome! Definitely adding Domus Aurea, Palatine Hill, Castel Sant’Angelo as a minimum."}, {"username": "Sky Gander", "comment_text": "Isle of capris?"}, {"username": "Cheryl Fox", "comment_text": "Sounds amazing! Have a lovely trip 🇮🇹"}, {"username": "Betty Stilt", "comment_text": "After Italy, Dubai will be a disappointment."}, {"username": "Yvette McMurtrie", "comment_text": "Wow, looks fabulous. Wish I had the time! One day"}, {"username": "Liz Stahler", "comment_text": "We go to Italy every year and one of our favorite things to do is go on a truffle hunt with the dogs. The best places are in San Miniato and the Piedmonte areas. Just look on Google as there are many listed. And then have a truffle lunch! Have a great trip!"}, {"username": "Darci Owen DiGiorgio", "comment_text": "I would personally stay in Sorrento over Naples. Sorrento is beautiful. Naples was the only city I felt unsafe in. It also was the filthiest. People who Naples do not come at me. This is just my opinion. We only used Naples as transportation (the train and ferry)"}, {"username": "Kristy Hanks Strickland", "comment_text": "I like it all but think you could combine some 3 day stays, that is A-LOT of moving. No on Naples stay in Sorrento and go to Naples for a day for Pompeii. Explore Capri, Amalfi and Sorrento instead."}, {"username": "Rebecca Curran", "comment_text": "If you’re staying in Naples you have to make time for the amalfi coast, not far at all from there and so stunning!"}, {"username": "Lindsey Martin", "comment_text": "Florence you could do in a day if you're up early enough"}, {"username": "Sharon Jones", "comment_text": "I think doable. Definitely would not stop at Pisa. I’m almost 70 and able to do. You can rest up when you return home. Or get old."}, {"username": "Alina Dröge", "comment_text": "Beatrix Dröge"}, {"username": "Ryan Katherine Sisco", "comment_text": "I would do Amalfi Coast instead of Naples. Maybe just a day trip to Naples. Pompeii and Herculanum worth it as well. More time in Southern Tuscany. I prefer the smaller towns to the more well known ones - Pienza, Montepulviano..\n."}, {"username": "Sara Punis", "comment_text": "Definetly more days for Rome!"}, {"username": "Kate Crangle", "comment_text": "I don’t know anything about Castelaraceno as far as a place to go - but you are back tracking a lot and I would prob recommend doing it on the way to or back from Matera and Alberbello. Those two towns are only about an hour so you’re doing a lot of backtracking to go back and forth by putting it between the two.\n\nDo you happen to have any mobility issues? Alberobello and especially Matera have so many slick stone stairs. I’m nimble and I slid a few times!\n\nWe just returned from Puglia region and can give you tips if you’re looking for other fun towns that are easier to maneuver!"}, {"username": "Megan Leigh", "comment_text": "Wow! Incredible. While in Umbria, check out Risiglia. Thank me later. ;)"}, {"username": "Lisa Adams Robertson", "comment_text": "If you have extra time in Naples, you can do a day trip to the Royal Palace of Caserta. In Naples, don't miss the Archeological Museum and the Sansevero Chapel!"}, {"username": "Trish Mclaughlin Sharet", "comment_text": "You need more days in Perugia. Drive to Assisi, Deruta for ceramics. Also if you have time go to Gubbio and Urbino. So,so much to see in Italy."}, {"username": "Amy Beth", "comment_text": "I love that you’re doing Volterra and the great surrounding towns. If you have time, check out Colle do Val d’Elsa (the older section) very quaint"}, {"username": "Kelly Rae Snider", "comment_text": "I believe Lancillotti Castle is currently closed"}, {"username": "Melanie Sumner", "comment_text": "Take ferry from Naples to sorrento for a day or afternoon"}, {"username": "D Rochelle Milton", "comment_text": "Alrighty then I’m packed and ready, let’s dip! Btw amazing itinerary 😍💯!!"}, {"username": "Chiara Codecá", "comment_text": "When you stop in Spello add a visit to Assisi. It's literally 10 km, it's a 15 minutes ride from one to the other, and Assisi truly deserves a visit."}, {"username": "Susana Stubbs", "comment_text": "Amazing itinerary! I’d add a pit stop in Pisa and definitely a day in Cinque Terre as you’re close to both whilst in Florence. Personally I think 5 days in Naples is way too long. I’m happy to leave after a day 😉 but as you’re visiting Pompei during those 5 days, I’d say 2 days would be enough. I would spend the other 3 days on the Amalfi coast instead. Enjoy your journey!"}, {"username": "Caroleen Naidoo", "comment_text": "I am looking at going from Venice- lake garda - tirano - St Moritz ( bernina express)- Zermatt (via glacier express )"}, {"username": "Bev Symes", "comment_text": "Fabulous trip. I d take some of the advice around Naples."}, {"username": "Rachel Cielens", "comment_text": "Wow! What an amazing trip you have planned. When in Naples I highly suggest you also see Herculaneum. It is much better preserved than Pompeii but a lot smaller (half a day would suffice) but so interesting. Super quick train ride from Naples."}, {"username": "Tash Ritchard", "comment_text": "I have travelled Italy on 3 different occasions and I have just gone to Bologna and absolutely loved it. It is now a favourite and I wish I had more time there so would recommend spending time there. It’s also a good hub for a day trip via train to both Verona and Florence. Many food tours also depart from there to go into Modena etc as they are neighbouring each other.\nJust left Genoa last week and recommend staying on the coast at Santa Margherita where you can catch a ferry to Rafallo, Portofino, San Fruttuoso etc and it is a pretty resort town itself.. from there you can catch the train which is super accessible to both Genoa (40m) and to the towns of the Cinque Terre."}, {"username": "Craig Spicer", "comment_text": "Well covered. Since you have 5 days in Verona a little detour to Cortina. Consider this. You will no be disappointed"}, {"username": "Tina Tiziano Dreher", "comment_text": "Amazing! Enjoy!"}, {"username": "Martin Sten Elkjær", "comment_text": "Great list! Volterra 7 days: Driving to Lucca from Volterra is almost 2 hours. Also I would consider adding a wine tour in Montalcino / Montepulciano when staying in Volterra. The landscape is beautiful."}, {"username": "Leone Karzon", "comment_text": "Looks like an amazing itinerary, not rushed. I'm looking at around that time next year so I'm trying to pick up as many tips as I can"}, {"username": "Paula Rosati", "comment_text": "https://\nwww.museosanseve\nro.it/en\n\nMust see in Napoli"}, {"username": "Tracy Nealy", "comment_text": "Wow! What a great itinerary!! Im envious of all your time you will be in Italy. We are going for 26 days but there is so much ti see. Have a wonderful trip."}, {"username": "Angelita Reyes Lara", "comment_text": "Pisa is 1 hour from Lucca, must visit."}, {"username": "Bebe Campbell", "comment_text": "No Rome????"}, {"username": "Carmela Siniscalchi Frattellone", "comment_text": "Your Naples itinerary says Lancellotti castle. Is that in the city of Naples? Just wondering because I’m my Mom’s town which is 45 minutes outside of Naples there is a castle with the same name"}, {"username": "Meredith Holloway Helbon", "comment_text": "Following"}, {"username": "MUTO AKIKO", "comment_text": "For by"}, {"username": "Marina Bohrer", "comment_text": "Adopt me please. ❤️"}, {"username": "Vicki Layfield", "comment_text": "I would scrub Naples stay in Sorrento from there you can go to capri and Amalfi coast it’s absolutely stunning not to be missed"}, {"username": "Andrea Farkas", "comment_text": "You can visit Assisi next to Perugia also"}, {"username": "Lori Charlene", "comment_text": "Wow, no advice but have the most wonderful trip!"}, {"username": "Kathy Dowdell", "comment_text": "Amazing!"}, {"username": "Janie Osborn Wiltshire", "comment_text": "Siena?"}, {"username": "Dana Golden", "comment_text": "I’m jealous"}, {"username": "Chris Tina", "comment_text": "Good for you!"}, {"username": "David Morris", "comment_text": "If you have 5 days in Naples go to Amalfi preferably by boat. You can see Sorrento, Postiano and Ravello etc."}, {"username": "Donna Hinton", "comment_text": "Wow! Zermatt is amazing too! Try to go up to Matterhorn if the sky is clear. I’d try to see Capri and Positano too. Looks like a great time!!"}, {"username": "Teresa Heran", "comment_text": "Looks good to me. Looks like a great itinerary"}, {"username": "David Morris", "comment_text": "When you are in Venice try Lorenzo at www.venicecooki\nngschool.it"}, {"username": "Noralis Rodríguez Coss", "comment_text": "As someone mentioned, if you have not been to the Amalfi coast, or any of the islands close to Naples like Capri, Ischia, then you might want to go there. Another option is a trip to Sorrento by train or ferry."}, {"username": "Linda Petursdottir Simonsen", "comment_text": "Would go to Lake Garda when you are in Verona area. The small city Sirmione is amazing and Bardolino is close to Valpolicella winefarms"}, {"username": "Nicole D'Emic", "comment_text": "Definitely recommend ischia we loved visiting there!"}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "Looks splendid!"}, {"username": "Emily LeaTh", "comment_text": "Jealous! I’m going to have to wait until I retire for such an epic holiday!"}, {"username": "Farrah Sweetiepie", "comment_text": "WWWWOOOOWWWW!!!\nLucky!\nWhat an amazing itinerary!!!! Can I come with you 🙏🏼 , especially the cruise to Dubai…lol 😂 I’ll give you a back massage…🤣\nHave a terrific time!"}, {"username": "Anna Stępińska", "comment_text": "I would reccomend save more than 2h for Siena, unless you only want to mark as „checked” this city on your list. Its really beautiful, worth to „get lost” there and drink wine on Piazza del Campo 😉"}, {"username": "Kathleen Roll", "comment_text": "What are you trying to do to us ?? 😂 not jealous at all 😊\nJust to say - book where you need to go in advance.\nEnjoy!!!"}, {"username": "Emily King", "comment_text": "Ostuni is worth a trip as well as all the above mentioned."}, {"username": "Deidre Nicole Williams", "comment_text": "I would skip day trip to Bern and Lucerne and spend all my time in jungfrau. Go to lauterbrunnen and wengen . So much to see and do here ! Also in Zermatt I liked the glacier palace experience WAY more then Gorgengrat . If you can’t do both !"}, {"username": "Caterina Liquori-Culhane", "comment_text": "Have you been to venice that is a must. Skip naples and go to the almafi coast. Stay In Sorrento go by boat to capri"}, {"username": "Teresa Vozza", "comment_text": "While in the area of Genoa I would also add the Cinque Terre, easily accessible by train and beautiful!! IMO way more to see and do than in Genoa."}, {"username": "BC BCerra", "comment_text": "Amazing itinerary. Where and when are you gonna wash clothes?"}, {"username": "Gayle Moores", "comment_text": "I would include Siena. It is an interesting and beautiful medieval town. You could either take a day tour or go on your own when you are in Florence! On your own it is only an hour by train from the Santa Maria Novella train station. You could also drive there from Volterra when you are there or include it on the day you are in San Gimignano.From San Gimignano it is very close. From Volterra 1 hour."}, {"username": "Kelsey Larabie", "comment_text": "Looks relaxed and amazing"}]}, {"id": "2207117513020660", "text": "Is swisscare’s health insurance good to use in Italy? I want to buy it just for a month before I get to Italy because I need it for Visa process.\nThe price is reasonable enough. But I am afraid that it wouldn’tआणखी be a wise option. How do you guys think? If you know something more reasonable and reliable, please let me know. Thank you💖", "link": "facebook.com/groups/1373361046396315/permalink/2207117513020660/", "likes": 0, "comments": []}, {"id": "2207081676357577", "text": "Have a night tour booked late in November at the Colosseum, we are staying at Hotel Artimede. Is it safe enough to walk to the tour (7pm) and walk home after? (10pm approx) thanks 😊", "link": "facebook.com/groups/1373361046396315/permalink/2207081676357577/", "likes": 5, "comments": [{"username": "Philip Curnow", "comment_text": "With both the Quirinale and Questura of Rome just behind you, that's a lot of cameras and security in the zone. Nice wide roads as well. So yes."}, {"username": "Niki Sewell", "comment_text": "Yes. We stayed at Artimede a few years ago and walked a lot at night."}, {"username": "Jakki Maree Triffitt", "comment_text": "Can I ask who you booked the night tour through?"}, {"username": "Jenny Payne", "comment_text": "I did a night tour last October & it was great , how’s was at 9:15pm and we walked both ways🌻"}]}, {"id": "2207004849698593", "text": "Hello. Can anyone recommend some good half day boat tours from Ischia which explore the island and allow for swimming in the sea. Thanks in advance xx", "link": "facebook.com/groups/1373361046396315/permalink/2207004849698593/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/\nIsola-dIschia/\nExcursion-by-boa\nt-with-lunch-on\n-board-to-disco\nver-Ischia/\nd50507-338529P1?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}, {"username": "Steve Partridge", "comment_text": "There are plenty advertised around the various ports (Ischia Port, Forio) that can be booked in the day, or book in your hotel. Captain Morgan I think is one."}]}, {"id": "2206718429727235", "text": "What are you allowed to wear in the Churches in Italy ???", "link": "facebook.com/groups/1373361046396315/permalink/2206718429727235/", "likes": 5, "comments": [{"username": "Marcus Hiesler", "comment_text": "Ladies should have their knees and shoulders covered."}, {"username": "Melissa Reyes", "comment_text": "Your shoulders and knees must be covered. No hats on."}, {"username": "Greg Fetro", "comment_text": "Allowed 😄"}, {"username": "Alla Zats", "comment_text": "No shorts, no short dresses, no tank tops, no ripped jeans. Modest below knee attire with covered shoulders for ladies. For men no shorts, wifebeaters, baseball hats on inside. Vatican has dress code on the website for all further inquiries."}, {"username": "Christine Ann", "comment_text": "Covered knees and shoulders, nothing inappropriate"}, {"username": "Gil Rodriguez", "comment_text": "Ear plugs"}, {"username": "Debra Fabrico", "comment_text": "Been there three times and my sun dresses did not cover my knees. No one ever said a word. I also saw plenty of men in shorts. I did however cover my shoulders."}, {"username": "Monica Jo", "comment_text": "Allowed****"}, {"username": "S.P. Espy", "comment_text": "I think you’re asking, “What are you allowed to wear in the Churches in Italy?”. If so, when in doubt, cover knees and shoulders. You may see other people that do not, but they are not following the best practice, and they may cause offense, especially to more traditional folks of which there are still several."}, {"username": "Diane Janovas", "comment_text": "Knees, shoulders,abdom\nen and back need to be covered. Tee shirt and long shorts, tee shirt dress. Tee shirt and skirt ."}, {"username": "Rebecca Ritter", "comment_text": "carry a pareo wrap with you so you can cover your shoulders or make a long skirt."}, {"username": "Ian Beyer", "comment_text": "Don’t wear anything loud."}, {"username": "Marco Brambilla", "comment_text": "You can wear the pope hat if he allows you to borrow it."}, {"username": "Zucchero Candito Kandinsky", "comment_text": "Think about what to wear for a Sunday lunch at a very conservative old relative. That"}, {"username": "Toula Vasileiou Evageliadou", "comment_text": "In Vatican they gave a piece of textile ( big scarf) to cover your shoulders and knees for free . That’s ok .\nBut in Vasilique of Saint Marcus in Venice , they propose you to buy from the street vendors in front of the church. If you don’t, they don’t allow you to get in ."}, {"username": "Phyllis Snyder", "comment_text": "They ask to cover shoulders , knees and cleavage. And best not to wear flip flops shoes."}, {"username": "Rachel Castleberry", "comment_text": "Out of religious respect, cover shoulders and knees.\nOfficials may or may not allow someone to come in that doesn’t comply with this request. The Vatican is more strict when it comes to complying with this."}, {"username": "Jen Belsito", "comment_text": "It’s out of respect for the culture… cover your knees and shoulders."}, {"username": "Courtney Rey", "comment_text": "I had to buy a drape at the duomo because my knees and shoulders were exposed"}, {"username": "Yolanda Arena", "comment_text": "This is very acceptable and very common in most churches in Italy, however places like the Vatican requirement is strict, wear a dress that covers your knees, capris and a short sleeve shirt or a pashmina."}, {"username": "Avion Infra", "comment_text": "Allowed"}, {"username": "Michaela Hlaváčková", "comment_text": "You can t have naked shoulders and IT s better don t wear too short skirt"}, {"username": "Antonio Aloè", "comment_text": "WTF just ensure you have your panties on...🤣"}, {"username": "Antonio Aloè", "comment_text": "Italy or Iran?🤣"}]}, {"id": "2206952969703781", "text": "We are hoping to visit Ischea next May. I know there are ferries to get there. Unfortunately, it will be a day trip. It looks amazing. What is the best way to get around once we arrive? Buses? Taxis? Driver?\nAre there hot springs open to the public? Do you have recommendations please? Do they have change rooms? Thank you! Any information you can share is appreciated. I can’t find as much information as other locations.", "link": "facebook.com/groups/1373361046396315/permalink/2206952969703781/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/\nIsola-dIschia/\nExcursion-by-boa\nt-with-lunch-on\n-board-to-disco\nver-Ischia/\nd50507-338529P1?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}]}, {"id": "2206887363043675", "text": "Good morning everyone. Does anyone know where professional boxers train at in Milan ? I would like to visit these gyms. Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2206887363043675/", "likes": 0, "comments": []}, {"id": "2206817159717362", "text": "TOPIC: SHARING INFORMATION\nThis is a HUGE group - more than 515,000 as I write this. To you and me that's at least 514,950 total strangers. Regardless of how diligent the admins are with screening admissions, any group this size will have spammers, scammers, data miners and stalkers, just as the general population does. Be careful about sharingआणखी exact travel dates and other detailed information prior to travel. You are advertising that your home will likely be vacant during that time. If I can find your current address online in five minutes, a cyber-criminal can too (and more). The same goes for women saying they will be traveling solo, giving specifics on dates and cities. If you wouldn't take out an ad with every major newspaper in the world with the same information, think twice about posting it here.", "link": "facebook.com/groups/1373361046396315/permalink/2206817159717362/", "likes": 4, "comments": [{"username": "Leila Jane", "comment_text": "Absolutely good point, well taken. Thank you for the reminder. It's so easy to sit in a chair at home and forget how many people can see what we write!"}, {"username": "Claudette Evans Willis", "comment_text": "I wanted to comment on your train post but it won't allow comments... how much was the first class trip from Paris to Milan? We are going to Paris for a month and this sounds great"}]}, {"id": "2206882893044122", "text": "I am thinking about booking Hotel Alessandra in Florence. Has anyone stayed in the annex suite ? If so, how was it ? Also, I saw the website for the hotel says there are 30 steps to navigate to the lift. What is the stair situation for the annex ? Thanks !", "link": "facebook.com/groups/1373361046396315/permalink/2206882893044122/", "likes": 0, "comments": [{"username": "Jeanne Eliason", "comment_text": "Not to be partial however look up Hotel David in Florence. They have an elevator and just a gorgeous small hotel. If you are walkers the Ponte Vechio is a short walk. Many great restaurants nearby that locals eat at. Plus the breakfast is great. Happy hour is fun too. One can meet so many interesting travelers."}]}, {"id": "2206866686379076", "text": "We are booked for 3 days in Venice and 4 in Florence. What are some suggestions for 3 days in between? Thanks for your help!", "link": "facebook.com/groups/1373361046396315/permalink/2206866686379076/", "likes": 7, "comments": [{"username": "Kelly Aynes Zingaro", "comment_text": "Out in wine country, the hills of Tuscany are beautiful!!!"}, {"username": "Diana Smith", "comment_text": "Visit Lake Garda, Verona, Milan…:)"}, {"username": "Laura DeCicco", "comment_text": "Bologna!"}, {"username": "Raymond Capkin", "comment_text": "Verona Verona and Verona"}, {"username": "Michael Wilkinson McLaughlin", "comment_text": "Verona!"}, {"username": "Colleen Jennings", "comment_text": "Bologna!"}, {"username": "Lorene Vallish Phelps", "comment_text": "Rome"}, {"username": "Gina Rovello Keenan", "comment_text": "Bologna! Day trip to Ravenna, Parma, Modena, Ferrara."}, {"username": "Lori Wroblewski", "comment_text": "Verona is gorgeous and their markets are a little cheaper than Florence!\n\nReggio Emilia is small but has 4 or 5 Lambrusco wineries and great food!\n\nWe always went for a beach day to Cesenatico and it was beautiful and non touristy!"}, {"username": "Helen Dyrkacz", "comment_text": "Thank you so much!❤"}, {"username": "Suzanne Joslin Oliveria", "comment_text": "Bologna!!"}, {"username": "Jenny McEvoy Sterpin", "comment_text": "Bologna, Milan, Lake Como or Lake Garda. Or do it all from\nMilan as day trips"}, {"username": "Eileen Muro", "comment_text": "Verona!!"}, {"username": "Neil Brunner", "comment_text": "I'd vote for Verona too"}, {"username": "Cris Wimer", "comment_text": "Padua (Padova) Get tickets early to the Scrovegni Chapel. St Anthony’s Cathedral is amazing. Many piazzas in the town."}, {"username": "Irene Oda", "comment_text": "I like to take a look at the map and see what interesting places there are to explore."}]}, {"id": "2206862466379498", "text": "any hotel recommendations in Rome Trastevere, middle of September? under 300€ ... grazie", "link": "facebook.com/groups/1373361046396315/permalink/2206862466379498/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187791-d2135\n8351-Reviews-So\nnder_Piazza_San\n_Pietro-Rome_La\nzio.html"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.jdoqocy.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187791-d5567\n08-Reviews-Resi\ndenza_Arco_dei_\nTolomei-Rome_La\nzio.html"}, {"username": "Sylvie Hogg Murphy", "comment_text": "Try Hotel Santa Maria - maybe a longshot, though."}]}, {"id": "2206854173046994", "text": "Beautiful tour of the Vatican this morning. Well worth the early get up for the breakfast tour. I went with City Wonder's through Viators. Highly recommended", "link": "facebook.com/groups/1373361046396315/permalink/2206854173046994/", "likes": 78, "comments": [{"username": "Michelle Lynn", "comment_text": "What time was the tour, how long were you there? I'm trying to plan, but we are limited on time while in rome before leaving for a cruise"}, {"username": "Rayna Kerber", "comment_text": "When I was there in February I got a video of changing of the guards"}, {"username": "Nancy Brennan Carrow", "comment_text": "We did the same tour & time w/breakfast through Viator. It was awesome. Totally recommend."}, {"username": "Jason Carlson", "comment_text": "We’re doing the same tour company. I’ve read it’s hard to find the meet up spot? Did you have issues, or do you have any advice on the meeting location?"}, {"username": "Dawn Richards", "comment_text": "I was there this morning what an amazing building beach taking"}, {"username": "Sandy Kinnerman Kennedy", "comment_text": "Since u had breakfast first were you still in the museum and Sistine chapel before doors open to the public"}, {"username": "Encarni Lopez", "comment_text": "La próxima me voy contigo"}, {"username": "Julie Ann Burgess", "comment_text": "So glad you are enjoying Rome.\nAmazing city x x"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2206851626380582", "text": "If you only had 5 days in Sardinia, in which area would you stay? Not interested in nightlife, would definitely prefer a quieter area over a super busy one..\nThanks!", "link": "facebook.com/groups/1373361046396315/permalink/2206851626380582/", "likes": 1, "comments": [{"username": "Simone Pfenninger", "comment_text": "Costa Smeralda"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.kqzyfj.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g608922-d6237\n79-Reviews-Reso\nrt_Valle_Dell_E\nrica_Thalasso_S\npa-Santa_Teresa\n_Gallura_Provin\nce_of_Olbia_Tem\npio_Sard.html"}]}, {"id": "2206779769721101", "text": "Suggestions for tours in rome you’d recommend thank you", "link": "facebook.com/groups/1373361046396315/permalink/2206779769721101/", "likes": 2, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nHighlights-of-Ro\nme-walking-tour\n-including-the-\nPantheon-and-Pi\nazza-Navona/\nd511-174817P12?p\nid=P00070587&mc\nid=42383&medium\n=link&medium_ve\nrsion=selector"}, {"username": "Stephen Henn", "comment_text": "The evening of our arrival day, we booked the Viator Rome by Night with Pizza & Gelato tour. Since most of us were dealing with jet lag, it was a great way to see the highlights of Rome lit up at night and to enjoy a meal in Palazzo Navona. We could also order pasta dishes, weren’t restricted to just pizza. The guide drove us from site to site saving us long walks while tired."}]}, {"id": "2206848666380878", "text": "In September, I’m going to my favourite places in Tuscany, Rome and Positano with family for 3 weeks then I’ll be travelling solo.\nI would like to visit Sassi Di Matera.\n\nI have purchased train tickets from Rome to Bari then a bus ticket to Matera.\n(5 hours travel time approx)\nHotel is booked but have free cancellation.\n\nIs it worth going for 4 nights?\nAny recommendations, must do tours, restaurants please?\n\n(As I’ll be alone for this part of my trip, I decided not to drive - please don’t recommend having a car)\nThank you 🙏", "link": "facebook.com/groups/1373361046396315/permalink/2206848666380878/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Matera/\nApe-Calessino-To\nur-Sassi-of-Mat\nera-Standard/\nd22632-118903P1?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Matera/\nPrivate-Pizza-an\nd-Tiramisu-Mast\nerclass-at-a-Ce\nsarinas-home-wi\nth-tasting-in-M\natera/\nd22632-68460P829\n?pid=P00070587&\nmcid=42383&medi\num=link&medium_\nversion=selecto\nr"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Matera/\nTOUR-OF-THE-MATE\nRANA-MURGIA-PAR\nK/\nd22632-14534P12?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}, {"username": "Lisa Adams Robertson", "comment_text": "Yes, that will give you 3 full days, right? I think that is a good amount of time to spend there. We loved it."}, {"username": "Greg Saba", "comment_text": "While we often say that Matera was one of our favorite places in all of Italy (and we have been nearly everywhere), we believe that 3 nights and two full days is sufficient."}, {"username": "Laura Uribe", "comment_text": "You could spend 2 nights in Trani (40 minutes north of Bari) and then two nights in Matera. I think four nights in Matera might be a little too long even though we loved our time there."}]}, {"id": "2206845053047906", "text": "Has anyone had recent experience landing in Milan (MXP) airport? I am trying to gauge how much time it will take to deplane, get through customs, collect my checked baggage and to find a taxi to my airbnb (approx 50 mins from airport). For additional context - I am landing on a Saturday afternoon on an incoming flight from London.\n\nThanks in advance - safe travels to all!", "link": "facebook.com/groups/1373361046396315/permalink/2206845053047906/", "likes": 1, "comments": [{"username": "Carmine Castiglia Jr", "comment_text": "My memory of MXP is mostly about the other end of the trip.\n\nMXP is huge and to get from the airline's check-in counter to the departure gate can easily be a 30 minute walk - and that's *after* going through security."}, {"username": "Rhona OConnor", "comment_text": "Impossible to guess, getting through passport control is the slow thing these days. Depends on the flights that land at the same time. Allow at least 1 hour."}, {"username": "Nancy DeHart", "comment_text": "I'd like to ask the same question please, but for Linate airport. Flight arrives at 3:15 pm and my airbnb is near Wagner metro station."}, {"username": "Erin Mitchell", "comment_text": "I landed in MXP Terminal 1 and came from Chicago. Coming into Italy I just stood in a line for about 15 min for them to check and stamp my passport. Didn’t have checked bags. Went to the train area and once I figured out to just get on a train like the lady told me, it was all good. Maybe an hour and a half? But I didn’t have checked bags and second guessed myself with the train situation."}, {"username": "James Maxwell", "comment_text": "This April, once I left the plane, I was out of the airport in less than 15 minutes."}, {"username": "Donna Gilardone Szwabowski", "comment_text": "This April, on a Tuesday, from landing there was a long line at immigration, I grabbed suitcase and was out in about 30 minutes with a US passport"}, {"username": "Frank Hunt", "comment_text": "Catch the train, out of the airport within 25 minutes, another 30 to 40 mins into Milan if I remember correctly then taxi or Uber whatever."}, {"username": "Mohor Chakraborty", "comment_text": "Landed in the morning last week. 1.5 hrs at passport control"}, {"username": "Juliet Lee", "comment_text": "Milan - Bergamo airport is extremely quick"}, {"username": "Jane Warren", "comment_text": "Only hold up for me - no hold luggage to wait for - was passport control, it was a mad scramble (no orderly queue) for the few passport machines. This was 3 weeks ago. Walks not too bad on landing at new terminal, I flew from London so assume you will be in T2."}, {"username": "Laura Irmina", "comment_text": "Take a look at all arrivals that day. It mostly depends on how many flights are coming with yours."}, {"username": "Andri McKenzie", "comment_text": "We landed on a Saturday afternoon a month ago in Milan (Qatar airways). It really depends how many other flights are also landing. We had an Emirates flight land with us (we landed 13:30); at 15:00 we were on the Malpensa express to Cadorna. I’d say plan 2 hours from landing to exiting the airport then you should be safe. Landing and exiting the plane is not the same thing…\nEnjoy!"}]}, {"id": "2207309206334824", "text": "Planning a trip for me and my husband for November. We are taking a train from Monaco to Venice, spending 2 days in Venice and 4 days in Rome. I would appreciate any suggestions on what to see and places to eat!", "link": "facebook.com/groups/1373361046396315/permalink/2207309206334824/", "likes": 1, "comments": [{"username": "Michael Wilkinson McLaughlin", "comment_text": "While in Venezia, be sure to go to Burano Island. It is North of Venezia. My favorite place to eat is Gatto Nero on Burano Island, but you’ll need to make a reservation about 3 months in advance!"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nHighlights-of-Ro\nme-walking-tour\n-including-the-\nPantheon-and-Pi\nazza-Navona/\nd511-174817P12?p\nid=P00070587&mc\nid=42383&medium\n=link&medium_ve\nrsion=selector"}]}, {"id": "2207311639667914", "text": "Hi, We just booked our tickets to visit Vatican museum and sistine chapel through 'Headout' site for next week. Any one booked through this site? Advice please.Thx", "link": "facebook.com/groups/1373361046396315/permalink/2207311639667914/", "likes": 1, "comments": []}, {"id": "2207301183002293", "text": "Are there any free, public beaches in Sorrento?", "link": "facebook.com/groups/1373361046396315/permalink/2207301183002293/", "likes": 14, "comments": [{"username": "Paola Iampietro", "comment_text": "Following"}, {"username": "John Bruckman", "comment_text": "Yes of course. But it’s better to pay the small fee to get an umbrella and a lounge chair. Plus you have refreshments and food service."}, {"username": "Heather Hurley", "comment_text": "Following"}, {"username": "Lisa Aho", "comment_text": "I just left and never found a free one in Sorrento. I’m not saying there isn’t one but it was between $10-$16 per person at the five I checked."}, {"username": "Michelle Plutto", "comment_text": "Following"}, {"username": "Lori Charlene", "comment_text": "Deanna Guerin"}, {"username": "Vasanthi T Arasoo", "comment_text": "Yes. Marina Grande."}, {"username": "Julie Onions", "comment_text": "Following"}, {"username": "Patricia Hall", "comment_text": "We went to one but I honestly don't know the name of it it was just right down the hill from our hotel"}, {"username": "Shelley Frise", "comment_text": "There are lots of paid beach chair rentals. Ours was 40 euros for the day."}, {"username": "Diana Sideris", "comment_text": "https://\nwww.leonellisbea\nch.com/ this one was charging 88 euros for 4 chairs and two umbrellas . The one right next to it was 150 euros for the same amount of chairs and umbrellas started with an M. I can’t remember the name . You also need to get their early as they book up fast. We didn’t see any free beaches"}, {"username": "Marina Chester", "comment_text": "There is a restaurant on Marina Grande called Ristorante Bagni Sant’Anna. You can rent chairs and umbrella from them as well. It is a little but pricey but such a great beach experience.Two giant beds and umbrella will be about 50 euros a day"}, {"username": "Fiona Mac", "comment_text": "48 euros for 2 beds and umbrella hire"}, {"username": "Chelsey Mesenburg", "comment_text": "Chelsey Mesenburg"}, {"username": "Chelsey Mesenburg", "comment_text": "Hidden gem, loved it! Its a long walk tho!"}, {"username": "Anita Clayton", "comment_text": "Usually about 20 each with an umbrella, at the end of May we only paid €10."}, {"username": "Andresa GB", "comment_text": "Yes\nBut not the best\nWe did a kayak tour that takes you to bagni regina during sunset, the best pictures of my trip, so so so pretty"}, {"username": "Clint Foster", "comment_text": "What’s the best beaches in Sorrento/ Amalfi Coast area? Going to be there next month."}, {"username": "Tamta Meladze", "comment_text": "If i remember corectly the name was Marina grande, there were several beaches one of them was free. Others were 35-40 euro. For me it was the most beautiful place in Sorrento. Have a nice holiday🫶💕💕(View from my hotel on this beach)"}, {"username": "Michele Drozdowski", "comment_text": "Michele Drozdowski"}, {"username": "Gretchen Cabrera", "comment_text": "Yes."}, {"username": "Pamela Frias", "comment_text": "We were in Sorrento for a day last week and I was wonder the same. I just found Marina Grande beach. It isn’t that big so it wasn’t easy to find a place for four. It’s not a typical sandy beach, it’s was rocky but the water was perfect. When you’re in the water you don’t want to get out 🥰"}, {"username": "Sandra Di Liso", "comment_text": "We just booked for tomorrow at Marina Piccola. For 4 loungers and an umbrella it was €88."}, {"username": "Summer Marie", "comment_text": "If you want to go away from Sorrento there are nice places in Piano Di Sorrento and Meta di Sorrento. I nice beach club restaurant in Meta I recommend is La Conca!"}, {"username": "Evelyn Terry", "comment_text": "Following"}]}, {"id": "2207306893001722", "text": "I want to book a Colosseum tour. Night or day ?\nAnd any suggestions ?", "link": "facebook.com/groups/1373361046396315/permalink/2207306893001722/", "likes": 0, "comments": [{"username": "Brian Yonks", "comment_text": "Day time. Usually 4 hours with the forum"}, {"username": "Victoria Laverty", "comment_text": "Look at past posts"}]}, {"id": "2207308866334858", "text": "Looking for great tours out of Naples! Any recommendations for must sees or great tour companies?", "link": "facebook.com/groups/1373361046396315/permalink/2207308866334858/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Naples/\nDay-Trip-from-Na\nples-Pompeii-an\nd-Mount-Vesuviu\ns/\nd508-18971P23?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Naples/\nCapri-Easy-Cruis\ne-with-Blue-Gro\ntto-Option-from\n-Naples/\nd508-53180P108?p\nid=P00070587&mc\nid=42383&medium\n=link&medium_ve\nrsion=selector"}]}, {"id": "2206922249706853", "text": "I was in Italy last week and love every day I spent there. Early mornings to get the better pictures and avoid the crowds.\nCan’t wait to back next year !", "link": "facebook.com/groups/1373361046396315/permalink/2206922249706853/", "likes": 95, "comments": [{"username": "Elizabeth Hartzell", "comment_text": "Great pictures! What time did you typically head out? Any other tips?"}, {"username": "Tara Roed", "comment_text": "great photos! We went earlier this summer and fell in love too"}]}, {"id": "2207291989669879", "text": "I highly recommend IL Chianti restaurant just a short walk from Trevvi fountain", "link": "facebook.com/groups/1373361046396315/permalink/2207291989669879/", "likes": 0, "comments": []}, {"id": "2191680051231073", "text": "The Resort Valle dell'Erica is your dream resort in Northern Sardinia, between Santa Teresa Gallura and Palau, facing the enchanting scenery of the islands of the La Maddalena and Corsica Archipelagos. A parkआणखी of 28 hectares surrounded by unspoilt nature and exclusive small white sandy beaches and coves 🥰\nDiscover more: https://www.kqzyfj.com/click-100692842-11552042?url=https%3A%2F%2Fwww.tripadvisor.com%2FHotel_Review-g608922-d623779-Reviews-Resort_Valle_Dell_Erica_Thalasso_Spa-Santa_Teresa_Gallura_Province_of_Olbia_Tempio_Sard.html%23%2Fmedia%2F623779%2F619599724%3Ap%2F%3Falbumid%3D107%26type%3D2%26category%3D107", "link": "facebook.com/groups/1373361046396315/permalink/2191680051231073/", "likes": 6, "comments": []}, {"id": "2207313533001058", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2207313533001058/", "likes": 3, "comments": []}, {"id": "2207263693006042", "text": "Come discover the Royal Palace of Caserta, a UNESCO World Heritage site, also known as the Italian Versailles, celebrated for its Baroque style and considered the largest royal residence in the world by volume.आणखी You will have the chance to walk virtually through the rich rooms of this magnificent palace and admire the spectacular fountains and sculptures that adorn the fabulous royal gardens.\nJoin our virtual experience: https://nextstop-italy.com/virtual-tours/naples-royal-palace-caserta/\n\n#italyiloveyou #art #italytravel #italytrip #italygram #history #virtualworld #VirtualTour #vacationmood #naples #naplesitaly #naplesinsider #caserta #casertaitaly #casertapalace #amalfi #amalficoast #amalficoastitaly #napoli #royalpalaceofcaserta #royalpalace #royalpalace", "link": "facebook.com/groups/1373361046396315/permalink/2207263693006042/", "likes": 0, "comments": []}, {"id": "2172513489814396", "text": "Hiking & Trekking: Otranto, The Natural Park and Bauxite Quarry\nDon’t get lost while exploring new trails on this guided hiking tour of the Costa Otranto Regional Nature Park in eastern Apulia. Highlights… आणखी include exploring Otranto’s historic center, visiting the legendary Torre del Serpe coastal tower, and checking out Cava di Bauxite, a colorful quarry lake surrounded by red rock cliffs on the site of an old cave.\nRead more about Hiking & Trekking: Otranto, The Natural Park and Bauxite Quarry - https://www.viator.com/tours/Lecce/Otranto-Trekking-Adventure/d22769-100111P7?pid=P00070587&mcid=42383&medium=link&medium_version=selector", "link": "facebook.com/groups/1373361046396315/permalink/2172513489814396/", "likes": 1, "comments": []}, {"id": "2206859356379809", "text": "Would anyone be able to confirm that Vicolo del Governo Vecchio (Rome) is a good spot to stay?\n\nThanks ☺️", "link": "facebook.com/groups/1373361046396315/permalink/2206859356379809/", "likes": 0, "comments": [{"username": "Dafne Vassetti", "comment_text": "Lots of small restaurants and pretty safe area behind piazza Navona. It's a very good spot if you are ok with the noise, as places are open till late and most of the restaurants have outside sitting."}, {"username": "Lisa Rotondi", "comment_text": "Yes, fantastic."}, {"username": "Elena Innocenti", "comment_text": "my father lived there for 10 years. Fantastic position, piazza navona, pantheon walking distance. It’s easy also go to vatican.\nyou just have to know that in the evening there is noise and in the morning the bells."}]}, {"id": "2206862053046206", "text": "What is the easiest way to get from Lake Como/Bellagio to Portofino? Private driver, taxi, public transport?", "link": "facebook.com/groups/1373361046396315/permalink/2206862053046206/", "likes": 11, "comments": [{"username": "Iselin Kvalvik Eliassen", "comment_text": "Train!"}, {"username": "Roberta Matias", "comment_text": "The easiest way is a private transfer."}, {"username": "Dawn Etkin", "comment_text": "Take the train to Milano Centrale , then change trains and take the one (La Spezia line) , which will take about 3 hours to Santa Margherita Ligure (the station where you will get off .). From there it is a short taxi ride to Portofino ."}, {"username": "Sarah Luisa Hughes", "comment_text": "Train from Milan to Santa Marguerita and then ferry, the best views coming into Portofino are by boat! Make sure you visit Camogli too its absolutely beautiful"}, {"username": "Bonnie Brauner", "comment_text": "Private car to Milano Centrale is fastest. You have to take a ferry from Bellagio to Varenna to take the train to Milan."}, {"username": "Sarah Campise Hallier", "comment_text": "Train. Easy and quick."}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.discovercars\n.com/\n?a_aid=NextStop-\nItaly"}, {"username": "Carol Kelly", "comment_text": "Download the App Rome2Rio, it will give you all your options, times, costs etc"}, {"username": "Danny Zare", "comment_text": "Easiest and most expensive - private car\n\nCheaper - Ferry Bellagio to Varenna, Train to Milan, Train to Santa Margherita, taxi/ferry to Portofino"}, {"username": "Claire Dowson", "comment_text": "Get the boat from Bellagio to Varenna or Lierna, jump on the train to Lecco. Change for Milan central, then head to Santa Margherita Ligure."}, {"username": "Marian Gallard", "comment_text": "Just last week we went from Bellagio to Santa Margherita. We ended up catching the bus from Bellagio to Como (5 euro) 1 hour approx.) as the ferries (hydrofoil) proved unreliable and taxis few and expensive. We caught the 1:10 pm EC train from San Giovanni como station that went direct to SML which we booked through Trenitalia. (I’m not sure if it goes every day). Then I guess you could get the bus/ferry or taxi to Portofino. Hope this helps 😊"}, {"username": "Dorothy Press", "comment_text": "Train! We just did that route in May-June this year 💕🇮🇹"}]}, {"id": "2206864139712664", "text": "Greetings. I need some assistance. Been in Northern Italy for a week now..Verona and the Dolomites (selva Val Gardena, Cortina, etc). The food has been shockingly poor. We have been eating lunch and dinner out everyday and rely on Trip Advisor ratings which have failed us time and time again. Ate at a top restaurant in Cortina the past two nights and they both were terrible.\n\nHeading to Malcesine on Lake Garda tomorrow for a few days. I’m not going to look at trip advisor. Where should we eat? I have food depression. Lol. 🙏 Thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2206864139712664/", "likes": 1, "comments": [{"username": "Heidi Littman Meiers", "comment_text": "Oh boy ... we head there 3 weeks from today , excited for the Dolomites but not excited about what I see regarding food ... it's very heavily influenced by German food which ( although I'm of German decent , I don't care for ) would love to know where to avoid in Selva"}, {"username": "Alessandro Iannelli", "comment_text": "best thing to do in my opinion is ask the locals for advice."}, {"username": "Cecile Geeurickx", "comment_text": "Anywhere in the world I just look from the outside whether I like the style, the interior, the atmosphere and then if there are any \"locals\". If so then just sit down, ask what they recommend and eat. Have hardly ever been disappointed with this system. :)"}, {"username": "Jona Guðmundsdottir", "comment_text": "Have you tried to ask at the hotel/airbnb or wherever you are staying what places they recommend? I have at least been very lucky with that kind of hints so far."}, {"username": "Dafne Vassetti", "comment_text": "Ask locals and interact with people. Isn't this the whole point of traveling? Ask your hosts, your drivers. Walk around the streets and choose on your own. Also, Italy has regional cuisine so especially in Veneto Region or Trentino Alto Adige you will not get the same things as in other regions."}, {"username": "Barbara Marie", "comment_text": "Ok. So TripAdvisor is tourist ratings. Try The fork app. It's mostly locals ratings."}, {"username": "Marie Cuzzi", "comment_text": "Don’t go on trip advisor or any other app … you’re in the land of the best food … stay out if the tourist traps and eat where the locals eat … if your staying at a hotel ask any of the employees where they eat get off the Main Street go to the back streets you’ll find amazing food"}, {"username": "Ingrid Zancoli", "comment_text": "What were you looking for into food there? Honestly I always ate great meals in the mountains, especially with TripAdvisor. Italian cuisine differs a lot from a place to another depending on the season, tradition and cultural influence."}, {"username": "Susi Menazza", "comment_text": "I’m from Italy and out of curiosity sometimes I check Trip Advisor about restaurants I know. Without exception, they rank not so good restaurants quite high and good ones as average. When using it, you are basically relying on tourists - many with not much understanding of good cuisine or interested just in quantity or price - to give you advice. Italians don’t use the site. As everyone else here say, ask the locals."}, {"username": "Lee-Anne Stewart", "comment_text": "I like Tripadvisor but rarely use to find restaurants. Their algorithms put the strangest types of restaurants at the top of the rankings (presumably because of volume of reviews hence restaurants encourage people to leave reviews there). I know in my city (Edinburgh) the TA top ranked restaurants are rarely the best."}, {"username": "Claudia Marcon", "comment_text": "Hi there, in Malcesine you cannot miss this very nice restaurant Vidoc malcesine or drive to Riva del Garda ( a few Km ) and reserve by La berlera https://\nwww.laberlera.it\n/it"}]}, {"id": "2206864859712592", "text": "Heading from MXP to POSITANO in October…Best way to get there? Thanks for help. Appreciated😊", "link": "facebook.com/groups/1373361046396315/permalink/2206864859712592/", "likes": 0, "comments": [{"username": "Rebecca Yeoh", "comment_text": "High speed train to Naples (book through Trenitalia), then organise private transfer to hotel in Positano. I booked through Rainbow Limos, great service and fantastic communication leading up to the trip. I think it was 145€ for the driver. He picked us up at the platform and took us direct to hotel. I believe you can also get train to Salerno and then ferry to Positano but from what I understand, there is no guarantee the ferry will go to Positano if the seas are too rough. I didn’t want to take the chance."}, {"username": "Samina Jassani", "comment_text": "We booked italo to Naples. Then driver pickup from station"}]}, {"id": "2206880029711075", "text": "Hi everyone, planning on visiting Rome this fall. Do you all recommend staying in Naples a couple of days so I can visit Pompeii and Amalfi or just make a day trip out of Rome to both. TIA", "link": "facebook.com/groups/1373361046396315/permalink/2206880029711075/", "likes": 2, "comments": [{"username": "Kim Hollein", "comment_text": "I asked a similar question and was told better to move your base location as those areas are 4 hours from Rome. I’m planning to go next May so I am going to plan to move between locations so as to make the most of my time. Hope that helps."}, {"username": "Jon Cheeks", "comment_text": "Just go to Rome. I don’t recommend staying in Naples a couple of days just get on the ferry to Amalfi cost. Its beautiful so definitely go there. I canceled the Pompeii trip because it was so much moving around, hot and exhausting."}, {"username": "Daisy Yoo", "comment_text": "Pompeii and All needs about 4 hrs at least , I would visit Rome then move to Naples as second base"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Stay. You cannot do it all in a day trip."}, {"username": "Jenny Payne", "comment_text": "I would stay in Sorrento for 2 days and visit Pompeii & Amalfi 🌻"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nPompeii-Amalfi-C\noast-and-Posita\nno-Guided-Small\n-Group-Day-Trip\n-from-Rome/\nd511-3731P159?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "Stacy Derouin", "comment_text": "We took the train to Naples from Rome, stayed long enough for pizza, then continued on to Pompeii. Private tour of Pompeii, then just continued on to Amalfi for a couple days. Worked out perfectly for us, but we never had any plans to linger in Naples."}, {"username": "Bambi Harris", "comment_text": "do you want to see Herculaneum too? we are staying in pompeii three days and will be in walking distance of the ruins in a lovely hotel with pool, balcony and view. We will get to see herculaneum and do a sorrento/capri day as well"}, {"username": "Marty Harte", "comment_text": "Stayed in Rome took the bullet train to Naples thinking we’d spend the day. Had some pizza walked around some neighborhoods, churches and piazzas…gritty but nice. We wound up taking earlier train back for a 1/2 day. That was enough for us."}, {"username": "Paula Rosati", "comment_text": "Do some research on Naples. It gets a bad rap, but if you like a gritty busy city, it could be your cup of tea. It’s also a good base for day trips to Pompeii, Herculaneum, Vesuvius, Capri, Ischia, Caserta. And fueled by pizza and sfogliatelle. In city there’s Chapel Sansevero with sculptures to rival David. MANN, if you’d like to see more from Pompeii. There are many more items plus there’s an adults only section for Pompeii."}, {"username": "Jeff McLellan", "comment_text": "None of that is a worthwhile day trip from Rome. Too much travel to enjoy the day."}, {"username": "Jeff McLellan", "comment_text": "We only had a morning in Naples and regret not being there longer. We had the benefit of an amazing passionate local guide called Ludovica from Ludoviguida for two hour walking tour. I would base yourself out of there could do Pompeii and Herculaneum in one day we did it (with her as our guide as well, we did three hours in Pompeii and two in Herculaneum). You could then tackle Amalfi as you wish having just done all of it I would take fast ferry from Naples to Capri and spend one night there (totally different place after the day trippers have left). You could hire a boat for sightseeing tour around Capri hitting all three grottos and then head to Amalfi and Positano)"}, {"username": "Shelly Kentner Lehman", "comment_text": "Loved Sorrento"}, {"username": "Nathan Earl Stellenberg", "comment_text": "We visit in the fall and split 3 days in Rome and 3 days in Sorrento. Sorrento base allows quick visit to Naples, Pompeii, Capri and Amalfi Coast plus it's reasonably priced."}, {"username": "Pat Cray", "comment_text": "Skip Naples….stay in Sorrento and make your trips from there! So beautiful!!!"}, {"username": "D'Anna Hohe", "comment_text": "It’s technically possible to do a day trip to Pompeii from Rome, but you couldn’t do Amalfi as well."}, {"username": "Irene Oda", "comment_text": "Rome is about 2.5 hours from Naples. Stay closer otherwise you'll spend too much time on the road. Do homework on Naples. It's an amazing city and gritty. But very authentic, very southern with tons on history, art and amazing food. Take a walking tour for example. The Amalfi Coast is stunning and overcrowded. Stay in Sorrento. Pompeii is a day tour- depending on your stamina and interests. Everyone has their own opinion. I visit the area every year- and it always includes a day or two in Naples."}, {"username": "Teresa Heran", "comment_text": "I’d spend a few days in Naples. It gets a bad rap but I loved it."}]}]