[{"id": "2212417599157318", "text": "The best place to stay in Sardinia( which area) ? 🏖️🌅", "link": "facebook.com/groups/1373361046396315/permalink/2212417599157318/", "likes": 3, "comments": [{"username": "Hector Trevino", "comment_text": "Following"}, {"username": "Enrica Palla", "comment_text": "Golfo di Orosei, or South coast to me. Cagliari is a big city and from there you can move to beautiful beaches or also historical sites like Nora or Barumini. Sardinian here."}, {"username": "Ettore de Vita", "comment_text": "Anywhere…"}, {"username": "Corina Cristea", "comment_text": "Alghero and Ostia (for Sardinia it is good to stay in two different places)"}, {"username": "Kitty Boothroyd", "comment_text": "We loved staying in San Pantaleo to explore the North from there. And we stayed at Cala Ganone to explore the Gulf Of Oresei.. stunning beaches!"}]}, {"id": "2212419665823778", "text": "Venice Vaporetto vs Private water taxi.\n\nWe are 4 people travelling light with just a backpack each. I was thinking we should splurge on the private taxi but not sure. I had this vision that maybe if we booked private, we could get an english speaking 'driver' who could tell us something about the sites as we went to our hotel. Kind of like a miniआणखी tour to go with it. Has anyone had that experience?\nDoes the private water taxi go up the grand canal just like the vaporettos? If the 'driver' (what's the proper name here) doesn't speak to us, and we're just enjoying the view, would it be much difference between a private boat and the public vaporetto?\n\nThanks in advance. Coming in 11 days!!!", "link": "facebook.com/groups/1373361046396315/permalink/2212419665823778/", "likes": 9, "comments": [{"username": "Paola Barbetti", "comment_text": "Vaporetto is the typical public transportation,\nit can be very crowded, way cheaper than a private water taxi that can go almost anywhere you want, including the Grand Canal;"}, {"username": "Val Kilgallon", "comment_text": "Tour bus vs convertible with the top down. That felt like the difference to me! We were not going to spring for a water taxi when we arrived in Venice due to cost but ended up taking one anyway. I'm glad we did! There is something about zipping along with the wind in your hair. Seeing all these lovely buildings go by. And not feeling crowded or angling for a decent seat and maneuvering your luggage. We took vaporettos after that when we needed to get some place distant, but for that first boat ride into Venice, it was really nice to feel like you were in a movie zipping along in an open little boat!"}, {"username": "Michelle Bailey", "comment_text": "We booked a private transfer and it had an option to travel through the Grand Canal. Our hotel had a dock so they delivered us there. Despite the reviews, we felt it was well worth the money! Our photos were amazing.\n\nhttps://\nwww.consorzioven\neziafutura.it/"}, {"username": "David King", "comment_text": "Go for the private boat!!\n\nOn our first trip to Venice, we did that -- from the airport to our hotel that was on the Grand Canal near the Rialto Bridge. It was wonderful. Was more like a private limousine on the water. The interior was gorgous...leath\ner wraparound seating in an L shape. Our driver and guide both spoke English, and honestly, we felt like celebrities as we pulled up to the dock of the hotel.\n\nI recommend this experience highly!! You might not splurge like this all the time (we don't), but it is worth it for a first arrival in Venice (if it's a sunny day)."}, {"username": "Catherine AleXandra", "comment_text": "We did private taxi arriving for 70 euro and had a super enjoyable first ride with family straight to hotel. First pics of Venice. Very calm.\n\nWe did Vaperetto home. I think for 60 euro back.\n\n5 people.\n\nBest of both worlds. I’d take private when arriving just so you can have a relaxing ride to your hotel and enjoy those first few moments.\n\nAt 5 people the price difference wasn’t huge. And it was nice not to feel crowded and worry about luggage. ￼"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Don’t confuse a Vaporetto with the Alilaguna. A private water taxi and Alilaguna (15€ pp)take basically the same routes from the airport. You will use a Vaporetto to navigate around Venice once you are there."}, {"username": "Karen Bowman", "comment_text": "How difficult is it getting in and out of the boats, either private taxi or Vaporetto?"}, {"username": "Yvonne Ormson", "comment_text": "Just left Venice yesterday. We took the alilaguna from airport to Venice (15 euros each) and bought a 3 day vaporetto pass (45 euros each) for our stay. We took the vaporetto up and down canals, around the islands and to Burano & Murano.\nFor us it made financial sense to get 4 days worth of transportation and sightseeing for less than the cost of one taxi ride from the airport."}, {"username": "Bea Kuckens", "comment_text": "We used Vaparettos to and from train station, then also the entire route (without luggage) just for fun. Took a water taxi to Murano - they can cut through the small canals and make trips shorter (traffic permitting). My husband loved the beautiful wooden boat and the speed, but for me it was a bit too much bounce."}, {"username": "Michelle Howard", "comment_text": "Do you need to reserve the private taxi?"}, {"username": "Lushan Yao", "comment_text": "If there are four of you, I would splurge for a water taxi. It’s an unique experience for a grand arrival to Venice."}, {"username": "Ryan Monahan", "comment_text": "Alilaguna runs from the airport, to the city and down the Grand Canal with about 15 stops. It's kind of like an Airport Express Bus. The Vaporetto is more like the city bus. It does not go to the Airport. Alilaguna boats are not great for sight seeing. The seats are very low and the windows are not clear. But its a great way to get to and from the airport. The Vaporetto is a decent tour, but can be very crowded (like a city bus). If you get the seats in the back that are open air, decent tour. You're going to run around $15/each for one way Alilaguna trip. $10/each for a 75 min Vaporetto ticket. So you can compare that to private water taxi."}, {"username": "Venette Macalinao", "comment_text": "Does anyone have recommendations\nof private water taxi companies?"}, {"username": "Anna O'Connor", "comment_text": "Depends whether you are arriving by train or plane. Vaporetto from train station and Alilaguna from airport. the ‘driver’ is not a tour guide so you won’t get commentary. I think depends on your budget. If money is no object go the private water taxi. Otherwise go public transport and blow the savings on Prosecco and cicchetti. Win win!"}, {"username": "Chris Landry", "comment_text": "LOVED the private boat. It was a beautiful work of art and I felt like one of the Beautiful People 😁 Wear a scarf that flies in the wind 😁"}, {"username": "Charleen Siegler Schuss", "comment_text": "For your first time in Venice get a water taxi. Most of the pilots speak enough English. Their English probably won't enough to comfort you after a divorce or help you figure out your 4o1K but plenty of English to direct you to food, bathroom, place to sleep and local sites in the most charming delightful way you could ever imagine"}, {"username": "Leigh Melville", "comment_text": "Water taxi is a lovely way to arrive in Venice but don't expect the driver to be a tour guide. He will be focused on driving and you will be in the back. Beauty is everywhere around you."}, {"username": "Marianna Mazzuccato", "comment_text": "The water taxi driver is a driver not a tour guide."}, {"username": "Eva Cannon", "comment_text": "Private water taxi, it takes 30 min only to get to the city. The public transportation will take a long time"}, {"username": "Teresa Weaver Milner", "comment_text": "Definitely do private. The drivers are very polite but the wind and boating noises are too loud for the driver to talk. Plus the waterway is sometimes very congested. You want him to concentrate on driving."}, {"username": "Peggy Loyst", "comment_text": "I booked ahead of time (sorry cant find info but third party viator?) for a shared water taxi to airport. We picked up a couple in the smallest canals and then off we went.\nBest experience - standing at the back, wind in your hair, worth every penny. And I only paid $50 Canadian per person￼.\nDO IT!"}, {"username": "Tamanna Parekh", "comment_text": "Are you arriving to airport or train station? If train station then from what I understand there's not much difference between the cost of a vaporetto for 4 people and a private water taxi. However, If you are coming from airport, we found the Alilaguna to be fine 🙂. It cost us 27euro return each (or can do 15euro pp each way)....I think that's half the cost of a private water taxi which I understand is at least 120euro each way. It took us 40mins to get to our destination with Alilaguna so was pretty quick I thought. There's a an open air place at the back where you can stand if you wanted to. If money is no object then why not water taxi....but otherwise I personally thought the Alilaguna was totally fine 🙂"}, {"username": "Lisa Zarlingo Smith", "comment_text": "DO IT! My regret is that I didn't arrive James Bond style~ And the Veporetto took forever to catch at the airport (45 minutes) and stopped for a millisecond at our stop so we ended up having to get off at the next stop which meant a much longer walk."}]}, {"id": "2212110405854704", "text": "Question about bus transport. If you want to catch a bus at a bus stop, are there ways to purchase tickets at every bus stop?", "link": "facebook.com/groups/1373361046396315/permalink/2212110405854704/", "likes": 0, "comments": [{"username": "April Dykes", "comment_text": "When I was in Rome last year and again next month, you have a pass that covers both trains/metro and buses as bus drivers don’t do any kind of tickets when we was travelling from malafede to rome city centre each day 🙂"}, {"username": "Christine Aird Craig", "comment_text": "Buy your tickets and validate before you get on the bus. There is normally somewhere close by like a shop or a bar to buy them. You need to validate/punch them in a machine close by."}, {"username": "Cat Furness", "comment_text": "You can also pre purchase numerous tickets at once and they are still valid till\nyou validate them."}, {"username": "Mary Anne", "comment_text": "Some cities have an app. I know Naples does."}, {"username": "Julie Norris", "comment_text": "I bought ten of the €1.50 tickets from a metro station . They last ninety minutes from validation and cover one metro ride too. That way, if I needed to jump on some public transport I was covered 😀"}, {"username": "Ibbu Mohd", "comment_text": "Find stores like this to buy bus tickets\nImmediately validate ticket in bus (green machine), if u do not, next stop you will get fine of $45 pp 🙂"}]}, {"id": "2212142912518120", "text": "Does anyone have recommendations for inexpensive accommodation in central area from where we can visit Pisa,Lucca and Florence.Thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2212142912518120/", "likes": 0, "comments": [{"username": "Norma Boily", "comment_text": "Montecatini terme?"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.kqzyfj.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187895-d2307\n23-Reviews-B_B_\nHotel_Firenze_P\nitti_Palace_al_\nPonte_Vecchio-F\nlorence_Tuscany\n.html"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.dpbolvw.net/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187899-d2663\n634-Reviews-B_B\n_Hotel_Pisa-Pis\na_Province_of_P\nisa_Tuscany.htm\nl"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.anrdoezrs.ne\nt/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187898-d1540\n813-Reviews-B_B\n_Corte_Dei_Nobi\nli-Lucca_Provin\nce_of_Lucca_Tus\ncany.html%3FspA\nttributionToken\n%3DMjE3NjE3Njc"}, {"username": "Rose Turdo", "comment_text": "Sienna"}, {"username": "Kejdi Okej", "comment_text": "Sienna"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "If you travel by train check in Pontedera, Prato, Empoli, San Miniato, even Pisa is not too expensive and you will reach Lucca in 40 minutes, Florence in 1 hour.\nIf you have a car check all the small villages between the cities: Calci, Capannori, San Miniato, Montecatini, Vicopisano, Migliarino Pisano, Vinci, Lamporecchio, Quarrata, Cerreto Guidi, Montelulo Fiorentino, Crespina are all nice and cheaper than the main cities.."}, {"username": "Brian McGraw", "comment_text": "What does inexpensive meant to you?"}, {"username": "Lyn Evans", "comment_text": "I have booked some beautiful accom in Lucca through Lucca apartments and villas. Was the cheapest accom we have booked in our whole 7 weeks in Europe."}]}, {"id": "2212231869175891", "text": "Has anyone used the anthropology cross body?", "link": "facebook.com/groups/1373361046396315/permalink/2212231869175891/", "likes": 0, "comments": []}, {"id": "2212223592510052", "text": "Any ideas or there for sassy white or blue women’s crossbody pack?", "link": "facebook.com/groups/1373361046396315/permalink/2212223592510052/", "likes": 0, "comments": []}, {"id": "2212234575842287", "text": "Ciao!\n\nLooking to spend a day in Tuscany, close enough to Florence in a vineyard with a swimming pool.\n\nAny recommendations ?\n\nGrazie Mille 😍🤝", "link": "facebook.com/groups/1373361046396315/permalink/2212234575842287/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.anrdoezrs.ne\nt/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187896-d2636\n03-Reviews-Fatt\noria_Di_Maiano-\nFiesole_Tuscany\n.html"}, {"username": "Rebeca Andreea", "comment_text": "Rebeca Andreea"}, {"username": "Jaime Wilson", "comment_text": "Villa dianella has an amazing pool and really nice wine tastings with a tour 🙂 we just stayed there for a few days this week and loved it."}]}, {"id": "2212233255842419", "text": "When is best to go to Italy. Can’t decide whether may or September 🤔", "link": "facebook.com/groups/1373361046396315/permalink/2212233255842419/", "likes": 39, "comments": [{"username": "Bridget Carmichael", "comment_text": "Unpopular opinion but I think Ene of February & early March is the absolutely the best time to sight see and see as many cities as possible"}, {"username": "Elvar Ingimarsson", "comment_text": "September always!!"}, {"username": "Thea Bianca", "comment_text": "All the time, but between November and April the museums have very short opening times (2 hours) and you cannot see so much. Means of transportation to the main tourist attractions are also svarce. I would recommend May for sightseeing and September if you also plan on going to the beach."}, {"username": "Inessa Vysotski", "comment_text": "September!! All fruits and best temperatures.."}, {"username": "Shawn Leinhart", "comment_text": "September/\nOctober"}, {"username": "Alison Apicella", "comment_text": "Diana Ferro-Rodrigues"}, {"username": "Diana Ferro-Rodrigues", "comment_text": "September"}, {"username": "Gabrielle Murphy", "comment_text": "Patrick."}, {"username": "Michele Sica Selesky", "comment_text": "I went in May and it was perfect. Not too hot and not too cold"}, {"username": "Anna De Napoli Petruzza", "comment_text": "September 😘"}, {"username": "Jessie Colon", "comment_text": "I would in September no rain. April and May is Rain ☔️"}, {"username": "Rosa Jimenez-Sanchez", "comment_text": "My daughter and Icwill be there all of September and we cannot wait!"}, {"username": "Sara Butcher", "comment_text": "I’ve been in August and September. Sept definitely better weather wise, not as hot and holidays have generally finished ❤️🇮🇹🇦🇺"}, {"username": "Sydney Wooten", "comment_text": "October absolutely"}, {"username": "Dawn Pirozzi Maxemow", "comment_text": "Both!"}, {"username": "Enrico Lecce", "comment_text": "September"}, {"username": "TinaMarie Rando", "comment_text": "I went in September -perfect"}, {"username": "Jacquie Johnston", "comment_text": "October 3 times it’s great weather"}, {"username": "Jenny Payne", "comment_text": "Myself either October or winter February, March have done both for many years 🌻"}, {"username": "Ian Fawkner", "comment_text": "Anytime- such a magnificent country and people"}, {"username": "Kate Bryant", "comment_text": "Either month is good, but probably September! Enjoy!"}, {"username": "Christo Kris Lourens", "comment_text": "How is November? I am going to Italy in November.."}, {"username": "Fiona Cameron", "comment_text": "I’ve been 3 times in Sept and once in May, I prefer September/Oct over May /June."}, {"username": "Amany Barakat", "comment_text": "September I think"}, {"username": "Carol Abriola Ortiz", "comment_text": "September"}, {"username": "Leone Kennedy", "comment_text": "September it is Di Denston"}, {"username": "Lesley Fox", "comment_text": "Thanksgiving week is the best. Planes are empty and very little crowds"}, {"username": "Carrie Duffy VanderMolen", "comment_text": "We went in Late September (Rome, Tuscany and Amalfi Coast) and it was warm and less touristy. Perfect in my humble opinion. And yes we swam! Good luck!"}, {"username": "Nina Triassi", "comment_text": "I went in May1, it was lovely,cool, sunny weather, excellent for walking, sitting outdoors , not crowded etc. Loved it. However, the flowers and their lovely fruit were not ready. Next time, mid to late September"}, {"username": "Nicole McClain", "comment_text": "I have been 4 times- the last time I went in July I said I would never go back because it’s so hot… but due to schedules we had to go back this July for 15 days… the weather is so hot. It’s always wonderful but unless you want to be in 104 degree whether… opt September!!"}, {"username": "Brittney Monk", "comment_text": "I went in early May and it was great! I know a few people who went late May and they said it was starting to get busier."}, {"username": "Colleen Cassar", "comment_text": "September. I was there in May and it rained and was cool some days. September is the end of the northern summer…you are more likely to enjoy mild warm days."}, {"username": "Paola Iampietro", "comment_text": "Our tour guide told us the crowds are largest in September. The weather will be beautiful both of those months though"}, {"username": "Nancy Caruso Watts", "comment_text": "May and October are almost the same weather."}, {"username": "Diana Dietl", "comment_text": "Both"}, {"username": "Chiara Rossi", "comment_text": "Both times are perfect! If you want to enjoy the seaside September and October are wonderful!"}, {"username": "Sharon Hall", "comment_text": "September beautiful weather just right"}, {"username": "Josue Rdz-Cantu", "comment_text": "End of September"}, {"username": "د. ئاری قادر موکریانی", "comment_text": "Amalfi and positano"}, {"username": "Evangeline Acuesta", "comment_text": "Spring and fall."}, {"username": "Lina Janssen", "comment_text": "Always"}, {"username": "David Ockman", "comment_text": "I don’t have a choice\nDue to our kids college and law school 🏫 we can only go 6/27- 7/9 2024. How does this time of the year stack up weather wise?"}, {"username": "Litza Aretos", "comment_text": "Tony Barulovski . Read comments of weather in Italy"}, {"username": "Sandi Marella Johnson", "comment_text": "October"}, {"username": "MariAngela Crasci", "comment_text": "I would say Mid May or September because it’s bearable weather and less tourists. The summer months are hot and crowded. However I found mid to late October we still had good weather but in some regions it was quite cool and rainy. Not as many tourists."}, {"username": "Angelina Dattini", "comment_text": "September"}, {"username": "Lori Mongillo", "comment_text": "I have been in May and September, both are great times to visit!"}, {"username": "Ewa Olbrych-Rudzinska", "comment_text": "I would suggest go when you want to go . Every single month has its own bonuses . Go and explore and be happy . You do like heat and you can go in the summer only because of kids vacations or u are a teacher go in the summer . U want crispier air and less people go early spring and fall . U want to have city like Rome to yourself and no lines go in the winter . Italy is amazing 24/7 365 days a year . When u go the first time you will know exactly what you want and what you don’t want next time 🙂 there is never a prefect scenario . You will always compromise something . And with climate changing you can not predict weather anymore . This year May was rainy for the first time in history . 🙂"}, {"username": "Graziella Khayat", "comment_text": "September/\nOctober"}, {"username": "Jenny Frank", "comment_text": "End of Sept perfect!"}, {"username": "Michelle Birdwell", "comment_text": "Definitely not summer too hot and Europe is for walking around but not in that heat"}, {"username": "Michael Imbelli", "comment_text": "YES"}, {"username": "Pamela Tunis Guido", "comment_text": "I want to plan a trip for me and my 2 children. My daughter is a teacher so it has to be summer. My grandparents are from Italy. My dads , from Calabria. And my moms, ￼from Pavia . I need to see the whole country. I need to do a lot of planning."}, {"username": "Markie MK", "comment_text": "I have been in both may/early June twice and September, November as well. May is the best I’d say but September is a very close second so whatever works better for you will be great! It’s always a good time to go to Italy 🥰"}, {"username": "Laurie Gajewski", "comment_text": "Both my favorite months"}, {"username": "Susan Sassoon", "comment_text": "I went mid October, perfect weather to walk and tour. Always crowded though. Rome makes New York look like it was evacuated. Venice very crowded as well."}, {"username": "Christy Blanco-Frias", "comment_text": "I was there mid to late May and it was perfect, weather and crowds wise\nWe avoid Europe from mid June to mid August"}, {"username": "Madeline Munson", "comment_text": "This past May weather was perfect"}, {"username": "Susan Donatelli", "comment_text": "Any thoughts on what to pack for visiting Amalfi coast late September."}, {"username": "Shelly Seifert Lettieri", "comment_text": "We went early May still kind of rainy"}, {"username": "Gloria Chesbro", "comment_text": "I always had to travel July and August-retired teacher. This year we did Italy in early May. It was GLORIOUS. Less crowds, weather in the 70’s. Best trip ever."}, {"username": "Barbara Marie Demaio", "comment_text": "September awesome 🙏"}, {"username": "Deadra  Toribio", "comment_text": "June is amazing! July and August is Europeans holiday. Masses of people everywhere. June has always been great weather, no rain, no masses. You will love Italy. It truly is a magical place."}, {"username": "Rebecca A. Baer", "comment_text": "September"}, {"username": "Toni Tomaini", "comment_text": "September"}, {"username": "Jody Case-kennedy", "comment_text": "Go in May..if enjoy go in September."}, {"username": "Shirin Stevens", "comment_text": "May was perfect"}, {"username": "Kathryn Duncan Bianchi", "comment_text": "September"}, {"username": "Robin Runkle Harvey", "comment_text": "We love May"}, {"username": "Jennifer Helen", "comment_text": "Late September"}, {"username": "Elaine Beale", "comment_text": "I love it in July. It’s hot as hell so you have to do like the locals and take a siesta in the afternoon - read drinks in the shade."}, {"username": "Ellen Sosko-Chialastri", "comment_text": "Wasn't here in Mid May and it was wonderful weather wise. Rained at night in Rome but Florence was spectacular the entire time, day and night. Perfect for walking around."}, {"username": "Andrea Paquette Haber", "comment_text": "I think everyone is going this September."}, {"username": "Angela Genduso", "comment_text": "October or May are best time weather and less crowded."}, {"username": "Voula Ladas", "comment_text": "If you prefer warmer temperatures go September ."}, {"username": "Demi Martinez", "comment_text": "How crowded is Florence in august"}, {"username": "Vivian Scarpino", "comment_text": "May ❤️"}, {"username": "Patricia Fugaro Chraibi", "comment_text": "most Italians leave the cities and go to the beach for the month of august which leaves tourists and other foreigners (not Italians) in the cities and a lot of businesses usually open during the year are closed in the summer - if you go to beach areas, the summer is great but cities like Rome are still nice just a different feel in the summer and hot and dusty"}, {"username": "Jo Ann Schwartz Woodward", "comment_text": "Late September"}, {"username": "Martina Saverino", "comment_text": "Always! No time is a bad time!"}, {"username": "Janette Graham", "comment_text": "September.❤️"}, {"username": "Kary LeBlanc", "comment_text": "More like April or October. If school is out, people are everywhere"}, {"username": "Ricky Ellis", "comment_text": "Either. Just not summer!"}, {"username": "Jane Eichhorn", "comment_text": "We were there March 27-April11th. High 60s-high 70s. Perfect. Rained only one day!"}, {"username": "Laura Weir", "comment_text": "Early October"}, {"username": "Stef Gen", "comment_text": "We were there in May. Few days of showers but didn’t last the whole day. The Romans said though it wasn’t their typical May. Usually its the perfect weather to go visit!"}, {"username": "Tara Turkovich", "comment_text": "First half of October was amazing! I’ll do that same time when I go back."}, {"username": "Paul Dyke", "comment_text": "We always go june, July or August. Pretty much guarantee good weather and it's never that overcrowded."}, {"username": "Kristina Ruk", "comment_text": "Every time of the year has its pluses and minuses. Me myself cant imagine Italy without seaside🤣I live in the Midfle of Europe..we have summers only +20C, so I enjoy perfect summers in Italy🤣🤣🤣"}, {"username": "Ursula Kenny", "comment_text": "september 🙌🏻"}, {"username": "Michelle Thorpe", "comment_text": "November. Less crowded. Better weather."}, {"username": "Phyllis Flowers", "comment_text": "September has been warming up in Italy. The thing is though it depends what you want to do. For beach fun you have to go in June, July and august they is when beaches are open. October is gorgeous light cloths maybe a jacket but Italy it big depends what part you are visiting"}, {"username": "Veronica Solimando-Lynch", "comment_text": "I’ve been in September and it was lovely."}, {"username": "Michael Messina", "comment_text": "Both"}, {"username": "Nancy McCracken", "comment_text": "Is there a travel agent/service who would help me plan an itinerary and drivers in each town?"}, {"username": "Retha Antoniello", "comment_text": "May is cooler as Sept is an extension of August. Sept is more crowded than May."}, {"username": "Mary Lou Gillen", "comment_text": "October. The best weather and less crowded. Things are calmer."}, {"username": "Shawn Hibbard", "comment_text": "We went September 11th - 23rd. Rome & Florence was high 90’s and Venice mid 70’s. It was beautiful."}, {"username": "Courtney Champagne", "comment_text": "How is early May? I leave May 6 for Amalfi and anticipating some rain if similar to last year"}, {"username": "Jenny Kendrick", "comment_text": "We went early june was great"}, {"username": "Artur Kiełbasiński", "comment_text": "Both months are a good choice, but September is less crowded, especially towards the end."}, {"username": "Elaine M Woodward", "comment_text": "How is the first week in March"}, {"username": "Yolanda Arena", "comment_text": "Either one, great months to be in Italy, great weather and less tourists"}, {"username": "Maria Arcadipane-Mojica", "comment_text": "I went last November we had perfect weather light sweater at night. We were in Naples and the Amalfi Coast"}, {"username": "Deb Burklund", "comment_text": "September was perfect weather when I went. Mid 70’s. It rained the first night and that was it.!"}, {"username": "Nicole Gangale", "comment_text": "September"}, {"username": "Sue Ietto", "comment_text": "Zasiah Ietto"}, {"username": "Sue Ietto", "comment_text": "Julie Figliomeni Frank Figliomeni"}, {"username": "Barbara Britschgi", "comment_text": "May you have the beautiful flowers lilac and blossoms and Fall the mild weather. And not the crowds."}, {"username": "Stevie Boombatz", "comment_text": "Both are great one is before the crowds and one is after the crowds"}, {"username": "Vivien C N Le", "comment_text": "May. September is still crowded and very hot in the last few years."}, {"username": "John Bruckman", "comment_text": "Both are great but if the two I’d go in May. Cooler…"}, {"username": "Paula LaBellarti", "comment_text": "September"}, {"username": "Vicky Pierro Altamura", "comment_text": "I went the last week of May and it was perfect."}, {"username": "Sharon Morey", "comment_text": "We are going 9/18-10/5. But getting hotels was tough in sorrento and Rome. Our travel agent found places but my requested ones were not available."}, {"username": "Casarine Temple", "comment_text": "We’re going mid September."}, {"username": "Dustin Zick", "comment_text": "May was wonderful!"}, {"username": "Heather Cohn", "comment_text": "September if you want warm summer like weather"}, {"username": "Sherri Leis Dillavou", "comment_text": "Anytime is great"}, {"username": "Frank Hunt", "comment_text": "June"}]}, {"id": "2212304132501998", "text": "Has anyone used Roman Roads Tours for the night golf cart tour in Rome? How was it?", "link": "facebook.com/groups/1373361046396315/permalink/2212304132501998/", "likes": 1, "comments": []}, {"id": "2212272559171822", "text": "Leaving for Italy in a month. Rome Florence Venice. I would love to do a food tour. Any recommendations? We are doing a cooking class in Florence. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2212272559171822/", "likes": 1, "comments": [{"username": "Sarah Miller Porter", "comment_text": "You should search it on the search bar at the top. someone recommended one in rome."}, {"username": "Susan Hulsey Watkins", "comment_text": "We did a cooking class in Rome with Local Aromas. I believe they also have some walking foodie tours Rome."}, {"username": "Shelley Frise", "comment_text": "Viator has a food tasting tour in Rome."}, {"username": "Adelaide Zietsch Robinson", "comment_text": "We just booked a food tour in Venice with Monica Cesarato! The cicchetti tour, really reasonably priced and she is absolutely amazing\n\nhttp://\nwww.monicacesara\nto.com/blog/"}, {"username": "Emma Chadwick", "comment_text": "We have done really good ones with secret food tours"}]}, {"id": "2212308565834888", "text": "Looking for recommendations for transportation from Florence to Tuscany (and back at a later date). We are not renting a car and would love options!", "link": "facebook.com/groups/1373361046396315/permalink/2212308565834888/", "likes": 2, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Florence/\nPrivate-500-Fiat\n-tour-in-Tuscan\ny-From-Florence\n/\nd519-30491P37?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "Gayle Moores", "comment_text": "You can take the regional train from Florence to the town you are going to and buy the tickets at the station at the Santa Maria Novella station machine that sells them in Florence.Just remember to validate the ticket at the yellow machine near the platform before boarding. You must validate or run the risk of a fine.Keep your tickets with you to show the conductor.Depen\nding where you are going to you may want to check online how far it is by train and you may need to transfer to a bus to get to the town you are going to especially in the wine regions. In that case you may better off getting private car service.Siena and Arezzo are both close to Florence within 1 hour away."}]}, {"id": "2212234865842258", "text": "Hello everyone i live in Trieste,Italy . could you please suggest me a tourist place (like 2 hours distance) without Venezia 😄", "link": "facebook.com/groups/1373361046396315/permalink/2212234865842258/", "likes": 2, "comments": [{"username": "Iby Sibyll", "comment_text": "Opatjia in Croatia"}, {"username": "Erica Senes Tombesi", "comment_text": "Cividale, small but very nice. And good restourant all.around. Lubljana, the capital of Slovenia."}, {"username": "Ville Lignell", "comment_text": "All of Istria, especially Rovigno."}, {"username": "Corina Cristea", "comment_text": "Grado, Treviso"}, {"username": "Mack Sperling", "comment_text": "Verona."}, {"username": "Stefano Bressanelli", "comment_text": "Palmanova and Aquileia\nGrado. Gorizia"}, {"username": "Cindy Sguazzin", "comment_text": "Aquilea!!! Fascinating!"}, {"username": "Ruth Green", "comment_text": "Udine, an easy day trip."}, {"username": "Maria Agius", "comment_text": "Ljubljana only about an hour away"}, {"username": "Laura Piccinini", "comment_text": "Tarvisio ? Sappada?"}, {"username": "Susana Stubbs", "comment_text": "Bled in Slovenia, which is gorgeous or Rovinj in Croatia which is wonderful too. Both within 2 h drive. Verona is fantastic if you’re happy to add 30 min to your journey. Have fun wherever you choose to go 😊"}, {"username": "Ike Simoncini", "comment_text": "Verona and lago di garda"}, {"username": "Kristina Moičevič", "comment_text": "I mean, Slovenia, of course. Piran, Postojna cave, Ljubljana, Bled, Goriška brda, Bohinj, Tolmin, Bovec, … so much to see ❤️"}, {"username": "Pao Magnoler", "comment_text": "Slovenia! Lake Bled."}, {"username": "Paola Aiello", "comment_text": "Aquileia, Grado, Isola della cona, Carnia, Fusine lakes, Istria, Padova, Vicenza...🥰"}]}, {"id": "2212237639175314", "text": "Hi lovely people myself and my husband and another couple are going to Sorrento for 3 nights in October. I have a list of questions, if anyone able to answer any I would be most grateful\n1. Must do things either there or close by and if you could include how best to get to them that would be a bonus\n2. Considering a boat trip-any recommendations,आणखी is there one that takes in Amalfi and capri, or would we need to them separately. Have seen some that include food and drink, but worried about food safety?\n3. Wondering about October weather, chilly in evenings?\n4. Any restaurant recommendations, have looked on trip advisor but a little conflicting\nThanks in advance to anyone that can help", "link": "facebook.com/groups/1373361046396315/permalink/2212237639175314/", "likes": 5, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Sorrento/\nSmall-Group-Capr\ni-Day-Cruise-fr\nom-Sorrento/\nd947-6530CAPRI?p\nid=P00070587&mc\nid=42383&medium\n=link&medium_ve\nrsion=selector"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Sorrento/\nPositano-and-Ama\nlfi-semi-privat\ne/\nd947-42612P6?pid\n=P00070587&mcid\n=42383&medium=l\nink&medium_vers\nion=selector"}, {"username": "Susan Hulsey Watkins", "comment_text": "If you’re an opera fan, do the Enrico Caruso museum & restaurant."}, {"username": "Alicia Burno", "comment_text": "We went to Capri, 2 days ago, and went to Amalfi Coast and Positano yesterday. Both by ferry from Sorrento. Your hotel can help you get the tickets."}, {"username": "Cindy Gallen Barton", "comment_text": "Restaurant, great food but they don't take reservations. Wait in line but is worth it"}, {"username": "Anita Clayton", "comment_text": "I would wait until you get to Sorrento before booking anything as the weather can be changeable. It isn't as busy as other months so you can book tours through local tourist offices or go down to Marina Piccolo and book your own. Leave yourselves time to chill and enjoy Sorrento."}, {"username": "Mary Anne", "comment_text": "Walk to Sant Agnello and watch the sunset from the little restaurant/bar at the end of Córso Marion Crawford"}, {"username": "Mary Anne", "comment_text": "The sunset at Sant’Agnello"}]}, {"id": "2212238655841879", "text": "Hi all,\nI will be staying in Rome near the Pantheon in September and would like some suggestions of some good restaurants. Any recommendations will be greatly appreciated.", "link": "facebook.com/groups/1373361046396315/permalink/2212238655841879/", "likes": 1, "comments": [{"username": "Marscha Fransisca Debora Basdew", "comment_text": "Try Google Maps ☺️\nI use it al the time"}, {"username": "Cindy Gallen Barton", "comment_text": "Fortunato al Pantheon. On the pricier side but very good seafood"}, {"username": "Amy French Baillie", "comment_text": "Head to Trastevere - wonderful choices and super pretty"}, {"username": "Mil Myvegas", "comment_text": "Osteria Da Fortunata in Campo de Fiore and have gnocchi (everything we tried was ama zing), Tonarello in Trastevere (carbonara). Try Trapizzino in Trastevere. For tiramisu go to Two Sizes. It’s way better than the hyped Mr. 100 Tiramisu. For gelato: Frigidarium. Enjoy!"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "L’Orso 80, near Piazza Navona. Authentic, not tourista."}, {"username": "Cindy Sguazzin", "comment_text": "So many wonderful suggestions!"}, {"username": "Linda Angrisano Boos", "comment_text": "Osteria Da Fortunato was great! They make your pasta fresh to order. Great carbonara sauce!"}, {"username": "Mackinzie Rekers", "comment_text": "All'Antico Vinaio for sure. Worth the queue. The Tartufo 3 was absolutely fantastic. Grab your sandwich and go sit on the steps in front of the Pantheon."}]}, {"id": "2212246739174404", "text": "Because so many have posted great pics from their visits to Italy that were taken by professionals, we booked one for our trip next week. We will be staying on Lake Garda for my birthday for 5 days. Pics will be taken in Sirmione. It’s the only thing we have planned. Anyone have any tips about the area? We’re staying in anAgritorisimo on the western side. Will most likely drive over to Verona for the day. A boat tour would be fun, too. Any and all thoughts are appreciated. ☺️", "link": "facebook.com/groups/1373361046396315/permalink/2212246739174404/", "likes": 2, "comments": [{"username": "Temponi Luca", "comment_text": "You could visit my City!\nBrescia! Is a small city but it has UNESCO roman domus and temple! Try to search “ santa giulia museum Brescia “ the visit it s 2/3 h long if I don’t wrong.\nThen we have an awesome castle 🏰 and 3 bug squares connected toghether, from garda/brescia you can also go to have a visit to Franciacorta ( where we make sparkling wines like champagne 🍾 )\nIf you need other tips or if you have questions just write me!"}, {"username": "Kejdi Okej", "comment_text": "Thank you l ♥️we are staying in tignale . We will definitely check out your city l"}]}, {"id": "2212250859173992", "text": "Hi, we have almost got our 3 week trip finished. Just stuck on that last touches. We want to save as much travel time as possible. What are the best private Venice transfer companies?\n\n- Treveso airport TSF to Ramo Grimani area. We found one company and their quote was 180€\nI wanted to just get the ATVO bus to Piazzale Roma but partner is worriedआणखी about finding a taxi to our accommodation.\n\n- & our flight out at Marco Polo VCE airport is at 9:30. We have to be there 3 hours early is that correct? So we will need transportation from Ramo Grimani area to that airport at 6am.\n\nWould love everyone’s recommendations so I can finally turn my brain off! Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2212250859173992/", "likes": 0, "comments": [{"username": "Cara Wills", "comment_text": "We used mydaytrip website for a few transfers and they seemed to have the best price and great drivers! No issues whatsoever."}, {"username": "Kejdi Okej", "comment_text": "We used mydaytrip website for a few transfers and thry seemend ti have the best price and great drivers l no issues whatsoever ."}]}, {"id": "2211706872561724", "text": "Has anyone been to the Etruscan Museum in Rome? About how long should I plan to tour it? This is a must on my daughter's wish list.", "link": "facebook.com/groups/1373361046396315/permalink/2211706872561724/", "likes": 1, "comments": [{"username": "Edoardo Casolo", "comment_text": "Which one?"}]}, {"id": "2212254885840256", "text": "Hello all! I’m new to the group and am going to Italy in early November. I’m trying to find some reviews on Trafalgar’s Italian Holiday tour. Any comments are welcome.😊", "link": "facebook.com/groups/1373361046396315/permalink/2212254885840256/", "likes": 0, "comments": []}, {"id": "2212261599172918", "text": "Has anyone done the Vespa tour or Fiat 500 tour with Walkabout in Florence? Do they both meet at the same restaurant for lunch? I'm not brave enough to ride a Vespa but my son wants to so I thought I could book the Fiat 500 tour instead, both leave at the same time but I assume may take different routes. 🤔 Many thanks", "link": "facebook.com/groups/1373361046396315/permalink/2212261599172918/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Florence/\nPrivate-500-Fiat\n-tour-in-Tuscan\ny-From-Florence\n/\nd519-30491P37?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}]}, {"id": "2212270612505350", "text": "We are very experienced world travellers currently in Rome. Wearing travelon crossbody bags on our chests. Always very aware of our surroundings and one hand on our crossbody bags. We were at the Trevi fountain this afternoon and a guy actually grabbed my husband’s arm(his hand moving down my husband’s arm)…I yelled “don’t touch him” and myआणखी husband pulled his arm away. As my husband was wearing a watch we can only assume the guy was trying to take it.\nThis is NOT to frighten anyone—but simply a reminder to be very careful in crowds. It happens so fast.", "link": "facebook.com/groups/1373361046396315/permalink/2212270612505350/", "likes": 49, "comments": [{"username": "Fay Waterberg", "comment_text": "And watch for the “games” guys on the street. They try to get everyone watching them while another person interacts with the crowd all the while giving them pats of encouragement. Eventually you become accustomed to the touching and that is when they lift your wallet or something else out of your bag. Didn’t happen to us but saw it beginning to happen with an unsuspecting tourist. The other scam is someone will flip a coin in front of you and if you fall for this to pick it up they will go for your pockets. These are all distractions so just be aware."}, {"username": "Monica Moore", "comment_text": "During our 7 hour walking tour in July our guide cautioned us about not having anything in our back pockets and to be aware of who was near us before we got to Trevi Fountain. It was so, so crowded. None of us had any problems."}, {"username": "Annof RedGables", "comment_text": "So blatant!"}, {"username": "Maria O'Callaghan", "comment_text": "I have been concerned about my IPhone watch & was wondering how I could secure it.\nAny suggestion fellow travellers?"}, {"username": "Felicia Guerrero-Mercado", "comment_text": "Es Jonaa"}, {"username": "Kimberly Lewis", "comment_text": "Does this happen more in specific parts of Italy? That’s scary. I’ll be in Milan in a few weeks."}, {"username": "Michelle Evans", "comment_text": "Ashleigh Bennett the Trevi fountain 😞"}, {"username": "Serenna Davies", "comment_text": "Also be careful on trains. We were 3 women on the train from Venice to Padua. 3 teenage girls got on at the same time. They distract one and then try to take from the other. One took something out of my shoulder bag but of no use so ended up by my seat. My passport, phone and money were in a v small purse bag around my neck."}, {"username": "Jan Armstrong", "comment_text": "Yes distractions on trains and metros. Sometimes women together , pushing up next to you as you get on, although the carriage is not busy. This was nr Collosseo. And on the trains , with pushchairs needing help and they are looking for bags/ rucksacks you put Under the seat in front"}, {"username": "Keri Catoe", "comment_text": "Same thing happened to my husband at Pisa. Guy was walking towards us and his hand very purposefully brushed against my husbands arm, which it was obvious he was going after his Apple Watch. My husband noticed quickly enough to react but if he had not been paying attention and looking around at other things, his watch would most likely be gone. Also a lady holding a coat over her arm stood next to me on the train in Rome, very close. I knew that it was 110 degrees out and this lady had no business carrying a heavy coat over her arms and did not need to be standing so close to me. I grabbed my phone and Fanny pack and held it to my other side away from her and moved away from her. When we got off the train she moved her arm and she had a bag underneath the coat, as if it was ready to put whatever loot she got into it. She didn’t get anything from me but I guarantee you she got others if they didn’t notice the coat. Things that look out of place, like someone holding an umbrella in the shade or a distraction causing people to look is all it takes. They are quick and they are good at it. Even kids are used as part of the distraction."}, {"username": "Tony Indorato", "comment_text": "Wow. Three weeks in Sicily and the mainland and we never felt threatened. We travel to Latin America often and the same there. It’s all about situational awareness. Be aware of your surroundings and act accordingly and you will be fine."}, {"username": "Steph Coombes", "comment_text": "Good post with positive comments.\nAs you say be aware x"}, {"username": "Elizabeth Brown Atkinson", "comment_text": "We were there and absolutely watching what was going on. I was surprised it wasn’t as busy as I thought .. be safe and just pay attention to people near you"}, {"username": "Holly Clifton", "comment_text": "Yes, they are very sneaky at creating a distraction so they can cut the straps of your bag or steal your belongings. Glad you are both safe and still have everything."}, {"username": "Linda Damke", "comment_text": "When my sister and I approached our train on the platform at Venice Santa Lucia's train station two men about 40 years old dressed in black grabbed our luggage and placed them in train. They then demanded 20 euros. I asked what for and was told for a tip. I said no 5 euros and they said no and stood their ground until we paid 20 euros. They came from behind us and knew no one else was near us or on that train carriage. They took advantage of us as we are women in our late 60s. My sister said put it down to experience. Never has this happened to us elsewhere. Be aware of your surroundings. 🙏"}, {"username": "Frances Pergoliti Lapa", "comment_text": "Natalia Lapa Eva Rose Bella Pergoliti"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 8, "comments": []}, {"id": "2212278082504603", "text": "Hello fellow travelers, when buying tickets for the Pantheon in Rome, is it easy enough to buy them at the entrance or is it best to pre purchase online.\nIf so does anyone have the website link pls.", "link": "facebook.com/groups/1373361046396315/permalink/2212278082504603/", "likes": 0, "comments": []}, {"id": "2212279812504430", "text": "Any tips for vegan restaurants in Milan and Venice? :)", "link": "facebook.com/groups/1373361046396315/permalink/2212279812504430/", "likes": 4, "comments": [{"username": "Bing Robertson", "comment_text": "Have you checked happy cow?"}, {"username": "Diane Gordon", "comment_text": "I’m in Venice now. La Tecia Vegana looked amazing but it was too far for us. We ate tonight at Ristorante Da Mario Alla Fava; they have a beautiful vegan menu, including desserts. I had an appetizer and main course and they were both divine. Sad to have gotten too full and not able to try their dessert.\n\nI didn’t find this restaurant on Happy Cow. I use it a lot but it hasn’t been too helpful here for some reason."}, {"username": "Alicia Boldreghini George", "comment_text": "I think La Zucca can accommodate you"}, {"username": "Robýn Kretsçhmər Schuchårdt", "comment_text": "Following"}, {"username": "Valentina Di Francesco", "comment_text": "For Milan you can see the blog www.vitadasani.\nit with a selection of best veg"}]}, {"id": "2212283289170749", "text": "Looking for recommendations for a nice, boutique like hotel in Florence.", "link": "facebook.com/groups/1373361046396315/permalink/2212283289170749/", "likes": 9, "comments": [{"username": "Sandy Radican Shikaly", "comment_text": "Hotel Brunelleschi❤️"}, {"username": "Lisa Wagonfeld", "comment_text": "The Lungarno is wonderful."}, {"username": "Linda Snyder Shandle", "comment_text": "Hotel Kraft."}, {"username": "Suzi Gioffredi Lincoln", "comment_text": "Hotel Torre Guelfa..❤️"}, {"username": "John Bruckman", "comment_text": "Hotel Della Signoria"}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "Casa G! Stylish and modernly exquisite. Perfect location"}, {"username": "Pamela Meers", "comment_text": "Definitely Hotel Locarno!!!"}, {"username": "Anna Buchan", "comment_text": "Hotel luxor florence"}, {"username": "Carmen Higham", "comment_text": "Hotel della Signoria…."}, {"username": "Michelle Ann", "comment_text": "Velona’s Jungle is so fabulous!"}, {"username": "Paula Brink", "comment_text": "The Place is fabulous. (Used to be JKPlace)\n25 Hours Firenze is a fun, quirky hotel."}, {"username": "Tanya Ramsey", "comment_text": "Hotel paris xx"}, {"username": "Fay Waterberg", "comment_text": "Hotel Hilda. It is a 15 minute walk from the train station and a couple of blocks from the Duomo and you can walk anywhere from here. Wonderful management. Suite is gorgeous and only 3 suites per floor."}, {"username": "Kellee Fullerton", "comment_text": "Hotel Monna Lisa"}, {"username": "Susana Stubbs", "comment_text": "We’ve been to Florence several times and absolutely loved staying at Velonas Jungle Luxury Suites. You’ll get a better price if you contact them direct rather than booking via a third party agency. Everything about this place is amazing and the owner is fantastic. Take a look at the reviews on Booking.\nhttps://\nwww.velonasjungl\ne.com/"}, {"username": "Mirsada Miki Mikica", "comment_text": "We loved Hotel Machiavelli Palace Florence"}, {"username": "Heather Anderson", "comment_text": "Hotel Covington!"}, {"username": "Maria Manera", "comment_text": "Hotel du Sage"}, {"username": "Daniella Grossman Kreiner", "comment_text": "Relais Santa Croce. We stayed there recently and loved it so much."}, {"username": "Rosa Morabito", "comment_text": "Porta Rossa"}, {"username": "Ginny Reardon", "comment_text": "'The Frame' is great and conveniently located"}, {"username": "Emma Cross", "comment_text": "Hotel Paris"}, {"username": "Kris Keeney Nakanishi", "comment_text": "Hotel ‭Berchielli ‬https://\nwww.berchielli.i\nt/en"}, {"username": "Minoo Behzadi", "comment_text": "Hotel Principe"}, {"username": "Cory Moody", "comment_text": "Will be staying in boutique hotel arte on the 20th . Will let you know how it is"}, {"username": "Rakhee Patel", "comment_text": "Def this one. Very central too\n\nhttps://\nfirenzenumbernin\ne.com/"}, {"username": "Sammii Fletcher", "comment_text": "Serristori Palace Residence this place was amazing. Across the river but only a short walk from everything. Quiet peaceful very clean highly rated."}, {"username": "Laura Pagnozzi", "comment_text": "Hotel Kraft"}, {"username": "Debbie Salmon", "comment_text": "Palazzo Alfieri was lovely. Beautiful room and great location"}, {"username": "Jessica Beghtel", "comment_text": "We just stayed at Hotel Balestri. Very nice and great location.\n\nhttps://\nwww.hotel-balest\nri.it/\n?utm_source=gbp&\nutm_medium=orga\nnic"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.dpbolvw.net/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187895-d5148\n17-Reviews-Bout\nique_Hotel_in_P\niazza_della_Sig\nnoria-Florence_\nTuscany.html"}, {"username": "Mat PO", "comment_text": "Portrait."}, {"username": "Stacy Derouin", "comment_text": "Firenze Wellness Nine"}, {"username": "Jacqueline Cree", "comment_text": "We stayed in Degli Orafi right next to the Ponte Vecchio. Beautiful. And it has a small rooftop area for drinks with views."}, {"username": "Plane Shummer", "comment_text": "We stayed here. Rate it highly."}, {"username": "Barbara Pasteris Allen Hettlinger", "comment_text": "Very nice small hotel and great location.https://\nwww.relaisuffizi\n.it/"}, {"username": "Lisa McMurchie", "comment_text": "Lisa McMurchie"}, {"username": "Lyndsey Ryan", "comment_text": "Horto Convento ❤️"}, {"username": "Caryn Goode", "comment_text": "The Realis Uffizi."}, {"username": "Karen Cervi", "comment_text": "Karen Cervi"}, {"username": "Steve Watkins", "comment_text": "Alfieri"}, {"username": "Steve Watkins", "comment_text": "Steve Watkins"}, {"username": "Jason Hobel", "comment_text": "We stayed at Porta Nera. It was in a quiet area and not that far of a walk to the city center"}, {"username": "Karen Dwyer", "comment_text": "Loved Boutique Hotel Hugo"}]}, {"id": "2212287375837007", "text": "Hello all..where to stay in Milan? Not touristy area around local restaurants and shop budget $300-350 a night..thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2212287375837007/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.dpbolvw.net/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187849-d2758\n01-Reviews-Gran\nd_Visconti_Pala\nce-Milan_Lombar\ndy.html"}, {"username": "Francesca Giovanelli", "comment_text": "I suggest you to stay in the center, so you can walk around easily"}]}, {"id": "2212298685835876", "text": "Whats the Best place to Go on a Cruise to Italy? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2212298685835876/", "likes": 1, "comments": []}, {"id": "2212305139168564", "text": "Hello!\nI am new to this group and the reason I joined is that we are going on the trip to Italy soon. Can you recommend a tour guide in Amalfi coast who you used and liked. Not sure what’s better and give us more flexibility ( by sea or by land or combination). Budget friendly. We are travelling with three kids 16 month, 9yo and 17 yo. Would really appreciate help here! Thank you!🤞", "link": "facebook.com/groups/1373361046396315/permalink/2212305139168564/", "likes": 0, "comments": [{"username": "Alicia Burno", "comment_text": "We were in Amalfi Coast yesterday and got there by ferry. We didn’t take a tour because we spend the day at the beach but there are kiosks offering tours right outside the ferry."}, {"username": "Kejdi Okej", "comment_text": "Thank you so much 🤗"}]}, {"id": "2212310642501347", "text": "So confused. We are in Rome in October on a Friday through Sunday. We are staying in Borgo Pio. Trying to plan out itinerary. Any advice on how to best plan our days? Which days do you recommend doing Vatican/St Peter’s and colosseum? There are so many options on how to visit Vatican and St Peter’s. Many tour options. Get your guide, Viator. What do you recommend? You can also book right through their website. How did you tour Vatican and St Peter’s? Did anyone do on their own? Any help is so greatly appreciated!", "link": "facebook.com/groups/1373361046396315/permalink/2212310642501347/", "likes": 0, "comments": [{"username": "Jeff McLellan", "comment_text": "We specifically chose to book directly with the Vatican Museums and do the Prime tour with breakfast after at 7:30am to avoid crowds is was amazing and well worth it."}, {"username": "Jenny Payne", "comment_text": "I would do it your self with head phones + I usually tell people to go in the afternoon as I find it less crowded. I go to Italy a lot + I walk to all the sites as I stay near the termini and it’s not difficult with google maps, plan your day as your not in Rome that long. Wear the best rubber soles sneakers or leather sandals + a crossbody bag + a jacket if it gets cool at night. I’m showing a girlfriend around October + early November. It has become very busy at this time of the year since Covid 🌻"}]}, {"id": "2212314519167626", "text": "Gaeta, Italy🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2212314519167626/", "likes": 13, "comments": []}, {"id": "2212329275832817", "text": "I’ve seen a lot of tours getting cancelled last minute. Looking to book a tour of the Colosseum with either LivTours or GetYourGuide. Which would you all recommend??", "link": "facebook.com/groups/1373361046396315/permalink/2212329275832817/", "likes": 2, "comments": [{"username": "Kevin Wilkins", "comment_text": "We loved Chiara Antonelli Tourist guide. Very personalized, she knows it all and is a blast to tour with! I’ll bet she’d never cancel either :)"}, {"username": "Michelle Bergman Davis", "comment_text": "We used Get Your Guide. Our tour was bumped to later in the day, but not cancelled. And our guide was fantastic! We did the underground tour. Highly recommend!"}, {"username": "Shelley Frise", "comment_text": "We used Viator and they where great"}, {"username": "Brian Osman", "comment_text": "The actual website for the venue, not a 3rd party"}]}, {"id": "2212335032498908", "text": "Can anyone recommend a boat tour company reasonably priced in Vietre Puglia for a private or small tour", "link": "facebook.com/groups/1373361046396315/permalink/2212335032498908/", "likes": 0, "comments": []}, {"id": "2212340355831709", "text": "Do taxis run along the Amalfi coast past 10 pm? I've read that buses don't. If we were to be frequenting a bar in Positano until say, 12 a.m., would we be able to catch a taxi back to Amalfi?", "link": "facebook.com/groups/1373361046396315/permalink/2212340355831709/", "likes": 1, "comments": [{"username": "Jenny Payne", "comment_text": "At a cost 🌻"}]}, {"id": "2212342955831449", "text": "Hi all! Question I am hoping someone can help us with… We are currently in Pompeii and will be heading to the Amalfi Coast tomorrow. We are staying in Agerola (the town at the very beginning of the Path of Gods). Does anyone have advice on how to get to Agerola from Naples? I heard there is a direct bus but have found no information online…thanks in advance!! :)", "link": "facebook.com/groups/1373361046396315/permalink/2212342955831449/", "likes": 1, "comments": [{"username": "Alicia Burno", "comment_text": "We are staying in Sorrento now, yesterday went to Amalfi Coast by boat."}, {"username": "Helen Ladkin", "comment_text": "Check with your accommodation."}, {"username": "Stephanie Osborn Rushing", "comment_text": "We used a private driver to pickup from Pompeii and take to hotel in positano. I spent a ton of money on private transfers this last week in Italy, but it has been convenient and no cancellations and given me sound of mind"}]}, {"id": "2212354412496970", "text": "Hi, I have a night tour to Colosseum tonight and 10 pm, wondering if anyone can recommend a reasonable priced but great food in the Colosseum area near Valadier gate.\nMany thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2212354412496970/", "likes": 1, "comments": []}, {"id": "2212346592497752", "text": "When do trains typically go on strike? We need to take a train from Rome to Civitavecchia the end of October to catch a ship for a transatlantic cruise. TIA", "link": "facebook.com/groups/1373361046396315/permalink/2212346592497752/", "likes": 1, "comments": [{"username": "Carrie Teller Badger", "comment_text": "I learned on this site that you enter scioperi.mit.go\nverno.it and you can see the schedule."}, {"username": "Lorraine Swick Sanfilippo", "comment_text": "Are rail strikes a normal thing in European countries"}, {"username": "Brenno Bianchi", "comment_text": "Sometimes on Friday, but on commuting hours public transport is guaranteed by law"}, {"username": "Helen Ladkin", "comment_text": "Use a private transfer."}, {"username": "Charlie Charnigo", "comment_text": "Seems like they are a regular thing, but do they actually accomplish anything other than inconveniencing\nthe masses?"}, {"username": "Cat Furness", "comment_text": "Get the Trenìt app, it shows the upcoming strikes."}, {"username": "Julie Norris", "comment_text": "There's one on October 20 the day I arrive in Rome so I've booked the shuttle bus through get your guide"}]}, {"id": "2212352102497201", "text": "Off to Turin & Milan in December for a quick trip, does anyone have any recommendations for Turin?\n\nWe will be taking our young daughters (ages 3 & 9) ☺️\n\nWe will obviously be visiting the Duomo in Milan too ⛪️\n\n❤️", "link": "facebook.com/groups/1373361046396315/permalink/2212352102497201/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "don't miss to visit the Egyptian museum!"}, {"username": "Antonio De Feudis", "comment_text": "You could visit the \"Mole Antonelliana\" and the National Museum of Cinema inside it, i still remember when i went there with my school, i think your kids will like it :)"}]}, {"id": "2212365119162566", "text": "Can someone please tell how to get to from the port of Naples to the nearest Funicular? Is there a long/steep walk. Some in my group are unable to walk long distances. Thanks for any information/advice.", "link": "facebook.com/groups/1373361046396315/permalink/2212365119162566/", "likes": 0, "comments": []}, {"id": "2212386622493749", "text": "If I'm taking an intercity train (Monterosso to La Spezia) and then get on Trenitalia or Italo train (to Naples), do I have to purchase separate tickets?", "link": "facebook.com/groups/1373361046396315/permalink/2212386622493749/", "likes": 0, "comments": [{"username": "Laura Uribe", "comment_text": "Yes unless your original ticket is from Monterosso through to Napoli Centrale. There is at least 1-2 train changes."}, {"username": "Alicia Burno", "comment_text": "Yes"}]}, {"id": "2212372669161811", "text": "Curious if anyone has used Drivalia Italy rental cars out of the Florence airport? There prices are considerably lower than anyone else which makes me a bit nervous.", "link": "facebook.com/groups/1373361046396315/permalink/2212372669161811/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Florence/\nFlorence-Private\n-Transfer-from-\nor-to-Florence-\nAirport-Train-S\ntation-and-Hote\nl/\nd519-71989P11?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "Teresa Brewer Harkins", "comment_text": "F"}, {"username": "Kejdi Okej", "comment_text": "F"}]}, {"id": "2212388599160218", "text": "Are the Adriatic towns of Rimini Milano maritimma riccione dead in early October ? Will restaurants shops be open", "link": "facebook.com/groups/1373361046396315/permalink/2212388599160218/", "likes": 0, "comments": [{"username": "Manuela Bassetti", "comment_text": "Rimini is a bigger city with people living there all year, Riccione and Milano Marittima are smaller, but shops and restaurants are open, and it’s more likely to find fresh fish, the fishing season in the area is closed during the summer. If you want to go to the beach it’s not a good time, beach resorts are closed"}, {"username": "निनावी सहभागी", "comment_text": "👍"}, {"username": "निनावी सहभागी", "comment_text": "👍"}]}, {"id": "2212380975827647", "text": "So excited to have found this site!!\nThanks for all the info!\nI am planning a special 50 th anniversary trip with my family and would like to use your expertise in arranging things.\nMy goal is to rent a villa ( there are 12 adults in the group) in Florence/ Tuscany area for 5 nights. I would love a guide and a cook to help with things. We would Sight -see day trips in Florence area. Then head to Rome for 3 nights and tour that area. We would stay at a hotel or apartment there. Any suggestions or recommendations would be greatly appreciated.", "link": "facebook.com/groups/1373361046396315/permalink/2212380975827647/", "likes": 2, "comments": [{"username": "Agnese Arnó Ch-Ch", "comment_text": "There are many villas around Florence, try to check on VRBO or Airbnb (superhosts) if you find something you like with the characteristics\nyou need (12 people, pool? distance from center?), the owner can help you arrange somebody to cook and drive and day trips."}, {"username": "Michael Broadwater", "comment_text": "A lot of villa owners will either cook for you or a chef is available, both for an extra charge."}, {"username": "Valerie Collanton", "comment_text": "We stayed at Villa I Guillari in the Florence Hills. Great location. Villa was very nice. Check the Tuscany Now and More website. You can book private chefs and tours"}, {"username": "Kejdi Okej", "comment_text": "A lot of villa owner will either cook for you or a chef is available , both for an extra charge."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 8, "comments": []}, {"id": "2212337989165279", "text": "Could you provide recommendations for a 12-day itinerary in Italy for October or November? Also, I've heard that the Amalfi Coast might have closures during that time, so we're considering alternatives.", "link": "facebook.com/groups/1373361046396315/permalink/2212337989165279/", "likes": 0, "comments": []}, {"id": "2212343845831360", "text": "What are the best activities to do in Varezze at the end beginning of September? Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2212343845831360/", "likes": 0, "comments": []}, {"id": "2212322555833489", "text": "Recommendations for hotel very near Fiumicino Airport in Rome offering shuttle service. Have an early flight and want to be nearby. Thank you fellow travelers 🙏", "link": "facebook.com/groups/1373361046396315/permalink/2212322555833489/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.jdoqocy.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g799531-d1491\n6730-Reviews-Fl\ny_Deco_Hotel-Li\ndo_di_Ostia_Pro\nvince_of_Rome_L\nazio.html"}, {"username": "Susan Hulsey Watkins", "comment_text": "We stayed at a Hilton Garden Inn very close to the airport the night before our flight. Shuttle service was prompt and efficient."}, {"username": "Kejdi Okej", "comment_text": "Thank you as l looked at that one yesterday and most likely will go with them since l am a hilton member . I wanted to do more of a mom and pop nearby to sopport the shuttle service."}, {"username": "Stephen Henn", "comment_text": "Hotel Tiber has a shuttle for 6-8€. It’s about a 10-15 minute drive from the airport. Affordable and on the Tiber River. We always stay there when flying out of FCO. They also have a bar and restaurant onsite."}, {"username": "Charlie Charnigo", "comment_text": "Well the airport has a Hilton in it. So you just take the elevator down to the airport. Can’t get much closer or easier than that."}, {"username": "Gay Bell DiBartolomeo", "comment_text": "Recommend the Hilton that is connected to terminal."}]}, {"id": "2212287389170339", "text": "I need some Help with navigating Please and Thank You.\n\nMy husband is blind and he’s taking me all the way to Taormina, Sicily to see Andrea Bocelli.\n\nI’ve done all kinds of google searches but need some adviceआणखी regarding tours that you’d actually recommend vs the ones that you would pass on.\n\nWe LOVE historical /archaeological sites/ wineries/ interested in the godfather tours and Mt. Etna. I say tour’s because that is just easier for us to get around and the guides are always great assisting my husband if needed.\n\n***Easiest way to get from Catania Airport to Taormina? (Keep in mind I don’t speak or read enough Italian to get by)***\n\nAny must see sites around town?\n\nWe are foodies so any recommendations that don’t break the bank but definitely don’t want to pass up?\n\n(Pic of husband with Raspberry Jalapeño Cotton Candy so we don’t get lost in the mix)", "link": "facebook.com/groups/1373361046396315/permalink/2212287389170339/", "likes": 63, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Catania/\nPrivate-and-Excl\nusive-Taxi-Tran\nsfer-from-Catan\nia-to-TAORMINA-\nor-viceversa/\nd22664-66221P23?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}, {"username": "Vanessa Dunn Jordan", "comment_text": "I use the Translate Now app. It’s so easy and worked great last year when I was in Italy. However tour guides and people in cities usually speak some English."}, {"username": "Rosemary Giuffre", "comment_text": "Are u going to the September 1 concert?"}, {"username": "Sergio Milone", "comment_text": "Get on interbus bus(or etna, is the same company) from Catania airport to Taormina (bus terminal), bus terminal is 2 minute walking distance to the Taormina city center, 5 minute walk for the Greek theatre.\nDon’t use the train because Taormina/\nGiardini train station is 15 minute drive to city center so you will need to get on a crowded local bus or on a taxi."}, {"username": "Starla Dawn", "comment_text": "Easiest way is a Private Driver"}, {"username": "Starla Dawn", "comment_text": "I was just in Taormina in June and had a private driver from lane side of Lipari Sicily to Catania airport. He was wonderful stopping in Taormina scenic route, no stress."}, {"username": "Alexis Anderson", "comment_text": "raspberry jalapeno cotton candy sounds delicious 😋"}, {"username": "Emily Clark", "comment_text": "Check out Google lens for translation of signage"}, {"username": "Terri Brinkman", "comment_text": "I hope you both have the time of your lives! 🙏"}, {"username": "Kejdi Okej", "comment_text": "Check out google lens for translation of signage"}, {"username": "Ike Simoncini", "comment_text": "As half sicilian foodie i can tell you that your going to heaven:) There are no pure tourist traps in sicily but still best places to eat are where the locals go,Up in the mountains and most of the time not in the crowded places in the center. The food is various from meat to fish everything is there. The tunna dishes are great but also try the sword fish Look for \"involtini pesche spada\" thats a typical siclian dish. Look for \"panne pannele\" thats typical street food and if you like sweet you MUST try canolli or casatta both made out of ricotta. You can get them everywhere but make no mistake the onmly real ones are from sicily."}, {"username": "John Ronayne", "comment_text": "Hello I messaged you with some good info"}, {"username": "Kara Whitehead Wilde", "comment_text": "In Taormina go the Bam Bar for the best granita and brioche ever!! This is Sicilian granita not slushy drinks in like in other places"}, {"username": "Sara Gillespie", "comment_text": "You must check out the agri-tours. Food is sublime and the atmosphere is heavenly."}, {"username": "Marimar Hernandez", "comment_text": "Interbus to Taormina it leaves you in the middle of the city. The amphitheater is a must and so is Isola bella"}, {"username": "Tara Steinhoff", "comment_text": "O"}, {"username": "Terri Johnson", "comment_text": "The app Rome to Rio will get you anywhere in the world you need directions and it will give you all the possible ways to get there and average cost"}, {"username": "Vicki Counter Fearn", "comment_text": "Don’t be stressed. Spent 3 weeks in Italy and almost everyone spoke English. We had no problems."}]}, {"id": "2212396845826060", "text": "Hi, I just need advice . ￼￼ is it possible to walk around in Rome and see the Colosseum, Trevi fountain, and the pantheon all in 4 hours? ￼ I like to walk around, and I don't know if I need to pay for a tour? ￼￼ the tours on Viator seem pretty expensive. ￼ Can I do it on my own￼?", "link": "facebook.com/groups/1373361046396315/permalink/2212396845826060/", "likes": 83, "comments": [{"username": "Tilla Olivier", "comment_text": "Very doable on your own. Use a good map and work out the most strategic way to cover all."}, {"username": "Trevor Ian Wright", "comment_text": "You could use the hop on bus it goes to all the sites"}, {"username": "Vicki Mattia Martin", "comment_text": "Yes! Absolutely yes!"}, {"username": "Rosann Nadle Maher", "comment_text": "Kimberly Larson Wittman"}, {"username": "Kathleen Lunz-Gewirtz", "comment_text": "Following"}, {"username": "Laura Tew", "comment_text": "No!"}, {"username": "Catherine AleXandra", "comment_text": "The walk is very doable. Trevi is 30 min walk from colosseum. But the lines to get in will eat to forum / colosseum will kill all your time without a skip the line / tour. Pantheon line on a weekend was crazy without tickets. I think the tour money is worth it for peace of mind. With a tour guide you just go right in without waiting."}, {"username": "Ashley Poland", "comment_text": "We walked everywhere and didn't pay for a tour. Just have great shoes, waterbottle, sunscreen and a backpack"}, {"username": "Karen Dittman", "comment_text": "I could"}, {"username": "Roseann Vignieri-Mizrahi", "comment_text": "Yes as every above already mentioned all very doable. I just came back from Rome, and was only there two days and I saw it all. The only thing I booked was the Vatican, Sistine chapel. But not as a tour I just bought the ticket so I could avoid the line to get in. Other than that, my hotel was within walking distance of the coliseum and we did that at about 11pm, when the torture heat was over. Granted we didn’t/\ncouldn’t go inside, but I was good just walking around the perimeter as I got to see and explore so much with nobody around. The Trevi fountain, pantheon, and Spanish steps, I took a cab into the square and walked it from that point, stopping along the way to eat, window shop, coffee break. I enjoyed Rome in my way, and hope you find your way as well with everyone’s advice."}, {"username": "Jenny Payne", "comment_text": "You can but not in four hours ,won’t see much. Look at RometoRio site and work out the distance 🌻"}, {"username": "Margaret Anne McCormack", "comment_text": "Early risers get the best views. The tourist groups appear at 10"}, {"username": "Margaret Anne McCormack", "comment_text": "There’s different coloured pavers .Find them and it’s easy. I was there for 7 days before it dawned on me."}, {"username": "Margaret Anne McCormack", "comment_text": "The railway loops between Vatican and steps. That’s an easy path to follow."}, {"username": "Megan McGlinchey Corbo", "comment_text": "Totally doable!"}, {"username": "Abby O'Mara", "comment_text": "Yes you can I did it last week same itinerary walked the whole thing it was fab. Was buggered buy the end but was worth it!! My starting point was also a few km to pantheon 😊 enjoy"}, {"username": "Sue Policicchio", "comment_text": "Domenic Policicchio III\nAngelo Policicchio"}, {"username": "Natalie de Gray", "comment_text": "Yes you can"}, {"username": "Jeanne Zorich", "comment_text": "Yes"}, {"username": "Jymie Sam Totiel", "comment_text": "Mark Totiel"}, {"username": "Nina Colannino", "comment_text": "Yes, map it out."}, {"username": "Mike Alioto", "comment_text": "Yes"}, {"username": "Dianne Bulbrook", "comment_text": "Just returned from Rome now in Florence\nWalk about in Rome is fantastic\nAnd not doing a tour is great"}, {"username": "Andrea Brown", "comment_text": "Yes. go to the colosseum early. The pantheon and trevi are within walking distance and a “quick” visit."}, {"username": "Yvette Pavone", "comment_text": "Yes"}, {"username": "Debs N Booth", "comment_text": "We did the hop on hop off bus it’s very reasonable and you see all the sites with the commentary"}, {"username": "Bob Schlessinger", "comment_text": "My wife and I did it with out any problem"}, {"username": "Adeline Alex Tanfara", "comment_text": "You can do all that except for the Vatican You could spend four hours in there and the wait as long. ￼"}, {"username": "Brandi-Lee Rice", "comment_text": "Yes absolutely. We did it and was nice not being in part of a tour group. Way less stressful and way cheaper."}, {"username": "Kimberley Gray", "comment_text": "HOHO"}, {"username": "Sandy Kemnitzer Fritchie", "comment_text": "Highly recommend golf cart tours"}, {"username": "Maggie Manger", "comment_text": "Yes"}, {"username": "Jaime Cleek", "comment_text": "Yes"}, {"username": "Phyllis Snyder", "comment_text": "Yes I think that’s doable- I’d skip actually going into the colosseum the outside is just as interesting- time waiting in lines will eat up your sight seeing."}, {"username": "Jaime Cleek", "comment_text": "You need to prebook colosseum. Pantheon you may have a line but you can pre buy a ticket"}, {"username": "Donna Watson", "comment_text": "We walked it all, took us about 8 hours and 10 miles of walking"}, {"username": "Robert Stone", "comment_text": "Yew"}, {"username": "Missy Cathcart Thurlow", "comment_text": "It will be hard and tiresome"}, {"username": "Melinda Giuffre", "comment_text": "It is possible… I did that on my last day in Rome"}, {"username": "Richelle Trezise", "comment_text": "Not if you want to have a good look and take it all in"}, {"username": "Shelly Kentner Lehman", "comment_text": "I’d do it on your own"}, {"username": "Kelly Casper", "comment_text": "I need you in my life! My twin sister and I head over in a couple of weeks and I’m still trying to get the plan together!"}, {"username": "Helen Brazeau", "comment_text": "Absolutely! Although these days there may be tickets required for entry but the walk from one to the other is doable if you don’t have physical restrictions"}, {"username": "Erika Kl", "comment_text": "Yes, but you can take the metro to the colosseum and the Terri fountain which will make it much faster"}, {"username": "Judy Miller", "comment_text": "Yes, just do it!"}, {"username": "Tina Moreman Hunter", "comment_text": "You definitely don’t need a tour. We walked everywhere ourselves in Rome. Just map out your route in a way that you pass by the most sites, but at least double or triple the time to give yourself a chance to go inside the Pantheon, take pictures, etc. Based on the places you mentioned, be sure to add in the Spanish steps and stop along the route to see Basilica di Santa Maria Sopra Minerva by the Pantheon, Piazza Venizia and Michelangelo’s Piazza del Campidoglio as you get near the Colosseum, and spend time viewing as much as you can of the Forum as you walk by it on the street and around the top. Here is a rough route that we did one day, though I know I’m forgetting parts and we spent good bit of time inside the Colosseum and Forum."}, {"username": "Tara Feliz", "comment_text": "Yes!"}, {"username": "Junie Wright", "comment_text": "Saving these informations."}, {"username": "Kimberly Glowaski Allee", "comment_text": "It is really fun to do a street food tour also. You can see a lot and eat good food too!\n\nHave fun! Rome is amazing!"}, {"username": "Cathy Powell", "comment_text": "Yes indeed!!! That’s plenty of time. Unless you felt the need to pray and meditate in the pantheon."}, {"username": "Laura Arboleda", "comment_text": "Yes!"}, {"username": "Joanne Wright", "comment_text": "Yes! You can do it!"}, {"username": "Wendy Moon", "comment_text": "Try the e bike tour at night, it’s four hours and you get to see them all. Thoroughly enjoyed it in June when we did it."}, {"username": "Elizabeth Cavdarovski", "comment_text": "Yes it’s possible\nThe colosseum is the one that will take the longest if you go inside\nIf you want to walk past it and tick you’ve seen it then you can do all this in 4 hours\nThe trevi fountain is walking distance so is the pantheon 🏛️ which is open at night too\nTrevi fountain you can see at night too"}, {"username": "Catherine Roebuck", "comment_text": "Yes you can my daughter did it in 38 degrees heat or more. Planning is the key!\n\nAs a family we did a golf buggy tour a few years ago. That was fantastic- well worth the money!"}, {"username": "Leeanne Stevens", "comment_text": "Michael Stevens"}, {"username": "Theresa Spare Proia", "comment_text": "Thank you all for your responses. We are looking forward to our first trip to Italy at the end of September, your information will surely help us have a great time!"}, {"username": "Cece Francis", "comment_text": "Yes!"}, {"username": "Nina Luna", "comment_text": "Following"}, {"username": "Alaide Stuart", "comment_text": "Yes"}, {"username": "Michelle Symons", "comment_text": "Yes definitely possible. We are here now. An easier way to see all the highlights in a short time is the Hop On Hop Off Buses. 24 hours validation is only around $24 euro. You will see all the highlights, get a headphone tour on each site & can get on & off each stop. Buses run every 15mins"}, {"username": "Kay M Gregan", "comment_text": "You can walk around, but how much will you truly immerse yourself in? Give yourself time. I have just done all this. Its not a city race."}, {"username": "Elena Albano Curatolo", "comment_text": "Best way to explore is walking"}, {"username": "Melissa Ann", "comment_text": "Yes. We stayed near the Colosseum and walked a few times to the Pantheon. Even with our 3 young kids and my 66 year old mother in law we made the walk in about 30mins. We also found the metro easy to use."}, {"username": "Mat Marturano", "comment_text": "Also use the metro (subway)"}, {"username": "Jennifer Gustafson", "comment_text": "The only tour we paid for was the Vatican and I’m glad we did because of the history and art."}, {"username": "Lexy Kammler Puzzella", "comment_text": "That's a lot of ground you cover in 4 hours and immerse yourself in the history!"}, {"username": "Joe Green", "comment_text": "It took me a couple of days to learn that from the Colosseum to Piazza del Popolo runs a straight road, the via del Corso. All the sites are just a couple of minutes off this."}, {"username": "Gina Winterstein", "comment_text": "If you have skip the line tickets already you could."}, {"username": "Pamela Frias", "comment_text": "You don’t need a taxi to colosseum. Take the metro. It’s super easy. Roma got just 2 lines and if you need to do all that in 4 hours and want to make it fast, take the metro. The metro stay just outside the colosseum."}, {"username": "Melanie Fay Wais", "comment_text": "Absolutely. Of course, you can."}, {"username": "John Delp", "comment_text": "Are there audio tour guides one can purchase and follow? I have one of the apps so assuming it has foreign countries."}, {"username": "Blenda Johansen-Rodriguez Del Rio", "comment_text": "I don’t think you can do the inside of the Colosseum and the Vatican in four hours without buying skip the line tickets. ￼"}, {"username": "Sandy Gardiner", "comment_text": "Check out YouTube, there are a few different people tossing around various suggestions to do in your own, save you money and teach you the what to expect etc"}, {"username": "Sha Di", "comment_text": "Yes, we did it just 2 weeks ago. We had plenty of time to see, enjoy, and take pictures. We did not go into any of the interiors though."}, {"username": "Karen Gregorchuk", "comment_text": "Courtney Greg"}, {"username": "Candace Skelly Crouch", "comment_text": "Yes you can di it on your own!"}, {"username": "Michelle Louise Pearce", "comment_text": "Nope, if you want to rush around then yes. If you want to take time to take in all the history & awe of the area, then allow longer. Rome is amazing. We had a long weekend & it wasn’t long enough x"}, {"username": "Stephanie Vogel", "comment_text": "We only did a colosseum tour, the 1.5 hour one on viator. Loved it, bring your passports with you if you have kids with you. FYI I’d suggest picking your time slot for pantheon through the website, so you aren’t waiting in a long line for cash pay and you can pay online. There is tourist fee, started in July. Everything else is walking distance and free"}, {"username": "Joanne Nacson", "comment_text": "Download Rick Steve’s Ap. Lots of free tours"}, {"username": "Maria Giordano", "comment_text": "Yes but you are missing out on the history which is what brings fountains & ruins to life"}, {"username": "Dee Cola Charlton", "comment_text": "Get on the Hop On Hop Off bus tour. We always spend our first day using them to see everything! Get the 2 day pass and listen to the narrative with the ear buds they give you."}, {"username": "Dunia Aldyni", "comment_text": "I booked walking tour in first day when we arrived and I am lucky they canceled it and refunded my money I walked with my kids to all this place and we have dinner and gelato 😍😍"}, {"username": "Sherri Leis Dillavou", "comment_text": "Yes"}, {"username": "Cheryl Swiatko", "comment_text": "Yes!!!!"}, {"username": "Jane Price", "comment_text": "Hop on hop off bus is very helpful 🙂"}, {"username": "Maurice Bastarache", "comment_text": "Yes definitely. The Trevi Fountain is perhaps a 10 minute walk from the Pantheon, and 20-25 minutes from the Colosseum."}, {"username": "Jeannine Duguay", "comment_text": "I’ve done both. I recommend booking a tour of the Colosseum (including the Roman forum) and doing the rest on your own."}, {"username": "Nikki Blosser", "comment_text": "Yes‼️"}, {"username": "Teri Depree Martinez", "comment_text": "100% yes"}, {"username": "Mary Evans", "comment_text": "Admission to colosseum may not. Work. Suggest you prebook. Tri Viator. Pantheon and Trevi fountain are close to each other but a bit away from colosseum Google the distance"}, {"username": "Lisa Akira", "comment_text": "Yes but time your walk to avoid the main crowds as much as possible."}, {"username": "Alexandra A Welker", "comment_text": "It's definitely doable"}, {"username": "Barbara Bastianini", "comment_text": "You can certainly walk to these places on your own. No tour is needed. You’ll see the outside of the Colosseum but won’t be able to go inside.\n\nRome is very walkable. And in my opinion walking on your own is the best way to experience the city. So go for it!"}, {"username": "Marty Harte", "comment_text": "Yes. I did colosseum tour for 2 hours. But pantheon, Trevi and close by Spanish steps all can be done in short order."}, {"username": "Celia Tortorici-Campbell", "comment_text": "Yes!"}, {"username": "Colleen Campbell Bussey", "comment_text": "Yes!"}, {"username": "Renee Rundle Stoneham", "comment_text": "Yes… you can walk all over Rome. We walked everywhere never used transportation etc…\nWhy the 4 hour limit?"}, {"username": "Candy Mattiello", "comment_text": "Absolutely… The Spanish Steps are also right there next to Trevi Fountain"}, {"username": "Caterina Liquori-Culhane", "comment_text": "Look at the map. Can walk to trevi, piazza novana and Parthenon. You need tickets for the Parthenon and coliseum. You would need a taxi to coliseum. Fir the first time I went to piazza popolo. It was on the way to the trevi. It very nice and the to churches were amazing."}, {"username": "Marita Doctolero", "comment_text": "Yes, everything is walkable from each other. We did photoshoot starting from the Spanish Steps walking to Trevi Fountain then lastly to the Coliseum…of note, Pantheon is closer to the Trevi so you may want to go there first before the Coliseum…there are also scooters for rent everywhere if that is your thing."}, {"username": "Debbie Yator", "comment_text": "I just booked a tour so much to do in one day!"}, {"username": "Liz Cooper", "comment_text": "I have done this kind of thing on my own in Rome often."}, {"username": "Kasey Jackson", "comment_text": "You’ll need a taxi between Trevi/pantheon and colosseum"}, {"username": "Marilyn Cooley", "comment_text": "Please watch out for pickpocket"}, {"username": "Pietro Di Sorbo", "comment_text": "Yes"}, {"username": "Elsa Hurt", "comment_text": "You can definitely walk round and see them but won't get time to look around,especial\nly if after the Colosseum you look around The Forum."}, {"username": "Andrea Ferretti- Kearney", "comment_text": "You can do this, yes, assuming you’re not going inside the colosseum and pantheon as there are line ups to get inside (security) but it moves pretty quick. And keep in mind you will be doing a lot of walking."}, {"username": "Sharon Hoang", "comment_text": "Go directly to their website and buy the ticket vs third party"}, {"username": "James-Kathy Dickerson", "comment_text": "Yes!"}, {"username": "Jodi Shiffman Silverman", "comment_text": "Do a Colosseum tour. well worth every dime on viator"}, {"username": "Rose Turdo", "comment_text": "YES"}, {"username": "Brice Blosser", "comment_text": "Yeah. That might be pushing it. You’d have to just go to those places and move to the next. The colosseum is the furthest away from the other two, which are relatively close. But to get from them to the colosseum is going to be about an hour walk."}, {"username": "Bronwen Jones", "comment_text": "Yes. Definitely."}, {"username": "Deborah Schroeder", "comment_text": "It is very doable. The Colosseum is the furthest away while everything else is within 15 minutes, using the Pantheon as a central point. I would start at the Pantheon then walk to Piazza Navona if you want then head to Vatican City. If not, walk to the Vatican City for St Peter's (that is 20- 30 minutes from the Pantheon). Leaving St Peter's you go past Castel Saint Angelo then head straight to the Spanish Steps going on Via Condotti. From there the Trevi Fountain and end at the Colosseum. Best place to wander if you are under the 4 hour time frame. Look at Google Earth and you can follow the path and see if it is doable. It is about 3 hours as is if you just keep moving. If you have time at the Colosseum, walk up the Capitoline Hill and get a great view of the Roman Forum. I was there for 7 days and walked this route several times for various reasons so I know you could do it."}, {"username": "Marcus Hiesler", "comment_text": "Walk to see outside. We did, then decided to pay and see inside."}, {"username": "Kelly Tabor", "comment_text": "It absolutely is. My 15yr old and I did it almost everyday in Rome just by walking around."}, {"username": "Eileen Dalton", "comment_text": "H E A T"}, {"username": "Gillian O'Callaghan", "comment_text": "Yes that walks doable and great 👍"}, {"username": "Marbella Jauregui", "comment_text": "Everything on your own but Colosseum needs a ticket around 13 euros and preferably buy it in advance. Same day lines are ugly and limited availability. I got my tickets since April for June and the ground access was already sold out. I do not like the guided tours, but the Colosseum and Palatine would take about 4 hours walking at a good pace. That place deserves to be walked around and explored without any rush. Trevi is just a few minutes visit but it’s awfully crowded . Get your tickets at the official Colosseum site not through anyone because they resell."}]}, {"id": "2212396909159387", "text": "Hi everyone! I’ve never been to Italy before and my fiancé and I are planning our honeymoon there for next May. We currently are planning:\n- 4 days in Florence\n- 2 days in Rome\n- 6 days in Positano (with 2 day trips to Capri and Ravello)\n\nI wanted to know if that seems like enough time or too much time at each place. Any and all suggestions are welcome! Thanks in advance - this group is so helpful for first timers like myself 🤍", "link": "facebook.com/groups/1373361046396315/permalink/2212396909159387/", "likes": 27, "comments": [{"username": "Tam Wong", "comment_text": "You need more then 2 days in Rome💚🤍❤️"}, {"username": "Mazzeo Diane", "comment_text": "I would cut the days in Florence…. The only place we were not overwhelmed"}, {"username": "Gillian Chantrelle", "comment_text": "Remember, it doesn’t have to be your last visit to Italy. We had 5 days in Venice and still hadn’t seen everything. You don’t want to be spending all your time rushing from one place to another - that’s just not the Italian way! We also had 8 days based in Sorrento - there was so much to see and do round there too."}, {"username": "Dana Grobe", "comment_text": "2 days are not enough in Rome. We did 3 days the last time we were there and barely scrapped the surface."}, {"username": "Amber Pena", "comment_text": "I would add Siena and Montepalcino"}, {"username": "Dee Cola Charlton", "comment_text": "Florence is only 30 miles away from Tuscany. Take a wine tour one day."}, {"username": "Chris Avanzato", "comment_text": "Perfect!"}, {"username": "Lynn Macri", "comment_text": "3 nights Positano 2 nights Capri"}, {"username": "Suzanne Mills", "comment_text": "More Rome. Less Positano."}, {"username": "Pamela Brown Santangelo", "comment_text": "We just got home two days ago. We did three days on the Amalfi coast and while we were there, we did Positano and Capri. ￼ We did three days in Florence and three days in Rome. Then we took off to Sicily for another three days. My only regret is we didn’t stay in Rome longer. I don’t even think 23 years would be enough to explore it all. ￼🇮🇹❤️"}, {"username": "Fran Johns", "comment_text": "You are absolutely on track! Yes, maybe 3 days in Rome and 3 in Florence, but NO MORE SIDE TRIPS. There is plenty to\nsee in both Rome and Florence and you want time to just walk around the cities. I’m Italian-America\nn and have been to Italy many times. Do not overbook yourselves with other cities. You can come back some day. PS - there is NEVER enough time in Italy. 😊"}, {"username": "John Mccormick", "comment_text": "So, I love your itinerary. Everyone has their fav’s and as you can see on this thread, no real consistency. We have been to all 3 locations on 2 different trips. Here’s my thoughts:\nFlorence- great city - 2 days is plenty for Florence but then do a day of exploring Tuscany wineries and other towns. Highly suggest Lecce and Sienna. Could even drive to beach town of Viareggio for beach day. Do a hot air balloon ride one morning…magical\n!\nRome - 2 days is good but as some have said, could do more too. Stick w 2 days. It’s a great walking city to everything but the Vatican. Go there early.\n- Positano - I don’t care what any one else says but it truly is one of the most beautiful towns we have been too. In May, crowds will not be too great. Walk higher up into the towns for restaurants etc. 6 days a lot but You can easily fill the week. take ferry to Sorrento 1 day. Go to cheese making and olive oil farm above Sorrento then pizza making class. A blast!!! Another day take ferry to Amalfi then bus/taxi up to Ravello. 3rd day hire a private boat to go to Prochida or Ischia and sightsee along the coast and take trip around Capri. 4th day, take ferry to Capri and explore and go up to Annacapri and have lunch at Michaelangelo. One morning hike the path of the Gods above Positano. Or/and go the Pompeii and stop for lunch at winery at base if Vesuvius. It really is remarkable!😊👍￼"}, {"username": "Elena Eckley", "comment_text": "When in Positano try to go to Ishchia"}, {"username": "Jeff McLellan", "comment_text": "I would stay on Capri and do day trip to Amalfi and Positano"}, {"username": "Rhonda Hope", "comment_text": "Rome deserves another day and one less in Florence it’s much smaller"}, {"username": "Maria Delaney", "comment_text": "I would do 1 days in Positano, 2 in capri, 2 in Rome, keep 4 in Florence and maybe do a trip to Montipuciano, montecino, and Penza. Florence has so much to do. Enjoy"}, {"username": "Alice May Maddocks", "comment_text": "Not enough time in Rome. Too much time in Positano"}, {"username": "Graham Sherlock", "comment_text": "6 days in Positano is a lot, I wouldn't spend 1 day there"}, {"username": "Josette Legris Hughes", "comment_text": "Sounds perfect!."}, {"username": "Patricia Fugaro Chraibi", "comment_text": "If you can get to Sardinia I would recommend it. 2 days in Florence is good. You can do a day trip to the Summer estates of the emperors of Rome which is Tivoli- very nice to see. I loved visiting the town of Amalfi and Positano- we also like Minori and definitely go see Pompeii and take a tour it’s amazing"}, {"username": "Shelley Sclavos", "comment_text": "I personally would change and do 4 days in Rome and 2 in Florence but that’s just a personal opinion. Have the best time x"}, {"username": "Veronica Morfin", "comment_text": "F"}, {"username": "Staci Miller Hawkins", "comment_text": "Following"}, {"username": "Roseann Lunan", "comment_text": "Probably 2 days in Rome is not enough.I would say at least 3 days in Rome minimum"}, {"username": "Rachael Richardson", "comment_text": "Need more time in rome less time in positano ! Sorrento much nicer and capri overrated for a day tourist !"}, {"username": "Erin Eliza Hardin", "comment_text": "We stayed in Positano for 9 days and found Trattoria La Tagliata to be our heaven on earth. We ate their 4 times! And took a cooking class which was hilariously fun! It’s farm to table served family-style and a set price menu that includes unlimited wine. The family that owns it will make you feel so welcomed! I think it was 40-50 euros. It’s set higher up above Positano so the views are incredible!!"}, {"username": "Georgia Brown", "comment_text": "So perfect, but more days in Rome 💖 there’s so much to do and see and don’t want to rush around, you need at least 4"}, {"username": "Nancy Vahl Raske", "comment_text": "You need a couple more days to see Rome!!"}, {"username": "Kathy Smith", "comment_text": "Sounds like a good plan. We just did two days in Rome., 2 Naples spending a day i￼n Ischia, and a week at the Amalfi coast including Capri. The Amalfi coast is amazing. We got alot done in 2 days in Rome. I highly recommend a golf cart tour as you can get a lot done in a short time."}, {"username": "Donna Parrish", "comment_text": "I think it sounds perfect, although what about Venice? It is ideal for lovers and honeymooners! Maybe take one day from Florence? Also be sure to day trip to Tuscany during your stay in Florence!"}, {"username": "Jennifer Avrett", "comment_text": "This is sensible! Be sure you're aware of travel times between your destinations. Travel days are sometimes a bit of a wash. I'm particularly referring to that Rome to Positano transition, depending on how you plan to get there"}, {"username": "Renae Larcus", "comment_text": "Maybe 3 days in Rome and one less day in Positano?"}, {"username": "Bill Gillespie", "comment_text": "3 nights Florence, 5 nights in Positano, the remainder in Rome."}, {"username": "Colita Ellis Wittenkeller", "comment_text": "We just stayed in Capri for two nights and it was truly incredible. You can’t get the vibe during the day. So maybe do four nights in Positano and two nights in Capri? I think 2 days in Rome is plenty."}, {"username": "Maggie Torres", "comment_text": "I Think 3 days in Florence and 3 days in Rome would be better! Rome has so many things to do and 2 days are not enough. You can also do day trip from Florence to Pisa"}, {"username": "Steve Grossman", "comment_text": "Five days in positano is more than enough to see absolutely everything. We have been there a dozen times"}, {"username": "Stacy Derouin", "comment_text": "It seems pretty perfect to me!"}, {"username": "Stephen Ruggiero Jr.", "comment_text": "I would do 1 less day in Florence and add the Island of Ishcia which is in the same area of capri. Congrats on the wedding plans, enjoy the trip. I have been to those places on several times youwill be happy with your choices,"}, {"username": "Rebecca Wilcox", "comment_text": "Postitano is extremely expensive, we stayed in Capri with a day trip in Postitano. Also Postitano is very crowded. We were there May 2023"}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "Sounds perfect!"}, {"username": "Colleen Campbell Bussey", "comment_text": "Stay in Capri over night if you can, to beautiful for just 4 hours. Dm for info"}, {"username": "Catherine AleXandra", "comment_text": "Just a thought: Bologna is incredibly inexpensive to eat / stay. Huge price difference from major cities. It’s a 35 minute high speed train / next stop between Florence / Bologna if your looking to save money 2 of those nights and stay somewhere less expensive. And eat better food. Just throwing it out there."}, {"username": "Jenny Payne", "comment_text": "Myself I would stay in Sorrento and do day trips to all the other places , have been going to Amalfi coast for the last 20 years and since Covid prices are gone up unbelievably 🌻"}, {"username": "Kimberly MacKinnon Cherry", "comment_text": "Looks good. I think you are allowing enough time to enjoy each place"}, {"username": "Lorraine Marie Zalepa", "comment_text": "Best played out plans made, sounds incredible"}, {"username": "Linda Angrisano Boos", "comment_text": "I would do 3 days in Rome and 3 in Florence. Rome needs more than two days to enjoy. You can visit Pisa from Florence too. Positano& Capri are beautiful. You can take the ferry to other places like Sorrento & Salerno too."}, {"username": "Candy Mattiello", "comment_text": "With 4 days in Florence you can also go to San Gimignano and Sienna for sure … I spent 2 days in Florence, saw everything there AND had time for the other day trips I mentioned… I would stay 2 days in Florence and Use those extra two days and go to Cinque Terre… you’ll love it… 5 great little towns…"}, {"username": "Rose Turdo", "comment_text": "Driving or Public Transportation ?"}, {"username": "Marcus Hiesler", "comment_text": "We did 4 in rome at least 1 too many"}, {"username": "Barrie Maynor Vela", "comment_text": "I would do 3 in rome and 3 in florence ,\nI was just there did 3 nights in each , really able to see all the must sees!"}, {"username": "Jeanette Ramos-Gonzalez", "comment_text": "I always count the nights and the traveling in between... for instance to have 4 full full days in Florence you need 5 nights ... I will be doing 4 nights in Rome 4 nights in Sorrento four nights in Florence and 3 nights in Venice..... That will give me 3 full days and 1/2 day in each city except for Venice which will give me 2 full and one 1/ 2 day."}, {"username": "Francisca Lis", "comment_text": "Es mucho o poco en función de qué cosas desees hacer y ver.\nPara mi Roma tiene asignados poquísimos días, pero yo tengo mis gustos, obviamente."}, {"username": "Fatme Sadul", "comment_text": "Give yourself some more time for Rome, one days is only Colosseum with the Forum."}, {"username": "Gale Tetlak", "comment_text": "I have a question we are going to Italy in November first time we’re going through an agent with most things already set up but a lot of free time what is the best mode of transportation.\nNext question my Italian is not very good how is communication"}, {"username": "Lorraine Christina", "comment_text": "Florence could be done in two days, maybe 3 if you want to go inside most or all of its many churches and/or do full tours."}, {"username": "Andrea Ferretti- Kearney", "comment_text": "I would do 3 days in Florence with a day trip to Pisa or Luca or Siena. 3 days in Rome. There’s so much to see! And 4 days in Positano. That’s still plenty of time for 2 day trips to Capri and Ravello. The towns around it are relatively small compared to Rome and Florence."}, {"username": "Jerry Lyubelsky", "comment_text": "I would do 3 Florence 3 Rome or 2 Florence 4 rome"}]}, {"id": "2212400795825665", "text": "I was told to use the WhatsApp why and how is it used and which one do I get ..?", "link": "facebook.com/groups/1373361046396315/permalink/2212400795825665/", "likes": 35, "comments": [{"username": "Lilia Goldfarb", "comment_text": "I use it all the time even locally, you can message, talk and video. I have a number if groups and it’s free!"}, {"username": "Shannon Packard", "comment_text": "I used it instead of getting an international plan. Just used it on WiFi to call, text and video chat. It worked great!!"}, {"username": "Luisa Mander", "comment_text": "The best thing about WhatsApp is you can keep your original number with it too. We use WhatsApp a lot in Australia and when I came to Europe I got a HolaFly esim for data and phone calls with a new number. However I can select on WhatsApp to use the data (internet ) it provides but still keep my old WhatsApp conversations with friends.\n\nP.S we bought the unlimited data Holafly esim for US$99 (3 months travel) and it’s worked amazing well. My partner lost his phone and customer support was very good."}, {"username": "Sigrid Cormier", "comment_text": "You can also FB your family & friends, if personal send in messenger it’s free."}, {"username": "Kerry Aldred", "comment_text": "Kerry Aldred"}, {"username": "Norma McElroy Frisina", "comment_text": "I video chat or send text with my family and friends in Italy all the time . We just have to remember the time differences so we don’t try to chat with someone at 3:00am 😂"}, {"username": "Jodi Paisner", "comment_text": "You can make phone calls using What’s App"}, {"username": "Sherri Leis Dillavou", "comment_text": "It is whatsapp… that is the app. Use it to text or video call. All the friends I have in Europe use it"}, {"username": "Judy Grayson", "comment_text": "K it st use it its free!! Great app for texts, calls while traveling IF yiu want to communicate with others in US or other countries while traveling… duh.."}, {"username": "Judy Grayson", "comment_text": "Just do it!!"}, {"username": "Anna Cauchi", "comment_text": "Can I just dial an international number using What’s app? Or do I have to send a message on the app first asking them to connect with me.? I am trying to call a hotel in Italy from Australia….I can see they have what’s app and I have their phone number…..thank you!"}, {"username": "Steve Wolfrom", "comment_text": "Don’t get on it with strangers. I play a scrabble game and “friendly” women (maybe) invite me to join them on WhatsApp"}, {"username": "Sabina Palermo-Chihai", "comment_text": "It’s standard practice in a lot of countries (especially in Europe, not sure other areas) to use WhatsApp when conducting business.\nI do suggest though that if you discuss pricing with anyone and you see that the other person has “erase conversations after 7 days” notification, to take a screenshot of what you agreed to as you will not be able to go back to them after 7 days. Had few people change pricing and luckily I showed that we already agreed to one."}, {"username": "Theresa Martino Kane", "comment_text": "Am I understanding it correctly that when I went to Europe, I did not have to pay my USA cellphone provider an extra $10.00/\nday for the international fee to be able to use my cellphone while there? I could have communicated-texted and called other WhatsApp users through WhatsApp each day for free? I would have had to put my phone on airplane mode? Thank you."}, {"username": "Kejdi Okej", "comment_text": "There is only one . Go to your app store and download. If you need a pic l can send it to you"}, {"username": "Ashley Spuhler", "comment_text": "Just set it up. Sometimes people will contact you through there or you can order take out through it as well. We live in Germany & rarely use ours tho, we only used it a few times in Italy."}, {"username": "D Rochelle Milton", "comment_text": "I’ve used WhatsApp for 13 yrs. There’s only one app…."}, {"username": "Sarah Smith", "comment_text": "I’m from NZ and use it all the time at home. I’m in Italy now and it’s so much easier to use this to stay in touch with tour and accommodation providers. It’s also very very safe to use 🙂"}, {"username": "Rita Legge", "comment_text": "I have downloaded WhatsApp based on this post. I have read through everything, but still need clarification please. I do understand that you need to be connected to Wi-Fi to use it.\n\nCan we text, make phone calls within the foreign countries and also back to the states without charges?\n\nI have the daily Travel Pass through Verizon. Do I really need this if I have WhatsApp? Will using WA trigger a daily use?\n\nWhen we are in port (we are cruising) should I still keep the phone on airplane mode?\n\nDo I need to do anything with the data roaming tab on the phone? On or off?\n\nOne other thing, if we need to use Google maps in port, will just being connected to Wi-Fi work?\n\nObviously, I am not tech savvy, and need help and specifics. Thanks for your patience. 😊"}, {"username": "Mike Guluk", "comment_text": "What’s app is fabulous, all you need is Wi-Fi and it’s free"}, {"username": "Marianne Fontana Skrocki", "comment_text": "Marianne Fontana Skrocki"}, {"username": "Kyra Savoie Miles", "comment_text": "Don’t you need the internet to use it? If so why not just use Data off your service?"}, {"username": "Tony Sileo", "comment_text": "I got a SIM card specifically for my Europe trip. $30. 10GB of data. They gave me a UK phone number that I could call and text from within the EU and UK. I was also able to use iMessage and WhatsApp. Worked great for Greece and London. A lot cheaper than using my Verizon data for the 3 weeks we were gone.\n\nhttps://\nwww.simoptions.c\nom/brand/\nthree-uk/\npayg-data-pack-8\ngb"}, {"username": "Heidi McPhillips", "comment_text": "My European friends use WhatsApp and Signal.\nI LOVE them. I call my friends all the time now ❤️❤️"}, {"username": "Sherry Shannon", "comment_text": "Europeans “top up” to replenish their data. Most Americans have a flat price unlimited data plan so they don’t need to use WiFi as much. That’s basically why most Americans don’t use it. I only use it to talk to my friends in other countries because that’s their preference.\nWhatsApp does come in handy for free WiFi calling. Downside is you have to use WiFi. My US phone plans gives me free data in other countries and I can use it walking down the street vs having to find a hotspot."}, {"username": "Phil Derriaghy", "comment_text": "Simple solution! Download whats app …."}, {"username": "Phil Derriaghy", "comment_text": "What’s app is an internet / WiFi based communication app! Very simple and easy to use by anyone. After reading some of the comments on here, it’ll be very confusing for anyone thinking to use it! 🙄"}, {"username": "Bill Bowler", "comment_text": "It's the standard in Europe and Caribbean. Awesome features too, texting is ancient lol"}, {"username": "Richelle Howell", "comment_text": "I was in the Caribbean for 3 weeks. Most people use what app outside of the US.\nWhile there I kept my phone on airplane mode.\nMy Verizon international plan allows for $10/24 hrs of use. It is therefore cheaper for me to pay for the one or two days I take it off of airplane mode.\nI take it off airplane mode\n1) as a iPhone user I do not get texts from android users when I travel. They can reach me in WhatsApp however\n2) if i am trying to do a transaction or something where the company sends me a verification mode. I cannot get it on airplane mode as it’s not an iPhone sending.\nWhatsApp is free and can be used on Wi-Fi for texts and calls. Most of my friends and family use WhatsApp as do my friends in the Caribbean and Europe.\nSo my extra money spent was the $10 fir the one day I took it off airplane mode"}, {"username": "Karen Robertson", "comment_text": "WhatsApp is free to use. We found that a lot of taxi drivers it. Fortunately for us we still had a conversation from one of our drivers from last year and we were able to reach out directly to him for our trip this year"}, {"username": "Colleen Melnyk", "comment_text": "It’s a message/phone call app that uses WiFi"}, {"username": "Ian Beyer", "comment_text": "What do you mean by “which one”?"}, {"username": "Donna Hartsell", "comment_text": "There is only 1 WhatsApp, and it is used in a lot of foreign countries instead of regular texting."}, {"username": "Kasey Jackson", "comment_text": "Used to communicate wo using a phone plan. Even some businesses use it. There’s only 1…"}, {"username": "Barrie Maynor Vela", "comment_text": "Because it’s free!\ndownload the app “Whatsapp” on your phone and have those you want to communicate with also download it and you can text people anywhere, best is over wi-fi but I was also able to use whatsapp to communicate with my group i was with when I traveled to italy over my international data plan"}, {"username": "Katie Ewers", "comment_text": "For iPhone"}, {"username": "Lorraine Swick Sanfilippo", "comment_text": "It’s basically a free way to communicate"}, {"username": "Janine Emma Lucas", "comment_text": "It’s an app. Add you families number to your phone, they need what’s app as well. Free talk and text"}, {"username": "Liane Sabina", "comment_text": "Used it successfully in Italy. Just join WiFi and you can do free texting or calling."}, {"username": "Annette Mayer", "comment_text": "Rather than incur text and phone fees when somewhere that your phone switches to roaming, use the WhatsApp . It only uses data. Make sure whoever you call has it too"}, {"username": "AK Kaygen", "comment_text": "There’s only one WhatsApp.\n\nIt’s free when used with WiFi. You can call and text free. Download it at home and make sure to connect to everyone you plan on communicating with before you leave for your trip."}, {"username": "निनावी सहभागी", "comment_text": "Thank you everyone got it!!!"}, {"username": "Lynn Pavlik O'Rourke", "comment_text": "And do you put your phone on Airplane mode?"}, {"username": "Margaret Frey", "comment_text": "I'm from the US. The hotels we stayed at in Italy had wi-fi, so What's App worked fine, but FB Messenger also worked for me. I didn't have an international SIM card so I couldn't send regular texts or call home."}, {"username": "Virginia Lane", "comment_text": "Virginia Lane"}, {"username": "Bill Elias", "comment_text": "No need for what’s app if you have data availability overseas. It’s a very old school workaround to only communicate via Wi-Fi, but modern text clients can also use Wi-Fi\n\nYears ago, text was only associated with your phone capabilities, now it integrates with email addresses. You can even make phone calls with Wi-Fi-only these days."}, {"username": "Paula Rosati", "comment_text": "Also works for telephone calls. Avoids roaming charges"}, {"username": "Sean P. O'Brien", "comment_text": "So if my plan was to initiate an international calling plan through my carrier (Verizon) and the plan covers the data requirements for texts and Internet usage, would the WhatsApp offer anything beyond what the Verizon plan is already providing? I understand it’s free, but it sounds like you still require an international plan regardless?"}, {"username": "Robbie Flaherty", "comment_text": "I used it in Paris and it was great"}, {"username": "Joe Laricchia", "comment_text": "In Italy most people use WhatsApp, they don’t text. Very easy"}, {"username": "Laurie Francis Menk", "comment_text": "There is only one. Go to your App Store and download. If you need a pic I can send it to you"}, {"username": "Nicole Condemi", "comment_text": "Even with a sim, for some reason phone calls never seemed to work 🤷‍♀️ I contacted people through WhatsApp, so much easoer"}, {"username": "Janet Lou Weimer", "comment_text": "Yes download before you go. Free and easy to text, FaceTime and call"}, {"username": "David Horgen", "comment_text": "I put it in my phone not long before we came here to Italy. Came in very handy because many of the Airbnb hosts, airport transfer drivers, they all use it. Glad I did that"}, {"username": "Elise Garner", "comment_text": "I use Signal because it is more private."}, {"username": "Nanette Eustice Gatlos", "comment_text": "Everyone it Italy uses it, it’s free phone calls and messages and that’s how your drivers will reach out to you for transfers and connecting at the airport as well as hotels, restaurant reservations, etc."}, {"username": "Heather Kearney", "comment_text": "What’s app messenger uses your phone number"}, {"username": "Todd N Nicole Clarke", "comment_text": "I found most of our hotels and drivers sent messages through WhatsApp which worked well because I only had wifi on my phone (that’s another story)"}]}, {"id": "2212398099159268", "text": "Is scala contarini del bovolo in Venice a busy attraction without long waits to purchase tickets and ascend, or is it advisable to purchase tickets in advance?", "link": "facebook.com/groups/1373361046396315/permalink/2212398099159268/", "likes": 0, "comments": []}, {"id": "2212403015825443", "text": "What are the best places to visit in Sicily?", "link": "facebook.com/groups/1373361046396315/permalink/2212403015825443/", "likes": 1, "comments": [{"username": "Rina Speronello", "comment_text": "The Greek Temples in Agrigento ❤️"}, {"username": "Heath Conn", "comment_text": "We did a 7 day road trip and saw most of the normal sites. We did not go further west than Palermo (didn’t see Marsala).\n\nWe loved Cefalu and Syracusa. I would definitely stay 2-3 nights in Palermo next time. A crazy and fun town."}, {"username": "Herbert Maritschnik", "comment_text": "Taormina❤️"}, {"username": "Rose Turdo", "comment_text": "Monreale Palermo\nSS113 From and Cefalu to and Santo Stefano di Camastra\nTus Hotel on SS113 in Castel di Tusa is central.. explore the area.\nCastelbuono\nAugusta, Hotel - Ristorante Capo Campolato\n+39 0931 981022\nhttps://\nmaps.app.goo.gl/\ntQKJk6Z2R98KkgVV\nA"}, {"username": "Shannon Packard", "comment_text": "Taormina, Siracusa, Agrigento (swim at the Turkish Steps!), Cefalu"}, {"username": "Greg Saba", "comment_text": "Our favorites: Taormina, Savoca, AciTrezza, Ortigia, Modica, Noto, Ragusa Ibla, Scicli, Agrigento, Trapani, Erice, Casetllammare del Golfo, Cefalu (pictured), Castelbuono, Caccamo, Pollina, Tindari, Lipari, Selinunte, and Segesta. That was based on a month-long trip of 76 places. If interested, you can google \"Ultimate Month in Sicily\" for a very lengthy Fodors trip report with more than 1,000 photos."}, {"username": "Sarah Longman", "comment_text": "Taormina! Love this beautiful place ❤️"}, {"username": "Peter Ingargiola", "comment_text": "Mazara del Vallo"}, {"username": "Mircea Dumitrean", "comment_text": "Island Lampedusa !!!"}, {"username": "Miklos Verdes Kovacs", "comment_text": "Rome 😎💖"}, {"username": "John Peter James", "comment_text": "Cefalu. Lipari islands"}, {"username": "Ike Simoncini", "comment_text": "In this thread i made a detailed round trip advise https://\nm.facebook.com/\ngroups/\n1373361046396315\n/posts/\n2210044212727990\n?comment_id=221\n0519829347095&r\neply_comment_id\n=22114523159205\n13&notif_id=169\n1719875192477&n\notif_t=group_co\nmment_mention"}, {"username": "Joe Guzzi", "comment_text": "Corsica"}, {"username": "Ian Fawkner", "comment_text": "If you want a really authentic Sicilian experience- I recommend Pozzallo….what a gem !"}, {"username": "Ville Lignell", "comment_text": "Siracusa."}]}, {"id": "2212404022492009", "text": "Hi everyone, plan trip to Rome. Looking for accomodation per 2 person and 3 nights in October. Any suggestions. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2212404022492009/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.kqzyfj.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187791-d3964\n772-Reviews-Rom\ne_Times_Hotel-R\nome_Lazio.html"}, {"username": "Melissa Garcia-Quintero", "comment_text": "My husband and I are also going to Rome in October I booked through Airbnb"}]}, {"id": "2212409159158162", "text": "Planning my first trip to Europe. Any travel requirements I should have done before we get there?", "link": "facebook.com/groups/1373361046396315/permalink/2212409159158162/", "likes": 0, "comments": [{"username": "Colleen Dawson", "comment_text": "Depends on which citizenship you have."}, {"username": "Victoria Moorhead Murrow", "comment_text": "Make sure your passport doesn’t expire less than 6 months from your return date. Never use the atm’s that say Euronet."}, {"username": "Brian Osman", "comment_text": "When are you going, a new visa program starting soon"}]}, {"id": "2212411112491300", "text": "Hello! Random question, can anyone recommend a travel steamer that works abroad?? The ones found on Amazon only indicate that are good for travel in the US. Thank you!!", "link": "facebook.com/groups/1373361046396315/permalink/2212411112491300/", "likes": 0, "comments": [{"username": "Tammy Jess Mercer", "comment_text": "If it’s the plug that’s limiting the use, but an adapter."}, {"username": "Sharon Menegoni", "comment_text": "No need, hang your items in the bathroom, turn on hot shower for about 5 minutes, turn off water, close door, clothes will be wrinkle free in the morning!"}, {"username": "Wendy Spano Bracco", "comment_text": "Search dual voltage steamer, you will see them. I am looking myself."}, {"username": "Vasthi Cheddar", "comment_text": "I got this one. Dual voltage. Just needs an adapter"}, {"username": "Kejdi Okej", "comment_text": "Search dual voltage steamer you will sse them . I am looking myself"}]}, {"id": "2212414342490977", "text": "Please help us understand the train route! We are looking at options to get from Ischia to Rome. It says there are 4 transfers, and 3 are from Naples to I guess another part of Naples? Would we be switching trains 3 times? Or are these just stops?", "link": "facebook.com/groups/1373361046396315/permalink/2212414342490977/", "likes": 0, "comments": [{"username": "Brenno Bianchi", "comment_text": "It is quite confusing written in that way, but those are transfers between different kind of public transport lines inside Naples.\nBut I think is quite simpler arriving at the port of Naples and then taking the metro at Municipio station. The line arrives directly at Naples central train station.\nOr take a taxi at the port."}, {"username": "Sarah Luisa Hughes", "comment_text": "That's very confusing. I think the easiest way would be taxi to the station when you get off the boat at the port. Then you should be able to get the high speed direct to Rome."}]}, {"id": "2212415175824227", "text": "Any suggestions for good artsy tours around Rome or places that aren't the usual tourist areas to check out... looking to do something a bit different", "link": "facebook.com/groups/1373361046396315/permalink/2212415175824227/", "likes": 0, "comments": [{"username": "Vicki Kreymborg Sweeney", "comment_text": "Domus Aurea"}, {"username": "Valentina Saltarelli", "comment_text": "I recommend\nCentrale Montemartini ( stunning)\nPalazzo Massimo alle Terme\nStreet art Tor Marancia\nSanti Cosma e Damiano church\nSanti Marcellino e Pietro catacomb\nVittoriano terrace\nPalazzo Venezia\nPalazzo Altemps\nMausoleo di Augusto\nCase romane del Celio\n… and more and more"}, {"username": "Arthur Boyce", "comment_text": "Borghesi museum is spectacular"}, {"username": "Ken Lerch", "comment_text": "The Borghese is magnificent but the catacombs have a macabre fascination."}, {"username": "Pietro Di Sorbo", "comment_text": "Other then the places suggested by Valentina Saltarelli:\n-Palazzo Barberini (here you can see a masterpiece of Raffaello, La Fornarina);\n-Palazzo Doria Pamphijli;\n-Ara Pacis;\n-Parco dell'Appia Antica (where Via Appia started);\n-Terme di Caracalla (magnificent scenario fo opera too) ;\n-Palazzo Farnese;;\n-San Pietro in vincoli (here you ca see the Mosè by Michelangelo, famous because after the realization the author was able to rotate the head of 25°);\n-San Giovanni Basilica;\n-If you want to see some Caravaggio masterpiece without tickets go to San Luigi dei Francesi Church, Sant'Agostino Basilica, Santa Maria del Popolo Basilica.\nThese are only some suggestions of what I'm remembering in this time, but there are many other."}, {"username": "Francisca Lis", "comment_text": "Pasear por la Via Apia Antica\nVisitar las Catacumbas de Pricilla en Via Salaria\nHacer una ruta de Caravaggio\nVila Borghese, Museo y jardin, alquilando una bicicleta y pic nic"}, {"username": "Francisca Lis", "comment_text": "Mausoleo de Santa Constanza y Basilica Sant'Agnese fuori le Mura en Via Nomentana\nEUR y Museo de la civilización romana\nSan Pablo Fuora de Muri (la quinta Iglesia Mayor de Roma. Mira la historia de las Iglesias Mayores que aunque están en Roma no es Italia, sino territorio de la Ciudad del Vaticano)"}, {"username": "Danielle Townsend", "comment_text": "Thanks everyone!"}]}, {"id": "2212416445824100", "text": "Hi guys,\n\nIsit worthwhile to purchase a Torino + Piemonte card ? For travel..\n\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2212416445824100/", "likes": 0, "comments": []}, {"id": "2212416902490721", "text": "When traveling with your personal medications , do they have to be in the bottles they were prescribed from or can you put them in a travel pill box.", "link": "facebook.com/groups/1373361046396315/permalink/2212416902490721/", "likes": 3, "comments": [{"username": "Elizabeth Anne", "comment_text": "Travel pill box! ✈️"}]}, {"id": "2212417065824038", "text": "Hi. New here. Planning 1st time trip to Italy from Toronto with my 20 y/o daughter for next August/September. Is 10 days enough? We love to shop especially Designer (Gucci, Prada etc). Truly no idea where to even begin. Florence? Venice? Amalfi coast? Would greatly appreciate advice and recommendations.", "link": "facebook.com/groups/1373361046396315/permalink/2212417065824038/", "likes": 3, "comments": [{"username": "Alicia Burno", "comment_text": "We are doing 15 days: Venice, Bologna, Florence, Rome, Sorrento, Amalfi Coast, Positano, Capri and back to Rome. We are in our last days. Great trip!!!!"}, {"username": "Leslie Goodland", "comment_text": "Unless you have a lot of spending money, research the outlet malls. A lot cheaper than regular retail. I went to one outside of Florence and it was really great. Also check out Gucci Garden in Florence. When I went the museum upstairs was closed because they were working on an exhibition, which I was really bummed about!"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "My advice: Do not go in August."}, {"username": "Caterina Liquori-Culhane", "comment_text": "If you can do two weeks or more do it!"}, {"username": "Starla Dawn", "comment_text": "Travestere, Rome"}, {"username": "Lisa Valdovinos", "comment_text": "Capri is a great place for shopping but most areas have designer stores."}, {"username": "Rosa Zordan", "comment_text": "I always go by 3. 3 in Sorrento, 3 in Rome, 3 in Florence, 3 in Venice and 3 in Sicily. Fly home from your last destination. Saves doubling back. All places in Italy have great shopping boutiques. Foods, dialect, culture change from top to bottom so it's just great. So much to see and do around these pivotal places."}, {"username": "Dee Cola Charlton", "comment_text": "If you want high end shopping, go to Milano."}, {"username": "Sande Ricci", "comment_text": "Fly into Milan and out of Rome. Milan, Florence, Rome. That's plenty for 10 days."}, {"username": "Fetchin Gretchen", "comment_text": "I would do 2 to 3 weeks.Some of the best places in Italy for designer shopping:\n\n* **Milan:** Milan is the fashion capital of Italy and is home to many luxury designer stores, including Gucci, Prada, Versace, and Dolce & Gabbana. There are also many outlet malls in the area where you can find discounted designer clothing and accessories.\n\n* **Florence:** Florence is another great city for designer shopping. The city is home to the famous Via Tornabuoni, which is lined with luxury boutiques. There are also many markets in Florence where you can find handmade souvenirs and leather goods.\n\n* **Rome:** Rome is not as well-known for its designer shopping as Milan or Florence, but there are still a few great places to find high-end brands. The city is home to the famous Via Condotti, which is home to many luxury stores. There are also several outlet malls in the area where you can find discounted designer clothing and accessories.\n\n* **Venice:** Venice is not the first place that comes to mind when you think of designer shopping, but there are actually a few great places to find high-end brands in the city. The city is home to the famous Calle d'Oro, which is lined with luxury boutiques. There are also several markets in Venice where you can find souvenirs and leather goods.\n\n* **The Amalfi Coast:** The Amalfi Coast is a stunning stretch of coastline that is home to some of the most beautiful towns in Italy. The towns along the coast are also home to a number of luxury shops where you can find designer clothing, accessories, and souvenirs.\n\nI hope this helps!"}, {"username": "Tony Mancini", "comment_text": "Florence would be a dream for shopping not to mention all the beauty around you Venice would also be memorable. If you never been Rome is a can't miss city. Don't try to do too much ,enjoy the experience and make great memories.minimu\nm 15 days. Find some inexpensive places to stay . Don't forget you will loose 2 days in travel and find a base city close to the train station and take advantage of the super fast trains."}]}, {"id": "2212418629157215", "text": "Hello looking for recommendations for a boat trip along the coaststarting from Naples ( bus to port of course) visiting Positano, Amalfi and Ravello.\nStruggling to know if the companies I’ve found are good ones.", "link": "facebook.com/groups/1373361046396315/permalink/2212418629157215/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Naples/\nAmalfi-Coast-Boa\nt-Tour-Small-Gr\noup-from-Naples\n/\nd508-136733P44?p\nid=P00070587&mc\nid=42383&medium\n=link&medium_ve\nrsion=selector"}]}, {"id": "2212215492510862", "text": "Hi\nHelp me plan my itinerary please, I want to do Rome - Florence- Venice - Verona - lake Garda.\nIs this route / connection right? I was initially thinking Amalfi but it’s quite down south, maybe a separate trip. Logically if I skip Rome then I can stick to northern Italy but going to Italy and not doing Rome as a first timer is making me sad. Please pour suggestions and which part of each city should I try booking hotel?\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2212215492510862/", "likes": 2, "comments": [{"username": "Kelly Huntley Clark", "comment_text": "Rome is super easy to fly into! I think that’s a great way to start your trip. A pretty short train ride to Florence from there as well."}, {"username": "Elena Palmigiano", "comment_text": "Ovviamente già solo la Toscana è piena di cose da vedere. Se però tu vuoi fare queste tappe perché sono quelle che desideri, ti posso dire che l’itinerario ha senso perché sono tutti posti collegati dal treno. Tra l’altro di brevi durata"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Do you have 2+ weeks? You could fly into Rome and out of Milan. Absolutely doable."}, {"username": "Lyn Evans", "comment_text": "Our 1st trip to Italy we flew into Venice then train to lake Garda … train station is Peschiera del Garda and stayed in Sirmione …you can visit Verona from Sirmione on the local bus. Then train to Florence then train to Rome. Fly home from Rome. If you really want to do Amalfi coast head down from Rome. (We did an ‘Emerald Tour’ 4 nights /5days Sorrento and Amalfi incl Pompeii that was really good if still avail and made the trip south very easy.) This was 2016 so not sure if it is still avail. Hope this helps."}, {"username": "Virgz Van Møøre", "comment_text": "No, this would be easier : Rome - Florence - lake Garda (Peschiera via Milano) - Verona - Venice. You may also consider visit lake Como on your way to Garda. All of this is doable by train. When in the lakes use the ferry to move around."}, {"username": "Jenny Payne", "comment_text": "Rome I always stay at a hotel near the termini ( lots of research & read the reviews, Florence I stay in airb&b in an area called Santo Spirito about a 20 minute walk from SMN station but lovely shops, cafes, bars and it over the ponte Vecchio bridge . I go every year to Italy and show friends around. Always eat off the main area down side streets. Wear a cross body bag,backpack, rubber sole sneakers & leather sandals rubber soles also. Cover your shoulders for Vatican & men wear long pants (Italian mean al, wear linen pants or long shorts to the knee) 🌻"}]}, {"id": "2212202005845544", "text": "Hi I’d love any recommendations for accommodation in Florence - either Airbnb\nOr hotel.\nMy friend and I are doing a Vespa tour. Below is the meeting point.\nWe would love to stay 2 nights amd be able to walk out the door for breakfast , exploring etc.\n\nMEETING POINT: Via Curtatone 9, outside cafe Gamberini, just a five min walk from S.M.Novella train station in Florence.", "link": "facebook.com/groups/1373361046396315/permalink/2212202005845544/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.kqzyfj.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187895-d2307\n23-Reviews-B_B_\nHotel_Firenze_P\nitti_Palace_al_\nPonte_Vecchio-F\nlorence_Tuscany\n.html"}, {"username": "Pao Magnoler", "comment_text": "Near the Duomo area, really comfortable. We were very satisfied. 100% recommended"}, {"username": "Rebecca Yeoh", "comment_text": "I recommend the Frame Hotel, located between the station and Duomo, walk to everything. We stayed in the actual room where the Mona Lisa was found (over a hundred years ago) when it was stolen from Paris. It was an extraordinary hotel with so much history, and an even better location to boot https://\nwww.theframehote\nl.com/"}, {"username": "Jenny Payne", "comment_text": "Make sure insurance covers Vespa tours 🌻"}, {"username": "Renae Larcus", "comment_text": "Hotel Roma is right by the train station and a short walk to the Duomo."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 8, "comments": []}, {"id": "2212198955845849", "text": "I really want to do a food tour. Deciding which one. We are going to Rome, Florence (already doing a cooking class in Florence) and Venice. All suggestions welcomed and appreciated. Travelling mid September.", "link": "facebook.com/groups/1373361046396315/permalink/2212198955845849/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nTwilight-Trastev\nere-Food-Tour/\nd511-5553P13?pid\n=P00070587&mcid\n=42383&medium=l\nink&medium_vers\nion=selector"}, {"username": "Mary Anna Machi", "comment_text": "Ck out food and cooking tours near Bologna/modena/\nParma."}, {"username": "Lisa Valdovinos", "comment_text": "Walking street food tour in Rome. So much great food and education about the different areas."}, {"username": "Barbara Pasteris Allen Hettlinger", "comment_text": "Haven't done one in Rome but I've done a couple of food tours by Eating Europe (Amsterdam & London) and this company does a great job with their food tours. So I'd say you probably can't go wrong with any of the ones they offer in Rome. Read the descriptions, see what works with your timing and pick the one that's the best fit for you. https://\nwww.eatingeurope\n.com/rome/\n?utm_source=GMBl\nisting&utm_medi\num=organic"}, {"username": "Patrice Warren", "comment_text": "Yes, the Twilight Trastevere tour was so much fun - website is Eating Europe."}, {"username": "Beth Ann", "comment_text": "Definitely Rome"}, {"username": "Ike Simoncini", "comment_text": "If you ho for the food do florence"}]}, {"id": "2212193955846349", "text": "Looking for advice please ☺️\n\nIs it possible to access Switzerland from Lake Como by train for a (big) day trip or is that impossible? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2212193955846349/", "likes": 13, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Lake-Como/\nBernina-express-\ntour-Unesco-Wor\nld-Heritage/\nd26113-161282P6?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}, {"username": "Francesca Giovanelli", "comment_text": "You can catch the Bernina express to Saint Moritz, otherwise a train from Como to Lugano or a bus from Menaggio to Lugano"}, {"username": "Megan Rachal", "comment_text": "We drove! We were on a road-trip and drove from Varenna through Sant Moritz into the German alps! It was gorgeous\n\nRecommend renting a car for freedom to explore."}, {"username": "Michele Liggett", "comment_text": "Yes we're taking the Bernina Express from Laje Como to St Moritz Switzerland"}, {"username": "Beth Spiehler Selvia", "comment_text": "The Bernina is fabulous !"}, {"username": "Karen Trom", "comment_text": "We’re staying in Varenna and would love to do this. Tours are all €600+. Is that per person?\nIs there a way to do this on our own? We won’t have a car during this part of our trip."}, {"username": "Penny Bouchard", "comment_text": "Is it really $600 for a one day excursion????"}, {"username": "Mariam Chaudhry", "comment_text": "You can take a cab from COMO TOWN and in 20 minutes you will be in Switzerland .. a little further and u will be in lake city of Lugano which is supposed to be beautiful..\nthe cab will charge double fare as he has to return back to COMO.. cost us around 50 euro (double fare) to reach the outlet mall in Switzerland.. Lugano was 20 mins further I think .."}, {"username": "Andrea Devine", "comment_text": "We stayed in Cadenabbia on Lake Como and you could get a bus to Lugano from there"}, {"username": "Sharon Reynolds", "comment_text": "From como to Lugano, the next lake to the west it's 35-45 direct on a train."}, {"username": "Thelma Gipson", "comment_text": "Rent a car, Switzerland is gorgeous. I stayed in Como a few weeks and ventured to Switzerland and absolutely loved it. I rented a car in como city."}, {"username": "Rachel Gray", "comment_text": "Take a train from Lake Como to from there you can pay about $160 USD per person for the Bernina Express ride to St. Moritz and back. It’s about 2.5 hour train ride each way (Tirano to St. Moritz)."}, {"username": "निनावी सहभागी", "comment_text": "Rick Bishop"}, {"username": "Alaska Lee-Ann", "comment_text": "I did it not long ago! Took the train from Como. If you go to Lucerne the old town is within walking distance of the train station and so is several boat rides that will take you to different towns and run every 30 minutes or so."}, {"username": "Maria Theresa", "comment_text": "We did it from Belagio Lake Como a few years ago by train. We took the train to Lugano and then transferred to get to Lucerne which was not too far. You can probably do that in one long day. We spent a few days there and then took another train to Grindewald in the Alps. The Lake Como/\nSwitzerland trip was a perfect combo. The Swiss trains are amazing. Gorgeous views!"}, {"username": "Diana Smith", "comment_text": "Absolutely, Lugano is only half n hour away from Como."}, {"username": "Lisa Akira", "comment_text": "I went from lake Lugano to Lake como by train in an hour or so. Easy! Trains run all day. But I advise spending time wherever you decide to go. Just have your passport when crossing borders. They did check on the train."}, {"username": "Pam McIntyre", "comment_text": "You can book tickets directly on the Bernina Express website if that route sounds appealing. You will need to get yourself to Tirano if you buy tickets that way (there is a direct regional train from Varenna). We have booked first class 10am which will get to St. Moritz around noon and booked the return for 4pm which will get us back to Tirano approx 6pm (we are staying in Varenna). We love train travel so don't mind being on a train for that length of time and plan to have lunch and a nice walk around St Moritz. Very excited! https://\ntickets.rhb.ch/\nde/pages/\nbernina-express"}, {"username": "Janine Emma Lucas", "comment_text": "Yes. Check Rome 2 rio dot com"}, {"username": "Judy Gordon", "comment_text": "Jane Thorson"}, {"username": "Naina Morar", "comment_text": "Naina Morar"}, {"username": "Annette Mayer", "comment_text": "I just booked the Viator trip on Bernina Express. It was no where near $600. It was $165 pp."}, {"username": "Giovanni Pianigiani", "comment_text": "Switzerland where?"}, {"username": "Véronique Piercey", "comment_text": "You can also take the regular Eurocity train that you can book via www.trenitalia.\ncom that leaves Como and goes all the way to Zurich."}, {"username": "Suzanne Felder", "comment_text": "We took the Bernini Express trip\n10 days ago and it was one of the best experiences we’ve had in our travels. Certainly we’ll worth it. It’s a long day but oh so enjoyable."}]}, {"id": "2212189905846754", "text": "Hello,\nI am planning for a day trip to Dolomites from Venice.\nI don’t drive so I am dependent on public transportation pr reliable tour operators.\n\nCan anyone suggest me ways to reach and what is the best place to explore in a day trip in Dolomites?\n\nThank you in advance for any suggestions.", "link": "facebook.com/groups/1373361046396315/permalink/2212189905846754/", "likes": 5, "comments": [{"username": "Oneida Ann Murphy", "comment_text": "I just did this last week. Get yourself to Verona from Dolomites and take the one hour train to Venice."}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Venice/\nDolomite-Mountai\nns-Small-Group-\nDay-Trip-from-V\nenice/\nd522-2635PDOLOMI\nTE?pid=P0007058\n7&mcid=42383&me\ndium=link&mediu\nm_version=selec\ntor"}, {"username": "Claire Dowson", "comment_text": "It’s a seven hour round trip by train, over 5 by car. Long way for a day trip."}, {"username": "Etschi Bruckner", "comment_text": "you won´t have much time to explore after spending at least 5 hours in a car!"}]}, {"id": "2212189712513440", "text": "Hello will travel to italy in two weeks. Im a bit apprehensive and scared as I am mainly there to visit the Basilica of St. Rita in Cascia. I will arrive in Rome and my question is how do i get to the basilica? I was told to go to Roma Triburtina and from there ride a bus towards the basilica. My question is, are there hotels around the basilica I can stay for the night? And are there buses all day to take me back to Rome?\n\nThanks and may you all be blessed.", "link": "facebook.com/groups/1373361046396315/permalink/2212189712513440/", "likes": 0, "comments": [{"username": "Brenno Bianchi", "comment_text": "Cascia is a small village of 3000 people. There are some hotels and different kinds of accomodation.\nOutside Roma Tiburtina there is the Busitalia bus line E433. It departs at 07,30 and at 15,30 (not on Sunday). It takes around 3 hours.\nFor the return, the last bus on Sunday is at 16,30; on working days at 15,30."}]}, {"id": "2212184779180600", "text": "Best way to get to Venice from Milan and back on the same day: train or bus?\n\nAnd is it worth it? Or should I go to Cinque Terre?", "link": "facebook.com/groups/1373361046396315/permalink/2212184779180600/", "likes": 1, "comments": [{"username": "Sheila Behrendt", "comment_text": "I have the same question."}, {"username": "Rosnani Konali", "comment_text": "Check for options on Rome2Rio app\n\nMilano Centrale to Venezia is about 2.5hrs 》 1 way train\n\nMilano Centrale to Cinque Terre area is about 3 to 3.5hrs 》1 way train\n\nIMO, i would do Venezia for a day trip\n\nBuy tickets from the Trenitalia website"}, {"username": "Karen Blackmore", "comment_text": "Fast train but takes 2.5hr at least each way. So I'd say that doesn't give me time in Venice"}, {"username": "Pao Magnoler", "comment_text": "Train!"}, {"username": "Karen Blackmore", "comment_text": "From Milan, I'd go to Lake Como if you want a day trip that doesn't mean spending most of the day on the train!"}, {"username": "Rosa Zordan", "comment_text": "Why bother going, are you aware of where you're going. Best do some research."}]}, {"id": "2212079379191140", "text": "Help please!\nI’m recovering from a severe illness. This is not the scenery where I want to spend my whole coming winter.\nI think Italian sun, beauty, nature - and food would heal me.\nWould you mind suggestingआणखी where to I should go? 1-3 months maybe. By the sea. Beaty, serenity, activities, a lot to see and experience. Will need a house or 2 br apartment. Not a millionaire, but loving quality, design and beauty.\nPrivate messages also appreciated. Picture is from Tallinn Jan 2023. I’m Finnish.\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2212079379191140/", "likes": 22, "comments": [{"username": "Diana Subkova", "comment_text": "Tuscany or Amalfi cost 🙂 I hope you are well now and definitely believe that 1-3 months in Italy will help you a lot!"}, {"username": "Fabio Clemente", "comment_text": "If you want to go to Italy in the winter I would suggest to go to the South. Sicily is gorgeous and the food is amazing"}, {"username": "Chiara Varricchio", "comment_text": "South Italy."}, {"username": "Iolanda Gil", "comment_text": "Lisbon, Portugal, we have a sunny and warm winter and also culture"}, {"username": "Brenda Evans", "comment_text": "Sardinia x"}, {"username": "Anu Raun", "comment_text": "In Tallinn is warm inside houses, but in Italy there is more like 16 degrees inside....I live in Tallinn but lived in Italy few years."}, {"username": "Suzanne Ryan", "comment_text": "Sicily is a fab place to spend time. However when I was there Oct 2 years ago it was colder and wetter than normal. Food is amazing!!"}, {"username": "Maria Y Alexieva", "comment_text": "Campagna - Naples (cheap) Sorrento, Capri - good for Christmas, or in Pulia - Bari, Taranto, Brindisi. Temperature around 15°-18°C and sunny."}]}, {"id": "2212069972525414", "text": "Hi there\nPlanning for June/ July 24\n7 days in Rome with day trips and 6 in Florence ( or stay outside Florence)\nThen 2 days Venice ?\nWhat are your thoughts/ advice please", "link": "facebook.com/groups/1373361046396315/permalink/2212069972525414/", "likes": 1, "comments": [{"username": "Alicia Burno", "comment_text": "We are doing now a 15 day trip. We chose for bases: Bologna, Rome, Sorrento. From those places we did day trips. We are 4 ( 2 adults and 2 teens). With only carry-ons and backpacks for easy mobility."}, {"username": "Wendy Ann Wilson", "comment_text": "Catch a fast speed train from rome to Naples then normal train to Pompeii. Was awesome day trip. We stayed in an massive apartment in rome near colleseum called residenza nationale via booking com. Very central to walk."}, {"username": "Kejdi Okej", "comment_text": "We are doing now a 15 day trip . We chose for bases .. Bologna, rome Sorrento. From those places we did day trips. We are places we did day trips . We are 4 2 adults and 2 teens ) . With only carry ons and backpacks for easy mobility"}]}, {"id": "2212078539191224", "text": "Hello, arriving in Olbia airport Sardinia on 5th of September. Any advice on reasonable taxi services please ? I’m getting really expensive quotes !\nGrateful for any help, thanks in advance", "link": "facebook.com/groups/1373361046396315/permalink/2212078539191224/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "look here https://\nwww.viator.com/\ntours/Sardinia/\nArrival-or-depar\nture-transfer-f\nrom-Olbia-Airpo\nrt-to-any-desti\nnation-in-Sardi\nnia/\nd24293-8653P271?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}]}, {"id": "2212058719193206", "text": "My husband drinks decaf coffee only. It’s readily available in cafes in Australia now. Do cafes in Italy usually have this available for espresso? Thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2212058719193206/", "likes": 7, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "yes, just ask a decaffeinato :)"}, {"username": "Francisca Lis", "comment_text": "Pues claro :)"}, {"username": "Maureen Buccelli", "comment_text": "Yes! And it’s just as delicate as regular"}, {"username": "Beth Ann", "comment_text": "Yea ask for deca"}, {"username": "Michelina Pescatore", "comment_text": "Absolutely, Deca"}, {"username": "Iris Garza", "comment_text": "Yes"}, {"username": "Ali Everson", "comment_text": "Yes Cafes do but not all Restaurants."}, {"username": "Pietro Adami", "comment_text": "Yes"}, {"username": "Vivien Paulik", "comment_text": "Just ask for it 😁"}, {"username": "Sara Regimenti", "comment_text": "Ma certo! Io lo prendo sempre decaffeinato macchiato al vetro (It\"s a Little cappuccino, coffee with a Little bit of milk, foam of milk) relax :)"}, {"username": "Lisa Valdovinos", "comment_text": "Yes"}, {"username": "Sara Butcher", "comment_text": "I drink decaf and had no probs getting decaf in Italy ❤️🇮🇹🇦🇺"}, {"username": "निनावी सहभागी", "comment_text": "Thanks everyone"}]}, {"id": "2212061135859631", "text": "Hi does anyone know where the luggage storage is in Naples train station and price? Is it safe and where do we get train to Pompeii we are coming in from Rome. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2212061135859631/", "likes": 1, "comments": [{"username": "Isabelle Scicluna", "comment_text": "The luggage store in Naples is a shop called KI Point ... look for Italo train ticket office (centre) and it is just some metres Behind them. I don't know the price but it is very safe."}, {"username": "Isabelle Scicluna", "comment_text": "If you have already bought the train ticket from Rome to Naples, to get to Pompei you either try and see if there is any regional train going (trenitalia) or the other option is go 1 floor down and look for the Circumvesuviana\noffice...they do a metropolitan train to both the excavations or the city centre of Pompei (it is a 45 min ride)... if you haven't booked the train from Rome yet, check out directly italotreno website. They offer a train + bus package"}, {"username": "Alicia Burno", "comment_text": "From Rome to Pompeii there is no direct train. We did it today. We took italo train, bought the ticket at the Rome Termini to Napoli. In Napoli we bought the ticket to Pompeii in Circumvesiana (or something like that)"}, {"username": "Roxanne Franquelli", "comment_text": "Yes. It is safe to use. We just used it last week. It’s in the station."}, {"username": "Allan Olexa", "comment_text": "There is a large mural sign for the local train to Pompeii in Napoli Centrale. After buying a local train ticket, make sure to validate it in a yellow box on a wall before boarding. Just insert into the top slot with the small ticket to the left side of the wider slot. The train stops right at an entrance to Pompeii."}, {"username": "Rachael Richardson", "comment_text": "You can store luggage at Pompeii station if needed it’s €6"}, {"username": "Jenny Payne", "comment_text": "Google it and gives you all the details I would imagine like Rome& Florence do 🌻"}]}, {"id": "2212050275860717", "text": "Travelling from Salerno to Minori by taxi. Any taxi recommendations\nfor that part of the coast and any ideas of cost? (I know there is a ferry option)", "link": "facebook.com/groups/1373361046396315/permalink/2212050275860717/", "likes": 0, "comments": [{"username": "Vannia Renee", "comment_text": "Following! I am traveling to Maiori and I would love recommendations\non how to get there from Salerno!"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "look here https://\nwww.viator.com/\ntours/Salerno/\nTransfer-from-Sa\nlerno-train-sta\ntion-or-port/\nd4736-89317P3?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "Andrea Bainbridge", "comment_text": "We were very happy with www.amalfilimou\nsinecarservice.\ncom. Used them for two trips."}]}, {"id": "2212031805862564", "text": "Does anyone have any tips for flying Brisbane to Milan with a stop over in Dubai. Wondering if melatonin helps with the very long trip and if so when to take it? Leaving 9.00 pm.\nThanks for any advice given.", "link": "facebook.com/groups/1373361046396315/permalink/2212031805862564/", "likes": 8, "comments": [{"username": "Jenny Payne", "comment_text": "I do Perth Dubai Rome and as I go often I go into the time zone that I’m flying 2, yes it would help. My flight leaves Perth at 19:45pm and I arrive in Rome at 1:55pm so a great time to land + I never arrive on weekends just in case they are having a strike 🌻"}, {"username": "Jenny Payne", "comment_text": "Ment 10:45pm"}, {"username": "Tracy Beaumont", "comment_text": "Melatonin is best taken two hours before sleep 😴 when I fly, I prefer a low dose of phenerghan (anti histamine) easily available over the counter in Australia. I take just after boarding and usually have good sleep 💤"}, {"username": "Katrina Morris", "comment_text": "My flight leaves at 2.50am, when I booked I thought it was the afternoon. I leave from Brisbane to Dubai. Not looking forward to it. Restavit normally works for me"}, {"username": "Leone Karzon", "comment_text": "That 9pm flight is our preferred one, usually a couple of hours in Dubai then you get to your destination late afternoon, check in, quick look around, bite to eat then off to bed. Flight wise we always book the exit row seats for a bit of comfort (cheaper than business class 😁), I usually sleep only in 15-30min blocks on a plane so I just watch movies, or read. It sucks but it's only 24hrs and you're there enjoying yourself."}, {"username": "Maria O'Callaghan", "comment_text": "I have just taken delivery of a spray Melatonin. In the past I found it really helped, so hoping the spray works as well.\nFlying out next Sunday"}, {"username": "Lisa Nordby Robilliard", "comment_text": "I also fly out of Australia, and I never sleep on planes. My best trick is wearing pressure knee high stockings."}, {"username": "Kath Devery", "comment_text": "We fly from Sydney via Dubai then to Italy. I take travelcalm with the first meal and tend to sleep for a few hours. It takes about half an hour to kick in. Have a lovely trip x"}, {"username": "Lorissa Gill", "comment_text": "Take sleep-eze"}, {"username": "Rhona OConnor", "comment_text": "I take melatonin with my meal and sleep well on long flights..... Often the whole way home from Oz."}, {"username": "Sandy Michelle Duggan", "comment_text": "we flew Perth to Dubai at 10.45pm , then Dubai to Venice, I used melatonin, and tried to sleep straight away. coming home was even better, our flight from Dubai was at 2.45am, they kept the cabin dark and quiet,"}, {"username": "Sara Butcher", "comment_text": "I’ve flown from Sydney twice via Dubai. Each time I base when to sleep and be awake on what time it will be where I arrive. On the 6am flight I sleep after they serve breakfast about hour or so into the flight and break sleeping/awake so the last 7-10 hours I’ve been awake as the flight gets in around 9:30pm. Have a fabulous holiday!❤️🇮🇹🇦🇺"}, {"username": "Kejdi Okej", "comment_text": "Ment 10 .. 45pm"}, {"username": "Ngaire Wiernicki", "comment_text": "Best thing for me is hydro light before I fly & the day after. I take a sleeping tablet once I land at night to help get on the time zone (for a day or so what ever I feel is needed) ……. Flying back to Australia is always harder for me! Hope this helps"}, {"username": "Dayna Moritz Zavone", "comment_text": "I take Melatonin and follow the advice on a jet lag calculator. It works a treat for me. My hubby prefers a Phenergan (antihistamine)\nand a beer. However, I find that Melatonin helps me to drift off easily but I wake if needed (travelling with kids) and I don’t wake feeling groggy or grumpy.\nI didn’t suffer at all with jet lag"}, {"username": "Shelley Howard", "comment_text": "Just did similar from Christchurch nz .. drink plenty of water and rest when u can.. when u arrive get right into it don't nap and go to be at their bed time .. im Herr now e weeks into 2 mth trip .. u don't need to take drugs or other gimmicks in my opinion... was about 38 hr trip ..."}]}, {"id": "2212030135862731", "text": "I have seen a lot of posts about pickpockets and petty crime when visiting Italy and wanted to give my experience. Our first day in Rome last year and we went to see the Pantheon. When we came to take a photo we realised the phone was in a taxi we had rode in earlier. I rang it..and the driver answered and brought it back to us around an hourआणखी later. So don't panic about petty crime ..just look after your belongings (unlike us) like you should at all times anyway ..and stay aware :) I adore Italy and will be back again next month going to Verona and Venice ...I cannot wait 💖", "link": "facebook.com/groups/1373361046396315/permalink/2212030135862731/", "likes": 1, "comments": []}, {"id": "2211998482532563", "text": "Can someone please advise if the 15min viewing of the Last Supper is at the start or end of the 60 min tour? We could only get tour tickets, but might be short of time to complete the whole hour!? TIA", "link": "facebook.com/groups/1373361046396315/permalink/2211998482532563/", "likes": 0, "comments": [{"username": "Robin Burrell", "comment_text": "Ours was at the end"}]}, {"id": "2211978315867913", "text": "Hi. Planning to go to tropea next summer. What day trips do you suggest that I can do? We will not have a car. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2211978315867913/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Tropea/\nCoast-to-coast-T\nropea-Capo-Vati\ncano/\nd33165-130594P2?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Tropea/\nSTROMBOLI-BY-NIG\nHT/\nd33165-179144P1?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}]}, {"id": "2211954322536979", "text": "Ciao my friends- I am looking for some suggestions for a hotel in Bologna for the end of NOV for our 25th annv (3 nights) - 4 star ish + with walking distance to town and sights. Great view is a big plus! GRAZIE for your suggestions! :)", "link": "facebook.com/groups/1373361046396315/permalink/2211954322536979/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187801-d2305\n09-Reviews-Hote\nl_Corona_d_Oro_\n1890-Bologna_Pr\novince_of_Bolog\nna_Emilia_Romag\nna.html"}, {"username": "Judy Jamieson Pisano", "comment_text": "The Art hotels are all on the main square."}]}, {"id": "2211920949206983", "text": "Euros⁉️\nWhat’s the cheapest way to get Euros before I leave the ￼US?\nMy bank says they charge no fees, but I am paying $40 over the exchange rate.\nHelp‼️", "link": "facebook.com/groups/1373361046396315/permalink/2211920949206983/", "likes": 62, "comments": [{"username": "Rick Schneider", "comment_text": "Don't bother , get them at a banks ATM when you arrive ,not at an exchange booth!"}, {"username": "Charlene Noll", "comment_text": "Use an atm when you get where you are going. If the atm asks if you want conversion say no, let your bank do it. Make sure your visa and debt card don’t charge conversion fee"}, {"username": "Carrie Duffy VanderMolen", "comment_text": "Wait until you get there."}, {"username": "Diane Desmond Rosenfeld", "comment_text": "You can get euros at\nAAA office"}, {"username": "Carmine Recine", "comment_text": "Shop around"}, {"username": "Rosanna Hardeman", "comment_text": "Wait until you land, and go to an ATM outside of the airport. Airports have the worst exchange rates."}, {"username": "Darius Antia", "comment_text": "Use an ATM soon after landing. You will get a better rate using your bank debit card in Italy. If you have a Schwab debit card your fees will be refunded."}, {"username": "Laura Uribe", "comment_text": "We use only bank ATM’s in Italy. Deutsche Bank and Bancomat have minimal fees. Do not accept when the ATM offers to convert the charge. Your bank will do that at todays rate."}, {"username": "Tara McCloud Odebrecht", "comment_text": "ATM when you arrive. Decline conversion and fees. Easy peasy. Cards are accepted in 98% of places"}, {"username": "Melanie Noah", "comment_text": "Wait until you get there and go to a bank there and use the ATM. That’s what we did. Our bank had no foreign transaction fees."}, {"username": "Abigail Rosas", "comment_text": "Request it at your bank, I did with Bank of America"}, {"username": "Terri Bradford", "comment_text": "We use a kiosk at our local mall called currency exchange international. They have the best prices we’ve found."}, {"username": "Sonya Valentino", "comment_text": "If you have a chase credit card, you can go into chase and order them, it takes about two days and no fees"}, {"username": "Milt Lawhorn", "comment_text": "Your bank isn’t very customer friendly, my bank (Zions) charged me a flat $10, call some different banks in your area. Exchanging dollars for Euros in the US is the cheapest way to go."}, {"username": "Zoe Gardiner", "comment_text": "Wise account!"}, {"username": "Zoe Gardiner", "comment_text": "Get the app zero fees on atms if you get a card as well and automatically converts currency when making purchasing with apple wallet"}, {"username": "Megan Dempsey Lelli", "comment_text": "Go to a AAA."}, {"username": "Paul Capicchioni", "comment_text": "Hunter Biden gets the $40!"}, {"username": "Pop Cha", "comment_text": "Like others had said. Don't bother. Just go to ATM at the airport . However check with your bank if they have foreign transactions fee. I end up closed my TD Bank accounts and go with Capital One."}, {"username": "Salvatore Giardina", "comment_text": "Euros from your bank is not the best way…. But you should have some euros when you arrive at airport. ATM machines in Europe is best for exchange. If they prompt you for withdrawal in USD, decline and continue with euro. The downside of atm in Europe are withdrawal fees which are high. Some banks have international plan which do not charge extra for international withdrawal. Good luck and have fun!"}, {"username": "Donna Cafora Shepard", "comment_text": "I get it from an atm in the airport with my debit card."}, {"username": "Anna Cuoci Wittman", "comment_text": "AAA"}, {"username": "Esther Wildenberg", "comment_text": "Exchange in USA, not Italy! The exchange rates there are outrageous."}, {"username": "Sue Levy Avinir", "comment_text": "Get at the bank directly in Italy. Use only a bank ATM though. Not the random ATMs you see everywhere. Easy to find a bank with google…."}, {"username": "Alicia Cox", "comment_text": "An ATM at an airport or train station will cost more. Call around & find a place in the USA where you can get some like just 300 & it will be one less worry right when you land."}, {"username": "Mari Falcone", "comment_text": "Sapphire doesn't charge a fee for conversion. We just use Bancomat everywhere."}, {"username": "Christy Baldwin", "comment_text": "If you’re a AAA member you can get 200$ worth with no fee. Mine always arrive within two days or so."}, {"username": "Pamela S. Francois", "comment_text": "All very helpful information!!"}, {"username": "Shelly Kentner Lehman", "comment_text": "Still a good deal I’d say do it"}, {"username": "Suzy Coler", "comment_text": "Suzy Coler"}, {"username": "Kevin Kappel", "comment_text": "The Dollar is Down, your going to pay extra."}, {"username": "Denise Townes Giacobba", "comment_text": "Wait til after August when the season is over; that will go way down"}, {"username": "Keith Al-Dijaili", "comment_text": "I just use my Visa card. Everyone takes it"}, {"username": "Anne Davidson", "comment_text": "Look for currency exchange places and check against posted rates."}]}, {"id": "2211918849207193", "text": "We would like to travel from Florence to Siena for a day trip and won't have a car. We don't want to do a formal tour so are thinking of taking the train. Has anybody in this group taken the train and how was the experience? Are there better transportation options? Thanks in advance for your feedback!", "link": "facebook.com/groups/1373361046396315/permalink/2211918849207193/", "likes": 3, "comments": [{"username": "Laura St James", "comment_text": "Following. I want to do this too. Looking for best option."}, {"username": "Mary Anna Machi", "comment_text": "Bus is easy and better than train because it stops close to center of town. Train is outside town and requires taxi. Can get bus behind Florence train station and is nice ride."}, {"username": "Elizabeth Elle", "comment_text": "I did the train many years ago and was thinking to do so again. Super easy with luggage (not an issue for a day trip). Walking from the station into Il Campo is pretty. Haven’t looked into bus instead, yet, but I guess I will now! Does let you off more centrally!"}, {"username": "Mary Anna Machi", "comment_text": "Taking bus to sienna and then getting taxi and train back might be nice."}, {"username": "Ishbel Raffle", "comment_text": "The walk from the train station into the town is fairly easy as you can access a series of moving walkways and escalators from the shopping mall opposite the station which take you up to the city walls. Then walk down into the centre"}, {"username": "Cat Furness", "comment_text": "Train is very easy, and the walk to town is not far. You need to cross the road when you get out of station and go towards the shopping centre and take the moving walkway all the way to the top, the turn left and walk straight into town. Or when you get to the shopping centre take lift downstairs to catch the bus into town."}, {"username": "Yvonne Grainger", "comment_text": "Following. Was hoping to get to Siena as well"}, {"username": "Rosanne Messineo Mills", "comment_text": "We just took the train to and from Siena last week for a day trip. We booked a direct train (some require a transfer). It was super easy. We took a cab to and from the center of town —10€ each way.\nHighly recommend this option."}, {"username": "Claudette Brunelli", "comment_text": "Thanks everyone!"}]}, {"id": "2211915295874215", "text": "Is there more than one train station in Rome? Flying into Rome and then using trains to get around the country. Working out where to stay near the train line that goes to Naples. What is the name of the train station we have to be at to get the fast train to Naples? Also do we get a train it taxi into Rome. Thinking is staying at Hotel Assisi.", "link": "facebook.com/groups/1373361046396315/permalink/2211915295874215/", "likes": 4, "comments": [{"username": "Silvia Bindi", "comment_text": "Roma Termini"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Roma Termini"}, {"username": "Pat Cirillo", "comment_text": "There are three train stations in Rome. You want Termini to go to Naples."}, {"username": "Marty Harte", "comment_text": "Took Trenitalia Frecciarossa train from Termini to Naples few weeks ago. Easy ride."}, {"username": "Claire Dowson", "comment_text": "Termini is the main station. Airport train and train to Naples from there."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Don’t limit yourself to being close to the train station. It is the sketchiest part of any city including Rome."}, {"username": "Sandy Radican Shikaly", "comment_text": "Roma Termini is the main station.. Both companies Italo and Trenitalia have high speed trains to Naples.. I prefer Italo. I love Rome, but not around Termini.. too sketchy, transients and pick pockets.. Stay in the city center."}, {"username": "Jason Hobel", "comment_text": "From the airport there is a train called the Leonardo Express which can take you to the two main stations. Most people go to Rome Termini"}, {"username": "Nikki Buxman", "comment_text": "Google search \"Rome train stations\" i like Tibertina."}, {"username": "Carolyn Adams Brown", "comment_text": "We took the Leonardo Expeess in April. You can buy a ticket to use on a certain day so no worries about missing the train due to late flight or getting stuck in customs.. It us easy to find and will take you directly to Termini Station. We stayed the night near the train station since we had a long flight and arrived after dark, then in tbe morning contined on to Naples.. We would stay further away from the train station next time. Kind of sketchy area!"}, {"username": "Sam Mah", "comment_text": "Do consider a Eurail pass. First pencil out yor trip then go to the Trenitalia site and work out the cost of the tickets. Then check to see if there is a cheaper Eurail pass. Join the Eurail and Interrail travellers fb page and check out the Seat61 train information site online."}, {"username": "Rebecca Yeoh", "comment_text": "The station you need is Roma Termini. Stay around the Pantheon / Piazza Navona / Campo de’ Fiori areas and you can ask your hotel to book a taxi to take you to Roma Termini. Will cost about 12 - 15€. Don’t stay near Termini station, I started and ended my Italian holiday in Rome, the first hotel was near Campo de’ Fiori and the final stay was near Termini (due to early morning flight). It is a completely different experience staying near Termini, wouldn’t suggest it."}, {"username": "Alane Riley", "comment_text": "Thomas Riley"}]}, {"id": "2211914052541006", "text": "Suggestions needed for private transfers from Rome airport to Tuscany.\n\nHi all, I'm hoping to find suggestions for reputable private transfer companies that people might recommend.\n\nMany thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2211914052541006/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nPrivate-Tour-Tus\ncany-Daytrip-fr\nom-Rome/\nd511-8733P19?pid\n=P00070587&mcid\n=42383&medium=l\nink&medium_vers\nion=selector"}, {"username": "Allison Carlisle Young", "comment_text": "We used limousinrome.co\nm had a great experience with them. Family of 5. Always on time. Prompt"}, {"username": "Heather Hills Jacobs", "comment_text": "We loved Venice Group Services!!"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 8, "comments": []}, {"id": "2211872395878505", "text": "Will be staying at the Hilton at Rome airport. What do you suggest we do other than going into Rome?", "link": "facebook.com/groups/1373361046396315/permalink/2211872395878505/", "likes": 0, "comments": [{"username": "Mike McClane", "comment_text": "Plan on a long cab ride. Rome Hilton isn’t very nice"}, {"username": "Gianna Onesi", "comment_text": "If based in Rome take the high speed train to Pompei"}, {"username": "Shelley Frise", "comment_text": "Stay at the Hilton in Rome. It’s close to everything and and easy commute from the airport."}, {"username": "Shelley Frise", "comment_text": "The Hilton will arrange transportation each way. It’s well worth the extra expense"}, {"username": "Mary Anna Machi", "comment_text": "Ck out Ostia antica - close to airport and very interesting ."}, {"username": "Rhona OConnor", "comment_text": "Watch the airplanes coming and going 🤔"}, {"username": "Santo Finocchiaro", "comment_text": "We only used this hotel the night before our flight home. You are a good 35 car ride outside of Rome."}]}, {"id": "2211860319213046", "text": "Rome: Is it better to do hop on and off tour bus or regular public bus transportation to get around when unable/\nunwilling to walk?", "link": "facebook.com/groups/1373361046396315/permalink/2211860319213046/", "likes": 2, "comments": [{"username": "Jojo Hanna", "comment_text": "I found the HOHO buses very reliable in Rome. There is a ticket that covers all the HOHO buses. There’s also the subway, €7 for a day ticket. I don’t know how accessible the stations are, didn’t use it."}, {"username": "Marscha Fransisca Debora Basdew", "comment_text": "Hop on Hop off is perfect 🤗"}, {"username": "John Spensieri", "comment_text": "Taxi is inexpensive"}, {"username": "Daniele Zarka", "comment_text": "Was on crutches on my last visit (been lucky to go to Rome dozens of times) and I found public transportation super easy and I could go where I wanted, when I wanted. If it’s your first visit, I’d start with the HOHO to see the highlights and then pick where you want to stop on a 2nd round."}, {"username": "Jodie Christensen", "comment_text": "Hop on hop off is great. It has stops everywhere and there is usually one every 15 to 30 minutes. Or the underground subway."}, {"username": "Robin Barbera", "comment_text": "Yes"}, {"username": "Patricia Capuccio", "comment_text": "Stay home"}, {"username": "Nikki Buxman", "comment_text": "€24 will get you a week on the metro and buses."}, {"username": "Holly Clifton", "comment_text": "Hop on hop off."}]}, {"id": "2211839085881836", "text": "Are the tourists sites too busy on the first 2 weeks of September? Traveling from September 1-17 and wishing Italy is less crowded by then. Any idea?", "link": "facebook.com/groups/1373361046396315/permalink/2211839085881836/", "likes": 0, "comments": [{"username": "Francesca Giovanelli", "comment_text": "I live in Bellagio and September hotels are fully booked (all foreign tourists). Maybe there are fewer Europeans, but I noticed that after the covid there are many more young people around even during the school / work period"}]}, {"id": "2211834205882324", "text": "For those traveling from Australia, did your appliances, aka hair straighteners, go ok ( once you use the international adapter. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2211834205882324/", "likes": 12, "comments": [{"username": "Shania Grieve", "comment_text": "I’m in Italy at the moment, everything works fine 😊 I found my straightener took a bit longer than usual to heat up but nothing crazy"}, {"username": "Monica Grieger", "comment_text": "We got our adaptor from shein and it works fine 👌"}, {"username": "Debra Therese", "comment_text": "Yes"}, {"username": "Denise Colls", "comment_text": "Yes"}, {"username": "Kathy Boyle", "comment_text": "Most hotels have hair-dryers inthe room or reception"}, {"username": "Christine Amy", "comment_text": "Hair straightner- yes\nHair dryer no"}, {"username": "Dana Curcic", "comment_text": "yep you just have to make sure the voltage on the adapter is high enough 🙂"}, {"username": "Anna O'Connor", "comment_text": "No problem at all."}, {"username": "Ana Paulus", "comment_text": "Yep no issues"}, {"username": "Tanya Gomes", "comment_text": "Yes all works fine with Australian hair dryers and hair straighteners I had no issues"}, {"username": "Tiffany Boland", "comment_text": "Thank you everyone!!"}, {"username": "Bellafab Fabrizio", "comment_text": "There is a great one from kmart that has multiple usb adaptors too"}, {"username": "Cat Furness", "comment_text": "It worked fine, although it was way to hot to use them lol"}, {"username": "Todd N Nicole Clarke", "comment_text": "To save space I just took my straightener which worked fine, just don’t take a Dyson, if you read the Dyson forums and Facebook groups even though voltage is the same it can stuff them and void warranty"}]}, {"id": "2211825909216487", "text": "I need some help! My daughters are traveling to Florence Italy for study abroad. I have about 10 days to vacation with them. If I go to Florence, do I do a roundtrip ticket? My plan was Florence, to Rome And Almafi Coast as the last stop. How should I travel to these cities? Train?", "link": "facebook.com/groups/1373361046396315/permalink/2211825909216487/", "likes": 1, "comments": [{"username": "Tacey Baskett", "comment_text": "I met my daughter for her travel abroad and I flew into Pisa so I could see the Leaning Tower of Pisa, took the train to Florence to meet her. Took the train to Rome (we didn't go anywhere else as we didn't have as long as you) and then took the train back to Florence and flew out there. Florence was our favorite!"}, {"username": "Katie Mahoney-Salajan", "comment_text": "Thank you so much!❤️"}, {"username": "Alicia Burno", "comment_text": "We did Florence to Rome by train (Italo), then took another train to Napoli (Italo), from there another train to Sorrento, then a ferry to Amalfi Coast. We did this in 1.5 week. Now back in Sorrento."}, {"username": "Shelley Frise", "comment_text": "We did 3 days in Florence and 3 days in Rome. We loved both cities. Train is the easiest to get around. We absolutely loved Florence and wished we had another day or two in this area. We found we lost anywhere from a half day to a full day travelling between places. Hope this helps and enjoy your trip"}, {"username": "Lisa Valdovinos", "comment_text": "We did the train. Easiest way to go."}, {"username": "Charleen Siegler Schuss", "comment_text": "Fly into Pisa, that's the best Florence Airport. A short train ride to the heart of Florence. Fly out of Naples or Rome"}, {"username": "Ruth Hackert", "comment_text": "You don’t have to get RT….arrive in Milan & depart Naples"}, {"username": "Kejdi Okej", "comment_text": "Thank you so much l ♥️"}, {"username": "Andria Saia", "comment_text": "Take the train and fly out of Naples"}]}, {"id": "2211812209217857", "text": "Can anyone recommend a cooking class in Florence. I have seen several on Viator but would like a recommendation to one you have actually done. Thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2211812209217857/", "likes": 0, "comments": []}, {"id": "2211800659219012", "text": "Travel from Venice to Vienna - plane or train? Will be travelling early December.", "link": "facebook.com/groups/1373361046396315/permalink/2211800659219012/", "likes": 0, "comments": []}, {"id": "2211798259219252", "text": "My husband and I are in Milan for 2 days. Where should we go to eat, and what things should we do or see? Thank you. All suggestions are appreciated.", "link": "facebook.com/groups/1373361046396315/permalink/2211798259219252/", "likes": 0, "comments": []}, {"id": "2211797972552614", "text": "We have a free day in Amalfi and are wanting to do a day trip somewhere that is not on our tour. Sorrento maybe? Ideas appreciated!! If we go to Sorrento, best way to get there from Amalfi & what to do there, please.", "link": "facebook.com/groups/1373361046396315/permalink/2211797972552614/", "likes": 2, "comments": [{"username": "Alicia Burno", "comment_text": "From Amalfi Coast to Sorrento I recommend you the ferry. I am in Sorrento now and you have many places to see."}, {"username": "Debbie Linn", "comment_text": "Thank you! 💕"}, {"username": "Susan Hulsey Watkins", "comment_text": "Capri."}, {"username": "Debra Quinney", "comment_text": "Ravello beautiful village up in the mountains"}, {"username": "Suzy Chow", "comment_text": "If you are in Amalfi, you can do a kayak tour down the coast, or hike above town, visit the Paper Mill Museum, or enjoy a day exploring town and enjoying the beach."}, {"username": "Rachael Richardson", "comment_text": "Loved sorrento just for the walk around , views and market streets, capri in the summer is horrendous, give it a wide berth"}]}, {"id": "2211791299219948", "text": "Hi everyone! I remember seeing a schedule of the future train strikes last year before my trip. Does anybody know where I can find that? Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2211791299219948/", "likes": 4, "comments": [{"username": "Diana Himes", "comment_text": "https://\nwww.commissioneg\naranziasciopero\n.it/\ncalendario-sciop\neri?page=3"}, {"username": "Alicia Burno", "comment_text": "We were at Rome Termini a few days ago and they have it advertised that starting mid August there were going to be some changes because of the strike."}, {"username": "Cat Furness", "comment_text": "The futures strikes are all on the Trenìt app."}]}, {"id": "2211788229220255", "text": "Question: Cash/euros or credit card?", "link": "facebook.com/groups/1373361046396315/permalink/2211788229220255/", "likes": 1, "comments": [{"username": "Lisa Long", "comment_text": "We brought euros"}, {"username": "Jami van Wezel", "comment_text": "Credit card for almost everything"}, {"username": "Berndt Weihs", "comment_text": "Credit card!"}, {"username": "Ruth Hackert", "comment_text": "Both"}, {"username": "Victor Hernandez", "comment_text": "Credit card. Just pull out 2 or 3 hundreds euro from a local bank ATM just in case."}, {"username": "Fiona Mac", "comment_text": "Resolut card"}, {"username": "Jose Velez", "comment_text": "Credit card and 🏧"}, {"username": "Michelle Smith", "comment_text": "Cc and some euros cash for cabs toilets and small vendors."}, {"username": "Sherri Leis Dillavou", "comment_text": "Card"}, {"username": "Martin Corona", "comment_text": "Both."}, {"username": "John Bruckman", "comment_text": "Not cash… bring your atm… find out from your bank which banks they’re affiliated with and use those whenever possible you won’t pay fees. Don’t bring a bunch of cash…"}, {"username": "Barbara Kistler Wilhelm", "comment_text": "Had all 3"}, {"username": "Ed Wren", "comment_text": "Credit card for nearly everything, but a few euros pocket money for spur of the moment small purchases, plus u may need coins to access a bathroom"}, {"username": "Shawn Galbraith", "comment_text": "Both"}, {"username": "David Horgen", "comment_text": "I'm in Italy right now. Using my card for most everything. However, cash comes in handy for small things here and there. Just make sure your credit card company does not have foreign transaction fees. And I ordered euros through my bank. That way you can hit the ground running when you get here"}, {"username": "Fuad Osta", "comment_text": "Both"}, {"username": "Miklos Verdes Kovacs", "comment_text": "Lira✔️"}, {"username": "Zoli Berecki", "comment_text": "Gold nuggets ... here in Europe we're still living in ancient style."}, {"username": "Lisa Rodriguez", "comment_text": "Credit for purchases and cash to move around"}, {"username": "Lisa Martinson", "comment_text": "Euro or cc"}, {"username": "James Lim", "comment_text": "went to London and Berlin recently , apple pay everywhere!"}, {"username": "Marcus Hiesler", "comment_text": "Both"}, {"username": "Holly Clifton", "comment_text": "Have both on hand. You can get euros, from most large banks, before you leave and make sure your credit card has no international transaction fees and knows you are traveling so they don’t trigger a fraud alert and shut your card down."}, {"username": "Debi Sicurella Krulisky", "comment_text": "All"}, {"username": "Lisa Valdovinos", "comment_text": "Both"}]}, {"id": "2211787685886976", "text": "Do Vatican tickets from the official website sell out as fast as Coopculture tickets?\n\nAnd are tickets released 60 days in advanced, and also depending on the tour time (not just the tour date)?\n\nTIA 😌", "link": "facebook.com/groups/1373361046396315/permalink/2211787685886976/", "likes": 0, "comments": []}, {"id": "2211781925887552", "text": "Quick question, has anyone ever brought cash and exchanged for euros over there so they can pay for hotels in cash? Or can you pay American dollars cash at hotel?", "link": "facebook.com/groups/1373361046396315/permalink/2211781925887552/", "likes": 0, "comments": []}, {"id": "2211767535888991", "text": "My friend and I will be traveling to Rome in the beginning of September. We arrive around 12:00 noon and would like to do something low key in the afternoon. Any suggestions?", "link": "facebook.com/groups/1373361046396315/permalink/2211767535888991/", "likes": 1, "comments": [{"username": "Annie Slater", "comment_text": "On our first evening in Rome, after a long flight we went for dinner at Le Terme del Colosseo, a very cool restaurant that is located in what used to be Emperor Niro's palace cellar, right by the Colosseum. The ceiling is the original one from ancient Roman times. It was a very beautiful experience, with live music and delicious authentic Italian food.\nhttps://\nwww.letermedelco\nlosseo.it/"}, {"username": "Jenny Payne", "comment_text": "I would suggest walk to Trevi fountain & Spanish steps or take the red bus so you can get the feeling of Rome 🌻"}]}, {"id": "2211759939223084", "text": "Hi can I have ideas for packing in October please. I’m going to Puglia then north to Florence and Tuscany. I’m told by Tuscany trip organiser it will be cold but my Puglia people have said to pack bathers, sunscreen, hat etc. I am not a dress person but was told to pack a dress for dinner too. I want to travel light. Thanks in advance 😊", "link": "facebook.com/groups/1373361046396315/permalink/2211759939223084/", "likes": 5, "comments": [{"username": "Charlene Noll", "comment_text": "Long light weight sun dress and flats. If you take a sweater to match/wear over u can use the same dress for dinner in Tuscany."}, {"username": "Linda Ferri", "comment_text": "A nice pants outfit is fine for dinner if you'd prefer not to wear a dress. I do it all the time."}, {"username": "Sharyn Farrelly", "comment_text": "You don't need a dress for dinner. If you do decide to bring one make it a long one and you can get away with wearing trainers with it."}, {"username": "Rhona OConnor", "comment_text": "Wear what you are comfortable with.... Its not that dressy unless you are going to a very high end place. Bring layers."}, {"username": "Beth Stewart", "comment_text": "I think it depends on your age\n\nI am old.(70)\n\nI Will be taking jeans to travel and colder evenings (October), “pedal pushers” (or whatever called\nNow!) and dress\n\nThe dress can be casual or\nDressed\nUp for evenings"}, {"username": "Cyndie Cooper", "comment_text": "How are you traveling from Puglia to Florence? Driving or train?"}, {"username": "Suzanne Carver Musashe", "comment_text": "I love this time of year. Like fall in states like ohio, Michigan and PA"}, {"username": "Sandy Hookerman Kriger", "comment_text": "Dress in layers. You don't need a dress just a nice pair of slacks blouse, possibly sweater or a blazer and bring a raincoat with hood! Comfortable shoes are a must.￼"}]}, {"id": "2211753285890416", "text": "Hi looking at booking a tour of the Ferrari museum and car drive for my husband has anyone done one, and who did they book through, he will be travelling from Florence. Thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2211753285890416/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Florence/\nPrivate-Ferrari-\nVip-Tour-from-F\nlorence/\nd519-123886P112?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}]}]