[{"id": "2198197850579293", "text": "How would you spend an afternoon in Florence after two days of seeing the popular sites? We’ve thought of a quick ride to another city or winery tour?", "link": "facebook.com/groups/1373361046396315/permalink/2198197850579293/", "likes": 0, "comments": [{"username": "Alice Francesca", "comment_text": "Try Lucca.Also Lerici."}, {"username": "Jim Kelleher", "comment_text": "Either walk around and get lost in Oltrarno or take a city bus to Fiesole."}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "Day tour to Siena"}, {"username": "Karen Schmidt", "comment_text": "Either, just wander with no itinerary. Maybe to the palace and gardens. Or…train to Lucca."}, {"username": "Renae Larcus", "comment_text": "Get out in Tuscany. Siena! San Gimignano! Lucca!"}, {"username": "Lisa Kelly", "comment_text": "We took the bus (across the street from train station) 131 Rapida to Siena and back. They come 2x an hour both directions. Go and stay as long as you want. It was great! If you want to go to the cathedral, buy your tix before and have them on your phone."}]}, {"id": "2198206113911800", "text": "i am thinking of statying in the termini station in rome. can someone recommend a nice hotel with a modern decor? is the termini station area dangerous? are there restaurants near the station? tia", "link": "facebook.com/groups/1373361046396315/permalink/2198206113911800/", "likes": 0, "comments": [{"username": "Lorraine Diven Park", "comment_text": "We stayed in Sophie Terrace Hotel which is 5 mins walk from Termini station. Small boutique hotel. Staff are really friendly and helpful. Location great - we walked to most sites but metro and HOHO bus beside Termini."}]}, {"id": "2198205603911851", "text": "Hi! Need tips to go to the Coliseum. We don’t want to spend the whole day there. Any tips please", "link": "facebook.com/groups/1373361046396315/permalink/2198205603911851/", "likes": 0, "comments": [{"username": "Dave Colleen", "comment_text": "We did a golf cart tour with bigatours.com. Jason is a fantastic guide."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2198208187244926", "text": "I would like to know if there’s a luggage storage facility at Milan station. I’m planning to catch the train from Milan to Como for a day. Then I want to continue to Venice. I’m thinking that I will have to come back to Milan then continue on to Venice.", "link": "facebook.com/groups/1373361046396315/permalink/2198208187244926/", "likes": 1, "comments": [{"username": "Connie Wilson", "comment_text": "There is, however when you return from Como the direct connection with a change in Milan is only 25-28 minutes, which may not be enough time to grab your bags."}, {"username": "Pietro Adami", "comment_text": "If you google “baggage storage Milano Centrale Stazione FS” a choice of places shows up"}, {"username": "Anita Downey", "comment_text": "Google bounce we used them in Milan 5 min walk from the station. 5 euro per day"}, {"username": "Pam Hughes", "comment_text": "We used them a couple of years ago and there was a big line to drop off .. fortunately pick up was better but you still need to allow extra time for this."}, {"username": "Fetchin Gretchen", "comment_text": "Yes, there are a few luggage storage facilities at Milan station. Here are a few options:\n\n* **Kibag**. This is a manned luggage storage facility located in the Galleria Commerciale at Milano Centrale. It is open 7am-9pm, 7 days a week. The cost is €6 for the first 5 hours, then €1.20 per hour thereafter.\n\n* **LuggageHero**\n. This is a self-service luggage storage service with several locations in Milan, including Milano Centrale. You can book your space online and pay by credit card. The rates start at €0.95 per hour or €7.9 per day.\n\n* **Stow Your Bags**. This is another self-service luggage storage service with a location near Milano Centrale. You can book your space online or in person. The rates start at €9 per day.\n\nIf you are only going to be in Como for a day, you might also consider leaving your luggage at your hotel in Milan. Most hotels will store luggage for guests for a small fee.\n\nI hope this helps!"}]}, {"id": "2198213510577727", "text": "Hi all, I have some ?s… Is it wise to explore Murano, Burano, and Torcello on my own without a tour? I prefer to explore without the added pressure or expense of a guided tour. If so, what is the best way to get to these islands? Should I by ferry tickets???… Amy help would be greatly appreciated.\n\nI only have 1 free day in Venice available to do this so not even sure if it can be done in 1 day. Looking forward to feedback. My trip is in August. Thanks 🙏 so much for anyone who responds.", "link": "facebook.com/groups/1373361046396315/permalink/2198213510577727/", "likes": 0, "comments": [{"username": "Laura Bartoli", "comment_text": "Hi, in my opinion you cannnot visit Venice, Burano, Murano and Torcello in just one day. Stick to Venice and enjoy it!"}]}, {"id": "2198221627243582", "text": "Thankyou to this group for all of the great advice, tips, photos, and accounts of your travels to Italy. It's been twenty years since we travelled to Europe and so I did need some help to plan and think about all the things that might need some preparation before we left. We have just returned from two weeks in Italy, we picked two locations, the first week was spent relaxing and enjoying Sicilian food, culture, language and beauty in Taormina and the second week was in Rome.\n\nWe flew in to Catania from London late in the evening and found ourselves at midnight feasting on seafood and pizza in the outdoor pub restaurants near the fish market, Catania is always fun, intense, great food! We stayed there one night before and after our main trip to Taormina, so we were close to the airport. Also we were so lucky to avoid any airport closures due to external events (Etna/strike/fire) we didn't have any issues flying in and out of Sicily but I'm always mentally prepared for disruptions so it's good when it goes smoothly.\n\nWe always love staying in Taormina, and this time was perfect. The apartment had three balconies with incredible views of the sea, we went out or cooked with the fresh local food and we walked everywhere. It was pretty hot but we just ate our bodyweight in granita and gelato 😁 wore hats, covered up, kept in the shade and had a day at the beach swimming in the cool waters of Isola Bella. We watched an opera in the Greek Ampitheatre in Taormina on our last night which was very special.\n\nWe flew from Catania to Rome and spent four nights there jam packed full of adventures!\n\nWe stayed near the Borghese gallery in a lovely little three star hotel with great staff in Sallustiano near the embassies. We walked everywhere, this was sometimes overwhelming when it got too hot so at that point we retreated into a cafe and ate and drank cold things in the aircon just to cool off and revitalise ourselves, or we would find an air-conditioned art gallery and just hang out amongst the art for a couple of hours.\n\nBefore I left I managed my expectations with respect to booking tours, I booked with the venues directly and I decided if I couldn't get in that would be fine.\n\nThe Colosseum was the most difficult to secure tickets to but I managed to get the full experience super ticket, with underground tour for 930am through the coop culture website. Honestly I was testing this site out weeks before the date our tickets would be released and I was shocked to get four tickets for that time. The only slight issue was that the tour was only in Italian (there were absolutely no English tours available that I could see), but my daughters were able to translate (high school Italian) and I used Google transcribe (which worked intermittently). This tour was fantastic, I'm so glad we did it. We almost missed it though because most staff there didn't believe /see on our ticket that we had booked tour and we just happened to find someone with the correct information who sent us back to the meeting place for tours. We were so hot after the tour we collapsed in a cafe opposite the Colosseum, spent a small fortune on pancakes in this beautiful air-conditioned place, and once we were rehydrated went on to visit the Roman forum using Rick Steve's tour as a guide. We even got access to the incredible Chiesa di Santa Maria Antiqua with 6th century frescos. So beautiful. We did somehow miss Palatine Hill due to a toilet emergency but by then we had all expired!\n\nI booked directly through the Vatican museum website for the early morning 730am Vatican museum tour with Sistine Chapel and breakfast, this tour was also fantastic with only a couple of other groups there at the same time. This was an English speaking museum guide. The breakfast was good, and afterwards we battled our way back through the throngs of people into St Peter's Basilica where we spent another couple of hours just exploring the church and walking right up to the top of the dome (we took the elevator part of the way) for fantastic views of Rome. Then we walked to Trastevere as we wanted to check this neighbourhood out. We walked along the Tiber river part of the way. We were just so hot at that stage we devoured gelatos at two places in quick succession less than 500m apart and then needed the toilet so we ended up visiting the beautiful Galleria Corsini and spending a few hours in the cool air conditioning. This ticket allowed us to visit the partner Gallery Barberini the next day.\n\nI booked the English speaking guided tour of the Borghese Gallery directly through their website, this tour was also amazing. It was like an art history lesson, and we really loved the Borghese Gallery, it was full of stunning Italian art! We then walked through the park to La Galleria Nazionale, with modern art in a fantastic building, again the air conditioning was sublime!\n\nWhen we first arrived we had a quick walk to visit Fontana di Trevi, Piazza di Spagna and the Spanish steps and the Chiesa della Trinita dei Monti. There was so many people there, but we just kind of launched ourselves into the masses, got our photos and moved onto the next site. This was our introduction to Rome and after that we were fine with huge crowds.\n\nI only booked two restaurants in Taormina, and a rooftop bar in Rome and the rest of the places we ate were places we passed near our accommodation or recommended by our host.\n\nI was worried about thefts, we all had bought cross body bags with extra clips to lock, and passport wallets to hide under our clothes, and we were super vigilant about where our bags were all of the time. Luckily we remained safe, and we didn't see any pickpockets while we were there, I've had that experience with previous trips to other countries so I was preparing myself, but again so lucky that wasn't our experience this time.\n\nWe used our Australian phones, these were not able to replace the Sims or use esims so we added some international roaming travel credit and I also hired WiTourist (recommended on this site) who provided a pocket Wi-fi device. We got the middle of the range model so we never ran out of data, it did run out of battery so they had a heavy portable battery to recharge it on the go (I didn't use this much). Anyway it was excellent for us with coverage in Sicily and Rome. Very easy to use and organise for delivery etc.\n\nWe walked 50km in the last week, it was great being able to get around Rome so easily by foot. I did get blisters and bought replacement blister bandaids there, I have 3B cream for any chafing (excellent) and we all wore sneakers most of the time. I had a linen skirt, trousers, and three dresses, and a shirt to cover my shoulders. My bag was a backpack, it was never more than 11kg and so handy for walking up stairs! My husband took a small carryon. The large suitcase we had was a burden, I wish we had two smaller ones instead. These were for my teenage children, but we know better for next time.\n\nWhat a wonderful experience we had, it was worth the brutal long haul flights from Australia and so amazing to spend time in Italy with our children. We tried to speak Italian everywhere, everyone was kind to us, and we had such a great holiday. I was very grateful for your advice on this group, and hope others have a good experience also in their planning and on their holiday.", "link": "facebook.com/groups/1373361046396315/permalink/2198221627243582/", "likes": 209, "comments": [{"username": "Fiona Cohn", "comment_text": "Fabulous write up Lisa! I got back a week ago."}, {"username": "Lynette Barbaro", "comment_text": "Can you tell me the name of your apartment in Taormina as we are goi g in October. TIA"}, {"username": "Dianne Merrick", "comment_text": "Very informative…."}, {"username": "Leonie McConnell", "comment_text": "Thanks Lisa for your great tips, going in October from Australia, first time for us so all info will be appreciated."}, {"username": "Kerry Jacobsen", "comment_text": "Thanks for taking the time to share your experience. I feel even more excited about our first European holiday in September. We are Aussie’s too! We are baby boomers (not very good with technology) and are a bit unsure about using our Aussie phones over there after reading your post. I’m thinking we can’t use e sims over there?"}, {"username": "Nancy Treviso Lalicata", "comment_text": "Lisa Jones can I have the name of the place you stayed in Taormina please. Thank you 😊"}, {"username": "Janine Brailsford", "comment_text": "Absolutely “frameable” photos.. every one! Beautiful. Great eye!"}, {"username": "Dixie Kotylak", "comment_text": "Back in Italia - Italy!"}, {"username": "Kimberly Ketterer Sedita", "comment_text": "Thank you for sharing your trip, photos and experiences. My husband and I are taking our three children to Sicily for two weeks on Tuesday. It will be our first trip to Italy ❤️"}, {"username": "Carmen Martin", "comment_text": "Love your photos ♥️"}, {"username": "Susan Wise", "comment_text": "I loved reading your story. Thank you! Our vacation there isn’t until spring of 2025 so I’m just getting ideas for now."}, {"username": "Michelle Plutto", "comment_text": "Thank you. Very helpful. Also confirmed my fear of people smoking. I have asthma and smoking is a major trigger. Very worries about this."}, {"username": "Pauline Maranda", "comment_text": "Quel est le nom de l’hôtel à Rome, près de ambassades"}, {"username": "Regan Verwey", "comment_text": "Thanks for sharing. We go in September from Australia. Our first trip to Italy too. We are going to Taormina with our cruise excursion. Nice to see your photos. Also going to Rome after the cruise."}, {"username": "Patrice Warren", "comment_text": "Great information - thank you for such a positive post! Can you please give me the name of the rooftop bar you went to in Rome?"}, {"username": "Deborah Wilson Melton", "comment_text": "Taormina was our favorite on our Italy adventure we had a wonderful apt right off of downtown square"}, {"username": "Victoria Russo", "comment_text": "Beautiful pictures & memories"}, {"username": "Lori Risco", "comment_text": "Can you tell me which hotel in Rome you stayed at."}, {"username": "Carrie Du Bois", "comment_text": "Thank you for sharing. This helps with my planning for my future trip to Rome!"}, {"username": "Paola Pulga", "comment_text": "Grazie per la condivisione del tour, vi aspettiamo ancora in Italia. Consiglierei il nord Italia : Milano, Verona, Venezia, lago di Como e naturalmente le Dolomiti"}, {"username": "Jerry Kiger", "comment_text": "Question — when you booked tours/sites directly … did you do that prior like 3-4 weeks, way earlier, or just wait to be in Rome? Think I will prefer the go with flow way but do want some tours as well, will travel July/Aug during hot tourist season … thank you"}, {"username": "Kathie Duffy", "comment_text": "❤️❤️❤️"}, {"username": "Kathy Fryer", "comment_text": "Fabulous photos. Thanks for sharing!"}, {"username": "Nancy Day", "comment_text": "Lisa Jones where did u stay in Toarmina"}, {"username": "Gabrielle Goodenough", "comment_text": "Absolutely beautiful. Glad you had a wonderful holdi. Thank you for sharing. Will be in Rome soon so will try your rooftop bar. Welcome home."}, {"username": "Carolina Alejandro Clabaugh", "comment_text": "Beautiful pics!"}, {"username": "Marisa Ursini Brancato", "comment_text": "Beautiful pictures! Are you a photographer?"}, {"username": "Lizzy Griffin-Cunningham", "comment_text": "Wonderful pictures and commentary....s\no glad you had such a spectacular time! Sicily looks wonderful!"}, {"username": "Debbie Plante", "comment_text": "Can I ask a couple of questions? Where did you stay in Taormina and what were the two restaurants you made reservations for? TIA"}, {"username": "Debbie Plante", "comment_text": "Loved your write up. I’m going to Italy for three weeks in October. One week in Sorrento, one in Palermo and one in Syracusa. I can’t wait. I’m hoping I here from you ( asked previously) what the restaurants in Taormina were and the name of hotel. I have time to change mine.\nThank you for the pics etc."}]}, {"id": "2198222383910173", "text": "We’re planning to drive from Palermo to Taormina. We will definitely stop at Cefalu for lunch. What would you highly recommend that we see or do in Cefalu during the few hours we have? Thanks in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2198222383910173/", "likes": 0, "comments": [{"username": "Laura Bartoli", "comment_text": "Just enjoy walking around and visit rhe cathedral. Cefalù is a lovely place!"}]}, {"id": "2198224467243298", "text": "Can I have a bit of help please. 20 year old son & girlfriend have a weekend in Rome in late August. On a limited budget so I’m trying to work out how they can do the sights without paying crazy private tour fees. Any suggestions from those who’ve done it on a budget? They’re booked to do a Fat Tire bike tour which we’ve done in other cities beforeआणखी & has been great but I’m struggling with booking things directly and even finding the right sites! They don’t make this stuff easy😊anyone know the site to book to get into The Pantheon? Just for an entry ticket as you need them now. Colosseum site I have but don’t like my chances of being able to book - looks like it only books a month in advance and tickets seem to be gone in minutes. And the site for the Vatican. Every time I search anything I’m bombarded with tour adverts. Your favourite tips for those budget conscious would be great.", "link": "facebook.com/groups/1373361046396315/permalink/2198224467243298/", "likes": 7, "comments": [{"username": "Rachael Ann", "comment_text": "I found the ‘Get your guide’ app and website very ready to use and was able to have it all in one place."}, {"username": "Claudia Castellini", "comment_text": "The entrance to Pantheon is free, if you don’t want a guide.\nFor guided visits I suggest you GetYourGuide, it’s not cheap (guided visits are expensive!) but not crazy and you’ll be able to book a few days in advance."}, {"username": "Pam Simpson Wilson", "comment_text": "Download the Rick Steves audio guides for self tours"}, {"username": "Lynn Haldane", "comment_text": "Pantheon and all churches are free, including St Peter’s. Get up and go to St Peter’s at 7am to beat crowds. We did a Roma Pass to get a couple of visits free and beat queues to a few places which was great but only done it in May or October so can’t advise on summer months. Don’t need to spend a lot of money in Rome. There is something to look at everywhere you turn."}, {"username": "Randy Aull", "comment_text": "I found that it was pretty easy to get the moonlight colleseum in Italian on coopculture, so you might try that."}, {"username": "Jojo Hanna", "comment_text": "The Big Bus Tour. See all the sights, go back to the ones they want a closer look at . You can get tickets that are valid for 1,2 or 3 days."}, {"username": "Jaime Cleek", "comment_text": "Look at the Parco membership. It had extra dates for colosseum. Pantheon doesn’t have online booking right now."}, {"username": "Chloë Sint", "comment_text": "Have a look and see if there are any free walking tours of the Pantheon or Spanish Steps? We used Viator for a guided tour of the Colosseum, in a group rather than private, which was good for Skip the Line. The Forum and Palatine Hill were included."}, {"username": "Phyllis Snyder", "comment_text": "Actually their time is limited as the budget- skipping the expense tickets and time consuming sites- get a good free google map and wonder this historical town. Every street & corner is beyond fantastic! Get some of the incredible yummy street food and gelato- sit at the plaza and people watch- especially go out and see the city at night. Less stressful less $ more fun!"}, {"username": "Phyllis Snyder", "comment_text": "Actually their time is limited as the budget- skipping the expense tickets and time consuming sites- get a good free google map and wonder this historical town. Every street & corner is beyond fantastic! Get some of the incredible yummy street food and gelato- sit at the plaza and people watch- especially go out and see the city at night. Less stressful less $ more fun!"}, {"username": "Jen Alexitch Rachow", "comment_text": "Rick Steves has free downloadable audio tours for several places in Italy. They can be played without internet connection once downloaded. Ive used them in Venice snd Florence and will use this year in Rome."}, {"username": "Tari Lawson", "comment_text": "I had trouble getting Coliseum tickets through their website. I would have them in my cart and before I could enter my payment info they would be gone. I called and they say they release tickets every 10 minutes and to keep trying. After an hour of two of us trying, I ended up getting mine on headout. They were a little more, but way cheaper than tours."}, {"username": "Rachael Richardson", "comment_text": "PAGO Pa type this in for the pantheon site tickets only €3 if they are EU citizens and have ID otherwise €5\nIf you are from EU most museums offer discount for 18-25 year olds\nCoopculture.It is for colosseum\nVatican .va for their direct site\n\nWe sometimes only booked the day before but we may have been lucky it may be busier in august"}, {"username": "Sarah Penfold", "comment_text": "We spent a lot of money buying tickets to skip the queue at the colosseum and then had to go with the tour group rather than own pace, at 9am the line was minimum and we would have saved $200 between 3 of us to pay at the gate, we were worried there would be no tickets but in hindsight I’d pay there. Pompeii payed at the gate rather than pre book queue was 20 minutes and much cheaper."}, {"username": "Daisy Yoo", "comment_text": "Download the Rick Steve podcast for free explanation of sights"}, {"username": "Cindy Corrigan", "comment_text": "I’ve had great success with Viator.com"}, {"username": "Glenn Todd Webb", "comment_text": "Hop on Hop off bus tour."}, {"username": "Michelle Pace", "comment_text": "My 20 year old son and I were there end of May, we did the Vespa tour at night, we saw a lot of Rome and it was fun. My son really enjoyed it. Highly recommend if they are going to spend money and make it worth their while."}, {"username": "Vanessa Caretti", "comment_text": "The pantheon used to be free and still is for residents but since July this year it’s €5 for tourists - I stay with family in Rome every year x"}, {"username": "Nancy Moran", "comment_text": "Official websites for most museums usually end in .it not .com. The site for the Pantheon is in the photo."}, {"username": "Vanessa Caretti", "comment_text": "Check the website Tiquets.com - I’ve just booked fast track tickets for the Duomo in Milan for half the price that GetYourGuide quoted x"}, {"username": "Cathleen Huismann Dinubilo", "comment_text": "Food tours are very inexpensive and so much fun. We booked thru Viator for $35 for a 3 hour tour with food."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "They are 20 yo, old enough for you to buy them a rough guide or a lonely planet about Rome and let them explore randomly! In a week end I’d just savour Rome with all the things you can see without paying and I would save the museums for another time."}, {"username": "Tammy Schlegel Acker", "comment_text": "We do air bnb experiences in every city we visit and have great success! Affordable prices for some fun activities. We did a night tour of 9 places for $50 each in Rome."}, {"username": "Vicki Parker", "comment_text": "Thanks everyone for your help. Lots of good ideas & yes they might just be best to walk the city. They’re great at getting up early so will recommend that to them & hit the sites early."}, {"username": "Andrea Marie", "comment_text": "Here are a few favorite tips:\n1. Make sure they get a hotel with air conditioning. Many cheaper hotels won’t have it.\n2. Tours aren’t necessary. For example, you can see a lot of the coliseum and the forum from the outside.\n3. The Vatican is a must. Entrance to St. Peter’s Basilica is free (and arguably more enjoyable than the Vatican museums). Queue up in the evening for smaller crowds.\n4. Bring collapsible water bottles. There are free water fountains throughout the city.\n5. They can eat well on the cheap. Go to a “bar” and grab a slice of pizza and suppli. It’s important to note that it will cost more if they sit down at a table.\n6. They aren’t going to be able to see and experience everything in such a short time. Talk to them about their top 3 priorities and focus on that."}, {"username": "Francesca Malte", "comment_text": "If they are staying at an Airbnb they offer great inexpensive excursions"}, {"username": "Molly Elizabeth", "comment_text": "I felt the Rome Pass was good value. Includes public transportation (which is awesome for getting around in a short period of time), many museums, and the colosseum."}, {"username": "Sally Warren", "comment_text": "Book Forum tickets. Just walk. Dinner Trastevere."}, {"username": "Rose Stolarek", "comment_text": "Look at taking free walking tours"}, {"username": "Alice Francesca", "comment_text": "Late August is peak tourist season, not surprised you need to book at least one month in advance..."}, {"username": "Alice Francesca", "comment_text": "https://\nwww.pantheonroma\n.com/\nvisit-the-panthe\non/"}, {"username": "Alice Francesca", "comment_text": "Ps at Pantheon kids up to 18 years old are free"}, {"username": "Pam Gerretsen", "comment_text": "When we went to the colosseum a few years ago, we bought tickets on the day and took ourselves round - you could buy the tickets at Palatine Hill (valid for both) though still had to queue to actually get in"}, {"username": "Julie Norris", "comment_text": "I love audioguides so then I'm not having to follow at the guides speed. I'm a wanderer 😀 most sites have the option or they could download the Rick Steves app that has great audioguides and they are free. If they want to wander the streets I did this treasure hunt and it took me from near Termini to the Vatican. I enjoyed it but I'm a bit geeky 😀"}, {"username": "Lauren-Jade Roberts", "comment_text": "Depending how into history they are you can see a lot of the colosseum Roman forum from walking around outside."}]}, {"id": "2198227540576324", "text": "Next stop Florence. Easy train ride from Rome. I do not feel unsafe ever in Italy as a solo female traveler🙌🏻 the best gelato is Gelateria dei Neri 😍", "link": "facebook.com/groups/1373361046396315/permalink/2198227540576324/", "likes": 484, "comments": [{"username": "Adolfo Can", "comment_text": "Prendi una fiorentina se non sei veg, oppure panino All'Antico Vinaio"}, {"username": "Su Kyi Aung", "comment_text": "I am also going from Rome to Florence. Solo traveling in August. Any tips and advice where to go and see if you don't mind please ☺️"}, {"username": "Frances McDonagh", "comment_text": "Frances McDonagh"}, {"username": "Frances McDonagh", "comment_text": "Frances McDonagh"}, {"username": "Elena Maria", "comment_text": "Cute dresses!!"}, {"username": "Diane Bowler", "comment_text": "Fabulous, lovely to hear you feel safe, enjoy, my daughter and I are touring Italy from end August for a couple of months. Enjoy the rest of your holiday 😊"}, {"username": "Stephanie Dunn", "comment_text": "Beautiful 😍 Did you buy your train ticket on one of the apps or at the station? I’ll be there in about a month!"}, {"username": "Jacqueline Morris", "comment_text": "Super cute dresses. Link if available?"}, {"username": "Phyllis Snyder", "comment_text": "I’m going solo too! Grazie for sharing!"}, {"username": "Diane Hamilton", "comment_text": "Great pictures\nWe’re going first time in November\nRome3 days, Florence 2days, Venice 2 days\n\nHow long was the train ride from Rome to Florence?"}, {"username": "Mariposa Mariposa", "comment_text": "How are cool!!! Pics are beautiful and that ice cream looks delish🇮🇹"}, {"username": "Noelle Pratt Utley", "comment_text": "Bellissimo, I heard that was the best gelato 🍨 too!"}, {"username": "Hanne Dada", "comment_text": "Who took your pictures?"}, {"username": "Alex Bader", "comment_text": "You look awesome"}, {"username": "MsChrista Fl", "comment_text": "Thank you for sharing 😊\n￼ I may also ￼travel alone!!"}, {"username": "Giuseppe Dascoli", "comment_text": "Try La Carraia gelaterria 👌👌"}, {"username": "Judy Carey", "comment_text": "Going solo in March!"}, {"username": "Melisha Folk", "comment_text": "Angela Bermudez"}, {"username": "Pat Pat", "comment_text": "That’s great to hear. I’m spending a week alone there. Looking forward to it."}, {"username": "Tim Collins", "comment_text": "Nice"}, {"username": "Khadija El Bouhati", "comment_text": "❤️❤️"}, {"username": "John Dyer", "comment_text": "Fantastic. I will be going Roma to Firenze in a week. We’ll see what happens. As a Di Leo and Mannese my roots are in Naples, Salerno and Firenze. Can’t wait to spend some time there."}, {"username": "Bing Robertson", "comment_text": "You'll absolutely adore Florence! I was there last week, it's beautiful!"}, {"username": "Angela Perky Perkins", "comment_text": "Great photos, I'm planning a solo trip so good to hear you felt safe..👍😊"}, {"username": "Lilian Villarreal", "comment_text": "Wonderful !!! Next week my turn!"}, {"username": "Savioo Ferrao", "comment_text": "Just awesome, enjoy every moment ✌️"}]}, {"id": "2198231030575975", "text": "Any tips for someone traveling through Italy who has celiac’s?", "link": "facebook.com/groups/1373361046396315/permalink/2198231030575975/", "likes": 0, "comments": []}, {"id": "2198231673909244", "text": "Hello! We’d like to get away for one from Rome and escape to a beach nearby. We’d travel by train for just one day, no overnight stay. What beach would you recommend? We hope to enjoy a swimmable beach. Thank you all!!", "link": "facebook.com/groups/1373361046396315/permalink/2198231673909244/", "likes": 0, "comments": []}, {"id": "2198232907242454", "text": "Our recent trip to Italy...", "link": "facebook.com/groups/1373361046396315/permalink/2198232907242454/", "likes": 20, "comments": [{"username": "D Rochelle Milton", "comment_text": "Amazing pictures 😍!!"}]}, {"id": "2198233337242411", "text": "We are wanting to book a tour from the cruise ship into Rome to see the colosseum etc. any suggestions? Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2198233337242411/", "likes": 0, "comments": []}, {"id": "2198243773908034", "text": "Venezia ha il Mio ❤️ per sempre", "link": "facebook.com/groups/1373361046396315/permalink/2198243773908034/", "likes": 7, "comments": []}, {"id": "2198256813906730", "text": "We are flying into Pisa mid September where we will be hiring a car to travel through Tuscany for about a week & onto Venice for our last few days. We are looking for suggestions of places / towns to visit & stay. We are planning to stop near San Gimignano & Siena but would really appreciate any other recommendations to enhance our Tuscan adventure.", "link": "facebook.com/groups/1373361046396315/permalink/2198256813906730/", "likes": 0, "comments": []}, {"id": "2198260513906360", "text": "We’ll be in Italy in late Sept - early Feb and after spending time near Ostuni we arw driving to Siena in Tuscany. I believe it’s around 7 hours to do the drive (minus stops) and we will need to do it in one day (unfortunately). Has anyone done this - or similar - drive? Any suggestions on best places to stop along the way for quick stop breaks?\n\nThanks in advance 🙂", "link": "facebook.com/groups/1373361046396315/permalink/2198260513906360/", "likes": 0, "comments": []}, {"id": "2198270897238655", "text": "Do you suggest booking trains in advance? If so which ones? We land in Rome on August 6th and are going straight to Florence. Assuming it’s best to wait to book in case we have any travel delays?? Should we book the other trains in advance? We are doing Florence to Cinque Terre, then Cinque Terre to Lake Como, lastly Lake Como back to Rome. Which trains should we book first class, and which ones in advance?", "link": "facebook.com/groups/1373361046396315/permalink/2198270897238655/", "likes": 0, "comments": []}, {"id": "2198276233904788", "text": "Would I be allowed to enter The Vatican Museum prior to my scheduled reservation time? If so, how early? Conversely, what happens if I'm late?", "link": "facebook.com/groups/1373361046396315/permalink/2198276233904788/", "likes": 0, "comments": []}, {"id": "2198276237238121", "text": "Would I be allowed to enter The Vatican Museum prior to my scheduled reservation time? If so, how early? Conversely, what happens if I'm late?", "link": "facebook.com/groups/1373361046396315/permalink/2198276237238121/", "likes": 0, "comments": []}, {"id": "2198299023902509", "text": "Hi there, quick question...we are looking to train from Milan to Bologna (We will be arriving in Milan from Varenna) Is it imperative that we prebook this train ticket as we are concerned if there is any delay in the train arriving from Varenna that we may miss the connecting train to Bologna. Are the trains on the Milan-Bologna leg generally very full or can we book this leg when we arrive in Milan? TIA", "link": "facebook.com/groups/1373361046396315/permalink/2198299023902509/", "likes": 0, "comments": [{"username": "Ilaria Verda", "comment_text": "If you book for a high speed train, you need to book in advance and I suggest you to do it. If you buy a ticket for a \"regional\", you can take any train with this characteristics\n, just mark the ticket before taking the train"}]}, {"id": "2198004817265263", "text": "We are staying near the Spanish steps in a hotel that does not serve breakfast. Any recommendations for buffet breakfast (kids love it) nearby? Do other Hotels allow patrons who are not staying with them for breakfast for a price? Suggestions on any other non buffet restaurants with local dishes are also welcome. Appreciate all your help. Thanks!!!", "link": "facebook.com/groups/1373361046396315/permalink/2198004817265263/", "likes": 7, "comments": [{"username": "Yolandé van der Westhuizen", "comment_text": "Bar Frattina\n+39 06 679 2693\n\nhttps://g.co/\nkgs/GvCo35\n\nI don’t know about buffet breakfasts in the area but had many wonderful breakfast coffees and pastries here, also great for aperitivo."}, {"username": "Gena Diaco Penland", "comment_text": "Big breakfasts are not really an Italian thing. They usually just eat a pastry and coffee!"}, {"username": "Penny Bellofatto Westberry", "comment_text": "The W has a pretty good a la carte breakfast"}, {"username": "Elena Innocenti", "comment_text": "Buffet Breakfast is not an italian thing. Out of hotel is uncommon."}, {"username": "Alexandra A Welker", "comment_text": "Usually it's pastries, cheese and coffee for breakfast. Check this one close to Spanish Steps. https://\nmaps.app.goo.gl/\nLBxUod5rYKFdv5Lo\n6"}, {"username": "Luca Fusco Blackburn", "comment_text": "Great little restaurant around the corner from pantheon.\nYou should find plenty if you walk around."}, {"username": "Dana Lucchese Dougherty", "comment_text": "Hotel Hassler is at the top of the Spanish Steps and has an amazing buffet breakfast."}, {"username": "Ilaria Giorgulli", "comment_text": "It’s more for tourists and still not very common, and also overpriced, it happened to me to see a couple of restaurants in Via Veneto on my way to office, for more than 10€ per person.. you can have a Capuccino or latte(milk) for kids for around 1.50€ and a pastry for same price."}, {"username": "Catherine Patton", "comment_text": "D’Angelo, via della Croce"}]}, {"id": "2197370963995315", "text": "Going to Amalfi coast next week. Most excursions leave through Naples or Sorrento early in morning around 7:30-8am.\nWhich is easier to get to from Amalfi esp at that time, Naples or Sorrento?", "link": "facebook.com/groups/1373361046396315/permalink/2197370963995315/", "likes": 1, "comments": [{"username": "Maria Gatto", "comment_text": "Take the ferry. I believe it’s the easiest way to get to Sorrento"}]}, {"id": "2197791517286593", "text": "Hi there! We will be in Milan for one night. A stop over from Florence to Paris. Has anyone done a night tour of Milan. I have found one on Get Yiur Guide but wanted to find other recommendations. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2197791517286593/", "likes": 2, "comments": [{"username": "Tom Cannon-Bailey", "comment_text": "Following. We stay one night en route to Levanto from Zurich. Looking to maximize one day in milan"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2197702367295508", "text": "Looking for recommendations for reasonable accommodation close to Trevi fountain for 6 nights, 8-14 October for two. Any recommendations would be most appreciated.", "link": "facebook.com/groups/1373361046396315/permalink/2197702367295508/", "likes": 3, "comments": [{"username": "Frances Scannapieco", "comment_text": "I would recommend looking on Booking. Com. I have always used that site and never had issues. You can put in your price range and what area you want to stay."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "What is reasonable? Check a booking site to see what is still available in your price range."}, {"username": "Maria Urdi", "comment_text": "Lots of Airbnb too"}, {"username": "Mary Anne", "comment_text": "We stayed at Hotel Stendhal. Clean, quiet and close to Trevi and Spanish steps. (10 minutes walk at most) Great helpful staff. Decent breakfast with good coffee."}, {"username": "Sue Gaughan", "comment_text": "I enjoyed staying here. Close to Trevi, comfortable, very clean & excellent service.\nhttp://\nwww.arpinelli.co\nm/"}]}, {"id": "2197821493950262", "text": "Can anyone tell me if Snus tobacco pouches is legal to bring to Italy? I have done research and can't find a definitive answer on this.", "link": "facebook.com/groups/1373361046396315/permalink/2197821493950262/", "likes": 1, "comments": [{"username": "Junko Osaki", "comment_text": "It’s illegal in Italy and most European countries"}]}, {"id": "2198004243931987", "text": "I get seasick on boats which was why when we have been planning our trip I have been avoiding the Almafi area. We have been told we can’t go all the way over there and not see the coast and that I do not need to be on a boat to see it.\nI have seen pictures of the blue and green grotto which look beautiful, and that water looks very calm. My question is, is there a way to get to the grotto without having to catch a boat in possible rough water to get on the smaller boat of the grotto. Thank you 🛶", "link": "facebook.com/groups/1373361046396315/permalink/2198004243931987/", "likes": 11, "comments": [{"username": "Rachel Gray", "comment_text": "Grotto isn’t worth it. Yes it’s beautiful but we didn’t care for it, I would have rather done something else."}, {"username": "Melody Gnadinger", "comment_text": "Is Capri and the other grottos worth it?"}, {"username": "Greg Ewanis", "comment_text": "Go to Anacapri and take the chair lift to the top."}, {"username": "Christina Basham", "comment_text": "Ask you Dr for the patch that goes behind your ear. It is wonderful"}, {"username": "Tami Whittlesey", "comment_text": "There is a way to walk down to the entrance of the Blue Grotto. From the stairs you pay the fee and a small rowboat takes you inside. The time allowed inside is about 5 minutes. the mouth of the grotto is closed in bad weather or high tide and if it is cloudy don't bother because the feature needs sunlight to be its amazing self 🙂"}, {"username": "Steve Wolfrom", "comment_text": "Use non drowsy Dramamine the night before and day of event. then get on the boat. I I’m talking about some kind of boat even if it’s not the blue grotto."}, {"username": "Robin Burrell", "comment_text": "Depends on the sea state but you can easily see the coast without getting on a boat"}, {"username": "Laura Beaudreau", "comment_text": "Hi! I also get horribly sea sick (and car sick!) We just took a small charter boat to Capri 2 days ago. I used scopolamine patches and had zero problems!\nThis is a prescription- but most doctors in the US are happy to write a prescription for you given the situation.\nAlso, I’ll mention- I’m a pharmacist. I normally do not like to recommend medications to people I do not know- but it’s a great med. Works great! And is absolutely worth asking your doctor about."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "There is no way to predict what the seas will be like on any given day. Better not to chance it. It’s not all it’s cracked up to be. Lines of boats, transferring to smaller boats, rocking, waiting. Ugh!"}, {"username": "Maria Gatto", "comment_text": "Ok so we did a boat tour today. The water was so rough that my husband and daughter were both very sick. We had to take the ferry back from Capri. All that money down the tubes. The water at the shores was so choppy felt like the boat would tip. They skipped over blue grotto cause the wait was close to 2 hours long …. If u get any type of sea sickness I wouldn’t waste the money. The ferry was lovely."}, {"username": "Steve Wolfrom", "comment_text": "Don’t take a small boat tour, like it’s just for your group. Go with 40 foot or more"}, {"username": "Jennifer Gustafson", "comment_text": "Meclazine hands down. My mother in law gets deathly I’ll from motion sickness and when she takes this she never gets sick. She even took a cruise with us! Also check with your dr for meds that help"}, {"username": "Jan Buess", "comment_text": "Are you asking if there is a way to get to a place that's in the water under a cove, without going in a boat???? Are you a good swimmer? Maybe you can do that??"}, {"username": "Toni Jewett-Chavez", "comment_text": "Thank you everyone for the ideas and recommendations"}, {"username": "Lauren Ako", "comment_text": "i bought the patches on amazon. Used them on a boat and windy roads. We were in Capri and the boat was docked and I felt sick because of the rocking but otherwise I was fine for the ride from Positano to Capri. We also went to Nerano."}, {"username": "Melissa Johnson Pero", "comment_text": "We stayed in Sorrento 3 days and never got on a boat because nothing helps my husband's sea sickness. You can see plenty! That being said...just driving there is enough for motion sickness. So I would still be prepared!"}, {"username": "Lindsay Stewart", "comment_text": "Meclizine. Sold OTC. 25mg. It’s non drowsy. We use it regularly and did daily while on the Amalfi Coast. Came in handy for trains and any winding roads as well. The scopolamine patches can have side effects and make you miserable! As a nurse they can be great for cruises & surgery but for short ferry rides Meclizine should be fine"}, {"username": "Nancy Day", "comment_text": "I get seasick on large cruise ships and found that a shot of Phenergan was all I needed from Dr on board perhaps Phenergan pill might help ask your dr."}, {"username": "Denise Curtis", "comment_text": "One word. Zofran."}, {"username": "Jayne Dawson Meyer", "comment_text": "Im like you & I was fine. The ferry is huge so your fine. Then to go Blue Grotto was also smooth enough. You'll be fine."}, {"username": "Lisa Minichini-Dowty", "comment_text": "This pic was taken while walked downstairs to get in the line .. we arrived at 0830 and only one other couple was ahead of us ... we waited about 10 mins"}, {"username": "Peach Panfili", "comment_text": "No - you can only go within the grotto in a small boat and only if the sea is calm."}]}, {"id": "2197778690621209", "text": "What is the best travel route from positano to Venice? bus to sorrento, then train to Naples and high speed to Venice? Should we fly from Naples or Rome to Venice instead or catch the high speed train? We are not opposed to a train ride for a day, as we are going to be hiking/running at each destination and a rest day will be nice. But hoping toआणखी take a fairly quick route and the most cost saving route. Adding, we are going in December so a ferry to Naples wouldn’t be an option.\n\nAnd one last question, being December and it’s not as crowded, would it be unwise to drive from Rome to positano? We are there for 3 days and want to explore as much as possible.\nThanks for any advice!", "link": "facebook.com/groups/1373361046396315/permalink/2197778690621209/", "likes": 2, "comments": [{"username": "Matthew Behrensmeyer", "comment_text": "Ferry to Salerno or Naples and then train maybe easier than the bus to Sorrento."}, {"username": "Diana Himes", "comment_text": "Salerno is on the high speed line. That’s the direction I would go if I were you. Bus, Ferry or Private Driver to Salerno Train Station."}, {"username": "Robin Burrell", "comment_text": "How about ferry to Naples, then train to Venice?"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "I recommend the app Rome2Rio. You will see all your options."}]}, {"id": "2197766197289125", "text": "I have 4 days in tuscany region and am very confused as to where stay. I really want to visit San gimignano, saturnia and montepulciano.... recommendations needed !", "link": "facebook.com/groups/1373361046396315/permalink/2197766197289125/", "likes": 9, "comments": [{"username": "Renae Larcus", "comment_text": "Stay in Siena or Florence and go from there."}, {"username": "Mike Ball", "comment_text": "Saturnia is not easily accessible by public transport so you would need to drive. I would stay in Siena if I planned to visit Saturnia."}, {"username": "Simone Pfenninger", "comment_text": "Stay in Montepulciano or Pienza"}, {"username": "Alice Francesca", "comment_text": "You want to spend time in Pienza( Relais il Chiostro di Pienza) there are natural spas in Bagno Vignoni (hotel Posta Marcucci) and visit Montepulciano or Montalcino nearby.That region is called VAL D'ORCIA.check pics online and hotel links"}, {"username": "Anita Alam", "comment_text": "Siena - definitely worth a visit 🙌🏽"}, {"username": "Elena Eckley", "comment_text": "If you can visit MONTECATINI. It is a spa town with a fabulous funicular about 1and 1/2 hours west of Florence BON viaggio"}, {"username": "Greg Saba", "comment_text": "There is a bit of a spread among those places. Montepulciano, a little more in the center, was our choice when we visited those places via day trips. Also visit Volterra when you go to San Gimignano."}, {"username": "Laura Uribe", "comment_text": "Montelpuciano or San Gimignano are both amazing! You won’t be disappointed with either."}, {"username": "Manuel Macias", "comment_text": "We stayed at an Air B&B just south of z Florence and visited Sienna, Florence, San Giamano, and Multepucciano.\n\nRented a Car in Florence and did all that in 3 days."}, {"username": "Paul Davis", "comment_text": "Albergoilrondo.\nit\n\nis a nice boutique hotel 5 minute walk outside Montepulciano. Nice family, great breakfast."}, {"username": "Gary W Anderson", "comment_text": "Base in Florence"}, {"username": "Mary Sandor White", "comment_text": "We are booked in September at Hotel Sovestro in San Gimignano. It looks great"}, {"username": "Anthony McClure", "comment_text": "Look for an agraturismo ."}, {"username": "Gayle Moores", "comment_text": "Stay in Florence near the train station and take day trips to other towns in Tuscany. We took a tour with walkaboutfloren\nce\nWe took a tour to Tuscany with them .You meet near the train station and they took us on a walking tour of Siena, lunch at a winery, free time in San Gimignano and took us to Pisa!Was a full day and return to Florence in the evening.Was a very good tour and a great way to see some towns in Tuscany.Another\ngreat way to see Tuscany is to take a wine tour to the Chianti region of Tuscany!"}, {"username": "Nicole Hart", "comment_text": "Thank you all for your recommendations\n.... its been so helpful!! Can't wait for my bucket list trip in 2024 😀😀"}, {"username": "Frank Hunt", "comment_text": "Pick a lace and hire a car,nothing else will work."}, {"username": "Colleen Carollo Oxsalida", "comment_text": "We just stayed in San Gimignano in June and we loved it! Especially mornings and evenings when all the “day” visitors were gone. It’s so laid back and nice just to wander the small streets. We had a private driver for the day we took at cooking class/wine tasting at Tenuta Torciana, which was fabulous!"}]}, {"id": "2197392073993204", "text": "Hi\nI’m suppose to travel to Italy September 23rd. I’ve never been there. I broke my ankle 4 weeks ago and had surgery. I don’t start PT until August 10th. I’ll maybe be walking by August 20th. It’s a tourआणखी with a lot of walking in Venice, Tuscany, Rome, and Florence. It’s considered an active tour. Lots of walking, high altitude, cobblestone, and uneven terrain.\nShould I opt out?\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2197392073993204/", "likes": 2, "comments": [{"username": "Alessandro Iannelli", "comment_text": "This is really a question for your doctor and for your physiotherapist\n."}, {"username": "Colleen Jennings", "comment_text": "Claim on your insurance & rebook in 6 months time. Give your ankle time to heal properly. Good luck with your recovery."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "If you have insurance and can opt out until you have fully recovered, opt out."}, {"username": "Michele West", "comment_text": "Thanks everyone!"}, {"username": "Melissa Johnson Pero", "comment_text": "Rebook. It's so much walking and it's mostly uneven/\ncobblestone/\nstairs."}, {"username": "Robin Burrell", "comment_text": "I think you need to reschedule"}, {"username": "Tom Cannon-Bailey", "comment_text": "Ask the doc!"}, {"username": "Irene Oda", "comment_text": "Consult your doctor. Be aware that walking will be a necessity- at a minimum 10 miles a day- on uneven and cobbled stones. Will that put too much strain on your newly healed ankle? Will you be in more pain? Such a shame to spend a holiday like this though."}, {"username": "Keith Crossley", "comment_text": "I think it depends on what you expect your experience to be. If it's checking off a bunch of places following a group, then definitely cancel that. If you might entertain a slower pace, fully enjoying the many places and enjoying quiet times (solo or +) watching the wonderful world go by, then go for that"}, {"username": "Susanna Sheard Kuenn", "comment_text": "Yes"}, {"username": "Vanessa Tuveri", "comment_text": "Reschedule ."}, {"username": "Graham Sherlock", "comment_text": "Yes, don't chance it, Italy is very tough on your feet and ankles. There is no point getting here and feeling pain etc. Rebook."}, {"username": "Jill Medrano Casey", "comment_text": "I would rebook so you can truly enjoy your vacation."}, {"username": "Connie Titone", "comment_text": "Reschedule!"}, {"username": "Helga Truter", "comment_text": "I wouldnt risk it. You really need good feet &shoes in Italy. Good luck!"}, {"username": "Bonnie Loftspring", "comment_text": "I had 2 mild to medium sprained ankles on my trip. I fell over a chair on our cruise. It wasn’t a fair fight, chair had 4 legs, me only 2! Hubby rescued my from face plant. Fortunately I had Ecco trailer sandals with me, all the straps were adjustable, good thing because by end of day with medium a,out of crippling walking my ankles would swell. How miserable are you willing to be, cancel, go when happy."}, {"username": "Jen Lundy", "comment_text": "As someone who has broken the same ankle twice, you need to allow your ankle the proper length of time to heal well and perform the physio treatment ongoingly. Walking on cobblestones, stairs, uphill/\ndownhill, walking 12+ hours in the heat with feet swelling isn't ideal and your foot will take a beating."}]}, {"id": "2197533120645766", "text": "We are travelling to Amalfi Coast in late September. Catching a train from Rome to Naples then wanting a private transfer to take us to Pompeii & then accomodation. There will be 5 of us so thought this would be a good option rather than dealing with luggage restraints. Does anyone have recommendations for a driver or company that could transport 5 adults? And how far in advance do you recommend I book? TIA 😊", "link": "facebook.com/groups/1373361046396315/permalink/2197533120645766/", "likes": 6, "comments": [{"username": "Michele Levesque Semosky", "comment_text": "I just booked one for late August with Aldo limos. They said that dates at the end of august were filling up, so I’d say soon! Also came very highly recommended and have been very good with communication"}, {"username": "Kathy Flood", "comment_text": "Yes!. We just used Taxi Mister Cab Driver-Naples & Amalfi coast- he is the best"}, {"username": "Sue Cullen", "comment_text": "AP Tours were fab - collected us from the airport with 2 hour stop in Pompeii with guide, and we added lunch and wine tasting nearby too. Then on to Sorrento. Great friendly driver and he didn’t go too fast round the bends! Sarah at AP Tours is English and so helpful - have a fab time APTours Sorrento Italy"}, {"username": "Christine Golia Brigida", "comment_text": "Amalfidrive4you"}, {"username": "निनावी सहभागी", "comment_text": "Thank you for these replies & for sharing your experience with the service, I will look into each of them."}]}, {"id": "2197747007291044", "text": "Colosseum tickets for an infant? I’m about to buy our tickets for next month but as mentioned on here before by others, the coop culture website is quite confusing. Can anyone clarify - for buying a ticket for an infant, we can only do this on the day? Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2197747007291044/", "likes": 0, "comments": []}, {"id": "2197760417289703", "text": "Hi, I'm planning a first time trip to Italy next year. I land in Naples and have booked a few days in Sorrento, planning on heading to Rome after. I have just realised that my travel day to Rome is May 1st (a bank holiday). Is this going to be a problem? Will the trains still run? Will I be able to get a taxi from Roma Termini to my accomodation? Advice would be appreciated, Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2197760417289703/", "likes": 0, "comments": []}, {"id": "2197762540622824", "text": "Any feedback on tours in Rome by The Roman Guy / The Tour Guy?", "link": "facebook.com/groups/1373361046396315/permalink/2197762540622824/", "likes": 2, "comments": [{"username": "Lisa Migliacci", "comment_text": "Following"}, {"username": "Cheryl Caferro Shul", "comment_text": "Following"}, {"username": "Lorraine Diven Park", "comment_text": "We booked our guided tour of Colosseum Roman forum & palentine hill with the Roman Guy. Very well organised and our guide was very informative and good fun. Would recommend"}, {"username": "Karen Klipple Buron", "comment_text": "We stumbled upon Sean/The Roman Guy 12 years ago, on our first trip to Rome. Had a fantastic tour of the Colosseum with him and was even able to get to an upper restricted area with him. We used his company again on a return trip/cruise."}]}, {"id": "2197635933968818", "text": "Sorrento is also a fantastic city, with the most beautiful clear water, I love lying on the pier and looking up at the old rocks, eating delicious food, and here there is also the opportunity for a lot of shopping.👛👜🕶️🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2197635933968818/", "likes": 117, "comments": [{"username": "Deb Harnett", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Joanna Adamczak", "comment_text": "I will be in Sorrento during late autumn- any recommendations\nof interesting places to see? Thanks!"}, {"username": "Judy Marie", "comment_text": "Beautiful! We’ll be there in a couple of weeks. So excited! Any restaurant & shopping recommendations\n?"}, {"username": "Maureen Moyson Wright", "comment_text": "Loved everything about Sorrento 💓🍷💓🍷"}, {"username": "Tiffany Hadfield Merrill", "comment_text": "I loved Sorrento last week & we miss it tremendously ❤️ maybe the friendliest, most welcoming people I’ve ever met!!!"}, {"username": "Marilyn Caladine", "comment_text": "Is that the Hotel Conca park?"}, {"username": "Sherri Haff Benson", "comment_text": "What were your favorite little places to eat?"}, {"username": "Meredith Holloway Helbon", "comment_text": "Following"}, {"username": "Nouara Nekachtali Bouzidi", "comment_text": "So expensive though😞"}, {"username": "Larry Trent", "comment_text": "Great Pictures..after\nvisiting Italy how does one survive the withdrawals?"}, {"username": "Linda Charlene Vaughan Osborne", "comment_text": "Absolutely gorgeous!!! Can't wait to visit."}, {"username": "Maria Villena Villanueva", "comment_text": "I am so glad we went there last year. It’s a place to be❤️ the sunset is spectacular to see."}, {"username": "Joy Crawford", "comment_text": "Loved Sorrento. Can’t wait to go again"}, {"username": "Sasha Childs", "comment_text": "Beautiful place, gor married in Sorrento in 2018 x"}]}, {"id": "2197468573985554", "text": "What type of adapter and converter is needed? I hear you need both. I from the United States.", "link": "facebook.com/groups/1373361046396315/permalink/2197468573985554/", "likes": 12, "comments": [{"username": "Joe Guzzi", "comment_text": "Depends on what for"}, {"username": "Dave Conroy", "comment_text": "No idea where you're from, but usually there'll be a label on all your electrical devices, by law, somewhere. If it says dual voltage, so 110-240v you're good. If it only says 110 you will need a converter. Things with a battery will be dual voltage. Things that may be restricted will normally be hair dryer, straighteners and similar unnecessary things 😂 TBH I would get dual voltage versions rather than bother with converters. These are cheap items unless you must spend silly money on stuff. Beware if you are on Amazon, as if you add converter as a search term, they throw up tons of adaptors too. They don't convert voltage. They allow you to plug in a device to a socket, or a converter to a socket. TBH, you can easily find this info online and also buy the correct items according to the options you see online."}, {"username": "Robin Barbera", "comment_text": "You definitely don’t need both. You just need to prong adapter. Do not bring a converter. You won’t use it and most of the time they’re freaking heavy. You can buy an adapter online or wait till you get there and buy an adapter at the grocery store or any place else shouldn’t cost more than 4 or 5 dollars. Also be aware of the voltage in the bathroom with using any hair items."}, {"username": "Larry Reinier", "comment_text": "No you don’t need both. Most appliances are dual voltage. It says right on them. Been all over italy and just used a European plug in"}, {"username": "Linda Miller", "comment_text": "It depends if you're adapting or converting 🤷‍♂️"}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "A lot of newer electrics don't need converters, just adapters. Whatever you have should say if they are dual voltage. In that case, you just need an adapter."}, {"username": "Janice Rea", "comment_text": "I just bought them on Amazon"}, {"username": "Sherri Leis Dillavou", "comment_text": "Two prong adapter is all you need"}, {"username": "Eden Seery Thornton", "comment_text": "Apple products like your iPhone do not need a converter(you will only need an adapter for those). I am from the US and most of what we have is not dual voltage. I ordered a dual voltage travel hair dryer from Amazon as well as a dual voltage clothes steamer. That way I should only need an adapter."}, {"username": "Rod Marsh", "comment_text": "2 euros at the dollar store"}, {"username": "D'Anna Hohe", "comment_text": "As previously stated, you will definitely need an adaptor coming from the US. Converters/\ntransformers are needed to convert voltage but the larger the wattage of an appliance, the larger the converter needed. Most hair dryers and heating appliances are high wattage and an appropriate converter would weigh 20lbs or more. Best plan is to purchase dual voltage items. Note that the majority of phones, laptops are low wattage and dual voltage but you should check the label to be certain."}, {"username": "Lori Risco", "comment_text": "Ok so I want to make sure I understand this correctly. If you need a blow dryer that is not dual voltage you can use a converter. If it is dual voltage blow dryer then no converter is needed just adapter? Is this correct."}, {"username": "Russ Whitley", "comment_text": "Just remember that the power supply is rated at 230volts. So American appliances will not work unless they have that rating range. eg iPhone chargers are fine, but hairdryers, curlers etc will fry."}, {"username": "Alexandra A Welker", "comment_text": "No converter just adapter. Most appliances are dual voltage (check yours (110-240V) so you just need the adapter with two prongs."}, {"username": "Jeneen Patterson Brewer", "comment_text": "This is what I bought. Lots of options."}, {"username": "Annette Reyes", "comment_text": "Sorry, just want to clarify…. I’m coming from the US. I will need an adapter and converter? I’m most concerned about being able to charge our phones. Most places have blow dryers. Is the recommendation not to bring my curling iron?"}, {"username": "Maria Badamo DeSocio", "comment_text": "You just need an adapter, if you bring a hair appliance or travel iron try to purchase one that has dual voltage, for USA and Europe, it has a small switch to change over to the proper voltage so you don’t need a converter."}, {"username": "Debbie H DeLoach", "comment_text": "Yes, need both"}, {"username": "Tammy Toppel Chmelik", "comment_text": "A converter “converts” the voltage an adapter “adapts” the prongs to the outlet. Get dual voltage hair appliances and you will only need an adapter."}, {"username": "Lalita PosBa", "comment_text": "I am in Italy now and really need a converter. I got mine at ALDIs and it works perfect. We lost one and we haven’t found one here in Florence ."}, {"username": "Renee Rundle Stoneham", "comment_text": "Adapter for phones, computer and dual voltage hair tools.\n\nDo not bring any hair tools that are not dual voltage!\n\nI do not even bring a travel hair dryer with me anymore. All of my accommodations have had them. Some better than others etc…"}, {"username": "Nicole Webb", "comment_text": "Clayton Webb"}, {"username": "Carol Hayes", "comment_text": "How ‘bout buying a hair dryer in Italy? And flat iron there?"}, {"username": "Steve Watkins", "comment_text": "We got by with the normal 2 prong adaptor"}, {"username": "Barbie Phillips", "comment_text": "I just got back this weekend. This is what I used and I had zero issues."}]}, {"id": "2197790730620005", "text": "In Venice-\nWhen you take a water taxi from airport into Venice, does the water taxi pick you up from airport and take you to hotel?\nOr does a van/car pick you up and take you part of the way and then you take a water taxi to hotel? Any recommendations on this?", "link": "facebook.com/groups/1373361046396315/permalink/2197790730620005/", "likes": 20, "comments": [{"username": "Kathy Flood", "comment_text": "We had a private Water Taxi, arranged through our hotel, pick us up at the airport and bring us to St Mark's square. We then had a valet help us with our bags to the hotel. It was actually very easy. We wanted to take a private Water Taxi because it is much faster."}, {"username": "Meredith Williams", "comment_text": "there is a water taxi area at the airport where u meet them! ours took us to our hotel but was on the grand canal"}, {"username": "Michele Liggett", "comment_text": "Our travel agent set us up with water taxi right from airport to the vaporetto stop close to our hotel in the San Polo area."}, {"username": "Melissa McCormick", "comment_text": "Ours took us right from airport to our Airbnb our Airbnb was right at the arsenal stop… don’t let anyone help you with your luggage! We had someone seem like they were helping and we were going to give them a 15 euro tip and he wouldn’t give us our stuff until we paid 45 euros which is like 50-55 usd 😭😑"}, {"username": "Janis Parker", "comment_text": "Our private water taxi was at the water port at the airport. Showed him my reservation and he took us to the dock at our hotel. Easy!"}, {"username": "Rachael Richardson", "comment_text": "We walked luggage and all , wasn’t bad at all but we travel light"}, {"username": "Jennifer Mastruserio Groneck", "comment_text": "There is a kiosk on the ground floor of airport where you can pay and get the voucher. 5 minutes walk to the dock. They will drop you at your hotel if it has a water entrance or as close as possible. We paid our driver an extra $50 to go the long way and do the entire grand canal. So worth it at arrival for others with me who hadn’t been there before!"}, {"username": "Terri Dalton", "comment_text": "We had private transport. He picked us up at airport and drove us to the private water taxi. They took us directly to the hotel and unloaded right into the hotel. It was well worth it! We used Venice Limosine Service"}, {"username": "Laci Lynn Schwoegler", "comment_text": "Is getting from the airport to the train station easy? I did it years ago but I can’t remember"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Some hotels have a private dock or window/door where a private water taxi can take you directly. Otherwise they will take you to the dock closest to your hotel."}, {"username": "Brice Blosser", "comment_text": "If you want to save some money and enjoy the scenery, take the water bus (https://\nwww.alilaguna.it\n/). at the lower level to the closest stop by you hotel.\nUnless you’re a big baller, then get something private."}, {"username": "Dana Golden", "comment_text": "I took a private water taxi from a nearby pier from my air B&B to the airport this morning. It was easy to arrange. I would assume it would work the same way there. The location of your hotel will determine how close the boat can drop you off. Some canals are too small for water taxis. The company I used had a list of hotels with “poor access”. So you may have to do a short walk from the drop off point to your hotel. Everything is very walkable. The cobblestones and bridges can make it a bit physically difficult if you have super big bags"}, {"username": "Dana Golden", "comment_text": "Dana Golden"}, {"username": "Zoe Croasdale", "comment_text": "We took the water bus across the grand canal. You can then pick up the water buses that run along the canals. Very easy - much cheaper."}, {"username": "Lisa Hedenberg Nichols", "comment_text": "Our water taxi took us to the nearest water point to our AirBnB. From there we were on our own with luggage. Same in the other direction. So really depends on where you are staying as to how far you can go in the water taxi."}, {"username": "Wallace Clavelle", "comment_text": "I took a taxi cab that dropped me off approx. 5 min walk to where I stayed. I paid 12 euro or 15 euro 🤔 the con about the boat taxi I was on, you are inside the boat (was not able to enjoy the views while on the water 🙄). If I would have known that, I would have just taken the train but owell."}, {"username": "Dave Colleen", "comment_text": "Water taxi picked us up at airport and dropped us off right in front of our hotel. Cost 140€"}, {"username": "Anna Buchan", "comment_text": "Yes van to transfer to water taxi to take you to hotel"}, {"username": "Roger Pajo", "comment_text": "Leaving the airport…it’s awesome. There is a designated area and signs everywhere. Cheers!"}, {"username": "Laura DeCicco", "comment_text": "You don’t need a transfer from the airport to the private water taxi dock. It’s a quick and easy 5 minute walk"}, {"username": "Tricia Brittingham Neff", "comment_text": "How do you go about arranging a private water taxi? We arrive Wednesday!!"}, {"username": "Glenn Todd Webb", "comment_text": "Dock at airport. Depends if you hotel is on the water."}, {"username": "Kathy Morra Kuloy", "comment_text": "Can someone give info on how to reserve a private water taxi from the airport, please. Going in October. Thank you!"}, {"username": "Eva Salas", "comment_text": "If the vaporetto is available from the airport it’s a fraction of the cost , about 12_15 euros. Why would you pay 150?"}, {"username": "Heather Hills Jacobs", "comment_text": "We stayed at the Hotel Continental and it has a dock right at the hotel for drop easy drop off and pick ups!! I went through Get your guide! They met us right after customs.. easy and fun!!! Another good resource is Venice Group Services for private transfers etc!"}, {"username": "Kim Preston Ackerman", "comment_text": "Maizie Humm Aubrey Alice"}, {"username": "Lee Rew", "comment_text": "My travel agent booked us a private water taxi through European Express. The rep met us at airport and took us to a van, which drove us to a water taxi dock and then we had a short ride in. Needless to say I was pissed we spent most of our time in a van. Have requested some money back."}, {"username": "Betty Stilt", "comment_text": "Stay at the JW Marriott. The water taxi takes you into the lobby and you disembark there."}, {"username": "Maureen Rebello Hagerty", "comment_text": "Bus is very cheap from airport to venice"}]}, {"id": "2197795460619532", "text": "Looking for recommendations for restaurants which have gluten free and lactose free options- travelling to Venice, Florence, Rome, Cinque Terre. Recommendations for these cities much appreciated. I cannot wait to see these beautiful cities!", "link": "facebook.com/groups/1373361046396315/permalink/2197795460619532/", "likes": 0, "comments": [{"username": "Melissa Johnson Pero", "comment_text": "We traveled to each of those and every restaurant had gluten free options. Gluten free pasta, pizzas, seafood.."}, {"username": "Ellen Edmonds-Wilson", "comment_text": "Use the Find me Gluten Free app as a guidé. Our resident coeliac reviewed everywhere we ate on it during our recent month in Italy. It was easy for her to eat and lactose free cheese was often available. The top rated gf restaurants on the app in each city are a good guide. Claire wrote honest reviews and ate very well."}]}, {"id": "2197797873952624", "text": "Anyone have suggestions on a smaller town close to Florence I can stay in that's more affordable? And walkable/close to public transport? I won't have a car and under $100/ day for stay is the goal. It'll be for beginning of September.\nThanks for any tips and suggestions!", "link": "facebook.com/groups/1373361046396315/permalink/2197797873952624/", "likes": 7, "comments": [{"username": "Dr-Jon Warnecke", "comment_text": "Arezzo, Lucca"}, {"username": "Brenno Bianchi", "comment_text": "Montecatini Terme"}, {"username": "AgAnne Chrzanowska", "comment_text": "Prato"}, {"username": "Ken Lerch", "comment_text": "Lucca is close, 1 hour, but to get those rates, you'll likely be outside of the old town walls. Also, see what you can find up the hill in Fiesole."}, {"username": "Alice Francesca", "comment_text": "I am from Italy.Stay in Lucca. Easy train ride to Florence."}, {"username": "Colleen Jennings", "comment_text": "San Casciano val di Pesa - 30 mins from Florence on a bus route."}, {"username": "Connie Wilson", "comment_text": "Try staying in a monastery, which can be very reasonable for singles.\n\nhttps://\nwww.monasterysta\nys.com/\n?d=Italy%2FTusca\nny%2FFlorence-a\nccommodation"}, {"username": "Stefano Follador", "comment_text": "Livorno? Not the most beautiful city, but lovely seaside and a lot of personality."}, {"username": "Anita Lahey", "comment_text": "Montecatini Terme"}, {"username": "Jerry Japczyk", "comment_text": "Look in prato 17 min train ride"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Check in Pisa city center (near the river), 1h train from Florence, 30 minutes to Lucca, 20 minutes and tou can reach the beach. In September students will be back so in the evening it will be fun (if you search with the lens you can find a post about what to do when one day in Pisa)."}, {"username": "Marina Ting", "comment_text": "Lucca is stunning, my favourite place!"}, {"username": "Rachel Manz", "comment_text": "Our air bnb in Florence was under $100"}, {"username": "Naomi Collado", "comment_text": "Following bc I will too be there in September and am looking to stay under $100 usd per day!"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Fiesole."}, {"username": "Donna Gilardone Szwabowski", "comment_text": "Montecatini Terme, love this town"}, {"username": "Judith Pishnery", "comment_text": "what about Siena"}, {"username": "Renae Larcus", "comment_text": "Siena. Fiesole. Lucca"}, {"username": "Amy Gutierrez", "comment_text": "Alice Guernieri"}, {"username": "D.p. Buonaccorsi", "comment_text": "We stayed in Lucca and loved everything it had to offer. Great city center with great food and history"}, {"username": "Jim Hash", "comment_text": "Florence is the best place. Two to five stops on either tram line gets you under 100 €uro for lodging. Then you’re €1.50 each way into SMN station."}, {"username": "Lindsay Stewart", "comment_text": "Look for a single room at a monastery….some\none linked them in another comment. We stayed in monasteries in several cities last month, all booked through that site. The one we stayed at in Florence was great and a FANTASTIC location."}, {"username": "Avril Samuel", "comment_text": "https://\nen.m.wikipedia.o\nrg/wiki/\nBagno_a_Ripoli"}, {"username": "Nina Rovinelli Heller", "comment_text": "Prato - lovely little town 20 minute train ride"}, {"username": "Jody Patterson Padgett", "comment_text": "We stayed in a convent, Casa Santo Nome de Jesu, in Florence on the other side of the Arno from the center. Clean, great location and breakfast included"}]}, {"id": "2197799977285747", "text": "Luggage storage in como?", "link": "facebook.com/groups/1373361046396315/permalink/2197799977285747/", "likes": 0, "comments": []}, {"id": "2197809427284802", "text": "Good morning.\nLooking for the best hotel in the Cinque Terre. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2197809427284802/", "likes": 7, "comments": [{"username": "Tonsia Keytel", "comment_text": "Stay in beach area of Monterosso, easy flat surface and train station is right there to travel to other villages."}, {"username": "Akis Pirpilidis", "comment_text": "Tripadvisor."}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "Vernazza: La Mala"}, {"username": "Grace Monaghan", "comment_text": "Im currently in Monterosso and it’s beautiful. Im staying at Solemare.. its very small but clean and walking distance from train,shops, restaurants and the beach. Oh whilst the area is flat there are stairs to B&B!!"}, {"username": "Anzhelika Antyasova", "comment_text": "Hotel il Colle de Monterosso"}, {"username": "Dimity Betar", "comment_text": "Do you have a budget or just want the best ?"}, {"username": "Anna Buchan", "comment_text": "Monterosse stay at il collie"}, {"username": "Colleen Jennings", "comment_text": "Due Tori in Sestri di Levante - stayed there in March. Fabulous. Ask for a room with a view of the sea."}, {"username": "Libby Szabo", "comment_text": "We stayed in a Airbnb 1/2 a block from the beach"}, {"username": "Mat PO", "comment_text": "Splendido in Portofino"}, {"username": "Ken Lerch", "comment_text": "If you are interested in a agriturismo outside of Monterosso let me know."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "There are five villages in the Cinque Terre. Where did you have in mind?"}, {"username": "Melissa Johnson Pero", "comment_text": "Hotel Pasquale is fantastic! Delicious breakfast, right on the beach, clean. We just loved it.."}, {"username": "Debbie Cooper Goldman", "comment_text": "We loved creuza de ma in Riomaggiore. 4 rooms with ocean front views, patios to watch the sunset. Great location!"}, {"username": "Jess Armour", "comment_text": "Scorci Di Mare in Riomaggiore! Way less packed than other villages and the hotel staff were incredible! Very close to the Marina"}, {"username": "John Selvaggio", "comment_text": "Porto Roca in Monterossa Check out this place in Monterosso al Mare I found on https://\nhotels.app.link/\n?type=0&duration\n=0&source=ios&d\nata=eyJ%2BY3Vzd\nG9tZXJfYWRfbmFt\nZSI6IkJSQU5ELkh\nPVEVMUy5DT00tR0\nwuRElTUExBWS5FT\n0QuSU9TLUFQUEhJ\nUy1TSEFSRUxJTks\niLCIkZGVza3RvcF\n91cmwiOiJodHRwc\nzovL3d3dy5ob3Rl\nbHMuY29tL21vYml\nsZS9kZWVwbGluay\n9ob3RlbC5oNTE3N\nTkzMC5Ib3RlbC1J\nbmZvcm1hdGlvbj9\nzdGFydERhdGU9Mj\nAyMy0wOC0xNiZlb\nmREYXRlPTIwMjMt\nMDgtMTcmcm0xPWE\nxJnJmcnI9QXBwLk\ndyb3d0aC5pT1MmT\nUNJQ0lEPWExQVBQ\nU09DSUFMUkVGRVJ\nSQUwuYjFoNTE3NT\nkzMC5jMUhvdGVsc\ny5JbmZvc2l0ZSIs\nIiRjYW5vbmljYWx\nfaWRlbnRpZmllci\nI6Imh0dHBzOi8vd\n3d3LmhvdGVscy5j\nb20vbW9iaWxlL2R\nlZXBsaW5rL2hvdG\nVsLmg1MTc1OTMwL\nkhvdGVsLUluZm9y\nbWF0aW9uP3N0YXJ\n0RGF0ZT0yMDIzLT\nA4LTE2JmVuZERhd\nGU9MjAyMy0wOC0x\nNyZybTE9YTEmcmZ\nycj1BcHAuR3Jvd3\nRoLmlPUyZNQ0lDS\nUQ9YTFBUFBTT0NJ\nQUxSRUZFUlJBTC5\niMWg1MTc1OTMwLm\nMxSG90ZWxzLkluZ\nm9zaXRlIiwiJGNh\nbm9uaWNhbF91cmw\niOiJodHRwczovL3\nd3dy5ob3RlbHMuY\n29tL21vYmlsZS9k\nZWVwbGluay9ob3R\nlbC5oNTE3NTkzMC\n5Ib3RlbC1JbmZvc\nm1hdGlvbj9zdGFy\ndERhdGU9MjAyMy0\nwOC0xNiZlbmREYX\nRlPTIwMjMtMDgtM\nTcmcm0xPWExJnJm\ncnI9QXBwLkdyb3d\n0aC5pT1MmTUNJQ0\nlEPWExQVBQU09DS\nUFMUkVGRVJSQUwu\nYjFoNTE3NTkzMC5\njMUhvdGVscy5Jbm\nZvc2l0ZSIsIn5jd\nXN0b21lcl9wbGFj\nZW1lbnQiOiJBUFB\nISVNTSEFSRUxJTk\nsifQ%3D%3D"}, {"username": "Presley Wilkie", "comment_text": "I second Hotel Porto Roca!"}]}, {"id": "2197803140618764", "text": "I'm researching and reviewing the map of Italy and its not helping. We want to do our last 4 days in a beach town to relax from all the sightseeing and traveling from city to city. What beach town do you all recommend from your experience that has beautiful, calm and pristine water? It can be on both side of the coast. We want to stay away fromआणखी high cliffs where it's difficult and tiresome to walk to the beach and back to our Airbnb (we're in our 50's..lol)....we want something easy, but beautiful views and also has bars and restaurants. I know I'm asking for a lot, but..hey it's Italy....thanks in advance... 🏖", "link": "facebook.com/groups/1373361046396315/permalink/2197803140618764/", "likes": 40, "comments": [{"username": "Jacki Aragon Riley", "comment_text": "Isle of Elba. Fantastic"}, {"username": "Jules Blumke", "comment_text": "Ischia or Ponza"}, {"username": "Wendy Farrell", "comment_text": "We enjoyed Rimini & Pescara- both had great Sandy beaches, bars and restaurants"}, {"username": "Meredith Schultz", "comment_text": "https://\ntravelspock.com/\nbest-beaches-isc\nhia-for-couples\n-families/ Ischia island in the Bay of Naples (a half-hour fast ferry ride or 90-min ‘slow’ ferry from the port of Napoli), has many different beaches, most family-friendly\nwith lots of cafes close by, others hidden little bays with pristine waters but away from the main villages. Heaps of accommodation within walking distance. And lots of opinions about which is their ‘best beach’. Some say Chiaia, others say Maronti. Good luck with your planning. ☺️🍷"}, {"username": "Jennifer Walker", "comment_text": "I can’t remember how I found it but we spent several days in Sestri Levante in 2016 and it was so nice, after several days of touring. It’s between Portofino and Cinque Terre. Loved it!"}, {"username": "Marguerite Lorenzi Gonzales", "comment_text": "Rimini or Cervia"}, {"username": "Daniela Ricketts", "comment_text": "Ravenna"}, {"username": "Colette Guerriero", "comment_text": "Viareggio"}, {"username": "Jeanne Hannivig-jones", "comment_text": "I love ponza"}, {"username": "Lori Finamore", "comment_text": "Vasto"}, {"username": "Irene Oda", "comment_text": "When are you traveling?"}, {"username": "Andria Saia", "comment_text": "I would definitely say the beaches of Puglia- not nearly the crowds of the west coast"}, {"username": "Giorgia Petraia", "comment_text": "Go to forte dei marmi"}, {"username": "Izzie MacDonald", "comment_text": "Cefalu..we had a whole place to ourselves..was awesome..extend\ned from 2 to 4 nights..\nOr Taomina or Minori all beaches..nice communities"}, {"username": "Amy Maselli", "comment_text": "Rimini"}, {"username": "Lisa Jones", "comment_text": "Tried Ischia?"}, {"username": "Peach Panfili", "comment_text": "You need to consult the Italian Blue Flag Beaches Guide"}, {"username": "Dayna Steinberg Cioffi", "comment_text": "Sorrento. Easy to get to from Naples and lots of hotel choices. Many have their own beach areas with elevators to take you down there. Check out the Parco di Principe."}, {"username": "Romina Lauretig Toscano", "comment_text": "GAETA at 1.30h from Rome.."}, {"username": "Caroline Croghan", "comment_text": "Viareggio is really lovely (and flat)"}, {"username": "Chelsea Johnson", "comment_text": "cinque terre!!!!"}, {"username": "Maria Ariano", "comment_text": "Jesolo"}, {"username": "Nicki Trueman", "comment_text": "Via Reggio? It’s about a 25 min train from Pisa Centrale. We spent some time there and it was lovely. Most of the beach is private (I.e. you pay for sun bed) but there is a pretty decent sized free beach that’s just as lovely (if not better). A few lunch spots on the beach to. We spent so much time in the water it was so warm!!!"}, {"username": "Teresa Heran", "comment_text": "Tropea!"}, {"username": "Angela Celenza", "comment_text": "Vasto on the Adriatic coast... beautiful sandy beach, great bars and restaurants as well."}, {"username": "Laura Maffei", "comment_text": "Rimini!"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Have a look at the little towns near Capalbio"}, {"username": "Danielle Seal", "comment_text": "Maiori! Love love love maiori!"}, {"username": "Susan Buckley Thorpe", "comment_text": "This is all so beautiful! I think anything you pick is going yo be most amazing 🇮🇹"}, {"username": "Veronica Parravicini", "comment_text": "Hi! If you want clear water and sandy beach you need to go to: Puglia, Sicilia, Sardegna or Calabria\nI saw a lot of people suggesting Rimini, Lignano Sabbiadoro, Viareggio ecc which have beautiful sandy beaches but the sea is gross.\nCinque Terre (Liguria in general) or Amalfi Coast, Sorrento etc may have clear waters but not sandy beaches, they’re rocky and super small.\nYou can find some hidden gems like Sperlonga in Lazio (near Rome) or Monte Conero (Marche regions)\nIt also depends on when you are going"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Sardinia (all of it), little town of Castiglioncello\n, something near the beach of Capalbio, Puglia."}, {"username": "Carol Ann Valente", "comment_text": "Rimini, Italy"}, {"username": "Phyllis Snyder", "comment_text": "What’s the dates?"}, {"username": "Judith Pishnery", "comment_text": "I liked the area around Sestri Levante, just west of the Cinque Terre, could walk out on the beach, nice small town."}, {"username": "Colleen Jennings", "comment_text": "Marina di Pietrasanta is fabulous. We’ve been going there for the past 25 years, particularly Tonfano. Lovely stretch of beach on the flat from Viareggio to Marina di Massa. Hire bikes & cycle from town to village to town. Fantastic market on Weds & Sun at Forte dei Marmi (upmarket shops in the town, Gucci etc). Italians holiday here non touristy. Superb beach clubs along this stretch of beach. Easily accessible by train from Pisa & Genoa. Enjoy!"}, {"username": "Felicia Melo", "comment_text": "We went to Mondello beach in Palermo, Cefalu, and Isola Bella in Taormina. All these beaches are in Sicily"}, {"username": "Vanessa Tuveri", "comment_text": "Sardegna , Stintino ."}, {"username": "Valerie Collanton", "comment_text": "Check out Rimini."}, {"username": "Brad Nelsen", "comment_text": "Costa Smerelda in Sardinia"}, {"username": "Susan Shapiro", "comment_text": "We are staying two weeks in Tuscany in September. I booked a Ferry to the island of Elba. Check it out, some beautiful beaches, architecture, and plenty of hotels. ￼"}, {"username": "JoLynn Waters", "comment_text": "Puglia, Calabria, Sicily"}, {"username": "Sonia Scotto Lubrano", "comment_text": "Tropea 😍"}, {"username": "Michelle Plutto", "comment_text": "Following"}, {"username": "Linda Harwin", "comment_text": "Viareggio"}, {"username": "Matthew Cawley", "comment_text": "Sorrento and do a beach club or Ishia and go to Sant'Angelo. Can get ferry to and from Sorrento or Naples. Then closeby to Naples for airport"}, {"username": "Enzo Teutonico", "comment_text": "SAN VITO LO CAPO is a nice beach town in sicily.\n\nMenfi is too with porto palo beach\n\nSciacca too"}, {"username": "Barbara Pasteris Allen Hettlinger", "comment_text": "We had a lovely stay at Hotel Pupetto in Positano several years ago. It's right on the beach and within easy walking distance to the town, shops and restaurants. Really nice spot."}, {"username": "Sonja Scarpaci", "comment_text": "Via Reggio is great if you want to go where the locals holiday.\nThere are night markets on the promenade and beach bars and restaurants all along the coastline."}, {"username": "Josephine Rauch Rotunda", "comment_text": "Check out Ischia!"}, {"username": "Rick Schneider", "comment_text": "Punta alla on Tuscany coast"}, {"username": "Rick Schneider", "comment_text": "Cefslu in Sicily"}, {"username": "Rick Schneider", "comment_text": "Ravenna on the Adriatic"}, {"username": "Nick Scocco", "comment_text": "Pescara"}, {"username": "Juli Fields", "comment_text": "Following"}, {"username": "Marilena Damilano", "comment_text": "Puglia. Le maldive del Salento"}, {"username": "Rhona OConnor", "comment_text": "There are lots of lovely spots on the east coast. We went to Pescara. Just picked it on the map knowing nothing about it. Lovely place. Bari was great too."}, {"username": "Layla Maryam Razavi", "comment_text": "You won’t find more beautiful beaches than in puglia if you’re willing to fly down there (or train but quite long). Santa Maria at the southern most point has all the things you describe."}, {"username": "Miyuki Kanno Paul", "comment_text": "Rimini"}, {"username": "Lauren Pasquali", "comment_text": "San Vito lo capo, great little beach town, excellent, cheap food and lively night life🇮🇹🇮🇹"}, {"username": "Helen Ladkin", "comment_text": "Someone recently posted a recommendation for Hotel Bitta in Sardinia. It certainly sounded amazing and just the place to wind down after a busy visit to Italy."}, {"username": "Alice Francesca", "comment_text": "Cala Moresca, near Golfo Aranci.beware it s in a naturale reserve so you need to park and walk about 15 minutes (I am in my 50's too and it s not a problem)"}, {"username": "Alice Francesca", "comment_text": "What about Sardinia? Easy quick flight with Volotea from Pisa.Land in Olbia, rent a car.All the most beautiful beaches, Caribbean like, in less than 30 minutes drive, North or South.I highly recommend Porto Rotondo or Golfo Aranci to sleep, then drive to the beach you pick for the day."}, {"username": "Alice Francesca", "comment_text": "Alice Francesca"}, {"username": "Alice Francesca", "comment_text": "Alice Francesca"}, {"username": "Alice Francesca", "comment_text": "Alice Francesca"}, {"username": "Alice Francesca", "comment_text": "https://\nyoutu.be/\nwK-zCucvoIY"}, {"username": "Mike Laudick", "comment_text": "Do you want a sandy beach or a beach with small stones. The beaches here are nothing like what you find in Florida."}, {"username": "Cindy Sguazzin", "comment_text": "Our favourite beach, both for adults and kids, is Lignano Sabbiadoro, beautiful long sandy beach edging on a very nice small city (Lignano) on the Adriatic coast just north of Venice! Check it out! We went many times!"}, {"username": "Kelly Dillon", "comment_text": "Someone commented on one of my posts recommending grand palladium sicilian resort in Campofelice di Roccella it's about 10 minutes away from Cefalu. All inclusive beach front resort. I looked it up and beach and pricing were so good!!"}, {"username": "Paula Brink", "comment_text": "Forte dei Marmi on the Tuscan coast, sandy beach and nice beach clubs to spend the day in."}, {"username": "Nina De Martino McDonough", "comment_text": "Following"}, {"username": "Amy Maselli", "comment_text": "Rimini"}, {"username": "Stephanie Stevens Burke", "comment_text": "Amalfi Coast. We loved Maiori and Miori. Small towns, easy beach access, great restaurants. (Just leaving Italy and we loved Amalfi and didn’t enjoy Cinque Terre)."}, {"username": "Diane Janovas", "comment_text": "Via Reggio"}, {"username": "Laura Uribe", "comment_text": "Rimini is a great option. Large beach area, shopping and restaurants."}]}, {"id": "2197814477284297", "text": "We will be in Sorrento in April and I am looking for hotels. I’d like a view and possibly a pool. Will it be too cold to use the pool?", "link": "facebook.com/groups/1373361046396315/permalink/2197814477284297/", "likes": 1, "comments": [{"username": "H Raymond Fasano", "comment_text": "I think it will be cold. Hard to find a heated pool in that area. Try Hotel Vesuvio"}, {"username": "Robin Barbera", "comment_text": "Grand Hotel De La Villa. Nice hotel. Great breakfast and restaurant, two pools and about a 10 minute walk to the heart of town and the elevator to the beach."}, {"username": "Pat Cray", "comment_text": "Too cold"}, {"username": "Megan Dempsey Lelli", "comment_text": "You’ll need a heated pool. It maxes out around 68/70 degrees (on warmer days) in April with a ton of rain."}, {"username": "Tanya Cini-Kirk", "comment_text": "Hotel Rivage!! Highly recommend"}, {"username": "Kathy Massicotte Talnose", "comment_text": "Grand hotel ambasciatori"}, {"username": "Katherine Azcue", "comment_text": "It will be cold. We went in mid May and it was freezing. We stayed at hotel continental and it was fabulous"}, {"username": "Sarah Wood Armstrong", "comment_text": "Villa Oriana Relais"}, {"username": "Lisa Martinez", "comment_text": "Check out Hotel Conca Park it is beautiful and perfect location!"}, {"username": "Mary Sandor White", "comment_text": "We are booked at Hotel Settimo Cielo in Sorrento for September. Paying $1000eu for 5 nights. It looks nice and it’s walkable to town. We previously stayed at Hotel La Tonerella but this time the price jumped to $600 per night."}, {"username": "Dana Talusani", "comment_text": "Grand Hotel La Favorita. We LOVED our stay there and they have a rooftop pool, amazing restaurant and incredible staff. That said, it may be too chilly for the pool?"}, {"username": "Sandy Radican Shikaly", "comment_text": "Grand Hotel La Favorita!!!!"}, {"username": "Bob Lampo", "comment_text": "Great suggestions. Thanks all"}, {"username": "Nancy Fricke Corsi", "comment_text": "Palazzo Jannuzzi Relais"}, {"username": "Michael Barnes", "comment_text": "No"}, {"username": "Karen Cumbo", "comment_text": "I don’t think pools are open in April"}, {"username": "Dimity Betar", "comment_text": "Yes !"}, {"username": "John Selvaggio", "comment_text": "Imperial Hotel Tramantano"}, {"username": "Jean Bennett O'Reilly", "comment_text": "Grand Hotel Favorita. Rooftop pool and bar, great restaurant.\nPerfect location."}, {"username": "Peach Panfili", "comment_text": "Probably a bit nippy but you’ll have the bonus of being in a beautiful place without crowds of hot and flustered selfie-taking tourists. Best time of the year to explore the Amalfi Coast. Make sure to visit magical Ravello as well as The more usual hotspots of Positano and Capri."}]}, {"id": "2197817817283963", "text": "Beautiful Florence and quick visit at Pisa 🇮🇹\n\nItaly is awesome country 👌", "link": "facebook.com/groups/1373361046396315/permalink/2197817817283963/", "likes": 495, "comments": [{"username": "Farrah Sweetiepie", "comment_text": "Robert Corpuz\n❤️❤️❤️"}, {"username": "Marina Samovsky", "comment_text": "Thank you for sharing!!!"}, {"username": "Gloria Cruz", "comment_text": "Yes! Love your pictures. 💖"}, {"username": "Mel Abordo", "comment_text": "Love the pictures! Thanks for sharing. Looks like you had a great time!"}, {"username": "Allan Foo", "comment_text": "Well taken pictures 👏🏻👏🏻👏🏻"}, {"username": "Marie Simpson", "comment_text": "Demi Quinn Sophie King"}, {"username": "Ana'a Maria Tacu", "comment_text": "wow great pictures! what camera do you use? have fun! ✨"}, {"username": "Michael Rudder", "comment_text": "Great pictures."}, {"username": "Tami Neubauer Foster", "comment_text": "Great pics!!💜"}, {"username": "Kyunghoo Kim", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Ruth Akutu Maccarthy", "comment_text": "Thank you for sharing!"}, {"username": "Shula Hurvitz", "comment_text": "Shula Hurvitz"}, {"username": "Shelley Wertz", "comment_text": "Amy Currie"}, {"username": "Yara Karime Vazquez", "comment_text": "Perlita Cabrera"}, {"username": "山川 いくこ", "comment_text": "Love your pics!"}, {"username": "Andrea Romano", "comment_text": "Andrea Romano"}, {"username": "Alexis McNamara", "comment_text": "Did you have to store luggage in Pisa? If so can you tell me what you did?"}, {"username": "Cindy Medina", "comment_text": "Love the pics!"}, {"username": "Voula Ladas", "comment_text": "Fantastic pics !"}, {"username": "Diane Hamilton", "comment_text": "Great pictures 🇮🇹"}, {"username": "Nancy Marie Jones", "comment_text": "Beautiful"}, {"username": "Teresa D'Alessio", "comment_text": "Phenomenal photos"}, {"username": "Renee Dillenbeck", "comment_text": "Can you share your favorite places to see or visit in Florence. We are thinking about stopping for 2 days, but deciding between here or Rome."}, {"username": "Ryan Haynes", "comment_text": "Martins Linē what camera did use guys use ?"}, {"username": "Dennis Chen", "comment_text": "Great picture! by the way, do you drive? Any good tips to avoid ZTL in Florence?"}, {"username": "Jeanette Grima Falzon", "comment_text": "Amazingly captured"}, {"username": "Hagar Mohsen", "comment_text": "So where to go in florence?"}, {"username": "Iman Nazaran", "comment_text": "Is there any way to visit Pisa from Florence and getting back to Florence in few hours?"}, {"username": "Sascha Smith", "comment_text": "How did you get these photos to look like this?"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2197818177283927", "text": "We will be in Rome for the holiday/feast on August 15th. Does anyone know if there is anything special going on like festivals or fun activities? I know the Vatican will be closed but most other tourist attractions will be open but can’t find any specific info. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2197818177283927/", "likes": 1, "comments": []}, {"id": "2197730427292702", "text": "Does anyone have any recommendations for cooking classes in Florence or Venice? 🥰", "link": "facebook.com/groups/1373361046396315/permalink/2197730427292702/", "likes": 2, "comments": [{"username": "Kathryn Phillips Girard", "comment_text": "I’m looking for a class in or near Florence also! I hope a comment helps your post be seen!"}, {"username": "Ellen Davis", "comment_text": "I am also looking for a cooking class in Florence !"}, {"username": "Dawn Pape Wolf", "comment_text": "Following"}, {"username": "Kim Catania", "comment_text": "Towns of Italy - Florencetown- most amazing cooking class! Market and bakery tour, then fabulous class!"}, {"username": "Melissa Johnson Pero", "comment_text": "Towns of Italy was great!"}]}, {"id": "2197821997283545", "text": "I realize this is common sense, but sometimes when you're exhausted from hours of travel, common sense goes out the window. Our friends flew into Rome and rented a car. On the way to their destination they stopped somewhere really quick to get something to eat. They left their luggage in the car. They were gone 15 minutes. Someone broke the window and stole all of their luggage. They lost everything but the clothes on their backs. Obviously changed their trip drastically 😒", "link": "facebook.com/groups/1373361046396315/permalink/2197821997283545/", "likes": 38, "comments": [{"username": "Pearl Lucero", "comment_text": "My friend stopped at a bank machine to pull out cash, she was near her car, but back to it while she did her transaction. She turned around and someone was running away with her purse, computer, phone etc. it can happen that fast!"}, {"username": "Giorgia Petraia", "comment_text": "They should have left them in the car trunk, not visible from windows"}, {"username": "Nadia Nadia", "comment_text": "I live in Australia and Same thing happened with my cousin visiting Sydney. Got the rental car put luggage in it drove to his friends house for a brief stop before checking in the hotel , all gone. Morale of the story is, it happens every where 😞"}, {"username": "Paul Anderson", "comment_text": "We always park in front of large groups of people like out door cafes. That way all the eyes are helping protect our car. Park in a dark alley and guess what happens. You save on parking but can lose everything."}, {"username": "Amalia Cristina", "comment_text": "Well, a couple things to consider there! 1. Always put the luggage totally out of sight, when you rent the car make sure that all your luggage fits in the trunk so you don’t leave anything in sight. 2. If the luggage does not fit and you don’t have any other option bring some luggage into the restaurant you are going into. 3. don’t dress as a tourist. 4. leave the car in sight where you can see it. 5. Consider leaving someone in the car if none of the above options are available."}, {"username": "Kate Squillacioti", "comment_text": "When we picked up our rental car that was actually the first thing the attendant said to us..... do not leave your luggage unattended in the car. Sucks that it has to be like that"}, {"username": "Peach Panfili", "comment_text": "Yes it does happen - even ticket machines in train stations have an announcement in languages including English which says before you begin your purchase “Beware of pickpockets”"}, {"username": "Sue Wurz", "comment_text": "This happened to my family in San Francisco last year, but they only took 2 bags."}, {"username": "Monica Grieger", "comment_text": "It does happen everywhere - I have been cautious and safe\nBut we were standing in a store in Notting hill in London and while I was talking to the shop worker someone walked in behind me\nGrabbed 2 things off the table and ran\nI couldn’t believe my eyes\nIf I had a bag I’m sure they would have grabbed it\nThey definitely jump when you lease expect it🤷‍♀️"}, {"username": "Diane Davis Lawyer", "comment_text": "I've not read through all 182 comments, but many credit card companies provide luggage insurance for lost or stolen luggage. AMX Gold and other tiers provide this up to certain amounts. They should check with their credit card company to see if they were provided such protection. It is something, rather than nothing if they do."}, {"username": "Kimberly MacKinnon Cherry", "comment_text": "You must be sensible no matter where you are traveling. Leaving all your belongings in a car is never a good idea"}, {"username": "Marie Buchanan", "comment_text": "So sad that this is “to be expected” when traveling to Italy, what a welcome 😞"}, {"username": "Diane Bowler", "comment_text": "Thank you for sharing this sad story. My daughter and I are touring in a motorhome during September and October may need to rethink where we visit. ☹️"}, {"username": "Eva Szalai", "comment_text": "It’s a common sense to put your luggage at the trunk!"}, {"username": "Kirstin Pizzitola Bergstedt", "comment_text": "What do you do when you want to visit little towns on the way to a destination?"}, {"username": "Adriana Sormani", "comment_text": "Same anywhere… don’t leave valuables in cars… not Italians doing the crimes BTW…"}, {"username": "Louellen Klints Karthaus", "comment_text": "Oh my gosh! Thank you for mentioning this! So sorry this happened"}, {"username": "Kim Butler Oam", "comment_text": "That is really awful luck for your friends. There’s thieves everywhere so I alarm everything, portable alarms with remote control and one for my room and I bought a second for my hire car on a resent road trip around Bali. I arm the car whenever I’m not in it. These small alarms don’t weigh much at all. It’s something to consider if you’re doing a road trip. I also have trackers hidden in my luggage. But thankfully I’ve never needed to use them. Except to check my luggage is actually on the plane with me lol.\nI hope your friends carry on ok and enjoy their holiday. 😎"}, {"username": "Skye Marie", "comment_text": "Tony Weinstein wow"}, {"username": "Melinda Brown", "comment_text": "Personally I hated Rome. It’s dirty, hot, and unfriendly. The ancient ruins have been ruined."}, {"username": "Karen Shea Connell", "comment_text": "Sounds like Portland Oregon😢"}, {"username": "Nashreen Sulaiman", "comment_text": "Sometimes bad things happen unexpectedly while being on holiday and tends to set you aback alot...but the main thing is to stay focused on experiencing the good things of ones journey and seeing the setbacks as mere learning experiences"}, {"username": "Donna Germann", "comment_text": "Thank you for the reminder to remain vigilant."}, {"username": "Lisa Jagodzinski", "comment_text": "That happens here in the states too. I never leave luggage unattended in a car. Italy has luggage lockers in a lot of the big cities or train stations. Very easy to use. Sorry this happened to them. This happened to friends of mine on their honeymoon in San Diego. They had their wedding rings in luggage since they were going to beach and when they returned to car, all their luggage and new wedding rings gone."}, {"username": "Pai Ge", "comment_text": "I’m paranoid about this happening to us. Whenever we stop on our road trips, unless I can see the car from where I’m sitting we move in to somewhere we can. Not worth the risk. Poor people 😞"}, {"username": "Frannie Kaplan", "comment_text": "People are crazy they steal just cuz they can even if it's just old clothes. Always \"hide\" things in the trunk. So many weirdos around not just in Italy"}, {"username": "Karen Curcio", "comment_text": "Beautiful photography."}, {"username": "Charlotte Perry Henrichs", "comment_text": "Always get full travel insurance, relax and enjoy. As long as you are still alive you are ok."}, {"username": "Michelle Middleton", "comment_text": "This is awful but you know what.. karma is real and what goes around comes around.... The thief's will pay one way or another."}, {"username": "Nana Tirolese", "comment_text": "There's a reason why Italians lock their cars up behind gates. 😉"}, {"username": "Keith Crossley", "comment_text": "Parking garage Rochester NY tells you not to do this. Sorry it happened. I'm guilty, but try to park where I can see it. Or go to Iceland."}, {"username": "Gregory Smith", "comment_text": "Same will happen in San Francisco. Terrible way to start a journey."}, {"username": "Bunmi Ojikutu", "comment_text": "I am so sorry for them😢. I hope they have a village sending them positive vibes and encouragement to somehow push through to make the most of the trip. I would definitely need and appreciate that if I was in the situation…. Try to wait wait until we get home to completely go bananas with anger, regrets, tears, and all the rest of it."}, {"username": "Jose Velez", "comment_text": "Every time I stop to eat at a car stop I park where I can see and one of us takes turn in watching the car. I have been lucky in over 50 car trips to Europe nothing stolen and most in Italy"}, {"username": "Cheryl Belloff", "comment_text": "Geez all these posts of stolen luggage and pickpocketers makes me wonder if italy is safe"}, {"username": "Lisa Todd-Collins", "comment_text": "Oh how awful. Howard"}, {"username": "Marita Naude", "comment_text": "Practical question. How do you then travel if you can’t leave luggage in the trunk?"}, {"username": "Cinzia Wong", "comment_text": "Horrible. So sad."}, {"username": "Lisa Harvey Stiles", "comment_text": "We are overly cautious everywhere because there are terrible people everywhere! Fortunately there are more good but the bad people just suck! They think they can take whatever they want!"}, {"username": "Lisa Pinder", "comment_text": "Happened to someone I knew as well"}, {"username": "Vera Feeny", "comment_text": "This also happened to my roommate in Spain.. She was Spanish so not even targeting rental cars"}, {"username": "Denise Conley Thurling", "comment_text": "Happened to my family members. Leave nothing in the car!"}, {"username": "Laura Allison", "comment_text": "I understand that crime is everywhere but all that I've been reading about are professional pickpockets- it's making me very nervous about traveling to Italy... can somebody reassure me that this isn't the norm there..."}, {"username": "Reese Colmenares", "comment_text": "This is horrible. So sorry. I once live in a country where there are also pickpockets but stealing luggage in a parked car or in the boot is over the top crime. Blessed to be in a my new home country now that this is a non existent threat- I love Australia."}, {"username": "Lucie Belle-Isle", "comment_text": "The same thing happened to a coupled we met in Sicily. And it was their fifth or sixth trip there. They just stopped at a restaurant along the road, the parking lot was full, they thought the risk was small… We actually met them at the police station in Catane… we were driving in the city, we had rented a Ford Fiesta - the doors don’t lock automatically- and suddenly a motorcycle cut in front of us and stopped, forcing us to put rapidly the brakes on…while another guy opened the back door and took everything that was there, including my handbag with our passports. Fortunately, my husband had his credit cards with him… You are never too careful! No matter the city or the country."}, {"username": "Lucie Belle-Isle", "comment_text": "The same thing happened to a coupled we met in Sicily. And it was their fifth or sixth trip there. They just stopped at a restaurant along the road, the parking lot was full, they thought the risk was small… We actually met them at the police station in Catane… we were driving in the city, we had rented a Ford Fiesta - the doors don’t lock automatically- and suddenly a motorcycle cut in front of us and stopped, forcing us to put rapidly the brakes on…while another guy opened the back door and took everything that was there, including my handbag with our passports. Fortunately, my husband had his credit cards with him… You are never too careful! No matter the city or the country."}, {"username": "Rose Troiano", "comment_text": "Dominic Troiano"}, {"username": "Carol Sue Lanni", "comment_text": "Awful"}, {"username": "Lee Say Lor", "comment_text": "This can happen in any country if u are unlucky not just in italy. Sorry to hear this."}, {"username": "Pat Casper", "comment_text": "Pretty sad when tourists bring revenue to a country and support the businesses there, and they turn around and get robbed."}, {"username": "Soc Cer", "comment_text": "This happened to my friend years ago....same situation 🙁 The only thing for her was they were going to stay with relatives, so were able to borrow clothes etc. So sad :("}, {"username": "Jim LaSarre", "comment_text": "Tatiana LaSarre"}, {"username": "Martin-John Rubio", "comment_text": "You said it-common sense"}, {"username": "Irene Oda", "comment_text": "That is sad. The last few years after arriving in Rome we have stopped on the ' autostrada' for a quick bathroom break and ice cream. Not had a problem. But a good reminder for safety. Maybe on the 'autostrada ' everyone else is traveling so we aren't an interesting target. Was this in a town somewhere or Rome itself?"}, {"username": "Lisa Lorentz", "comment_text": "Awful\nDid they have air tags?"}, {"username": "Ron-Denise Laycock", "comment_text": "Such a shame. Hopefully the Police investigate and make efforts to find them!"}, {"username": "Donna White", "comment_text": "How devastating."}, {"username": "Rachael Richardson", "comment_text": "How terrible for them. Tourists are a target they look at hire cars , we never left our car, when we went in service stations we took it in turns to use the facilities and locked the car when in it , we have done this all over the world on our travels , and our luggage in the boot !"}, {"username": "Karoline Bakker", "comment_text": "Thieves recognise rentalcars ! NEVER leave your car with luggage in it ! Not even for a moment. Sorry for your bad experience"}, {"username": "Sylvia Jenkins", "comment_text": "It shouldn’t have had to require common sense! You would have to be a complete low life to do something like this. Sorry this happened to you ☺️"}, {"username": "Diane L. Martin", "comment_text": "This almost happened to me in NYC. We parked our minivan in the middle of the afternoon on Amsterdam avenue in the 80’s. We went into a restaurant for lunch with three kids. I told my husband I need to check on the van. As I walked up to it three men were standing at the back, one with a baseball bat about to smash the rear window. Tons of people walking by. Luckily they ran off when I walked up to them."}, {"username": "Darcy Hinrichs", "comment_text": "When we visit Hawaii, they recommend not leaving *anything* in a rental car, not in the trunk, nowhere. I’ve also heard recommendations\nto leave the doors unlocked and to roll down windows to reduce the risk of stuff being broken. We rented a car through Turo while on Oahu. We parked alongside the street and we’re waiting for it to be picked up. We didn’t have anything in it but we wanted to make sure that nothing happened to it so we stayed near it and keep an eye on it. We saw two different people go up to the car with us standing right there. They checked car doors and were looking in the windows. We told them to move along, there wasn’t anything in the car to steal. They never even reacted to us. They didn’t care. But from our experiences in Hawaii, seeing lots of cars get broken into and vandalized, I don’t recommend ever leaving anything in a rental car without someone watching it. Sorry that this happened to your friends. I hope that they were able to replace necessary items and were able to salvage their vacation to some extent!"}, {"username": "Alessandro Iannelli", "comment_text": "This is very sad to read. Unfortunately, you can never let your guard down. When I travel, be it in my country or abroad, I always keep my belongings with me or in a safe place. Losing the luggage, besides being very unfortunate per se, immediately ruins that vacation you were looking forward to. Never ever let your guard down, because sadly this is the world we live in."}, {"username": "MaryLynn Capobianco", "comment_text": "Oh that’s terrible! Honestly I wouldn’t have wanted to cart all my luggage into a restaurant either. Wow. That’s just mind boggling."}, {"username": "Bobbie A. Lewis", "comment_text": "I hope they had travel insurance. 🙁"}, {"username": "Jen Alexitch Rachow", "comment_text": "Oh no. Wow. That is a terrible. Hope they can still enjoy their time. Things can be replaced but it still sucks when everything lost. Sending positive vibes for them."}, {"username": "Carol Taylor Tisdale", "comment_text": "Whoa."}, {"username": "Caroline Linton", "comment_text": "Janice Carbone 😳"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "You just cannot expect to rent a car in Italy with your luggage inside and tour the countryside while moving from place to place."}, {"username": "Carla Jane", "comment_text": "Darren Bonaccorso Tanya Wyllie Greg Wyllie"}, {"username": "Robyn Smuin", "comment_text": "This is a really good reminder, because a lot of people haven't experienced jet lag yet, and they don't know that relying on common sense doesn't always help if you're operating at half capacity.\n\nJet lag doesn't just make you \"tired\". I didn't feel tired at all, funny enough... I felt foggy! Like I had a laggy processor.\nJet lag seriously impairs your ability to mentally function. It can make it hard to string your thoughts together, to make good decisions, to process what's happening around you, to react to things, to regulate your emotions, to read, to navigate...\nit impacts everything, and each person seems to experience it a bit differently.\n\nSo with this in mind, it's a good idea to not try to schedule yourself to go on a daytrip, take a train, etc, until you've been in your destination for a day or two. We arrived at 9 AM, we didn't nap, we just toughed it out when we got there, and we went to bed at their bed time and got up at their wake up time. Took until about 1 pm the next day before that slow-mo weird fuzzy feeling was gone."}, {"username": "Kathryn Zurcher-Baglien", "comment_text": "Oh dear. Thanks for the heads up on that!"}, {"username": "Michele Naftal", "comment_text": "That’s too bad. It can happen on trains too. A friend got on and put her luggage in the area she needed to leave it in, when she went to get off it was gone. We were also traveling on a train and the man in front of us was pick pocketed. When we found out what happened we realized they were targeting us too. We just didn’t have anything easy for them to grab. Sending good vibes to your friends!"}, {"username": "Linda Brannon", "comment_text": "This has happened to several people I know!\nUnfortunately even local Italians know it’s a problem.\nSo awfully sorry!\nI truly hope you can still enjoy beautiful Italy 🇮🇹"}, {"username": "Dawn Falsinotti", "comment_text": "I know a couple this happened to also. And the luggage was in the trunk. The threat is real people."}, {"username": "Mindy Jo", "comment_text": "Things happen sadly. It's unfortunate people feel the need to steal for whatever the reason. You can only hope they needed it more than you did.\nOn our last trip to Ireland, my 72 year old Mom accidently left her purse (with all her identification passport DL , bank cards, and $1000 US cash) on a public bus from the airport into downtown Dublin. This occured on the day we arrived. I told her to kiss that ish goodbye. I was in the process of contacting the embassy to see how we were going to get her home, and what that process looked like. When we got a call from the bus station. Someone turned it in, all of it!!! I wish to see more of that in this world. I hope your friends can turn things around and have a wonderful trip despite a terrible start."}, {"username": "Alicia Cox", "comment_text": "So sad what the world is coming to 🤦🏻‍♀️"}, {"username": "Stuart Vogt", "comment_text": "Hatchbacks are almost all they rent these days. Thieves can see everything."}, {"username": "Amy De Leoń Hoyt", "comment_text": "Nisia Mclellan Yikes!"}, {"username": "Heather Corson", "comment_text": "I’ve heard this happening a lot."}, {"username": "Sarah Dobrzykowski", "comment_text": "That’s terrible! I’m so sorry for them. I left my luggage in my car without a thought. I’m glad I got lucky!!!"}, {"username": "Julie Falls", "comment_text": "That's so heartbreaking for your friends. What a horrible start to their holidays. I hope they are ok. I can't stand victim blaming. The only person at fault here is the thieves. Thank you for taking the time to share their story. We are only hiring a car to travel around the dolomites as want to see as much as possible in a short period of time. And we were going to leave our luggage in the car for a few hours on one of the days. Now we will not so thankyou. Where I live you can do this very comfortably. In fact we leave luggage and surfboards etc strapped to the roof of the car with no problem. And even though we won't be in a major city I'll now make sure not to leave our luggage in the car so thank you. To those of you who seem to seek some sort of validation though criticising others for their choices...how sad your world must be. And just to answer a few questions in case someone feels the need to ask, again...1. Public transport is limiting sometimes 2. Trunks -:yes they do have them but cars in Europe have small boots and 4 backpacks in our case, won't fit. 3. Less luggage..nope I'll take what I'm comfortable with thanks . I do hope your friends can go on to have a wonderful time xx"}, {"username": "Angela Symons", "comment_text": "I honestly never ever ever would have thought of this risk"}, {"username": "Lori Sammons", "comment_text": "Never happened to us fortunately. We’ve been to Italy 4x and always rented a car and leave luggage in the trunk while eating. I guess we’re lucky"}, {"username": "Margie Williams", "comment_text": "Awful!"}, {"username": "Janine Emma Lucas", "comment_text": "We were warned by Avis that this is a bigger problem than pickpocketing and other crimes on tourists. It’s why we didn’t rent"}, {"username": "Chris O'Brien", "comment_text": "Very sad that their luggage was stolen 🥲.\nWhy did they need to stop quickly and get a bite to eat when arriving in a new country ?\nItaly is hard to drive, navigate and park as a tourist.\nVery impulsive decision,alas you state your judgement might have been impaired ?\nWe travel often in Europe and never in our travels have we had the need to stop and get something to eat quickly with luggage 🧳 and valuables in the car upon arrival. Not even if we are picked up by a driver or friend.\nHope they possibly have travel insurance."}, {"username": "Eileen Rich Gombos", "comment_text": "I try to get a car with a back cover so this doesn’t happen. I had. Friend who was right in front of a police station. Not thinking he left his wallet on the dash. On person tapped o his window. On the other side another person went through the window an grabbed it."}, {"username": "Ricky Huff", "comment_text": "That’s what the trunk is for"}, {"username": "Sandra Shoffner", "comment_text": "Never leave anything in sight inside a car. Someone needs to stay with the car if making stops on way to hotel."}, {"username": "Christy Norland", "comment_text": "How awful"}, {"username": "Helen Fletcher", "comment_text": "That’s a shame"}, {"username": "Tari Lawson", "comment_text": "That's awful. Honestly, even if I were well rested, I wouldn't have expected that outcome."}, {"username": "Jessica Tobar", "comment_text": "Omg how awful!"}, {"username": "Annette Tamminga", "comment_text": "Yikes! I hope they had their cards and passports on their person."}, {"username": "Mike Ball", "comment_text": "We’ve never left the car unattended with luggage or bags on show, it’s an open invitation,\n\nReally sorry to hear this happened but when you are strangers in a different country you need to take extra care ."}, {"username": "Roberta Burke", "comment_text": "How sad! Where were they supposed to leave their luggage while eating? Dont blame the victim!"}, {"username": "Louis Des Forges", "comment_text": "Roberta Burke ideally take it with you or if its practically not possible keep it out of sight i.e. in the boot. If its just in the back seat you become an instant target."}, {"username": "Allison Claar", "comment_text": "What an awful way to start your vacation!!!!"}, {"username": "Louis Des Forges", "comment_text": "Very much doubt travel insurance would pay out either as you are supposed to keep any valuables out of sight."}, {"username": "Graham Sherlock", "comment_text": "Another great reason to use trains."}, {"username": "Terry Pisano", "comment_text": "What was wrong with the trunk?"}, {"username": "Lynne McInally", "comment_text": "We rented a car and they would not insur us for areas and warned us. Each place we booked was an inclosed parking spot. We had been warned at the rental place about it"}, {"username": "Linda Kuper Mortensen", "comment_text": "Linda Kuper Mortensen"}, {"username": "Paula Brink", "comment_text": "Awful to hear that but don’t ever leave your car parked with luggage in it- no matter where you are. This happens in my city too."}, {"username": "Maybelle Hubahib Galang", "comment_text": "I am so sorry to hear this, .:."}, {"username": "Phyllis Snyder", "comment_text": "Yes rental cars are targeted by thieves - they are professionals! They can also spot tired and confused people!"}, {"username": "Flo Ratta Fleming", "comment_text": "Lesson Learned never leave your possessions in your car whether Italy or NY, it happens in both places"}, {"username": "Harris Dee", "comment_text": "Don’t car still have trunks?"}, {"username": "Peggy Frain", "comment_text": "Car had no trunk?"}, {"username": "Shelley Howard", "comment_text": "Angel Gosling Jenny Carey .. see why I said we can't leave bags in the car at all ... just like being at home shady people ruining it for everyone .."}]}, {"id": "2197849097280835", "text": "Any info on seeing Napoli play soccer??", "link": "facebook.com/groups/1373361046396315/permalink/2197849097280835/", "likes": 2, "comments": [{"username": "David Dowd", "comment_text": "Napoli play football. 😊 the season starts August 12th, you may catch a pre-season friendly before. Look on the clubs website for availability, tickets are likely to be limited availability due to the fact that the club are Serie A champions and have a fanatical following so would expect to sell out all tickets in the new season. Good luck!"}]}, {"id": "2197853593947052", "text": "I am afraid to ask this because I can’t change my purchased tickets now but…\n\nWhen we bought tickets they were so pricey so my agent suggested Turkish Air who had good pricing for the time we wanted. Layover in Istanbul. She had another group in the future booked with them and wasn’t worried about their service. I have not seen anyone mention them. How concerned should I be?", "link": "facebook.com/groups/1373361046396315/permalink/2197853593947052/", "likes": 1, "comments": [{"username": "Jackie McDowell", "comment_text": "Look up Istanbul airport. If your layover is over a certain time you can get a free hotel or city tour."}, {"username": "Kristina Ruk", "comment_text": "And your concern is about what?as Turkish airlines is reliable company ;)"}, {"username": "Denise Edgar", "comment_text": "I have flown Turkish airlines from Singapore to uk . They were great"}, {"username": "Rhona OConnor", "comment_text": "If no one mentioned them...... Then no one had a problem!!!"}, {"username": "Colleen Dawson", "comment_text": "Have flown on Turkish Airlines to and from Istanbul, no problems , had a good experience."}, {"username": "Tiffany Lordi", "comment_text": "Fantastic airline!"}, {"username": "Gillian O'Callaghan", "comment_text": "I've flown with Turkish Air and they're fine....if that's what you're concerned about."}, {"username": "Yvonne Ormson", "comment_text": "Turkish air business class is fabulous and they have a great lounge in Istanbul airport."}]}, {"id": "2197844187281326", "text": "We have 9 days to spend in Italy during Easter 2024. We plan to go to Rome, Florence and Venice. Family of 4 with 2 teenagers. I know this isn’t a great week to go due to crowds but it’s our only option. Would you recommend 3 days in each city or 4 Rome, 3 Florence, 2 Venice? Any other recos for that time of year? Ty", "link": "facebook.com/groups/1373361046396315/permalink/2197844187281326/", "likes": 1, "comments": [{"username": "Meredith Williams", "comment_text": "we were there this year during easter and it was great! dont let ppl scare you! way better than how summer seems! 2 in vce is good"}, {"username": "Lisa Valdovinos", "comment_text": "Sounds good 👍"}]}, {"id": "2197829147282830", "text": "Hello, we will be in Livorno in April 24 on a cruise. We would love to do a tour to Cinque Terre for the day. Has anyone done this? Any recommendations for driver or tour company? Any information would be greatly appreciated!", "link": "facebook.com/groups/1373361046396315/permalink/2197829147282830/", "likes": 1, "comments": [{"username": "Denise Edgar", "comment_text": "Did you manage this . It’s the 1 thing I regret taking the cruise to Livorno . Ka sow is would have been easier . Let me know please and if so with who"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "We did this a few years ago. I joined a group for a private tour with our CruiseCritic roll call."}, {"username": "Patty Lane", "comment_text": "Thanks, we will probably do that also. Any recommendations\non tour company?"}]}, {"id": "2197834603948951", "text": "It’s scorching in Sicily!!! 🔥🔥", "link": "facebook.com/groups/1373361046396315/permalink/2197834603948951/", "likes": 31, "comments": [{"username": "Audrey Sof", "comment_text": "I’m sorry bout this:("}, {"username": "Mary Crawford", "comment_text": "Looks like Texas.....hello\nclimate change"}, {"username": "Ellie McCoy", "comment_text": "🥵"}, {"username": "Paula Bennett", "comment_text": "Oh wow!"}, {"username": "Cynthia Portogallo", "comment_text": "Lillian Giglia Maniscalco"}, {"username": "Jordan Messina", "comment_text": "Sam Messina hot hot summer"}, {"username": "Carmel Cavallo-Villiva", "comment_text": "Lisa Wilkie"}, {"username": "Shelley Phillips", "comment_text": "Yikes! That’s 🥵"}, {"username": "Rachel Paine", "comment_text": "Tania Costa"}, {"username": "Melissa Landriscina", "comment_text": "Bloody hell! 48deg is Simpson Desert in summer!"}, {"username": "Dawid Mroczek", "comment_text": "Been there ☝️🥳🥳🥳"}, {"username": "Aaron Kincaid", "comment_text": "Tailor Kincaid"}, {"username": "Ronald Clement", "comment_text": "Great place and love the food."}, {"username": "Ana Paulica", "comment_text": "Wow...it starts to become impossible to travel in Italy in July and August"}, {"username": "Helen Veronica", "comment_text": "Sam Scacco"}, {"username": "Louisa Trazzera", "comment_text": "Iris van Schoonhoven"}, {"username": "Allison Glover", "comment_text": "Cathy Windsor 😱😱\nEmily Windsor\nStevie Breanna"}, {"username": "Rebecca Millhouse", "comment_text": "Michelle Sloan Kendal Achurch-Ihle maybe not July …"}, {"username": "Ange Cimino", "comment_text": "Wow Catania is crazy"}, {"username": "Edīte Bērziņa", "comment_text": "Yesterday in Catania 🫠"}, {"username": "Mariella Elsano", "comment_text": "I am in Palermo at the moment and it's insane"}, {"username": "Rita Sanza", "comment_text": "It's hot!!!"}, {"username": "Sandra Süßenbach", "comment_text": "And we here in the west of germany have 19°C and rain, rain, rain...."}, {"username": "Angela Bertuna", "comment_text": "Marïsa Blaseotto"}, {"username": "Naomi CP", "comment_text": "Gaby Nad damnnn thank god you're not in Catania 😮"}, {"username": "Carlene Reader", "comment_text": "Rosa 😳 🥵"}, {"username": "Rita Kanten", "comment_text": "I lived there in the mid 80s and it never got this hot."}, {"username": "Mel Sargison", "comment_text": "Reets 😖"}, {"username": "Maryloubarry Templeton", "comment_text": "Steven Finocchiaro and Jess…stay in London 😛"}, {"username": "Pam Borchert Wildrick", "comment_text": "Pls translate to Fahrenheit"}, {"username": "Gina Stang", "comment_text": "Yikes! Hope it cools down by mid September"}, {"username": "Cristian Jimenez", "comment_text": "Karla Tenemos que ver bien las fechas para no asarnos 🤔"}, {"username": "Jade Illiano-Smith", "comment_text": "48 degrees! Omg! I live in Australia and thst is bloody hot!"}, {"username": "Pixie Skase", "comment_text": "Pris Cilla omg 😱"}, {"username": "Enzo Teutonico", "comment_text": "Miiiiiiiiiiiiii\niiiiinchia"}, {"username": "Lorraine Vitucci", "comment_text": "Giuseppe Raciti, 🥵🥵 stay cool."}, {"username": "Evy Fredy", "comment_text": "WoW!! So sorry for all the people living there and tourists without A/C!"}, {"username": "Evy Fredy", "comment_text": "Last year, the end of October in Naples it reached 80 degrés Fahrenheit !"}, {"username": "Evy Fredy", "comment_text": "Going mid October this year to Sicily"}, {"username": "Carole Tarlap", "comment_text": "This is Arizona USA"}]}, {"id": "2197837647281980", "text": "Any one suggest a good hotel close to the Santa Lucia train station in Venice? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2197837647281980/", "likes": 0, "comments": [{"username": "Yiota Mallas", "comment_text": "Hotel Principe - quick walk from the station and breakfast area on the Grand Canal but be warned, they have two wings, ask for a room in the newer wing for fully refurbished rooms"}, {"username": "Linda Chase", "comment_text": "Hotel Principe. Have stayed there 4 times and planning my fifth visit. Enjoy your visit to Venice!"}, {"username": "Billie Begley", "comment_text": "Hotel Olimpia. We have stayed there 4 times. Short walk. Close to Vaperatto Trains and buses."}, {"username": "James-Kathy Dickerson", "comment_text": "Thanks to everyone we booked hotel Principe!"}, {"username": "Dave Colleen", "comment_text": "Hotel Moresco. Breakfast included, a welcome drink, happy hour (food) , bathrobe and slippers and great staff and a bottle of Prosecco"}]}, {"id": "2197841110614967", "text": "Hi all!\nI’m planning on doing a good bit of vintage shopping while in Italy but only have 10kg of luggage 😭\nHas anyone sent a parcel from Italy back to the uk and can let me know what customs and prices etc are like?\nI’ve looked online but it’s just confusing me 😂\nTIA x", "link": "facebook.com/groups/1373361046396315/permalink/2197841110614967/", "likes": 1, "comments": [{"username": "Thuy Tdt", "comment_text": "I would book more luggage on your flight home instead of sending it to your home"}]}, {"id": "2197856123946799", "text": "What is your best suggestion to assist with jet lag? We are flying from Vancouver CAN. With a connection in London, the total flight time will be approx 14hrs. We've used a homeopathic remedy called No-Jet-Lag which seems to work well. I'm wondering what other options are out there that you've found successful.", "link": "facebook.com/groups/1373361046396315/permalink/2197856123946799/", "likes": 2, "comments": [{"username": "Krissy Marie", "comment_text": "https://\namzn.to/44BlnwM"}, {"username": "Tiffany Lordi", "comment_text": "We bought when we went to Greece last year from USA. It did NOTHING for the both of us.."}, {"username": "Reva Pai", "comment_text": "Melatonin gummy or tablets, 30 mins before you go to sleep. Or as prescribed on the box."}]}, {"id": "2197857097280035", "text": "Last minute cookies and truffles. I had space in my luggage.", "link": "facebook.com/groups/1373361046396315/permalink/2197857097280035/", "likes": 37, "comments": [{"username": "Theresa Wong", "comment_text": "Omg i bought these cookies too. So good. Enjoy"}, {"username": "Bev Symes", "comment_text": "yum"}, {"username": "Diana Radin", "comment_text": "So good"}, {"username": "Roxanne Tiefenbrun", "comment_text": "I bought these too! Amazing 🤩"}, {"username": "Anel Van Zyl", "comment_text": "Very yummy chocolates!!"}, {"username": "Evelyn Trager Jose", "comment_text": "Brought home their chocolates and limoncello - the best!"}, {"username": "Melissa Potenzo", "comment_text": "I’m down to my last box 😔"}, {"username": "Eric Maurer", "comment_text": "I ate so many free samples from them"}, {"username": "Tara Roed", "comment_text": "The best!"}, {"username": "Doriana Bileci", "comment_text": "Martina Agius 🩵"}, {"username": "Rhona Veisfeld Modugno", "comment_text": "The pistachio cookies are TO DIE FOR!!!"}, {"username": "Angie Hill", "comment_text": "Which store or market did you buy them??"}]}, {"id": "2197475223984889", "text": "Although we have a place booked, we’re still trying to find a hotel/rental for two nights in Rome that can accommodate my husband and I as well as our daughter, in something other than a cot or pull out sofa. Any recommendations for such a place, close to center?", "link": "facebook.com/groups/1373361046396315/permalink/2197475223984889/", "likes": 2, "comments": [{"username": "Connie Wilson", "comment_text": "Have you tried Booking.com? The room descriptions are spot on and tell you the bed situation."}]}, {"id": "2197865400612538", "text": "Apologize for anonymous, surprise trip\nwe will be going for 2 weeks-mix of beach and city. I’d like to pack in a carry on size backpack. I’m a hefty woman, so my clothes is not tiny. It should fit. but how did you deal with wrinkled clothes? Or any recommendations on packing to avoid major wrinkles?\nThank you so much", "link": "facebook.com/groups/1373361046396315/permalink/2197865400612538/", "likes": 7, "comments": [{"username": "Melisa Kish", "comment_text": "Rolling your clothes may help, and a travel size Downy wrinkle releaser!"}, {"username": "Dave Conroy", "comment_text": "Material with minimal creasing. An iron. Packing carefully by folding tight or rolling."}, {"username": "Sam Mah", "comment_text": "Hang clothes out the night before. If you have deep wrinkles get a cloth, wet it and squeeze it out, then run along the creases. Apparently if you put 1 teaspoon of clothes softener in a cup of water and put that in a spray bottle it will help with wrinkles when you spray this on clothes."}, {"username": "Carolyn Esposito", "comment_text": "Use packing cubes. The best thing ever. On Amazon"}, {"username": "Connie Wilson", "comment_text": "I bring a small plastic spray bottle for water. Works like a charm to remove wrinkles."}, {"username": "Lora de Vries", "comment_text": "Some hotels do have irons."}, {"username": "Laura Uribe", "comment_text": "Packing cubes and roll up rather than fold. Also Downey Wrinkle Release if you have room."}, {"username": "Maria LaPietra Guerrero", "comment_text": "Downey wrinkle remover and if you roll the clothes they wrinkle less"}, {"username": "Oksana Yarosh", "comment_text": "Have a fun surprise trip! Check your closet for polyester or other fabrics that don't wrinkle. Avoid linen, 100% cotton."}, {"username": "Molly Roberts Siegenthaler", "comment_text": "Downy Wrinkle release and a whole lot of “Who Cares” attitude. You are on vacation."}, {"username": "Renae Larcus", "comment_text": "I use gallon sized Ziploc bags instead of packing cubes. Roll the clothes"}, {"username": "Melissa McCormick", "comment_text": "Downy wrinkle release has a travel size we brought. It helped but wasn’t perfect"}, {"username": "DeAnna Pulliam Like", "comment_text": "I rolled my clothes and had all non-cotton material, except for one dress. I didn't have any wrinkle issues. I did carry on backpack only as well. I brought laundry sheets and washed and hung clothing to dry. For 2 weeks, I had 3 shorts, 3 shirts, and one dress. 🙂 Have fun!"}, {"username": "Candy Cooper Martin", "comment_text": "I always take a 3 oz bottle of Downy Wrinkle release spray. It is amazing and smells so fresh!"}, {"username": "Rachel Gray", "comment_text": "Don’t worry, it’s so hot that all of the humidity and body sweat will get the wrinkles out in no time."}, {"username": "Von Thatch", "comment_text": "Follow 'the folding lady' on Instagram. She is good with packing and folding ..."}, {"username": "Alicia Cox", "comment_text": "All great suggestions. Also, you can hang your clothes when you shower & the steam will help them fall out."}, {"username": "Dave Colleen", "comment_text": "I packed dresses. I wore cotton bike shorts underneath. Kept me cool, no wrinkles, and didn’t take up a lot of room"}, {"username": "Jen Larkin", "comment_text": "I’m using compression cubes atm for the first time. They’re fantastic. I’m a linen person and if you fold your clothes neatly the compression keeps them ‘ironed’."}, {"username": "Eric Parks", "comment_text": "Hang the clothes in the bathroom and run it like a super steamy sauna then shut off the water and leave the door closed. I leave them for a few hours then take them out before going to bed so they dry out. Only the most stubborn wrinkles remain."}, {"username": "Rosslyn Patience", "comment_text": "Hang things in the bathroom to help with the wrinkles (steam)"}, {"username": "Sandra Kingsley", "comment_text": "Roll clothes and take light silky fabrics!"}, {"username": "Rachael Richardson", "comment_text": "Roll them, most places have an iron and really no one cares what you look like in this heat and humidity , unless you going in top end hotels and restaurants ! Ive just spent 3 weeks looking a sweaty heap most of the time ! 😂🥵"}, {"username": "Stacey Esposito", "comment_text": "I rolled my clothes wrinkles were minimal even w lots of linen"}, {"username": "Patti Farrell", "comment_text": "Roll your clothes to pack them hang the in the shower if wrinkled"}]}, {"id": "2197864810612597", "text": "What would you recommend for carrying money, cards while walking?", "link": "facebook.com/groups/1373361046396315/permalink/2197864810612597/", "likes": 14, "comments": [{"username": "Enrico Lecce", "comment_text": "A little cash, more so Business credit cards they hold more secure protection...."}, {"username": "Lindsay Stewart", "comment_text": "Any body bag with a secure zip"}, {"username": "Cynthia Marie", "comment_text": "I use any crossbody bag I have in my closet. Nothing fancy"}, {"username": "Lynn Francisco Casella", "comment_text": "Front facing zippered Fanny pack with wire through the straps"}, {"username": "Enzo Teutonico", "comment_text": "Keep your passport in your room in a safe and outside carry cash, 1 card, and 1 state i.d. So if you get robbed they dont take everything. I would keep your stuff in your front pocket. Personally when i go to italy i walk around with cash in my sock .. but im hypervigilant."}, {"username": "Nancy Lewis", "comment_text": "I see people using Fanny packs as crossbody bags. Great shape to fit your body. Very in trend !"}, {"username": "Lina Stump", "comment_text": "Money belt a small one"}, {"username": "Claudia Gulli Rotondo", "comment_text": "Travelon bags. They have a large assortment for whatever your preference is."}, {"username": "Brian Osman", "comment_text": "I just put it in my pocket"}, {"username": "Sherri Leis Dillavou", "comment_text": "Sherri Leis Dillavou"}, {"username": "Don Mchugh", "comment_text": "Rottweiler"}, {"username": "Lisa Valdovinos", "comment_text": "Cross body bag"}, {"username": "Ellen Edmonds-Wilson", "comment_text": "A normal cross body bag is fine. Use Apple Pay - more secure."}, {"username": "Virgz Van Møøre", "comment_text": "Nath Marmotte"}, {"username": "Kerrie Hewitt", "comment_text": "Lulumelon bumbag, I used mine as across body, these have a back pocket for your passport. Best thing ever"}, {"username": "Susan Gulrajani", "comment_text": "carry it in your bra if you are that concerned"}, {"username": "Larry Trent", "comment_text": "Money belt.."}, {"username": "Anne Mc Namara", "comment_text": "I have a small purse that clips onto my jeans that I keep my cards in. Everything else I carry in a crossover bag"}, {"username": "Hermineh Topalian", "comment_text": "Money just Euro,Europe not accept American express"}, {"username": "Brice Blosser", "comment_text": "Gollum said, “What has it got in its pocketses?”\nWallet, money, and cards.\nFanny pack, backpack. Just be smart and mindful of where you are and people out of place or lurking around. The same as you should be doing here. It’s not that it’s some crime riddled third world country, just that you’re a foreigner. It’s very nice and I’ve not experienced an issue. I’m also very mindful surroundings."}, {"username": "Laura Uribe", "comment_text": "Cross body purse with multiple zippered areas always in front of me. My hand rests over the top at all times. Doesn’t come off at restaurants either. Better safe than sorry."}, {"username": "Nicole Condemi", "comment_text": "Our Italian host suggested (for men) pockets in cargo pants or front pockets. Bum bags (Danny packs wherever you’re from!) are more likely to be cut.\n\nI have a cross over bag. When I was in a busy area I had it in front of me with my hand over it"}, {"username": "Clint Madsen", "comment_text": "A bodyguard! 🙃"}, {"username": "Gillian O'Callaghan", "comment_text": "I have a small crossbody purse where I carry 1 of my bank cards and a bit of cash. In my daypack is card 2 and bit of cash plus hotel key, drink bottle etc."}, {"username": "Maria Ransom-Pavelic", "comment_text": "Travelon only !\nNeck or bra pouch.\nCross body bag"}, {"username": "Harris Dee", "comment_text": "Both"}, {"username": "Denise Hastie", "comment_text": "Travelon"}, {"username": "Sandra Keyser", "comment_text": "I kept mine in a zipped cross body bag. Never a problem."}, {"username": "Katherine Aube", "comment_text": "Cross body… what ever keeps it in front of you. Men, wallets in front pockets etc\nHands on all times or least let it ‘known ‘ by hand movements as well as eyes alert that they know you’re enjoying but on the lookout. Been a couple of times and have had zero issue."}, {"username": "Lorissa Gill", "comment_text": "A purse? Lol"}, {"username": "Meredith Williams", "comment_text": "i was happy w my crossbody purse!"}, {"username": "Anthony Sperduti", "comment_text": "Pockets"}, {"username": "Diane Bicknell Cooper", "comment_text": "Something close to your body and don’t take it off anywhere especially at a restaurant"}, {"username": "Tina Ferrari Cuva", "comment_text": "I used a crossbody bag that was big enough for a regular water bottle, phone, small wallet, etc. off of Amazon and it was perfect."}, {"username": "Rosangela Di Monaco", "comment_text": "Always beware of pickpockets. Bag and backpack placed in front of the body"}, {"username": "Kit Nader", "comment_text": "I sewed in a little zip open security pocket on the inside of my jacket...passpo\nrt size available online mine were amazon. Very secure."}, {"username": "Sandra Maldonado", "comment_text": "I carry them\nIn my crossbody bag. Some cash on the outside pocket, in case I want to buy something on the streets."}, {"username": "Jeannine Yells", "comment_text": "Travelcon bag from Amazon. Very secure for your passports"}, {"username": "Joanne-Peter Hart", "comment_text": "I am wearing a RFID pouch cross body underneath my shirt that holds my passport, and an extra pocket for money and credit cards. I have the strap long enough to tuck into my trousers above my right hip."}, {"username": "Joseph Strazzera", "comment_text": "Pockets"}, {"username": "Ali Everson", "comment_text": "So I used a small plastic bag. It lightens the load and I used small bulldog clips for notes and another one for my bus and train tickets."}, {"username": "Hollie Barcheck Juersivich", "comment_text": "Cross body"}, {"username": "Simon Kidney", "comment_text": "A suitcase..."}, {"username": "Ken Lerch", "comment_text": "Front picket of cargo pants."}, {"username": "Stevie Boombatz", "comment_text": "I used to carry a wallet and now I’m using my Dads old school money clip and it makes so much more sense now! Overseas I use a flat money belt"}, {"username": "D Rochelle Milton", "comment_text": "Crossbody bags (smaller end). I keep the front on chest, also I prefer the ones without hardware at strap ends, makes impossible to malfunction and drop without my knowing. But it’s just me - I’m paranoid like that. Here’s one of the ones I use 👇🏾\nP.S. I walk with my PP Card and keep my PP booklet in the safe."}, {"username": "Larry Dash", "comment_text": "I use Clothing Arts pick pocket proof shirts and pants. I also have two slim money wallets good for money and one credit card where one stays in the room safe and one stays in a secret pocket"}, {"username": "Phyllis Snyder", "comment_text": "Only in a ant thief cross body bag- or money belt under clothing."}, {"username": "Zoli Berecki", "comment_text": "Colt"}, {"username": "Renee Rundle Stoneham", "comment_text": "I have a small cross body wallet purse, it holds my phone, my cards, cash, a few small items lip balm etc… I can also squeeze my sunglasses in.😉"}, {"username": "Jerry Lyubelsky", "comment_text": "Good ol Fanny pack"}, {"username": "Shawn Galbraith", "comment_text": "Im old school.\nMoney belt.\nCards cash and passport inside clothes. Never have to think about it. Carefree travel."}, {"username": "Sandra Kingsley", "comment_text": "A slash free crossbody bag or a money bag you wear under your clothes that goes around your neck, or money bag that goes around your waist under your clothes"}]}, {"id": "2197852447280500", "text": "Le Colisée 🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2197852447280500/", "likes": 65, "comments": []}, {"id": "2197866997279045", "text": "Just booked flights to Milan! Has anybody been the QC Terme spa? Can you recommend this?", "link": "facebook.com/groups/1373361046396315/permalink/2197866997279045/", "likes": 0, "comments": []}, {"id": "2197868207278924", "text": "Hoping to get some suggestions on a week stay on the Amalfi Coast. We have never been to Italy and are planning a last minute trip for this September. We can only squeeze in a week, so we would like to fly into Rome and do 1-2 days there then the remainder of the trip somewhere on the Amalfi Coast. We’ve heard so many mixed reviews about staying inआणखी places like Positano, so we are torn! We have been solely looking at AirBnbs. Any and all suggestions are welcome, but ideally looking for must sees if 1-2 days in Rome and where to stay/ what to do on Amalfi Coast for 5-6 nights. Thank you!!! 🙏🏻", "link": "facebook.com/groups/1373361046396315/permalink/2197868207278924/", "likes": 21, "comments": [{"username": "Debbie Davidson Cvijanovich", "comment_text": "Best place in Rome…Parisii Luxury Relais. Lovely owner and stylish boutique inn with fabulous breakfast."}, {"username": "Rachel Gray", "comment_text": "Anacapri is your best bet. Super nice once all the day trippers leave the island. Not as busy as the other Amalfi coast towns"}, {"username": "Graham Sherlock", "comment_text": "Skip Amalfi coast it's a rat race, go to Tuscany and enjoy the italian beautiful way of life"}, {"username": "Susan Shaffar-Redding", "comment_text": "Sorrento! And be sure to take Carmen Mazzola’s cooking class! I’ve done it twice. Top-notch!"}, {"username": "Jerry Kiger", "comment_text": "Following …. Good info"}, {"username": "Anel Van Zyl", "comment_text": "We stayed in Ravello. Amazing view, quiet, beautiful! Minori, Maoiri very close. Walked beautiful pathdown to Atrani and Amalfi (3km), took a bus to Positano (17km) and a ferry back to Amalfi. You cannot go wrong. No matter where you stay will be awesome!"}, {"username": "Lucrezia Folger", "comment_text": "I'd do the opposite, 1 week in Rome and 2 nights in Positano. Yes, beautiful, however, Sept, is crazy busy with tourists in a small tight area and expensive."}, {"username": "Susan Roses", "comment_text": "I loved sorrento"}, {"username": "Joan Belserene Forcheski", "comment_text": "We just returned from Minori (cute town) we used it as our base to take ferries (short walk & no steps) to Positano(very crowded), Amalfi, & Sorrento. Ravello is beautiful, I would suggest a taxi or private driver. We stayed in a lovely hotel in Minori called: Hotel Villa Romana. Beautiful hotel w/fabulous bkfast. They offer lunch & dinner for an extra charge."}, {"username": "Starla Dawn", "comment_text": "SORRENTO 💜💜💜"}, {"username": "Phyllis Snyder", "comment_text": "Good luck finding accommodations so late that are reasonable. But search all sites- and when you do find one you like try booking straight with them and not a 3rd party site. Good luck."}, {"username": "Nicole Bublik", "comment_text": "When you’re in the Amalfi Coast, visit Minori and Maiori! They are right next to each other. The towns are small but absolutely amazing! If you go to Maiori, you MUST eat at Casa Mandina. The food is spectacular. If you can, choose the option for chefs table. Can’t recommend it enough!"}, {"username": "Bob Dook", "comment_text": "If you are particular about only staying on the Amalfi Coast, then forget Sorrento, as it is not on the Amalfi Coast. If it doesn't bother you, then consider staying there. Salerno is at the eastern end of the Amalfi coast and should be considered as an option if you are budget conscious and care not for packed numbers of tourists. A plus for Salerno is that it is on a hi-speed train line and you can access by direct train from Rome. Use buses, private driver or ferries to access rest of the coast. If you choose to stay in the centre of the coast, rather than Amalfi or Positano, consider a place somewhere smaller. I would choose to stay in a hotel, but each to his own. Have a good trip 👍🏻"}, {"username": "Steve Grossman", "comment_text": "We always stay in amalfi.\nIt's absolutely gorgeous and the ferry terminal and Bus terminal are right at the center of the town. So it's easy to get to capri, Positiano, Sorento, etc,from there."}, {"username": "Rachael Richardson", "comment_text": "I would stay sorrento and visit amalfi and positano - I thought there was very little to do in those places and found sorrento easily accessible to go to places like Pompeii / Vesuvius then the other way to positano, Capri, amalfi - I thought it was a fun, friendly place to stay and reasonable ! That’s my opinion"}, {"username": "Linda Love Vines", "comment_text": "Loved staying 7 nights in Positano! It’s only crowded if you are among the day trippers and hanging at the lower levels by the pier and public beach!"}, {"username": "Anna Buchan", "comment_text": "Stay in sorrento then your close to almafi and less busy."}, {"username": "Skye Birch", "comment_text": "deffo base camp at sorrento... you can get the ferry to most places. deffo add capri to your visit too"}, {"username": "Susan Bouchon", "comment_text": "Fly into Naples. Have a driver get you to Sorrento. Stay there then stay in Positano."}, {"username": "Stephanie K. Cox", "comment_text": "Following!"}, {"username": "Holly Davidson White", "comment_text": "We loved Positano! Went in May and not too crowded, which I believe will be the same in September. If you struggle with stairs, don’t stay in Positano. Otherwise I highly recommend this beautiful place. I did not think Amalfi was as beautiful as some have commented. Ravello is gorgeous and less crowded but I really think Positano in Sept will be lovely."}, {"username": "Virgz Van Møøre", "comment_text": "Stay in Sorrento, from there do day trips to Positano, Amalfi/Ravello (same day), Capri, Ischia/Procida (same day), Pompei, if you have more time don't miss Naples"}, {"username": "Lisa Hedenberg Nichols", "comment_text": "We had a great AirBnB in Maiori - steps from the beach, super close to bus stop and just a 15 min walk to ferry. We did a boat trip one day that had us spending about 1.5 hrs in Positano - it was a complete zoo. Loved seeing it from the water and wandering around for a bit but so glad we didn’t stay there!"}, {"username": "Roland Trego", "comment_text": "Two suggestions: 1) Make sure whatever place you choose does not have too many steps to walk up and down to get to. You don't want to have to take a shuttle to get to the water, either. 2) Stay in a town served by the ferry. Some of the smaller towns don't have ferry service, so you have to either taxi it or take the bus, both of which are a hassle."}, {"username": "Rhonda Bean Hendershot", "comment_text": "I prefer VRBO in italy. And Sorrento is an excellenr base location."}, {"username": "Ashley Cebulski", "comment_text": "Thank you all for the suggestions! This was very helpful!!!"}, {"username": "Linda April Cardile", "comment_text": "following"}, {"username": "Elizabeth Nasta", "comment_text": "We stayed in Positano in September and it was beautiful . The crowds are gone but it’s still beach weather"}, {"username": "Lindsay Stewart", "comment_text": "We just stayed in Maiori and LOVED it!!"}, {"username": "Jayne Dawson Meyer", "comment_text": "ANYWHERE in that region, you can't go wrong. Just wait & you'll understand.\nPure Paradiso"}, {"username": "Tiffany Hadfield Merrill", "comment_text": "Honestly…Sorren\nto was the best!❤️"}, {"username": "Julie Chadwick", "comment_text": "We did 3 days in Positano which we loved. 3 days in Sorrento and 3 in Capri. Capri was beautiful but sooo expensive if you want to shop. Next year I would still go to Positano but have a week in Amalfi and Ravello so we can see the places in between them."}, {"username": "Renae Larcus", "comment_text": "Base in Sorrento and see other towns from there!"}, {"username": "Sony Ucciferri", "comment_text": "Stay in sorrento and do day trips"}, {"username": "Janice Rea", "comment_text": "Stay in Sorrento as home base. Better prices. Great views. Lots to do. Great food. Great shopping. Can take ferry to Capri or driver to other spots on Amalfi."}, {"username": "Sarah Williams", "comment_text": "Lemon tour in amalfi was great. We also did the path of the gods which was amazing! Local bus from Amalfi to Bomerano. Walk over to Atrani from Amalfi to get away from the crowds and better value. We stayed at hotel Floridiana in Amalfi. We went to Positano and stayed one night. During the day it was much much too busy to enjoy. The evenings were quieter and beautiful."}]}, {"id": "2197873400611738", "text": "Can you please recommend a day tour from Rome that’s a must!", "link": "facebook.com/groups/1373361046396315/permalink/2197873400611738/", "likes": 16, "comments": [{"username": "Leonie Abbott", "comment_text": "Mini bus tour to the Amalfi coast and Pompeii . Leaving from Rome . Well worth going . It’s a full day tour. They may pick you up from your motel as well"}, {"username": "Sandra Maldonado", "comment_text": "Tivoli or Orvieto"}, {"username": "H Raymond Fasano", "comment_text": "Vatican"}, {"username": "Nancy Margaret", "comment_text": "Tuscany!"}, {"username": "Michelle Solak", "comment_text": "We did a day-long tour to Tuscany that was amazing!"}, {"username": "Arne Støen", "comment_text": "Train to Firence :)"}, {"username": "Mark Campbell", "comment_text": "Pompei….2-3 hrs by bus, leaves from around Coliseum"}, {"username": "Rachel Gray", "comment_text": "We went to a town called Bracciano. Highly recommend and only an hour from Rome!"}, {"username": "Melissa Feielin Hawkins", "comment_text": "In Rome my husband and I did the catacombs and underground cities of Rome started at 9am done by 12:30. Then we did a self guided Vatican, Sistine chapel and Saint peters basilica￼. (Bought early evening tickets 2 months in advance) Was a long day but worth it! Absolutely incredible"}, {"username": "Margorie Madrid", "comment_text": "We did sorrento and Pompeii really nice"}, {"username": "Roberta Gonzalez", "comment_text": "Tuscany"}, {"username": "Cindy Sguazzin", "comment_text": "Tivoli!!!"}, {"username": "Alex Dodge", "comment_text": "Rome top bike tour I have done it at least 7-8 times"}, {"username": "Shane McClain", "comment_text": "Collusium and Vatican. City wonder tours"}, {"username": "Shane McClain", "comment_text": "Or a day trip to Florence is amazing"}, {"username": "Anthony McClure", "comment_text": "Take a train to anywhere! Or drive to gran sasso national park."}, {"username": "Debora Lanza", "comment_text": "Pompeii!"}, {"username": "Theresa Simon Wallace", "comment_text": "Orvieto! You can take the train, it’s a beautiful little village!"}, {"username": "Jeff Gentner EA", "comment_text": "Check out Walks of Italy. Lots of wonderful tours."}, {"username": "Maureen Trzaska", "comment_text": "Pompeii"}, {"username": "Clara Guerra-Araiza", "comment_text": "In Rome in September And through the 22nd to the 29th￼"}, {"username": "Rachael Waugh", "comment_text": "Positano and Pompeii!!!"}, {"username": "Mariecris Beygel", "comment_text": "Rome in a Day Tour with Vatican, Colosseum & Historic Center through takewalks.com"}, {"username": "Billy Way", "comment_text": "Testaccio walking food and market tour through Devour Italy.."}, {"username": "Frank Hunt", "comment_text": "Catacombs"}, {"username": "Jono Roland", "comment_text": "Walking tour of the Vatican/\nSistine Chapel, St. Peter’s Basilica & Colosseum | Roman ruins. Long day but well worth it. Bring plenty of water!🤓🇮🇹"}, {"username": "Lisa Sie Mamola", "comment_text": "Vatican, the museum and one day to Florence by train…"}, {"username": "Alex Hicks", "comment_text": "Doing a day trip to Antinorinel\nChianti Classico"}, {"username": "Peach Panfili", "comment_text": "Tivoli and the Villa D’Este with Hadrians Villa on the way."}]}, {"id": "2197877357278009", "text": "Question pour les femmes ici 👇🏻\n\nVos sandales de marche dépose tes photos svp", "link": "facebook.com/groups/1373361046396315/permalink/2197877357278009/", "likes": 0, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2197941433938268", "text": "Hi! I'm taking a first trip to Italy this summer (flying into Milan): my flight lands at 10am, how much time should I allot for when buying a bus ticket and train ticket (bus from the airport to Central Station in Milan, train from Milan to Rome)? (Ie, should I give myself 1 hour or 3, taking the bus at 11 or 1?)", "link": "facebook.com/groups/1373361046396315/permalink/2197941433938268/", "likes": 0, "comments": [{"username": "Jenny Payne", "comment_text": "You will be lucky to get through customs in 1 hour? Why not wait and buy the bus ticket when you arrive at airport? then buy your train ticket at Milan train station when you arrive ? not worth the worry as remember Italians don’t hurry 🌻"}, {"username": "Rhona OConnor", "comment_text": "No need to buy it in advance.... There are lots of trains."}, {"username": "Eileen Steiniger", "comment_text": "If you buy there, validate! Ask where to do and be sure or risk getting a large fine."}, {"username": "Connie Wilson", "comment_text": "The Malpensa Express train to Milano Centrale train station runs every hour, as do the Frecce (fast trains) to Rome. This train must be reserved beforehand. I would certainly allow at least 3 hours from arrival to boarding the train to Rome."}]}, {"id": "2197933083939103", "text": "Hi guys! How much is it to ride from the airport to Rome’s city center? ID there a standard cab fair for this?", "link": "facebook.com/groups/1373361046396315/permalink/2197933083939103/", "likes": 0, "comments": [{"username": "Thuy Tdt", "comment_text": "Less than 15€ with the bus"}, {"username": "Shannon Marie", "comment_text": "$50 flat fee for cabs. We have done it multiple times."}, {"username": "Sara Beth", "comment_text": "50 Euro which is posted in all of the taxis."}, {"username": "Deborah Jones", "comment_text": "Does anyone know if I can take fl1 train instead of a taxi to my Airbnb? I’m staying by theater of Pompey"}, {"username": "Brice Blosser", "comment_text": "the Leonardo Express from FCO to the train terminal in Roma is about €15, maybe €14. It’s a 30 minute ride. Super easy to get to"}, {"username": "Roland Trego", "comment_text": "https://\nwww.rome.net/\ntaxi"}]}, {"id": "2197928393939572", "text": "Considering renting a Vespa/scooter in Naples to venture around and through Pompéi, Sorrento, Amalfi…\nHas anyone done this or recommend it?", "link": "facebook.com/groups/1373361046396315/permalink/2197928393939572/", "likes": 0, "comments": []}, {"id": "2197881140610964", "text": "I’m planning the tours I will take while in Rome in December. I am doing a day trip to Florence and see that there are several train options. Is there really a difference in the brand?", "link": "facebook.com/groups/1373361046396315/permalink/2197881140610964/", "likes": 0, "comments": []}, {"id": "2197916700607408", "text": "Milan to Varenna question\nIs it possible to get round trip (return) train tickets for a day trip at the station before leaving Milan? Or only online?\n\n-please like my post so it doesn’t get buried\n\nThanks in advance", "link": "facebook.com/groups/1373361046396315/permalink/2197916700607408/", "likes": 5, "comments": [{"username": "Connie Wilson", "comment_text": "Yes of course you can purchase them at the station. You can also purchase them online prior to departure (saves a wait in line)."}, {"username": "David Gawler", "comment_text": "Cyclone in Milan!"}]}, {"id": "2197902053942206", "text": "Hello, I am new to this group and planning our first ever trip to Italy. My mind is blown by the amount of information here. Loving everything I read. Love love this group", "link": "facebook.com/groups/1373361046396315/permalink/2197902053942206/", "likes": 13, "comments": [{"username": "Phyllis Snyder", "comment_text": "Phyllis Snyder"}, {"username": "Rita Barker", "comment_text": "Thank you , I’ll check it out"}, {"username": "Chris Vilsack", "comment_text": "Climate change is real. Most of Europe is on fire, lately. Use this summer as a plan for next summer. If you can travel in May or September, it'd be better"}, {"username": "John Sampson", "comment_text": "Haha yes..20 regions ..20 different places in one country..it really is amazing"}]}, {"id": "2197896563942755", "text": "Let's talk suitcases! (I know, riveting!)\n\nI will be travelling from Australia to Italy solo in August. Am also going to Greece, Scotland and England. It's a long trip so I definitely need to take a suitcase and I will try my best to pack light (but knowing me, I won't be able to help myself 😩). My question is, does anyone have recommendations forआणखी a great suitcase brand that can withstand the cobblestone streets in Europe for a month long trip? Especially if you are from Australia, please give me your recommendations. I won't be driving at all and nor will I have anyone to help me with my luggage, so not too heavy. Thank you. 🙏", "link": "facebook.com/groups/1373361046396315/permalink/2197896563942755/", "likes": 19, "comments": [{"username": "Mia Catalano", "comment_text": "Aussie here, we’ve got Nere suitcases and they have been great! So lightweight 😀"}, {"username": "Rachael Richards", "comment_text": "I would buy a Delsey - mine has now travelled for four years over 4 months a year. It has done at least a dozen trips to Europe - on cobble stones, ferries and trains."}, {"username": "Kim Hull", "comment_text": "I’m from Sydney & I bought an American Tourister Airconic 67cm for my 3 mth trip to Europe. So far I’ve done France, Switzerland & now in italy & the wheels have held up really well so far. It’s packed full & I haven’t had trouble carrying it up stairs (& I’m only 5ft, 50kg). Glad I purchased this case."}, {"username": "Pamela Jones", "comment_text": "Samsonite without a doubt. Hard case. We've been to Europe twice. First time started out with material bags , small wheels & zips. The wheels fell apart & looked square very quickly & material walking in the rain was useless. Bought Samsonite hard cases with no zips in Rome & they are still going strong - our kids use them. Silly us this time (kids using our Samsonites) so bought brand new fabric bag AGAIN 3 weeks in wheels fell apart & bag soaked in rain...so bought a Samsonite replacement. We're away for 5 months...2 months in bag is still like new. Trundling through old streets of England presently with NO issues!"}, {"username": "Isabel Ball", "comment_text": "July bags are the best! Lightest bag and best wheels, super durable. Would highly recommend 🙌"}, {"username": "Amelia Bonannella", "comment_text": "We went for the Kathmandu Hybrid Trolley 70lt for our trip. Best of both worlds, with wheels and a backpack in one.\nMany places you’re visiting won’t have escalators or lifts, so you must be able to carry your luggage (as well as hand luggage) without too much of an issue."}, {"username": "Ruth Aspinall", "comment_text": "Fellow Australian here. Could tell you were Australian from the first sentence, not sure why, maybe the humour!\n\nSimilar trip booked in Aug/September to England, Scotland, Paris and Italy.\nI also cannot travel light. Have waterproof hiking boots, fleece jumper and rain coat for Scotland.\nI'm planning on taking an antler suitcase as they are light in weight. Worth comparing the weights to Samsonite.\nThanks to the responses to your post. I may try for a medium suitcase instead of large now.\nEnjoy your holiday 🙂"}, {"username": "Neville Spargo", "comment_text": "we are on the final leg of our 74 day Europe trip and we have dragged our suitcases over some unbelievably rough cobble stone roads and paths and the wheels show no sign of any wear! Ours are American Tourister cases, think they are the 50 or 55cm model. To watch the wheels wiggle and jiggle along these roads is amazing , they took everything we threw at them! saw people with no name brand cases and the wheels are shot to pieces!"}, {"username": "Rya Garmay Christensen", "comment_text": "We have our 14-year old Samsonite. We are traveling to Asia from Denmark once a year and other countries within Europe 2-3 times a year. It have been thrown hundred of times. Tomorrow we are going to Italy again. One suitcase for clothes, and the other for wine and some other good things 🤣"}, {"username": "Sharon Gough", "comment_text": "American tourist from Myers has been great on several European holidays over the cobble stones"}, {"username": "Simone Blay", "comment_text": "Australian with a similar itinerary…Italy\n, England, Scotland & Ireland. Gone for 2 months (my daughter a month longer) and needing to pack for many climates, means it’s difficult to pack light. All 3 of us in my family had different luggage, I had a large American Tourister expandable suitcase (did not use the expander function on this trip), my daughter a large July suitcase and my partner a large Marmont duffel bag which can either be over the shoulder or backpack. My They all have their pros & cons…no perfect solution really. I think a suitcase is less physically strenuous then lugging a duffel or backpack. Both our suitcase brands have handled the cobblestones well. I have to say I’ve wheeled my daughters a few times and it is very nice to wheel! Bear in mind, the hard suitcase get knocked around a fair bit loading on/off planes. Maybe keep an eye out for any specials on any of the brands you are considering & if any go on sale with a great price then maybe that’s your deciding factor…that worked for me in reaching my final decision!"}, {"username": "Robyn Donnachy", "comment_text": "Deanne Carey read all the comment about the places people are going and what they take"}, {"username": "Leisa Davis", "comment_text": "Definitely July\nIt’s an Australian brand with a lifetime warranty."}, {"username": "Danielle Evans", "comment_text": "I am here now from Australia. My July suitcase has been amazing on the cobblestones! Has four wheels and is so good and lightweight. I severely overpacked (I am the worst packer) and as soon as I got here regretted it, so would HIGHLY recommend packing as light as you can ☺️"}, {"username": "Nancy Willson", "comment_text": "Following"}, {"username": "Lynda Miller", "comment_text": "My husband and I bought July suitcases. Lightweight and super robust wheels. Withstood all the cobblestones and flights of a five weeks trip to Italy from Australia. Can highly recommend."}, {"username": "Lynette Williams", "comment_text": "Hybrid backpack! Can be used as trolley bag or back pack. Straps zip away when not in use."}, {"username": "Jennifer Gadaleta", "comment_text": "Hi, my 4th trip coming up in 5 weeks time. From my first holiday large suitcase not only heavy but hardly wore most, and mainly stuck to tried an true. I now only travel with the basics mix and match a quarter what I use to pack. The luggage in the pic from strand bags has carry handles, wheels and very light weight. Enjoy your holiday and you can always buy."}, {"username": "Em Marie", "comment_text": "Definitely a hard suitcase (expandable) with 4 wheels so you can strap your personal item on top on the handles and wheel it around upright!"}, {"username": "Adrianna DP", "comment_text": "Away luggage is my permanent go to for luggage now!"}, {"username": "Tracy Houston", "comment_text": "A good sports bag with wheels easier in cars trains planes and when you open up less space and packs more !!!"}, {"username": "Susan Nielsen", "comment_text": "This one have been following med in 3-4 Holliday every year in 8 years, in such different places as Venice, The Faroe Island and Paris. https://\nwww.samsonite.dk\n/\ns-cure-spinner-6\n9cm-black/\n49307-1041.html"}, {"username": "Natalie de Gray", "comment_text": "Samsonite"}, {"username": "Pammela Milas", "comment_text": "I use American Tourist suitcases from Strandbags"}, {"username": "Maree Marchant", "comment_text": "Used Samsonite 4 wheeler several Europe trips over loads cobblestones is now 13 years old and just upgraded owes me zero. You get what you pay for some rooms not a lot of room to spread a suitcase out.\nIf you want great walking shoes check out Frankie 4 own numerous and have used one pair on 5 different trips worth the $$\nHave a fantastic trip you’ll make wonderful memories!"}, {"username": "Sharara Attai", "comment_text": "Thank you all so much for your recommendations\nand travel tips. Lots of options here. 🙏😊"}, {"username": "Beverly Toth", "comment_text": "I used the Rick Steves carry on. Not expensive. Has wheels and pull out backpack straps if needed!"}, {"username": "Michael Widjaja", "comment_text": "Did month long trip in Italy and both the carry on and big suitcase (trunk) are Rimowa salsa…they survived the cobbled street…."}, {"username": "Kylie Walsh", "comment_text": "After lots of research reading reviews etc l have swapped my hard shell case with swivel wheels for a large inline wheeled duffle from American tourist"}, {"username": "Nina Niner", "comment_text": "Fellow Australian here. I impulse purchased a medium hard case from Aldi last year when I was in a bit of a bind. Now 8 flights and 2.5 months in Europe so far (Greece, Georgia and Türkiye) currently in Siena and it has been tough on the cobblestones in Italy and on and off trains etc too."}, {"username": "Gina Gourlay-Blackberry", "comment_text": "Backpack all the way! Wheels don’t love cobblestones or stairs, and lifting a heavy case on/off trains and then stowing it for the journey can be tricky. Capsule wardrobe is definitely the key though."}, {"username": "Deeksha Rastogi", "comment_text": "Recently returned from a multi city trip to Europe though not Italy but my learning is to get a hard case expandable carry on with 350 deg swivel that way you don’t have to carry all on your body when you’re already tired and carry a backpack which is small enough that you can strap it in front if needed on crowded trains to avoid pick pocketing. In the end it all comes down to packing light. I lived off a carry on for 22 days just getting staples and just one spl outfit. Also pack for the best case rather than worst case that way you stop yourself from carrying for every scenario you can imagine which actually might not happen but just leaves you with luggage weight 😉 you can always buy things there if you need. I got a American tourister from Myers, coz it got hot bought a few cotton clothes and sandals (another lesson - always carry your best 2 shoes - runners and sandals the more supportive the better coz you’d be walking on uneven surfaces all day long) and bought another carry on from there for all the shopping that I did 🤪."}, {"username": "Rosanne Ziviani", "comment_text": "My husband (FIFO worker) has made 16 trips within Australia with a hard-case suitcase and the airlines have finally cracked it in two places last trip last week.\nIt was my (expensive) suitcase originally but after a trip to Sydney I didn’t like it because the hard-case ones take up too much space in your room - you have to open them fully to get to all your clothes/items. I found it such a pain. So on two trips to Italy (both 5 weeks of cobblestones and trains) I took a soft-case, fabric Delsey suitcase and I’ll be taking it on next o/s trip too.\nThe good thing about the cracked hard-case bag was that it’s wheels were mainly internal. I see all bags now have wheels that stick out so much. I think it wouldn’t take much to knock them off."}, {"username": "Lisa Eastick", "comment_text": "July Luggage the best wheels!"}, {"username": "Colleen Lee", "comment_text": "I travel a lot, with a medium, soft side, dual wheel Tosca case , traversed many cobblestones, (last 3 have been this brand). They have a flap on the bottom so you can slot your hand in and lift the case easily. Soft side is easy to retrieve off the luggage carousel because I can get a grip on it (5 feet tall). Force yourself to travel light, leave all the shoes and giant shampoos, body wash, ten lipsticks, nail varnish, 4 perfumes etc at home. I am a tour guide, Australia to Italy, 16kg is the heaviest I've ever taken, no carry on, only coat and handbag. Colour matching your wardrobe is the key to a light suitcase. Be ruthless, you will thank yourself for being so disciplined. Anything you need and lots more is available in Italy. Trust me. 😁 Happy travels."}, {"username": "Lyn Rowling", "comment_text": "F"}, {"username": "Miriam McNally", "comment_text": "I find Tripp great, have one about 7yrs now and drag it all over the place, it's still perfect, and so light!"}, {"username": "Kim Duggan", "comment_text": "I have a set of 3 Zoomlite suitcases. Have taken the middle sized one all over Europe, Asia & within Australia. They are the hard type with 4 wheels, & combination lock. I totally recommend as they have stood up brilliantly over the years and still going strong.\nThe only real issue has been some really small hotel rooms that don’t have enough space as they open out flat!\nHave a great trip… we are starting to plan for next year.. can’t wait 😊"}, {"username": "Angela Symons", "comment_text": "I’m using antler! Hoping for the best"}, {"username": "Diane Plott Miller", "comment_text": "Travelpro. My luggage still looked new after our last trip to Italy."}, {"username": "Alicia Cox", "comment_text": "I have a carry on travel pro (like a lot of the flight attendants use) with inline wheels (not the spinner wheels). These wheels don’t “stick out” & to me seem more durable esp with cobblestone. That said you have to pull it vs “walking” it like the spinner wheels. Pack light! And\nYOU GO GIRL! That takes guts for a trip like that by yourself!\nOhhhhh - purchase air tags just in case your carry on gets bumped to a checked as lost luggage has been a legit issues last year & this year with more people traveling post COVID. Hide it well & at least if it gets left behind, you can track it! It’s a game changer! HAVE FUN!"}, {"username": "Bethany Sargent", "comment_text": "I used to sell luggage. When you pay more for luggage, you are paying (or SHOULD be paying) for better wheels and better zippers --the two things that make your life easier when it comes to luggage. When you examine luggage, look for beefy wheels that have solid housing or are built smartly into the case. Brands like Burton or Timbuktu actually use the same wheels as skateboards and are indestructible.\nLook for wide, heavy zippers that won't snap under stress. Nylon construction is superior to polyester for longevity. Quality brands I have in rotation are Briggs & Riley, Eagle Creek, Burton and Sakroots. My next trip to Italy, I will attempt to \"one-bag\" it and bought a travel backpack off Amazon (no wheels! 😵‍💫) Good luck! 🎉🎉🎉"}, {"username": "Alicia Cox", "comment_text": "Also check Rick Steve’s website for suggestions on luggage & packing as he’s big on packing light."}, {"username": "Rachel Cielens", "comment_text": "Hello from a fellow Aussie. We used medium cases by Flylite from Strandbags. They tolerated the cobbles stones well. Carrying them up and down stairs was a challenge but as they were the medium size it was doable (I’m not fit or strong and my teenage kids managed theirs also). We were away for 6 weeks in total and they held up very well. I wouldn’t go bigger than a medium case as trains would be difficult. We took trains everywhere."}, {"username": "Tracy Afflick", "comment_text": "With the weather in Europe presently it shouldn't be an issue to pack light. If you need something warmer for evenings buy it there but I don't think you'll need to"}, {"username": "Vicki McDowell", "comment_text": "Fellow aussies here, heading off in four weeks for two months. We’ve purchased Kathmandu backpacks. They have wheels and zipped away straps. Best of both worlds. I got a 50l, my husband a 70l."}, {"username": "Ramon Cardona", "comment_text": "Monos ,love it\nIt's worth the price"}, {"username": "Jen Lewis", "comment_text": "Have a tracker in your luggage so you’ll know where it is if lost!!….\nwe did carry on for two months from Australia to Spain , Italy and England. So pleased we did, amazing what you don’t need! But May get sick of the same outfits…."}, {"username": "Patty Foster", "comment_text": "If you know your airlines, make sure it fits within the size limits."}, {"username": "Voula Ladas", "comment_text": "I’ve travelled in past with Samsonite soft cases to Italy and Greece . 4 wheeled ofcourse ,and have had no issues. Agree with others, that if you’re taking trains, it’s very difficult to lift them onto the train ,on the steep narrow steps . On a past trip in Italy, I had a large suitcase, and I struggled with the train travel . I was with a friend ,and we helped each other . My next trip though is solo ,and I have planned it that I will bring a Pacsafe (antitheft soft case carryon )backpack on plane , but also a new medium hard case Samsonite suitcase(checke\nd in) , as I will be away for just over a month . Inside the medium case, I have also stored a smaller carryon , also Samsonite . I have packed this way as I intend to take the backpack, and small carryon suitcase when I am travelling with trains through Italy ,and store the medium suitcase in storage . There is no way I will carry a medium suitcase on my own onto trains . Far too difficult as a solo traveller . Hope this helps . Enjoy your travels ."}, {"username": "Mel Tuzewski", "comment_text": "My brother recommended Samsonite four wheels … and he travels a lot, including Italy . We purchased off Amazon but they only had min stock on the day so we got the remaining ones from Qantas website just as cheap…"}, {"username": "Lisa Cottrell", "comment_text": "I have pondered and pondered about suitcases. I’ve paid big money for some and bought cheap ones. My eldest son lives in Europe so we’ve been quite a few times. I’ve found the expensive ones can often not be worth the money. I paid good money for a set of Desley cases, only to find after a flight a big dint on the corner of the bag, 🤦‍♀️which has ruined it. Then the handle came off . So now I get cheaper ones, and when they get too knocked about I retire them. Baggage handlers are not gentle with your bags regardless of brand."}, {"username": "Paige Montecalvo", "comment_text": "Obsessed with my Away larger carryon. I take it everywhere, most recently 33 days abroad in Europe. With that and compression packing cubes, the amount of stuff you can fit in it is shocking!"}, {"username": "Jenny Payne", "comment_text": "Samsonite are last 12 years travelling all over the world and the carry on one is good🌻"}, {"username": "Rosalinde Tullio", "comment_text": "Hey there! Fellow Aussie here, I have an Osprey Shuttle which I’ve used on lengthy solo trips to Europe and Japan since 2017 and I absolutely love it. It has two big wheels (sort of like on a market trolley) which makes light work of cobblestones and after years of heavy usage it’s still good as new"}, {"username": "Pat Hooper-Bruins", "comment_text": "Hi from Perth 👋 we had the same dilemma. We used High Sierra wheeled duffle, medium. I can’t recommend highly enough. The wheels are really strong - no trouble across the cobble stones. It has a side and top handle. It has three compartments and it’s expandable. I’ve not been a light traveller before now. We were away 7 weeks in the USA & Italy. I managed to keep luggage weight a light 17kilos. I used 3 travel bags for clothes which fitted perfectly and there was still space to add your purchases. I also recommend air tags to keep track of your luggage. Good luck with your travels and enjoy\n\nhttps://\nbagstogo.com.au/\nproducts/\nhigh-sierra-comp\nosite-v4-84cm-l\narge-rfid-wheel\ned-duffle-with-\nbackpack-straps\n-black-red?vari\nant=42991185101\n026"}, {"username": "Rachael Richardson", "comment_text": "Make sure you bring an umbrella and jumpers if you coming to the Uk 😂"}, {"username": "Sandra Kingsley", "comment_text": "We just go for the soft sports type bag with wheels and handles, roll our clothes and put into separate bags. Ziplock bags for any shampoos etc incase of leakage. The soft bags are lighter."}, {"username": "Debra Cooper", "comment_text": "My first trip on my own I took a roller back pack so I had options. It was awesome. Since then I've used hard cases with 4 excellent wheels and this has been good but a little trickier for steps etc. on my own. Just make sure you find the weight of the case as some can weigh up to 7kg on their own, which takes up your precious weight allocation."}, {"username": "Edmond Nolan", "comment_text": "Rimowa it’s expensive it worth every Penney"}, {"username": "Lisa Falzon Mayoh", "comment_text": "F"}, {"username": "Rhona OConnor", "comment_text": "I use a samsonite bag that stands a lot of punishment. Make sure you can lift your own bag!!! That's important getting onto trains and going up steps."}, {"username": "Lisa Olszewski", "comment_text": "I have a medium Flylite bag that I got at Strandbags in 2019 that I've used on 4 Europe trips since then including Austria, Germany, Italy, UK, Denmark (plus a few USA trips). The wheels are still great. It's soft-sided so the fabric is showing a bit of wear and tear but the zippers are all still perfectly fine."}, {"username": "Susan Tipsord", "comment_text": "F"}, {"username": "Paula Brink", "comment_text": "I have a 24 in Briggs and Riley that has stood up for quite a number of years now. I usually take taxis to and from airports and train stations so that minimizes the amount of dragging over cobblestones."}, {"username": "Ellen Edmonds-Wilson", "comment_text": "My July suitcase has been incredible over our month in Italy on uneven surfaces. Best wheels. First hard sided case and I’m a convert. I had the middle sized one and had room for purchases during the month. Australian made. They have stores in Sydney and Melbourne and you can order online. Also in funky colours which stand out on the carousel. I put stickers on mine for personality."}, {"username": "Mary Balistreri Swan", "comment_text": "I use the Kathmandu bags with wheels. They aren't huge bags but that I like them."}, {"username": "Grace Scinto", "comment_text": "Get a bag with wheels that can be wheeled sideways along or in front of you. Trains have limited space between seats to wheel your bag"}, {"username": "Phyllis Snyder", "comment_text": "Be sure the wheels are embedded! Cheap luggage have wheels that fall off."}, {"username": "Christy Purser", "comment_text": "Away hardside expandable - best suitcases ever!!!"}, {"username": "Kathy Flood", "comment_text": "Get one with double wheels!"}, {"username": "Nissa Nolan Foster", "comment_text": "Mine was from strandbags (their own brand I think) and my husband’s was American Tourister. They both performed great for 5 weeks in Italy."}, {"username": "Jan Brunswick", "comment_text": "Samsonite with 4 wheels… game changer! Our cases have been overseas quite a bit over 10 years and they’ve never let us down. ( and they’re still fine)\n4 wheels is the key!!"}, {"username": "Michelle Thorpe", "comment_text": "I’m taking a travelpro max lite expandable carryon. I have places I’m staying with no elevators. Just stairs. Plus trains. So I’m just doing a carryon plus a backpack. I’ll be there the entire month of November in various places. Planning my capsule wardrobe now."}, {"username": "Wilki KJ", "comment_text": "Remember and pack waterproof jacket for Scotland....we have rain lots of and it can just come on. Also not very warm compared to Italy and Greece so you might need a bit warmer clothing....and\nlook out for the midgies"}, {"username": "Karen Ann", "comment_text": "Samsonite own the budget American Tourister (think Qantas & Jetstar). Get 4 x 360 degree spinning wheels. They have a lifetime guarantee on the wheels."}]}, {"id": "2197891377276607", "text": "Hello everyone! I have been in Italy so many times but I never rented an AIRBNB. Can you please tell me your experience with since I am going in September and would like to rent it one of those in Venice, Florence and Lake como. Thank you so much in advance and enjoy the weekend. I’d appreciate any recommendations and suggestions.", "link": "facebook.com/groups/1373361046396315/permalink/2197891377276607/", "likes": 3, "comments": [{"username": "Monica Colontonio Macho", "comment_text": "We love using airbnb. Our hosts have been wonderful, we look for “super hosts” and we read the reviews. If you have questions normally you can reach out to the host and for the most part they are very quit to respond. But also be specific about what you are looking for for instance “ how many bedrooms and bathrooms, how many people need a bed, do you need a lift (elevator) many airbnbs have many steps and no lift. Air conditioning, remember air conditioning is not like the units in the States, make sure you have wifi if you need it and is it centrally located to where you want to be, do you need a full kitchen. So far we have not had a bad experience."}, {"username": "Michael Simon", "comment_text": "Go with a Superhost and make sure to check if there’s an elevator. I’ve made that mistake several times."}, {"username": "Greg Saba", "comment_text": "Pay attention to reviews for sure. But be prepared to have back-up plans. Hosts can cancel and come up with any excuse (plumbing broke etc.) and you have no recourse. We recently had a last second cancellation (also noticed prices had tripled and quadrupled what we paid); and airbnb takes no responsibility and provides virtually zero support. In fact, they were rude. This is not like a hotel that will find you something else."}, {"username": "Robin Burrell", "comment_text": "I’ve had good luck. Book with a Superhost if at all possible. They do tend to sell out more quickly though. Booking now for September is pretty limited"}, {"username": "Melissa McCormick", "comment_text": "We liked casa Angelina in Venice. It was close enough to everything walking distance but also right outside of the business! Highly recommend and she has hosted for a long time so everything was great!"}, {"username": "Gena Diaco Penland", "comment_text": "We just got back from 2weeks there. (Rome, Florence and venice) and stayed in airbnbs in all 3 places. We had amazing hosts and all of them were great!"}, {"username": "Laura Uribe", "comment_text": "We have used them twice and both were bad experiences. I believe people don’t review honesty because the owners review you and other owners can see it as well. Never using them again."}, {"username": "Karen Schmidt", "comment_text": "We’ve done it a bunch of times in Europe. Really read the reviews, don’t book one without any, and make sure it’s refundable. I’ve only had good experiences"}, {"username": "Sande Ricci", "comment_text": "We always use VRBO or Airbnb everywhere we vacation! We like the home feel rather than a hotel!"}, {"username": "Cynthia Marie", "comment_text": "I have rented a vacation rental for the Christmas season in rome, Florence and England for NYE week. I chose each one carefully by reading reviews . Booking . Com , VRBO and Airbnb are good choice’s to view many vacation rentals. A few years ago I rented a wonderful vacation rental off of trip advisor in Sorrento with a rooftop patio. Avoid Expedia."}, {"username": "Marilyn Wheeler", "comment_text": "We have rented in Italy many times. We have never been disappointed. Check references"}, {"username": "Joanne Wright", "comment_text": "Use super hosts and make sure they have more than 50 reviews! Also message them sporadically about anything (restaurants nearby, extra bedding etc) to see how quickly they respond. We have used Airbnbs exclusively and had very positive experiences"}, {"username": "Kristi N Doug Leonard", "comment_text": "In March, we stayed in fantastic Airbnbs. 1 week in Florence & 1 week in Rome. Our choosing Superhosts & reading reviews really paid off. Both places we chose were even better than the pictures! Have a great trip to beautiful Italy."}, {"username": "Sam Mah", "comment_text": "You might also try booking apartments via bookings dot com. We have and it's worked fine but I have read a lot of airbnb horror stories."}, {"username": "Sarah Stanford Bilder", "comment_text": "We get tired of the fees air b n b and Vrbo charges. The per night cost is great. Then you look at other costs at final billing. We often choose hotels or studio apts instead."}, {"username": "Renae Larcus", "comment_text": "We had wonderful Airbnbs in Venice, Siena and Sirmione. But as many have said you need to consider the additional charges after the basic rate."}, {"username": "Phyllis Snyder", "comment_text": "My trip to Italy in fall will be primarily arbnb stays- plus one or two hotels stays . Arbnb is best for my trip because I’ll be staying at least one or more weeks per town- and having a kitchen is more financially feasible- and I enjoy more authentic neighborhoods & accommodations.\nNow I have booked arbnb in other countries- all but one were was good . When researching different stays- try to book superior host, read all or most reviews especially the most recent ones, check to see how long the host has had the accommodation, where do they live- hopefully close by, send the hosts some questions about their accommodation- if they respond quickly and completely that’s a good sign, also ask if there’s any additional fees not mentioned in the cost- because some cities require a tourist tax in addition- and some stays & hotels do not advertise that and you are hit with additional costs when you check in or out!"}, {"username": "Jennifer Johnson Mayes", "comment_text": "I just used vrbos in Florence rome and Venice and it worked perfectly"}, {"username": "Cindy Giampietro", "comment_text": "Have euros available. Our rentals requested cash for some type of tax (ranged from $1.50 to $3.50 per night pp). They wanted that and cleaning fee in euros at checkin. The one time we rented a car for few days, owner wanted 10 euros per day for parking."}]}, {"id": "2197883173944094", "text": "Any recommendations on who to book with for a Trastevere Food Tour? There will be 4 adults and 4 children ranging from 16-6 yesrs", "link": "facebook.com/groups/1373361046396315/permalink/2197883173944094/", "likes": 0, "comments": []}, {"id": "2197264714005940", "text": "Helllo all. I just came back from 13 amazing days in Italy and wanted to provide some tips and insights that I learned while there. We did 4 days in Rome and then 7 days in Amalfi coast (our house we stayed at was actually Massa Lubrenese which is quieter, then did day trips). We were there the first two weeks of July and it was HOTTTT. Granted it was a heat wave affecting Spain and Europe, high 80s and high humidity percentage each day (60-75%) making it feel hotter.\n\nWe landed in Naples airport and took the train to Rome. We got the ground running, saw the Trevi fountain, Piazza Novana, & Pantheon. All three of those are super close to each other. And there are PLENTY of restaurants for lunch or dinner around that area.\nNext day was the Vatican tour. We chose the private tour our travel agent booked for us. We got there the second they opened to beat the heat. It was a 4 hour tour of the Vatican museum, Sistine Chapel, and St. Peter’s Basilica.\n* Few things here. Get water once you go through security and use the bathroom. They have vending machines with water right when you walk in. They’re no fountains here to fill up reusables.\n* It’s hot, no AC. Wear cool clothes. I wore a dress that was light weight material that covered my knees and brought a sweater to put over my shoulders for the Chapel and Basilica. My boyfriend wore light weight pants (have to cover knees) and a shirt sleeve button up, also lightweight material.\nAfter the tour, it was about 12:30 and we grabbed lunch at Bar Vitti in Piazza San Lorenzo in Lucina. It was soo soo yummy, they have gluten free options as well if that is a concern for you, (my bf is celiac)The Spanish steps are also over here along with high end shops like Louis Vuitton.\n\nNext day was The Colosseum, Rome Forum, & Palatine hill. Words cannot describe how beautiful this tour was. But also, words cannot describe how hot it was. There’s limited to no shade throughout this whole tour. There are fountains where you can fill up your water bottles which was nice. But if you can go as early as possible, because by the time we got out around 11:30 or 12, the heat and sun was almost unbearable.\n\nOur last day in Rome we saved for shopping and casually roaming the streets with no set time schedule. I did schedule an appointment to go into the Louis Vuitton store because there was some thing I wanted to buy, I do recommend scheduling an appointment if you are interested in doing that.\n\nWe left for Amalfi by train from Rome to Napoli Centrale, it was an hour train ride non stop. So easy, makes penn station look mediocre if you’re from New York, or New Jersey, you know what I mean.\n\nOur house was in Massa Lubrenese, which was about an hour and a half from Naples.\nIt was supposed to be 30 mins from Sorrento and 60 mins from Positano. But traffic during July and august are HORRIFIC. Taxis are suspended so you have to rely on private car services or public transport.\n\nFirst day we chartered a private yacht that took us around the island of Capri. We also did the blue grotto tour, HIGHLY RECOMMEND.\n\nDay 2 tour of Pompeii, highly recommend also VERY VERY hot.\n\nDay 3 we got on the ferry from Positano, and toured Ischia. Could’ve skipped this day but it was beautiful.\n\nDay 4 Sorrento. Perfect for shopping, we ate at Donna Sofia, which was sooo good. The whole restaurant is an ode to Sofia Loren.\n\nDay 5 Positano, Pupetto Beach club on Fornilo Beach. AMAZING. 60 euro per person, we had to lounge chairs and an umbrella. You get a waiter to bring you food and take orders. The food itself was pretty reasonable. We had a total of four alcoholic drinks, two bottles of water to lunch, entrées and french fries and it came to €150.\n\nHope this helps! Feel free to ask me any questions. In the comments you can tag me I may have missed some things. My brain is still on European time so I’m still trying to adjust.", "link": "facebook.com/groups/1373361046396315/permalink/2197264714005940/", "likes": 628, "comments": [{"username": "Terri March", "comment_text": "I’m confused by your comment that you flew in to Naples and then took a taxi to Rome that only took 10 minutes. How was that possible?"}, {"username": "Stewart Ramsay", "comment_text": "Did you do blue grotto"}, {"username": "Robyn Lawson", "comment_text": "Your write up brought back so many memories of past trips to Italy.Sounds just wonderful . We will be back in September and can hardly wait😊😊"}, {"username": "Kerry Aldred", "comment_text": "Matthew Hatch"}, {"username": "Julie Donovan", "comment_text": "What was the private tour company you used for your Vatican tour? I am going to Rome in October."}, {"username": "Ruth Keindl", "comment_text": "Thank you for sharing!"}, {"username": "Toni A Cargola", "comment_text": "Just got back from Italy. It was all so beautiful and hot. Lot of walking."}, {"username": "Jenny Allen", "comment_text": "Thank you for sharing!!!"}, {"username": "Thuthuka Lerato Kumalo", "comment_text": "Did you pre-book the beach club or arrived on the day and receive a spot?"}, {"username": "Sue Rich Hale", "comment_text": "What private boat did you charter to Capri?"}, {"username": "Felicia Guerrero-Mercado", "comment_text": "Es Jonaa"}, {"username": "Sherri OConnor", "comment_text": "Hello and thank you for sharing. I leave in about 6 weeks. I would like to know adapter you used for electric, just want to make sure I get the right one.\nThank you"}, {"username": "Karen Shaw", "comment_text": "Thanks for sharing! Sounds like an amazing trip."}, {"username": "Bianca D'Amore", "comment_text": "Ok, I get it. I made a mistake, no need to CONSTANTLY point it out"}, {"username": "Kendell M Brandstetter", "comment_text": "Great post Bianca! What private group did you use for Capri? We have booked tentatively thru company with not so great reviews so skeptical- we are in Venice and travel to Sorento Mon with 2 teens- would the beach you mention be fun for them?? Any recommendations\nappreciated! We do have a private early tour of Pompeii- thanks!!"}, {"username": "Katrina Koger", "comment_text": "Thanks sooo much for this! So helpful! Questions:\n1) it only took an hour train ride from rome to amalfi?? I thought it was like 2.5 with changing trains? I need to find your train if it was only an hour!\n2) We’re trying to decide between ischia and capri.\nThanks for the gluten free rec!!"}, {"username": "Lulu La Belle", "comment_text": "Matthew Carter"}, {"username": "Jiahui Song", "comment_text": "Great summaries. Thanks for the info! We will be there in two days!"}, {"username": "Liz van Meurs", "comment_text": "Thank you so much, fabulous advise. I think i just might copy your itinerary. I was wondering about booking some tours and I think for the Vatican City its a must. Its just an hour from Rome isn’t it?"}, {"username": "Dee Garant", "comment_text": "What company did you rent the yacht from and how much plz"}, {"username": "Kaci Blair", "comment_text": "Following"}, {"username": "Debi Sicurella Krulisky", "comment_text": "Beautiful! Did you have to wait to get in the blue grotto??"}, {"username": "Juliana Smith", "comment_text": "Robert Bruce"}, {"username": "Heather Gianoli-Hinkley", "comment_text": "Thank you for sharing!!! In the Vatican and other churches in Italy, can you wear sandals?"}, {"username": "Laura Fox", "comment_text": "Jennifer Johnson"}, {"username": "Jean Carlos Martinez", "comment_text": "Bianca Nahir"}, {"username": "Kim Grace", "comment_text": "So helpful 🥰👍🏻"}, {"username": "Helen McCarthy Yerger", "comment_text": "We are going to Italy next year with another couple so I am saving your post. As I get closer can I pm you?"}, {"username": "Joyce Plett-Vogan", "comment_text": "Thank you for sharing this!"}, {"username": "Shannon Goff Flanagan", "comment_text": "Who did you use for the private boat charter?"}, {"username": "Adriana Anaya", "comment_text": "Los tours los compras ya estando en Sorrento o los compras con anticipación por internet?"}, {"username": "Martha Lovett", "comment_text": "What traveling service you used?"}, {"username": "Marianne Langa", "comment_text": "What a wonderful trip. So happy that so many enjoy Italy. So proud to be Italian. Living in Australia.."}, {"username": "Alice Bush Kachejian", "comment_text": "Thanks for the information. It is very helpful!"}, {"username": "Kim Marie", "comment_text": "Dee Marie"}, {"username": "Julie St John", "comment_text": "Cheryl Oedy this is what I want to do!"}, {"username": "Robyn Lynch", "comment_text": "Jane Maree"}, {"username": "Sheila Johnston", "comment_text": "Leslie Eddy"}, {"username": "Natalie Godley", "comment_text": "Can I please ask roughly how much your 13 day trip cost and how many people?\nSounds amazing and I appreciate you sharing ❤️"}, {"username": "David Haoust", "comment_text": "Nardia Barbour"}, {"username": "Drew Blackwell", "comment_text": "Maria Zannis"}, {"username": "Kathy D. Mendenhall", "comment_text": "Thanks for all the great info!!"}, {"username": "Paul Cav", "comment_text": "Anna Cavallin"}, {"username": "Michelle Evans", "comment_text": "Hi Bianca great review and pics. We are spending 3 weeks in Italy in September, Rome and then a week in Amalfi Coast. Can you please tell me who you used for your private chartered yacht as we would love to do that.\nThank you 😊"}, {"username": "Jo Kolbusz", "comment_text": "What company did you book your tours through?"}, {"username": "Carla Gheller", "comment_text": "Amazing! Thank you"}, {"username": "Kathy Clements Barker", "comment_text": "From whom did you hire the private yacht that took you around the island of Capri?"}, {"username": "Donna Romano", "comment_text": "Please provide the tour info and the hotels you stayed at"}, {"username": "Sandra Monacelli McNall", "comment_text": "Meredith Bradley"}, {"username": "Nicole Millar", "comment_text": "How did you like Massa Lubrense?! We are going to stay there next year!! Cc: Marlene Kaiser-Domingue\nz"}, {"username": "Debbie Plante", "comment_text": "Just curious, why could you have skipped Ischia? I’m going in October and we’ve scheduled a day there."}, {"username": "Kelly Ross", "comment_text": "Absolutely amazing"}, {"username": "Soc Cer", "comment_text": "Which company did you do your day tours with in Amalfi? Also...which taxi service did you use to get to Rome? TIA :)"}, {"username": "Lynda Crouch", "comment_text": "Did you buy a bag if so did you get vat back on it please"}, {"username": "Wendy Valdes", "comment_text": "Great tips! 👍🏼"}, {"username": "Larry Valenti", "comment_text": "How do you land in naples and take a 10 minute taxi to Rome?"}, {"username": "Debbie Jones Schilling", "comment_text": "Can you swim in the Blue Grotto or you go in by boat. Was this included on the private charter?"}, {"username": "Jenny Meffert", "comment_text": "Great post. Thank you."}, {"username": "Sarah Down", "comment_text": "Thank you, all these tips are so helpful 🙂"}, {"username": "Kenza Woods", "comment_text": "Thank you for sharing!!! Great tips. Bianca D'Amore can you share the name of your travel agent?"}, {"username": "Ginny Schena", "comment_text": "Great review, very much appreciated:-)"}, {"username": "Jennifer Schmidt", "comment_text": "Can you send some information on the house?"}, {"username": "Elizabeth Florio Campanella", "comment_text": "Thank you for sharing!"}, {"username": "Elizabeth Florio Campanella", "comment_text": "Can you let me know what travel agent you used? I am overwhelmed trying to plan for next September. Rome and almalfi are on our list. ￼I am also celiac was it hard for your bf to eat?"}, {"username": "Marsha Wood", "comment_text": "Taxis “suspended “? We are planning on using a few during our stay in Priano. Can you share name of car service you used? Maybe I should book that ahead…we’re not going till early Sept"}, {"username": "Imran Khan", "comment_text": "Hotel staying cost ? I need to travel next month so I need to know about 4 night costing about this area . Thanks for sharing your experience."}, {"username": "Ruth Akutu Maccarthy", "comment_text": "Ruth Akutu Maccarthy"}, {"username": "Lisa Murphy Battaglia", "comment_text": "How do you make an appointment for the LV store?"}, {"username": "Katie Taraska", "comment_text": "How far in advance did you need to book your appt at Louis Vuitton? Was there a big line if people didn’t have set appts? Thank you!!"}, {"username": "LeAnn Bonkiewicz", "comment_text": "Did you make a reservation at the beach club? I have been wondering if I should make time to go to one while in Positano."}, {"username": "Leslie BC", "comment_text": "I'm from NJ and know what you mean by your Penn Station reference. Lol\nMay I ask why you flew into Naples airport instead of Rome?"}, {"username": "Madelyn Romano Ballesteros", "comment_text": "Looks fabulous. What tour company did you use for blue grotto?"}, {"username": "Kym Fabris", "comment_text": "Anna Fabris Michelle To"}, {"username": "Frank Knights", "comment_text": "Very similar trip in May. It was chilly. Enjoyed the town of Massa Lubrense where we stayed at a villa for a week - wonderful! Thanks for sharing"}, {"username": "Paul Latts", "comment_text": "Stephanie Kristen"}, {"username": "Linda Dalelio Williams", "comment_text": "Great info"}, {"username": "Rita Sanza", "comment_text": "I'm glad you enjoyed it"}, {"username": "Rosie Hetzel Piontek", "comment_text": "Who did you use for yacht tour of capri and blue grotto please? Thanks! Any links would be greatly appreciated!"}, {"username": "Julie Carnevale-Fraher", "comment_text": "Your itinerary is very close to what I’m setting up, but you said you land in Naples and it was only a 10 minute drive to your hotel in Rome? Is that correct? And where in Rome did you stay?"}, {"username": "Celeste Marflak", "comment_text": "Thanks for sharing"}, {"username": "Carmela Tortora Coppola", "comment_text": "Did they do stops for the Capri tour?"}, {"username": "Jacinta Maddalena", "comment_text": "Thank you for sharing!!! Interested in the blue grotto experience. What was the name of the company that you used to book the yacht with please?"}, {"username": "Su Hii", "comment_text": "Thx Bianca! Can you bring water through security at Vatican?"}, {"username": "Amanda Foster", "comment_text": "This is great!!!! Thanks for the tips"}, {"username": "Susan Claire", "comment_text": "Bianca D'Amore did you do a lot of walking on Amalfi coast/Positano?"}, {"username": "Debbi Mayfield", "comment_text": "May I ask who you took your yacht tour through and the cost for total adult on board?"}, {"username": "Kellie McKinley Fochtman", "comment_text": "Hi. Just wondering what time of the day you got into the Blue Grotto?"}, {"username": "Rika Greyling", "comment_text": "Sounds amazing! May I ask how much you paid for the private Vatican tour?"}, {"username": "Julie Alfonzo", "comment_text": "Great holiday. We did very similar in 2019. Yes the heat is always like this time of year but good you did things early. Thankyou for sharing your tips and tours. I want to go again."}, {"username": "Suzy Coler", "comment_text": "Yep…summer is high/hot season…we were in Amalfi in early May with lots of rain. I have such wonderful memories from all over Italy/\nSicily from quite a few years ago; sorry to say it is now overrun with way too many tourists. Now, I will only do a cruise with a port, but no more land stays there. I am glad you braved the heat and enjoyed. We were gone for over a month with a cruise in the Adriatic first…excellent, then Italy."}, {"username": "Melissa Cortez", "comment_text": "Why could’ve skipped Ischia? Looks amazing and less crowded."}, {"username": "Michele David", "comment_text": "Could you repost your previous travels in Italy thank you"}, {"username": "Julie Henderson Dandliker", "comment_text": "We just left Italy…it got even hotter."}, {"username": "Liane Weighill", "comment_text": "Thank you for this great information!"}, {"username": "Jerry Kiger", "comment_text": "That amazing … did a lot but 2 weeks seems like good amount of time. Wondering if you would share … how did you schedule hotels (online?), inside Italy travel place to place (online prior or hotels assist once arrive), how get houses vs hotels? You might have had travel agent? Thanks for the details and pics … looked like lot of fun"}, {"username": "Carol Pringle", "comment_text": "What tour did you use for blue grotto?"}, {"username": "Terry Lee", "comment_text": "Thank you for sharing!!! May I ask name of private tour and any info for Vatican?"}, {"username": "Susan Palmer", "comment_text": "🤔Naples to Rome is way longer than 10 minutes by car. I’m confused."}, {"username": "Erin Lynch Montellione", "comment_text": "Thank you so much!! Great information. Glad you enjoyed your trip."}, {"username": "Elle O'Driscoll", "comment_text": "How much was the yacht? Did it drop you off in Capri and then bring you back to Amalfi? X"}, {"username": "Bianca D'Amore", "comment_text": "Sorry about the confusion about the 10 minute drive I just edited the post above"}, {"username": "Sonia Scotto Lubrano", "comment_text": "Im really shocked out of all that you said to skip ischia. It’s one of my faves 😍😍 thought renting a boat is the way to go bc the sea there is totally beautiful with their natural hot springs. Personally I think it puts capri to shame 😅\n\nBut overall sounds like an awesome trip!"}, {"username": "Tommo Thomson", "comment_text": "10mins from to Rome wow though our rain was fast lol 300kmpr and still\nTook over and hour"}, {"username": "Colleen Dawson", "comment_text": "If you landed in Naples airport, I am almost certain the drive to your Rome hotel was more than 10 mins."}, {"username": "Bianca D'Amore", "comment_text": "Colleen Dawson I edited it"}, {"username": "Kelly Mendham", "comment_text": "Rick Anderson"}, {"username": "Caroline Piliere", "comment_text": "Is the Blue Grotto Tour in Capri or Rome?"}, {"username": "Hilary Bullard Locklear", "comment_text": "If you are not interested in a tour guide for the Colosseum/\nVatican areas, could you do those in one day. We are going in September"}, {"username": "Kathy Menke", "comment_text": "Bianca D'Amore Sounds amazing!!! Why did you fly into Naples instead of Rome? Would you recommend your travel agent? If so, would you share the agent, please? Also, would you recommend & share your lodging information?"}, {"username": "Tracey Shelton", "comment_text": "Info on the private yacht company please? Thanks."}, {"username": "Mary Moyer", "comment_text": "Thank you for the gluten free recommendations\n- I am going soon and looking for restaurants suggestion re: gluten free."}, {"username": "Consuelo Lowe", "comment_text": "Who did you use for the Pompei tour? We'll be going from Rome to Naples and Pompeii for the day"}, {"username": "Maria Al", "comment_text": "Can we bring our own water into the Vatican?"}, {"username": "Lorrie Sabatelli-Harris", "comment_text": "Lorrie Sabatelli-Harris"}]}, {"id": "2197914007274344", "text": "We are planning a one day trip to Rome from Florence and is wondering if anyone could recommend which train we should take?", "link": "facebook.com/groups/1373361046396315/permalink/2197914007274344/", "likes": 0, "comments": [{"username": "Suzanne Patrick Bielawski Mackowiak", "comment_text": "Following"}, {"username": "Connie Wilson", "comment_text": "The Frecce (fast) trains are 1.5 hours and depart about every half hour from Roma Termini Station to Firenze Santa Maria Novella. Buy tickets and choose your seats from TrenItalia site.\nAll info about trains and fares is on this site too."}, {"username": "Miyuki Kanno Paul", "comment_text": "Frecciarossa from Trenitalia\nor\nItalo"}]}, {"id": "2197917223940689", "text": "Hi everyone!!\n\nDoes anyone have any recommendations of restaurants, beaches, activities to do in Cagliari?\n\nWe are so excited to be heading for a week next week, so would love some tips of what to do and where to go!\n\nThanks so much 😊", "link": "facebook.com/groups/1373361046396315/permalink/2197917223940689/", "likes": 1, "comments": []}, {"id": "2197918773940534", "text": "Can anyone answer questions about parking for Grand Prix/formula 1 in September? Trying to manipulate web site without much success.", "link": "facebook.com/groups/1373361046396315/permalink/2197918773940534/", "likes": 0, "comments": []}, {"id": "2197919180607160", "text": "Hi, has anyone that flew on ITA recently know the different Wi-Fi upgrade options?", "link": "facebook.com/groups/1373361046396315/permalink/2197919180607160/", "likes": 0, "comments": []}, {"id": "2197921163940295", "text": "Anyone got recommend a restaurant in Venice which not touristy with great food but not expensive either? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2197921163940295/", "likes": 0, "comments": []}, {"id": "2196778607387884", "text": "Edit: Thank you all so much for your kind words and wonderful suggestions! I am reading each comment, even if I don’t get a chance to respond💕\n\nEdit 2: We have decided to stay on the Amalfi Coast for a few moreआणखी days after the wedding before heading off to Sicily!\n\nI am getting married in Italy next year and am SO excited! Wedding will be in Sorrento & we will take the week leading up to check out some places on the Amalfi Coast.\n\nBUT I am looking for honeymoon suggestions from you lovely folks! We are leaning towards Sicily, but I would love to hear some other suggestions for great honeymoon spots and why you think they’re great. Thank you 🇮🇹\n\nPs wedding is late September 2024 so honeymoon would be end of September/beginning of October.", "link": "facebook.com/groups/1373361046396315/permalink/2196778607387884/", "likes": 203, "comments": [{"username": "Rodney Spiteri", "comment_text": "Como is a beautiful place"}, {"username": "Meg Collings", "comment_text": "We have just honeymooned in Positano…it was very hot in July but the locals told us October is the best time to visit as it’s a bit quieter and cooler. We stayed at Villa Rosa - it’s right in the heart of Positano with stunning views from the balcony where they bring you breakfast every morning! X"}, {"username": "Paolina Lamb", "comment_text": "Auguri!!!!!"}, {"username": "Rosangela Di Monaco", "comment_text": "Auguri!!!! fine dell'estate. Prova a cercare quest'anno 2023 per il tempo in alcuni luoghi. Quindi puoi decidere qual è il posto migliore in questo periodo dell'anno in 2024."}, {"username": "Josien Damoiseaux-Strijkers", "comment_text": "Ooh Sorrento. Geweldig daar. Veel geluk❤️🌺"}, {"username": "Diana Besonova", "comment_text": "As much as I hate show-offs, your happiness is something to brag about😁"}, {"username": "Laura Piccinini", "comment_text": "I suggest sicily, sud East area + isole Eolie . In early oct maybe the only area where you can still enjoy beach Life and swim ,else where Will be cold"}, {"username": "Thomas Harris", "comment_text": "Congratulations\n!!!"}, {"username": "Luigia Gray", "comment_text": "Congratulations\non your wedding. I can't say I'm a little envious. Sorrento is stunning as is Positano.\nThese towns of the Amalfi coast are delightful. Sardinia I've heard is absolutely gorgeous too, but I haven't been there yet.\nI 🙏 pray all goes well\nand your Wedding is a\nDay to remember."}, {"username": "Nicola Algerino", "comment_text": "Per le temperature del periodo la Sicilia è perfetta!"}, {"username": "Heikki Valtonen", "comment_text": "Firenze e Toscana❤️"}, {"username": "Joanne Atkin", "comment_text": "Can’t go wrong with Sicily. Beautiful water great people. Good restaurant s. To me not quite as crowded as the rest. Was there in September too weather was great. Congrats lucky girl"}, {"username": "Samina Jassani", "comment_text": "Greece. Santorini"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "follow us https://\nnextstop-italy.c\nom/\nvirtual-tours/\nbest-of-sicily/"}, {"username": "Katie Sasser", "comment_text": "Congratulations\n! We just honeymooned in Positano and used Flytographer to take pictures. We love them!"}, {"username": "Alicia Cox", "comment_text": "I haven’t been to Sicily but it’s on my next trip for sure. Honestly my all time favorite is Tuscany bec it’s easier to navigate bec it’s smaller towns. You would need a car. Pick a town that is centrally located and do day trips. You could also see Florence. But I love Lucca, Sienna, Volterre, San Giamignono ?sp. Also the food is great in Tuscany, but honestly most of Italy food is delish. But Tuscany is beautiful rolling hills so countryside vs big cities. 🤷🏻‍♀️"}, {"username": "Diane Noronha", "comment_text": "Sardinia"}, {"username": "Iris Joan Price", "comment_text": "Anyplace on Lake Como!"}, {"username": "Dana Talusani", "comment_text": "Sardinia has amazing beaches and incredibly clear water. I'd choose to honeymoon there!"}, {"username": "Mariët Eertman-Heemstra", "comment_text": "Ravello, villa Rufolo, with many flowers blooming and an amazing view. This village is situated just above the Amalfi village. (own picture)"}, {"username": "Rosie Grosjean", "comment_text": "Congratulations\n! How about Ischia?"}, {"username": "Teresa Rivero", "comment_text": "Congratulations\n! 💍\nSept/Oct are great months. The weather is nice. ❤️🥂🍾"}, {"username": "Jane Eichhorn", "comment_text": "Cinque Terre was our favorite! Split your time between there and Florence/\nTuscany!"}, {"username": "Mylene Hunt", "comment_text": "Congratulations\n🥂"}, {"username": "Michele Baron Vold", "comment_text": "Lake como"}, {"username": "Rana Shehadeh", "comment_text": "I recommend Sardegna, but check the weather end of September/\nearly October."}, {"username": "Valentina Tutoli", "comment_text": "Check here Itacarè Diamante, in Calabria, a beautiful place in front of the sea. We married there last year, and we are Italian 🙂\n\nhttps://\nitacarediamante.\nit/"}, {"username": "Marcella Mayoya", "comment_text": "Staying in Amalfi will be a wonderful Honeymoon."}, {"username": "Katja Girinovitch", "comment_text": "Congratulations\n!"}, {"username": "Kathie Duffy", "comment_text": "Congratulations\n!! Wherever you go in Italy will be fabulous!!!❤️❤️❤️"}, {"username": "Stacy Prestigiacomo", "comment_text": "Venice"}, {"username": "Gail Suddath", "comment_text": "That’s cool."}, {"username": "Melinda Miles", "comment_text": "Congratulations\n! Capri is fabulous!!!"}, {"username": "Sarah Dudley-Short", "comment_text": "Positano is amazing!"}, {"username": "Beth Pesta McGuire", "comment_text": "Sardinia"}, {"username": "Jo Ann Schwartz Woodward", "comment_text": "Congratulations\n!! Gorgeous ring💜Sicily is beautiful."}, {"username": "Renae Larcus", "comment_text": "Lake Como. Stay in Varenna at Albergo Milano. We stayed there and also our son on his honeymoon."}, {"username": "Patty Walsh", "comment_text": "Congratulations"}, {"username": "Sarah Emerson Nelson", "comment_text": "I don't know if you have your venue booked, but we met some folks walking the Path of the Gods who had just attended a wedding at a castle in Italy. That's what I would do if I were to do it all over again. Here's a link - I can't vouch for any of these places though: https://\nwww.exclusiveita\nlyweddings.com/\ncastle-wedding-i\nn-italy.html"}, {"username": "Jan Lumberg Kupczyk", "comment_text": "We loved Sorrento. Good choice."}, {"username": "Leyla Ozlem Oklu", "comment_text": "Sicily especially Taormina is a wonderful choice."}, {"username": "Kate Aquino", "comment_text": "I highly recommend using Bella Sposa - Wedding & Event Planning in Italy ! We got married in Sorrento and Cheryl Pagano the owner was outstanding!!"}, {"username": "Karen Cooper", "comment_text": "Karen Cooper"}, {"username": "Mary Brandon", "comment_text": "Capri, Tuscany wine regions from an agri-tourismo lodging, Pompei, Venice, Milan, Lake Como, and Florence!"}, {"username": "Tamra Ann", "comment_text": "Congratulations\n!! I hear Sardinia is awesome?"}, {"username": "Sandra Desmond", "comment_text": "Congratulations\n🎉"}, {"username": "Elaine Yelin", "comment_text": "Congratulations\n!"}, {"username": "Angela Genduso", "comment_text": "Capri"}, {"username": "Anna Abruzzese Sater", "comment_text": "Congratulations\n!"}, {"username": "Victoria Markou", "comment_text": "Congrats! Sorrento is beautiful! Would definitely look into Sardinia for your honeymoon!\n\nhttps://\nm.youtube.com/\nwatch?v=xKvwwo5w\nwSE"}, {"username": "Cinzia Bonciani", "comment_text": "Italy has a lot to offer and it really depends how you want to spend the time. You’re getting married in Sorrento so the Amalfi Coast & the isle of Capri are natural choices but I would also suggest the islands of Ischia, Procida and Panarea or La Favignana. You don’t say whether you’ve been to Italy before however if you haven’t and were looking to explore cities obviously Rome, Florence, Venice are starting points."}, {"username": "Mackenzie Carpenter", "comment_text": "I love all of Italy, but the Amalfi Coast is at the top of my list but only after the summer crowds have dispersed. I’ve been in Positano and Ravello in late September…super\nb. Not as crowded, not as hot, and still, to my mind, some of the most beautiful places on this earth.\n(Capri, too)."}, {"username": "Lisamarie Bianco", "comment_text": "Beautiful!! Congrats!! Sardinia all the way"}, {"username": "Shannon Sutton", "comment_text": "We are honeymooning in October 2024 to Sicily! Planning to stay in Mazzaro near Taormina for 10 nights!"}, {"username": "Janet MacCallum", "comment_text": "I went to the best wedding in Ravello on the Amalfi coast. What a lovely part of the world to get married in."}, {"username": "Erminia Pedata", "comment_text": "Sardinia or cinque terre if you love the sea :)"}, {"username": "Jennifer Amen", "comment_text": "Congrats!!! ❤️"}, {"username": "Filomena Filomena", "comment_text": "Congratulations\n🎉"}, {"username": "Joy Crawford", "comment_text": "Sorrento perfect"}, {"username": "Emmy Delangre", "comment_text": "Stay at the Aminta in Sorrento, they have rooms with the most stunning views."}, {"username": "Libby Szabo", "comment_text": "Congratulations\n!! Anywhere in Italy would be lovely for a honeymoon. I don’t know if you are getting married at a church, but when I was walking In Sorrento, one day, I walked past this church that was hosting a wedding, and this is one of the decorations outside the church."}, {"username": "Patsy Luque Mejia", "comment_text": "Congratulations\n🍾"}, {"username": "Lisa Petry", "comment_text": "Lisa Petry"}, {"username": "Anne Ellis Teather", "comment_text": "Beautiful!"}, {"username": "Linda Haavig", "comment_text": "The hotel in Sicily used in White Lotus would be amazing!"}, {"username": "Giulia Cardamone", "comment_text": "You can't go wrong with either! And Congratulations\n!! ❤️❤️"}, {"username": "Maria Grillo-Abel", "comment_text": "🍾🥂"}, {"username": "Frederick Rühr", "comment_text": "Congratulations\n🍾 🥂❤️"}, {"username": "Wanda Vicari", "comment_text": "Lovely"}, {"username": "Rhona Veisfeld Modugno", "comment_text": "Congratulations\nto you both 💗"}]}, {"id": "2197939933938418", "text": "We are going g to Rome, Florence and Venice in September so I have a lot of questions. I am thinking that I may do some\nChristmas shopping while there. What advice or tips do you have for good places to seek out? In Florence is the street market a good place for leather? How do I know of it is a good quality Va going to s a shop? I am not a bit haggler so wondering also how do you know what to offer without being insulting? Art: is this hard to get home?", "link": "facebook.com/groups/1373361046396315/permalink/2197939933938418/", "likes": 2, "comments": [{"username": "Phyllis Snyder", "comment_text": "Look into VAT tax refunds!"}, {"username": "Paula Brink", "comment_text": "I wouldn’t buy leather at the street markets- so much of it is poor quality and made in Chinese factories in Prato.\nTry the leather school.\nI found the link but it is “pending” which happens far too often here."}, {"username": "Paula Brink", "comment_text": "https://\nscuoladelcuoio.i\nt/en/"}, {"username": "Paula Brink", "comment_text": "http://\nwww.madova.it/"}, {"username": "Lisa Schalig-Winter", "comment_text": "Massimo Leather in Florence! He will ship your purchases! My purse only took 3 days to get to Alaska."}, {"username": "Laurie Ladouceur Schmitt", "comment_text": "The leather school is Scuola del Cuoio. Website for the leather school is https://\nscuoladelcuoio.i\nt/en"}]}, {"id": "2197943023938109", "text": "Is it necessary to book the Lake Garda ferry from Sirmione to Malcesine in advance? If so how far in advance? The website is very confusing...", "link": "facebook.com/groups/1373361046396315/permalink/2197943023938109/", "likes": 0, "comments": []}, {"id": "2197945537271191", "text": "Is it necessary to book the Lake Garda ferry from Sirmione to Malcesine in advance? If so, how far in advance? The website is very confusing...", "link": "facebook.com/groups/1373361046396315/permalink/2197945537271191/", "likes": 0, "comments": [{"username": "Kathi Keefauver Thompson", "comment_text": "I asked a similar question in this group recently and no one responded. I reached out to my airbnb host and she said it will be fine to get tickets the same day. Hope that helps!"}, {"username": "Phillip Farquhar", "comment_text": "Done this couple of weeks age just get the tickets on the day"}]}, {"id": "2197950893937322", "text": "A bit overwhelmed and could use some eyes on my rough plan. Any recommendations for delicious food, markets or experiences also very welcomed! ☺️\n\nMonday arrive early AM rome\ntrain to tivolli vila d'este cont to Orvietto\nalternate plan for jet lag\nTuesday Orvietto - ebike rental\nWednesday Orvietto all day\nThursday Orvietto market - fly to palermo - rent car\nFriday Santa flavia all day\nSaturday santa flavia - fly to Rome stay in city\nSunday rome tourist day\nMonday depart afternoon rome", "link": "facebook.com/groups/1373361046396315/permalink/2197950893937322/", "likes": 0, "comments": [{"username": "Carol Scime-Raiford", "comment_text": "Wow that’s a whirlwind trip for 7 days. Santa Flavia looks beautiful!"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2197946973937714", "text": "Any suggestions for best way to get getting from Naples to Positano in early October? We will be flying into FCO and taking the train to Naples. Thanks for the suggestions!", "link": "facebook.com/groups/1373361046396315/permalink/2197946973937714/", "likes": 4, "comments": [{"username": "Dorinda Campbell", "comment_text": "Private car or train."}, {"username": "Carine Boon", "comment_text": "by ferry, with NLG.it"}]}, {"id": "2197956387270106", "text": "We are staying in Sorrento and did this cooking class. It was about and hour and a half away, but worth it! We had a fabulous time!\nhttps://www.tripadvisor.com/AttractionProductReview-g187782-d17576845-Cortecorbo_Irpinia_wines_tour_of_the_vineyards_Cooking_class_wine_tasting-Sorrento.html#", "link": "facebook.com/groups/1373361046396315/permalink/2197956387270106/", "likes": 0, "comments": []}, {"id": "2197960140603064", "text": "Just to share some personal experience for Naples.\n\nDo buy your bus tickets from the metro station in advance.\n1. The tabatchi shops don't open early and so far the 6 I went too all don't sell bus tickets.\n2. They don't accept contactless too.\n3. They don't accept cash\n3. We got fined €52.50 per pax for no tickets as point 1 and 2 and 3 above.\n4. Dinner along the water is nice, than can see the lights after sunset.\n5. Needless to say, pizza is great!\n\nExperience for Rome\n1. My teenage daughter was almost pick pocketed at Roma Termini. A group of teenage girls push her into the train than went out before the doors closed. Her crossbody bag was unzipped but nothing was taken. We think her phone too cheap to waste effort.\n2. Same thing with bus. Please buy tickets in advance at metro stations!\n3. Weather is 🔥, keep hydrated!\n4. Zebra crossing is a suggestion, they do not stop until you take the brave 1st step out.\n5. Get an audio guide for vatican museum. It takes at least 3 hours to brisk walk through and for that, you can't stop at every exhibit. It's very warm and crowded at certain points. Keep calm, keep hydrated. No point having a guide, bcoz of the crowd, they are just herding you through. Just you join a private tour, than its different.\n6. Have loads of pasta! All so nice!\n7. Have loads of gelato, amazing in this weather!\n\nExperience in Procida\n1. Buy bus ticket at port, can't find it anywhere else.\n2. It's very steep, quite a walk, mostly unsheltered.\n3. Beach is amazing! Water is nice and cool, good to chill inside.\n4. Plan your day to tour the beautiful island in the morning, slow lunch around 1ish, than head to beach around 3pm.", "link": "facebook.com/groups/1373361046396315/permalink/2197960140603064/", "likes": 4, "comments": []}, {"id": "2197223837343361", "text": "Hello! I will be in Tuscany at the beginning of October and will be there for 4 nights. Does anyone have suggestions for areas/towns to stay? Suggestions for wineries are also appreciated! Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2197223837343361/", "likes": 0, "comments": [{"username": "Whitney Meyers", "comment_text": "La Chiusa Tuscany"}, {"username": "Megan Knight", "comment_text": "My suggestion is to have a car for this leg of the trip, you will be able to see much more and have much for flexibility.\n\nWe had two lovely stays in Tuscany. We stayed in a villa near the tiny town of Ambra. On Tuesday’s in Ambra they have a farmers market where we purchased fruit and meats for a poolside picnic and spent that day swimming at our villa. ✨dreamy✨ that evening we had dinner at the cutest little restaurant and our favorite restaurant from our 2.5 week trip.\n\nWe also stayed at the gorgeous Castello Vicchiomaggio. We did not have a car, so we were a bit stuck on the property, but we spent the day/evening swimming in the infinity pool, & drinking their fabulous wine then the next morning took a tour at the winery and had lunch at the on-site restaurant. We wished we would have had a car here because it is near the town of Greve in Chianti, but we were unable to get there due to lack of public transport."}, {"username": "Alice Francesca", "comment_text": "I am from Italy and I travolta to Tuscany at least once a year, so I hope you will stay in Siena (check the cathedral and the main square, Piazza del Palio) and then rent a car to the Valle D'Orcia valley, about 1 h and 30 minutes south.Pienza is the place to be: Check RELAIS CHIOSTRO DI PIENZA.then take a trip among the lush Tuscan landscape to San Quirico, Montalcino, Monticchiello (great view of the sunset ) and finally go relax at the POSTA MARCUCCI HOTEL AND SPA in Bagno Vignoni."}, {"username": "Alice Francesca", "comment_text": "Alice Francesca"}, {"username": "Alice Francesca", "comment_text": "https://\nwww.postamarcucc\ni.it/en/"}, {"username": "Tracey Ragland Hester", "comment_text": "Buonconvento!"}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "Val d’Orcia region is the best. Check out Villa Ciccolina"}]}, {"id": "2197963097269435", "text": "Which is the official site to book Pantheon tickets ? No tours just entrance tickets !!", "link": "facebook.com/groups/1373361046396315/permalink/2197963097269435/", "likes": 0, "comments": [{"username": "Kirsty Manning", "comment_text": "Free entry, no tickets"}, {"username": "Giovanni Pianigiani", "comment_text": "https://\nwww.direzionemus\neistataliroma.b\neniculturali.it\n/\npantheon_english\n-version/"}, {"username": "Sarah Stiltner", "comment_text": "I found this site super helpful since the website is not very user friendly…\n\nhttps://\nromevacationtips\n.com/\nhow-to-buy-ticke\nts-for-the-pant\nheon-in-rome/"}, {"username": "Eric Maurer", "comment_text": "http://\nwww.museiitalian\ni.it/"}, {"username": "Melissa Hunt", "comment_text": "Does anyone know if the Pantheon is free on first sundays of the month?"}]}, {"id": "2197966537269091", "text": "Does anyone have experience with using T-Mobile’s data service in Italy using the data that comes automatically with your service? Rep told us that it’s unlimited 2G data service (not 5G, you’d have to pay for a data plan to have a certain amount of data at the higher speeds.\nWondering if we should be fine with that or if we should get the data plan with the higher speed.\nThanks in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2197966537269091/", "likes": 0, "comments": []}, {"id": "2197972863935125", "text": "Hi - heading to Italy in October. Do I need to make restaurant reservations for sorrento, Florence and Rome or can I just wing it?", "link": "facebook.com/groups/1373361046396315/permalink/2197972863935125/", "likes": 2, "comments": [{"username": "Lisa Valdovinos", "comment_text": "We never made a reservation but ate our big meals in the afternoon. Unless you have a specific restaurant in mind there are many cafes and restaurants all around."}]}, {"id": "2197970687268676", "text": "Wow! Great site! Learning so much thank you! We will be ending our vacation and flying home from Venice. We have three days that we will want to chill out, maybe by a beach, with few crowds/tourists. Suggestions for towns/cities not too far (maybe 2 hour drive away?) from Venice airport that you would suggest? This would be for near the end of September. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2197970687268676/", "likes": 0, "comments": []}, {"id": "2197971530601925", "text": "Amalfi to Rome, should we do train (Ferry to Salerno, train to Rome) or private driver? It will be our last night and I want to make the most of the time in Rome. Although I’d love one more ferry ride to see the coast and a chance to see Salerno for a moment, but I think it will take up time. Is the price a huge difference (two people). Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2197971530601925/", "likes": 0, "comments": []}, {"id": "2197973203935091", "text": "I just wanted to take the time to thank everyone in this group. I used a lot of information and advice from this group to plan our recent Italy trip. (Strikes, navigating trains, tickets, etc). We went toआणखी Florence for 4 nights, Cinque Terre for 2 nights, and Rome for 3 nights. Everything went so smoothly and it was an amazing trip! Here are some photos I wanted to share! For tours we did the Chianti Wine Safari, the Vatican early breakfast tour (highly recommend), and a boat tour in Cinque Terre. Please feel free to ask me any questions! 😊", "link": "facebook.com/groups/1373361046396315/permalink/2197973203935091/", "likes": 379, "comments": [{"username": "Evi Fulford", "comment_text": "What is the Vatican early breakfast tour? Heading to Italy in September."}, {"username": "Jeanette Petrie", "comment_text": "What sightseeing would you recommend doing in Florence? Did you go to the Duomo Cathedra?"}, {"username": "Michelle Murphy Margolati", "comment_text": "By doing the Vatican for early breakfast tour, did you avoid the crowd?"}, {"username": "Nancy Curmi", "comment_text": "Ali Sha"}, {"username": "Connie Schoch Morello", "comment_text": "Fantastic photos!!"}, {"username": "Julie McIvor", "comment_text": "Lynette Pitt"}, {"username": "Michelle Forbes", "comment_text": "Looks beautiful!"}, {"username": "Kerry Macaulay", "comment_text": "Fabulous photos. 😊"}, {"username": "Sheyla Enrich", "comment_text": "All amazing pictures!"}, {"username": "LLisa Mac", "comment_text": "Amazing pics!!!"}, {"username": "Bernadette Sarmiento", "comment_text": "Hi could you pls send the link for the Vatican breakfast tour - will be in Rome next month thanks"}, {"username": "Amber Loolie", "comment_text": "Awesome! I'm headed there in Aug.\nDid you rent a car in Florence to check out the Tuscan villages? I'm starting in Milan for 1 day, then Florence >>> Amalfi>>>Rome. Should I skip Amalfi and go to Cinque Terre instead?"}, {"username": "Maria Musumeci", "comment_text": "Love the quality of your pics, just stunning!!"}, {"username": "D Rochelle Milton", "comment_text": "Your photos are to die for, they are amazing!"}, {"username": "Marge Miller", "comment_text": "Beautiful photos!"}, {"username": "Rose Traczik-Delfico", "comment_text": "Amazing photos! Did u take these on a digital camera or a cell phone?"}, {"username": "Christine LaMore Meyers", "comment_text": "Amazing"}, {"username": "Belinda Cooper Hockings", "comment_text": "Can I ask what boat your you did in Cinque Terre?"}, {"username": "Belinda Cooper Hockings", "comment_text": "Paul Riding"}, {"username": "Martha Kosir Stankewicz", "comment_text": "Beautiful pictures"}, {"username": "Brenda Keeter", "comment_text": "Fantastic pictures!"}, {"username": "Debbie Horton Rough", "comment_text": "Beautiful"}, {"username": "Lisa Owyang Anton", "comment_text": "Beautiful pics!! For the Vatican breakfast tour, about how many were in your group? Did you prefer it over a private tour?\nThanks, looking to book in middle of October. I appreciate your feedback."}, {"username": "Kate Rudd", "comment_text": "Wow Sara, your photos are amazing!!!!! 👍😊"}, {"username": "Marlene Beck", "comment_text": "Beautiful photos"}, {"username": "Dianne Giordano", "comment_text": "Beautiful photos."}, {"username": "Melissa Lou", "comment_text": "Would you recommend staying in the Chianti region or day tours are enough?"}, {"username": "Terri Bradford", "comment_text": "Sara Beth was it necessary to stay in CinqueTerre or could you drive in to Cinqueterre from Florence easily daily? We are planning our trip now and it would be nice not to move hotels again and just keep Florence as our home base so to speak. Thoughts?"}, {"username": "Cathy Ruggiero", "comment_text": "Your an amazing photographer"}, {"username": "Barb Scott", "comment_text": "The pics are gorgeous! We are going in May and I want to focus less on the architecture and more on the coastal scenery. We also plan to do Rome and Florence. It looks like you saw a lot of beauty which is what I want. We went to Ireland last year and I am hoping Italy can top that!"}, {"username": "Harriet Hoffman", "comment_text": "How were the crowds in Cinque Terre this time of year?"}, {"username": "Paulette Molasses Sims", "comment_text": "Beautiful, will save this post for the wine tour in Florence."}, {"username": "Tami Neubauer Foster", "comment_text": "Beautiful photos💜"}, {"username": "Ruth Holgado", "comment_text": "Beautiful photos!!!😍"}, {"username": "Cory Lee", "comment_text": "You’re welcome Sara Beth!!"}, {"username": "Lisa Jones", "comment_text": "Beautiful photos, what a great trip!"}, {"username": "Stacey Lavelle Johnson", "comment_text": "Great photos"}, {"username": "Betty Bartlett", "comment_text": "Fabulous 😍"}, {"username": "Giovanna Jo", "comment_text": "Beautiful pics!! Could you possibly share Airbnb you stayed in Rome. TIA 🇮🇹"}, {"username": "Susan Lavery Cringle", "comment_text": "Could you share your Airbnb with me"}, {"username": "Coreen McGuire", "comment_text": "Gorgeous pics....glad you had a great time!"}, {"username": "Jodie Bentley", "comment_text": "We are planning to do wine safari tour, How did you rate it ?"}, {"username": "Janie Patri Thomason", "comment_text": "Can you tell me where you stayed in Cinque Terre, please?"}, {"username": "Sheila Scanlon Fisher", "comment_text": "For your breakfast tour at the vatican, was the Sistine Chapel included?"}, {"username": "Vicki Douglas", "comment_text": "Please share your air bnb in Rome"}, {"username": "Alicia Cox", "comment_text": "Awesome pictures! 👏🏻"}, {"username": "Linda Karabias", "comment_text": "Your pictures are amazing"}, {"username": "Cindy Capozzi", "comment_text": "Great pictures!"}, {"username": "Lois Letterie Cianci", "comment_text": "Great pictures!!"}, {"username": "Cindy Breneman Hattrich", "comment_text": "I will be there in august!"}, {"username": "Anna Alves-Regalado", "comment_text": "Danny Regalado"}, {"username": "Kristina Servantes", "comment_text": "One day I want to go!"}, {"username": "Susie Dunn", "comment_text": "We are going in mid September and have an almost identical itinerary down to the planned excursions."}, {"username": "Mary Andreotta", "comment_text": "Thank you for sharing!!!"}, {"username": "Alexis McNamara", "comment_text": "Did you reserve chairs/\numbrellas on the beach in Monterosso? If so when?"}, {"username": "Tina Louise", "comment_text": "Gorgeous 😍"}, {"username": "Leila Jane", "comment_text": "You captured some amazing shots!!!!!! <3"}, {"username": "Maria Rizzuto Campanella", "comment_text": "Can you pls share the Airbnbs you stayed in? Thanks"}, {"username": "Jerry Kiger", "comment_text": "Good info … did you do all plans yourself or travel agent? Plane, ABB, Tour stuff? Debating agent or piece together … thx for info"}, {"username": "Joanne De Rose", "comment_text": "Love your pictures!"}, {"username": "Chrissa Matthews", "comment_text": "Amazing pictures! Can’t wait to get there!"}, {"username": "Maria LaPietra Guerrero", "comment_text": "Gorgeous photos!"}, {"username": "Jen Jen", "comment_text": "Where did you stay in Cinque Terre?"}, {"username": "Sandra Maldonado Saavedra", "comment_text": "Going in November and just booked the breakfast Vatican tour last night since I kept seeing so much positive feedback about it. (Second time to Italy and remembering the crowds last time at the Vatican so hoping for a more personal experience this time. 🤞🏼)"}, {"username": "Caroline Richards", "comment_text": "Incredible pictures!!"}, {"username": "Evie Gee", "comment_text": "The pictures are stunning"}, {"username": "Sabrina Marie", "comment_text": "Did you fly or take a train from Florence to Rome?"}, {"username": "Kristi Kelly Mendenhall", "comment_text": "Which boat tour did you do?"}, {"username": "Mary Mol", "comment_text": "How did you travel from one place to the other beautiful pictures"}, {"username": "Tonsia Keytel", "comment_text": "Where did you stay in Florence?"}, {"username": "Deanna Scheetz Langer", "comment_text": "Your landscape photos are gorgeous!"}, {"username": "Tanja Voegele-Roeller", "comment_text": "Who did you book the Chianti Wine Tour through?"}, {"username": "Tammy Jo", "comment_text": "Stunning pictures!!! 😍"}, {"username": "Carmen Martin", "comment_text": "Great photos. Thanks for sharing"}, {"username": "Jenn Hass", "comment_text": "Your pics are amazing! Would love to know where you stayed! Also, have never heard of the Chianti Wine Safari."}, {"username": "Cheryl Gillette", "comment_text": "Beautiful photos. I’m going to Italy for the first time in September. Staying in Rome, Cinque Terre and Milan. So excited! 🥰"}, {"username": "Carol Potter", "comment_text": "Beautiful photos!"}, {"username": "Beryl Lato", "comment_text": "Can you give some details on the Chianti Wine Safari? My group of 6 adults will be in Florence in October"}, {"username": "Teresa Rivero", "comment_text": "Beautiful photos! I’m glad you enjoyed your trip to beautiful Italy. We were there last month. ❤️🇮🇹"}]}, {"id": "2197994133932998", "text": "Would love any suggestions for a quiet area to base ourselves on the outskirts of Florence. We are travelling with our two boys (8 & 12) and keen to avoid big crowds and cities but still have access to day trips (we have a car). Ideally a small village it town. . Our original booking has been changed so we need to book something for mid August - I know it's crazy busy, best places prob all booked out and super hot but it is what it is and being in Italy will be amazing😊", "link": "facebook.com/groups/1373361046396315/permalink/2197994133932998/", "likes": 0, "comments": []}, {"id": "2197993990599679", "text": "Going to lake garda for the day. Do we need to book ferry tickets in advance? If so how far In advance?", "link": "facebook.com/groups/1373361046396315/permalink/2197993990599679/", "likes": 0, "comments": []}]