[{"id": "2199109873821424", "text": "Fly virtually to Sicily! Our expert guide will lead you on a virtual journey through this beautiful island, to explore the most beautiful places of Sicily.\nYou will discover (just to mention a few) the vibrantआणखी and chaotic Palermo, Sicily’s capital; the Byzantine splendour of Monreale; the charming coastal town of Cefalù, home to a massive Norman Cathedral; the majestic Mt. Etna; the romantic town of Taormina; the magnificent Baroque cities of the Noto Valley; the Greek engineering feat of Selinunte and the famous Valley of the Temples, one of Sicily’s most famous historical attractions.\nJoin our virtual experience: https://nextstop-italy.com/virtual-tours/best-of-sicily/\n\n#medievalart #italytravel #italyiloveyou #virtualworld #italytrip #vacationmood #sicily #sicilylove #sicilyitaly #sicilytravel #sicilyessence #sicilytourism #sicilypictures #TAORMINA #taorminasicily #cefalù #cefalusicily #ValleyoftheTemples #syracuse #ortigia #ortigiaisland #palermo #palermo #archaeology", "link": "facebook.com/groups/1373361046396315/permalink/2199109873821424/", "likes": 3, "comments": []}, {"id": "2199098213822590", "text": "Has anyone flown Ryanair (Italy onward) without having to pay credit card charges while booking tickets? (Except for payment via PayPal which I don’t use)\n\nA particular credit card type perhaps?\n\nTIA 😌", "link": "facebook.com/groups/1373361046396315/permalink/2199098213822590/", "likes": 1, "comments": [{"username": "Denise Keegan", "comment_text": "Most airlines charge extra for payment by credit card these days."}, {"username": "Cecilia Christine Costantini", "comment_text": "I have a Visa and have never been charged extra by Ryanair. I always buy tickets through the app, never the webpage."}, {"username": "Lauren-Jade Roberts", "comment_text": "Not sure where you are but in the UK its now not allowed to charge to use a credit card. Is this directly from the Ryanair site. Try booking through the UK site maybe"}]}, {"id": "2199102170488861", "text": "Does anyone know if their is a maximum limit you can spend in Italy on items to bring back to the US ? Thank you !", "link": "facebook.com/groups/1373361046396315/permalink/2199102170488861/", "likes": 7, "comments": [{"username": "Stacey Valente", "comment_text": "You can google what US customs allows you to bring back. In Canada it is $800 CAD per person"}, {"username": "Miyuki Kanno Paul", "comment_text": "Just pay duty"}, {"username": "Sandi Van", "comment_text": "https://\napps.apple.com/\nus/app/\nmobile-passport-\ncontrol/\nid1520656722 use this skip the long line and easy questions !!!! Fill out when you’re heading back"}, {"username": "Janine Emma Lucas", "comment_text": "You can bring virtually as much as you’d like for personal use, BUT after your exemption they have the right to charge you duty on the balance (look online for duty rates for specific items like leather goods). If you don’t declare and they search you they charge duty and a high fine or can even withhold items not declared"}, {"username": "Jeanette Smith Floyd", "comment_text": "Just declare everything and they will usually let you pass through. If you purchased items with your passport to claim the VAT tax they will already know about it, but you still must claim. ￼ Definitely download and use the MobilePassportC\nontrol app to speed through customs, and immigration."}, {"username": "Katherine Rogers", "comment_text": "It is $800 pp so if you are traveling as a family group, say 2 adults and 2 children it would be $800 ×4 = $3200"}, {"username": "Kelly Ladwig", "comment_text": "We brought back about $8k worth of stuff and we were stopped and had to pay a duty. It wasn’t much.. like $176. But because VAT was linked to our passport we did t want to not be truthful about declairing"}, {"username": "Rita Kanten", "comment_text": "You can bring back as much as you want but anything over $800 is subject to duty tax. And since you have to present your passport to purchase anything over 150euros customs already has a list of your high end purchases but you still have to fill out the forms and declare everything."}, {"username": "Susan Lowry Lamb", "comment_text": "If you exceed the limit don’t pony it up on the form. My husband just had to be honest about a ring and that turned into 2 extra hours in line to pay the feds $25. We were pissed about the process. Not the paltry amount we owed."}, {"username": "Barbie Phillips", "comment_text": "WhenI came back into the U.S. last week the agent asked if my purchases were over $1600 & Joe much cash I was carrying."}]}, {"id": "2199063267159418", "text": "Do a half-day trip to Portofino or explore more of Cinque Terre?\n\nI need your help to maximize my time at Cinque Terre.\n\nDay 1, 7 December - I will arrive at Vernazza around 9pm.\nDay 2, 8 December - I got the whole day to explore.\nDay 3, 9 December - I will leave Vernazza at 1:00pm.\n\nMy idea is to go to Portofino on Day 2 for half day. Then go toआणखी Manarola to explore the town, the market, and witness the lighting of the nativity scene.\nDay 3, I will explore Vernazza before leaving.\n\nIs this a good idea or are there other Cinque Terre towns worth visiting than spending 3 hours of my time just to commute to Portofino?\n\nThanks for your help!", "link": "facebook.com/groups/1373361046396315/permalink/2199063267159418/", "likes": 3, "comments": [{"username": "Khushi Khanna", "comment_text": "Instead of traveling for 3 hrs to Positano, I would visit Porto Venere , which is closer and easier to get to ."}, {"username": "Edoardo Casolo", "comment_text": "is this a joke?"}, {"username": "Jenni Pearl Leavitt", "comment_text": "Positano is not at all near the cinque terre. You can easily spend many days in the cinque terre at the 5 towns, hiking, the beach, boating, or going to Porto venere and not get bored. I loved it. It would take you all day just to get to positano. Do you mean Portofino?"}, {"username": "Lucrezia Folger", "comment_text": "explore more of Cinque Terre. 1/2 day?! Forget it."}, {"username": "Colleen Jennings", "comment_text": "Stay put & enjoy where you are. December likely wet & cold so why spend your free time on a train? Maybe look up a cookery class where you’re based? Enjoy your trip."}, {"username": "Jeff Odom", "comment_text": "Positano is about 8 hours, 1 way, by train from Vernazza and then 8 hours back. Are you maybe thinking of Portifino?"}, {"username": "Miyuki Kanno Paul", "comment_text": "First you take a train to Santa Margherita Ligure. Catch a bus in front of the train station to Portofino. It may take anywhere 30 minutes up to an hour depending on the traffic. Portofino is not much to see unless you are on a boat to see secluded areas where fancy people hide. Have lunch overlooking the bay, time it for the next bus available, and head back to Santa Margherita Ligure"}, {"username": "Laura DeCicco", "comment_text": "Stay in CT"}, {"username": "Jenn Messina Babore", "comment_text": "We loved Portofino and Santa Margherita"}, {"username": "Yvette Pavone", "comment_text": "Portofino!"}, {"username": "Yvette Pavone", "comment_text": "The cinque terra towns are Small! You can do more than 1 in a day"}, {"username": "Gommy Shirley Pribisco Brady", "comment_text": "I thought much of the area pretty much shut down starting in Nov. for the season. No?"}, {"username": "Marissa McLean", "comment_text": "Explore more of cinque terre, portofino is quite overhyped on my opinion, it’s a tiny little town that takes like 1/2 hour to see unless you hike up to the look out at the ostello. The 3 hr commute is not gunna be worth the time you could’ve spent explore atleast 1 or 2 other towns in cinque terre"}, {"username": "Steph Craddock", "comment_text": "No, you'll waste 3 hours on a train. Just stay in Cinque Terre at most take the ferry to Portovenere. But there's somuch to explore in Cinque Terre."}, {"username": "Caterina Liquori-Culhane", "comment_text": "Positano is one of a kind. Go"}, {"username": "Russ Heinemann", "comment_text": "We stayed in Santa Margherita and thought it was a better location than Portofino. They are very close together. We walked to Portofino then took the ferry back. Only 10-15 minute ride."}, {"username": "Colleen Carollo Oxsalida", "comment_text": "Here’s another vote for Portovenere — we really enjoyed it. We stayed overnight there and then visited CT by ferry the next day."}, {"username": "Christopher A. Johnson", "comment_text": "Portofino"}, {"username": "Marcia Levy", "comment_text": "Santa margarita is a wonderful place to visit, only an hour train from the5 terre.\nWe stayed there many times. Not sure what is open in December. There are other towns in 5 terre you can see\nThat are fabulous.\nGood luck."}, {"username": "Jeff McLellan", "comment_text": "I think it makes no sense at all. Just not worth it at all.\n\nYou are assuming that all trains are running on time and that you make connections."}, {"username": "Donna Gilardone Szwabowski", "comment_text": "Portofina is glorious in the summer, but in the off season not much open.\nStill pretty though"}, {"username": "Virgz Van Møøre", "comment_text": "Go to Rapallo instead, not much to see either in Portofino except luxury boutiques or 5 t unless you hike"}, {"username": "Victor Hillary", "comment_text": "Cinque terre 😎"}, {"username": "Amanda Haga", "comment_text": "I wouldn’t waste my time at Portofino. It’s beautiful but that’s about it. Food was mediocre and not a friendly place to visit. Unless you are into luxury shopping nothing much to do."}, {"username": "Stacy Zaid", "comment_text": "Santa Margherita Ligure ? Is there a public beach or do any hotels offer day passes?"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2199097437156001", "text": "I heard there is a TikTok that’s claiming if you change your VPN to a foreign country, not United States or Australia) you can see lower prices on Google flights. To test this theory out, is anyone who is over in Italy right now willing to see if when they search on Google flights for tickets to see if they’re cheaper when you search in that country? I know I can change my VPN but there is a monthly fee. Thanks! ￼(I’m looking for next May an￼d the prices are crazy high).", "link": "facebook.com/groups/1373361046396315/permalink/2199097437156001/", "likes": 2, "comments": [{"username": "Colleen Dawson", "comment_text": "Search in incognito mode."}, {"username": "Bronwyn O", "comment_text": "I tried searching from Chicago to Rome for a random two weeks in October on Cheaptickets. It must have recognized something because it thought I was a bot when I switched my VPN to place myself in Italy, and wouldn’t load. Same results in private mode - prices didn’t change when searching regularly, and continued to have issues using an Italy ip."}, {"username": "Bronwyn O", "comment_text": "No price difference using Google Flights once you convert from euros to dollars. I had the VPN set to place me in Rome."}, {"username": "निनावी सहभागी", "comment_text": "Colleen Dawson same price that show up incognito. The TikTok specifically said the VPN was foreign. Thanks anyways."}, {"username": "Michele Levesque Semosky", "comment_text": "I also searched from home and then changed vpn to Luxembourg and there was no difference in price US$"}, {"username": "निनावी सहभागी", "comment_text": "Michele Levesque Semosky Thank You!"}]}, {"id": "2199093450489733", "text": "Did anyone buy tickets online for gallery accademia from museum website\n(b-ticket.com)? I am trying to buy, but they are asking for my date of birth. I am wondering why and thinking is it legit?", "link": "facebook.com/groups/1373361046396315/permalink/2199093450489733/", "likes": 2, "comments": [{"username": "Diane Davis Lawyer", "comment_text": "Maybe they allow discounts for seniors or for kids/teens so they want to check if you're eligible for those discounts? Just a suggestion as I have no idea."}, {"username": "Hilary Pickett", "comment_text": "They asked us too… we booked through GetYourGuide… I think its just information gathering, they like to know for their tourist information."}, {"username": "Miyuki Kanno Paul", "comment_text": "This is THE official site.\nhttps://\nwww.galleriaacca\ndemiafirenze.it\n/"}, {"username": "Jane Lisa", "comment_text": "Just make up a date."}, {"username": "Autumn Watson", "comment_text": "It’s for pricing - variable prices for students, youth, senior etc"}, {"username": "Megan Beals", "comment_text": "I use whatever website is in Rick Steves guide"}, {"username": "Jill Rose", "comment_text": "Yes. We had to give that information. That’s the correct website."}]}, {"id": "2198619330537145", "text": "We are back in the states for about a week following a 12 day tour through Gate1 travel. The tour was great in providing a “backbone” , meaning it hit most of the basics for what we wanted to see as first time visitors to Italy. I would recommend to people doing a tour is to read the fine details of your itinerary. We did a lot of really great things but we’re not aware for example that the part in Rome didn’t actually include a tour inside the Colloseum. In Florence we didn’t see the David Statue or go into the Uffizi museum.\nThis isn’t their fault, I just didn’t look closely enough or question the company ahead of time. We didn’t have the time to do those things outside of the tour. Please don’t get me wrong, it was great but if something is important to you research it ahead of time.\nWe did two things on our own which I think may have been my favorites. A private wine tour in Tuscany and a cooking class in Rome, which was incredible. I would highly recommend Cooking Classes in Rome . The chef Andrea Consoli works very hard to make the experience everything you want and also interact on a very personal basis. Outstanding.\nAlso, as I need to eat GF, I was a little worried about Italy. No need to worry, they are very aware and really catered to my needs . Pizza, pasta, desserts and more, all great.\nI’m adding some highlight photos. One request- I want to make 3-4 of these into bigger metal prints. Anyone have a favorite they would suggest? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2198619330537145/", "likes": 653, "comments": [{"username": "Kadie Mcgugan", "comment_text": "Cameron Holliday"}, {"username": "Michelle Solak", "comment_text": "Mpix is amazing for prints! Beautiful photos 🙂"}, {"username": "Stephanie Adamek Annis", "comment_text": "beautiful pictures!"}, {"username": "Bea Kuckens", "comment_text": "Since you are planning on doing the prints on metal, I think the light in the arches of the coliseum would be awesome."}, {"username": "Annie Hayden", "comment_text": "Beautiful photos!"}, {"username": "Kyunghoo Kim", "comment_text": "Absolutely amazing"}, {"username": "Gail Iussig-Stoglin", "comment_text": "Your photos are stunning!! Postcards, all of them. What camera did you use?"}, {"username": "Millie Arellano", "comment_text": "Beautiful pictures!"}, {"username": "Laura Lvdl", "comment_text": "I just got back 6 days ago. So nice to see my travels in your pics. I highly recommend a food tour in Rome that we found on Viator. Our guide took us through all the districts in Rome and gave an amazing history of each including the Jewish ghetto, flower market and over the Tevere. Fabulous!!!!"}, {"username": "Veronica Urso Potenza", "comment_text": "Amazing pictures…. Hard to choose a favorite!"}, {"username": "Judy Kroeker", "comment_text": "Manarola coliseum and narrow streets in Florence are my favs"}, {"username": "Gita Rafiei", "comment_text": "Awesome pictures!You are an amazing photographer"}, {"username": "Deborah Betz-Harleman", "comment_text": "Awesome pictures!!"}, {"username": "Ida Sfo", "comment_text": "Boats & beach umbrellas are my favorites"}, {"username": "Amanda Jane Worthington", "comment_text": "What a shame about Uffizi & David…"}, {"username": "Oksana Yarosh", "comment_text": "The wording in guided tours is so important to understand. \"See the Coliseum\", \"stop at the Coliseum\", \"visit the Coliseum\", \"(guided) tour (of) the Coliseum \""}, {"username": "Dianne Kelly", "comment_text": "really enjoyed your photos!!"}, {"username": "Elena Paladino Flood", "comment_text": "Beautiful pictures"}, {"username": "Iman Nazaran", "comment_text": "Following"}, {"username": "Louise Jennings", "comment_text": "Wow! Those photos are brilliant!"}, {"username": "Tracy Sachse", "comment_text": "Beautiful photos. Did you take them on an IPhone Joe Arndt?"}, {"username": "Jasper C. Acton", "comment_text": "All great photos, two best to me are Manarola and Coliseum."}, {"username": "Phyllis Snyder", "comment_text": "Good advice!"}, {"username": "Sharon May", "comment_text": "Thanks for sharing"}, {"username": "Luisa Aquilina", "comment_text": "Amazing photos."}, {"username": "Cindy Voss", "comment_text": "Wow! Did u take these pictures?! They’re awesome!"}, {"username": "Lynn Philipak Ballantyne", "comment_text": "Your pictures are amazing!! Just beautiful! thanks for sharing!"}, {"username": "Carmen Martin", "comment_text": "All your photos are amazing!\nThanks for sharing 😍"}, {"username": "Olivia Cabral Tein", "comment_text": "Hailey Price"}, {"username": "Judith Pitman", "comment_text": "What absolutely fabulous photos you have taken! I would have a hard time choosing which ones to print.\nWhat kind of camera did you use? These are spectacular!!"}, {"username": "Joan Wallis", "comment_text": "Beautiful pictures!!"}, {"username": "Adriana Sormani", "comment_text": "All fabulous pictures!"}, {"username": "Brian Anderson", "comment_text": "Good luck deciding...they\nare all beautiful photos!"}, {"username": "Karen Albertyn Wood", "comment_text": "Beautiful pics"}, {"username": "Michele David", "comment_text": "Whatever touched you at first sight has to be “the”one. You have a very good eye🌻"}, {"username": "Kay Kenny", "comment_text": "Top left Amalfi coast and coliseum lit up at dusk."}, {"username": "Vicky Johnstone", "comment_text": "Absolutely stunning 😍"}, {"username": "Ilca Bloom", "comment_text": "Stunning photos."}, {"username": "Laura Miller Bailey", "comment_text": "I would love to have a link to the cooking class in Rome! Phenomenal photos 😃"}, {"username": "Diane Bolinger", "comment_text": "These are some of the best pictures I’ve seen on this site so far! I would not be able to decide they should all be framed! I can’t wait to get these pictures myself and frame them! I will never get these kinda shots!"}, {"username": "Susan Schuster Pharand", "comment_text": "Beautiful photos."}, {"username": "Kacy Shafer Desmonds", "comment_text": "I’m not sure how you would pick! Your photos are beautiful!"}, {"username": "Sam Hersh", "comment_text": "Your photos are absolutely incredible"}, {"username": "Valerie Collanton", "comment_text": "Love all the photos. The first one is a favorite for sure."}, {"username": "Marjaana Häkli", "comment_text": "Amazing photos ! Number 6 is my favourite."}, {"username": "Lisa Meade Carr", "comment_text": "Beautiful pictures!"}, {"username": "Margie Williams", "comment_text": "Outstanding images! You will have a tough time making selections."}, {"username": "Mary Balistreri Swan", "comment_text": "Great photos 🥰"}, {"username": "Maureen Weber", "comment_text": "Great photos! What was the private wine tour?"}, {"username": "Karen Hill", "comment_text": "Regarding Gate 1 travel, we are traveling with them in October and was wondering did you book those activities before you left or during your trip? Did you have enough free time to do these activities?"}, {"username": "Tracey Shelton", "comment_text": "Beautiful pictures! Did you use a camera or an iPhone?"}, {"username": "Mark Deebel", "comment_text": "Sue Shurow Deebel"}, {"username": "Sue Shurow Deebel", "comment_text": "Beautiful photos, the first one is my favorite!"}, {"username": "Lee Anne Shearer", "comment_text": "May I please have the information on the cooking class in Rome? We are going with Gate 1 in October!"}, {"username": "Mindy A. Hoverson", "comment_text": "Do you have a link for the cooking class? Thank you ☺️"}, {"username": "Toni Yeazel", "comment_text": "That is very difficult, they are all amazing. I would do the ones with the flowers for sure. Thanks for sharing!"}, {"username": "Paula Baker Shavell", "comment_text": "I vote for the first one of Manarola or the boats in Cinque Terra. BTW what is a metal print?"}, {"username": "Danielle Smith Letizio", "comment_text": "All of your pictures are amazing. Couldn't choose 4."}, {"username": "Rosemary Foreman", "comment_text": "Beautiful pictures"}, {"username": "Connie Coleman", "comment_text": "Great pics!!!"}, {"username": "Evie Gee", "comment_text": "Your photos are just stunning!"}, {"username": "Nancy Brennan Carrow", "comment_text": "Beautiful pictures! Looks like an amazing trip!"}, {"username": "Andrea Gattini Pennington", "comment_text": "Beautiful pictures!"}, {"username": "Shari Hollander Baron", "comment_text": "Spectacular photos!"}, {"username": "Lelani Tong Eickhoff", "comment_text": "Gorgeous photos"}, {"username": "Sharon Costa Malaspina", "comment_text": "Thanks for sharing. Just beautiful"}, {"username": "Danielle Tomevi", "comment_text": "Beautiful pictures- I am also GF- was it in their menu or did you have to ask separately?"}, {"username": "Janet Canter", "comment_text": "Your photos are amazing. Excellent! I would recommend White House custom color or Mpix for photo enlargements. reasonable priced and excellent results."}, {"username": "April Farthing Taylor", "comment_text": "WOW! Beautiful pictures! 😊"}, {"username": "Aleksandra Huryk", "comment_text": "Stunning shots 😍"}, {"username": "Maria Costas-Saliva", "comment_text": "Beautiful pictures"}, {"username": "Mai Ka Moua", "comment_text": "Wow! These are awesome photos. Hard yo choose but what touched you the most."}, {"username": "Sheyla Enrich", "comment_text": "They are all amazing!! Hard to pick!"}, {"username": "Kim Blanton Ferguson", "comment_text": "Thank you for sharing! Your pictures are stunning!!"}, {"username": "Kathy Fryer", "comment_text": "Fabulous photos! Thanks for sharing these."}, {"username": "Claudia Shields", "comment_text": "Wow ! I would have a hard time picking"}, {"username": "Hanne Dada", "comment_text": "What camera did you use to take these amazing pictures?"}, {"username": "Patricia Rada Basili", "comment_text": "Beautiful pictures! I would enlarge and frame Cinque Terre, pictures 1 and 2"}, {"username": "Debra Rigler-Arsenault", "comment_text": "You have some amazing photos!"}, {"username": "Anne Brawley", "comment_text": "Your photos are really stunning, what a great photographer you are."}, {"username": "Sandy Dawson", "comment_text": "I was happy to hear that you enjoyed a cooking class while also eating GF. How did that go? Were they able to also provide GF ingredients or did you just participate without partaking some items?"}, {"username": "Ilana Brongiel", "comment_text": "Amazing photos! Are you willing to label them? I’m curious where some of these were taken. Was it Cinque Terre or Amalfi? Planning our 12 day trip next summer to Venice, Florence, Rome and Sorrento!"}, {"username": "Harriet Hoffman", "comment_text": "Can you share your itinerary? Link? Or I can look on Gate1Travel! Already ready to go back to more of Italy🇮🇹\nAmazing pictures!"}, {"username": "Janet Toellner", "comment_text": "Our trip to Italy also said we would see the colosseum - yes we saw the outside but did not go into the colosseum. That was a disappointment to us as we had a day before our tour began where we would have booked a tour ourselves, had we known."}, {"username": "Rachel Castleberry", "comment_text": "Awesome photos. I’d say print the first one."}]}, {"id": "2199084430490635", "text": "Ciao! We are near Siena for a few days and saw someone say in here they just stopped into some wineries in Chianti. Do any of you have recommendations of specific ones that allow you to just pop in for a tasting? Grazie!", "link": "facebook.com/groups/1373361046396315/permalink/2199084430490635/", "likes": 1, "comments": [{"username": "Stefano Follador", "comment_text": "That’s my job 😅\n\nDownload the FIVI app. Is an association of small producer who have a lot of associates in the area.\nI suggest you to visit small company instead of big ones, better products, better service and more human, usually.\nHow much can you drive or move from Siena?"}]}, {"id": "2199091323823279", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2199091323823279/", "likes": 7, "comments": [{"username": "Camryn Brooks", "comment_text": "Wow so cool!!!!!"}]}, {"id": "2198999867165758", "text": "Monte Cucco in Umbria 🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2198999867165758/", "likes": 3, "comments": [{"username": "Hue Nguyen", "comment_text": "I have done a video of Monte Cucco on my Youtube channel Bongitaly, you can check on the following link https://\nyoutu.be/\nMJ9YtIcuoK0"}]}, {"id": "2199024073830004", "text": "Currently staying in Rome, we’re going to the Vatican tomorrow, we didn’t know about having to cover knees and shoulders so I need to don’t something to wear by tomorrow, please can anyone give me any advise on what to wear as it is currently 30+ degrees?", "link": "facebook.com/groups/1373361046396315/permalink/2199024073830004/", "likes": 5, "comments": [{"username": "Kimberly Winnon AmRhein", "comment_text": "Vendors sell scarfs outside for this very reason"}, {"username": "Madeline Caporale", "comment_text": "I am sure you can find a large light scarf to cover shoulders or to tie around your waist to cover knees. Find a linen shirt or dress."}, {"username": "Kim Geary Keidel", "comment_text": "People sell scarves everywhere. They will walk up to you with a bunch to choose from. Wrap one around your waist and hang one over your shoulder. (Note: negotiate price. Lady in front of us at Duomo in Florence bought 2 and guy came down a bunch after she was refusing to pay his price. Think she paid 10 for two scarves.)"}, {"username": "Ann Caruso", "comment_text": "There is a gift shop before the entrance we purchased large scarves for 5euro each last September\nI wore a casual dress above the knees so had to cover up"}, {"username": "Heidi Carrello", "comment_text": "The scarves they sell at the markets everywhere are super cheap I got mine for 1 euro"}, {"username": "Donna Castle-Jones", "comment_text": "My husband and I got right to the door and I wasn’t allowed in, we had been in a massive queue, so don’t take a chance, cover up with what you can, I missed out and might not be able to get the chance to go back, I would loved to have gone in"}, {"username": "Hope Stamback", "comment_text": "Today my husband and teen boys wore longer shorts that were right at their knees. My skirt was right at my knees, as well. Shoulders were covered. I heard them tell someone to cover their shoulders, but as long as your shorts aren't short shorts, you should be okay. The heat is stifling."}, {"username": "Maïta Desvaux De Marigny", "comment_text": "They give out a cloth to cover your shoulders in front of the basilica however I would suggest wearing some trousers. Enjoy !"}, {"username": "Matteo Gallizioli", "comment_text": "Matteo Gallizioli"}, {"username": "Kristie Kennedy Wolfe", "comment_text": "They have paper coverings available at the Vatican or you can purchase a scarf from\nOne of the several people selling outside:"}, {"username": "Carolyne O'Hagan", "comment_text": "My tour guide from last year put up a PSA last week saying do not wear long trousers. Can wear shorts to knee or sun dresses to knee and put a light shirt or scarf to cover shoulders."}, {"username": "Mary Haghiac", "comment_text": "They have some kind of paper robes that they give you so you can cover both knees and shoulders"}, {"username": "Jayne Dawson Meyer", "comment_text": "I payed 3€ a piece for a scarf they sell all over the place.longer shorts or skirt is ok."}, {"username": "Hollie Barcheck Juersivich", "comment_text": "They actually provide you with a covering that disposable after usage."}, {"username": "Maria Angela Perrone", "comment_text": "Just a scarf on the shoulders for you will be enough.\nMen also cannot wear t-shirts with slogans on it."}, {"username": "Claudia Amp", "comment_text": "Just use a scarf/light shawl big enough to wrap around like a pareo and cover your shoulders with a scarf as well; you just fold everything into your bag once you’re out."}, {"username": "Rowena Marcelino", "comment_text": "Guys are allowed to wear knee length shorts . Women have to cover shoulders . Just bring a scarf or buy around the Vatican ."}, {"username": "Sarah Stiltner", "comment_text": "We went today and they were giving blue cover ups to those who needed shoulder/knee coverage.\n\nMen with shorts were fine as long as they weren’t super short."}, {"username": "Suzanne Grant", "comment_text": "I got a scarf off of one of the pop up stalls which did the trick & I will get use of it back home also"}, {"username": "Lisa Baglio Garrison", "comment_text": "You can get a scarf from a street vendor to cover your shoulders. As long as your shorts or dress aren’t real short, you’ll be ok. Right above the knee is fine. We were there 2 weeks ago."}, {"username": "Brian Anderson", "comment_text": "Omg"}, {"username": "Vicki Susie Naab Gandolf", "comment_text": "Women have to have their shoulders covered. We were just there last month. My husband wore shorts. No problem. They were just men’s average walking shirts. I wore capri’s."}, {"username": "Reagan Bramston", "comment_text": "A sarong can be used as a scarf & a cover up...."}, {"username": "Felicia Melo", "comment_text": "I saw tons of knees and shoulders when I went to Vatican last week. Nobody was enforcing anything"}, {"username": "Lisa Reeve", "comment_text": "What about men with long shorts and leg tattoos?"}, {"username": "Janet Isaacs Lanza", "comment_text": "We were there today and there were women wearing sleeveless dresses and shirts, dresses that came to mid thigh, men wearing shorts, etc. Nothing was said."}, {"username": "Nina Aggarwal", "comment_text": "We were there a few weeks ago and they we’re actually handing out some kinds of tarps to people to borrow at entry. Not sure if thats the norm but scarves were also sold by vendors ."}, {"username": "Abi Michelle", "comment_text": "Light flow let scarf"}, {"username": "Mary Marzacco Krzykowski", "comment_text": "That is bullshit. When I we there way back in the 70's. I had long sleeves ,,& my skirt was over my knees & the guy wouldn't let me in so I walked down a bit & got in\nPlease what goes on in the Catholic church ⛪️ their worries about having your shoulder ,, knees\nCrazy"}, {"username": "Patty Ham", "comment_text": "Wrap a light scarf around your waist"}, {"username": "Cecilia Christine Costantini", "comment_text": "Get a cheap shawl/scarf and wrap it around your waist. They might even provide them, but if there are too many people they might run out."}, {"username": "Cecilia Christine Costantini", "comment_text": "As for shoulders, yesterday I was wearing a tank top, but wanted to go inside a church. I carried a normal cotton t-shirt in my bag, put it on before entering the church, removed it on the way out."}, {"username": "Enrica Palla", "comment_text": "Wear what you want, really. Nobody will care, it's freaking hot."}, {"username": "Cecilia Christine Costantini", "comment_text": "To buy cheap(ish) clothes you have H&M and Tezenis on Via del Corso."}, {"username": "Jess Galasso", "comment_text": "Wear a long skirt or slacks and buy a lovely linen shawl at one of the street vendors."}, {"username": "Jenny Payne", "comment_text": "Have you got a scarf? it’s only to cover your shoulders for women & men have to wear long pants I think? Google what you have to wear? 🌻"}, {"username": "Gena Diaco Penland", "comment_text": "There are people selling scarves near the entrance."}]}, {"id": "2199039443828467", "text": "I am very interested in this group. Looking at travelling next year to Italy.", "link": "facebook.com/groups/1373361046396315/permalink/2199039443828467/", "likes": 13, "comments": [{"username": "Matteo Gallizioli", "comment_text": "you are welcome 🇮🇹"}, {"username": "Lynn Clemens", "comment_text": "We thought too but no one seems to answer on our questions. So good luck"}, {"username": "John Layman", "comment_text": "Plan early,you owe it to yourself and talk to a good travel agency. My wife and I use the travel network in Morgantown,WV. And the agents name is Gary Wong."}, {"username": "Lena Tomaino", "comment_text": "Thank you 🙏"}, {"username": "Lisa Valdovinos", "comment_text": "We planned 9 months ahead. I highly recommend a travel agent for everything. Ours did a great job. All we had to do was show up."}, {"username": "Noeleen Cahill", "comment_text": "Me too"}, {"username": "Noeleen Cahill", "comment_text": "I normally travel we the travel dept, they organise everything for you, pick you up at airport arrange all events etc and escort you back to the airport for departure"}, {"username": "Bobbie A. Lewis", "comment_text": "Us too! After being on this page for about a year now, the most important thing I’ve learned is…. Don’t go to Italy in the summer! We are planning on going in late spring. ❤️"}]}, {"id": "2199050433827368", "text": "FYI-New requirements in 2024.\n\n", "link": "facebook.com/groups/1373361046396315/permalink/2199050433827368/", "likes": 4, "comments": [{"username": "Dawn Lynch", "comment_text": "Mark Lynch"}]}, {"id": "2199051880493890", "text": "We are going to Milan in March next year . Please would anyone be able to help with location to stay and mid range hotels or apartment. Any other tips very much appreciated. Thank you in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2199051880493890/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187849-d1674\n8079-Reviews-So\nnder_Missori-Mi\nlan_Lombardy.ht\nml%3FspAttribut\nionToken%3DMTY4\nMTIwODA"}, {"username": "Miyuki Kanno Paul", "comment_text": "Every time a convention is held in Milano, hotel prices go up. Book early"}, {"username": "Anita Clayton", "comment_text": "We stayed at iQ Milano. Directly opposite Central Station, modern clean rooms, friendly staff and brilliant roof top bar."}]}, {"id": "2199064507159294", "text": "Is it a smart idea to rent a car in italy ? (Target loc: Milan, Como, Dolomites) How’s the parking slots, streets, gas and toll ?\nComing in October", "link": "facebook.com/groups/1373361046396315/permalink/2199064507159294/", "likes": 13, "comments": [{"username": "Tamara Nopo", "comment_text": "I personally wouldn't want to drive around the big cities, it can be chaotic. The trains are fantastic so where they cover your route, I'd recommend using them"}, {"username": "Doreen Shaner", "comment_text": "We rented a car at the Milan Airport and drove to Lake Area,the Dolomites,Venic\ne Verona-no problems BUT we did NOT attempt to drive in Milan-the airport is comfortably outside of city."}, {"username": "Clarissa Rava", "comment_text": "Don’t drive in Milan. Trust me. I live there and i never take the car to go to work. I always use public transport. Also gas is between 1.69€/L and 1.85€/L now, not convenient at all"}, {"username": "Claudia Orozco", "comment_text": "Sirmione beatiful"}, {"username": "Giovanni Pianigiani", "comment_text": "Average daily gas price throughout the country (it's obviously per liter, multiply by 3.8 to have it per gallon) https://\nlab24.ilsole24or\ne.com/\nprezzo-benzina/\n?refresh_ce=1\nThis is obviously the self service price, some stations still offer the option of an attendant filling the tank, for a surcharge - which should be clearly highlighted when entering the station"}, {"username": "Alex Dodge", "comment_text": "Use public transport in Milan and a car for the rest of the trip."}, {"username": "Andrea Karina Niazi", "comment_text": "Driving was not that difficult in Milan . Gas goes from. 1.67 to 1.9 depending also if is self service or full service(someone\nfeeling up the tank for you it cost a bit more. We did self service is very simple"}, {"username": "John Wilson", "comment_text": "Great way to get rid of extra cash you have laying around"}, {"username": "Donna Gilardone Szwabowski", "comment_text": "We have rented cars several times. No issues parking or getting where we needed to go. Just need to be mindful of ZTL restricted driving zones. We locate parking on our apple maps and head there when going to cities. That isn’t to say we haven’t missed turns and had to redirect 🤣"}, {"username": "Elaine King", "comment_text": "I wouldn't advise it, I've read horror stories about fines,"}, {"username": "Claudia Castellini", "comment_text": "Yes, to go to Dolomiti it’s better having a car"}, {"username": "Janet Isaacs Lanza", "comment_text": "Absolutely not. Downright dangerous. I get into taxis and cars with personal drivers and just close my eyes. They might as well not even have lanes painted on the streets. They don't use them. They just go wherever they want. They stop for no one."}, {"username": "Russell Weidner", "comment_text": "Small towns and villages are OK…… cities are a no go for me!!"}, {"username": "Charlene Noll", "comment_text": "Most rental cars are standard (stick shift), get the rental car insurance!"}, {"username": "Janet Bell", "comment_text": "I would!"}, {"username": "Steve Jones", "comment_text": "We rented a car from Venice up thru the Dolomites to Milan and beyond. Parked the car in Milan for a few days we didn't really need it there. But driving thru the Dolomites would be worth renting a car in itself. It was Awesome."}, {"username": "Paul N Marietta Dodson", "comment_text": "Make sure you know how to drive a manual transmission car. Rarely can you get an automatic."}, {"username": "Kelly Hanberg Rosati", "comment_text": "If you are flying in and out of Milan you can visit the city without a car at the beginning or end of your trip and then rent the car from Milan to visit the Dolomites and Lake Como. If you have the car in Milan you can always park at one of the underground parking lots and then take public transport/walk from there. We rented a car and drove into Paris and Milan and it felt manageable for us."}, {"username": "Carla Casci Principato", "comment_text": "Dolomites, yes. Como, if your airbnb has free parking otherwise it's a hassle. And Milan NO."}, {"username": "Sara Kyle Hargett", "comment_text": "Not unless you are an excellent driver"}, {"username": "Steve Grossman", "comment_text": "If you have to ask about gas and tolls take the public transportation.\nSeriously"}, {"username": "Chris Vilsack", "comment_text": "Milano? No. Use public transport. Countryside? Yes!"}, {"username": "Steph Craddock", "comment_text": "You will need a car for the Dolomites. Toll road to get there."}, {"username": "Tony Palombino", "comment_text": "Been doing for the past 25 days it’s been amazing"}, {"username": "Alona Cruz", "comment_text": "If you are used to drive in the big cities it won’t be an issue. We have no problem driving around the cities from Amalfi coast to Milan/\nPortofino. Parking use the app easy park no need to pay cash, link to your credit card"}, {"username": "Laura Beaudreau", "comment_text": "We just got back from a 2 week trip.\nWe rented a car and LOVED It. We drove from Florence, Genova, Bellagio, Venice, Milan, Bologna, Orvieto, Sorrento, Rome, and back to Florence.\nWe did choose to always use a paid parking garage that had attendants so that did have some extra cost- but made us feel very secure. Streets are a bit narrower than in the US but manageable.\nThere are lots of toll ways- but they’re honestly not that difficult to manage. Just grab a ticket when you get on- and you pay when you exit- either wish cash or credit card. Just be sure to stay out of the electronic pass lanes (marked with signs showing a big yellow T)\nGas is expensive- compared to the US- but our car was a hybrid- so it got good gas mileage and was worth it for us!\n\nHope you have an amazing trip!"}, {"username": "Phyllis Snyder", "comment_text": "Only drive in the small towns- and be very aware of the road conditions- narrow streets and limit parking. Also lots of traffic traps- could cost you $$! Never leave anything in your rental car- trunk included! Professional thieves know rental cars and that it’s mostly tourists with stuff- a target!"}, {"username": "Morgan Keller", "comment_text": "I drove through the Dolomites and it was really easy! Lots of places to park and easy to read signs. I live in a mountainous area as it is so I’m used to that type of driving. If you’re not confident then I can see it being somewhat of a challenge. I’d never drive anywhere else though. That’s my two cents!"}, {"username": "Marbelis Francisco", "comment_text": "I think is a great idea!! To me is the best way to enjoy any country, plus You’re heading North in October, less crowded. Milan all day parking €30, and you can drive around Como, We took the ferry ones just to get the experience. Bring a coat for the Dolomites in October, you may see snow! Enjoy"}, {"username": "Alex DiBona", "comment_text": "We flew into Milan and got a transfer to Como. Then rented a car in Como and drive to the Dolomites then to Padua and Rimini. Tomorrow we drive to Tuscany and will return the car in Milan. Working out perfectly!"}, {"username": "Ingrid Davis", "comment_text": "It’s a great way to get around if you want more freedom than what public transportation can offer. Streets can be narrow. Lots of roundabouts.\nI was paying 1.89 a liter for gas last week.\nLots of tolls.\nI’d look for hotels that have parking as parking can be difficult to find.\nI enjoyed having a car."}, {"username": "Connie Wilson", "comment_text": "You can visit Milan and Lake Como by train and ferry, but Dolomites are best with a car. Not difficult to find parking."}, {"username": "Veronica Parravicini", "comment_text": "Parking and driving in Milan is a joke. I don’t recommend getting a car as long as you’ll be there, you really don’t need it because everything is connected by metro, trains, tram and even buses.\nYou can also go by train to lake como as a day trip.\nHowever you’ll definitely need a car to go to the Dolomites"}, {"username": "निनावी सहभागी", "comment_text": "Ingrid Davis Thank you so much!"}, {"username": "Stefano Follador", "comment_text": "In Milano you Don’t need a car at all. Pubblic transportation is good.\nThe situation change in mountains area. There having a car is a good perk.\nMoving by car is not too expensive, but rent is usually higher than other country in Europe, but looking at the fact you are aiming to alpine area I suggest you to rent one"}, {"username": "Loretta Spahmer", "comment_text": "If using rental insurance provided by a cc be sure and check if Italy is covered."}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "yes for Dolomites https://\nwww.discovercars\n.com/\n?a_aid=NextStop-\nItaly"}, {"username": "Miyuki Kanno Paul", "comment_text": "Milan? NEVER!\nNo matter where you go, parking is always a big challenge in Italia. Rent a smaller car than you usually drive. Gas and tolls are easy."}, {"username": "Rhonda Hope", "comment_text": "Maybe for Dolomites not for Milan or como"}, {"username": "Roland Trego", "comment_text": "For those locations, I’d on￼ly get a car in the Dolomites. Certainly not in Milan. On Lake Como you can ￼ ride the ferries."}, {"username": "Megan Rachal", "comment_text": "Como and Dolomites are easy drive, and easy park. We drove around Milan not through so can’t speak to that!"}]}, {"id": "2199078497157895", "text": "Hi, we arrived in Rome late Saturday and had nothing planned for the Sunday encase flights were delayed. So with two children we decided due to heat, to take a taxi to Hydromania the water park just outside Rome. It cost 35/40 euros for 25 min taxi, or it’s an hour on metro and bus journey plus walking. We struggled to use the website to bookआणखी before but when you get there they have 2 English payment desks. We did get there for opening time and still managed to purchase 4 beds and two umbrellas. The flumes and pools were fantastic and had lots of shade when queuing, and didn’t queue long (being a weekend) Lots of places to eat, very reasonable for a park, they even arranged a taxi when we went home, Stayed until about 5.30,", "link": "facebook.com/groups/1373361046396315/permalink/2199078497157895/", "likes": 8, "comments": [{"username": "Tracy Foss", "comment_text": "Great idea! We went to a water park in France years ago when my boys were teenagers When we got there they went down one slide and were told no shorts allowed only speedos 😂we could purchase them,but the boys being 🇨🇦 & teenagers weren't wearing speedos 🤷🏼‍♀️their loss lol"}]}, {"id": "2199080393824372", "text": "First time poster here…also first time visiting Italy. We are trying to plan a trip for our anniversary for late February/early March. We were thinking 10 days. What would be your top cities to see in thatआणखी amount of time without feeling rushed? Also given the weather that time of year? And is it easy to plan a trip on my own there or would a travel planner be helpful? I always plan our own trips but have never been to Europe before. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2199080393824372/", "likes": 168, "comments": [{"username": "Martha O'Neal Glover", "comment_text": "Sorrento! Visit the Isle of Capri. Also, Italian Riviera and Cinque Terre."}, {"username": "Judy Mann Montana", "comment_text": "We did mid March this year and the weather was great! Cool enough to wear coats but not warm enough to swim."}, {"username": "Yvonne Cullie Ross", "comment_text": "We have travelled all over Italy apart from all the popular places to visit 2of our favourite places areCinque terre and Siena 👏👏"}, {"username": "Lori Hagen", "comment_text": "We are first timers too and I am leaning towards a travel planner with an office here and Italy. Just seems like a whole l I t less stress."}, {"username": "Jeannine Frey Culp", "comment_text": "Easy to do it on your own, allow at least 3 nights per city so you can actually get immersed a little bit, book museums and things like sistine chapel and last supper, ahead of time. Florence, Venice, Milan, and Rome. Take day trips. Then, next trip you will know what area you want to return to and spend more time. That time of year is perfect...winte\nr is also perfect"}, {"username": "Laura Mares", "comment_text": "Haven\nWe’ll be in the mountains ⛰️"}, {"username": "Kristy Williams", "comment_text": "Two trips last year- first with my 17yo daughter in August. Then with my 15yo son and our school trip in the spring.\nFirst trip- we started in Paris, flew to Rome. Spent 2.5 days doing the tourist stuff. Train to Pompei for two days, train to Sicily- 2 days in Taormina, 3 days in Palermo. Back to London for three days. We went solo- booked it myself. It was great. We felt safe in the middle of the night wandering around piazzas or shopping at markets during the day.\nTrip two- Zurich to Venice, Verona, Murano, Burano, Rome, Florence, Pisa then to Nice and Monaco.\nThe trip was too jam packed and too much driving to each. We did all that in 10 days and I preferred the trip with my daughter. I wouldn’t do northern Italy unless you want to hit the “tourist” things. The gondolas were cool, Murano glass was neat but it was a lot of time I would have preferred getting to see the city. Spending 2-3 days in one location makes you feel part of it and not just a visitor."}, {"username": "Kevin Hatton", "comment_text": "10 days = 9 nights only ! Wow , that is way Too Rushed ! Yes, Rome, Florence, Venice . That is all you can fit into 9 nts! ( I think 3 weeks Minimum is needed, just for Italy !) So much to do/see. Even 2 wks (14 nts) would be pushing it !"}, {"username": "Dana Guidotti Rooney", "comment_text": "That’s a great map of Italy, showing the Alps in the north and the Apennines Mountains that runs through the middle 💚🇮🇹❤️."}, {"username": "Jordyn Spresser", "comment_text": "We just got back and had done 2 days in Venice, 3 days in Florence, and 5 in Rome…we LOVED Venice and Florence and felt like that was the perfect amount of time. 5 days in Rome felt too long for us we would have preferred 2 maybe 3 but we did a day trip to sorrento since we had more time then we knew what to do with and we loved it!! We used Trenitalia to get places and it was so quick and convenient and didn’t eat up much of the day at all"}, {"username": "Jordyn Spresser", "comment_text": "We just got back and had done 2 days in Venice, 3 days in Florence, and 5 in Rome…we LOVED Venice and Florence and felt like that was the perfect amount of time. 5 days in Rome felt too long for us we would have preferred 2 maybe 3 but we did a day trip to sorrento since we had more time then we knew what to do with and we loved it!! We used Trenitalia to get places and it was so quick and convenient and didn’t eat up much of the day at all"}, {"username": "Maureen Braver", "comment_text": "Perillo tours. No rush and enjoy many beautiful cities in this special country."}, {"username": "Sofia Helena", "comment_text": "If you could do more day, then go for it. I did 25 days and it was sick!"}, {"username": "Yvonne van Zeeland-Udo", "comment_text": "Was in Rome and Florence, Rome a week and Florence 2 weeks. Plenty to see. From Florence we took the train to pisa and lucca. And the train and bus to san gimignano. The trains and busses are not that expensive. Also was in Sorrento for 8 days. The hop on hop of bus to amalfi and positano. The train to pompei. If you like to see the most of the city I think you need 4 days per city minimal"}, {"username": "Steve Griggs", "comment_text": "If going to Rome stay in the Trastevere neighborhood away from the crowds for a real Rome experience.\nCiao!"}, {"username": "Jens Gehlert - SirGusto", "comment_text": "Since everybody forgets Piedmont South. Top Tip! Go to Langhe Region, without discussion, one of the most exciting regions in Italy."}, {"username": "Vanessa Mulquiney", "comment_text": "Depends on your interests and your must-sees will determine the cities you visit—it’s your first time and you don’t have many days. Sit down with a travel guide (or the internet) and go from there. You’ll get a million different responses here based on those peoples interests, not yours. Why do you even want to go to Italy? Perfect time of year though, avoid summer, avoid Sicily (beautiful island with too much to do it deserves its own trip). And ignore people who say 2 days in Rome is enough—I live here and a lifetime wouldn’t be enough to see everything"}, {"username": "Jenny Childs", "comment_text": "With only 10 days I'd suggest fly in to Milan then visit Venice, Florence and Rome. Fly out of Rome. You need at least 2 nights and 2 full days in each city and also need to allow for travel days between each place otherwise you'll be exhausted."}, {"username": "Caroline Di Carlo", "comment_text": "Think about visiting Puglia? I’ve travelled to Italy 10 times and never thought of visiting. Maybe your next Italian visit? - Polignano a Mare, Monopoli, Matera, Alberobello. Never seen anything so beautiful."}, {"username": "Amber Simon", "comment_text": "Taormina is beautiful and there should be snow on Mount Etna around that time of year."}, {"username": "Renáta Tóth", "comment_text": "In that part of the year, for 10 days, I would do Rome, Amalfi coast and it's area (Naples, Vesuvius, Pompeii, Sorrento, Amalfi), and the surroundings of Bari (Bari itself, Matera, Alberobello)."}, {"username": "Nick Gambardella", "comment_text": "For that period of time, which in my view is barely enough for one city, do as almost everyone also on their first trip:Roma, Firenze and Venezia."}, {"username": "Sue Jarvis", "comment_text": "Cirque Terre was amazing I went there by train from Florence to Lavento ."}, {"username": "Emma Burtenshaw", "comment_text": "Rome- Naples- Amalfi coast-Palermo\nRome-Naples- Matera- Lecce\n\nFebruary further North Bologna up will be cold, and possibly occasional rain or snow. By going South it will be warmer."}, {"username": "Suzanne Kuuskmae", "comment_text": "Rome, Florence, Venice by train. Fly into Rome out of Venice. There are trip planners who can set you up with guides, transportation,\nhotels but we did it easily planning on our own. We went at that time of year."}, {"username": "Nina Lucca", "comment_text": "With 8 days, if you are planning to explore cities at a good distance apart, use the Frecciarossa 1000 trains which get you there at lightning speed, much faster than driving even if the highways were not congested, which they are. You can book them online from home. Read about stamping your tix before boarding or they fine you. Having covered pretty much all of Italy, I'd say check out Rome for 2-3 days. The Vatican takes a full day. Naples, Amalfi, Capri, Pompeii, even Ischia are all beautiful and would likely take you minimum 3 days. This part of Italy is breathtaking and the food, amazing!\n\nGoing north, Florence, Sienna, Lucca, and Pisa will likely use up 3 days. I personally find Venice tedious and boring so I always say 1 day max, but even a half day. It is nothing but waterways lined with murano glass shops, drama masks, and jewelry. Close to Venice and much more beautiful is Verona. Its shops, restaurants, pace are more relaxed and quaint. Also can take in some famous Shakespeare references, ie, R&J. Close to Verona are also Mantua, Padua, both small and quieter yet very pretty. Also between Florence and Venice is the gastronomic strip Emilia-Romagna with Bologna, Parma, Modena.\n\nYou will have to decide what appeals the most and pick regions to visit, but all roads point to Rome so definitely give it some of your time.\n\nTo the west you have Cinque Terre, similar beauty to Amalfi but a different pace."}, {"username": "Anna Conroy", "comment_text": "I would organize my travels following the Freccia Rossa (bullet train) itinerary.\nExample 1sr week\n.Milan close to Malpensa airport. Visit 1 or 2 days.\n.from Milan take the Freccia Rossa to Verona, spend at least 1 day there.\n. Next day same train to Venice. Visit Venice. Take local train to Padua and spend the night there (20 minutes from Venice) cheaper than Venice and easier to find rooms. There is a beautiful hotel right by train station.\nThe next day Freccia Rossa to Trieste.\nNot as popular, but really beautiful.\nBefore you leave Milan you could visit lake Como, also reachable by train in about 30 minutes.\n\nThe second week you could to Florence, Rome and Naples (Pompei) Freccia Rossa connects those 3 city.\n\nIt sounds like a lot of traveling,\nGive yourself time to rest, it’s a lot of walking, lots of art, lots of colture."}, {"username": "Esther Altamura", "comment_text": "My husband is from Italy born there and we go often. My so. Is there now. In 10 days, the must sees in my opinion are Rome, Venice, Florence. Usually they recommend 3 days in each place so you don’t get exhausted. Having said that, of course there is much more to see if you stay longer! I have never been there at that time of year-of course it will be cold but not like here. Get online and do all your research! I don’t think you need a planner, but look at reviews, reserve everything in advance , and double check everything. You will be fine. I have been all over most of the country, and there are always new things to see and do. My son did all the research online, but it helps that he speaks Italian and has family that he contacts to ask questions. Good luck and enjoy!!"}, {"username": "Susan Kerr", "comment_text": "I did it twice and loved it, Rome sorrento, positano, amalfi and capri, for the last 3 stayed in Sorrento, Sicily is beautiful I stayed in Marsala and day trip by train to castellamare de gulfo , I could have stayed there a few days, rented mostly like bed/bath/some had balcony ,all private , this was a while ago, we last went in 2015."}, {"username": "Judi Serwinowski Paternostro", "comment_text": "Following"}, {"username": "Kelly Peagler Myers", "comment_text": "We have an AMAZING travel agent. She didn’t break the bank or our budget! Did such an amazing job that our family decided to go with us to do a couples trip the end of September! I was very impressed with her. And we aren’t skimping on anything. 13 days-Rome, Florence, Sorrento, Almafi Coast, Venice & the Dolomites-hotel\nand air was $5338!! And we have amazing hotels."}, {"username": "Donna Butler Wolfson", "comment_text": "Five days in Rome, train to Tuscany and get a car in Chiusi and tour Tuscany for a few days, drive or train to Florence for remainder of the trip then fly out of Florence. Not sure how lively things are that time of year."}, {"username": "Caroline Gichard", "comment_text": "F"}, {"username": "Mae Vernon", "comment_text": "It is my understanding from reading on other travel sites that some bathrooms in Italy require a fee and don’t have toilet paper. Also, that the pickpockets are terrible this year to such an extent that they can easily access the bags which have safety features. Yikes!\nEDITED: I have not traveled to Italy this year. I am a member of Travel Fashion Girls and have READ many reports of safety issues in Europe which they have experienced. I have traveled to all seven continents and safety precautions and situational awareness should ALWAYS be a factor no matter where you are."}, {"username": "Kelly Cannon", "comment_text": "Youtube University. There are tons of videos on there for itineraries. Just search Italy in 10 days and whittle it down. It's fun to plan your own trips. Use Google maps to pin locations. And these FB groups are also a wealth of info. One suggestion off the top of my head is an open jaw flight. Fly into Rome and out of another city, like Venice or Milan. This will help save a travel day at the end of the trip. Just do your flight search for \"multiple destinations\" and play around with it. Google flights is a good one to use, and always book air/hotel/\ntrain etc. direct with the carrier. Have fun!"}, {"username": "Nancy Floreen", "comment_text": "If it’s your first time, I would fly into Rome , 3 nights there. ( make an early trip to the Vatican museum - everything in the world is there!) Late Train to Florence - 3 nights there, then train to Venice and fly home from there. Travel days are wearing and you need time to adjust to the time change. Book it yourself, and choose hotels near where you want to be. Make it easy on yourself."}, {"username": "Karen Ward", "comment_text": "We just recently got back from 3.5 weeks planned it myself, all the accommodation I did on booking.Com and we travelled by train, once we had arrived via plane, trains are amazing, used the Trainline app, flew into Milan, 2 nights, lake maggiore 4 nights, lake Garda 3 nights, Florence 4 nights, Rome 4 nights, and ended up at Sorento for the remainder of our trip travelling round the Amalfi coast , such an amazing trip, and not usually something we would do we usually let someone else take care of it , but it was definitely part of the adventure doing it ourselves 🥰"}, {"username": "Geoff Ward", "comment_text": "If you are foodies then Bologna is a must visit place."}, {"username": "Jody Patterson Padgett", "comment_text": "Repeating what others have said, Rome, Florence and Venice are must sees for your first trip. You could throw Pompeii in for a day trip from Rome but would be an exhausting day. I use Rick Steves Italy book as a guide for just about everything, hotels, restaurants, tours, etc.\nhe has never steered me wrong."}, {"username": "Cindy Corrigan", "comment_text": "I booked most of our tours using Viator.com -we were very pleased!!"}, {"username": "Janet Vingo", "comment_text": "Sienna lucca and the best matera"}, {"username": "Vinnie Munizza", "comment_text": "Look into Perillo Tours. Many options of different trips. They orchestrate everything, no stress, just enjoy."}, {"username": "Chad Kenney", "comment_text": "We went early summer and I highly recommend booking through Costco Travel. Costco took care of all the travel arrangements. Flight, airport transfer to and from, hotels, and trains to next destinations."}, {"username": "John Sampson", "comment_text": "Hi wherever you go in italy you are never far from great food or great sights.Decide which part of italy you want to see ,then depending on whether you are driving or not ,find a nice base in a smaller town in that area,its much more reasonable priced.then plan each day accordingly.i think it really depends on what you want as to which place you go..The North offers big cities etc. The middle big cities with some beautiful history.the South ,peace tranquility,..f\nood and drink is great everywhere."}, {"username": "Kate Goldberg", "comment_text": "Italy is a beautifully diverse country that we’ve visited many times. We don’t try and go from one end to another. Pick an area or two and spend some real time falling in love!"}, {"username": "Liz Walschleger Sinclair", "comment_text": "I need more information about what you both enjoy to make recommendation.\nAre you wanting to dig in & walk, walk, walk? Are you wanting to relax in beauty? Quiet or crowded?\nNo matter what, planning it on your own is the way to save!\nYou will love every minute in Italy!"}, {"username": "Joy Colby", "comment_text": "Have you looked into a cruise? It’s a nice way to see multiple places and not have to worry about food, transportation and where to sleep. We looked into options and ended up booking a 12 day cruise"}, {"username": "Michelle Sehorn Gabel", "comment_text": "Tripmasters.com is the site I've used to plan 2 European vacations. Enter the dates & cities you want to visit and the site gives you flight, hotel choices, transfer & train/air info along with required documents needed. Easy peasy."}, {"username": "Nancy Kaelin Smith", "comment_text": "Personally, I would do 5 night Rome and 4 in Florence. I love the south but if the weather’s not good you won’t enjoy it as much."}, {"username": "Kira Sama", "comment_text": "Hi who can help me I want work in Italy as a farmer"}, {"username": "Mery Jordan", "comment_text": "In September and October, the weather is great, and it isn't very crowded. You can spend 3 days in Rome, 3 days in Florence, and 2 days in Venice. You can explore these cities on your own and travel between them by train. From Florence, you can book a tour guide for a day trip to Tuscany. They'll take you to San Gimignano, Siena, and Pisa. This could be a good itinerary for your first time visiting Italy."}, {"username": "Mery Jordan", "comment_text": "In September and October, the weather is great, and it isn't very crowded. You can spend 3 days in Rome, 3 days in Florence, and 2 days in Venice. You can explore these cities on your own and travel between them by train. From Florence, you can book a tour guide for a day trip to Tuscany. They'll take you to San Gimignano, Siena, and Pisa. This could be a good itinerary for your first time visiting Italy."}, {"username": "Judy Bellinder Potilechio", "comment_text": "Florence Venice imalfi coast"}, {"username": "Connie Deiriggi", "comment_text": "Jemia Gregory"}, {"username": "Paula Andrea Rojas", "comment_text": "Marlon Rodriguez"}, {"username": "Bill Pullman", "comment_text": "I am planning a trip for October 2024. Worked with a very good travel planner for a while and built a nice interenary with hotels, private transfers, trains, tours etc. I then researched the costs myself at same places and found the planner had doubled the cost of what I could do myself. Needless to say saving $6000 USD I will do it myself and take a little more risk of being slightly inconvienced due to making small mistakes. Been to Italy 3 times and willing to make this more of an adventure in 5 cities over 3 weeks."}, {"username": "Linda Pitler", "comment_text": "Oh my god. Take away two days for travel so that leaves you 8. Rome 2.5, train up to Florence (90 minutes on the fast train), 3 days in Florence, which gives you a day to maybe head further into Tuscany, 2.5 in Naples. One of those days need to be devoted to Pompeii, it’s amazing. Train back to Rome to catch the train to FCO, or leave from Naples."}, {"username": "Amy Mashburn Pierce", "comment_text": "We went on a two week bus tour that was jam packed but we wanted to see as much as possible.\nOur favorites: Capri, Lake Como, Venice, Rome, Florence, Pompeii, Pisa.\nIf you don’t take a tour bus, definitely book through a travel agent. It’s free and can offer perks like upgrades and/or help if you have problems with anything."}, {"username": "Mickey Warhola", "comment_text": "We have always planned our own even our first trip to Italy; I would say Rome, Florence, Bologna, venice"}, {"username": "Susan Stowe", "comment_text": "I have always planned my own and have loved every trip! I recommend getting comfortable with checking train schedules on Trenitalia.com and Rome2Rio.com (for bus and ferry) and the unending fascination of Google Maps for both driving and walking routes. I've had endless hours of fun planning (and fantasizing about!) my trips. Read reviews on Booking.com and Airbnb.com and you can plan the perfect trip for you!"}, {"username": "Joanne Calabria Wysolovski", "comment_text": "Any suggestions on where to go for end of December that is not too cold ??"}, {"username": "John Cosenza", "comment_text": "I have been to Italy three times and top three Cities are Rome Venice and Florence. Not sure on weather in Venice in the winter but it was the most magical city."}, {"username": "Kathy Vogel", "comment_text": "We are traveling to Rome, Florence, and Venice 3 nights in each location with Insight Vacations. This is called easy paced and combines guided tours with free time to explore. I normally plan our own trips, but think this takes the guesswork out of transportation and hotels. We are also first timers."}, {"username": "Abe Michelson", "comment_text": "Venice & Rome are Absolute musts. With only 10 days. Probably Florence. You only need 2-3 days in Venice. 4 in Rome. If you could do 12-14 days. I would suggest it. You could do Day Trips from Florence to Sienna and other Tuscan cities. I realize money is tight. If ten days. 4 days Rome, 2-3 days Venice and Same for Florence. Italy is a country that requires lots of trips or one long one. If you can stretch your trip out 2-4 more days. I think you will be much happier."}, {"username": "Anel Van Zyl", "comment_text": "We only had 10 days and may not be able to return for such a family holiday again. So we squeezed in as much as we could: Venice (2)-train to Florence rented a car and slept just outside San Gimignano (2), Magione (Umbria)(1), Lake Bolsena(1), Rome(2) and Ravello (2). Planned it ourselves after learning all we could from this page and the internet. Loved the trip!! Although we did not see everything there was to see and did not do tours on purpose, we got a very good taste of Italy! Enjoy!"}, {"username": "Jonathan Catoe", "comment_text": "Sicily and Sardinia could be top on your list to fulfill all your vacation wishes."}, {"username": "Dena Gill Simard", "comment_text": "The first time we went, we saw Positano, Pompeii, Rome, Florence, Venice, Murano and Burano AND took a bus to the Lamborghini factory outside Bologna. The second trip, I took 6 friends and we did Florence, Cinque Terre, Sienna, San Gimingnano, and the Tuscan area. Heading back there in September with 6 more friends and doing Rome, Herculaneum, and the whole Amalfi Coast. The first trip told me how to revisit and we were only there 12-14 days"}, {"username": "Michael Widjaja", "comment_text": "I’d echo Rome-Florence-V\nenice with an option to visit Bologna,the train connections between those cities are plentiful"}, {"username": "JeriLynne Clifford", "comment_text": "So I’m gonna be that oddball that chimes in something a little different. We’d love Italy and are on our way back in September. My husband and I like to have more of a romantic vacation versus museum jumping through cities. We’d like to say at wineries in either the Longueuil region or Tuscany. Higher private tour guides to take us to wineries, cheese, factories, balsamic producers etc.\n\nOne of our favorite cities is Modena. We loved Remini. Of course, all of Tuscany and Turin."}, {"username": "Marjie De Villa Lorica", "comment_text": "We are going to Italy in September; 6 nights in Venice with day trips to Verona and Padua;\nthen 5 nights in Florence with day trips ( with a tour group) to Siena- San Gimignano-Chian\nti- Pisa; and to Cinque Terre.\n\nHave been to Rome ( 4 days pre cruise), Naples, and Taormina.\n\nLove Italy❤️"}, {"username": "Patricia Breh", "comment_text": "We did that exactly last year for my 40th. I wanted to be in Florence. We did 9 days: 3 in Rome, 5 in Florence and the last night back in Rome for the airport (early flight home).\nWe did day trips from Florence but since we had our teenagers, we wanted to take it slow and just enjoy strolling. It was their first time in a different time zone and the jet lag was real for them."}, {"username": "Candace Boutin", "comment_text": "Y’all are so helpful! Thank you!"}, {"username": "Claire Dowson", "comment_text": "We did a week in Rome last February. Weather was warm in the day, cooler at night. Pleasant to explore in those temperatures."}, {"username": "Peter Cetani", "comment_text": "Best time is may or late September."}, {"username": "Kim Kirsten NeeMeglic", "comment_text": "We’ve also got an anniversary trip planned\nGoing to do rome, florence and Venice this trip - maybe add lake como on the way up to paris by train.\n\nAnd save amalfi, sorrento, pompeii, matera etc for another trip in the future\n\nAlso doing Sicily with my sister next year as a sep trip.\n\nItaly has so many amazing and all so unique locations! Cant wait"}, {"username": "Margo Desjardins", "comment_text": "Are there any hotels or B&B with bathroom in the room for under 150e in Florence and Venice that are nice and in good location.."}, {"username": "Robin Kronick", "comment_text": "Depends what you want from the trip! Northern Italy at that time will be cooler than say Rome or Amafi coast ! There is so much to see in Rome; you could fly there and make that your base"}, {"username": "Gillian Porter Ricciardi", "comment_text": "I think it all depends on your intetests...."}, {"username": "Debra Indorato", "comment_text": "I planned ours. My husband took care of flights and trains. I took care of accommodations and tours. I made an agenda with some flexibility. We did book a private tour guide the first week in Sicily. I planned the rest with Rome, Florence, & Verona. We found some well appointed air b&bs ((only super hosts & highly rated). We read the Glam Italia books ahead of time which were extremely helpful. We are in the process of planning again for next spring and exploring more towns & cities now that we know what to expect."}, {"username": "Karen Lavoie", "comment_text": "We went last September for 23 days and planned it all ourselves over a few months. This allowed us to have a majority of the trip paid for by the time we went.\n\nWe are planning another trip for next May and have started watching YouTube videos of the areas we are visiting to identify where we want to go and what we want too see.\n\nWe also purchased a laminated map of Italy to give us a visual on distances from one location to another to help determine realistic times for travel to and from preferred locations. You cans use a dry erase marker in it to determine your ideal circle of travel.\n\nBe sure to purchase travel insurance too!\n\nHope this is useful! We really enjoyed the process!"}, {"username": "Frannie Kaplan", "comment_text": "The lazio area (Rome province, Frosinone province in the countryside and move south) are all affordable and easy by car, and they all have forgotten ettsucan and roma ruins. At that time of year it'll rain, you can do sagre and mostly eating and that's it..otherwise you can also just do sicily in 10 days"}, {"username": "Ken Lerch", "comment_text": "Making two assumptions: 1) you really mean “not feeling rushed,” and 2) you intend to return. Rome & Florence with a side trip somewhere in Tuscany. 4 days Rome, 1 day travel, 3 days Florence, 2 days side trip (ex. Siena, Lucca, SG)."}, {"username": "Sam Sabrina Haney", "comment_text": "We spent two weeks in Italy at the beginning of March in 2019 and the weather was great. It only rained for one afternoon in Florence which we spent inside at the Uffizi! Take advantage of the off season prices and fewer tourists. We are going again this fall. Can’t wait!"}, {"username": "Ian Beyer", "comment_text": "This seems to gloss over just how much terrain there is along the Amalfi coast."}, {"username": "Daisy Yoo", "comment_text": "It is a lot of work plan urself which I did and take me longer to plan bc it is not easy to get there and I want to really exp what I want to see , we have 14 days not include travel time and I do 5 days in Rome and 4 in Florence with 2 days side trip bc what we want to see in Florence needs 2 days (1 day just not enough for us) maybe u can do 5 days Rome and 5 days Florence and leave from Florence and that way u have 3 days day trips and not too rushed"}, {"username": "Tina Wheeler Verstrate", "comment_text": "Rome, Florence, Venice, and Bologna are my favs. No one seems to value Bologna, but the food and charming little town are amazing!"}, {"username": "Alicia Cox", "comment_text": "You can plan it for sure!\nNot sure about that time of year; April or early May might be better.\nSince you have never been, I feel Rome, Florence, Venice are prob must sees. That said, I would do Rome & pick a town in Tuscany - maybe Siena - & see Florence for a day trip & a few other towns in Tuscany - Siena, San Giamignano, Lucca, Volterre are all beautiful. A quick drive by maybe to Pisa. Tuscany is my absolute favorite."}, {"username": "Carol Taylor Tisdale", "comment_text": "If it were me. Fly into Rome and spend 4 nights. Train to Venice and spend 3 nights. Train to Florence and spend 3 nights. Train to Rome spend the night and get a flight out the next morning home. Your inclination might be to visit more cities but honestly - when you count travel days (and the checking in and out of accommodations)\nyou just don't have time to do each place justice and your memories can easily become a blur. We've done it both ways - crammed in places and taken our time to absorb and the later is far far preferable. Especially when you have to figure the first day or two you are jetlagged."}, {"username": "Olga Olga", "comment_text": "We been in Italy in the end of February begin of March - cinque terre and area by the sea was crazy cold, Lake como was very cold too, but Tuscany, include Florence and Sienna was perfect time - not so cold and not so many people"}, {"username": "Rose Anderson", "comment_text": "A lot will depend on you personally your preferences, desires, personality and physical abilities regarding travel. We were there for 14 days in July and the heat was absolutely unbearable. Your choice of timing I know will make a ginormous difference. We also tried to see as much as possible in that amount of time, and it was probably too much to do comfortably for us, but others might be fine with that. we were in Sorrento Amalfi, Pompeii Positano, Rome, Florence Cinque, Terre, lake como, Pisa and Venice. We did use a travel agent for some, and did some ourselves. Also some of the downsides of using the travel agent were that they did not book any Airbnb‘s which can be much less expensive and we had to have her revise some of the plan because she went way over budget. Our favorite hotel was actually one we found on our own. You have to consider whether you prefer a vacation of being or a vacation of doing and how much on the go you are willing to be when you decide how many places to visit. ￼ you’ll never be able to see everything no matter how long you stay. ￼ I think just accept that and enjoy the things that you do plan to see. ￼"}, {"username": "Lenora Bennett Mitchell", "comment_text": "Florence Dennis."}, {"username": "Maria Brozou", "comment_text": "Really easy to plan on your own. I would visit Rome Venice and Florence. The weather in February is cold."}, {"username": "Maria Hilding", "comment_text": "Personally I would skip Florence and Milano.\nI absolutely loved Verona and Rome"}, {"username": "Sheron Milliken", "comment_text": "I would do Venice, Florence and Rome as others have stated for 3 days each place. I would NOT do the Cinque Terre as someone suggested because it’s cold that time of year, many places are closed and there’s not much to do indoors in the CT if it rains. Book now for Venice if you plan to be there during Carnevale. I would also plan the trip on your own. With groups like this and 1-2 good guidebooks, you can easily plan and execute your first trip to Europe. Happy planning!"}, {"username": "Miyuki Kanno Paul", "comment_text": "Remember, your first/last day of each location will be the traveling days. Have at least 3 full days in each destination. Plan logistics by visiting from north to south, south to north, east to west, west to east, etc. Get a copy of Rick Steves Italy guidebook and start planning"}, {"username": "Sandra Zamora Guerrero", "comment_text": "We did 10 days last month. Venice, Florence & Rome. Best trip ever. We used an Italian travel agency that planned what we wanted and booked all our top notch hotels, transportation and entrance to the museums with a personal guide."}, {"username": "Joey Clark", "comment_text": "Planning the trip is half the fun!! Rick Steve’s Italy book as others suggested is very helpful. I agree with Rome, Florence (Day trip to Siena!!) and Venice at that time of year…CT and Amalfi were amazing in June but I don’t think they would have been as amazing in the colder weather."}, {"username": "Patrizia D'Arcangelo", "comment_text": "Hello, I am Italian. I advise you to visit a city in the North (for example Venice), a city in the center (beautiful Rome) and then a city in the South (for example Palermo). In this way you will see how different Italy is from North to South, even the people are different."}, {"username": "Chris Love", "comment_text": "I would spend 4 days in Florence, 3 days each in Rome and Venice. Or take a day off Venice if you must.\n\nUse the extra day in Florence to do a day trip in Tuscany. Visit a winery, Siena, San Gimignano…."}, {"username": "Marcy Wampler Renyer", "comment_text": "We did our first trip to Europe in June. We did not do Italy this trip. Rick Steves books were recommended by a friend and they made all of the difference! So insightful! “Europe through the Backdoor is a great one! It explains so much about Europe and what you need to do. He also has a website with different forums where travelers chime in and it’s very helpful! Best of luck! Enjoy the planning….it’s a lot of work but so fun!!"}, {"username": "Dann Hrusch", "comment_text": "I'm on board with many of the other comments. Fly into Rome, then train to Florence/\nTuscany, train to Venice and fly out from there. I'd recommend a 4-3-3 day distribution, or maybe 3-4-3 if you know you travel well and will be able to hit the ground running when you get to Rome."}, {"username": "Sharon Tiang", "comment_text": "Thanks for sharing of the map, I couldn't get this details map b4."}, {"username": "Shelley Phillips", "comment_text": "In my opinion 10 days is not enough time. We spent six full days in Rome last October and didn’t get to see everything. My top cities would be Rome, Matera, Florence, Venice and the Cinque Terra region. But then there is so much to do everywhere. Wherever you decide you’ll have a fabulous time."}, {"username": "Rose Man", "comment_text": "I would focus on one region. Milan, Verona, Venice, Lakes…"}, {"username": "Dennis Jones", "comment_text": "We just returned…our first time to Italy…9 tour days/2 travel days.\nWe did Venice, Florence, Rome, Sorrento…with half day trips to Pisa, Assisi, Pompeii, and Capri.\nWe used a touring company (Gate 1 Travel). We were very pleased with them and most likely saw more than we would have on our own…but, at times, the schedule was a little rushed.\nVenice was our favorite!"}, {"username": "Peach Panfili", "comment_text": "February is cold"}, {"username": "Elaine Hayes", "comment_text": "Florence! I will go back and spend more time there!!"}, {"username": "Claudia Castellini", "comment_text": "Hi, in that period of the year, I suggest you to stay in the south of Italy, wich is warmer.\nRome is a must, I think, and it worth spending there 4 or 5 days, then it depends if you want to rent a car or go by train… anyway the south of Italy is full of beautiful places!\nUnless you love high mountains and snow, so you could go ti Dolomiti!"}, {"username": "Rhona OConnor", "comment_text": "We did 1 day to travel, 1 day sightseeing, 1 day relaxing and just taking it all in, next day travelling to Bari for a week. Worked out well, we were not in the busy places that are madly crowded. We went to Bologna, Pescara and Bari."}, {"username": "Bob Dook", "comment_text": "Venice, Florence & Rome is tourist route 1 for first timers. 10 days is about right. It will be cool and low on tourist numbers, not bad things. The suggestion in one reply to include Palermo is an excellent one, not just because Sicily is special and really is the jewel in Italy's crown, but it offers a different perspective on Italy."}, {"username": "Allison Boccaccio", "comment_text": "Pick 3"}, {"username": "Dallas Rose", "comment_text": "Otranto and hire a car. Done"}, {"username": "Alexis Anderson", "comment_text": "I'm going next march for 10 days (I'm counting two of those days as travel) and we've chosen to do the Venice area and Florence area only. We will fly into Venice and we will fly out of Florence to maximize our time. We'll return again and visit Rome and Naples area."}, {"username": "Lorraine Garrity Shea", "comment_text": "Following"}, {"username": "Caterina Liquori-Culhane", "comment_text": "Globus has 13 day with same areas. Yes very busy but you see so much"}, {"username": "Annie Nelhams", "comment_text": "My family lived in Verona and I have visited in February often.\nThe weather north of Rome in that month can be very variable. Last February it snowed in Bologna.\nThe 2024 Venice Carnival will take place from 3 to 13 February 2024, so very busy (and expensive at that time).\nIf you want to hire a car in Northern Italy, you must carry snow chains and use as required between 15 October and 15 April"}, {"username": "Caterina Liquori-Culhane", "comment_text": "Amalfi is a must"}, {"username": "Bill Elias", "comment_text": "Is it 10 full days, or is it really 8 with two travel days? I’d stick with Rome and Florence with day trips to surrounding towns.\n\nDon’t feel that you have to see everything and go everywhere. As Rick Steves says, “Assume you’ll be back.”"}, {"username": "Margaret Palmer Blanton", "comment_text": "We were there March 11-19 this year and we had great weather. While it can be chilly at night, most days were not uncomfortable. We did a group tour geared toward teenagers and I will say, it was a whirlwind but we saw so much and now know where we would like to return. We flew in and out of Rome. We arrived at 8:30 on Saturday and stopped in Orvieto on the way to Florence. Had late afternoon and morning in Florence, with a trip to Pisa Sunday afternoon. Monday, drove to Verona (loved it) to tour around and then on toward Venice. We spent the 2 nights in Jesolo de Lido on the Adriatic rather than in central Venice. Tuesday was a trip to Murano and then on to Venice for the remainder of the day. Wednesday we headed to Assisi for one day/night. Was well worth the trip! Thursday we drove into Rome and made it in time for the Colosseum and Roman Forum tour and then on over to the Trevi Fountain and Spanish steps. Friday was the Pantheon and Vatican City with free time in the afternoon. Saturday we drove to Pompeii which was very interesting. We then flew out early on Sunday. It was a LOT of walking but so worth it! As others have said, you can stay in the cities and venture out from there and I would highly suggest that. If you are not going with a group, I would suggest getting your tickets early or doing the big sites with a tour group as you get in without standing in huge lines and it includes the entry price at a bill rate. We definitely have many more places to see!"}, {"username": "Shelby Musselman Dickman", "comment_text": "We’re doing 10 nights in April for our anniversary. First time to Italy/Europe as well. Flying in and out of Rome. 3 nights Positano, 3 nights Rome, 3 nights Orvieto, then final night staying by Rome airport for flight home. We looked into a couple travel planners; mainly to manage accommodations and private transfers between locations. I was surprised how much extra the cost was going to be going with a company. Both quotes I received were about 40% more than booking the same hotels and private transfers on our own. I’m still a little nervous planning it ourselves but saving over $4k was definitely worth it to plan ourselves!"}]}, {"id": "2199085930490485", "text": "PSA- I know most of us pay for everything by CC rather than exchanging euros. My word of caution: have cash or an ATM card! I got my first ATM card before we came (I’m 50 as of yesterday). We never use cash. While here in Italy, my 13 year old got an ear infection. The hotel had a doctor to come to us, but cash only and not cheap! Just FYI- things happen!", "link": "facebook.com/groups/1373361046396315/permalink/2199085930490485/", "likes": 5, "comments": [{"username": "Karen Dittman", "comment_text": "I agree. You need to have some euros or access to cash easily."}, {"username": "Pietro Adami", "comment_text": "How much did he/she charge?\n\nIf you need medical assistance in Italy, hospitals will provide for free or almost free, or you can try to call the nearest “Guardia medica” or “Guardia medica turistica”"}]}, {"id": "2199086830490395", "text": "Do we need to carry our passport everywhere with us or just a copy?", "link": "facebook.com/groups/1373361046396315/permalink/2199086830490395/", "likes": 5, "comments": [{"username": "Andrea Shelton", "comment_text": "Yes, it’s Italian law, and you’re caught in an emergency situation away from your hotel (and passport), a paper copy does nothing."}, {"username": "Ilene Tobey LaMalfa", "comment_text": "if you are with the tour group, you will not need it to check in to your hotel. The only time we needed it was if we were purchasing some thing that we had to claim for tax purposes original kept in safe and I did keep a copy just in case I was purchasing something."}, {"username": "Dunia Aldyni", "comment_text": "Just copy"}, {"username": "Robin Barbera", "comment_text": "Yes"}, {"username": "Anthony McClure", "comment_text": "Leave it in the safe at the hotel. If it is lost or stolen there are US Consulates in Florence and Milan, and Naples with the Embassy in Rome. All will help you get an emergency passport which is valid for any travel for a year."}, {"username": "Sandra Desmond", "comment_text": "Why would you need to carry your passport around ? You need a safe in your accommodation all EU citizens we have to show our passport checking in they document that themselves by putting it into their system"}, {"username": "Linda Dalelio Williams", "comment_text": "Snap a photo of it on your phone keep orig in safe"}, {"username": "Anthony Sperduti", "comment_text": "Do not carry your passport!"}, {"username": "Krissy DaRusso", "comment_text": "I carry my passport on me at ALL times!"}, {"username": "Larry Dash", "comment_text": "My copy is on my phone in a travel album. I never ever carry my passport on me. It’s in the room safe. And I’ve never been stopped by police in any country in Europe asking for it."}, {"username": "Harris Dee", "comment_text": "Traveled throughout the world … yes … avoid riots, protests and borders … u should be prepared"}, {"username": "Susan Salerno Brundage", "comment_text": "My grandsons were stopped in Rome and two policeman asked them for their papers. Took them to their car and ran the numbers. We always carry our passports"}, {"username": "Bronwyn O", "comment_text": "Legally it is required to carry valid ID (passport unless you’re from a EU member country) although many people don’t and likely no one will find out if you break the law - no one is likely to check. However, I personally would never consider going into another country and knowingly breaking the law, even if I could get away with it. I’m always surprised by the number of people that consider that OK."}, {"username": "Sibylle Stroessenreuther", "comment_text": "Take a photo of it on your van phone"}, {"username": "Joe LaLonde", "comment_text": "No, and you shouldn’t. A previous reply talking about passport checks is laughable. You need it to check into an accommodation and then stash it away."}, {"username": "Greg Baker", "comment_text": "We are from USA staying in Florence. When we got to hotel we were asked to present physical passport. However, on the day to day out and about, in our experience so far, you shouldn’t need it. If you make purchases that qualify for VAT refund the vendors we have bought from have accepted photo copy."}, {"username": "Aurora Sottovia- Arguiarro", "comment_text": "Aurora Sottovia- Arguiarro"}, {"username": "Anne Hoenig Steib", "comment_text": "At the train station, I saw police ask people for passports just last week. For some reason they skipped me, but they asked many people. I had mine."}, {"username": "Romina Lauretig Toscano", "comment_text": "Copy!\nIf you have an ID or driving license bring that one"}, {"username": "Leonie Abbott", "comment_text": "We are over here now doing tours . So we are on a cruise . They would not take a copy of your passport but would take your original drivers license."}, {"username": "Mohanad Saddik", "comment_text": "Of course no"}, {"username": "Kirsten Abrams", "comment_text": "It’s good to have at least a copy for certain purchases — might as well carry it with you."}, {"username": "Helene Kalfas", "comment_text": "We took a photo of them when we travelled Italy last week"}, {"username": "Serrano Rose", "comment_text": "Copy..save original in the safe"}, {"username": "Bob Lampo", "comment_text": "Copy"}, {"username": "Sonia Scotto Lubrano", "comment_text": "So legally, I believe yes. But, laws are bent a lot in Italy (I’m a citizen), so a copy is fine like 99.9% of the time. anywho… I have Italian issued ID so I obvi use that but before I got that, I never carried my passport. A copy, inside my international drivers license.\n\nThe risk of not carrying your passport far outweighs the risk of carrying your passport in my opinion. So I keep it safe at the hotel/my house. And in the 33times I’ve been here (for 2.5 months at a time) I’ve never needed the copy, real thing, or even my Italian ID. (It’s only my second year with it)\n\nYou’ll need it for VAT if you’re shopping though.\n\nOf course this is bias bc I’ve never needed it. If I did ever need it I’d have a diff story. But again, the risk isn’t worth it in my opinion"}, {"username": "Chasta Mercer Butler", "comment_text": "Here now, NO."}, {"username": "Luigi Albarella", "comment_text": "Police in train station asked to see them randomly."}, {"username": "Steven Ciochon", "comment_text": "You should carry it with you for it is the law but especially if you plan on taking the train or getting a hotel. I was asked for mine on the train and at hotels."}, {"username": "Dave Conroy", "comment_text": "Take a risk or follow the law. Check the law yourself or go with the opinion you like best from random people."}, {"username": "Michael Albertsen", "comment_text": "Are you a part of Schengen, then no, a valid ID should be sufficient.\nIf not, I would say yes, as I read the rules."}, {"username": "Michael Albertsen", "comment_text": "“For EU citizens and citizens of countries that have signed the Schengen Agreement, a valid identity card is sufficient as an alternative to a passport; Citizens from non-EU countries may enter Italy with a passport valid for at least three months after the planned date of departure from the Schengen Area.”"}, {"username": "Lucille Leblanc", "comment_text": "At a hotel in Florence they demanded the actual passport (no copies)…Venice hotel too …"}, {"username": "Vivien Paulik", "comment_text": "It can happen your hotel place in a safe place your passport and you go around with your copy."}, {"username": "Sophie Kousvos", "comment_text": "Most places want original no copies"}, {"username": "Sandra Maldonado", "comment_text": "I carry just a copy. Passport stays in the safe."}, {"username": "Kit Nader", "comment_text": "You need it for hotel arrival. Then you do not need it."}, {"username": "Gillian O'Callaghan", "comment_text": "I carried a copy when out for the day. For 2 museum visits in Florence tickets stated you needed your passport. However noone checked. Think staff at places have been overwhelmed by numbers."}, {"username": "Kristina Ruk", "comment_text": "Copy is not a document ;)"}, {"username": "Ian Beyer", "comment_text": "Carrying a copy everywhere won’t do you any good. The copy is just so you have an easier time getting a new one at the diplomatic mission should your passport become lost."}]}, {"id": "2199078970491181", "text": "Discover the everlasting beauty of Pisa and its iconic monuments! Pisa is one of the most famous cities in Tuscany, and it owes its fame to the legendary leaning tower, one of the most photographed monuments inआणखी the world.\nJoin us: https://nextstop-italy.com/virtual-tours/pisa-pearl-of-tuscany/\n\n#italygram #vacationmood #renaissanceart #italytravel #virtualworld #italyiloveyou #virtualtour #tuscany #tuscanytour #tuscanyitaly #tuscanyexperience #pisa #pisatower #leaningtowerofpisa #leaningtower", "link": "facebook.com/groups/1373361046396315/permalink/2199078970491181/", "likes": 10, "comments": []}, {"id": "2199078853824526", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2199078853824526/", "likes": 7, "comments": []}, {"id": "2197748283957583", "text": "How easy is it to buy a SIM card for phone in Rome?\nWe would likev Internet access on phone while in Italy, France and Europe.\nMobile access with our Australian phone too expensive.\n\nEDIT - thank you for all the advice.", "link": "facebook.com/groups/1373361046396315/permalink/2197748283957583/", "likes": 6, "comments": [{"username": "Noel Brumley", "comment_text": "Very easy, i use Ho which is a vodafone reseller, once you have an eu sim it works the same everywhere in the eu"}, {"username": "Marina Chester", "comment_text": "If you phone is unlocked, consider an eSim from Airalo.com"}, {"username": "Sam Mah", "comment_text": "Try getting a Lebara sim in Australia."}, {"username": "Benoj Varghese", "comment_text": "They sell Vodafone sims at the FCO airport in Rome. It was a lot easier than the eSims."}, {"username": "Simone Pfenninger", "comment_text": "Very easy. I recommend TIM Sim card, located just next to Vodaphone"}, {"username": "Alice Francesca", "comment_text": "Iliad is the cheapest."}, {"username": "Melissa Jane Brown", "comment_text": "I purchased a Euro Sim card here before I departed (they're based in Sydney).Purchas\ned it online and received it within a week. Popped it in my phone on the flight to Rome & worked fine. I had 12gb data for 2 weeks."}, {"username": "Heather Sechrist", "comment_text": "We used TIM. They were easy."}, {"username": "Nick Justason", "comment_text": "I have the same problem coming from Canada, absurdly priced. Been using this “e-SIM” you download onto your phone and can buy cheap data instantly. Can’t call/text but can use alternatives:"}, {"username": "Grace Scinto", "comment_text": "TIM Tourist Sim phone calls and data for a month for €15."}, {"username": "Ellen Edmonds-Wilson", "comment_text": "If you’re phone is compatible you can buy an eSIM before you leave and set it up so all you need to do it turn it on when you land. The Orange holiday eSIM allows for calls back to Australia as well as data plus its coverage across Europe is seamless. Some sims and eSims don’t work in all countries in Europe, but the Orange one has wide coverage. Worked great for us for two months, and you just top it up when you either reach the end of the plan time wise or get low on data."}, {"username": "Trish Heymer", "comment_text": "I used Vodafone while in Italy."}, {"username": "Miyuki Kanno Paul", "comment_text": "I walked into a TIM mobile store. Bring your passport for ID"}, {"username": "Nicola Amy MacDonald", "comment_text": "Vodafone €20 for a month 200gb of data. Great reception. I got mine downstairs of the Rome train terminal. This also includes calls and text. I called home to Australia with no issues."}, {"username": "Tony-Annette Unpingco Ada", "comment_text": "Vodafone has a booth at the baggage claim area at Rome airport that you can purchase a SIM card. Simple and very reasonable"}, {"username": "Ian Beyer", "comment_text": "It’s even easier now with eSIM."}, {"username": "Tania Davis", "comment_text": "Def airalo , working well on my Aussie phone"}, {"username": "Heidi Carrello", "comment_text": "I used Hola Fly E Sim, unlimited throughout Europe so worth it!"}, {"username": "Jenny Payne", "comment_text": "Very easy I use Tim company , go on line and research the cost as one time in Rome they wanted to charge me €50 & I wouldn’t pay as I know it’s about €20/25🌻"}, {"username": "Giovanni Pianigiani", "comment_text": "Please also consider where you're staying: if it's big cities only, any provider would do. But if you're staying in the countryside or 8n the mountains, you may want to check the actual coverage, TIM and Vodafone are generally the safest option in that case"}, {"username": "Lloyd Davies", "comment_text": "Windtre. Two months unlimited calls and 70 GB data. Great coverage in Italy and Croatia. Be careful that some SIM cards are data only. No calls. Please use a different travelling phone. You will need your Australian phone and OZ SIM to receive texts from your bank for validation of credit card transactions. Have fun."}, {"username": "Alanis Wieckowski", "comment_text": "Thanh Nguyen"}, {"username": "Leisa Davis", "comment_text": "Im from Brisbane travelling in 6 weeks time. I have already purchased my esim from Sims Direct, they are an Australian company.\nNo need to take your SIM card out with an esim and you can retain your phone number."}, {"username": "Ryan Monahan", "comment_text": "Arrived at Rome airport June 26, bought 2 SIM cards from a booth for €25 each. 70gb plus text and talk. Worked great for our 16 day trip."}, {"username": "Renee Rundle Stoneham", "comment_text": "Very easy. Store are at the airport. Get a 30 day one that covers EU. Usually they are about 20-30€ for about 15-20GB.\n\nHowever, I bought one from Amazon before I left because I needed Switzerland as well as EU. It was a 3 SIM a UK company. Worked great! 15 days and using maps constantly only used about 5GB. Seamless from country to country. The app was easy etc. alerts and directions are in English.😉\nMy husband got one at the airport in Madrid and all his alerts etc were in Spanish.😂 They set it up for him and it worked great too. (Not in Geneva)"}, {"username": "Plane Shummer", "comment_text": "I just bought a vodaphone in Rome. No issues."}, {"username": "Jules Earl-Rossiter", "comment_text": "Go for a Tim SIM.... they are excellent... you can buy one from any Tim shop in Italy.... they do a tourist SIM which is 14.99 euro's it lasts for 30 days and it comes with 50 gb data and 200 minutes...🙃"}, {"username": "Monique Swanner", "comment_text": "Super easy! We bought a sim at the Tim's store (they're located all over) and for 35 euros it's perfect for up to 1 month"}]}, {"id": "2197775457288199", "text": "Recently returned from a trip which involved 9 days in Italy. Part of the time was on a cruise with 3 nights in Rome. We visited Genoa, Livorno, Siena, San Gimignano, Messina, Caserta, Pompeii and Rome. Weआणखी enjoyed each stop. Some of my highlights We the Monumental Cemetery of Staglieno and a visit to Santa Maria di Castello (where we took the free tour of the monastery) on our stop in Genoa, the beautiful Palace of Caserta, Pompeii (my 3rd visit and it still amazes me), the Scavi tour to St. Peter's tomb, the rooftop views from the top of the Vittorio Emanuele II Monument and an ebike tour of the Appian way/aqueduct park.\n\nWe managed to avoid many of the crowds, but couldn't avoid the heat. That didn't stop us though. Advice, stay hydrated, take breaks from the sun (we sought out shade, museums, churches and restaurants when necessary), wear a hat, use good sunscreen.", "link": "facebook.com/groups/1373361046396315/permalink/2197775457288199/", "likes": 39, "comments": [{"username": "Margie Williams", "comment_text": "Gorgeous photos! You took me there."}, {"username": "Dawn Clark Schollin", "comment_text": "What cruise did you take?"}, {"username": "Gayle Moores", "comment_text": "Beautiful photos! Thanks for sharing!"}, {"username": "Laurafloyd Sheryer", "comment_text": "Great photos doesn’t look very busy!!"}]}, {"id": "2198090430590035", "text": "I hope to return one day! Venezia ❤️❤️❤️", "link": "facebook.com/groups/1373361046396315/permalink/2198090430590035/", "likes": 51, "comments": [{"username": "Marie Cuzzi", "comment_text": "💕💕💕💕"}, {"username": "Chantal Campeau", "comment_text": "Me too!💖"}, {"username": "Cindy Gleason Traugott", "comment_text": "I do too!"}, {"username": "Ken Vecchia", "comment_text": "Venice?"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2198717940527284", "text": "Hi is it safe for a woman to go out to dinner in Florence on her own? Edit - Thank you for your posts. I’ve been to Italy before but never had to dine out at night but I’m sure it’s very beautiful at night. I’m excited about it. Not sure why but comments were turned off. Maybe there were some smart comments.", "link": "facebook.com/groups/1373361046396315/permalink/2198717940527284/", "likes": 27, "comments": [{"username": "Maria Coladangelo Ducca", "comment_text": "Yes . Go to trattoria/ ristorante on the main thoroughfare . Buon appetito. Try asking the hotel for a recommendation"}, {"username": "Laura Sinawski", "comment_text": "Yes. I did. I never felt unsafe anywhere in Italy (although parts of Naples was a bit shady)."}, {"username": "Linda Chase", "comment_text": "Yes! Enjoy!"}, {"username": "Pearl Lucero", "comment_text": "Of course"}, {"username": "Nana Esther Bertolino", "comment_text": "Be careful, traveling alone ."}, {"username": "Rose Wolschlager Hinman", "comment_text": "At night time when I went out to eat, I never felt unsafe I stayed close to the area where I was staying."}, {"username": "Marissa McLean", "comment_text": "Italy is not a dangerous country for solo women…. I’ve been there four times on my own since 18 years old"}, {"username": "Ken Lerch", "comment_text": "Yes"}, {"username": "Muhammad Arslan", "comment_text": "don't worry go anywhere not problem all is yours"}, {"username": "Chris O'Brien", "comment_text": "Yes"}, {"username": "Maureen Rebello Hagerty", "comment_text": "Why wouldn’t it be?"}, {"username": "Christy Waldner", "comment_text": "Definitely, we are here now and it is one of the most safe-feeling places we have traveled. We are a mom and daughter-also don’t listen to anyone that says it is a silly question. It is smart to be aware of the risks when traveling alone - especially as a female."}, {"username": "Miyuki Kanno Paul", "comment_text": "Absolutely FINE❣️"}, {"username": "Gregory Hawkins", "comment_text": "Always be careful when going out alone. Stick to the main roads and all should be well! There are tons of places to eat all over Florence! Enjoy!"}, {"username": "Kathleen Sidary Couvillion", "comment_text": "My sister has traveled alone throughout Europe, Italy frequently, for decades and has never had one problem."}, {"username": "Nancy Margaret", "comment_text": "Absolutely!"}, {"username": "Carol Johnson", "comment_text": "Yes I just did a 3 weeks in Europe . Try Novella Osteria Toscana , Katy & Davide is the best hosts. Great food, people watcher I call the Restaurant the gate way to Florence because of it location"}, {"username": "Annie Nelhams", "comment_text": "Absolutely- as a solo traveller I just check there aren’t any ‘no-go” neighbourhoods.\nJust walk confidently and take a book or a magazine to read while your waiting for your wine! Enjoy"}, {"username": "Darlene Darlene", "comment_text": "I’ve went to Italy twice by myself. You will be fine. Don’t worry, just have a good time!! 🇮🇹"}, {"username": "Sandra Leigh Gunnels", "comment_text": "definitely ! but be smart"}, {"username": "Dimity Betar", "comment_text": "Nope 👎 stay inside"}, {"username": "Debbie Potter", "comment_text": "I'm gonna say no...BUT stand your ground and be aware of your surroundings and what's going on around you... but that rule applies also to anywhere you go."}, {"username": "Jonathan Kancir", "comment_text": "😬 there’s a risk you may have a great time 😬"}, {"username": "Gillian O'Callaghan", "comment_text": "I did it 10 times solo.....absolu\ntely no issues....and 10 lunches."}, {"username": "Jolie Carbone", "comment_text": "Yep it’s safe! Generally Italy is safe just don’t go into isolated areas. Stick to the more frequented parts of any town"}, {"username": "Em Marie", "comment_text": "🙌 to all you beautiful people who simply answered the question without judgement 🥰"}, {"username": "Dalia Abrahami", "comment_text": "Yes"}, {"username": "Kim Accardo Dunn", "comment_text": "VERY GOOD QUESTION ! I'm from New Orleans and I can tell you that I would not want anyone, male or female to be walking the streets alone, especially at night ."}, {"username": "Dianne Rios", "comment_text": "Yes absolutely"}]}, {"id": "2198747810524297", "text": "Debating whether to cruise around Italy and Croatia …vs 2 week inland tour …cruise on Viking", "link": "facebook.com/groups/1373361046396315/permalink/2198747810524297/", "likes": 0, "comments": [{"username": "Sandy Hookerman Kriger", "comment_text": "Not Viking! Inland tour is more interesting."}, {"username": "Peach Panfili", "comment_text": "Croatia is fabulous - base yourselves in Trieste (which is where many of the cruise ships that have been banned from Venice now dock) and you can have the best of both worlds - 2 hours to Venice by train 1.5 hours to gorgeous Ljubljana capital of Slovenia then explore the Istrian peninsula and Dalmatian Coast."}, {"username": "Joanne Atkin", "comment_text": "Cruise around better"}]}, {"id": "2198748113857600", "text": "I booked this guest house for our trip next summer based on reviews. We arrive at Marco Polo Airport around 10:30pm (trying to change to earlier arrival flight). What is the easiest way to get to the locationआणखी on this map? Can I take a water taxi to somewhere close? Looking for the most convenient way to get there (3 people and 3 suitcases with backpacks). Thanks!!!!", "link": "facebook.com/groups/1373361046396315/permalink/2198748113857600/", "likes": 5, "comments": [{"username": "Mary Skvarch", "comment_text": "Water taxi is the easiest, and worth the expense if this is your first time."}, {"username": "Heather Hills Jacobs", "comment_text": "Get your guide will help you!!! Great app!!"}, {"username": "Miyuki Kanno Paul", "comment_text": "Closest dock is S Zaccaria"}, {"username": "Marissa McLean", "comment_text": "I would maybe call the hotel you’re staying at and ask if they have any suggestions on water taxi or hotel shuttles"}, {"username": "Ilana Brongiel", "comment_text": "I literally just changed my flight to get in at 11:45am so I feel better about this now. Thanks for those who responded!"}, {"username": "Eric Maurer", "comment_text": "It's about a 4 minute walk and one bridge from San Zaccaria. We were picked up here last week but I'm not sure it's much closer and you would have 2 bridges."}, {"username": "Rachael Richardson", "comment_text": "We got the Alilaguna from airport to San zaccaria late at night - not sure what time last boat is €15 each"}, {"username": "Lisa Adams Robertson", "comment_text": "We will be staying there, too. I think they provided directions in the confirmation email."}, {"username": "Lisa Adams Robertson", "comment_text": "It was on their website, not in the confirmation email."}]}, {"id": "2198748520524226", "text": "How far in advance would you book flights to Rome? (I am travelling from Phoenix, AZ not that that matters but may be worth mentioning, idk)", "link": "facebook.com/groups/1373361046396315/permalink/2198748520524226/", "likes": 9, "comments": [{"username": "Rhona OConnor", "comment_text": "Once you decide you are going. Flights get released about 12 months in advance."}, {"username": "Lucrezia Folger", "comment_text": "When you find a great price, book."}, {"username": "Melanie Matthews Stuprich", "comment_text": "I’ve been told to wait for the 2 month window before flying but it really depends on time of year but I’ve never done side by side comparison. 🤷🏽‍♀️ Use google flights and it will tell you how the price is comparable to that time of year in the past."}, {"username": "Diane Davis Lawyer", "comment_text": "I booked in March for a September trip. I bought refundable tickets (which do cost a little more.) I then set up a google flight alert in case cheaper tickets came out, I could cancel without penalty and rebook at a lesser cost. So far, our tickets have been the least that have come up, other than longer flights or more layover."}, {"username": "Alice Francesca", "comment_text": "If you are visiting Rome avoid july and august.we Italians always go visit the città d'arte (cities of Art) in the middle seasons: from September to late October or April/May.\nRome is beautiful around Xmas too and not too cold"}, {"username": "Alice Francesca", "comment_text": "Ps been to AZ twice and love it!"}, {"username": "Eleanor Marie Marschall-La Rosa", "comment_text": "At least 6 months in advance if not earlier!\nEarly Tuesday morning seems to be the time for cheaper flights!"}, {"username": "Lisa Valdovinos", "comment_text": "We booked 9 months in advance."}, {"username": "Felicia Melo", "comment_text": "We booked 8 months in advance only for our flights to be changed a month later ☹️. We ended up having to cancel the old flights and rebook new flights, so maybe like 5-6 months is good."}, {"username": "Casarine Temple", "comment_text": "We booked 10 months in advance ."}, {"username": "Janet Canter", "comment_text": "I was looking at airfare last January for a trip to Italy. I wish I had booked then. When I finally booked it in April it had doubled in price for my October trip. Book as early as you can."}, {"username": "Bill Casper", "comment_text": "9-12 months before."}, {"username": "Renae Larcus", "comment_text": "As soon as you can. If you find a good price book it."}, {"username": "Dann Hrusch", "comment_text": "Start checking prices as soon as they are available for your dates (~12 months out). Set a price point for yourself and keep monitoring until they fall close enough to what you're willing to pay. Play with your dates and destination airports too. I usually end up booking in the 6-8 month range. For PHX to FCO, I think $800 would be a good target."}, {"username": "Patrick Evans", "comment_text": "I booked in November for the following June."}, {"username": "Marjie De Villa Lorica", "comment_text": "8-10 months in advance.\n\nBooked in January from DFW to Venice for a September trip for about $900++.\nSince May- same trip costs ~ $1,500 or more!"}, {"username": "Bambi Harris", "comment_text": "I booked 9 months in advance (January for September) got flights for 707 direct round trip from chicago"}, {"username": "Rose Oliver", "comment_text": "I booked in oct for a July 1 trip"}, {"username": "Susie CB", "comment_text": "Use google .com/flights…. You can track when flight prices go up and down….. in 2019\nI flew for $450 Denver to Rome … 1 stop in Detroit… Delta …. Mid-April"}, {"username": "Kathryn Meltzer", "comment_text": "As soon as possible! Tickets were cheapest 12 months out, and the price just continued to rise"}, {"username": "Lisa Quinn", "comment_text": "Set up a flight alert on your computer or phone."}, {"username": "Lorene Vallish Phelps", "comment_text": "Today is good…"}, {"username": "Lisa Martinson", "comment_text": "As soon as they are available"}, {"username": "Anna Gambino", "comment_text": "I just booked for next April. Usually I book 8-10 months before. Cheaper sometimes if you book in advance and I book early because I want direct flights when possible. That said, I have had the experience twice on United where they changed the configuration/\ntype of plane as we got closer to the dates and also changed my seats! Not great when you are flying with friends/family and you intended to sit together so keep an eye on it once you book."}, {"username": "Angela Casanave", "comment_text": "We booked last month for a trip in November"}, {"username": "Jen Alexitch Rachow", "comment_text": "Im going in November and I booked in May."}, {"username": "Shamra Archer Coposky", "comment_text": "Download the Hopper app. It tells you the best time to book!"}, {"username": "Janice Rea", "comment_text": "As early as possible."}]}, {"id": "2198750203857391", "text": "We are travelling with 2 kids(8 and 12). Arrive by train to Venice mid afternoon, have full next day and have to leave for Trieste late the next morning. Looking for recommendations of hotel that is in central location and what tours etc we should highlight with such a short time. Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2198750203857391/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.kqzyfj.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187870-d9075\n63-Reviews-Mais\non_Venezia_UNA_\nEsperienze-Veni\nce_Veneto.html"}, {"username": "Dave Colleen", "comment_text": "Hotel Moresco is a 10 minute walk to train station. We love that hotel. They offer a great breakfast, happy hour, and so much more."}]}, {"id": "2198752467190498", "text": "Going to Italy next week. Is the Vatican/St. Peter the only place where you need to cover knees and shoulders? Or is it in all churches?", "link": "facebook.com/groups/1373361046396315/permalink/2198752467190498/", "likes": 5, "comments": [{"username": "Jane Coutts", "comment_text": "Duomo in Florence you do and st marks in Venice you do"}, {"username": "Lora de Vries", "comment_text": "It´s respect for the Church and people praying inside, so all Churches no matter where, in general."}, {"username": "Cecilia Christine Costantini", "comment_text": "All Churches, but at bigger ones (San Pietro, San Paolo, Santa Maria Maggiore) there might be people actually checking. Bring a big (and light) shawl and use it like a sort of sari to cover both shoulders/\nknees when you get in, remove when you get out"}, {"username": "Frances McDonagh", "comment_text": "Most churches out of respect Bologna, Florence, Venice etc"}, {"username": "Nancy Margaret", "comment_text": "Go first thing in the morning or be prepared for massive lineups in extreme heat."}, {"username": "Debbie Lavitt", "comment_text": "All churches! It’s a matter of respect."}, {"username": "Jordan Messina", "comment_text": "respectful clothing"}, {"username": "Jennifer Gustafson", "comment_text": "All churches. We wore sundresses below knees and brought a shawl with."}, {"username": "Gilles Laplante", "comment_text": "…it’s a joke…only in mosquée"}, {"username": "Eric Maurer", "comment_text": "Technically all churches but smaller ones are less likely to have someone at the door checking. As long as shorts aren't super short you will probably be ok."}, {"username": "Shane McClain", "comment_text": "All churches"}, {"username": "Patricia Anne McMahon", "comment_text": "Shoulders in all churches"}, {"username": "Paul Handley", "comment_text": "All yes"}, {"username": "Jeht Jeht", "comment_text": "The coverups of the Catholic Church are beyond exceptional!! 🙄"}, {"username": "Heather Gianoli-Hinkley", "comment_text": "Thank you everyone!!!!"}, {"username": "Linda Snaring", "comment_text": "All churches"}, {"username": "Anne Moore", "comment_text": "Just do it for all, show a bit respect in another country"}, {"username": "Nana Esther Bertolino", "comment_text": "All churches, for respect."}, {"username": "Michelle Cotoni", "comment_text": "All churches"}, {"username": "Sandra Zamora Guerrero", "comment_text": "All churches. It’s a sign if respect."}, {"username": "Sandy Radican Shikaly", "comment_text": "All churches"}, {"username": "Sigrid Cormier", "comment_text": "And I’d like to suggest you drop a couple € into the candle box/ or if they have a donation box.\nWith the amount of tourists coming through it helps offset their cleaning and utilities costs."}, {"username": "Susan B. Corino", "comment_text": "For visiting churches wear a sundress & bring a shawl - easy to wear, light to pack, the weather is hot. You’ll be fine"}, {"username": "Ken Lerch", "comment_text": "When you go into a church in the US how do you dress? Pay the same level of respect, if not more, to your host country."}, {"username": "Michael Barnes", "comment_text": "Most churches."}, {"username": "Marthese Briffa", "comment_text": "Respect is in all churches. No matter which religion."}, {"username": "Billy Nash", "comment_text": "I spoke to someone yesterday in Rome and said Vatican was so incredibly crowded they left. Lines down the street with hours and hours of waiting time in blistering heat. If your not getting a private VIP tour, best to visit in the fall."}, {"username": "Nancy Woods", "comment_text": "All churches"}, {"username": "Stacey Byerley", "comment_text": "For myself, out of respect I covered for any religious place. I'm atheist, don't believe or agree with most religions, but it's still important to show a level of respect to these places and their reason for being."}, {"username": "Paola Zirpola", "comment_text": "All churches"}, {"username": "Shiundu Shaushi Fridah", "comment_text": "Safe travel"}]}, {"id": "2198752493857162", "text": "I’d love to make a comment/request.\nThere are some really beautiful photos of places people are posting and it would be so great if under each photo, there was a comment of where the photo was taken. Be it a restaurant, a street of a town etc and some fabulous photos with amazing views, a comment where that was taken from would also be of so much help.\nJust thinking out loud…..🌸🌸", "link": "facebook.com/groups/1373361046396315/permalink/2198752493857162/", "likes": 9, "comments": []}, {"id": "2198756293856782", "text": "There are no words as to the beauty of Positano, we stay in a beautiful villa, then headed to Rome. This group was very helpful in planning my trip.\nIt was extremely hot, but we made do, knew going in July it was going to be.\nThe stairs in Positano are NO joke!\n￼#PositanoRomevaction2023🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2198756293856782/", "likes": 54, "comments": [{"username": "Dana Birdwell Shofner", "comment_text": "Where did you stay in positano?"}, {"username": "Miyuki Kanno Paul", "comment_text": "Not just Positano but the entire Amalfi coast is vertical. So is Matera in Basilicata. Locals both young and old are used to it😉"}, {"username": "Rachael Richardson", "comment_text": "We just visited positano for a few hours , was packed beach was small and about €50 sunbed didn’t think it was worth staying there , liked sorrento better, ,views are amazing though"}, {"username": "Courtney Soloff England", "comment_text": "I'll be there in one week and I cannot WAIT!!!!!!!!!!!\n!!"}, {"username": "D Rochelle Milton", "comment_text": "Sy Sandblom"}]}, {"id": "2198758047189940", "text": "Just got back to the States after ten lovely days in Italy. I went to fill up my water bottle and legitimately spit it right back out. I miss those running fountains and pure water all over Italy! Did anyone else experience this? Our water literally tastes like chemicals/metals!", "link": "facebook.com/groups/1373361046396315/permalink/2198758047189940/", "likes": 43, "comments": [{"username": "Maria Ariano", "comment_text": "Yes, it does."}, {"username": "Cecilia Christine Costantini", "comment_text": "Yes, when I go back to southetn Spain where I live I am so sad! I love tap and fountain water in Rome! I remember when I moved to California as a teeanger I was so shocked to realize tap water didn't taste good!"}, {"username": "Brian Marcus", "comment_text": "We are departing now and will miss the Nasone!"}, {"username": "Miyuki Kanno Paul", "comment_text": "We use Zero Water pitcher to filter tap water. Your life is never the same after returning from Italia😘"}, {"username": "Janie King Boyd", "comment_text": "Agree! Also now disappointed with Italian restaurant chains here in the States-used to be my favorites. Lol"}, {"username": "Stacy Alexander-Nevells", "comment_text": "The best water ever in Italy!!!!"}, {"username": "Nicole Tucker", "comment_text": "I love the free fountains whenever I'm in Rome! Nice and cold and pure."}, {"username": "Maria Coladangelo Ducca", "comment_text": "Yes it does."}, {"username": "Mary Fornataro", "comment_text": "The food wont taste good either."}, {"username": "Julie Norris", "comment_text": "Same but with Australian water after Italy"}, {"username": "André Carrazzoni", "comment_text": "André Carrazzoni"}, {"username": "Starla Dawn", "comment_text": "It's because it is. Our food is full of non food junk too here in North America."}, {"username": "Roger Pajo", "comment_text": "That water was awesome"}, {"username": "Rasha Za", "comment_text": "Use a filter at home!"}]}, {"id": "2198759127189832", "text": "Can anyone recommend a driver or service that they have personally used in Milan?", "link": "facebook.com/groups/1373361046396315/permalink/2198759127189832/", "likes": 0, "comments": []}, {"id": "2198765187189226", "text": "Heading to Rome next week with daughter and son. Villa Borghese area. I’d love to surprise my daughter with spa treatment or even mani/pedi. Any suggestions close by? if not in Villa B other areas are fine where I can be close by? Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2198765187189226/", "likes": 0, "comments": [{"username": "Lora de Vries", "comment_text": "Maybe ask your hotel for a recommendation before you go over to Rome?"}]}, {"id": "2198765387189206", "text": "I’ve been going back and forth trying to decide between carry on VS checking bags for an 11 day trip to Italy for 2 people. We only have 1 connecting flight so is the risk as high for losing luggage knowing that?", "link": "facebook.com/groups/1373361046396315/permalink/2198765387189206/", "likes": 48, "comments": [{"username": "Jen Alexitch Rachow", "comment_text": "Carry on. For 11 days it can be done! I did 5 weeks with a carry on and a backpack- including lightweight parka! Lots of tips on line of what and how to efficiently pack a carry on. Then pack and extra bag for purchases. On the flights back pack your clothes in the extra bag and check it and being your treasures in the carry on."}, {"username": "Renata Shepherd", "comment_text": "Over summer season definitely only carry on bags"}, {"username": "Debbie Reed", "comment_text": "If you are not a ‘high maintenaince’ traveller (curling wand, lots of cosmetics etc) carry on is the way to go for ease and comfort. On our last 3 week trip to Italy, partner and I had all we needed and certainly didn’t look like hobos."}, {"username": "Antonietta Diblasi-Peterson", "comment_text": "Carry"}, {"username": "Diane Davis Lawyer", "comment_text": "The problem is more with the weight allowance of a carry-on for 11 days than how much you can fit in the carry on. Shoes are my nemesis. LOL. I could fit everything in a carry on if need be, but the weight is going to exceed the allowance for me when the carry-on itself will weigh 6 or so pounds of the allowable weight. Sigh."}, {"username": "Brenda Posey Simon", "comment_text": "My husband and I do carryon since we will have multiple stays over 2 weeks. Easier for trains, steps, taxis. It seems difficult to do but we pack for a week and have laundry done (if available) or pop into a laundromat (so efficient and inexpensive)! of course travel size necessities! Both pack a foldable tote for the return to put our dirty clothing in and then use our carryon luggage for any purchases. We check all bags on the return flight."}, {"username": "Jessica Thompson", "comment_text": "I always do a mix of both. I check a bag with clothes and the non essentials that I travel with …things I don’t absolutely HAVE to have. And then I always carry on a totebag with my laptop & phone and chargers, and a roll aboard with toiletries, supplements, and about three days worth of clothes. If my luggage goes missing, or if I get delayed or diverted, I’m not uncomfortable …and if my luggage is lost completely, I can still survive on a two week trip and also get to where I can get a few more pieces of clothing if I have too. I’ve been doing it this for decades now and it helps out in a jam (delays or lost luggage), but most of the time, my non-essentials and remaining clothes make it."}, {"username": "Adriana Sormani", "comment_text": "Believe me… do carry on…"}, {"username": "Tracy Wrinn Mcdermott", "comment_text": "I’ve done carry-on only for over a decade. I always travel for at least 2weeks. It’s not just to avoid lost luggage. It’s easier to fit it car rentals, to carry through cobblestone streets, up lots of stairs, and on and off trains and ferries. I never find the need to wash (except maybe some intimates). Pick lightweight fabrics like linen, lots of tees & tanks, and roll tightly. Ultimately it’s up to you, but I love the ease of it."}, {"username": "Jocelyn Pettitt", "comment_text": "I just returned from Italy last week and we all had a checked in bag plus a carry on back pack. It was fine, I even had to buy another bag to check in for the items we bought. If you are concerned, you can buy trackers from Amazon for less than $20. I guess it depends how you like to travel, but I needed my suitcase and used my backpack for my day trips. I had trackers in my suitcase in case anything was ‘lost’."}, {"username": "Tanzia Samad", "comment_text": "R u going to Positano ? Then it makes sense to do only carry on and duffel bag . I’m here now & you will sweat & get your clothes dirty & very wet . Unless u plan to wash your clothes & your accommodation has a balcony or washer dryer , I don’t see any reason why you shouldn’t bring a suitcase"}, {"username": "Jennifer Gustafson", "comment_text": "We did 18 days with a carry on and backpack. We did laundry where we could."}, {"username": "Eden Seery Thornton", "comment_text": "Put some of your clothes in husband’s bag and vice versa. Also put a change of clothes or two in your carryon. That way if your checked bag is lost or delayed you’ll at least have a few outfits each plus your essentials."}, {"username": "Maria Angela Perrone", "comment_text": "My suggestion is to take a carry on, but put inside a folding duffel bag, for the way back.\nDon't take too much stuff with you. Expect to buy stuff over there."}, {"username": "Karen Aldrich DeMonte", "comment_text": "We did 15 days with a carryon and backpack. We did laundry half way through the trip. It made it easier for train travel between cities."}, {"username": "Crystal Waltz", "comment_text": "My daughter used an air tag for her checked bag. It was very handy as she always knew where it was. Both our bags made all our connecting flights, but it was nice for her to know hers made it before even checking the carousel."}, {"username": "Nancy Amato", "comment_text": "I always check"}, {"username": "Stacey Lynne Fatalo", "comment_text": "We did carry on for 8 days in Italy and had to check mine and my daughters due to being over weight. I used AirTags for peace of mind and we did have a layover and I could ‘watch’ our bags being loaded onto the connecting flight. I know there is always a risk that something can happen but when we go back I plan to just check a bag."}, {"username": "Sue Morgan", "comment_text": "Pack a soft carry on or rollerboard w/ a couple days clothing for each of you. If you each pack one checked bag, divide it in half so if one should get lost, you each have clothing. when the suitcases do arrive, you can repack his and hers."}, {"username": "Catherine Stanley", "comment_text": "Went to Italy for 10 days with one connection and priority tag on my luggage, list it for 4 days!!!!"}, {"username": "Kathy Smith", "comment_text": "I just got back from 12 days in Italy. We were in Rome, Naples, Ischia, Capri and Amalfi coast. I regret overpacking. I could have gotten away with each having a roller carryon and a back pack. I checked one full size suitcase. It wasn’t a big deal but lugging on the train just made more work and didn’t wear a good amount. However, it wasn’t a huge burden so if you feel you need them just take them."}, {"username": "Irene Oda", "comment_text": "When are you traveling? We travel to Europe every year. Different airlines, sometimes multiple layovers, including one situation where our luggage arrived a day before we did ( long story). Never had trouble. Not saying it doesn't happen. I always make sure I have multiple days of clothes as a back up just in case in our carry in. In Italy it's very hot. We change and shower more than once a day. I'm sure you can wash your clothes everyday and only need a carry on. It's up to you."}, {"username": "Kathy Flood", "comment_text": "Check!!."}, {"username": "David Williams", "comment_text": "We have always checked bags before but are going to try carry on only for a trip across the US in a couple of weeks. As a general rule we overpack anyway so this will force us to downsize.\nOn a trip last year it took 90 minutes for the luggage to reach the claim area from the plane for everyone in the flight. We had air tags so knew the luggage was there but it was approaching midnight and had better things to do then wait for our bags."}, {"username": "Allan Olexa", "comment_text": "Are you on one through-ticket?\nIs the airlines a high profile one, not a cheap questionable one? Still, please Apple AirTag your bags including carry on. Have an Android phone? Then set up the Airtags with an iPad via wifi. In hundreds of flights with checked bags, we’ve only once had our checked bag not get transferred…our\nflight was late with only a scheduled 50 minute connection. But, bags came on the next flight."}, {"username": "Tracy Foss", "comment_text": "If you are going to 1 place or have arranged private drivers take as much as you want ! BUT if you plan on using trains to tour around the country travel light because you will not get much help FYI I learned the hard way ..."}, {"username": "Vernell Carranza", "comment_text": "Here now. Checked, great so far!! Carry on for Capri and Amalfi coast. Too hard with ferry’s for us. Enjoy. Ours has been fantastic so far!!"}, {"username": "Daniela Ricketts", "comment_text": "Carry on"}, {"username": "Denise Maglio", "comment_text": "I’m doing carry on with a trolley personal item.\nI’m a total clothes hog but I don’t want the hassle nor the lugging of a big suitcase..\nI’m going for a month.\nThere is some smart luggage out there now and compression bags.\nIt’s the way to go!"}, {"username": "Dany O Murillas", "comment_text": "Why does no one know you can wash your clothing while takeing a shower"}, {"username": "Lina Stump", "comment_text": "If you can get away with carry on, go for it"}, {"username": "Jeff McLellan", "comment_text": "We just did carry on only for three weeks was our first time traveling so light and it was great."}, {"username": "Tracy Weiler Bell", "comment_text": "pack lighter and carryon. we always carry on. one suitcase and one small bag"}, {"username": "Rhona OConnor", "comment_text": "The risk is low. Most bags make it. Just don't bring too much. You must be able to carry your own bag."}, {"username": "Nayi Polanco", "comment_text": "My friend is currently here with just a carry on and a duffel bag, my family did the same. Suction bags work amazing if you want to pack extra. Now, if you can fit it on in a duffel bag, with suction bags too, even better and less to worry about"}, {"username": "Miriam Griffin Woods", "comment_text": "Just use a backpack"}, {"username": "Jennifer Johnson Mayes", "comment_text": "We checked and I regret it! One my bag was lost on a direct flight and got it four days later. But mostly because waiting for your luggage when you land can take a long time. If you can carry on, definitely do that! Packing cubes may help too"}, {"username": "Chuck Morton", "comment_text": "Seriously, what percentage of luggage is actually lost by the airlines? Well, turns out it's 7 bags out of every 1000 or 0.7%. If you split your packing so that you have some essentials in a carry-on the odds are with your checked bag!"}, {"username": "Rhonda Hope", "comment_text": "We always do coo even for 2 weeks"}, {"username": "Jenn Messina Babore", "comment_text": "My vote is always for carry on. It to mention lugging it around the cities with bigger luggages is tough."}, {"username": "Frances McDonagh", "comment_text": "I'm good a carry on but my max is 10 days. I'd check in one then carry on two between you. Remember souvenirs and shopping 🛍"}, {"username": "Valerie Collanton", "comment_text": "Checked luggage and. Connected through Atlanta last October. No issues."}, {"username": "Lucrezia Folger", "comment_text": "Traveled to Italy 17 times with a check-on and always have a connecting flight, never been an issue, (knock on wood) However no-one can predict."}, {"username": "Michelle Solak", "comment_text": "Me and my husband just went to Spain and Italy for 11 nights, each brought w checked bag, and had no problems! I’m not a light packer and it would’ve been hard for me to do carry on only, and also very heavy"}, {"username": "Lisa Francis", "comment_text": "Definitely carry ons. only"}, {"username": "Peter Pisani", "comment_text": "Carry on"}]}, {"id": "2198767713855640", "text": "Any hidden gems not to miss in or around Bolzano?", "link": "facebook.com/groups/1373361046396315/permalink/2198767713855640/", "likes": 0, "comments": [{"username": "Stefano Follador", "comment_text": "Oetzi museum it’a a must do.\n\nTheme are a lot to do in the alps nearby. It depends what you prefer, if you are into hiking, wine or history"}, {"username": "Peach Panfili", "comment_text": "Bressanone aka Brixen - absolute gem of a town - Hotel Elephant superb."}]}, {"id": "2198768393855572", "text": "Hi all. I’m very new to this page and loving reading all your posts. I’m off to Italy with a group of friends next month. It will be my first time, actually it will be my first time in Europe. I’d love some advice about a couple of things.\nI have a Mastercard debit card. It doesn’t charge bank fees which is great. Should I get a wise card as well so I can add euros to that? Do I need both?\nAlso I have this card in my IPhone. Is there a tap system there at all?\nThank you.", "link": "facebook.com/groups/1373361046396315/permalink/2198768393855572/", "likes": 1, "comments": [{"username": "Rhona OConnor", "comment_text": "With regards to tap to pay. Yes. Europe is quite far advanced with technology!"}, {"username": "Colleen Jennings", "comment_text": "Hi. I frequently travel to Italy from England. I have several cards loaded onto the Wallet app on my phone & usually take a couple of 100 €s in cash small purchases, coffee etc."}, {"username": "Lora de Vries", "comment_text": "We disabled our Tap to pay option. If you lose your card or it is stolen, all a person would have to do is Tap the card."}, {"username": "Denise Keegan", "comment_text": "Wise cards are great"}]}, {"id": "2198770730522005", "text": "Just got back from Italy! We did Florence, Rome, and the Cinque Terre. Wanted to share some of my experiences/favorites. We packed in carry ons and each carried 1 backpack. One our way home, we decided to check our bags as it was included in our airfare and we bought some souvenirs (including alcohol).\nWe went during a very hot time (temperatures averaged 97 degrees each day). We combatted this by getting out early, sight seeing in the morning, coming home after lunch, taking cold showers, and going back out in the evening. Lots of water, liquid IV, and fans!\nFLORENCE - we spent 4 days in Florence!\nFOOD.... Tamero Pasta Bar and Trattoria CasaLinga. AMAZING food, cheap (and good wine), and really great service. We made a reservation at CasaLinga but not at Tamero.\nEveryone always recommends All'antico Vinaoi for tradition focaccia sandwiches. Not me .... walk a little further and go to Pinos Sandwiches. Shorter line, better sandwiches, cheaper, and your sandwich is made by no one other than Pino himself. He is the sweetest man and loves talking to all us tourists.\nPersonally, I don't think all gelato is created equally. Our favorite was Sbrino. Try to find places that serve gelato out of mental tins with lids. Those are the places that make gelato fresh (this was a tip from our air bib host).\nWe grabbed a drink at Loggia Roof Bar one night before dinner. Drinks were expensive and it was nothing to rave about (sure, the view is nice). If you have time to do it, go for it. But I wouldn't go out of my way to do it again.\nVESPA...we used The Vespa Rent company and it was our most fun day in Florence! We had the vespa for about 7 hours and explored Tuscany. Stopped at multiple wineries, had lunch in Chianti, and got to get out of the city for an entire day. This company is amazing and provides maps for self-guided tours.\nSIGHTSEE...we did the Duomo at 9AM and we were thankful for that. For starters, it wasn't 100 degrees (yet) when we walked the 400 steps to the top AND the square was empty! We got to explore and walk around without thousands of people. 100% recommend the cathedral museum. It's rich in history and amazing (plus, it has AC). Otherwise, we got lost in Florence. Walked around, went into churches, walked down less crowded streets.\nROME - we spent about 48 hours in Rome! Because we were only there for a short time, we stayed in an Air Bnb that was about 5 minutes walking from the Colosseum.\nSIGHTSEE...we purchased the Rome Cards for 48 hours. These include public transportation and it includes entrance into the Colosseum (just have to reserve a time online). We went to the Colosseum at 530PM. We did the Vatican Happy Hour Tour at 7pm. It was awesome. We got a glass of prosecco, some meats and cheeses, and other snacks. Then we got to enjoy the Vatican relatively empty. We saw all the other sights - yes it was crowded, yes it was hot, but there are worst things.\nFOOD...Li Rioni Pizzeria, Il Bocconcino. Both AMAZING and did not require reservations. We ate at Vecchio Roma one night. It was meh. Food was average, service was odd, and it felt very touristy and expensive. The server was annoyed we didn't pay in cash for our 80 euro bill.\nCINQUE TERRE...we spent 4 days in Riomaggiore. Our airbnb was amazing and had a rooftop terrace. Beware: Riomaggiore (and all of the Cinque Terre) is hilly with lots of steps. Pack light. We purchased the Cinque Terre Cards, which includes public transport on the trains and busses (each trip on the train in between towns is 5 euro, just FYI). We went to all 5 towns and even went to La Spezia one morning.\nBEACH…we went to Monterosso and got there around 10AM. We went to a beach and purchased a spot with an umbrella and two chairs. It was 38 euro and 100% worth it. We were able to come and go as we wanted for the entire day. There are free beaches but they are small and have no shade. We left around 6PM. This particular paid beach closed at 7PM. Of note, the paid spots fill up FAST…get there early.\nSNORKELING…we went snorkeling with a local company in Riomaggiore. It was 45 euro and last about 3 hours. We went to three different sports and one of the tour guides pointed out specific fish, coral, and other cool facts about the Cinque Terre.\nWINE TASTING…we went wine tasting at Gheme in Riomaggiore. THE BEST EXPERIENCE. It was 25 euro and we tasted 4 wines plus a sweet dessert wine that only comes from the Cinque Terre. We got an entire history of the area, of wine making, and even got food pairings with each wine. We didn’t want to leave - it was that amazing.\nFOOD…we made most of our meals at home during this part of the trip. We went to the market and got pasta, tomatoes, chicken, mozzarella cheese, salami, focaccia bread, etc. We did go out to Nessun Dorma in Manrola. It’s good, very good. And the view makes it worth it. Pro tip…download the app and get in the queue before even getting there. We went to La Spezia and went to a cafe called Ciao Baby. GO THERE!!!! Literally, go to La Spezia just to go to Ciao Baby. We still talk about the food and lattes.\n\nHappy to try and answer any questions! We were very happy with our trip.", "link": "facebook.com/groups/1373361046396315/permalink/2198770730522005/", "likes": 563, "comments": [{"username": "Mary Andreotta", "comment_text": "Thankyou for the great tips!"}, {"username": "Sabrinna Suzzanne", "comment_text": "Fabulous"}, {"username": "Rebecca Lyon", "comment_text": "Bronte Lyon"}, {"username": "Sheila Tharin Ewing", "comment_text": "What a wonderful trip! Thanks for sharing."}, {"username": "Bonny S Boggs", "comment_text": "Thanks for info glad your trip was amazing"}, {"username": "Dana Perry", "comment_text": "Awesome post Molly Elizabeth . I am going o Italy in October and will have only a day in Rome before heading to Florence. Can you tell me a bit more about the Rome Card? I would love to do the Vatican night tour. Any feedback in that would be so appreciated Thank you."}, {"username": "Michelle Racioppi Johnson", "comment_text": "Would love to know the name of the beach you went to in Monterosso as I will be going next year. Is it possible to reserve ahead of time?"}, {"username": "Sammy Lee", "comment_text": "James Ryan"}, {"username": "Mike Joe", "comment_text": "Nat Faranda"}, {"username": "Lyn Bee", "comment_text": "Thanks for your insights- sounds like an amazing time . Just want to know a bit more about the ‘happy hour’ tour of the Vatican! How long did it go for and do you think you had enough time to see it all? I’ve heard it is quieter later in the day so considering this an option. And who did you book through? Thanks"}, {"username": "Sarah Kam", "comment_text": "Did you need to book for the wine tasting?"}, {"username": "Chris Yahnke", "comment_text": "Terri Heller Yahnke"}, {"username": "Jeannie Gazzaniga Moloo", "comment_text": "Thank you for sharing all this! Where did you stay in Florence?"}, {"username": "Christy Norland", "comment_text": "Molly Elizabeth any idea if they would rent a Vespa to a 17 yo? Going to Florence with my teen…"}, {"username": "Pamela J. Roe", "comment_text": "Thank you for sharing!"}, {"username": "Leanne Hopkins", "comment_text": "💓"}, {"username": "Larry Levin", "comment_text": "Sounds like a great time!"}, {"username": "Satyanarayana Kongathi", "comment_text": "Can brief me how u travelled florance to rome which train how to book .how u travelled in Florance any pass?.where u stayed in florance.which app is good for train booking and city tour"}, {"username": "Marci Kuehner", "comment_text": "Beautiful!!!"}, {"username": "Anna Pasternak", "comment_text": "What apps did you down load?"}, {"username": "Concetta Geraci", "comment_text": "Wow what a great trip!\nThank you for all the info!!"}, {"username": "Diane Cwik", "comment_text": "Beautiful!!"}, {"username": "Monique Smith", "comment_text": "Thank you for sharing. Have sent this on to family heading over there tonight"}, {"username": "Linda Padilla", "comment_text": "Thank you!😀"}, {"username": "Angela Freudinger", "comment_text": "Cody Andrew Glass"}, {"username": "Lucy Bella", "comment_text": "Am on vacation, who will take me on tour ?"}, {"username": "Isabelle Nissen", "comment_text": "Charmaine Howe"}, {"username": "Minerva Hernandez", "comment_text": "Amazing pictures 😍"}, {"username": "Raquel Pickering", "comment_text": "Tracey Moody florence"}, {"username": "Vanessa Jimenez", "comment_text": "Adam Jimenez"}, {"username": "Jerry Kiger", "comment_text": "For C Terre — sounds like you stayed on 1 town and bus others to visit. Do you suggest 1 town or central one specifically? Not sure distance between top to bottom would like to base in 1 and visit others like you did, thx"}, {"username": "Renee Rogers Tarrant", "comment_text": "You’re so generous to provide all of this information … Thank you"}, {"username": "Kadie Mcgugan", "comment_text": "Cameron Holliday"}, {"username": "Sonia Therese", "comment_text": "Awesome tips, thank you, sounds like you did the kind of traveling I like, casual, no rushing from one place to the next and not necessarily always doing what EVERYONE else is doing! Love it"}, {"username": "April Scott", "comment_text": "Can you give me more info about the wine and food experience in Cinque Terre that you mentioned?"}, {"username": "Irene Aloise Eger", "comment_text": "Denise Rangel Chris Eger i would love to zip around Italy on a Vespa lol Jeff Eger Pat Eger"}, {"username": "Wendy Jean", "comment_text": "How do I book the wine tour ?!?!?"}, {"username": "Patty Barnes", "comment_text": "Lovely!"}, {"username": "Tania Bourgoin", "comment_text": "Great post! Do you remember the name of the boat tour in CT? We will have to check Gheme Jennifer"}, {"username": "Lisa Calbreath Eissmann", "comment_text": "Sounds wonderful! Do you feel like 4 days was a good amount of town in Florence even if exploring out of the area?"}, {"username": "Janis Belkin Sowell", "comment_text": "We are traveling to Italy for our honeymoon next September....lo\nve your post and will save it"}, {"username": "Sophia Lin", "comment_text": "Thank you for sharing! This is very helpful. How did you reach cinque terra? Did you take a train from Rome? What’s the snorkelling company you used? Was the snorkeling worth it?"}, {"username": "Katherine AliNuñez", "comment_text": "Can you please share the accommodations in Florence."}, {"username": "Leesa Tawhara", "comment_text": "Brooke Tawhara"}, {"username": "Naomi Collado", "comment_text": "Can u please post the Airbnb u used in Rome?"}, {"username": "Kerry Jacobsen", "comment_text": "Thanks so much for taking the time to share your experiences. Now I’m even more excited about our holiday in September. You’re recommendations\nare very helpful and I’ve taken note of them."}, {"username": "Andrew Perkins", "comment_text": "Caitlin Perkins"}, {"username": "Noureddine Zenaini", "comment_text": "C'est fantastique.J'a\ndore les voyages organisés (planifiés).L'I\ntalie est un beau pays !"}, {"username": "Josée Gingras", "comment_text": "Could you please share the link of your AirB&B in Cinque Terre please ?"}, {"username": "Shelley Boxsell", "comment_text": "Jenny Myers"}, {"username": "Lisa Lunney", "comment_text": "Anthony Turton Tanya Kirkham Kel Nicholl great advice from Molly 👍"}, {"username": "Frances McDonagh", "comment_text": "I adored Florence only a day trip but got to see duomo, markets, rooftop garden an a wine window was on my wish list"}, {"username": "Sue Donaldson", "comment_text": "Sounds fabulous, great info, thanks for sharing !!"}, {"username": "Raquel Pickering", "comment_text": "Sylvia Sullivan this is our next trip after our next trip 😆 fly into Rome then drive outta it!"}, {"username": "Fran Tew", "comment_text": "Laura Tew"}, {"username": "Rosemarie Walker", "comment_text": "Great post, thanks for all the information"}, {"username": "Victoria Morrow", "comment_text": "Thanks for sharing!"}, {"username": "Elena Aro", "comment_text": "Thanks for your very informative post ⭐️⭐️"}, {"username": "Eileen Reynolds", "comment_text": "May I ask what kind/type of backpack? I'm going for a month and have a carry on. I have already paid for a checked bag...but I've changed my mind about that~I do not want the burden of hauling around a huge suitcase. Thank you in advance😄"}, {"username": "Diane Petonito Giordano", "comment_text": "We just got back a month ago. Beautiful pictures"}, {"username": "Dee Brough", "comment_text": "Kim Denning"}, {"username": "Katerina Ralli", "comment_text": "Thank you for all the info. Do you think Cinque terre is doable in a day?"}, {"username": "Emily Ramsay", "comment_text": "Sounds like a fabulous trip!"}, {"username": "Mariposa Mariposa", "comment_text": "Beautiful thank you for sharing this🇮🇹 🤍"}, {"username": "Rebecca Branta", "comment_text": "I love your post and agree with so much of it. Loved Cinque Terre and Florence, Rom was meh. More pricey than every other place in Italy and more touristy (like people trying to push things on me). Still worth going to Rome but we spent 4 days there and two would be have okay for us!"}, {"username": "Janeal Smith", "comment_text": "Just arrived home yesterday, a highlight of our trip was Cinque Terre, it took our breath away! Our tour only allowed for a few hours, would have loved more time. Thanks for sharing your advice and lovely pictures!"}, {"username": "Susan Buckley Thorpe", "comment_text": "Oh so beautiful! Thank you for your details!!! Love every bit as much as you. Living vicariously through your photo memories!♥️🇮🇹💚"}, {"username": "Patricia Chavez", "comment_text": "Thank You for your Wonderful information.\nYour trip was Awesome and Amazing Pictures ."}, {"username": "Joyce Plett-Vogan", "comment_text": "Sounds wonderful! Thank you for sharing.\nGorgeous pictures!"}, {"username": "Carly Botelho", "comment_text": "I’m so impressed when vacationers return from Italy especially and share amazing experiences and great info of where to eat and details of places to visit and where to stay. Thank you for your generosity of spirit and awesome travel journal!!👍😊"}, {"username": "Nicole Schipplock", "comment_text": "Can you share the details of your rome accommodation and were you happy with it"}, {"username": "Jennifer Schmidt", "comment_text": "Rome cards? Info please"}, {"username": "Jennifer Schmidt", "comment_text": "Also airbnb info"}, {"username": "Maria Sframeli", "comment_text": "Mario Sframeli"}, {"username": "Dace Pickens", "comment_text": "So helpful\nThank you!!❤️"}, {"username": "Laura L Biberdorf", "comment_text": "would care to share the air bnb you stayed if you liked them. im going in sept and it's pretty much the same route im taking you can dm me if you like"}, {"username": "Nakitha Badon", "comment_text": "Yes!!!!"}, {"username": "Toni Kebezes Biniaris", "comment_text": "Thank you for sharing your personal travel experience and tips! This makes it 100% better for those planning their trips !"}, {"username": "Aimee Aimee", "comment_text": "Could you please share the info on all the airbnb that you used?"}, {"username": "Robin Mendez", "comment_text": "Thank you!!! Great photos and information! I love hearing what others do … I’m planning for May 2024 so this group is really helpful!!!\nLooks like you had an amazing trip!"}, {"username": "Robin Pflueger Domenico", "comment_text": "Sounds like you planned your vacation and then enjoyed your time regardless of the heat and crowds."}, {"username": "Chrissa Matthews", "comment_text": "Sounds wonderful, where did you purchase the Cinque Terre cards? Thank you!"}, {"username": "Mark Deebel", "comment_text": "Sue Shurow Deebel"}, {"username": "Marisa Milanese", "comment_text": "Liquid iv is a must !! Currently in sorrento and the travel day from Florence to here was ruff ! Highly recommend"}, {"username": "Betsie Els Wepener", "comment_text": "Do you need a scooter license from your own country to drive a Wespa?"}, {"username": "Beth Templeman Brock", "comment_text": "Mattie Brock"}, {"username": "Matteo Gallizioli", "comment_text": "I'm Italian and I'm very happy when I read a tourist that enjoyed and appreciated my country"}, {"username": "Mariel Maldonado Gonzalez", "comment_text": "Thank you for sharing! Do you mind sending the info on the Nessun Dorma app."}, {"username": "Debbie Horton Rough", "comment_text": "Thanks for all the great tips!"}, {"username": "Carla Marie", "comment_text": "You took great notes! Thank you for sharing. I’m writing down a few for when my cruise ship goes to Florence and Rome this fall"}, {"username": "Terry Lee", "comment_text": "Thx for great info. Going in Sept"}, {"username": "Tracy Foss", "comment_text": "Thanks for the tips !"}, {"username": "Khan S", "comment_text": "Recommendations\nfor air Bnb in Rome plz.."}, {"username": "Aline Grazieli", "comment_text": "Thanks for all the info. Going in a few weeks"}, {"username": "Anne Wynsberge Nemes", "comment_text": "Info on your air bnb in Riomaggiore please."}, {"username": "Janice Schollen", "comment_text": "Thanks for the great info. We are in CT next week. Did you have any recommendations\nfor Vernazza?"}, {"username": "Dianne Kelly", "comment_text": "Looks like a great time!!"}, {"username": "Cheryl Tomkinson-Hunter", "comment_text": "Love the way you recapped your trip! Thank you for sharing about prices, ambiance, service and people. All very helpful and informative. You painted a picture to appreciate. We are looking forward to Pino’s Sandwiches in September!"}, {"username": "Nancy Moore Reynolds", "comment_text": "I am planning a very similar itinerary for October 2024. Could you share your lodging information please? And were the trains easy to navigate? Your trip looks fabulous!"}, {"username": "Lisa Rizzo Ozmon", "comment_text": "This is great information thank you. Can I ask about the transport cards. How do you know about them. Where do you get them. Does each city have one?"}, {"username": "Carolyne Banford", "comment_text": "Info on Airbnb in Rome please. TIA"}, {"username": "Lisa Jones", "comment_text": "What a great trip and beautiful photos 😍"}, {"username": "Catherine Kelsall", "comment_text": "I’d be interested in the Airbnb in Cinque Terre too - thank you"}]}, {"id": "2198775043854907", "text": "Hey all! Brand new to this group. We will be getting off a cruise in Rome on February 8. Would you extend a week to explore Italy, or is the timing just terrible?!", "link": "facebook.com/groups/1373361046396315/permalink/2198775043854907/", "likes": 1, "comments": [{"username": "Rhona OConnor", "comment_text": "Terrible in what way?"}, {"username": "Colleen Jennings", "comment_text": "Definitely! 2 nights in Rome then head to Florence easily doable on the train."}, {"username": "Colleen Dawson", "comment_text": "Depends on where in Italy you want to explore. A large country from north to south and very different that time of year . Cold and snow in the north, much milder in the far south."}, {"username": "Benedetta Vanni", "comment_text": "If you go South and stay on the coast, you will not find temperatures below zero. You will, at night, if you go to the hills and mountains of the Appennini chain which stretches all the way down to Calabria."}]}, {"id": "2198776657188079", "text": "Mizurinalake", "link": "facebook.com/groups/1373361046396315/permalink/2198776657188079/", "likes": 2, "comments": []}, {"id": "2198781583854253", "text": "Hi all, 2 questions for my upcoming trip;\n1. Is it best to pre purchase ferryhopper tickets from Sorrento to Positano or do while there? Not sure if Ferry times, and being spontaneous, we aren’t sure when we may want to return.\n2. I have already purchased ferry tickets to Capri, and staying the day until night. However, I have not secured a tour to the Blue Grotto. I thought I would do while there, but now I’m wondering if I should pre purchase on Viator?\nAny advice is appreciated…thanks", "link": "facebook.com/groups/1373361046396315/permalink/2198781583854253/", "likes": 0, "comments": [{"username": "Angie Davidson", "comment_text": "Following"}, {"username": "LeAnn Bonkiewicz", "comment_text": "F"}, {"username": "Yvette Pavone", "comment_text": "Purchase Grotto tickets in advance and get as early as possible! Otherwise you will be waiting in a line on the boat FOREVER"}]}, {"id": "2198783480520730", "text": "For anyone who has purchased colosseum tickets through coop culture, is it difficult to get the payment through with a credit card from a foreign country. I already bought tickets through another source. I am going try to get them through Coop culture. I know it has to be a month out, our trip is in September and what time can you buy the tickets on their website if anyone knows.", "link": "facebook.com/groups/1373361046396315/permalink/2198783480520730/", "likes": 0, "comments": []}, {"id": "2198785140520564", "text": "My favorite town in Italy!!!", "link": "facebook.com/groups/1373361046396315/permalink/2198785140520564/", "likes": 446, "comments": [{"username": "Nujee Walkaway", "comment_text": "Great place 😍👍"}, {"username": "Jenny Meffert", "comment_text": "Love, love, love San Gimignano"}, {"username": "Frank Hunt", "comment_text": "I stayed in a farmhouse with that exact view.❤️"}, {"username": "Tracey Lethbridge", "comment_text": "F"}, {"username": "Jojo Terencio", "comment_text": "And this is my fave 🙂 looking forward to visiting it again!"}, {"username": "Kacie Poskitt", "comment_text": "Is this seina"}, {"username": "Ricki Sherlin", "comment_text": "Pitigliano"}, {"username": "Keelin McCarthy Brubaker", "comment_text": "San Gimignano! I lived here summer of 1988"}, {"username": "Lisa Pirone Kaiser", "comment_text": "One of my favorites 💕"}, {"username": "Michael Catalano", "comment_text": "Cortona"}, {"username": "โซเฟีย ไอยรา", "comment_text": "LOVE Very nice"}, {"username": "Ritu Prakash Mohan", "comment_text": "Yes!"}, {"username": "Maria De-Walker", "comment_text": "Vicenza! Italy."}, {"username": "Sławomir Cieszyński", "comment_text": "Me too"}, {"username": "Norma Kalberer", "comment_text": "San Gimignano"}, {"username": "Liz Hinkebein Matz", "comment_text": "Sorrento and Positano"}, {"username": "Angie Vera", "comment_text": "My favorite and can’t wait to go back to stay for a few days. We just got back a few days ago!"}, {"username": "Toni Hostetler", "comment_text": "Love this town!"}, {"username": "Donna Ryan", "comment_text": "Yes .. loved our time here"}, {"username": "Jeidy Christina Duarte", "comment_text": "My Tuscany 💗💗💗💗💗"}, {"username": "Jeidy Christina Duarte", "comment_text": "I advise you to go to Monteriggioni, it is close to San Gimignano, it is a very small village, but very nice, the village is made up of a square and you can visit the walls, from above you will see the whole Tuscany landscape!"}, {"username": "Kerry Adams", "comment_text": "Just back from Italy, loved Cortona, Siena, Chianti, Lucca."}, {"username": "Sandra Keyser", "comment_text": "I love it also!"}, {"username": "Libby Chan", "comment_text": "Siena"}, {"username": "Ketevan Jintcharadze", "comment_text": "Love it🥰"}, {"username": "Julia O'Brien Holbrook", "comment_text": "The “New York” of Tuscany!!"}, {"username": "Panyarat Yotrungruang", "comment_text": "One of my favorites too, love it!"}, {"username": "Audrey Martin", "comment_text": "Loved this town too!"}, {"username": "Dixie Kotylak", "comment_text": "Loved it there too!"}, {"username": "Murray O'Neill", "comment_text": "Magnifico Toscano"}, {"username": "Lisa Knapp Wimberly", "comment_text": "We loved all the places mentioned above and another beautiful town is Montepulciano 😍"}, {"username": "Bill Elias", "comment_text": "I visited shortly after 9/11 and the twin towers were surreal at the time."}, {"username": "Graham Sherlock", "comment_text": "The La Cisterna hotel was excellent, great location too"}, {"username": "Danielle Gervais", "comment_text": "San Gimigmano"}, {"username": "Ellie Alahyari Rodriguez", "comment_text": "The gelatos !!! 🤤🤤🤤"}, {"username": "Karl Cvelbar", "comment_text": "San gim!"}, {"username": "Sara Rohde Sauter", "comment_text": "Do you really need international size carry on?"}, {"username": "Bijoy Krishnan", "comment_text": "We stayed at La Cisterna ..it is so good"}, {"username": "Starla Shoupe", "comment_text": "Brandon Shoupe"}, {"username": "Lesley Nesbitt-Blanchard", "comment_text": "That’s great to know as we head there in September!"}, {"username": "Keith Crossley", "comment_text": "Where was the photo taken from?"}, {"username": "Chelli Bawcom Montgomery", "comment_text": "Here’s my picture that I took there last month. Just an incredibly beautiful place!"}, {"username": "Moni Gonzales", "comment_text": "I was just there this morning!! Incredibly beautiful!"}, {"username": "Debbie Bodette", "comment_text": "Love San Gimignano!"}, {"username": "Fabiola Beltran", "comment_text": "Mine too !!! ❤️"}, {"username": "Goran Gogic", "comment_text": "San Gimignani. I love that ❤️😍 village"}, {"username": "Carla Snook", "comment_text": "Great wine!!!!"}, {"username": "Janice Sannicolas", "comment_text": "Spent 7 days there and fell in love. Went in October and was not crowded. The Thursday market was wonderful. Took a day trip\nTo Siena and 😍. Definitely will be going back."}, {"username": "Tracy Brown", "comment_text": "Me too !"}, {"username": "Jes Siskin", "comment_text": "Jared Siskin 🫶🏻"}, {"username": "Virgz Van Møøre", "comment_text": "Really ? Why ?"}, {"username": "Virgz Van Møøre", "comment_text": "So small, so few things to see, so touristy and crowded during the day, been visiting Italy 17 times from to North to South since 2021,hard to understand when there are so much more enchanting cities"}, {"username": "Urszula Augustyn", "comment_text": "Rome"}, {"username": "Maria Walker", "comment_text": "San Gimignano loved it and the famous gelato from there."}, {"username": "Lisa Chiappetta Cooper", "comment_text": "We were just there two weeks ago! Love! ❤️"}, {"username": "Rhonda Hope", "comment_text": "We stayed right outside the town"}, {"username": "Marlyn D'Amico", "comment_text": "San Gimignano!!!"}, {"username": "Steve Hinton", "comment_text": "Steve Hinton"}, {"username": "Joan Romiti", "comment_text": "Yes we love it too!"}, {"username": "Karen Costa", "comment_text": "Can’t wait to revisit Sienna"}, {"username": "Greg Kopp", "comment_text": "And that would be? Why favorite?"}, {"username": "Claudia Codega", "comment_text": "San Gimignamo?My partner loved it"}, {"username": "Mariët Eertman-Heemstra", "comment_text": "San Gimignano, Tuscany!!! Great, but whole Tuscany is fantastic, all the cities! Florence, Siena, Lucca, Volterra and Greve in Chianti!!\n😍😍😍😍"}, {"username": "Bonnie Besche", "comment_text": "Mine too!!!!"}, {"username": "Kristi Brennan", "comment_text": "Is this easy to access without a car? To visit or to stay?"}, {"username": "Sandy Gimple Hagen", "comment_text": "Any guided tours recommendations\n? Staying in Florance we want to do a day trip there and sienna"}, {"username": "John Mccormick", "comment_text": "I was in San Giminiano years ago and found it to be an absolutely small, charming little town. We had ridden our bikes there on a tour. Hung out at the Central Square by the well and stayed at a hotel there as well. Was there this past year and boy has it change. Nowhere near as charming as it used to be. I prefer Luca over San Gimignano. Just my opinion of course. Still a beautiful town but just lost its charm."}, {"username": "Marcela Poulikova", "comment_text": "Marcela Poulikova"}, {"username": "Tony Palombino", "comment_text": "Was just there yesterday amazing!"}, {"username": "JoAnn Sgarlata Simmons", "comment_text": "Michelle Vincent I was mentioning this town to stay at"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2198786293853782", "text": "Hello!!\nDo you recommend traveling with ryanair???\n\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2198786293853782/", "likes": 76, "comments": [{"username": "Mac Lacková", "comment_text": "I travel monthly and mostly with Ryanair. No problem at all. Sometimes small deals, but it is with all airlines. I prefer to fly cheaply and spend more money on unique hotels/\nrestaurants."}, {"username": "Muhammad Arslan", "comment_text": "si"}, {"username": "Aida Tiramisu", "comment_text": "No"}, {"username": "Maikel Mast", "comment_text": "Never."}, {"username": "Erin Thompson", "comment_text": "We are only flying Ryan air for the flight from sicily to Sardinia, it was the only non stop flight and is only an hour.\nWe read allll about it/the nasty reviews and pre paid extra for bags etc and are prepared to pay more at the gate and have paper boarding passes in hand 😅\n\nJust prepare for it"}, {"username": "Matea Bonić", "comment_text": "Yes. I traveled by Ryanair from Zagreb to Rome last week. Plane landed at Fiumicino International Airport in Rome. Professional and very friendly staff. The flight was 10/10. 🥰"}, {"username": "Krystle Waggy Konečný", "comment_text": "They charged us 70 euros to print the boarding passes at checkin. We tried to check in online, but their website kept crashing. We explained that to the gal at the check in counter and she didn’t care. She told us if we had a screenshot of the website timing out she would do it for free. It was a bunch of crap!"}, {"username": "Vesna Pavletić", "comment_text": "yes"}, {"username": "Elsa Wurster", "comment_text": "It’s the gray hound bus of the sky"}, {"username": "Ria Endoman", "comment_text": "I experienced my first flight with Ryan air\nAthens to catania well not really you see when we boarded the plane and the doors were closed the pilot announced that catania airport is closed so we will b diverted to Trapani airport and buses will take us to catania airport\nEveryone on the plane was surprised so I called Ryanair and they told me they sent email and text to tell me in advance. So not true had I known this I would have rearranged my plans. What was supposed to be a 3.5 hour bus ride was over 8 hours due to road closures from the fires. I left Athens at 6:30 am and arrived at my hotel in Taormina 11:30 pm only to find out that again due to fires there is no water in our hotel because they need it to put the fires out. Again the hotel should have told me and other arrangements would have been made.\nSicily should be in a state of emergency and cancel all flights till the fires are under control.\nOn an end note, the flight on Ryan air was a smooth 1 no complaints it’s the aftermath that was the problem"}, {"username": "Irma-Javier Bósquez", "comment_text": "Make sure to do your web check in. Once I forgot, and it was more expensive than the ticket Itself."}, {"username": "Amy Bee", "comment_text": "Yes. For the most part. Yep."}, {"username": "Joanne Wilmot Soall", "comment_text": "Nope! absolute 💯 % no no no no no. Never!"}, {"username": "Michelle Parkinson", "comment_text": "Sure."}, {"username": "Deborah Govea- Ciufo", "comment_text": "It’s a tin can, but it gets you there. The train is great."}, {"username": "Amalia Cristina", "comment_text": "That is a very broad question. It depends on your taste."}, {"username": "Sharmini Nair", "comment_text": "I flew from rome to Athens recently . It was a short flight so all good"}, {"username": "Julia Wildman", "comment_text": "No"}, {"username": "Ann Anbinh Nguyen-Duong", "comment_text": "Noooo, they are horrible in customer service. They lost my luggage from Roma to Santorini, I called them every day and 5 days later they found my luggage and did not say sorry or try to compensate me( I spent money to buy personal care for daily uses for that 5 days of having no luggages😓)"}, {"username": "Andriana Martinez", "comment_text": "I has no issues flying with them two days ago. Flight was on time and everything went smoothly. During the flight, all the transactions are cashless for coffee, snacks, etc."}, {"username": "Leslie Fay Blackburn", "comment_text": "No! Don’t do it! The “saved” money not worth it. You’ll spend more in the end!"}, {"username": "Frannie Kaplan", "comment_text": "Yes, I do it all the time. It's not my favourite but they tend to have good connections, decent prices. Just compare them with other flights and choose what's best for you"}, {"username": "Karen Baxter", "comment_text": "Do it all the time with no problems"}, {"username": "Yvone van Romburgh", "comment_text": "I booked a flight 4 months in advance , I was travelling with a group of ladies, the others boarded for our next destination and I was denied entry as they had over booked the flight. I was so stressed had to stay behind and only left 1 day later. Unfortunately I have already booked my flights for the next week, but will never use them again."}, {"username": "Marianella Flynn-Morales", "comment_text": "I flew from Madrid to Rome last year and it was a fun experience for me as passengers were singing and got us all into it. Crew was great they joined in. No issues with take off or arrival, check in early as lunes get long!"}, {"username": "Starla Dawn", "comment_text": "Yes\nAnd most certainly RyanAir over Volatea. Yikes."}, {"username": "Ian Beyer", "comment_text": "What’s the alternative option?"}, {"username": "Cinzia Carrieri", "comment_text": "Noooo"}, {"username": "Peter Lundevall", "comment_text": "No way. Don’t want to die on a Boeing 737 MAX !"}, {"username": "Margaret S. Evans", "comment_text": "Never"}, {"username": "Joe LaLonde", "comment_text": "Know all of the rules/\nadditional charges and you should be fine. As with any discount airline, do not book one of the last flights of the day. It’s not uncommon for them to cancel the last ones if their occupancy isn’t worth it, they’ll cancel the flight to fill up flights the following day."}, {"username": "Nanette English Wilson", "comment_text": "Absolutely"}, {"username": "Anna Szewc", "comment_text": "Yes!! But keep your expectations low 😁"}, {"username": "Rachel Collins", "comment_text": "No, they nickel & dime you for everything!"}, {"username": "Grant Mackay", "comment_text": "I’ve been using Ryanair for many years and find them efficient and very cost effective. You get what you pay for and don’t expect to get away with oversize baggage.\nAll complaints/\nmoans that I’ve been witness to are down to passenger/\ncustomer error. And that’s being polite about people who generally are not.\nI highly recommend using them…"}, {"username": "Merri Foster", "comment_text": "It’s an easy, quick economy flight."}, {"username": "Milan Mitvalsky", "comment_text": "No"}, {"username": "Mike Huff", "comment_text": "No problem from Venice to Paris"}, {"username": "Claire Lewis", "comment_text": "Yes"}, {"username": "Cindy Rogin", "comment_text": "Does a bear shit in a bathroom at the Ritz Paris? That would be a big NO"}, {"username": "Andi Riordan Scott", "comment_text": "jumping onto this string and Ive flown Ryan air multiple times and never any issues, but heard they cancel alot of flights in Italy- anyone know? Ive flown them multiple times in London, United Kingdom"}, {"username": "Maja Vidmar", "comment_text": "I’m from Europe and fly Ryanair all the time. It is great for short flights and price is great"}, {"username": "Antoinette Groenewald", "comment_text": "Etienne Louw remember how everyone clapped when we landed with Ryanair 🤣"}, {"username": "Kelly Jones", "comment_text": "Had a great experience twice a week ago"}, {"username": "Min Garrard", "comment_text": "I’ve had no problems with them they only come round once with food and drinks now\nSo take some\nI always do"}, {"username": "Jacqui Fairbairn", "comment_text": "They are bad for changing your flight times , used them twice this year and both been changed , not just a hour difference , lost a day in Italy , then a day on another holiday , ended up cumin back late at nite which I didn’t want . Would only use them if I could not get another co ."}, {"username": "Stéphanie Camilleri", "comment_text": "Always!"}, {"username": "Farhan Chowdhury", "comment_text": "If you're a budget traveller then it's best for you. But, if you don't have any issue with your budget, then It's better to avoid Ryanair."}, {"username": "Fran Bonanno", "comment_text": "Flew with them once! Never again - learnt the hard way! We were delayed on the way to the airport because of train breakdown, chaos at Stansted. Absolutely no help from Ryanair"}, {"username": "Christine Ann", "comment_text": "They are great from my experience"}, {"username": "Kath Jurewicz", "comment_text": "We had a great experience we flew from Scotland to Poland 🇵🇱 earlier this year."}, {"username": "Kim Newton", "comment_text": "No! They charged 60 euros per person to print boarding passes. Whilst I accept it was my fault for forgetting them, that was an outrageous charge. Never again!"}, {"username": "Gemma La Motte", "comment_text": "Terrible, used them in June and they made us pay for not checking in online 65euro each"}, {"username": "Carolyn Chesnik Seibert", "comment_text": "We had no problems with them twice in April."}, {"username": "Edmond Nolan", "comment_text": "My advice as a European DONT"}, {"username": "Marry Cherry", "comment_text": "Yeeeeeees! Cheap ticket. Not so comfy, but for these european one hour flight is okay ✌️ i love Ryanair so much! I paid only 9 euro vienna to Milano. 12 vienna to Bologna..."}, {"username": "Karina Amaris", "comment_text": "If you have money and self respect you will never do it"}, {"username": "K-Anne Perez", "comment_text": "If it’s a very short flight, it’s ok. Tried it from athens to santorini."}, {"username": "Troy Hughes", "comment_text": "After essentially getting yelled at to board at Stansted… this was my first sight of RyanAir…\n\nFortunately, it got me to Italy 🇮🇹 hassle free… let’s face it; good value… gets you there… all good 👍🏻"}, {"username": "Jill Moorcroft Penn", "comment_text": "No way!"}, {"username": "Wiam Hanaty", "comment_text": "Its not bad, only for short flights."}, {"username": "Annabella Pojer", "comment_text": "My experience is good flown 3 flights here in Europe🥰"}, {"username": "Christopher Elia", "comment_text": "Christopher Elia"}, {"username": "Russell Weidner", "comment_text": "We used them and it was great. Dublin to Edinburg"}, {"username": "Margaret Bromfield", "comment_text": "Absolutely not"}, {"username": "Pauline Brown", "comment_text": "A word NO"}, {"username": "Suzanne Mills", "comment_text": "Only for a short hop with carry on luggage."}, {"username": "Kate Piszczek", "comment_text": "Yes of course ,never had any problem just stic to the rules"}, {"username": "Sheri Lynn", "comment_text": "It is okay. Cheap no frills. Waiting in lines etc."}, {"username": "Susan Vogel", "comment_text": "I flew with them . Short flight"}, {"username": "Rachel Cox", "comment_text": "I live in Ireland and it's one of the main airlines here, so I've flown with them a lot over the years and will continue to do so. However be aware that it's a \"no frills\" airline. You need to pay for any extras, they can/do check the size of your carryon and may make you check it at the gate for an extra fee if you don't abide by the rules, and you need to check in yourself online. Also check where the airport is located before booking - sometimes it's much further out from the city you're travelling to than you think."}, {"username": "Nuun Lf", "comment_text": "Hélène…"}, {"username": "Magda Lena", "comment_text": "No. Lots of strikes and a nightmare for tall people"}, {"username": "Michele Scola Devereaux", "comment_text": "No extras but it was a good flight from Mallorca to Naples."}, {"username": "Anne Mc Namara", "comment_text": "A lot of people knock Ryanair,but I always fly with them. Nothing fancy but gets you there and reasonably priced. Very easy check in online and you know exactly what you pay for. Flew with Swiss Air recently and had lots of issues and would never fly with them again. Booking my next Ryanair flight on Thursday"}, {"username": "Carol Hanratty", "comment_text": "Always fly with them for Europe. Never had problems. Cheap too. Just when your booking they want you to add on extras and you dont need them."}, {"username": "Caz Za", "comment_text": "I flew Dublin to Edinburgh recently it’s just like a bus. Not good not bad."}, {"username": "Mallorie Mathis McManus", "comment_text": "not good but not bad. TRAVEL light! No frills flights and charge $$ for checked and/or overweight luggage."}, {"username": "Eliz Fragoso", "comment_text": "Yes but don’t go over # lbs 🤪"}, {"username": "Pearl Lucero", "comment_text": "You don’t have much choice for short haul inexpensive flights within Europe. Besides Easy Jet but they run different air spaces. The line at airport is usually long, and if you have priority you go on first, but usually you go a bus to plane at which time you are last getting off the bus. But the flights are comfortable enough. Although usually crowded."}, {"username": "Agnieszka Predkiewicz", "comment_text": "Everytime when you dont pay too much"}, {"username": "Sophia Howarth", "comment_text": "It’s not an airline anyone would recommend per say. It’s an A to B necessity. Buy any of the extra kilos in advance you may need as they can be really tough. It’s like flying in a public bus in peak hour."}, {"username": "Frank Hunt", "comment_text": "Cheap and cheerful, you get what you pay for….."}, {"username": "Maggie Narendra Vaidya", "comment_text": "Well i flew last month from Belgium to Pisa (and Luca by train from Pisa), first time Italy. Had no real issues, been travelling with Ryanair for many years within Europe......"}, {"username": "Lisa Graham", "comment_text": "No!"}, {"username": "Beth Weishaupt", "comment_text": "I have and it was just fine. In June of 23 I flew from Budapest to Rome."}, {"username": "Giovanna Kennedy-Massi", "comment_text": "Yes"}, {"username": "Donna Snow", "comment_text": "Yes!"}, {"username": "Debra Trolman Alvo", "comment_text": "Did last summer in Spain 🇪🇸 to Portugal 🇵🇹 - no issue!\nAnd we’ll ✈️ RyanAir again from Italy 🇮🇹 to Greece 🇬🇷 in a few weeks!"}, {"username": "Kenza Bouzoubaa", "comment_text": "Yes"}, {"username": "Eileen Mercieca", "comment_text": "Found them good and in time."}, {"username": "Revd Engin Yildirim", "comment_text": "Certainly NO!"}, {"username": "Isabelle Avl", "comment_text": "Depends from where. From Belgium, lots of strikes and cancellations at the last minute"}, {"username": "Jeanette Smith Floyd", "comment_text": "Flew from Naples to Toulouse france with no issues we purchased the top ticket, selected our seats at front, ticket included luggage allowance, and fast line through security"}, {"username": "Susie CB", "comment_text": "Flew from Brussels to Rome"}, {"username": "Kary LeBlanc", "comment_text": "Yep"}, {"username": "Giovanni Caligula", "comment_text": "I’ve flown Ryanair for years. Never had an issue! Nothing fancy about them, they get you from point A to point B.\n\nTravel light! I have two trips booked with them. Next month. From Germany to Spain then Spain to Italy and then back to Germany."}, {"username": "Ariyanna Madrid", "comment_text": "I flew with them around Spain a few times. They were all about 1hr flights, had no issues. They do try and sell you stuff the entire flight though so don’t expect a quite flight. It was very noisy but didn’t bug me."}, {"username": "Catherine Tero", "comment_text": "Yes fly with them all the time good airline"}, {"username": "Alejandro Gabriel Valenzuela Anghileri", "comment_text": "Not so comfortable, but does its job. Just check final price, you have to pay for almost everything and with extras it can get expensive.\n\nBut I prefer easyJet"}, {"username": "Bailey Heidloff", "comment_text": "Good for short flights. Don’t expect any super nice stuff. It is the spirit airlines or Europe. Gets you where you need to go for a good price!"}, {"username": "Noel Flood", "comment_text": "Make sure your cabin bag is correct size .they tried to screw me for €40 yesterday for same bag I've used for 2 year 😡 didn't work"}, {"username": "Maria NoBa", "comment_text": "We did years ago. It was ok. We did have to pay for excess weight in our luggage and it was pricey. But the rest was ok."}, {"username": "Amanda Stevenson", "comment_text": "We flew from Greece to Italy in Ryan with no problems!"}, {"username": "Rachael Richardson", "comment_text": "Easy jet or jet2 are better"}, {"username": "Michael Widjaja", "comment_text": "Flew with them 3 times this year and never had any serious problem nor complaints"}, {"username": "Clíodhna Droney", "comment_text": "I fly Ryanair anytime I go within Europe and have never had any problems. Roughly 15 flights over and back"}, {"username": "Helen Whatley", "comment_text": "We regularly fly Ryanair from the UK to destinations in Europe. Book priority boarding and the best seats are row 1. No issues."}, {"username": "Irena Reznik", "comment_text": "Just flew with them two days ago from Pisa, IT to Girona, Spain. No frills airline (old ripped seats, no TV, snacks available for purchase, need to pay for small bags you take onboard). I paid for business and all it got me was the row 2 🙂 and 1 checked bag. OK for short flights."}, {"username": "Dawn Hay", "comment_text": "Very little room between you and the seat next door. Sorry no room so hope you like it cosy lol"}, {"username": "Connie Flynn", "comment_text": "We have been on many of their flights. No problems at all. One thing to consider is most of the times you will climb steps to get into the plane. If you are unable to do this, advise them ahead of time and they will accommodate you."}, {"username": "Barnett Sturm", "comment_text": "About as comfortable as gum surgery without Pain killer but can survive short flights."}, {"username": "Sherifa Abdel Hady", "comment_text": "No we had to pay 60 euros extra per passenger from rome to catania just cos we didnt check in online !"}, {"username": "Kaidi Essi", "comment_text": "It’s absolutely ok, for the price u pay cant get any better - planes are mostly new and big ! Just did a flight from Lisbon to Madeira"}, {"username": "Irina Alia Ross", "comment_text": "No!🤦‍♀️"}, {"username": "Susan Toohey", "comment_text": "heck no!!!!! my butt still hurts from that seat. Lol."}, {"username": "Ricky Bates", "comment_text": "Absolutely not"}, {"username": "Patrice Larry Stevens", "comment_text": "Awful experience bought insurance but when were quarantined in Malta due to Covid restrictions changes they refused to pay me back because I was American"}, {"username": "Shirley Murphy", "comment_text": "If you’re flying from\nIreland no, go with Aer Lingus"}, {"username": "Dat Nguyen", "comment_text": "No issue"}]}, {"id": "2198786377187107", "text": "Hello!!\nDo you recommend traveling with ryanair???\n\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2198786377187107/", "likes": 10, "comments": [{"username": "Lindy Brophy", "comment_text": "Yes, have flown with them many times. Just know their policy with regard to baggage before booking and you’ll have as much sec was as you will with any airline."}, {"username": "Amanda Pollitt", "comment_text": "I have flown a few times with them and never had a problem, just do as others suggest and check the baggage allowance."}, {"username": "Dorothy Bush", "comment_text": "Nothing wrong with them. A flights a flight at the end of the day. Never had an issue."}, {"username": "Sandra Vilters-boer", "comment_text": "Google strike ryanair and you will read that every year flights are cancelled because employees are on strike.\nIf you are unlucky like us you end up on a airport waiting 24 hours extra for a replacing flight.\nRyanair does not help you book an hotel or gives any compensation. It took is 3 years before court finally agreed that they had to compensate us.\nJust be warned they are cheap not only in price"}, {"username": "Christa Z Frier Schacke", "comment_text": "Yes several times with no problem - just read the luggage information. Etc."}, {"username": "Jose Velez", "comment_text": "If is short and no other option. EasyJet is much better or other cheap carriers."}, {"username": "Frances McDonagh", "comment_text": "As an Irish airline it's fine it's basic but flies lots of routes and is cheap for carry on"}, {"username": "Giorgio Zanichelli", "comment_text": "I live here in Italy and I fly ryanair all the time, whether it's work or leisure. Mostly fine, it's cheap so you get what you get but most of the time the flights are on time and there arw no issues. Delays happen but that's as likely as with any other airline and in the EU you're entitled to compensation for most delays and cancellations"}, {"username": "Gill Dodsworth", "comment_text": "Only if i really have to.. been ripped off by them more than once"}, {"username": "Sue Pilson", "comment_text": "No never after my trip to Rome. They were awful 😞"}, {"username": "Bill Casper", "comment_text": "We did. They’re fine. Just know the baggage limits."}, {"username": "Alex Dodge", "comment_text": "Yes, it’s a good way to get around. If your traveling in Italy and the distance is not too far the train is also a great option."}, {"username": "Pat Campbell", "comment_text": "I’ve used the many times over the years never had any problems obvs lucky one 😉"}, {"username": "Ihsan Khrichfa", "comment_text": "Yes i went to Venise with them they were correct"}, {"username": "Lynn Francisco Casella", "comment_text": "Hilton is better"}, {"username": "Paul Handley", "comment_text": "Yes"}, {"username": "Teresa Marina", "comment_text": "Oh my no way. I did two weeks ago and after 5 delays for a two hour flight, we lost pressure in the cabin and had to return back to the original airport. Two hours later we were on the same plane. Will never ever go on Ryan again. It took us an entire day and a wild ride to get to our destination."}, {"username": "Liam Keane", "comment_text": "They are what they are, no frills so have little expectation. As an airline, they’ve one of the newest aircraft fleet in Europe if not the world so reliability is high and normally a good standard of maintenance. We fly with them more and more as they get you there but don’t expect the champagne reception!!"}, {"username": "JA Gna", "comment_text": "Ryan Air is the Spirit Airlines of Europe, they nickle and dime you for everything, last time we used them in Spain we forgot to check In online, when we checked in at the airport they charged us 35 euros each just for checking in at the Airport!!!"}, {"username": "Patty Ham", "comment_text": "Sometimes it is the only game in town."}, {"username": "Miklos Verdes Kovacs", "comment_text": "NO"}, {"username": "Federica Poma", "comment_text": "No"}, {"username": "Antonella Piccolo", "comment_text": "Yes"}, {"username": "Julia Luzzana", "comment_text": "Yes"}, {"username": "Jekaterina Valujeva", "comment_text": "Always traveling with Ryanair, never had a problem.. Already more than 100 flights with Ryanair 🤷‍♀️ just don't expect too much from a low cost company 🙂"}, {"username": "Paola Bersano", "comment_text": "No."}, {"username": "Edmond Nolan", "comment_text": "As a European NO"}, {"username": "Bob Schock", "comment_text": "Hell NO"}, {"username": "Graham Hyde", "comment_text": "No"}, {"username": "JA Gna", "comment_text": "I would always do train first unless taking the train is more than 6 hours in duration, taking eurorails is sooo much better than flying especially with Ryan Air"}, {"username": "Cecilia Christine Costantini", "comment_text": "I always do. This summer I have 8 different flight with them. Just make sure you check-in online and that you read their baggage policy carefully (only a small bag/backpack is included, you have to pay extra if you want a 10kg carry-on or if you want to check in 10 or 20kgs). It is a no-frills airline, but it has allowed lots of people to be able to travel more."}, {"username": "Gillian O'Callaghan", "comment_text": "For a budget airline they are fine. Read everything carefully especially what your ticket entitled you to re luggage. Stick to their requirements as you would any airline."}, {"username": "Jules Earl-Rossiter", "comment_text": "I would never ever fly with them again... even if they were the only airline left in the world... Totally disgusting from start to finish...🙃"}, {"username": "Elena Innocenti", "comment_text": "No."}, {"username": "Matteo Gallizioli", "comment_text": "yes"}, {"username": "Kit Nader", "comment_text": "Yes they are absolutely brilliant."}, {"username": "Thuy Tdt", "comment_text": "Yes it’s a good low cost airline !"}]}, {"id": "2198789733853438", "text": "Recommendations for an Airb&b or hotel in or near Florence . We’re going this October. After 3 nights were thinking of heading to Rome. It’s just me and my husband going. Just want to make sure we’re in a nice place. A nice view would make it even better. We’re not planning the whole trip just gonna figure some of it out as we go. But want to at least plan the first few nights.", "link": "facebook.com/groups/1373361046396315/permalink/2198789733853438/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.anrdoezrs.ne\nt/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187896-d5459\n35-Reviews-B_B_\nLe_Cannelle_FIE\nSOLE-Fiesole_Tu\nscany.html"}]}, {"id": "2198795143852897", "text": "I need a little help.\n\nMy family and I are leaving in a couple of days for Italy.\n\nWe reserved tickets for the Vatican (bought directly from their website) the payment went through and was accepted on a credit card. We bought the tickets mid May.\n\nHowever, I have recently realized I never received an email confirmation with our tickets.\n\nI haveआणखी tried to check their website to see how to have them send the email but I cannot for the life of me find an option to do so.\n\nI have sent them an email to their information email hoping that it works.\n\nHas anyone else had this issue? If so what can we do! We paid 260€ for these tickets for all 7 of us!\n\nWe don’t want to show up at our designated date and time and be refused because they never sent me anything. And yes I’ve checked my junk mail\n\nTIA", "link": "facebook.com/groups/1373361046396315/permalink/2198795143852897/", "likes": 2, "comments": [{"username": "Vanessa J Bossi", "comment_text": "Veronica Bossi"}, {"username": "Tricia Brittingham Neff", "comment_text": "This is the email we received our confirmation from. Did you check your junk mail? biglietteria.mu\nsei@scv.va"}, {"username": "Rick Lozano", "comment_text": "Ours did the same thing! Amazing it went to junk, and SO much still gets thru!"}, {"username": "Lisa Green", "comment_text": "Was your email address quarantined and it bounced back? Was it Gmail? This can sometime happen as well and you won't know unless the other end tried to contact you. I would keep trying the contact number.\nDid the funds definitely come out of your account?"}, {"username": "Tiffany Hadfield Merrill", "comment_text": "Are you sure it was the Vatican site? When I was searching, there was a third party that was called Vatican tickets or something similar… maybe double check? I got my tickets on tíquet but I remember the other sites too"}, {"username": "Gytahnna Loffgren", "comment_text": "Mine definitely went to Junk or Spam, it was 2 different folders I had to check. I was able to find it and they also resent the confirmation 👍 Don’t give up!"}, {"username": "Richelle Trezise", "comment_text": "That will work it happened to me. I emailed and the next day got an email with the ticket"}]}, {"id": "2198795187186226", "text": "We have 2.5 days in Rome stating next week. What are the top things to do and see?", "link": "facebook.com/groups/1373361046396315/permalink/2198795187186226/", "likes": 9, "comments": [{"username": "Nana Esther Bertolino", "comment_text": "Vatican, Spanish Steps, Puopolo"}, {"username": "Matteo Gallizioli", "comment_text": "MUST see Musei vaticani (cappella sistina)"}, {"username": "Tamu Cavi", "comment_text": "We are staying about same days in Rome and the first day we always do guided tour (so we don’t miss a single “must see” place) the sec day we explore on our own, do shopping, relax and try restaurants, etc … that always works for us."}, {"username": "Alana Marie Sult", "comment_text": "Pantheon with espresso and \"lobster tails\" at Sant Eustachio"}, {"username": "Ville Lignell", "comment_text": "Castel Sant'Angelo, the Quirinale museums, the catacombs of Priscilla..."}, {"username": "Sal Facciponti", "comment_text": "Gelato 😂"}, {"username": "Marie Cuzzi", "comment_text": "Colosseum, Spanish steps Trevi fountain go early morning\nWalk the back street… you will discover amazing places …. Also the Zoo I loved it"}, {"username": "Ken Vecchia", "comment_text": "If it’s your first time there Take a tour of Rome they will bring you to all the main attractions"}, {"username": "Jeff Gentner EA", "comment_text": "Check out Walks of Italy. Great tours, skip the line. Be sure to stroll through the Trastevere area for dinner. Many great restaurants. Like a small town in a big city."}, {"username": "Ian Beyer", "comment_text": "Apple Maps doing a funny on us.\n\n“Take the stairs on the right”\n\nStairs on the right: the Spanish Steps. ALL OF THEM."}, {"username": "Amy Antonini Wilson", "comment_text": "If possible, book the “golf cart driving tour: Rome express” for 1.5 hours in Viator for first thing. Then you’ll have an idea what you may want more time in. We’d pre-booked Vatican tour before trip but after golf cart tour added a self guided Colosseum-Roman\nForum-Palatine Hill tour and so happy we did! We loved our Pantheon tour also. Skip the line tickets will be key for anything you decide to do in your 2.5 day visit! Can’t go wrong…it’s all wonderful! Have a great time!!!"}, {"username": "Bennett Richards", "comment_text": "The Pantheon. The oldest building in continual use (28 BC) on the planet.\nThe interior is substantially unchanged since it was built as a temple for the Roman Gods."}, {"username": "Fran Fitzpatrick", "comment_text": "Vatican,Spanish\nSteps,Coleseum and Pantheon are certainly doable in 2 days with plenty of time to spare.PS also the Trevi Fountain as well no problem!"}, {"username": "Terry Pisano", "comment_text": "Golf cart tour day of arrival (we'll be tired). 2nd day - my own walking tour with all the piazzas and fountains ending at the colosseum for a tour there, then dinner. 3rd day Vatican tour. That's about all the time we have."}, {"username": "Dawdaw Samaha", "comment_text": "The Vatican, colosseum, Trevi fountain . Walk around and enjoy"}, {"username": "Lester Smith", "comment_text": "Guided tour, you will see more than if you are trying to walk."}, {"username": "Roberto Scalera", "comment_text": "Lorraine Holmes xxxxx"}, {"username": "Jennifer Brothers", "comment_text": "Michele Grilliot Parsons"}, {"username": "Maggie Gpe Banuelos", "comment_text": "I so loved Rome!!!! Once you hit all the major attractions, just walk around!! There’s soooo much to see! I’d also stepped into churches along the way, absolutely breathtaking! I carried my wrap around just in case required."}, {"username": "Olga Olga", "comment_text": "Type the question “what to see in Rome” in google search and it is show you the most popular attractions."}, {"username": "Olga Olga", "comment_text": "But also don’t worry your hotel give you the map with places what you want to see"}, {"username": "Allison Boccaccio", "comment_text": "Go on a golf cart tour to see all the sites in a few hours!"}, {"username": "Anthony Sperduti", "comment_text": "I hope this is a joke"}, {"username": "Stacy Prestigiacomo", "comment_text": "Make reservations for El faciolaro, close to trevi and shopping"}, {"username": "David Hibbs", "comment_text": "The one thing we do to every new city is take a tour the first day you are there. We booked with the tour guy and it was a Rome in a day tour. It was about 6-7 hours but we saw so much it was the best thing we did. After that if we wanted to go back to something we saw, we could"}, {"username": "Steve Hinton", "comment_text": "Steve Hinton"}, {"username": "Jhermie Ortega", "comment_text": "Laine Luis"}, {"username": "Meg Johnson Ignacio", "comment_text": "We are doing this Evening Food tour in Trastevere/\nRome next Monday. We booked it via EatingEurope.co\nm. Got really good reviews. Also booked a golf cart tour, Vatican breakfast tour as well as Colosseum tour."}, {"username": "Rick Sikorski", "comment_text": "Rolling Rome golf cart tour at night. We had a great time. Worth the time and money."}, {"username": "Katie Ewers", "comment_text": "Borghese Gallery - stunning works!!!"}]}, {"id": "2198796700519408", "text": "Visiting in September and below is the 10 day itinerary. Decided on Sorrento for the first night before making our way to Amalfi to join the group. We end in Bari, but will have about 2.5 days to explore afterआणखी the tour ends!\n\nMy question: what cities might we consider as we make our way from Bari back to the Amalfi side? Would love shopping, a winery, a cooking class? Departing from Naples.\n\nGrazie!", "link": "facebook.com/groups/1373361046396315/permalink/2198796700519408/", "likes": 1, "comments": [{"username": "Greg Kopp", "comment_text": "Would love to hear how you liked this itinerary on your return!"}, {"username": "Alice Bush Kachejian", "comment_text": "How did you create this post?"}, {"username": "Miyuki Kanno Paul", "comment_text": "I assume you are not driving, right?"}, {"username": "Cameron Smith Bradley", "comment_text": "Polignano a mare"}, {"username": "Miyuki Kanno Paul", "comment_text": "Stop at Caserta on your way back. Royal Palace of Caserta is worth visiting.\nNapoli. You will be flying out of NAP anyway"}]}, {"id": "2198993327166412", "text": "Hi.... when in Italy, end of September, better to visit Rimini or Ravenna? Culturally speaking. ThNk u", "link": "facebook.com/groups/1373361046396315/permalink/2198993327166412/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Ravenna"}, {"username": "Angela Greatrex", "comment_text": "I went to Rimmini beach resort , cafe , bars restaurants. You can take an excursion to San marino from there ."}, {"username": "Giovanni Pianigiani", "comment_text": "I'm not aware of anything culturally relevant in Rimini?"}, {"username": "Manuela Bonazzi", "comment_text": "Rimini non la conosco ma Ravenna merita assolutamente una visita per i mosaici..un giorno può essere sufficiente."}, {"username": "Vivien Paulik", "comment_text": "Rimini is for beach. So I say Ravenna for more things to do in the end of September"}, {"username": "Romina Lauretig Toscano", "comment_text": "What about Forlì?"}, {"username": "Frances McDonagh", "comment_text": "I only went to Rimini to get to San Marino"}, {"username": "Pietro Adami", "comment_text": "Ravenna. No doubts."}, {"username": "Miyuki Kanno Paul", "comment_text": "Definitely Ravenna. Rimini is known as a beach resort while Ravenna is loaded with UNESCO sites"}, {"username": "Claudia Amp", "comment_text": "Ravenna is way better culturally speaking."}, {"username": "Paola Bersano", "comment_text": "You can stay in Rimini and visit Ravenna, it's very close. And the city centre of Rimini is really interesting, even a bridge and an arch dating back to the roman empire, definitely worth a visit. It is some 2 kms from the beach town, which Us called \"Rimini Marina\"."}, {"username": "Ville Lignell", "comment_text": "Culturally speaking you can't mention Ravenna in the same sentence with Rimini..."}, {"username": "Frank Hunt", "comment_text": "Nothing too much at Ravenna, people stay here when cruising, it’s nicely historic but there are better places to visit. Rimini is a nice but busy sea side town, it’s a beach place, plenty to eat but not much else there."}, {"username": "Barbara Bastianini", "comment_text": "Ravenna!\n\nRavenna’s mosaics are world famous. Dating from the 5th century the impressive mosaics are a UNESCO World Heritage heritage site. Eight fantastic monuments comprise the world heritage site. In terms of art, architecture, and history Ravenna comes out on top on my book."}, {"username": "Monica Sucato", "comment_text": "Ravenna"}, {"username": "Virgz Van Møøre", "comment_text": "Ravenna of course"}, {"username": "Luisa Ravenna", "comment_text": "Culturally speaking Ravenna, the mosaics are gorgeous"}, {"username": "Daisy Yoo", "comment_text": "I would stay in remini and visit Ravenna and Bologna and San Marino the little country"}]}, {"id": "2198969667168778", "text": "Are there any tours ideally from Rome that go out to the Sangro River war cemetery? I have a Great Uncle buried there that no other family member has been fortunate enough to visit, but it seems extremely difficult to get there!", "link": "facebook.com/groups/1373361046396315/permalink/2198969667168778/", "likes": 1, "comments": [{"username": "Romina Lauretig Toscano", "comment_text": "Sangro river crosses 2 regions..Abruzz\no and Molise. What s the name of the town he is buried?"}]}, {"id": "2198994370499641", "text": "I am starting to plan an Italian holiday for my husband and I for August September October 2024. I'm having issues looking for accommodation. Some hotels are showing no availability - looking at locations recommended on this page. Do some hotels hold their rooms for release in the future?", "link": "facebook.com/groups/1373361046396315/permalink/2198994370499641/", "likes": 8, "comments": [{"username": "Carol Johnson", "comment_text": "Did you try Booking or TripAdvisor"}, {"username": "Maria Rizzuto Campanella", "comment_text": "Look into Arbnb.. there are some really nice places and very reasonable."}, {"username": "Miyuki Kanno Paul", "comment_text": "It’s too early for many"}, {"username": "Linda Scarbro", "comment_text": "If you find accommodation you are really interested in, it’s worthwhile contacting the hotel/B &B direct, asking about availability (even if their website booking page doesn’t show prices). I contacted two places in this way about a stay next June. One said they hadn’t set 2024 prices yet and asked me to contact them later this year, but the other gave me a price for the dates I was wanting to stay."}, {"username": "Claire Ickes", "comment_text": "Yes, may be too early. Once when we were 5 months out, and wanted to stay at a particular hotel we called the hotel directly (not available online). They booked the room for us. Our first question... \"Do you speak English?\" Too important to use our shaky Italian."}, {"username": "Bailey Heidloff", "comment_text": "Can you elaborate on where you are going in Italy?"}, {"username": "Lee Anne Ashurst", "comment_text": "I’ve emailed some hotels rates for 2024 later this year"}, {"username": "Caroline Croghan", "comment_text": "It's worth contacting a hotel you like directly and ask if they can give a better rate than Booking.com etc. The commission to online bookers is15-20%. Most hotels give a lower rate"}, {"username": "Romina Lauretig Toscano", "comment_text": "Too early :)"}, {"username": "Cindy Killingsworth", "comment_text": "The Olympics are ￼in Paris next year"}, {"username": "Laura Uribe", "comment_text": "I think you’re just a little too early. Most places only release dates a year or less in advance. You could email and ask when your dates will be posted."}, {"username": "Frances Scannapieco", "comment_text": "I just booked two hotels in Sicily for October 2024\nDepending on where you are going and how much I will keep looking and book when you find what you want"}, {"username": "Joy Buenaflor", "comment_text": "It’s too early for some hotels/system to post rates, but if you email the hotel directly they may be able to reserve you a room. I have reserved for my trip in October 2024."}, {"username": "Elena Innocenti", "comment_text": "Some hotel open booking 12 months before"}, {"username": "Renae Larcus", "comment_text": "Do not go in August. It’s hot and crowded. September is lovely"}, {"username": "निनावी सहभागी", "comment_text": "Thank you everyone for your advice. It is very much appreciated."}, {"username": "Jenny Payne", "comment_text": "Unless you email the hotel directly , they may take your booking. I also email directly as I go often and I think the booking places get allocated space closer to next year🌻"}, {"username": "Rachel Christina", "comment_text": "Most don’t allow bookings more than 12 months out"}, {"username": "Michelle Mercury", "comment_text": "Accor app works for the hotels book now pay when you get there. Novotel, Mercure etc."}, {"username": "Elaine King", "comment_text": "Try booking.com I booked a year out,"}, {"username": "Linda Barba", "comment_text": "Yes it may be just too early for car rentals for the month of June they are still not available through one app I want to go through"}, {"username": "Romina Lauretig Toscano", "comment_text": "You could write an email to the hotel to 'prebook' without paying anything. Just informing on your intention."}, {"username": "Yvette Pavone", "comment_text": "Yur very early"}, {"username": "Shelley Howard", "comment_text": "your too early try from 12mths out .. flights then accommodation ..."}, {"username": "Yvonne Donnellan", "comment_text": "There prices are probably not out yet for 2024."}, {"username": "Michelle Mercury", "comment_text": "Hi I joined accor plus I get red hot rooms really cheap and 50% off all the food and free welcome drinks and packages the best thing I've ever brought and kids stay and eat for free makes traveling affordable all over the world. You may be interested? and you can book a year out."}, {"username": "Michelle Mercury", "comment_text": "accorplus.com"}, {"username": "Lisa G Day", "comment_text": "I will also be travelling to Italy at the same time next year. My travel agent said we can start booking flights and accommodation from September, as booking open 12 months in advance.\nHope this helps.\n☺️☺️"}, {"username": "Joanne Nacson", "comment_text": "I booked stuff with free cancellation 12 months out and then changed it if I found something better"}, {"username": "Joanne Wright", "comment_text": "Too early to book."}, {"username": "Cecilia Christine Costantini", "comment_text": "Yes, they might start showing availability in January. I generally set an alarm on my phone that rings every Sunday to remind me to check specific places availability whenever I start planning holidays. This year I booked everything (in Europe in general) in January."}]}, {"id": "2198993653833046", "text": "First visit to Italy. We have 7 nights after Amalfi coast. Should we do Tuscany or Puglia?", "link": "facebook.com/groups/1373361046396315/permalink/2198993653833046/", "likes": 1, "comments": [{"username": "Maura Galli", "comment_text": "Depending... I would suggest Pulia."}, {"username": "Miyuki Kanno Paul", "comment_text": "You definitely need a car in Puglia"}, {"username": "Alice Francesca", "comment_text": "Tuscany!"}]}, {"id": "2198998887165856", "text": "Hi , I’m on my way to Pisa now , is it worth climbing the 273 steps inside the tower ? Is it narrow , hot & claustrophobic? Appreciate any advice , thanks !", "link": "facebook.com/groups/1373361046396315/permalink/2198998887165856/", "likes": 0, "comments": [{"username": "Benedetta Vanni", "comment_text": "It is narrow and claustrophobic,\nindeed, and is slippery too (centuries of people going up and down those stairs). If your goal is to see the panorama from the top, I would suggest to reserve a table for aperitivo on the rooftop of Hotel Duomo nearby (saturday only). Definitely get inside the duomo and battistero. If you manage to find a guided tour to the camposanto (monumental cemetery) that will be a plus!"}]}, {"id": "2198997563832655", "text": "Hi, visiting the Amalfi coast in a few weeks, looking for advice on ferries and buses. How do you book tickets? Can you do it online, are debit cards ok? Do you need to book in advance, if so, how long? Do you have to buy tickets each time you are going somewhere, or can you buy a pass? any Apps or websites in English with information about this that anyone can advise would be a help? Any advice greatly appreciated. Thank you!🙏", "link": "facebook.com/groups/1373361046396315/permalink/2198997563832655/", "likes": 7, "comments": [{"username": "Diane Davis Lawyer", "comment_text": "This may help: https://\nwww.ravello.com/\nsita-bus-schedul\ne/"}, {"username": "Omar Chaaraoui", "comment_text": "I took Italo train to Salerno from Napoli (30 minutes) early in the morning, then took the ferry to the town of Amalfi (Ravello), and ferry to Positano. I got to see the entire coast, it was amazing. After Positano, I decided to save money and rake a bus to Sorrento. The bus stop is at the top of the town (following the natural walk up the town), and tickets are sold at the tabacci store (right next to the bus stop), otherwise you can take the berry again, and the ticket booth is right next to the station. I used the app \"ferryhopper\" for my tickets. There's also the app \"Rome2Rio\" to get more info. And then, after Sorrento, I took the Campania express train back to Napoli, no need for advanced tickets purchased, train runs very frequently. Hope this helps. Note: I bought the Italo train ticket ahead of time just to get nice seats, but that wasn't necessary, and I bought the ferry tickets ahead just in case."}, {"username": "Susan Gulbransen Ricks", "comment_text": "Is the bus running to Ravello yet?"}, {"username": "Brenna Afford", "comment_text": "Ryley Afford"}]}, {"id": "2199000167165728", "text": "We enjoyed the space of our apartment when we first arrived in Italy three weeks ago. But for our last night here and convenience I decided to just book two rooms at the Sina Villa Medici (part of Marriott Autograph Collection)\n\nThe hotel was a fantastic find. Our ten year old enjoyed a two hour swim after our travels down from Parma before we went out for dinner and a final wander in Florence.\n\nHad I realized this hotel had a pool I likely would have booked it for the first three nights of our trip as it was nice to be able to refresh and chill out there.\n\nThey called me several times yesterday morning and I was worried there was a problem with our rooms but they instead were checking our arrival time and offered us an upgrade to their amazing Royal Suite. What a absolutely amazing space for the final night of our three week first trip to Italy.\n\nThere was a second bedroom with a king size bed and bathroom with an third connecting bedroom that could be added (we didn’t have the third). Not sure how often I would ever decide to buck up for that suite but it was an amazing experience and we are on our way home now.\n\nhttps://www.marriott.com/en-us/hotels/flrak-sina-villa-medici-autograph-collection/overview/?scid=f2ae0541-1279-4f24-b197-a979c79310b0", "link": "facebook.com/groups/1373361046396315/permalink/2199000167165728/", "likes": 232, "comments": [{"username": "Heather Rodemann", "comment_text": "Very cool! We are staying here soon, thanks for sharing your experience!"}, {"username": "Diane Hamilton", "comment_text": "Wow beautiful 🇮🇹"}, {"username": "Tara Roed", "comment_text": "We recently did positano, Sorrento And Rome. The first 2 we did beautiful hotels with pools. We ended with an Airbnb. I think that combining the 2 types of accommodations balances out the trip! Sometimes an apartment with space to get away from each other is nice and sometimes a hotel pool and a concierge just does the trick! Enjoy. Looks amazing!!"}, {"username": "Kay Jenkins", "comment_text": "Beate te"}, {"username": "Nicole Dehney-callahan", "comment_text": "Ty for sharing. Was just looking at booking there"}, {"username": "Colleen Jennings", "comment_text": "My kind of place! Enjoy the Fiorentine hospitality. Safe journey home."}, {"username": "Rachael Richardson", "comment_text": "Lucky you"}, {"username": "Louisa Curvelo", "comment_text": "How much a night?"}, {"username": "Khanh Pham", "comment_text": "What a lovely experience and review. Maybe you can at tag them or something so it shows on their social media page. In a world where people typically only take the time to complain, how wonderful that you were generous to share your excellent experience."}, {"username": "Ashley Knowles", "comment_text": "Beautiful"}, {"username": "Michele Colicci", "comment_text": "Really beautiful, I love , I will be booking in future, thank you for posting. 😎"}, {"username": "Laura Storie Dolinar", "comment_text": "Following your family thru Italy has been fun and amazing! I sent you a message with some questions…safe travels home."}, {"username": "Christine LaMore Meyers", "comment_text": "Gorgeous"}, {"username": "Juli Leyva Nix", "comment_text": "Nice to hear! We are booked there arriving later this week. Our 13 year old loves going to the pool!"}, {"username": "Jennifer Mastruserio Groneck", "comment_text": "I love it when these things happen! How fun"}, {"username": "Joyce Plett-Vogan", "comment_text": "Awesome! That's living like royalty!!"}, {"username": "Tari Lawson", "comment_text": "Nice."}, {"username": "Renee Beal", "comment_text": "Is this Florence?"}, {"username": "Regan Verwey", "comment_text": "Looks beautiful"}, {"username": "Katharine Jackson Nichols", "comment_text": "Beautiful!"}, {"username": "Jenny Meffert", "comment_text": "Lovely way to finish your trip."}, {"username": "Victoria Russo", "comment_text": "Gorgeous place"}]}, {"id": "2199006247165120", "text": "Lovely to hear all of your stories! We are going to Venice in December to get into the Christmas spirit🎄we are staying just off St. Mark's Square, what would be the quickest and cheapest route to get from the airport please x also have any of you visited leading up to Christmas 🥳🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2199006247165120/", "likes": 0, "comments": []}, {"id": "2199008097164935", "text": "Hi we’re heading off to Praiano on Friday until Tuesday. First time in Amalfi coast. We have a trip booked to Capri on Monday possible stop at the Blue Grotto. Any other recommendations\n???", "link": "facebook.com/groups/1373361046396315/permalink/2199008097164935/", "likes": 0, "comments": [{"username": "Anthony Sperduti", "comment_text": "Path of lemons\nOr\nPath of gods"}]}, {"id": "2199012553831156", "text": "Looking to travel from Lake Como to Tirano - would value some suggestions on the best way to do this using public transport", "link": "facebook.com/groups/1373361046396315/permalink/2199012553831156/", "likes": 1, "comments": [{"username": "Rhona OConnor", "comment_text": "Use Google maps to plan your route. It will give you the options."}]}, {"id": "2199012000497878", "text": "It is hot in Rome and I need a restaurant with with air conditioning! Is this possible? Any ideas?", "link": "facebook.com/groups/1373361046396315/permalink/2199012000497878/", "likes": 1, "comments": []}, {"id": "2199022617163483", "text": "Hi everyone! I m going to Rome for 4 days, then Florence and Venice. I booked 3 nights in Florence. Do you think that s too much to visit Florence? What could I visit between Florence and venice? I m travelling by train. Thank you in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2199022617163483/", "likes": 3, "comments": [{"username": "Lucrezia Folger", "comment_text": "Too much?? No, been back 4 times, never enough time."}, {"username": "Lisa Valdovinos", "comment_text": "Do a cooking class. We did a pizza and gelato class and it was so much fun! We also did the hop on hop off bus and saw some historic sights (Galileo’s house). We walked the streets and shopped in the street markets. We were there 4 days."}, {"username": "Miyuki Kanno Paul", "comment_text": "Never enough for us that we keep going back🤣"}, {"username": "Stacy Derouin", "comment_text": "There's never enough time in Florence! So much to see and so many areas to discover!"}, {"username": "Roland Trego", "comment_text": "Two days in Florence itself, and then one day visiting Siena or Lucca by train."}, {"username": "Alice Francesca", "comment_text": "To see every museum, library, garden or building worth visiting you will need 3 weeks at least.I am Italian."}, {"username": "Erika Clinton", "comment_text": "I could spend a month there! But that’d be enough time to go see another small Tuscan city if you’d like"}, {"username": "Renae Larcus", "comment_text": "That is the minimum amount of time you would in Florence especially if you want to see more of Tuscany. From Florence you could go to Verona or Balogna on ten way to Venice."}, {"username": "Kim Geary Keidel", "comment_text": "Definitely not too much. We stayed 4 nights in Florence and wished we couples have stayed longer. (It was a base to take day trips to surrounding areas.)"}, {"username": "Wendy Byrnes", "comment_text": "1st class train travel all the way."}, {"username": "Tanya Luca Chetcuti", "comment_text": "David Chetcuti"}, {"username": "Lisa Schalig-Winter", "comment_text": "We loved Bologna. It was beautiful and the food was amazing!"}]}, {"id": "2199018187163926", "text": "I will be visiting Italy in September , looking at visiting - Florence /Pisa / Cinque Terre / Milan / Como because of time constraints I need to choose between Venice or Rome/Amalfi - Any suggestions 🙏🏻😊", "link": "facebook.com/groups/1373361046396315/permalink/2199018187163926/", "likes": 5, "comments": [{"username": "Jane Coutts", "comment_text": "Just do a day trip to Pisa from Florence ."}, {"username": "Simone Pfenninger", "comment_text": "Venice - safe Rome+Amalfi for another trip"}, {"username": "Alice Francesca", "comment_text": "Skip Pisa and see Lucca instead"}, {"username": "Brooke Heneghan", "comment_text": "I wouldn’t recommend Milan x"}, {"username": "Laura DeCicco", "comment_text": "Don’t skip Pisa, it can be done with Lucca in a day. Since you’re in a more northern area, I’d say spend no more than one day in Milan and go to Venice. Save Rome and Amalfi for a future trip"}, {"username": "Tracy Wrinn Mcdermott", "comment_text": "Venice. Keep to the north and save Rome/Amalfi for a southern Italy trip."}, {"username": "Ana Ka", "comment_text": "I would do Lucca over Pisa"}, {"username": "Renae Larcus", "comment_text": "Venice. Stay North. And Milan is a one day stop"}, {"username": "Sande Ricci", "comment_text": "Milan is amazing. So much to see there. I think people say to skip it because it's a metropolitan city. It's not like Florence or Venice but it has it's own charm."}, {"username": "Lisa DOttavi", "comment_text": "That’s a difficult choice"}, {"username": "Gommy Shirley Pribisco Brady", "comment_text": "Don't skip the Amalfi Coast! It's gorgeous!"}, {"username": "Michele Baron Vold", "comment_text": "I would leave out Pisa, Milan and Cinque Terre. Bologna was very cool. Good capital of Italy. Oldest university. Amalfi is way south. Choose either como or Amalfi. Unless you are there a month. Como starts closing down end of September."}, {"username": "Anthony McClure", "comment_text": "Rome all the way. Venice is nice but Rome has so much more to offer."}, {"username": "Colleen Dee", "comment_text": "Having been to all - my personal all time favorite was Venice. There’s nothing like it. Loved CT too, but was there in off season. Now, too packed for me & am returning to Rome because I didn’t get enough time there. As far as Pisa, besides for the tower, was not impressed."}, {"username": "Caterina Liquori-Culhane", "comment_text": "How many days. Globus has great tours to all those places"}, {"username": "Anel Van Zyl", "comment_text": "Tough choice! Depends on if you would be able to go back one day and do a more southern trip, starting from Rome and making your way down to the Amalfi coast and the Puglia area. Could even then include Sardinia and/or Sicily. If you could go back, then I would suggest going to Venice. But if you are not likely to be able to go back, you love the coast, and have always dreamed of visiting the beautiful Amalfi coast,I would say go there! Both Venice and Amalfi are magical in their own ways!"}, {"username": "Romina Lauretig Toscano", "comment_text": "Please.. forget Milan! Go to Rome Florence and Venice!"}, {"username": "Daisy Yoo", "comment_text": "U did not mention how many days , we have 14 days and I only have 3 base and no time for south"}, {"username": "Elena Eckley", "comment_text": "Venice"}]}, {"id": "2199024177163327", "text": "Travelling to Naples, Sorrento any recommendations for a good B & B ?", "link": "facebook.com/groups/1373361046396315/permalink/2199024177163327/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187782-d1297\n6518-Reviews-B_\nB_L_Arcobaleno-\nSorrento_Provin\nce_of_Naples_Ca\nmpania.html"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.kqzyfj.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187782-d1265\n3312-Reviews-So\nrrento_Flower_R\nooms-Sorrento_P\nrovince_of_Napl\nes_Campania.htm\nl%3FspAttributi\nonToken%3DMTcwO\nTQ3NjQ"}, {"username": "Grace Monaghan", "comment_text": "Casa Lucia in Sorrento"}, {"username": "Tiffany Hadfield Merrill", "comment_text": "Loved hotel mignon, Sorrento"}, {"username": "Genevieve Bastien", "comment_text": "Our family of 5 stayed at the Daily Napoli in Chiaia / Lungomare and we loved it. Breakfast was very nice and very well located. Hosts had so many great / local / genuine suggestions."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2199034233828988", "text": "Looks like power outages in Positano and it's really hot. Hope everyone pulls through.", "link": "facebook.com/groups/1373361046396315/permalink/2199034233828988/", "likes": 0, "comments": []}, {"id": "2199034373828974", "text": "Ciao a tutti!\n\nI’m travelling to Italy for the first time next month and there are a few places I would love to go but I can’t find their names…\n\nI want to try these restaurants in amalfi but I can’t find their names.\n\nCan anyone help?\n\nThank you🥰", "link": "facebook.com/groups/1373361046396315/permalink/2199034373828974/", "likes": 72, "comments": [{"username": "Tyler Matthew", "comment_text": "Following"}, {"username": "Amy Stolp", "comment_text": "Following"}, {"username": "Claudia Guerrero", "comment_text": "I just read that you can use “Google image search” but you need to use a computer. Just google: google image search and the steps on how to do it will come up. Oh and let us know what you find!! 😊 these places look beautiful!!"}, {"username": "Suzanne Feyen Bailey", "comment_text": "I’m pretty sure the 2nd pic is LeSirenuse in Positano\nVery high end hotel"}, {"username": "Shae Ann Hearn", "comment_text": "One of them is “Terrazza Cafe” & unsure on this one but another could be “Hotel L’ancora” (in their restaurant)"}, {"username": "Sally Maher", "comment_text": "F"}, {"username": "Miyuki Kanno Paul", "comment_text": "It’s in Positano"}, {"username": "Janet Randall", "comment_text": "F"}, {"username": "Chris Love", "comment_text": "F"}, {"username": "Noopur Kamble", "comment_text": "F"}, {"username": "Rita Kupfer", "comment_text": "F"}, {"username": "Leigh Russell Schultz", "comment_text": "F"}, {"username": "Meredith Holloway Helbon", "comment_text": "Following"}, {"username": "Kelly Relue", "comment_text": "F"}, {"username": "Grace Rogers", "comment_text": "F"}, {"username": "Pina Palumbieri", "comment_text": "F"}, {"username": "Johanne Guérin", "comment_text": "F"}, {"username": "Joe Visotski", "comment_text": "F"}, {"username": "Trish Di Donato", "comment_text": "Photo 3 is Bianco Bar Treville Positano ❤️"}, {"username": "Gommy Shirley Pribisco Brady", "comment_text": "Use google lens."}, {"username": "Lavinia McCabe", "comment_text": "Photo 4 is Restaurant Bruno, you can also see it written on the plates."}, {"username": "Lavinia McCabe", "comment_text": "Second picture is restaurant La Sponda, one of the best in Positano"}, {"username": "Nat Burgess", "comment_text": "F"}, {"username": "Janice Riccardi DiSanto", "comment_text": "F"}, {"username": "Gloria Goodchild- Mosca", "comment_text": "Tanya Lyn. These look amazing - dunno. If the location is on the agenda ❤️"}, {"username": "Denise Barte", "comment_text": "F"}, {"username": "Claudia Ricci", "comment_text": "F"}, {"username": "Samaria Braman", "comment_text": "F"}, {"username": "Bernadette Sarmiento", "comment_text": "F"}, {"username": "Naomi Collado", "comment_text": "Following"}, {"username": "Hanna Shivers", "comment_text": "Following"}, {"username": "Elena Innocenti", "comment_text": "There are in Positano.\nVilla Treville\nLa Sireneuse\nRistorante Bruno"}]}, {"id": "2199035310495547", "text": "Hello everyone!\n\nCan anyone suggest the best way to travel from Praiano to Ischia please?\n\nWe have had to change plans and cancel some of our honeymoon 😢 so trying to avoid additional costs of a private transfer.\n\nThanks 🙏🏻", "link": "facebook.com/groups/1373361046396315/permalink/2199035310495547/", "likes": 0, "comments": []}, {"id": "2199046887161056", "text": "Came for pizza, stayed for the views❣️ #positanoitaly", "link": "facebook.com/groups/1373361046396315/permalink/2199046887161056/", "likes": 0, "comments": []}, {"id": "2199040067161738", "text": "Any Suggestions on what to do in Brescia? Wife and I are more of a type to hang around and people watch with little touristy stuff. Wine tasting and food is are go to. Some ruins and maybe a church.\nthanks", "link": "facebook.com/groups/1373361046396315/permalink/2199040067161738/", "likes": 0, "comments": []}, {"id": "2199047280494350", "text": "Where is the best most affordable place in Rome to buy jewelry?", "link": "facebook.com/groups/1373361046396315/permalink/2199047280494350/", "likes": 0, "comments": []}, {"id": "2199052673827144", "text": "Looking for some advice - Is it better to travel to Italy in June or in September? A friend who lives in Milan has suggested June might be a better option because it rains most days starting mid-September?\nAlso, looking to go for 3 weeks as a family of 4 (2 kids aged 10 and 13). We’ve never been before so any suggestions on “absolutely must” cities to visit, places to eat and things to do would be greatly appreciated 😊\n\nThanks in advance ❤️", "link": "facebook.com/groups/1373361046396315/permalink/2199052673827144/", "likes": 14, "comments": [{"username": "Erica Senes Tombesi", "comment_text": "Pro in June longest days of the year pros in September : warm but normaly not too hot weather and no crowd, and the sea is still warm. Schools in Italy starts around 7th of semptember and ends around 7th of june."}, {"username": "Giovanni Pianigiani", "comment_text": "June has longer days (Milan has almost 16 hours of light at solstice so it's almost 4 hours more than in September); you'll find more things to do in the evenings"}, {"username": "Stacy Derouin", "comment_text": "We went in early June and the weather was gorgeous."}, {"username": "Kerry Agins", "comment_text": "We did three weeks starting Sept 25, 2022 and had hardly zero rain! The weather was wonderful and crowds much less than what I’m seeing in pics now."}, {"username": "Gommy Shirley Pribisco Brady", "comment_text": "It is cooler in Sept. Nuff said!"}, {"username": "Chris Vilsack", "comment_text": "Go in September\nIt does in Spain and Italy starting in September\n\nBut these areas are on fire this summer\n\nWhat's better? An umbrella at times\nOr stuck indoors with 39c outdoors?\nMind you, some hotels have minimal a/c\n\nIt's a crap shoot"}, {"username": "Martha Heller", "comment_text": "Personally I prefer April, May, Oct, Nov, and early Dec!"}, {"username": "Romina Lauretig Toscano", "comment_text": "Mid May for 3 weeks :)"}, {"username": "Cristina Maximciuc", "comment_text": "September is perfect and not so crowded. You absolutely must visit Tuscany if you have the time."}, {"username": "Diana Smith", "comment_text": "September! Usually the rain starts later and the weather is still beautiful."}, {"username": "Patrizia D'Arcangelo", "comment_text": "Hello. I'm Italian. It is difficult to answer because June and September are months that can be hot but can also be rainy.\nIt takes luck either way.\nhowever in southern Italy it is easy to find good weather.\nMaybe I would recommend September because Italian kids are in school and therefore you don't find local tourists."}, {"username": "Bambi Harris", "comment_text": "September has my vote! And we are going there lare September this year too :-) we went years ago not a drop!"}, {"username": "Beth Yuschak", "comment_text": "We just got back from 3 weeks in Italy…it’s very hot and very busy."}, {"username": "Barbara Bastianini", "comment_text": "I’ve been to Italy during both months several times. I had great weather every time. Of course it might be helpful to know where you plan to go. Italy is a large country and the weather can vary a lot from one geographic location to another. The weather can be very different in Puglia, for example, than in the Dolomites. So generalizing about the best weather in the entire country is difficult."}, {"username": "Karen Blackmore", "comment_text": "Currently experiencing rain in Milan! ☔⚡🌧️"}, {"username": "Phyllis Snyder", "comment_text": "September"}, {"username": "Jessica Gillson", "comment_text": "I went October last year it showed for a hour 1 out of 5 days so not really raining. Also so hot now in the summer"}, {"username": "Chic Ciccia", "comment_text": "September"}, {"username": "Cynthia Tarantino", "comment_text": "September October"}, {"username": "Simona Gacina", "comment_text": "June for sure"}, {"username": "Donna Riffle Hutcheson", "comment_text": "I went at the end of June and THOUGHT I WOULD DIE from the heat! Don’t. Do. It!"}, {"username": "Pat Germany Landman", "comment_text": "I eas there the end of May beginning of June and it was great."}, {"username": "Sylvie Hogg Murphy", "comment_text": "Well, I’d pick early June over early Sept, and late Sept over late June! (Duh!) Geography matters, though, and if you’re looking to do any beach/water stuff, in the south (Amalfi Coast, Capri, Sicily, Puglia) you’ll be fine at any time in either month, while at waterside areas in the north (eg Cinque Terre, Portofino, and the lakes) it is usually markedly cooler in early June / late Sept and a lot of the tourist infrastructure is not yet open or already closed for the season. But if I had to choose? Sept- better light, prettier pictures!"}, {"username": "Tracy Glasgow", "comment_text": "I have just been mid-June to mid-July (family of 4, kids 17 and daughter tuned 20 in Rome). France, Italy, Croatia and Greece. We only really started to feel the effects of the heat in the last 7-10 days with the heatwave, mainly Greece. I didn’t mind the early to mid 30s in the first few weeks. Milan was great and would go back in a heartbeat, also didn’t feel overcrowded late June. Definitely have 3-4 days in Milan. Duomo rooftop tour is a must. Last supper was pretty good too. Rome was ok with all the historic places but it felt dirty, graffiti and rubbish everywhere which I don’t recall from many years ago when I last visited. It was disappointing to see. Again lots of tourists given peak season but not a problem for us. We stayed near Piazza Navona. Lots of great restaurants near the square. Did the colosseum underground tour which was fantastic but the Roman forum with that was rushed - may have been our guide that spent lots of time trying to hide under a tree talking rather than letting us explore then we ran out of time as had to get to Colosseum booking. Did the crypt and catacombs tour which was ok - catacombs wasn’t what I expected as just holes in walls. Also took a day tour to Amalfi coast, Positano and Pompeii. That was fantastic although I think reading the reviews it would have been better to spend some time on/near Amalfi coast to spend longer there. Next time! Trevi fountain great early in the morning. Venice was much the same, quite dirty, ok to visit for a day or two but personally wouldn’t spend longer than that. We stayed at San Marco Suite 755 which was great for a family. Gondola rides seemed overpriced (charged 160 euros for 35 mins). Food seemed a little more expensive in Venice. If near Venice try to get to Croatia/\nSlovenia as it is beautiful. That is one place we want to revisit and sail around the islands. After arriving in Greece we started to see how overpriced restaurants were in France and Italy. But I suspect that is because we were eating at the tourist places and if venturing further to where locals eat it would have been better."}, {"username": "Bob Dook", "comment_text": "September for sure."}, {"username": "Fiona Cameron", "comment_text": "September, Ive done it several times and didn’t get rain except maybe 2 days of showers. June is very warm in Milan, and everywhere else."}, {"username": "Paola Bobko", "comment_text": "Hello Shreya Hegde Tandon\nI would say it depends on where you go. Also, unless You visit in July and august, the weather has been quite unpredictable in the last years. This year June has been very rainy and it rained almost every day even in Rome. Last year we visited the Amalfi coast for 3 weeks in September and we had just 1.5 rainy days over 20+ days.\n\nAbsolutely must go places for a first time visitor would be in my opinion: Florence (2 nights), Venice (1-2 nights), Rome (2nights), Amalfi coast (at least 7 nights, divided as follows: 2nights in Vietri, 2nights in Ravello, 2 nights in the praiano/conca dei Marini area, 2nights either Amalfi and Positano). If you have extra time you can also visit Capri (either overnight there or easily reach kt with a ferry from any of the Amalfi coast towns. A good base is also Salerno as very close to the coast and easily reachable through high speed train and car.\nIn any case, I would not choose both amalfi and Positano (to overnight) as they are in my opinion too crowded; you can always visit for a morning/\nafternoon trip. Alle the towns on The coast are quite easily accessible through ferries.\n\nA great place to go too is the Val d’orcia Region, in Tuscany. You find a lot of family owned properties where you can enjoy the best organic food, wine, pool with amazing views on rolling hills.\n\nThough, Italy has so much to see, so it would be helpful to know if you’re more interested in culture, art, food/wine experiences, beach/sea?"}, {"username": "John Layman", "comment_text": "Sept. or April"}, {"username": "Bea Kuckens", "comment_text": "September. June is hot and crowded."}, {"username": "Christine Pinto Kulp", "comment_text": "September. June is too hot. We went mid May once and it was e en too hot then."}, {"username": "Lucrezia Folger", "comment_text": "September."}, {"username": "Shannon Facette", "comment_text": "We were there in June and it was starting to get very hot and it was super busy. We thought were were going in off season but it’s not anymore."}, {"username": "Pam Armenia O'Brien", "comment_text": "I went two times in mid September to early October and we had rain maybe one day each trip."}, {"username": "Grace Scinto", "comment_text": "Depends on if you’re visiting the North or South of Italy. It really does have different weather. It gets cooler faster in the north and in the mountains. Down south it stays warm until October."}, {"username": "Steve Grossman", "comment_text": "We've been there in both months several times. Honestly I don't remember that it ever rained. We prefer the middle of september because the crowd you're gone"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "September for sure …. June is so crowded and hot"}, {"username": "Renae Larcus", "comment_text": "September. It rained once when we were there in October but never in September!"}, {"username": "Cathy Zuniga", "comment_text": "We went in mid September no rain and was wonderful."}, {"username": "Martha Lee", "comment_text": "I would take the rain over the heat anyday"}, {"username": "Roland Trego", "comment_text": "You can't predict weather these days. My personal experience is that I often run into rain in early June, especially in Liguria. June, July, and August are the months when most Americans take their vacations. September has always been super pleasant for me. In either case, the chances are that it will be crowded no matter what."}]}, {"id": "2199056130493465", "text": "what do you use to book accommodations?", "link": "facebook.com/groups/1373361046396315/permalink/2199056130493465/", "likes": 5, "comments": [{"username": "Cecilia Christine Costantini", "comment_text": "Booking - in the unlikely event of a cancellation, they will help you find an alternative, in the same area/same price range or cover the price difference if it is a bit more expensive. It happened to us 2 weeks ago, they covered a 100 euro difference (total), their customer service was pretty efficent (I called then after receiving a cancellation message)"}, {"username": "Renee W Gable", "comment_text": "Air bnb"}, {"username": "Madeline Caporale", "comment_text": "The website of the accommodation. I use booking or other site to check options, look at reviews."}, {"username": "Theresa Salerno Adams", "comment_text": "Tripmaster"}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "Booking always. Will also cross check pricing directly w hotel. Tripmasters is another awesome tool for packages."}, {"username": "Miyuki Kanno Paul", "comment_text": "The official website of each respective accommodation. Some places only use booking-dot-com\n, though"}, {"username": "Sandy Daniels", "comment_text": "Booking.com ... since 2008, never had a bad experience.... sometimes a little challenging when you get unexpected stairs... but generally always on point."}, {"username": "Roland Trego", "comment_text": "I use the big booking sites to find hotels, and then I book directly through the hotel. If there are issues, the hotel will be far more inclined to accommodate me than if I had booked through a discount site."}, {"username": "Rhona OConnor", "comment_text": "Www.booking.com all the time."}, {"username": "Casarine Temple", "comment_text": "I book directly with the hotel."}, {"username": "Bill Casper", "comment_text": "Air BNB and Booking."}, {"username": "Dann Hrusch", "comment_text": "I use a variety but prefer Booking.com as it's very upfront about price, cancellation policies, when funds are due, etc. Plus they will advocate for you if the property tries to pull something sketchy. At times I'll book direct with the property if there's a better deal or some incentive to do so."}, {"username": "Dave Colleen", "comment_text": "Hotel’s direct website"}, {"username": "Laura Uribe", "comment_text": "Almost always Booking as they are most often in city center. Hotels if I can’t find anything on Booking. Two bad experiences the only time we used AirBnb so never use them."}, {"username": "Connie Wilson", "comment_text": "Booking.com"}, {"username": "Gillian O'Callaghan", "comment_text": "Booking.com and have done for years."}, {"username": "Michelle Mercury", "comment_text": "Accor app"}, {"username": "Lalita PosBa", "comment_text": "I used Airbnb and booking"}, {"username": "Lalita PosBa", "comment_text": "Trainline is the official app for you to reserve and buy the train tickets"}, {"username": "Tracy Wrinn Mcdermott", "comment_text": "I use TripAdvisor for reviews, then book directly with the hotel."}, {"username": "Greg Saba", "comment_text": "It is good to know that booking will support you if there is a cancellation. Airbnb provides ZERO support, even if your cancellation occurs minutes before the scheduled check-in. We had this happen in June in Nice, France. Airbnb, at first said they would pay any difference (comparable prices had quadrupled since we booked) and then reneged on that blaming a trainee who wasn't aware that Airbnb does ZERO. Check out both complaints and reviews on Better Business Bureau to fully absorb the enormity of how bad Airbnb is, not only with cancellation support but also with standing behind other representations\non their site."}, {"username": "Kathy Madison Dahlen", "comment_text": "Booking & Delta"}, {"username": "Margaret Kudlowsky", "comment_text": "Airbnb"}, {"username": "Jaime Cleek", "comment_text": "Booking or Airbnb this trip"}, {"username": "Sam Mah", "comment_text": "We have been using booking dot com. We check on that site first for price, ratings and reviews. We then check the hotel/\napartment online to see if we can get it from them cheaper. We find that only 10-20% are cheaper booking direct (we thought that odd). They helped us find other accommodation when an apartment forgot to send us a follow-up email to finalise the booking, which meant we didn't have anywhere to stay that day.\nWe have found it to be good for finding apartments (that have washing machines) as those are hard to find from just a google search."}, {"username": "Elena Eckley", "comment_text": "I Don’t use third party bookings"}]}, {"id": "2199057103826701", "text": "If you are going to Procida - do yourself a favor make dinner reservation at Calacala. It is farm-to-table restaurant, that changes menu and dishes according to what is in season. The service was impeccable also.\nhttps://www.calacalaprocida.it/", "link": "facebook.com/groups/1373361046396315/permalink/2199057103826701/", "likes": 1, "comments": []}, {"id": "2199060677159677", "text": "Below official costs for public taxi from Fiumicino Airport to the center of Rome and others.\nImportant: ask for tariffa predeterminata saying that you know it is 50, pay and ask for receipt! They cannot askआणखी more than 50 euros and remember that in each cab there is name and provider's number. With this you can report in case of issue.\nHere is the link to the Rome Municipality website where you can find detailed info on taxi costs.\nYou should take a taxi showing that you know the rules otherwise some may try to rub you! Good luck :)\nhttps://www.comune.roma.it/web-resources/cms/documents/Tariffario_Taxi_REV.pdf (in Italian, English and Spanish).", "link": "facebook.com/groups/1373361046396315/permalink/2199060677159677/", "likes": 25, "comments": [{"username": "Jenny Porter", "comment_text": "Just returned from Rome\nLocal taxies at airport for short distance travel will charge what they want. Demanding €40 +. For just a few kilometres"}, {"username": "Wendy Gauci", "comment_text": "Thank you for sharing! Saving this link for our trip"}, {"username": "Daisy Yoo", "comment_text": "I agree , I would discuss the price and also drop a line saying I know the rules and make sure I take pic of his license and all , I have saved somewhere that u want to find the taxi that looks like this"}]}, {"id": "2199061203826291", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2199061203826291/", "likes": 4, "comments": []}, {"id": "2199062490492829", "text": "Wanting to catch a train from Rome to Brussels.\n\nIs there a scenic route and is it possible to hop off stay a day or two and go again making it a 4-5 day trip?\nLove to stop by a lake and coastal towns.\n\nPossible?", "link": "facebook.com/groups/1373361046396315/permalink/2199062490492829/", "likes": 0, "comments": []}, {"id": "2199062867159458", "text": "Lake Braies", "link": "facebook.com/groups/1373361046396315/permalink/2199062867159458/", "likes": 7, "comments": []}, {"id": "2199063533826058", "text": "We are thinking about Bari on our next trip for a few days. The Puglia region is very large. Any suggestions of the best area for airbnb’s, shopping and restaurants. Thanks so much", "link": "facebook.com/groups/1373361046396315/permalink/2199063533826058/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187874-d2309\n3339-Reviews-Di\nmora_Fantasia_C\nharme_B_B-Bari_\nProvince_of_Bar\ni_Puglia.html"}]}, {"id": "2199064513825960", "text": "Hiring a car for 6 days in Tuscany. Going to buy some data for google maps. How much data would we need\n\nThankyou 😄", "link": "facebook.com/groups/1373361046396315/permalink/2199064513825960/", "likes": 2, "comments": [{"username": "Steve Grossman", "comment_text": "Data is free on t mobile.\nWho are you buying data from?"}, {"username": "Brenda Fife", "comment_text": "We just used Airalo in Calabria. Bought 2gb and used it every day for driving and to pop on the odd time to search something. Used less than one gb for the week. And you can always top up easily if needed🤗"}, {"username": "Jerry Kiger", "comment_text": "If you don’t mind, what is app cost for that of a driver for 1 day? May depend on hours or distance? Wondering in rural areas if hire driver or rent car … thank you for any advice"}, {"username": "Carmine Castiglia Jr", "comment_text": "In case you didn't know it, you can pre-download \"offline maps\" for any part of the world in Google Maps.\n\nOpen Maps, zoom into the area that interests you - whether a few blocks or an entire city - tap the icon at top right corner of screen and select Offline maps.\n\nRepeat as desired.\n\nYou can use offline maps for navigation even when you don't have an active data connection. Only caveat is that, for some strange reason, they work in driving mode but not in walking mode."}]}, {"id": "2198812027184542", "text": "Staying in Cortona as home base for 4 days in Tuscany. We will not have a rental car. How hard will it be to day trip to San Gimangano and Siena?? Thanks in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2198812027184542/", "likes": 1, "comments": [{"username": "Whitney Meyers", "comment_text": "Get a driver maybe"}, {"username": "Rhona OConnor", "comment_text": "Check Google maps for the options"}, {"username": "Matteo Gallizioli", "comment_text": "without car??? uhm... San giminiano is quite far..."}, {"username": "Ishbel Raffle", "comment_text": "I see there is a train station 5 miles away. Maybe get a taxi there! Only 2 hours by train to San Gimingano. Trains in Italy are great, book online at Trainline app"}]}, {"id": "2198810237184721", "text": "Hi. How were the crowds in Lake Garda this year in early June?\n\nI was in Lake Como & Cinque Terre late May this year and found it was too crowded. Though I loved Lake Como as I stayed at a less crowded location & soaked up the devine beauty of the place.\n\nUnfortunately I can only go to Italy in early June next year due to another commitment. I would like to experience Lake Garda for a few days.\n\nCan you recommend a less crowded location that is easy access by train.", "link": "facebook.com/groups/1373361046396315/permalink/2198810237184721/", "likes": 0, "comments": [{"username": "Alice Francesca", "comment_text": "Early June is ok.I lived in Salò and it 's totally fine except for week ends.\nGet off in Desenzano by train and explore by ferry.Riva del Garda, Malcesine and Mount Baldo, Salo' and Isola del Garda, Sirmione the best places to see"}, {"username": "Stefano Follador", "comment_text": "I agree with Alice. You have quite a bit of people but it’s not impossible to cope with it. Garda Lake is really a nice area. I prefer the northern area, like riva del Garda and the valley behind it, but also Malcesine, Limone, Bardolino and Sirmione are amazing."}, {"username": "Nicola Ramoso", "comment_text": "Early June is allright, after that it become a German exclave aha"}, {"username": "Miyuki Kanno Paul", "comment_text": "Last year in early May was fabulous. We had such a great time in Lake Como and Ligurian coast! This year is something else. Everyone wants to visit everyone globally! People are everywhere Internationally\nas the post-pandemic phenomenon. We were in Positano early in May this year and already saw it was happening. We have never seen THAT many people there in early May😱. I assume that it’s going to continue for anoth year or two as people are sort of YOLO-ing"}]}, {"id": "2198812547184490", "text": "Some very helpful woman who recently returned home from Venice posted a list of Apps that were extremely helpful on her trip to Italy. IIr was very exhaustive and I neglected to save it. I’m hoping this person could maybe post it again or contact me. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2198812547184490/", "likes": 84, "comments": [{"username": "Cheryl Ann", "comment_text": "Here are the apps I used, but I didn’t find TripIt very helpful. Bounce is great for finding a place to leave your luggage while you tour before your hotel is ready. Omio is amazing for train travel. I used it the most often. However, sometimes I’d look on Omio and then purchase train tickets on TrenItalia or Italo because it was cheaper."}, {"username": "Denise Edgar", "comment_text": "Thank you"}, {"username": "Mary Pena", "comment_text": "So helpful, thank you."}, {"username": "Coralie Wehlow", "comment_text": "Nikki Grace"}, {"username": "Jay Ford", "comment_text": "Following"}, {"username": "Sarah Lybarger", "comment_text": "How does everyone use the apps while they are out and about? Pocket wifi or international plan through cell phone carrier? I have Verizon"}, {"username": "Tammy Sanchez", "comment_text": "Following"}, {"username": "Kathy Pierce", "comment_text": "I used GetYourGuide app in Italy and France, it was awesome."}, {"username": "Stephanie Saenz Bauer", "comment_text": "Stephanie Saenz Bauer"}, {"username": "Patty Maffei", "comment_text": "I just took screenshot. Just starting to plan a trip for fall 2024. I love this group. Learning so much"}, {"username": "Michele David", "comment_text": "Would someone be kind enough and type the different apps. It would be so so helpful. Gracie Mille"}, {"username": "Michele David", "comment_text": "Ok I’ve got it . Thank you"}, {"username": "Damion MacDonald", "comment_text": "Michelle MacDonald"}, {"username": "Marsha Titus Bloxom", "comment_text": "Is CDG airport still under construction? Last time there nearly missed a connecting flight. They were literally holding the door for us. Time between flights was 1hr 40min."}, {"username": "Laura Learmonth", "comment_text": "Don’t forget Rome2Rio on how to get from A to B anywhere in the world ."}, {"username": "Susan Ray Taylor", "comment_text": "This is awesome, thank you both!\n\nI've been told that the Signal app is the most highly encrypted/\nsecure Wi-Fi communication app (versus WhatsApp, etc)"}, {"username": "Susan Meagher-Robinson", "comment_text": "Maps.Me is great to find your way around without WiFi.\nYou upload the maps of each city you’re going to be in, and generally search where you want to go while at your hotel with WiFi.\n\nWhen you’re out and about it will lead you via satellite. No WiFi needed.\n\nWe’ve used it in Athens, Barcelona, Seville, Lisbon, Lagos and more.\n\nWe especially like it when we’re walking.\nIt’s free."}, {"username": "Kristina Mishevska Petrushevska", "comment_text": "install the app The Fork and get 30-50% discount on almost all restaurants. Reservation needed in advance."}, {"username": "Andy Jordan", "comment_text": "Id add Citymapper to this. Found it do useful in Venice, Rome, Florance and all along the Amalfi Coast"}, {"username": "Gloria Park", "comment_text": "PSA:\n\nIf you have an iPhone you can easily save a picture posted on FB rather than screenshot it. Tap on the picture to “open” it, tap on the three dots in the upper right, then choose “save photo.” This way you don’t get the top and bottom of your screen.\n\nMy son showed me how to do this and it’s been a game changer for me 🤓"}, {"username": "Nicole Green-Thompson", "comment_text": "I would also add Polar Steps it’s awesome to track your trip,journal and pics. Bonus is you can print it out as a photo book at the end."}, {"username": "Rhonda Hope", "comment_text": "What’s fontanelle? Weather app?"}, {"username": "Sarah Cassidy King", "comment_text": "Following"}, {"username": "Vanessa Withell", "comment_text": "There was this one for France. I took a screenshot too!"}, {"username": "Michele Hayes", "comment_text": "Chris Hayes Christina Hayes"}, {"username": "Tracy Elizabeth", "comment_text": "Keep lots of Euro coins on you @ all times!! Most public restrooms charge to use and don't take paper or credit cards!!! Learned the hard way"}, {"username": "Andrea Newman Rosenblum", "comment_text": "Ty"}, {"username": "Anna EClar", "comment_text": "I saw the picture. I have them all plus Fork for restaurant reservations and Rome 2Rio for travel planning!"}, {"username": "Cas Cracroft-Wilson", "comment_text": "Chris Cracroft-Wilson some gray app\nIdeas here"}, {"username": "Juli Fields", "comment_text": "Following"}, {"username": "Bambi Harris", "comment_text": "Maybe type apps into the search on this page and see if you can find it that way? It's worth a try :-)"}, {"username": "Jennifer Drake Forstner", "comment_text": "I saw that too…apps I remember were TripIt, google Translate and MPC"}, {"username": "Ashley Averella-Merlo", "comment_text": "I took a screen shot of her picture when I saw the post."}, {"username": "Mary Nadal", "comment_text": "Wanderlog is one of my favorite travel planning apps! There’s a premium version but I’ve found the free one to be just fine for my needs."}, {"username": "Linda Jo Rice", "comment_text": "Add Rome2Rio to that."}, {"username": "Leza Marinesi", "comment_text": "Someone posted this and I find it very useful! Has everything you could need? ￼ https://\nwww.visit-venice\n-italy.com/\nindex.html"}, {"username": "Susan Janssen Harshell Stokley", "comment_text": "Love this post. Thanks for the tips!"}, {"username": "Harris Dee", "comment_text": "Free now is a great app"}, {"username": "Alicia Goncalves", "comment_text": "Wellbeyond is an excellent app to get directions for walking. It worked fantastic for us in Venice"}]}, {"id": "2198813770517701", "text": "I am debating if I want to spend one night, a full whole day, in Capri or Revello. Any advice based upon your experience?", "link": "facebook.com/groups/1373361046396315/permalink/2198813770517701/", "likes": 0, "comments": [{"username": "Linda Snaring", "comment_text": "I love Capri! It’s so beautiful! I’ve only ￼ spent the whole day there, but would love to spend the night."}, {"username": "Jeff McLellan", "comment_text": "Overnight in Capri for sure. Totally different experience."}, {"username": "Peach Panfili", "comment_text": "Impossibile choice"}]}, {"id": "2198813933851018", "text": "Are there trains that run between Rome and Palazzo di Polignano A Mare? Weighing the cost difference in terms of going with rail versus private car service.", "link": "facebook.com/groups/1373361046396315/permalink/2198813933851018/", "likes": 1, "comments": [{"username": "Jihan Adem", "comment_text": "Get the Trenitalia app. You can look up any train journey."}, {"username": "Rhona OConnor", "comment_text": "Google maps will give you the options."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2198814443850967", "text": "Looking for ideas for best way of getting from Sorrento to Positano on the 19th September which I’m not to stressed about but I need to return from Positano on Sunday the 24th to arrive in Sorrento to catch my 05.30am bus 🚌", "link": "facebook.com/groups/1373361046396315/permalink/2198814443850967/", "likes": 0, "comments": []}, {"id": "2198815207184224", "text": "Traveling to Venice,Rome,Florence,Sorrento on October. We have a tour booked but we are looking for dinner recommendations. Any help appreciated. TIA", "link": "facebook.com/groups/1373361046396315/permalink/2198815207184224/", "likes": 2, "comments": [{"username": "Alice Francesca", "comment_text": "By any means LE TRE SORELLE restaurant on the beach in Sorrento.check it!"}, {"username": "Paula Cunningham-Kolano", "comment_text": "May I ask what your group did you use ?"}, {"username": "Stefano Follador", "comment_text": "In Venice do a “bacaro tour”. It s not a regular restaurant experience it’s more about having little appetisers in different “bacaro”, like a bar but traditional of Venezia history.\nYou can Google that but the best one should be: bacaretto da Lele, cantina do spade, cantina do mori, osteria al portego, alla vedova, osteria dai zemei and many more"}, {"username": "Rachael Richardson", "comment_text": "We just walked around looked at menu and the looked at reviews on trip advisor , never had a bad meal in 17 nights never booked , 3 adults\nYou have to see what you fancy while you are there ,\nSanta spirito area in Florence and trastevere are in Rome buzzing with lots of good restaurants"}]}, {"id": "2198819790517099", "text": "What time does the line start at the Vatican? If we to try and get there early and avoid waiting. Thanks 🙏🏼", "link": "facebook.com/groups/1373361046396315/permalink/2198819790517099/", "likes": 0, "comments": [{"username": "Jennifer Anne Trowse", "comment_text": "It opens versus early.vwe went at 0700 and went straight in. It was so peaceful"}]}, {"id": "2198815730517505", "text": "Any recommendation for some restaurants in Naples - that have great food other than pizza? Even better if they are near the Centro Storico or short taxi rides away.", "link": "facebook.com/groups/1373361046396315/permalink/2198815730517505/", "likes": 1, "comments": [{"username": "Elena Innocenti", "comment_text": "Zi Teresa\nMimì alla Ferrovia\nOsteria della Mattonella\nOsteria del Mare\nLocanda Gesù Vecchio\nTrattoria Nennella"}]}, {"id": "2198820333850378", "text": "Turin, Bergamo ou Verona?\n\nHi! Which one would you chose for a day trip from Milan? I would be with my 10 and 8th years old boys while my husband is in a conference. We are already going to Come-Bellagio-Varenna and Venise.\n\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2198820333850378/", "likes": 0, "comments": [{"username": "Erica Senes Tombesi", "comment_text": "Torino. Egyptian museum, one the biggest out Egypt."}, {"username": "Alice Francesca", "comment_text": "Hello! I live in Turin, it s a wonderful town with incredible food.Lots of beautiful architecture and home to the secondo largest Egyptian museum after the one in Cairo."}, {"username": "Alice Francesca", "comment_text": "Alice Francesca"}, {"username": "Joe-Linda Po Agustin", "comment_text": "We’re going to all 3 but if I have to choose only one, it will be Torino."}]}, {"id": "2198822747183470", "text": "Trying to book the fast train from Rome to Venice. The ones I have found are 5 hours. What is the best website to book the fast train (3 hours) and which Rome and Venice stations are best to leave/arrive to and from", "link": "facebook.com/groups/1373361046396315/permalink/2198822747183470/", "likes": 19, "comments": [{"username": "Dave Conroy", "comment_text": "Trainline ..."}, {"username": "Jihan Adem", "comment_text": "Jihan Adem"}, {"username": "Victoria Laverty", "comment_text": "Book direct italio\nSanta lucia main station\nWalk out then get vaparetto to where accom is or water taxi"}, {"username": "Rosnani Konali", "comment_text": "https://\nwww.trenitalia.c\nom/en.html"}, {"username": "Rosnani Konali", "comment_text": "Trenitalia"}, {"username": "Jane Coutts", "comment_text": "Trenitalia"}, {"username": "Maria Ariano", "comment_text": "Roma Termini - Venezia Santa Lucia"}, {"username": "Melinda Bourke", "comment_text": "I booked with railclick, these are the station names and time it took on the fast Frecciarosa train"}, {"username": "Krissy DaRusso", "comment_text": "The shortest trip I see is just under 4 hours."}, {"username": "Grace Shepherd", "comment_text": "I went direct with italo Rome to Venice in 4 hrs, booked on omio (so I could look at all the options and compare)"}, {"username": "Tracy Glasgow", "comment_text": "We did the Italo Rome to Venice which was 4 hours. Rome Termini to Venice St Lucia. St Lucia gets you right into Venice and can take the canal boats from outside the station. Venice Maestre is the station before. Depends where in Venice you are wanting to go. Booked through Rail Europe."}, {"username": "Nicola Ramoso", "comment_text": "The answers here are neither wrong but not quite right.\nThere are two high speed train operators in Italy: Trenitalia and Italo.\nTrenitalia also handles basically every regional train running in Italy.\n\nYou just go to both train operators' websites, set Roma Termini as the departure station and Venezia S. Lucia (NOT VENEZIA MESTRE) as the arrival one.\nPick the train that is more convenient to you time/price wise.\n\nhttps://\nwww.trenitalia.c\nom/\n\nhttps://\nbiglietti.italot\nreno.it/"}, {"username": "Robyn Lawson", "comment_text": "Just booked for Rome to Venice in September with Trenitalia. Just 4 hours. From Rome Termini 1035 to Venice S Lucia, Arrive 1434. Premier class $333 Australian for two people. Hope you manage to get it booked okay."}, {"username": "Rosemarie Furnari Cisluycis", "comment_text": "I decided to fly to Venice from Rome. Saved me time and $."}, {"username": "Jennifer Schmidt", "comment_text": "Question- the pass is a one-way pass or does it go round-trip?"}, {"username": "Gay Bell DiBartolomeo", "comment_text": "Gayla Faye Bell"}, {"username": "Sarah Hadjinian Kirakossian", "comment_text": "Italo is the speed train 🚊"}, {"username": "Chic Ciccia", "comment_text": "Frecciarossa (trenitalia) 4hrs."}, {"username": "Mark Mazzullo", "comment_text": "Trenitalia. And business class upgrade is like...$15!"}, {"username": "Susan Gulrajani", "comment_text": "Has anyone used Seriously Travel for an Italy tour?"}, {"username": "Domenica Calvene", "comment_text": "We just returned from Venice\nFyi book or purchase early as can fill up quick and prices go up as well due to demand.\nIt's pretty pricey travelling by train in Italy fellow Aussie here when comparing to our system.They have toilets on board, some trains are double story w plenty of room for luggage.\nIf you use the rome to rio app it will give you the cheapest first.We used this app with no issues.Very easy to navigate.\nWe had a couple of incidents with train delays on the way to venice and no air con coming back and was told we are entitled to refunds so will be looking into that.\nWhen you get to Venice ,get off at Stazione de Venizia Santa Lucia plenty off water buses and water taxis available.You can buy a pass for 9.50 euro for buses.Be patient with yourself it's pretty hectic.Google maps is your saviour.Can be used off line.\nEnjoy getting lost in Venice.😄"}, {"username": "Susan Perrey", "comment_text": "I used the omio app....best ever\nAll trains etc..."}, {"username": "Andresa GB", "comment_text": "Look on a app called omio for fast trains"}, {"username": "Fiona Cameron", "comment_text": "Trenitalia is best you can do it in English and you don’t pay any “commission” like on Rail Europe. Just make sure its the Trenitalia website not Italiatren or some other rip off!!\nHere’s a link\n\nhttps://\nwww.trenitalia.c\nom/en.html"}, {"username": "Darlene Saverino Murray", "comment_text": "Also book first class . Locals don't use it. It is worth every penny. On the train first and get sandwich and beverage included. Larger more comfortable seats and you select. Went from Rome to Venice many times. Get off at 2nd Venice stop for Venice in the pictures. First Venice stop is city of Venice. Not where you want to be. Sit back and ENJOY!"}, {"username": "Janette YesPlease", "comment_text": "I used the Rome2Rio app to see my route options and then went directly to the carrier’s site to book my tickets in case of any issues with delays, strikes, or cancelations. Here is an example of your requested route.\n\nhttps://\nwww.rome2rio.com\n/map/Rome/\nVenice,Venice?ut\nm_campaign=shar\ne&utm_source=io\ns&utm_medium=re\nferral&utm_cont\nent=segment#r/\nTrain/s/0"}, {"username": "Dann Hrusch", "comment_text": "Try Google. Just map point to point and change the travel type to train. It gives all the options, can change preferred departure times and has a link to the official site for that operator to buy tickets."}, {"username": "Jeanine Marangi Berner", "comment_text": "Use Rome2Rio app. It shows all trains and ways to travel."}, {"username": "Frannie Kaplan", "comment_text": "Trenitalia. I suppose you could take flixbus as well, they usually have wifi"}, {"username": "Lisa Alexander Blake", "comment_text": "This is from the Omio app. I look for the fast trains by duration of trip as well as how many transfers (0). I found Omio to be very easy to navigate. Once you choose your ticket, you can edit it before you pay for class, fare, seat reservation."}]}, {"id": "2198822873850124", "text": "Looking at hiring a 7 or 9 seater car in Italy and Germany for 3-5 days each. Looking for more economical suggestions then some of rental companies if there is any?", "link": "facebook.com/groups/1373361046396315/permalink/2198822873850124/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "look here https://\nwww.discovercars\n.com/\n?a_aid=NextStop-\nItaly"}]}, {"id": "2198825303849881", "text": "Hello all l love this page for all the ideas and tips. Just wanting some advice on the best way to get from Sorrento to Positano on the 19th September. I’m a solo traveller. I will also need to book return transfer from Positano on Sunday the 24th to be in Sorrento to catch my bus at 05.30am any ideas or suggestions great fully accepted.", "link": "facebook.com/groups/1373361046396315/permalink/2198825303849881/", "likes": 2, "comments": [{"username": "Jihan Adem", "comment_text": "The buses are SO easy there.\nAnd incredibly inexpensive (compared to other methods of public transport)"}, {"username": "Leigh Baguley", "comment_text": "Ferry, my wife and were there last week. Book one way, otherwise your departure time is locked in. When your ready to come back, you have multiple company/ time options."}, {"username": "Rachael Richardson", "comment_text": "Bus is like €2 and quite frequent"}, {"username": "Renae Larcus", "comment_text": "We took the SITA bus from Sorrento to Positano. Leaves from in front of the train station"}]}, {"id": "2198827643849647", "text": "Hi all. Can anyone suggest a good private tour company. We travel to Rome in September and possible train strike would like a back up plan to get to florence? As well as I also need a back up plan to get to Salerno. Is the drive from Florence and or Rome easy? Thank you for your advice.", "link": "facebook.com/groups/1373361046396315/permalink/2198827643849647/", "likes": 0, "comments": [{"username": "Cecilia Christine Costantini", "comment_text": "Flixbus bus company if trains are not running. I have used it to travel all over Europe and the buses are modern. It is just a normal bus company, not a tour company."}]}, {"id": "2198830363849375", "text": "I’m leaving for a cruise from Spain to France and then Italy on November 1st. 10 day cruise I know we’ll go back to Italy and spend time there. We are going to stay 3 days in Rome after the cruise. The weather concerns me but my husband bought this wonderful trip of a lifetime for my 60th birthday. I’m getting excited. What do you think about the weather?", "link": "facebook.com/groups/1373361046396315/permalink/2198830363849375/", "likes": 0, "comments": [{"username": "Rhona OConnor", "comment_text": "They say there is no such thing as bad weather only inappropriate clothes!! It will be a bit chilly but the good bit is there won't be mad crowds."}]}, {"id": "2198832007182544", "text": "Traveling to Italy Soon\nWould you recommend FreeNow or Uber", "link": "facebook.com/groups/1373361046396315/permalink/2198832007182544/", "likes": 5, "comments": [{"username": "Joe Guzzi", "comment_text": "For what?"}, {"username": "Poulami Saha Roy", "comment_text": "Uber"}, {"username": "Tilla Olivier", "comment_text": "Train"}, {"username": "Mark Anthony Garcia", "comment_text": "They don’t have a Uber out here"}, {"username": "Tiffany Hadfield Merrill", "comment_text": "We used Free now which had taxis & cars but rarely found any available so our hotel called taxi for us"}, {"username": "Reina Pike", "comment_text": "We used Uber in Rome with no issues at all. They were fast, reliable, and a little expensive, but worth it for us."}, {"username": "Stephen Albury", "comment_text": "Uber. It has iTaxi option."}, {"username": "Julie Tran", "comment_text": "Uber is pretty reliable only in rome"}, {"username": "Destiny Kocurek", "comment_text": "I’m in Italy now and I’ve tried Freenow multiple times a day and never get any rides accepted, we’ve had better luck just flagging down taxis ourselves"}, {"username": "Rachel Michelle", "comment_text": "Uber only does luxury rides in Italy way cheaper to use taxi."}, {"username": "Voula Ladas", "comment_text": "Freenow , ItTaxi and App Taxi. Uber is called Uber Black there and it’s more expensive than regular taxis ."}, {"username": "Clarissa Rava", "comment_text": "Neither of those. Just ask for a taxi"}, {"username": "Dianne Sloan", "comment_text": "I used uber & was connected to a local taxi company, each time the price was much higher than the quoted price."}, {"username": "Anthony Vitiello", "comment_text": "Uber worked in Rome and also offered very affordable taxi options. I didn’t need it in the other cities I visited, but it was great to use in Rome."}, {"username": "Jennifer Grimes Presley", "comment_text": "Freenow worked great for us in Rome. Another time, the hotel ordered a taxi for us."}, {"username": "Maya Ingram", "comment_text": "Uber all the way ! X"}, {"username": "Yvette Jasmine Lopez", "comment_text": "FreeNow. Uber there is not like here"}, {"username": "Diana Franceschi", "comment_text": "FREENOW\nUsed it all the time in Rome"}, {"username": "Tara Roed", "comment_text": "I’m Rome Uber worked well for me. Some of them were taxis and some more expensive. Free now never found me a car. Few times we used it to get to a vincinty then walked. It was hot so it was worth it to us"}, {"username": "John Bruckman", "comment_text": "Taxi"}, {"username": "Paola Bobko", "comment_text": "The Supreme Court just allowed Uber to operate in Italy not too long ago. It is quite overpriced and regular taxi happens to be actually cheaper. Free now works fine in bigger cities, but it is not always available."}, {"username": "Sara Beth", "comment_text": "We just went to the taxi stands and never an issue."}, {"username": "John Dobos", "comment_text": "Last week Uber great in Milan. Not many Ubers in Florence"}, {"username": "Yane Cas", "comment_text": "Uber"}, {"username": "Felicia Melo", "comment_text": "Uber never worked for me in Rome or anywhere in Italy. FreeNow works"}, {"username": "Frannie Kaplan", "comment_text": "Depends on the city. Probably freenow or MyTaxi app. What about HEETCH?"}, {"username": "Marthese Briffa", "comment_text": "Support local. Get a normal taxi."}, {"username": "Stacey Nicholas", "comment_text": "Sandy Jenaway Passmore Sarah Chapman Louise Hocknull"}, {"username": "Veronica Mendez", "comment_text": "Try the app itTaxi. Is the app all the locals use."}, {"username": "Evy Fredy", "comment_text": "FREENOW! That what I used last year in Rome & Naples"}, {"username": "Viv Bitar", "comment_text": "I like deliveroo"}, {"username": "Matteo Gallizioli", "comment_text": "uber and similar companies in Italy are not like in the US...\nit is very expensive because it does not have to compete with normal taxis"}]}]