[{"id": "2197186664013745", "text": "Heading to Lake Garda for a wedding in September, first time to Italy, what other places do you recommend? Was thinking Venice, Rome, Florence, Naples, Almalfi is it doable in 2 weeks?", "link": "facebook.com/groups/1373361046396315/permalink/2197186664013745/", "likes": 0, "comments": [{"username": "Nancy Koehler Barboni", "comment_text": "Yes, but you will do a lot of moving and packing and unpacking."}, {"username": "Connie Wilson", "comment_text": "I might eliminate Naples and Amalfi. From your base in Garda I would take a day trip to Venice. Then spend 3-4 nights in Florence with a day trip to the countryside, and finish in Rome for 4 nights. If you feel you must see Amalfi Coast, you could take a long day trip from Rome."}]}, {"id": "2197189210680157", "text": "Going to Cinque Terre at the beginning of September, staying in La Spezia. Have two days, and am looking for the best boat tour to take on one of the days! Want to be able to see all the towns from the sea and swim! Please let me know any you have taken!", "link": "facebook.com/groups/1373361046396315/permalink/2197189210680157/", "likes": 2, "comments": [{"username": "Iris Joan Price", "comment_text": "I have not been yet to Cinque Terre but looking for the same thing in October. I saw one ferry day tour of CT from Genoa and back that caught my eye. I am interested to see what others recommend."}]}, {"id": "2197189927346752", "text": "Anyone take Uber from Rome airport to cruise terminal? Cost?", "link": "facebook.com/groups/1373361046396315/permalink/2197189927346752/", "likes": 0, "comments": [{"username": "Colleen Dawson", "comment_text": "It’s an hour’s drive, so could be costly. Did you look into using the transfer offered by the cruise line??"}, {"username": "Cynthia Marie", "comment_text": "We traveled by train to and from the cruise port. Very easy"}, {"username": "Simone Pfenninger", "comment_text": "As far as I remember the official taxi fare is 125 Euro one way"}, {"username": "Rachel Michelle", "comment_text": "Train!!!!"}, {"username": "Tammy Lynn Schmitt", "comment_text": "Whew! Glad I rented a car. We are going to garage it in Rome and use it once we hit the road and start exploring the rest of the country. Even four days of garage will not cost as much as that Uber ride."}, {"username": "Shelley Howard", "comment_text": "tip it in the uber app it will tell u"}]}, {"id": "2161065750959170", "text": "Wine Tasting Montalcino and Fiorentina Dinner\nAbsorb the Tuscan atmosphere and indulge in a wine tasting class and 4-course Tuscan dinner in San Gimignano. Head to Tenuta Torciano Winery and begin sampling some… आणखी of the vineyard’s best wines accompanied with appetizers and informative commentary from the sommelier. Then sit down to a delicious Tuscan dinner that has been paired with more local wines.\nRead more about Wine Tasting Montalcino and Fiorentina Dinner - https://www.viator.com/tours/San-Gimignano/Wine-tasting-Montalcino-and-Fiorentina-Dinner/d29096-15204P21?pid=P00070587&mcid=42383&medium=link&medium_version=selector", "link": "facebook.com/groups/1373361046396315/permalink/2161065750959170/", "likes": 4, "comments": []}, {"id": "2196551637410581", "text": "They put this on the table with our drink order at Scudieri in Piazza del Duomo! I assume if we eat they charge us for\n\nAppently the admin won’t allow me to post the pic! It was a small plate of bread and mozzaआणखी sticks ….oopsie 😂 the point was if you eat it they charge you in some places. I didn’t want to take the chance 😊\n\nEdit#2 picture is here. Thank you admin 😊", "link": "facebook.com/groups/1373361046396315/permalink/2196551637410581/", "likes": 61, "comments": [{"username": "Tracy Foss", "comment_text": "They do it in Portugal & Spain as well sometimes it's hard to figure out what it is Enjoy when in Rome ..."}, {"username": "Sandra Keyser", "comment_text": "😂 You are not charged for it! Enjoy!"}, {"username": "Dann Hrusch", "comment_text": "I miss the surprise snacks! I always hope for olives."}, {"username": "Linda Arnold", "comment_text": "What if you don’t drink alcohol? Is it included with ice Tea or soda?"}, {"username": "Jaime Cleek", "comment_text": "What is this ?"}, {"username": "Frances McDonagh", "comment_text": "It's a table charge in Italy"}, {"username": "Wendy Hall Read", "comment_text": "This what? No picture."}, {"username": "Eva Salas", "comment_text": "I loved it all! Eat and drink first then ask."}, {"username": "Nancy Lewis", "comment_text": "Great snacks with drinks at bars at Lake Como."}, {"username": "Karon Patterson", "comment_text": "I was charged for bread only in Florence,, without ordering it.😆"}, {"username": "John Rodriguez", "comment_text": "I liked the part where you posted the picture for us!"}, {"username": "Laarni Velasquez", "comment_text": "Take it as an experience.Eat it so you would know ."}, {"username": "Serena Mascheretti", "comment_text": "That's an aperitivo, so the food is complimentary. You shouldn't pay more."}, {"username": "Basia Szokarski", "comment_text": "They do not charge For those snacks. It's very typical especially in Milan during happy hour. Eat away and enjoy!"}, {"username": "Basia Szokarski", "comment_text": "If you go to navigli canal area for happy hour there are many restaurants that offer a buffet that's included in the price of the drink."}, {"username": "Rosanna Hardeman", "comment_text": "Love the aperitivo! Enjoy!"}, {"username": "Manuela Marinello", "comment_text": "They don’t charge you. That’s what they normally bring when someone order a drink, an aperitivo.\nIf you are in doubt, just ask the server."}, {"username": "Kate Farrell", "comment_text": "Your on holiday! Enjoy! It will not be expensive!"}, {"username": "Alla Zats", "comment_text": "These are complimentary snacks"}, {"username": "Rachael Richardson", "comment_text": "You get these things free in most restaurants I’ve eaten in all over Italy ! They don’t charge as far as we have experienced, my daughter and I had a €5 aperol spritz and bruschetta , olives and crisps came with it too"}, {"username": "Caroline Langlois", "comment_text": "It’a aperitivo, you already pay for it in the copperto\nUsualy you need to take 2 drinks and they come with something to eat"}, {"username": "Silvia Urbinelli", "comment_text": "No absolutely. It's free. Here when you order a drink, they give you some snacks for free. It's included. If you have doubts, just ask the waiter."}, {"username": "Yelena Kruglyak", "comment_text": "My favourite place! Love desserts there!"}, {"username": "Carla Belli", "comment_text": "In Italy, you can ask before being seated if there’s a cover charge and then choose to eat elsewhere\n\nIn a number of restaurants in Spain, we were charged for a basket of plain breadsticks and small plastic pouches of olive oil so I’d happily pay for that coperto 😍"}, {"username": "Cinzia Bonciani", "comment_text": "It’s easy for many to judge quickly when certain questions are posed however I have realised from some of the questions in this group that some people have never travelled outside their own front door let alone their own country or to Italy. Not everyone has the same opportunities nor have they had the exposure to other cultures to know and understand local customs.\n\nIL COPERTO (the COVER charge - for tablecloth & bread) is charged when you sit at a table for lunch or dinner. It’s charged whether you have a tablecloth or not or whether you eat the bread. It’s not uncommon in many European countries. You’ll find this in France, Greece, Spain etc\n\nL’APERITIVO (HAPPY HOUR is the closest English translation) is a long held Italian tradition in the daily unwind from the work day in Italy during the hours of about 4-8pm before dinner. When you order a drink, food that is supplied is completely free of charge. This is a waste not way of living. Food that is not sold at “il bar” during the day is provided free to patrons towards evening so it isn’t wasted. It’s a time to gather with friends and socialise. You will be provided usually with “stuzzichini”, small snacks or bites of food.\n\nL’APERICENA is similar to the aperitivo and sometimes people use it interchangeably\n. The quantity and type of food is greater and usually you are charged for this. The apericena usually includes your first drink free.\n\nHope this helps 🇮🇹😊"}, {"username": "Susan Sharkey Carney", "comment_text": "Looks yummy!"}, {"username": "Judi Ryan Graff", "comment_text": "Bank in it"}, {"username": "Theresa Salerno Adams", "comment_text": "I never got charged"}, {"username": "Marco Brambilla", "comment_text": "Omg some people"}, {"username": "Alicia Cox", "comment_text": "Eat & Enjoy! “When in Rome, do as the Romans do”! It’s part of the experience of travel to other countries & learning other cultures. Eating in Italy is an experience - and a good one!😃👏🏻👍🏻"}, {"username": "Delia Miscella Wroblewski", "comment_text": "What?"}, {"username": "Jayne Dawson Meyer", "comment_text": "Jayne Dawson Meyer"}, {"username": "Hanan Akllouch Tihadi", "comment_text": "Just eat it..it's free"}, {"username": "Alessandro Paxia", "comment_text": "Something like potato chips or small finger food portions? It's usually includes with drinks in apertivo (aperitif) before dinner time."}, {"username": "Colleen Jennings", "comment_text": "All drinks in Italy come with some small snacks - it’s included with the price of your drink. Enjoy!"}, {"username": "Sue Ramsey", "comment_text": "We got some amazing snacks with our drinks all were free!"}, {"username": "Lorissa Gill", "comment_text": "What"}, {"username": "Nicole Jovanovski", "comment_text": "They put bread and sometimes other things on the table and even if we said no it was still charged as part of a ‘table service fee’. Usually 2-3 euros per person. Which really added up for our family of 4 over the entire trip. Nearly every restaurant we ate at charged it. We traveled all over Italy."}, {"username": "Colleen O'Brien", "comment_text": "Enjoy it!"}, {"username": "Giuseppe Placi", "comment_text": "It is for free"}, {"username": "Renee Rogers Tarrant", "comment_text": "What we encountered was a charge of $20 for each drink instead of charging separately for the appetizer plate but because I was on my bucket list trip it was lovely ❤️"}, {"username": "Judy Jamieson Pisano", "comment_text": "The coperto is a set charge for the table regardless of what you eat or drink. Every place in Italy does this. The snacks they bring with your drinks are compliamentary"}, {"username": "Lenora Bennett Mitchell", "comment_text": "What do they put on your table? There's no picture"}, {"username": "Gary Fossaceca", "comment_text": "What are you trying to say!!!!!!"}, {"username": "Ivette Lugo", "comment_text": "Ivette Lugo"}, {"username": "Steve Wolfrom", "comment_text": "Was it what everyone is assuming below or something else?"}]}, {"id": "2197046980694380", "text": "Colloseum at night.\nNo edit.", "link": "facebook.com/groups/1373361046396315/permalink/2197046980694380/", "likes": 101, "comments": [{"username": "Johnny J. Turpin", "comment_text": "Beautiful"}, {"username": "Jay Parekh", "comment_text": "Still can’t believe Russel Crowe fought there almost 2,000 years ago"}, {"username": "Ken Baker", "comment_text": "I can't work out if the night tours are running this year, it is on the coop website but not available so just not released yet?"}]}, {"id": "2197073980691680", "text": "Suggestions for best trip / tours to Capri from Praiano or Amalfi?", "link": "facebook.com/groups/1373361046396315/permalink/2197073980691680/", "likes": 1, "comments": [{"username": "Bella Brown", "comment_text": "Ferry! Takes about between an hour to 1 hour 15 minutes"}]}, {"id": "2197074620691616", "text": "Ciao,\nTell me please, how feasible is a day tour in Venice with a stroller? Or should I forget it? Obviously, I don't want to walk every street in Venice with a baby, just to see the city and go there for the Venice feeling. Doable?\nGrazie per le tue risposte 🥰", "link": "facebook.com/groups/1373361046396315/permalink/2197074620691616/", "likes": 4, "comments": [{"username": "Ingrid Zancoli", "comment_text": "Doable, but in some zones there are several bridges with steps, there you may need help with the stroller"}, {"username": "Eric Parks", "comment_text": "I would get a baby backpack. You will be contending with bridges and bumpy walkways all day. It will not be pleasant for you or the little one."}, {"username": "Pat Cray", "comment_text": "Definitely not a good idea… lots of stairs!"}, {"username": "Ann Romanowski", "comment_text": "I'm in Venice now and I would not recommend it. Especially if you are staying 10 minutes or more walk away from main monuments. It's too much of a hassle. I saw a man pushing an empty double stroller & it was such a difficult time to get by people on narrow streets. He did not look happy."}, {"username": "Katherine Wood Reeves", "comment_text": "Just went to Venice with 3 kids 4 and under. We took strollers and just picked the kid and stroller up to go over the bridges. Yes, it was a pain, but it is soo hot there I would not want to baby wear unless you are going later in the year. That sounds miserable for both you and baby. Also, pack pedialyte packets for baby. We were constantly trying to get the kids out of the heat and to drink something."}, {"username": "Leila Jane", "comment_text": "Too many bridges which have steps which would make a stroller very difficult."}, {"username": "Kristina Ruk", "comment_text": "It is possible but have to work out to take stroller up and down with \"few\" steps🤣🤣"}, {"username": "Suzanne Mills", "comment_text": "Not feasible. Get something to carry your child on your front"}, {"username": "Heidi Hutson", "comment_text": "Steps. Everywhere."}]}, {"id": "2197138504018561", "text": "I had ‘walks’ tickets with guided tour for colosseum for this Monday. Now I heard lot of cancellations and looked at coopculture website.\n\nI found and purchased the full experience ticket with access to arenaआणखी from coopculture website. It is at 9:30 AM. Before I cancel my walks tickets, I saw people posting that coopculture includes guided tours with the ticket. Where can I find the information about guide. Will they provide guide by default or do we need to request one? What are the other options for guide - audio or app or person.\nIt will be very helpful if you can give some pointers.\nPicture to get attention.", "link": "facebook.com/groups/1373361046396315/permalink/2197138504018561/", "likes": 14, "comments": [{"username": "Liz Anne", "comment_text": "We used LivTours yesterday and had a fabulous experience."}, {"username": "DeAnna Pulliam Like", "comment_text": "I used the Rick Steve's app and downloaded the audio tour. It is free. Our family enjoyed it... and you aren't stuck in a big group and can pause and move around on your own time."}, {"username": "Alissa Ingram", "comment_text": "Our tour through Project Expedition and last minute I got entrance tickets through Tiquets. It was supposed to include a downloadable app with audio guide but it wouldn’t download. However, we were able to rent the individual audio guides for I believe $6 or $7 euros each when we got there."}, {"username": "Victoria Laverty", "comment_text": "We used walks did not cancel was great night underground"}, {"username": "Ellen Edmonds-Wilson", "comment_text": "Your ticket from coop will tell you what’s included and where to meet if it’s a tour. Didn’t you get an email or electronic ticket?"}, {"username": "Shen Min Chue", "comment_text": "If the title of your ticket is the Full Experience with Arena access, then there is no guided tour associated with it. If you want a guided tour, you must buy from Coopculture the relevant ticket types which include the guided tour, for instance the Wonders of the Colosseum ticket. The Coopculture website will detail under the different ticket types what is included and what is not."}, {"username": "Lucy Lou", "comment_text": "i booked through viator, has anyone had experience with this before? I am open to other recommendations\n. Thanks in advance."}, {"username": "Dayna LaFond", "comment_text": "We did Walks tour and our guide was amazing. It was a great tour and we bypassed the majority of the lines."}]}, {"id": "2196661840732894", "text": "Hello to all, my boyfriend and I are traveling to Italy the last week of Aug thru first week of September. I hear everything is pretty much shut down the month of August. We plan on flying into Rome from London. Will there be historical places to visit in Rome last week of Aug? Also, planning on heading down to Taormina via the coast after ￼Rome. Any trains traveling from Rome down the coast? And what are the must see/stops along the way? Thank you in advance￼.", "link": "facebook.com/groups/1373361046396315/permalink/2196661840732894/", "likes": 2, "comments": [{"username": "Alice Francesca", "comment_text": "Shut down? August? It s peak tourist season! You will have no trouble..everyt\nhing is open!"}, {"username": "Dianne West", "comment_text": "August is crazy busy. if you haven't booked accommodation yet I'd get onto that. I've just come back from 5 weeks in Italy and in the main areas the accommodation was crazy."}, {"username": "Greg Saba", "comment_text": "Yes on train Rome to Sicily. You may not have a lot of time to make stops along the way but there is Pompeii, Sorrento, Amalfi coast, Capri, Tropea, Scilla to name a few. Train goes on ferry for short ride to Sicily."}]}, {"id": "2196800970718981", "text": "Does anyone have a car service they would recommend for Rome Airport pick up? Thanks in advance", "link": "facebook.com/groups/1373361046396315/permalink/2196800970718981/", "likes": 0, "comments": [{"username": "Johnny J. Turpin", "comment_text": "I used a taxi. Set fare of 50 euros to city center."}, {"username": "Carrie Teller Badger", "comment_text": "Romecabs.com"}]}, {"id": "2197024464029965", "text": "Inquiring if anyone has recommendations for car hire at the airport to take us to our hitel. Thanks in advance", "link": "facebook.com/groups/1373361046396315/permalink/2197024464029965/", "likes": 0, "comments": [{"username": "Ellen Edmonds-Wilson", "comment_text": "From where to where? You want to drive or do you want someone to drive you? You need to edit your post to be more specific."}, {"username": "Allison Carlisle Young", "comment_text": "We used limousinrome.co\nm. He relies quickly with quotes and availability. We were very happy with the service."}, {"username": "Heather Hills Jacobs", "comment_text": "What airport?"}]}, {"id": "2197017204030691", "text": "Looking for recommendations for walking food tour in Sicily?", "link": "facebook.com/groups/1373361046396315/permalink/2197017204030691/", "likes": 0, "comments": []}, {"id": "2197036097362135", "text": "Colosseum is a must!", "link": "facebook.com/groups/1373361046396315/permalink/2197036097362135/", "likes": 10, "comments": []}, {"id": "2197037494028662", "text": "I am at the airport in Milan waiting for my flight back to the US after a 2 week trip. Don't let people on here freak you out before you go. Wear what you are comfortable wearing, and your flip-flops are fine if you like them. I saw lots of people that had baseball caps on. I traveled to 5 cities with my family, and took the subway, trains andआणखी taxis by myself. Didn't ever feel unsafe and shouldn't have wasted money on a Travelon bag. Go, enjoy yourself and be aware of your surroundings, as you would anywhere. Bring a shawl for the cathedrals. Ciao!", "link": "facebook.com/groups/1373361046396315/permalink/2197037494028662/", "likes": 224, "comments": [{"username": "Joanne Smith", "comment_text": "Totally agree!!!"}, {"username": "Debbie Fusco", "comment_text": "💯 agree"}, {"username": "Brian Marcus", "comment_text": "Absolutely!"}, {"username": "Joanne Fish", "comment_text": "I ❤️ my Travelon bag. Especially in Spain. My friend got physically assaulted by a very aggressive women for the gold bracelets on her arm. You just don't know\nI agree with everything else you said"}, {"username": "Sandra Desmond", "comment_text": "You still have to be careful ❗️ wherever you go in any country"}, {"username": "Lisa Minichini-Dowty", "comment_text": "THAT AIRPORT IS HORRIBLE TO NAVIGATE LOL right Michele Perrone😂"}, {"username": "Irene Oda", "comment_text": "I've got 2 Travelon purses. Both used over many years of travel. Never had problems with pick pockets. Peace of mind is priceless though."}, {"username": "Angel Leckner", "comment_text": "We are also leaving from Milan, MXP tomorrow - would you please tell me if there is any souvenir shopping available at the airport? My girls are wanting some fun shirts/\nsweatshirts that just say Italy (or the name of some of the many cities we have been to) however we have not had luck finding much…"}, {"username": "Cynthia Marie", "comment_text": "I agree, so much misinformation on here."}, {"username": "Kim Geary Keidel", "comment_text": "In Florence, I was glad I had my ￼Travelon backpack. I felt a tug on it when I was in a very crowded area. There was a group of four or five men behind me and around me. I’m sure one of them was trying to unzip the backpack. ￼"}, {"username": "Laurie Johnson-Daley", "comment_text": "Sounds like you had a great trip!\nLearned from a tour guide born and raised in Amsterdam to use a lanyard or a safety pin on a zippered pocket, handbag, etc. she’d been all over the world and never had an issue."}, {"username": "Iris Joan Price", "comment_text": "I have not been in Milan Airports lately (there are more than one), but it seems like every major airport and train stations in the big cities have huge modern shopping malls."}, {"username": "Allan Olexa", "comment_text": "Great anecdote!!!"}, {"username": "Jacquie Johnston", "comment_text": "👍"}, {"username": "Tina Taylor", "comment_text": "My husband always thought he was careful could not be pickpocketed- until…we were in a crowded tram and even though he had his hand on his zippered bag around his waist- he was “bumped” into rather aggressively and before he knew it the bag was unzipped and folder with passport gone! Pickpocket guy thought it was a wallet with money - he didn’t get that- but still we had to spend a full day in the American embassy getting a temporary passport. I always carry my travelon bag - never a problem."}, {"username": "Rania Mourad", "comment_text": "Could you post you Itinerary please?"}, {"username": "Susan Waltz Dean", "comment_text": "Travelon bags are effective against slash-and-grab thieves. Some other bags can literally be sliced off your body (if not reinforced) by thieves on scooters working in groups. I’ve never had an incident myself, but I’ve noticed that some people (older, can’t move easily, etc.) like the extra security. I try never to be the “weakest gazelle” to be cut from the herd! My valuables are all zipped into interior pockets and my crossbody has nothing of real value in it."}, {"username": "MyTrinh Tammy Nugen", "comment_text": "MyTrinh Tammy Nugen"}, {"username": "Katty Veneno Perez", "comment_text": "Marta Lorenzo"}, {"username": "Marta Lorenzo", "comment_text": "Thank you for sharing!!!!"}, {"username": "Louise Wilson", "comment_text": "You are right about clothing - no one really cares what you wear, so just be comfortable. I have traveled the world solo for 20 years, and never once had any problems with security issues - just take any common sense precautions you would use in your own country. :)"}, {"username": "Sandra Keyser", "comment_text": "Sandra Keyser"}, {"username": "Peach Panfili", "comment_text": "TYI Flip Flops may be fine in the US or UK but if you’re intending to visit The Cinque Terre it would be wise to leave them and open toed sandals behind, as due to the large numbers of tourists who’ve had to be rescued because of accidents whilst hiking between the villages,, large signs and bans have been put in place with fines starting from 50 euros to thousands."}]}, {"id": "2197056150693463", "text": "I found it interesting and thought it would be nice to share it with you.", "link": "facebook.com/groups/1373361046396315/permalink/2197056150693463/", "likes": 0, "comments": [{"username": "Ana Ferreira Ruffel", "comment_text": "Whatever you posted can’t be seen!"}]}, {"id": "2197050810693997", "text": "Dreamy Venice", "link": "facebook.com/groups/1373361046396315/permalink/2197050810693997/", "likes": 18, "comments": []}, {"id": "2197052137360531", "text": "Hi All,\nI’m planning a trip visiting Venice, Pisa and Rome with my 5yr old kid and Mother-in-law. MIL cannot walk for a long time so planning to rent Wheelchair. Looking for wheelchair rentals ideas or do we get wheelchair in tourist places? Other suggestions also welcome for wheelchair users. TIA.", "link": "facebook.com/groups/1373361046396315/permalink/2197052137360531/", "likes": 2, "comments": [{"username": "Tania Lediard", "comment_text": "Take note, Venice is going to be extremely challenging, even with a wheelchair."}, {"username": "Billie Begley", "comment_text": "For Rome do a golf cart tour."}, {"username": "Rita Kanten", "comment_text": "Unfortunately very few places in the cities you mentioned are wheelchair friendly. There are lots of steps and the streets in the tourist areas are mostly cobblestone or brick. If your mil could manage with a walker it would be easier. Still a challenge but not as difficult as getting a wheelchair around."}, {"username": "Camille Wittenhagen", "comment_text": "Moving around with a wheelchair will not really be possible. Those with decreased mobility will struggle so much in these ancient cities. I never saw a wheelchair in 16 days last year in these cities. Better rethink taking her with you."}, {"username": "Julia Ruby", "comment_text": "Rome itself is eminently doable with a wheelchair as long as they have a strong pusher or it is electric. It is quite flat in the center and there are plenty of pavement gaps for wheeled vehicles of all kinds to cross streets.\nI think it is very true that Venice might be a real challenge due to all the bridges which involve steps up and down."}, {"username": "Alice Francesca", "comment_text": "Try and rent a golf cart to get around in Rome.In Venice just use ferries to get to one place to the other but really not duable on a wheelchair, too many bridges."}, {"username": "Rhona OConnor", "comment_text": "Places tend to have toilets downstairs. This might be a challenge."}, {"username": "Cindy Sguazzin", "comment_text": "As a wheelchair user I must say that I found Rome to be not too bad (for my pusher), but Venice is impossible unless you just hang out in St. Mark’s Square and visit the Cathedral, the Doge’s Palace, have a beverage and enjoy crowd-watching and the music—which I did! (I had visited many times before when I wasn’t disabled.)"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2197060217359723", "text": "Looking at saying Puglia for 4 nights any recommendations\non “must see” and great accomodation .\nTIA", "link": "facebook.com/groups/1373361046396315/permalink/2197060217359723/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g1575039-d153\n4860-Reviews-Bo\nrgo_Egnazia-Sav\nelletri_Fasano_\nProvince_of_Bri\nndisi_Puglia.ht\nml"}, {"username": "Valentina Daprile", "comment_text": "Puglia is a very large region. What do you like to do? You ha e the north with the Gargano further down Trani Andria and Bari the middle with Valle D’Itria, and its many towns to visit, beautiful coastline of monopoli\nAnd polignano the tip with Salento, Lecce his baroque and gorgeous seaside towns."}]}, {"id": "2197082657357479", "text": "Hi guys, anyone knows how car insurance works in IT for rented cars? Is it mandatory to get extra ones in case not to pay if accident happens but its not your fault? Had some bad experience and had no time to check in other countries so was wondering to ask here before moving there.\nTy", "link": "facebook.com/groups/1373361046396315/permalink/2197082657357479/", "likes": 1, "comments": [{"username": "Agne Sa", "comment_text": "Take a full insurance with 0 eur excess and you will not have any worries 😁"}]}, {"id": "2197063170692761", "text": "Must do’s in Rome, Venice, Bellagio, Monterosso, Tuscany Lucca, Amalfi. Any ideas are appreciated 🏖️", "link": "facebook.com/groups/1373361046396315/permalink/2197063170692761/", "likes": 0, "comments": []}, {"id": "2197073864025025", "text": "Hi fellow travellers, we are heading to Italy from 14 August to 1 September and keeping away from the main tourist areas. We are staying in various Air Bnb locations for 2 or 3 nights each place. We are staying in the following locations\nIsera\nPoppi, Tuscany\nMontesilvano\nMassafra\nCollelongo\nMontepulciano\nCorte Bianco\nSirmione\nFie\n\nANY recommendations for 'local' sightseeing in each location, I am so EXCITED about travelling independently with a hire car 🚗 😊🥰 with my partner", "link": "facebook.com/groups/1373361046396315/permalink/2197073864025025/", "likes": 0, "comments": []}, {"id": "2197074650691613", "text": "Hi everyone\nI am travelling mid September to Rome with my son. He is going to a soccer tour in Pescara after we spend 3 nights in Rome. I am hoping to do 5 days travel down to Sorrento, capri, Amalfi and Positano before I head to Pescara. I will be on my own so feeling a little nervous about getting around. Would love some advise on a bit of anआणखी itinerary including how to get to each place. I have booked 4 nights in Meta (can be cancelled) and then 6 nights in Pescara. I do love just wandering around, going to the beach and of course eating and drinking! Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2197074650691613/", "likes": 5, "comments": [{"username": "Natalie Walsh", "comment_text": "What a brilliant trip!! Congratulations\nto your talented son! I know you and your son will have the time of your life!"}, {"username": "Kay Rendall", "comment_text": "Amalfi so so safe at night, walk anywhere. September will be my 9th trip. 2nd solo. Magic area. I am young 70's. Don't know the other areas u mention. U will enjoy. Italian people so helpful and other tourists r friendly. Just soak up the magic Italy. Wander the back streets, look up, see the laundry strung from 1 apartment to another, the locals chatting from 1 building to another. The children playing on the street, after the tourists leave. The locals sitting on their chairs in the street, chatting to their neighbours in too hot inside. Greet them with a Bono Sera. U may get into a conversation or a big smile. A way of life most of the world has forgotten unfortunately This is why I have been drawn back 9 times Again August for 11 weeks solo, public transport.\nSavour every minute."}, {"username": "Nathan Earl Stellenberg", "comment_text": "My wife and I are also doing Italy in mid September. Starting Venice Florence Tuscany and Rome 6 days then 4 day's for Sorrento Capri Amalfi Coast and Ravello. Have seen many posts suggesting speed trains and ferry best options and in some instances taxi."}, {"username": "Diane Petonito Giordano", "comment_text": "The trains r very easy. Once in the Amalfi coast u can take boats to Capri, sorrento, Amalfi, Positano. Etc. Minori is a quaint little town next to Amalfi & it’s not as crowded. U can also take a bus up to Ravello from Amalfi"}, {"username": "Yvette Pavone", "comment_text": "HONESTLY you will be fine traveling alone to Amalfi! It is very pleasant and the people are very nice. Lots of tourist, shopping site seeing. You will be fine! Enjoy"}, {"username": "Kylie O'Loughlin", "comment_text": "Wow what a great trip. V jealous xx"}]}, {"id": "2197078317357913", "text": "Our group, four couples, is staying in Rome after a cruise. What is the easiest way to get from the cruise terminal to our hotel in Rome, for us and our luggage?", "link": "facebook.com/groups/1373361046396315/permalink/2197078317357913/", "likes": 2, "comments": [{"username": "Elena Cerilli", "comment_text": "It’s a long drive from Civitavecchia to Rome. We hired a private transfer car service. We liked Cabroma but there are others out there as well."}, {"username": "Johnny J. Turpin", "comment_text": "We took a taxi for a set fare. Cruise line offered a bus, but it dropped off at a metro stop and still would need to take a taxi to hotel. Cost was cheaper by taxi directly from port to hotel"}, {"username": "Ellen Edmonds-Wilson", "comment_text": "Easiest is a private transfer, but it’s not the cheapest."}, {"username": "Nadia Filice", "comment_text": "Hire a private transfer bus."}, {"username": "Connie Wilson", "comment_text": "Ask your hotel for a suggestion. They usually use certain suppliers."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Car service."}, {"username": "Mandie Cowan", "comment_text": "The train. Super easy to navigate and economic too!"}, {"username": "Michelle Murphy Margolati", "comment_text": "Blackberry Car Service"}, {"username": "Marjie De Villa Lorica", "comment_text": "At the official website of “Port of Civitavecchia”—\nthere is an option for Private Transfer or Shared Shuttle Service.\n\nIn October 2022, my husband and I took their private transfer from Rome City Center to Civitavecchia Port ( right to the ship) for 150 euros. They also offered us Airport tranfer to our Hotel in Rome for 55 euros.\n\nIt was very convenient and prompt service."}, {"username": "Megan Louise", "comment_text": "We caught the local train- very easy and inexpensive just do your homework on which train to catch."}, {"username": "Jenny Payne", "comment_text": "Hire a driver🌻"}]}, {"id": "2197080947357650", "text": "Thank this group for helping me get our family ready for this trip to Italy. We did the 815 breakfast at the vatican this morning that I purchased directly through the vatican site. I was worried about crowdsआणखी pickpockets etc. It was crowded but being from nyc it wasn't any worse than museums back home except for the no air-conditioning. My 11 year old started to not look so good in the heat and I whipped out our portable fans and the cooling towels which were a huge win. It's in the 90s now and humid. But we re in italy and enjoying every minute. He did have to remove the cooling rag when we entered the Sistene Chapel which was no problem just want to give you a heads up. It's magical", "link": "facebook.com/groups/1373361046396315/permalink/2197080947357650/", "likes": 81, "comments": [{"username": "Rita Sanza", "comment_text": "Glad you enjoyed your holiday"}, {"username": "Linda Chase", "comment_text": "Makes me happy to see kids enjoying great art!"}, {"username": "Sandy Lieblein", "comment_text": "Thanks for the info! I’m about to purchase our breakfast tickets also. My husband says 8:15, and I was thinking the 7:45. He was worried about getting there on time for 7:45. Now that you have gone what are your thoughts? Thank you!"}, {"username": "Liz Anne", "comment_text": "We were at the Vatican this morning as well. So beautiful! The water fountains all over Rome are so helpful! It's hot, but so worth it!"}, {"username": "Donna Gail Devall", "comment_text": "I have 34 days before our trip.\nFirst time! Is there a dress code for certain place. Vatican etc…"}, {"username": "Giorgia Petraia", "comment_text": "You shouldn’t go to museums dressed as you we’re going to the amusement park though"}, {"username": "Rachel Harker Pfutzenreuter", "comment_text": "Nice! Great he had shorts that were long enough, not sure my boys do currently 🙂. Cooling rags too"}]}, {"id": "2197095927356152", "text": "If you are in the Abbruzzo region, you must travel to Villa Santa Maria for Ristorante Donna Rachele.\n\nRistorante Donna Rachele was the most authentic Italian experience during our three week travels through Italy.\n\nThe quality of the food and service was of a very high standard. With local Chef Daniele Stanziani and his son Luciano showcasing culinary skills passed down through generations of the local famous chef school which is well known throughout the Abbruzzo region. Utilising the best produce of the Abbruzzo region which included locally sourced meats, cheeses, wines and other liqueurs.\n\nThe quality of the service was of a very high standard with the fine dining etiquette shown by the waiters who showcased extensive knowledge of the cuisine provided and the patience to explain to us the background of each local dish and what part of Abbruzzo it was produced (in english).\n\nWe travelled 35 hours to arrive in Italy from Australia, and we would happily do it again to visit Ristorante Donna Rachele. We fully recommend this fine dining and authentic Italian culinary experience.\n\nThe Stanziani family is well known on the culinary scene and also have restaurants in Venice.\n\n***\n\nFor those still reading - this is a very brief backstory.\n\nVilla Santa Maria is where my family are from (my dad and my nonna's village).\n\nWe were staying with family in the Abbruzzo region however it was looking like we were unable to come to the village - because we reached out to the beautiful community in Abbruzzo for the bus timetable who informed us there were no busses on Sundays.\n\nWe subsequently received a response from a well known resident who very kindly offered to pick us up from our location (1.5 hours away) and take us on a full day tour of the city and the region - we were completely overwhelmed by his kindness and local knowledge.\n\nWe spent the whole day together (we are family now) and he recommended this restaurant as we were seeking an authentic experience and locally sourced ingredients.\n\nHe also took us to the trabucco along the coastline of Pescara area (Abbruzzo is famous for this). These were formally fishing huts, now restaurants.\n\nWe have spent a bit of time here to see family and the region is so beautiful - our favourite part of our trip.", "link": "facebook.com/groups/1373361046396315/permalink/2197095927356152/", "likes": 7, "comments": [{"username": "Tracy Rossi", "comment_text": "Wow ! We were there last weekend visiting family"}, {"username": "Elena Dompa", "comment_text": "Τhanks for sharing!!"}, {"username": "Frank Minnucci", "comment_text": "I hope you booked the ristorsante celia..... looked packed out"}]}, {"id": "2197099877355757", "text": "After advice, have 15 days to get from Rome to Milan, after places to stop on the way. Would love any small hidden gems that we can stop at for a few nights on train/bus routes. Not interesting in big cities - thanks for any help.", "link": "facebook.com/groups/1373361046396315/permalink/2197099877355757/", "likes": 2, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nnextstop-italy.c\nom/\nvirtual-tours/\nlucca-walled-cit\ny/"}, {"username": "Joseph Ceci", "comment_text": "Massa Martima, Arezzo, Prato, Brescia; all accessible by train or bus and not full of tourists."}, {"username": "Jerry Kiger", "comment_text": "Steve Steve Teresa Pitt\n\nDo you have hotels booked over those 15 days or plan to get as you venture out? Curious I plan to go another summer and wondering if should boo hotels all months prior or if just main in/out Italy and do inside Italy once there, would be July/Aug. thanks any tips"}, {"username": "Immi Walker", "comment_text": "Special sunset place , overlooking beautiful road, hills and stick thin trees\n💗💗\nAt Curva della kalla\nYou can find the pin drop on twosome traveller Tuscany video"}, {"username": "Cindy Sguazzin", "comment_text": "Hi—years ago some relatives I was visiting in Rome took me one day to Tivoli! We went by car, just for the day, but I’m pretty sure you could find a bus. It’s very near Rome, makes a wonderful one-day trip, and is both historically fascinating and very, very beautiful! I remember particularly the splendid, elaborate fountains and the elegant ruins!"}, {"username": "Irene Oda", "comment_text": "Orvieto?"}, {"username": "Alice Francesca", "comment_text": "Stop in Orvieto/\nSpoleto/Assisi .Then Tuscany: Siena/Lucca/\nArezzo."}, {"username": "Dana Green", "comment_text": "Val d’Orcia!"}]}, {"id": "2197100750689003", "text": "Dear all,\n\nAny hidden gems in Sorrento or Sant’ Angelo for lunch , dinner or desert you have discovered and would recommend?", "link": "facebook.com/groups/1373361046396315/permalink/2197100750689003/", "likes": 3, "comments": [{"username": "Jason Hobel", "comment_text": "Check out Parrucchiano.co\nm it is in the middle of a Lemon Grove. The front entrance may not look very inviting but go in and check it out. It was very good."}]}, {"id": "2197101934022218", "text": "We have someone who cannot walk or stand for a long time with us so we rented a car. How early should we go from Sorento to Positano or Amalfi to avoid traffic?", "link": "facebook.com/groups/1373361046396315/permalink/2197101934022218/", "likes": 0, "comments": [{"username": "Sandra Timi", "comment_text": "F"}, {"username": "Simone Pfenninger", "comment_text": "Around 6am"}, {"username": "Tania Lediard", "comment_text": "Not so much the traffic as the actual driving and lack of parking. Pay close attention on the curves for oncoming busses as they sometimes have to swing into the oncoming lane."}, {"username": "Sandy Radican Shikaly", "comment_text": "Be aware of the alternate day driving restrictions based on your license plate number"}]}, {"id": "2197106924021719", "text": "Anyone have any tips for a day trip from Florence to Siena by train? Planning a trip for April 2024", "link": "facebook.com/groups/1373361046396315/permalink/2197106924021719/", "likes": 0, "comments": [{"username": "Monica Sucato", "comment_text": "Unfortunately train connection Is not really an option...better\nby bus or preferably by car."}, {"username": "निनावी सहभागी", "comment_text": "It appears that there are trains running from Florence to Siena. I was really hoping for some interesting ideas to see and do on a day trip in Siena\nThanks so much ☺️"}, {"username": "Marie Barré", "comment_text": "We used a private driver. Highly recommend. But he books up quickly.\n\nhttps://\nalessandrocammil\nli.wordpress.co\nm/"}]}, {"id": "2197116940687384", "text": "Best time of year to go to Italy other then summer still want hot weather but not wanting to spend $$ for them months", "link": "facebook.com/groups/1373361046396315/permalink/2197116940687384/", "likes": 15, "comments": [{"username": "Donna Gilardone Szwabowski", "comment_text": "Late April, May, Mid-late September and October. I was in northern Italy and Florence in April, some rain but otherwise light jacket weather"}, {"username": "Mary Evans", "comment_text": "October"}, {"username": "Adriana Rodriguez-Argueta", "comment_text": "End of Dec, beginning of Jan"}, {"username": "Marjie De Villa Lorica", "comment_text": "We went to Rome for three days pre- cruise in mid October 2022, and the weather was mild in the morning, but got warmer mid- day. There were crowds at top sights like Trevi Fountain, Pantheon- lines go fast though, Spanish Steps, and Colosseum.\n\nWe visited the historic center again early in the morning— and it was great- cool weather and much less people expectedly.\n\nAmalfi, Pompeii and Taormina (very lovely) were crowded too- (maybe from cruise people going on day trips like us😁)"}, {"username": "Samantha Pavanello", "comment_text": "Settembre, maggio o inizio giugno"}, {"username": "Linda Papavero Snyder", "comment_text": "Went September of 21 & going this September & it was amazing."}, {"username": "Simone Pfenninger", "comment_text": "Mid June"}, {"username": "Vilma Pamintuan", "comment_text": "Oct"}, {"username": "Ilaria Verda", "comment_text": "After mid sep, early oct"}, {"username": "Wolly Valentina Losi", "comment_text": "Maggio o settembre"}, {"username": "Brian McGraw", "comment_text": "Late September to mid-October is the ideal time to visit Italy.\n\n3 reasons.\nThis is shoulder to low season.\nThis means less crowds, and less cost.\n\nThe weather is ideal. Still warm to hoodie weather\n\nGrape crush and the harvest is happening.\nAsk your favorite winery when vendemmia begins if you want to stomp grapes."}, {"username": "Deana Miller", "comment_text": "We went for 3 weeks from oct 12th and it was lovely and quiet in places"}, {"username": "Karen Smart", "comment_text": "We went the end of April, beginning of May. Great weather!"}, {"username": "Ali Swing-Lowe", "comment_text": "Any month expect October as I want it all to myself."}, {"username": "Bonny S Boggs", "comment_text": "September-Novem\nber best but anytime is great"}, {"username": "Alessandra Bonafè", "comment_text": "September/ october/ april / may"}, {"username": "Christine Kogucki", "comment_text": "Isn't October the start of the rainy season for Italy?"}, {"username": "Rita Kanten", "comment_text": "October!"}, {"username": "Alexandra A Welker", "comment_text": "Beginning to mid October"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "If you want 100+ degree temperatures you have no choice but to go in July/August when prices are at their highest."}, {"username": "Mandie Cowan", "comment_text": "Does anyone know what the beginning of November is like?"}, {"username": "Rebecca Korpershoek", "comment_text": "Last time I was there was last 2 weeks of September, brilliant weather, still in shorts/\nt-shirts during the day, need a jumper for evenings when it cooled off & busy enough for everything to be open. I would say early October would be similar"}, {"username": "Larry Reinier", "comment_text": "Good luck"}, {"username": "Sarah Down", "comment_text": "I thought a lot of places in southern Italy closed up from end of September ??"}, {"username": "Donna Mangone", "comment_text": "Late September to middle of October."}, {"username": "Diana Smith", "comment_text": "End of September."}, {"username": "Debbie Potter", "comment_text": "I'd say June or September...im gonna watch the weather in September this year for our trip next year."}, {"username": "Lori Sammons", "comment_text": "March and September is the best to go! Perfect weather"}, {"username": "Helen Louise", "comment_text": "We had 2 weeks in Puglia in first half of October, plenty warm enough and very little rain. Have been to Rome in Oct & even managed breakfast on a roof terrace in Florence in early Nov before now. I think October is a great month to travel"}, {"username": "Sheryl Upplegger Matthews", "comment_text": "First part of February, ski trip northern italy."}, {"username": "Angela Gilmore", "comment_text": "End of May or end of September. First week of June too"}, {"username": "Dana Marie", "comment_text": "October"}, {"username": "Glen Bentley", "comment_text": "We went end of September for 13 days in the north - Florence etc. expect rain. However it wasn’t like Blighty - couple of downpours just take a ‘Mac’ or brolly. Remember to have your leisurely lunches."}, {"username": "Ross Jenner", "comment_text": "What’s end of august like ?"}, {"username": "Annick Hupperetz", "comment_text": "Mid May."}, {"username": "Phyllis Snyder", "comment_text": "Fall"}, {"username": "Delly Tracy", "comment_text": "September and October, april may and june ate high season so they will be more expencive than other months if the year"}, {"username": "Elena Boetel Sutton", "comment_text": "October"}]}, {"id": "2197117227354022", "text": "Hi. I need help deciding between these hotels in Sorrento. I have reservations for all. We will be there in September. I would love the beautiful views, but am concerned about shuttles to town. We plan on doing day trips to Capri, Almafi coat, Pompei. Thank you so much for your help!\nHotel Continental\nGrand Hotel President\nGrand Hotel La Favorita (I know this one is right in town without views)\nAnna Belle Elegant Agri Resort I have not seen anybody mention this place, but it has good reviews.\n📷\n11All reactions:", "link": "facebook.com/groups/1373361046396315/permalink/2197117227354022/", "likes": 4, "comments": [{"username": "Giuseppe Placi", "comment_text": "I will choose the one without the shuttle to be indipendent"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.dpbolvw.net/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187782-d2325\n08-Reviews-Gran\nd_Hotel_Preside\nnt-Sorrento_Pro\nvince_of_Naples\n_Campania.html"}, {"username": "Marianne Kathleen McCrary", "comment_text": "Hotel Continental"}, {"username": "Tara Roed", "comment_text": "We stayed at la favorita. It was beautiful, comfortable and a nice central location"}, {"username": "Sandy Radican Shikaly", "comment_text": "La Favorita has a rooftop pool/ bar with a view... stayed there twice and ready to go back"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Stay home! Just imagine, reservations at three hotels! Shameful you have taken so many spots from people who are desperate for reservations! Good grief!"}, {"username": "Alex McDougall", "comment_text": "La Favorita has a great roof top swimming pool and bar also lunchtime restaurant and has great views over the bay of Naples\nTwo minutes to the shops and surprisingly very quite considering it’s great location\nNo shuttles required come and go as you like and you are not restricted to a shuttle drop off and pick up timetable\nWherever you choose Sorrento is a lovely place so enjoy😎"}]}, {"id": "2197118134020598", "text": "Hi , I will be travelling from the UK to Italy and want to book the fast train Florence to naples has anyone use trainline and is this accepted or should I be booking through trentila or similar. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2197118134020598/", "likes": 8, "comments": [{"username": "Bev Madill", "comment_text": "I just use Italo or Trenitalia. Easy to use."}, {"username": "Jojo Hanna", "comment_text": "Download the Italo Treno app."}, {"username": "Victoria Laverty", "comment_text": "Book direct through company"}, {"username": "Joseph Ceci", "comment_text": "Trenitalia"}, {"username": "Iris Joan Price", "comment_text": "Trenitalia online booking is easy, and you can open the website in English."}, {"username": "Anne Brawley", "comment_text": "I use Trenitalia."}, {"username": "Colleen Jennings", "comment_text": "Trentitalia. You can select English for info."}, {"username": "Jude Allen", "comment_text": "Trainline works fine. I used a combination of train apps including Trainline multiple times"}, {"username": "Andrea Bainbridge", "comment_text": "Trenitalia app was great! We spent 4 weeks only using trains. The high speed from Naples Florence was so easy and enjoyable"}, {"username": "Edel Robbins", "comment_text": "We’ve just come back from Italy and Trainline worked perfectly for us 😃"}, {"username": "Jenny Payne", "comment_text": "I use Italo train company all the time"}, {"username": "Sheila Gale", "comment_text": "We have downloaded the Trainline app and booked seats from Naples to Florence for Sept. Booked business class and also pre booked seats. Let's hope there are no strikes on the day we have booked for"}, {"username": "Frank Hunt", "comment_text": "Trainline is great!"}, {"username": "Paige Montecalvo", "comment_text": "We used Rail Ninja!"}, {"username": "Trish Dooley Thorp", "comment_text": "Trainline is a great app."}, {"username": "Claire Dowson", "comment_text": "I used Trainline for Italy. Was great!"}, {"username": "Annie Nelhams", "comment_text": "If you use Trainline take a screenshot of your ticket QRS that way if you can’t get a signal you can still show the inspector"}, {"username": "Maria O'Callaghan", "comment_text": "I’ve just booked our trains on Trainline, have used them for all our train travels for years."}]}, {"id": "2197118900687188", "text": "Heading to Rome and we have 3 nights there before boarding our ship. Would love recommendations for a hotel close to the main attractions. Also, any suggestions for restaurants? Many years ago we stayed at the Parco De Principi. We loved the hotel but it was a little far from the things we wanted to see and do. Traveling with friends who have never been to Rome so trying to find a nice convenient hotel. Thank you!!", "link": "facebook.com/groups/1373361046396315/permalink/2197118900687188/", "likes": 2, "comments": [{"username": "Charleen Siegler Schuss", "comment_text": "Hotel Demaso. It's near Campo D Fiori and Piazza Navona"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.dpbolvw.net/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187791-d3964\n772-Reviews-Rom\ne_Times_Hotel-R\nome_Lazio.html"}, {"username": "Melissa Castro Killen", "comment_text": "Hotel Albergo Abruzzi. It's right across from the Pantheon, fountain, and obelisk de Minerva. About 2 blocks from Trevi fountain, and about 2 blocks from Piazza Navona. Highly recommend."}]}, {"id": "2197122090686869", "text": "Traveling to Tropea in mid September for a wedding. Any recommendations of sites to see nearby?", "link": "facebook.com/groups/1373361046396315/permalink/2197122090686869/", "likes": 0, "comments": []}, {"id": "2197123307353414", "text": "Hi!\nMy Fiance and I will be travelling to Europe next year and will be in Italy, specifically Venice, Florence, Polignano a mare, Amalfi coast and Rome from the 15th of June - 6th of July. Just wondering what type of weather to expect as where we live it will be winter at that time and we are planning on hopefully getting some sun!\n\nThanks!!!!", "link": "facebook.com/groups/1373361046396315/permalink/2197123307353414/", "likes": 1, "comments": [{"username": "Ellen Edmonds-Wilson", "comment_text": "Could be hot based on the last two years. If it’s wet it will be short lived. As an Aussie we found the it a hot contrast to the three degrees in the morning before we left and when we arrived home. Definitely choose accommodation with aircon"}, {"username": "Jerry Kiger", "comment_text": "Current post say it hot 90’s + to visit early rest mid day. Curious are you planning trip on own (piece meal hotel, travel) or travel agent? Wondering which I should do"}, {"username": "Glenn Todd Webb", "comment_text": "Summer. Warm to hot"}, {"username": "Romina Lauretig Toscano", "comment_text": "Hot"}]}, {"id": "2197124444019967", "text": "Any hotel you can recommend in Milan closer to the city", "link": "facebook.com/groups/1373361046396315/permalink/2197124444019967/", "likes": 0, "comments": [{"username": "Virgz Van Møøre", "comment_text": "Gran Duca di York"}, {"username": "Maria Y Alexieva", "comment_text": "The Street Milano Duomo | a Design Boutique Hotel\n+39 02 3676 5691\nhttps://g.co/\nkgs/t6b2qR\nYou won't regret !"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187849-d2361\n8612-Reviews-NH\n_Collection_Mil\nano_City_Life-M\nilan_Lombardy.h\ntml"}, {"username": "Debbie DiOssi", "comment_text": "Hotel Spadari. It’s wonderful and includes breakfast. Close to Duomo."}, {"username": "Diana Ferro-Rodrigues", "comment_text": "Hotel Manin"}, {"username": "Lisa Martinson", "comment_text": "Yes roommate hotel julia is the best!"}, {"username": "Mat PO", "comment_text": "Portrait Milano."}, {"username": "Josette Bartolo", "comment_text": "Hotel Teco"}]}, {"id": "2197073534025058", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2197073534025058/", "likes": 4, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2196930007372744", "text": "Dear All\nI really love Italy and have taken so many photos, I will post the last ones here now\nand wish all of you who are leaving this year to Italy 🇮🇹☀️🍊🍋\nHappy holidays from me to you❤️", "link": "facebook.com/groups/1373361046396315/permalink/2196930007372744/", "likes": 118, "comments": [{"username": "Diana Besonova", "comment_text": "A place of infinite beauty"}, {"username": "Ana Ferreira Ruffel", "comment_text": "Thank you for sharing… just looked back at all your photos.. beautiful!!"}, {"username": "Simone Pfenninger", "comment_text": "Santa Margherita Ligure 🙂"}, {"username": "Cindy Medina", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Varsha Khollee", "comment_text": "Thanks for sharing"}, {"username": "Kyunghoo Kim", "comment_text": "Love this picture ❤️"}]}, {"id": "2196996077366137", "text": "Just returned from cruise that took in Montenegro and Croatian ports as well as Trieste and Ancona in Italy - two places I’d not been to. Both worth a visit.", "link": "facebook.com/groups/1373361046396315/permalink/2196996077366137/", "likes": 20, "comments": [{"username": "Denise Edgar", "comment_text": "Thanks we’re going to Ancona and Montenegro - did you do tours or just wander around , are the towns near the ports or do you need taxis /tour guides. I was interested in golf cart tour Montenegro"}, {"username": "Angela Forshaw", "comment_text": "We wandered around Ancona - not a huge place - beautiful basilica up on the hill with lovely views of the bay. Lots of beautiful churches some with interesting foundations / crypts. Roman ruins etc.\nin Montenegro we visited Kotor which is stunningly pretty. Again just wandered around - plenty to see - walled old town is amazing. Lovely pavement cafes in the small squares."}]}, {"id": "2197001567365588", "text": "This is a great app to download has so much on it very helpful", "link": "facebook.com/groups/1373361046396315/permalink/2197001567365588/", "likes": 4, "comments": []}, {"id": "2197003364032075", "text": "Hello! We are headed to Milan tomorrow! Where is the best place to eat (get take away)/ buy some goods (wine, leather, glass, etc) I have a 10 month old and 2.5 year old who don’t like to sit still so family friendly places! I have noticed in France some places are just not family friendly so we have been trying to avoid those places.", "link": "facebook.com/groups/1373361046396315/permalink/2197003364032075/", "likes": 2, "comments": []}, {"id": "2197000420699036", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2197000420699036/", "likes": 5, "comments": [{"username": "Danute Kalinskiene", "comment_text": "Danute Kalinskiene"}]}, {"id": "2197000237365721", "text": "Are you ready to discover one of the most fascinating hamlets of Umbria? Our local guide Patrizia will show you the highlights of this ancient city: you will virtually stroll through the picturesque alleywaysआणखी and you will explore a town rich in history and art with its noble Renaissance palazzi, 15th-century houses and medieval workshops.\nJoin us: https://nextstop-italy.com/virtual-tours/trevi-capital-oil/\n\n#virtualworld #italygram #ravelloitaly #umbria #renaissanceart #hilltown #umbriagram #assisi #virtualtour #medievalart #umbriatourism #Spello #hiddenparadise #vacationmood #italytravel #italyiloveyou #hilltopviews", "link": "facebook.com/groups/1373361046396315/permalink/2197000237365721/", "likes": 7, "comments": []}, {"id": "2196843304048081", "text": "When we booked our trip to Italy, the bus and train schedules showed a limited time. Now that we are at booking time for travel from Rome to Lanciano, the busses don't run there and trains are limited to one late night train. Unfortunately, we will just miss it as we arrive at 11 pm and the train leaves just before midnight. As we have to goआणखी through customs and get luggage, unlikely we would make this train. I am only in Lanciano for a couple days (one for church visits and the other to spend time with family I've never met. This group is AWESOME with your advice, so if anyone has ideas how to get there (short of renting a car ourselves or a private taxi) I would greatly appreciate the information! Thank you in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2196843304048081/", "likes": 4, "comments": [{"username": "Dianne West", "comment_text": "Download the app called Trenit Its an awesome app for trains in italy. If this is the correct destination looks like there is heaps of trains"}, {"username": "Cecilia Christine Costantini", "comment_text": "I think there is a bus with Flixbus, but you would have to sleep in Rome and take it the next day. It runs from Tiburtina Station, so your best bet is to sleep somewhere close to a Metro B line stop and then go to Tiburtina the next morning."}, {"username": "Rhona OConnor", "comment_text": "Stay the night and then travel early the next morning."}, {"username": "David Fidgeon", "comment_text": "Obviously overnight stop on arrival in Rome next day evaluate travel options, depending on size of your group, luggage, and travel plans rent a car might be best solution."}, {"username": "Celia Minnucci", "comment_text": "Can you use Rome to Rio? We had to get to Villa Santa Maria which is in the same area and there were limited buses. We ended up having to get someone to drive us. You may have to check the Clikbus timetable online. There are so many more transport options from Pescara and it's very easy to get there by train from Rome. You may be able to get a train to Pescara and a bus to Lanciano."}, {"username": "Jenny Larsen", "comment_text": "We found that not all bus services showed up on time to rio . Is there a local Italian tourist information that you can call we found them the best. See were looking at an 8 hour train trip with three changes and ended up on one bus 5 hours no changes"}]}, {"id": "2196835260715552", "text": "We are looking for a cool town or place to stay within one hour of FCO. We do not want to go to Rome.", "link": "facebook.com/groups/1373361046396315/permalink/2196835260715552/", "likes": 2, "comments": [{"username": "Maree Peel", "comment_text": "Orvietto for sure."}, {"username": "Annette Mayer", "comment_text": "Please look into Casa dePace in Ghivizzano which is a beautiful medical town on the train route about 1 hr from FCO. Also close to Lucca.\nhttps://\nwww.tripadvisor.\ncom/\nHotel_Review-g20\n80067-d1940089-\nReviews-Casa_La\n_Pace_Bed_and_B\nreakfast-Ghiviz\nzano_Province_o\nf_Lucca_Tuscany\n.html#/media/\n1940089/\n138618622:p/\n?albumid=101&typ\ne=0&category=10\n1"}, {"username": "Rebecca Knox Housley", "comment_text": "Tivoli Lazio, would be my choice."}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g776107-d1192\n930-Reviews-L_I\nsola_di_Rosa-Ce\nrveteri_Provinc\ne_of_Rome_Lazio\n.html"}, {"username": "Gina Romano Peralta", "comment_text": "Following"}]}, {"id": "2196670200732058", "text": "Hi all, want to go to Italy for a few days in October, I’ve only been to Milan and Amalfi Coast before, where do you recommend? I like history and busy cities but I also love the countryside 😊 Thankyou 😊", "link": "facebook.com/groups/1373361046396315/permalink/2196670200732058/", "likes": 4, "comments": [{"username": "Honour Coote", "comment_text": "Hi I would recommend Sicily I went there in may wasn’t too hot too cold, I stayed in Aci castello which is near Catania, I done a excursion to the valley of the temples and also got a bus into Catania a few times which is rich in history and culture. Sicily has lots of Roman amphitheaters if your interested in history, I went to see the huge one in Taormina overlooking the sea. On a excursion I went to the valley of the temples where you can see many Greek monuments and temples"}, {"username": "Dianne West", "comment_text": "Been to Italy 4 times but this time went to Florence loved it!"}, {"username": "Honour Coote", "comment_text": "Honour Coote"}, {"username": "Angela Gilmore", "comment_text": "Well if you love big cities and history Rome seems to be the right choice."}, {"username": "Alice Francesca", "comment_text": "Try Tuscany then, if you have more time Umbria is lovely too.Start from Siena/Lucca and drive to the Val d'Orcia Valley ,where it s the real Tuscan countryside from postcards all over the world.Pienza, Bagno Vignoni, Montalcino, San Quirico d'Orcia.In Bagno Vignoni there are wonderful naturale spas , try and spend a day at the Posta Marcucci hotel (you can buy the one day spa access too) and in Pienza stay at Relais Chiostro di Pienza, breathtaking views of the valley and you get to sleep in a former convent from the 1500's."}, {"username": "Luigia Gray", "comment_text": "Go to Tuscany. My Dad is from there and there are many beautiful places to see. Florence, Pisa, Porto\nVenere, La Spezia, Viareggio, Lerici, Lido di Camaiore and Collodi.These are all beautiful especially in the Summer. Florence can get hot though! I pray you\nHave a wonderful time."}, {"username": "Ken Lerch", "comment_text": "Tuscany"}, {"username": "Laura Latrenta", "comment_text": "If you go to Perusia you can stay at Domus Volumia and then you can go to different cities all around that area like Assisi, Florence, Gubbio"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g1194710-d321\n260-Reviews-Rel\nais_San_Clement\ne-Bosco_Perugia\n_Province_of_Pe\nrugia_Umbria.ht\nml"}, {"username": "Nancy Koehler Barboni", "comment_text": "Rome and Orvieto (one hour by train). And Lucca!"}, {"username": "Phyllis Snyder", "comment_text": "A few days? Where you are you traveling from?"}, {"username": "Gillian O'Callaghan", "comment_text": "Florence and the Tuscan countryside."}, {"username": "Johnny J. Turpin", "comment_text": "Herculaneum"}, {"username": "Ilaria Verda", "comment_text": "Venice + Padova, Vicenza \"ville palladiane\""}]}, {"id": "2196824990716579", "text": "Best restaurants and things to explore in Rome? I’m anxious thinking about crowds and lines and would like to figure out a way to avoid if possible 🤷🏼‍♀️🥴", "link": "facebook.com/groups/1373361046396315/permalink/2196824990716579/", "likes": 6, "comments": [{"username": "Dianne West", "comment_text": "Not possible to avoid crowds and lines in Rome."}, {"username": "Lisa Kelly", "comment_text": "Don’t worry. We just left and only waited one time, 10 minutes, for a table. No reservations anywhere."}, {"username": "John Green", "comment_text": "We’re here now. It’s hot and crowded but not crowded everywhere all the time. Every other storefront is a restaurant or pizzeria. It’s really easy to find a place to eat. The longest line we had for food was 20 minutes and people are super friendly so the time passed quickly. If you’re coming now bring lots of cool clothes."}, {"username": "Tari Lawson", "comment_text": "We just returned. There are several places I would recommend if you want something different yet amazing. Book a Scavi tour at the Vatican. Go through the official website. The tour to the tomb of St. Peter's tomb amazing. When you are done, climb the Dome in St. Peter's Basilica. Go to the Capitoline Museum and take the elevator to the roof. The views are amazing. Consider a bike tour of the Appian Way; we really enjoyed this break from the city center. If you can. Visit the Domus Aurea. This takes a bit of planning and some luck. But is amazing."}, {"username": "Luigia Gray", "comment_text": "If you want to avoid the crowds, don't go in the height of summer!"}, {"username": "Phyllis Snyder", "comment_text": "Please purchase Rick Steves Italy guide! Really informative in answering your questions."}, {"username": "Lisa Valdovinos", "comment_text": "Get tickets in advance."}, {"username": "Rachael Richardson", "comment_text": "We are here now , not sure why people come to a touristy area and not expect other people to go there ! We just go with the flow\nCome out of season it is much quieter back end of September or October or April may\nWe went to the Vatican today yes it was crowded but so is everywhere at this time of year , we still enjoyed it .\nThere is too much scaremongering on this site , if you prebook and be organised there is no problem ! Enjoy"}]}, {"id": "2196054724126939", "text": "TRAINS IN ITALY...\nHope this post helps many to take the trains in Italy as see a lot of people feel unsure etc about them. Here is a picture I took of the departure board at Roma Termini.\n\nYou will see a lot ofआणखी info, the most important:\nSecond column = Train number (Very important!)\nFourth column = Departure time from the station\nLast column = Platform number\n\nSimple as that. When you book a train it will have a number. Use that to find your train on the board. 10-15 min ahead of arrival at your station it will tell you what platform to be on.\n\nHOW TO BUY...\nAt station in person\n\nVia apps (Trenitalia and italo are the main operators and have own apps, personally used trainline to buy as charged me in £ so no foreign fees etc - i'm from UK)\n\nREMEMBER...\nIf you buy ticket in person, validate it before getting on train. Machines are in ticket halls. Cannot miss them.\n\nIf you buy online no need to validate.\n\nTrains have ample space for bags.\n\nPersonally avoided metros/underground as seemed the theme of pickpocketing happened/happens most there", "link": "facebook.com/groups/1373361046396315/permalink/2196054724126939/", "likes": 2045, "comments": [{"username": "Pamela Neuner", "comment_text": "Easypeasy"}, {"username": "Bobbie Whitescarver", "comment_text": "Thank you! (y)"}, {"username": "Martina Dal Bello", "comment_text": "Who writes that the system is great and that trains are fabulous certainly have traveled with freccia rossa and not tried the so called Regionale, the commuters train... Nightmare! And also at the station... During rush hour they can change platform 3/4 times... Imagine to have luggages and you have to change platform multiple times..."}, {"username": "Joanne Terry-Southam", "comment_text": "Trains in Italy are Fatastic. Puts the UK to Shame!"}, {"username": "Becky Reckner Blackwell", "comment_text": "Jennie Chota Renee Broach"}, {"username": "Karen Stewart", "comment_text": "Amanda Stewart something for us to be aware of for when we are in Italy tho for 6 of our 7 days we're with the tour group so aside from our limited free time we may only need to worry about this on our first day in Rome before we meet up with our tour group."}, {"username": "Lisa Conte", "comment_text": "Olivia Conte"}, {"username": "Adele Jarrett", "comment_text": "Will Jarrett"}, {"username": "Jayne Hill", "comment_text": "Took train from Verona to Desanzano in Lake Garda last week. 1st time using trains and was so easy. Used RometoRio website as they give you options of how to get there and links to buy tickets. Only €9 for 2, spotlessly clean and plenty of info and help if needed at train station in Verona. Definitely will do again. Much much better than in UK."}, {"username": "Donna Zarra-Bleich", "comment_text": "This is very helpful! Thank you!"}, {"username": "Phil Leq", "comment_text": "We took the Frecciarossa for a roundtrip between Rome and Naples in May and we loved it. Cheap, comfy, clean, safe, on-time and super fast. A+++++"}, {"username": "Jan Bates", "comment_text": "Donna Kate - you may already know this/find this info useful?"}, {"username": "Whitney Covey", "comment_text": "Meaghan French lol we needed this"}, {"username": "Jennie Frances", "comment_text": "Very helpful thanks. Especially about getting ticket stamped before getting on train."}, {"username": "Alice Adams Avina", "comment_text": "We’ve done a lot of running when they change tracks. In Italian. Yikes!"}, {"username": "Julia Rowan", "comment_text": "I love a European train. Did Pisa to Florence. Florence to Rome. Then Rome to Naples in Jan/Feb this year. Went well"}, {"username": "Bastian Vidal", "comment_text": "Kennie N. Yance"}, {"username": "Megan Corless", "comment_text": "Tom Corless"}, {"username": "Anette Lilja", "comment_text": "Thank you for sharing!"}, {"username": "Carolyn Kehlbeck-Pignataro", "comment_text": "I loved taking the high speed trains. Efficient way to travel. Go first class not much difference in price!"}, {"username": "Federico Permutti", "comment_text": "With regard to platforms, it is true that nowadays they are only announced a few minutes before departure. However, if you are travelling on Trenitalia (or one of its regional subsidiaries/\ncontractors), I would recommend installing the Trenitalia app and checking out the “Train status” section, where you can search for a specific train or look up the departure board of any station - and it will typically show the expected platform well in advance.\n\nIt could still change at short notice, so it’s best to keep an eye on the board at the station, but more often than not the app has helped me avoid a last-minute sprint to the platform."}, {"username": "Renato Ferraro", "comment_text": "Excellent service and experience"}, {"username": "Victoria M. Ohanian-Forte", "comment_text": "First time we are using the Trenitalia app…thanks for the info! I’m glad we don’t have to validate even though we are using the app."}, {"username": "Danielle Rowzee Caruso", "comment_text": "Wendy Ayers the last two lines 🤣"}, {"username": "Maria Navaretta-Maguire", "comment_text": "I am traveling to Italy for the fist time later this year and have heard the trains can be a bit confusing. Thank you for sharing the picture along with the information. Very helpful"}, {"username": "Pamela Pennypacker", "comment_text": "Libby Murray"}, {"username": "Erin Magee", "comment_text": "Thank you for sharing!"}, {"username": "Janine Clarke", "comment_text": "You have to put your bags above your seat so we had x 4 people = x 4 20kg bags = Poor husband as we are all short females 😅"}, {"username": "Kimberly Jo", "comment_text": "Is it necessary to pre purchase train tickets in advance?\nWe're planning a trip from Rome to Florence to Venice and wondering if I should purchase tickets now? Or wait to buy them once in Italy at the train station or via am app."}, {"username": "Janine Cook", "comment_text": "They were amazing!!!! Was super impressed. Switzerland too!!"}, {"username": "Mackenzie Dickow", "comment_text": "Andrew Reichenbach well this would’ve been helpful 😅😅"}, {"username": "Tamara Lewis", "comment_text": "James Lewis"}, {"username": "Leah Hammond", "comment_text": "Jenny Hammond"}, {"username": "Carol Richards Morris", "comment_text": "We spent nearly 3 weeks travelling by train in Italy in May this year. No problems."}, {"username": "Madeleine Mattera", "comment_text": "How can you tell from the Partenze board if a train is a Frecciarossa?"}, {"username": "Eleanor Smythe", "comment_text": "Dallas Smythe"}, {"username": "Lorraine Bowers", "comment_text": "Nigel Bowers Barbara Kors"}, {"username": "Doug Van Pelt", "comment_text": "Italian trains are sooooo good"}, {"username": "Lindy Loo", "comment_text": "Rach Brooke"}, {"username": "Dakota Duffina", "comment_text": "In Italy right now. Super easy process & I paid for first class. It was an extra $20 and the seats were padded and hardly anyone in that car. 10/10"}, {"username": "Diana Schmitt Stansell", "comment_text": "Great post! Thanks for all the information."}, {"username": "Silvia Ditrani", "comment_text": "Sono italiana. Aggiungo un'informazione\n: la seconda colonna indica la tipologia di treno.\n\nIn ordine di velocità:\n\n(R) = regionale [ il più lento e solitamente usato dai pendolari].\n\n(RV)= regionale veloce [come il regionale, ma non fa tutte le fermate]\n\n(AV) = alta velocità [si sposta da una regione all'altra e fa solo le fermate principali. È il più veloce]"}, {"username": "Luciana Guenzani Spinosa", "comment_text": "Don't be afraid of pickpoketers. They aren't so many, anyway. Just keep your values in your handbag and keep a hand on It."}, {"username": "Shauna Elliott", "comment_text": "Italian trains are good, at least in off and shoulder seasons. But personally I would now buy at the station. Last time I booked a ticket at 11pm the night before and paid for it. On the way to the station at 8am the next morning the taxi driver informed me the trains were on strike. They do that with no notice. I tried to get my money back at the station - no go. I was informed rudely that they only sell, not give refunds. I was told to go online only to find pages of “legalese” in Italian. I gave up trying to understand it and got help when I returned home. About 4 months after that I got a letter to say sorry but all refunds have to be done within 3 days. What a rip off of 60 euros."}, {"username": "Grisalda Ingham", "comment_text": "I just dont agree with not taking the Metro or underground I took both on my excursion from Parma to Milanand Rome to Pisa / Florencia Super easy"}, {"username": "Christine Goodrum", "comment_text": "We travelled for the first time on trains in Italy. Much better than ours. No problems at all. We travelled business class and each time got a lovely little snack box. Would certainly use again."}, {"username": "Janet Holm", "comment_text": "We had a really pleasant train journey from Pisa to Florence, then Florence to Lucca, and then back to Pisa, i was a bit nervous as never done this before, but it was so easy, the boards are easy to read and the trains are so comfortable"}, {"username": "Elaina Byron", "comment_text": "Thank you\n\nAbout to book trains in Sicily"}, {"username": "Yvonne Armstrong", "comment_text": "Gillian Jukes Gary Armstrong Neil Morriss Kim Morriss"}, {"username": "Denise Jarvis", "comment_text": "Louise Whittering"}, {"username": "Amity MacGregor", "comment_text": "Shanae Donaghey there are some good tips in these comments 🤓 Exciting!"}, {"username": "Laura Whiting", "comment_text": "Emma Whiting this may be helpful for you xx"}, {"username": "Rebecca Matthews", "comment_text": "Emma Matthews take note"}, {"username": "Lili Lawlor", "comment_text": "Sinéad Ní Leathlobhair"}, {"username": "Donna Maree", "comment_text": "Louise Anne this reminded me of you. 😊"}, {"username": "Sue Stryker", "comment_text": "Yes we did exactly that. It’s a great great train system"}, {"username": "Lauren Overton Call", "comment_text": "Victoria Butler Culbertson"}, {"username": "Morag Allen", "comment_text": "Gail Hickman we will need this ... it's on the list 😊😊"}, {"username": "Peter Holloway", "comment_text": "And trains are so cheap! Certainly compared with the UK. The further south you go the more unreliable the local trains are and so slow! Eg the line Siracusa to Ragusa, Scicli and the Lines from Lecce to Otranto, Gallipoli and Martina Franca."}, {"username": "Срђан Кривошић", "comment_text": "Is it better to buy in person or online?"}, {"username": "Bailey Heidloff", "comment_text": "Be prepared for the board not having a platform number until the last minute. A group of people stood together while we all waited for the same train. It was less than 5 minutes from departure and there was no platform listed. As soon as it showed up (3 minutes before departure) everyone bolted for the platform. While stressful, it was also exciting lol."}, {"username": "Nancy Gamache", "comment_text": "Bon commentaire! En effet, il faut valider votre ticket. Nous ne savions pas et on a dû payer 50 euros chacun."}, {"username": "Marie-Jeanne Paulette Verkruysse", "comment_text": "I usually start by looking up via Trajnline for time table and prices. I decide about the hour and train company and buy directly from them online - often there are special conditions. I do not book via Trainline - they are usually a bit more expensive."}, {"username": "Joe LaLonde", "comment_text": "I’ve used the metro in Rome hundreds of times and have never had any issue with pickpocketing, nor seen anyone else suddenly realize they’ve been hit. Not to say it never happens, but I think the risk is exaggerated and with a little common sense almost completely avoidable.\n\nAnd it’s so easy and convenient too, especially with all stations having “tap-on” turnstiles. Simply tap your phone or CC and go, no ticket needed."}, {"username": "Erica Szenderski", "comment_text": "Thomas Szenderski in case this post is helpful"}, {"username": "Tina Napoli Erdos", "comment_text": "We just returned from our trip to Italy. We chose to travel by trains as I had always heard Italy had a very good train system. I’m so happy we did choose to travel by the trains because the traffic and crazy driving in the Italian cities would have been nerve racking to navigate!!"}, {"username": "Karla Reale", "comment_text": "Ha ha this will be us in September-looki\nng forward to being in Italy in September-love to my Italian family Kx"}, {"username": "Brigitte Greweldinger", "comment_text": "Do keep vigilant and keep true valuables (bank cards, ID) in best secured place, my relative got robbed of handbag in train in north Italy recently. Be especially aware if some turmoil is going on, it may be created on purpose (as can happen in any country)."}, {"username": "Brianna Gayfer", "comment_text": "Sara Rae"}, {"username": "Marcelo Abelenda", "comment_text": "Keep an eye on binario (track/\nplatform) number as for different reasons it can change from original one."}, {"username": "Cherie M VanCleave", "comment_text": "Jennifer O'Chester"}, {"username": "Leah Trimble", "comment_text": "Brian Trimble miss looking at these boards 😢"}, {"username": "Susan Berry", "comment_text": "Max Yates"}, {"username": "Carol Borrelli Von Kaenel", "comment_text": "Helpful information. Thank-you"}, {"username": "Linda Long", "comment_text": "Great info"}, {"username": "Angela Leaver", "comment_text": "I’d like to add, buy the ticket the day before at the station, even cheaper and don’t ever trust the people in red tabards, you think they are staff but they are not. They help you then demand a large reward, out of kindness we offered t￼he man €10 for his help and he was disgusted and wanted more as he did save us €100 by showing us how to buy the ticket. It could of been a scam the price difference etc, we still used the train the following day but horrible experience at the time, we ended up just saying take the €10 and F**k Off or have nothing. Very hostile environment the train department shouldn’t allow it."}, {"username": "Felicia Nierenberg Neubauer", "comment_text": "Kathleen Anderson"}, {"username": "Rhiannon Mae", "comment_text": "Channell Reynolds for when you go xx"}, {"username": "Rosina Thomas", "comment_text": "Millie Graham"}, {"username": "Kate Helliwell", "comment_text": "Deborah Helliwell"}, {"username": "Kirsty Briggs", "comment_text": "Bonnie Houghton remember Venice to Lake Garda 😂"}, {"username": "Laura James", "comment_text": "Robert James Veronica James useful!"}, {"username": "Joyce Maff Val", "comment_text": "Thanks this is very helps. I’ll be traveling from Rome to Bari in October"}, {"username": "Debbie Peth Claus", "comment_text": "I used the Rome2Rio app for trip planning while in Italy and booked via Omio which is linked in the app. Super convenient and worked flawlessly!"}, {"username": "Pat Volza", "comment_text": "Alayne Rudd Pieper Jacqueline Schrader"}, {"username": "Mi MI", "comment_text": "Great info! Thanks, Matthew"}, {"username": "Brooke Farris", "comment_text": "Sam Cupp"}, {"username": "Judy Berlier-Smith", "comment_text": "Very easy and cheap….when there’s no transportation strike lol!!!"}, {"username": "Amy Brauer Torregrossa", "comment_text": "We had difficulty in making sure we were on the correct train. The board only indicated the final destination, and we were not always sure of that, if we were getting g off at an earlier stop. We always had to ask for help. Is there a way to know this information when booking a ticket?"}, {"username": "Mike Vaccaro", "comment_text": "so if you buy via an app (such as you recommended, trainline) is the ticket just on the app and you would show that to any ticket checking person in lui of validating and holding a physical ticket? might be obvious just want to be sure how this works, thanks"}, {"username": "Heather Fisher", "comment_text": "Dean Fisher"}, {"username": "Nicola Louise", "comment_text": "Trish Beattie"}, {"username": "Phil Roe", "comment_text": "Download the Trenitalia app it's easy to use and you don't have to validate when you get on the train.Most people who say italian public transport is bad work for car hire companies."}, {"username": "David Lee", "comment_text": "Jill Rendell"}, {"username": "Kamilė Žiulytė", "comment_text": "Iveta Ma"}, {"username": "Linda Henneker", "comment_text": "Ryan Henneker thought this might be useful for you n Maddie when you get to Italy xx"}, {"username": "Agnes Croft Crane", "comment_text": "Good information to have. Thank you!"}, {"username": "Enza Turner", "comment_text": "Alicia Turner Jack Schroeder if you guys are using the trains in Rome"}, {"username": "Danielle Nattress", "comment_text": "Christopher Stratoudakis"}, {"username": "Monica Alarcon", "comment_text": "Ariel Bly"}, {"username": "Natalie Isabelle-Marie", "comment_text": "Hanna Malik"}, {"username": "KarenKeith Morris", "comment_text": "Lauralizzy Cairns 🇮🇹"}, {"username": "Ian Holmes", "comment_text": "Cheers! Traveling Milan/Bologna/\nFlorence/Pisa in September. Already started booking my trains online. 👍🚅"}, {"username": "Diane Capra Brand", "comment_text": "Olivia Brand"}, {"username": "Kemmy Gooner", "comment_text": "Mia Mäkelä we should of see this posts early"}, {"username": "Michelle Ivkovic", "comment_text": "Anita Rottura Ivankovic"}, {"username": "Christhanta Michael", "comment_text": "Nathan Lok Chris Michael"}, {"username": "Paula Hall", "comment_text": "We bought our train tickets at the station in Rome, scanned it to get through the gate. Later, on the train someone came through and looked at them. We rode from Rome to Florence and back. Lots of open seats and yes room for luggage. It was super easy. There is an announcement in English for the next stop and it is also up on a screen. I never validated it so not sure what people are talking about."}, {"username": "Donna Stevens", "comment_text": "Thank you"}, {"username": "LS Doss", "comment_text": "Eddie Dossey"}, {"username": "Pennie Patane", "comment_text": "Natalie Grubisa"}, {"username": "Yvette Beltran-Southwell", "comment_text": "We take the metro when in Italy. No problems. Just be smart about your stuff."}, {"username": "Peter Richards", "comment_text": "I just want to add that when we have been to Italy and used the train service be it from Milan, Pisa, Florence, Rome etc, compared with the train services here in Scotland, the Italian management could do with coming to Scotland to show them how its done"}, {"username": "Maunette Gildenhuys", "comment_text": "Sarita Weideman"}, {"username": "Martin Cech", "comment_text": "Roma Termini has a big population of thieves inside and outside the station. Do not even show to anyone where you put your wallet. When I went to buy the tickets for public transport they came and took my change which dropped down from the machine and took it. Before that she was pressing the buttons for me prettending that I need her help to buy the ticket. The Police in Italy is smoking cigarettes in their uniforms pretending that this is not their problem 😡"}, {"username": "Frida Lambertini", "comment_text": "Hello! Italian lady here! Just to help all of you, I can suggest to buy the tickets online using Trainline or the apps of the 2 companies here mentioned (Trenitalia, the national company and Italo, a private one). The ticket counter could be crowded and, especially in small stations, you could find employees with a very poor English, so I would go for the app.\n\nTo avoid to rush, please also check the 5th column of this monitor. This is the delay (\"ritardo\", in Italian) expressed in minutes. So, if you can read \"9.30 - 5'\" it means that your train is scheduled at 9.30 but it has a delay of 5 minutes. Unfortunately the punctuality is not a strength of the Italian trains... 😑\n\nPS: if you are in Rome or Milan, don't be afraid by taking the subway! It is very reliable (especially in Milan) and not so dangerous in my opinion, you should find the same situation that you can find in Paris, Berlin, London etc. You just need a good common sense (example: avoid to use a completely open tote-bag; avoid to keep your brand new phone in the back pocket of your jeans), nothing else.\n\nHave a wonderful Italian trip! 😊"}, {"username": "Shelby Susanna Stephens", "comment_text": "Great info! Going next year!"}, {"username": "Kate Grossman", "comment_text": "Many thanks. Thinking travelling from Rome ( poss) to Puglia next year. Will investigate options now !!"}, {"username": "Donna Schroder", "comment_text": "Michael Uhrhane Georgia Bird"}, {"username": "El Yates", "comment_text": "Shannen Watters"}]}, {"id": "2196710730728005", "text": "Headed to Tuscany in October! Any tips are far as traveling? And what to make sure we have when we get there… 17 hour flight one way. I got an outlet converter but just not sure how or what to to pack.", "link": "facebook.com/groups/1373361046396315/permalink/2196710730728005/", "likes": 6, "comments": [{"username": "Lisa Quinn", "comment_text": "How long are you going for?\n￼ Definitely do at least 2 to 3 days in Florence and then a side trip out to Pisa. I literally packed a large duffel bag. No checking luggage. I had four days worth of clothes. I dropped off my laundry in a little local place in Florence that did all of it for €15 and I picked it up the same day. (And pressed, too!) Don’t overpack. You’ll definitely need that plug converter. I also brought my portable charger for my phone, which was great. Let me know if you want my Guide’s information for Pisa and Florence. They were both amazing. ￼"}, {"username": "Steve Savva", "comment_text": "Tuscany is warm then in the 20s for sure. Mosquitoes can still be a problem so be prepared for that."}, {"username": "Allan Olexa", "comment_text": "Phones along with other electronics are designed to charge on both 110 and European 220…just get a cheap plug adapter. Voltage converters for electric equipment like shavers, hair dryers, etc. offer mixed results. We are in Europe several times annually, so have bought inexpensive appliances there…hair dryer, etc."}, {"username": "Phyllis Snyder", "comment_text": "ASP- get Rick Steve’s Italy guide! It can help you so much!"}, {"username": "Jeanine Welch", "comment_text": "Great tips guys! Ty!"}, {"username": "Jim Hash", "comment_text": "A light jacket and an umbrella. You should get and bring an international driver's license even if you currently don't plan on renting a car. Many places in Tuscany are much easier to get to with a car. We use train, uber and taxi but we have more time then most. Even then, there are some hilltop towns where we can't make a call to order an uber or taxi. You don't need to bring very much cash, 200-300 Euros is more than enough, and you can get it when you get there. Bring a VISA or MasterCard, AMEX is very rarely accepted. Other small items, tooth paste, shampoo contact lense solution can be purchased there, so you don't need to try and bring a big container of these, unless you have the extra space. If your airline ticket allows for multiple free bags, we pack our clothes in a small carry on and then put it into a larger suitcase. We need them both when we fly home. Wine, olive oil, balsamic vinegar and cheese. Leather goods and other souvenir items will fill up the extra empty space you bring on your way home."}]}, {"id": "2196771780721900", "text": "Hello, We have just booked our trip to France, Barcelona and Italy !!! Just looking for tips on what is the best phone usage plans for me and my teenager . Thanks in Advance ☀️", "link": "facebook.com/groups/1373361046396315/permalink/2196771780721900/", "likes": 0, "comments": []}, {"id": "2196793864053025", "text": "Looking some help.. we fly into Milan Bergamo Airport and need to get to Limone sul Garda as transfers weren’t included. I’ve looked up many different options but renting a car seems to be the best one I can see. Does anyone have any recommendations at all? Thanks in advance", "link": "facebook.com/groups/1373361046396315/permalink/2196793864053025/", "likes": 0, "comments": [{"username": "Clarissa Rava", "comment_text": "There are private busses that goes from the airport to Milan central station, from there you’d have to take a train. But if you are not comfortable enough to do all those changes you might want to take a car cause it will be easier."}, {"username": "Diana Besonova", "comment_text": "Renting a car allows you to enjoy the sights along the way"}]}, {"id": "2196808214051590", "text": "I’m not leaving until May 2024 but I’m trying to book side trips early. We will be on a cruise which will have a stop in Rome. We want to see the Colosseum but want the full tour (I think) to see the lower level. Can anyone tell me how many levels there are? Or sections? How long this tour is? Did you post from a ship or on your own? I Cannot stand long or walk a long time unless I can sit for several minutes…thank you…", "link": "facebook.com/groups/1373361046396315/permalink/2196808214051590/", "likes": 0, "comments": [{"username": "Miyuki Kanno Paul", "comment_text": "Consider your time in Civitavecchia, the Roma’s port. It takes roughly 1.5 hours to Roma Termini station, so your round trip will already cost you 3 hours alone. About 20 minute walk to Coloseo on foot. How many hours is your ship will be docked at Civitavecchia? Depending on the capacity of your cruise ship, it may take time to disembark and embark. Consider booking an excursion through your cruise line. The ship WILL WAIT FOR YOU if your tour is delayed. If you are on your own, the ship will leave without you"}, {"username": "Alice Francesca", "comment_text": "All info here\nhttps://\ncolosseo.it/en/"}]}, {"id": "2196809370718141", "text": "Hello everyone, can I ask for your thoughts or experiences in staying Amalfi area. We are travelling October/November and want to base in the area but travel by public transport to visit other places. I’m looking at Ravello but have read that it’s difficult to get around from there: time wise. What suggestions do you have? Many thanks", "link": "facebook.com/groups/1373361046396315/permalink/2196809370718141/", "likes": 0, "comments": [{"username": "Kay Rendall", "comment_text": "That area almost closes down mid October onwards. B&bs start to close, restaurants too as very few tourists. Ferries stop running because high seas. Very few buses other than school buses. Can be cold, windy, raining. Hope this helps. The cities r ok, because there r some tourists, but they also look after the locals."}]}, {"id": "2196808220718256", "text": "I’m not leaving until May 2024 but I’m trying to book side trips early. We will be on a cruise which will have a stop in Rome. We want to see the Colosseum but want the full tour (I think) to see the lower level. Can anyone tell me how many levels there are? Or sections? How long this tour is? Did you post from a ship or on your own? I Cannot stand long or walk a long time unless I can sit for several minutes…thank you…", "link": "facebook.com/groups/1373361046396315/permalink/2196808220718256/", "likes": 0, "comments": []}, {"id": "2196817764050635", "text": "Is it true that horse meat is prevalent in Italy?", "link": "facebook.com/groups/1373361046396315/permalink/2196817764050635/", "likes": 25, "comments": [{"username": "Serena Mascheretti", "comment_text": "Not prevalent at all but very common, there are specific butchers and stores that sell it. We also ear rabbit."}, {"username": "Paul Stewart", "comment_text": "I had donkey at a restaurant in Monopoli"}, {"username": "John Rodriguez", "comment_text": "I’ll try it!"}, {"username": "Titti Pagano", "comment_text": "Absolutely not! In Sicily, Puglia, Veneto Is more common."}, {"username": "Ilaria Giorgulli", "comment_text": "NOT PREVALENT AT ALL!! if being a tourist you tasted/found does not mean it is prevalent."}, {"username": "Luciana Filippelli McCartney", "comment_text": "Prevalent no but yes they sell it, I was in Puglia and that is popular meat there."}, {"username": "Rhona OConnor", "comment_text": "Didn't see it anywhere in Italy."}, {"username": "Poulami Saha Roy", "comment_text": "Poulami Saha Roy"}, {"username": "Anna Stuckey Wheeler", "comment_text": "Depends on where you are; if you see cavalli/\ncavalle or carne di cavallo, this is horsemeat."}, {"username": "Lamiaa Bahaa", "comment_text": "Yes true."}, {"username": "Carmen Vizzari", "comment_text": "It is in some Italian regions, like Veneto, Sardinia, Sicilia, and probably Apulia."}, {"username": "Gianna Giovannetti", "comment_text": "No! 😂 I have never eaten it. I live in Tuscany, here we eat beef, pork and chicken"}, {"username": "Patrizia O'Neil", "comment_text": "Yeah"}, {"username": "Steph Craddock", "comment_text": "You will never really find it in restaurants. But you can find it in supermarkets."}, {"username": "Megan Anne", "comment_text": "Does it really matter? Every country has its traditions lots of countries eat horse in the uk we eat pheasant,wood pigeon ,rabbit,venison\netc"}, {"username": "Jan Cooper", "comment_text": "And france"}, {"username": "Ali Everson", "comment_text": "I saw Cavalli pate!"}, {"username": "Rosaria Bishop", "comment_text": "I have spent a lot of time in Italy and have never seen it so I wouldn’t say it’s prevalent but I do know that mortadella is made with horse meat not sure if it still is."}, {"username": "Joe Guzzi", "comment_text": "Yes, it is our preferred red meat. I even have some in the freezer.\n\nWhen my daughter returned to civilization after 4 1/2 years in the US, the first thing that she wanted me to make was horse!"}, {"username": "Steven Gosling", "comment_text": "Ney! You may see it more in some areas than others, hopefully only seen standing on 4 legs in a field."}, {"username": "Rosaria Bishop", "comment_text": "It amuses me how Americans freak out that a country eats horse or kangaroo meat, at least they tell you what you are eating in the US you could be eating God knows what (can’t say it here or I’ll be banned) and you don’t know it 🤷‍♀️"}, {"username": "Dagmar Ross", "comment_text": "Widely not, but it is eaten. Just like in Germany or France also"}, {"username": "Joe Guzzi", "comment_text": "Easy to find, but expensive. Very common in restaurants in the lakes region."}, {"username": "Peter Seller", "comment_text": "sadly yes- our tour guide warned us 😞"}, {"username": "Fernanda Argomedo", "comment_text": "Entraña de caballo es exquisita!"}, {"username": "Joe Guzzi", "comment_text": "Horses are raised specifically for meat, and are normally 1-3 years old (the younger ones cost more)."}, {"username": "Leila Myftija", "comment_text": "It is eaten in most every region, but more so in Puglia, Sicily, Emilia Romagna, Veneto, Lombardia, Basilicata."}, {"username": "Antonis Niolakis", "comment_text": "Yes a lot\nAlways ask.where the meat is from"}, {"username": "Chris Catanese", "comment_text": "Saw it mostly in Sicily. I don’t remember seeing it in Rome. This is a grocery store in Milazzo. ￼"}, {"username": "Yolanda Arena", "comment_text": "Since the question is : is horse meat prevalent in Italy, I would say no! It is widely available ?I would say yes in many regions. I don’t eat it and beef/ pork is available everywhere. A very popular meat is also veal ."}, {"username": "Ann Dunne", "comment_text": "Olive Conroy you're sorted 😂"}, {"username": "Sarah Stiltner", "comment_text": "It was on the menu at a restaurant in Padova"}, {"username": "Chiara Varricchio", "comment_text": "No it's not prevalent. Except maybe in the Veneto region and a couple of others."}, {"username": "Astrid Pugeault", "comment_text": "Pas du tout il y en a dans certaines boucherie comme en France ou ailleurs mais ça n'est pas du tout la nourriture Favorite.en ligure vous trouverez plutôt du poisson et de bons légumes..."}, {"username": "Michelle L Williamson", "comment_text": "Are you looking for a place?"}, {"username": "Hen Garrett", "comment_text": "My husband had a polenta dish with horse meat in Verona last year. He said it was very nice but I stuck to some fish 😉"}, {"username": "Terry Lea", "comment_text": "When in Rome."}, {"username": "Romina Lauretig Toscano", "comment_text": "Haahha NO!"}, {"username": "Giuseppe Placi", "comment_text": "Not true"}, {"username": "Maruschka Tuunainen", "comment_text": "If you don’t want to eat it, check sausage ingredients if you buy at supermarkets. (I was in Genova) They sometimes mix horse meat into them. I was horrified to know I had eaten a sausage that contained horse meat after reading the pack. I’m a horse lover and had horses as pets so for me it was the same as eating dog….. but each to their own…"}, {"username": "Angela Gilmore", "comment_text": "Nope, not true. You can find it in some butchery, in the small and old ones. Not easy to find, actually. At least here in Naples."}, {"username": "Roberta Nanni", "comment_text": "Not prevalent but horse meat in some areas is considered a delicacy, also donkey, see \"somarino con polenta\" (I don't eat it)"}, {"username": "Brooke Barron", "comment_text": "It is in Verona, as well as donkey meat."}, {"username": "Angela Borghetti", "comment_text": "Yes!"}, {"username": "Daniele Morani", "comment_text": "Yep, had horse meat two days ago. Delicious."}, {"username": "Peter Tsouroulla", "comment_text": "Neigh"}, {"username": "David Baillie", "comment_text": "I thoroughly recommend the Mr Ed Burger!"}, {"username": "Giada Todaro", "comment_text": "Not prevalent/\ncommon. But in some region you can find it"}, {"username": "Em Vaws", "comment_text": "One of The most wonderful things about travelling is the food variety’s and exploring them 🤍🤍"}, {"username": "Maria LoSurdo", "comment_text": "No! I lived in Rome for 2.5 years 20 years ago and never came across it once. Think it depends on which region. I wouldn’t touch it!!"}, {"username": "Rupert Thompson", "comment_text": "It’s certainly available (but sold as such). More so in France. Not like in the UK where you think you’re getting Beef & instead it’s sometimes “Chevaline”"}, {"username": "Alicia Fancher", "comment_text": "I’ve seen it served in many places. I never ate it!!!"}, {"username": "Dorothy Hudson", "comment_text": "A few years back we stayed in Zagarolo and they had a butcher there that had it we were terrified we would buy it by mistake"}, {"username": "Tina Tina", "comment_text": "No"}, {"username": "Charlie Louise Moore", "comment_text": "Cavalli means horse in Italian, if you’re worried look out for this word in menus etc."}, {"username": "Janice Styler", "comment_text": "Yes it's available ...along with lots of veal . I don't eat either"}, {"username": "Melissa's Page", "comment_text": "I lived in Italy for 5 years. If you want it you can find it but it's not prevalent."}, {"username": "Giuseppe Placi", "comment_text": "It is on sale but not prevalent.\nI am italian, I never ate it"}, {"username": "Marco Brambilla", "comment_text": "Omg can’t wait to go back and have some! Miss rabbit too!"}, {"username": "Claudia Baracco", "comment_text": "Here in Veneto it is really common to find in supermarket and restaurant the \"sfilacci di cavallo\" (shredded horse meat). I love it, especially combined with rucola and parmesan 😍"}, {"username": "Suzana Ferreira", "comment_text": "Really?never heard that!"}, {"username": "Stef Poloni", "comment_text": "Sure is! That photo is from the market in catania sicily"}, {"username": "Jayne Dawson Meyer", "comment_text": "NO"}, {"username": "Carol Fisher Castagna", "comment_text": "Yep."}, {"username": "Karmen Racquel", "comment_text": "It was for sale in the Venice market!"}, {"username": "Kiki Wayne", "comment_text": "In Sicily ,not in all the country. Especially Catania love horse meat,they make great dishes."}, {"username": "Tania Spagnolo", "comment_text": "Look for cavallo."}, {"username": "Rogue Veggie", "comment_text": "Donkey meat too."}, {"username": "Claudia Codega", "comment_text": "Not prevalent"}, {"username": "Aurora Busato", "comment_text": "There is, but I wouldn't say it's prevalent! I'm Italian, from the north near Venezia"}, {"username": "Clarissa Rava", "comment_text": "Mainly in south italy but we do eat it in north italy as well. Its not that common tho. We prevalently eat beef and chicken meat."}, {"username": "Jolie Carbone", "comment_text": "Yeah it’s common but not so prevalent . Common enough to be in supermarkets, have specialized butchers and be in some restaurants."}, {"username": "Ingrid Zancoli", "comment_text": "Not prevalent, but surely you can purchase it easily, both in supermarkets and specialized shops. Same for rabbit."}, {"username": "Berndt Weihs", "comment_text": "Only in some regions e.g.Brescia!"}, {"username": "Angela Cagna Gaberel", "comment_text": "Yes"}, {"username": "Alessandro Iannelli", "comment_text": "Certainly not \"prevalent\"."}, {"username": "Whitney Meyers", "comment_text": "Yes"}, {"username": "Whitney Meyers", "comment_text": "It’s even in kids baby food like in the grocery they have horse meat baby food"}, {"username": "Luca Lookone Ferrentino", "comment_text": "You can find it in any region, but is more common in Sicily, Puglia, Veneto."}, {"username": "Craig Skinner", "comment_text": "That's why the lasagne is so good!"}, {"username": "Kelly Benson", "comment_text": "Yes was In lake como"}, {"username": "La Cinzia", "comment_text": "It's not absolutely true! It exists but it is not prevalent"}, {"username": "Whitney Meyers", "comment_text": "Whitney Meyers"}]}, {"id": "2196822460716832", "text": "Do you think it’s ok to go at the end of November to the Amalfi coast, or I should do Napoli instead? Thanks for the tips.", "link": "facebook.com/groups/1373361046396315/permalink/2196822460716832/", "likes": 3, "comments": [{"username": "Kay Rendall", "comment_text": "Amalfi Coast will be closed down. B&b, restaurants get quiet, start to close mid, late October. Ferries stop running because rough seas. Can be lot rain, getting cold. Have been told very few buses run, except school buses.\nTourist season is Maybe March/April to October. Most then work 7am or earlier to 12.00/1.00 am or later plus travelling time, 7 days a week for 6 plus months.\nAfter they rest, hibernate. Maybe go to family someone for Xmas. Start to get ready for season about March. Not sure about Naples Hope this helps"}, {"username": "Dayna Ferdinandi", "comment_text": "Sorrento will still be open, it runs straight through, it will be much quieter and some places may be closed but you would still have a lovely time."}, {"username": "Dayna Ferdinandi", "comment_text": "Also the Xmas decorations will all be up and it will be quite festive."}, {"username": "Andrea Yondola French", "comment_text": "Our tour guy did not recommend Oct/Nov. we were there last week. Said It was the rainy season and many things closed, services stop running"}, {"username": "Jenny Payne", "comment_text": "I go every February to Italy , stay in Sorrento and the buses are running to Positano and the restaurant that is open is the one on the beach & a few of the shops 🌻"}]}, {"id": "2196830170716061", "text": "Trying to buy tickets for San Siri stadium in Milan. I think I have the official site that directs me viva ticket. The date selection works but the ticket time shows as 9:30am. Does anyone know if the ticket is valid anytime that day?\nHas anyone done the tour? I have huge soccer fans wanting to go. Thanks for your help!", "link": "facebook.com/groups/1373361046396315/permalink/2196830170716061/", "likes": 0, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2196835450715533", "text": "Hello. Want to be in Italy for my honeymoon in May 2024. Let’s say around May 22, 2024. Planning to be there for a week before heading to another European destination.\n\nI am really looking forward to spending some moments without the hassle of being in long queues, heat, and avoid the huge crowd. Is it like that in touristy places only, or in general it’s like that?\n\nAll your recommendations and advices would be highly appreciated and could be a decision changer.\n\nThank you 🐠🫧🌊", "link": "facebook.com/groups/1373361046396315/permalink/2196835450715533/", "likes": 4, "comments": [{"username": "Clarissa Rava", "comment_text": "Only touristy places are like that. In general Italians tends to stay at home or in public pool and shopping center during summer ☺️👍🏻"}, {"username": "Jan Soto", "comment_text": "Cinque Terra"}, {"username": "Jan Soto", "comment_text": "Cinque Terre"}, {"username": "Rhona OConnor", "comment_text": "If you read the posts here every one is going to the same 4 or 5 places..... And they are so over crowded. The rest of Italy is fine, no crowds, no queue, so pick other places. I went to Bari and it was lovely, lots of interesting places to explore and visit."}, {"username": "Alice Francesca", "comment_text": "https://\nwww.italia.it/\nen/tuscany/\nthings-to-do/\npienza-the-ideal\n-city"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nnextstop-italy.c\nom/\nvirtual-tours/\npisa-pearl-of-tu\nscany/"}, {"username": "Simone Pfenninger", "comment_text": "Sicily or Puglia"}, {"username": "Annette Fordyce", "comment_text": "Levanto is amazing. It’s a few miles north of the Cinque Terre, but it is less crowded. It’s super easy to hop a train for the 5 Terre. There is also a trek between Levanto and Monterosso that is beautiful (although not easy) and you can ride bikes and ride through the old train tunnel to Framura. Once in Framura, it’s a beautiful hike up to the town of Costa. Levanto has good restaurants and so fun shops, and a very nice beach."}, {"username": "Connie Wilson", "comment_text": "What do you like? Big cities or smaller villages? Seaside, countryside or mountains? Italy has it all, so you should choose where you would be most happy."}]}, {"id": "2196843307381414", "text": "When we booked our trip to Italy, the bus and train schedules showed a limited time. Now that we are at booking time for travel from Rome to Lanciano, the busses don't run there and trains are limited to one late night train. Unfortunately, we will just miss it as we arrive at 11 pm and the train leaves just before midnight. As we have to goआणखी through customs and get luggage, unlikely we would make this train. I am only in Lanciano for a couple days (one for church visits and the other to spend time with family I've never met. This group is AWESOME with your advice, so if anyone has ideas how to get there (short of renting a car ourselves or a private taxi) I would greatly appreciate the information! Our travel date is October 29th of this year, and there are two of us. Thank you in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2196843307381414/", "likes": 2, "comments": [{"username": "Dianne West", "comment_text": "????"}, {"username": "Giorgio Zanichelli", "comment_text": "if you don't wanna drive then you just can't get there at night"}, {"username": "Gigi Alb", "comment_text": "Omio app or Rome2Rio app shows transportation options."}, {"username": "Gigi Alb", "comment_text": "If no options, stay in Rome for one night and go the next day."}]}, {"id": "2196843310714747", "text": "When we booked our trip to Italy, the bus and train schedules showed a limited time. Now that we are at booking time for travel from Rome to Lanciano, the busses don't run there and trains are limited to one late night train. Unfortunately, we will just miss it as we arrive at 11 pm and the train leaves just before midnight. As we have to goआणखी through customs and get luggage, unlikely we would make this train. I am only in Lanciano for a couple days (one for church visits and the other to spend time with family I've never met. This group is AWESOME with your advice, so if anyone has ideas how to get there (short of renting a car ourselves or a private taxi) I would greatly appreciate the information! Our travel date is October 29th of this year, and there are two of us. Thank you in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2196843310714747/", "likes": 0, "comments": [{"username": "Dianne West", "comment_text": "You seemed to have posted this twice!"}]}, {"id": "2196844677381277", "text": "I'm an Aussie planning a first solo trip to Italy from October 9 to 22, 2023.\nThinking of visiting Rome, Sorrento, Florence, Cinque Terre, Milan/Venice by train.\nAny recommendations including do's & dont's welcome 🙏", "link": "facebook.com/groups/1373361046396315/permalink/2196844677381277/", "likes": 11, "comments": [{"username": "Virgz Van Møøre", "comment_text": "Too short, stay either in the North or South"}, {"username": "Jenny Payne", "comment_text": "I’m an Aussie as well and visit Italy every year and I’m going this October. I fly into Rome and stay at a 3 star hotel near termini, I stay 3 nights and show friends around, then train to Florence for 3/4 days and get a feel of the city , then continue onto La Spezia cinque Terre 2 days and then go onto Milan for a few days then Venice. I think you need to look at a map as it’s a long way to go bk to Sorrento. Just remember every day you travel u loose a day. If u want help use messenger jen🌻"}, {"username": "Rhona OConnor", "comment_text": "I think you need one day to travel and 2 days in most places, 3 if you are doing a lot of sightseeing then a day to travel. Take your time and get a feel for the place rather than rush around."}, {"username": "Alice Francesca", "comment_text": "Skip Milan.Start your trip either south or north then work your way up or down.Weather will be lovely.And not overcrowded."}, {"username": "Rosslyn Patience", "comment_text": "Go to Lake Como if you can. There are nice villas to visit like Villa Balbianello and lovely gardens at the towns on the lake. Buy a circular ticket on the boats. Como is only a short train ride from Milan - maybe half an hour away. The Cathedral in Milan is great. You can buy a ticket and go up on the roof."}, {"username": "Rosslyn Patience", "comment_text": "Villa Balbianello is closed a couple of days for weddings, so investigate the days before you go. The"}, {"username": "Ellen Edmonds-Wilson", "comment_text": "Book tickets to anything you absolutely want to see as soon as you can. They sell out or you have to go at a time you’d rather not. We couldn’t get The Last Supper tickets at all. If you do the Vatican museums book the breakfast tour as you’ll have fewer people there. Book directly with sites and hotels. Trains are excellent and the Frecciarossa are excellent. Booking tickets on the trains in advance makes them cheaper and you can choose your seat. Use Apple Pay. Don’t fall for scams: anyone who approaches you on the street is a stranger and thus has no reason to talk to you. Be alert but not alarmed. And the water is drinkable."}, {"username": "Paul Vincent", "comment_text": "Visit fewer, see more !"}, {"username": "Megan Leigh", "comment_text": "Is this including your travel days? You're playing with 14 days (12 if You're flying on the 9th & 22nd. My rec is to spend at least 3 nights (2 full days) in each location. I would narrow down your locations."}, {"username": "Paula Cruz", "comment_text": "You can do Florence + Pisa"}, {"username": "Luigia Gray", "comment_text": "You seem to want to do too much for the time you are there. Don't visit as many places but the ones you do go to stay\nlonger. Italy has so many\ngorgeous villages and towns. My favourites are\nThe Cinque Terre, Florence, Rome, Amalfi coast, Pisa, Porto Venere. I hope you have a wonderful time in Italy."}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nnextstop-italy.c\nom/\nvirtual-tours/\npisa-pearl-of-tu\nscany/"}, {"username": "Karon Patterson", "comment_text": "I loved Milan, it was so beautiful and clean and everyone was friendly. Vernazza in Cinque Terre is the best."}, {"username": "Cinzia Bonciani", "comment_text": "Too ambitious a trip for such a short stay (fellow Aussie here). A Euro train pass might help if your planning to move through all those places in less than 2 weeks. You want to so south, centre and north all in 10 days and the tragedy is that you would barely be skimming the surface. Just my POV."}, {"username": "Joanne Nacson", "comment_text": "YouTube the places you are thinking of to get a feel if you like them"}, {"username": "Marlene Watson", "comment_text": "Train around but make sure they are daylight trains no over nighters. And have fun. It’s a wonderful place."}, {"username": "Brad Nelsen", "comment_text": "Do: pay extra for train eg Business or Executive so you can watch your luggage the whole time."}]}, {"id": "2196845227381222", "text": "Planning a trip to Italy and looking for recommendations for a good travel agent . Please DM me if you do. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2196845227381222/", "likes": 2, "comments": [{"username": "Usha Lalwani", "comment_text": "Highly recommend Nyssa from Click and Trip"}, {"username": "Lara Grom", "comment_text": "Livtours livitaly will arrange tours for you"}, {"username": "Judy Robinson", "comment_text": "@Lisa Salter, booked both my Italy trips with her she's the best!"}, {"username": "Pietro Adami", "comment_text": "Christian Gava (based in Italy)"}]}, {"id": "2196850010714077", "text": "We are planning a trip in April-May of 2024 from the US to Italy. We origially had a transatlantic cruise that was to end in Rome, but had to change to a different cruise that ends in Barcelona. We will have time in Florence and Rome after the cruise, but would like to stop somewhere along the way from Barcelona to Italy. We'd like to stopआणखी somewhere with beautiful scenery, but that is a little more relaxed before we head over to Florence or Rome. We like the idea of a train, but if a flight somewhere is also a possibility. Has anyone stayed somewhere in France, Switzerland, or Italy that was relaxing, but beautiful and memorable?\nP.S. We are hesitating to go to Switzerland because I am afraid of heights, but haven't ruled it out.", "link": "facebook.com/groups/1373361046396315/permalink/2196850010714077/", "likes": 0, "comments": [{"username": "Dianne West", "comment_text": "Try Genoa,"}, {"username": "Rhona OConnor", "comment_text": "Nice in France is lovely and you could do a trip to Monte Carlo (45mins by train)\nWe went to Lake Lucerne 🇨🇭 by train and it's flat so no problem with heights!"}, {"username": "Lisa Kelly", "comment_text": "Lucerne, Switzerland. It’s a large lake and flat."}, {"username": "Maria Brozou", "comment_text": "I really liked Lugano in Switzerland. Ideal for resting and super close to Milano."}, {"username": "Alita Glardon Simpson", "comment_text": "Thanks for all the ideas!"}, {"username": "Lisa Kelly", "comment_text": "The bus system is Lucerne is really good! There are lots of tourists so it’s not quaint and remote."}]}, {"id": "2196847307381014", "text": "Hi all! Please son Recomendation hotels on Venice. Good location please\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2196847307381014/", "likes": 13, "comments": [{"username": "Beth Sullivan", "comment_text": "https://\nwww.bellavenezia\nhotel.it/\n?utm_source=goog\nle&utm_medium=o\nrganic&utm_camp\naign=GoogleMyBu\nsiness"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.kqzyfj.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187870-d1226\n3777-Reviews-Pa\nlazzo_Veneziano\n-Venice_Veneto.\nhtml"}, {"username": "Kasia MacDuda", "comment_text": "We just returned from Italy. We stayed in Murano at Hyatt Centric. It was great. Not too many tourists. Water shuttle which takes you anywhere you want to go right outside of the hotel. Rooms nice and clean. Great vibe in the hotel. A plus is the hotel has a boat and can pick you up at the airport. Savings of around 100 euros. Enjoy!"}, {"username": "Debbie DiOssi", "comment_text": "Ca Segredo."}, {"username": "Lisa Valdovinos", "comment_text": "Hotel L’ Orologio."}, {"username": "Tracy Hall", "comment_text": "Hotel Saturnia. Fabulous Hotel with cute bar where the gondoliers hang out and water taxi can drop off at the back entrance. Near St Marks Sq."}, {"username": "Ellen Edmonds-Wilson", "comment_text": "We loved the Ça Maria Adele hotel right by the Salute vaporetto stop so one stop from St Mark’s square. Fab tiny 12 room adult only hotel."}, {"username": "Virgz Van Møøre", "comment_text": "Duodo palace hotel"}, {"username": "Holly Baldassare", "comment_text": "H10 Palazzo Canova. I did a lot of research and combed through reviews. We are staying here and I can’t wait!\n\nhttps://\nwww.h10hotels.co\nm/en/\nvenice-hotels/\nh10-palazzo-cano\nva"}, {"username": "Joanne Calzaretta", "comment_text": "I was able to get a room at casa Nicola. Someone in this group recommended"}, {"username": "Thomas Harris", "comment_text": "Hotel Flora"}, {"username": "Dave Colleen", "comment_text": "We love Hotel Moresco. Walking distance to train station. Fantastic staff. Nice breakfast, with eggs made to order. Happy hour every day. Plush bathrobes, nice size room and bathroom. Has ac."}, {"username": "Sinead Alexandra", "comment_text": "St Regis on the Grand Canal"}, {"username": "Denise Robinson", "comment_text": "Hotel Paganelli"}, {"username": "Raquel Derasmo Piccirillo", "comment_text": "We stood at Hotel Saturnia twice and loved it"}, {"username": "Deanne Tetrault", "comment_text": "We are staying at hotel Rosa Salva"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "When are you going? My favorite is booked up way in advance."}, {"username": "Melissa Feielin Hawkins", "comment_text": "Radisson Collection Hotel, Palazzo Nani\n\nJust celebrated my birthday here two weeks ago and they where absolutely amazing! We had a canal front suite and They gave us a complimentary upgrade, assisted my husband in setting up flowers, room decorations, privite gondola ride, privite taxi to Doge Palace on the terrace for dinner, just beyond amazing customer service and clean spacious rooms.\n\nI have a room tour POV on tictok mrsfirehawk702"}, {"username": "Caryn Goode", "comment_text": "Hotel Ca D’Oro - easy walk to St. Mark’s Square."}, {"username": "Sharon MacNeil", "comment_text": "Hotel Al codega, Venezia"}, {"username": "Phyllis Snyder", "comment_text": "Price range?"}, {"username": "Letisha Withrow", "comment_text": "Royal San Marco had a complimentary water taxis to Murano for a glassblowing tour and a tasty breakfast!"}, {"username": "Josette Bartolo", "comment_text": "Olympia Hotel Venice"}, {"username": "Maria NoBa", "comment_text": "Centro Culturale Don Orione Artigianelli\nGreat location!"}, {"username": "Adrianna Ross Berk", "comment_text": "Following"}, {"username": "Valerie Collanton", "comment_text": "Rosa Salva. Great location near San Marco but quiet rooms. Fantastic bakery+"}, {"username": "Karrie Doyle", "comment_text": "Amy"}, {"username": "Sandy Fazio", "comment_text": "The Marconi, right by the Rialto Bridge, on the Grand Canal. Your water taxi will bring you right to it."}, {"username": "Yvonne Donnellan", "comment_text": "Booking. Com"}, {"username": "Sheryl Elizabeth", "comment_text": "You walk everywhere so doesn’t matter where you stay imo. Depends on your budget too"}, {"username": "Thuy Tdt", "comment_text": "This one"}, {"username": "Connie Rai", "comment_text": "Fabulous Danieli Hotel right on the Grand Canal."}, {"username": "Connie Rai", "comment_text": "Connie Rai"}, {"username": "Frances Scannapieco", "comment_text": "Hotel Al Ponte Antico. Going back again this fall.\nOn the Grand Canal. Small boutique hotel. Amazing"}, {"username": "Eleni Georgiou", "comment_text": "Hotel Santa Chiara"}, {"username": "Renae Larcus", "comment_text": "A la Commedia Hotel"}, {"username": "Mat PO", "comment_text": "Cipriani!"}, {"username": "Miriam Rice", "comment_text": "Pensione Wildner. We recently stayed there and it was a great location, clean and everything you can ask for in a hotel. They have a nice restaurant in front of it so we got breakfast every morning. We loved it!"}, {"username": "Diana Ferro-Rodrigues", "comment_text": "Hotel Monaco & grand canal or palace bonvecchiati"}, {"username": "Joya Nicastro Cherry", "comment_text": "Following 🇮🇹"}, {"username": "Kerrie Hewitt", "comment_text": "We stayed at the Rialto…. Great location"}, {"username": "Jill Wolder", "comment_text": "I love the Cipriani. The ride back and forth from st marks square ( just a few minutes)is the ultimate Venice experience.and a swimming pool and massage is the icing on the cake."}, {"username": "Tricia Lanieri Forchetti", "comment_text": "We loved the AC Hotel by Marriott."}, {"username": "Kylee U-h", "comment_text": "Hotel Kette"}]}, {"id": "2196873357378409", "text": "Im planning to visit daughter who will be ending her study abroad program In reggio Emilia in late December. When’s the latest possible to book flights and hotels? Im guessing that’s a busy time of year but not ready to commit to itinerary and dates yet. TIA!", "link": "facebook.com/groups/1373361046396315/permalink/2196873357378409/", "likes": 1, "comments": [{"username": "Rhona OConnor", "comment_text": "You would probably get a flight a day or two before you go. From the 20th of Dec flights all over the world get very busy so are very expensive."}]}, {"id": "2196859627379782", "text": "Hope this is ok to ask. My daughter got a minor in Spanish. She’s fairly fluent. Will knowing Spanish help her understand any bit of the Italian language?", "link": "facebook.com/groups/1373361046396315/permalink/2196859627379782/", "likes": 8, "comments": [{"username": "Julio Suarez", "comment_text": "Yes. It’ll help."}, {"username": "Jayne Dawson Meyer", "comment_text": "No"}, {"username": "Allison Mir", "comment_text": "Marginally."}, {"username": "Jordan Schmale", "comment_text": "Have you heard of Romance languages? Barely but not really. I have a bit of French and Spanish floating around but different from Italian."}, {"username": "Paula Clemente", "comment_text": "Yes, a little, my understanding of Italian gives me the “gist” of a lot of Spanish."}, {"username": "Angela Gilmore", "comment_text": "Italian, Spanish, French, Portoguese and Romanian are Romance languages, which means that they all come directly from Latin. They have some similarities, but are not identical, of course.\nSome Italian words are identical to Spanish words, so maybe knowing Spanish can be an advantage. Generally native Spanish speakers understand a little Italian, even without studying it. And the same is for Italian natives that understand little Spanish."}, {"username": "Kristina Ruk", "comment_text": "Spanish is very different.. if she would speak freely it will be hard ;) I know french, english, polish, lithuanian and russian, I can get the contest what people saying, but Spanish was totally out of other language theme. BTW most of italians speak English so dont see the problem;)"}, {"username": "Joe Guzzi", "comment_text": "When we were in the US in 2012, my Italian-only wife got by by seeking out Spanish speakers in shops. She also spent hours with my sister's MIL with MIL speaking Spanish, and wife Italian."}, {"username": "Jessica Nichols", "comment_text": "Yes it will 💯. I am Mexican and currently here. It’s has helped me tremendously"}, {"username": "Giovanni Pianigiani", "comment_text": "Depending on how fluent she is, she should be able to read almost everything, except the few usual \"false friends\". Verbal communication is going to be a completely different story though"}, {"username": "Rita Levi Montalbano", "comment_text": "Im italian and if she can talk spanish quite well, many people here will better understand her spanish than your perfect english"}, {"username": "Orla Breeze", "comment_text": "yes, I speak a fair amount of Spanish and it really helped me in Italy - there's enough similarity to get the gist of a conversation"}, {"username": "Oksana Yarosh", "comment_text": "Have her go through some Duolingo to see how she best deals with hearing and interpreting Italian words and phrases... the style of language learning is unique for each."}, {"username": "Alice Francesca", "comment_text": "Let an Italian answer this: YES.Spanish and Italian are very similar and it will help to get by .\nWhen I go to Spain I don't speak spanish fluently but I understand 90% of what they are saying.\nExamples: Un caffè, per favore (one coffee, please), un cafe', por favor.\nDove è la chiesa? ( where is the church)\nDonde esta'la iglesia?\nIl conto, per favore( check, please)\nLa cuenta, por favor."}, {"username": "Felicia Melo", "comment_text": "My husband speaks Portuguese fluently and speaks a little bit of French and he learned so much Italian just by doing Duolingo for 30 mins a day for 3 months"}, {"username": "Eric Maurer", "comment_text": "Si"}, {"username": "Martha Tuzson Stockton", "comment_text": "Yes. I know French pretty well. It helps. I did order fish ice cream once, but luckily that wasn’t an option, so they gave me peach 🙂"}, {"username": "Rose Stolarek", "comment_text": "Not necessary just speak English as it is easier for you and them .\nI’m fluent in Italian , my husband is not but wherever we went someone always spoke enough English for him without needing me assist him ."}, {"username": "Roxanne Curzi", "comment_text": "Sort of...."}, {"username": "Virgz Van Møøre", "comment_text": "Sure"}, {"username": "Laura Ortiz", "comment_text": "Yes! There are some similarities and plus people would ask me if I spoke Spanish and would switch languages."}, {"username": "Mary Cosentini", "comment_text": "💯 it will, from personal experience."}, {"username": "Mike Natasha Bucher", "comment_text": "Yes I am Spanish speaker , when we travel\nTo italy I speak Spanish / Italian and I can understand. It’s also goo just in case to listen/ learn Italian\nIt will help"}, {"username": "Stacy Derouin", "comment_text": "Yes it will."}, {"username": "Anita Clayton", "comment_text": "Yes it will."}]}, {"id": "2196880584044353", "text": "Just read about this and figured I’d pass it along here. I have no other information so if you have questions please ask Google.\n\nUnited States passport holders have long traveled throughout most of the world without having to worry about visa applications: American travelers currently have visa-free access to 184 destinations worldwide, accordingआणखी to this year’s Henley Passport Index, which ranked the U.S. passport as the eighth most powerful in the world. But that’s set to change next year, as the European Union prepares new travel document requirements for American tourists.\n\nThe new regulations are called the European Travel Information and Authorization System (ETIAS). When the system launches in early 2024, it will require all visitors who currently travel to Europe visa-free, such as citizens from the US, Canada, Australia, and New Zealand, to apply for travel authorization and receive approval prior to their departure.", "link": "facebook.com/groups/1373361046396315/permalink/2196880584044353/", "likes": 3, "comments": [{"username": "Paul Vincent", "comment_text": "The deployment has been deferred 3 times....no date for \"2024\" as yet...most improbable before paris Olympics."}]}, {"id": "2196931997372545", "text": "I can at any time recommend beautiful Capri, It's not that hot , there is a light breeze, fantastic food, people and beautiful nature\n\nThen if you are going to Italy you must visit Capri🇮🇹❤️☀️🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2196931997372545/", "likes": 305, "comments": [{"username": "Blanca Rachele", "comment_text": "Wauwwww Lotte, sikke nogle billeder😱😍❤️"}, {"username": "Annia Irina Barzaga Colón", "comment_text": "Annia Irina Barzaga Colón"}, {"username": "Diana Besonova", "comment_text": "I think I'll bookmark your suggestion for my travel plans."}, {"username": "Jennifer Barker", "comment_text": "Any suggestions for accommodations?"}, {"username": "Linda Charlene Vaughan Osborne", "comment_text": "Just Beautiful"}, {"username": "Chris Tina", "comment_text": "Gorgeous ❤️❤️"}, {"username": "Sharon Bizzell", "comment_text": "Beautiful! We go June 2024"}, {"username": "Nancy Brennan Carrow", "comment_text": "Totally agree! My husband and I took a boat tour from Sorrento in June and loved our day in Capri!"}, {"username": "Doris Sanjuan", "comment_text": "Oui capri c’est pas fini 🤣🤣🤣"}, {"username": "Judy Orloff", "comment_text": "Magical"}, {"username": "Margarita Fergusson", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Dana Talusani", "comment_text": "We loved Capri! Went there for our 10th anniversary and splurged by staying at the lovely JK Place!"}, {"username": "Martina Larkin Keighery", "comment_text": "Just back home from visiting Capri & Amalfi coast, loved it & was very hot😎"}, {"username": "Erica Babb", "comment_text": "Love your pictures! Going May 24!"}, {"username": "Sony Ucciferri", "comment_text": "Will do i promise"}, {"username": "Letty Veronica", "comment_text": "We loved Capri too and learned not to go to the city center until after 5 when all the ferries went back!"}, {"username": "Sarah Salisbury Vander Heide", "comment_text": "Is it worth it to stay there instead of just visit?"}, {"username": "Toni Marie", "comment_text": "💯 just left there"}, {"username": "Sarah Penfold", "comment_text": "We went there Tuesday in the heatwave it was very chaotic and crowded and extremely difficult to find shade, beautiful but I wouldn’t do again at that time of year."}, {"username": "Kookie Jesse Trevino", "comment_text": "I loved Capri up until yesterday. We went 20 years again on our honeymoon and returned with our daughter yesterday. Things have changed so much. It is so crowded and I hate to say a tourist trap. Yes it was beautiful but it was hard to enjoy with the amount of people there and spiaggia torre saracens was littered with cigarette butts. The ristorante le sirene refused to seat me. Place was fairly empty and I felt very embarrassed waiting for them to even acknowledge me. Ended up leaving bc I waited over 20 mins and nothing!! Would have gone else where but by this time all the other restaurants were packed! Ended up with a Coke Zero and bag of chips! So sad! I wish I would have read the reviews before even looking at this restaurant."}, {"username": "Jenny Meffert", "comment_text": "It is truly beautiful."}, {"username": "Mariposa Mariposa", "comment_text": "Can’t wait to go🤍"}, {"username": "Kyunghoo Kim", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Meredith Holloway Helbon", "comment_text": "Following"}, {"username": "Debbie Watts", "comment_text": "Elaine Miller"}, {"username": "Alicja Krampa-Chrabąszczewicz", "comment_text": "Alicja Krampa-Chrabąszczewicz"}, {"username": "Mariët Eertman-Heemstra", "comment_text": "Instead of going to Capri, which is very expensive and crowdy, you could also go to Procida! Also very beautiful and less expensive and less crowdy."}, {"username": "Charlotte Eriksen", "comment_text": "Marina Piccola is the name💦💦💦"}, {"username": "Charlotte Eriksen", "comment_text": "This beautiful beach is located by the town of Capri, and is exactly the view you see on all postcards, there are private bathing areas, you can also lie by the beach if there is space, but there are also chairs for 18 or the mega expensive 50 euros.\ni love that place and it's not overcrowded!💦☀️🇮🇹"}]}, {"id": "2196982760700802", "text": "Is it better to get the VAT refund back on your credit card or in cash?", "link": "facebook.com/groups/1373361046396315/permalink/2196982760700802/", "likes": 0, "comments": [{"username": "Miyuki Kanno Paul", "comment_text": "Cash is better unless your VAT agency’s only option is credit card"}, {"username": "Carmine Castiglia Jr", "comment_text": "Long time since we have done this, but I'm guessing the cash option would be Euros. So, unless you plan to return to a country where you can spend them, you might want to go for the credit card refund instead."}, {"username": "Anthony Sperduti", "comment_text": "Cash"}, {"username": "Tyler Tinney", "comment_text": "Credit card worked well for us"}]}, {"id": "2196866824045729", "text": "Amazing!", "link": "facebook.com/groups/1373361046396315/permalink/2196866824045729/", "likes": 65, "comments": [{"username": "Coral Allorto", "comment_text": "Beautiful"}]}, {"id": "2196868097378935", "text": "Planned a trip to travel throughout Sicily and the other person backed out.. just wanted to know if it’s safe for a woman traveling solo? Will be getting around by train.", "link": "facebook.com/groups/1373361046396315/permalink/2196868097378935/", "likes": 6, "comments": [{"username": "Rhona OConnor", "comment_text": "You will be fine. Just be alert like you need to be anywhere in the world."}, {"username": "Luigia Gray", "comment_text": "You will be ok, but be cautious of anyone who wants to speak with you. They know you are a tourist. I went by myself into Rome and\ndidn't have any problems.\nIt does depend on where\nyou go though."}, {"username": "Sue Gaughan", "comment_text": "I was in Sicily by myself. It was fine. Be aware and confident. People were helpful & kind!"}, {"username": "Laura Uribe", "comment_text": "We spent 3 weeks in Sicily. I would feel comfortable alone in the smaller towns. For Catania and Palermo, there are areas that I would not want to be alone but most places would feel very comfortable. Just read the reviews to see what people are saying about the area. I loved Catania but we came out early one morning to a heavy police presence, which was disconcerting. I think we would have been better staying a little closer to the main part of town rather than the outskirts. You will have a wonderful time!!"}, {"username": "Simone Pfenninger", "comment_text": "Very safe, no problem as a woman alone"}, {"username": "Romina Lauretig Toscano", "comment_text": "Be cautious as you would be everywhere."}, {"username": "Kay Del", "comment_text": "I ended up cancelling my trip to Palermo solo as a woman as every local I spoke to from Italy whilst over here advised me against it. Whether right or wrong, I thought I’d listen to the locals. I just rearranged my plans instead. That being said though, many travel alone and have no issues. I was followed and harassed by an Italian man in Sorrento despite everyone saying it was safe there. I think at the end of the day it’s just what you are comfortable with. Definitely be cautious wherever you go. Good luck & hope you enjoy yourself whatever you end up doing 💖"}]}, {"id": "2196871244045287", "text": "Any tips on hiking the Dolomites? Is it hard to get there?", "link": "facebook.com/groups/1373361046396315/permalink/2196871244045287/", "likes": 0, "comments": [{"username": "Kirsty Manning", "comment_text": "Hired a car. If you can, I’d recommend. Did some day trips and saw a lot of it by driving, particularly Bolzano across to Cortina.\nA great hike is Seceda - highly recommend. Did Cable car from st Cristina, then an easy walk to the chair lift to the top. Amazing views and a cliff top walk up there."}]}, {"id": "2196874834044928", "text": "beautiful venice", "link": "facebook.com/groups/1373361046396315/permalink/2196874834044928/", "likes": 49, "comments": []}, {"id": "2196873737378371", "text": "Pls recommend good rooftop restaurants in Rome and Florence? Tia", "link": "facebook.com/groups/1373361046396315/permalink/2196873737378371/", "likes": 1, "comments": [{"username": "David Perillo", "comment_text": "Rinascente department stores in both cities have amazing rooftop bars and restaurants"}, {"username": "Jenny Barr", "comment_text": "Angel, Se Sto, View on Art, B Roof and La Terrazza."}, {"username": "Jeannine Egdorf Phelan", "comment_text": "Terraza Borromini. Via Santa Maria dell Anima 30. Need to make a reservation. Rooftop bar and some food. Restaurant on 4th floor."}]}, {"id": "2196880834044328", "text": "So excited for our trip in October! We fly into Milan - arrive 9 am. Question - how long does it take to get thru customs in Milan airport? There’s three of us and we are doing COO - thanks to this group! The reason I ask - we are taking train to Florence right away and trying to figure out train reservations/timing. TIA!", "link": "facebook.com/groups/1373361046396315/permalink/2196880834044328/", "likes": 2, "comments": [{"username": "Dianne West", "comment_text": "I wouldn't book a train to FLorence until about 1.00pm. You got to get from Malpensa to Milan Central that's at least an hour. Getting through customs depends on how many flights arrive."}, {"username": "Scott Perry", "comment_text": "I’d wait and book a train at the station."}, {"username": "Jerry Lyubelsky", "comment_text": "We arrived at 9:05am and got through real quick."}]}, {"id": "2196881807377564", "text": "Hi, everyone. My wife and I are going to Italy for our first time in September. We start in Venice, then Florence, then Salerno, then San Giovanni in Fiore (family roots) then finally Rome, before heading home.\nThere will be side trips at each location as well. We are very excited!", "link": "facebook.com/groups/1373361046396315/permalink/2196881807377564/", "likes": 15, "comments": [{"username": "Melinda Jones", "comment_text": "Enjoy"}, {"username": "Marie Cuzzi", "comment_text": "You will love!!! My first trip was 17 years ago and I have visited every year since… Just an amazing country .. it’s like going home for me\nEnjoy every minute . Don’t be afraid to explore the back streets ♥️♥️"}, {"username": "Ruth Akutu Maccarthy", "comment_text": "You'll love it 😍💞"}, {"username": "Elaine Wilson", "comment_text": "Enjoy. You will love it."}, {"username": "Daisy Yoo", "comment_text": "Just try to avoid Rome between sept 29-Oct 1 during Ryder cup"}]}, {"id": "2196882677377477", "text": "I am considering a stopover in Assisi en route to Florence from Rome via train. Does anyone know if there is luggge storage in the Assisi train station or elsewhere? I have looked online…there is a reference to a newsstand or shop that has done so but the date was from a few years ago.", "link": "facebook.com/groups/1373361046396315/permalink/2196882677377477/", "likes": 0, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2196883317377413", "text": "For a Eurail global pass, any limitations on which companies can use or not use with it? It's not clear, but I know you can't use it for everything. I want express trains only. For reference, going from London to Paris, then Paris to Milan/switchover to Florence, and Florence to Rome. Can you use it on the tube/metro too?", "link": "facebook.com/groups/1373361046396315/permalink/2196883317377413/", "likes": 0, "comments": []}, {"id": "2196886804043731", "text": "What is a reasonable price to pay to stay in Venice? After our cruise we have the option to stay for 2 nights in Venice at $215 nz dollars per person. This sounds expensive??", "link": "facebook.com/groups/1373361046396315/permalink/2196886804043731/", "likes": 0, "comments": [{"username": "Emma Basilico", "comment_text": "It depends on the position and the period but I will say that Venice it’s very expensive and this sound like a reasonable price 🙂"}]}, {"id": "2196890834043328", "text": "We’ll be in Venice, Glorence, and Rome for three days each.\n\nI would love love restaurant and dessert recommendations.", "link": "facebook.com/groups/1373361046396315/permalink/2196890834043328/", "likes": 0, "comments": []}, {"id": "2196888757376869", "text": "Is there a similar group to this for Switzerland?", "link": "facebook.com/groups/1373361046396315/permalink/2196888757376869/", "likes": 1, "comments": []}, {"id": "2196892060709872", "text": "Local Opera Recomendation\nin Rome", "link": "facebook.com/groups/1373361046396315/permalink/2196892060709872/", "likes": 3, "comments": [{"username": "Ville Lignell", "comment_text": "The local opera company Teatro dell'Opera plays outdoors at Caracalla baths in the summer. A real must.\n\nhttps://\nwww.operaroma.it\n/"}, {"username": "Stewart Cameron", "comment_text": "Or if not Summer the Opera House is near Termini station. Check the website. There are small tourist targeted concerts of opera ( eg Three Tenors etc ) . Some are not bad others are awful."}]}, {"id": "2196893120709766", "text": "What will be good tour operators recommended to book for Rome .", "link": "facebook.com/groups/1373361046396315/permalink/2196893120709766/", "likes": 0, "comments": [{"username": "Steve Savva", "comment_text": "I’ve found Tiqets good"}, {"username": "Jayne Dawson Meyer", "comment_text": "Perilo Tours!!!! You won't regret it!! 1000% recommended. They were Awesome!"}, {"username": "Kirsty Manning", "comment_text": "NOT vivicos international at the colosseum."}, {"username": "Gena Diaco Penland", "comment_text": "We used Viator and were very happy with all of our tours"}, {"username": "Maria Musumeci", "comment_text": "We booked all our tours through Viator & Get Your Guide for Rome & 4 weeks across Italy. They were all fantastic, no issues."}, {"username": "Ellen Edmonds-Wilson", "comment_text": "Show me Italy."}, {"username": "Lisa Quinn", "comment_text": "Mybesttour.com\n\nThey use golf carts!!"}, {"username": "Michelle Bergman Davis", "comment_text": "We used Viator and Get Your Guide for all of our Italian tours. Great experience with both."}]}, {"id": "2196893587376386", "text": "What is a must if staying in Maiori? Beaches, walks, food and bars? TIA", "link": "facebook.com/groups/1373361046396315/permalink/2196893587376386/", "likes": 0, "comments": [{"username": "Miyuki Kanno Paul", "comment_text": "Walk to Minori. Have dessert at the world famous Sal de Riso"}]}, {"id": "2196893687376376", "text": "I am planning a day trip to Lake Garda from Verona. I have looked at some day tours and read mixed feedback. Would you recommend a set tour or should I catch a bus/train from Verona to Sirmione early morning. I am thinking I could take a look around Sirmione and then take a ferrie or sight seeing cruise from there? Suggestions - Which would be more enjoyable if you have done either? Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2196893687376376/", "likes": 0, "comments": []}, {"id": "2196912134041198", "text": "Hi,I need some tips and suggestions for beach club . We will be in capri , sorrento and positano . Which place would be the best option to book a beach club and what club you all recommend. Do we need to book in advance ? Thanks all in advance .", "link": "facebook.com/groups/1373361046396315/permalink/2196912134041198/", "likes": 2, "comments": [{"username": "Cettina Milioto", "comment_text": "Are u travelling with kids? We went to l’incanto in positano! We enjoyed it and it was really nice. We had a waiter to serve us at our seat. Restaurant and bathroom easy access.\n\nI know there is another one but it’s not recommended for families.\n\nSorrento the beach isnt great.\n\nWe didn’t go to capri this time."}, {"username": "Parizad Firdosh Chinoy", "comment_text": "Thank you so much!🤗 No kids ."}]}, {"id": "2196910297374715", "text": "Looking for a “gluten free” private cooking class in Florence.", "link": "facebook.com/groups/1373361046396315/permalink/2196910297374715/", "likes": 0, "comments": [{"username": "Julie Parrish Rodriguez", "comment_text": "Following and bump!"}]}, {"id": "2196921834040228", "text": "Hello everyone, I’m planning to be in Cinque Terre about mid September for 3 nights. Any reasonable recommendations for a place to stay?\nDoesn’t really matter where in Cinque Terre.\nThank you", "link": "facebook.com/groups/1373361046396315/permalink/2196921834040228/", "likes": 1, "comments": [{"username": "Virgz Van Møøre", "comment_text": "Sestri Levante"}, {"username": "Simone Pfenninger", "comment_text": "La Spezia, Monterosso al Mare or Santa Margherita Ligure"}]}, {"id": "2196927150706363", "text": "Would I be able to access the Vatican Museum earlier than my time slot? What happens in the opposite case? (I'm a few minutes late).", "link": "facebook.com/groups/1373361046396315/permalink/2196927150706363/", "likes": 0, "comments": []}, {"id": "2196928197372925", "text": "Hi All, first time traveller to Italy next July 2024 (myself and my 16 year old twin girls) and would love some feedback. These are the cities we want to visit; Venice, Milan, Rome, Florence, Naples, Calabria, Sicily. We will be travelling from Australia and for 4 weeks, what order should we do to maximise our time in each city. Most probably flying in and out of Rome as that is usually the most reasonably priced flights? All feedback welcome…so very excited!", "link": "facebook.com/groups/1373361046396315/permalink/2196928197372925/", "likes": 0, "comments": [{"username": "Katia Macri-Roberts", "comment_text": "I live in Australia and I travel to Italy very frequently with my kids ( now adults) . Personally I would skip Milano. Replace it with Pisa, close to Florence; or Verona close to Venice. I visit Calabria every time as we have family there. I highly recommend Tropea and the Porto Ulisse resort as the girls would love the rooftop pool overlooking the Tyrrhenian Sea. I would probably start in Rome and head south . Then you can fly from Lamezia Terme airport in Calabria back up to Venice and then make your way back to Rome via Florence."}, {"username": "निनावी सहभागी", "comment_text": "Thank you I too have family in Calabria so that will be a must. My daughters really want to go to Milan, just 1 day I’m thinking! Thanks so much 😊"}]}, {"id": "2196928810706197", "text": "Planning a road trip through Italy & Croatia for a week. Looking for Advice/Suggestions on routes.\nRome 🚘 Naples 🚘 Bari ⛴ Dubrovnik 🚘 Split 🚘 Zadar 🛩️ Rome", "link": "facebook.com/groups/1373361046396315/permalink/2196928810706197/", "likes": 60, "comments": [{"username": "Renee Rundle Stoneham", "comment_text": "That’s a lot of driving for just a week… especially if you really want stop & see and explore some towns etc.\nWe just did similar mileage in US (TX to CA) it’s a lot of Butt time, we did it 2.5 days with a few stops along the way, but nothing more than 1hr or so.\n\nI’d suggest picking 1 country to explore for a week. Or going for 2 weeks.\n\nAlso looks like your planning on renting in Rome and Returning in Croatia. 1 way rentals can be $$$ bf many won’t let you return in a different country."}, {"username": "Rita Kanten", "comment_text": "You're going to do all of that in a week? The only way that is possible is if you spend every day on the road and only stop for overnight. I guess if that's your idea of a vacation then give it a try. 🤷‍♀️"}, {"username": "Pat D'Ambrosio", "comment_text": "I think you can do it 2 days."}, {"username": "Renee Rodi", "comment_text": "I agree this is too much to do in a week. You will spend all your time traveling and not get to enjoy your trip. I have been to both areas on your itinerary.\nIf you go to Croatia and have the time you should go to Plitvice National Park. An amazingly beautiful area.\nI just came back from a trip to the “heel” area of Italy. I loved being in the countryside and not always in the big cities."}, {"username": "Megan Leigh", "comment_text": "This is an AWESOME itinerary... needs more time, but it's awesome, lol"}, {"username": "Janet Walls", "comment_text": "We just returned from a 10 day trip from Dubrovnik to Trogir (one of the most complete medieval walled settlements in Europe), and could have spent far longer....."}, {"username": "Nikki Watson", "comment_text": "If you can, stop at korcula overnight"}, {"username": "Laura DeCicco", "comment_text": "You’re doing this all in a week? Do you have a magic portal? If you’re just driving through without stopping anywhere I suppose it’s possible but otherwise this trip requires at least 3 weeks"}, {"username": "Debra Indorato", "comment_text": "We were wondering if we should add Croatia to our trip. Following."}, {"username": "Jennifer Asher Olson", "comment_text": "So many haters! You can do it all, but time spent in each location will need to be precious."}, {"username": "Céiléidh Hennessy Carroll", "comment_text": "Wayyyy too short, need at least 13-14 days"}, {"username": "Alessandro Paxia", "comment_text": "You need weeks for this trip, there are many things to see in Rome (at least 3 days) then Naples/Pompei/\nCaserta (3 more days), etc"}, {"username": "Esan Sangeles", "comment_text": "Mostly some of my people do this.😃"}, {"username": "Ian Fawkner", "comment_text": "We did a similar trip in May-June. Rome-Naples-Sal\nerno-Messina-Po\nzzallo-Malta-Za\ngreb-Split-Dubr\novnik-Kotor-Dub\nrovnik-Rome-Sie\nna-San Gimignano-Flore\nnce-Venice-Rome\nby train/ferry/\nbus/plane. But it took five weeks…all BnB was a blast !"}, {"username": "Shardul-Neha Purohit", "comment_text": "You must be an F1 driver 😂…don’t do more than 1-2 cities per week and take day trips to some villages/\nvineyards"}, {"username": "Susan Dillon-Centofanti", "comment_text": "Too much for a short time"}, {"username": "Giuliana Chemello-BigDog RPht", "comment_text": "Personally, I think that's gonna be a tough one. You need to consider that you'll need a day ish for the time change. Then, it's going to be SO crazy busy that it's going to take twice as long as usual if traveling by car."}, {"username": "Darlene Cochran Sheridan", "comment_text": "Leigh Barringer Tipton Donna Grindle Catledge"}, {"username": "Carly Plantagenet", "comment_text": "We did 10days just for Rome and Naples we had full busy days and could have done even more."}, {"username": "Amy Pagano", "comment_text": "Look amazing and I agree with others about the time constraints. Just a word of caution when it comes to driving along the Amalfi coast (just got back from there last week). The roads are quite challenging unless you're used to that sort of thing. Very very narrow and winding and take a long time to travel through due to traffic jams and the necessity to drive slow. Keep in mind honking means a bus or other large vehicle is coming around a blind corner. We witnessed an accident and several very close calls in a short 3 day time span. It's also beautiful so you'll want to account for time to stop and take it all in or see the little towns you're driving through."}, {"username": "Michelle Davies", "comment_text": "Lol"}, {"username": "Valarie Annatone", "comment_text": "just do venice and take ferry to Croatia - 3.5 days in each"}, {"username": "Lara Toyne", "comment_text": "Kelly Collins"}, {"username": "Sandra Vilters-boer", "comment_text": "Not possible in just 1 week.\nWe did a three week roadtrip Slovenia-Croati\na last year. If you really want to enjoy where you are instead of driving only…\nIn Croatia we visited Fazana- Zadar- split- bol (Island Braç)\nWe loved Split and really recommand to visit one of the Islands there (Braç, hvar..)"}, {"username": "Anne Hoenig Steib", "comment_text": "That is a lot for a week."}, {"username": "Andrea Farkas", "comment_text": "From Split you can travel to Ancona by ferry also"}, {"username": "Rachel Churchward", "comment_text": "Huh? That’s a 3 week trip"}, {"username": "Lucia Dedíková", "comment_text": "We spent 15 days on this Road Trip. You have to skip smth"}, {"username": "Coen Dekker", "comment_text": "Stay in one place !"}, {"username": "Jennifer Conti", "comment_text": "Christopher Conti, take a look at this itinerary and suggestions."}, {"username": "Patricia Strijbos", "comment_text": "A week seems very short and I would definitely visit Materra instead of Naples and Trogir instead of Zadar"}, {"username": "Charlie Trippick", "comment_text": "Wouldn’t bother with Naples in my opinion, so many more beautiful places to go"}, {"username": "Maureen Kelland", "comment_text": "When are you going. If you plan on taking the overnight ferry to Croatia the last sailing I can see is Sept 29th. They have not posted the fall sailings"}, {"username": "Marcus Hiesler", "comment_text": "Sharon Hiesler"}, {"username": "Vladimir Boskovic Serrudo", "comment_text": "Too much for a week, plan for fewer stops. A lot of driving. But fantastic route, you will see so many beautiful landscapes."}, {"username": "Tijana GH", "comment_text": "Hi, how do you plan to do Zadar-Rome? Do you want to do city hopping or check the area?"}, {"username": "Michael Messina", "comment_text": "Dubrovnik 2 days plenty Plit 3 nights ok, i would forget Zadar."}, {"username": "Gundega Barkane", "comment_text": "Visit museum of sculptor Ivan Mestrovic in Split, if you like art."}, {"username": "Dianne West", "comment_text": "The ferry ride will be at least a day. You'll see nothing with that much travel. It's too far."}, {"username": "Jordan Schmale", "comment_text": "Only a week? Not enough time for that much travel."}, {"username": "Virgz Van Møøre", "comment_text": "You'll lose a lot of time on the road"}, {"username": "Rhona OConnor", "comment_text": "Everything takes more time than you think.... Allow time to sit and enjoy where you are. If you are in Bari visit Alberobello and the Turulo houses."}, {"username": "Sam Passante", "comment_text": "7days? You’re about 3 weeks short. You’ll spend 80% of your time traveling and checking in and out of hotels, unless you don’t plan eating and sleeping for a week 😂"}, {"username": "Claudia Castellini", "comment_text": "This could be a good road trip for two or three weeks!"}, {"username": "Annalisa Ricciardi", "comment_text": "One week is not enough time for that trip. The plan is amazing, but you need AT LEAST 2 weeks for that. Moreover you should consider to visit not only the cities you mentioned, but also the surrounding zones (for instance Pompei, alberobello, matera…) and a city like Rome requires 3 days minim if you want to visit some museums and not just hanging around."}, {"username": "Dana Guidotti Rooney", "comment_text": "That’s looks really good You should visit Puglia before you cross over to Dubrovnik.\nMatera is a cave city is fascinating."}, {"username": "Ken Lerch", "comment_text": "I hope you have a fast car, like driving through beautiful areas. The purpose of a road-trip is to slow down and savor the terrain. Your timeline nullifies your ability to do that. I once spent two weeks getting over to zadar from Ancona then doing the trip to Dubrovnik. Advice: drink the Slimovitz."}, {"username": "Marilena Damilano", "comment_text": "Just enough for Roma!!"}, {"username": "Carol Scime-Raiford", "comment_text": "For one week or even 10 days, I would pick 1 country. ( you are driving for about a total of 50 hours (and that’s non-stop)and 1200 miles (roundtrip) and the arrival day and departure day) doesn’t really give one enough time to enjoy the journey and stopping at the destinations you would like to see."}, {"username": "Matthew Gramitt", "comment_text": "I’ve been to Europe 5 times in the last year and a half. 4/5 trips were 9 full days plus 2 travel days (flying there and back from the U.S.). Always renting a car, and always packing in lots of cities and towns, much more than most. But this itinerary that you’re considering is even too much for me! By a lot!\n\nIf you’ve never been to Italy and Croatia, here’s a road-trip that is more doable within that timeframe:\n\nVenice, Trieste￼￼, Koper (or other coastal Slovenian town), then to Istrian Croatia - Grožnjan, Rovinj, and Pula (or whichever other towns interest you).\n\nThat is far less driving but still may be packing too much in. Add a couple more days and it’s very doable."}, {"username": "Patrice Larry Stevens", "comment_text": "You won’t have time to sleep!"}, {"username": "Kirsten Marie", "comment_text": "Last summer I went to Venice for three nights then went on a cruise that stopped in Split and Korcula. Once there, we realized how much we would have loved to spend more time in Croatia. A suggestion might be to stay in Venice for three nights then the next three nights in Croatia. While in Venice we traveled to Burano and Murano and in Croatia there are day trips to most areas."}, {"username": "Victoria Marchetti", "comment_text": "Take at least 2 weeks..."}, {"username": "Jeanne Petraglia", "comment_text": "Not enough time"}]}, {"id": "2196958200703258", "text": "What is the best way to pack medicine, supplements? Can I just put them in zip lock bags, no way there is room for original containers -", "link": "facebook.com/groups/1373361046396315/permalink/2196958200703258/", "likes": 0, "comments": [{"username": "Annof RedGables", "comment_text": "Most countries, if they check, will require them to be in original containers with either a letter from doctor or scripts. I usually pack into a packing cell and then into hand luggage."}, {"username": "Ken Lerch", "comment_text": "Yes. That’s how I do it for two months at a time. Along with a pill counter."}, {"username": "Rita Kanten", "comment_text": "I've traveled to 23 countries and never had my pills checked. I put them in a daily minder container in my carryon. But I don't take any controlled substances so that might be different."}, {"username": "Camille Wittenhagen", "comment_text": "Ive never ever ever thru a few countries ever been asked to show what the pills are in my pill box. I’ve never ever ever had to produce a script either. I’ve never seen it happen to anyone and it’s never ever happened to any travel companion. Pack in the smallest and easiest container for you and take in your carry on. Never put meds in a checked bag as they will be stolen. If you had a lot of controlled substances I’d carry the bottle and a script. There is no way they can check every med that every person is carrying. If you look or act suspicious it might be a different story maybe."}]}, {"id": "2196977480701330", "text": "Italy in January. Thoughts?", "link": "facebook.com/groups/1373361046396315/permalink/2196977480701330/", "likes": 16, "comments": [{"username": "Franca Aquino", "comment_text": "No not at all, too cold for my liking."}, {"username": "Monica Sucato", "comment_text": "Cold but nice!"}, {"username": "Meg Thornton", "comment_text": "My daughter went in January and loved it! Crowds were low and Rome was much warmer than home (Michigan). She wore tshirts and jeans and was comfortable."}, {"username": "Pietro Di Sorbo", "comment_text": "The best time for visiting museums and cities art, not so good for seeing landscapes and scenarios as Amalfi coast, 5T, big north lakes and costal towns because of the cloudy, cold and rainy weather, consider in that places many restaurants and shops in this period are close too."}, {"username": "Bobbie A. Lewis", "comment_text": "We are planning to go in March. I just don’t want to go on vacation in hot weather! It’s miserable!"}, {"username": "Mandy Miller", "comment_text": "I'm going January for my 60th 😁... Can't wait 😁 ❤️"}, {"username": "Ruth Akutu Maccarthy", "comment_text": "Dolomites!!!!!"}, {"username": "Francine Greco Stahanczyk", "comment_text": "I was there this past January and it was perfect."}, {"username": "Roger Pajo", "comment_text": "Beats being at home on the couch"}, {"username": "Shadeya Mellon", "comment_text": "I went to Venice, Florence and time first week of January and it was cold but doable. Beautiful holiday decorations everywhere and not crowded. We enjoyed it"}, {"username": "Colleen Dawson", "comment_text": "Yes , skiing in the Dolomites."}, {"username": "Clint Madsen", "comment_text": "Cold!"}, {"username": "Laurel Riola", "comment_text": "Why not? Less crowds and probably cheaper during that time"}, {"username": "Blenda Johansen-Rodriguez Del Rio", "comment_text": "I spent New Year’s last Dec/Jan. Weather was 60°F. It was amazing! ￼"}, {"username": "Sarah Michelle Rocca", "comment_text": "Fabulous! Was in Campania and Lazio. No crowds, less expensive than summer. Beautiful experience ❤️🇮🇹"}, {"username": "Enrico Lecce", "comment_text": "Yes"}, {"username": "Cherie Compartore", "comment_text": "Why not? Probably amazing."}, {"username": "Karen Cumbo", "comment_text": "Yuck"}, {"username": "Marianne Langa", "comment_text": "Anytime..❤️❤️"}, {"username": "Jodi Nichole Toohey", "comment_text": "Just avoid the north. The rest wouldn’t be any worse than Gundy in winter 😝"}, {"username": "Laura Bolzic", "comment_text": "Average temperature ranges for different regions of Italy in the month of January: Northern Italy: -4 to -5 C / 25 to 45 F. Central Italy: 5 to 13 C / 40 to 55 F. Southern Italy: 10 to 16 C / 50 to 60 F."}, {"username": "Jodie Jeans", "comment_text": "Fabulous!!!\nWinter in Europe is winter in Europe!!\nDecember for us, but we’re still expecting cold weather.. El Niño here means super cold there!\nVino & pasta will fix everything!!!\n🍷"}, {"username": "Dana Green", "comment_text": "Good idea!"}, {"username": "Barb Lesperance", "comment_text": "I went this past Xmas for 10 days .. in the 60’s"}, {"username": "Rana Shehadeh", "comment_text": "Too cold and the days are short 😬"}, {"username": "Samantha Pavanello", "comment_text": "Se vai al sud italia si sta bene considera che è un periodo freddo"}, {"username": "Tami DeFreece Maiocco", "comment_text": "We love visiting Italy in January. Maybe cold but in Venice the canals so not smell, lesser crowds, lower hotel costs."}, {"username": "Ann Moore-Pak", "comment_text": "Least crowded time!"}, {"username": "Anthony McClure", "comment_text": "Winters in Most of Italy are usually mild. Northern Italy sees a lot of snow."}, {"username": "Phyllis Snyder", "comment_text": "Less crowded- less expensive- dress warmly- have a blast!"}, {"username": "Jay Cabrera", "comment_text": "Yes! Was actually in Italy this January. Rome and Venice. It was cold and there was some rain. But it’s still Italy and count me in any time!"}, {"username": "John Martinussen", "comment_text": "Skiing in Livigno 🥰"}, {"username": "Joe Guzzi", "comment_text": "Nice."}, {"username": "Leigh Griffiths-Cole", "comment_text": "We went to Milan in early Jan, Christmas trees & markets still up, and got the Bernina Express to St Moritz. It was fab."}, {"username": "Tal Burdejny", "comment_text": "Perfect"}, {"username": "Edita Nezvalová", "comment_text": "We were in Pisa, Florance and Cinque Terre and amazing! In Cinque Terre we were the only tourists, Pisa and Florance not crowded. Just be aware, that in 5 Terre there were no shops open, usually just one caffe or restaurant😊"}, {"username": "Back Stage", "comment_text": "Low season, low rates, low temperatures👍🏻"}, {"username": "Shawn Kopp", "comment_text": "Love it"}, {"username": "Dianne West", "comment_text": "Why not?"}, {"username": "Alice Francesca", "comment_text": "Cold but bearable.Beauti\nful resorts in the Alps to sky. Avoid Lake Como, too gloomy in the winter.Beautifu\nl Rome, Venice, Florence etc around Xmas"}, {"username": "Barbara Kistler Wilhelm", "comment_text": "Much better than the summer"}, {"username": "Thuy Tdt", "comment_text": "I went to Italy (Venice) this January and it was amazing\nLess crowded and the weather was fine for the season"}, {"username": "Randy Moffett", "comment_text": "We are going for the first time with our family Dec. 26 to Jan 6. It is the only time we can all go together. 5 days each in Rome and Florence. Maybe some day trips to Venice, Pisa, CT."}, {"username": "Anthony Attanasio", "comment_text": "The best. Not as many tourists as peak season."}, {"username": "Dawn Wilhelm Harvey", "comment_text": "Was there the first week of January this year. We were in ￼Venice, Florence and Rome. The weather was cold, but if you are used to a cold winter climate, it’s not bad at all and I would take the cold weather and low crowds any day of the week ❤️"}, {"username": "Ville Lignell", "comment_text": "It will be cold but fewer tourists around. Where would you go?"}]}, {"id": "2196931567372588", "text": "Travelling to Rome late October haven’t booked accommodation yet . We will have a car but don’t want to drive into Rome. Any advise on towns / suburbs outside of Rome that have parking and access to train or bus to get into the city . Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2196931567372588/", "likes": 0, "comments": [{"username": "Cecilia Christine Costantini", "comment_text": "Garbatella neighbourhood, Linea B metro. It is 3 metro stops away from Colosseo and you can park for free. You can also get bus #716 or #23 to reach it from the city center (although buses are less reliable). You might also be able to have some meals in \"real\" Italian restaurants. Quite a lot of movies are shot in this neighbourhood, as the old part is really quaint and the architecture is really peculiar."}]}, {"id": "2196936800705398", "text": "We have a free week in the first half of November-23, which we want to spend in one spot in Italy. We have the option of a direct flight to Napoli or Bologna, and I’m wondering if you had the option, which of these two cities you would rather spend a week, and why.\nIn anticipation, thanks for your input 🥂🍕☕️", "link": "facebook.com/groups/1373361046396315/permalink/2196936800705398/", "likes": 0, "comments": []}]