[{"id": "2203284846737260", "text": "We will be traveling to Rome in November. I have read the Pope comes out to greet people from his apartment window. Does anyone know what time he does this? I'd like to time my tour in hopes of seeing him. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2203284846737260/", "likes": 6, "comments": [{"username": "Eric Parks", "comment_text": "Does Pope Francis actually live in the Papal Apartment? I was told he chose to stay at the House of Saint Martha instead."}, {"username": "Gilvie Miñano Ocampo", "comment_text": "f"}, {"username": "Diane Janovas", "comment_text": "The Pope will appear at that window. You should goggle it to get the correct information."}, {"username": "Mick Konowal", "comment_text": "It’s called the Angelus. It is at noon on select Sundays. Here is the schedule for this year. http://\nwww.papalaudienc\ne.org/schedule"}, {"username": "K Paat Velasquez", "comment_text": "Every wednesday morning there is a Papal Blessing at St Peter’s square.\n\nThen sunday 12nn the Pope appears in his balcony for the angelus"}, {"username": "Elizabeth Marvin Seredich", "comment_text": "Wednesday morning at 9, you need to get tix (which are free). Or mass on Sunday."}]}, {"id": "2203284340070644", "text": "Has anyone booked Guided Tours for Individuals - Vatican Museums and Sistine Chapel from the official site and was ble to go to St. Peter’s basilica? If not, where would you recommend to book for it. Thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2203284340070644/", "likes": 2, "comments": [{"username": "Shen Min Chue", "comment_text": "They have now freely opened the shortcut from Sistine Chapel to St. Peter's for all visitors to the museums; whether you buy your tickets direct from the Vatican or from 3rd parties and be it as individuals or in groups tours"}, {"username": "James-Kathy Dickerson", "comment_text": "U really don't need a guided tour.. we have done all on our own...get up early start with the vatican and take the elevators to the third floor and climb to the dome the views are amazing...wonde\nr st Peters and then go down to the Vatican crypts after that come out the church and take a left round the corner and the sistine chapel museum will be down the street all is free except for the elevator ride to the third floor to climb the dome and sistine chapel... Best advice I can give is buy the Rick Steves Rome travel guide super easy"}]}, {"id": "2203286433403768", "text": "Has anyone booked Guided Tours for Individuals - Vatican Museums and Sistine Chapel from the official site and was ble to go to St. Peter’s basilica? If not, where would you recommend to book for it. Thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2203286433403768/", "likes": 1, "comments": [{"username": "Ty Levine", "comment_text": "Don’t really understand your question.\n\nYou don’t need a guided tour of the museums and Sistine chapel. East to do on your own.\n\nFor St. Peter’s you get in line and walk in. Do at your own pace. Use Rick steves guided app and you can do all for free. It’s the same as a paid guided tour."}]}, {"id": "2203287460070332", "text": "Has anyone done a dinner cruise in Venice? Sounds fun but is it worth the evening (more concerned with time than money)?", "link": "facebook.com/groups/1373361046396315/permalink/2203287460070332/", "likes": 0, "comments": []}, {"id": "2203290940069984", "text": "Going to Venice tomorrow, it’s the last stop on our 2 week trip, just wondering for those of you that have been to Burano how was the vaporetto ride? My daughter hates boats, we had to get off the boat to Capri before it even left because the motion was making her nervous but I really want to see Burano so wondering if It has too much motion in which case she will stay at the hotel. TIA", "link": "facebook.com/groups/1373361046396315/permalink/2203290940069984/", "likes": 3, "comments": [{"username": "Laura Steuart", "comment_text": "We only went to Murano which is much closer than Burano and it was very choppy. There is so much boat traffic in Venice that I don’t think you can avoid choppy waters"}, {"username": "Vivien Paulik", "comment_text": "She should stay at the hotel"}, {"username": "Mary Brown", "comment_text": "I get seasick at times and didn’t find the vaporetto too rough\nI also didn’t have a problem on a 2 hour boat ride to Amalfi\nWe went early July. I suppose it depends on weather conditions"}, {"username": "Mary Brown", "comment_text": "You can also take a water taxi which will be faster but obviously more expensive"}, {"username": "Russ Whitley", "comment_text": "Vaporetto was pretty good. Small taxi boats bounce around a bit."}, {"username": "Karen Schmidt", "comment_text": "2 days in Venice isn’t much time…I’d leave it and enjoy the beautiful city!"}, {"username": "Mary Gregory", "comment_text": "40 min water taxi ride was fine"}, {"username": "Barbara Bastianini", "comment_text": "I’m prone to motion sickness but the vaporetto ride to Burano never bothered me. The water was always pretty smooth. Anyway, the vaporetti being large, heavy, and stable wouldn’t bounce around the way a smaller, lighter boat might. Plus, boats on the canals and in the lagoon are limited to speeds that don’t churn up the water.\n\nSo all in all I think it’s likely that she’ll be ok. But even so I’d suggest deciding that day about going. If the water looks choppy you don’t have to go. But if it looks smooth there might be nothing that would make her nervous."}, {"username": "Jennifer Dobachesky", "comment_text": "I felt the boat was fine the crowds get bad on the afternoon so go early if you can"}, {"username": "Michelle Murphy Margolati", "comment_text": "I think the hotel ."}, {"username": "Jill Tingley", "comment_text": "Very easy."}, {"username": "Jill Greenberg Minton", "comment_text": "It wasn’t choppy on the day we went but it was at least 30 minutes and extremely hot. Those taxis get packed!￼"}, {"username": "Melissa Doran", "comment_text": "My family just got back from Venice. My sister got sick on the vapporetto from the train station. She took Dramamine before we went to Murano and also wore her sea bands with no issues."}, {"username": "Kristina Ruk", "comment_text": "Maybe medicine against sickness would help. Have your daughter tried any?"}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "Just arrived here yesterday and I thought the water seemed calm. In the past, I've never had a problem and I tend to get motion sickness also."}, {"username": "Melinda Bourke", "comment_text": "Water taxi was fun and fresh."}, {"username": "Colleen Jennings", "comment_text": "If she knows she gets sick then I’d avoid. There are plenty of thing to enjoy in Venice."}, {"username": "Denise Chapman Toth", "comment_text": "The water can be choppy"}, {"username": "Sandra Budonaro Garofalo", "comment_text": "Thank you everyone for your responses!"}, {"username": "Domenica Calvene", "comment_text": "I get motion sickness,can't handel boats but the ferry ride was fantastic.Just sit outside with fresh air."}, {"username": "Terina Kwiatkowski", "comment_text": "It easy breezy"}, {"username": "Allison Stebbins Weakly", "comment_text": "We just left Venice and rode the vaporetto to Burano. It was fine! One in our party gets severe motion sickness and she said she didn’t feel sick at all. The boat was very stable and they don’t go crazy fast. I think your daughter would be ok."}, {"username": "Gwen Cooke", "comment_text": "I get motion sickness and felt awful on the ferry to Capri … but I was fine on the vaperetto to burano , it’s a long way ( about an hour ) but you can stand outside and the fresh air really helps … if you only have two days .. I’d probably give burano a miss … it is pretty but … not an awful lot to do there once you’ve had lunch and seen the colourful houses and shopped a little … also the vaperetto times are quite infrequent to burano and back … there’s so much to see and do in Venice I’d probably stay on the main island and maybe take the no 2 ( The stop is served by line 2 with departure from both Piazzale Roma and San Marco San Zaccaria stop. ) over to the Island of Saint Giorgio Maggiore … those vaperettos are frequent and it’s only a very short journey over there ( 3 mins ) with a beautiful white fronted church and amazing views back across Venice from the campanile over there ( also no queues like the campanile in Saint marks !) https://\nvenicelover.com/\nsan_giorgio_magg\niore.html\nIf you do decide to go .. maybe get off at lido on your way back and enjoy a quick toe dip in the sea and a drink and some wonderful gelato x ( lots of very frequent vaperettos from lido .\nEnjoy 😊"}, {"username": "Sonia Smith", "comment_text": "Try Bonine. Over the counter for motion sickness but doesn’t make you sleepy as dramamine."}]}, {"id": "2203290776736667", "text": "Any tips on transportation from port in Cvitivechia to Rome and back? Is the train station within walking distance from the port?", "link": "facebook.com/groups/1373361046396315/permalink/2203290776736667/", "likes": 0, "comments": [{"username": "Karen Ries", "comment_text": "It is not, short taxi ride"}]}, {"id": "2203292256736519", "text": "Hi there! Any females that are traveling/live within the following areas in September that want to connect? My partner is working in the evenings so trying to find ladies to connect with! :)\n\n\nMilan\nVenice\nFlorence\nRome\nNaples\nAmalfi Coast (TBD exactly where yet)\n\n\nSend me a DM :)", "link": "facebook.com/groups/1373361046396315/permalink/2203292256736519/", "likes": 2, "comments": []}, {"id": "2203294153402996", "text": "Can someone help me please. Will accommodation (hotels or air bnbs) look after luggage if you arrive early? We are planning early trains from place to place but don’t want to have to drag luggage around. TIA 😊", "link": "facebook.com/groups/1373361046396315/permalink/2203294153402996/", "likes": 5, "comments": [{"username": "Michele Levesque Semosky", "comment_text": "Depends upon their policy, you should check with them directly."}, {"username": "Laura Uribe", "comment_text": "We either plan our train to arrive about 1:00 as most places are amenable to that time for check in or if it’s super early, book that day as well."}, {"username": "Dave Colleen", "comment_text": "All of our hotels did. Veince- Hotel Moresco, Florence Kraft Hotel, Rome Hotel Kolbe, Cinque Terre Hotel Porta Roca."}, {"username": "Ron O'Brien", "comment_text": "Best to check in advance. However, I have arrived early and left luggage at dozens of hotels and have never been refused."}, {"username": "Lira Shine Desiree", "comment_text": "Ask your hotel if not check bounce app or city locker for places that you can store your luggage for you"}, {"username": "Sue Sherwood", "comment_text": "I have been to many cities and countries. They all take your luggage early... and its totally safe. Just dont leave $$ in your bags."}, {"username": "Russ Whitley", "comment_text": "Hotels, usually yes. Air B&B, apartments etc are difficult as there is no reception nor place to store usually."}, {"username": "Janet Messanelli Bozzone", "comment_text": "Most hotels and some AirBNBs. Most AirBNBs don’t have the extra storage room to check bags unless the hosts themselves actually live close by. You need to check with every location."}, {"username": "Barbara Bastianini", "comment_text": "I’ve never had a hotel refuse to store my luggage before check in or after check out. Of course I email each hotel before hand to ask rather just assume they will."}, {"username": "Gillian O'Callaghan", "comment_text": "Yes hotels will."}, {"username": "Nancy Lewis", "comment_text": "Yes. Our hotels held our luggage in storage until we checked in."}, {"username": "Gina Rovello Keenan", "comment_text": "Contact the hotel directly. Most will but not all."}, {"username": "Kay Kosar", "comment_text": "Thanks very much everyone 😊"}, {"username": "JeriLynne Clifford", "comment_text": "The concierge is your friend. Email and ask them."}, {"username": "Stacy Derouin", "comment_text": "We've never had a hotel refuse. But just to be sure may want to check directly."}, {"username": "Sherry Davis Wainz", "comment_text": "Hotels will accommodate your luggage. We have used Bounce to store luggage when we could not check in to air bnb. Check ratings carefully."}, {"username": "Roland Trego", "comment_text": "Hotels will often do that (ask them), but with Airbnb's it is much less common. It's one reason I much prefer staying in hotels (along with less risk of having my reservation canceled). Sometimes people leave their possessions in storage lockers."}, {"username": "Kay Rendall", "comment_text": "Contact the accomadation. Most do, but b&b may not have facilities"}, {"username": "Jeff McLellan", "comment_text": "Most hotels yes, AirBnBs no but you can ask host contact."}, {"username": "Jeidy Christina Duarte", "comment_text": "Call the hotel, most do this, but call them to make sure"}, {"username": "Bev Madill", "comment_text": "You need to check with the relevant accom. I've used Luggage Point in the past. Not expensive."}, {"username": "Sandra Shoffner", "comment_text": "Check website, if it says luggage storage it does."}, {"username": "Laura DeCicco", "comment_text": "Get the apps, Bouncer or Stash, that way if they won’t you can find a luggage storage area nearby."}, {"username": "Sara Beth", "comment_text": "Ask them."}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "Most places we've been in offer that service either before check-in or after check-out."}, {"username": "Charleen Siegler Schuss", "comment_text": "The Hotels usually do. Often Air bnbs don't have anyone around until check in. Email and ask"}, {"username": "Renae Larcus", "comment_text": "Hotels will. You’d have to ask your Airbnb in advance."}, {"username": "Diane Davis Lawyer", "comment_text": "Some will. Some won't. You have to ask to find out."}, {"username": "Diane Davis Lawyer", "comment_text": "Airbnb hosts are often not on site early, if so, they can't."}, {"username": "Jenny Payne", "comment_text": "Not usually airb&b’s as they are most likely doing change overs . The hotel I stay at in Rome allows you t leave your luggage 🌻"}, {"username": "Jaime Cleek", "comment_text": "They may. You’re best to check"}, {"username": "Vivien Paulik", "comment_text": "It depends on the place. Some hotel say yes. If the airbnb just an apartment when somebody else still stay in the morning, there is no place to leave the luggage. If the owners live in the neighbour, they can help you.\nAsk the place where you stay"}]}, {"id": "2203296390069439", "text": "Ciao. Traveling to Italy. I would very much appreciate recommendations for local places to eat in Bari and Naples. Preferably a place where there is no menu and you eat what is being served. Where the locals eat. Gracia!", "link": "facebook.com/groups/1373361046396315/permalink/2203296390069439/", "likes": 0, "comments": [{"username": "Carmela Noble", "comment_text": "Google agritourismo in bari or Napoli. Probably what you are looking for"}, {"username": "Michela Zanni", "comment_text": "Generally we order from a menu"}]}, {"id": "2203296746736070", "text": "Help !? Any advice which train I should choose to make my way in one day sept 17\nfrom Florence to Zurich ? I know most likely it will have a change in Milan .", "link": "facebook.com/groups/1373361046396315/permalink/2203296746736070/", "likes": 0, "comments": [{"username": "Colleen Dawson", "comment_text": "Trenitalia."}, {"username": "Cathy Ruggiero", "comment_text": "Perfect !! Just booked it thanks!"}]}, {"id": "2203298236735921", "text": "Hi all! We've been finding purchasing Coliseum tickets challenging direct from their website. Is Pompeii similar where you have to buy tickets in advance or have the people that have gone just gotten tickets the day of?", "link": "facebook.com/groups/1373361046396315/permalink/2203298236735921/", "likes": 2, "comments": [{"username": "Colleen Jennings", "comment_text": "Hi. I bought our Pompei tickets on the day as I prefer to do that in case plans change. We were offered a guided tour but we found at least 6 people were needed - after waiting around for half an hour we decided to go on our own. We did the furthest area 1st then worked our way back."}, {"username": "Jim Bobrowski", "comment_text": "Buy your Pompeii tickets on the way there on their website. You just walk right in past everyone. Either way lines weren't long. It was really hot. Bring water and an umbrella"}, {"username": "Leanne Sarver", "comment_text": "Tina Iftody"}]}, {"id": "2203298280069250", "text": "Excuse the lampshade in this pic, this art piece was rolled up in my suitcase, just trying to stretch it back to flat gradually…. anyway, here’s the tip! Apparently, you can be fined significantly forआणखी purchasing art that is displayed on the ground around the main Basilica in Florence! There was a seller who had a lovely display of scenes, and our tour guide was about four people away from me when I bought one of the pieces. Of course, it was rolled up and I was carrying it when about 10 minutes later, the guide casually mentions to the group, ‘be careful, don’t buy any art displayed on the ground by the artists, it’s illegal to buy it, and you can be fined a large amount of euros’!!!! I was not impressed of course, but luckily the policía did not see me carrying it….so I was not fined and now it will be framed and hung in my home….I was lucky….buyer beware! 🤞🏻🤦‍♀️🤞🏻", "link": "facebook.com/groups/1373361046396315/permalink/2203298280069250/", "likes": 12, "comments": [{"username": "Christy Norland", "comment_text": "Why would that be illegal?"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "I don’t understand why it would be illegal, unless for the fact that it could be a non registered seller (no receipt, hence no taxes), but I don’t think it would be a problem for the buyer."}, {"username": "Dixie Kotylak", "comment_text": "Dixie Kotylak"}, {"username": "Sally Warren", "comment_text": "No IVA, that’s why."}, {"username": "Maureen Rebello Hagerty", "comment_text": "Did she say why? Not sure I believe you could be fined"}, {"username": "Jenny Meffert", "comment_text": "I am surprised they are allowed to display their artwork there if it is illegal to buy it. Surely they would pay a fee to display it. However, nice painting. I am sure you will get much pleasure from it hanging in your home."}, {"username": "Voula Ladas", "comment_text": "I’m very surprised by this because this happens in a lot of tourist areas . I purchased some prints (not paintings )in New York from the roadside , and in previous trips some paintings in Positano Italy from roadside sellers . Thanks for the info."}, {"username": "Mary Nolan", "comment_text": "Seems as though it should be the vendor who is fined, not the unsuspecting buyer."}, {"username": "Starla Dawn", "comment_text": "I did and had no idea paid 10 euro and now the beautiful purple thing is in my home lol\nHad no idea"}, {"username": "Beverley Ford", "comment_text": "Lovely picture and I used to have that very same lampshade 😊"}, {"username": "Ville Lignell", "comment_text": "With the same logic the tour guides should loudly dissuade people from getting a gondola tour in Venice. The gondolieri make humongous daily income by ripping off tourists but declare only a fraction of the money to the tax authorities."}, {"username": "Donna Field", "comment_text": "This is funny because the lamp shade is the same as the one in my living room"}, {"username": "Diane Bicknell Cooper", "comment_text": "Julie Hance"}, {"username": "Karam Ullah Bajkani", "comment_text": "am forex and binary account manager and professional traderhttps ://t.me/\nFarmanfx23"}]}, {"id": "2203300090069069", "text": "We are going to fly into Palermo, Sicily on Oct 2. It will be me, my husband and our 3 teenagers. We are trying to do a few days in Sicily, a few in amalfi or sorento, then Rome. Any suggestions on must sees and reasonable places to stay?", "link": "facebook.com/groups/1373361046396315/permalink/2203300090069069/", "likes": 1, "comments": []}, {"id": "2203305186735226", "text": "Hi all! Does anybody know if the VAT return on LV is better in Italy or Paris? TIA!", "link": "facebook.com/groups/1373361046396315/permalink/2203305186735226/", "likes": 9, "comments": [{"username": "Colleen Dawson", "comment_text": "Italy is 22%, France is 20% on all VAT purchases."}, {"username": "Sandi Van", "comment_text": "Depends in Italy under 3000 purchase you get 12.5% refund and over 3000 you get 14% refund"}, {"username": "Sophia Jade", "comment_text": "F"}, {"username": "Rhi Marie", "comment_text": "Sorry to hijake -\nCan you claim VAT from discounted designer outlet stores for example the serravelle designer outlet?\n\nIs the purchase connected to your passport and will customs know about the purchase when returning to Australia? (Sorry Australian here)"}, {"username": "Karen Morgan", "comment_text": "What is VAT ? Euros is the accepted currency?"}]}, {"id": "2203246116741133", "text": "Ciao! Taking my mom to Italy in October. I'm gathering lots of amazing advice from this page. 2 things in particular id like to ask....Trastevere Food Tour recommendationand where to have a fabulous dinner in Sorrento (...for our last night in Italy) ? Grazie!", "link": "facebook.com/groups/1373361046396315/permalink/2203246116741133/", "likes": 7, "comments": [{"username": "Carol McDonald", "comment_text": "Your mom will be hooked, SOOOOO, be prepared to go back every year. Enjoy."}, {"username": "Carol McDonald", "comment_text": "O'Parrucchiano La Favorita, Sorrento, make a reservation."}, {"username": "Joanne Bianco", "comment_text": "We used AirBnB experience for Trastevere food tour. Very good"}, {"username": "Cheryl Gorfinkle", "comment_text": "Sorrento\nIL Buco"}, {"username": "Beth Cameron", "comment_text": "Definitely the good tour. We did it in May and it was one of the best things we did on our trip."}, {"username": "Nancy Brennan Carrow", "comment_text": "Tavern Allegra in Sorrento"}, {"username": "Janice Rea", "comment_text": "Golf cart tour is great"}, {"username": "Fiona Cameron", "comment_text": "Fiona Cameron"}, {"username": "Kara Bolster", "comment_text": "We used EatingEurope.co\nm and had an amazing food tour experience in Trastevere - highly recommend!"}]}, {"id": "2203245923407819", "text": "I am looking for advice Re traveling from Venice to paraglide in the Dolomites. Is it doable in one day? Any paraglide company recommendations? Thank you for any and all information you may have 😀", "link": "facebook.com/groups/1373361046396315/permalink/2203245923407819/", "likes": 1, "comments": [{"username": "Coll TC", "comment_text": "https://\nwww.fly2.info/\nen/\n?gad=1&gclid=Cjw\nKCAjwlJimBhAsEi\nwA1hrp5vH6DuakB\nyOzNlEbVDnO6zHi\nBeB1y9uzImI-ETW\nxCulpx37yifTU9B\noCb2sQAvD_BwE\n\nFly2 was great, we had an excellent paraglide experience!"}, {"username": "Etschi Bruckner", "comment_text": "it´s doable - if you fancy spending approximately 6 - 7 hours in the car 😕😕"}]}, {"id": "2203268860072192", "text": "Is anyone in Cuneo at the moment and enjoying the Illuminata?", "link": "facebook.com/groups/1373361046396315/permalink/2203268860072192/", "likes": 2, "comments": [{"username": "Vinayini Murty", "comment_text": "Where is Cuneo?"}]}, {"id": "2203251866740558", "text": "Recommendations for pick up at port and half day tour of Rome. Thanks for any suggestions or referrals.", "link": "facebook.com/groups/1373361046396315/permalink/2203251866740558/", "likes": 1, "comments": [{"username": "Christine Sanci-Gentile", "comment_text": "Mybesttour.com\n\nGolf cart tour. Awesome!"}, {"username": "Colleen Dawson", "comment_text": "Although the cruise line options can be more expensive, I would choose to go with them. It’s an hour’s drive to and from the port to Rome. Just remember the ship will not wait if you are late getting back on your own."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2203247413407670", "text": "Rick Steves Italy travel book was recommended but unfortunately there is no information on the Puglia or Campiana regions.\nAny advice?\nthank you!", "link": "facebook.com/groups/1373361046396315/permalink/2203247413407670/", "likes": 0, "comments": [{"username": "Oldriska Balouskova", "comment_text": "Get the Rough Guide to Italy instead - it covers those regions"}, {"username": "Miyuki Kanno Paul", "comment_text": "His book only covers the most popular places. He does cover Campania region, however, only Napoli, Capri, Herculaneum, Pompeii, Sorrento, and some of the most visited Amalfi coast towns. I use Michelin Green Guidebook for driving and DK books for more visual references"}]}, {"id": "2203242443408167", "text": "Need advice.... our train was and hour and a half late and then broke down today from Florence to Rome. We got in 8 hours late and missed our golf cart tour through Viator. We were told we can't get a refund because it was less than 24 hours. Any thoughts?", "link": "facebook.com/groups/1373361046396315/permalink/2203242443408167/", "likes": 5, "comments": [{"username": "Lisa Roth", "comment_text": "Travel insurance claim."}, {"username": "Alessandro Iannelli", "comment_text": "Oh, the train in the news. You have the right to be reimbursed by Trenitalia for the train ticket, but If I'm not mistaken only for half of its price (at least that's what they usually reimburse when the train arrives over 2 hours late). I don't know about the cart tour."}, {"username": "Lauren Swanteck Myler", "comment_text": "Things happen. Let it go. If Viator had to reimburse for every issue that came up? Sorry, don’t mean to sound harsh. That’s what I would do. Not worth the stress and aggravation. Use the possible reimbursement from the train company (25%?) to cover some of the cost."}, {"username": "Jessica Chiu", "comment_text": "Try your credit card company, a good travel card will cover some if not all of the impacted expenses."}, {"username": "Deborah Coram", "comment_text": "I would revert to your travel insurance and claim the value of what you lost as a result of the breakdown in that."}, {"username": "Luisa Ravenna", "comment_text": "You can get a refund of 50% of the train ticket price"}, {"username": "Dixie Kotylak", "comment_text": "Melinda Kempkens thank God it wasn’t us!"}, {"username": "Molly Roberts Siegenthaler", "comment_text": "File with your travel insurance. If you did not get travel insurance, I’m afraid you are out of luck. This is no fault of the tour operator."}, {"username": "Tracy Foss", "comment_text": "Maybe try directly dealing with the tour company doing the tour see if they can reschedule something for you and be really nice & appreciative of what they can do for you"}, {"username": "Yvette Pavone", "comment_text": "They Couldn’t reschedule people because you didn’t cancel. They can’t lose money because of your not showing up"}, {"username": "Madeline Caporale", "comment_text": "Do you have travel insurance? If so, check if that will cover any of the costs."}, {"username": "Debbie DiOssi", "comment_text": "When you book with them it tells you the cancellation policy. They all require 24 hours or more to cancel and be refunded. It’s unfortunate, but they can’t give refunds for tours they have no time to resell."}, {"username": "Meridith Davies", "comment_text": "It’s not viators problem that you didn’t make it. Unfortunate, but they shouldn’t miss out because you couldn’t get there"}, {"username": "Jeidy Christina Duarte", "comment_text": "For Trenitalia they can reimburse you the percentage based on the minutes of delay, unfortunately i don't believe in money but they will put a voucher in your account to use on your next trip with Trenitalia. I'm Italian and i hope the situation has changed, but i don't think so."}, {"username": "Jono Roland", "comment_text": "Claim it on travel insurance?"}, {"username": "Phyllis Snyder", "comment_text": "Unfortunately you probably need to just move on and let it go- chuck it up to travel obstacle."}, {"username": "Phyllis Snyder", "comment_text": "Just a word of caution when traveling- & booking a tour - especially an expensive one- on the first day or night of arriving isn’t advisable."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Travel insurance?"}, {"username": "Carol Shrieve", "comment_text": "File a dispute on your cc. Good chance you’ll get it reversed."}, {"username": "Renee Rundle Stoneham", "comment_text": "Travel insurance claim.\nThis is not the vendors fault.\nYou can try to see if they will reschedule for you."}, {"username": "Melissa Hunt", "comment_text": "It’s a risk you take when booking the tour on the day you arrive. I worried about train delays when deciding whether to book our golf cart tour on our travel day but decided it was low risk (not no risk) so we’re taking our chances. 🤞"}, {"username": "Jane Skeffington", "comment_text": "Viator is the worst for refunds. Don’t hold your breath."}, {"username": "Delphinia Salamin", "comment_text": "Nothing you can do about the missed tour. If you have travel insurance maybe you can recoup the money"}, {"username": "Courtney Soloff England", "comment_text": "Really sorry that happened!\n\nWe got off in the wrong station in Rome (didn’t know there were two) yesterday and therefore missed our private driver. Big bummer but it is what it is. Improvised and figured it out.\n\nI’m going to try my credit card company when I get back home 🙂\n\nPS I love Italy so much I could cry"}]}, {"id": "2203232776742467", "text": "Visiting Lake Como in April. Staying 4 nights in varenna and 4 in vasenna. Any tips welcome and please let me know if I should be concerned about ferry's etc in April (as in pre booking). Its for my 40th so want to make it special 😀", "link": "facebook.com/groups/1373361046396315/permalink/2203232776742467/", "likes": 0, "comments": []}, {"id": "2203243853408026", "text": "Does anyone have a recommendation for travel insurance?\nI have searched for a few days and I am looking for a travel insurance that I can buy that is customizable for our needs. I don’t want to pay for coverage I don’t need. Recommendations appreciated. Thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2203243853408026/", "likes": 1, "comments": [{"username": "Diane Plott Miller", "comment_text": "Polly at Trip Consultants was a big help. 1-800-576-2674.\nThey were referred by AMAC"}, {"username": "Jeanne Tarcha", "comment_text": "I have never used them but the tripinsurancest\nore.com has a lot of great information! I am contemplating purchasing a policy."}, {"username": "Stephanie Smith", "comment_text": "Add annual trip insurance coverage to your home owners policy"}, {"username": "Allison Mir", "comment_text": "Depends where you are travelling from"}, {"username": "Michelle Parks", "comment_text": "I just purchased trip insurance today through Travelex"}, {"username": "Myra Young Miller", "comment_text": "Allianz is who I usually use. They helped my clients during a difficult situation!"}, {"username": "Gina Rovello Keenan", "comment_text": "Allianz"}, {"username": "Karen Hudson Dance", "comment_text": "Our cheapest quote was from Nationwide."}, {"username": "Carol Fahy", "comment_text": "Allianz"}, {"username": "Dave Conroy", "comment_text": "Search for an insurance comparison site covering your country. If you have pre existing conditions health you need to think about that to."}, {"username": "Sherry Davis Wainz", "comment_text": "Allianz"}, {"username": "Annette Mayer", "comment_text": "Allianz"}, {"username": "Linda Chase", "comment_text": "You can compare policies and coverage on Squaremouth.com and check reviews from people who have actually filed claims."}]}, {"id": "2203140330085045", "text": "Hello. Question - for those who drove to lake Como. We are staying 30 mins away. We want to drive in and park somewhere - I was thinking driving directly to Bellagio or Varenna, instead of parking in Como town and then taking a boat up to Bellagio. Thoughts? Where is it easier to park? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2203140330085045/", "likes": 0, "comments": [{"username": "Alice Francesca", "comment_text": "This is what Lake Como looks like these days..."}, {"username": "Pam Gerretsen", "comment_text": "We went to Lenno Saturday before last, it was amazing! We found free parking in a side street (look for spaces with white lines, blue lines = pay!). It wasn't packed at all - yes there were tourists, but nothing hideous! We went to Villa Balbianello, had a late lunch by the lake, and a swim, it was fabulous. I'm guessing that Como town itself is crazy, but not everywhere is."}, {"username": "Paula Isaac", "comment_text": "We easily used a multi story car park in varenna 1st wk of july, may be busier now but if your only 30 mins away, I d plan to go early ."}, {"username": "Stefano Bressanelli", "comment_text": "Good luck....."}, {"username": "Glenn Todd Webb", "comment_text": "May/June we rented a car in Milan and drove to Como for a week. We drove to Bellagio around eastern part of lake. We drove up western part to Menaggio to Lugano, Switzerland and another day drive to Stressa on Lake Maggiore. There is a car park in Como but we also parked inside the walls at our hotel."}, {"username": "Trevor Brown", "comment_text": "Forget the car and catch the train"}]}, {"id": "2203239266741818", "text": "Hello everyone,\nMe and my girlfriend will travel in Italy at the end of August and we’re looking for a photographer to have a couple photoshoot (about 2 hours) at Lago di Braises. Our budget is under 600e. Ourआणखी expected date is around 27-29 August. Can you suggest any photographers that may be available on that day and thay location?\nThank you so much.", "link": "facebook.com/groups/1373361046396315/permalink/2203239266741818/", "likes": 0, "comments": [{"username": "Lisa Lutman Whiteneck", "comment_text": "If you don’t find one here, try flytographer.co\nm"}, {"username": "Julia Donovan", "comment_text": "Hi, have you already found a photographer?"}]}, {"id": "2203243626741382", "text": "Seeking a recommendation for trip insurance. I've done an on-line search of the various companies, but I'm curious to learn what people use. TY", "link": "facebook.com/groups/1373361046396315/permalink/2203243626741382/", "likes": 1, "comments": []}, {"id": "2203246943407717", "text": "Will be in Tremezzo (Lake Como)and was looking for recommendations for transfer service to and from Milan Malpensa airport.", "link": "facebook.com/groups/1373361046396315/permalink/2203246943407717/", "likes": 1, "comments": [{"username": "Cindy Haskins Kublin", "comment_text": "Martino Palmisano"}, {"username": "Victoria Laverty", "comment_text": "http://\nwww.lakecomotran\nsfers.com/\n\nReliable\nGreat service\nWell priced"}, {"username": "Bonnie Brauner", "comment_text": "I will be going to Tremezzo I’m October. I have booked Villa Lina, they quoted me 150€.\nWhere will you be staying?"}, {"username": "Eliza Russo", "comment_text": "Hotel Bazzoni"}, {"username": "Bonnie Brauner", "comment_text": "http://\nwww.lakecomotran\nsfers.com/\n\nReliable\nGreat service\nWell priced"}]}, {"id": "2203254166740328", "text": "Is lake como worth visiting?", "link": "facebook.com/groups/1373361046396315/permalink/2203254166740328/", "likes": 49, "comments": [{"username": "Debi Genovese Herrera", "comment_text": "Yes! Yes! Yes!"}, {"username": "John Bruckman", "comment_text": "Beautiful but snooty…"}, {"username": "Jo Tripp", "comment_text": "Absolutely yes. Take the boat to bellagio from como and have lunch at the restaurant la punta in bellagio. It won't disappoint and you will have spectacular views of the lake. Its worth noting la punta is only open until late Sept and is not a budget restaurant. Enjoy"}, {"username": "Sylvia Schultz", "comment_text": "It’s fantastic!"}, {"username": "Ana Ka", "comment_text": "yes, its stunning, we also like Orta, its nearby and is a little more private."}, {"username": "Rose Man", "comment_text": "Is pizza worth eating?"}, {"username": "Sheral Gillman Rowe", "comment_text": "Most definitely!"}, {"username": "Mary Agnes Parisi Citro", "comment_text": "Most definitely."}, {"username": "Doris Sanjuan", "comment_text": "Oui tout à fait"}, {"username": "Natalie Demie", "comment_text": "Yes, just try to go there as early as possible, because boat tours only in the early afternoon"}, {"username": "Rene Sosa", "comment_text": "For us, absolutely. The ferry alone into Bellagio gorgeous. I left wondering why I didn’t book Lake Como instead of Milan. Looking forward to focusing more on that region next time."}, {"username": "Nancy Tyrrell Robson", "comment_text": "We stayed at Stresa(Lago Maggiore) and Lake Garda but took a day trip on Lake Como and Bellagio. Loved it all!"}, {"username": "Kary LeBlanc", "comment_text": "Omg yes"}, {"username": "Brenda V. Harris", "comment_text": "Yes!!!"}, {"username": "Trevor Brown", "comment_text": "If you have access to a vessel."}, {"username": "Madhavi Raju", "comment_text": "Toooo worth visiting 😀 I visited recently & I want to go there again."}, {"username": "Ernesina Scala", "comment_text": "Absolutely!!!"}, {"username": "Claudine Grech Fleri-Soler", "comment_text": "It's a beautiful place.Go for it !"}, {"username": "Sharyn Wright", "comment_text": "Yes. Bellagio best place to stay"}, {"username": "Tracy Parkerson", "comment_text": "Yes yes yes!!! We are here now! Amazing!"}, {"username": "Rino Maffeo", "comment_text": "No it’s a dump .. that’s why everyone raves about it..🤣😂🤣😂"}, {"username": "Diane Bingham", "comment_text": "Most definitely! One of my most favourite places."}, {"username": "Karen Cole", "comment_text": "Absolutely!!!!"}, {"username": "Phyllis Ayotte", "comment_text": "Absolutely"}, {"username": "Véronique Piercey", "comment_text": "Abso-friken-lut\nely. Just got back from there for my second trip there and can't wait to return. I mean, the views alone."}, {"username": "Suzanne Mills", "comment_text": "No. Go to Garda!"}, {"username": "Roula Lolak", "comment_text": "Everything in Italia is worth visiting, EVERYTHING"}, {"username": "Linda Shepherd", "comment_text": "Yes it’s awesome"}, {"username": "Joyce Gordon", "comment_text": "Yes and stay in Varenna and just go to Bellagio to visit.\nVarenna is quieter and beautiful!"}, {"username": "Lesley Richardson", "comment_text": "Lesley Richardson"}, {"username": "Panchalee Cole", "comment_text": "Definitely! Been there twice and actually prefer it over Venice."}, {"username": "Krissi McVay", "comment_text": "Yep!"}, {"username": "Pieter Strydom", "comment_text": "You will die if you not going😳😂😂😂"}, {"username": "Berndt Weihs", "comment_text": "Yes,lake Come,Lago di Maggiore and Garda lake with Verona."}, {"username": "Pui Quing", "comment_text": "dpends on which month you going? 🤷🏻‍♀️"}, {"username": "DerricknCatherine Fejarang", "comment_text": "YES, Of Course! I still dream about the time we were in Lake Como only to wake up to reality. It’s one of my top 3 places I’ve visited in Italy."}, {"username": "Pauline Fenech", "comment_text": "Yes definitely"}, {"username": "Irene Prountzou", "comment_text": "Yes 💯"}, {"username": "Lisa Akira", "comment_text": "Yes!!!! Just ride the ferry rather than the bus!"}, {"username": "Lynn Macri", "comment_text": "100% the most stunning place and so different to the rest of Italy! Day trips to Switzerland from there as well! Not in Como town ! On the Lake !"}, {"username": "Oz Mazzetti", "comment_text": "Is the pope catholic ?"}, {"username": "Mariella Elsano", "comment_text": "Sure,Bellagio and menaggio!"}, {"username": "Anna Biscotto", "comment_text": "Is the Pope Catholic"}, {"username": "Nadia Safwan Shreitah", "comment_text": "💯"}, {"username": "Eric Coetzee", "comment_text": "Yesyes much better than the Amalfi coast"}, {"username": "Sheldon Thomas", "comment_text": "Ryan Roberts look at the comments xx"}, {"username": "Janice Styler", "comment_text": "Is it more beautiful than Lake Garda 🤔"}, {"username": "Joannie Beiswenger", "comment_text": "Yes❤️"}, {"username": "Dimitris Kots", "comment_text": "ABSOLUTELY 😁"}, {"username": "Staci Tucker", "comment_text": "Definitely yes"}, {"username": "Stjepan Kujadin", "comment_text": "Not now, but yes usually yes"}, {"username": "Imperia Arcidiacono", "comment_text": "Imperia Arcidiacono"}, {"username": "Alejandro Gabriel Valenzuela Anghileri", "comment_text": "Absolutely, but maybe I am a little biased: I grew up there 😅"}, {"username": "Isabelle Avl", "comment_text": "Seriously ??\n#cuttingmywrist\nsopen"}, {"username": "Sandra Dyer Williams", "comment_text": "Absolutely, it’s stunning 🇮🇹 ♥️"}, {"username": "Sandra Dyer Williams", "comment_text": "The view from our hotel. Lake Como is stunning 🇮🇹♥️"}, {"username": "Angela Ferrari-Kirk", "comment_text": "YES!!"}, {"username": "Donna Mangone", "comment_text": "Definitely yes!"}, {"username": "Donna Mangone", "comment_text": "I have been there twice. In 2007 and 2022."}, {"username": "Donna Mangone", "comment_text": "G"}, {"username": "Kerry McMillen", "comment_text": "Uuuuh.\nMadonna\nGeorge clunny\nWe did like it. Nothing like where we’re from\nQuiet spot.\nThe locals are super\nIf you want fancy cars I saw a Audi A1!"}, {"username": "Darren Bonaccorso", "comment_text": "Carla Jane"}, {"username": "Elsa Galligani", "comment_text": "Omg yes! Just beautiful!!"}, {"username": "Dalia Abrahami", "comment_text": "Sure !!!"}, {"username": "Kathy Holden Reams", "comment_text": "Abby Reams. Can you pipe in"}, {"username": "Nicole Dundas", "comment_text": "Yes, yes, yes!!"}, {"username": "Roland Trego", "comment_text": "Absolutely. A relaxing and chic destination."}, {"username": "Jenny Merrell Hof-Hadwin", "comment_text": "It was nice. But I enjoyed Lake Garda and Lugano more."}, {"username": "Emily Juergens Colson", "comment_text": "Emily Juergens Colson"}, {"username": "Melina Cribari Merrill", "comment_text": "Yes!!!!"}, {"username": "Maria LoSurdo", "comment_text": "Definitely! Bellagio is gorgeous to stay! 🇮🇹❤️"}, {"username": "Kim Tremain", "comment_text": "Absolutely!"}, {"username": "Stella Waite", "comment_text": "Most definitely!"}, {"username": "Debbie Alves", "comment_text": "Thats a BIG YES"}, {"username": "Revien Zaki", "comment_text": "Yes"}, {"username": "Quentin Moore", "comment_text": "Absolutely yes!!"}, {"username": "Glenn Todd Webb", "comment_text": "Yes. Villa Balbianello, Villa Carlotta, Villa Melzi are some best places in Italy. Next door at lake Maggiore off Stressa is palazzo Borromeo and palazzo Madre. Don’t want to miss any."}, {"username": "Phyllis Snyder", "comment_text": "Like fine wine!"}, {"username": "Letha Logan-Dardani", "comment_text": "YES!!"}, {"username": "Frank Hunt", "comment_text": "Yes, for sure, if you have the time, in area or want something to do that’s really worthwhile before you die etc.."}, {"username": "Lori Moratto", "comment_text": "OMG! Absolutely!"}, {"username": "Yvette Jasmine Lopez", "comment_text": "Yes"}, {"username": "Serena Mascheretti", "comment_text": "From an Italian....ther\ne is better things in my opinion but it is still a nice view."}, {"username": "Matthew Gramitt", "comment_text": "It’s overrun with tourists right now.\n\nThere’s many different places on Lake Como. I’ve been to a few of them. Can’t say the places I’ve been to are more worth visiting than other places in Italy I’ve visited.\n\nPersonally, there’s some other towns on other lakes in Italy that I liked more than the places I visited on Lake Como. Not gonna say what they are as I don’t want as many people visiting them as have been visiting Lake Come lately!"}, {"username": "Matthew Gramitt", "comment_text": "Someone posted this the other day on this page:\n\n“I am posting this text taken from yesterday's Italian newspaper \"La Stampa\" to confirm that this group is very useful and much needed for any overseas tourist. Please beware influencers on social media and always get informed and plan your trip before flying to Italy, it's your money and time, don't get them to waste! ❤️\n\nThe text on the image says:\n#LakeComo is drowning in tourists. The lake overwhelmed by the reviews of influencers on the trail of Clooney and Ferragnez. Restaurants are full and the transports are haywire.\n\nHere the article (the intro, there is more on this topic on the newspaper)\n\n\"Two Colombian tourists stroll bored in Piazza San Fedele, among the medieval houses and the Romanesque basilica of the historic center of Como. Their guide, at the umpteenth sign of disinterest, tries to get to the bottom of the matter. “They kept huffing and I asked what they expected to see – says Alessandra Fasola of the Mondo Turistico association -. They thought they had booked a tour to a place called #LakeComo, written precisely with the hashtag incorporated, and they showed me the Instagram profile of a South American influencer who had taken photos in various parts of the lake, without however specifying that they were places distant from each other. It happens more and more often now: many arrive attracted by social media, without information, with unrealistic expectations and confused ideas about what they really want to do. Someone asks to go around the lake on foot, it's 160 km, it's impossible! They show up confused, they leave disappointed: managing them and offering them a quality experience is becoming difficult».\n\nFrancesco Moscatelli from La Stampa\""}, {"username": "Michele Baron Vold", "comment_text": "Absolutely but only in summer."}, {"username": "Bobbie Lane Hausherr", "comment_text": "Definitely!"}, {"username": "Michelle Lenhart-Freebairn", "comment_text": "Michelle Lenhart-Freebairn"}, {"username": "Sandra Maldonado", "comment_text": "Absolutely. It’s gorgeous."}, {"username": "Katie White-Meade", "comment_text": "Just as the air you breathe."}, {"username": "Noeleen Cahill", "comment_text": "Amazing"}, {"username": "Hanya Galal", "comment_text": "Definitely"}, {"username": "Rip Lonergan", "comment_text": "Como and Garda we’re highlights of our 16 week trip through Italy. If you have the time, absolutely go."}, {"username": "David Burton", "comment_text": "Worth visiting?! The place is stunning. The scenery is breathtaking."}, {"username": "Christine Pasieniuk Davis", "comment_text": "Absolutely"}, {"username": "Virgz Van Møøre", "comment_text": "Nath Marmotte festival ce soir, après Venise, Côme 😂"}, {"username": "Oswelys Meneses Bermúdez", "comment_text": "It is amazing !"}, {"username": "Paul G Black", "comment_text": "Lucerne switched is next door"}, {"username": "Leanne Rynne", "comment_text": "It should be on everyones bucket list , its breathtaking 😍"}, {"username": "Ghada Chalghoumi", "comment_text": "U must be joking"}, {"username": "Lisa Verlinger Guarino", "comment_text": "What about in December? Still pretty?"}, {"username": "Crystal Edgell White", "comment_text": "Uh yessss!!"}, {"username": "PattiAnn Mazzella", "comment_text": "Yesssss"}, {"username": "Victor Viquez Arias", "comment_text": "Pao Mora"}, {"username": "Wendy Harrison", "comment_text": "It's beautiful. But I saw it more than 50 years ago, in the spring."}, {"username": "Beata Zabek", "comment_text": "Yes, yes,yes, recomendind to stay in Varenna"}, {"username": "Deborah Lancaster", "comment_text": "Veranna and Belagio are beautiful!"}, {"username": "Kimberly Bos", "comment_text": "Lake Iseo! Same landscape and inexpensive place to visit for dining out etc."}, {"username": "Betsy Sidman", "comment_text": "We stayed in Varenna at Hotel Du Lac and it was a fantastic location. Easy access to ferries etc. and less crowdedthan Bellagio. We went in June. Ferried to all the Villages."}, {"username": "Kathleen Kinsella", "comment_text": "Absolutely - if you like mountains and lakes you’ll be in heaven"}, {"username": "Michelle Atkinson Kelsey", "comment_text": "1000%"}, {"username": "Jeff Gentner EA", "comment_text": "Don't miss Varenna. We could have stayed there forever!"}, {"username": "Mzia Watson", "comment_text": "Absolutely!"}, {"username": "George Kano", "comment_text": "The most beautiful spot on the earth!!"}, {"username": "Delana LaHue", "comment_text": "Is life worth living ?"}, {"username": "Sharon Milligan Martin", "comment_text": "Yes"}, {"username": "Ryan Snyder", "comment_text": "I prefer Lake Garda over Cuomo"}, {"username": "Sandy Avayou", "comment_text": "It’s gorgeous"}, {"username": "Gianna Onesi", "comment_text": "It's on my bucket list!"}, {"username": "Maria Azevedo", "comment_text": "Oh yah"}]}, {"id": "2203257266740018", "text": "Almost 20 years ago my husband and I had an amazing lunch and dinner in Capri while on a tour. We would love to go back to these restaurants but we do not recall the names of either. If anyone can identify the restaurants or suggest similar ones I would appreciate it.\n\nLunch - The restaurant was at the top of the mountain on the island. Myआणखी husband felt as if it was ”carved into the mountain” and had an amazing view. I thought there may have been some vines/greenery overhead, but my memory is a bit fuzzy.\n\nDinner - The restaurant was on the water and they served amazing seafood. I also recall they served delicious oval shaped pizza as an appetizer.\n\nPlease let me know if anyone has suggestions for resturants at the top of the mountain and/or on the water. Bonus if the restaurant offer gluten free options.\n\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2203257266740018/", "likes": 0, "comments": []}, {"id": "2203260870072991", "text": "I have just had the most amazing four hour private boat hire along the Amalfi coast. We were picked up in Amalfi and dropped off in Maiori. My parents are in their early 80’s and they were concerned about waitआणखी times etc in the heat for the public tours. We had the boat to ourselves and spent the four hours going up and down the coast, stopping for swims, into the different caves, no queuing, and just the three of us on the boat with two crew. It wasnt cheap at about EUR800, but totally worth it. If you want to stop in any of the towns you could but we chose not to. Highly recommend LABELLAVITA, fantastic day. Have included their details in the photos", "link": "facebook.com/groups/1373361046396315/permalink/2203260870072991/", "likes": 29, "comments": [{"username": "Katie White-Meade", "comment_text": "How wonderful for you all. Especially for your parents being elderly and apprehensive."}]}, {"id": "2203266080072470", "text": "We’re trying to book a tour of the vatican museums though Getyourguide. The price listed at $44.02 US but when I check out for 3 people the total is $262.41. The price breakdown is 3 x $87.47. The cost doesn’t reflect the posted price. Are the taxes and fees that much?", "link": "facebook.com/groups/1373361046396315/permalink/2203266080072470/", "likes": 0, "comments": [{"username": "Jennifer Walp Rydholm", "comment_text": "From what I can see they post the lowest price it can be, maybe at another time of year. That has seemed to never be the price once dates are put in."}, {"username": "Katarzyna Marczewska", "comment_text": "Why don’t you try official site ? Skip the line tickets will be like 20/25 euro"}]}, {"id": "2203266370072441", "text": "Looking for public beaches near the Tuscany region with parking. Please send your experiences…", "link": "facebook.com/groups/1373361046396315/permalink/2203266370072441/", "likes": 0, "comments": [{"username": "Agnese Arnó Ch-Ch", "comment_text": "What do you mean near the Tuscany region? In the north, in the south?"}, {"username": "Sandy Farnum Quigley", "comment_text": "Cavoli beach 57034 Campo nell'Elba LI, Italy"}]}, {"id": "2203266963405715", "text": "In Sarteano right now, looking for a good wine tasting at a vineyard", "link": "facebook.com/groups/1373361046396315/permalink/2203266963405715/", "likes": 0, "comments": [{"username": "Stefano Follador", "comment_text": "A little late, but it still counts.\n\nIl Molinaccio in Montepulciano\nTerra Quercus in Sarteano\nTerra d’Arcoiris in Chianciano"}]}, {"id": "2203169420082136", "text": "How far in advance do you all book flights and hotels/airbnbs? Planning a trip for June if that makes a difference", "link": "facebook.com/groups/1373361046396315/permalink/2203169420082136/", "likes": 2, "comments": [{"username": "Sonita Sandhu", "comment_text": "Some people book way in advance. I went last summer and booked 2 months before as I was planning my trip around a Croatia cruise. And I use points for international flights. Had no issues finding places to stay. 6 months is more than enough time."}, {"username": "Bill Casper", "comment_text": "6-12 months before"}, {"username": "Diane Davis Lawyer", "comment_text": "I booked our September trip in March, and all of our AirBnB stays by the end of March. HOWEVER, I will say that I regret booking some of them so early because as I learned more about Italy and each of the cities we will be visiting, I changed my mind about where I wanted to stay. I even changed the number of days we would be staying in one city or another. That meant I had to change all of those AirBnB reservations as well--I actually changed them many times over the months as I changed my mind about different aspects of our trip. I suggest learning as much as you can about each city, have a very firm itinerary, and gain good idea of where you want to stay in each city before booking your hotel or an AirBnB. Your rooms will be less expensive the further out you book, but that's the only real advantage (oh, you may have more of a selection if you book further out.)"}, {"username": "Dafne Vassetti", "comment_text": "June is high season and third week of June is peak. Make reservations 10 months ahead of time."}, {"username": "Sandy Radican Shikaly", "comment_text": "6-9 months"}, {"username": "Angela Casanave", "comment_text": "Just booked a Villa today for Thanksgiving week."}]}, {"id": "2202484273483984", "text": "Hello\nJust learned my 9 day cruise was cancelled. Looking at a shorter one that starts and ends in Ravenna Italy. We are considering taking the other 7 nights and either heading up to Tuscany or South to Sicily. The cruise is next October and we have already visited Rome, Sorrento, Positano, Capri, Naples and Florence several times.\nI am looking for options and would love your thoughts.\nTuscany or Sicily? Which and why???\nThank you!!!!", "link": "facebook.com/groups/1373361046396315/permalink/2202484273483984/", "likes": 2, "comments": [{"username": "Billie Begley", "comment_text": "What cruise line and ship was this."}, {"username": "David Igger", "comment_text": "Don’t take a cruise. They are exploitative, environmentally\ndisastrous, damaging to the places they go to - disgorging people like locusts.\nItalians hate them and anyone who uses them. Do yourself a favour and travel by train, stay in some nicer hotels with the money you saved, immerse yourself in the places you go to more easily. You will have a more interesting experience with more connections to places you go to. Added bonus, your tourist dollars might actually end up helping someone in the places you visit, rather than helping a massive company further destroy the towns and environments they exploit."}, {"username": "Alicia Cox", "comment_text": "Not sure about a cruise in & out of Venice because they are supposedly not allowing cruise ships there, so check it out carefully. Never been to Sicily, but I LOVE Tuscany as the small towns are so quaint & picturesque & not as hectic. And the food is incredible!"}, {"username": "Sonita Sandhu", "comment_text": "Can you book another cruise if that’s something you really wanted? Maybe try Sicily this time as it will be new for you."}, {"username": "Jill Tingley", "comment_text": "Sicily is so great. Taormina one of my favorite cites in Sicily and all of italy"}, {"username": "Nina Ceh", "comment_text": "Tuscany: Pisa, Lucca, San Gimignano and Sienna"}]}, {"id": "2203074193424992", "text": "We are traveling to Italy next summer. Looking at train options with medium size luggage and backpack. We will be taking the trains from Venice St. Lucia to Florence and the Florence to Rome - and maybe Rome to Naples (debating private transport to Sorrento verses train to Naples and then Sorrento).\n\nI see there are a lot of different trainआणखी companies (italiarail and trenitalia specifically on those routes). I also heard some of the classes have more space for your luggage. Based on those routes, which company would you recommend and what class of service? We are three people (2 adults and 18 year old).\n\nThank you!!!", "link": "facebook.com/groups/1373361046396315/permalink/2203074193424992/", "likes": 2, "comments": [{"username": "Claire Dowson", "comment_text": "Download the Trainline app. Has a times and prices and option to buy of all services."}, {"username": "Jamie Bly", "comment_text": "I would go from Florence to Naples and Naples to Rome. May be more efficient if you plan to go to Naples."}, {"username": "Bea Kuckens", "comment_text": "The biggest difference is whether it is high speed or not. As far as luggage, all coaches have space at the end for larger pieces and overhead racks above the seats. Business class is a bit more spacious with larger, more comfortable seats and sometimes room enough to keep a bag with you at your seat. If the upgrade is reasonable it's a nice way to go for the longer routes, but I wouldn't do it just because of luggage. My husband and I travel with two carry-on sized rollaboards, two totes and a CPAP and have always managed in any class coach. If going standard, just try to be among the first to board your coach while there is still luggage space available. On one where we weren't early enough I ended up with my feet on one of the totes (I'm short) and my CPAP in my lap."}, {"username": "Sonita Sandhu", "comment_text": "Might be worth checking private transfer to Sorrento since there are 3 of you. The train was easy but you want to make sure you do the tourist express train. I did the regular local one as that was the only one avail for my time and it had lots of stops and no ac. I didn’t mind as I was on my own."}, {"username": "Rachael Richardson", "comment_text": "Just use any italo or trenitalia , the trains are far more reliable and superior to Uk! The main journeys you book the local ones you just turn up , Naples to sorrento is easy"}, {"username": "Bev Madill", "comment_text": "The two train companies are Trenitalia and Italo, although Italo (private company) aren't as big a network as Trenitalia. Easy to book via their websites. I've only ever used 2nd class it's been fine."}, {"username": "Maureen McCartan Harris", "comment_text": "I'm confused where you would get the private transfer to sorrento? And you mentioned you could do pompeii on the way without your luggage?"}]}, {"id": "2203138913418520", "text": "Want to rent a 10 seater van at the Rome airport. Any suggestions?", "link": "facebook.com/groups/1373361046396315/permalink/2203138913418520/", "likes": 0, "comments": []}, {"id": "2203141700084908", "text": "Early morning at St Marks\nVenice\nItaly 🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2203141700084908/", "likes": 2, "comments": []}, {"id": "2203141883418223", "text": "We are hoping to return to Italy next year. Flights are currently very expensive… Any one have tips on getting great deals on multiple cities? We are flying out of SFO to Zurich Switzerland , to start in Zurich and return will fly out of Rome back to SFO (SF). We would love to do the Bernina Express train down to Milan, then go back to Lake Como, go to Tuscany for the first time, back to Florence, back to Amalfi and maybe down the boot , back to Sicily and back to Rome before flying home.", "link": "facebook.com/groups/1373361046396315/permalink/2203141883418223/", "likes": 0, "comments": [{"username": "Bill Casper", "comment_text": "Look on SKYSCANNER."}, {"username": "Marie Payne", "comment_text": "You have a ton of places you want to go .. hope you are going for a couple of months!! I too fly out of sfo .. there will be cheaper fares soon.. better to figure out exactly where you want to go.. check google flights"}, {"username": "Carmine Castiglia Jr", "comment_text": "Check out http://\ntripmasters.com/\n\nThey can usually put together some great deals on build-your-own flight/hotel combos."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2203144073418004", "text": "We are looking for a good place to stay in Firenze close the santa Maria novella terminal. What is your best adresse? +\\-150 euro per night thank you", "link": "facebook.com/groups/1373361046396315/permalink/2203144073418004/", "likes": 1, "comments": []}, {"id": "2203144950084583", "text": "We are taking a cruise and one of the stops is Naples. What is the best way to get to Sorento and back from Naples port?", "link": "facebook.com/groups/1373361046396315/permalink/2203144950084583/", "likes": 1, "comments": [{"username": "Jill Tingley", "comment_text": "Tour or taxi or rent car."}, {"username": "Corina Cristea", "comment_text": "You could go by ferry ( 50 min) from Beverello harbour"}, {"username": "Miyuki Kanno Paul", "comment_text": "Ferry from Molobeverello"}, {"username": "Frank Hunt", "comment_text": "Ferry"}]}, {"id": "2203145363417875", "text": "I need a travel tip. Going to Italy in two months; since my passport foto was taken I have grown a mustache. Should I shave it off? My gut tells me yes; will I be hassled if I don’t?", "link": "facebook.com/groups/1373361046396315/permalink/2203145363417875/", "likes": 0, "comments": [{"username": "Libertie Oknames", "comment_text": "You will be fine"}, {"username": "Kristina Ruk", "comment_text": "No need"}, {"username": "Marion Robinson", "comment_text": "On my passport photo I have long blonde straight hair, thanks to Chemo last year I now have dark shirt curly hair, I was worried but been to menorca and Italy this year with no problem"}, {"username": "Evie Gee", "comment_text": "Passports are good for ten years - who looks the same for ten years?"}, {"username": "Bea Kuckens", "comment_text": "They've looked at enough faces and photos to know if it's you or not..."}, {"username": "Mary White", "comment_text": "Passport has short hair, now waist length, no problems"}, {"username": "Jeannie Morris Wierman", "comment_text": "No, they have facial recognition now."}, {"username": "Amie M. Rossetti", "comment_text": "People cut and color their hair all the time, gain or lose weight. Age. I would think a non issue"}, {"username": "Gillian O'Callaghan", "comment_text": "The facial recognition camera will still register you as you 👍"}, {"username": "Carolyn Ross", "comment_text": "shave it"}, {"username": "Candace Linda Solomon Cross", "comment_text": "Nope"}, {"username": "Jay Parekh", "comment_text": "Save the stach"}, {"username": "Yvonne Ormson", "comment_text": "Absolutely no problem. We change a lot in 10 years and it’s all about facial recognition 🙂"}, {"username": "Maria Brozou", "comment_text": "certainly not. In my ID I am a brunette and now I am blond. No problem at all anywhere."}, {"username": "Dave Kushner", "comment_text": "Thank you all for your insights and comments! Grazie mille!"}, {"username": "Emily Richardson", "comment_text": "I traveled to Italy this summer and on our way home a TSA agent really held up the line evaluating the look of a grandmother. She made her take off her glasses, stand directly in front of her, and wait for her to decide she was ok. Only time we encountered this and I was surprised. Of course it seemed like forever because we were running to make our flight."}, {"username": "Elena Innocenti", "comment_text": "In my passport photo i have brown hair. Now purple. And i lost 70kg.\nI travel around world without problem."}]}, {"id": "2203152503417161", "text": "I am looking for a reliable shuttle service from Naples train station that drops you off at your hotel in Positano. I would prefer a shared shuttle service over private just to save a little money. If anyone has any recommendations that would be appreciated. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2203152503417161/", "likes": 32, "comments": [{"username": "Jeff McLellan", "comment_text": "Check out Mydaytrip.com we used them for two of our private transfers. Pretty sure they include shared options. As that is not a long trip the savings might be limited if there are two or more in your group."}, {"username": "Sandy Radican Shikaly", "comment_text": "Don't know any shared services only private transfer.. Amalfi Coast Transfers"}, {"username": "Alison Wrobel", "comment_text": "The best just used them this weekend! Very professional, reliable and great with updates and communication\n\nhttps://\nwww.positanotaxi\ntransfers.com/"}, {"username": "Susanne Terry", "comment_text": "Amalfi coast transfers"}, {"username": "Cheryl Gorfinkle", "comment_text": "Ask your hotel to get a driver to pick you up at the airport"}, {"username": "Mark Andrews", "comment_text": "We got our hotel in Sorrento to get us a driver to pick us up in Naples"}, {"username": "Dorothy Press", "comment_text": "White Taxi Service - Amalfi Coast - AnthonyCharles Paglino is great and very knowledgeable. He speaks very good English too. We had his transportation service in 2019 and this past June 2023."}, {"username": "Allyson Ellen", "comment_text": "Thanks everyone for your suggestions, much appreciated! 😊"}, {"username": "Lisa Walkow Bonchonsky", "comment_text": "We used Transferelax. They were very reliable. $280 round trip for 4 of us."}, {"username": "Malia Petulla Hart", "comment_text": "We just got back from Italy and used Taxi Mr. Cab. They were recommended from this group and I can’t say enough about them. It was awesome! You just send a FB message."}, {"username": "Sara Ghaytanchi", "comment_text": "F"}, {"username": "Jan Buess", "comment_text": "Sorry, doing private, 150EU."}, {"username": "Terina Kwiatkowski", "comment_text": "Mena Forino they amazing! Message her and she will reply ASAP all of her drivers were amazing with beautiful Mercedes that’s a tiny little bit more than a taxi cab so comfortable and leisurely! ￼"}, {"username": "Rachel Johnson", "comment_text": "F"}, {"username": "Ian Beyer", "comment_text": "One option is Train to Salerno, then ferry to Positano."}, {"username": "Colita Ellis Wittenkeller", "comment_text": "We plan to ferry from Naples to Positano."}, {"username": "Robert Stone", "comment_text": "Viator"}, {"username": "Ashley Czinege", "comment_text": "I paid 160 euro each way for private transfer. So much easier, especially with all of your luggage. I was picked up from\nNapoli Centrale Termini and he assisted with all of our luggage. I tipped and gave him 200 euro each way. He was thrilled and treated us so well. On our way into Amalfi coast, he even pulled over and got us both a crema di limone. It is so worth the extra for private transfer! Takes all the stress away.\nMine was booked through my\nBnb (4Homes). They were amazing and very helpful."}, {"username": "Lisa Lynn", "comment_text": "I take the train from Naples to Salerno. At that point you can take a ferry to Positano- it’s always wonderful to sit on the top deck and see the small towns as you go up the coast. ￼ There’s also a bus that stops at every town but it’s a long ride.\nMany of the hotels have a private car service that will come pick you up. ￼\n￼ Our hotel ￼ set up a driver to take us or pick us up from Naples or Salerno. ￼ I believe it’s a good hour ride from Naples.￼"}, {"username": "William Cawood", "comment_text": "Does anyone have suggestions for transport company from Naples to Sorrento for 9 people?"}, {"username": "Alison Rouget", "comment_text": "I was thinking of getting the ferry from Naples to Positano instead of a transfer. Would anyone recommend this?"}, {"username": "Caroline Waters", "comment_text": "Catch a train to the Marina then boat to Sorrento then bus to Positano"}, {"username": "Ginger Bandy Davies", "comment_text": "April Thomas Carpenter maybe for train to airport"}, {"username": "Liz Smith", "comment_text": "Aldo Limos"}, {"username": "Maggie Goff Bolin", "comment_text": "Shannon Goff Flanagan"}, {"username": "Joe Green", "comment_text": "Try the Welcome app. We found it really good."}, {"username": "Elizabeth Comeau Farnham", "comment_text": "Sorrento Choice was amazing! Ask for Stephanie!"}]}, {"id": "2203152590083819", "text": "Evening all! I’m looking at going to Verona in October, and I wanted to check whether anyone knew if everything (e.g. museums, arena) would still be open this time of year? I haven’t visited Italy this late in the year before, and I don’t want to book and then I can’t see everything I want to! Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2203152590083819/", "likes": 1, "comments": [{"username": "Dafne Vassetti", "comment_text": "Everything is open in October."}]}, {"id": "2203152623417149", "text": "Does anyone have pictures they would share or input regarding how difficult the climb to Florence’s Duomo (Santa Maria del Fiore) or the climb to Giotto’s tower is? I’m trying to determine if I am capable of either one. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2203152623417149/", "likes": 0, "comments": [{"username": "Jennifer Walp Rydholm", "comment_text": "I am trying to decide on this as well and giving myself permission to not do it because “everyone does it.”"}, {"username": "Lora de Vries", "comment_text": "Go to YouTube. There are videos you can watch."}, {"username": "Tara Dix", "comment_text": "Inside Duomo, probably the hardest section, and there are a few narrow parts."}, {"username": "Tara Dix", "comment_text": "But the view inside the Duomo is just as good as outside from the top!"}, {"username": "Fiona Cameron", "comment_text": "I’ve done both. The Duomo 3 times and bell tower once. The Duomo is pretty tough, and I was pretty fit (in my 50s)\nThe passage gets very narrow at some points so you really cannot stop to rest as you would block the way for everyone behind you. The bell tower is 3 or 4 levels separated by steps. So its easier to rest a while on each level."}, {"username": "Jo Ann Ciuffini Forcino", "comment_text": "Thank you all for the information"}, {"username": "Ana Ka", "comment_text": "I would not climb it... its too much, especially if you go in the summer... will be hot. just walk inside the duomo and make sure to step into the nearby Baptistery which has stunning mosaics sending you all the way to Byzantium 😅, not something you expect to see among all the renaissance stuff there... :)"}, {"username": "Lushan Yao", "comment_text": "The bell tower is easier because you can have as much time as you need to take breaks and rest. The duomo climb is controlled, and you have about 45 minutes to climb, enjoy the views and go down."}, {"username": "Jessica Biggs", "comment_text": "The Duomo is TOUGH! It also gets very narrow and steep at many parts and you don’t really have room to sow down or stop much as there will be people behind you. If you are even questioning it then don’t do it. The view is amazing but I would never do it again personally 😂"}, {"username": "Jeanne Hendrickson", "comment_text": "The stairway to climb to the Duomo in Florence is very narrow. If you are the least bit claustrophobic,\nsave yourself the agony and view it from below! 😅"}, {"username": "Val Kilgallon", "comment_text": "The Bell Tower was good! The first level is over halfway up where you come to an open area where you can look out and also look up all the way to see the tip top. Once you see that tip top and know you're halfway done, it is motivating to do those last two levels, which are a shorter climb! I have a fear of heights and I felt secure going up. It does get a bit tight on the stairs and places, so if you are claustrophobic,\nit might not be the best bet. Also, at the top you get a beautiful view of Venice and the duomo dome will be in the picture as well!"}, {"username": "Martha Tuzson Stockton", "comment_text": "Is the way up the same as the way down? In other words, can you change your mind and turn around?"}, {"username": "Lynn Mcconnell", "comment_text": "Donna Spencer we can do this!"}, {"username": "Jill Medrano Casey", "comment_text": "My husband and I just did the Duomo in June. I am 50 and he is 52. We are in relatively good shape. Up, we got winded a couple times. Down I felt was a bit trickier because it is narrow and steep and I have some balance/vision issues. However, the view was worth it! I would do it again if we were in Florence."}, {"username": "Blenda Johansen-Rodriguez Del Rio", "comment_text": "The Duomo is not too bad. I did it. I’m 48 years old and I’ve had problems with my knees for years. Yes, it is a little narrow, but it is definitely doable. They do multiple stops before you reach the top. And once you get there, it is stunning! ￼￼"}, {"username": "Lynn Crane", "comment_text": "We did it last month. It wasn't as difficult as I imagined. It is pretty narrow in places, though, with windy parts. Let me find a photo..."}, {"username": "Karen Smart", "comment_text": "I've done both. If you do one, go in the morning before you're too tired. Check out YouTube for videos of climbing the duomo in Florence to give you a better idea of what to expect. There are some good ones."}, {"username": "Krissy DaRusso", "comment_text": "When I was there it was blistering heat! One of the problems is that if other people do it and become overheated, you get stuck behind them. I had a couple have to wait about 45 minutes for another person who got overheated (or scared). There’s no way around them so even if you’re going to make it, pray other people do as well. I decided against it but will give it a go if I’m visiting during cooler months."}]}, {"id": "2203154163416995", "text": "Can I sell my tickets to colosseum. Do they check for ID for the purchaser? Or anyone can use it as long as there is valid ticket?", "link": "facebook.com/groups/1373361046396315/permalink/2203154163416995/", "likes": 3, "comments": [{"username": "Jeff McLellan", "comment_text": "They checked our ID against our tickets both times we went."}, {"username": "Karen Blackmore", "comment_text": "They checked our ID"}, {"username": "निनावी सहभागी", "comment_text": "So does that mean I can’t give it to a friend and have them use it?"}, {"username": "Brian Harrison", "comment_text": "They didn’t check our ID, just asked for our names and checked against their confirmations"}, {"username": "Kate Laidlaw", "comment_text": "We went with a tour group a few days ago. Specified to have offical ID (passport). We went through but group in front all had their ID checked. Can you email etc for a name change?"}, {"username": "Nicole Gouzoules Sheehan", "comment_text": "Didn’t check our IDs two days ago."}]}, {"id": "2203155990083479", "text": "Arrived in Venice today. 2 days exploring to come. What are your 'must dos' please? 😁😎", "link": "facebook.com/groups/1373361046396315/permalink/2203155990083479/", "likes": 2, "comments": [{"username": "Leslie Quasius", "comment_text": "Doge’s Palace for sure!"}, {"username": "Rhonda Russell", "comment_text": "Torcello if you have time"}, {"username": "Tanya Bitar", "comment_text": "Burano and Lido islands"}, {"username": "Mary Anne", "comment_text": "This bookshop."}, {"username": "Etschi Bruckner", "comment_text": "my fav view from the San Giorgio Maggiore - never many people!"}, {"username": "Etschi Bruckner", "comment_text": "heading for my favourite bacari for ombre e chicchetti!"}, {"username": "Etschi Bruckner", "comment_text": "and have \"spritz al select\" like the locals - instead of aperol spritz!"}]}, {"id": "2203156006750144", "text": "We are in Rome now and have been here for 4 days so far. We were here in 2018 and during that time had visited Colosseum, Trevi and Pantheon. With research on how bad the crowds are now we decided to focus on other paths and so far it has been awesome and in some places we were almost completely alone. We also did not have to buy any tickets in advance so it gave us great flexibility in our schedule.\n\nHighly recommend:\n\nPalazzo Colonna - only open Friday and Saturday mornings until 1pm. Stunning private palazzo. Get the ticket with the gardens included.\n\nPalazzo Barberini National Gallery\n\nMuseum of the Baths of Diocletian\n\nGalleria Spada is small but lovely and only 6 euros. Great area to also just walk around.\n\nPalazzo Altemps\n\nTrastevere we walked in from Via della Lungaretta at piazza trilussa and made our way to grounds of Basilica di Santa Cecilia, we were only ones there, walked down road and made way to Basilica Santa Maria. We went into the Trastevere museum but hesitant to recommend. It was quiet. Main exhibition is modern photography which my daughter enjoyed but not what we were expecting. The local history part is very small. We were done in less than 30 minutes. We then kept wandering through quieter side streets of Trastevere to Giselda coffee shop for a nice break. Continued wandering. Stopped at over priced Twice Vintage clothing shop for a quick browse. Had a great stop for late afternoon charcuterie and drinks at Mimi e Coco.", "link": "facebook.com/groups/1373361046396315/permalink/2203156006750144/", "likes": 3, "comments": [{"username": "Elena Eugeni", "comment_text": "If you still have time, consider also Domus Aurea, Villa Torlonia with all the buildings inside, Terme di Caracalla"}]}, {"id": "2203157063416705", "text": "Hi we are flying to Rome for 2 days before a cruise. Our flight lands at 6 am Italy time. Our hotel won't be ready until the afternoon sometime. My question is, should we nap for a couple of hours when we get to the hotel, or rnuscle through and maybe go to bed early that night? Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2203157063416705/", "likes": 0, "comments": [{"username": "Stella Dee", "comment_text": "Go to bed early."}, {"username": "Kate Carberry Ansart", "comment_text": "When we landed in Rome last month, we pushed through and made it until 8:00pm. My husband and I both woke up at midnight, so we took a melatonin and went back to sleep until 6:30am. It was perfect - we woke up refreshed and on Rome time!"}, {"username": "Tracy Foss", "comment_text": "Stay up as long as you can to adjust to time change quickly"}, {"username": "Tracy Wrinn Mcdermott", "comment_text": "Muscle through and have the hotel hold your bags."}, {"username": "Kim Dixon", "comment_text": "I always recommend a short (maybe 2 hour) nap in the afternoon, then stay up until whatever is a normal bedtime for you. Then, get up at a decent time the next day"}, {"username": "Roberta Higgs", "comment_text": "Muscle through, it’s really not that bad, I think it’s just thinking about it that’s what scares ppl, you’re just thinking of how tired you’ll be, but really you’re not. I’ve done transatlantic a few times, it’ll be fine. Think of the adventure and experience, after all you’ll have a take to tell! Enjoy"}, {"username": "Mary Brown", "comment_text": "Assuming you are coming from US and adjusting from a 6 hour time difference, nap only but in the morning (if possible) otherwise push it through. Do not nap in the afternoon.\nDo not go to bed until ￼10 or 11 pm otherwise you will wake up after a couple of hours and might stay awake for most of the night"}, {"username": "Diane Janovas", "comment_text": "Contrary to what most advise,I find a short nap of 1 or 11/2 hours when we get in the hotel works for us. Then get up walk around have dinner and stay up to a normal bedtime"}, {"username": "Kathy Flood", "comment_text": "Drop your bags off at the hotel and then go walk around. Do not take a nap. Maybe book a late afternoon golf cart tour or one of the eating Europe Night Time Tours. Stay up as long as you can and then crash hard."}, {"username": "Marjie De Villa Lorica", "comment_text": "We also stayed in Rome 3.5 days pre- cruise.\n\nOn the day we arrived- our hotel was so nice to give us early check- in, so we just changed outfits- then hit the ground running. We visited Trevi Fountain, Pantheon, and Piazza Navona- and some churches along our way. Then took a nap- then went out again to visit Spanish Steps, Piazza del Popolo and the beautiful Santa Maria del Popolo. We stayed in Via del Corso so it was very convenient and near these landmarks.\nDay 2– We did Ancient Rome- Colosseum, Roman Forum, Palatine Hill, and Santa Maria Maggiore Basilica.\nDay 3- We visited early in the morning St Peter’s Basilica, Castel de San Angelo, and Trastevere.\n\nHave fun in Rome and enjoy your cruise!"}, {"username": "Carmine Castiglia Jr", "comment_text": "It really depends on where you are coming from, don't you think? 😀"}, {"username": "Roxanne Franquelli", "comment_text": "It can go either way. Lol the nap can help but also really mess you up. I would drop my stuff at the hotel and go out and walk around. Take pictures, get a gelato."}, {"username": "Melanie Morris Swanson", "comment_text": "The hotel just notified me that we can have early checkin. I think after reading your posts, we will try to muscle through and go til we can't go no more! Thank you to all."}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "Don't nap. Just get going. Your body will adjust. Head to bed a little early and you should be fine."}, {"username": "Kim Geary Keidel", "comment_text": "Sleep on the plane as much as you can and then power through. We landed in Zürich around 10 in the morning and didn’t get back to our hotel until around 11 at night. We had a good night sleep and really adjusted to the time quickly."}]}, {"id": "2203157716749973", "text": "Can anyone recommend a week itinerary for the Puglia region? Will be flying from San Francisco…not sure which airport in Italy would be the best in terms of efficiency and cost to arrive in either. Second option is to visit the Lake Garda/ Verona area for a week first and then somehow get to Puglia for the 2nd week. Any suggestions would be greatly appreciated.", "link": "facebook.com/groups/1373361046396315/permalink/2203157716749973/", "likes": 2, "comments": [{"username": "Elena Marchese", "comment_text": "You can focus on a specific area, the Valle D’Itria for example."}, {"username": "Evie Gee", "comment_text": "I flew into Brindisi Airport, but this requires a stop. There are no direct flights from the US to Brindisi. Bari Airport, also in Puglia, is larger."}, {"username": "Rosemary Barbetta", "comment_text": "To Venice (and Garda) then Venice to Bari and train around."}, {"username": "Miyuki Kanno Paul", "comment_text": "I flew into Rome(FCO) and took a high speed train to Bari. I didn’t want to deal with any domestic flight, so it worked perfectly. I picked up my rental car, drove everywhere even all the way to Santa Maria di Leuca, the very tip of Puglia"}]}, {"id": "2203158680083210", "text": "Hello all. Many years ago we bought dresses for my wife at a small shop in Rome. They were the nicest she ever owned. We are going back, but to Florence. Any recommendations for boutiques there?", "link": "facebook.com/groups/1373361046396315/permalink/2203158680083210/", "likes": 3, "comments": [{"username": "Jill Tingley", "comment_text": "Great shops and leather goods too"}, {"username": "Lora de Vries", "comment_text": "If you go to the Rinascente Department store and the main shopping street Via de’ Tornabuoni, you will have a pretty good idea of what is on offer. We enjoyed walking around all the stores here."}, {"username": "Ana Ka", "comment_text": "in Florence I like Momoni store; great italian low radar brand: https://\nwww.momoni.it/\neu/en/"}, {"username": "Ana Ka", "comment_text": "Also this shop is wonderful: they have mostly off the beaten path but nice brands from Italy: https://\nwongvalle.com/"}, {"username": "Ana Ka", "comment_text": "She might also like Loretta Caponni for fabrics... queen Elizabeth apparently used to wear their robes... very pretty store: https://\nwww.lorettacapon\ni.it/"}, {"username": "Ana Ka", "comment_text": "If you need any other recommendations\nfor Florence, feel free to ask :)"}]}, {"id": "2203166000082478", "text": "Hi we are planning our first trip to Italy for next year but plan to do it in our camper van, has anyone done it this way?and what did you think?\nMany Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2203166000082478/", "likes": 0, "comments": []}, {"id": "2203170503415361", "text": "We will be arriving in Rome tomorrow morning. We are renting a car and staying at Versilia Lido on the coast in Camaiore, Tuscany area for 5 days. Does anyone have restaurants/places to suggest while we are in that area? Day trips?", "link": "facebook.com/groups/1373361046396315/permalink/2203170503415361/", "likes": 1, "comments": [{"username": "Helen Mauger", "comment_text": "Have a great time!!!"}]}, {"id": "2203171870081891", "text": "Recommendations for spa & thermal day options in Siena", "link": "facebook.com/groups/1373361046396315/permalink/2203171870081891/", "likes": 0, "comments": []}, {"id": "2203172043415207", "text": "Can anyone guess where this is?", "link": "facebook.com/groups/1373361046396315/permalink/2203172043415207/", "likes": 48, "comments": [{"username": "Steve Mandel", "comment_text": "Camogli!"}, {"username": "Heather Weiss", "comment_text": "Positano"}, {"username": "Rip Lonergan", "comment_text": "Could be any number of features up and down Italian coast. I love calamari and had this cone usually at the train station in Cinque, Terre, Rapalo, etc."}, {"username": "Dan Pieri", "comment_text": "Camogli"}, {"username": "Miyuki Kanno Paul", "comment_text": "Canogli"}, {"username": "Sandra Francano Richards", "comment_text": "I guess Italy🤣🤣🤣🤣🤣"}, {"username": "Richard Reif", "comment_text": "Camogli\n\nhttps://\nmaps.app.goo.gl/\noENmc77yMc55D1k9\n6?g_st=ic"}, {"username": "Scott Perry", "comment_text": "Camogli!!!"}, {"username": "Trish Ellis", "comment_text": "Camogli!"}, {"username": "Jill Brothers", "comment_text": "Frito misto per favore!"}, {"username": "Janice Vaznonis", "comment_text": "Where I need to be?"}, {"username": "Shelley Chilton", "comment_text": "Camogli is such a lovely place to unwind. Love it❤️"}, {"username": "Gianna Onesi", "comment_text": "Riomaggiore"}, {"username": "Antonio Aloè", "comment_text": "Camogli dude.."}, {"username": "Cindy Neilson", "comment_text": "Cinque Terra - Vernazza??"}, {"username": "Louis Des Forges", "comment_text": "Camogli I was there in April. Got this bag as a small present for someone."}, {"username": "Phyllis Snyder", "comment_text": "My guess is heaven!"}, {"username": "Ähmëd Khlïêf", "comment_text": "Ähmëd Khlïêf"}, {"username": "Sarah Luisa Hughes", "comment_text": "Camogli"}, {"username": "Helen Stokes", "comment_text": "Rottnest Island"}, {"username": "Ana Mosca", "comment_text": "Italia ;Sicilia"}, {"username": "Debbie Gow", "comment_text": "Minori or Māori Amalfi Coast"}, {"username": "Ana Maria Capatti", "comment_text": "Camogli, Genoa"}, {"username": "Kathy McDonald Rieke", "comment_text": "Shannon Elizabeth I want this!!"}, {"username": "Vanessa Dunn Jordan", "comment_text": "Looks delicious 😋 Calamari"}, {"username": "Chiara Pirrello", "comment_text": "Camogli"}, {"username": "Kerri-Maree Munro", "comment_text": "Wow to Al of it"}, {"username": "Michela Zanni", "comment_text": "Yes, for sure. My favourite place in Liguria"}, {"username": "Alexandra A Welker", "comment_text": "Camogli!! On my list to visit."}, {"username": "Rachel Castleberry", "comment_text": "Cinque Terre"}, {"username": "Kiki Komninou", "comment_text": "Rapallo;"}, {"username": "Peggy Sue Bjork Biwer", "comment_text": "Looks like Cinque Terre"}, {"username": "Uta Boter", "comment_text": "Camogli!"}, {"username": "Mick Pratley", "comment_text": "I don’t care I just want that lemon sorbet or gelato 😋😋😋"}, {"username": "Craig Scott", "comment_text": "Blackpool 👍"}, {"username": "Jennifer Kern Davis", "comment_text": "Where is this?? Would love to visit"}, {"username": "Carmen Giambattista", "comment_text": "Wasaga Beach"}, {"username": "Dan Adams", "comment_text": "Can't tell, the calamari is in the way."}]}, {"id": "2203173900081688", "text": "We (2 of us) will be traveling to Italy for 10 days in may/June 2024 and then heading to central Switzerland for a week and attempting to use backpacks and carry on luggage only. Problem: hot in Italy and definite potential for cool in Switzerland. Thinking to send the cool weather things over to Switzerland ahead of time (daughter will already be there). Does anyone have experience with this, is it a good/bad idea and what shipping company to use and costs have you experienced?", "link": "facebook.com/groups/1373361046396315/permalink/2203173900081688/", "likes": 3, "comments": [{"username": "Colleen Dawson", "comment_text": "Temperatures in Italy and Switzerland at that time of the year is comparable."}, {"username": "Tammy Oehler Liggett", "comment_text": "Thank you so much! 😊 Both of you. Good to know!"}, {"username": "Gina Gourlay-Blackberry", "comment_text": "Depends where you are travelling from. If you’re coming from an Australian summer, I’d recommend a light/mid weight down jacket for visiting the alpine areas. Mine squashes down to nothing and you can use it as a pillow on the flight. It can still be cool on May and definitely colder if you go to higher altitude areas. That said, the seasons change quickly and it gets very warm. I managed with a backpack and carryon. Add jeans/pants, long sleeve cotton top, maybe a scarf and good walking boots."}, {"username": "Renee Kremesec", "comment_text": "Yes\nDid exactly this.\nWe traveled all over Switzerland in June and thought it would be cool. It was beautiful. Suggest to bring 1 cool weather item like a roll up jacket etc.... and light pants.\nWe had carry on and a backpak .\n\nSUGGESTION\nITag\nSome airports we were still forced to check baggage and it was lost twice. APPLETAG worth its weight in gold.\n\nWe sent our things home UPS when arriving in Italy\n1 med box was 150.00\n\nWe did our best to travel light\nAnd had zero room to bring anything home. It was more difficult than we thought to mail home items.\n\nTemps are very different in Switzerland but even rain was lovely and it warmed right up.\n\nItaly was very hot end of June and July, we wore the most comfortable clothing we could.\nShorts and sandals were my go to.\n\nHave a blast\n\nPs\nAirport in Switzerland all your 3oz. toilettries have to be placed in a plastic bag, they are very strict about this, and they almost made me toss half of my things out. Every country is different just be aware and read and follow signs and you will be good."}]}, {"id": "2203177643414647", "text": "Hi, I'm going to cagliari in 2 weeks, staying there for 5 days and was wondering if it's worth renting a car? if so, any idea where I can do so?", "link": "facebook.com/groups/1373361046396315/permalink/2203177643414647/", "likes": 0, "comments": [{"username": "Dafne Vassetti", "comment_text": "Yes, you will need a car to get around Sardegna."}]}, {"id": "2203178756747869", "text": "Would love recommendations for a great restaurant in Venice with a view to celebrate our 40th anniversary. We will be there in October. Maybe middle of the range in price would be preferred if possible.", "link": "facebook.com/groups/1373361046396315/permalink/2203178756747869/", "likes": 6, "comments": [{"username": "Marie Barré", "comment_text": "My husband and I will also be there in October to celebrate our 30th! We’ll see what recommendations\nyou get!"}, {"username": "Jill Tingley", "comment_text": "Madonna"}, {"username": "Karen Lawrence Smith", "comment_text": "We ate at Ristorante Omnibus on the canal near the Rialto and it was delicious."}, {"username": "Gay Bell DiBartolomeo", "comment_text": "Gritti Palace"}, {"username": "Debbie Crossley Asquino", "comment_text": "Going next year on our honeymoon, following"}, {"username": "Frannie Kaplan", "comment_text": "La Feluca?"}, {"username": "Billie Begley", "comment_text": "Viva Rosa. Excellent. Been there at least 4 times."}, {"username": "Liz Mazzare Contadeluci", "comment_text": "F"}, {"username": "Julie Angel Bruther", "comment_text": "F. Also going in October!"}, {"username": "Michelle Bergman Davis", "comment_text": "Our two favorite restaurants in Venice were Osteria Da Carla and Osteria Enoteca San Marco.\nBoth are near St Mark’s Square. We also had an amazing lunch at Guna, based on lunch I can only imagine how amazing dinner might be."}, {"username": "Helen Stokes", "comment_text": "F"}, {"username": "Douglas Bourg", "comment_text": "Talk to Clark..."}, {"username": "Douglas Bourg", "comment_text": "Talk to Clark...."}, {"username": "Maryellyne Nardo Thornton", "comment_text": "Kathleen Hardick ...wow...how exciting for you guys!! You will LOVE Italy and Venice ❤️\nThe food, wine, gelato, and unfathomable Architecture will BLOW you away!! 😋\nEnjoy...and mangiare!! Weather should be perfect...bring\npants, long sleeves, a rain jacket or poncho and comfortable shoes😃"}]}, {"id": "2203179606747784", "text": "I am looking for a reputable rental for holiday homes in Sicily and Calabria.\nDoes anyone have a recommendation?\nMany thanks☀️", "link": "facebook.com/groups/1373361046396315/permalink/2203179606747784/", "likes": 0, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2203180743414337", "text": "Hi I have seen some posts about buying jewelry in Italy. Anyone have recommendations for a reliable and trustworthy shop in Florence to buy a gold chain? Thank You", "link": "facebook.com/groups/1373361046396315/permalink/2203180743414337/", "likes": 3, "comments": [{"username": "Celeste Beaver", "comment_text": "There are many to choose from on the bridge. Never had a problem"}, {"username": "Karen Schmidt", "comment_text": "Gold Corner\nNear Santa Croce"}, {"username": "Ruth Mattingly", "comment_text": "DelBrenna, located in Cortona recently opened a store in the heart of Florence at Borgo Sant'Apostoli 45R. Gold chains are a specialty. My friends and I have bought many cherished items from their Cortona store. https://\ndelbrenna.com/"}, {"username": "Clint Madsen", "comment_text": "This is the place I go, I have spent THOUSANDS and have some of the BEST GOLD and memories- Chains, Rings,Bracelet!\nFantastic service and good selection!\nMatassini Jewelry between the Ponte Vecchio and the Uffizi.❤️😎"}, {"username": "Sarah Miller Porter", "comment_text": "I would search this topic in the search bar. Someone asked last week about it and the responses gave good stores and to avoid the bridge area."}, {"username": "Gina LaRosa Tozzi", "comment_text": "Gina LaRosa Tozzi"}, {"username": "Maria Minnuto Minervini", "comment_text": "The Gold Market in the square of Santa Croce"}, {"username": "Suzanne Felder", "comment_text": "Florence - gorgeous and affordable. Great service too."}, {"username": "Krissy DaRusso", "comment_text": "Avoid the Ponte Vecchio!"}]}, {"id": "2203181283414283", "text": "Can anyone recommend a fun tour or exeprience in or around Sienna in October? We are already stopping in San Gimignano and Monteriggioni on the way in. I would also love a restaurant recommendation. I will be turning 50 while there and need to celebrate! Thanks so much!", "link": "facebook.com/groups/1373361046396315/permalink/2203181283414283/", "likes": 4, "comments": [{"username": "JeriLynne Clifford", "comment_text": "We do wine tours. Hire a driver go to 2 or 3 wineries and have lovely lunch. This is who we use.\n\nhttps://\nwww.montalcinowi\nnetours.com/"}, {"username": "Bill Ulrich", "comment_text": "Porta del Cielo tour at Siena Duomo. Upper level exterior and interior views. Eat at Al Mangia on the Piazza del Campo"}, {"username": "Ana Ka", "comment_text": "Sorry, don't know good restaurants in Siena... (havent explored it enough), but the tours by appy guide were brilliant, especially loved their tour of the floors and the frescoes inside the main Cathedral: https://\nappyguide.com/\nstories/\nthe-cathedral-of\n-siena-interior\n-part-ii-1 Really beautiful!"}, {"username": "Tyson Cannon", "comment_text": "Thanks so much!"}]}, {"id": "2203182280080850", "text": "I would like suggestions for winery near Montalcino with lunch and tastings. We will be there this October.\n\nLove reading all of the suggestions for Florence.", "link": "facebook.com/groups/1373361046396315/permalink/2203182280080850/", "likes": 3, "comments": [{"username": "Ana Ka", "comment_text": "For Montalcino I like quite a few wineries...\n\nArgiano - gorgeous, but big, most stunning cellars https://\nwww.argiano.net/\nen/\nLa Fiorita - stunning winery, great wine, a fascinating story of the owner from America, who changed her career and started making none other but Brunello and doing it so well! https://\nwww.lafiorita.co\nm/en/home/home\nLe Potazzine - great family winery, lovely girls that own it https://\nwww.lepotazzine.\ncom/la-tenuta/\n?lang=en\nSan Polino - a wonderful couple that puts their heart and soul into making amazing brunello yet preserving the land for future generations https://\nwww.sanpolino.it\n/\nCapanna - good wine https://\nwww.capannamonta\nlcino.com/\nen.html\nFattoria Barbi - the sweetest and most charismatic owner https://\nwww.fattoriadeib\narbi.it/\nGiodo - one of the best winemakers in the world https://\npoderegiodo.it/\nen/\nthe list goes on, but i guess this is enough to choose from?\n\nalso, make sure to visit the nearby attractions. Happy to share my thoughts if needed 🙂 Enjoy Montalcino!!!!"}]}, {"id": "2203184443413967", "text": "Visiting Rome soon for a day and want to get out of the city. Is it worth it to take the train to Formia? It looks like some beaches are free and some not?", "link": "facebook.com/groups/1373361046396315/permalink/2203184443413967/", "likes": 0, "comments": []}, {"id": "2203186276747117", "text": "Can someone please explain how does bus system work in Rome? And how do people use it without paying ?", "link": "facebook.com/groups/1373361046396315/permalink/2203186276747117/", "likes": 2, "comments": [{"username": "Laura DeCicco", "comment_text": "You don’t use it without paying."}, {"username": "Dafne Vassetti", "comment_text": "Why you think you can use public transport for free??"}, {"username": "Cecilia Christine Costantini", "comment_text": "You buy your tickets from machines or tobacco shops (not on the bus). You \"validate\" them on the bus, there are specific machines (obliteratrici)\nthat will stamp the day/time on the ticket. Some people \"forget\" to validate the ticket, so they are basically not paying for their ride (because they can use that ticket for another ride), which is illegal obviously. When ticket inspectors ask for tickets, if you don't have one or you haven't validated yours, you will be fined. So always remember to buy tickets BEFORE boarding the bus and to validate them as soon as you get on the bus."}, {"username": "Dafne Vassetti", "comment_text": "Remember to:\nPassengers found travelling without a valid ticket or with an irregular ticket, will be issued with a penalty fare from 100 up to 500 euros, besides the payment of the ticket price, of the procedural costs and postage charges, if applicable. The penalty is reduced to 50 euros if paid within 5 days after notification.\nA penalty fare is raised when:\nalthough having a ticket, you did not validate it correctly;\nyou are found with a ticket or travel pass that is visibly counterfeit;\nyou are using your ticket beyond its validity period;\nyou are using your ordinary ticket or travel pass on special connections, that require a specific ticket;\nyou are using a ticket or travel pass with a lower price or distance coverage than needed.\nyou display a personal pass without having filled in your data or without an ID card."}, {"username": "Cecilia Christine Costantini", "comment_text": "You cqn use it for free if you are under 10 years old. 😆"}]}, {"id": "2203190200080058", "text": "When traveling internationally (or heck anywhere) is it worth it to pay for nonrefundable tickets? I hate to spend the extra $1,700 for 4 of us, but I also don’t want to be stupid. What do you do?", "link": "facebook.com/groups/1373361046396315/permalink/2203190200080058/", "likes": 25, "comments": [{"username": "Judy Galloway", "comment_text": "Get insurance?"}, {"username": "Beth Eichenbaum", "comment_text": "I’m going next august and would absolutely get insurance."}, {"username": "Kyra Savoie Miles", "comment_text": "I just found out about this Allianz! Def look into it!"}, {"username": "Anna Presuto", "comment_text": "We had a trip planned to Italy. My mom wasn’t doing well so we decided to get trip insurance. And guess what 2 days before we left..so yes I would recommend it."}, {"username": "Lee Treacy", "comment_text": "I always buy non refundable flights. But I have great annual travel insurance !\nI even got all my money back for three different trips when covid hit. Pandemics are not covered in travel insurance ..\nHotels I always have free cancellation and pay on arrival."}, {"username": "Annette Tamminga", "comment_text": "You need travel insurance."}, {"username": "Amy Clyne Wells", "comment_text": "Travel insurance???"}, {"username": "Kathy Berk Sherbal", "comment_text": "I would get insurance as it just happened to me… family of four were supposed to go in June and I broke my foot and couldn’t travel. Get all insurance and refundable airline tickets. Even if all are healthy you never know what can happen."}, {"username": "Jean Zirbel", "comment_text": "Not to be a Debbie Downer but my husband and I were finally ready to travel after my husband recovered from throat cancer and then I diagnosed with breast cancer.......Yo\nu just never know! I buy insurance on concert tickets and theater tickets!"}, {"username": "Tyffany Tubajon", "comment_text": "Spend it! 4 days before my trip, I had a freak accident and required surgery. Couldn't go on my trip and also lost all my money. Sh*t happens!"}, {"username": "Susan Rathke", "comment_text": "I buy the travel insurance."}, {"username": "Jazz Caldwell", "comment_text": "We always go with the insurance..."}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "Travel insurance!"}, {"username": "Lori Sammons", "comment_text": "Trip insurance or refundable it’s worth it, things could happen at least your covered"}, {"username": "Ayu Danielle", "comment_text": "I always get travel insurance if I travel abroad. I didn't used to but then my daughter was diagnosed with leukemia just before we were supposed to travel to London. So since then, it is a must for me. I have managed to claim insurance when I decided to cancel a trip due to an earthquake at our holiday destination."}, {"username": "Diane Davis Lawyer", "comment_text": "Our plane tickets are refundable. We are seniors and for us it made sense to pay extra since our health is more subject to being compromised--ou\nr tickets were also purchased six months out from departure date. We're flying Air France and they give a senior discount anyway, so that more or less paid for the extra cost of refundable tickets. It's been much less stressful not having to worry just in case something was to pop up, we've not lost almost $3000!"}, {"username": "Anthony Martini Jr.", "comment_text": "Trip insurance"}, {"username": "Tami Sue", "comment_text": "If you're paying double for refundable ticket then it's not worth it. I don't understand why people would even buy that option. I never buy a refundable ticket."}, {"username": "Kim Dawn", "comment_text": "I have never bought insurance. When booking flights choose the booking that has a cancellation or rebooking fee option-typicall\ny not very expensive, example in Westjet it’s about 75.00. When I book hotels, I also use the free cancellation option, typically only a slightly higher rate, for example on booking.com it’s about an extra 10 bucks a night. That’s a whole lot less than 1700.00-insuran\nce companies are robbers."}, {"username": "Linda Dalelio Williams", "comment_text": "I only get trip\nInsurance because of heath reasons my amazingly great USA insurance is worth nothing in Europe."}, {"username": "Christopher A. Johnson", "comment_text": "I have never bought a refundable ticket. I always get a ticket that has no change fees however."}, {"username": "Heidi McPhillips", "comment_text": "Yes but….\nI get where they are non refundable but changeable\nI’ve used this option a lot!\nYou won’t be sorry"}, {"username": "Shirley Collar Wilson", "comment_text": "We just got trip insurance"}, {"username": "Heather Bonetti", "comment_text": "Insurance is a must."}, {"username": "Sharon Tancredi Ianiro", "comment_text": "Thanks to all of you for your comments and insight!!! This has been so helpful. 😊 🇮🇹"}, {"username": "Mike Adams", "comment_text": "Check with your airline as to their Definition of\n“Refundable”\n\nSometimes you get credit for future flights on a dollar for dollar basis.\n\nBut NOT A CASH REFUND."}, {"username": "Mike Adams", "comment_text": "$1700 EXTRA sounds like a lot.\nWhere / when are you traveling?\n\nLast year I booked Via AMEX.\nMy girl got sick and plans changed. AMEX went to bat for me - they have more clout with the Airlines than I do and got me credits for future flights."}, {"username": "Renee Rundle Stoneham", "comment_text": "I haven’t bought refundable tickets, I buy changeable tickets, you can change date or if you cancel you get airline credit.\nI also buy on my CSP CC that has trip insurance.\n\nAlso buy travel insurance if it’s a big $$$ trip with non refundable accommodations etc…"}, {"username": "Enolita Castillo", "comment_text": "Well stated Mary Lynn Austin Mang. Travel insurance is very expensive and NOT easy/simple at all to get a refund from the insurance company when you cancel your trip."}, {"username": "Caroline Eriksson", "comment_text": "I paid for a cheap non refundable ticket, no changes allowed etc etc from Stockholm to New Orleans for Oct. my daughter is having her first baby ! I was arriving 2 weeks before due date and staying 2 months. But she’s nervous about going into labour early and I really don’t want to miss it !! So I went onto BA site to see what cost would be involved to bring departure date forward - after playing with a few different days I found one that was no cost !!! At all ! Changed and done !\nAlso note I bought ticket direct on BA site - was way cheaper and better than what Skyscanner and Momondo were offering !!"}, {"username": "Joe LaLonde", "comment_text": "There’s usually a very basic ticket which is no changes/\nnon-refundable, then one above it that allows for changes but is still non-refundable.\nThe difference in these is usually about $100 US and personally I find that enough insurance in case something happens. Just this week I had to cancel a trip to Germany next month, with the airfare being changeable I just have X amount of delta credits to use in a year. The price difference in a fully refundable flight is usually considerably more."}, {"username": "Michelle Plutto", "comment_text": "I bought the cheaper version and use my chase sapphire for added"}, {"username": "Michele Baron Vold", "comment_text": "As long as you can reuse the value, you can buy them. You will not get money back but you will get the credit. I have had to do that many times. Plus if it gets cheaper you cancel and rebook and gave a credit left over."}, {"username": "Jessica LaRose Cappuccia", "comment_text": "Pay it. 7 of us were flyin out today for 2 weeks and 1 ended up in hospital so we arent going. Sometimes u take a cut n sometimes ull get nothing back. Depends on the details when purchased"}, {"username": "Alla Zats", "comment_text": "Buy travel insurance. It covers many scenarios for refunds."}, {"username": "Jill Medrano Casey", "comment_text": "Last year I had to have emergency eye surgery the day before our trip to Arizona. I had not purchased refundable tickets nor travel insurance. Luckily, sort of, Southwest gave us credits (4 people). We were using a timeshare, but had purchased point protection. Unfortunately, we have yet to find ticket prices using Southwest to anywhere we want to go that are close to the same price. (For reference, I was 49 years old and in good health.). I will now never travel without travel insurance and refundable tickets.\nWe were just in Italy in June and I needed to use my travel insurance to cover a dental accident - I was hit by a cyclist and lost a tooth! You just never know what will happen."}, {"username": "Lisa Valdovinos", "comment_text": "A lot can happen between now and then. I’d spend the extra money for peace of mind."}, {"username": "Mary Lynn Austin Mang", "comment_text": "We paid an extra $200 per ticket for fully refundable. We did not get travel insurance. People think insurance covers you for any cancellations but it’s only refundable if you have a medical emergency."}, {"username": "Daisy Yoo", "comment_text": "most airline give u credit if u cancel not refund back to ur card."}, {"username": "Susan Maxwell", "comment_text": "Perhaps check whether your credit card provides insurance for trip cancellation and if so, the specifics of an eligible claim."}, {"username": "Elena Innocenti", "comment_text": "Take insurance."}, {"username": "Brian McGraw", "comment_text": "Basic fare economy tickets are totally non-changeable.\n\nShould’ve bought regular economy and I could’ve done anything I wanted.\n\nI bought two last year for our trip next month.\n\nI’m an AA Gold member. I called and said, I’d like to pay to upgrade to first. And they were like, nope. No changes. Even if you want to give us more money.\n\nI even tried having the concierge in the lounge do it. And she couldn’t get it done."}, {"username": "David Beauchamp", "comment_text": "Get non refundable and trip insurance"}, {"username": "Mary Spring", "comment_text": "We do these days but we are in our 60’s and shit happens."}, {"username": "Cynthia Marie", "comment_text": "If you have to cancel your trip , tickets are good for one year. There may be price variations and a small fee but you won’t lose your ticket value."}, {"username": "Brenda Posey Simon", "comment_text": "We bought non-refundable tickets and have even changed our flight two times since. IF something happens and we have to cancel our we will receive an eticket credit that can be used up to 12 months. We also buy travel insurance for many reasons. We had heat stroke situation in Costa Rica, US insurance did not cover out of country. So, ambulance, EMT AND DR drove to the resort and provided medical care. Worth every penny and then some for us."}, {"username": "Christine Vieira", "comment_text": "I'm remembering an unexpected worldwide pandemic..... anything can happen. I wouldn't consider an expensive trip without it!"}, {"username": "Carol McDonald", "comment_text": "You can purchase credit insurance. Although, I did that 2x, I won't do it again."}, {"username": "Sue Morgan", "comment_text": "can you purchase travel insurance to cover the cost if you need to cancel?"}, {"username": "Laure Underwood Dalluge", "comment_text": "We do refundable tickets or trip insurance. My mom is in her eighties so i like to be prepared."}, {"username": "Joan Andromidas", "comment_text": "Nikki Blosser it really makes sense if you've put a lot of money into non-refundable travel. Too much is happening in the world these days... Flight changes, flight cancellations, fires, floods, you name it, let alone the possibility of your own health issues."}, {"username": "Felicia LoCascio Whitney", "comment_text": "Nonrefundable"}, {"username": "Joanne Nacson", "comment_text": "Check what the travel insurance covers you for. Not all are equal. What types of cancellation does it cover"}, {"username": "Gillian O'Callaghan", "comment_text": "Not in my opinion. If airlines cancel or reschedule they have to rebook you. If I get sick or injured and don't travel my insurance covers it."}, {"username": "Alice Moy", "comment_text": "Use a credit card has travel protections"}, {"username": "Sharyn Lockwood Allan", "comment_text": "I always get non refundable… and I always get travel insurance… you never know what could happen"}, {"username": "Cindi McLain Lokey", "comment_text": "I’m considering the same issue since my mom is in poor health."}, {"username": "Vicky Hall-Newman", "comment_text": "Ever since covid, I have always booked refundable flights, hotels, train tickets etc. You never know when something could happen to stop you going away"}, {"username": "Sh Kaplan", "comment_text": "I feel like if you can get a e-credit to use for next time it’s enough in my opinion if you need to cancel for some reason and then use it the next time"}, {"username": "Theresa P. Aiello", "comment_text": "I bought non refundable tickets for Italy in May 2023 for travel in September-Octob\ner 2023 for 30 days. I did not understand the one year change policy is effective from the date of purchase. (May 24, 2023). I needed to cancel and rebook. I thought I had through my original travel dates. But I only had through my booking date. It was twice the price I originally paid to travel April 24 through May 24 2024. So I settled on April 11 through May 11 2024 and it cost $610.00 per ticket more. This was for business class tickets. I can’t remember what the refundable price was at time of original purchase. Insurance is only if you have a legitimate reason, like sickness."}, {"username": "Lucrezia Folger", "comment_text": "Depends, if I know no matter what I'm going on this trip and dates, or if the price is really good, then I buy non-refundable."}, {"username": "Dana Ioana Baias", "comment_text": "Will be great and totally agree with you ! We did this for my mom she is elderly, i don’t think we ever did for us but we do have insurance through the card we used."}, {"username": "Chuck Malburg", "comment_text": "How soon is the trip? Everyone young and healthy?"}, {"username": "Diane Janovas", "comment_text": "Are you taking out travel insurance. If yes, then get the nonrefundable"}, {"username": "Sue Sherwood", "comment_text": "Get insurance."}, {"username": "Carolyn Esposito", "comment_text": "We bought refundable tickets and when the price dropped over $300 we got a refund."}, {"username": "Pam Gerretsen", "comment_text": "I think we've always done non-refundable on our long haul flights, and bought holiday insurance as soon as we've paid for the tickets. Whether it's an annual policy, or specifically for the booked dates, as long as you have it before (potentially) anything happens, then you're covered - at least that's how it works in the UK, assuming it's the same everywhere?!"}, {"username": "Aaron Loree", "comment_text": "Get insurance."}, {"username": "Angela Genduso", "comment_text": "Always take insurance"}, {"username": "Karen Schmidt", "comment_text": "Get insurance, or look at KLM. The cost for their flex tickets are only $100 more per person from what I’ve been seeing. Their overall ticket is a little bit more but it might be worth peace of mind. ￼"}, {"username": "Maureen Rebello Hagerty", "comment_text": "I never book nonrefundable. Buy trip insurance. It covers most anything"}, {"username": "Catia Fars", "comment_text": "We leave in one week. My teen fell down the stairs yesterday. Luckily just bruising, but could have been much worse. My oldest just got a terrible cold this mort. Anything can happen."}, {"username": "Sally Wilkinson", "comment_text": "Some times it’s still cheaper even if you have to re-buy the tickets"}, {"username": "Mick Konowal", "comment_text": "If you will use the ticket price at some point in the next year just make sure they can be cancelled and the price reused. That is cheaper than refundable and you can apply the purchase price toward another flight."}, {"username": "Anita Pirone", "comment_text": "So get refundable and insurance ? Or non refundable and trip insurance?"}, {"username": "Victoria Moorhead Murrow", "comment_text": "I always buy non-refundable but make sure it’s not a basic economy fare which is non-changeable."}, {"username": "Marguerite Lorenzi Gonzales", "comment_text": "Travel insurance and you may consider health insurance. We bought a plan for my husband and I only. Late 50’s and late 60’s."}, {"username": "Sascha Lee", "comment_text": "I personally buy nonrefundable. I don’t mind having a future credit with the airline. I fly enough that it’ll get used."}, {"username": "Rip Lonergan", "comment_text": "In 2019, I bought an annual policy from a very well-known carrier. I was actually in China in December, Phuket in January and then went to Bali trying to avoid Covid. My return reservation was through China. ￼ My girlfriend is an attorney. ￼ we worked for two months trying to get coverage and it was finally determined. Covid is an act of God so we got ZERO. Ended up coming home flying through China as it was originally booked and didn’t get any coverage. This is a little bit different than the question you asked, but it points out what other people have told you, read the fine print and know exactly what you’re paying for. ￼ Also fully understand the terms of the nonrefundable ticket. ￼Good luck and I hope your trip comes off as planned."}, {"username": "Marni Sherwin Grove", "comment_text": "We did refundable. Best decision ever! We ended up extending our trip and adding another ￼destination."}, {"username": "Rachel Wright", "comment_text": "Make sure you check your travel insurance policy before you buy non-refundable and ensure it will cover you if something happens to your mum. As she has already been in ill health, they may not pay out. A lot of companies exclude illness of family members if it was pre-existing."}, {"username": "Verna Frasca", "comment_text": "Like others said, If you get non-refundable airfare, consider trip insurance (not the one sold by the airline). With most airlines, you are now able to change a reservation with no fee, but you do need pay for any difference in fare. Note this has to be flights with the same airline, or codeshare partners. Also with most airlines, even if you have to cancel, there will be a credit that you need to use with that airline within a specific time. Check with the airline. Note that if you buy airline tickets through a 3rd party (like Expedia) the rules can be different."}, {"username": "Frannie Kaplan", "comment_text": "Non refundable.is for short and likely trips. Of course for something you book a year advance definetly get the flexible.option\n. you never know"}, {"username": "Janine Emma Lucas", "comment_text": "Buy insurance be sure to read inclusions that would allow you to cancel due to non traveller illness (your mom). It’s probably cheaper than flight option"}, {"username": "Debbie DiOssi", "comment_text": "They would still be exchangeable. You just can’t get the cash back."}, {"username": "Janice Bell", "comment_text": "I would just do insurance. Lots of things can happen even when you are on a trip. Well worth the $$ in my opinion. Just FYI I was on a cruise and fell down marble stairs. It could have been disastrous. I will not travel with out insurance. I was in my 40 s when that happened and wasn’t drinking as well. Lol."}, {"username": "Alexis Anderson", "comment_text": "Exactly! I am not paying an extra couple Grand for refundable tickets. We're all healthy and make sure we get insurance on the places we're staying."}, {"username": "Susan Lowry Lamb", "comment_text": "Anyone I pay the refundable price if it's offered."}, {"username": "Veronica Wyatt", "comment_text": "I would go for non refundable"}]}, {"id": "2203190770080001", "text": "Hi we are booked in the Bernina Express next week. Travelling Chur to Tirano.\nWhen we arrive in Tirano we are wanting to get to Como.\nDo we need to book the train in advance? How long would the train be and which website is best to book this? Thanks so much 😊", "link": "facebook.com/groups/1373361046396315/permalink/2203190770080001/", "likes": 0, "comments": []}, {"id": "2203191773413234", "text": "Traveling for 17 days. How much euros should I bring? One full size suitcase and a carry on bag too much?", "link": "facebook.com/groups/1373361046396315/permalink/2203191773413234/", "likes": 0, "comments": [{"username": "Mary Brown", "comment_text": "We started with about €200 and used ATM as needed in addition to trying to use a credit card as much as we could.\n\nSide note, your question is hard to give an advice.\n\nWhat part of Italy are you traveling to?\nAre you going to be based in one hotel for 17 days? Think about dragging all your luggage on public transportation if you are visiting multiple cities.\nCobblestones, small entryways, stairs.\n\nWhat are your accommodations?\nWill you have access to a washer.\n\nAre you traveling in the summer or the winter?\nGenerally I would say a full suitcase plus a carry on is too much."}]}, {"id": "2203191016746643", "text": "Is it possible to go to Venice from Rome, for the day ? Is public transportation better or a Taxi ? Thank you..", "link": "facebook.com/groups/1373361046396315/permalink/2203191016746643/", "likes": 0, "comments": [{"username": "Nancy Fleming Cartee", "comment_text": "https://\nromecolosseumtic\nkets.tours/\nultimate-rome-to\n-venice-day-tri\np/\n#:~:text=From%20\nthe%20best%20ti\nme%20of,amazing\n%20day%20trip%2\n0to%20Venice.\n\nCheck this out…"}, {"username": "Ken Lerch", "comment_text": "Doable but, jeez, what a waste of two beautiful cities. Just about enough enough time there for one quick meal."}, {"username": "Colleen Dawson", "comment_text": "Quite a long distance so public transportation is better. Doable, but will be a long day."}, {"username": "Lee Rew", "comment_text": "We took a high speed train from Venice to Rome and it’s about 4 hours."}, {"username": "Jay Parekh", "comment_text": "4 hour each way via high speed rail… so 8 hour round trip is not worth for a day."}, {"username": "Glenn Todd Webb", "comment_text": "Way to far to have time to see anything. Tivoli or Orvieto are best day trips from Rome."}, {"username": "Haley Rose Conley", "comment_text": "Don't do a day trip to Venice from Rome. You need much longer. Taxis won't drive you 6+ hours either."}, {"username": "Pat Cray", "comment_text": "You need more time"}, {"username": "Wayne Copes", "comment_text": "Thx everyone, we’re gonna spend the night in Venice"}, {"username": "Pao Magnoler", "comment_text": "I will not do it just for a day. Bit if you want to, you just take the fast train. Don't use taxis in Europe, you have train that will take you everywhere."}, {"username": "Rita Levi Montalbano", "comment_text": "No taxi will bring you from rome to venice do you think they will make 1000+ km in a day?"}, {"username": "Krissy DaRusso", "comment_text": "I usually say go for it but this one I’m going to say no. It’s about 4 hours each way. From the train station you could walk to the Colosseum but learning the layout and walking you’d need to keep an eye on time to not miss your return train."}]}, {"id": "2203193180079760", "text": "Hi! Did someone tried the luggage locker in train station or elsewhere near Pompei? Does it fit a large luggage? Not too large but a bit bigger than a carry on.", "link": "facebook.com/groups/1373361046396315/permalink/2203193180079760/", "likes": 2, "comments": [{"username": "Jenny Wadkins", "comment_text": "Also interested in this question, so tagging along!"}]}, {"id": "2203198910079187", "text": "Traveling to Italy in mid September with my adult daughter. We arrive in Rome, staying two nights then onto Sorrento. I have only been able to get a reservation until September 16, as the town seems all booked. Thinking of going to another town to finish out the week. Thinking Ischia, but is there enough to see there for 5 more days? Any suggestions?", "link": "facebook.com/groups/1373361046396315/permalink/2203198910079187/", "likes": 2, "comments": [{"username": "Dafne Vassetti", "comment_text": "I would have done Rome, 2/3 nights in Naples and then Sorrento."}, {"username": "Miyuki Kanno Paul", "comment_text": "From Ischia you can hop on a ferry to next door Island of Procida for a day"}, {"username": "Mary Anne", "comment_text": "Try Sant’Agnello. Very walkable to Sorrento."}, {"username": "Janice Rea", "comment_text": "Try Maison Kalea in Sorrento. Reasonable and not far from piazza"}, {"username": "Rachael Richardson", "comment_text": "We stayed in Vico equense gorgeous place"}]}, {"id": "2203198723412539", "text": "Where do you recommend me to go on a day trip from the Mestre Venice train? (I have Verona on the list but I still have 1 more day to do a day trip).\n\nThanks in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2203198723412539/", "likes": 1, "comments": [{"username": "Ann Applegarth Veith", "comment_text": "Padua aka Padova. Less than 30 minutes from Venice. Unesco World Heritage site. Not too many tourists.St. Anthony's Bascilliaca is totally underrated, IMO its one if the best in Italy, including Vatican City, also the square is one of a kind.\nGreat place to spend the day...did it last Tuesday."}, {"username": "Karen Blackmore", "comment_text": "Have you been to Burano and Murano, plus Tortola in Venice? Recommend Verona."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Ravenna!"}]}, {"id": "2203200573412354", "text": "My two children aged 20 and 18, and I are travelling Italy for a week via train. Would you recommend some sort or week ticket - if there is such a thing or individual ticket purchases? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2203200573412354/", "likes": 0, "comments": [{"username": "Nancy Kirmil Tebo", "comment_text": "Great question. I would be interested to know too."}, {"username": "Stephanie Adamek Annis", "comment_text": "Have you looked into the Eurail pass?"}]}, {"id": "2203206750078403", "text": "Any recommendations for a pizza making class in Naples?\n\nAlso a wine tasting tour that starts in Naples with hotel pickup and drop off.", "link": "facebook.com/groups/1373361046396315/permalink/2203206750078403/", "likes": 0, "comments": []}, {"id": "2203210833411328", "text": "Best cooking classes in Praiano/positano?\n\nI am staying in Praiano but I am close to positano and looking for an awesome cooking class to take during the day with great views and a lot of fun.\n\nI know the most popular is La Tagliata but it’s hard to get into and they are booked for the days I will be there. Is there any others anyone can recommend? Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2203210833411328/", "likes": 0, "comments": []}, {"id": "2203214270077651", "text": "Is it easy to get to the water taxi at the Venice airport? Walking distance? Or better to get a cab? We will have two large suitcases and a carry on to deal with. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2203214270077651/", "likes": 0, "comments": [{"username": "Bill Ulrich", "comment_text": "Alilaguna water bus will be considerably less expensive than water taxi. €15 instead of €150. Leaves every 30 min, all day long. Tickets and dock are right at the airport."}, {"username": "Dafne Vassetti", "comment_text": "No cabs/cars in Venice."}, {"username": "Paula Brink", "comment_text": "If you want a water taxi they are right there, not a long walk outside the terminal building.\nIt is a pretty fun way to arrive in or exit Venice!"}]}, {"id": "2203217653410646", "text": "I am currently in the process of duel citizenship (in America) before I continue in Italy. I am trying to figure out how long I need a lease for to apply for permesso? It seems like its a year, but has anyone signed a lease for 6 months and was able to get permesso?\nOr any recommendations for an immigration lawyer?", "link": "facebook.com/groups/1373361046396315/permalink/2203217653410646/", "likes": 1, "comments": [{"username": "Carmine Castiglia Jr", "comment_text": "I suspect it depends on the location. For example, I'm pretty certain that in Florence, a lease that would qualify for residenza must be 4+4 - four year term with four year renewal option."}, {"username": "Carmine Castiglia Jr", "comment_text": "Maybe helpful info about Italian leases:\n\nhttps://\nanamericaninrome\n.com/2021/01/\na-quick-guide-to\n-rental-agreeme\nnts-in-italy/"}]}, {"id": "2203219203410491", "text": "Trenitalia app doesn't work in Canada. That's what it said when I tried to install it. What do the Canadians in this group use instead?", "link": "facebook.com/groups/1373361046396315/permalink/2203219203410491/", "likes": 11, "comments": [{"username": "Jennifer Schum", "comment_text": "I just went through this yesterday when booking our trains for August travel. While I could use the Trenitalia website (and had to for one trip where they were the only provider), I much prefer to have an app on my phone that comes with me to Italy! I installed Italo Treno and was super please with how easy it was!"}, {"username": "Michele Levesque Semosky", "comment_text": "Omio!"}, {"username": "Jennifer Billesberger", "comment_text": "I use Omio"}, {"username": "Gillian O'Callaghan", "comment_text": "Same in New Zealand. I downloaded Trainline and used it before I left and for 5 months all over Europe (13 trips in Italy)."}, {"username": "Susan Polano", "comment_text": "I went to Rail Europe on a desktop and booked from there."}, {"username": "Dawn Ferris", "comment_text": "I saved the pdf file from my email confirmation in the files app on my iPhone. The bar codes are there so I’m hoping this will be OK"}, {"username": "Julienne Bourgeois", "comment_text": "Website or Rail Europe maybe?"}, {"username": "Susan Perrey", "comment_text": "Omio app works great!"}, {"username": "Jen Lundy", "comment_text": "I used the Trenitalia website to book upcoming travel. I will rely on the email confirmation and I've printed hard copies of the tickets in case I arrive in Italy and experience cell phone issues (internet connections, battery dies, etc)"}, {"username": "Miriam Griffin Woods", "comment_text": "You have to download when you get there"}, {"username": "Karen Gregorchuk", "comment_text": "Courtney Greg"}, {"username": "Venette Macalinao", "comment_text": "I used Trainline"}, {"username": "Pam Bouman", "comment_text": "Will be travelling from Sienna to the Port in Civitavecchia in October, what is the easiest (Least transfers) way to do this, bus or train?"}, {"username": "Liette Demanche", "comment_text": "Rome2Rio. I am from Quebec."}, {"username": "Camp Cole Mair", "comment_text": "I booked through website"}, {"username": "Alex Mewa", "comment_text": "Use a vpn, sign into a new google account, and only use for European app diwnloading"}, {"username": "Nancy Sunshine", "comment_text": "I used Italiarail and Trainline to book."}, {"username": "Sandra Munoz", "comment_text": "Omio app"}, {"username": "Anne Marie Busuttil", "comment_text": "Try Trainline app, I used it and it worked great"}, {"username": "Rita Benjamin", "comment_text": "Download Omio. You can buy all train and buses tickets from there."}, {"username": "Richelle Trezise", "comment_text": "Go to the website and book. Then when you touchdown in italy download it then. That what we are doing as Australians can't download it either"}, {"username": "Toby Levy", "comment_text": "Same in Australia but you can book online and download the app when you get there. Otherwise use italo app and website, better trains and app seems to work better in English"}, {"username": "Fiona MB", "comment_text": "Booked it all ahead on Trainline. Worked great!"}, {"username": "K M Uí Fhionnaláin", "comment_text": "Trainline app is very good"}, {"username": "Noelene Cameron", "comment_text": "Use Trainline app. You can book and store your tickets in the app. I used it throughout UK, Italy, France. We booked some before we left Australia.\n\nhttps://\nwww.thetrainline\n.com/"}, {"username": "Heather Sacco", "comment_text": "I ordered them on the Trenitalia website. They emailed me my tickets and I printed them off and saved them in my phone. Hopefully it works:)"}, {"username": "Ravi Mittal", "comment_text": "Omio works globally and reliable"}, {"username": "Patricia Hinse", "comment_text": "We used Italia Rail. It was perfect and service is good!"}, {"username": "Bill Bowler", "comment_text": "Ohio instead"}, {"username": "Alessio Esposito Inchiostro", "comment_text": "You can just go to www.trenitalia.\ncom"}, {"username": "Paula Brink", "comment_text": "Canadian here, I use the Trainline app. Have booked train trips in England Spain and Italy using it."}, {"username": "Naomi CP", "comment_text": "I used Italo treno and Omio app"}, {"username": "Shannon Confortin", "comment_text": "Trainline"}, {"username": "Sam Mah", "comment_text": "Definitely just register and use the online site."}, {"username": "Lisa Gillis", "comment_text": "I’m in Canada and the Omio app works great!"}, {"username": "Laura DeCicco", "comment_text": "I used Omio"}, {"username": "Vivien Paulik", "comment_text": "Use the website"}, {"username": "Voula Ladas", "comment_text": "Hi Nathalie it’s the same for us in Australia . Can’t get the App but I have used the Trenitalia website and just saved it to my Home Screen for convenience . Once you are in Italy ,you may be able to download the actual App. I was able to download load the App once I was in Italy last trip . Hope this helps ."}, {"username": "Monika Brzozowski", "comment_text": "Use it the website instead. It works perfectly"}, {"username": "Wendy Jean", "comment_text": "Omio"}, {"username": "Rocchina Rachel", "comment_text": "Omino. It even puts the ticket into your calendar and wallet (iPhone). Always print in case you don’t have wifi to load it if they check your ticket"}, {"username": "Karen Schmidt", "comment_text": "I just use the website."}, {"username": "Wendy Harrison", "comment_text": "How about just the Trenitalia website? It's what we used a few years back from Canada."}, {"username": "Fetchin Gretchen", "comment_text": "Not Canadian but Trainline app should work."}, {"username": "Genevieve Bastien", "comment_text": "Genevieve Bastien"}, {"username": "Genevieve Bastien", "comment_text": "I travelled from Canada and used the « Trainline » app and had no issues (5 trains in total throughout Rome Naples and Pompeii). Super easy to use. Have a great trip"}, {"username": "Giorgio Zanichelli", "comment_text": "download a vpn, use the trenitalia website or use trainline"}, {"username": "Liz Cooper", "comment_text": "I use Omio app"}, {"username": "John Wilson", "comment_text": "https://\nwww.trenitalia.c\nom/en.htmlv"}, {"username": "John Wilson", "comment_text": "Home PC"}, {"username": "Teresa Melanson", "comment_text": "We used Omio. It worked very well for us."}, {"username": "Line Gregoire", "comment_text": "Italo"}, {"username": "Katelin Jessica", "comment_text": "What about just printing the tickets from the trainitalia website and using that once there?"}, {"username": "Patricia Portas", "comment_text": "Tainline or the trainitalia website."}, {"username": "Desiree Leyden Kuhnlein", "comment_text": "I used trainline"}, {"username": "Sue Koloff", "comment_text": "I used Trainline"}, {"username": "Brenda Stanek", "comment_text": "The Omio app works great!"}, {"username": "Doni Eve", "comment_text": "I used the website. Can you download the app once you’re in Europe?"}, {"username": "Kris Ten", "comment_text": "I just came back from Italy. I purchased my tickets from the web page (not the app) and then used the QR code in my email for access to the train."}, {"username": "Debbie Dorion", "comment_text": "go directly on site works great."}, {"username": "Mario Torre", "comment_text": "Following"}, {"username": "Alessandro Iannelli", "comment_text": "I believe you can still use the website, Trenitalia.com"}, {"username": "Gilda Capraro", "comment_text": "The website should work, but I've been using Trainline with zero issues these last 2 years"}]}, {"id": "2203228963409515", "text": "We are 2-3 families with kids ages 8-17 planning a week in Piemonte next summer. Does anyone have any recommendations regarding acommodation and/or activities in this area? Like a cooking class for families, wine tastings or other things we shouldn’t miss out on? 😊", "link": "facebook.com/groups/1373361046396315/permalink/2203228963409515/", "likes": 2, "comments": []}, {"id": "2203213036744441", "text": "Discover Narni, one of the most beautiful villages in central Italy! Our local guide Patrizia will lead you through the fascinating alleys and Middle-Aged palaces of Narni to discover the beautiful Piazza deiआणखी Priori and the Romanesque cathedral of San Giovenale. You will explore a land of myths, legends and ancient history at the very centre of Italy!\nJoin our NEW virtual experience: https://nextstop-italy.com/virtual-tours/narni/\n\n#virtualworld #artlovers #art #vacationmood #history #italyiloveyou #italygram #italytravel #italytrip #medieval #medievalhistory #medievalart #medievalcastle #medievaltimes #medievalarchitecture #narni #narnia #chroniclesofnarnia #chroniclesofnarnia #hiddengems #hiddenplaces #magicalplaces #MagicalAtmosphere #umbria #umbriagram #umbrialovers #umbriatourism", "link": "facebook.com/groups/1373361046396315/permalink/2203213036744441/", "likes": 3, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2163920840673661", "text": "Private Sunset Cruise on amazing boat from Positano\nWatch the sunset on the Tyrrhenian Sea during a private evening cruise from Positano. Enjoy being out on the water and admire views of the coastline as you sip… आणखी a glass of Champagne.\nRead more: https://www.viator.com/tours/Positano/Private-Sunset-Cruise-on-amazing-boat/d33602-15259P9?pid=P00070587&mcid=42383&medium=link&medium_version=selector", "link": "facebook.com/groups/1373361046396315/permalink/2163920840673661/", "likes": 6, "comments": [{"username": "Elsa Ayala", "comment_text": "Amazing"}]}, {"id": "2203159053416506", "text": "DAY 10 - GROTTAGLIE AND MARTINA FRANCA BY NIGHT\nKnown for the production of artistic ceramics and the production of table grapes, Grottaglie is also called the “City of Ceramics”, for shopping, of course: head to Grottaglie’s craft shops in the historic center; the ceramics district is certainly what it has the most to offer and the handcrafted products are amazing!\nMartina Franca is an elegant town, a bit lesser known compared to other towns of Valle d’Itria but simply wonderful! Dom't miss an evening passeggiate here!\nWhere to stay: Masseria Trulli e Vigne\nA really beautiful masseria with lots of charm and character. Also very well located 10 minutes from Martina Franca and a good base to explore towns like Alberebello but also only 30 minutes from the Adriatic coast. Discover more:\nhttps://www.dpbolvw.net/click-100692842-11552042?url=https%3A%2F%2Fwww.tripadvisor.com%2FHotel_Review-g616186-d1875643-Reviews-Masseria_Trulli_e_Vigne-Martina_Franca_Province_of_Taranto_Puglia.html\n#apulia #grottaglie #grottaglieceramics #martinafranca #apuliatravels #apulianlife #apulianholidays #puglia #pugliagram #pugliaview", "link": "facebook.com/groups/1373361046396315/permalink/2203159053416506/", "likes": 8, "comments": []}, {"id": "2203153933417018", "text": "Get to know the real Florence on our immersive virtual tour!\n\nFlorence has a load of such hidden gems for you to explore! Enjoy this virtual walking tour with our native Florentine guide and discover a side ofआणखी Florence only locals know about and get lost among Florence’s streets where you can really feel the art and the history of Florence, as well as its unique ancient traditions.\n\nJoin our virtual experience: https://nextstop-italy.com/virtual-tours/hidden-florence/\n\n#florence #florenceitaly #florence #virtualworld #italyiloveyou #renaissanceart #medievalart #tuscany #italytrip #italygram #renaissancetour #history #VirtualTour #art #tuscanytrail #italytravel #pontevecchio #PonteVecchioFirenze #palazzovecchio #michelangelo #uffizigallery #museums", "link": "facebook.com/groups/1373361046396315/permalink/2203153933417018/", "likes": 7, "comments": []}, {"id": "2185176898548055", "text": "Paradise in Sicily!\nLocated in the charming bay of Taormina, the Mazzarò Sea Palace is a 5-star luxury hotel right on the seafront. The vicinity of the cable car allows you to reach the mediaeval centre of… आणखी Taormina and the Greek Theatre within minutes.\nDiscover more: https://www.dpbolvw.net/click-100692842-11552042?url=https%3A%2F%2Fwww.tripadvisor.com%2FHotel_Review-g187892-d254201-Reviews-Mazzaro_Sea_Palace_VRetreats-Taormina_Province_of_Messina_Sicily.html", "link": "facebook.com/groups/1373361046396315/permalink/2185176898548055/", "likes": 11, "comments": []}, {"id": "2203021693430242", "text": "Looking for tips, which cities to visit.\n\nHello all, we are going to Bari in the end of October for the wedding. Afterwards we are planning to drive up North to Venice.\nWe have around two weeks and we are travelling with a 2,5y old toddler. ☺️\n\nCan you share any of your favorite towns and other must-sees on this route? Thanks you! 🙏🏻☺️", "link": "facebook.com/groups/1373361046396315/permalink/2203021693430242/", "likes": 0, "comments": [{"username": "Agnese Arnó Ch-Ch", "comment_text": "I would stick with the Puglia region, it’s stunning (Polignano, Alberobello, Ostuni, Lecce, Otranto, Monopoli…) the sea should still be very pleasant and everything will be kids friendly!"}]}, {"id": "2203026466763098", "text": "I'm not one to put a lot of apps on my phone. My husband puts EVERYTHING on his. Haha!\n\nI'm wondering what apps (besides Google Translate or Google maps) you found most useful for your trip to Italy?\n\nOur phone plan offers unlimited data (although I think it's at 2G, instead of 5 so it will be slow.)\n\nThanks!", "link": "facebook.com/groups/1373361046396315/permalink/2203026466763098/", "likes": 35, "comments": [{"username": "Sally Jane", "comment_text": "Dino Faelis"}, {"username": "Kerrin Barassi", "comment_text": "Flush-tells you where 🚽 are"}, {"username": "Anne Gee", "comment_text": "Trenitalia, Whatsapp"}, {"username": "Kathleen Roll", "comment_text": "Il meteo (weather)\nTrentitalia\nGetmyGuide booking site\nThe photo is IT guides\nI also use Viator (but I don’t have that as an app) - another booking site for places\nThere is Omio for trains too but I prefer Trentitalia"}, {"username": "Sabiha Syed Shaikh", "comment_text": "Freenow. Register and keep it ready. You will need it in most dire situations. Google maps works without cellular. Map it and turn off cellular. All this on T-Mobile."}, {"username": "Sopra la Roccia", "comment_text": "Whatsapp"}, {"username": "Beverley Moysey", "comment_text": "I mostly used google maps for directions until we stayed in a place that had a road that closed to cars every day at 6 pm. Google maps couldn’t handle that and kept trying to route us through the pedestrian-only\nroad. That’s when I started using Waze instead and it was able to understand that!"}, {"username": "Ashley Czinege", "comment_text": "Google Maps to get around\n\nWhatsApp for communicating\n\nTranslator App\n\nTripAdvisor to find authentic restaurants and to avoid the tourist traps\n\nWaidy to find fresh water fountains\n\nAirBnB if you need to find a great place to stay"}, {"username": "Chris N Lynn", "comment_text": "Definitely download Translate and Maps for Offline use if you are only getting 2G speeds. Way better experience."}, {"username": "Fernanda Argomedo", "comment_text": "The fork!"}, {"username": "Rita Benjamin", "comment_text": "What’s app, Google translate, omio, your airline company app, bolt, Uber, freenow , Airbnb and get your guide.\n\nYou are good to go."}, {"username": "Cathy Oleevar", "comment_text": "I used the paid version of tripit! It's fantastic for adding in your tickets for everything, even send you reminders."}, {"username": "Grace Bates", "comment_text": "Thanks for all this advice"}, {"username": "Cathy Oleevar", "comment_text": "This question has been asked many times. Here's a link to a post with lots of app suggestions. https://\nm.facebook.com/\ngroups/\n1373361046396315\n/permalink/\n2198812547184490\n/\n?mibextid=2JQ9oc"}, {"username": "Anne Marie Skeen Johnson", "comment_text": "Following"}, {"username": "Anna O'Connor", "comment_text": "Trenit! App super useful for working out train trips."}, {"username": "Sophie Smith", "comment_text": "Omio for trains 🚆"}, {"username": "Claire Land Hamilton", "comment_text": "I love City Mapper more than Google Maps. It also works for local transportation and notifies you when it is time to get off."}, {"username": "Helen Read", "comment_text": "Easy park if you are driving"}, {"username": "Carol Hesham", "comment_text": "Bolt app or free now : like uber but cheaper\n\nVisit a city : an App to organize your itinerary\n\nOmio: to book trains"}, {"username": "Susan Noakes", "comment_text": "Catherine Crisp"}, {"username": "Juliette Dutton", "comment_text": "FreeNow is the preferred taxi/uber service in Italy. And CityMapper is best like a google maps but for european cities"}, {"username": "Elizabeth Hernandez Guajardo", "comment_text": "F"}, {"username": "Marianna Holloman", "comment_text": "We buy a SIM card when we land in Italy. That lets us use the phone more freely- local calls, data, etc…"}, {"username": "Meryl Whiteside", "comment_text": "If using what's app do you have to add hosts as a contacts? To be able to call. Struggled to get what's app to work in Bali."}, {"username": "Stephanie Lubin", "comment_text": "WAZE APP I think is better than goggle maps bc it shows where parking is located, gas station ect"}, {"username": "Cindy Schutte", "comment_text": "Trainline for purchasing train tickets.\nRome2 Rio for trip planning."}, {"username": "Carmela Losavio Wiltshire", "comment_text": "\"GetYourGuide\" 🙂"}, {"username": "Jenny Kendrick", "comment_text": "Wanderlog"}, {"username": "Kim Bliss", "comment_text": "Following"}, {"username": "Frannie Kaplan", "comment_text": "Not an app, but websites such as visititaly.eu and Romeing\nIf your phone is unlocked get an Italian or EU sim (that adheres to the EU roaming laws) for data, it'll be practical and cheaper.\nIf you know some one in the EU already you can get a mobile vikings sim already"}, {"username": "Donna Holt", "comment_text": "Google Wallet. Amd the train apps."}, {"username": "Fetchin Gretchen", "comment_text": "Most useful apps are moovit for public transport, get your guide for day trips, Airbnb for experiences or lodging, trainline for easy train tickets, a compass for use with Google maps, a flashlight magnifying glass for easy way ro see menus in dim lit restaurants, currency plus for what my purchases cost in dollars, whatsapp to text easily to hosts etc."}, {"username": "Christy Powers", "comment_text": "Question about bathrooms because I see the flush app- do we pay for public bathrooms? Also, are there toilet seats or something else?"}, {"username": "Brenda L A Berry", "comment_text": "I found it best to have the same app with the same login on both spouses phones. My husband thought his was stolen after a tour bus to a couple wineries (it wasn't, he put it in my front sling which was identical to his) and we worried as he had the realtor's info and his tower climbing tickets, plus no memory for his passwords, lol! I also realized it's best to download all apps at home, as they usually require text to confirm. I downloaded an Uber app while in Italy, but would have to remove my phone cover and switch sim cards to get the confirmation text, which is difficult on the move, in the moment. E-sim would have been easier to go back and forth. Live and learn. Best apps we used were hands down the train apps (never had to get tickets stamped), Whatsapp as all the hotels used it, Get Your Guide as we booked most tours through it. We video called home through WhatsApp and Facebook Messenger to talk to parents and kids."}, {"username": "Fleur de Liz", "comment_text": "Mark Mojica"}, {"username": "Gwen Erisman", "comment_text": "Trenatalia!"}, {"username": "Gary Fossaceca", "comment_text": "Rome2Rio! It’s the best app to get from place to place out there!"}, {"username": "Ben Poupard", "comment_text": "Trenitalia and Rick Steves Audio Europe, and I downloaded Google Maps offline in case I don't have signal."}, {"username": "Dawn Hofmeister", "comment_text": "I would add FREENOW, ItTaxi, bounce. Freenow and ItTaxi were helpful and cheaper than Uber. Bounce was great when looking for a place to stash our luggage for a bit."}, {"username": "Catina LaBorde Drouillard", "comment_text": "If you are going to tour the coliseum in Rome then I would download Rick Steves app on Italy. You can listen to a much more interesting tour than the one provided at the entrance. I'm sure he has more interesting things on that app. I just remember that one."}, {"username": "Sherri Leis Dillavou", "comment_text": "Atlas Obscura…. Found some interesting unusual things to see"}, {"username": "Daisy Yoo", "comment_text": "I also have TicketAppy , so I can get days or one trip metro/tram/bus ticket and just scan"}, {"username": "Jeanne Santomauro Schnupp", "comment_text": "Currans. On Lincoln. The best. Ask for Harry or Ryan"}, {"username": "Laurie Ingram Bain", "comment_text": "RometoRio, booking. Com, GPS My city"}, {"username": "Jules Reid", "comment_text": "F"}, {"username": "Linda Schauer", "comment_text": "Tony Schauer"}, {"username": "Eddie Vy", "comment_text": "Rome2rio"}, {"username": "Lauren Dahlberg", "comment_text": "Rome2rio"}, {"username": "Brenda Barrett Dunphy", "comment_text": "Definitely goggle maps I used it every day in Rome 😁"}, {"username": "Barbie Phillips", "comment_text": "Curious…do you have T-mobile?"}, {"username": "Miyuki Kanno Paul", "comment_text": "•Google Map\n•ViaMichelin (if driving)\n•Trenitalia\n•Italo"}, {"username": "Karen Casey", "comment_text": "I was just in the US for three weeks and had a SIM card with 6 KB. We both had the same amount, it was not enough. Get an unlimited one, you will need it!"}, {"username": "K M Uí Fhionnaláin", "comment_text": "Google wallet you can store some tickets in it ie concert tickets and probably tour tickets."}, {"username": "K M Uí Fhionnaláin", "comment_text": "Also Trainline and Moovit"}, {"username": "Sue Levy Avinir", "comment_text": "A few people recently posted a whole list of apps. Search this group. Highly recommended."}, {"username": "Olivia Whitehead", "comment_text": "Uber, what’s app, fork, Google maps."}, {"username": "Matt Bechtold", "comment_text": "WhatsApp, Google Translate, Google Maps, Booking.com (used for almost all of my stays), GetYourGuide (to book tours, etc), Stasher (to ditch luggage safely in cities without an overnight), Trainline (to book train travel), RideMovi/Lime/\nBird (to rent e-bikes/\nscooters)."}, {"username": "Sigridur G. Ingvadottir-Walters", "comment_text": "Hi I’m traveling to Italy in September and am looking for accommodation for 5 days, from the 19th to the 24th. I’m going to Tuscanny and would like a place somewhere between Lucca and Florence. Off the beaten track, romantic, rustic, but with a pool.\nCan anyone recommend links.\nX"}, {"username": "Karen Gregorchuk", "comment_text": "Courtney Greg"}, {"username": "Donna Kate", "comment_text": "I read flush is good for finding toilets and fontanelle for finding fresh water stations, I've downloaded those for when we arrive in a couple of weeks"}, {"username": "Nydia Bryan", "comment_text": "I like Wanderlog so I can keep everything(tick\nets, hotel, air) in one spot\nBut in case I lose my phone I will give husband all info. How he stores it is up to him 😁 it will probably be 25 apps 😁"}, {"username": "Jan Armstrong", "comment_text": "Uber - incase you get sore feet. They are great in Rome"}, {"username": "Stephanie Smith", "comment_text": "The local train app, TripIt for keeping everything together, and rome2rio"}, {"username": "Colleen Jennings", "comment_text": "Wallet for your credit/bank cards. Really useful as you don’t need to carry cards."}, {"username": "Sephora Cutajar", "comment_text": "Uber, ITtaxi, Deliveroo, trenitalia, rome2rio"}, {"username": "Jill Medrano Casey", "comment_text": "Uber, Whatsapp, Trenatalia"}, {"username": "Don Dennis", "comment_text": "F"}, {"username": "Michelle McDonald Mertens", "comment_text": "I haven’t used it in Italy, but have in other countries in Europe… GPSmycity."}, {"username": "Alessandro Iannelli", "comment_text": "Fountains in Italy"}, {"username": "Suzanne Caprio", "comment_text": "Also WhatsApp"}, {"username": "Valerie Goulds", "comment_text": "Roman numeric translation app"}, {"username": "Mary Agozzino Derrick", "comment_text": "Definitely add WhatsApp it's how everyone communicates here"}, {"username": "Carine Boon", "comment_text": "ilmeteo.it to know the weather hour per hour."}, {"username": "Alana Marie Sult", "comment_text": "Alana Marie Sult"}, {"username": "Alana Marie Sult", "comment_text": "Alana Marie Sult"}, {"username": "Jeff McLellan", "comment_text": "iLMeteo for weather was great"}, {"username": "Lauren Wasson", "comment_text": "F"}, {"username": "Sandra Todd Coffey", "comment_text": "Sandra Todd Coffey"}, {"username": "Chelsea Cox", "comment_text": "CityMapper!"}, {"username": "Jodie Dean Westfall", "comment_text": "TheFork - lists restaurants (though we didn’t find them hard to come by at all)\n\nFlush - lists restrooms nearby\n\nThere is also an app that lists water fountains, but I can’t remember the name\n\nLime or Bird - if you think you may want to use an electric scooter (we did several times)\n\nMobile Passport Control - when flying back home (this saved us a lot of time and less time standing in line)\n\nAirline App - helps to stay up to date on flights"}, {"username": "Sheryl Stessman", "comment_text": "Fork app to help with restaurant reservations."}, {"username": "David King", "comment_text": "I swear by “GlobeConvert Currency and Units”\n\nThis app will give you up to date currency conversions, calculate distances (miles vs km, weights and measurements)… I use it every time we travel, the world over."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Rome2Rio\nAround Me\nUber\nWhatsApp\nGoogle Maps"}, {"username": "Joan Adams Schilling", "comment_text": "The Maps.me is a saving grace no matter what city you are in. Walk in real time and you don’t need to be connected to data as along as you have loaded the city into your app before you start"}, {"username": "Toni Quatrini Bannister", "comment_text": "Omio and Trenatalia"}, {"username": "Meredith Holloway Helbon", "comment_text": "Following"}, {"username": "Nina Truong", "comment_text": "F."}]}, {"id": "2203061636759581", "text": "My wife loves artichokes. What are your recommendations for great places to eat this in Rome?", "link": "facebook.com/groups/1373361046396315/permalink/2203061636759581/", "likes": 2, "comments": [{"username": "Stella Dee", "comment_text": "It’s not artichoke time."}, {"username": "Meredith Williams", "comment_text": "we had some in the jewish ghetto!"}, {"username": "Andrea Shelton", "comment_text": "It’s not the season for them. Romanesco Artichokes are in season February to April."}, {"username": "Jamie Bly", "comment_text": "The Italians eat very seasonal."}, {"username": "Meghan Tan", "comment_text": "It’s not artichoke season. It’s nit like the US to have all types of produce year round."}, {"username": "Debbie Vinecour Halperin", "comment_text": "Jewish ghetto"}, {"username": "Mary Skvarch", "comment_text": "Jewish quarter! My mouth is watering just thinking about them!"}, {"username": "Deborah Larsen", "comment_text": "You will have to Wait till fall. We get them in spring and fall. That’s is harvest season"}, {"username": "Alessandro Iannelli", "comment_text": "Seeing as we are in the summer, the earliest you can find artichokes is in October -november, because in the southernmost areas of the country they grow in two different periods (the other one being in spring, as others have pointed out). But I don't know if the artichokes that grow in the south in the fall are also sold in Rome (to be honest, for all I know it's possible that in Rome they are cultivated in the fall, too, like in the much of the south)."}, {"username": "Christine Sanci-Gentile", "comment_text": "Il Matricana. Delicious!"}, {"username": "Carola Blödgen", "comment_text": "I love them too"}, {"username": "Cassandra Goodgame", "comment_text": "I had the best ones in the Jewish quarter. Little bitty fried ones! Yum!"}, {"username": "Michelle Rovere", "comment_text": "Just saw on Stanley Gucci’s program that they are a specialty in the Jewish Ghetto…"}, {"username": "John Bruckman", "comment_text": "They are out of season now you won’t find them… must wait until fall."}, {"username": "Elena Innocenti", "comment_text": "Fattoincasa in via del governo vecchio, near piazza navona. Fried, “alla Romana”(stews) or “alla giudia” (very typical Roman fried style). But the best period is from january to may."}]}, {"id": "2203066943425717", "text": "First time to Rome...thinking of renting e-bikes to tour around Rome in mid-October, but have been told it's not a good idea - any thoughts from those who have done this?", "link": "facebook.com/groups/1373361046396315/permalink/2203066943425717/", "likes": 2, "comments": [{"username": "James-Kathy Dickerson", "comment_text": "No...the golf cart tour would be a better option"}, {"username": "Tad Hashimoto", "comment_text": "Traffic in Rome is nuts.\n\nWe did a lot of e-scooter rentals, and I wouldn't recommend it if you're even remotely timid or not used to heavy city traffic. There is very little margin for error, and the risk is very high.\n\nE-bikes are even more of a risk because they take up more space, have to be ridden on the street, and you can't just jump off the road quickly to get out of the way of traffic."}, {"username": "Kate Carberry Ansart", "comment_text": "I wouldn’t recommend driving or biking in Rome. 😳 We walked everywhere and it was lovely - especially in the morning when the city isn’t crowded."}]}, {"id": "2203061786759566", "text": "can anyone recommende a great wine tasting toyr from Ravello?", "link": "facebook.com/groups/1373361046396315/permalink/2203061786759566/", "likes": 0, "comments": [{"username": "Judy Jamieson Pisano", "comment_text": "There aren’t many wineries on the Amalfi coast. You will have to by Vesuvius for a few, or into Campagna."}]}, {"id": "2203075426758202", "text": "Hi All, we have a trip planned for July 2024. We are staying in Rome for 2 nights then heading north to verona area for 8 nights. I have been looking at the train ticket prices from Rome to verona and these are coming out around €60-€65 per person one way. Does this seem about right. Been to Italy a couple times but first time using train. We will also have our luggage, will we be ok travelling with it all on the train to verona. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2203075426758202/", "likes": 5, "comments": [{"username": "Colleen Jennings", "comment_text": "Hi. Have a look on trentitalia.it.\nPut in your dates & you’ll see various options depending on the time of travel & the class of seat. Abd if you’re a senior, student etc you can book a discounted ticket. And you’ll be fine with your luggage. There are luggage racks above the seats & usually there are racks for larger cases. Verona is lovely. Enjoy your trip."}, {"username": "Alice Francesca", "comment_text": "Verona for 8 nights..you will have heaps of time.Venice, Padua, Lake Garda"}, {"username": "Vanessa Durkin", "comment_text": "Trenitalua and omio for best prices"}, {"username": "Louis Des Forges", "comment_text": "Look at Italo can see tickets for 21.90€ but you can only buy up until December. You probably won't be able to buy a ticket until around April. If you are staying in Bardolino Peschiera is a closer station and there is a bus direct to Bardolino."}, {"username": "Bea Kuckens", "comment_text": "The ticket pricing is somewhat based on time of day - the least popular times can often have lower fares. That said, those rates are reasonable but you might save 10-15 going at a different time (look at The Trainline for all options). As for the luggage, the less you have and the lighter it is, the better. The trains are rarely level with the platform so you have to lift your luggage up 2-4 very steep steps (and some train cars have two levels). The train platforms can be very long so be prepared for a good bit of walking. There is storage at one end of each coach for larger bags and overhead racks above the seats for smaller items. It is all first-come, first-served so keep that in mind. We have traveled all over Europe on trains and love it, but in our late 60's the luggage thing is getting a little old ;)"}, {"username": "Wendy Byrnes", "comment_text": "Buy 1st class with reserved seating - it’s not worth the hassles - competing for a seat and luggage space. Arrived home 4 days ago."}]}, {"id": "2203018040097274", "text": "Which small town experiences with lots of shopping and good food near Rome would you recommend.", "link": "facebook.com/groups/1373361046396315/permalink/2203018040097274/", "likes": 1, "comments": []}, {"id": "2203019780097100", "text": "We are travelling to Italy in September. We fly into Milan and have decided to cover down as far as Florence or Perugia by train ideally. Advice please on must visits. I have an outline agenda of: Milan (stay 6 nights but inc day visits to Venice, Lake Como, Cinque Terre); Bologna (2 nights); Florence/Tuscany (6 nights); Perugia/Umbria (6आणखी nights). We have 2 or 3 days spare if we should stay more in a place or include somewhere else. We are foodies and love strolling round towns finding interesting buildings/streets eateries, bars etc en route.", "link": "facebook.com/groups/1373361046396315/permalink/2203019780097100/", "likes": 2, "comments": [{"username": "Scott Perry", "comment_text": "If you like cocktails, go to Guero in Bologna."}, {"username": "Claire Dowson", "comment_text": "Milan to Venice will take over 3 hours by train. Lake Como is doable if you train to Varenna, boat to Bellagio, then back to Varenna for a return train. Personally it sounds too rushed. Commented on both places as have just been."}, {"username": "Lauren Swanteck Myler", "comment_text": "You can’t really day visit Venice. It’s too far. You def don’t need more than a couple of nights in Milan. Maybe consider taking the train to Venice and staying 2 or 3 nights there. If it were me, I would spend one night in Milan and then go to either Lake Como or Portofino, then go to Venice for 2 or 3 nights. Definitely will want at least 3 nights in Florence. In Tuscany, pick a home base, then rent a car. Can see a lot of towns and the driving outside the busy areas is pretty easy."}, {"username": "Anita Clayton", "comment_text": "I would do 2 or 3 nights in Milan and visit Como for a day. 2 nights is fine for Bologna and maybe 2 in Venice. Better to visit Cinque Terre from Florence."}, {"username": "Pam Gerretsen", "comment_text": "Castiglione del Lago - beautiful town on Lago Trasimeno, with some great food. Train station is not too far from town. Try L'Angelo del Buon Gustaio, and Pescatore cafe by the lake for an afternoon cocktail! Also, Cortona, Castiglion Fiorentino, and Perugia old town is lovely too!"}, {"username": "Paola Bersano", "comment_text": "Venice deserves more than a day excursion, staying the night is really worth it, Venice is pure magic and there are very little tourists"}, {"username": "Bea Kuckens", "comment_text": "Long day trip to Venice from Milan - about 2.5 hours each way by train. Just stay in Como for the lake area, then stay in Verona for Venice and Lake Garda (and Verona itself). Verona to Venice is only about an hour."}, {"username": "Annette Fordyce", "comment_text": "Perugia is amazing. The old part of town is beautiful and not crowded. It makes a great base for day trips to Assisi, Spello, Spoleto, Gunia, Orvieto, or Lago Trasimeno. In Perugia there is an Etruscan well, Rocca Paolina, a tour of Etruscan ruins, the Galleria of Umbria, and numerous old churches. My favorites are the Bsailica if St. Peter and the Church of St. Michael the Archangel, which is near an old tower set in to the city wall. Sandri’s is excellent for espresso and pastries, and La Taverna, Osteria di Priori, and Ristorante Altromondo are good restaurants. I was just in Perugia in May. We spent five days there and I could have spent a lot longer there!"}, {"username": "Glenn Todd Webb", "comment_text": "Stressa on Lake Maggiore. See palazzo Borromeo and palazzo madre"}, {"username": "Sally Warren", "comment_text": "Assisi is great"}, {"username": "Mi Sh", "comment_text": "Liguria is definitely beautiful and doable from Milano 👌🏼we are also flying into Milano at the same time."}, {"username": "Roland Trego", "comment_text": "Milan is too far for a day trip to Venice. Check your train travel times at rome2rio . com. Also, it's going to be hard to see much in Umbria by train only. Milan 1 day. Santa Margherita/\nPortofino/\nCamogli/Cinque Terre 4 days. Florence 2 days. Siena, Lucca, San Gimignano 3 days. Perugia & Assisi 2 days. Bologna 1 day. Venice 2 days. Lake Como 3 days."}, {"username": "Daisy Yoo", "comment_text": "I base Bologna when I visit Venice , Verona , padova , Rimini San Marino etc"}, {"username": "Carol Burns", "comment_text": "Thanks so much everyone! We started to look at train times after posting and realised some things that had been shown as day trips really weren't feasible! Thanks for confirming and for all your ideas!"}, {"username": "Lucrezia Folger", "comment_text": "Why so much time in Milan? Milan is basically an industrial city with a few historic attractions, but as a home base, seems a waste. Why not first 2 nights in Milan, then stay in Florence/\nTuscany for 6 nights, Venice for 3 nights, Cinque Terra for 3 nights, Largo Como for 3 nights, Bologna for 2 nights, Orvieto for 2 nights, and the rest in Roma."}, {"username": "Laura DeCicco", "comment_text": "Get the Rome2rio app so you’ll have realistic travel lengths and plan from that"}]}, {"id": "2203021523430259", "text": "Recommmendations for a small town close to Rome with lots of good shopping and food.", "link": "facebook.com/groups/1373361046396315/permalink/2203021523430259/", "likes": 19, "comments": [{"username": "Agnese Arnó Ch-Ch", "comment_text": "Small town near Rome I would say Orvieto, but also Tivoli is really nice."}, {"username": "John Bruckman", "comment_text": "Orvieto"}, {"username": "Lora Ruscitti Covington", "comment_text": "Travestere is lovely! Great restaurants and charming!"}, {"username": "Ville Lignell", "comment_text": "Viterbo, Civitavecchia, Bracciano, Palestrina, Castelgandolfo?\nDon't know what you mean by 'good shopping' but the local food is great anywhere."}, {"username": "Neaţă Maria", "comment_text": "Lido di Ostia ❤️"}, {"username": "Cindy Sguazzin", "comment_text": "I loved Tivoli—fascinat\ning history, beautiful ambiance—old villas, waterfalls, gardens etc."}, {"username": "Herbert Maritschnik", "comment_text": "Orvieto ❤️👍🏻"}, {"username": "Vicky Andrawis", "comment_text": "Lido di ostia"}, {"username": "Luca Lookone Ferrentino", "comment_text": "What kind of shopping are you craving for? If it's clothes, just go to Valmontone Outlet, it's half an hour outside Rome, I think there are also shuttle buses from Rome centre."}, {"username": "Sandra Mueller-Hofner", "comment_text": "Sperlonga is beautiful 😘"}, {"username": "Thelma Gipson", "comment_text": "Orvieto"}, {"username": "Car Amanda", "comment_text": "Tivoli"}, {"username": "Catherine Briggs", "comment_text": "Orvieto"}, {"username": "Beasy Martin", "comment_text": "Kerry Aldred, some ideas?"}, {"username": "Jamie Keeling Hurley", "comment_text": "Following"}, {"username": "Sarah Reed", "comment_text": "Heather Sturgill"}, {"username": "Susan Shaffar-Redding", "comment_text": "Orvieto"}, {"username": "Jennifer Gustafson", "comment_text": "San Gimignano was my favorite! Beautiful winery with pairings there also.\n\nhttps://\nwww.marronaia.co\nm/\n?gad=1&gclid=Cj0\nKCQjw2qKmBhCfAR\nIsAFy8buL4ht8ct\nnjEI4KosHkzuFCO\nMXa1bAE3wLrUxUx\nxTGu_ugBirJ1Isy\n8aAvjLEALw_wcB\n\nIf that’s too far out make sure to visit the Trastevere section of Rome."}, {"username": "Bernadette Johnstone", "comment_text": "Orvieto - lovely shops, great food and a super cute place."}, {"username": "Junko Osaki", "comment_text": "Tivoli or the Castelli Romani area"}, {"username": "Adele Truman", "comment_text": "Frascati is truly Italian. Hardly a foreigner to be seen. Italians will drive here from Rome for dinner. It's quite a treasure."}]}, {"id": "2203022390096839", "text": "Let’s see what Facebook can do. David and I were in Venice last week and took a Gondola ride. We passed several people and we came across this beautiful couple. We both laughed and said to one another “ take aआणखी picture and airdrop it. “ Of course our airdrop wasn’t fast enough as our rides past by each other. I thought I would take a chance and see if this picture will find this wonderful couple through Facebook. So please share this post and help me find them. Thanks! 🇮🇹❤️🎉#italy2023 #gondolaride #veniceitaly", "link": "facebook.com/groups/1373361046396315/permalink/2203022390096839/", "likes": 695, "comments": [{"username": "Brenda Barrett Dunphy", "comment_text": "Love this ❤️"}, {"username": "Maria Molfese", "comment_text": "Love this!❤️"}, {"username": "Lynn Boykin Mancias", "comment_text": "A beautiful photo! I hope it finds them ❤️"}, {"username": "Amy Carter Bland", "comment_text": "Ruth Tanner Wilkins I posted and shared here! Good luck finding them!"}, {"username": "Jenny Meffert", "comment_text": "Such a joyful photo."}, {"username": "Calvan Luu Wurth", "comment_text": "Love the joy in this picture!"}, {"username": "Linda McShane Payne", "comment_text": "They look so happy!"}, {"username": "David King", "comment_text": "They look like fun!!! And the airdrop feature has been a game changer for vacation pic sharing.\n\nThough I have mixed feelings about posting strangers’ pictures on social media without their knowledge or consent. What if they are on a trip but they don’t want other people in their lives to know specifics?For a variety of reasons… job, children, etc…"}, {"username": "Carrie Lamm Bishop", "comment_text": "Please let us know how it turns out!"}, {"username": "Marion Daku", "comment_text": "Marion Daku"}, {"username": "Pat Packard", "comment_text": "What a sweet gesture! Looks like they are having a great time."}, {"username": "Ele Mitchell", "comment_text": "What a fab idea!!!"}, {"username": "Nai La", "comment_text": "Such a cute happy couple"}, {"username": "Phyllis Snyder", "comment_text": "Too cute!"}, {"username": "Roger Pajo", "comment_text": "How awesome!!"}, {"username": "Barbara Nyberg", "comment_text": "Happy time"}, {"username": "Anna Del Borrello Maher", "comment_text": "That is s fantastic photo 😃"}, {"username": "Natalie Cook", "comment_text": "Would love to know if it eventually reaches them ❤️"}, {"username": "Jackie Bottenberg Evans", "comment_text": "Really people. Chill out. I’m sure it’s fine"}, {"username": "Paulyn Hoffman", "comment_text": "So adorable😊"}, {"username": "Cassandra Lee", "comment_text": "Love this idea!"}, {"username": "Rhonda Pritchett Adams", "comment_text": "What a great picture!!"}, {"username": "Meg Bowen Beauchamp", "comment_text": "I hope you find them!"}, {"username": "Teresa Martino", "comment_text": "I love this!! I hope you find each other!!!"}, {"username": "Janelle Caire", "comment_text": "Janelle Caire"}, {"username": "Nicole Alexander Taule", "comment_text": "Please update here if you catch up with them! 😊"}, {"username": "Michaela Rauscher", "comment_text": "They look like an amazing couple !"}, {"username": "Virginia Sudol", "comment_text": "Virginia Sudol"}, {"username": "Janet Molina", "comment_text": "Sweet!!"}, {"username": "Suzanne Meola", "comment_text": "So happy enjoying that special moment in time!!!"}, {"username": "Megan Leigh", "comment_text": "This is so great!"}, {"username": "Tracey Lawrence VanSickle", "comment_text": "Love this and hope that when we are in Venice soon we experience this as well!!"}, {"username": "Cindy Breneman Hattrich", "comment_text": "So adorable!"}, {"username": "Julie Hinton", "comment_text": "Julie Hinton"}, {"username": "Pam Gerretsen", "comment_text": "They are thoroughly enjoying themselves, what a fab photo!"}, {"username": "Krissy DaRusso", "comment_text": "Awwww! I really hope this works out. That is such a joyful photo!!"}, {"username": "Jack Giacomo Avondo", "comment_text": "Jack Giacomo Avondo"}, {"username": "Jill Cherrier", "comment_text": "Truly enjoying the experience and the moment💕"}, {"username": "Alexandra A Welker", "comment_text": "This is awesome! I hope this photo will find them."}, {"username": "Alicia Cox", "comment_text": "Fun! Hope you find them!"}, {"username": "Paul N Marietta Dodson", "comment_text": "Its great to see people enjoying Venice. 💝"}, {"username": "Emilia Borelli", "comment_text": "I love this photo. ❤️"}, {"username": "Claudine Auclair", "comment_text": "Awesome photo! They sure look like they’re having a good time!"}, {"username": "Angel Leckner", "comment_text": "Love it!! I would love to hang out with them as they sure look like they know how to have fun 💕💕🎉🎉"}, {"username": "Varushka Gabyson", "comment_text": "Ojalá llegue a ellos"}, {"username": "Tana Muraro Sheets", "comment_text": "I love this. Happiness at it’s best."}, {"username": "Margie Williams", "comment_text": "Haha! So cool. Love your idea!"}]}, {"id": "2203023943430017", "text": "Just back from a month in Italy, went to the most wonderful Montalero cooking classes in Piemonte.", "link": "facebook.com/groups/1373361046396315/permalink/2203023943430017/", "likes": 0, "comments": [{"username": "Meghan Tan", "comment_text": "Can you share the information for the cooking class? I will be staying in Turin for a week in September. Thank you!"}]}, {"id": "2203024516763293", "text": "I took this in Verona May 2022. It was 90 degrees and we all cooled off in the fountain", "link": "facebook.com/groups/1373361046396315/permalink/2203024516763293/", "likes": 0, "comments": []}, {"id": "2202615140137564", "text": "I know many people have posted that vendors in Italy are not legally allowed to offer you one price when paying by credit card and a lower price when paying in cash. So it totally surprised me when I just got an email from our hotel that we booked back in January in Sorrento (an upscale hotel) offering us a lower price if we pay via cash. Like over 300 euros cheaper! I did not ask for this, they just sent me an unsolicited email. My first thought was to ignore it but saving over 300 euros is intriguing.", "link": "facebook.com/groups/1373361046396315/permalink/2202615140137564/", "likes": 19, "comments": [{"username": "Janette YesPlease", "comment_text": "The vendor has to pay a commission to the credit card company when you use your card, so they will likely offer a discount to the consumer if cash is used instead. This is also part of the reason why American Express isn't used that much throughout Europe since their fees are much higher than Master Card or Visa."}, {"username": "Gianna Onesi", "comment_text": "That doesn't sound legal. It's like paying for something under the table they want to avoid taxes!"}, {"username": "Don Bentivoglio", "comment_text": "A lot of assumptions about motivation of the vendor going on. Many vendors in the US offer discounts (usually between 3% and 5%) if you use cash or a debit card. If you feel uncomfortable, just use your credit card."}, {"username": "Francesca Alessandri", "comment_text": "Please don’t pay them under the table. I know it could be extremely intriguing but it is so common (unfortunately)\naround well-known places especially with foreign tourists. They want to avoid taxes."}, {"username": "Janine Emma Lucas", "comment_text": "If they’re willing to give you a receipt, yes"}, {"username": "Kathryn Healy", "comment_text": "This is super common. You can usually negotiate 3% off (what the hotel would pay for credit card fees) plus an additional discount if it’s a smaller hotel (non-chain)."}, {"username": "Sylvia Jenkins", "comment_text": "That’s the same anywhere isn’t it? always cheaper if paid in cash 🤷‍♀️"}, {"username": "Joanne-Peter Hart", "comment_text": "In Australia some hotels ask you to book directly through their website and charge less because the booking sites take their commission, but they use them as part of their advertising. Not uncommon. Still can book online with your credit card."}, {"username": "Karin Carmignani", "comment_text": "After reading so many posts about having reservations cancelled at the last minute and various other negative experiences like mold in room, etc., I'd be hesitant to pay cash and have no recourse --like disputing a charge on a credit card--if something goes wrong. Paying by credit card offers at least some insurance and peace of mind, which may be worth $300. 😉"}, {"username": "Leopoldo Conti", "comment_text": "OTA commissions are generally between 18-22%,\nVAT in Italy is 10% do your math"}, {"username": "Mario Torre", "comment_text": "I pay cash only if on site, once at hotel and at the end of my stay. In addition, when I reserve through some platform, I always verify the price by going directly through the hotel and book the cheaper one, obviously with no penalty cancellation."}, {"username": "Grace Sulsenti", "comment_text": "Perhaps the original charge was incorrect.\nSo, it is being adjusted."}, {"username": "Alice Francesca", "comment_text": "Welcome to South of Italy! They probably are trying not to pay taxes.\nDon't fall for it."}, {"username": "Lisa Adams Robertson", "comment_text": "The place we have booked (Venice) sent us info that said if we pay by credit card they will have to charge 2% more. They are a small business and prefer we pay either partially, or fully in cash. Not sure how we will pay, yet (trip is in October)."}, {"username": "Lucrezia Folger", "comment_text": "Sure, why not. Been there and done that, a variety of businesses. pretty much anywhere in the world if you pay in cash you get a better deal."}, {"username": "Eva McLean", "comment_text": "I wouldn’t assume it’s a scam … unless they’re asking you to pay cash upfront before arrival. Then, it’s definitely a hard no."}, {"username": "Matthew Iaco", "comment_text": "Cash is always King 👑"}, {"username": "Jennifer Smith", "comment_text": "That is probably what they will save on credit card fees. They should give you a receipt on checking out. I would not worry about it as long as you can pay when you get there."}, {"username": "Susan Weitzenfeld Rosen", "comment_text": "I inquired with a private driver and the price in euros cash was about 100 euros lower than credit card price, but it’s my choice which to choose"}, {"username": "Ruth Akutu Maccarthy", "comment_text": "Please tourists coming to Italy, if you really love Italy pay by card and not cash. These people are trying not to pay taxes as they'll not declare they payment.\nIt is true taxes are high in Italy but that guarantees health assistance, helping of disabled people, helping poorer families, pay police, 🚒, ambulances, teachers...it keeps the country moving. In addition if more businesses don't pay taxes it will rise for those who pay.\nPlease pay by credit card, thank you"}, {"username": "Nancy Day", "comment_text": "Call the hotel ,verify ,get a name and email to you so you have proof"}, {"username": "Caroline Nasrin Afzal", "comment_text": "Why ignore it? I would accept it"}, {"username": "Anita Gopal Pharand", "comment_text": "I was researching hotels and I recall one hotel offering 10% off if paying by cash. I dint recall which one."}, {"username": "Melanie Diaz", "comment_text": "This is totally normal !\nIt’s not a scam !"}, {"username": "Marie Payne", "comment_text": "so places like booking.com charge them fees...I sometimes check these sites out and then contact directly to see what they would charge for direct...."}, {"username": "Ilana Brongiel", "comment_text": "Our B&B in Venice is asking for cash payment on arrival but saying they will charge 3% if we choose to pay by card. Thinking they are just passing on the cc fee."}, {"username": "Mary Balistreri Swan", "comment_text": "Was it legit?"}, {"username": "Cynthia Marie", "comment_text": "Yes of course, credit card charges are around 5% plus a per transaction fee.\nWe offer a discount when paying in cash or check to avoid a credit card fee . We are in the U.S. but I’m sure the fees are comparable. At the end of the month small dollars add up to big dollars."}, {"username": "Bev Nolen", "comment_text": "Careful, sounds like a scam"}, {"username": "Bellisima Sempre Adriana", "comment_text": "Can someone find the law in Italy for this so I can read up on it. If you can send me link I would greatly appreciate it.😍"}, {"username": "Trace Barron", "comment_text": "Sounds like a scam to me. I'd call the hotel to confirm"}, {"username": "Alessandro Battxi", "comment_text": "Remember, when you pay with cash, most of the time is not tracked. So if you have any issues, there won't be any transactions to claim or complain, plus they are not paying the taxes.\nEven some GPs are doing this (I'm an Italian living abroad) and if they say to me \"600 euro or 350 with cash\", I just start to argue with them to call 117 (Guardia di Finanza). Then I'll ask for the 350 with a card 😂.\n\nSounds like a scam to me as well."}, {"username": "Julia Podgórska", "comment_text": "It is illegal, but it is practice, cause money is not tracked, they probably don't pay taxes etc out of it"}, {"username": "Julia Podgórska", "comment_text": "But at the same time, that really may be a scam. Not sure how it supposed to work tho"}, {"username": "Blanche Glenn Welborn", "comment_text": "Was it the Continental? They did that to me and acted so weird and shady about it when I agreed and tried to pay. Like I was participating in some big scheme."}, {"username": "Rita Levi Montalbano", "comment_text": "Please report this to the police or in the reviews if you can, they just want to avoid paying taxes."}, {"username": "Carla Johnson", "comment_text": "Don't know if it's to avoid taxes or a scam, what do know from experience is that credit card companies charge a fee to merchants and those add up, I see our monthly statement from the bank where i work. Some of the small business owners of restaurants charge 3%to your bill if paying by credit/debit card."}, {"username": "Cecilia Christine Costantini", "comment_text": "Ask if you can get a fattura/\nricevuta fiscale (invoice) even if you pay cash. If they are willing to give you one, then it is possible the original higher price was through some sort of booking platform and they had to pay a % to a third party. If they say no to a fattura, then they are trying to avoid paying taxes."}, {"username": "Esther Steinbok Sustersich", "comment_text": "My hotel says it clear as day on website. Cash - 5% off"}, {"username": "Lorena Scopelliti", "comment_text": "Guys, always ask to pay by digital payment. After have said hello, ask for digital payment everywhere you go."}, {"username": "Frannie Kaplan", "comment_text": "If you already booked, why did they ask you now? It could be a scam. Anyway 300 eur sounds tempting but so does a safe space to sleep in so I wouldn't bother"}, {"username": "Veronica Parravicini", "comment_text": "They’re called “evasori fiscali”\nThey use cash as it’s not traced and they can avoid paying taxes, that’s why they can guarantee you a lower price\n(It’s a criminal offence though🥲)"}, {"username": "Romina Lauretig Toscano", "comment_text": "Welcome to Italy :)"}, {"username": "Terry Pisano", "comment_text": "People saying this could be a scam... explain how that works..."}, {"username": "Linda Yahn", "comment_text": "My Italian son in law says their government has a hand in this based on the incredibly high taxes they must pay. Not approving of it but just an FYI. Our gas stations used to do that in the US but not sure they still do since any gas price now is highway robbery and legal no less."}]}, {"id": "2203027726762972", "text": "Traveling to Rome first week in September. Should we buy train tickets to Naples in advance? And what's the fastest train?", "link": "facebook.com/groups/1373361046396315/permalink/2203027726762972/", "likes": 0, "comments": [{"username": "Sandy Radican Shikaly", "comment_text": "Tickets purchased ahead are less expensive.. only two train companies Italo and Trenitalia.. both high speed and very similar"}]}]