[{"id": "2191691064563305", "text": "An amazing spot in Riomaggiore for savvy travelers on a budget..Perfect location. Clean, compact apartment on the water's edge, 5 minutes from the station, and a great base to explore the entire area 😍\nDiscoverआणखी more - La Scogliera: https://www.kqzyfj.com/click-100692842-11552042?url=https%3A%2F%2Fwww.tripadvisor.com%2FHotel_Review-g187821-d1557420-Reviews-La_Scogliera-Riomaggiore_Cinque_Terre_Italian_Riviera_Liguria.html%23%2Fmedia%2F1557420%2F50266399%3Ap%2F%3Falbumid%3D101%26type%3D2%26category%3D101", "link": "facebook.com/groups/1373361046396315/permalink/2191691064563305/", "likes": 2, "comments": []}, {"id": "2192504801148598", "text": "Planning a 2 week trip in late May 2024\nCurrent itinerary is :\nVenice 3 days\nTuscany 6 days (trips to Umbria and Florence) 5 days in Naples and surrounding area.\nPlan to train Venice to Tuscany. Use a rental car in Tuscany. Train from Tuscany to Naples. Use public and private transport in Naples area.\nThoughts, suggestions? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2192504801148598/", "likes": 1, "comments": [{"username": "Donna Austin Jones", "comment_text": "We are taking the train to Chiusi and renting a car at the train station in Chiusi. We are basing ourselves in nearby Pienza to explore the beautiful Val d’Orcia. We have no experience with renting a car in Chiusi but I read several comments that it’s a pretty easy process."}, {"username": "Giovanni Caligula", "comment_text": "Italy has a no fault accident and they drive very aggressive!\n\nYou honestly don’t need to rent a vehicle in, public transportation is very good there or anywhere in Europe.\n\nIMO 3 days in Venice is too long, I would say no more than 2. But that’s just me. . It’s like Pisa. You only need 1/2 or 1 day in Pisa if you went there. It’s so small and the real main attraction is the tower and church. It’s an easy train ride to/from Florence.\n\nNaples is big and easy to get around with public transportation.\nBut I get the need to rent cars. I used to all the time. But I don’t anymore.\n\nJust my 2¢"}, {"username": "Steve Grossman", "comment_text": "Stay in sorento instead of naples. For sure"}, {"username": "Robin Burkholz Shaham", "comment_text": "I would also stay in Sorrento versus Naples. Naples is a bit rough and can be dangerous."}, {"username": "Ilaria Verda", "comment_text": "Hello i would suggest to add 1 day in Milan, so you can use public transport by high speed train front Venice to Milan then Milan to Florence and Florence to Naples. Please consider that May can be very hot!! I also suggest you to visit Pompei during your stay in Naples. I live close to Milan"}, {"username": "Rita Kanten", "comment_text": "Driving in the Tuscany region is not hard. It's mostly rural and lesser highways. But make sure you get an International Driver's Permit. AAA does them. And you need a car to really explore Tuscany. Even if the rental agency doesn't ask for an International Driver's Permit it is Italian law that you have to have one. If you get in an accident or get stopped the first thing they'll want in your IDP."}, {"username": "Frank Hunt", "comment_text": "My thoughts, I want to go too……"}, {"username": "Susan Sharon Shakked", "comment_text": "I think it’s important to consider the first few days you’ll likely be affected by jet lag so it’s probably a good idea to have an extra day at your first stop."}, {"username": "Manuela Bonazzi", "comment_text": "Napoli 5 giorni è tantissimo,a meno che non vai in costiera amalfitana o a capri/Ischia."}]}, {"id": "2192506157815129", "text": "My husband and I will be traveling from Venice to Rome via train. Is there a train station that is best to travel from? ￼￼￼ we are staying in the sun Marco area… thank you in advance for any help and insights!", "link": "facebook.com/groups/1373361046396315/permalink/2192506157815129/", "likes": 1, "comments": [{"username": "Giovanni Pianigiani", "comment_text": "There's only one train station in Venice, which is Santa Lucia. The other one (Venezia Mestre) is on the mainland, it's typically the first stop after Santa Lucia for outbound trains"}, {"username": "Dana Colantuono", "comment_text": "I also stayed in San Marco as well. I walked from the hotel to Santa Lucia train station(took me 30mins) and took the Italo train to Rome Termini. I would have booked my ticket in advance as well. Then depending on where you're staying in Rome, you may need to take the tube to get where you're going in Rome.\n\nWalking through Venezia allowed me to sightsee and see a less \"touristy\" areas of Venezia! Wish I ventured out of San Marco more! Enjoy!"}]}, {"id": "2192507424481669", "text": "Hi - is it possible to 'break a journey' on the train in Italy? For example: I am going to a concert and there is a special €10 ticket to purchase which includes a return train and shuttle to the venue. On the way I want to drop my back odd at my accommodation (near to one of the stops) and jump back on. Normally I wouldn't have any reservations, as I think Italian trains are fantastic, but last year I had a bad experience with the trains in the South of Italy and that's ruined things slightly! Thanks for your help :)", "link": "facebook.com/groups/1373361046396315/permalink/2192507424481669/", "likes": 1, "comments": [{"username": "Rhona OConnor", "comment_text": "The trains tend to spend about 5-10 mins in each station. You might not make it back to the train in that time."}, {"username": "Grace Scinto", "comment_text": "If you are getting off and leaving the station, you will need another ticket to get back on."}, {"username": "Jennifer Rand", "comment_text": "Ask at the train station. The ticket may have a time limit when you validate it"}, {"username": "Marina Rosa Moni", "comment_text": "No lmao"}, {"username": "Hamza Tariq", "comment_text": "Could you let me know if it’s a regional train or frecciarossa?"}, {"username": "Leila Myftija", "comment_text": "It depends. If it's a \"regionale\", it has a time limit of 4 hours after you've validated it, so you can get off and get on another one (unless the concert rules say otherwise)."}, {"username": "Yron Quinto", "comment_text": "Depends on where you’re coming from and your destination. If it’s in the same city, just get a day ticket."}]}, {"id": "2192525361146542", "text": "Hello\n\nFirstly, please excuse this post. I’m a boomer and take terrible selfies, so please be kind. I’m going to Sicily and Rome next month. I have previously been to Italy and yes, I used the dreaded selfie stick and yes, I loved it.\n\nMy question is, do people still use them or are they an absolute NO NO? I have heard they are illegal?\n\nthank you", "link": "facebook.com/groups/1373361046396315/permalink/2192525361146542/", "likes": 29, "comments": [{"username": "Karen Dearden", "comment_text": "Don’t feel shy to ask a family to take pic- offer to take theirs too! Plus if it’s a family for you know they’re not gonna run away with your phone. ￼ I also ordered a cute little tripod on Amazon and you can always set your phone down and take a step back and take a pic with a timer. But I think that having just gotten back from Spain there are lots and lots of places you can use a selfie stick."}, {"username": "Skye Birch", "comment_text": "who the heck said they are illegal.... thats not true.. no law against using them"}, {"username": "Sierra Behrens Tibbetts", "comment_text": "I don’t have one, but thought about getting one. They seem fun and practical."}, {"username": "Michael Westlake", "comment_text": "Can't avoid people trying to sell them to you. Continuously."}, {"username": "Cynthia Marie", "comment_text": "If you want to use one then use one, unless otherwise posted. It’s your life, live it to the fullest! Have a great trip!"}, {"username": "Gina Van Antwerp", "comment_text": "Just returning from Florence and Liguria area. I didn't see anyone using them. My cousin lives there says they are forbidden in Portofino. Not sure about other towns."}, {"username": "Danielle Sags", "comment_text": "They sell them everywhere."}, {"username": "Amber Ikemoto", "comment_text": "They are practical for many and I say use it. The beauty of Italy is to take as many pics as you can to remember how wonderful a place it is. Enjoy your trip. 🇮🇹🤗"}, {"username": "Elisa Marte", "comment_text": "Non sono illegali"}, {"username": "Melissa Gray", "comment_text": "Seriously? I never would have thought/known that if I hadn’t read this post. As a solo traveller, I love a good selfie stick! Thanks for posting!"}, {"username": "Katrina Martin", "comment_text": "Just curious, why are they banned? Thanks"}, {"username": "Ashley Caccamo Lewis", "comment_text": "Just came back from Sicily last month and saw plenty of ppl using them"}, {"username": "Richelle Trezise", "comment_text": "New Samsung has a feature where you can say word and the phone will take the photo"}, {"username": "Kerrin Barassi", "comment_text": "I used mine, badly! My cousin used the Bluetooth “clicker” so held phone in 1 had & clicked to take photo with other hand"}, {"username": "Kianna Anderson", "comment_text": "They sold them everywhere around the touristy spots in Rome and Florence"}, {"username": "Debbi Mayfield", "comment_text": "Just ordered mine from Amazon and plan on using a lot, although not in museums"}, {"username": "Deborah Shaw", "comment_text": "I’m bringing ours. The only place I read where you aren’t supposed to use them is the colosseum. I think the reason was because it’s too crowded and they didn’t want them used due to possible damage to the colosseum."}, {"username": "Nicole Goudey-Rigger", "comment_text": "They were all over Rome 2 weeks ago. Not sure about anywhere else."}, {"username": "Eva Here", "comment_text": "If u love using it, use it. Who cares what anyone thinks AT ALL"}, {"username": "Katalina Loredo", "comment_text": "They’re still used and they’re only illegal in certain areas of cities"}, {"username": "Evette Davis", "comment_text": "Saw loads of vendors selling them & hundreds of tourists using them all over Italy, from Lake Garda, Cinqueterre, Siena, Florence, Rome, Venice, Sorrento, Positano & Capri. We nearly bought one but the zoom out function worked fine or asked another tourist to take a photo for us. This was also a great way to meet people & swap travel tips!"}, {"username": "Catherine Maldoni", "comment_text": "Banned in some parts of Italy"}, {"username": "Brian Marcus", "comment_text": "I've seen them all over this week."}, {"username": "Joan Dianna", "comment_text": "Get your guide"}, {"username": "Louise Walmsley", "comment_text": "I’m taking mine to Lake Garda????"}, {"username": "Jessica Stewart", "comment_text": "My husband bought one for our trip in September and we are millennials we want to be in as many pictures together as we can . ￼"}, {"username": "Ashley Martins", "comment_text": "Certain indoor places ban them but widely used outside. I just asked several people to take a photo & returned favor instead of using mine."}, {"username": "Leah Razuri", "comment_text": "🤣🤣🤣🤣"}, {"username": "Gina Scialdone Ferris", "comment_text": "We just bought one for $5 because we were sick of looking like 2 bobble heads in our pics. Best $5 spent!!"}, {"username": "Sam Clarkson", "comment_text": "We’ve just come back from Naples, Rome, Sorrento and Amalfi and they are everywhere. Have fun with that stick."}, {"username": "Donna Austin Jones", "comment_text": "I read they are outlawed in Portofino but haven’t heard they are illegal in other places."}, {"username": "Tami Frediani", "comment_text": "Just got back from five weeks in Italy. Many places say no to them, many say yes. It’s about 50-50. Bring it if you want and know when to use it. Have fun."}, {"username": "Susan Levings", "comment_text": "Well I don’t know if they are illegal but they do discourage folks standing in front of statues, duomos fountains etc for “lengths” of time trying to get just the right shot. In other works, take a selfie and move along to avoid creating congestion. Have fun, great country and plenty of photo opportunities."}, {"username": "Lisa Quinn", "comment_text": "I just left Italy yesterday and saw tons of people with selfie sticks, especially vendors"}, {"username": "Joan Leotta", "comment_text": "Not illegal but definitely a problem in crowded areas. Really, just use your arm and get the broader background in a separate shot"}, {"username": "Karen O'Reilly", "comment_text": "Im going in aug dont give a shit im using my selfie"}, {"username": "Mike Adams", "comment_text": "Italy is only place I’ve seen selfie sticks recently"}, {"username": "Janet Messanelli Bozzone", "comment_text": "Lmao. I’m 69 and I just got back from a trip to France with 3 other HS friends. One brought with her an old selfie stick but lacked the proper attachment to her current iPhone. One young man came to the rescue with the appropriate dongle and we had so much ridiculous fun trying to use it from inadvertent videos and bad shots. It became a joke to use it wherever we went. We even turned away people offering to take a photo for us. Lmao. We will have laughs for years looking at these shots and videos.\nBut to answer your question, not many folks using selfie sticks and some tourist attractions have banned them. 🙃"}, {"username": "Monique Swanner", "comment_text": "They had signs in Rome near the colosseum and palatine that said they were not allowed, I still saw people using them"}, {"username": "Carmine Castiglia Jr", "comment_text": "Selfie sticks are indeed banned in some Italian cities and you can be fined for using one in public spaces. Additionally, most museums and churches also have bans in place."}, {"username": "Lisa May", "comment_text": "I also used mine on the Bernini Express and got some great videos through the windows. Plus, popped out of the sunroof on our vintage Fiat 500 tour. Use them sensibly and you'll be fine 🙂"}, {"username": "Ruth Simmons", "comment_text": "When we travelled in May we had no problems and there were no signs or warnings. My husband handled the selfies with our stick and I took all the other sightseeing pictures. We never held up traffic or took too much time, I think that’s key."}, {"username": "Matteo Malto", "comment_text": "I'm Italian. Usually they are used only by tourists but don't worry, they're allowed 😊"}, {"username": "Justine Cameron", "comment_text": "If you don’t use selfie stick top tip is to use the zoom out function on phone - I have short arms and this defo helps - this was me trying a selfie 🤣 and the. My friend said “why are you nit using zoom out function”"}, {"username": "Larry M Murray", "comment_text": "Certainly saw them in Positano"}, {"username": "Chris Vilsack", "comment_text": "They use them there and in Spain\nI'm consistently getting hit in the head with them, walking around Barcelona"}, {"username": "Lynn LaColla Barnsback", "comment_text": "We never had one. I wish I did. Italy, Scotland, Ireland, England France, Germany. I have photos from a few years of trips and don’t like most photos of me. My husband said no his arm is long enough. And they are a pain to carry. Heading back to France next week and maybe I bring one with me this time. (He’s not along anyway) but my girlfriend will be mortified"}, {"username": "Shannon Facette", "comment_text": "We took one and used it many places. They weren’t not allowed in some places and were checked at the door and we picked it up on our way out. Backpacks the same in some places as well tho."}, {"username": "Kaydin Davids", "comment_text": "Rome weather forecast for Tuesday July 18: High of 43deg Celcuis or 109deg Fahrenheit.\nTake care."}, {"username": "Roxanne Curzi", "comment_text": "The phones have settings for a wide angle. I don't think it's really necessary."}, {"username": "Stacey Lynne Fatalo", "comment_text": "We were in Florence and many people had them - there were people also selling them on the streets!"}, {"username": "Paula Bennett", "comment_text": "We’re bringing a selfie stick but obviously will not use where not allowed."}, {"username": "Carol Brewer", "comment_text": "I haven’t seen any in a few years"}, {"username": "Alexandra A Welker", "comment_text": "People still use them, just bring one."}, {"username": "Richard Meek", "comment_text": "I dare you to use one while ordering cappuccino in the evening. Seriously we saw plenty about, not my scene and no idea on the legallites. Have a great trip."}, {"username": "Sigrid Cormier", "comment_text": "The article below dates back to. 2015. As a visitor to ANY country, respect their rules and laws. I’m getting tired hear reading “nobody cares”. Yes, the locals do care, but are too polite to say anything.\n\nNew York City is really taking a stand against selfie sticks cluttering up popular tourist sites. So many museums ban sticks, including: the Met, the MOMA, Brooklyn Museum, Cooper Hewitt Museum, Guggenheim Museum, the Frick, the Whitney, and American Museum of Natural History are on it.\nRest of the U.S.\nOutside of New York's museum scene, other tourist spots in the U.S. are also cracking down on the gadget.\nAcross the nation selfie sticks are banned at: Washington D.C.'s Smithsonian museums, the Art Institute of Chicago, the Getty Center in LA, the Cleveland Museum of Art(opens in a new tab), the Carnegie Museums(opens in a new tab) of Pittsburgh, the Blanton Museum of Art(opens in a new tab) in Austin, Texas, the Perot Museum of Nature and Science(opens in a new tab) in Dallas, Texas, the Museum of Fine Arts in Boston(opens in a new tab), Detroit Institute of the Arts, and the Seattle Art Museum(opens in a new tab)."}, {"username": "Kate Ochman", "comment_text": "Don t remember seeing them..."}, {"username": "Anna Cappeluti", "comment_text": "My husband swore he’d never ever buy one, he admitted defeat when he purchased one in Rome. We’ve gotten some great shots that we wouldn’t have been able to get if we hadn’t got one. I’d advise to take it with you and see how you go. Good luck! 😊🇨🇮"}, {"username": "Susan Lowry Lamb", "comment_text": "I'm older and my selfies suck so bad that I refuse to do them. lol. Love this post."}, {"username": "Tami Sue", "comment_text": "Selfie sticks arab must, I forget about mine a lot. I used it in the colosseum. Some museums say they're not allowed, couldn't use it in the vatican. Just bring it."}, {"username": "Rachael Richardson", "comment_text": "I seen tourists use them here"}, {"username": "Heather Sechrist", "comment_text": "I’ve seen a few this week. You do you."}, {"username": "Santo Finocchiaro", "comment_text": "We were in Rome in April. I can't remember seeing anyone with a selfie stick"}, {"username": "Ryan Monahan", "comment_text": "I saw lots of them over the past 3 weeks that we travelled around. No big deal"}, {"username": "Judith Pishnery", "comment_text": "why selfies, just photograph the beautiful place and enjoy"}, {"username": "Greg Saba", "comment_text": "Street vendors are still selling them. But please do not use them in tight quarters."}, {"username": "Mary O'Sullivan", "comment_text": "Tons of people use them while I was in Italy last month ..\nDo what works for u & enjoy !"}, {"username": "Danilo Esse", "comment_text": "Its ok,unless you will do it at the top of gianicolo hill or terrazze del pincio and you will fall down 😂😂😂❤"}, {"username": "Maria Musumeci", "comment_text": "As we were 2 families, 8 of us, that selfie stick came out everywhere!! It helped in getting the perfect group shots every place we ventured to!"}, {"username": "Vicki Brown", "comment_text": "I don’t have the arm span to take a selfie so I’m bringing one."}, {"username": "Lisa May", "comment_text": "We used one on our recent visit and wouldn't have got the photos we wanted without one. The vendors were still walking around main tourist sights selling them too. We never encountered any issues and travelled to Milan, Lake Garda, Verona, Florence, Lake Como and St Moritz on our trip. ENJOY 🇮🇹"}, {"username": "India Silvie Di Tommaso", "comment_text": "Da italiana ti rispondo che solo i turisti lo usano"}, {"username": "Becky Jones Dodson", "comment_text": "If you have an Apple Watch, you can use the Camera remote feature on there. Someone still has to hold out the phone, but they don't have to push the button. The watch feature gives you three seconds to pose."}]}, {"id": "2192526571146421", "text": "Hi we are arriving at Brindisi airport next week at 23.30 am thinking of hiring a car prior to our arrivial bse we will be heading to otranto were our hotell is located.was wondering if there any car hire companies that are open at 23.30 in Brindisi??Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2192526571146421/", "likes": 0, "comments": [{"username": "Giulia Cardamone", "comment_text": "Appears Thrifty are 24 hours from this on their website but always good to check"}]}, {"id": "2192539607811784", "text": "Booked 6 nights in Florence and aim to do day trips as travelling with family of 7 so wanted a base. Day trips to Rome, Venice, Cinque/Pisa - any suggestions re trains and other recommendations for day trips? Also what’s train trip from Paris to Florence and vice versa like. Flights easier? We were looking at flights from Florence to Amsterdam then finish up in Paris but it’s costly", "link": "facebook.com/groups/1373361046396315/permalink/2192539607811784/", "likes": 2, "comments": [{"username": "Rhona OConnor", "comment_text": "Paris is a nightmare at the moment. So so busy, roadworks everywhere and everything is getting renovated for the Olympics. Tickets for museums ect impossible to get. Look at another place instead."}, {"username": "Steve Grossman", "comment_text": "C t Is a seven hour round trip from florence without any traffic. Replan where you plan on taking your day trips"}, {"username": "Frances Younger", "comment_text": "Sounds like a memorable trip.\n\nI would suggest that you be aware of planned transportation (train, airport) strikes. They are generally announced in advance so you can make alternate plans."}, {"username": "Gina Spyker Fairfield", "comment_text": "Look up Florencetown for small group or private tours. They save you the hassle of worrying about train strikes, parking, figuring out all the logistics, etc. We loved their Cinque Terre tour!"}, {"username": "Karen Schmidt", "comment_text": "I personally wouldn’t do any day trips from Florence towards Rome. Can you fly into Rome, stay there for a few days and move up to Florence? Six nights it’s not a lot for what there is to see. You could split three days Rome, three days Florence. But you really don’t have time for any of the other areas you would like to see. If you want to do a appetizer of each city, you could do two days Rome, two days Florence, two days Venice. I think that would be better than taking the trains back-and-forth,\nwhich would mean you’re spending a third of your day on the train travelling, as opposed to actually enjoying the city you are in. Is Paris on top of the six days? If so, definitely fly. We flew from Venice to Paris one year and it was about an hour long flight. I would only do that if you actually had a few more days to spend in Paris though. Otherwise use the extra time in one of the Italian cities. ￼￼"}]}, {"id": "2192542031144875", "text": "I’m going to Olbia Sardinia for a week staying in Puerto Cervo\nWe have a car\nAny dining recommendations\nDay trips?\nBeach clubs?", "link": "facebook.com/groups/1373361046396315/permalink/2192542031144875/", "likes": 1, "comments": [{"username": "David Litvinoff", "comment_text": "Come to Gustos and talk to Riccardo Mavuli"}]}, {"id": "2192547771144301", "text": "Looking for a driver from Naples airport this Sunday morning to Polignano a Mare and a return trip 3 days later back to Naples and then some day trips that week. Any suggestions would be appreciated!", "link": "facebook.com/groups/1373361046396315/permalink/2192547771144301/", "likes": 0, "comments": [{"username": "Maria Musumeci", "comment_text": "https://\nwww.nicotravelli\nng.com/\nWe used Nico for all our driving tours from Naples. Not sure if he goes to Polignano, just message him and he'll let you know availability & cost. He was great."}, {"username": "Carol Potter", "comment_text": "Taximister…. Ciro is amazing!!!"}]}, {"id": "2192552571143821", "text": "I’m just starting to plan our first trip to Italy. Family of 5. Wow is it overwhelming lol, but exciting. We will be there 8-10 days I’m thinking . May 2024. We don’t want to cram too many places in, I’d rather take our time and really explore. I’m thinking 2 home bases. I’m torn between Rome and Tuscany or maybe Naples and Almafi ???? I’d like some history and tours , but we love nature/countryside and the ocean lol. So I’m at a total loss. Any advice ? Or a different itinerary idea? Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2192552571143821/", "likes": 13, "comments": [{"username": "Chrystal Stevens Bisonet", "comment_text": "Rome and Florence"}, {"username": "Angela Genduso", "comment_text": "Country side is definately tuscany outside of Florence as and Florence I fell on love with. My second favorite is Sorrento brings u to the amalfi coast and Capri. These are my two favorites. I love nature and shopping."}, {"username": "Valerie Collanton", "comment_text": "If you can extend it to 14 days that would be ideal to split two home bases. We did this last October. A week in a villa in the Florence hills and a week in Capri. I would recommend a week somewhere in Tuscany so you can explore that area and a week on or near the Amalfi Coast. Sorrento would be work well as there are lots of places you can explore from there. Two very different regions of Italy. They will not disappoint!"}, {"username": "Carmela Noble", "comment_text": "The amalfi coast is literally the most serene and beautiful place on earth. I’ve been many times and choose to go back over exploring new places"}, {"username": "Rosemary Barbetta", "comment_text": "First trip means the main cities……Rome, to Florence and day trips from Florence, Milan and home."}, {"username": "Elizabeth Veronica", "comment_text": "Cinque Terre!! and Lucca"}, {"username": "Ashley Martins", "comment_text": "Rome & Tuscany or Rome & Amalfi. Decide if you want more costal or country vineyards, both are amazing."}, {"username": "Phyllis Snyder", "comment_text": "Tuscany is a region not a town- and the region has numerous historical sites and fantastic countryside. I suggest you purchased a good guide book on Italy- Rick Steve’s book is excellent!"}, {"username": "Rhonda Hope", "comment_text": "For a first time trip rome , Florence, Venice with day trips you will return"}, {"username": "Mary Balistreri Swan", "comment_text": "Venice :-)"}, {"username": "Heather Atkinson", "comment_text": "Rome and Florence (including Siena and San Gimignano)"}, {"username": "Thomas Harris", "comment_text": "Two home bases is a great idea. I would personally choose Sorrento and Florence. Rome is beautiful but very busy."}, {"username": "Raf Gervasio", "comment_text": "Naples is the best option then you have access to Capri Ischia Amalfi...\nYou can do Rome as a day trip especially if you get the Fecciarossa early"}, {"username": "Claudia Castellini", "comment_text": "Rome is a must! And it worth to stay at least 3 or 4 days.\nNaples and Amalfi are very close, Amalfi can be a day trip from Naples, as well as Capri, Pompei, Sorrento, Ravello, Positano… All very typical and really beautiful sea views.\nIn Tuscany you have beautiful ancient cities or villages and beautiful country side."}, {"username": "Matthew Livio Conti", "comment_text": "Why \"base\" in these touristy places? Why not stay in smaller beach towns between Rome and Naples? Visit the cities for the day, then go back to smaller towns and relax... Sperlonga, Gaeta, Terracina, etc."}, {"username": "Elizabeth Lupo DiVito", "comment_text": "We just got back family of six. My last trips to Italy we jumped too much. So this time we were a week in Rome a week in Sicily and it was fantastic. It's so easy to try to cram too much in because there are so many lovely areas, but we really enjoyed this trip. I love Florence but didn't want the rushing feel and Sicily was the only part we hadn't been to. It is sooo beautiful."}, {"username": "Karen Schmidt", "comment_text": "Yup, Rome and Siena! Just booked the same for next May. We have extra time so are doing Ischia as well"}, {"username": "Lisa Jones", "comment_text": "We just came back from two weeks in Italy and we had 6 nights in Taormina a night either side at Catania, and then four nights in Rome. It was amazing, we have 15 yo and 18 yo and two parents so the art and history of Italy were fantastic, plus some time at the beach and of course, food 😍"}, {"username": "Emily Kubisiak-Falini", "comment_text": "Can anyone recommend where to stay In Tuscany? We would like a villa in the countryside, but central to explore to other areas."}, {"username": "Mary Agozzino Derrick", "comment_text": "You would love Sicily then"}, {"username": "Glenn Todd Webb", "comment_text": "Split it between Rome and Florence. Do a day trip out Rome to Tivoli and one from Florence to Pisa/Lucca. Fly in one, out the other. Train between."}, {"username": "Pong Ac Ai", "comment_text": "Rome and Positano home bases try to add more 3 precious days"}, {"username": "Rita Levi Montalbano", "comment_text": "Rome and tuscany, definitely"}, {"username": "Giorgia Petraia", "comment_text": "No ocean here lol"}, {"username": "Chip Swalley", "comment_text": "8 - 10 days goes by fast, if you are able to get more days, do it you won’t be sorry! Rome is VERY touristy, but…. So rich in history and May should not be that overwhelming with so many tourists! Good luck in your choices, watch utube to see areas of interest!"}, {"username": "Nancy Kaelin Smith", "comment_text": "I would skip Naples. Rome and Sorrento. Stay in Sorrento. Take tours from there. Very easy. Take a boat trip to Capri."}, {"username": "Ewa Olbrych-Rudzinska", "comment_text": "I would start making sure it is 10 days not 8 . if u can make 2 weeks which I would recommend, at least 2 weeks, that would be perfect, and then you could combine Florence and Tuscany hills and Amalfi coast which we loved or Cinque Terre Italia, which is closer to Florence . I will write more knowing what your plan is. We loved Florence and Tuscany. I have an excellent guide for Tuscany with a big van. He is fun and fabulous. Amalfi beaches are rocky but the vibe and energy there is incredible, water clean and warm. you just need flip flops on the beach that is all."}, {"username": "Jenny Larsen", "comment_text": "Orvieto is amazing google it also we stayed in Maiori in the Amalfi coast much better than Amalfi or Positano but they may not suit your plans"}, {"username": "Kimberly MacKinnon Cherry", "comment_text": "Both are good choices. But if you want the water, I would suggest your home base in Sorrento, a good jumping off point to Amalfi Coast and Capri. You can also go to Pompeii from there. We did it in April 2023 and the weather was cool and not as crowded as later in the year. We loved Sorrento. We rented an apartment with VRBO within a 3 minute walk from Piazza Tasso, the main area. It was great. Lots of shops, restaurants, and grocery stores so you don't have to eat out every meal. We had a view of the Bay of Naples and Mt Vesuvius. I personally don't think Naples is near as good as Sorrento. Naples is a bit too rough and tumble for me. Watch out for pick pockets!"}, {"username": "Kathy Smith", "comment_text": "I’m in Italy. We were in Rome, Naples, took a boat to Ischia and now in Amalfi coast for a week. I know there are Naples lovers on here but I’m not one of them. Rome and Amalfi coast towns have been wonderful."}, {"username": "Francesca Messina", "comment_text": "Rome then Napoli then Amalfi coast.\nTuscany next time 😁"}, {"username": "Claudia Amp", "comment_text": "Tuscany and a few days in Rome. In Tuscany you get much of the things you are looking for within reasonable distance and not much hussle."}, {"username": "Giovanni Pianigiani", "comment_text": "How about Rome and Naples then?"}, {"username": "Wade Bailey", "comment_text": "You can do this! First get a good Guidebook, compare them at a book store. Rick Steves more laid back and less expensive more small locally owned places. Frommers and Fodor are higher budget places. I am there to see the sites not stay in a huge room. Watch videos, YouTube, join forums where ppl will ask questions. Then narrow down what you want to see. Every time you change locations it takes half a day. Pack, check out, get to train station find new place. There will be problems, it is part of the adventure. Don’t over plan. My family needs a rest day every 5-6 days where we just relax, go for a swim. We learn basic words and I make my daughter order food at one restaurant in the local language. Waiters become proud when she does!"}, {"username": "Gary W Anderson", "comment_text": "Fort Tuscany I recommend Florence, it has many great museums, incredible history and romance and is in Tuscany. A great base."}, {"username": "Tara Feliz", "comment_text": "We did Rome and Sorrento with day trips to Capri and rest of Amalfi Coast. If you choose this option make sure you do your day trips early in the morning to see nature and the sea as opposed to shopping mid day in the towns which is what many of the tours consist of. I felt the same way as you…as far as only 2 stops, taking it all in, nature. I would love to do Rome / Tuscany as well. Haven’t been to Tuscany yet."}, {"username": "Tricia Brittingham Neff", "comment_text": "Pick one city and one coast. Rome or Florence paired with Amalfi, Lake Como, Lake Garda, or Cinque Terra. Then day trip out of each place. Personally If I had to pick two for my first time I’d do Rome and Amalfi!\n\nWe are going for our second time (first with 3 teen kids) and doing Rome, Venice, Lake Como."}, {"username": "Elyse Lichtman-Scheiner", "comment_text": "We just got back from a first trip. I would suggest Florence 100% and one other place depending on what you’d like to experience. We loved Florence for culture, history, and fun…all walkable!, We did a day trip to Chianti too. An e-bike tour sounded fun but we got rained out of ours. After Florence we did Sorrento and Positano for the coastal landscape vibe. I would suggest home base Sorrento and a day trips to Positano, Capri, Ischia, Almalfi etc. You won’t run out of ideas. You’ll be like, “we should have stayed longer”."}, {"username": "Karen Landini", "comment_text": "Perhaps Rome and Sorrento. Can access Napoli, Pompeii, Amalfi from there and you may need a break from a large city after Rome."}, {"username": "Laura Torres Palomino", "comment_text": "Rome and Tuscany are a must. Look into Airbnb’s…so affordable and relaxing…kitche\nn and laundry are so handy too."}, {"username": "Donna Mangone", "comment_text": "Rome and Siena."}, {"username": "Lynn Luken", "comment_text": "ROME over Naples for sure"}, {"username": "Tony Bassett", "comment_text": "You're right to take it easy see less and get a better experience. You cannot go wrong with either of your options. If you have the opportunity then return and do the other.\nMy preferred choice is Tuscany. Even 10 days there you'll still have lots left to discover"}, {"username": "John Licata", "comment_text": "Rome and Sorrento (by the coast south of Naples) makes a great second home base to Naples, Amalfi, Capri, Pompeii\nCheck VRBO for places and the owners are great resources"}, {"username": "Martha Caldwell", "comment_text": "Went started in Rome, then went to Naples, Capri and Sorrento. Drove north and went to Venice, Florence, Pisa, Verona, Assisi and Milan. We were there 10 days."}, {"username": "Francoise Coupal", "comment_text": "Great idea to have two home bases. More people should do this rather then jumping from one place to another. Less tiring and you can go deeper!"}, {"username": "Dana Green", "comment_text": "Rome and Tuscany. Soooo much to see in both areas."}, {"username": "Ramon Cardona", "comment_text": "In October we're Going to Rome ,then naples then sorrento and pisitano\nRome should spend more days there if you've never been\nNaples 2 to 3 days then Sorrento since it's closer to take the boat to Capri / anacapri\nThen positano to do the amalfi coast and enjoy and get lost in positano streets lol"}, {"username": "Cynthia Marie", "comment_text": "My only input would be, don’t go to the Amalfi coast for the beach if your from the east coast of the US. Their beaches are very rocky and unpleasant to walk on. We loved the Amalfi coast to tour the towns and would have been extremely disappointed if we went for the beach."}, {"username": "Maria Ek", "comment_text": "Ischia ❤️. We will arrive there on monday for the 7th time. We really loves that island 🇮🇹"}, {"username": "Ana Castro - Oy", "comment_text": "If this is your first trip and going with your family, you should start in Rome and Florence. These cities and near areas have so much to see and enjoy- history, culture, incredible food, incredible day trips to beautiful towns."}, {"username": "Tamara Stampone", "comment_text": "If you want country side and beach go to the Adriatic side but if you’ve never been to Italy I’d hit all the usual touristy areas first but Italy is huge and 10 days flys by so pick a few places that are not too far from each other by train and start there, you’re going to have to come back to Italy another time to see the rest. I was there for 2 months last summer and I’ve gone almost every summer since I was a baby and I haven’t seen everything yet lol"}, {"username": "Stacy Derouin", "comment_text": "Rome and Tuscany is so beautiful. Florence is a must see in my opinion!"}, {"username": "Marilene Sagaz Lanza", "comment_text": "Eu escolheria Roma e Toscana com certeza. Nunca Napoles"}, {"username": "Chris Vilsack", "comment_text": "Sorrento is pristine.. You can take the circumvesuviano\ninto Naples when you want.. Naples is alive.. Enjoy your stay.. Plus there's a hertz in sorrento"}, {"username": "Tracy Wrinn Mcdermott", "comment_text": "Rome and Sorrento. All can be done with public transportation,\ntrains & ferries. Lots of great history in Rome, at least 3 nights. Sorrento is a great hub with the circumvesuviano\nregional train from Naples allowing you to visit there, Herculenium , and Pompeii; then use ferry to visit Capri, and all of the towns along the Amalfi coast."}, {"username": "Laura Elash", "comment_text": "Please add Florence and Siena to your itinerary! You won't be sorry!"}, {"username": "Jill Medrano Casey", "comment_text": "I can't imagine not including Rome if you've never been."}, {"username": "Pam Kimak", "comment_text": "I was in Italy a few weeks ago for 11 days with my daughter and her two sons, 23 and 20. We flew into Rome from Newark Airport and got a transfer to Hotel Concordia in Rome..a nice hotel and location. We got 2 rooms ofcourse. We spent 3 days in Rome..had a morning Vatican tour...only planned thing we did..it was a hot day. We took a train from Rome to Naples and enjoyed the beautiful ride and countryside with so many farms. From Naples got a transfer..about\n50 or 40 minutes to Maiori right on the coast and stayed at Hotel Panorama across from the ocean and lovely boardwalk. A wonderful town with excellent restaurants a very short walk..a block or so from hotel. We had designated beach chairs and umbrellas. Some small rocks on sandy beach..beautifu\nl royal blue water.A wonderful family location..both hotels in both cities had rooftop buffet breakfasts included in price.Huge family suite at Hotel Panorama..with large balcony."}, {"username": "Suzanne Mills", "comment_text": "Rome and Florence. 5 and 5 days each. Naples is a day trip as is Ravello."}, {"username": "Allan Olexa", "comment_text": "Our favorite is Napoli…the city has so much more to offer. We are there a week annually."}]}, {"id": "2192553621143716", "text": "We are currently in Italy on a 4 week trip. One of our stops is in Siena for 3 nights. Having a hard time finding things to do/see, especially with kids (7, 8 & 15).\n\nOpen to suggestions, even if we need to drive out a little. Thanks in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2192553621143716/", "likes": 7, "comments": [{"username": "Donna Austin Jones", "comment_text": "If you have a car, drive the beautiful SR 222 Chiantigiana Road. It’s very scenic with lots of places to stop and see. Or drive to San Gimignano. Lots and lots to see if you have a car."}, {"username": "Gurbax Kaur Bajwa", "comment_text": "That's a very long trip. From Siena you could visit the surrounding cities. Maybe have an easy day and enjoy a gelateria."}, {"username": "Debby Finn Martino", "comment_text": "Not sure how far you are from Pienza but we just did a tour of a cheese making farm. My teens loved it. They have a bunch of farm animals & a cheese & wine tasting at the end"}, {"username": "Kelly Marsh", "comment_text": "Check out Cugusi Dairy, you can or order a picnic, it’s just outside Montepulciano.\nAlso check out e-bike tours through Viator."}, {"username": "Lisa Holley", "comment_text": "San Gimignano and Lucca are good day trips"}, {"username": "Tania Bourgoin", "comment_text": "I would check out an agriturismo with some farm animals or maybe look at a day at the beach in Viareggio"}, {"username": "Ilaria Verda", "comment_text": "What about 1 day at the beach? Follonica, Castiglione or Orbetello?"}, {"username": "Laura Cardinale", "comment_text": "Certaldo: there’s a busserà festival until tomorrow (is called Mercantia)"}, {"username": "Ilonka Sinkeldam", "comment_text": "Always a base with a swimmingpool…….\nsightseeing till lunch and then to your swimmingpool."}, {"username": "Karen McAloon", "comment_text": "Medieval torture museum for the 15 year old. Mine loved it."}, {"username": "Ettore de Vita", "comment_text": "Perugia, Spoleto, Assisi"}, {"username": "Dana Rinaldi", "comment_text": "Leonardo's museum in Anchiano near his birthplace Vinci full of amazing installations and lots to learn, and the Giardino dei Tarocchi, the Tarot garden near Capalbio with fantastical and magical art installations kids love or San Galgano Abbey in the town of Chiusdino with the real Sword in the Stone"}]}, {"id": "2192554331143645", "text": "We are going to be flying into Bologna the very end of October for 8 nights. We are thinking we'll stay 3 nights in Bologna and want to spend a few nights in 1 to 2 other places close by. What other cities would you recommend staying in? We plan to visit and/or stay in Verona, Venice, Como, Modena, and Parma (possibly Remini if time allows).", "link": "facebook.com/groups/1373361046396315/permalink/2192554331143645/", "likes": 1, "comments": [{"username": "Hen Garrett", "comment_text": "Verona is a good base as you can explore Lake Garda but also get the train to Venice and or Milan. Florence is another good base and you can train it to Lucca, Pisa, Siena etc from there. If you want Como you are better off staying there or in Milan. I love Milan - loads don’t. I guess it’s because it’s not a beautiful renaissance city but I like that it’s modern and vibrant - with plenty of art and culture - and the food is great. Also love Verona and Bologna. Not sure I’d stay in Venice but that’s just a personal thing."}, {"username": "Louanne Peterson", "comment_text": "Everyone says Lake Como is beautiful. Venice is touristy but also if you have never been, you will never see anything like it again in your life. A city on water. It is amazing. Verona was really nice. We just got back from Italy. My favorites are the Amalfi Coast, Florence and Venice. Tip -if hotel rooms are crazy in Venice (though in October is a great time to go.), We stayed in Lido across from Venice and a few minute ferry ride over if you like somewhere charming with a view of Venice. That just made for more boat rides and our family loved that. I have been to most of the places you mentioned and wouldn’t pick Bologna to stay nor would I pick Modena and Parma but they are all great for a visit, lunch and to see where the best cheese in the world is made. So many beautiful places, it is difficult to pick. You have picked one of the best times of year to go. We just got back as we have kids in school and can only go in Summer- It was hot hot and sooo busy but you know that if you have been on this group."}, {"username": "Louanne Peterson", "comment_text": "Louanne Peterson"}, {"username": "Louanne Peterson", "comment_text": "Rimini will be very slow and sleepy in October. My husband was in the air force stationed there … It is a beach town for Europeans."}, {"username": "Louanne Peterson", "comment_text": "Venice at night from the Ferry"}, {"username": "Rosemary Barbetta", "comment_text": "Good luck….a very busy schedule. You will be spending a lot of time travelling"}]}, {"id": "2192554601143618", "text": "Scheduled for a day trip to Rome on Tuesday. The weather is looking like 107 degrees and we are concerned that this will be too much for the kids. Without a hotel to get some relief from the hotel plus the lines and waiting in the heat sounds like it might make for a miserable day. Is there anywhere else that you can suggest for a day trip? Coming from Florence. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2192554601143618/", "likes": 16, "comments": [{"username": "Marti Krauss", "comment_text": "Go to the beach in Forte dei marmi or via Reggio can take train from florence"}, {"username": "Karen Landini", "comment_text": "If you don't already have tickets to the popular sites you will spend hours in line in the heat, so plan to walk around the sites to see them from the outside early if you want to check those boxes then Villa Borghese park for shade. Personally, I recommend saving Rome for another trip and looking at some of the other recs people have posted."}, {"username": "Carol Taylor Tisdale", "comment_text": "I definitely would not go to Rome under those conditions. Agree that heading for a beach would be preferable."}, {"username": "Robin Burrell", "comment_text": "I think you might want to head for the coast."}, {"username": "Nikki Livingston", "comment_text": "Cinque Terre!"}, {"username": "Suzanne Calpito Ragsdale", "comment_text": "If you really want to see Rome (of course you do) do a golf cart tour. And then go back to the hotel for the hottest part of the day and go back out when it cools down."}, {"username": "Jennifer Lee", "comment_text": "I agree - don’t go ☝️"}, {"username": "Alicia Burno", "comment_text": "107 degrees!!! O-M-G….we are arriving August 1st"}, {"username": "Alison Carney", "comment_text": "You could try the on-line “skip the queue” deals."}, {"username": "Maryjo Zappia Jeffries", "comment_text": "We are in the same boat. I’m dreading the heat"}, {"username": "Ilaria Verda", "comment_text": "Pisa and marina di Pisa At the beach!"}, {"username": "Pam Gerretsen", "comment_text": "Orvieto- you can visit the caves (pre-book?) And St Patrick's well. If you're driving, you could go to Bolsena in the afternoon- lovely lake for a swim!"}, {"username": "Emilia DeCarolis-Tabback", "comment_text": "Skip rome it will be horribly hot- I would say Trevi Fountains but think all the tourists may be doing that! Why not stay local to Firenze & go to a vineyard? Or do a spa day near Firenze…."}, {"username": "Pauline Brown", "comment_text": "Cinque Terre - stunning or Viareggio - beach resort"}, {"username": "Lori Spears Strahan", "comment_text": "It's extremely hot here and will only get worse. My child not handling outdoor sights well so book catacombs and anything indoors! Trevi Fountain is packed!"}, {"username": "Ginger DiGalbo Katz", "comment_text": "Orvieto!! A big city is way to hot!!"}, {"username": "Dale Wooten Spears", "comment_text": "It is just as hot here with out clouds since\nYou left. We stay in a/c though! Stay safe❤️"}, {"username": "Phyllis Snyder", "comment_text": "Lucca or closest beach town."}, {"username": "Michelle Risser", "comment_text": "Perugia is lovely for a day trip they have a chocolate factory and something called the mini metro which is a driverless metro car that takes you around 🙂 … and is about 30 min train ride away from Assisi if you go that direction"}, {"username": "Chris Vilsack", "comment_text": "The beach.. Anywhere.. To refresh in the water"}, {"username": "Nana Tirolese", "comment_text": "The DaVinci exhibition in Rome was very interesting and wasn't crowded when we went in May. We really enjoyed it! In Italian it's called La Mostra di Leonardo. I just looked at the website and saw lots of kids in the video because it is very interactive. I highly recommend it!"}, {"username": "Kristen Mason Glasscott", "comment_text": "We just left Rome. Miserably hot…even though we were prepared for it, it was tough to stand in lines. Last day ended up cancelling plans and did spa day because it “felt” like 102 according to weather. It was fine once us. Started to set and in evening…"}, {"username": "Marita Bracun", "comment_text": "Go early, lots of really ice cold water, hats, find shade everywhere, air con restaurants and stores, you will all be ok"}, {"username": "Sue McCallum Ross", "comment_text": "Go to a beach! Just came back from Rome, too hot and busy! Find a beach! We swam in Capri and the water was amazing!!"}, {"username": "Jill Wolder", "comment_text": "Go to forte dei marmi for the day. It is less than 1.5 hour . It is a beautiful seaside town."}, {"username": "Laura Brangers Pope", "comment_text": "We were hot and it was 99 degrees when we were at the Colosseum. One of the issues is that you can’t escape the heat. Even going in a store or restaurant is still very hot compared to US standards. We took fans, cooling towels and lots of water. Skip the line tours and gelato are necessities! I would definitely clarify what your daughter is wanting to see/do."}, {"username": "Thelma Gipson", "comment_text": "I've spent the summer in Italy, we have 2 more weeks left, traveling with my kiddos. We were in Rome for the month of June but it was not that hot, I would not do it under those condition. I would do somewhere where they can swim, we went to a beach town called Camogli, nice beach, the town is beautiful, great food. My kids loved it."}, {"username": "Diana Smith", "comment_text": "Stop in Abruzzo, may be at one of their lakes. Or May be go to Lucca. Definitely not Rome."}, {"username": "Claudia Castellini", "comment_text": "In Tuscany there are a lot of beautiful villages or country side areas, where certainly it’s less hot, or even beaches (Argentario is one of the best seaside in Tuscany, it’s better to have a car to get there).\nIf decide to go to Rome as well, reserve your visits to monuments to skip the lines and always take with you a couple of liters of water (wet head of children if necessary), then you’ll find everywhere bars and restaurants to get a rest."}, {"username": "Jennifer Piovesan", "comment_text": "Assisi!"}, {"username": "AgAnne Chrzanowska", "comment_text": "Go to the beach in Livorno or do something in the country, like the Chianti area, where it's few degrees less than in the cities."}, {"username": "Hen Garrett", "comment_text": "Siena, Orvieto, Lucca, Pisa or rent a car and head up into the Tuscan hills."}, {"username": "Claudia Amp", "comment_text": "Hills around Firenze/Lucca, that’s where you might find some relief, or the beach but you have to soak the whole time 😂. Around Rome maybe Castelli Romani/ Colli Albani might be less warm; in Rome you can try to find some shade in Villa Borghese and Giardino degli Aranci."}, {"username": "Christine Malota- Kendall", "comment_text": "Assisi…"}, {"username": "Nicola Algerino", "comment_text": "Spostati a sud-est di Roma a Castel Gandolfo sicuramente qualche grado in meno 😅 .. tanto da vedere dai giardini alle residenze estive dei Papi"}, {"username": "Tricia Brittingham Neff", "comment_text": "Go early then in the heat of the day plan Catacombs, lunch, maybe cooking class, tour under Trevi Fountain!!"}, {"username": "Mar Iposa", "comment_text": "Beach in Livorno ...check out Tirrenia...just\ngot home yesterday from vaca n it was amazing! There's a whole strip of beaches"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Someone mentioned a pool in Florence where they spent the day to cool off."}, {"username": "Stephanie Garofalo", "comment_text": "If you aren't going to Pompeii or Herculaneum on your Italian holiday you may want to visit Ostia Antica, an ancient port city on the Tiber. Take the Roma-Lido local train towards Cristoforo Columbo, leaves every 20 minutes from the Port San Paolo station. A direct 25 minute ride from Rome and a fun day trip! Whatever you decide, enjoy!"}, {"username": "Tarah-Lee Cotie", "comment_text": "Viator cinque terre trip! Awesome and air conditioned van for transport plus a chance for a swim and gelato 🍧:)"}, {"username": "Diane Janovas", "comment_text": "Via Reggio is a Train away . Beach town. We got a hotel room for one night across from the beach ...we did sleep there but it also was a place to change and take a break. You have to pay for the beach but it was worth it"}, {"username": "Marti Krauss", "comment_text": "Go to the swimming pool in florence"}]}, {"id": "2192557894476622", "text": "Hey guy’s question what is the best site for booking hotels in Italy", "link": "facebook.com/groups/1373361046396315/permalink/2192557894476622/", "likes": 31, "comments": [{"username": "Debbie Vinecour Halperin", "comment_text": "I used Expedia for booking flights, hotel and tours"}, {"username": "Bob Schlessinger", "comment_text": "Trip advisor"}, {"username": "Tiffany Williams", "comment_text": "honestly I've had better luck booking through the hotel websites directly"}, {"username": "Jan Pab", "comment_text": "I booked direct."}, {"username": "Danielle Donahue", "comment_text": "Use a travel agent 😉"}, {"username": "Kim Topp-Cowgill", "comment_text": "Oh and TripAdvisor. I forgot until I saw it on here"}, {"username": "Angela Borghetti", "comment_text": "Airbnb"}, {"username": "Tracy Smith", "comment_text": "I always use booking .com then I message hotel or apartment to confirm with them"}, {"username": "Lori Schach Stockman", "comment_text": "Hotelier here- trip advisor and other sites for reviews, then book direct. Hotels can’t make changes if you book with a third party and we have to pay the 3rd parties ( in the US) around 18%"}, {"username": "Sally Hartmann", "comment_text": "Expedia I used for Italy"}, {"username": "Carmela Siniscalchi Frattellone", "comment_text": "I book directly through the hotel website. Did that with 3 hotel and didn’t have any issues."}, {"username": "Marita Bracun", "comment_text": "Compare sites, find something you like then book direct"}, {"username": "Kylie Graham", "comment_text": "Airbnb"}, {"username": "Susan Vogel", "comment_text": "Google hotels in Florence ( example)\n\nPut in your search parameters\nThen get prices by clicking hotel . All sites come up"}, {"username": "Patricia Savage", "comment_text": "We use vrbo"}, {"username": "Melanie Sumner", "comment_text": "Try going direct with hotel can be cheaper as they offer deals or add in 1/2 board"}, {"username": "Nancy Milano", "comment_text": "Veronica Amarilla-Hawort\nh"}, {"username": "Colleen Jennings", "comment_text": "Look on Tripadvisor then book direct with the hotel you like."}, {"username": "Janet Desrochers", "comment_text": "TRIP MASTERS! you can book your airline and hotel and customize as you wish. SUPER reasonable rates."}, {"username": "Jess Galasso", "comment_text": "My preference is directly with a property."}, {"username": "Amit Aviran", "comment_text": "Expedia & Priceline"}, {"username": "Maree Heap", "comment_text": "I booked with Stayz. We have booked great appartments in great locations for our trip next year."}, {"username": "Connie Rai", "comment_text": "I am a veteran Travel Advisor of 30 years. I would love to assist you in making your travel arrangements be it cruise, land tour, trains. Etc. I can provide you with perks that are not always offered by cruise line directly. I book individual travelers as well as personally escort small group world tours. Just returned from Australia and New Zealand as well as Italy in June. I have traveled extensively and to all 7 continents. Call Connie at 561-865-7484 or message me here\nThanks"}, {"username": "Sandy Michelle Duggan", "comment_text": "air bnb"}, {"username": "Loredana Polichetti", "comment_text": "Book directly is better"}, {"username": "Desiree Jimenez", "comment_text": "I always book direct for best rate and small perks. Plus, no hassles with reservations. Just my experience."}, {"username": "Ann Bryant", "comment_text": "Venere.it"}, {"username": "Debbie Bodette", "comment_text": "Don't Trip. Just Travel\nShe’s awesome!"}, {"username": "Starla Dawn", "comment_text": "Direct"}, {"username": "Antonio Aloè", "comment_text": "Expedia"}, {"username": "Tom Manno", "comment_text": "Any hotel’s website. Better prices; easier changes if you have to make them; less BS to deal with if you communicate with the hotel directly.\nJust one man’s opinion.\nTripAdvisor is a great source to scope out hotels."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Check availability on a booking site then book directly with hotel. Do not prepay."}, {"username": "Jake Swan", "comment_text": "Vrbo"}, {"username": "Linda Snaring", "comment_text": "Get the Rick Steves book on traveling Italy. He will list￼ hotels for different towns. He gives them stars for price. So some more expensive hotels and some are cheaper ones. ￼ We have done this many times. My husband and I like little quaint hotels. ￼"}, {"username": "Janette YesPlease", "comment_text": "I used booking•com for all our hotel stay during a three-week trip recently. I never had any issues, and I could cancel a few days prior on certain hotels if needed."}, {"username": "Maria Musumeci", "comment_text": "We used booking-com for all our hotels on a 4 week trip. Had no issues & got some great deals & inclusions."}, {"username": "Paula Bennett", "comment_text": "I usually go on Expedia, trivago etc then when I fing one I like I go directly to that hotels site."}, {"username": "Dana Colantuono", "comment_text": "I used Google hotel search(it's similar to booking*com), booking*com and expedia for my search. But when it came to the actual booking, I booked directly because it was cheaper.\n\nOne place even reduced their price for me so I can book with them directly because I messaged and asked why booking*com rate is cheaper than theirs directly😁"}, {"username": "Janet Messanelli Bozzone", "comment_text": "I like to use booking dot com in most cases. If I’m looking for a modern hotel, I will use the Accor site directly for Mercure or Novatel."}, {"username": "Berndt Weihs", "comment_text": "I use always\" booking. com\",not only in Italy,but always.Then I look to the Website of the preffered hotel and ask by phone its own price and conditions.In most cases you can negotiate a better price!"}, {"username": "Nadia Filice", "comment_text": "The hotels site directly"}, {"username": "Enrico Lecce", "comment_text": "The hotel you want to stay"}, {"username": "Tami Sue", "comment_text": "I use Expedia but before I book I check the hotel site and if it's around the same price I book through the hotel."}, {"username": "Debra Burroughs Disario", "comment_text": "Hotels. Com"}, {"username": "Tracy Wrinn Mcdermott", "comment_text": "I usually do TripAdvisor and check the reviews then book with the hotel directly. Hotels tend to be easier to deal with directly if you have an issue."}, {"username": "Vita Boziene", "comment_text": "Before I am always used booking. Now I found expedia."}, {"username": "Lauren Danielle", "comment_text": "Direct with the hotel. If you go with a vacation rental, find one with positive reviews then ask the owner if they would prefer for you to book directly through them. Many will say “yes” and give a discount as well."}, {"username": "Lynn Francisco Casella", "comment_text": "Hilton"}, {"username": "Frank Hunt", "comment_text": "Stayz, Airbnb, Booking do com etc."}, {"username": "Jeannie Morris Wierman", "comment_text": "I booked Hilton in Italy thru their website. I am Hilton Diamond member and gain points through them for future travel."}, {"username": "Donna Erickson", "comment_text": "Down load a App [Visit a city ]gives all hotel price and a hole lot more ."}, {"username": "Linda Miller", "comment_text": "I've used bookings numerous times, never an issue."}, {"username": "Shelby Dean Mayorga", "comment_text": "We’ve used Booking for our trips to Ireland and Spain.\n\nWe’ve also already used it for our future trip to Italy.\n\nNever had one issue with Booking so far. 👍"}, {"username": "Carola Blödgen", "comment_text": "No apostrophe"}, {"username": "Libby Cellini", "comment_text": "Well I just got out hotel ressies via American express/\nExpedia because they have a special deal until end of Aug. I saved 10 %!"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2192558474476564", "text": "Hello! A week from tomorrow, I will be attending a concert at RCF Arena in Reggio Emilia. My hotel is there but curious if anyone could recommend a car service in the area or another recommended mode of transportation. I will be approximately 11km from the arena. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2192558474476564/", "likes": 1, "comments": [{"username": "Carmine Castiglia Jr", "comment_text": "Have you asked the hotel staff?"}]}, {"id": "2192564787809266", "text": "Which nice beach with kids in Rome please thank you xx", "link": "facebook.com/groups/1373361046396315/permalink/2192564787809266/", "likes": 17, "comments": [{"username": "Teresa Baldassarro", "comment_text": "There is a nice way to respond it’s not called canceling someone out. Just asking a question without making some me feel stupid!"}, {"username": "Aiga Doma", "comment_text": "If you want beaches with kids in Italy, you don't have to go to Rome! You must go to the coastal cities located by the sea!👌"}, {"username": "Pauline Richardson", "comment_text": "Ostia 40 minutes away."}, {"username": "Simone Brown", "comment_text": "Not being rude...But🤷‍♀️"}, {"username": "Kylie Lee", "comment_text": "Thanks for the question I was wondering if I could visit the coast from Rome and where would be best to go, also thanks for those who answered 💖💖"}, {"username": "Kary LeBlanc", "comment_text": "Kary LeBlanc"}, {"username": "Pietro Di Sorbo", "comment_text": "The closest to Rome is Ostia lido (30 km) but, honestly, I don't like it at all.\nYou can find some nice beaches in Sabaudia (96 km), Sperlonga (149 km), Gaeta (173 km)."}, {"username": "Lia Geloso", "comment_text": "Ostia."}, {"username": "Beverley Milson", "comment_text": "Santa Marinella is a sandy beach about 35 minutes by train from Rome… last stop before Civitavecchia! The children may enjoy the train ride… short walk from station to beach."}, {"username": "David Silverstone", "comment_text": "My wife grew up in Rome and suggests that Anzio is the nicest beach near to Rome but it is an hour away."}, {"username": "Rosa Stervaggi", "comment_text": "Yes, I agree that Ostia is beautiful, and has nice Restaurants and Cafes ❤️"}, {"username": "Maria Angela Perrone", "comment_text": "Roma residents go the the beach in Ostia, which is about 45 minutes away.\nIn Ostia there are also Roman ruins and nice restaurants by the water."}, {"username": "Ed Braz", "comment_text": "Asking questions like this, I’d also choose to do so anonymously 😝 🤦‍♂️"}, {"username": "Daniel Carlos", "comment_text": "There are some beaches near Rome that are accessible by public transportation.\nIn this link are the beaches and how to get there. Enjoy your stay here in Italy! 🇮🇹\n\nhttps://\ntheculturetrip.c\nom/europe/\nitaly/articles/\nromes-8-best-bea\nches-accessible\n-by-public-tran\nsport/"}, {"username": "Kari Wojszczyk", "comment_text": "I would choose Lake Bracciano before the beaches around Rome. Much better for swimming & playing in the water. Beaches around Rome are very dirty…IMO."}, {"username": "Lisa Anne Montesi", "comment_text": "Some of tje beaches in itaëy have stones instead of sand- ouch! Checkout any beach before you go to it"}, {"username": "Lucia Evangelista", "comment_text": "Ostia"}, {"username": "Lucia Evangelista", "comment_text": "Lucia Evangelista"}, {"username": "Lucia Evangelista", "comment_text": "Lucia Evangelista"}, {"username": "Lynn Francisco Casella", "comment_text": "No beaches"}, {"username": "Wilma Voges-Bekker", "comment_text": "Anzio beach easy to go to with public transport."}, {"username": "Felicia LoCascio Whitney", "comment_text": "Santa Marinella"}, {"username": "AnnMarie Rescan", "comment_text": "No beach in Rome"}, {"username": "Sarah McKelson", "comment_text": "Kezia Cool in case we need to go to beech"}, {"username": "Jennifer Budacki Long", "comment_text": "We took a day trip to Sperlonga last year bc Rome was so hot!! It was the perfect getaway for the day! The beaches were lovely, rented a spot and ate at the restaurant on the beach!"}, {"username": "Lucy Jayne", "comment_text": "Santa Marinella or Anzio are both really nice places in my opinion 😊"}, {"username": "Friedemann Diederichs", "comment_text": "As Rome is a classic beach destination, I recommend the Fontana Di Trevi pools. Just bring towels early for the beach chairs."}, {"username": "Nadine Sughayyar", "comment_text": "Fregene is close to Rome, the beaches tend to be wider and cleaner. It tends to be windier there. You can go to the public beaches there, they are less busy than Ostia."}, {"username": "Annalisa Shulde", "comment_text": "Day trip to sperlonga!!!"}, {"username": "Larry Reinier", "comment_text": "Nothing like arguing with strangers"}, {"username": "Ettore de Vita", "comment_text": "Santa Marinella is nice with kids, it’s about 30 chilometri from Rome, they are no beaches in Rome, need to go outside of it"}, {"username": "निनावी सहभागी", "comment_text": "Thank you xx"}, {"username": "Alison Carney", "comment_text": "No beaches in Rome honey!"}, {"username": "Karoline Bakker", "comment_text": "Osteria near Rome 🤣\nOSTIA ofcourse !"}, {"username": "Kristina Ruk", "comment_text": "No sea first of all in Rome ;)"}, {"username": "Lisa Olivo", "comment_text": "There are many beach clubs just outside of Rome"}, {"username": "Veronica Trejo Beebe", "comment_text": "🤦‍♀️"}, {"username": "MaeLeigh Cf Cervantes", "comment_text": "There are beaches only 30 km away."}, {"username": "Georgeann Farinacci Greene", "comment_text": "It’s about 56 km but we went to Terracina (I was at relatives home so it was a little closer)"}, {"username": "Maxine Righi", "comment_text": "Ostia anticha"}, {"username": "Whitney Dixon", "comment_text": "I guess all the people laughing don’t realize that people that live nowhere near a beach and never get to visit one, wouldn’t mind driving 45 mins to see a beach in Italy lol."}, {"username": "Diane Maly", "comment_text": "And if she had typed NEAR Rome would you all just answer her question kindly or just be the way you are anyway?🤨"}, {"username": "Ines Psaila", "comment_text": "Why anonymous participant?"}, {"username": "Emmy Buijs", "comment_text": "Ostia (Lido). You can go by public transport. You have to go to metro station Piramide from there you can take the metro to Ostia lido."}, {"username": "Jan Kulpiński", "comment_text": "Ostia!!"}, {"username": "Claire Dowson", "comment_text": "Get the train to Anzio. It’s a lovely beach resort."}, {"username": "Vicky Moore", "comment_text": "Ostia."}, {"username": "Chavdar Slavchev", "comment_text": "Anzio, Ladispoli…3 euro 💶 distance from Rome"}, {"username": "Carlene Reader", "comment_text": "Ostia is beautiful and great for families. Nice cafes and gelato for after your swim too 😊"}, {"username": "Frank Hunt", "comment_text": "Beaches next to Fiumicino, near the airport."}, {"username": "Nikki Harrow", "comment_text": "We went to Civitavecchia, just over 1 hour from Rome. It is very cute."}]}, {"id": "2192565001142578", "text": "Looking for recommendation regarding photography. My husband & I will travel to Italy in September. Curious if people travel with their cameras or use their phones for pictures?", "link": "facebook.com/groups/1373361046396315/permalink/2192565001142578/", "likes": 0, "comments": [{"username": "Matteo Malto", "comment_text": "They use both 😊"}, {"username": "Ruth Simmons", "comment_text": "Our trip in May was my first without my Canon, and while I missed it sometimes, carrying the camera and several lenses would have been too cumbersome as we were travelling by train with our luggage. I did upgrade my phone to iPhone 14pro, and was very pleased with the results."}, {"username": "Gina Spyker Fairfield", "comment_text": "I brought my camera. It’s a Canon PowerShot SX70, and it was still small enough to fit in my Travelon crossbody bag but has great zoom capabilities with no additional lenses needed."}, {"username": "Ana Castro - Oy", "comment_text": "They do both, and if you're willing to hire someone for a photo session, I'd recommend flytographer.co\nm in this website you can find a photographer anywhere you go."}, {"username": "Lida Sawka- Sarnecky", "comment_text": "Thank you for the replies!"}]}, {"id": "2192565544475857", "text": "Hi everyone, thank you for all of your informative posts.\nMy husband and I are heading to Italy for the month of April next year, with a couple of days in Switzerland the second week of April so tips on weather, clothing, do we need mosquito repellent etc at that time of year and any other suggestions would be appreciated.\nThanks heaps.", "link": "facebook.com/groups/1373361046396315/permalink/2192565544475857/", "likes": 1, "comments": [{"username": "Alessia Zito", "comment_text": "Usually in april there is a mild climate here but this year it was still cold, you can bring quite light clothing and a couple of sweatshirts if it gets colder\nNo, there are no flies or anything in that period"}]}, {"id": "2192567684475643", "text": "We will be in Florence at the beginning of October with our family of 5 adults. We would like to see Tuscan views & villas, but we are not alcohol drinkers, so not sure about going on a wine tour. Does anybody have any ideas for us to accomplish this in a budget of about $100 per person? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2192567684475643/", "likes": 0, "comments": [{"username": "Francesca Messina", "comment_text": "You can do a vespa tour in the Chianti countryside 😁"}, {"username": "Ana Castro - Oy", "comment_text": "You can do a farm to table experience with local families or small restaurants. You can also have a trip to Brisighella and enjoy the magnificent views!"}]}, {"id": "2192568151142263", "text": "Motion sickness… I get it really easy so I took a bottle of Dramamine with me and took one every morning because I knew I would be on trains and buses and golf carts and windy roads. It really saved me a few times. I got the nondrowsy 12 hour formula. ￼ I just wanted to share in case anyone had similar concerns. ￼", "link": "facebook.com/groups/1373361046396315/permalink/2192568151142263/", "likes": 3, "comments": [{"username": "Alessandro Iannelli", "comment_text": "I have to say, I suffer from motion sickness myself but I've never experienced it on a train."}, {"username": "Robin Burkholz Shaham", "comment_text": "I bought travel gum in Italy at the pharmacy and it really helped me as well."}, {"username": "Susan Siewko Cos", "comment_text": "I took Dramamine a few times. The 1.5hr drive from Florence to a Tuscany got me and I was dry heaving in the parking lot of a vineyard. Way to make an entrance 🤢. But even worse. The drive from Positano to Naples I ended up on the side of the highway throwing up. And If you know the driving there it was very unsafe to do that. I took Dramamine, sat upfront and wore anti-nausea bracelets. I was a wreck.\nBut I had 2 8 hour boat days and a few train rides and didn’t need an medication. The driving there is intense."}, {"username": "Stephanie Earl Peterson", "comment_text": "I had a prescription for the patches from my doctor. That was my plan was to just put one of those on every three days. But it messed with me bad. I've never used them before. My vision was so blurry I couldn't read my phone. I felt dizzy and loopy for the first full day. I am glad I had Dramamine with me just in case. I tried finding some more at a pharmacy in Florence with no luck. But they may have had something else that would've helped. ￼"}, {"username": "Rosemary Faccadio Kenyon", "comment_text": "I got the patches from my doctor and they worked great."}]}, {"id": "2192569951142083", "text": "I am coming the last week of October/first week of November with 3 teenage boys. We have 5 days to go where ever we want and have to be in Milan on day 6. We will then have 5 nights in Milan, but can take day trips or maybe 1 or 2 overnights someplace nearby there. Looking for recommendations. We love beauty and adventure. Only 1 out of 4 of us are interested in much history.\n\nStart in Rome, Florence, or Venice? Is there someplace better?\n\nDay trip to cinque terra? Is it too cold then?\n\nDay trip to Lake Como?", "link": "facebook.com/groups/1373361046396315/permalink/2192569951142083/", "likes": 0, "comments": [{"username": "Alessia Zito", "comment_text": "In the Cinque Terre in that period the climate is still mild, very nice to visit\n\nVisit como lake, there are so many wonderful places in those areas, varenna (visit the hotel villa cipressi in varenna as well as the city, wonderful view) villa del balbianello and orrido di nesso"}, {"username": "Alessia Zito", "comment_text": "Both rome and florence are beautiful but having a few days available in my personal opinion it is better to see other cities, rome is huge and full of things to see, a few days is very little, you should make another trip to see all that rome offers.\nBut milan-lake como (and surroundings) cinque terre and venice is perfect, they are more or less all close to each other and you can see everything!\nif you go to venice visit the island of burano."}, {"username": "Shana Woodfield", "comment_text": "Varenna, Lake Como. It might be cold, but worth it."}]}, {"id": "2192571591141919", "text": "Suggestions for must visit places IN/AROUND Rome for 2 days trip...?", "link": "facebook.com/groups/1373361046396315/permalink/2192571591141919/", "likes": 1, "comments": [{"username": "Elena Eugeni", "comment_text": "If you only have two days I would focus on the more classic destinations. A tour of the historic center in Rome should be done, perhaps in the cooler hours of the day. Trastevere is also worthwhile, to visit there is Santa Cecilia which has wonderful Roman remains underneath and there are also lots of nice restaurants. Avoid the Vatican museums if you are short on time. It is hot at the Colosseum so it should be booked for early morning or late afternoon. Other museums worth a visit are the Capitoline museums or perhaps Doria Pamphili Palace. The Terme of Caracalla are also nice. Domus Aurea Is amazing but you have to book in advance.\nAround Rome I recommend Tivoli with Villa Adriana or maybe Castel Gandolfo."}]}, {"id": "2192577764474635", "text": "Planning a trip in September 2024. We want to do Rome and the riviera. Where can we go in between for a few nights that's quaint and inland? I booked Matera but I'm worried it will be too far.", "link": "facebook.com/groups/1373361046396315/permalink/2192577764474635/", "likes": 0, "comments": [{"username": "Mike Ball", "comment_text": "Matera is a fair distance from Rome and in the other direction if you are heading to the North of Italy,\n\nI’d suggest finding somewhere in Tuscany, plenty of options to choose from."}, {"username": "Francesca Messina", "comment_text": "I believe you’re talking of “riviera romagnola”. Well Matera is too far 😅 I suggest Umbria (Assisi or Perugia) and Urbino in Marche (it’s the hometown of Raffaello 😉)"}, {"username": "Danilo Esse", "comment_text": "Wow matera is far from Rome...but is one of the best places i ever been in my life"}, {"username": "Giovanna Mazzariello", "comment_text": "We decided to fly into Rome, then head to Siena, back to spend a few days in Rome and down to Ravello"}]}, {"id": "2192578044474607", "text": "Getting ready for a trip to Venice, Florence and rome with my mother seeing points of interest along the way. This is a bucket list trip. We started planning this after she was cancer free and was postponed during Covid. Since my mom did a lot of the leg work booking and researching this trip I’d love to treat her to a finer dining experience inआणखी Florence or Rome since we will be spending the most time in these cities.\nDoes anyone have any recommendations for a great dining experience?! anywhere that accepts reservations will be a plus as I’d like to surprise her and fit this into our trip as a small token of my appreciation to say thank you!\nAny other general recommendations always welcome 🙂", "link": "facebook.com/groups/1373361046396315/permalink/2192578044474607/", "likes": 1, "comments": [{"username": "Karen Landini", "comment_text": "For Florence...https://\nwww.4leoni.it/\n?lang=en"}, {"username": "Karen Landini", "comment_text": "For Florence...https://\nwww.casatrattori\na.com/\ntrattoria-13-gob\nbi/"}, {"username": "Susan Siewko Cos", "comment_text": "https://\nmaps.apple.com/\n?address=Via+del\n+Parione+74%2F7\n6+R%2C+50123+Fl\norence%2C+Italy\n&auid=112158041\n97623125058&ll=\n43.770903%2C11.\n248962&lsp=9902\n&q=Ristorante+P\narione&t=m\n\nI ate here last week. It was incredible."}, {"username": "Robin Burkholz Shaham", "comment_text": "If you are staying in hotels the concierge or front desk will make excellent recommendations\nand book the reservation for you. If you are not going during high season then it will be much easier. Italy is an amazing country and their main industry is tourism. You and your mom will have a wonderful time and I’m so happy she is cancer free! La dolce vita. ❤️"}, {"username": "Elena Eugeni", "comment_text": "I have tons of places to recommend. What would you like to eat? Are we talking about Michelin star restaurants or classic good trattorias?"}, {"username": "Ivana Profe", "comment_text": "https://\ngofund.me/\nb1a7030a"}]}, {"id": "2192580297807715", "text": "I am leaving for Italy next Friday and will be staying at Lake Como (Varenna) and Cinque Terre (Monterosso) for one week each. I know it is VERY BUSY this time of year. I was wondering if anyone had any experiences with the beach Lidos--specifically wondering if you need reservations. Also, anyone go to Portovenere and have any tips. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2192580297807715/", "likes": 0, "comments": [{"username": "Linda Lloyd Bowles", "comment_text": "We didn’t have any issues getting chairs and umbrella on the Monterosso old town beach in July.\nAnd we took the ferry from Monterosso to Portovenere one day. You could probably also catch the ferry in Vernazza, as the ferry will stop at the villages if seas allow. However keep in mind that ferry or any boat service depends on the sea conditions. They are often cancelled.\nFrom Portovenere we took the ferry to Riomaggiore and then took the train back to Monterosso."}]}, {"id": "2192587944473617", "text": "Hello everyone! Just had a quick question. How much time should we allow ourselves after landing to go through customs and baggage claim? I am just wondering, so I know an accurate time to purchase a train ticket after landing. my flight is scheduled to land at noon and I am planing on buying a train ticket to take us from Rome airport--> Napoli Centrale. Is it better to purchase train ticket in advance or can you buy the same day?", "link": "facebook.com/groups/1373361046396315/permalink/2192587944473617/", "likes": 5, "comments": [{"username": "Maria Musumeci", "comment_text": "I'd definitely buy in advance. Give yourself at least an hour for customs. Sometimes it's quicker & sometimes longer."}, {"username": "Janet Messanelli Bozzone", "comment_text": "Customs is unpredictable and often dependent on the time you land. I wouldn’t bother trying to book in advance. There is only one direct train a day from FCO to Napoli Central that leaves at 9:38. So unless your flight lands at least 2-3 hours before that you will likely have to go to Roma Termini first. The Frecce trains leave frequently from Termini (like half hour or less) and are usually not full. We took the train to Florence through Termini once, and although seems counterintuitiv\ne, I’d take a taxi, Uber or car service to Termini. The Leonardo express station is at terminal 3, so if you arrive at one of the other terminals you have to get there first. Unless things have changed, we had a really long walk to get to our transfer…pullin\ng our suitcase. A car will let you off in front and it is much easier to get to buy your ticket and get to your binario to Naples Centrale. Of course, you can easily purchase the tickets on line now, which wasn’t the case when we went. 🙃"}, {"username": "Alyssa Culverwell Ostergren", "comment_text": "We found because we had a child under age that it definitely took longer."}, {"username": "Susan Siewko Cos", "comment_text": "Buy tickets. Everything is a bit slower and takes longer…except driving. That’s at light speed."}, {"username": "Robin Burkholz Shaham", "comment_text": "Purchase in advance if possible and travel either business or first class. This is best for comfort and keeping your luggage close to you. Have a fantastic time.\n\nI’m not sure about baggage and customs. I traveled with a carryon and it went quickly."}, {"username": "Karon Patterson", "comment_text": "It took us about 2 hours to get our luggage in Rome so it’s hard to tell.😆"}, {"username": "Peter Rasmussen", "comment_text": "Where are you coming from? Direct flight?"}, {"username": "Sandy Radican Shikaly", "comment_text": "First you go through immigration.. next collect baggage .. then customs is a walk through if nothing to declare... baggage can be 10 min or 60🤷‍♀️"}, {"username": "Hannah Parks", "comment_text": "Multiple flights are getting delayed and customs is sooo unpredictable. I wouldn’t buy your ticket in advanced. Unless it’s transferable, but even that might be a headache to get rescheduled."}, {"username": "Giorgio Zanichelli", "comment_text": "the train from the airport to rome runs all the time and seats don't exactly run out\nso it's actually smarter to book your train from rome to naples in advance for a few hours after landing. But for the train from the airport to rome, it's actually better to buy it right there at the ticket machine when you're done with customs andgot your luggage"}, {"username": "Jenny Payne", "comment_text": "I would buy it when you arrive, anything can go wrong , not worth the stress if your running late 🌻"}, {"username": "Diane Plott Miller", "comment_text": "So many flights are canceled or delayed that I’d wait."}, {"username": "Virginia Lane", "comment_text": "I bought 3 hours from landing time. You have to take the train from the airport to Rome and then on to Naples."}, {"username": "Jules Earl-Rossiter", "comment_text": "You really can't say how long it will take you to go through customs etc...It all depends on how many flights have arrived and unfortunately there is no way you would be able to find out...also delays and flight ✈️ cancelled...I personally would wait until you have gone through these areas at the airport....🙃"}, {"username": "Gillian O'Callaghan", "comment_text": "Customs is last and takes no time at all if you have nothing to declare. However immigration then baggage claim is so hard to determine as very dependent on number of flights that arrive as yours does and staffing levels. Get your ticket after you exit....then no stress about timing etc."}]}, {"id": "2192588907806854", "text": "Is riding a Vespa in Tuscany a thing and if so where is a good scenic ride. We will be staying in Orvieto and in Florence.", "link": "facebook.com/groups/1373361046396315/permalink/2192588907806854/", "likes": 0, "comments": [{"username": "Tad Hashimoto", "comment_text": "There are various guided tours that will pull you around Tuscany, stopping at various locations. If you don't have previous scooter or motorcycle experience, this is what I'd recommend. Driving in Italy isn't for the feint of heart. Driving in a major city center is nuts and not for the inexperienced.\n\nIf you have riding experience, plan your own ride. Download an area map on Google Maps on your phone, slap the phone on a mount on the rental scooter.\n\nWhen we went last month, we took a couple rentals out of New Tuscany Scooter Rental, which I recommend.\nI pre-planned a route out of Florence, south through Strada, Greve, Montefioralle, Panzano, Castellina, and Radda, then back up through Volpaia. We didn't plan anything specific in each town, just stopping for sightseeing and food as we wanted. We made it as far as Panzano before turning back due to time concerns. The entire route would be doable if you're more focused on the ride than on the stops, but we have no regrets. It was definitely one of the best days of our trip.\n\nHopefully this Google Map link works for you.\n\nFlorence - Scooter Map\nhttps://\nmaps.app.goo.gl/\n5Tg47EhtKvznGY5M\n9?g_st=ic"}, {"username": "Ken Lerch", "comment_text": "From downtown Florence go up the hill to Fiesole."}]}, {"id": "2192600731139005", "text": "We are travelling to Italy at the end of the month. I’m wondering about purchasing a SIM card for my phone. Any suggestions as to where to get one? Can I get one in the airport in Frankfurt? We have a 3 hour(🤞🏻) layover there. Suggestions would be welcomed.", "link": "facebook.com/groups/1373361046396315/permalink/2192600731139005/", "likes": 1, "comments": [{"username": "Simone Pfenninger", "comment_text": "Buy the TIM Sim card in Italy. Available at the Airport, but cheaper downtown."}, {"username": "Matteo Malto", "comment_text": "Sim and vodafone are the most common and their signals take everywere"}, {"username": "Daniel Jegerlehner", "comment_text": "I misread you question. for SIM cards.. you could go to this page:\nhttps://\nwww.traveltomtom\n.net/\ndestinations/\neurope/italy/\nbest-prepaid-ita\nly-sim-card."}, {"username": "Nicola Amy MacDonald", "comment_text": "Vodafone €20 for a month and it has 200gb of data plus calls etc. great reception too"}, {"username": "Heather Sechrist", "comment_text": "We looked in the airport and didn’t find it… asked for assistance and still didn’t find it. Lol\n\nPre download maps.me for the region and find when you get there. We went to a TIM store and they set us up quickly! Easy peasy."}]}, {"id": "2192596884472723", "text": "Working on my itinerary. Will be staying near Lucca. We will have a car and want to drive to Cinque Terre. Where will we park??", "link": "facebook.com/groups/1373361046396315/permalink/2192596884472723/", "likes": 0, "comments": [{"username": "Francesca Messina", "comment_text": "You can park at La Spezia (under the train station) and from there take the express train for cinque terre"}, {"username": "Hege Benedicte Runge", "comment_text": "You can also park in the harbour, take the ferry, the train back again and then walk back to the car. Did it yesterday and it was a very nice trip 🙂"}, {"username": "Sara Punis", "comment_text": "Somewhere in La Spezia. From there you have a train in all of 5 vilages of Cinque terre"}]}, {"id": "2192600797805665", "text": "Hello,\nI am staying in Genoa and I was wondering if you could go to Portofino or Cinque Terre for the day!\n\nAll the tours on get your guide was very expensive (over 100€) just for transport pretty much. Is there anyway you can get there with public transport ? Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2192600797805665/", "likes": 2, "comments": [{"username": "Francesca Messina", "comment_text": "Yes you can do It! From Genova there is the regional train to Monterosso (It takes about one and half hour). And from monterosso you can buy ticket for the express train for cinque terre and visit the other places."}, {"username": "Scott Perry", "comment_text": "Sestri Levante, Camogli, Santa Margherita Ligure are also reachable by train, and are closer to Genoa."}, {"username": "Ann Lombardi-Perkins", "comment_text": "You can easily get to both by train. Enjoy Genova, it's a wonderful city."}, {"username": "Alessandra Vagge", "comment_text": "You can easily reach Santa Margherita by train from Genova and then get a bus or pubblic boat to Portofino; if you want you can also walk.\nOr ask for a pubblic boat from the center of Genova, Porto Antico, to Portofino."}, {"username": "Kay Rendall", "comment_text": "We got train Genova to CT. Believe there's a new faster train now."}, {"username": "Miyuki Kanno Paul", "comment_text": "We did. Take a train to Santa Margarita Ligure, then catch the bus just outside the train station to Portofino. We had lunch, took the same way back to the train station and got on a train to Vernazza. Going back to Genova, you may have to transfer another train somewhere on your way to Genova. Know which 2 Genova stations(Genova\nBrignole or Genova Principe) you will be getting off at"}, {"username": "Nadia Waugh", "comment_text": "You can even walk from Santa Margarita apparently"}, {"username": "Simone Pfenninger", "comment_text": "Easily on your own by train"}, {"username": "Steph Craddock", "comment_text": "Catch train to Camogli then take ferry to Portofino. (puoi can also stop at San Fruttuoso, with its ancient abbey and wonderful beach. ) From Portofino catch ferry to S.Marghert(or there's a nice walk) then train back to Genova. 5 Terre is also easy. Sestri Levante, Moneglia are also worth a visit."}]}, {"id": "2192600857805659", "text": "…Planning our second trip to Italy. Last trip we visited Rome, Naples, Almafi, Taromina Sicily. This time considering, Lucca as home base to explore Tuscany area. Has anyone stayed in Lucca? Is it a good spot to stay? Or should we just stay in Florence?\nSecond leg of trip Sicily again loved so much want to see more of the island. Want to rent carआणखी and drive the island, not sure of destinations yet but want to end trip in Palermo to fly home. Any suggestions must see in Sicily. I’m thinking a week in each area.\nThank you, appreciate any suggestions.", "link": "facebook.com/groups/1373361046396315/permalink/2192600857805659/", "likes": 3, "comments": [{"username": "Hen Garrett", "comment_text": "I love Lucca. It’s really pretty and although busy wasn’t as busy as Florence and is obviously a lot smaller. There is a train station so you can get around eg Pisa, Pistoia and Florence or you can park a car outside the city walls (easy walk in)."}, {"username": "Scott Perry", "comment_text": "100% what Hen said. Lucca’s great."}, {"username": "Barbara Asaro Sciuto", "comment_text": "I loved Lucca!"}, {"username": "Christine Malota- Kendall", "comment_text": "I’m lucky to have traveled to Florence (and stayed in Florence several times). I love the idea of staying in the outskirts of Florence!!! I’m gonna steal that idea for my next trip."}, {"username": "Luisa Ravenna", "comment_text": "In Sicilia I would suggest the eastern part: Ragusa Ibla, Siracusa and Ortigia, Noto, Scicli, Marzamemi, Modica, Etna...."}, {"username": "Laura Law", "comment_text": "Lucca is where I would buy a place if I could! If you can try to stay within the walls of the town! Very fun! Check out the Lucca Music Festival to see if there is anything going on while you are there!"}, {"username": "Kay Rendall", "comment_text": "Loved Syracuse and Erice in the mountains, specially evenings in Erice"}, {"username": "Vicki Susie Naab Gandolf", "comment_text": "Loved Lucca. Took a guided walking tour that was wonderful"}, {"username": "Mary Agozzino Derrick", "comment_text": "Definitely stay a few days in Ortigia"}, {"username": "Jules Blumke", "comment_text": "Lucca is beautiful."}, {"username": "Marianne Oteri", "comment_text": "Agrigento has the valley of the temples, which is an amazing place to visit. Also did an ATV day in Ribera. So much fun and the folks were so nice. Beautiful scenery driving around the the vehicles."}]}, {"id": "2192604104472001", "text": "Hello! My husband and I (ages 26) are planning to go on our first Europe trip next fall. Since we have never been we are anxious about how much money is necessary to have in the budget. We would like to do around a week in Italy. Aside from flights, how much would you save for this trip? We are open to staying in airbnbs or hotels. Also, how far in advance is best/recommended to book flights? Thanks 😊\n\nOpen to any first time European travel tips as well!", "link": "facebook.com/groups/1373361046396315/permalink/2192604104472001/", "likes": 0, "comments": [{"username": "Maria Musumeci", "comment_text": "I'd be budgeting, aside from flights, around €3000-€7000, depending which country you're from then convert that to your dollars. It depends if you prefer 3 star or 5 star accommodation. Can range from €150-€500 per night! Then factor in tours, trains/buses/\ntaxis & food too. Also some spending money.\nI'd be booking flights 6mths in advance.\nBook direct with hotels or through booking-com."}, {"username": "Dave Conroy", "comment_text": "Best bet is check on Booking and airbnb in the cities/towns/\nareas you want to viti for a ballpark of what you get for different prices. I'm a tight wad and spend most time out of the accommodation, so budget £+/-400 for a week. I just want safe, clean and convenient I budget £50 or so per day for main meal, coffee, transport, stuff. Then just pay whatever gallaries/\nsites, etc cost. This is all over Europe, not just for Italy. Some people spend my week budget + in a day, so haha, all up to you. I never slum it. I shop around carefully."}, {"username": "Jenny Payne", "comment_text": "Italy is not cheap these days in airb&b, or hotels . I go to Italy a lot and I stay in a 3 star hotel in Rome near the termini & that her night is €155per night and Florence airb&b is €181.00 per night for 2 people 🌻"}]}, {"id": "2192616054470806", "text": "Hello,\n\nJust after some advice… traveling in January.\nWe are landing in brindisi and have booked accommodation up through matera to, amalfi coast to, pompei, to rome, to Florence, to venice and then milan.\nWould you suggest a hire car or trains to each place?\n\nmany thanks 🙏🏻", "link": "facebook.com/groups/1373361046396315/permalink/2192616054470806/", "likes": 1, "comments": [{"username": "Kay Rendall", "comment_text": "Amalfi Coast closes down around November, b&bs, restaurants, ferry's,. buses etc because it is so very cold. Lots locals leave to visit family for holidays in Rome etc.\nWould check travel guides, do more checking on the situation.\nMajor cities r different because they cater for locals, not tourists"}, {"username": "Kay Rendall", "comment_text": "Would also check Matera, r the restaurants, b & b open. These areas rely on tourists, work 12 hr days. Then maybe November to March, chill, visit family, rest, see friends, recover ready for the next tourist season, which depending on area may start April, May."}]}, {"id": "2192636054468806", "text": "hi all i’m tossing between esims Airalo or Holafy Ill be away in Europe mainly Italy for 7 weeks which do you thing will be best in terms of coverage and amount of data. Airalo offers 10gb for 60 days whereas Holafy is unlimited I just want to make sure the coverage and customer service is pretty good in case I have any issues. Regards", "link": "facebook.com/groups/1373361046396315/permalink/2192636054468806/", "likes": 0, "comments": [{"username": "Susan Levine Solomon", "comment_text": "check out twoticketsanywh\nere.com They discuss the options in detail:)"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2192648171134261", "text": "What should I expect to pay per adult for food in Southern Italy? And a child per day? Just tying to get an around about idea as too how much we will Need for food. I have a 6,8 and 12 year old and myself and my husband. TIA", "link": "facebook.com/groups/1373361046396315/permalink/2192648171134261/", "likes": 8, "comments": [{"username": "Lisa Silverman", "comment_text": "Breakfast around 10 euros, lunch 12-18 euros and dinner 18-26 euros depending on where you go."}, {"username": "Scott Perry", "comment_text": "Alternatively, if you eat simpler, a cappuccino and a brioche will cost about 4 euros. For me, a five euro sandwich from a bakery was usually enough for lunch. A splurge meal— a pizza and a couple glasses of the house white wine, could be had for under 15."}, {"username": "Colleen Dawson", "comment_text": "If you download the app The Fork, you can look at restaurant menus in the city you are visiting and it will give you an idea of prices. You can also use it to make reservations ."}, {"username": "Lauran Cantwell", "comment_text": "If we're talking 3 meals a day, I'd budget $15 for breakfast, $25 for lunch and $35 for dinner....or about $75pp per day. I'd do about 1/2 for kids meals. So for your family, I'd say about $200 per day. Obviously, some days will be much less but some days will be more so it will probably even out."}, {"username": "Allan Olexa", "comment_text": "We shop the wonderful grocery stores and street markets preparing our own meals in our Airbnb. We do buy take away entrees too. Our food budget is not expensive."}, {"username": "Sonia Scotto Lubrano", "comment_text": "This really depends where you’re eating. I’m about to order a Margherita pizza a town outside of Naples for €4.50. And my 5&7yo can split it.\n\nLast week I spent €30 on two espressos and two croissants in capri."}, {"username": "Berndt Weihs", "comment_text": "Depends what you want to eat.Pizza,Spagh\netti or seefood? A Pizza or Spaghetti are 8-11,-€,seafood\ncan be 15-25€!"}, {"username": "Berndt Weihs", "comment_text": "Always such questions from US citicen.What would you answer if I'm asking the same for NY and don't tell if I want to visit a McDonalds or a high level restaurant?"}, {"username": "Lisa Gaimaro Sullivan", "comment_text": "The food costs less than in the US. I think whatever you would spend when vacationing (we normally have a late breakfast and an early dinner and skip lunch), I would budget less than you would here. We were pleasantly surprised by the prices. Also does your hotel have free breakfast/\ntours have lunch included? We don’t drink, so a big bottle of sparkling water, which we split, with dinner was only about 3 euros."}, {"username": "Frank Hunt", "comment_text": "Always budget at you home town restaurant and cafe prices as a rough guide, it depends how and where you eat."}, {"username": "Maria Coladangelo Ducca", "comment_text": "This really depends on your taste. You can eat very cheaply at a owner operated trattoria . Remember that cash gives you the better deal"}, {"username": "Bella Cassandra", "comment_text": "I have my 3 daughters here now 10,11,13 yo we spend collectively 100 a day on food. I’m not sure where ppl are eating or how much but 2 adults and 3 kids should fine with 200 a day easy. We usually order 2 meals at dinner, grab a sandwich each for lunch and a pastry each for breakfast. This includes drinks and gelato lol this is for southern Italy strictly"}, {"username": "Bella Cassandra", "comment_text": "Oh and get accommodations with breakfast!!"}, {"username": "Melissa McCormick", "comment_text": "We were about 100-200 per day for 2 adults and 2 kids. We have smaller kids so they always split a meal at nicer places. We pretty much always got dessert at a drink as well."}, {"username": "Jenny Payne", "comment_text": "Always eat off the main streets & I found the portion sizes are large for me even as I don’t eat a lot🌻"}, {"username": "Louisa Curvelo", "comment_text": "Share food as the meals are big...buy snacks at the super market too"}, {"username": "Dana Green", "comment_text": "I mean, pasta dishes at local trattorias and restaurants that are not near touristy hotspots are 10-16 euros, pizzas are around 6-10 euros. You normally buy sparkling or bottled water at 2-4 euros for a bigger bottle. There’s desserts, like gelatos that are on average 4 euros. Breakfast items are normally an espresso or a sweet pastry. Not a lot of American breakfasts to be found."}, {"username": "Dana Green", "comment_text": "I gave myself and my daughter 2k euros for food for 17 days. I’m def. under budget. Food is cheaper than I thought."}, {"username": "Rita Levi Montalbano", "comment_text": "For a family of 5 consider like 20/25 for the breakfast, maybe 75 for lunch and like 100 for dinner. Prices for all family members included, try to save money by eating in \"trattorias\" and \"osterias\" and avoid restaurants in the main squares"}, {"username": "Danielle Scomazzon", "comment_text": "Ange Renae Nella Pringle"}, {"username": "Anne Davidson", "comment_text": "Dine in osterias or pizzerias. Ristorantes are more expensive. Avoid any place that has an English menu. Look for small family run places. I haven’t noticed children’s meals so for them you could probably share plates. Buy premade sandwiches for lunch. Supermarkets often have pre made meals or salads. Buy fruit. The quality of food products is high."}]}, {"id": "2192655384466873", "text": "We're embarking on an exciting road trip around the breathtaking regions of Umbria and Tuscany. Our first stop is the enchanting village of Bagnoregio, but we'd love your input for a stop along the way fromआणखी Rome Fiumicino.\n\nDo you have any hidden gems, charming towns, or must-see sights that you'd recommend we explore? Whether it's a picturesque vineyard, a historical landmark, or a mouthwatering local trattoria, we'd love to hear your suggestions!\n\nPlease share your recommendations and feel free to tag your friends who might have great ideas too!", "link": "facebook.com/groups/1373361046396315/permalink/2192655384466873/", "likes": 1, "comments": [{"username": "Tori Tamburi", "comment_text": "Perugia, Toscana, Lago Trasimeno. All gorgeous. My husband is from Italy and we just spent 3 weeks there in the Umbria area. He is from Magione, so we stayed close by and these were some of the places we went to! It was my first time in Italy and I told him that I was so thankful for my experience. I didn’t see Rome or any big cities, but I feel like I got a true immersion experience by visiting these small, quaint towns instead."}]}, {"id": "2192660181133060", "text": "Arriving early morning in Rome as my flight comes in at 8:15am and check in for the hotel isn’t till 2:00pm. My problem is I read the reviews for the hotel and there were more than one review saying their luggage was stolen and the area is known for robberies. I booked through Costco travel and the hotel got 4.6/5 stars so I assumed it was legit.", "link": "facebook.com/groups/1373361046396315/permalink/2192660181133060/", "likes": 0, "comments": [{"username": "Karen Landini", "comment_text": "Email the hotel to ask if early check in is possible. I do that every time and about half the time I get in early. Also, where is your hotel? Maybe store bags at the train station instead."}, {"username": "Linda Chase", "comment_text": "Confirm that hotel has locked luggage storage room."}]}, {"id": "2192669594465452", "text": "Hi we are gg to Italy for 17 days in December. Anyone knows if Naples/Sorrento area will be dead and closes over Christmas?\nWill the inter city speed trains still be operating on 25 and 26 dec?\nDo we have to stay near train stations (and pay higher for Lodging) to avoid dragging our luggage on cobblestones streets in Italy?\nIs it a good idea toआणखी visit Amalfi in December (understand it’s jus beach so will it be too cold )\nShould we do both Pompeii and Herculean or just do one cos they may look the same?\nWill 5 days in Rome be too long?\nWill 4 days in Naples/sorrento be ok?\nThanks folks!", "link": "facebook.com/groups/1373361046396315/permalink/2192669594465452/", "likes": 0, "comments": [{"username": "Daisy Yoo", "comment_text": "I know it is not a good idea for amalfi coast why we changed our plan but u can do Naples Pompeii and Herculean (I would do both) ,"}, {"username": "Ben Parlopiano", "comment_text": "First of all what is gg? With regards to the trains, we were in Bologna, Modens and Venice a little ove a month ago. There were planned rail strikes. We needed to get private transportation from Bologna to Modena. I don't know if you can get a planned strike schedule this far out."}]}, {"id": "2192692864463125", "text": "My husband and I decided 2 weeks ago to take a trip to Italy in 3 weeks! We have two kids joint that are 9 and 7. They are so excited. I would love to capture their first trip to Italy with family photos. Any recommendations for a professional and where to take them? We are going to Florence, Amalfi and Rome. In addition, any recommendations for things kids would appreciate please share!", "link": "facebook.com/groups/1373361046396315/permalink/2192692864463125/", "likes": 1, "comments": [{"username": "Alessia Orru", "comment_text": "Ciao, io sono italiana e vivo a Roma. Per quanto riguarda Firenze puoi girartela completamente a piedi, al massimo puoi prendere un autobus per arrivare a piazzale Michelangelo e godere di una bellissima vista su Firenze.\nPer roma, beh che dire.. perdetevi completamente nella bellezza di Roma, in ogni dove c'è qualcosa da vedere è da fare. Poaso consigliarti come punto di appoggio Trastevere in quanto ha una stazione ferroviaria da cui puoi raggiungere Fiumicino (aeroporto) e le due stazioniferrovi\narie principali (tiburtina e termini). Occhio solo alle temperature a roma, stiamo toccando letteralmenre i 40 gradi. Buon viaggio :)"}]}, {"id": "2192711747794570", "text": "Hello 😃 Has anyone used a transfer service in La Spezia? We will be docking there next month as part of our cruise itinerary, and would like to organise a private, one way transfer from the cruise terminal to Monterosso in the Cinque Terre. We are then looking to catch the ferry back to the port, stopping in at the towns along the way. We are just wanting to avoid the busyness of the train in getting to Monterosso…. thank you! 🙂", "link": "facebook.com/groups/1373361046396315/permalink/2192711747794570/", "likes": 0, "comments": [{"username": "निनावी सहभागी", "comment_text": "Bump"}]}, {"id": "2192712041127874", "text": "Hi Everyone. We are heading to Italy in September. We are planning on getting a car in Rome to head to a house we have hired near Todi (Umbria) but we are scared of driving in Rome. Would we be better off going back out to the airport to get a car? Any tips on the best place to hire the car so we don’t do too much driving in the city would be welcome 😊. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2192712041127874/", "likes": 0, "comments": [{"username": "Stephanie Garofalo", "comment_text": "Yes, pick up and drop off at the airport; the drive to Todi is an easy one."}, {"username": "Giovanni Pianigiani", "comment_text": "I suspect car hire at the airport might be slightly more expensive. I'd be more concerned about returning the car: driving out from the city center might be stressful, but navigation should be straightforward\n; driving back in will be equally stressful but navigation might be more challenging. Also consider that car rental at the airport is likely to be 24/7, while offices in town could have limited opening times"}, {"username": "Linda Brecher Bekoff", "comment_text": "We had a great experience renting a car by the Orvieto train station. Quick local train Rome to Orvieto. Orvieto is a nice day destination also but closes down at lunch time so go early. Driving out of there was simple. We based ourselves in Cortona and explored many other towns including Todi."}, {"username": "Rita Kanten", "comment_text": "Get the car from the airport! Do not attempt to drive in Rome! Leaving the airport is pretty straightforward\nbut renting a car in Rome and then trying to get out of the city is a nightmare."}]}, {"id": "2192715207794224", "text": "Let’s talk flight costs. Tips for how far in advance, tricks, and best months to purchase for lower price trip in May? I haven’t been to Italy in 9 years. It’s so much more expensive to fly there now.", "link": "facebook.com/groups/1373361046396315/permalink/2192715207794224/", "likes": 2, "comments": [{"username": "Carmela Noble", "comment_text": "I’m booking for next June as soon as the flight schedule becomes available on my airlines website this week. I think there is some fluctuation until departure but at 1000 CAD it’s the cheapest I think it will be."}, {"username": "Daisy Yoo", "comment_text": "Question might be too broad , I bought my ticket for early Dec in April , I do direct to Rome and come back via Bologna , I used my miles for the first leg and second leg was about $730 per person , not cheap , also depends on where y come from as well"}, {"username": "Mike Guarini", "comment_text": "Just booked now for next month from Boston to Milan for $500 each. But we are going to another country from there so no round trip."}, {"username": "Casarine Temple", "comment_text": "I bought our tickets for mid September last November and they were $2000 each. Delta Comfort Plus refundable. It is also during The Ryder Cup which increased the prices."}, {"username": "Rachel Christina", "comment_text": "I think it depends on your country of origin too… I’m assuming your American. It’s probably different from Australia"}, {"username": "Carol Scime-Raiford", "comment_text": "Try looking at booking One Ways instead of round trip"}, {"username": "Janice Rea", "comment_text": "Earlier the better. Prices kept rising when I purchased mine."}, {"username": "Brooke Nikas", "comment_text": "I booked in June for February 2024. Newark to Rome RT direct. I wanted business class and have flown to Greece many times so I have context for prices. I saw, in my opinion, a very low fare for BC, knew it wouldn't go lower so I booked it."}, {"username": "Maya Maximova", "comment_text": "We booked late September for June. The prices were still good /similar thru most of November but started climbing after that."}, {"username": "Caitrin Bennett", "comment_text": "I booked in April for October. Checked combos of all possible airports to fly in/ out. Cheapest option ended up being round trip Florence on TAP Air. Under $600 each from DC area. Rome was much more expensive"}, {"username": "MaeLeigh Cf Cervantes", "comment_text": "6 months out is the best price I’ve found"}, {"username": "Jessica Petyo", "comment_text": "We booked in Nov 2022 for our trip here now, July 2023. I definitely noticed the prices going up as time went on. Business class on Delta OB Air France was $3200 ea for our family of 4, but my in-laws booked same flights and paid $1600 ea for preferred. LAX>Venice, Milan>LAX."}]}, {"id": "2192726114459800", "text": "EURAIL question 🚞\n\nWe are travelling through Italy & onto a few other countries using Eurail 10 day pass. We’ve paid to reserve seats on most trips on their website, which we’ve printed.\n\nWe have downloaded the app but we can’t see the exisiting tickets booked. The journeys are blank, it hasn’t synced. Do we manually add our trips to the app and rely on the paper copies for the paid seats?\n\nWhat do we need to do at the train station? Also, how do we “activate” our Eurail pass tickets as I’ve seen a lot of talk about fines? 😅🤷🏽‍♀️\n\nGrazie 🙏🏼", "link": "facebook.com/groups/1373361046396315/permalink/2192726114459800/", "likes": 0, "comments": [{"username": "Sam Mah", "comment_text": "There is a Eurail Interrail FB group you can join.\nYou need to update the Rail Planner with your pass details including your passport number.\nYou neeed to use the \"planner\" (bottom left) to find the trip with the to and from station details. Once you have the correct time you save the journey to your pass. On the day of travel go to \"My Pass\" and you should be able to find the journey and you have to move the toggle (top right) from left to right to activate the journey (it turns yellow).\nIf you are on a journey that does turn up in the planner you have to enter the details manually (in the \"from\" station type a random word like dream it will say it cannot find that station and give you the option to add it manually.\nThere is a lot of helpful information on the FB group page and also the Eurail site online and Man in seat 61 (lots of rail info)"}]}, {"id": "2192741274458284", "text": "We are travelling to Rome in January with our children,\nAny advice and tips would be greatly appreciated 😊", "link": "facebook.com/groups/1373361046396315/permalink/2192741274458284/", "likes": 0, "comments": []}, {"id": "2192743714458040", "text": "I see recommendations for Italy always mention the same cities over and over, especially in Tuscany. As someone who lives in the region, if you have the chance to visit and move around by car, I suggest checking out other places like:\n\nPopulonia/ Golfo di Baratti\n\nPitigliano (town built in tuff, on the border with Lazio region)\n\nCapalbio (check Giardino dei Tarocchi by artist Niki de Saint Phalle; the town of Capalbio is incredible)\n\nBolgheri/Castagneto Carducci (if you are into wines)\n\nBibbona (village overlooking the Tyrrhenian sea in the province of Livorno, very beautiful nature and beach)\n\nGombitelli (a little gem on the hills of Camaiore, Lucca province; famous for the art of cured meats)\n\nSeravezza (where the Medici’s would retreat during summer; beautiful palazzo Mediceo; in the marble quarry area of Versilia)\n\nSaturnia, Venturina (for hot springs)\n\nLivorno (check Terrazza Mascagni, Quartiere Venezia; birth place of Modigliani)\n\nCheck Certosa di Calci (near Pisa)\n\nViareggio (one of the oldest summer destinations by the beach in Tuscany; Puccini used to holiday here, Villa Puccini is here, Belvedere Puccini in Torre del Lago, neighboring town between Viareggio and Pisa where Puccini had his hunting lodge; check out old Liberty style bathhouses on Viareggio’s promenade; poets like Shelley stayed here for a while, artist Escher got married in Viareggio)\n\nGarfagnana area if you are into nature, check Parco dell’Orecchiella; Isola Santa, Vagli if you fancy zip line. Parco delle Apuane if you want to stay in the alps where marble for Michelangelo’s sculptures were sourced from; lodges in Campo Catino, breathtaking views and great silence.\n\nAbbazia di San Galgano (in Siena)\n\nLajatico (near Pisa, Teatro del Silenzio)\n\nPeccioli (province of Pisa, art throughout the town)\n\nThese are just a few of the gems you may be missing if you stick to the usual spots.", "link": "facebook.com/groups/1373361046396315/permalink/2192743714458040/", "likes": 319, "comments": [{"username": "Valerie Collanton", "comment_text": "A lifetime is not enough !"}, {"username": "Cindy Woodhouse", "comment_text": "Thankyou. Local knowledge is the best resource. Do you recommend any spots for winter. We are planning to stay in Siena for 4/5 nights as a base"}, {"username": "Linda Yanni", "comment_text": "Thank you for all those suggestions"}, {"username": "Sheron Milliken", "comment_text": "Great recommendations\n, thank you!"}, {"username": "Alexandra Meyer", "comment_text": "Scotty Meyer"}, {"username": "Kirstie Jane", "comment_text": "Glenn Malisauskas"}, {"username": "Tammy Jo", "comment_text": "Kariann"}, {"username": "Michiel Bloemgarten", "comment_text": "Great list ! May I add Todi and Acqualoreto ?"}, {"username": "Martina Cucchiara", "comment_text": "Thank you so much. I immediately saved the post for future reference"}, {"username": "Ricki Sherlin", "comment_text": "Pitigliani last Sept."}, {"username": "Bonny S Boggs", "comment_text": "Love to see all of 🇮🇹 fabulous to visit!"}, {"username": "Natalie Reid", "comment_text": "Thank you for sharing this. We are planning our trip to Italy and will be spending some time in Tuscany in May next year and we're wanting to visit some other town other than the big cities. We will have a hire car so we can explore the area at our own pace.\nI actually have googled a few of the place you mentioned and they are on my list and I will be checking out the others that you suggested. I really appreciate this post."}, {"username": "Vicki Fien Dykstra", "comment_text": "Jackie Wilson Scheenstra"}, {"username": "Michelle Lieuw On", "comment_text": "Claudia Amp what do you say about Volterra? Or does that one count as the same cities over and over?\nWe’re staying in Vada and would like go see some towns with a max of 1hr driving."}, {"username": "Krs Hpo", "comment_text": "Thank you for recommendation"}, {"username": "Katie White-Meade", "comment_text": "Wonderful information. Thank you. Local knowledge is the best."}, {"username": "Andrea Jane Whittington", "comment_text": "Montecatini Terme"}, {"username": "Margaret Carloni", "comment_text": "Following"}, {"username": "Wendy Bass", "comment_text": "Dalton Bass"}, {"username": "Valerie Coffey", "comment_text": "Thanks for the info"}, {"username": "Sarah Thomas", "comment_text": "Thank you so much for sharing this! I will be in Tuscany this March for my 40th birthday. We’ll be based in Montalcino with a car and much prefer smaller towns to large bustling cities."}, {"username": "Mary Beth", "comment_text": "Appreciate your suggestions.\nWill be there in a few months.\nI love the off the beaten paths ideas. I’ll post what we do 😊"}, {"username": "Dorthy Staub", "comment_text": "How do you feel about Fumincio?"}, {"username": "Zanna Darcy", "comment_text": "Shhhh . . . I'm trying to keep those places to myself and let the tourists go to Siena, Florence, etc."}, {"username": "Colleen Marzigliano", "comment_text": "Thank you for these suggestions"}, {"username": "Tracy McKean", "comment_text": "Great suggestions! It’s wonderful finding new (by American) places before us locusts attack 😜"}, {"username": "Craig Rickards", "comment_text": "Gerri Tronc"}, {"username": "Kathy L. Downing", "comment_text": "Thank you. This will be most helpful in my planning. 😊"}, {"username": "Jade Illiano-Smith", "comment_text": "This is great! Can you do one for Campagnia also??"}, {"username": "Sharon Louise Marks", "comment_text": "I am saving your suggestions for future trips. Grazie mille. ❤️"}, {"username": "Judith Pishnery", "comment_text": "San Galgano is so interesting, been there, and several other towns off the main path, Lake Tresimeno area, random places in Tuscany, drove thru Carrera, Cortona is lovely, Liguria, all lovely things with some tourists, but off the main path and much less crowded"}, {"username": "Alison Melody Lambert", "comment_text": "This is exactly what we are looking for as we plan our first trip—grazie!"}, {"username": "Christine Malota- Kendall", "comment_text": "Thank you for this information!!!!"}, {"username": "Christine Malota- Kendall", "comment_text": "Nemi and Artena (both outskirts of Rome) are also beautiful. But small and quiet."}, {"username": "Caroline Kern-Templeton", "comment_text": "Thank you for sharing!"}, {"username": "Irene Oda", "comment_text": "Thank you so much for this information. The important famous cities will always be there - but I like to explore other cities too.\nAnyone have suggestions for the south?"}, {"username": "Janis Nunez", "comment_text": "Thanks!"}, {"username": "Deborah Schroeder", "comment_text": "I think the issue is people want to see what everyone else sees so they can either feel good or brag. I will admit, I went to Italy for the first time and saw the big 3 but also went to other locations. When you have limited time and/or resources, you gotta do what you gotta do."}, {"username": "Sandy Tadken Shaffer", "comment_text": "My favorite is the tarot garden so amazing!"}, {"username": "Laurie Johnson-Daley", "comment_text": "Thank you so much for this informed and descriptive post!!!!\nJust because certain places are visited the most in a country doesn’t mean they are the nicest, best, most meaningful/\nmemorable etc. There is so much more to a country than it’s highly marketed areas."}, {"username": "Colleen Spinozzi Beviss", "comment_text": "Amazing post! Grazie!!!"}, {"username": "Colleen Spinozzi Beviss", "comment_text": "Can you recommend an are we can go to the beach or explore? we will be coming from Castellina and heading to levanto but have 3 free nights."}, {"username": "Brenda Barrett Dunphy", "comment_text": "Looks great thanks for sharing. We're heading to Rome for 5 nights could you recommend any day trips from Rome"}, {"username": "Marion Dempsey Gillespie", "comment_text": "Heather Slaunwhite Wilcox, Gail Burke. Ideas for us"}, {"username": "Susie CB", "comment_text": "I really loved Gubbio…. I think you can do train and then bus there if you don’t want to drive."}, {"username": "Kathy Ann Jones", "comment_text": "THANK YOU for your post!❤️🇮🇹❤️"}, {"username": "Dianne Kelly", "comment_text": "Thank you for sharing! I have screen shotted this for future reference!!"}, {"username": "Sonja Schick", "comment_text": "Thank you for sharing this! We drive down from from southwest Germany once or twice a year, great to have a few ideas for side trips"}, {"username": "Bev Symes", "comment_text": "Thankyou. been looking in this direction. very helpful"}, {"username": "Paula Ann", "comment_text": "Thank you!"}, {"username": "Chantelle Paans", "comment_text": "Thank you for suggestions. We have 7 days to explore in September. Hiring a car in Zurich and need to land up in Florence - We have done Milan so would like to have a different experience so want to go through the smaller towns & villages, to eat where the locals eat etc......do you have any suggestions"}, {"username": "Laura Cardinale", "comment_text": "Campiglia Marittima close to populonia is a nice spot too!"}, {"username": "Rachael Sinclair", "comment_text": "Claudia, thank you so much for these off the beaten path suggestions. I love hearing the opinion of someone in the area.\nWe are planning on a 2025 trip for my 40th (just me and my husband, leaving the little one with Grandma!) and are still early in the planning stages, mostly because I just can't narrow down an itinerary. It will be two weeks, possibly in April but more likely mid-to late October (if one is better, let me know!). We are into wine, but even more into food (have both been in the restaurant industry for 15+ years). We're good with lots of walking, and looking for unique experiences. Where would be maybe like your top four places? I'm really excited to hear what you think, thanks so much! 🙏🤩"}, {"username": "Caroline Linton", "comment_text": "Janice Carbone"}, {"username": "Darren Williams", "comment_text": "Lynette"}, {"username": "Suzanne Caprio", "comment_text": "Wonderful suggestions!!!"}, {"username": "James Saffell", "comment_text": "Thank you. I'm going to read up on these. Staying in Montecatini and Lisa end of November and 1st week in December"}, {"username": "Linda Corigliano", "comment_text": "Thank you for this!!"}, {"username": "Cynthia Itzo", "comment_text": "Giovinazzo in Puglia, just north of Bari. It is a seaside resort town largely for other Italians. Unspoiled and a beautiful historic heart of town. A popular wedding destination because of the beautiful church and scenery."}, {"username": "Sarina Natale", "comment_text": "Thank you for sharing!!!"}, {"username": "Maria DiGi", "comment_text": "Totally agree with you. Regions like Abruzzo or Puglia."}, {"username": "Toni Yeazel", "comment_text": "Thank you for sharing!"}, {"username": "Mary Gregory", "comment_text": "What about Sicily?"}, {"username": "Tracy Wrinn Mcdermott", "comment_text": "Love this!❤️ Thanks!!"}, {"username": "Stephen Anderson", "comment_text": "Thanks"}, {"username": "Francesca Messina", "comment_text": "Argentario!! 😍😍 talamone, Castiglione della pescaia"}, {"username": "Jennifer Popour Tilley", "comment_text": "Thanks!!"}, {"username": "Monique Armbrister", "comment_text": "Claudia Amp Do these smaller, lesser known/visited places have many options for accommodations and things to do in months like March?"}, {"username": "Rhonda Fosenburg", "comment_text": "Great post, thank you so much. We will be there in September/\nOctober this year. We are renting a car. I have saved your recommendations\n. ❤"}, {"username": "Rhona OConnor", "comment_text": "Ah but they would miss ticking all those essential boxes of where everyone goes! You are so right, so amazing small places to see and experience real Italy not just the tourist traps!!"}, {"username": "Lisa Krueger Shaw", "comment_text": "Iris Garza"}, {"username": "Athena Dahlin Cross", "comment_text": "Thank you ! Wonderful ! I am living here and looking for somewhere to go and escape the crowds. Not wanting to go back to the same cities .. this is just what I needed , I am saving ! Thank you !"}, {"username": "Natalie Goldman", "comment_text": "Claudia Amp thank you\nWhat do you recommend to visit by car on the other side? We’ll be driving from nice- Genoa- Verona- Lugano will be our hotels 3 nights each but plan is to drive each day"}, {"username": "Jane Nielsen", "comment_text": "Thank you!"}, {"username": "Helene Moccia", "comment_text": "Thank you for sharing this!"}, {"username": "Denise Russo-Silverman", "comment_text": "Thank you for the wonderful suggestions. I have been to Italy four times now and can’t get enough of your beautiful country. We did stay in Viareggio and took a early evening visit to Forte dei Marmei it was sooo nice! Can’t wait to go back to those beach resorts."}, {"username": "Paula Bennett", "comment_text": "Would you like to be our driver lol!!"}, {"username": "Iris Joan Price", "comment_text": "Grazie mille! I copied the link to this post to my note-taking app for future travel planning if I can find a travel partner who would be willing to rent and drive a car. Are any of these places accessible by bus or train?"}, {"username": "Stacey Lavelle Johnson", "comment_text": "Thank you for sharing this. My daughter and her fellow architecture students will be studying in Vicenza for spring semester and are very anxious to explore the entire country.\n\nClaudia Amp, would a car be necessary for them or can they get to these places by train or another way?"}, {"username": "Sherry Shannon", "comment_text": "Amy Davis"}, {"username": "Kimberly Hawes", "comment_text": "Agree, we are currently in Piombino then off to Montepulciano, Siena, San Gimignano, Volterra, and Lucca. So very beautiful. We also spent time in Venice, Rome, Florence, and Cinque Terre. Loving it all. 🇮🇹🍝🍕🍷🏖️🏟️"}, {"username": "Wenhui Lu", "comment_text": "I am contemplating\n1) Rome 2D <> Sicily 12D <> Florence 4D / Tuscany 7D <> Rome 2D\n2) Or skip florence to extend Sicily and Tuscany for another 2 days each\n\nWe been to Tuscany before but simply love it\n\nWhat’s your opinion?"}, {"username": "Francoise Coupal", "comment_text": "Great suggestions. Thank you. And I’m sure these lesser visited towns would appreciate the tourism as it supports the local economy."}, {"username": "Gianluca Rivizzigno", "comment_text": "Grazie, me le sono segnate pure io!!"}, {"username": "Bob Sullivan", "comment_text": "This is one to save!"}, {"username": "Laurie Maher", "comment_text": "Claudia Amp, any hiking recommendations\n?"}, {"username": "Paulette Molasses Sims", "comment_text": "Saving this! You are so right.\nInstead of stayiing in Florence, I was really thinking of getting a hotel in maybe Siena, Lucca, etc, and you just convinced me."}, {"username": "Debbie Tucker", "comment_text": "Great post, Claudia!!! And, thank you for taking the time to expand our experience in Italy!!! I'm saving this for future visits!"}, {"username": "Elizabeth Jacob", "comment_text": "YES! While the standard Florence, Siena, etc. are great, there is so much more! I love discovering new spots every year when we return."}, {"username": "Natasha Welage", "comment_text": "Thank you so much for sharing"}, {"username": "Hen Garrett", "comment_text": "Thanks for sharing that. We had a lovely holiday one year in Castagneto Carducci. We visited Peccioli last user while staying in another pretty village (Palaia) and also loved our beach trip to Viareggio when the kids were little. We usually stay in the Montalbano hills but tacked on a short stay in Elba one year which was beautiful with lovely clear sea. Tuscany is stunning and there is so much to see outside the main cities."}, {"username": "Diana Spicer", "comment_text": "I really appreciate you sharing this information."}, {"username": "Markie MK", "comment_text": "Thank you! We always rent a car when we visit Tuscany so I am taking notes for our next trip!! ☺️"}]}, {"id": "2192755224456889", "text": "What’s a good amount of spending money to have in Italy for 3 weeks for 1 person doing it solo? I will be going next May by myself. It won’t be for accomodation or tours of the main things as that will all be paid for previously. Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2192755224456889/", "likes": 0, "comments": [{"username": "Allan Olexa", "comment_text": "We use our US credit cards spending very little cash euros."}, {"username": "Maria Musumeci", "comment_text": "Depends as everyone is so different.\nFood wise, anywhere from min €60 a day or more (depending on how many gelatos you want 😉, alcoholic beverages, or whether you prefer fine dining or a panini or pizza, or if your breakfast is included with your accommodation).\n\nAllow extra for buses/trains/\ntaxis, maybe average it to €20 a day.\nAccess public bathrooms €1-€2 per day!\nSpending money/shopping - it differs for everyone. If just souvenirs, then €100-€300 for total trip. Depends if Olive Oils Limoncello, jewellery, pottery, linen etc.\nSo €2000-€3500 for whole trip. Only take €500 cash with you. The rest on your Cc or travelcard."}, {"username": "Lauran Cantwell", "comment_text": "I usually try to budget $100 a day. If I spend less, then I have extra the next day. If I don't spend it all by the end, then I get to come home with extra money!!!!"}, {"username": "Daisy Yoo", "comment_text": "Again depends, for us we cook breakfast and eat very light dinner - so never restaurant , will eat out lunch and do not drink coffee and coming for winter , prob will not do much gelato, therefore maybe 20-30 euro a day per person maybe more if we go to market to buy something , I can not imagine 100 a day ￼, so it all depends on ur spending habit"}, {"username": "Eliz Fragoso", "comment_text": "Take what you can afford and spend what you wish for😎🥂🤔🤔🤔"}, {"username": "Jenny Payne", "comment_text": "I travel every year to Italy , have done all the sightseeing in lots of towns & I work on €100 per day , I take cash €1000 as I only ever take money out of post offices as you go in, & Italian banks you can’t enter unless you have a swipe card , & not often I use atms🌻"}]}, {"id": "2155597111506034", "text": "Snorkeling with Marine Biologist Expert from Sorrento\nGet more out of your time in sea at Sorrento with a snorkel experience led by a marine biologist guide. In a small group of just ten people, you’ll travel to… आणखी a protected area of the coastline near Punta Campanella where the waters are rich with marine life. Learn about the rugged shoreline around Sorrento, then step into the water with a marine biology expert to snorkel amid barracudas, bream, and, if you're lucky, sea turtles and dolphins, too.\nRead more about Snorkeling with Marine Biologist Expert from Sorrento - https://www.viator.com/tours/Sorrento/Snorkeling-with-Marine-Biologist-Expert-from-Sorrento/d947-49361P1?pid=P00070587&mcid=42383&medium=link&medium_version=selector", "link": "facebook.com/groups/1373361046396315/permalink/2155597111506034/", "likes": 0, "comments": []}, {"id": "2192782647787480", "text": "We stayed at the Triviho hotel in Rome and the staff was very helpful, friendly and room was clean & comfortable. Close enough to walk to Trevi, Spanish Steps, and we enjoyed a 25 minute walk home from the Colosseum. And… we opted for the included breakfast and it was great.\n\n", "link": "facebook.com/groups/1373361046396315/permalink/2192782647787480/", "likes": 2, "comments": []}, {"id": "2192784934453918", "text": "Hi all just discovered this group which is amazing as I am heading to Italy for the first time in September.\nJust seen a few comments re tours. We have pre booked some tours through Viator (not paid yet) but have seen people say book direct with the venue eg Vatican, Colleseum etc. Appreciate any advice Thankyou.", "link": "facebook.com/groups/1373361046396315/permalink/2192784934453918/", "likes": 0, "comments": [{"username": "Joe-Linda Po Agustin", "comment_text": "Book direct."}, {"username": "Maria Musumeci", "comment_text": "We booked all our tours (12 different ones on a 4 week trip) through either Viator or Get Your Guide and had no problems with any of them. It included the Colesseum tour, The Vatican/\nSistine Chapel tour & more."}, {"username": "Kristine Zeronda", "comment_text": "Most hotels will book for you, I would never book with one of those services. The only time I booked from NY was for a taxi service to pick us up at the airport. It was a nightmare. Never again. Everyone has their own experience. My hotel handled everything. I also used a private guide for a day to go from Florence to Piza, Viareggio, Lerici, Lucca etc. Was very convenient and didn't cost what you might think. Fabulous guide. You can also book direct."}]}, {"id": "2192809207784824", "text": "Where’s best to visit italy for a week long beach holiday for a young couple?\n\nWe’ve been looking to stay in Pietrasanta/Forte dei Marmi can anyone vouch for this area, I hear it is lively, nice restaurants, beaches etc?\n\nLooking to go in August 😬", "link": "facebook.com/groups/1373361046396315/permalink/2192809207784824/", "likes": 0, "comments": [{"username": "Marie Cuzzi", "comment_text": "Sicily for the most amazing beaches\nHot hot hot and crowded in August"}, {"username": "Laura Piccinini", "comment_text": "Sardinia(Costa Smeralda/\nGallura/costa rei) and Salento (Otranto or Gallipoli).\nAll those options are very very crowded in August! But in this periodo everywhere in Italy Is like that!"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Forte dei Marmi it’s a very expensive, elegant place with great shops, bar, clubs. The beach is nice and fun BUT the water is not great.\nIf you want really nice sea and beaches check for Sardinia or Puglia"}, {"username": "Corina Cristea", "comment_text": "for the beach it is very OK, there are beaches with all conditions (Fonte Dei Marmi is expensive); in August it is crowded and expensive; the advantage is that you can stay in the area but further and cheaper and come by car to any beach (all have parking lots); Lido di Camaiore is cheaper and is right next to Marina di Pietrasanta"}]}, {"id": "2192819817783763", "text": "Hi all, so we are thinking of Italy for our honeymoon, ideally would like about 10 days, however would just like some tips and advice about where is best to go really, we’ve been to Rome (he proposed at trevi fountain) but we was only there for a day and would love to go back, also would like to go to Venice, tia ❤️", "link": "facebook.com/groups/1373361046396315/permalink/2192819817783763/", "likes": 0, "comments": [{"username": "Roni Valdivia-Calles", "comment_text": "We started in Rome, took a train to Florence, then Venice, then Milan and then flew to Paris. Two days in each city is perfect!"}]}, {"id": "2192826647783080", "text": "After some advice if possible please, I'm surprising my partner for his 50th this year and bringing him to Italy (his favorite place but I've never been) we're staying at the delle fiere does anyone have any recommendations of what to do/see in milan we're only there for 2 days and I believe its about a 45 min journey from our hotel so trying to be organised (he's normally the organiser lol) also is public transport easy enough to use been advised against hiring a car lol TIA 😊", "link": "facebook.com/groups/1373361046396315/permalink/2192826647783080/", "likes": 0, "comments": []}, {"id": "2192831877782557", "text": "Hi I’m trying to book tickets on the Compania train between Naple and Sorrento, however the website is inaccessible for us. Has anyone else been able to book tickets for this train.\nFYI it’s the tourist train that run between Naples and the Amalfi Coast with a stop in Pompei.", "link": "facebook.com/groups/1373361046396315/permalink/2192831877782557/", "likes": 1, "comments": [{"username": "Cat Furness", "comment_text": "Where are you ?"}, {"username": "Karon Patterson", "comment_text": "We just bought them when we got there. I pre booked all my train tickets except those around Sorrento and Naples."}]}, {"id": "2192842517781493", "text": "Hi,\n\n1 week trip throughout Italy 🇮🇹\n\nAny recommendation for apps for transport or taxi.\nFor Internet, which mobile Provider?\nAny other tips?\n\nThanks in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2192842517781493/", "likes": 0, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2192854224446989", "text": "My sister has a 3 day conference in Milan in the fall. We are tagging along and then heading to Lake Como and Switzerland after she’s done on the 3rd day. I have seen a lot of ‘skip Milan’ and ‘only one day in Milan’ comments so I’m wondering how we are going to fill our 3 days in Milan. She only has the conference in the mornings. Is there somewhere we can visit outside of Milan after her conference ends for the day?", "link": "facebook.com/groups/1373361046396315/permalink/2192854224446989/", "likes": 6, "comments": [{"username": "Adriana Sormani", "comment_text": "So much to see in Milan ! Easy to fill three days… you can spend one whole day shopping and the duomo , one whole day visiting the Sforza Castello,\nBuy tickets now for the painting of the last supper, Arco della pace, piazza Sempione, explore the Roman ruins around Milan, and remember half your day you should have the best lunches and dinners ( away, from the Duomo/Galleria\nMilano dishes…\nRisotto Milanese, ossobuco , vitello tonnato, etc\nI was born in Milano and have family there ! Enjoy!"}, {"username": "Debbie DiOssi", "comment_text": "Lake Como."}, {"username": "Ashima Avasthi", "comment_text": "Enough to do in Milan! Duomo, Sforzo Castle, navigili canals,"}, {"username": "Esther Starren", "comment_text": "Bergamo"}, {"username": "Rhona OConnor", "comment_text": "Spend some time sitting just watching italian life and enjoying it."}, {"username": "Iwona Dygas", "comment_text": "I have been three times to Milan and I would love to go again"}, {"username": "Iwona Dygas", "comment_text": "Get to the Duomo roof and if you want to see The Last Supper, buy the tickets well in advance"}, {"username": "Nancy Lewis", "comment_text": "I would say the Duomo, the Last Supper painting and the Galleria.\nThe trip yo lake Como and then the trainvyo Switzerland is one of the best days of any trip. To go from Italy through the Alps to Switzerland is amazing."}, {"username": "Susi Menazza", "comment_text": "Milan has so many interesting things to see"}, {"username": "Renae Larcus", "comment_text": "Bergamo"}, {"username": "Vicki Ott Lynch", "comment_text": "Definitely do the Duomo roof!!"}, {"username": "Kristel Granaas", "comment_text": "Train to Bergamo, Verona or even Venetia is not far with express train"}, {"username": "Alessia Zito", "comment_text": "Milan has many things to see: brera (where you can visit the pinacoteca di brera), duomo (visit the inside of the duomo and go up to the terrace), the gallery, arco della pace, navigli, church of san bernardino alle ossa (inside walls made of human bones, it may seem disturbing but it is breathtaking) sempione park, 900 museum, villa invernizzi, fondazione prada, porta garibaldi, piazza gae aulenti, city life, santa maria delle grazie church where you can see the painting of leonardo da vinci's last supper, teatro “la scala”, qc terme (a beutiful spa) there are many streets where go shopping like via torino, san babila, via della spiga, via montenapoleone,\nmilan is the capital of fashion.\nAlso there are many terraces where you can have an aperitif, i reccomend: Milano verticale, Via de Cristoforis ( Porta Nuova - Garibaldi) the dome, terrazza 21, sun eleven rooftoop"}, {"username": "Henna Karim Ahmed", "comment_text": "we were in Milan 2 1/2 days one of our favorite things was a pasting making class"}, {"username": "Lillian Hoilman-Briar", "comment_text": "Hop on hop off bus! Skip the line Last Supper, museums, shopping, so much food!"}, {"username": "Tsveta Docheva", "comment_text": "Visit Bergamo. It's beautiful!"}]}, {"id": "2192859177779827", "text": "Hello Everyone,\n\nI would like to ask You for an advice on how to travel around European countries in terms of everything necessary and planning.\n\nI’m currently 20, between my second and third year in college and since I was 14 years old, I’ve wanted to make some travelling to few specific places in the world - I’ve decided to do it around Europe first, then maybe North America later, and lastly, the Far East Asian countries. As of yet I haven’t done any of those travellings, I’m planning to do in the next following year or two or more. I’ve only been to two small trips to my neighbouring countries, one of which is across the Baltic Sea. The best conclusion I’ve gathered from them is that I don’t like trips that are widely popularised by Western tourists - that is, fly somewhere by plane, sleep in a hotel, see some landmarks in a stereotypically touristic fashion. I’ve noticed that this doesn’t bring me enough satisfaction and decided that if I want to do some travelling I would like to try make it a one big long trip, where I would explore most of the continent on a single trip, using the cheapest possible means. For example, sleeping using couchsurfing services, or maybe at hostel, travelling to places using hitchhiking or trains (also try to not use airplanes at all), seeing some landmarks and, most importantly, getting to know local people and their mentality, views on their country as well as how they tent to live everyday. All this in the cheapest possible way since my expectations of comfort at minimum at best. I’m myself perfectly healthy as well as rather athletic, that’s why rather running around the cities I want to explore rather than walking is more suitable for me - almost exploring like some sandbox video game character.\n\nMy questions about all these are as following:\n1. I’m currently planning to go on my planned trip around Europe during the warm months, mainly from the end of April to the beginning of October. Do you think that much time is a good idea, or is it unnecessary long and maybe a three month time during college student summer vacation, from the beginning of June to the end of September.\n2. What should I provide for myself to be comfortable exploring such terrains on foot? As of now I know I should get:\n\n- An EKUZ to be eligible for a healthcare in the countries of the European Union.\n- A passport if I’m travelling to a country which is outside the European Union, as long as I’m staying in the EU, my home country ID card is enough. Correct me if I’m wrong.\n- From what I’ve read, the mobile internet data is available without the need of buying a separate SIM cart, as long as I’m still in the countries of the EU. Correct me if I’m wrong about this information.\n- A budget of € EUR money. I’m planning on having it mainly through credit card as well as having little in cash. Do You have any recommendations on a credit card provider companies, which would be the best for a trip I’m planning?\n- A couch surfing app. As of yet, I haven’t used any of such apps, that’s why I would like to ask You, which app would You recommend as the best.\n- An Interrail/Eurail train ticket pass of a certain amount of days available to use throughout a month or months. Is there any more providers of such tickets or these two are the only ones? Which one for me, an European citizen would be the best?\n\nI’m sorry for such a lengthy post, however I wanted to ensure You that I do not have the faintest idea about providing for such lengthy trip. I would like to ask You for every single, even the tiniest bit of seemingly obvious information that would come in handy in terms of planning such a trip and ensuring my safety and comfort.\n\nHope Everyone understood my post. Thank you for helping me and providing some advices!", "link": "facebook.com/groups/1373361046396315/permalink/2192859177779827/", "likes": 1, "comments": [{"username": "Dave Conroy", "comment_text": "Great questions and great attitude. My first trip was to India and I can't believe how unprepared I was and TBH terrified in a cab from the airport seeing all the street sleepers, then later looking down from my guesthouse window at the Rats as big as cats fought amongst the refuse. But you learn and adapt and grow. So my only advice is have an adventure more than a holiday and deal with whatever challenges come your way rather than try to imagine and overprepare. Most of it's a waste of time."}]}, {"id": "2192860017779743", "text": "In October after time in Puglia, we are planning on a few nights in Matera and then hoping to stay in Pietrapertosa before heading to the Amalfi Coast. Finding it hard to work out best transport options. Any advice appreciated.", "link": "facebook.com/groups/1373361046396315/permalink/2192860017779743/", "likes": 0, "comments": [{"username": "Linda Leonhard", "comment_text": "We rented a car and it was fine. Mostly."}]}, {"id": "2192864734445938", "text": "Travel advice please 🙏\n- Traveling from Venice airport (marco polo) to Verona ;\n\nWhich is the best route for public transport ? Will have a couple of cases with us.\nThank you 😊\nP.S - love this group and great to see everyone’s recommendations !", "link": "facebook.com/groups/1373361046396315/permalink/2192864734445938/", "likes": 0, "comments": []}, {"id": "2192943554438056", "text": "Will there be a strike in august ? I can’t find anything online😬", "link": "facebook.com/groups/1373361046396315/permalink/2192943554438056/", "likes": 0, "comments": [{"username": "Daisy Yoo", "comment_text": "Do a search on here , someone posted the link"}, {"username": "Barbara McGuire", "comment_text": "Read that there is an Italian law no strikes allowed July 27-Sept.5."}, {"username": "Bill Shafer", "comment_text": "Open in Chrome, it will translate\n\nhttp://\nscioperi.mit.gov\n.it/mit2/\npublic/scioperi"}]}, {"id": "2192944561104622", "text": "We just returned from an amazing 2 week trip and I made a last minute change to our plan from traveling by train to traveling by car bc someone on this group had said to ditch the train n take the time to explore at your own pace etc and it hit 🎯 so thank you! We had some challenges but I think that really made a huge difference for us. 🥰🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2192944561104622/", "likes": 3, "comments": []}, {"id": "2192959167769828", "text": "Aperol spritz any one?", "link": "facebook.com/groups/1373361046396315/permalink/2192959167769828/", "likes": 33, "comments": [{"username": "Inge Bemelmans", "comment_text": "Nancy Bemelmans"}, {"username": "Kasia Karp-Poliszczuk", "comment_text": "Peter Poliszczuk"}, {"username": "Santina Spanninga", "comment_text": "Loretta Davies Marisa Spanninga !!!"}, {"username": "Liza Scott", "comment_text": "Mandy Scott I wish"}, {"username": "Teresa Bliss", "comment_text": "Okay! what exactly is this? Going in October."}, {"username": "Melissa Jane Brown", "comment_text": "Bella Brown"}, {"username": "Michelle Cotoni", "comment_text": "Yes please! 🙂🍊"}]}, {"id": "2192968331102245", "text": "Going to Rome Florence and Venice through prillo tours any asking for suggestions please. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2192968331102245/", "likes": 2, "comments": [{"username": "Jenny Payne", "comment_text": "What do you Want to know?"}, {"username": "Marie Cuzzi", "comment_text": "Great tour but really touristy… see if they will take dinners at the hotel off and go explore off the tourist circuit and you will not be disappointed"}, {"username": "Laura Torres Palomino", "comment_text": "If you can upgrade your Vatican tour to one that is “before the crowds” type, the upgrade would be totally worth it. Otherwise get ready for complete and total, hot and stinky, shoulder to shoulder, can-barely-move\nclaustrophobia!\n!!"}, {"username": "Laura Torres Palomino", "comment_text": "Nothing will prepare you for the sheer, jaw-dropping magnificence of The David ❤️❤️❤️"}, {"username": "Rhonda Smith", "comment_text": "Have a wonderful time!"}, {"username": "Mary Gregory", "comment_text": "While in Venice visit Burano via water taxi ♥️"}, {"username": "Zita Lynch", "comment_text": "Is Walks a good company to book tours of Vatican?"}]}, {"id": "2192968961102182", "text": "Hi\nIs there any Aussies taking on a HolidayMax tour? I've booked the Italy flavours tour with them for next may, I'm looking for any honest reviews and/or 1st hand experience.. the good, the bad and the ugly feedback ..thank you", "link": "facebook.com/groups/1373361046396315/permalink/2192968961102182/", "likes": 1, "comments": [{"username": "Dee Martini", "comment_text": "F"}, {"username": "Rebecca Beare-Bath", "comment_text": "F"}]}, {"id": "2192975737768171", "text": "Currently staying in Vico Equense and would love to go to a beach. Any recommendations for beaches nearby?", "link": "facebook.com/groups/1373361046396315/permalink/2192975737768171/", "likes": 0, "comments": []}, {"id": "2192976737768071", "text": "Discover Montalcino from your home! Thanks to our local guide Patrizia you will reach a charming town where time seems to have stopped centuries ago. You will virtually walk through its narrow alleys marvellingआणखी extraordinary views over the underlying valley and you will discover its medieval past with its 13th-century defense walls and the historic centre dominated by the 14th-century fortress.\nJoin our NEW virtual experience: https://nextstop-italy.com/virtual-tours/montalcino-tuscany/\n\n#tuscanyexperience #virtualworld #tuscanyitaly #tuscanytour #italyiloveyou #italytravel #medievalart #hilltown #italytrip #sunflowers #rollinghills #medieval #brunello #montalcino #brunellodimontalcino #brunellowine #orciavalley #tuscanygram #brunellomontalcino", "link": "facebook.com/groups/1373361046396315/permalink/2192976737768071/", "likes": 6, "comments": [{"username": "Dena Fenza", "comment_text": "Love this"}]}, {"id": "2192876307778114", "text": "I looked at the weather if Florence. We are going next year about this time ans know it will be hot. We are from Texas so kinda used to hear. But the weather map says possible disruption due to extreme heat. Anyone know what that means ?", "link": "facebook.com/groups/1373361046396315/permalink/2192876307778114/", "likes": 1, "comments": [{"username": "Allan Olexa", "comment_text": "Over 110 degrees. Italy has little or no AC. Americans are accustomed to bone chilling AC inside accommodations and vehicles. Plus, Europe has so much hot pavement."}, {"username": "Judith Knappe", "comment_text": "Actually in south Europe and part of middle Europe discovers a big heat period, means it has more the 40 degrees Celsius. Means more than 100 degrees Fahrenheit. Just be aware that some of the sightseeing things may be closed during the day longer than usual."}, {"username": "Heather Sechrist", "comment_text": "Yes, they are not equipped like Texas is. In time now and it got so much hotter today. It’s not stop sweat fest. Everyone. But the rooms with mini splits are worth it."}, {"username": "Lauren Woldt Kapler", "comment_text": "They shut down outdoor attractions in the afternoon when it’s this hot. I was in Florence and Pisa yesterday - and we didn’t experience any outages - but we drank TONS of water, rested, and found shade often. I know it’s not Italy - but I just read that the Acropolis closed from noon-5pm yesterday due to the heat."}, {"username": "Ruth Lindsey", "comment_text": "Europe is very hot this year!!!!!"}, {"username": "Stacy Derouin", "comment_text": "Europe is experiencing an unprecedented heat wave this summer-so while it gets hot during the summer, this type of heat is unusual. When we were there in June a few years ago, it averaged the mid 20s. (Celsius), it was perfectly lovely. So perhaps next year temps will return closer to normal."}, {"username": "Rita Kanten", "comment_text": "It means that some tourist attraction may be closed during the hottest part of the day. Many of them have little or no ac. It becomes dangerous to the tourists."}, {"username": "Silvia Frati", "comment_text": "The thing is that Florence together with Bologna is one of the hottest Italian cities. It is sorrounded by hills so all the humidity stays above the city. So the temperature is not the real point,but it's all about humidity. And believe me ,we 've a lot 🤣"}, {"username": "Shana Woodfield", "comment_text": "In August 2016 I was in Europe. England was very warm but not terribly hot. Paris, on the other hand, was too hot for sleeping. No A/C in the hotel, but a fan ran continuously. I couldn’t sleep it was so hot.\nIn extreme heat people will be dropping in the streets, power might fail, services could be overwhelmed."}, {"username": "Kyna Martin Autrey", "comment_text": "When people kept telling me it was hot, I didn’t understand because I’m from Texas and it’s HOT here. However, here you can step inside and cool off. In Italy, inside everywhere almost, except our hotel room that we cranked down cold, was hot. There is nowhere to cool off so I felt like i never stopped being hot the whole trip."}, {"username": "Kristina Ruk", "comment_text": "Well you dont know for sure what weather will be after a year ;)"}]}, {"id": "2192933187772426", "text": "Looking for recommendations for transportation to airport in Naples in the very early morning hours, any suggestions are appreciated? We will be staying in a hotel/Airbnb within the city. Will need to be at the airport by 4am. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2192933187772426/", "likes": 2, "comments": [{"username": "Lynsay Jane", "comment_text": "Can't answer for it's timetable but I got a bus from outside the train station to the airport.\n\nUsually on airport websites there is 'getting here' information."}, {"username": "Ma Kristine Dosado Nablo", "comment_text": "Hi! Which aribnb did you book? We’re going Aug 8-12 and we don’t have anything booked yet. Any recommendation?"}, {"username": "Anne Hoenig Steib", "comment_text": "We did that a week ago and just used Uber. It was quick."}, {"username": "Mary Anne", "comment_text": "Your hotel can book a taxi."}, {"username": "Ildiko Gyimesi Mikos", "comment_text": "Taxi"}]}, {"id": "2192935164438895", "text": "We are traveling to Italy and Portugal in November.\nI just read that some places shutdown in November (like the Amalfi coast).\nHas anyone traveled in November and can suggest places to skip because it’s off season?\nOr places that are a must see during that time?\nOr direct me to where I can find the information?\n\nSome cities on our for sure listआणखी include:\nRome\nCalabria\nLisbon\nAzores\n\nOn our maybe list:\nVenice\nMilan\nTuscany\nPisa\nAmalfi coast\nCinque Terre\nFlorence\n\nAny cities I am missing that we should look into?", "link": "facebook.com/groups/1373361046396315/permalink/2192935164438895/", "likes": 0, "comments": [{"username": "Susan M Warren", "comment_text": "Following! I'm going at Christmas and have same question!"}, {"username": "Francesco Pogna", "comment_text": "Not to be worried, nothing will shut down during the off peak season - Amalfi is a city and people live there! November is a perfect month to visit Rome and other cities as the weather is not too hot :)"}, {"username": "Gloria Di Francesco", "comment_text": "What does it means \"Amalfi coast\" is closed?"}, {"username": "Nicola Algerino", "comment_text": "Matera e Alberobello"}, {"username": "Faryal Abbas", "comment_text": "In Portugal you have to visit Porto if you can!"}, {"username": "Noemi Marino", "comment_text": "Bagnoregio is magic."}, {"username": "Lillian Angel", "comment_text": "Siena , San Gimignano , Volterra , Belaggio , Bologna , Padua..."}, {"username": "David Gotlieb", "comment_text": "Don’t worry … you’ll have a great time"}]}, {"id": "2192303111168767", "text": "Could anyone share recommendations for transfer/car services based in Rome? We are hoping to get to and from our Airbnb in Rome as well as a day trip to San Donato Val di Comino. We will need the company to provide 2 car seats. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2192303111168767/", "likes": 0, "comments": [{"username": "Abby Fischer", "comment_text": "Boost!"}]}, {"id": "2192451901153888", "text": "October Itinerary thoughts?\nArrive Milan (flights booked)\nTrain to Venice 4 nights( to help with jet lag) air bnb booked\nTrain to Florence (3 nights)\nRent car and drive to Lucca area for 2 nights (see the countryside)\nDrive and return car in Bologna\nStay 3 nights in Bologna and tour to Parma factory / Pagani / Ferrari etc\nTrain to Milan airport hotel one night before early flight home next day to the US….\nThanks in advance !", "link": "facebook.com/groups/1373361046396315/permalink/2192451901153888/", "likes": 2, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.discovercars\n.com/\n?a_aid=NextStop-\nItaly"}, {"username": "Amy So", "comment_text": "I love Milan. Consider staying in Milan one more night to go to the Cathedral and the Last Supper. I would cut Venice to 3 nights. Lucca was beautiful. We did a day trip and wish we were staying at least one night."}, {"username": "Nicola Algerino", "comment_text": "Bello 👍🏼"}, {"username": "Claudia Castellini", "comment_text": "Sounds good!\nI’ve just written some suggestions for food in Bologna in an other post, I paste it here, you can be interested in! 😉"}]}, {"id": "2192517717813973", "text": "Is the Designer Outlet Serravalle worth a visit? Great deals? We are driving from lake como to Milan, is it on the way?", "link": "facebook.com/groups/1373361046396315/permalink/2192517717813973/", "likes": 0, "comments": [{"username": "Erika Biggio", "comment_text": "No, it's actually the other way around, an hour and half from Milan but southbound. It can be on the way if you plan to see Cinque Terre or Tuscany"}, {"username": "Erika Biggio", "comment_text": "No, Venice Is East of Milan, Serravalle is south-west"}]}, {"id": "2192519971147081", "text": "Best place to buy gold when in Italy !", "link": "facebook.com/groups/1373361046396315/permalink/2192519971147081/", "likes": 45, "comments": [{"username": "Maria Aucello", "comment_text": "Ponte vecchio in Firenze has many jewelry stores. Vicenza, not far from Venice, is well known for gold as well, and every city in Italy has a gioielleria. The gold in Italy is usually 18karat and is of good quality and workmanship. It is sold by weight."}, {"username": "Kim Aranha", "comment_text": "Bulgari !"}, {"username": "Suzanne Mills", "comment_text": "Under the Ponte Vecchio bridge"}, {"username": "Kathy Kattic McKee", "comment_text": "Florence so many shops"}, {"username": "Bonnie Rodgers Henderson", "comment_text": "Vicenza"}, {"username": "Maryanne Battistone", "comment_text": "In a small town. Not a big city"}, {"username": "AK Kaygen", "comment_text": "There isn’t any"}, {"username": "Doreen Dal Santo", "comment_text": "Celia Tortorici-Campb\nell"}, {"username": "Susan Cantafio", "comment_text": "Florence"}, {"username": "Sophia Jade", "comment_text": "F"}, {"username": "David Brightbill", "comment_text": "Arezzo. It is the specialty of that city."}, {"username": "Laurie Bianchi", "comment_text": "Don't."}, {"username": "Dottor Peppe Insigne", "comment_text": "Outside the Naples station"}, {"username": "Liz Cerra", "comment_text": "Dubai"}, {"username": "Maria Mallas", "comment_text": "Bologna has amazing jewelers !"}, {"username": "Carol Brewer", "comment_text": "Not the Ponte Vecchio in Florence. We noticed it’s mostly 9 karat gold ."}, {"username": "Lisa Rossi", "comment_text": "Florence !"}, {"username": "Pong Ac Ai", "comment_text": "Ponte de vecchio"}, {"username": "Stephanie Smith", "comment_text": "Does anyone know where the makers or companies are located that make sterling silver chains?"}, {"username": "Karina Ribeiro", "comment_text": "Are there any online shops or Etsy/\ninstagram accounts to buy from internationally??"}, {"username": "Yvonne Radinović", "comment_text": "AVOID Ponte Vecchio in Florence!!!\nI bought a AUD$2000 gold and silver bracelet on the bridge, which I cannot now wear as the gold is peeling off.\nLater I was told that many of the jewellery stores on the bridge are owned by the same company, but use different names. No competition!!\nPlus prices are extremely inflated to trap suckers like me 🤦‍♀️"}, {"username": "Meryl Blank Lewis", "comment_text": "No bargains, but beautiful craftsmanship"}, {"username": "Loredana Polichetti", "comment_text": "Valenza Po, in Piemonte\n\nhttps://\nwww.divalenza.it\n/uk/"}, {"username": "Ainsley Toal", "comment_text": "Taylor Toal"}, {"username": "Tania Sidella", "comment_text": "VICENZA"}, {"username": "Marci Hulnick Ryan", "comment_text": "Was just there and did not think there were deals per se… but maybe I’m remembering 1984. 🤣"}, {"username": "Diane Petonito Giordano", "comment_text": "Florence has the most gold. Ponte Vecchio is a hot spot one jewelry store after another. But I will tell u no matter where u go the prices are sky high. Jewelry I have gotten in the past got so expensive now. Good luck I hope u find what your looking for."}, {"username": "David Mcgill", "comment_text": "Venice"}, {"username": "Alicia Cox", "comment_text": "Also be careful of bad/fake leather in Florence; lots of good ones but some fakes too!"}, {"username": "Juliana Zaremba", "comment_text": "Florence"}, {"username": "Karen Schmidt", "comment_text": "Gold Corner. They have designed\nPendants for me and mailed them to the US. I have always found them to have the best quality and price."}, {"username": "Rhonda Smith", "comment_text": "Florence…. Ask how much if you pay cash.. I saved myself $$"}, {"username": "Jos Recine", "comment_text": "Vicenza is the Italian and indeed world capital of gold jewellery making. Something like two-thirds of all the gold jewellery produced in Europe comes from Italy."}, {"username": "Karen Hill", "comment_text": "Where is the gold corner?"}, {"username": "Rita Levi Montalbano", "comment_text": "Never buy on ponte vecchio, cheap industrial gold jewerly (every shops has the exact same pieces), go instead in the arezzo area, there are some really good artisans"}, {"username": "Amalia Cristina", "comment_text": "Italy is not Dubai…"}, {"username": "Katty Veneno Perez", "comment_text": "Marta Lorenzo"}, {"username": "Jayme Terrigno-Eagan", "comment_text": "Do they sell a lot of rose gold in Italy by chance?"}, {"username": "Elisa Marte", "comment_text": "Arezzo-Toscana"}, {"username": "Ilaria Verda", "comment_text": "Valenza"}, {"username": "Enrico Lecce", "comment_text": "Go visit a small village... you'll get a great price for gold ....."}, {"username": "Anthony Falci", "comment_text": "Always in Sicily…but if not there then Florence, Venice."}, {"username": "Betty La Concreta", "comment_text": "I'm italian, sure Vicenza is the most important for gold jewelry"}, {"username": "Monica Roman-Fazio", "comment_text": "I just came back and got the best price in Sorrento"}, {"username": "Maria Coladangelo Ducca", "comment_text": "Take an Italian friend with you . The gold is sold by weight of the gold posted ( stock market price) ask around . Be sure to look , take time .. ps Italians love to bargain offer a price and be prepared to haggle . I usually leave with nothing come back in a couple and banter again. Ps the BEST price is always cash !!"}, {"username": "Rosie Crisci Cicc", "comment_text": "Esposito - Naples. Well priced and renowned by locals as the most cost effective"}, {"username": "Alessandra Hawke", "comment_text": "Go to Arezzo, gold \"makers\" from centuries"}, {"username": "Maxine Righi", "comment_text": "Ponte Vecchio"}, {"username": "Ivonne A Timar", "comment_text": "Florence"}, {"username": "Shari Hollander Baron", "comment_text": "Any place to buy permanent gold jewelry? Wanting a bracelet"}, {"username": "Kristin Benson", "comment_text": "Kelly Benson"}, {"username": "Alice Dzimiera", "comment_text": "I don't like 18k gold & that's all I've seen in Italy"}, {"username": "Gail Holler", "comment_text": "Florence"}, {"username": "Judy Stowe Cooper", "comment_text": "Florence"}, {"username": "Debra Lynn Kaus Conte", "comment_text": "Being a jeweler for 45 years Italy is very very expensive don’t believe your getting a deal your not we go to jewelers wholesale for jewelers only there pretty reasonable and 18k is all you can get"}, {"username": "Carla Rigoni", "comment_text": "Arezzo and Vicenza have the 2 major world gold trade fairs and are renowned for quality and craftsmanship. Best is to shop around and look for outlets to the manufacturers. Local Chambers of Commerce have listings if you want to research."}, {"username": "Lisa Maria Polmonari", "comment_text": "Fairdra Hanna, in Venice."}, {"username": "Sarina Natale", "comment_text": "The small towns, southern Italy if you are there, Sicily, Calabria, Abruzzi. Be careful in Ponte Vecchio tourist trap!"}, {"username": "Melissa Domingues", "comment_text": "Ponte Vecchio"}, {"username": "Laura McSweeney", "comment_text": "Gold Market-Florence"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Gold meaning jewels?"}, {"username": "Stacy Christman Ticali", "comment_text": "Florence"}, {"username": "Silvia Bindi", "comment_text": "Arezzo"}, {"username": "Lisa Quinn", "comment_text": "Florence. There’s about 30 shops on the Ponte Vecchio bridge. Price them out and see what’s best."}, {"username": "Rose Oliver", "comment_text": "Gold corner was amazing and fair in Florence"}, {"username": "Gael Mackenzie", "comment_text": "Ponte Vecchio, Florence...I think that's how it's spelled"}, {"username": "Pietro Adami", "comment_text": "Vicenza"}, {"username": "Victor Viquez Arias", "comment_text": "En florencia, en el ponte vecchio"}]}, {"id": "2192522717813473", "text": "Not sure if this has already been asked but I'm currently using Duolingo to learn basic Italian. Can you recommend any good books, courses, apps, audiobooks or videos to help me please. Thank you x", "link": "facebook.com/groups/1373361046396315/permalink/2192522717813473/", "likes": 6, "comments": [{"username": "Scott Perry", "comment_text": "Duolingo is great! MHZ Choice is a streaming service with lots of tv shows from all over Europe, with a lot of fun ones from Italy. Subtitled in English."}, {"username": "Allan Olexa", "comment_text": "Perhaps YouTube videos with English captions. I’m doing this plus Duolingo to learn a little French."}, {"username": "Nicole Düsseldorf", "comment_text": "Have a look on YouTube, eg. Italiano automatico, passione italiana"}, {"username": "Carmine Castiglia Jr", "comment_text": "Do you recall those Little Golden Books when you were a child? \"This is Mary's dog. His name is Spot. See Spot run!\"\n\nSearch for the Italian equivalent. 😃"}, {"username": "Nicola Algerino", "comment_text": "Impara anche i gesti 🤌🏻 😉😂"}, {"username": "Diana Granado", "comment_text": "Watch” My Brilliant Friend” series in HBO, I actually learned a lot"}, {"username": "Giulia Cardamone", "comment_text": "Natalie King xx"}, {"username": "Shana Woodfield", "comment_text": "Watch Italian movies with no subtitles."}, {"username": "Sara Gilardi", "comment_text": "I can recommend Italiamania (book, etc.). The main plus is that the Ianguage is absolutely idiomatic (not always the case). Just keep in mind that the grammar is explained in English but the texts are only partially translated and you will probably have to look up words autonomously."}, {"username": "Laura Faulkner", "comment_text": "Lots of great advice here, Grazie Mille!!"}, {"username": "Maria Oliva Marchal", "comment_text": "Google 'slow Italian speaking' or something similar. There are videos of people speaking Italian slowly, which makes it easier to understand."}, {"username": "Veronica Trejo Beebe", "comment_text": "I use Netflix with Spanish subtitles. I am going to start using Italian subtitles next week. I also have Rick Steve's small Italian travel book, I have been studying. If you have Audible, download Italian for beginners and just listen to the instructor."}, {"username": "Kerri Bevilacqua", "comment_text": "Coffee Break Italian is a great, free podcast that I learned a lot from in conjunction with Duolingo"}, {"username": "Andrea Herbold K.", "comment_text": "I've been watching the Beginner Italian videos on this youtube channel. I've learned more in just the 1st few videos then I did in 4 weeks on Duolingo.\nhttps://\nyoutube.com/\n@italymadeeasy"}, {"username": "Michelle Hebert Frederick", "comment_text": "Following…"}, {"username": "Jennifer Burrell", "comment_text": "Bryan Burrell"}, {"username": "Megan Leigh", "comment_text": "I'm using babbel :)"}, {"username": "Chiara Campagna", "comment_text": "If you want i can have some conversation with you in italian and you can teach me to improve my english"}, {"username": "Corey Walther", "comment_text": "Duolingo was very underwhelming. While it taught me words, it didn't teach me how to converse. Pimsleur has been a crazy improvement. And I feel I made more progress in 30 days of pimsleur than an entire year of duolingo."}, {"username": "Gina Spyker Fairfield", "comment_text": "If you’re on Instagram search Italian with Nora. She does short reels with a few ways to say a phrase. For me, it’s helpful to hear and see it spoken by a real person."}, {"username": "Tuff Ington", "comment_text": "I love Memrise."}, {"username": "Lora Ruscitti Covington", "comment_text": "You can watch your favorite shows on Netflix in Italian and have English subtitles. Super helpful!"}]}, {"id": "2192532897812455", "text": "Hello, Italian hive! We'll be leaving Italy for Germany shortly. What site do we use for train tickets?", "link": "facebook.com/groups/1373361046396315/permalink/2192532897812455/", "likes": 0, "comments": [{"username": "Oldriska Balouskova", "comment_text": "Trenitalia.com or Italo"}, {"username": "Oldriska Balouskova", "comment_text": "Italotreno.it"}, {"username": "Gloria Di Francesco", "comment_text": "www.trenitalia.\ncom or www.italotreno.\nit"}, {"username": "Giovanni Pianigiani", "comment_text": "https://\nnext.bahn.de/"}, {"username": "Oldriska Balouskova", "comment_text": "Oebb.at"}, {"username": "Virgz Van Møøre", "comment_text": "Trenitalia"}, {"username": "Manuel Macias", "comment_text": "Italio Treno app"}, {"username": "Melinda Noyes", "comment_text": "Thank you all!"}, {"username": "Diana Granado", "comment_text": "Trainline has worked for me ! It has all the carriers but they do charge you a little bit more"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2192536984478713", "text": "Any recommendations on transportation from Naples Airport to Amalfi? We will be there in early September. TIA", "link": "facebook.com/groups/1373361046396315/permalink/2192536984478713/", "likes": 1, "comments": [{"username": "Carolyn Chambers Rosamilia", "comment_text": "www.Rome2Rio.co\nm"}, {"username": "Sandy Radican Shikaly", "comment_text": "Amalfi Coast Transfers with Mena Forino"}, {"username": "Angela Gilmore", "comment_text": "You can go to Napoli train station (Napoli Garibaldi ) via bus or taxi and then take a train to Vietri sul Mare and again a bus to Amalfi.\nOr you can go by bus or taxi to Napoli ferry station (Molo Beverello) and take a ferry.\nOr take private transfer by car. Amalfi coas transfer is one of them.\nAnd I think there are also direct buses for Amalfi leaving form Napoli train station (Napoli Garibaldi)"}, {"username": "Iliana Zlatareva", "comment_text": "There is a direct bus from the airport to Sorrento, check with Rome2rio"}]}, {"id": "2192540317811713", "text": "We are planning a trip next October. We would like to visit Rome,Florence and Venice. Do you suggest using a travel agent or booking it on our own?", "link": "facebook.com/groups/1373361046396315/permalink/2192540317811713/", "likes": 0, "comments": [{"username": "Vikki Lazaro", "comment_text": "I think you can book on your own if you like. Travel between those places is easy. That said, if you already have an agent, it cannot hurt to see what they come up it price-wise."}, {"username": "Lisa Quinn", "comment_text": "On your own!! they are the most three visited places in Italy absolutely easy to get tips and ideas from. If you give yourself enough time, you absolutely can do it on your own to plan."}, {"username": "Donna Mangone", "comment_text": "Most travel agency tours include breakfast and some dinners. Lunch is on your own with free time."}, {"username": "Stacy Derouin", "comment_text": "We used a travel agent to help plan our individualized trip(not a big tour group) While we knew what cities we wanted to visit, and the basic things we wanted to do in each city, we found it invaluable to have someone knowledgeable of the area to plan/book the details. Booking our hotel, private transfers and trains as well as the tours we chose was incredibly helpful and timesaving. But I know other people enjoy doing the whole thing on their own-so it depends on your preferences."}, {"username": "Jenny Frank", "comment_text": "I book on my own asi live the hours of research etc.\nI get books from the library; read a ton, etc\nHuge sense of accomplishment and by the time I get to my destination I know a lot.\nFB groups great too.\nThe trip u want to take is easy to plan\nFly into one out the other connect with trains or drive\nFlights open 333 days out so u have gd time to plan be4 booking flights.\nBe sure all PASSPORTS (for all travelers) ARE IN ORDER be4 u book anything. Take insurance in addition to your credit card ins\nTravelling has become unpredictable your cc may not cover a lot of diff issues\n(I have annual plan with Allianz)"}]}, {"id": "2192541711144907", "text": "Is 4555 US dollars for 5 round trip tickets to Rome from Chicago a good deal? For next May?", "link": "facebook.com/groups/1373361046396315/permalink/2192541711144907/", "likes": 19, "comments": [{"username": "Tamara Stampone", "comment_text": "I saw $7k for 4 adults this week so I think that’s good (nyc > Rome)"}, {"username": "Janice Rea", "comment_text": "Yes! Great deal."}, {"username": "Teresa Marina", "comment_text": "Wow!"}, {"username": "Diane Noronha", "comment_text": "Yes"}, {"username": "Sandy Avayou", "comment_text": "Cheap"}, {"username": "Stacey Esposito", "comment_text": "Yes I paid 5604 for 4 tkts economy"}, {"username": "Eileen Marum Armitt", "comment_text": "we pd 900 hundred Newark to Naples this June"}, {"username": "Eliz Fragoso", "comment_text": "I paid 2,000 for 4 RT. From SFO ."}, {"username": "Annamarie Murphy", "comment_text": "no"}, {"username": "Karen Nowak Jellow", "comment_text": "1200 each from Boston"}, {"username": "Karen Smart", "comment_text": "Yes!!!"}, {"username": "Fannie Liu", "comment_text": "I paid $900 for Sept travel from JFK to FCO non stop on Delta Main cabin plus I spent another $190 for selecting preferred seats. I opened a Delta Amex credit card and got a $200 bonus, 50K skymiles and get one free checked bag pp."}, {"username": "Adriana Sormani", "comment_text": "Yes!"}, {"username": "Brenda Dsouza", "comment_text": "amazing!"}, {"username": "Cindy Holtfreter", "comment_text": "Google flight tracking said\n$ 2304 for one."}, {"username": "Wallace Clavelle", "comment_text": "I paid under $1000 from California."}, {"username": "Susan Rice", "comment_text": "Yes!!!"}, {"username": "Blenda Johansen-Rodriguez Del Rio", "comment_text": "Yes. I just paid $2800 for 2 people."}, {"username": "Rachel Collins", "comment_text": "Yes!"}, {"username": "Michelle Pace", "comment_text": "I paid 1900.00 each ticket end of may this year so that is a great price"}, {"username": "Julie Boyer Orris", "comment_text": "Decent price. Does that include checked baggage?"}, {"username": "Traci Raymer", "comment_text": "It’s were $1600 a piece ($1000 before taxes and fees)"}, {"username": "Holly Davidson White", "comment_text": "Yes, get yourself booked asap!"}, {"username": "Chrystal Stevens Bisonet", "comment_text": "We got $650 RT from chicago per person for spring break next year (5 of us). My in laws booked the next day and got their tix for $550 per person! 😱"}, {"username": "Rip Lonergan", "comment_text": "Right now on Expedia. $638.00 RT in Economy"}, {"username": "Skye Birch", "comment_text": "mine was £18 with Ryan air 😅🤪"}, {"username": "Nancy Lewis", "comment_text": "I found $700 - 1000 each just now for May 2024. From ORD."}, {"username": "Carmela Siniscalchi Frattellone", "comment_text": "Def a good deal. I paid $3800 for 2 people. We went in June"}, {"username": "Nicole Goudey-Rigger", "comment_text": "Sometimes two one ways is less than one round trip. I always price in a bunch of ways and some outbound and inbound cities have more than one airport."}, {"username": "Virginia Lane", "comment_text": "Another idea- Milan is usually cheaper to fly into than Rome. It’s a 3 hour train ride."}, {"username": "Patrick Gilmore", "comment_text": "Get a couple credit cards from the airlines you are flying. You will get points and use the points ti get better tickets and wave the luggage fees."}, {"username": "Millie Fisk", "comment_text": "We paid $1300 for one ticket. Its a great deal.. what airline?"}, {"username": "Cameron Smith Bradley", "comment_text": "I paid that for 2 a few months ago."}, {"username": "Lee D'Angelis", "comment_text": "Yes absolutely"}, {"username": "Virginia Lane", "comment_text": "I’d wait until September to start looking. There is app called Hopper that tracks airline fares. Also, you can set up an alert in Google flights."}, {"username": "Carla Barker", "comment_text": "Yes!"}, {"username": "Jeff Davis", "comment_text": "Just paid $13,200 for 6 people, so I’d say jump on that bargain rate."}, {"username": "Jill Medrano Casey", "comment_text": "I would say so. We paid $1300 ($6500 for 5) for this past June.\nHowever, I think it is suggested to buy international tickets between 2 and 8 months out."}, {"username": "Fritzie Malinis", "comment_text": "Definitely! Our recent trip , month of June. Paid almost7K for 5 ."}, {"username": "Veronica Trejo Beebe", "comment_text": "Yes"}, {"username": "Kathy Flood", "comment_text": "Yes"}, {"username": "Carole Tarlap", "comment_text": "YES💥💥"}, {"username": "Stephanie Osborn Rushing", "comment_text": "Dang yes"}, {"username": "Margaret Fanelli-Granger", "comment_text": "Yes! I paid nearly $2k per ticket from NY to Rome."}, {"username": "Stella Dee", "comment_text": "Great deal!"}, {"username": "Magaly Castillo", "comment_text": "Good price, we paid $4500 for 5 people on June , we flew from New York to Milan by Delta regular economy"}, {"username": "Nadia Filice", "comment_text": "Absolutely"}, {"username": "Tricia Brittingham Neff", "comment_text": "I watched for about 6 months before buying Philadelphia to Rome (direct) and they ranged anywhere from 800-1200 round trip!! So your deal seems pretty standard!"}, {"username": "Cynthia Marie", "comment_text": "For 5 pp , round trip tickets!!! Grab them up, that is a deal even for economy. Wow! Lucky you."}, {"username": "Sonia Scotto Lubrano", "comment_text": "Great deal"}, {"username": "Delphinia Salamin", "comment_text": "What airline is it ?"}, {"username": "Victoria Marchetti", "comment_text": "Yes"}, {"username": "Maria Oliva Marchal", "comment_text": "Yes. We paid $2,000 per person."}, {"username": "Jennifer Thomas", "comment_text": "Definitely! What airline? I’ve been getting $3-4k for 2 people at the end of May"}, {"username": "Robert DeLeon", "comment_text": "Absolutely!"}, {"username": "Sharon Menegoni", "comment_text": "yes!"}, {"username": "Catalina Daniel", "comment_text": "I spend $1500 per person\nHowever, my sister got lucky & got a $600 ticket! 😱"}, {"username": "Nakitha Badon", "comment_text": "Sounds like amazing deal. My round trip was $881 on AAA. And I got to spend a 24 hours in Paris as a layover"}, {"username": "Greg Fetro", "comment_text": "Try Groupon 👍"}, {"username": "Tina Iski", "comment_text": "YES. 2500 for 2 in JANUARY!"}, {"username": "Tom Manno", "comment_text": "Yes."}, {"username": "Martha Tuzson Stockton", "comment_text": "Pretty good. I’ve seen tix as low as $800, but I paid $1000 for my tix this September from Chicago. And they could be $1500 or more. I hate buying plane tickets. They might go down, but they might go up. I’ve heard three months in advance is the best time to buy. That’s a decent price. The other question is if they’re refundable/ changeable, are there extra costs to check bags or get seats together."}, {"username": "Shannon Marie", "comment_text": "Yes that's pretty good especially if nonstop. I saw as low as $650 nonstop on ITA from IAD but also as high as $1.4k nonstop on United."}, {"username": "Glenn Todd Webb", "comment_text": "Right now yes."}, {"username": "Gregory Smith", "comment_text": "Basic Economy or Regular Economy?"}, {"username": "Lakin Massengile", "comment_text": "Sounds like a great deal. Mine was 4000 for 2"}, {"username": "Sandi Van", "comment_text": "Yes I paid 1350 each ….."}, {"username": "Stacey Lynne Fatalo", "comment_text": "If the total is 4555 for all 5 then it’s better than what we paid - but if it’s 4555 round trip each - then no - We paid 4462 for round trip for 2 from Boston to Florence and 2250 for our daughter who had different return date- all three tickets had one lay over there and one lay over home it wasn’t bad at all - we booked very very last minute since we didn’t know until May 2023 that we were coming in June 2023."}, {"username": "Heath Conn", "comment_text": "Not bad. I generally budget about $1000 each from the states."}, {"username": "Andrea Shelton", "comment_text": "Beginning of May or end of May?"}, {"username": "Brandy Hines", "comment_text": "I paid $7200 for July dates for 4."}, {"username": "Audrey Daenzer", "comment_text": "Great deal. I paid almost $5,000 for 2 (extra leg room) a few weeks ago."}]}, {"id": "2192548181144260", "text": "Has anyone been to Celano? Opinions? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2192548181144260/", "likes": 0, "comments": [{"username": "Luca Tocci", "comment_text": "It's a relatively small city and a nice place to visit, however if you enter Abruzzo you should visit more than just one location, there are loads of things to see."}]}, {"id": "2192552887810456", "text": "We are planning a trip next October. We plan on spending 3 to 4 nights in Florence. Looking for recommendations on sites to see. thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2192552887810456/", "likes": 1, "comments": [{"username": "Allan Olexa", "comment_text": "Piazzale Michelango…asce\nnd to the famous overlook/vista and the outdoor bronze David, especially at sunset."}]}, {"id": "2192576541141424", "text": "Please share your recommendations for the following cities, we will be going in October ..\n\nMilan\nLake Como (varenna)\nFlorence\nRome\n\nTIA!", "link": "facebook.com/groups/1373361046396315/permalink/2192576541141424/", "likes": 1, "comments": [{"username": "Francesco Pogna", "comment_text": "Lake Como could be extremely expensive and touristy - instead go to Lake Garda and visit Sirmione. There are also hot springs in a lake castle there to spend a few hours relaxing :)"}, {"username": "Tonsia Keytel", "comment_text": "We loved Milan, definitely do the hop on hop off bus."}, {"username": "Tonsia Keytel", "comment_text": "Varenna is also magnificent but I would stay in Bellagio. Was there in May."}]}, {"id": "2192588571140221", "text": "Where should be eat lunch between touring the catacombs and the Vatican", "link": "facebook.com/groups/1373361046396315/permalink/2192588571140221/", "likes": 1, "comments": [{"username": "Nana Esther Bertolino", "comment_text": "My suggestion is eat in or out in a place that has what you want. All eating places are yummy . The catacombs and the Vatican is quite a distance. Drink tons of water . Enjoy Italy !"}, {"username": "S.P. Espy", "comment_text": "Venture at least 5-10 minutes into the Prati neighborhood where there will be several excellent and much lest tourist trapish places"}, {"username": "Marscha Fransisca Debora Basdew", "comment_text": "Check Google Maps ☺️"}, {"username": "Kristine Zeronda", "comment_text": "Try Tripadvisor when you are there."}, {"username": "Colleen Dawson", "comment_text": "The Fork is an app to help you find restaurants and can also be used to make reservations."}, {"username": "Mat Marturano", "comment_text": "l'isola della pizza, it's very close to the Vatican"}]}, {"id": "2192611951137883", "text": "Has anyone transit to Shanghai Airport on flight to Rome?\nDo they request the Covid test result if you only transit to their airport?", "link": "facebook.com/groups/1373361046396315/permalink/2192611951137883/", "likes": 0, "comments": []}, {"id": "2192615471137531", "text": "How easy/hard is it to eat dairy free in Italy?", "link": "facebook.com/groups/1373361046396315/permalink/2192615471137531/", "likes": 4, "comments": [{"username": "Barbarella Bonvento", "comment_text": "If you drink cappuccino or latte macchiato ask for latte d’avena or di soia. For gelato ask for sorbetto. It is doable"}, {"username": "Brian Yonks", "comment_text": "I was very low dairy in Italy. I had a lot of \"Dairy Ease\" lactase enzyme pills with me."}, {"username": "Wilki KJ", "comment_text": "You can do it in Italy quite well. Some gelateria have soya based gelato or even oat milk gelato there is the sorbet too. You can get pizza without the cheese, or there is vegan resturants in the cities. Some of the smaller towns too.\nYou can have a wide variety of food without eating diary overall"}, {"username": "Hudd Cass", "comment_text": "I’ve been there the past 4 weeks and managed to get soy cappuccinos everywhere."}, {"username": "Luca Tocci", "comment_text": "We have all sorts of dairy free / lactose free products.\nJust ask."}, {"username": "Virgz Van Møøre", "comment_text": "Very easy, plenty of other kind of food"}, {"username": "Denise Gadsby", "comment_text": "Very !! We went to Venice and my daughter is vegan and we found ice cream and you must try frulala !!"}, {"username": "Alessandro Battxi", "comment_text": "Super Easy, I mean in Italy we do have people who cannot eat dairy, gluten and lactose."}, {"username": "Rhonda Smith", "comment_text": "Yes! ❤️ Was there in May of this year( I’m also gluten free) you just ask… very helpful!"}, {"username": "Trinity O'Neal", "comment_text": "It’s not. Just traveled there for the holidays. We are both celiac and she’s also DF. we had no problems."}, {"username": "Mary Fornataro", "comment_text": "Very easy. They accommodate all dietary restrictions!"}, {"username": "Samantha Pavanello", "comment_text": "È molto semplice, abbiamo tante persone intolleranti e ci sono tabti prodotti sostitutivi pensati apposta"}, {"username": "Julia O'Brien Holbrook", "comment_text": "It’s easy. I can’t eat gluten or dairy. Italians know food and are used to celiac diets. I go to Italy regularly and have no problem. I am fluent in Italian which makes it easier discussing what I need, though."}, {"username": "Teresa Marina", "comment_text": "Latte senza lactosa - is what I order with my caffe Americano. It’s more common than the almond milk."}, {"username": "Sandra Maldonado", "comment_text": "It’s easy if you don’t like cheese."}, {"username": "Graham Sherlock", "comment_text": "It's not a third world country it caters to millions of tourists daily"}, {"username": "Lea Mccloughan", "comment_text": "Laura McCloughan great info for you to follow x"}]}, {"id": "2192628394469572", "text": "Hello, looking for restaurant recommendations in Florence! : ) Grazie!", "link": "facebook.com/groups/1373361046396315/permalink/2192628394469572/", "likes": 36, "comments": [{"username": "Maria McGill", "comment_text": "I’ll Scuto"}, {"username": "Victoria Marchetti", "comment_text": "Babet with the wine window. The food was amazing"}, {"username": "Stephen Slaughter", "comment_text": "Sustanza, La Garga, Celestino, 13 Gobi All excellent"}, {"username": "Kerstin Attard Biancardi", "comment_text": "La Buchetta- try out the bistecca florentina and cheese cake… just wow\n\nOsteria Pastella\n\nLa Giostra"}, {"username": "Pong Ac Ai", "comment_text": "Pong Ac Ai"}, {"username": "Anne Gee", "comment_text": "La Madia was great. It was a small family owned restaurant with great service and unbelievably fresh food."}, {"username": "Pat Hooper-Bruins", "comment_text": "Antica Trattoria de Tito -\nIt’s away from the main area, in the back streets, about 10 mins walk from Academia Gallery. The food was delicious, especially the roast potatoes!\nThe restaurant has a great vibe, waiting staff singing along to the music. After the meal the wait staff leave a bottle of Lemoncello at your table and you help yourself to drink. They come back for a salut! Booking a must they queue at the door. Enjoy!\n\nhttps://\nwww.trattoriadat\nito.com/home"}, {"username": "LeLi Giorgadze", "comment_text": "Trattoria Za Za 👍"}, {"username": "Nicole De Gouveia", "comment_text": "This place was amazing. Great food and service"}, {"username": "Tracy Ryley", "comment_text": "La Giostra! Make reservations!"}, {"username": "Line Gregoire", "comment_text": "Sabatini: try the flambed spaghetti🤤"}, {"username": "Catherine Creamer", "comment_text": "Trattoria Omero"}, {"username": "Bill Kallenberg", "comment_text": "La gyostra is a must"}, {"username": "Alison Ashby-Shard", "comment_text": "La Loggia del Piazzale Michelangelo, great food and views of the Duomo and Ponte Vecchio. Sunset is spectacular from this vantage point.\n\nhttps://\nwww.ristorantela\nloggia.it/"}, {"username": "Kelle Packard", "comment_text": "Za Za And guanciale"}, {"username": "Cindy Kline", "comment_text": "Family Business… casual…. Reasonably priced"}, {"username": "Roni Haddad", "comment_text": "ליטל שוורץ"}, {"username": "Leanne Howard", "comment_text": "https://\nwww.eater.com/\nmaps/\nbest-restaurants\n-florence-italy this guide is great and there is one for rome too. Really good descriptions and from fine dining to best gelato"}, {"username": "Fernanda Argomedo", "comment_text": "Download the app \"the fork\", there are a lot of restaurantes with 30, 50 or even 50% off"}, {"username": "Barbara Brosnan", "comment_text": "FrancescoVini fabulous atmosphere, family run, amazing Florentine steak and food"}, {"username": "Laura Natalini", "comment_text": "Latini, Zà Zà, pizzeria da Michele, pizzeria fratelli Cuore, Perseus. Schiacciateria da Pino, Antico Vinaio"}, {"username": "Sarahjane Zuniga", "comment_text": "Ristorante Santa Elisabetta 😋"}, {"username": "Jeannine Egdorf Phelan", "comment_text": "Jeannine Egdorf Phelan"}, {"username": "Val Kilgallon", "comment_text": "We liked the blueberry steak at Acqua Al 2 very much."}, {"username": "Katie Giffuni", "comment_text": "La Giostro, Trattoria ZaZa , Il Bottegone"}, {"username": "Dawn Padgett Hanes", "comment_text": "We loved La Buchetta!"}, {"username": "Suzi Madden Padgett", "comment_text": "ZaZa!!"}, {"username": "Daniel Kassie Karstens", "comment_text": "Marlo Möller Karstens"}, {"username": "Kathryn Kennedy", "comment_text": "Anywhere. It’s Italy!"}, {"username": "Hilary Brooke", "comment_text": "Maggie Byerly Thank you for the recommendation we are at Trattoria de’ Gucciardini and it was amazing"}, {"username": "Denise Storti", "comment_text": "I 13 gobbi.."}, {"username": "Michele Baron Vold", "comment_text": "Il Latini"}, {"username": "Kim Catania", "comment_text": "Matto Matto was beyond fabulous! Martare was also amazing!"}, {"username": "Joanie Corneil", "comment_text": "Osteria dell’Olio!"}, {"username": "Lupita HC", "comment_text": "Trattoria ZaZa!"}, {"username": "Cris Wimer", "comment_text": "Not fancy, not expensive…just great food. Trattoria Roberto"}, {"username": "Gina Johannes", "comment_text": "We just left Trattoria Za Za. It was delicious and so beautiful inside!!!"}, {"username": "Troi Ann Nunez Reppart", "comment_text": "Za za’z"}, {"username": "Laura Elash", "comment_text": "My fav was Ciro and Sons! They welcome you like one of their family."}, {"username": "Christine Malota- Kendall", "comment_text": "4 Leoni. Gusta Pizza. la Menagerie. Trattoria TiTo. 4 Seasons hotel on Borgo Pinti for a burger or cocktail."}, {"username": "Alice Engstrom", "comment_text": "Quattro Leone, Il Cibreo, Ciangale Bianco"}, {"username": "Lourie Morse", "comment_text": "Zest and if you sit outside it comes with a beautiful view."}, {"username": "نسيم البحر", "comment_text": "i am looking for someone who takes me there😁"}, {"username": "Donna Dougherty", "comment_text": "So good!!"}, {"username": "Grg Cozzetto Oetterer Mra", "comment_text": "Il Santo Bevitore"}, {"username": "Ali Miller", "comment_text": "IL Latini, hands down, the best Florentine Steaks ever!"}, {"username": "Tanya Luca Chetcuti", "comment_text": "David Chetcuti"}, {"username": "Elena Ciraulo", "comment_text": "https://\nwww.casatrattori\na.com/\ntrattoria-13-gob\nbi/"}, {"username": "Elena Ciraulo", "comment_text": "https://\nwww.boccadarno-f\nirenze.com/"}, {"username": "Elena Ciraulo", "comment_text": "https://\nwww.4leoni.it/\nmenu/"}, {"username": "Suzanne Caprio", "comment_text": "Buca Mario"}, {"username": "Jennifer Diamond", "comment_text": "Really enjoyed 4Leoni last week"}, {"username": "Rebecca Knox Housley", "comment_text": "I really loved this place. The food was delicious. They do have Steak Florentine and the service was fantastic!"}, {"username": "Tracey Horsey", "comment_text": "F"}, {"username": "Beth Pesta McGuire", "comment_text": "Cingiahle al bianco otro Arno. So good."}, {"username": "Paul Gould", "comment_text": "La Buchetta!"}, {"username": "Ray Tiezzi", "comment_text": "Cingale Bianco !"}, {"username": "Antonio Aloè", "comment_text": "Such a stupid question...🫣"}, {"username": "Alaa BahnAsy", "comment_text": "Zaza"}, {"username": "Valerie Collanton", "comment_text": "Trattoria Boboli. Great food. Great service."}, {"username": "Francesca Messina", "comment_text": "Perseus\nBrindellone\nSanto bevitore\nAntico ristoro cambi\nBuca da Mario\nOsteria i buongustai (only for lunch)"}, {"username": "Russell Weidner", "comment_text": "Russell Weidner"}, {"username": "Julia Salmon", "comment_text": "For a nice steak dinner buca Mario was so good"}, {"username": "Caryn Goode", "comment_text": "Buca Lapi, 4 Leoni & Antica Trattoria da Tito"}, {"username": "KB Spector", "comment_text": "Ciro and Sons for the win"}, {"username": "David Garfinkel", "comment_text": "La Giostra. Amazing"}, {"username": "Traci Merriman Langill", "comment_text": "Buca Mario or Circo & Sons !\nRoof top bar on the Westin Hotel"}, {"username": "Maggie Byerly", "comment_text": "Two restaurant recommendations\nfor family owned and amazing food. First is Trattoria de' Guicciardini in the Oltrarno district. It is tucked behind a gelateria in a small courtyard just south of the Ponte Vecchio. Second is i'Mangiarino just a couple of blocks south of Il Duomo. Both had fantastic food and lovely people. Highly recommend!!"}, {"username": "Maggie Byerly", "comment_text": "Maggie Byerly"}, {"username": "Steve Watkins", "comment_text": "Chic Nonna"}, {"username": "Pam Armenia O'Brien", "comment_text": "La Goistra"}, {"username": "Aaron Grieger", "comment_text": "Monica Grieger"}, {"username": "Stephanie Norton", "comment_text": "Persus. Their wine and food are great!"}, {"username": "Alex Kovacs", "comment_text": "Osteria vecchio cancello"}, {"username": "Carmen Higham", "comment_text": "Ristorante Natalino"}, {"username": "Carmen Higham", "comment_text": "Ristorante Natalino"}, {"username": "Trinity O'Neal", "comment_text": "Giostra"}, {"username": "Trinity O'Neal", "comment_text": "They also have great food at the Central Mercado on the 2nd floor if you’re looking for something more casual for lunch."}, {"username": "Carlie Wohlford", "comment_text": "Il Profeta! Get the pear ravioli. & Gusta pizza (get in line early)"}, {"username": "Audrey Gibeault", "comment_text": "Yellow bar"}, {"username": "Debbie DiOssi", "comment_text": "Bocadama in Santa Croce square."}, {"username": "Mary Ellen Maatman", "comment_text": "Mattacena."}, {"username": "Stephanie Nicole", "comment_text": "f"}, {"username": "Melanie Manasseh", "comment_text": "Za Za’s Trattoria"}, {"username": "Eileen Glenane", "comment_text": "Frescobaldi! The best steak ever"}]}, {"id": "2192629964469415", "text": "Hey there! Anyone ever stayed at the Loly Boutique in Trastavere? Is this angood location??", "link": "facebook.com/groups/1373361046396315/permalink/2192629964469415/", "likes": 0, "comments": []}, {"id": "2192644404467971", "text": "Best airport to fly into to access Cinqua Terre? Weather mid to late May?", "link": "facebook.com/groups/1373361046396315/permalink/2192644404467971/", "likes": 1, "comments": [{"username": "Erika Biggio", "comment_text": "Genova it's the regional airport"}]}, {"id": "2192654094467002", "text": "Are there any souvenir stores in Rome? Just looking for the standard keychain, magnets, shot glass type thing. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2192654094467002/", "likes": 9, "comments": [{"username": "Alison Carney", "comment_text": "Hundreds around St. Peter’s"}, {"username": "Shelley Howard", "comment_text": "1 every 2 steps"}, {"username": "Machel Bigelow Salado", "comment_text": "There are tons of them."}, {"username": "Karen Schofield", "comment_text": "So, so many"}, {"username": "Ruth Olivia Yanes", "comment_text": "Yes, so cute keychains, magnets and nicknacks for one euro 💶"}, {"username": "Jill Medrano Casey", "comment_text": "That's like asking are there any gelato places or pizza places!"}, {"username": "Margie Shapiro", "comment_text": "only on every corner ....."}, {"username": "Tami Neubauer Foster", "comment_text": "I think it's rude that some people use the laughing emoji. They've never been there before and are asking a legitimate question, which is the purpose of this group. It probably makes some people less likely to ask advice here."}, {"username": "Renae Larcus", "comment_text": "On every corner"}, {"username": "Kerry Cofrancesco", "comment_text": "They are EVERYWHERE"}, {"username": "Frank Hunt", "comment_text": "Loads of junk shops everywhere now, such a shame."}, {"username": "Vasthi Cheddar", "comment_text": "Omg... way too many 😃"}, {"username": "Greg Pead", "comment_text": "😂🤣😂🤣"}, {"username": "Lorraine Saggese Serluco", "comment_text": "My favorite place for souvenirs is the St Peters souvenir shop"}, {"username": "Alexandra A Welker", "comment_text": "There's no shortage, it's literally everywhere."}, {"username": "Melanie Sartuche", "comment_text": "They're all over. Some are stores, some are kiosks"}, {"username": "Jenni Fir", "comment_text": "Look around the metro stations. There are a few shops down the street from the Vatican."}, {"username": "Tamara Stampone", "comment_text": "Every other door is a souvenir shop"}, {"username": "Terry Spincic", "comment_text": "NO,in Rome is not any souvenir shop.You will need to go home and odher on linein your country"}, {"username": "Sherri Leis Dillavou", "comment_text": "They are everywhere"}, {"username": "Lauren Vassallo Beattie", "comment_text": "There's one street where it's never ending, it's near the train station."}, {"username": "Jan Armstrong", "comment_text": "Everywhere xx"}, {"username": "Lorissa Gill", "comment_text": "Only thousands of them"}, {"username": "Liz Cerra", "comment_text": "And this is one of the reasons I’m leaving this group. I can no longer read the most stupidest questions. Does no one do any ‘due diligence’ before going on travels ?\nGod help you!!"}, {"username": "Nicola Amy MacDonald", "comment_text": "They are everywhere, super easy to find 😊 enjoy!"}, {"username": "Giovanni Pianigiani", "comment_text": "There are about one or two😅"}, {"username": "Stephanie Smith", "comment_text": "Everywhere you look, in particular around piazzas"}, {"username": "Mary Iuor", "comment_text": "You will be able to buy souvenirs from local street vendors as well as in stores. I noticed on many key chains and small souvenirs were poor quality from local street vendors."}, {"username": "John Layman", "comment_text": "You will be able to find them at all the major attractions,no problem."}, {"username": "Linda Stockley", "comment_text": "Every 5 feet or so 😊"}, {"username": "Pietro Adami", "comment_text": "Too many of them 😂"}, {"username": "Wende Shurin", "comment_text": "About every 50 ft in the tourist areas. You won't have any problem at all finding those items."}, {"username": "Charlie Louise Moore", "comment_text": "There are loads, always worth looking around to get the best prices. Don’t be afraid to ask for the price to be dropped etc. I did the same, just came back x"}, {"username": "Shannon Stanton King", "comment_text": "Tons"}]}, {"id": "2192657031133375", "text": "What’s the best Vatican and Rome visiting sites pass including skip the line please?\nThank you", "link": "facebook.com/groups/1373361046396315/permalink/2192657031133375/", "likes": 1, "comments": [{"username": "Suzanne Ayres", "comment_text": "On each official website you will find tickets. The Vatican has a couple interesting ones. Specifically the Early Morning one that includes breakfast and another one called SCAVI Tour."}]}, {"id": "2192661377799607", "text": "Looking for a last minute tour for Italy for august from New Jersey. Any leads? 🙃", "link": "facebook.com/groups/1373361046396315/permalink/2192661377799607/", "likes": 0, "comments": [{"username": "Elizabeth Amiss Carrico", "comment_text": "Check out \"Tour Radar\" they have last minute tours"}, {"username": "Shannon Hoffman-prichett", "comment_text": "Steph. Let me know"}]}, {"id": "2192667021132376", "text": "We are going to Italy for four weeks in September/October\nBest place for linens. Tablecloths and lace", "link": "facebook.com/groups/1373361046396315/permalink/2192667021132376/", "likes": 0, "comments": []}, {"id": "2192670771132001", "text": "Italy in January????????", "link": "facebook.com/groups/1373361046396315/permalink/2192670771132001/", "likes": 1, "comments": [{"username": "Maura Galli", "comment_text": "Depending where you are going"}, {"username": "Scott Perry", "comment_text": "I did a Dec-Jan trip right before COVID. A bit chilly, but people were still eating outdoors in Rome, thanks to the outdoor gas heaters."}]}, {"id": "2192674944464917", "text": "I see a lot of posts suggesting using a Visa or Mastercard. Is Discover card accepted in Italy?", "link": "facebook.com/groups/1373361046396315/permalink/2192674944464917/", "likes": 0, "comments": [{"username": "Lisa O'Keefe", "comment_text": "Discover is very unlikely to be taken, as is Amex. Visa is the most likely, and Mastercard as well. Although some places prefer one over the other. Your best bet is always cash!"}, {"username": "Carmine Castiglia Jr", "comment_text": "Carmine Castiglia Jr"}, {"username": "Andrea Paquette Haber", "comment_text": "You should definitely be looking at cards that have not international fee."}, {"username": "Elisa Bree Vandekamp", "comment_text": "Not really. Better Visa or MasterCard, they're accepted almost everywhere"}]}, {"id": "2192687037797041", "text": "Hello!\nHas anyone used Italiarail.com to book your rail tickets? I’ve booked my tickets through them but now a little worried it’s not an official site. My Airbnb host said it should be fine however they are not that common 😅", "link": "facebook.com/groups/1373361046396315/permalink/2192687037797041/", "likes": 0, "comments": []}, {"id": "2192704717795273", "text": "Has anyone used “Bounce” to store their luggage for the day?", "link": "facebook.com/groups/1373361046396315/permalink/2192704717795273/", "likes": 0, "comments": [{"username": "Kathi Keefauver Thompson", "comment_text": "Im planning to use it in Bologna and Arezzo. Interested to hear others’ experiences"}, {"username": "Carrie Laman Lacy", "comment_text": "We used Stow Your Bags with no issues. Just make reservations ahead of time."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2192712044461207", "text": "Tips on food from an Italian:\nMilan: Osteria Conchetta - amazing authentic meal.\nCinque Terre: if you’re staying in Corgnilia - Matteos. Also if you’re willing to try something different ‘Nessun Dorma’ cooking class with pesto in Manarola is amazing. Amazing views too!\nRome: osteria da fortunata\nNaples: Da tonino and trattoria del orca in chiaia\n\nThese are main food recommendations that are a must! Enjoy 😉", "link": "facebook.com/groups/1373361046396315/permalink/2192712044461207/", "likes": 9, "comments": [{"username": "Scott Perry", "comment_text": "I stayed in Chiaia for a week last month. Well, maybe next time."}]}]