[{"id": "2194208427644902", "text": "Rome airport Naples, best price, private car transfer 29th August.", "link": "facebook.com/groups/1373361046396315/permalink/2194208427644902/", "likes": 0, "comments": [{"username": "Allison Carlisle Young", "comment_text": "I had a transfer booked with viator then got a quote from limousinrome. For my family of 5 and all our bags he was better priced. Limousinrome.co\nm"}, {"username": "Don Dennis", "comment_text": "Dario private tours and transportation.\nHe's a great English speaking guy you can trust.\n\nhttps://\nwww.facebook.com\n/\nprofile.php?id=1\n00086215069174"}, {"username": "Cettina Milioto", "comment_text": "Cettina Milioto"}]}, {"id": "2194209600978118", "text": "Gorgeous day to be on the water. Takes the heat away at least until we arrive in Capri.", "link": "facebook.com/groups/1373361046396315/permalink/2194209600978118/", "likes": 0, "comments": []}, {"id": "2194213517644393", "text": "Recommendations for a driver to take us around Milan please ￼.", "link": "facebook.com/groups/1373361046396315/permalink/2194213517644393/", "likes": 0, "comments": []}, {"id": "2194213804311031", "text": "Going italy for two weeks today!! It’s my first time and we’re travelling round.\nWhat are the best restaurants and must see things in Verona, Como, Venice and Bologna?\nMany thanks🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2194213804311031/", "likes": 4, "comments": [{"username": "Steve Grossman", "comment_text": "They are all the best they are in italy. If they weren't they would be closed"}, {"username": "Scott Perry", "comment_text": "If you like cocktails, try Guero in Bologna. I think it’s on via Goito. Tell them Scott sent you. 😄"}, {"username": "Pietro Adami", "comment_text": "In Verona, best dining option in my opinion is the Trattoria Giulietta e Romeo; or La Colonna, or the Alcova del Frate (slightly more expensive). All of them in the ciry center"}, {"username": "Nicola Algerino", "comment_text": "A Bologna visita piazza maggiore , basilica di San Luca , la miriade di torri che ci sono , poi vicino Bologna c’è Modena dove puoi guidare una Ferrari nel circuito oppure un giro in elicottero nelle campagne .. P.s a Bologna si mangia da Dio !"}, {"username": "Glenn Todd Webb", "comment_text": "Como-the duomo. Villa Balbianello and Carlotta up lake in Tremezzo."}, {"username": "Richard Petronio", "comment_text": "In Bologna there is a very small restaurant in the Porta San Mamolo area. The restaurant is Osteria 15. This is one of the places that locals eat. The lasagna Bolonese is terrific. You need to call for a reservation."}, {"username": "Eden Zambara", "comment_text": "Following!"}]}, {"id": "2194222707643474", "text": "Does anyone know where exactly the bus stand is in Bergamo where I can get the shuttle/bus back to Bergamo Orio Al Serio airport?\n\nI’m taking a train back to Bergamo tomorrow which I know stops in the main station, from where where do I get the bus back to the airport?", "link": "facebook.com/groups/1373361046396315/permalink/2194222707643474/", "likes": 0, "comments": [{"username": "Katalina Loredo", "comment_text": "You should be able to see that on google maps under the bus section"}, {"username": "Karen Blackmore", "comment_text": "You need the \"1 ✈️\" bus which goes from right outside the station. There is also just a \"1\" bus which goes to-from Bergamo town."}, {"username": "Karen Blackmore", "comment_text": "The trains to Bergamo are quite old and often run late (our experience this week!). Also the coaches are not all air conditioned. Coach 2 is a good one as it just about has air conditioning!"}, {"username": "Karen Blackmore", "comment_text": "Sorry just realised your post is 6d old!"}]}, {"id": "2194230484309363", "text": "Hello! We’re gonna visit Rome in September, we chose to stay in an apartment near the National Institute of Infectious Diseases. Is it a nice area to stay? Is it too far away from the centre of Rome? And what about public transport? Thanks in advance", "link": "facebook.com/groups/1373361046396315/permalink/2194230484309363/", "likes": 0, "comments": [{"username": "Cecilia Christine Costantini", "comment_text": "If you are talking about the one in the Spallanzani hospital, not very well connected to the city center, not much in that area. Public transport is not the best, . I am from Rome (although living abroad for 20 years) and went to that area because there are some murals I wanted to see. Well, my dad had to drive me there 😖 If you chose it because it was cheaper, look for accommodation in Garbatella/San Paolo/\nPiramide. Those neighbourhoods are just 2-3-4 Metro stops away from the city center."}]}, {"id": "2194230550976023", "text": "Anyone who thought and told me to come to Italy in July defintely wanted me die. I was in Venice in 2 days and I defintely thought I’ll die with all the heat. You can’t walk from 10 am to 5 pm. It’s useless to come to the place to travel if you can’t even enjoy it and you have to stay in your hotels all day long. Literally trip wasted, never want to travel to Italy in summer again. It’s boiling here.", "link": "facebook.com/groups/1373361046396315/permalink/2194230550976023/", "likes": 177, "comments": [{"username": "Veda Viscosi Bak", "comment_text": "June - Aug with heat and all the people is tough. October and May is when I love to go."}, {"username": "Michelle Lien-Burdick", "comment_text": "Travelling this week with friends. We all agreed we'd rather melt in Italy than stay in the states and melt 😉"}, {"username": "Margarita Nechaeva", "comment_text": "You are right. Best time to come is really spring and autumn. Piedmont and Sicily in late October - November were both splendid. And so was Rome in April. Even winter has its charm and far less tourists. 🙂"}, {"username": "Pixie Skase", "comment_text": "Omg the same !!! It’s apparently an unusual year"}, {"username": "Deanne Tetrault", "comment_text": "That is one reason why we choose to go in October"}, {"username": "Giorgia Petraia", "comment_text": "We call it “summer”"}, {"username": "Lauren Courtney Mullins", "comment_text": "I wonder how it compares to Texas heat? If anyone knows, I’d like to mentally prepare my husband 😅"}, {"username": "Rose Oliver", "comment_text": "We were just in Venice we did most Activities early in the morning room breaks in the middle of the day and then went back later afternoon"}, {"username": "Cat Bond", "comment_text": "There’s a heat wave in Europe at the moment, so it’s hotter than usual"}, {"username": "Mary Shoop", "comment_text": "Research?"}, {"username": "Susan Miles-Penney", "comment_text": "We went in September and it was hot."}, {"username": "Gail Penoro Tobias", "comment_text": "It’s July… you can check the weather yourself instead of relying on someone else."}, {"username": "Janice Moser Judge", "comment_text": "This is why I prefer to travel April May or after Labor Day. But all my kids are grown so I’m able to that. This summer is really hot all over."}, {"username": "Molly Elizabeth", "comment_text": "We are on week 2 in Italy. We’re hot but have a different mindset….we’re hot in Italy!!! What a terrible thing! (Not 😉)"}, {"username": "Henri K Pascha", "comment_text": "Where do you live? Himalaya?"}, {"username": "Jessica Therrien", "comment_text": "I’m here right now and doing Tuscany… driving in the car with AC and stopping to locations. I can’t even imagine walking around all day in this heat !! It’s way to hot 🥵"}, {"username": "Sonya Jennings", "comment_text": "Just said on the news here in Australia, its the hottest on record not just Italy but many European places"}, {"username": "Elvira Lelli", "comment_text": "The best tine to travel is in spring and autumn...🤩"}, {"username": "Mike DuBois", "comment_text": "Thanks for the warning from your lesson learned, sorry you experienced it."}, {"username": "Francoise Coupal", "comment_text": "Really. I think we all have a responsibility to do our research. You simply have to Google weather in Italy in July and August and it will tell you that it is very hot. You can’t blame another reader for suggesting this time of year."}, {"username": "Mike Guarini", "comment_text": "Curious where everyone is traveling from. It's hot in most of the US as well."}, {"username": "Diane Hamilton", "comment_text": "We’re going for the first time November 15\nRome, Florence & Venice. My dream vacation. 🇮🇹\nI don’t think I would ever go in the summer.\nSad, the heat is impacting peoples trip"}, {"username": "Doris Hosmer Anderson", "comment_text": "Absolutely correct. Fall is the best"}, {"username": "Patricia Turner", "comment_text": "We planned ahead and knew it was going to be hot. I wanted to walk between sights but just took more taxis and stuck to our itinerary and did everything we had planned. Yes it was hot but it’s Italy…it’s doable! Just enjoy!"}, {"username": "Marisa DePalma", "comment_text": "We heard that & went early May… cool & rainy which made for good touring weather…"}, {"username": "Madeline Caporale", "comment_text": "Due to climate change everywhere is experiencing extreme temperatures and weather events. Wildfires are rampant in western Canada and much of the US is experiencing air quality alerts. CA is now also having wildfires."}, {"username": "Jerry Lyubelsky", "comment_text": "We just returned from a 10 day trip. 1 day Milan, 2 days Rapallo, 3 days Florence, 4 days Rome. I pre booked everything we started early about 8am we’re in side hotel by 3 the latest. Rest till 7ish then dinner. We drank lots of water, hats, sunglasses, sunscreen, light clothing, prebooked all sightseeing entries. It was hot but we managed"}, {"username": "Anita Edwards", "comment_text": "I loved it as I do not mind the heat. I went in August."}, {"username": "Jos Recine", "comment_text": "Why walk from noon to 5:00pm.\nThat’s for eating then siesta.\nItalians walk after dinner way into early hours. It’s all about timing.\nTake it easy, eat,drink and relax."}, {"username": "Karen Baxter", "comment_text": "City breaks are always better in Spring & autumn"}, {"username": "Gina Rovello Keenan", "comment_text": "That's a shame it ruined your vacation! It's hot here in the US as well. Phoenix, AR is over 105 F."}, {"username": "Larry M Murray", "comment_text": "Don't come to Florida now either."}, {"username": "Jared Colwell", "comment_text": "I love the heat. Bring it on. Gelato stops 📈📈"}]}, {"id": "2194233007642444", "text": "I’m taking my parents to Rome for 3 nights at the start of August & staying in the Trastevere area! (Any good tips for this area?)\n\nWe have the colosseum booked (all morning/evening slots gone so could only get 4.40pm) and Vatican museums / Sistine chapel booked too (could only get 2.30pm)\n\nI appreciate it’s going to be VERY hot… me and my mum love the heat & we’re used to late 30’s / 40’s temperatures. However my dad isn’t good with heat and struggles with arthritis so can’t walk long distances… I want to plan as much of the trip as possible so we can factor in lots of breaks and sort out transport. In an ideal world out of the heatwave we would walk everywhere but I know he would struggle with tonnes of walking even in cooler months.. Best ways to get around yet still experience and see everything?\n\nAny suggestions on how I can please make this a trip of a lifetime despite the heatwave? We want to do as many sights as possible and experience authentic Italian food / bars etc without my dad struggling and not enjoying himself.\n\nPlus any recommendations for restaurants, bars would be highly welcome.\n\nI appreciate there are a lot of questions here but thank you so much in advance ☺️", "link": "facebook.com/groups/1373361046396315/permalink/2194233007642444/", "likes": 0, "comments": [{"username": "Scott Perry", "comment_text": "Masto in Testaccio is terrific."}]}, {"id": "2194236270975451", "text": "Curious about everybody's experience when renting cars: last time I rented a car here it was almost impossible to get an automatic - I just checked with Hertz in the small town where I live they still only have manual cars available. At the airport they seem to have a wider range, with a few automatic as well.\nAre automatic easily available now inआणखी general or do they only have them at the biggest companies?\nI thought that for drivers mainly used to the automatic gearbox in their everyday driving experience, adapting to manual might be an extra source of stress beyond the crazy traffic in Rome, Naples, etc?", "link": "facebook.com/groups/1373361046396315/permalink/2194236270975451/", "likes": 1, "comments": [{"username": "Kenneth T Williams", "comment_text": "We have both. Doesn’t matter to me. Automatic seem to be more rare in Europe"}, {"username": "Joe Guzzi", "comment_text": "We have four cars, only one is auto. Autos use more fuel, so people avoid them."}, {"username": "Bev Madill", "comment_text": "I’m Australian so driving on the other side of the road is scary enough. I’ve found I’ve had to book an automatic quite a few months ahead and I always confirm a month or so prior. Good luck."}, {"username": "Dave Conroy", "comment_text": "Auto cars are not that commonplace in Europe. You may have to make a specific request."}, {"username": "Jennifer Larese Taylor", "comment_text": "You pay a premium for an automatic because manual tends to be preferred in Europe. But I had to take driving lessons to learn how to drive a manual, so I would definitely get an automatic if you aren’t used to a manual"}, {"username": "Jona Guðmundsdottir", "comment_text": "The reason is most likely that the ones with the manual are cheaper... and yes, lots of people still think that they spend less fuel, despite it having changed, now the ones with auto transmisson spend less..."}, {"username": "Eleni Koi", "comment_text": "We never had a problem to find an automatic car since 2016. Even if we are used in gears because that is what we drive at home, we always prefer the comfort of auto when travelling around in Italy. Our pickup point is the airport we arrive at."}, {"username": "Maria Brozou", "comment_text": "In Europe most people have manual cars so companies have a majority of manual cars too."}, {"username": "Miyuki Kanno Paul", "comment_text": "Stick shift is more popular…with diesel fuel = More mileage per liter and economical. Automatic shift tends to be available for a larger and more luxury categories"}, {"username": "Giorgia Petraia", "comment_text": "If you can’t drive manual don’t experiment here, because the roads are narrow and curvy, even though I recommend you to try at least once because, if you like driving, it makes the experience much more personal and sporty"}, {"username": "Monica Colontonio Macho", "comment_text": "Sixt Car rentals had a nice selection of automatics. We went on line and reserved the automatic and when we got to Rome Termini they let us pick out the one we wanted. Because we reserved early we did get a good price and it was a hybrid so fuel mileage was good."}, {"username": "Sandra Shoffner", "comment_text": "Rent ahead of time and at the airport."}, {"username": "Karen Espinoza", "comment_text": "I got an automatic at Bari airport (Alfa Romeo and bmw) are usually automatic but a little more expensive 😵‍💫"}, {"username": "Sande Ricci", "comment_text": "We rented a car in Genoa this past May. We were very surprised that it was an automatic."}, {"username": "Nissa Nolan Foster", "comment_text": "Every time we rent an auto in Italy / France we are given a wagon. That's been the case with Avis, Hertz and LocAuto."}]}, {"id": "2194239560975122", "text": "Greece accomodation any recommendations? ☺️", "link": "facebook.com/groups/1373361046396315/permalink/2194239560975122/", "likes": 0, "comments": [{"username": "Melissa Ades", "comment_text": "Katikies Santorini\nDana villa suites"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2194239984308413", "text": "I am travelling by car from Milan to La Spezia but need to spend a night between the two - any recommendations?", "link": "facebook.com/groups/1373361046396315/permalink/2194239984308413/", "likes": 0, "comments": []}, {"id": "2194243604308051", "text": "Has anyone successfully purchased tickets for the colosseum from the official website? I’m trying to book a month in advance and it only shows todays date for availability? Am I doing something wrong", "link": "facebook.com/groups/1373361046396315/permalink/2194243604308051/", "likes": 0, "comments": [{"username": "Jacqui Coates", "comment_text": "Pls disregard have an answer now"}]}, {"id": "2194245847641160", "text": "Beware those flying to Sicily these days:", "link": "facebook.com/groups/1373361046396315/permalink/2194245847641160/", "likes": 0, "comments": []}, {"id": "2194249424307469", "text": "HI, I have more of a soccer question rather than holiday question. We will be travelling from Australia for a holiday with my husband and two sons (aged 12 and 9). I have promised my boys i would take them to watch an AC Milan home game. I want to buy these tickets as soon as possible so we don't miss out. I checked on the AC Milan website butआणखी tickets are not yet available, however they ARE available for purchase on other ticketing websites.\n\nSo my question is, are these other websites legit? Or should I only purchase from the official club website? Im keen to lock these in as I need to book our flights to Milan.", "link": "facebook.com/groups/1373361046396315/permalink/2194249424307469/", "likes": 0, "comments": []}, {"id": "2194248390974239", "text": "Hey! 🙂 do any of you know a good airbnb or hotel that is near the venice airport and not really expensive? Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2194248390974239/", "likes": 0, "comments": []}, {"id": "2194253754307036", "text": "Life Saver in the current temps!", "link": "facebook.com/groups/1373361046396315/permalink/2194253754307036/", "likes": 1, "comments": []}, {"id": "2194255477640197", "text": "Is there any online website that will let you book a combination of train and bus? We will be going from Rome Termini to Pinerolo, then bus to Bobbio Pellice. I was able to book a combination ticket as far as Torre Pellice when we went 10 years ago, but cannot find that option now.", "link": "facebook.com/groups/1373361046396315/permalink/2194255477640197/", "likes": 0, "comments": [{"username": "Michelle Casillas", "comment_text": "Try this one.\n\nhttps://\nwww.rome2rio.com\n/"}]}, {"id": "2194258777639867", "text": "We are currently in Rome, how we can reserve a Taxi to go to the airport at 6:00 am? We scared to go wait at the street and could not find a Taxi early morning.", "link": "facebook.com/groups/1373361046396315/permalink/2194258777639867/", "likes": 20, "comments": [{"username": "Andrea Helle Myers", "comment_text": "We just went to the taxi stand near the Spanish Steps, as our hotel was only a few blocks from there. There were several waiting, even at 6am."}, {"username": "Carol Taylor Tisdale", "comment_text": "Welcome Pickups"}, {"username": "Deborah Shaw", "comment_text": "Try downloading freenow app."}, {"username": "Anne Mc Namara", "comment_text": "Get an Uber."}, {"username": "Nana Tirolese", "comment_text": "Do it through your hotel. That's what we did and it worked out perfectly. 😉"}, {"username": "Paul N Marietta Dodson", "comment_text": "Just request through your hotel concierge. Ours last year picked us up at 4:30 am sharp and had us to the airport in plenty of time. We were 2 blocks off the Spanish steps. Rome that early in the morning is so different."}, {"username": "Cheri Arrowood-Stanziano", "comment_text": "We used Express Shuttle"}, {"username": "Larry Reinier", "comment_text": "We always had a private car service come to our hotel. They were setup by the Hotel"}, {"username": "Deanna Hasenstaub Shetler", "comment_text": "We used the FreeNow app and were able to schedule the taxi in advance."}, {"username": "Natalee Turpin", "comment_text": "We used www.welcomepick\nups.com in Athens and worked great. Everything is scheduled and all drivers speak English."}, {"username": "Anna Barraza", "comment_text": "Call Alessandro and book one day prior...+39 329 6583987"}, {"username": "Karen Espinoza", "comment_text": "Hotel or Rbnb manager"}, {"username": "Starla Dawn", "comment_text": "I think it's an absolute miracle I got a taxi in Travestere in 30 seconds and the en route finding out my flight departed in 2hrs 20mins and actually easily making the flight."}, {"username": "Ivette Lugo", "comment_text": "Your hotel can help"}, {"username": "Valerie Collanton", "comment_text": "As an alternative, You can book on the app “Welcome Pickups”. It’s more than a taxi but easy to book. They notify you when ride is there."}, {"username": "Lisa Pirone Kaiser", "comment_text": "We used it taxi"}, {"username": "Michele Wade", "comment_text": "My accomodation booked an early morning taxi to airport it was there waiting for us."}, {"username": "Elouise Missy", "comment_text": "We just got home from Rome and used Uber - it allowed us to book Ubers and taxi’s. No hope flagging a cab.\nFor the most part Uber was reliable. We had a few that canceled before arrival (only happened on short cheap trips when it was busy). But we’d rebook and eventually get picked up. We used an Uber van to get to the airport, it was awesome! Most Uber vans are new Mercedes 8-9 seater vans with huge luggage storage compartments in the back. All super clean and comfortable. I think you’ll be unlikely to get an airport trip canceled as it’s worth a bit of money. We didn’t book the ride in advance, just started looking at the app about 30 min before we wanted to get going."}, {"username": "Alison Dutton", "comment_text": "Our hotel booked one for us, they usually have regular taxi drivers they use all the time."}, {"username": "Sandy Michelle Duggan", "comment_text": "we had to leave for airport at 5am last week from Rome, private driver didn't show up, we booked an Uber, but saw quite a few taxis around at that time."}, {"username": "Rose Stolarek", "comment_text": "You will be gone in the street but ask your hotel yo book a cab for you"}, {"username": "Joseph Guerrero", "comment_text": "I can only speak on my experience and this was in Florence, I know that’s not Rome but we had an Uber reserved for an early morning flight and it didn’t show up 😫. Luckily my wife speaks Italian and found a phone number to call a taxi company, after 20 minutes and almost getting an ulcer she got through and we’re very luckily got a cab to show up and get us to the airport in time. We had a somewhat similar experience in Rome a week earlier but that was to catch a train and later in the morning closer to 10AM so we were to get an Uber that time. This was mid June of this year and imagine it’s much worse now. I’d highly recommend to book a service and pay whatever cost necessary to ensure you have a ride even if you must pre pay. It’s not worth saving money to possibly miss a flight and go through the stress at 6AM! Good luck 👍🏼"}, {"username": "Shari Hollander Baron", "comment_text": "Has anyone used Bellagio Taxi? We need an early morning ride from Bellagio to Malpensa. They’ve been very responsive thus far?"}, {"username": "Glenn Todd Webb", "comment_text": "Ask hotel"}, {"username": "Pat LaPointe", "comment_text": "I use habicabs…very reliable"}, {"username": "Don Bentivoglio", "comment_text": "Your hotel will be happy to book one for you"}, {"username": "Phillip Self", "comment_text": "50 bucks"}, {"username": "Nola Bostridge", "comment_text": "Book MB Tours ,\nMaurizio is awesome\n\n+39 329 9420956\nMBtours@hotmail\n.com"}, {"username": "Rosslyn Patience", "comment_text": "Find out the price beforehand. We got done in Palermo. It cost €50 to go a couple of km at 6.00 in the morning to go to the station. The hotel organised it."}, {"username": "Romina Lauretig Toscano", "comment_text": "Use the app! Ittaxi"}, {"username": "Michele Fieger Padgett", "comment_text": "I reserved in advance an Uber on my regular Uber app I use all the time. It’s Uber Black… was $45 and we were picked up in new BMW. Was delightful… and they communicated status frequently until pickup."}, {"username": "Jill Wolder", "comment_text": "Ask the concierge. He will make all the arrangements so you don’t have to worry. That is what he does."}, {"username": "Renae Larcus", "comment_text": "FreeNow app but we found one just walking out on the street in an area where taxis frequented"}, {"username": "Amy So", "comment_text": "Ask front desk of the hotel the day before."}, {"username": "David Engvall", "comment_text": "With the FREENOW app you can reserve ahead of time. We did it several times and it worked perfectly."}, {"username": "Lisa Adams Robertson", "comment_text": "If you are near the Pantheon, they are always lined up there in the morning. Our private car service canceled on us right before we were to go to the airport early in the morning (his car was broken into and window broken), so we walked over to the Pantheon and had no problem."}, {"username": "Isabel Salcedo Patterson", "comment_text": "Your hotel should be able to order it."}, {"username": "Sandi Van", "comment_text": "Free now app they use Uber too"}, {"username": "Tara Roed", "comment_text": "I asked my Airbnb host to arrange for me. It worked out well. You could also preorder Uber"}, {"username": "Marija Hoxhosmani", "comment_text": "We had to book taxi at 4:40 am to the airport and we were living outside Rome. Our host advised to use ittaxi app. Worked well, taxi arrived on time."}, {"username": "Jennifer Duffy", "comment_text": "We used Uber for an early morning flight out of Rome and had no trouble good luck !"}, {"username": "Jenny Payne", "comment_text": "Book a black Uber 🌻"}, {"username": "Blenda Johansen-Rodriguez Del Rio", "comment_text": "Schedule an Uber. I did it in December."}, {"username": "Linda Dalelio Williams", "comment_text": "I’m sorry some of these questions are alarming\nConcierge at the hotel you staying at will do that for you\nI do t mean to be disrespectful but we all need common sense to travel"}, {"username": "Wendy Harrison", "comment_text": "Our hotel arranged one for us."}, {"username": "Leanne Howard", "comment_text": "I’ve found FREENOW app great .just like Uber and have used daily"}, {"username": "Brian Osman", "comment_text": "Have your hotel make the arrangements, they will be more than happy to do so and know the right people to call."}, {"username": "Elisa Kukielski", "comment_text": "Have your hotel or AirB and B host can arrange a driver!"}, {"username": "Paula Smith Lemmon", "comment_text": "Rome in Limo- we used them for 3 days straight. Best money we spent."}, {"username": "Ann Brahmani Bost", "comment_text": "I used itTaxi app. I used it often In Rome. Very reliable. You can reserve day before. And less expensive than a transfer service."}, {"username": "Janice Schollen", "comment_text": "We are there now and the FREENOW app has worked well to order for certain times. Also watch for TAXI stands.. you can flag one from there but might take 15 min"}, {"username": "Danielle Moselle Hewitt", "comment_text": "Uber worked well for us"}, {"username": "Jill Cox", "comment_text": "Ask hotel to book you one. Cabs don’t always run that early sadly… I couldn’t get one for an early flight so had to book a car."}, {"username": "Fabio Scherillo", "comment_text": "Any taxis company will schedule a pick up\nJust call them and arrange it\nI do every time in Italia never had a problem"}, {"username": "Zeeshan Asghar", "comment_text": "Please call the reception of your hotel and they'll arrange one for you.\n\nYou can also find a list of taxi services online and book one in advance.\n\nDo not wait until the night to ask for one, because it's really busy in the morning and you might not get one."}, {"username": "Alexandra A Welker", "comment_text": "Ask your hotel to help reserve transportation or taxi"}, {"username": "Joan Leotta", "comment_text": "Ask your concierge to do it. If you are in a b ab look up a car service and reserve"}, {"username": "Keyna Combs Vialpando", "comment_text": "We ended up getting an Uber last week for early morning pickup. Definitely a little more expensive, but they were more reliable! The FREENOW app taxis were NOT very reliable for our family of 5!🤪"}, {"username": "Kerry Cofrancesco", "comment_text": "You can book a taxi on line €50 flat fee including suitcases."}, {"username": "Renee Rundle Stoneham", "comment_text": "Just have your hotel arrange the pick up in the morning. We’ve done this all over Europe."}, {"username": "Gina Rovello Keenan", "comment_text": "ask your hotel to make arrangements."}, {"username": "Leina Desaulniers Bond", "comment_text": "Either ask the hotel to call one when you are ready to leave. Or make arrangements with a professional transport service. I have used Romecabtransfer\n.com multiple times for airport pick up and departures. Mary is easy to work with and her drivers are great."}, {"username": "Carmine Castiglia Jr", "comment_text": "And, waiting at the street doesn't work. It's not like New York City where you just flag down a taxi - Italian taxis do not operate that way (they are not supposed to anyway)."}, {"username": "Lora Romo", "comment_text": "Our hotel took care of it for us. I told them the night beforehand and they made arrangements."}, {"username": "Fran Monopoli", "comment_text": "Hotel"}, {"username": "Stacy Derouin", "comment_text": "Our hotel made the arrangements the night before our flight."}, {"username": "Lyn Wise", "comment_text": "We used Freenow app prior to 6am. He was there on time"}, {"username": "Kim Geary Keidel", "comment_text": "When we arrived in Rome, we were so worried we couldn’t get two taxis very early in the morning for five people with luggage, we ended up booking a car service so we didn’t have to worry about it. It was worth the extra money for peace of mind."}, {"username": "Debbie McAuley", "comment_text": "Try CabRoma"}]}, {"id": "2194260760973002", "text": "How to make a warm day and night in Tuscany✨", "link": "facebook.com/groups/1373361046396315/permalink/2194260760973002/", "likes": 1, "comments": []}, {"id": "2194274460971632", "text": "If I have to choose between Venice and Lake Como for a day trip, what would you recommend?", "link": "facebook.com/groups/1373361046396315/permalink/2194274460971632/", "likes": 1, "comments": [{"username": "Renae Larcus", "comment_text": "From where? Both are amazing"}]}, {"id": "2194276087638136", "text": "Flying Aer Lingus from US to Italy. Their luggage sizes are quite small for international travel. Smaller than a traditional carry on. Travel agent says traditional size is fine. Anyone had experience with this? Will check bag if needed, just don't want to get bogged down in extra fees.", "link": "facebook.com/groups/1373361046396315/permalink/2194276087638136/", "likes": 0, "comments": []}, {"id": "2194284634303948", "text": "Hello, please could you recommend the best option for travelling from Cecina to Bologna AirPort? We will travel with two kids so I prefer not to change the train very often. Many thanks for any advice! ;)", "link": "facebook.com/groups/1373361046396315/permalink/2194284634303948/", "likes": 0, "comments": []}, {"id": "2194288294303582", "text": "Would like to book a villa (self contained for 4 adults) at a winery north of Florence in August, any recommendations? 4-5 star preferred", "link": "facebook.com/groups/1373361046396315/permalink/2194288294303582/", "likes": 0, "comments": []}, {"id": "2194290377636707", "text": "Hi! Wondering about Sicily/Amalfi coast! We are planning to go October 2024. Wondering about hotels/Airbnb, safety, shopping, things to do! Would be greatly appreciated!!!", "link": "facebook.com/groups/1373361046396315/permalink/2194290377636707/", "likes": 0, "comments": []}, {"id": "2194303157635429", "text": "Ciao, I see a lot of posts recommending dinner reservations for the nicer restaurants.\nLikely depends on the establishment but typically, are reservations recommended to be made a day in advance, a week in advance, or other? Getting anxious😊", "link": "facebook.com/groups/1373361046396315/permalink/2194303157635429/", "likes": 1, "comments": []}, {"id": "2194305724301839", "text": "I’m planning a 2 week trip in Italy for next summer. I know for sure we want to stay in Rome a few days but then would like to see some beaches and other places. What would be a good route?", "link": "facebook.com/groups/1373361046396315/permalink/2194305724301839/", "likes": 0, "comments": []}, {"id": "2194310757634669", "text": "Credit card question- do you need a PIN number for master credit card? I understand that debit cards do required pin- but asking about CCs? Grazie", "link": "facebook.com/groups/1373361046396315/permalink/2194310757634669/", "likes": 2, "comments": [{"username": "Ken Lerch", "comment_text": "Not for a purchase but you don’t want to use a cc at an atm because in addition to the fee it will register as a cash advance with fees and interest. Prego."}, {"username": "Susan Leddy", "comment_text": "Not for a purchase"}, {"username": "Carmine Castiglia Jr", "comment_text": "But your credit card must be a newer one with a visible \"chip\".\n\nI doubt there are many non-chipped cards remaining out there but just in case... 😃"}, {"username": "Dave Conroy", "comment_text": "Depends on your bank and where you're from. For me, with UK bank accounts and a cc using the mastercard platform, I rarely need a pin. My bank requires one randomly as a security check. Pins are issued as standard."}, {"username": "Esther Steinbok Sustersich", "comment_text": "Both my Canadian banks require it for purchases when out of country. As a protection.\nIn fact, I went to use it for the first time, when I put my card into the machine it automatically said input your pin number. I guess it couldn’t read that it was a foreign card? There was no option to say tap or input pin."}, {"username": "Joy Clift", "comment_text": "Yes. You do if the amount is over a contactless limit"}, {"username": "Joe Guzzi", "comment_text": "Yes you do."}, {"username": "Yvonne Ormson", "comment_text": "We need to use our PIN with our Canadian credit cards for purchases over $200 CAD"}, {"username": "Allison Mir", "comment_text": "Not if you use Apple Pay or google pay on your phone"}, {"username": "Jose Velez", "comment_text": "Europe issue cards use PIN number instead of signing. American issue cards do not have a PIN number The only issue I had was at self service gas station that are unattended you can not fill. Also in France some tollway will require a PIN number. For those cases I use my visa atm card which has a PIN number. CC is the way to pay in Europe"}, {"username": "Judy Jamieson Pisano", "comment_text": "In a gas station the machine always asked for a pin. Our CC doesn’t have one so we had to use our debit card for gas all the time"}, {"username": "Miyuki Kanno Paul", "comment_text": "It’s a good idea to know your PIN. I haven’t encountered the situation that I needed one for transactions. Let your CC company know ahead of time that you are going to use your card in specific foreign countries."}, {"username": "Peggy Fisher", "comment_text": "This is an amazing group for travel.. I used it for my first trip to Italy last September. What I learned is, just relax, nobody is judging your clothes, everything pretty works the same as here. Credit cards are easy and cash for small stores. I never went into any place where they didn't take credit cards. I got two hundred Euros here at the TD & D bank, they keep some on hand. Yes, I did always tip, the waiters and waitresses were so grateful. Enjoy your trip, take lots of pictures. I also bought one of those belts that goes under your shirt or pants. I always carried my passport, cards and extra cash in that. I would NEVER leave docs in a hotel. They can stop you anytime and request passport and they don't want a picture on your phone."}, {"username": "Glenn Todd Webb", "comment_text": "In some places yes."}, {"username": "Glenn Todd Webb", "comment_text": "Get a tap and pay card. No problem then."}, {"username": "Cindy Gallen Barton", "comment_text": "We needed it sometimes when buying tickets from a machine (train tickets ect) also remember to notify cc company that you will be traveling."}, {"username": "Alexandra A Welker", "comment_text": "No pin for all my CC purchases. I'm from the US I've been travelling for over 20yrs and never needed a PIN. I have Citi AA CC. But sometimes when I purchase airplane tickets at a certain amount it asks me to verify my account. If you have Android you can try to add it to your Google Wallet for tap and go (contactless)"}, {"username": "Daisy Yoo", "comment_text": "Most credit card y can put in travel notice online , no need to call , if y have quicksilver from capital one , u do not need the notification , but they do recommend to add a pin for cash withdraw -a way to protect u"}, {"username": "Jennifer Lacy", "comment_text": "I have had several machines ask for a PIN number when I use my credit card Apple Pay. Since I didn’t have a pin set up I had to use a different card."}, {"username": "Kim Hunter Groop", "comment_text": "Call your credit card company and request a pin. We did this before our trip to France. We weren’t ever asked for a pin but it was nice knowing we had one just in case."}]}, {"id": "2194311527634592", "text": "Buongiorno, I have booked a room at La Gallina Felice B&B in Metà. 1. Has anyone stayed here and could give me feedback and 2. How convenient or not is it to Sorrento? 3. Is this a good location for exploring Amalfi areas? Grazie Mille can’t wait to get there!", "link": "facebook.com/groups/1373361046396315/permalink/2194311527634592/", "likes": 0, "comments": []}, {"id": "2194318770967201", "text": "Traveling to Sicily in October. Question for those who have rented an 8 passenger van in Sicily. How difficult is navigating within towns, parking etc. Debating van vs. 2 cars. There are 7 of us. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2194318770967201/", "likes": 0, "comments": []}, {"id": "2194321414300270", "text": "I am needing to get from Gallopoli to Otranto end August. A 70 plus Australian lady travelling solo. on some websites says there r 2 direct buses a day, however I can not find more info. Private transfer very expensive.\nHave luggage so bus, train, walking in between may be a problem with heat, cobblestones.\nAlso needing to get from accom Otrantoआणखी to Monopoli.\nI know there is a bus to Lecce then a walk to train station and train to Monopoli.\nWas told there was a shuttle bus Otranto to Brindisi with Salento Shuttles for 50 euro but can't find details. From there I could get direct train.\nCan anyone please help. I normally wait till I get to area to sort out transport to next accom. However this year accomadations seems to have 4 week free cancellation policy. If it was less maybe I could change bookings round.\nAny info would really help. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2194321414300270/", "likes": 0, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2194323214300090", "text": "Any suggestions for most secure way to put AirTags in luggage and backpacks? So many choices on Amazon…", "link": "facebook.com/groups/1373361046396315/permalink/2194323214300090/", "likes": 0, "comments": []}, {"id": "2194329820966096", "text": "Hi! Has anyone been to Trento? What were your experiences like? Safety, price range, hospitality, etc. 🙂", "link": "facebook.com/groups/1373361046396315/permalink/2194329820966096/", "likes": 0, "comments": []}, {"id": "2194329870966091", "text": "Infuriating!", "link": "facebook.com/groups/1373361046396315/permalink/2194329870966091/", "likes": 0, "comments": [{"username": "Paul N Marietta Dodson", "comment_text": "Thank you for posting this. I was just starting to write myself. I hope the young girl's parents were not members of this group."}, {"username": "Joe Guzzi", "comment_text": "She is Swiss, and as a Swiss, this really disturbs me. I hope she gets a big fine, as under Swiss law even 10 year olds are criminally responsible for their actions, so she has no excuse if not mentally handicapped."}]}, {"id": "2194329994299412", "text": "Any car service recommendations from Sorrento yo Praiano?", "link": "facebook.com/groups/1373361046396315/permalink/2194329994299412/", "likes": 0, "comments": [{"username": "Kay Rendall", "comment_text": "Ask your accom. They have people they use all time, so can be more reliable and turn up. U can check prices elsewhere, but not always reliable if very busy, especially from airport, train\nIf there is a delay they will.go to next booking g."}, {"username": "Nadia Pettignano", "comment_text": "Eight Black"}, {"username": "Nadia Pettignano", "comment_text": "www.eightblack.\ncom"}, {"username": "Sandy Radican Shikaly", "comment_text": "Amalfi Coast Transfers"}, {"username": "Christine Golia Brigida", "comment_text": "Amalfidrive4you"}, {"username": "Frankie Rizzo", "comment_text": "Frankie Rizzo"}, {"username": "Anna Hayden", "comment_text": "Joe Banana"}, {"username": "Joyce Fisher Ahrens", "comment_text": "Carmine Amalfi Coast Tour"}, {"username": "Enrico Lecce", "comment_text": "Sixt"}, {"username": "S Christian Everett", "comment_text": "We used a gentleman for the day named Giovanni with a new Mercedes Van.\n\nClean , safe, and entertaining\n\nHe was much cheaper than the options from the hotel\n\n+39 331 213 7249"}, {"username": "Brad Nelsen", "comment_text": "Mydaytrip"}]}, {"id": "2194333007632444", "text": "We will be btw Rome, Amalfi, Greek cruise at 6 ports and then Barcelona . Any tips on which beaches have seaglass 🤗", "link": "facebook.com/groups/1373361046396315/permalink/2194333007632444/", "likes": 3, "comments": [{"username": "Jim-Holly Ballew", "comment_text": "We found a lot in Positano"}, {"username": "Jennifer Lankford Blakeney", "comment_text": "Which cruise are you taking? Debating on similar next summer and can’t decide which one"}, {"username": "Kelley Hargett", "comment_text": "Positano has it and there’s a great store called idee d’art that sells jewelry made from the local seaglass and will also custom make something for you"}]}, {"id": "2194313677634377", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2194313677634377/", "likes": 0, "comments": []}, {"id": "2194330800965998", "text": "Discover the everlasting beauty of Pisa and its iconic monuments and Let yourself be captivated by the architectural jewels of Pisa! Our local guide Patrizia will introduce you to the Miracle Square that isआणखी dominated by the Cathedral, a symbol of Pisan Romanesque art, not to mention the celebrated Leaning Tower and the round-shaped Baptistery, the largest in Italy, surrounded by its suggestive columned arcades. But Pisa it’s more than that… this Tuscan city has an abundance of exquisite attractions that deserve to be discovered.\nJoin us: https://nextstop-italy.com/virtual-tours/pisa-pearl-of-tuscany/\n\n#italygram #vacationmood #renaissanceart #italytravel #virtualworld #italyiloveyou #virtualtour #tuscany #tuscanytour #tuscanyitaly #tuscanyexperience #pisa #pisatower #leaningtowerofpisa #leaningtower", "link": "facebook.com/groups/1373361046396315/permalink/2194330800965998/", "likes": 4, "comments": []}, {"id": "2155710091494736", "text": "Italian Opera Concert in Santa Monaca Church\nEnjoy an evening of famous Italian opera arias in a spectacular setting during this opera concert in Florence's Santa Monaca Church. Listen to professional singers… आणखी perform selections from 'The Marriage of Figaro,' 'Tosca,' 'The Barber of Seville,' 'Madame Butterfly,' 'La Bohème' and 'La Traviata,' while you admire the setting of a 15th-century church.\nRead more about Italian Opera Concert in Santa Monaca Church - https://www.viator.com/tours/Florence/Italian-Opera-Concert-in-Santa-Monaca-Church/d519-39611P1?pid=P00070587&mcid=42383&medium=link&medium_version=selector", "link": "facebook.com/groups/1373361046396315/permalink/2155710091494736/", "likes": 3, "comments": []}, {"id": "2193954857670259", "text": "What are your favorite restaurants in Sorrento ???", "link": "facebook.com/groups/1373361046396315/permalink/2193954857670259/", "likes": 16, "comments": [{"username": "Jen Waite", "comment_text": "Master Hosts for casual and for an upscale dinner, Hotel Bellevue Syrene’s terrace - it’s stunning!"}, {"username": "Jeff Gentner EA", "comment_text": "Donna Sofia"}, {"username": "Glorimar Escudero", "comment_text": "Enjoy the little things Bistrot"}, {"username": "Ted East", "comment_text": "Sorrento Bistro"}, {"username": "Elise Wall", "comment_text": "F"}, {"username": "Valli Camilleri", "comment_text": "Where did you stay? We are going in October."}, {"username": "Ashley Martins", "comment_text": "La Cantinaccia Del Poplo"}, {"username": "Amy Snyder", "comment_text": "F"}, {"username": "Kay Rendall", "comment_text": "Ristorante Pizzeria Da Gigino. in a little side street in old town. Family owned. Small amount seating outside where we loved to sit to see world go by. Also inside and upstairs, lots large tables of locals. Eaten here year after year.\nGreat food, reasonable prices. Lunch and dinner, closed on Tuesdays. I get bus from Positano when I am there, just to have lunch."}, {"username": "Clare Boxer", "comment_text": "Cafe Latino and Il Pozzo. Both have great food, atmosphere and staff!"}, {"username": "Catherine Barnard", "comment_text": "F"}, {"username": "Krissy Dascoli-Meehan", "comment_text": "Il Buco and Bagni Delfino"}, {"username": "Dottor Peppe Insigne", "comment_text": "La tradizione vico equense❤️"}, {"username": "Charlotte Eriksen", "comment_text": "Charlotte Eriksen"}, {"username": "Jacqui Warsama", "comment_text": "Jacqui Warsama"}, {"username": "Jeff McLellan", "comment_text": "This was such an amazing setting and meal!"}, {"username": "Robin Fiederlein", "comment_text": "F"}, {"username": "Lwazi Mokoena", "comment_text": "I am exceptionally recommending Mr edric Dixon Fernandez and his team to everyone interested in Cryptocurrency investment, I assure you your startup capitals are in safe hands under his management, I am not doing this to entice anyone but to save those who are genuinely seeking investment options because I was saved also, and it worked for me. I’ve had satisfying results these past few weeks working with him\n👇👇👇👇👇\nEdric Dixon Fernandez"}, {"username": "Martina Keen", "comment_text": "Best food in Italy"}, {"username": "Maddalena Rinaldi Stankevitch", "comment_text": "Bianca Rinaldi Christina Rinaldi"}, {"username": "Emily Kelley Arrowood", "comment_text": "Ami Phillips Kelley"}, {"username": "Samantha Richardson", "comment_text": "Hi all. Family of 4 eating out, roughly how much for a middle of the road restaurant?"}, {"username": "Victor Segovia Jr.", "comment_text": "Tasso"}, {"username": "Rhonda Scarlatelli Villani", "comment_text": "Always a line but worth the we wait!"}, {"username": "Monica Saluja", "comment_text": "Hariti Saluja Sushreya Saluja"}, {"username": "Brittany Kunisch Beyers", "comment_text": "Brittany Kunisch Beyers"}, {"username": "Julianne Waatti Kulman", "comment_text": "Donna Sophia"}, {"username": "Joanne Turner", "comment_text": "Following"}, {"username": "Bonnie Burk", "comment_text": "F"}, {"username": "Franca Aquino", "comment_text": "Parrucchiano Favorita Restaurant on Corso Italia."}, {"username": "Mark Andrews", "comment_text": "Following too 🤔"}, {"username": "Marcy Weiss", "comment_text": "We absolutely loved Museo Caruso. Great food, tasting menus\n\nAlso for atmosphere O'Parrucchiano La Favorita in the lemon groves"}, {"username": "Cheryl Gorfinkle", "comment_text": "IL Buco"}, {"username": "Huong Worley", "comment_text": "Fresh and delicious seafoods, great service. We had a great time there in June and although they were packed, the owner/manager and waitress really took time to visit with you instead of just served you foods. Highly recommend! We also tried Trattoria Da Emelia next door but definitely prefer Porta Marina."}, {"username": "Nancy Brennan Carrow", "comment_text": "Tavern Allegra"}, {"username": "Cindy Gallen Barton", "comment_text": "Cindy Gallen Barton"}, {"username": "Jules Blumke", "comment_text": "Franco's pizzaria and Zi'Ntonios"}, {"username": "Melinda Meyer", "comment_text": "Following"}, {"username": "Lisa Sie Mamola", "comment_text": "We just came back three days ago from Italy. We like this place and it’s very reasonable"}, {"username": "Stephanie Evans", "comment_text": "We loved foreigners club ate there 2 days in a row! The views are just amazing"}, {"username": "Enrico Lecce", "comment_text": "Il Buco...."}, {"username": "Jen Belsito", "comment_text": "."}]}, {"id": "2193956644336747", "text": "Piggy backing off of the tattoo in Florence question. Give me your ideas for a simple (very simple) idea for a mother daughter tattoo. To commemorate our trip to Italy/Spain/France. Pictures welcome. Thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2193956644336747/", "likes": 3, "comments": [{"username": "Carla Onofrio", "comment_text": "I’ve seen some cute airplane ones"}, {"username": "Larry M Murray", "comment_text": "The three flag colors as banners and names under them."}, {"username": "Lilly Raymond", "comment_text": "My 18 year old daughter got this:\nLa vita e bella (IT): life is beautiful."}, {"username": "Lauran Cantwell", "comment_text": "A small olive branch."}, {"username": "Melissa Jane Brown", "comment_text": "My daughter got a wine glass to signify her trip"}, {"username": "Lwazi Mokoena", "comment_text": "I am exceptionally recommending Mr edric Dixon Fernandez and his team to everyone interested in Cryptocurrency investment, I assure you your startup capitals are in safe hands under his management, I am not doing this to entice anyone but to save those who are genuinely seeking investment options because I was saved also, and it worked for me. I’ve had satisfying results these past few weeks working with him\n👇👇👇👇👇\nEdric Dixon Fernandez"}, {"username": "Carla Onofrio", "comment_text": "I got la dolce vita while in Italy, and my husband got our anniversary in Roman numerals."}]}, {"id": "2193901351008943", "text": "Hoping for some help with a Pompeii tour. We only have one afternoon in Naples and hoping for a private driver/tour to take us to Pompeii for the afternoon and return to Naples. There are 4 of us. Would prefer to not do bus or train as that adds 3 hours to the journey. Thanks so much.", "link": "facebook.com/groups/1373361046396315/permalink/2193901351008943/", "likes": 5, "comments": [{"username": "Mark Andrews", "comment_text": "Hi Sonya. We got the hotel we are staying in to get us a driver and tour guide of Pompeii and Herculaneum I believe we are going to a winery on our town\nCheck with them"}, {"username": "Marcia Slivka", "comment_text": "Amalfidrive4you\n. Will arrange driver plus a guide at Pompeii"}, {"username": "Barbara Brosnan", "comment_text": "We used Joe Bananas for drivers and hired Paulo with Tours by Locals for a private tour and both were perfect. We went at 9am when they opened to beat some of the heat"}, {"username": "Enrico Lecce", "comment_text": "Search for private drivers there seeking for work..."}, {"username": "Janet Canter", "comment_text": "Has anyone used shoreexcursione\ner . com in Italy for tours. You simply meet at the cruise port and they provide all the transportation to and from and tours. I’ve used them in Cozumel and been happy with the transportation and excursion experience."}, {"username": "Janet Messanelli Bozzone", "comment_text": "I’m not sure I understand where you are traveling from. You should try to go in the morning if at all possible. The afternoon is unbearably hot. Pompeii is only about a half hour away by train."}, {"username": "Lwazi Mokoena", "comment_text": "I am exceptionally recommending Mr edric Dixon Fernandez and his team to everyone interested in Cryptocurrency investment, I assure you your startup capitals are in safe hands under his management, I am not doing this to entice anyone but to save those who are genuinely seeking investment options because I was saved also, and it worked for me. I’ve had satisfying results these past few weeks working with him\n👇👇👇👇👇\nEdric Dixon Fernandez"}, {"username": "Casanova Fernandez", "comment_text": "Each new opportunity that you come across, always try to give it a try because this might be your golden chance of making yourself good, don't have a double mind. Life is all about trying and giving yourself a chance to try something new , get in touch with\n👇👇👇👇👇\nThomas Ellsworth Sykes"}, {"username": "Paul N Marietta Dodson", "comment_text": "Check TripAdvisor. Or Viator"}, {"username": "Stacy Derouin", "comment_text": "Our TA booked these guys for us. I can't tell you how awesome our driver was!\n\nhttps://\nwww.privatedayto\nurs.com/"}]}, {"id": "2193902761008802", "text": "So if my mom is in hospital in rome and we have travel insurance, do i call now or when she is discharged? I guess i am not sure if they pay bill or reimburse or what procedure or benefit is", "link": "facebook.com/groups/1373361046396315/permalink/2193902761008802/", "likes": 4, "comments": [{"username": "Mark Andrews", "comment_text": "Usually practice is that you pay the bill then submit the bill and medical documents to the travel insurance company for reimbursement. I had a medical issue in Germany last year and had to do this. Good luck"}, {"username": "Enrico Lecce", "comment_text": "Call now always check prior any incident...."}, {"username": "Esther Steinbok Sustersich", "comment_text": "Depends. My insurance through work says pay yourself and then submit receipts when I return. Which is ridiculous. As if I have money if something big happens. My other insurance that I paid for says I must call within 24 hours if I am physically able to call. They pay everything from their end"}, {"username": "Kay Rendall", "comment_text": "Call the insurance co now, sometimes they may pay or guarantee the bill if it is for a longer stay if u have overseas assist which I take"}, {"username": "Patty Beemer", "comment_text": "Call the insurance company now to start a claim. There will be paperwork you need to get filled out by someone at the hospital, and it's virtually impossible to get that done once the patient is out of the hospital.\n\nBy the time you receive a bill from an Italian hospital (more than 6 months in my experience), you will be past the deadline to file the claim. Opening the claim now is what keeps the case open until you get the bill. (Of course, your mom's coverage may be different, but you should call now to figure out where you stand.)\n\nHopefully the insurance company has a 24-hour line to call, where you'll find helpful people to guide you through the process. Be sure to write down the name of each representative you speak with and what they said.\n\nGood luck, and I hope your mom is fine soon."}]}, {"id": "2193908674341544", "text": "Tagging along on my husband’s work trip and will be in Padova for 3 nights. Anyone have any dining/food recommendations?", "link": "facebook.com/groups/1373361046396315/permalink/2193908674341544/", "likes": 1, "comments": []}, {"id": "2193909564341455", "text": "I’m turning 50 next year and it’s my 20th wedding anniversary. I want to go to Italy with my family. (16, 13, & 12 year old children)\n\nPlanning to go in July.. any suggestions as to where to go. I would love to go all over Italy but that’s not going to happen! What should I do for 8-10 days?\nI was thinking fly to one place and then bop around? I do want to see Sicily where my Dad was born.\nI’m not a good trip planner! Need some guidance.\n\nThanks!", "link": "facebook.com/groups/1373361046396315/permalink/2193909564341455/", "likes": 12, "comments": [{"username": "Jen Belsito", "comment_text": "I turn 50 next year too!\nBut we celebrated 25 years of marriage this year (hubby turned 50 this year) and we always said we wanted to go to Italy for our 25th. Turns out our girls are coming too (20 and 17) and we are going with both sets of parents to see where my MIL is from and where our dad’s were born (side by side villages)."}, {"username": "Georgina Mcauliffe", "comment_text": "Will you cope in hot weather in the cities? Only place I would choose to go in July are the Eolian Islands - which make an excellent hot holiday as you can take numerous boat trips from Lipari to all other islands. IN to Palermo then stay around the north west maybe - Trapani, San Vito, Zingara Reserve, Favignana, Erice, Segesta, Marsala then along south coast with Agrigento (done at crack of dawn when hot?). Out of Catania via ortygia."}, {"username": "Janine Witte Winiarz", "comment_text": "We are planing to do Florence and Rome with my 17/15/11 year old."}, {"username": "Sandy Dawson", "comment_text": "First of all, can you travel in June instead of July? It may be cooler then."}, {"username": "Graham Sherlock", "comment_text": "July is way to hot to be a tourist in Italy as is August. You might not understand but day after day, night after night is totally draining."}, {"username": "Anne Brooks Easter", "comment_text": "We fly in and out of different cities which allows us to see more. The trains are fantastic. I would not drive anywhere. Maybe start in Sicily and work your way up - Amalfi Coast, Rome, Florence, Venice."}, {"username": "Laura Uribe", "comment_text": "I thought you might want to read this post"}, {"username": "Marisa DePalma", "comment_text": "Take a tour\nWe saw so much on Globus tour The Best of Italy 10-11 days.\nCould have never seen as much on our own."}, {"username": "Maurice Di Marzio", "comment_text": "July is exceptionally busy and very very hot (leaving Europe in 3 days time and all major cities we visited in Italy were unbearably hot and not enjoyable so if you can, I’d recommend Sept/Oct"}, {"username": "Helika Suvi", "comment_text": "I’ve lived in Sicily and I’d warmly recommend you April/may( good weather and clean waters), September/\nOctober( not so crowded and good temperature), anything in between complete torture"}, {"username": "Doug Burke", "comment_text": "Two or three cities. And if you want to visit Sicily, budget the whole 12 days there. We spent 12 days there and could have easily used another 3. And just visiting Taorimina is not \"visiting Sicily\"."}, {"username": "Rocchina Rachel", "comment_text": "Look into a tour group. With 5 people hotels are difficult to book or you’re booking 3 rooms. Most are 2 or 4 max. Most tour groups would be able to accommodate you"}, {"username": "Janet Lugar Miller", "comment_text": "By the look of the horrendous heat there this year in July.. maybe look at fall ?"}, {"username": "Monica Roman-Fazio", "comment_text": "We just came back family of 4. I asked each kids where they wanted to go and went from there. We were there 3 weeks ago we were able to see alot. We took the train which was great"}, {"username": "Brian Osman", "comment_text": "To hot in July!"}, {"username": "Lisa Adams Robertson", "comment_text": "Sicily is awesome, but not in July! Save it for when you can go during a more pleasant month, and plan for at least 8-12 days. It's my favorite place, so far!"}, {"username": "Kim Maresca Kilty", "comment_text": "Having just returned from there in July my first recommendation would be don’t go in July or go as early as possible. Sicily is not easy to get to it’s almost like a separate trip in itself. We flew from Naples to Sicily. I would recommend the majors first - Rome, Florence, Venice and maybe Amalfi coast if you have time. Or the lake region - Lake Como and Lake Garda are amazing but up North."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Go during a school vacation not in July, especially if you want to go to Sicily."}, {"username": "Adeline Alex Tanfara", "comment_text": "July is way to hot !"}, {"username": "Phyllis Snyder", "comment_text": "Northern Italian regions- water beauty and diversity of nature."}, {"username": "Linda Tibbles", "comment_text": "Be prepared for the heat anywhere. Many Italian cities are experiencing severe heatwave conditions this July. From Florence, the train system will take you to some key places, but will take up time in everyday in transit. Research the Italian train system first."}, {"username": "Crystal Harte", "comment_text": "My advice is to go anytime other than July or August due to heat and lack of good air conditioning. However if you go stay in a central location in the cities. Arrive in Rome spend 2.5 days, Pompeii (do a tour) 1 day, then fly from Naples to Sicily and do Sicily. If you weren’t going to Sicily I have other recommendations\n. We spent 13 days in Italy in May and it was fantastic weather 20 to 25 everyday."}, {"username": "Monica Sulkey Hayes", "comment_text": "I went mid June . Weather was great and not very crowded. July is too hot and crowded."}, {"username": "Debbie Plante", "comment_text": "I am working w a travel agent in Italy. Its( so far) the best experience. You let them know what you’re looking for and they plan everything for you. It takes all the concern of trying to plan everything yourself when you really don’t know what you’re doing.\nAll transfers, tours etc are all planned by her. I’m going in October for 21 days. I’ll let you know when I return how it all works out 🙏🏻🙏🏻."}, {"username": "Jill Powell Miller", "comment_text": "Go to Sicily for the entire trip. Go see your dads town, it will be very sentimental. Then concentrate on the surrounding region. We did this with my mother in law (who passed away shortly after) We visited her mothers hometown near Palermo and visited multiple places from Erice to Cefalu and many places in between. We rented a villa in Castellammare del Golfo that was amazing. If there is a heatwave in July you’ll appreciate being by the sea."}, {"username": "Alicia Cox", "comment_text": "Or go as soon as they get out of school - end of May/first of June prob better if fall is not an option"}, {"username": "Marita Bracun", "comment_text": "You will need a month, with so far to travel, air fares same price so stay longer, you will love it"}, {"username": "Joe Guzzi", "comment_text": "We never go in July and August except to the far north near the Swiss border."}, {"username": "Amy LaBrecque", "comment_text": "Hi there! I know planning a time to go with kids is difficult since you have to plan around a school schedule. If you can go to Sicily in mid to late June like we just did, it might be the difference between temps in the 80s, rather than the 100s. It was still hot but it was the perfect beach vacation and the nights were almost cool."}, {"username": "Louisa Feliziani", "comment_text": "Hi. Happy for your upcoming festivities. If ever you can go earlier than July would be best due to heat. I would personally suggest April. Less people and the climate is bearable. Then for your excursions - select an area. If you’re thinking about Sicily - visit everything there is to see in the cities around it. It’ll be a wonderful trip. I find people make too many plans to visit everything and spend so much time in trains etc. when there’s just so much to do in the areas they’re in. Only a suggestion and again ..,. ENJOY 😊"}, {"username": "Lisa Silverman", "comment_text": "It is unbearably hot in July and August."}, {"username": "Glenn Todd Webb", "comment_text": "2 main cities then day trips from those places."}]}, {"id": "2193910904341321", "text": "I'm hoping to go to Italy next summer/fall. Probably going by myself which is actually not an issue as I'm my own best company! Best/worst things to do alone? I'm also planning on doing some tours but not in a tour the whole time.", "link": "facebook.com/groups/1373361046396315/permalink/2193910904341321/", "likes": 1, "comments": [{"username": "Phyllis Snyder", "comment_text": "Me too!"}, {"username": "Louise Wilson", "comment_text": "Your welcome to join any of the awesome groups online of solo female travelers on facebook: \"Women Who Travel by Conde Nast Traveler\", and \"Solo in Style - Women over 50 Traveling Solo and Loving It!\" (a great group even if you aren't over 50! :)"}, {"username": "Bonnie Rodgers Henderson", "comment_text": "I like traveling solo. I get to enjoy the things I like to at my pace. I take day trips and have met some great people. I will have dinner with them if the opportunity arises."}, {"username": "Christy Geis", "comment_text": "I love the Devour Tours! I haven’t done one in Italy yet but I have in Spain and in Paris. The tours are food/drink oriented, often with some history thrown in. Check out their website, I highly recommend!"}, {"username": "Ellen Segal Tacher", "comment_text": "PM me I just\nWas\nAlone"}, {"username": "Raquel Pickering", "comment_text": "Only comment I would have is pack light as trains require you to lift your luggage to the overhead storage."}, {"username": "Kim Butler Oam", "comment_text": "I’m 65 and always travel solo, it’s easy, I just make sure I stay in secure safe accommodation and no dodgy areas, I’ve only made one accom mistake and that was in a bad area of Athens. I don’t mind eating out alone , guess I’m use to it. I love history and love doing my own thing, I’ve done tours as well but this next trip I’m waiting until I arrive and I’ll do day trips with tours sometimes. For My 6 week trip next year I will be winging it a lot, not much will be pre planned, I’ll just see where the road takes me but I do have definite places I’d like to re visit or visit for the first time. You’ll be fine solo, I will have a list of things to see and places to visit while I’m in certain areas. I’ll have some accom names to look up when I’m heading that way, I’m not going peak season so I don’t think accom will be a problem. I’m traveling light so it’s easier to move around and I can’t wait !! 😍\nWhen booking accom as a solo lady, read reviews to make sure it’s a safe place. The one time I didn’t read reviews I chose badly lol. Other than that I can’t think of any don’ts except…Just keep your bag in front of you while walking, keep strap on the inside shoulder , not roadside, don’t ever put your bag on the back of your chair or on the floor unless it’s in-front of your feet and the handle is draped over your knees. I travel with a small portable alarm. Works great so I alarm my room whenever I’m not there and cleaners know they can’t enter as I inform management. I don’t carry my passport, just a laminated copy of the pages needed. ."}, {"username": "Mary Agozzino Derrick", "comment_text": "I'll just say come in mid-September or October vs July or August unless you don't mind very temps"}, {"username": "Leonie Abbott", "comment_text": "There’s a day tour that we did. From Rome you get picked up from your room in a mini van and will take you to Pompeii and the Amalfi coast . You leave early and come back late . This tour was so worth the money to do it. Venice Is a must. When we went there it was a king tied which came into the street and there was one restaurant that you could sit with your feet in the water and eat . Very funny to see. Cinque Terri is also really nice. We will be there in about 3 days but this time we booked a cruise around Italy which gets off every day at a city to explore."}, {"username": "Donna Maree", "comment_text": "Hike some ancient trails. I did that in May and loved it! 😊"}, {"username": "Risa Mwangi", "comment_text": "I love my own accompany too...Go go gal n enjoy yourself"}, {"username": "Clara Taillole-Nardo", "comment_text": "I went to Tuscany for three months by myself... just me and my little pup and I don't speak a word of Italian"}, {"username": "Jenny Bourke", "comment_text": "Good on you"}, {"username": "Thelma Gipson", "comment_text": "If you do go to Rome, go to the small towns outside of Rome, they are beautiful and more quite. Lake Bacciano, orvieto. 1 hr away from Rome and you get out of the craziness."}, {"username": "Julie Koziol", "comment_text": "I’m going to Rome solo end of April 2024. Then I’m picking up a tour 5 days later. They are only spending 1 day in Rome. I’m Catholic, one day is not enough. Anyway this is my plan:\nHop on hop off bus\nEvening golf cart tour\nFree food tour\nFree city tour\nBorghese gallery tour\nFood tour with wine\nThe group I’m going with is doing all of the Vatican tours."}, {"username": "Peggy Fisher", "comment_text": "As you will soon find out, you are never alone in Italy... <3"}, {"username": "Joseph Ceci", "comment_text": "Spend some time in smaller cities that are not on the typical American tourist route, but close enough for day trips. For example, Prato near Firenze; Brescia near Milano; Caserta near Napoli; just a few possibilities."}, {"username": "Lwazi Mokoena", "comment_text": "I am exceptionally recommending Mr edric Dixon Fernandez and his team to everyone interested in Cryptocurrency investment, I assure you your startup capitals are in safe hands under his management, I am not doing this to entice anyone but to save those who are genuinely seeking investment options because I was saved also, and it worked for me. I’ve had satisfying results these past few weeks working with him\n👇👇👇👇👇\nEdric Dixon Fernandez"}, {"username": "Lee Sorenson", "comment_text": "Hi, looking for leads to villas to rent in or around the AmLfi coast for week or two in October 2024. Ideas, please?"}, {"username": "Joleena Pickett Louis", "comment_text": "I went to Venice, Florence, and Rome solo last year and Amalfi coast solo this year. Deciding on my solo Italy trip for next year (I’m leaning towards Sicily).\n\nI absolutely love it. I like to do a mix of solo exploring and group guided tours.\n\nSo far people have been incredibly friendly at the places I’ve been, so I’m only as alone as I want to be. ￼\n\nGenerally, when I travel solo, I like to stay in hotels with a concierge for safety reasons. Unfortunately, I could not find any hotels in Positano because I booked in January for my June trip but I ended up finding a fantastic B&B that worked well. ￼\n\nThe only downside to going solo is that you are not gonna want to travel with people in the future lol ￼"}, {"username": "Donna Brown Oliphint", "comment_text": "The Uffizi Gallery in Florence is amazing. In Rome and Florence we used Angel Tours for private tours. They were incredibly reasonable (10 years ago-$25-35) and used art and art history majors for guides. We loved them all. We are going back in September to northern Italy for wine tours and Verona and Venice. I'm planning on going to an opera in Verona at the Arena (outdoors) and can't wait! Also, seeing the Last Supper in Milan."}, {"username": "Antoine Baribal Ndt", "comment_text": "Traveling alone is the best way to meet a bunch of people and make new friends. It's actually much easier to socialize when you are alone asking your way out or needing help to figure out a restaurant menu than to be a noisy group of tourists. Getting to know locals is nice but meeting other travelers is also fun. Just spend some time in youth hostels and you will make new friends in no time, if sleeping in dorms doesn't bother you."}, {"username": "Helen Pottle", "comment_text": "I went solo for 8 nights Rome, Florence and Milan.\nLoved doing the Colosseum, museums etc on my own. Worst thing no one to chat to in the evening. I did stay in hostel though so never felt alone."}, {"username": "Sally Ann Tanasi", "comment_text": "While you’re in Rome be careful of the gypsies especially at the train station. In Rome you can get a bus tour to Assisi a beautiful peaceful town not to be missed. Don’t miss Siena and Monteriggioni sp? The walled city in Tuscany with all the towers. Try not to carry a purse keep your euros on your body under your clothes they have different types at AAA."}, {"username": "Lia Geloso", "comment_text": "There is a fb group traveling solo"}, {"username": "Debbie Vinecour Halperin", "comment_text": "Go in the spring, people are complaining that it is way too hot"}, {"username": "Christine M Machacek", "comment_text": "I’m heading solo next fall. I arrive in Rome for about 4 nts and then heading on a cruise."}, {"username": "Cynthia Giannella Sylvestri", "comment_text": "I’m planning on going this year by myself but I’m just not as happy as you. Normally, I have gone with my daughter or Mom. My Mom passed & my daughter dosent want to go. Having anxiety attacks about going. Help!"}, {"username": "Annette Giovia", "comment_text": "I went to Italy in 2017 by myself in 2017. No tours for me. Went where and when I wanted. I stayed in Santa Margherita Ligure. Walked just about everywhere. Took a train one day to Genoa where I walked on cobblestone streets.and took the bus to Rapallo. There is a ferry to Portofino, you take from Santa Margherita Ligure, that runs daily which I rode on. Went there at night too which is MAGICAL!! Walked there too, during the day on a marked trail, thru the woods!! Went to many stunning churches, on my own time. Ate alone, and enjoyed my own company. Language differences wasn't a problem. Just went here and there not really planning a specific destination. I may have missed some sights, but I plan on going again, alone, and see another part of Italy and enjoying EVERY SINGLE MINUTE OF IT!!!"}, {"username": "Eva Salas", "comment_text": "I recommend Late April or May."}, {"username": "Jana Leslie", "comment_text": "I am leaving for a solo trip on October 2nd. I will let you what I discover"}, {"username": "Kelly Warnell", "comment_text": "I am leaving for a solo trip and will land in Venice September 22nd! I have never done anything like this before. I am 56 and just needed an adventure! I hope you both have the most amazing time! Cheers to us 🍷"}, {"username": "Nicole Beaumont", "comment_text": "I went last month for 3 weeks solo. Do whatever you want and don’t worry about it. I personally find everything is great solo, although eating alone in a restaurant does take some getting use to. I too did some tours which were great. 😊"}, {"username": "Debbie Fusco", "comment_text": "I went to italy solo oct 22 and it was amazing. Book tours and what you want to do"}, {"username": "Karen Ackerly", "comment_text": "Plan a hike in Cinque Terre! Absolutely Beautiful and if you can wait and travel in Sept. The weather is beautiful and crowds are down."}, {"username": "Brian Osman", "comment_text": "I went alone, but with a tour group, I loved it because I could break off and do what ever I wanted when I wanted or hang out with a few people, it really was great 👍"}, {"username": "Jeff Brown", "comment_text": "Please be aware of the heat in Italy in the summer. If I had the choice I would go in the fall. You can’t go wrong with where yo go in Italy. Places you may not thk of going Is Lake Como and the Dolomites."}, {"username": "Valerie Collanton", "comment_text": "I have gone solo many times. I plan what I want to see (museums, churches, walking to take in the feel of the town, shopping etc) and alter that with small group activities such as cooking classes, food tours). I usually do bigger meal at lunch then get food at local markets for the evening. I have also done small group tours solo. Friends of mine have amazing tours. Check out bluone.com if you are interested in something like that."}, {"username": "Amber Evans", "comment_text": "I travel alone a lot. Take a food /walking tour or cooking class, wine tour, etc. I did a fun wine -tasting on bycicle from I bike Tuscany a couple times out of Florence. Last time I was in Italy I went to a Michelin star restaurant by myself . At first I felt weird to do it , but the waiters were nice and I ended the meal chatting with other travelers at the table next to me. I also ate at another nicer restaurant in Montepulciano that I had walked to. There was a German couple sitting beside me chatting with me and they ended up giving me a ride back to my b&b . I took a hike with a couple from the Netherlands in the Cinque Terre also. I randomly met them while standing on the hill taking a photo. We ended up having an amazing meal in the next town in this outdoor garden after our 2.5 hours hike. This is why I love traveling by myself, I could go on and on about my experiences with people I’ve met along the way. There were people jumping in the water in CT in mid -September although it was more rock beach . Southern Italy should be warm in Sept. I’ve jumped in the water in Capri in mid-Sept. I’ve been in Positano end of Oct. and it was 70 . Obviously things can vary ."}, {"username": "Katie White-Meade", "comment_text": "Don’t know how you choose to travel. Can recommend, Trafalgar. Only heard great things about, Trip a Deal. I have travelled alone and agree it can be great! Enjoy yourself."}, {"username": "Julia O'Brien Holbrook", "comment_text": "I travel to Italy alone all of the time. I can’t think of anything I wouldn’t do just bc I am alone. Even take myself on dates to rooftop bars in Rome! When you’re alone, it’s easier to get admitted to places even when considered “full.”"}, {"username": "Deborah Schroeder", "comment_text": "I went alone, first time to Italy, and it was just fine. Be prepared, you will do a lot of walking and up/downstairs with your baggage. I never found being alone an issue, got lonely a few times but every place I went I had wonderful conversations with people from all over the world. I set up as few tours as possible, but some places required them. Did a ton of research before anything to make sure I would cover as many things as I wanted to see so kept myself busy. I walked everywhere and took the trains to my next destination. Fall is a great time to go. As for best/worst to do alone, that will depend on the person. What do you do now?"}, {"username": "Linda Cassol Turner", "comment_text": "Going solo next year.mid seot to end of October. Top of my bucket. Will celebrate my 73rd bday when I land there"}, {"username": "Brian Southwell", "comment_text": "Definitely try and grab a few dinner tours, great way to meet people."}]}, {"id": "2193911031007975", "text": "We are traveling to Italy in September. Our flight lands in Rome at 6:30pm and we are heading to Tuscany the next morning by train. Should we just stay by the airport that first evening or is it worthwhile to go into Rome that night? We will be in Rome for 4 nights at the end of our trip. Any hotel recs for just the one night? Adina Fortune Staehnke", "link": "facebook.com/groups/1373361046396315/permalink/2193911031007975/", "likes": 4, "comments": [{"username": "Kate Carberry Ansart", "comment_text": "Since you have 4 nights in Rome at the end of your trip, you may want to plan to stay near the airport that first night. Your flight could be delayed, you never know. The Hilton that is connected to the airport is a great spot and then you can just take the high speed train from the airport to Florence the next day."}, {"username": "Greg Saba", "comment_text": "And, if you want a little ambiance, more hotel choices, and more dining options, Fiumicino, a short taxi ride away, has a nice walkable riverfront dining area."}, {"username": "Karen Schmidt", "comment_text": "It depends. Where does your train depart from? I would stay near there"}, {"username": "Ilaria Giorgulli", "comment_text": "Book something near Termini station and go there while is still early evening"}, {"username": "Desiree Jimenez", "comment_text": "From FCO, I usually go straight into Rome and stay near Roma Termini train station. In the morning, all I have to do is walk over and get on train to my next destination. I feel rested and not frazzled about yet another leg to travel except for one. I've done this 6 out of 7 times to Italy. It tends to work for me best.\nGood luck and best wishes!🩷"}, {"username": "Karen Espinoza", "comment_text": "The Hilton by the airport is very convenient"}, {"username": "Joan Leotta", "comment_text": "Stay at the airport Hilton"}]}, {"id": "2193918001007278", "text": "How easy is it to use public transportation in Rome? There’s not a lot of hotel options for our dates within walking distance to the top attractions. There seems to be quite a few near the Vatican though. How long does it take to get to the city center from there? Thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2193918001007278/", "likes": 1, "comments": [{"username": "Mark Andrews", "comment_text": "Just watch out for pickpocketing. Public transport like the metro and most visited tourist sites are prime locations for them\n\nhttps://\nyoutu.be/\nuIWOJmGwUKA"}, {"username": "Petra Keen", "comment_text": "We stay in the piazza Navona which is very central to all tourist attractions and it only takes approx 15-20 min max to walk to Vatican."}, {"username": "Cynthia McDonald", "comment_text": "We love public transport! We don’t do anything else. It’s about 15 minutes I think."}, {"username": "Elena Innocenti", "comment_text": "Many delay, many traffic, always full. Public transportation in Rome is a sore point."}, {"username": "Stephen Henn", "comment_text": "There are hotels not far from the Vatican that are relatively close to the Metro. We’ve stayed in the Prati area twice and found it safe. Traveled by Metro to get close to sites and then walked."}, {"username": "Julie Norris", "comment_text": "Metro is easy from there. I stayed in Prati and walked everywhere but that was in cooler weather"}, {"username": "John Layman", "comment_text": "We use the bus or the metro.get your tickets in advance( tobacco shops).Beware of gypsies at the metro stops."}, {"username": "Yvette Zavatero", "comment_text": "Almost all of the main attractions are walkable. I’ve been to Rome 5 times and have never taken public transportation other than an occasional cab. I’ve stayed at Trevi fountain, the Spanish steps, termini train station and on the far side of Borghese park. You’ll be fine near the Vatican."}, {"username": "Rosella Latini", "comment_text": "Beware pickpockets lots of them on the bus"}, {"username": "Shawna Lynn", "comment_text": "I found we were in the same boat, have you looked at Airbnb's or VRBO? We ended up finding something for our dates that is cheaper than a hotel and a better location. It also has a washer so that will help me to pack differently than staying in a hotel. Just an idea!"}, {"username": "Gena Diaco Penland", "comment_text": "We were in Rome last week and used public transport a ton!!! We got the week pass and took buses and trains all over! We stayed in the Jewish ghetto area near the Vatican. It was very easy to navigate and we felt very safe!"}, {"username": "Danilo Esse", "comment_text": "Go with electric mobility,i would say just download \"dott\"app and move with the mono..that is the best thing you can do without dying in a bus stuck in the traffic"}, {"username": "Lauren-Jade Roberts", "comment_text": "Metro works fine and there’s a stop near to Vatican which is on the line which goes to trevi fountain. Lots of buses both are very cheap €7 for full day pass"}, {"username": "Karen Schofield", "comment_text": "Easy compared to parts of the U.K."}, {"username": "Paula Gallagher", "comment_text": "I walked and Taxi when it was just too hot but mostly walked"}, {"username": "Jeff McLellan", "comment_text": "We rented an amazing apartment in Ponte it was a great location. Walked a ton and took a few cabs. Best thing in Rome is that you can grab taxis through Ubër."}, {"username": "Renee Rundle Stoneham", "comment_text": "We ended up just walking everywhere! It was April so cool weather.\nWe bought the city pass that included transport, be honestly just loved walking everywhere. Explored down side streets and wandering into so many beautiful churches."}, {"username": "Ann Hannaway", "comment_text": "We use the hop on hop off bus tours"}, {"username": "Alexandra A Welker", "comment_text": "It's super easy. I recommend getting the city pass (3,5,7 day pass) and you can access the Metro, buses and trolley."}, {"username": "Barbara Bastianini", "comment_text": "I’ve stayed near the Vatican a few times. It’s walkable to other attractions if you don’t mind walking. Maybe about 20 minutes. If you mind walking a taxi is always an option. I don’t see this location as a problem."}, {"username": "Jaci Rummel", "comment_text": "Plan on taking a bus and walking a lot. Also there is NO transportation of any kind available from Saturday noon until 10 AM Monday. NONE at any price!"}, {"username": "Rachael Richardson", "comment_text": "We are staying near the Vatican it’s walkable if you are fit to most attractions or metro is 6 stops to centre 6-10 stops for main attractions"}, {"username": "Mike Crawford", "comment_text": "Super easy.\nWe stayed in Prati, great AirB&B, within walking distance to the Vatican.\nMetro stop was across the street from our AirB&B. Took the metro to the Coliseum area.\nDid a golf cart tour in the evening and they picked us up and dropped us off at our AirB&B.\nAbout 20 to 25 minutes to get to the center."}]}, {"id": "2193919461007132", "text": "I would love recommendations for private drivers out of Sienna. We want to see some of the surrounding small towns over a couple of days. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2193919461007132/", "likes": 1, "comments": []}, {"id": "2193921774340234", "text": "Best places to eat in Rome and Naples ?", "link": "facebook.com/groups/1373361046396315/permalink/2193921774340234/", "likes": 2, "comments": [{"username": "Sandra Francano Richards", "comment_text": "At restaurants"}, {"username": "Pong Ac Ai", "comment_text": "Rome trastevere"}, {"username": "Pong Ac Ai", "comment_text": "Napoli I never been there but it should be pizzeria Michele"}, {"username": "Cynthia McDonald", "comment_text": "Naples: so many! Go to spaccanapoli which is “Naples splitter”. There you will find true Naples pizza. Go to sorbillo’s (2 hour wait but worth it!). Also hop on a hop on hop off bus and go to posilipo. Best views! Eat at elletroforno. For traditional Neapolitan food go to antichi sapori. Enjoy!"}, {"username": "Brian Osman", "comment_text": "Just wander around and find a place"}, {"username": "Enrico Lecce", "comment_text": "Every where in italy is a great place to eat .... just go and enjoy..."}]}, {"id": "2193924077673337", "text": "Could I have some clarification on where I purchase a train ticket and I’ve been told that you have to validate it what does validate mean and where do I validate it￼", "link": "facebook.com/groups/1373361046396315/permalink/2193924077673337/", "likes": 7, "comments": [{"username": "Jojo Hanna", "comment_text": "It’s a green machine on a pillar at the start of the platform, it time stamps your ticket.\nTicket machines were near entrances. In Pisa there was a validation machine on the pillar, near it."}, {"username": "Lisa O'Keefe", "comment_text": "I assume you are speaking of a simple everyday train ticket? You can book them at the train station. Either at the counter, or go to a machine. There are several when you enter. Once you have your ticket, there are either yellow boxes or green and gray boxes mounted to posts and such closer to where the trains come in. You stick your ticket in it and it stamps the date and time on the ticket so you can’t reuse it. If they ask for your ticket on the train, and it’s not stamped, you could pay a fine, since you may be re-using an already used trip."}, {"username": "Lilia Goldfarb", "comment_text": "You buy your tickets online or at the ticket counter. Not sure what you mean by validate. I got on the train and someone passed along and verified it"}, {"username": "Toni Tucci Corsanico", "comment_text": "I was wondering the same thing. Our tickets were booked through a travel agent and we have our paper copies sent via email - do we still need to validate it at the station ?"}, {"username": "Rita Levi Montalbano", "comment_text": "If your ticket has the precise time of departure, you dont need to validate them. Otherwise, if its a standard train ticket that can be use anytime, you need to validate it whit a machine that sits right before the railway. If you want to be sure, when you are on the train search for a railway controller and ask him if you are fine with your ticket.\nYou can buy ticket online or directly at the train station, it makes no difference at all in prices (buying them online is obviously quicker)"}, {"username": "Jane Wilson", "comment_text": "I have paper tickets from our bookings online with Trenitalia.\nDo we need to validate them?(they are for specific dates and time, and the paper ticker has a QR code)..\nany help appreciated."}, {"username": "Manuela Bonazzi", "comment_text": "Se hai un treno ad alta velocità,quindi\nItalo o Frecciarossa,no\nn serve convalidare il biglietto anzi puoi anche non stamparlo."}, {"username": "Yvonne Lo", "comment_text": "https://\nwww.italiarail.c\nom/\nbooking-basics/\nwhat-does-it-mea\nn-validate-rail\n-ticket-or-rail\n-pass"}, {"username": "Paula Ravinski Galle", "comment_text": "Thank you for the rail pass information."}, {"username": "Rachael Richardson", "comment_text": "If you book online and have a bar or QR code you don’t have to validate , if you buy a paper ticket at the station you either go through the barrier and validate ticket in the barrier or place it in a machine on the platform or on the bus, it’s easier than you think !"}, {"username": "Rachael Richardson", "comment_text": "Local trains you buy at the station in advance or on the day , really cheap , but you then validate through barrier or on platform"}, {"username": "Renee Rundle Stoneham", "comment_text": "Easiest way to buy them online. Use the apps or website.\nTrenitalia, italo or Italiarail\nTickets can be put into your Apple wallet etc…\n\nTickets bought online do not need validation."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2193930761006002", "text": "Hi all will be in Rome 7/25-8/2 for a week and my son turns 18 that week.\n\nNo excursions planned that day so any ideas would be welcome. He wanted to go to Milan as he’s an AC M fan but that’s a bit far. Looking Rome or possibly Naples. Any ideas are welcome. Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2193930761006002/", "likes": 0, "comments": [{"username": "Glenn Todd Webb", "comment_text": "Milan to Naples fast train only 4 hours. So Rome to Milan would be about 1/2 that. Naples won the Italian championship this year. We were there. Big celebration"}, {"username": "Giovanni Pianigiani", "comment_text": "unlikely to find anything to see related to ACM that week: they aree all in the US those days https://\nwww.soccerchampi\nonstour.com/en/"}, {"username": "Michelle Miller", "comment_text": "Pompeii and Sorrento are good day trips from Rome and there are a lot of guided tours that let you hit both in a day. Florence is also an easy place to get to from Rome and I may be biased but it’s my favorite 😊"}]}, {"id": "2193931537672591", "text": "Hello... Places to RENT a car for 1 day in Florence?\nRecommendation of trusted companies and locations pls.\nHas anyone rented a car to do the Tuscany tours on their own? Best Towns to go?\nThank you", "link": "facebook.com/groups/1373361046396315/permalink/2193931537672591/", "likes": 0, "comments": [{"username": "Rita Levi Montalbano", "comment_text": "Siena, firenze, pisa, massa carrara, arezzo, isola d'elba (need a ferry from piombino), chianti, montepulciano..\n.you are spoiled for choices"}]}, {"id": "2193931944339217", "text": "We are on Capri for one day and didn’t want to have a formal/proper tour so we’re planning on just making our way around. What are some must see places? Searched the group but didn’t find any posts on this. We are going to be based out of Marina Grande.", "link": "facebook.com/groups/1373361046396315/permalink/2193931944339217/", "likes": 2, "comments": [{"username": "Greg Saba", "comment_text": "If it's not too busy, make your way over to Anacapri, where there is a chairlift up Monte Solaro. The best views on the island await."}, {"username": "Miyuki Kanno Paul", "comment_text": "When are you visiting Capri?"}, {"username": "Nicole Smith", "comment_text": "Following"}, {"username": "Kay Rendall", "comment_text": "I can take a bus to AnaCapri walk to right from ferry. Or share an open top convertible if very busy. Lovely village, great for lunch. If u ask bus will drop u at bus station. Where u can pick up bus to Blue Grotto. Walk down a lot of stairs, a boat will pick u up and row u into blue Grotto. Same price to visit pay in cash. But u don't have to do boat trip, tour to get there\nCheck with bus driver if open. Closed some times year, because high seas.\nAlso look for the small church in AnaCapri that has the story of Adam and Eve in mosiacs on the floor. U have to climb up some stairs to see it.\nEnjoy. Stayed 5 days in Ana Capri and have visited many times just for the day."}, {"username": "Steve Grossman", "comment_text": "Lunch at the hotel villa brunella."}, {"username": "Meghan Konopka", "comment_text": "Definitely visit AnaCapri, great restaurants and some shopping! I’m Capri town, make your way down to Giardini di Augusto. Gorgeous gardens, great view of the Faraglioni too"}, {"username": "Sigrid Cormier", "comment_text": "There is a beautiful garden up top, with gorgeous views."}, {"username": "Tracy Wrinn Mcdermott", "comment_text": "The chairlift in Anacapri and the Church San Michele for the tile floor. It’s amazing. Climb the stairs to see it from above."}, {"username": "Gayle Moores", "comment_text": "Take the bus or funicular from Marina Grande to Anacapri. The funicular runs every 15 mins.costs$2.40\neuros a person.The trip up is only 4 mins.In Anacapri is the Church of San Michele with it’s 15th century ceramic floor with pastoral scenes including Adam and Eve.Then visit the Villa San Michele built by a Swedish doctor Axel Munthe. Beautiful landscaped gardens and scenic views.\nTake the bus down to the centre (Capri town)A short 5 min. walk from Capri town there is Augustus gardens.Head towards Certosa di San Giacomo(monaste\nry)and turn right. Walk along the pretty path until you reach the entrance to gardens at end.Beautiful views of the water and gardens from there.Capri town is filled with shops and restaurants. A lovely walk!"}, {"username": "Renae Larcus", "comment_text": "Go to Anacapri and take the chairlift. Fun and beautiful views."}, {"username": "Vicki Susie Naab Gandolf", "comment_text": "Take the chair lift up for sure. We also took the boat trip around the island. There is a garden at the end of the main road that is very pretty. We didn’t swim, but the walk to the beach looked prettylongftomo\nur view in the garden. I’m sure others know more about that."}, {"username": "Anna Buchan", "comment_text": "You can take a bus that will bring you up to the upper village.you can also take a chairlift even higher"}, {"username": "Marina Chester", "comment_text": "Marina Piccolo is the best beach"}, {"username": "Jayne Dawson Meyer", "comment_text": "Anacapri. Beautiful town. Take the chair lift. Beautiful scenery."}, {"username": "Theresa Sorrentino Pagan", "comment_text": "We are doing the same thing in sept, looking for a good swimming spot. We don’t want to do a tour"}, {"username": "Joanie Corneil", "comment_text": "Anna Capri a must"}, {"username": "Carmen Zervigon Everett", "comment_text": "Blue Grotto"}, {"username": "Patti Warren", "comment_text": "Go to the Giardini di Augusto and walk down the path that leads to the other side of Capri. You will come upon Bagni International Restaurant and Beach Club. We rented a sunbed for the afternoon and it was our favorite part. There are taxis right near the restaurant to take you back to Marine grande."}, {"username": "Victoria Grierson", "comment_text": "Could anyone tell me if we have to pre book the Monte Solaro chair lift please . Tried to go on there website . Doesn't appear to be working ? We travel to Capri next week thanks"}]}, {"id": "2193947984337613", "text": "Hi friends….. I have a great concern about train and plane strikes in Italy on my month long trip to Italy this August…. if any of the numerous train reservations that I’ve already made are canceled due to strikes, which seems very possible, my concern is that it will be a domino effect on the hotels and tours that I have booked in the next city on my itinerary… I’ve looked into Travel Insurance with Allianz, but they only cover $200 a day for trip delays over five hours and I’m not sure about trip interruption as that seems to be a Grey area with most insurance companies… I would lose substantially more than 200 a day as I’ve booked expensive hotels and tours that we would miss due to rail strikes… Can anyone offer me some advice on either better delay Travel Insurance or what the possibility is of train strikes causing a 24 hour delay or more?… I understand that there are alternate means of transportation, such as rental cars and taxis and such but they would add a substantial amount of money that the insurance companies may not cover… Perhaps someone here is had experience and could offer some advice which would be greatly appreciated… Thank you in advance for your kindness", "link": "facebook.com/groups/1373361046396315/permalink/2193947984337613/", "likes": 9, "comments": [{"username": "Mike Guluk", "comment_text": "Google strike dates they are announced weeks in advance, they are not last minute"}, {"username": "Mike Guluk", "comment_text": "And all airlines will change your flights if there is an announced strike these strikes are common but easy to work around"}, {"username": "Cynthia Marie", "comment_text": "I purchase travel insurance with Allianz. I insure the entire trip, 4-6 weeks. If there’s any hiccups throughout the trip I am covered ."}, {"username": "Jennifer Rand", "comment_text": "When we were involved in a strike it was for trains between 9:01am-4:59 pm. Our train was affected, we got on the next train, went one stop, got on the next train to the other Florence station and then another to go to SM Novella station. Delays, but we still got there on the train with no additional charges. It was an adventure and we helped out fellow travelers as well."}, {"username": "Annette Mayer", "comment_text": "My advise would be since you can't control what happens you need to take a deep breath and go with the flow. Call Alianz and ask your specific questions to them. They have always been helpful."}, {"username": "Marcus Hiesler", "comment_text": "We decided to drive everywhere. Whilst we are there in August. We may use somethings for little trips."}, {"username": "Rosella Latini", "comment_text": "Take the bus instead, I’ve been going to Italy for 30 years someone is always on strike. It’s not a new thing."}, {"username": "Laura Uribe", "comment_text": "Most strikes do not last the full day nor do they affect every train. They may only be 4-8 hours. Just take the next available train, a bus, a cab, or a private driver. We have traveled in Italy for years and very seldom are the strikes more than a momentary inconvenience. Take a deep breath."}, {"username": "Jude Allen", "comment_text": "It really will depend where you are travelling on the strike day. Some trains are guaranteed between certain hours (usually commuter hours). Not all train companies will be on strike on the same day so some trains will still run but sometimes will disruption. In the recent strike our train was only delayed by 20 minutes"}, {"username": "Rita Levi Montalbano", "comment_text": "Even with a train strike, you will never lose 24 hrs. If that day there will be a strike, some of the trains will surely be confirmed e guaranteed anyways to allow people (especially workers) to use them in specific daytimes"}, {"username": "Rosslyn Patience", "comment_text": "There was a train strike when I was there in 2017 and in Paris in 2014.They might just run fewer trains and alter the timetable. That's what happened to me. I am fearful of our forthcoming trip to the UK with all the strikes."}, {"username": "Graham Sherlock", "comment_text": "Go with the flow, the chances are you will be absolutely fine, you need to be flexible and agile and think on your feet when travelling"}, {"username": "Linda Johnson", "comment_text": "https://\nwww.sevencorners\n.com/purchase#/\nwho-is-traveling\nTry this one"}, {"username": "Νανά Κομσή", "comment_text": "I dont think that there will be strikes on August. Everyone is on vacation including Italians. That is my persomal belief of course but i guess it is the same like my country which is Greece."}, {"username": "Chris Tina", "comment_text": "I will get your international permit license in advance ￼just in case you decide to purchase a car as a last resort. ￼"}, {"username": "Jenny Payne", "comment_text": "Look up the web page that tells you when strikes are happening 🌻"}, {"username": "Jennifer Rand", "comment_text": "On train travel days, it pays to travel early, before 9am. Also, try not to schedule so tightly your next activity. I don’t really schedule tours etc on travel days."}, {"username": "Linda Boardman", "comment_text": "It’s not good is it. You plan A and find A may not work. Try to plan B just in case. Your in a foreign country. Don’t know much of the language but they are pretty helpful on the trains especially when things go wrong. I know you have tours booked and yes there will be a domino effect and “going with the flow” is not that easy in a foreign country and it can cost you hundreds extra but unfortunately there is not much you can do. You either look at buses or hiring a car for plan B or maybe you could change dates for your tours so you have free travel days in between tours. Good luck. We did not risk it. We bought a car in the UK and drove through Italy. We will sell the car back in the UK and get most of our money back."}, {"username": "Lauren-Jade Roberts", "comment_text": "On the train strike days they still run a number of guaranteed services, Trenitalia - 6am-9am and 6pm-9pm, italo a few throughout the day, you can check the guaranteed trains on italo website after a strike has been called. We booked a guaranteed train from Italo on the day which was slightly more expensive than the one we pre-booked and have then claimed a refund for our cancelled one. The strikes are announced in advance"}, {"username": "Cat Furness", "comment_text": "Check the Trenìt! app it shows the upcoming strikes, so far none for August!!"}, {"username": "Najeana R. Crandall", "comment_text": "I don't have info about the strikes but if you don't already know, August is the month most Italians go on vacation so throughout the month of August some shops and stores may be closed while you're there. Keep that in mind."}, {"username": "Rachael Richardson", "comment_text": "We encountered a train strike 13/7 but luckily this group warned me in advance , I booked a hire car - no problems , train refunded.\nLook at the scheduled strikes they tell you in advance\nEuropcar were great, one way drop off Florence to sorrento"}]}, {"id": "2193948697670875", "text": "Is Monterosso a nice place to visit? Food and beach. 😀", "link": "facebook.com/groups/1373361046396315/permalink/2193948697670875/", "likes": 3, "comments": [{"username": "Jenny Barr", "comment_text": "Absolutely! It has a lovely beach and great restaurants and shops. I stay in Monterosso for the beach and it’s so easy to catch a train to nearby villages or take the ferry."}, {"username": "Maria LoSurdo", "comment_text": "Yes it’s beautiful! I stayed there for one week years ago and visited the other towns by boat. Lovely restaurants shops, town and beach. 🇮🇹❤️😊"}, {"username": "Lilly Raymond", "comment_text": "Beautiful! We went swimming there. Water gorgeous blue but bring water shoes as beaches are rocky."}, {"username": "Filomena Lemme", "comment_text": "Yes, it is the Cinque Terre town with the best beach. I stated there in April as my base and purchased the train pass to visit the other towns."}, {"username": "Greg Erikson", "comment_text": "Thats where we stayed. Bigger town with more to do later in the evening. Only one of the five (Cinque Terre) with an actual beach…"}, {"username": "Greg Erikson", "comment_text": "Greg Erikson"}]}, {"id": "2193949247670820", "text": "Anyone in this group know anything about renting apartments in Pisa? My son is moving there in a few weeks time and we don't know the best place to start looking? Any help would be greatly appreciated", "link": "facebook.com/groups/1373361046396315/permalink/2193949247670820/", "likes": 0, "comments": [{"username": "Rita Levi Montalbano", "comment_text": "Long time rent?"}]}, {"id": "2193898451009233", "text": "My wife and I have been to Italy twice (Rome, Florence, CT, Venice). We are looking at going back to visit the Northern region (Milan, Lk Como, Genova). We’ve been pretty lucky so far on guessing where to stay (neighborhoods) and hotel selections (we shoot for smaller 3 star hotels).\n\nI’m at a bit of a loss trying to figure out what\nArea to stayआणखी in Milan. We plan to day trip to Varenna and ferry around the lake so I’m thinking near one of the train stations but I’ve seen a number of dodgy reviews. I’m okay being further from the train station(s) if there is a connecting Metro nearby.\n\nThanks in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2193898451009233/", "likes": 7, "comments": [{"username": "Cynthia McDonald", "comment_text": "We’ve stayed in Milan tons!! Near the train station is fine. Public transport is great so you could stay instead near the canal area and hop on a subway when you want to get to the train station. We stayed this last time at hotel 43 because it’s so close to the train station, and art hotel navigli at the canal area. Highly recommend. We also stayed at hotel tocq near the duomo. All were nice."}, {"username": "Annalisa Francesca Gianna", "comment_text": "Navigli is a wonderful area to stay. This last time we stayed at the Sheraton San Siro. Bus stop is less than a minute away on foot which drops at the metro in front of stadium. Metro and bus are now \"ticketless\". Meaning if you get on the bus first, tap/swipe your credit card. That card acts as your ticket. It's good for 90 mins. Within those 90 mins, if you get on the metro tap/swipe that same card. It's all connected, so it reads that you're within your time, and the gate opens. Very easy vs smaller towns like mine where you have to still go to the tabaccheria to buy tickets.\n\nAlso, download citymapper app. Will give you all your options to your destination (bus, metro, taxi, etc) and The time/cost difference. When on the bus and metro it will show you all the stops along the way so you don't miss where you need to get off. Very convenient in Milano."}, {"username": "Greg Saba", "comment_text": "Lake Como needs more than a day trip from Milan if you can work that in. You can stay in Varenna with easy access to ferries and visit Bellagio, Menaggio, some of the lake villas, Como and more. And, there are many decent hotels near the train station and a wonderful market-style food court dining area on the left side (looking at front of Milano Centrale). We enjoyed a couple of casual, quality meals there last January."}, {"username": "Miyuki Kanno Paul", "comment_text": "A hotel near Milano Centrale is so convenient that we keep booking there over and over again. The day we arrive in /fly out, roll out our suitcases for a block or two."}, {"username": "Jan Shelton Koprivnik", "comment_text": "Unahotels Galles Milano\nWe are staying here in October. Near Duomo. Anyone know this spot?"}, {"username": "Beth Spiehler Selvia", "comment_text": "We stayed in Tremezzo on Como at Hotel Villa Marie. It’s an easy ferry to Bellagio for shopping and eating. Enjoy!"}, {"username": "Holly Gregg", "comment_text": "Following. My husband and I are also planning a trip to northern region of Italy next fall and usually also prefer smaller quaint 3 star hotels. Looking forward to the comments on here. 😁👍"}, {"username": "Laura Uribe", "comment_text": "Personally I would stay in Varenna or Bellagio and day trip to Milan. Milan can be done in a day and Lake Como is a beautiful place!"}, {"username": "Kira Sama", "comment_text": "Hi guys how are you?\nI want to volunteer in Italy in farms or schools to teach Arabic or English. Please who can help me"}, {"username": "Renae Larcus", "comment_text": "Hotel Berna near the train station was a good choice for us. A 25 min walk to the Duomo but 5 min walk to the train station"}, {"username": "Ann Lombardi-Perkins", "comment_text": "We stayed with the Spice Hotel Milano. Very close to Milano Centrale, nice room,\nnice staff."}, {"username": "Nancy Lewis", "comment_text": "A day trip to Varenna is not enough!"}, {"username": "Noreen Booth", "comment_text": "We loved Hotel Berna, great breakfast, staff and location"}, {"username": "Liz Ariar", "comment_text": "We stayed at hotel Florence, quite nice small hotel and not expensive (November 2022). Bus stop in the corner but walkable to the train station, Doumo and shopping areas. We love and enjoy walking so we only took the bus on our last day going to the train station."}, {"username": "Lisa Scott", "comment_text": "Numa hotel is an easy walk to the Duomo, Sforza Castle and the station and very reasonably priced. Lovely restaurant a few doors up towards Sforza Castle for Risotto Milanese"}, {"username": "Beverley Milson", "comment_text": "Varenna has a train station & lots of ferries to take you round Lake Como.\nComo also worth considering as a base."}, {"username": "Alex Kovacs", "comment_text": "If you decide to stay on lake como… hotel Garni Corona in Menaggio was great!"}, {"username": "Lynn Haldane", "comment_text": "Sonder Missori in Milan perfect location nice hotel"}, {"username": "Krissy DaRusso", "comment_text": "I stayed at the B&B Hotel in Milan and liked it. It’s affordable and walking distance to train station."}, {"username": "Frank Gliozzi", "comment_text": "Hotel Flora is a good option, 5 minute walk from the train station with a Metro station nearby. We stayed there last October for 4 days and incorporated a day trip to Bellagio."}, {"username": "Grazia Maria Giordano", "comment_text": "In Milan I’d suggest NHnow hotel in via Tortona. In one of the trendy areas in town. Many places also for aperitivo or lunch/dinner. Navigli is lovely and lively. If you like lively and trendy also the area around Brera/ Garibaldi/ corso Como are perfect."}, {"username": "Renee Rundle Stoneham", "comment_text": "Stay near the Duomo.\nSo many great things are nearby etc for walking. You won’t regret it. We were about a 5 min walk from the Duomo, so many great restaurants and cafe nearby.\n\nTaxis are pretty inexpensive, we walked from the train station to our hotel… it was June and hot! Took about 45 minutes. I would opt for a taxi.\n\nI would definitely stay at least 2 nights at Lake Como. We stayed 3 in Varenna and used the ferry to get around. We loved Varenna. Direct train to/from Milan."}, {"username": "Iris Joan Price", "comment_text": "I stayed for a night by myself in Milan near the train station when a friend I was supposed to meet in Como was delayed by a canceled flight. It was a lovely hotel called Hotel Berna. I paid about $100 for the single room plus taxes. I was also worried it would be dodgy but it was very nice and they even stored my luggage after check out the next day as I traipsed about Milan until I was able to leave for Como in the afternoon. There was even a decent ristorante next door."}]}, {"id": "2193892454343166", "text": "Hi all! Looking for info on tour guides for Italy - maybe even one to plan the whole event for our parents including driver and hotels. Anyone used someone like this before? Thanks in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2193892454343166/", "likes": 0, "comments": [{"username": "Roberta Cella", "comment_text": "hi yes I had a private driver from Rome airport to Naples hotel , we booked a private tour in Rome and all around Naples, Ischia ,Amalfi and Sorrento ,our driver made everything more easier for us to get there ,his name is Marco he got his own family company called Manica Viaggi I highly recommend him ."}]}, {"id": "2193892074343204", "text": "Who has recommendations for Tuscany in October?\n\nWe're there for a week, with a car, primarily based near Lucca but happy to travel by train too - what are your must see and must do please? ☺️\n\nAlso if anyone has stayed in the James Villa called Villa Gian I'd love to hear your thoughts, we've just booked it but worried we've made the wrong choice 😅", "link": "facebook.com/groups/1373361046396315/permalink/2193892074343204/", "likes": 1, "comments": [{"username": "Scott Perry", "comment_text": "Montecatini Alto is a gem of a hill town. It’s about half an hour east of Lucca by train. Pietrasanta, north of Viareggio, is another glorious spot."}]}, {"id": "2193889261010152", "text": "Hi.\nWe are planning going to Florence 27th Dec for a couple of nights, following that Venice for 3 nights to celebrate new year there.\nHas anyone got any tips or suggestions please. Has anyone done a similar trip over the new year period. Thank you in advance 😀", "link": "facebook.com/groups/1373361046396315/permalink/2193889261010152/", "likes": 0, "comments": []}, {"id": "2193884541010624", "text": "We will be staying in Rome with a study tour, but will have a free day to do and go wherever. Any suggestions for outside of Rome?", "link": "facebook.com/groups/1373361046396315/permalink/2193884541010624/", "likes": 2, "comments": []}, {"id": "2193884424343969", "text": "Is a day trip to Pompeii from Rome possible?", "link": "facebook.com/groups/1373361046396315/permalink/2193884424343969/", "likes": 9, "comments": [{"username": "Diane Plott Miller", "comment_text": "Easily done"}, {"username": "Bob Anderson", "comment_text": "Absolutely. However, we were on guided trips both times with Perillo and Globus . Had two different local tour guides and I have to say the guide makes all the difference. The second one was so much more knowledgeable and pointed out so many more things to us. Saw many different things too. Tip: Wear comfortable shoes and have a water bottle handy. There are fountains that you can refill at. A hat also helps. Have fun."}, {"username": "John Green", "comment_text": "We booked a tour through get your guide, pompei and mount vesuvius"}, {"username": "Ildiko Gyimesi Mikos", "comment_text": "Yes, possible, but will be a long day."}, {"username": "Martin L. Epperly", "comment_text": "No"}, {"username": "Benita Long", "comment_text": "Yes 💯"}, {"username": "Lynn Francisco Casella", "comment_text": "From Naples"}, {"username": "Robert Bélair", "comment_text": "Why not go to Ostia Antica. The ancient port of Rome. It’s a well worth day trip and 40 minutes away by train.\n\nhttp://\nostia-antica.org\n/"}, {"username": "S Christian Everett", "comment_text": "Doable\n\nI have a private driver with new Mercedes van if you’d like his info.\n\nSafe , entertaining and courteous"}, {"username": "Jose Velez", "comment_text": "Yes but prepare for hot day with the heat wave"}, {"username": "Mary Ann Meyer", "comment_text": "yes. we stayed in Rome and had a tour of Pompeii, including lunch and shopping in one day"}, {"username": "Enrico Lecce", "comment_text": "Well it's about a 5 hour drive... without stopping... Pompeii is not ment for a day visit... please respect it's history and appreciation...\n."}, {"username": "Ed Wren", "comment_text": "Possible but not recommended. Just too far away."}, {"username": "Dottor Peppe Insigne", "comment_text": "Devi prendere uno dei primi treni (Frecciarossa o italo) da roma per Napoli che in un'ora ti portano nel capoluogo campano e dopo prendere la circumvesuviana\nper Sorrento e scendere a Pompei. Se per te non è un problema alzarti presto la mattina è ok,ma sappi che di questi tempi fa caldo,il sole picchia forte e gli scavi di Pompei sono senza coperture😥"}, {"username": "Cory Harrison", "comment_text": "We did a Pompeii and Almalfi coast day trip from Rome. Long day but totally worth it! It was with the company “Walks” highly recommend!"}, {"username": "Deborah Liddle", "comment_text": "Absolutely! We did this back in April and booked a tour via LivTours. We booked an early morning train from Rome Termini to Pompeii train station (changing at Napoli station and also be mindful that there are two stations in Pompeii) and then return train around 4pm which got us back to Rome Termini around 6.30/7pm I think it was.\nOur train out was slower but that was because the timings were the best fit for the tour that we had booked. Coming home we took the fast train."}, {"username": "Jayne Dawson Meyer", "comment_text": "Jayne Dawson Meyer"}, {"username": "Nicole Beaumont", "comment_text": "Yes! I did a tour from Rome and also did Vesuvius in the same day."}, {"username": "Rachel Bradfield", "comment_text": "Yep I did it pompeii & Mt Vesuvius"}, {"username": "Alessandra de Luca", "comment_text": "https://\nwww.romatoday.it\n/attualita/\ninaugurazione-tr\neno-diretto-rom\na-pompei-16-lug\nlio-2023.html\n\nYes, there is a direct train every third Sunday of the month."}, {"username": "Roberta Cella", "comment_text": "hi yes I had a private driver from Rome airport to Naples hotel , we booked a private tour in Rome and all around Naples, Ischia ,Amalfi and Sorrento ,our driver made everything more easier for us to get there ,his name is Marco he got his own family company called Manica Viaggi I highly recommend him ."}, {"username": "Carolyn Esposito", "comment_text": "Yes we did train to Naples then a bus to Pompeii where we just had to walk up a hill to the entrance to meet our tour group. The agent at the train station did it for us. Going back yo Rome we walked to the train station in Pompeii then went south to Salerno the caught train direct to Rome. Long day but so worth it."}, {"username": "Vanessa Caretti", "comment_text": "￼yes, absolutely. We have driven from Rome to Pompei and back numerous years. We left about 7am. There is lots of parking and tourist restaurants outside the grounds. We had an early lunch then went inside. It’s good to plan what you what to see inside as it’s so big and you could just get happily lost which in this heat wouldn’t be so much fun. There is a cafe inside so you can refuel. It’s such an amazing place but take a hat/ sun shade/ fan and plenty of fluids.\nThere is also a smaller, better preserved site nearby if you didn’t know - Herculaneum x"}, {"username": "Jerry Lyubelsky", "comment_text": "We try ed to book that but it would have been a 13 hour round trip deal. We went to Ostia Antica which was about 40 min west by local train. So easy and still a great trips. Let me know If you want more information"}, {"username": "Isabella DeAngelis", "comment_text": "Kind of"}, {"username": "Sigrid Cormier", "comment_text": "Google day tours to Pompeii from Rome. They will all be pretty much the same and $. But they get you there and back. No transferring of trains etc. Bring an umbrella for shade, good shoes and water and a small snack."}, {"username": "Amy Hanson Garrity", "comment_text": "Absolutely! We did it by train and it was great!!"}, {"username": "Tracy Young", "comment_text": "Check out Viator. We took a day trip tour to Pompeii, Amalfi coast drive, short visit with lunch and sightseeing to Positano. It was a long 12 hr day, but a nice side day trip from Rome. I was glad that I didn’t drive. We had been a week in Rome and wanted a Saturday tour outside of the city."}, {"username": "Tatiana Goutman", "comment_text": "Starting June 18, 2023, there will be a direct train from Rome to Pompei on the third Sunday of every month. It will leave Roma Termini at 8:53am and arrive in Pompei at 10:40am. This service will be a high-speed service run by Trenitalia, so you'll be traveling on a Frecciarossa train."}, {"username": "Jenny Breier", "comment_text": "Best site to book train tickets to Naples then Naples to Pompeii? I’m so overwhelmed with how to get there from Rome!"}, {"username": "Ettore de Vita", "comment_text": "It’s doable, but you won’t enjoy it, not enough time and to much to drive back and forth"}, {"username": "Annamaria Line", "comment_text": "Se viaggi con l'auto,si"}, {"username": "Sydnie Marie Granger", "comment_text": "It makes for a long day and it depends on what all you want to do. If I remember correctly we did a day trip and like I said it was long and we only spent a couple hours in Pompeii."}, {"username": "Mechelle Huff", "comment_text": "Totally doable. Don't miss the opportunity. It is amazing. Long day is all."}, {"username": "Charlotte Ellison Weir", "comment_text": "Yes! We did it last summer. We took the train down and had a fantastic tour and then trained back. Definitely a full day."}, {"username": "Annie Gerke", "comment_text": "Yes"}, {"username": "Brian Osman", "comment_text": "Leave early come back late, enjoy the day and you will sleep great 👍"}, {"username": "Robýn Kretsçhmər Schuchårdt", "comment_text": "We would be taking trains, if that makes a difference."}, {"username": "Lester Smith", "comment_text": "If you take the rapido it will cut the travel Time down that's normally about a 4 hour ride station to station Rome to Naples."}]}, {"id": "2193883164344095", "text": "Is there a beautiful vineyard to visit near Florence ? I would like to spend the day.", "link": "facebook.com/groups/1373361046396315/permalink/2193883164344095/", "likes": 1, "comments": [{"username": "Kate Carberry Ansart", "comment_text": "We visited Casa Emma Winery in the Chianti region while we were in Florence. It was beautiful. We got a tour of the wine cellar, had lunch and did a wine tasting on their patio overlooking the vineyards. It was wonderful!"}, {"username": "Andrew Wilson", "comment_text": "When checking Vineyards in Florence Chianti region, make sure they do a lunch not just cheese and cold meats , also make sure they are happy for you to stay looking round the property, as some vineyards have timed tours of 3 hours etc. Contract the vineyards directly to see if you can and what you will pay to have the day there. Also if you are up for a challenge you can take a bus to Chianti from Florence depending how far the bus stop is from the vineyard and how far you're willing to walk. Gives a different feeling walking up a hill towards the vineyard 😉"}]}, {"id": "2193883091010769", "text": "Hi there! I am travelling to Venice in September and have a severe allergy to peanuts and tree nuts. I was wondering if anyone else has experienced eating out in restaurants in Italy with severe food allergies and your experience?\n\nI tend not to eat out whilst on holiday due to fears of miscommunication resulting in my meal being unsafe, but I would love to try and eat out whilst in Italy as I have heard the food is amazing!\n\nIf anyone has any restaurant recommendations or could share their experience, that would be amazing! Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2193883091010769/", "likes": 0, "comments": [{"username": "Kay Rendall", "comment_text": "I have a severe fish allergy and tend to translate this to Italian and write out in large readable letters on paper to give to waiter to give to chef. In many restaurants chef has come to speak to me or I have been into kitchen to speak to chef.\nEven cross contimation like, knives, boards, oil r dangerous.\nRestaurants r much more aware now than in past 15 years"}]}, {"id": "2193882227677522", "text": "We will be renting a car from Venice Marco Polo airport, and returning to Milan Malpensa, early in the morning we depart. I was looking at car rental companies that are available in Venice and MXP (Terminal 1), and wow - SO many 1 star reviews on every single company.\nHas anyone had luck and had a good experience with any company in particular? We're looking through Auto Europe. Or, any to definitely stay away from?\nThanks!", "link": "facebook.com/groups/1373361046396315/permalink/2193882227677522/", "likes": 0, "comments": [{"username": "Stephen Henn", "comment_text": "We’ve used Hertz and Europcar through AutoEurope and had no issues. We buy the extra insurance and video the outside of the car at pick up and drop off so we have proof of the car’s condition should issues arise later."}, {"username": "Mike Guluk", "comment_text": "Avis/ budget always works good for us. Get an Avis preferred number and you get front of the line car pick up. There are always bad reviews for car rental companies because no one rights a positive review they bitch when some thing goes wrong. PM me if you want some advice as to where to go and stay on the way, we are I; this area 2 or 3 times a yr been everywhere"}, {"username": "Glenn Todd Webb", "comment_text": "We rented enterprise last month at Malpensa. No problems."}, {"username": "Miyuki Kanno Paul", "comment_text": "Auto Europe is a broker, by the way.\nWe’ve used Europcar, Hertz, and Sixt depending on the pick up/drop off locations. We never use any airport locations for pick up, though"}]}, {"id": "2193871457678599", "text": "Hi Everyone! This group has been so beyond helpful and I am so thankful to have come across it prior to my trip to Italy.\n\nMy husband and I, from USA, arrive to Venice on August 25th and catch an early flight out of Naples on September 11th so we will be visiting for 16 days. This is the current itinerary and while we are jumping around, we stillआणखी are within regions. I am just concerned if this will be too rushed and if anyone has suggestions on adjusting the days spent in each city.\n\nVenice - 2 nights\nFlorence - 2 nights\nChianti - 3 nights\nRome - 3 nights\nRavello - 1 night (we plan to spend time in Amalfi town during the day and end our night in Ravello)\nPositano - 3 nights\nCapri - 2 nights\nNaples - 1 night\n\nOpen to suggestions and hearing everyones thoughts on this itinerary and if we are doing too much with our time. Thank you so much in advance!!", "link": "facebook.com/groups/1373361046396315/permalink/2193871457678599/", "likes": 1, "comments": [{"username": "Jenny Payne", "comment_text": "Just remember every day you travel u loose that day 🌻"}]}, {"id": "2193863877679357", "text": "We are making our first trip in early October! We have lodging bought and paid in Rome but are planning on going where the winds blow us after being in Rome for 4 days. Looking to head toward Naples first. I usually have everything so planned out with travel so I am a bit nervous about last minute lodging. Looking for tips! Thanks everyone!", "link": "facebook.com/groups/1373361046396315/permalink/2193863877679357/", "likes": 1, "comments": [{"username": "Anthony DeSimone", "comment_text": "The earlier you book your trains the cheaper they are. I used Viator to book excursions and most of them you could cancel with in 24 hours. I had never been to Italy before so I used the advice of this site and it really helped. Book and plan now and don’t miss Florence and Tuscany it was amazing."}, {"username": "Mallorie Mathis McManus", "comment_text": "I have found booking dot com is a pretty good tool for last minute bookings."}, {"username": "Roberta Cella", "comment_text": "hi I had a private driver from Rome airport to Naples hotel , we booked a private tour in Rome and all around Naples, Ischia ,Amalfi and Sorrento ,our driver made everything more easier for us to get there ,his name is Marco he got his own family company called Manica Viaggi I highly recommend him ."}]}, {"id": "2193856104346801", "text": "We will be flying into Rome for a cruise in October. We arrive on Sunday, cruise leaves on Wednesday. Is it feasible to take a round trip day trip to Venice…? It looks to be a 4 hour each way trip. We know it would make for a really long day, but we’d love to go while we are there. Just looking for opinions.", "link": "facebook.com/groups/1373361046396315/permalink/2193856104346801/", "likes": 1, "comments": [{"username": "John Layman", "comment_text": "You would really be pushing it."}, {"username": "Greg Saba", "comment_text": "Sounds like you are trying to do a rail trip. For a day trip with jet lag? Don't do it. There are relatively inexpensive flights from Rome to Venice that can get you there in 70-75 minutes. We do some crazy stuff sometimes, and if you really want to see Venice, fly there. Spend a night and return to Rome sometime late in the day on Monday. That would give you an extra day in case something happens (like cancelled flight), and a few more hours to see Venice."}, {"username": "Mary Anne", "comment_text": "It’s feasible. Start early. Grab a water taxi to St Marks Square when you arrive. Ask the driver to point out places of interest. Walk around nearby, try to go a bit further than the first couple of streets into the quieter streets, , you’ll get a good taste of Venice, - you’ll go under Rialto bridge on the way. Bridge of Sighs is super close. Have a gondola ride. Water taxi back. Sleep on the train. You only live once - grab the opportunity."}, {"username": "Elena Innocenti", "comment_text": "It’s crazy!"}, {"username": "Kate Carberry Ansart", "comment_text": "I would spend that time exploring Rome....we only had 3 days in Rome and wish we could have had more!!!"}, {"username": "Karen Espinoza", "comment_text": "Ryanair\nTry to find A flight with Ryanair have good prices. I did 2 cruises I did love it, enjoy it"}, {"username": "Robin Burrell", "comment_text": "Only you can decide"}, {"username": "Mat Marturano", "comment_text": "Yes"}, {"username": "Shana Woodfield", "comment_text": "Make it a long day, but go ahead. Get there by noon and spend a few hours walking and visiting some sites. Take a late train back to Rome."}, {"username": "Brian Osman", "comment_text": "Lots to see and do in Rome"}, {"username": "Charleen Siegler Schuss", "comment_text": "Venice is a place to savor. Don't think a few hours worrying about need to get back is worth it."}, {"username": "Pam Gerretsen", "comment_text": "There's a train at 5.30am gets in 9.30, if you want to maximise your time - you can sleep on the train (maybe?!), spend the whole day, and get the late, overnight train back. A walk through Rome at 6.30am will be great, in October it'll probably be really quiet at the tourist spots that early (and a bit dark still). Personally I'd do it if you think it may be your only opportunity. And the train will give you the chance to see some countryside on the way up which you won't get from a flight."}, {"username": "Alexandra A Welker", "comment_text": "It's doable, just do it or you'll regret it. You can even spend one night and come back early the next day to explore Rome."}]}, {"id": "2192455217820223", "text": "If you are here for three weeks like we are sometimes you just need a little something different here is a option that will not disappoint you. Our family loves Mexican and we stumbled across La Cucaracha byआणखी Diana Beltran which is a short walk from the entrance to the Vatican Museums. The food was delicious and Chef Diana even stopped by to say hello and see how our meal was going. Highly recommended from this family of Mexican food fans! (Edited to appease those who really couldn’t understand the point of the post)", "link": "facebook.com/groups/1373361046396315/permalink/2192455217820223/", "likes": 89, "comments": [{"username": "Prue Beirne", "comment_text": "Try saying the name without the tune in your head 😂\nThanks for the recommendation\nI’ll put it on the list\nCan’t imagine I’ll eat anything other than authentic Italian but you never know!!"}, {"username": "Caroline Ramirez Randazzo", "comment_text": "Thanks for sharing! I love Mexican food!!!😋😋😋"}, {"username": "Rebecca Van", "comment_text": "Maybe after I’ve lived there for about a year! 3 weeks would not tire me of authentic Italian cuisine! 😜"}, {"username": "Kym Fabris", "comment_text": "Anna Fabris Michelle To"}, {"username": "Karen Espinoza", "comment_text": "I will never say no to a good Mexican restaurant, thanks for sharing. Enjoy your trip."}, {"username": "Angela Cagna Gaberel", "comment_text": "There are not only pizza, pasta, panini and antipasti in Italy, sure are cheaper than fish and a good steak , but you’ll find that too."}, {"username": "Diana Sankara", "comment_text": "Cacciucco, fiorentina, sarde a beccafico, saltimbocca and a thousand other typical Italian dishes have nothing to do with pasta and pizza. Also, you can skip appetizer (antipasto) and just have a main dish, it's not like Italians have an appetizer before every single meal."}, {"username": "Sam Izzo", "comment_text": "You visit a country with one of the best cuisines around the world and go for Mexican. You realize Italian food is more than that."}, {"username": "Eddie Ciccarone", "comment_text": "That's really anticlimactic. I would never eat Mexican food in Italy. You don't get many opportunities fir authentic Italian and you're substituting it for Chipotle 🙄"}, {"username": "Francesco Ronchi", "comment_text": "Reducing italian food to pizza, antipasti and panini (this one is ridiculous) is kind of offensive to italians"}, {"username": "Linda Santarossa", "comment_text": "Good grief....the man was just sharing a tip should you get bored with Italian cuisine. Don't judge just scroll on by. OMO"}, {"username": "Gilda Capraro", "comment_text": "Why were you only eating pasta, pizza, pannini, though? You skipped 2/3 of the Italian menus!"}, {"username": "Nydia Bryan", "comment_text": "Thanks for sharing!"}, {"username": "Maribel Chacon", "comment_text": "👏🏽👏🏽👏🏽"}, {"username": "Louise Caffrey", "comment_text": "Thank you! Love Italian food, but need variety over the holiday, even the kids wanted something different after 2 weeks."}, {"username": "Lexington Niteli", "comment_text": "La Cucharacha? Hopefully no namesakes hanging about..."}, {"username": "Eileen Muro", "comment_text": "Thank you for sharing!"}, {"username": "Teresa Heran", "comment_text": "Italians must eat foods other than Italian cuisine or I wouldn't have seen the variety of restaurants I saw during my month long adventure. American fast food seems to be a favorite as well as poke, sushi, Chinese and Mexican. (I would've laughed if I'd seen an Olive Garden 🤣) We saw a Mexican restaurant in Tropea, Frida's. It was packed every night we walked by."}, {"username": "Rosalinda Winco", "comment_text": "I agree it was so delicious!"}, {"username": "Jodi McGee Thomas", "comment_text": "These comments are not it. Maybe his family wanted a change or something \"familiar\" in the midst of trying alllllll the food Italy has to offer. It worked for them. Maybe it doesn't or wouldn't work for you. The shaming and downright rude comments are 😳🙄"}, {"username": "Marita Bracun", "comment_text": "Maddie Bracun love mexican"}, {"username": "Jason Yeoman", "comment_text": "I’ll have to try this next time! By week 3 I am also searching out other foods. By the end of my trip last year, I was eating at McDonalds and I won’t even eat that at home haha"}, {"username": "Joy Buenaflor", "comment_text": "Why so much hate from some peeps? Maybe they just wanted something besides Italian."}]}, {"id": "2193725831026495", "text": "I wasn’t sure how the ferry from Naples to Sorrento would go…. Walked up & bought our tickets", "link": "facebook.com/groups/1373361046396315/permalink/2193725831026495/", "likes": 25, "comments": [{"username": "Miyuki Kanno Paul", "comment_text": "Know which dock your ferry is assigned and join the queue accordingly😉"}, {"username": "Jennifer Gavino Gleba", "comment_text": "How much is individual ticket purchasing it day of VS buying in advance? Thank you 😊"}, {"username": "Diane M Fabiano", "comment_text": "Were the waters calm"}, {"username": "Tracy Foss", "comment_text": "What time of day was this ?"}, {"username": "Chuck Malburg", "comment_text": "Was there a good shoreline view Along the way."}, {"username": "Stacy Rosenbaum Hochmuth", "comment_text": "What is the name of this ferry port? I see many on ferryhopper. I will also be going to sorrento."}, {"username": "Kitty Boothroyd", "comment_text": "It’s a great system! We had pre purchased tickets months prior and arrived way earlier at the Naples Port than planned. The ticket office allowed us to change for an earlier ferry. So we got 3 extra hours on Capri (rather than waiting at Naples port)"}, {"username": "Kaye Old", "comment_text": "Anita Hamilton"}, {"username": "Lisa Moak", "comment_text": "When we were there last month, that entire area was full of people shoulder to shoulder due to three ferries leaving around the same time, it was chaos"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2193832214349190", "text": "My 21-year-old daughter and I are coming to Bologna for three days for a conference the middle of September ￼and we have four extra days to do something in Italy. We’ve heard great things about many areas …. It is my first time in Italy but ￼my daughter has seen Rome, Florence Venice and Lake Como ￼￼￼￼￼ so we were thinking, maybe Cinque Terre areaआणखी or Naples and the Amalfi coast area? I know four days isn’t a lot but it’s what we have….. I would love to do a cooking class…… maybe a wine tour?and /or see beautiful scenery, ￼ that blue grotto, looks amazing on the island of Capri ￼……￼￼￼￼￼ but as I keep looking, everything looks amazing and I wish we had so much more time ￼…… any suggestions? Thank you😊🙏￼￼", "link": "facebook.com/groups/1373361046396315/permalink/2193832214349190/", "likes": 0, "comments": [{"username": "Annalisa Francesca Gianna", "comment_text": "Which airport are you arriving in and where are you departing from? This could impact/limit where you go."}, {"username": "Nancy Koehler Barboni", "comment_text": "Lucca!"}, {"username": "Karen Schmidt", "comment_text": "Siena…and then do a couple day trip tours if you want somewhere she hasn’t seen. Or, go back to her favourite city. I’m sure she’ll enjoy it again and it will be special for you too!"}, {"username": "Colleen Sommerin", "comment_text": "Tuscany is easy from Bologna. We just spent 6 days and it's amazing. Did the best cooking class, explored San Gimignano, Sienna, wine tasting in Chianti. Amalfi also incredible, train from Bologna to Naples, don't stay in Naples... base yourself in Sorrento or one of the other towns on the coast."}, {"username": "Alicia Cox", "comment_text": "Not Naples for me; Tuscany is my favorite - so many towns that are special - Lucca, Sienna, Volterre, San Giamingnano ?sp"}]}, {"id": "2193834471015631", "text": "Hi my mother has a hard time walking. We are heading to Florence, Rome, Venice and the ￼ Amalfi coast. What is the best way for her to get around? Scooter? Wheelchair?", "link": "facebook.com/groups/1373361046396315/permalink/2193834471015631/", "likes": 3, "comments": [{"username": "Petra Keen", "comment_text": "Amalfi coast will be extremely challenging , so many stairs and the roads are uneven and there really aren’t many safe sidewalks, between the cars, people, buses and scooters it’s crazy. Most accommodations have tons of stairs , they still use donkeys to haul items to places . Definitely do your research and make sure the places are accessible."}, {"username": "Cynthia McDonald", "comment_text": "Amalfi would be difficult in anything frankly. Just be prepared that there will be many issues in Amalfi. Florence, Rome and Venice are doable with a scooter. Wheelchairs might be tough on the cobblestone streets."}, {"username": "Lucy Lestingi", "comment_text": "I am in Naples now with my son , heading to Rome tomorrow, then on to Florence, Venice and Milan. We Visited Pompeii and Sorrento. I have never had an issue walking, and I have to say the stairs, steep hills etc have been an issue for me. I actually mentioned to my son earlier that I don’t know how anyone with walking limitations get around. I haven’t seen one person with a walker or wheelchair and can’t say that I saw much accessibility if anyone had to use them for mobility. Florence and Rome from my visit last year would be more doable."}, {"username": "Rhonda Hope", "comment_text": "Amalfi coast and Venice will be more challenging because of the bridges in Venice"}, {"username": "Jan Linke Rickmers", "comment_text": "Venice will be very hard. All of the bridges are steps 😕"}, {"username": "Juliana Morrison Mongia", "comment_text": "If she has any documentation of a disability (like paperwork from a handicapped parking pass), she (and possibly a companion) might be able to get free entrance to most sites in Italy!"}, {"username": "Karen Lagerberg", "comment_text": "I've never seen anyone with a scooter like the handicapped ones in Italy. Seen only a couple of wheel chairs. You might try a walker for support, but, unfortunately, Italy isn't very handicapped friendly. I'd not bother trying to see the Amalfi coast it's all stairs and hills."}, {"username": "Joannie Houk", "comment_text": "Its been awhile but I don’t think either will work. Sorry"}, {"username": "Stephanie Evans", "comment_text": "We traveled with my MIL last year and she had a very hard time getting around. Every other day she stayed in the hotel and iced her legs and we booked the trip around mobility issues. It was very challenging. I don’t share this to discourage you just to let you know what we did. We had a great time but had to deviate a lot and Italy is just a lot of walking."}, {"username": "Annette Mayer", "comment_text": "What amazes me is the very elderly Italians can still make those hills and steep stairs. Me? HA! I'm only not that old and I do my best to only walk downhill avoiding Italy in the summer."}, {"username": "Diane Janovas", "comment_text": "Can your mother climb stairs into a tour bus ? You can take bus tours or get a private driver to do the Amalfi coast and see the vies. If she can step into s ferries she can get a nice view of Capri and Amalfi. I would plan on taking Ubers to major sites and using a transfer (lightweight) wheel chair in the sites themselves."}, {"username": "Jan Seidl", "comment_text": "Venice is nothing but walking and a lot of stairs , little bridges . I would never go to Venice if I had trouble walking."}, {"username": "Camille Wittenhagen", "comment_text": "It’s incredibly challenging for people with mobility issues. Just nearly impossible. I can’t imagine going to any of these places if I couldn’t walk as the norm would be over 5 miles per day at a pretty quick pace."}, {"username": "Josephine Rauch Rotunda", "comment_text": "And besides everything else mentioned get her a walking stick…many tourists use them for the hells, cobblestones and steps."}, {"username": "Sarita Krupa", "comment_text": "Sorry to say I agree with the comments above. I have been to many areas of Italy & anyone with difficulty walking is going to have a hard time. Wheelchairs etc are very challenging on the cobblestones, hills & bridges. My husband stayed home earlier this month for just this reason. I wish my news were better but you need to be prepared."}, {"username": "Mallorie Mathis McManus", "comment_text": "My mom (lord rest her soul - passed away five months ago) Loved to travel, to go to theater, nice restaurants, and musicals. However, in her later years, she was confined to her scooter and/or walker. She wanted to go to New York desperately. She could only walk a bit, most time was on her scooter and/or using her walker. Anytime she wanted to go somewhere - I would research our options COMPLETLY - even visit the place ahead of time if possible. I have been to NY multiple times and in Germany and Italy. Want to know that the BIGGEST reason she never go to go? MANY, many many of the bathrooms were located - DOWNSTAIRS. The subways were downstairs (many without elevators and/or escalators). The doorways getting in/out of hotel restrooms - way too small for her walker - and if we could get her walker in there - there wasn't enough room to maneuver - if you get my drift. She was not strong enough to get up/down stairs of tour buses. Very few - even here in America are equipped to accommodate the disabled. 🙁 In Europe, The cobblestone roads and uneven sidewalks would have been Impossible not to mention the HILLS (which don't seem like too much getting around it towns until you have mobility issues). She tipped over once on an uneven sidewalk - it was Very scary but thankfully, other than some bruises, she was fine.\nI feel badly saying this, but if the mobility issues are too bad - I don't believe your loved one would have a good time. (and to the naysayers - it's quite a different thing if your disable one is USED to maneuvering said hardships - I'm not being mean. I just dealt with it every. single. day for about ten years. )"}, {"username": "Cindy Sguazzin", "comment_text": "While most of the warnings here are absolutely true, unfortunately, I was pushed all over Rome in my wheelchair, including the Vatican and the Sistine Chapel. It can be done! I also, with the help of my loved ones, “did” Luxembourg, Dublin, and NYC!\n(Also, Venice (St. Mark’s square, the Doge’s Palace etc., and many smaller cities.)"}, {"username": "Mary Ellen Maatman", "comment_text": "Venice would be difficult. There are stairs on either side of every bridge and you can’t walk far without needing to cross a bridge. My husband used a cane abd did ok other than getting winded."}, {"username": "Grace Sulsenti", "comment_text": "Italian streets are not handicapped friendly.\nStreet & sidewalks are cobblestones, even difficult to walk on, needing very good footwork. Too difficult for a wheelchair."}, {"username": "Elisa Sguazzin Hendricks", "comment_text": "Yes! I can vouch for this. ❤️ A good quality transport wheelchair worked well for us, folds and can easily fit in the trunk of a taxi or the luggage area on a train. We haven’t done the Amalfi Coast but made it work within reasonable limits in the other cities you listed. And everywhere we went people were very kind, guiding us to secret elevators in a few places. Nonna was well respected and taken care of."}, {"username": "Pamela Cari", "comment_text": "Saw quite a few people in Europe using Nordic sticks ( walking Poles )"}, {"username": "Barbara Bastianini", "comment_text": "Wishing you well.\n\nI’m afraid The Amalfi Coast could be a nightmare for her. Please don’t underestimate the steepness there. Venice could be a challenge as well. To walk through Venice you have to cross a lot of bridges to get across the canals. To cross these bridges you typically have to go up steps on one side & and down steps on the other. That’s something to consider. Then the cobblestones streets. of Rome can be problematic. They’re incredibly unforgiving.\n\nI wish these beautiful places were easier for those with mobility issues. But honestly, they’re not. I don’t want to discourage you but I think it’s important to be realistic about what to expect."}, {"username": "Anne Hoenig Steib", "comment_text": "We stayed in Cetara in Amalfi Coast and if you get a place near the water, you could manage without stairs"}, {"username": "Rhona OConnor", "comment_text": "In some places in Europe the bathroom is down a small winding stairs and the cubicles are very small. This could prove very challenging 🚽"}, {"username": "Kit Nader", "comment_text": "In venice it won't be easy...she won't be able to go everywhere. So many steps and bridges. But a wheelchair would work just fine I'm san marcos square and along the front ... through the very small park and shops at the back of that."}, {"username": "Kimberly MacKinnon Cherry", "comment_text": "No way can she fo Amalfi Coast. Lots and lots of stairs, everywhere"}, {"username": "Tracy Foss", "comment_text": "Try golf cart tours or Tuk Tuk 🛺 at least she will get to see & experience what she can"}, {"username": "Karen DiRienzo", "comment_text": "My mom used her 4 wheel walker all over Italy.......Ven\nice, Florence, Amalfi, Rome. We were always summoned to the front of the lines and she got in free along with myself as her caregiver. Italy treats their elderly with much respect everywhere!!!!"}]}, {"id": "2193838544348557", "text": "Would anyone know where we could find a restaurant that does this in either Rome or Florence?", "link": "facebook.com/groups/1373361046396315/permalink/2193838544348557/", "likes": 6, "comments": [{"username": "Bill Shafer", "comment_text": "Take Google maps to Rome, zoom in and type in “Parmesan wheel” ￼in the search bar ￼"}, {"username": "Sabrina Nadeau", "comment_text": "Osteria Pastella in Florence"}, {"username": "Angel Burnard Marx", "comment_text": "Florence - Osteria Pastella. We haven’t been yet but it looks good."}, {"username": "Ashley Martins", "comment_text": "La Buchetta Florence"}, {"username": "Victoria Marchetti", "comment_text": "I think Angelo's familia Marchetti"}, {"username": "Gayla Regitz Jones", "comment_text": "We had this is Florence at La Buchetta"}, {"username": "Alisha Sell", "comment_text": "Osteria pastella in Florence; best meal I’ve ever had in my life!!"}, {"username": "Elena Innocenti", "comment_text": "Trattoria da Danilo in Rome. Cacio e pepe is a typical Roman dish."}, {"username": "Joanie Corneil", "comment_text": "I’ve never seen a wheel so small!"}, {"username": "Sara Beth", "comment_text": "Across from the oldest Apothecary in Florence."}, {"username": "Rita Levi Montalbano", "comment_text": "Tourists scam"}]}, {"id": "2193839284348483", "text": "What is the best way to make it from the red dot, the hotel, to the Vatican for a 9:00am.tour? Are the hop on hop off bus passes a good thing to have? We are not renting a car.", "link": "facebook.com/groups/1373361046396315/permalink/2193839284348483/", "likes": 32, "comments": [{"username": "Matthew Behrensmeyer", "comment_text": "The red dot is next to Termini train/metro station. Take the orange line from Termini to Ottaviano and follow the crowds. It will take 10-15 minutes."}, {"username": "Vanessa Linda Cimino", "comment_text": "To avoid paying fees for travel eg uber buss etc, everywhere is pretty close to walk! It may be a bit of a walk however, beautiful city to look at through your walk! Save your money on Ubers"}, {"username": "Debbie Alfaro", "comment_text": "The Metro. Very easy. Watch your personals ie purse, etc."}, {"username": "Andrea Brown", "comment_text": "Taxi"}, {"username": "Colleen Corner", "comment_text": "We took the city bus. Got us to the Vatican. We were staying close to Termini. Easy ride!!"}, {"username": "Andrea Brown", "comment_text": "Rome metro is full of thieves. I’d avoid and take a cab. Make sure they are using the meter."}, {"username": "Danny Wallis", "comment_text": "When I was there I opted for a taxi to the Vatican. The Vatican museum is soooo large, you will get plenty of steps in through the day. I think my taxi from the taxi stand at Largo Argentina to the door of the museum was 12 euro."}, {"username": "Dale Kitchen", "comment_text": "Walk"}, {"username": "Claudia Castellini", "comment_text": "I’d take a walk, it’s on the very center of Rome, a beautiful area, and in the early morning it’s not gonna be hot.\nOtherwise you can take a taxi, the easiest and fastest solution."}, {"username": "Dorothy Holder Zmigrodski", "comment_text": "Hotel front desk will call you a taxi."}, {"username": "Luciana D'Angelo", "comment_text": "Walking or taxi"}, {"username": "Gosia Kotyla", "comment_text": "Metro"}, {"username": "Deborah Schlitz Figueroa", "comment_text": "Uber"}, {"username": "Wallace Clavelle", "comment_text": "I walked to everything.I was 30 mins radius of all the main spots, I stayed near the Trevii Fountain."}, {"username": "Terry Pisano", "comment_text": "It's a one hour walk from your hotel. I'd take a cab and then slowly walk back to your hotel throughout the day... lots of things to do and see in between. That's pretty much my walking route (starting at the Sant Angelo bridge)."}, {"username": "Mary Coakley", "comment_text": "I wouldn’t depend on taxi. We were staying in same area in June and planned to get taxi. No sign of taxi in the morning and had to walk very quickly to get there on time. It was too late to work out subway. I’m sure that would have worked out fine if I had time to plan it as I think it involved a change of line along way. Also the walk would be ok if you have allowed enough time. Vatican tour was brilliant though. Hall of Maps amazing."}, {"username": "Franny Macone", "comment_text": "We found the Metro easy to navigate. Bought tickets prior off hours so didn’t have to wait at machine. Most hotels have city maps that they give at check in and mark routes and Line letters wherever you ask them information about."}, {"username": "Kelly Lutrick Sanford", "comment_text": "Get the Rome2Rio app! It gives you the best options for transportation in every city!"}, {"username": "Chris Bryner", "comment_text": "Taxi"}, {"username": "Robin Burrell", "comment_text": "Get a taxi"}, {"username": "Traci Borghi", "comment_text": "Take a taxi but consider the traffic.\nWe were late for our tour due to traffic. Go early!"}, {"username": "Laura Hilliard Lamont", "comment_text": "Metro/subway. Cheap and fast"}, {"username": "Sari Gruber", "comment_text": "Metro"}, {"username": "Cynthia Peraza", "comment_text": "Walk or Uber. The bus is great but not reliable. You would have to give yourself so much time before hand. The walk is not bad, grab a coffee enjoy the city on foot"}, {"username": "Artur Kiełbasiński", "comment_text": "Metro, line A."}, {"username": "Ruth Hackert", "comment_text": "Ask your hotel"}, {"username": "Sherri Leis Dillavou", "comment_text": "I just walked🤷‍♀️"}, {"username": "Charlotte Lowe", "comment_text": "We had private drivers!"}, {"username": "Liz Cooper", "comment_text": "Use the metro."}, {"username": "Bella Cassandra", "comment_text": "Walk"}, {"username": "Nanette Eustice Gatlos", "comment_text": "Metro is easy, it’s about 4 miles one way on that map."}, {"username": "Julie Adams", "comment_text": "Since it’s first thing in the morning and will get hot later, i would absolutely walk. It’s a beautiful area!"}, {"username": "Janice Rea", "comment_text": "Taxi"}, {"username": "Gary Bailey", "comment_text": "It’s a pretty good hike but still extremely walkable."}, {"username": "Donna Webster Hoffmann", "comment_text": "Train"}, {"username": "Allison Miller Kramer", "comment_text": "Taxi"}, {"username": "Anne Mc Namara", "comment_text": "Get the metro"}, {"username": "Rhio Schulz", "comment_text": "We got a cab"}, {"username": "Madeline Caporale", "comment_text": "I would likely take a cab, that would be quite a hike. To shorten your walk, you might also want to try the metro."}, {"username": "Roland Trego", "comment_text": "A taxi or Uber, especially when you have a specific time you have to arrive."}, {"username": "Tina Tupper", "comment_text": "We stayed near the same area and took the train/subway to our early morning tour and then took our time walking back after. It was very easy to navigate."}, {"username": "Svetlana Markovic Schlutz", "comment_text": "I would use a taxi. On the question on hop on hop off! My husband and I did love it, but they run during certain hours, and get you close but not to the sites. Basically if you need to a specific place at a specific time use a different type of transportation.\nEnjoy"}, {"username": "Greg Saba", "comment_text": "We have been to Rome a dozen or more times and never use public transportation.\nWe walk, and there is so much to see, you hardly notice the steps. We have come in jet-lagged and logged 12-15 miles of walking before our first night in bed. Pretty flat, as far as Italy goes, and one of the most walkable cities anywhere. And very safe; we walked three miles each way to and from Rome Open Tennis in May, with the return well after midnight."}, {"username": "Leena Österdahl", "comment_text": "https://\nwww.rome.net/bus\n\nhttps://\nwww.rome.info/\ntransport/\npublic-transport\n/metro/"}, {"username": "Jeff Garbash", "comment_text": "Uber like scooters. That’s what me and my partner did. Cost 3euros and was the fastest and best way to site see at the same time."}, {"username": "Jenny Court", "comment_text": "When you use the app you need to change to public transport it will show you all options or change to walk it will show you how far it is and tell you how hard it is as far as hills"}, {"username": "Tanya Ramsey", "comment_text": "We walked that!!"}, {"username": "Elizabeth Dancy", "comment_text": "Get Rome 2 Rio app…\nIt’s amazing. Gives you travel options and breaks it down from\nWalking, bud, train or cab"}, {"username": "Sarah Smith", "comment_text": "We walked everywhere to see rome"}, {"username": "Claire Dowson", "comment_text": "Get the Metro but buy your ticket at a kiosk before you got into the station. The queue was long."}, {"username": "Sam Cowie", "comment_text": "We took the metro. Super easy"}, {"username": "Kristina Mishevska Petrushevska", "comment_text": "Use the metro, you are close to termini and have easy access to lines A and B, avoid busses and trams they are slow and unreliable. Additionally you can walk but not recommended during July and August due to the heat"}, {"username": "Lynn Dixon", "comment_text": "We were a little closer than you and it was a pretty long walk. We walked there and got an Uber back. Get an early Uber and grab a coffee and croissant in the square near the museum before you go in x"}, {"username": "Julia Lesley", "comment_text": "Take the train and walk the short distances at either end."}, {"username": "Keri Catoe", "comment_text": "You are very close to the metro. There is also a metro stop 5 min walk to the Vatican museum entrance. Should get you there in about 30 minutes. If you use your apple map and change the option to “Transit” it will tell you all the ways to get there."}, {"username": "Noel Chittim", "comment_text": "We used the underground 🚊 to get to the Vatican, simple to use"}, {"username": "Paul Handley", "comment_text": "Metro. Quick and easy"}, {"username": "Lorraine Brennan", "comment_text": "Uber in rome is Uber black only so high end cars and more expensive than regular Uber- have ur hotel call you a taxi"}, {"username": "Elisabeth Zarapi", "comment_text": "Pedibus 🥾😎😊"}, {"username": "Sarah Ryder", "comment_text": "We used e-scooters 😊\nCan find the everywhere on the side of the street for just a few $$"}, {"username": "Barbara Bastianini", "comment_text": "I’d take a taxi."}, {"username": "Michelle Ritchea", "comment_text": "The hop on hop off busses don't start that early and the drop off stop for vatican is probably still a 20 minute walk to where the tours meet."}, {"username": "Jonelle Bindl Gilden", "comment_text": "Subway drops you right at Vatican."}, {"username": "Natasha Tomlin", "comment_text": "Uber. I would not walk that road in July. Also Itaxi app is good to get a taxi."}, {"username": "Joelle Thiessen", "comment_text": "The metro"}, {"username": "Alisha Young", "comment_text": "Uber"}, {"username": "Pong Ac Ai", "comment_text": "Taxi tell metered"}, {"username": "Bill Shafer", "comment_text": "We always stay at the UNA Hotel, very close to your red dot. We take the subway to the Ottaviano stop, it’s a short walk from there."}, {"username": "Larisa Layvant", "comment_text": "Walk and Uber not expensive"}, {"username": "Deb Hayes McCoy", "comment_text": "Uber"}, {"username": "Kate Carberry Ansart", "comment_text": "Uber works great in Rome! :)"}, {"username": "Jim Hash", "comment_text": "Taxi or Uber."}, {"username": "Fabio Scherillo", "comment_text": "Subway is great"}, {"username": "Doreen Maiello", "comment_text": "Walk it so much to see along the way"}, {"username": "Laurel Cotton", "comment_text": "Take the metro. Looks like your hotel is near Termini-you can get on the metro there, and just take it all the way to Ottaviano stop. It is a short walk to the Vatican museum."}, {"username": "Melanie Sartuche", "comment_text": "Take a taxi, that's something you don't to be late to or tired"}, {"username": "Nana Kutateladze", "comment_text": "I used Cab. I don’t want to be late for my tour and wanted to be rested"}, {"username": "Adriana Sormani", "comment_text": "I Ubered or had Hotel call a taxi"}, {"username": "Tracy Young", "comment_text": "Take the subway to the stop and walk. It’s not that hard to figure out. Use your GPS and you can follow to know you are going in the right direction. At worst, you get off and take a cab. Try it….you can do it!"}, {"username": "Tara Roed", "comment_text": "I arranged an Uber turns night before for an early am pick up since our tour was 745. Was totally worth it in my opinion."}, {"username": "Rabun Wiley Neves", "comment_text": "We got an Uber morning of, no problem."}, {"username": "Kathy Pageau", "comment_text": "Métro!"}, {"username": "Dawn Wall Burke", "comment_text": "Download the Rome to rio app"}, {"username": "Toby Levy", "comment_text": "Depends when you are going. We had to do the same on Saturday and it’s so hot so we took a taxi. Best decision as we were in Vatican City for the rest of the day"}, {"username": "Alexis Ingram", "comment_text": "Its probably quite an easy walk or you could take the metro. We did a bit of both just recently. Very simple to navigate ☺️"}, {"username": "Lisa Adams Robertson", "comment_text": "Taxi. Don't wear yourself out by walking to a tour that will have you on your feet for hours."}, {"username": "Lisa Sloan Walker", "comment_text": "Have the hotel get you a taxi"}, {"username": "April Calder", "comment_text": "We took a taxi to the Vatican and our hotel was near the colosseum."}, {"username": "Chad Kenney", "comment_text": "Take a cab"}, {"username": "Markie MK", "comment_text": "We always use electric scooters like Lime when getting around the city in Rome, but you do have to be a bit used to it."}, {"username": "Jaime Cleek", "comment_text": "I’d walk"}, {"username": "Jill Edgington", "comment_text": "The metro is pretty easy to use"}, {"username": "Violeta Giorgiana", "comment_text": "you can use the subway. very easy to use, the station is a 5-minute walk from the Vatican."}, {"username": "Dan Baron", "comment_text": "The red line of the metro appears to be close to your hotel. Pretty easy to use. Will drop you near the Vatican Museum entrance."}, {"username": "Matt Rowe", "comment_text": "Walk to the metro at the Coliseum and take that all the way to the Vatican."}, {"username": "Matt Rowe", "comment_text": "You could also walk it. It is long, but beautiful."}, {"username": "Cheryl Zimmerman", "comment_text": "Uber"}, {"username": "Jack Russo", "comment_text": "Here's a hint"}, {"username": "Dominic Po", "comment_text": "Can u Uber?"}, {"username": "Teri Depree Martinez", "comment_text": "We used the hop on hop off bus, better views that subway, but, I don’t think they start by before 9."}, {"username": "Jennifer Larese Taylor", "comment_text": "That’s fairly far. I love walking around a city but I would get a cab. Leave extra time for traffic. Walk back and see the sites"}, {"username": "Karen Bowman", "comment_text": "What's the name of your hotel? That's the area we would like to stay in."}, {"username": "Karen Baxter", "comment_text": "In Rome we just walk everywhere, there’s so much to see and everything looks different morning, noon & night"}, {"username": "Beija Lopez", "comment_text": "I ubered everywhere in Rome, and if I could, walked."}, {"username": "Dana Colantuono", "comment_text": "Use the uber lime scooters and bikes. It adds to the experience. Trust me :)"}, {"username": "Deanna Gasparott Kelley", "comment_text": "You can easily find out all your options by using the app “Rome to Rio”."}, {"username": "Sherry Lynn Hewitt", "comment_text": "Uber."}, {"username": "Jonathan Coombs", "comment_text": "Uber"}, {"username": "Victoria Marchetti", "comment_text": "Lime scooters! They were life saver for me for getting to tours quicker than taxi and walking!"}, {"username": "Lisa Minichini-Dowty", "comment_text": "Download rome2 rio"}, {"username": "Ginger DiGalbo Katz", "comment_text": "Taxi. From subway stop for st Peter's still a\n30 min walk. It's on the outskirts of town"}, {"username": "Jennifer Grimes Presley", "comment_text": "Have your hotel order you a taxi"}, {"username": "Jennifer Grimes Presley", "comment_text": "Have your hotel order you a taxi"}, {"username": "Isabel Salcedo Patterson", "comment_text": "We took a taxi and it wasn't bad. So much easier."}]}, {"id": "2193840077681737", "text": "Can you purchase a SIM card in Milan Airport?", "link": "facebook.com/groups/1373361046396315/permalink/2193840077681737/", "likes": 0, "comments": []}, {"id": "2193842384348173", "text": "Is it easy to rent a car in Rome and drive to the Amalfi Coast verses getting a private driver ? Planning on spending 1 1/2 days and then meeting our tour group later on in the week.", "link": "facebook.com/groups/1373361046396315/permalink/2193842384348173/", "likes": 16, "comments": [{"username": "Diane Noronha", "comment_text": "How is driving in Florence to various places in Tuscany ???"}, {"username": "Schalk Van Wyk", "comment_text": "We were in Italy for the month of June and had a rental car all the time. Yes, the roads can be narrow and the signage confusing, but you get used to it pretty quickly. Phone GPS systems make it much easier than it used to be. If you are a confident driver, go for it."}, {"username": "Brian McGraw", "comment_text": "Would not recommend driving in Rome or the Amalfi Coast.\n\nIn Rome, It’s like NASCAR, with more yelling and swearing.\n\nAnd in Amalfi, the roads are tiny, steep, and parking is a nightmare."}, {"username": "James Carr", "comment_text": "I haven't been yet (we fly out next week) and from all my research I definitely wouldn't drive in the Amalfi Coast unless I specifcially was seeking out a driving challenge as part of my trip!"}, {"username": "Debbie Dicker Ruscitti", "comment_text": "Did anyone LOVE their driver and willing to pass on the info. Heading to Rome next summer"}, {"username": "Allan Olexa", "comment_text": "Rural driving is easy. Driving in cities or along the Amalfi coast is crowded and chaotic. Parking is very limited or non-existent."}, {"username": "Steve Jones", "comment_text": "The wife and I did the drive, It wasn't bad at all. No death wish. It was actually a nice drive. Made our stop at Pompeii on the way"}, {"username": "Jeanne Mistler Buring", "comment_text": "Rome- extremely difficult to drive in"}, {"username": "Robin Burrell", "comment_text": "Private transport"}, {"username": "Jill Wolder", "comment_text": "Take a driver! He will point out important places on the drive. And stop for lunch along the way!"}, {"username": "Kelly Childers", "comment_text": "We just did it, the biggest problem was finding a spot to park the rented car, especially in Positano."}, {"username": "Becky Jones Dodson", "comment_text": "I wouldn't drive in Rome proper, but if you pick up a car at the Rome Airport, you should be fine. We started in Venice after a cruise, rented a car there and drove everywhere for two weeks until we finished up in Rome. Piece of cake. The only time we took a train was into Florence. There are some City Centers (the old parts of town) that you can't take a car into, but that's it. Having a car allowed us to roam around and stop at interesting places not necessarily planned."}, {"username": "Gerry Volturale", "comment_text": "In Summertime on the Amalfi coast is better moving around by ferry. By car is expensive (parking cost is about 7/10 euro p/hour) and you risk to remain in the traffic."}, {"username": "Marisa DePalma", "comment_text": "I would not drive there\nScary roads & while driving can’t enjoy the beauty"}, {"username": "Carole Mackewich", "comment_text": "Take the boat! It’s inexpensive, stress free, and you’ll be able to get off and walk around! The ride back at twilight is gorgeous! If you drive it, there is no place to park, and the traffic is awful!"}, {"username": "Evelle Jacks", "comment_text": "Go with a driver enjoy the views, don’t worry about parking."}, {"username": "Jim Robertson", "comment_text": "Once outside Rome it is easy.\nI STRONGLY advise you not to pick up your car at the rail station. Your car will be in a multi story car park often a good distance away and finding your way out of the city can be a nightmare. Pick up your car at Fumicino airport even if you are starting your holiday in the city centre. It is well worth the taxi fare as you can get straight onto the autostrada system\nBuon viaggio"}, {"username": "Bella Cassandra", "comment_text": "One thing that worked for me as I wanted to hop around the coast was to use a private parking area outside of Amalfi and then I used ferries busses taxis to get around. It’s not that driving the area is life threatening it’s just a waste of time honestly."}, {"username": "Natalie Cirino Chaney", "comment_text": "I don’t think you’d be able to really appreciate the beautiful scenery if you drive yourself. Also, you’d better be a super skilled driver and well equipped to follow GPS whilst handling hairpin turns on the side of cliff, scooters weaving in and out, pedestrians and parked cars galore and the room for error only a mere inches 😉 That’s just the Amalfi coast. Rome is a whole different set of craziness. Pedestrians everywhere, yet cars and scooters drive very fast. I have to hand it to them that they are excellent drivers, but it’s not the place for someone who doesn’t know their way around and/or isn’t used to that type of driving. Also, as others have mentioned, there’s nowhere to park! Save yourself many headaches while you support their economy and hire drivers or get taxis. I was just in Rome and the Amalfi Coast in June and it was a real treat for us to sit back and leave all the transportation to someone else! Enjoy your trip!"}, {"username": "Emmanuel Bautista", "comment_text": "No driver in Italy will accept \"verses\" as payment! Even The Vatican uses money to pay their employees; and I'm sure the Pope have lots of verses to spare."}, {"username": "Angie Formica", "comment_text": "We drove. If you’ve driven in mountains and big cities(NYC). You’ll be fine. Parking is an issue unless your hotel offers parking. We took a bus or boat from town to town along the coast."}, {"username": "Pam Ewouds", "comment_text": "I would never drive anywhere in Italy! If you want the name of a great driver, just let me know."}, {"username": "Sara Bee", "comment_text": "It is easy enough. We opted for fast train Rome to Naples and then car from Naples to Pompei and then Amalfi Coast."}, {"username": "Michelle Cutrone Van Duyne", "comment_text": "Don’t drive on the Amalfi Coast. Only for experienced drivers."}, {"username": "Alicia Cox", "comment_text": "For Amalfi - get a driver for sure. It is harrowing to drive imo. We did it - never again! Have driven all over Italy, but would not advise Amalfi."}, {"username": "Louise Desnoyers", "comment_text": "Italian high speed trains are much faster and cheaper than renting/ driving a car. My humble suggestion: for any trip lasting more than 90 minutes, buy a first class ticket. So confortable!"}, {"username": "Bennett Richards", "comment_text": "When I first drove from Sorrento to Amalfi in 1972 I rented a Vespa. It was wonderful. I did it again when I took me wife. She would otherwise never get on a motorbike but she loved the drive. Because of the road conditions a vespa is far safer than a car. Also on. A vespa you can stop anytime you like to enjoy the view anytime you like. Something you can’t do with a car."}, {"username": "Melissa Feielin Hawkins", "comment_text": "Last week my husband and I were in Amalfi coast, on our way to train station to Rome and the train workers went on strike. We ended up paying 600 euros to have our privite car take us to our hotel in Rome. Driver was telling us Italy has road tolls that are expensive $90-$250) . But you couldn’t pay me enough to drive Amalfi coast or Rome. Worth paying an experienced driver. And Italy has strict rules on level of experience and what they can drive. Privite black car 10 plus years experience and Worth the price."}, {"username": "Sarah Dubitzky", "comment_text": "I would take the train to Naples and then hire a private driver. Those roads are horrifying."}, {"username": "John Kay", "comment_text": "If you hire a driver for 5 days what towns would you recommend staying in"}, {"username": "Cheryl Swiatko", "comment_text": "We hired a private driver to drive us to the Amalfi Coast from Sorrento. They knew all the ins and outs, times to go, and what to see. It was worth every penny spent."}, {"username": "Felicia LoCascio Whitney", "comment_text": "Yes it's ready to rent a car. Driving is not for the faint of heart."}, {"username": "Jennifer Gustafson", "comment_text": "Driving is crazy there and not very easy to get around there. Easier to get a driver there and stay someplace central like Amalfi"}, {"username": "Valerie Collanton", "comment_text": "Let’s just say it’s not for the faint of heart ! We (meaning my brother was driving) have done it. But it was extremely stressful. I recommend a driver. That way you can enjoy the view which is stunning"}, {"username": "Steph Smith", "comment_text": "Get a driver!"}, {"username": "Briony Taylor", "comment_text": "We rented a car from Rome and drove along the Amalfi coast with 3 kids about 1 week ago. It’s fine, if you’re a confident driver and have patience go for it. It’s busy and a tight squeeze in places but it’s safe. You’re not going to die"}, {"username": "Marianne Alford Osentoski", "comment_text": "Versus."}, {"username": "Mike Adams", "comment_text": "I don’t think any Americans die on that road.\nBut is is hairy.\n\nParking in major towns is is the real hard part."}, {"username": "Donna Egan Mason", "comment_text": "I am getting a semi private boat"}, {"username": "Renee Kremesec", "comment_text": "No\nTake the high speed train from Rome to Naples and then Rent a car if you so choose or hire a driver or bus"}, {"username": "Karen Bowman", "comment_text": "So is driving from Rome to sorrento a bad idea also? That was our plan then ferry from sorrento to amalfi"}, {"username": "Tammy LeNormand Sill", "comment_text": "I've heard the Amalfi coast is especially treacherous and not for inexperienced drivers."}, {"username": "Cettina Milioto", "comment_text": "Just hire Taxi Carmine tour Amalfi Coast he is amaizng ask for a price.\n\nAlso don’t forget someday cars aren’t allowed in positano. Parking is RARE and very expensive. Not worth the hassle!!"}, {"username": "Ted Kostisin", "comment_text": "I've done it. Avoid driving Naples and your fine."}, {"username": "Terri Amos", "comment_text": "Narrow high roads with almost no shoulders, hairpin turns and you have to contend with massive tour buses."}, {"username": "Steve Watkins", "comment_text": "It is easy to rent and drive"}, {"username": "Nancy Vahl Raske", "comment_text": "What month are you going? We drove it in October no problem"}, {"username": "Tiffany Hadfield Merrill", "comment_text": "I just watched the roads last night 😳😳😳😳😳"}, {"username": "Jean Fremineur", "comment_text": "I would never pay a driver. Rent a small car and enjoy"}, {"username": "Sandra M Fernandes", "comment_text": "We ran across the roads in Rome… it felt like they’d just wait for us to place our foot on the road for them to be racing to go!"}, {"username": "Debbie Morton", "comment_text": "You would be taking your life into your own hands rather than enjoying your holiday. 🤦‍♀️"}, {"username": "Michael Martin", "comment_text": "Easy to rent a car. Very challenging driving on the narrow roads 1000 feet above the ocean"}, {"username": "Fransina Voorpostel Kennedy", "comment_text": "It so easy. Please don’t let the comments put you off. We lease and rent car every time we go. It’s amazing. You get to see all the little places you can’t get to without a car. It’s a bit stressful at first as we drive on the other side of the road, but as long as you are sensible. And yes we have driven the Amalfi Coast. It was fine."}, {"username": "Donna Parrish", "comment_text": "Can you drive a stick?"}, {"username": "Sharon Scott", "comment_text": "There is a really good train service between Naples and Amalfi. Trains go regularly from Naples Centrale or Garibaldi, I think the cost is less than $10 and it takes about an hour."}, {"username": "Matthew Kennedy", "comment_text": "It’s as safe as. Don’t listen to negative nonsense, I feel safer driving in Italy than I do in Australia, if you can drive, do it you won’t regret it as you see so much and can go wherever you want."}, {"username": "Lucia Dedíková", "comment_text": "Hi, we are from Europe and we traveled by car with our kids on Amalfi coast.\n\nI recommend for you to take the train. From Roma to Neapol is the train which take you in one hour (2 hours by car). This must be really interesting for kids, buy tickets online as, soon as possible. Then take train or taxi driver to Amalfi. On Amalfi coast is problem with parking and by speed train you are quickly moved from town to town. We wanted to travel to Amalfi from Pompei at 11am and we get recommendation to travel in the evening. At 11am it could takes 3-4hours and in the evening just about 1 hour.\n\nCar is fine to take for more days, not for 1 1/2d."}, {"username": "Patricia Wagner", "comment_text": "Absolutely"}, {"username": "Julie Pulzone", "comment_text": "I would hire a driver!!! Just came from there and have hired a driver in the past. Another option is to take the train to Naples and then hire a driver to any town you want to visit or take the ferry depending on how many days you have"}, {"username": "Maree De Berg", "comment_text": "Google driving the Amalfi coast 🤣🤣🤣"}, {"username": "Susan Levings", "comment_text": "I suggest a driver"}, {"username": "Jane Allison Frenzel", "comment_text": "Take the high speed train to Naples and then rent a car. I would drive from Salerno to Sorrento… unless you don’t mind being on the cliff side with the crazy Italian drivers!"}, {"username": "Petra Keen", "comment_text": "I would never ever drive from Rome to the Amalfi coast, it’s crazy risky! Take a train from Rome to Naples and then hire a driver to take you to Amalfi….it’s also depends where you are staying on the Amalfi coast."}, {"username": "Anthony DeSimone", "comment_text": "Get a private driver and enjoy. I have been a professional driver for over 30 years and I am glad I didn’t drive in Italy 🇮🇹. I will give props to the Italians the drive really well and with no road rage,and most of the scooter drivers are nuts."}, {"username": "Kurt Staples", "comment_text": "Take the train"}, {"username": "Gina Rabotino Pelle", "comment_text": "Rome is 10 times worse than any American city regarding driving. And unless you speak Italian, you will need to learn all the obvious road info written in Italian."}, {"username": "Sandi Westenberg Gelmin", "comment_text": "We hired a driver for the ride."}, {"username": "Rosemary Giuffre", "comment_text": "Do u have a death wish?"}, {"username": "Marcello Leone", "comment_text": "Don't listen to the naysayers, I just got back from a 25 day 8 city tour around Italy and drove the whole time, it was fantastic. Google Maps and or Waze work perfectly. Having said this, if you are from a small town and not used to big city driving, Italy is not the place to experiment."}, {"username": "Frank Hunt", "comment_text": "I’ve driven Rome twice and it’s ok if you know where you are going (gps) but the Amalfi coast would be a miss. Catch a train to Sorrento and get a ferry……."}, {"username": "Dianne Ellis Patureau", "comment_text": "This pic was in April (not high season). If a bus is rounding a curve, the cars have to back up as bus has right of way. Get a driver!"}, {"username": "Victoria Marchetti", "comment_text": "I took train to Napoli then rented from there to Pianillo. Everyone in the car was afraid for their life. But as the driver and few aperol spritz in, it was nothing. Parking is almost nonexistence on the coast tho."}, {"username": "Leila Jane", "comment_text": "Hire romeinlimo. We were supremely satisfied with our car and driver. It was a Mercedes SUV and a friendly, knowledgable driver."}, {"username": "Sandi Marella Johnson", "comment_text": "Not a good idea. .get a private driver..you will be happy 😊"}, {"username": "Carmela Noble", "comment_text": "As long as your experienced with standard and can make quick decisions in very tight and windy roads you’ll be ok. My husband drove us to positano a few times now. Wouldn’t say it’s the easiest drive ever but definitely do able. You could even just drive to sorrento which isn’t that bad, beyond that is where is gets tricky. You’re on the A1 for most of the trip it’s the last hour where it gets tight"}, {"username": "Kim Accardo Dunn", "comment_text": "Thanks everyone!!"}, {"username": "Soc Cer", "comment_text": "take the train if you can....it's not that easy driving in Italy, let alone driving the Amalfi Coast....we are in the same predicament and are leaning towards taking the train to Naples, then train to Sorrento and then after our stay, we were thinking of renting a car in Naples to go see relatives in another town.....but even driving to see relatives scares me...LOL....we'\nve done it before....not that easy"}, {"username": "Nicoletta DiFranco Walsh", "comment_text": "We hired a private driver. The roads are ridiculous. There is no place to park and if u find a place it will be very expensive. It’s so much easier with a service. Our experience was perfect"}, {"username": "Corey Anthony", "comment_text": "Definitely don’t rent a car. U don’t want to deal with parking in around most of Amalfi coast. Especially not Positano!"}, {"username": "Cheri Arrowood-Stanziano", "comment_text": "In summer there are road restrictions, you also need an international drivers license and proof of insurance"}, {"username": "LeAnn Bonkiewicz", "comment_text": "No way!"}]}, {"id": "2193843094348102", "text": "What is the best public transport from Fiumicino to the Vatican?", "link": "facebook.com/groups/1373361046396315/permalink/2193843094348102/", "likes": 0, "comments": [{"username": "Lilia Goldfarb", "comment_text": "There’s a shuttle that passes a few times a day and stops at the Vatican"}, {"username": "Stephen Henn", "comment_text": "Take the Leonardo Express train from FCO to Termini (14€), then take the Metro to Cipro - Musei Vaticani exit which is the closest stop to the Vatican Museums and to the Sistine Chapel. If you exit the Metro at Ottaviano - San Pietro: This station is a few minutes’ walk from St. Peter's Square and St. Peter's Basilica."}, {"username": "Frank Hunt", "comment_text": "Train straight to the Vatican"}]}, {"id": "2193846061014472", "text": "In mid June we traveled to the Puglia region of Italy (think the Heel of the boot). Beautiful region and since we had visited many of the more popular regions of Italy already this was a nice change. Rented aआणखी car and were then able to set our own schedule and itinerary. We visited Lecce, Otranto, Gallipoli, Alberobello, Matera, Bari, Polignano a Mare plus towns in between. Then headed north to Gargano national park region (spur of boot). If you are looking for something different to do in Italy I would highly recommend this region", "link": "facebook.com/groups/1373361046396315/permalink/2193846061014472/", "likes": 118, "comments": [{"username": "Adrianna Stella", "comment_text": "I’d love more details of your itinerary. Such as where you stayed & where you rented a car through. Also how was driving there?!"}, {"username": "Karen Espinoza", "comment_text": "Please share more details please\nThe picture are fantastic.\nWhere and How many days did you stay?\nThank you 😊"}, {"username": "Josh Nguyen", "comment_text": "Hi, may i ask how long did it take to do the walk around Matera and alberobello? thanks"}, {"username": "Nina Rose", "comment_text": "Public beach areas??"}, {"username": "Cinzia Wong", "comment_text": "Where did you rent a car and did they have automatics? Did you have to order a car in advance? How did you find the driving in this area compared with other areas? Thanks for sharing."}, {"username": "Nicola Algerino", "comment_text": "Brava , ben detto !"}, {"username": "Moyra Clarke", "comment_text": "Looks much more peaceful than the Amalfi coast."}, {"username": "Tracy Wrinn Mcdermott", "comment_text": "I loved this region on our first trip to Italy. We started in Rome-train to Sorrento-Posita\nno-ferry to Salerno for car pickup-Matera-A\nltamira-Alberab\nello-Polignano a Mare-Bari train back to Rome. I loved this region! We went for 15nghts total. Wish we had more time. Headed to the North next summer."}, {"username": "Paula Lazeski", "comment_text": "Finally!! A post that's about much less traveled parts of Italy, yet just as beautiful and interesting!!! The Gargano Peninsula is breathtaking!"}, {"username": "Mary Liscinsky Cloutier", "comment_text": "Beautiful thanks for sharing ❤️"}, {"username": "Doug Burke", "comment_text": "We loved Puglia. We went to all the places you referenced. Being our fourth trip to Italy it was a nice change from all the touristy places. The photo with the lighthouse is from our hotel room in Santa Maria di Leuca, at the very bottom of the \"heel\"."}, {"username": "Paulette Molasses Sims", "comment_text": "Breathtaking!"}, {"username": "Kate Smith Hanes", "comment_text": "Any Italian countryside driving tips would be greatly appreciated. We have rented a car in Salerno and will be driving to Sicily with frequent overnight stops along the way. Potenza is where we will spend our first night; family connections there. Over the next 4 days we will drive and eventually end up in Palermo."}, {"username": "Renee Rodi", "comment_text": "No problems driving except we tended to drive slower than Italians. They would honk and pass us or we would pull over and let them pass."}, {"username": "Victoria Forbes", "comment_text": "Can’t wait! Meeting friends in Puglia for two weeks. Home base in Ostuni, car rented and lots of exploring of the region to be done."}]}, {"id": "2193852511013827", "text": "We are going to the Opera while in Verona on Sat Aug 12. Please let me know restaurant recommendations near the arena for before. I’m assuming we would have to do dinner around 6pm. Also open to recommendations eating something light earlier then have dinner and drinks late night after the opera. This is our first visit.", "link": "facebook.com/groups/1373361046396315/permalink/2193852511013827/", "likes": 0, "comments": []}, {"id": "2193854517680293", "text": "Trying to book my airport shuttle (flight/hotel booked) but having trouble with entering my cell number for a contact number for shuttle.\nThanks be nice May sound like a stupid question but apparently I can’t figure it out.Flying into Rome and staying Rome.", "link": "facebook.com/groups/1373361046396315/permalink/2193854517680293/", "likes": 0, "comments": [{"username": "Stephen Henn", "comment_text": "Did you enter your country code before entering your phone number? Example: the country code for North America is 001, or +1."}, {"username": "Victoria Laverty", "comment_text": "Need add country code then number\n\nSuch as australia 61 then drop 0 if thats first in your number then rest of your ph number"}, {"username": "Kay Rendall", "comment_text": "Try RomeCabs always reliable, to be waiting for u at arrivals with name on board etc. same price as taxi from airport"}, {"username": "Gillian O'Callaghan", "comment_text": "\"+\" then country code minus 0, then your provider minus 0 then your number."}]}, {"id": "2193860437679701", "text": "Yikes...just saw this in this morning's (Sunday) paper.... \"Air Transport Unions Went Ahead with a Planned Nation Wide Strike\".\n\nBe sure to check your travel plans won't be impacted/affected. We are set for Oct travel (reschedule from 2020 covid restrictions). 🙏ing for a good outcome.", "link": "facebook.com/groups/1373361046396315/permalink/2193860437679701/", "likes": 2, "comments": []}, {"id": "2193863667679378", "text": "Hello everyone. Traveling from Rome to Poisitano in early October with my 84 year old mom. What is the best train to take to Naples then we will hire a driver.", "link": "facebook.com/groups/1373361046396315/permalink/2193863667679378/", "likes": 0, "comments": [{"username": "Sandy Radican Shikaly", "comment_text": "Only two train companies.. Italo and Trenitalia.. slight preference to Italo.. but what ever has the best time for you"}]}, {"id": "2193865331012545", "text": "Has anyone stayed at the Best Western Plus Spring House in Rome near the Vatican?\nJust looking for clean and simple place.", "link": "facebook.com/groups/1373361046396315/permalink/2193865331012545/", "likes": 1, "comments": [{"username": "Stephen Henn", "comment_text": "We stayed there in 2016 and it was fine then. Rooms were small but adequate. Breakfast buffet was very good. They had an airport shuttle that picked us up at FCO."}, {"username": "Abbe Lou", "comment_text": "Thank you🙂"}]}, {"id": "2193868287678916", "text": "How many hours before our flight do you recommend leaving the hotel for the airport in Rome if traveling back to the states?", "link": "facebook.com/groups/1373361046396315/permalink/2193868287678916/", "likes": 8, "comments": [{"username": "Kim Geary Keidel", "comment_text": "Our car service picked us up 3 1/4 hours before our flight. Told them our flight time and they decided on when to pick us up."}, {"username": "Maria Badamo DeSocio", "comment_text": "We flew out of Rome last week and was there 2.5 hours before and had to check bags and made it to the gate with plenty of time to spare, we had time for a little breakfast."}, {"username": "Melissa Ferrall Bybee", "comment_text": "At least 3 hours"}, {"username": "Karen Espinoza", "comment_text": "3 hrs"}, {"username": "Julie Adams", "comment_text": "We like to stay in this great little hotel by the airport that’s right on the water. I can look up the name in the morning if you’re interested. They have a shuttle to the airport and can advise on times. Edited to add: We’ve stayed at Hotel Tiber. Another in my notes is Hotel Isola Sacra. Both are close to the airport and have shuttles. Walking distance to restaurants, though we like the restaurant in Tiber."}, {"username": "Joseph Pisaniello", "comment_text": "At least 3hrs"}, {"username": "Emma Osbourne", "comment_text": "3 hours"}, {"username": "Gillian O'Callaghan", "comment_text": "Depends how you're getting to the airport.....wal\nk/train or car."}, {"username": "Elaine Embleton", "comment_text": "Traffic can be brutal going to Rome; we had left plenty of time but traffic was at a standstill. Give yourself as much as you can"}, {"username": "Alexandra A Welker", "comment_text": "At least 3 hours"}, {"username": "Jayne Dawson Meyer", "comment_text": "3 hours"}, {"username": "Kezia Smith", "comment_text": "we got there 3hrs early but it was super quick… couldn’t believe how easy/relaxed going through security was (only about 10-15mins worth of lines) but maybe we were just lucky"}, {"username": "Patrice Warren", "comment_text": "Is there TSA pre-check in the terminal where American Airlines is located or is that just an option in the US?"}, {"username": "Jeannie Morris Wierman", "comment_text": "I always plan 3 hours. I would rather wait at the gate than risk missing a plane."}, {"username": "Mary Iuor", "comment_text": "2-3 hours would be my suggestion."}, {"username": "Laura Maroney Finocchiaro", "comment_text": "3-4 hours"}, {"username": "Paula Bennett", "comment_text": "Enough time to check out airport shops!"}, {"username": "Rebecca Branta", "comment_text": "We got to the Rome airport 2 hours ahead and had zero issues! Much more organized than airports I’ve been to in the US (Atlanta or Ohare at Ohare less organized with TSA!)"}, {"username": "Jules Earl-Rossiter", "comment_text": "It's 2 hours for a European flight and 3 hours for an international flight ✈️....🙃"}, {"username": "Joanie Corneil", "comment_text": "3"}, {"username": "Brian Osman", "comment_text": "You need to be at the airport 2-3 hours before your flight leaves"}, {"username": "Mary Ridenhour", "comment_text": "That would depend on how far your hotel is from the airport. That's the essential start time."}, {"username": "Janelle Skaggs Priester", "comment_text": "We only had a little over 2 hours and we were very rushed. I would have been more comfortable if we had 3."}, {"username": "Sid Calk", "comment_text": "I will show up at least ￼ 2 to 3 hours before your flight. I always like to leave a little extra time just to be on the safe side I don’t want to miss my flight"}, {"username": "Fiona Cohn", "comment_text": "3.5 hours!! Honestly the checking in queues are very very long! Took me at 40 mins to get to the check in desk."}, {"username": "Jill Cox", "comment_text": "Leaving the hotel? 4 hours before."}, {"username": "Tyler Tinney", "comment_text": "Gates aren’t posted until about 1 hour before, so you’ll be sitting in the food/shopping area without gate access until ~ 1 hour before"}, {"username": "Leena Österdahl", "comment_text": "My husband and I usually spend the last night in hotels near airports, several of which have been within walking distance of the airport. Also in hotels that organize shared transportation to the airport. Don't trust a private taxi that promises to pick you up on time. We use our sword to find cheap flights, when many flights leave very early in the morning. Some hotels offer a packed lunch.\nLast time we stayed in a hotel in Madrid, from where a taxi also picked up passengers from nearby hotels at 5 o'clock in the morning to the airport. The taxi was very punctual. It's worth ordering a taxi through the hotel staff so you don't miss your flight and also make sure that the taxi is actually ordered."}, {"username": "Marcia Adams Pease", "comment_text": "What if your flight is scheduled for 6:20 am? 😩"}, {"username": "Inna Rozen", "comment_text": "What about the VAT? How long does that usually take?"}, {"username": "Kate Carberry Ansart", "comment_text": "We flew out of Rome last month on a day that the baggage handlers were going to strike so we arrived 3 hours early. We ended up moving through pretty quickly and still had 45 minutes at the gate before boarding. I should add that we did not check any luggage. :)"}, {"username": "Jerry Lyubelsky", "comment_text": "We flew out yesterday and got to the airport 2.5 hours before the flight. We had no checked bags. We got through security and to American Airlines gate in about 40 min. We then Just grabbed breakfast and waited for our flight 10:10AM FCO-PHL"}, {"username": "Glenn Todd Webb", "comment_text": "Ask hotel what time you should leave"}]}, {"id": "2193870094345402", "text": "Has anyone used asaptickets site for airfare? Know anything about it? Recommend it?\nwww.asaptickets.com", "link": "facebook.com/groups/1373361046396315/permalink/2193870094345402/", "likes": 0, "comments": []}, {"id": "2193871091011969", "text": "Hello,\nHow much does vatican museum and sistine chapel tickets cost? and how much skipping the line cost there?", "link": "facebook.com/groups/1373361046396315/permalink/2193871091011969/", "likes": 1, "comments": []}, {"id": "2193874517678293", "text": "Hello! 😊 me and my boyfriend are traveling to Italy and plan to visit Villa del Balbianello on Lake Como 🇮🇹\nWe plan to buy the tickets on the official site and would like to use our student ISIC cards if we can for the discount. Is that possible or they only accept italian students cards?\n\nThanks for help 🫶🏻", "link": "facebook.com/groups/1373361046396315/permalink/2193874517678293/", "likes": 1, "comments": []}, {"id": "2193880637677681", "text": "Any tips on parking in Lerici?", "link": "facebook.com/groups/1373361046396315/permalink/2193880637677681/", "likes": 0, "comments": []}, {"id": "2193881894344222", "text": "Does anyone know if you can buy plus size clothing in Italy? I'm curious", "link": "facebook.com/groups/1373361046396315/permalink/2193881894344222/", "likes": 2, "comments": [{"username": "Colleenmaaske Maaske", "comment_text": "Colleenmaaske Maaske"}, {"username": "Alessandro Iannelli", "comment_text": "Define \"plus\". Up to 3XL, it shouldn't be hard. Over that, it's kind of random. Also, in case you are from the u.s., 3XL in Italy would probably be called a XXL in your country."}, {"username": "Elena Innocenti", "comment_text": "Size in italy are small than in USA. Maybe 1 size less.\n\nthere are shops plus size, some brands have plus size.\nMost of them are not cheap (for woman one of most famous is “elena mirò” casual and formal clothing, “fiorella rubino” less expensive).\nIn Rome there are some specialized shops for man and woman have very big size (one for man call “pitran” is not far away termini station).\n\nYou can find some inside shop chain like coin or upim but not to much.\nif you need 3/4/5XL you have to find specialized shop."}, {"username": "Kay Rendall", "comment_text": "Have never found any in 9 visits. I am L, XL in Australia.\nSome Italian ladies r larger and dress beautifully, so elegantly. However I think they know exactly the brands, boutiques to shop in where they live, in the big cities. Perhaps malls outside the cities\nHave had some luck in the weekly, monthly markets (check with accom) as end of season, like now, designer brands find their way to markets. Always interesting to see way the very elegant ladies shop at the markets. Try things on in back of truck, bargain. Great accessories, bags, shoes as well.\nU will need to try even if over what u have on. I often wear a swimsuit or cami under my clothes so I can try on, even if no change rooms . Enjoy the whole exp."}, {"username": "Margaret Minicozzi", "comment_text": "No"}, {"username": "Ingrid Zancoli", "comment_text": "I am a big girl for the average here, 1,80m tall+90kg weight, and i struggle quite a lot to find suitable clothes, especially elegant ones. Same for shoes. In every town there are a couple of specialized shops, but they're often quite expensive..."}, {"username": "Tammy MacBride", "comment_text": "Im 5’11 and wear a 12. I had a hard time."}, {"username": "Jill Rosenfeld", "comment_text": "Marina Rinaldi"}, {"username": "Ruth Hackert", "comment_text": "Just Google Woman’s plus size clothing in (a city)"}, {"username": "Kelley Hargett", "comment_text": "I could not even find non plus sizes that fit me in Italy 😞"}, {"username": "Ginny Schena", "comment_text": "Use google maps and search for plus size clothing. I found this shop in Naples. Just move the map to encompass the area you’re in or traveling to and search there. Good luck!"}, {"username": "Donna Gilardone Szwabowski", "comment_text": "Yes, OVS has plus section"}, {"username": "Jill Gilreath", "comment_text": "I found this top at a market out of a truck sale for €9!! I wear XL normally but it was sized as large…\nWe were in the Dolomite area…"}, {"username": "Paula Brink", "comment_text": "Marina Rinaldi has very nice plus size clothing."}, {"username": "Roe Gallo Saks", "comment_text": "Yes. You have to ask. Generally, they display a smaller size. If you ask, they will pull your size from the back."}, {"username": "Silvia Bucci", "comment_text": "There are some good brands (OVS, Elena Mirò, Max Mara), but prices are not great. I'm an Italian XL and usually buy at the local street market. If you search on Google name of the town + \"mercato settimanale\" you can see when it's available (usually one day for week) in the town you 'll be. And if it's on monday there, the next day it Will be in the nearest town, and the day after in another town around there.\nEs: this Is in Rome\nhttps://\nwww.happings.com\n/it/\nmercati-settiman\nali-a-roma-e-pr\novincia.html"}, {"username": "Sharon Milligan Martin", "comment_text": "Yes"}, {"username": "Holli Neumann", "comment_text": "Kristin Neumann Ramirez"}, {"username": "Joe Laricchia", "comment_text": "For the guys remember that Italian sizes run smaller. For example if you Wear XL in the USA you will need to buy XXXL in Italy !!!"}]}, {"id": "2193882881010790", "text": "-ELECTRIC VEHICLE QUESTION - Hey all, we're heading to Italy in a couple of weeks and will be in Bologna at the beginning and end, spending time along the Adriatic coast, and then will be traveling up to the Aosta Valley for a week. We're renting a car and our reservation info says it's an electric vehicle. I've done some Googling and it appearsआणखी that charging stations are commonly available but I thought I'd check with the hive mind here to see if anyone has on the ground experience finding charging stations during your travels in Italy. Sometimes Google and real life aren't always in sync. TIA!", "link": "facebook.com/groups/1373361046396315/permalink/2193882881010790/", "likes": 0, "comments": [{"username": "Frank Hunt", "comment_text": "Personally I’d refuse an EV for car hire."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2193886794343732", "text": "Any recommendations on where to buy Christmas ornaments? Florence, Rome, Sorrento, Capri & Sardinia(Cagliari/Pula area)\n\nGoing on our honeymoon and have been collecting ornaments from all the places we’ve traveled so far, want to keep this tradition.", "link": "facebook.com/groups/1373361046396315/permalink/2193886794343732/", "likes": 7, "comments": [{"username": "Laura DeCicco", "comment_text": "Just go in to any gift shop and you’ll find some"}, {"username": "Kate Carberry Ansart", "comment_text": "We found them in some of the gift shops in Rome & Florence and in all of the ceramic shops along the Amalfi coast."}, {"username": "Cheryl Swiatko", "comment_text": "You can find ornaments everywhere. We were just there and I was able to buy an ornament for every city that we visited."}, {"username": "Julie Norris", "comment_text": "I remember a Christmas shop on Via del Corso in Rome. That was October but I think it's all year round"}, {"username": "Tiffany Hadfield Merrill", "comment_text": "I just saw a Christmas store here in Sorrento last night"}, {"username": "Sigrid Cormier", "comment_text": "Google Christmas store then your location."}, {"username": "Ann Hannaway", "comment_text": "We do this also…..all towns/cities have baubles"}, {"username": "Karen Schofield", "comment_text": "In Naples there is an entire street devoted to nativities. From Teeni Tiny ones to almost life sized"}, {"username": "Brian Osman", "comment_text": "I got mine in Assisi"}, {"username": "Jerry Lyubelsky", "comment_text": "Make sure they say made in Italy"}, {"username": "Sherrin Wake Bracci", "comment_text": "We also do this. It’s a great tradition and our now adult kids do it too when traveling to add to the family tree."}, {"username": "Lia Geloso", "comment_text": "Naples has alot of stores."}, {"username": "Patty Beemer", "comment_text": "Ceramiche Luca Della Robbia in Florence--one of the few original ceramic stores remaining. They have very pretty hand-painted ornaments. Close to Piazza della Signoria. Via del Proconsolo, 19/red, 50122 Firenze"}, {"username": "Rhonda Smith", "comment_text": "Most souvenir shops have some!"}, {"username": "Lisa Lisa", "comment_text": "Me too❤️..in Venice I got Santa on gondola inside murano glass ball, one of my favs"}, {"username": "Sandra Ferachi Romero", "comment_text": "You will find ornaments in every city that you travel to. It’s exciting finding them. I have ornaments from most of these places. It makes decorating the tree so much fun reminiscing about the places I have travelled!"}, {"username": "Paola Bersano", "comment_text": "In Naples,look for San Gregorio Armeno"}, {"username": "Joanne Hubbard", "comment_text": "They are everywhere in the gift shops"}, {"username": "Reagan Bramston", "comment_text": "I might have to use a 2nd Xmas tree soon..... I always seemed to find one everywhere. If not I buy a touristy key ring from the junkie tourist shops found in most places."}, {"username": "Angela Gilmore", "comment_text": "Definitely Naples. There is an entire street dedicated to Christmas and more specifically to Nativity. Via San Gregorio Armeno, in the historic city center."}, {"username": "Clare Boxer", "comment_text": "I did see some in Sorrento last week, but can’t recall where!"}, {"username": "Vanessa Caretti", "comment_text": "In Rome, you can find Roma Christmas Baubles in most gift shops. Also down Via delle Murette by the Trevi Fountain there is a lovely glass shop selling Murano glass ornaments which has small Christmas Murano glass ornaments - angels & Christmas trees 🌲\nThere is also a Christmas shop on Via del Corso"}, {"username": "Frances Scannapieco", "comment_text": "There are two stores in Sorrento dedicated to Christmas. The one I love is called …Christmas Shop. The address is….via degli archi, 18\nIt is on one of the side streets. Fabulous decorations"}]}, {"id": "2193887807676964", "text": "My family and I leave in 20 days for our 18 day trip to Italy. Hubby and I both have a Schwab account as they do not charge any ATM or international fees and that is the card we plan to use. However, I want to have cash for any incidentals or simply places that take cash only. We’re a family of 5. Do you think $2000 converted to Euros is enough orआणखी do you think I’ll need more cash? I don’t like carrying cash, but also know when traveling it helps for tips, espressos, gelato, etc and don’t want to be in position of not being able to find an ATM. TIA.", "link": "facebook.com/groups/1373361046396315/permalink/2193887807676964/", "likes": 2, "comments": [{"username": "Anthony DeSimone", "comment_text": "2000 is more than enough"}, {"username": "Stephen Henn", "comment_text": "$2000 is too much especially if you have an ATM card and can make withdrawals as you need more cash. There are plenty of bank ATMs in major cities."}, {"username": "Annalisa Francesca Gianna", "comment_text": "Too much! We also have the Schwab card. ATM's are easily accesible. Don't convert money here. Just pull from ATM once you're there if you need some cash. Do not go to ATM in airport. Pull as needed to avoid having to hold on to a lot of cash. We also used our Sapphire Preferred for larger purchases (earned points and paid immediately with no foreign fees). Make sure to use your coins before leaving."}, {"username": "Kate Carberry Ansart", "comment_text": "We needed cash for drivers, tours, some bathrooms, etc. ATM's are everywhere so I would start with 500 euros and go to an ATM when necessary."}, {"username": "Kay Rendall", "comment_text": "ATMs everywhere in main areas. Ask your accom for nearest.\nI usually draw a bout 200 euros, for me lasts a few days, mainly for taxis, buses.\nPerhaps a water or coffee.\nUnless u r going rural areas always ATMs though usually use them outside bank. Find exchange rates if u asked to be charged in local euros is better than changing at your bank prior to leaving.\nAlways get some from ATM at airport. Just check it is compatible with your card.\nIt costs me approx $4 ATM fee. But better than carrying lots cash. Sometimes have $100 au tucked away perhaps for emergencies."}, {"username": "Dave Conroy", "comment_text": "2000 is a ton of cash to carry around when you have an atm right there if you need it. I typically carry 100 euro for a week and hardly use it. I do collect euro coins rather than spend them too much so I can use for small stuff."}, {"username": "Dave Colleen", "comment_text": "I wouldn’t carry that much cash. We started with 200 Euros each)husband and self). Withdrew as needed. When withdrawing decline the conversion"}, {"username": "Ilaria Giorgulli", "comment_text": "Too much you can pay even 3 gelati with credit card. Unfortunately you will need them for taxis in Rome, as many do not accept credit card despite they should.. expecially with tourists.. 1K is more than enough"}, {"username": "Jose Velez", "comment_text": "Every time I return from Europe I bring 150 euros with me for the next trip. Last may we did a 16 day for 3 and only spend was 70 euros in cash. Everything was charge to credit cards even 1 euro bottle of water. With the pandemic everything is cashless so your need of cash is limited. Banks atm will provide the cash you could need is smaller amount."}, {"username": "Pong Ac Ai", "comment_text": "Just withdraw from time to time there whatever happens you have no regrets and buy a belt bag for more security hope it helps"}, {"username": "Jenny Payne", "comment_text": "I’ve been going to Italy for years and I do take euros €1000 can always bring it home and nothing has every happened to me with a cross body bag and a lot of commonsense 🌻🇦🇺"}, {"username": "Terry Pisano", "comment_text": "That's a lot of gelato!"}, {"username": "Allan Olexa", "comment_text": "I assume the Schwab is a debit card.I have one to get cash euros from a bank ATM. I use very few cash euros. I pay with US credit cards. The only cash I spend is for small purchases at tiny establishments,\nstreet markets, and tips. Paying with a credit card is far safer than using a debit card."}, {"username": "Giovanni Pianigiani", "comment_text": "If you're planning to leave 2k on tips, I'd love to be waiting on you😅"}, {"username": "Janet Messanelli Bozzone", "comment_text": "I would never carry that much cash. Take 300, if you must. It is super easy to withdraw money from any bank ATM and Schwab will reimburse you. Just always decline the conversion. Always take a backup credit card that doesn’t charge a foreign transaction fee….just in case"}, {"username": "Nikki Blosser", "comment_text": "Too much cash to start. Use ATMs when you need it. You’ll find plenty around the main cities. Maybe start with 300. Use credit card for all your purchases that take it. It is safer. (Not a debit card)"}, {"username": "Martha Lee", "comment_text": "Id say you’re a little short but thats a good start. That based on 3weeks 4 people in May. Obviously you’re not carrying that every day with you You leave it in the safe. But it’s really nice having cash"}, {"username": "Shana Woodfield", "comment_text": "Use an ATM for cash. A couple hundred € at a time."}, {"username": "Janice Rea", "comment_text": "Should be good but it is easy to find bank ATM too."}, {"username": "Rose Anderson", "comment_text": "2000 is way too much unless you don’t plan to use your card at all- 300- 500 should more than cover you and you can withdraw more as needed. We found most places took a card but they all preferred cash"}, {"username": "Nhora Andrea Holmes", "comment_text": "Family of 5, took out 2000 used every bit of it. Taxis, paid cash for private transfers, street markets etc."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Bank affiliated ATMs are everywhere, even at the airport just past baggage claim. No need to carry a large amount of cash. Just look for a Bancomat."}, {"username": "Jim Kelleher", "comment_text": "ATMs are everywhere. Look for the word “bancomat”."}, {"username": "Molly Roberts Siegenthaler", "comment_text": "Use Apple Pay everywhere and just get a few euros when you get there"}, {"username": "Dana Green", "comment_text": "Huh? Just use your card and grab cash at the bancomat."}, {"username": "Jennifer Rand", "comment_text": "We only carry about 150€ at a time."}, {"username": "Robin Matthews", "comment_text": "We have been taking about $500 in Euros (usually left over from prior trip). This gets us started then using ATMs if we need more. Our last trip (in May) was almost all CC. We only used Euros for very small purchase, and our initial transportation."}, {"username": "Alicia Cox", "comment_text": "I wouldn’t take that much but take some & then go to bank ATM - they r easy to find."}, {"username": "David Solo", "comment_text": "Italy is not a third world country. You will find ATM machines everywhere."}]}, {"id": "2193890824343329", "text": "If my home base is in Rome for 4 nights…Is it doable to do an early morning train and go to Pisa to see the tower maybe walk around a bit then train it to Florence to see David and Academia Museum. Head back to Rome in the evening. We know we won’t see everything. If its not doable then should we just see Florence for the day and skip Pisa all together. Input is much appreciated.", "link": "facebook.com/groups/1373361046396315/permalink/2193890824343329/", "likes": 8, "comments": [{"username": "Kristi N Doug Leonard", "comment_text": "We stayed in Florence for 6 nights. There’s so much to see& it’s beautiful! We took an all day tour to 3 places, which included the obligatory Pisa. Seriously, once we took pictures, we were ready to leave. Then we took the high speed train (1 1/2 hours) to Rome & stayed for 7 nights. Might want to just enjoy Rome, or at the very least, spend all day in Florence. Have a great vacation whatever you decide!\nCin cin 🥂🍷🍷"}, {"username": "Phyllis Snyder", "comment_text": "Florence yes- skip Pisa."}, {"username": "Charleen Siegler Schuss", "comment_text": "Forget Pisa and I think there is more than enough to see and do in Rome. Save Florence for next time"}, {"username": "Lucy Gifoli", "comment_text": "F"}, {"username": "Patti Bauman Widener", "comment_text": "There is so much to see and do in Rome, I personally would spend the time there, and then get to Florence, where there is much to see and do. Pisa is a great day trip to Florence.\nThat being said, the high speed train from Rome to Florence is about 2 1/2 hrs.???? Easy to take an early train to Florence and spend the day there, come back in the evening. You will need reservations for the Accademia."}, {"username": "Robin Burrell", "comment_text": "Skip Pisa, just go to Florence"}, {"username": "Karen Blackmore", "comment_text": "My adult children did a day trip to Florence from Rome and loved it. Make sure you get a fast train and get up early, back in the evening. Hubby and I decided to stay in Rome and save Florence for another trip! We're from the UK."}, {"username": "Gillian O'Callaghan", "comment_text": "Yes go....loved Pisa and quick trip then to Florence. Enjoy and return after dinner."}, {"username": "Kathy Flood", "comment_text": "Skip pisa"}, {"username": "Erin Scott", "comment_text": "Shelby"}, {"username": "Pam Armenia O'Brien", "comment_text": "Skip Pisa and spend time in Florence"}, {"username": "Jeanne Mistler Buring", "comment_text": "Skip Pisa"}, {"username": "Roe Gallo Saks", "comment_text": "Pass on Pisa. Not worth your time."}, {"username": "John Liddi", "comment_text": "Stay in Rome. So much to see and do there."}, {"username": "Colleen Jennings", "comment_text": "Skip Pisa. The only thing to see is the Tower & it’s a good 45 mins walk from the train station. The area around it is full of tatty stalls. Spend the time in Firenze & get the most of your awayday from Rome."}, {"username": "Ann Brahmani Bost", "comment_text": "Be sure you get tickets in advance to see David."}, {"username": "Shelly Brost", "comment_text": "More time in Florence if you can, it is a very special place and Pisa does not compare in my opinion"}, {"username": "Chrystal Stevens Bisonet", "comment_text": "Yes it’s all doable! How badly do you want to see Pisa? I know it’s at the top of my 12 year old son’s list, so we’re going! 😀"}, {"username": "Suzanne Mills", "comment_text": "Pisa is a complete waste of time. More Florence!"}, {"username": "Nicki Trueman", "comment_text": "There is about a 30-40 min walk from the Pisa centrale train station to the actual leaning tower. We just came from there and the humidity was…. intense 🥵 you’ll be dripping buckets by the time you get from the train station to the tower.\nIn saying that, Pisa is such a charming little place. We spent 5 days there and loved the slow pace. If you’re going just for a photo op, not worth it but if you can take time there it’s beautiful."}, {"username": "Gina Palmerio De Carmo", "comment_text": "Skip Pisa. I literally went to tower from the train station, saw it and went back to the station. 🤷‍♀️"}, {"username": "MaeLeigh Cf Cervantes", "comment_text": "No. Florence needs a min of 2 days. Pisa can be a half day"}, {"username": "Rebecca Goldsmith", "comment_text": "It’s your holiday if you want to see Pisa go and see it 😁"}, {"username": "Marcel J. Lisi", "comment_text": "Just go to Florence. Make sure you have purchased tickets ahead of time."}, {"username": "Wendy Harrison", "comment_text": "I would skip Pisa"}, {"username": "Yvette Pavone", "comment_text": "There is NOTHING to see in Pisa BUT the tower! Go there and then on to Florence. You can make reservations for both. Good of Pisa first see the tower, train to Florence, SC David and then spend the day exploring! There are tons of trains in Florence to grow so you can even take a train at 9 o’clock at night after dinner"}, {"username": "Bonnie Loftspring", "comment_text": "Don’t rush just to see, that’s what postcards are for. Go to Florence, immerse yourself, feel it, take some tours, explore & enjoy."}, {"username": "Enrica Palla", "comment_text": "Skip Pisa, you don't have enough time. And even so, just one day in Florence is not worth it."}, {"username": "Lisa Kelly", "comment_text": "Not doable. Skip Pisa."}, {"username": "Thomas Wight", "comment_text": "Agree"}, {"username": "Lisa Abrams Argento", "comment_text": "Skip Pisa."}, {"username": "Nikki Livingston", "comment_text": "Skip Pisa"}, {"username": "Karen Schmidt", "comment_text": "Pisa is NOT worth that amount of effort. There is so much to see in Rome. 3 days/4 nights is really easy to fill. Even going to Florence will eat up most of one day just travelling. Consider going on a booked tour to some cute villages with a beautiful lunch somewhere. Less stress"}, {"username": "Ildiko Gyimesi Mikos", "comment_text": "I would just go to Florence and skip Pisa if you only have one day."}, {"username": "Brian Osman", "comment_text": "I wouldn't bother with Pisa, but up to you"}, {"username": "Annette Mayer", "comment_text": "Pisa is a one picture and go. Save it for another trip. Rome and Florence need time to savor"}, {"username": "Cindy Sguazzin", "comment_text": "Forget Pisa! A one-trick pony!"}, {"username": "Carol Taylor Tisdale", "comment_text": "Personally… I’d skip Pisa."}, {"username": "Ryan Mills", "comment_text": "Skip Pisa"}, {"username": "Nikki Blosser", "comment_text": "I wouldn’t bother with Pisa. Florence must not be missed!"}, {"username": "Felicia LoCascio Whitney", "comment_text": "Pisa was my least favorite. I would skip. Now, Florence is amazing!"}, {"username": "Donna Gilardone Szwabowski", "comment_text": "Skip Pisa, spend the time in Florence"}, {"username": "Diane Plott Miller", "comment_text": "Yes, very much so. We did it."}, {"username": "Lori Moratto", "comment_text": "Agree re: Pisa. Ten minutes is enough."}, {"username": "Rita Kanten", "comment_text": "Don't waste you time with Pisa."}, {"username": "Lucy Thornton", "comment_text": "Skip Pisa, do Florence absolutely amazing city"}, {"username": "Kate Carberry Ansart", "comment_text": "Rome and Florence are both amazing cities. If you only have 4 nights, I would stay in Rome. There is so much to see and do there!"}, {"username": "Ken Lerch", "comment_text": "The whole plan is ill-advised on numerous levels."}, {"username": "Jovita Ferro Poth", "comment_text": "Yes it's doable and if you want to see Pisa, see Pisa. It your trip, I wish I had."}, {"username": "Mary Fortura", "comment_text": "Skip Pisa, definitely go to Florence. But, 1 day in Florence is not enough."}, {"username": "Mary Lou Gillen", "comment_text": "Pisa is not worth wasting time over. Once you see The leaning tower and take a few pictures that’s it. There are no other sights to see."}, {"username": "Julia Muller", "comment_text": "Personal opinion, but I’d skip Pisa and just enjoy Florence as much as possible in your one day outing 😊"}, {"username": "Nancy Koehler Barboni", "comment_text": "Skip Pisa!"}, {"username": "Beth Pesta McGuire", "comment_text": "Even if you had the time, I would skip Pisa."}, {"username": "Jill Medrano Casey", "comment_text": "Yup. Skip Pisa."}, {"username": "Diane Petonito Giordano", "comment_text": "There isn’t to much to do in Pisa just the leaning tower. Stay in Florence & also go to the Uffizi museum"}]}, {"id": "2193889554343456", "text": "#isolabella#lagomaggiore #lago #lake #instagood #instagram #instadaily #instamood #travel #travelgram #travelphotography #viaggiare #milano #torino #roma #reels #reelsinstagram #reelsviral #vintage #isola #barca #italy #italia #italy🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2193889554343456/", "likes": 1, "comments": [{"username": "Manuela Bussler Sweeney", "comment_text": "I've been there. It's a gorgeous area!"}]}, {"id": "2193890594343352", "text": "I thought I saw something go by about needing swim caps for the pools in Italy. Is this generally required? Are they strict about it? I’ve never worn one anywhere in the states.", "link": "facebook.com/groups/1373361046396315/permalink/2193890594343352/", "likes": 4, "comments": [{"username": "Alla Zats", "comment_text": "Caps are required in terme (hot springs) not in hotel pools."}, {"username": "Paula Brink", "comment_text": "Yes it is a requirement, in public pools and campsites, not hotel pools."}, {"username": "Vivien Paulik", "comment_text": "In the hotel pools not"}, {"username": "Tina Santos", "comment_text": "Thanks all!"}, {"username": "Hollie Barcheck Juersivich", "comment_text": "What about beaches"}, {"username": "Brian Osman", "comment_text": "Not very strict about it, actually never saw any wear one"}, {"username": "Jojo Hanna", "comment_text": "I’m sure I have read posts from people having to have a cap to use hotel pool."}, {"username": "Jaime Moeller", "comment_text": "We got kicked out if a pool in a beach club bc we didn't have one on"}, {"username": "Frank Hunt", "comment_text": "One place I stayed at was anal about caps."}, {"username": "Eniale Doylie", "comment_text": "We didn’t need one at the thermal spas or in our campsite this year but the time prior to that the campsite insisted they were work in the pool - even form my husband who has no hair! So we didn’t use the pool - no way does my hair fit in a swim cap it was too much palava for us we just went to the lake!"}, {"username": "Cat Furness", "comment_text": "Yes each time I use a pool a cap was required."}, {"username": "Gina Johannes", "comment_text": "Not at the hotel pool in Florence that we just left"}, {"username": "Jenny McDannell", "comment_text": "Our hotel in Naples required a swim cap, but they also provided them (although you also had to pay to use the pool)"}, {"username": "Lauren-Jade Roberts", "comment_text": "We paid to use the pool at a hotel in Rome and you had to use a cap. Actually quite good for keeping the sun off your scalp 😂"}, {"username": "Wolly Valentina Losi", "comment_text": "Vanno indossate quasi ovunque nelle piscine."}, {"username": "Judy Jamieson Pisano", "comment_text": "We needed them at the Poseidon thermal spa in Ischia."}, {"username": "Edoardo Dezani", "comment_text": "Requested in public pools"}, {"username": "Anne Davidson", "comment_text": "My experience was they were strict about it at pools. Buy the caps. It’s not worth taking a chance and not being allowed to swim."}, {"username": "Shelly Zaper Walton", "comment_text": "We needed them. Just ask for Cuffia? and they will tell you if you need one or not"}, {"username": "Ruth Pellow", "comment_text": "I have to wear one at the hotel I will be staying at. Already had an email telling me."}, {"username": "Silvia Bindi", "comment_text": "Sometimes it's required so bring it with you"}, {"username": "Jacquie Johnston", "comment_text": "Was in Rome, Naples, Florence, Venice never saw anyone or heard anything about caps in the pool. Where did you hear that?"}, {"username": "Evelyn Brown", "comment_text": "Depends where you are. Our hotel in Ischia required caps. We ran into that in France as well."}, {"username": "Denise Mosby", "comment_text": "They required one at the public pool we went to on Lake Como. But they sold them so I just purchased one for my daughter."}, {"username": "Tina Santos", "comment_text": "I think I’ll wait and buy them in Italy if needed. What kind of stores sell them?"}, {"username": "Monica Miller Conner", "comment_text": "Winn"}]}]