[{"id": "2206814743050937", "text": "Hello everyone! Anyone visiting Capris on 6th August? 🙂 I am solo traveling to the island, therefore would be very nice to catch up with someone!", "link": "facebook.com/groups/1373361046396315/permalink/2206814743050937/", "likes": 0, "comments": []}, {"id": "2206817823050629", "text": "Does anyone know how to order and pay for something on Amazon.it but using a US credit card? I have an Amazon.com account, no need to pay shipping from us to Italy, would\nPrefer to just buy from Amazon Italy but seems I can’t pay w same method as my us account?", "link": "facebook.com/groups/1373361046396315/permalink/2206817823050629/", "likes": 2, "comments": []}, {"id": "2206819329717145", "text": "Is it possible to take full size luggage on the funicular in Capri?", "link": "facebook.com/groups/1373361046396315/permalink/2206819329717145/", "likes": 2, "comments": [{"username": "Vivien Paulik", "comment_text": "\"Passengers on Capri's public transportation are allowed one piece of luggage per person, weighing a maximum of 10 kg and measuring 23cm x 30cm x 50cm (roughly the size of a carry-on bag). To transport your bag, you must pay a supplement. Bags larger than the maximum allowance can be transported by porter service or taxi. All baby strollers and carriages must be folded before boarding buses or the funicular.\"\nhttps://\nwww.capri.net/\nen/e/\ngetting-around"}, {"username": "Miyuki Kanno Paul", "comment_text": "NO. You must arrange your luggage transportation to your hotel. Your hotel provides the info. Probably €10-15. You are prohibited from taking your suitcase/full luggage on the funicular"}, {"username": "Michael Barnes", "comment_text": "Absolutely."}, {"username": "John Bruckman", "comment_text": "No… your hotel will have a rep at the ferry and they will take your bags. Do not take your luggage with you!!!"}, {"username": "Jerry Scaglione", "comment_text": "You have to take it on the funiculli."}, {"username": "Jacqueline Cree", "comment_text": "No. You have to use the baggage transfer. You can take a small case (airline carry on size)."}, {"username": "Jacqueline Cree", "comment_text": "We spent 5 nights in Naples and went to Capri for 2 nights. We left most of our luggage at the hotel in Naples and took a small case with us to Capri. Was so much easier and we picked up our luggage on our return to Naples to get our flight home."}, {"username": "Susan Lowry Lamb", "comment_text": "Hey Robin, pack what you want."}, {"username": "Yvonne Jones", "comment_text": "Yes you can. Get in the first carriage, when it stops at the top, don't get out with everyone else, take the opposite door (where people are getting on) and use the lift."}]}, {"id": "2206821309716947", "text": "Suggestions for transportation/\nday trip for private driver Sorrento, amalfi , Positano.\nHotel quoted $880.", "link": "facebook.com/groups/1373361046396315/permalink/2206821309716947/", "likes": 3, "comments": [{"username": "Liz Marikian-Falvey", "comment_text": "Where are you coming from?"}, {"username": "Ibbu Mohd", "comment_text": "Great service and good driver. Very reasonable price, AC/ mercedes van."}, {"username": "Christine Golia Brigida", "comment_text": "Amalfidrive4you"}, {"username": "Heather Sechrist", "comment_text": "Transferrelax was 400 euros for 8 hours."}, {"username": "Karen Espinoza", "comment_text": "Raffaele Giordano He is the best."}, {"username": "Bev Madill", "comment_text": "I used Transferelax in June. Great company."}, {"username": "Teri Haskins", "comment_text": "Banana Joe Limo"}, {"username": "John Spensieri", "comment_text": "Definitely get a driver for a trip from Sorrento to Positano. The winding roads are scary🙉"}, {"username": "निनावी सहभागी", "comment_text": "Thank you"}, {"username": "Graham Sherlock", "comment_text": "Ferries"}, {"username": "Melissa Hunt", "comment_text": "Sorrento coast drivers is a full day of Amalfi coast for 350 euros."}, {"username": "Carm Wilson", "comment_text": "Lisa Scharmann"}, {"username": "Cheryl Kavanagh", "comment_text": "Hi no to much, look up get your guide, I booked a mini bus, for Capri pick up and drop off from the hotel at Sorrento, all day $130.00 per adult 🙂"}, {"username": "Andrew Brigida", "comment_text": "Andrew Brigida"}, {"username": "Nancy Francis", "comment_text": "F"}, {"username": "Pam Burkardt", "comment_text": "Romeinlimo.com"}]}, {"id": "2206823213050090", "text": "Mount Vesuvius 🩵", "link": "facebook.com/groups/1373361046396315/permalink/2206823213050090/", "likes": 5, "comments": [{"username": "Chelsea Gudith", "comment_text": "Omg 💕💕💕"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2206823686383376", "text": "Any good Italian brand make up & skincare to check out during my upcoming trip? Items I wouldn’t really find in the US.", "link": "facebook.com/groups/1373361046396315/permalink/2206823686383376/", "likes": 155, "comments": [{"username": "Sara Gilardi", "comment_text": "Avene (it's Frech but widely spread in Italy), Santa Maria Novella products (Florence)"}, {"username": "Virginie Devos", "comment_text": "Kiko is top"}, {"username": "Lizzie Thompson", "comment_text": "If ur going to rome pop into Doctor G skin care shop.. he's amazing. He work on this own brand for 3 years and I genuinely wouldn't go past it.."}, {"username": "Lisa Williams", "comment_text": "Ortigia"}, {"username": "Figen Dayan", "comment_text": "Comfort Zone best brand for Skin. Its Italian and sustainable"}, {"username": "Andrea Kroposki", "comment_text": "following"}, {"username": "Kelly Hanberg Rosati", "comment_text": "I love Caudalie, which is French but can be found in Italy."}, {"username": "Lucrezia Folger", "comment_text": "Go into the Coin dept store. many Italian brands of make-up or Kiko's Makeup store, or at the airport in Italy, duty free."}, {"username": "Gloria Zec Koprcina", "comment_text": "Kiko Milano\n\nIt is an Italian professional cosmetics brand that features a range of cutting-edge makeup, face and body treatments. Safe and effective products of the highest quality, created to satisfy the beauty requirements of women of any age."}, {"username": "Irene Oda", "comment_text": "Follow..."}, {"username": "Deborah Jones", "comment_text": "Davines hair products are the best. They also make comfort zone skin care"}, {"username": "Deborah Jones", "comment_text": "If you’re going to Florence you should go to the oldest pharmacy in Florence. They made Catherine Medici perfume here before she went off to marry the king of France. It’s called Acqua Della Regina. https://\nmaps.app.goo.gl/\nHB4Xjac5vovaQsq2\n9?g_st=ic"}, {"username": "Patricia Savage", "comment_text": "Andrea bocelli line"}, {"username": "Gina Romano Peralta", "comment_text": "Following"}, {"username": "Margaret Allen Oskorep", "comment_text": "Following"}, {"username": "Željka Bandalo", "comment_text": "Collistar"}, {"username": "Linda Barba", "comment_text": "Westman Atelier"}, {"username": "Dawn Lynch", "comment_text": "Following"}, {"username": "Esther Starren", "comment_text": "Kiko"}, {"username": "Shelly Stowell", "comment_text": "Wycon"}, {"username": "Robin Lee Simmons", "comment_text": "Kiko is fun for makeup and you can reorder online in the states"}, {"username": "Angelie Karako", "comment_text": "Thank you all! I'm so excited to check out these brands, I haven't heard of any of them before!"}, {"username": "Mimi Frederiksen", "comment_text": "Do they make Borghese anymore???"}, {"username": "Melanie Fay Wais", "comment_text": "Aqua di Parma Mediterraneano Blu is a cologne that smells amazing. You can get it at high end stores in the states but probably cheaper there. They are all in a blue bottle and have different fragrances."}, {"username": "Geraldo Prioriello", "comment_text": "Kiko"}, {"username": "Christine Brookbank-Swider", "comment_text": "Carbaline in Venice"}, {"username": "Lana Irqsusi", "comment_text": "Following"}, {"username": "Ashley Czinege", "comment_text": "PUPA Milano has amazing products!\n\nYou can find them at independent stores or inside Tigota or Douglas here.\n\nhttps://\nwww.pupa.it/home"}, {"username": "Tiffany Michalak", "comment_text": "Following"}, {"username": "Stephanie Sposato", "comment_text": "Following"}]}, {"id": "2206826849716393", "text": "Any suggestions for a. hotel one of the Cinque terre towns. We each have a torn meniscus but we soldier on.", "link": "facebook.com/groups/1373361046396315/permalink/2206826849716393/", "likes": 2, "comments": [{"username": "Robert Sullivan", "comment_text": "Nice hotels seem to be scarce.we opted to stay in Santa Maria Liguroia"}, {"username": "Kate Mancuso", "comment_text": "Soldier on! 👊🏻"}, {"username": "Bonnie Brauner", "comment_text": "Following"}, {"username": "Bonnie Brauner", "comment_text": "I chose the Poet Hotel in La Spezia. Supposedly a short flat walk to and from train to Cinque Terre. Not going until early October"}, {"username": "Maria Falcone Sedgwick", "comment_text": "Very few hotels in the 5 towns. You will need to opt for a guesthouse/\nAirbnb. Years ago we hiked into Vernazza and just asked at each of the local establishments and found a place. Now you’ll want to book well in advance. But if you find a place take it. Staying in the towns when the tourists are gone is amazing."}, {"username": "Franki Sbrocca Leonard", "comment_text": "Hotel Margherita Monterosso 🍋"}, {"username": "Anna Buchan", "comment_text": "Il colie monterosso"}, {"username": "Kathy Whiting", "comment_text": "Stay in Rapello plenty of hotels and u can train or ferry to any of the towns very easy and flat"}, {"username": "Jodi Gowler", "comment_text": "We stayed in La Spezia and trained. Very easy"}, {"username": "Leslie Stacy Peterson", "comment_text": "StellaDella Marina, Monterosso."}, {"username": "Janice Finn Clemans", "comment_text": "Hotel Cinque Terre - Monterosso"}]}, {"id": "2206828039716274", "text": "What’s the best way to get to the airport from Venice please", "link": "facebook.com/groups/1373361046396315/permalink/2206828039716274/", "likes": 9, "comments": [{"username": "Iman Nazaran", "comment_text": "Following"}, {"username": "Dana Golden", "comment_text": "I used private water taxi. Expensive but 007-ish!"}, {"username": "Yuko Y Smith", "comment_text": "Water bus, water taxi"}, {"username": "Ian Beyer", "comment_text": "Which airport? Rome, it’s best to take the train."}, {"username": "Becky Schneider", "comment_text": "I agree with the water taxi. Fun and fast experience"}, {"username": "Lucy Bailey", "comment_text": "Alilaguna worked amazing well, no need to splurge on a water taxi."}, {"username": "Michelle Howard", "comment_text": "From airport to Venice do you need to reserve water taxi in advance?"}, {"username": "Pat Beaulieu Hickey", "comment_text": "Using water taxi"}, {"username": "Alondra Martínez", "comment_text": "Mariana Garduño"}, {"username": "Catherine Tucker Cormick", "comment_text": "Are water taxis available around 5:30 am?"}, {"username": "John Bruckman", "comment_text": "There’s public transportation by boat or a water taxi which is private but quite $$$"}, {"username": "Mike Adams", "comment_text": "Water taxi. A lil expensive . But fast , direct and wicked cool!"}, {"username": "Kelly Jones", "comment_text": "For a family of 5 we paid 50 euro for a Mercedes van - 30 mins to airport"}, {"username": "Casarine Temple", "comment_text": "We booked private water taxi through our hotel. The cost is 150 Euro’s."}, {"username": "Natalie J DeRasmi Saeger", "comment_text": "Boat"}, {"username": "Cassie Ryan", "comment_text": "We took a water taxi and loved it!"}, {"username": "Renee Rosolino", "comment_text": "Following"}, {"username": "Heather Hills Jacobs", "comment_text": "Get your guide app!!!!"}, {"username": "Lane West", "comment_text": "Boat taxi"}, {"username": "Sanghamitra Sahu", "comment_text": "Ask your hotel to call a taxi. If your are close to that Taxi coming location then you can walk with your luggage. Taco will cost $100 and it will take 20 minutes to the airport. Yesterday we came back from Venice. We were staying in the hotel Paisania. We walked 10 minutes with our luggage and took the taxi. If your hotel is far away from the taxi coming location then take the water taxi to the car location and then take the taxi.\nIf you take the water taxi to the airport it will take more than an hour and it will cost close to $200"}, {"username": "Lesley Stewart-D'Ortenzio", "comment_text": "Just home from Venice- Alilaguna is cheap buts it's 1.5 hrs to airport-we took a water taxi was £130.00. Was expensive but 30 minutes. We took it from San Marco"}, {"username": "Lalita PosBa", "comment_text": "Take a bus or taxi from the bus station. Taxis are 24 available. Make sure to ask them if they take credit card and they are in the line by the the Taxi sign."}, {"username": "Lisa Valdovinos", "comment_text": "Private water taxi. So worth it!!"}, {"username": "Jeff McLellan", "comment_text": "Water taxi"}, {"username": "Robyn Green", "comment_text": "Yes we did the private boat to the airport, loved it , expensive but what an experience, felt like Angelina Jolie in the Tourist, so worth it👍😊🥂"}, {"username": "Kelly Tabor", "comment_text": "Water taxi. A lovely way to bid farewell to that beautiful city."}, {"username": "Colin Ng", "comment_text": "F"}, {"username": "Pär Wassholm", "comment_text": "I'm going to Venice in september and will use taxi. It only takes 20-30 minutes and not as expensive as an water taxi."}, {"username": "Maryann Collidge", "comment_text": "We had an early morning flight so I booked a private water taxi. We had the canal to ourselves, not a person in sight.. it was truly magical and the moon lit up the Rialto."}, {"username": "Kathleen Roll", "comment_text": "Bus to the vaporetto then vaporetto down the canal.\nYou can buy a multi day travel ticket at the airport, so you can go on and off the vaporetto as often as you want and get back to Marco Polo airport.\nVery economic and a lot of fun."}, {"username": "Theresa Salerno Adams", "comment_text": "Water taxi"}, {"username": "Mike Guluk", "comment_text": "Water taxi"}, {"username": "Sharon Roberts Crossley", "comment_text": "Water taxi aka boat"}, {"username": "Rosemarie Mahoney", "comment_text": "Water taxi"}, {"username": "Karen Schmidt", "comment_text": "Alilaguna is the direct boat service and it can take about an hour from the centre of Venice to the airport"}, {"username": "Carol Taylor Tisdale", "comment_text": "Either private water taxi or Alilaguna."}, {"username": "Rhonda Allen", "comment_text": "Water taxi"}, {"username": "Dave Colleen", "comment_text": "Water taxi for a splurge"}, {"username": "Jessica Morse Hall", "comment_text": "Private water taxi!"}, {"username": "Frances Scannapieco", "comment_text": "Water taxi"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Depends on where your hotel is located."}, {"username": "Ari Sun", "comment_text": "Private water taxi."}, {"username": "Ann Law", "comment_text": "There are several small towns and hotels within 5 miles of the airport on the mainland. Staying on the mainland will be a lot easier getting to the airport."}, {"username": "Beatriz Davalos Moreno", "comment_text": "We took a water taxi it took about 40 minutes and we were charged 160 Euros, we were told by land it would take about 2 hours!"}]}, {"id": "2206828346382910", "text": "Bucket list trip to Italy for 3 couples in May 2024. We are doing Rome (3 nights),Florence(4 Nights) and Amalfi Coast(6 nights). We booked an Airbnb in Vico Equense for an Amalfi base. Is this a good location to hit all the sites. No car.We would like to go to Capri, Pompeii and Positano etc.Can anyone recommend any restaurants in Vico Equense. Also any recommendations for a cook to come to our place and cook a meal. Thanks in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2206828346382910/", "likes": 12, "comments": [{"username": "Diane Davis Lawyer", "comment_text": "Hmmm...I think the only ways to get there are by private transfer, bus, or the local train. Have you checked to see if any ferries leave out of that location, or buses up the coast? I looked at so many in the surrounding area of Sorrento and opted for Sant'Agnello as it's one train stop over and even walkable to Sorrento if we were feeling particularly energetic. Sorrento offers ferries to all of the Amalfi coast towns and Capri so we chose to find a place easily accessible to transportation and Sorrento."}, {"username": "Miyuki Kanno Paul", "comment_text": "You have to take a train to Sorrento for Capri and Positano(and all the Amalfi coast access). Vico Equense is a nice area to relax and enjoy the home of Provolone del Monaco DOP, the crucial mandatory ingredient for Spaghetti alla Nerano. However, it is only Circumvesuviana\nSorrento Line serves the station. Easy access to all the Vesuvian ruins by hoping on the train all the way to Napoli"}, {"username": "Chiara Normanno", "comment_text": "Mmh I don’t think Vico Equense is a strategic spot, especially without a car unless you're looking for a private driver. May I also suggest 4 days in Rome and 3 in Florence?"}, {"username": "David Montoya", "comment_text": "Any particular reason that you would suggest 4 days in Rome and 3 in Florence. Thanks"}, {"username": "Alicia Cox", "comment_text": "Sorrento is a great location for Pompeii, Capri, & Amalfi & is beautiful on its own."}, {"username": "Alicia Cox", "comment_text": "If u keep 4 nights in Florence, hopefully you see Tuscany for 2 of the days, but might need a car or tour or driver - but check trains too - just not sure about all the stops. But some awesome small towns in Tuscany - Lucca, Volterre, San Giamignano, Sienna"}, {"username": "Paola Bobko", "comment_text": "I am not sure Vico equense being a strategic location to visit the sites You intend to. If you chose it for budget reasons, I would advise to look into Salerno instead. Salerno is easily accessible from Rome with a high speed train and you can use it as a base to visit all the towns on the coast. There are direct ferries to Amalfi, Positano, Capri.\nAlso I would suggest to do 4nights in Rome and 3 in Florence. Florence is much smaller, distance are shorter and more walkable than Rome."}, {"username": "Tam Wong", "comment_text": "Better off staying in Salerno and more days in Rome then Florence. 4 days minimum in Rome."}, {"username": "Julia Jacobie", "comment_text": "If you don’t have a car I would definitely agree with those that have suggested Sorrento instead. Ferries all along the coast plus to Capri, Naples and Ischia etc. also buses along the Amalfi Coast road, plus the Circumvesuviana\ntrain to Naples. It’s not the nicest of trains but it’s ok"}, {"username": "Kyle Cook", "comment_text": "I also think maybe more nights in Rome than Florence. Florence is nice, Tuscany is beautiful, definitely do a day tour to a winery and other cities around Tuscany. But Rome has SO much. Tours, sight seeing, eating, attractions. It’s wonderful. I also went in early March. You’ll enjoy the weather and less people(but still lots of people lol)\n\nAlso, leaving out Venice? 😱 lol I could never. But I also am different and don’t see too much culturally significant about visiting Amalfi Coast… maybe just pretty views?"}, {"username": "Fiona Mac", "comment_text": "Vico equense very steep go to sorrento"}, {"username": "Bill Gillespie", "comment_text": "I would take away a night from Florence and give it to Rome. As much as I love Vico Equense because of the great restaurant \"Pizza A Metro\" I would change my Amalfi home base to Sorrento. From Sorrento, access to Capri and the rest of the coast is much more accessible. I'm sorry to hear you left out Naples, my home for 4 years, it's a Jewel of history, food, culture, amazement, I could go on and on. My home away from home is the Amazing Ravello. I've traveled in Europe during my 4 years living there and in the last 40 years. This year my wife and I went to Southern France and have concluded, Italy is where we will go from now on. In April next year, back to Ravello, Naples and Sicily. You'll be back, Italy, the people, food, culture , history is freaking awesome."}, {"username": "Steve Grossman", "comment_text": "We've stayed there in vico equence, and it's a good idea if you want to keep paying for taxis to go back and forth into sorrento. We had a car and the parking Was difficult. That's the skinny of it"}, {"username": "Jeff McLellan", "comment_text": "If it is bucket list I would say base yourself on Capri for three or four nights and hire boats to get you to Amalfi, Positano, Sorrento and Furore.\n\nCapri is the only place down there that we said we would stay when we go back. Loved it after the day trippers left."}, {"username": "Jenny Payne", "comment_text": "Ask your airb&b host they will know a cook who does that, I usually go to there house in most cities in Italy 🌻"}, {"username": "Jazz Caldwell", "comment_text": "Instead of having someone come to cook for you - how about taking a cooking class together!"}, {"username": "Jennifer Gustafson", "comment_text": "We took train from Salerno and then ferry to Amalfi, but we stayed in Conca dei Marini. Conca was absolutely stunning but it was harder to navigate from there. I would recommend Amalfi as the base because then it’s easier to catch buses or taxis to get around. Wherever you go on the coast be prepared for walking and lots of steps I mean a lot!"}, {"username": "Elena Eckley", "comment_text": "Try to go to ISHCHIA"}, {"username": "Maria Urdi", "comment_text": "I don’t know where that is but we stayed in Minori and it was a perfect base!!"}, {"username": "Rachael Richardson", "comment_text": "We loved Vico Equense ! Stayed 3 nights a great base.\nBistrot la piazzeta is down a back street Vico forne, and pub de grotte d’angio on the front were both delicious !\nAlso do the cable car one stop on train from Vico , it’s got amazing views castellammare"}, {"username": "Rachael Richardson", "comment_text": "Also the sunset in vico is amazing ! We took a beer down to the viewing point and enjoyed the sunset every night"}, {"username": "David Montoya", "comment_text": "Thank you all for the information"}, {"username": "Rich LeBlanc", "comment_text": "We just went to Italy last year. We did 3 nights in Rome. We needed one more as we did not get to see everything. Our home base for Almafi was Sorrento. There are ferry boats there to all the amalfi coast locations Poisitano, Amalfi, Ravello ect. Sorrento itself is beautiful as well. We did not do Florence. We did 3 nights in Tuscany. You will need a car if you wish to venture from Florence to Tuscany. All those medieval towns are 45 minutes to an hour from one another but we'll worth it. Go BEARS!!!"}]}, {"id": "2206749639724114", "text": "We have a secret for you…The magical land of Narnia exists!\nHistorically known as Narnia in Latin, Narni is an enchanting Umbrian village famous for being the geographical center of Italy and for havingआणखी inspired C.S. Lewis in the creation of his “Chronicles of Narnia“.\nJoin our NEW virtual experience: https://nextstop-italy.com/virtual-tours/narni/\n\n#virtualworld #artlovers #art #vacationmood #history #italyiloveyou #italygram #italytravel #italytrip #medieval #medievalhistory #medievalart #medievalcastle #medievaltimes #medievalarchitecture #narni #narnia #chroniclesofnarnia #chroniclesofnarnia #hiddengems #hiddenplaces #magicalplaces #MagicalAtmosphere #umbria #umbriagram #umbrialovers #umbriatourism", "link": "facebook.com/groups/1373361046396315/permalink/2206749639724114/", "likes": 7, "comments": []}, {"id": "2206637493068662", "text": "Il Colosseo di Roma\n\n📷 Severina Carro Simbulan", "link": "facebook.com/groups/1373361046396315/permalink/2206637493068662/", "likes": 25, "comments": [{"username": "Carey Matthews", "comment_text": "Carey Matthews"}, {"username": "D Rochelle Milton", "comment_text": "Hmm looks like the same guy in the Leaning Tower pic… stomping it, that is."}]}, {"id": "2206720879726990", "text": "Beautiful Amalfi at night", "link": "facebook.com/groups/1373361046396315/permalink/2206720879726990/", "likes": 629, "comments": [{"username": "Teona Cholokava", "comment_text": "♥️"}, {"username": "Pam Borchert Wildrick", "comment_text": "Very nice. Lovely place to visit. Love the lights..even high up"}, {"username": "Laura Callahan", "comment_text": "I’d love to go to the Amalfi coast in Italy 🇮🇹 😊❤️💃"}, {"username": "Lori Lytle", "comment_text": "Love it! ❤️"}, {"username": "Andy Parnell", "comment_text": "I’m going here"}, {"username": "Maria Dalli", "comment_text": "Lucas Pace"}, {"username": "Michelle Borgh", "comment_text": "So beautiful!!!"}, {"username": "Maria Meloni", "comment_text": "Maria Meloni"}, {"username": "Candis Morgan", "comment_text": "Bernie Morgan us soon x"}, {"username": "Ally Naylor", "comment_text": "Di Coppick-Naylor"}, {"username": "Ahmed Nagy Kiwan", "comment_text": "Ahmed Nagy Kiwan"}, {"username": "Roz Fawcett", "comment_text": "The hotel we stayed at in June , I’d recommend"}, {"username": "Shelly Mullins", "comment_text": "Julie Pinnell"}, {"username": "Kellie Stone Wells", "comment_text": "Cassandra Blanchard"}, {"username": "Virginia Sudol", "comment_text": "Virginia Sudol"}, {"username": "Sandra Robinson", "comment_text": "Margaret Moseley 💕"}, {"username": "Shailesh Jadhav", "comment_text": "Shailesh Jadhav"}, {"username": "Ann Watkin", "comment_text": "Susan Wylie"}, {"username": "Violetta Jasik", "comment_text": "Violetta Jasik"}, {"username": "Mylene Hunt", "comment_text": "Rebekkah Hunt. How beautiful"}, {"username": "Debra Evans", "comment_text": "Debra Evans"}, {"username": "Melissa Rapa", "comment_text": "Katherine Galea"}, {"username": "Paco Cabal", "comment_text": "Paco Cabal"}, {"username": "Cecilia Chavez", "comment_text": "Cecilia Chavez"}, {"username": "Shauna Lynn", "comment_text": "Ina Ryder amalfi coast ❤️"}, {"username": "Dyli Kei", "comment_text": "Meravigliosa 🌺💎"}]}, {"id": "2206719573060454", "text": "Positano - Amalfi Coast", "link": "facebook.com/groups/1373361046396315/permalink/2206719573060454/", "likes": 525, "comments": [{"username": "Wanda Vicari", "comment_text": "Beautiful"}, {"username": "Candis Morgan", "comment_text": "Does anyone know the name of the restaurant in the picture?"}, {"username": "Shannon Cullen", "comment_text": "Lisa Lottinville"}, {"username": "Agnese Hume", "comment_text": "Gorgeous ❤️❤️"}, {"username": "Susan Roach", "comment_text": "Beautiful Italy,loved my last holiday there,,"}, {"username": "Diane Davis Lawyer", "comment_text": "I think the downside to going to the Amalfi coast towns if you're going by ferry is you have to be finished and done before dinner (evening) time so you can catch the last ferry back to your home base (likely Sorrento.) This is something I didn't consider when we decided to not stay in one of the quaint coastal towns. Sigh. It would have been beautiful to see the towns in the moonlight in the evening."}, {"username": "Sherri Haff Benson", "comment_text": "Ok - I don’t think my heart can handle a picture as beautiful as this! I am going to Italy for the time mid September and the wait is killing me!!!! Especially after seeing this"}, {"username": "Sherri Haff Benson", "comment_text": "Please share where this shot is from 😍"}, {"username": "Yael Teitelbaum - Yankovich", "comment_text": "Dvir Yankovich"}, {"username": "Candace Beutell Gardner", "comment_text": "We skipped the Amalfi tour and spent the day wandering around Sorento. So nice to stretch our legs and enjoy looking in small stores, eating at local restaurants."}, {"username": "Angela Hooper", "comment_text": "Breathtaking!"}, {"username": "Rosalie Rusty Armour", "comment_text": "Rosalie Rusty Armour"}, {"username": "Josephine Campaneria", "comment_text": "Breathtaking!!"}, {"username": "Megs Fox", "comment_text": "Jake Cunnington this is a dream"}, {"username": "Liza Vega Santos", "comment_text": "We were there the other day! It's the best part of our vacation in Italy I must say. Beautiful shot!"}, {"username": "Emilia Petcu Szabo Vladic", "comment_text": "Breathtaking!"}, {"username": "Dot McArdle", "comment_text": "Love it there! I could live there for sure"}, {"username": "Nora K Brown", "comment_text": "Everett Brown look at this"}]}, {"id": "2206721853060226", "text": "We are going to the Amalfi coast (Amalfi, Positano, Ravello, Capri to be exact). Do we need water shoes?? Have seen so many people talking about the rocky beaches (and even rocky in the water). If we get there and need them are there places to buy them?", "link": "facebook.com/groups/1373361046396315/permalink/2206721853060226/", "likes": 12, "comments": [{"username": "Joan Belserene Forcheski", "comment_text": "Yes"}, {"username": "Anne Hoenig Steib", "comment_text": "Much more comfortable with shoes. Flip flops will float away and not stay on."}, {"username": "Ashley Czinege", "comment_text": "Yes, water shoes will be very helpful but not a must. I was in Positano and Capri at the beaches and I didn’t use them. I survived but it’s not the most comfortable walking on all of the rocks."}, {"username": "Danielle Gervais", "comment_text": "Yes"}, {"username": "Maria Antidormi Corica", "comment_text": "Yes"}, {"username": "Keri Catoe", "comment_text": "Yes. I tried without them and suffered and immediately put them back on. They sell them on the beaches and they look like they would travel easily. I brought my Teva sandals but wished I had something lighter and easier to pack."}, {"username": "Jeanette Reid", "comment_text": "Yes. Water shoes, or I wore my teva’s in the water. Not only is it rocky, but the rocks are sooooo hot."}, {"username": "Eve Tang", "comment_text": "Yes you will need them, if you don’t want to bring yours, you can always get a pair around 11-15 euros around the beach area."}, {"username": "Sadique Siddiqui", "comment_text": "Road to ravello is under maintenance, it takes long route to reach ravello"}, {"username": "Andrea Wurster Vizzari", "comment_text": "Absolutely - body glove makes good ones. So painful to walk on the rocks otherwise"}, {"username": "Nicole Faulkerson", "comment_text": "You will regret not having watershoes, sandals don't cut it."}, {"username": "Kim Sousa Andrews", "comment_text": "I was in Positano for 4 days and never used them. We had chairs in the front row though so we were just steps from the water."}, {"username": "Jennifer Avrett", "comment_text": "Either water shoes or just tough feet. Nothing in between."}, {"username": "Marty Harte", "comment_text": "I was in Positano and Amalfi last week. I took my flip flops off to go in water, thought I could walk back to chair without them. No way. That grey/black sand is like lava….super hot. I’d recommend."}, {"username": "Andrea Arango", "comment_text": "Yes it’s rocky. I wore the rubber Birkenstocks to the beach and in the water"}, {"username": "Ka Ben", "comment_text": "Yes, water shoes are recommended"}, {"username": "Ashley Morris Podraza", "comment_text": "Yes"}, {"username": "Robyn Cane", "comment_text": "Jessica Liston"}, {"username": "Marybeth Obrien", "comment_text": "Any suggestions on places to stay 3 adults in October down there 5 nights"}, {"username": "Jo Ann Schwartz Woodward", "comment_text": "Yes!"}, {"username": "Anna Gambino", "comment_text": "I would bring them. Beaches are rocky. I was glad I brought mine."}, {"username": "Denise Curtis", "comment_text": "Beth-Matthew Craft read the comments."}, {"username": "Wendy Jean", "comment_text": "Shein and Amazon have them! Going to Cinque Terre and was told by my friend who lives there to get them !"}, {"username": "Jill Tingley", "comment_text": "Yes rocky beaches. I’d bring them"}, {"username": "Anusha Perera", "comment_text": "Yes, you will need water shoes"}, {"username": "Brad Nelsen", "comment_text": "Yes."}, {"username": "Crystal Williams Mansfield", "comment_text": "Yes!"}, {"username": "Jeannine Carta Hanson", "comment_text": "Yes"}, {"username": "Rebecca Yeoh", "comment_text": "I did a lot of swimming in Positano and Capri. I would suggest some sort of footwear. It’s not when you swim, but getting out is particularly painful to navigate as you are walking up an incline of rocks on the shore. I got small bruises under my arches from Capri. I coincidently travelled with rubber sandals so I ended up wearing them whilst swimming. Even when I had front row sunbeds on Positano I needed footwear. Or, you could just take some flip flops and leave them by the shoreline for when you get out."}, {"username": "Colleen Sommerin", "comment_text": "Yep"}, {"username": "Cait Millett", "comment_text": "Following. Going there next week!"}, {"username": "Julia Salmon", "comment_text": "I was only on positano. Beach was really rocky and we had a hard time getting in and out of the water. It’s also black sand/rocks so super hot. I walked down the steps in my sneakers and just had flip flops in my backpack. Wish I brought water shoes with me"}, {"username": "Renee' DiMichele Serano", "comment_text": "Not sure if they are available there, but we just wore our flip flops, def need something to walk along.beach and in water."}, {"username": "Tam Wong", "comment_text": "It is rocky so I would say yes to water shoes"}, {"username": "Anamaria Vancea", "comment_text": "Water shoes like these can be helpful to go to and on the beach / sea https://\nwww.decathlon.ro\n/p/\nincaltaminte-acv\natica-aquagym-g\nymshoe/_/\nR-p-303973?mc=87\n96568&gclid=Cjw\nKCAjww7KmBhAyEi\nwA5-PUSktkrS53x\nX_-enYNavhmc9Ed\nVgq_GTFqkB9Ue1Q\nwMaObfdhJk42BiR\noCtLgQAvD_BwE"}]}, {"id": "2206722716393473", "text": "Hi! Can anyone recommend some non touristy restaurants in Milan? There for two nights and would love something that won’t be too long of a wait.", "link": "facebook.com/groups/1373361046396315/permalink/2206722716393473/", "likes": 5, "comments": [{"username": "Mike Guarini", "comment_text": "Following... Will be staying is Isola"}, {"username": "Ilaria Verda", "comment_text": "Trattoria del gallo in Gaggiano. Really really really good, the best cotoletta of the world, not in Milano but in surrounding"}, {"username": "Jane Lilibet", "comment_text": "Go off the touristy way look where locals are eating, don't be put off by outside appearance, if it's good enough for locals it's good enough for you."}, {"username": "Rita Levi Montalbano", "comment_text": "If you can move by car \"trattoria al laghett\" is stunning (typical milanese cusine), expecially in this season, and its close to the chiaravalle abbey so you can make a visit too"}, {"username": "Dagmar Ross", "comment_text": "Italians, and Europeans in general, like to enjoy their food with time and calm.\nTherefore, it will probably only be a tourist restaurant, which is recommended."}, {"username": "Pamela Campaner", "comment_text": "Ristorante All'Origine my favourite. 5 minutes walking distance from M3 Porta Romana subway stop"}, {"username": "Cris Wimer", "comment_text": "Globe Restaurant and Lounge Bar. Eighth floor of a commercial building. Off the beaten path. We were probably the only tourists there."}, {"username": "Tom Manno", "comment_text": "Nabucco."}, {"username": "Graham Sherlock", "comment_text": "Service in Italy is timely"}]}, {"id": "2206722759726802", "text": "Advice on what we can and can not wear in the Churches", "link": "facebook.com/groups/1373361046396315/permalink/2206722759726802/", "likes": 5, "comments": [{"username": "Lori Sammons", "comment_text": "You cannot wear shorts, sleeveless and hat. We were just in Rome and seen many people cannot get in due to clothing. Remember, your going to church."}, {"username": "Sandy Radican Shikaly", "comment_text": "No bare shoulders or knees.. or cleavage"}, {"username": "Deniz Bircan", "comment_text": "A satan costume"}, {"username": "Albert Campagna", "comment_text": "Thongs, Speedo"}, {"username": "Renee Kremesec", "comment_text": "Cover shoulders and knees"}, {"username": "Sonia Scotto Lubrano", "comment_text": "Knees and shoulders need to be covered. Nothing too low cut.\nAnd no hats"}, {"username": "Deb Porter", "comment_text": "Both men and women need knees covered, a scarf can be thrown over bare shoulders. They don’t expect you to die in line waiting to get in because of the heat. Long shorts are accepted for both men and women. I’ve seen Daisy dukes walk in with a scarf over their butts. It’s more about the $$$ than protocol."}, {"username": "Sierra Behrens Tibbetts", "comment_text": "Can men show their knees? Or is it a patriarchal, sexist rule?"}, {"username": "Jazz Caldwell", "comment_text": "I'm always grateful to see other travelers being sensitive to different environments and cultures. Sleeves, skirts and dresses not too much above the knee, and no breasts hanging out. You get the idea."}, {"username": "D'Anna Sullivan", "comment_text": "Best to cover shoulders and knees."}, {"username": "Gabrielle Mettler", "comment_text": "Sandals are ok?"}, {"username": "Steven Gosling", "comment_text": "A bright red clown costume with massive yellow shoes."}, {"username": "Rebecca Ritter", "comment_text": "No shorts no bare shoulders. I travel with a large scarf and make a long skirt for over my shorts"}, {"username": "Candace Beutell Gardner", "comment_text": "Everyone traveling outside their own country needs to be aware of places and customs that they will be visiting. Would you wear shorts when going to your regular church? Probably not. So keep those knees and shoulders covered, please. And ladies, were an appropriate blouse. I love the suggestion of bringing a scarf. That can help a lot."}, {"username": "Shannon Ganisin", "comment_text": "Pope costume"}, {"username": "Tricia O'Leary Keane", "comment_text": "We visited St Peter’s Basilica and my husband had shorts and I had a dress to my knee but not covering my knees and it was fine .. they were handing out scarfs to some ladies to cover their shoulders. This was a week ago"}, {"username": "Wendy Spano Bracco", "comment_text": "It’s shoulders and knees covered. That does not mean no shorts. If you wear shorts, they need to cover the knee. They exist if you want to go that route. But for people to say no shorts is just not true. It’s their personal spin. You can wear a sleeveless shirt but then you need a shawl."}, {"username": "Mike Ball", "comment_text": "Ah the good old what to wear on not wear in churches, like passports it’s always good for an online row 🤣"}, {"username": "Jacquie Johnston", "comment_text": "It’s easy an simple google the rules an pretend your going to church."}]}, {"id": "2206731476392597", "text": "Is Marco Polo airport easy to get through? We are flying home from there.", "link": "facebook.com/groups/1373361046396315/permalink/2206731476392597/", "likes": 3, "comments": [{"username": "Jackie Macleod", "comment_text": "Very very easy"}, {"username": "Mary Ann Baird", "comment_text": "Just flew in to Marco Polo. It was super easy and not as big as other airports."}, {"username": "Melissa Pope", "comment_text": "Thank you all for the information! Greatly appreciated!😊"}, {"username": "Laurie Frainetti", "comment_text": "Yes! Very small!"}, {"username": "Lizzie Thompson", "comment_text": "Yes it's a nice an small airport it's also a slient airport witch means that have to keep a close eye out on the bord with all the flights"}, {"username": "Frank Hunt", "comment_text": "Yes, it’s not so big."}, {"username": "Gena Diaco Penland", "comment_text": "It’s easy to navigate, but plan for some extra time. It took us a while to get there via water taxi and then the line for security going to the US took a very long time!!! We’d planned on eating there before our flight and didn’t have time!"}, {"username": "Vijay Almeida", "comment_text": "Our flight to EWR was at 11:05 am. We reached the airport at 8:45 am and there was ample time for security and passport control (this is at your gate)."}]}, {"id": "2206731966392548", "text": "Favorite tours in Rome?", "link": "facebook.com/groups/1373361046396315/permalink/2206731966392548/", "likes": 1, "comments": [{"username": "Lori Sammons", "comment_text": "Vatican and Sistine chapel combine tour. Don’t get the coliseum and Palestine tour, it’s long and nothing special and it’s expensive! Not worth it in my opinion"}, {"username": "Katie Giffuni", "comment_text": "Live virtual guide has many tour options and amazing experience"}]}, {"id": "2206734573058954", "text": "Going to Florence next week best tips and places to go Please\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2206734573058954/", "likes": 29, "comments": [{"username": "Teresa Shawn Lane", "comment_text": "Duomo, Point Vechio, Medici Chapel(2nd floor amazing!) Shop for leather!"}, {"username": "Teri Hansen", "comment_text": "Mercato Centrale. Lots of vendors on the first floor. AMAZING food court upstairs. Visit the Uffizi Museum. 🧡"}, {"username": "Lori Sammons", "comment_text": "Currently in Florence go to boboli garden, and Duomo we haven’t got a chance to go inside until Monday, but we’re going to Cirque Terre from here on a tour tomorrow"}, {"username": "Erika Valastyan", "comment_text": "Go to the Piazzale di Michelangelo, the scenery is just marvellous....t\nhe photo is from yesterday, and just walk around the city, there is so much to see! 😉"}, {"username": "Gary W Anderson", "comment_text": "If you can skip the lines and get tickets, the Uffizi, Acadamia (David), The Galileo museum, the Medici palace and gardens, go at nite to the Ponte Vecchio and/or a guided tour of Tuscany. Travel safe, eat well and enjoy gelato"}, {"username": "Steve Watkins", "comment_text": "David II Leather. Ask for Franco"}, {"username": "Awk Awkgrep", "comment_text": "step out of the door, and go forward. _awk"}, {"username": "Rhonda Russell", "comment_text": "Santo Spirito"}, {"username": "Norma McElroy Frisina", "comment_text": "When in Florence , in the Piazza Duomo near the Cathedral , there is usually a musician who plays the guitar . His name is Tadeusz. He’s an amazing musician . I recommend that you pick up one of his cds he sells . It will remind you of your time in Italy when you get back home . Be sure to tell him Norma sent you . This is my favorite cd but he may have others as well . ♥️🎶🇮🇹"}, {"username": "Angelina John", "comment_text": "Aside from the obvious, soak in the beauty of one of the most fabulous cities!!!"}, {"username": "Rye Eiven", "comment_text": "Rye Eiven"}, {"username": "Steven Clarke", "comment_text": "GINOS Bakery, just over the Ponte vecchio Bridge is delicious 😋. Little old couple run it, great pastries and drinks."}, {"username": "Al-Amin Sharif", "comment_text": "Uffizi gallery"}, {"username": "Katie Giffuni", "comment_text": "Bardini Gardens"}, {"username": "Heather Wise Wheelton", "comment_text": "Piazzale Di Michelangelo via a golf cart tour…."}, {"username": "Alberta Brack McAviney", "comment_text": "Leather school"}, {"username": "Cathy Potgieter", "comment_text": "We went a a free walking tour had the most amazing guide was really worth it."}, {"username": "Lilian Villarreal", "comment_text": "In Florence right now! You can take a cappuccino with a sandwich, some cakes, bruschetta… hummm delicious!!!! After your visite to Uffizi museum !"}, {"username": "Karen Gregorchuk", "comment_text": "Courtney Greg"}, {"username": "Karen Gregorchuk", "comment_text": "Bela Kay"}, {"username": "Julie Donovan", "comment_text": "Any suggestions on a winery tour in Tuscany?"}, {"username": "Stephen Slaughter", "comment_text": "Caffe or Vino by Uffizi, dinner at La Garga, Academia, walk the Arno!"}, {"username": "Janne Adams", "comment_text": "Best pizza ever, we went there 3 times while in Florence, I hope you can look it up and find the address!"}, {"username": "Mary Amann Destro", "comment_text": "Buy Rick Steve’s travel book on Italy and/or Tuscany. At any Barnes and Noble bookstore, and enjoy reading and highlighting it on the plane or even before !\nRick is a Pro on all travel throughout Europe!"}, {"username": "Miriam Andrews", "comment_text": "Do you know a great Airbnb in Milan?"}, {"username": "Milt Lawhorn", "comment_text": "Make sure you go into the church Santa Croce, it won’t disappoint."}, {"username": "Antonio Aloè", "comment_text": "Best tip buy a guide and/or google..."}, {"username": "Sue Gelardi", "comment_text": "Perseus for Bistecca Florentine."}, {"username": "Norma McElroy Frisina", "comment_text": "Make sure you find this famous sandwich shop. Custom made Italian sandwiches made with fresh baked bread from the bakery . The lines will be long but the are so organized and the lines move fast . It’s worth standing in line !"}]}, {"id": "2206737743058637", "text": "Recommendations for a 60th birthday dinner while in Tuscany area. Something really special and unique experience!!", "link": "facebook.com/groups/1373361046396315/permalink/2206737743058637/", "likes": 1, "comments": [{"username": "Ann Swedenburg", "comment_text": "Go somewhere that you can meet up with Ann and Mike Swedenburg 🤣🤣🤣"}, {"username": "Amelia Bonannella", "comment_text": "Antinori Estate - it won best winery in the world last year!"}]}, {"id": "2206739456391799", "text": "Would love some help with inspiration/recommendations for a 3rd destination to add to a trip in July 2024 as just so much choice and some word of wisdom on what might work on practical basis would be greatly appreciated.\n\nAppreciate it will be super hot and super busy in many areas but we have tickets to see Coldplay in Rome on 16 July so that part is set in stone. Also really want to include Venice as went tor a week with work in 2019 and really want to go back with husband. No flights booked as yet partly as too early and also I want to be really sure before I commit to flights and tend to overthink\n\nTentative plan is to fly to Venice for 4 nights, take train to Rome and stay for 5 nights including concert (have accommodation booked near the stadium for 2 nights and then a hotel in Travestere for the following 3 nights so more central for sightseeing) and then am looking for ideas for a more relaxing stay by a good pool (bonus for good sea views from pool) for 4 or 5 nights before flying home from Naples or ?? Just the 2 of us - normal stay in adults only resorts. Could just as easily end in Venice but it feels like a nice place to start and would rather be in Italy for a few days.\n\nHoping to fly in and out of Italy on Easyjet (though not adverse to flying BA which would mean one stop in London for us but definitely not Ryanair!). So potential airports are Naples, Milan, Sicily, and Venice. Would be nice to do internal travel by train though not adverse to hiring a car. We did that to get from Milanpensa to Lake Como for a wedding a few years back (but not sure we'd want to drive somewhere super crazy on the Amalfi coast).\nHave ruled out Florence and Lake Como (or similar) but interested Amalfi Coast/Sorrento/similar or Tuscany though suspect they may be too expensive! Perhaps best to find somewhere closer to Naples?\nSorry for long post and TIA!\n\n\n—  भावना उत्साही", "link": "facebook.com/groups/1373361046396315/permalink/2206739456391799/", "likes": 0, "comments": [{"username": "Billie Begley", "comment_text": "Sorrento is a great base for Amalfi and hotels are way cheaper. From\nThere you have access to Amalfi cost and Island of Capri."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Look for a nice country house or agriturismo near Siena. Rent a car in Rome, with the car you can easily visit the Val d’Orcia, and the area around Siena and then drive back to Venice for the airplane."}, {"username": "Karen Schmidt", "comment_text": "Look into Ischia. Flight would be from Naples"}, {"username": "Marco Scacchi Fratini", "comment_text": "Have you thought about Liguria? You could sleep in Santa Margherita Ligure or Moneglia and visit both the Cinque Terre, Porto Venere, the San Fruttuoso beach and monastery (it's reachable by boat, but you can hike there too if you want) and the area around Portofino. You can move quite easily by train there as there's a line that connects many of the villages (but not Porto Venere). Most beaches are rocky (the most beautiful anyway, in my opinion), but there are nice spots where to relax and swim. It's going to be quite busy with tourists during the entire summer there - As for flying back, Genoa isn't far, and there should definitely be direct flights, at least to London.\nhttps://\nitalian-riviera.\ncom/en/\nsanta-margherita\n-ligure-2/\n\nAlternatively, if you're more interested in just relaxing near the seaside, you could consider Elba island, off the coast of Tuscany (but you want to have a car there and will have to book a ferry), or the smaller Giglio island. https://\nwww.discovertusc\nany.com/elba/\nhttps://\nwww.giglioinfo.i\nt/en/\n\nFinally, another option could be Ponza island, off the Lazio coast. It's small but beautiful (it has very few and rocky beaches, though). You can get there by ferry via Anzio (south of Rome) or Gaeta, and both towns can be reached by train from Rome (Gaeta could even be an option from Naples, perhaps).\nhttps://\nwww.visitponza.i\nt/en/\n\nAs for the Amalfi coast, keep in mind that it gets really busy in summer; I am not sure I'd drive there in July. I have heard it's jammed-packed with cars in summer, but I have never been in July, so someone else can confirm, perhaps."}, {"username": "Jenny Payne", "comment_text": "They are saying in the future tourists won’t travel June,July,augus\nt as it is 2 hot. So I would do your own research and see for sure as it’s on the news a lot lately in Australia about how hot it is getting🌻"}]}, {"id": "2206742213058190", "text": "Suggestions for best ways to travel to and from Sardinia. We also want to visit Rome/Venice", "link": "facebook.com/groups/1373361046396315/permalink/2206742213058190/", "likes": 0, "comments": [{"username": "Temponi Luca", "comment_text": "Airplane is the fastest but you could also get ferry ⛴️ but it’s longer and the cost it’s quite the same!\nI vote for airplane ✈️"}, {"username": "Vivien Paulik", "comment_text": "Starts in Venice. Tran to Rome. And fly to Cagiari.\nOr stars in Sardegna, while to Rome and train to Venice"}, {"username": "Mrinalini Sathiyalingam", "comment_text": "I just booked my flight from Rome Fiumicino to Olbia and cost 89Euro"}]}, {"id": "2206716303060781", "text": "Hello! any recommendation for tour from Livorno port top Pisa and Florence, 1 day. I saw some options on viator, but it says: Pass by. does it mean we cannot even get out of the bus to admire? Thank you!!", "link": "facebook.com/groups/1373361046396315/permalink/2206716303060781/", "likes": 2, "comments": [{"username": "Sylvie AJ", "comment_text": "up"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "The bus can’t enter Florence city center, so you’ll have a stroll and you won’t see anything inside, neither in Florence nor in Pisa."}, {"username": "Dann Hrusch", "comment_text": "All of these stops in Florence are very close together and can be seen on a 15 minute walk. Add 10 mins to get to the first one from Santa Maria Novella train station."}, {"username": "Dafne Vassetti", "comment_text": "You probably have a local guide. 1 hour and half city tour with the guide, 1 hour and half on your own.\n\nIt takes one hour and half to get from Livorno to Florence - 1 hour to get to Pisa and another hour to get back in Livorno. So let's say 4 hours considering also bathroom stops that you have to take away from your day. 3 hours in Florence.\nMaybe 1 hour in Pisa."}, {"username": "Dafne Vassetti", "comment_text": "When you read pass by it means you walk there with your local guide. The Bus stops near the Arno the river and from there you walk to the city center."}]}, {"id": "2206709233061488", "text": "If you had to choose your top 3 favorite things to do in Rome, what would they be? And top 3 favorite places to eat?", "link": "facebook.com/groups/1373361046396315/permalink/2206709233061488/", "likes": 17, "comments": [{"username": "χριστινα χατζηγεωργιου", "comment_text": "Piazza Navona, Vatican, Colosseum, Dinner at Trastevere"}, {"username": "Amanda Bellamy", "comment_text": "The Vatican and the Colosseum are both amazing"}, {"username": "Marissa Wilson", "comment_text": "Colosseum, Roman Forum, area near the Pantheon.\nMaccheroni for restaurant recommendation"}, {"username": "Dann Hrusch", "comment_text": "Sistine Chapel, Colosseum and the Pantheon are my favorite sites. The Roman Forum is a close fourth. Sites aside, wandering is my favorite thing to do. One minute you're on a quiet narrow street and then all of the sudden you step out into a sprawling piazzas or are standing at the foot of a beautiful building."}, {"username": "Sarah Louise", "comment_text": "Dinner in Trastevere for sure, this place was really good (I had zucchini flowers, zucchini or artichoke pasta and tiramisu). The tiramisu was better than I've had anywhere else and I would return for it on its own. My partner enjoyed the meatballs as well. Food and service were both great and the neighborhood was enjoyable.\nEdit: the restaurant name is Trattoria Da Teo"}, {"username": "Bethany Rudy", "comment_text": "I would recommend eating in Trastevere also. It's such a cute area"}, {"username": "Lora Jane", "comment_text": "Nighttime golf cart tour"}, {"username": "Karen Blackmore", "comment_text": "Colsseum night tour, St. Peter's Basilica dome climb and sitting with an Aperol in Piazza Novana!"}, {"username": "Dafne Vassetti", "comment_text": "Galleria Borghese/Villa Borghese, night stroll between Trevi, Pantheon and Piazza Navona, lunch in the Ghetto/Campo dei Fiori/\nTrastevere area."}, {"username": "Lushan Yao", "comment_text": "Colosseum(from the outside)\nPantheon\nSistine Chapel"}, {"username": "Sam Braithwaite", "comment_text": "Colesseum was the best overall and two restaurants I can 100% recommend are ‘Da Massi’ in Trastevere & ‘Resturante Tema’ in Monti - both are amazing!!"}, {"username": "Tari Lawson", "comment_text": "Domus Aurea, the Scavi tour to St. Peter's Tomb, and going to the Villa Borgese."}, {"username": "Michelle Nelson-Harrison", "comment_text": "Walking food tour was my family’s favorite!"}, {"username": "Christine Sanci-Gentile", "comment_text": "Il Matriciana\nEvening golf cart tour with my best tour.com\nMass at St. Peter's"}, {"username": "Gena Kona-Mancini", "comment_text": "For a quick lunch... stobene Roma sandwiches. The BEST sandwich I've ever had omg. And like €6 . Also delicious Mastrociccia 😋 we went twice!\nAa for must see. Colliseum/ Palatine hill for sure."}, {"username": "Catherine Briggs", "comment_text": "Dinner in Trastevere\nGiardino degli Aranci - Aventine Hill\nPantheon"}, {"username": "Sharon McCarthy", "comment_text": "Colliseum, but see if you can book to do the underground dungeons (need to book in advance)\nPalatine Hill area.\nVatican was great but pick your dates. We've done it twice and both times the Pope was holding Mass and it was CRAZY busy.\nTrevi fountain at night with a Gelato 💖"}, {"username": "Sasha Melia", "comment_text": "Tour of the Domus Aurea was our favourite from a whole week sightseeing, also loved Palatine Hill and Castel Sant’Angelo. Molino for coffee/\nbreakfast/lunch."}, {"username": "Sabiha Syed Shaikh", "comment_text": "Guided tour to Pompeii"}, {"username": "Ashley Czinege", "comment_text": "Colosseum, Pantheon, Trevi Fountain and Vatican.\n\nFor amazing Roman pizza:\nVecchia Roma\n\nFor an amazing carbonara: Casa Maria"}, {"username": "Deepa Arte", "comment_text": "Breakfast at Vatican, got to see Vatican peacefully without any crowd. Dinner at Tonnarello’s in Trastevere."}, {"username": "Barbara Sellis", "comment_text": "Marylee Grosso"}, {"username": "Tammy Moore", "comment_text": "Love it! ❤️"}, {"username": "Jenny Demos-Bertrand", "comment_text": "Trastevere walking food tour. Hands down our favorite. And the golf cart tour was also awesome."}, {"username": "Xiomara Perez", "comment_text": "Sleep. Eat. Drink."}, {"username": "Jennifer Viggiano", "comment_text": "Following"}, {"username": "Chris Aman Florian", "comment_text": "Trevi Fountain, outside of the colosseum, pics on the bridge by Castel St Angelo, and just walking around looking at architecture"}]}, {"id": "2206715016394243", "text": "Favorite hotel to stay in while in Rome?", "link": "facebook.com/groups/1373361046396315/permalink/2206715016394243/", "likes": 38, "comments": [{"username": "Rachel Louise", "comment_text": "Rachel Louise"}, {"username": "Rachel Louise", "comment_text": "Rachel Louise"}, {"username": "Coral Jones", "comment_text": "Cesari Hotel. Historical Quarter."}, {"username": "Michele Saletros", "comment_text": "…"}, {"username": "Alison Corral Kneeland", "comment_text": "Bed Hive"}, {"username": "Michelle O'Brien", "comment_text": "Bernini is Lovely , and in a great spot ❣️"}, {"username": "Jenni Mackay", "comment_text": "Hotel Deocleziano near the train terminal"}, {"username": "Alexia Cassar", "comment_text": "Hotel Medici Roma"}, {"username": "Galina Bakman", "comment_text": "Terrazza Marco Antonio Luxury Suite Roma"}, {"username": "Jamie Sova Mulder", "comment_text": "We just stayed at this boutique hotel, and it was really adorable. One 1/2 blocks up from the Trevi Fountain and right by of all the restaurants and shopping. It was in a perfect location.\nFree Buffet breakfast in the morning too!"}, {"username": "Susan Goldman Glasser", "comment_text": "We are staying at\nArpinelli Relais."}, {"username": "Maria Salerno", "comment_text": "Hotel artimide"}, {"username": "Grg Cozzetto Oetterer Mra", "comment_text": "Hassler"}, {"username": "Margot Christensen", "comment_text": "Hotel Mancino 12, near Victoriao"}, {"username": "Mia McWorter", "comment_text": "Rocco Forte"}, {"username": "Mia McWorter", "comment_text": "Rocco Forte"}, {"username": "Lilly Koszta Edmunds", "comment_text": "Poesis experience hotel."}, {"username": "Zhixin Wang", "comment_text": "Blue hostel， great location"}, {"username": "Cristina Carmela", "comment_text": "Following"}, {"username": "Nancy Ann Paolino", "comment_text": "Yes hotel near termini train station and walking distance from Trevi fountain"}, {"username": "Anne Wright", "comment_text": "Hotel Locarno x"}, {"username": "Sally Wilkinson", "comment_text": "I loved our hotel on Via Nationale but I can’t remember the name\nMelanie Shoemake do you remember?"}, {"username": "Sharon Jones", "comment_text": "Soffitel"}, {"username": "Charleen Siegler Schuss", "comment_text": "Hotel Damaso"}, {"username": "Margaret Macdougall", "comment_text": "Hotel Forum - look down on the Forum from the roof top restaurant. Old style shining wood and brass."}, {"username": "Karen Ann Feringa", "comment_text": "Villa Spalletti!!❤️"}, {"username": "Kelly Swinson Johnson", "comment_text": "Hotel Artemide!!"}, {"username": "Janet Messanelli Bozzone", "comment_text": "We like hotel Mozart"}, {"username": "Megan Noble", "comment_text": "Poesis experience hotel was amazing. Absolutely beautiful 😊"}, {"username": "Cynthia Blue Mariano", "comment_text": "The last time I was in Rome my granddaughter and I stayed here. Very affordable and not far from the Trevi fountain.\n\nhttps://\nwww.hotelaberdee\nn.it/en/"}, {"username": "Svetu Sinkonen", "comment_text": "SuiteLifeTrevi 👍🏼"}, {"username": "Tracy Choptain", "comment_text": "Following"}, {"username": "Diane Dickerson Roberts", "comment_text": "We are staying at The Republic in Rome! Has anyone ever used this hotel?Please comment!"}, {"username": "Brenda Grabatin Kuipers", "comment_text": "Hotel Smeraldo!!! Across from an awesome bakery! Roscioli! Nice cobble stone street! Don’t even feel like you are in a big city & close to everything !!!"}, {"username": "Linda Rooney", "comment_text": "Artemide!"}, {"username": "Laurel Jaramillo", "comment_text": "Anyone stay at Hotel 55?"}, {"username": "Barbara Fucci", "comment_text": "Hotel Mozart small & quaint but very nice & great location"}, {"username": "Brooke Wylin", "comment_text": "Following!!!!"}, {"username": "Lucy Anne Xuereb", "comment_text": "Hotel Piazza di Spagna or Homs Hotel stayed in both they are near the Spanish Steps"}, {"username": "Hagar Mohsen", "comment_text": "Cavour hotel\nNear to the centre of the city\nNice rooms"}, {"username": "Judy Hargrove Allen", "comment_text": "Palatino right by the Colosseum❤️"}, {"username": "Karen Russell", "comment_text": "Following"}, {"username": "Ana Jaramillo", "comment_text": "Rome Hilton Cavalieri. The Best"}, {"username": "Erica Ryan", "comment_text": "Sofitel Roma Villa Borghese"}, {"username": "Jodi Shiffman Silverman", "comment_text": "Baglioni"}, {"username": "Heidi Thorner", "comment_text": "De Russie"}, {"username": "Roxann Hudy", "comment_text": "."}, {"username": "Brittany Pardue", "comment_text": "Love some hotels with good rooftops!!!!"}, {"username": "Janice Tripp Yeargin", "comment_text": "Ponte sisto"}, {"username": "Marcella Stewart", "comment_text": "Albergo del Senato. Great location. Short walking distance to many sites!"}, {"username": "Angela Tutt-Callaway", "comment_text": "Thank you for posting this because this is what I need to do tomorrow"}, {"username": "Peter-Jane DeMauro", "comment_text": "Anyone stay at the Hotel Imperiole?"}, {"username": "Alana Dhillon", "comment_text": "Hassler hotel but something real nice but more budget friendly I’d say Eitch Borromini . Mercure Centro colleseo w rooftop pool also nice mentioned above if you like Seagulls pooping in your pool. I only stayed there a day . If you’re going to Florence hotel Glance beautiful rooftop pool and no bird poopies."}, {"username": "Marilyn Molina", "comment_text": "Following"}, {"username": "Lisa LaBracio Volpe", "comment_text": "Sofitel was wonderful!"}, {"username": "Michelle Roome-Smith", "comment_text": "Mood 44"}, {"username": "Christina Ulewicz", "comment_text": "Following"}, {"username": "Gianna Rinaldi", "comment_text": "Deseo Homes"}, {"username": "Marl Joe", "comment_text": "Following"}, {"username": "Rachel Louise", "comment_text": "Diane Plott Miller these are some pics of our room. We had a room with an interconnected lounge room. Lots of space"}, {"username": "John Green", "comment_text": "Hotel Canada was amazing."}, {"username": "Reshma De Cruze", "comment_text": "A.ROMA Lifestyle HOTEL great service, shuttle throughout the day. International buffet breakfast. Nice pool\nand spa."}, {"username": "Paul Hyslop", "comment_text": "Singer Palace , great location , the original Singer sewing machine factory."}, {"username": "Sanghamitra Sahu", "comment_text": "Hotel Pantheon"}, {"username": "Lisa Infantino", "comment_text": "Hotel Eden!"}, {"username": "Sarah Kim Bogeski", "comment_text": "Nora Bart"}, {"username": "Rebecca Jones Casey", "comment_text": "Dusty Casey"}, {"username": "Debbie Milne Jenkins", "comment_text": "Hotel Adriano - but last stayed there several years ago. Also more budget friendly is Hotel Canada - a Best Western but that was 10 years ago and things change."}, {"username": "Toni Meyer Kelly", "comment_text": "The Ritz Carlton"}, {"username": "Barb Schneider", "comment_text": "Hotel Nazionale ❤️🇮🇹🇺🇸"}, {"username": "Darrin Kerby", "comment_text": "Rome Cavalieri"}, {"username": "Summer Christensen", "comment_text": "Hotel Hassler"}, {"username": "Valerie Collanton", "comment_text": "Eitch Borromini. Beautiful hotel behind Piazza Navona."}, {"username": "Isabelle Aubry", "comment_text": "Following"}, {"username": "Pam Hartsoch", "comment_text": "We found a darling boutique hotel, Aldrovandi Residence Suites in 2015 and loved it so much that when I took our daughters on a girl trip, we stayed there again. You’ll love:\nHaving a kitchen with a market a couple blocks away\nIt’s in an upscale, quiet residential neighborhood\nAcross from Borghese Park\nGreat included breakfast\nPool\nRight on the tram line\n24/7 manned front desk—the guys are super helpful\nI’d def stay there again if I were to return to Rome (which I won’t, because love love love Florence way better)"}, {"username": "Maria Nestoros Coulopoulos", "comment_text": "Molly Home B&B… Francesca is the owner and is absolutely amazing… it is in a great area too!"}, {"username": "Phil Fowler", "comment_text": "Fantastic hotel and location 👍"}, {"username": "Eyjólfur Hafsteinsson", "comment_text": "Hotel Santa Maria,Trastever\ne"}, {"username": "Russell Cooper", "comment_text": "Any motel in Rome"}, {"username": "Fernanda Allen", "comment_text": "Splendid Royal! They have a breath taking view from Rome. If you can not stay there try the Mirabele restaurant"}, {"username": "Vanessa Payne", "comment_text": "."}, {"username": "Shellie Godden", "comment_text": "Palazzo Dama - great location, pool, excellent staff, great rooms"}, {"username": "Ed Trevis", "comment_text": "Hotel Ripa Roma in Trastevere."}, {"username": "Judy Hassett", "comment_text": "Hotel Raphael near Piazza Navona, loved it gorgeous room, roof top restaurant & bar, amazing breakfast , very special💕💕💕💕"}, {"username": "Rebecca Yeoh", "comment_text": "Hotel Smeraldo, very nice and amazing location 👌🏼"}, {"username": "Joseph Vincelli", "comment_text": "Hassler"}, {"username": "Leanne Hopkins", "comment_text": "Follow"}, {"username": "Marie Lj", "comment_text": "Hotel artemide"}, {"username": "Jennifer Foster", "comment_text": "Hotel TriviHo 😍"}, {"username": "Gianna Copelotti", "comment_text": "Eden"}, {"username": "Mat PO", "comment_text": "Six Senses"}, {"username": "Andrea Sarno", "comment_text": "Hotel Indigo St. George!"}, {"username": "Marlene Bertino Randolph", "comment_text": "We have stayed 2x at Hotel\nModigliani. We really liked it."}, {"username": "Rina Speronello", "comment_text": "Pantheon iconic hotel ❤️"}, {"username": "Kristen LoCicero", "comment_text": "The Singer Palace Hotel https://\nsingerpalacehote\nl.com/"}, {"username": "Mia Catalano", "comment_text": "Hotel Della Conciliazione!"}, {"username": "Carrie Fischer Hogan", "comment_text": "Albergo del Senato\n\nCurrently here now. It’s spectacular"}, {"username": "Lise Lotte Winther-Bay", "comment_text": "Cavalieri Hilton"}, {"username": "Colette Guerriero", "comment_text": "Ponte Sisto or Modigliani"}, {"username": "Lynn Francisco Casella", "comment_text": "Hilton Cavalieri"}, {"username": "Maria Teresa Manzo", "comment_text": "Mercure Roma Centro Colosseo has a rooftop pool too!"}, {"username": "Wendie Rice Bonini", "comment_text": "Palace Grand Hotel"}, {"username": "Staci Tucker", "comment_text": "Westin"}, {"username": "Donna-Mae Kearns", "comment_text": "Hotel Artemide was great. Highly recommend l!"}, {"username": "Alice Dzimiera", "comment_text": "Hotel Artemide❤️We just stayed there in June for the 1st time. On Via Nazionale near the Piazza della Repubblica. Loved it & going back in October. Great rooftop bar & restaurant& breakfast ."}, {"username": "Annamarie Di Maio", "comment_text": "Any feedback on the Hotel Golden near the Spanish Steps?"}, {"username": "Pam Armenia O'Brien", "comment_text": "Eitch Borromini is beautiful in Piazza Navona. Rooftop is amazing"}, {"username": "Bethany Morrow", "comment_text": "We just stayed at the Sina Bernini Bristol, Autograph Collection for 2 nights this week and liked it. The lobby and bar are beautiful, very convenient to grab a 10 minute taxi to the main sightseeing areas, and is in the Piazza Barberini. If anyone is a Steelers fan, the Steelers bar is about a 20 minute walk or short cab ride from the hotel. I'll post a pic of the front of the hotel below"}, {"username": "Michelle LaMantea Talbot", "comment_text": "Hotel Quirnelle"}, {"username": "Pam Lewellyn Nunan", "comment_text": "Anantara Palazzo Naiadi"}, {"username": "Dorothy Jones", "comment_text": "Great post. Helpful!"}, {"username": "Robert Mcmanus", "comment_text": "Hotel Artemis rome"}, {"username": "Nancy Lewis", "comment_text": "Valadier Hotel\nSmall boutique\nDesigner"}, {"username": "Cecilia McDaid McCann", "comment_text": "River Palace"}, {"username": "Barbara McCarthy Genovese", "comment_text": "Following"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2206715276394217", "text": "We just booked our flight to Italy for Dec 14, 2023 through Jan 8, 2024. Have never been during winter months and know it will be much cooler but much less tourists. We will not be staying in the typical tourist areas of Rome, Florence or Venice as we have already been, seen, done. We like off-the-beaten track travels. One question is - we reallyआणखी want to see Bologna but people tell us not to go in winter. We don't mind the cold but can anyone tell me how cold does it get? snow or just rain? Will also be traveling and staying in Tuscany area, then across and down east coast to the heel of the boot. Any recommendations will be appreciated? no snarky ones please. 😊", "link": "facebook.com/groups/1373361046396315/permalink/2206715276394217/", "likes": 21, "comments": [{"username": "Scott Perry", "comment_text": "Bologna’s amazing in the winter. If you like cocktails, I recommend Guero on via Goito."}, {"username": "Kathy Kibbe", "comment_text": "I was in Florence in January and was comfortable in puffer with a scarf and gloves - Bologna is a college town so things will be open and portico’s everywhere will protect from the elements"}, {"username": "Mike Laudick", "comment_text": "Note that most smaller seaside towns are pretty dead in the wintertime. Stick to the larger towns."}, {"username": "Robin Darmstadt Mancil", "comment_text": "How many days are recommended for Bologna?"}, {"username": "Lisa Abrams Argento", "comment_text": "Don’t skip Bologna. It was wonderful."}, {"username": "Etschi Bruckner", "comment_text": "Bologna is nice in winter - great to explore the wonderful food scene!"}, {"username": "Valerie Collanton", "comment_text": "It can be cold enough to need a winter coat, hat and gloves. BUT go !! The winter is a wonderful time as there are no crowds and you can enjoy all the hearty winter dishes. I love going that time of year."}, {"username": "Claire Buccini", "comment_text": "Brindisi and monopoli are beautiful, and so is albarello in the snow."}, {"username": "Rhonda Hope", "comment_text": "We’ve been to Rome in January it wasn’t that cold snow can happen in February I’m told"}, {"username": "Ka Ben", "comment_text": "I live in Southern Italy. Puglia region. I usually just wear a puffer jacket and a beanie during winter months."}, {"username": "Alicia Cox", "comment_text": "This will be awesome - you should google Christmas markets as there r awesome ones & maybe choose some of your destinations based on this. Also BEAUTIFUL Christmas decorations. Sorrento is a great location to see several areas from. Coastal so I would think warmer. We were there in early dec & we layered & had only a light weight jacket. For me jeans or black or brown skinny pants & long sleeve “flowy tops” plus or minus a cami or wrap was good, but I’m hot natured. We saw Pompeii from here & Amalfi coast from here plus you can go to Naples or Capri if you like. Highly recommend"}, {"username": "Mike Guluk", "comment_text": "Want off the beaten track? We were there 12/\n22. Bologna,Ravenna,San\nMarino hard to find open hotels co,d but not freezing unless a rare storm"}, {"username": "Jan Buess", "comment_text": "How awesome for you, enjoy the way the Italians live!"}, {"username": "David Tucker", "comment_text": "Have travelled all over Utaly in winter. It is great just wear warm layers. Coast has little action. Every where else is OK. People live there . Some additional surprises in the form of extra venues open. Food is different to summer because they eat seasonally. You will love it if you go with an open mind."}, {"username": "Diana Hesse", "comment_text": "Why would people say not to go in winter?"}, {"username": "Susan Rathke", "comment_text": "I traveled through Northern Italy last December and it was mild at the beginning of the month and a bit cooler in January. I am leaving the puffy down coat at home & bringing a wool coat next time."}, {"username": "Zarine Batli", "comment_text": "It’s magical but remember most restaurants etc are closed the 24/25."}, {"username": "Alberta Brack McAviney", "comment_text": "Try to get to Matera. It’s amazing!\nAlberobella will be amazing"}, {"username": "Catherine Silvera", "comment_text": "Snarky?"}, {"username": "Linda Tibbles", "comment_text": "Google weather for December Bologna."}, {"username": "Pat Lavin Roberts", "comment_text": "Went to Rome dec 2022- 60+ degrees everyday- my son even played golf. Enjoy"}, {"username": "Janelle Caire", "comment_text": "During my December 2021 trip to Rome and Florence, the temps were very mild. I didn’t need the scarves and gloves i had packed."}, {"username": "Luanne Carey", "comment_text": "Jealous! 😎 Loved Bologna but went in the spring, so I can't help you there. Have a wonderful trip!"}, {"username": "Eileen Lonergan", "comment_text": "Polignano a mare, Monopoli, Gallipoli and Matera ❤️❤️❤️"}, {"username": "Kasey Baker", "comment_text": "I’ll be there around the same time. I love Italy in the winter."}, {"username": "Cynthia Marie", "comment_text": "We are flying out December 12- January 9th ! It will be our first time going over Christmas and New year’s. We normally visit in March. We enjoy the off season, less crowds and lower rates.\n40 - 60 degrees are perfect for us when we travel. Bring a light waterproof jacket and a pair of waterproof boots. Layers are the way to go. My hands get cold first, so I always like to have a thin pair of gloves with me. Enjoy your trip!"}, {"username": "Chloe Gallagher", "comment_text": "Went for New Years & loved it ! Second time I’ve been, once with friends the last time alone"}, {"username": "Barbara Was", "comment_text": "Lecce and Matera are so worth going to."}, {"username": "Silvia Aha", "comment_text": "I do winter in Italy in my Blundstones. Thick socks, warm puffer jacket and wool scarf a must for me. It can get really cold, below 0°C, and you would want to stay warm and dry. Period between Christmas and New year in Bologna can either be cold and sunny and pleasant or cold and rainy and a tad miserable (just eat more wonderful food to make up for it 😂). It's a great city, easy to walk, there are often many interesting cultural events, people are very friendly and ... did I mention the food?! 😋"}, {"username": "Randi Katnich Schimke", "comment_text": "You will have a fabulous time!!!!"}, {"username": "Temponi Luca", "comment_text": "In winter right now it’s cold but not like 2010 so I don’t think that you’re gonna get snow ❄️ maybe rain… but Bologna it’s a all year City! So you don’t have to care about weather!\nI think it’s gonna be 10/8° !\nYou could do everything!"}, {"username": "Jenny Payne", "comment_text": "I was in Italy February this year and it wasn’t that cold compared to other winters, the secret is layer, best rubber sole leather boots and a warm coat with a hood and you will have a great time. Bologna is great in winter ,I love every it’s in winter in Italy 🌻"}, {"username": "Janet Messanelli Bozzone", "comment_text": "Don’t take Bologna off your list. It will be cooler but I see no reason why someone would tell you not to go. 🤷🏼‍♀️"}, {"username": "Dafne Vassetti", "comment_text": "The great thing about Bologna is that the city has portici/arches under which you can walk during sunshine, rain or snow. They were built on purpose. They are all over so really no to worry to much about the weather."}]}, {"id": "2206706506395094", "text": "Planning on going September 1-12 possibly 14 with my boyfriend nothing set in stone yet. Yes I know probably late in the game. I was wondering if we should book our whole stay in Rome and then travel by train to other cities or is it better to break up the stay to 3 nights per city? (Rome, Florence, Venice). Any tips or recommendations would be great.", "link": "facebook.com/groups/1373361046396315/permalink/2206706506395094/", "likes": 3, "comments": [{"username": "Diane Janovas", "comment_text": "You would be better off staying in each of these cities rather than day tripping. A day trip is a long day .you also get a better experience when you are in a city in the morning evening when it is less crowded. Fly into one city and home from last city"}, {"username": "Charleen Siegler Schuss", "comment_text": "3 nights per city sounds great. You might want to take a night from Venice and add to Rome. Venice is 2 night city."}, {"username": "Gena Diaco Penland", "comment_text": "We just did this trip at the beginning of July! We flew(from Florida) to Rome(6 nights), Florence(4 nights), Venice(3 nights). Flew home from Venice. If it wasn’t so hot, we probably could have done a day or two less in Rome, but bc it was so hot we had to break up what we could do each day."}, {"username": "Lori Sammons", "comment_text": "I would probably skip Venice and replace it with Amalfi Coast"}, {"username": "Julia Salmon", "comment_text": "Stay in each place instead of day trips. You’ll get to do so much more"}, {"username": "Tam Wong", "comment_text": "Travel , travel 🧳 fly into Rome and fly out of Venice then you don’t have to back track🇮🇹"}, {"username": "Daisy Yoo", "comment_text": "Break into 2. Rome and then Florence as base"}, {"username": "Jerry Lyubelsky", "comment_text": "Break it up. If you’ve never been I suggest pushing the trip back so you can better plan this out and do some research in this group or with a travel agent."}, {"username": "Casarine Temple", "comment_text": "Whatever you decide, book sooner rather than later."}, {"username": "Carolina Lamb", "comment_text": "We just returned from Italy and we stayed in each city, that was the best decision for us to see it all. Started in Milan then Lake Como after Venice then to Florence and Tuscany then into Capri over to Almafi- Positano and finished in Rome! Amazing trip😀Enjoy!"}, {"username": "Frannie Kaplan", "comment_text": "3 nights per city to use them as your base, but I think you'll get tired. Better to do either the North or the centre"}]}, {"id": "2206696239729454", "text": "Any suggestions for good ear buds? I’ll be listening to a lot of audio guides. I cannot wear Apple brand, as they are too big/hard and they hurt after like 10 minutes. TIA!!! 🙏🥰", "link": "facebook.com/groups/1373361046396315/permalink/2206696239729454/", "likes": 2, "comments": [{"username": "Fiona Mac", "comment_text": "Try the wrap around ones sit great"}, {"username": "Craig Chapman", "comment_text": "Love my Jabra Elite 7. They are in ear Bluetooth and actually stay in and I do not even know they are in. I have owned many, and so far these have been the best for me, but everyone is different."}, {"username": "Tracy Staples", "comment_text": "Any suggestions on ones that are plug in, I prefer to not do Bluetooth on long hauls"}, {"username": "Cheryl Turner", "comment_text": "Melomania by Cambridge Audio. Fantastic, much cheaper than apple & imo much better too! Come with lots of different sizes of earbud to fit ears perfectly. I too find the Apple ones hurt my ears after 10mins."}, {"username": "Jane Hopkins Rosner", "comment_text": "Aftershokz bone conduction earphones. Nothing in your ear so you have situational awareness. Extremely comfortable. I use them for Peloton and dog walking. They are Bluetooth."}, {"username": "Jess Ica", "comment_text": "Raycon"}, {"username": "Patrice Wick", "comment_text": "Odd enough my favorite ones are from Walmart - $20 Onn brand. I bought a little cord that plugs into the end of them in case they fall out they don’t fall in between the airplane seat or get lost. ￼"}, {"username": "Michele Levesque Semosky", "comment_text": "I prefer the kind that hook over your ear….I hated the earbuds as they were painful!"}, {"username": "Erica Kleinberg Tiomno", "comment_text": "I like the beats ear buds and they come with 3 size inserts. They are very comfortable."}, {"username": "Gregory Smith", "comment_text": "Very happy with these they don’t fall out."}, {"username": "Andrea Paquette Haber", "comment_text": "I like the skull candy blue tooth that has the wire from ear to ear."}, {"username": "Wendy Lammerant", "comment_text": "Bose"}, {"username": "Michelle McDonald Mertens", "comment_text": "AirPods Pro have three different sizes of soft tips to fit different ears."}, {"username": "Daisy Yoo", "comment_text": "This is what I have"}, {"username": "Erin Vizza", "comment_text": "Our kiddos used their big over the ear ones bc they were most comfy."}]}, {"id": "2206695563062855", "text": "Tuscany\nSo the accommodation is nearly all booked for Apr2024. Just Tuscany left. We stayed montepulciano last trip and loved the agriturismo with a view back to the village. Would love something similar close to Florence. Looking for recommendations. Thanks 😊", "link": "facebook.com/groups/1373361046396315/permalink/2206695563062855/", "likes": 0, "comments": [{"username": "Mary Lynn Austin Mang", "comment_text": "We stayed in the Chianti region at a lovely boutique hotel/ villa. Locanda Le Piazze\n\nhttps://\nlocandalepiazze.\ncom/\n?gclid=CjwKCAjww\n7KmBhAyEiwA5-PU\nSs93VeVCrWp0GK_\npNAgL6NJKLma5XY\nN5ki3fRZ3GbhdMt\nBiynUFodxoCw0EQ\nAvD_BwE"}]}, {"id": "2206645366401208", "text": "Galleria Vittorio Emanuele II - Milano", "link": "facebook.com/groups/1373361046396315/permalink/2206645366401208/", "likes": 5, "comments": []}, {"id": "2206696876396057", "text": "Hi everyone. Anyone know anything about concerts in the Circus Maximus. We would love to take our teenaage boys but don’t know if it is safe? Is there a place to sit or can you buy seats instead of standing?", "link": "facebook.com/groups/1373361046396315/permalink/2206696876396057/", "likes": 0, "comments": [{"username": "Marco Scacchi Fratini", "comment_text": "It doesn't look like there are seated tickets for the next concerts. There seem to be only standing tickets.\n\nYou can buy seats here: It seems there are still tickets for Imagine Dragons and Travis Scott https://\nwww.ticketone.it\n/en/city/\nroma-216/venue/\ncirco-massimo-18\n214/\n\nIf you prefer to buy them on TicketMaster:\n\nScott Travis: https://\nwww.ticketmaster\n.it/artist/\ntravis-scott-big\nlietti/909530\nImagine Dragons - it says tickets here are sold out: https://\nshop.ticketmaste\nr.it/biglietti/\nacquista-bigliet\nti-imagine-drag\nons-mercury-wor\nld-tour-05-agos\nto-2023-circo-m\nassimo-roma-506\n1.html\n\nOn a side note, there's also the Rome Summer Festival, but that's at the Auditorium\nhttps://\nwww.auditorium.c\nom/en/festival/\nrome-summer-fest\n-2023/\n\nThere are also other festivals and concerts (RomaRock Festival, concerts at the Caracalla Baths and at the Stadio Olimpico but I believe these are more focused on Italian singers)"}]}, {"id": "2206697649729313", "text": "Question for those that have been coming to Italy for 20+ years!\n\nBear with me on the background a bit.\nThis will only speak to the older crowd in this group but I want to make sure I wasn’t going crazy here!\n\nI lived just outside of Naples almost 20 years ago and went to Florence, Rome, and Naples many times with guests that came to visit in the 2 years we lived there until moving to Japan. (And then Germany and then the states and now we are in Sicily)\nUp until just last month, I hadn’t been back to visit museums in my old stomping grounds in any of those cities but family came to visit us in Sicily where we live now and we did Rome and Florence during their time here..\n\nAll this background just to ask:\n\nHas anyone noticed an improvement in painting restoring in the last 20 years?!\n\nMost were dark and not much color coming through the paintings 20 years ago. Honestly, I was blown away by the bright colors of the museums we saw this summer vs 20 years ago, most the same things places we did now vs then (and David in Florence has been moved in the museum from then until now as a side note)\n\nHas there been major advancements in restoring old paintings in the last 20 years?! I’m assuming so because I don’t remember the vivid colors back then vs now!\n\nOf course I don’t have any side by side comparison because we didn’t have easily accessible digital cameras back then besides 3 MP cameras and I don’t believe i have any of those pictures left this many years/many computers later.\n\nJust curious if anyone has any ideas!", "link": "facebook.com/groups/1373361046396315/permalink/2206697649729313/", "likes": 26, "comments": [{"username": "Alessandro Iannelli", "comment_text": "it's hard to answer your question because it would require knowledge in the specific field, and probably in chemistry (i know some chemistry, but mostly just basic). it's reasonable to assume that there must have been progress in the restoration techniques over the past 2 decades. i actually checked this painting against the picture of a book i have at home and indeed it looks more vivid. the painting is \"Santo Stefano tra i santi Jacopo e Pietro\" by Domenico Ghirlandaio, end of xv century (apparently, it also has another, slightly different title). after a brief google search, i learned that it has been restored around 10 years ago, so you have good eye. on it worked people from CNR (National Research Council) and apparently they were able for the first time to perfectly recreate the formula used by the painter for the color brown (source: https://\nportalegiovani.c\nomune.fi.it/\nurlnews/webzine/\n16861.html)"}, {"username": "Paul Davis", "comment_text": "Melanie Matthews Stuprich: I can’t answer your question specifically but we recently went to see Leonardo da Vinci’s The Last Supper and it was more vivid than I expected from the photos I’ve seen."}, {"username": "Leila Jane", "comment_text": "I do know that The Last Supper was restored because I saw so many articles about it during the time of its restoration. However, I went to the Uffizi Museum back in the mid 80's and again 3 years ago and did not notice a difference in vibrancy in the paintings between the 2 time periods. So - not sure if the others needed restoration or not."}, {"username": "Carol Taylor Tisdale", "comment_text": "It could definitely be advancements in restoration techniques. There is so much more tourism that perhaps the funds are now available to stay on top of keeping these pieces and structures better cared for. Interesting observation!"}, {"username": "Brenno Bianchi", "comment_text": "I think the restauration of the Sistine Chapel have created a divide in style between pre- and post- (and a lot of controversy not really ended yet)"}, {"username": "Candace Beutell Gardner", "comment_text": "I used to have slides of Chartres's cathedral's stained glass windows before being cleaned and after. I know this isn't related to Italy's paintings but the same change could easily be seen. Colors we didn't know were in those windows made the cleaned windows pop with beautiful reds, blues and golds. There have been a lot of advances made this past 20 years in restoring important works of art and façades of buildings."}, {"username": "Ann Brahmani Bost", "comment_text": "I personally think making the colors so vibrant in many of these older works of art is over done. I think the Sistine chapel is a glaring example of this. Although I know everyone doesn’t agree."}, {"username": "Fetchin Gretchen", "comment_text": "I googled the answer to this and this is the answer I found:\nYes, you are correct. There have been major advancements in painting restoration in the last 20 years. This is due to a number of factors, including:\n\n* The development of new technologies, such as non-invasive imaging techniques, that allow conservators to see beneath the surface of paintings without damaging them.\n* The increased availability of scientific data about pigments and painting techniques, which helps conservators to make more informed decisions about how to restore paintings.\n* A greater understanding of the causes of deterioration in paintings, which helps conservators to prevent further damage.\n\nAs a result of these advancements, conservators are now able to restore paintings with greater accuracy and subtlety, bringing out the original colors and details in a way that was not possible in the past. This is why you may have noticed a difference in the brightness and vibrancy of the paintings you saw in Italy recently compared to your previous visits.\n\nHere are some specific examples of how painting restoration has improved in recent years:\n\n* In 2002, the Mona Lisa was restored after years of neglect. The restoration revealed that the painting was originally much brighter than it is today, and that it had suffered significant damage from overcleaning and exposure to light.\n* In 2010, the Sistine Chapel was restored after a 20-year project. The restoration cleaned away centuries of soot and grime, revealing the original brilliance of Michelangelo's frescoes.\n* In 2019, the Ghent Altarpiece was restored after a 10-year project. The restoration removed centuries of varnish and overpaint, revealing the original colors and details of the painting.\n\nThese are just a few examples of how painting restoration has improved in recent years. As the field of conservation continues to advance, we can expect to see even more dramatic improvements in the future."}, {"username": "Laura Cary Veeder", "comment_text": "I think so! Or maybe we just appreciate & like it more as we’ve aged? I don’t know, but I remember feeling that the Uffizi was really dark years ago and absolutely loved it 2 years ago."}, {"username": "Vasthi Cheddar", "comment_text": "I don't have a point of reference as you do, but I noticed how vivid and bright some of the paintings were.... even took pictures because they looked so stunning."}, {"username": "Blanca Gil", "comment_text": "Yes, there have been improvements in churches, museums and the artwork that is housed in these places. The Uffizi has gone through major improvements in the way art is displayed and restoration of many pieces. Museo dell’Opera del Duomo has been remodeled and now showcases Michelangelo’s The Deposition. It used to sit in a small stairwell on your way to the second floor."}, {"username": "Barbara Bastianini", "comment_text": "I can’t speak for all museums but I first saw the Sistine chapel back in the 1970s. And saw it for the second time in 1982. The frescos were dull and dark back then. The colors were kind of muddy. I believe the most recent restoration of it was completed in the 1990s. I was shocked seeing it for the first time after that. The colors were so brilliant and vibrant! Details that hadn’t been visible for hundreds of years were revealed. I remember reading afterward that the restoration caused art historians to reevaluate Michelangelo’s painting. I think there’s still debate, with some believing this restoration finally showed Michelangelo’s techniques while others say the restoration was not true to his intentions.\n\nI’m certainly no expert. All I know is before the restoration I enjoyed the Sistine Chapel mainly for historical reasons. The frescos didn’t really move me. After the restoration, though, I was totally stunned by the power and mastery of Michelangelo. I felt being in the Chapel was to be in the presence of genius. I had not really felt that before the restoration.\n\nI guess advances are made in every field over time. Art Restoration is probably no different."}, {"username": "Maria Oliva Marchal", "comment_text": "Melanie, on a completely different note, how do you like living in Sicily? We went to visit this summer and loved it. We're seriously considering buying a house to make into an AirBnB and use as a place for us to stay when we go over. Where are you from originally? I'm in the US."}, {"username": "Carrianne Allen", "comment_text": "I just came on here to say I love this post!! I cannot wait to see these works with my own eyes next Fall!! As a detail oriented person, I am truly fascinated by that process of restoration.."}, {"username": "Caroline Davis Lange", "comment_text": "Yes! There's an art to science and science in art!"}]}, {"id": "2206703646395380", "text": "I’ve seen a few posts about belt pouches (aka fanny packs if you’re from the US) and they always say NOT to take them. I’m trying to figure out why not. I wear mine in front where it’s visible and easy to keep a hand on. Other than marking me as a tourist (which should be painfully obvious belt pouch or no) what is the issue with them?", "link": "facebook.com/groups/1373361046396315/permalink/2206703646395380/", "likes": 38, "comments": [{"username": "Jennifer L. Mezzio", "comment_text": "A lot of people say not to wear them because the clasps can easily be removed and the pack taken. Wear a cross body bag instead"}, {"username": "Janet Farrell", "comment_text": "They are so ugly"}, {"username": "Michelle Bergman Davis", "comment_text": "I wore one for entire 5 wk trip to Italy. I wore it as a cross body so I always felt safe and could easily keep it secured. The one I had was from Pacsafe and it had a lock for the zipper."}, {"username": "Donna Parrish", "comment_text": "Use a money belt instead"}, {"username": "Kimberley Gray", "comment_text": "Honestly, I tried a purse last time and I’m going back to my fanny pack . I like having everything together there in one place. And my hands-free. Also, it’s easy to say put things in your pocket but if you shopped for women’s clothes lately, some have no pockets. ￼ I think it really has to be to each his own. ￼￼"}, {"username": "Mona Ruff-Root", "comment_text": "I was just looking at Fanny packs!"}, {"username": "Carol Bronner Kean", "comment_text": "This is bizarre! It's really that bad? Guess I need a cross body and hold it close. If we don't leave Rome, are the issues still the same?"}, {"username": "Suzi Hellmundt", "comment_text": "I’ve just returned from 10 week trip in France and Italy travelling by train. I got a bit anxious with all posts about pickpockets but there was no need to b so anxious. I wore my gorgeous Italian handbag crossbody zipped up and kept my hand on zip in crowds. Used phone to pay and had some cash for tips and loo - 1 euro cost at times. Just be aware, respectful and enjoy the hospitality of these warm and friendly people"}, {"username": "Kem Irvine", "comment_text": "I’m really getting concerned with travel in Italy after reading so many posts. Is it really that bad? Might just stay in Australia!"}, {"username": "Kimberly Williams Montanari", "comment_text": "We first went to Italy in December of 1988. We watched 3 Gypsy children in Rome pick-pocketing a man in the distance. It seems it has always been a problem. We used fanny packs, but also had a full length wool coat on most of the time. I love all of the ideas that have been listed here."}, {"username": "Nic KE", "comment_text": "I wear this anti theft boxer undergarment when I wear a dress."}, {"username": "Nic KE", "comment_text": "I carry this when I wear pants."}, {"username": "Natasha Keepence", "comment_text": "Wear that Fanny pack…. But keep the bulk of your money and anything of importance under your clothes in a money belt"}, {"username": "Caroline Neave", "comment_text": "https://\npacsafe.com/\ncollections/\nwomens\n\nThese are brilliant. Slash proof and lockable. I use a crossbody bag for all travels. Variety to choose from. Recommend these. (I’m in NZ)"}, {"username": "Heather Toews", "comment_text": "I travelled with my crossbody belt bag my entire trip with no prob. It had a double zip so I secured one side with a carabeener and just always put my hand on it when I was on the metro. No prob."}, {"username": "Heather Barlow", "comment_text": "I wear a Travelon Fanny pack. It has locking zippers, slash resistant belt, and it buckles in the front. It is pretty solid."}, {"username": "Julie Pulzone", "comment_text": "I wore either my Patagonia crossbody or my lululemon crossbody bag. No issues with either bag during our 3 weeks in Italy. It is important to be aware of your surroundings and the people around you."}, {"username": "Ina du Plessis", "comment_text": "For the money belt people. Where do you keep your passport as it is too big for money belt"}, {"username": "Robyn Lawson", "comment_text": "Money belts are flat with zips and go under clothes and are very effective and safe. Not like fanny packs which are visible."}, {"username": "Kelly Combs Keith", "comment_text": "I wore a large belt bag, cross style (Coach brand) and loved it! No issues."}, {"username": "Nancy Ann Paolino", "comment_text": "I went with friends we all had one and no issue. When in a crowd be conscious of those around. When in a train station the same. Things happen everywhere even in US. Be cautious and vigilant."}, {"username": "Vladimir Boskovic Serrudo", "comment_text": "You don’t need them. Nobody needs them."}, {"username": "Cindy Drover-Davidson", "comment_text": "I wear a chest bag, just a small one. So far, no problems."}, {"username": "Dina Garrett", "comment_text": "Julie Franco Mellow, BillandAngala Verley, Linda Williams"}, {"username": "Jude Ongeri", "comment_text": "How about using it as a decoy with nothing important in it."}, {"username": "Maureen Rebello Hagerty", "comment_text": "I wear the flat Yyp that ticks into your pants or shorts. Can’t be see"}, {"username": "Angela Jones", "comment_text": "I buy a bra two cup sizes larger and hide my valuables there."}, {"username": "Sue Yentrouc", "comment_text": "I have a 'pacsafe' that has lockable zips, steel mesh strap that cant be cut and can be worn crossbody or as a belt pouch."}, {"username": "Trena Kennedy", "comment_text": "I have been robbed of everything in my bum bag / fanny pack in Florence in the street. They shove a newspaper in your face to distract you then grab the contents of your bag while your hands are pushing the newspaper away. I only kept a lip balm, tissues & a city map so it didn’t matter but it was a bit scary. Only keep things in your bag you are willing to lose. Hide the rest under your clothes"}, {"username": "Maxine Moffitt", "comment_text": "I have a pacsafe bum bag. Zips lock. Lockable buckle (more of a lockable pin buckle). RFID slot for passport. I use it when I am transiting and need my passport etc. When doing tourist sites a small underclothes money belt (tucked into my pants). https://\nwww.google.com.a\nu/\nsearch?q=pacsafe\n+bum.bag&ie=UTF\n-8&oe=UTF-8&hl=\nen-au&client=sa\nfari#vhid=OguhH\nxfznewQCM&vssid\n=l"}, {"username": "Erin Vizza", "comment_text": "Wore them around Italy. Just because of how much I read about pick pockets in Rome and bc it’s the busiest city I visited I used a money pouch that hung close to my body when I was there."}, {"username": "Bonnie Rodgers Henderson", "comment_text": "I sew a pocket on the inside of my pants and skirts. Too easy to cut fanny packs. Personally I don't like the look. Personal preference. Seen straps cut. The inside pocket eliminates money belt"}, {"username": "Kimberly Ketterer Sedita", "comment_text": "Mine works great."}, {"username": "CK Sia", "comment_text": "Omg. Puts me off visiting popular tourist spots."}, {"username": "Maria Giordano", "comment_text": "I once saw kids surround a man in Rome & take it right off him. Unless there is also a way to tie it, I think the clip is too easy to undo"}, {"username": "Laura Marie", "comment_text": "This is $10 from Amazon and will hold a passport. Wear it around your neck under your clothes. I do not trust the hotel safe."}, {"username": "Debbie Plante", "comment_text": "They can cut the strap and take it off you."}, {"username": "Tonya Rauton", "comment_text": "Lots of people with lululemon Fanny packs worn like a crossbody."}, {"username": "Nanette Mlynarczyk Nelson", "comment_text": "Honestly, just wear a moneybelt inside your waistband, no one can get to it. I wore one for a 3 month backpacking trip through Europe, where I witnessed every kind of pick pocket and thieves working in pairs. I saw pockets slashed, backpacks rummaged, bags stolen, but my stuff was safe. I say don't risk it trying to do what you THINK might be OK and go with a safe bet."}, {"username": "Voula Ladas", "comment_text": "They are also called sling bags . I have purchased one from Pacsafe . They have different sizes , are slashproof( including straps) RFID technology . I don’t care if it makes me look like a tourist . I don’t want to be inconvenienced by silly thieves . Wearing these doesn’t mean they’re foolproof ,but it certainly helps deter them ."}, {"username": "Barbara Kleinhans", "comment_text": "Just plain ugly!"}, {"username": "Joann Lynn", "comment_text": "Tons of people had them wear it if you want be aware of pick poctess in crowds"}, {"username": "Robin Abrahams Stieff", "comment_text": "I wore this sling bag in front of me for 2 1/2 weeks and never felt threatened. My husband wore a money belt. No issues."}, {"username": "Sandra Yee", "comment_text": "I wear one for many reasons!! And it no longer marks you as a tourist because they’re now in style! Notice at the malls how many young people wear them!"}, {"username": "Rebecca Yeoh", "comment_text": "I took a Travelon anti-theft bag (pictured) which provided some peace of mind, but I still kept my hand over it in trains and busy areas. I saw a lot of people with Lululemon/ Uniqlo cross body bags. I honestly think they are perfectly fine and safe for Italy. You just need to be alert. I kept cash and my passport in the hotel safe but when in transit to other places via train I hid a small pouch around my neck and under my T-shirt with passport and cash. I made sure you couldn’t see it under my clothes nor the strap around my neck."}, {"username": "Shauna Dickinson", "comment_text": "I just carried a small cute purse all throughout the Mediterranean and had no issues"}, {"username": "Lynne Keegan", "comment_text": "Pat Keegan read these"}, {"username": "Gopa Dasgupta", "comment_text": "Hi, I am from India and in the 90's my colleague used to travel by train ( 2 hours' journey) daily from Diamond Harbour to Kolkata for attending office. If you see in pictures, local trains are over crowded during office hours and nothing to fo due to our huge population. Those days getting salary through bank was not mandatory. He used to take his entire salary within socks in a plastic packet. 😀\nAs generally 1st of every month is pay day in India, pickpocketers wera most active on that day."}, {"username": "Donna Parr", "comment_text": "When we travel my husband wears a money belt and loops the trap through he’s belt loops of he’s pants or shorts so if they cut or pulled it, it’s a be lot harder to get off.\n\nI wear a cross body bag and always have my hand on the zip.\n\nDon’t leave wallets,phones,\npassport or any thing of value in your back,side or front pockets they will get stolen."}, {"username": "Tiffany Lopez", "comment_text": "All I can say is thank god for it because my husband got pickpocketed in Paris and all the money was in his money belt. So we used it the rest of the time there. The pickpockets got his wallet out of a zipped pocket from under his shirt."}, {"username": "Nadia Nadia", "comment_text": "I have just bought this via ebay/ amazon . Hoping for the best"}, {"username": "Nanette Mlynarczyk Nelson", "comment_text": "Just because some people \"didn't have a problem wearing 'x'\" doesn't mean you won't. Your absolute best bet is to go with your valuables under your clothing. A money belt is completely hidden so not a temptation for thieves. If wearing a dress, you can get the kind you wear around your neck that slides down the front of your dress and again is completely invisible to a thief. Bear in mind: if a thief can see it, they can take it. If it's in a pocket of any kind - front, back, in your bag or fanny pack, a thief can get it. Why take a chance on ruining a trip?"}, {"username": "Shirley Lewis", "comment_text": "I was taking to someone who had just had her camera stolen from a front facing fanny pack"}, {"username": "Kate Barrie", "comment_text": "It does mark you as a tourist and therefore a target because (some) tourists carry more cash on them than they really need to. When I'm travelling I try to blend in with the locals and only carry enough cash for tips and the odd drink. Also any bag with a clip fastening like waist bags are easy to remove if someone is passing you."}, {"username": "Mindy Jo", "comment_text": "The theme here is public transport. Also if they make you their mark there is little else you can do."}, {"username": "Thad Russell", "comment_text": "Who on earth says not to?"}, {"username": "Annmarie DiVola Giordano", "comment_text": "I use a small crossbody bag"}, {"username": "April Palmer", "comment_text": "I wore a Fanny pack but across chest , went in May so had thin jacket over it most of time . If in crowded area and walking or standing my husband typically walked or stood behind me to always be in way of walkoffs , to avoid cutting it or unbuckling it. I will say we were definitely warned about this but never felt any of this was around us the whole time in Italy. But better to be prepared then not."}, {"username": "Carmen Tavone", "comment_text": "For the ladies cross body bags are great but I would still carry a money belt with my credit cards and money underneath my clothes where it is not visible."}, {"username": "Krystal Apolinaro", "comment_text": "We used those, even my 21 yr old son did. I noticed a lot of guys using them in our recent trip to Italy. They are handy and safe."}, {"username": "Sylvie AJ", "comment_text": "fanny pack"}, {"username": "Libertie Oknames", "comment_text": "Everywhere in Europe people are wearing them"}, {"username": "Joanne-Peter Hart", "comment_text": "I am wearing a small slash proof RFID neck pouch, one pocket for passport, another for cards and cash. I wear it cross body under my clothes and tuck it into my trousers so you can’t tell I’m wearing it. I have a metal tether plus crossbody chain on my phone. A water bottle in one hand, and a hat. That’s it. No one comes near me. At the Colosseum my son and I just stepped back and watched. Those with bags were constantly hounded, and groups were around them. We were left alone."}, {"username": "Jazz Caldwell", "comment_text": "Knife in hand this can be stripped off of you very easily. Thieves have been know to use scooters..."}, {"username": "Phyllis Snyder", "comment_text": "Who are they?"}, {"username": "Emily Smith", "comment_text": "I personally like money belts to keep my passport/extra credit cards/extra cash in. I only keep one card and enough money for the day in a cross body bag. The rest is in my money belt under my clothing."}, {"username": "Nicole Keller", "comment_text": "I wore mine with no issues. It sat right on top of my public bone so I definitely would have known if there were any hands going into it. 😂😂"}, {"username": "Mark Freid", "comment_text": "A money belt is very slim and fits inside of your waistband. A fanny pack or a Crossbody bag is a bigger bag that you carry on the outside of your pants or around your shoulder.\n\nI highly advise using a money belt."}, {"username": "Carrie Lamm Bishop", "comment_text": "With my blouse over the Fanny pack, it’s very hard to get into it, front or back."}, {"username": "Robin Burrell", "comment_text": "I have a lululemon running belt that I wear crossbody with zipper to inside. Fits the essentials and works great. I found out a long time ago if I wear a Fanny bag or crossbody purse I become the designated carrier of other peoples crap"}, {"username": "Jade Stringer Alkire Wisecup", "comment_text": "Fanny packs are the new trend, which I do not understand."}, {"username": "Melisa Kish", "comment_text": "I'm going to use a crossbody only for my water bottle, scarf for the churches, chapstick, phone etc. I bought a flat pouch that goes around my neck for my cards, cash, passport etc. I will wear it under my shirt!"}, {"username": "D'Anna Sullivan", "comment_text": "You can wear them….. Don’t worry about it. If you can conceal it a little, that’s good. Don’t overfill it so it becomes too heavy."}, {"username": "Candace Beutell Gardner", "comment_text": "This is what my husband uses whenever we travel abroad. Lightweight and holds money, credit card and passport. Fits nicely around neck and goes under shirt. Not visible from the outside."}, {"username": "Chris Aman Florian", "comment_text": "I wear a money belt around the waist, under clothes for credit cards and money.\n\nAlso had a crossbody small purse with water, sanitizer, and tissues. Noticed it was open, waiting in line at the Colosseum. I’m sure they thought the tissues were money.\n\nAlso saw issues at the Trevi fountain. Need to pay attention and realize it can happen."}, {"username": "Jun Cee", "comment_text": "fanny pack carriers make you the easiest mark for pickpockets. it's blatant visibility speaks 'there's something worth stealing in there.' to them. common sense dictates that you just leave your passport and most of your precious belongings at the hotel safe or front desk. unless you're in Sub-Saharan africa or russia, there little chance you'll need to present your passport while touring the sites."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Have a look at the cross body pouches instead."}, {"username": "Catherine Avery", "comment_text": "I loved wearing mine for travel. I kept my credit cards and cash in a money belt and phone etc in the belt pouch. I made sure to have my hand holding it when I was in big crowds just like I would do with any bag in any city."}, {"username": "Kate Laidlaw", "comment_text": "Try to get one that cannot be slashed.\n\nYou’re going to look like a tourist with or without one."}, {"username": "Tracy Potter Holmes", "comment_text": "I love mine , travelled to three different places in Italy . It was perfect as in front of you whole time . You can get some really nice ones aswell . I got mine from Steve Madden as I like a bit of bling ✨. Daughter likes plain stuff so got a plain black one from primark . I will definitely use it again 😁"}, {"username": "Christine Pinto Kulp", "comment_text": "They are handy but can easily be cut off or the buckle released. If you can find one from the Travelon company (safety purses, backpacks, etc) with a wire that runs through the belt and with locks, it would likely be safe."}, {"username": "Lorraine Swick Sanfilippo", "comment_text": "We used them in England last week ."}, {"username": "Jackie Macleod", "comment_text": "Sorry, the whole of the Scotland can't take something called a fanny pack seriously"}, {"username": "Alice Dzimiera", "comment_text": "I have 2 Travelon antitheft crossbody bags that have a metal cable running through the strap that can't be cut& interlocking zippers"}, {"username": "Sheri Dettman", "comment_text": "I always wear one. Lots of cute styles and it keeps your hands free."}, {"username": "Alison Gilchrist", "comment_text": "I had my purse (wallet) taken from a waist bag on the metro in Rome. Never wearing one again. I like a sling bag. Still hands free but much more secure."}, {"username": "Ryan Shearer", "comment_text": "You are going to look American regardless. Wear what you like."}, {"username": "Dee Knudson", "comment_text": "Lulu limon"}, {"username": "Katie Marie", "comment_text": "I wore a skin matched rfid money belt that I put extra euros and my passport in under my dress then had my crossbody for euros and my phone and it was so handy. I get conflicted about what to do when I’m not wearing a dress because I don’t want it shown."}, {"username": "Sharon O'Connell", "comment_text": "My issue will be that I have a red medical bag that I wear everywhere, 24 7. It includes syringes and cortisol along with other meds because I have 2 life threatening diseases and can have a crisis anytime. Also includes instructions on what to do and other medical info. It's too much to hide. I'm 5' 2 120lbs. Need to start researching on how to secure it to me."}, {"username": "Barb Krieg-Stepien", "comment_text": "I just got back from Italy. I wore my Fanny Pack as a cross body in front the entire trip. Never had one problem. Only issue maybe zipper rubbed under my armpit with tank top or dress. I think it’s personal preference 🤷🏻‍♀️"}, {"username": "Stacy Derouin", "comment_text": "I would wear a fanny pack or cross body before I'd ever wear a back pack!"}, {"username": "Terry Pisano", "comment_text": "Who says not.to wear them? I'll be wearing one. Like you, I'll scream tourist with or without it."}, {"username": "Anthony Martini Jr.", "comment_text": "Never heard of such a thing. Everyone there has a purse/murse whatever you want to call it!!!"}, {"username": "April May", "comment_text": "I used a cross body bag and when I was in a crowded area like by the Trevi fountain I held my hand on the zipper. No issues.\nI think the biggest thing is just being aware of your surroundings."}, {"username": "Nicole Gouzoules Sheehan", "comment_text": "My husband and I both wore them last week in Rome and thought they worked great!"}, {"username": "Debbi Beston", "comment_text": "My bum bag (fanny pack) was on my front and someone managed to get in it."}, {"username": "Kimberly Moser Horincewich", "comment_text": "I wore one and kept my hand on it the whole time. Thankfully, no issues at all."}, {"username": "Sarahfina Wipf", "comment_text": "Everyone wears them. Not just tourists. They’re in style. Wear them across your torso and one shoulder"}, {"username": "Cristina Toscano", "comment_text": "Honestly, the Fanny packs are a trend now haha not just for tourists! I wear as a cross body!"}, {"username": "Tina Taylor", "comment_text": "My husband wore a Fanny pack when we were on a tram. He’s a big guy and always very careful and extremely cautious, with his hand on zipper at all times in tram. As tram got more crowded, we stood up to get off, again, husband with his big hand around pack. We were like sardines in the tram, being pushed in the opposite direction by someone as we were getting off and literally within seconds, the Fanny pack was unzipped and passports were gone. The pickpocket was out the other door and gone! They are slick. He thought he got a wallet as passports were in a leather folder but bad enough as we spent a day in the American embassy getting temporary passports. Lesson learned. Now cable ties or under clothes."}, {"username": "Bill Elias", "comment_text": "I’ve got a smallish leather man bag - literally like a large purse. Various compartments but the outermost has a zipper and a flap. I keep my Wallet in my front pocket though."}, {"username": "Donna Gilardone Szwabowski", "comment_text": "I used my Lulu crossbody no issues, just beware in crowds to keep a hand on it"}, {"username": "Emma Grover", "comment_text": "I wore one for a month long trip through several European countries! One thing to keep in mind is that someone could unbuckle the belt and make off with it- I solved that by putting a ziptie through the buckle to make it impossible to unbuckle. I also carried a small cable lock to lock the zippers together in super crowded area and kept my hand on the zipper when walking. No issues!"}, {"username": "Wendy Spano Bracco", "comment_text": "I use my Lululemon only going through the airports. It’s too small for going around daily. I also think they could be more susceptible yo pick pockets but that is not a concern of mine. I use a cross body."}, {"username": "Debbie DiOssi", "comment_text": "I wear a sling bag. It goes across your chest. Many belt bags can also be worn as sling bags. Never had a problem."}, {"username": "John Wilson", "comment_text": "Stealing from any bag or Fanny pack is a three man job. One guy attracts attention in a crowd ( lineups;subway)\nanother guy cuts the bottom of the bag , third guy empties the bag of its contents. Pickpockets work in teams. No one wants to steal your fake LV bag or Fanny pack. They want the contents."}]}, {"id": "2206703903062021", "text": "Is the pendino area in naples safe?", "link": "facebook.com/groups/1373361046396315/permalink/2206703903062021/", "likes": 0, "comments": []}, {"id": "2206703683062043", "text": "This was a very interesting museum I found in Milan. The geology display was beautiful and amazing.", "link": "facebook.com/groups/1373361046396315/permalink/2206703683062043/", "likes": 1, "comments": []}, {"id": "2185834298482315", "text": "Paddle boarding tour from Sorrento to Bagni Regina Giovanna\nThere’s one surefire way to escape the Amalfi Coast’s crowds: get on the water. With this small-group tour, you’ll meet your guide, get acquainted with… आणखी your paddleboard, and head out on the crystal waters toward Punta del Capo. Once arrived, you’ll beach your boards and either head to explore the Roman villa of Pollio Felice—which dates back 2,000 years—go for a swim, or simply enjoy the exquisite, uncrowded views. Read more about Paddle boarding tour from Sorrento to Bagni Regina Giovanna - https://www.viator.com/tours/Sorrento/Paddle-boarding-tour-from-Sorrento-to-Bagni-Regina-Giovanna/d947-284551P1?pid=P00070587&mcid=42383&medium=link&medium_version=selector", "link": "facebook.com/groups/1373361046396315/permalink/2185834298482315/", "likes": 2, "comments": []}, {"id": "2206685173063894", "text": "Hi all,\n\nCan anyone recommend a tour of the Vatican ? I was looking at a breakfast and semi private tour? just wondering if anyone has done it and if it’s worth it?\nAny advice greatly appreciated\n\nAlso would you guys recommend any other tours in Rome?\n\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2206685173063894/", "likes": 4, "comments": [{"username": "Heather Sechrist", "comment_text": "From the people who did this tour that we’ve heard from it is amazing.\n\nMy husband and I did the City Wonder’s 8:30 tour and it was really entrance I to the Vatican closet to 9 and it was already filled with people. Manageable and not sardine packed like other pictures I’ve seen this year, but still harder to maneuver and see all the things without feeling a little rushed."}, {"username": "Amanda Bellamy", "comment_text": "I did the breakfast tour today with City Wonders. It was well worth it for me. Knowledgeable and friendly guide and not so busy at 7.30."}, {"username": "Kate Laidlaw", "comment_text": "We did the 7:30am breakfast tour (booked directly with the Vatican website, not private) and it was excellent. First group through. Later was chaos, well worth the booking 😅"}, {"username": "Don Picciano Jr.", "comment_text": "Krista Nolfi Beard Cara Picciano"}, {"username": "Anthony Martini Jr.", "comment_text": "Colosseum"}, {"username": "Carol Johnson", "comment_text": "I think with all tour depends on the tour guides .. I spend 3 weeks in Europe 9 different tours only 1 tour I wouldn't recommend ..the other 8 great"}, {"username": "Jim Bobrowski", "comment_text": "Pristine Sisteen with Walks of Italy was great. Early entry but no breakfast"}, {"username": "Millie Fisk", "comment_text": "Do it! It’s worth it."}, {"username": "Dayna Scinto", "comment_text": "From my experience this week, I booked a third party breakfast tour of Vatican/\nSistine Chapel and because our breakfast was first (not tour) it was busy when the tour part started. I would recommend booking direct if possible."}, {"username": "Kirsty White Brien", "comment_text": "Heather Winbank"}, {"username": "Stjepan Kujadin", "comment_text": "😳😳😳"}, {"username": "Alyssa Culverwell Ostergren", "comment_text": "We booked the 730 through the Vatican.. SO WORTH IT!!!"}]}, {"id": "2206636263068785", "text": "I’m travelling around Italy in January/February. What are some good places to visit during the winter?\nTIA", "link": "facebook.com/groups/1373361046396315/permalink/2206636263068785/", "likes": 0, "comments": [{"username": "Rita Levi Montalbano", "comment_text": "that's too general a question. do you want to ski or stay on the snow anyway? go to Valle D'Aosta, Trentino or in any case in the north, there are the splendid alps. Italian cities (Milan, Venice, Rome, Florence) are not theme parks, so you will find them open and functioning even in winter, you can very well visit them. if you want to avoid a bit of cold, in southern Italy even in winter it is almost always above 0°. In short, you can do whatever you want, it depends on what trip you want to do"}, {"username": "Rhonda Hope", "comment_text": "Rome, Florence, Venice"}]}, {"id": "2206661033066308", "text": "Can anyone recommend a good hairdresser and barber in Rome please?", "link": "facebook.com/groups/1373361046396315/permalink/2206661033066308/", "likes": 1, "comments": [{"username": "Alison-Rose Barnard", "comment_text": "Take your chances. I did back in 2019 in the middle of the Camino in Spain. Just walked in, tried to say I needed root's done and a slight trim in Spanish. She did a bloody good job."}]}, {"id": "2206666723065739", "text": "Hello everyone!😉\nGonna travel to Milan on August 6th till 13th and wanna visit Florence and Genoa. Any tips about public transporter or how to get taxi. Or any suggestions about tours around one city or between them ( like Florence + Pisa)\nAnd in case if someone also travel alone these days, I'll be happy to have a company.", "link": "facebook.com/groups/1373361046396315/permalink/2206666723065739/", "likes": 0, "comments": []}, {"id": "2206667563065655", "text": "What cooking classes in Rome do you recommend?", "link": "facebook.com/groups/1373361046396315/permalink/2206667563065655/", "likes": 2, "comments": [{"username": "Annette Bertram", "comment_text": "I booked two through Viator. Both classes were held at Gusto restaurant (just outside Piazza Navona). In the first class, we made 2 types of pasta as well as tiramisu. It was a lot of fun. The next day I did another one, and we made pizza and gelato. I was travelling solo and it was a great way to meet people and spend time chatting when we sat down to eat what we’d made."}]}, {"id": "2206683803064031", "text": "We have to be at Pompeii at 9am. Staying in Naples, what is the cheapest, easiest way to get there?", "link": "facebook.com/groups/1373361046396315/permalink/2206683803064031/", "likes": 17, "comments": [{"username": "John Bruckman", "comment_text": "Train"}, {"username": "Mary Vicente", "comment_text": "Ask for Pasquelina to be your guide in Pompeii. She is phenomenal!"}, {"username": "Rachel Bradfield", "comment_text": "Train"}, {"username": "Jeff Gentner EA", "comment_text": "Train"}, {"username": "Mark Spielman", "comment_text": "The dreaded Circumsuviana, you've been warned."}, {"username": "Nicholas Coudsy", "comment_text": "Let me know what you end up doing - I'm doing the same thing Sunday! 🙂"}, {"username": "Jan van der Plas", "comment_text": "When you are by car now, you can park the car for 10 euro's a day in pompei. From pompei you can take the train for a couple of euro's to Napoli.\nDon't go by car to Napoli."}, {"username": "Michael Barnes", "comment_text": "Cheap and easy don’t usually go together in the same outcome, just sayin,"}, {"username": "Lyn Pappas Dahm", "comment_text": "Circumvesuvious\ntrain is the cheapest and easiest. Just be aware of your surroundings."}, {"username": "Rick Schneider", "comment_text": "Train"}, {"username": "Kathleen Jarvis", "comment_text": "Train"}, {"username": "John Spensieri", "comment_text": "Take the train, but not the local one. There is an express and inexpensive one."}, {"username": "Yuko Y Smith", "comment_text": "train"}, {"username": "Angelo Adamo", "comment_text": "Train is the cheapest option and take the early ones and a short walk to the gates . Taxis is approx 50 E"}, {"username": "Valentina Frater", "comment_text": "Train"}, {"username": "Carmen Cullen", "comment_text": "Dareon Carrington"}, {"username": "Frank Pastori", "comment_text": "Us too. We are are In Atrani and need to be there in September and have the same tour"}, {"username": "Russell Weidner", "comment_text": "Many options, do the research"}, {"username": "Dharma Rai", "comment_text": "Take a train."}, {"username": "Greg Mcphee", "comment_text": "Train cheap and scenic"}, {"username": "Carmela Downer", "comment_text": "Not sure if this is the best place to ask. But feed back would be helpful….Lookin\ng for house or apartment to rent in Napoli that can accommodate 6 people."}, {"username": "Sandi Marella Johnson", "comment_text": "Train"}, {"username": "Jean Fremineur", "comment_text": "Spend the night in Pompeii"}, {"username": "Barbara Dixon Woods", "comment_text": "I hired a private car. Was perfect and not expensive"}, {"username": "Amanda Casabona-Cohen", "comment_text": "￼are there taxis in Pompeii?"}, {"username": "Nick Brown", "comment_text": "walk"}, {"username": "Martinez Martin", "comment_text": "Just take a taxi"}, {"username": "David King", "comment_text": "Definitely take the train round trip! No AC, but the huge windows open and the breeze is amazing… fun shots of Vesuvius as you pass!"}, {"username": "Amy French Baillie", "comment_text": "Campagna express train"}, {"username": "Tara McCloud Odebrecht", "comment_text": "Train. It lets off 1/2 block away."}, {"username": "Valerie De Jonghe", "comment_text": "Train!"}, {"username": "Glenn Todd Webb", "comment_text": "Easy car tour Naples is the easiest with pick up at hotel."}, {"username": "Allan Olexa", "comment_text": "The local train from Centrale to the entrance to Pompeii."}, {"username": "Kim Shea", "comment_text": "I’m wondering if it’s easy to drive to Pompeii from Rome !?!!"}, {"username": "Jill Charney O'Connor", "comment_text": "Metro. Super easy, clean and safe. I did it last week with my teenaged kids.\nAsk your hotel desk or concierge. They were so helpful everywhere we staye s"}, {"username": "Starla Dawn", "comment_text": "Stay in Sorrento"}, {"username": "Philip Curnow", "comment_text": "Allan Olexa is spot on. Do check the timetables. It's called the Circumsuviana."}, {"username": "Chiara Codecá", "comment_text": "I think the train from the Vesuviana line stops directly at the ruins. It has a station called Pompei Scavi, check it online."}, {"username": "Shannon Plane", "comment_text": "Catch this train, it’s cheap and direct. No aircon and isn’t great but it gets you there.\nWe went from Sorrento, stopped at Pompei then went onto Napoli this morning.\n\nhttps://\nwww.sorrentoinsi\nder.com/en/\nnaples-to-sorren\nto-train-schedu\nle"}, {"username": "Marissa McLean", "comment_text": "The train from Napoli centrale, last year when I went it was about €3. Take the sorrento line it stops in Pompeii"}, {"username": "Christina McCollough", "comment_text": "Take the train"}, {"username": "Diane DiMartino", "comment_text": "Local trains will take you right there"}, {"username": "Bennett Richards", "comment_text": "I would stay in Sorrento and not in Napoli if you need to be there early."}, {"username": "Max Perletta", "comment_text": "Circumvesuviana\n, Piazza Garibaldi near Central station, then you descend at Pompei scavi."}, {"username": "Baba Aga", "comment_text": "Train from Napoli Centrale"}, {"username": "Kelly Meredith", "comment_text": "Campania Express is a train that is really nice from Garibaldi station. It has A/C and is less crowded. But i looked at the time and you will get in at 9:01 so I am not sure if this will work for you but it is a MUCH NICER train. We took it from Naples to Sorrento last year."}, {"username": "Skye Birch", "comment_text": "circumvesuviana"}, {"username": "Gaby Devyll", "comment_text": "Train circumvesuviana"}, {"username": "Meredith Holloway Helbon", "comment_text": "Following"}, {"username": "Kimberly Pex", "comment_text": "Shuttle or taxi"}, {"username": "Andrea Ferretti- Kearney", "comment_text": "Train."}, {"username": "Anne Mc Namara", "comment_text": "Train is the easiest"}]}, {"id": "2206658593066552", "text": "Hi we are visiting Italy next year (May - June) from Australia. We love coffee. I’m just curious how much it is in Italy 🧐\n\nIs the price different between “take away” vs “sit down”? I read that they charge the sit down fee.\n\nI usually drink Almond Milk Cappuccino small (regular) size.\n\nLet me know and if you have coffee photo, please share it 😆\n\nThank you ☕️", "link": "facebook.com/groups/1373361046396315/permalink/2206658593066552/", "likes": 12, "comments": [{"username": "Nancy Day", "comment_text": "It is said that cappucino after 11am is taboo"}, {"username": "Dunia Aldyni", "comment_text": "I am from Australia too I love coffee ☕️ I just back from Italy last month their coffee not good like Australia 🇦🇺 they don’t have variety of coffee espresso ☕️ very strong and cappuccino is milky"}, {"username": "Maria Musumeci", "comment_text": "Oh we love our coffee too!!\nLike yourself I drink almond milk or lactose free.\nI did manage to find some places that made a cappuccino or cafe latte with Almond milk. Although I became accustomed to having short blacks whilst over there!\nJust ask if they have Latte di Mandorla senza zucchero, so it's like our Unsweetened Almond Milk.\nCoffees will be anywhere from €1-3 depending what city, what coffee type & size. Around $1.60-5.50 aud."}, {"username": "Louise Maree", "comment_text": "At home here in Oz I drink small or regular latte. But in Italy I drink macchiato’s. I found in the smaller towns they wouldn’t charge us to sit down to drink our morning coffee."}, {"username": "Graham Sherlock", "comment_text": "I normally get a cappuccino in Australia in Italy I ask for a Latte Macchiato Grande, it's normally 1.50 euro and a sweet bite to eat is 1.20 euro, both of which is less than half the price of Australia, no charge for sitting down. You probably only get charged for sitting down right in the middle of tourist hot spots."}, {"username": "Bellafab Fabrizio", "comment_text": "You wont be able to get almond milk in italy. I couldnt even get skim milk and one of the others is right its alot weaker"}, {"username": "Alison de Lisle", "comment_text": "I am here now in Florence. I drink Almond milk lattes at home too.\nForget home coffee as you’re not going to find it here. Best option we’ve found is cow milk latte with extra shot of espresso. It’s also expensive in all the tourist locations. I mean really expensive. The most we paid was in Saint Marco square in Venice because there is also a cover charge for sitting at the cafe."}, {"username": "Maria Wood", "comment_text": "In my experience after traveling through Italy this past July, the coffee in Australia is so much better. They don’t do cappuccino’s well. They are always luke warm and weak. I couldn’t get almond milk anywhere, which was expected. I enjoy espresso’s so mostly ordered those or café macchiato’s.\nIn terms of cost, they are not expensive."}, {"username": "Carly Plantagenet", "comment_text": "Find out when u get there"}, {"username": "Marcus Hiesler", "comment_text": "Expresso with one sugar is very nice."}, {"username": "Richelle Trezise", "comment_text": "I have been told to order a caffe latte in italy. I am going next month I will post it"}, {"username": "Vanessa Durkin", "comment_text": "Actually surprised coffee not as good in italy currently gere and the cappucino tastes weird because tge milk tastes lije old type sterilused not nice at all had one at a restaurant last night and two at hotel this morning but not very enjoyable tgey seem to serve small cups of espresso mostly as thats mainly what the people here drink think irs around 4.50 fir a cappyccino but some places was 6.50 heading to starbucjs later to test theirs"}, {"username": "Michelle Smith", "comment_text": "Italy in June this year\nI wasn't able to find almond milk\nCoffees were a hit and miss.\nDon't ask for latte you will get milk lol\nGood luck"}, {"username": "Sharon McCarthy", "comment_text": "If you have milk coffee (latte, cappuccino etc) ask for an extra shot. They make it similar to American tastes ( 🤢) so you'll need extra coffee.\nLast visit I found a coffee shop a few doors away from my hotel that had a Barista who learned his craft while living in Melbourne for 2 years and worked at Brunettis in Carlton which was a win!!"}, {"username": "Lauren Vassallo Beattie", "comment_text": "Once you drink Italian caffè you won't be able to drink the crap over here unless it's Italiano. You stand at the bar pay less, sit down pay more. Their expresso or short macchiato is to die for. Some places we paid 50 cents for an expresso. I usually drink coffee from Napoli as it is stronger."}, {"username": "Dawn Falsinotti", "comment_text": "They don’t do a lot of takeaway coffee. Espresso is enjoyed at a bar standing up. Cappuccino with almond milk? Good luck. Trying to find American coffee won’t be easy."}, {"username": "Fiona Cameron", "comment_text": "No choc on cappuccinos in Italy, and don’t try ordering after 11:30.\nYou may get soy milk in a cafe but not almond"}, {"username": "Deborah Coram", "comment_text": "Fellow almond milk coffee drinker here. It’s not a thing over there. I ended up just moving to espressos and their espressos are fabulous and cheap! (Even in truck stops). I tried their oat milk (avena) cappuccinos but honestly they were mostly horrid. Alternative milk Coffees are 1000% better in Melbourne. Coffee is generally cheaper in Italy than in Melbourne"}, {"username": "Fafo Elkablie", "comment_text": "3€"}, {"username": "Leesa Martin", "comment_text": "We are from Australia also coming in sept. My hubby loves an espresso but I don’t like coffee at all. I’m looking forward to trying all the wine windows and Prosecco. Anything else in Italian that is a must try? We are happy to try anything 👏👏. Loved reading everyone’s answers"}, {"username": "Paulina Ziemba", "comment_text": "If you can drink/like oat milk, try Alproccino, if you get the chance"}, {"username": "Katie Marie", "comment_text": "Got this yesterday morning in Rome. Take away for exact same thing was $7 euros and when I sat on the patio yesterday it was $21. I enjoyed take away much more lol."}, {"username": "Lydia Manuela", "comment_text": "Who knew there were so much to consider with ordering a simple cup of coffee 😬😬😬 stand, sit, times to order…all interesting information 😃"}, {"username": "Elizabeth Jayne Harris", "comment_text": "Richard Harris"}, {"username": "Linda Nogara", "comment_text": "Don’t go to tourist places. Coffee should cost no more than 1.40 euro for a cappuccino. And a croissant about 1.50 max. And that was table service! Take away coffee is also not a thing they do much. Italians like to enjoy their coffee and food. If you’re in a rush, stand at the bar. It also costs less to stand at bar."}, {"username": "Lorraine Christina", "comment_text": "Italians are known for espresso, not coffee."}, {"username": "Colleen Lee", "comment_text": "I like the coffee in Italy, usually order caffe' latte, the price varies, close to the tourist attractions the more expensive. Don't get too fascinated with the sit stand thing, in a small town away from the maddening crowd it can vary from €1,20 to €3, 50.\nSome places put a small homemade biscuit on the teaspoon. 😁. Do yourselves a favour and investigate the side streets for great food, drink, gelato always better, cheaper more authentic, never dine at a tourist attraction. 👌🏻 By the way,\nItalians will never laugh at you. They will sometimes correct my bad Italian, but not laugh. Enjoy your trip. ❤️ 🇮🇹"}, {"username": "Kathleen Roll", "comment_text": "€1 in Rome is common\n\nI did take away in Piazza del Popolo early in the morning when we had to meet guides for a tour one trip but then another time I just stood with the locals and drank it and walked out two inches taller and could see twice the distance - yum.\nTry a shakerato- espresso shaken over ice. I never have sugar but in this - hell yeah as having tried it without and ewwww.\nIt a caffè corretto 😂 nice and warming."}, {"username": "Linda Di Marco", "comment_text": "£12.50 for two pots of tea in Capri"}, {"username": "Alexandra A Welker", "comment_text": "Yeah take away is cheaper. Condorelli Almond Milk or Latte di Mandorla is a popular Almond Milk in Italy."}, {"username": "Etschi Bruckner", "comment_text": "Italians might laugh about the almond milk...😂"}, {"username": "Alessandro Iannelli", "comment_text": "Almond Milk Cappuccino is not something every bar will have. but it shouldn't be too hard to find it, if it's not the first or second bar it will be the third. a normal espresso is around one euro but in tourist areas it can be a bit more."}, {"username": "Bernadette Collins", "comment_text": "Request extra shots of coffee. I found the coffee weak compared to Australia. Ironically the best coffee I had was in Napoli from an Italian who confessed to me he learnt how to make coffee in Melbourne!"}, {"username": "Pam Gerretsen", "comment_text": "This is a coffee in Italy - small, strong shot that everywhere else would call espresso!\n\nIn Rome there is a law that, if you stand at the bar like a local, the price is regulated, so shouldn't be more than €1.20 I think. If you sit down, it could be any price, so always check!"}, {"username": "Gianna Onesi", "comment_text": "I think it's best to research before you go get a sense of the culture it will help you. 😉"}, {"username": "Kate Laidlaw", "comment_text": "We’re from Melbourne and in Italy now. Coffee culture is better in Melbourne. The “cafe con latte” and caps have been milky. I’d recommend an ice latte or simply an espresso shot (gotten to like it)"}, {"username": "Enas Mourad", "comment_text": "You will have the best coffee in this whole wide world not only it’s great coffee but also made by the warmest people in the world just go to a local bar you may find almond milk but it’s not common there"}, {"username": "Dafne Vassetti", "comment_text": "We don't do take away in Italy, unless you are going to Starbucks or similar places. In Italy you either have coffee al bancone (they serve it to you and you drink it standing at the counter) or sitting. You can get a regular coffee (espresso), caffè macchiato, espresso coffee with a tea spoon of milk, cappuccino (not after noon), caffè e latte is a glass of milk with the addition of coffee, you can also ask for an Americano, caffè doppio (stronger espresso coffee), mokaccino, caffè shakerato, caffè freddo. Some specialized places do coffee brew. Italy has a STRONG culture regarding coffee. But nothing to do with what they serve in Australia, which is pretty different."}, {"username": "Anthony Martini Jr.", "comment_text": "1 euro to max 1.50 euro"}, {"username": "Dafne Vassetti", "comment_text": "Ps: please, don't ask things you would ask in Australia in Italy. Different country, different culture, different coffee."}, {"username": "Dafne Vassetti", "comment_text": "PPS. Also we don't do sizes, unless again you are going to Starbucks or similar places b"}, {"username": "Michael Widjaja", "comment_text": "Regular espresso typically cost €1-1.5 if you drink on the counter,if you sit it can go from €3-25 (yup,that antique cafe in Venice)\n\nAnd I rarely see any almond milk in Italy…\n\nAnd if you go during colder months,check out pocket coffee,c’è molto molto delizioso"}, {"username": "Sara Gilardi", "comment_text": "Take away is very unusual. You can either sit (and pay a fee) or drink your coffee standing at the counter. I don't think you will easily find almond milk. I ll see if I can retrieve some fancy coffee pic 🙂"}, {"username": "Sara Gilardi", "comment_text": "Basically cappuccino vith cream"}, {"username": "Sara Gilardi", "comment_text": "So called American coffee (regular Italian coffee plus hot water)"}, {"username": "Sara Gilardi", "comment_text": "Ice coffee"}, {"username": "Junko Osaki", "comment_text": "0,80 cents to 1,20€ for espresso, depending on where you’re buying it. Cappuccino could be up to 2€-2,20€, but I don’t think I’ve ever seen them using almond milk for it, they usually make it with soy or oat milk"}, {"username": "Frances Barnes", "comment_text": "Wait until I ask for decaf coffee 🤦🏻‍♀️"}, {"username": "Rebecca Yeoh", "comment_text": "Fellow Aussie here. I think I paid 1€ for a cappuccino in Rome and 5€ in Capri 😱. My order at home is a weak flat white but in Italy I did a standard cappuccino every time and loved it. I tried not to order anything that wasn’t the norm, because, you know…when in Rome! The coffee there is amazing."}, {"username": "Helen Ewing", "comment_text": "I'm a skinny cafe latte drinker in Australia because my body can't tolerate full cream milk. In past visits I've had to drink espresso because different milk options are not really a thing in Italy. This last trip though, I was able to get lactose free milk in many cafes. Ask for \"latte senza lattosio\"."}, {"username": "Zucchero Candito Kandinsky", "comment_text": "There is just one size for cappuccino in Italy. It is about 150 ml"}, {"username": "Nissa Nolan Foster", "comment_text": "You’re gonna miss Almond Coffee, they do have soy (soia) and it’s now become quite common. I saw a few locals order it (and not just at breakfast)."}, {"username": "Heather Wise Wheelton", "comment_text": "The best coffee is in Australia, I could not get a decent coffee during my travels through italy"}, {"username": "Katia Macri-Roberts", "comment_text": "Be aware that cappuccinos are a breakfast item and not generally offered during the rest of the day. You will still be able to get them but with added eye rolls free of charge. 😃"}, {"username": "Nadia Mckenna", "comment_text": "Also, Italians mainly drink cappuccino or caffe latte during breakfast hours. After that , it’s espresso!"}, {"username": "Anna Gambino", "comment_text": "You are going to Italy where coffee itself is part of the cultural experience. It’s not the same as the United States and I’m guessing not the same as Australia. It was a different experience for me but I adapted to the cultural differences and enjoyed them."}, {"username": "Susan Hulsey Watkins", "comment_text": "Espresso."}, {"username": "Julie Norris", "comment_text": "I'm Australian and found coffee in Rome much cheaper than home. They don't serve it scalding hot like here so you drink it fairly quickly. I used to ask for my caffe molto caldo (very hot) but gave up and just embraced the Italian way 😃 I prefer Americano which is similar to black filter coffee in Australia. I didn't see many milk alternatives but I wasn't looking"}, {"username": "Julie Norris", "comment_text": "This Americano with water and pastry was €7 at Castel Sant Angelo"}, {"username": "Julie Norris", "comment_text": "Americano in Rome"}, {"username": "Alice Francesca", "comment_text": "Yes of course it s different if you drink it standing (al banco) or sitting down (al.tavolo) because there is the service fee.\nNot sure about almond milk being used as much as soy milk at cafes.\nSome might have it, some might not.\nA cappuccino is about 2.50/3 50 Euros depending on the venue."}, {"username": "Claudio Blizzard Indastria", "comment_text": "Single espresso is around 1 euro. Tourist traps can skyrocket the price.\n\nTake away or not the price stays the same.\nSome bars charge the sit down (servizio al tavolo), some don't, it's quite random.\nIt is supposed to be a small amount anyway , when it's 4/5 euro or even more, it's a tourist trap for sure."}, {"username": "Pietro Adami", "comment_text": "“Almond milk cappuccino” is NOT coffe for italians 😂😂"}, {"username": "Kristina Ruk", "comment_text": "Almond milk is not popular in Italy..for replacement cow milk they use oat or soya.."}]}, {"id": "2206632999735778", "text": "Hi! Someone just posted to not book tours with Get your Guide. Well I have the colosseum and the Vatican booked through them for October, I’m worried. Can I get some feedback for this? Or a better option?", "link": "facebook.com/groups/1373361046396315/permalink/2206632999735778/", "likes": 5, "comments": [{"username": "Beatriz Davalos Moreno", "comment_text": "I just came back and had tours with get your guide and Viator. Had no problems with get your guide, I had several tours schedule with Viator and had a problem with the tour to Louvre, it was through Quantum company. They changed the times without letting me know, could never open the tickets and when called the support number to Quantum they said hahahaha we scammed you!"}, {"username": "Beatriz Davalos Moreno", "comment_text": "So we were not able to attend the Louvre. It was very dissapointing!"}, {"username": "Kirsty Manning", "comment_text": "The issue is less to do with get your guide/Viator and more the tour providers - there are many listing tours on these sites. We booked the colosseum through a tour group on get your guide as we couldn’t get tickets direct. We and many many others arrived at the meeting point in the day to find the tour group wasn’t taking us but also not telling us why. We missed out on going, but get your guide did sort the refund.\nI’d say be careful which provider you’re using on get your guide/Viator etc."}, {"username": "Gianna Onesi", "comment_text": "I have something booked through them too I don't think it's an issue"}, {"username": "Blanca Gil", "comment_text": "This past April, I wasn’t able to get entrance tickets through the official Colosseum site. So, I used Get Your Guide. Everything went well, no cancellations."}, {"username": "Michelle Solak", "comment_text": "We booked a colosseum tour through get your guide and had no issues!"}, {"username": "Dayna Scinto", "comment_text": "We used them this week for both Colosseum & Sistine Chapel/Vatican tours and had no issues."}, {"username": "Victoria Laverty", "comment_text": "The problem isnt get your guide in my opinion\nThe tickets to night at colleseum underground are highly sort aftet and companies sell them prior knowing if they can get them\nOnly official site is coop culture"}, {"username": "Naomi Rubio", "comment_text": "I did the Vatican through them and no issues I would book again"}, {"username": "Ka Ben", "comment_text": "I booked get your guide before and I had no problems."}, {"username": "Carissa Lawson", "comment_text": "I’ve booked many a tours in different countries and no issues"}, {"username": "Laurel Buchanan Layton", "comment_text": "My family has had several tours through GYG and Viator while in Italy and all have been seemless."}, {"username": "Luisa Macheda", "comment_text": "I used Get your Guide all throughout Italy. Everything ran smoothly. Colosseum itself is cancelling underground tours. Get your guide are just a third party agency. I was advised of my colosseum tour being cancelled but I was given an alternative option, which was wonderful, and also received a 25% refund because of this."}, {"username": "Bellafab Fabrizio", "comment_text": "Get your guide is great. You will be fine."}, {"username": "Martha Tuzson Stockton", "comment_text": "I’ve been lurking in this group for awhile, and regardless of individuals’ experiences, guided tours booked through anyone other than the actual venue (Vatican, colosseum) can be canceled, often right before. It is more secure (and more difficult) to get tickets through the actual venue. I have booked a (cancelable) tour with an outside vendor, and I will try to get tickets through the venue and cancel the outside tour if I get them. One other note - with GYG, it shows the actual tour operator of the tour on the listing. I go to that company’s website and book through them. Often there’s a discount. GYG is like Expedia for tours - a third party that has little to do with the actual tour."}, {"username": "Terry Pisano", "comment_text": "You will only see the complaints here. For every complaint, hundreds went well. You'll be fine. And remember, there's gonna be hiccups in your plans. Roll with it!"}, {"username": "Yvonne Ormson", "comment_text": "There were several posts a couple weeks ago about the coliseum website being hacked—which led to all the issues with cancellations. Get your guide and viator we’re not at fault.\nWe’ve used both many times with no issues."}, {"username": "John Green", "comment_text": "We had 3 tours through them. No issues"}, {"username": "Lisa DiDonato Hayden", "comment_text": "I booked with both Get Your Guide and Viator for our recent trip with no issues!"}, {"username": "Rhona OConnor", "comment_text": "I found them very good 👌"}, {"username": "Wendy Spano Bracco", "comment_text": "I just don’t understand. If you go to GYG, you see the name of the tour operator. Why not just book direct with the company vs 3rd party. I have done this twice and it was a little less money too."}, {"username": "Beth Anton Grous", "comment_text": "GYG and Viator are booking engines which serve small your companies well by giving their tours global reach and automated tools. Neither runs tours - if the tour cancels it is the tour operator (could also happen if you booked directly) and NOT Viator or GYG. In fact companies that cancel a lot will get kicked off the platform or deprioritized in the list. If you book a well rated tour with recent ratings you should be fine."}, {"username": "Tina Costopoulos", "comment_text": "We used Get Your Guide a few days ago for a skip the line tour of the Vatican, Sistine Chapel and St. Peter’s Basilica. No issues at all."}, {"username": "Jennifer Melka Maley", "comment_text": "Use a reputable tour company and you will be fine ! Coop culture is not a user friendly website and no flexibility with them so no refunds for any reason! Enjoy your wonderful tour!!!"}, {"username": "Kerri Bevilacqua", "comment_text": "I’d do the Vatican early morning tour directly with the museum. The Colosseum is tough because it’s so hard to get direct tickets. LivTours seems to cancel less than some of the other tour companies"}, {"username": "Line Gregoire", "comment_text": "I've always booked with them and never had any problem. Still have book with them for my next trip🙂"}, {"username": "Carol Taylor Tisdale", "comment_text": "Used them in Rome and Paris in early June and they were excellent."}, {"username": "Kathleen Roll", "comment_text": "I used Get your Guide all throughout Naples and had no issues."}]}, {"id": "2206653273067084", "text": "Shout out to La Gatta Cenerentola Rooms in Naples, Italy.\n\nI wanted to let everyone know of this amazing hotel in Naples. We arrived in Naples on a very hot afternoon and were anxious to get to our hotel to cool off. We arrived at the building and we were skeptical at first because the building was old and run down. But when our lovely host Diegoआणखी opened the door we were pleasantly surprised by a beautifully redone apartment. It was modern and the rooms were large with excellent bathrooms. The breakfast was delicious and huge. An added bonus is that this apartment was only 100 yards from Starita, one of Naples best pizza restaurants. It’s also only .5 miles from the archeological museum. I can’t recommend La Gatta Cenerentola enough!", "link": "facebook.com/groups/1373361046396315/permalink/2206653273067084/", "likes": 6, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2205930206472724", "text": "Hi! looking to plan a 10 day trip to Italy from Oct 25 - Nov 3ish. Looking for suggestions! Open to going to one additional country as well!\n\n* I have already done Florence and Rome 2x would prefer not to spend multiple days in either.\n\n* Not a great driver would prefer to transport via train or plane.\n\n* Please advise what is best for Oct/Nov Weather!\n\nThanks 😊", "link": "facebook.com/groups/1373361046396315/permalink/2205930206472724/", "likes": 5, "comments": [{"username": "Alice Francesca", "comment_text": "Pick an area and explore smaller towns (Lake Garda, Verona, Padua and Venice)\nSiena, Orvieto, Spoleto, Lucca\nTurin, Lake Maggiore and Lake d'orta, Alba in the Langhe region (international white truffle fair will be on!)"}, {"username": "Janis Laidler", "comment_text": "You could consider Slovenia if you’re going to Venice . Lake Bled is beautiful"}, {"username": "Karyn McCluskey", "comment_text": "Trains are great & easy"}, {"username": "Steve Grossman", "comment_text": "If you'd like to go to another country france is right there. The south of france is one of the most incredible places in the world"}, {"username": "Janelle Caire", "comment_text": "Venice and Tuscany for sure"}, {"username": "Abe Michelson", "comment_text": "Naples/\nSorrento & Amalfi-No 2nd country. Though Amalfi might be very quiet for October? Venice & Vienna Austria. 5 days each. Perfect!!!!\nMilan & Nice/Monte Carlo. Milan/Lake Como Region & Switzerland. Zurich. Also I heard Lufthansa has a nonstop flight from Venice to Barcelona. Yes Venice & Slovenia or Croatia."}, {"username": "Dafne Vassetti", "comment_text": "You can try the less touristy area. Umbria, Marche, Molise, Abbruzzo region. You can get in touch with travel agency Be.In.Italy based in Marche region and see if they can help you out with th itinerary. You would be out of the crowds (since you have already sent Florence and Rome), have the sea, the mountains, the lakes, the nature, small villages and towns. One of a kind places like Assisi and Perugia. Spend less. Have the most amazing local food and experiences."}, {"username": "Chiara Codecá", "comment_text": "In autumn Umbria, in Central Italy, and its neighbour Tuscany, are lovely. Look them up, you can easily travel by train. Another beautiful region is Puglia, but most transfers would be by coach."}, {"username": "Elena Eckley", "comment_text": "Venice then train to Paris"}, {"username": "Cherie Olney", "comment_text": "Try Sicily 🇮🇹❤️"}, {"username": "Pamela Dorigo", "comment_text": "Hi, you can just enjoy the north Italy, worth a visit Torino and sorroundings, also Milan just 1 day maybe, Bergamo is unusual city to visit but very beautiful, close you can find Maggiore Lake or Como Lake. On the road to Venice you can stop also in Verona for a day. Venice for 2/3 nights and you can also enjoy a Prosecco Tour. If you want to go to friuli you can reach also Trieste by train from Venice or from Venice you can move in Emilia Romagna: Bologna, Ferrara and also the small cities of Parma and Mantova."}, {"username": "Lucrezia Folger", "comment_text": "10 days isn’t much. I’d forget 2 countries."}, {"username": "Stefan Sig", "comment_text": "If you want to take a train around Italy, 2 nice regions are Puglia and Sicily ￼"}]}, {"id": "2206254329773645", "text": "EDITED: thank you to everyone (that was kind)! I’ve turned off commenting because you all are so wonderful and helpful!\n\nYou all have been so great I need a solid vote on which sandal to take with me (firstआणखी week in September). Please do not give me other options. It ￼took me this long to narrow it down to these two. Brand/style under each photo! TIA ♥️🇮🇹♥️🇮🇹♥️🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2206254329773645/", "likes": 99, "comments": [{"username": "Elizabeth Daley Watson", "comment_text": "Which one feels better? Go with that trust me."}, {"username": "Jennifer Stent Sullivan", "comment_text": "Does the shoe on the left have any “give” or elastic on the straps near the toes? That could get tight if you’re doing a lot of walking around and your feet swell a bit. Go for the most comfortable!"}, {"username": "Anne Mc Namara", "comment_text": "2nd. More practical for walking"}, {"username": "Roxanne Curzi", "comment_text": "If you brought both, what would happen?"}, {"username": "Becky Keller Smith", "comment_text": "I like the Merrill’s but agree it’s best to alternate 2 pairs"}, {"username": "Maggie B Rios", "comment_text": "Take both, and enjoy your trip!!"}, {"username": "Maria Hott", "comment_text": "with walking for long periods of time feet swell the less strapped ones would be my choice! Enjoy your trip 🇮🇹"}, {"username": "Maria Giordano", "comment_text": "I’d go with the pair most comfortable on MY feet…"}, {"username": "Gina Winterstein", "comment_text": "Take them both."}, {"username": "Shannon Leigh", "comment_text": "Whichever shoe has an adjustable strap across the top of the foot in the event your feet or ankles swell from a lot of walking. Personally I would not do either of these 😢"}, {"username": "Shari Costantino-Leonelli", "comment_text": "Strappy ones are very cute but the second pair look like they would be better for long walks on cobblestones, they also are cute 😊"}, {"username": "Susan Brooks", "comment_text": "Both shoes look great! Can you bring both? The first one for evenings and the second one for walking."}, {"username": "Marva Cogdill Ballentine", "comment_text": "Nice pedicure."}, {"username": "Charmaine Tetkoskie", "comment_text": "I love both pair. I like a little sparkle but would worry the straps could potentially dig in. I walked all over for 2 weeks in a good pair of sandals ( even ruins of Pompei) bc I got a heal blister from my feet sweating in my Ryka sneakers. Have a fabulous time. It’s a life changing trip."}, {"username": "Beryl Lato", "comment_text": "Definitely the one on the right."}, {"username": "Kristen Miller", "comment_text": "Both look great. Nice pedicure!"}, {"username": "Mj Hernandez", "comment_text": "2nd one"}, {"username": "Nicola Morgans", "comment_text": "merrell every time"}, {"username": "Lodean Gniech-Fisher", "comment_text": "BOTH!!!"}, {"username": "Judy Povinelli Barnhart", "comment_text": "You definitely have time to try them both beforehand and choose the one that feels the most comfortable for you. Strangers voting won’t be the most helpful. Good luck and happy walking!"}, {"username": "Mary Fortura", "comment_text": "Second all black. The multiple straps of the first are not a good idea if your feet get hot and swell."}, {"username": "Phyllis Flowers", "comment_text": "The one on the right looks more substantial"}, {"username": "Chrysa Arvaniti", "comment_text": "The 2nd one....and I think it looks better on your foot. Looooove your nail polish!!!👍👍👍"}, {"username": "Dorothy Holder Zmigrodski", "comment_text": "Honestly can you get both? My feet felt great as I switched between sandals. If not, the second one for sure"}, {"username": "Judie Mc Adam", "comment_text": "I’d wear my sneakers during the day I always found the streets can be dusty and sticky sometimes with so many people around also if you bang your toes of them cobbled streets it’s extremely sore\nSo I changed to my sandals in the evening for dinner because A/it gave my feet a rest and B/I didn’t have as far to walk in the evening\nThat’s what I do every time I’m in Italy n works for me"}, {"username": "Janice Koekebakker", "comment_text": "Both are good shoes, but I would suggest the second pr. If your feet swell in heat- the first pair will constrict with the narrow straps"}, {"username": "Yvonne Campos", "comment_text": "The most comfortable ones!"}, {"username": "Cheryl Milauskas", "comment_text": "Alegeria. They look like they would be way better for a lot walking. Those smaller straps are gonna hurt with so much walking. It’s still gonna be warm there the firm week. Go with comfort."}, {"username": "Janet Wright Beard", "comment_text": "Take both!"}, {"username": "Linda April Cardile", "comment_text": "you have to pick the most comfortable ones to walk in. it appears the thick straps would be. however. the strap in front of the ankle might cause to much friction."}, {"username": "Patricia Rodgers Downer", "comment_text": "As a former podiatric nurse, I say definitely the second one. It’s going to give you much more lateral support On your front and mid foot when walking, especially on uneven surfaces."}, {"username": "Sarah McKelson", "comment_text": "Take both 😃"}, {"username": "Andrea Paquette Haber", "comment_text": "I would say the thicker strapped"}, {"username": "Janice Heilman", "comment_text": "Both. Second for the day and first at night\nIf only can take one then second for comfort\nSidewalks and roads uneven and second probably less slippery\nLove ❤️ toenail color\nEnjoy"}, {"username": "Deb Coote", "comment_text": "Whichever one feel’s most secure and comfortable without looking at them. If you have 400 grams spare take both. Either way no one dies"}, {"username": "Sheila Williams", "comment_text": "Choose the most comfortable one."}, {"username": "Tanya Marie", "comment_text": "I really love the statement button and boldness of the second pair."}, {"username": "Kim Czekai Zito", "comment_text": "Alegeria is my choice"}, {"username": "Julie Sny", "comment_text": "Following… which one did you choose?"}, {"username": "Paulyn Hoffman", "comment_text": "The one on the left looks like it has to many straps, and the toe strap might become uncomfortable. I prefer the style on the right. You might want to wear socks though. I was in Italy in September and it was hot. My feet really got damp. It’s not a beauty contest, you need to have happy feet!"}, {"username": "Karen Forino", "comment_text": "Whichever is going to be more comfortable for you is my vote!!"}, {"username": "Kelly Matie", "comment_text": "Merrell"}, {"username": "Joann Forino Castell", "comment_text": "I like the the all black one"}, {"username": "Lori Domenico Laubach", "comment_text": "Both🤷‍♀️"}, {"username": "Lucrezia Folger", "comment_text": "The one on the right looks like it will be more comfortable in the long run. However, always bring 2 pairs you can alternate as any shoe will become uncomfortable."}, {"username": "Mazzeo Diane", "comment_text": "I like the Merrel because it has a bit dressier look. Would look good with pants or skirts"}, {"username": "Caroline Brown", "comment_text": "both"}, {"username": "Julie Okerlund", "comment_text": "Both. Wearing just one may not be the best for your feet. Alternate them. I'd also bring a good pair of comfortable sneakers."}, {"username": "Agnes Sax", "comment_text": "You need good walking shoes like tennis shoes"}, {"username": "Agnes Sax", "comment_text": "The shoe on the right looks like it gives more support the one with that silver button"}, {"username": "Dia Collins", "comment_text": "No matter which one you choose, BREAK THEM IN!\nStyle is not important in Italy, comfort is. My first day in Italy I walked over 14 miles ( we might of got lost 🤦‍♀️) None the less, I was wearing my Birks which I live in and had no issues because they were broke in. New shoes will rub differently and cause issues. Good Luck."}, {"username": "Jean Monteforte Capuano", "comment_text": "I love the Alegria!!! Not only do I love the look, they look more secure for your foot. Might have to look into those for myself"}, {"username": "Kimberley Banks", "comment_text": "2"}, {"username": "Heather Stokes", "comment_text": "The second one."}, {"username": "Sandra Coyle", "comment_text": "Both!"}, {"username": "Jeanette Moore", "comment_text": "Are u bringing sneakers with support? If so then the one that’s most comfortable but only if you bring something also along like sneakers."}, {"username": "June Quagliariello", "comment_text": "Buy both!"}, {"username": "Jeanne Hendrickson", "comment_text": "Bring both so you have options."}, {"username": "Ruth Korchinski", "comment_text": "Both great choices but the PG Lite shoe looks more durable and less problems with straps… IMO"}, {"username": "Lisa Ann Reigle", "comment_text": "Left ones"}, {"username": "Gaye Norval", "comment_text": "Take both"}, {"username": "Maggie Williams Dryden", "comment_text": "Which ones have better grip on the bottom and are less slippery? Go with that."}, {"username": "Helen Terra", "comment_text": "Sandals #2 and take backup sneakers."}, {"username": "Judith Tobin", "comment_text": "2nd pair looks sturdier. I focus on comfort not glamour but both are nice looking!"}, {"username": "Cameron Smith Bradley", "comment_text": "Both and alternate between the two."}, {"username": "Linda Prunkel Reinhard", "comment_text": "I love Merrell sandals and shoes. Just wore a similar pair on a cruise. We got stuck in the rain one day and walked through mud. No problem, rinse them off and go."}, {"username": "Neida Quinones", "comment_text": "Take them both 👍"}, {"username": "Deborah Castelli", "comment_text": "Love both!"}, {"username": "Tammy Mehigan", "comment_text": "Alegeria #2"}, {"username": "Erica Duarte", "comment_text": "The thick strap ones are cuter"}, {"username": "Bess Bunyak", "comment_text": "Are those Taos?"}, {"username": "Betsy Kirkhope", "comment_text": "The one on the right"}, {"username": "Jen Alexitch Rachow", "comment_text": "The Alegría sandals look more dressy. So you can dress them up or down. I wore Alegria on My first trip to Italy and I walked miles and miles and my feet always felt great. Good supportive soles. This is a biased opinion 😀 my feet love Alegria shoes."}, {"username": "Lisa Marchionda", "comment_text": "Sneakers are the best, lots of steps and walking in Italy!"}, {"username": "Karyl Necole", "comment_text": "Hi I live in Italy and I suggest you bring something comfortable because I know you’ll have a lot of walking to do! 😊 and another thing, bring something close just in case it rains because it usually rains in September. Buon viaggio! 😊"}, {"username": "Lynne Boyd", "comment_text": "The second pair looks sturdier but I would worry about the top strap rubbing all day on top of my foot creating a blister."}, {"username": "Yaneisys Molina", "comment_text": "The merrell"}, {"username": "Mila Leis", "comment_text": "Where did you buy these? The one with a thick strap looks more comfortable!"}, {"username": "Alicia Mazzi", "comment_text": "Whichever is most comfortable!"}, {"username": "Kumudini Kate Nealand", "comment_text": "The delicate lst ones ! 💎"}, {"username": "Katie Ewers", "comment_text": "Both are cute, pick for comfort and function. Is this for walking 20k steps a day? Maybe also pick for durability."}, {"username": "Isobel Van Dyk", "comment_text": "I vote both"}, {"username": "Sshona Ssmillie", "comment_text": "I would wear both separately for a day and walk loads and then if the heat where you are is not the same as Italy I would repeat the next day. It’s all about comfort because no matter how stunning a place is if you have sore and blistered feet you will be miserable"}, {"username": "Sheena Mandlman", "comment_text": "I have ON CLOUDS for my tennis shoe. This is my additional shoe- I wanted to bring a sandal tool"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Bring both !"}, {"username": "Tracy Wendell", "comment_text": "Get both. Just in case one wears your skin a bit. Most importantly bring moleskin. I blistered from so much walking! Have fun!"}, {"username": "Michelle Smith", "comment_text": "What feels comfortable they are both nice\nNeed sturdiness over the old cobbled streets.\nBring joggers for a change in the shoes are new and not broken in"}, {"username": "Julie Helton Attanucci", "comment_text": "I always like strappy sandals so I say the first ones. But…. Do what’s most comfy!"}, {"username": "Ann Tritscheller", "comment_text": "Both would work for most, but for me, after a long day of walking, the ankle band would cause swelling."}, {"username": "Danielle Gervais", "comment_text": "If they are both as comfortable the left one"}, {"username": "Elizabeth Wyper", "comment_text": "Can we see the soles?"}, {"username": "Amalia Cristina", "comment_text": "I would go for the one on the right as it might hurt your feet less"}, {"username": "Nóra Fonyogábné Zsebeházy", "comment_text": "Both of them is ok. Take the one that feels more comfortable. Nothing else matters in this case."}, {"username": "AK Kaygen", "comment_text": "All black one"}, {"username": "Kate Groves", "comment_text": "One is built for comfort second pair one is built for a slightly more stylish look..\nGo for the second pair they are the most sensible option !"}, {"username": "Rhona OConnor", "comment_text": "If they are your everyday walking shoes.... Im not sure they are the best choice. Bring a pair of runners or good walking shoes as well."}, {"username": "Leila Jane", "comment_text": "Your pedicure looks great! The black sandal with just the 2 straps may be more comfy I'm thinking."}, {"username": "Jennifer Pompa Strong", "comment_text": "Just wear what is comfortable for you. Nobody can choose for you. What I can wear and be comfortable might be totally different for you. Break in whatever shoes before you go."}, {"username": "Louellen Klints Karthaus", "comment_text": "Whichever one is comfy, secure and has the widest(stable) sole"}, {"username": "Lindsay Stewart", "comment_text": "The ones that will give when your feet swell"}, {"username": "Jaclyn Raé", "comment_text": "thick strap!"}, {"username": "Roxanne Franquelli", "comment_text": "I vote for the right. Less straps."}, {"username": "Kathy Wilkey Smith", "comment_text": "Whichever one allows your feet to expand and will still feel comfortable."}, {"username": "Lamiaa Bahaa", "comment_text": "I prefer the right one allegria"}, {"username": "Jeanne Bissell", "comment_text": "One on the right. The little straps may hurt."}, {"username": "Annette Sparks", "comment_text": "If you can walk for ever in both, take the first pair. They are nice for evening too."}, {"username": "Sue Clarke", "comment_text": "Walking shoes might be better than sandals."}, {"username": "Teresa Rivero", "comment_text": "They are both pretty but always go for comfort. Which ever won’t give you blisters after a long walk. You will be walking a lot. Also, I always take sneakers. You can never go wrong with sneakers."}, {"username": "Maria Piccolo Stern", "comment_text": "PS because of the amount of walking that I do when I’m in Italy, and I’m usually there 4 to 10 weeks, I take minimum three pairs for recovery. For me, it’s imperative to switch out every day."}, {"username": "Rawinia Matthews-Crump", "comment_text": "Both"}, {"username": "Suzanne April Chapman", "comment_text": "Second pair"}, {"username": "Denice Fedon", "comment_text": "Right, but you will need walking shoes."}, {"username": "Georgiana Francis", "comment_text": "First one ."}, {"username": "Denise Tenn", "comment_text": "More importantly you have Lovely colour toenails - what do you use on them? 🤔😊👍ps sandals/\nwalking shoes tip -Merrel all the way … had Merrel walking shoes too for my European trip soooo comfy & much more breathable than others too."}, {"username": "Romy Coops", "comment_text": "Lets straps less marks when your feet swell BTW love your pedi!"}, {"username": "Ginene Puco Gerdes", "comment_text": "PG lite"}, {"username": "Shelley Anderson", "comment_text": "None buy a nice new pair.."}, {"username": "Atet GC", "comment_text": "Can I wear sandals at the Vatican or Pantheon?"}, {"username": "Christine Ann", "comment_text": "I would take both to alternate. I just came home from 4 weeks and I had two pair that I alternated and they worked perfectly. I brought sneakers and only wore them once. I could have done without them"}, {"username": "Lisa Simpson", "comment_text": "One of each 🤣🤣🤣 no seriously I like the second ones."}]}, {"id": "2206615099737568", "text": "Are you going to drive around Italy in August?\n\nThis “alert tab” prepared by Traffic Police may help you in avoiding peak days.\n\n", "link": "facebook.com/groups/1373361046396315/permalink/2206615099737568/", "likes": 2, "comments": []}, {"id": "2206620413070370", "text": "I am interested in a tour company that hosts small groups around Florence and Tuscany", "link": "facebook.com/groups/1373361046396315/permalink/2206620413070370/", "likes": 4, "comments": [{"username": "Susan Draghi Goco", "comment_text": "Get Your Guide has excellent tours in this area. We did a whole Tuscan day with them and it was great."}, {"username": "Jeff Gentner EA", "comment_text": "Walks of Italy was great when we were in Florence."}, {"username": "Jeff Gentner EA", "comment_text": "Check out Tours by Roberto for Tuscany. We did two of them and they were fantastic. Roberto grew up in Siena and is very knowledgeable and entertaining."}, {"username": "Jason Hobel", "comment_text": "Check out Freya's Florence Tours. I follow her on Facebook and she really has some amazing facts of the whole region and beyond."}, {"username": "Lorene Vallish Phelps", "comment_text": "STEPS in Tuscany"}, {"username": "Sharon Wenzel", "comment_text": "https://\nlivtours.com/\n\nThey only put 6 people in a group…."}, {"username": "Andrea Hirsch", "comment_text": "How small is small? We did a private tour with Lorenzo who is the owner of https://\nwww.allaroundtus\ncany.it/. He can accomodate up to 8-9 people I believe. He was amazing. Took us wll around Tuscany for the day and it was one of our most favorite days of our trip!!"}, {"username": "Lara Grom", "comment_text": "Livtours the best"}, {"username": "Michael Gillihan", "comment_text": "Paola's Florence Tours - Paola Migliorini"}, {"username": "Paola Zirpola", "comment_text": "We used Caf tours and Florence town was not disappointed."}]}, {"id": "2206616466404098", "text": "Going for 21 days, we are hoping to use carry on roller luggage and a backpack. Any recommendations for backpacks that would be suitable for the trip as well as secure when walking around with it on? Thanks everyone!!", "link": "facebook.com/groups/1373361046396315/permalink/2206616466404098/", "likes": 2, "comments": [{"username": "Madeline Caporale", "comment_text": "What airlines are you flying? You want to check your size and weight restrictions (especially if you will be flying any smaller airlines). With that additional information others can provide the most helpful suggestions based on their experiences."}, {"username": "Ania Kubica", "comment_text": "I have Cotopaxi 35L and thats the only luggage I travel with. All the places I stayed at had washing machines with dryers."}, {"username": "Shelley Frise", "comment_text": "My problem with the only taking the backpack and carryon luggage is it left me no room to shop. We ended up buying a medium sized suitcase to bring back the extra plus I shipped wine and table cloths home. Next time I would back a small suitcase inside a medium suitcase. I didn’t over pack"}, {"username": "Dann Hrusch", "comment_text": "Osprey Farpoint/\nFairview 40 is the only luggage we travel with aside from the smaller personal item bags."}, {"username": "Jessica Petyo", "comment_text": "I don’t find backpacks very comfortable, plus they make me so hot, so I used the Calpak Luka Duffel (which is like Mary Poppin’s bag and fits soooo much). It has a loop to slide over your suitcase handle and keeps it secure even over all the uneven cobblestone. I got some carabiner and zipper clips from Amazon for security and anti-theft as well. This all worked really well for me during our 15-day trip. I’d also suggest finding a foldable duffel bag to fill with dirty clothes and check on the way home. This will leave you room for shopping and souvenirs in your carryons."}, {"username": "Jenny Payne", "comment_text": "Get a crossbody bag as well for all documents 🌻"}, {"username": "Susan Rathke", "comment_text": "I always take a backpack, but end up needing a day bag for the daily stuff.\nI use a Swiss Gear backpack that accommodates my laptop, an extra set of clothes, my travel paperwork, 1 qt of toiletries and some snacks. I can put locks on the zipper closures.\nI also purchased the Mother Lode pack from Samsonite, but I think it’s more bag than I need for most trips."}, {"username": "Bea Kuckens", "comment_text": "In-line skate wheels are easier and hold up better on cobblestone than \"spinners\"."}, {"username": "Adrienne Rogers", "comment_text": "We went for 18 days with an EBag without wheels and I brought a carryon folded up for the way home"}, {"username": "Daisy Yoo", "comment_text": "I would not walk around with a backpack that contain important things , I will only use it for snacks and such and put I\nProtect things in secure places on u, not exposed out for public , if I go to a place that I can not store in hotel or Airbnb yet , I will store them in bag storage places , just my 2 cents"}, {"username": "Austin Briscoe", "comment_text": "This pack is awesome, really two packs in one. Main pack is engineered to be a carry on size pack and the second is detachable day pack that is your personal item on the plane. Second pack can be attached in front to balance the main pack when walking for a while, this feature also gives you access to pockets and water bottle holders while wearing it and walking. The main pack opens fully like a regular carry on instead of the digging to the bottom of a deep pack like most packs. I took mine to Italy for two weeks and it worked great."}]}, {"id": "2206621283070283", "text": "Travelon anti slash\nAnti theft\nRfid protected backpack..\nBut they dont come in pretty so a few iron ons and I've given it a touch of fab while hopefully keeping the pickpockets away ;-)", "link": "facebook.com/groups/1373361046396315/permalink/2206621283070283/", "likes": 8, "comments": [{"username": "Linda Jo Rice", "comment_text": "Cute!"}, {"username": "Voula Ladas", "comment_text": "That’s a great idea . Imagine how popular these antitheft bags would be if they made them in other colours like pink , silver etc ? Some of them need to get creative . At least they have the sling bags which seem on trend atm ."}, {"username": "Jerry Harris", "comment_text": "Next month…but whose counting!🎉🎉🎉🎉👫🌴😊"}]}, {"id": "2206633416402403", "text": "Has anyone used airalo or holafy eSim cards while traveling in Italy? Please share any pros/cons.", "link": "facebook.com/groups/1373361046396315/permalink/2206633416402403/", "likes": 2, "comments": [{"username": "Isabelle Truong", "comment_text": "I used Airalo for 2.5 months in Europe including Turkey. Great reception even in small towns, very happy with it."}, {"username": "Kirsty Manning", "comment_text": "Airalo no problems. Data only, so no phone number. They give detailed instructions on how to install the esim. Monitoring and topping up data very easy."}]}, {"id": "2206630096402735", "text": "Best place to buy Cartier? Italy or France and where in these countries?\n\nThanks!", "link": "facebook.com/groups/1373361046396315/permalink/2206630096402735/", "likes": 4, "comments": [{"username": "Rhonda Hope", "comment_text": "France but you will save money on it in italy with the vat tax"}, {"username": "Vincent Affinito", "comment_text": "As far as watches, they have models there that are hard to find here"}]}, {"id": "2206632566402488", "text": "We are planning a trip end of September to Rome. How is visitor when booking tours like for the Vatican and stuff", "link": "facebook.com/groups/1373361046396315/permalink/2206632566402488/", "likes": 4, "comments": [{"username": "Marty Harte", "comment_text": "Just returned from Rome 2 days back. I booked all on Viator. Night coliseum, Pisa/Florence semi private, skip the line Vatican/St Peter’s semi private and day trip to Amalfi and Positano with ferries.\n\nThey wound up being with different vendors but all were great."}, {"username": "Janet Messanelli Bozzone", "comment_text": "Viator is a consolidator so there will be multiple options. See what appeals to you and read the reviews. Unfortunately, cancellations have been increasingly common due to the popularity of some venues and high demand. I suggest booking tours that you do not have to prepay for…and leave your options open. Also check out Get Your Guide which has some different options. Sometimes you will get better pricing if you go back to the tour company’s web site. But one advantage to the third party sites is they do afford extra assistance if there is a problem. Choose wisely."}, {"username": "Sonita Sandhu", "comment_text": "I booked directly with the Vatican site. You usually have to do way in advance and I did an Audio guide as that’s all I needed. Definitely book yo ur tours now."}, {"username": "Sonita Sandhu", "comment_text": "https://\ntickets.museivat\nicani.va/home\n\nLooks like a lot of dates are sold out. That’s where you may need Viator of get your guide"}]}, {"id": "2206641793068232", "text": "Highly recommend, for anyone needing luggage storage near Colosseum. Lovely people, funky place & you can even have a coffee or water.", "link": "facebook.com/groups/1373361046396315/permalink/2206641793068232/", "likes": 4, "comments": []}, {"id": "2206642153068196", "text": "And this is why they’re coming up with stricter laws and going to give tourists a harder time😡", "link": "facebook.com/groups/1373361046396315/permalink/2206642153068196/", "likes": 3, "comments": [{"username": "Paula Bennett", "comment_text": "Why hide his face? We’ve all seen it! He’s a punk!"}, {"username": "Steven Shannon", "comment_text": "I’m really interested to see the outcome of this one."}, {"username": "Kim Dixon", "comment_text": "They already found him. It’s a British citizen"}, {"username": "Jason Hobel", "comment_text": "Show his face so he can be shamed for eternity. Serves no purpose blurring out his face. These people should be banned from Italy for life. If the have zero respect for history then why should the country have any respect for them. They should be fined $100,000.00 and jail time. We need harsher penalties for these people."}, {"username": "Julie Alexander", "comment_text": "Idiot."}, {"username": "Louise Wyldbore", "comment_text": "Disgusting and I hope he gets a hefty fine, a jail sentence and he is banned from 🇮🇹. His girlfriend is just as guilty as he, she possibly could have stopped him but clearly also uneducated and no respect for history"}]}, {"id": "2206642379734840", "text": "Suggestions please. Planning trip end of March for two weeks for our 40th wedding anniversary. Want to stay away from Rome until after Easter Monday. Fly into Zurich and stay that night then make our way to Chur to take the Bernini express (this is a must but not sure if our itinerary makes sense). Then Want to hit Venice, Tuscany and cinque terreआणखी then Rome for a few days before flying home. We aren't about art per say but do like basilicas and great food and the beauty of Italy with a touch of farming (husband is a farmer in Ohio)- so culture I guess . Any recommendations would be great like where to stay vs stay in one area and do day trips.", "link": "facebook.com/groups/1373361046396315/permalink/2206642379734840/", "likes": 0, "comments": [{"username": "Steve Grossman", "comment_text": "How many days can you spend in italy"}]}, {"id": "2206644073068004", "text": "Looking for recommendations. Hotel or vrbo in Rome and Amalfi Coast?", "link": "facebook.com/groups/1373361046396315/permalink/2206644073068004/", "likes": 0, "comments": []}, {"id": "2206646079734470", "text": "We are traveling to Florence, Rome, and Positano mid October. Any recommendations\non hotels you loved? Restaurants?", "link": "facebook.com/groups/1373361046396315/permalink/2206646079734470/", "likes": 1, "comments": [{"username": "Kim Shea", "comment_text": "Me too\nFollowing"}, {"username": "Sandy Radican Shikaly", "comment_text": "Hotel Brunelleschi in Florence!!!!"}, {"username": "John Spensieri", "comment_text": "In Rome, Hotel Lunetta . Has a great spa and next to a great local restaurant . Close to Piazza Novana."}]}, {"id": "2206646083067803", "text": "Is it necessary to buy tickets for the Leonardo Express train (FCO to Roma Termini) in advance? Not sure how to select the time given potential for delays etc in immigration/customs and will also be meeting up with my daughter who is coming from Paris. Thanks in advance for your advice.", "link": "facebook.com/groups/1373361046396315/permalink/2206646083067803/", "likes": 0, "comments": [{"username": "Sara Beth", "comment_text": "No book when you arrive."}, {"username": "Marco Scacchi Fratini", "comment_text": "No - I always buy them online a few minutes in advance. Use the official Trenitalia app or website: https://\nwww.trenitalia.c\nom/en.html\n\nSelect 'Fiumicino Aeroporto' as your departing station and then 'Roma Termini' as the final destination. Keep in mind the results will also show slower trains, but the Leonardo Express trains will be easily recognizable (see screenshot)."}, {"username": "Graham Sherlock", "comment_text": "No get them when you need them."}]}, {"id": "2206646709734407", "text": "Does anyone know how to get from the FCO train station to the Hilton Garden Inn - is there a shuttle or is it best by taxi?", "link": "facebook.com/groups/1373361046396315/permalink/2206646709734407/", "likes": 0, "comments": [{"username": "Ann Lombardi-Perkins", "comment_text": "I would contact the hotel. They may have a shuttle available."}, {"username": "Karen Blackmore", "comment_text": "As above, contact the hotel. They may be able to arrange a taxi to meet you at Arrivals. Cost a bit more but ensures you end up at the correct hotel and the price is set. Worth it after a long flight!"}]}, {"id": "2206648866400858", "text": "56 new trains on their way for the line connecting Naples to Sorrento, aka Circumvesuviana, by 2026.", "link": "facebook.com/groups/1373361046396315/permalink/2206648866400858/", "likes": 0, "comments": []}, {"id": "2206646866401058", "text": "Does anyone know how to get from the FCO train station to the Hilton Garden Inn - is there a shuttle or is it best by taxi?", "link": "facebook.com/groups/1373361046396315/permalink/2206646866401058/", "likes": 0, "comments": [{"username": "Irene Oda", "comment_text": "Have you contacted the hotel? It's probably best to ask the hotel if they have a shuttle."}]}, {"id": "2206612059737872", "text": "We are taking a train to Bologna (from Florence) for a day trip in October. Would you tour the city on own or would you recommend doing a food tour? If a food tour or cooking class, do you have any recommendations? Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2206612059737872/", "likes": 3, "comments": [{"username": "Fetchin Gretchen", "comment_text": "I would definitely recommend doing a food tour in Bologna if you are only there for a day trip. The city is known for its delicious food, and a food tour is a great way to try a variety of local dishes and learn about the city's culinary history.\n\nHere are a few food tours and cooking classes that I recommend:\n\n* **Taste Bologna Food Tour:** This tour takes you to some of Bologna's best food spots, including a traditional tortellini shop, a balsamic vinegar producer, and a gelateria. You'll also get to learn about the history of Bologna's food culture.\n\n* **Secret Food Tours Bologna:** This tour is a bit more adventurous, as it takes you to some off-the-beaten-\npath food spots. You'll get to try some unique dishes, such as lampredotto (a type of tripe sandwich) and mortadella (a type of cured pork\n* **Delicious Bologna Food Tour:** This tour is a great option if you are interested in learning how to cook traditional Bolognese dishes. You'll start the tour with a visit to a local market, where you'll buy the ingredients for your meal. Then, you'll head to a cooking school to learn how to make tortellini, ragù alla bolognese, and other classic dishes."}, {"username": "Rhona OConnor", "comment_text": "We did the hop on hop off.... It was OK. Went out to the suburbs where there was a great view over the city. Sorry I didn't do one of the guided tours."}, {"username": "Philip Curnow", "comment_text": "Yes Taste Bologna. Italian owned, run and also tours in Parma, Ravenna, and Modena. https://\nwww.tastebologna\n.net/"}, {"username": "Susan Palmer", "comment_text": "Bologna is a food Mecca, you may want to do a cooking class that includes going to the market to get the food you will make.\nOr do a walking food tour"}, {"username": "Cindy Voss", "comment_text": "Catherine Sharp Nanci Moll"}, {"username": "Scott Perry", "comment_text": "Guero for cocktails after! Tell them Scott sent you. 😁"}]}, {"id": "2185898531809225", "text": "A beautiful spot from which explore Tuscany😍\nSituated at the base of Sant’Angelo in Colle, a small village, and overlooking some vineyards, this is a very special place located only ten minutes away from the… आणखी famous Montalcino! It's the complete Tuscan experience!\nDiscover more: https://www.kqzyfj.com/click-100692842-11552042?url=https%3A%2F%2Fwww.tripadvisor.com%2FHotel_Review-g1725292-d8517803-Reviews-Castel_Brunello-Sant_Angelo_in_Colle_Montalcino_Tuscany.html%23%2Fmedia%2F8517803%2F198307643%3Ap%2F%3Falbumid%3D101%26type%3D2%26category%3D101", "link": "facebook.com/groups/1373361046396315/permalink/2185898531809225/", "likes": 7, "comments": [{"username": "Mansour Moheban", "comment_text": "I like to live there for a month"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2206613833071028", "text": "Discover the splendours of the Roman Baroque with our immersive virtual experience of the Borghese Gallery. The museum is a treasure trove of art: Caravaggio, Raphael, Titian, Correggio, Bernini and Canova are among the artists whose works are displayed in the gallery and its vast collection of paintings, sculptures, mosaics and bas-reliefs that each year attract multitudes of visitors.\n\nDuring the virtual tour, you will be led by an art and history passionate guide through this outstanding Museum, it will be an incredible opportunity to discover one of the world’s greatest art galleries. Our guide will reveal the secrets and anecdotes of this ancient palace and the treasures it holds : you will learn about the scandalous life of the unscrupulous and art-obsessed Cardinal Scipione Borghese and you will admire Caravaggio’s most important paintings, including “Young sick Bacchus” and “Boy with a basket of fruit,” as well as Bernini and Canova’s magnificent sculpture collection, boasting works like “Apollo and Daphne,” “David,” “The rape of Preserpina,” and “Paolina Bonaparte”…all from the comfort of your own home.\n\nJoin us: https://nextstop-italy.com/virtual-tours/borghese-gallery/\n\n#history #art #italytrip #virtualworld #vacationmood #italytravel #VirtualTour #renaissanceart #italygram #italyiloveyou #borghesegallery #villaborghese #Bernini #bernini #canova #caravaggio #baroque #baroqueart #art #artlovers #artgallery #artoftheday #museum #museumlove #museumlover #museums #MuseumsForAll #arthistory #arthistorynerd", "link": "facebook.com/groups/1373361046396315/permalink/2206613833071028/", "likes": 3, "comments": [{"username": "Mansour Moheban", "comment_text": "So real"}]}, {"id": "2206583433074068", "text": "I am wanting to start planning a trip to Italy, looking for itinerary suggestions and tips. I am thinking my plan would be to fly into Venice and travel south. What are good travel books, websites to gather information?", "link": "facebook.com/groups/1373361046396315/permalink/2206583433074068/", "likes": 0, "comments": [{"username": "Madeline Caporale", "comment_text": "Rick Steves travel books and website for starters."}, {"username": "Anthony Martini Jr.", "comment_text": "Browse this group everything you asked for has been covered 100s of times\n🔍"}, {"username": "Patrick Gilmore", "comment_text": "Do what my wife & did, become experts at making sangria Itilian wine. Get a desk top going looking up beach cites. Get the travel apps on the phone & start emailing hotels. We have had more fun with the planning."}, {"username": "Joni Ingram Ellington", "comment_text": "Are the red buses worth it? I'm gonna be in Rome for 2 1/2 days. Gonna get fast passes too!"}, {"username": "Glenn Todd Webb", "comment_text": "Fodors or Frommers guide only ones I will use and i have all the others."}, {"username": "Lyn Evans", "comment_text": "Good plan flying into Venice.. it’s beautiful and so memorable getting a water taxi from the airport to your hotel. You can also look at shared water taxi services to save $. Our 1st trip to Italy we did Venice then across to Lake Garda then made our way sth to Tuscany and surrounds, then Rome then Amalfi coast. If flying home from Rome is an option, then this saves doubling back. We saved Cinque Terre for our next trip to Italy and we were away for nearly 6 wks that trip. This trip we are doing Lake Como, Cinque Terre and Lucca. My suggestion is for the time you have, don’t try to cram too much in. Try give yourself at least 3 days if possible minimum to enjoy a location and don’t forget a travel day is almost a lost day. Read blogs on locations and narrow down your list. Read TripAdvisor and booking reviews for info on hotels.. you get to know by the general consensus what’s good, bad, great location etc etc..then I look at the hotel or properties direct site to compare price and cancellation policies. We have never driven so train connections etc are important when we choose. Hope this helps."}, {"username": "Julia King", "comment_text": "Hi Lyn Evans , your tips really make me want to go to Italy, I have only done the tourist couple of days of Rome. Sally is over there at the moment. Hope you and the family are all well, as we are . Hugs 🤗"}]}, {"id": "2206589343073477", "text": "We have just been to Milan and very new to travelling . We were told to use an app called Moovit. It was a life saver ! It helped us getting around on public transport and was so accurate and efficient!", "link": "facebook.com/groups/1373361046396315/permalink/2206589343073477/", "likes": 38, "comments": [{"username": "Fetchin Gretchen", "comment_text": "I love Moovit. More accurate than Google Maps for public transport!"}, {"username": "Melissa Santos", "comment_text": "Eric Santos"}, {"username": "Gary Trignani", "comment_text": "Thanks. Visiting Milan soon and will now get the app."}, {"username": "Voula Ladas", "comment_text": "Trouble with all these helpful Apps is you forget you have them all . Just went to download this App ,and then realised I already have it 🤦‍♀️. Thanks for the reminder . 😂"}]}, {"id": "2206590413073370", "text": "Galleria Umberto in Naples, a must see if you are visiting the city.", "link": "facebook.com/groups/1373361046396315/permalink/2206590413073370/", "likes": 4, "comments": []}, {"id": "2206591129739965", "text": "Can you please help with the best location to stay in Ischia please or recommended hotel near beach with pool and near restaurants many thanks", "link": "facebook.com/groups/1373361046396315/permalink/2206591129739965/", "likes": 0, "comments": []}, {"id": "2206592966406448", "text": "Hi all, I need some help/recommendations.\nMy boyfriend and I are going to Italy for 10 days and we have heard it’s a nightmare to bring a big rolling suitcase and are looking for an alternative. Some sort of duffel or large backpack. Thank you in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2206592966406448/", "likes": 13, "comments": [{"username": "Lois Wagner Haight Porcelli", "comment_text": "2 carry on’s is all you need"}, {"username": "Rhona OConnor", "comment_text": "Relax. Don't get stressed. The issue is lifling your bag onto the train and then into the overhead shelf. Why don't you get to smaller wheely bags. Then you won't have a problem. Checking in a second bag as part of the total cost of your trip is not huge!\n\nJess Marie Rementer just wear what you normally would. Most people are dressed in casual clothes. Don't worry. You will be fine. Shorts and runners in the summer...... Long trousers or jeans and runners in colder weather 👌 layers for when it gets a bit colder."}, {"username": "Cherie Horne Duda", "comment_text": "Solgaard backpack with the hanging closet is awesome. I bought it 2 months ago and took it to Italy and Portugal"}, {"username": "Gina Rovello Keenan", "comment_text": "Do not overpack! You will regret it. A carryon size suitcase and a backpack each is all you need. There are steps and cobblestones that you have to maneuver. You can either wash clothes in the sink or find a laundry service. Pack outfits that you can mix and match."}, {"username": "Debbie Morton", "comment_text": "I have been to Italy many times, always with a roller suitcase. It’s fine."}, {"username": "Robin Barbera", "comment_text": "Carryon roller bag and larger personal bag"}, {"username": "Starla Dawn", "comment_text": "Best thing is 2 carry ons, myself and 14 year old daughter just did it, no problem.\n\nMine was roll on style and hers was backpack style and in airports etc we realized hers slid onto the handle of mine and it was nice not to have to carry it always.\n\nAnyway 💯 a trip with less baggage is the way to go :)"}, {"username": "Rashelle Lynne", "comment_text": "I had a big rolling suitcase- and aside from a *few* minutes in the Siena train station, I never thought it was a nightmare."}, {"username": "Katie Marie", "comment_text": "Currently here with a checked rolling bag. It’s a huge pain transporting it to the hotel, but super grateful to have all the stuff I brought. If you are staying at hotels for a few nights in each place you’ll be ok. I considered bringing a backpack and I’m SO thankful I didn’t. Having one lock is 100% worth it. I don’t have to worry about it being pick pocketed. I know two carry ons could work, but I couldn’t imagine pulling two down the tiny sidewalks / not having a hand free etc."}, {"username": "Lucrezia Folger", "comment_text": "I always bring a suitcase and leave it where I’m staying. Lugging a duffel seems harder."}, {"username": "Sarah Louise", "comment_text": "Hey, my partner and I travelled Italy recently for 14 days (each with a carry on suitcase and small backpack).\nLarge backpack will be nice to have on both shoulders (as opposed to a duffle that puts all weight on one shoulder), there are a lot of stairs and cobble stone everywhere (as mentioned) so a carry on/backpack would be great we well. I found it easy with a carry on suitcase that has two wheels (instead of four) however I saw many people with larger suitcases as well (and those with the four wheels).\nI'm also an overpacker and found it very helpful to bring undergarments that can be washed in the sink and will dry overnight! This way you can avoid having to bring as many pairs that can take up room when it is for this many days (Work out material ones were great).\nFor clothing I made a capsule wardrobe so everything matched (I chose black/white/\nbeige), I found this extremely helpful. For shoes I brought one pair of runners (I wore these every single day including for the travel airport/train days) and one pair of sandals (wore only a few times-good if you're going to the beach though).\nHave an awesome trip!"}, {"username": "Ann Marie", "comment_text": "I just returned from 2 weeks in Italy. I used my Monos carryon and a small backpack. Brought laundry sheets to wash clothes at night. Mixed and matched outfits. Wore sneakers on the plane and packed 1 pair of sandals. You need less than you think. Enjoy your vacation. 🇮🇹"}, {"username": "Krissy DaRusso", "comment_text": "Backpacks are great but if they are too heavy it really sucks. Last year I did a small rolling suitcase and hated it. This year I did a backpack and hated it, wished I had wheels. 😂"}, {"username": "Sara Zangenberg", "comment_text": "This totally depends on if you’re a shopper or not. I literally had to buy another suitcase so that I could bring home all of my goodies. I had a rolling suitcase and have traveled to Rome, Palermo and Florence so far. We had no issues but it depends on which city you’re visiting. Definitely leave room for the wine, oil, spices, clothes and other fabulous things you will want to bring back with you!"}, {"username": "Jess Marie Rementer", "comment_text": "I would like to note this is also my first time out of the U.S… so I’m just not even sure how to pack or what to expect. I’m thankful for all your recommendations\n!"}, {"username": "Julia Salmon", "comment_text": "I was just away for 14 days and we went to 3 different countries. We did a carryon suitcase and backpack. It worked great. Some streets were a pain but I couldn’t imagine going that long with just a backpack or duffle. I wouldn’t recommend a checked suitcase… that would be a pain"}, {"username": "Nick Triano", "comment_text": "Agree with the rolling carryon recommendations\n! I've been to Italy a lot, and you just have to be mindful about what you pack. Think about where you're going, what you're doing, and pick 2-3 'outfits' (bonus points if you can mix and match parts) that you'll wear. Washable clothes are a must - wear it, wash it (Woolite packets!), and hang it. By the time it's dry, you'll be ready to wear it again.\n\nn.b. 5 years ago when my whole family went for 10 days, I told everyone (including my daughter, a (previously) criminal overpacker): one bag! Everyone did, and was surprised that it worked so well. You WILL NOT REGRET having only one main bag."}, {"username": "D'Anna Hohe", "comment_text": "How much of a nightmare really depends on how much you plan to travel around. If you are going to take trains, then really large suitcases can be a problem because you will need to take them up steep stairs to get into the trains and they may need to be lifted over your head to the luggage racks. Rolling bags of any kind are difficult on cobblestone streets but, again it depends upon your plan. Taking short cab rides when traveling to/from hotels eliminates that problem and is relatively inexpensive. Buying new bags for the trip will likely cost more than what you would spend on taxis.\nPeople also worry about checked bags getting lost but these days many people end up being forced to check their carry-ons so, it really depends on which inconveniences you are concerned about and how you intend to travel."}, {"username": "Susan Gulrajani", "comment_text": "I am interested in knowing about reputable tour companies for first time to Italy. looking for small groups, non touristy attractions. Thank you!"}, {"username": "Kate Squillacioti", "comment_text": "We each did an Away carry-on suitcase with the Away duffle bag and it worked great! 10 days in Tuscany and Rome. Bags fit into the rental car and were very easy to roll around the streets of Rome. Just make sure you check with the airline on the weight allowed for your carry on suitcase. We could have fit alot more but had to keep the weight under 17 pounds for ITA. 2 pairs of shoes, 2 skorts, one pair of shorts, 4 dresses and then about 6 tops and it worked fantastic."}, {"username": "Lisa Barnes", "comment_text": "I had no problems with my rolling suitcase. Oh wait yes it was a challenge on the trains and lifting overhead. I was offered help in those situations."}, {"username": "Shannon Welch Farr", "comment_text": "My son has a Northface bag that’s a duffel AND a backpack. He loves it!"}, {"username": "Anthony Sperduti", "comment_text": "It’s not a nightmare\nJust buy a good one"}, {"username": "Pat White", "comment_text": "Airlines have different size and weight limits for carry on suitcases. And even personal item sizes. Be sure to check airline limitations before purchasing. I am flying Lufthansa next month and carry on weight limit is 17.6 lbs and measurements for both suitcase and backpack are small!"}, {"username": "Jamie Bly", "comment_text": "I was just there for 2 weeks and had no issues with my ginormous rolling bag. However, we also had drivers for everything. If you are planning to take public transportation and walk the streets with your bag then no way. It will be a nightmare."}]}, {"id": "2206595733072838", "text": "Has anyone taken a Vatican tour that is Italian? The Vatican website is only showing the Italian option available (english is sold out) for the prime experience. Would prefer to go early! Would I be missing much if I had Rick Steves guide in my ears, and go on this tour?", "link": "facebook.com/groups/1373361046396315/permalink/2206595733072838/", "likes": 2, "comments": []}, {"id": "2206600776405667", "text": "We are planning a 10 day trip next May/June. Milan to Florence to Cinque Terre to Milan. We are traveling by train.\nQuestions:\n🔴Are there any insider insights we should know? For instance, we heard things wereआणखी closed in Florence on Mondays.\n🔵Are there sights within walking distance of the train stations in Bologna, Pisa, and Genoa? We’d like to stop in those places a couple hours or so to explore.\n🔴 Any places we MUST see?\n🔵 Any places we MUST eat?\n\nThank you!!", "link": "facebook.com/groups/1373361046396315/permalink/2206600776405667/", "likes": 10, "comments": [{"username": "Diane King", "comment_text": "We love Bologna! The main Piazza and old centre is easily accessible from the train station and walkable. Come out of station cross and go left and ahead of you. There is a long road lined by shops. Bars and restaurants and grand colonnades on either side. And there is a Park on the left. Follow this road and you will come upon a fabulous Piazza and towers, a monastery and lots of eating places."}, {"username": "Kadie Mcgugan", "comment_text": "In rome the now just got here so following ! Looking to go to Florence next week too"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Generally speaking many shops, restaurants and museums are closed on Mondays everywhere in Italy, so plan accordingly (like 5 Terre are villages, they don’t close, so if you go on Monday- which is way better than the weekend when they’ll be loaded with people- check before for an open restaurant).\nAbout Pisa I wrote a post with a nice walking from the station to the Tower (Pisa is very badly organised, so if you follow gmaps it will give you the shortest, by 4 minutes, but ugliest walk. Also there are roads where so many tourists walk packed that you could call them pickpocket lane.)"}, {"username": "Nina Hod", "comment_text": "Love Bologna! It's approx. 2 km from Bologna Centrale to Piazza Maggiore. Many outdoor markets in the area where restaurants serve fabulous food."}, {"username": "Jeff Gentner EA", "comment_text": "In Milan:\nLeonardo DaVinci museum\nRavizza for great Happy Hour drinks and food\nVanilla for gelato\nRooftop tour of the Duomo\nSide trip to Varenna (take the train)\nSee the Last Supper - needs tickets ahead of time!"}, {"username": "Jeff Gentner EA", "comment_text": "In Florence\nWalks of Italy has great tours."}, {"username": "Marjetka Ban", "comment_text": "Piacenza and Parma❤️, must see. Beautiful. In Parma, don't forget to visit Pilotta palace, stuning library and old theatre ❤️."}, {"username": "Kate Laidlaw", "comment_text": "Florence\nPiazzale Michelangelo viewpoint at sunset\nDuomo climb\nTuscany wine tour (we used Grape Tours, wine & cheese full day tour)\n\nCurrently in Cinque Terre\nHighly recommend our accomodation in Riomaggiore “Aa Ciasèa duu Pintùu” and getting a pass for the trains & hiking between towns"}, {"username": "Nicoletta Dobreva", "comment_text": "Parma and Modena"}]}, {"id": "2206604639738614", "text": "I arrived in Como yesterday from Australia. Staying in apartment 2 min from Duomo, 5 mins from lake. Woke to hear locals chatting under my terrace. Magic. Surprised at how few tourists I have seen after comments on here.\nWill ferry to other towns tomorrow. Recommend to stay in Como", "link": "facebook.com/groups/1373361046396315/permalink/2206604639738614/", "likes": 0, "comments": []}, {"id": "2206605093071902", "text": "We are traveling to Italy in October. Does anyone have experience with the Hop on off bus? Please share positive and negative experiences.\n\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2206605093071902/", "likes": 0, "comments": []}, {"id": "2205950483137363", "text": "We were in Italy last week. Been in Matera and slept in an old communal oven, in Cisternino, we slept in a trullo ❤️. Ate pasta in Bari, behold the beauty of Polignano a Mare, wandered the streets of whiteआणखी city Ostuni, bougt good wine in Manduria, walked the historical streets of Alberobello. Watch the last video to see what i really did in Italy 😂", "link": "facebook.com/groups/1373361046396315/permalink/2205950483137363/", "likes": 53, "comments": [{"username": "Simone Nicole", "comment_text": "Ric Semreh"}, {"username": "Tara Roed", "comment_text": "Looks amazing!!! You rented a car to get around this area?"}, {"username": "Mike Guluk", "comment_text": "We did similar just before Covid. You need a car we also did gallipolli otranto( stayed at palazzo papaleo was fabulous) bottom part of Matera was partially closed as they were filming James Bond"}, {"username": "Scott Heran", "comment_text": "We were in Southern Italy the month of June. Did very similar things and it was incredible. Highlights were Ostuni, Tropea and of course, the Amalfi Coast. In Sicily, go to Cefalu."}, {"username": "MaryBeth Reed", "comment_text": "We were there last September and stayed in Ostuni and Matera and did day trips to Alberobello, Polignano a Mare, Locorotondo, Monopoli then went to Positano for 5 days and Naples for 1 and Rome for 3. Best vacation ever!!!"}, {"username": "Vanessa Rambaud", "comment_text": "José Paparella on aurait du s'arreter à Bari pour voir la mama faire les pates dans la rue..."}, {"username": "Patty Barnes", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Mugette Matos-Barber", "comment_text": "Can you share link to Borgo Canónica please?"}]}, {"id": "2206542566411488", "text": "Spello, probably the best city in the world! 🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2206542566411488/", "likes": 1667, "comments": [{"username": "Eileen Mercieca", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Magdalena Wostal", "comment_text": "Jedno z piękniejszych w Umbrii😘"}, {"username": "Jenni Richardson", "comment_text": "Absolutely stunning!"}, {"username": "Maria Antoniou", "comment_text": "Spello quarda che bello!"}, {"username": "Keryl Lesley Edwards", "comment_text": "Apart from being beautiful, what do you love about Spello Bogdan?"}, {"username": "Linda Lee", "comment_text": "Linda Lee"}, {"username": "Lisa Zarate", "comment_text": "Siti Ng"}, {"username": "Antonio Aloè", "comment_text": "You really need to see a bit more around the world...🤭"}, {"username": "Bita Hoffman", "comment_text": "Agree. One of our favorite stops. ❤️"}, {"username": "Denise Keenan Fisher", "comment_text": "I see beauty, peace, and care of a place in these photos. What are your favorite aspects of this wonderful place?"}, {"username": "Siwar Brahmi", "comment_text": "❤️❤️❤️❤️❤️"}, {"username": "Gina C Barbara", "comment_text": "Nancy Ann Grace"}, {"username": "Marjolein van Grol", "comment_text": "Jordy Kreeft"}, {"username": "Jymie Sam Totiel", "comment_text": "Mark Totiel"}, {"username": "Joan Crissman", "comment_text": "Breathtaking ❤️❤️❤️"}, {"username": "Nic Robertson", "comment_text": "Liz Kinny Jacki Townsend"}, {"username": "Scott Heran", "comment_text": "Other towns in that area that were also great. Todi, Orvieto and Sienna. We didn’t get to Assisi but I hear it is beautiful as well."}, {"username": "Donna Marie Feldheim", "comment_text": "Has anyone been there in late October? If so how is the weather? Equally as beautiful without all the flowers"}, {"username": "Stacey Charlton", "comment_text": "Lee Charlton"}, {"username": "Linda Padilla", "comment_text": "Linda Padilla"}, {"username": "Johanna Zhang", "comment_text": "It's very beautiful."}, {"username": "Oliwia Tomaszewska", "comment_text": "Jan Ruczynski"}, {"username": "Ha Fida El Hamdaoui", "comment_text": "Joy Zuorhel"}, {"username": "Amanda Kaylee Fredericks", "comment_text": "PB Fredericks"}, {"username": "Kerry Radley", "comment_text": "Trevor George"}, {"username": "Manny Patricia Botelho", "comment_text": "Manny Patricia Botelho"}, {"username": "Brian Rudder", "comment_text": "Kate Rudder Michael Rudder went here, beautiful city."}, {"username": "Evelynn Fischer", "comment_text": "So wonderful!"}, {"username": "Jessica Miller", "comment_text": "Debra Keifer-Johnson - on our way to Florence"}, {"username": "Susan Wheeler", "comment_text": "Just gorgeous! I'm going to paint some of your photos."}, {"username": "Rhonda Pinkney", "comment_text": "Love Spello 💝"}, {"username": "Jade Hirst", "comment_text": "Sam bliss 😍"}, {"username": "Lynda Minnes", "comment_text": "Oh my gosh....what Beautiful photos of an absolutely stunning place..."}, {"username": "Jodie Wales", "comment_text": "Jodie Wales"}, {"username": "Jenny Meffert", "comment_text": "Spello is beautiful."}, {"username": "Natalie Sherwood", "comment_text": "We were lucky enough to be going during their annual flower festival in June! Highly recommend!"}, {"username": "AnneMarie Metrando", "comment_text": "AnneMarie Metrando"}, {"username": "Patrick Gilmore", "comment_text": "Absolutely gorgeous!!!"}, {"username": "George Sippel", "comment_text": "Umbria less tourists in this region."}, {"username": "Graciera Lada", "comment_text": "WoW! It’s so beautiful 😍"}, {"username": "Lisa Rossi", "comment_text": "Wow stunning !!"}, {"username": "Tricia Harman", "comment_text": "Gorgeous town…💐"}, {"username": "Janet Willis", "comment_text": "Spello is so beautiful🌸 Exactly like the pictures. May/June is a lovely time to visit🌸🌸"}, {"username": "Erilyn Wedd", "comment_text": "Thank you. I had found this place when googling and was deciding between this place and Bologna for two night stay.\nGlad to know it’s as lovely as it looks in the pics."}, {"username": "Susan Zimmerman", "comment_text": "Now, that’s an advertisement!"}, {"username": "Roberta Andrechick Niedt", "comment_text": "Absolutely gorgeous!"}, {"username": "Nicole Nellkym", "comment_text": "Robert Skinner"}, {"username": "Laurene Lundberg", "comment_text": "We go every year in September. I was just talking with my husband and we were wondering how the weather has been and wondering if the flowers would still be vibrant in September. Are you there now? What are your thoughts?"}, {"username": "Diana Karen Martinez", "comment_text": "Leo Garnica"}, {"username": "Chelsey Marie Grice", "comment_text": "Hunter Grice"}, {"username": "Anna EClar", "comment_text": "Would u do a day trip here from Rome or Florence??"}, {"username": "Denise Clayton", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Lauren Bevan", "comment_text": "Brenton Walker"}, {"username": "Beth Andrews", "comment_text": "Beth Andrews"}, {"username": "Maria Van Gerven", "comment_text": "Bernie Van Gerven"}, {"username": "Mukund Mohan", "comment_text": "Aditya Dokania"}, {"username": "Rebeka Horváth", "comment_text": "Cintia Fazekas"}, {"username": "Lizzie Franklin", "comment_text": "Maureen Franklin"}, {"username": "Mary Andreotta", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Donna Wynne", "comment_text": "Lesley Greasley 🤩 ( I’ve made a note of it 😘 )"}, {"username": "Kathy Ciaccio Andrews", "comment_text": "Whitney Dandurand"}, {"username": "Linda Chagnon", "comment_text": "What province??"}, {"username": "Diana Smith", "comment_text": "Definitely Beautiful !"}, {"username": "Géo MaćDónald", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Vicki Hossack", "comment_text": "Are these current photos? Just wondering what time of the year is the best for a visit outside of the hot summer months. I am looking at a spring trip but want to enjoy all of the amazing flowers as well."}, {"username": "Carmen Hernandez", "comment_text": "Beautiful"}, {"username": "Ffrance Ffortin", "comment_text": "Gorgeous ❤️❤️"}, {"username": "О. Оксана", "comment_text": "Looks like a french village \"Eze\""}, {"username": "Charmaine Tetkoskie", "comment_text": "So beautiful."}, {"username": "Lisa Young", "comment_text": "So beautiful!"}, {"username": "Valerie Dalena", "comment_text": "I agree. What a fabulous place to take photos."}, {"username": "Mia Lattanzi", "comment_text": "Bendiciones"}, {"username": "Ali Moore", "comment_text": "Natalie Smith"}, {"username": "Deepika Dagar", "comment_text": "Couldn’t agree more !!"}, {"username": "Wyketta Gibson", "comment_text": "I agree, its gorgeous!!! end of May 2023"}, {"username": "Wyketta Gibson", "comment_text": "Shelia Philpot Kellise Solomon Jones"}, {"username": "Wyketta Gibson", "comment_text": "end of May 2023"}, {"username": "Shelton McBride", "comment_text": "Will visit in October!"}, {"username": "Giona Oosthuyzen", "comment_text": "Karl-Heinz Graf, so ‘n bietjie verder stappie."}, {"username": "Xochitl Adaya Carrillo", "comment_text": "Xochitl Adaya Carrillo"}, {"username": "Michelle Lynn Johnson Love", "comment_text": "We love Spello! Chris Love"}, {"username": "Claire Dowson", "comment_text": "Spello now added to my visit list. Looks gorgeous ❤️🇮🇹❤️"}, {"username": "Joe Ducey", "comment_text": "While undeniably gorgeous, isn’t it a stretch to call it a “city”? Less than 9,000 inhabitants."}, {"username": "Alessia Orru", "comment_text": "Cristiano Ferraioli"}, {"username": "DerricknCatherine Fejarang", "comment_text": "Next stop, Spello☺️👍🏼"}, {"username": "Michelle Young", "comment_text": "Erin Young Colleen Foley Nel"}, {"username": "Bonnie Besche", "comment_text": "Been there and it is gorgeous!!!!"}, {"username": "Debbie Potter", "comment_text": "Wow...these are beautiful and computer desktop wallpaper worthy."}, {"username": "Tracy Pearson", "comment_text": "Terry Stenger"}, {"username": "Jackie Richards", "comment_text": "That doesn't even seem real!!!!! Wow!"}, {"username": "Judith Tobin", "comment_text": "Absolutely loved Spello"}, {"username": "Kulwinder Mangat Purba", "comment_text": "Ana H C Perez can we go here😊"}, {"username": "Leo Sy", "comment_text": "Wow, I think it's so beautiful, but I haven't been there yet, thank you for sharing."}, {"username": "Alice Francesca", "comment_text": "Part of my family lives there♡"}, {"username": "Mariposa Mariposa", "comment_text": "Oh wow what a beauty 🇮🇹"}, {"username": "Patty Barnes", "comment_text": "Beautiful!"}, {"username": "April O'Connell", "comment_text": "Hailey Hamann"}, {"username": "Jemi Knight", "comment_text": "Tiff @rhy"}, {"username": "Jemi Knight", "comment_text": "Carenanne Knight"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Stunning !"}, {"username": "April Calder", "comment_text": "Absolutely gorgeous!"}, {"username": "Linzi Conway", "comment_text": "Daisie Conway Neil Saulters"}, {"username": "Beth Mackenzie", "comment_text": "Suzanne Goodson Perkins 😍 this is not far from where we will be in Tuscany"}, {"username": "Pam Richardson", "comment_text": "absolutely beautiful!!"}, {"username": "Ron Strilaeff", "comment_text": "Great composition, exposure and color in all those photos! I hope to capture some moments and make memories with mi amore, Angela."}, {"username": "Sharon Bizzell", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Jeanette Moore", "comment_text": "I saw it and walked it in 2006."}, {"username": "Kellie Spark", "comment_text": "I loved Spello. Stunning place 😍"}, {"username": "Ilze Fentone", "comment_text": "Julija Bizna"}, {"username": "Samantha Calardo", "comment_text": "Samantha Calardo"}, {"username": "Kerry Sacco", "comment_text": "Lovely. Any particular places to visit in Spello pls?"}, {"username": "Karen Burdett", "comment_text": "Deb Hale😍"}, {"username": "Lynda Petralia", "comment_text": "Gorgeous!!!"}, {"username": "Ryane Sabatelli Garcia", "comment_text": "Lorrie Sabatelli-Harri\ns"}, {"username": "Susan Hulsey Watkins", "comment_text": "We were there when they were preparing for the flower festival. It was spectacular!"}, {"username": "Julie McDonnell", "comment_text": "Emily Gruber Mirjalili 💕"}, {"username": "Andrea Bledsoe", "comment_text": "What splendid photos!"}, {"username": "Marie-Noel Hélie", "comment_text": "Ange-Jolie Ledoux😲"}, {"username": "Cindy Voss", "comment_text": "Catherine Sharp Nanci Moll. This looks to be about 2 hours north of Rome…any desire or motion to see this town when we go?"}, {"username": "Sandra Ferrante-Kohn", "comment_text": "We spent nearly a week there (I wish it was longer) and it was magical."}]}, {"id": "2206565429742535", "text": "I need some input on train departures from Meta. Do they sell out? We are trying to decide if we need to book our train tickets from Meta to Naples in advance or we can buy the day off?", "link": "facebook.com/groups/1373361046396315/permalink/2206565429742535/", "likes": 1, "comments": [{"username": "Cat Furness", "comment_text": "It’s on the local train line, you don’t book, just buy at the station on the day 😊"}]}, {"id": "2206571613075250", "text": "Hello everyone,\nMy husband and I will be traveling to Naples in the next couple of days. What is the best and most affordable way to get from the airport to Via Toledo?\nThank you in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2206571613075250/", "likes": 2, "comments": [{"username": "Glenn Todd Webb", "comment_text": "With luggage, take taxi"}, {"username": "Melanie Matthews Stuprich", "comment_text": "If you have big bags just take a taxi. It’s going to be more expensive but you don’t have to be lugging them around town while I find the place."}, {"username": "Joanne Danforth", "comment_text": "We had a hold suitcase plus rucksacks and we caught the alibus to garabadi train station where you can get metro . Bus was 5€ each"}]}, {"id": "2206003773132034", "text": "If you are in Sorrento this is hands down the best meal we have had in our week here.\nOur host told us of this amazing little shop where all the locals go for the best quality homemade mozzarella and burrata.आणखी Giovanni the owner even grows their own tomatoes and it is the best tomato’s you will ever have so much flavour and just perfect.\nDo yourself a favour and visit here for lunch, we came back multiple times because it was that good.\n\nAnother restaurant that we did enjoy was O'Parrucchiano La Favorita, but honestly the food quality and cannot beat Apreda, however dining under the beautiful lemon trees and waking in the garden was a nice experience.", "link": "facebook.com/groups/1373361046396315/permalink/2206003773132034/", "likes": 27, "comments": [{"username": "Nathan Earl Stellenberg", "comment_text": "looks great"}, {"username": "Deb Harnett", "comment_text": "Thanks 😊"}, {"username": "Chloe Gallagher", "comment_text": "This place is a must when visiting Sorrento!"}, {"username": "Cheryl Kavanagh", "comment_text": "Hi Lisa, thank you for letting us know about this restaurant, is it in the town centre 🙂"}, {"username": "Nicole Millar", "comment_text": "Marlene Kaiser-Domingue\nz"}, {"username": "Cheryl Kavanagh", "comment_text": "Hi can I have the location of the shop and restaurant thanks 🙂"}, {"username": "Lisa McMurchie", "comment_text": "Vickie McMurchie"}]}, {"id": "2206264769772601", "text": "Many tries and finally we got “A RIGHT TIMING.” 💪\n\n📷 Thanks to my sister Severina Carro Simbulan", "link": "facebook.com/groups/1373361046396315/permalink/2206264769772601/", "likes": 547, "comments": [{"username": "Kellie Stone Wells", "comment_text": "Blakeney Wells"}, {"username": "Carey Matthews", "comment_text": "Carey Matthews"}, {"username": "Barbara Batterson Gerami", "comment_text": "Cool pic"}, {"username": "Kim Accardo Dunn", "comment_text": "love it !"}, {"username": "Laur EnLew", "comment_text": "Well done! 👏🏻 👏🏻 👏🏻"}, {"username": "Shelby Dean Mayorga", "comment_text": "Best picture I’ve seen yet of the LTP!\nWell done! 🙌"}, {"username": "Olga Popova", "comment_text": "Полиция задержала этого вандала?"}, {"username": "Paula Bennett", "comment_text": "Perfect"}, {"username": "Doris Sarmiento", "comment_text": "Genial"}, {"username": "Shanna Stone-Padilla", "comment_text": "great pic🙌🏽"}, {"username": "Rebecca R. Russo", "comment_text": "Rebecca R. Russo"}, {"username": "Mona Sidhu Samrari", "comment_text": "That’s not nice. Lol 😆"}, {"username": "Mateusz Nowak", "comment_text": "Just make a video and pick the right “moment” from it? 🙈🤦‍♀️🤣🤣"}, {"username": "Dunia Aldyni", "comment_text": "Same my daughter"}, {"username": "Eileen Lonergan", "comment_text": "Eileen Lonergan"}, {"username": "Jane Aylward", "comment_text": "We tried heaps and none were this clever!"}, {"username": "Cindy McLean Gillespie", "comment_text": "Perfect!"}, {"username": "Ken Vecchia", "comment_text": "Different"}, {"username": "Maria Ioannou", "comment_text": "That’s brilliant best one I’ve seen should enter it for a photography competition"}, {"username": "Carmine Castiglia Jr", "comment_text": "With Photoshop and similar apps widely available, who needs timing anymore? 😀😀"}, {"username": "Peggy Felix", "comment_text": "Well done!"}, {"username": "Maria Musumeci", "comment_text": "Perfect 😍"}, {"username": "Max Perletta", "comment_text": "Without respect!"}, {"username": "Hoa Ng", "comment_text": "You are so patient👏 to try many times…\nIt’s hot it’s crowded🥵."}, {"username": "Basma Alsalman", "comment_text": "Basma Alsalman"}, {"username": "David Chojoj", "comment_text": "😌"}, {"username": "Narelle Pacey", "comment_text": "Awesome"}, {"username": "Sandra Gregory", "comment_text": "Brilliant"}, {"username": "Eva Johnson", "comment_text": "Cool"}, {"username": "Jeannie Morris Wierman", "comment_text": "So cool"}, {"username": "Gigi Igle Gonzales Dong", "comment_text": "Nakakatuwa naman po 😃"}, {"username": "Joanne Pacitti", "comment_text": "🤣🤣🤣"}, {"username": "Laura Rehberg", "comment_text": "That's hilarious 😂AWESOME SHOT!"}, {"username": "Johnna Sebben", "comment_text": "Susie Sebben we must get Kyle and Todd to do this!!"}, {"username": "Joleen Hart", "comment_text": "Omg I love this!"}, {"username": "Marcela Martinez", "comment_text": "Loved it! 🎉🎉"}, {"username": "Nai La", "comment_text": "Cool 😎"}, {"username": "Tracie Goebel", "comment_text": "Janet Psaris Tom Psaris"}, {"username": "Wallace Clavelle", "comment_text": "Classic‼️🤙"}, {"username": "Janice Leonard", "comment_text": "Creative!"}, {"username": "Marcia Kellogg", "comment_text": "Doug Lovegren"}, {"username": "Ruan Burmeister", "comment_text": "😂👍"}, {"username": "Victoria Russo", "comment_text": "I like holding it up rather than kicking it down"}, {"username": "Michelle Casady Boyd", "comment_text": "Dawn Horlacher 😂"}, {"username": "Joanne Diaz", "comment_text": "Great Picture"}, {"username": "Patrizia D'Arcangelo", "comment_text": "The best!"}, {"username": "Kelly Van Hoogendorp", "comment_text": "Oh i was on the other side holding it 🤣"}, {"username": "Becky Menacho", "comment_text": "That’s great! I barely could get it right standing still HA! Nice job 👍🏻"}, {"username": "Rocio Chio Franco", "comment_text": "Love it!! 🇮🇹🥰"}, {"username": "Nancy Hodgson", "comment_text": "Excellent fab pic ....👏"}, {"username": "Kirstin McQuillan", "comment_text": "Good one ☝️"}, {"username": "Katherine AliNuñez", "comment_text": "Katherine AliNuñez"}, {"username": "Stephanie Holman", "comment_text": "Love this!"}, {"username": "Patricia Diebold-mccarthy", "comment_text": "Great shot"}, {"username": "Suzanne Calpito Ragsdale", "comment_text": "I think it’s so funny to watch everyone getting their shots here!"}, {"username": "Mohanad Saddik", "comment_text": "خرجك\nOmar Kharboutli"}, {"username": "Robyn Smuin", "comment_text": "This is my favourite 🤣"}, {"username": "Katie Alexander", "comment_text": "Best one I've seen !!!"}, {"username": "Jodi McGee Thomas", "comment_text": "This is great haha"}, {"username": "Aubrey Sullivan Martin", "comment_text": "Leaning tower of “treesa”capture\nd today 🤣"}, {"username": "Kim Mai Yuen", "comment_text": "Good one 😂"}, {"username": "Bing Robertson", "comment_text": "Can we see some of the fails? 😂"}, {"username": "Tracy Crouch", "comment_text": "Too funny 😂"}, {"username": "Roma H.Shah", "comment_text": "Must have taken a million takes....wow what dedication ...lol"}, {"username": "Kathleen Julian Conrad", "comment_text": "Love it!!"}, {"username": "Nilda Ramos Roman", "comment_text": "Great picture. Before reading it, I wondered how many times it must have taken to get the right picture.👍"}, {"username": "Debra Dudas", "comment_text": "Best one I’ve seen yet!"}]}, {"id": "2206416756424069", "text": "HELLO EVERYONE! Ciao!\nin september we will have a LONG TRIP to Italy❤️\n\nThis will be first destination to Milano.\n\nLast destination : Sardegna!\n\nWe will spend 20 days with our car , but i need to know someआणखी informations please !🙏🏼🙏🏼🙏🏼\n\nour citys will be : Verona-Bergamo-Milano-Parma-Bologna-Florenta-Pisa-Porto Santo - Rome - Napoli - Sardegna - Veneto (aprox 7000 Kms)\n\n🔴 from wich city is better to take ferry to Sardegna?\n🟠 You think its better to leave the leave and choose villages roads for nice views?\n🟢 there are alot of speed camera?\n🔵In Sardegna there is a good roads condition ?\n\ngrazie a tutti e tornerò con foto da tutte le città!🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2206416756424069/", "likes": 8, "comments": [{"username": "Pamela Dorigo", "comment_text": "Hi, so many spots for only 20 days. To get the cruise to Sardinia depend on which area of Sardinia you will go? Usually I take always from Livorno or if you are in Rome you can take also from Rome should be also quicker. If you arrive in Veneto it worths a visit in our Prosecco Hills, if you want more information about Veneto you can write me. But I think maybe you can skip Sardinia and stay only in the country. Between the big cities the best is to move on the motorway like from Milan to Bergamo or from Bergamo to Verona or from Florence to Rome. When you visit Parma you can enjoy the smaller and local roads. In Sardinia whatever the road situation is better in the late years, the only thing there are a few main roads and the distance they write on panel say 20 km but you drive for about 40 minutes 😅 could be very stressful to drive and move in Sardinia. Enjoy your trip in our wonderful country!"}, {"username": "Alice Francesca", "comment_text": "Ferry from Livorno to Olbia.\nOn Sardegna very good road conditions.we are not a third world Country, and the Costa Smeralda in Sardegna is home to many international millionaires"}, {"username": "Alice Francesca", "comment_text": "Too many spots in 20 days.pick 5 ."}, {"username": "Michael Messina", "comment_text": "Civitavecchia or Livorno"}, {"username": "Attila Bubelenyi", "comment_text": "For you best would be Livorno, unless want to go towards Rome and then Chivittavecia"}, {"username": "Marjetka Ban", "comment_text": "Not enough time, to see all in just 20 days🤷‍♀️"}, {"username": "Monika Vicanova", "comment_text": "I have seen a lot unrealistic itinaries posted here but this one really takes the cake! If your aim is a Giro d´Italia literally meaning run around Italy , then sure go ahead, if u want to enjoy and have a vacation without traveling every other day, rethink your itinary. U need only for Florence and Rome together 6 full days, going to Sardinia os worth when u stay there at least 5 days, so half of ur days are gone already. The rest either spend in north like verona, padova or head to tuscany before going to Rome. Btw driving in Florence and Rome is hell, since they are big TLZ zones in centre and parking is non existent or very expensive."}, {"username": "Corina Cristea", "comment_text": "1.Livorno\n2. Autostrăzile pe traseul ales sunt scumpe( traseul lung și costisitor pe autostrada) , drumurile naționale sunt aglomerate și nu ai “nice views” decât pe Costa Amalfitana; in Napoli traficul este teribil .\n3. Mergi cu Waze pentru radare; in orașe exista ZTL( zona cu trafic limitat ) unde nu ai voie cu mașina dacă nu ai permis de acces, in caz contrar plătești amenzi ;\n4. In Sardinia drumurile sunt bune, fără taxe de autostrada, dar costa feribotul ;"}, {"username": "Lukáš Koníček", "comment_text": "I'm sure 20 days is not enough for all these places."}, {"username": "Alessio Esposito Inchiostro", "comment_text": "Don't go to Sardegna. They're rude and it costs a lot."}, {"username": "Roe Gallo Saks", "comment_text": "Fly to Sardegna from Rome"}, {"username": "Lisa Nordby Robilliard", "comment_text": "Enjoy your trip, looks great."}, {"username": "Alessia Orru", "comment_text": "Ciao! Sono italiana e vivo a Roma.\nSecondo me alcune città potresti evitarle, come ad esempio Bergamo. Anche porto santo stefano (immagino sia questa), a meno che tu non vada in spiaggia (ma potresti dedicare un giorno solo e poi per la notte stare in un'altra città.\nTi consiglio le autostrade; le strade di borgo, seppur facendoti vedere bellissimi paesaggi, ti rallenterebbero\nmolto.\nLa velocità max è 130, non andare oltre perché è pericoloso per te e gli altri, aldilà degli autovelox.\nLa nave si, ti direi Civitavecchia, ma hanno prezzi molto alti, prova Livorno.\n\nBuona vacanza :)"}, {"username": "B Stefan", "comment_text": "Fede Ale Ferrari here its the group😊"}]}, {"id": "2206509713081440", "text": "Hubby and I want to hire a vintage red convertible from Florence for just 1 day - any recommendations\n? Hoping to do a trip down to the vineyards.", "link": "facebook.com/groups/1373361046396315/permalink/2206509713081440/", "likes": 1, "comments": []}, {"id": "2206520569747021", "text": "I am curious about something. I have never used a backpack, but since so many of you have recommended them I have been looking. My question though, when wearing it on your back in a busy, crowded area, isn't it too easy for someone to access it without you realizing it has happened?", "link": "facebook.com/groups/1373361046396315/permalink/2206520569747021/", "likes": 46, "comments": [{"username": "Joshua Pickles", "comment_text": "I have a tsa lock on the zipper with my iPad and wallet and nothing of value in the other zippers"}, {"username": "Patti Schwoerer Posey", "comment_text": "I purchase an anti-theft backpack and small crossbody bag from Travelon."}, {"username": "Jama Patterson Hoffman", "comment_text": "My cousin had someone cut into hers with a razor and stole her wallet, passport, and she never knew when it happened. This was several years ago in Paris. I would keep all that in my money belt..When my husband an I get in crowds, he moves the back pack to the front and I walk behind him."}, {"username": "Perry Locke", "comment_text": "We all have an old wallet. Fill it with newspaper \"money\" and leave it in a pocket they can get at. It's good for a laugh later. I have put fake money in a bank envelope and left it in the isle at work and quietly watched who would pick it up. Get to know who your friends are."}, {"username": "Kay M Gregan", "comment_text": "Keep everything to the front. Nothing in your pockets and zips that lock or clip shut. No phones or hotel keys in yr pockets."}, {"username": "Jan LN Clark", "comment_text": "Buy one from pacsafe secure zips and slash proof"}, {"username": "Darci Owen DiGiorgio", "comment_text": "I bought combo light weight locks on Amazon. It went through all the zippers. 8 people 6 hotels no theft!!"}, {"username": "Aileen Ligan", "comment_text": "Have you seen that lady onTikTok who calls out pick pocketers right before they strike? I don’t know if it’s real, but most of those pickpocket featured in her videos are female."}, {"username": "Dusty Farlow", "comment_text": "https://\npacsafe.com/"}, {"username": "Minette Reyes-bautista", "comment_text": "Get the pacsafe backpack"}, {"username": "Toni Polito", "comment_text": "Mh daughter brought z great one the zipper is against your back thick comfy straps and it's lined so your info can't be scanned"}, {"username": "Tracey Smith", "comment_text": "I think you probably answered your own question."}, {"username": "Mas Tas", "comment_text": "I wear a small crossover purse with my valuables. My backpack just has water, guide book, umbrella, jacket, etc. Things with no real value. A thief would be disappointed 🤪"}, {"username": "Tracy Scott", "comment_text": "I wore mine back to front on my chest & still got robbed on the train in Madrid.\nRecently travelled to Italy with Pacsafe & Travelon bags - no problems at all 😊"}, {"username": "Teresa Coen", "comment_text": "There are backpacks with side zip pockets and one pocket that sits against your back to solve this exact issue. I found one on Amazon,"}, {"username": "Jacqui Bridges", "comment_text": "Locks are a great visual deterrent. And have your travelling companions keep an eye on you and you on them."}, {"username": "Jacqui Bridges", "comment_text": "Also put your wallet in an internal pocket of the backpack so it can’t just fall out the t the bottom is cut."}, {"username": "Lisa Donaldson", "comment_text": "Briannah Donaldson very helpful info"}, {"username": "Lisa Donaldson", "comment_text": "Briannah Donaldson very helpful info x"}, {"username": "Rachael Richardson", "comment_text": "I never use a backpack , if I do it only has food, drink, sun cream etc so they will be very disappointed if they try and take anything !😂"}, {"username": "Yvette Pavone", "comment_text": "You turn it to the front in a crowd or on a train"}, {"username": "Marianella Flynn-Morales", "comment_text": "Wear the backpack front facing instead this way you see it and use a small lock on it as well. Best place to keep cash, debit cards is in uour bra on the side of it by armpit area. Funny 😂 but it works!"}, {"username": "Felicity Scates", "comment_text": "I haf a little bag that had all my money, cards and bus passes in. This was underneath my jacket horizontal on my shoulder. My backpack just had water and a jacket in basically. When I went on a packed bus, I just put the backpack in front of me. Pickpockets are in every country so you just have to be street wise"}, {"username": "Liz Spaeth-Werner", "comment_text": "My friend & I just traveled quite a bit by train in Holland/\nAmsterdam/\nAntwerp with 35l Cotapaxi plus each of us kept personal items in a crossbody bag. No issues whatsoever where we travelled & definitely made it easier to move around. Will admit that the 18-20 lbs in backpack did occasionally feel heavy for this very fit 60+ year old."}, {"username": "Josephine Spallina", "comment_text": "Absolutely is. In Italy now. Bring cross body purse that’s holds mostly everything and make sure you wear in front of you and hold it on the metro."}, {"username": "Susan Chelini", "comment_text": "I often wear my backpack on my chest."}, {"username": "Suzanne Mills", "comment_text": "Wear it front facing"}, {"username": "Kimi Griffith", "comment_text": "I bought a \"security\" backpack off of Amazon, the zipper is against your back. I also wore a small crossbody bag w/ my important papers, cards and cash."}, {"username": "Katie Kaz", "comment_text": "Sherpani makes a great back pack with security features. I love mine and now use it everyday for work too. It doubles as a crossbody."}, {"username": "Delphinia Salamin", "comment_text": "I use backpack with compartments that you can tie around your waist. I use a small combination lock that you can put between 2 zippers and lock valuables. I only unlock when needed."}, {"username": "Meredith Holloway Helbon", "comment_text": "I have a slash-proof backpack (every part of the backpack and it’s straps cannot be cut or slashed), and the zippers have a special locking mechanism that isn’t easy to open without being noticed. You may also lock each zipper if you’d prefer. The only thing you couldn’t necessarily secure would be a water bottle or anything you might just stick in the pockets meant to hold a bottle. Mine is Travelon brand, but there are many options."}, {"username": "Manuela Bassetti", "comment_text": "In crowded areas I keep it on my back, walking with a backpack on the front is not exactly comfortable, but I have a lock to keep it closed, I have a “flexible” lock, something like this"}, {"username": "Carrie Lamm Bishop", "comment_text": "My backpack is just for traveling on plane or train. While site seeing, I’m using a belt bag around my waist, with blouse over it."}, {"username": "Kit Nader", "comment_text": "Put your valuables In a zip pocket. And you can tie the rucksack zips closed"}, {"username": "Lynette Yager Hansen", "comment_text": "I bought anti-theft bag"}, {"username": "Colleen Jennings", "comment_text": "I use my Longchamp backpack to carry my rolled up rainmac, bottle of water, lipstick. My phone’s in my front pocket or in my hand. If they get my Chanel lippy I’ll be cross 😡"}, {"username": "Tami Sue", "comment_text": "Just don't put anything you don't want to lose easily to get to inside ur backpack. But valuable at the bottom. I like the backpacks that have secret zippers. I have a Nordace."}, {"username": "Gillian O'Callaghan", "comment_text": "When it's crowded I wear it on the front with my arms around it. It goes over my small crossbody purse. 5 months travelling and no issues."}, {"username": "Karen Lawrence Smith", "comment_text": "I use caribeeners to lock the zippers."}, {"username": "Lorraine Swick Sanfilippo", "comment_text": "I saw many wearing them on the front in London"}, {"username": "Lucille Iuliucci Nicosia", "comment_text": "You don’t put your passport or your money in your backpack"}, {"username": "Alison Gilchrist", "comment_text": "I use a sling bag & keep it in front of me. Hands free if needed, but hold onto it in crowded areas. Had stuff stolen from a waist bag (fanny pack) on the Metro in Rome years ago & don't want to repeat that experience."}, {"username": "Ryan Shearer", "comment_text": "Safest option is USD taped to the body. Been travelling this way for years and never had an issue."}, {"username": "Jen Jen", "comment_text": "I was advised to use very large safety pins and attach the fanny pack on each side onto my blouse. I actually was accosted in Rome by 2 gypsies. One put a piece of cardboard in front over my fanny pack by my chest and the other gypsy was in the back trying to unsnap it. It happened so quickly. Fortunately, I followed advise given while in Rome and they failed. The experience did scare the heck out of me. Watch for the motor bikes also when walking on the streets. A friend had her shopping bag ripped out of her hand that way. The other thing we saw was a gypsy who threw a baby (doll) at an American who dropped everything to catch the baby not knowing it was a doll. Her stuff disappeared by the other woman. It is a shame what \"they\" do to survive. We reported it to a policeman that we found and then saw police patrol getting them to leave. They can't afford this to happen because then tourists wouldn't be in that shopping zone. Had I not seen or experienced it, I seriously would have doubt it. Just be aware of your surroundings. Rome can be enchanting."}, {"username": "Lynette Burns", "comment_text": "I purchased a singlet type of top with a hidden area lengthwise down the seam for my passport etc which was also zipped then just wore a usual top, very comfortable and easy to use"}, {"username": "Paula Rosati", "comment_text": "I know folks love them, but I especially hate getting whacked with them all the time because the wearer forgets about the extra space they take up. Please remember you need six extra inches back there."}, {"username": "Richelle Trezise", "comment_text": "I have purchased a pacsafe bag it has double lock on zippers and is slash proof. It even has a lock on one strap so you can lock it to the table."}, {"username": "Patti Porter", "comment_text": "This is why I would never wear one with anything I cared about if stolen in it. I’ve seen some with zipper on side next to your back or some people that wear them in front"}, {"username": "Paola Tulley", "comment_text": "Safety pin the zipper so they can’t just slide the zip open. Some people wear the backpack on the front."}, {"username": "Shaneand Fiona Cummins", "comment_text": "Tara Tuohey"}, {"username": "Ann Marie Foley", "comment_text": "I use small zippers for my back pack but I also have a small cross body bag that I use for the important stuff. I can put my bag into the backpack for the plane. Just use the backpack for day items- sweater, pashmina, raincoat, water, umbrella, sunscreen, dressy flats for dinner, or whatever I might need. It Also takes items if I have to remove layers.!"}, {"username": "Claudine Auclair", "comment_text": "We bought this backpack. We have not used it. Also bought a Travelon crossbody with zippers that lock. We also have small carabiner to hold zippers together so makes it a bit harder to reach. Any to slow would be pickpocketing down."}, {"username": "Desiree Miller Kessel", "comment_text": "I have had things stolen and although a pain everything is replaceable. Enjoy, be aware, but focus most on creating amazing memories"}, {"username": "Paula Shannon", "comment_text": "If you tie the zippers together with something like a twist tie (like we use to close up bread bags) it will be easy for you to open but would take longer for a thief to open so they won’t bother trying."}, {"username": "Rhonda Kurbis", "comment_text": "Yep I’ve seen people wear their back packs in front."}, {"username": "Jill Stanley", "comment_text": "I bought some carabiner clips with screw gates on them. It’s hard to unscrew it while someone is walking along. But I also ensure anything valuable is right in the bottom of the pack. You could also use a small padlock if you wanted. I divide my credit cards and money up so some are also in a money belt and/or in the hotel safe. Then if one thing is stolen, you are still ok. I also have a sheet with all the bank’s phone numbers so it’s quick to block a card."}, {"username": "Kary Bell", "comment_text": "I used a travel theft free backpack purse from Amazon. Zipper is against your back. Stylish and didn’t have to worry."}, {"username": "Patricia Archuletta", "comment_text": "Few years ago bought underwear that has zippered pockets. Worked great in Spain trip. Fits passport."}, {"username": "Tonya Rauton", "comment_text": "One of the girls in our group was pick pocketed in Rome while her bag was on her back. I used carabiners on the zippers on my backpack, but kept important stuff in a crossbody. Someone tried to get my bag INSIDE the Vatican!"}, {"username": "David Davey", "comment_text": "Yes, in crowded places or in packed bus wear it front."}, {"username": "Marlo Dotti", "comment_text": "Pac safe backpacks have locking zippers. Worked great for me"}, {"username": "Rosslyn Patience", "comment_text": "Wear it on the front. Put a lock on it."}, {"username": "Graham Sherlock", "comment_text": "Never have valuables in your backpack like. phone, wallet, purse, passport or cash"}, {"username": "Angie Petrillo Robinson", "comment_text": "You can put your valuable in one spot in the back pack and use a luggage lock on that area."}, {"username": "Heather Stokes", "comment_text": "Cross body bag but just big enough for you essentials."}, {"username": "Mary Gregory", "comment_text": "I wore mine in front when in crowds"}, {"username": "Madeline Caporale", "comment_text": "There are anti-theft back pack options such as this one.\nhttps://\nwww.amazon.com/\nTravelon-43207-5\n00-Anti-theft-P\nackable/dp/\nB06XBM42MC/\nref=asc_df_B06XB\nM42MC/\n?tag&linkCode=df\n0&hvadid=312057\n568541&hvpos&hv\nnetw=g&hvrand=1\n312135701485426\n6340&hvpone&hvp\ntwo&hvqmt&hvdev\n=c&hvdvcmdl&hvl\nocint&hvlocphy=\n9016952&hvtargi\nd=pla-409009406\n130&ref&adgrpid\n=65790558887&th\n=1"}, {"username": "Miriam Griffin Woods", "comment_text": "Pac safe backpacks"}, {"username": "Sam Higgins", "comment_text": "I used this one for a tour we took throughout Europe (including London, Paris, Rome) and it was amazing. It fit my water bottle, small umbrella, wallet, portable charger-I bought the smaller version, but it fits so much. It’s also comfortable to wear. It zips against your back, so I never had to worry about theft. Also, I used it in pouring rain on multiple occasions, and nothing in my bag ever got wet at all. Would highly recommend.\n\nCHERUTY Women Backpack Purse PU Leather Anti-theft Casual Shoulder Bag Fashion Ladies Satchel Bags https://a.co/d/\neMdkwgd"}, {"username": "Aaron Peterson", "comment_text": "Sling it over one should with the pack to the front in crowds"}, {"username": "Ryan Shearer", "comment_text": "Get padlocks, carry all your valuables in a custom passport belt wrapped round my thigh with a biometric thumb lock.\n\nOr you know, put your wallet in a pocket on the inside of the bag. It’s Italy not Bagdad."}, {"username": "Laura Uribe", "comment_text": "Also if you go with a backpack, don’t set it on the ground next to you or hang it off the back of your chair. You would not believe how often we see that when traveling."}, {"username": "Maria Minnuto Minervini", "comment_text": "keep anything valuable in a Crossbody bag in front of you"}, {"username": "Anna Dawson", "comment_text": "I wear my small backpack on my front, I feel very comfortable doing so."}, {"username": "Jaime Cleek", "comment_text": "If you don't usually use a backpack you don't really need to bring one when you're out and about, just bring something small to carry your necessities.We always use a backpack when we travel or do much of any adventure so that we an have things easily accessible."}, {"username": "Robin Darmstadt Mancil", "comment_text": "Luggage locks combination style"}, {"username": "Enas Mourad", "comment_text": "Carry it on the front I do that anywhere I go even my cross bag I turn it a little to the front so I can put my hands on it"}, {"username": "Sondra Knap", "comment_text": "I bought one that is contoured and meant to wear across the front of your body. It was lightweight, fit what I needed, had a holder for my waterbottle, and all openings/\nzippers were in the front against my chest. Highly recommended!"}, {"username": "Miyuki Kanno Paul", "comment_text": "We use foldable daypack from Kathmandu"}, {"username": "Barbara Bastianini", "comment_text": "Yes it is. In my opinion backpacks are a gift to pickpockets."}, {"username": "Janet Farrell", "comment_text": "I carried my backpack on the bus....with an extra pair of socks, sunscreen, toilet paper (don't laugh, a few places did not have any in bathroom), stuff like this that I didn't need to carry in my anti theft travelon cross body bag. I left my backpack on bus and only carried my money , glasses, essentials in crossbody. Pack small snacks to keep in backpack. .autogrill stops were great"}, {"username": "Patricia Breh", "comment_text": "I have an Osprey Fairview 40 and there’s no way someone can just casually unzip it quickly. It has compression straps and it has a flap that covers the zipper (you tuck the zipper pull into it)."}, {"username": "Greg Lewis", "comment_text": "Are thieves that prevalent in Italy? I’m sure they exist but some of these posts make it seem like it’s rampant. Do I need to be more concerned than I am? Going in Oct."}, {"username": "Laurie Denoni", "comment_text": "Personally I would not use one daily. My husband used one for carryon but it was left in the room. A good quality cross over bag is good. I use a leather purse I bought in Florence. I keep it on while at restaurants outside. I do not use a wallet but put my cards etc in a separate inside zippered compartment."}, {"username": "Anna Gambino", "comment_text": "We use a backpack for necessities, not cash, cards or passports. My husband Carrie’s backpack and I use a small pouch next to my chest for valuables. Like this one."}, {"username": "Sharon Wenzel", "comment_text": "https://\npacsafe.com/\n?gclid=EAIaIQobC\nhMIp52P7pLDgAMV\n_x2tBh1PFgH8EAA\nYASAAEgI9lPD_Bw\nE"}, {"username": "Susan Monaghan", "comment_text": "I’ve had a backpack yanked off my back as I walked by a very strong male using both hands. It’s the last time I ever wore anything valuable on my back!"}, {"username": "Laura Gillespie", "comment_text": "Also, you will not want something too big/heavy w items. A light day pack, that can be worn front or back, when in crowds."}, {"username": "Donna Watson", "comment_text": "We always use a backpack. Just make sure all compartments are zipped and have your valuables in your purse or waist belt"}, {"username": "Renee Kremesec", "comment_text": "I used my backpak for everything besides clothes.\n\nNever carried anything really valuable.\n\nMonies, credit cards, passports in my zipper and locked purse and my hubby wore a under the shirt waste belt that carried his stuffs.\n\nI then has a roller carry on\nMy buggy bought a 2 part backpak and just carried that"}, {"username": "Cecilia Christine Costantini", "comment_text": "You carry it on the front. I am Italian and automatically switch my backpack from the back to the front when I get the underground in Rome or I am in a crowded place. Also, my wallet is in the backpack, most likely at the bottom, not in one of the pockets."}, {"username": "Nina Tross", "comment_text": "yes, which is why the backpack I use has the zipper on the back side so it is always against my back. I have traveled all through Italy with it and have not yet had a problem."}, {"username": "Christine Ann", "comment_text": "I bought a crossbody pacsafe for my back that I could easily lock. I didn’t always have it locked, but normally kept the front section locked with my valuables. The back section, I could carry my shawl, handheld fan, water, phone battery charger etc. I loved being able to lock it and have it on my back"}, {"username": "Erin Thomas", "comment_text": "I wear a money belt for cash & cards. I use a backpack for water bottles, sunscreen, umbrella (shade) and little things that are easy to replace"}, {"username": "Marie Beseau", "comment_text": "I ordered this from Amazon, it a personal item size, locks and has no access from the front, the zipper is under a fold and locks. About $45 CAD"}, {"username": "Nellie Yuret Kellett", "comment_text": "Travelon makes great bags for security against theft."}, {"username": "John Green", "comment_text": "Travelon 43207 500 Anti-Theft Packable Backpack, Black, One Size\nOne Size\nWe used this one from Amazon. It folds up into a wallet sized pouch for storage and has locking zippers. It’s thin material with a padded bottom so in the heat it was as lightweight as possible but I still had everything I needed. Two main pouches for dividing your stuff. I used it for two weeks in Rome and it was great"}, {"username": "Lauren Vassallo Beattie", "comment_text": "My husband used a pack safene and wore it on the front in train stations and other hotspots"}, {"username": "Michelle Smith", "comment_text": "Wear on your front if it's a small size"}, {"username": "Victoria Williamson Brattoli", "comment_text": "Travelon prevented a pickpocket from getting in when I was in London. Caught her right in the act"}, {"username": "Sharon Mclelland", "comment_text": "Use zipper locks and wear front side when in a crowd"}, {"username": "Robert Lewis", "comment_text": "Yes reverse it"}, {"username": "Laura Irmina", "comment_text": "I don't know how it is called in English but it works for me everytime. I keep the money, cards and cigarettes, water bottle I carry in my hand, you refill it many times anyway. Also, there are bigger bags of this kind."}]}, {"id": "2206518233080588", "text": "Has anyone stayed at \"A Peace of Rome\" hotel in Rome?. Thoughts please", "link": "facebook.com/groups/1373361046396315/permalink/2206518233080588/", "likes": 0, "comments": [{"username": "Leanne Bingle", "comment_text": "Elizabeth Colleen Fowler"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2206523413080070", "text": "Looking for a suggestion on which tour is the best…first time visiting Italy and so many options to pick from.\n\nLooking for a good tour of the vatician and Sistine chapel with skip the lines etc. as well as an amalfi coast tour.\n\nThank you in advance 😊", "link": "facebook.com/groups/1373361046396315/permalink/2206523413080070/", "likes": 2, "comments": [{"username": "Debbie Milne Jenkins", "comment_text": "I’ve taken tours with Trafalgar and Costsaver (discounts available with Costco and AAA). Also have used Gate 1 Discovery small group tours. All 3 were great with numerous itineraries offered. Just my opinion but Venice, Florence and Rome are spots to be prioritized on your first visit. Enjoy your time in Italy."}, {"username": "Anthony Martini Jr.", "comment_text": "Search the forum, this is asked 55 times a week 🔍🔎🔍🔎"}, {"username": "Kelly Aynes Zingaro", "comment_text": "Early morning tour of the Vatican with breakfast after was great. An hour before opening, small group guided tour. Not crowded. I booked from the Vatican site."}, {"username": "Effie Gatanas Kontolios", "comment_text": "Liv Tours"}, {"username": "Kathy Tully Sexton", "comment_text": "Husband just did a 7:30 am breakfast tour today. Booked thru Viator. Had breakfast in the garden then the tour. We booked last min so perhaps there is one earlier. He said another half hour earlier would have made a big difference and likewise a half hour later would not have been worth the price He got into the chapel just as the general admission started. Much better than the last time we did general admission but only 120euro as opposed to the 400 euro really early tours we were looking at"}, {"username": "Cheryl Caferro Shul", "comment_text": "Thanks for the info."}, {"username": "Jeff McLellan", "comment_text": "Book Prime with breakfast after directly with Vatican Museum is the only way to guarantee access and is your best value. Depending on the size of your group and your budget consider Prime VIP that is what we did private tour, us and our guide were the only people other than guards in Sistine Chapel for at least ten minutes was amazing experience."}, {"username": "Angela Marsala-Gaydos", "comment_text": "I am going on a Firebird Tour - small group -(8) Venice, Florence, Rome, Sorrento the Almafi coast and Sicily 17 days leaving Oct 11th\nCheck it out!"}, {"username": "Sharon Wenzel", "comment_text": "Www.livtours.co\nm"}]}, {"id": "2206526006413144", "text": "Hi All! When in Florence, we would like to do a day trip and go to a couple of ￼vineyards.\n\n1- which ones do you recommend?\n2-is it better to go on our own (we’ll have a car)\n3- if going through a tour, Which tour do you recommend? ￼\n\nGrazie!😊", "link": "facebook.com/groups/1373361046396315/permalink/2206526006413144/", "likes": 3, "comments": []}, {"id": "2206536643078747", "text": "Has anyone been to Sestri Levante? We are flying to Genoa and getting the coastal train to destination. Happy for any tips", "link": "facebook.com/groups/1373361046396315/permalink/2206536643078747/", "likes": 3, "comments": [{"username": "Erika Reyes Aguilar", "comment_text": "It is a very beautiful route from Genoa to Sestri, several small cities with spectacular views, my recommendation is to visit Portofino and Santa Margarita Ligure before reaching Sestri.\n\nBaia del Silenzio is a very attractive point of the city with a free beach of fine and clear sand that you can enjoy."}, {"username": "Edna Jones", "comment_text": "Thank you so much! 😊"}]}, {"id": "2206532806412464", "text": "Can you recommend a good public or affordable beach’s in capri , positano and amalfi\nWith cost plzzzzz 😄", "link": "facebook.com/groups/1373361046396315/permalink/2206532806412464/", "likes": 1, "comments": []}, {"id": "2206550416410703", "text": "Hello group :) Im planning a trip to the Amalfi coast in Sept. Im a big fan of the wine tourism and during my free of activities day I plan a visit to Marisa Cuomo winery which is stated as one of the most beautiful wineries on the Amalfi coast. Has anyone been there? How can I get there? I contacted the winery and they told me to organize a transfer myself. My starting point is Sorento. Also if someone have any other information for winery or place can share as well :) Thanks to all :)", "link": "facebook.com/groups/1373361046396315/permalink/2206550416410703/", "likes": 1, "comments": []}, {"id": "2206543343078077", "text": "Rome recap and recommendations…\n\nWe just finished a 5 day trek through Rome with our 2 boys after leaving Florence. Tip: if you want to see inside the Colosseum and Vatican, plan in advance. We booked the underground tour through the Colosseum months in advance and it sold out pretty quickly. It was a fabulous tour but 🥵! I mistakenly booked it for 2:30-5:30 pm and we were very hot. But it was a very amazing experience nonetheless!\n\nWe also booked a tour through City Wonders to see the Vatican, Sistine Chapel and St Peter’s Basilica. This also sells out. But highly recommend a tour because the guides are so knowledgeable and point out so many things and give you so much history that you just can’t learn from just walking through!\n\nRome is big! There are a lot of different areas unique to themselves. For shopping do some research in advance for your preference. There are high end areas and vintage areas, local areas etc.\n\nFood was delicious of course. So many recommendations I had from this site but because Rome is so big, it was much harder to hit all the spots unlike Florence. We went to Il Felini twice because we loved it so much. A friend of ours who is from Rome recommended a few local spots Romolo e Remo and Mariuccia that were delicious! We ata a lot of gelato. My favorite Come il latte. I had the pistachio which was brown not green. So fresh, nutty and just the most delicious thing I have ever eaten. I ate ALL the pasta, ALL the gelato and didn’t gain a single pound. I think perhaps because of all the walking and the difference in fresh food quality. 🤌\n\nIn any event, eat, drink and live your best life! Viva l’Italia!!! ❤️🇮🇹❤️", "link": "facebook.com/groups/1373361046396315/permalink/2206543343078077/", "likes": 277, "comments": [{"username": "Mary Evans", "comment_text": "Good planning. It’s a must for those attractions"}, {"username": "Mariposa Mariposa", "comment_text": "Awesome pictures🇮🇹Thanks for sharing tips!!"}, {"username": "Judith Tobin", "comment_text": "Terrific photos"}, {"username": "Clint Foster", "comment_text": "Please share the links to the tours you took. There are so many and I’d rather book one with someone who was recommended."}, {"username": "Lianne Repitsky-Dehnam", "comment_text": "Thanks for sharing! Where did you stay? Would you recommend it?"}, {"username": "Brenda Drysdale", "comment_text": "Fabulous photos! Thanks for sharing."}, {"username": "Eileen Muro", "comment_text": "OMG ....Yes. we just came from 10 days in Italy. We literally ate pasta, pizza and Gelato EVERYDAY and I didn't gain a pound! Husband actually list 2 pounds. We walked and walked everywhere. We also did the climb up to the Duomo in Florence and the climb up to the Dome of St Peter's and walked up to the Pizzale Castel San Pietro in Verona. So I think k we definitely burned off all the calories from all the delicious food. Also the carbs were much needed for the climbs!"}, {"username": "Gayle Hogg", "comment_text": "WhT a fantastic experience for your boys xx"}, {"username": "Amanda Stewart", "comment_text": "Karen Stewart have you looked at booking us in for the tour for the Colosseum?"}, {"username": "Marcus Hiesler", "comment_text": "Left Roma 2 days ago, were there for 4 days. Totally agree with what you say. Colloseum do early or late. Hop on hop off bus is great and an easy way to get around. See as much as you can walk as much as you can. Use the bus otherwise. And eat at the little places, all the food we had was amazing."}]}, {"id": "2206494206416324", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2206494206416324/", "likes": 16, "comments": []}, {"id": "2205924743139937", "text": "Suggestions for best Walking food tour in Florence. We are a party of 4 and I would be interested in a private tour. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2205924743139937/", "likes": 4, "comments": []}, {"id": "2205939126471832", "text": "We are planning to travel on a fast train from Rome to Florence on a day that appears to be a “Scheduled Strike”. Are fast trains affected by this strike? I am aware that in July the fast trains did honor the strike but the information seemed to suggest that this rarely happens. We were thinking that we should get tickets for the early morning train (get to Florence before 9 am) to avoid the uncertainty. Any information would be helpful! Thanks so much!", "link": "facebook.com/groups/1373361046396315/permalink/2205939126471832/", "likes": 3, "comments": [{"username": "Gopa Dasgupta", "comment_text": "Can you pl share the date? Is it in October?"}, {"username": "Chiara Codecá", "comment_text": "Your insight is correct, fast trains (Frecciarossa) at commuting hours, roughly before 9AM and after 6 PM are usually excluded from the strikes. Of course the best option would be not to travel on a strike day, but if you have to, these trains are the best choice you can hope for."}, {"username": "Geetha Rama", "comment_text": "Yes, please share the strike dates. Tq"}, {"username": "Elena Mcleish", "comment_text": "This happened to us in the July strike, we had a train booked from Rome to Venice. There are always Guaranteed trains usually I think between 6 to 9 am, not sure about the evening ones. Try to check the guaranteed train times and book them. We managed to changed ours to a guaranteed train and had no problems, but at the station you could see quite a lot had been cancelled."}, {"username": "Andrea Herbold K.", "comment_text": "Trenitalia minimum services guaranteed in the event of a strike: https://\nwww.trenitalia.c\nom/it/\ninformazioni/\ntreni_garantiti_\nincasodiscioper\no.html"}, {"username": "Rick Lozano", "comment_text": "October 20th?"}, {"username": "Michelle Anderson- Rowland", "comment_text": "If you have prebooked your fast trains will it show up on the app if you train is affected??"}, {"username": "Diane Davis Lawyer", "comment_text": "Unless I am misunderstandin\ng the info on this website, I believe the 'guaranteed' trains are not what is being mentioned in this string. It's not any train, only certain ones at certain times on certain lines. Here's a list of those in the Naples area. https://\nwww.trenitalia.c\nom/content/dam/\ntcom/allegati/\ntrenitalia_2014/\nin_regione/\ntreni-garantiti/\nRegionale%20Camp\nania_sito.pdf"}]}, {"id": "2205966056469139", "text": "Going to be in Lake Como a day before my tour starts. So will have a day and a half on our own. Suggestions please? I’ve never been to Italy.", "link": "facebook.com/groups/1373361046396315/permalink/2205966056469139/", "likes": 5, "comments": [{"username": "Rebecca Yeoh", "comment_text": "Assuming you will be based in Como, jump on a ferry and go up to Bellagio/ Varenna/ Menaggio and back. Then on your half day you can potter around Como town which is lovely. There are some great alleyways and shops. Or you can go up the Furnicular for spectacular views of the lake."}, {"username": "Penny Reed", "comment_text": "At slow ferry ticket do I buy from Como to see bellagio/ varenna/\nmenaggio? Thank you!"}, {"username": "Glenn Todd Webb", "comment_text": "Boat trip to villa Balbianello in Tremezzo. Villa Carlotta is there too. Villa Melzi is in Bellagio.\nDuomo di Como."}]}]