[{"id": "2193801434352268", "text": "Churches, towers and noble palaces… a small picturesque town perched high on a hillside surrounded by olives trees as far as one can see : come explore Trevi!\n\nTrevi is known as the “capital of olive oil” forआणखी the production of extra virgin olive oil – an oil known and appreciated everywhere for its properties but it’s also a place of great charm and magic with its massive defensive walls, dating back to Roman times , and its medieval center characterize by a network of narrow streets.\n\nAre you ready to discover one of the most fascinating hamlets of Umbria?\nJoin us: https://nextstop-italy.com/virtual-tours/trevi-capital-oil/\n\n#virtualworld #italygram #ravelloitaly #umbria #renaissanceart #hilltown #umbriagram #assisi #virtualtour #medievalart #umbriatourism #Spello #hiddenparadise #vacationmood #italytravel #italyiloveyou #hilltopviews", "link": "facebook.com/groups/1373361046396315/permalink/2193801434352268/", "likes": 3, "comments": []}, {"id": "2193564327709312", "text": "We are planning on visiting Italy for 4 weeks next year but not when it’s too hot / busy. So maybe September 🤷‍♀️\n\nLove some itinerary suggestions please ?", "link": "facebook.com/groups/1373361046396315/permalink/2193564327709312/", "likes": 0, "comments": [{"username": "Lydia Springer", "comment_text": "We are planning 4 weeks in Europe next year: England and Ireland in late August/early September and then Italy in mid-September. I would have booked September/\nOctober but my daughter doesn't want to freeze in Ireland and northern England. I think September is perfect!"}, {"username": "Shana Woodfield", "comment_text": "Start in the north and work your way south."}, {"username": "Loredana Polichetti", "comment_text": "September is perfect"}]}, {"id": "2193553407710404", "text": "We have a free day today in Florence\nWhat your suggestion in this hot weather?", "link": "facebook.com/groups/1373361046396315/permalink/2193553407710404/", "likes": 6, "comments": [{"username": "Cynthia L. Earnhardt", "comment_text": "Day trip to Tuscany!"}, {"username": "Jenny McDannell", "comment_text": "Interactive Leonardo davinci museum. Small, but we spent about two hours there (with kids)"}, {"username": "Paul Anderson", "comment_text": "Go to the pool."}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Florence/\nCinque-Terre-Hik\ning-Day-Trip-fr\nom-Florence/\nd519-5070CINQUE?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}, {"username": "Karoline Bakker", "comment_text": "Relax and stay inside between 1 and 3 pm."}, {"username": "Molly Elizabeth", "comment_text": "Rent a Vespa and drive through Tuscany!"}, {"username": "Anne Brooks Easter", "comment_text": "We took the train to the beach @ Viareggio! Pay for access to a private beach with a pool!"}, {"username": "Cathleen Huismann Dinubilo", "comment_text": "Gucci museum. Interesting and unexpected."}, {"username": "Kirsten Abrams", "comment_text": "There’s a great club with a pool on via Bufalini"}, {"username": "Melinda Brown", "comment_text": "Booked the Cinque Terre trip with Get My Guide."}, {"username": "Pong Ac Ai", "comment_text": "Piazza Michelangelo we never had a chance cause we were so tired they say you could see the whole Florence from there"}, {"username": "MaryAnn Filippone Paolillo", "comment_text": "The florentine 4 -Gucci, Ferragamo, Pucci and Cavalli. But always bargain with them 🇮🇹"}]}, {"id": "2193551847710560", "text": "One week on Amalfi and one week in Sicily - has anyone done this and what’s in Sicily to see and do! Been quickly to Amalfi would love to explore off the beaten path!", "link": "facebook.com/groups/1373361046396315/permalink/2193551847710560/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "follow us https://\nnextstop-italy.c\nom/\nvirtual-tours/\nbest-of-sicily/"}, {"username": "Alessia Zito", "comment_text": "When you go? in sicily there is everything, from beautiful beaches to a lot of art"}]}, {"id": "2193540677711677", "text": "We are going to Venice on September for first time.... excited! Can anyone suggest middle range accommodation please. Busy area but hotel with some sound proofing please !", "link": "facebook.com/groups/1373361046396315/permalink/2193540677711677/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.anrdoezrs.ne\nt/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187870-d2026\n94-Reviews-Sple\nndid_Venice_Sta\nrhotels_Collezi\none-Venice_Vene\nto.html"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.dpbolvw.net/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187870-d2358\n89-Reviews-Hote\nl_Paganelli-Ven\nice_Veneto.html"}, {"username": "Rachael Richardson", "comment_text": "Gorgeous apartment !"}]}, {"id": "2193540211045057", "text": "Hello, I would like to book tickets to Galleria Borghese in Rome and noticed that they have a reduced ticket price on offer named \"Intero Speciale\". Has anyone purchased these kind of tickets before? I am assuming they are just a special offer (although the translation isn't quite the same). Also, has anyone done the guided tour there before? Is it worth it? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2193540211045057/", "likes": 0, "comments": [{"username": "Elena Eugeni", "comment_text": "Intero speciale is usually the last time slot of the day, with a shorter time for visit. Check the time slots to be sure"}]}, {"id": "2193539551045123", "text": "Hi All,\n\nWhat are some fun things to do in the Amalfi Coast after dinner? Any suggestions for bars/clubs for young people.\n\nThanks!", "link": "facebook.com/groups/1373361046396315/permalink/2193539551045123/", "likes": 1, "comments": []}, {"id": "2193530927712652", "text": "I'm heading to Italy in late December/early January. Does anyone have any recommendations for interesting experiences for that time of year?", "link": "facebook.com/groups/1373361046396315/permalink/2193530927712652/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "xmas markets or presepi"}, {"username": "Loredana Polichetti", "comment_text": "Sky in north Italy, luci d’artista, presepi"}]}, {"id": "2193526321046446", "text": "Any advice on who has the best eSim mobile plans with data. Thanks 😊", "link": "facebook.com/groups/1373361046396315/permalink/2193526321046446/", "likes": 2, "comments": [{"username": "Minvi Abrenica Duncan", "comment_text": "We used Airalo during our Mediterranean trip and we’re very pleased with the service. Reliable and inexpensive compared to going with Verizon’s travel pass or international plan. My brother used Holafly in Slovenia and he liked it. He’s with TMobile."}, {"username": "Ted Larson", "comment_text": "I used Orange tourist plan. covered all of Europe for a month….."}, {"username": "Theresa Ladner", "comment_text": "Airalo is data only, but you can make VOIP calls and text via whatsapp or facebook messenger.\n\nOrange Holiday includes a french phone number, data, and texting."}, {"username": "Kelly Cannon", "comment_text": "Orange."}, {"username": "Angela Koots", "comment_text": "I found Airalo worked great until it didn’t. 🤣 Connectivity was intermittent, so ended up getting a real SIM through Vodafone. 10 euro gave me 200GB of data which is way more than I needed for the month."}]}, {"id": "2193521067713638", "text": "What is the best way to get from Florence to Pisa airport? Need to fly out of Pisa but staying in Florence", "link": "facebook.com/groups/1373361046396315/permalink/2193521067713638/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Florence/\nFlorence-to-Pisa\n-Airport-Privat\ne-Transfer/\nd519-2662FLRHTLP\nSAAPTPV?pid=P00\n070587&mcid=423\n83&medium=link&\nmedium_version=\nselector"}, {"username": "Gillian O'Callaghan", "comment_text": "Train to Pisa then connect with the PisaMover to the airport. Well signposted."}]}, {"id": "2193510724381339", "text": "Travelling from Australia and just wanting any tips for getting a sim card on arrival. Are there operators at Rome FCO Airport that provide a tourist data sim or is it better to organise it in Rome city area?", "link": "facebook.com/groups/1373361046396315/permalink/2193510724381339/", "likes": 1, "comments": []}, {"id": "2193234414408970", "text": "Has anyone figured out how to book tickets for the Patheon directly? Not sure why but I’m really struggling to find the official sight!", "link": "facebook.com/groups/1373361046396315/permalink/2193234414408970/", "likes": 0, "comments": [{"username": "Heather Sechrist", "comment_text": "It never worked. Even on an Italian SIM card. We went and stood in line and explained this and they just nodded like it’s been an issue."}, {"username": "Miroslav Procházka", "comment_text": "Pantheon it is not free? 😳"}]}, {"id": "2193259667739778", "text": "Hello everyone,\nWe will be in Milan in two days. We were planning to go to Sicily, but then decided to stay elsewhere due to the current heatwave.\n\nAppreciate any recommendations for a (preferably) quiet seaside town, nice views and good food in Italy.\nThank you in advance! 🤗", "link": "facebook.com/groups/1373361046396315/permalink/2193259667739778/", "likes": 3, "comments": [{"username": "Alessia Zito", "comment_text": "Why did you decide not to go to Sicily anymore? it's ideal for this heat, good food and gorgeous beaches"}, {"username": "Alessia Zito", "comment_text": "I live in milan, rather skip milan because it's too hot here and you wouldn't be able to enjoy the city, sicily is very hot too but there is the sea to refresh yourself"}, {"username": "Rhonda Hope", "comment_text": "Sicily seaside would be perfect but from Milan you can head to liqurian coast"}, {"username": "Claudia Castellini", "comment_text": "This terrible hot is actually a problem if you are visiting cities, but on the beach there’s always a little bit of wind and if sea is beautiful, you can stay in the water!\nItaly has a lot of minor island in the Tirrenian Sae, choose one of those (Elba, Ponza, Ischia for example)!\nOr Tropea or Maratea.\nOr Puglia, on the Ionian Sea.\nAvoid Adriatic if you are looking for clean and beautiful water.\n,"}, {"username": "Wolly Valentina Losi", "comment_text": "Le Cinque terre."}, {"username": "Nikki Livingston", "comment_text": "Riomaggiore in Cinque Terre! We just left and it was absolutely beautiful!!!"}, {"username": "Ilonka Sinkeldam", "comment_text": "Ligurian coast is beautiful. Loano, Pietra Ligure, Alassio, Albenga, Ventimiglia, San Remo. Go there. Nice beaches and good food."}, {"username": "Connie Wilson", "comment_text": "Anywhere along the Ligurian Coast or Lago d’Orta or Maggiore. Or head to Val d’Aosta for mountain trekking and alpine lakes."}, {"username": "Whitney Meyers", "comment_text": "Milan worse than sicily lol"}, {"username": "Mary Agozzino Derrick", "comment_text": "And I have to ask what seaside town would still have accommodations on such short notice? Especially during a heatwave if you already have them in Sicily, go to Sicily"}, {"username": "Robin Burrell", "comment_text": "Northern Ligurian Coast. Camogli, Santa Margarita, Genoa"}, {"username": "Ece Yildirim", "comment_text": "Thank you everyone. We booked an airbnb in Moneglia for a few days and will see how it goes from there. If the weather gets better, we may go down south next week. 🤗"}]}, {"id": "2193251537740591", "text": "Hello we are going to be in Italy any suggestions on how to get from Pisa to Santa Margherita Liguria is there a direct train and would we have to book in advance. Thanks so much", "link": "facebook.com/groups/1373361046396315/permalink/2193251537740591/", "likes": 2, "comments": [{"username": "Lisa Lynn", "comment_text": "Download the Rome 2 Rio app. It will show you train times."}, {"username": "Loredana Polichetti", "comment_text": "Treni Italia app.\nYou can book pisa Santa Margherita.\nTrenitalia official"}, {"username": "Elizabeth May La Duca", "comment_text": "google maps/directions"}, {"username": "Patrizia D'Arcangelo", "comment_text": "You can go to Rapallo by train. Then you can take another train and go to Santa Margherita Ligure.\nI suggest you look at the Trenitalia app or website"}, {"username": "Virgz Van Møøre", "comment_text": "Check on Trenitalia"}, {"username": "Jennette Riches", "comment_text": "https://\nwww.rome2rio.com\n/map/Pisa/\nSanta-Margherita\n-Ligure"}]}, {"id": "2193339027731842", "text": "Any good hotels in Milan??", "link": "facebook.com/groups/1373361046396315/permalink/2193339027731842/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.kqzyfj.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187849-d1213\n0410-Reviews-NY\nX_Hotel_Milan-M\nilan_Lombardy.h\ntml"}, {"username": "Mat PO", "comment_text": "Portrait is the newest luxury hotel in town…"}]}, {"id": "2193462034386208", "text": "My 2 teenage children and myself will be visiting Venice, Florence, and Rome the second week of November. We have never been abroad, can anyone give me any tips or what to expect while there. What are some trips to making the most out our money? What are some absolute must see places since we have limited time in each place?\nThank you in advance for any information you can provide!", "link": "facebook.com/groups/1373361046396315/permalink/2193462034386208/", "likes": 161, "comments": [{"username": "Patti Koscal", "comment_text": "We too, will be in those cities for 12 days during this time. It’s my 1st trip to Italy, and I’m very excited. What days are you in Florence?"}, {"username": "Diana Torline", "comment_text": "I would recommend an organized tour or the tour guide company mentioned above if this is your first trip to Italy. If your time is limited and you want to see the major sites, your guide should know how to navigate and the easiest methods of transport. Also if something should occur, they can help you handle it.\nOnce you understand how the trains and buses operate, how to buy tickets, what areas to avoid etc.; you may be ready for solo travel without guides.\nMy first trip to Europe was done at age 40. We rented a car and followed our noses from Zurich thru northern Italy and then back through the Dolomites, Austria and flew out of Munich. I did much of the driving which meant I didn’t see as much as we moved about. It was like being an adult child because you didn’t understand a lot.\nI understand Italian so the Italian portion of the trip was easier but customs are different. There are often no words in another language for common English words. For example, there is no way to easily find overnight parking in Italy. They use the term custodial parking.\nMy point is that you have to make lots of guesses and assumptions when you travel in a foreign country on your own. It is much more relaxing and efficient to rely on people who know the ropes."}, {"username": "Lucrezia Folger", "comment_text": "What is really great is asking your teenagers to look online for ideas in each city you're going to. #1 they are online all the time anyway, #2 it helps them learn about where they are going prior to arriving.#3 it gets them involved in the trip planning process and creates ideas and discussion and excitement. Don't do all the planning, let them get involved."}, {"username": "Daniel Michael", "comment_text": "Fear is not real. It is a product of your thought you create. Do not misunderstand me. It is very real but fear is a choice. All I’m trying to say is with you need not to fear about losing your money, you can only lose it somewhere else but not with sir Luke Donald"}, {"username": "Dayna Steinberg Cioffi", "comment_text": "We are here now with our teens. The best part about traveling with kids this age is they like to stay up late and cities are all very alive at night!"}, {"username": "Martinez Martin", "comment_text": "Wake up super early if you want to get good pictures of the iconic things such as the Trevi fountain, Spanish steps, etc. Book ahead on all the tours and make sure they say \"skip the line\". Make reservations for dinners, the great ones will be full and you can't walk up. Make sure to ask for the dinner bill, they will not bring it unless you ask. Understand that places close and there aren't a ton of places around lunch time. So either fill up in the am and know you won't find much until dinner."}, {"username": "Vicky Fleming", "comment_text": "Bring an umbrella and a warm coat, if you are spending a week total, do walking tours for 3 days in Rome, 2 Florence and 2 Venice. After the week you will decide where to go on your next trip but don’t forget the Amalfi coast. You will love all!"}, {"username": "Sandi Manfredi", "comment_text": "Buy Corinna Cooke - Author\nbooks, all your questions will be answered. Have a great time."}, {"username": "Richard Clancy", "comment_text": "Recommend Verona for a couple of days also."}, {"username": "Cheree Petersen", "comment_text": "U going in winter?"}, {"username": "Shirley Collar Wilson", "comment_text": "We had no trouble nor saw any pickpockets; the weather is about the same as mid US- take the train!!! Eat lots of different pastas, pizzas, daily gelato, tiramisu, and cannolis! Schedule a cooking class and Tuscany wine tour/lunch with wine tastings, take a gondola ride, shop the sidewalk shops: buy leather belts, bags, sandals. Buy hand painted pottery. Walk, walk, walk!b( Buy and take a European plug end adapter-we bought on Amazon with 2 phone chargers."}, {"username": "Kathy Saenz Poppenger", "comment_text": "Do a small group cooking class. You go into a local’s home. Lots of fun to learn to make fresh pasta and tiramisu- then eat it of course! That’s a nice break from the usual running running running .\n\nhttps://\ncesarine.com/\nen?gclid=Cj0KCQj\nwzdOlBhCNARIsAP\nMwjbzZ8pP0fE2r_\nFlUsH2_HoSOxnGc\naCVgo8f6GIGWTFX\nPUkLCn5c4HwoaAn\noTEALw_wcB"}, {"username": "Melissa DiChiara Poirier", "comment_text": "Following"}, {"username": "Dovi Brock", "comment_text": "https://\nyoutube.com/\nplaylist?list=PL\noJq9s1rDVgYVj7o\nScXjPtlCasUfWP8\nfR"}, {"username": "Beth Wedge", "comment_text": "Make sure you go to Florence- a must! LOVED ITALY! Nice people and beautiful!"}, {"username": "Linda Tibbles", "comment_text": "Use a travel agent to help with all the details- it takes the stress out of the equation and will give you confidence."}, {"username": "Chuck Vlkojan", "comment_text": "I wouldn’t recommend going to the Vatican. I went and it was the low point of many things we did there for two days."}, {"username": "Margaret Marsiglio", "comment_text": "Have a wonderful time! Everything will be perfect The Roman Forum, Vatican City. Is something special. Florence City and Venice you will love it all."}, {"username": "Joan Parenti", "comment_text": "Hello. We’re taking a tour in Northern Italy in July 2024. We will be on our own in the Amalfi coast. Sorrento was recommended to me to stay in to visit the other areas around. Any Sorrento hotel or other recommendations\n?\nAlso, we have a free day in Florence/\nTuscany. Any restaurant or other recommendations\n? No children will be with us."}, {"username": "Jonathan Nickens", "comment_text": "1. It’s a different country, so things will be different. 2. No matter what, you can’t do/\nsee it all, so don’t rush and just enjoy it. 3. Be vigilant like you would in any large US city. 4. If you get lost, don’t get frustrated…look at like this: this is a part of town you otherwise wouldn’t have seen, so take it all in. If you’re lost, you’re probably seeing more of the real Italy than if you stayed on the beaten path."}, {"username": "Yvonne Gemma", "comment_text": "Just came back from a week in Venice, and it almost didn't seem like enough time. There is so much to see and do. When I return I will be staying in the Dorsodouro/San Polo area (particularly where they meet). Everywhere is walkable in Venice but these two neighborhoods, in particular, offer so much more IMO (restaurants, shops, museums, etc.) and we found ourselves spending more days there than around the crowded touristy over-priced San Marco area. It also just feels more local and it's cheaper. But on the other end of things don't forget this super charming bookstore - https://\nwww.atlasobscura\n.com/places/\nlibreria-acqua-a\nlta"}, {"username": "Helen Veronica", "comment_text": "I have visited all three, Travel light! If there are things you absolutely want to see pay the extra and book ahead. Rome, certainly the Vatican etc. But Florence WOW - we have just returned. Duomo Cathedral, Uffizi Gallery, and David in the Gallery- definately need to book in advance, we were there in May. We didnt book David and could not get in. Look at a combined ticket for the Duomo, Bell Tower, Uffizi Gallery in Florence, we thought it was really good value"}, {"username": "Eileen Procacci", "comment_text": "Have lots of fun!"}, {"username": "Gabriella Villasenor", "comment_text": "We just stayed at a cute air b n b in Venice that was a great location if your Interested - it just had a lot of stairs so if you have any kind of mobility problems not for you!\nI really enjoyed murano and Burano- take the ferry yourself not a tour because they rush you!"}, {"username": "Tatyana Gourov", "comment_text": "Three cities is too much in one week. You will not really experience Italy that way. Choose one city and allow yourself time to really explore it."}, {"username": "Lyndel Arthur", "comment_text": "Venice is deralict of local Venetians! Mass tourism has driven venetians to other islands and so for beauty it is unique but for local experiences and seeing people living there it us over! People have left and tourists have taken over with cameras and graffiti. The best of unique Venice was 20-50yrs ago. 😢"}, {"username": "Marion McGrath", "comment_text": "Romewise.com and Florencewise.co\nm are so wonderful that you will want every city to have a site that is so good."}, {"username": "Georgia Beth Ridenhour", "comment_text": "Do a culinary and culture tour on day one in each place if possible. You will learn so much about the cities, especially off-the-beaten path spots."}, {"username": "Angela Forshaw", "comment_text": "Pack layers - been to Rome in Nov and was roasted!\nBook ‘hop on hop off’ for Rome to help get your bearings.\nBook walking tours for all three - then decide where you’d like to see more of.\nDon’t overthink it - just enjoy. All fabulous."}, {"username": "Beth Andrews", "comment_text": "Wow! How blessed you are!\nVenice: Doesn’t matter what you do there - it’s ALL amazing. If you have more than a couple of days there take a boat ride over to the island of Marano to see the glass making, then on to the island of Burano which is just exquisite.\nFlorence: must visit the Pont Avechio."}, {"username": "Anneliese Dietrick", "comment_text": "Rome - do the full Colosseum tour including underground where the gladiators and animals were kept. A night tour of it was perfect. The Pantheon, Trevi Fountain, Tour of the Vatican and Sistine Chapel, Tour the Catacombs there are many, go ride bikes through some of the old Appian Way, walk around in Trastevere and eat there. Walk around Campo de’ Fiori and Piazza Navona.\nVenice- take a canal ride even on one of the regular boats, it doesn’t have to be a gondola. Go take a tour of Doge’s Palace the prison and the Bridge of Sighs. Go to Murano to watch the glassblower make something. Also go to Burano to see all of the beautiful colored houses on the canals.\nFlorence - book a trip to the Duomo in advance. It might be free but you still need a ticket in advance. Otherwise they won’t let you go to the top. It’s an unbelievable view of Florence. Well worth it. Take a golf cart tour to the top of piazelle Michaelangelo. I believe it is where he did a lot of his work. Go see the Statue of David and walk the Ponte Vecchio Bridge. The Piazza dell a Signoria was neat to walk around. Great leather if you need anything.\nYou’ll need the most time in Rome."}, {"username": "Patti Berger", "comment_text": "Just returned from 17 days in Italy. Loved it. We were in northern Italy for our son and and wife’s Italian wedding. She’s from Italy. Went to Florence and Venice, also. Advice - get your tickets well in advance for any sights that require them. Florence must sees are Uffizi museum and Academia museum. Venice - St Mark’s cathedral (that I wasn’t able to get tickets for since I didn’t plan ahead). Our apartment was right next to it so we saw the outside, but couldn’t go in. We took a private gondola ride with Luca who told us the history and info on all that we saw. If you look up gondola tours in Venice, you’ll find him. He’s great! We did an hour ride. Venice - get a multi day ticket for the vaporettos (water buses that continually run). You can get on and off at whatever stop you want. We loved getting on one in early evening and just enjoying being on the water and cooling down."}, {"username": "Tina Louise", "comment_text": "Take me lol, have a wonderful time,"}, {"username": "Marco Feola", "comment_text": "Don't drive in Italy they are nuts, don't eat in the tourist places they suck and they have 10,000 new customers a day so they don't care about the quality of their food, talk to the taxi people and ask where they eat. And wear purses with azipper and flap over because the pick pockets gypsies are everywhere. Venice is beautiful and unique but a little boring and they aren't crazy about tourists, time is very fun and awesome but had the most pick pockets so good on to your stuff it's also very touristy so don't be afraid to walk off the beaten path, Florence is my absolute favorite, it is gorgeous I think we've more beautiful then Venice, the architecture is a mix of Roman, medieval, and Renaissance, and it's amazing. Again watch your wallet these are professional picks pockets they will steal your watch while your looking at it and you won't even notice, get a watch that fold clips not that slip clips. Other wise have fun and enjoy the beautiful people and country!"}, {"username": "Mary Evans", "comment_text": "Florence “the David” is a must. How much time in each place?"}, {"username": "DrMarylean Wroten", "comment_text": "Just a tip. They’ll probably be hustlers out there trying to sell you a product. Don’t let them put an item such as a bracelet on your arm saying I’m giving it to you. It’s not for free. That happened to my daughter and I when we were in Rome. They are very persistent. Be firm and say no then, keep moving. Try not to give eye contact as if you’re interested. Nothing to be afraid of that’s everywhere. …. enjoy. Cities are beautiful."}, {"username": "Dena Feraru", "comment_text": "If you plan to visit any churches, be sure to wear clothes past the knee. Uber does not exist. Busses are a plenty but always know 2 bus lines to get back to your rental. We were stranded late in the evening on our way back to our hotel bc there was an accident in one of the roundabouts. The bus driver pulled over and put us all out. The bus ticket was reusable for up to 90 minutes (I believe) from start of original boarding."}, {"username": "Dave Schickling", "comment_text": "Bring only carry on luggage so you can easily move around on public transport. Get money from atms upon arrival. Stay awake until 10 pm your first night despite the temptation to nap. Go off the beaten path rather than all the touristy places. Don’t obsess about safety. These places are likely safer than where you live"}, {"username": "Kelly Lutrick Sanford", "comment_text": "Purchase train tickets in advance with assigned seats!"}, {"username": "Jennifer Patti Voelksen", "comment_text": "My family went in June. My husband and children (age 15 and 11) had never been over seas. Had. Great time. Did a great walking tour in Rome. Highly suggest. And it was free! Email for a reservation and tip the guide accordingly. Rome's free ultimate walking tour. Check it out!"}, {"username": "Gordon Freedman", "comment_text": "Take the hop on/ hop off bus entire route and then home hack to places that interest you."}, {"username": "Emily Rossi-Snook", "comment_text": "Looking for a villa to rent in Tuscany fall of 2024; not in a remote area… for family of 6 adults, 2 children. Preferably in close proximity to a village. I keep coming up empty. Any ideas?"}, {"username": "Lisa D Long", "comment_text": "Pack light\n1 suitcase medium size\nIn a lot of cities you have to handle your own suitcase\nVenice especially tons of bridges there\nup and down it was horrible\nI brought an xlarge and med suitcase it was a struggle\nAlso backpacks are a great idea"}, {"username": "Meghan Hoobler", "comment_text": "Nov will be a great time…less people. Just be smart with the bag you take out with you. Venice: I recommend taking a water taxi from the airport to your hotel (look at Viator for a shared one), just getting lost in all the random streets, eat in places off the beaten path (cheaper and better food), and take a gondola ride that starts in the smaller canals avoiding the grand canal (so much more interesting and pricing is the same for all gondolas, no reservation needed in early Nov). Florence: get a glass of wine during happy hour from the wine window at Babae (closed Mondays), download a walking tour of the city, check out the art in front of the Uffizi museum (go into museum if you like looking at historic art), go to the Boboli gardens at sundown to see the city view, book a ticket to see David at the Acedemia Gallery, take a day tour into Tuscany for a pizza/gelato class or pasta class (Viator) and/or a day tour to Cinque Terre. Rome: Colosseum with underground access and Roman Forum, Vatican museums, have dinner in the Jewish quarter and Trastevere."}, {"username": "Bennett Richards", "comment_text": "We were just in Rome in April. Flew non-Stop from LAX. I HIGHLY recommend ITA ( was Alitalia ) Fantastic experience.\nWe stayed at the Hotel Grand Palatino. Highly recommended. About 3 blocks from the Colosseum and Forum. Great staff, fantastic breakfast. Get a crossbody purse from PacSafe and always carry it in front of you. We carried pacSafe pouches and purses and had no problem. The Palatino is a great location. The street behind the hotel is alive with locals in the evening with pastry shops a pin and restaurants. We will stay there again."}, {"username": "Rhonda Bean Hendershot", "comment_text": "I took my young adult daughter on a 17 day trip through Italy. We used the trains exclusively, stayed in VRBO flats, read Rick Steves' books cover to cover to help create our itinerary, used Viator and Get Your Guide for excellent guided tours and skip-the-line entrances to museums, etc. Have a wonderful time making memories together."}, {"username": "Vanessa Basara", "comment_text": "We stayed here in May 23 in Rome\nAnd Summertime\nIn\nFlorence - plumeguide both were wonderful and walking distance to centres .l"}, {"username": "Reagan Bramston", "comment_text": "Download free Rom2rio app. Enter 2 cities you wish to travel between, this will give you the distance, time, choice of buses, trains, ferries etc. A great tool for planning. Book fast trains in advance, price will be cheaper. Only book trains etc when you have booked airfares, then accommodation. Use youtube to check the places you want to go to.... also choose a smaller city/village to wander around & relax & feel like a local. Try Assisi in Umbria or Siena in Tuscany. Both south of Florence, can visit on way back to Rome. Fly into the north, out of the south or vise a versa."}, {"username": "Kerri Pianalto", "comment_text": "Rome needs more time than Venice and Florence- there is so much to see without spending a lot of money- ie amazing churches and ruins all around. Have the kids do some research to engage them. We did ebike tour in Florence that kids liked. We also spent extra $ on private transportation from airports/\ntrains to hotels (well worth it )-\nStart looking at viator or similar app for excursion ideas\nKeep your eyes on your purse, phones etc- watch YouTube videos on Italy planning- very helpful too🇮🇹🇮🇹"}, {"username": "Johnny J. Turpin", "comment_text": "Burger joint in Levito"}, {"username": "Kerri Pianalto", "comment_text": "Oh and if you do all the planning wrong you will still be in Italy and it will be amazing 🇮🇹🇮🇹🇮🇹"}, {"username": "Debra Zee", "comment_text": "The convent in Rome a great, central, fair price place to stay. Florence as well."}, {"username": "Andrea Dawn Kidd Cook", "comment_text": "Buy Rick Steve's Italy book"}, {"username": "Becky Schnydman Mossing", "comment_text": "Pack light and do bits of laundry in your hotel or wherever you’re staying. We are here now (doing the same three cities) and I have just washed things out in the bathroom and hung them to dry. No need to pay for that service. It is much easier and cheaper. I purchased a Travelon bag to secure belongings and have felt quite safe with my valuables - you can unhook the strap when at restaurants and hook it around the chair so it won’t get grabbed although I have not seen that happen. I live in a large urban area so am hyper aware anyway. We have done tons of tours with The Tour Guy and CityWonders, etc… which have been great and have afforded us the ability to skip lines and see everything really quickly and efficiently."}, {"username": "Nicola Bradley", "comment_text": "Just got back from Florence. Buses and trams are the same ticket, valid for 90 minutes, so you can take 2 journeys plus a coffee stop for 2 euros a time. We used Google maps to find the best routes. Don’t just look at the first option as it may be quicker but involve more walking, not ideal if too hot or rainy."}, {"username": "Nicola Bradley", "comment_text": "We spent very little on sightseeing in Florence. Took a bus to the lookout (Piazzale Michelangelo) then another to the flea market at Santo Spirito (Sundays). From there it’s a short walk to the Ponte Vecchio and another to the Duomo."}, {"username": "Teresa Shea", "comment_text": "Sam Cowie would you please pm me your Airbnb for Rome Florence? Many thanks!"}, {"username": "Sha Mohammed", "comment_text": "The Vatican Trevi fountain Pompeii ."}, {"username": "Andrea Celli Zeitvogel", "comment_text": "Forget big tour groups. In these cuties, book tours with “JustLocals”The\ny are tours given by young adults (20-somethings)\nwho love their city. The tour is just your family. It’s so fun for teens to see and hear it from a cool older “kid”. I took my 19 year old girls and we all loved the guides we had and saw and learned things wd never would have. This is about piquing your teens interest in culture and more travel. They’ll totally love it. Check the website."}, {"username": "Sam Cowie", "comment_text": "Hi All, to everyone that asked for my recommendation for accommodation I will just post here. There were so many requests so hope that is ok.\n\nVenice - we stayed on the island. The Airbnb was beautiful and on the canal. We had to catch a waterbus across to the mainland, which was no problem but it was €9.50 each way. The villa had one double bedroom and 2 singles were in the living room, along with chairs and a table - it worked ok. It was a short walk to a co-op and restaurants. If you want a quiet stay, this is the place. Very clean and host was very helpful. Waterbus also takes you back to the train Termini. Eating was reasonably priced.\n\nCalle delle erbe\nGiudecca, Venice, 30133, Italy\n\nFlorence - we stayed at Plus Florence which is a hostel but we had a private room with 4 single beds and a huge private ensuite. It was about a 10 min walk to the main Termini. The buffet breakfast is cheap. Very close to the markets. A bit of a walk to the pointe vecchio but we stopped along the way for a drink etc. The pool gets busy and very popular with the 20ish year olds but they were no bother. We are a family of 4 and there were other families there.\n\nPlus Florence\nVia Santa Caterina D'Alessandria 15, Florence, 50129, Italy\n\nRome - we stayed in the Vatican area which was not our initial choice but our original accommodation was cancelled on us so we were left with whatever was available on our budget. This apartment is immaculate! 3 double rooms all with ensuites. Great air con. Short walk to the metro which made it very easy to get around. Many restaurants around the area but didn’t offer a great deal if you’re looking to shop. There were markets nearby which offered some cheap clothing. The apartment exceeded our expectations. Host was very easy to deal with.\n\nVatican Townhouse\nViale Giulio Cesare, Vaticano Prati , Rome, 00192, Italy\n\nHope that helps. Let me know if you have any other questions ☺️"}, {"username": "Jazz Caldwell", "comment_text": "Make sure you hire a tour guide if you are going to see the Vatican. We are not big on tours but we were so glad we did that. I don't know if my friend Yuval Lahav is still doing tours but I'm sure you wouldn't be disappointed. He's on FB. Also, make sure you eat gelato EVERYWHERE you go!"}, {"username": "Marla Davison Danis", "comment_text": "Download Rick Steve’s app! We used The Tour Guy for our guided tours In Rome (Vatican and Colosseum)-perf\nect! *** Vatican headsets broke up if you were not close to your guide because obviously the reception in there isn’t the best. Take good water bottles! Italy-Rome especially has free, cold & delicious water everywhere. We scheduled a one on one (small group) tour with Isuf (Airbnb)-he has 10 wonders of Rome tour that’s absolutely amazing! We had 3 days and was able to see so much! We are going to Venice tomorrow 😉 with our 2 teens. Glad it will be November. The heat has been the worse for us. ***good walking shoes and battery packs to charge your phones"}, {"username": "Bill Swift", "comment_text": "Rick Steve’s books and web site give the best practical tips. In my opinion, Frommers and Fodors are good but Rick stands out for giving opinions and good advice on money maters and travel options in country. Read him and you should have a great time. Lots of folks travel using guide books and local or day tours. Trip Advisor app is a good source for local tours."}, {"username": "Axel Ortiz", "comment_text": "Learn a little bit of italian even the bare minimum goes a long way"}, {"username": "Elizabeth Reece", "comment_text": "In Florence do the moped and wine trip! Totally fun way to see countryside"}, {"username": "Patty Hartman", "comment_text": "It sounds, from you itinerary, that you are going with a tour. Heed their advice, as well as whatever you read here."}, {"username": "Tina-Marie Lockyer", "comment_text": "You should definitely start researching. Trains are a challenge if you are new to them in Europe. And definitely attempt the language. They dislike ppl assuming English."}, {"username": "Patti Porter", "comment_text": "It will be different than your hometown and embrace that. Learn at least a few years phrases to show respect. Meals in restaurants are slower on purpose - dining is to be enjoyed, not rushed through. Eat gelato every day - to help get the best…if the pistachio is bright green then they aren’t using fresh ingredients that make it tastier and you don’t want the really fluffy ones. My favorite from any city was in Florence at Vivoli.\nI thought Venice was amazing. 2 days we were in San Marco area and it was great and then delta cancelled our flight home and rebooked us 3 days later and we moved to hotel in dorsoduro area because original hotel full and loved this new area maybe even more - bit less busy, but had great restaurants and shops and churches/\nmuseums to visit without lines….and you can walk over bridge to San Marco. Used water taxi and really enjoyed traveling that way and doing that didn’t feel need do gondola we were going do. Sit toward back of water taxi and open top and ride standing up looking out. Also did water bus which is much cheaper."}, {"username": "Phyllis Furtaw", "comment_text": "Order some travel money belts that go under your pants in front. I never had to worry about anyone stealing my money. Then probably a cross purse goes over the front of you for cellphone and stuff. What they like to do is bump you or cause a commotion which distracts you. I had no problem but was given this advice. But watch the front of the purse. I bought my niece a leather one which would be hard to cut. She told me she was getting a nap sack. I just laughed at her. I said they can use a knife form behind and you’ll never know what happened."}, {"username": "Carlo Nasca", "comment_text": "Good choice for a first visit to Italy. These cities are very well documented so do a search and see what you would like. Eat in Trattorie where Italians eat, cheap and delicious."}, {"username": "Lori Johnson Hilton", "comment_text": "A day trip to Pompeii is a must. Touristy? Of course. Amazing? Yes. And great for teens. My son was 10yo and even he thought it was super cool. They'll probably love an outdoor market shop + day-long cooking class, we did one with Luca outside of Florence last summer - fun for the whole family and so memorable."}, {"username": "Chrystal Stevens Bisonet", "comment_text": "-Florence: Academia (David), Mercato Centrale, Duomo and bell tower, walking food tour of Florence\n-Rome: golf cart tour, pantheon, Trevi fountain, colosseum and Roman forum, st Peter’s and the Vatican museum, cooking class, catacombs, lots of Catholic Churches and artifacts 😉"}, {"username": "Sandra Ferrante-Kohn", "comment_text": "Florence owns my heart. Be sure to purchase (in advance) “skip the line” tickets for places like the Academia (Statue of David) and the Uffizi Museum. Viator is a respectable/\ntrustworthy site for this. You can also purchase a variety of tours through them for all your destinations."}, {"username": "Shirley L Jones", "comment_text": "As you can see by all the comments, there is lots to see, do and be mindful of. All this information can be extremely overwhelming for someone who has never been overseas.\n\nI would advise taking the tips and suggestions with you to a travel professional who can work with you to get the holiday you want, safely booking reputable accommodation, tours, transport etc.\nIf there is a fee then consider it worth it for the time, effort and knowledge they provide and the back up assistance should something change or not go to plan. There will still be plenty that you can plan for yourself, should you choose.\n\nAfter having done it once, you may feel confident to \"go it alone\" in the future."}, {"username": "Lisa Missigman Bianchini", "comment_text": "Our biggest expense was Uber around Rome we had a large group so didn’t wNt to try the busses\nIf you can ride train or bus you will save a ton of money"}, {"username": "Linda Safstrom Humphreys", "comment_text": "If you are eating in Venice, try the restaurants behind the square….the tables in the square are expensive, even for coffee….don’t be fooled when the waiter says please sit you will pay for it"}, {"username": "Holly Jacobs", "comment_text": "Pack light! Carry on and personal is all you'll need. If your hotels do laundry or you are air bnb it use the washer and dryer. Trust me, you will enjoy the trip that much more with out having to lug checked bags on and off trains or the water busses.\n\nBurano is a beautiful island if you have a decent time to spend in Venice. If you'll only be there for two or 3 days maybe just enjoy Venice. If you have longer definitely get to burano.\n\nThe further north in italy you go the more English speaking friendly it becomes. Definitely learn key phrases for rome. It will be very helpful. Don't rely on Google translate cuz it is not always accurate.\n\nBring comfortable shoes and drink all the limoncello!"}, {"username": "Phil Marshall", "comment_text": "Beware of thief’s working in hotels I had money stolen from my room safe key style in Florence"}, {"username": "Michele Arreguy", "comment_text": "Good for you Sam Cowie! Love info as well."}, {"username": "Nancy Sharp Brooks", "comment_text": "Go fewer places, see more, and plan to go back. Trying to do everything in one trip dilutes the experience for me."}, {"username": "Jenny Cuevas", "comment_text": "🙌 Congratulations\n! The trip will be unforgettable. I promise. Now…\n1. Make sure your Iphone battery is in working order. Also, bring portable battery & cord. Days will be long and you’ll want to photograph everything remarkable (to you).\nThere will be plenty.\n2. Make sure you check handmade toys-items-stor\nes. The craftmanship is spectacular, and some will merit both fotos & videos.\nTrust me on this one.\n3. Try to formally open each photography day with a specific location. That way, you’ll remember where you were and the day’s activities.\n4. Check for specifics-Pieta\n, David, Dante Alighieri’s home, Lord Byron’s apt in Venice. Certain references will make context palpable.\n5. Gelato. Lemon is best, but please, don’t leave without proper photos!\n6. Eat. Drink. Have coffee. Enjoy everything, and please, share your photos! 💐"}, {"username": "Andrea Munera Marin", "comment_text": "Hello.… Places to RENT a car for 1 day in Florence?\nRecommendation of trusted companies and locations pls.\nHas anyone rented a car to do the Tuscany tours on their own? Best Towns to go?\nThank you"}, {"username": "Jane Ewers-Verge White", "comment_text": "Take lots of Ana is from home, and their favourite spread so you can take easy sandwiches with you each day. These holidays are expensive and you only want to spend money on the GOOD snacks and meals. Stock up on new favourite snacks when you find grocery stores in your first destination."}, {"username": "Mike Guluk", "comment_text": "Do the free walking tours in each city"}, {"username": "Clare Mcdonald", "comment_text": "It’s a cold month 🥲"}, {"username": "Franchelle Dorn", "comment_text": "Keep your valuables safe. Pickpockets are amazingly enterprising around favored sites. Try to buy tickets to important excursions ahead of time (e.g. Vatican City Basilica and Sistine Chapel, Uffizi Gallery, Doge’s Palace, etc.). You’re going in the off season, so crowds should be thinner, but lines were excruciatingly long this summer.\nVenice is walkable, as is Florence. Transportation is plentiful in Rome.\nEnjoy!!!"}, {"username": "Kathy Bennett Jones", "comment_text": "Trevi fountain is a must see"}, {"username": "Annette Giacona", "comment_text": "Pre-schedule a mass and visitation if you want to see the pope."}, {"username": "Jennifer Mastruserio Groneck", "comment_text": "Venice is really walkable. An under $20 Chorus Pass pp gets you into 10-12 Churches and. The map that comes with it takes from one end to another. Stay somewhere really central and do all things right one day and left the second. End at San Marco every evening. Just walk and get lost. Give yourselves time to explore. We stayed at the Hotel Bel Sito. Reasonable, great breakfast, and central. Wonderful location, service and staff. My husband and I spent a week there in 2022. Used the pass and a tour of St Marks and throughly loved it all. You can do it without breaking the bank. If we saw a great spot we were interested for dinner we wrote it down so we could find our way back. That time of year get out and see things, enjoy the afternoon siesta and then go out for dinner, live like the Italian’s 🇮🇹❤️. I had the advantage of 2 years of no travel to plan. But watch and listen to all the Rick Steve’s videos and talks. They do help, You can do this!"}, {"username": "Vicki Susie Naab Gandolf", "comment_text": "Take some cheap was cloths. They don’t use them there. Enjoy every moment."}, {"username": "Vicki Martyn", "comment_text": "Be careful in Rome, I arrived today had 2 licks on my bag and still got pickpocketed"}, {"username": "Deborah Schroeder", "comment_text": "Get Rick Steves book on Italy."}, {"username": "Diane Leesmith", "comment_text": "Try to eat at restaurants slightly away from main attractions, where locals eat, prices are better too."}, {"username": "Brice Blosser", "comment_text": "Bring good shoes for walking.\nNothing sucks worse the. Sore feet and you still to walk a bunch to get back to your place.\nEveryone has different things they want to see. Look at the area and for what interest you in the area."}, {"username": "Joanna Aceves", "comment_text": "Enjoy ☺️ and one thing I always tell family and friends. Enjoy your day without stressing to go to every location that’s touristic. It can get overwhelming. Enjoy the food, gelato ( even if it’s cold) and their coffee shops ( their cafes and deserts are delicious)."}, {"username": "Cynthia Talone", "comment_text": "Barbara De Luca"}, {"username": "Natalie Stamer", "comment_text": "We went to Rome, Venice and Florence last May. My youngest was 11. I’d recommend booking a tour of the Coliseum, and they have a tour that’s more geared for kids at the Vatican. It was great for all of us! Our favorite activity was a Vespa tour with wine tasting and a meal just outside of Florence. It was the PERFECT day!"}, {"username": "Jon Hotter", "comment_text": "If you have status with hotel, should be able to get upgrade 4 in a room, have them read about cities before, give foundation when seeing in person….plan out days to take advantage for what you want to see with the kids….have two teens too, your kids will love it…have fun"}, {"username": "Maureen Towey", "comment_text": "Learn some simple phrases, questions in Italian. Familiarize yourself with central city maps so you can navigate streets. Skip restaurants that cater to tourists. Layer clothing and wear comfortable shoes."}, {"username": "Audrey Owen", "comment_text": "Do a cooking class! We are a family of 4 with our kids being 21 and 17 and we had so much fun! They really enjoyed it! Cooking classes in Rome Pizza & Pasta School"}, {"username": "Kira Sussemiehl", "comment_text": "Not sure how long you’ll be in Venice but I went there last year for a couple of day with my family. Went with a couple of teenagers and one of the best memories was us doing a Scavenger Hunt. Search on line. We made teams and had a competition. Definitely a fun couple of hours. We still talk/laugh about it! And I believe it was a total of maybe €20 to download."}, {"username": "Mary Marzacco Krzykowski", "comment_text": "You probably will need a coat."}, {"username": "Kris Beacham", "comment_text": "Here are the top three answers to questions we see here.\n\n1. Yes you can plan it without a travel agent. Just figure out the order with the way you want to do things. Check your local airports and the destinations to like up flights (google flights is the best).\nAny activities spend the extra on skip the line.\n\n2. Call your carrier and ask about their international plans. Pretty much all smartphones work anywhere. You just want to understand the billing.\n\n3. Double check your credit cards to make sure they have no foreign transaction fees. If you plan and prepay everything before you leave, you can take one credit card and use that for everything while you’re there. You won’t be worrying about grabbing cash. Or the daily exchange rate. Visa and Mc are ok everywhere, Amex in populated areas, Discover never.\n\nwhat I do is figure out my spending money. (I don’t do air bnb and we eat out every meal, so I budget $250 -300 a day. And I m out the money in my account, I swipe my credit card like crazy, then I pay the bill when I get home."}, {"username": "Trina Molnar", "comment_text": "Get travel insurance, I suggest Allianz."}, {"username": "Lucinda A Barrera", "comment_text": "Water proof shoes or boots. We were there during high tide and the sidewalks were flooded."}, {"username": "Tracy Elizabeth", "comment_text": "Make sure to have Euro coins @ all times!!!! Many public restrooms charge and learned the hard way The ones that were actually manned they would not budge and accept credit card or American money!"}, {"username": "Marcia Levy", "comment_text": "Do some research about what museums etc you want to see\nAnd purchase what you can online to save time\nNovember should be fine though\nCould be rainy and chilly\nBe sure to have clothing for the rain\nI lived in northern Italy and it was foggy and rainy quite a bit\nIn Nobvember"}, {"username": "Debra Fergison Canova", "comment_text": "Depends on exchange rate, I got some Italian money here. At the time I was over there they did not want American money. Watch out for pickpockets and snatch and grab"}, {"username": "Florinda Sigmon Harwood", "comment_text": "Higly suggest Rolling Rome golf cart tours in Rome. Book now! There is also a golf cart company in Florence but not sure of the name. Enjoy!"}, {"username": "Catherine Quinn Mergen", "comment_text": "Get the Rick Steve’s Italy book"}, {"username": "Joni Kennedy", "comment_text": "Check out Rick Steves book!!!"}, {"username": "Tracy Piko Lawniczak", "comment_text": "What do you like to see ? Churches, history , vineyards."}, {"username": "Evelyn Brown", "comment_text": "Traveling with teenagers can be so fun! If your kids are willing, have them look for apps that will help them understand what they are seeing (Rick Steves has an app, for example, or they can check out Atlas Obscura which has rare and sometimes spooky sites listed that other tour books miss). Or they can hit up social media for sites to see and help make a wish list. They can look up restaurants as well."}, {"username": "Vanta Coda", "comment_text": "Do not stand in lines to see building. Buy books of the places you want to see that way you see more"}, {"username": "Toni A Cargola", "comment_text": "Have fun I just got back from Rome in florence. It was just beautiful"}, {"username": "Karen Giacomini", "comment_text": "Be careful traveling by train ,etc. there are scammers that try to lure you pretending to be employees. Do not fall for it. Do not be gullible. Check credentials. Pick pockets also . … Make sure you have your passport, ID money credit cards well protected. Advise your teenagers also. There are also beggars pretending to be crippled, elderly or homeless or have realistic looking baby dolls asking for money. Just like any major city … be aware.. they target foreign visitors ."}, {"username": "Cheryl Williams", "comment_text": "I love planning trips! If I were planning a trip to Italy, here are some of the resources I would use. Hope you have a wonderful trip!\n\nItaly Travel Guide (Rick Steves)\nhttps://\nwww.ricksteves.c\nom/europe/italy\n\nVenice (Earth Trekkers)\nhttps://\nwww.earthtrekker\ns.com/?s=venice\n\nFlorence (Earth Trekkers)\nhttps://\nwww.earthtrekker\ns.com/\n?s=Florence\n\nRome (Earth Trekkers)\nhttps://\nwww.earthtrekker\ns.com/?s=rome\n\nItaly Travel Forum (Rick Steves)\nhttps://\ncommunity.rickst\neves.com/\ntravel-forum/\nitaly\n\nItaly Travel Forum (Tripadvisor)\nhttps://\nwww.tripadvisor.\ncom/\nShowForum-g18776\n8-i20-Italy.htm\nl"}, {"username": "Ro Todisco Weil", "comment_text": "Ty Levine, you have the Islands mixed up ⬆️\nMurano is for Glass blowing & BURANO is for\nLace, beautiful colored houses & very nice people!"}, {"username": "Joy Buenaflor", "comment_text": "Go with no expectations and be wowed by Italy. Your experience, especially first time being there shouldn’t be influenced by others. 😊"}, {"username": "Florence Bunting Joyce", "comment_text": "We did a food tour in Venice. It was amazing. Gondola ride and took the rest of the time walking around and taking in the sights. We did take the boat to Burano. You can make a day of it and do both Murano and Burano."}]}, {"id": "2193447994387612", "text": "Hi! We will be traveling next year with our two children (4&6) and would love recommendations for family friendly hotels (pool is a huge bonus)!\n\nWe will be traveling to:\nRome\nFlorence\nMilan\nPositano\nParis\n\nBudget would be around 650-750 euro / night\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2193447994387612/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Rome https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187791-d2319\n44-Reviews-Rose\n_Garden_Palace-\nRome_Lazio.html"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Florence https://\nwww.anrdoezrs.ne\nt/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187895-d2029\n73-Reviews-Hote\nl_Croce_di_Malt\na-Florence_Tusc\nany.html"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Milan https://\nwww.kqzyfj.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187849-d2758\n01-Reviews-Gran\nd_Visconti_Pala\nce-Milan_Lombar\ndy.html"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Positano https://\nwww.anrdoezrs.ne\nt/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g194863-d7297\n12-Reviews-La_M\naliosa_d_Arienz\no-Positano_Amal\nfi_Coast_Provin\nce_of_Salerno_C\nampania.html"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Paris https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187147-d1035\n0792-Reviews-Ho\ntel_Square_Louv\nois-Paris_Ile_d\ne_France.html"}]}, {"id": "2193454747720270", "text": "Hi I’m travelling to Sicily for 6 days with 4 adults in total. What are the must sees? We will be in Palermo, Taormina and Siracusa and will have a car.\nMany thanks in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2193454747720270/", "likes": 2, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "follow us https://\nnextstop-italy.c\nom/\nvirtual-tours/\nbest-of-sicily/"}, {"username": "Carol Belanger", "comment_text": "Following! We will be in Sicily in October and working on our itinerary as well."}, {"username": "Erica Verde", "comment_text": "Valle dei Templi in Agrigento is a must!"}, {"username": "Miyuki Kanno Paul", "comment_text": "Agrigento is a must!"}, {"username": "Ilaria Verda", "comment_text": "Ortigia"}, {"username": "Lisa Abrams Argento", "comment_text": "Erice."}, {"username": "Rita Garzaniti", "comment_text": "Mount Etna"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Noto, Agrigento and Piazza Armerina!"}]}, {"id": "2193447431054335", "text": "We will be travelling as 2 adults and 1 child (13yrs). Have people found it easy enough to get triple rooms or a portable/rollaway bed? Hoping to avoid having to book 2 rooms :)", "link": "facebook.com/groups/1373361046396315/permalink/2193447431054335/", "likes": 0, "comments": [{"username": "Stacy Derouin", "comment_text": "We had no issues getting triple rooms in any of the places we stayed in Italy-we're a family of 2 adults, one child. Worked perfectly for us!"}]}, {"id": "2193437541055324", "text": "Looking for feedback on car hire through AutoEurope.\n\nWe will be hiring a car for 23 days in September; pick up Milan, drop off Rome. I had originally looked at booking a vehicle directly through AVIS. However, the AutoEurope website is offering the same vehicle, also hired through AVIS, with all the insurances etc. at a price which is over $1,000 AUD cheaper than booking directly throughAVIS.\n\nI am just after some reassurance that I'm not missing something if I went with the cheaper option through AutoEurope. Thanks in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2193437541055324/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.discovercars\n.com/\n?a_aid=NextStop-\nItaly"}, {"username": "Tina TB", "comment_text": "The deductible must be higher and there is an excess to pay on the least expensive option. I researched all of the car rental companies, including Discover cars and autoeurope and the best prices came up with Europcar and drivalia and Avis. ￼ I just came back from Italy rented a car and did the same last year as ￼well. I suggest that you take the superior coverage where are you pay no deductible and no excess in the case that you have an accident or an issue with the car"}, {"username": "Miyuki Kanno Paul", "comment_text": "Consider leasing a car since you’ll be renting for over 3 weeks"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2193421807723564", "text": "Hi all, question for the group. We are traveling to Italy May of 2024. We have our flights and accommodations booked. We are 4 nights Sorrento, 4 nights Rome, 2 nights Siena, 5 nights Florence, and 2 nights Venice before traveling on.\n\nThe question is how far ahead should I look at booking tours specifically the private ones we may want along the Amalfi Coast and Wine Tasting in Tuscany? What about private transfers?\n\nLooking forward to your thoughts\nThanks!", "link": "facebook.com/groups/1373361046396315/permalink/2193421807723564/", "likes": 0, "comments": []}, {"id": "2193413844391027", "text": "Hello, I’m planning on visiting Italy for a month and renting a place at one location (probably in Rome but open for suggestions). I will be working and then visiting places in the evening or on the weekend. Do you think it’s best to rent from airbnb or are there options to do one month short term rental in an apartment? I’m open for any advice. Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2193413844391027/", "likes": 1, "comments": [{"username": "Ilaria Verda", "comment_text": "I live in Pavia that is close to Milan. Since this is an university city it's easy to find accommodation for short period. There are so many beautiful places just 1 hour far from Milan, that 1 month is not enough.. Bergamo Como Mantova Pavia itself, the mountains in Valtellina, in 1.5 h you are in Genoa..."}]}, {"id": "2193114031087675", "text": "What do American citizens need to do to be able to drive in Italy? Thinking about renting a car in Siena and enjoy the beautiful countryside. Travelling in November. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2193114031087675/", "likes": 4, "comments": [{"username": "Stella Dee", "comment_text": "You need a valid driver’s license from your country. The international permit is only a translation of your license. The international permit is needed if, say, a police officer stops you and cannot read the language your license was issued in. The international drivers permit does not replace your license."}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.discovercars\n.com/\n?a_aid=NextStop-\nItaly."}, {"username": "Marie Cuzzi", "comment_text": "If you have AAA they can help you"}, {"username": "Allan Olexa", "comment_text": "City driving is chaotic with little or no parking...don't\n. Rural driving is easy. Get an international drivers license, watch routes for tolls, and beware of hidden camera speed traps."}, {"username": "Mary Agozzino Derrick", "comment_text": "Italian driver's may seem chaotic, but I can tell you they're very very alert ....(something missing in many North American drivers from my personal experience!... we've driven from the Swiss border down to the most southern tip of Sicily and quite honestly I can say, we never saw an accident...I'm sure they happen but we never saw one"}, {"username": "Mary Agozzino Derrick", "comment_text": "Oh and beware of road scams where someone will say you damaged their car and want money from you, that did happen to us, but the evidence proved otherwise what they said happened couldn't have left our car untouched"}, {"username": "Kandace York", "comment_text": "In 2022, we got IDLs from AAA as non-members for $20 per license. It was fast and easy.\n\nI’d still REALLY study a country’s traffic laws, though, especially signage, symbols and vocab. I thought I did, but when we got there I wished I’d done even more."}, {"username": "Suzanne Mills", "comment_text": "Hire a driver or train"}, {"username": "Lucio Pontecorvo", "comment_text": "your driver s license, that is it"}, {"username": "Tracy Wrinn Mcdermott", "comment_text": "International drivers license at AAA for $20. We were asked for it the last time we rented overseas. Bring your US drivers license too. It’s always better to have too much documentation For $20 it’s worth it."}, {"username": "Renae Larcus", "comment_text": "Just get an international license. $20 at any AAA office"}, {"username": "Matthew Livio Conti", "comment_text": "You probably won’t NEED an IDL to rent a car, or if you get stopped by police (which I did, twice - they laughed at the IDL) but you should get one in case of accident."}, {"username": "Cynthia Marie", "comment_text": "You just need to show them your US license. We’ve rented a car twice with Hertz. Get the extra insurance, it is definitely a must! The roads are like driving at the bumper car park. No rules, just suggestions. Have a great trip!"}, {"username": "Marco Brambilla", "comment_text": "It’s called Siena and they just need to apply for an international driving permit"}, {"username": "Jan Fargo", "comment_text": "You need to be crazy to drive in Italy, roads are narrow winding and twisting, traffic is awful and you better know how to read road signs in Italian because there are roads you aren't allowed to go on and if you do accidently you will receive a large fine Un the mail maybe months later. Good luck"}, {"username": "Marti Krauss", "comment_text": "Have great courage"}, {"username": "Glenn Todd Webb", "comment_text": "A state license, an IDP, and a credit card."}, {"username": "Renee Rundle Stoneham", "comment_text": "International driver license.\nGo to AAA it’s about $25.\nRental Car company will ask for it when you pick up the car.\n\nI’m sure it’s stated in the fine print on the agency’s contract."}, {"username": "Felicia LoCascio Whitney", "comment_text": "Sienna is busy busy busy with limited parking. Tuscany is an absolutely incredible ride. Think of Under the Tuscan sun beautiful!"}, {"username": "Larry M Murray", "comment_text": "You need to be able to drive a stick shift or pay double the money."}, {"username": "Keith Crossley", "comment_text": "I have a collection of IDLs. Never asked for. But I'll get another for my trip to Italy. Bureaucracies love a challenge to their authority."}]}, {"id": "2193407121058366", "text": "We’ll be in Sicily and Pompeii so can go up Etna and/or Vesuvius. Any recommendations on which one is best or should we do both?? TIA 😊😊", "link": "facebook.com/groups/1373361046396315/permalink/2193407121058366/", "likes": 0, "comments": [{"username": "Miyuki Kanno Paul", "comment_text": "These two volcanoes are completely different. We climbed both. In fact, we visited Pompeii one year and took an overnight ferry to Palermo the next day, picked up a rental car, ended up going to Monte Etna 2 weeks later. Etna is HUGE. Driving extremely winding road up to Piazzale Rifugio Sapienza was very scenic with all the previous lava flows and destroyed buildings.\nIn contrast, Monte Vesuvio is a very iconic one. Always visible from anywhere in Napoli. Easily accessible from both Herculaneum(Erc\nolano) Pompeii. In fact, we did Vesuvio and Herculaneum in one day.\nI cannot say which one is better than the other. Both active volcanoes are equally beautiful and dangerous. We appreciate both because we’ve done both. If you want to see much more of geothermal activity in greater Campania region, Campi Flegrei’s Solfatara in Pozzuoli is a great example."}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "both!"}]}, {"id": "2193405087725236", "text": "Hi to all\nQuestion about plane flight , lately is there a lot of delays .we will be going to Italy late September early October started hotel reservation without free Cancellations . So if my plane is delayed or quite late or even next day , I must pay just the same .\nThanks in advance for comments", "link": "facebook.com/groups/1373361046396315/permalink/2193405087725236/", "likes": 0, "comments": []}, {"id": "2193397317726013", "text": "Just starting to plan for a June 2024 trip to Amalfi and possibly Spain. Have already found the group posts so helpful, thank you.\n\nIs there a boat option from Amalfi (anywhere around there) to the Spanish coastline? Have driven thru the south of France in the past, so was hoping to make this connection by boat this time.\n\nHaven’t locked in specific destinations yet, as this may be driven by travel connections.\n\nThanks in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2193397317726013/", "likes": 0, "comments": []}, {"id": "2193394891059589", "text": "In need of transportation from Naples airport to Castellammare di Stabia which is a little before Sorrento. Although the cheaper route would be to take the train and such, we are looking for a private driver as we have a couple of elderly people traveling with us. I would prefer to load and unload just once.\nPlease give me suggestions as to who you have used…. There will he 4 of us.\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2193394891059589/", "likes": 0, "comments": [{"username": "Sandy Radican Shikaly", "comment_text": "Amalfi Coast Transfers are great!"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.anrdoezrs.ne\nt/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FAttraction_\nReview-g187780-\nd12919816-Revie\nws-Amalfi_Coast\n_Transfers-Amal\nfi_Amalfi_Coast\n_Province_of_Sa\nlerno_Campania.\nhtml"}, {"username": "Gina Spyker Fairfield", "comment_text": "We used Autoservizi De Martino and were very happy with their service."}, {"username": "Barbara Brosnan", "comment_text": "We used Joe Bananas (with a local pizza stop) and they were fab"}, {"username": "Glenn Todd Webb", "comment_text": "Easy Car Tour Naples"}, {"username": "Mary Anne", "comment_text": "Guemar travel. Stunning service, perfect gentleman driver, gorgeous vehicle (not a van - very roomy Mercedes SUV)"}, {"username": "Marcia Slivka", "comment_text": "Amalfidrive4you\n. Excellent service."}, {"username": "Cettina Milioto", "comment_text": "Taxi Carmine tour Amalfi Coast ♥️"}]}, {"id": "2193393737726371", "text": "Heya, I went to book colosseum tickets 1 month in advance on the official website. I’ve been checking every second day for them to come available and I just checked and the whole first week of august is gone already and unavailable haha 🫠\n\nDoes anyone know if we rock up very early when they open they have tickets available? 🙂", "link": "facebook.com/groups/1373361046396315/permalink/2193393737726371/", "likes": 1, "comments": []}, {"id": "2193391377726607", "text": "Has anyone recently stayed at Hotel Marcantonio in Rome. What are your thoughts ? Or personal experiences you’ve had ? Is there a/c most importantly? Lol thanks in advance !", "link": "facebook.com/groups/1373361046396315/permalink/2193391377726607/", "likes": 0, "comments": []}, {"id": "2193383094394102", "text": "Any one in Capri that could share the departure time for latest ferries to Naples? Thank you in advance", "link": "facebook.com/groups/1373361046396315/permalink/2193383094394102/", "likes": 0, "comments": []}, {"id": "2193381371060941", "text": "Planning a 3 week trip end of September-early October. Had thought in through Venice, home through Rome with a week in Sorrento early October. But I heard ferries may not run in October… Capri, Amalfi??? If so maybe We need to start in the South rather thN North ?", "link": "facebook.com/groups/1373361046396315/permalink/2193381371060941/", "likes": 0, "comments": []}, {"id": "2193379027727842", "text": "What is the average cost of a taxi transfer from Naples train station to Amalfi? We can’t seem to find anything under about 170 euros one way. Or is it better to get a taxi ad hoc outside Naples train station? It seems really problematic to go from Naples to Amalfi without it seeming like a nightmare. We will have luggage as we are away for 8 weeks.", "link": "facebook.com/groups/1373361046396315/permalink/2193379027727842/", "likes": 5, "comments": [{"username": "Tracy Wrinn Mcdermott", "comment_text": "Ferry?"}, {"username": "Carmela Siniscalchi Frattellone", "comment_text": "My hotel arranged a car service and it was 100 euro from the Naples train station to Sorrento."}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Naples/\nTransfers-from-t\no-airport/\nd508-242701P1?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "Elie Loummer", "comment_text": "There should be a ferry which I highly recommend!"}, {"username": "Miyuki Kanno Paul", "comment_text": "Taxi to Molobeverello and take a ferry to Amalfi. Easy peasy"}, {"username": "Richard Rodriguez", "comment_text": "May as well set in your mind that’s 200e each way. You won’t fit in a small car with that much luggage."}, {"username": "Rosie Castro Ferrufino", "comment_text": "Emma Cropper I just booked pintour shuttle from naples airport to maiori and paid 20euros for each of us plus 2 euros per piece of luggage!!"}, {"username": "Simone Pfenninger", "comment_text": "I paied 150 Euro beginning of June 2023 for taking the scenic route incl. Fotostops with Noemi from Positan Tourismo"}, {"username": "Mary Anne", "comment_text": "We found Guemar Travel to be a great price, and a fabulous service. Very responsive to emails."}, {"username": "Emily Niland", "comment_text": "I found it cheaper to grab a taxi at the airport. Anything I tried to book was double the price."}, {"username": "Shana Woodfield", "comment_text": "Some people go to Amalfi via Salerno. That might be easier and cheaper."}, {"username": "Kim Sousa Andrews", "comment_text": "Our Airbnb host set up a private driver and it was only $130 for a roomie van with air-conditionin\ng. It was a great experience and the views were amazing."}, {"username": "Nakitha Badon", "comment_text": "We paid $170. The drive is long so they aren’t charging you unreasonable."}, {"username": "Frank Hunt", "comment_text": "Train to Sorrento then bus or ferry to Amalfi."}, {"username": "Petra Keen", "comment_text": "We paid 150 euros from Naples train station to Amalfi. This was a month ago, we used Amalfi coast transfers"}, {"username": "Melissa McCormick", "comment_text": "We paid 170$ from sorrento to Naples airport for 7 in a private taxi which was very nice and way bigger then we needed. It was a nice no hassle even though a bit pricey."}, {"username": "Pong Ac Ai", "comment_text": "2 experience this is from Napoli centrale to Napoli porto"}, {"username": "Pong Ac Ai", "comment_text": "To porto 25 euro going back 40 you couldn’t tell"}, {"username": "Victoria Marchetti", "comment_text": "I rented a car right down the street of the Naples train station 70 a day credit card 60 a day cash. Once I saw how much it was to taxi I rented the car instead."}, {"username": "Kateryna Fedyushkina", "comment_text": "Uber is better,book in advance. Otherwise ask your hotel in Amalfi to do that. They should not let you pay more than 200."}, {"username": "Paul Anderson", "comment_text": "170$ is cheap"}, {"username": "Robin Burrell", "comment_text": "If you just have a carryon you can taxi to the ferry port and take that to Amalfi. You can also walk to the port. If you have more private transport is what you’ll have to do."}, {"username": "Jillian Maxwell Novay", "comment_text": "I paid 180 euros for Naples to Positano. Very easy, door to door and worth the money ."}, {"username": "Shannon Merkel", "comment_text": "Our hotel set up a private driver. 150 one way. Seems like the going rate. An hour drive so I think it's worth it"}, {"username": "Cynthia McDonald", "comment_text": "I’d do a ferry from Naples to Amalfi."}, {"username": "Andrea Bainbridge", "comment_text": "We used Amalfi Limousine Service twice. They were wonderful and worth the €150. Saved so much time!\n\nwww.amalfilimou\nsinecarservice.\ncom"}, {"username": "Jenny Payne", "comment_text": "Not cheap , the only way I go is by train to Sorrento then bus to Amalfi. Take ad little as possible it’s hard with lots of luggage , crossbody bag , backpack and hand luggage works a dream for me , doing it for years 🌻"}, {"username": "Rachael Richardson", "comment_text": "Ferry or train"}, {"username": "Giuseppe Placi", "comment_text": "Transferelax should be cheaper"}, {"username": "Kimberly Lynne", "comment_text": "A pre booked private transfer is expensive. My eyes almost popped out of the socket. We were 4 people with luggage and looking back I have zero regrets. Having a dedicated driver, a comfortable ride, and experienced was priceless. During our stay we used taxi, bus, ferry. Made us appreciate our private transfer even more! If you can swing it, book it."}, {"username": "Jeff McLellan", "comment_text": "We are paying €220 for the four of us in a luxury van (wanted space). Hire a proper car service and it is not a nightmare. Just expect traffic and relax and enjoy the scenery."}, {"username": "Leigh Baguley", "comment_text": "Ferry, much better than being cooped up in a car"}, {"username": "Sandy Radican Shikaly", "comment_text": "Fixed rate with private driver will be much better than a taxi"}, {"username": "Bethany Rudy", "comment_text": "We hired a driver from Naples to Sorrento for 150 euros"}, {"username": "Colleen Jennings", "comment_text": "Try suntransfers - excellent company used them several times in Italy. Very reliable."}]}, {"id": "2193370877728657", "text": "Visiting next June, 6 days Tuscany to visit around the towns, 6 days la spezia to visit coastal towns, 3 days Florence. any recommendations on places to stay, things to do would be greatly appreciated!!! Can’t wait!!", "link": "facebook.com/groups/1373361046396315/permalink/2193370877728657/", "likes": 0, "comments": []}, {"id": "2193364551062623", "text": "Can someone tell me the best way to get around in Florence, Venice, Rome and the Almafi coast. If you have a hard time walking? Scooter? Wheelchair?", "link": "facebook.com/groups/1373361046396315/permalink/2193364551062623/", "likes": 0, "comments": []}, {"id": "2193362237729521", "text": "Hey everyone we arrive in Italy next Sunday and we are going to Sardinia for a week staying on the North Coast and just wondered if anyone has recommendations for day trips as we have a rental car", "link": "facebook.com/groups/1373361046396315/permalink/2193362237729521/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Sardinia/\nSailboat-daily-c\nruise-between-N\north-Sardinia-M\naddalena-Archip\nelago-and-South\n-Corsica/\nd24293-28557P24?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}, {"username": "Linda Boardman", "comment_text": "We were there for 4 days. The beaches were so spectacular we did nothing else. Beached in the morning. Lunch was inside in the air conditioning as it’s so hot and then beach again late afternoon. They were, only in my opinion, the best."}]}, {"id": "2193356734396738", "text": "Best places to stay and visit in Sicily? We have a week.", "link": "facebook.com/groups/1373361046396315/permalink/2193356734396738/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "follow us https://\nnextstop-italy.c\nom/\nvirtual-tours/\nbest-of-sicily/"}, {"username": "Johan Dengis", "comment_text": "One week is just enough for Palermo, Monreale, Mondello and maybe Cefalu or Erice"}, {"username": "Janeen Dabb", "comment_text": "Cefalu"}, {"username": "Maria Davi", "comment_text": "Love, love, love Castellammare del Golfo. Beautiful Beaches, antiquities, great restaurants."}]}, {"id": "2193344317731313", "text": "Going to near Mestre, venice in September, 2 adults, for the 1st time...\n\nHas anyone any advice/tips on do's/donts, where to go & not, prices, offers, what to definitely not miss, also some decently priced canal restaurants for a beautiful evening meal...\n\nAlso can I ask, as we arrive on a late flight in to the airport, what's the best 'type' of transport around 10ish pm ...\n\nThank you so so much x", "link": "facebook.com/groups/1373361046396315/permalink/2193344317731313/", "likes": 0, "comments": []}, {"id": "2193344271064651", "text": "Looking for a driver/ tour to take family of probably 4 from Naples train station to Ravello and want to stop at Pompeii.. would love someone to give tour at Pompeii. Mid September. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2193344271064651/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Naples/\nTransfer-from-Na\nples-to-Ravello\n-or-reverse-via\n-Pompeii-2hr/\nd508-137436P25?p\nid=P00070587&mc\nid=42383&medium\n=link&medium_ve\nrsion=selector"}, {"username": "Sandy Radican Shikaly", "comment_text": "Amalfi Coast Transfers"}]}, {"id": "2193342521064826", "text": "Coming in late February starting in Rome then Florence, Venice and Milan want to go to Switzerland since it’s right there by Milan …my dilemma do we just do day trips over to Lugano from Milan or just stay in Lugano ? Want to do the Bernini red train too … suggestions please", "link": "facebook.com/groups/1373361046396315/permalink/2193342521064826/", "likes": 0, "comments": [{"username": "Lisa Abrams Argento", "comment_text": "The red train was nice but I do have to say I was little disappointed with it. If it was me I would just go spend the time in Switzerland, it is amazing."}]}, {"id": "2193338627731882", "text": "Doing COO for the first time. Will I be able to take a personal item, my small carry-on, and wear a cross body when boarding the plane or is it necessary to pack the Crossbody?", "link": "facebook.com/groups/1373361046396315/permalink/2193338627731882/", "likes": 0, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2193327587732986", "text": "Hi all! Learning a lot from this group! Flights and hotels in Italy are already booked, we will be staying in Rome, Florence and Naples.\nWe will buy tickets for the major attractions like the Vatican, Uffizi gallery, Pisa etc and were planning on doing day trips to Capri, Pompeii, towns in Amalfi Coast from Naples. Also planning on walking, takingआणखी trains or buses wherever we can.\nHowever, I would appreciate if anyone can recommend cheaper/affordable tours for the day trips from Naples (while still being safe)?\nAlso if any recommendations for restaurants or hole in the wall sandwich shops in any of the above cities which are cheaper? I’m sure all food in Italy tastes great 🙂\nWe will spend where we have to but also don’t mind just walking around and soaking in the culture and happy just relaxing/being in Italy for the first time. We booked tickets well in advance and now Inflation is hitting hard!", "link": "facebook.com/groups/1373361046396315/permalink/2193327587732986/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "look here https://\nwww.viator.com/\ntours/Naples/\nSorrento-and-Ama\nlfi-Coast-Indep\nendent-Day-Trip\n-from-Naples/\nd508-2958AMGROUP\n?pid=P00070587&\nmcid=42383&medi\num=link&medium_\nversion=selecto\nr"}, {"username": "Zita Lynch", "comment_text": "Any ratings in Devour and Walks tours for the Vatican?"}, {"username": "Donna Prampero", "comment_text": "We booked Vatican tours thru Viator. Fabulous!!"}, {"username": "Mary Anne", "comment_text": "Procida by ferry from Naples. Perfect day out. Pompeii by local bus or train."}]}, {"id": "2193323281066750", "text": "I am planning a trip to Florence in November, possibly staying a month. I think for an extended period of time it might be best to rent an apartment. I normally book hotels directly on the hotel website,आणखी what is the best place to book an apartment? When I looked on booking.com for hotels, I saw they also had apartments you can book. Does anyone have experience using booking.com for apartment rentals?", "link": "facebook.com/groups/1373361046396315/permalink/2193323281066750/", "likes": 0, "comments": []}, {"id": "2192884404443971", "text": "Hi please help me choose which accommodation in Rome\nHas anyone stayed in these accommodations?\n\n1- Antica Residenza Del corso\n. Its a guest house with reception from 9/10- 4\n- clean\n- have to book triple room to get two beds , all the reviews say small room very small shower\n- great admin / reception\n- close to places of interest but not closeआणखी to Termini / train station\n- non smoking rooms\nApparently you have to walk up a flight of stairs , get the lift to 4th floor then walk downstairs to 3rd floor where rooms are\n- pretty looking room with good reviews of 8.6/10\n\n2- Hotel virgilio\n\n- two single beds\n- reviews say ugraded renovated rooms which i can get is clean , tiled with reasonable size bathroom\n- 24 hr reception\n- also central and close to Termini (not next to)\n- not as pretty in the photos\n- doesn’t have non smoking rooms\n- reviews of 8.4/10\n😬😬😬", "link": "facebook.com/groups/1373361046396315/permalink/2192884404443971/", "likes": 0, "comments": [{"username": "Leslie BC", "comment_text": "Choose which one YOU want."}, {"username": "Wendy Naddeo", "comment_text": "I wouldn't want to be close the the train station,its a bit rough around there."}]}, {"id": "2193294921069586", "text": "Hi all,\n\nI will be traveling to Peschiera del garda on the 4th of August, and I will be staying 1 night. Then, I am going to Sirmione for two days. For those who have been to Peschiera del garda, how is it? Is it worth it or should I stay 3 days in Sirmione? What do you guys think?", "link": "facebook.com/groups/1373361046396315/permalink/2193294921069586/", "likes": 0, "comments": [{"username": "Ruth Akutu Maccarthy", "comment_text": "You'll love both!!!! Peschiera is one of my favourite cities on Garda lake"}, {"username": "Pietro Adami", "comment_text": "If you want to treat yourself to a nice fish dinner look for the La Locanda di Noris restaurant.\nYou will need a car / taxi to get there from Sirmione or Peschiera"}]}, {"id": "2193303401068738", "text": "PSA. Rome Termini Metro stop is a hotspot for pick pockets. They target travelers who just arrived via train to take the metro as well as anyone who looks like tourist. We encountered pick pockets twice in 2 days at the same station. First time was lucky that nothing was taken but second time they took some cash from a crossbody bag. Both times with young girls with sweater or coats on their hands as cover.", "link": "facebook.com/groups/1373361046396315/permalink/2193303401068738/", "likes": 1, "comments": []}, {"id": "2192590467806698", "text": "If you want to avoid big crowds of the famous cities like Rome, Milan, Venice....this is my hometown Bergamo! 50 km from Milan.\nMedieval city on a hill, crowned by walls and full of history and breathtaking views.\nAlso the food is spectacular and really really good! 😉 you're welcome!", "link": "facebook.com/groups/1373361046396315/permalink/2192590467806698/", "likes": 507, "comments": [{"username": "Hannah Bonham", "comment_text": "Julie Jones"}, {"username": "Paweł Falkowski", "comment_text": "November'22 👌🇮🇹🇵🇱"}, {"username": "Carol Henry", "comment_text": "I was in Merone in February, beautiful area!!"}, {"username": "Diane Vertin", "comment_text": "Love Bergamo! My family lives in Seveso!"}, {"username": "Phyllis Jesiolowski", "comment_text": "Thank you 🙏🏻"}, {"username": "Tam Tam", "comment_text": "Serena Mascheretti is this too far for a day trip from Turin?"}, {"username": "Kikka Yim", "comment_text": "My hometown 🥰"}, {"username": "Ana Belen Ayard", "comment_text": "Looks amazing 💕"}, {"username": "Krasen Kris", "comment_text": "My first visit in Italy was Bergamo and then we fall in love with Italy"}, {"username": "Leora Abraham", "comment_text": "Thank you have put on the itinerary"}, {"username": "Julia Muller", "comment_text": "We spent 4 days there about 6-7 years ago and absolutely LOVED Bergamo 💕🇮🇹"}, {"username": "Nana Tirolese", "comment_text": "We really enjoyed our day in your lovely city! My hubby had some fantastic gelato there and says it was his favourite. 😉"}, {"username": "Nana Tirolese", "comment_text": "Nana Tirolese"}, {"username": "Vivienne Hayle", "comment_text": "Bergamo is one of my fave places in Italy!"}, {"username": "Monique Biesot", "comment_text": "What a great pictures i am defenedly comming to your Home Town once"}, {"username": "Ann Hannaway", "comment_text": "I lived in Città Alta for 2 years"}, {"username": "John Hansen", "comment_text": "Was there a couple weeks ago - wonderful churches, fabulous ambiance and really good food!"}, {"username": "Jennifer Smith Tanouye", "comment_text": "We will be there for 4 days in October. Very much looking forward to seeing the town and surrounding area."}, {"username": "Laura Negroni", "comment_text": "Simply love it!!! ❤️"}, {"username": "Kimberly Wagenfuehr Wells", "comment_text": "Beautiful. My husband went there last year and loved it."}, {"username": "Kylie Gillis", "comment_text": "beautiful!"}, {"username": "Karyn McCluskey", "comment_text": "Wow! Amazing! I’ve just been there it is beautiful ."}, {"username": "Belinda Dale", "comment_text": "Hoping to visit here in October ❤️"}, {"username": "Victor Viquez Arias", "comment_text": "Pao Mora"}, {"username": "Seamus Durkan", "comment_text": "We were there in march for 4 days loved Bergamo wld Def visit again"}, {"username": "Zarine Batli", "comment_text": "We’ve been there and loved it"}, {"username": "Carolyn Campbell", "comment_text": "I was just there. Spent 3 nights there. I loved it"}, {"username": "Sajani Ramphal", "comment_text": "Absolutely gorgeous!!! Was blessed to visit Bergamo with my husband!❤️ We took the train from Milan."}, {"username": "Guy Blackburn", "comment_text": "Liesel Wett"}, {"username": "Elsa Mercado Humphries", "comment_text": "Serena Mascheretti - Yes, we are traveling there! Are you familiar with these recs for hotel, restaurant? Also is Uber or taxi available?\n\nGombitHotel?\nRelais San Vigilio al Castello?\nCasual Ristorante Enrico Bartolini?\n\nAlso best transportation from MXP to Bergamo?"}, {"username": "Anita Clayton", "comment_text": "We visited a couple of weeks ago when staying in Milan. Lovely especially Alto, I stayed there a few years ago."}, {"username": "Anita Clayton", "comment_text": "Anita Clayton"}, {"username": "Isabelle Maillé", "comment_text": "Magnifique"}, {"username": "Paul Vincent", "comment_text": "The traditional tourists cities (venice/Milan/\nFlorence/\nRome) and coastal areas like Amalfi are rightly lauded as \"must see\" ..however, personally too often the crowds (and tourists prices) are off putting....there's a wealth of alternatives to explore and different \"hidden gems\" to discover..findi\nng them is half the fun !"}, {"username": "Luna Driessen", "comment_text": "Stefan van Rattingen"}, {"username": "Jillian Wilson", "comment_text": "Absolutely gorgeous!!!\nLooks spectacular"}, {"username": "Michelle Myers", "comment_text": "We stayed there for 2 nights last year as part of our Italian road trip, stayed in a beautiful apartment with a little balcony looking over the mountains. Will definitely go back, lovely place and had some lovely meals there. Only hard thing was parking the car 😱😂"}, {"username": "Michelle Myers", "comment_text": "Michelle Myers"}, {"username": "Michelle Myers", "comment_text": "Michelle Myers"}, {"username": "Michelle Myers", "comment_text": "Michelle Myers"}, {"username": "Michelle Myers", "comment_text": "Michelle Myers"}, {"username": "Michelle Myers", "comment_text": "Michelle Myers"}, {"username": "Judith Pishnery", "comment_text": "I love the small towns 🥰"}, {"username": "Carey Elizabeth", "comment_text": "My family and ancestors are from Bergamo! I am so excited to see these pictures! I haven’t been there yet, but I can’t wait to make it there one day! My family name is Frosio."}, {"username": "Sue Farrell", "comment_text": "Have stayed in Bergamo four times. We fell in love with it on our first visit. 🎶🇮🇹❤️"}, {"username": "Lorraine Bradley", "comment_text": "Heading there on1st October. Looking forward to seeing it Serena😍"}, {"username": "Theresa Caruthers Ansbaugh", "comment_text": "Absolutely amazing"}, {"username": "Rachael Richardson", "comment_text": "I’ve been to bergamot it’s stunning , the walls and the flowers were stunning"}, {"username": "Tim Edkins", "comment_text": "Tim Edkins"}, {"username": "Heather Bonetti", "comment_text": "Beautiful!"}, {"username": "Adriana Sormani", "comment_text": "Don’t tell anyone! Lol"}, {"username": "Sarah Emerson Nelson", "comment_text": "Loved Bergamo!"}, {"username": "Di Howard", "comment_text": "Thanks for the insight!"}, {"username": "Anna-Maria Orodan", "comment_text": "My favourite city! 😍"}, {"username": "Donna Hinton", "comment_text": "Spectacular! Lucky you!!"}, {"username": "Anna-Maria Orodan", "comment_text": "Anna-Maria Orodan"}, {"username": "Geraldine Attard", "comment_text": "On my bucket list 🥰"}, {"username": "Krissy DaRusso", "comment_text": "Can arrive by train? Looks gorgeous!"}, {"username": "Lea Singson", "comment_text": "What’s the nearest airport?"}, {"username": "Susan Paz", "comment_text": "Nice camera."}, {"username": "Marie Cuzzi", "comment_text": "♥️♥️♥️♥️"}, {"username": "Lyn Evans", "comment_text": "Planning a daytrip from Varenna.. any must visits there?"}]}, {"id": "2193278507737894", "text": "Hello, in the early stages of planning an April 2024 trip to Italy for 2 adults. First time. Staying 10 -12 days. Looking to stay out of high tourist areas. Would like to do possibly a cooking class and maybe see one or two sights. But really just want a beautiful area to relax and eat good food. Don't want to be rushed. Plan on coming back again. Suggestions on towns/villages please. Would like stay maybe 3 different places. Also suggestions on easily accessible sights. This group is a wealth of great ideas! Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2193278507737894/", "likes": 1, "comments": [{"username": "Jennette Riches", "comment_text": "Will you have a rental car or not? Many small out of the way places have very limited public transportation.\nIf you stay on the coast then the train service is far better, but you will find there are more people there for that very reason. Cefalu is high tourist, but still has charm, history, culture, great food, and is conveniently on the mail train line for the north coast. Giardini Naxos on the east coast is the same situation. Lots of cooking classes offered on Airbnb's 'experiences' section."}, {"username": "Loredana Polichetti", "comment_text": "Torino, Mantova, Parma.\nIn these city you are out of tourist area.\nFood, art and relax"}]}, {"id": "2192994004433011", "text": "Best way to get from Venice airport to Rome? Is it worth it to just get a shuttle transfer direct to Venice then take train to Rome Termini?\n\nWe are thinking of also stopping to Pompeii and hiking vesuvius on our way from Rome to Positano. We would have just a back pack for luggage… is there a place to store luggage at these sites?", "link": "facebook.com/groups/1373361046396315/permalink/2192994004433011/", "likes": 1, "comments": []}, {"id": "2193273697738375", "text": "We are flying from Australia with Emirates and 3 kids. I was wondering if anyone knows if I am best to purchase the kids their own headphones for the inflight entertainment or do they provide kids headphones?", "link": "facebook.com/groups/1373361046396315/permalink/2193273697738375/", "likes": 0, "comments": [{"username": "Todd N Nicole Clarke", "comment_text": "They do provide headphones but if you can get some cheaper noise cancelling headphones they work better just make sure you have the airplane adapter"}]}, {"id": "2193273014405110", "text": "Looking for suggestions on car rental, pickup in Rome and drop off in Florence ?", "link": "facebook.com/groups/1373361046396315/permalink/2193273014405110/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "look here https://\nwww.discovercars\n.com/\n?a_aid=NextStop-\nItaly"}, {"username": "Enrico Lecce", "comment_text": "Sixt rental would be a great suggestion to accommodate your driving needs thru Italy 🇮🇹"}, {"username": "Enrico Lecce", "comment_text": "Enrico Lecce"}]}, {"id": "2193269151072163", "text": "We are a family of 4 (two teens) in the early stages if planning a trip the last week in March to Tuscany. The main point of this trip is to see the Ferrari museum with my 16 year old son. I’m thinking Tuscany as a base? I’d like to stay at a scenic, countryside, possibly luxury hotel. I’m interested in bike tours, Florence, Siena, maybe Pisa. Thinking 4-7 nights? Debating on adding 3 nights in Venice?\nAny advice would be appreciated!\nWe just returned from Rome, Sorrento, Amalfi Coast and the only cure is to plan another trip! 🩵", "link": "facebook.com/groups/1373361046396315/permalink/2193269151072163/", "likes": 0, "comments": []}, {"id": "2193272354405176", "text": "Can anyone recommend what day trips are do-able from Florence (by train preferably and ok if long day trips)", "link": "facebook.com/groups/1373361046396315/permalink/2193272354405176/", "likes": 1, "comments": [{"username": "Jojo Hanna", "comment_text": "Rome - 90 minutes by super fast train ! €50 return."}, {"username": "Belinda Frankham", "comment_text": "Hiya Kirsty White Brien\nSiena and Lucca are definitely worth a visit"}]}, {"id": "2193267804405631", "text": "After some advice if possible please, I'm surprising my partner for his 50th this year and bringing him to Italy (his favorite place but I've never been) we're staying at the delle fiere in Lombardy has anyone stayed here? Also does anyone have any recommendations of what to do/see in milan we're only there for 2 days and I believe its about a 45 min journey from our hotel so trying to be organised (he's normally the organiser lol) also is public transport easy enough to use been advised against hiring a car lol TIA 😊", "link": "facebook.com/groups/1373361046396315/permalink/2193267804405631/", "likes": 0, "comments": []}, {"id": "2193264221072656", "text": "Anyone recommend places to stay in Milan? There will be 4 women.", "link": "facebook.com/groups/1373361046396315/permalink/2193264221072656/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "look here https://\nwww.jdoqocy.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187849-d7363\n249-Reviews-Hot\nel_The_Square_M\nilano_Duomo-Mil\nan_Lombardy.htm\nl"}]}, {"id": "2193263264406085", "text": "Planning a kind of last minute trip to\nItaly.... from NY!\n\nAnywhere for a family of 5 (2 adults and 3 kids) along Almafi with a pool?\n\nOr do you think lake como better suited for a family?\n\nThanks so much. Looking to go end of august over LDW!", "link": "facebook.com/groups/1373361046396315/permalink/2193263264406085/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.kqzyfj.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g194863-d1803\n476-Reviews-Lux\nury_Villas_Posi\ntano-Positano_A\nmalfi_Coast_Pro\nvince_of_Salern\no_Campania.html"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.kqzyfj.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g635617-d6540\n830-Reviews-Res\nidence_Zelzar-V\nietri_sul_Mare_\nAmalfi_Coast_Pr\novince_of_Saler\nno_Campania.htm\nl"}]}, {"id": "2193261614406250", "text": "Hi 👋 from Australia 🇦🇺\nfirst time travelling to Italy\n\nHoping for help with information to get from\nMilan to Turin .\n\nWe arrive on Tuesday at lunchtime , so I guess after clearing customs it will be after 3 pm when we leave the airport\n\nTaxi cost from Airport to train station ?\n\nWhich train is best ?\n\nAnd / or\n\ncost book a private car transfer direct from airport to Turin ?\n\nI’d like to get to Turin as quickly as possible.\n\nThank you 🙏", "link": "facebook.com/groups/1373361046396315/permalink/2193261614406250/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "look here https://\nwww.viator.com/\ntours/Ferno/\nArrival-Private-\nTransfer-Milan-\nMalpensa-MXP-to\n-Turin-City-by-\nBusiness-Car/\nd50509-40381P536\n?pid=P00070587&\nmcid=42383&medi\num=link&medium_\nversion=selecto\nr"}, {"username": "Ruth Akutu Maccarthy", "comment_text": "The quickest way is by train. There is a train from Malpensa airport to Milan train station ( Malpensa Express). From there you take the fast train straight to Torino. There are two types of trains from Milano make sure you book on the site trenitalia.it or italo.it the fast one, if you book early you'll get very good prices.\nOr from Malpensa airport you can take the bus to Torino"}]}, {"id": "2193260527739692", "text": "Flying into Milan in late February/early March. Visiting Florence and Rome. What kind of clothing/ coats should be pack?", "link": "facebook.com/groups/1373361046396315/permalink/2193260527739692/", "likes": 0, "comments": [{"username": "Shana Woodfield", "comment_text": "I would go prepared for cold weather. Hat, gloves, sweater, coat (maybe some sort of raincoat), leggings and long pants."}]}, {"id": "2193253861073692", "text": "Where do most of you book your airline tickets to Italy? Favorite travel services/agents used?", "link": "facebook.com/groups/1373361046396315/permalink/2193253861073692/", "likes": 0, "comments": []}, {"id": "2193253244407087", "text": "Any hotel recommendations for Rome close to Vatican in October? Will be there for one brief day so want to get a lot in. We won't have a car so want to be where we can walk to things.\nThanks!!", "link": "facebook.com/groups/1373361046396315/permalink/2193253244407087/", "likes": 2, "comments": [{"username": "Sandy Radican Shikaly", "comment_text": "I would stay in the city center near the Spanish Steps, Pantheon, Trevi Fountain and Colosseum.. all walkable. The Vatican is all by itself on the far west side of the city.. you can take a bus, taxi or the Metro close to it."}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "look here https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187791-d6349\n43-Reviews-Hote\nl_Indigo_Rome_S\nt_George_an_IHG\n_Hotel-Rome_Laz\nio.html"}, {"username": "Alice Dzimiera", "comment_text": "If you only have one day I would pick a hotel more central within walking distance of other sites...by the Pantheon or Piazza Navona"}]}, {"id": "2193250214407390", "text": "Any recommendations for Private transfer from Naples to Praiano? For 6 people. What are the prices?", "link": "facebook.com/groups/1373361046396315/permalink/2193250214407390/", "likes": 0, "comments": [{"username": "S Christian Everett", "comment_text": "We used a private driver named Giovanni. New Mercedes van. Safe and courteous\n\n+39 331 213 7249"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "look here https://\nwww.viator.com/\ntours/Naples/\nTransfer-from-Na\nples-to-Positan\no-with-Stop-Pom\npeii-2h-and-rev\nerse/\nd508-213278P27?p\nid=P00070587&mc\nid=42383&medium\n=link&medium_ve\nrsion=selector"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2193248971074181", "text": "Travelling in September 2024. I'm looking at accommodations for Venice, Florence, Siena (rural villa preferred) Sorrento, Positano (or similar) and Rome.\n\nSeveral are saying no availability. Am I just looking too soon? I want to be ready to book shortly after we can book our air travel in October.", "link": "facebook.com/groups/1373361046396315/permalink/2193248971074181/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Rome https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187791-d6349\n43-Reviews-Hote\nl_Indigo_Rome_S\nt_George_an_IHG\n_Hotel-Rome_Laz\nio.html"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Florence. https://\nwww.jdoqocy.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187895-d1770\n3706-Reviews-Ho\ntel_Calimala-Fl\norence_Tuscany.\nhtml"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Venice https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187870-d1080\n4768-Reviews-Pa\nlazzo_Venart_Lu\nxury_Hotel-Veni\nce_Veneto.html"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Positano https://\nwww.dpbolvw.net/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g194863-d2029\n02-Reviews-Posi\ntano_Art_Hotel_\nPasitea-Positan\no_Amalfi_Coast_\nProvince_of_Sal\nerno_Campania.h\ntml"}, {"username": "Gina Spyker Fairfield", "comment_text": "You may be too soon. Many hotels don’t book further than one year out."}, {"username": "Meredith Williams", "comment_text": "probably booking too soon! you can email the hotels to find out when booking opens!"}, {"username": "Colleen Jennings", "comment_text": "Too early to book. Many hotels, like airlines, don’t put out their prices so far in advance. You could check out your hotel choices now on Tripadvisor to narrow down your choices.\n\nWe’ve stayed in Oltrano in Florence - across the Ponto Vecchio in a quiet district yet 10 mins to the duomo/ufizzi etc."}, {"username": "Carmela Siniscalchi Frattellone", "comment_text": "We stayed at Hotel Machiavelli in Florence. Not far from train and close to central market. 15 minute walk to ponte vecchio. Sorrento we stayed at La Badia. Quiet hotel with pool and beautiful views."}, {"username": "Mitzi Dewhurst", "comment_text": "I have also been trying to book for 2024. Sometimes we have found you can book direct on hotel page rather than an alternative website"}]}, {"id": "2193236447742100", "text": "Hi everyone, I have a question. I am in Flornce now I need to make a shopping Any suggestion\n\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2193236447742100/", "likes": 0, "comments": []}, {"id": "2193229801076098", "text": "We are visiting in late September staying possibility in CASALSERUGO, we are looking at an apartment/villa , is this a good central place to visit other areas 😊", "link": "facebook.com/groups/1373361046396315/permalink/2193229801076098/", "likes": 0, "comments": []}, {"id": "2193228754409536", "text": "Does anyone know B&B Hotel Roma Tuscolana San Giovanna, if this is a good recommendation", "link": "facebook.com/groups/1373361046396315/permalink/2193228754409536/", "likes": 1, "comments": []}, {"id": "2193224927743252", "text": "Any recommended Airbnb's for Rome? Actually specifically the Trastevere area.", "link": "facebook.com/groups/1373361046396315/permalink/2193224927743252/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.dpbolvw.net/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187791-d2453\n683-Reviews-Tra\nstevere_Colors-\nRome_Lazio.html"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.jdoqocy.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187791-d1311\n8678-Reviews-Pa\nlazzo_Baj_in_Tr\nastevere-Rome_L\nazio.html"}]}, {"id": "2193790524353359", "text": "Curious if anyone flying Swiss Air recently knows if they offer free gate check for carry on bags? I know domestically a lot of airlines offer it to open up space.", "link": "facebook.com/groups/1373361046396315/permalink/2193790524353359/", "likes": 0, "comments": []}, {"id": "2193792054353206", "text": "Any suggestions for great restaurants for dinner and not all seafood in Monopoli? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2193792054353206/", "likes": 0, "comments": []}, {"id": "2193777301021348", "text": "Bonjour à tous\nEn août, nous avons l’intention de faire un tour d’Italie en camping-car. Notre trajet sera le suivant :\nGêne\nPise\nFlorence\nBologne\nPadoue\nVenise\nVérone\nBrescia\nBergame\nCômeआणखी\nPouvez-vous m’indiquer des airs de camping-car ou des campings sympas, s’il y en a, dans ces différentes villes ?\nUn grand merci à tous 😊", "link": "facebook.com/groups/1373361046396315/permalink/2193777301021348/", "likes": 1, "comments": []}, {"id": "2185828208482924", "text": "A little bit of heaven in Sorrento! 🍋\nThe view is unreal, the Grand hotel Sorrento has a wonderful terrace to enjoy the best sunsets and a beautiful panoramic swimming pool overlooking the Mediterranean coast,… आणखी surrounded by palm and eucalyptus trees 😍 simply a dream!\nDiscover more: https://www.anrdoezrs.net/click-100692842-11552042?url=https%3A%2F%2Fwww.tripadvisor.com%2FHotel_Review-g187782-d279184-Reviews-or20-Grand_Hotel_Riviera-Sorrento_Province_of_Naples_Campania.html%23REVIEWS", "link": "facebook.com/groups/1373361046396315/permalink/2185828208482924/", "likes": 9, "comments": []}, {"id": "2193773751021703", "text": "Where is good to travel to in Italy around February? It’s my 22nd birthday 2 days after Valentine’s Day so it will be a special trip. I have just got back from Rome with my partner celebrating our three year anniversary? Also what is typical weather in February?\n\nPfa of me and my love ❤️", "link": "facebook.com/groups/1373361046396315/permalink/2193773751021703/", "likes": 56, "comments": [{"username": "Francoise Coupal", "comment_text": "Google"}, {"username": "Francesca Russo", "comment_text": "January and February are the coldest months here in Italy. Usually in winter there are about 0°/4°C but it depends on where in Italy (Sicily for example is about 8°/9°C.\n\nYou could visit a romantic location such as Verona (Romeo and Juliet city), Venezia or the Eternal Rome.\n\nIf you already went to Rome, I suggest Verona."}, {"username": "Carolina Alejandro Clabaugh", "comment_text": "For warmer weather I’d say south of Italy. Sicilia is beautiful."}, {"username": "Nicola Algerino", "comment_text": "Beh a Febbraio fa freddo, media gradi: 3 le minime 10 gradi le massime . Poi nel nord Italia e più freddo nel sud meno . Mete preferite Torino , Milano , Padova , Bologna, Firenze, Napoli ."}, {"username": "Sally Ann Tanasi", "comment_text": "Great picture ❤️ It’s cold in February but not crowded"}, {"username": "Fleur de Liz", "comment_text": "Maybe Venice just in time for the Carnival in Feb.."}, {"username": "Chiara Campagna", "comment_text": "In february Verona and casa di Romeo e Giulietta"}, {"username": "Colleen Jennings", "comment_text": "Avoid Venice as it’s Carnival time then & the prices are hiked up.\n\nMy husbands birthday is in February - we’ve done Bologna, Parma & Verona (different trips) - all absolutely fab! Just took a padded coat - all the bars have heaters outside in the evenings. And in all cities we took in home football matches as we love continental matches! Something different to talk about back home (England)."}, {"username": "Pietro Di Sorbo", "comment_text": "It depends of how many days you would spend in Italy.\nAnyway if you have few days 5/7, Venice and Florence.\nIn February in Italy is winter so is cold, cloudy and quiet often it rains too."}, {"username": "Heather Slinger Mulqueen", "comment_text": "I went to the the Amalfj coast on the 2nd March this year. It was chilly but not cold we did have a couple of warm ish days. We stayed in Positano and used the local bus service to visit other towns. It was beautiful and not busy. Only a few restaurants were open."}, {"username": "Michelle Kaitlyn", "comment_text": "Following 😊"}, {"username": "Wolly Valentina Losi", "comment_text": "Fa molto freddo al nord, potresti andare sulle Alpi a sciare ed alloggiare in una baita."}, {"username": "Alessandro Battxi", "comment_text": "In February, I took my wife for her birthday in Emilia Romagna in Brisighella and agriturismo in Faenza trerè. You can also discover the north which is amazing as well"}, {"username": "Karen Schmidt", "comment_text": "We ran into a local in Florence when we were there, and he said his favourite month was February. He said he would go into the Uffizi gallery and sit in front of some of his favourite paintings, and he’d be the only one in the whole entire room. I think it would be glorious to travel in February. ￼"}, {"username": "Laura Piccinini", "comment_text": "For that time of the year in Italy Will be :\nNorth ,cold and rainy or foggy\nCenter , cold and sometimes Sunny\nSouth , less cold maybe around 10°C\n\nFor that season if you like mountains I suggest Dolomites, there Will be alot of snow, it's magic. You can try to skii too!"}]}, {"id": "2193537777711967", "text": "Best place to buy leather jacket in Italy?", "link": "facebook.com/groups/1373361046396315/permalink/2193537777711967/", "likes": 11, "comments": [{"username": "Fei Dadulla Miranda", "comment_text": "Any where particular in Florence?"}, {"username": "Lisa Long", "comment_text": "I got mine in Florence"}, {"username": "Jill Wolder", "comment_text": "i saw a beautiful jacket in fendi."}, {"username": "Sandy Radican Shikaly", "comment_text": "Leather school in Florence"}, {"username": "Cesar Salvador", "comment_text": "You know ..... I saw a lot of ITALIAN leather things being sold....... but I never saw one cow!!! 🤔🤔🤔🤔🤔"}, {"username": "Berndt Weihs", "comment_text": "Padova,the city of teather!"}, {"username": "Patricia Capuccio", "comment_text": "Florence"}, {"username": "Carol Ann Santasieri Palmer", "comment_text": "Toro in Florence"}, {"username": "Nana Kutateladze", "comment_text": "When you’re walking from Florence train station towards the Duomo there is raw of leather shops."}, {"username": "Joanne Youngman", "comment_text": "Florence"}, {"username": "Enza Magliaro", "comment_text": "Naples"}, {"username": "Victoria Marchetti", "comment_text": "Florence. Leather get way more expensive the farther from Florence you go."}, {"username": "Dee Banks", "comment_text": "Florence"}, {"username": "Tony Indorato", "comment_text": "Jimmys in Florence"}, {"username": "Kathy Hegenbarth", "comment_text": "Why"}, {"username": "Rabun Wiley Neves", "comment_text": "Leather school in Florence"}, {"username": "Maxine Righi", "comment_text": "Florence"}, {"username": "Tina Nguyen-Collins", "comment_text": "Florence"}, {"username": "Clint Madsen", "comment_text": "FLORENCE!❤️"}, {"username": "Frank Hunt", "comment_text": "Choose carefully, the Italians tell me the leather market is flooded with dodgy imported crap."}, {"username": "Philip Michael Gerber", "comment_text": "Go to the market place in the piazza and look behind the stalls, as they hide the entrances to the genuine leather shops. I purchased a \"Buffalo Hide\" 3/4 jacket at one of these leather shops. P S. Don't forget to bargain the price down with the attendant, as they will always quote a high price when asked \"how much ?\" 😀"}, {"username": "Dimity Betar", "comment_text": "Don’t think they are selling them at the moment 😂😎"}, {"username": "Marcia Kellogg", "comment_text": "Florence"}, {"username": "Vikram Sandhu", "comment_text": "Noventa di piave outlet designer All the brands are here. 👍👍👍👍🎊🇮🇹🇮🇹🇮🇹"}, {"username": "Jon Owens", "comment_text": "This post made me hot, just thinking about it! Lol"}, {"username": "Yana Jarman", "comment_text": "Florence! David 2!"}, {"username": "Denise Rocha", "comment_text": "Florence we bought two back in 2015 like butter so soft. And they put your initials in the lining."}, {"username": "Victoria Lindell Donahue", "comment_text": "Florence"}, {"username": "Bill Elias", "comment_text": "I’ve bought several leather jackets of various styles at Casini. It’s between the Ponte Vecchio and the Pitti Palace.\n\nhttps://\nmaps.app.goo.gl/\nEv2AENdYvxuwLK9t\n9?g_st=ic"}, {"username": "Karen O'Connor", "comment_text": "Jimmy’s leather near San Lorenzo market.\n\nDo not go to Alberto Aldani, 2 doors down from Jimmy’s. (Towards the market)\n\nAlberto promises the world and delivers nothing. He is a creep and a thief. Was shut down for 2 years by the government for not paying taxes on products he was promising to ship, that never arrived. Somehow he swindled both customer and government until they caught up with him. You will never get your money back from him. We tried as we were in Florence every year (apart from covid). He denies and he lies.\n\nJimmy’s leather is great. Many other places are great, just not Alberto!"}, {"username": "Jason Craven", "comment_text": "Florence hands down"}, {"username": "Stephanie Smith", "comment_text": "Florence\nDavid 2 Leather Factory"}, {"username": "John Ioannou", "comment_text": "Florence of course."}, {"username": "Ken Lerch", "comment_text": "Florence"}, {"username": "François Martel", "comment_text": "No hesitation, Firenze is your place."}, {"username": "Caryn Goode", "comment_text": "Florence."}, {"username": "Sara Gilardi", "comment_text": "Combipel (not necessarily the best, but good quality and you can find it in many Italian cities)"}]}, {"id": "2193549481044130", "text": "We have 5 days in Sicily. What are the must do/see spots? Already have a tour of Mt Etna booked. Thanks 😊", "link": "facebook.com/groups/1373361046396315/permalink/2193549481044130/", "likes": 1, "comments": [{"username": "Jenn Ds", "comment_text": "We did a boat tour to Isola Bella and the blue grotto. Got to swim, tour by boat and Prosecco and sweets post swim. Wonderful!"}, {"username": "Elaine Jefford", "comment_text": "Depends what you like doing and if you are staying only near Etna or going all round island. If staying around Etna I would say visit Taormina, Syracusa and Ortigia and Catania. If also going across to the other side of the island Palermo, Cefalu, Trapani and Scopello are all with a visit, with only 5 days though I would say just concentrate on the east of the island"}]}, {"id": "2193556321043446", "text": "Update: We paid online € 25 and went to TIM, the guy was not helpful and said he doesn't know anything about this offer and asked us to pay € 13 for SIM 😡😡😡 we called the call center, they have nothing to do\n\nI am trying to buy TIM offer online, it costs €15 including SIM, but when I confirmed they requested another €10 😒😒....", "link": "facebook.com/groups/1373361046396315/permalink/2193556321043446/", "likes": 0, "comments": [{"username": "Jaime Cleek", "comment_text": "Maybe it’s an activation fee"}]}, {"id": "2193557581043320", "text": "What town is the display photo does anybody know???", "link": "facebook.com/groups/1373361046396315/permalink/2193557581043320/", "likes": 1, "comments": [{"username": "Ettore de Vita", "comment_text": "Positano"}]}, {"id": "2193572434375168", "text": "Hi. I’m just wondering if anyone has hired a car to travel around Italy instead of using public transport? How did you find it? Cost wise and cost wise compared to public transport. Did you find it gave you more time?", "link": "facebook.com/groups/1373361046396315/permalink/2193572434375168/", "likes": 9, "comments": [{"username": "Màrtainn Bond", "comment_text": "We did! No regrets. We saw things that people in public transport can't see. For example we went at Verrazzano winnery in toscane there is no bus to get there and if so you can not stop the bus to take pictures.We hired from Naples then give it back in Venise. For us it was the best option (we have a teenager with us)."}, {"username": "Paul Anderson", "comment_text": "We do it every year. We do a buy back car in Paris then travel as we like. It gets you away from the crowds. Several times this year we have been told we were the only Americans who ever stayed there. You get your own custom tour."}, {"username": "Vicki Sandiford Floyd", "comment_text": "We go to Italy every year and rent a car. We love the flexibility. We don’t drive in Rome or Florence."}, {"username": "Jennifer Larese Taylor", "comment_text": "We always hire a car. I don’t know about time, but it does give you more flexibility. We have rarely had any difficulties"}, {"username": "Roland Trego", "comment_text": "A car is necessary to adequately see Tuscany, Le Marche, and Puglia. It is useful in Sicily, too, to see many villages. (Just avoid larger towns and cities!) For the Amalfi Coast, Sorrento, Naples, Rome, Florence, Milan, and Venice, you not only don't need a car, but having one will also be a giant hassle. Messenger me if you want more of my notes on driving in Tuscany and on the Amalfi Coast."}, {"username": "Pamela Cartagena", "comment_text": "We did this last week it was a last minute decision two days before arriving in Rome as we heard of the strikes and our Hotel was outside the city. We paid €150 for 6 days with Goldcar. We got to see so much more of Rome, we drove to Ostia beach twice, the military base, went to see the historical site Ostia Antica, we brought our sons to the water park Hydromania, we drove around Rome late at night just to see it all lit up, the air con in the car was such a relief after hours of walking in the sun. Get a small car easier to park and there's free parking on Sundays."}, {"username": "Robin Pflueger Domenico", "comment_text": "Take the bus, they are easy but watch your wallets."}, {"username": "Doug Burke", "comment_text": "We've been to Italy four times and have had a car for all or part of the trip in each one. Worked fine. We like to get out in the \"boonies\" where there's no other tourists and get a flavor of the \"real\" Italy and the car allows us to do that."}, {"username": "Frank Hunt", "comment_text": "Car hire give you freedom to travel anywhere anytime, prices are reasonable but you need to test the market for best price."}, {"username": "Ruth Akutu Maccarthy", "comment_text": "I prefer to hire a car or have my own car. I've more freedom and with Google maps I can get anywhere. Definitely more expensive that public transport ( rental, insurance, highway toll, gas) but I prefer it ( no time limits, can change plans last minute, air condition).\nYou get it at the airport and drop it at the airport. I did the same in other countries too.\nIf you can get a hybrid ( doesn't need to be charged)car you'll spend less on gas"}, {"username": "Suz Wilson", "comment_text": "Can anyone recommend a private driver from Rome airport to the Salerno area?"}, {"username": "Debbie Horton Rough", "comment_text": "Is there a preferred rental company in Italy ?"}, {"username": "Renee Rundle Stoneham", "comment_text": "We rent outside of the cities. It’s easy and yes, so much more flexibility and get to see places that are out of the way.\nTuscany to me a car is a must have! So many smaller towns don’t have train stations etc and the Val de Orcia is just beautiful to drive through!\n\nWe take the train to a smaller city and rent there. From Rome we rented in Orvieto and it was great, easy etc!"}, {"username": "Heidi Stokes", "comment_text": "I have driven all over Italy and Iove it. So much free time and getting lost you find some of the best places. We drove to Pisa and then Lucca and on the way was this fabulous pasticceria with so many beautiful cakes, pastries and Gelato. We visited the amazing hilltop village of Todi. Places we would have never found without a car."}, {"username": "Barbara Bastianini", "comment_text": "We’ve driven the length and breadth of Italy more times than I can count. honestly it’s our preferred way to travel. The trains are fine for going from big city to big city but if you’re interested in going from small town to small town the car is far superior. It’s also great for spontaneity and flexibility. If you see something interesting along the way you can stop to visit it.\n\nCost wise. That depends on a lot of things. First the total cost of train travel is multiplied by the number of people in your group because each person will have to buy a ticket. But with car travel the total cost will be divided by the number of people so the per person transportation cost can be less. With 2, 3 or 4 people we’ve often found the car to be less expensive. For one person the train is usually cheaper. You pretty much have to price each trip out both ways to determine which is in your financial\nInterest. Last, renting from the airport tends to be more expensive than renting from a downtown location. And because certain train routes cost more than others your specific itinerary and destinations make generalizations\ndifficult. You have a lot of things to price out!!\n\nThe trick is to accurately calculate the actual total cost. With a car you have to include the cost of the rental itself, insurance, gas, tolls, and parking fees. With the train you have to include the cost of a taxi between your lodging & the train station every time you arrive and leave a location. Those are the total costs to compare before making a decision.\n\nWhen renting be aware that most European rental cars are manuals. If you require an automatic the price will increase and you’ll have to reserve well in advance because the supply is limited. Also be aware that returning the car to a different location than where you picked it up will increase your cost, sometimes significantly.\n\nLots of people will try to discourage you from driving. Yes it can be a challenge at times and the Italians generally drive aggressively. If you yourself are afraid to drive there that would be a good reason not to. But I wouldn’t let the fears of others convince me not to drive. Most of us have enough fears to worry about without borrowing those of others. I’d suggest you talk to people who have actually driven in Italy rather than people who haven’t.\n\nResearch the Limited transportation zones and know the road sign for that. Those are zones in cities that only locals can drive\nIn. (This is to lessen traffic congestion, to allow pedestrians to safely use the streets and sidewalks and to prevent car exhaust from harming ancient buildings.) license plate numbers belonging to each zone are registered. Cameras are set up at intersections to take photos of cars entering the zones. Those entering with license plates not registered will be fined. The camera takes great photos of both the plate and the driver so it’s hard to dispute the fine. The zones are always marked and always marked in such a way that you can make a turn to avoid entering the xone. The problem is many tourists don’t see the signs or are too nervous about driving to turn. Some poor souls drive in and out of limited zones multiple times and are fined for each and every infraction. It takes a while for the driver to be traced through the license plate and the car rental agency so the driver might not receive notice of the fine until months after the trip. And the amount can be significant depending on how many times a zone was entered. So it’s important to Google that sign so you’ll recognize it.\n\nOtherwise big city driving is pretty much like big city driving everywhere else. Country roads are country roads everywhere and highways are highways . But small villages laid out before the invention of cars were designed for walkers. They might take a bit of getting used to.\n\nBut truthfully self driving can be a very rewarding way to explore Italy."}]}, {"id": "2193579831041095", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2193579831041095/", "likes": 65, "comments": [{"username": "Frank Waegeman", "comment_text": "Talking whit there hands"}, {"username": "MarkandJu Johnson", "comment_text": "Drive up your ass"}, {"username": "Charles Jones", "comment_text": "Eat dinner for like 5 hours!"}, {"username": "Саша Савино", "comment_text": "🤌🤌 🇮🇹 🤌🤌"}, {"username": "Rachel Michelle", "comment_text": "Mind their own business"}, {"username": "Leonardo Solorzano", "comment_text": "Defend all the game ⚽️"}, {"username": "Carolina Alejandro Clabaugh", "comment_text": "Always dress nice."}, {"username": "Giovanni Locatelli", "comment_text": "Live well."}, {"username": "Mary Whitler", "comment_text": "Drink aperol spritz in place of iced tea"}, {"username": "Gerry Hamilton", "comment_text": "No pineapple on pizza"}, {"username": "Rip Lonergan", "comment_text": "Live, laugh and love"}, {"username": "Carina Chesson", "comment_text": "Have a Nana Nap 😴 mid afternoon 👍🏻👍🏻👍🏻"}, {"username": "Linda Jane Richardson", "comment_text": "Have long meals with family, dressed in their best and don’t get drunk"}, {"username": "Ulla Liukkonen", "comment_text": "🤌🏻🤌🏻🤌🏻"}, {"username": "Kate Farrell", "comment_text": "Always very well groomed, especially the young men! The aftershave they wear is always gorgeous too!"}, {"username": "Tremayne Mushayahama", "comment_text": "Passionate about food. They don't tolerate nonsense i.e. drinking coffee with pasta 😂. Asking salt for pizza, pineapples on pizza. Wait for everyone to be served before starting to eat etc"}, {"username": "Gail Marino Peace", "comment_text": "Eat salad at end of meal"}, {"username": "Anca Emilia", "comment_text": "Enjoy Life !"}, {"username": "Lina Kaltaniene", "comment_text": "Pasta dish before your main dish, which could be another pasta ❤️"}, {"username": "Maria Villanueva", "comment_text": "Have pasta every Sun., and drink wine!🍝🍷🇮🇹😁"}, {"username": "Kevin Bates", "comment_text": "Looking like they're having an argument when it's just a conversation!"}, {"username": "Joe Laricchia", "comment_text": "Are passionate in whatever they do"}, {"username": "Theano Anny Toumba", "comment_text": "Gesti con la mano"}, {"username": "Christopher Walsh", "comment_text": "Overeat"}, {"username": "Raul Cantella", "comment_text": "Avoid afternoon capuccinos"}, {"username": "Nicoletta Costantini", "comment_text": "Care for “la bella figura”, which is not only to look well or good"}, {"username": "Martin L. Epperly", "comment_text": "Eat well always"}, {"username": "Alessia Zito", "comment_text": "We don't talk, we scream\nHave coffee when we wake up, and after every meal for digest (not during the meal)\nDo the “aperitivo”\nSmoke a lot (european thing)\nDress well to go everywhere, you will never see an Italian in pajamas or slippers in a supermarket\nFor us dinner out is an event, we stay in the restaurant for hours\nWe also make the \"scarpetta\" when we finish eating our plate of pasta, we take pieces of bread and dip them in the sauce, ragù or whatever condiment is left on the plate\nTalking with our hands and other milions things.."}]}, {"id": "2193583897707355", "text": "Printed Italo tickets from Florence to Naples: validation required or no?", "link": "facebook.com/groups/1373361046396315/permalink/2193583897707355/", "likes": 0, "comments": [{"username": "Tricia Lanieri Forchetti", "comment_text": "No, you’re good! I printed ours, too, but just showed the code from my phone."}, {"username": "Loredana Polichetti", "comment_text": "No"}, {"username": "Sandy Radican Shikaly", "comment_text": "No validation"}]}, {"id": "2193585481040530", "text": "Dolomite", "link": "facebook.com/groups/1373361046396315/permalink/2193585481040530/", "likes": 7, "comments": []}, {"id": "2193589437706801", "text": "Hi all,\nthe Ferry from Naples to Sorrento does it have a baggage allowance or does it need to be purchased ? thanks :)", "link": "facebook.com/groups/1373361046396315/permalink/2193589437706801/", "likes": 0, "comments": [{"username": "Sigrid Cormier", "comment_text": "I’d search the question on your ferries website."}, {"username": "Janine Emma Lucas", "comment_text": "It will ask you passengers, luggage , vehicle etc"}]}, {"id": "2193599957705749", "text": "Last minute suggestions welcome for best place to eat in down town Sorrento. Tried O Parruchio Favorito it was metsa Mets. Had a sandwich from A’Marenna which was amazing. Tonight’s our last night here looking for authentic doesn’t need to be fancy meal.", "link": "facebook.com/groups/1373361046396315/permalink/2193599957705749/", "likes": 0, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2193602984372113", "text": "Advice please, docking in Rome after cruise, and going by train to Venice\nHave to book pier to station\nThen train to Venice ????🤞🏼", "link": "facebook.com/groups/1373361046396315/permalink/2193602984372113/", "likes": 1, "comments": [{"username": "Jenny Godfrey", "comment_text": "You either get off the train at station and take ferry or walk depending where you want to end up in Venice and how much luggage you have to walk with."}, {"username": "Frank Hunt", "comment_text": "You mean docking at Civitavecchia, train to Rome station then onwards to destination. Use the Trainline app to prebook the travel so that you can get timing right.\nThere is a bus that goes from port to station for a few Euro, turn left when coming out the main doors."}]}, {"id": "2193620031037075", "text": "Colosseum Tickets:\nJust wondering - does everyone seem to get in at their allocated time on their ticket at the Colosseum? I have read this isn’t the case with the Vatican.\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2193620031037075/", "likes": 0, "comments": []}, {"id": "2193632341035844", "text": "Best way/option to get to Villa de Balbianello from Perledo/Varenna. Party of 6 people.\nWe want to see the garden + interior of the villa.\n\nIs it the ferry from Varenna to Perledo? With the talk about ferry lines I’m hesitant if we have timed tickets. Or would this be ok?\n\nWould a water taxi be the better way to go?\n\nWe’d like to get to the villa explore and the head back with perhaps a stop in Bellagio and then back to Perledo/Varenna where we are staying.\n\nTIA!", "link": "facebook.com/groups/1373361046396315/permalink/2193632341035844/", "likes": 0, "comments": []}, {"id": "2193639057701839", "text": "Dolce far niente ❤️", "link": "facebook.com/groups/1373361046396315/permalink/2193639057701839/", "likes": 547, "comments": [{"username": "Marta Schultz", "comment_text": "Beautiful photos!"}, {"username": "Diane Hamilton", "comment_text": "Gorgeous ❤️❤️🇮🇹"}, {"username": "Tierra Smith", "comment_text": "Gorgeous"}, {"username": "Heather Corson", "comment_text": "Great pictures!! Did you hire a photographer?"}, {"username": "Sharon Tiang", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Rona Beattie Chai", "comment_text": "Love all your dresses!"}, {"username": "Savioo Ferrao", "comment_text": "Mesmerizing beauty..what a Art 🎨🎭"}, {"username": "Caroline Ramirez Randazzo", "comment_text": "Absolutely gorgeous!!!🩷🩷🩷"}, {"username": "Rayandra Alexander Seville", "comment_text": "Great photos!"}, {"username": "Laural Reznik", "comment_text": "Amazing shots! What time did you get there or suggest getting there to get these kind of pictures?"}, {"username": "Fiorela Zegarra", "comment_text": "Beautiful photos and you dress❤️💖"}, {"username": "Isabelle Grech", "comment_text": "Did you get permission to sit at the Trevi Fountain, I believe it's not permitted, I was told to move by police."}, {"username": "Dáša Musilova", "comment_text": "Dáša Musilova"}, {"username": "Lisa Gonzalez Propri", "comment_text": "Gorgeous pics!"}, {"username": "Iman Rizwan", "comment_text": "Absolute lovely photos😍"}, {"username": "Janine Brailsford", "comment_text": "Very beautiful & romantic photos! Love your flowered dress & your scarf at the Vatican museums!"}, {"username": "Mary Chu", "comment_text": "Great photos 👍"}, {"username": "Mary Chu", "comment_text": "Btw, to go travel Italy , require 9-10 days enough?"}, {"username": "Ionela Shomo", "comment_text": "Ionela Shomo"}, {"username": "Rosa Butta D'Astolto", "comment_text": "Beautiful pictures"}, {"username": "Casey Farrell", "comment_text": "Beautiful photos 😍"}]}, {"id": "2193641247701620", "text": "Naples or Sorrento as base for Coast?\nI spoke with a man from southern Italy and he says he would stay in Naples not Sorrento as base and take ferry’s from there", "link": "facebook.com/groups/1373361046396315/permalink/2193641247701620/", "likes": 8, "comments": [{"username": "Allan Olexa", "comment_text": "Napoli is our favorite destination…a week annually. So much to do there and so convenient for day trips. Plus, margherita pizza and sfogliatella!!"}, {"username": "Sandy Radican Shikaly", "comment_text": "Sorrento!!!!"}, {"username": "Anne Mc Namara", "comment_text": "Sorrento.Its so beautiful there and easy day trips to Capri, Almafi, Positano and Pompeii"}, {"username": "Ettore de Vita", "comment_text": "Napoli 100%\nMore things to do + visit Ischia #1"}, {"username": "Stella Dee", "comment_text": "Stay in Naples. Easy to go anywhere from there."}, {"username": "Iliana Zlatareva", "comment_text": "Napoli"}, {"username": "Navreen Mandair", "comment_text": "I’m staying in Naples in September and found it so easy to book day trips around the Amalfi coast from there"}, {"username": "Leigh Baguley", "comment_text": "Sorento 100%"}, {"username": "Colleen Sommerin", "comment_text": "Sorrento for sure"}, {"username": "Anthony Taylor", "comment_text": "Sorrento"}, {"username": "Carmela Siniscalchi Frattellone", "comment_text": "Naples is a city so if you like that vibe stay Naples. I personally would choose Sorrento. I was just there and absolutely love it there"}, {"username": "Elie Loummer", "comment_text": "Sorrento is beautiful and safe and affordable and comfortable, take ferries from there, be sure to visit Capri!!!"}, {"username": "Karen Smart", "comment_text": "Sorrento!!"}, {"username": "Angela Genduso", "comment_text": "Sorrento"}, {"username": "Mary Anne", "comment_text": "We stayed in both places and I’d recommend Naples. So much to see and do. We stayed at the port, so easy to catch ferries to the islands and a quick walk into the old town."}, {"username": "Tracey Aloi", "comment_text": "Sorrento"}, {"username": "Cynthia Marie", "comment_text": "Sorrento is lovely"}, {"username": "Pamela Karp Creamer", "comment_text": "More people appear to dislike Naples than Sorrento. I have been to both, and would stay in Sorrento while doing a daytrip to Naples."}, {"username": "Cassandra Goodgame", "comment_text": "I stayed in Naples 5 nights last year and loved it. I firmly believe it gets an undeserved bad wrap."}, {"username": "Mary Pecker Deegan", "comment_text": "How easy is it to get from Naples to Ravello for a day trip?"}, {"username": "Angela Gilmore", "comment_text": "101% Naples! It's a big city with lot of opportunities and things to do, to visit, to eat.\nSorrento is lovely and closer to the coast but that's it.\nIt depends on what you wanna do. If you just want to relax and swim, ok Sorrento may be the best choice.\nBut if you want to have more opportunities and don't want to deprive yourself of anything, stay in Naples, definitely."}, {"username": "Raf Gervasio", "comment_text": "Train from Napoli to Sorrento...easy"}, {"username": "Mary Lou Goodwin", "comment_text": "We loved Sorrento it’s especially beautiful at night."}, {"username": "Debi Ann Marie", "comment_text": "City vibe VS more laid back vibe."}, {"username": "Janet Messanelli Bozzone", "comment_text": "Neither. Stay in Salerno. Lol."}, {"username": "Kathy Smith", "comment_text": "I’d pick Sorrento. Naples isn’t for everyone. Depends on what you like. I am in Italy now."}, {"username": "Renae Larcus", "comment_text": "I would stay in Sorrento as a base"}, {"username": "Joanne Bianco", "comment_text": "Depends if u want a city atmosphere or a relaxed town"}, {"username": "Alicia Cox", "comment_text": "Sorrento for me - loved it. Naples did not care for at all."}]}, {"id": "2193642334368178", "text": "Two days in Florence and one day in Rome.\nWhat are tha absolute must do’s?", "link": "facebook.com/groups/1373361046396315/permalink/2193642334368178/", "likes": 2, "comments": [{"username": "Kristina Marie", "comment_text": "Enjoy yourself. That's all you must do"}, {"username": "Monique Swanner", "comment_text": "Vespa tour of Tuscany!!"}, {"username": "Joseph Ferragina", "comment_text": "PSA.\nfriend of mine flew with Swiss Air this year to Italy. He’s been in Italy for six days without luggage. Six full days without luggage. Swiss air is horrible. If you are going to not fly with them."}, {"username": "Kelly Hill", "comment_text": "Walk up to the Michelangelo Gardens in Florence - breathtaking views of the city"}, {"username": "Gillian O'Callaghan", "comment_text": "There is so much to do in both and very dependent on your interests and passions. Have you tried searching in this group. Another option is the \"visit a city\" app. Check out \"things to do\" and \"sights\" then whittle down a short list...good luck."}, {"username": "Cherie Horne Duda", "comment_text": "Eat at the wine window restaurant in Florence."}, {"username": "Candy Mattiello", "comment_text": "Florence: The Duomo, The Uffizi, The David , Medici Palace and Ponti Vecchio\nRome: Coliseum, Trevi Fountain, The Pantheon, Vatican City"}, {"username": "Martin L. Epperly", "comment_text": "Should make it 2 weeks in Rome and 1 week in Florence"}, {"username": "Rachel Isley", "comment_text": "Lots of gelato and cannolis! Take home some art for your walls and take in some outdoor music on a rooftop overlooking Rome."}, {"username": "Chris Vilsack", "comment_text": "Rome.. There's a lot in Rome.. 1 day.. You'll be running"}, {"username": "Kim Hudson", "comment_text": "Florence - Basilica of St. Croce"}, {"username": "Tricia Teys", "comment_text": "Parthenon, Colleseum and David"}, {"username": "Lashawn Bennett", "comment_text": "Hop on and hop off in Rome. You can see everything"}, {"username": "Nancy Koehler Barboni", "comment_text": "Rooftop bar/lounge at the Gran Minerva hotel behind the Pantheon. Go in the evening."}, {"username": "Suzanne Milani Agresta", "comment_text": "I would do one day Florence and two in Rome! More to do in Rome!"}, {"username": "Dana Green", "comment_text": "I loved Borghese Gallery in Rome more than Uffizi and Accademia. It’s breathtaking. We went to the Colosseum and Constantine’s Arch last night and it was beautiful."}, {"username": "Mimi Mary", "comment_text": "Wagon Moree\nLiza Toro"}, {"username": "Brad Wilton", "comment_text": "Drink water"}, {"username": "Angie Callejas", "comment_text": "Hop on hop off."}, {"username": "Anna Sanday", "comment_text": "We’re doing 1day in Rome in 2 weeks. We’re going to do the hop on hop off bud for the day"}, {"username": "Merlene Gilb", "comment_text": "Find the a wine window in Florence. We enjoyed the Osteria Pastella Buchetta del Vino wine window. 🍷"}, {"username": "Gina Rovello Keenan", "comment_text": "Not sure what you can do in Rome in a day, but you may want to skip tours just because of the time spent in lines. You can walk by the Trevi fountain, Spanish steps, Pantheon and Colosseum. Just wander and take in as much as you can."}, {"username": "Alicia Cox", "comment_text": "Get more time!"}]}, {"id": "2193658957699849", "text": "Do Tabachi shops in Rome actually sell bus tickets anymore? Everyone we have tried has sent us somewhere else.", "link": "facebook.com/groups/1373361046396315/permalink/2193658957699849/", "likes": 0, "comments": [{"username": "Rhona OConnor", "comment_text": "That's where I bought them in other city's.... With cash only."}, {"username": "Monique Swanner", "comment_text": "That's where I've heard to look! We haven't actually tried to buy any yet"}, {"username": "Eric Maurer", "comment_text": "We found them in a newspaper stand for cash only but we've tried 3 or 4 Tabachi shops and none of them have had them"}, {"username": "Karon Patterson", "comment_text": "Yes you can buy them at any Tabbachi store we found. You can also buy them on the bus"}]}, {"id": "2193665967699148", "text": "Hello, I am holding a Schengen visa(France). Staying in Paris for two weeks. I feel like after 3 days in the city would be enough. Any suggestion on best short day trips via train that will not cause visa issues to/from Paris? TIA!", "link": "facebook.com/groups/1373361046396315/permalink/2193665967699148/", "likes": 0, "comments": []}, {"id": "2193668687698876", "text": "Hello. For Canadian travellers to Italy where is the best place to exchange money??? Please and thank you", "link": "facebook.com/groups/1373361046396315/permalink/2193668687698876/", "likes": 6, "comments": [{"username": "Mary Fortura", "comment_text": "From your bank. Got a rate of 1.45 at CIBC. Don’t buy on a Monday. Give the market a chance to rebound from Friday close."}, {"username": "Sandra Desmond", "comment_text": "Not sure what about the atm in the airports not sure if they have"}, {"username": "Irfan Karmali", "comment_text": "Calforex, if you come home with Euros they will buy back with proof of receipt."}, {"username": "Gunilla Larsson", "comment_text": "Use debit card"}, {"username": "Gilles Laplante", "comment_text": "In your own country before taking the plane…shop seriously…"}, {"username": "Tanya Lee Knightly", "comment_text": "Wise card."}, {"username": "Louise Desnoyers", "comment_text": "I went 11 times in Italia. Depending where you are going, I humbly suggest you find an automatic “ bancomat” in a bank that will not charge you any extra fees . In Torino and Milano the best is Swiss Bank. In Sicilia Unicredit bank.\nPlease avoid ATM. Many of my friends have been hacked after using those.\nEnjoy your trip!"}, {"username": "Nancy Sunshine", "comment_text": "Continental and the bank"}, {"username": "Tyffany Tubajon", "comment_text": "I got a wise card. Debit/credit card."}, {"username": "Karen Schmidt", "comment_text": "I pick up a bit at the airport as I leave. Yes, exchange rate is not as good but it certainly is very convenient. Really in the end maybe I pay small amount ￼ more, ￼but in the scheme of a whole entire trip I appreciate the convenience factor. ￼It was better than my bank offered too. After that, I mostly use my visa and I do go to a bank ATM to get more when needed. Never use any other ATMs, other than those associated with banks. ￼￼"}, {"username": "Shannon Confortin", "comment_text": "I get mine at my bank in Canada before leaving. I try to pay mainly in cash. If you use an atm make sure it is attached to a bank. I have a cc as back up"}, {"username": "Annick Hupperetz", "comment_text": "Bank"}, {"username": "Lee Say Lor", "comment_text": "At TD before leaving"}, {"username": "Melissa McWilliams", "comment_text": "We use a Bullion\n\nhttps://\nwww.vbce.ca/"}, {"username": "Lorissa Gill", "comment_text": "Your own bank,\nAlways"}, {"username": "Marlen Zamarron", "comment_text": "I order mine from my bank RBC and I also use my Mastercard, I had no problems at all."}, {"username": "Joy Gearing", "comment_text": "I’ve always gone to the Oshawa Currency Exchange in the Oshawa Shopping Centre. I hate having to go the the bank to order money then have to go back to get it. Here, it’s immediate and they have all the currencies."}, {"username": "Laura Onofrei", "comment_text": "Before you live, is difficult to Exchange canadien dollars to euros"}, {"username": "Pam Vel", "comment_text": "From your bank in Canada."}, {"username": "Soc Cer", "comment_text": "We exchange before we leave"}, {"username": "Ketia Jeannoel", "comment_text": "Go to your bank in Canada 🇨🇦"}, {"username": "Ketia Jeannoel", "comment_text": "I always ordered mine from my bank in United States 🇺🇸"}, {"username": "Fabio Blarasin", "comment_text": "Wise or Revolut card."}, {"username": "Mitzi Shapera", "comment_text": "Any Italian ATM that is compatible with Cirrus. Check the back of your Canadian bank card."}, {"username": "Ken Diamond", "comment_text": "Use your ATM card at bank associated Atm’ they are usually grey in color and will say on them which bank they are associated with. Atm in italy is a “Bancomat”"}, {"username": "Paul Buccini", "comment_text": "The ATM always pays better"}, {"username": "Sigrid Cormier", "comment_text": "Continental currency. I use them all the time. Look for their locations. Best exchange rates 3-4 cents better than your bank."}, {"username": "Tracy Foss", "comment_text": "Your bank 🇨🇦"}, {"username": "Walaa Hosny", "comment_text": "I have an account with TD Bank and I exchanged euros with them last week"}, {"username": "Dino Lavorini", "comment_text": "Go to a bank ATM- do not use freestanding atms in airports etc- look for bancomat at banks"}, {"username": "Colleen Ann Maria", "comment_text": "Get euros before you leave … not a bank but a money exchange broker"}, {"username": "Rocchina Rachel", "comment_text": "At a broker not the bank."}, {"username": "Liz Ariar", "comment_text": "I go to local money changer booths, I find their rates are better than the bank’s"}, {"username": "Pauline Gieni", "comment_text": "Just got 350 euro and cost me 530 cdn"}, {"username": "Annie Slater", "comment_text": "Definitely better in Canada before you leave. Most places in Italy take Visa, so use that for exact currency conversion too, and save the euros for the rare occasion where only cash is accepted."}, {"username": "Fabia Hugo", "comment_text": "Atm in italy."}, {"username": "Franca Quinlan", "comment_text": "We get our Euros from Continental Currency Exchange. Don't go to a bank. https://\nwww.continentalc\nurrency.ca/\nbranches."}, {"username": "Pong Ac Ai", "comment_text": "Your bank in Canada"}, {"username": "Line Gregoire", "comment_text": "Wise debit card, better rates"}, {"username": "Rhonda Smith", "comment_text": "I went to a local money exchange"}, {"username": "Ettore de Vita", "comment_text": "@the airport\n+ better if you use CC"}, {"username": "David Solo", "comment_text": "Use an ATM. Ask your bank if they have a card that either has no foreign transaction fees and which actually refunds any fees (I know JPMorgan Chase does). I also suggest using credit cards and not debit cards as you have created recourse with credit cards in the event of fraud."}, {"username": "Paul Anderson", "comment_text": "Look on line for the best rate exchange near you."}, {"username": "Marie Piedl", "comment_text": "In Canada before you leave. Sometimes trying to save $$$ overseas is just a headache."}, {"username": "Kendra Hall", "comment_text": "When we went we got Euros from https://\nwww.continentalc\nurrency.ca/ They have many locations in the GTA, rates much lower than the bank"}, {"username": "Elaine Fenech Saré", "comment_text": "Cards are used everywhere"}, {"username": "Teresa Vozza", "comment_text": "A local currency exchange in your hometown before you leave Canada."}, {"username": "Joe Cleaver", "comment_text": "$200 euros cost me $302 at CIBC two weeks ago"}, {"username": "Mary Iuor", "comment_text": "I ordered mine from my bank in Canada 🇨🇦."}, {"username": "Paula Brink", "comment_text": "I get some from my bank if I don’t have any left over from a previous trip. Then I use ATMs to get cash in Italy when I need more. I have an account with Scotiabank and they have an agreement with BNL bank in Italy so there are no ATM fees.\nWhen taking money out of the ATM there will be a question do you want the conversion done for you, always say no, choose euro. Also when paying by credit card there will be the option to pay in Euro or Canadian $- always choose Euro and let your own bank do the conversion. This practice iscalled Dynamic Currency Conversion or DCC and it’s presented as a convenience for you but really costs you more."}, {"username": "Sarah Longman", "comment_text": "Your bank. They will always give you the best exchange rate."}, {"username": "Nadia Filice", "comment_text": "Currency Exchange"}, {"username": "Miriam Griffin Woods", "comment_text": "Wise card"}, {"username": "Laura DeCicco", "comment_text": "Order from your bank"}, {"username": "Jennifer Wees", "comment_text": "I take some cash with me, try to use my card when there, and just take $ out at a machine. Depends on what kind of fees you get for the exchange but I prefer the convenience."}, {"username": "Nicole Harrow", "comment_text": "Thank you everyone"}, {"username": "Darcy Jessen", "comment_text": "We ordered some through the bank at home then will get rest from\naTM"}, {"username": "Toni Binnie", "comment_text": "Definitely continental currency exchange, they usually have the best rate, not the bank."}, {"username": "Shannon Facette", "comment_text": "I bought some euros at continental currency. You can get a vip card for free for special rates and they also offer seniors and frontline workers discounts. We used our credit card for everything we could. That way we paid the proper rate of the day. It got cheaper everyday we were there. Euros for gelato and water and toilets lol"}, {"username": "Sandra Kirkeby", "comment_text": "Order it at the bank"}, {"username": "Terry Spincic", "comment_text": "In Canada"}, {"username": "Tania Bourgoin", "comment_text": "At your bank"}, {"username": "Christine Aird Craig", "comment_text": "ATM"}]}, {"id": "2193673094365102", "text": "Secada, Italy🇲🇱❤️", "link": "facebook.com/groups/1373361046396315/permalink/2193673094365102/", "likes": 7, "comments": []}, {"id": "2193676721031406", "text": "How is Italy in April. Is it warm. Beach weather? Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2193676721031406/", "likes": 2, "comments": [{"username": "Enrico Lecce", "comment_text": "Enrico Lecce"}, {"username": "Peggy Fisher", "comment_text": "We found it chilly, layer... one day a puffy coat, raincoat, some days sweater."}, {"username": "Denise Gadsby", "comment_text": "Perfect we went to Pisa in April and was around 19 every day"}, {"username": "Joseph Ferragina", "comment_text": "PSA.\nfriend of mine flew with Swiss Air this year to Italy. He’s been in Italy for six days without luggage. Six full days without luggage. Swiss air is horrible. If you are going to not fly with them."}, {"username": "Stephen Henn", "comment_text": "The water temperature the second week of April in Amalfi was 63F/17C. The day temps were high 50s to mid 60s daytime around Rome."}, {"username": "Neil Dunning", "comment_text": "We went April 19 for 1 week and the weather was absolutely perfect"}, {"username": "Cindy Leis", "comment_text": "Thank you everyone!"}, {"username": "Frank Hunt", "comment_text": "Not beach weather."}, {"username": "William Gonzalez", "comment_text": "It depends what partof italy you go to"}, {"username": "Angela Gilmore", "comment_text": "Nope, not beach weather. But you can enjoy your vacation without the heat, it's way better :)"}, {"username": "Kerrie Reeves", "comment_text": "Weather changeable in April, not beach weather. Went to Sorrento in early May and the weather was very pleasant. Shorts and t shirt. Equally been to Tuscany at the end of May and it was freezing. We had to go and buy jumpers!"}]}, {"id": "2193679551031123", "text": "Hi all we will be in Sicily and Pompei so can go up either/ or both Etna and Vesuvius. Any thoughts on which one would be better or should we do both? TIA.", "link": "facebook.com/groups/1373361046396315/permalink/2193679551031123/", "likes": 0, "comments": [{"username": "Karise Pagano", "comment_text": "I don’t know about Vesuvius, but Etna is pretty spectacular. You can see for miles on a clear day. And there are various old craters you can walk around depending on your level of fitness. I recommend sneakers as I climbed up a pretty tall crater edges in sandals one of the many times I’ve been and it was not pleasant! One time my dad hiked several of the craters while my mom and I sat and enjoyed a coffee and the view!"}]}, {"id": "2193683737697371", "text": "🌞 How is everyone finding the heat in Italy at the moment?\nI am currently travelling the country and considering not visiting Florence and Rome during the trip (I can come back on a different trip) because the extreme heat will probably ruin the experience. I am trying to find cooler coastal areas where there is access to swim or considering just going to neighbouring countries where it is cooler.\nAny advice?", "link": "facebook.com/groups/1373361046396315/permalink/2193683737697371/", "likes": 36, "comments": [{"username": "Aleksandra Zvezdakoski", "comment_text": "Rome is extremely hot! I would skip."}, {"username": "Gina Johannes", "comment_text": "Just left Florence this morning. Advice. Get a hotel with a pool. It saved us during the day!\nHotel Croce di Malta was amazing and in the perfect location!"}, {"username": "LoriKerry Palmer", "comment_text": "I would miss Rome and Florence this time for sure! We were in Rome July 6 before it got really hot and it was not pleasant!"}, {"username": "Alyce Henry", "comment_text": "PRETTY DARN HOT HERE"}, {"username": "Amenyo Abraham", "comment_text": "I’ll recommend to anyone planning a trip to Croatia to get a guidebook Discover Croatia by Ivan Brooks on Amazon. It has useful information, hidden gems, accommodation and safety tips for a successful trip."}, {"username": "Melinda Loukas", "comment_text": "In Rome at the moment. It is very hot, humid and so many crowds! I would advise to go somewhere cooler or limit your time outdoors during the hot afternoons!"}, {"username": "Nancy Vahl Raske", "comment_text": "Head fast to the mountains!!!"}, {"username": "Renee Rundle Stoneham", "comment_text": "Lake Garda and the Dolomites"}, {"username": "Lucia Evangelista", "comment_text": "We are in Rome and seriously I would reconsider. I am from Sydney Australia so the heat is something we live with but this is next level discomfort. Way too crowded, queues everywhere and the humidity is killing us.\nNever again travelling in Summer. June to August are the worst times no wonder shops close from 1-5pm!"}, {"username": "Lucia Evangelista", "comment_text": "I would do Stresa on Lago Maggiore. Just divine and not as crowded as Como!"}, {"username": "Claudio Blizzard Indastria", "comment_text": "Roma is a coastal city #themoreyouknow"}, {"username": "Jeanette Moore", "comment_text": "i watch a vlogger who said it will be 100 in sorrento today and she lives there....said the heat was awful."}, {"username": "Sara Bee", "comment_text": "I am in Liguria on the coast and it’s hot but much better than in the big cities. I’d stay away from Florence and Rome 100%. You need to plan a visit in October in order to see those places without dying."}, {"username": "Georgette Walker", "comment_text": "Three year of going to Italy now and I always go in September. A little less heat and humidity and crowds."}, {"username": "Leanne Howard", "comment_text": "https://\nwww.discoverwalk\ns.com/blog/\nrome/\nbest-swimming-sp\nots-in-rome/\n\nIf anyone does end up in rome (over 40 c today ), this guide is useful . I took the kids for the whole day to the public swimming pool on the river ! We took a taxi and the driver said it was usually low 30s this time of year and this heat was not the norm ."}, {"username": "Tammy Biasi", "comment_text": "Going in December is off-season less crowded. It’s cooler the weather is phenomenal. That’s usually when we go."}, {"username": "Craig Wilhelm", "comment_text": "Summer"}, {"username": "Len Murtha", "comment_text": "Riomaggiore. Water is great!!!"}, {"username": "Len Murtha", "comment_text": "Manarola, too!!"}, {"username": "Claire Buccini", "comment_text": "We are in como and it's still quite warm, very little breeze to cool things off."}, {"username": "Melissa Therrien", "comment_text": "We just drove through the Dolomites-Corti\nna D’Ampezzo looked really nice and the weather was great. Also lake Garda was more manageable heat wise in Sirmione-was crowded but not nearly as hot as Rome/Florence right now. Also Lago do Braies in the Dolomites had nice weather and is so pretty but need a car and bit of a drive but-close to Austria too, maybe a bit cooler up there?"}, {"username": "Rachael Richardson", "comment_text": "We have been in Italy since 6/7 , Venice, Pisa, Florence, sorrento and it has been hot and humid but you do get used to it, I have an autoimmune disorder but i just wear a hat, drink lots of fluids, stay in the shade and use a fan when possible and avoid doing anything strenuous 12-3 and I’ve been great ! I climbed to the crater at Vesuvius today and did Pompeii ! Be sensible and enjoy 🥵🇮🇹"}, {"username": "Lesley Gregory", "comment_text": "What temp is it atm"}, {"username": "Josie Gilbert", "comment_text": "Puglia is lovely right now"}, {"username": "Katalina Loredo", "comment_text": "Currently in Cinque Terre and we have a spray bottle with us at all times with cold water, use umbrellas, and carry fans with us. This has made the heat more bearable. We haven’t had the chance yet to go back to our hotel room midday but we make it in around 3ish and go out again at 7/8. Of course, drink lots of water, wear sunscreen, have snacks, and try to enjoy 😅"}, {"username": "Megan Laurenti", "comment_text": "We rented a boat today in Porto Santo Stefano and it was 90 degrees and glorious on the ocean. The perfect day!"}, {"username": "Elizabeth A McGuirk", "comment_text": "Fell in love with Lake Garda...yes Malcesine...sta\nyed at. Hotel Vega..many places to see along the lake and you can go to the top of Mt Baldo!"}, {"username": "Janet Hitzeman Lynch", "comment_text": "118 F, 48 C today in Rome"}, {"username": "Romina Lauretig Toscano", "comment_text": "Rome is too hot. You should visit it in October."}, {"username": "Jodi Bruno Rojas", "comment_text": "I am in amalfi coast now scorching hot dripping sweat all day. Capri the same. The sea water the sun reflects on it. Less places for shade. Last week in Rome and Pompei. On my way to scicly where it’s over 100s. Everywhere is the same. Drink lots of water stay hydrated and enjoy. Definitely have a battery operated fan. Sweat rags you can wet for your neck."}, {"username": "Ruth Akutu Maccarthy", "comment_text": "If you like lakes Garda lake is a good option. It has beautiful frontlakes where you can swimm in clean water: Malcesine"}, {"username": "Leila Jane", "comment_text": "Good idea. We were there during a 100 degree heat wave a few years ago and it was miserable. I would agree with you to make alternative plans."}, {"username": "Mary Balistreri Swan", "comment_text": "Australia, its cold here. Seriously a pool, or beach with shade, a/c. Not sure where to recommend as its probably packed everywhere."}, {"username": "Maddy Herbert", "comment_text": "We are from inland Australia and very accustomed to dry heat. The humidity can be tough, but be sun smart - sunscreen, hat, sunglasses, loose light coverings (long sleeved light linen has been a saviour). Seek shade wherever you can (even if that’s just walking on the other side of the road) and drink plenty of water (at home we were taught 200ml for every 20 minutes in the sun).\nWe’ve spent 2 weeks here - Milan, Venice, Rome, Sorrento and now Naples.\nJust pick your timing! Early mornings and evenings are best with an air conditioned museum and/or hotel siesta in the heat of the day.\nThe colosseum tour was probably the biggest struggle, but worth it. The guide was helpful in finding shady areas with breezy thoroughfares.\nMy partner loves to walk around new cities but we opted for an air conditioned Uber where we could (not an option in some places - but the scooters are a good option in Florence) and I found it helped “preserve” stamina!\nWork smarter not harder, don’t miss out on the beautiful places on offer 😊"}, {"username": "Christine Pinto Kulp", "comment_text": "Once, just once we were in Italy at the end of May- never again! It was 106 for quite a few days in a row. That taught us never to travel in early summer, summer or late summer again! We now travel off season in mid to late fall and early spring. I know some of you have children and can’t travel at certain times because of school schedules. But, I advise to leave the kids home with grandma and grandpa and go off season. You will enjoy it so much more and there are no crowds and your children won’t be miserable!"}, {"username": "Shana Woodfield", "comment_text": "Lake Como should be a lot cooler than Rome."}, {"username": "Sherry Davis Wainz", "comment_text": "Heat tolerance varies widely. As you described it will ruin your trip maybe visit in cooler months if you have flexibility"}, {"username": "Rebecca Millhouse", "comment_text": "Michelle Sloan Kendal Achurch-Ihle - I’d say going in term 3 holidays (and maybe an extra week?) is going to be nicer than July holidays! I love the heat but sightseeing in 40 degrees - no thank you!"}, {"username": "Berndt Weihs", "comment_text": "I would recommand a beach in Northern Italy from Venice until Trieste.There are a lot of beaches from Venice to the North,Jesolo,Bi\nbbione,Lignagno\n,Grado,Sistiana\nand Trieste itself,a very beautiful City and 20 km from the border to Slovenja and Croatia with also small beautiful villages and beaches."}, {"username": "Laura Piccinini", "comment_text": "Go to Dolomites!!!! Even at the seaside it's quite hot now,like 40°C."}, {"username": "Angie M. Tarighi", "comment_text": "We’re in Rome right now. Dear God I’ve never sweated this much! 😂"}, {"username": "Andressa Wilson", "comment_text": "Spent last week in Florence and Rome. Avoid it! Waaaaayyyy too hot. It ruined it for us in so many levels"}, {"username": "Laurice Branham", "comment_text": "We were in Rome for 3 days and in Florence for the last 4. Rome was incredibly hot - we had day excursions and it was brutal. We've been in Florence for the last 3 days and it is also unseasonably hot; even the locals were saying so. The evenings have been much better though, especially with the breeze. Hydrate at every opportunity, walk in the shade if possible, and eat plenty of gelato!"}, {"username": "Liisa Andelin", "comment_text": "We’ve been in Rome for 2 weeks now.\n\nI’m from freezing cold Finland and I’m enjoying the weather in Rome 😄\n\nTomorrow heading to Amalfi coast."}, {"username": "Peggy Frasca Prichard", "comment_text": "We are going in late September. Hoping it’s a bit cooler but fully expect it to still be warm."}, {"username": "Krissy Dascoli-Meehan", "comment_text": "The heat was tough in Rome - we did mornings and nights and napped during the day in the AC. We head to Florence tomorrow. I’m hoping it’s a little better but I’m guessing it won’t be."}, {"username": "Sandra Desmond", "comment_text": "I’m going to Sardinia I can’t wait heatwave or not I’m Ireland we have rain sun wind July was a wash out"}, {"username": "Kezia Smith", "comment_text": "it was definitely hot but bearable if you’re used to the heat. it may sound a bit unconventional but we woke up super early (before sunrise) to get out and see the sights then came back just before midday to nap/wait it out and then head out later at 5/6pm as it starts to cool down 🙂"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "I think that would be a very smart move. Being near water always helps with the heat. Of course millions will have the same idea. Good luck!"}, {"username": "Wendy Farrell", "comment_text": "We left Florence after3 days of extreme heat and headed for the beach at Rimini - great beach but really crowded this weekend - a comic-con event on so thousands of young ones all dressed up, they must have been so hot in their costumes!! But at least we could go swimming and cool off."}, {"username": "Ana Belen Ayard", "comment_text": "Try Dolomite Mountains"}, {"username": "Anne Gee", "comment_text": "Yeah, I'm here with my family now. We came bc some are students and my sister in law is a teacher. This will be the last time I come in July. We made the best of it. We had a great time, but it is extremely hot. I love Rome, but I felt like there was no escaping the heat. Florence was extremely hot too, but it was less walking outside."}, {"username": "Alice Putaro", "comment_text": "why not to the mountains? Trentino Alto Adige Dolomites: lake braies, 3 cime di lavaredo, Cortina d’Ampezzo, Auronzo, lake Misurina"}, {"username": "Kerry Laux", "comment_text": "Dolomites- lago do Garda area or other lake areas Dro, Ledro, Braise?"}, {"username": "Ruth Dias", "comment_text": "Plan your outdoor activities etc... earlier in the day...keep a\nmoist or wet towel with you...carry extra water or buy pedialyte to hydrate...Find shade...Wishing\nu a wonderful vacay!😎"}, {"username": "Stefania Carmosino Spas", "comment_text": "Mountain regions sometimes cooler especially at night. Dolomiti are amazing"}, {"username": "Bob Dook", "comment_text": "Head to the hills !!!"}, {"username": "Debi Wood Swan", "comment_text": "I am in Florence now and it is brutal. It is my first time but I do not think we will see everything!"}, {"username": "Dana Green", "comment_text": "I’m here in Rome now and we only go out in early am or after 7pm. Stay inside during midday to beat the heat."}, {"username": "Maggie Gpe Banuelos", "comment_text": "Florence’s heat was the worst for me🥵 We just did everything before 12pm that meant to be up at 6 and going! Then went back to AC in our room and out again at 5:30pm walking in the shaded areas🤗"}, {"username": "Chris Vilsack", "comment_text": "Upper 30s and low 40s in Rome. I'd go swim in the beautiful sea and come back in the fall/spring.. But also, you can take the subway in Rome to Ostia and swim in the sea as well."}, {"username": "Dennis Jones", "comment_text": "Just returned from Florence and Rome…🔥🔥🔥🥵"}, {"username": "Denis Dimitrijevic", "comment_text": "The heat is crazy! I'm in Rome at the moment and it is insanely hot. It does put a damper on things like going out"}, {"username": "Kerry LaBarbera", "comment_text": "Too hot definitely ruins it"}, {"username": "Katie Martinez", "comment_text": "I second that. We are in Rome too and it’s definitely put a damper on some of our plans. We leave Tuesday and I was hoping to see a few more things but Rome is crazy hot. We have been in Italy two weeks and these last two days have been really sweltering. We haven’t even seen the colosseum or Roman forum because it’s about 30 minutes from where we are and all outside so neither my husband or I want to be out in that. Early morning and evenings have been better, but it’s pretty hot. Try and do indoor air conditioned things in the middle of the day. We took a break most afternoons for a while and went back out in the evenings. It’s still been fun but we did opt out of some things because of the heat."}, {"username": "Sam Mah", "comment_text": "It's raining in mid/northern UK at the moment....🙄"}, {"username": "Jenny Larsen", "comment_text": "Yes we’ve come from Maiori and wishers made that our last stop. We are in Orvieto and it’s ok I think 33c today but not really crowded we are heading to Firenze and Roma but will try and keep out of the heat in the middle of the day. Carrying a cheap spray bottle with water 💦 and a hat . I can’t believe how many do not even have a hat I also have an umbrella, sunscreen and water . We are Aussies but still find it challenging in the middle of the day"}, {"username": "Iby Sibyll", "comment_text": "Sanremo on Liguria coast, have beach, gardens, vegetation, and temperatures is low then Florence and Rome, and are many to visit in that area, Imperia, Bussana, Ventimiglia, Dolceaqua ."}, {"username": "Karen Dittman", "comment_text": "Ireland….."}, {"username": "Ali Everson", "comment_text": "Florence lost it's charm in the heat and crowds!"}, {"username": "Evelyn Brown", "comment_text": "This is what we are using to try to plan a get away from Milan: https://\nwww.weather-fore\ncast.com/\ncountries/Italy"}, {"username": "Vicki Sandiford Floyd", "comment_text": "A friend in Rome told me this week that they’re having record high temps. I would be miserable."}, {"username": "Rob Salimbene", "comment_text": "We are in Rome now from Florida. The heat is warm but the humidity is way less than home. I don’t think it’s too bad. Keep a water bottle handy and fill at all the public water fountains/\nsprings."}, {"username": "Leanne Howard", "comment_text": "Just been to Florence and now in rome . I’d skip both …too hot and crowded . I wish I’d stayed near the coast . I’m from Sydney and used to the heat but this is next level and with the crowds and no seaside , I would go elsewhere !"}, {"username": "Annette Killion Calhoun", "comment_text": "We have been here 10 days, and it is EXTREMELY hot! We lived in Las Vegas for 40+ years, and it is hotter here. It is very crowded, and shade is hard to find."}, {"username": "Letisha Withrow", "comment_text": "Riccione was pretty nice if like sandy beaches\n\nAnd I forget the town we stopped at but it had rocky beaches on the west coast that had a delicious place to eat called the jungle I think it was 😍😍\n\nIf need something close to Florence\nGo to the Elsa trail waterfall!!!!! (Enter at the southern point if don't want to hike) absolutely gorgeous and cooling! 😍😍😍😍"}, {"username": "Colleen Jennings", "comment_text": "Not sure where you are now but I recommend the coastline between Viareggio & Marina di Massa. Beautiful flat coastline with lots of pretty towns/villages on the coast or close by inland. We’ve been going to Marina di Pietrasanta for the past 25 years - we live in England - absolutely love it. Tons of fab hotels 3-5*. Forte dei Marmi is expensive town so we gofor the Weds & Sun markets & always have our coffee standing at the bar - €1.20 instead of €5.we hire bikes as there’s a fab cycle path 8K alongside the coast. Btw we’re 68 & 70 - still cycling in Italy!"}, {"username": "Claudia Riccia", "comment_text": "The coast is beautiful everywhere. If you have the chance, Tuscany has nice towns on the beach and wonderful islands very close by boat (you can board the car too), like Giglio or Elba Island!"}, {"username": "Jessica Asquith Hemphill", "comment_text": "We are in Florence and it’s very hot. Manageable with a cocktail and lots of water. Venice was beautiful! We cancelled our day trip to Rome. 110 degrees is not fun!"}, {"username": "Lyn Wise", "comment_text": "Currently in Florence and tbh it's not very enjoyable with this heat. (And crowds)"}, {"username": "Vina Stebs", "comment_text": "We are in Rome, start our day early and retreat back to our hotel to shower, cool and nap after lunch. Then go back out at 5! However it is our second time here so not really rushing to see all the attractions"}, {"username": "Serena Mascheretti", "comment_text": "Avoid big cities that are overheating, go in the rural country or the sea, avoid midday to visit, enjoy nights out!"}, {"username": "Susan Lowry Lamb", "comment_text": "Head to Ireland."}, {"username": "Claudia Amp", "comment_text": "Overcrowded, hot and humid (you should visit in the spring or fall); go to the Tuscan archipelago if you can or Versilia (I’m having drinks now in Seravezza and it’s super cool, might even get chilly)."}, {"username": "Maile Ehlers", "comment_text": "I’ve been in Naples the last 3 days and just got to amalfi. It is HOT."}, {"username": "Lisa Rotondi", "comment_text": "Keep your expectations in check, to have a successful visit. What I mean by that is — be okay with going back to your apartment/\nhotel for 5-6 hours midday. We went out in the early AM and late PM, only. Hydrate more than you think is necessary to help cope."}, {"username": "Clau D'Ette", "comment_text": "We were in Rome because I had booked the Musei Vaticani tour and Villa Borghese museum tickets in advance, afterwards we went to Tivoli and now we are in Frascati and we're enjoying every minute since we are doing what the locals do, eating typical food etc. Can't stand the heat and overcrowded Rome. We have considered in coming in cooler months."}, {"username": "Sea Shore", "comment_text": "We tend to do inter city in April or Oct x"}, {"username": "Chiara Pirrello", "comment_text": "Isola d’Elba"}, {"username": "Ilaria Verda", "comment_text": "Go to the mountains! Valle d'Aosta is beautiful, I suggest you Courmayeur or try dolomiti!"}]}, {"id": "2192800641119014", "text": "Once in a lifetime drive (white knuckle ride for me the passenger 😂)\n\n48 hair-raising Hairpin Bends (most 180° turns) So glad we got up extra early, the smile on my husband's face as he ticked this off hisआणखी bucket list was priceless! Breakfast in Garda in 36°, lunch in the Dolomites, snow ball fight at the top of Passo Stelvio then a pit stop in the Tyrol! Great day all round 🇮🇹👌", "link": "facebook.com/groups/1373361046396315/permalink/2192800641119014/", "likes": 138, "comments": [{"username": "Trudy Smithers", "comment_text": "Caroline Kuit Bags not driving that day 😜😆"}, {"username": "Helen Ladkin", "comment_text": "Bravo!"}, {"username": "Diane Leesmith", "comment_text": "Looks amazing!\nI think sometimes it’s that the challenge is more about navigating them when there’s a vehicle either coming the other way or going slower than you!"}, {"username": "Chelsea Thomas-Nunez", "comment_text": "Curious.. 2way or 1way? Either way, a challenge!"}, {"username": "Louise Ronan", "comment_text": "Matty Van"}, {"username": "Jane Anderson", "comment_text": "I will take this as “where not to go!” advice! Yikes!"}, {"username": "Ellis Peacock", "comment_text": "In what car?"}, {"username": "Terry Panunzio", "comment_text": "I went to stelvio last week, not only was the road a challenge but the bicyclists and motorcyclists that you had to drive around"}, {"username": "Brooke Nikas", "comment_text": "\"Snowball fight\" love this so much!"}, {"username": "Zuzana Turnerova", "comment_text": "Nope, absolutely not!!! 😱😱 This would literally be my worst nightmare!!"}, {"username": "Lori Leone", "comment_text": "What was he driving?"}, {"username": "Mel Peci", "comment_text": "I've driven it in a car and ridden it on a bike . The car was easier, but going down on the bike was scary and fun at the same time. Loved it!"}, {"username": "Stephen Henn", "comment_text": "I had so much fun driving the Dolomites in a Fiat 500 manual shift, steep hairpin turns. Thrilling!"}, {"username": "Joe Guzzi", "comment_text": "Once did it twice the same week! By motorcycle."}, {"username": "Carol Taylor Tisdale", "comment_text": "Now you might be ready to tackle driving the Amalfi coast! 🫣😱"}, {"username": "Gonzalo Lopez Serna", "comment_text": "48 actually from Prato Allo Stelvio."}, {"username": "Ruth Akutu Maccarthy", "comment_text": "Passo Stelvio is simply amazing 😍\nYou should do passo Gavia too!"}, {"username": "Joanne Smith", "comment_text": "Brave people!"}, {"username": "Jim Hash", "comment_text": "Wow, beautiful pictures!"}, {"username": "Kate Douchkov", "comment_text": "We’re ticking this off my husband’s bucket list at the end of August, starting in Bormio (planning on a very early morning start to try to avoid too much other traffic)"}, {"username": "Cris Wimer", "comment_text": "We loved the Strata Della Fora near Limone sue Garda"}, {"username": "Elle Price", "comment_text": "Yep, straight nope! Especially in our car 😂"}, {"username": "Sebastian Gracki", "comment_text": "A cyclist’s dream…"}, {"username": "Julie Toms-Fago", "comment_text": "Amazing!!"}, {"username": "Darlene Maurer", "comment_text": "Exquisite pictures. Thanks for sharing!!😊"}, {"username": "Neville Spargo", "comment_text": "Phil Harris up for this Fangio ?? 😃"}, {"username": "Cynthia Marie", "comment_text": "Oh my gosh that looks like fun!"}, {"username": "Christine Price", "comment_text": "Graeme Cadogan one for you...not me 🤣"}, {"username": "Mark Deebel", "comment_text": "Sue Shurow Deebel look familiar? An amazing decent."}, {"username": "Terri Cameron", "comment_text": "My husbands bucket list dream as well. What is the earliest date this could be done in terms of weather? We will be there next May and I fear it’s too early!"}]}, {"id": "2193704267695318", "text": "Will be visiting Italy in November and wondering what is required to drive a vehicle while there?", "link": "facebook.com/groups/1373361046396315/permalink/2193704267695318/", "likes": 1, "comments": [{"username": "Allan Olexa", "comment_text": "An international driver’s license…Get one at AAA. The city driving is chaotic with little parking. Rural driving is easy and fun, just beware of no vehicle zones and camera speed traps. We always get the complete rental insurance package."}, {"username": "Ty Levine", "comment_text": "Bigger question is why you want to drive? Train is easy and driving in Italy is not fun"}, {"username": "Cheri Arrowood-Stanziano", "comment_text": "International license and proof of third party insurance"}, {"username": "Catherine Campbell", "comment_text": "From 15 November (in our part of Italy but it varies on specific timing in different regions) all cars are required to either have snow types or all weather tyres fitted OR to carry snow chains. Hire companies seldom supply snow chains so make sure you insist on them supplying them and check the exact date it comes into force in the region/s you will be travelling in"}, {"username": "Don Hall", "comment_text": "My time in Europe found it easier to walk or use public transportation (they have a lot) then trying to drive...if u have a fair distance to go and are time restricted use a taxi..."}]}, {"id": "2193706594361752", "text": "Last night in Venice. They celebrate end of plauge every year, third weekend in July. 🎇 A M A Z I N G. 🎇❤️", "link": "facebook.com/groups/1373361046396315/permalink/2193706594361752/", "likes": 1, "comments": []}]