[{"id": "2195970657468679", "text": "Calabria :)", "link": "facebook.com/groups/1373361046396315/permalink/2195970657468679/", "likes": 15, "comments": [{"username": "Marie Cuzzi", "comment_text": "Gorgeous ❤️❤️"}, {"username": "Rita Garzaniti", "comment_text": "My favourite place"}]}, {"id": "2195973000801778", "text": "I find it very hard to find a hotel room for 2 kids (6-7 ) and 2 adults. Always asking for 2 rooms :(", "link": "facebook.com/groups/1373361046396315/permalink/2195973000801778/", "likes": 0, "comments": [{"username": "Jenn Messina Babore", "comment_text": "Yes, this is why we ended up renting AirBnB type accommodations for our trip. It was more economical.\n\nDepending on where you are going and how far away your trip is will also determine availability as 4 person rooms tend to get booked quicker and there is less of them."}, {"username": "Dave Conroy", "comment_text": "Airbnb is way better for this."}, {"username": "Jenny Payne", "comment_text": "Need an Airbnb, hotels don’t do it in Italy"}, {"username": "Russ Coleman", "comment_text": "Try Novotels… they normally do family rooms. They aren’t luxurious hotels but are ok in general. I haven’t stayed in ones in Italy but have in many other European cities."}, {"username": "Monica Colontonio Macho", "comment_text": "Airbnb and be specific in your search as to how many bedrooms and bathrooms you want, or how many people you want it to sleep. Sometimes you may want it to sleep 4 people but only two people will have a private bedroom."}, {"username": "Amy Walczak", "comment_text": "Booking.com was a great resource. It shows the bed options so you can eliminate possibilities. It includes airbnb and hotels. Has great filtering capabilities too"}, {"username": "Dafna Kaplan-Garrahy", "comment_text": "Maybe post a request for people to share 2 bedroom rentals that they liked. I had a great one in Florence but wouldn’t recommend the one we just used in Rome."}, {"username": "Karen Schmidt", "comment_text": "Definitely Airbnb. Just research well and look at the reviews. All of our places have been great"}, {"username": "Jerry Lyubelsky", "comment_text": "We had same issue except for in Rapallo. We had 2 rooms in Milan, Florence, and Rome"}, {"username": "Jamie Weston", "comment_text": "Hotel David in Florence has two bedrooms."}, {"username": "Linda Jo Rice", "comment_text": "Family room"}, {"username": "Barbara Bastianini", "comment_text": "Hotel rooms for 4 are not common in Italy or most European countries. You can try looking for a “family room” or a”quad room.” Not all hotels have them but a few do. They tend to be the least updated rooms in the hotel so be prepared for that. If you find an acceptable one I’d book it fast because you might have trouble finding another.\n\nYou might just have to use two rooms. You know, “when I’m Rome” and all that."}, {"username": "Janet Messanelli Bozzone", "comment_text": "Rooms for 4 are not that common. Try searching on booking dot com for 2 adults 2 kids 1 room and check their listings."}, {"username": "Colleen Jennings", "comment_text": "Check if your hotel has a suite with a separate lounge area where there’s usually a sofa bed. Ask to have this made up as a bed."}, {"username": "Sam Mah", "comment_text": "Try getting an apartment. Look on booking dot com."}, {"username": "Amber Ikemoto", "comment_text": "If your staying in Rome we stayed here. 4 of us in a room and we really enjoyed the hotel. Close to everything, free breakfast, great staff, and pleasant room(cleaned daily). Should be spacious enough for your two younger ones. We have a 17 and 20 year old. They each had a twin bed, their own closet space and we had our own bed and closet spcace. One bathroom but nice. Room isn’t huge but that’s how Italy is and we expected this. We enjoyed the rooftop as well.\n\nhttps://\nwww.hotelparlame\nnto.it/"}]}, {"id": "2195974777468267", "text": "Any recommendations for good walking Sandles? It sounds hot so I want to bring something else besides sneakers.", "link": "facebook.com/groups/1373361046396315/permalink/2195974777468267/", "likes": 47, "comments": [{"username": "Alexandra A Welker", "comment_text": "I wore all over Greece."}, {"username": "Ann Romanowski", "comment_text": "Whatever you do wear, make sure to drink lots of water and a banana here and there for potassium.\nWith all our walking in Italy I have swollen ankles (heat edema).\nMy birks gave me blisters on the top of my feet for the first time."}, {"username": "JoLynn Waters", "comment_text": "Keen"}, {"username": "Shellie Godden", "comment_text": "Birkenstock’s\nWhere them anywhere & everywhere 😊"}, {"username": "Bay Del", "comment_text": "Decathlon hiking sandals"}, {"username": "Sam Pennock", "comment_text": "Sketchers sandals"}, {"username": "Andrea Arango", "comment_text": "The foam/ rubber Birkenstocks. They feel like crocs"}, {"username": "Krista Spanick", "comment_text": "Vionics"}, {"username": "Deborah Farrell", "comment_text": "Saltwater sandals"}, {"username": "Karina Ribeiro", "comment_text": "I just got back and both of these were 10/10 for countless hours of wandering."}, {"username": "Susana Kay", "comment_text": "If you need arch support Skechers arch fit are very comfy"}, {"username": "Carol Burns", "comment_text": "Blowfish strappy flat sandals. Criss cross straps with buckle at ankle although i never undo the buckle (just pull on/off). Look like leather but aren't. So comfy. Wore them day wear and evening walking all around South East Asia for 7 weeks. Bought on Amazon for around £35."}, {"username": "Renae Hoey", "comment_text": "I LOVE the Chacos I got for our trip. I now wear them constantly. Try on a pair first, don't buy online."}, {"username": "Kerrie Puchar", "comment_text": "Love my Sketchers sandals. I wear them everywhere."}, {"username": "D'Anna Sullivan", "comment_text": "Sneakers are actually fine. In Italy now. Where what you want."}, {"username": "Sarah Hawkins", "comment_text": "Teva, Chacos, Birkenstock"}, {"username": "Gill Martini", "comment_text": "Wear anything that you can put under a tap. It’s amazing keeping one’s feet cool in this weather."}, {"username": "Barbara Bastianini", "comment_text": "Chacos are great for me."}, {"username": "Tammy Sprague Olson", "comment_text": "I literally walked 68 miles thru Italy in my Birkenstocks!!"}, {"username": "Ingrid Zancoli", "comment_text": "Keen trekking sandals, I visited half Europe with them, perfect."}, {"username": "Janet Race", "comment_text": "Birkenstocks or Mephisto. Can walk all day without getting blisters and both offer great arch support."}, {"username": "Kit Nader", "comment_text": "I was there couple of weeks ago...wore sketchers trainers and I've never experienced slippy wet feet! It was gross."}, {"username": "Walaa Hosny", "comment_text": "Sketcher Go Walk"}, {"username": "Dana Golden", "comment_text": "Teva. Terra Fi. They have the best soles and a supportive piece around the straps so they don’t rub."}, {"username": "Kate Jordan", "comment_text": "Sorel makes very comfortable sandals, from sporty to more dressy. They are my go-to."}, {"username": "Jodie Grzeschka", "comment_text": "Birks - lived in them last month. Great with adjustable straps for hot and swollen feet too."}, {"username": "Agnieszka Predkiewicz", "comment_text": "Any trekking sandals"}, {"username": "Dagmara Pagliaro", "comment_text": "Fit Flops"}, {"username": "Alyce Henry", "comment_text": "TIVAS"}, {"username": "Mareesa Cullen", "comment_text": "It’s a very fine line between comfort and fashion when it come to footwear for travel."}, {"username": "Karon Patterson", "comment_text": "I bought a pair with a small heel and leather that covered my foot to stop the sunburn. Mine were made in Italy with cushioning"}, {"username": "Tal Burdejny", "comment_text": "Keen"}, {"username": "Ashley Zammit", "comment_text": "I saw these on Amazon and they look sqhishy and comfy but haven’t ordered them yet 😂"}, {"username": "Karen Bowman", "comment_text": "Teva"}, {"username": "Gwen Reuben", "comment_text": "ABEO are sandals I can walk with all day."}, {"username": "Martha Heller", "comment_text": "I live in my Birks!"}, {"username": "Michelle Wills", "comment_text": "Birks, too hot for anything else"}, {"username": "Ruth Remi Bayang", "comment_text": "Any Crocs sandals, like these"}, {"username": "Claudia Gulli Rotondo", "comment_text": "Vionic, Sketchers, Easy Spirit"}, {"username": "Lucia Ursaki", "comment_text": "My Birks have been the most comfortable."}, {"username": "Ellen Edmonds-Wilson", "comment_text": "Birkenstocks"}, {"username": "Anamaria Maireanu", "comment_text": "Crocs sells some comfortable, durable & stylish sandals. Wore mine in Asia & Europe for 2 months straight, with 0 blisters."}, {"username": "Kathleen Gilligan Beddis", "comment_text": "Comfort pillow slides or sandals"}]}, {"id": "2195975064134905", "text": "contemplating going to Italy, September or October. Would like to visit Rome perhaps for two or three nights to see the Colosseum in the Sistine chapel, and the Trevi fountain. Then I would like to go to Sicily for the remainder of the trip would appreciate suggestions on where I should start ￼the trip I should end it and how I would either get from Rome to Sicily or Sicily to Rome. Thank you all in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2195975064134905/", "likes": 0, "comments": [{"username": "Jenn Messina Babore", "comment_text": "I would start in Rome (hustle bustle) and end in Sicily (more relaxing)."}]}, {"id": "2195975350801543", "text": "Cinque Terre - would you travel from Florence by yourselves via train and village hop at your leisure for the day or would it be more cost effective to book a tour?\n\nWe only have time for a day there. Any tips appreciated!", "link": "facebook.com/groups/1373361046396315/permalink/2195975350801543/", "likes": 10, "comments": [{"username": "Jenn Messina Babore", "comment_text": "I think it depends on your travel style. I would train / do on my own."}, {"username": "Sally Warren", "comment_text": "Train to Levanto. Book boat trip. Wander medieval part and have a snack while waiting. Enjoy boat trip, return to Firenze by train. At harbour ask for Marco."}, {"username": "Dave Colleen", "comment_text": "We booked a tour so help us navigate. 2.25 hr a/c bus ride to Cinque. Trains to each stop. Hour in each town. Then boat ride back to bus. Loved seeing the towns up close personal and then from the water. Tour guide night all train tix and boat tix so no time wasted trying to figure that part out. For our 1st time there, glad we did a guided tour. Next trip, do it on our own."}, {"username": "Jeff McLellan", "comment_text": "Train would be more flexible and likely enjoyable too."}, {"username": "Rebecca Branta", "comment_text": "Train and cinque terre pass will be your pace and style instead of doing exactly what a Tour wants. Super easy!!!"}, {"username": "Anna Buchan", "comment_text": "Book the 24hr ferry pass you can stop and get off at every town except corniglia. Beautiful from the water"}, {"username": "Renae Larcus", "comment_text": "Do it on your own so you can go at your own pace."}, {"username": "Laura DeCicco", "comment_text": "Do it on your own, that way you’re deciding what to eat and what you want to spend your time on. Get a CT card for units train is for the day.\n\nhttps://\nwww.cinqueterre.\neu.com/en/\ncinque-terre-car\nd"}, {"username": "Leah Naylor", "comment_text": "You do not need a tour guide for Cinque Terra. Very easy to navigate trains and inexpensive all around. Tours are worth it when there are crazy lines and history/ stories to add but not RH case with CT. Book only a boat tour if you have time but you’ll have a full day in an out and hiking to each town."}, {"username": "Phyllis Snyder", "comment_text": "Yes- I’m traveling solo next fall - traveling from Florence to CT by train- and will stay 4 nights sightseeing the 5 towns by boat & train."}, {"username": "Tracy Foss", "comment_text": "I booked a tour I feel that for the first time I have less personal navigation in a short time to worry about you get time in each place to yourself tours cost anywhere from $88 -350 per person from Viator depending on group size"}, {"username": "Blanca Gil", "comment_text": "I don’t like tours, too restrictive. I like to travel on my own."}, {"username": "Janeal Smith", "comment_text": "I was there this week with my tour group, it was a highlight of my trip! So beautiful in every way!"}]}, {"id": "2195975404134871", "text": "On many posts people always say comfortable shoes. I’d love to know which shoes are the best to take?\n\nThank you😊", "link": "facebook.com/groups/1373361046396315/permalink/2195975404134871/", "likes": 5, "comments": [{"username": "Renee Rundle Stoneham", "comment_text": "Tennis shoes.\nI like my Vionic Winnie white leather and look good with dresses etc…\nI don’t like athletic trainers with dresses or skirts just personal preference."}, {"username": "Kristen Winegar Knight", "comment_text": "Kristen Winegar Knight"}, {"username": "Vanessa Mathisen", "comment_text": "I bought a pair of Charix shoes, and, seriously they are worth they hype. I wear them every day, everywhere, no socks and I have walked 20K+ steps and feet don't hurt. I was a little wary at first because they seemed like they were too tight on my toes. Nope, they were just working themselves out around my foot. No blisters. No joke."}, {"username": "Monica Sucato", "comment_text": "Any type of shoes which allows you to walk confortably over uneven Terrain AND long distances....."}, {"username": "Jessica LaRose Cappuccia", "comment_text": "So many people suggested on clouds if you search previous posts. Just got mine other day for aug"}, {"username": "Bee Dub", "comment_text": "I wore the platform converse these past two weeks and had no issues."}, {"username": "Marisa DePalma", "comment_text": "Easy spirit walking shoes/sneakers are comfy"}, {"username": "Bonnie Loftspring", "comment_text": "ALL the men were wearing OC, on my trip. I love my SAS, open toed, very secured foot, which is very Very important. You should hv 2 prs day shoes, 1 supportive Sandal, 1 sneaker"}, {"username": "Tonsia Keytel", "comment_text": "Hoka’s."}, {"username": "Charmaine Tetkoskie", "comment_text": "I work Clark’s and Rykas over 20000 steps a day"}, {"username": "Carla Onofrio", "comment_text": "I wore my Taos sandals most of my trip."}, {"username": "Lee Say Lor", "comment_text": "The ones that u are most comfortable walking long distances in. Surely u have a pair. Nothing new that u have not broken in."}, {"username": "Kathy Tully Sexton", "comment_text": "I brought one Vionic mesh athletic type closed toe, one Ryka rubber slip on (for beach and wet days), one Merrill slip on and Vionic dressy sandal. Make sure you have one open back shoe. I have seen so many people with bleeding heels and rub marks. All of my shoes have different pressure/rub points and I alternate them every day. It’s so hot I’ve rarely worn the closed toe pair."}, {"username": "Heidi Littman Meiers", "comment_text": "It's soooo subjective .... people seem to love Birkenstocks , I hate them , etc"}, {"username": "Gina Rovello Keenan", "comment_text": "You really have to try on shoes and see what is comfortable for you. Brands work for some but not for others. I have probably close to a dozen pair of Skechers but would only take one pair of those to walk 10,000+ steps a day. Find a sporting goods store and try on to find comfort. Then break them in before you go."}, {"username": "Phyllis Snyder", "comment_text": "Truly is a very individual item- feet come in all sizes and shapes and issues. My bunion big feet seems only tolerate teva sandals! Tried other ones but always back to teva."}, {"username": "Maryanne Battistone", "comment_text": "It's what's comfortable for you...everyone'\ns feet are different"}, {"username": "Doris Boudreau", "comment_text": "I wore walking on cloud shoes to France and to Greece. Both trips we walk like 15+ km everyday and my feet did not hurt. I am buying a new pair for my Italy trip next year."}, {"username": "Cindy Breneman Hattrich", "comment_text": "I am taking good solid brooks ghost sneakers and treka sandals and loafers in august"}, {"username": "Janet Messanelli Bozzone", "comment_text": "I wear Vionics and BZees."}, {"username": "Jerry Lyubelsky", "comment_text": "My wife and I wore brooks ghost sneakers. Anything that you are used to walking in 10+ miles a day oh and on cobble stones up and down hills 😉"}, {"username": "Brian Osman", "comment_text": "What's comfortable for you walking a lot"}, {"username": "Dinh Nguyen", "comment_text": "For me, Crocs"}, {"username": "Donna Dillon", "comment_text": "I want to know the best no show socks"}, {"username": "Rhonda Wicks", "comment_text": "Hokas Bondi"}, {"username": "Nancy Amato", "comment_text": "Whatever are comfortable to you"}, {"username": "Joanna Humphrey", "comment_text": "Fit Flops"}, {"username": "Kayla Caras Prescott", "comment_text": "We have Ecco’s"}, {"username": "Jolene Morrow", "comment_text": "Flo jo flip flops, 15 days everywhere, including Capri, Pompeii and hiking around the city streets. Whatever is comfortable for you."}, {"username": "Ellen Edmonds-Wilson", "comment_text": "Everyone is different. For example, when it’s hot I find running shoes unbearable for all day wear. Soaking wet shoes you wear for days on end aren’t goo for your feet either. I took two pairs of walking sandals: Birkenstocks and a similar thick soled pair for walking on uneven surfaces. I alternated each day and both pairs were well worn before the trip this summer. I took a dressier pair of flats to wear at night as a break from the other two. I had a pair of Ecco soft 7s which I had worn on the plane when we left Australia because it was cold. I wore these the one day it rained for the month we were in Italy this June/July and then home this weekend. I didn’t get blisters or fungal infections and we walked kilomètres every day. My health app is telling me I’ve doubled the average number of stairs climbed as well as a 50 per cent increase in walking distance (I walk the dog for an hour a day at home so my average step count is quite high to start with). Make sure you don’t bring new shoes."}, {"username": "Jenn Messina Babore", "comment_text": "For me, sneakers."}, {"username": "Janet Walls", "comment_text": "Eccos are the best"}, {"username": "Elisha Lynn Simon", "comment_text": "Sorrels, Taos, ,Keen, Merrill’s, these have been to five countries. I would highly recommend."}, {"username": "Joe Guzzi", "comment_text": "Nike"}, {"username": "Graham Sherlock", "comment_text": "Skechers"}, {"username": "Delia Miscella Wroblewski", "comment_text": "Clark, Skechers, Teva"}, {"username": "Christine Aird Craig", "comment_text": "Joseph Seibel sandals"}, {"username": "Melissa Jane Brown", "comment_text": "Skechers"}, {"username": "Lucrezia Folger", "comment_text": "The ones you try on feel right, and break in. For me Berkinstocks."}, {"username": "Rosalia Nastasi", "comment_text": "Clark Cloudsteppers"}, {"username": "Laura McSweeney", "comment_text": "Bought these. Super comfortable and not chunky looking."}, {"username": "Robýn Kretsçhmər Schuchårdt", "comment_text": "Hoka"}, {"username": "Ruth Hackert", "comment_text": "Whichever ones are most comfortable for you…I like Sketchers and Merrill’s"}, {"username": "Letty Veronica", "comment_text": "Wore my Birk sandals and Birk Bend sneakers the whole time. No blisters. No issues."}, {"username": "Linda Snaring", "comment_text": "My Brooks running shoes, I don’t run any more and Skechers. I even wear my Brooks with a dress during the day."}, {"username": "Madeline Caporale", "comment_text": "The brand and style that fits you best and is comfortable for you. One brand does not work for all feet. Also depends on your price point. You will be trying on lots before you find YOUR perfect shoe. You will also want to break them in before you go, you will be literally walking miles each day in them on cobblestones, marble floors, and uneven, hilly terrain."}]}, {"id": "2195985694133842", "text": "Genoa from afar😍", "link": "facebook.com/groups/1373361046396315/permalink/2195985694133842/", "likes": 3, "comments": []}, {"id": "2195990370800041", "text": "If your on medication, do you need a doctors note and do they need to be in original bottles? Live in Canada", "link": "facebook.com/groups/1373361046396315/permalink/2195990370800041/", "likes": 0, "comments": [{"username": "Jenn Messina Babore", "comment_text": "No one ever asked or checked ours. Not sure about any narcotic type medications though."}, {"username": "Anita Grzeszkiewicz", "comment_text": "It's probably best to have a letter from your GP stating all medications, and ensure you keep your medications in it's original packaging and pack them in your carry on bag\nI always travel abroad as suggested above, never been asked for the letter, but I have been quizzed about my medications going through security at times (no issues, just the odd question what the liquid is or sharps are etc.) and I always have my medications on me if needed\nBetter to be safe, than sorry.... have a great trip 😊"}, {"username": "Kay Rendall", "comment_text": "From Au u do. If not, customs could confiscate or worse, not knowing what these drugs r same as anywhere in the world u arrive internationally\n."}, {"username": "Shannon Facette", "comment_text": "You should always travel with meds in original bottles. Having said that I don’t take a giant bottle of advil, I take an empty pill container. Don’t need a note. As long as it’s prescribed to you and I’m it’s bottle. It’s only a real issue with controlled substances."}]}, {"id": "2196000164132395", "text": "Seeking recommendations for where to stay( town and hotel) on Lake Como.", "link": "facebook.com/groups/1373361046396315/permalink/2196000164132395/", "likes": 7, "comments": [{"username": "Jamie A White", "comment_text": "Grand Hotel Cadenabbia is a lovely place, great views, restaurants close by, also the ferry point is a few hundred yards to travel across the lake."}, {"username": "Tamriko Chanishvili", "comment_text": "Belaggio Hotel Metropol"}, {"username": "Susie Steinle", "comment_text": "Bellagio… Hotel Du Lac or Hotel Bellagio"}, {"username": "Trevor Brown", "comment_text": "Airbnb Mandello del Lario"}, {"username": "Simone Pfenninger", "comment_text": "Albergo Milano, Varenna"}, {"username": "Jessi Leigh", "comment_text": "Following"}, {"username": "Renae Larcus", "comment_text": "Albergo Milano in Varenna!!!"}, {"username": "Letha Logan-Dardani", "comment_text": "Villa d’Este ! Amazing!"}, {"username": "Renee Rundle Stoneham", "comment_text": "We loved Varenna smaller and less touristy than Bellagio.\nWe stayed at Hotel Olivedo. It was fantastic, could ask for a better host, you feel like family. Wonderful breakfast included every morning.\nSit and watch all the day trippers coming to catch the ferry to Bellagio."}, {"username": "Sarah Campise Hallier", "comment_text": "https://\nwww.facebook.com\n/\ngrandhotelimperi\nale.lakecomo?mi\nbextid=LQQJ4d\n\nWe just got back from Lake Como. This was a fantastic hotel with wonderful service and a concierge desk that was so helpful. It was in Moltrasio- a small town on the western side. The ferry is a three min walk from the hotel and La Baia is a delicious restaurant. Walk up the Holy Steps to an adorable little piazza, church and restaurants where the locals hang out. Such a fun and relaxing location!"}, {"username": "Sandra Sowerby", "comment_text": "Baita Sorriso in Brunate.\nAmazing!!!!"}, {"username": "Pao Magnoler", "comment_text": "We stayed at an airbnb. It was amazing. You have an amazing view. You can park right down the street."}, {"username": "Billie Begley", "comment_text": "We just booked Hotel Eden in Simione."}, {"username": "Glenn Todd Webb", "comment_text": "Tremezzo-grand hotel Tremezzo"}, {"username": "Jenny Payne", "comment_text": "I’m going to lake Como and we are staying in Bellagio as I go every year and a young women I met in February who comes from Lecco said it was the best place to stay, have to train from Milan to Lake Como then ferry 🌻"}, {"username": "Jennifer Hauff", "comment_text": "We stayed at borgo le terrazze. Its cheaper than some of the other hotels mentioned but its a little farther from the town center, not really walking distance, but they have a shuttle that goes regularly to town. The views from our room (we stayed in the carlotta suite) were amazing, there was a large patio. We were in Italy for 3 weeks and this was the best hotel of our whole trip. I highly recommend!"}, {"username": "Sue Robinson Henry", "comment_text": "Bellagio at Villa Serbollini"}, {"username": "Nancy Gottesman Mann", "comment_text": "We just left the Hotel Royal Victoria in Varenna and loved it! Breakfast and rooms were amazing, so was the location!"}]}, {"id": "2196000377465707", "text": "Has anyone purchase a one way ferry ticket and was able to change the ticket to an earlier time or later time? And is there a big difference between purchasing it from one site to another?", "link": "facebook.com/groups/1373361046396315/permalink/2196000377465707/", "likes": 0, "comments": [{"username": "Jenn Messina Babore", "comment_text": "What ferry?"}]}, {"id": "2196009254131486", "text": "We just returned home from an amazing 3 weeks in Italy. We have 2 daughters, age 12 & 14. I can’t say enough about our 2 day private tour italy with Marco. He was referred to us by a friend. He was soआणखी insightful, energetic and knowledgeable. Highly recommed! We were in Venice, Tuscany, Rome & Puglia if you have any questions.", "link": "facebook.com/groups/1373361046396315/permalink/2196009254131486/", "likes": 2, "comments": []}, {"id": "2196012544131157", "text": "For anyone who doesn’t know, all flight to and from catania airport are suspended due to a fire at the airport. We only found out this morning as we were waiting to check in. Flew Naples to Rome and then Rome to palomo then a 3 hour bus ride to catania. Unfortunately our luggage did not make the flight with us and is stuck in Rome. we got to hotelआणखी 17 hours later and the whole day in Sicily was gone.\nJust found out our flight from catania to Milan tomrrow morning is also cancelled and currently stranded with no luggage and no info on flights tomrrow\nSuch a great time 😂", "link": "facebook.com/groups/1373361046396315/permalink/2196012544131157/", "likes": 8, "comments": [{"username": "Vicky Hall-Newman", "comment_text": "I hope you manage to still make the most of your holiday. Palermo fly to Milan. I know it means another 3 hour journey but hopefully it will work for you. Have a great time."}, {"username": "Tracy Reilly", "comment_text": "Ah, living La Dolce Vita.\nHopefully smooth sailing after this hiccup"}, {"username": "Delia Miscella Wroblewski", "comment_text": "I’m very sorry. I would be devastated. I hope it goes uphill from here on out!"}, {"username": "Kay Jenkins", "comment_text": "check out the fantastic market for quick cheap fix clothes"}, {"username": "Maria Grazia Rizza Costanzo", "comment_text": "I believe there may flights out of Comiso"}, {"username": "Giorgio Zanichelli", "comment_text": "sorry for your luggage but who goes to sicily for one single day? that's borderline insanity"}, {"username": "Starla Dawn", "comment_text": "I was so fortunate to not have a single late flight out of 8 last month. I’m so sorry this is happening a lot lately."}, {"username": "Merida Laughlin Carrabba", "comment_text": "How long will flights be affected? We fly out of there to the USA on 8/1."}, {"username": "Brad Beckett", "comment_text": "It's unacceptable that baggage isn't loaded yet they decide to push back and take off. Make sure to look up EU rules on compensation and make sure to claim any due to you."}, {"username": "Tanya Bitar", "comment_text": "Be safe!"}]}, {"id": "2196017190797359", "text": "Going to Italy for 8 nights and spending 4 nights in Tuscany. (We can rent a car for 2 of those days if we stay in the countryside. )\n\nWould it make sense to stay in Florence walking distance to everything 2 nights and then stay countryside villa the other 2 nights (and rent a car for those 2 days) We want to experience downtown Florence but also explore the countryside.\n\nWould this feel too rushed to move hotel/airbnbs after 2 nights? Any experience with this?", "link": "facebook.com/groups/1373361046396315/permalink/2196017190797359/", "likes": 0, "comments": []}, {"id": "2196023877463357", "text": "Hello everyone!\n\nStaying in Milan for one day on Saturday. Could you please suggest a nice restaurant for dinner somewhere in the center. There are six of us and we all love a good authentic food. No need for trendy upscale place. TIA for your suggestions.", "link": "facebook.com/groups/1373361046396315/permalink/2196023877463357/", "likes": 0, "comments": []}, {"id": "2196027200796358", "text": "If we land in FCO at 0815 am, just curious of a ballpark time to get my checked bag, and be ready to catch the Leonardo express? Does that train need to be prebooked?? I then need tickets for a fast train to Naples to then transfer to Sorrento. I do want to prebook that, but I’m just trying to figure out a time frame to know what time I should aim for? Thoughts?", "link": "facebook.com/groups/1373361046396315/permalink/2196027200796358/", "likes": 0, "comments": [{"username": "Jenn Messina Babore", "comment_text": "Assuming your flight is on time, you need to clear customs and get to the train. You don’t need to book the Leonardo tickets in advance, but depending on how many of you there are a taxi may be less expensive. I would budget 2-3 hours just to be safe.\n\nI’d also suggest booking a changeable fare for Naples/\nSorrento in case of any changes above."}, {"username": "Bambi Harris", "comment_text": "How long did it take you to get through FCO? we have to book a train from rome termini to naples right after too"}]}, {"id": "2196030187462726", "text": "Hi,\n\nMy son (12yo) and I are travelling next week to Rome for 5 days.\n\nWe’ve got the following booked, doing 1 place per day:\n\nCatacombs\nVatican City\nPompeii\nColosseum, Roman Forum, Palatine hill and trevi fountain.\n\nAre there any other places that would be recommended to see/do? Any other must do’s whilst we’re there?\n\nThank you 😊", "link": "facebook.com/groups/1373361046396315/permalink/2196030187462726/", "likes": 2, "comments": [{"username": "Jenn Messina Babore", "comment_text": "It will be a lot to do especially with the heat. I think you’ve covered the main things to see and do. Pompeii is a bit of a hike from Rome - it is closer to Naples. For the major sites in Rome, you might enjoy a gift cart tour to see them."}, {"username": "Dave Colleen", "comment_text": "We did a night golf cart tour with bigatours.com. Jason was great and we loved seeing the sights at night lit up."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Galleria Borghese and gardens!\nIf you are into churches (that are almost museums!) don’t miss Santa Maria in Trastevere, San Giovanni in Laterano, Santa Maria del Popolo and San Luigi dei Francesi, the + is that they are quite fresh inside!"}, {"username": "Dana Green", "comment_text": "Borghese Gallery, Pantheon, and Victor Emmanuel Monument are all wonderful."}, {"username": "Eric Maurer", "comment_text": "This was one of my kids' favorite things https://\nmaps.app.goo.gl/\nm76QV6NtyqE2Qw1u\n8"}, {"username": "निनावी सहभागी", "comment_text": "Thank you for all your suggestions, there’s certainly a few there we hadn’t thought of, you’ve all been really helpful 😊"}]}, {"id": "2196033890795689", "text": "We will be traveling to Italy for the first time at the end of February. I’m currently looking at hotels in Rome. We will be there for 3 nights before heading to Florence. Does anyone have any personal experience with any of the following three options, mostly in regards to location and cleanliness?\n\nDamaso Hotel\nSanta Maria Hotel\nHotel Campo de Fiori\n\nThank you for any input!! 😃", "link": "facebook.com/groups/1373361046396315/permalink/2196033890795689/", "likes": 0, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2196036507462094", "text": "Looking for recommendations for a Tuscany winery day trip from Florence. Not sure if we should do half day or full day - welcome all suggestions! Need transportation and can book through a third party.", "link": "facebook.com/groups/1373361046396315/permalink/2196036507462094/", "likes": 0, "comments": []}, {"id": "2196038644128547", "text": "Gardaland Resort & theme park has anyone been to give some feedback please 😀", "link": "facebook.com/groups/1373361046396315/permalink/2196038644128547/", "likes": 0, "comments": []}, {"id": "2196038664128545", "text": "Hi All\nWe want to do a short break to Italy in October,I would love to either visit Portofino or Cinque Terre but which airport is closest? Alternatively we were thinking of flying into Verona and going to Lake Garda…I’ve not been to Italy so any advice would be very much appreciated.\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2196038664128545/", "likes": 5, "comments": [{"username": "Kerry Laux", "comment_text": "Verona and Lake Garda!"}, {"username": "Angelina McConnell", "comment_text": "How much time do you have?\nWhat do you want to see most (coast or lake)?\nThis is an awfully personal question to ask - what do YOU want to see and experience most?\nFor the airport question - google it."}, {"username": "Amy Lonergan Ryan", "comment_text": "Fly into Genoa or Milan airports. Portofino is magic. We flew in and out of Milan and spent 4 nights in a town called Rapallo and visited both Cinque Terre and Portofino. Would recommend looking at staying at Santa Margherita Ligure as a great base to do both. Portofino had way more wow factor for me personally. Then we drove up to Lake Como which was just under a 3 hour drive. We really wanted to experience both lake and coast and so glad we did both. A week was perfect"}, {"username": "Giorgia Petraia", "comment_text": "Milan airports are hours and hours train from Cinque Terre, try to land in Pisa if there’s a flight"}, {"username": "Lucy Thornton", "comment_text": "Verona is amazing"}, {"username": "Virgz Van Møøre", "comment_text": "Lale Garda for sure, 5 T are very small, the only interest is hiking if all the paths are opened"}, {"username": "Denise Shea", "comment_text": "Fly to Genoa. There’s a shuttle to the train station about ten minutes away from where you can get a train 😊"}, {"username": "Patricia Yeates", "comment_text": "Visited Cinque Terre twice, flew into Pisa from Dublin, stayed in Pisa, great train connections to Cinque Terre, Florence. Also did fab tour of Tuscan vineyards and villages. Pisa is a beautiful city to stay in, very small and easy to get around."}, {"username": "Elizabeth May La Duca", "comment_text": "Google Maps/directions"}, {"username": "Steph Craddock", "comment_text": "Pisa or Genova (especially if you're in UK) then train direct to Santa Margherita. I advise staying there then walking/ ferry/ bus to Portofino. Camogli or Sestri Levante are worth visiting too"}, {"username": "Cinzia Bonciani", "comment_text": "If you’re a coast person, I would recommend flying to Nice from the UK and taking in the entire Italian Riviera. Nice to the first Italian border town of Ventimiglia is about 40km away. Depending on how long you have you can drop into Monaco and Menton before that. From Ventimiglia you can continue all the way along the coast to some of the most beautiful Italian coastal towns you will ever see (San Remo, Imperia, Diano Marina) There are amazing places in the hinterland here as well such as the town of Dolce Acqua. If you can afford a car, I would hire one from either Nice or Ventimiglia and drop it off at your final destination in Italy in Como for example."}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "Loved all, especially in October. Think about Camogli with day trip by boat (or hike) to remote San Fruttuoso and Portofino. Walk the scenic (and easy) coastal path to San Margarita and train back to Camogli.\n\nWe loved Lake Garda and rented bikes to ride along river to magical fairytale medieval villages.\n\nAbove all…Cinque Terre (especially Vernazza) has our hearts. Hike the trail between towns and take boat to Portovenere for a lovely day trip.\n\nFlorence airport is best option for coastal towns mentioned."}, {"username": "Robin Burrell", "comment_text": "Portofino and Cinque Terra are fairly close together"}, {"username": "Simone Pfenninger", "comment_text": "Pisa or Genova"}, {"username": "Annette Fordyce", "comment_text": "We usually fly in to Milano, and take a straight shot train in to Levanto. It’s less than 15 minutes by train from Levanto to Cinque Terre, and about half an hour from Portofino. Levanto itself is worth a visit. It’s beautiful and less crowded and makes a good base for 5 Terre."}, {"username": "Miyuki Kanno Paul", "comment_text": "Genova"}, {"username": "Anna Buchan", "comment_text": "Cinque terre is beautiful. Not sure on distance for you though. Train station is very easy to use from city to city."}]}, {"id": "2196039047461840", "text": "Tagliatell in black ink with cockcles. Too good !!!", "link": "facebook.com/groups/1373361046396315/permalink/2196039047461840/", "likes": 3, "comments": []}, {"id": "2196039964128415", "text": "Forgive me, but I think I read recommendations for hotel Santa Maria in Trastevere. Have you stayed and do you recommended?", "link": "facebook.com/groups/1373361046396315/permalink/2196039964128415/", "likes": 0, "comments": []}, {"id": "2196041860794892", "text": "Going to be at Lake Como/Bellagio - Fri, Sat, Sun. Extending a work trip. Would love recommendations on restaurants and best excursion if you could only do one! No car. TIA!", "link": "facebook.com/groups/1373361046396315/permalink/2196041860794892/", "likes": 1, "comments": [{"username": "David Fidgeon", "comment_text": "From Bellagio you can visit all the main towns/sites by ferry. For restaurants follow the locals or where looks good !"}, {"username": "Renae Larcus", "comment_text": "In Varenna we stayed and dined at Albergo Milano. Right on the water, eat on the deck. Excellent."}, {"username": "Virgz Van Møøre", "comment_text": "Go to villa Balbianello, villa Cipressi, villa Monastero"}]}, {"id": "2196046134127798", "text": "Any good gluten free restaurants in Verona and Venice ? We have found a few online but just joined this group and thought I’d ask! Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2196046134127798/", "likes": 0, "comments": []}, {"id": "2196045597461185", "text": "Has anyone taken the scenic train from Domodossola to Locarno? Did you reserve tickets?", "link": "facebook.com/groups/1373361046396315/permalink/2196045597461185/", "likes": 0, "comments": [{"username": "Erika Huber", "comment_text": "This is not a busy line, about 2 hours trip. Don’t think you have to book a seat."}]}, {"id": "2196055627460182", "text": "Hey everyone! Is it okay to have the ac going while there is a thunderstom outside?🥵we are trying to sleep but it is so hot in the room. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2196055627460182/", "likes": 0, "comments": []}, {"id": "2196057427460002", "text": "Planning my trip for next June. Looking for recommendations for hotels in moderate price range for Venice, Milan, Sorrento, Forlimpopoli and starting in Zurich Switzerland. Thanks in advance", "link": "facebook.com/groups/1373361046396315/permalink/2196057427460002/", "likes": 0, "comments": []}, {"id": "2196058287459916", "text": "I'll be spending 4 nights in Florence. How easy would it be to do a day trip to Venice? Any tour companies besides Viator that anyone could suggest?", "link": "facebook.com/groups/1373361046396315/permalink/2196058287459916/", "likes": 0, "comments": [{"username": "Jenn Messina Babore", "comment_text": "As long as there isn’t a strike planned, it is doable. It’s about 2:20 by train (each way), so go early and leave late."}]}, {"id": "2196064284125983", "text": "Looking for airfare direct from\nBoston to either Rome or Milan. What’s your go to airline? Thx", "link": "facebook.com/groups/1373361046396315/permalink/2196064284125983/", "likes": 1, "comments": [{"username": "Kate Glenn", "comment_text": "United"}, {"username": "Peter Doyle", "comment_text": "United"}, {"username": "Nina Halley", "comment_text": "We did ours through delta vacations and are on ITA, I think that will be your best bet"}, {"username": "Kimberly Pex", "comment_text": "Delta or airfrance"}, {"username": "Jo Jo", "comment_text": "Does anyone use American?"}, {"username": "Ilene Tobey LaMalfa", "comment_text": "Delta worked fine for us. going to Rome. Just got back."}, {"username": "Stefania Carmosino Spas", "comment_text": "Thanks everyone. Planning on next summer. Haven’t been since before Covid and used to fly Alitalia."}, {"username": "Michele Liggett", "comment_text": "United but have also used delta"}, {"username": "Marissa Wilson", "comment_text": "I flew ITA direct from Boston to and from Rome in April. No issues, everything on time, etc."}, {"username": "Diane B Gorman", "comment_text": "We did airline reservations on booking.com."}, {"username": "Jenny Frank", "comment_text": "Emirates from Newark to Milan"}, {"username": "Jay Parekh", "comment_text": "Delta and ITA are the only direct from Boston to Rome. Use Google Flights to see and filter for nonstop."}, {"username": "Giovanni Caligula", "comment_text": "United"}, {"username": "Sabrina Sofia", "comment_text": "Stef\nI believe delta helps ITA in the summertime.\nWhen I booked my trip delta was a little more expensive and didn’t have the same about of flights as ITA had."}, {"username": "Peter Cetani", "comment_text": "I won’t go with ITA"}, {"username": "Karen Adams", "comment_text": "United"}, {"username": "Sandi Van", "comment_text": "Delta"}, {"username": "Lisa Valdovinos", "comment_text": "United was good."}, {"username": "Frank Pallante", "comment_text": "Delta"}, {"username": "Allison Tumbarello", "comment_text": "DELTA!!"}, {"username": "Felicia Macchia", "comment_text": "If you do Milan, see if Emirates flies direct from Boston!! Ive used them leaving from NY and liked them"}, {"username": "Kasia MacDuda", "comment_text": "Just came back from Italy with Air France. Milan to Jfk. Excellent airline."}, {"username": "Margorie Madrid", "comment_text": "I just came back from Italy and I used Air Canada. It was really nice. it’s cheaper to fly to Milan than Rome though. I had to fly to Rome and it was more expensive than Milan. 😒"}, {"username": "Diane Petonito Giordano", "comment_text": "American 🇺🇸 airlines just came back from Italy & yes we had 1 stop over not a long one. But flights were great."}, {"username": "Jessica Ferriero", "comment_text": "Delta was great!"}, {"username": "Linda Santucci Fries", "comment_text": "Turkish. Excellent service at a great price."}, {"username": "Charmaine Tetkoskie", "comment_text": "We flew from JFK on Emirates. Great experience"}, {"username": "Miyuki Kanno Paul", "comment_text": "During the Mediterranean cruise season, FCO flights will be loaded with cruise ship people!"}, {"username": "Larry Reinier", "comment_text": "Emirates business to or from Milan"}, {"username": "Venere Tagliente", "comment_text": "Do you go in Italy?"}, {"username": "Jordan Schmale", "comment_text": "Delta One"}, {"username": "Karen Nowak Jellow", "comment_text": "Delta"}, {"username": "Ted Kostisin", "comment_text": "Currently, I believe you only have one option for a direct flight, Delta."}, {"username": "Stephanie Smith", "comment_text": "Lufthansa BOS-FCO"}, {"username": "Danielle Johnston", "comment_text": "Try Norse"}, {"username": "Sharon Menegoni", "comment_text": "Delta!"}, {"username": "Theresa Salerno Adams", "comment_text": "Delta"}, {"username": "Joanna Campbell", "comment_text": "Delta or ITA are the only direct flights from Boston to ROME, at the moment. Not sure about Milan"}]}, {"id": "2196073570791721", "text": "For all of you with cancelled tickets to the Coloseum, or not able to get tickets, there is now an investigation into the issue", "link": "facebook.com/groups/1373361046396315/permalink/2196073570791721/", "likes": 0, "comments": [{"username": "Jenn Messina Babore", "comment_text": "The cancelled tickets are due to the tour companies they are investigating. They over promise and under deliver. I’m not sure if there is a way to stop others from using bots, but with limited tickets to certain tours (e.g. 25 tickets to a night tour of the underground), I do hope they find a way to help tourists get tickets without having to pay exorbitant tour company prices."}]}, {"id": "2196075554124856", "text": "Venice-\nAre water shuttles on strike? We arrive tomorrow and I read something about it. Need to get to Murano", "link": "facebook.com/groups/1373361046396315/permalink/2196075554124856/", "likes": 9, "comments": [{"username": "Tanya Bitar", "comment_text": "I’m going in today. I’ll keep you posted if someone doesn’t respond."}, {"username": "Nicole Condemi", "comment_text": "I’ve just left, been there the last two days. Didn’t see anything suggesting a strike."}, {"username": "Jim Bobrowski", "comment_text": "I saw something posted yesterday by the train station at an office near the side of the station. Believe it was for tomorrow but I don't know who was striking. A man was talking to our porter about it but I don't speak Italian"}, {"username": "Jim Bobrowski", "comment_text": "I don't see anything listed here though.\nhttps://\nwww.commissioneg\naranziasciopero\n.it/\ncalendario-sciop\neri"}, {"username": "Jenn Messina Babore", "comment_text": "Strike planned for tomorrow, July 21 🙈"}, {"username": "Ellen Edmonds-Wilson", "comment_text": "Vaporetto are on strike on Friday. You can pre book a water taxi but it will be expensive."}, {"username": "Danielle Johnston", "comment_text": "No I’m here now"}, {"username": "Eric Maurer", "comment_text": "We are heading that way now, I'll try to ask around"}, {"username": "Claire Dowson", "comment_text": "Just left this morning. There were strike signs at Murano. I can’t see every boat not working. When the trains strike, there is a more limited service, so hopefully like that. The city would grind to a halt without the water shuttles/\nferries."}, {"username": "Dana Golden", "comment_text": "Yes. There is one tomorrow (Friday)"}, {"username": "Nick Justason", "comment_text": "Hope this helps, when checking in lastnight this sign was up (I’m in Venice)"}, {"username": "Jessica Nichols", "comment_text": "Darn! We get there this afternoon. Tomorrow was our only FULL day 😞"}, {"username": "Elaine C. Macalolooy", "comment_text": "We are here in Venice and nothing has changed."}, {"username": "Rachel Gray", "comment_text": "Does this also mean the larger train system as well? (Trenitalia) I have pre-purchased tickets so curious how we may be impacted. And do they give automatic refunds in the event of impact?"}, {"username": "Kathy Tully Sexton", "comment_text": "Our hotel arranged a private tour to Murano and the glass factory picked us up in their private boat. Even if we didn’t buy a thing the tour was free. Since we bought a vase they took us to Burano and then back to Venice."}, {"username": "Sandra Desmond", "comment_text": "I bought gorgeous murano glass rings they were so cheap I never got to go to murano itself suppose to be fabulous maybe next time"}, {"username": "Jessica Nichols", "comment_text": "Staying in Murano. This was up at our hotel today."}, {"username": "Melissa Feielin Hawkins", "comment_text": "Was in Venice earlier this month. The Water shuttle is absolutely the most miserable experience . You are packed in so tight its unreal, you seriously can not move and are a$$ to elbow with hot, humid, sweaty stinky humans 🤢. We got off the very next stop and said forget that. Trip advisor has boat owners you hire, as does the get my boat app, and we fell in love with the private water taxi."}, {"username": "Virginia Whitelaw", "comment_text": "Some boats run very early in the morning & at the end of the day! Most of the day there will be no vaporettis! I discovered this when I tried to buy a boat pass for a few days & the ticket seller informed me about the strike!"}, {"username": "Lisa Komarec", "comment_text": "We are here now and no issues today!"}, {"username": "Renee Dillenbeck", "comment_text": "Does anybody know if it’s too cold to take these boats to the islands in late October/early November? I’m coming and want to go."}, {"username": "Jessica Chiu", "comment_text": "Strike in progress!!"}, {"username": "Daneda Russ", "comment_text": "ACTV is striking today. Limited service. We were told some essential service is always guaranteed to the islands, but not convenient for day tripping tourists. Made it to Murano for a short visit but were told no boats from Burano would be offered after 15:30 so we returned to Venice just to make sure we could get back to our hotel. Fridays are strike days, so hopefully all back to normal tomorrow."}]}, {"id": "2196077100791368", "text": "I have been invited to a wedding in Siena and would love any suggestions for a hotel, restaurant and what to do while there. We will have 2 or 3 extra days to spend there!", "link": "facebook.com/groups/1373361046396315/permalink/2196077100791368/", "likes": 0, "comments": []}, {"id": "2196081780790900", "text": "Has anyone ever taken a night ferry from Igoumenitsa to Ancona? Curious what to expect.", "link": "facebook.com/groups/1373361046396315/permalink/2196081780790900/", "likes": 0, "comments": [{"username": "Maria Brozou", "comment_text": "You will need a light jacket"}, {"username": "Anita Downey", "comment_text": "Have taken night ferry from Croatia to Ancona and it was great."}]}, {"id": "2196090040790074", "text": "How much did you spend in food for each person per day? It's just me and my husband going and we're trying to calculate in our budget how much we may spend in food.", "link": "facebook.com/groups/1373361046396315/permalink/2196090040790074/", "likes": 12, "comments": [{"username": "Maria Ariano", "comment_text": "In Italy? Be advised that prices vary from north to south, sometimes a lot. Also, personal diets and eating habits vary as well... for example, I am very frugal and eat simple foods; others may dine on oysters and champagne 🙂"}, {"username": "Dottor Peppe Insigne", "comment_text": "Dipende dalle città che visiti"}, {"username": "Jennifer Rix", "comment_text": "We spent around £800 for 3 days"}, {"username": "Julia Muller", "comment_text": "Big cities you will spend more, smaller/remote towns a lot less. Coffee in St Marks Square can be around 10Euro, but in Monopoli 10 days ago it was about 3. Most dinners in a standard place (ie certainly not high end) you could expect a main to range btwn 25-40Euro, depending on what you order. Again, in less mainstream/\nbusy spots that reduces to maybe 15-25.\nWe rent apartments when travelling so we can at least have breakfast at home, saves quite a bit over a month of travel to just have a bowl of cereal and some fruit, or some toast etc, at home."}, {"username": "Frank Hunt", "comment_text": "$20 per day for 2 when cooking your own food with the beautiful Italian produce……."}, {"username": "Wendy Bevan", "comment_text": "In our hotel when you have a drink you get nibbles and found this everywhere so didn’t need dinner"}, {"username": "Dave Colleen", "comment_text": "Depends. We had free breakfast each day. Free water with refillable bottle. Focaccia sandwich between 5 and 10 € for afternoon snack. Dinner about 70€ with bottle of wine. We did pay for cold water usually 1€ to 1.5 €a bottle. It was over 100 degrees in Rome"}, {"username": "Kylie Paine", "comment_text": "My daughter's just done Paris and Rome hasn't paid any more than 30€ for a 3 course meal"}, {"username": "Monique Swanner", "comment_text": "50-80 euros per day for my husband and I. We usually only did two meals a day and I tried to book places with free breakfast"}, {"username": "Sally Warren", "comment_text": "We spent about €20-30 each for dinner out. You can easily eat take away lunch for €5-10 each.\nA great option for lunch is to go to local supermarket and have the deli section make you a panino.\nWe stayed in mostly Airbnbs where we could easily cook meat or fish from markets or supermarket and serve with a fresh salad.\nBreakfast is café €1-2 and a brioche for €2.\nSome supermarkets have an amazing array of prepared food available in the deli section. Eg seafood salad, parmigiana and cannelloni or lasagne."}, {"username": "Virgz Van Møøre", "comment_text": "How much do you eat ? 😂"}, {"username": "Monica Colontonio Macho", "comment_text": "We spent just on meals about 35 to 40 euros for each meal per person. We stayed in airbnb so we made our breakfast in the mornings. We did one big meal a day and in between we did take away or street food. There are no combination meals so you order prima, secondo, etc separately and some places charge for sharing a plate. Of course you have to add glasses or bottle of wine."}, {"username": "Rebecca Branta", "comment_text": "Rome was the most expensive city so the Same style of pasta that we got in Florence was $9euro and $15 euro in Rome. Same with drinks. We still spent about 100-150 a day."}, {"username": "Allan Olexa", "comment_text": "We buy wonderful Italian groceries and street market produce to prepare our own fantastic meals in our Airbnb. We do get take away entrees too. Our food budget is quite modest."}, {"username": "Sedalise Hernandez", "comment_text": "Around 100 Euros, we did do food tours a couple days and those days we spent more"}, {"username": "Janet Messanelli Bozzone", "comment_text": "All depends on what and where you want to eat. 🤷🏼‍♀️"}, {"username": "Debbie Potter", "comment_text": "Thank you all... everyone was helpful"}, {"username": "Sharon Eilerman Post", "comment_text": "Can you bring your own water bottle in a restaurant and drink it with your meal?"}, {"username": "Connie Wilson", "comment_text": "Certainly what helps is to reserve accommodations that offer free breakfast. We are not foodies so we were perfectly happy with a pasta dish and salad or vegetable side. It also depends where you are visiting, as prices can fluctuate. That being said, we probably spent $50-75/day with two nice meals and beverages."}, {"username": "Anne Sarno-mcilwrath", "comment_text": "Under 200 a day for both of us."}, {"username": "Rachael Richardson", "comment_text": "Don’t worry about food , it’s drinks you spend money on !\nGo to the back streets much cheaper even in Rome"}, {"username": "Navreen Mandair", "comment_text": "Depends what area you are going to"}, {"username": "Jessica Nichols", "comment_text": "Depends on where you go. We just had an amazing dinner in Milan. Here’s the menu so you can get an idea on prices. The tourist traps are super pricey but the local ones are super inexpensive and absolutely delicious"}, {"username": "Andrew Mircovich", "comment_text": "$50 to $75 Euros per day per person and you will enjoy great meals"}, {"username": "Lisa Kelly", "comment_text": "You can really do it for as little as $40-50 up to $150. Depends on your eating style."}, {"username": "Graham Sherlock", "comment_text": "Depends where you are and what you eat, a brekkie for 2 can be 10euro, lunch 25 euro, dinner 40 - 80 euro"}, {"username": "Beatriz Davalos Moreno", "comment_text": "I am here right now and we are spending an average of 75 to 100 euros per day per person. We do like eating out and at nice places. By there is a lot of kind fast food places but not really fast food just a more informal kind of place where you can eat cheaper and still delicious. Everything is very expansive here!"}, {"username": "Amy Clyne Wells", "comment_text": "I have a travel planner helping me with some logistics and for 2 of us she recommended a $200/day budget average. This is for NO COOKING (other than a cooking class), nice evening meals and the coffees, gelatos, etc we’ll pick up throughout the day. That said, I’m completely aware this can be done for MUCH less but perhaps this gives you an idea based on advise from an expert who is helping plan a trip for foodies who won’t be cooking. Sounds high to me too but hey… I’ve never been there. The cool thing about food budgets on a trip is that you can control it to meet your travel goals for a particular trip. Hope this gives you a reference point for what you are planning. Enjoy!"}, {"username": "Renee W Gable", "comment_text": "40euro a day. each approximately"}, {"username": "Rachael Richardson", "comment_text": "Depends of breakfast included in your stay ?\nIf not\nBreakfast of pastry / coffee €5 each\nLunch €5-10 each\nDinner €20-30 each depending on drinks\nOther drinks throughout the day €10 each\nBring a refillable water bottle to use at the fountains\nThis is eating in the cheaper but just as tasty restaurants ! Look down the backstreets , look at reviews on line"}, {"username": "Karon Patterson", "comment_text": "We spent about $200 Aus per day not including breakfast"}]}, {"id": "2196092310789847", "text": "Recommendations for wineries in sorrento surrounding area? Also… yes or no to food-making experiences? If yes- which ones? Sorrento area please.", "link": "facebook.com/groups/1373361046396315/permalink/2196092310789847/", "likes": 0, "comments": []}, {"id": "2196096160789462", "text": "I just got back from Italy. I got a few pieces in Murano - but now I wish I got more. Has anyone ordered from https://www.originalmuranoglass.com/?", "link": "facebook.com/groups/1373361046396315/permalink/2196096160789462/", "likes": 3, "comments": [{"username": "Sonia Frost", "comment_text": "Wow what stunning pieces thanks for sharing this site"}, {"username": "Joyce Blackburn", "comment_text": "Are the prices on this site same as in Murano?"}, {"username": "Debbie Vitale", "comment_text": "I won't be in Murano but I've heard you can get it in other cities. I've also heard to be careful that it may not be authentic murino glass. Is there a way to know for sure?"}]}, {"id": "2196104360788642", "text": "Hello! Will be in Rome this September and we were hoping to find a nice town along the coast we can visit for a little R&R at the end of our trip.\n\nWe would be available to leave Rome Saturday morning and have to be back on Monday morning to the Rome Airport around 10:30 am to catch our flight back home.\n\nDoes anyone have any recommendations forआणखी something we can quick trip to, via fast train, etc. ideally somewhere we can hang out by the beach but also a place that also has a bit of a town to explore food, desserts, coffee, little shops..\n\nTotally feel free to let me know if all of this is too much to ask for a 2 day trip to the coast and back 😅\n\nWe are first timers and needing help with some ideas please!", "link": "facebook.com/groups/1373361046396315/permalink/2196104360788642/", "likes": 0, "comments": [{"username": "Jenn Messina Babore", "comment_text": "Positano is beautiful if you can find a place that doesn’t break the bank."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2196108890788189", "text": "What is the app called for share taxis with people to work out how much it costs each", "link": "facebook.com/groups/1373361046396315/permalink/2196108890788189/", "likes": 0, "comments": []}, {"id": "2196111557454589", "text": "Has anyone stayed at Agriturismo Bocaleno? Looking for some help. I am trying to get more info regarding availability and cost but have sent emails and messages via What's App and haven't had a response. Short of phoning which is difficult on this side of the pond.\n\nThis is a key point in planning our trip. Other locations respond very quickly!🤷‍♀️", "link": "facebook.com/groups/1373361046396315/permalink/2196111557454589/", "likes": 0, "comments": []}, {"id": "2196124527453292", "text": "I have been following this group for the past 9 months and just came back from a two week amazing vacation in Italy/ Sicily. I wanted to share the 3 Airbnb’s that we stayed in because I know how uneasy it can be to book one in another country. And because my experiences with all three were fantastic, I felt this would be one of the small ways I could give back to the group with a real personal reference for the Airbnb’s. Basically as a thank you for all I got out of the group.\n\nRome:\nSonder property- Piazza Venezia- 3 bedroom 3 bathroom renovated apartment. Book directly through Sonder for best rate. Fantastic for families with teens! Great location and has a lift. Has washer/ dryer combo.\nLink: https://www.sonder.com/destinations/rome/rom-cors292-2a/c34347\n\nFlorence:\n3 bedroom 3 bathroom apartment. Right near Duomo area. Fantastic place! All new/ modern and immaculate. Perfect for a family of 5 with teens or 2 couples. Bigger and better than the pics. Alberto the host was phenomenal. Super attentive and responsive. He even provided coffee, tea, etc. Has a washer/ dryer combo.\nLink: https://abnb.me/WO8VhCRFzBb\n\nVenice:\n3 bedroom 3 bathroom apartment. Very clean. Perfect for a family. All modern and great location. Host was great. Has washer and dryer.\nLink: https://abnb.me/pEgHqSaGzBb", "link": "facebook.com/groups/1373361046396315/permalink/2196124527453292/", "likes": 2, "comments": []}, {"id": "2196172407448504", "text": "I will be traveling with my wife and three kids ages 6-10. We will be dropping a rental car at Florence airport and need to make our way to the train station. What is the best way to get to the train station from the airport?\n\nOnce in Naples, we have to get to an Airbnb that’s about a 25 min walk. Seems too far with luggage. Again, what would be the best way to get from point A to B once in Naples? Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2196172407448504/", "likes": 0, "comments": [{"username": "Jenn Messina Babore", "comment_text": "Personally I would take a taxi."}]}, {"id": "2196130830785995", "text": "We hit the heatwave in Florence last week although much worse now, but still got to appreciate the art, architecture, food and people of this beautiful city that is the cradle of the Rennissance!", "link": "facebook.com/groups/1373361046396315/permalink/2196130830785995/", "likes": 128, "comments": [{"username": "Joan Scott", "comment_text": "Beautiful pictures… I’m so excited to see all of them! We’ll be there next week."}, {"username": "Reese Colmenares", "comment_text": "Stunning photos"}, {"username": "Julie Sanfilippo Stroud", "comment_text": "Beautiful pictures!"}, {"username": "Jo Ann Ciuffini Forcino", "comment_text": "Thanks for sharing!!Beauti\nful pictures! Were they taken with a phone or regular camera?"}, {"username": "Linda Chung Maloney", "comment_text": "Amazing pictures, so beautiful"}]}, {"id": "2196136807452064", "text": "Hello, do you have tips to identify tourist traps? Activities and food\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2196136807452064/", "likes": 0, "comments": []}, {"id": "2196132104119201", "text": "Can you make a 11:50 am flight in Rome from the cruise port?", "link": "facebook.com/groups/1373361046396315/permalink/2196132104119201/", "likes": 2, "comments": [{"username": "Sal Facciponti", "comment_text": "Depends what time you leave the port."}, {"username": "Jenn Messina Babore", "comment_text": "It’s possible but needs to make sure everything happens to plan. I would plan on an early disembarkation time (7am). Preschedule your taxi (7:30). It’s about an hour from port to airport. That gives you the 3 hour arrival time for international flights."}, {"username": "Michael Barnes", "comment_text": "No"}, {"username": "Miyuki Kanno Paul", "comment_text": "No"}]}, {"id": "2196137264118685", "text": "Any cyclist in this group? traveling to Sardinia - Italy and wondering if I should rent a road bike or a mountain bike. I live in the mountains so the riding in altitude or gaining elevation is not a problem. I would like to know if there are better routes, conditions and accessibility to paved roads or trails for a mountain bike.\n\nAny suggestions, comments and recommendations will be appreciated.\nThanks you!", "link": "facebook.com/groups/1373361046396315/permalink/2196137264118685/", "likes": 0, "comments": []}, {"id": "2196144914117920", "text": "I need some help please! Last Friday I saw a link on a post on this site that showed a table of the proposed transport strikes over the summer in Italy. I can’t find it now and would love to have access to it. I’m travelling in Italy from 7/9/23-18/9/23 and planned to mainly travel by train.\nThanks 🙏🏼", "link": "facebook.com/groups/1373361046396315/permalink/2196144914117920/", "likes": 0, "comments": []}, {"id": "2196140084118403", "text": "Trying to decide if a nine day cruise to Italy, or just travelling on our own would be better. Any advice? Wondering mostly which would be more cost effective. Coming from Canada so either way we would have to fly to Italy from Toronto, probably the most expensive part of our trip.", "link": "facebook.com/groups/1373361046396315/permalink/2196140084118403/", "likes": 5, "comments": [{"username": "Lynn Francisco Casella", "comment_text": "Do both but make it a 12 day cruise and then two weeks on the ground Rome and Florence"}, {"username": "Maureen MacIsaac Timothy", "comment_text": "Our first time, we did cruise\nThen returned to our favorite places,"}, {"username": "Krista Ford-Walcer", "comment_text": "Cruising first would give you a great idea and experiences of different places. Then next trip you can spend more time on land at the places you loved😊"}, {"username": "Diana Thompson", "comment_text": "We prefer doing it on our own. That way we aren’t bound by a set schedule and can be a bit more spontaneous. Also, I know some people love cruises, but we prefer to spend our time on adventures rather than a ship (they feel kind of geriatric to us - like a floating retirement home. So we’ll save it for when we are older and may prefer things to be all planned out for us.) While I don’t know pricing for Italian cruises, we typically spend around $6k CAD for two weeks on our own (that’s all costs, including spending money, food, tickets etc.) Whichever way you go, enjoy every moment of it - Italy is wonderful!"}, {"username": "Aydrian Pollard-Hayes", "comment_text": "We just booked a 10 day cruise but are spending extra time at our departure city and disembarking city! 🥰 April/May 2024!"}, {"username": "Beth Allen", "comment_text": "Cruising is an easier/\nefficient way to see more destinations in a short span of time. You unpack once and your window to the world changes each day. I usually tack on a few days pre/post cruise in a major city"}, {"username": "Susan Buck", "comment_text": "If the cruise offers 2-3 days in each area, I would consider it. But… Imagine going to the Amalfi coast for just 1 day. Agony upon leaving to catch your boat! 😩"}, {"username": "Leslie BC", "comment_text": "I am doing a 7 night cruise. That starts in Rome and ends in Athens. I am coming in a few days earlier to do some sightseeing in Italy and staying a few days later to sightsee in Greece. I'm from the US and plane fare will cost more than the cruise 😮! Going in September 2024"}, {"username": "Joya Nicastro Cherry", "comment_text": "I have done both. For the most cost effective way - do the cruise.\n\nI felt the cruise was a little taste and I will pick and choose where I want to go back to and stay on land.\n💯 % fly in the day before - to see that city and not be stressed with the flight and missing the boat."}]}, {"id": "2196145877451157", "text": "Best places to stay in the Dollarmites and Lake Garda please.", "link": "facebook.com/groups/1373361046396315/permalink/2196145877451157/", "likes": 0, "comments": []}, {"id": "2196148090784269", "text": "Rome Street Food Tour recommendations! Also, do you recommend doing it in Trastevere or Jewish Ghetto? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2196148090784269/", "likes": 0, "comments": []}, {"id": "2196149080784170", "text": "I have learned so much from this group! Thanks!\nMy husband and I are staying in Praiano mid May 2024. He is an experienced motorcycle driver of a large tour bike. Would it be too crowded then to rent a scooter? Can you recommend a rental company? I usually ride behind him amd would prefer a 2 person scooter! Thanks !", "link": "facebook.com/groups/1373361046396315/permalink/2196149080784170/", "likes": 2, "comments": []}, {"id": "2196150180784060", "text": "Hey all. I am travelling to Italy in September with my husband. 4-21 sept Amalfi Coast (1week) - Sicily (a1 week) and Rome (3 days). Any must go to restaurants in any of these areas. And anything I MUST book advance ! Also I believe cash is king. Can you still use Mastercard etc to pay for accommodation etc ?", "link": "facebook.com/groups/1373361046396315/permalink/2196150180784060/", "likes": 0, "comments": [{"username": "Erika Huber", "comment_text": "I paid with a travel card for ( Amalfi) accommodation, some places wanted cash (Capri), depends on the owner."}]}, {"id": "2196154084117003", "text": "How much are you charged when taking money from ATM machine", "link": "facebook.com/groups/1373361046396315/permalink/2196154084117003/", "likes": 0, "comments": [{"username": "Jenn Messina Babore", "comment_text": "It depends on the ATM. We only used bank owned ATMs and found some to just charge a fee for their ATM of 3-7€ and then we found some that charged 3-6% on top. 😢"}]}, {"id": "2196154947450250", "text": "Going out of our mind trying to figure out which area of Rome to stay in!! We were originally going to stay right near the Vatican but people told us it is too far from the rest of Rome and the area is not as nice or safe at night. We found another nice Airbnb in the Salario area by Villa Borghese but it is still far from the city center. And there is another airbnb by the Roman forum. Where should we stay if outside the city center??", "link": "facebook.com/groups/1373361046396315/permalink/2196154947450250/", "likes": 18, "comments": [{"username": "Lisa Hedenberg Nichols", "comment_text": "We just stayed in an AirBnB by the Colosseum…charm\ning area with tons of restaurants and a little nightlife. We just took an Uber or taxi when we went to the Vatican and to our food tour in/around Travestere."}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "After staying in Rome for 14 days, moved to 2 other bases (Spanish steps and Trastevere), hands down loved the location, vibe and charm of Ponte. I’d walk across bridge (solo) to Castel Sant’Angelo every morning and to Vatican. All close by. Magical."}, {"username": "Mia Catalano", "comment_text": "We stayed near the Vatican and loved it! We took the hop on hop off bus to all the sights! 😀"}, {"username": "Omar Chaaraoui", "comment_text": "Stay somewhere on the route of the 8 or H buses, very convenient and frequent busses to the center, and not too far, just south west of the city."}, {"username": "Debbie Gallo", "comment_text": "We stayed in an apartment about a block from the Pantheon. It was a great location and walking distance to almost all the sites. Our adult children were traveling with us and they also loved the location and walking distance to explore some great hideaway restaurants and cafes. Always felt safe walking around in the evening too."}, {"username": "Lynn Crane", "comment_text": "Monti!!"}, {"username": "Patti Farrell", "comment_text": "Trastevere. Close to all. Interesting area, and casa Di Santa fFrancesca Romana is associated with ladies of the church. Used to be reasonable, quiet street and great breakfast. Pretty sure it's air conditioned. Make sure anything you book is."}, {"username": "Aaron Peterson", "comment_text": "Between Pizza Novanna and Campo Di Fiore"}, {"username": "Steve Grossman", "comment_text": "Rome is one of the smallest major cities in the world. Any of the places you mentioned are okay and a short distance from the center of town. If you want to have a multitude of restaurants to choose from stay in the Trestavere area"}, {"username": "Kim Butler Oam", "comment_text": "Staying close to the piazza Narvona was great. I could walk to everything, never caught a taxi. The Vatican I had done with a tour so I didn’t need to go back there. It’s fabulous walking everywhere as you find things as you go. New discoveries everywhere in Rome"}, {"username": "Jeff McLellan", "comment_text": "We just stayed there for five nights in a great apartment located here\n\nVia dei Banchi Nuovi, 58a\n\nBelieve the area is called Piazza Navona it was a convenient location for everything."}, {"username": "Phyllis Snyder", "comment_text": "If you’re only in Rome a few days stay as close to the sites you most want to see- example pantheon neighborhood, Ancient Rome neighborhood, even trastevere because of tram. If you have more time & $ north Rome is lovely."}, {"username": "Libby Kelly", "comment_text": "We stayed just the other side of the Vatican wall and were able to walk everywhere or hop on a bus to get uphill when feet were tired. There are also the scooters at every corner of you download the App, great fun"}, {"username": "Gillian Hazell", "comment_text": "We found Rome very walkable. I was amazed by how close everything actually is. We do enjoy just strolling and looking, that seemed to be how we found the best parts of our trip , but may be different if you are on a tight schedule."}, {"username": "Gary Fossaceca", "comment_text": "Trastevere! Hands down the best neighborhood!"}, {"username": "Deborah Coram", "comment_text": "We’ve just returned and stayed in Campo de Fiori. We loved it as it is so central and pretty much a 20 minute walk to everywhere. We didn’t need to catch and train or cab to anywhere. Was fab! Good luck. Rome is wonderful!"}, {"username": "Claudie Leduc", "comment_text": "Near Trevi!"}, {"username": "Kerrin Barassi", "comment_text": "Trastervere"}, {"username": "Linda Haavig", "comment_text": "I had a nice Airbnb in Campo di Fiore area. Good restaurants and walking distance to sights."}, {"username": "Rebecca Wilcox", "comment_text": "By the Roman forum, great area. We walked everywhere from there"}, {"username": "Debi Sicurella Krulisky", "comment_text": "Monti"}, {"username": "Jean Bennett O'Reilly", "comment_text": "Check out Hotel Condotti in center of Rome. Near Spanish steps. Very walkable. Cute restaurants."}, {"username": "Tari Lawson", "comment_text": "We just stayed by Campo Fiori a couple nights and one night about a 10 minute walk from the Colosseum. Both areas were good and very walkable. I have also stayed by the Villa Borgese, which is a bit farther away and not quite as convenient, but nice."}, {"username": "Cindy Teresi", "comment_text": "We stayed near Vatican. Hotel Santa Anna. Wonderful hotel."}, {"username": "Tina Tina", "comment_text": "Near Trevi is the most central"}, {"username": "Andrea Brown", "comment_text": "We stated near the pantheon. Perfect location"}, {"username": "Jamie Ash", "comment_text": "We stayed here in may. Great location and two bathrooms!"}, {"username": "Greg Saba", "comment_text": "We stayed in May just outside the Vatican walls just above the bakery where all the Popes got their bread. The bakery just closed due to the retirement of the owner. We had been to Rome a couple dozen times, and this was the first time in that area. Some great restaurants that students in the area have discovered. We walked that side of the river a few miles until we reached our destination, the finals of the Rome Open tennis tourney. Because of rain delays, we returned on foot our second night there well after midnight. Quite safe. Passed couples and single women. By the way next door to the tennis center, we discovered the site of the 1960 Rome Olympics, the grounds of which were open."}, {"username": "Catherine Darsigny", "comment_text": "We just left Rome. Our appartement was close to the Vittorio Emmanuel monument and it was 👌🏻perfect.\nWalking distance to : Colisée, Trevi Fountain, Spanish steps, etc. I would recommend. Have fun !"}, {"username": "Elaine Jefford", "comment_text": "Via Cavour is a great street to stay on, it is the main road from Termini station down to the city centre and the airport bus stop at Termini is a short walk away. Windows and shutters blocked out the traffic noise we have stayed in Via Cavour twice and loved it."}, {"username": "Emma Blanche Miller", "comment_text": "We stayed near the Colosseum. We found the area safe of an evening, enough to see within walking distance and lovely restaurants. We got a hop on hop off open top bus ticket for a couple of days and used that to visit the Spanish steps, Trevi fountain, Vatican City. Was a great way to see the city too with ear phones to give u an audio tour guide."}, {"username": "Rebecca Goldsmith", "comment_text": "We are going next month and staying in Campo De Fiori think it’s a pretty good area from what I’ve researched we have never been before have apartment booked there 😁"}, {"username": "Jenn Messina Babore", "comment_text": "We stayed in Monti, which was a convenient location between Roma Termini and Colosseum and a mile or so from other main attractions. We took taxis wherever we needed."}, {"username": "Karon Patterson", "comment_text": "The Vatican area is amazing and vey safe we found. It’s also relaxing and quiet at night. Easy to get to on train"}, {"username": "Bing Robertson", "comment_text": "Stay where you want, this group can be a bit much sometimes. I booked my holiday last minute with no plan at all, I was fine and had a wonderful time. Rome is very accessible by public transport, my 70+ year old father and I felt safe at all times and had no issues with pickpockets or anything like that. From my experiences everyone was friendly, even the homeless people. Don't get too bogged down with what others experience, go make your own journey and memories. You'll have a great time so long as you're aware and vigilant 😊 have a great holiday!"}, {"username": "Dave Conroy", "comment_text": "I stay where there's easy in and out for trains or flights and close to the main things I want to see. The close to food coffee and ideally a small supermarket. Sort you criteria, then know your budget and area. Buy a guide book for an overview of the main areas. Don't worry about it. There is no perfect choice. Just needs to do the job."}, {"username": "Tania Bergman", "comment_text": "We stayed at the hotel lancelot. 5 mins walk to the Coliseum and close to on of bus stops. It really nice about special and prices resonable"}, {"username": "Ilaria Giorgulli", "comment_text": "As a Roman, I find more charming, vibrant and beautiful the other side of the river, from piazza Navona onwards.. closer to Forum, Colosseo, Monti, Pantheon, get lost down there in the ((roasting) evenings.. Prati is meh, a bit less charming, still ok. It depends also on budget of course."}, {"username": "Cheri Arrowood-Stanziano", "comment_text": "We stayed at an Arbnb just up road from Coliseum. There was a Hop on Bus location at the bottom of street and some great food…."}, {"username": "Gundega Barkane", "comment_text": "Villa Borghese is not far from City centre. Basically, look ar the metro Line. You will find Vatican, Piazza del Poppolo, Spanish steps, Colloseum on the metro Line.\nThings like Angel Bridge, Trevi, Pantheon- you have to walk anyway. Old centre is relatively small 30-60 min walk if you do not mind walking"}, {"username": "Jenny Payne", "comment_text": "Monti area is nice but I have always stayed near the termini in a 3 star hotel since the apartment I always stayed in was sold . Around Via agostino depristis & Via Nazionale is handy for everything + great bars & restaurants"}, {"username": "Pam Neary", "comment_text": "Here is the best hotel I’ve stayed in Rome iq iQ Hotel Roma it is in the best position and only a 20/30 minute walk from the historic centre. It’s a 5/10 minute walk to termini and there is a metro station only five min walk away. The area is as safe as you will get. I usually air b and b now because we holiday with family but when we go on our own(my husband and I) we stay here"}, {"username": "Susan Davis Dodd", "comment_text": "How is the Aventine Hill area?"}, {"username": "Georgina Mcauliffe", "comment_text": "We have stayed all over the place and had a great time everywhere - no need to stress. I would probably also say the Vatican is a bit of a hike on foot to everywhere else - best to walk to see it not live there. I particularly like staying just off Campo dei Fiori as I like to poke around the market early and breakfast there. Rome is fairly compact for the main sights and lovely for evening walks. I avoid the buses personally unless totally whacked at the end of the day."}, {"username": "Jennifer Larese Taylor", "comment_text": "Villa Borghese really isn’t far from the centre. We have parked there and walked to the Colosseum before. It’s a nice area"}, {"username": "Romina Lauretig Toscano", "comment_text": "Rome is safe! Just avoid the train stations at night... Monti/San Giovanni/\nAventino areas are quite central."}, {"username": "Enrica Palla", "comment_text": "Stay wherever you prefere depending on your budget, Rome is served by bus and metropolitan. The city is as safe as other bug cities, you have just to pay the proper attention."}, {"username": "Angie Deeprose", "comment_text": "I stayed near Vatican it was lovely and perfectly safe :) everywhere is easy to get to and not far"}, {"username": "Carol Potter", "comment_text": "Main concern would be to ask the question….. What areas should I not stay in. Everyone has an opinion about what they like but I don’t think anyone wants to stay in a bad section so don’t stress yourself.￼"}, {"username": "Karoline Bakker", "comment_text": "Nothing is far in Rome and busses are always running"}, {"username": "Alice Francesca", "comment_text": "Monti."}, {"username": "D'Anna Hohe", "comment_text": "Salaria is a nice area, near Villa Borghese. Good restaurants and very safe. It’s about a 10 euro taxi ride to get to Piazza Venizia. Walking distance to Via Veneto and near a couple of Metro stops. Also a short ride to Termini station, but no, it is not right by the Colosseum. Just depends on what is most important to you.\nIt was a great area to live in!"}, {"username": "Dann Hrusch", "comment_text": "I've been three times and my favorite spot was an apartment by the Pantheon."}]}, {"id": "2196155764116835", "text": "Hello, what is the best way to do day trip from civitavecchia to Vatican, Sistine Chapel, St Peter basilica, trevi fountain and colosseum from 9 am-4 pm. Thanks for the helps.", "link": "facebook.com/groups/1373361046396315/permalink/2196155764116835/", "likes": 0, "comments": [{"username": "Jenn Messina Babore", "comment_text": "The port to city center is 1.5 hours each way, so a taxi tour or guided tour may be your best option."}]}, {"id": "2196157384116673", "text": "Best way to do amalfi coast for 5 days ..starting from Naples 7 people ..any help please", "link": "facebook.com/groups/1373361046396315/permalink/2196157384116673/", "likes": 0, "comments": []}, {"id": "2196159707449774", "text": "Wondering - would $200 euros per day be enough to feed 3 people lunch and dinner in Rome and Venice. We don’t need the fanciest places but also don’t want the cheapest places", "link": "facebook.com/groups/1373361046396315/permalink/2196159707449774/", "likes": 71, "comments": [{"username": "Phyllis Snyder", "comment_text": "Adults only? Rick Steve’s guide says $50 per person is about right. $15 for lunch, $30 for dinner and $5 for gelato."}, {"username": "Diana Smith", "comment_text": "200$ euros are more than enough, just don’t stop by Piazza San Marco, crazy prices there!Just curious… how much do you guys spend for Hotels in Venice?"}, {"username": "Steph Seager", "comment_text": "Find this place in Venice it’s a family run take out pasta place where you pick your sauce and toppings. We loved it can’t wait to take our kids in a few weeks"}, {"username": "Wallace Clavelle", "comment_text": "Easy answer... Y.E.S. 🤪🤣"}, {"username": "Brad Nelsen", "comment_text": "Yes."}, {"username": "Matthew Livio Conti", "comment_text": "Yes, plenty enough."}, {"username": "Jill Cox", "comment_text": "It is!! Bring a refillable water bottle and use the fountains! Then meals can be so reasonable. Markets are great for meat/cheese/\nbread, pizzas are cheap, and most dinners are reasonable unless you choose higher end places!"}, {"username": "Jennifer Ripley", "comment_text": "F"}, {"username": "Monica Roman-Fazio", "comment_text": "It depends on what you are looking to eat. If you don't drink alcohol and have pizza everyday day i would say possible. But I just came back and spend 160 in Hardrock for a family of 4 in Venice"}, {"username": "Gem Peacock", "comment_text": "Does anyone know if there are apperitivos (Not sure how it's spelt) in Rome and Venice? I've only ever been to Milan and they were everywhere! Only €10 for all you can eat buffet and a cocktail! The most amazing food as well"}, {"username": "Anel Van Zyl", "comment_text": "For sure! Our dinners for 4 people were usually around 80 Euros (just main meals, sometimes dessert) and lunch/brunch usually much cheaper. We did not go to fancy restaurants, mostly Trattorias and Osterias and had very tasty food! Cooking at your AirBnB with fantastic local ingredients is also fun."}, {"username": "Tari Lawson", "comment_text": "It is very possible."}, {"username": "Kris Beacham", "comment_text": "Yes. It will be."}, {"username": "Libby Szabo", "comment_text": "Yes, if you spend it wisely"}, {"username": "Eileen Muro", "comment_text": "We are in Rome now and yes...200 will work!"}, {"username": "Clare Lynda", "comment_text": "More than enough pasta and pizza was 10-15 euro’s each depending how near the sites you are ."}, {"username": "Miriam McNally", "comment_text": "It is enough, especially if you are clever and conscious. You've got some very good tips here. Try to keep away from touristy areas, even going one street away makes a difference in price. Pass on dolce (dessert) and instead get a gelato to eat while walking around. You could do takeaway roll or pastry for breakfast, or if you're Air bnb just fix something yourselves. Enjoy your trip!"}, {"username": "Stephanie Evans", "comment_text": "I think so! It’s much cheaper to eat in Italy. We drank a ton of wine and I feel like we spent under that!"}, {"username": "Yateesh Kumar", "comment_text": "Nileema Kumar"}, {"username": "Pirkko Storer", "comment_text": "When in Rome go to Campo dei Fiori market there to Forno which is the bakery where you can buy pizza by the meter or less. The taste is fantastic!!!!! Margarita is my daughter’s and mine favorite"}, {"username": "Maria Coladangelo Ducca", "comment_text": "Maybe . But no fancy restaurants"}, {"username": "Gigi Igle Gonzales Dong", "comment_text": "Wow that’s way too much. Usually a lot cheaper in Rome. I don’t spend more than $150 for 4 but then we rarely drink alcohol and we had a great seafood medley for $50. It’s amazing how inexpensive food is there. Eat where the locals eat."}, {"username": "Carla Casci Principato", "comment_text": "Yes!!!! That's plenty! There definitely are many local restaurants that aren't $$$$ with entrees 15 to 20€ each. Just walk away from the main tourist areas and enjoy"}, {"username": "Melissa Therrien", "comment_text": "We did it for about that for 4 people give or take.. generally only did 2 meals a day, late breakfast and dinner."}, {"username": "Kelly Siegmann", "comment_text": "Eat away from the tourist spots. It is cheaper and the food is so much better."}, {"username": "Debra Donofrio Kruk", "comment_text": "You could do it without any alcohol."}, {"username": "Mary Cleary", "comment_text": "In Rome I ate breakfast had something light at lunch and ate a dinner in pm. I was more thirsty than hungry and stayed indoors the hottest part of the day. For dinner main course only."}, {"username": "Anne Vincent", "comment_text": "Livia Koloamatangi"}, {"username": "Jim Bobrowski", "comment_text": "Eat small for lunch, pizza/panini or sandwich and a decent dinner with house wine it is possible. If you want Florentine Steak every night or a big fish dinner then it's not enough. Also what are you drinking, just wine/spritz or soda?. We Average 40 or less for lunch and anywhere from 80-120 for dinner. We're walking do much we sometimes forget lunch trying to see everything. Our most expensive dinner was 180 eu because we really wanted to try the Florentine Steak. But that was honestly really high. Sometimes you do get what you pay for."}, {"username": "Kimberly Lowe Pressley", "comment_text": "."}, {"username": "David Perillo", "comment_text": "Yeah. It is. Don’t discount the cheapest places though. They often have the best food"}, {"username": "Veronica Parravicini", "comment_text": "Yes! You can have panini or pizza for lunch (1-5€ per person) and then indulge on dinner if you fancy something more special.\nAlso a pasta dish is around 10-15€ max.\nVenice can be quite expensive (not only around Piazza San Marco) but you must try “cicchetti” which are Venetian typical happy hour served with the original Spritz (the use select instead of aperol) and little side dishes for a few euros"}, {"username": "Josh Hess", "comment_text": "More than enough"}, {"username": "Roberta Higgs", "comment_text": "Why don’t you research where you’d like to eat and then look at their menus online ?"}, {"username": "Merlindie Fardone", "comment_text": "If you go the bars for pre dinner drinks, they have food & antipasto set up which is free if your drinking. Fill up early"}, {"username": "Jenny Payne", "comment_text": "No"}, {"username": "Margaret Mackenzie", "comment_text": "Yes"}, {"username": "Margaret Mackenzie", "comment_text": "Eat your mains in restaurant and do cheese salami fruit etc."}, {"username": "Kathy Pageau", "comment_text": "Yes!!!! Its cheap eat/wine in Italy…best cheap foodylover in the world!🥰🥰"}, {"username": "Kate Piszczek", "comment_text": "Yes"}, {"username": "Krissy Dascoli-Meehan", "comment_text": "We haven’t gotten to Venice yet but most dinners for 4 of us (2 adults and 2 children) in Rome and Florence have been give or take 100 Euros. Many under (like 70-90). A few dinners have definitely been more, but those were planned and expected."}, {"username": "Dorothy Sarnelli", "comment_text": "Have fruits for lunch then an enjoyable meal at night"}, {"username": "Robin Burrell", "comment_text": "Easily"}, {"username": "AK Kaygen", "comment_text": "Yes"}, {"username": "Lori Ann", "comment_text": "We have found the meals very inexpensive here compared to the States."}, {"username": "Chris Vilsack", "comment_text": "That def is good"}, {"username": "Colleen Jennings", "comment_text": "Just came back from Lucca - 4 of us had breakfast, lunch & dinner for average €250. Coffee & croisant standing at the bar (cheaper than sitting down - there’s a supplement), large salad at lunchtime, 2 courses with a litre of house wine at dinner, bottled water. We ate in off the beaten track trattoria but I did research places beforehand & booked. Enjoy Italy it’s fantastic!"}, {"username": "Ryan Monahan", "comment_text": "€200 is more than enough to eat really well!"}, {"username": "Julie Adams", "comment_text": "Yes"}, {"username": "Traci Raymer", "comment_text": "It’s about 60-100 in tourist areas. Like in the city near everything. We went shopping one day at the largest mall in Rome (Port de Roma I think) and we ate for 15 euros for 2. It definitely varies"}, {"username": "Debbie Rumer", "comment_text": "Yes"}, {"username": "Tara Gunderson", "comment_text": "Yes for sure! We were just in both locations last month and this is doable."}, {"username": "TA Crossman", "comment_text": "I had the best pastas at takeout places in Venice. Decent portions for €6-11. Most close before dinner. Generally the farther from St. Marks, the better the food, service, and price. You pay a premium to sit and eat on the water, but you should at least once, even if it's only pizza."}, {"username": "Edmarie Saia", "comment_text": "Do you know if they take cards at a lot of places? Or do you need to have cash on you?"}, {"username": "Rose Stolarek", "comment_text": "Absolutely"}, {"username": "Bonnie Qn", "comment_text": "Three of us went about two weeks ago. Our most expensive meal was 100 euro, most meals were 60-65 euro so it’s possible!"}, {"username": "Eric Parks", "comment_text": "If you budget it and are concious when ordering, easily. If you have constant blow out meals, no."}, {"username": "Sara Hertz", "comment_text": "I personally think that’s a tight budget for 3 people."}, {"username": "Rose Anderson", "comment_text": "Depending on your choices yes- our hotels provided breakfast- we usually ate a snack for lunch or coffee- and then went out for dinner in various price ranges - grocery stores have an incredible selection if you are in air bnb"}, {"username": "Richard Rodriguez", "comment_text": "Probably not realistic if eating at restaurants. We spent anywhere from 100e to 250e every time we stopped to eat."}, {"username": "Charlie Louise Moore", "comment_text": "Yes, download the app the fork. Sometimes you can get up to 50% off your food x"}, {"username": "Simonetta Seri", "comment_text": "For lunch, go into any supermarket deli section & choose some of the best tasting salami, mortadella or prosciutto (crudo = raw or cotto = cooked, ham). Cheeses, olives, crusty bread - so many great picnic choices\nTastes amazing, cheap, & a memorable view"}, {"username": "Ellie Smythe-Jones", "comment_text": "Yes, in Rome we averaged about €90 a meal for 3 adults and we ate at lovely places and had wonderful food."}, {"username": "Danielle Johnston", "comment_text": "Yes"}, {"username": "Jeff Gentner EA", "comment_text": "Possibly. Remember, if you stay in a hotel, breakfast is usually included. Plan ahead!"}, {"username": "Dana Green", "comment_text": "Yes for sure. We ate mostly cereal and other convenient things for breakfast at our airbnbs and opted for a sandwich or pizza at lunch which is inexpensive and saved pasta and more expensive meals for dinner."}, {"username": "Kit Nader", "comment_text": "Yes easily. There are many choices ...I know venice well and if you want the most fantastic take out pasta or ok take out pizza its all available. Very pleasant little bars like the corner pub have good prices and food food. If you do a search for high rated budget food venice in tripadvisor or similar you'll get some great recommendations\n. Plus supermarkets like the coop have sections of bread and cheeses and pizza etc ....wine at fabulous prices. I love being places on a budget ...somehow it feels more fun!"}, {"username": "Fetchin Gretchen", "comment_text": "**Yes, €200 per day is enough to feed 3 people lunch and dinner in Rome and Venice.** You can find plenty of good restaurants in both cities that offer affordable meals. Here are some tips on how to stretch your budget:\n\n* **Avoid tourist traps.** The most expensive restaurants in Rome and Venice are often the ones that are located in the most popular tourist areas. If you're looking for a good value, try to find restaurants that are off the beaten path.\n* **Look for lunch specials.** Many restaurants in Rome and Venice offer lunch specials that are much cheaper than their dinner menus. You can often get a main course, side dish, and drink for around €10-€15.\n* **Share dishes.** If you're not that hungry, you can share a main course between two people. This is a great way to save money and try new dishes.\n* **Order tap water.** Bottled water is very expensive in Italy, so it's best to order tap water instead. Most restaurants will serve it for free.\n\nHere are some specific examples of meals that you could get for €200 per day in Rome and Venice:\n\n* **Lunch:**\n* Pizza: €8-€10\n* Pasta: €10-€15\n* Sandwich: €5-€7\n* Salad: €5-€8\n* **Dinner:**\n* Pasta with meat or seafood: €15-€20\n* Pizza: €10-€15\n* Risotto: €15-€20\n* Steak: €20-€30\n\nOf course, you could spend more or less than €200 per day on food, depending on your preferences. If you want to eat at the very best restaurants, you'll obviously be spending more. But if you're willing to do a little bit of research and make some smart choices, you can easily eat well in Rome and Venice for a reasonable price."}, {"username": "Alex Dodge", "comment_text": "Yes. Especially if you eat where regular Italians eat. Rome is cheaper than Venice, so avoid eating near San Marco square there."}, {"username": "Alison Dutton", "comment_text": "Look out for happy hour specials early evening. Near the Trevi fountain we found one that did a mixed platter, hams, cheese, olives, fried potatoes and an aperol spritz for 10 euros."}, {"username": "Dave Conroy", "comment_text": "More than enough. Of course it depends what and where you eat."}, {"username": "Grace Scinto", "comment_text": "A cornetti/\ncroissant and a coffee will cost you around €5-8 per person. Cheapest and best breakfast ever!"}, {"username": "Kookie Jesse Trevino", "comment_text": "We are here in Sorrento now and have been all over Italy these last two weeks. It is very possible. You just need to be smart. If you plan to eat something extravagant for dinner one night eat from a local deli or grocery store for lunch. Pizza is also a very cheap option. We had delicious pizza in Venice and it only cost $8 and feed three of us. We bought that and a Capri salad all for less than $20 euro. Bring your own water from grocery stores. Water and soda at restaurants are about $3.50 a piece and everyone is charged $2 service charge that sits at a table. This is at every restaurant we have been to and we eat A-LOT! Lol"}, {"username": "Gemma Risk", "comment_text": "Yep easy! We did family 4 $300 Aus dollars\nPizza is €6 maybe €8 for a basic one that is delicious! So can easily be done"}, {"username": "Ellen Edmonds-Wilson", "comment_text": "If you stick to pizza and pasta you can do it on that budget - but one course and a gelato."}, {"username": "Alexandra A Welker", "comment_text": "That's enough to cover for 3."}, {"username": "Cheryl Bonello", "comment_text": "I would think so"}, {"username": "Stjepan Kujadin", "comment_text": "Yes"}, {"username": "Julia Muller", "comment_text": "We just spent a few days in Venice (not Rome this time) as a family of three and dinners were averaging about 120ish, (accidentally 180 one night 🙈) so if you can just do pizza slices or paninis for lunch you’ll be fine!"}, {"username": "Elisa Marte", "comment_text": "Assolutamente si"}]}, {"id": "2196158844116527", "text": "Trying to decide if I should get euros here in the US or in Italy when I arrive.", "link": "facebook.com/groups/1373361046396315/permalink/2196158844116527/", "likes": 58, "comments": [{"username": "Diane Bicknell Cooper", "comment_text": "AAA will exchange for 5.00"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "No question, in Italy at a Bancomat when you arrive. Use your debit card. They are located just past baggage claim at the airport."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "The worst option is to order from your bank at home. It is too risky and unnecessary to carry a lot of cash when you travel."}, {"username": "Judy Paul", "comment_text": "Just use your credit card, less expensive."}, {"username": "Corey Magyar", "comment_text": "For what???? Use your damn credit card."}, {"username": "Donna Holt", "comment_text": "Get some small bill cash at your local bank."}, {"username": "Donna Parrish", "comment_text": "When you arrive"}, {"username": "Bambi Harris", "comment_text": "We are getting ours from our bank, just easier"}, {"username": "Mark Johnson", "comment_text": "Just withdraw euros from a bank ATM in Italy. You will get the best exchange rate"}, {"username": "Karen Espinoza", "comment_text": "Here, in usa, fast and easy."}, {"username": "Rosies Delights Oxox", "comment_text": "Get from your bank"}, {"username": "Frank McCarthy", "comment_text": "We just retuned from Sicily. GET THEM HERE. We took $300 worth. Get as small bills as possible as stores DO NOT MAKE CHANGE. They only give back bigger bills. They hoard smallbills and one and two dollar coins."}, {"username": "Anna Gambino", "comment_text": "Just my opinion. I always get here in the US before I go. I don’t want to deal with ATMs in a foreign country. Would do it if I run out of Euros of course but I try to carry enough. I use credit card when I can."}, {"username": "D.c. Welko", "comment_text": "I always exchange some at my bank to take with. You often have to order this transaction with your bank. Then, if you need more the ATM over there is fine and if you come back with extra, use your bank to exchange back. Depending on your bank and type of accounts you have will determine if and how much your bank charges for this transaction. Mine is free with my money market."}, {"username": "Jackie Flores", "comment_text": "We have been in Italy for 10 days and only 1 place has asked me to pay with cash. Everywhere else I have been able to use my credit card, so I wouldn’t worry about bringing cash"}, {"username": "Lucy Bailey", "comment_text": "Don’t get a massive amount as most places take card now. You can get debit cards that don’t charge fees for using abroad."}, {"username": "Geri Lia Pisani", "comment_text": "What is the finest hotel in positano"}, {"username": "Kay Malick", "comment_text": "Get euros and then come to italy...dont come and exchange here"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Don’t need any… credit card was all we used"}, {"username": "Melanie Gitzis Marcus", "comment_text": "You'll get the best rate from the ATMs overseas. Definitely bring credit cards and make sure they have zero international transactions fees. The Chase Explorer and Chase Sapphire have 0 fees. Don't both exchanging overseas. Their rates are high"}, {"username": "Gabrielle Condon", "comment_text": "Caitlin Grant Dalton Grant"}, {"username": "Maureen Rebello Hagerty", "comment_text": "US"}, {"username": "Linda Wigand Mirandi", "comment_text": "Get them from your bank"}, {"username": "Charles Golson", "comment_text": "200 in usa"}, {"username": "Ruth Remi Bayang", "comment_text": "ATM withdrawal when you arrive"}, {"username": "Kimberly Lowe Pressley", "comment_text": "F"}, {"username": "Stephanie Dean", "comment_text": "Both"}, {"username": "Lisa DOttavi", "comment_text": "Try Wise card, you can fill the card in US and transfer both from your bank account to Euros in minutes."}, {"username": "Marlene Collett", "comment_text": "Check if your credit card charges a transaction fee. If not, this is the best way!"}, {"username": "Karen Eagal", "comment_text": "Italy charged a 9% fee to exchange. Get in US from your bank"}, {"username": "Georgeann Farinacci Greene", "comment_text": "Get some here. My bank had them, I just had to go to another larger branch to pick them up. Very easy."}, {"username": "Suzanne Bagni Lim", "comment_text": "Here"}, {"username": "Peggy Bollinger", "comment_text": "Exchange rates much better at your bank. Get your euros before you go"}, {"username": "Jonathan Goetzel", "comment_text": "A few weeks ago I had the plan to use Deutche Bank atm in Rome since they don't charge atm fees (german law). Every Deutche Bank ATM I found had no cash available! Do it at home so you don't have to worry about it."}, {"username": "Bryan-Leisa Arnold Wesley", "comment_text": "No, get them there!!!!!!!!"}, {"username": "Theresa Wong", "comment_text": "Here in US"}, {"username": "Christine Broussard", "comment_text": "Just get a small amount for tips, drinks etc… otherwise use CC Australia’s minimum amount at Travelex on line is $350 😩"}, {"username": "Laura Walter Triola", "comment_text": "Get from your bank before you go."}, {"username": "Maryanne Battistone", "comment_text": "Get some in the states."}, {"username": "Nancy Lewis", "comment_text": "Get them from your bank or AAA. ASKIF THEY CHARGE A SERVICE FEE. AAA had no fee in my town."}, {"username": "Vera Pergolizzi Blade", "comment_text": "Here"}, {"username": "Robin Wilfong", "comment_text": "Better exchange rate at bank in Italy. 1.2 us equals 1 euro"}, {"username": "Tonya Hunt", "comment_text": "Us from your bank"}, {"username": "Mina Joshi", "comment_text": "In USA and you have to order in advance. Don’t take too much as you can use credit card everywhere."}, {"username": "Vedrana Maya Zarafa", "comment_text": "Can anyone tell me what the euros exchange rate is in Italy for AUD? I got the best I could get here is .57 euro to $1 aud"}, {"username": "Vedrana Maya Zarafa", "comment_text": "Nicole Thompson"}, {"username": "Sherry M Roedl", "comment_text": "Wait to you get to your destination. Find an ATM at a bank. The rates at the airport are not in Your favor. Capital One card does not charge international transaction fees."}, {"username": "Janice Rea", "comment_text": "US. Then ATM in Italy when needed."}, {"username": "John Beilharz", "comment_text": "100 euros then all ATM"}, {"username": "Edmond Nolan", "comment_text": "In Italy"}, {"username": "Maggie Williams Dryden", "comment_text": "Get them at your bank in the US and only get as much as you think you’ll actually spend. Most branches have to order up to a week in advance so don’t wait till the last minute.\n\nDrinks on the street are usually 3-4€ and you’ll want to pay with a 5€ to get the 1€ coin back for the restrooms!"}, {"username": "Tracye Shelby Huffaker", "comment_text": "I got mine before we left. It just made it easier and I didn’t have to waste my time standing in line. I took $1800 and really only needed about $1000. We used euros for cabs, trains, treats and towards the end of our trips we paid for meals. Cashed in $300 at the airport before coming home."}, {"username": "Joanne Vincelli", "comment_text": "Just picked up mine yesterday from Wells Fargo."}, {"username": "Thomas Harris", "comment_text": "Less expensive overseas. Use a ATM when yuu arrive. Try and find a European bank ATM to avoid high fees."}, {"username": "Pat Dalton", "comment_text": "Both lol"}, {"username": "Lynne McInally", "comment_text": "I did it here in canada"}, {"username": "Anne Lydon", "comment_text": "Atm in Italy plus use capital one credit card no fees"}, {"username": "Kevin Vaskez", "comment_text": "At an ATM from a bank 🏦 when u arrive at Airport. Be sure it’s from a bank ATM, the best minimal charges"}, {"username": "Toni Marie", "comment_text": "At home"}, {"username": "Johnny J. Turpin", "comment_text": "Get them here. Exchange rate in Italy is 20% more"}, {"username": "Jeannie Occhiogrosso", "comment_text": "I always like to have some on hand"}, {"username": "Kelly Gorton Conley", "comment_text": "I just purchased some from my bank BOA, took 1 day to arrive and I picked it up"}, {"username": "Jeff Deal", "comment_text": "AAA"}, {"username": "Louis Passariello", "comment_text": "I say cash in $100.00 and have a few euro’s for tips or a drink."}, {"username": "Magda Rodriguez", "comment_text": "Get them here. They charge more in Italy."}, {"username": "Tracy Krause", "comment_text": "Order 100-200 from your bank. Mixed bills. It’s easy to get more when you’re over there. Don’t use Euronet ATMs"}, {"username": "Bobbie Lane Hausherr", "comment_text": "We got ours at a kiosk in our local mall before we left. One less thing to worry about on our trip."}, {"username": "SAbrina Durant", "comment_text": "I usually used my debit card since the rate fluctuate daily or ATM when I get there."}, {"username": "Angela Nina", "comment_text": "It’s always good to have a bit of euros on you when you arrive"}, {"username": "Rebecca A. Baer", "comment_text": "I got them in Italy with a credit card. Better exchange rate!"}, {"username": "Susan Templeton Banker", "comment_text": "Get them here"}, {"username": "Thalina DeMarco", "comment_text": "I’ve been in Europe since July 3 and have managed without Euros. I ended up getting 70 euros when a friend and I split the bill and she paid her half in euros.\nThe only time I needed was when I was in Capri on a boat trip and the boat tour guy wanted a tip.\nOther than that, I have been fine. I’m now in Amsterdam and I lost out on a good deal that was currency only at their flea market. Here in Amsterdam they have asked me for tip and i just add it to my credit card bill."}, {"username": "Valerie Taylor-Crow", "comment_text": "When you arrive!"}, {"username": "Melanie Fraser Hotchkiss", "comment_text": "Use a pre paid card and take a small amount of cash."}, {"username": "Annette Mayer", "comment_text": "In Europe"}, {"username": "Diane Petonito Giordano", "comment_text": "Get some here before u go"}, {"username": "Elizabeth Clifford", "comment_text": "Here"}, {"username": "Carol Scott", "comment_text": "Get them at the bank atm in Rome."}, {"username": "Matthew Gramitt", "comment_text": "Been to Italy 4 times in the last year and a half. The first three times we didn't go with any Euros, just picked some up from ATMs once there. Didn't need much, but nice to have some coins for public toilets, small tips, and not much else.\n\nWe use a credit card just about everywhere in Italy.\n\nThe last time we went I brought some leftover British pounds sterling I had from a trip to the UK, and changed it over to Euros in the Boston airport while waiting for our flight. Actually got a pretty good rate there, which I imagine I could have also got if I had changed dollars to euros instead.\n\nWe'll go again in the fall and we will just land with the few euros we have left and grab more from ATMs if we need to."}, {"username": "David Sapienza", "comment_text": "Get at the ATM there."}, {"username": "Joan Tyler", "comment_text": "Have a wonderful day!"}, {"username": "Mary Iuor", "comment_text": "Get them from your bank"}, {"username": "Myriam Rodríguez", "comment_text": "Italy"}, {"username": "Paulette Pentangelo Cinotti", "comment_text": "Just got back from Italy and you need some. Got some from my bank. Also used an ATM in Italy for more."}, {"username": "Donna Egan Mason", "comment_text": "I am going to some from my US bank to get me through getting to Italy\nCabs food etc"}, {"username": "Patty Ham", "comment_text": "In Italy at a bank ATM"}, {"username": "Miri Ringrose", "comment_text": "Get yourself a Wise currency card and a few euros before you go ."}, {"username": "Ron Madrid", "comment_text": "Here at A Wells Fargo bk, exchange venders at mall s expensive."}, {"username": "Susan Zimmerman", "comment_text": "I would bring some Euros with me. Enough for a day or two. Then hit up an atm"}, {"username": "Gina DeCrescenzo", "comment_text": "I’d get at least 2k to get you started. Especially for cabs and transports and tips."}, {"username": "Susan B. Corino", "comment_text": "I get my euros here"}, {"username": "Angelika Pfeifer Mitchell", "comment_text": "We got some ahead of time thru our bank and I was glad to have them."}, {"username": "Dixie Kotylak", "comment_text": "I started out with a bit so I wouldn’t have that chore right away, and then got more easily at bank machines. I’m from Canada. 🇨🇦"}, {"username": "Kathy Allen", "comment_text": "Or both…"}, {"username": "Nancy Harms", "comment_text": "If you have time I recommend Wise you can get a debit card with that just a small fee but you do not pay exchange rates."}, {"username": "Lisa Quinn", "comment_text": "Go to your bank. Order them ahead of time. They only charge whatever the exchange is, my bank did not charge a fee. ￼"}, {"username": "Janet Farrell", "comment_text": "Got 1500 before I left"}, {"username": "Rosinda Maria", "comment_text": "Honestly I travel to Europe a lot and I just use my card! They have atm’s everywhere! Soon as you land at airport take money !"}, {"username": "Joanne Bianco", "comment_text": "Here"}, {"username": "Melissa Feielin Hawkins", "comment_text": "I am able to go to Chase and Wells Fargo and get euros. Just have to do it a week or two before leaving. We usually just get €400 and use credit cards with no exchange fees. ￼"}, {"username": "Vanessa Verzillo", "comment_text": "I find it easier to do here. I get like 2000 euros and also mixed with using a card, it’s enough for two weeks."}, {"username": "Dawn Funk Thie", "comment_text": "I always get before I go. Your bank won't charge a processing fee, but there are a lot of fees when exchanging overseas"}, {"username": "Peter Cetani", "comment_text": "They use credit card for everything. I would get some here if I were you."}, {"username": "Andrea Cappellucci", "comment_text": "Nice to have a few when you arrive there."}, {"username": "Lisa Wylin", "comment_text": "Be prepared, for heavens sake. I have an account at Chase. Might take a few days. Also bring some US cash and of course a credit card or two."}, {"username": "Jeff McLellan", "comment_text": "It only makes a big difference if you are silly enough to use a third party ATM such as Travelex. If you go to a major bank the difference was nominal at least from my experience."}, {"username": "Roscarol Morelli Kennedy", "comment_text": "Italy as as you get off the plane"}, {"username": "Cynthia Marie", "comment_text": "I like to have all my ducks in a row before I head to the airport. I exchange at my local bank when I see a good rate."}, {"username": "Kathy Pierce", "comment_text": "I pulled it out of their ATM’s where my bank card worked. Better rate of exchange."}, {"username": "Katie Osterman-DiBlasi", "comment_text": "At a bank atm in Italy! Not the airport, not the train, not an exchange counter, a bank atm"}, {"username": "Kathy Smith", "comment_text": "I wish we got ours before coming. Airport conversion was bad. Been getting at an ATM here."}, {"username": "Ken Diamond", "comment_text": "We use ATMs (Bancomat’s) use the ones associated with a bank they will be labeled as such. They charge about a 5 euro fee for how ever much you take. They are often grey in color do not use the non bank one?( such as “euronet) they charge more. And don’t take the conversion option. Also use credit cards when possible they will converted at the bank rate when you get your bill ."}, {"username": "Maria Giordano", "comment_text": "I always take the equivalent of $100 in local currency wherever I go"}, {"username": "Brian Osman", "comment_text": "Get them from your bank here"}, {"username": "Sue Holden", "comment_text": "Before you go"}, {"username": "Michele Borey", "comment_text": "Use the ATM in Italy"}, {"username": "Candy Mattiello", "comment_text": "Definitely here!"}, {"username": "Laura Nausadis Bieber", "comment_text": "We just made withdrawals in Italy at an atm every 2-3 days and that worked great."}, {"username": "Atet GC", "comment_text": "Get Wise card!"}, {"username": "Carol Potter", "comment_text": "Get them at home don’t waste precious time when you get there"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2196163344116077", "text": "We are coming into amalfi in august , is there a place we can store luggage till check in ? We will be coming in morning . I know there’s facilities in Florence/Rome for luggage storage", "link": "facebook.com/groups/1373361046396315/permalink/2196163344116077/", "likes": 0, "comments": [{"username": "Jenn Messina Babore", "comment_text": "Google luggage storage and the city, you will see if there are options. There are sites like usebounce.com and stowyourbags.co\nm that have options."}, {"username": "Dave Colleen", "comment_text": "Most hotels allow you to store luggage if you arrive early."}]}, {"id": "2196164790782599", "text": "Hi! Best travel agencies to book with? Custom itineraries and will book all transportation and excursions for you. Thank you!!", "link": "facebook.com/groups/1373361046396315/permalink/2196164790782599/", "likes": 0, "comments": [{"username": "Amanda Baier", "comment_text": "Bump! Any help with this would be amazing!"}]}, {"id": "2196173000781778", "text": "We only have one night in cinque terre in Oct. We have a car. There will be three of us. Should we stay in la spazio and travel to Cinque terre each day. Or park there and get a room dinner place in cinque terre, or drive close to where we will stay in cinque terre? My friend fly out from FLR at 0600 the next morning, so we have a hotel by theआणखी airport. Bottom line is I am trying to figure out the car bit. And if anyone has a recommendation for lodging for three. We can get more than one room if necessary. We are all friends. No couples. Thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2196173000781778/", "likes": 0, "comments": []}, {"id": "2196176124114799", "text": "Hi all! I’ll be going to Italy August 15-23. I fly into Venice, but want to make Venice my last stop. I’d like to break it down like 15-18, 18-21 Rome, 21-23 Venice. We would love a beach or coastal town/base for the 15-18 that will be easy to travel to Rome and then from there to Venice. What would you suggest and what are must see places/tours. Looking to book airbnbs and train tickets by this weekend. I know it’s last minute but we are a group of 4 pretty unorganized ladies lol. Thanks in advance😊", "link": "facebook.com/groups/1373361046396315/permalink/2196176124114799/", "likes": 4, "comments": [{"username": "Jenn Messina Babore", "comment_text": "Venice to Rome is 4 hours by high speed train. If you go further to a west coast town, it would be even further from Venice. A coastal town on the east coast might be a possibility, but you will spending quite a bit of travel time. Florence is not coastal, but is about halfway between Rome and Venice and might be an option to cut down on travel time. Lake Como or Garde might be another option (not coastal, but has a lake). Just some ideas. 🤗"}, {"username": "Dave Colleen", "comment_text": "We did Venice-Florence\n-Cinque Terre-Rome- Venice. All by train."}, {"username": "Jenny Payne", "comment_text": "Hope your booked your accommodation?"}, {"username": "Claudia Amp", "comment_text": "15 th August is Ferragosto and from that date and that week, in Italy we get our holidays; probably the busiest part of all Summer. If you haven’t booked anything, it might be quiet difficult and last minute bookings (slim chances) are quiet expensive."}]}, {"id": "2196177337448011", "text": "I have some extra time in Rome would it be worth it ti spend a couple of hours in Naples?", "link": "facebook.com/groups/1373361046396315/permalink/2196177337448011/", "likes": 44, "comments": [{"username": "Gary Robbins", "comment_text": "Only for the pizza"}, {"username": "Marina Belardo Johnson", "comment_text": "I would pay for a guide and yes you can see the major touristy sites… avoid traffic hours… maybe rent a scooter …?"}, {"username": "Stephanie Santoro", "comment_text": "Catch the funicular and visit Castle St. Elmo with an amazing view. Get back down and get yourself a pizza."}, {"username": "Ania Kubica", "comment_text": "Go to Pompei."}, {"username": "Debra Donofrio Kruk", "comment_text": "We took extra time in Rome for a fabulous tour of Italian food with “Roma Eat Food Experience”. We started our morning by visiting a wonderful cafe, then on to Rome’s largest market. We sampled foods from different stands and restaurants all with our wonderful guide, Chiara. Well worth it!"}, {"username": "Cathy Lonergan", "comment_text": "Did not like naples at all...had a few hours there"}, {"username": "Constantine Matsos", "comment_text": "You really need to spend days or even weeks in Naples to truly appreciate this amazing, vibrant, chaotic and lively city. Don’t waste your travel time there for just two quick hours."}, {"username": "Amy Moran Weltin", "comment_text": "Personally no. Naples is super duper dirty. I would enjoy Rome. Here is a Naples overall pic."}, {"username": "Isa Van Wyk", "comment_text": "No avoid Naples"}, {"username": "Susie CB", "comment_text": "I love Napes … it’s vibrant in a gritty sort of way…. And pizza and arancini (spelling) …. I loved it!"}, {"username": "Susie CB", "comment_text": "Day trip to tivoli is also GREAT…. 30 minute train … just a few euros… quant peaceful town…."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "No."}, {"username": "Cindy Breneman Hattrich", "comment_text": "Yes!"}, {"username": "Jo Ann Schwartz Woodward", "comment_text": "Stay in Rome or go to Tivoli for the day"}, {"username": "Sandy Connell", "comment_text": "I stayed there for a week last year, only as a base, other than the odd few amazing ‘oldest’ restaurants, I wouldn’t. Amalfi coast is only an hour away from Naples, go there instead or across to Capri and see the Blue Grotto"}, {"username": "Rhonda Dinzey", "comment_text": "Yes! The food is amazing and the vibe is great. Don’t miss out!"}, {"username": "Sally Hartmann", "comment_text": "I stayed in Naples then traveled to Amalfi a tour and Puglia by train."}, {"username": "Teresa Heran", "comment_text": "Yes!! Don’t forget the 🍕!!"}, {"username": "Annia Amador", "comment_text": "Nope. Try de CIVITA Di BAGNOREGIO, get a car."}, {"username": "Heyla Louw", "comment_text": "Stay in Rome!!!! Naples is really nothing compared to Rome, really did not enjoy it! Only use Naples as transfer point when you arrive for Amalfi coast etc"}, {"username": "Nicola Lynch", "comment_text": "Yes"}, {"username": "Barbara McMahon", "comment_text": "No"}, {"username": "Sandra Maldonado", "comment_text": "No. Can’t even have a meal in two hours."}, {"username": "Peach Panfili", "comment_text": "No - too far - Go to Tivoli and visit Hadrians Villa on the way."}, {"username": "Lisa DeLeo", "comment_text": "Nope… rather walk down the side streets of Rome! You’ll be delighted to find very special treasures where tourists do not gather."}, {"username": "Graham Sherlock", "comment_text": "Go to Orvieto"}, {"username": "Shirley Roe", "comment_text": "I"}, {"username": "Jaime Cleek", "comment_text": "No. Spend the time in Rome lol"}, {"username": "Julia Clara", "comment_text": "No, but I would go see Pompeii instead"}, {"username": "Lorie Sturm Marcyk", "comment_text": "Rome is nowhere close to Naples by the way."}, {"username": "Lia Geloso", "comment_text": "No. Too far."}, {"username": "Joe Easton", "comment_text": "No. Too far. Go to Umbria."}, {"username": "Kuzya Kuzya", "comment_text": "No!"}, {"username": "Sandy Conrad", "comment_text": "No"}, {"username": "Oneida Ann Murphy", "comment_text": "Herculaneum was so interesting"}, {"username": "Sally Ann Tanasi", "comment_text": "No go to Assisi short bus trip"}, {"username": "Enrico Lecce", "comment_text": "Yes"}, {"username": "Mark Spielman", "comment_text": "days not hours"}, {"username": "S.P. Espy", "comment_text": "I sort of feel like it’s impossible to have “extra” time in Rome. You could live multiple lifetimes there and not come close to seeing all there is to see."}, {"username": "John Lapinsky", "comment_text": "Most definitely! Naples is THE PLACE for good pasta and Chianti! People are friendly and there's a lot to see."}, {"username": "Susan Callahan", "comment_text": "Forget Naples."}, {"username": "Michele Boubede Granito", "comment_text": "Pompeii or the Big museum in Naples (can’t recall name)\nAnd food in Naples is VERY GOOD the San marzano tomatoes …couldn’t get enough"}, {"username": "Ayita Rain", "comment_text": "Planning on going to Iyaly first time.. to make it simple.. doing the whole 14 days based in Naples.\nPlan on doing ferries to the islands.\nAny suggestions on hotels near the port of Naples within walking distance to ferries, metro , etc?\nHope to do a day or so in Sorrento also...\n\nI just want to make it to Italy & look out over the sea!! Lol\nRunning to ,& fro, place to place sounfs echausting. Lol"}, {"username": "Meredith Holloway Helbon", "comment_text": "Following"}, {"username": "Maria Nilialouna Lourdes", "comment_text": "Of course! Naples is amazing!"}, {"username": "Bob Sullivan", "comment_text": "I took the train from Rome to meet friends there and did a tour of Pompeii then returned to Naples for a pizza meal then brought them up to Rome with me. Reading Elena Ferrante books about Naples make me want to make more time for it next time."}, {"username": "Steve Savva", "comment_text": "I would say the distance to Naples and back would not be to your advantage if it’s just for a few hours. Why not visit some of the amazing Roman villas closer to Rome instead?"}, {"username": "Michelle Solak", "comment_text": "Personally I wouldn’t but there are other places you can explore! We did a day trip to Tuscany from Rome and it was one of our favorite days!"}, {"username": "Ann-Dorte Bruhn", "comment_text": "It would👌and have a pizza👌"}, {"username": "AK Kaygen", "comment_text": "Hours? No"}, {"username": "Ted Kostisin", "comment_text": "If you go eat pizza and see this. https://\nwww.museosanseve\nro.it/en/\nthe-chapel-and-t\nhe-veiled-chris\nt/\nthe-veiled-chris\nt"}, {"username": "Paul Wilson", "comment_text": "Tivoli gardens"}, {"username": "Sherri Leis Dillavou", "comment_text": "Naples is awesome."}, {"username": "Lisa Ligammari", "comment_text": "no"}, {"username": "Theresa Salerno Adams", "comment_text": "Tivoli"}, {"username": "Graziella Altobelli", "comment_text": "Couple of hours? Napoli? Are you joking?😂😂😂😂"}, {"username": "Mayra Houston", "comment_text": "No"}, {"username": "Hudd Cass", "comment_text": "No"}, {"username": "Alex Hicks", "comment_text": "I wouldn’t but that’s because I got a bad. The city was dirty and just full of trash or maybe that’s just the train station/\nairport area. Not my cup of tea."}, {"username": "Elsa Hurt", "comment_text": "You need alot more than a few hours.Never enough days in Rome,so much to see and do you will keep going back...I do."}, {"username": "Lisa Ann", "comment_text": "Nope."}, {"username": "Robert Bélair", "comment_text": "Go visit Ostia Antica. The ancient port of Rome. http://\nostia-antica.org\n/"}, {"username": "Linda Espie", "comment_text": "No"}, {"username": "Hermineh Topalian", "comment_text": "You need 4 days and see all Neapel"}, {"username": "Lorissa Gill", "comment_text": "No"}, {"username": "Janet Messanelli Bozzone", "comment_text": "Lmao. Unless you are living there for a year, there is always more to see in Rome. If you have a bug in your bonnet, a day trip to Orvieto or if you like wine a half day trip to Frascati. They have some fun tours that include cooking classes and lunch."}, {"username": "Ariela Hafner", "comment_text": "If you have a full day , you can take a train to florence. If you haven’t been there yet, you can just “taste”\nIts beautiful and small and only 1:40 hour"}, {"username": "Lindsey Snewuab", "comment_text": "No ! Stay in Rome."}, {"username": "Carolina Alejandro Clabaugh", "comment_text": "Yes, Naples is beautiful"}, {"username": "Anthony Attanasio", "comment_text": "No."}, {"username": "Friedemann Diederichs", "comment_text": "No."}, {"username": "Joy Crawford", "comment_text": "Yup"}, {"username": "Eka Chelidze", "comment_text": "No"}, {"username": "Patricia Capuccio", "comment_text": "Most definitely. Eat at Antonio & Antonio"}, {"username": "Stephanie Garofalo", "comment_text": "If you are not going to Pompeii or Herculaneum, I would suggest visiting Ostia Antica. It was once Rome’s main seaport on the Tiber and a beautiful archaeological site. It’s a quick 25 minute train ride from Rome and perfect for a few hours. Enjoy, however you choose to spend your time!"}, {"username": "Rebecca Wilcox", "comment_text": "No, don't waste your time"}, {"username": "Phyllis Snyder", "comment_text": "How about Pompeii?"}, {"username": "Peter Cetani", "comment_text": "Try Ciro a mergellina restaurant you won’t regret it"}, {"username": "Lisa Gaimaro Sullivan", "comment_text": "We made a quick stop on our way from Sorrento to Rome. We only spent a few hours but really loved it."}, {"username": "Bob Dook", "comment_text": "I would save Naples for next time."}, {"username": "John Bruckman", "comment_text": "A couple hours? No"}, {"username": "Debbie Grindal", "comment_text": "Big no from me ! Dirty blah 😒"}, {"username": "Ken Vecchia", "comment_text": "See as much as you can anywhere in Italy"}, {"username": "Bill Elias", "comment_text": "A couple of hours? That’s like lunch."}, {"username": "Megan Jeffries", "comment_text": "Naples is great but you’d need a whole day to get there and back at least. Once you arrive there on the train station you’d need to get a taxi down to Galleria Umberto area which is where I’d recommend you go for a one day trip."}, {"username": "Erica Sylva", "comment_text": "Do it! Go to Naples. I don’t think a couple hours is enough time but go for the day at least!"}, {"username": "Rodger Cravens", "comment_text": "If you won't see it otherwise, yes, of course - fast train to not waste a bunch of time in travel."}, {"username": "Lucie Belle-Isle", "comment_text": "I would not do it but it’s feasible. If you want to eat a napolitain pizza, in Rome, try the Pizza Forum Roma close to the Coliseum on Via San Giovanni in Laterano. A Roman friend took me there a long time ago; it’s a family restaurant, not fancy but I will never forget the pizza I ate there! I then went again every time I was in Rome."}, {"username": "Todd Tracy", "comment_text": "Go just a little bit further and spend time in Sorrento!"}, {"username": "Tal Burdejny", "comment_text": "No. At least a full day"}, {"username": "Jenn Messina Babore", "comment_text": "My opinion, no. A couple of hours wouldn’t be worth it. There is plenty to see and do in Rome plus it’s hot right now, so take that into consideration with your planning."}, {"username": "Kelly Rubec", "comment_text": "No"}, {"username": "Ellie Smythe-Jones", "comment_text": "We thought we could do the same, but it was so hot in Rome that we needed some down time in the hottest part of the day. Take the time to enjoy Rome."}, {"username": "Mary Anne", "comment_text": "Yes! Go to the archeological\nMuseum. Close to the station and has an amazing collection, especially the Pompeii and Picasso exhibition."}, {"username": "Rachel Bradfield", "comment_text": "Nope far more to see in Rome !"}, {"username": "Brianna Sutton", "comment_text": "Nope in my opinion Naples was quite disappointing. Not very well looked after."}, {"username": "Cindy Sguazzin", "comment_text": "No!"}, {"username": "Luca Lookone Ferrentino", "comment_text": "Napoli has as much to see and do as Rome or Florence. It deserves much more than a couple of hours."}, {"username": "Pearl Lucero", "comment_text": "No. By the time you get there you’ll have to turn around and come back."}, {"username": "Simona Patrizia", "comment_text": "Per andare a Napoli occorrono minimo 2 ore ( per andare e 2 ore per tornare). Se sei stanco di Roma potresti andare a visitare Villa d’Este a Tivoli oppure fare un giro ai Castelli Romani"}, {"username": "Tracey Sadiq-Butz", "comment_text": "No"}, {"username": "Jaison John", "comment_text": "Do what makes you happy! We made a quick trip to Naples just to get pizza from L’Antica Pizzeria da Michele and returned back to Rome. If you go, get there a little early (by 1030) to wait in line for a table when they open at 11."}, {"username": "Czecie Reyes", "comment_text": "No"}, {"username": "Jenny Payne", "comment_text": "I love Naples but a lot don’t , why not Florence?🌻"}, {"username": "Alfonso Ingenito", "comment_text": "Naples it’s a city that one loves or hates it’s all about your personality an imperfect city for imperfect people."}, {"username": "Trish Heymer", "comment_text": "A couple of hours is not long enough. If you want to do a little excursion have a look a Tivoli. It’s not far by train. And go for a walk around villa d’este."}, {"username": "Christine Ann", "comment_text": "No. Don’t go."}, {"username": "Ed Wren", "comment_text": "For a couple of hours. No."}, {"username": "Virgz Van Møøre", "comment_text": "A couple of hous would not be enough for Naples, rather look for something off the beaten paths in Rome"}, {"username": "Virgz Van Møøre", "comment_text": "Or enjoy the beach at Ostia, 30 mn metro ride from the Pyramid station"}, {"username": "Nandita Goswami", "comment_text": "It’s a 2+hr commute to go to Naples one way. I personally would not do that"}, {"username": "Leanne Wisbey", "comment_text": "Absolutely, we were initially unsure about Naples but once we got there we loved it! It’s crazy and vibrant and not to be missed IMO ."}, {"username": "Sam Passante", "comment_text": "I’d say Tivoli if you aren’t going back anytime soon, but there’s plenty to see and do in Roma."}, {"username": "Laura Uribe", "comment_text": "If you had more time, it’s a definite yes. But since you only have a few hours, I would choose somewhere closer to Rome like Tivoli or Ostia Antica."}, {"username": "Sandra Shoffner", "comment_text": "Couple of hours is a waist of time. Takes you longer to get there than that."}, {"username": "Karen Richter", "comment_text": "No"}, {"username": "Allan Olexa", "comment_text": "Yes, Napoli is only an hour away by fast train. Napoli is my favorite destination."}, {"username": "Nancy Koehler Barboni", "comment_text": "How about Ovieto? It’s one hour by train. Beautiful, small town with good food and shopping."}, {"username": "Laura Caputo", "comment_text": "Florence is a quick train ride"}]}, {"id": "2196178617447883", "text": "We just realized the Airbnb we booked in Rome has no AC. We are trying to switch accommodations - if you have any good hotel recommendations that we may still have a shot at for Aug 2-4th, please share!", "link": "facebook.com/groups/1373361046396315/permalink/2196178617447883/", "likes": 0, "comments": []}, {"id": "2196191120779966", "text": "Hello all, I’m enquiring about the Piedmont wine region of northern Italy.\nSeeking some advice about travelling and tasting wines without a car. Would it be easier to take a tour ?\nWhat would be a sensible place to base ourselves, Alba ?\nAny recommendations of wineries to visit?\nAppreciate any suggestions,thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2196191120779966/", "likes": 0, "comments": []}, {"id": "2196207217445023", "text": "Hi,\n\nPlanning on going to Italy early summer 2024. Is it too soon to book a trip now or should I wait? Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2196207217445023/", "likes": 0, "comments": [{"username": "Emma Kay", "comment_text": "BOOK"}]}, {"id": "2196192377446507", "text": "Do most shops/restaurants accept apple pay? How about discover cc?", "link": "facebook.com/groups/1373361046396315/permalink/2196192377446507/", "likes": 1, "comments": [{"username": "Jenn Messina Babore", "comment_text": "Discover no. Most have a credit card machine that should take Apple Pay / Apple Wallet, but good to have the physical card as well for wireless payment."}, {"username": "Danielle Johnston", "comment_text": "I used Apple Pay the entire time. The only place that it would t work is the LV store I needed my actual card."}]}, {"id": "2196240514108360", "text": "Anyone booked a trip with an agency that you were able to make payments on?", "link": "facebook.com/groups/1373361046396315/permalink/2196240514108360/", "likes": 0, "comments": []}, {"id": "2196178297447915", "text": "Any semi or professional soccer games around Rome Sept 14-18? Just noticed what looks like field near where we are staying. Traveling with some kids that would love to sed a game", "link": "facebook.com/groups/1373361046396315/permalink/2196178297447915/", "likes": 0, "comments": []}, {"id": "2196180100781068", "text": "Planning a driving tour of Italy in September/October 2024. We are in our early 70’s . Think we will be there 6-8 weeks. Want to see all 20 provinces- mostly interested in country side, cuisine, natural beauty- less interested in museums, art, history … would prefer to very loosely scheduled, not lingering in any one place longer than 2-3 days andआणखी wander back roads etc.\n- How wise is it to NOT reserve rooms until a day or two before- clean, safe, - not necessary to be 5star - 3ish ok?\n- rental car or short term lease?\nThoughts from those of a similar mind appreciated. TIA.", "link": "facebook.com/groups/1373361046396315/permalink/2196180100781068/", "likes": 0, "comments": [{"username": "Steph Craddock", "comment_text": "If you want nature and countryside, the base your route along the Appenines. There is plenty of nature, stunning hill villages, nature reserves and amazing scenery, . In October you ca get away with not book far in advance."}]}, {"id": "2196194407446304", "text": "Planning a trip to Italy - Mid September - my first trip there. Please share about places you visited, stayed at ( anyone used monastery stays), things you did and really enjoyed or just hated… and why? Anyआणखी free spots I should not miss? Any tips for vegetarian travelers?\n\nClean black slate at this point..will chalk it out based on your inputs - hope you understand how much of my happiness depends on your inputs😜\n\nPic for tax.\nGirl in contemplation about gelato", "link": "facebook.com/groups/1373361046396315/permalink/2196194407446304/", "likes": 0, "comments": []}, {"id": "2196200874112324", "text": "Can anyone advise about ferry options or boat tours from Laveno to see the Borromean Islands. Specifically Isola Bella. I see hip on/hop off boats from Stresa but not Laveno.", "link": "facebook.com/groups/1373361046396315/permalink/2196200874112324/", "likes": 0, "comments": []}, {"id": "2196211207444624", "text": "We have driven in northern Italy a few times, around Lake Como, Garda, Dolomites etc with no trouble.\nAmalfi we did a tour but saw how hairy the roads were.\nHow would you describe driving on the east coast of Italy? Similar to Amalfi side, north or a combo?\nTrying to work out what size car to get. Our Skoda wagon was a bit tight on our last trip!", "link": "facebook.com/groups/1373361046396315/permalink/2196211207444624/", "likes": 0, "comments": []}, {"id": "2196211850777893", "text": "I want your best advice on itinerary, taking into consideration the time of year and weather.\n\nOct 27 - Nov 2: Where to fly into and travel?\nNov 2-5: Milan (have to stay here, but can day trip)\nNov 5-7: Where to travel and fly out of\n\nIt will be me and 3 teenage boys who don’t care about museums. We love beauty and adventure and they’ll be fine wherever we go, but I want it to be enjoyable for them.\n\nWanted to go to Cinque Terra, but people are writing that most things will be closed and it will be cold.", "link": "facebook.com/groups/1373361046396315/permalink/2196211850777893/", "likes": 0, "comments": []}, {"id": "2196223130776765", "text": "Hey everyone\nHow is the weather in September?\nI have heat issues 😅", "link": "facebook.com/groups/1373361046396315/permalink/2196223130776765/", "likes": 0, "comments": []}, {"id": "2196224767443268", "text": "Looking to buy tickets to the Collesseum, which site did you guys use?", "link": "facebook.com/groups/1373361046396315/permalink/2196224767443268/", "likes": 1, "comments": [{"username": "Victoria Laverty", "comment_text": "Official site is coop culture"}, {"username": "Jenn Messina Babore", "comment_text": "Coopculture.it is the official site. Tickets open 30 days ahead starting at 9am local Rome time and are added approximately every 15 minutes. They are quickly sold out, so be ready to go. 🤗"}, {"username": "Andrea Corey Andrews", "comment_text": "Viator"}, {"username": "Chantal Campeau", "comment_text": "Get your guide"}, {"username": "Marc Spiegel", "comment_text": "Agoda which is partners with Viator"}, {"username": "Nicole Gouzoules Sheehan", "comment_text": "Viator"}]}, {"id": "2196230430776035", "text": "Just captured by accident someone getting engaged, congrats to this couple!!💓", "link": "facebook.com/groups/1373361046396315/permalink/2196230430776035/", "likes": 734, "comments": [{"username": "Julia Rajska", "comment_text": "Daniel Dorabiała 🥹"}, {"username": "Brittney Williams", "comment_text": "where is this! heading there tomorrow 🩷"}, {"username": "Melissa Cortez", "comment_text": "Absolutely stunning place to be proposed to! 💍"}, {"username": "Serena Nena Melis", "comment_text": "Braies lake?"}, {"username": "Colleen Schimmenti", "comment_text": "Stunning!"}, {"username": "Marcela Martinez", "comment_text": "What a beautiful photo!"}, {"username": "Charlotte Den Decker", "comment_text": "Oh wouldn’t they love to see this one!"}, {"username": "Rominey Goebel Jacobs", "comment_text": "Where is this?"}, {"username": "Elaine Ragonese Prais", "comment_text": "Elaine Ragonese Prais"}, {"username": "Denise Dunlap", "comment_text": "Awwwww. 🥰"}, {"username": "Bonnie Cope", "comment_text": "Absolutely stunning! ❤️\nCongratulations\nto the couple ❤️"}, {"username": "Louellen Klints Karthaus", "comment_text": "Wow!!!!💗"}, {"username": "John Frangoulis", "comment_text": "Christine Sandford Frangoulis"}, {"username": "Jill Clary Hilder", "comment_text": "This place is gorgeous! I must go! Where would that be?"}, {"username": "Vickey Bingham", "comment_text": "Absolutely stunning!"}, {"username": "Vicky Alger Skillman", "comment_text": "Literally one of the most beautiful and romantic scenes for an engagement ever🥰"}, {"username": "Lucy Teneyuque", "comment_text": "Wow!! Absolutely stunning!! I hope, somehow, the couple gets to see this photo!!❤️"}, {"username": "Maureen King", "comment_text": "Congratulations"}, {"username": "Jodi Jackelini-Macumber", "comment_text": "Beautiful!"}, {"username": "Elaine Valte-De Jesus", "comment_text": "So beautiful! Where is this exact location?"}, {"username": "Monique Armbrister", "comment_text": "Looks like Lago di Braies."}, {"username": "Michele Turpin", "comment_text": "Where is this it’s amazing"}, {"username": "Theresa DiLissio-Graham", "comment_text": "Wow, that’s amazing"}, {"username": "Allison Claar", "comment_text": "Absolutely amazing!"}, {"username": "Patricia Lynn Corrao", "comment_text": "Where is this?"}, {"username": "Laura Rehberg", "comment_text": "Oh wow! What beautiful scenery to do it in front of!"}, {"username": "Pauline Putt", "comment_text": "Absolutely stunning!"}, {"username": "Sande Ricci", "comment_text": "Do you need a car to get there? It’s amazing!"}, {"username": "Jo Johnston", "comment_text": "WOW...thats an awesome pic anyway darl."}, {"username": "Christina Everett-Wilson", "comment_text": "Are there Facebook pages for this particular place? Sharing on those pages might have a shot at finding the couple!"}, {"username": "Lauren Kyles", "comment_text": "That is so beautiful!!"}, {"username": "Abby Cardoso", "comment_text": "Where si This"}, {"username": "Liza Correa", "comment_text": "Liza Correa"}, {"username": "Mary Anne", "comment_text": "That’s a fabulous capture."}, {"username": "Sandy Miller", "comment_text": "How awesome!! 😍"}, {"username": "Dana Golden", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Michele Trial Westerman", "comment_text": "Lucky girl!"}, {"username": "Michele Trial Westerman", "comment_text": "Michele Trial Westerman"}, {"username": "Petra Elisabeth Freilinger", "comment_text": "How beautiful !!!!! You can feel the Love !!! ❤️ Very special capture 🌟🌟🌟🌟🌟"}, {"username": "Karen Blackmore", "comment_text": "You need to send them this photo!"}, {"username": "Denise Coman", "comment_text": "We had a similar experience in the church in the centre of Lake Bled, Slovenia recently. A couple were about to ring the bell when it became a proposal. Very special, we quickly slipped outside to give the couple some time alone."}]}, {"id": "2196233640775714", "text": "Hi, I am travelling from Perth to Spain then through Italy for 2 weeks. Im not sure if i need visa for anything...? Just my passport is enough right? you only need a visa if you planning on staying for a long period of time, is that correct? Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2196233640775714/", "likes": 5, "comments": [{"username": "Kristina Ruk", "comment_text": "Kristina Ruk"}, {"username": "Claire Buccini", "comment_text": "Correct"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2196237117442033", "text": "Starting to plan my trip to Italy and Med cruise for Aug 2024. Has anyone done a day trip to Florence from Rome or Tuscany from Rome? Is it doable if we take an early train and then return later in the evening. Is this a bad idea for a day trip? Our cruise leaves from Civitavecchia and trying to squeeze in a day outside of Rome before ourआणखी cruise. Are there other suggestions for places that interesting to see? Naples is our first port so I’m covering off the Amalfi Coast on our cruise. Travelling with my husband and 3 adult children (21, 19, 18). Advice appreciated.", "link": "facebook.com/groups/1373361046396315/permalink/2196237117442033/", "likes": 2, "comments": []}, {"id": "2196238157441929", "text": "Silly question:\nIs it better to reserve hotel room on the hotel webpage or call them directly??", "link": "facebook.com/groups/1373361046396315/permalink/2196238157441929/", "likes": 0, "comments": [{"username": "Kristina Ruk", "comment_text": "As it is better for you ;)"}, {"username": "Jenn Messina Babore", "comment_text": "Website is fine"}]}, {"id": "2195820777483667", "text": "Hello! My husband and I will be traveling with Trafalgar from mid to end of October and we are doing the Wonders of Italy tour(Rome, Venice, Florence, Lucca, Cinque Terre etc.) Wondering what the weather is like then? Should we pack more pants or jackets for that time of year? Also shoe recommendations for night time like a comfortable boot that would go with everything or flat shoe please let me know. I plan on white plain sneakers for during the day. Thanks so much!", "link": "facebook.com/groups/1373361046396315/permalink/2195820777483667/", "likes": 5, "comments": [{"username": "Laura Schellberg Conroy", "comment_text": "Just came back from 2 1/2 weeks. Walked 100+ miles. Dr. Scholls Time Off Lace Up. Wore them 90% of the time"}, {"username": "Kay Rendall", "comment_text": "At night I wear flat ballet slippers in Italy because cobblestones. It will be getting chilly so jacket and perhaps scarf on evening"}, {"username": "Romina Lauretig Toscano", "comment_text": "In Rome medium temperaturr 22 (max)/12(min)\nPerfect month to visit Rome is October!"}, {"username": "Kay Rendall", "comment_text": "22 Max for me, is cold. Used to the tropics. Seems now temps r most higher."}]}, {"id": "2195973334135078", "text": "We are in Puglia 😍, the sunny region between two seas, intense flavours and fascinating destinations: Castel del Monte, the trulli, white picturesque villages kissed by a unique and unforgettable light....follow us!\nDAY 1 - CASTEL DEL MONTE - TRANI ( 30 KM)\nIf you love atmospheres full of suggestions, scenarios that refer to distant times, tales of heroic deeds, then you can't miss a visit of the fascinating Castel del Monte famous for its octagonal shape and the Castle of Trani built in a bay where the low water level was a natural defense against attacks from the sea. When in Trani, you cannot miss also its majestic cathedral a prime example of Apulian Romanesque architecture.\nWhere to stay: Blanco B&B👉 https://bit.ly/3Y0hheV\nModern, comfortable, sparkling clean!!! This B&B is litterally in the heart of the historic centre and also close to the sea where you can admire wonderful sunsets!\nDon't miss a guided tour of Castel del Monte and delve into a fascinating tour of Frederick II of Swabia’s enigmatic castle to take in the exterior and interior in less than two hours. Enjoy the personal attention of a private guide, with plenty of time to ask questions as you explore.\nRead more about Castel del Monte, between wonder and mystery:👉 https://bit.ly/3pLPxOQ\n\n\n\n\n#nexstopitaly #puglia #apulia #trani #castedelmonte #pugliagram #pugliamia #apuliatravels #apulianholidays #adventure #italytrip #italy", "link": "facebook.com/groups/1373361046396315/permalink/2195973334135078/", "likes": 41, "comments": []}, {"id": "2195917570807321", "text": "Discover Montalcino from your home! You will virtually walk through its narrow alleys marvelling extraordinary views over the underlying valley and you will discover its medieval past with its 13th-centuryआणखी defense walls and the historic centre dominated by the 14th-century fortress.\nJoin our NEW virtual experience: https://nextstop-italy.com/virtual-tours/montalcino-tuscany/\n\n#tuscanyexperience #virtualworld #tuscanyitaly #tuscanytour #italyiloveyou #italytravel #medievalart #hilltown #italytrip #sunflowers #rollinghills #medieval #brunello #montalcino #brunellodimontalcino #brunellowine #orciavalley #tuscanygram #brunellomontalcino", "link": "facebook.com/groups/1373361046396315/permalink/2195917570807321/", "likes": 11, "comments": [{"username": "Luana Nogueira Muller", "comment_text": "Cual nombre desta ciudad?"}]}, {"id": "2184472805285131", "text": "Lake Como\nIf you want to live a dream stay at Grand Hotel Tremezzo 5*✨\nThe Hotel is an iconic art nouveau masterpiece sitting on the western shores of Lake Como. 🤩With views spanning the crystalline waters… आणखी towards Bellagio and the Grigne mountains, they will treat you to sumptuous accommodation, three pools, a lakeside private beach and lavish private park, all with the warmest hospitality all’italiana.✨\nBook here for the best price: https://bit.ly/3Y13k0E", "link": "facebook.com/groups/1373361046396315/permalink/2184472805285131/", "likes": 20, "comments": []}, {"id": "2195729767492768", "text": "Hi !! I am in a pickle… do I spend lots of $$ to go to Capri for 2 days (Rome to Naples to Capri and then back to Rome for a flight out to Croatia) or do I just save money and go to Croatia earlier. Advice would be great", "link": "facebook.com/groups/1373361046396315/permalink/2195729767492768/", "likes": 2, "comments": [{"username": "Jeff McLellan", "comment_text": "Lot of travel for just two days IMO"}, {"username": "Nadia Filice", "comment_text": "It’s only 1 hr by train to Naples and then ferry to Capri. I say go to Capri. No other place like in the world. Blue Grotto is stunning"}, {"username": "Miyuki Kanno Paul", "comment_text": "Capri is not cheap. If you want to save money, skip it. But you will miss beauty about the island and end up going there later. We first did a day trip to Capri from Sorrento. We returned to Capri for 2 nights to take advantage of early morning boat tour by beating all the day trippers. I researched enough to find the hotel in which got me the best view from my room knowing that we wouldn’t return for a long time. It was worth it"}, {"username": "Cindy Sguazzin", "comment_text": "Gorgeous beaches in Croatia!"}, {"username": "Bill Ulrich", "comment_text": "If you've already got some time in Italy such as Rome and Naples, Croatia is a great addition."}]}, {"id": "2195804060818672", "text": "Any recommendations\nfor hotels in Rome within walking distance of attractions or near Metro stops?", "link": "facebook.com/groups/1373361046396315/permalink/2195804060818672/", "likes": 3, "comments": [{"username": "Scott Heran", "comment_text": "The Daphne Rome. Cute boutique hotel near the Trevi Fountain, Pantheon, etc."}, {"username": "Debbie DiOssi", "comment_text": "Hotel Artemide. Great location. Amazing breakfast included!"}, {"username": "Christina Lynn", "comment_text": "Hotel smeraldo!"}, {"username": "Romina Lauretig Toscano", "comment_text": "What s your budget?"}, {"username": "Ken Vecchia", "comment_text": "Massimo Deseglio"}, {"username": "Donna Gilardone Szwabowski", "comment_text": "Hotel Nazionale, Pantheon Inn"}, {"username": "Meredith Noll", "comment_text": "Hotel scalinata de Spagna"}, {"username": "Raffaella Di Castro", "comment_text": "Nice apartments? octaviasuitesdo\ntcom"}, {"username": "Katia Macri-Roberts", "comment_text": "I always stay at the Hotel Regno. Centrally located and within walking distance of most places you’d be looking at visiting."}, {"username": "Larry Reinier", "comment_text": "Hotel Smeraldo"}, {"username": "Stephanie Blasko", "comment_text": "Hotel Gregoriana right between Spanish Steps and the Trevi Fountain! A short walk to both!"}]}, {"id": "2195819264150485", "text": "Looking for recommendations for restaurants in Venice. We will only have 1 lunch and 1 dinner there. What are your favorites? Thank you 😊", "link": "facebook.com/groups/1373361046396315/permalink/2195819264150485/", "likes": 2, "comments": [{"username": "Neville Spargo", "comment_text": "We really enjoyed our dinner here , off the tourist track a bit but it does get busy !\n\nhttps://\nmaps.google.com/\n?q=Al+Timon%2C+F\nondamenta+dei+O\nrmesini%2C+2754\n%2C+30121+Venez\nia+VE%2C+Italy&\nftid=0x477eb1ea\n0071d659%3A0xfe\n0d4ff925744152&\nhl=en-AU&gl=au&\nentry=gps&lucs=\n%2C47071704&g_s\nt=ic"}, {"username": "Kimberly Podkulski Damhoff", "comment_text": "Thank you. 😊"}, {"username": "Kelly Hanberg Rosati", "comment_text": "I posted the location above for Restaurante Sant Angelo. We ate there about a week ago and the food was wonderful, reasonably priced and they had AC indoors. We went for lunch and didn’t need a reservation."}]}, {"id": "2195693504163061", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2195693504163061/", "likes": 7, "comments": []}, {"id": "2195814460817632", "text": "What other hotel booking websites have you used? Other than Airbnb or booking.com", "link": "facebook.com/groups/1373361046396315/permalink/2195814460817632/", "likes": 15, "comments": [{"username": "Alexandra A Welker", "comment_text": "Expedia, Hotels or direct"}, {"username": "Betsy Kirkhope", "comment_text": "Expedia"}, {"username": "Roland Trego", "comment_text": "I look at the big hotel sites to see what is available, and then I book directly through the hotel. Generally, they will match any lower rate you find elsewhere. Also, if there is an issue, they will be much more inclined to work with you to resolve things. If you’re looking for Airbnb-type accommodations,\nyou pretty much have to work through them. If you mention which specific area you are going to, group members might be able suggest smaller businesses to book through."}, {"username": "Elizabeth May La Duca", "comment_text": "Hostels.com"}, {"username": "Kim Tremain", "comment_text": "Vrbo"}, {"username": "Dave Conroy", "comment_text": "Cosycosy is worth a look as it aggregates accommodation from around a dozen sites. I use booking and airbnb but if it's a hotel I check price with the hotel site."}, {"username": "Mary Balistreri Swan", "comment_text": "Hotels combined"}, {"username": "Wendy J. Calvin", "comment_text": "Plumguide.com; romeloft.com;perfectvacation\n.com"}, {"username": "Nicole Sultana Tadrous", "comment_text": "Priceline - I love it for hotels and flights"}, {"username": "Renee Rogers Tarrant", "comment_text": "I’d be super careful about AirBnB. I was given a poor rating and this was after I pulled all the sheets and towels off so it’d be easier for the cleaning crew, swept all the tile floors and wiped down all the counters. I tried to get it removed but AirBnB wouldn’t budge. We were a party of 5 all in our 70s and we are out. WTH??"}, {"username": "Barbara Bastianini", "comment_text": "I only book directly with the hotel website. I usually get a better price that way."}, {"username": "Nadia Granito", "comment_text": "Vrbo\nBut you need to make sure they have lots of recent excellent comments !"}, {"username": "Greg Hadubiak", "comment_text": "VRBO"}, {"username": "Amber Bufkin", "comment_text": "Expedia and Travelocity or the hotels directly"}, {"username": "Bill Shafer", "comment_text": "Only use them for searching. Book directly through the hotel."}, {"username": "Shirley Collar Wilson", "comment_text": "Hotel Tonight"}, {"username": "Joy Crawford", "comment_text": "Don’t use airbnb. Have heard nothing good about them"}, {"username": "Joy Crawford", "comment_text": "Expedia. Or tripmasters"}, {"username": "Lynette Lowes", "comment_text": "Been back a couple weeks used Booking. com. Never had a problem."}, {"username": "Joe Guzzi", "comment_text": "Trivago"}, {"username": "Jess Galasso", "comment_text": "I prefer to book directly with my accommodations,\nso I use their unique website."}, {"username": "Ethel Young", "comment_text": "I have done 3 ,three month trips with Bookings.com and always had good places to stay.Very happy with ever place I stayed booked."}, {"username": "Marc Spiegel", "comment_text": "Agoda"}, {"username": "Rosie Grosjean", "comment_text": "Go directly to hotel website once you know which hotel you want. They really appreciate it and you may get discounts! Plus you have direct communication with them instead of jumping through endless hoops with a third party provider!"}, {"username": "Marjie De Villa Lorica", "comment_text": "I use Hotels. Com— and have had no issues in Rome and Lisbon (and elsewhere- Japan, Canada, Mexico, Philippines, and all over US).\n\nI use the option “Pay at the Property” so that when my plans change- or get a better rate at another hotel, I can cancel anytime.\n\nHotels. Com also has a reward s program— for every 10 nights of stay- you get one night free."}, {"username": "Patty Ham", "comment_text": "Find your hotel and then book directly on the hotel website."}, {"username": "Katherine Rogers", "comment_text": "Hotels.com"}, {"username": "Starla Dawn", "comment_text": "Direct"}, {"username": "Jennifer Johnson Mayes", "comment_text": "I used vrbo for Italy in Rome Florence and Venice -\nIt worked perfectly"}, {"username": "Cee Esperance", "comment_text": "I find booking directly with the hotel much better. Most times, I get better rates and perks."}, {"username": "Tom Manno", "comment_text": "None. We always try to book with the hotel we choose. Better rates, less hassle if you have to change."}, {"username": "Donna Parrish", "comment_text": "Hopper"}, {"username": "Janice Rea", "comment_text": "Book through hotel direct. Better price. No worries about cancellation."}, {"username": "Jacquie Johnston", "comment_text": "I have a Chase Mileage card Rocket Miles app I earn miles with their hotels."}, {"username": "Lori Ann", "comment_text": "I look on the sites but then go to the individual hotel sites. Better availability and pricing by booking direct."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "I use hotel booking sites to check availability for my dates, then book directly with the hotel with payment due at check out."}, {"username": "Brian Osman", "comment_text": "The hotel websites themselves"}, {"username": "Madeline Caporale", "comment_text": "Expedia is another option. Personally I only use them to search for options, then I go to the hotel site and book directly with them. Often you will get a better rate and easier to deal with directly if there are issues."}, {"username": "Mike Guarini", "comment_text": "Do most of you stay at hotels then? Booking and VRBO have lots of apartments for rent? Is that not a good idea?"}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "booking is the best! I’ve used almost exclusively. Competitive rates (I cross reference direct w hotels and call to see if they can offer lower), NO DEPOSITS, user friendly, easy cancellations, I’m now genius level so get 20% off of most properties. Plus…I go thru booking from AAshopping (American Air) portal to get 3 miles (sometimes 6) per $1. Win-win.\n\nNow they offer vacation rentals (many I find on Airbnb, VRBO) with NO deposits.\n\nI’m a discerning (very selective) traveler and booking has met/exceeded my desires almost every time! I’m Sold!"}, {"username": "Cindy Capozzi", "comment_text": "Expedia"}, {"username": "Roxanne Curzi", "comment_text": "Book with hotels directly! You can use booking or hotels .com just to search and narrow down options. That is the best way"}, {"username": "Linda Miller", "comment_text": "Booking direct is usually the best way to go!"}, {"username": "Bill Bosco", "comment_text": "Costcotravel.co\nm"}, {"username": "Tammy Jess Mercer", "comment_text": "I check Expedia first as the way you can filter hotels by locations and star ratings is really good. Then once I have a list of hotels, I check individual websites for price comparisons. Good luck!"}, {"username": "Laurel Frost Coffey", "comment_text": "Expedia"}, {"username": "Monica Sucato", "comment_text": "Hoteles.com"}, {"username": "Elaine King", "comment_text": "Priceline"}, {"username": "Susie CB", "comment_text": "Trivago.com"}, {"username": "Steve Grossman", "comment_text": "Those two are the best"}, {"username": "Rhona OConnor", "comment_text": "I only book through www.booking.com - very accurate reviews"}, {"username": "Lydia Springer", "comment_text": "I also use the actual hotel's website. You establish a connection with them and your reservation will be the last to be canceled if something happens. I just believe in one-on-one even if you stay only once."}, {"username": "Theresa Salerno Adams", "comment_text": "Tripmaster"}, {"username": "Sandra Desmond", "comment_text": "You could go direct to your chosen hotel"}, {"username": "Jo Kallidis", "comment_text": "I’ve used both Booking and Expedia .\ncom and no problem. I do however always make contact with the hotel right after booking and confirm it’s been received and confirmed on their end."}, {"username": "Karen Schmidt", "comment_text": "We use a AAA travel agent. She always beats 3rd party prices."}, {"username": "Allison Quevedo", "comment_text": "VRBO and direct to a hotel"}, {"username": "Pierre Coetzer", "comment_text": "Use Travala.com. Pay with Crypto"}, {"username": "Marina Dermenjian", "comment_text": "Expedia"}, {"username": "Daisy Yoo", "comment_text": "Kayak"}, {"username": "Scott Heran", "comment_text": "Expedia is good."}, {"username": "Melissa Valles-Relyea", "comment_text": "Costco"}, {"username": "Lisa Groppi Kahler", "comment_text": "Expedia"}, {"username": "Vanessa Mathisen", "comment_text": "I will not book through third party sites. I use Kayak or another site to find the best prices and book directly with the hotel. I was left stranded one night in a city I didn’t live in because the hotel overbooked and decided they would not honor my booking. I had booked through Expedia, who did not help me find a new booking, and since I hadn’t paid for it yet, wouldn’t give me a refund or compensation to find a new booking. A lot of times it’s been fine, but after that experience, never again. - ALSO - I was informed of this by a clerk from the hotel ON THE WAY TO THE HOTEL AFTER MY FLIGHT LANDED. Unbelievable."}, {"username": "Julie Toms-Fago", "comment_text": "I booked two of our stays through Plum Guide and they were great!"}, {"username": "Megan Dow", "comment_text": "Plum Guide"}, {"username": "Aida Zguro Dora", "comment_text": "Agoda"}, {"username": "Erin Siwak Schuver", "comment_text": "Always read TripAdvisor reviews. Also it gives distances to & from airports, restaurants & shopping."}, {"username": "Christine Piche", "comment_text": "hotels directly, sometimes better service better prices"}, {"username": "Dawn Falcon", "comment_text": "Just booked through Costco travel .\nI like That the transfers from airport and cities were included. Made me less stressful , one less thing to not have to worry about ."}, {"username": "Rosanna Hardeman", "comment_text": "None, I always book direct through hotels and airlines. Learned my lesson with a horrible Airbnb and a trip through Expedia.\nNever again."}, {"username": "Rhonda N Rick Nicholson", "comment_text": "Costco"}, {"username": "Andrea Blasi Chimo", "comment_text": "Expedia"}, {"username": "Ryan Sexton", "comment_text": "Booking.yeah"}, {"username": "Lori Miller", "comment_text": "Vrbo and agoda"}, {"username": "Dany O Murillas", "comment_text": "Best place was American palace amazing buffet and cost around 90 euros a night for 2 if you book months before you can literslly see the Metro station from the hotel ,\n5 stops from the coliseo"}, {"username": "Leah Lulu Miller", "comment_text": "FlipKey"}, {"username": "Casarine Temple", "comment_text": "I book directly with the hotel ."}, {"username": "Sheyla Brasil-Brydun", "comment_text": "I never book thru third party for hotels. Too many horror stories of issues with them. I always book directly with the hotel. Look at trip advisor for reviews of hotels and then go from there. Also if you do end up going thru a 3rd party, make sure to confirm your reservation with the actual hotel this will hopefully help expose any issues with the reservation before you arrive and are stuck with no room."}, {"username": "Julia Fetsek", "comment_text": "Agoda or hotels directly"}, {"username": "Ellen Edmonds-Wilson", "comment_text": "I always book directly with the hotel. Easier communication with them results and it is nearly always cheaper."}, {"username": "Deborah Jewison", "comment_text": "Always go direct with the hotel."}, {"username": "Caroline Langlois", "comment_text": "Expédia"}, {"username": "Rip Lonergan", "comment_text": "Hotels dot com. VRBO"}]}, {"id": "2195815534150858", "text": "Cinque Terre is the must place to visit in Italy 🇮🇹😍", "link": "facebook.com/groups/1373361046396315/permalink/2195815534150858/", "likes": 448, "comments": [{"username": "Chantal Campeau", "comment_text": "Gorgeous pictures😊"}, {"username": "Sandra Chatterton", "comment_text": "See you two weeks ⛴️"}, {"username": "Margo Garner", "comment_text": "Yes it is!!!"}, {"username": "Mariposa Mariposa", "comment_text": "Beautiful looking forward. Where did you lodge?"}, {"username": "Yuko Y Smith", "comment_text": "YES! I agree"}, {"username": "Dixie Kotylak", "comment_text": "Heading there next week, cannot wait!!!"}, {"username": "Ofy Di", "comment_text": "My thoughts exactly! ❤️"}, {"username": "Geraldine Newman-Gray", "comment_text": "Angela Whitton 😍"}, {"username": "Rachelle Ethington", "comment_text": "Go during the off season. CT is so crowded now, travel off peak if you can. Plus, it’s HOT in Italy in the summer, HOT and humid."}, {"username": "Susan Zimmerman", "comment_text": "Yes!"}, {"username": "Jennifer Gavino Gleba", "comment_text": "How do you pronounce the name of the town"}, {"username": "Karrie Doyle", "comment_text": "Amy"}, {"username": "Sarah McKelson", "comment_text": "Melissa Cool Kezia Cool\nWe need to book this day trip"}, {"username": "Kim Elliott Allardyce", "comment_text": "Great photos!"}, {"username": "Joanne Joubert", "comment_text": "Is there accomodation in CT??"}, {"username": "Grace Ang", "comment_text": "Can we get there by speed train from florence ?"}, {"username": "Melody McLean Norburn", "comment_text": "How were your Airbnbs? Love either of them? Conflicted hotel vs Airbnb"}, {"username": "Leanne Beazley", "comment_text": "Sam Beazley"}, {"username": "Helen Salazar", "comment_text": "Fabulous!"}, {"username": "Renee Dillenbeck", "comment_text": "How about the first week of November? Is it worth going then?"}, {"username": "Merida Laughlin Carrabba", "comment_text": "Restaurant recommendations\n?"}, {"username": "Fiona Waterland", "comment_text": "Was there back in the 90s. It is a beautiful place. Off to Sicily this time. Open to any tips 🙂"}, {"username": "Wendy Jean", "comment_text": "Any must do’s in any of the villages?"}, {"username": "Jenny Peltz Phillips", "comment_text": "I had it on my list for September and was talked out of it by many who said it’s just way too crowded:("}]}, {"id": "2194108627654882", "text": "Edit: Where should we rent a car for the Dolomites if we are coming from Lake Garda, spending two days in the Dolomites, and heading on to Venice? We only need the car for the Dolomites.\n\nMy friend and I areआणखी backpacking through Italy in October and going from Venice to the Dolomites for two days via bus. We are not renting a car and are wondering how to explore, where to stay, and what to do if we don’t have a car? Thank you! (Or if a car is absolutely necessary let us know)", "link": "facebook.com/groups/1373361046396315/permalink/2194108627654882/", "likes": 83, "comments": [{"username": "Gonzalo Lopez Serna", "comment_text": "I would say you need a car, so you can take advantage of your two day trip, Cortina is a good place to stay, Misurina and Tre Cime are fantastic and near Cortina, a drive to the queen of Dolomites - Marmolada, Allegue, a hike through Rocca Pietore, Selva di Cadore just to mention some places. Good luck!"}, {"username": "Doug Burke", "comment_text": "I would also say you need a car to really explore the area. We were fortunate to have driven over the Sella pass on a weekend. Had a VERY memorable lunch there on the hotels veranda. Many locals out hang gliding. We talked to a few and they said they could stay up all day riding the updrafts. That kind of experience probably can't happen on a bus."}, {"username": "Marie Kelly", "comment_text": "Dolomites from lake garda"}, {"username": "Antoine Baribal Ndt", "comment_text": "My best advice would be to extend your trip, if you can. Two days are so short! Traveling by bus from Venezia to Dolomites will already eat you nearly one day, depending where you want to go in Dolomites. I'm lucky enough to currently traveling by motorcycle from Chiavenna to Cortina d'Ampezzo and I'm wowed every single day. These mountains are really big !"}, {"username": "Nicola Algerino", "comment_text": "Bellissime le Dolomiti"}, {"username": "Danny Zare", "comment_text": "Currently in the Dolomites as I write this. Val Gardena is a stunning part of the Dolomites. Tonnes of Gondolas and hikes around.\n\nYou won’t need to leave the area once you’re here, so if you can find a bus route here then go for it.\n\nTook this photo today from up top 😍"}, {"username": "Tracy Foss", "comment_text": "Why don't you investigate a eurorail pass ? You look young maybe hostels ?"}, {"username": "Lulu Keo", "comment_text": "Very nice"}, {"username": "Lucas Harder", "comment_text": "You will probably need a car . There is a little ski resort area ( called Kemetar Alm) you should check out . Great hiking at the foot of the dolomite mountains and the ski resort has a little food /pub to get some great local food . It’s just to the west of Innsbruck . If you want to see what it looks like look up on YouTube Home free’s how great thou are music video . The whole video was filmed there . Beautiful ! You should take the time to go see Lago di Brais as well !"}, {"username": "Sarah Salisbury Vander Heide", "comment_text": "We did this same trip last June. We Stayed in Ortisei. Seceda is RIGHT there which was awesome however everything else we needed the car we rented. Hiking locations are pretty far apart. A car will be expensive, we paid $2000 for 4 days but it was needed in the Dolomites. Have the best time, it’s GORGEOUS."}, {"username": "Virginia Walton", "comment_text": "Unrelated but where is this picture from? It’s a beautiful place"}, {"username": "Sarah Leonard", "comment_text": "Having done the Dolomites i wits recommend a car .if tour in the north of the Dolomites the train only goes to calalsco and from there you have a bus through the small villages ..Cortina a very yuppie town and from there you venture out and the sites you will see are great"}, {"username": "Deb Purcell", "comment_text": "Wow 🤩 awesome 👏 Enjoy!"}, {"username": "Maria Aucello", "comment_text": "If staying in Bolzano or Cortina D’Ampezzo can one book tours to different parts of the Dolomites and lake Brais and not rent a car?"}, {"username": "Claudia Castellini", "comment_text": "Wow, Dolomiti are wonderful!\nMoving there by bus is not easy (it’s gonna take much more time than by car) but not impossible, anyway think about it (for sure you can reach the villages, but it could be difficult to reach the\npaths).\nFrom Venice you can go to Cadore: Cortina d’Ampezzo is the most famous village, very nice and chic but also very expensive, if you want to save some money you can stay for example to Pieve di Cadore, Auronzo or Calalzo.\nYou’ll find there paths for trekking absolutely beautiful; try to go to 3 Cime di Lavaredo and Misurina Lake. And if you have time, take a visit to Diga del Vajont."}, {"username": "Coll TC", "comment_text": "Alpina Dolomites hotel was amazing, multiple hikes you could do just by walking out the front door of this beautiful hotel, great food, pool, spa, and service upon returning from a long day of incredible hiking!"}, {"username": "Claire Dowson", "comment_text": "Use the train from Venice to as close as you can get to the Dolomites, then bus the rest of the way. Should cut down on travel time."}, {"username": "Lisa Scott", "comment_text": "For 2 days you won’t need a car. If you can get to Ortisei, there are free buses that your accommodation will give you a card for, that take you to the different hike start points or gondola stations. The hikes around Seceda would be perfect for 2 days from Ortisei as the gondola is right in town. We had a car, but used the buses to get back to our car after hiking to a different finish point.\nAt the other end of the Dolomites it would be harder."}, {"username": "Pauline Richardson", "comment_text": "Take the train from Venice to treviso, then onward to your place of choice."}, {"username": "Melissa Therrien", "comment_text": "I would recommend a car-that way you are more free to explore. It does take longer to get places than google maps says. Our 3 hr trip from Garda to Lago di Braies took 5 hrs due to traffic and apparently car accidents. Same with Braies to Venice-lots of backups-assume a bus would encounter these and you will also lose time trying to figure out how to get from point A to B easily. Cortina would be a good base, definitely check out Lake Braies but lots of tourists there. Ortesei might be nice too. If you plan on sticking to one spot then a bus would be doable."}, {"username": "Cathy McDonald", "comment_text": "Erin McDonald"}, {"username": "Nanette Eustice Gatlos", "comment_text": "If you rent a car you’ll need an international drivers license for Italy. Easy to order online and cost is around $30, but takes a few weeks to come in so take care of that matter now. Without it many companies won’t rent and it will keep you out of trouble if you get pulled over by police."}, {"username": "Maria Piccolo Stern", "comment_text": "I would go directly to Ortisei. From here, you can take the lifts right from town to the iconic Alpe di Siusi and Seceda trails(two different full day, hikes trust me). ￼ the town has lots of holiday houses to stay in, and a sweet little village with lots of café, restaurant and shopping action. If I were only going for two days, this is where I would stay. I was here for 10 days last year and it was fantastic but I had a car so we were able to venture further abroad, but there’s so much to do in just two days here that it would be my top recommendation.\nThere’s a great website called throneandvine.c\nom that can give you a broader perspective, but they do speak to this area ￼"}, {"username": "Chris Vilsack", "comment_text": "You can do the trains as well. The Italian countryside is so beautiful. If you rent a car, you're busy driving instead of soaking up the beauty. Have a great time!"}, {"username": "Gianfranco Di Marcello", "comment_text": "Check this website: www.suedtirol.i\nnfo and you will find information and tips about the Dolomites. Hope it helps"}, {"username": "Sara Overbagh Hammonds", "comment_text": "I completely agree with Danny Zare about Val Gardena being a stunning place. And it is situated in a great part of Dolomites as a home base and then going from place to place. It’s about 1.5 hrs from Cortina and about 1.5-2 hrs to Lake Braies, etc. And tons more places.\n\nAlso… it is fairly easy to get around via cable cars… though we recently used cable cars, it was not cost effective. Not sure if that is of consideration. 🤷‍♀️ There was easy access to the bus right in Val Gardena to get all around. Just preparing and planning each days excursion and it should be fine.\n\nWe had a car to drive all over but it depends where you want to go, how many days you will be in Dolomites, etc."}, {"username": "Sara Overbagh Hammonds", "comment_text": "Also I was worried about staying in Val Gardena because we originally wanted to have home base in Cortina. I much preferred that we stayed in Val Gardena. It was more quaint and really comes down to preferences. It would also be really nice to stay somewhere in Alta Badia area. So many places/small towns/villages in that area that would have been amazing to stay. Depends on how remote you prefer to be."}, {"username": "Francesca Liz", "comment_text": "Tabitha Morris"}, {"username": "Keith Crossley", "comment_text": "I can't help that much but I'm reminded (1970) of leaving Verona (hitching) and cutting off my jeans into shorts, then being treated by some Italians to dinner in Cortina where there was snow on the ground. The road to Bolzano, then was 2-lane. Now there's a highway."}, {"username": "Victor Viquez Arias", "comment_text": "Pao Mora"}]}, {"id": "2195283674204044", "text": "Hi all, I've been wearing these shorts under all my dresses in Europe because of the heat and it's been amazing. They're like stocking material so super light but really prevent your thighs from rubbing whichआणखी can be super annoying and painful. They're not shapewear, literally just stockings but shorts if that makes sense? Longer than bike shorts to actually stop your thighs touching. I picked mine up from Snag which has quite inclusive sizing but you can get them from amazon, asos etc. I bought like 5 pairs with me and I wear them everyday with my dresses, super comfortable. Just a thought if this is something you're worried about like I was!\n\nEdit: This is the link for the Snag ones I bought https://snagtights.com/collections/chub-rub-shorts", "link": "facebook.com/groups/1373361046396315/permalink/2195283674204044/", "likes": 386, "comments": [{"username": "Laura Bolzic", "comment_text": "Been wearing them for years they are the best"}, {"username": "Andrea Willis", "comment_text": "Link to buy them?"}, {"username": "Jessica Stone", "comment_text": "I've always just used deodorant lol"}, {"username": "Ashley Czinege", "comment_text": "Erin Brown lol"}, {"username": "Lizzie Packer", "comment_text": "I've got Snag \"shorts\" too - they're great! Very light and breathable. You wouldn't see them. I've got tights and leggings too - all very good quality."}, {"username": "Gina Hassett Hunt", "comment_text": "Are they by Snag???\nAre they made of a cooling fabric?"}, {"username": "Sally Edwards Rice", "comment_text": "Thigh Society cooling. best thing ever. almost any color you would need and now they have one with a pocket. lots of choices, but I love cooling"}, {"username": "Sally Edwards Rice", "comment_text": "thighsociety.co\nm"}, {"username": "Lane West", "comment_text": "I love Thigh Society- I’ve been wearing their ‘cooling’ shorts under dresses. I can’t even feel they’re on. They’re very comfortable. I also wear bike shorts with pockets but I haven’t worn them under dresses because quite honestly, I can’t picture hiking up my dress in public to get my phone or cash out of my pocket. Is anyone successfully doing this without looking like you’re flashing people? Lol!"}, {"username": "Joyce Natkin", "comment_text": "Great idea"}, {"username": "Deborah Beattie", "comment_text": "Do you have a link for them?"}, {"username": "Tera Reece", "comment_text": "I did the same thing and they were life saving! Can’t imagine if I hadn’t"}, {"username": "Renay Barham", "comment_text": "Snag Tights are the absolute BEST!!! Chub Rub shorts and all theirs tights to the rescue!! All sizes include🤩🥰🤩🥰"}, {"username": "Sally Sprinkle", "comment_text": "Miss Mary brand from Sweden is the BEST I’ve found. Expensive but worth it"}, {"username": "Gracie Luebben", "comment_text": "I will be trying Knix brand. I liked that they had free returns."}, {"username": "Charlie Louise Moore", "comment_text": "I use something similar too! I also wear them at home for a bit more modesty when my dresses are on the shorter side. Xx"}, {"username": "Aberdeen Juliet", "comment_text": "These are the ones I bought if anyone was wondering, super light weight (not like shape wear) and don't ride up at all, literally stay all day\nhttps://\nsnagtights.com/\ncollections/\nchub-rub-shorts"}, {"username": "Nicole D'Emic", "comment_text": "Anywhere to buy this in Italy? Sorrento?"}, {"username": "Lynsey Lingard", "comment_text": "If from the UK (the ship internationally\n) Snag Tights do them for all body shapes, no matter what your size and they are amazing, a real life saver 🙂"}, {"username": "Jodi Assink", "comment_text": "Julie Beasley"}, {"username": "Raquel Feio", "comment_text": "Maria D'Elia"}, {"username": "Cara Calabrese", "comment_text": "They’re amazing!"}, {"username": "Ewa Kolodziej", "comment_text": "Completely agreed on that!\nI m in Italy at the moment and is sooooo hot.\nI bring some linen trousers and dresses .\nDefinitely dresses only for me"}, {"username": "Henriette Langius", "comment_text": "😂😂😁😁Here in The Netherlands they are in Al sizes and material. 100% cotton is the best in warm conditions"}, {"username": "Sara Zangenberg", "comment_text": "Are they super high waisted? I ordered a similar pair and I am very short waisted so they almost go up to my bra 🙄😕🤦🏼‍♀️\nI am hoping to find something that is normal length like hits my waist or just above my belly button."}, {"username": "Elizabeth Lynch Gannon", "comment_text": "Skorts is the way to go. This post is nothing but an Ad."}, {"username": "Antonela Božić", "comment_text": "I use them too, best thing ever!"}, {"username": "Lorraine Moody", "comment_text": "If you live in the UK Marks and Spencer’s sell them 2 for £20 I think, they are super soft and to be honest you hardly know you have them on."}, {"username": "Anna Biscotto", "comment_text": "I do the same thing"}, {"username": "JoLynn Waters", "comment_text": "We are in Puglia now and it's even too hot for these, even though I wear them in the states. You can also use this to prevent chafing. Megababe thigh rescue anti-friction stick"}, {"username": "Jessica Stewart", "comment_text": "I live in south Florida and wear ones like this under all my dresses they are a must"}, {"username": "Patricia Ricci", "comment_text": "Bonds have great ones as well."}, {"username": "Michele Relle", "comment_text": "I used bike shorts"}, {"username": "Michele Relle", "comment_text": "I do not have the rubbing issue, but I used bike shorts just to feel better if my skirt blew up or if I bent over in an unladylike fashion, or if while sitting, touring, or riding in a golf cart, I had appropriate coverage."}, {"username": "Rayandra Alexander Seville", "comment_text": "This is my plan: dresses from this company. I bought a few. BTW, super comfortable. It keeps me cool too!\n\nhttps://\nhalara.com/\nproducts/\ncut-out-twisted-\nside-pocket-2-i\nn-1-barre-balle\nt-dance-dress?p\nmui=10.1.collec\ntion.list.1.dre\nsses-skirts-1_2\n006&pmuih=dress\nes-skirts-1&req\nuestId=71441488\n199044215183&va\nriant=429193520\n41638"}, {"username": "Cheryl Finley", "comment_text": "MELERIO Women's Slip Shorts,... https://\nwww.amazon.com/\ndp/\nB07VPJ2B71?ref=p\npx_pop_mob_ap_s\nhare\nThese are really great to wear under dresses! Pretty cheap too!"}, {"username": "Mary Rawlings-Taylor", "comment_text": "Great post! ❤️"}, {"username": "Olena Yaryhina", "comment_text": "How they are called if I want to research Amazon for them?"}, {"username": "Elaina Toriello Scozzari", "comment_text": "Do you have the link for theses?"}, {"username": "Lucie Belle-Isle", "comment_text": "Sounds like something I will try!"}, {"username": "Debbie Keller", "comment_text": "Link please? Did I miss it?"}, {"username": "Patty Bee", "comment_text": "Thigh society- great for comfort and cooling!!"}, {"username": "Heather Jennings", "comment_text": "Noelle Stoyles"}, {"username": "Nikki Hjort", "comment_text": "are they seamless? like if I wore a tighter dress, would you be able to see the lines of them?"}, {"username": "Keri Forbess-McCorquodale", "comment_text": "I like the length of these. The ones I have are too long for most of my dresses."}, {"username": "Myra Young Miller", "comment_text": "https://\namzn.to/44yWu4W\nAnyone tried these?"}, {"username": "Beth Scanlon Donnelly", "comment_text": "Ordered mine from Walmart -from jockey. Loved them!"}, {"username": "Mary Stinnett Boggs", "comment_text": "Are they not hot and sweaty? I think hosiery material and spanx would be uncomfortable out in the heat. I only wore them under a dressy dress at formal events in air conditioned rooms. I typically wear pants or capris so have not been necessary. But if i were to wear a sundress to be cooler outside, it seems that these shorts would defeat the purpose."}, {"username": "Rebekah Dietsche", "comment_text": "I love these!!! I wear them under dresses all of the time!!!"}, {"username": "Hillary Lindsay", "comment_text": "Thank you for sharing!"}, {"username": "Donna Winters Samford", "comment_text": "I was just looking at these last night - thanks for the endorsement!"}, {"username": "Sylvia Navarro", "comment_text": "This is a must have if you're going to walk in the Italy heat with dresses. Make sure that they're over 90% cotton for a nice breathable material. I was in Italy in June"}, {"username": "Karina Mendoza", "comment_text": "Do they ride up at all?"}, {"username": "Laura L Biberdorf", "comment_text": "what are they called if you search to buy"}, {"username": "Darcy Hinrichs", "comment_text": "I have these and they’re awesome under dresses! I got mine off Amazon. Very inexpensive but super comfortable!"}, {"username": "Darcy Hinrichs", "comment_text": "These are the ones I’ve been wearing for awhile. They’re around $20 for 3 pairs and they’ve been awesome!"}, {"username": "Rebekah Dietsche", "comment_text": "The fact that this ad popped up immediately after liking/\ncommenting on this post..both creepy and comical.\n\nhttps://\nwww.thighsociety\n.com/\n?utm_source=fb&u\ntm_medium=paid+\nsocial&utm_camp\naign=US+-+Top+I\nnterests+-+Conv\nersions+–+%28In\nfluencers+July%\n29&utm_content=\n06282023+-+US+-\nNicole+Lemke+–+\nCopy&fbclid=IwA\nR0CdyxyHW-VgvXK\nJYLuB1iyeDjp-Xe\nFkYisyS2Ql_ogKo\n0fGJXbOuj1wRE_a\nem_AX9fLUjR_kZV\nWYGm3eKvP5XHZ8L\nJQTidk9Kr0oQ9dq\ny0lz3BNdB1wH86O\n15xkX1cYzxYmv0X\nFM-HeAzvBKd9WbK\n_&campaign_id=6\n359049642633&ad\n_id=63590498348\n33"}, {"username": "Jessie Madunic", "comment_text": "I did the same, it was perfect!"}, {"username": "Pat Beaulieu Hickey", "comment_text": "ordered"}, {"username": "Melissa Redclift Barr", "comment_text": "Thanks for the advice! We will be going in 2025 and I am gathering all sorts of good tips from this group!"}, {"username": "Alessandro Iannelli", "comment_text": "i often use them, they are not just for women. some people here call these \"ciclisti\", because it's the kind of shorts that people who practice cycling use."}, {"username": "Emily Kelley Arrowood", "comment_text": "I ordered something similar from Thigh Society and had zero chub rub for my week trip. It was amazing!"}, {"username": "Kristine Kuhns Hoover", "comment_text": "Link?"}, {"username": "Meg Gajda", "comment_text": "I don’t have this problem"}, {"username": "Michele Wade", "comment_text": "Just commando plenty of fresh air then😂"}, {"username": "Fiona Turner", "comment_text": "They're awesome aren't they?! Easy to wash and dry too, great for travelling 🙂"}, {"username": "Jennifer Turbeville Hazen", "comment_text": "Getting these and a Brazilian blowout are the two smartest things i did prior to my trip."}, {"username": "Lori Van Tassel Pinco", "comment_text": "I bought Woxers.. boxers for women.. best things ever.."}, {"username": "Jen Alexitch Rachow", "comment_text": "Always wear these under my dressed! Covers chafing and windy days - no peep shows 🤣🤣🤣"}, {"username": "Cindy Santa Ana", "comment_text": "For ladies who think they don't have this problem, I walk at home all the time and never have thigh rub, but in Italy the heat and sweat gave me such a rash because I was wearing sundresses mostly. Get one!"}, {"username": "Karen Van House Westrick", "comment_text": "Made such a difference in comfort for those long days of walking and even though I am normally a Capri person in the summer, I found it was so much cooler to wear a sundress with these type of shorts. Highly recommend"}, {"username": "Lauren Davis", "comment_text": "These are for sure a lifesaver! Would 100% recommend if you plan on wearing skirts or dresses."}, {"username": "Kathy Flood", "comment_text": "I used monkey butt powder which worked but wore off. These would have been great. I used to laugh when people posted thigh gap photos years ago...but boy I would have loved to have a thigh gap last week!"}, {"username": "Jo Courage", "comment_text": "Brilliant thank you for the tip, have saved your post to follow up before travelling 🙌🫶🏻"}, {"username": "Jan Smith", "comment_text": "I got some from Target in summer. Not sure if they have them all year round. $20 and were great for summer in Cairns."}, {"username": "Jan Armstrong", "comment_text": "I agree. An absolute lifesaver"}]}, {"id": "2195295607536184", "text": "What's the best way to book trains?\n🚂 Traveling from Pisa - Florence - Rome!", "link": "facebook.com/groups/1373361046396315/permalink/2195295607536184/", "likes": 3, "comments": [{"username": "Grace James", "comment_text": "Which country or city do you mean?"}, {"username": "Rhona OConnor", "comment_text": "Use the Trainline app - Google maps are helpful for working out routes but it dosent include local busses."}, {"username": "Laura Schellberg Conroy", "comment_text": "Use the Trenitalia App. Just came home from 2 1/2 weeks in Italy. We traveled between all major cities by high speed train. So easy. Book in advance. You can do a day trip to Pisa from Florence. Hour train ride and runs frequently. Both ways"}, {"username": "Frank Hunt", "comment_text": "Trainline app and or Tranitalia."}, {"username": "Lynn Francisco Casella", "comment_text": "Show up"}, {"username": "Connie Wilson", "comment_text": "TrenItalia"}, {"username": "Jihan Adem", "comment_text": "Also Rome2Rio app"}, {"username": "Rich Garcia", "comment_text": "We used the omio and Trainline app. Prices varied, both have all the train schedules."}]}, {"id": "2195161307549614", "text": "Is it easy to get a cab around the Colosseum during rush hour to go back to the port?", "link": "facebook.com/groups/1373361046396315/permalink/2195161307549614/", "likes": 4, "comments": [{"username": "Romina Lauretig Toscano", "comment_text": "Taxi services are not easily available this period in Romd due to high percentage of tourists... you can also use the app."}, {"username": "Helen Ladkin", "comment_text": "We took a ships bus into Rome and back to the ship. Our plan was to visit a couple of sites we missed on a previous trip and have a leisurely lunch. It all turned to hell. A family were late getting to the bus on our trip into Rome, so it was nearly 11, and pouring with rain when we arrived. Change of plan, so ate lunch first hoping the rain would stop. Haha, no such luck. Cobblestones awash, our Jeans soaked up to the knees. Took refuge in the Pantheon, but of course the marble floor was so slippery and dangerous. We were having a good laugh about our trials, but they weren’t over. The bus pickup point was a nightmare,took ages standing in the rain before we could access the bus. Then guess what the same family held us up again! By this time we were leaving Rome in peak hour and it was a slow crawl out of the city. We would have missed the sailing if the bus hadn’t been booked through the ship. Managed to retain our senses of humour, but decided never to leave a ship for Rome again.\nSo my suggestion is to take a ships tour to the Colosseum. Happy sailing."}]}, {"id": "2194992004233211", "text": "I am curious about Sixt car rental. How was your experience? How is customer service if you require assistance during the rental period?", "link": "facebook.com/groups/1373361046396315/permalink/2194992004233211/", "likes": 4, "comments": [{"username": "Kari Spain", "comment_text": "I just read a review mentioning that there verified car was not available snd they were downgraded to a very small model. Beware!"}, {"username": "Andrea Parsons Eubanks", "comment_text": "We used Sixt in Florence (at the airport) and had a great experience. I reserved the car online and picking the car up was easy and fast. We dropped the car before they opened and left the keys in the Dropbox. We had no issues during the rental period so can’t speak on that part."}, {"username": "Miyuki Kanno Paul", "comment_text": "We used Sixt at Bologna. Keep in mind that Sixt has a certain rental policy that Fiat and Alpha Romeo fleets won’t be available if you are driving into/dropping off the car in Campania, Calabria, (and Basilicata if my memory serves right) due to high theft issues. We were assigned a BMW X1 instead of Alpha Romeo Giulietta because of it. We are going to di it again in 3 months. This time will be just Emilia-Romagna and neighboring regions only"}, {"username": "Teresa Brewer Harkins", "comment_text": "I’m curious as to how to get to a car rental place when arriving by train in Florence?"}, {"username": "Glenn Meadows", "comment_text": "They are involved in multiple legal disputes over deceptive and fraudulent practices. My own experience is not good. Beware !!"}]}, {"id": "2195324237533321", "text": "Hi everyone!\n\nFirst off, my husband and I would like to thank everyone in this group for sharing all of the tips and recommendations because it helped us tremendously in planning our Italy dream trip! Now we would love to share our tips, recommendations, and experiences to hopefully help someone else with their planning!\n\nOur itinerary: June 28th-July 11th\nPackages booked through Priceline\n\nFlights- ATL-Venice June 28th-29th (Direct flight)\n\nFirst stop: Venice June 29th-July 1st 📍\nShared water taxi from airport to hotel (GetYourGuide booking)\n\nAccommodations: Hotel Dona Palace\n\nTours: Doge's Palace & St. Mark's Basilica with Terrace Access Tour\n\nRestaurants:\nRistorante Centrale Pizzeria\nRistorante La Piazza\nVenchi Chocolate Shop\n1000 Gourmet Venezia\nDel Moro's\nSuso Gelato\n\nSecond stop: Florence July 1st-July 4th 📍\n\nAccommodations: Grand Hotel Cavour\n\nTours & Activities:\nTuscany Day Trip from Florence:\nSiena, San Gimignano, Pisa and Lunch at a Winery (Viator)\n\nRestaurants:\nPaoli Antico Ristorante Dal 1827\nGustapizza\nGelateria dei Neri\nAuditore Ristorante Braceria\nAll'Antico Vinaio\nOsteria Belle Donne - Wine Window\n\nThird stop: Rome July 4th-July 7th 📍Accommodations: UnaHotels Decò Roma\n\nTours & Activities:\nTwilight Trastevere Rome Food Tour (Eating Europe)\nColosseum, Roman Forum & Palatine Hill Guided Tour (Viator)\nVatican Museums, Sistine Chapel, & St. Peter's Basilica Guided Tour (Viator)\n\nRestaurants:\nRistorante la Nuova Piazzetta\nOro Bistrot Cocktails\nAi Tre Scalini\nPastasciutta\nOsteria da Fortunata\nMr. 100 Tiramisu\n\nFourth stop: Amalfi July 7th-July 10th 📍\nAccomendations: Hotel Luna Convento\n\nTours & Activities:\nBoat tour to Li Galli islands and Capri from Amalfi (YouKnowBoat)\n\nRestaurants:\nLa Veranda\nRistorante L'Abside\nTorre Saracena\nPasticceria Pansa\n\nFifth & Final Stop: Back to Venice (July 10-11th) 📍\nAccommodations: Hotel Monaco & Grand Canal\n\nFlights: Venice-Amsterdam / 1 h layover / Amsterdam-ATL July 11th\n\nApps:\nTrenitalia - Trains\n** Book early! Cheaper tickets and better options for seat selection. We did business class for each train\nThe Fork - Restaurant reservations\n**We did about 40% reservations. Many did not take reservations. Arrive at 7:30-8pm and there is minimal wait time to be seated\nGoogle Translate: the image feature was so helpful in translating menus\n\nPhone: We did the AT&T $10 International day pass and it worked fantastic! No issues the entire time\n\nCurrency: We only took $400 euros with us that I had ordered through our bank. It was perfect for us because many places took credit card. We have the Capitol One Venture card which has a zero transaction fee internationally.\n\nPickpocketing: no issue but we both took precautions with our front crossbodies\n\nPacking: We each only took a backpack and carryon. Packing cubes were a life saver! I got 20 outfits in one cube. Personally, I strongly advise packing lighter because of all the walking.\n*** Essential items: Front crossbody, portable iPhone charger, tide pens, RFID passport wallet, sunscreen, collapsible water bottle, and comfortable shoes\n\nHiccups: Every trip has them right? Well on our way from Florence to Rome on the train, my husband and I accidentally got off at the wrong stop…. But not only that, I left my crossbody bag (which had my passport, credit cards, drivers license, and money) in the train seat. After a minor panic attack we went to the ticket office where an employee was able to call the train and locate my bag. I was able to get it back 4 hours later!\n\n******Research, research, and more research! I can’t say enough how doing researchprior to our trip was so important. We were able to be present in the moment and really make the most of the time we had. Also, only scheduling one activity per day and setting time aside for breaks was life saving.\n\nIt truly was a trip of a lifetime ❤️", "link": "facebook.com/groups/1373361046396315/permalink/2195324237533321/", "likes": 758, "comments": [{"username": "Irene Oda", "comment_text": "Congratulations\n. Well done on your research and enjoyment of am amazing vacation."}, {"username": "Nina De Martino McDonough", "comment_text": "Thank you! We are going next year to Rome and I’m just starting this process!!"}, {"username": "Nina De Martino McDonough", "comment_text": "How did you do the schedule?"}, {"username": "Kathy Brooks Taveira", "comment_text": "Great tips!"}, {"username": "Meredyth Stitt", "comment_text": "I’d love the itinerary please 🙏"}, {"username": "Janet Woods", "comment_text": "Lyn McGlinchey"}, {"username": "Élodie Maureau", "comment_text": "hello good evening how are you I hope that well I am here to make friends and also looking for a serious relationship"}, {"username": "Gulcan Osman", "comment_text": "Debbie Ann"}, {"username": "Laine Luis", "comment_text": "how was the tuscany day trip from florence via Viator? i am looking at taking that tour. thank u"}, {"username": "Doreen Drew", "comment_text": "You’re so right about researching! We did Paris, London, Ireland and Scotland. It took me over 6 months of research and booking reservations but it was so worth the effort. Ours too was a trip of a lifetime. Two times to Italy and would go tomorrow😍"}, {"username": "Michelle Plat-Cal", "comment_text": "Looks amazing"}, {"username": "Carol Hayes", "comment_text": "Wow! Thank u for sharing!"}, {"username": "Dina Matalka", "comment_text": "Thank you for taking your time to write this post, is it possible if you. An send me the plan to my email in order to have a clearer schedule Dina.matalka@gm\nail.com"}, {"username": "Jenny Meffert", "comment_text": "Great post. Thank you."}, {"username": "Gina J-w", "comment_text": "Great itinerary thanks for sharing . Aiming to go out again next year and let the train take the strain as they say . Definitely will be using some of your ideas."}, {"username": "Sandra Monacelli McNall", "comment_text": "Hoping to be in Rome, Florence and Naples in late sept"}, {"username": "Debbie Pumo", "comment_text": "Awesome! Thank you for sharing!!"}, {"username": "David Trusty", "comment_text": "What’s the best time of year to travel to italy"}, {"username": "Cheryl Caferro Shul", "comment_text": "awesome !! Thanks for the tips"}, {"username": "Cheryl Caferro Shul", "comment_text": "Would you be able to direct message me the itinerary please and thank you"}, {"username": "Sania Junejo", "comment_text": "Sania Junejo"}, {"username": "Lynette MacLean", "comment_text": "Thanks for the details it’s very helpful 🤗"}, {"username": "Ghida Tannous", "comment_text": "Beautiful pics and waaaw organization. Planning with my husband and 12 and 8 year old kids in august 2024. Can you email me tge itinerary please?\nTghida@hotmail.\ncom\n\nThanks"}, {"username": "Ilana Brongiel", "comment_text": "We are doing a very similar trip next June (Venice, Florence, Rome and Sorrento) with 3 nights in each place- similar activities too! Did you find that the two days in Venice was enough or did you enjoy the extra night? We arrive at 11am the day we arrive so debating on leaving Venice the evening before to Florence instead of the next morning. Doesn’t do much except give us an extra few hours in Florence and one less overnight in Venice. BUT we can do a morning tour that day in Florence.\n\nAlso- looking at the Tuscany tour that includes the cities and wine tasting. Did that feel rushed or was it a good pace? Thanks!!"}, {"username": "Kimberly Podkulski Damhoff", "comment_text": "Favorite restaurant in Venice? We only have the 1 night there 😊"}, {"username": "Andre Le Huray", "comment_text": "Naomi Murphy"}, {"username": "Lisa Fuentes Farless", "comment_text": "Wow, your itinerary looks a lot like what we have planned, from the tours (used viator) to train to backpack and carryon, crossbody bags and ATT $10 a day plan. Thanks so much for sharing! Makes me feel so good knowing that some of my plans may work well. I may ask you for some more advice along the way, if that is ok?"}, {"username": "Rania Harrim", "comment_text": "Yousef Alqasieer"}, {"username": "Dana Birdwell Shofner", "comment_text": "Will you email me your itinerary? It looks very similar to what we are planning m:)"}, {"username": "Tara Moyers Francis", "comment_text": "Can you email your itinerary to me as well?"}, {"username": "Adriano Chan", "comment_text": "Bookmark 🔖 Thank you ♥️"}, {"username": "Jacqs Ellen McCorkindale", "comment_text": "Brilliant detail, great share 🌺"}, {"username": "Mindy Blankenship", "comment_text": "This is amazing information. Can I DM you for the itinerary?"}, {"username": "Mindy Blankenship", "comment_text": "Wendy Blankenship Evans"}, {"username": "Berta Havens", "comment_text": "Thank you!!!!!! So much 😊"}, {"username": "Renee Schoenbrun Rubin", "comment_text": "Great info"}, {"username": "Martinez Berta", "comment_text": "HinKayleigh Chaney thanks for sharing this is super helpful… how where the tours you took in Florence (wine tasking) and Venice ? Did you enjoy it? Any hiccups ?"}, {"username": "Dana DiCaro Traver", "comment_text": "Planning a trip to the same cities Sept.2024. Could I get a copy of your Itinerary? I will DM you. Thanks!"}, {"username": "Tanya Robertson", "comment_text": "Kayleigh the pic of balcony having dinner drinks, what was the name of hotel. Were there a lot of stairs around hotel?"}, {"username": "Kathleen Hardick", "comment_text": "We are also staying at the Hotel Dona. Were you happy there?"}, {"username": "Emma Blaikie", "comment_text": "Thank you for sharing your amazing itinerary Kayleigh. My husband and I are traveling mid August. Would you mind sending to me via messenger? 🙏"}, {"username": "Patty Treat", "comment_text": "Great itinerary! Thanks for the tips!"}, {"username": "Rob Tait", "comment_text": "Hi Rob from Australia. We're travelling to Italy in October. Did you have any trouble with pickpockets?? Any tips . You pics look great . Thanks"}, {"username": "Kathy Knipp", "comment_text": "Love your post! The itinerary from start to end back at home. It’s going to come in very handy towards my planning. Thank you 😊"}, {"username": "Jenny Frank", "comment_text": "love the montages: how do u make that?"}, {"username": "Anne Luscombe George", "comment_text": "Great itinerary and really helpful how you presented it. Will be screenshotting and saving!"}, {"username": "Jessica Kromer", "comment_text": "Wow this is amazing!! Thank you for sharing!!"}, {"username": "Randy Karli", "comment_text": "Do we need to take a portable translator on our trip to italy?"}, {"username": "Denise Dunlap", "comment_text": "You’re my hero!!\nI love making spreadsheets to organize things!\nI did one for our last trip to Paris and will do one for our Italy/Rome trip next year. (I may just have to print yours out and change your names). 😂"}, {"username": "Joanna Janzen", "comment_text": "Awesome. Looks like you guys had a blast.\nWould you mind sending me your itinerary"}, {"username": "Lisa Gonzalez Propri", "comment_text": "Great post! Thanks for info. Saving the Rome info on restaurants etc We will be there in Sept! What portable iPhone charger do you recommend"}, {"username": "Mary Beth", "comment_text": "Love ALL the recommendations\n. Thank you for sharing."}, {"username": "Michelle C Cohn", "comment_text": "Thank you for sharing😊"}, {"username": "Beth Morton Cahill", "comment_text": "We have booked the same full day trip from Florence out to Pisa and Sienna and was wondering if you enjoyed it?!?! Looking very much towards ours in September so hoping you were pleased!!! It will be a LONG day!!!"}, {"username": "Suzanne Brewer Griffin", "comment_text": "This looks amazing"}, {"username": "Suzanne Brewer Griffin", "comment_text": "Sheila Renea"}, {"username": "Bernadette Sarmiento", "comment_text": "This is amazing info - thank you! I am headed to Italy next month and have jotted down so much useful info. Grateful for this wonderful group 💕"}, {"username": "Susan Wise", "comment_text": "What brand of carry on luggage did you use?"}, {"username": "Neysa Kennedy Dumas", "comment_text": "Jean Claude Dumas"}, {"username": "Christine Bernasconi", "comment_text": "Wow amazing info- now what’s a ‘tide pen.’ ?"}, {"username": "Sheila Tharin Ewing", "comment_text": "You are so kind to share this information. Your itinerary matches our plans for May 2024 except we want to go to Pompeii. My question for you is what was your favorite and least favorite experience?"}, {"username": "Caroline Piliere", "comment_text": "Thanks for sharing!!! Sounds like had a blast."}, {"username": "Joya Nicastro Cherry", "comment_text": "Thanks for all your great info"}, {"username": "Sandra Coyle", "comment_text": "THANK YOU! So much valuable information.\n\nI have one question. If too personal it’s okay, but would you mind sharing cost for said trip (not including personal purchases of course) would love to know a general budget."}, {"username": "Maria Zannis", "comment_text": "Drew Blackwell"}, {"username": "Dan Rodelas", "comment_text": "In terms of budget, how much overall would be estimate of the entire trip?"}, {"username": "Janelle Kloss", "comment_text": "Kayleigh Chaney thanks so much for sharing. I thought I left a comment earlier but now i can’t find it and I’m not sure if I tagged you. Would you mind sharing how much the hotel was per night in amalfi? Also how far ahead of time did you book it? Thanks I’m advance. I love seeing everyone’s pics 🇮🇹❤️"}, {"username": "Ashleigh Cartwright", "comment_text": "Hi Kayleigh 🙂 We have also booked the Tuscany, Siena, San Gimignano, Pisa and Lunch at winery tour. We booked through get your guide, was your tour with ‘sightseeing experience’? What time did you return? Thank you 🙂"}, {"username": "Lisa Wylin", "comment_text": "You guys are awesome! Gorgeous photos!💕"}, {"username": "Soc Cer", "comment_text": "I love how you made a collage of your photos for each city/town you visited! Beautiful pics...thanks for sharing!"}, {"username": "Susan Tardif", "comment_text": "Thank you for your thorough post, my husband and I are doing the exact route and exact number of days. I have a reservation at Torre Sancera in Amalfi, how did you like it?"}, {"username": "Donna Romano", "comment_text": "What did the total cost per person?"}, {"username": "Lynnelle Richardson", "comment_text": "Your Tuscany trip from Florence sounds like what we did. It was awesome! Also highly recommend a trip to Cinqu Terre from Florence."}, {"username": "Jodi Thornton Lindsey", "comment_text": "F"}, {"username": "Cara McShea", "comment_text": "Wow thank you!!!! Looks amazing and so detailed!! Much appreciated"}, {"username": "Barbara Johnessee", "comment_text": "Would love to have your itinerary!\nWe will be in Italy first week of September. Hard to read the itinerary. Also going to Venice and Florence. Thank you!"}, {"username": "Julia Muller", "comment_text": "Wow you got super lucky with your bag on the train 😲🙈😝"}, {"username": "Machenzie Wickre", "comment_text": "Thank you so much for sharing! This makes me even more excited to plan our trip for next October. I’m going to send you a DM. I would love a copy of your itinerary if possible. 😊"}, {"username": "Anj Pl", "comment_text": "Harsh Patel"}, {"username": "Kimberly Podkulski Damhoff", "comment_text": "Great detailed post! So happy you loved your hotel in Venice. We booked the same one for Sept. 😊"}, {"username": "Janet Halliburton", "comment_text": "So helpful! Grazie Mille!"}, {"username": "Rebecca Stricharczuk", "comment_text": "Kayleigh Chaney great information! Sounds like a wonderful trip! Who makes your crossbody? It looks like a good size. Thank you in advance!"}, {"username": "Sarah Kerr Hopple", "comment_text": "Very informative and helpful post. Thank you!"}, {"username": "Debbie Jones Schilling", "comment_text": "I just want to say you are so sweet for responding to everyone, sharing your itinerary a couple hundred times, posting links to answer questions… I’m so happy for you that you had a great trip. Looks beautiful."}, {"username": "DeDe Tyler", "comment_text": "Robert Coltrane"}, {"username": "Josephine Rauch Rotunda", "comment_text": "I’m glad you had a wonderful trip. Your pictures are great. What a nice itinerary. You had me at leaving you a bag I would’ve never recovered from realizing I left my bag with all my important papers on the train. I’m so glad you survived the ordeal…. I know it’s nothing to stress so much about at everything could be replaced, canceled, etc. But it certainly would’ve put a damper on your trip. I’m so glad it worked out for you and that there are good honest people around! ❤️￼"}, {"username": "Lori Ann Victorio Wolkwitz", "comment_text": "Amazing."}, {"username": "Zack Barrentine", "comment_text": "David Fritts"}, {"username": "Barbara Gentilcore", "comment_text": "Joshua where do you live and who did you fly with? I ask that question in regard to carry on luggage weight limitations?"}, {"username": "Annette Reyes", "comment_text": "This is awesome! My husband and I are getting ready for a trip and the overthinking is killing me! These tops are super helpful! Sounds like an amazing time! 😊"}, {"username": "Donna Brannon Hudson", "comment_text": "What transportation did you use for your trip to Tuscany or was this provided by the Viator tour? All of this information is so useful. Thank you for sharing."}, {"username": "Joan Wallis", "comment_text": "Thanks for sharing! My husband and I a re planning a trip for June 2024!!"}, {"username": "Cynthia Gedemer", "comment_text": "Wonderful photos Kayleigh Chaney! Could you DM your itinerary? Thank you!"}, {"username": "Carol Johnson", "comment_text": "The best app to have is ..TRIPIT … it will automatically store all your reservation hotel, dinner,tour etc. You can add yours own plan. Just did a three week tour in Europe."}, {"username": "Michael Rudder", "comment_text": "Kate Rudder"}, {"username": "Maria Coladangelo Ducca", "comment_text": "I am so glad that you had a great time . I keep suggesting only one thing a day . It is a vacation not a job . Glad you located your crossbody bag ."}, {"username": "Carolynn Hinz Reed", "comment_text": "Would you go back to any of the hotels in Venice, Florence and Rome? Same w/restaurants? Thank you!"}, {"username": "Debbie Haigh", "comment_text": "Thanks for sharing!"}, {"username": "Lynette Peter", "comment_text": "Great advice. We're planning for 2024. Thanks for all the great info you provided. Curious to know if you found any Transfer operators from Amalfi-Naples under Euro100 - or know of any other affordable options? Cheers"}, {"username": "Lesley Stewart-D'Ortenzio", "comment_text": "Would you have the link for the Venice tours, I can't find. Please & thanks"}, {"username": "Ellie Fokke", "comment_text": "Bodiene Fokke"}, {"username": "Sue Anderson", "comment_text": "Thank you so much, we’re going in2024 and our itinerary is practically the same! Is there any chance you could email it to me? Susan.Anderson@\neducation.vic.g\nov.au"}, {"username": "Melissa Natasha Coleman", "comment_text": "Jeeten Jagadis"}, {"username": "Kara M Vaina", "comment_text": "What was Grand Hotel Cavour like? It’s on my list of hotels for Florence."}, {"username": "Brenda Patterson", "comment_text": "We did the twilight Rome tour as well - was AMAZING!!"}, {"username": "Struan Robertson", "comment_text": "Hang on, i have to find my magnifier."}, {"username": "Mary Balistreri Swan", "comment_text": "You were so lucky to get your belongings back."}, {"username": "Heather Bovard", "comment_text": "Can you send me the picture of agenda\nWhen I make them big you can’t read"}, {"username": "Karen Cervi", "comment_text": "Love how detailed you are! You must be a teacher.\nGreat pictures!\nWe are doing Venice, Florence and Sorrento next week.\nThank you for the tips!"}, {"username": "Mary White", "comment_text": "I love your format. I didn't write down everywhere we ate, visited but will go back through our pictures to see if I can figure them out."}, {"username": "Anisha A Sachdev", "comment_text": "Hey can you please send me this itinerary"}, {"username": "Anisha A Sachdev", "comment_text": "We are planning a trip to Italy"}, {"username": "Ariel Alysha", "comment_text": "This is amazing. Thank you so very much Kayleigh for sharing this with everyone. Is it ok if I DM you my email so you can send it to me?"}, {"username": "Jhermie Ortega", "comment_text": "Laine Luis"}, {"username": "Natalie Coniston", "comment_text": "Hi, Such a great detailed itinerary, heading there next year and doing our own, a WIP. A copy of yours would be really appreciated, will DM you with my email. TIA ☺️ oh quick ? I’m thinking X2 nights Siena and do wine tour/\nsightseeing from there instead of Florence, thoughts 🤔"}, {"username": "Sim Greenoli", "comment_text": "Thank you"}, {"username": "Dianne Merrick", "comment_text": "Helpful report thankyou"}, {"username": "Melissa Santos", "comment_text": "Please tell me more about the food tour in Rome! Worth it?"}, {"username": "Judy Dimino Olsen", "comment_text": "Thanks for sharing! Lots of info and looks like you had a great time!"}, {"username": "Roshni Amroliwala", "comment_text": "Mehernosh Amroliwala"}]}, {"id": "2195346687531076", "text": "I know this is not a popular thing to do as everyone used credit cards these days. We do not. We use cash here at home and cards only when necessary or for ordering, reservations, that type of thing. It is completely unrealistic to do this in Italy as well? If so, why?\n\n***Edit: Thank you all for the responses, they are very helpful. I’m myआणखी original post I should have clarified that I am traveling with a group that all hotels, transportation, tours, and some meals are paid through the group, not me personally. Like I paid them $XXXX so I don’t have to worry about others. So I really need money for lunches, purchases, and other incidentals. I will of course have a card for emergencies, just don’t want to use it unless an emergency.", "link": "facebook.com/groups/1373361046396315/permalink/2195346687531076/", "likes": 18, "comments": [{"username": "Sara Hertz", "comment_text": "I take cash but always put money into my credit card so it’s a positive balance and take that too for any serious shopping and just as a back up and I’ve never had any problems carrying and paying in cash."}, {"username": "Peggy Fisher", "comment_text": "Both use a waist belt, Amazon. Keep all money on your person, not in hotels. I buy pants with zipper pockets and a cross body zipper locking purse. Amazon Travelon purse. Use a small one. You can get a everything you need from Amazon."}, {"username": "Joe Guzzi", "comment_text": "The cash transaction limit in Italy is only EUR 5000, so keep that in mind."}, {"username": "Jackie Duffy", "comment_text": "We used cash the whole time, with no issues at all x"}, {"username": "Bonnie Scoullar", "comment_text": "Susan Brown Daley Cynthia Hanley"}, {"username": "Maria Coladangelo Ducca", "comment_text": "I always use cash .!"}, {"username": "Audrey Daenzer", "comment_text": "I used mainly cash. I took out 2,000 Euros."}, {"username": "John Layman", "comment_text": "Just make sure to check your change when making a purchase."}, {"username": "Judy Jamieson Pisano", "comment_text": "One problem with paying in cash is that many shops don’t carry much change, and won’t accept large bills for purchases. If you bring cash don’t bring anything larger than 20€ notes."}, {"username": "Desiree Jimenez", "comment_text": "I prefer cash for most everything except the hotels. It's very doable in Italy."}, {"username": "Lori Van Tassel Pinco", "comment_text": "We used cash pretty much everywhere. Only used credit cards a few times.."}, {"username": "Aline Grazieli", "comment_text": "I’m not in Italy yet, going soon but have traveled all over Europe (and other continents) and have used both (cash and credit card) though after the pandemic more places have preference of cc. Enjoy your trip"}, {"username": "Miyuki Kanno Paul", "comment_text": "Some restaurants take reservations online and require credit card number to hold the reservation. Sometimes deposit on card is required. Same things for hotel reservations. Since the pandemic, more more places accept credit cards in Italia. However, small establishments,\ntaxi, and shops prefer cash. They may not give exact change back if you try to use large bill. Sometimes cash is the only method of payment accepted. Some B&Bs offer you cash discount.\n\nI use cash for haggling at a store when going after a certain products especially ceramics. But carrying a huge amount of cash has its risk. Flashing a bundle of cash in public…is not a good idea😞"}, {"username": "Wendy Spano Bracco", "comment_text": "I take enough cash for the trip. Prefer to use cash and not cards. If they take my Amex, I use that first. I save the cash for those places that don’t and the little things, taxis etc…no one had ever turned down my cash!"}, {"username": "Sandra Desmond", "comment_text": "I’ll take out some cash in my own country, I’ll have my cards too"}, {"username": "Martha Lee", "comment_text": "Thats how I travel. People have been brainwashed by the credit card companies that they have to use cards. So you come home to a big bill they can charge you lots of interest on. Some have fees for exchange rate etc too. I like having cash. Its easy and a lot more flexible and easier to use"}, {"username": "Tess Galinato Perez", "comment_text": "Every time I use my credit card, I get points. Points turn into miles and miles mean flights where you'll only pay taxes for your airfare so for me, credit card all the time unless merchants want cash only. Currently on a 5-week trip to Europe where I used points to book my flights.🙂"}, {"username": "Cynthia Marie", "comment_text": "We are the same, home and abroad. We use cash except when making reservations like lodging and advanced ticket purchases. We keep an eye on the exchange rates and exchange dollars with her local bank."}, {"username": "Phyllis Snyder", "comment_text": "You would have to carry around sufficient cash for your needs every day- or going to the atm frequently . Also prebooking tickets to events and longer train trips are best done online with CC. If by unfortunate event your wallet or purse is stolen or lost you have zero way to recoup you $."}, {"username": "Rebecca Branta", "comment_text": "You can use cash but credit card is so easy. You’d have to convert a lot of cash to euros and in my experience that is costly. Also if you have a credit card that gets points you can earn points for your money spent on this trip. Win-win!"}, {"username": "Sigrid Cormier", "comment_text": "Cash is king. And you don’t come home to a pile of debt at 24% to pay off over the next 5 years…."}, {"username": "Alla Zats", "comment_text": "You can use cash at restaurants and to make purchases, you might even get a discount if you bargain. Not sure about paying for the hotel."}, {"username": "Karl Wilder", "comment_text": "I use cash everywhere Businesses appreciate it. Every time you use the card you transferring 3% of the money to the oligarchs who are destroying the world."}, {"username": "Sue McIntyre", "comment_text": "You’ll be fine. We did use a card at the train station toilets because we ran out of euro coins! 😂"}, {"username": "Brian Osman", "comment_text": "Cash is fine, order it threw your bank before you leave, I allowed 100 euro a day for myself"}, {"username": "Grace Scinto", "comment_text": "I would suggest a travel card loaded with euros. If you use a travel card you are putting your money on at an exchange rate you know. Then withdraw or spend as you go like cash. It’s more like a debit card.,"}, {"username": "Patricia Spinney Loranger", "comment_text": "Would buying some prepaid credit cards work for you instead of carrying cash?"}, {"username": "Romina Lauretig Toscano", "comment_text": "Italians still use a lot of cash...restaura\nnts, cabs, etc all happily accept cash :)"}, {"username": "Frances Scannapieco", "comment_text": "I travel to Italy every year. No groups just me and sometimes a friend. I never use credit cards. I only use cash. I have a card for emergencies only. I pay for hotels, food, transportation around Italy etc with cash.\nI have never had a problem"}, {"username": "Graham Sherlock", "comment_text": "You can use a debit card, where the funds come out of your savings account. Just make sure the debit card is attached to an account that has euros in it that way you pay no fees. So transfer money from your daily account into a \"world wide wallet or Travel account\" and convertt it to euros in that account. You can top up your euro account anytime online when you are in Italy. So you are using a debit card not a credit card."}, {"username": "Lynn Crane", "comment_text": "We brought a card and used it occasionally liek maybe 3 times, but for the most part we are cash people as well. Didn't have any issues during our recent 3 week trip."}, {"username": "Jan Armstrong", "comment_text": "I found that they accepted cash in Rome more than they do in London. Some just wanted Card only but most of the restaurants and cafes took cash, as did the metro ticket machines"}, {"username": "Yvonne Donnellan", "comment_text": "Cash is not Hygienic. Since COVID less and less places accept it."}, {"username": "Yvonne Ormson", "comment_text": "Cash is fine and usually preferred. We just take euros out of atm as needed.\nWe rarely use credit cards when travelling."}, {"username": "Jayne Dawson Meyer", "comment_text": "Cash is king. Cards charge the shops a % to use.\nAlso remember using a card that the exchange rate changes daily, plus costs from the card. So, oh yeah Euros are the way to go if you perfer. No worries"}, {"username": "Rosemary McClenaghan", "comment_text": "Safety issue either having to carry it or find somewhere in room to leave it (some may not have a safe.)"}, {"username": "Michelle Casillas", "comment_text": "You can use cash. In fact like others are saying it is preferred in most places. Use card for hotel, trains, etc. just use an actual bank atm or the atm at a post office. Otherwise you’ll be paying anywhere from a 13-18% up charge!"}, {"username": "Irene Oda", "comment_text": "No-one will turn down cash. It's a safety issue for me personally. I'm not going to have several hundred of thousands with me or on my person."}, {"username": "Melissa McCormick", "comment_text": "We did not use credit cards. We took cash out in 500 euro increments with our debit. You decline conversion so your bank will use their conversion which is wayyy less. Ex. If you didn’t decline conversion 500 euros would be 635 usd. With declining conversion 500 euros was 535-545 usd depending on the day."}, {"username": "Esther Starren", "comment_text": "Cash is fine and even preferred"}, {"username": "Ellen Edmonds-Wilson", "comment_text": "You’ll need a card for online booking of skip the queue tickets. Don’t carry too much cash with you at any one time. Taxi drivers will love you as they seem to always ask for cash, especially in Rome."}, {"username": "Michelle Dougherty", "comment_text": "The only time it's ever been an issue was at hotels that won't accept a debit in place of a credit card, and car rentals that do the same.\nOtherwise, everyone still prefers cash."}, {"username": "Rita Levi Montalbano", "comment_text": "Im italian and i stick with your ideal. Definitely cash is preferred here, youll probably have more problems if you only want to use the cc"}, {"username": "Pam Gerretsen", "comment_text": "We always use cash for any smaller purchases - drinks, gelato, lunch, and cc for supermarket shops and dinners out, entry tickets, etc."}, {"username": "Jenn Messina Babore", "comment_text": "Not a problem at all. Most would prefer cash to credit in my experience in Italy this past week. Just be aware that bank fees can (and likely will) add up, so it is more pocket-wise to use a no foreign fee credit card."}, {"username": "Victoria Laverty", "comment_text": "I have used debit card everwhere"}, {"username": "Alexandra A Welker", "comment_text": "It's not unrealistic because Cash is king BUT there's a safety issue; the fear of getting it stolen. With CC you have that layer of protection if it gets stolen."}, {"username": "Dianne Lloyd", "comment_text": "Get travel cards, a joint account with separate cards, and put your money on it. You can use it like a 'credit card' (without the interest) and it reduces the amount that could be stolen. if one is stolen you can stop it and still have a back up. But, if you decide to take cash definitely, please, keep it safe AND do not pull out a WAD and flash it - people are watching!"}, {"username": "Colleen Jennings", "comment_text": "You’ll find plenty of places - restaurants, bars, museums etc - who take cash. By law in Italy you must be issued with a receipt."}, {"username": "Voula Ladas", "comment_text": "Cash is sometimes preferred by some businesses, but I would at least have a plan b . What if that cash was stolen ? What then ? Not ideal to be carrying a lot of cash as a tourist . It’s also a big germ carrier . I would recommend a travel fee free debit card ( similar to cash ) , a credit card , and some cash . This covers all bases . But don’t keep them all in the same place, for the reasons mentioned above ."}, {"username": "Paul Anderson", "comment_text": "We pay cash for most everything and they like it. Big ticket items like ferry crossings go on a card."}, {"username": "Rose Stolarek", "comment_text": "Cash is fine . All the places we went to took cash"}, {"username": "Richard Stein", "comment_text": "We are currently in Italy, and have yet to use cards except for hotels, everyone takes cash."}, {"username": "Tanya Bitar", "comment_text": "I was told by a tour guide that Italians are taxed 63 percent by the government. Simply, 63 euros out of 100 goes to the government. If this is accurate, ￼ how are they supposed to make any money if they still need to pay gas, wear and tear, and etc. ￼Again, this was told to me. I believe this applies to individuals with their own business."}, {"username": "Gillian O'Callaghan", "comment_text": "You can do it there.....just be prepared for a few places being \"card only\"."}, {"username": "Caroline Croghan", "comment_text": "Cash is king 😊"}, {"username": "Richelle Trezise", "comment_text": "Just use a travel card. Your money"}, {"username": "Steph Craddock", "comment_text": "No. The Italians prefer cash as credit card fees are ridiculous here. The Italians resent losing that money to the banks."}]}]