[{"id": "2193891444343267", "text": "Any comments re UBER in italy as opposed to taxi?", "link": "facebook.com/groups/1373361046396315/permalink/2193891444343267/", "likes": 3, "comments": [{"username": "Ahmad Seafan", "comment_text": "IT Taxi is the best for use , uber in italy just a normal taxi's"}, {"username": "Andrea Brown", "comment_text": "It’s only Uber black so nicer cars, wasn’t a huge difference price though. Only I think in Milan and Rome- at least last I was in Italy."}, {"username": "Brian Osman", "comment_text": "I used taxi's, readily available"}, {"username": "Enrico Lecce", "comment_text": "I would rent a car for sure"}, {"username": "Enrico Lecce", "comment_text": "Enrico Lecce"}, {"username": "Janet Lugar Miller", "comment_text": "Thanks everyone! Grazie..merci..\nShukran"}, {"username": "Nakitha Badon", "comment_text": "All the Ubers were sedans in rome but I had success with Ubers and taxis"}, {"username": "Felicia Macchia", "comment_text": "Try FREENOW it’s like an Uber"}, {"username": "Annalisa Francesca Gianna", "comment_text": "Uber is only in Roma and Milano. Uber black and much more expensive. If you must, taxi is better option."}, {"username": "Ed Novak", "comment_text": "Taxis in Rome were very reasonable"}, {"username": "Fabio Scherillo", "comment_text": "In Rome the subway is a great way to get around and is really cheap compared to taxi and Uber"}, {"username": "Karen Schmidt", "comment_text": "Uber in Rome was great!"}, {"username": "Tina Ferrari Cuva", "comment_text": "Took one in Florence and it was more expensive than a taxi."}, {"username": "Sarah Wood Armstrong", "comment_text": "Used Uber no problem"}, {"username": "Dominic Po", "comment_text": "No Uber in Pisa"}, {"username": "Ashley Kruger", "comment_text": "In Rome, I could book taxis through Uber."}, {"username": "Janelle Urquidez Harris", "comment_text": "We used both.. Uber is more expensive but we had better luck getting one then with the taxi apps at times."}, {"username": "Luciana D'Angelo", "comment_text": "Taxi"}, {"username": "Amanda Lynn", "comment_text": "It’s available. We had better luck with hailing a taxi. If you use the Uber app to get a taxi—you’ll see something like $13-$18, and the couple of times we did it that way we were charged more than $18 so don’t use a taxi through the Uber app!"}, {"username": "Alessandro Battxi", "comment_text": "Rent a car > taxi and uber"}, {"username": "Catherine Lackey", "comment_text": "No Uber in Florence. Rome was easy to call an Uber."}, {"username": "Jerry Lyubelsky", "comment_text": "U will see a taxi option on the app if available. It was cheaper than selecting Uber if there was a selection"}, {"username": "Patrick D'Achille", "comment_text": "In Milan found Uber slightly more expensive than taxis."}, {"username": "Alessandra Pasteris", "comment_text": "In Rome, taxis can be hard to come by, especially during heavier tourist months. It wasn’t abnormal for it to take at least an hour before we were able to hail a taxi or get one from a taxi stand. Much easier and faster to use Uber in our case.\n\nThe FreeNow app also works but it’s VERY slow to get a taxi as well."}, {"username": "Neville Spargo", "comment_text": "We have found the taxis very good so far , just this morning used a taxi from hotel in Napoli to ferry port and was very good , very courteous, very little English so be prepared with google translate . So far all used a meter and no rip offs yet 😃"}, {"username": "Jill Medrano Casey", "comment_text": "We used it all the time in Rome. Download the app. We had a group of six, so it worked better for us than taxis. We never had to wait longer than 10 minutes. Cars were always nice, clean. You have the option for a taxi too on the Uber app. Uber was always available faster."}]}, {"id": "2193893304343081", "text": "Thanks for letting me in! I'm sooo excited to be visiting in September!", "link": "facebook.com/groups/1373361046396315/permalink/2193893304343081/", "likes": 2, "comments": [{"username": "Wendy J. Calvin", "comment_text": "Welcome!!!"}]}, {"id": "2193899207675824", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2193899207675824/", "likes": 2, "comments": []}, {"id": "2193903701008708", "text": "Hello everyone. Just asking if you know any good restaurants in Rome. Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2193903701008708/", "likes": 0, "comments": [{"username": "Ray Camillire", "comment_text": "Ray Camillire"}, {"username": "Jerry Lyubelsky", "comment_text": "Here are our 3 favorites\nPane e salame\n* Sapori e Delizie-pizza by colosseum\n* Antica Birreria Perini"}]}, {"id": "2193904384341973", "text": "Airbnb or Hotel in Rome ?? Thoughts ?", "link": "facebook.com/groups/1373361046396315/permalink/2193904384341973/", "likes": 2, "comments": [{"username": "Tim Curry", "comment_text": "We’ve had great experiences with both. For us, if it’s a short stay, hotels are sometimes better and apartments can be better if you’re staying more 3 days or more. But we still look at both and then let price, location, and comfort help make the choice."}, {"username": "Gary Bailey", "comment_text": "G-rough hotel is a bit of both and a hidden gem less than a block from piazza Navona"}, {"username": "Scott H Fɭƴŋŋ", "comment_text": "I'm team airbnb. This was my view from my balcony"}, {"username": "Scott H Fɭƴŋŋ", "comment_text": "Scott H Fɭƴŋŋ"}, {"username": "Gena Diaco Penland", "comment_text": "We did Airbnb. We are a family of 4(2 teenagers) and a hotel room is just too small! Plus with an apartment you can get some groceries!"}, {"username": "Alessandra Pasteris", "comment_text": "Yup. Airbnb here (we’ve done hotels in the past). We loved the flexibility of the Airbnb, especially with kids and my parents in their 70s. The options of locations of the Airbnbs we could choose from were numerous. Definitely worth it."}, {"username": "Cameron Hambrick Blankenship", "comment_text": "We stayed in an Airbnb and loved it!"}, {"username": "Petriela Bacheva", "comment_text": "Airbnb"}, {"username": "Roland Trego", "comment_text": "It depends on when you can get into the unit. If I have bags and am expected to care them around or find storage until 3:00 or 4:00pm, that is an inconvenience."}, {"username": "Renee Kremesec", "comment_text": "MAKE SURE THEY HAVE A/C in Summer"}, {"username": "Stacy Derouin", "comment_text": "Team hotel here! But it is a personal preference for sure. We don't go on vacation to to cook or clean, and we like having a concierge for a resource."}, {"username": "Silvia Arndt", "comment_text": "Going to Italy for 2 weeks in September…we booked all Airbnbs"}, {"username": "Andrea Marie", "comment_text": "Hotel 100%. Airbnbs are destroying neighborhoods."}, {"username": "Sarah Longman", "comment_text": "Hotels are perfect for a night or two, anything longer, I do airbnb. Look for Super hosts."}, {"username": "Lisa Adams Robertson", "comment_text": "Depends. First time in Italy? How long will you be in Rome? For a short stay, I'd recommend a hotel since they will likely have a front desk and can help with info/\ntransportation/\nluggage storage on days you check in/out. They will also likely have breakfast right there at the hotel. For a long stay (at least 5 days) an Airbnb might make more sense. You'll likely get a bigger space for the same or less money, and will have a fridge to keep food/drinks, and a microwave and cook top. You might also get a washing machine, which is handy if you've been traveling awhile and Rome is your last stop."}, {"username": "Kristin Ronquillo", "comment_text": "I get too worried about all the last minute cancellations with Airbnbs lately. I'm going with hotels."}, {"username": "Paula Brink", "comment_text": "Hotels only for me. Airbnb is a scourge-wreckin\ng neighbourhoods around the world."}, {"username": "Patty Foster", "comment_text": "We pick Airbnb’s often. Like the living space to even just hand”g out and talk. Especially if more then 2 people. Also, we usually have a meal or leftovers or something while traveling per day . Not sure this will happen while in Italy with so many yummy choices . 😁"}, {"username": "Lisa Citrowske", "comment_text": "IQ hotel"}, {"username": "Nadia Filice", "comment_text": "Hotel"}, {"username": "Melissa Feielin Hawkins", "comment_text": "Team hotel, but it’s whatever your preference is.\nWe like the 5star hotels for the luxury, but also everything that comes with the hospitality. They take car of our black car service needs, ‘making reservations at the hard to get into Michelin restaurants, set up tours you may want to take etc. we’ve been in Milan, Venice, Naples, all over the Amafli coast and Rome this month and every hotel has been beyond outstanding"}, {"username": "Joel Minter", "comment_text": "Alicia Thompson Minter"}]}, {"id": "2193907894341622", "text": "Planning my first trip to Rome next year. Looking at end of March. Is it too rainy then?", "link": "facebook.com/groups/1373361046396315/permalink/2193907894341622/", "likes": 0, "comments": [{"username": "Alessandra de Luca", "comment_text": "Yes, it could be. Most beautiful period of the year for visiting Rome is October. Sunny and warm days and no so many tourists around."}]}, {"id": "2193908854341526", "text": "Hi! Is vaticantickets reliable?", "link": "facebook.com/groups/1373361046396315/permalink/2193908854341526/", "likes": 0, "comments": []}, {"id": "2193909837674761", "text": "I have a condition that I need to take Adderall for. I hear that it might not be allowed in Italy. Does anyone know anything about this?", "link": "facebook.com/groups/1373361046396315/permalink/2193909837674761/", "likes": 1, "comments": [{"username": "Tanja Krup", "comment_text": "No one ever checked our bags for medication."}, {"username": "Jennifer Swayne", "comment_text": "My daughter takes it as well - I just had an hour pill containers. I had access to the prescription through her patient portal in case we needed it. ￼Nobidh asked 🤷🏻‍♀️ but maybe bc we didn't have the bottle"}, {"username": "Stef Lauren", "comment_text": "My husband just got a signed letter from his doctor stating he takes it for a diagnosed condition just in case they ask!"}, {"username": "Gena Diaco Penland", "comment_text": "We always just travel with the original prescription bottles and have never had any issues"}, {"username": "Patty Oaks", "comment_text": "Ask the doctor who precribed it."}, {"username": "Amelia Wistuk", "comment_text": "Keep it in the original prescription bottles."}, {"username": "Anthony Sperduti", "comment_text": "Who would know you had it\nJust bring it with you and take it when you need it"}]}, {"id": "2193913387674406", "text": "Just asking, does anyone know about the designer outlet stores in Italy , are the leather inferior than the actual shops or are they last year stock\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2193913387674406/", "likes": 0, "comments": []}, {"id": "2193914561007622", "text": "Has anyone used Withlocals.com\nFor tours?", "link": "facebook.com/groups/1373361046396315/permalink/2193914561007622/", "likes": 0, "comments": [{"username": "Chelsea Rae Carrell", "comment_text": "We booked tours with them and are leaving in a couple of weeks. The reviews look good.."}, {"username": "Chelsea Rae Carrell", "comment_text": "Hey all! We just finished the first leg of our trip in Venice. We took 2 tours with Withlocals. The first day was with Valentina for a romantic your choice tour (it is our 15 year anniversary so we requested that the tour guide hire a photographer and we also requested a gondola ride as well) we wanted to see the local markets and shopping that Venice had to offer as well for our romantic tour. The second day was our food tour we had Giada who took us to all the best local traditional foods of Venice we tried the fried mozzarella sandwich, gnocchi, gelato, cheeses and pastries.\n\nI think the best thing about withlocals is that it is intimate. You book a guide and they cater to you. You are not surrounded by strangers and can go off the beaten path if you ask.\n\nWe asked to go to a different spot and Giada took us. We asked Valentina which restaurant to try and at the end of the tour she walked us to the restaurant.\n\nBoth guides were awesome and I highly recommend withlocals.\n\nHope this helps!! 🙂"}]}, {"id": "2193920621007016", "text": "For everyone worrying about the Trevi Foundation. We were there In October and March, both VERY crowded - I’d you just wait your turn then you can get a beauty photo!", "link": "facebook.com/groups/1373361046396315/permalink/2193920621007016/", "likes": 2, "comments": []}, {"id": "2193923701006708", "text": "What is the best way to get from Ciampino Airport to the center of Rome? Staying near Trevi Fountain", "link": "facebook.com/groups/1373361046396315/permalink/2193923701006708/", "likes": 2, "comments": [{"username": "Julio Suarez", "comment_text": "Taxi."}, {"username": "Ahmad Seafan", "comment_text": "By bus , 7 euro to the Termini station, then by bus or metro for 1.5 euro , use google maps for nearest bus very easy and 24 hours working busses , sometimes they are not accurate to time of arriving at the bus stop but u will never miss it at all"}, {"username": "Nick Zalewski", "comment_text": "There are buses that are much cheaper than a taxi!"}, {"username": "Tasha Wheeler", "comment_text": "Taxi is fixed rate from the airport.\nWe paid €31 from airport to our hotel which was all of 5mins from the trevi x"}, {"username": "Wolfgang Nitsch", "comment_text": "Fly air canada"}, {"username": "Michael Barnes", "comment_text": "WelcomePickups.\ncom"}, {"username": "Cheri Arrowood-Stanziano", "comment_text": "Try Express Shuttle"}, {"username": "Tricia Harman", "comment_text": "Train"}, {"username": "Christiana Xenofontos", "comment_text": "We used Private taxi"}, {"username": "Amanda Tiver", "comment_text": "The Train it’s right outside the Airport and it’s cheaper"}, {"username": "Nilda Isabel Farina", "comment_text": "Hay un autobús"}, {"username": "Alison Dutton", "comment_text": "Taxi from the airport, direct and less hassle, they do a fixed rate."}, {"username": "Joanie Corneil", "comment_text": "Private car or taxi"}, {"username": "Dawdaw Samaha", "comment_text": "We took a cab"}, {"username": "Danielle Taylor", "comment_text": "We got the train into Rome from the airport it was about €14 easy to get to from within airport x"}]}, {"id": "2193926367673108", "text": "Hello. Flying from Budapest to Venice in two weeks. Does anybody know if bringing water bottles is still not allowed like in the state ? TIA", "link": "facebook.com/groups/1373361046396315/permalink/2193926367673108/", "likes": 0, "comments": [{"username": "Kay Rendall", "comment_text": "Apparently u can freeze them and they r not seen as fluids"}]}, {"id": "2193927064339705", "text": "My husband and I are traveling to Italy (Rome, Florence, Conque Terre, and Milan) end of August/beginning Sept for 12 nights. We want to go 100% using backpacks. We both have Osprey Farview packs, and I recently bought a Nomatic Travel Bag 40L. Has anyone done backpack only? If so, do you recommend it? We were in Spain and Portugal last year and the streets ate our luggage wheels, and checking our other suitcase was a nightmare, so we want to avoid suitcases if possible. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2193927064339705/", "likes": 2, "comments": [{"username": "Kate Carberry Ansart", "comment_text": "We just visited Rome, Florence and the Amalfi Coast for 2 weeks in June and each used a carry on luggage (with wheels) and a backpack as our personal item. We didn't have any issues with either. But if you can fit everything in a backpack, go for it! It was awesome not checking luggage!!!"}, {"username": "Felicia LoCascio Whitney", "comment_text": "Lauren Getts"}, {"username": "Tony Gesmundo", "comment_text": "We are trying to do the same ie no checked in luggage for 3 weeks in Europe including 11 days in Italy (from Australia)."}, {"username": "Scott Perry", "comment_text": "I’ve been doing only a carryon backpack for a while now. Like Rick Steves says, “Nobody ever comes back from vacation wishing they’d brought more.” 😄"}]}, {"id": "2193930591006019", "text": "Hi everyone, can anyone recommend a really good driver in Milan please .", "link": "facebook.com/groups/1373361046396315/permalink/2193930591006019/", "likes": 0, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2193930624339349", "text": "Hi hi anyone knows how the “6 travel days out of 30” rail pass works?\nExample can I take the speed train from Milan to Naples, drop off my bags at hotel or train station and hop onto another train to go Sorrento on the same day, then after dinner take train back to Naples?\nWill the two trips count as one “travel day” or will it count as 3? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2193930624339349/", "likes": 0, "comments": []}, {"id": "2193932801005798", "text": "I need help!! I have a Italy trip coming up and we’re going to Rome for a few days and we want to hit Florence, Pisa, Milan and Venice. However, I’m considering not going to one of the cities. Which one should we skip ?", "link": "facebook.com/groups/1373361046396315/permalink/2193932801005798/", "likes": 21, "comments": [{"username": "Manuel Macias", "comment_text": "Skip Pisa"}, {"username": "Donna Gilardone Szwabowski", "comment_text": "Skip Pisa"}, {"username": "Carmela Siniscalchi Frattellone", "comment_text": "Milan"}, {"username": "Elena Innocenti", "comment_text": "Pisa/milan"}, {"username": "Betsy Kirkhope", "comment_text": "Pisa"}, {"username": "Pat Dreker Demeraski", "comment_text": "Pisa"}, {"username": "Theresa Simon Wallace", "comment_text": "Skip Venice"}, {"username": "Tiffany Shrider", "comment_text": "So I should definitely go to Venice ?"}, {"username": "Jan Lumberg Kupczyk", "comment_text": "I couldn't pick one. Loved them all."}, {"username": "Mat Marturano", "comment_text": "pisa"}, {"username": "Kathy Damaren Ingram", "comment_text": "Pisa"}, {"username": "Marissa McLean", "comment_text": "Pisa and Milan can each be done in a day (in my opinion)"}, {"username": "Gina Rabotino Pelle", "comment_text": "Pisa or Milan! Spend the time in Florence and Venice! Though I did take a train to Milan to see the Last Supper! Well worth it, but not much else I was interested in, in Milan."}, {"username": "Christine Fleming Losh", "comment_text": "Pisa"}, {"username": "John Mynard", "comment_text": "Milan, the least Italian city in the list"}, {"username": "Laurie Francis Menk", "comment_text": "Pisa"}, {"username": "Andrea Longo", "comment_text": "SKIP PISA."}, {"username": "Lori Fregin", "comment_text": "Skip Pisa. Do not cut yourself short on Rome as there is SO much to see there. Venice too."}, {"username": "Isabella DeAngelis", "comment_text": "Rome a full day or 2, Florence 2 or 3, Milan 1 day, Pisa 1 day, Venice 1 or 2 maybe. I would go to naples go to amalfi and Capri instead of Milan or Pisa. Bullet train is like 3 hours from Rome or Florence"}, {"username": "Diana Serrano", "comment_text": "Pisa. Only attraction is the leaning tower !"}, {"username": "Brian Osman", "comment_text": "Pisa"}, {"username": "Sandy Radican Shikaly", "comment_text": "Pisa"}, {"username": "Susan Templeton Banker", "comment_text": "Pisa"}, {"username": "Ildiko Gyimesi Mikos", "comment_text": "Pisa"}, {"username": "Joanne Bianco", "comment_text": "Pisa"}, {"username": "Monica Sucato", "comment_text": "Pisa"}, {"username": "Linda Espie", "comment_text": "Pisa definitely"}, {"username": "Martin L. Epperly", "comment_text": "Stay in Roma"}, {"username": "Efren Matos", "comment_text": "Skip Pisa"}, {"username": "Erica Lowy", "comment_text": "Pisa"}, {"username": "Lisa Minichini-Dowty", "comment_text": "Pisa and or milan"}, {"username": "Raf Gervasio", "comment_text": "Milan"}, {"username": "Diane Plott Miller", "comment_text": "Pisa"}, {"username": "S Christian Everett", "comment_text": "Skip Pisa ….or just stop by for the photo\n\nNever skip Florence , it’s the best"}, {"username": "Claire Hansley", "comment_text": "Milan - not as pretty"}, {"username": "Stephanie Garofalo", "comment_text": "Give up Pisa, it’s a half-day trip."}, {"username": "Dora Morales", "comment_text": "pisa"}, {"username": "Debbie Tucker", "comment_text": "Pisa. . . .definitely the one to skip. Also, if you are flying home from Milan, here's a fantastic hotel by the airport where we stayed this past May before our early morning flight back to the US. It was fantastic, beautiful and the staff bends over backwards for guests. Complimentary airport shuttle for guests booking directly with the hotel. Highly recommend booking the premiere room - large, huge terrace overlooking the gorgeous grounds. Plentiful breakfast too! Have a wonderful trip!!! https://\nhotelvillamalpen\nsa.it/en/"}, {"username": "Nancy Lewis", "comment_text": "Milan"}, {"username": "Dorinda Campbell", "comment_text": "Milan."}, {"username": "Judy Stowe Cooper", "comment_text": "Pisa and /or Milan"}, {"username": "Diane Dallacosta", "comment_text": "Pisa unless u r desperate to see the leaning tower!!!"}, {"username": "Julia Muller", "comment_text": "Milan. We just flew home from two nights there on the weekend and I was very underwhelmed."}, {"username": "Rosy Zamora", "comment_text": "Milan"}, {"username": "Karen Schmidt", "comment_text": "Definitely Pisa. Also maybe Milan. Depending on how many days you have I would spend more in Rome and Venice. I wasn’t a fan of the amount of tourists in Florence all in one area, but definitely worth seeing at least once"}, {"username": "Lisa Abrams Argento", "comment_text": "Pisa or Milan."}, {"username": "Gail Holler", "comment_text": "Pisa"}, {"username": "Colleen Daigle", "comment_text": "Pisa"}, {"username": "Andria Saia", "comment_text": "I bet everyone has a different answer but I would say drop Milan unless the last supper is a live or die trip for you 😊"}, {"username": "Kirsten Rea Davis", "comment_text": "We spent a total of an hour and a half in Pisa and that included climbing the tower, going into the church and baptistery. What are you interested in doing? That may narrow down a choice."}, {"username": "Abe Michelson", "comment_text": "Pisa or Milan. Definitely do Venice & Florence."}]}, {"id": "2193936771005401", "text": "Hi apologies as it is probably been asked many times, which is best app ( ie equivalent to Uber) for Rome and other areas of Italy TIA", "link": "facebook.com/groups/1373361046396315/permalink/2193936771005401/", "likes": 1, "comments": [{"username": "Kate Carberry Ansart", "comment_text": "We used Uber in Rome. It was great!"}, {"username": "Pietro Adami", "comment_text": "In Rome, Uber works perfectly"}, {"username": "Elena Innocenti", "comment_text": "ItTaxi for taxi in Rome and other city."}, {"username": "Cory Harrison", "comment_text": "Freenow app is the way to go in Rome. Much cheaper than Uber"}]}, {"id": "2193946117671133", "text": "❤️❤️❤️❤️", "link": "facebook.com/groups/1373361046396315/permalink/2193946117671133/", "likes": 4, "comments": []}, {"id": "2193828641016214", "text": "Has anyone here had experience with a Campania Artecard? We want to use for entrance to pompeii and herculaneum but also transport if I can work it out!\nWhere did you buy them and how did you use them for transport?\nThank you in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2193828641016214/", "likes": 1, "comments": [{"username": "Miyuki Kanno Paul", "comment_text": "I found out that multiple entries to one site is not allowed."}]}, {"id": "2193833001015778", "text": "Hello All, I think this could be helpful information to everyone so please do participate in this survey!\n\nHow many nights to stay in Positano?", "link": "facebook.com/groups/1373361046396315/permalink/2193833001015778/", "likes": 2, "comments": [{"username": "Jonalee Wilson Stephens", "comment_text": "We need more info. How many days are you in Italy etc?"}, {"username": "Francesca Russo", "comment_text": "3 days are enough. Positano is not so big so you can visit it in one day and go swimming another.\n\nBy the way it depends on other things such as if you’d like to go to near locations such as Sorrento, Amalfi and so on."}, {"username": "Luisa Echeverry", "comment_text": "We stayed 4 nightstands. Went to Capri, Ravello, Sorento and rented a small boat one day. The more you stay the more you see, it depends on time and budget 👍🏼"}, {"username": "Kate Carberry Ansart", "comment_text": "We stayed in a smaller town on the coast for 5 nights. (Rome for 3 nights and Florence for 3 nights before heading to the Amalfi Coast). It is a bit of a journey getting there, so I say the more nights, the better. There is a lot to do - shopping, the beaches, Ravello, Amalfi, definitely plan a day trip to Capri and take some time to relax in such a beautiful place! (If you visit Capri, book a boat tour with Paolo of \"Amazing Capri Tour\"! You can find his company on Facebook - it was the highlight of our entire trip!)"}, {"username": "Frank Hunt", "comment_text": "Depends if it’s a base or not."}]}, {"id": "2193833061015772", "text": "Help please... we are heading to Italy for 26 days in September for honeymoon... we have 10 days in Sicily,\nPalermo 2 days (flight in)\nCefalu 2 days\nCatania 3 days\nTaormina 2 days\nMessina 1 day (ferry out)\n\nIs this schedule too heavy? Are we trying to cram too much in?", "link": "facebook.com/groups/1373361046396315/permalink/2193833061015772/", "likes": 2, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nnextstop-italy.c\nom/\nvirtual-tours/\nbest-of-sicily/"}, {"username": "Scott Perry", "comment_text": "I would do a little less, actually. Half of your time will be spent traveling, waiting to check in, etc."}, {"username": "Jenny Green", "comment_text": "I find having a down day or a less active day can be helpful!"}, {"username": "Gloria Maledi", "comment_text": "yes, i think it's too much, I would relax at the beach doing nothing for a couple of days"}, {"username": "Stephanie Ratcliffe", "comment_text": "Thank you! wanted some perspective! I think I'm trying to cram too much!"}, {"username": "Nicole Simpson Donoway", "comment_text": "Wayyyy too much time spent traveling."}]}, {"id": "2193806831018395", "text": "Hello,\n\nI am planning to go Naples and Sicily in august and I would like to your experience and recommendations, any places, restaurants, activities to do ? Is it easy to rent a car ? Places to avoid ? Best beaches to enjoy ?\n\nThank you for your feedback", "link": "facebook.com/groups/1373361046396315/permalink/2193806831018395/", "likes": 7, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nnextstop-italy.c\nom/\nvirtual-tours/\nbest-of-sicily/"}, {"username": "Don Bussolari", "comment_text": "Sicily is a big island , and Naples is a big city you may get better response if you narrowed things down as to what you want . Both have a great amount of everything you want. Sicily is different from town to town. Naples has the same thing only neighborhood to neighborhood."}, {"username": "Francesca Russo", "comment_text": "I’m Italian and I’ve been living in Naples so I can give you some information about that city.\n\nPlaces to visit in Naples:\n- Napoli Sotterranea\n- Castel dell’Ovo\n- Maschio Angioino\n- Palazzo Reale\n- Quartieri Spagnoli\n- Cristo Velato\n- All the streets of the historical center\n- Virgiliano\n- If you can move go to Pompei and Sorrento\n\nWhere to eat:\n- Pizza: Sorbillo or Michele\n- Popular Kitchen: Nennella\n- Frittatina: Di Matteo\n- Sweets: Chalet di Ciro a Mergellina\n- Gambrinus: coffee"}, {"username": "Scott Perry", "comment_text": "Also the Archaelogical museum is amazing!"}, {"username": "Keri Catoe", "comment_text": "Sicily’s pastries are ah-mazing!!! Look for an Extra Bar. This is what we got for €8!!! The prices and food quality is Sicily is pretty awesome. What part of Sicily are you going to?"}, {"username": "Kay Rendall", "comment_text": "Just read a warning about expected temperate, heat wave in Sicily in coming weeks."}, {"username": "Angela Gilmore", "comment_text": "If I may, I would add to Francesca list some other things regarding Napoli:\n\nDay trip to Amalfi coast\nVisit Napoli city center, more specifically: -Monastero di Santa Chiara\n-San Gregorio Armeno\n-The Doll's Hospital is quite interesting and bizarre\n-Rione sanità and Palazzo dello spagnuolo\n-Catacombe di San gaudioso and San Gennaro\n-Cimitero delle Fontanelle\n-Piazza plebiscito\n-Certosa di San Martino\n-Castel Sant Elmo\n-Chiaia area and Palazzo del Mannajuolo\n-Lungomare Caracciolo\n\nI just add also some pizzerie and advices, so you can choose where to eat according to where you are around midday.\n\n-Pizza: Concettina ai tre santi, Starita, La figlia del presidente\n-For a bizarre but traditional sandwich: Tandem\nSweets: Poppella, Scaturchio, Pintauro, Attanasio\n-Try street food:\nCuoppo, Taralli, pizza a portafoglio, pizza fritta, frittatina, panzarotti\n\nThere are other tons of things to see, do and eat, but you will need a couple of weeks only in Naples"}, {"username": "Patti Farrell", "comment_text": "Check the news an realize August is not the best time to travel to Italy. Much too HOT"}]}, {"id": "2193821067683638", "text": "Going to Italy next April and May, how do you think the weather will be and will it be crowded in the major tourist spots in Rome Florence and Venice?", "link": "facebook.com/groups/1373361046396315/permalink/2193821067683638/", "likes": 1, "comments": [{"username": "Mary Iuor", "comment_text": "I visited Italy in May of this year and the crowds were definitely much less compared to July and August. I was able to choose any restaurant and didn’t have to wait in those long line ups."}, {"username": "Lisa Silverman", "comment_text": "Weather is beautiful in May and not nearly as crowded as in June"}, {"username": "Blanca Gil", "comment_text": "These cities are busy year round. This past April, all three were very busy. Since Easter falls in early April, there may be less but chances are it will be busy. Italy is such a popular destination."}]}, {"id": "2193821921016886", "text": "Wanting to connect with family in Chiavari, Italy. Any ideas are welcome including places to stay", "link": "facebook.com/groups/1373361046396315/permalink/2193821921016886/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g194735-d2352\n8900-Reviews-Gr\nand_Hotel_Torre\n_Fara-Chiavari_\nItalian_Riviera\n_Liguria.html%3\nFspAttributionT\noken%3DMjA1Mjg2\nMjI"}, {"username": "Miyuki Kanno Paul", "comment_text": "Train stops Chiavari regularly"}]}, {"id": "2193821974350214", "text": "Florence:\n\nStaying at Hotel Rapallo; a family owned and run hotel of 19 rooms. I would say this is “Downtown” and very close to Cathedral Santa Maria Del Fiore’ aka (Duomo). There is also a small park nearby. The staff and rooms are great they offer excellent service.\n\nTip #1- if you don’t want to pay for a Taxi be prepared to walk, walk, walk. You can rent vespas/scooters, electric bikes but I’ve never been so scared to drive anywhere. Watch-out as a pedestrian because every driver is in a hurry. Honking appears to be a priority lol.\n\nTip #2- If your walking learning you way around quickly or have a paper map, YES I said paper. I purchased an international phone plan but many times the maps wouldn’t load and I got lost and very confused. It is July and so very hot.\n\nTip #3- Make sure to drink plenty of water and have a refillable water bottle. There are some free water fountains but they are few and far between. Water in restaurants is not free.\n\nTip #4- if you do take a taxi try to use your google map as we quickly learned some drivers like taking the long long long way around.\n\nTip #5- Be cautious of pickpockets, and beggars they sometimes work together to distract you. But most importantly Have fun, enjoy the scenery and take in all that this beautiful place has to offer.", "link": "facebook.com/groups/1373361046396315/permalink/2193821974350214/", "likes": 49, "comments": [{"username": "Lynn Francisco Casella", "comment_text": "I visited Venice for two days off a cruise ship"}, {"username": "Jeff McLellan", "comment_text": "We found Florence to be an amazing walking city. Four days and no taxis. Once you have your bearings it was great! We logged 20k+ steps a day."}, {"username": "Erika Valastyan", "comment_text": "Any recommendations\non where to eat?"}, {"username": "Elizabeth Yu", "comment_text": "Thanks for the tips."}, {"username": "Judy Grayson", "comment_text": "Beautiful but work it seems... hearing that from everyone... think other countries may be a bit better, sad to think that..."}, {"username": "Diane Carlson", "comment_text": "A second thumbs up for Hotel Rapallo - staff, rooms, and breakfast."}, {"username": "Nikki Blosser", "comment_text": "Tip#4. How did you stop being taken advantage of? Show them the google map and route you wanted to take to your destination so they could not take a longer way? Just curious. I have heard Taxi drivers in NY do the same thing!"}]}, {"id": "2193826491016429", "text": "Is the train from Milan airport (MXP) to Milan Central Station the subway or are there other options?", "link": "facebook.com/groups/1373361046396315/permalink/2193826491016429/", "likes": 1, "comments": [{"username": "Amit Aviran", "comment_text": "Train from Airport to central is fast and convenient"}, {"username": "Miyuki Kanno Paul", "comment_text": "Malpensa Express to Milano Centrale. About 50 minute ride"}, {"username": "Colleen Dawson", "comment_text": "The tracks are above ground. There’s an express train, can’t remember cost as we don’t normally take it. Taxi is about 150 Euros and takes the same time as the train. There’s also a bus.Rome2rio app will give you all the options."}, {"username": "Alejandro Gabriel Valenzuela Anghileri", "comment_text": "Malpensa Express"}, {"username": "Kay Rendall", "comment_text": "My friend always uses express bus."}]}, {"id": "2193826567683088", "text": "Magical night in Modica", "link": "facebook.com/groups/1373361046396315/permalink/2193826567683088/", "likes": 14, "comments": []}, {"id": "2193578017707943", "text": "Hello everyone, me and my GF are going to Italy for the first time, there's a concert in Lucca, and we will be staying in Livorno, but landing in Bologna. My question is, from Bologna to Livorno is there a direct train, is there a website for tickets, do they need to be reserved etc.\nAlso I just seen that some flights are cancelled due to strike in Italy, I really hope ours won't be... Thanks everyone!!", "link": "facebook.com/groups/1373361046396315/permalink/2193578017707943/", "likes": 2, "comments": [{"username": "Sam Mah", "comment_text": "Trenitalia...."}, {"username": "Chiara Campagna", "comment_text": "Bologna to Firenze and then Firenze to Livorno by Trenitalia"}, {"username": "Colleen Jennings", "comment_text": "Trentitalia pre book your train time & treat yourself to 1st class - hardly any different in price.\n\nAre you going to Lucca summer festival? Was there in Friday night to see Norah Jones. If you want a rest recommendation then Gigi trattoria or Pasquales. Both absolutely fab but you’ll need to book. Restaurants get super busy during concert time. Went to big if these - fantastic food/wine."}, {"username": "Colleen Jennings", "comment_text": "Typo! We went to both of these (restaurants) - fantastic food/wine."}, {"username": "Laura Cardinale", "comment_text": "I’ll be there too ❤️\nFrom Lucca to Livorno there’s a train but i dont’t think you’ll manage to catch it after The concert since The last one is at 22:49.\nThe best way is to rent a car in Bologna, reach Lucca and then leave it in Livorno.\nCan I ask u why you choose this accomodation?"}, {"username": "Leila Myftija", "comment_text": "No. You have to change at Firenze.\n\nWhy not stay in or near Lucca?\n\nYou're going to have a problem getting to Livorno from Lucca after the concert.\n\nAnd there's no bus either."}, {"username": "Damjan Tasevski", "comment_text": "I can still cancel our hotel in Livorno for free, would Viareggio or other place be a better option? We are looking for something that has beaches nearby and also a town worth visiting, and close to Lucca"}, {"username": "Nicola Algerino", "comment_text": "Usa applicazione Trainline ti fornisce prezzi e orari di treni e bus ."}]}, {"id": "2193583581040720", "text": "I saw last night someone had a golf buggy tour around Rome . We’re off to Pisa later this year . Does anyone know if there’s similar things ?", "link": "facebook.com/groups/1373361046396315/permalink/2193583581040720/", "likes": 0, "comments": [{"username": "Dr-Jon Warnecke", "comment_text": "Pisa really has only the Piazza degli Miracoli to visit, not much else. Try nearby Lucca the same day"}, {"username": "Ros Forrester", "comment_text": "Pisa is small...you can easily walk round it"}]}, {"id": "2193582924374119", "text": "Hoping to go to Sicily for first time in September any recommendations of where and nice reasonable hotels? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2193582924374119/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.kqzyfj.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g194726-d8667\n344-Reviews-Blu\ne_Bay_Cefalu-Ce\nfalu_Province_o\nf_Palermo_Sicil\ny.html"}]}, {"id": "2193709577694787", "text": "FIRST DAY SUGGESTIONS BEFORE CHECK-IN? Wonderful travelers, our flight arrives 8am from the US and our Airbnb checkin is 4pm (Milan, October, my husband and myself). I know we'll be tired but don't want to waste our first day. How have you spent your first day before check-in? Grazie!", "link": "facebook.com/groups/1373361046396315/permalink/2193709577694787/", "likes": 4, "comments": [{"username": "Laura Miller Bailey", "comment_text": "Following. My flight 7:45 am arriving Rome, 9/2. Hotel check in later too. Great question"}, {"username": "Ruth Simmons", "comment_text": "If you can leave your luggage somewhere, it’s a great time to wander in the area, check out menus of restaurants, get your bearings.After we landed in Venice we did a guided tour, and when we arrived in Rome we did a hop on hop off bus tour until we could check into our hotels."}, {"username": "Janet Messanelli Bozzone", "comment_text": "Check your bags somewhere near your AirBNB if they don’t have the option. Use a service like Nanny bag or Stow Your Bag…google luggage storage near your address. You could opt for a hop on hop off bus to get the lay of the City and minimize your walking because you will be tired. Find some place to eat and people watch."}, {"username": "Colleen Jennings", "comment_text": "Can you book an extra day ie the day before your arrival & ask your host for a 10am check in? You can then go straight to your accommodation & not waste a day ambling round in your travel clothes."}, {"username": "Evelyn Brown", "comment_text": "Centrale (train station) has luggage storage"}]}, {"id": "2193745071024571", "text": "When you went to the island of Procida what did you really enjoy and would recommend for a day trip around mid to end of October", "link": "facebook.com/groups/1373361046396315/permalink/2193745071024571/", "likes": 2, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nnextstop-italy.c\nom/\nvirtual-tours/\namalfi-coast/"}, {"username": "Miyuki Kanno Paul", "comment_text": "Lunch in Marina di Corricella! Get locally famous lemon salad"}, {"username": "Mary Anne", "comment_text": "We enjoyed wandering around the back streets, the little beach at the end of the port and the wedding we saw as we arrived!"}, {"username": "Kay Rendall", "comment_text": "To appreciate the beauty of Procida u have to walk into the town area and then climb down a lot of stairs to where the village with all the coloured houses r. We missed it on our 1st trip."}, {"username": "Steve Partridge", "comment_text": "Walk up through the town to the Abbazia San Michele Arcangelo for the views. Then walk down to Marina di Corricella. Have lunch there amongst the boats and pretty houses."}, {"username": "Iliana Zlatareva", "comment_text": "For one hour you go end-yo-end and sit at the port for nioki with mussels"}]}, {"id": "2193757661023312", "text": "Will be in Lake Como, Monte Carlo and then planning on one night in Portofino on way to Milan.\nLooking for hotel recommendations for both Portofino and Milan. Prefer central location, boutique style. Any other advice appreciated! Thanks in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2193757661023312/", "likes": 3, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187825-d2372\n73-Reviews-Hote\nl_Piccolo_Porto\nfino-Portofino_\nItalian_Riviera\n_Liguria.html"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.kqzyfj.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187849-d3561\n841-Reviews-The\n_Street_Milano_\nDuomo_a_Design_\nBoutique_Hotel-\nMilan_Lombardy.\nhtml"}, {"username": "Maddy Herbert", "comment_text": "Highly recommend Christoforo Columbo! The staff are friendly and helpful and the hotel is, central and close to the underground train which we used at least once per day"}, {"username": "Jill Wolder", "comment_text": "portofino- spendido!"}, {"username": "Gary Fossaceca", "comment_text": "In Milan I highly recommend Hotel Berna!"}]}, {"id": "2193793471019731", "text": "I see so many people talking about the East coast or the Southern coast. Has anyone been to the west coast cities and is it worth it to visit?", "link": "facebook.com/groups/1373361046396315/permalink/2193793471019731/", "likes": 1, "comments": [{"username": "Carey Elizabeth", "comment_text": "I have wondered this!! I’m so glad you asked!"}, {"username": "Francesca Russo", "comment_text": "Oh yes. On the west coast you can find:\n\n- Naples\n- Rome\n- Amalfi Coast\n- Pisa\n- Cinque Terre"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2193799647685780", "text": "I have booked Rome for the last week in October/first week in November what will the weather be like? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2193799647685780/", "likes": 2, "comments": [{"username": "Francesca Russo", "comment_text": "Usually in autumn the weather is mild cool. It could rain in November but you won’t need heavy coat."}, {"username": "Rhona OConnor", "comment_text": "If you ask Google it will give you an accurate temperature range"}, {"username": "Frank Hunt", "comment_text": "Cool"}, {"username": "Diane Hamilton", "comment_text": "We’re going November 15\nTop of my bucket list.\nRome, Florence & Venice 🇮🇹"}, {"username": "Ildiko Gyimesi Mikos", "comment_text": "I was there at exactly that time last year. The weather was perfect! Was low 60s in the morning and warmed to high 70s in afternoon. We had sun every day. One morning it sprinkled for about an hour, otherwise clear. No telling what it will be this year at that time, but don’t worry about it."}, {"username": "Jacquie Johnston", "comment_text": "We were in Italy Oct 5-26Rome to Venice Weather was perfect. It was fall like."}, {"username": "Viviann Cardenas", "comment_text": "Viviann Cardenas"}]}, {"id": "2193812261017852", "text": "Hi! going to travel to italy next week. We will be using a car to travel around the country towards the north. May i ask how are the conditions on the road? Are there heavy traffic? thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2193812261017852/", "likes": 0, "comments": [{"username": "Kristina Ruk", "comment_text": "It depends.. If on highways (btw they are payable) its more heavy near big cities and start work hours or ending work hours. On daytime its not crowded..of course it get crowfy if there an accident or road works"}, {"username": "Francesca Russo", "comment_text": "Usually traffic gets more intense going to the south and on the weekends (especially on saturdays that is usually the day all the italians travel to the sea)."}, {"username": "Sandra Shoffner", "comment_text": "Not on countryside roads. Don't drive in the city."}]}, {"id": "2193812637684481", "text": "Hello, I will be landing in Milan and will need a taxi to our hotel- considering UBER. Looking for anyone who has recently used UBER at MXP to get into Milan- how long was the wait, where is the pickup point and how was your experience? TIA", "link": "facebook.com/groups/1373361046396315/permalink/2193812637684481/", "likes": 0, "comments": [{"username": "Maddy Herbert", "comment_text": "We struggled with Uber from the airport, the pickup point was unclear so we used a taxi, but outside of this I used only Uber, the Uber drivers in Milan and Rome are excellent!"}, {"username": "Alejandro Gabriel Valenzuela Anghileri", "comment_text": "Consider using Malpensa Express train"}, {"username": "Ashima Avasthi", "comment_text": "The cab line outside the Airport is super eff"}, {"username": "Glenn Todd Webb", "comment_text": "They have a taxi stand"}]}, {"id": "2193814404350971", "text": "Travelling 4 days in Rome in August what are the must thing to see/do, we've booked collesseum", "link": "facebook.com/groups/1373361046396315/permalink/2193814404350971/", "likes": 2, "comments": [{"username": "Brian Osman", "comment_text": "Vatican if you can"}, {"username": "Francesca Russo", "comment_text": "- Vatican Museum\n- Pantheon\n- All the main squares such as Piazza di Spagna, PiazzaNavona, etc…)\n- Fori Imperiali\n- Fontana di Trevi\n- Castel Sant’Angelo\n- Villa Borghese\n- And all the city 🤣"}, {"username": "Dennis Jones", "comment_text": "Vatican is a must see!"}, {"username": "Tricia Brittingham Neff", "comment_text": "Cooking class, Under Trevi Fountain, catacombs"}, {"username": "Alessandra Pasteris", "comment_text": "We’ve been to Rome several times before but one of the things we did this time around, mainly for our kids who found it way too hot to walk around and see the main attractions, was a tour of Rome by golf cart! It was great and we got to see all the main attractions and do all the photo ops with the kids without the complaint of walking too much or being too hot. Also, the Haunted Tour which starts off at Castel Sant’Angelo just before 8 pm is great if you’re into that kind of thing."}, {"username": "Diana N Jerry Perez", "comment_text": "When visiting the Vatican are there any tips and is it only one day for the Vatican?"}, {"username": "Rose Oliver", "comment_text": "Also the Jewish ghetto"}, {"username": "Roland Trego", "comment_text": "ROME POSSIBILITIES\n+Day 1 (1/2 day only): Strolling in the Trastevere district, Basilica di Santa Maria in Trastevere + dinner\n+Day 2: Piazza Navona, the Pantheon, Trevi Fountain, Sant’Ignazio di Loyola church, + strolling on Via dei Coronari + dinner in the Campo de’ Fiori\n+Day 3-4: Advanced booking is necessary!\na. Vatican (on a pre-booked, small-group, guided tour) (3h30m)\nb. Galleria Borghese (2.5 hrs). Book TODAY!\nc. Colosseum (2-3 hrs.) Book through Coop Culture (the official website for the colosseum). Third-party sites frequently cancel.\nOther:\n+ Spanish Steps\n+ Monument to Vittoria Emanuele II. Take the elevator to the top for the views.\n+ Strolling in the historic center (e.g., Campo de’ Fiori) and dinner\n+ Palazzo Colonna, Saturday morning only, with reservation. Still privately owned. Spectacular grandeur.\n+ Galleria Doria Pamphilj: art museum in a palace. Must-see: the OPULENT Galleria degli Specchi (Gallery of Mirrors)\n+ Golf cart tour"}, {"username": "Lisa Jones", "comment_text": "We just had four days in Rome too 😍 arrival day we had quick photos at the Trevi fountain and Spanish steps (both heaving) and went to the church at the top of the steps, day two Colesseum then refreshment break then Roman Forum and Palatine Hill, rooftop bar at night, day three Vatican museum breakfast tour and st Peter's Basilica including climbing the cupula and then walked home via Trastevere and stopped for multiple gelatos and an art gallery and church. Final day was three art gallery visits (including Borghese gallery which was amazing the tour was fantastic) and walked through the gardens. it was an amazing experience ❤️"}, {"username": "Jan Armstrong", "comment_text": "Yes def book Galleria Borghese. We booked 2 weeks before and got a 3-5pm slot. Children need to be booked too but are free. It cost £34 for family if 4. They only let about 150 visitors in for each session. It’s in the Villa Borghese park which provides some shade plus has a zoo. We are in Trastevere at the moment. Last full day for us in a 3 bed Airbnb with aircon. Has been a godsend in this heat and our teenagers have loved the stroll round Trastevere at night and the amazing choice of restaurants"}, {"username": "Carine Brys", "comment_text": "The Trevi fountain glimmering in the sunlight and lit up at night was our favorite."}, {"username": "Pong Ac Ai", "comment_text": "Pantheon and piazza navona"}, {"username": "Claire Dowson", "comment_text": "St Peters Basilica near Vatican is breathtaking. You must go inside."}, {"username": "Nikki Livingston", "comment_text": "The Catacombs was so cool!!!"}, {"username": "Alison Dutton", "comment_text": "Santa Maria Maggiore is another beautiful basilica to visit has relics of St Luke and a shrine with pieces of the manger in it. Also\nnote the Vatican is closed on a Wednesday morning so all the tours head to the Colosseum so it does get really busy. We popped into random churches and were amazed by the works of art we saw."}]}, {"id": "2193814847684260", "text": "Does anyone know what is the difference between a privately purchased (3rd party ) ticket for the colosseum (3 hour tour w guide) and the “full educational experience” ticket sold on coop?\n\nWe were able to buy the “Educational Tour for Individuals and arena full experience ticket” but it says it’s 1 hr 15 min?? How can this be?", "link": "facebook.com/groups/1373361046396315/permalink/2193814847684260/", "likes": 0, "comments": [{"username": "Rebecca Ivanov", "comment_text": "No idea but we used Viator for all of our Italy tours and they were wonderful."}]}, {"id": "2193815081017570", "text": "We will be visiting late September…Staying in Venice. Would love to schedule day trips to Florence, then Rome during the week. Is this practical?", "link": "facebook.com/groups/1373361046396315/permalink/2193815081017570/", "likes": 0, "comments": [{"username": "Glenn Todd Webb", "comment_text": "Rome is too far from Venice for a day trip."}, {"username": "Amit Aviran", "comment_text": "Rome is too far but Florence is only a couple of hours away and the drive there is gorgeous"}, {"username": "Valerie Freeman", "comment_text": "I'm visiting mid September but wanted to visit all of them so I'm taking train from Rome to Venice upon arrival to stay in Venice 3 days, 2 days Florence, then 4 days in Rome then Paris for 3 days. I'm hoping that's more than enough time to visit and do a day trip or two."}, {"username": "Reshma De Cruze", "comment_text": "We just got back from three weeks of touring. Apart from the initial tickets we kept everything else pretty fluid. We we able to get accommodation/ train tix and entrance tickets to everything without too much effort. It was June/ July too so peak season, but was fine as long as you are prepared to be flexible with your itinerary. We booked everything ourselves."}]}, {"id": "2193811284351283", "text": "My husband and I plan to go to Venice, Florence and Rome next October 2024. Is that a good time of year? Should we booked everything, tours, and trains before hand? Do you think it doable to plan your self with out a travel agent. I am a very organized detailed person so I think I can. Just don’t know specifics to the area. We have never been over there before.", "link": "facebook.com/groups/1373361046396315/permalink/2193811284351283/", "likes": 161, "comments": [{"username": "Tania Duval", "comment_text": "If you don't pre book tours you can be in queues to get into things eg: Vatican.Tour groups just go through, the public queues.."}, {"username": "Tony Palombino", "comment_text": "Any recommendation tours regarding Venice how do you get a private taxi, etc."}, {"username": "Tracy Piko Lawniczak", "comment_text": "I booked my first trip of 2 weeks myself and had everything organized. Just took some time and effort. But very very doable.\n\nJust gotta start with what you want to see and do. All the big tourist things, winery tour, etc. do you enjoy a lot of walking etc"}, {"username": "Jan Sparkles Sparkes", "comment_text": "The only thing I let the travel agent do was flights. The rest I did, accom, trains , buses etc. That way we aren't completely locked in except for our travel days moving to our next destination. I choose train times ahead though, say 2 departure times so we don't have to be regimented.\nWe can also change the itinerary right up til we leave if we want to."}, {"username": "Lisa Miller Tolbert", "comment_text": "We know someone who went this spring and is very organized and into planning trips. But they said that if they did it again, they’d use a TA. Mainly for tips and tricks, and scheduling. They felt like something was missing."}, {"username": "Carlenne Brown Jarvis", "comment_text": "October is an excellent time! Big crowds should be gone, the summer heat is gone, but most things should still be open. Just check online to make sure.\nThere’s so much to do and see in those areas, I don’t think you’ll need a travel agent. However, I would suggest tours for things like the Vatican, or the big museums so you don’t have to wait in long lines, and get right to the pieces you are most wanting to see.\nI recommend Walks - their guides are just so full of info! A real “must”!\n\nhttps://\nwww.walksofitaly\n.com/"}, {"username": "Catherine AleXandra", "comment_text": "Joining this group is a great step. Keep up on the posts and you will get sooo many ideas. And questions answered."}, {"username": "Francesca Russo", "comment_text": "October is perfect because you avoid the hot weather of the summer.\n\nI think you can easily plan yourself.\n\nIf you want to move by train check Italo or Trenitalia."}, {"username": "Suzanne Mills", "comment_text": "Don’t make train reservations in advance, they’re prone to numerous delays. Early October is lovely, most tourists are gone and it’s pre rainy season. No need for a travel agent as they will direct you to touristy places and events.\nWhen Florence, you must take the local bus to Fisiole where the panoramic views of the city are spectacular. Rome is huge, diverse and overwhelming. You need to pick a central location and take day trips from there. I recommend Trastevere .\nVenice is a one time experience. I suggest staying in Murano, a small island in Venice. Make sure you pack already worn in comfortable shoes, function over fashion. You will get rain, but it won’t be cold. Ask locals for family owned restaurants off the touristy zone. Go to open Mercados for food and snacks and leather product to cut down on restaurant expenses. Make sure you have a mini fridge for your wine and snacks😍\nAlso make sure your banks are notified as your atm withdrawals and card charges will look like fraud and will be declined. Don’t carry excessive cash and never wear a backpack unless it’s facing forward. Theft is no joke. Download a translator on your phone to make communication easier and Italians enjoy your efforts to speak their language even though in large cities, they speak English. Take copies of all your documents such as credit cards, atm cards, passports, drivers licenses etc and leave the originals in a safe. But only a safe in your room, not the front desk. Never let anyone safekeeping your passports… ever, such as the front desk. Enjoy!"}, {"username": "Yash Gupta", "comment_text": "Would not recommend Neos airlines which we used. No app, website does not function…maybe they are aiming for travel as ancient Romans would have"}, {"username": "Jasper C. Acton", "comment_text": "October is a good time for Italy."}, {"username": "Billie Begley", "comment_text": "I booked everything for 7 seniors this past September for a full month in Italy. Easy to do. Tackle one city at a time. Book guides with excellent reviews. ItalyEU Tours. Walks of Italy are very good."}, {"username": "Colleena Howell", "comment_text": "Perfect time of the year, I went last October and loved it!"}, {"username": "Linda DeCarlo", "comment_text": "Yes, perfect time to go. You can do it yourself if you’re detail oriented and enjoy that sort of thing. I would say plan but don’t over plan. You want to enjoy yourself not run yourself into the ground. So give yourself days to wander and just explore. Don’t book every minute. Have a wonderful time! ￼"}, {"username": "Vanessa Jaime", "comment_text": "Yes because it’s not too hot and not too cold"}, {"username": "Angela Jacques", "comment_text": "cold"}, {"username": "Karen Olivas", "comment_text": "I planned on Italy October 2023, then was laid off my job. Planning October 2024"}, {"username": "Debra Fergison Canova", "comment_text": "We went in October. Perfect weather. Not so many tourists. We went with Rick Steve's tour group, they arranged everything. I didn't want to try to drive in foreign country. They do have great train service but watch your belongings for snatch and run and pick pockets"}, {"username": "Annette Mayer", "comment_text": "Best time for us. 3 trips all in October"}, {"username": "Aleda Reilly", "comment_text": "When my girlfriend and I travel to Europe, whether it’s England or Italy, or Germany or France, we always Rent-A-Car drive it ourselves find B&Bs, and in the city, usually find one hotel via the Internet in a good section and book everything"}, {"username": "Karen Allen", "comment_text": "We just went in March and it was not as crowded as other times. The weather was good, a little rain, but nothing show stopping. We just put on jackets and kept moving.\n\nWe planned ourselves - little more work, but nice to have control of it. TripIt app is very helpful to track plans and share with travel companions."}, {"username": "Susan Ramirez", "comment_text": "I got a quote from a travel agent and the price made me realize I could plan it myself. Lol you have plenty of time but getting a quote won’t hurt. 💜"}, {"username": "Kate Ochman", "comment_text": "That s a great route, north to south. We had great time in Venice in October."}, {"username": "Taty Gersh", "comment_text": "I would say the best time in Tuscany is October"}, {"username": "Kary Bell", "comment_text": "October is a great time. Look into Big Bus as it is super easy transportation!\nPlus you can sit and relax a bit while enjoying the beautiful sights"}, {"username": "Cheri Kimple Travis", "comment_text": "What do all you folks think about 10 days around the Amalfi Coast in mid September without a car? We’d have to rely on ferries, busses and walking but if we stayed out of the way a bit it sounds wonderful to me! Appreciate any and all advice!"}, {"username": "Carl W Lindskog", "comment_text": "Without specific knowledge of Italy, you are assured of planning your own disaster. Work with an agent and tailor it to your own needs and desires!"}, {"username": "Nell-Mari Kearney", "comment_text": "Loved our October trip in Italy. We booked and plan everything ourselves"}, {"username": "Lorraine Garrity Shea", "comment_text": "Following"}, {"username": "Maryann Bresnan Barta", "comment_text": "yes"}, {"username": "Lisa Lisa", "comment_text": "I'm doing myself also..group of 6 so definitely find accommodations and everything falls in place"}, {"username": "Manuela Bonazzi", "comment_text": "Ottobre è un bel mese. Se c'è brutto tempo o nebbia Venezia può non essere splendente come sarebbe con il sole ma comunque meglio così che con il caldo. L'Italia si può girare senza avere qualcuno che necessariamente\nti organizza il viaggio. Le città sono collegate benissimo con il treno ad alta velocità (Italo o Trenitalia Frecciarossa),i\nbiglietti in questo caso devono essere acquistati prima in internet (possono essere acquistati anche al momento ma i posti a sedere sono prenotati quindi ti consiglio di farlo in anticipo). Cerca di prenotare online con anticipo anche i biglietti ai musei,specie i musei vaticani che hanno sempre una fila lunghissima."}, {"username": "Bob Sullivan", "comment_text": "I've used Tripmasters once for that three city trip. I've booked my own as well. Hard to say if the package really saved any money. A little time perhaps but not sure I'd necessarily use them again."}, {"username": "Katie Burke", "comment_text": "I loved Italy in October!!"}, {"username": "Andria Saia", "comment_text": "October is DELIGHTFUL and Italy is totally easy to do it yourself. I wouldn’t bother with booking anything but hotels unless you are trying for something like the Vatican crypt tour that you need to book well in advance with the Vatican"}, {"username": "Wendy Wood Cullum", "comment_text": "Rome Book the coliseum, and Vatican (4:30pm so not so many people),\nFlorence, Giotto pass and accadamia(use Rick Steve’s free app for inside tour)\nVenice, st marks.\nAll Ahead online.\nTrains are easier and can b booked a few days ahead or at station."}, {"username": "Sara Mason", "comment_text": "Hi! I am an event and destination travel specialist! October is still a great time to visit, I am presently finishing up two separate tours for clients in Sept and Oct, and if your looking for help putting together a package I’d love to help you out! You can find me Sara Mason/ Fly Away Travel & my website flyawaywithmeev\nents.com! Please reach out with any questions! Happy planning!"}, {"username": "LeAnn Bonkiewicz", "comment_text": "Get your air & hotels as soon as you can!"}, {"username": "Kim Pierson Anders", "comment_text": "We’re going in September to same cities plus a few others\nDoing it all on our own with guidance from groups like these, YouTube channels etc\nStart researching\nNarrow down your interests\nAnd go from there\nThe more I read up from others, the more I learn and can organize"}, {"username": "Loretta Coccodrilli", "comment_text": "Yes a good time, but I would work with a travel agent that has been there."}, {"username": "Karen Parnell Potter", "comment_text": "I’m doing pretty much the same itinerary and so nice to read all of these responses!"}, {"username": "Rubina Oremus", "comment_text": "Good time book all you can"}, {"username": "Joanna Aceves", "comment_text": "Remember anything you book or do over in Italy they have everything catered for communication in English. You should be fine."}, {"username": "Kathleen Roll", "comment_text": "October is fabulous!"}, {"username": "Roe Chappa Fedor", "comment_text": "We went Oct 1-17, 2018! Perfect weather. Only a\nfew\nThings planned in advance as far as trains and museum tickets. All hotels booked in advance! All done on our own! You can do it! Enjoy!"}, {"username": "Patti Aparo", "comment_text": "October is beautiful, very comfortable temps."}, {"username": "Aubrey Sullivan Martin", "comment_text": "We are going in May/June next year. I started planning ours a few months ago and its been a blast! I have a note on my phone with our itinerary and I keep adding and removing as I learn more.\nYou Tube vids have been a huge help for ideas as well as this group!\nI booked all our lodging using Air Bnb. Airfare is booked.\nI have actually already booked our Accademia and Uffizi tickets since I could 😆\nWill wait to book other tours and tickets until about 3-4 months out.\nIf you enjoy planning and are detail oriented you can absolutely do it."}, {"username": "Janette YesPlease", "comment_text": "You can plan it yourself. I typically do research using youtube, Pinterest, or podcasts to decide what I would like my experience to be. I've found with my many travels to Italy that it is an easy country to get around, and most people will be able to communicate with you, especially in the more touristy places.\n\nSince October is the beginning of the low season, you will find fewer crowds, and temperatures should be more tolerable. You can probably be more flexible with how long you want to stay at each location. However, remember that in some of the smaller towns, depending on how late you go in October, you might find some shops and restaurants beginning to close for the season."}, {"username": "Mary Jane Jones", "comment_text": "We were there first 3 weeks in June. Weather low-mid 80’s. Warm but tolerable. It was our first trip coordinated by Selected Tours Italy. Cannot comment on doing on your own but many do. All of the locals we spoke to say best times are in the Spring or Fall. So you should have nice weather. Suggest you download What’s Up app and consider Moovit. Have a grand time!"}, {"username": "Trish Ellis", "comment_text": "Very doable yourself and the weather should be mild, maybe some rain showers here and there."}, {"username": "Jerry Lyubelsky", "comment_text": "Totally doable and yes book everything in advance if you can"}, {"username": "Ruby Kwan", "comment_text": "Yes, you can absolutely plan this on your own especially since you are organized and detail oriented. I planned our trip for our family of 4 to Italy and we got back a couple of weeks ago. We visited the three cities that you want to visit. I would definitely book the train in advance￼. I booked all our accommodations through Airbnb. Plenty to choose from especially if you book ahead of time. Your hosts are key for booking transportation to and from the airport if you need it.\n\nUse the Freenow taxi app for Rome. Book tours in advance using either your hotel or Airbnb. They are happy to help with that. Or on your own through Viator, TripAdvisor or other travel sights. I ordered my euros in advance through my bank, since they did not charge a fee. If there are some definite restaurants you want to dine at, make reservations in advance if they take them. I emailed a few with no issues. Check their website for reservation requirements. Highly recommend Trattoria da Enzo in Rome! You can email them to reserve. Happy planning!"}, {"username": "Meryl Blank Lewis", "comment_text": "Best month"}, {"username": "Cheryl Zimmerman", "comment_text": "Absolutely..."}, {"username": "John Borgia", "comment_text": "Yes"}, {"username": "Brice Blosser", "comment_text": "Yes. It’s a great time"}, {"username": "Suzy Coler", "comment_text": "I was in Rome last October and it was very crowded; more than our other visits…6 before this one. This year, we did two cruises in Apr/May, then stayed in Sorrento for 8 days in May…the entire coast was packed. I tell you this because you need to be prepared. Just get out as early as possible to enjoy this time of the morning without the crowds! Those places like Dolomites, Castelrotto, Bolzano or smaller towns, IMHO, are the very best to enjoy, so do not stay in Sorrento or Positano, but smaller areas close by. Rome is Rome, but add a smaller and more authentic Italy to your trip. Research is your best friend! Do not plan too much either, as you need time to just enjoy! My very first trips to Italy were my favorite because it wasn’t so overrun with us tourists. But you can still find that Italy in smaller towns💖 You will be so much happier with your own research and some tips from travelers who venture to go off the beaten path!"}, {"username": "Rita Bivona Morgan", "comment_text": "I would plan the tours before hand, because that is a busy time in Italy. Easy to do online by yourself."}, {"username": "Lara Grom", "comment_text": "Hi my name is larissa (Lara) I am Roman:-) but I live in Milan and I am a local guide of both Milano and rome.\nDefinitely October is a great month, weather is great not too hot or cold, less people and better prices.\nWe call this time of the year\n“Ottobrate romane”\nSince you have time make sure to visit all the venues in advance through official website.\nIf you need any help let me know."}, {"username": "Gil Rodriguez", "comment_text": "We did it last June. We did Rome first and our hotel booked our train trips as well as our tours and visit to the Vatican. We had an audience with the Pope and a tour of the collosium. We then went onto Florence and Venice. It's not to difficult but contact your hotel and most are accustomed to booking tours and transport and usually have an inside track into booking hard to find tours."}, {"username": "Maria Harrington", "comment_text": "October is a great month to go. Less tourists and cooler weather (60s). Very manageable to book on your own and to get to each area. Fly into Venice and then take train to Florence and Rome. Fly out of Rome. I recommend staying at least three nights in each to see everything. I just did this trip for the third time with my family in June. I planned and booked on my own each time. Enjoy!!!"}, {"username": "Tal Burdejny", "comment_text": "Other than July/August, its all good"}, {"username": "Diane Fairgrieve", "comment_text": "Do it yourself\nFly into Naples, spend 3 days on Amalfi, 5 nights in Florence & 5 nights in Rome"}, {"username": "Shana Woodfield", "comment_text": "I recommend buying and using a good Italy guide book. The most popular one is excellent on details. I don’t think I can tell you who wrote it, but the same author publishes a series of travel books for European countries. Your library may have them."}, {"username": "Lisa Novia", "comment_text": "Interested in the responses you get!"}, {"username": "Phyllis Snyder", "comment_text": "Please asp purchase Rick Steve’s Italy guide book! Omg it has such good information about travel in Italy! Also he has audio guides that are free and super helpful utube videos. I’m planning my 2024 September & October trip myself- but planning planning and planning! Having a good time learning!"}, {"username": "Valerie Collanton", "comment_text": "October is a great time to go. Very doable to plan yourself. It will be less crowded but still you need reservations for most if not all things. You can book trains on the Italo or Trenitalia websites. Very easy. Keep in mind it is best to have restaurant reservations. A good app is “The Fork”. It’s similar to open table. You can book restaurants there if you want. Also many restaurant websites have the option to book."}, {"username": "Judy Skyberg Limmer", "comment_text": "I’m thinking of booking many things & places due to following this group for 6 months now. Thanks to all for all the tips and locations."}, {"username": "Julie Pulzone", "comment_text": "Yes. We are in Florence now and while hot - we have enjoyed ourselves. Plan to provide details later this week."}, {"username": "Teri Mayo", "comment_text": "We just did this in early June. We booked hotels, trains ahead. And a few tours (we loved The Tour Guy) and left the rest open."}, {"username": "Glenn Todd Webb", "comment_text": "Yes, yes, yes. Get a Fodors or Frommers guide and do it yourself. You will find in the book plenty of interests and this site will answer all your questions."}, {"username": "Donna D'Arena Henry", "comment_text": "My husband and I went for 38 days. Planned everything ourselves. Only took carryons.\n\nOur 3rd trip. Others were a little shorter.\nAlways September and October.\n\nSuppose to go this year 3 weeks September and October. Hand to postpone because my husband hurt his achilles.\nNext year."}, {"username": "Lisa Opperman", "comment_text": "We are going to Italy this October to the same cities. Booked through Costco. Hotels, flights, train and transfers. Booked/booking tours myself and a couple of restaurant reservations. Otherwise, everything else will be on the fly."}, {"username": "Mary Iuor", "comment_text": "I would start looking into it as Italy is a hot spot."}, {"username": "Patricia Poeschel", "comment_text": "It’s a great time to go! We were there last October for 3 weeks! We did all our own planning! If you know your itinerary then book away!!"}, {"username": "Wendy Palmer", "comment_text": "I planned ours myself. It took a lot of time but was well worth it. October is a great time to go. It was still hotter than I expected. Take clothes for hot days & a light jacket or wrap for night. I would look to stay in the area around the colosseum in Rome because there is so much there & easy to get to all other areas from there. I booked our train tickets on my phone the day before we needed them. Tours are probably best to book in advance. Also be sure to book through the official website of wherever you are touring. (That can be hard to find & seemed to be the most difficult part of booking things myself). Everything I read said don’t stay near the train stations but we didn’t find a bad area in any of those cities. Rome would have been the worst within a few blocks of the train station but still wasn’t as bad as places in my own home town in the US We felt safe everywhere we went. I found that Pinterest was a big help in describing what each neighborhood was like. It also had good itineraries for each city to give you some ideas. Good luck & have fun!!"}, {"username": "Emilia Borelli", "comment_text": "We’ve done that exact trip twice, once in April and once in October. I personally liked Oct better, less crowds. Fly into Rome and out of Venice, it will save you lots of travel time. I planned both trips myself, please feel free to DM me if you’d like more tips. I did spend about 100 hours researching each trip."}, {"username": "Julia Haggerston", "comment_text": "You can do as much as you want yourself. It’s all doable x"}, {"username": "Carolyn Adams Brown", "comment_text": "We were in Italy in October a few years ago. Great time to go!"}, {"username": "Sandy Radican Shikaly", "comment_text": "September and October are great! I plan all our trips and love it.. Go for it!"}, {"username": "Patti Koscal", "comment_text": "We have a similar trip planned for Nov 2023. We will be spending 3 nights in Venice, 5 nights in Florence and 4 nights in Rome. Then we jump on the Enchanted Princess for a 15 day transatlantic cruise back to the US. My husband takes care of all the reservations for everything. All our hotels in all 3 cities have been booked at least 9-12 months ago, along with our air fare. We got some incredible deals. We have tickets for everything we want to do on land. It is really fun to plan it together. I hear that October is a beautiful time to be in Italy. If you’re organized, I think you can do it yourself!"}, {"username": "Rita Kanten", "comment_text": "October is the perfect time to be in italy! You should book \"must see\" things ahead of time. It isn't as busy as in the summer but there are still some lines."}, {"username": "Caryn Goode", "comment_text": "Fly into Venice & out of Rome or visa versa then you don’t have to take time to backtrack."}, {"username": "Keith Milsark", "comment_text": "look into Gate1 Travel. They have a good deal on those three cities. Includes air, trains, and hotels. Walking tours for an extra charge. Very reasonable prices."}, {"username": "Jose Velez", "comment_text": "Book all the hard places like the academy for the David and in Rome the Sistine chapel. Anything hard to book. Hotel should be easy since it is not a busy season"}, {"username": "Gail Holler", "comment_text": "It's perfect. That's when my husband and I went last year."}, {"username": "Joseph Guerrero", "comment_text": "Absolutely 100% possible to plan on your own. My wife and I are not big time travelers and we planned 17 days in Europe (11 in Italy), just last month in June with our 2 daughters ages 8 and 12. Initially we had the idea in May and still were able to plan multiple flights, trains, accommodations,\nactivities, etc. Obviously we did it at last second and spontaneously, which I do not recommend, but it is 1000% possible. As for going in October, I think that’s great. I wish we could have gone in late April or early October but we have school-aged children so we could not. ￼ While in Italy, we visited Rome, Florence and Venice. ￼"}, {"username": "Tami Sue", "comment_text": "Great weather less people. I would start with ur flight. I would fly into Rome or naples and fly out of Venice. I would start looking at flights now to see the prices. And watch it. I think u can only book 9 months out. Hotels 3 months out. Trains I would wait until u buy a rail pass."}, {"username": "Elizabeth Amiss Carrico", "comment_text": "Perfect Time"}, {"username": "Carrie Sue Weiner Jacoves", "comment_text": "Me too! Exact timing . And starting to plan now ."}, {"username": "Tina Bellitto", "comment_text": "October"}, {"username": "Tina Bellitto", "comment_text": "Yes"}, {"username": "Tina Bellitto", "comment_text": "It's great"}, {"username": "Eileen Marum Armitt", "comment_text": "I did all my own booking and planning and kept all details on excel spreadsheet...b\nooked all ahead"}, {"username": "Dawn King", "comment_text": "I planned everything myself. It’s pretty simple really"}, {"username": "Deepika Dagar", "comment_text": "I was there for a month and can help if needed. Please message me"}, {"username": "Patrick Gilmore", "comment_text": "We are going next month. Did everything on my own - train apps, AirBnb app & the best a Guide to the City app for activities. txt me if you want the app names."}, {"username": "Ann Brahmani Bost", "comment_text": "I planned my own 21/2 month trip to Italy, including Venice. It is definitely doable."}, {"username": "Laura Nausadis Bieber", "comment_text": "We went for 3 weeks in October (Rome, Florence and Tuscany) and planned everything ourselves (in fact, my husband did a majority of the bookings!). We had a fabulous trip! You can do it!"}, {"username": "Shawn Leinhart", "comment_text": "We plan ours and go end of September/ first two week of October. We've never had a problem buying train tickets as needed. We do book accommodations in advance. Have a wonderful trip."}, {"username": "Barb Minardi Hornback", "comment_text": "Yes. We went in October"}]}, {"id": "2193810104351401", "text": "Can anyone suggest the best place to stay on the coast by the airport in Rome? We are flying in a couple of days early. We will meet the rest of our party at the airport and then transfer to Lucca. My husband is mobility impaired. Can walk shorty distances but no stairs.", "link": "facebook.com/groups/1373361046396315/permalink/2193810104351401/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.jdoqocy.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g799531-d1491\n6730-Reviews-Fl\ny_Deco_Hotel-Li\ndo_di_Ostia_Pro\nvince_of_Rome_L\nazio.html"}, {"username": "Miyuki Kanno Paul", "comment_text": "Look for a hotel in Fiumicino"}, {"username": "Kay Rendall", "comment_text": "I agree. Lovely village by the sea where locals go for lunch on weekends. Very quiet though. Make sure they r in the village, not the b&bs, hotels that have Fiumicino in their name, but r actually clustered round the Mecure Hotel, therefore close to airport. Ok for night before flight\nLook at Google Map and u will see what I mean"}]}, {"id": "2193809941018084", "text": "2 days in Milan must see and dos please", "link": "facebook.com/groups/1373361046396315/permalink/2193809941018084/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Lake-Como/\nLake-Como-Day-Tr\nip-from-Milan/\nd26113-2872ZV07?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Milan/\nHISTORICAL-TOUR-\nOF-MILAN-skip-t\nhe-line-LAST-SU\nPPER/\nd512-33060P2?pid\n=P00070587&mcid\n=42383&medium=l\nink&medium_vers\nion=selector"}]}, {"id": "2193809387684806", "text": "Hi hi! So I have two ish days in Venice and one day in Florence. What’s the must see and must taste?! I’m a total foodie & coffee lover (without breaking the bank) ❤️", "link": "facebook.com/groups/1373361046396315/permalink/2193809387684806/", "likes": 1, "comments": [{"username": "Kay Rendall", "comment_text": "Venice ride the Vaporetta and see Venice at its best. Specially late 8nbthe afternoon when the colours on the houses, change, r magic. Try to sit right up the front for views. Ride the length of Grand Canal, get off, cross 5he canal and ride it opposite direction.\nWalk round St Marco Square, taking in all the buildings, or visit the sites\nA vaporetta ride to Burano for the beautiful coloured houses .\nOr cross the canal from the train station or the Rialto bridge and just get lost soak up Venice. This is where u will find the locals shopping, local bars, coffee\nYes u will get lost, come to lots dead ends after crossing numerous small bridges\nJust take in the atmosphere, the colours, feel of Venice."}]}, {"id": "2193808794351532", "text": "I’m traveling from Paris to Florence, but I have two free nights in between, any suggestions on what other place to visit?", "link": "facebook.com/groups/1373361046396315/permalink/2193808794351532/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Turin"}, {"username": "Jose Velez", "comment_text": "Milan"}]}, {"id": "2193804354351976", "text": "What’s the best place to visit Pompeii from, the Amalfi coast or Naples?", "link": "facebook.com/groups/1373361046396315/permalink/2193804354351976/", "likes": 7, "comments": [{"username": "Liz Ariar", "comment_text": "Naples about half an hour by train"}, {"username": "Erica Lowy", "comment_text": "Sorrento"}, {"username": "Erica Lowy", "comment_text": "Sorrento is an easy trip."}, {"username": "Angela Casey", "comment_text": "John Casey"}, {"username": "Andria Saia", "comment_text": "I think Sorrento is a great home base for all the archeological sites - Pompeii Herculaneum Iplontis and down the Amalfi coast and you a short train ride from Naples and Baia"}, {"username": "Ellie West", "comment_text": "We done a trip from Naples to Pompeii and Mount Vesuvius 🙂"}, {"username": "Eliz Fragoso", "comment_text": "Pompeii is all walking Carry lots of bottled water. It’s going to be hot.😎￼🥵🥵🥵🥵"}, {"username": "Roland Trego", "comment_text": "If your main goal is to see Pompeii, then Naples is closer."}, {"username": "Martin L. Epperly", "comment_text": "All 3 are great i"}, {"username": "Joe Easton", "comment_text": "It’s closer to Naples"}, {"username": "Caryn Bertino McGrath", "comment_text": "We took a bus from Sorrento. About an hour drive. Stoped at a winery for lunch nearby. Very nice."}, {"username": "Linda van Beest", "comment_text": "Naples, by train"}, {"username": "Sara Joanne Bedford", "comment_text": "Sorrento then take the circumvesuviana\ntrain- you can also jump off and see the Herculaneum site which in my opinion is equally as impressive as Pompeii. Enjoy 😊"}, {"username": "Katie Osterman-DiBlasi", "comment_text": "We did a tour from sorrento, took us in a bus there and gave us a guided tour then the bus back to the hotel."}, {"username": "Cettina Milioto", "comment_text": "Naples"}, {"username": "Nicole Beaumont", "comment_text": "I did it as a day trip from Rome, did Vesuvius too."}, {"username": "Sierra Behrens Tibbetts", "comment_text": "Can you do a evening tour of Pompeii like you can the Colosseum?"}, {"username": "AnnMarie Rescan", "comment_text": "I’d say Naples"}, {"username": "Christine Ann", "comment_text": "In my opinion…. Don’t go to Naples! It’s dirty and disappointing. Skip it and stay longer somewhere else."}, {"username": "Paul Coniglio", "comment_text": "I always use an app/website called Rome2rio to map out transport options from cities! We got a driver from Amalfi to Sorrento and then a train/bus from memory"}, {"username": "Gina Rabotino Pelle", "comment_text": "Naples"}, {"username": "Loly Hlade", "comment_text": "I stayed in Sorrento & took train to Pompeii for the day. It was less than hour train ride. I regret not staying in Positano as it is iconic. Definitely skip Naples. If you have time, go to Capri."}, {"username": "निनावी सहभागी", "comment_text": "Thank you everyone, still can’t decide lol each have something to offer. I’ll be travelling with my daughter, who will be 12 by then. Just trying to decide which is more suitable with things to do."}, {"username": "Carol Fellows", "comment_text": "We went from Positano."}, {"username": "Melanie Sartuche", "comment_text": "Sorrento, it's beautiful"}, {"username": "Erica Sylva", "comment_text": "Naples"}, {"username": "Erica Sylva", "comment_text": "Or Positano"}, {"username": "Suzanne Mills", "comment_text": "Naples"}, {"username": "Anna Griffith", "comment_text": "Easy train ride from Naples"}, {"username": "Cheryl Callahan Gibney", "comment_text": "We went to Pompeii on Wednesday traveling from Positano to Monopoli. It was 100 degrees. Do not recommend in this heat."}, {"username": "Lynn Francisco Casella", "comment_text": "Naples"}, {"username": "Miyuki Kanno Paul", "comment_text": "Sorrento is closer than Napoli. If not Sorrento, definitely Napoli"}, {"username": "Glenn Todd Webb", "comment_text": "Naples."}, {"username": "Janice Vaznonis", "comment_text": "I took a train to Naples to get to Sorrento. My excursion was waiting for me when I got off the train, and stopped at Pompeii then took me the rest of the way to Sorrento. Found on Viator."}]}, {"id": "2193803727685372", "text": "New to group and planning trip for next June for family of 4 including a 16 and 15 year old. We will have about 7-8 days total. I have been before but my family has not. I want them to see Rome, Florence and thinking almafi coast. My husband doesn’t have great knees so no long walking days. So my question to you… any itinerary suggestions and transportation ideas!? Thanks. I’ll add that we have one foodie, and 2 that love history. So many options lol! Kinda vague questions but appreciate any and all input.", "link": "facebook.com/groups/1373361046396315/permalink/2193803727685372/", "likes": 2, "comments": [{"username": "Rachael Richardson", "comment_text": "They have golf cart tours, hop on hop off buses and boat tours in most cities , if someone is not good at walking I would research it very carefully, everywhere is cobbled stones, steps, hills and bridges and it is hot 🥵 , we have done between 15000 and 25000 steps a day !"}, {"username": "Kate Carberry Ansart", "comment_text": "Hi! My family visited Rome, Florence and the Amalfi Coast last month. We went for 14 days and I couldn't imagine seeing all three locations in 7-8 days. If it were me, I would either do the Amalfi Coast for the entire time (but there are a lot of steps) or split the time between Rome and Florence. My husband, kids and I loved all three areas equally!"}, {"username": "John Licata", "comment_text": "Have the kids help in planning"}, {"username": "Karen Schmidt", "comment_text": "I would only pick 2 of those. Rome and Florence ( especially with the bad knees). Have you thought about Rome/Venice? It’s so different from any other city and it was my teen kid’s favourite in our stops"}, {"username": "Rita Kanten", "comment_text": "Not sure Amalfi coast is a good choice for someone with knee issues. Lots of steps and lots of walking."}]}, {"id": "2193798747685870", "text": "A beautiful little town , if you haven’t visited the Maremma you are missing out , it’s a stunning and unspoilt corner of Italy.", "link": "facebook.com/groups/1373361046396315/permalink/2193798747685870/", "likes": 4, "comments": [{"username": "Darren Williams", "comment_text": "Lynette we should go this way as we head south to Sorrento"}, {"username": "Elena Innocenti", "comment_text": "This is Sorano, my grandparents little town in Maremma.\nthere are many small towns like this, many are little known and not touristic."}]}, {"id": "2193649824367429", "text": "Venice:\n\nAbsolutely stunning, pictures don’t come close:\nTip #1- I recommend a water taxi to get you and all your luggage directly to your hotel or you will be dragging your luggage over countless bridges and cobblestones streets\nTip #2- However beautiful this place is it is not stroller/wheelchair friendly.\nTip #3- Wear comfortable shoes you will absolutely walk everywhere (no one cares if your shoes match your outfit) blisters are no joke on cobblestones streets.\nTip #4- Gondola rides are amazing but be smart about getting your tickets ahead of time, rates can be high if you don’t book ahead.\nTip #5- Get Euros, merchants prefer you pay with Euros. Most do accept Credit/Debit cards but for bargain prices the Euro will get you great prices. You can find conversion table’s online.\n\nFinally\nTip #6- Packing light is the best recommendation I should have listened to, I usually travel only with a carry on but I listened to a friend and over packed. I have found so many beautiful clothes/accessories and great and affordable prices. You really should pack light if you don’t have direct service from airport to Hotel.", "link": "facebook.com/groups/1373361046396315/permalink/2193649824367429/", "likes": 104, "comments": [{"username": "Sally Ann Tanasi", "comment_text": "Great advice"}, {"username": "Maria Coladangelo Ducca", "comment_text": "I travel light . I pack al my older basics . Personal clothes, pjs etc . I throw them away hence making space for the goodies I fall in love with"}, {"username": "Melissa Cortez", "comment_text": "Are water taxis available everywhere or do I need to book ahead of time to get from train station to my hotel?"}, {"username": "Lisa Marie", "comment_text": "Rates for gondolas can not be higher because they are regulated."}, {"username": "Faryal Abbas", "comment_text": "Any good (non touristy) food spots for recommendation?"}, {"username": "Sonia Smith", "comment_text": "We made reservations at a VRBO near the train station so that we wouldn’t have to walk with luggage to far. I will make sure to pack band aides. I’m still working on the packing light part. I’m planning on buying the three day Vapretto ticket. Thanks for the advice. Did you need mosquito repellent? They seem to enjoy feasting on me here at home"}, {"username": "Barb Minardi Hornback", "comment_text": "Loved Venice"}, {"username": "Sharmini Nair", "comment_text": "Great advise . I have callouses on my hands from dragging my suitcases up and down the bridges 😂 I would do it all over again as Venice was like a dream"}, {"username": "James Carr", "comment_text": "Is is true if you “play by ear” a gondola ride can cost you about 250 euros? 🤔"}, {"username": "Dana Golden", "comment_text": "Gorgeous pics!! Good advice"}, {"username": "Julie McIvor", "comment_text": "Hi Annette. Helpful tips. Thank you. Did you come from Marco Polo Airport? I have to get from there to my hotel but they don’t organise transfers etc."}]}, {"id": "2193789331020145", "text": "Arriving to Italy in mid August and staying first 2 nights in Venice, followed by 2 nights in Verona, and one night at Lake Garda before heading back closer to Venice airport. I don’t want to spend my last night at an airport hotel. Those of you that have had a similar experience where did you go for your last day/night that was easy to get to Venice airport by 8am. Thanks in advance for your help.", "link": "facebook.com/groups/1373361046396315/permalink/2193789331020145/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "Mestre https://\nwww.kqzyfj.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g194822-d2289\n23-Reviews-NH_V\nenezia_Laguna_P\nalace-Mestre_Ve\nneto.html"}]}, {"id": "2193788444353567", "text": "We are scheduled to hike the Valley of the Mills Tuesday morning. We already paid for a family of four. With the heat wave, should we just take a loss on it? Will we be just miserable? We arrive to Italy tomorrow and have never been there before.", "link": "facebook.com/groups/1373361046396315/permalink/2193788444353567/", "likes": 2, "comments": [{"username": "Colleen Jennings", "comment_text": "Skip it. It’s unbelievably hot in Italy now & due to get hotter. Not sure where youlll be arriving from so take your first day to relax & get over the journey."}, {"username": "Steph Craddock", "comment_text": "Actually it should be pretty cool in there. Lots of water flowing around. Check with the organisers."}, {"username": "Dana Green", "comment_text": "I would skip it."}, {"username": "Rachael Richardson", "comment_text": "Surely they will cancel if it’s too dangerous to do! Get in touch with them directly"}, {"username": "Maria Al", "comment_text": "We went and it was incredible. So much better than the heat and crowd in the city. No regrets!"}]}, {"id": "2193787507686994", "text": "Does anyone know of a private driver to do day trip for 6 people out of Florence in Sept ?", "link": "facebook.com/groups/1373361046396315/permalink/2193787507686994/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Florence/\nDay-trip-from-fl\norence-to-siena\n-and-San-gimign\nano/\nd519-149354P6?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "Colleen Robinson", "comment_text": "Andrea picked us up at our hotel at 9 and dropped us off at 6.. He was extremely knowledable about the area and wineries and spoke very good english. He charged us 520 euros for the day. You could ask him to take you to certain places or ask for recommendations\n. It was our favourite day. You can email him to get a quote and information\n\na64.vignoli@gma\nil.com"}, {"username": "Bill Ulrich", "comment_text": "NCC Caterina is prompt and reliable, knows the area well:\nhttps://\nwww.taxichiantin\ncc.it/"}]}, {"id": "2193787144353697", "text": "I’ve seem a lot of cancellations with the colosseum on here. I am looking to book a ticket soon (after my 30 days from the date I pIckes is booked). Ideally I would love to have a guided night tour and at this rate I just want to not worry my tour will be cancelled. Is it best to book through coopculture directly or are there better guided tours that aren’t being cancelled at this time ?\n\nMany thanks in advance :)", "link": "facebook.com/groups/1373361046396315/permalink/2193787144353697/", "likes": 17, "comments": [{"username": "Jojo Hanna", "comment_text": "Book directly. I don’t remember reading any posts saying Coopculture cancelled tours."}, {"username": "Alisa Tulande", "comment_text": "Was just wondering the same thing! Following"}, {"username": "Jennifer Larese Taylor", "comment_text": "Buy direct from the Colosseum. They do tours as well. Theirs are just as good"}, {"username": "Karen Blackmore", "comment_text": "Someone posted recently that they bought the Italian night time tour from coopculture and, as everyone spoke English, it was done in English. They also often sell tickets 7 days before"}, {"username": "Teri Mayo", "comment_text": "We did one through \"The Tour Guy\".... all in English, great guide, skip the lines."}, {"username": "Jeff McLellan", "comment_text": "We booked the Italian one as we wanted to visit at night too. There were three families who spoke English out of 20 people there but the guide did the tour in Italian which was fine. She was happy to answer the odd question from us."}, {"username": "Cynthia Marie", "comment_text": "Coop culture for sure"}, {"username": "Marz Jones", "comment_text": "We have one booked with livtours in sept. Anyone getting canceled recently via them? In retrospect I wonder if it was better to book through coopculture!"}, {"username": "Brian Osman", "comment_text": "Book threw them directly"}, {"username": "Nikki Blosser", "comment_text": "Book direct."}, {"username": "Andrea Hirsch", "comment_text": "We were a casualty this week. First we learned that we wouldn’t get the Underground, but we were assured we had everything else, and 9am time stayed the same. Then today they changed the time (after confirming it TWICE, which I have in writing). They offered us a refund. My husband lucked out and scored us tix directly, including underground for next Sunday!"}, {"username": "Daniela Friscic", "comment_text": "We had a tour booked through Viator for 10 of us that was cancelled in the past 3 weeks."}, {"username": "Keri Catoe", "comment_text": "We got the parco membership, €80 for 2 adults and 3 children. I had no issue getting regular entry tickets so I’m guessing they have extra ticket spots available for members. We booked 5:30pm for 3 days in a row. That way we could do colosseum one day, Roman forum and Palatine Hill next day and the 3rd go back and see anything we missed or wanted to see again. We also got special entry into the interactive experience. We used Rick a Steve’s audio tour for the win! Also being later in the afternoon there was a lot of places with shade from the heat"}, {"username": "Francine Juskiewicz Casalino", "comment_text": "The Tour Guy (The Roman Guy) was excellent and went on as scheduled!"}, {"username": "Ann Heidger Pequeno", "comment_text": "Bobby Pequeno - to review!"}, {"username": "Susan Zimmerman", "comment_text": "What is the advantage of taking a night tour? I am planning my vacation and curious about this. Thank you"}, {"username": "Jennifer Diamond", "comment_text": "My walks tour 2 weeks ago was excellent and they only cancelled the underground portion of my tour a month before. So then bought a coop culture night tour in Italian to see the underground part, but of course couldn’t understand the guide but they were available."}, {"username": "Amy Louise Lavelle", "comment_text": "I was in a panic because I couldn’t book a tour for four of us. Went there directly and there was a little queue of about an hour - this was a week ago! And it was cheaper! Certain times of the day are less busy but we went at 10:00am and by 11 we had tickets for the 12:10 pass.\nThere’s no shade so prepare well and bring water - there are people selling water for 2 euros a bottle and even parasols for 5 euros if you’re not prepared.\nGood luck!"}]}, {"id": "2193783494354062", "text": "Any recommendations to book comfort SUV (like Range Rover Vogue) in Italy?", "link": "facebook.com/groups/1373361046396315/permalink/2193783494354062/", "likes": 8, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.discovercars\n.com/\n?a_aid=NextStop-\nItaly"}, {"username": "Carmine Recine", "comment_text": "Lol the gas consumption will kill your pockets, money!"}, {"username": "Tana Muraro Sheets", "comment_text": "Good luck. We booked a 6 passenger Vehicle & got a Fiat. Thankfully there were only 4 of us. Oh it fit 6 people alright but our luggage was another thing. Parking was a challenge too. Spaces are made for very small cars. Driving was a little scary but we did ok. We purchased a Garmen GPS specifically for Europe. Google maps doesn’t always work. Even downloaded ahead of time. We found that out in a previous trip."}, {"username": "Lisa Silverman", "comment_text": "Most of the cars are very small and gas is about $7.00 per gallon."}, {"username": "Randi Kornberg-Zuckerberg", "comment_text": "If you can rent an electric car"}, {"username": "Alla Zats", "comment_text": "I rented Audi A5 diesel and found it was hard to park because spaces are tiny but loved the power. Also navigating narrow streets and roads was more challenging. A bonus: diesel is much cheaper."}, {"username": "Rita Kanten", "comment_text": "I don't think that's possible. And even if you did find a vehicle that large you'd never find a place to park it. Cars in italy are small and the parking spaces are even smaller. Good luck."}, {"username": "Ghaith Khalil", "comment_text": "Not range rover but if you want to rent smal yet comfortable car with lost och space I recommend the mini Cooper countryman. I use Centurion car rental and we where very happy with the service we got 🙂"}, {"username": "Jenny Larsen", "comment_text": "Have not seen one SUV ain five weeks"}, {"username": "Antonio Aloè", "comment_text": "Stupid questions sometimed get an award for the most stupid question of the month...🤭"}, {"username": "Mike Adams", "comment_text": "A large car is a liability.\nThink medieval alleyways. And small parking spaces."}, {"username": "John Selvaggio", "comment_text": "Hertz in Rome (FCO Airport) has Alfa Romeo Stelvio's. Beautiful and hard to beat. A lot more reliable than a Range Rover. I've owned both!"}, {"username": "Mika  Anushik", "comment_text": "Thanks y'all!"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2193644831034595", "text": "View from our hotels: Rome hotel-view of Spanish steps & Florence hotel-view of the Duomo😍", "link": "facebook.com/groups/1373361046396315/permalink/2193644831034595/", "likes": 79, "comments": [{"username": "Nancy Day", "comment_text": "What hotel"}, {"username": "Sandy Kinnerman Kennedy", "comment_text": "What are the names of your hotels"}, {"username": "Danilo Esse", "comment_text": "Wow you guys went for the top"}, {"username": "Marissa Diana", "comment_text": "They are both residences — excellent spacious rooms and clean.\n\nPalazzo della Stufa - Florence (breakfast was included also)\nInternazionale Domus - Rome"}, {"username": "Tom Formicola", "comment_text": "Enjoy!🇮🇹"}, {"username": "Paulette Molasses Sims", "comment_text": "Well, name of hotel please!"}]}, {"id": "2193726164359795", "text": "Hello!\n\nMe and my partner are staying in Lake Como in October and wondering how the best way to get there from Milan Malpensa ? Is it fairly easy via train or shall we just book a taxi? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2193726164359795/", "likes": 2, "comments": [{"username": "Vanessa Luciani", "comment_text": "Lake of Como where?"}, {"username": "Ilaria Verda", "comment_text": "From Malpensa to como there is not a direct train, you need to change in Saronno or in Milano, it's about 70 min trip"}, {"username": "Glenn Todd Webb", "comment_text": "We rented car at Malpensa and drove all over for 5 days. It’s about 50min drive."}, {"username": "Alejandro Gabriel Valenzuela Anghileri", "comment_text": "Get rid of taxi, it is very expensive. If you want to go by train get Malpensa Express to Milano Centrale (you get it at Malpensa airport), then any train to Lecco or Como. Where in the lake would you like to go? Lake Como is big"}, {"username": "Elizabeth May La Duca", "comment_text": "There is limited coach bus service from-to Malpensa and Como"}, {"username": "Elizabeth May La Duca", "comment_text": "google maps/directions"}, {"username": "Fern Cherowbrier", "comment_text": "Apologies we are staying in Bellano. Thank you all! We may hire a car as it seems we can travel about for the 3 days we are there 🥰"}, {"username": "Renae Larcus", "comment_text": "Train from Milano Centrale to Varenna is one hour. Easy. Will have to get from Malpensa to Milano Centrale"}]}, {"id": "2193696924362719", "text": "Travelling to Milan next week ☀️😄 Any tips I should know or what to expect for a good holiday? I know I am going to walk a lot, so good shoes 👍", "link": "facebook.com/groups/1373361046396315/permalink/2193696924362719/", "likes": 0, "comments": [{"username": "Rossana Rotini", "comment_text": "Light clothing (both in color and weight), sunscreen and maybe an umbrella? It Is super hot these days"}, {"username": "Gloria Maledi", "comment_text": "be prepared to feel like in a sauna. It's hot even at night. I don't want to scare you 😅 but don't bring anything warm. I suggest to visit lake como, you can get there by train from milan"}, {"username": "Alejandro Gabriel Valenzuela Anghileri", "comment_text": "It's very hot in Milan these days"}, {"username": "Tiina Ahola", "comment_text": "This is the weather where I am coming from. Not very hot☔️"}, {"username": "Alejandro Gabriel Valenzuela Anghileri", "comment_text": "Now"}, {"username": "Alessia Zito", "comment_text": "I reccomend to visit: brera (where you can visit the pinacoteca di brera), duomo (visit the inside of the duomo and go up to the terrace), the gallery, arco della pace, navigli, church of san bernardino alle ossa (inside walls made of human bones, it may seem disturbing but it is breathtaking) sempione park, 900 museum, villa invernizzi, fondazione prada, porta garibaldi, piazza gae aulenti, city life, santa maria delle grazie church where you can see the painting of leonardo da vinci's last supper, teatro “la scala”, qc terme (a beutiful spa) there are many streets where go shopping like via torino, san babila, via della spiga, via montenapoleone,\nmilan is the capital of fashion.\nAlso there are many terraces where you can have an aperitif, i reccomend: Milano verticale, Via de Cristoforis ( Porta Nuova - Garibaldi) the dome, terrazza 21, sun eleven rooftoop\nDress lightly and always carry water with you, choose the least hot hours to walk\nEnjoy😉"}]}, {"id": "2193762844356127", "text": "Any train tips ? We are leaving rome and taking the fast train to Naples - 6 people . As well , best way to get from Naples to Sorento ? Huge thanks", "link": "facebook.com/groups/1373361046396315/permalink/2193762844356127/", "likes": 3, "comments": [{"username": "Sarah Emerson Nelson", "comment_text": "Shuttle from the airport is 10 euros, train is also a great option, and of course ferry if the timing works."}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Naples/\nPrivate-transfer\n-to-Sorrento-fr\nom-Naples/\nd508-238445P3?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "Rhona OConnor", "comment_text": "Get there early. The trains are very punctual."}, {"username": "Andria Saia", "comment_text": "The local train takes you to Sorrento - easy peasy"}, {"username": "Nancy Fricke Corsi", "comment_text": "Private car. Sorrento Transfers"}, {"username": "Allan Olexa", "comment_text": "In Napoli Centrale, take the local train to Sorrento."}, {"username": "Cynthia McDonald", "comment_text": "I’d do the boat frankly. Leaves out of the port."}, {"username": "Kath Milburn", "comment_text": "Local train to Sorrento, right into the centre."}, {"username": "Patsy Grant MacLeod", "comment_text": "Probably a bus . We took a bus but it was organized by the cruise line . The Amalfi coast is amazing , but I wouldn’t want to drive it myself. We took the route 2 different times and stopped at all the quaint little towns along the way , Positano , Sorrento and Amalfi were my favourites."}]}, {"id": "2193743204358091", "text": "My wife and I are doing a hot air balloon ride launching from San Casciano Val di Pesa. The plan is to hit a winery or two after.\nWe’d also love to visit San Gimignano.\n\nI’ve been thinking about Tenuta Torciano.\nBut I am looking for recommendation for wineries we MUST visit in this area.", "link": "facebook.com/groups/1373361046396315/permalink/2193743204358091/", "likes": 2, "comments": []}, {"id": "2193739147691830", "text": "Where would you recommend to stay in Milan for four adults,near transport,eateries etc?", "link": "facebook.com/groups/1373361046396315/permalink/2193739147691830/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.jdoqocy.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187849-d1213\n0410-Reviews-NY\nX_Hotel_Milan-M\nilan_Lombardy.h\ntml"}, {"username": "Ilaria Verda", "comment_text": "Near a metro station"}]}, {"id": "2193736191025459", "text": "I gathered my post about less popular places in Tuscany was helpful so I’d gladly share some suggestions about Veneto for people who’d like to visit more in the region besides Venezia.\n\nI’d start with Verona where I hail from.\n\nVerona: Soave, Valpolicella (wine tasting, nature check San Floriano, San Giorgio Ingannapoltron, marble quarries),Valeggio sul Mincio (check Parco Sigurtà), Borghetto sul Mincio (very romantic old water mills), Lessinia Natural Park, Lazise, Peschiera del Garda ( if with kids maybe check out Gardaland amusement park if into that) and if you want something different try “Festa del riso”in Isola della Scala (famous for Vialone Nano rice cultivation one of the best rice varieties for risotto, one of the dishes we love in Verona; try risotto all’isolana/al tastasal)\n\nRiviera del Brenta (between Venezia and Padova, summer destination of the dogi, Casanova, D’Annunzio, Byron are among a few of the notorious visitors of the area; palazzos and breathtaking villas, great for hiking, bike rides)\n\nAsolo\n\nBassano del Grappa\n\nPossagno (Canova’s gipsoteca)\n\nPadova (Colli Euganei great for hiking, biking and wines, Arquà Petrarca (Petrarca’s home)\n\nDelta del Po (birdwatching, hiking and trying eel based dishes)\n\nVicenza (Basilica Palladiana, Teatro Olimpico, Giadino Salvi and other treasure s by Palladio)\n\nMarostica (medieval town with the famous ”chess piazza”, and castles)\n\nChioggia could be a nice stop before getting to Venezia.\n\nTreviso (Tomba Brion and the town itself is very pretty, ofcourse prosecco)\n\nCiao!", "link": "facebook.com/groups/1373361046396315/permalink/2193736191025459/", "likes": 5, "comments": []}, {"id": "2193734927692252", "text": "I know this is a last minute request but having a hard time finding tickets for the Vatican. Looking for 4 tickets for the 25th of July, the highlights. I would need early morning, would love recommendations & somewhere I can book through. Thank you in advance", "link": "facebook.com/groups/1373361046396315/permalink/2193734927692252/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Rome/\nGuided-Tour-for-\nVatican-Museums\n-Sistine-Chapel\n-and-St-Peters-\nChurch-9-45/\nd511-136877P13?p\nid=P00070587&mc\nid=42383&medium\n=link&medium_ve\nrsion=selector"}]}, {"id": "2193733001025778", "text": "I need to be in Sicily in December but then want to travel a bit further into other areas. I dont want to to into the large cities like Rome. We will have car, is there someone that can recommend a few stops and tows that will be great in December? We do have a 9 year old that we need to also think of", "link": "facebook.com/groups/1373361046396315/permalink/2193733001025778/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nnextstop-italy.c\nom/\nvirtual-tours/\nbest-of-sicily/"}, {"username": "Eleni Koi", "comment_text": "Are you traveling by car to Sicily or you will rent a car there? And are you looking for areas within Sicily or in other regions close by like Calabria, Puglia and even Campania?"}, {"username": "Ilaria Verda", "comment_text": "What about visit trentino? In December in Trento, Bolzano... There are beautiful Christmas market, you can also do skiing!"}, {"username": "Miyuki Kanno Paul", "comment_text": "Pick up your car as you are leaving a big city. For example, start from Palermo and go counterclockwis\ne and return the car in Catania as you fly back to the mainland. Or get a car as you leave Catania and do clockwise. Have a Michelin Green guide handy!"}, {"username": "Tina Bellitto", "comment_text": "Puglia"}, {"username": "Stephanie Viljoen", "comment_text": "Thank you!! Any ski options where our son can do some kiddies snow stuff?"}]}, {"id": "2193725207693224", "text": "Is it normal for hotels in Italy to NOT accommodate a family of 4 in one room? In the US, we are able to get one room with two beds. We are traveling with two kids - do we need two rooms? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2193725207693224/", "likes": 10, "comments": [{"username": "Danielle Smith", "comment_text": "We got a family room in Florence that was double pull out downstairs and a queen bed in the loft. In Rome we had two adjoining rooms."}, {"username": "Roland Trego", "comment_text": "You can ask if they have a connecting room (\"una camera comunicante\"), but they aren't that common."}, {"username": "Shelley Howard", "comment_text": "I've just rented apartments instead of hotels ...."}, {"username": "Diane Plott Miller", "comment_text": "The hotel we are booked at shows large rooms and some accommodate cots. Quiniarle Hotel"}, {"username": "Millie Fisk", "comment_text": "We usually get airbnbs in Europe. We found out they only can accommodate 2 adults and 1 kid per room"}, {"username": "Eleanor Marie Marschall-La Rosa", "comment_text": "Most of Europe is the same.\nHave you tried airbnb?"}, {"username": "Rosetta Iacono", "comment_text": "Some do. Where are you looking?"}, {"username": "Lauran Cantwell", "comment_text": "LeMeridien in Rome had 2 double beds but pricey."}, {"username": "Ashley Spuhler", "comment_text": "You can find places on booking . com that accommodate. We are a fam of 5 & never have issues finding a room to fit us all."}, {"username": "Erin Surmacewicz", "comment_text": "We just stayed at Excellence Suites in Rome in a quad room"}, {"username": "Bill Bowler", "comment_text": "Quadruple rooms are available but limited especially last minute."}, {"username": "Shannon Cox", "comment_text": "We were able to book quadruple rooms for October, I was trying to avoid sofa beds as my kids are teens so it took a bit of searching."}, {"username": "Marcie Muensterman", "comment_text": "Very normal"}, {"username": "Sherrin Wake Bracci", "comment_text": "We are a family of 4 traveling in September for 5 weeks. We found air bnb a better option to suit our needs."}, {"username": "Melissa McCormick", "comment_text": "We found rooms for 4 we have two littles. Rome we stayed at nazionale 51, Venice we did an Airbnb."}, {"username": "Laurie Anne", "comment_text": "hotel hiberia has family rooms that fit 4"}, {"username": "Rabun Wiley Neves", "comment_text": "Doable, but not the norm there. We traveled with our 2 daughters earlier this summer. We used an Airbnb’s in Rome, a VRBO in Florence, a B&B in Siena, and hotels sometimes with a quad room, sometimes 2 rooms everywhere else. Worked for us."}, {"username": "Tricia Marshall", "comment_text": "I used to book a VRBO I was in Italy with my kids. We had more space and a kitchen, which was wonderful."}, {"username": "Jared Mankins Scavotto", "comment_text": "We needed 2 rooms for us and our teens"}, {"username": "Grace Sulsenti", "comment_text": "Just be prepared that rooms with 4 people only have 1 bathroom."}, {"username": "Dina Zaid", "comment_text": "It’s different in the United States. It wasn’t easy for us to find a room to accommodate 3 but we ended finding them. If you are searching using Booking dot com set the number of people to 4 so it will show you only the available hotels that can accommodate for this. I hope this help."}, {"username": "Angie Mattin", "comment_text": "We’ve always managed to find rooms to accommodate the 4 of us, we stayed in Rome, Venice, ischia, and Florence. We’ve booked a hotel room for the 4 of us in Polignano a Mare and Tropea too. Had no problems in the U.K. or Germany either.\nI think you just need to be quick as there’s not many family/\nquadruple rooms available."}, {"username": "Gretchen Barretto", "comment_text": "Mel CastilloJoachim Miguel CastilloJoash Isaiah Castillo looks like we got lucky with Venice ❤️"}, {"username": "Desiree Jimenez", "comment_text": "Some hotels have family rooms (with two bedrooms). I've been to some that have had two queen beds in a room. You just have to look around.\nI know of one for sure with two bedrooms in Florence. Hotel Pendini...and has excellent breakfast!🥰"}, {"username": "Robin Burrell", "comment_text": "Quad Room booking"}, {"username": "Tammy Biasi", "comment_text": "All I had to do was ask for an extra cot and it’s like a single size bed they put up in our rooms"}, {"username": "Alicia Cox", "comment_text": "Same - we had 4 - found rooms."}, {"username": "Dayna Steinberg Cioffi", "comment_text": "Correct not the norm here. We are 4 (2 teens). We did connecting rooms everywhere. Splendid in Venice, Grand Minerva in Florence (Plaza Lucchese also has a family suite for 4) Hotel D’Inghlittera in Rome and Parco di Principe in Sorrento. Then we each have beds, and bathrooms to ourselves too. Rooms are small either way"}, {"username": "Rachel Gray", "comment_text": "Better off getting an Airbnb, much easier to find accommodations"}, {"username": "Pat King", "comment_text": "We had quad rooms with all \"real\" beds (no pull out sofas) for our family of 4 (2 college age) as follows: Venice- Pension Guerrato, Florence-Hotel Pendini, Rome-Hotel Rosetta, Conca dei Marini (Amalfi Coast)-Hotel Belvedere. Worked out great but we did book way in advance."}, {"username": "Rosalinda Winco", "comment_text": "Not just Italy, most of Europe. Most rooms accommodate 3. Sometimes you are able to find a quad room. We are a family of 4 and need to rent two rooms. It works out now since our kids are teens but if they were younger that wouldn't be good."}, {"username": "SA Schongarino", "comment_text": "I noticed that too and have been looking into Airbnb"}, {"username": "Kristina Ruk", "comment_text": "Mostly they have double rooms, but in Italy near lake Garda we had quadraple room. It depends..if looking you can find or some of the hotels can offer conected rooms.."}, {"username": "Eileen Marum Armitt", "comment_text": "I would get an air b@b"}, {"username": "Russ Coleman", "comment_text": "They aren’t luxurious but Novotel hotels normally do family rooms. I haven’t been to ones in Italy but have been to ones in a lot of other European countries and they do normally have rooms with 2 double beds."}, {"username": "Tracy Wrinn Mcdermott", "comment_text": "Consider VRBO or Airb&b rental instead."}, {"username": "Sam Mah", "comment_text": "Try looking for apartments (on booking, dot, com) the bonus with apartments is having a washing machine and dryer."}, {"username": "Candice Connelly Johnson", "comment_text": "We are a family of 4 and we’re able to find hotels to accommodate us. Most were called family rooms or quad rooms. We did not have to get 2 separate rooms anywhere."}, {"username": "Lisa Silverman", "comment_text": "Very small rooms, at least in hotel in Rome. Only big enough for 2 and maybe a small crib."}, {"username": "Vivien Paulik", "comment_text": "Rooms with two beds are for two people. Room with 3 or 4 beds can hold 2 adult and 2 lottle children. Not only in Italy. And also the size or the room and the bed cannot enough for 4 person. Beds in the hotels rooms in Europe are not as big as in the USA.\nApartment can be a good idea.\nFamily rooms are also exist, but not in every hotels"}, {"username": "Abigail Jang", "comment_text": "We traveled as a family of 4 and did Airbnb in all our cities. Having the extra space and a washing machine was really nice."}, {"username": "Stacey Esposito", "comment_text": "It's takes some looking but you will find them. They call them family rooms. I had a hard time finding them when I was looking 4 months ago but was able to get them in rome venice florence and sorrento. In Venice we have an apt but all the rest are hotels"}, {"username": "Esther Starren", "comment_text": "Some hotels have family rooms"}, {"username": "Rosa Boffa", "comment_text": "I had no trouble finding them for our 5 week stay in Europe. Occasionally, you might get a sofa bed. Only in Rome did we need 2 rooms but that was our choice as accomodation ticked off other requirements. Just stipulate that you need 1 Double or Queen plus 2 singles otherwise you will get 2 doubles etc."}, {"username": "Allison Mir", "comment_text": "Normal throughout Europe & uk. Hotels will have some rooms that sleep 4 but limited in number so you need to book well in advance"}, {"username": "Shanna LaDelfa", "comment_text": "Very typical!! We ended up doing Air B&B’s and 2 rooms when we stayed in a hotel."}, {"username": "Colleen Jennings", "comment_text": "Ask for a family room - double bed with 2 singles or connecting rooms with an internal door between the 2 rooms."}, {"username": "Jennifer Larese Taylor", "comment_text": "It can be quite hard to find a room for more that 2, unless you are booking a suite"}, {"username": "Jessica Petyo", "comment_text": "Yep! We had to book two rooms for us and our teens the last two weeks."}, {"username": "Jennifer Rand", "comment_text": "Usually if you enter 4 people in your search, it will come up with two doubles or you can specify one double and two singles. Hotel Quirinale has a triple and a quad room in tome"}, {"username": "Jaime Cleek", "comment_text": "When you are searching just put in the party number"}, {"username": "Tammy Barr", "comment_text": "Pom-Eric We are currently staying in Florence. Hotel Albani, in an amazing family room. Two separate corner rooms that adjoin internally with a third entry door. Short walk from the train station, which was easy with our luggage."}, {"username": "Halona Wong", "comment_text": "In Rome we stayed at the Hive hotel that slept four . It was a spacious corner room. They’re hard to find! In Athens and Naples we did apartment type Airbnb"}, {"username": "Mary Lee Ellington Mrochek", "comment_text": "Most hotels in Europe (especially well located hotels) cannot accommodate 4. We either book 2 rooms or book an Airbnb (depending on length of stay and what we find available)"}, {"username": "Maggie Byerly", "comment_text": "Look for quadruple rooms or family suites. Our family of 4 just traveled to Sirmione, Venice, Florence, and Milan and we always stayed together. Apartments are nice for extra space in the mornings and during downtime. This was one of our favorite spots (Florence): Palazzo Belfiore Residence Apartments with 2br, 2ba, kitchenette, sitting room. Also washer/dryer and water bottle refiller in the basement!"}, {"username": "Janet Messanelli Bozzone", "comment_text": "You have to search for quad rooms. Sometimes it is just a pull out sofa so check."}]}, {"id": "2193724014360010", "text": "How far is it from colleseum to the trevi fountain and best way to get there", "link": "facebook.com/groups/1373361046396315/permalink/2193724014360010/", "likes": 47, "comments": [{"username": "Sandy Radican Shikaly", "comment_text": "About 15-20 min walk"}, {"username": "AK Kaygen", "comment_text": "You can walk or take a bus\n\nNot far\n\nGoogle maps"}, {"username": "Cristina Galea Tonna", "comment_text": "Walk"}, {"username": "Joyce Fisher Ahrens", "comment_text": "We used Google maps and selected the walk option while in Rome and the Amalfi coast when we were trying to get somewhere specific. It was very helpful. It was so nice to use at home ahead of time when planning dinner reservations, etc."}, {"username": "Kay Sloan", "comment_text": "Golf cart tour 👍👍😁"}, {"username": "Jerry Japczyk", "comment_text": "Metro to the spanish steps then short walk"}, {"username": "Susan Leddy", "comment_text": "A long 20 minute walk in this heat🙂"}, {"username": "Lori Mongillo", "comment_text": "Take the hop on hop off bus, makes getting around Rome and the attractions easy. Trevi Fountain, Spanish Steps, Piazza Navona all in close proximity of one another."}, {"username": "John Schmitt", "comment_text": "About a mile with plenty to see along the way"}, {"username": "Lisa Long", "comment_text": "We walked everywhere"}, {"username": "Phillip Self", "comment_text": "How about walk.."}, {"username": "Cheri Arrowood-Stanziano", "comment_text": "We stayed at an amazing VRBO about half mile from Coliseum"}, {"username": "Sharon Milligan Martin", "comment_text": "Walk!"}, {"username": "Carys Williams", "comment_text": "Just walk an savour every minute of Rome 🇮🇹♥️"}, {"username": "Denise Wade Fulmer", "comment_text": "Hop on hop p off bus"}, {"username": "Kristin Bryant Powell", "comment_text": "What type of bus pass do I need for the hop on hop off bus?"}, {"username": "Naritta Nurit Matheus", "comment_text": "Very close. Go to piazza venezie and then cross the road and go straight... 20 min."}, {"username": "Alison Langella", "comment_text": "Walk..."}, {"username": "Jennifer G. Fernandez Moreno", "comment_text": "A taxi ride took us about 10 to 12 minutes and I think it was around €12 for the ride"}, {"username": "Jennifer G. Fernandez Moreno", "comment_text": "We were there at the end of June and it was brutally hot. I wouldn’t suggest walking unless you have lots of energy."}, {"username": "Wayne Brown", "comment_text": "We always use the hop on hop bus everywhere."}, {"username": "Sarah McCorkell", "comment_text": "We used google maps and took us 15/ 20 minutes"}, {"username": "Brian Osman", "comment_text": "Taxi is quickest"}, {"username": "Michelle Smith", "comment_text": "My daughter and I just walked everywhere. Everything is close together"}, {"username": "Tal Burdejny", "comment_text": "Google map will tell you exactly"}, {"username": "Ximena Quezada", "comment_text": "20min walk! Very fun walk!"}, {"username": "Allison Wilcock", "comment_text": "Walk, it’s not far 😊"}, {"username": "Jim Kelleher", "comment_text": "It’s about a 15 minute walk. It’s very easy; walk up the Via Fori Imperiali- directly across the street is the Via del Corso. There are sign for the fountain"}, {"username": "Martin L. Epperly", "comment_text": "Walking in Roma is great"}, {"username": "Teri Mayo", "comment_text": "You can walk."}, {"username": "Sheryl Elizabeth", "comment_text": "Google"}, {"username": "Dimity Betar", "comment_text": "Google maps 👌"}, {"username": "Oancea Bogdan", "comment_text": "Take the subway. The entrance is right next to the Colosseum"}, {"username": "Lisa Ann", "comment_text": "Walk, if you can."}, {"username": "Libby Szabo", "comment_text": "We walked there"}, {"username": "Laura Caputo", "comment_text": "Discover Rome by getting lost. Wear comfortable shoes and walk as much as you can"}, {"username": "Katie Elise", "comment_text": "We took a taxi today it was and it was less than 10 min."}, {"username": "Cheri Arrowood-Stanziano", "comment_text": "Walk….wear comfortable shoes. We walked 10-12 miles every day"}, {"username": "Marscha Fransisca Debora Basdew", "comment_text": "Hop on Hop off bus...goes everywhere you need to go"}, {"username": "Eileen Dalton", "comment_text": "92° and feels like 104°!!"}, {"username": "Gary Fossaceca", "comment_text": "Download Rome2Rio and it will give you detailed instructions."}]}, {"id": "2193719394360472", "text": "Hello.\nWhat is the easiest/economical way to travel from FCO to vatican?\nWe will be arriving at FCO on oct 15 8:40 am from chicago and we are heading to vatican hoping to get there by noon to attend 12 pm mass.\nWill taxi or train better.\nFamily of 4 here. With 2 9 year old.\nPls help. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2193719394360472/", "likes": 1, "comments": [{"username": "Amit Aviran", "comment_text": "Train from the airport will be a good option"}, {"username": "Stella Dee", "comment_text": "Taxi is easy and not expensive."}, {"username": "Vero N Ferny", "comment_text": "Uber"}, {"username": "Shelagh Kosinski", "comment_text": "Hire a car. Have to ask, What are you planning on doing with your luggage?"}, {"username": "Pong Ac Ai", "comment_text": "Taxi is faster but there’s a fix rate from the airport 50 euros"}, {"username": "Pong Ac Ai", "comment_text": "I’f you won’t catch 12 pm there is 5 pm mass too"}, {"username": "Elizabeth Lupo DiVito", "comment_text": "Get a driver. We just tried making it to a service from our flight on Pentecost. They drop rose petals from the Pantheon on Pentecost. But flight got delayed 7 hours at O'Hare so we missed it."}, {"username": "Frank Hunt", "comment_text": "Train, take you right there."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Remember you need to allow for enough time to drop your luggage off at your hotel or storage facility. I don’t know if you will make the noon mass if you only have three hours."}, {"username": "Janet Messanelli Bozzone", "comment_text": "The easiest is not always economical. But arranging a car service is by far the best and but not the most economical. You will probably need a van. A driver will meet you inside and help with your luggage and you don’t have to wait on the line for a taxi. It is a set price, but there may be an extra charge for a stop to check your luggage."}]}, {"id": "2193714194360992", "text": "I suffered a catastrophic lower limb amputation in April ,and trying to figure out if I can make my Italy trip in September .I will be using a wheelchair and a walker (for bathrooms etc ) and while no prosthesis yet ,I am hoping to make the trip ! Anyone out there experienced Italy while in a wheelchair ? I am going to Rome and Tuscany region .", "link": "facebook.com/groups/1373361046396315/permalink/2193714194360992/", "likes": 8, "comments": [{"username": "Michelle Casillas", "comment_text": "I have not seen many wheelchairs but that doesn’t mean you shouldn’t come. You’ve fought too hard through a life changing and difficult experience to not come. So here is what I do know…Italy does not have ADA. So make sure you research your hotels well. Many do not have elevators and have very narrow doorways. But there are hotels that have renovated and are much more accommodating so you should still be able to find something. Any tours you book (especially Tuscany)make sure they have capability for transporting a wheelchair. Hopefully someone on this page has better advice and experience. Have a fantastic trip 🍷🇮🇹"}, {"username": "David Ahlborn", "comment_text": "Years ago my partner, in wheelchair, and I traveled Paris and Rome. Everyone was so very kind. The Swiss Guards at the Vatican were super helpful. Sooo...I say GO! Just make sure your hotel has a lift."}, {"username": "Susan Lowry Lamb", "comment_text": "I agree with double checking on accommodations to be careful, but other than that? Go. It will help soothe your soul."}, {"username": "Stacy Derouin", "comment_text": "I visited Italy in a wheelchair and crutches ( my third trip to Europe, first to Italy). We saw Rome/Florence/\nPompeii/Amalfi.\n\nYou can absolutely do it-just requires some planning!\nWe were able to find hotels with elevators without too many issues. Bathrooms in the hotels were not necessarily accessible, depending on what accommodations you need, but I was able to make it work.\nAll the sites we visited were generally accessible, or at least \"doable\" We booked all private tours, as they could be more flexible without worrying about other folks.\nFor transportation,\nwe used private cars, occasional taxis and trains. If you contact Sala Blu( a group that has offices in the train stations that assists people with disabilities to access the trains) it makes the trains SUPER easy.\nThat's just high level stuff that comes to mind. Feel free to contact me if you have any questions I can try to help with. It can absolutely be done, if you keep in mind that since they don't have the same ADA laws we do, and you'll need to be more flexible, you'll be ok!!"}, {"username": "Francoise Coupal", "comment_text": "If you take any trains in Italy, check out Sala blu or blue, which is a service for those with mobility issues or are handicapped. They will even give you a wheelchair and transport you to your car of the train. It’s a very good service, reliable and free."}, {"username": "Amanda Lynn", "comment_text": "We just got back from Rome last week. My dad walks with a cane. We didn’t get him a wheelchair, and at times we did wish we had. I saw a couple of wheelchairs in various places (Vatican, Colosseum, etc.). I think as long as you’re taking one or have a rental set up, you’ll be ok. It’ll be hard because Rome is an old city built way before ADA, but doable for sure. Safe trip!"}, {"username": "Francoise Coupal", "comment_text": "I also believe that the website wheels of the world will provide you with a Hotel suggestions in Italy that have elevators, and or or wheelchair accessible"}, {"username": "Karen Scheer DeChalus", "comment_text": "You have gotten this far; you can do it!!! and as others have said, it only requires a bit of planning. We just returned from our 12 day dream vacation to Rome, Florence & Venice. Our son needed to take and use his wheelchair. We normally plan trips ourselves, but for a variety ￼of reasons, we used a travel agent who well researched all accessible excursions, hotels etc. She was great, but forgot to tell us about Sala-blu- an extraordinarily\nhelpful train service for persons with mobility issues. I'll provide link for you. They will get you on & off trains with no worries on your part. You just need to make reservations at least 24 hours in advance.\nPushing our son in a wheelchair in Rome- on cobblestones-ga\nve us a workout in the heat, but no complaints and so worth it. The Coliseum has an elevator!!! I'll be honest, we splurged for some private tours as we wanted to ensure our son could hear ever thing and that we would not be rushed in a group setting. We did that with. day trip to Siena, a winery and Pisa. All areas where we used the wheelchair with ease.\nPeople were so kind and helpful to us- from hotel staff to total strangers. There are good people in this world and nothing should stop you from creating a beautiful trip. Best of luck.\nhttps://\nwww.rfi.it/en/\nfor-persons-with\n-disability/\nsala-blu.html"}, {"username": "Janice Rea", "comment_text": "So sorry for your loss. I just came back from 2 weeks in Italy. While I am not in wheelchair, I have serious back and knee issues which affect mobility. I was worried about getting around. I took golf cart tours in Rome. Florence has them too. Lots of taxis and private transfers. Hotels with elevators. Do you planning ahead and you should be fine. Forge ahead and enjoy your trip."}, {"username": "Sam Hawkesford", "comment_text": "In Rome specifically me and my friend both commented on how accessible it was. Lots of stairs lifts/ramps etc. Hope you can make the trip and have a wonderful time x"}, {"username": "Alessandra Pasteris", "comment_text": "My hubby did not suffer an amputation BUT he did tear his meniscus a few days prior to arriving. He insisted on making the trip. He used a cane and was limited, particularly in Rome on the uneven terrain and crowded areas. We still managed to do the Vatican (with skip-the-line option), a golf card tour of all the significant landmarks (it’s our 12th time in Italy so we had already seen most of the sights before) but this golf cart tour was incredible & so worth it, especially for someone with limited mobility and in the scorching heat. We had booked the catacombes for the kids to see and I ended up taking them myself as hubby had too difficult of a time going up and down all the steps.\n\nIt’s doable but definitely look for alternatives to walking tours or regular tours."}, {"username": "Roland Trego", "comment_text": "There are companies like www. sagetraveling . com that cater to people with needs similar to yours."}, {"username": "Emily Clark", "comment_text": "If you’re interested in the coloseum, our tour guide was able to accommodate someone who needed an elevator."}, {"username": "Zurey Reyes", "comment_text": "We just came back from Europe, it was so challenging even without wheelchair, I wouldn't do it, sorry...honest opinion"}, {"username": "Donna Holt", "comment_text": "Oh no. Sorry to hear that. I hope you make out well on your travels.\nHeal well!"}, {"username": "Lois LaMonica Norton", "comment_text": "Check hotel. Some have elevators that only accommodate luggage and 1 person. Make sure wc accessible"}, {"username": "Margie Shapiro", "comment_text": "I have no experience or information - just wanted to say how sorry I am about your catastrophic injury!!! Wishing you good health and a safe trip!"}, {"username": "Janie Osborn Wiltshire", "comment_text": "I am a amputee and have traveled to Tuscany nine times and Rome three times. Message me any questions. The cobblestones will wear on your back. The energy will lift your spirit and you will love Italy. I go the first week in November. It is fresh olive oil time and I love the fall."}, {"username": "Linda Stockley", "comment_text": "I am here now and have seen several people in wheelchairs. Even the hop on hop off tour buses have places for wheelchairs"}, {"username": "Margaret Ryan", "comment_text": "Go. You'll still be in 🇮🇹 ❤️. Sounds like you've earned some time there and there is great advice from this group. You got this, Bless you.🤗"}, {"username": "Mary Pharr McGowin", "comment_text": "Hooray for you for forging ahead. My husband was diagnosed with Guillain Barre a few weeks before we left for fourteen days. He used a wheel chair for the bigger museums (and finally in Venice). We parked him in great cafes across from the Coliseum and on several squares (Siena, Lucca,)when it was just too difficult. He enjoyed people watching and eating pastries! Museums were great for wheelchairs- elevators, special entrances.\nHe finally agreed to a wheelchair to get around Venice- and then strangers from all over the world carried the chair while he used a cane on the stairs of bridges.\nWishing you a wonderful trip and a grand adventure!"}, {"username": "Jeanne Hannivig-jones", "comment_text": "I have been to Rome 2x with my partner at the time in a wheelchair... train staff are amazing and we were able to source hotels that catered... cobblestones were a problem. ... my husband's legs kept bouncing around and we secured his legs to the chair... rookie mistake ... the ties cut into his legs...\nHowever we saw everything we wanted.. skipped lines at the Vatican and St. Peter's and other sites... had a blast"}, {"username": "Carmel Napolitano-mancarella", "comment_text": "Don't let it stop you, I'm sure you will be fine, a lot of Rome is flat, and some of the Tuscan towns should be ok too, the cobblestones will be hard but still try and go and enjoy❤️"}, {"username": "Karen Espinoza", "comment_text": "You can do it ♥️👊🏻"}, {"username": "Fiona Cohn", "comment_text": "Last time I went to Italy I was able to hire a foldable mobility scooter in Rome! It got delivered to the hotel I was staying at. Just charge the battery overnight, and away you go. I toured all over Rome, Tuscany and Venice no problem. My Italian travel guide arranged for the coach driver to load it in the back with suitcases."}, {"username": "Kim Aranha", "comment_text": "This is the most positive thread I have ever seen since joining this group !!!! I think you have an awesome amount of good advice here! Though the museums and churches are important- there is nothing like sitting in a square and enjoying a glass of wine and enjoying the sights! I learned about Sala Blu and having a much older husband with mobility issues I am delight to have got that information for us.\nHave an amazing time- a trip to Italy is just what the doctor ordered!!!!! Buon viaggio i🇮🇹"}, {"username": "Kathy Tully Sexton", "comment_text": "Go for it! In our hotel in Bologna alone there were two people with casts in wheelchairs. And in every city we have visited we have seen people in chairs. Venice has chair accessible water taxis and gondolas."}]}, {"id": "2193709681028110", "text": "Just wondering the approximate cost for taking a taxi from Florence airport to downtown area to our accommodation. Any tips?", "link": "facebook.com/groups/1373361046396315/permalink/2193709681028110/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "look here https://\nwww.viator.com/\ntours/Florence/\nFlorence-Airport\n-arrival-transf\ner-to-your-hote\nl-in-Florence/\nd519-6367P95?pid\n=P00070587&mcid\n=42383&medium=l\nink&medium_vers\nion=selector"}, {"username": "Sandy Radican Shikaly", "comment_text": "Can't remember taxi price, but there is also a tram"}, {"username": "Pat Cray", "comment_text": "Around$16"}, {"username": "Blanca Gil", "comment_text": "We’ve paid between 20-30 euros for Florence to Peretola Airport at 4:00 a.m."}]}, {"id": "2193705394361872", "text": "Where is the best place to celebrate new year 2024 in north Italy?\nMilan, Florence, Venice or somewhere else", "link": "facebook.com/groups/1373361046396315/permalink/2193705394361872/", "likes": 0, "comments": []}, {"id": "2193697624362649", "text": "Hi everyone, I have a question regarding travelling solo to Italy. I am a 53 year old single female and in my circle no one can’t travel with me for one reason or another, I have been waiting now for over 2 years for anyone to coordinate their vacations with me with no luck. I have been single for over 10 years (by choice) and I enjoy it so much,आणखी that I don’t mind doing anything or travelling alone at all 😃. For this reason, I feel like I am missing out on wonderful travel experiences and I don’t want to wait any longer! My question is, how safe is for a single woman to rent a car and travel alone all over Italy? Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2193697624362649/", "likes": 20, "comments": [{"username": "Liss Marie Frantzen", "comment_text": "Hi. Look at the cummari.com … but i live here in Palermo with my man. We came 2 months ago so we Are living here, i feel safe when i am going around alone❤️ just contackt me on pm if u want."}, {"username": "Rita Kanten", "comment_text": "I'm 74 and have traveled solo for many years. Italy is my favorite country for solo travel. Very safe as long as you're smart and use common sense. Have a wonderful trip!"}, {"username": "Kim Preston Ackerman", "comment_text": "join the facebook group Girls LOVE Travel® lots of great posts about solo female travelers!"}, {"username": "Paula Brink", "comment_text": "You will be perfectly safe. I love my solo trips.\nI leave the driving in Italy to my husband when we travel together, on my own I use trains, lots of walking, taxis.\nIf you are going to drive, get an International Driving permit and read up on Italian road rules, especially the ZTLs. Every city/town has areas restricted to locals only and if you drive in there you will be ticketed."}, {"username": "Carine Brys", "comment_text": "It's quite safe. Just common sense like anywhere in the world. Pick-pockets in very crowded tourist places. Avoid deserted streets late at night, etc."}, {"username": "Sarah Hartley", "comment_text": "I went to Italy for the first time on my own at 21, and I felt safe 🙂 so much so, that I have been back on my own since, and plan on going again!\n\nPersonally I’ve never rented a car, but have used their public transport, and haven’t had any issues!"}, {"username": "AnneMarie Metrando", "comment_text": "Just do it. I gave up waiting on someone to travel with. Like going by myself. Can do and see what I want to do and see!!!!✈️"}, {"username": "Gillian O'Callaghan", "comment_text": "I'm 66 and just spent a month in Italy. Safe as any other place if you're sensible and attentive. I used trains though and did 1 full day tour from Rome to Amalfi and Pompeii. Loved it."}, {"username": "Susan Orr", "comment_text": "My daughter is 40 and just returned from 3 weeks in sardinia then flew to Florence then train to nice. All single and loving it. She felt safe and was out at night. Just have to aware of uour surroundings like u would in any city n"}, {"username": "Patti Farrell", "comment_text": "I did it several years ago. No problems"}, {"username": "Ginette Cochrane", "comment_text": "I went to Italy last year, 2 months all by myself I am 60 plus and it was the best of times. I used the train mostly but did drive Tuscany. The way I see it life is short ai am not waiting on anyone!"}, {"username": "Carol Ryan", "comment_text": "Maybe do partially a tour. A few days on your own then join the tour and a few days after the tour or move on for a week somewhere else after the tour. Have a look at Albatross Tours."}, {"username": "Anne Contini", "comment_text": "Perfectly safe. But use common sense. You will love my Italy and you will return!"}, {"username": "Dee More", "comment_text": "I just got back from 3 weeks solo travel - did a tour in Italy but was on my own for several days there, then also on my own in London and Paris. Just be aware if your surroundings, have a good GPS on your phone. I’d recommend train rather than driving. Travelling solo was very liberating and fun. I’d do it again. Have fun."}, {"username": "Regina Minogue", "comment_text": "On FB, search solo travelers; there are many groups. On this post alone many tips and even somebody who needs a travel buddy. Good luck. It will work out!!"}, {"username": "Kelsey Torpey", "comment_text": "I’m 42 and have been traveling solo in Europe for years. Italy is a wonderful place for solo travel. I feel safer traveling in Europe than I do back home."}, {"username": "Nicole Beaumont", "comment_text": "Just went last month solo and though I didn’t rent a car I felt safe everywhere I went."}, {"username": "Noel Mikhail", "comment_text": "You can go on a cruise to Italy !\nWe went this year and there were a lot of singles . Oceania cruise actually arranged for single to meet !"}, {"username": "Anna Orcino Louviere", "comment_text": "I have a friend at Donnakirkland.c\nom that does worldwide trips. She takes groups. She and group just got back from Thailand. Going to London in October. She is planning an Italy or an Italy/Greece trip. There are many singles that travel with her. My husband and I did a 16 day Italy with her a few years ago. She lets you get your money’s worth!!! Check out her website."}, {"username": "Bill Richards", "comment_text": "Google crime Stas for italy a d compare them with your home country's. Ic your from the US then the crime figures will, be considerably higher than Italys. Just go and enjoy yourself"}, {"username": "Tracey Knight", "comment_text": "Go for it. I’ve traveled in Italy by myself by train. As long as you look at it as an adventure and not a holiday. Some things won’t go to plan and that’s ok. A bad day in Italy is still better than a good day at work. Enjoy it and go with the flow."}, {"username": "Sheryl Korljan", "comment_text": "I didn’t hire a car but I did travel solo for a week in June, pisa, cinque terre and lucca. Public transport is fantastic in Italy, felt safe in all of those places, I’m 58 and one of the best hols I had. Even tried a hostel! Go for it"}, {"username": "Maggie Gpe Banuelos", "comment_text": "I’m traveling with my daughter but we have felt safe everywhere at every hour!!!! Sure even the locals tell you be careful with pickpocketers when you ride the bus but our imagination goes wild as to relate it maybe to a mugging….DEFINI\nTELY NOT THE CASE!!!! Do travel don’t miss out🙏"}, {"username": "Mary Fortura", "comment_text": "Go with a tour group. Travel with people who may become friends/future travel buddies and you get alone time when you want it."}, {"username": "Mallorie Mathis McManus", "comment_text": "Girl .. I went to Paris alone for this very reason. I had been divorced awhile - had just been through a very sad event concerning a grandchild/\ncancer - I needed to get AWAY. Got a smokin' deal and no one could go. I went by myself and it was Wonnnnnnderful (well, except for once retired for the night - this was long before affordable international internet). Anwyay .. GO ... Italy is Beautiful. Don't rent car for in Rome, Florence etc - parking nightmares. But outer areas should be fine (I personally would NOT drive along the coast near Sorrento to Almafi -- crraaazzzzy scary and better to hire a driver and enjoy the view!!). JUST GO ...."}, {"username": "Alejandro Gabriel Valenzuela Anghileri", "comment_text": "Just like any modern country in the world"}, {"username": "Blanca Gil", "comment_text": "I’ve traveled alone for years and absolutely love it. I have never felt unsafe traveling on trains, buses or walking at night."}, {"username": "Amanda Murray", "comment_text": "I have also travelled solo through Italy - driving on my own and using public transport. It is a wonderful, liberating, empowering experience, and an opportunity to connect with other world travellers and locals.\nDepending on where you're planning to visit, a car is just not worth the expense or the challenge. For example, if you're planning in spending a few days in Florence, Rome, or Naples ... either explore on foot, or use public transport if you're wanting to go a little further ... from Florence you can reach Lucca, or Pisa, or La Spezia by train, for a day trip.\nThe Amalfi Coast - use public transport - very little parking available for non-residents and parking garages are costly.\nTuscan countryside - you need a car to give you the freedom to explore, stop where you choose, find those gems along your journey.\nPuglia - as per Tuscany.\n\nAs others have mentioned, just always be aware. Don't leave yourself vulnerable though at night on the streets of Spaccanapoli, for example.\nSmall tours are great to join in and learn the history - there are any number online you can pre-book, depending on your interests.\nAlso pre-book skip-the-line tickets for main attractions, or you will spend your days queuing!\nHave the best time ever!"}, {"username": "Lee Sorenson", "comment_text": "I’d advise trains and other public transport. Parking is very difficult often, pedestrian islands, trying to navigate and drive, signage, etc. Have a wonderful time in a very beautiful, friendly country."}, {"username": "Pam McIntyre", "comment_text": "Do it!!!🥰"}, {"username": "Karen Dittman", "comment_text": "I don’t know the answer but have done ireland alone buses and trains….."}, {"username": "David Ahlborn", "comment_text": "Please go and enjoy every moment. You will have a wonderful time."}, {"username": "Maryanne Battistone", "comment_text": "Go and enjoy. Go with a tour"}, {"username": "Janet Messanelli Bozzone", "comment_text": "Why not go with a group that specializes in solo tour? GoAhead is one such company, but there are several others. Google them and read the reviews. You will have the benefits of a planned trip, companions, and safety in numbers…and you make some new friends. 🤗"}, {"username": "Kay Jenkins", "comment_text": "to be fully in control of what you see, where you go, when you go, how long you stay is the ultimate indulgence for a memorable holiday. you will be looked after and probably have more experiences than if you were part of a group."}]}, {"id": "2193696087696136", "text": "Hi! My husband and I are planning to go to Europe for the first time. Nothing is set in stone so we would love any suggestions for hotels/Airbnb, restaurants/cafes, how to travel around ,things to do, things to pack and or whatever you can think of! Please and thank you!! It would be so greatly appreciated.\n\nWe are planning for October 2024. 3 days in Ireland, 3 days in Paris and then a week or more in/ around Sicily Italy!", "link": "facebook.com/groups/1373361046396315/permalink/2193696087696136/", "likes": 0, "comments": [{"username": "Rhona OConnor", "comment_text": "Paris is mad busy right now, might ease by the time you are going. They are getting ready for the Olympics so many monuments ect are being repaired. It's very difficult to get museum tickets ect. Lots of road repairs making traffic a nightmare. You might be better going somewhere else.\nEnjoy Ireland 🇮🇪 😁"}, {"username": "Colleen Jennings", "comment_text": "Skip Paris & spend more time in Ireland, 3 days isn’t enough!"}]}, {"id": "2193681454364266", "text": "Wanted to post this as an FYI for anyone who uses Xfinity mobile. Their global travel pass is absolutely awful. We spent hours with their customer service team during our honeymoon trying to get phone access. If you have them (I know they aren’t super popular in all of the IS yet) make other plans for phone service before your trip!", "link": "facebook.com/groups/1373361046396315/permalink/2193681454364266/", "likes": 0, "comments": [{"username": "Carmine Castiglia Jr", "comment_text": "Or, turn off your phones and enjoy your honeymoon and each other's company. 😃🥰😀"}]}, {"id": "2193670091032069", "text": "Have just returned from a month solo in Europe ( mostly italy) . Just wanted to share as I felt nervous before I left as a solo female traveller and my trip was amazing. Felt very safe the entire time. Everyone was so lovely and helpful. The trains were so easy to navigate ( this was making me nervous). Would do it 1000 times over!!! Enjoy!", "link": "facebook.com/groups/1373361046396315/permalink/2193670091032069/", "likes": 40, "comments": [{"username": "Kay Rendall", "comment_text": "Great to see your post. I am.returning for 11 weeks in August. Como, Bologna then Puglia. To discover the Italy.I have seen before even after 9 trips. 70.plus Au female, solo, public transport. The 1st step is the hardest."}, {"username": "Kay Rendall", "comment_text": "That should be not seen before."}]}, {"id": "2193664561032622", "text": "Hello, I am holding a Schengen visa(France). Staying in Paris, France. I just don’t want to spend so much time in Paris. Any suggestion on best short day train trips that will not cause visa entry to/from Paris?", "link": "facebook.com/groups/1373361046396315/permalink/2193664561032622/", "likes": 0, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2193661651032913", "text": "Hello!\nI am looking to plan a trip for end of August into Labor Day Weekend (roughly 8/24-9/3). Last minute but a special 40th trip w/ my family (two adults and three kids). I know it's a popular time for travel and higher prices....\nAny recommendations where to go? Have been to Rome, Florence/Tuscany + Venice before so prefer somewhere new!\n\nThanks !!", "link": "facebook.com/groups/1373361046396315/permalink/2193661651032913/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nnextstop-italy.c\nom/\nvirtual-tours/\nbest-of-sicily/"}, {"username": "Rhona OConnor", "comment_text": "The Puglia area is nice, beaches and interesting places to visit."}]}, {"id": "2193656051033473", "text": "Hi everyone! We are going to Italy on next week, we will be visiting Venice, Rome, Capalbio and Riva del Garda. Can you reccomend some good places for kids ( 6 and 9 years old) in these regions? I mean, for example, good restaurants with kids menu maybe live cooking with kids or different attractions :)", "link": "facebook.com/groups/1373361046396315/permalink/2193656051033473/", "likes": 2, "comments": []}, {"id": "2193651027700642", "text": "My honeymoon will be in Italy in mid-October. Where are the warmest beaches this time of year? Will temperatures be warm enough for sunbathing then?\n\nWhat are other favorite was to relax in Italy in October?", "link": "facebook.com/groups/1373361046396315/permalink/2193651027700642/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nnextstop-italy.c\nom/\nvirtual-tours/\nbest-of-sicily/"}, {"username": "Colleen Jennings", "comment_text": "Hi. It’ll still be warm in October but the beaches “close” at the end of September, ie the chairs/\numbrellas are dismantled til the next years season. You can still go to the beach but you’ll need your own chairs etc. for warmth head to Sicily or Sardinia."}]}, {"id": "2193642617701483", "text": "We are heading to Italy in November for my 30th. 🎉 We plan to visit Italy again in the near future to enjoy warm weather, but are hoping to visit most of the ”touristy” spots during the hopefully less busy, cooler season. We’re flying in and out of Milan, but only plan to spend 1.5 days there.\n\nHere’s our current itinerary:\nDay 1: Milan\nDay 2:आणखी Day trip to Venice (we plan to spend more time here in the future when weather is warmer)\nDay 3: Florence\nDay 4: Florence\nDay 5: Chartered day trip from Florence\nDay 6: Florence\nDay 7: Rome\nDay 8: Rome\nDay 9: Chartered day trip from Rome\nDay 10: Rome\nDay 11: Milan\nDay 12: Fly home\n\nWhat changes would you make to this itinerary? Thanks so much, in advance. We’re very excited about this trip! ❤️", "link": "facebook.com/groups/1373361046396315/permalink/2193642617701483/", "likes": 7, "comments": [{"username": "Shannon Stanton King", "comment_text": "How exciting!!Looks\nlike a great trip. I had someone tell us Venice is great in November so you could consider more time there … unless you plan more time visiting the coast."}, {"username": "Rachael Richardson", "comment_text": "Pop to Pisa for a morning or afternoon to see the tower from Florence and visit Lucca same day as Pisa - all by local train"}, {"username": "Nicola Algerino", "comment_text": "Io aggiungerei Siena oppure campagne toscane"}, {"username": "Roland Trego", "comment_text": "Looks good to me. I'd save Lucca for the warm weather."}, {"username": "Karen Schmidt", "comment_text": "We were in Venice over winter. It was amazing! So many less people, the fog, happy locals, minimal waits. I would totally recommend going off-season."}, {"username": "Ruth Akutu Maccarthy", "comment_text": "In November I would have visit the Dolomites then mont Blanc. There are loads of winter activities, beautiful SPA etc"}, {"username": "Diana Hesse", "comment_text": "Fly in to Milan or Rome and out of the other so you don’t backtrack."}, {"username": "Serena Mascheretti", "comment_text": "If you do this itinerary in November, just a tip for the warmer weather is to skip completely them then, and concentrate your trip on Cinqueterre, Tuscan Country, Naples and Capri."}, {"username": "Robin Burrell", "comment_text": "I think this is a wonderful idea and itinerary. Have a great time! You are saving Venice for warmer weather but November is a great time to see it without crowds so maybe increase some days there."}, {"username": "Raquel Pickering", "comment_text": "Day trip to st moritz from milan on the bernina express!"}]}, {"id": "2193562451042833", "text": "Any hotel recommendations\nfor lake como with kids?", "link": "facebook.com/groups/1373361046396315/permalink/2193562451042833/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.anrdoezrs.ne\nt/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g635874-d5636\n17-Reviews-Hote\nl_Regina-Graved\nona_ed_Uniti_La\nke_Como_Lombard\ny.html"}]}, {"id": "2193580687707676", "text": "Hello, best places to see in Milan?", "link": "facebook.com/groups/1373361046396315/permalink/2193580687707676/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Milan/\nHISTORICAL-TOUR-\nOF-MILAN-skip-t\nhe-line-LAST-SU\nPPER/\nd512-33060P2?pid\n=P00070587&mcid\n=42383&medium=l\nink&medium_vers\nion=selector"}, {"username": "Ilaria Verda", "comment_text": "Duomo, Sant'Ambrogio, castello, la scala, citylife, Brera... So many activities..."}, {"username": "Kay Rendall", "comment_text": "The Doumo. Magnificent from outside. The La Scala Opera house. The railway station is unbelievable if u rnt travelling. The roof.\nThe Galleria shopping centre, with the beautiful decore. Bull on the floor in the centre, lucky not sure name just near the Doumo. Lots years since last visit which is why my info is sketchy. Do some research."}]}, {"id": "2193624507703294", "text": "Quick question-if you purchase business class tickets for the train, is there anyone to assist you with your bags? TIA", "link": "facebook.com/groups/1373361046396315/permalink/2193624507703294/", "likes": 0, "comments": [{"username": "Miyuki Kanno Paul", "comment_text": "No. You must load and unload your own bags"}, {"username": "Linda Miller", "comment_text": "No"}, {"username": "Cat Furness", "comment_text": "Not a chance….the train conductor will even watch you struggle with your bag & not offer to help!!!"}, {"username": "Colleen Jennings", "comment_text": "No. There are no porters at Italian stations unless you book special assistance."}, {"username": "Allan Olexa", "comment_text": "Plus, 3 steps up into cars and limited suitcase storage at the end of cars or between back to back seats. Otherwise, lift overhead onto the racks...pack lightly!!!"}, {"username": "Kerry Cofrancesco", "comment_text": "No assistance\n\nYou will have more room for your luggage and less crowded"}, {"username": "Carol Taylor Tisdale", "comment_text": "None."}, {"username": "Esther Starren", "comment_text": "Nope"}, {"username": "Lee D'Angelis", "comment_text": "No"}, {"username": "Karen Trom", "comment_text": "Anyone who offers to help might be helping themselves to your wallet."}, {"username": "Frank Hunt", "comment_text": "No and it’s not easy lugging heavy cases on a train at some stops. However trains are great and worth the effort."}, {"username": "Voula Ladas", "comment_text": "Trenitalia works with a company called Zyppy to offer the opportunity to have your luggage delivered . You can find more information on the Trenitalia website under Services. Haven’t heard from anyone that’s used it, but it’s worth looking into it if you have heavy bags. You have to plan it ahead as I think it takes about 3-4 days to reach your destination . Probably why it’s not that commonly used. Most people carry a medium to small suitcase as it’s difficult to lift heavy suitcases onto the train , especially if you are travelling solo."}, {"username": "Sigrid Picken", "comment_text": "NO!!"}, {"username": "Elena Innocenti", "comment_text": "No"}, {"username": "Rhona OConnor", "comment_text": "These are the steps into the train. You need to be able to lift your own bag.\nThe 'Business Class' is just slightly bigger seats (3 across rather than 4) and it's a bit quieter because there are less people ... Not a huge difference!"}, {"username": "Ildiko Gyimesi Mikos", "comment_text": "No way. I had business class tickets. No one around for such things. But inside of train is very nice and comfortable, with a set place to store your luggage."}, {"username": "Alexandra A Welker", "comment_text": "Unfortunately, no."}, {"username": "Karon Patterson", "comment_text": "No"}, {"username": "Julia Muller", "comment_text": "Nope!"}]}, {"id": "2193622331036845", "text": "Hi, am looking at a road trip of Italy beginning of October, does Pompeii have to be booked quite far in advance or can this be done the day or so before? Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2193622331036845/", "likes": 0, "comments": [{"username": "Miyuki Kanno Paul", "comment_text": "No booking necessary. I’ve visited Pompeii countless times and always walk up to the ticket windows"}]}, {"id": "2193613674371044", "text": "Hey there heading to Rome with a teenager.\nAlong with the sites we would love to visit a theme park. Also I'd love to visit a vineyard. Any advice would be greatly appreciated.", "link": "facebook.com/groups/1373361046396315/permalink/2193613674371044/", "likes": 0, "comments": [{"username": "Elena Innocenti", "comment_text": "https://\nwww.cinecittawor\nld.it/it\nCheck day and time, because not all day is open."}, {"username": "Brenda Barrett Dunphy", "comment_text": "Thank you"}]}, {"id": "2193601287705616", "text": "Looking for accommodation recommendations in Milan please. A hotel with a pool or an apartment with A/C. Much appreciated.", "link": "facebook.com/groups/1373361046396315/permalink/2193601287705616/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.kqzyfj.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187849-d1219\n9274-Reviews-Ho\ntel_VIU_Milan-M\nilan_Lombardy.h\ntml"}]}, {"id": "2193597361039342", "text": "Have one day in Rome and looking at tour options.\n\nI know skip the line is a must and I've read the day time is busiest. Is underground with it? Are there any mobility restrictions (traveling with my mom)?\n\nAny other recommendations for the best experience to make the most of our short stay before heading to Florence? Restaurants we shouldn't miss?\n\nThanks!", "link": "facebook.com/groups/1373361046396315/permalink/2193597361039342/", "likes": 0, "comments": []}, {"id": "2193597174372694", "text": "What’s the best option for cell phone service in Italy & Greece. I am from Australia & my provider is Telstra but not wanting to spend the $10 per day for international roaming as this will add up very quickly in 2 months. I have an Iphone if that helps.", "link": "facebook.com/groups/1373361046396315/permalink/2193597174372694/", "likes": 0, "comments": [{"username": "Fetchin Gretchen", "comment_text": "I get a sim card wherever I go. Vodafone is popular in both countries. Make sure your phone is unlocked and put your main sum in a safe place. Have whatsapp and or other voip phone app so friends can still text or call you."}]}, {"id": "2193585994373812", "text": "Hello all! Everyone has been so helpful with regards to all your tips and suggestions. This has been an invaluable reference for me. I am\nHoping you can help me out. Looking for your opinions on whether to do a day trip to Cinque Terre from Florence or Tuscany day trip Siena,San Gimignano,Pisa and lunch at a winery. We have time to do both but Iआणखी also want some down time ( to do some leather shopping and just explore on our own) and not over schedule. This would be two full day tours back to back . So I’m leaning towards one or the other other. Any thoughts and/or suggestions ? First timers and we are travelling in September. We are going to a cooking class as well. Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2193585994373812/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Florence/\nTuscany-Day-Trip\n-from-Florence-\nSiena-San-Gimig\nnano-Pisa-and-L\nunch-at-a-Winer\ny/\nd519-5070TUSCANY\n?pid=P00070587&\nmcid=42383&medi\num=link&medium_\nversion=selecto\nr"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Florence/\nCinque-Terre-Hik\ning-Day-Trip-fr\nom-Florence/\nd519-5070CINQUE?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}, {"username": "Sharon Johanssen Kamholz", "comment_text": "Yes. Already booked that exact Tuscany day trip. Looking at that trip to cinque terre - Question - which one or both?"}, {"username": "La Cinzia", "comment_text": "Don't forget Volterra, most ancient of San Gimignano!"}]}, {"id": "2193584401040638", "text": "Can anyone recommend a private boat tour to Capri from Sorrento that includes the Blue Grotto?\nTravelling in September.", "link": "facebook.com/groups/1373361046396315/permalink/2193584401040638/", "likes": 3, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "look here https://\nwww.viator.com/\ntours/Naples/\nCapri-and-Blue-G\nrotto-Private-T\nour-from-Naples\n-or-Sorrento/\nd508-20455P32?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}, {"username": "Cindy Gallen Barton", "comment_text": "\"The Tour Guy\" has a small group boat tour from Sorrento to capri, blue grotto and other sights. 8 people. They pick up and drop off at your hotel. 1st stop Capri where you have time on your own to explore then back on the boat to the Blue Grotto, white Grotto and green grotto. terrific outing"}, {"username": "Billie Begley", "comment_text": "Capitano Ago was fantastic. Also provides 4 hours free time to see Capri."}, {"username": "Nicole Lee", "comment_text": "L’aurora charter- the wait has been ridiculous for the blue but they will wait if you want to- we chose not to and glad we didnt wait because we saw so much and even saw part if the blue grotto without going in! 10+/10 when booking with franco and maria!"}, {"username": "Melinda Meyer", "comment_text": "Following"}, {"username": "Alex Kovacs", "comment_text": "Ours was supposed to (bookourtour Sorrento) but with the tide it was closed!"}, {"username": "Molly Mammarella Mullins", "comment_text": "Following"}, {"username": "Susan Ray Taylor", "comment_text": "Helpful hint: If you want to \"Follow\" any post, just click on the 3 dots at the upper right hand corner of the post, then click on \"Turn On Notifications For This Post\" 😊"}]}, {"id": "2193573997708345", "text": "Interested if anyone has used these for a big trip and if you would recommend? (Won’t be doing carry on only) coming from Aus and for 7 weeks! 🙏", "link": "facebook.com/groups/1373361046396315/permalink/2193573997708345/", "likes": 1, "comments": [{"username": "Liz Miller-Boone", "comment_text": "Loved mine and highly recommend"}]}, {"id": "2193570617708683", "text": "Any good wine tours from Taormina Sicily?", "link": "facebook.com/groups/1373361046396315/permalink/2193570617708683/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Taormina/\nEtna-Countryside\n-Food-and-Wine-\nLovers-Tour/\nd4237-6247P15?pi\nd=P00070587&mci\nd=42383&medium=\nlink&medium_ver\nsion=selector"}]}, {"id": "2193570091042069", "text": "Any recommendations for a trip to the Cinque Terre region from Florence", "link": "facebook.com/groups/1373361046396315/permalink/2193570091042069/", "likes": 3, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Florence/\nCinque-Terre-Hik\ning-Day-Trip-fr\nom-Florence/\nd519-5070CINQUE?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}, {"username": "Gina Spyker Fairfield", "comment_text": "Florencetown! You meet at their office in Florence and take a van with a small group (in our case it was my husband and I plus 3 other couples). We hiked some of the cliffside terraces, had time to explore 3 of the 5 villages, and had a delicious lunch done family style with our group. Our guide was fantastic!"}, {"username": "Michael Martin", "comment_text": "Yes be prepared to hold your breath and never want to leave"}, {"username": "Cyndi Perrotta-Gemma", "comment_text": "Take a private tour."}, {"username": "Debbie DiOssi", "comment_text": "Viator has a great one."}, {"username": "Liz Ariar", "comment_text": "From Florence we took the regional train to La Spezia where we stayed for 2 nights. Then we took the local train to Cinque Terre to visit the 5 villages. we hop on hop off the whole day. Amazing experience."}, {"username": "Robýn Kretsçhmər Schuchårdt", "comment_text": "Following"}, {"username": "Ashima Avasthi", "comment_text": "You can do an easy day trip too. Train to le spezia and 6 min cab ride to the boat point. And do a boat tour. You get it easily. You can hop on and off the boat to explore villages ( 2-3 are enough) and take a train back from Monterosso."}, {"username": "Ashima Avasthi", "comment_text": "And avoid get your guide tours"}, {"username": "Whitney Meyers", "comment_text": "Villa Valentina is the best! Great hosts, great breakfast, great everything. Check it out for sure"}, {"username": "Hanna Georgia", "comment_text": "I’m doing a day tour from Florence"}, {"username": "Jamie Cardinal Mueller", "comment_text": "Rome"}, {"username": "Michael Gillihan", "comment_text": "Paola's Florence Tours - Paola Migliorini"}, {"username": "Len Murtha", "comment_text": "Riomaggiore. One of the best meals ever!!! La Cantina Del Macellaio in Riomaggiore, Italy. Best lasagna on planet earth."}]}, {"id": "2193292144403197", "text": "Hello. New here. Travelling last weekend of August for my birthday. Looking to visit Florence, Rome, but looking to find some nice beach location with truly clear blue waters.pictures and reality tend to differ I find. Any suggestions? Drive to sicily? Tuscsny? Anywhere else perhaps? Is it really going to be very busy everywhere?", "link": "facebook.com/groups/1373361046396315/permalink/2193292144403197/", "likes": 46, "comments": [{"username": "Georgina Mcauliffe", "comment_text": "Heck yes it will be busy - even if you walk to a remote beach it will be towel to towel. I would go to the Eolians or Sardinia for beaches personally but not for a short trip. Tropea is nice but it will be packed. Favignana maybe of Trapani? If you want to do Rome and Florence why not just stay local and put up with the crowds - somewhere fairly west of Cinque Terre perhaps but it's not vivid blue."}, {"username": "Chris Vilsack", "comment_text": "From Salerno down.. The water is bath water, and there are stunning beaches everywhere! Palinuro!"}, {"username": "Patrizia D'Arcangelo", "comment_text": "Hello, I'm Italian.\nTropea, \"Spiaggia della Rotonda\" (Calabria) or all the whole area of Salento (Puglia; for example \"Spiaggia di Punto Prosciutto)"}, {"username": "Leila Myftija", "comment_text": "Punta Ala or Torre Mozza in Tuscany."}, {"username": "Marisa Greco", "comment_text": "Puglia"}, {"username": "Lynn Macri", "comment_text": "Sardinia"}, {"username": "Lynn Macri", "comment_text": "I agree Jennifer Rand ! Favourite spot"}, {"username": "Alex Hicks", "comment_text": "Portofino or Monterosso al Mare"}, {"username": "Mary Agozzino Derrick", "comment_text": "There is a lovely beach in Agropoli in Campagna lungomare ....it is where many northerners from Milano, etc go to..."}, {"username": "Zimog Bestia", "comment_text": "Feniglia provincia di Grosseto fidati io stò proprio lì!"}, {"username": "Gabrielle Wiseman", "comment_text": "The other year I went to the island Monte Argentario - off the coast not far from Civitavecchia (a town about an hour from Rome). The water in Monte Argentario was crystal clear and the place also had very little tourists. However if you go at the end of August it may be busy with Italians on their Ferragosto just a head’s up!"}, {"username": "Lara Grom", "comment_text": "Hi I would definitely suggest visiting the island such\nAs Elba giglio, amazing sea less people. Hotel la guardia at giglio a dream"}, {"username": "Alyson Alai", "comment_text": "Sardinia"}, {"username": "JoAnn Bobier", "comment_text": "Portoferraio on Elba Island you can drive from Florence"}, {"username": "Margaret Mackenzie", "comment_text": "Sardinia - beaches look amazing"}, {"username": "Jen Alexitch Rachow", "comment_text": "Monterosso in Cique Terre if you want to go north"}, {"username": "Mary Evans", "comment_text": "It will be very hot for sure."}, {"username": "Emma Dowling", "comment_text": "Capri"}, {"username": "Nora Motter Stark", "comment_text": "Cinque Terre or Sardinia <3"}, {"username": "ಲಾಲಾ ಕೆನಡಾ", "comment_text": "Sardegna is like the Caribbean of Europe"}, {"username": "Suzanne Mills", "comment_text": "Lake Garda in Italy"}, {"username": "Jenny Genzale", "comment_text": "August is the month that Italians - almost ALL Italians - take vacations and head to a beach destination. Autostradas can be crowded and slow. Sardinia might be a good choice. You can take the car ferry over from Livorno (in Tuscany). Really beautiful beaches (and people) in Sardinia."}, {"username": "Nicola Morgans", "comment_text": "taormina is the most beautiful place. if you go from tuscany go on the night train to sicily. saves hours and you sleep all the way and wake up there."}, {"username": "Manon Cote", "comment_text": "Li de Roma was nice"}, {"username": "Julieanne Kelly", "comment_text": "Yep Sardinia 🙌🏽"}, {"username": "Margaret Mackenzie", "comment_text": "Julieanne Kelly hi lovely"}, {"username": "Missy Kupillas", "comment_text": "When you’re in Florence, you can take a day trip stop by and see the leaning tower of Pisa, and then go to a Forte dei Marmi to the beach…? It’s known for its beaches and is in Tuscany on the Tyrrhenian Sea. It’s a full but beautiful day!"}, {"username": "Jennifer Hodge Brinkmann", "comment_text": "I live in the Southern US and just thought if they visiting Georgia and Alabama why not anywhere in the gulf along on 30A when I saw the word beach. I forgot what group chat I was on. Hahah"}, {"username": "Jennifer Hodge Brinkmann", "comment_text": "Love Sorrento and capri for a beach feel it’s near Naples an easy train ride from Rome"}, {"username": "Judith Sico", "comment_text": "Cinque Terre!!! Magical\nMonterossa has best beaches..\nStay at Hotel 5"}, {"username": "Janis Albanese", "comment_text": "Via Reggio?"}, {"username": "Jeff McLellan", "comment_text": "How long are you planning on being in Italy?"}, {"username": "Yash Gupta", "comment_text": "Cinque de terre beaches in the 5 villages are very nice especially the one at Monterosso"}, {"username": "Ilaria Verda", "comment_text": "Villasimius in sardinia"}, {"username": "Jennifer Rand", "comment_text": "Tropea has the most beautiful beach I e seen yet!"}, {"username": "Graham Sherlock", "comment_text": "It will be very very hot so be prepared"}, {"username": "Roland Trego", "comment_text": "While there are beaches in Tuscany and near Rome, none of them as I recall have vivid water. I think you would have to travel quite a distance to get that. Sicily is very far from Rome and Florence. It will take up most of day to get there. Puglia is a better bet for clear, turquoise-/\nazure-colored waters, but it isn't close, either."}, {"username": "Lisa Hedenberg Nichols", "comment_text": "Amalfi"}, {"username": "Graham Sherlock", "comment_text": "Amalfi beaches are so underwhelming and pebbly and hot under foot."}, {"username": "Marianne Alford Osentoski", "comment_text": "Capri"}, {"username": "Alejandro Gabriel Valenzuela Anghileri", "comment_text": "Sardinia, absolutely"}, {"username": "Ali Everson", "comment_text": "Bring thongs if going to the beach! Hot pebbles!"}, {"username": "Steve Grossman", "comment_text": "There are beautiful beaches just west of rome. You can be there in less than an hour"}, {"username": "Helene Wright", "comment_text": "Go to La\nSpezia and take the ferry to Cinque Terra."}, {"username": "Erika Sa", "comment_text": "We have now agreed an sicily, and shuffling flights around to avoid long journeys. Any suggestion on sicily beaches? Thank you so much!"}, {"username": "Joy Crawford", "comment_text": "Really hot there now. Be careful"}, {"username": "Erika Sa", "comment_text": "Going last weekend of August"}, {"username": "Masha Negri", "comment_text": "C"}, {"username": "Terri Orf", "comment_text": "Capri!!!!!"}, {"username": "Lisa Hry", "comment_text": "I’ve been looking into Tropea and the prices seem reasonable. Can anyone comment on this who has been?"}, {"username": "Sandie Chandler", "comment_text": "The water around Positano was beautiful and Capri apparently too, but I didn’t make it there. The beaches I went too had pebbles not soft white sand, but Sicily and Sardinia is worth looking into."}, {"username": "Sandie Chandler", "comment_text": "Positano"}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "Go to Camogli or Portofino and take the boat to remote San Fruttuoso, small remote beach cove with a few hood restaurants, sand and swimming. It’s dreamy! Can’t guarantee it ring be busy. August is with the Italians vacation!\n\nThis pic is from October after the crowds left."}, {"username": "Michele Baron Vold", "comment_text": "Taormina"}, {"username": "Cindy Vennare", "comment_text": "We finished 14 days in May. Rome, train to Florence, rented a car to Siena & Pisa, airplane to Lamezia Terme and taxi to Tropea. Tropea is amazing European vacation spot. Life changing Italian gin and tonic."}, {"username": "Jeanne Hannivig-jones", "comment_text": "The island of ponza..."}, {"username": "Jeanne Hannivig-jones", "comment_text": "Jeanne Hannivig-jones"}, {"username": "Hollis H McGuire", "comment_text": "August? As busy as it gets."}, {"username": "Patricia Rada Basili", "comment_text": "Viareggio has beautiful beaches, restaurants and shops. It is only a 90 minute train ride from Florence"}, {"username": "Janet Brune", "comment_text": "Amalfi us breathtaking! The hotel marina Rivera was gorgeous right on ocean walking distance to excellent restaurants and shopping. Just step out hotel and everything is only 1-2 blocks away. Fabulous restaurants on water and in shopping area. Water is unbelievable"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nnextstop-italy.c\nom/\nvirtual-tours/\nbest-of-sicily/"}, {"username": "Claudia Castellini", "comment_text": "Sicily has beautiful sea and much more to see, but is pretty faraway from Rome, you need much time to go there.\nIn Tuscany, Argentario is beautiful, although in August is gonna be very crowded.\nElba island as well.\nYou also could go to Capri and Ischia or to Ponza (closer to Rome).\nMuch depends on how many days you have."}, {"username": "Giessica Bormio", "comment_text": "From Tuscany i suggest Maremma, betwen Tuscany and Lazio"}, {"username": "Liz Ariar", "comment_text": "Cinque Terre definitely"}]}, {"id": "2193428261056252", "text": "When you purchase travelers insurance, do you buy it for each flight you’re taking and each hotel you’re staying at? It seems to be offered separately for each flight I book & each hotel stay (1 in Rome & 1 in Florence).\n\nTIA!! :)", "link": "facebook.com/groups/1373361046396315/permalink/2193428261056252/", "likes": 1, "comments": [{"username": "Skye Birch", "comment_text": "this must be an American thing as UK you pay for your whole duration? ie. 7 days you get u 7 days travel insurance that covers for the whole time you are there.."}, {"username": "Kathy Young", "comment_text": "I booked policy for land, sea and air all together."}, {"username": "Madeline Caporale", "comment_text": "You purchase it to cover all legs of your trip. You can also purchase a policy that covers all travel within a calendar year."}, {"username": "Allison Mir", "comment_text": "You arrange for date your trip begins to the date you get home. If travelling to more than one country check your policy covers all"}, {"username": "Gillian O'Callaghan", "comment_text": "I get it per trip....for instance my current insurance for 5 months worldwide includes all medical including medevac and other flights home e.g. for surgery, family member coming if I'm more than 10 days in hospital, emergency trips home, cancelled accommodation for most circumstances, lost or stolen luggage, lost property, dental repairs etc etc."}, {"username": "Rhona OConnor", "comment_text": "You can get singe or multi trip insurance. I get a 1 year policy."}, {"username": "Alla Zats", "comment_text": "I insure flights hotels."}, {"username": "Joleena Pickett Louis", "comment_text": "Do you travel more than once a year? I get annual insurance on that covers all my trips. I believe it’s about $200 a year."}, {"username": "Jacquie Johnston", "comment_text": "In 35 years of traveling outside the US I’ve never bought insurance. Oct 2022 on a cruise I needed some Medication saw the ship Dr paid $200 for visit an meds. I filed a claim with Medicare they paid me the allowed amount of $65. 👍"}, {"username": "Shelley Howard", "comment_text": "Mine covers me from the first flight date till I land back at home and it covers medical, transport and everything in between ..."}, {"username": "Jeannie Morris Wierman", "comment_text": "I purchase an annual travel plan thru Allianz. Covers all trips during the year. $450 - covers my husband and me."}, {"username": "Melissa McCormick", "comment_text": "Make sure you read the whole policy… we bought Airbnb insurance and our flight was cancelled and we missed a night at the Airbnb and they would not cover the night since the airline cancelled due to operational because they only would cover delays due to weather, mechanical, or a strike. It wasn’t that much money but we did try to get that back since we bought the extra insurance in case something like that happened."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Always buy independent travel insurance."}]}, {"id": "2193242114408200", "text": "Hi everyone, we are traveling to Rome on July 31! Can anyone please tell me where good affordable restaurants and gelato shops are please 😁 thanks. Maria D'Elia, Mike Mandalorian, Mario Paccione", "link": "facebook.com/groups/1373361046396315/permalink/2193242114408200/", "likes": 0, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}]