[{"id": "2201314393600972", "text": "We are travelling to Venice from the maritimes via Toronto YYZ with Air Canada…not direct. Wondering if anyone who’s had checked baggage had their baggage lost?", "link": "facebook.com/groups/1373361046396315/permalink/2201314393600972/", "likes": 0, "comments": [{"username": "Sandy Mason", "comment_text": "You should be fine if it is a direct flight. It’s when you have a connection that luggage is at risk for delay."}, {"username": "Sarah Louise", "comment_text": "We flew Toronto to Rome last week (direct) and they required us to check our carry on suitcases due to limited space. We did not have any issues with lost baggage thankfully however I put a smart tag in my luggage just in case that happened"}, {"username": "Rhonda Smith", "comment_text": "Direct flight in May with no problems! Enjoy!"}, {"username": "Patricia Portas", "comment_text": "We only hear about luggage that gets lost. Most times everything works just fine.\nWe travelled from/to Montreal on Air Canada with no issues with luggage."}, {"username": "Jamie Bly", "comment_text": "Just went through Toronto to Rome two weeks ago, no issues"}, {"username": "Sarah Wanless Pescitelli", "comment_text": "I’m still without my luggage. I have an air tag in it so I know where it is. Vancouver to Rome. Our connecting flight was Calgary. It sat in Calgary for a day and somehow ended up in Montreal for a number of days. Then it flew back to Calgary and got to Rome a week late, but we had already moved on by that point and they were supposed to ship it to me, but they still haven’t! It’s been 3 weeks on Sunday, which is the day we depart back home. I’ll pick it up tomorrow! It’s been a nightmare and no one seems to care! I learned a hard lesson! Carry on for life now! Our flights were with WestJet, but you take a chance with all airlines!"}]}, {"id": "2201546560244422", "text": "My daughter and I did a amazing race Italy vacation trip this week. Trip went like this……Corfu by boat to Bari, Bari to Roma by train, Roma to Firenze by train, Firenze to Valencia by train, Valencia to Milanoआणखी by train, Milano to Como by train, then Fonticulare up to Burnante, where we stayed. We started Sunday @0130, spent 8 hours each place, then back on train, finally rest for 3 days in como.\nNow on train to Vianna then Prague. And its only day 6. 2 days to go. Woo….", "link": "facebook.com/groups/1373361046396315/permalink/2201546560244422/", "likes": 2, "comments": []}, {"id": "2201562236909521", "text": "Is it possible to do Rome & Vatican in a day? Planning to do Roman Forum, Palatine Hill, Colosseum, St Peter's Basilica, Sistine chapel & Vatican museums....is it too ambitious or doable? Thanks so much for all your inputs... This group is so helpful 😻", "link": "facebook.com/groups/1373361046396315/permalink/2201562236909521/", "likes": 25, "comments": [{"username": "Mary Evans", "comment_text": "Pretty ambitious but book Vatican ahead of time. Beat the crowd and do “skip the kind” the rest are close enough to walk to all!"}, {"username": "Liz Carlton", "comment_text": "No"}, {"username": "Sherri Leis Dillavou", "comment_text": "Not really"}, {"username": "Andrej Timko", "comment_text": "Far too ambitious...if you say do Vatican in one day I would say maybe ...very fast and with those crowds...but this what you are up to is in my humble opinion mission impossible...ev\nen Tom Ctuise would not be able to do this 😀"}, {"username": "Bernadette Breen-Shinner", "comment_text": "Nope"}, {"username": "Shannon Welch Farr", "comment_text": "We did the Vatican one day and the Colosseum and other sites the previous day. Would highly recommend splitting them up.\n\nPlanning a another trip to Rome now and thinking of doing the Vatican early then the Trevi Fountain and Spanish Steps that afternoon. Devoting a second day to the Colosseum (plus an art museum).\n\nI don’t think my brain could absorb the significance of the Vatican and the Colosseum in one day, even if the timing were perfectly planned."}, {"username": "Abigail Lippmann", "comment_text": "We don’t have much time in Rome and yes you can do a tour it’s called Rome in a day."}, {"username": "David Davey", "comment_text": "Nothing is impossible, impossible tasks just takes longer. 😂"}, {"username": "Georgeta Totolici", "comment_text": "No"}, {"username": "Najeana R. Crandall", "comment_text": "No. Do at least 2 day."}, {"username": "Elaine Valte-De Jesus", "comment_text": "That would be tiring. Try to tour the Vatican another day"}, {"username": "Janine Emma Lucas", "comment_text": "If doing as an organized tour, yes BUT you’ll only be skimming through each location, if you are tight on budget and time and it’s important to see all these, then it’s a great way to get through a lot, otherwise if on your own it would not be easily possible."}, {"username": "Melissa De La Cruz", "comment_text": "Yes we did this and even though we were exhausted and couldn't take our time, I'm glad we packed it in! We couldn't extend our trip so we had no choice but I'd do it the same way if I could go back in time."}, {"username": "Sam Hammad", "comment_text": "Rome is not abut going back home and say I've been there 🙄 its about living it"}, {"username": "Richard Doolan", "comment_text": "You could drive past them all"}, {"username": "Russ Whitley", "comment_text": "Hope you’re a fast runner. 😁. Vatican and surrounds is a day. The area around Colosseum and down towards Parthenon you can probably cover in another day, but it’s a rush all round."}, {"username": "Lucrezia Folger", "comment_text": "Nope."}, {"username": "Martha Heller", "comment_text": "We've been to Rome several times... beside the \"major\" sites, there are so many tiny streets to explore...you'l\nl find interesting small museums, great trattorias, outdoor markets, etc!"}, {"username": "Michelle Plakosh", "comment_text": "We did Vatican and Coliseum in one day. That was enough. LOTS of walking and steps."}, {"username": "Enery Castellanos", "comment_text": "I’m here now and did the Colosseum yesterday and today the Vatican.\nYou have to be in great shape. It’s brutal 🫣 I’m wiped out."}, {"username": "Kit Nader", "comment_text": "How can you enjoy any of it if you're just dashing from place to place...you'll say you've been there and seen this and that. But in reality yiu saw nothing."}, {"username": "Rachael Richardson", "comment_text": "In a day - way too much - you will be shattered , you won’t enjoy in my opinion"}, {"username": "Cerese Nadine", "comment_text": "No. Not even remotely."}, {"username": "Kris McAllister Ehlis", "comment_text": "Possible? Yes. Recommended? No. You’ll be shredded, and won’t enjoy it nearly as much as you should!"}, {"username": "Sandy Cence", "comment_text": "Nope"}, {"username": "Terry Checketts", "comment_text": "Saddens me that some people only have one or two days in Rome. I have been 4 or 5 times now and still haven't seen it ALL.\nI love just wandering down the side streets exploring, seeing where it takes me, looking at shops, buildings, ruins ( almost like, turn a corner and there's another old wall, Arch or something)\nTo sit in a cafe, Bar, restaurant and people watch is great. The foods not bad either 😁\nI can do 10 - 12 miles just happily wandering."}, {"username": "Michele Merrell", "comment_text": "No."}, {"username": "Keli Mauer Sorrentino", "comment_text": "I have done most of my European cities via cruises so far. I had a rule of thumb from the beginning - we are there for a day, never try to see everything. Can you do it? Sure. Should you? I say no. It will be rushed. If you want to stop and enjoy a certain place, you won’t be able to. And, most importantly, randomly stopping at a cafe to have a coffee and pastry or a glass of wine while watching people walk by and getting a real sense of the place will never happen. And that’s the best part! I rush through my everyday life too much. When in Rome, take some time. Have the cappuccino. Relax a little."}, {"username": "Dina Zaid", "comment_text": "It has to be a sneak peek of everything otherwise not possible"}, {"username": "Alexandra A Welker", "comment_text": "I think it's doable but it will be one long day and you need to start very early in the morning. But not sure how enjoyable that would be, it'll feel rushed. And if you have kids in tow then it will be too much for them."}, {"username": "Patty Ham", "comment_text": "No"}, {"username": "Pate Mears", "comment_text": "You want to enjoy your visit, not kill yourself. Don't forget it will take you time going through all the places. There will be other people there, too. Start your day and go early. We went to the Vatican at 6:30 am, and started early. It was well worth it. We loved Rome and spent 3 nights there at a nice pace. We lived in New York City for many years and know how to move, but don't forget it is vacation. Some lines also move faster than others. Enjoy - it is a beautiful place."}, {"username": "Arhita DF", "comment_text": "Not ideal but possible so as long as you book the Vatican via a tour to beat the lines. The lines are crazy long if you don’t book in advance. We got in pretty much as soon as we arrived because of that reason.\n\nStart early to fit as much as you can in your day. For us we had a 9am start in the Vatican then was out of the museums by 12pm. Timing depends on how in-depth you want to go when going to the museums etc.\n\nThis was in January 2020."}, {"username": "Desiree Bello", "comment_text": "No way"}, {"username": "Sara Anderson Boyer", "comment_text": "It really wouldn't be a good experience. There's too much to see and appreciate. I think you would regret it."}, {"username": "Keith Crossley", "comment_text": "Depends on what you mean by \"do\". Can you \"do\" a love affair in a day? Sure, if thats what you want."}, {"username": "Dominique Tarplin", "comment_text": "That’s a lot in one day. We broke it up in 2 days and we were still tired as heck. I honestly don’t think it’s possible to do all that in one day. You’ll be so stressed and overwhelmed. Vatican City and Sistine Chapel took us about 4 hours. We were so hungry and tired afterwards"}, {"username": "Kathy Holden Reams", "comment_text": "Yes! We did it last week! It was hot and felt rushed but we did it."}, {"username": "Charleen Siegler Schuss", "comment_text": "Do an early St Peter's visit then on to the Vatican Museum. Save ancient Rome for another day or go see ancient Rome at night all lit up"}, {"username": "Tari Lawson", "comment_text": "It's possible but you will probably be exhausted."}, {"username": "Rose Weaver Fullmer", "comment_text": "7-8 hour private tour or golf cart tour picks you up at the Vatican after your early morning tour. That’s the best you can do in one day."}, {"username": "Amy Cobb", "comment_text": "We did it but it’s a lot. We did colosseum, forum and hill in the morning and Vatican in the afternoon. If we had had more time I would’ve done them on different days."}, {"username": "Kate N Karim Al-Azzawi", "comment_text": "Um..I wouldn't. Especially in the heat. We did one each day. I would say that both would be exhausting - particularly because they aren't close to each other, you need to build in time to cool off especially after the Colosseum and maybe eat something and regroup. The Vatican was extremely crowded and also very hot."}, {"username": "Sue Lindsey Meeks", "comment_text": "No."}, {"username": "Rocio Arjona", "comment_text": "Italy should not be done in a rush… 😢"}, {"username": "Brynne Towner McClanahan", "comment_text": "We did an 8:30am Vatican tour, then 1pm golf cart tour around Rome, then 5:30pm Colosseum tour. We missed Palatine Hill.\n\nWe obviously wished we had more days, but it amazingly worked out really well - and we had kids with us!"}, {"username": "Mary Skvarch", "comment_text": "Way too much in one day."}, {"username": "Terri Gliatti", "comment_text": "I would say do the Vatican and Coliseum. You can't get all that in. Buy tickets for Vatican when it opens up. You can probably get a quick look at the Roman Forum after the Coliseum."}, {"username": "Julie Kov", "comment_text": "All in one day? Not possible"}, {"username": "Michelle Bergman Davis", "comment_text": "Nope"}, {"username": "Julchen Zamora", "comment_text": "There is a tour that includes Colosseum Palatine Hill Roman Forum In Rome then lunch and then the Vatican with all the museums St Pete Basilica and Sistine Chapel\n\nPerfectly loable"}, {"username": "Tracey Fairbrother", "comment_text": "3 days comfortably or 2 days at least at a push"}, {"username": "Gwyneth Spadaro-Dutturi", "comment_text": "I think I would need a week! I would want to walk around slowly read all the notices, gaze at statues and paintings, take photos and generally absorb it all."}, {"username": "Christine Ann", "comment_text": "I just did it this week. It was doable"}, {"username": "Michela Zanni", "comment_text": "No. One day only for Vatican Museum"}, {"username": "Nancy Lewis", "comment_text": "Don’t forget Spanish Steps and Trevi fountain"}, {"username": "Niki Tee", "comment_text": "Vincent Brander"}, {"username": "Vanessa Durkin", "comment_text": "Queues too long to enable that need at least two days can get hop.on hop.off bus to make it easier getting between sites"}, {"username": "Enas Mourad", "comment_text": "Very possible and you can do more if you organised the schedule, book the early morning tour for Vatican it’s much better with less crowds the whole visit takes around 3 hours you can be done by 12 then head to colosseum and palatine hill and Roman forum"}, {"username": "Maria LoSurdo", "comment_text": "No way!!"}, {"username": "Patrizia D'Arcangelo", "comment_text": "It's too much"}, {"username": "Udo Stolarczuk", "comment_text": "Tooo ambitious. You want to savor every moment and not rush through."}, {"username": "Pietro Di Sorbo", "comment_text": "If you have only a day to spend in Rome don't book everything.\nJust walk, Rome is an open sky museum."}, {"username": "Barbara Bastianini", "comment_text": "You can do it, but not do it well. It’s better to slow things down so as to enjoy yourself rather than rush around frantically. Or if all you have is one single day pick one or two highlights and just visit those rather than trying to fit too many things into too few hours.\n\nKeep in mind that crowds and heat will impact your stamina snd slow you down.\n\nWhat is the point of your visit to Rome? To see things superficially or to have enriching experiences? To “see” things or to have fun? It’s simply no fun run all day in a mad rush from one thing to another. At least it isn’t for me. It would be a shame to hate your time in this great city!"}, {"username": "Claudio Blizzard Indastria", "comment_text": "Definitely not"}, {"username": "Peter Apostolo", "comment_text": "Not an hour in Venice too?!!"}, {"username": "Phyllis Snyder", "comment_text": "No"}, {"username": "Simone Pfenninger", "comment_text": "1 Day; Do Vatican Tour incl. Vatican Museum, Sistine Chapel, St. Peters Dome (take the elevator to the terrasse or walk to the cuppola) Best with an organised Tour early morning - takes about 1/2 day. Then go to Castello d'Angelo and go down to the Colosseum (I took a taxi because I don't like to walk) Have a coffe and book an evening tour."}, {"username": "Kristin Dunwoody", "comment_text": "No way. You couldn’t even stand in lines to get through all those places. We did it in two. Day 1 we did Forum, Palatine Hill and Colosseum. Day two we did Vatican, Sistine Chapel and St Peters Basilica. Skip the line tickets are definitely worth it. Also, we didn’t pay for any tour guides, we listened to Rick Steves free guides for each location on his app while we walked through and they were awesome!"}, {"username": "Tomas Krivanek", "comment_text": "Missing some important rome spots😉 dont rush its hot🥵🤬🤯🇮🇹"}, {"username": "Katrina Koger", "comment_text": "You definitely can! It would just be very exhausting and take a long time. I would do 7:30am prime experience Vatican tickets, then do the other things after. Or, do Vatican closer to when it closes to beat the crowds."}, {"username": "Bonnie Rodgers Henderson", "comment_text": "Not a good idea. Everything is a blur and you don't do just to any sight."}, {"username": "Anthony Martini Jr.", "comment_text": "No chance"}, {"username": "Jaime Cleek", "comment_text": "We’re doing an early Vatican and a 530 colosseum tour in the same day"}, {"username": "Jenn Messina Babore", "comment_text": "If it’s 100° out like last week, no way. Lol. Honestly that is a lot to do. If you only want to see from the outside then it’s possible."}, {"username": "Ashley McConnell Lanphear", "comment_text": "We basically did - we did a 3 hour golf cart tour in the morning and a 3 hour Vatican tour at 5:00"}, {"username": "Kim Walkom - Giddings", "comment_text": "nope"}, {"username": "Marty Harte", "comment_text": "Did Vatican semi private tour through Liv this week. 3 hours Dario took us around and noted the most imp pieces etc. you get spend a day here easy.\n\nNext day Pantheon, Trevi and Spanish steps in AM with a few Piazza’s and other churches to view (all on own). Followed by 5pm 2 hour Colosseum tour (it closes at 7). This day we tracked 28,000+ steps.\n\nWhat you put above is too much. Hope that helps."}, {"username": "Austin Briscoe", "comment_text": "Doable, it would be a long day."}, {"username": "Jamie Bly", "comment_text": "We did exactly that a few weeks ago. Get to Vatican as early as possible."}, {"username": "Kirsten Rea Davis", "comment_text": "Our family took a tour through Brastours in Rome. We did Ancient Rome in the morning and Vatican City in the afternoon with lunch at a restaurant included. It was a great day and I felt like we were able to see more by saving time not having to wait in any lines."}, {"username": "Shelagh Kosinski", "comment_text": "No"}, {"username": "Jeannie Fritter", "comment_text": "We did Vatican/st. Peters/ and Sistine chapel at 9:15am and then had the colosseum/\nPalestine hill and Roman forum at 3 and then professional pictures in front of the colosseum after. It was the longest day for us by far. We also went during the peak season (Monday). We were so sweaty and exhausted after all of it. So much information it was hard to retain it all. We had to compact our days due to limited time in each city and we are young 30’s.\n\nNext time we will not double book. Also bring comfortable shoes, neck fan, water bottles (refillable) and a hat… totally a game changer!"}, {"username": "Michelle Smith", "comment_text": "Very busy everywhere with crowds and queues\nBit ambitious"}, {"username": "Alla Zats", "comment_text": "I think it will be overwhelming."}, {"username": "Helen Osberry Hoggard", "comment_text": "Viator has a “Rome in a Day” tour with all of these. Starts @9:30 til @3:30"}, {"username": "Jessica Foley", "comment_text": "We just spent a whole day at the Vatican garden, museums, and St. Peter's, and still didn't see it all!"}, {"username": "Elena Eckley", "comment_text": "Not possible"}, {"username": "Shena Kennebeck Talbert", "comment_text": "Nope. We did 5 days in Rome. It was worth every minute!"}, {"username": "Catherine Fabrizio", "comment_text": "This depends on your physical activity level. If you are active, and a fast walker in general, I think it’s doable.\n\nMy husband and I visited in November and on our first full day in Rome, it was gorgeous for November. We had previously purchased a couple weeks in advance special early access tickets to The Vatican, which included seeing St Peter’s Basilica, the Sistine Chapel, and the Vatican museum, had dinner in Trastevere, visited Piazza Navona, The Pantheon, Trevi Fountain, Spanish Steps, Piazza del Popolo, the gardens of Villa Borghese, Roman Forum, and the Colosseum (didn’t go inside). I do recommend seeing the Colosseum at night, it’s incredible.\n\nWe walked 14+ miles that day in 16 hours. We were up at 6am and the night didn’t end until 10pm."}, {"username": "Charlie Charnigo", "comment_text": "Possible, yes. Enjoyable probably not,"}, {"username": "Laurice Branham", "comment_text": "We just got back 2 weeks ago...our TA organized the Imperial Tour + Vatican Museums (with lunch) day excursion and we did it (2 adults and 2 teens)! With the heat it was a lot to do. Incredible, but exhausting. Having experienced it, I would recommend splitting the day and having the opportunity to slow down."}, {"username": "Mike Crawford", "comment_text": "Yes!\nOur group of 6 did, it's a long day, late June. Our local guides were wonderful.\nStarted at 9am, did the Coliseum, Forum. Took a lunch break, at 2pm we did all of the Vatican, then had our 1st dinner and a short nap.\nThen did the 7pm golf cart tour, which was nice!. We were taken to areas we didnt think we would get too on that trip. Then the 2nd dinner around 10pm."}, {"username": "D'Anna Sullivan", "comment_text": "Yes. Definitely but exhausting."}, {"username": "Naomi Collado", "comment_text": "Following"}, {"username": "Fetchin Gretchen", "comment_text": "Yes but will be very busy day and you have to plan well. Not sure it will be enjoyable cramming so much in though."}, {"username": "Kelly Aynes Zingaro", "comment_text": "If you did the early morning Vatican tour at 7:30am before they open to the public. Then did a coliseum tour in the afternoon/\nevening, it’s doable! We didn’t do the hill, forum, but those two tours would be doable. We did a tour of the coliseum at 5:30pm and it was great."}, {"username": "Kate Laidlaw", "comment_text": "Too much in one day. We did Colosseum yesterday 9am tour and Vatican tour with breakfast 7:30am today. Wrapped up both at lunchtime with 20k steps done. Would highly recommend morning tours as no queues and much more enjoyable with less crowds"}, {"username": "Vasthi Cheddar", "comment_text": "Only for bragging rights. You'll spend all kinds of money and you won't be able to fully appreciate a single place fully. I suggest select 1 or 2. It is possible to do the colosseum and the roman forum or the Vatican museum and the Basilica in 1 day. and even add a third attraction nearby. But if you just want photo ops and you're app to prebooking so that you have timed entries starting super early it is possible to do most of what you're hoping for. You'll need to allow for a couple of breaks and getting from one tonthe other. Vatican and Colosseum aren't close."}, {"username": "Nicoletta DiFranco Walsh", "comment_text": "Too much. It will be a blur."}, {"username": "Alessandro Paxia", "comment_text": "3days is minimum time you need to visit Rome"}, {"username": "Mary Gregory", "comment_text": "Two days would be doable"}, {"username": "Carmen Zervigon Everett", "comment_text": "No"}, {"username": "Bobbie Lane Hausherr", "comment_text": "No! You should have at the very least 2 or 3."}, {"username": "Renee Rundle Stoneham", "comment_text": "Of course is “possible”. You can do the “Griswald” tour and just take some photos and check the box that you saw them etc..\nBut that would be an incredibly long day and your brain and legs/feet will be very tired!!\nPlus waiting in lines to get in and security etc…\nYou’ll need to factor in meals too! And travel from one part of Rome to the other, those two sights are spread pretty far apart.\nSounds horrid to me.\n\nVatican & St Peters one day. The Vatican museums are huge!!! So it takes time to walk and wander through it. Unless you just plan on sprinting through.\nIt’s incredibly overwhelming as there is just soooo much incredible art etc the ceilings and floors are even incredible.\nThe Basilica can have pretty long lines depending on when you go.\n\nThe Colosseum can be done rather quickly if you’re just going into the main area. 30 minutes.\nHowever Palentine hill, the forum, Circus Circus etc is HUGE! Just going from one side to the other takes a lot of time and a lot of walking etc…there is so much to see!\n\nWe did 1 day for Vatican & 1 for Colosseum & Palentine hill."}, {"username": "Ron O'Brien", "comment_text": "Yes"}, {"username": "Melissa Elliott", "comment_text": "Too much"}, {"username": "Violeta Giorgiana", "comment_text": "i did this and another few more in 2 days... and i wouldn't again...very exhausting. Rome it s gorgeous and i feel i hadn't time to enjoy the charm of the eternal city."}, {"username": "Michelle Lien-Burdick", "comment_text": "I'd split it to two days. That's a lot of ground to cover in one day."}, {"username": "Andrea Ferretti- Kearney", "comment_text": "I think it’s too much to be honest. We did it in 2 separate days. Not to mention it was insanely hot when we did the colosseum and Roman forum. You’re looking at 4 hours total at least if you’re doing both. There is so much to see"}, {"username": "Becky Tigger Parkin", "comment_text": "It depends if you want to see things properly or just tick off a list"}, {"username": "Blenda Johansen-Rodriguez Del Rio", "comment_text": "I did it with the Tour Guy but it was exhausting. I didn’t have much time in Rome, so I’m happy I did it. ￼"}, {"username": "Laura DeCicco", "comment_text": "That doesn’t sound one bit enjoyable. What’s the point of just racing through things?"}, {"username": "Mat Marturano", "comment_text": "no"}, {"username": "Renae Larcus", "comment_text": "No. Unless you want to go non stop all day."}, {"username": "Christine Pelosi", "comment_text": "Very ambitious, you will be very tired at the end of a long day. Need time to take it all in for a greater appreciation. Personally, I allow 2-3 days to savor all that😉"}, {"username": "Bella Z. Veksler", "comment_text": "If it’s just you then probably yes, if with others unlikely as they might slow you down, I did Roman forum in the morning (solo walk through Rome and the ruins, we used our coliseum tix the night before) and then rushed back to our Airbnb for Vatican tix we had as a family for 1:30, that day was my marathon day -32k steps, can be done but a lot of walking!"}, {"username": "Paola Girelli Harding", "comment_text": "No not at all Not possible!🙃😉"}, {"username": "Dennis Jones", "comment_text": "It would be pushing it…not to mention the heat! 🥵"}, {"username": "Linda Pitler", "comment_text": "Too much for one day. How many days will you be in Rome?\nVatican museum, St Peter’s and Sistine Chapel is a day unto itself.\nColosseum, Palatine Hill and the Forum are all within walking distance of each other and those together are a good chunk of a day, depending on what time you start."}]}, {"id": "2201566080242470", "text": "My honest opinion on the Path of Lemons - all 7 of us felt it was overrated. We hiked from Maiori to Minori, took us with a lot of breaks (was a hot one) about 1.5 hrs. The views were beautiful, yes, butआणखी every where in Amalfi coast the views are beautiful. We expected to be hiking under lemon trees/groves for at least majority of the path, but it was really only for like 10 mins there were some lemon trees (see picture). The rest of it were on private property and you would need to sign up for tours for those seems like. We did enjoy the homemade lemon granita and lemonade stops when we were close to Minori. But was pricey, 2 euros for small cup of lemonade and 3 for granita. Everyone we passed also decided to just half of the path, they said view was good but not worth seeing lemons trees.", "link": "facebook.com/groups/1373361046396315/permalink/2201566080242470/", "likes": 0, "comments": []}, {"id": "2201571053575306", "text": "In Sorrento right now. Any recommendation for a good non too touristic restaurant with authentic food? Thx", "link": "facebook.com/groups/1373361046396315/permalink/2201571053575306/", "likes": 1, "comments": [{"username": "Sasha Childs", "comment_text": "The foreigners club was lovely and amazing views x"}, {"username": "Correen Pacht-Ralsky", "comment_text": "Best place to eat is called IL BUCO"}, {"username": "Gem Smith", "comment_text": "Rhys Walker"}, {"username": "Helen Newlinds Ezzy", "comment_text": "Helen Newlinds Ezzy"}, {"username": "Mary-Lynn Shapiro", "comment_text": "Pizza Da Franco!"}, {"username": "Heidi Verstraete", "comment_text": "Terrazza delle sirene"}, {"username": "Pia Jalonen", "comment_text": "La Limonaia!"}]}, {"id": "2201595080239570", "text": "It's so beautiful here", "link": "facebook.com/groups/1373361046396315/permalink/2201595080239570/", "likes": 45, "comments": [{"username": "LB Mitchell", "comment_text": "No place like Venice when the tourists are all gone."}, {"username": "Paola Zirpola", "comment_text": "😔😔 miss Venice"}, {"username": "Lashawn Bennett", "comment_text": "My favorite place!"}, {"username": "Ruth Akutu Maccarthy", "comment_text": "❤️❤️❤️❤️"}]}, {"id": "2201619460237132", "text": "On the train heading to Florence.", "link": "facebook.com/groups/1373361046396315/permalink/2201619460237132/", "likes": 37, "comments": [{"username": "Correen Pacht-Ralsky", "comment_text": "Have a great time!!!"}, {"username": "Patricia Chavez", "comment_text": "Have a great time!!"}, {"username": "Paula Bennett", "comment_text": "Exciting! Enjoy"}]}, {"id": "2201624790236599", "text": "I’m trying to plan train trips from Rome to Florence and Florence to Cinque Terre and am not sure which train station is closest to my hotels. I’ve downloaded most of the recommended apps, and am not seeing where to find this info - any help is appreciated!", "link": "facebook.com/groups/1373361046396315/permalink/2201624790236599/", "likes": 0, "comments": [{"username": "Rhona OConnor", "comment_text": "Try Google maps....."}, {"username": "Chiara Normanno", "comment_text": "Where are you staying?"}, {"username": "Fiona Cameron", "comment_text": "The main station in Rome where you would board the train the Florence is Roma Termini, the train will arrive at Firenze SMN( Florence - Santa Maria Novella) the main station in Florence. Be sure to get off here as the train may not terminate here and you may end up in Milan!!!"}, {"username": "Fiona Cameron", "comment_text": "https://\nmaps.apple.com/\n?address=Rome%2C\n+Italy&auid=101\n231684430477435\n39&ll=41.900829\n%2C12.501976&ls\np=9902&q=Roma+T\nermini&t=m"}]}, {"id": "2201634453568966", "text": "For those of you who have visited Florence, did you use the Firenze Card (museum card)? Pros & Cons??", "link": "facebook.com/groups/1373361046396315/permalink/2201634453568966/", "likes": 0, "comments": [{"username": "Tania Bourgoin", "comment_text": "We have purchased the FirenzeCard for our upcoming trip in September, after deciding what we wanted to see, we thought it was good value. It was easy to call and make reservations for the Uffizi and Accademia. The only downfall is that the Duomo is not included."}, {"username": "Carmine Castiglia Jr", "comment_text": "Have used it in the past, perhaps eight years ago. We thought it was a very good deal - although it used to come with three days of public transit (buses/trams) in addition to the museum entry - the last time I looked, transit pass is no longer included."}]}, {"id": "2201654996900245", "text": "My husband and I are heading to Italy next May. Hoping to spend a few nights on the Amalfi coast in a beautiful hotel 4 or 5 star hotel. Any recommendations?", "link": "facebook.com/groups/1373361046396315/permalink/2201654996900245/", "likes": 0, "comments": []}, {"id": "2201662720232806", "text": "Recommendations on best way to learn the “most useful words/phrases”\nIn Italian. I have looked at DuoLingo,Babble, and one on Kindle.\nHonestly one had phrases like “ can I speak to the manager, there bedbugs in my bed ,etc not things that would endear you with Italians.", "link": "facebook.com/groups/1373361046396315/permalink/2201662720232806/", "likes": 7, "comments": [{"username": "Giovanni Pianigiani", "comment_text": "Nothing beats the old classic: find yourself an Italian girlfriend! 😅\nJokes apart, \"the most useful phrases\"... I guess it depends on the contest, it's hard to get it on a general tool like tho ones you listed.\nIf you just want to learn a few catchphrases to use in shops/ restaurants any decent guide lists them at the end of the book; if you want to learn something more without actually taking a class I'd suggest to learn some basics and then try and navigate your way through Italian newspapers"}, {"username": "Bonnie Loftspring", "comment_text": "Not your answer, but my daughter did get bedbugs from a university hotel in Florence associated w the college. Boy was she bitten up. Yep, learn that phrase. Better yet, bring tiny flashlight & learn how to check. Have a great trip. She adored Venice, was studying Art History"}, {"username": "Fetchin Gretchen", "comment_text": "I like pimsleur the best. Or take a course at the Michaelangelo institute in Florence."}, {"username": "Brian Marcus", "comment_text": "I used translate and it worked fantastico.\nI never had an easier time getting along in a foreign land and translate was the extra bump I felt I needed to not take all the English speaking for granted."}, {"username": "Alessandro Iannelli", "comment_text": "Honestly, I would just google something like \"sentences for tourists in Italy\" or if you want to try directly in italian, \"frasi per turisti in Italia\". You have better chances to find what you are looking for."}, {"username": "Sally Ward", "comment_text": "Coffee break Italian on Spotify"}, {"username": "Bronwyn O", "comment_text": "I use Duolingo for overall language learning, but the initial phrases aren’t very useful. It’s a good basis for how the language works though. For learning sets of useful-for-trav\nel phrases fast, I like Memrise."}, {"username": "Sammii Fletcher", "comment_text": "Highly recommend coffee break Italian"}, {"username": "Gina Rovello Keenan", "comment_text": "Gina Rovello Keenan"}, {"username": "Ted Chaffin", "comment_text": "Thanks for the info.\nThe “translate” mentioned , is that the app available on iPhone or a stand alone device like\nEnence"}, {"username": "Matthew Hills", "comment_text": "Italy made easy on youtube"}, {"username": "Bea Kuckens", "comment_text": "I am currently working through the lessons on Babbel and I think it’s very well done. There is even a unit for travel vocabulary and phrases. My problem is some things are similar to Spanish which I learned as a child, yet some very different and I get confused. The biggest problem though is my 66 year-old brain saying “memory full”. My reading comprehension is pretty good but once I step away from the computer it’s like it never even happened 😞I have a translator app on my phone that I use during travel."}, {"username": "Angela Lamorgese-Mcdonald", "comment_text": "I’ve been using Rosetta Stone… plan to use google translate as back up"}, {"username": "Sheila Anthony", "comment_text": "Coffee break Italian free podcast"}, {"username": "Julie Thorpe Schlueter", "comment_text": "Go to Rick Steves website. In the search bar type in learn italian. Scroll down until it says beginning Italian for travelers. Click on that and watch the video. Everything you need to start conversing."}, {"username": "Kirsten Rea Davis", "comment_text": "Learn Italian with Joy of Languages was a helpful podcast."}, {"username": "Sandra Yee", "comment_text": "I got tired of the apps/programs. I finally just made my own list of phrases and put them into Google translate. Then listened to the Google translate for pronunciation."}, {"username": "Eileen Muro", "comment_text": "We used Google Translate when needed. We didn't have too much of a problem communicating"}, {"username": "Carrie Lamm Bishop", "comment_text": "I’ve been using Duolingo and Mango. They take completely different approaches, making it more interesting. Both are in the AppStore, and Mango is free to me because it’s offered through my local library via Libby.\n\nAlso, Rick Steves’ Italy book has a page of useful travel phrases."}, {"username": "Etschi Bruckner", "comment_text": "along with a few common words like grazie, per favore etc , items on a menu are most important! It doesn´t help much when you utter a whole sentence and you don´t understand the reply in Italian..."}, {"username": "Michela Zanni", "comment_text": "At hotel reception staff speak english. In tourist places waiters and people working with tourists speak english"}, {"username": "Kristen Vorbeck Cochrane", "comment_text": "I used YouTube."}, {"username": "Colleen Jennings", "comment_text": "Pinterest. Look up something like useful Italian phrases, create a board and save all you think will be useful."}, {"username": "Tony Mcgivern", "comment_text": "This app seems quite good and gives options on topics"}, {"username": "Carrie Jaquess", "comment_text": "Check your local school district Adult school or contributing adult education for beginning Italian it Italian for travelers. Our beginning Italian class was 8 weeks long and it focused on beginning Italian and phrases travelers would need. We also learned a lot about Italian customs; how to order, not to tip servers, what the coperto is, how to find good non tourist residents, etc."}]}, {"id": "2201666090232469", "text": "I would love some tips and advice about a short morning trip from Sorrente to Positano. All we have are a few hours (3-4). Would you recommend we take a taxi? And if so what would the aproximate cost be? Do you have any other suggestions for us so that we may visit the amalfi coast? Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2201666090232469/", "likes": 0, "comments": [{"username": "Jo Mason", "comment_text": "Just batch the local\nBus"}, {"username": "Kay Rendall", "comment_text": "The local bus is cheaper, is busy, u need to get to bus stop at least 30 plus mins before to even get on\nReturn by bus, if the bus is full coming out Amalfi they won't stop.\nPerhaps check the ferries timetables both ways\nOr bus or ferry there, taxi, transfer back if u r on a time limit. If so book in advance Approx 150 ero this year. Enjoy the whole area Magic"}, {"username": "Luisa Palacios Shue", "comment_text": "Taxis cost about $120-150 depending on time. Bus from Sorrento to Positano run every 30 min and cost about $2.50. Tends to get full this time of year so be prepared to stand for 40 min, especially going back to Sorrento as it usually starts pickup from Amalfi. If you’re limited for time you might consider a private driver or taxi, at least for return. The bus will not stop for pick up if full."}]}, {"id": "2201666646899080", "text": "I’m seeing lots of posts about not being able to find cold beverages and asking for ice for beverages. Is it just that Italians don’t typically use ice in drinks? Please no insults or degrading comments, this is simply a question, requesting information.", "link": "facebook.com/groups/1373361046396315/permalink/2201666646899080/", "likes": 28, "comments": [{"username": "Donette Earl Fox", "comment_text": "Just drink lemoncello spritz! Lots of ice!"}, {"username": "Linda Yahn", "comment_text": "I went last year to Italy with my daughter and her very Italian husband. Every restaurant we went to I asked for ice. I learned even how to ask for it in Italian. By the time we left, my son in laws family were not only using my ice but asking for more! It was fun to watch the kids LOVE it in their drink. It was so hot and I didn’t feel asking for ice would make me appear to be a Martian. The water was always chilled I just like ice in mine! BTW it is great ice!"}, {"username": "Alyson Alai", "comment_text": "The first time my husband took me to Italy to meet his friends and family we were in restaurants every night with them. In several of these places when I asked for a Coke they brought it to me with a glass of ice without asking. Simply because of my American accent. They were very pleased with themselves that they knew I would want that. Lol"}, {"username": "JeriLynne Clifford", "comment_text": "I believe the reason Europe doesn’t drink ice in their water is drinking room temp water helps with digestion.\nWe usually got bubble water and for us that is easier to drink tepid.\nWhen in Rome….or Florence …or 😊"}, {"username": "Gabriella Villasenor", "comment_text": "I had no problem asking for ice - every place I went to had ice ! I love my beverages cold 👍 and you can ask them most places in Italy the waiters has no attitude - Paris I got a lot of eye rolls lol"}, {"username": "Dunia Aldyni", "comment_text": "😂😂that’s why they don’t bring ice always I asked for ice in Italy 😂😂 in the apartment I frozen bottle of water and I take it with me in the morning 😍😍"}, {"username": "Lois Midkiff", "comment_text": "Carey Spencer Mooney Lori Potter Farmer"}, {"username": "Debbie Keller", "comment_text": "I do not know Italian and will be in Rome 4 days pre-cruise. I drink a lot of water. What are the choices and how do I order each one? Cold, with ice."}, {"username": "Lee Rew", "comment_text": "Italians grow up hearing that ice in your beverage is bad for digestion."}, {"username": "Trish Dockery Seiber", "comment_text": "This is me when I finally got some ice on our last night of our tour. They brought me a whole bucket. 😂"}, {"username": "Renee Rundle Stoneham", "comment_text": "Not just Italy but Europe in general Ice is not a thing.\nWater bottles are served chilled.\nSodas are chilled, if you want ice you need to ask for ice in your drink.\nBut unlike the US they won’t fill the glass with ice etc which is better. I hate when US restaurants fill the glass full of ice then add the drink, 2 sips later your drink is finished!"}, {"username": "Anthony De", "comment_text": "Anthony De"}, {"username": "Jackie Ames", "comment_text": "Lol, I got the most ice in a drink when I ordered a Spritz. You purchase bottled water at restaurants which comes cold but no ice. Sometimes I’d ask but they bring you only a few cubes."}, {"username": "Lynn Crane", "comment_text": "Hmn. Although ice wasn't in the drinks, they were always cold from the fridge. We never felt that we were served warm water! One place in a more touristy spot brought ice separately in a small cup, but we didn't ask for it. It was all good either way."}, {"username": "Chris Levay", "comment_text": "Not just Italy. No ice in Slovakia!"}, {"username": "Tony Palombino", "comment_text": "Most restaurants I went to when I asked for ice on the￼ side they always obliged."}, {"username": "Georgeann Farinacci Greene", "comment_text": "My old Italian teacher (she’s from Italy)used to joke “They lost the recipe “-lol!! I went to visit family a few years ago & just asked the waiter for a full glass of ice (otherwise you’ll get a cube or 2) not a problem."}, {"username": "Wendy Zucker", "comment_text": "We were at a buffet in Las Vegas where the servers were setting up tables for a large tour group from Europe. None of the glasses had ice. We asked the servers and they told us that only Americans put ice in their drinks."}, {"username": "Wendy Zucker", "comment_text": "For all of you now wondering:\n\nhttps://\nhealth.cleveland\nclinic.org/\ncold-water-vs-wa\nrm-water/"}, {"username": "Shanna LaDelfa", "comment_text": "We never had ice but all of our drinks were cold. The water was cold, etc."}, {"username": "Susan Lowry Lamb", "comment_text": "My thoughts go back to 88. It was our first trip to Europe, and we were in Munich. I can still see my husband’s face when he ordered a coke, and the guy reached behind him and grabbed a coke bottle off of a shelf. Munich was in the throws of a heat wave. These differences are what make traveling to Europe, and other countries, such a fun and special experience. They bring a lot of laughter and special moments. Like in Cesky Krumlov, when my mostly vegetarian sister chose the grilled cheese, and out comes chunks of cheese that had been put on the grill. That was a real giggle. You will find the occasional place that serves your drink just the way you want it, or you won’t. The best part is that you won’t care as much as you might think. Because you have chosen to leave your comfort zone and experience another country. It’s like immersing yourself into some dreamy novel, where those long descriptions you’ve read suddenly make sense, because it’s all so fascinating. Next we’ll talk about the average European bed."}, {"username": "Gina Scavetta", "comment_text": "All my beverages came cold and with ice without asking"}, {"username": "Marty Harte", "comment_text": "Here now, kids order drinks they come cold and sometimes in chilled glasses. At Positano and Amalfi they brought ice in cups without asking at a\nFew places. I took the ice and put it in our water bottles. They don’t need it. Drinks are that cold."}, {"username": "Cynthia Marie", "comment_text": "It’s very difficult to find ice cubes in all of Europe."}, {"username": "Katja Girinovitch", "comment_text": "Because European people like to feel the flavour in all we consume - food (not fully covered with sauce) and the drink (not dissolved with melted ice)"}, {"username": "Susan Marten", "comment_text": "I like icy cold drinks too and I had no problem with the water, flat, or Frizzante. The only thing I did not have was iced coffee because I preferred to have espresso. I drink iced coffee regularly at home but it’s really not a thing in Italy."}, {"username": "Susan Marten", "comment_text": "Actually, our hotel in Milan, and no problem giving me ice."}, {"username": "Anthony Martini Jr.", "comment_text": "No. They fear pneumonia from cold drinks.\nSame shit in Greece and other European countries"}, {"username": "Roland Trego", "comment_text": "When you go in a small market, there are cold drinks (though maybe not as cold as in the U.S.). Ice doesn’t come automatically. Some places may not have it."}, {"username": "Terina Kwiatkowski", "comment_text": "Just order ice they will be happy to accommodate!"}, {"username": "Kimberly Moser Horincewich", "comment_text": "I always asked for ice, and they always gave it to me. Not a big deal."}, {"username": "Rachel Cox", "comment_text": "We never had an issue with cold beverages. You don't typically get ice, but if you ask for water or a soda, it's usually cold from the fridge."}, {"username": "Delia Miscella Wroblewski", "comment_text": "I have had ice no matter where I go-in the smallest bar or the biggest restaurant."}, {"username": "Joe Guzzi", "comment_text": "Europe in general, not just Italy."}, {"username": "Alessandro Iannelli", "comment_text": "I have never asked for ice in a drink but so far, every time it was hot, they put ice in it without me even asking, which I was fine with because sometimes it's so hot that of course you want the ice. However, it sounds like one of those things that varies according to the region of the country. You just ask for it anyway if you want it, there's no reason why they wouldn't accommodate your request."}, {"username": "Pamela Cari", "comment_text": "In Australia our iced coffee is made with cold milk , coffee , ice and topped with cream , very nice .In Rome I asked for an iced coffee, which was on the menu, and got a black coffee with ice cubes , not nice, but in Florence I asked for a hot chocolate and got a cup full of just that , hot chocolate , it was so so good ."}, {"username": "Sally Warren", "comment_text": "Ice seems to be an American obsession. Water is readily available and served chilled in bottles. Ice not necessary.\nCocktails are served chilled, so is beer and white wine.\nOn the rocks is still on the rocks."}, {"username": "Todd N Nicole Clarke", "comment_text": "We had no problem, every time we ordered a soft drink we were asked if we wanted ice, and a full glass of ice"}, {"username": "April May", "comment_text": "Every beverage I ordered expecting to be cold was cold. No issues."}, {"username": "Rhona OConnor", "comment_text": "In Europe we don't drink our drinks as cold as in the US. We never fill a glass with ice then pour in a drink. Just use a couple of cubes. More ice is always available if you want it."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "We keep beverages in the fridge, so that they are cold without the need to water them down with the ice in it (like, you would never put ice in a beer, for us it’s all like this)\nIn bars if you want ice just ask and normally they’ll bring it, in restaurants it can be more difficult as they may not have it, but if you ask cold beverages they will definitely have it."}, {"username": "Anna Gambino", "comment_text": "Any time I have ordered water whether sparkling or still in Italy, it has been cold. Typically don’t ask for ice because I don’t prefer it."}, {"username": "Kristen Rozansky", "comment_text": "I’m in Italy now, in the Piedmont region. Every restaurant either brings water to the table in a carafe or it can be ordered. The carafe is usually room temp. If ordered, it is almost always chilled. But not ice unless you request. I’ve found it more difficult to find bottled water “on the go”. I ended up buying a six pack of bottled water at a grocery store to make sure I always had a bottle when walking around in this heat. If you have a reusable water bottle, there are often places on the street where you can get water for free from a tap or pay a small fee."}, {"username": "Paul Anderson", "comment_text": "You need to ask for ice. It is not uncommon for the server to ask room temp or cold for drinks"}, {"username": "Romy Coops", "comment_text": "Having just been in the US and previously in Italy- I can say Americans love their ice. I live in Australia and even for us - Americans seem to like a LOT of ice. POV."}, {"username": "Catalina Daniel", "comment_text": "I was perplexed seeing others commenting on this too. In italy now (road trip day). However, Ive gotten ice in my drinks, without having to ask. Even when not given I’ve, the drinks are still cold. Its not that hard to find."}, {"username": "Gilda Capraro", "comment_text": "No insults from me just \"on the ground observation and experience\" ... I've been traveling through Italy for 7 weeks, and never once, not once had to ask for ice in drinks. When I order bottled water, I specify I'd like a gkass of ice, with it. Cold drinks served with ice everywhere. Shops have refrigerated drinks. Possibly a few degrees \"warmer\" than in America. But that whole narrative always feels very off-base.\n\nI was at an outdoor family party the other night, and cousin showed up with 3 large bags of ice to keep wine, water, beer and soft drinks cold. Just like at home in Canada. So, ice indeed exists in Italy🤷‍♀️"}, {"username": "Bethany Rudy", "comment_text": "I have no idea if this is true but I was told by one of our Italian guides that Italians are superstitious about ice and air conditioning. Because they think going from the hot air to a cold place or beverage will make your throat hurt or make you sick"}, {"username": "Sonia Scotto Lubrano", "comment_text": "Its a European thing in general. If they sell cocktails they should have ice."}, {"username": "Grace Scinto", "comment_text": "In general Italians believe that drinks that are too cold are not good for your health! Refrigerated drinks are the farthest they will go."}, {"username": "Larry M Murray", "comment_text": "Never had a problem Getting ice in the three hotels we stayed"}, {"username": "Rita Sanza", "comment_text": "I've just comeback from Italy Thursday. I was born I Italy. And yes the don't really use ice in the water. But I've had no problems asking for a glass of ice in any restaurant or cafes. Especially with the hot weather at the moment I really needed a cold drink. Enjoy your holiday 🙂"}, {"username": "Sara Williams Dietrich", "comment_text": "My kids just did a tour of Europe including Paris, London, Amsterdam, Lucern, Rome, Venice, and Florence. No ice to be had anywhere. My son struggled just to get cold water at restaurants. Best thing he could do was use a stainless steel refillable bottle and buy cold water at the store. It wasn’t ice cold but colder than anything else he had access too and the stainless steel helped keep its cooler temps."}, {"username": "Lynette Hayler", "comment_text": "In the USA the portions are huge and in some cases “bottomless” so when there I don’t mind the large amounts of ice in a drink, as there is still plenty of the beverage itself. But in other parts of the world with smaller portions and no free refills it would be very annoying to have a cup full of ice as you would get hardly anything to drink. In Australia I always specify “little ice” or “no ice”."}, {"username": "Paula Stewart", "comment_text": "We regularly had lemon granita/slush. It was extremely refreshing and cooling"}, {"username": "Claudio Blizzard Indastria", "comment_text": "They are cooled by default. If you need the extra brain freeze experience ask for ice, some have it, others don't."}, {"username": "Vivien Paulik", "comment_text": "We here in Europe do not have an ice mania. We like to taste the drinks. You can ask for cold drink from the fridge, so no ice needed. Or you just can ask"}, {"username": "Sherill Hacker", "comment_text": "We stayed in airbnb's so I brought my own ice cube trays. Never went anywhere without my big hydroflask bottle filled with cold water 💧. (Even to dinner)"}, {"username": "Romina Lauretig Toscano", "comment_text": "Please note that it is not healthy to add ice to cold water 😊"}, {"username": "Chris Vilsack", "comment_text": "I'm insulted that I can't leave a degrading comment. Haha.. This group needs some spring-cleaning\n, obviously.. Given that you had to add that. Ice in the USA is in everything cold. It also dilutes our drink, giving us less. But I digress. Cold drinks come cold, sometimes with a cube in it in the big tourist areas. You can ask for it, as well. Outside of those areas, it's not common."}, {"username": "Hollie Barcheck Juersivich", "comment_text": "We had to beg for water many times in Italy. During the heat wave I might add. Only drink they add ice to are the drinks w liquor."}, {"username": "Cecilia Christine Costantini", "comment_text": "We (Italian) don't as much as in the USA. At a restaurant you can get bottled water \"fredda\" or \"temperatura ambiente\" (not kept in a fridge). Also, generally speaking, you pay for water, you don't get it for free. Same for soft drinks. My parents (Italians living in Italy) will always apecify \"non fredda\" (not cold) and if they get something with ice they will even remove it. It is cultural. Touristy places will have ice, but you won't see many Italians asking for it. When I lived in the USA as a teenager in the 90s, I think one of the first pictures I took was of me filling a glass of ice from the ice-dispenser in the fridge at my host family's place, for me it was so odd! 😆😆😆"}]}, {"id": "2201677083564703", "text": "Hello Everyone,\n\nIm traveling to Florence from Monday to Wednesday. Wanted to check out the Statue of David but it appears the museum is closed on Monday and that is our only full day to explore Florence. On Tuesday, we are planing to take the train to Pisa and Cinque Terre.\nWas trying to figure out if it’s necessary to buy tickets beforehand or ifआणखी we can just get up super early on Tuesday and stop by the museum before heading to Cinque Terre.\nWe have a 9am train to catch on Wednesday so that day most likely won’t work.\n\nAny insight would be greatly appreciated ! Thank you all so much!", "link": "facebook.com/groups/1373361046396315/permalink/2201677083564703/", "likes": 1, "comments": [{"username": "Alex Kovacs", "comment_text": "Are you just doing a day trip on Tuesday? Is it possible to switch the days so you have Tuesday to explore Florence? I originally was going to have Monday to explore the city as well but I switched it to Sunday since there’s some things closed on Monday! But either way I’d definitely get tickets before hand for david, the line gets really long. However, I don’t think there’s enough time to go to a museum and still do a day trip to cinque terre."}, {"username": "Sara Beth", "comment_text": "Why don’t you go to CT on Monday instead and explore Florence on Tuesday? I don’t think there will be enough time to see it Tuesday am. CT is not that close and you will be on the train for several hrs-better to get an early start!"}]}, {"id": "2201685023563909", "text": "Does anyone have any recommendations for a food tour in Rome?", "link": "facebook.com/groups/1373361046396315/permalink/2201685023563909/", "likes": 0, "comments": [{"username": "Fiona Cameron", "comment_text": "This company runs a few different food tours in Rome, I have done a daytime one and this evening one.\nThere are other companies, have a look on Viatour."}, {"username": "Rose Marie", "comment_text": "We did a golf cart food tour through a company called Eating Europe. It was probably the highlight of our time in Rome. The guide was amazing and the other family on the tour was lovely."}]}, {"id": "2201683353564076", "text": "Hello! May be a silly question but for those that have neck fans with a USB-C cord for charging, do you need a voltage converter to charge it? We are on 120v in Canada vs Italy’s higher voltage. We don’t want to wreck the fans battery\nThanks!", "link": "facebook.com/groups/1373361046396315/permalink/2201683353564076/", "likes": 3, "comments": [{"username": "Warren Stone", "comment_text": "Read the label on the charger. Most modern stuff will operate 100-240VAC, but you should confirm."}, {"username": "Fiona Cameron", "comment_text": "Buy a new fan in Italy otherwise you may fry the fan and the charger."}, {"username": "Marcie Huckaby", "comment_text": "Small things like phones and fans you do not. Things like hairdryers and things you need a dual voltage one"}, {"username": "Vasthi Cheddar", "comment_text": "If USB charging you don't need a converter"}]}, {"id": "2201684283563983", "text": "Posting anonymously so my boyfriend won’t know because it’s a surprise 🤭\nWe will be going to Calabria last week of September and we are going to stay at a hotel, but I am finding it difficult to find some mode of transportation as nothing is shown on google maps.\nDoes anyone know of any taxi companies or cheap car rentals for 2 people?\nAlso, any tips on what to do, where to go, and what to eat? As I want to surprise him with a nice dinner maybe some fine dining or Michelin\n\nThanks a lot!🩷", "link": "facebook.com/groups/1373361046396315/permalink/2201684283563983/", "likes": 2, "comments": [{"username": "Pietro Adami", "comment_text": "If you don’t post the town, it’s difficult to help you"}, {"username": "निनावी सहभागी", "comment_text": "We will be staying in hang loose cottage in gizzeria"}, {"username": "Alessandro Iannelli", "comment_text": "Gizzeria Lido, which is where I think you are staying (not Gizzeria), is served by Trenitalia, so it shouldn't be too hard to get there. I can tell it's Gizzeria Lido because that's where the resort you mentioned is located."}, {"username": "Naritta Nurit Matheus", "comment_text": "Ask the hotel staff fot car rent. Taxi and restaurants. They are very helpful. The did it for us."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2201690980229980", "text": "Word of warning on British Airways. We left yesterday, Toronto to Milan via Heathrow. We purchased our tickets in March and chose World Traveler Plus for the extra leg room as well as the 2/4/2 configuration, which would give us 2 seats together without one of us having to sit in a middle seat. We got at least 3 seat change emails since purchasing and would then go to \"Manage my booking\" and re-select our seats. I went to check in for our flights 24 hours before takeoff and our seats had been changed again. No email this time, and we were re-assigned to a middle seat and aisle seat in the middle of the cabin. We were told the flight was full and there was nothing they could do. And when we asked for a supervisor, we were told there was none available at that time. As you can see above, we paid considerably more for my husband's and my world traveler plus (economy plus) seats than we paid for our ￼two teens world traveler (economy) seats. Needless to say, British Airways handling of the situation was quite disappointing on top of sitting in a middle seat for a 7 hour flight. On the upside, we had wonderful flight attendants on British Airways!", "link": "facebook.com/groups/1373361046396315/permalink/2201690980229980/", "likes": 9, "comments": [{"username": "Dave Conroy", "comment_text": "I posted the other day how dire BA had become. All flights keep it super simple is my advice, because they will mess up anything not entirely in your control."}, {"username": "Jan Armstrong", "comment_text": "This has got to be worthy of a complaint when you are home. You’ve paid a huge amount extra and not got anything for it.disappointin\ng to say the least."}, {"username": "Heather Baumann", "comment_text": "You can email for compensation if you paid for extra seats and didn’t receive."}, {"username": "Cynthia Crowe McSwain", "comment_text": "I’m going to Italy in October and the first leg on my return is FCO to Heathrow on BA. They’ve already changed this one flight three times…..mostly minor timing changes. What is going on with BA? 🤷🏻‍♀️"}, {"username": "Donna Gilardone Szwabowski", "comment_text": "You should be refunded the amount extra you paid"}, {"username": "Karen Keehn-Mclean", "comment_text": "I think all airlines are having similar problems these days. We flew to Nashville and our flight times changed 2x and they seperated my husband and me to a middle seat each after paying for seats together 🤨"}, {"username": "Machel Bigelow Salado", "comment_text": "We had an issue with BA as well. The day before we were supposed to fly out from Seattle to Rome via London, we got an email that our fight had been canceled. No explanation. We spent hours on the phone trying to get a flight out on our original day. Luckily we got one on a different airline. Plus don't get me started on Heathrow."}, {"username": "Deanne Tetrault", "comment_text": "Those are expensive tickets 😱"}, {"username": "Laura DeCicco", "comment_text": "Check air passenger rights Canada Facebook and ask members there was they’d suggest your next step is in recouping your money"}, {"username": "Jeff Mayernik", "comment_text": "We booked flights to Panama for November a couple of weeks ago and have had 3 flight change emails. The second one gave us a negative 29 minute layover in Miami so I was pretty excited but not in a positive way 🤣 They've since fixed it but I am watching seat assignments closely; we paid extra for exit row aisle seats for both of us. If you got moved from plus to standard I think you definitely have a case for compensation"}, {"username": "Anita Grzeszkiewicz", "comment_text": "Most airlines, if not all are experiencing various issues, this sort of thing isn't confined to just BA\nFollow up with consumer rights and BA is your best bet"}, {"username": "Alexis Anderson", "comment_text": "That's TERRIBLE.I would be beyond upset\nMy mother will only fly BA nonstop 1st class to London and continually raves about the service. She recently flew them and she was served high tea in the flight and it looked Divine.😳🫖\nI'm planning on flying Premium Economy ( possibly on BA) to Italy in March so curious about the seats & service in PE."}, {"username": "Susan Lowry Lamb", "comment_text": "I’d complain to the airlines for a refund for the difference on the seats, and if you get no satisfaction I’d complain to the government. I got so pissed off over Delta trying to charge me $50 a ticket over their mistake years ago that I filed a complaint with the DOT. I got a refund from Delta immediately."}, {"username": "Lesley Vullo Pino", "comment_text": "British airways changed my flight several times and it was sooooo stressful . I ended up having a layover in Dallas Tx when I was supposed to fly to Charlotte .. they made me miss my flight to Rome because they said I couldn’t get on the flight since their system said I flew my return flight already. I said how can I fly my return flight when it’s two weeks in the future …?! They ended up putting me on standby for another flight to Rome that was full and by the Grace of God there was a cancellation for me to get on. London Heathrow airport was also terrible with their TSA crap. I had to go through TSA even after I just landed from another flight … had to go to another terminal and they decided to “check a liquid” in one of my bags. I said sir you’re about to make me miss my connection. I didn’t schedule my flights that close together it’s what they gave me after messing me up from the start. They absolutely move slow and don’t care. London airport was crappy on the way back too. The worst flight experience I’ve had going to Italy . The last time I went to Italy everything was so easy. Oh and side note …. They didn’t refund me for my seats I paid for after they changed my flights"}, {"username": "Chrystal Stevens Bisonet", "comment_text": "I’d be so mad! My family of 5 is traveling from chicago to Rome next March on British Air - I hope this doesn’t happen to us!"}, {"username": "Angela Grumpylicous", "comment_text": "They should at least reimburse you the price difference"}, {"username": "Rar Storti", "comment_text": "Susan I’m sure you will follow this up & ask for refund & why? Why when you paid you were allocated those seats ? Sorry this happened to you ."}, {"username": "Noreen Chimenti Agatstein", "comment_text": "They are terrible. Just flew BA to portugal last month. Booked the flight in January. Paid for our seats etc. 3 weeks before our flight they cancelled our return flight told us our new flight was 2 days later and we had to just stay two extra days in Portugal at no cost to them. This was unacceptable as I had to get back to work. Thankfully I booked with a travel agent and she handled it. Took her 3 full working days to get something done, on the phone for 6 hrs everyday on hold, arguing etc. We wound up flying a different airline home, but BA never refunded me for the seats we paid for. I called they said “yea youll be refunded” and was hung up on. A month later with no refund I disputed the charges with my credit card and the credit card company got me my money back. HORRIBLE customer service ill never fly their airline again."}, {"username": "Caroline Hyde", "comment_text": "My daughter and I are flying to Rome in September. We are flying nonstop from Miami as we didn’t want the hassle of connections. We are flying premium economy with ITA as they are the only airline to fly nonstop. I do not like BA as in the past we have had nothing but problems. Keeping fingers crossed that there are no delays or cancellations with ITA."}, {"username": "Scott Heran", "comment_text": "BA is the absolute worst. They cancelled a flight then lost our bags for 5 days on trip from NYC-Heathrow-Na\nples."}]}, {"id": "2201731333559278", "text": "Do I need an adapter to charge my LG Velvet 5G cell phone in Europe?", "link": "facebook.com/groups/1373361046396315/permalink/2201731333559278/", "likes": 1, "comments": [{"username": "Nicola Ramoso", "comment_text": "I don't know, where are you from? I'm pretty sure that every country where English is spoken they use a rather different plug compared to the one used here in Italy so I'd generally say yes you need one.\n\nIf you're referring to the different voltage used on the European and American networks just make sure that your charger has \"Input: AC 100-240V\" written on it, that means that it'll work regardless of the voltage."}, {"username": "Achim Marke", "comment_text": "Where in Europe? 😁"}, {"username": "Jose Velez", "comment_text": "Your usb wall outlet will need an adapter for the plug or something like this that has multiple plus for many devices (phone, watch etc) Universal Travel Adapter, Unidapt International Plug Adapter, 5.6A Smart Power 3.0A 4 USB 1 Type C, Power Adapter Travel Charger, Outlet Converter Worldwide US to Europe EU AU UK USA(Type C/G/A/I) https://a.co/d/\n76WhAJ5"}, {"username": "Bill Shafer", "comment_text": "This is all you need."}, {"username": "Bella Bella", "comment_text": "Im Canadian. Going to Barcelona Nice Sorrento and Palermo."}, {"username": "Bella Bella", "comment_text": "Thank you all!"}]}, {"id": "2201691423563269", "text": "Does anyone know where I can find authentic Murano glass in Rome? I love collecting ornaments of places I have traveled. I can’t get up to the factory because I’m leaving out of Civitavecchia Port for a cruise\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2201691423563269/", "likes": 0, "comments": [{"username": "Jenn Messina Babore", "comment_text": "If you Google it you will a few options. 🤗"}]}, {"id": "2201694843562927", "text": "Can anyone recommend a private airport transfer company for 5 people from Hotel Milan to Milan airport?", "link": "facebook.com/groups/1373361046396315/permalink/2201694843562927/", "likes": 0, "comments": [{"username": "Fiona Cameron", "comment_text": "You could try Suntransfers"}, {"username": "Fiona Cameron", "comment_text": "Fiona Cameron"}]}, {"id": "2201699796895765", "text": "What are your favorite costal towns to visit in summer, specifically beginning of Aug? We’re traveling with four adults and two kids. We’re open to any and all ideas🤍", "link": "facebook.com/groups/1373361046396315/permalink/2201699796895765/", "likes": 0, "comments": [{"username": "Chiara Normanno", "comment_text": "The whole Italy has coast. What do you enjoy? Popular places or quainter and calmer ones? One packed with international tourists or do you wish to go to Italians' favourites?"}, {"username": "Erica Senes Tombesi", "comment_text": "Anonymous participant amalfi coast it's not so popular by italian tourist, tbh, expecislly in the summer.. no beachs, crowd everywhere and crazy price..\nIf are looking for amazing food, history, art, and wonderful sea the whole Sicilia is the place to go.."}, {"username": "Correen Pacht-Ralsky", "comment_text": "Positano"}, {"username": "Tania Bourgoin", "comment_text": "Give a listen to the latest UnTold Italy podcast. Lots of recommendations\nof where to visit in the summer months"}]}, {"id": "2201699276895817", "text": "Something to consider if traveling to Italy next summer- if you’re layover is in Paris- the summer Olympic Games will be held there july to mid August.", "link": "facebook.com/groups/1373361046396315/permalink/2201699276895817/", "likes": 1, "comments": [{"username": "Rhona OConnor", "comment_text": "And it is manic there this year!!! Best to avoid it till the Olympics are over."}]}, {"id": "2201700430229035", "text": "Hi there,\nDoes anyone have any recommendations for caterers/ personal chefs that come to your villa in the Piedmont Asti/Alba area? We are 8 in a villa in September and would like a ersonal chef for my 60 th bday . Thanks guys.", "link": "facebook.com/groups/1373361046396315/permalink/2201700430229035/", "likes": 0, "comments": []}, {"id": "2201709553561456", "text": "Arriving in FCO Monday morning about 7am. Is there a lounge that I can goto before departing the airport to freshen up? We will be flying in on United Polaris class, not sure if that grants us access to any particular lounge. Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2201709553561456/", "likes": 2, "comments": [{"username": "Fiona Cameron", "comment_text": "Go to the airport website, there may be a public facility where you could get a shower etc for a small fee. Many international airports have these now."}, {"username": "Verna Frasca", "comment_text": "Flying United Polaris class should allow you to access the United club in Rome. You may want to check with United and also where the club(s) are located at the airport - in the secure zone, or can you access it after you go through immigration. You will need to show a boarding pass to get into the club."}, {"username": "Catherine Quinn Mergen", "comment_text": "We found a place on our way to the rental car place at FCO that offered a shower room for 20 euros. So worth it! Clean shower, toilet and sink, easily able to shower, change, brush teeth etc and then move on to enjoy our day. This was 2019."}]}, {"id": "2201711436894601", "text": "Does the ParCo membership grant you access to the Pantheon?", "link": "facebook.com/groups/1373361046396315/permalink/2201711436894601/", "likes": 0, "comments": [{"username": "Jaime Cleek", "comment_text": "No I don’t think so"}]}, {"id": "2201712893561122", "text": "Looking for a wine tour recommendation not far from the Port of Livorno please :)", "link": "facebook.com/groups/1373361046396315/permalink/2201712893561122/", "likes": 0, "comments": []}, {"id": "2201712963561115", "text": "Seeking advice: want to go from Rome to Matera. Should we go by train from Rome to Salerno and then bus to Matera OR by train from Rome to Bari and then bus to Matera? Other suggested routes? We don't want to fly or rent car. Thanks in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2201712963561115/", "likes": 0, "comments": [{"username": "Chiara Normanno", "comment_text": "Pick whichever is faster allowing for time between connections in case of delays"}, {"username": "निनावी सहभागी", "comment_text": "I was hoping someone who has done this would have some sage advice. I have been trying to figure out best route but it is not that simple. 😕"}, {"username": "Brenno Bianchi", "comment_text": "The simplest way is Rome to Salerno with Frecciarossa train and Salerno to Matera with Freccialink bus. You can buy as an unique ticket from Trenitalia, there is also a 40% discount on the bus this way."}]}, {"id": "2201717703560641", "text": "We arrive in Rome @ 8 am, thinking of going straight to train station and head to Venezia... is that a good idea?", "link": "facebook.com/groups/1373361046396315/permalink/2201717703560641/", "likes": 0, "comments": [{"username": "Chiara Normanno", "comment_text": "I advise you to book a train in advance if that's your plan"}, {"username": "Suzana Ferreira", "comment_text": "That depends on your schedule"}, {"username": "Annette Terrazas", "comment_text": "Why skip Rome?"}, {"username": "Ben Parlopiano", "comment_text": "If you book in advance, check to see if there is a planned rail strike for that day."}, {"username": "Jenn Messina Babore", "comment_text": "Depends on your travel plans. Train from airport to Venice with be ~4.5 hours. You will need to change trains at Rome Termini as the airport train is different than the high speed train from Rome to Venice."}, {"username": "Gena Diaco Penland", "comment_text": "We flew into Rome and out of Venice. If you can just fly into Venice, it would save you a whole day of travel!"}, {"username": "Eric Parks", "comment_text": "If you're already at the airport, I'd look at getting a connecting flight to Venice. I like the trains but this could cut down some time in transit."}, {"username": "John Rodriguez", "comment_text": "Do what makes your heart happy! Enjoy your trip!"}]}, {"id": "2201720806893664", "text": "Help: coming from Rome for the day…Anyone know of a tour guide that can take me on a private tour of Florence?", "link": "facebook.com/groups/1373361046396315/permalink/2201720806893664/", "likes": 0, "comments": []}, {"id": "2201722423560169", "text": "Have any of you rented a car and driven from Rome to Florence? We are exploring this option and would like to see Assisi and Orvietto. How crazy is it to drive and rent a car?\n\nThanks!", "link": "facebook.com/groups/1373361046396315/permalink/2201722423560169/", "likes": 0, "comments": [{"username": "Ken Lerch", "comment_text": "Everyone is going to tell you that driving in Italy is nuts. It’s not but it is different. Italian drivers are trained drivers; they are actually better at handling a car and do drive more aggressively. There are different protocols that you need to know. You need to learn to read signs. And you can do that entire route quickly on the autostrada or more scenic taking local routes. Great way to see Assisi."}, {"username": "Pietro Adami", "comment_text": "You may be surprised in reading this but … Italy is a civilized Country, we don’t “hit & run” visitors, we do try to help them if in need. We have roads and mantain them properly (well … sort of, in some areas), and our “autostrade” are an axcellent fast track to most cities as long as you do not drive on “black label” weekends (that is, any weekend from today to the end of August)."}, {"username": "Felicia LoCascio Whitney", "comment_text": "We drove from Rome to Amalfi. Amalfi a bit nerve-wracking for sure. A1 has incredible gas stations with Italian wine, cheese. Meats and sandwiches. The roads Umbria/Tuscany are easy but a bit winding. Absolutely breathtaking vista's at every turn. We're driving to hot springs then to Orvieto. Leaving early and planning on a whole day in these areas."}, {"username": "Shelley Phillips", "comment_text": "The train is so easy and fast. Why drive?"}]}, {"id": "2201729360226142", "text": "Hi everyone, I am planning to visit Milano in Sept of this year with my colleagues and around 80 pupils (16-17 year old)\n- We have arranged museum visits but we would love to visit an affordable dance or music show on Tuesday Sep 26 or Wed Sep 27. Do you have any suggestions for me?\n- it seems we can only buy public transport tickets on site and not in advance online. Is that true or is there a way to book public transport tickets in advance since it is such a large group?\nThank you for your help!", "link": "facebook.com/groups/1373361046396315/permalink/2201729360226142/", "likes": 1, "comments": [{"username": "Carmine Castiglia Jr", "comment_text": "Neither city buses nor subway cars hold 80 passengers per; have you thought about how you are going to make this work without losing track of some of your students?\n\nI'm curious - why Milan? Unless they are studying fashion, I would think there are other Italian cities that would be far more interesting."}]}, {"id": "2202187650180313", "text": "I have just tried to buy skip the line tickets from the official website for the Colosseum on Oct 1st but it seems you can’t buy them yet. Does anyone know when they release tickets on the ￼coopculture.it site? I’d like to buy the Full experience ticket. Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2202187650180313/", "likes": 1, "comments": [{"username": "Jenn Messina Babore", "comment_text": "30 days ahead starting at 9am local time and every 10-15 minutes thereafter"}]}, {"id": "2201733666892378", "text": "We are arriving to Rome at the end of a cruise from Barcelona next summer. We plan to stay three nights before taking a train to the Amalfi Coast. I am going to want to do some laundry. I know I can find an Airbnb with a washer and hang dry, but are there any nice hotels with good laundry service and good AC? Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2201733666892378/", "likes": 0, "comments": [{"username": "Rhona OConnor", "comment_text": "Yes lots of them. Most hotels offer laundry services just like the US."}, {"username": "Laura DeCicco", "comment_text": "You won’t be taking a train to the Amalfi Coast, make sure you research this ahead of time"}, {"username": "Helen Ladkin", "comment_text": "Hotel laundry service is very expensive. We found laundry mats In Italy. Google lavanderia near your hotel."}, {"username": "Laura Uribe", "comment_text": "Much more reasonable to find a full service or self service laundry. Twenty years ago we paid €30 for a small load at our hotel. Now we just Google laundry and drop it off or spend a little time doing it ourselves."}]}, {"id": "2201737236892021", "text": "What is best suggestion to keep your expensive jewelry in hotel room in locker or at front reception as I need that for a special occasion thanks", "link": "facebook.com/groups/1373361046396315/permalink/2201737236892021/", "likes": 0, "comments": [{"username": "Shelley Phillips", "comment_text": "Keep it at home. I don’t Take any expensive jewelry with me."}]}, {"id": "2201737423558669", "text": "recommendations\nfor good clubs in Napoli? 🙏🎉", "link": "facebook.com/groups/1373361046396315/permalink/2201737423558669/", "likes": 0, "comments": []}, {"id": "2201741396891605", "text": "What are some good souvenirs that we should and are allowed to bring back to the US? Thank you for your suggestions! 😊", "link": "facebook.com/groups/1373361046396315/permalink/2201741396891605/", "likes": 20, "comments": [{"username": "Bonnie Loftspring", "comment_text": "Stretchy Murano bead bracelets, you can get anywhere Wish I had bought more. NOT $$\nMake great gifts Will be a wonderful reminder of your trip & travel easily"}, {"username": "Sally Warren", "comment_text": "Shoes, fashion, bags."}, {"username": "Ken Lerch", "comment_text": "Original art from street artists. Art books, music."}, {"username": "Carolyn Esposito", "comment_text": "I like to find the postcards that look hand painted."}, {"username": "Sam Haddock", "comment_text": "I buy magnets from each town I visit"}, {"username": "Jim-Holly Ballew", "comment_text": "Christmas ornaments"}, {"username": "Rhonda Russell", "comment_text": "Book marks are small and inexpensive"}, {"username": "Jessica Stewart", "comment_text": "Tea towels, ornaments, oil vinegar and pastas"}, {"username": "Charlene Noll", "comment_text": "depends upon where in Italy your are going."}, {"username": "Larry M Murray", "comment_text": "My wife brought back lemon scented candles, lemon scented soap and scarfs. Me I shipped several cases of wine."}, {"username": "JeriLynne Clifford", "comment_text": "I loved the wine pourer my friend bought me. We brought small bottles of balsamic to give to friends"}, {"username": "John Layman", "comment_text": "Cheese"}, {"username": "Anthony Martini Jr.", "comment_text": "Cheese wheels!\nEvery recipient will love you"}, {"username": "Ann Lombardi-Perkins", "comment_text": "I brought scarves for my girlfriends"}, {"username": "Anita Grzeszkiewicz", "comment_text": "A venetian carnival mask"}, {"username": "Karen DiRienzo", "comment_text": "Aprons"}, {"username": "Carole Tarlap", "comment_text": "Depends on WHO you are buying for 🤷🤷"}, {"username": "Debbie Zornes Ruch", "comment_text": "Pictures and Memories."}, {"username": "Lisa Valdovinos", "comment_text": "Nino and Friends Chocolate in Florence. So delicious!"}, {"username": "Cindy Capozzi", "comment_text": "May sound odd, but I bought Pinocchio ornaments in Florence. Love them. And little ceramic dishes with wine corks or oil pouring spouts in San Geminano."}, {"username": "Anna Conroy", "comment_text": "Zafferano in powder is impossible to find in USA"}, {"username": "Lauren Davis", "comment_text": "I always look for Christmas ornaments. It’s special to be able to remember the trip each year, without adding to daily clutter."}, {"username": "Sandy Avayou", "comment_text": "Silk scarves from Lake Como, cashmere scarves"}, {"username": "Phyllis Snyder", "comment_text": "For your self or for others?"}, {"username": "Donna Mangone", "comment_text": "Olive oil and balsamic vinegar 😋"}, {"username": "Paula Stewart", "comment_text": "Ceramics, food and drink, handbags etc x"}, {"username": "Jules Blumke", "comment_text": "I collect refridgerator magnets."}, {"username": "Diane Leesmith", "comment_text": "Probably obvious ones you’ve already thought of but Glass pendant or ornament from Burano, lace from Murano, masks from Venice…"}, {"username": "Suzanne Mills", "comment_text": "10 pounds of weight"}, {"username": "Manuela Teves", "comment_text": "I want to buy dresses and shoes in Italy"}, {"username": "Hollie Barcheck Juersivich", "comment_text": "If you’re Catholic there is a shop in the Vatican City that will bless your purchase by a priest. I bought 3 St. Christopher medals."}, {"username": "Ken Lerch", "comment_text": "Food: olive oil, vinegars, soup mixes, caponata, pasta, etc."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2201748193557592", "text": "Hello. I'm in Salerno for 3 days and looking for food recommendations and things to do/see... have already visited Sorrento, Amalfi coast and Naples etc.", "link": "facebook.com/groups/1373361046396315/permalink/2201748193557592/", "likes": 0, "comments": [{"username": "Chiara Normanno", "comment_text": "Have you been to Paestum Temples? It's a must visit."}]}, {"id": "2201754726890272", "text": "Just wanted to give a shout out to this excellent Artigiano and our experience today. If anyone is planning a visit to Murano, I would recommend this experience. We were able to make our own bracelet & necklaceआणखी but you can also choose to make earrings or a magnet with genuine Murano glass and he has things for sale. We had the best time and something to take home to remember your visit that is extra special made by yourself.", "link": "facebook.com/groups/1373361046396315/permalink/2201754726890272/", "likes": 22, "comments": [{"username": "Karen Blackmore", "comment_text": "I'm definitely doing this when next in Venice!"}, {"username": "Domnica Daniela Neculau", "comment_text": "I think I saw someone else promoting this place!🥰\nSaved!"}, {"username": "Orsolya Garai Szabo", "comment_text": "Do you have to make an appointment with them or just drop in?"}, {"username": "Eileen Steiniger", "comment_text": "We did it too! You will get an email confirmation if you make a reservation/\nbooking. Caesar was fantastic!"}, {"username": "Bernadette Sarmiento", "comment_text": "Thank you I will definitely do this - do I have to call or email ahead and make reservations or just walk in?"}, {"username": "Denise Mantie", "comment_text": "How much to do this?"}, {"username": "Tracie Goebel", "comment_text": "Janet Psaris Tom Psaris"}, {"username": "Nina Sutcliffe", "comment_text": "Kristy Price"}, {"username": "Tracy Foss", "comment_text": "Thank you for sharing!"}]}, {"id": "2201761403556271", "text": "Can you pay for Milan underground using contactless?\nIf so do you also have to tap out when getting off like London?", "link": "facebook.com/groups/1373361046396315/permalink/2201761403556271/", "likes": 0, "comments": [{"username": "Chiara Normanno", "comment_text": "Yes that's the only way I do it. You tap in and out, look for turntiles that have the little POS on top and a green light."}]}, {"id": "2201765540222524", "text": "Hi everyone! This may have been answered/asked in the past but I have an early flight out of Naples on a Saturday morning (6a), so we will have to arrive to the airport very early. Is there a car service anyone recommends and or do you think I would be able to get a taxi at 3a lol? We are staying near the train station so it’s only a 3.5 mile ride. Open to all suggestions.", "link": "facebook.com/groups/1373361046396315/permalink/2201765540222524/", "likes": 0, "comments": [{"username": "Chiara Normanno", "comment_text": "Have you tried looking here? https://\nwww.taxinapoli.i\nt/tariffe/"}, {"username": "Meredith Williams", "comment_text": "just remember the nap airport doesnt open till 4!"}, {"username": "Carmine Castiglia Jr", "comment_text": "Most of the time, the best solution is to simply ask your hotel's front desk staff. You can be sure that they deal with this question pretty much every single day."}, {"username": "Ann Law", "comment_text": "You could consider staying at one of the hotels in towns nearer to the airport on the mainland. Some are 5 minutes from the airport."}]}, {"id": "2201816666884078", "text": "Need input from the experts! I was in Italy this summer and fell in love with the Amalfi Coast. We were on a cruise so we only had a short time in Ravello, Amalfi and Sorrento. Planning a trip back to Italy next summer and want suggestions on where we should stay for our base on the Amalfi Coast for 3 nights? Thanks in advance:)", "link": "facebook.com/groups/1373361046396315/permalink/2201816666884078/", "likes": 14, "comments": [{"username": "Dee Scandone", "comment_text": "Sorrento"}, {"username": "Cettina Milioto", "comment_text": "100% sorrento. Loved it how it was alive and how it was so fun. Positano was nice but I am so so glad we stayed in sorrento.\n\nIf I have to go back I would make sure to catch a concert in Ravello. That is on my bucket list for sure"}, {"username": "Glenn Todd Webb", "comment_text": "Ravello or Amalfi"}, {"username": "Kath Milburn", "comment_text": "Sorrento"}, {"username": "Renae Larcus", "comment_text": "Sorrento as a base!"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Do not go in the summer. Try spring or fall."}, {"username": "Karen Kinney Codella", "comment_text": "Sorrento"}, {"username": "LeAnn Bonkiewicz", "comment_text": "Positano"}, {"username": "Jill Tingley", "comment_text": "Sorrento at bellview serene. Considered best on cliff"}, {"username": "Joyce Gordon", "comment_text": "Sorrento and hire a driver to see the coast!"}, {"username": "Cindy Voss", "comment_text": "Nanci Moll Catherine Sharp"}, {"username": "Jim-Holly Ballew", "comment_text": "Praiano"}, {"username": "Steve Grossman", "comment_text": "We usually spend five nights on the amalfi coast. We stay in the town of amalfi. And if hotel bellevue is available, it's the best deal on the peninsula with magnificent views of the ocean\nAmalfi Has a major ferry terminal and bus terminal right in town. Ravello,minori,\nmajori, Are only a few minutes away.\nAnd of course the food is delicious. Best\nTimes to visits are may and october. After this year's dramatic heatwave, I think most americans will try and forego, italy during july and august"}, {"username": "Renee Rundle Stoneham", "comment_text": "We loved Sorrento and soooo easy to catch the ferry to visit Capri and other cities along the coast etc…"}, {"username": "Tracey Lawrence VanSickle", "comment_text": "Hotel onda verde in Praino 👍 Heading back for our second time in Sept ❤️#hotelondaverde"}, {"username": "Michele Baron Vold", "comment_text": "Positano?"}, {"username": "John Selvaggio", "comment_text": "Sorrento, but try to go in may-June . Still great weather but less crowded"}, {"username": "Pate Mears", "comment_text": "I would recommend Positano or Ravello are my favorites. Capri is also smaller and beautiful. Summer it is packed there. I have always enjoyed going in September or October or May. Have a wonderful trip!"}, {"username": "Kate Sully", "comment_text": "Sorrento!"}, {"username": "Meredith Holloway Helbon", "comment_text": "Following"}, {"username": "Carol Higgins", "comment_text": "Stay in Positano. Busy during day as is all places but totally different in evening. Sorrento is a good base for doing day trips to other towns but it is not on Amalfi coast."}, {"username": "Lori Imhoff", "comment_text": "Amalfi\nHotel Convento Luna"}, {"username": "Nancy Cicinelli", "comment_text": "Sorrento was great base for us"}, {"username": "Collette Irvine", "comment_text": "I stayed at Hotel Aurora in Amalfi in June - was a great place to stay !"}, {"username": "Pirkko Storer", "comment_text": "I agree with Sorrento!"}, {"username": "Bellafab Fabrizio", "comment_text": "100% positano"}, {"username": "Yvette Pavone", "comment_text": "Sorrento"}, {"username": "Jill Medrano Casey", "comment_text": "We loved the town of Amalfi."}, {"username": "Pia Jalonen", "comment_text": "Sant'Agnello/\nSorrento were great!"}, {"username": "Minerva Lopez-Daniels", "comment_text": "Sorrento is the best base so easy to catch a ferry there, bus es too!"}, {"username": "Holl E Bee", "comment_text": "I definitely think Sorrento is the best base for visiting the Amalfi Coast!"}, {"username": "Kay Rendall", "comment_text": "I love Positano. The views, the charm, the locals and yes the stairs. 9th trip in September. U can go anywhere by bus or ferry, yes it is busy, but so is,allmalfi Coast. I use the bus, ferries, just time it well. Stay 3 weeks. Positano is magic, specially in the evening when all the day trippers leave."}, {"username": "Anna Gambino", "comment_text": "A good place to start is by looking at available transportation.\nI stayed in the town of Amalfi twice and there are buses and ferries very available. Sorrento is a good hub for that too. Staying in Maiori next April. Transport is good from there and it’s less expensive than Positano."}, {"username": "Ken Lerch", "comment_text": "Sorrento"}, {"username": "Erika Manna", "comment_text": "Salerno is a great base! We loved it. We spent 8 days there. There are ferries and buses that work really well. We went to Capri, Amalfi/\nRavello, Positano by ferry and Sorrento by car with a driver. Not to mention Salerno is a beautiful city and has a vibrant night life and away from the hustle. Great restaurants and hidden gems."}]}, {"id": "2201817773550634", "text": "0730 Prime experience (booked through Vatican)\n\nVs\n\n1000 - 30mins after public opening", "link": "facebook.com/groups/1373361046396315/permalink/2201817773550634/", "likes": 188, "comments": [{"username": "Sara Beth", "comment_text": "Yup…"}, {"username": "Cory Burns", "comment_text": "I’m sure at a much higher Cost as well?"}, {"username": "Erica Madrid", "comment_text": "Did you guys eat first then tour? Or your then eat? I have the breakfast booking next Monday!!"}, {"username": "Lynn Conklin Olson", "comment_text": "I wish I had known about this when we were there last month. We ended up not going because of the crowds."}, {"username": "Tracey Provenzale", "comment_text": "What was the tour called? Been on the offical website and can’t find this tour.\nThanks in advance."}, {"username": "Julie Norris", "comment_text": "I got an audioguide, skip the line ticket from get your guide last September. I got in 30 minutes before the people in line were admitted. It was just like your picture but without breakfast 😀 not sure if they still offer that option"}, {"username": "Andrew Butler", "comment_text": "Ros"}, {"username": "Tracey Embleton", "comment_text": "Thanks for the tip"}, {"username": "Bernadette Rugayan Bohn", "comment_text": "So glad we chose this one! Maria, Danny, Gerʌldine and Rob, Daryl, Desiree- can’t wait!"}, {"username": "Christin V. McClatchie", "comment_text": "Roni Pina I am so glad we booked the early tour!"}, {"username": "John Salami", "comment_text": "What is the official website? Is the website in English?"}, {"username": "Rhio Schulz", "comment_text": "Cheryl Hopgood next time!!!"}, {"username": "Tammy Lynn Schmitt", "comment_text": "Yay! We just bought this tour for October. It cost a little more but we figured we’d probably only see the Vatican once in a lifetime. So glad to see that it’s pretty empty to begin with. What did they give you all for breakfast?"}, {"username": "Nicole Beaumont", "comment_text": "Same tour I took last month! Totally worth it!"}, {"username": "Amanda Lynn", "comment_text": "So true. We had 8:30am tickets a few weeks ago and it looked like this. I regret we didn’t do the breakfast experience!"}, {"username": "D Rochelle Milton", "comment_text": "Sy Sandblom booking thru The Vatican! I checked their WS, there’s early-bird and skip-the-line tickets. 0730 is perfect (for 0800 tour) ♥️….. great $"}, {"username": "Luanne Carey", "comment_text": "We do this every time, too. It's worth getting up early to have this opportunity."}, {"username": "Susan Lowry Lamb", "comment_text": "The first time I went to the Vatican we got to do a private Sistine Chapel tour, and this as well. It was a company incentive trip. It wasn't until we went back on our own, and did the Sistine Chapel, etc. again, that I realized what I had scored on that first go round."}, {"username": "Carmen Cullen", "comment_text": "Dareon Carrington"}, {"username": "Tania Lebron", "comment_text": "Victor Manuel Ramos"}, {"username": "Alyssa Ann", "comment_text": "Marilee Susan"}, {"username": "Elena Maria", "comment_text": "Ana Ortega"}, {"username": "Stacie Jo Enderle", "comment_text": "Fran Marshall Donna Higgins\nGlad we went with the semi private tour"}, {"username": "Donna Higgins", "comment_text": "Donna Higgins"}, {"username": "Kevin Kappel", "comment_text": "Message Sent John"}, {"username": "Madeline Rose", "comment_text": "We did this too, and best money spent ever!"}, {"username": "Phyllis Snyder", "comment_text": "Going early or going late is better that middle time."}, {"username": "Michelle Cummins", "comment_text": "Kim Grace"}, {"username": "Meiian Lai", "comment_text": "Carolina Sousa甘綺雯 we need to finish breakfast fast 😂"}, {"username": "Atet GC", "comment_text": "What is the “reduced” price for? Students? Seniors?"}]}, {"id": "2201818086883936", "text": "i’ll have 8 full days in Italy next month for the first time. how do you guys recommend me to split my days between Rome, Naples, Amalfi Coast and Pompeii? Is it also worth adding another city or exchanging one for the other? thank you in advance! 🙋🏻‍♀️", "link": "facebook.com/groups/1373361046396315/permalink/2201818086883936/", "likes": 2, "comments": [{"username": "Chiara Normanno", "comment_text": "I'd do 4 days in Rome, one in Pompeii (half a day really), one or two in Naples and a couple around the Amalfi coast while based in Naples or Salerno. One whole day is fine if you wish to extend your time in Rome."}, {"username": "Rhona OConnor", "comment_text": "Allow time to travel...... Always takes more Time than you think. Spend longer in fewer places. Allow time to just sit and experience where are you."}, {"username": "Sandy Radican Shikaly", "comment_text": "Too many places for 8 days.. you will spend all your time traveling"}, {"username": "Frannie Kaplan", "comment_text": "You can do pompeii in one day leaving from Rome or naples. You don't need more. I would spend almost the whole 8 days around the amalfi coast or at least 5-6 and the rest in Rome to connect to your flight"}, {"username": "Laura DeCicco", "comment_text": "That’s too much for 8 days. Pick 2 and enjoy those"}, {"username": "Phyllis Snyder", "comment_text": "Group Pompeii with Naples- add days to Rome."}, {"username": "Roland Trego", "comment_text": "Rome 3, Amalfi Coast 5 (1 day for Pompeii, 1 day for Naples, then the rest for Positano, Ravello, and Capri). I'd personally cut Naples. ROME POSSIBILITIES\n+Day 1 (1/2 day only): Strolling in the Trastevere district, Basilica di Santa Maria in Trastevere + dinner\n+Day 2: Piazza Navona, the Pantheon, Trevi Fountain, Sant’Ignazio di Loyola church, + strolling on Via dei Coronari + dinner in the Campo de’ Fiori\n+Day 3-4: Advanced booking is necessary!\na. Vatican (on a pre-booked, small-group, guided tour) (3h30m). Here is the link for Vatican. If you can’t see availability for the day you want, it might not be released or it is sold out. Several people highly recommend the Prime Tour with breakfast before or VIP Prime with breakfast before. https://\nm.museivaticani.\nva/.../\ntariffe-e-biglie\ntti.html\nb. Galleria Borghese (2.5 hrs). Book TODAY!\nc. Colosseum (2-3 hrs.) Book through Coop Culture (the official website for the colosseum). Third-party sites frequently cancel.\nOther:\n+ Spanish Steps\n+ Monument to Vittoria Emanuele II. Take the elevator to the top for the views.\n+ Strolling in the historic center (e.g., Campo de’ Fiori) and dinner\n+ Palazzo Colonna, Saturday morning only, with reservation. Still privately owned. Spectacular grandeur.\n+ Galleria Doria Pamphilj: art museum in a palace. Must-see: the OPULENT Galleria degli Specchi (Gallery of Mirrors)\n+ Golf cart tour\n\nRome taxis: https://\nwww.rome.net/\ntaxi\n\nPhotos of Rome: https://goo.gl/\nphotos/\nWGqMssZjey1EcP4H\n7\n\nDAY TRIPS FROM ROME.\n+Orvieto (by train) Very enjoyable.\n+Villa d’Este (by train) Popular.\n+Ostia Antica (by train) Popular.\n+Naples (high-speed train).\n+Reggia di Caserta (by train). Lavish royal palace often compared to Versailles. Impressive grounds with fountains.\n+Castel Gandolfo (by train) Summer home of the Pope with beautiful grounds and large lake in a volcanic crater.\n\nDAY TRIPS NORTH OF ROME WITH CAR RENTAL:\n+Calcata Vecchia (Lazio). Yet another tufo village, this one quite small.\nLake Bracciano towns (Lazio): Bracciano, Anguillara Sabazia, Trevignano Romano*\n+Palazzo Farnese (Viterbo), about halfway between Lake Bracciano and Civita di Bagnoregio, has interesting architecture. Good for an hour’s visit and lunch.\n+Civita di Bagnoregio***(V\niterbo) (must-see) 1h35m north of Rome, or 30m south of Orvieto\nSoriano nel Cimino (Viterbo)\nCaprarola: Villa Farnese* (Viterbo)\nBagnaia: Villa Lante* (Viterbo)\n+Pitigliano (Tuscany)***(. Also magnificent. Built on tufo. (must-see)\nSORRENTO & THE AMALFI COAST.\n\nBase: Sorrento. From there, visit:\n+Capri (by ferry) 1 day\n+Positano (by ferry) + Amalfi or Ravello 1 day\n+Amalfi (by ferry)\n+Ravello (by ferry then bus/taxi up the mountain)\n+Pompeii (by bus or train) 1 day\n+ Reggia di Caserta (30m by train north of Naples) 1 day\n\nSorrento/\nAmalfi Coast Photos:\nhttps://\nphotos.app.goo.g\nl/\nfLduhqMt3pMjjjjj\njmnhxJefm8\n\nGetting to Sorrento from Naples:\nhttps://\nwww.sorrentovibe\ns.com/\ngetting-from-nap\nles-to-sorrento\n-best-route-202\n3/"}, {"username": "Starla Dawn", "comment_text": "I’d skip Naples and Pompeii"}, {"username": "Graham Sherlock", "comment_text": "Rome 2 days, then day trip to Pompeii, then off to Florence for the rest."}, {"username": "Dave Schickling", "comment_text": "August is a terrible time to travel in Italy due to crowds of tourists (many Americans) and excessive heat.\nNot much to see in Naples although the culinary experience is great.\nSomeone will certainly suggest Florence which I don’t personally understand. A little farther north you can find authentic Italy in Bologna with great architecture, culture and spectacular food"}]}, {"id": "2201823880216690", "text": "Hello everyone. I’m going to Italy for tbe first time on October 1. I want to book a private gulf cart tour. Do you recommend a day tour in Rome or evening? Which company is the best?\nThanks so much for all your insights.", "link": "facebook.com/groups/1373361046396315/permalink/2201823880216690/", "likes": 0, "comments": [{"username": "Jenn Messina Babore", "comment_text": "Both are good. The day one is longer and night is shorter. Just depends on if you want to see the sites at night lit up or go during the day."}, {"username": "Linda Chase", "comment_text": "We did a private tour with LivTours during the day. It was fantastic"}]}, {"id": "2201834030215675", "text": "Audio guides: Recommendations please for audio guides we can download to our phones and do a self-walk? (I know a popular one is Rick Steves, but wondering if there are others - not a huge RS fan) 😛 Our big day is tomorrow! Heading off to see Europe for the very first time! 🥳✈️", "link": "facebook.com/groups/1373361046396315/permalink/2201834030215675/", "likes": 0, "comments": []}, {"id": "2201827230216355", "text": "Can you share your thoughts on Airbnb vs hotels? We’re traveling with 4 adults and 2 children next Aug. We plan on staying near Cinque Terre for a few days then Rome\n\nAny advice when booking an Airbnb?\n\nThanks!", "link": "facebook.com/groups/1373361046396315/permalink/2201827230216355/", "likes": 0, "comments": [{"username": "Chiara Normanno", "comment_text": "I always try to book Superhost to avoid bad surprises"}, {"username": "Dave Conroy", "comment_text": "Hotels and airbnb same. Identify the area, know your requirements, know your budget, shortlist, read reviews, check photos, book free cancellation if you can, book two, one as backup. Keep checking for better up to cancel date. Choose your final preference."}, {"username": "Jenn Messina Babore", "comment_text": "AirBnBs are usually more economical for larger families."}, {"username": "Lexie Enlow", "comment_text": "I haven’t gone yet but I’m doing Airbnb. I got air bnbs with washing machines and I like all\nOf us to have more space than crammed into a small hotel room"}, {"username": "Fetchin Gretchen", "comment_text": "Always book superhosts with recent good reviews."}, {"username": "Jenn Messina Babore", "comment_text": "I look at AirBnB and Booking dot com, but then Google the direct website and book that way."}, {"username": "Chris Aman Florian", "comment_text": "I love Airbnb’s. Read the reviews. Great way to live like a local."}, {"username": "Eric Parks", "comment_text": "I use airbnb when I have the family with us and we want facilities (kitchen and w/d). Be sure to read all the reviews especially the most recent and try and read between the lines. I've have a lot of great ones and I have had a couple I regretted."}, {"username": "Cherol Hegge", "comment_text": "Airbnb we like having outdoor space a kitchen and other amenities u don’t get at a hotel also many times we are staying in a neighborhood with locals and we like that"}, {"username": "Angel Leckner", "comment_text": "We have just returned from a 17 day trip to Italy. We landed in Rome and worked our way north to Milan. We stayed in several Airbnb’s and here is what I have to share:\n•as others have said, book only with super hosts\n•be prepared that not all listings will have a dryer, so plan accordingly\n•our accommodations in Rapallo did not have air conditioning and that was a B R U T A L 2 night stay (90° all night long)\n•beware if the only parking is “white line” and not a dedicated spot for the apartment/\nhouse.\n\nOur rental in Rapallo was amazing in all things except the lack of air conditioning A N D lack of fans for relief."}, {"username": "Merida Laughlin Carrabba", "comment_text": "Airbnb! When you book in Cinque Terre, check location of Airbnb. We had a great one but it was literally at the top of a huge hill (like Mt Everest) so when you are exhausted after a long day or a late dinner, going home was a taxi ride (for us anyway). Amazing views but a crazy climb!"}, {"username": "Irene Oda", "comment_text": "Also have hotels booked as a back up - just in case of hosts canceling at last minute. Although make sure you read hotel policy for canceling first. We have used airbnb in both Italy and Germany without problems. I second the no dryer and a/c issues. Also stairs....we have to drag suitcases up several flights of stairs."}]}, {"id": "2201837930215285", "text": "Hello! We're flying into Bologna for 3 nights (taking the train to Parma and Modena for a day), verona 2 nights, and venice for 2 nights. I've found a ton of restaurants with good reviews in Bologna and Venice but I'm not finding a lot in Verona. If you've visited Verona, what was your favorite restaurant?", "link": "facebook.com/groups/1373361046396315/permalink/2201837930215285/", "likes": 1, "comments": [{"username": "Scott Perry", "comment_text": "I know this isn’t what you are asking, but for cocktails in Bologna you might want to try Guero on via Goito."}]}, {"id": "2201829306882814", "text": "First time to Italy and I have two questions for this fabulous group!\nWe will be going September 22nd - October 7th so I am not exactly sure weather and what to pack so would love recommendations.\nMy second question is we will be celebrating my birthday and our 40th anniversary in Venice and would love recommendations for a nice restaurant with a view. Not necessarily over the top in price because we are with our best friends and need to be considerate of their pocket book also. Thank you so much to all of you for your help.", "link": "facebook.com/groups/1373361046396315/permalink/2201829306882814/", "likes": 11, "comments": [{"username": "Chiara Normanno", "comment_text": "As for the weather I would start monitoring it a few weeks earlier and follow some forecasting services."}, {"username": "Kay Rendall", "comment_text": "In October I have been in trousers, light wooden sweater, jacket and warm scarf in outdoor restaurants in the evening. It can get quite cool, but warm in the day"}, {"username": "Bonnie Loftspring", "comment_text": "Goggle weather in Italy, actual city would be better & the month you will be there to get an idea\n“Weather in Venice, Late Sept” that’s how I got an idea"}, {"username": "Steve Grossman", "comment_text": "Check the week before you go and it should be pretty warm regardless"}, {"username": "JeriLynne Clifford", "comment_text": "I start watching the weather trends a month before I leave on my weather app. Depends on where you are in the country too."}, {"username": "Renae Larcus", "comment_text": "We love Italy in September. Very comfortable weather. Have a light jacket or something in case it rains, but light tops/ pants or dresses are fine. Gets cooler in October but still pleasant."}, {"username": "Anna Gambino", "comment_text": "Always good to pack layers in case it’s chilly or hot. I’m going October 7-21. Thinking about this too. Trying to pack things in neutral colors to mix and match so layering is easy. I went once beginning of May (Umbria) and it was freezing. We had layers but not nearly enough. We froze!"}, {"username": "Romina Lauretig Toscano", "comment_text": "Rome in September is fantastic!"}, {"username": "Fran Monopoli", "comment_text": "Weather is warm"}, {"username": "Linda Zavarella", "comment_text": "Was there twice in October. Light jacket was all we needed."}, {"username": "Jenny Payne", "comment_text": "Warm weather, linen,cotton,si\nlk + a cardigan,that was last year sept/October weather and I’m going this October till November will still be warm at the beginning then will get cooler 🌻"}, {"username": "Nina Sutcliffe", "comment_text": "Is it swimming weather in September"}, {"username": "Kristen Paller", "comment_text": "I was watching a reel the other day, and the woman recommended an app called meteo for the weather. I guess it was more accurate than the weather app that is typically loaded on your phone already."}, {"username": "Gordana Todorovic", "comment_text": "Great advice. I am going the same time flying into Venice, Florence and leaving from Rome. Planning to check the Italian app for weather a week before travel."}, {"username": "Yvette Pavone", "comment_text": "RISTORANTE MARCIANA. The most delicious food but no view. I would also go during the day to the Square and make a reservation for a table for after dinner at CAFE QUADRI. And I would go there and have dessert and coffee and listen to the music! Just stop by during the day and tell them you’re coming after dinner and give them a time and they will hold a table for you￼"}, {"username": "Yvette Pavone", "comment_text": "RISTORANTE MARCIANA. The most delicious food! But no view. There aren’t many restaurants with views there believe it or not￼"}, {"username": "Alice Francesca", "comment_text": "Download METEO.IT for the weather.\nCheck online temperatures in Venice, average for that period"}, {"username": "Claudia Chavaillaz", "comment_text": "Hey Kathy, Travelling across Italy or just to Venice?\nYou know I live close to some Italian cities......"}]}, {"id": "2201839130215165", "text": "Please whatever you do don’t book any tours with Crown Travels & Tours group\n\nHere’s an ongoing email exchange I’ve been having with them\n\nHello,\n\nI hope this email finds you well. I have been back and forth with both Get your guide and Crown Tours for days now. Here is an overview of what happened.\n\nWe booked our tour on Sunday night for Monday. I didn’t receive the tour confirmation until after our tour had started.\n\nWhen we arrived at our tour, we noticed our group was large, but hey we went with it for the once in a lifetime experience. Our group had 45 people in it.\n\nOur tour guide Elena, commented more than once that the group was too big for her to manage. We received our transmitters and they worked when we had left and started walking over to the Colosseum.\n\nOnce at the Colosseum, we noticed our transmitters going in and out and very staticky. We were right by our guide. She said this was because the group was large. Ok, no big deal. We really couldn’t hear much she was saying. Before we went upstairs, she had asked who needed the elevator. My mother, who had a knee replacement in April stated she needed it. So, she went in with my niece who had mobility issues as well.\n\nThe first time, she waited for my mother. (There’s one elevator that’s small, so it took some time)\n\nNext, she stopped in areas where we couldn’t see anything. We were also picking up other people’s tours on our transmitters (some not in English) At this point, my father, who is also fluent in Italian, asked her if she could speak more into the microphone so we could hear her. She again said, sorry there’s just too many people and seemed annoyed.\n\nAbout 45 minutes into the tour, it was time for another elevator. At this point, she knew my mother would need it again. She did not wait for her to get off, resulting all of us from loosing her and the rest of the group. (We weren’t going to leave my mother behind) We searched all over for her and our group and they were no where to be found.\n\nThis resulting us missing both the Roman forum and the Paletine Hill part of our tour. We were disappointed because we were all really looking forward to this tour. I travel a lot and go on tours to learn more (I am a teacher) but this was truly disappointing. When talking to Crown, they stated that a guide called out sick. If they had contacted us and asked us to move to Tuesday we would have.\n\nI don’t think it’s fair that we had to pay for the company’s problem and in result paying for a tour we didn’t go on. The rudeness and not caring about the customers feelings and money was apparent. They are saying they are not refunding us due to the rest “being able” to go on the tour, when we couldn’t just leave my mom and my niece behind. And, we attempted to find her and we couldn’t. It seemed as though the guide wanted the tour over before it started.\n\nShe made comments in Italian (we speak it fluently) and was truly unprofessional. We had to walk back to the office after to return the transmitters due to loosing her. We did this as a courtesy. All I am asking is for some respect and acknowledgement that our time was wasted. I feel that we were scammed by this company and their response has been nothing short of rude and disrespectful.\n\nPlease research before you book! I should have known this was too good to be true as the Colosseum is usually booked out.", "link": "facebook.com/groups/1373361046396315/permalink/2201839130215165/", "likes": 1, "comments": []}, {"id": "2201843603548051", "text": "Can we talk Ziploc bags instead of compression cubes for packing?\n\nI've seen Ziploc bags recommended on this group instead of compression tubes as they work as well. I can understand how to get the air out, I do this when I freeze things in them.\n\nBut, how does it actually hold the seal without loosing compression? It seems they would decompressआणखी rather quickly, especially if you checked a bag due to no pressurization in the luggage hold.\n\nCan anyone who has actually used Ziplocs to compress clothes mention how well the worked and if they held the compression?\n\nThanks!", "link": "facebook.com/groups/1373361046396315/permalink/2201843603548051/", "likes": 5, "comments": [{"username": "Carmine Castiglia Jr", "comment_text": "Zip the bag most of the way. Place it on a hard seated chair. Sit on it to force all the air out. Zip it the rest of the way.\n\nWorks great. Learned this from my son who learned from his scoutmaster. 😀\n\nPS: you can purchase very large Ziploc bags at the grocery store - well, in my grocery store anyway."}, {"username": "Amy Lynn Rainey", "comment_text": "I do this frequently for travel. I love the 2 gallon Ziploc freezer bags. They usually hold the seal."}, {"username": "Carolyn Straniere", "comment_text": "I use them all the time. Yes they stay compressed. Much easier than compression bags. They come in handy if you have wet items or things that may leak"}, {"username": "Yvonne Ormson", "comment_text": "As frequent travellers and carry on only people we use them all the time. They’ve never come unsealed and always hold the compression. I’ve had two sundresses in one for 3 weeks now (currently summering in Europe)."}, {"username": "Sue Sherwood", "comment_text": "Just use packing cubes."}, {"username": "Jessica Stewart", "comment_text": "Ron Stewart should we try this?"}, {"username": "Janette YesPlease", "comment_text": "I have used both kinds on three-week trips or longer. I used to swear by the ziplock bags, but after using the mesh compression cubes, I find them much easier to keep items organized and use, especially if I have to open and close them a lot. I know what cubes have what items based on their size and see-through mesh. It is also much easier to unzip and zip as often as needed.\n\nI find the large zip-lock bags to be inefficient. Yes, you can sit on them to get the air out, but after several openings and closings, they always seem to lose their compression, so the seal doesn't work that great after a while. Also, because the bags are so large, I tend to pack too much inside, which doesn't help when needing to stay within a weight limit.\n\nSafe travels and I hope this helps."}, {"username": "Patty Norman Cunningham", "comment_text": "I take one large compression bag to put dirty clothes in."}, {"username": "John Green", "comment_text": "Air Canada has a version of compression bags at Walmart that is basically a ziplock bag with a super strong zipper. We used cloth compression bags and the air canada plastic bags and actually like the ziplock bags way better. You can get so much air out and more stuff in."}, {"username": "Kim Geary Keidel", "comment_text": "I bought some bags for our trip on Amazon that are basically large Ziploc’s. They worked great and stayed compressed. (Also, we didn’t use them for the trip to Italy. We used them for dirty clothes on our way home so we had room for wine and things we needed to bring home.)"}, {"username": "Vasthi Cheddar", "comment_text": "They don't. Some maintain the seal but not all"}, {"username": "Sigrid Cormier", "comment_text": "I bought a box of 4 in large and medium size at Homesense for $9 Cdn yesterday."}, {"username": "Jennifer Walker", "comment_text": "I’ve done this each time I’ve been to Italy. We were traveling with our two boys and I went so far as to pack their clothes (and mine!!) by outfit, for each day. I’m not an overly OCD person but this helped a ton!! We didn’t move around a ton but it also helps if you are staying in several different locations, as your stuff doesn’t get totally disorganized. Not sure I’ll do it again, especially if my boys aren’t with me but at the time, it was perfect!"}, {"username": "Bronny Proud", "comment_text": "We have used mesh packing bags of various sizes - they have been fabulous."}, {"username": "Kris Vaske Heims", "comment_text": "I only use the slider version since the other style doesn’t always hold the air. Also-I only use them for carry ons, since only using carry ins is why I need to conserve space.\n\nAs to the success-I have success using them (with the above uses). I can only remember one time it didn’t hold the air. Also-I bring extra empty ones for the trip home, in case one breaks."}, {"username": "Bonnie Loftspring", "comment_text": "This is how I go, XXL ziploc bags,I do dif ways when packing, some are 1 or 2 outfits totally pulled together particularly if it requires certain undergarments &/or I do by category, all my this, all my that. Thus way rummaging through suitcase is not a hassle, I can see everything & I don’t destroy it in the process. I do like this better than packing cubes."}, {"username": "Jeff Mayernik", "comment_text": "I've used ziploc bags, vacuum bags and packing cubes. The vacuum bags I had were horrible- I was only traveling a few times per year and 2 of them failed within 2 years. Ziplocs have the benefit of being cheap and readily available but I find packing cubes are easier to use. Whole lot of 'personal preference' on this subject 😂 Whichever solution works best for you is best for you"}, {"username": "Debbi Mayfield", "comment_text": "I use both. For ziplock if clothes are ok to be wrinkled (jeans, wrinkle free shirts etc) put in ziplock and ROLL as much air as possible out. If you leave it rolled it’ll compress better, BUT also leave a small portion of bag unzipped and insert a straw and suck all the air out!!! Zip quickly! Works great!"}, {"username": "Nancy Day", "comment_text": "I have always used ziplock bags for cosmetics,liqui\ndswhen traveling (via car/check luggage) in suitcases , never had a problem"}, {"username": "Julie Hinton", "comment_text": "I love them! I pack clean undies in one and then take one empty. Dirty undies go in that one.🤷🏻‍♀️"}, {"username": "Sherry Cooke Bringaze Lewis", "comment_text": "I bought a vacuum type bag with a screw-type release from dollar tree for my pillow. I just rolled it and pushed the air out. Then screwed the top back on. Works great."}, {"username": "Georgeann Farinacci Greene", "comment_text": "Love packing cube-packed for 12 days my in Med sized suitcase & had clothes I didn’t wear. I am a serial over packer!!"}, {"username": "Tami Holmes Waldron", "comment_text": "I totally used ziploc bags, my only advice it to bring spare(s). Our dirty bag broke and I didn’t have a spare. Unfortunately 🤣"}, {"username": "Maria Giordano", "comment_text": "Since compression doesn’t impact weight, what is the point? You are still limited to 20,50 lbs"}, {"username": "Tara Roed", "comment_text": "I used a combination of both. For instance, I packed a cube with a bathing suit, a dinner outfit and pajama for each of us. That cube was in my backpack in the plane. Each of us gets a carry on and large backpack. Having all the clothes we would change into in the first day handy made that first day simple. I knew we would be jet lagged and not wanting to look for clothes. Looking back I would mix our clothes together in suitcases instead of each of us having our own clothes in each suitcase. Would have made more sense to have packed similar to the way I prepped for the first day. As the trip went on I moved clothes so that all the dirty were consolidated. Seeing as we moved locations 3 times that became more work than it shouldn’t have been. I also packed a lightweight extra bag in one suitcase for anything we might buy. That was full by end of trip. I ended up checking one suitcase on return that had wine and lemon cello in between the clothes. The clear plastic were good for the dirty clothes and slight compression. I never wanted to compress too much because you don’t want the suitcase getting over weight in the event they weigh it."}, {"username": "Stuart Flinn", "comment_text": "The hold in the plane is pressurized."}, {"username": "Miyuki Kanno Paul", "comment_text": "I only use 2 to 2.5 gallon ziplock bags. No problems at all!"}, {"username": "Jessica Petyo", "comment_text": "Definitely get the slider freezer bags!!! They hold much better. We just did COO for six people for our two-week trip. We way over-packed as well because you can fit so much. I had six dresses in one bag 🤯"}, {"username": "Christine Pinto Kulp", "comment_text": "I use the 2.5 gallon size. They do hold the compression well if you make sure they are fully zipped. One thing you need to be careful of is that you can pack so many more clothes when they are compressed like this that your suitcase can be VERY heavy. Make sure if you are carrying your bag on that you do not exceed weight limit for bags."}]}, {"id": "2201850060214072", "text": "Do you need an actual ticket to enter the Accademia on free Sunday or do you just show up and get I line? Also what time would be good to get there?", "link": "facebook.com/groups/1373361046396315/permalink/2201850060214072/", "likes": 0, "comments": []}, {"id": "2201855723546839", "text": "Do you need a ticket for Duomo or the Duomo climb on free Sundays?", "link": "facebook.com/groups/1373361046396315/permalink/2201855723546839/", "likes": 0, "comments": [{"username": "Carmine Castiglia Jr", "comment_text": "Every major Italian city has a \"duomo\" as the word simply means \"cathedral\".\n\nSo, which Duomo are we taking about?"}]}, {"id": "2201857736879971", "text": "Would $75/ hour be normal for driver in Tuscany? And, can anyone recommend a driver just for the day? Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2201857736879971/", "likes": 1, "comments": []}, {"id": "2201860133546398", "text": "Is anybody in Palermo at the moment and can let me know if it is safe with the fires? We are flying out of Palermo airport next Wednesday and don’t know whether we should stay in Palermo a few nights before or if we should arrive the night before our flight?", "link": "facebook.com/groups/1373361046396315/permalink/2201860133546398/", "likes": 0, "comments": [{"username": "Chiara Normanno", "comment_text": "If you can't get an aswer I'd advise you to look into local FB groups"}]}, {"id": "2201866193545792", "text": "We are on the Italia rail high speed train, day 2 of 9 in Italy.\nDay 1 landed 7am from Boston with our multigenerational family of 15. Got our rental cars in Rome and parked by our Air B and B. Fabulous place for our family of 15. 6 rooms w/baths inside an apartment (we had all the rooms), a large kitchen and someone comes in to prepare a simple breakfast for 7E/person each day. A small balcony for wine at night and coffee in the am. We had reserved spots in a parking garage/lot using Parkvia as we rented 2 9 passenger vans (we leave for our villa in Greve tomorrow). Couldn’t find the lot, no worries found on street parking that’s 15E/day in front of Air B and B. Easy to complete payment using the kiosk-you will need license plate number.\nHit the ground running and toured Colloseum and then were picked up by golf cart tour after. They took us where we wanted. It was wonderful! Booked yours through Viator.\nDinner at La Lacanda per Air B and B recommendation-amazing food and owner was fabulous! 2 gf teens had wonderful pasta meals and appetizers.\n\nDay 2-up early Uber to Roma Centrale for high speed train to Naples Termini (be careful of the Naples Al… stop, we were not paying close enough attention and got off too soon, if it happens to you there’s a green button outside the train you can hit to get back on, we didn’t know about it) we went up to the Frecciarossa office and they booked for the next stop free of charge. Driver picked us up and arranged a Pompei guide-she was amazing! The food at the entrance was also amazing! We grabbed sandwiches as we left. We then were driven to Amalfi Snorkel and we did the boat snorkel up the coast-an outstanding day! If you have time to cross the street from the piers there’s a shopping, stage, restaurants little village that is tucked away-beautiful! High speed train back to Rome now. We did have another train error-I accidentally booked a 10:30am train rather than using 24 hour timing, that mistake cost us quite a bit, but we needed to get back to Rome. * we were pulled aside when we arrived in Naples to have a document check. We all had passport copies and it was no big deal. Locals reported that it keeps the area safer.\nThe Amalfi coast is truly a treasure-\n\nTomorrow we will do the Vatican, Sistine Chapel and then drive to Greve.\n\nWe are a family that loves to see as much as we can ! Some may not like the pace, but it has been great for our family so far.", "link": "facebook.com/groups/1373361046396315/permalink/2201866193545792/", "likes": 10, "comments": []}, {"id": "2201867793545632", "text": "My son and 3 friends are going to Sicily in September before heading to London for the semester and will have about 8 suitcases. They are flying into Palermo, taking the train to Taormina, and flying out of Catania. They are staying at AirBnB's.\nI am looking for reliable taxis to and from the airport and train stations. Can anyone recommendआणखी reliable taxi and transfer services in Palermo and Taormina/Catania area?\nI am looking for 4 transfers for 4 people and 8 suitcases. Ideally I'd like one company that services both areas. Please advise if you can recommend good car services.", "link": "facebook.com/groups/1373361046396315/permalink/2201867793545632/", "likes": 0, "comments": [{"username": "Ken Lerch", "comment_text": "Any chance you might want to lighten the load and ship some of it directly to London?"}, {"username": "Fetchin Gretchen", "comment_text": "Try Uber Black, Transfer Sicily Tours, or Journeys Around Sicily."}, {"username": "Rhona OConnor", "comment_text": "Why not trust a local taxi? Much cheaper than pre booked transfers."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2201875010211577", "text": "Question on Civita di Bagnoregio…\nWe’re staying in Orvieto for a few nights so I’d love to check out Civita. However…husband has a huge fear of heights! I’m assuming the bridge will be a deal breaker for him. Is it as high, steep and narrow as it looks like in some photos? Anyone with a fear of heights have any insight?? The bridge is the only way into the town, right?", "link": "facebook.com/groups/1373361046396315/permalink/2201875010211577/", "likes": 3, "comments": [{"username": "Deborah Larsen", "comment_text": "Yes bridge is only way into town. It’s not very narrow I would say it’s as wide as a single lane road. So it feels like you are walking on a roadway not so much a bridge. It is pretty steep towards the end and you have to take some stairs down before crossing and paying ticket fee. So best to be somewhat fit for the walk especially in the heat. No shade. Beautiful and worth a visit."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "I remember it (from ages ago) as a road more than a bridge and my sister in law, who is afraid of highs, recently did it walking in the middle and watching her feet while she was walking and everything went fine."}, {"username": "Mike Ball", "comment_text": "As long as he keeps looking ahead and not over the sides of the bridge he’ll be fine, it’s quite a wide bridge so you don’t feel restricted when you are walking it ,\n\nIt’s a very beautiful and unique spot so it would be a shame to miss it ."}, {"username": "Melanie Baffes", "comment_text": "Yes, it's the only way. I also have a fear of heights but I took it slow, held on tight, and didn't look down. It was well worth it!"}, {"username": "Joe LaLonde", "comment_text": "I really wouldn’t consider it that tall, but I suppose that would be relative to someone with a fear of heights. One thing I experienced that might be an issue was as I was going up a worker on a golf cart was coming down, everyone basically had to hug the railing in order to let him pass."}]}, {"id": "2201883990210679", "text": "Looking for recommendations for the right travel agent company btw\nCostco, Exotica or Traflager for a 10-12 trip to include Rome, Capri, Florence and Amalfi Coast?", "link": "facebook.com/groups/1373361046396315/permalink/2201883990210679/", "likes": 1, "comments": []}, {"id": "2201884523543959", "text": "What kind of weather is there in Late Dec/Jan? Temps? Snow? Rain?", "link": "facebook.com/groups/1373361046396315/permalink/2201884523543959/", "likes": 0, "comments": [{"username": "Chiara Normanno", "comment_text": "Where exactly? Italy isn’t small after all."}]}, {"id": "2201890156876729", "text": "Anyone looking to travel to Europe should be aware of a new requirement that will go into effect for U.S. passport holders...", "link": "facebook.com/groups/1373361046396315/permalink/2201890156876729/", "likes": 2, "comments": []}, {"id": "2201891136876631", "text": "Has anyone stayed in the Basilicata Region? Do you recommend? Where did you stay?", "link": "facebook.com/groups/1373361046396315/permalink/2201891136876631/", "likes": 0, "comments": [{"username": "Chiara Normanno", "comment_text": "Basilicata is the vacation spot you wouldn't expect, mostly Italian turism there, not crowded at all. You've got cities and you've got the sea, it's perfect for a weekend trip."}]}, {"id": "2201895393542872", "text": "Do you think a 9am arrival to Rome Airport with no checked luggage can get through immigration within 1 hour, take Leonardo Express to Termini station and take the 11:45 am train to Foggia? Is it doable? I haven’t bought train tickets yet but need experts to offer your opinions.\nThx!!", "link": "facebook.com/groups/1373361046396315/permalink/2201895393542872/", "likes": 1, "comments": [{"username": "Carmine Castiglia Jr", "comment_text": "The Leonardo Express is a 32 minute ride and it runs every 15 minutes. Right there, you need somewhere in the neighborhood of 45 minutes...\n\nAll in all, it might be doable.\n\nBut, there is generally no need to pre-purchase train tickets unless you are a large group wanting to travel in a first or business class cabin."}]}, {"id": "2201895780209500", "text": "Can anyone recommend who to book tickets through for day trips, going to Milan in September and want to do the San Siro\nStadium and Duomo di Milano tours and get a hop on hop off tour of some sort. Thanks ☺️", "link": "facebook.com/groups/1373361046396315/permalink/2201895780209500/", "likes": 0, "comments": [{"username": "Vanessa Caretti", "comment_text": "We found tickets for the fast track lift for the Duomo were much cheaper on Tiquets.com than on Get Your Guide.com.\nThey also did a family ticket price."}, {"username": "Kate Conroy", "comment_text": "For San Siro you can book direct with the stadium and go at any time during the day. 30e for adult, 23 for child, if you have the tickets on your phone you can skip the queue at ticket booth and go straight to museum entry on gate 8. From city connect to Metro M5 purple route and get off at San Siro Stadio stop, this will bring you directly to the grounds and you only have to walk a couple of minutes to gate 8. It's a self led tour. Personally found it underwhelming and have visited a lot of stadiums, possibly may have been the fact it was off season in terms of football."}]}, {"id": "2201898853542526", "text": "We have hired a driver to take us to Amalfi from our hotel in Praiano and then up to Ravello and back during one of our days on the Amalfi Coast. Looking for restaurant recommendations for dinner in Ravello with a view. Also, how much time in each town is “enough” during a day trip?\n\nI was thinking heading to Amalfi at noon, grabbing lunch andआणखी walking around until 3:00, then heading up to Ravello for 4:00 and doing the villas and walking around town until dinner around 7. Is 3 hours in each town enough? Too much/too little? It’s our first full day on the coast so I figured we could sleep in and maybe enjoy our hotel pool in the morning and head out around noon, but open to earlier if we have to.\n\nAlso any good spots in Amalfi for lunch? Or we can have lunch in Praiano and just walk Amalfi.\n\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2201898853542526/", "likes": 0, "comments": []}, {"id": "2201904993541912", "text": "Boat, Menaggio, Lake Como\nWatercolour painting", "link": "facebook.com/groups/1373361046396315/permalink/2201904993541912/", "likes": 16, "comments": []}, {"id": "2201907853541626", "text": "A week spent in Roseto Valfortore, Puglia 🇮🇹 unfortunately we are going to miss the Medonna this weekend 😢 but a stop off in Amalfi before flying home Sunday.", "link": "facebook.com/groups/1373361046396315/permalink/2201907853541626/", "likes": 3, "comments": []}, {"id": "2201908266874918", "text": "We are travelling to Italy next year, it will be our first time in Italy.\n\nPlanning on going for 14 nights and ideally would like to travel to 2 or 3 different base locations with the potential of day trips to other places from there if possible.\n\nI’ve heard the train network is really good, but considering hiring a car due to young kids unlessआणखी can be convinced otherwise.\n\nSome of the places I am interested in seeing include Rome, Venice, Pisa, Florence, Almafi coast. Appreciate unlikely able to do them all in the one trip, but would love help planning the best route.\n\nAny advice appreciated.", "link": "facebook.com/groups/1373361046396315/permalink/2201908266874918/", "likes": 0, "comments": [{"username": "Michelle Dougherty", "comment_text": "My kids 100% prefer the train to cars. They can get up and walk around, bathroom is always available etc\nWe bring food and drinks plus entertainment, ie, tablets with airpods, cards, dice etc. In case wifi is iffy, we download a few episodes or movies first to be on the safe side.\nAlmafi, I would definitely hire a car."}, {"username": "Rhona OConnor", "comment_text": "Consider going to less crowded places. You won't have to queue ect. The Puglia area is lovely with lots to see and do, has great small towns with beaches along with the bigger historic towns."}, {"username": "Julia Salmon", "comment_text": "We did a 15 day trip this summer! We did all of those places plus Greece! Message me if you want our itinerary or any questions?"}]}, {"id": "2201912253541186", "text": "Thinking about going to Italy next May into June. Flying into Venice, take a train to Florence and train to Rome then train to Salerno then back to Rome to fly home. Should I book the flights first or the hotels first? Thank you for your help.", "link": "facebook.com/groups/1373361046396315/permalink/2201912253541186/", "likes": 0, "comments": [{"username": "Paulette Otano", "comment_text": "When you book the flight does it offer the insurance after you book the flights?"}]}, {"id": "2201911016874643", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2201911016874643/", "likes": 5, "comments": []}, {"id": "2201911873541224", "text": "What is weather like in Northern Italy in November ? I’m trying to visit a family member there during that month & go to Lake Como or Venice . All intel & advice appreciated.", "link": "facebook.com/groups/1373361046396315/permalink/2201911873541224/", "likes": 0, "comments": [{"username": "Courtney Lynn", "comment_text": "It’s the perfect time. Not too hot, not too cold. Layers that can be taken off during the day and brought back on at night. Less crowds, less expensive. Can’t beat it 🫶🏼"}, {"username": "Clarissa Rava", "comment_text": "Pretty much depends. Last year started to be very cold in october and november but usually its not that cold"}, {"username": "Sally Warren", "comment_text": "Beautiful in Autumn. Chestnuts 🌰"}, {"username": "Esther Starren", "comment_text": "Not very cold but maybe foggy.. which is the best for visiting Venice 👌👌"}, {"username": "Giovanni Pianigiani", "comment_text": "https://\nit.weatherspark.\ncom/m/62658/11/\nCondizioni-meteo\nrologiche-medie\n-nel-mese-di-no\nvembre-a-Como-I\ntalia"}, {"username": "Meghan Tan", "comment_text": "Ask your family member that lives there. They will give you the most accurate answer."}, {"username": "Brenda Rabenau Erwin", "comment_text": "Thank you so much !!!"}, {"username": "Lucrezia Folger", "comment_text": "It can be warm and sunny at the beginning of November, you can expect cold, gloomy days towards the end of the month. The temperature in Italy in November can range between 7°C and 16°C in the central region and 13°C to 18°C in the south. It can get pretty cold in the northern parts of the country, with temperatures hovering between 2°C to 10°C. According to Google."}, {"username": "Cynthia Marie", "comment_text": "Your family member would be your best option to answer this question."}, {"username": "Gianna Onesi", "comment_text": "Check online different years have different temperatures"}]}, {"id": "2201913376874407", "text": "The joy of traveling…Starting my birthday weekend with a Brunello Di Montalcino we bought in Tuscany, that’s 33 years old!", "link": "facebook.com/groups/1373361046396315/permalink/2201913376874407/", "likes": 147, "comments": [{"username": "Michelle Cotoni", "comment_text": "Nice! And Happy Birthday to you! 🎈"}, {"username": "Patricia Chavez", "comment_text": "Have a Awesome Birthday and enjoy your Vino!!"}, {"username": "Marie Cuzzi", "comment_text": "Happy birthday!!!\nI hope you stored your bottle properly… let us all know how it was"}, {"username": "Tanya Bitar", "comment_text": "Happy Birthday 🎈🎁🎉"}, {"username": "Tania Bourgoin", "comment_text": "Buon compleanno 🍷"}, {"username": "Bambi Harris", "comment_text": "Happy Birthday!"}, {"username": "Toni Stringer", "comment_text": "Enjoy!"}, {"username": "Heather Weiss", "comment_text": "My favorite ❤️"}, {"username": "Michael Stefano", "comment_text": "Wow! Salute!"}, {"username": "Gaetano Guttadauro", "comment_text": "Enjoy, love that wine. My b.day weekend as well. Cent’anni."}, {"username": "Carole Tarlap", "comment_text": "The same as YOU? Happy Birthday 🥂"}, {"username": "Jill Brothers", "comment_text": "Wow, please report back, that's awesome"}, {"username": "Holly Frederick", "comment_text": "How much and how was it???"}, {"username": "Kevin McElroy", "comment_text": "Take some time to smell that cork"}, {"username": "Gregory Hawkins", "comment_text": "Happy Birthday! Saluti! That must have been an incredible moment cracking that bottle open and anticipating the first sip! Sounds like it lived up to it’s expectations!"}, {"username": "Robert Castelli", "comment_text": "How long did you make it breath?\nI have many Brunellos from the 1997 vintages."}, {"username": "Miyuki Kanno Paul", "comment_text": "Auguri"}, {"username": "Felicia LoCascio Whitney", "comment_text": "Enjoy! Let us know how it is!"}]}, {"id": "2201914393540972", "text": "*Path of Gods advice please!*\n\nI’ll be in positano in a few days and was hoping to do the Path of Gods hike. I’ve heard that it’s best to start early in bomerano. Any advice / input on the best way to successfully get to bomerano early in the morning from Positano? Thanks in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2201914393540972/", "likes": 1, "comments": [{"username": "Barry Murray Kuhn", "comment_text": "We looked at buses but decided to hire a car thru the hotel. It was a lovely drive early in the AM… think we left at 600 or 630 am. Town of bombero has a small store where we got coffee and a snack. Got on trail and had path mostly to ourselves and it was amazing. It was May 24 2022, so may be more crowded in July. I might go earlier bc of heat. One stop on the way we saw for lemonade and water. Did not do the 1000 stairs at the end… took bus the lady little part."}]}, {"id": "2201921510206927", "text": "We are traveling in October to Italy and Greece. We will start in Venice and taking a day trip to Verona, and to Rome, Naples and Athens.\n\nCouple of questions:\n\nWhat is the best way to get to Sirmione from Verona?\n\nWhat is the best way to do a day trip from Naples to the Amalfi Coast?\nWe have been to Sorento and loved it but what other towns/locations are good to put in this day trip?\n\nThanks!", "link": "facebook.com/groups/1373361046396315/permalink/2201921510206927/", "likes": 0, "comments": [{"username": "Bev Madill", "comment_text": "GoOpti are a good shuttle service in the Lake Garda area."}, {"username": "Rose Stolarek", "comment_text": "Look at rome2rio"}]}, {"id": "2202183513514060", "text": "We’re coming to Milan for 4 nights. We want to see Milan but would like to stay at one of the Lakes, probably Como as it’s closest. As we have a limited amount of time any recommendations of what not to miss and best way to travel? We’re flying into Bergamo Thursday evening and leaving Monday morning.", "link": "facebook.com/groups/1373361046396315/permalink/2202183513514060/", "likes": 0, "comments": []}, {"id": "2201926446873100", "text": "Has anyone contracted YachtingandCo.com for a day time boat tour of the Amalfi Coast and/or Capri?", "link": "facebook.com/groups/1373361046396315/permalink/2201926446873100/", "likes": 0, "comments": []}, {"id": "2201926990206379", "text": "Car hire 🆚 private driver 🆚 bus/train …\nWhat is the best way to travel from Sorrento to Monopoli & sightseeing around Puglia?\nWe will be there for 4nights then returning to Rome for departure home!", "link": "facebook.com/groups/1373361046396315/permalink/2201926990206379/", "likes": 0, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2201934396872305", "text": "Going for four months, what is the best way to use your cell phone…Esim, sign up for a plan there…any ideas would be appreciated! Will only be in Italy.", "link": "facebook.com/groups/1373361046396315/permalink/2201934396872305/", "likes": 0, "comments": [{"username": "Anne Gee", "comment_text": "I've been in italy for almost a month with my daughter. I signed my daughter up for the one month Verizon international plan ($100), and I bought a one month eSim card ($65)...GET yourself the esim card from Holafly. No problems whatsoever. My daughter has had difficulty from day 1. Yes your number changes, but everyone here uses whatsapp."}, {"username": "Alessandro Battxi", "comment_text": "Easy solution: easysim dot global\nStill an easy solution: buying a virtual provider in a shop like ho!, Illiad, kena where you'll have plenty of GB and not paying 100 dollars 😂"}, {"username": "Fetchin Gretchen", "comment_text": "I always get a Sim card when traveling several weeks to several months. Make sure your phone is unlocked and you have apps like whatsapp or 8x8 work etc that have your home number on it for friends and others to contact or banks to verify etc.\nI assume if 4 months in Italy you have a dual passport or visa for the time over 90 days."}, {"username": "Nicola Amy MacDonald", "comment_text": "I used Vodafone and got a sim when I got there from Rome train terminal. €20 a month 200gb data and calls and text. Had great coverage better than a friend that had a different provider that lives there. Called back to Australia with no issues."}, {"username": "Helen Ladkin", "comment_text": "I thought Italy had a 90 day limit for tourists."}, {"username": "Frannie Kaplan", "comment_text": "Buy a sim when you land or if you have access to it, a mobile vikings sim card"}, {"username": "Pam Gerretsen", "comment_text": "Pam Gerretsen"}, {"username": "Alice Francesca", "comment_text": "ILIAD has the cheapest offer and works fine.9 Euros per month"}, {"username": "Candice Lowney", "comment_text": "Holafly esim worked well!"}]}, {"id": "2201932730205805", "text": "Looking for a nice hotel in Venice. Somewhere on a canal and near the action", "link": "facebook.com/groups/1373361046396315/permalink/2201932730205805/", "likes": 249, "comments": [{"username": "Caroline Bernier", "comment_text": "Danieli Fantastic hôtel"}, {"username": "Melissa Shields", "comment_text": "We stayed at EGO hotel right next to Rialto bridge, water bus station and in the heart of it all"}, {"username": "Hanlie van den Berg", "comment_text": "Lana De Reuck"}, {"username": "Chelsie Gambadoro", "comment_text": "We stayed in an Airbnb right on grande canal near Rialto bridge. Let me know if you want link"}, {"username": "Jen A Dee", "comment_text": "We are here now. Riva del Vin Boutique hotel has been beautiful and the staff are amazing!"}, {"username": "Madeline Rose", "comment_text": "We stayed at Residenza Dei Dogi which was a 5 min walk from San Marco Square and right near the water bus line making it easy to get from the train station, to the islands and to the airport. The apartment has 2 bedrooms and 2 bathrooms, plus all of the amenities you need including a washing machine. It is right near shops, restaurants, etc. It is perfectly located and the owner is lovely and very helpful. It is on a small canal and you see the gondola rides all day."}, {"username": "Tonya Wicker Hunt", "comment_text": "We stayed at the St Regis in Venice\nIt was fabulous!"}, {"username": "Erin Ryan Spera", "comment_text": "Hotel Kette was lovely"}, {"username": "Jennifer Stanek", "comment_text": "Riva del Vin"}, {"username": "Margo Woodruff Oglesby", "comment_text": "Palazzo Stern!!!"}, {"username": "Joyce Madonna", "comment_text": "Joyce Madonna"}, {"username": "Steph Kittles", "comment_text": "Our airbnb was amazing. 5 min walk to all the main areas but in a quiet spot on the canal with a great outdoor space. 2 newsrooms 2 bathrooms, it was so huge omg!"}, {"username": "Catherine Silvera", "comment_text": "Hotel Rialto!"}, {"username": "Mariam HS", "comment_text": "Hotel Daniellie one of the best."}, {"username": "Kerry Bussoletti", "comment_text": "We stayed at hotel popadopoli and it was such an amazing hotel and the breaky was so yum 😋"}, {"username": "Anne Marie Skeen Johnson", "comment_text": "Following"}, {"username": "Tracey Chadbourne Mooder", "comment_text": "We stayed at Ala hotel. Loved it! Right on a canal, close to everything and had a great roof top! Would def stay there again."}, {"username": "Julie Frady", "comment_text": "We stayed at Hotel Monaco & Grand Canal. Beautiful! Super close to Piazza San Marco and Harry’s bar."}, {"username": "Catherine Moore Lawrence", "comment_text": "Metropole Hotel."}, {"username": "Craig Wilhelm", "comment_text": "What kind of action? 🤔🤔🤔"}, {"username": "Diane Leesmith", "comment_text": "Somewhere in Dorsoduro - a little quieter than main area of Venice with some nice restaurants."}, {"username": "Diane Leesmith", "comment_text": "Somewhere in Dorsoduro. Lot cheaper, quieter but full of ambience and just across the water."}, {"username": "Nicola Morgans", "comment_text": "lido. Hotel Panorama about 110 euros a night. 5 mjns on water bus to st marks square. only place with a beach. id give the hotel 10/10."}, {"username": "Nicola Morgans", "comment_text": "or the Hotel Danielli for the best interior. terrible cocktails tho"}, {"username": "Piyush Mehta", "comment_text": "Following"}, {"username": "Bronwyn Jarrett", "comment_text": "Just come back , make sure u have a light suitcase and good wheels . I wouldn’t take a hotel on the water , noises and smell. But beautiful"}, {"username": "Judy Hargrove Allen", "comment_text": "Grand Principe by Scalzi bridge ❤️"}, {"username": "Cindy Lombardi Ulrich", "comment_text": "Hotel Ala"}, {"username": "Marlene Armstrong", "comment_text": "As Leanne's mom I thoroughly enjoyed our vacation in Venice and being so close to the Rialto Bridge"}, {"username": "Jeanie Dunn-Eberle", "comment_text": "We stayed at an old monastery that was converted to a little boutique hotel. It was right on the grand canal. Had wonderful fresh croissants every morning. Just lovely!!"}, {"username": "Svetlana Ghambaryan", "comment_text": "Palazzo Baracci"}, {"username": "Marsha Miller", "comment_text": "We really like Hotel Moresco"}, {"username": "Julie Hazlett", "comment_text": "Lido"}, {"username": "Jeanette Colon", "comment_text": "Baglioni Hotel Luna"}, {"username": "Toni Linde", "comment_text": "Bellini"}, {"username": "Ivette Lugo", "comment_text": "i don’t remember the name but there was a hard rock cafe restaurant in front of the Hotel, do a search,"}, {"username": "Diane Robetcky", "comment_text": "The Rialto Hotel"}, {"username": "Kathy Ann Jones", "comment_text": "Hotel Colombina. Great location! My room had a view down the canal which runs under the Bridge of Sighs, next to the Doge’s Palace."}, {"username": "Brian Wells", "comment_text": "Gritti Palace"}, {"username": "Marty McLean-Wilkinson", "comment_text": "Cima Rosa - it’s a beautiful boutique inn"}, {"username": "Rod Metzler", "comment_text": "Hotel Bauer on the Grand Canal\nFantastic!"}, {"username": "Barbara Manzano", "comment_text": "You will find a great place to nod off."}, {"username": "Mimi Nguyen", "comment_text": "Hotel Bella veniza-great breakfast!"}, {"username": "Neal Gibson", "comment_text": "Hotel Rialto,as the name implies right at the Rialto bridge!.👍❤️🇮🇹✅✅✅✅"}, {"username": "Lori Ann", "comment_text": "Colombina - junior suite with a canal view."}, {"username": "Zeynep Hale Yenice", "comment_text": "Hotel Metropole\nBeatrize Gimeno"}, {"username": "Catherine Stevens", "comment_text": "I hated to sleep there the smell of the humidity is awful"}, {"username": "Alexandra Morabito", "comment_text": "We stayed at Hotel Rialto..right next to Rialto bridge ..close to everything"}, {"username": "Steph Anie", "comment_text": "Violono d’Oro ! But it’s not on the canal !!"}, {"username": "Sharon Tee", "comment_text": "We stayed in hotel Rialto right by the Rialto bridge"}, {"username": "Dawn Muscarnera", "comment_text": "DO NOT stay Hotel Carlton!!! The absolute worst!!!!! We just returned from there. Small, very outdated rooms. No AC. Worst customer service"}, {"username": "Ashley Titus Schuberth", "comment_text": "St Regis was great"}, {"username": "Donna Marie Michelle", "comment_text": "Following"}, {"username": "Lori E. Smith", "comment_text": "Following"}, {"username": "Karen Haney Logan", "comment_text": "Try staying in Lido instead."}, {"username": "Karen Haney Logan", "comment_text": "One more thing to consider that has nothing to do with your hotel,is your shoes. Uneven cobblestone streets and lots of steps everywhere in Italy 🇮🇹. Splurge on a pair of comfy, low shoes to prevent stumbling"}, {"username": "June Rooney", "comment_text": "April Daly"}, {"username": "Kristin Young Winkler", "comment_text": "Londra palace is our favorite go to hotel when we’re in Venice.\nOn the grand canal."}, {"username": "Carol A. Bressi-Cilona", "comment_text": "The Danielle"}, {"username": "Diane Rogers-Gajewski", "comment_text": "I reserved Hotel Montecarlo in San Marco. Any thoughts on this hotel?"}, {"username": "Chelli Brown", "comment_text": "Hotel Seressima\n\nhttps://\nwww.hotelserenis\nsima.it/\n\nAbsolutely amazing, wonderful staff! It’s close to the square! You can go at night & listen to the musicians! It’s gorgeous!!! 💖💖💖"}, {"username": "Chip Swalley", "comment_text": "Love this property! GREAT location, very close to everything! Breakfast was amazing!"}, {"username": "Charles Ferer", "comment_text": "Gritti palace. Very nice but pricey"}, {"username": "Mark Morley", "comment_text": "hotel amouria"}, {"username": "Sheri Clark", "comment_text": "Yes!"}, {"username": "Tom Winberry", "comment_text": "We stayed at the Hotel Papadopoli Venezia! It was great!!!"}, {"username": "Jodie Yates", "comment_text": "Ca del Arte"}, {"username": "Billie Frances Swanda", "comment_text": "Look at Frommers book on Italy"}, {"username": "Jeanne Neylon Decker", "comment_text": "Ca' Pisani D'eco Design Hotel-- easy walk to everything but not in the middle of San Marco and all the tourists!"}, {"username": "Sue Kreger", "comment_text": "I stayed at Ca’ Nigra Lagoon Resort, Santa Croce….. it was just beautiful and the gardens to sit out and just watch boats going by, reading and drinking an aperol, was needed after walking all day….."}, {"username": "Marien Spisich Kaifesh", "comment_text": "Monaco and Grand Canal! Expensive but worth it! Best view!"}, {"username": "Craig N Nancy Derrick", "comment_text": "Pay out your but"}, {"username": "Tonsia Keytel", "comment_text": "Hotel Bizano."}, {"username": "Tami Sue", "comment_text": "Bring bug spray."}, {"username": "Michele Elizabeth", "comment_text": "Rosa Salva Hotel\nIs amazing. Excellent service, clean, beautiful and right in the heart of San Marco. Just returned Thursday."}, {"username": "Sarah Halford", "comment_text": "Nowhere better than Hotel Monaco & Grand Canal - Venice xx"}, {"username": "Martha Kennedy Cullimore", "comment_text": "Gritti Palace, for sure."}, {"username": "Denise Machon Boyd", "comment_text": "Rialto Hotel 👍"}, {"username": "Paulyn Hoffman", "comment_text": "Hotel Del Dragomanni. We stayed there a few years ago. Very small and quaint. Our room was on the top floor and the window overlooked the Grand Canal. They serve breakfast everyday."}, {"username": "Gwennyth Clothier", "comment_text": "Hotel Principe / fabulous and not expensive / on the canal 🤩"}, {"username": "Teri Kadri", "comment_text": "I stayed at Dona Palace. It's small & has a beautiful inner courtyard facing the canal which runs under the Bridge of Sighs. Very close to St Mark's Square. Wonderful staff. The hotel was an old Palace from long ago. I loved it!!"}, {"username": "Emma Bellchambers", "comment_text": "Hotel Carlton on the Grand Canal"}, {"username": "Teresa Swelbar Gilmore", "comment_text": "Following"}, {"username": "Brian Delvecchio", "comment_text": "Hyatt on Murano island"}, {"username": "Sharon Goldner Tipping", "comment_text": "St Regis!!!"}, {"username": "Susan Parker Clifton", "comment_text": "Hotel principe"}, {"username": "Claudette JV", "comment_text": "splendid hotel"}, {"username": "Wanda Moratelli", "comment_text": "Gina V Zerella… 🧐🧐"}, {"username": "Demenico Khayla", "comment_text": "Follow"}, {"username": "Anna Ward Gounev", "comment_text": "Hotel Saturnino on the canal. Super old school charm"}, {"username": "Nancy Mazur Sutch", "comment_text": "The St. Regis hotel."}, {"username": "Debbie H DeLoach", "comment_text": "We stayed at Hotel Al Ponte Dei Sospiri, has a canal dock, and they served breakfast in the room. To the left and down a street from the left of St Marks Basilica"}, {"username": "Tammy Sommer", "comment_text": "Splendid!"}, {"username": "Denise Racanelli", "comment_text": "Hotel Saturnia, absolutely loved it! Street noise but still would go back."}, {"username": "Sharon Gardner Elliott", "comment_text": "Al Ponte Antico Hotel\nwww.alponteanti\nco.com\n\nBeautiful & most amazing family run boutique hotel … We loved our stay there!"}, {"username": "Valeria Sal Mor", "comment_text": "Hotel río alto, right infríngenos the grand canal and the vaporetto stop."}, {"username": "Shelley Stewart Greene", "comment_text": "Hotel Moresco is right on a canal, fairly close walk from terminals, and they have happy hour drinks and unlimited breakfast (made to order). I think we paid $300 for one night. It was gorgeous!!"}, {"username": "Tammy Jess Mercer", "comment_text": "We stayed here. Right on the canal and within steps of the train station so easy to get to/from.\n\nhttps://\nwww.nh-hotels.co\nm/hotel/\nnh-venezia-santa\n-lucia?utm_camp\naign=local-gmb&\nutm_medium=orga\nnic_search&utm_\nsource=google_g\nmb"}, {"username": "Julia Crump", "comment_text": "We stayed at the Blu Suites, canal view room and only 10 minutes from San Marco Piazza. Also very reasonable price."}, {"username": "Janet Miller", "comment_text": "Slendid"}, {"username": "Eva Salas", "comment_text": "In case you want peace - Murano Hyatt on Murano. Loved our stay."}, {"username": "Angie Gray", "comment_text": "We just got back from a wonderful stay at H10! The room, the staff, the location - everything was perfect! This is a view from our window!"}, {"username": "David Davey", "comment_text": "What action? All you will see is bunch of people walking around. 😂😂"}, {"username": "Barbara Johnessee", "comment_text": "Has anyone stayed at Palazzo Veneziano Hotel? We are staying there the beginning of September. First time in Venice.\nHope it will be great!"}, {"username": "Phyllis Waring", "comment_text": "Hotel Carlton on the Grand Canal near the train station ..excellent prices..friendl\ny staff..Vaporett\no stop nearby! Ask for a balcony room overlooking the canal!!"}, {"username": "Phyllis Waring", "comment_text": "Phyllis Waring"}, {"username": "Anthony Martini Jr.", "comment_text": "Just curious, been there plenty...what \"action\" are you speaking about?"}, {"username": "Hester Posthumus Brits", "comment_text": "Rialto hotel near the bridge"}, {"username": "Sandy Brightbill", "comment_text": "We stayed at the The Gritti Palace, a Luxury Collection Hotel, Venice\nIn June.. it was fabulous"}, {"username": "Ray Chan", "comment_text": "Bauer Palladio"}, {"username": "Sandra Gee", "comment_text": "Hotel Ala"}, {"username": "Casey Fendlay Vavala", "comment_text": "We loved the Hotel Colombina. Beautiful third floor balcony room overlooking a quaint canal with gondolas slowly gliding by. 🇮🇹 🇮🇹 🇮🇹"}, {"username": "Melissa Ann", "comment_text": "Hotel Cavaletto was perfect for us. Great location off maris square with little balconies. Where we had breakfast in the morning and cocktails at night."}, {"username": "Jo-Anne Redwood", "comment_text": "Griti Palace"}, {"username": "Anna Rea", "comment_text": "Rialto Hotel, awesome location and lots of action. 🇮🇹"}, {"username": "Heidi James", "comment_text": "We went to lunch at St Regis which was lovely. This is the view. We stayed at Londra Palace, rooms were lovely and aircon was fantastic. Didn’t love the food in the restaurant tho. We also went to the Excelsior for a day and rented a cabana- I’d stay here next time as they have free boat taxis for guests."}, {"username": "John Collins", "comment_text": "Done that"}, {"username": "So Phie", "comment_text": "Il Palazzo Veneziano, IS a very good hotel, very quiet, very beautiful. The breakfast is incredible and the staff speak a lot of differents languages. The room are so beautiful with jacuzzi or not. You've got a station of vaporetto in 2 min."}, {"username": "Mitra Smith", "comment_text": "Hotel Danieli. If you can get the Presidential suite, it’s amazing!"}, {"username": "Julie Menzinger- Wolf", "comment_text": "Following!"}]}, {"id": "2201934883538923", "text": "Has anyone stayed in the Ercolano area? I’m staying there in a few days and looking for any restaurant recommendations\n! TIA", "link": "facebook.com/groups/1373361046396315/permalink/2201934883538923/", "likes": 0, "comments": []}, {"id": "2201940173538394", "text": "I just returned from Italy and I’d like to start a thread of things that were surprises to me when traveling.\n\n* We hired a private boat to take us from Sorrento to stops along the Amalfi Coast. It was a 19’ boat that was supposed to accommodate 6 guests plus the skipper. It was ROUGH. We ended up only doing one stop because we didn’t want to be on the boat any longer. I truly think the driver was very inexperienced and that was the reason for the unpleasant experience, but that aside…when the boats pull up, prepare yourself for a ‘bumpy’ exit and entrance. It is very wavy and you really just have to try to time it and cross your fingers. And this is all boats, not just the one we took. We sat and watched for a while and can’t believe we didn’t see anyone fall into the water. We did, however, see an older lady who had to be carried off because the ride there was so hard on her. I wouldn’t recommend a boat arrival to anyone elderly.\n\n* So many people say that you can pay with card for anything and that’s just not the case. We traveled the entire country and needed cash for so many things. For example..water taxi to the airport in Venice, private guide to Pompeii through our hired car company, all of the tourist nightly taxes. These were all larger amounts, so yes, keep cash on you.\n\n* Download apps before you arrive if you won’t have cellular service. I didn’t think about this and waited to download some apps but they needed a text code and we only had a data package(taxi apps for Rome, or anything you need to link payment to).\n\n* Yes, it is cheaper to do certain things that you arrange yourself, but sometimes it’s just more practical to let someone else handle the details and planning. I was planning our trip for a year and the transportation part had me so stressed that I postponed the entire thing for another year. I ended up booking some private transfers and it all fell in line. (I live in a small town and public transportation anywhere is so intimidating for me. I know this isn’t an option for some people).\n\nI hope this post doesn’t come off negative. That isn’t my goal. I absolutely LOVED our trip and feel blessed I was able to take it.\n\nPlease add any not commonly talked about points to this post. I see a lot of the same things on all the pages I follow. Just hoping to help others with the less talked about things.", "link": "facebook.com/groups/1373361046396315/permalink/2201940173538394/", "likes": 344, "comments": [{"username": "Sally Sprinkle", "comment_text": "Definitely need cash anywhere are you going to Europe. Many unexpected things like Credit Card spending limits meaning the store decides you need to spend 10 or €20 to use a credit card. Tips are also in cash. Stopping to a café to get a cappuccino. Outdoor food Stalls and clothing stalls. I could go on and on many places you need cash."}, {"username": "Marilyn Caladine", "comment_text": "Italy is a country of many things. One minute you hate it the next you fall in love with it. Italy is not so much a holiday more an experience. 🍋"}, {"username": "Melanie McIntyre", "comment_text": "Thanks for the info as we have these options as daytour off our cruise ship in a couple of weeks.."}, {"username": "Anna Gambino", "comment_text": "I have been on small boats along the Amalfi coast several times. Water can be very rough at times. Wind is also a factor. Lost my hat last trip 🤣. I am going in October and it will be the first time I am navigating the ferries and buses on my own. Hoping for the best but I also have some private transfers booked. It does become overwhelming. I always carry cash and I get it before I leave the US. If I come back home with Euros leftover I just save for the next trip."}, {"username": "Renee Kremesec", "comment_text": "We were surprised at how truly AMAZING Rome was. We enjoyed every second.\n\nAlso surprised how stressful driving in Italy was. DONT DO IT!\n\nThe large cities, I wish we would have visited more quaint areas.\n\nNo surprise, the food was fabulous.\n\nHow wonderful ITA Airways from Rome Nonstop to SFO. Best flight and best service.\n\nSurprised how safe we felt walking all over Rome at night and how there is something to see around every corner.\n\nHow affordable the food is\n\nNaples not as we thought"}, {"username": "Catalina Daniel", "comment_text": "In italy now. Our private boat around Capri was cancelled because of the choppy water. We were a lil upset but TOTALLY understood! I have 2 lil ones and was grateful they cancelled. As far as tourist tax. Zilch for us! We did airbnb’s all the way! How ever, late checkins require an extra fee ($60 after 6 at some places) & check outs are 10am!!! I mean, seriously!?! but so far 3 places have done this same thing for us. It sucks bc now we have to travel on their time not ours. Making these check in times really put a damper on out exploration time. Weve had to skip a couple things we wanted to do bc we had to make their time constraints. Cash has only been an issue while buying our small trinkets and paying tolls. Overall, we are having a blast. On our last leg of our travels now. It all flew by too fast"}, {"username": "Jaime Cleek", "comment_text": "What apps did you download?"}, {"username": "PattiAnn Mazzella", "comment_text": "What apps do you suggest?"}, {"username": "Kylie Paine", "comment_text": "My daughter did an 8 hr boat cruise from Salerno to Amalfi ,making stops along the way,she said 6 got off at 1st stop because it was so rough..she was so sea sick herself she raced to the pharmacy at the 1st stop and lasted the next 6 hrs..ain't no way she was missing the Amalfi coast lol apparently they are so rough due staying close to the coast line for guests to get photos and see the actual coast line"}, {"username": "Amy Dunne", "comment_text": "Cian"}, {"username": "Matteo Basile", "comment_text": "A boat is not a car, she stays on the water and water is moving, can be rough. If you’re not a boat person you should avoid boat trips."}, {"username": "Kimberly Virelli-Fulmer", "comment_text": "Please list the APPS you suggest to download beforehand. Thanks!"}, {"username": "Jennifer Sadutto McKay", "comment_text": "I have ATT with international calling 10/day to use. I had no problems at all with my service and I added apps while there. Everyone has different experiences.\nI used info off here and some was spot on and others maybe not.\nEveryone has different experiences, I wouldn’t not do things you want too, it maybe different for you. Just know you are not home, things are very different there, communication may not be he easiest and know there will be hiccups and most of the time not all, things work out. Many things will sell out, so if you can get tickets before, you should at least try.\n\nI was in Paris, Venice, Murano, Naples, Sorrento, Capri, Positano and Amalfi.\n\nDid all transportation myself, wasn’t bad. Different because not like home but I thought very doable. Lovedthe train better than hopper that we took to Venice. Ferry easy too."}, {"username": "Iris Joan Price", "comment_text": "We took ferries last year from Sorrento to Capri, around Capri,and from Amalfi to Sorrento. I don't recall choppy seas, but I will remember to take my Dramamine with me this year just in case. I don't usually do smaller boats, but I missed seeing the blue grotto last year because the tour did not include it and may try to do that this next time."}, {"username": "Tess McDade", "comment_text": "Two weeks ago we had a boat tour from Sorrento along the coast that held 12 guests plus the skipper and mate. We stopped at Amalfi and at Positano as well as a stop for swimming. I had Dramamine with me for our group in case of choppy waters but the day was perfect and we had no problems at all and no Dramamine needed. It was an 8 hour day on the water and the boat ride had no more than a gentle sway to it. The blue grotto was closed because of high water levels. We had an amazing day so please know it is possible depending on the weather and the crew!\nGetting on and off the boat was a little tricky because of the increased rocking from other boats but they hold your hand and tell you when to step up / down, it has to be done with the motion. It was one of the best days of our trip. I booked the day through Golden Tours."}, {"username": "Erica Styan", "comment_text": "I postponed our trip as well for some of the same reasons. Transportation and all the stones kept giving me anxiety 🤷🏻‍♀️ so I get it !!! My favorite part of this post is that sometimes having someone else handle the details is just easier. And yes we are now doing that. So thank you for proving me right. Lol"}, {"username": "Tracy Foss", "comment_text": "Thank-you for the great information I totally agree with you about transportation it's definitely less stressful. You can wander endlessly around trying to get somewhere wasting time & money if you are in a large foreign city & don't speak the language"}, {"username": "Michelle Plutto", "comment_text": "What private transportation companies did you use? I need to get from Naples airport to Sorrento and then from\nVenice to airport but like 4am eeks"}, {"username": "Laura Brangers Pope", "comment_text": "*I second the affordability of the food/drinks!!\n*You must go into a market while there. We did go into one supermarket while in Rome but most were much smaller with only the essentials and very little over processed items like we are accustomed to in the US.\n*Specifically in Naples, the road signs are plaques in the sides of the buildings.\n*We were warned many times that anything with wheels is very dangerous. Places that seemed like pedestrian-only\nwalkways were not!\n*Deep fried pizza and fresh buffalo mozzarella in Naples. So good!\n*Cafes, gelato and restaurants every few steps. The worst coffee there was still better than the “best” coffee in the US!\n*We primarily used cash and got it from our bank before the trip. We had 50 and 100 bills. Very difficult to break these. Especially when an espresso was 1 euro."}, {"username": "Lana Watson Famiano", "comment_text": "Great points. That’s why I have always used Perillo Tours for my trips to Italy and this year will be my 15th one. I don’t have to plan for or worry about anything. They take care of it all."}, {"username": "Ashleigh Harsanyi", "comment_text": "You must have had an unlucky experience with regards to the boat. My husband hired one for our first day which he skippered and handled the swells fine. The second time through the same company from Praiano we hired a water taxi to Maiori and that trip was fine. Both times we had 3-4 people on and off the boat helping us on and off."}, {"username": "Eric Parks", "comment_text": "For that stretch of water, I wouldn't go on a 19' boat unless is was dead calm. Our last trip was on a 30'. The seas were good but still found sections to be quite sporty."}, {"username": "Michelle Cummins", "comment_text": "Kim Grace informative post. Great comments"}, {"username": "Kim Thomas Simmons", "comment_text": "Is there a particular company you used for private transfers???"}, {"username": "JeriLynne Clifford", "comment_text": "Agree on how inexpensive food and wine is! Best surprise of our last trip for sure!\n\nI found that food tours in a new city are a great way to feel a little submerged in their culture.\n\nTaking a cooking class by a cesarine is such a fun way to learn about the market and how they shop and make local recipes"}, {"username": "Tango As", "comment_text": "The water is very dependent on weather. I was there about 3 weeks ago. Did Capri and Amalfi by boat on 2 different days and NO issues. It was very pleasant"}, {"username": "Nadia Nadia", "comment_text": "Thanks for the tip about cash. Because I was planning to take around 150 euros for 3 weeks for incidental which now doesn’t seem enough."}, {"username": "Toni A Cargola", "comment_text": "I also just came back from Italy. It was beautiful more than I expected. We were on a tour. It was great used insight vacations. It was great."}, {"username": "Nancy Woods", "comment_text": "We hired a private boat also and it was lovely!! It depends on condition of the seas I guess!!"}, {"username": "Chris Vilsack", "comment_text": "The cash thing is tricky. Most will try to get you to pay in cash, so they won't have to pay taxes. The good thing about a card is you can dispute the amount if you get tricked into a higher charge - another reason the local tourism industry wants cash."}, {"username": "Bev Symes", "comment_text": "Helpful thanks"}, {"username": "Emily Niland", "comment_text": "Thanks for this. I'm heading to the amalfi coast in September with my parents. The boat trip have been something I'd have loved but might skip now."}, {"username": "Janette David Payne", "comment_text": "We’re going in October and doing the boat trip just from Sorrento to Positano, then to Salerno … are those two stops easy to get on and off of ??We’re reasonably fit, but always cautious …"}, {"username": "Michelle Pratt", "comment_text": "Thanks for the info. What boat company did you use?"}, {"username": "Suzie LG", "comment_text": "I agree with you completely. The seas from Sorrento to Capri were surprisingly rough!\nSo remember…you are at sea…not a calm lake. We used a tour company and they provided ALL transportation including cars, buses and trains. They handled ALL luggage and we stayed at the finest hotels and ate at fabulous restaurants. It was soooo nice to let them plan every detail and we never had a worry. It’s just my personal preference! 👍"}, {"username": "Sally Warren", "comment_text": "Honestly a boat trip is very dependent the weather. Same all over the world."}]}, {"id": "2201940856871659", "text": "Hi I'm wondering if anyone has travelled to Rome, Milan, Florence and Amalfi and had any experience with eating gluten free?", "link": "facebook.com/groups/1373361046396315/permalink/2201940856871659/", "likes": 0, "comments": [{"username": "AgAnne Chrzanowska", "comment_text": "In Florence we have plenty of gluten free restaurants: quinoa, risotteria melotti, osteria vegetariana, sgrano. Outside of the centre you can find the pizzeria 'Il vecchio e il mare' with an excellent gluten free pizza. 100% gluten free ice cream places are Grom and Antica Gelateria Fiorentina. Enjoy!"}, {"username": "Alice Francesca", "comment_text": "Many people with gluten allergy are totally fine eating pasta and bread in Italy.We do not use gmos and a lot of preservatives that are toxic"}]}, {"id": "2201948310204247", "text": "Mizurinalake", "link": "facebook.com/groups/1373361046396315/permalink/2201948310204247/", "likes": 0, "comments": []}, {"id": "2201950313537380", "text": "Anyone stay at hotel Graal Ravello\nNear colosseum..\n\nWe’re staying there ￼in August 17-21", "link": "facebook.com/groups/1373361046396315/permalink/2201950313537380/", "likes": 0, "comments": []}, {"id": "2201951736870571", "text": "Traveling to Amalfi in early October. Will be flying to Naples from Zurich and need a hotel for an overnight stay in Naples before heading to the Amalfi coast the next morning. Two questions: best way to get to Sorrento from Naples? Bus or Ferry? If bus, we need to stay somewhere near airport. If we go by Ferry we need to stay near the port ( Molo Beverello) according to what I’ve read. Any advice/recommendations for a place to sleep in Naples?", "link": "facebook.com/groups/1373361046396315/permalink/2201951736870571/", "likes": 0, "comments": []}, {"id": "2201954103537001", "text": "We are working on a trip for next year (Prob Sep/Oct). I was looking at a map and think our itinerary would be something like this....\nVenice - 2 days\nFlorence - 2 days\nRome - 2 days\nBari - 2 days\nMatera - 2 days\nSorrento - 2 days\nNaples - 2 days\nANY SUGGESTIONS TO WHERE WE SHOULD SPEND MORE OR LESS TIME AND WHAT TO SEE IN EACH. My grandparents came from the Bari region .....\n\nthank you", "link": "facebook.com/groups/1373361046396315/permalink/2201954103537001/", "likes": 3, "comments": [{"username": "Steve Grossman", "comment_text": "Some of the places you mentioned are three to five hours of driving time between each other. Your plan is way too aggressive you need many less cities on your list"}, {"username": "Laura DeCicco", "comment_text": "If you want to see where your grandparents came from stay in Puglia… Bari, Monopoli, Polignano a Mare for a week or more, there’s a lot to see in that area, also spend 2-3 days in Matera."}, {"username": "Ilaria Giorgulli", "comment_text": "Sadly, you need to make a choice. North or south. You cant go from Venice to Bari, it’s far too much expecially with public transports.. if you want to go to Bari to see family, skip Venice. Although I can guarantee you that Bari will be easily reachable in the next 20 years.. Venice.. who knows.."}, {"username": "Koen Loeven", "comment_text": "Much more time in Florence"}, {"username": "Carole Tarlap", "comment_text": "Everyone has an opinion 🤣🤷"}, {"username": "Mary Agozzino Derrick", "comment_text": "Don't forget travel time, checking in and out if accommodations.\n..so you're really only getting 1 day in each spot, Italy is not a country to rush through...perha\nps cut your list in half or by 2/3 rds...Venice, Florence Rome and Bari is already a lot"}, {"username": "Laura Uribe", "comment_text": "I would cut back and do\nVenice, Florence and Rome plus one more city in transit (maybe Bologna, San Gimignano or Montelpuciano)\nor\nRome, Naples and Sorrento (so many possible day trips from Sorrento - Capri, Ravello, Amalfi, Positano)\nor\nBari, Matera and another couple Puglia cities.\nYour current itinerary just doesn’t leave time to really explore a city when you add in travel and changing hotels every two days. We usually spend a minimum of 3 nights per city.\nThis trip, we will be in Rome for 3 days and it’s our 5th time. I still have too many things to do on our list even after all of these trips. 😂\nHave a wonderful time!"}, {"username": "Val Kilgallon", "comment_text": "No more than 4 cities in that time, and three would be better if any of those days involve flying in and out. You need more time in each. I know it is hard to cut out certain places but you will enjoy it more if you are not rushing to a train station every other day and losing so much time in transit and switching hotels...."}, {"username": "Bea Kuckens", "comment_text": "As most are saying, too much and too fast. Two days isn’t enough anywhere, especially Rome and Florence. You will be in those places but not experience them."}, {"username": "Julie Agarkov Mayblyum", "comment_text": "I would leave Sorrento and Naples for next time, and add at least a day to Rome, and either Florence or Bari."}, {"username": "Phyllis Snyder", "comment_text": "Looks great- however consider adding 1 day to Rome and only spend 1 day in Naples."}, {"username": "Diana Sankara", "comment_text": "X La Ma👩, pare la schedina del totocalcio"}, {"username": "Rick Schneider", "comment_text": "1 day matera , no days in naples use extra days to see more of the amalfi Coast.\nMight be spending a lot of time in a car and checking into hotels.\nMaybe eliminate Bari and spend an extra day in Rome and Florence"}, {"username": "Pate Mears", "comment_text": "I agree with Bev Madill. You do need a little more time visiting Venice, Florence and Rome. Positano is special, and I would visit Capri while you are there. I would skip Naples. We were told to stay away from there 5 years ago because the crime was so bad. I would add those 2 days to the above 3 cities. Go and enjoy - you are in for a great treat!"}, {"username": "Alicia Cox", "comment_text": "That’s a lot of travel & pack/unpack. I’d try to condense it & do a few day trips where u can. Maybe 4 places to stay, but can’t remember what’s close to what."}, {"username": "Lydia Springer", "comment_text": "All those 2-day stays seem like a lot of moving around. Consolidate in each area - i.e., stay in Sorrento or Naples."}, {"username": "Karen Schmidt", "comment_text": "Skip Naples. Make Venice, Florence, Rome and Sorrento all 3 days.\nRemember when you stay 2 nights you only have 1 full day for sightseeing. Most areas need at least 2 days to see the sights so that means staying 3 nights."}, {"username": "Barbara Bastianini", "comment_text": "Everyone’s different but in my opinion you’re generally not allowing enough time in these places. Keep in\nMind that on your arrival day in each city you’ll have at the very most one half a day available for sightseeing. Remember you’ll be transiting to get there then have to find your hotel and check in. So one and a half days left in Rome for example, one of the worlds greatest cities, is woefully inadequate.\n\nNow a lot depends on what you want to see and do in each city. No one can tell you what to see in these places because your interests and preferences will be different than theirs. But you should know what you want to do everywhere so you can realistically estimate how long you might need to accomplish what you want. In general this is what I’d do, based on my own interests and travel style.\n\nVenice 3 to 4 days. Florence 3 days. Rome 5 days. Matera 2 full days , Sorrento 3 days.\n\nI’d drop Naples. It’s just not a favorite for me. So I’d rather allocate those days elsewhere. And I’d substitute Polignano a Mare for Bari. Just because I think it’s more beautiful.\n\nBut again everyone’s different bud suggest you decide what you want to do in each place before deciding on the number of days. I usually go to my local library before a trip to take out several travel guides. Reading those usually helps me firm up what’s important to me in each. Plus I like to do a Google image Image search to actually see the places. And I read some history too. If you don’t do these things you may find out you have too little time somewhere or too much somewhere else. That would be a shame!"}, {"username": "Lyn Evans", "comment_text": "By the time you transfer from each place it’s almost a lost day. I would narrow down the places you stay and stay for longer at each."}, {"username": "Lauren Swanteck Myler", "comment_text": "You need more than 2 days in Venice, Florence and Rome. This all too rushed IMO. Pick a region either north or south. Or if you don’t prefer to do that, then explore 4 places over that time. I went to Lake Como, Portofino/\nSanta Margarita, Venice, Florence, Rome my first trip over 2 weeks. It was way too much. You think you will never go back, but hopefully you will. You will want time in Apulia/Bari to see Monopoli, and Corato is lovely."}, {"username": "Debbie Potter", "comment_text": "In my opinion I think its too much too quick and you're gonna be exhausted from traveling from city to city and walking a lot. Try to do less cities and just do a few and spread those stays out... but I'm not you so do what's best for you and your family."}, {"username": "Carey Matthews", "comment_text": "Cut the places on half and double the time in each."}, {"username": "Rosemary Barbetta", "comment_text": "You have to travel in between. That takes up a lot of time"}, {"username": "Lucrezia Folger", "comment_text": "Too much with not enough days. Remember, there is traveling, checking in, checking out, eating, sleeping, showering, etc. There is only so many hours in the day. And you have left no time for just being present in these magnificent places. You'll be back!! My suggestion would be: Venice - 3 days\nFlorence - 3 days\nRome - 4 days\nBari - 2 days\nMatera - 2 days"}, {"username": "Jennifer Larese Taylor", "comment_text": "Santa Claus is in the basilica in Bari! Do visit it"}, {"username": "Janet Ottaiano", "comment_text": "3 nights in Rome, 3 nights in Naples, do Sorrento from Naples, 3 nights in Bari, do Matera from Bari."}, {"username": "Miyuki Kanno Paul", "comment_text": "Are you driving?"}, {"username": "Gwyneth Spadaro-Dutturi", "comment_text": "Matera, the Puglia peninsular, Gargano peninsular-more\nthan enough for 2 weeks. I suggest driving as you will be your own boss and can visit places no public transport visits. Don’t rush, relax and soak up the atmosphere"}, {"username": "Beatriz Davalos Moreno", "comment_text": "we just came back, spent 3 nights in Rome, 1 in florence, 2 in Venice and 2 in Paris. I wish we had done at least 2 or 3 nights in Florence and at least 3 in Venice, Venice is so beautiful! Sorrento is beautiful too! lots to do in Rome, give yourself enough time to enjoy every place. You spend at least half day in transfers!"}, {"username": "Crystal DellaMaggiore", "comment_text": "Take me with you?! 😜"}, {"username": "Chiara Normanno", "comment_text": "Cut a day from Bari and one from Matera towards Rome"}, {"username": "Rhona OConnor", "comment_text": "Do less!!! Spend more time in less places. You will spend too much time travelling. I spent a week in Bari. Lots to do in the area that is worth seeing."}, {"username": "Rhona OConnor", "comment_text": "Rhona OConnor"}, {"username": "Jeff Gentner EA", "comment_text": "There's a huge difference between SEEING Italy and EXPERIENCING Italy. This itinerary is for sightseeing. We prefer to experience Italy. 3 day minimum in any place. It all depends on what you want. Traveling between places will slow you down on this tight schedule."}, {"username": "Meghan Tan", "comment_text": "If you want to concentrate on S. Italy, then do just Sorrento, Matera, Bari.\nOr you could do Rome & Florence.\nIf wouldn’t advise going to each area listed for just two days because you would be VERY rushed and it also takes a few hours to travel between each of them."}, {"username": "Bev Madill", "comment_text": "You're rushing things. You'll spend a lot of time getting to places and only scratch the surface of places you’re visiting. Venice, Florence and Rome need more days. When you’re in Sorrento you probably want to go to Positano and Capri at least so 2 days isn’t enough. Take your time savouring this most beautiful country."}, {"username": "Sande Ricci", "comment_text": "You really won't have 2 days in any of those places. You will be traveling. Cut out a few places and visit them next time."}, {"username": "Anna Gambino", "comment_text": "I would stay in Sorrento for 4 days and just do a day trip to Naples. Sorrento is supposed to be very nice and, in my opinion only, cleaner and a little more safe. Or spend one extra day in Florence (So beautiful) and then 3 days in Sorrento."}, {"username": "Elena Innocenti", "comment_text": "Less place and more day each.\nSame time in Matera and Roma is crazy."}, {"username": "Laura DeCicco", "comment_text": "That’s way too much rushing from place to place. You’ll waste half your trip on a train. Pick 3 places and really explore those"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "This program as it is, it’s quite a nightmare, a simple strike would ruin everything as it’s 6 days of travel just to move from one place to another.\nYou need at least one extra day in Rome.\nFlorence and Venice it’s ok just two if it’s two full days.\nI wouldn’t stay in Bari (unless you have family you want to visit) but in Ostuni, is smaller and slighter in the south, you can leave Matera in the morning visit Bari for a full day and then go sleep in Ostuni and visit the surroundings."}]}, {"id": "2201955320203546", "text": "Next July is my 30th wedding anniversary and we will be celebrating in Rome. Our 2 adult children will be with us. Our daughter is a vegetarian with some fish (no shellfish and must have fins and scales like salmon). Looking for recommendations for a special place.", "link": "facebook.com/groups/1373361046396315/permalink/2201955320203546/", "likes": 1, "comments": []}, {"id": "2201955713536840", "text": "I see this pops up regularly: you cannot drive in Italy with just the US license\nhttps://it.usembassy.gov/u-s-citizen-services/local-resources-of-u-s-citizens/transportation-driving/#:~:text=Tourists%20may%20also%20use%20their,of%20the%20date%20of%20registration.", "link": "facebook.com/groups/1373361046396315/permalink/2201955713536840/", "likes": 0, "comments": []}, {"id": "2201956816870063", "text": "Good evening!\nWe are planning a 3-day vacation in Salerno and we also want to visit Positano and Capri. Our accommodation is in Salerno.\nWhat are the best things to do in each of these places?\nThank you.", "link": "facebook.com/groups/1373361046396315/permalink/2201956816870063/", "likes": 0, "comments": []}, {"id": "2201958143536597", "text": "Just a couple questions regarding the trains.\n1…If I book a ticket that says there’s a “change” how easy is it to stuff up the “change” or it’s straight forward and enough time to make this change..\n2..going from La Spezia to San Gimingnano area, and want to get off at Pisa for a couple hours (this is an example) do I need to book separate tickets to get on and off for each leg of trip ?\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2201958143536597/", "likes": 1, "comments": [{"username": "Rhona OConnor", "comment_text": "No 2 - that is two journeys"}, {"username": "Sigrid Cormier", "comment_text": "No hop on hop off."}, {"username": "Gillian O'Callaghan", "comment_text": "#1 changes are easy.....yes I was stressed about them at first. On many trains they will announce your next platform as you arrive into the station. Go to that platform....num\nbers etc are easy to follow. If you miss the announcement go to the departure board, find trip #2 and platform."}]}, {"id": "2201959753536436", "text": "Hello, any tips for a lone traveller in Florence end of August? I have tickets to uffuzi and Accademia Gallery already. Want to do a night time cooking course. Would appreciate any advice", "link": "facebook.com/groups/1373361046396315/permalink/2201959753536436/", "likes": 0, "comments": []}, {"id": "2201961140202964", "text": "I love this lady calling out pick pockets! She rocks!\n\n", "link": "facebook.com/groups/1373361046396315/permalink/2201961140202964/", "likes": 0, "comments": []}, {"id": "2201961526869592", "text": "Planning on travelling to Italy from Canada next summer. We really want to stay on the Amalfi coast. Should we land in Rome and take the train to the Amalfi coast? Looking to find a cute Airbnb 1 bedroom with balcony. Any recommendations? What is the best month to travel - don’t want it too hot but do want to swim and get some sun ☀️", "link": "facebook.com/groups/1373361046396315/permalink/2201961526869592/", "likes": 1, "comments": [{"username": "Alice Francesca", "comment_text": "Do not come in July or August. Early june or september beautiful."}, {"username": "Glenn Todd Webb", "comment_text": "Fly into Naples. Much closer. I would take a private hire after that. April, May, early June. September, October"}, {"username": "Laura DeCicco", "comment_text": "Fly in to Naples and get a private driver to the Amalfi Coast, take the ferry from Naples, or the bus. If you’re staying in Sorrento you can train from. Apples there but there aren’t any trains to the Amalfi coast"}, {"username": "Brad Nelsen", "comment_text": "Casa Nostro in Praiano"}, {"username": "Maxine Fenton", "comment_text": "Take the fast train from Rome to Salerno then the ferry will drop you off at different towns. We're doing it next year and staying in Minori. Some lovely airbnbs there."}]}, {"id": "2201965806869164", "text": "Hi all, has anyone used the COTAMO taxi service in Modena? I tried to call them, but non parla Italiano😂 I'm trying to prebook a taxi service to pick 10 of us up from a caseificio near Modena town back to our hotel in Modena, and would not want to push our luck and book on the day. Happy to hear about alternatives as well (except public transport as the travel time takes significantly longer). Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2201965806869164/", "likes": 0, "comments": []}, {"id": "2201967943535617", "text": "Hi all- I’m planing my stay in Assisi spending the night. After my sightseeing Assisi- I’d l would like to go to Spello. Then return to my home base in Rome. Has anyone done Assisi & Spello in one trip = 2 days? Is it packing in to much? Would you cut one of them out? Grazie for your thoughts?", "link": "facebook.com/groups/1373361046396315/permalink/2201967943535617/", "likes": 0, "comments": [{"username": "Alice Francesca", "comment_text": "You can do Assisi and Spello in two days, just to see the most of it"}]}, {"id": "2201970290202049", "text": "We will be traveling from Ljubljana to Ravenna to join our cruise in early October. The cruise departs at 5pm. I am wondering what is the best way to get from Ljubljana to Ravenna (we have 2 adults and 2 teenagers). I had planned on leaving Ljubljana in the morning of the cruise but now I’m concerned about not making it in time. Is anyone able to advise which transport is best and whether I should allow an extra day to travel? Thank you 🙏", "link": "facebook.com/groups/1373361046396315/permalink/2201970290202049/", "likes": 0, "comments": []}]