[{"id": "2199352997130445", "text": "Any suggestions for cooking classes in or near Sorrento ?", "link": "facebook.com/groups/1373361046396315/permalink/2199352997130445/", "likes": 2, "comments": [{"username": "S Christian Everett", "comment_text": "https://\nwww.casamele.com\n/\n\nFantastic!"}, {"username": "Greg Rogers", "comment_text": "Quantobastasorr\nento.com"}, {"username": "Giuseppe Placi", "comment_text": "Quanto Basta"}]}, {"id": "2199349883797423", "text": "Fast trains in business class where are the luggage racks (for bigger than carry on size). Are the racks Front or back by the washrooms?", "link": "facebook.com/groups/1373361046396315/permalink/2199349883797423/", "likes": 3, "comments": [{"username": "Liz Anne", "comment_text": "We were able to put 2 large suitcases and a backpack above our seats"}, {"username": "Gena Diaco Penland", "comment_text": "The racks above the seats fit a full size suitcase!"}, {"username": "Miyuki Kanno Paul", "comment_text": "Also between two sets of opposite facing seats are available for suitcases"}, {"username": "Bernadette Collins", "comment_text": "We found most racks at the end of each carriage. The lower racks for the bigger suitcases"}, {"username": "Katalina Loredo", "comment_text": "Katalina Loredo"}, {"username": "Alice Francesca", "comment_text": "Keep your bags near you or somewhere you can see them.There are thieves getting on the trains and stealing luggage.I am Italian and I strongly advise you to do so.\nThere is enough room between the seats or above them"}, {"username": "Christie Grant", "comment_text": "On one now 💥"}, {"username": "John Rodriguez", "comment_text": "I did business class yesterday on Fressiarossa. It was right above us."}, {"username": "Rhona OConnor", "comment_text": "On some they are between the seats too."}, {"username": "Lisa Valdovinos", "comment_text": "On our trains they were above the seats."}, {"username": "Bill Elias", "comment_text": "I sort of miss the older trains. On my first trip in the 90s, we were in a room where you put your luggage above - though it was shared with seat mates across from us. We left our baggage and had a meal in the dining car where we shared a table with two older Italian women.\n\nThe food was delicious and fresh. Real plates and utensils. It was so civilized."}, {"username": "Sherill Hacker", "comment_text": "We did executive class on Italo. There were luggage racks on both ends of the car."}, {"username": "Catherine Johnson", "comment_text": "I put my luggage in the racks at the end of my carriage. I made sure I was there by the rack before the train stopped & stayed there till it left for the next station. I would also glance back a few times to ensure all was well. I was in business class."}, {"username": "Christine Malota- Kendall", "comment_text": "Jessica Zolciak"}]}, {"id": "2199347103797701", "text": "Less than three months and we're heading on our first overlanding journey: driving from Belgium to Southeast Asia!🔥\nSince all the good stories start with \"I drank Lambrusco and ...\" we plan to travel all theआणखी way through Italy again first and then from Bari take the ferry to Albania or Greece and start the trip that way! We have been to Italy several times before... But now we are looking for the not so known surprises, which place is not touristy and unprecedented but MUST be visited for whatever reason?! 😍 Already thanks so much! 🙏\nBelow some pictures of our adventures through the beautiful Italy. 🤌 Who wants to follow along the journey or has some tips, please, let's connect 🌻\n\nhttps://www.instagram.com/offthemainroad_/", "link": "facebook.com/groups/1373361046396315/permalink/2199347103797701/", "likes": 15, "comments": [{"username": "Ethan J. Felsing", "comment_text": "Theth, Albania if you like the mountains. Gjirokaster and Berat are cool spots in Albania as well"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Pitigliano, Orvieto, Gubbio, Tivoli, Montecassino, Matera."}, {"username": "Kay Malick", "comment_text": "Kay from Perugia, Italia...wow amazing trip you have planned...i am planning to do something like this but going from Bari to Greece and then driving back to Italy passing through all Eastern europe..So i would love to follow your post...\n\nAs for me, I was able to do the driving trip from UK all through Western and Central Europe and can share some tips if you are interested, please."}]}, {"id": "2199346797131065", "text": "Heading to Italy in just over 2 weeks. My daughter and I will be taking the train one day from Florence to Viareggio and plan on spending the day at the beach. Does anyone know if we can pre-book a cabana for the day we are there? I hear there are several cabana rental companies but i can’t seem to find any information online!\nAny help is greatly appreciated!", "link": "facebook.com/groups/1373361046396315/permalink/2199346797131065/", "likes": 1, "comments": [{"username": "Jenn Messina Babore", "comment_text": "We did a cruise excursion to Viareggio and they took us to Bagno Nettuno. They have cabanas. It might be worth reaching out to them to see if you can reserve in advance. https://\nbagno-nettuno.it\n/en/"}, {"username": "Eileen Muro", "comment_text": "We were just there yesterday. We just rented 2 lounge chairs with shades by the water. I didn't even get the name but I did take pictures of 2 spots. Here are the names....maybe you can find them online"}, {"username": "Benedetta Vanni", "comment_text": "What you call a rental company, we call it \"bagno\" (pronunced like the spanish baño) or \"lido\". You can rent a beach umbrella with 2 sunbeds (\"ombrellone con 2 lettini\") or a fully equipped cabana (\"gazebo\" most likely) . Be aware that the word \"cabina\" has got nothing to do with cabana: it means a small private changing room."}]}, {"id": "2199345610464517", "text": "Such a lovely place …..Florence✨", "link": "facebook.com/groups/1373361046396315/permalink/2199345610464517/", "likes": 112, "comments": [{"username": "Amina Mohammed", "comment_text": "Saw it last week, was in Uffizzi art gallery, amazing."}]}, {"id": "2199345483797863", "text": "Will be doing a cruise from Rome to Athens next September. Ports in Italy will be Civitavecchia (starting point), Naples, Messina. Planning on arriving in Italy a few days before the cruise but not sure on planning the itinerary. Maybe fly into Venice and take train to Rome? Or just do Rome?\nHow would you do this if you had 3 days to sightsee in Italy prior to the cruise?\nWe are 2 females late 50s", "link": "facebook.com/groups/1373361046396315/permalink/2199345483797863/", "likes": 2, "comments": [{"username": "Louise Wilson", "comment_text": "I would go directly to Rome and get a hotel there. There are so many important sights to see in Rome - be sure to buy tickets in advance online for the Vatican, et. If you stay in another city, you may not get back to Rome in time to catch your cruise due to the notorious train/plane strikes in the summer months."}, {"username": "Billie Begley", "comment_text": "That’s a choice you will need to make. We have done both. We have flown into Venice. Loved Venice and the canals and then train to Rome. If you want to see the Vatican and Colisseum you can do that with 2 full days in Rome. If this is a one time\nTrip I would fly into Venice. Spend 2 nights. Add an extra night in Rome and see the\nSites over 2 days. Then cab trip the port in the the morning."}, {"username": "Miyuki Kanno Paul", "comment_text": "We have done Mediterranean cruises to both directions starting Civitavecchia. We flew into Roma and spent 3 nights before heading to Civitavecchia. It’s about 1.5 hour ride from Roma Termini. If you are coming all the way from Venezia to Civitavecchia, add at least another 4 hours on high speed train on top of it."}, {"username": "Lisa Quinn", "comment_text": "I would just fly into Rome a few days before, and fully enjoy the city, and then go out to the port for your cruise"}, {"username": "Steve Grossman", "comment_text": "Your first Day you going to be exhausted. So make it relaxing and then spend the next two days, really doing all of the great sites In rome, and then you can go on your cruise. Others may tell you to take a day trip. I wouldn't or you'll just be more exhausted for your cruise. Enjoy rome it's one of the most fascinating cities in the world"}, {"username": "Beverley Milson", "comment_text": "Spend time i Rome… so unchanged to see there & time to come down after flight. Train rom Rome Termini station is about 40 minutes to Civitavecchia..\nfast & cheap… although need to consider luggage."}]}, {"id": "2199343973798014", "text": "Interested in guide recommendation for the Vatican and Rome.", "link": "facebook.com/groups/1373361046396315/permalink/2199343973798014/", "likes": 1, "comments": [{"username": "Monica Colontonio Macho", "comment_text": "City Wonder Tours if it is possible ask for Angie M."}]}, {"id": "2199318387133906", "text": "I see a lot of different opinions as to when to visit the Dolomites for hiking. We are planning on early June next year and have had some say to avoid it while others say it’s great that time of year…\nI’m wondering what all of you have to say!", "link": "facebook.com/groups/1373361046396315/permalink/2199318387133906/", "likes": 0, "comments": [{"username": "Amina Zena", "comment_text": "June is perfect as its not too hot not too crowded and not too expensive , july is good too, August is crowded and expensive."}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "We hiked Tre Cime in October (pre-COVID). Fantastic. Low crowds and perfect weather. Loved Lago di Braies.\n\nIf you’re a hiker and love nature, it’s a must! Not sure of heat and crowds in June.\n\nYou gotta visit places and do activities which speak to you. Many will have differing opinions. Best to ask “why and why not”."}, {"username": "Gonzalo Lopez Serna", "comment_text": "If you Travel early June, then it’s ok, no crowds (it’s not Amalfi, Rome, etc). I’ve been there even in the middle of august and still good.\n\nJune is perfect!\n\nEnjoy!"}, {"username": "Paul Davis", "comment_text": "We didn’t hike but visited Ortisei and the surrounding area early this month. No crowds. Took the lift to top of Seceda and there was no line. Check out the page Trentino Alto Adige."}, {"username": "Kirsty Manning", "comment_text": "Did early June. Was a great time 🙂"}, {"username": "John Sampson", "comment_text": "Hi ,which part of the Dolomites,.\nIf its the Dolomiti Lucane in the south I strongly recommend it.hundreds of miles of beautiful forest .lovely villages.\nI go every year.if you need any help give me.a.shout."}, {"username": "Linda Miller", "comment_text": "I was there in late April of this year! All the spring flowers were in bloom! Temperatures were in the mid to upper 60°'s in higher elevations and low 70°'s around Merano and Bolzano."}, {"username": "Steph Craddock", "comment_text": "Well I lived in the Alps for 16p years, weather can be unpredictable, often storms in afternoon. Alpine meadows at their best, beautiful verdant green,p still snow high up, can still be chilly especially in evenings."}, {"username": "Giovanni Pianigiani", "comment_text": "June hands down. You likely to have around 4 hours daylight more than in September"}]}, {"id": "2199342970464781", "text": "Hi all, planning a first time trip to Italy - was looking to go to Naples, Rome and the Amalfi Coast.\n\nDoes anyone have any hotel recommendations that are family friendly and in Naples/ Amalfi preferably have a pool?", "link": "facebook.com/groups/1373361046396315/permalink/2199342970464781/", "likes": 1, "comments": []}, {"id": "2199340030465075", "text": "I'm looking at spending 3 nights in Monterosso. I have two kids who will be 5 and 8 when we go, so we do need a family suite but not a huge one. Any insight on the following hotels, especially Colonnia? I reached out and some of their pricing isn't available yet for the time we are going next year, so relative cost is great too (i.e. this one costs… आणखी about x for a family suite, this hotel is more expensive than that one, etc.) I do have a price for Villa Steno, and I don't know if it's \"high\" or not. Thanks!\nHotel La Colonnina\nHotel Pasquale\nHotel Villa Steno", "link": "facebook.com/groups/1373361046396315/permalink/2199340030465075/", "likes": 0, "comments": []}, {"id": "2199337540465324", "text": "Is it too early to book a train from Venice to Florence for October. What train is best?", "link": "facebook.com/groups/1373361046396315/permalink/2199337540465324/", "likes": 57, "comments": [{"username": "Amanda Johnson", "comment_text": "John Nok"}, {"username": "Jodi Thornton Lindsey", "comment_text": "F"}, {"username": "Lynn Kennedy", "comment_text": "Booked mine 6 weeks ago, better pricing and choice of seats. Used Italio app"}, {"username": "निनावी सहभागी", "comment_text": "Just booked Trenitalia. Business economy. 2 hr trip. Venice to Florence. $59. Is that average??."}, {"username": "Laurie Gies Forseth", "comment_text": "Eric Gies ... great info"}, {"username": "Joshua Pickles", "comment_text": "More than 30 days in advance gets a discount"}, {"username": "Michele Buick", "comment_text": "Frecchiarossa"}, {"username": "Pam Allen", "comment_text": "Tara Papp"}, {"username": "Kim Finger McCormack", "comment_text": "We already booked out trains for October."}, {"username": "Kris Butler", "comment_text": "I just booked all our Italy train tickets today for our trip in October."}, {"username": "Kelly Peagler Myers", "comment_text": "Shawnna Chance"}, {"username": "John Bruckman", "comment_text": "Yes a bit early you can book 2-3 weeks before your trip. Freccia Rossa is best -Trenitalia"}, {"username": "Linda Tibbles", "comment_text": "Book on line at Trenitalia, and even pay before you go."}, {"username": "Tracey Lethbridge", "comment_text": "Can foreigners book the tickets under the Silver Card for those ages 60+(Carta d’Argento) and if so how do you apply for the card? With thanks"}, {"username": "Carey Elizabeth", "comment_text": "I booked mine the morning I woke up. I took the high speed, Florence to Venice and then I booked Venice to Florence when I got to the train station. It was late November.\n\nI never prebooked any of my train tickets."}, {"username": "Julie Angel Bruther", "comment_text": "I did!"}, {"username": "Robert Peterson", "comment_text": "Trish Peterson"}, {"username": "Preeti Sekhri", "comment_text": "Use Italo-2moths out you get some great deal and trains are awesome sign up for coupons"}, {"username": "Max Perletta", "comment_text": "Up to Bologna, then high speed Bologna Firenze, Frecciarossa"}, {"username": "Gina Aguilar", "comment_text": "Too early you can do it from your phone the same day . Fast trains are the best"}, {"username": "Chris McLaughlin", "comment_text": "I have already booked mine from como to venice for November"}, {"username": "Carol Evans", "comment_text": "We purchased train ticket for December Milan to Venice no problems"}, {"username": "Jennifer Hsu", "comment_text": "Which option is less risky to get stuck when there’s labor strike?"}, {"username": "Cliff Mahoney", "comment_text": "Earlier the cheaper it will be!"}, {"username": "Enas Mourad", "comment_text": "Italo is my favorite then trenitalia"}, {"username": "Jenny Frank", "comment_text": "Trenitalia appr super easy.\nShould be ok to book now"}, {"username": "Linda Kogan", "comment_text": "Is there a secure way to store a carryon size suitcase for a day in Venice?"}, {"username": "Jacqueline Nisbet", "comment_text": "Yes too early we booked high speed train a month before our date of travel .."}, {"username": "Rita Davoli-Conti", "comment_text": "We’re in Italy now - have travelled thru France and Italy by train and only bought tickets the day before with no probs yet!"}, {"username": "Rosetta Iacono", "comment_text": "I don’t think it’s too early, if you prefer to have it done now. We booked all our trains for travel within Italy in April and are leaving Venice on Monday for Florence. Enjoy your trip!"}, {"username": "Gil Rodriguez", "comment_text": "https://\nwww.italotreno.i\nt/en"}, {"username": "Jigisha Patel Morosky", "comment_text": "Can you not book the tickets while you are in Rome? Will they be all sold out?"}, {"username": "Jenn Smith", "comment_text": "Tickets are usually available 60 to 90 days in advance, but if they are available now yea go ahead."}, {"username": "Mitzi Godwin", "comment_text": "We just booked our trip via ItaliaRail for early October."}, {"username": "Shannon Cox", "comment_text": "I booked ours for mid October on the Trenitalia website last weekend. 2 hours and 13 minutes from Venice to Florence. I paid the extra 2 euro to choose our seats in premium."}, {"username": "Alex Dodge", "comment_text": "I would buy it 2-3 weeks ahead of time. Trenitalia is better in my opinion than italo but whichever is more convenient for you should be fine. Prices always seem better in advance, but I could be wrong, I prefer to upgrade when possible to business, its a small price for a nice upgrade."}, {"username": "Simon Perry", "comment_text": "If you can, i suggest you to reserve in advance. Early bookings, usually, deserve the best discount.\n\nAs per the type of train, use \"Italo\" or \"Frecciarossa\".\nThese are the two fast trains available in the Country."}, {"username": "Renata Shepherd", "comment_text": "And try to upload the Trenitalia app on your mobile - it will make your life easier"}, {"username": "Lalita PosBa", "comment_text": "No. No worries, You can buy them when you get here actually. Get the app Trenitalia and you can see your choices. I just bought mine last night for my trip today from Florence to Venice."}, {"username": "Nadia Waugh", "comment_text": "Do it."}, {"username": "Mary Tannous Ayoub", "comment_text": "No I just bought mine for November."}, {"username": "Janette David Payne", "comment_text": "We’re there in October and already bought our tickets from Venice to Florence and then from Florence to Rome a week later… it meant we got the times we wanted and the days we wanted and we know exactly what time we need to be checking out etc… so easy to do online !!! Have a wonderful trip, we can’t wait !!!"}, {"username": "Melinda Brown", "comment_text": "Italo is the best. Clean, neat, and organized."}, {"username": "Claudia Castellini", "comment_text": "It’s not early, you can find good prices booking in advance.\nLook for high speed trains, Trenitalia Frecciarossa or Italo"}, {"username": "Nicole Condemi", "comment_text": "When I had tried to book, the dates weren’t available to book yet, there was an option to be notified via email"}, {"username": "Tracey Cook", "comment_text": "F"}, {"username": "Stu Toohill", "comment_text": "I reckon you should look at the website, see if it will allow you to book a train, then, if it was me, pick the fastest train with the cheapest most comfortable seat."}, {"username": "Amanda Adkins Whitson", "comment_text": "Use the trainline app. It shows you the trains and schedule all in one place."}, {"username": "Fiona Cameron", "comment_text": "You can book through Trenitalia website, booking open about 2 months before, just keep checking if you don’t find anything when you search"}, {"username": "Fiona Cameron", "comment_text": "Here’s a sample of search results. The site is in English but you have to search using the Italian city names… Venice = Veneto. Florence = Firenze"}, {"username": "Heather Becker", "comment_text": "I bought tickets, Florence-Venice\nearly October, 12 people, 2 months ago on the Trenitalia website- 60% discount!"}, {"username": "Sandra Di Liso", "comment_text": "We just took the Frecciarossa yesterday from Venice to Florence. We booked our tickets a few months ago because we needed 8 seats and wanted to ensure they were together. Booked business class and honestly is was easy, fast and comfortable."}, {"username": "Laurie Wyatt", "comment_text": "I’ve already purchased all of my train tickets. Mid-September- early-October."}, {"username": "Elizabeth Jean", "comment_text": "Jess Nishta"}, {"username": "Tammie Connolly", "comment_text": "."}, {"username": "Anna Biernat Kaufman", "comment_text": "We booked ours for late September -early October."}, {"username": "Raelene Ormsby", "comment_text": "I booked Turin to Venice & Venice to Rome weeks ago for 2nd half of October But ended up using Trainline as paying by Australian credit card too difficult with Trentalia."}, {"username": "Carly Moore", "comment_text": "If you book for a certain train time and you are late can you just take the next one"}, {"username": "Daniela Horth", "comment_text": "You can book on Italo 3 months ahead. Prices are great if you book early"}, {"username": "Billy Stocklin", "comment_text": "You can buy 2 months ahead but no point."}, {"username": "Ed Enfield", "comment_text": "Trenitalia and they have a fast train that goes from Venice to Florence. It only has a couple stops. Book business if you can swing it."}, {"username": "Victoria Laverty", "comment_text": "Italio"}, {"username": "Anthony Sperduti", "comment_text": "Yes"}, {"username": "Sandy Radican Shikaly", "comment_text": "Prefer Italo"}, {"username": "Melissa Feielin Hawkins", "comment_text": "Prefer Italo- so worth the first class cabin too. Privite lounge while you wait at station, private seating area on train w/sliding door, snacks, lunch, drinks\nPlus Direct from Venice to Florence"}, {"username": "Olga Olga", "comment_text": "In October you can buy right on train station 30 minutes before departure"}, {"username": "Claudia Amp", "comment_text": "Italo or Trainitalia (look for FrecciaRossa/\nFrecciaargento) fast trains direct from Roma to Firenze, earlier you buy, cheaper the rates and more seat availability."}, {"username": "Tricia Bean Scott", "comment_text": "Italo. https://\nwww.italotreno.i\nt/en/\nbooking-train-ti\ncket"}, {"username": "John Frahm", "comment_text": "I use trainline. And just bought 1st class tickets Venice to Rome on express train . 4hrs total time"}, {"username": "Cathryn Whitfield", "comment_text": "All my trains are booked for my October italy trip"}, {"username": "Debbie Fekete Gene", "comment_text": "Just did that jaunt and did Trenitalia and it went fast and wasn’t expensive. Read a book and before I knew it I was there. Booked 3 months ahead of time with no issues."}, {"username": "Andrea Chiasson-Landry", "comment_text": "Justin Landry"}, {"username": "Miyuki Kanno Paul", "comment_text": "It’s not early. Tickets are available now. Either Frecciarossa by Trenitalia or Italo"}, {"username": "Jenny Payne", "comment_text": "I only book Italo train company the day before as I go often . Don’t travel peck times as they are more expensive 🌻"}, {"username": "Mary Wallace Comunale", "comment_text": "Register for Italo with your email ( on app or website) they will send you discount codes for 20% off. We booked about 30 days before our October trip. If you look too early you won’t see the speed trains. You definitely want to speed train as opposed to the regional train."}, {"username": "John Kosir", "comment_text": "No it’s not. We already booked ours"}, {"username": "Brenda Posey Simon", "comment_text": "I booked all of our high-speed trains, in First/Business class, for our fall trip."}, {"username": "Patty Foster", "comment_text": "Someone told me they release new more options within 2 months of ticket day. Just what someone said. We are going in September so looking now. Yes, everyone talk’s business but I only see Super economy, economy, basic. 1st or 2nd class. I am only looking at the direct 2 train apps."}, {"username": "Stephen Rouse", "comment_text": "No"}, {"username": "Susan Ramirez", "comment_text": "I booked from Rome to Venice today."}, {"username": "Charmaine Tetkoskie", "comment_text": "Do high speed train. Business class"}, {"username": "Clint Fisher", "comment_text": "Will be over there then to"}, {"username": "Marcelaa Muñoz Casado", "comment_text": "Italo is the best"}, {"username": "Sheri Lichtenfels", "comment_text": "Book early as the prices are much cheaper. Be aware that they are not necessarily fully refundable. If you buy last minute the price goes up a lot. The more direct trains also book out ."}, {"username": "Kristen Taylor", "comment_text": "No - not too early. I booked a Florence to Rome for October 24."}, {"username": "Pong Ac Ai", "comment_text": "Frecciarosa"}, {"username": "Greg Baker", "comment_text": "Depending on how early you want to buy. Through Trenitalia in my experience you could start puchasing tickets 2 months ahead of date of you want to travel"}, {"username": "Cheryl Caferro Shul", "comment_text": "Following"}, {"username": "John Borgia", "comment_text": "No"}, {"username": "Karen Mitchell", "comment_text": "Booked ours today for the first of November."}, {"username": "Renae Larcus", "comment_text": "Tickets are usually available 60-90 days in advance. Check Trenitalia or Rome2Rio for best options"}, {"username": "SAsh Cox", "comment_text": "Italo"}]}, {"id": "2199336780465400", "text": "Just discovered this group, love how helpful everyone seems to be. Thought I’d share a relatively unknown event that is truly unique and I can’t recommend enough.\nCarnival, the days leading up to the Lenten season, is celebrated across Italy with each city having its own traditions. In the smaller town of Ivrea in Piemonte, Carnival means the Battles of The Oranges. A tradition set around the tale of a tyrant baron in the 13th century, he declared his right to jus primae noctis on the miller’s daughter, the Mugnaia. Once taken to the castle, however, the Mugnaia beheaded the baron and set off a revolt of the townspeople against the baron’s men.\nToday, for 3 days the townspeople, divided up into 9 groups of Aranceri (basically krewes for those familiar with Mardi Gras), battle “the baron’s men” who parade through the town in horse-drawn carts. The weapons for the battle: oranges. There’s a ton of other tradition and ceremony involved but I won’t make the post longer explaining it all, but highly recommend for a truly once in a lifetime experience.\n\nAs for logistics, Ivrea is an hour north of Turin by direct train. Naturally places to stay in town sell out far in advance, I stayed in Turin and just took the train each day. Ivrea itself is a beautiful town with history as a city going back to ancient Rome, though you’ll want to go before the madness of the celebrations to enjoy the city and its sites. Turin is also rather underrated so it was nice staying there and seeing what it has to offer, and another easily reached by train destination from there is Genoa, one of the most architecturally beautiful cities I’ve ever seen.", "link": "facebook.com/groups/1373361046396315/permalink/2199336780465400/", "likes": 34, "comments": [{"username": "Tracy Foss", "comment_text": "Thanks for sharing that it looks fabulous! I think I'm going to start researching before I decide on dates to travel I would love to see traditional customs"}, {"username": "Chloe Gallagher", "comment_text": "Nicole Gallagher"}, {"username": "Aaron Kincaid", "comment_text": "Tailor Kincaid"}]}, {"id": "2199332317132513", "text": "Lake Como-\nDoes the ferry get close enough to the Villas for a view as you go past? Wondering if it's worth a boat tour or if the ferry is sufficient. We will tour 1 villa at a stop, but would like to see others from the water. What is your recommendation?", "link": "facebook.com/groups/1373361046396315/permalink/2199332317132513/", "likes": 1, "comments": [{"username": "Fiona Jacobs", "comment_text": "We stayed in Como for 3 days and took a slow ferry ride to Bellagio. Relaxing and incredible scenery. Stopped at lots of villages around the lake. I'd suggest hopping off to explore (which we didn't) You can get pamphlets locating the various famous Villas and its fun spotting them."}, {"username": "Petra Mainetti", "comment_text": "Check these daily tours from Bellagio https://\nwww.bellagioboat\nservice.com/en/\ntour/\nshared-boat-tour\n-bellagio/"}, {"username": "Diana Morgan", "comment_text": "Diana Morgan"}, {"username": "Diana Morgan", "comment_text": "Diana Morgan"}, {"username": "Diana Morgan", "comment_text": "Diana Morgan"}, {"username": "Diana Morgan", "comment_text": "Diana Morgan"}, {"username": "Diana Morgan", "comment_text": "Diana Morgan"}, {"username": "Diana Morgan", "comment_text": "Bellagio water Limousines owned by Luca and his Australian wife Jenine a lovely couple."}]}, {"id": "2199329447132800", "text": "Where would be the best place for a hotel, I want to jump the train each day to Pisa, then another day to Florence and then another day to Lucca. Please can someone give me some advice. Am I best near the airport? Thank you in advance", "link": "facebook.com/groups/1373361046396315/permalink/2199329447132800/", "likes": 5, "comments": [{"username": "Steve Grossman", "comment_text": "The hotels in pisa are horrible. Stay in luca or florence"}, {"username": "Renae Larcus", "comment_text": "Stay in Florence. Hotel Roma right by the train station."}, {"username": "Robin Burrell", "comment_text": "From what town?"}, {"username": "Colleen Dawson", "comment_text": "I would suggest Florence, many options for day trips."}, {"username": "Lisa Quinn", "comment_text": "Agreed, stay in Florence, Pisa and Lucca are not that far from there. This was a lovely tiny little hotel right near Il Duomo. Safe area. ￼ Tons of cafés and really cheap.\n\nhttps://\nwww.relaisdelduo\nmo.it/\n\n10 minute walk to the train station and around the corner from Starbucks"}, {"username": "Eileen Muro", "comment_text": "We statyed here in Florence. Train station is across the street. It was perfect. Came in from Rome on the train to Florence. We took a day trip to Pisa and Viareggio yesterday and now on our way to Venice for 3 nights. Having the train station across the street was very convenient."}, {"username": "Fetchin Gretchen", "comment_text": "Use Florence as your base. Stay in Oltarno. Train station is easy walk."}, {"username": "Claire Stubbs", "comment_text": "Brill. Thank you all for taking the time to give me advice. It’s much appreciated"}, {"username": "Fiona Cameron", "comment_text": "Stay in Florence - train to all the other places from there. Great hotel near Florence SMN station - ALLORO BnB"}, {"username": "Janet Messanelli Bozzone", "comment_text": "Stay near the Santa Maria Novella train station in Florence. We usually stay at the Hotel Albani. 2 blocks from the train station."}]}, {"id": "2199328563799555", "text": "We saw some friends and in talking they mentioned a Food Tour excursion they took several years ago in Florence. This is not a cooking class but a tour eating several different items as you walk around the city and learn some history. It sounds like a lot of fun and was wondering if others here have taken such an excursion.", "link": "facebook.com/groups/1373361046396315/permalink/2199328563799555/", "likes": 7, "comments": [{"username": "Ruth Simmons", "comment_text": "We did a terrific one in Rome in May.\n\nRome walking tasting tour with SecretFoodTours\nSmall-Group Tour 11:00"}, {"username": "Dana Talusani", "comment_text": "Yes! It was a lot of fun! Ours was in the Trastevere district. Look on TripAdvisor for reviews and recs!"}, {"username": "Colleen Carollo Oxsalida", "comment_text": "Yes, we did a Foodie/\nCultural tour in Bologna and a Foodie tour with 4 stops in Verona."}, {"username": "Renae Larcus", "comment_text": "Check with Eating Europe. We did a food tour in Prague with them"}, {"username": "Miyuki Kanno Paul", "comment_text": "Market Tour by Judy Witts Francini at Divina Cucina"}, {"username": "April Scott", "comment_text": "https://\nwww.tripadvisor.\ncom/\nAttraction_Produ\ncts-g187895-zfg\n11868-Florence_\nTuscany.html"}, {"username": "Lisa Valdovinos", "comment_text": "We just did one in Rome. It was so much fun!!"}, {"username": "Paula Brink", "comment_text": "https://\ndevourtours.com/\ndestinations/\nitaly/florence/\n?utm_source=GMB&\nutm_medium=list\ning&utm_campaig\nn=GoogleReviews\n&cnt=CA"}, {"username": "Gaye Watkins", "comment_text": "We did this one in Florence. We booked thru TripAdvisor. Definitely spend the extra $$s for “small group”. It ended up being just the 2 of us!!!!"}, {"username": "Maureen Judice", "comment_text": "Cecile Broussard\nEileen Huval"}, {"username": "Josephine Rauch Rotunda", "comment_text": "Yes, we. Did one in Naples…so much fun, info and delicious food…plan to do one in Florence on my next trip\nthere!"}]}, {"id": "2199325403799871", "text": "Days 15-18 of my 3 week solo trip: Cinque Terre!\n\nCinque Terre was hands down my absolute favorite part of my trip but it started horribly.\n\nIf you remember my last post about Florence, you might recall my cell phone service completely crapped out on me. My poor mom back at home in NJ was trying to talk to verizon at all hours of the day and night to try to get them to fix the issues. We thought we had it solved... but it wasn't until I was on the train to La Spezia that I realized it wasn't fixed, my phone had only been working because of wifi. So I got to cinque terre still without service. I got to the airbnb (more on that in a second) and basically stayed there for SIX HOURS on the phone with verizon because if I left, I wouldn't have wifi and thus no way to talk to them. Eventually the representative told me there was nothing else they could do for me and that they'd elevate it to the next department... which would get back to me in 10-15 days 😑\n\nI may or may not have told the lady if I end up on the back of a milk carton, it would be her conscious.\n\nANYWHO.... 😅\n\nFrom La Spezia, getting the train to Cinque Terre was super easy. You can buy they train/trail pass online and avoid the line at the station.\n\nI prearranged with my airbnb host they he would meet me at the train station and he did. He walked me to the airbnb which was relatively easy to find (Riomaggiore by the marina). When we got there a lady from a unit above mine came up to me. She and her husband only spoke English and they couldn't get their stove to work... and the instructions were only in Italian. My airbnb host only spoke minimal English so as a group we all went up to their unit and I played translator between everyone (thank you duolingo) and eventually we figured out the stove situation.\n\nThe airbnb had a stunning view. It was perfect for just me. It COULD host six people (bunk beds) but I think it would be a little crammed.\n\nDuring my days in cinque terre, I spent time in each town. I think Riomaggiore was the perfect place for me to stay but I also enjoyed really Manarola. I spent one of my afternoons there swimming and jumping off the rocks.\n\nI also did the pesto making class at Nessun Dorma. It's the only food class I did during my trip because I kind of have it in my head that cooking classes are more fun with a plus 1. With that said, this was a great class. Very fun. I was a little bitter that everyone else got to trade off with their partners/group when it came time to beating the basil leaves... whereas I had to do it the whole time (it's exhausting lol). But the experience was definitely worth it. The owner has so much personality. We got to chatting about my trip and he ended up gifting me a free t-shirt.\n\nI also did a sunset boat tour... which I was lowkey disappointed in. The people on the tour were all very nice and friendly. But the guide assured me that swimming would be a big part of it and that I should run back up to my airbnb to change into a bathing suit (I arrived in a dress, but the meeting point was just outside my airbnb). I changed, we set off... and it was like pulling teeth to get anyone to swim. And it was basically a quick dip before we got back on the boat. Also I don't have many pictures from the boat because I had to leave my phone tucked away to avoid it getting wet. Everyone who had to sit at the front of the boat got drenched from the waves. Would I do another sunset tour? Yeah probably, but I'd consider a different company.\n\nI didn't get a chance to do the hiking trails becuase I didn't have enough room to pack the appropriate footwear. (Just another excuse to go back and visit again!)\n\nOh and one last personal note from this trip, at one point I stopped in a restaurant while they were setting up to ask a quick question. I got to talking to a waiter and he was super kind. Fast forward several hours later and I walked past the restaurant and all of a sudden I hear \"Kristen Amore!\" I looked around and the waiter had called out (causing multiple people to look at him and thus me) and held up heart hands 😅 it was very cute. We never hung out though cause I was leaving the next day.\n\nI'm probably missing a lot of things. Cliffnotes: good pesto, fun water activities, gorgeous views, would definitely return.", "link": "facebook.com/groups/1373361046396315/permalink/2199325403799871/", "likes": 386, "comments": [{"username": "Martha Jayne Frew Thompson", "comment_text": "Another round of spectacular photos and a great narrative. Well done, Kristen!"}, {"username": "Patricia Chavez", "comment_text": "Wow!!\nThanks for sharing your experiences.\nCan you share your information on your Restaurants.\nIt all looks delicious.\nAwesome Photos!! Thanks"}, {"username": "Michelle Cotoni", "comment_text": "Who snapped all the great photos of you?"}, {"username": "Lisa Hry", "comment_text": "What a wonderful post\nBeautiful photos"}, {"username": "Martin-John Rubio", "comment_text": "I travel solo as well …my 2big differences are that I’m a guy and I tend to go in winter to avoid the summer crowds…\nWell done 👍🏽 Kristen Beatty😊"}, {"username": "Patsy Luque Mejia", "comment_text": "Great pictures! Kristen, we have reserved the Pesto class for 1:30 mid-August. How early do you recommend that we line up to get seating by the rail? Thanks 😊"}, {"username": "Masha Negri", "comment_text": "I love that you travel alone, and truly enjoy it.…"}, {"username": "Claudia Amp", "comment_text": "Just thinking of how someone is going to steal these pics and flex them as theirs on Tinder or some place like that 🤣"}, {"username": "Jocelyn Blanke Sia", "comment_text": "Ohhhhhh, you have to go back for a date now!! You can’t leave it at that. Lol"}, {"username": "Manuela Bussler Sweeney", "comment_text": "Your photos are very nice. I hope your phone is OK again. Good thing you had a camera with you too or used your phone for photos. Gotta have the photos 😀"}, {"username": "Rich Gonzales", "comment_text": "Wow Kristen, thank you for sharing...Stay safe my friend, Rich from Pacific Heights District San Francisco, CA"}, {"username": "Teresa Rivero", "comment_text": "Very nice photos!\n❤️🇮🇹"}, {"username": "Arnie Lagadia", "comment_text": "Awesome pictures!"}, {"username": "Susan Streed McNaughton", "comment_text": "Awesome!!"}, {"username": "Zoltán Varga", "comment_text": "Perfect trip.. 👍🥂"}, {"username": "Jerry Kiger", "comment_text": "Looks like so much fun … question — I plan to go July/Aug … since you are there how much “fun” can you do on the fly Vs pre-plan prior? I want to plan the trip but also enjoy sites on the fly … are there things to do once at a site or most booked up, if that makes sense? Thank you for any input"}, {"username": "Lori Winchell Crestfield", "comment_text": "What would you consider the proper hiking shoes for Cinque Terre?"}, {"username": "Graham Sherlock", "comment_text": "CT is gorgeous, so much better than the Amalfi Coast"}, {"username": "Lisa Jones", "comment_text": "Great photos! What an adventure you are having 💕😀"}, {"username": "Carolyn Balding", "comment_text": "Photos beautiful, thanks"}, {"username": "Tina Roberts", "comment_text": "It looks amazing 🤩 which Airbnb did you use?"}, {"username": "Celine Deng", "comment_text": "Love Cinque Terre"}, {"username": "Alexandra Roberts", "comment_text": "Oh I love this! I’m going on my first solo trip next May for 3 weeks with a similar itinerary apart from Verona. This makes me so excited! I kind reading your stories!"}, {"username": "Jaime Cleek", "comment_text": "With your cell service that just stopped working, was it with losing the ability to imessage or did it just completely stop working ? Did you get the travel plan through Verizon or did you have an eSim etc?"}, {"username": "Caterina Liparota Ciaffaglione", "comment_text": "Beautiful pics. 🥰❤️"}, {"username": "Bethany Morrow", "comment_text": "Great post, Kristen Beatty! I'm going to call Verizon today to o get my service checked and added for my trip. My husband and I will be in Cinque Terre soon. I'm sure I will want to go back to Italy as soon as we get back to the USA. Keep me in mind for a travel buddy! I did a lot of solo travel before I got married, and it can be fun, but definitely more fun with travel buddies. Enjoy the rest of your time in Italy!"}, {"username": "Yvett Villalon-Hernandez", "comment_text": "Awesome pictures! And great storytelling! 😊"}, {"username": "Maria Butta Cipriano", "comment_text": "Love this!❤️What restaurant did you eat in , the antipasto and pizza look amazing."}, {"username": "Lauren Saponaro", "comment_text": "Jersey girl!"}, {"username": "Denise Incandela Boccio", "comment_text": "Awesome pictures! Thanks for sharing!🇮🇹"}, {"username": "Carly Botelho", "comment_text": "Kristen ….great pics and your journaling was a delight to read!! 😊👍"}, {"username": "Zelda Sanchez-Kamath", "comment_text": "Thank you for providing info about Verizon’s service."}, {"username": "Shelly Ranck", "comment_text": "Love it! Could you share your Airbnb info?"}, {"username": "Tammy Jo", "comment_text": "Wonderful pictures"}]}, {"id": "2199324617133283", "text": "I noticed most of the sites that I will visit are actually all walkable without ferry ride.\nexcept these 2, which I am wondering if I can just see them from across and not have to stop by? we kind of really like to walk around since we are there for a whole day (and we will not go to the 2 islands)\nSan Giorgio Maggiore\nSanta Maria della Salute church\nor maybe for the second one I can walk from St marco to the Accademia Bridge, then 10 mins walk?\n\n\nthanks!!", "link": "facebook.com/groups/1373361046396315/permalink/2199324617133283/", "likes": 0, "comments": [{"username": "Ruth Simmons", "comment_text": "San Giorgio Maggiore is easily accessible using the vaporetto, we bought a ticket near St Marco and it’s the first stop. We went through the church and paid to go up the bell tower. It has beautiful views for 360 degrees! We then took the vaporetto going all the way around Venice, and back down through the Grand Canal, it was wonderful!"}]}, {"id": "2199320347133710", "text": "Planning on visiting the Dolomites to hike in early June next year, but I’ve seen 2 completely different opinions on Google. Some say to avoid it at that time while others say it’s beautiful then.\nWondering what any of you think! Thanks in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2199320347133710/", "likes": 1, "comments": [{"username": "Ingrid Zancoli", "comment_text": "At the beginning of June it may be more rainy than in full summer..."}, {"username": "Tina Petraglia", "comment_text": "I spent a summer there as a nanny in a small town called Predazzo, a province of Trento. I didn’t do much hiking because I was with small children, but I did visit the neighboring small towns, such as Cavalese, and took the funivia up the mountains where the temperatures were much cooler and the nature was spectacular."}, {"username": "Connie Wilson", "comment_text": "We love visiting the mountains in June. That said, if there is a late snowfall like this year, some higher trails and lifts may still be closed. Still better than the crowds in July and August."}, {"username": "Genevieve Bastien", "comment_text": "My sister is there now\nStaying in San Cassiano\nThere is a little bit of rain and fog in the mountains so far\nBut it’s beautiful apparently :)"}, {"username": "Olga Plitt", "comment_text": "I hiked Dolomites on sept.2021. Been to other hikes and till now its the most beautiful hike I've done.. I highly recommend it."}, {"username": "Lisa Abrams Argento", "comment_text": "We were just there the second week of June and it was beautiful. We stayed in Silva Val De Gardina."}, {"username": "Tori Gardner", "comment_text": "We went up May 24-26. We stayed in Lajen and hiked alpe di siusi. It was definitely a little early, but still so amazing and I’d do it again. First or second week of June should be nice!"}, {"username": "Steph Craddock", "comment_text": "The alpine meadows are best in June. High up you may find snow patches still. And alway aim to be back in the valley by mid-afternoon as afternoon storm are common in June."}, {"username": "Rob Den Haan", "comment_text": "We live in the Dolomites and early June its beautiful. But because its not tourist season yet the mountain huts are still closed and so are some restaurants etc. But if you like quiet and beautiful..."}, {"username": "Manuela Bonazzi", "comment_text": "Dipende dall'anno,può piovere molto a inizio giugno e quindi ci può essere parecchio freddo e ancora neve in giro. Solo una questione di fortuna."}]}, {"id": "2199320113800400", "text": "Morning from Sydney Australia 🇦🇺\nInitial planning any feedback would be welcome 🤗.\nJune 2024\n\nArrive in Split x 4 days\nSplit to Athens x 4 days\nAthens to Naxos x 4 days\nNaxos to Santorini 4-5 days\nSantorini to Bari x 2 days\nCosenza to Tropea x 6 days\nTropea to Rome x 3 days\nHome 🏡", "link": "facebook.com/groups/1373361046396315/permalink/2199320113800400/", "likes": 0, "comments": []}, {"id": "2199319907133754", "text": "Will be arriving in Rome around 12 noon. Planning to head to Naples the next day via train and take the bus from there to Sorrento. We're staying just overnight in Rome to rest from our long flight and hopefully just see a bit of the sights in the afternoon assuming we can be in the city by 3 or 4 pm after going through customs, getting ourआणखी luggages and taking the train into the city. Which area/neighborhood would be best for us to stay overnight in, somewhere that makes it easy to get to the train station early morning, as well as get a feel for Rome when we arrive in the afternoon? We're going back there at the end of the trip for 5 days so it's not important for us to hit major sights the day we land. We're not trying to see all of the city in one afternoon just to be clear. Just need a place to relax in a bit after the long travel, and have a good dinner. Maybe have a nice late afternoon or night time stroll.", "link": "facebook.com/groups/1373361046396315/permalink/2199319907133754/", "likes": 1, "comments": [{"username": "Gayle Moores", "comment_text": "Stay in the Piazza Navona, Pantheon area. It is central and close to the Trevi Fountain. Very walkable and not far from the Rome Termini train station."}, {"username": "Cecilia Christine Costantini", "comment_text": "Just stay next to the train Station. You can see Santa Maria Maggiore Basilica and then walk down via Nazionale, have an icecream and reach Colosseo and Via dei Fori Imperiali in 20 minutes. Then everything is really close in the city center (Fontana di Trevi, Pantheon, Piazza Navona ...)."}, {"username": "Romina Lauretig Toscano", "comment_text": "Aventino Hill (metro circo massimo). Check aventino group hotels."}, {"username": "Jenny Payne", "comment_text": "Hope you have book your overnight accommodation 🌻"}, {"username": "Dave Conroy", "comment_text": "I haven't been to Rome yet, but in your circumstances, in any city, I would look to stay close to the drop-off from the airport and the rail station. Once you've dropped stuff off, will be easier transport-wise to go to and back from a nicer place or a recommended site and food. Minimise time wasted, easy in and out the next day."}, {"username": "Valerie Collanton", "comment_text": "Eitch Borromini is a great hotel right behind Piazza Navona."}, {"username": "Kim Aranha", "comment_text": "Stay in the Piazza Navona area - super Rome feeling and absolutely beautiful"}, {"username": "Rhona OConnor", "comment_text": "Stay beside the train station. That works for the next day too. I did a few train journeys and it worked out well for me."}, {"username": "Nancy Day", "comment_text": "Reading this sight I'd take a golf cart tour for a few hours"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2199318407133904", "text": "Lago di Braies today 😀", "link": "facebook.com/groups/1373361046396315/permalink/2199318407133904/", "likes": 11, "comments": [{"username": "Vanessa Bryant", "comment_text": "Vanessa Bryant"}, {"username": "Nuno João Teixeira", "comment_text": "Manuela Fernandes"}]}, {"id": "2199316493800762", "text": "Hello Everyone 🙌\nI am planning a trip for June / July next year. There will be my husband, our 2 year old and myself. We have 4-5 weeks It feels like a lot of ground to cover so would like to know what’s worthआणखी seeing and what’s not worth the hype.\nI would also love advice on how long to stay in each area and the best form of transport to get around and take in the beauty.\n\nStops in Italy: Como, Milan, Tuscany, Florence, Amalfi Cost, Sicily (Scopello)\n\nThank you in advance, I have found the advice on this page valuable 🍝🙏", "link": "facebook.com/groups/1373361046396315/permalink/2199316493800762/", "likes": 189, "comments": [{"username": "Nicci AD", "comment_text": "I would trade Milan and Como for Venice. Main cities 3 days each to allow park time as well as art/soaking up the atmosphere. Sicily next time, Spain & France next time (do a Med cruise). Definitely not July August for yourselves but esp child too hot & crotchetty!"}, {"username": "Danielle van der Meer", "comment_text": "Oude centrum pompei en vesuvius, with beach"}, {"username": "Becky Gal", "comment_text": "Monte baldo and lake garda are amazing, not on your list of places but lago di fusine in udine district is amazing"}, {"username": "Claudia Callisto", "comment_text": "Too hot for this type of extensive trip with a 2 year old .. I have done it and never again .. the stairs alone in Italy are hard to tackle"}, {"username": "Helen White", "comment_text": "My best places/ must go’s are -\n\nBeaches between Cap D’Adge and Sete,\nEze (not Eze plage, the village up high in the hills it is spectacular)\nNice old town\nMenton - stunning sea side town right next to Italian border\nPortofino - is very touristy but stunning\nBellagio and hop on the ferries and town hop in Como, the Hotel Metropole terrace is fabulous for people watching and the buzz of the place\nMain square & Duomo in Florence\nIf you get time you really must go to Siena - it’s very very beautiful, especially Piazza Del Campo\nI would also squeeze in a visit to Lago D’Iseo and Lake Garda whilst you are that way. Lake Iseo is far less touristy and Lake Garda is just magnificent.\nWhat an incredible road trip!"}, {"username": "Mary Galea Suntovski", "comment_text": "Fiona O'Donnell"}, {"username": "Miriam Christian", "comment_text": "Sicily alone, if you want to really experience it, will take 2 weeks"}, {"username": "Shauna Elliott", "comment_text": "In June/July/\nAugust, remember that the whole of the northern hemisphere is on their Summer break. If you must travel then, book things well in advance or you simply will miss out. It’s also very hot, so you will need to take extra care."}, {"username": "Aleta de Waal", "comment_text": "Earth Trekkers is a family with their own website and all the information you want . Just take a look !"}, {"username": "Aleta de Waal", "comment_text": "Did a day tour fron Barcelona to Gerona , Pal and the Caldera and also a day tour ( 3 Countries) to Andorra , Themes , B... something , Wonderful and so easy by bus . Used Tripadvisor a lot ! Barcelona is one of my favourite cities ! When you visit Nice or Monaco , be sure to visit St Paul de Vence , Eze and Antibes . We used ITALY TOURS for small groups , they are excellent excellent especially in Florence and Pisa , Rome and Pompeii."}, {"username": "Linda Caponegro", "comment_text": "Italy is a beautiful country but it is incredibly hot and crowded in June and July. Many are now traveling now as traveling was difficult during Covid.\n\nI spent a summer in Italy years ago and again last summer. The crowds this past visit was more than tripled which made it were incredibly difficult to visit museums and get a table in restaurants in a reasonable amount of time. Try to visit smaller towns/villages so you may experience ￼the wonderful hospitality, culture, and foods of this amazing country.\n\nThink about traveling by train if your next stop requires a long drive. We loved traveling by train. You can relax, not worry about stopping for gas, and just enjoy the ride. Remember, when you rent a car there is always the concern of what to do if you have engine problems.\n\nHave the best time of your life!"}, {"username": "Faye Laird", "comment_text": "You've missed of Venice 😳"}, {"username": "Barb Aieta Osterberg Martin", "comment_text": "a pretty hefty endeavor!!! and with a two year old!! mamma mia! looks like you better drive!!\ngo from St Jean to Lake Como then south to avoid doubling back from Como; i always avoid doubling back"}, {"username": "Sidsel Hauge", "comment_text": "You could consider going from provence to the lakes (Maggiore is very pretty too) and then go cinque terre on the way south in Liguria that part of the region is much prettier than towards France - Portovenere is a nice smaller town in the southern most part of the area and less touristy than the five - doesn’t seem like a big detour from your itinerary - and then go Bologna/\nFlorence after."}, {"username": "Sidsel Hauge", "comment_text": "And south of Amalfi visit the old Greek town of paestum and the huge Christ statue in Maratea"}, {"username": "Lynn Brusky Stabler", "comment_text": "I’ve stayed on the Amalfi coast, Rome, Florence, and Assisi. Would go back to any of these places.\nIf you have time, check out the BLUE GROTTO."}, {"username": "Caterina Pisani", "comment_text": "The best period to visit the Italy is from April to July and from September to October. It is less expensive and there aren't many tourists."}, {"username": "Nello Vitiello", "comment_text": "Mere Keegan hello as an Italian who lives in Italy I am delighted that you want to visit our country. We Italians (unfortunately)\ndo not know that we are so lucky. For the trip, I advise you to use the means of transport more in the northern part of the country up to Florence. In southern Italy I recommend the car (the means of transport are not efficient). If your trip is for cultural purposes, I suggest you stop more in the cities of: Milan, Venice, Florence, Rome, Naples (Vesuvius).\nIf the aim is landscapes and the sea: Liguria (Alassio, Portofino), Lake Como, the Amalfi coast, Puglia (Salento) and Sicily.\nbut as someone has already advised you, I would do Sicily on a next trip, perhaps combining it with a visit to Sardinia (even if the prices are very high).\nEnjoy our country more than we do. Sorry for my English."}, {"username": "Carlee Polisena Seelbach", "comment_text": "Buca Mario for dinner in Florence. AMAZING! Florentine beef is to die for. You need a reservation here so have your concierge or someone capable do this for you asap. 👍🏻"}, {"username": "Lonneke Smits", "comment_text": "Nice, but I think you should really do Naples instead of the Amalficoast. We haven been there last week. Naples is beautiful, i think the Amalficoast is a little bit overrated. I think it is nice to see it, but make a boat trip and then you have seen the most."}, {"username": "Diane Lesczynski Staples", "comment_text": "I agree. 1 day in milan"}, {"username": "Emma Nightingale", "comment_text": "If you're going up North, the Dolomites are absolutely incredible."}, {"username": "Katarína Nazarejová", "comment_text": "In Sicily you must see Taormina and San Vito"}, {"username": "Merche Fernández Monclús", "comment_text": "A mi modo de ver. Florencia necesita dos días . Como y Lago Magiore tres días, sobretodo por ver Isola Bella. La Toscana lo que tú quieras, es mucho por ver y Milán dos o tres días. En la costa Amalfitana y Sicilia no he estado pero hay mucho que ver por lo que tengo entendido. Y te has dejado cinquè Terre, cerca de Milán y vale la pena pasar un par de días"}, {"username": "Suzy Fanucci Schmidt", "comment_text": "the Veiled Christ in historic center Naples!!"}, {"username": "Betsy Malone", "comment_text": "Don’t skip Venice💕"}, {"username": "Nataly Wildheart", "comment_text": "It is a lot, I have been in most of the places ….well you did put a lot of stops..it is nice, but sometimes you need to stay 1-2-3 nights to « discover the place «, plus with a kid it is also a bit different time wise . I definitely recommends to shorter it a bit maybe and focus on what you would like to see & do. Maybe Focus on Italy and do just Barcelona, Cap Ferret.."}, {"username": "Giorgia Spaggiari", "comment_text": "I would suggest a stop in Turin, Italy. Beautiful city"}, {"username": "Anna Kogan", "comment_text": "For como: do seaplane to look at lake como from above ( book beforehand ) and rent a boat for 4 hrs ( get some wine/ pizza on board ) and just explore the lake yourself ( do not need boating license ) ."}, {"username": "Petra Ielegems", "comment_text": "Wow. We had 2 weeks and only did Puglia and didn’t see everything we wanted. I think you’ll spend a lot of time in the car with this busy schedule."}, {"username": "Piumi Imansa", "comment_text": "Thank you for the information"}, {"username": "Alistair Ford", "comment_text": "Siennas cool, near Florence. Cinque Terre too touristy and 500euro fines for stopping to take selfish,so much congestion."}, {"username": "Alexander Martreb", "comment_text": "What is written is very good.. but exclude Milan, except Duomo and Scala and Galeria there is nothing to see.. exclude Palma in Spain.. stay only in Italy.. Como.. San Remo.. Cinque Terre… Venezia.. Firenze… Roma… Amalfi… Taormina… Etna… Check out on Google my suggest.. this is perfect… if you like at least to change the country.. go to Dubrovnik.. via Ship from your last stop in Sicily… Have fun 🤩👍👌 cheers Alex"}, {"username": "Ann Catherine", "comment_text": "Following"}, {"username": "Marlene Bertino Randolph", "comment_text": "Plenty of amazing towns in Tuscany. Siena is my fave 😊. I also love Ortigia/\nSiracusa and Taormina in Sicily."}, {"username": "Nicole Aure", "comment_text": "Nicole Aure"}, {"username": "Christina Tsepenzis", "comment_text": "F"}, {"username": "Iris Negron", "comment_text": "Considera las altas temperaturas durante ese tiempo."}, {"username": "Cathy Amicarelli Wayne", "comment_text": "Hi Mere...I just sent you a friend request. I have both lived in and traveled in Italy and would be happy to give you some suggestions."}, {"username": "Malathi Ananthakrishnan", "comment_text": "When my kids were little (before school age), we tried to travel in the off season."}, {"username": "Nazareno Feliciani", "comment_text": "Da la vuelta a Italia x la nacionales en auto y paras en todas las vistas como hice yo 20 años atrás hasta sicilia"}, {"username": "Jun Cee", "comment_text": "Milan was disappointing. It is able to successfully portray its over the top pretentious charmless image while being overwhelmingly filthy and graffiti-riddle\nd. Use it only as a passthrough to the Lake Como area, which is fantastic."}, {"username": "Juliet Deseo", "comment_text": "With all the recommendation,\nalso think that you are traveling in the heat of summer with a 2 yr old."}, {"username": "Sylvana Micallef", "comment_text": "Don't forget to come and visit Malta and Gozo while in Sicily. In one and a half hour you will be in Malta from Sicily with the catamaran. Come and visit our island in the middle of the Mediterranean. You will sure love it."}, {"username": "Audrey Lynn", "comment_text": "We have just come back from 4 weeks in Italy.\nWe visited Rome, Bologna, Florence, Tuscany (incl surrounding area) Ancona, Trani, Bari, Amalfi, Naples and back to Rome.\nWe used mixture of car hire and train.\nWe would definelty do more train travel next time (it was so quick and efficient and less stressful than the car... tolls, parking, petrol punctures!!)\nIn saying that, car hire lets you explore outlying areas and be more flexible....whi\nch was worth it.\nJuly is soooo hot though and the humidity is very high.\nWe found this limited what we planned to do each day.\nWe retreated back to accommodation in the afternoon.\nRemember a lot of the streets are cobbled and are steep or have steps...conside\nr this for strollers? (And / or suitcases!!)\nSome of the villages in Tuscany (with car hire) are stunning and worth a visit (early - parking gets limited) = Sienna, San Gimigano where amongst our favs.\nWe found Trani a hidden gem (if going east) - stay central - feels more like a greek fishing village 🙂\nAmalfi....you dont want to drive here!! (catch buses/trains/\nferries)\n\nHighlights for us Bolonga (great food scene and compact for walking/\nexploring) & Trani.\nThese areas where less crowded in the peak season."}, {"username": "Ellen Stigum", "comment_text": "Why that big curve to go to Lago di Como? Go right up throught Piemonte instead.\n\nNot advisable to drive the Amalfi coast in July. Very narrow road, lot of traffic, no parking. Go to Salerno, park there and go by boat to see Amalfi and Positano. Bus or taxi up from Amalfi to Ravello, the most beautiful town, with magic views.\n\nYou will probably not want to go that far. Sicily is big, save that for another trip. And\nhonestly, even without it, this trip is not very suited for a 2 year old...."}, {"username": "Kim Moses", "comment_text": "I would do Rome and skip Milan. Love the smaller areas."}, {"username": "Michela Zanni", "comment_text": "Scopello Is not on the East coast of sicily. And Como Is overrated"}, {"username": "Annamaria Emme", "comment_text": "I would start the trip in June from Sicily. In July the weather is too hot."}, {"username": "Carole Kucharski", "comment_text": "Is this all by car?"}, {"username": "Belinda Ford", "comment_text": "Where are you planning to start? Also are you doing a self drive?"}, {"username": "Greg Tunks", "comment_text": "Looks like too much territory to cover within your time frame for me, you need 4 to 5 days in each place as a minimum plus a lot of driving you need to do"}, {"username": "Plodder Mendoza", "comment_text": "All Perfect spots.❤️🇮🇹"}, {"username": "Debbie Bell", "comment_text": "I live in Le Marche....if you want non touristy, old Italy and people who speak Italian! Hilltop towns, great traditional food and cheap!"}, {"username": "Shirley L. Kerr", "comment_text": "Decades ago there was a theory..never less than three nights anywhere. Looking back, it did work. I've been most of the places you're considering. I'd mix it up..a big city, a small place, somewhere longer to sort of get to know, another destination for just long enough for a taste. Maybe do a trial run several months before the trip to see what kind of pacing works with your child. I've used trains on multiple trips in these countries...the\ny are often superb."}, {"username": "Alberto Bagnara", "comment_text": "Massimiliano Carli il turismo"}, {"username": "Katie Barnicle Ashby", "comment_text": "Check out atlas obscura. They have cool things to check out!"}, {"username": "Amber Simon", "comment_text": "We went from Naples to Amalfi then down to Sicily via Tropea which was lovely. We then did the top half of Sicily (Taormina, Aeolian Islands, Trapani, Egadi Islands and Palermo.) It was a great trip, we got around mainly via trains and ferries. We stayed at most places two nights. If I did it again, I would stay 3+ more at most places so it’s not as rushed."}, {"username": "Sherri Semones Cordle", "comment_text": "Jace McBride"}, {"username": "Lianna Morrison", "comment_text": "Following 🙂"}, {"username": "Dana Hubby", "comment_text": "first: go in may-june. by july the holidays in most european countries have started and it will be packen. may-june is pre-season"}, {"username": "Giuseppe Pino Lombardo", "comment_text": "If you want to go in Spain, after the Sicily, don't pass in Liguria. Maybe you stay a week on queue on highways."}, {"username": "Stefanie Mehr", "comment_text": "This is quite a huge trip.\nYou won’t be able to stay for more than 2 days one one place.\nLast year we did a similar trip from the north (Milano/Como) over the Tuscany to Naples and the Amalfi to the other side (Adria) and all the way down in Puglia to Speccia and back through Italia Umbria/Marken to Getmany. It was a three weeks trip.\nMaybe you decide also make sicila and maybe the Golf of Naples and a bit of Liguria would work.\n\nBut to make the Cote Azur ‘till Barcelona and to Mallorca, you’ll have been to the probably most beautiful places but without seen them. I would say go twice.\n\nIn Europe is much more concentrated, less countryside than f. E. in the USA. It means there is much more to see in hundred km than in the USA, because it’s not so wide.\n\nBest wishes"}, {"username": "Val Haigh", "comment_text": "Don’t miss Verona and try to see a performance at the Arena …. Breathtaking"}, {"username": "Wilfred J Wells", "comment_text": "Thank you for sharing!! Enjoy!"}, {"username": "Fiona Sligo-Young", "comment_text": "Try to include Sienna in your Tuscany trip."}, {"username": "Alessia Pastondi", "comment_text": "Hi! I’m from Italy, I’ll probably skip Milan, or just use 1 day for it. Florence absolutely yes and in Tuscany you need to visit val d’orcia or Creste Senesi, which have the typical tuscanian landscapes. In Sicily I would recommend Palermo 1 or 2 days with Mondello and San Vito Lo Capo ❤️ enjoy! 😍"}, {"username": "Brittany Michelle Meilinger", "comment_text": "Following!"}, {"username": "Edward Enriquez", "comment_text": "Trains and ferries unless you really like driving. Driving gives you much more flexibility for spontaneous stops and meals. Have done all, roads are usually very well kept and not too difficult to navigate, except for the big cities or the historic zones where driving is severely restricted but you may find yourself there by accident. Looks like a great route and plenty of time. You can try all transportation options for parts of the trip."}, {"username": "Michele Taylor", "comment_text": "Learn Italian it helps"}, {"username": "Vanessa Mulquiney", "comment_text": "Keep Sicily for a separate trip especially this time of year with a child ."}, {"username": "Helena Branco", "comment_text": "no need to spend much time in Milano - there is just the square and its beautiful Duomo, the rest is worth. When you are in Florence, if you have time, visit Siena, amazing"}, {"username": "Jenny Killworth", "comment_text": "F"}, {"username": "Deanna Fagliarone", "comment_text": "All I am going to say is do not go in July or August. I just came back from 6 days there and it was so hot I was miserable. I never sweated so much in all my life."}, {"username": "Misha Doherty", "comment_text": "Drove from rome to south of Spain other day😅 heat was mental was meant to stay for a while took 28 hours straight to drive from rome to Alicante in Spain roads are good if you pay for the tolls can be a bit expensive"}, {"username": "Earl Kneeland", "comment_text": "You have listed some nice locations. Here’s some other recommendations\nto consider: Island of Capri and the Blue Grotto are absolutely beautiful. San Gimignano has sone awesome history and fantastic wineries and Cinque terra is incredible as is Venice! Enjoy, it’s my favorite vacation destination! 👍🏻"}, {"username": "Alla Shmulevich", "comment_text": "June, July and August the worst time to be in Italy specially with a baby. Very hot and packed with tourists"}, {"username": "Carlo Charlie Bertone", "comment_text": "If its your first time in Italy you can’t skip Rome imho, i would skip Sicily and do the stops in Italy like this (since you’re coming from France)\n2 days (1 night) Ligurian coast\n1 day Milan\n1 day Como\n2 days Florence\n4 Days Rome (there is a lot to see)\n3 days Amalfi coast"}, {"username": "Pitner Peals", "comment_text": "Palio in sienna . Visit Lucca . you will love it there."}, {"username": "Bob Makowski", "comment_text": "Make sure you apply for a visa before travel."}, {"username": "Sonia Ivanovski", "comment_text": "You are travelling with 2y. Less is better."}, {"username": "Donna Damon-Scarinza", "comment_text": "We did 3 weeks once in October and it rained for at least 7 to 8 days. During that trip we hit every popular area by flying into Milan 1 day caught a train to Venice and had a hotel (Doge Palace) for 2 days then rented a car and traveled everywhere ending up leaving out of Rome. We did not have any hotel reservations just drove until it started to get dark then looked for a clean Albergo (motel) and they were always clean and very reasonable in price. We did not do the autostrata (freeway since you had to pay every time you get on and off and I video taped our entire trip and rail was in the way to get good pics). We went through little town and villages and really got to see the countryside. The second time we went first week of May before tourist season and got the best rates for our places to stay. We flew into Rome and went to Puglia region, spent about 10 days in Tuscany and Umbria region. We even stayed in 2 villas in the wine country and partied with the locals when the gio de Italia (bicycle racing) was going on. Our very favorite place was Sorrento which is fairly close to Amalfi Coast and ended up staying there for 2.5 days. You can do Pompei, Capri also. You are on the ocean but you dont pay the high costs of Italian Riviera area. Cinque Terra area was also beautiful. Siena on the way to Tuscany. We did not do the typical tourist restaurants which was so much fun trying to communicate and order off the menu. They did not speak English. The food there is the greatest and I dont eat cheese (formagio). The best trips we have ever been on. It was a little scarry when my husband had to drive in the big cities such as Rome, Milan, Genoa. Assisi was beautiful. Scarry driving around Perugia."}, {"username": "Mere Keegan", "comment_text": "Richard Clark"}, {"username": "Tara Farr", "comment_text": "Following"}, {"username": "Jens Gehlert - SirGusto", "comment_text": "Dont make what i call the „american mistake“ and miss out the very best region. South Piedmont/\nLanghe Region. Barolo Wine, Truffels. UNESCO world heritage. One of the most beautiful regions in Europe."}, {"username": "Randy Webb", "comment_text": "The Galleria dell’Accademia – or Accademia Gallery – in Florence, Italy, is without a doubt most famous for its sculptures by the great Renaissance artist, Michelangelo. His Prisoners (or Slaves), his St. Matthew and, above all, the magnificent statue of David within the Tribune… don’t miss it!"}, {"username": "Donna Marie Mcclint", "comment_text": "Following"}, {"username": "Jane Rump Moreschi", "comment_text": "Lake Iseo!"}, {"username": "Nicole Musto", "comment_text": "Following"}, {"username": "Katja Gürster", "comment_text": "San Gimignano and Volterra, very nice places"}, {"username": "Rachael Murphy", "comment_text": "Following"}, {"username": "Mihaela Radu Cartojan", "comment_text": "Alberobello, The Amalfi Coast, Florence, Bolzano and everything in between. As far as how many days in each place, I'd play it by ear, especially with a 2 yrs old"}, {"username": "Fabio Guglielmi", "comment_text": "If you skip Rome when heading from Tuscany to Amalfi coast you should have a go to Abruzzo...\nIt's one hour drive from Rome, eastbound (the two highways you see on the map) and you will be nicely surprised: three National Parks in the region, beautiful nature, wild landscapes and great food!\nPlaces to see? Day 1 Rocca Calascio, Gran Sasso National Park, Campo Imperatore, and then day 2 you can have a try to Abruzzo, Lazio and Molise National Park and drive through Anversa, Gole del Sagittario, Scanno Lake, Pescasseroli, Barrea, Altipiano delle Cinque Miglia, Sulmona..."}, {"username": "Angela Mohr Johnson", "comment_text": "Following"}, {"username": "Marzia Jenny Rita Vanella", "comment_text": "Hello, I'm Italian l, living in Sicily. Skip Milan and focus on the other cities as Rome and Florence....but\nnot too much... As it's boiling in July you may want to go to the beach. Puglia and Sicily are just perfect. Please note that Scopello (which is gorgeous) is not there (not in the middle of Sicily) but on the coast. In Sicily you should go to Taormina and Siracusa at least. ( the island is amazing but it is worth another visit to see Palermo, Catania, Noto, Ragusa...). Feel free to ask whatever you want."}, {"username": "La Eli", "comment_text": "Banalissimo percorso. C'è tanto altro da scoprire in Italia. Ma forse è meglio così, le chicche le teniamo per chi ha voglia di approfondire il nostro stile di vita al di là degli stereotipi."}, {"username": "Annica Westin", "comment_text": "Following"}, {"username": "Dale Rheyn-Ben", "comment_text": "F"}, {"username": "Seamus Finn", "comment_text": "Following"}, {"username": "Jackie Mann", "comment_text": "I'm doing a similar trip, arrive Bari Airport head to Alberobello (visit Brindisi, Lecce and Toranto) 4 nights. Leave visit Matera en route to Pertosa caves, stop in Potenza. Continue to Ravello for 4 nights visit (Pompeii, Positano, vesuvius Naples) leave and visit Pastena caves and head towards Cervete for 4 nights (visit Rome) leave and head to Sienna, stopping at Grosseto on the way (night) stay in Sienna 4 nights. Visit San Gimignano, head to Florence (maybe overnight) before going to Rimini for 3 nights (visit minature village, see cave restaurant and gola d furlo) leave Rimini, head to Spello 5 nights (visit Assisi, Cortona and Orvieto) on last day visit Marmore falls on way to airport. The next trip I will do top half (Garda, Sirmione, Verona, Venice, Cinque terre etc)"}, {"username": "Jasmine Davidson", "comment_text": "F"}, {"username": "Iolanda Buzzetti", "comment_text": "Don.t forget Lago di Garda\nSIMPLY beautiful"}, {"username": "Outi Saarno", "comment_text": "Just came yesterday back home from our trip to Italy with a toddler (1y and 10m). Even though it was crazy heat wave and busy tourist month, we loved the first trip with our daughter to our favorite country 🥰 I believe it’s matter of your own attitude and taking it on childs pace and needs first. Of course Italians also love children and in many places take them in consideration very nicely (for example food was delivered very quickly for her in restaurants).\n\nWe travelled around Emilia-Romagna and Toscana with rental car. This was a must in the heat having the air conditioning! Would recommend Fiesole area about 7km from Firenze up in the hills. Book a nice Agriturismo there and do day-trips to Firenze center and around the beautiful hills. Firenze is really easy to walk with strollers and main attractions are quite near each other. We had an Agriturismo where there was swimming pool and a lot of animals 🐴🪿🐄🐖🫏"}, {"username": "Jennifer Gustafson", "comment_text": "We went in July and temps were 95-97 degrees e do keep in mind the heat, but it’s beautiful there so we didn’t mind. Also we walked 8-12 miles a day, lots of steps up and down places.\n\nFlorence/\nTuscany areas please stop in San Gimignano it’s a beautiful little city with a beautiful winery. Rome don’t miss the Trastevere area, and please stop in the Umbria region as well. I missed this spot and I guess I’ll just have to go back! Lol. But friends have been and share its loveliness. On the Amalfi coast check out Agricola Fore Porta restaurant. It is a farm to table restaurant with everything homemade. It’s quite a hike to it but so worth it!"}, {"username": "Marko Lone", "comment_text": "Fate una deviazione ed inserite Matera - Taranto - alberobello- Monopoli-Polign\nano- Bari …inoltre continuate fino a Palermo e da lì prendete la nave 🚢 per Cagliari (Sardinia) e fate tappa a Nora, Masua, barumini, bosa, alghero e prendete la 🚢 per Barcellona"}, {"username": "Annalisa Croci", "comment_text": "As an Italian, i suggest to avoid tourist traps, fine hidden gems like tellaro instead of cinque terre. In Milan, don't miss the Cenacolo (to be booked well in advance) and the amazing museums (Novecento, Brera, scienze naturali), Sant'Ambrogio, the new porta Nuova district. Two days are totally ok. Lake Como is overrated in my opinion, isola bella, lago d'orta and other lakes are less known. However, isola Comacina, tremezzo, Varenna are all nice places to visit. In Toscana, don't miss gems like Pitigliano, Massa Marittima, Pienza. On your way South, you could also plan a stop in the amazing historical sites of Tarquinia and Vulci. Norcia and Castelluccio are amazing places in Umbria. Spoleto and Montefalco are also nice stops, you really have infinite choices. In the South, Matera, Otranto, Lecce are beautiful."}, {"username": "Alexandra Kassianos Matthews", "comment_text": "Following!!!"}, {"username": "Claudia Codega", "comment_text": "Maybe find accomodation in Lecco instead of Como. The city is on the other branch of the Lake of Como, it is probably cheaper, you can use ferry to Bellagio, Verenna and to the villas on the lake and it has a beautiful scenario as it is in the middle of mountains. You can reach easily few of them like Piani d'Erna where this pic was taken. You can also catch train from Milan to Lecco."}, {"username": "Raelynn Cooper Marsolan", "comment_text": "Cinque terre is amazing!!! We just got back and that was everyone favorite spot we went."}, {"username": "TaNia Cam", "comment_text": "Florence/Siena/\nSan Gimignano\nAmazing !! 10 days it will be fine !! May or October !!"}, {"username": "Toni Lemos McCormick", "comment_text": "Following"}, {"username": "KO Neill", "comment_text": "Just got back from Italy in June with my 3 year old.\nAll the small towns were where we had the most fun and relaxation.\nThey had so much charm and beauty. We could easily get around and we would nap her in the car between places.\nWe did a couple of big cities and the crowds were not enjoyable with her. Although we got to skip the line a couple of times.\nAlmafi at that time of year is heaving with people. Also stressful driving.\nComo was also very busy!!! We liked Lake Garda better.\nOff the beaten path and more beach and nature focused was all around better with a child. And I honestly liked it better!\n\nUntold Italy podcast has lots of tips."}, {"username": "Tamie Gorenc", "comment_text": "If you are foodies, then you should stop in Parma, Modena and Bologna. I would also recommend traveling in September or October. Fewer people, and better weather. Keep in mind the buildings in Italy are old, so there isn’t A/C available everywhere."}, {"username": "Angela Fanano", "comment_text": "July is too hot ! We have 42 degrees in Rome and 46 in Sicily"}, {"username": "Shelley Jean", "comment_text": "Following"}, {"username": "Judy Ferguson", "comment_text": "Having lived in Italy I would avoid traveling there in late June and definitely would not consider July. Hot is an understatement and it is so crowded everywhere including the autostradas. Try for late April or May. 😊"}, {"username": "Cean Villamena", "comment_text": "The only other city I would recommend is Bologna which I think is a very underrated city. My sons & I spent 3 days there. It’s beautiful & very walkable. I also agree with others that Umbria is amazing. Perugia & Assisi are highlights there. It’s hard to choose if it’s your 1st trip."}, {"username": "Nicoló Cont", "comment_text": "You can't miss the mountains of Trentino"}, {"username": "Luke Deacon", "comment_text": "Visit \"Brucoli \" in sicily ."}, {"username": "Angela Black", "comment_text": "We just came back from a 2 week trip and went to Rome, Pompeii, Positano, Amalfi, Capri, Orvieto, Bagnoregio, Montefiascone (my Dad was born there), Tuscany, Florence, Venice. If I had to do it all over again I’d skip Rome and Florence. Florence just had soooo many people and it was hard to walk around. I would do Orvieto again in a heartbeat! It was a more laid-back town which balanced out the busyness of the others. In Orvieto we stayed in an amazing B&B that had a pool - Locanda Rosati ❤️"}]}, {"id": "2199315730467505", "text": "If I’m planning to have 2 weeks trip to Italy would you recommend it to be from ( 26/8 to 10/9 ) or from ( 2/9 to 17/9 )\nI know it’s only one week difference but my birthday is 29/8 and everyone is keep warning me from Italy in august that it will be hot and crowded so please tell me your opinions 🙏", "link": "facebook.com/groups/1373361046396315/permalink/2199315730467505/", "likes": 2, "comments": [{"username": "Gayle Moores", "comment_text": "Italians celebrate a big holiday in August called the Ferragosto and take their holidays from the middle of August to the end of August.It will be crowded at that time especially in larger popular places.If you are willing to put up with extra crowds for a few days I suggest you keep the date of leaving on the 26 th of August and celebrate your birthday in Italy!"}, {"username": "Romina Lauretig Toscano", "comment_text": "Avoid August!!!!"}, {"username": "Valerie Collanton", "comment_text": "It will still be crowded in September."}, {"username": "Janet Isaacs Lanza", "comment_text": "As far away from summer as possible 🥵"}, {"username": "Pam Gerretsen", "comment_text": "Which part(s) of Italy? This year is hot, no question, but hopefully by the end of August, more manageable? Northern Italy is cooler, and not everywhere is crowded, so maybe start in a less busy area - Orvieto or Siena, for example. Or Verona, and then move on to Rome, Venice, or Florence once the main summer holidays are done."}, {"username": "Bonnie Loftspring", "comment_text": "Easy solve , celebrate Bday w Family Friends etc, On your date, it can be a big send off in honor of your Birthday at later date ( for ALL the reasons mentioned)"}, {"username": "Raelyn Werbish Zeilinger", "comment_text": "Husband and I going in December to avoid heat and crowds and lines"}, {"username": "Frannie Kaplan", "comment_text": "If you can't handle heat, definetly September. I think it was 37 the other day. However I have spent many summers in Rome and some things are empty and quiet which is lovely"}]}, {"id": "2199312050467873", "text": "Hello~ after skiing for 3 days in Cervinnia we have 4 more nights to go anywhere. Been to many parts of Italy prior and we fly out of Milan so don’t want to go too far. There end of November/beginning December. Would love some options as we continue to look..Thank you..", "link": "facebook.com/groups/1373361046396315/permalink/2199312050467873/", "likes": 0, "comments": [{"username": "Connie Wilson", "comment_text": "Visit the Langhe/Roero region of Piemonte. You can catch the last days of the Truffle Festival in Alba. Torino is a great city with lots to do and see."}, {"username": "Alice Francesca", "comment_text": "I agree: visit Piedmont, the Langhe Region, is hilly and beautiful like Tuscany.if you are a foodie you will love this:\nhttps://\nwww.fieradeltart\nufo.org/\n\nAnd visit Turin, the first capital of Italy, rich in royal palaces of the Savoy family, elegant and easy to get around.\nhttps://\nlavenaria.it/en"}, {"username": "Giovanni Pianigiani", "comment_text": "Go skiing in the dolomites and check the difference with Cervinia!"}]}, {"id": "2199308510468227", "text": "I was wondering if there is any inexpensive price tour for a family of 4 that people use to go to Italy ￼? No no clue where should I look for?", "link": "facebook.com/groups/1373361046396315/permalink/2199308510468227/", "likes": 1, "comments": [{"username": "Renae Larcus", "comment_text": "TripMasters."}, {"username": "Sigrid Cormier", "comment_text": "Just google bus tour Italy and you’ll get a number of companies. Open the links look at their offerings, add you dates and see what the cost is. Look at the details of what your tour includes and doesn’t include."}]}, {"id": "2199307843801627", "text": "Just in case you need to defend your gelato habit while in Italy-here are some helpful supporting facts… ENJOY!! 🥳❤️", "link": "facebook.com/groups/1373361046396315/permalink/2199307843801627/", "likes": 251, "comments": [{"username": "Robyn Cane", "comment_text": "Jessica Liston"}, {"username": "Mark Baldacchino", "comment_text": "Ice cream is Gelato in Italian if you make the Italian recipe in the UK it would be Ice Cream most of the cheap ice cream you buy in the Uk and other places is made with palm oil"}, {"username": "Nadia Camier", "comment_text": "Véro Mouveaux les fameuses gelati d italie. Moins grasses, légères et avec un goût intense"}, {"username": "Donna Cignatta", "comment_text": "I don’t really think it’s a whole lot healthier- but it’s so damn delicious!\nLimońe…my favorite…🍋"}, {"username": "Farrah Sweetiepie", "comment_text": "Robert Corpuz\nHmm 🤔"}, {"username": "Trystan Kramer", "comment_text": "Mint chip ice cream is heaven"}, {"username": "Frannie Kaplan", "comment_text": "Yes less fat but tje same amount of sugar"}, {"username": "Claudia Amp", "comment_text": "Gelato is the word for ice cream in Italy; ingredients/\nprepping style may differ but it’s not like gelato is something else compared to ice cream 😅 I don’t get where this fascination comes from, it’s funny to me the obsession with what for us Italians is just…ice cream."}, {"username": "Mel Sargison", "comment_text": "Reets"}, {"username": "Anne Den Decker", "comment_text": "Sandra Hulsbergen Oppelaar"}, {"username": "Edoardo Casolo", "comment_text": "Gelato is ice cream"}, {"username": "Smith Albena", "comment_text": "Penelope Bessantj Corey Bessant"}, {"username": "Aurora Sottovia- Arguiarro", "comment_text": "Most gelato does not contain eggs. Flavors like Tiramisu, Mascarpone, Malaga, Crema, Zabaione do."}, {"username": "Chiara Varricchio", "comment_text": "Gelato is the Italian for ice cream..."}, {"username": "Anisa Defreitas", "comment_text": "Yum 😋"}, {"username": "Krystle Vuijk-Kabbedijk", "comment_text": "Rene Vuijk"}, {"username": "Kelly Young", "comment_text": "Judy Young"}, {"username": "Clara Lopez", "comment_text": "Gustavo Gutierrez Gelato😎"}, {"username": "Angie Callejas", "comment_text": "I eat whatever I want on my vacation. Lol"}, {"username": "Daniel Carlos", "comment_text": "Although gelato is the italian word for ice cream but they're different. We can't just say ice cream. When you say gelato what comes in our mind? -- italian ice cream. It's the richer, denser, smoother and healthier relative to American ice cream."}, {"username": "Cristian Jimenez", "comment_text": "Karla Mil veces más rico 🤩"}, {"username": "Paul Jennings", "comment_text": "percent sugar comparison?"}, {"username": "Sandy Helen", "comment_text": "Patricia Perazza much better for you than ice cream 😂"}, {"username": "Paula Galán Sancé", "comment_text": "Juan Pablo Carranza"}, {"username": "Jason Lee", "comment_text": "Melissa Lee"}, {"username": "Richelle Trezise", "comment_text": "And traditional\ngelato isn't piled high above the tin or bright in colour"}, {"username": "Giovanni Pianigiani", "comment_text": "Good to know. I'll try to convince the local gelato seller that he shouldn't call what he sells in cone \"gelato\" because its proper name, from now on, is \"ice cream\" 😅\nSPQA (Sono Pazzi Questi Americani)🙄"}, {"username": "Nicole Von Ahn Naturopath", "comment_text": "Gelato is the Italian word for ice cream. Too funny to say gelato is healthier than ice cream, the sugar content is high, they forgot to mention that little detail 🤣"}, {"username": "Dana Guidotti Rooney", "comment_text": "Good to know. 😋"}, {"username": "Norma Kalberer", "comment_text": "My favorite is ice cream with at least 14% butterfat. Flavor: Black Raspberry Choc.Chip"}, {"username": "Penny Bellofatto Westberry", "comment_text": "I make it at home now....and the home recipes do call for some heavy cream. 😋"}, {"username": "Alessandro Iannelli", "comment_text": "A few \"gelato\" flavors do contain eggs, for example zuppa inglese, so that's one you want to avoid if you don't want to eat eggs."}, {"username": "Brittany Pardue", "comment_text": "Steven"}, {"username": "Andrew Raymond Lynch", "comment_text": "Ames Radford"}, {"username": "Letisha Withrow", "comment_text": "I miss gelato! 😭😭😭😭😭"}, {"username": "Jonalee Wilson Stephens", "comment_text": "Do they let you sample, like they do in the states?"}, {"username": "Julian Gomez Moheno", "comment_text": "Cindy Lu"}, {"username": "Lee Say Lor", "comment_text": "Darn i should have eaten more when i was there."}, {"username": "Frederick Speller", "comment_text": "Love how they've ignored sugar content"}, {"username": "Greg Kopp", "comment_text": "I don't know if it's healthier, but it is SO much better!"}]}, {"id": "2199305200468558", "text": "Looking for ideas - going to be in Rome near Vatican area in October and want a special place to eat for wedding anniversary but not a place charging 200 a head… any ideas?", "link": "facebook.com/groups/1373361046396315/permalink/2199305200468558/", "likes": 0, "comments": []}, {"id": "2199303820468696", "text": "I’m looking to do a food tour when I am in Fomd next month! I’m looking for recommendations\nand would like guide to guide us in English!", "link": "facebook.com/groups/1373361046396315/permalink/2199303820468696/", "likes": 1, "comments": [{"username": "Lisa Valdovinos", "comment_text": "What’s Fomd? We did a street food tour in Rome. It was in English. I highly recommend."}, {"username": "निनावी सहभागी", "comment_text": "I meant Rome.\nWho did you book it through?"}, {"username": "Meghan Konopka", "comment_text": "Look up Full Belly Tours!"}, {"username": "Emma Chadwick", "comment_text": "I’ve done secret food tours in Florence and Bologna. They were really good and I know they do Rome too."}]}, {"id": "2199301977135547", "text": "Hello everyone!\n\nHas anyone visited Cinque Terre in October? I would like some opinions... How was the weather? Is 3 days enough to visit the 5 villages? What is must see and must try food? 😊\nGrazie🥰", "link": "facebook.com/groups/1373361046396315/permalink/2199301977135547/", "likes": 1, "comments": [{"username": "Kim Shea", "comment_text": "Following !! Same question"}, {"username": "Kim Shea", "comment_text": "Looking for a good hotel recommendation too"}, {"username": "Veronica Parravicini", "comment_text": "Hi!\nWe did exactly this for my mom birthday last October!\nDay 1: we arrived at our bnb in Manarola around noon.\nWe hiked to Corniglia and got back by train\nDay 2: we went to corniglia by train, we hiked to Vernazza.\nHere we took the ferry to Rio maggiore, and then we got back to Manarola by train.\nDay 3: we bought some wine in Manarola and went back home.\nWe didn’t see Monterosso but we had time if we wanted.\nThe weather was AMAZING for hiking, as it was warm (a little by rainy though).\nWe regretted not bringing with us the bikinis as we could have had a swim as a lot of tourist did😂"}]}, {"id": "2199298470469231", "text": "I’d like to plan a 2 week +/- to include Sorrento, Amalfi, Capri, Sicily, Positano. I’ve been on group tours to other areas of Italy but I’d like to have flexibility not to be on the run for a bus. Anyone have a suggestion how to start, where to start, hotels or Airbnb type apartments. Any ideas or tips would be appreciated. Ciao", "link": "facebook.com/groups/1373361046396315/permalink/2199298470469231/", "likes": 3, "comments": [{"username": "Jenny Payne", "comment_text": "What I have always done is a lot of research first and once you know your time frame & exactly what you like then I would plan who you want to go with. I take friends to Italy a lot, they have to work out what they want to see and do first & then I’ll plan the rest . A friend I meet in Rome and she had come from a tour around Sicily but sorry don’t know the name of the company 🌻"}]}, {"id": "2199296447136100", "text": "Can someone recommend a family friendly restaurant in Venice…we have 5 children 15-8", "link": "facebook.com/groups/1373361046396315/permalink/2199296447136100/", "likes": 0, "comments": []}, {"id": "2199294480469630", "text": "Give me your suggestions!\n\nI have 4 nights left on my itinerary I need to fill. Already doing Florence & Rome. Where should I go after rome?", "link": "facebook.com/groups/1373361046396315/permalink/2199294480469630/", "likes": 4, "comments": [{"username": "JeriLynne Clifford", "comment_text": "Where are you flying out of?"}, {"username": "Wahab Sidharta", "comment_text": "Day trip to Siena, San Gimignano & Cinque Terre from Florence"}, {"username": "Cathleen Huismann Dinubilo", "comment_text": "Sorrento with day trips to Capri and Amalfi Coast"}, {"username": "Tiffany Hadfield Merrill", "comment_text": "Sorrento ❤️"}, {"username": "Frannie Kaplan", "comment_text": "How long are you doing Florence and Rome? I'd extend 2 days in each"}, {"username": "Maria Ariano", "comment_text": "Viterbo"}, {"username": "Sue Sherwood", "comment_text": "Sorrento!"}, {"username": "Karen Haney Logan", "comment_text": "Going south, hit Sorrento and the Amalfi Coast. Going north, hit Lake Como. So many choices and none of them are bad."}, {"username": "Marie Cuzzi", "comment_text": "Venice !!! It is spectacular"}, {"username": "Candace Linda Solomon Cross", "comment_text": "Venice"}, {"username": "Janice Rea", "comment_text": "Sorrento."}, {"username": "Jeff Gentner EA", "comment_text": "Sorrento is a favorite, but you might consider some smaller towns like Lucca, Assisi, Siena."}, {"username": "Graham Sherlock", "comment_text": "Orvieto, Pompeii"}, {"username": "Donna Watson", "comment_text": "Sorrento"}, {"username": "Michelle Thrasher", "comment_text": "Orvieto"}, {"username": "Mariët Eertman-Heemstra", "comment_text": "Cinque Terre or Amalfi Coast!!\nPhoto is taken by me from Villa Rufolo in Ravello. There is also another villa, Cimbrose that also gives an amazing view over the Amalfi Coast!"}, {"username": "Barbara Asaro Sciuto", "comment_text": "Amalfi Coast"}, {"username": "Phyllis Snyder", "comment_text": "Where are you flying out of? If Rome then either do a couple of day trips to small towns near by- Tivoli or Orvieto or the beach town os Santa Marinell. If fro Florence- do a wine tour in the countryside or Siena or Lucca."}, {"username": "Tonsia Keytel", "comment_text": "Cinque Terre , Manarola."}, {"username": "Nancy Koehler Barboni", "comment_text": "Orvieto! A quaint village north of Rome by train one hour."}, {"username": "George Miniaci", "comment_text": "Cinque Terre"}, {"username": "Karen Schmidt", "comment_text": "What time of year? Other than the summer months….I vote Venice with a day trip to Verona. You should decide for yourself if it’s a place you love! I’ve been 3 times. All off season. It’s so unique and interesting imo"}, {"username": "Laura DeCicco", "comment_text": "We didn’t have high expectations for Venice because of all the people who post negatively in this group. We loved it and glad we went. It has a certain magic and if you do it properly you’ll feel that too. If you don’t want to go as far as Venice, then consider Bologna. Great food, easy town to walk."}, {"username": "Raymond Capkin", "comment_text": "Verona and Bologna"}, {"username": "Tracy Glasgow", "comment_text": "One day in Venice was more than enough for us. Loved Milan and the Amalfi coast looked spectacular… we did day trip to Positano and wish we had spent more time on the coast."}, {"username": "Cory Lee", "comment_text": "If you are flying out of Rome, make a pit stop in Cortona. It is very picturesque!"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Venice!!"}, {"username": "Catalina Daniel", "comment_text": "Just did Positano today! It was GORGEOUS!!!"}, {"username": "Anwen Ingram", "comment_text": "Venice is beautiful, Amalfi and Tuscany are worth a visit too"}, {"username": "Linda Nogara", "comment_text": "Verona. It’s beautiful and so easy to get around. Home to so many attractions. So close to Lago Di Garda, which in my opinion is way nicer than lake como. Capri was also amazing, stunning and spectacular!"}, {"username": "Ville Lignell", "comment_text": "Towns between Rome & Florence: Orvieto, Assisi, Perugia, Gubbio."}, {"username": "Winner Fatoyinbo", "comment_text": "You can to it Milan: If you're interested in fashion, shopping, and modern city life, consider adding Milan to your itinerary. Milan is also home to stunning architecture, including the famous Duomo.\nI recommend you get this book titled \"Milan Travel Guide 2023: Discover the beauty, history, and rich culture of Milan, Italy, and visit the top tourist attractions.\nby Alexander Journeyman (Author) available on Amazon\n\nStay great"}, {"username": "Miyuki Kanno Paul", "comment_text": "It all depends on where your return flight depart from. If MXP(Milano Malpensa), then go north. If FCO(Roma Fiumicino), you can visit Napoli"}, {"username": "Lisa Quinn", "comment_text": "Venice. Not bragging, but I’ve been to seven continents. Venice is literally in my top three cities anywhere in the world. There’s nowhere like it. You’d be doing yourself a disservice to go to Italy and not see Venice . ￼"}, {"username": "Lucrezia Folger", "comment_text": "Orvietto and Venice."}]}, {"id": "2199292503803161", "text": "Can anyone recommend a central area of Florence that would have a 2 bedroom air and b. Thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2199292503803161/", "likes": 0, "comments": []}, {"id": "2199292193803192", "text": "Going to explore Southern Italy in early November. Plan on visiting Almafi Coast, Sorrento, Naples, Mt Vesuvius possibly Sardinia. I’m looking for suggestions on itineraries. I would prefer to be based in a couple of places rather then jumping from city to city every other day. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2199292193803192/", "likes": 2, "comments": [{"username": "Renae Larcus", "comment_text": "Base in Sorrento."}, {"username": "Steve Grossman", "comment_text": "You can do all of the peninsula by staying the whole time in amalfi or sorrento. Both have ferry and bus terminals, So it's easy to go any place you want to from the town you're staying in. I've done it many many times listen to me"}, {"username": "Jenny Payne", "comment_text": "Ferries may not be running in November on account of the weather🌻"}, {"username": "S Christian Everett", "comment_text": "We had an excellent experience here. Beautiful winery overlooking Mount Vesuvius & Naples Bay. Did some tastings and had lunch Al fresco on their rooftop. It is private so be sure to make a reservation\n\nhttps://\nwww.cantinadelve\nsuvio.it/"}, {"username": "Alex Dodge", "comment_text": "November can be chilly and is one of the rainiest months here in Italy, you may opt of Sicily over Sardina. Puglia is a drier region as well, off the beaten path and everyone raves about it here."}, {"username": "Maria LoSurdo", "comment_text": "Go to Sicily rather than Sardinia! Just as beautiful, more history and culture, very friendly and warm people and much better food!! 🇮🇹❤️😊"}, {"username": "Julia Muller", "comment_text": "Not sure what part of the south you’re focusing on, but we just returned from our latest trip and took on 8 wonderful days in Puglia, based in Monopoli… it was heavenly 😊🇮🇹🙌"}, {"username": "Dana Talusani", "comment_text": "I would hesitate to do the Amalfi coast in November. Weather can be rainy and very windy. Many shops and businesses are already closed for the season."}]}, {"id": "2199282603804151", "text": "I am planning a trip to Europe and will be spending a week in Italy for the month of October, we prefer costal areas any suggestions will be much appreciated. \"Travelling with 2 teenage boys\"", "link": "facebook.com/groups/1373361046396315/permalink/2199282603804151/", "likes": 0, "comments": [{"username": "Michelle Coetzer Ashton", "comment_text": "Positano On the Amalfi coast is a must see, would've loved to see Cinque Terre further up. Sorrento and Amalfi towns were okey but Positano my favourite ✈️"}]}, {"id": "2199281627137582", "text": "We are going to Milan for a day from Venice tomorrow. What are my options of getting to Duomo cathedral? And are the attractions close to each other? Is taking the train/bus where do i purchase tickets? Or is there a pass that i could buy for the day that i could use. And how much? Are chidren under 18 free? TIA", "link": "facebook.com/groups/1373361046396315/permalink/2199281627137582/", "likes": 0, "comments": []}, {"id": "2199278143804597", "text": "Hi everyone! Leaving in 41 days, pretty excited! Part of the trip, we are going from Florence to La Spezia, with a stop in Pisa to see the tower. We get to Pisa around 10:45am, with a 20-25min walk to the tower. I’d like to book the 2:30p train to leave to La Spezia. Question - if we decide that we would like to leave earlier, is it easy to get on an earlier train? Is there a charge to change times? TIA!", "link": "facebook.com/groups/1373361046396315/permalink/2199278143804597/", "likes": 0, "comments": [{"username": "Scott Perry", "comment_text": "I have booked trains this summer on Trainline and decided to take earlier trains. When I checked with train staff before departure,I had no problems. If you book a train for which you have an assigned seat, however, you might run into problems."}, {"username": "Connie Wilson", "comment_text": "Get the TrenItalia App for all train schedules and explanation of ticket prices (changeable, refundable, etc). Easy to learn!"}, {"username": "Frank Hunt", "comment_text": "You can’t cancel however I left earlier and no one checked the tickets so no problem."}, {"username": "Jenny Payne", "comment_text": "I would wait and buy the train ticket when you get to the train station. Don’t think u get your money back or can change it🌻"}]}, {"id": "2199274163804995", "text": "Hi all! Aside from the number of people in the group, is there really much difference between the Prime Experience and Prime VIP Experience for Vatican tours offered directly through the site? Prime says fullआणखी price ticket is €68, while with Prime VIP it’s €50 plus €320 for guided service. The tour descriptions otherwise are the same. TIA!", "link": "facebook.com/groups/1373361046396315/permalink/2199274163804995/", "likes": 0, "comments": [{"username": "Lois Mouton Melancon", "comment_text": "We did the prime experience last week and it was wonderful. We basically had the place to ourselves and got to stay in the Sistine Chapel for 30 minutes. The guide was also able to explain different parts of the Sistine Chapel."}, {"username": "ארז בן טובים", "comment_text": "I think that the option with the added 320 euro is for creating your own group, and this is the payment for the guide. Its not for individuals joining a group tour. All of the tours are basically the same"}]}, {"id": "2199264073806004", "text": "Hi! We’re planning a family trip to Italy next year. It’s going to be my husband and I, our two kids aged 6 and 9 and my parents. My dad is in his late 70s but fit. Which cities would you recommend we visit? I’ve already been to Rome, Venice and Florence but don’t mind a repeat with my family. Also, which is a better time to visit.. early April or mid June?\n\nThis is the itinerary I’m looking at:\nRome 2 days\nFlorence 1 day\nVenice 1 day\nMilan 2 days (day 2: lake Como)\n\nThoughts? Is this doable or over ambitious?", "link": "facebook.com/groups/1373361046396315/permalink/2199264073806004/", "likes": 1, "comments": [{"username": "Julie Levin", "comment_text": "We just went with a 6 and 9 year old and found Rome to be fun, but mildly overwhelming for the kids. Florence was a nice middle ground in terms of being big, but less attraction-heav\ny. They liked the stores, the views, street vendors and walkability. We made sure to get a hotel with a pool for breaks and it was the best decision."}, {"username": "Huong Worley", "comment_text": "I vote for April since mid June is very hot and super crowded, long line every where. Highly recommend to purchase tickets in advance and pack light (carry on only and a back pack) if you do June. Since you travel with your kids and parents it’s best to slow down and enjoy the surroundings instead of rushing from one tourist spot to another. It seems close distance but still take half a day to travel from place to place, and think about the unthinkable like train rescheduling , or cancellation. Florence and Venice for me have to be 2 days each at least. We spent the day to visit Lake Como stayed in long line to purchase boat tickets to Bellagio then boom the boat was rescheduled to take off 4 hours later so we missed it but did get a refund. If I were you I would save Milan Lake Como for another trip, and combine them with the Dolomite’s which is breathtaking. Just my two cents hope it’s helpful."}]}, {"id": "2199224547143290", "text": "Is a 24 inch suitcase suitable for 14 days, 10 being a tour and hotel hopping. . Think 28 too big and bulky🤷‍♀️", "link": "facebook.com/groups/1373361046396315/permalink/2199224547143290/", "likes": 3, "comments": [{"username": "Miyuki Kanno Paul", "comment_text": "26 inch may be more suitable. Regardless, I recommend 4 wheel spinner"}, {"username": "Ruth Hackert", "comment_text": "It can be"}, {"username": "Janine Emma Lucas", "comment_text": "We’re taking 20” for 3 weeks, 6 cities!"}, {"username": "JeriLynne Clifford", "comment_text": "I did for 2 weeks. Along with backpack."}, {"username": "Dayna Steinberg Cioffi", "comment_text": "I just did a 25” for a 2 week trip but i also had a smaller bag for shoes and toiletries. I like options and clean changes of clothes in the heat 🙂. It all depends what you are comfortable with. And I washed some stuff at a laundry so i could wear again. 29” bag made get charged as oversized on flights. And it wont fit in the overhead on trains. The 25” did and i could lift it."}, {"username": "Colleen Dawson", "comment_text": "Just make sure you can lift and carry."}, {"username": "Tracy Wrinn Mcdermott", "comment_text": "21” plus a tote for 16 days"}, {"username": "Stephanie J Stevenson", "comment_text": "Always 21-22 no matter how long the trip. Longest so far 9 weeks."}, {"username": "Helen Ladkin", "comment_text": "We toured with Insight by bus and they took care of our luggage. It was one of the benefits. But we were only allowed one piece."}, {"username": "Paula Brink", "comment_text": "I always use a 24 inch checked bag, it’s expandable if need be. And I have a small carry on, international size-19 in, but holds change of clothes, shoes etc. I often travel solo and can manage it all by myself. Have done anywhere fom 2 to 4 week trips with this."}, {"username": "Larry Reinier", "comment_text": "We take 21"}, {"username": "Nancie Flittner Keegan", "comment_text": "What about for 2 people for 14 days"}, {"username": "Leisa Lyons Kube", "comment_text": "We are going to take a 24” each for our 7 week Europe trip in April. Planning on packing on the light side and doing laundry every 10 days or so."}, {"username": "Alexandra A Welker", "comment_text": "Yep, 24\" is enough. Use vacuum seal bags for your clothes."}, {"username": "Laurel Waggoner Archey", "comment_text": "Check your air carrier size limitations first..."}, {"username": "Karen Schofield", "comment_text": "Yup. All you ‘really’ need is personal care, a change of clothes and spare underwear."}, {"username": "Robyn Lawson", "comment_text": "It will be absolutely fine! Good to go light. 😊"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2199257687139976", "text": "I just found this group, so excited!!\n\nHeading to Italy on Saturday - Florence, Rome and Positano!\n\n❤️", "link": "facebook.com/groups/1373361046396315/permalink/2199257687139976/", "likes": 16, "comments": [{"username": "Andrea Jane Whittington", "comment_text": "Try the scavenger hunt for Florence, you get the app on your phone! You solve clues and riddles and one by one you get to see the famous sights and learn the culture!"}, {"username": "Alisa Cesario Willman", "comment_text": "Enjoy!!! 💚🤍❤️"}, {"username": "Denise Morris", "comment_text": "Have a great time court!!"}]}, {"id": "2199248560474222", "text": "My underground colosseum tour got cancelled last minute. Is there anywhere I can find tickets for next week for underground colosseum?? Please help 🙏", "link": "facebook.com/groups/1373361046396315/permalink/2199248560474222/", "likes": 0, "comments": [{"username": "Genevieve Bastien", "comment_text": "Genevieve Bastien"}, {"username": "Genevieve Bastien", "comment_text": "Reposting this as I was also cancelled last minute :("}, {"username": "Jennifer Walp Rydholm", "comment_text": "What tour company/ group was this?"}, {"username": "Heather Baumann", "comment_text": "Check on the colosseum website as they have some last minute spots when I’ve been looking this week."}, {"username": "Esther Steinbok Sustersich", "comment_text": "Check tiqets website. They always seem to have a few tickets the same day or the next day."}, {"username": "Richelle Tye", "comment_text": "Coopculture.it -to colosseum release tickets 7 days before."}, {"username": "Lisa Valdovinos", "comment_text": "Check Viator"}, {"username": "Amanda Pollitt", "comment_text": "Have you tried Get your Guide ?"}, {"username": "Matthew Cawley", "comment_text": "The Roman Guy we used. Managed to get tour of rome in a day booked the day before the tour"}, {"username": "Kavita Bahl", "comment_text": "Thank you everyone !!\nI got last minute tickets on the Coopculture site."}]}, {"id": "2199247330474345", "text": "The Leaning Tower of Pisa, Italy, has been hailed as a medieval architectural marvel.", "link": "facebook.com/groups/1373361046396315/permalink/2199247330474345/", "likes": 38, "comments": [{"username": "Luigia Gray", "comment_text": "Yes it is. Please make a booking to go up, you won't be disappointed !"}]}, {"id": "2199247017141043", "text": "Pisa… panorama…. We loved this walled city! ❤️", "link": "facebook.com/groups/1373361046396315/permalink/2199247017141043/", "likes": 7, "comments": []}, {"id": "2199242417141503", "text": "We are traveling with a tour group and have a tour leader all week… do you tip them at the end of the trip? We’ve been tipping the tour guides each day…", "link": "facebook.com/groups/1373361046396315/permalink/2199242417141503/", "likes": 1, "comments": [{"username": "Peach Panfili", "comment_text": "Let me guess - you’re from the US.\nThere was a very detailed discussion about tipping in Italy and Europe just recently - you should be able to find it if you do a search."}, {"username": "Sigrid Cormier", "comment_text": "Yes and it is expected. in fact all the tours I’ve taken, they address tipping with a “suggested” amount per day and a smaller amount per day for the driver.\nIt adds up."}, {"username": "Rita Kanten", "comment_text": "I've been on several tours in lots of countries and all the tour guides get tips from each traveler at the end of the tour. Don't let the jerks on here tell you not to tip your tour guide."}, {"username": "Lisa Adams Robertson", "comment_text": "On our tour, the tour company told us not to tip the individual guides we had because the company already tipped them, but they (the company) gave us guidelines for tipping our tour manager and our bus driver at the end of the tour."}, {"username": "Linda Chase", "comment_text": "Yes, you tip the tour director and the driver"}, {"username": "Doug Burke", "comment_text": "End of tour. Not Italy but we just came back from Morocco where we had a private driver for a week. Upon saying our goodbyes on the last day we gave him a very fat envelope!"}, {"username": "Marie Cuzzi", "comment_text": "I do tip but at the end of the trip … do what feels right to you I also tip the driver at the end of the trip"}, {"username": "Marie Cuzzi", "comment_text": "I can tell you one thing is people from the US tip more than anyone else !!!\nI have had waiters tell me I left too much money because I leave 20% … just be yourself"}, {"username": "Bonnie Loftspring", "comment_text": "You tip at the end of your time with that person. If you are on a formal tour for example Tauck, Tauck tells you the tour guide, not tour director is already tipped from your tour package."}, {"username": "Elena Innocenti", "comment_text": "Yes at the end of tour."}, {"username": "D'Anna Hohe", "comment_text": "I’ve lived in Italy but never taken arranged tours there, and I’m glad to hear that the companies themselves provide some guidance. With many tours where various activities are included or arranged by a third party, it is difficult to know what is appropriate."}, {"username": "Rhona OConnor", "comment_text": "I am tour guide..... Yes a tip at the end of the week is very much appreciated. I would be happy if I got €10 from each person..... Its usually less 🤔\n\nThe debate here is about tipping in restaurants and bars. That is not normal in Italy or France."}, {"username": "Lee Rew", "comment_text": "Just got back from a 9 day tour. You tip tour manager and bus driver. We had 2 people in my family and I tipped manager 100 euros and bus driver 50. You base your tip on how many people in your family."}, {"username": "Voula Ladas", "comment_text": "Tipping is usually the norm for your tour leader , at end of trip ."}, {"username": "Beth Heys", "comment_text": "Most tour companies have a guide on their website e.g. 3-5 EUR per day per person"}]}, {"id": "2199246900474388", "text": "Has anyone flown TAP Portugal with the Away Bigger Carry on luggage? Away says the size works for TAP requirements in the list of airlines on the Away site…but on the TAP site it doesn’t look like it would.. Iआणखी just wanted to see if anyone has flown TAP with this carry on and, if so, have you had any issues taking this on the flight with this airline?", "link": "facebook.com/groups/1373361046396315/permalink/2199246900474388/", "likes": 3, "comments": [{"username": "Janette YesPlease", "comment_text": "I would stay within the dimensions and weight TAP requires. I saw many folks with carry-on suitcases being asked to check their luggage to see if it didn't fit within their standards or was overweight. However, anyone with a backpack waved on through to the plane."}, {"username": "Debra McCraw Austin", "comment_text": "We just flew on TAP to Rome and back a few weeks ago. We had 21” carry ons for luggage and 1 bookbag each. They weighed every piece: carry ons and book bags. Carry ons were deemed to weigh to much and had to be checked in. So watch not only the size but the weight of the carry on, if you don’t want to check it in."}, {"username": "Natalie Sherwood", "comment_text": "Just last month I flew TAP from chicago to Lisbon to Rome. And then Milan to Lisbon to Chicago. There was a group of 10 of us in my group and we all had different experiences, but ultimately they made us all check our bags. 3 of us had to check in at the airport where they asked us if we had any bags to check. We said no, we just have our carry-ons and our backpacks. They weighed our bags and checked them all. I was pretty upset because I showed them that same exact screenshot that you posted and the agent said that that was for premium or something like that. He said because it was a screenshot he couldn’t trust it. So I then found it on their website and he said “okay just a minute” then proceeded to check all our bags saying we were all over weight. Luckily he didn’t make us pay so at least there was that. And we were terrified about our luggage getting lost but it didn’t! And we were also worried that we’d have to wait a long time at baggage claim at FCO but that wasn’t the case either. So it ultimately worked out, but we were very worried the whole time. Our friends got to the layover in Lisbon without having to check their bags, but they don’t play around in Lisbon. They measured and weighed every person’s bag as they were getting onto the plane on the jetway. On our way to Rome they didn’t make our friends pay.\n\nOn our way home, we got on the plane in milan without having to check our bags. But in Lisbon they got us again. And this time we each had to pay $100.\n\nHopefully this helps! If you’re not flying out of Lisbon at all, you might have better chances!"}, {"username": "Bennett Richards", "comment_text": "We flew ITA Business class and had been worried about size and weight but it seems that on ITA size and weight are irrelevant when flying BC. Good was great and so was the flight LAX to Rome."}, {"username": "Cheri Arrowood-Stanziano", "comment_text": "We flew TAP from FCO in May and checked 2 large AWAY\nsuitcases and 1 large AWAY duffle. The checked bags were included in our seat price. We also carried on the small AWAY carryon. We were gone for a month….transatl\nantic cruise. Flight went though LIS."}, {"username": "Carmen Cullen", "comment_text": "Dareon Carrington"}, {"username": "Mandie Cowan", "comment_text": "Flew TAP Air Portugal last August. They lost our luggage for 10 of our 14 days. I’m still waiting on compensation.\nI’d suggest carry-on only but after reading some comments, that may not be feasible for longer vacations. They need to do better!"}, {"username": "Steve Grossman", "comment_text": "TAP is a great airline. You will like it but do everything it says in the instructions about luggage. Otherwise, you will pay a lot of money."}, {"username": "Kelly Cannon", "comment_text": "Always go by what the airline states in their rules and screenshot it for your quick reference, then assume you'll be checked. Otherwise, just check a small bag and carry a backpack, avoid the worry. Or pack less."}, {"username": "Julie Lynn", "comment_text": "i think they care about the weight"}, {"username": "Bethany Walton", "comment_text": "My carry on was slightly bigger in size and TAP didn't measure it but they did weigh it."}, {"username": "Christy Lyn", "comment_text": "Away Bigger carryon is too big for most smaller carriers. They will make you check it at gate."}, {"username": "Annette Mayer", "comment_text": "Going to Lisbon from Miami no one checked anything. Returning to Miami tomorrow. Let's see how that goes.i bought some postcards, bookmarks and a frig magnet. All else was weighed and is the same."}]}, {"id": "2199244983807913", "text": "Help please! Going to Rome in mid October and trying to narrow down what area to stay. Is the Campo Marzio area good? Is it close to Trevi? Or better to be closer to the Colosseum? Ty", "link": "facebook.com/groups/1373361046396315/permalink/2199244983807913/", "likes": 0, "comments": [{"username": "Cecilia Christine Costantini", "comment_text": "It is a 10-minute walk and also close to piazza Navona, bridges to cross to San Pietro and Castel Sant'Angelo etc. And close to that Laganá restaurant lots of people mentioned in this group."}, {"username": "Frank Hunt", "comment_text": "Neither, too busy."}]}, {"id": "2199242963808115", "text": "Need to take a train from Venice to Florence in October. Do I buy tickets now and if so what train", "link": "facebook.com/groups/1373361046396315/permalink/2199242963808115/", "likes": 6, "comments": [{"username": "Dave Colleen", "comment_text": "The farther out you buy the cheaper the ticket. We didn't buy tickets for trains until closer to the time b/c we didn't know if our plans would change. We used Trenitalia. There is also italo."}, {"username": "Darren Cockle", "comment_text": "Cheaper on FlixBus. Me and my partner are travelling from Venice,Florence\n,Bologna,Rome to Naples over a two week holiday in October this year and only cost us £65 for both of us (£32.50pp) BARGAIN 🇮🇹"}, {"username": "Jenny Payne", "comment_text": "I use Italo all the time but I never buy my ticket till a few days before 🌻"}, {"username": "Linda Ewerlin", "comment_text": "I book train tickets through www.thetrainlin\ne.com\n\nI agree with Dave Colleen - the earlier you book, the cheaper the tickets"}, {"username": "Саша Савино", "comment_text": "Trenitalia or Italo\nDownload app. Every month there are discount in homepage."}, {"username": "Lisset Berdeal Sassi", "comment_text": "I bought nine way in advance for my trip last month on the Italo app. It was the best thing I did. If you buy there it's a hassle. Long lines and then you have to also get your ticket validated. With the app you just board and then they go around and scan your virtual ticket."}, {"username": "Manuela Bonazzi", "comment_text": "Italo o Trenitalia Frecciarossa."}, {"username": "Gay Bell DiBartolomeo", "comment_text": "Gayla Faye Bell"}, {"username": "Ben Parlopiano", "comment_text": "Just make sure that there are no planned rail strikes."}, {"username": "Amy Sandler Riemer", "comment_text": "All sold out already for October and November? I’m going in October. Was afraid to book train on land day in case plane delayed. Going from Milan to Verona first. These posts making me nervous"}, {"username": "Charlotte Odonnell", "comment_text": "I was told that train schedules weren’t available till approximately two months prior to our scheduled visits . So\nIf going in October, should seek schedule and tickets in August ."}, {"username": "Phyllis Snyder", "comment_text": "Buy on line fast train and go first class - and as early possible."}, {"username": "Rachel Bradfield", "comment_text": "Get the Omio App"}, {"username": "Claudette Franco", "comment_text": "Last year I bought all my train tickets last minute and it was so expensive. This year I purchased with 3 months in advance and I saved at least half price of each ticket or more."}, {"username": "Lalita PosBa", "comment_text": "Get the app Trainline and you will see the schedules and prices! 🤗"}, {"username": "Nakitha Badon", "comment_text": "You can"}, {"username": "Mahalia Agustines", "comment_text": "Jaime Agustines"}, {"username": "निनावी सहभागी", "comment_text": "Well, I did it. Hope I did it right. 2 tickets economy business Trenitalia, 2 hrs 3 min ride, reserved seats. Total$59.90 each. Good?"}, {"username": "Peter Cetani", "comment_text": "Freccia rossa or Italo."}]}, {"id": "2199238583808553", "text": "Looking for tattoo artist in Rome!! Any links to a shop would be great!", "link": "facebook.com/groups/1373361046396315/permalink/2199238583808553/", "likes": 1, "comments": [{"username": "Anthony Sperduti", "comment_text": "Just get one before you go"}, {"username": "Tammy Gutsche", "comment_text": "Wisdomless Tattoo"}, {"username": "Amanda Lynn", "comment_text": "Absolutely! St. Peter’s Ink — right outside Vatican walls. Fabrizio the owner did ours. Contact him on instagram."}]}, {"id": "2199232110475867", "text": "Would love recommendations for private transfer from Rome to Airport and also Venice airport to Venice", "link": "facebook.com/groups/1373361046396315/permalink/2199232110475867/", "likes": 2, "comments": [{"username": "Venessa Menzagopian", "comment_text": "Cheapest I found 55 euro in Rome\nhttps://\nwww.movinrome.eu\n/\n\nFor Venice I booked a shared water taxi with tiqets\nhttps://\nwww.tiqets.com/\nen/\nvenice-attractio\nns-c71510/\ntickets-for-veni\nce-water-taxi-a\nirport-from-mar\nco-polo-airport\n-to-venice-p103\n2292/\n?utm_source=andr\noid_app&utm_med\nium=product_pag\ne&utm_campaign=\nnone"}, {"username": "Kay Rendall", "comment_text": "Romecabs. Same price as a taxi, reliable. Have used them many times on line."}, {"username": "Allison Carlisle Young", "comment_text": "We used limousinrome.co\nm"}, {"username": "Valerie Collanton", "comment_text": "Private water taxi for Venice. I used this\n\nhttps://\nwww.motoscafiven\nezia.com/en/\nour_boats.php"}, {"username": "Cheri Arrowood-Stanziano", "comment_text": "We used Express Shuttle for FCO"}, {"username": "Miyuki Kanno Paul", "comment_text": "Have your hotelier arrange it for you. Roma within the wall to the airport is at fixed rate"}, {"username": "Colleen Robinson", "comment_text": "Venice Airport to venice, take a taxi."}]}, {"id": "2199231857142559", "text": "Hello, I am looking for a family photographer in Venice. For sept 29/30 - one of the days please send me your suggestions as well as the going rate.\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2199231857142559/", "likes": 1, "comments": [{"username": "Usha Lalwani", "comment_text": "Reachout to www.holidaygrap\nher.com and they should be able to help."}, {"username": "Lisa Owyang Anton", "comment_text": "https://\nwww.flytographer\n.com/\nI’ve heard many friends use this website."}, {"username": "Debbie Vitale", "comment_text": "Someone just posted about a photographer they used in Venice"}]}, {"id": "2199228010476277", "text": "Hello everyone! We are flying tomorrow from London to Rome. What is the usual fare for a taxi from the airport? Our hotel is close to Fontana de Trevi.\nThanks!", "link": "facebook.com/groups/1373361046396315/permalink/2199228010476277/", "likes": 2, "comments": [{"username": "Ryan Monahan", "comment_text": "I believe its regulated, flat rate 50 euros to that location."}, {"username": "Laura DeCicco", "comment_text": "50 € flat rate"}, {"username": "John Bruckman", "comment_text": "It’s a fixed price about 50 Euro"}, {"username": "Leila Jane", "comment_text": "The rate as mentioned is SUPPOSED to be regulated however keep this rate in mind as there are plenty of taxis who will try to charge you twice this price."}, {"username": "Claudia Caravedo Arroyo", "comment_text": "Thank you so much!❤"}, {"username": "Philippa Tony", "comment_text": "Saw on outside of many taxi doors today 50 euro flat rate. I'd hop into a taxi that clearly states this on outside doors so they can't over charge!"}, {"username": "Claudia Caravedo Arroyo", "comment_text": "Thanks! We are 5 with luggage… we will need a van… I think it will be double??"}, {"username": "Silvienne Micallef", "comment_text": "Between 50 to 100 EUR"}, {"username": "Romina Lauretig Toscano", "comment_text": "Ask flat rate which is 50 euros"}, {"username": "Stephanie Osborn Rushing", "comment_text": "I made transfer through my hotel concierge and they quoted me 70 euros. My hotel is close to trevi and Spanish steps"}, {"username": "Karen Cooper", "comment_text": "My daughter got a taxi from Ciampino airport to hotel near vatican for 31 euros on Sunday"}, {"username": "Elena Innocenti", "comment_text": "If you take a regular white taxi is 50euro fixed price. But you don’t know which kind of car is available or how much you have to wait till you find a car for all your luggage.\nthere are always cars with driver that offer you rides, but the price is much higher and they are not official."}]}, {"id": "2199221007143644", "text": "Best hotels walking distance to Trevi Fountain + the Colosseum!! Nothing super expensive, as we’ll be there for 3 days coming from Positano. But easy to get out and explore! 🫶🏼", "link": "facebook.com/groups/1373361046396315/permalink/2199221007143644/", "likes": 6, "comments": [{"username": "Genevieve Bastien", "comment_text": "Bluehostel was great,\nSituated in Monti\nHave a great trip !"}, {"username": "Michelle Solak", "comment_text": "Parlamento Boutique Hotel! Just had a great stay here about a week ago. About a 5 min walk from Trevi fountain and 30 to the colosseum"}, {"username": "Lisa Valdovinos", "comment_text": "Hotel Borgognoni is nice. A little dated but very friendly service. Close to Trevi Fountain. They have a very nice breakfast as well. It has air conditioning and an elevator which was very important to us."}, {"username": "Brian Yonks", "comment_text": "Rome Times Hotel!!!!"}, {"username": "Angela DeMario", "comment_text": "Hotel orologio - amazing 🤩"}, {"username": "Alison Dutton", "comment_text": "We stayed at the Trevi Palace just literally around the corner to the fountain. Comfortable and clear rooms and really good breakfasts. Have a lovely time."}, {"username": "Donna Watson", "comment_text": "The Loft was amazing and you can walk everywhere from that location"}, {"username": "Donna Watson", "comment_text": "Donna Watson"}, {"username": "Nancy Moran", "comment_text": "Relais Trevi 95 Boutique Hotel\nhttp://\nwww.relaistrevi9\n5.com/en/\nindex.php"}, {"username": "Jo Morgan", "comment_text": "We are at Monti Palace, good location and good hotel"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Check a booking site. It will show you all the hotels and their prices in the area you want to be in. Then read the amenities and reviews."}, {"username": "Debbie Cooper Goldman", "comment_text": "Palazzo Caruso was clean, good location to trevi fountain and Spanish steps"}, {"username": "Laura Caputo", "comment_text": "Rome life hotel"}]}, {"id": "2199215907144154", "text": "I cannot thank everyone for their advice. We just got back from a 14 day trip to Rome, Florence, and Venice. Yes, it is hot and humid. We made a personal decision to do private tours as a means of avoiding lines and trains. LivTours was amazing and highly recommend. The guides were careful with the heat and always sought shade. This decision allowed us to do everything we wanted and maintain our sanity!\n\nMy recommendations... sneakers during the day and sandals at night. I felt like my feet were cooking in the sweat and heat. Stopping a lot as many other people suggested. We enjoyed beverages and gelato to stay cool and use bathrooms.\nEveryone was kind and helpful. Even if people didn't speak English they would find someone who did to help us out. Pickpockets are everywhere. We were a group of 4 and stuck together. I did hear many people saying they either lost their wallets or were pickpocketed. I had the Travelon pocketbook with the locking zippers and my husband had the undershirt neck wallet.\nWe are already talking about going back since it was an amazing vacation. Thank you everyone for sharing your experiences, it really helped us make our trip perfect!", "link": "facebook.com/groups/1373361046396315/permalink/2199215907144154/", "likes": 96, "comments": [{"username": "Nakitha Badon", "comment_text": "I wish I could go back"}, {"username": "Rania Mourad", "comment_text": "Could you share the outline of your itinerary please"}, {"username": "Graham Sherlock", "comment_text": "Sounds good next time go in May or October, being a tourist in the constant heat is no fun at all"}, {"username": "Alice Francesca", "comment_text": "I am sorry about the pickpockets.The\ny are gipsies, not Italian.♡"}, {"username": "Linda Chase", "comment_text": "LivTours is excellent!"}, {"username": "Nupur Tripathi", "comment_text": "Lovely to hear! We’ll be doing the same route end August so would be great if you could share your recommendations\n🙂"}, {"username": "Andrea Petch", "comment_text": "Following!"}, {"username": "Angela Daviduck", "comment_text": "Thank you for sharing about LivTours"}]}, {"id": "2199207707144974", "text": "Hello everyone, I’m looking to book a trip to Italy for Sept 2024 or Oct 2024. Did anyone use a travel agent or book on their own. I want to make sure this is an amazing experience for me and my boyfriend.", "link": "facebook.com/groups/1373361046396315/permalink/2199207707144974/", "likes": 2, "comments": [{"username": "Renae Larcus", "comment_text": "Do some research and do it on your own. Decide where you want to go and don’t try to do too much! Either stay North or South, not both. Trains can get you most anywhere, but it’s pretty necessary to have a car if you want to get around Tuscany. Plan for travel time between towns. One night stays are too much stop and go."}, {"username": "Penny Bouchard", "comment_text": "We are starting to plan ours for next fall too and wonder the same thing. We want to do venice, cinque Terra and lake como."}, {"username": "Carlie Lee", "comment_text": "If it's your first time, it can definitely be overwhelming. Travel agents who have been there (like myself) can be a huge help!"}]}, {"id": "2199206067145138", "text": "Rooftop bars with BEST VIEWS in Rome?", "link": "facebook.com/groups/1373361046396315/permalink/2199206067145138/", "likes": 59, "comments": [{"username": "Kelli Barnes", "comment_text": "Angie Smith"}, {"username": "Robin Sullivan Murphy", "comment_text": "The Forum Hotel.❤️"}, {"username": "Maureen Judice", "comment_text": "Cecile Broussard\nEileen Huval"}, {"username": "Daryl Putnam", "comment_text": "Terrazza Borromini."}, {"username": "Cecile Broussard", "comment_text": "Following"}, {"username": "Robyn Klade", "comment_text": "Following"}, {"username": "Nathan Scherer", "comment_text": "Following"}, {"username": "Mary Manning- Cicciarelli", "comment_text": "The Hassler"}, {"username": "Paola Bobko", "comment_text": "The court, NH hotel fori imperiali rooftop bar."}, {"username": "Sonia Elaine", "comment_text": "On top of the palazzo, amazing views"}, {"username": "Mohanad Saddik", "comment_text": "Omar Kharboutli"}, {"username": "DeeDee Parrett Owings", "comment_text": "The court bar"}, {"username": "Cecilia Lopac", "comment_text": "f"}, {"username": "Lauren Overton Call", "comment_text": "Victoria Butler Culbertson Jay Culbertson Rj Call"}, {"username": "Ericka Silva", "comment_text": "Following"}, {"username": "Ari Sun", "comment_text": "The Eden"}, {"username": "Robyn Lynn", "comment_text": "Now we’re talking lol"}, {"username": "Sherika She", "comment_text": "Sherika She"}, {"username": "Karen Maidment", "comment_text": "Skybar in NH Collection hotel"}, {"username": "Karen Baxter", "comment_text": "On the corner across from the Trevi Fountain 👌"}, {"username": "Kya Michelle", "comment_text": "F"}, {"username": "Claudette Franco", "comment_text": "Oro Bistrot Roma"}, {"username": "Sarina Perricone Gelvan", "comment_text": "Hotel hassler rooftop"}, {"username": "Donna Saylor Simms", "comment_text": "🍷🥰"}, {"username": "Mindy A. Hoverson", "comment_text": "Following"}, {"username": "Hallie O'Brien", "comment_text": "Maggie Boyer Curtin"}, {"username": "Marina Trainor", "comment_text": "Peter Bella"}, {"username": "Alisa Flores", "comment_text": "Following"}, {"username": "Sugen Colindres", "comment_text": "John Titone"}, {"username": "Mary Anne Richert", "comment_text": "F"}, {"username": "Elena Paonessa", "comment_text": "No need to write following\nJust click on the 3 dots at the top right and then select turn on notifications for this post"}, {"username": "Sarah Rueth", "comment_text": "Following! will be there in Oct 🎉"}, {"username": "Kim Quartermaine", "comment_text": "Narelle Millington\nGlen Quartermaine"}, {"username": "Tom Cannon-Bailey", "comment_text": "Terri brumm"}, {"username": "Lisa RC", "comment_text": "This was our view from the restaurant/ bar in Rome\n\nTerrazza Borromini"}, {"username": "Gabrielle Slonim", "comment_text": "Yan Nom Katrina Jill 🍸 🍹"}, {"username": "Sherrie Lyn", "comment_text": "Following"}, {"username": "Danielle Mcminn", "comment_text": "Ryan Hayes"}, {"username": "Danelle Stankiewicz", "comment_text": "Cheryl Zimmerman Forth Evelyn Balcom-Zupo evelyn"}, {"username": "Alma Castillo", "comment_text": "Terraza Borromini. Call and make reservations."}, {"username": "Neeb O'Neill Castro", "comment_text": "G"}, {"username": "Cindy Puls Cooley", "comment_text": "Following"}, {"username": "Maddy Herbert", "comment_text": "Aroma!"}, {"username": "Margaret Morgan", "comment_text": "The singer hotel rooftop was lovely"}, {"username": "Susan Belzerowski", "comment_text": "Oro Bistrot"}, {"username": "Ally O'Donoghue Lipman", "comment_text": "Following"}, {"username": "Kim Grace", "comment_text": "Michelle Cummins"}, {"username": "Robert Parinetto", "comment_text": "There's a roof top bar near the trevi fountain"}, {"username": "Tiffany Hadfield Merrill", "comment_text": "Oro bistrot was my favorite. We did the Court also. Had reservations at both."}, {"username": "Stephen Jones", "comment_text": "Following"}, {"username": "Kelli Gene Blakeman", "comment_text": "Following"}, {"username": "Mary Ann Mills", "comment_text": "How do you call to make a reservation or online?"}, {"username": "Jen Tucker Clonch", "comment_text": "The Flora. No reservations needed. Not as busy as some others."}, {"username": "Dipti Vashi Desai", "comment_text": "Following"}, {"username": "Margaret Liggieri Markman", "comment_text": "The court in the palazzo manfredi hotel"}, {"username": "Giulia Rossi", "comment_text": "Garden Les Etoiles, over San Pietro"}, {"username": "Emma Marchetti", "comment_text": "The hotel trevi opposite the trevi fountain go in ask at reception if u can have drinks in the bar , you look right over facing the fountain, no crowds 👌🏽"}, {"username": "Daniel Brown", "comment_text": "Trevi fountain"}, {"username": "Caroline Jardine", "comment_text": "Following"}, {"username": "Tammy Spencer", "comment_text": "Following"}, {"username": "Rose Man", "comment_text": "Il\nPalazzo"}, {"username": "Katie Elise", "comment_text": "Aroma"}, {"username": "Jennifer Smith", "comment_text": "Following"}, {"username": "Angela DeMario", "comment_text": "Divinity - top of the pantheon hotel - amazing 🤩 also hotel orologio rooftop lounge"}, {"username": "Jodi Hartman Kalodner", "comment_text": "Following"}, {"username": "Bonnie Mitchell", "comment_text": "Following"}, {"username": "Sarah Reed", "comment_text": "Debbie Stevens Sears"}, {"username": "Julie Tran", "comment_text": "Trevi fountain \"secret\" bar"}, {"username": "Shanna Crotts", "comment_text": "The Court"}, {"username": "Jay Parekh", "comment_text": "Following"}, {"username": "Angela Emmitte Tripp", "comment_text": "Following"}, {"username": "Mindi David Wierzchowski", "comment_text": "Orazio Palace ~you need reservations"}, {"username": "Rose Huron", "comment_text": "Following"}, {"username": "Silvana Zambudio", "comment_text": "Following"}, {"username": "Brittany Wheeler", "comment_text": "The Court was Amazing. You must make reservations and I suggest after 6pm if possible. The sun went down around 7 and wasn’t as hot. Drinks are around $27 but comes with light food. Definitely worth it! They gave a 2 hour window for you to drink and snack."}, {"username": "Nicole Leounes", "comment_text": "Following"}, {"username": "Paul Williams", "comment_text": "Following"}, {"username": "Shama Patel", "comment_text": "Following"}, {"username": "Pam Armenia O'Brien", "comment_text": "Eitch Borromini in Piazza Navona"}, {"username": "Kym Geiger", "comment_text": "Following"}, {"username": "Rosalie Ghersi", "comment_text": "f"}, {"username": "Leah Herbener", "comment_text": "F"}, {"username": "Darcia Darcia", "comment_text": "Following"}]}, {"id": "2199199507145794", "text": "In Rome right now and tried to look up Trastevere based off of multiple suggestions to eat there from this page.\n\nWas it meant to eat in the Trastevere area or is there a specific place in Trastevere?\n\nThank you to all on this page 😃", "link": "facebook.com/groups/1373361046396315/permalink/2199199507145794/", "likes": 23, "comments": [{"username": "Jill Rosenfeld", "comment_text": "The area."}, {"username": "Roger Pajo", "comment_text": "Best area of Rome!"}, {"username": "Marina Romeiro", "comment_text": "Taverna trilussa"}, {"username": "Maureen Rebello Hagerty", "comment_text": "Lots of good places. It’s not the “touristy” part of Rome so usually cheaper and better. But now that so many people know about it I’m sure it’s as bad as Rome with price and service now"}, {"username": "Lori Potter Farmer", "comment_text": "Lois Midkiff"}, {"username": "Susie CB", "comment_text": "https://\npastaevinoroma.i\nt/ w Ed not here and loved it!"}, {"username": "Christine Malota- Kendall", "comment_text": "Also ask the locals… and get off the beaten path."}, {"username": "Connie Dennis", "comment_text": "Just go to a restaurant!"}, {"username": "Theresa Jacobellis", "comment_text": "We liked Enotica in Trastavere"}, {"username": "Sam Hersh", "comment_text": "We really enjoyed this place so much we went twice"}, {"username": "Sam Hersh", "comment_text": "And we are going to this place when we return in May because we’ve heard it’s good"}, {"username": "Anne Riemer", "comment_text": "We’ve had good luck when traveling just using Yelp and putting in “best lunch” or even “cheap dinner” with great results"}, {"username": "Barbara Bastianini", "comment_text": "Many people recommend eating in Trastevere because there are a lot of restaurants there. But overall it’s way too touristy for my tastes. Too many restaurants with color photos of their food outside always make me stay away."}, {"username": "David Sapienza", "comment_text": "Otello in Trastevere is great."}, {"username": "Trevor Brown", "comment_text": "We did a food tour in that area and it was great. You must visit a cafe named Suppli to try that local Italian delicacy."}, {"username": "Maria Ariano", "comment_text": "Go out, take a stroll, enjoy the evening breeze. When you're hungry, look for a place with a table outside. Sit. Only suggestion: never eat in a place with an outside menu with pictures."}, {"username": "Sally Weston", "comment_text": "Dean Weston ☝️"}, {"username": "Jamie Favreau", "comment_text": "If you’re still in Rome I would suggest you try what our friends from Rome suggested. We have been to both places and it was absolutely amazing!\n“Tintone 1884 at via dei maroniti 1. Here as well are awesome appetizers, in particular the small tomatoes with oil garlic and basil, as simple and fresh as delightful. Here is where they cook our personal best pasta dish in Rome: spaghetti camponeschi.\nAnd then: Hostaria romana, address:via del Boccaccio 1; it's a very typical restaurant perfect for a taste of roman appetizers, and the best place to have a carbonara pasta.”"}, {"username": "Alice Francesca", "comment_text": "Roma Sparita.I am Italian and that is where Romans go."}, {"username": "Maryanne Cristina", "comment_text": "We ate at Nanarellos . Food was amazing."}, {"username": "Amerline Lee", "comment_text": "There are 2 tonnarello 2 min apart. Check out their website. The 2nd restaurant has No long queues. I got a table in 15min on a Saturday night."}, {"username": "Maria Wood", "comment_text": "Da Enzo was great food."}, {"username": "Lisa Minichini-Dowty", "comment_text": "TONARELLOS!"}, {"username": "Frannie Kaplan", "comment_text": "Trastevere is an area/\nneighbourhood. At this time of year they set up stands, restaurants and cocktail bars along the river. Wear comfortable shoes at night and possibly take a cab"}, {"username": "Yiota Mallas", "comment_text": "Try La Tavernaccia da Bruno, it’s excellent and popular with locals"}, {"username": "Christy Lyn", "comment_text": "Ristorante Popipopi Trastevere-Roma it’s in a beautiful area and delicious"}, {"username": "Joanne Bianco", "comment_text": "We did a food tour at night. So good😋😋"}, {"username": "Jessica Backes", "comment_text": "Conciabocca!!! It’s upscale Italian… the talent of the chefs is crazy and highly recommend. The atmosphere is lovely."}, {"username": "Lisa Hartert", "comment_text": "We stayed in Trastavere and wandered the area each night for new places -never had a bad meal, ever!\n\nAlso loved the restaurants in the Jewish quarter."}, {"username": "Audrey Bauer", "comment_text": "We did this food tour - our favorite stop was Trapizzino\n\nhttps://\nfoodtourrome.com\n/"}, {"username": "Kristi Entwistle", "comment_text": "Trastevere is a neighborhood in Rome! Lots of good places to eat there 🙂"}, {"username": "Kerrin Barassi", "comment_text": "Anywhere in Trastevere! Enjoy"}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "A fav!"}, {"username": "Victoria Laverty", "comment_text": "Just wander and find somewhere heaps of great restaurants and area buzzing"}, {"username": "Genevieve Bastien", "comment_text": "We tried Tonnarello when we were there and really disappointed as it wasn’t authentic and touristic\nPassing this advice on so you can have a better chance than we did to enjoy a resto in that beautiful neighbourhood"}, {"username": "Debbie Morton", "comment_text": "Anywhere that makes Cacio e pepe"}, {"username": "Ann Smith Blaise", "comment_text": "We liked LA Scala."}, {"username": "Gary Fossaceca", "comment_text": "Walk deep into the neighborhood and enjoy! We like exploring random restaurants!!!!"}, {"username": "Anthony Sperduti", "comment_text": "Just a great less touristy area\nGreat restaurants everywhere"}, {"username": "Claudia Amp", "comment_text": "If you’d like something outside of the usual hyped places, long lines, waiting in the heat and chaos, I suggest “Ditta Trinchetti” in Via della Lungaretta, not touristy, great dishes and wine selection for fair prices and the place is very beautiful, one of my favourite places in Trastevere. If not, Rimessa Roscioli is also a valid choice."}, {"username": "Rhonda Hope", "comment_text": "Trastevere and Testaccio have the best restaurants"}, {"username": "Haven Houllis Chrysakis", "comment_text": "Here in Rome now have spent everyday in the area of travereste it’s the best area of Rome hands down"}, {"username": "Ryan Monahan", "comment_text": "The whole neighbourhood is great to walk around in and pick a restaurant. Just catch the bus or cab or whatever over there and check it out!"}, {"username": "Mary Wevodau", "comment_text": "https://\nmaps.app.goo.gl/\n4Qt9fPYRfk392oXW\nA?g_st=ic\n\nThis place is fantastic"}, {"username": "Jenna Morgan", "comment_text": "We absolutely loved impiccetta!! And also tonnarello we really liked."}, {"username": "Miyuki Kanno Paul", "comment_text": "Jewish Ghetto has great restaurants if you are willing to go across the river😉"}, {"username": "Jeanne Hildebrandt Fedoryk", "comment_text": "Taverna Trilussa was good, but you’ll likely need a reservation"}, {"username": "Donna Riffle Hutcheson", "comment_text": "We loved this place in Trastavere\n\nhttps://\nfood.google.com/\nchooseprovider?r\nestaurantId=%2F\ng%2F1tds3n88&g2\nlbs=AP8S6ENAl8U\naBMFjq4tmVc10hx\nZFOteFH5zMqfAZd\nZH-6TXYsESCyPf8\nnyJehycX61Rq0-2\nEOqccjpSYoK27-E\n14NMFqLNcHKx3KP\n1LqpGJp0i743B61\nl0KwmI2O6bQyPAe\nSJmc_Y8InJhNbA5\noQINE_MJPysQ1dI\nDX8z6fw3WWxeRWY\nlrZeKLw%3D&hl=e\nn-US&gl=us&cs=1\n&ssta=1&fo_m=Mf\nohQo559jFvMUOzJ\nVpjPL1YMfZ3bInY\nwBDuMfaXTPp5KXh\n-&gei=HQy_ZPT5O\nPG7qtsPkbCV0AM&\nei=HQy_ZPT5OPG7\nqtsPkbCV0AM&fo_\ns=OA%2CSOE&sei=\nCRs2s6B4ULicEV3\n3GmS0HhlE&utm_c\nampaign&utm_sou\nrce=search"}, {"username": "Larraine Piero Testa", "comment_text": "Trastevere means “across the river”."}]}, {"id": "2199198383812573", "text": "How reliable is GLOBUS tours? First time booking with them. So far my research is promising. Thank you in advance for your help.", "link": "facebook.com/groups/1373361046396315/permalink/2199198383812573/", "likes": 1, "comments": [{"username": "Catherine Hatfield-Fuster", "comment_text": "I haven't used them personally, but used to do consulting with them and heard nothing but good things from their clients and staff."}, {"username": "Jenni Vail", "comment_text": "My friend has used their tours twice and recommended them to me."}]}, {"id": "2199196703812741", "text": "Hello, will be traveling to Italy next March. Will be visiting Rome and Sicily. Already have booked tours for the Coloseum and the Vatican- the only tours we plan on. In Sicily we will be in Taormina and Capo d’Orlando. Aun recommendations on what to see there would be appreciated. 😊 This group has been so helpful with travel information, thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2199196703812741/", "likes": 0, "comments": []}, {"id": "2199143980484680", "text": "In search of antique markets, thrift stores etc. any suggestions? We will be in the north from Tuscany, to levanto, Venice, lake Garda, Parma, Florence. I am happy to find them in smaller villages as well. We have a car! Grazie!", "link": "facebook.com/groups/1373361046396315/permalink/2199143980484680/", "likes": 2, "comments": [{"username": "Janet Walls", "comment_text": "Naviglio Grande, on the last Sunday of the month in Milan. Fantastic stalls & shops, filled with locals, takes me all day to browse. Plan my trips to Milan to coincide with it!!"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2199194850479593", "text": "How busy is Italy in mid March? Do we need to book trains, etc. in advance?", "link": "facebook.com/groups/1373361046396315/permalink/2199194850479593/", "likes": 4, "comments": [{"username": "Kimberly MacKinnon Cherry", "comment_text": "That's when we want you go\nI am hoping a lot less crowded, and cool temperatures. I am eager to see what others think. We plan to go to Rome, Florence Tuscany."}, {"username": "Steve Watkins", "comment_text": "We were there early march and it wasn’t crowded at all"}, {"username": "Ville Lignell", "comment_text": "A very good time of the year to come. Local/regional trains have fixed prices, thus no need to book. Italo trains are more affordable if booked in advance."}, {"username": "Anton Raul", "comment_text": "I was there last march and yes, it is pretty busy. For example, we weren’t able to buy Vatican Museum tickets because they were unavailable . Also, there were no tickets for the Colosseum.\nAs for trains, we didn’t need to buy tickets in advance. We bought them right before we used them. 🙂"}, {"username": "Sharon Menegoni", "comment_text": "I was there this past March from the 18th until the 31st. No crowds, mild temperatures, there were some lines but not too bad"}, {"username": "Sipra Roychoudhury", "comment_text": "Best time to visit March, April, September and October"}, {"username": "Carine Brys", "comment_text": "You have to be lucky. We went to Rome for 5 days mid-March 2023. We had blue skies and temps in the low 70'ies (low twenties Celsius). But after we left it rained for a couple of weeks... There were crowds, I cannot imagine what it must be like in the summer..."}, {"username": "Diane Wilkerson", "comment_text": "Pay attention to Easter week, usually crowded in the larger cities."}, {"username": "Graham Sherlock", "comment_text": "No"}, {"username": "Sam Mouchamel", "comment_text": "Not too busy …you don’t need to book anything"}, {"username": "Anna Maria Dolina", "comment_text": "Keep in mind that Easter is March 31st next year so it’ll probably be busy"}, {"username": "Kim Walts", "comment_text": "Spent most of March in Italy this year. Excellent time to go!"}, {"username": "Brandi Kartzmark", "comment_text": "following"}, {"username": "Daisy Yoo", "comment_text": "Hurts depends as Easter next year is April 1 st so last week of March will be busier"}]}, {"id": "2199185480480530", "text": "Travelling to Italy this September and spending 3 days in Dolomites. Do y’all have any recommendation for must have advance reservations in Dolomites?", "link": "facebook.com/groups/1373361046396315/permalink/2199185480480530/", "likes": 0, "comments": []}, {"id": "2199183127147432", "text": "First Time my family and I will be traveling to Europe. Specifically, Italy 2024. Looking for reviews on Tap Air Portugal? TIA.", "link": "facebook.com/groups/1373361046396315/permalink/2199183127147432/", "likes": 1, "comments": [{"username": "Ed Braz", "comment_text": "Difficult to forecast TAP’s performance in a year’s time. It is up for sale and the new owners may change operations that prevents anyone guessing what the future holds irrespective of what we know of their past."}, {"username": "Stephen Henn", "comment_text": "The food was not very good. Might want to bring your own."}]}, {"id": "2199182673814144", "text": "Recommendations for private boat tour to Capri for 2 people from Sorrento!\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2199182673814144/", "likes": 0, "comments": []}, {"id": "2199182067147538", "text": "Help!\n\nI am in Florence, using the “washer/dryer”. I washed already and now “drying”. The cleaning staff said *Vapore* is the dryer setting. Ummmm…help!\n\nIt’s a washer/dryer combo. Watching this situation I would be willing to be a lot of money that it’s not going to be dry anytime in this century.\n\nHelp!", "link": "facebook.com/groups/1373361046396315/permalink/2199182067147538/", "likes": 64, "comments": [{"username": "Silvia Arndt", "comment_text": "Used one of these at an Airbnb in Portugal. Once I got most of the wetness dry ...clothes was still damp and once hung up it dried pretty quickly"}, {"username": "Laura Uribe", "comment_text": "It takes about 3 hours total lol"}, {"username": "Laura Uribe", "comment_text": "Honestly, we almost exclusively use a laundromat lol. Just quicker and easier."}, {"username": "Albert Soifer", "comment_text": "Is the filter clear. The filter is in or below the door ."}, {"username": "PattiAnn Mazzella", "comment_text": "My grandmother had this machine, it never dried it was like a steam dry. Better off hanging outside to dry."}, {"username": "Donna Toma", "comment_text": "My son has something similar and he says it takes forever to dry the clothes. So at 58, he still brings his laundry to my house in Kansas from Pennsylvania...\n."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "In Florence there are 35 degrees, hang your clothes in the bathroom, open the window and close the door so that the apartment isn’t too hot: in 1/2 hour everything will be dry. And if the windows have hangers use them!"}, {"username": "Bea Kuckens", "comment_text": "When all else fails on instructions in another language, use a translator app or Google each word and piece the meanings together."}, {"username": "Teresa Vozza", "comment_text": "We found that European washer/dryer combinations take FOREVER to complete the full cycle."}, {"username": "Lisa Jagodzinski", "comment_text": "I used a combo in Italy and it never really dried the clothes. They were less damp but still had to hang them"}, {"username": "Louise Faggioni", "comment_text": "Washers take forever (hours) and always hung clothes out to dry😂"}, {"username": "Catherine Lackey", "comment_text": "It most likely won't be all the way dry, but will dry quick on a rack🤷‍♀️"}, {"username": "Samira Parker", "comment_text": "Failing that, and for anyone else without a washer/dryer, I've seen laundromats everywhere in Florence and used one yesterday. Was fast and inexpensive."}, {"username": "Laurie Francis Menk", "comment_text": "Yes dryer to the left!"}, {"username": "Colleen Church", "comment_text": "We have one on our boat , the only thing I dry are towels. The rest I hang"}, {"username": "Joan Adams Schilling", "comment_text": "We had one in Rome. Never did figure it out. Just ended up taking the clothes out and putting them on the provided rack"}, {"username": "Jennifer Cederholm-Wasescha", "comment_text": "Just hang your clothes"}, {"username": "Marie Hoey Dowdall", "comment_text": "Make sure to empty tank on left at top"}, {"username": "Kay Sloan", "comment_text": "They are a pain - we had one washed and dried 3 times - all nite - till it opened up !"}, {"username": "Ann Caruso", "comment_text": "It takes forever to dry clothes I would take them out and hang them up if that’s not an option go to the nearest laundromat and dry them in one of their dryers it should take 15 minutes hope this helps"}, {"username": "Hoa Ng", "comment_text": "Lol it took me all night to just finished one load."}, {"username": "Linda Jo Rice", "comment_text": "4 hours for a French combo"}, {"username": "Joanna Ruvolo", "comment_text": "The dryer part takes forever! Hang your clothes if you can. That’s what I ended up doing. I also probably ran it more than 1x because I couldn’t figure it out lol. Googled the directions 🤣"}, {"username": "Sarah Numbers", "comment_text": "Ugh yeah these things are the worst. Took me all night to do one small load and it still came out damp. 🙃"}, {"username": "Rhonda Robison Shirah", "comment_text": "We just used this in France. It won’t dry completely. We had to lay out our clothes overnight"}, {"username": "Lisa Burrill Davis", "comment_text": "It’s probably a condensation dryer. Will have a drawer that collects the water, that needs to be emptied probably once or twice before it’s done. Drying racks are quite common there for this very reason. Maybe where you are staying has one?"}, {"username": "Ashley Akermi", "comment_text": "Hang dry, the climate will have your clothes dry in a few hours"}, {"username": "Yana Jarman", "comment_text": "Make sure you empty out the water container. Took us a few tries to figure out why it took so long to dry but after that it was quick"}, {"username": "Sabrinna Suzzanne", "comment_text": "How great are all these suggestions. Love it."}, {"username": "Cheri Arrowood-Stanziano", "comment_text": "We You Tube videoed the one in our Italy VRBO\nGave up trying to dry and hung everything up"}, {"username": "Michele Prevette Cote", "comment_text": "We used one of these at our friends home in England, it took a few hours from start to finish but the clothes did come out dry! They had an\"iron dry\" setting on theirs"}, {"username": "Robýn Kretsçhmər Schuchårdt", "comment_text": "I used a similar machine in London and it worked fine!"}, {"username": "Rach LJ", "comment_text": "Rach LJ"}, {"username": "Rach LJ", "comment_text": "it sounded like steam and google confirms.. 😬\nThere are similar combos weve used in Japan and the dry cycle does take a while"}, {"username": "Annette Tamminga", "comment_text": "You can find the manual online"}, {"username": "Stephen Dawson", "comment_text": "https://\nyoutu.be/\ngc7PWT98GCg"}, {"username": "Natalia Ashton-Togher", "comment_text": "I have this washing machine. The dry setting is on the left - high heat and low heat. Low is adequate as the high can be too intense."}, {"username": "Andrea Hirsch", "comment_text": "Ok so the takeaway is that a “mini” load takes 3-4 hrs to dry!!!"}, {"username": "Dina Garrett", "comment_text": "Linda Williams, Julie Franco Mellow, BillandAngala Verley 🤣"}]}, {"id": "2199181873814224", "text": "Any of your memory from here?\nLet me know down here.", "link": "facebook.com/groups/1373361046396315/permalink/2199181873814224/", "likes": 14, "comments": [{"username": "Elena Innocenti", "comment_text": "May 2020. First day we can go out home after lockdown. No one here."}, {"username": "Tanya Heenan Gammon", "comment_text": "August’21 lol"}, {"username": "Anwen Ingram", "comment_text": "Just this week. Go early as you can , it's crazy with people otherwise."}, {"username": "Bob Cinquini", "comment_text": "I was last there in 1979. It was in the evening and I was 17 yrs old. My mom told me if I threw a coin in the fountain that I would Someday return. Well, in October of this year, I will be returning. You see, dreams to come true."}]}, {"id": "2199169317148813", "text": "My husband and I are on a cruise that stops in La Spezia in September. Of course most will go to Cinque Terre but we were there in the last two years. Does anyone have any suggestions for other adventures in that area?", "link": "facebook.com/groups/1373361046396315/permalink/2199169317148813/", "likes": 1, "comments": [{"username": "Ken Lerch", "comment_text": "Bay of Poets"}, {"username": "Luigia Gray", "comment_text": "Porto Venere is a gorgeous town and from memory not too far away."}, {"username": "Silvia Urbinelli", "comment_text": "A day trip to Genova"}, {"username": "Sopra la Roccia", "comment_text": "Verso versante altro lato dek Golfo, Lerici e poi Tellaro"}, {"username": "Alice Francesca", "comment_text": "Lerici and bay of poets"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "You can take one hour train and go to Pisa, to Lucca or to Genava"}]}, {"id": "2199162270482851", "text": "Any recommendations for a tour company for puglia and what to see in puglia", "link": "facebook.com/groups/1373361046396315/permalink/2199162270482851/", "likes": 2, "comments": [{"username": "Winner Fatoyinbo", "comment_text": "If this could be related\nI recommend you get this helpful travel guide titled \"Puglia Travel Guide 2023: Discovering Unexplored Treasures, Tourist Attractions, and Historical Wealth. by James D. Vollmer (Author) available on Amazon\nThis guide provides you with more detailed information on how to plan your visit and things you can can do, accommodation options and many more.\nHave a wonderful time!"}, {"username": "Deacon Tom Lang", "comment_text": "My friend and Italy travel agent, Louis Falconeri, is planning a trip for next year to that very region!"}, {"username": "Marie Cuzzi", "comment_text": "It’s beautiful!!! I visited 3 years ago before it became so popular enjoy every minute"}, {"username": "Meghan Tan", "comment_text": "Sophie Minchilli in Rome has information on Puglia"}, {"username": "Cassandra Goodgame", "comment_text": "Antonella at Arrividerci Puglia!"}, {"username": "Mary Mol", "comment_text": "Thank you"}, {"username": "Jeanie Brown", "comment_text": "Experience Puglia - private and small group tours Angelo Coluccia. The best! I’ve done two tours with him."}, {"username": "Cat Furness", "comment_text": "This is who I used in Lecce for a day tour to Otranto & the Adriatic coast\nInfoLecce • Turismo nel Salento\nThe office is in the Piazza Duomo"}]}, {"id": "2199157377150007", "text": "Looking at luggage requirement for carry-on baggage. We are traveling American Airlines from BNA to JFK and the carry-on requirement is 22x14x9. From there we transfer to Alitalia Airlines from JFK to Rome and the Rome to Genoa. It appears the carry-on requirements for Alitalia Airlines is smaller than AA at 18x14x10 and 11 lbs. How strict is this enforced and we will have an issue if the bag is within the AA requirements but over the ITA requirements?", "link": "facebook.com/groups/1373361046396315/permalink/2199157377150007/", "likes": 4, "comments": [{"username": "Janet Walls", "comment_text": "For European flying, if it doesn't fit in the pre-boarding sizer, there will be an excess charge."}, {"username": "Chuck Morton", "comment_text": "Please folks...stop asking this question and just adhere to the requirement. One airline doesn't honor another airlines requirements. If you want to take your chances then fine..."}, {"username": "Stephanie J Stevenson", "comment_text": "Assume it will be enforced and plan accordingly. No one knows in advance. Choose your path."}, {"username": "Miyuki Kanno Paul", "comment_text": "Are you talking about ITA Airlines? Alitalia no longer exists"}, {"username": "Allison Mir", "comment_text": "Be prepared to pay excess baggage and/or put you your bag in the hold"}, {"username": "Allison Mir", "comment_text": "https://\nwww.ita-airways.\ncom/en_gb/\nfly-ita/baggage/\nhand-baggage.htm\nl"}, {"username": "Bonnie Loftspring", "comment_text": "European airlines have enforced regulations. Their planes are smaller, their overhead capacities are smaller. The guidelines reflect that."}, {"username": "DeAnna Pulliam Like", "comment_text": "If it is a carry-on, and you want to keep it as a carry-on and not be forced to check it, you need to go with the smaller size requirement. We had the same situation - different airlines. You need to go with the most strict requirements to be able to keep it as a carry-on. Safe travels!"}, {"username": "Susan Donlan", "comment_text": "This was strictly enforced when we were in Italy"}, {"username": "Misty Thomas Walsh", "comment_text": "European carry on sizes differ from US. It must be the European size or you will have to check it for a fee"}, {"username": "Paula Brink", "comment_text": "Assume it will be enforced. On my last trip in April I saw lots of people having to gate check their carry ons."}, {"username": "D'Anna Hohe", "comment_text": "I don’t know why people are so offended by this question. It isn’t totally clear whether or not this is a code share flight and code shares often honor the ticketing airlines regulations. You may be correct in this case, but I also think that this might be a very valid question depending upon the circumstances. Everyone is way too quick to jump on the people asking the questions when questions are precisely the reason this group exists."}, {"username": "Jennifer Johnson Mayes", "comment_text": "I just flew from London to Italy to Greece and my carry on baggage was within the size for each airline and becuase the flight was so full, they took my carry on and checked it - no extra fee but it defeats the purpose of carrying the right size. The flights are oversold so they are just doing what they can to get the planes off and running and not worrying about people hauling their luggage onboard"}, {"username": "Doug Burke", "comment_text": "I've found with these carry on requirements and you're slighty over, a LOT depends on the mood of the guy at the gate. If he just won 10 Euros in the lottery, you're probably good. If he just found out his wife is sleeping around, plan on handing over the carry-on."}, {"username": "Renee Rundle Stoneham", "comment_text": "Is this booked as 1 ticket?\nBecause AA is not a partner airline of ITA, ITA is not one world partner.\nIf it was your status with AA (if you have any) would transfer over.\nWe flew AA then IB and since we have status we’re able to carryon our rollers (mine is 21” including wheels)\n\nIf you are on separate tickets you might have to go to the ticket counter at JFK and check in them go back through security.\nNot sure if the gate agents will check it for you….that might cost $$$ depending on your class of ticket.\n\nWhichever the case is they have sizers to place it in and you can see if it fits big difference from 22” to 18”… the wheels get caught up etc.."}, {"username": "Brian Osman", "comment_text": "Always check with the airline directly, you can get some bad luggage advice on here"}, {"username": "Delaine Remle Botelho", "comment_text": "Look at the luggage reqs for all airlines you are flying and adhere to the strictest/\nsmallest reqs."}, {"username": "Lisa Silverman", "comment_text": "Ita weighed our checked luggage, but no one looked at the carryon."}, {"username": "Christine Pinto Kulp", "comment_text": "Per ITA website on baggage…carry on suitcase is listed as 21.7” height, 13.8” width and 9.9” depth (all converted from centimeters). Weight limit is 17.6 lbs (8 kg). Personal item is listed as 17.7” x 14.2” x 7.9” with no weight limit."}, {"username": "Bonnie Rodgers Henderson", "comment_text": "I bought the bag with the smallest measurements so it would work on any airline"}, {"username": "Carol Ryan", "comment_text": "Always go with the smallest and lightest of all the airlines you are using. No problem then."}, {"username": "Pat Petrello", "comment_text": "I wonder if those newer collapsible bags will count as a carry on and fit under the seat?\nI’ve never tried one."}, {"username": "Angela O'Donnel", "comment_text": "On the way there it was no issue, but on the way back I saw several people forced to pay and check their carryon that was not within the guidelines"}, {"username": "Giovanni Pianigiani", "comment_text": "Alitalia airlines? Tell me you're an old time traveller without actually saying it!😅\nhttps://\nwww.ita-airways.\ncom/it_it"}, {"username": "Benedetta Vanni", "comment_text": "It's not a matter of how strict the controls are: it's just that your carry on item will not fit in the overhead lockers!"}, {"username": "Brian Marcus", "comment_text": "My experience is that intra European flights are pretty restrictive with luggage size."}]}, {"id": "2199152010483877", "text": "Hello,\nMy husband and I have the opportunity to visit Italy for 7 days (not including travel time) — is this enough or should we look into doing something else? We have two young children and my mom has offered to watch them for 9 days total. This opportunity wouldn’t come up again for awhile, so we were thinking why not just give it a go! Neither of us have ever been before, so maybe just share the must see places or if you’ve done a “quick” trip before! TY 🫶🏼", "link": "facebook.com/groups/1373361046396315/permalink/2199152010483877/", "likes": 8, "comments": [{"username": "Nancy Brennan Carrow", "comment_text": "We went for our first time in June. We flew into Naples and stayed in Sorrento for 3 nights with day trips to Capri & Amalfi Coast. Then took the fast train to Rome for 4 nights. Amazing vacation! I would suggest picking one or two home base cities and do day trips based on your interests."}, {"username": "Renae Larcus", "comment_text": "Go. Don’t pass up the opportunity. Don’t try to do too much. Maybe pick one or two places max."}, {"username": "Kathy Fryer", "comment_text": "Go! Go! Go! Just Go!"}, {"username": "Miyuki Kanno Paul", "comment_text": "What month of the year are you going? Get a copy of Rick Steves Italy guidebook and start narrowing down the locations. Seven days aren’t enough to see everything, so start from which airport you are arriving/\ndeparting."}, {"username": "Karen Smart", "comment_text": "Go for it! Just pick 2-3 places and enjoy! You won’t regret it!!"}, {"username": "Roland Trego", "comment_text": "Yes. I would suggest just two destinations, probably Rome (3 days) and the Amalfi Coast (4 days), assuming you will be going from late spring to early fall. That combination will give you a taste of urban sophistication and laid-back dolce vita with sea and sun."}, {"username": "Debi Lubiani DeLoney", "comment_text": "I agree! Pick two cities and concentrate on doing things there and take your time. You will have a great time just don’t go in Summer months"}, {"username": "DeAnna Pulliam Like", "comment_text": "Yes! Definitely go!!! 💚🤍❤️ As someone else has suggested... look up Rick Steve's guidebooks. I would recommend doing a mix of staying in one bigger city, and maybe one smaller town. For example, Florence for 4 or 5 days (can do a day trip to Tuscany, maybe a day trip to Lucca), 2 or 3 days in Cinque Terre. We just stayed in Manarola. Highly recommend! Enjoy your time together!"}, {"username": "Rebecca R. Russo", "comment_text": "We just arrived back from 10 nights and 11 days.... Absolutely so much to see and not enough time. Focus on the things that are of interest to you!"}, {"username": "Donna Gilardone Szwabowski", "comment_text": "Go, but just pick a couple of places to see and enjoy"}, {"username": "Laurie Frainetti", "comment_text": "Venice and Rome OR Rome and Amalfi Coast!"}, {"username": "Anna Gambino", "comment_text": "Just go! 🇮🇹❤️🇮🇹"}, {"username": "Robýn Kretsçhmər Schuchårdt", "comment_text": "Yes! Go!"}, {"username": "Cynthia Tarantino", "comment_text": "Not sure where you are traveling from...but I say go for it!"}, {"username": "Steve Grossman", "comment_text": "Flying to florence, Two days, Take a train to lower tuscany , Two and one inhalf days, Take a train to rome , Two and a half days in rome and fly home from rome. You will get to see two major cities including antiquities, And also the beauty of tuscany. you can do this in seven days. Do it!!"}, {"username": "Lisa Martinson", "comment_text": "Go!"}, {"username": "Phyllis Snyder", "comment_text": "Yes go! Just go to one place and throughly enjoy it."}, {"username": "John Licata", "comment_text": "Go"}, {"username": "Evi Fulford", "comment_text": "Try for more time, but if not, go for it anyway just limit where you go do you don’t waste your time traveling"}, {"username": "Romina Lauretig Toscano", "comment_text": "Go!"}, {"username": "Glenn Todd Webb", "comment_text": "7-9 days is a start. Take what you can. Pick 2 cities like Rome and Florence for first visit. Day trip to tivoli from Rome. See Lisa or Lucca from Florence. Fly in one and out the other. Train in between. Get a Frommers of Fodors guide book."}, {"username": "Lisa Whittle", "comment_text": "Stay in Lucca beautiful place within the wall and then from there you can do day trips to Florence, Cinque Terra, take a day tour to Siena, San Gimignano and Pisa and always return to beautiful Lucca 🤍"}, {"username": "Karen Schmidt", "comment_text": "Absolutely go for it!"}, {"username": "Frannie Kaplan", "comment_text": "It depends what you like and when to go. I would focus on one area or perhaps two and possibly get a car. If you like historical things there's always some to choose from, but you need to specify your area"}, {"username": "Jeff Gentner EA", "comment_text": "Pick two places and absorb them. There's a huge difference between SEEING Italy and EXPERIENCING Italy. It's a huge country. Take your time. For a first trip, I'd pick Rome and either Venice or Florence. From Florence, maybe a day trip to Siena."}, {"username": "Elena Innocenti", "comment_text": "Roma and Firenze."}, {"username": "Janell McClung", "comment_text": "We did 7 days December\nFlorence and SIenna, didn't rent vehicle in Florence as very walkable, rented car other 3.5 days and drove into hill towns.\nVery doable."}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "Do it!!! Pick a couple of places as your \"home base\". Florence and Sorrento maybe? Then you could add a couple day trips to each of those."}, {"username": "Daisy Yoo", "comment_text": "If u just have 7 days , and if u are very into art and history , Italy is big , we will be in Rome 5 whole days and I wish I can do 7 , if u are semi obsessed with art, history and all , at least Rome deserve 3-4, and I would then go to Florence for the rest of days and fly back from there , as Florence needs 2 whole days , there are a lot more to see then what y may read , then I may do a day trip out of Florence to (Lucca, Pisa) or (Siena , San G)"}, {"username": "Kimberly Moser Horincewich", "comment_text": "Rome and Venice!!"}, {"username": "Marie Barré", "comment_text": "Never miss an opportunity to visit Italy. Take advantage of this chance. Maybe make Florence your home base and do day trips to other areas of Tuscany."}, {"username": "Virgz Van Møøre", "comment_text": "It will never be enough. Concentrate on what interests you the most"}, {"username": "JeriLynne Clifford", "comment_text": "I would only stay in one area and maybe do a few day trips. Figure out what you want the most of (museums, wine, food) and that can lead you where to go. Also, try and fly into a bigger city. We fly into Milan.\nWe tend to settle into smaller areas like Turin and piedmont area, Montalcino or other small Tuscan town or Emilia Romagna for food.\nRome or Florence for museum/history."}, {"username": "Scott Perry", "comment_text": "If you do go, look into the melatonin regimen for jet lag."}, {"username": "Tari Lawson", "comment_text": "A week can be enough. I spent a week in Rome with my mom and we had an amazing time."}, {"username": "Laura Uribe", "comment_text": "Plenty of time. Pick no more than two towns for your base so you don’t waste all your time traveling and changing hotels. You can take day trips to places near where you’re staying. Have a wonderful time!"}]}, {"id": "2199149267150818", "text": "Looking for accommodations for 4 people in Pantheon/Piazza Navona/ Campo de Fiori area. I have noise sensitivity issues. I realize this is a busy area and will likely be loud, so I'm wondering if anyone has experience with staying in a place near here that was quiet? I have only found one place that mentions triple glazed windows so far.", "link": "facebook.com/groups/1373361046396315/permalink/2199149267150818/", "likes": 0, "comments": []}, {"id": "2199148180484260", "text": "Hello! We are doing a self-guided tour of the Italian Lake District after visiting the alpine region. Haven’t decided if we want to rent a car (like a Fiat 500) or take the train. We want to see Lakes Como, Maggiore and Garda. Pros and cons of taking the train around the region vs renting a car. I know we can do this from Milan.", "link": "facebook.com/groups/1373361046396315/permalink/2199148180484260/", "likes": 0, "comments": [{"username": "Connie Wilson", "comment_text": "Very accessible by train and good ferry system."}, {"username": "Renae Larcus", "comment_text": "We took the train to Varenna from Milan and used the ferry to get around to other lake towns. Same thing at Lake Garda. Took the train to Desenzano and took a taxi to Sirmione. Used the ferry from there"}, {"username": "Alice Francesca", "comment_text": "At lake Garda forget the car and use ferries.You can park in Desenzano and get ferries to take you anywhere from top to bottom.I lived in Salo'"}]}, {"id": "2199144877151257", "text": "Traveling by train with my parents from Rome to Sorrento. I know we have to change platforms in Naples from Centrale to Garabaldi in order to continue on. How much time is needed to do that? There is a train that arrives at 1413 and the other one leaves at 1426. Too close?", "link": "facebook.com/groups/1373361046396315/permalink/2199144877151257/", "likes": 0, "comments": [{"username": "Angela Gilmore", "comment_text": "Hi, I think they are too close. I mean, the two places are in the same station, only different zone, different platforms. If you know the station you'll take 3 Min to reach Circumvesuviana\nplatform 3 (train to Sorrento, Campania Express I guess). Problem is that the station is big and chaotic, many people arriving and leaving. And you could miss your train. Have you already bought the tickets?\nBecause there is another train to Sorrento that leaves every 30 min approximately. You could take this and not the CE."}]}, {"id": "2199144137151331", "text": "Hi All! My family and I are heading to Positano in a few weeks and we are looking for a boat tour to Capri. We are 4 adults and are not looking for a private boat. Please lmk if you have any recommendations!", "link": "facebook.com/groups/1373361046396315/permalink/2199144137151331/", "likes": 1, "comments": [{"username": "Wahab Sidharta", "comment_text": "Ferry would be great"}, {"username": "Melissa Feielin Hawkins", "comment_text": "Check out Get my boat .com\nMy husband is a captain and we run boat charters in Las Vegas. Most our bookings are from that site. It’s global. We found boats w/captains when we where in Amalfi and Venice earlier this month."}, {"username": "Steve Grossman", "comment_text": "Just get on the ferry several times a day, right at the dock.\nGet your tickets. It's a very short ride to capri from there"}, {"username": "Liz Zibaitis Condon", "comment_text": "This company was great. We were on a boat tour that got 12 people"}, {"username": "Sigrid Cormier", "comment_text": "Google ferry to Capri, cheap and cheerful. Several ferries per day. Just be mindful of timing of last ferry, get to the port early to ensure you get on."}]}, {"id": "2199139373818474", "text": "Florence🇮🇹\n\nOur first experience with the train was not as difficult as I had feared. Booking through the Trenitalia app was great because I could see our train number and platform before it was even posted on the board. The business class seats were really comfortable.\n\nIt was not to find taxis in Florence for 5. Our hotel said there’s only 4 vans in Florence that can seat over 4 people. We walked about 0.7 miles to hotel. Very hot even though not far. It was 104 degrees Fahrenheit.\n\nWe checked in at Arte Boutique hotel. Beautiful boutique hotel and beautiful room. It was the only room we got that fit all 5 of us. We had 2 hotel rooms everywhere else.\n\nWe ate at Gozi Firenza near hotel. Very good lunch and service.\n\nWe went to central market and wish we would have eaten here just due to the variation of choices. Got some souvenirs, tasted olive oil and balsamic vinegar, cocktails to carry around while shopping, ate a cannoli.\n\nWe could walk to Galleria del Accademmia from our hotel. We had tickets bought online prior for 16 euro a person-no tour. Only about a 5 min wait since we were early. Went right in to see the Art and David. We headed back to shower and rest before dinner.\n\nWe had dinner at Trattoria Za Za-read many mixed reviews. We booked months in advance. Great service. Great food and wine!\n\nWe found a wine window about 5 min walk to Cantina de Pucci. Really fun and unique experience!\n\nWe walked to duomo to see some of the shops and had some gelato.\n\nWe were only able to stay in Florence for 2 days; we enjoyed it but it was ranked last according to our teens (age 19, 17, and 14)", "link": "facebook.com/groups/1373361046396315/permalink/2199139373818474/", "likes": 50, "comments": [{"username": "Diane Desmond Rosenfeld", "comment_text": "Wonderful pictures!"}, {"username": "Tara Roed", "comment_text": "Great review! Curious to know your teens favorite spots. Mine loved positano the most 🤣"}, {"username": "Cindy Neilson", "comment_text": "My daughter and I had a beautiful meal at Drogheria Bar & Grill ... 😊🇮🇹"}, {"username": "Betty Bartlett", "comment_text": "Beautiful family, thanks for sharing"}]}, {"id": "2199131430485935", "text": "Looking for those who have explored the Dolomites. Any info and recommendations appreciated!", "link": "facebook.com/groups/1373361046396315/permalink/2199131430485935/", "likes": 0, "comments": [{"username": "Stephen Henn", "comment_text": "If you hike at Seceda be sure to have a meal at Daniel’s Rifugio. So good!"}]}, {"id": "2199128757152869", "text": "Hello! Suggestions for Airbnb location in Florence that that is safe and central to most things? Will be there for 3 days. Thank you!!", "link": "facebook.com/groups/1373361046396315/permalink/2199128757152869/", "likes": 0, "comments": [{"username": "Lori Winchell Crestfield", "comment_text": "Following for the same advice"}]}, {"id": "2198717593860652", "text": "What type of store would I go to to find reading glasses? You know, the type for old people lol. At home I can find them anywhere pretty much from dollar stores to pharmacies hardware stores etc. thanks￼\nUpdate…. Found in a pharmacy but they’re at the counter and they just have a display and then they bring you the type that you need.", "link": "facebook.com/groups/1373361046396315/permalink/2198717593860652/", "likes": 0, "comments": [{"username": "Lee D'Angelis", "comment_text": "Pharmacy’s should sell them"}, {"username": "Sharon Williams Sellers", "comment_text": "￼ I bought several of them on Amazon. I’ve been very happy with them."}, {"username": "Cecilia Christine Costantini", "comment_text": "Pharmacies (more expensive, maybe 5-10 euros), street markets (I bought 3 pairs for 5 euros)"}, {"username": "Theresa Salerno Adams", "comment_text": "Farmacia"}, {"username": "Stephanie Smith", "comment_text": "Saw them in the Coop grocery store"}]}, {"id": "2199085793823832", "text": "DAY 5 - MATERA\nWhen it comes to exploring Matera, the best course of action is to ditch the map and just get lost, you are bound to come across the major attractions without necessarily looking for them.\nBut be careful,nyou will involve a lot of walking, and as the city is hilly, hot—especially now in the summer—and completely out in the open, you’ll want to make sure you pack comfortable shoes and plenty of water.\nIn Matera you will come across an incredible landscape : you can sleep in a cave and also have an aperitivo in a cave!\nWhere to stay: The Locanda di San Martino lies in the heart of Matera's Sassi Historical District, and at the same time it is conveniently located at a very short distance (100 meters) from the city center. You will enjoy a wonderful view of the Sasso Barisano! Have a look here: https://www.tkqlhce.com/click-100692842-11552042?url=https%3A%2F%2Fwww.tripadvisor.com%2FHotel_Review-g187772-d584493-Reviews-Locanda_di_San_Martino_Hotel_e_Thermae-Matera_Province_of_Matera_Basilicata.html%23%2Fmedia%2F584493%2F676760105%3Ap%2F%3Falbumid%3D101%26type%3D2%26category%3D101\n#matera #materaitaly #sassi #materasassi #basilicata #italy #italytravel #italianstyle #italy_vacations #cityview #city #cityscape #Romantic #wonderfulplaces #wonderfullife #HiddenGems #secretplace", "link": "facebook.com/groups/1373361046396315/permalink/2199085793823832/", "likes": 15, "comments": []}, {"id": "2199249070474171", "text": "Colosseum & Roman Forum - panorama.\nMy photo. ☮️", "link": "facebook.com/groups/1373361046396315/permalink/2199249070474171/", "likes": 622, "comments": [{"username": "Teresa Helminski-Renzhofer", "comment_text": "Raymond Albert Helminski"}, {"username": "Jan Strachan", "comment_text": "What is all that construction?"}, {"username": "Randy Lee", "comment_text": "What a great picture!! Visit Rome in October ant wait"}, {"username": "Olivia Meyler Thomas", "comment_text": "Loved it we had the best tour guide Visit Italy with Robert had great stories to tell"}, {"username": "Andrew Simmons", "comment_text": "Beautiful!"}, {"username": "Przemo Ciepły", "comment_text": "Przemo Ciepły"}, {"username": "Gilles Martin", "comment_text": "Dommage les travaux routiers brise la photographie, mais merci du partage"}, {"username": "Francisco Fontecha Castellano", "comment_text": "Y Arco de Constantino"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2199251613807250", "text": "Could anybody recommend a reliable taxi or transfer company from Sorrento to Naples airport on a Sunday morning at 8am? What's the average price for a private hire travelling this route? TIA\n\nReposting with picture to see if I get any responses 😂", "link": "facebook.com/groups/1373361046396315/permalink/2199251613807250/", "likes": 51, "comments": [{"username": "Miyuki Kanno Paul", "comment_text": "I know that restaurant in Sorrento🤣\nThis establishment claims that they are the inventor of cannelloni"}, {"username": "Jenifer A Broyles", "comment_text": "I used Mandara car services. They were very kind. I think it was 150 euros"}, {"username": "Carol Potter", "comment_text": "I also ate at that restaurant! I remember me and one of the ladies at our table drank a whole bottle of wine."}, {"username": "Carmela Siniscalchi Frattellone", "comment_text": "I just paid. 100€ . My hotel arranged the car service so unfortunately I don’t have the name."}, {"username": "Theresa Sorrentino Pagan", "comment_text": "We’re taking the ferry over, but since you’re leaving so early not sure if that is an option"}, {"username": "Kateryna Fedyushkina", "comment_text": "Not more than 100€. Better to take a ferry,25€ per person"}, {"username": "Laurie Shumate Allen", "comment_text": "We used Aequalimo Limo car service from Sorrento to Naples train station & they were perfect. 100 euros. Very reliable. Super clean van.\nhttps://\nwww.aequalimo.co\nm/transfers"}, {"username": "Lisa Marie Corcoran", "comment_text": "We are using Amalfi Coast Transfers for all of our transfers. We are using them for Naples to Sorrento along with all our tours/driving while we are there and then Sorrento back to Naples!"}, {"username": "Lyn Pappas Dahm", "comment_text": "Ask Amalfi Coast Transfers"}, {"username": "Adrian Astridge", "comment_text": "We used Giuseppe Staiano for our transfers and found him to be friendly, reliable and very well priced!! 👌\nhttps://\ninstagram.com/\nstaianotransfers\n?igshid=MzRlODB\niNWFlZA%3D%3D"}, {"username": "Giuseppe Placi", "comment_text": "Transferelax eur 90 if they are available"}, {"username": "Bev Madill", "comment_text": "I recently used Transferelax from Naples train station to Sorrento and return. Great company and I’m sure they do airport transfers as well."}, {"username": "Yvonne Hainey Williams", "comment_text": "We payed 150 euros when we arrived , on the way back we got the bus it was early morning and we seen so much . 10 euros to the airport much more affordable."}, {"username": "Nancy Fricke Corsi", "comment_text": "Sorrento Transfers. I think it will as like 150€"}, {"username": "Kornelia Ilieva", "comment_text": "https://\nwww.curreriviagg\ni.it/mobile/en/\nnaples-airport-s\nhuttle/\nWe took this one from train station in Sorrento to Naples airport"}, {"username": "Darlene Dommermuth", "comment_text": "All Around Italy\nFabrizio +39 334 3346131\nA family owned and operated. Awesome!!!"}, {"username": "Elyse Lichtman-Scheiner", "comment_text": "Royal Positano Limousine was reliable and reasonable $$. Beautiful car, great driver. We were charged $140 to go from Positano to Naples Airport at 3:00AM."}, {"username": "Carine Boon", "comment_text": "There is a bus from the airport to Sorrento station. No need to spend so much money!"}, {"username": "Jennifer Smith Tanouye", "comment_text": "We used this service a few years ago. Pick up at Naples train station—stoped for a couple of hours in Pompeii (our request) then on to Sorrento. Also used them on the return trip to Naples. Not sure re:pricing as it’s been awhile, but the overall experience was great.\n\nhttps://\nwww.compasstour.\nit/it/"}, {"username": "Daniela Michael", "comment_text": "Daniela Michael"}, {"username": "Sue Gorman-Ellens", "comment_text": "I celebrated my 50th birthday in this restaurant , such a lovely place ￼😃"}, {"username": "Janice Maclean", "comment_text": "We always use Sun transfers. Very reliable. But in Sorrento we have always just got the airport bus. Leaves from the centre of town. Even early starts. X"}, {"username": "Megan Leigh", "comment_text": "I don't have an answer but I LOVE the totally unrelated picture for attention! 😂😂💜"}, {"username": "Danielle Gervais", "comment_text": "But why don’t you ask your hotel?"}, {"username": "Jeff McLellan", "comment_text": "We paid €155 to get from Sorrento to Naples for a Mercedes Van."}, {"username": "Donna Accardi Switzer", "comment_text": "Donna Accardi Switzer"}, {"username": "Courtney Larson Bryant", "comment_text": "I just used Monetti taxi/tour service in that region Rick Steve’s recommendation and they were prompt honest clean and polite\nUsed 3 different times"}, {"username": "Angie Stanard", "comment_text": "Ask your hotel to make arrangements for you"}, {"username": "Darlina MX", "comment_text": "Great recommendations\n!\nThanks!"}, {"username": "Elizabeth Comeau Farnham", "comment_text": "Sorrento Choice!!"}, {"username": "Matthew Cawley", "comment_text": "We did coach from train station which was €10 each"}, {"username": "Michelle Solak", "comment_text": "If you’re staying at a hotel, ask them for recommendations\n! That’s what we did and it was very convenient"}, {"username": "Monica Celestina Galan", "comment_text": "Drive Through Paradise"}, {"username": "Teresa Marina", "comment_text": "We paid 150 euros but we got a van."}, {"username": "Sandra Todd Coffey", "comment_text": "Info@angelodriv\ner.com I just booked him to pick up at airbnb in sorrento to naples airport 130€ for 5 people, i was reccomeded from this group"}, {"username": "Nicole Lee", "comment_text": "Sorrento house travel- gaetano"}]}, {"id": "2199251793807232", "text": "Looking for a place to stay in Campo di Fiori Rome for three nights in September. 😊", "link": "facebook.com/groups/1373361046396315/permalink/2199251793807232/", "likes": 3, "comments": [{"username": "Kim Aranha", "comment_text": "There are quite a few airb&b in Campo dei fiori and nearby- I would go on the website - wonderful part of Rome. The Campo wakes early setting up the market - can be noisy!"}, {"username": "Carrie Teller Badger", "comment_text": "We’re staying at a hotel that appears to be a 4 min walk to Campo di Fiori. Hotel Smeraldo. Haven’t stayed there before but I’ve heard very good things about it."}, {"username": "Leo Gomez", "comment_text": "https://\nwww.hotelcampode\nfiori.com/en/\n\nI had a wonderful stay there and short walk to many great restaurants."}, {"username": "Shirley Nicholls", "comment_text": "Definitely Campo di Fiori hotel....stayed\nand loved it"}, {"username": "Diane Chmielorz", "comment_text": "Hotel Lunetta is steps away from Campo di Fiori. Real nice hotel with good breakfast."}, {"username": "Ronald Margherio", "comment_text": "Hotel Pomezia is very near the Smeraldo and costs less. Simple, but very nice."}, {"username": "Jay Cabrera", "comment_text": "I love that area! It’s an awesome spot!"}, {"username": "Marie-Josée Veilleux", "comment_text": "MZ Hotel"}]}, {"id": "2199258670473211", "text": "When you arrived at each city, what was your choice of transportation to get around the city to do some sightseeing? Car, foot, bus, scooter/vespa?... Im terrified of the rental car or Vespa to be stolen when parked...what are your thoughts on that?\nWhat was your choice to do the sightseeing? Thanks in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2199258670473211/", "likes": 16, "comments": [{"username": "Roland Trego", "comment_text": "Can you tell us your destinations? Rome's centro storico (historic center) is very walkable. In Venice you can only walk or take a boat. To get to the Amalfi Coast, take the ferry or private transfer from Naples. Once you are there, the ferries are a good choice. The local government has put restrictions on the use of rental cars. There are buses as well. In Florence, you can walk nearly everywhere. From Florence, you can take the train to Siena, Lucca, and Pisa, and train+bus to San Gimigano. Otherwise, the Tuscan countryside is not very well served by public tranport. A car comes in handy. Milan: walk and public transport. Lake Como: take the train there and ride the ferries around the lake. Puglia: a car is necessary to really see things, though the east coast is reasonably well served by train. Sicily: the major towns are served by train, but if you want to see many of the villages inland, you'll need a car. Dolomites: a train will take you to the bigger towns, but to really see anything, a car is necessary."}, {"username": "Kristina Ruk", "comment_text": "In Rome it was metro ;) if you are staying in center so walking😉"}, {"username": "Stella Dee", "comment_text": "Taxis are everywhere and are reasonable."}, {"username": "Jason Hobel", "comment_text": "We walked everywhere in Rome, Florence and Sorrento. We averaged around 13 miles a day and loved every minute it. You get to see take it all in while on foot. The only time we used trains was for traveling from one city to another."}, {"username": "Tad Hashimoto", "comment_text": "E-scooters rentals all the way. No way we could have done everything we did without them.\n\nRiding them through Rome was a bit nuts, though. Street traffic in Rome is insane if you're not used to it."}, {"username": "Sue Sherwood", "comment_text": "We walk or take public transportation.\nSometimes a cab."}, {"username": "Sue Sherwood", "comment_text": "The big red bus is a good way to see all the highlights."}, {"username": "Graham Sherlock", "comment_text": "Walk everywhere"}, {"username": "Suzanne Mills", "comment_text": "Train"}, {"username": "Tonsia Keytel", "comment_text": "Walking, trains, trams. Get a very good pair of walking shoes, my Hoka’s were a lifesaver, I usually live in flip flops😁 but not while traveling."}, {"username": "Rachael Richardson", "comment_text": "Everywhere is walkable if you are fit unless you want to go outside the main town - foot and train for us !"}, {"username": "Jules Blumke", "comment_text": "I have always relied on public transportation."}, {"username": "Rhona OConnor", "comment_text": "I stay beside the train station... Then public transport all the way. Google maps for directions. Easy!!"}, {"username": "Paula Brink", "comment_text": "We walk everywhere, use taxis sometimes. We have had rental cars on some trips - the Amalfi, Puglia, driving up the Adriatic coast, driving from Florence to Rome, but we would leave it parked except when moving locations or in Puglia we did a lot of day trips to neighbouring villages. Never worried about it getting stolen.\nVespas are a bad idea unless you have ridden one a lot in busy city traffic before. Not recommended for getting around the city. Vespa tours in the Tuscan countryside sure maybe, if you are a good calm driver with good spatial ability."}, {"username": "Phyllis Snyder", "comment_text": "Hop on hop off bus."}, {"username": "Rhonda Russell", "comment_text": "I walk. If there is a walking tour I will take one to get the layout and some local knowledge, and then wander."}, {"username": "Debbie Potter", "comment_text": "Thank you everyone...you all helped with my planning."}, {"username": "Brice Blosser", "comment_text": "We have walked a ton.\nNo hassle trying learn something in a different country. We have taken the trains, buses, and even rented a car too.\nWalking you get to see a lot without having to worry about parking or driving on a one way, entering a restricted area"}, {"username": "Russ Heinemann", "comment_text": "Feet."}, {"username": "Mike Adams", "comment_text": "Mostly rental car.\nHop on Hop off bus in Rome - got it for 2 days"}, {"username": "Lee Say Lor", "comment_text": "My 2 legs"}, {"username": "Marie Cuzzi", "comment_text": "If you google the city’s you are visiting you should get the link you need it’s a great way to see the sights I was traveling alone and it was perfect for me for it in Italy and also France"}, {"username": "Renae Larcus", "comment_text": "In big cities no car needed. We walk a lot, take Uber or taxi if necessary. In Tuscany, however, it’s very hard to get from town to town without a car."}, {"username": "Steve Grossman", "comment_text": "Bus and foot"}, {"username": "Mike Adams", "comment_text": "Lack of Parking and narrow Medieval alleys are a bigger reason not to rent than theft."}, {"username": "Victoria Marchetti", "comment_text": "Lime scooters were fun. There is a scooter share called Cooltra. Itsblike lime but smaller mopeds with helmets"}, {"username": "Kit Nader", "comment_text": "Trains. Bus. Walk. I'd never ever take a car into a city!"}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "Book hotel at city center and walk everywhere. Wonderful way to see the city and burn off all the extra calories from the fantastic Italian food!"}, {"username": "Jamie Bly", "comment_text": "Depending on the size of your group….We hired private drivers through your local tour guide. They knew the ins and outs of the city and we got to see most everything we wanted in a short period of time."}, {"username": "Brian Osman", "comment_text": "Walk or taxi worked great for me"}, {"username": "Naomi Collado", "comment_text": "Following bc I’d like to know too!"}, {"username": "Miyuki Kanno Paul", "comment_text": "In big cities, we are always on foot and public transportations\nsuch as metro, train and funicular. Sometimes taxi. We only rent a car for hard to reach locations/\ncountryside or public transportation isn’t convenient."}, {"username": "Michael Widjaja", "comment_text": "Depending on the city, usually I walk or take public transportation like bus or train but I do speak Italian so at least I'm not that lost even in a small town"}, {"username": "Sondra Knap", "comment_text": "Walked!"}, {"username": "Olga Olga", "comment_text": "It’s depends what city you’re going. Like Rome have terrible transportation systems so you will need to walk a lot, 350 cities and towns in Italy have low emission zones and low traffic zones - the bills is crazy expensive, last trip we paid 300 euros bills driving through Italy because you never know where this zone’s located and its on Italian language. Taxi is not so expensive in Italy btw."}, {"username": "Carole Tarlap", "comment_text": "My first trip for 23 days from Venice to Sorrento.....wa\nlk, walk, tours and trains between the cities. My second trip for 10 days through Puglia rented a car ❤️"}, {"username": "Marie Cuzzi", "comment_text": "I do the on/off bus it goes to all the sights runs all day a great way to see the city"}, {"username": "Maureen Rebello Hagerty", "comment_text": "Foot. Always"}, {"username": "Stacy Derouin", "comment_text": "We always walk/taxi."}, {"username": "Laura Uribe", "comment_text": "We walk everywhere! Taxi from train or airport to wherever we are staying. Have fun!"}, {"username": "Cynthia Marie", "comment_text": "Walking is best to find all the hidden gems"}, {"username": "Triskell Young", "comment_text": "I try to find accommodations right in the historic centers, so I can walk to most places. Taxi to and from the accommodation with the luggage, unless the train station is less than 10 minutes walk."}, {"username": "Annette Fordyce", "comment_text": "Walk or sometimes a taxi. Although we have found the Milano subway system to be super easy once you figure it out. And, with subsequent trips we have felt more confidence using busses and other forms of public transportation."}, {"username": "Bill Elias", "comment_text": "Walking, though I’ve driven when doing Tuscan hill towns and Umbria. Driving is only stressful in the towns. On the faster roads you just have to get out of everyone’s way."}, {"username": "Lisa Martinson", "comment_text": "Big red bus to grasp layout."}, {"username": "Katalina Loredo", "comment_text": "Walk, bus, metro, or tram. The tickets for public transportation are about 1,50€ so I will take that any day over taxis"}, {"username": "Sherri Leis Dillavou", "comment_text": "My feet"}]}, {"id": "2199259323806479", "text": "Hello all! Still grinding on the planning and my husband cannot stop talking about how he wants to experience driving a super car or Alfa Romero while we’re over there.\n\nDoes anyone know a tour company that does super car rentals? It would be a few hour tour, not like a destination to destination tour.", "link": "facebook.com/groups/1373361046396315/permalink/2199259323806479/", "likes": 7, "comments": [{"username": "Miyuki Kanno Paul", "comment_text": "Sixt rents Alfa Romeo Giulietta(or similar). For the super car rental…you may want to google and see if any specialized agency, let’s say in Emilia-Romagna region, available"}, {"username": "Kim Aranha", "comment_text": "My son rented a Ferrari"}, {"username": "Paul Anderson", "comment_text": "Try racing from the north of Germany to Switzerland late at night. The only question is how fast will the car go?"}, {"username": "Bev Fisher", "comment_text": "You can drive a Ferrari round the Maranello track. You can book on line.\nMaranello is all things Ferrari if he’s a car fan! 🏎️"}, {"username": "Diana Smith", "comment_text": "🤔 I had no clue that the Alfa Romeo was a Super Car… definitely smooth drive! Hope he gets his wish…"}, {"username": "Andrea Devine", "comment_text": "You can drive a Ferrari in Florence with test drive Ferrari"}, {"username": "Andrea Devine", "comment_text": "Andrea Devine"}, {"username": "David Davey", "comment_text": "I do hope he can handle high performance sport car."}, {"username": "Keith Crossley", "comment_text": "First time I drove a Ferrari - as an instructor - I nearly looped it. Take it gradually then have fun!"}, {"username": "Rhona OConnor", "comment_text": "Just outside Bologna at the Maserati factory you can rent one for a test drive - €200 for 10 mins aprox."}, {"username": "Todd Hines", "comment_text": "3 lap rental at Monza was a great time-\nhttps://\nwww.puresport.ne\nt/us/"}, {"username": "Jose Velez", "comment_text": "In maranello around the Ferrari museum you have several shops that will rent Ferrari and other cars by the hour. My dream is to take my GT 500 or GT 40 on the roads of Germany but the shipping cost and legal issues would make it difficult"}, {"username": "Kenneth T Williams", "comment_text": "I rented a Ferrari of my choice including an instructor which u need before you drive one of these initially from “ I Love Maranello “ in Maranello.\nIncludes nice tour of the Ferrari museum down the street and a great lunch\nIt was awesome."}]}, {"id": "2199260017139743", "text": "What can you tell me about flying with Vueling?", "link": "facebook.com/groups/1373361046396315/permalink/2199260017139743/", "likes": 0, "comments": [{"username": "John Paul Williams", "comment_text": "Wretched….Zero leg room."}, {"username": "Maria LaPietra Guerrero", "comment_text": "We had a great experience from Madrid to Rome"}, {"username": "Jenniffer Jimenez-Gonzalez", "comment_text": "I prefer Vueling over Ryan Air . I flown with them various times and I’ve always had a positive experience."}, {"username": "Patty Beemer", "comment_text": "It's been a few years, but we liked Vueling fine. I mean, it's a discount airline, so expect it to be something comparable to Southwest.\n\nRyanair, on the other hand, is to be avoided at all costs. It felt like some kind of perverse game in which the airline kept figuring out new ways to screw passengers over throughout the entire experience, from booking to picking up bags at the end of a flight. Just awful."}, {"username": "Sascha Lee", "comment_text": "Flew Vueling from BCN to LIS this past April. Paid for one bag and upgraded seat. No issues and would fly them again."}, {"username": "Mike Guluk", "comment_text": "They are like all other discount airlines cheap fares mostly on time obay the baggage rules or you will be raped and pillaged"}, {"username": "Cecilia Christine Costantini", "comment_text": "I use it to fly between Spain and Italy when I can't find Ryanair flights. Slightly more comfortable and you can check-in 25-30kg bags (obviously paying), while Ryanair maximum 20. I have had more delays and cancelled flights or changes of schedule with Vueling than Ryanair over the years."}, {"username": "Lalita PosBa", "comment_text": "We liked it! Between France and Spain and Italy. Laid back but strict on measurements for luggage. No food on the plane I les you buy it. 🤗 Nice landings so far…"}, {"username": "Sara Anderson Frey", "comment_text": "We flew Vueling from Venice to Barcelona. No issues at all. Arrived on time, along with our checked bags. It’s a no frills carrier similar to a frontier or spirit. No free cans of soda on board! But overall we had a good experience and I would not hesitate to use them again."}, {"username": "Denise Diaz Costantino", "comment_text": "Thanks for the info!!!!"}, {"username": "Aileen Ligan", "comment_text": "We’re flying out of LAX to Barcelona then on the Rome. Our itinerary says that we are on Vueling out of LAX. I thought they only flew within Europe. Anybody have any insight?"}, {"username": "Alyssa Brown-Ruiz", "comment_text": "I booked Vueling through Iberia which is a reputable airline. My flights are this summer but I’ve heard good things. I added better seats and another bag, cheaper to do it in advance"}, {"username": "Jeralyn Gudmundson", "comment_text": "3 flights with them, very good"}, {"username": "Charles Holt", "comment_text": "Cheap and good."}]}, {"id": "2199261493806262", "text": "We are in Rome as we speak, how do the scooters work? By app? To use? And by the hr? Or?\nTIA", "link": "facebook.com/groups/1373361046396315/permalink/2199261493806262/", "likes": 0, "comments": [{"username": "Tad Hashimoto", "comment_text": "There are different \"brand\" e-scooters in different places. I can't recall for certain, but I think Rome had Lime, which were my personal preference.\n\nYou need an app on a phone with a Bluetooth and internet connection. You also need to provide your payment information in the app, which can be problematic for some apps if you are using a travel sim with a different phone number and can't get two factor authentication texts on your normal phone number.\n\nApple pay often works without complaint."}, {"username": "Sam Mah", "comment_text": "Take care. Read a post on another FB group a few weeks back, of a person who fell off one and may have damaged her jaw."}, {"username": "Cecilia Christine Costantini", "comment_text": "As a Roman, I wouldn't recommend using them in Rome. Roads and pavements are uneven, there are lots of potholes, cobblestones, cracks. Traffic is crazy. I have seen dozens of tourists falling and injuring themselves badly. A girl literally destroyed her knee in front of my eyes. Not the kind of holiday she wanted. 😑 Sorry to be a party pooper, but I was the one helping the girl above, calling the ambulance etc. It was awful."}]}, {"id": "2199262467139498", "text": "Thank you all for the informative posts and responses. I cannot seem to find the post that used an Italian Tourist Agency to plan their trip. Recommendations would be greatly appreciated. We are meeting friend in Venice September 23. And planning to fly from Canada early September. Looking for a local agent to help plan Italy and Greece.", "link": "facebook.com/groups/1373361046396315/permalink/2199262467139498/", "likes": 0, "comments": []}, {"id": "2199264287139316", "text": "I’m sharing my love for Italy with my extended family in September and we have a farmhouse in San Miniato in Tuscany for a week and I’m trying to find a wine tasting tour with transfers without having to go into Pisa or Florence … don’t want to worry about driving\n\nAny suggestions any sites to look into??\n\nThanks for any help in advance", "link": "facebook.com/groups/1373361046396315/permalink/2199264287139316/", "likes": 0, "comments": [{"username": "Colleen Carollo Oxsalida", "comment_text": "We stayed in San Gimignano in June and took a cooking class and wine tasting at Tenuta Torciano and they provided transfers, not sure if that was because of the class though. It was a lovely vineyard and the staff was great."}, {"username": "Meghan Tan", "comment_text": "Search Emiko Davies on Instagram- she and her husband do food + wine tastings from their home in San Miniato. I highly recommend!"}, {"username": "Samantha Houghton", "comment_text": "I have an Italian lady I met on a language exchange group who’s a tour guide in San Miniato. She’s a local, ex teacher and speaks very good English. If you like I can send you her link. 🙂"}, {"username": "JeriLynne Clifford", "comment_text": "https://\nwww.montalcinowi\nnetours.com/"}]}, {"id": "2199270913805320", "text": "My family and I are planning our first trip to Italy next fall. We’d like to start in Florence and do day trips through Siena, San Gimignano and an organic farm before heading to the Amalfi Coast to end our trip. Is ot best to work with a tour package company to plan the itinerary and transportation or are there reasons we should consider planning our tours and transportation independently?", "link": "facebook.com/groups/1373361046396315/permalink/2199270913805320/", "likes": 9, "comments": [{"username": "Linda Yanni", "comment_text": "You can drive to those areas from Florence. Don't rent a car in downtown Florence. Watch out for the zona limitato - only people with special tags can drive to limit the number of cars, if you do come in to Florence. Our rental company covered us for that but if yours doesn't there's a fine. If you can get one at the train stain and return it there that wouldn't be bad but trying to return a car after dark can be crazy. Add time onto the times that even Rick Steves gives you. It will take longer. It will take some time just to get outside of Florence. Make sure anyone who drives the rental has an international driver's license or a big fine from the police if they stop you for any reason. And don't speed. They have a lot of cameras. Easy driving in the country - a lot of curves but not tons of traffic in October."}, {"username": "Jason Hobel", "comment_text": "You can save a lot of money planning it yourself which is what I did. It is a lot of research but I learned so much more doing it myself and that way you can set your own itinerary too that suits your schedule."}, {"username": "Rachael Richardson", "comment_text": "I did everything independently booked flights, booking .com apartments and used the trains , booking them about a month or so in advance - local trains you get while you are there"}, {"username": "Phyllis Snyder", "comment_text": "I’m planing my trip and what has been very useful is Rick Steve’s Italy guide- also I’m watch lots of great Italy guides on utube videos- so much fun!"}, {"username": "Suzie LG", "comment_text": "We used a tour company and never had a worry. It was so nice to have them take care of every small detail. Yes, it cost more but worth every penny to us 👍"}, {"username": "Steve Grossman", "comment_text": "We have done that exact trip ourselves approximately twelve times. If you want to give some money to somebody else you can, Or you can use the GPS on your phone. And it'll take you exactly where you want to go. It's so simple that I even I could do it"}, {"username": "Valerie Collanton", "comment_text": "We used Florence Limousine Service for a winery tour in Chianti (with lunch) and in San Gimignano (with snacks). They were very reasonably priced and the tours were great. One of the highlights of the trip."}, {"username": "Anna Gambino", "comment_text": "It’s kind of fun planning on your own. Check these groups and watch videos of the different towns. You’ll learn a lot."}, {"username": "Fiona Cameron", "comment_text": "Plan it yourself, its part of the fun. You will learn so much more. Use trains.\nI’ve travelled in Italy many times now, alone and I plan the whole thing myself and rarely join organised tours unless it’s just a day trip that is difficult to do alone, or by train/ bus."}, {"username": "Renae Larcus", "comment_text": "With some research you can do it yourselves and save money. Look at Rick Steves guides and other online resources. That way you can also build the itinerary that you really want."}, {"username": "Jenny Payne", "comment_text": "If you do a lot of research you can do it all yourself, that way you get to know the country & how far each town is. 2 apps that I use all the time is Rome2Rio & Man in seat 61 🌻"}, {"username": "Dr-Jon Warnecke", "comment_text": "For fall traveling, plan it yourself."}, {"username": "Cindy Hall", "comment_text": "As long as you enjoy research, planning and are an organized person, you should absolutely do it yourself! But remember NOT to over plan- allow for some spontaneous time to relax with a glass of wine or shop or explore the neighborhoods ❤️"}]}, {"id": "2184499045282507", "text": "Incredibly beautiful, a must if you plan to stay in Ostuni! 🥰\nDiscover more - Masseria Grieco: https://www.anrdoezrs.net/click-100692842-11552042?url=https%3A%2F%2Fwww.tripadvisor.com%2FHotel_Review-g642178-d13395741-Reviews-or20-Masseria_Grieco-Ostuni_Province_of_Brindisi_Puglia.html", "link": "facebook.com/groups/1373361046396315/permalink/2184499045282507/", "likes": 14, "comments": [{"username": "Evie Gee", "comment_text": "We stayed in Masseria Salinola in Ostuni - heavenly!!!"}, {"username": "Tim Collins", "comment_text": "Good"}]}, {"id": "2199104123821999", "text": "Any suggestions for a hotel in La Spezia?", "link": "facebook.com/groups/1373361046396315/permalink/2199104123821999/", "likes": 1, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.anrdoezrs.ne\nt/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187824-d1724\n380-Reviews-Nov\necento_Boutique\n_Hotel-La_Spezi\na_Province_of_L\na_Spezia_Liguri\na.html"}, {"username": "Tonsia Keytel", "comment_text": "Stay close to train station if you plan on using trains to Cinque Terre."}]}, {"id": "2199108103821601", "text": "I cannot thank everyone enough for your help with me planning our amazing trip to the most amazing country ever! I couldn’t have planned the trip without the online groups. I was so glad to visit the country that my grandfather came from when he was 12.\n\nI’m going to break up my posts per city and start with Venice.\n\nWe went to London first and flew from London to Venice via British Airways. We all used one small carry on and a backpack.\n\nDay 1 Venice\n\nPickup by VQ Travels water taxi to hotel which was absolutely amazing! What a great company to work with for travel arrangements! It was the most spectacular entrance to Venice and Italy via a private water taxi.\n\nWe checked into All Angelo Art Hotel, but our rooms weren’t ready so we got lunch around the corner at Rossopomodoro. We all got pizza, and it was amazing!\n\nAfter our lunch we walked around a little and headed back to the hotel, our rooms were ready and we all took naps.\n\nWe loved our hotel and rooms. We had a beautiful canal view for each of our rooms. We had 2 rooms for our family of 5.\n\nWe went to a little place right around the corner from our hotel for Apertivo and had some snacks and Aperol Spritzes.\n\nWe went to dinner at Ai Due Viscovi-it was okay, not our best meal but decent service and good pasta. We walked around and stopped at a few places on our walk back and discovered at the one the amazing Hugo Spritz! Those are amazing.\n\nDay 2 Venice\n\nWe went for a Gondola ride after breakfast-just grabbed the one beside our hotel canal 80 Euro for 5 people 30 min. I’m glad we did it since I had heard mixed reviews.\n\nWe walked around and got lost in the streets of Venice. We ate chicchetti for lunch no reservation-just walked up. Some of the smaller stores didn’t take credit cards in Venice, so make sure you have Euros. I had read everyone took credit cards here and there and that’s absolutely not true.\n\nWe had dinner but I can’t remember the name! We didn’t have a reservation. It was good but service slow.\n\nWe walked up to a little restaurant in San Marco for tiramasu. loved the service and staff. Excellent dessert!\n\nWe went to our St Mark’s Evening Tour with Walks and Devour tours. Really well done and informative tour!\n\nThen got some drinks at the cafe next to St Mark’s and went to listen to the music in the piazza.\n\nDay 3 Venice\n\nAfter our hotel breakfast we had our pickup from VQ Travel in water taxi to train to Florence.\n\nWe loved All Angelo Art Hotel. Perfect location. Everyone was so kind, clean rooms, amazing breakfast, beautiful view!\n\nOur first experience with the train was not as difficult as I had feared. Booking through the Trenitalia app was great because I could see our train number and platform before it was even posted on the board. The business class seats were really comfortable. I watched a few You Tube videos and read everyone’s posts in here and had no issues.\n\nI will have a separate post for Florence, Capri, and Rome!", "link": "facebook.com/groups/1373361046396315/permalink/2199108103821601/", "likes": 98, "comments": [{"username": "Lori Sammons", "comment_text": "We are heading in Venice end of this month flying from Rome, my hotel quote me a bit high can you share your company that pick you up? Thsnks"}, {"username": "Jen Belsito", "comment_text": "Fab info and lovely photos! Thank you for sharing!"}, {"username": "James-Kathy Dickerson", "comment_text": "Glad to hear the train info thanks...looks amazing can't wait for our trip in Oct."}, {"username": "Patricia Chavez", "comment_text": "Thank You so I much for your information.\nWonderful Photos.\nCan't wait for your other information."}, {"username": "Tracy Foss", "comment_text": "Thanks for sharing your experiences!"}, {"username": "Angela Greatrex", "comment_text": "Lovely post , Letty thanks for the tip about Euros in Venice x"}, {"username": "Dana Talusani", "comment_text": "That was our exact itinerary when we went to Italy 10 years ago! Look forward to future posts!"}, {"username": "Nancy Day", "comment_text": "Where did u stay in Venice"}, {"username": "Dawn Dae", "comment_text": "Can I just say THANK YOU for your post… we went to Rossopomodoro yesterday, based on your recommendation…\nand it was FABULOUS! Lovely pizzas and best seafood risotto ever! So friendly too! xxx 🥰"}, {"username": "Chuck Runzo", "comment_text": "LETTY IS TRULY A .....\" TRAVEL SPECIALIST \"...IF SHE DOESNT KNOW A EXACT ANSWER SHIE KNOWS HOW TO FIND THE RIGHT ANSWERS. FAST.....\" TRAVEL WITH LETTY \".....😎"}]}, {"id": "2199108410488237", "text": "Hello I am thinking of going to the Dolomites next year. Where to go, where to stay, when is a good time to go and preferable without needing to rent a car. What is a good city/town to get there from. Thanks so much in advance 🙌🙌", "link": "facebook.com/groups/1373361046396315/permalink/2199108410488237/", "likes": 5, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.jdoqocy.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g194745-d2294\n282-Reviews-Ros\napetra_Spa_Reso\nrt-Cortina_d_Am\npezzo_Province_\nof_Belluno_Vene\nto.html"}, {"username": "Chiara Pirrello", "comment_text": "Braies lake"}, {"username": "Louise Coppola", "comment_text": "Ortisei"}, {"username": "Meghan Tan", "comment_text": "Bolzano is a good base- very accessible by train (and bus!) to most of South Tyrol. Most towns have cable cars that will take you up to the nearest mountain. It’s very convenient and you don’t have to worry about parking your car."}, {"username": "Claudia Castellini", "comment_text": "Trentino Alto Adige is the Dolomiti region par excellence, but also in Veneto there are beautiful places, like Cadore area and Cortina d’Ampezzo.\nIt’s not easy to move around on Dolomiti without a car, but you can get to Cadore from Venice, and so you can also visit it!\nAbout the best season to get there, it depends on what you want to do: for skiing of course you need to go in winter/spring (from Christmas to Eastern more or less), for hiking or biking, summer is the best.\nEnjoy, Dolomiti are amazing!"}, {"username": "Paul Davis", "comment_text": "Christina Cabrera: I stayed in Ortisei earlier this month and it was beautiful. There are lifts in town that will take you to the top of Seceda (can’t recommend this enough) and alpe di Siusi which we didn’t do. The whole area is stunning! Also check out Cortina d’Ampezzo to use as a base."}, {"username": "Kristina Ruk", "comment_text": "Val gardena you can see all real Dolomites beauty..but it depends when?if you like skiing so winter 😉"}]}, {"id": "2199122617153483", "text": "Can anyone recommend a boutique hotel or bed and breakfast in Tuscany region, preferably mountains, with an outdoor pool and walking distance to restaurants? Haven't got a car so limited.\n\nNot wanting any cities or large towns.\n\nAlso willing to travel out of Tuscany, if possible by train.\n\nTIA", "link": "facebook.com/groups/1373361046396315/permalink/2199122617153483/", "likes": 2, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.kqzyfj.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g608934-d1015\n571-Reviews-Lup\naia-Torrita_di_\nSiena_Tuscany.h\ntml"}, {"username": "Miyuki Kanno Paul", "comment_text": "If you are renting a car, consider staying at an Agriturismo"}, {"username": "Nancy Jane Oster Burleigh", "comment_text": "Nancy Jane Oster Burleigh"}, {"username": "Erica Isaacson", "comment_text": "https://\nwww.postamarcucc\ni.it/en/"}, {"username": "Jen Goldman", "comment_text": "Castle Brunello. Walkable to two amazing restaurants and near Montalcino."}]}, {"id": "2199121220486956", "text": "Fly virtually to Sicily! Our expert guide will lead you on a virtual journey through this beautiful island, to explore the most beautiful places of Sicily.\nYou will discover (just to mention a few) the vibrantआणखी and chaotic Palermo, Sicily’s capital; the Byzantine splendour of Monreale; the charming coastal town of Cefalù, home to a massive Norman Cathedral; the majestic Mt. Etna; the romantic town of Taormina; the magnificent Baroque cities of the Noto Valley; the Greek engineering feat of Selinunte and the famous Valley of the Temples, one of Sicily’s most famous historical attractions.\nJoin our virtual experience: https://nextstop-italy.com/virtual-tours/best-of-sicily/\n\n#medievalart #italytravel #italyiloveyou #virtualworld #italytrip #vacationmood #sicily #sicilylove #sicilyitaly #sicilytravel #sicilyessence #sicilytourism #sicilypictures #TAORMINA #taorminasicily #cefalù #cefalusicily #ValleyoftheTemples #syracuse #ortigia #ortigiaisland #palermo #palermo #archaeology", "link": "facebook.com/groups/1373361046396315/permalink/2199121220486956/", "likes": 3, "comments": [{"username": "Acra Crej", "comment_text": "I loved it 💕 it was awesome...💜🤗"}]}, {"id": "2161839887548423", "text": "Tuscany Day Trip from Florence: Siena, San Gimignano, Pisa and Lunch at a Winery\nArt, history, countryside, food. Tuscany has it all. If you only have one day free, venture into Tuscany on this day trip from… आणखी Florence and discover the region's highlights with a local guide. Explore the medieval city of Siena and its cathedral before heading to the hills of Chianti for a 3-course Tuscan lunch and wine tasting. Roam the streets of San Gimignano, and travel to Pisa to admire the architectural drama of Cathedral Square—home to the UNESCO-listed Leaning Tower of Pisa. Upgrade to include skip-the-line entry, if you wish.\n\nRead more about Tuscany Day Trip from Florence: Siena, San Gimignano, Pisa and Lunch at a Winery - https://www.viator.com/tours/Florence/Tuscany-Day-Trip-from-Florence-Siena-San-Gimignano-Pisa-and-Lunch-at-a-Winery/d519-5070TUSCANY?pid=P00070587&mcid=42383&medium=link&medium_version=selector", "link": "facebook.com/groups/1373361046396315/permalink/2161839887548423/", "likes": 109, "comments": [{"username": "Mariët Eertman-Heemstra", "comment_text": "This is the American (and Chinese) way to visit Italy, but seems to me that it is a really fantastic day trip!! (I am Dutch myself) 🍀🍀🍀👍🍺👍"}, {"username": "Ruth Simmons", "comment_text": "Terrific tour! We thoroughly enjoyed our day in May, great value, too!"}, {"username": "Ruth Simmons", "comment_text": "Terrific tour! We thoroughly enjoyed our day in May, great value, too!"}, {"username": "Cindi Munoz Maldonado", "comment_text": "Joey Galindo Maldonado ❤️"}, {"username": "Tracy Foss", "comment_text": "I have it booked so exciting to see pics of someone who went & enjoyed the experience!🍷"}, {"username": "Ruth Simmons", "comment_text": "Ruth Simmons"}, {"username": "Nara Gannon", "comment_text": "Zhew Zhew"}, {"username": "Kasey Newby", "comment_text": "Austin Schafer"}, {"username": "Marjie De Villa Lorica", "comment_text": "Wow! Thank you for sharing!\n\nWe are also booked in this day trip from Florence in September.\n\nSo looking forward to this Tuscany Tour❤️"}, {"username": "Magdalena Tidswell", "comment_text": "I booked this last week. Cannot wait"}, {"username": "Shula Hurvitz", "comment_text": "🇮🇹📷♥️📷🇮🇱"}, {"username": "Rose Easley Bell", "comment_text": "Ellen Young 👆"}, {"username": "Victoria Russo", "comment_text": "This is on our itinerary in September. Excited to visit"}, {"username": "Jenny Clough", "comment_text": "We did this trip on Friday..it was amazing and so worth it!"}, {"username": "Mariposa Mariposa", "comment_text": "So beautiful. Looking forward to begin planning my trip."}]}]