[{"id": "2196938470705231", "text": "Ciao!\n\nFirst time poster in this group, but wanted to share some of my experiences from my first three days in this beautiful country - Rome in particular.\n\nI am travelling with my Mum who is in her mid-60’s. These are just our experiences, we understand that everyone is and travels differently!\n\nCrowds\n- Visit the sites early to avoid the crowds. We have been leaving the hotel (in Trastevere) at 7am and walking to the sites. There have been very few people around at this time of morning, and it is quite serene walking the quiet streets at that time of day.\nNOTE - obviously if you are going into the sites you are bound by it’s opening hours, so crowds will be unavoidable.\n- From 9am onwards you can see a noticeable difference in the crowds building.\n\nHeat\n- It has been super hot and humid, however we have been getting up early and sight seeing before the heat really kicks in at around 10am.\n- Take a hand held fan (we bought some from home but they sell them everywhere here and are very cheap) - these make all the difference.\n- Always carry a bottle of water and wear a hat (water is also very easily accessible at stores).\n- We have been relaxing in our hotel in the hottest afternoon hours and enjoying siestas ☺️.\n\nSafety\n- We have not felt unsafe at all. Definitely pay more attention to your belongings around the main tourist sites - cross body bags for your most important belongings are great.\n- Goes without saying, but have your wits about you and be aware of your surroundings (as you should wherever you are travelling in the world 😊).\n- We haven’t ridden any busses, however these look super packed when they drive by, so probably hold your bags very close on these.\n\nAfter reading some of the comments in this group I was feeling a little nervous about coming here with my Mum, however we have absolutely loved every second of our stay so far! Rome is so, so charming and yes the heat has made us adjust our ways of sight seeing, but it has not stopped us from doing anything we had planned to do!!\n\nOff to Positano today, and cannot wait 🥰", "link": "facebook.com/groups/1373361046396315/permalink/2196938470705231/", "likes": 1080, "comments": [{"username": "Daniela Horth", "comment_text": "Beautiful ❤️"}, {"username": "Lena Holmes", "comment_text": "Where do you stay in Rome?"}, {"username": "Connie Dennis", "comment_text": "You are beautiful and your Mom also, and she doesn't look in her 60's either!\nThanks for the information 🤗"}, {"username": "Cynthia Rodriguez", "comment_text": "Thank you for sharing! Very detailed"}, {"username": "Leticia Barabba", "comment_text": "Pls keep sharing !"}, {"username": "Mayra Cobos", "comment_text": "Thank you so much for your recommendations\n😊"}, {"username": "Nicole Conner", "comment_text": "Did you do a cooking class? One of the pictures looks like it and wanted suggestions."}, {"username": "Nicky Firth", "comment_text": "Thanks for the beautiful photos 🌻"}, {"username": "Lesley Nesbitt-Blanchard", "comment_text": "I am trying to find a hotel for our last night in Rome. Do you have recommendations\n?"}, {"username": "Jeff Cobb", "comment_text": "You will absolutely fall in love with Positano , cute little shops, nice beach and restaurants.But\nit’s just the place itself 🌹Danielle Evans"}, {"username": "Erika Eleanor Romanick", "comment_text": "Thanks for sharing!!Love Rome"}, {"username": "Kathy Fryer", "comment_text": "Fabulous photos! Thanks for sharing these"}, {"username": "Kelly Tabor", "comment_text": "Sounds as if you’re having an amazing time. Keep posting please and soak up each second."}, {"username": "Debbie Jones Schilling", "comment_text": "Please continue to post your trip."}, {"username": "Brian Sturkie", "comment_text": "Seema Parmar Sturkie"}, {"username": "Elena Campo", "comment_text": "Elena Spektor"}, {"username": "Martha Heller", "comment_text": "Great pics! We live in New York and have never even thought about safety issues in any large city...we practice what we do at home!"}, {"username": "Jo Gleeson", "comment_text": "It looks wonderful 😍\nI took the random people out of your pic at the Trevi Fountain for you 🥰"}, {"username": "Janine Brailsford", "comment_text": "Your photos are lovely! Great eye! Glad you & your mom are having such a great time!\n\nA good testimony for not listening to the nay-sayers! It takes courage for some of us to travel- when as children many of us couldn’t afford it…\nAs the Nike athletic company says: “Just do it!”\n\nYou’ll be glad you did! 😉☮️💟"}, {"username": "Lisa Gonzalez Propri", "comment_text": "Great post! Thank you for your tips!"}, {"username": "Penny Cato", "comment_text": "Enjoy the rest of your time..it’s a beautiful country 🇦🇺🇮🇹💕💕🤣🥂🥂"}, {"username": "Lisa Woodfall Anderson", "comment_text": "Hi...I'm taking my 76 yr old mom in october...was wondering if the Trastevere neighborhood is in fact walking distance to the main sites in Rome...and any suggestions where to maybe have an amazing lunch in Trastevere???? Thanks for your post."}, {"username": "Phyllis Snyder", "comment_text": "Wonderful report ! I’m going to stay near trastevere- did you walk into central or take the tram #8? Ot taxi? My arbnb host says I can take #8 tram to central. If walking is possible then I’d love that. Grazie"}, {"username": "Maria Gatto", "comment_text": "We are in Amalfi right now. Have you booked a boat tour? We went out today and the water was so wavy we could not return to finish it once in Capri. We took the ferry back which was just lovely. Wish I would have saved my money. The water is very choppy because of the heat."}, {"username": "Laura Morgenstern Birman", "comment_text": "Wow can’t wait to visit in Sept!"}, {"username": "Melanie Izzy", "comment_text": "Lovely!! I’m heading to Europe and Italy in a week my mum who is in her 60’s as well 😊"}, {"username": "Kumar Denas Padep Komara", "comment_text": "Hi"}, {"username": "Kumar Denas Padep Komara", "comment_text": "Lovely 😊"}, {"username": "Laura Nar", "comment_text": "Enjoy your trip!"}, {"username": "Jillian Moccio", "comment_text": "💚"}, {"username": "Stuart Thomson", "comment_text": "What a nice and positively upbeat post..love it"}, {"username": "Evan-Sue Wilson", "comment_text": "Such a lovely positive post. Enjoy the remainder of your holiday with your mum."}, {"username": "Amanda Stewart", "comment_text": "My Mum Karen Stewart and I will be in Rome in November. We are both very excited but nerves as we are 2 woman travelling on our own (for the first half of our Europe trip ) with Mum in her mid 60’s and myself in my early 30’s and physically disabled. We will be using my wheelchair to get around and we are worried about accessibility to some of the sites as well as being targeted by pickpockets etc .\nAny advice would be greatly appreciated. Thanks 😊"}, {"username": "Giorgia Petraia", "comment_text": "Siesta is a Spanish thing, we don’t have siesta, stores close because people eat at home in Italy and we don’t go shopping at 13:00"}, {"username": "Rebecca Barker Cedrone", "comment_text": "I love that you’re making these lasting memories with your mom. ❤️"}, {"username": "Alexandra Monti", "comment_text": "Norine Puleio Monti"}, {"username": "Debbie Vitale", "comment_text": "Buongiorno! Lovely post & perspective! I'm traveling with my daughter for her graduation next year and will cherish our time & the memories we make. One question, is it expected that women remove their hats indoors? I don't want to be a \"do what you want\" visitor to their beautiful country. Thank you & I'll look forward to hearing about the rest of your adventures."}, {"username": "Coco Cole", "comment_text": "Thanks!!"}, {"username": "Christy Lynn", "comment_text": "Great info- leaving for Rome in less than a month. Both you and your mom are beautiful!!"}, {"username": "Kath Milburn", "comment_text": "Great to a have a positive post. I am a lady of mid 60's and I have been to Rome 3 times, twice on my own and I have never felt unsafe at all."}, {"username": "Miriam McNally", "comment_text": "Love this post, hope your Mum and you have a fabulous trip! It is lovely that you can do this together."}, {"username": "Lynn Mathiowetz Hoffman", "comment_text": "Beautiful photos- thanks for sharing! Please be sure to update on positano will be there in September"}, {"username": "Tracy Foss", "comment_text": "Great pictures! Thanks for your comments as 2 women travelling alone how did you feel at night after dark ?"}, {"username": "Dace Pickens", "comment_text": "Thank you for posting. Very helpful info."}, {"username": "AnnSom Khoch", "comment_text": "I greatly appreciate your time to share your experience. Looking forward to seeing your next post."}, {"username": "Carolina Garcia-Abalo", "comment_text": "Danielle Evans just got back from Amalfi coast. Is Positano home base? If you are thinking of going to Amalfi I have a restaurant recommendation.\nMarina Grande, it was the best meal we had while in the Amalfi coast. Their fish tartare was so delicious! 10 out of 10."}, {"username": "Roger Pajo", "comment_text": "You’re gonna love Positano!"}, {"username": "Margie Williams", "comment_text": "I do love Roma! You will love Positano."}, {"username": "Stacey Mauro", "comment_text": "How are you getting from Rome to positano? ❤️"}, {"username": "Cari Wilson", "comment_text": "Thanks for sharing. Love that you are traveling with your mom. Those will be memories to cherish forever. And Love your outfit. You look effortlessly put together and chic! ❤️\n\nCan you share where you stayed in Rome and if you liked it?\n\nAlso, your shoes are adorable. Are they comfortable for lots of walking? Can you share the brand if you like them?\n\nThanks!"}, {"username": "Renee Rundle Stoneham", "comment_text": "You do not need to keep buying water bottles!\nUse the public water fountains all over the cities to refill your bottle! Those ancient Roman fountains are fantastic!"}, {"username": "Valerie Collanton", "comment_text": "I love Rome (and all of Italy 🇮🇹). Glad you are having such a great time. Enjoy the rest of your trip."}, {"username": "Terry Lee", "comment_text": "Thanks for sharing and enjoy every minute"}, {"username": "Debbie Plante", "comment_text": "Let us know about Positano. I will be there in October."}, {"username": "Jocelyn Marquez", "comment_text": "Fabulous! You two look great. I love your variety of pics. Thanks for sharing tips, too. I’m going to Rome later this year. It should be cooler."}, {"username": "Dana Talusani", "comment_text": "Enjoy! The Amalfi coast is gorgeous!"}, {"username": "Sheyla Enrich", "comment_text": "Thanks for sharing. I'll be in Italy in September with my husband and every single tip from this group helps me with my trip."}, {"username": "Deann Decker", "comment_text": "Thank you for sharing this!"}, {"username": "Lisa Wylin", "comment_text": "You’re awesome! Keep your info coming❤️"}, {"username": "Diane Petonito Giordano", "comment_text": "You r going to love Positano"}, {"username": "Melissa Jane Brown", "comment_text": "Love your photos, Danielle and Positano is gorgeous- be prepared for LOTS of stairs."}, {"username": "Gamila Helmy", "comment_text": "Hassan Awny"}, {"username": "Sophie King", "comment_text": "Marie Simpson Demi Quinn"}, {"username": "Maximilian Ståhl", "comment_text": "Thanks for sharing your valuable tips."}, {"username": "Penny Mason", "comment_text": "Please let us know re Positano 🌈👍"}, {"username": "Lucy Middleton", "comment_text": "Whereabouts did you stay in Rome? 🙂"}, {"username": "Lilian Villarreal", "comment_text": "Thank you very much for your comments! I’m leaving to Rome with my mother, 83, on Wednesday! I’m the youngest in the group ( I’m like your mother 🤣) ! I’m a little nervous thinking in my mom and the weather…"}, {"username": "Dora Cocca", "comment_text": "Chris Riccio"}, {"username": "Suryakant Desai", "comment_text": "Thanks for nice tips.👍"}, {"username": "Alison Schmidt", "comment_text": "Thanks ❤️ I have been worried about the crowds so we can get good photos"}, {"username": "Kris Harrison", "comment_text": "Just a slight correction, I’m the Mum, early 60s, not mid 60s 😂😂😂😂😂"}, {"username": "Jan Armstrong", "comment_text": "We also stayed in Trastevere and walked over the bridge each morning and evening to the centre. Feet coped ok in the heat but by day 4 we did get Ubers to the Vatican and back. As Danielle said, the buses were super crowded and had a ( unsuccessful) pickpocket experience on the metro at Piramide station, we chose to go by foot or taxi/Uber. We loved it. Highlight was rooftop bar at Oro Bistrot( must book), Emma and Tonnarello in Trastevere, and just sitting in Piazza Navona watching the world go by with a Limincello spritz x"}, {"username": "Tammy Moore", "comment_text": "Thank you, pictures are beautiful!"}, {"username": "Karen Casey", "comment_text": "How many nights did you stay in Rome?"}, {"username": "Christiana Evripidou", "comment_text": "Great pics and such a lovely experience to share with your mom! Any restaurant recommendations\nfor Trastevere?"}]}, {"id": "2196945157371229", "text": "Vatican City... some questions for the group.\n\n\nDo we allot one full day for this?\nWhat is worth getting tickets for? Where to book in advance?\nWhat are the top sights? Why?\nWhat can you skip? Why?\n\n\nThank you! I'm deep in research mode for my upcoming trip - Vatican City is just one of the items on the list for the Rome portion of our Italian Extravaganza!", "link": "facebook.com/groups/1373361046396315/permalink/2196945157371229/", "likes": 0, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2196946314037780", "text": "We will be in Florence in Sept. My son and granddaughter want to play at\nGolf Club Parco Di Firenze. Has anyone played there? Do you walk the course or do they rent golf carts?", "link": "facebook.com/groups/1373361046396315/permalink/2196946314037780/", "likes": 3, "comments": [{"username": "Jared Diaz", "comment_text": "I'm planning on playing in September also"}]}, {"id": "2196950980703980", "text": "Hi all,\nGoing this summer to Milan,Venice,Florence and then Rome. Which high speed trains are the best I see a few different ones I think. I found Italiarail and was wondering if that’s the best site/company to use. We want premium or business class because of luggage and comfort. Any insight is appreciated. We will move by train from location to location. Want to buy tix soon…if that’s advisable. TIA", "link": "facebook.com/groups/1373361046396315/permalink/2196950980703980/", "likes": 2, "comments": [{"username": "Ellen Edmonds-Wilson", "comment_text": "The Frecciarossa trains by Trenitalia were comfortable and fast. Business class has plentiful luggage storage. We booked directly with Trenitalia so got updates if the train was on time etc. The train also and wifi."}, {"username": "Bev Madill", "comment_text": "It's easy to book direct with Trenitalia (or Italo if their network covers your itinerary). Tickets are usually cheaper the earlier you book."}, {"username": "Robyn Lawson", "comment_text": "Each time we go we use\ntrenatalia trains. They are great, and efficient. 😊"}, {"username": "Jennifer Johnson Mayes", "comment_text": "We just used Italia first class from Rome to Florence to Venice. They were clean, fast and on time each day."}, {"username": "Mary Anne", "comment_text": "Italo has a weekend sale this weekend. Might be worth a look."}, {"username": "Connie Wilson", "comment_text": "TrenItalia App is what I always use."}, {"username": "Frank Hunt", "comment_text": "Get Trainline app and Tranitalia app then research."}, {"username": "Casarine Temple", "comment_text": "We booked through the Italo app . Trains from Rome to Florence to Venice , all Prima class ."}, {"username": "Shawn Robertson", "comment_text": "Thanks to all. I am set. Went through Italiarail…."}]}, {"id": "2196950954037316", "text": "Hello everyone. I've never been to Italy. It's top on my bucket list! But just curious about how much spending money for, souvenirs, food, and some excursions I should have for a family of 5", "link": "facebook.com/groups/1373361046396315/permalink/2196950954037316/", "likes": 11, "comments": [{"username": "Steve Savva", "comment_text": "Just remember not to eat and drink right in the square of famous centres; St Marks square Venice, etc"}, {"username": "Lisa Kelly", "comment_text": "I budgeted $100 per day, per person. That’s been plenty. And what Steve said, walk further away from big sites for better prices. Example: we sat at a cafe near the Florence Duomo - 5 cappuccinos and 5 pastries = 70 euro. The next day, at a small spot in Siena away from big sites, we paid $10 euro for the same thing. 🙃"}, {"username": "Lisa Quinn", "comment_text": "It can depend on the amount of time you’re going and what time of year you are going to go. Do you have an idea of that?"}, {"username": "Douglas Godesky", "comment_text": "Photos of the experience are your best souvenirs, IMHO, and what we do is look for one special piece of artwork, but even that can be low cost, there are some really interesing smaller postcards that are frameable."}, {"username": "Phyllis Snyder", "comment_text": "According to Rick Steve’s guide about $95 per adult. $50 for meals, $35 for sights and entertainment, $10 for public transportation.\nHowever, depending on your choices you can spend more or less."}, {"username": "Lucrezia Folger", "comment_text": "Hard to answer, as everyone has different budgets, what people want to eat, and how they want to dine, what kind of \"souvenirs\" one wants to buy, cheap trinkets or quality goods that one can use for years to come, types of \"excursions\", day trips, overnights, hotels, guided tours, needed transportation,\netc. Budget for a lot, you don't have to spend it all, or you may."}, {"username": "Rachael Richardson", "comment_text": "A lot ! Everything costs , we even got a lift back up from the seafront €1.30 each, trips from €30-60 each\nKids under 18 free in most museums etc or aged 18-25 reduced rate do look out for that, search about for places to eat for 3 adults 1 main meal and one alcoholic drink and water or a soft drink we have never paid more that €65 euros, so I’d bank on at least €100 for a basic nice meal.\nYou can grab pizza slices or panini on a lunch time for about €6-8 each and breakfast for €2 each for a pastry or choose somewhere with breakfast\nGo to the backstreets it’s much cheaper for a main meal or the odd night just go for a snack and a crepe\nPre book main attractions"}, {"username": "Shelley Howard", "comment_text": "it's not a easy answer .. but I always allow $100 local so €100 per person per day .. that's not for accom tours etc.. food, transportation,\ndrinks and souvenirs .. u can go with not much and still have a great time walking is free ..."}, {"username": "Jerry Kiger", "comment_text": "Money wise my guess is $250 min per day for hotel $150 and $100 … know not what was asked but I’ve been wondering in general is this was good estimate … never heard Rick Steve travel info but going look up thx"}, {"username": "Alexandra A Welker", "comment_text": "It's really tough to know because we all have different tastes in food, the type of things to buy but I think €150-200/day is a good start."}, {"username": "Cinzia Bonciani", "comment_text": "You might need to specify the currency you’re seeking the advice in. People from this group are from all over the globe."}]}, {"id": "2196952960703782", "text": "If you’re in Florence, definitely make a dinner reservation at Ciro & Sons! It was one of our favorite meals and experiences. I wish I had written down our server’s name, but he’s the only one from Vietnam andआणखी loved to Italy years ago. He was awesome! Everyone loved their meal, the restaurant is beautiful, and I even ended up buying several Ice Bags, which they use as wine chillers. Fun souvenir to bring home to friends with some Italian wine (waiting for those shipments).", "link": "facebook.com/groups/1373361046396315/permalink/2196952960703782/", "likes": 380, "comments": [{"username": "Kathy Fryer", "comment_text": "It looks lovely!"}, {"username": "Kieran Edwards", "comment_text": "Stacey Edwards"}, {"username": "Shaun Fagan", "comment_text": "Deborah Fagan"}, {"username": "Cynthia Talone", "comment_text": "Alessandra Corechà che pensi?"}, {"username": "Allison Boccaccio", "comment_text": "We loved Ciro & Sons!"}, {"username": "Tiffany Boland", "comment_text": "Kate George Dannielle Boland"}, {"username": "Michael Sloen", "comment_text": "Maud Palmen"}, {"username": "Michael Sloen", "comment_text": "Maud Palmen"}, {"username": "Lara Anderson", "comment_text": "Was by far my favourite meal in Italy when I was there a few months ago!"}, {"username": "Kimberly Infante", "comment_text": "Yes!! This was one of the best meals we had while in Florence, if not the best. So good!"}, {"username": "Judi Lynn Durham", "comment_text": "Their menu looks amazing!"}, {"username": "Isabelle Maillé", "comment_text": "Stéphanie Boulianne Karine Allain Fany Desranleau"}, {"username": "Lori Armor Bradfield", "comment_text": "Thank you so much! Just made a reservation for October!"}, {"username": "Ed M Offner", "comment_text": "We went October 30th 2022 and you're right about making reservations. Otherwise you'll wait in a line like this."}, {"username": "Diann Benson Savage", "comment_text": "Nancy Mankopf. This looks fabulous!"}, {"username": "Helen Morey", "comment_text": "My sons and I dined there - second the motion! Wonderful everything and gluten free for us!"}, {"username": "Mia Catalano", "comment_text": "Elizabeth Ann"}, {"username": "Kerenza Worsfold", "comment_text": "Kirsty Adams this looks nice x"}, {"username": "Wendy Campbell", "comment_text": "Christie Grant 5 mins walk from us"}, {"username": "Madison Storcella", "comment_text": "Kim Storcella"}, {"username": "Matt Clegg", "comment_text": "Fiona Tonia Mazzucchiello"}, {"username": "Nancy Mankopf", "comment_text": "Must come to Italy Hungary"}, {"username": "Judith Pishnery", "comment_text": "Looks great! It's been a few years, but I really enjoyed Acqua al'Due, and their tasting menu."}, {"username": "Linda Beach", "comment_text": "Jessica! 🥰"}, {"username": "Lynette Newman", "comment_text": "Will see what the girls say."}, {"username": "Debbie Bergeron", "comment_text": "Jesse Bergeron"}, {"username": "Sandy Heim", "comment_text": "Looks amazing."}, {"username": "Simon Gray", "comment_text": "Stephanie Gray"}, {"username": "Shawna Mcdonald Sapp", "comment_text": "Eva Lansford"}, {"username": "Jessica Petyo", "comment_text": "Hi, everyone! I am so thrilled this post has reached so many people. I also love seeing the comments from those who have already been there. It’s closing to celebrate Ferragosto, but if you’re traveling after that, I hope you visit and enjoy as much as we did! 🧡"}, {"username": "Luca Lookone Ferrentino", "comment_text": "The Place is in Florence, but that's not tuscanian cuisine, it's Neapolitan cuisine."}, {"username": "Debi Murray Lee", "comment_text": "Love your idea for the ice bags and a bottle of wine for gifts. Do you mind if I ask how much for the bags?"}, {"username": "Carola Blödgen", "comment_text": "This looks delicious"}, {"username": "Tracy Foss", "comment_text": "Are they shipping the ice bags home for you ? How much are they ?"}, {"username": "Debra Jacobs", "comment_text": "Beautiful, thanks for sharing!!"}, {"username": "Sarah Johnson Fercho", "comment_text": "F"}, {"username": "Katherine AliNuñez", "comment_text": "Thanks for Sharing"}, {"username": "Patsy Luque Mejia", "comment_text": "Thanks for the tip! How early in advance did you make the reservation Jessica Petyo? Thanks again. 😊"}, {"username": "Donna Gail Devall", "comment_text": "Gwen Barsley"}, {"username": "Ellen Edmonds-Wilson", "comment_text": "Also excellent for coeliacs."}, {"username": "Debra Indorato", "comment_text": "Looks amazing. I will add that to our list as we are going back again in the spring. Did you go to the Sophia Loren restaurant? We only had aperitivo there. Thank you for sharing."}, {"username": "Danielle Stolfo Jurk", "comment_text": "Reeve, Hali"}, {"username": "Reeve Geiger", "comment_text": "Danielle Stolfo Jurk we should do this!!!!"}, {"username": "Sara Wells", "comment_text": "This was my favorite restaurant when I lived there back in 2007. It was right by my apartment. Went back in March of this year and still had amazing food. Definitely looks different than when I was there but so glad the food was still amazing."}, {"username": "Amy Tancredi Hassall", "comment_text": "My friends ate there 3 weeks ago with their family and it was their favorite spot for their 8 day Florence-Rome trip."}, {"username": "Patty Barnes", "comment_text": "Looks delicious 😋"}, {"username": "Laura McConnell", "comment_text": "I ate there in Sept 2019. It was fantastic. Glad to hear that they are still around."}, {"username": "Lisa Woodfall Anderson", "comment_text": "Yay! Can't wait. Going in October!!!"}, {"username": "Connie Dennis", "comment_text": "Looks fancy smancy?"}, {"username": "Kookie Jesse Trevino", "comment_text": "We just went there and loved it!! Even my picky 13 yr old ate every drop of her food."}, {"username": "Brenda Harris Dixon", "comment_text": "Lauren Nicole Dixon let’s add this to our list!"}, {"username": "Karen O'Neill Brown", "comment_text": "Jason Brown"}, {"username": "Maria NoBa", "comment_text": "Looks amazing! Next time we go will definitely try it. Thank you for the recommendation."}, {"username": "Marci Kuehner", "comment_text": "Food looks amazing!!!"}, {"username": "Beryl Lato", "comment_text": "What is the price range for the restaurant?"}, {"username": "Marcia Kimpland", "comment_text": "We ate there!! Sat outside- service was wonderful and steak was amazing!!"}, {"username": "Susi Kunz", "comment_text": "Mary Lou Kunz North, Alison Martin, we should try this place when we are there!"}, {"username": "Mary Sandor White", "comment_text": "Looks delish. Putting on my list. Thanks"}, {"username": "Ettore de Vita", "comment_text": "The are from Napoli, of course the food is great 😉"}, {"username": "Rachel Alderson", "comment_text": "Thank you - this is a 3 minute walk from our accommodation, I’ve just made a dinner reservation for September 🙌"}, {"username": "Lynn Stephenson", "comment_text": "Went twice in October!!! Our daughter is gluten intolerant…. not an issue!!!"}, {"username": "Lisa Schalig-Winter", "comment_text": "Thanks for your recommendation.\nIt’s our last night in Florence. Just reserved a table for tonight!"}, {"username": "Jennifer Walp Rydholm", "comment_text": "Is it casual dress?"}, {"username": "Lena Lai", "comment_text": "Yay! Thanks for posting going to try and make reservations next week 😊"}, {"username": "Lena Lai", "comment_text": "Darn it they said they are closed for the holidays?!"}]}, {"id": "2196962914036120", "text": "First time poster, recent lurker with great appreciation for all I have learned. Now asking for your suggestions & knowledge please. Late August.\nArriving 8.30pm Milan, will have 2 full days in Milan and then the last is day trip to MONZA for F1 practice day 🚘 🙌 . In total we have to find accommodation for 4 nights (2 persons) in Milan.\nWhat’sआणखी the consensus on best option :Hotel or AirBnB in Milan? As we are arriving late, followed by 1 hr train trip into Central Milan is rocking up to an AirBnB just asking for trouble?\nThen heading to Florence for 3 nights and continuing on to wedding in Tuscany, Cinque Terre & Lake Maggiore.\nQUESTIONS:\nHow long does it take on average to get thru baggage and clear customs at Malpensa?\nAny recommendations for Florence accommodation?\nThanks for reading this far and hopefully you have some advice for us.", "link": "facebook.com/groups/1373361046396315/permalink/2196962914036120/", "likes": 1, "comments": [{"username": "Nicole McLachlan", "comment_text": "It sounds like you’re arriving on the same flight as us - if you’re coming from Brisbane 😝. But with regard to hotel v Airbnb we have a general rule that we use hotels when it’s only one or 2 nights, but 3 nights or more we use Airbnbs. Mainly because of the hassle of checking in late, tidying up etc after such a short time. I never unpack in hotels but I do in airbnbs. Good luck!"}]}, {"id": "2196971604035251", "text": "I’m in Venice right now. Second time here. We are leaving today and heading to Milan. Here is my opinion so far:\n\nVenice is much, much dirtier than it was 5 years ago.\n\nThere is sooooo much graffiti\n\nUse euros or dollars. No one cares\n\nNot a single issue with pick pockets. So far.\n\nNo one cares what anyone is wearing. I have seen zero tulle skirts.\n\nBreakfast isn’t served until at least 7:30am\n\nStores usually close around 7:30-8pm\n\nNot every restaurant has table service\n\nTipping is not expected\n\nIt’s hot. Not unbearable though\n\nThere are public bathrooms everywhere. Look for WC- water closet signs\n\nDo not. I repeat, do NOT stay at the Hotel de Conte. We are being refunded two nights because this place is awful. Avoid it at all costs.\n\nWe have AT&T and just added the international plan\n\nTake a tour to the Dolomites. Breathtaking.", "link": "facebook.com/groups/1373361046396315/permalink/2196971604035251/", "likes": 315, "comments": [{"username": "Maria Teresa Correale Willoughby", "comment_text": "After covid 19 or whatever that was everything has changed in Italy and slowly getting better . I was in Salerno last year where my brother and sister in law live and everything around was not the same but my country is still beautiful and ancient."}, {"username": "Eden Gauthier", "comment_text": "Brandon Thomas"}, {"username": "Krissy DaRusso", "comment_text": "I just had my first Venice visit and I thought it was clean, but I had never been there before to compare. It really is a special place!"}, {"username": "Julia Muller", "comment_text": "Wow - we were in Venice a couple of weeks ago and found it beautiful! Certainly no dirtier than when we were there 10 years ago, nor the trip 16 years ago. It is just a very old town, nothing is shiny and new, and that is what gives it some of its incredibly unique charm! We loved every second of our 3nts there 🇮🇹💕"}, {"username": "Ali Swing-Lowe", "comment_text": "I am not sure what the tuile skirts is a reference to."}, {"username": "Angela Gilmore", "comment_text": "I don't understand the tulle skirt reference. Why should people wear tulle skirt? 🤔"}, {"username": "Mandy King", "comment_text": "Omg we loved the Dolomites!!"}, {"username": "Bev Fisher", "comment_text": "It’s so disrespectful to go to another country and assume they’ll be grateful to take your cash whatever the currency!\nI’ve seen a few people in this group say you can use dollars - I don’t know anywhere in the UK that accepts foreign currency as payment - I assume Italy is exactly the same! We Europeans aren’t still living in the 1940s!!\nChange your flippin’ money!!!"}, {"username": "Angie Mattin", "comment_text": "“Use euros or dollars no one cares”.. what?!? The currency is euros. Use euros. Italians/\nEuropeans don’t want to exchange the money any more than you do."}, {"username": "Lina Stump", "comment_text": "Hot 🔥 🥵"}, {"username": "Pauline Donald", "comment_text": "Dolomites was it a day trip?"}, {"username": "Kristina Ruk", "comment_text": "Tipping not expected but we had a service fee on our bill (like 4 euros/person)) and not in Venice it was. We were in May and it wasnt so dirty as it was before quarantine in 2018, so maybe its because of tourist season.."}, {"username": "Mardi Lee", "comment_text": "Thank you. It's been 5 years since we were there also so this is interesting to read"}, {"username": "Isa Van Wyk", "comment_text": "Sadly I agree with cities in Italy. Milan was dirty and graffiti is overwhelming. We had to drive through Naples from port to airport and we were shocked ! Really bad ,filthy and looks dilapidated!"}, {"username": "Khan S", "comment_text": "Use dollars or euros? Do they charge the same amount or add more to price when u pay in dollars? (As euro is a bit stronger than dollars)"}, {"username": "Benita Hauskins", "comment_text": "We ended our 2-week trip in Venice and found it almost immaculate. Rome ... not so much but not that awful to complain. This year one has to remember Italy tourism is booming and the crowds so one has to allow leeway for minor issues."}, {"username": "Caroline Nicole", "comment_text": "Let’s help pick up the trash! If I see something near a trash and it looks safe, I put it in the trash. Let’s not have a bystander effect! We may not change it but we can make a difference!"}, {"username": "Sus N Mac RN", "comment_text": "Did you take a train to the Dolomites? May I ask how long it took and any details?"}, {"username": "Mimi Mary", "comment_text": "Thank you"}, {"username": "Giorgia Petraia", "comment_text": "Dollars are worth less than euros first of all, and it’s very rude to assume we take dollars"}, {"username": "Cynthia Guillen", "comment_text": "Thank you for sharing ❤️ Can you get coffee before 7:30? I don’t eat breakfast, but I do like to have coffee early in the morning."}, {"username": "Kath Jurewicz", "comment_text": "We loved Venice it was a dream in May this year!"}, {"username": "Claire Drolet", "comment_text": "We were in Rome a month ago and found a lot of trash and graffiti, our hotel wasn’t in the best location and that was disappointing.\nFirst time there and had visions of beautiful surroundings and no trash and thankfully the Vatican area was perfect!\nVenice was very nice, we enjoyed our time there, people are friendly and helpful and it’s so beautiful. As first time visitors we were mostly impressed by the beauty of this country, we traveled 14 days and saw ALOT!!!!! Can’t wait to go back"}, {"username": "Kim Comerford", "comment_text": "We were in Venice last October and I actually thought it was cleaner. We walked everywhere and I didn’t notice a lot of graffiti."}, {"username": "Peggy Fisher", "comment_text": "I was there last september, I was taken aback with the beauty, I didn't notice, dirt, smells or anything else, that place was amazing. If you think Venice has graffiti, wait till you get to Rome."}, {"username": "Carol Potter", "comment_text": "Well thank you for writing such a nice post. I hate that everybody on here had to tear it apart. I didn’t know this was going to be such a critical bunch of apparently entitled people. That just made up my mind to unjoin this group. I’ve been to Italy five times and there’s always something to enjoy. If there always negative complaints then I feel sorry for a lot of these people because they don’t know how to enjoy life. ￼"}, {"username": "Kirsty Manning", "comment_text": "Didn’t think we’d love Venice but we absolutely did. Didn’t notice rubbish etc but in Rome we were horrified. We stayed about 20min walk out of the centre and the neighbourhood was disgusting. Trash all over the streets. Pile of garbage everywhere. It smelled awful."}, {"username": "Nick Trostel", "comment_text": "We were there a few weeks ago and commented many times how clean we thought it was compared to when I was there 20 years ago and no smell. Can you elaborate on why you think it was dirty?\n\nDon’t go to Napoli Rome Florence or Milan if you think Venice has any graffiti. Especially Napoli"}, {"username": "Wayne Brits", "comment_text": "Don't stay at Wonderfull studios as well, the owner reason he doesn't give a shit about a negative review I wrote last month when I was there and that the accommodation is busy enough and he doesn't need fellow travelers"}, {"username": "Romanovska Irena", "comment_text": "It is hot. Maybe this is a reason for no tulle skirts? ;o))))"}, {"username": "Tanya Bitar", "comment_text": "In Venice, they will take dollars?\n\nCan you share the company for the tour to Dolomites?\n\nThank you."}, {"username": "Achim Marke", "comment_text": "Graffiti can be Art if done well 😏"}, {"username": "Jacqui Warsama", "comment_text": "I’d like to know about the Dolomites tour too please? Did you have to hike?"}, {"username": "Jennifer Cummings", "comment_text": "Gosh that is sad to hear!"}, {"username": "Ellen Edmonds-Wilson", "comment_text": "Venice is pristinely clean compared to Rome, which is a garbage dump as people drop bottles and rubbish everywhere. Also much more graffiti there."}, {"username": "Cheryl Kavanagh", "comment_text": "Hi Joye, thanks for your notes.What was so bad about the Hotel, 🙂"}, {"username": "Marissa McLean", "comment_text": "I was in Venice a few months ago and found it no dirtier than the city I live in, not once did I even think “god it’s so gross and dirty here” you’re also going to find graffiti in literally any big city anywhere in the world"}, {"username": "Jacinta McGarry", "comment_text": "Was there in 2018 and there again in 2022. Venice is looking very tired and worn. It doesn’t seem to have that spark that it once had.😔😔"}, {"username": "Allison Mir", "comment_text": "You might not care about paying in dollars but you will almost certainly be paying way over the exchange rate. Local currency is always best"}, {"username": "Emma Dowling", "comment_text": "Dolomite tour info please"}, {"username": "Clarissa Rava", "comment_text": "Tip is not required in italy, in general. If you ever felt forced to leave a tip they were very rude because we don’t tip in italy. Also pickpockets are more common in Milan then any other italian cities at the moment. Be careful (i know cause i live and work in Milan)"}, {"username": "Joya Morrissey", "comment_text": "Bathroom"}, {"username": "Joya Morrissey", "comment_text": "Floor stains"}, {"username": "Joya Morrissey", "comment_text": "Leak"}, {"username": "Joya Morrissey", "comment_text": "Mold"}]}, {"id": "2196980324034379", "text": "Hi everyone!\nWith my group of friends some of us are doing a morning tour at the Colosseum. At the same time we’re doing the tour, others in the group would like to visit either museums/churches or something similar (possibly air conditioned?). Are there any recommendations for museums and/or churches near the Colosseum so we can stay close to each other? We have been searching but would appreciate recommendations. Thank you so much ❤️🇮🇹❤️", "link": "facebook.com/groups/1373361046396315/permalink/2196980324034379/", "likes": 2, "comments": [{"username": "Tari Lawson", "comment_text": "The Capitoline Museum is a good option. Your friends can do just the Museum or take the elevator to the roof for amazing views. The Basilica of San Clemente is another good option, or The Basilica San Pietro in Vincoli."}, {"username": "Elena Eugeni", "comment_text": "Domus aurea Is near and AMAZING. You need to book in advance"}, {"username": "Carolyn Hill Leptich", "comment_text": "This church is nearby and really cool: https://\nwww.rome.net/\nbasilica-san-cle\nmente"}]}, {"id": "2196796250719453", "text": "Traveling to Rome in September and I’ve heard different advise about getting cash for the trip. Some say get via ATM when you arrive in Italy, others say to get from your bank before leaving. What’s the better option? Thank you 😀", "link": "facebook.com/groups/1373361046396315/permalink/2196796250719453/", "likes": 7, "comments": [{"username": "Rose Anderson", "comment_text": "If you can buy maybe $50 in euros from people you know who were there or your bank it can be helpful just to be prepared when you land until you can get to an atm- best to go to an atm at a bank- if they ask you if you want the conversion rate click no-\nYou will get a better exchange rate in Italy so I wouldn’t go thru your home bank- also you can use a card almost everywhere so you won’t need a huge amount of cash"}, {"username": "Ryan Mills", "comment_text": "If you have a credit union account its very easy to do before you go."}, {"username": "Rose Anderson", "comment_text": "I personally know five people who lost either a phone or wallet to pickpockets just this summer so take all the precautions and be aware"}, {"username": "Carmela Siniscalchi Frattellone", "comment_text": "I personally get all the money I need before I leave. I like to pay cash and just charge my hotel."}, {"username": "Ryan Mills", "comment_text": "The thing you will run into with trying to use a card is that sometimes their machines have a hard time picking up Wifi and you are stuck until they can get signal."}, {"username": "Carol Potter", "comment_text": "Do it before you go"}, {"username": "Jacquie Johnston", "comment_text": "Our bank got our euros and we ran out and we use an ATM in Rome"}, {"username": "Gillian O'Callaghan", "comment_text": "TBH you're going to get 50:50 again....do whatever's easier for you."}, {"username": "Vanessa Wiesehan", "comment_text": "We just got back. Our home bank rate was the best. We tried ATMs in Italy but rates were not as good. We got lucky in Florence and used a bank one in piazza signoria that was comparable."}, {"username": "Dana Sammon Saunders", "comment_text": "I grabbed some at a bank ATM. I mostly used Apple Pay while there tho"}, {"username": "Janet Messanelli Bozzone", "comment_text": "You’ll get different advice here too. 🤷🏼‍♀️"}, {"username": "Bron Davis", "comment_text": "Cash is King in Europe! Our experience on the Amalfi Coast was taxi’s take you to your destination and on arrival advise they will only take cash and at exorbitant prices. We took cash and a bank travel card with Euro’s on it. When using an ATM ONLY USE A BANK ATM! The others charge huge fees."}, {"username": "Susan Weitzenfeld Rosen", "comment_text": "What about using American Express???"}, {"username": "Annette Fordyce", "comment_text": "I always take cash which I order ahead of time. I split it up between suitcase, neck pouch, and carry on and then keep in hotel safe once we arrive. I think there is no “right “ way, it’s up to your comfort level."}, {"username": "Bea Kuckens", "comment_text": "Get it before you go. You’ll be tired and busy, the last thing you’ll want to do is find an ATM - and you may want / need it before you have time to do so."}, {"username": "Jenn Messina Babore", "comment_text": "Having just gone through this, I would get Euros at home. I kept reading get from a bank owned ATM, but we got hit with European bank fees at several bank owned ATMs."}, {"username": "Lisa Kelly", "comment_text": "We just did it at a cash machine when we arrived. $12 in fees between the machine and our bank. We just got a lot to make it worth it. You need some for the taxi or transport from airport."}, {"username": "Raf Gervasio", "comment_text": "Post Office travel card is the best"}, {"username": "Sandra Shoffner", "comment_text": "Get some before you leave home."}, {"username": "Dawn Reed", "comment_text": "Great thank you everyone 😀"}, {"username": "Claire Buccini", "comment_text": "Where are u located? We are from Oz and found the atms in Italy gave us a much better rate than pre buying"}, {"username": "Daisy Yoo", "comment_text": "I got some from my bank bc my first day arrival , I am going to get the taxi outside and head to my first stop , we have 3 ppl , with the train it is 14 euro and it only get y to train station , so to me\nTaxi hands down and I know Italian prefer cash , 50 euro , then if I need more than what I got from home , I can always use my atm card , have some cash when I arrive is Important to me. U have to know what u do first day , if y will have time not to use any cash when u first arrive , if so , u do not need much cash from home . No answer is absolutely right or wrong , all depends"}, {"username": "MaiLing M Matthews", "comment_text": "Apple Pay is accepted almost everywhere. If you have an iPhone just add your cards to your wallet. It’s secure and very easy to minimize the risk of losing cash."}, {"username": "Bobbie Lozzi", "comment_text": "Peter Lozzi"}, {"username": "Shelley Howard", "comment_text": "don't what works for u ..there is no right or wrong option"}, {"username": "Paul Davis", "comment_text": "FYI, my bank charged me $1.13 when the rate was $1.09. So about a 4% fee."}]}, {"id": "2196797284052683", "text": "Are there train strikes and when are the strikes.", "link": "facebook.com/groups/1373361046396315/permalink/2196797284052683/", "likes": 2, "comments": [{"username": "Alice Francesca", "comment_text": "No train strikes in sight.You should always check for news about sciopero treni (train strikes) on Ansa.it if you think there might be one.not too often, don't worry."}]}, {"id": "2196731277392617", "text": "What if I take cash US dollars\nTo Italy and exchange there ,or is it better to exchange here to euros from my bank and Iam talking about few thousand of dollars please advise thanks", "link": "facebook.com/groups/1373361046396315/permalink/2196731277392617/", "likes": 33, "comments": [{"username": "David Garfinkel", "comment_text": "Do not take that much cash. Take just enough euros for tips. Otherwise always use a credit card. Preferably visa or Mastercard as many places don’t accept Amex"}, {"username": "William Gonzalez", "comment_text": "I use my bank card no international fee I have capital one and penfed"}, {"username": "Irene Oda", "comment_text": "Some people want to bring cash only. It's a preference. Is it yours? If yes, there are foreign exchange places and you will be charged exorbitant fees on top of the exchange rate. Banks usually will exchange but I'm not sure if it's client based. I've always used an ATM with debit card - I have Bank of America debit card for this purpose. I understand Wells Fargo does a good job too."}, {"username": "Juliet Lee", "comment_text": "DO NOT USE CASH! Get an international travel card - everywhere excepts card these days in Europe. Use it at ATM’s in Italy if you need cash."}, {"username": "Zoe Gardiner", "comment_text": "If you have time get a wide card it automatically converts for purchases so there is no foreign currency fees! And it allows to to withdraw money from atm without conversion fees"}, {"username": "Joan Romiti", "comment_text": "Get small bills we had a hard time spending large bills. Some places won’t take them.."}, {"username": "Ulrika HN", "comment_text": "Credit/debit card purchases in euro or withdraw at atm at a bank"}, {"username": "Keith Thompson", "comment_text": "Tap your phone using a good travel credit card. Get cash from a bank when you’re in Italy for the rare times you can’t tap. No need to carry any cards this way. It’s what many Italians already do."}, {"username": "Andrea Collisson", "comment_text": "Better to exchange there but travelling with cash is risky. Why not look into credit and debit card options."}, {"username": "Giacomo de Medici", "comment_text": "Open a wise account"}, {"username": "Donna Jones", "comment_text": "Are travellers checks still a thing?"}, {"username": "Michele Elizabeth", "comment_text": "It's best to use a debit card that does not charge foreign transsction fees."}, {"username": "Christine Pelosi", "comment_text": "I got my Euros from AAA. If you are a member there is no fee. Takes a few days. I budgeted 100€ a day for food, drink, souvenirs and used my credit card for bigger purchases. Was there 10 days and came home with 150€😉🍷"}, {"username": "Maria Davi", "comment_text": "We exchange about $500 to Euros at our bank. I would not exchange money at the airport. The rate is not great. No need to take that much money. We use credit cards at restaurants, hotels, shopping. If you need more cash, atms are the way to go."}, {"username": "Melinda Giuffre", "comment_text": "Exchange at your bank"}, {"username": "Gunilla Larsson", "comment_text": "Debit card"}, {"username": "Pong Ac Ai", "comment_text": "Same"}, {"username": "Sharon Lehmann", "comment_text": "A few years ago I went to Spain and Italy for a month. My bank exchanged money for me before I went( $3000). I used a money belt, but then only had a few hundred euros available in my purse at any time. I did not feel like someone was going to steal my money, I also had a crossbody bag.\nI only had a debit card, which I did not have a problem using. I also used a bank ATM. Be careful of the fees they might charge.\nHave a great time."}, {"username": "Rachael Richardson", "comment_text": "Exchange rate is terrible in Italy for USD and £ change before you come or get a preloaded travel money card or find a Mastercard that doesn’t charge"}, {"username": "Maggie Williams Dryden", "comment_text": "Get them from your bank in the US before you leave."}, {"username": "Diane Freitas Moore Walker", "comment_text": "Europe does not want our cash. We used a credit card with no fees attached. We took what we thought was enough euros but was not. We had to use ATM card to get more at a great cost. My suggestion is get your euros in the US and get more than you think you need as many tours are now asking for euros and will not take cards. We were gone 20 days and I had 1600.00 in euros and came home with 70 euros plus using my credit card."}, {"username": "Julie Gallagher", "comment_text": "Up bank work well for us"}, {"username": "Yvette Pavone", "comment_text": "￼$300 cash is fine and you can exchange there! All you need is a credit card with no international fees! EVERYONE TAKES IT"}, {"username": "Sarah Dobrzykowski", "comment_text": "Don’t do it! I did and brought it all back. Your ATM card in a bank ATM is going to get the best rate. Don’t be me- don’t exchange at the airport or take a bunch of cash. Visa or Mastercard (whichever one is on your ATM card) is going to get you the best rate."}, {"username": "Vikki Grass", "comment_text": "I order from the bank at home and they deliver the euros to your house. You have to be home to sign for it but you are cashed up From the start. For 2 weeks we took €1000 and did end up debit atm with small fee for last bit of cash. Credit card for large purchases."}, {"username": "Scott H Charlotte", "comment_text": "Get a revolut card !"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Never used any cash … everyone takes credit cards"}, {"username": "Kate Venezio", "comment_text": "I went to Venice, Florence, Rome this week and used Apple Pay everywhere! Didn’t use cash once even though I had some. Saved it in case of emergency but never needed it"}, {"username": "Amberlee Capra", "comment_text": "You can exchange at some post offices."}, {"username": "Carol Hayes", "comment_text": "Clark Howard says IF u need euros to get them in Italy not at ur bank bc the exchange rate is higher at bank. Otherwise he says use a credit card w no fees and definitely not ur debit card. Just sayin’"}, {"username": "Shari Powers Roberts", "comment_text": "Use a bank ATM in Italy. Gives the best exchange rate"}, {"username": "Dianne Novak Iadanza", "comment_text": "AAA will do a good exchange for Euros here in the states"}, {"username": "निनावी सहभागी", "comment_text": "How do I contact them I have AAA insurance"}, {"username": "Sara Kyle Hargett", "comment_text": "Only used cash for tips or cabs. Cabs will take your credit card too but I didn't like doing that"}, {"username": "Ramona Waltman", "comment_text": "Best to do there with debit card to avoid fees"}, {"username": "Jo Ann Perrotta Solimando", "comment_text": "My experience. Change on the US. They are very picky about our dollars. No writing on them. Not even a pen point spot. They won’t take them. Siooo they denied more then half my money to exchange"}, {"username": "Kimberly MacKinnon Cherry", "comment_text": "Exchange $$ here at your bank. My bank had zero service charges"}, {"username": "Michael Alea", "comment_text": "Don’t take that much cash. Use your debit or credit card"}, {"username": "David Gotlieb", "comment_text": "Do it with your own bank or get cash from an ATM in Italy.\n\nChanging dollars to euros is ridiculously expensive in terms of commissions etc. worse at the airports.\nYou can’t do it in banks without accounts, so you have to use the changers who fleece you.\n\nBest way is to use your card at an atm to get cash."}, {"username": "Annette Mayer", "comment_text": "Get cash fromATM in Italy. The machine asks if you want them to do conversion. Click no, let bank do conversion. Better rates, no fee."}, {"username": "Michael Barnes", "comment_text": "Carry a few € hundred with you so you aren’t scrambling for tip money and an ATM at the airport. Wells Fargo will fedex whatever amount you request at bank rate."}, {"username": "Angela Loscalzo", "comment_text": "Get euros from your bank , not in Italy. Get them a month in advance. Plus take some US cash. Two credit cards in case one has issues. You should tell credit company you will be out of country so they do not think your card is stolen.\nJust what I have done but everyone is different.\nBut no debit card!!"}, {"username": "Monika Marković", "comment_text": "Use a credit card that doesn’t have fees internationally\nlike an Amex or Chase Sapphire card. You should only take out cash if necessary but these days you really won’t have an issue. Especially in Italy"}, {"username": "Sarah Cozzolino Sullo", "comment_text": "We just came back, don’t bother taking American dollars go to your bank and get the Euros and we used credit cards and the euros."}, {"username": "Douglas Martin", "comment_text": "Just buy 3-4K in euros before you leave the US dollar is not that popular anymore lost its lustre years ago like a lot of things then get a travel credit card with a set limit"}, {"username": "Erik EL", "comment_text": "Get euros from your bank. Leave your debit card home. Use a travel credit card for everything you buy and bring the Euros over for emergency cash purchases or tips (if tipping)."}, {"username": "John Kay", "comment_text": "Raelene Kay"}, {"username": "Maria Coladangelo Ducca", "comment_text": "Exchange here"}, {"username": "Diana Himes", "comment_text": "Get euros from your bank in the us. We just picked up 1000 euros yesterday. It’s a good amount for 2 week trip for 2 people."}, {"username": "Elizabeth Grafel", "comment_text": "Credit cards, but nice to have some Euro for tips. Bank of America travel card as there are no fees and you earn cash back."}, {"username": "Annia Amador", "comment_text": "Don't take that much cash out, no need. 200 at a time, pay with a credit card with no international fees."}, {"username": "Debbie Plante", "comment_text": "I use my credit card for pretty much everything. I take about $500 euros just in case and use some of that for gratuities."}, {"username": "Susan Callahan", "comment_text": "Get your Euros at your bank and save the commission fee."}, {"username": "Eva Salas", "comment_text": "We took euros we got from our local bank - about $1,000. We paid for our dinners with cash and used a travel credit card that’s on my phone for some purchases. We had cash leftover."}, {"username": "Ana Ferreira Ruffel", "comment_text": "I haven’t been to Italy (going soon) but I have been to portugal multiple times.. I go to a AAA office here in the states and exchange my dollars to euros.. I bring money just for food and small things… if I purchase something big where I would need a lot I used my c/c .. and when using c/c always tell them it’s in euros.. there some kind of thing they do where it could be euros or dollars but e is better and you don’t pay some fee.. I’ve always heard those exchange places at airports will rip you off with extra fees.. in England I would go to the post office to exchange my money also!!"}, {"username": "Lori Alves", "comment_text": "NEVER use Debit Cards only credit cards. Buy small amounts of euros daily from reputable exchange house or National bank."}, {"username": "Lori Alves", "comment_text": "Covered Debit Card is rare. Are you sure?????"}, {"username": "Tanzia Samad", "comment_text": "Just use an atm , gives u euros instantly . I saw money exchanges when I came 9 years ago but now I see none . Used my debit card at malls , Positano , Napoli without any hassles to get euros. My usd is sitting in my room locker"}, {"username": "Caren L Thomson", "comment_text": "I’ve been to Italy twice in the last year, I always take euros with me. I get them at Wells Fargo, I was told by my regular bank even they get theirs through Wells Fargo! We used the cc for a lot of things, but I always have cash."}, {"username": "Debra Trolman Alvo", "comment_text": "Following 😊"}, {"username": "Jayne Dawson Meyer", "comment_text": "From your bank ( 2-3 days) We brought 1200.00 euros & used the visa rest of the time. Brought home 400 Euros.\nWe went 19 days all over. Best experience ever!!"}, {"username": "Alexandra A Welker", "comment_text": "Do not exchange there, the fees are outrageous. Bring to your bank or Triple A to exchange. It's always nice to have working currency upon arrival."}, {"username": "Terry Lea", "comment_text": "Ho hum"}, {"username": "Lalita PosBa", "comment_text": "I am in Rome now and you really don’t need any Cash unless you want to buy something in the street like waters and stuff"}, {"username": "Joe Guzzi", "comment_text": "For such small amounts, it doesn't really matter. 10s of millions are another thing."}, {"username": "Giovanni Pianigiani", "comment_text": "Unless you need to bribe some public officer to try and support some odd business activity I can't imagine a reason why you'd need \"a few thousands\" in cash😅"}, {"username": "Cory Lee", "comment_text": "You really only need cash for tipping in restaurants and smaller towns that don’t accept credit cards. I just use my phone and don’t even carry my card."}, {"username": "Rhona OConnor", "comment_text": "Big wads of cash attract attention. Cash can be stolen so easily especially if you are travelling around. You would not walk around NYC with thousands of $ in your pocket. Same thing anywhere not just italy."}, {"username": "Alison Alborough", "comment_text": "Get a Wise credit card. Their exchange rate beats most banks"}, {"username": "Brian Johnson", "comment_text": "just use bank ATMs as needed once you get there"}, {"username": "Miri Ringrose", "comment_text": "Take a Wise currency card and a little cash"}, {"username": "Richard Meek", "comment_text": "I found the Italian post office cheapest for atm withdrawals in Italy ."}, {"username": "Sandra Shoffner", "comment_text": "If you use an ATM in a bad area your bank may block your card. Happened to my friend and she didn't bring a backup card. I had to loan her money the whole trip. I told her to get some euros before we left home but she didn't.\nWhen we got back she called her bank and they told her she used a suspicious bank so they blocked her card."}, {"username": "Jane Eichhorn", "comment_text": "We were gone two weeks and took $1000 with us, having exchanged from our bank prior. Note you may need to order this through your bank a week ahead, as ours came from a larger branch, not carried by the local bank. This was the right amount for us.\nUse your room safe to keep your passport and extra $.\nTen days of our trip were prepaid in a tour. If you need an ATM, only use ones physically connected to a bank, or the fees may be much higher."}, {"username": "Jennifer Quizon", "comment_text": "Credit card and check to see if they charge you extra fir foreign exchange\nMost places accep credit cards these days. I do also carry euros and dollars. A few hundred each depending how long you stay..\nbanks in Europe also exchange for a few of course."}, {"username": "Kim Tremain", "comment_text": "We exchanged in US and brought with!"}, {"username": "Pauline Richardson", "comment_text": "From England w e have debit cards with a set limit on them and credit card accounts where the bank charges 0% interest on foreign currency exchange."}, {"username": "Deborah Coram", "comment_text": "I converted $1000 to € prior to going and used my cc for everything else. That was sufficient cash to get me through everything I needed cash for plus a bit left over. The best exchange rate and the lowest fee you will pay is at your bank at home not OS. Most places take Cc and it is your most secure transaction. Wherever possible, use your Apple Pay not CC as your number is encrypted and it is much safer than using your Cc"}, {"username": "Margaret Pantusa", "comment_text": "Most hotels have safes…exchange before you leave!"}, {"username": "Teresa Herrington-Dunham", "comment_text": "Do we need an adapter to charge iphone in Italy? I know I have intnl. plan."}, {"username": "Shawn Galbraith", "comment_text": "Professional travel writer Rick Steve’s always recommends:\nJust use the ATM when you get there!\nNo need to complicate it!"}, {"username": "Renee Rundle Stoneham", "comment_text": "Don’t bring US dollars you’ll get a horrible exchange rate and spend so much time trying to find someplace o exchange them.\n\nBring a few hundred euros from US, your bank can order them. If you feel you must bring some.\n\nThen when you need cash use a Debit card to pull cash from an ATM. Make sure your debit has 0 foreign transaction fees. We used Capitol One.\nNEVER use a CC to pull cash from an ATM!! Wayyy too many fees, because it’s a cash advance etc.\n\nCC have become the way to pay, contactless payment it’s just easy etc.\nSome smaller places gelato, bakeries, stands, street food cash is easier and preferable."}, {"username": "Roland Trego", "comment_text": "Get $200 worth of euros from your bank before you leave. Use your credidit card for purchases above 10-15 euros. Withdraw cash as needed from an ATM system affiliated with your bank. ￼ By all means, don’t carry around large amounts of cash. If it disappears, you’ll never see it again."}, {"username": "Joanie Corneil", "comment_text": "There"}, {"username": "Alicia Cox", "comment_text": "Honestly I have ALWAYS gotten 3-400 in euros in the US from my bank before I go. I don’t want to get there all tired & have to worry about money & the money saved is not substantial esp not compared to the cost of the trip.\nWhile there, use your debit card at a bank ATM & get what you need in smaller amounts - 2-400 (if that) & use your no fee credit card while there."}, {"username": "Karen Van Den Bosch", "comment_text": "Frank Van Den Bosch"}, {"username": "Helen Fletcher", "comment_text": "You need euros for the ferry if you buy tickets on the day"}, {"username": "Maria Y Alexieva", "comment_text": "Don't bring so much cash. You can basically pay almost everything by card (visa and MasterCard)."}, {"username": "Robin Barbera", "comment_text": "No"}, {"username": "Robin Barbera", "comment_text": "I’ve lived in Europe and traveled in Europe and always use my debit card at an ATM and I’ve never had a problem. I wouldn’t take money there and exchange it you’ll pay double to be able to get it into euro. The best thing is to take a little bit of euro and take a debit card. If you have two debit cards, you don’t want to take both leave one at home, I personally take two credit cards and two debit cards with one of each in my bag at the hotel and one of each I carry with me. I was just in Italy 3months ago and barely use my debit card only credit. When you charge your credit card, make sure you charge in euro and not in US dollars otherwise you’ll pay double."}, {"username": "Vanessa Wiesehan", "comment_text": "We just got back. Our home bank rate was the best. We tried ATMs in Italy but rates were not as good. We got lucky in Florence and used a bank one in piazza signoria that was comparable."}, {"username": "Phyllis Snyder", "comment_text": "Take about $100 and exchange it at the airport just to get by that day- then use your debit card at an established bank ( not at a store or streets) ATM for euros."}, {"username": "Janet Messanelli Bozzone", "comment_text": "Don’t take currency to exchange. Use the ATM."}, {"username": "John Licata", "comment_text": "Don’t take that much cash. Use your ATM at banks there.\nYou get a better exchange rate"}, {"username": "Julchen Zamora", "comment_text": "Look for an exchange office here in USA assuming you are in the US\n\nGet maybe €1k euros with you\ntake all the other money and put it in card that charges you not international fees.\n\nCredit card: Chase sapphire & Capital One for example, use it for everything and then pay off once you return home.\nYou will save money and will earn more points for future travels."}, {"username": "Thressa Oliver", "comment_text": "Exchange before you go!!"}, {"username": "Clayton Webb", "comment_text": "Nicole Webb"}, {"username": "John Kay", "comment_text": "What about iff you change to euro before you leave ?"}, {"username": "Benjamin Joseph", "comment_text": "Personally I wouldn’t take my debit card. I don’t take that out of my house. Credit cards are covered but debit are not. Even if reimbursed it could take weeks or even up to a year. Maybe I’m crazy or just poor but I can’t afford to have my bank account wiped out"}, {"username": "Stephanie J Stevenson", "comment_text": "Why would you travel with thousands in cash?"}, {"username": "Stephanie J Stevenson", "comment_text": "This question gets asked daily and there is a lot of bad advice given. Never accept the conversion at an atm and always use a debit card that reimburses atm fees."}, {"username": "Al Filizetti", "comment_text": "I ordered Euro from my bank , then I got another small amount while in Italy from a ATM. Most of the time I used my credit card."}, {"username": "Charleen Siegler Schuss", "comment_text": "Get 100 euro at your home bank. Use ATM s attached to banks with your debt card. Dont use free standing ATM's with big sugns. They have huge fees and horrible rates. Check to see if your bank charges foreign transaction fees. If yes find one that doesn't. Use a credit card foe most stuff."}, {"username": "Maria Angela Perrone", "comment_text": "I am going to Italy in 2 weeks. I changed dollars for euros and I got a money belt that goes under my shirt. For the rest, I will use credit cards."}, {"username": "Linda Johnson", "comment_text": "If you use your credit card at an ATM, it will be cash advance and cap one chg a $10 fee plus charges interest so TAKE your atm card"}, {"username": "Charmaine Tetkoskie", "comment_text": "I’d exchange before you go. I exchanged money and then also took cash. Worst mistake ever to take US cash. I should’ve taken more and then just used my credit card. You can also get money from bank ATMs. The bank ATMs are the only ones I’d take money from"}, {"username": "Monica Roman-Fazio", "comment_text": "The post office ATM in italy is the best one to use. Don't exchange there get it from here keep checking the rate it keeps going up and down."}, {"username": "Anne Mc Namara", "comment_text": "Im from Ireland,so use Euro anyway but I never bring cash. I just use my Revolut card and pay for everything by card"}, {"username": "Maureen King", "comment_text": "So if I go to my bank and ask for 1000 worth of euros do I get more back ? 😆"}, {"username": "Jenny Payne", "comment_text": "Change it in your own country"}, {"username": "Elizabeth A McGuirk", "comment_text": "Exchange very little here in U.S....use credit card with no exchange fees...you get better rate that way than w cash"}, {"username": "Marina Belardo Johnson", "comment_text": "I only take money from\nATM in Italy and use my debit card only for ATM.\n\nI use only my credit cards to pay for things!"}, {"username": "Tom Duffy", "comment_text": "Order from you bank"}, {"username": "Chris Vilsack", "comment_text": "Bring enough euro\nThey hit you as you go by\nExchange rates at airports are insane\nAs they can be in your travel location\nChase and boa both sell euro on their web sites"}, {"username": "Athena Dahlin Cross", "comment_text": "I live here and I use my U.S. Atm card regularly , just like I would at home. Do not bring cash to exchange! It really is not that different from getting money from an ATM in the US. Same as when I travel to other countries."}, {"username": "Barbara Bastianini", "comment_text": "I would never travel with a few thousand dollars cash on me.\nThat much money would be a burden. It’s a magnet that attracts pretty criminals, pickpockets, etc. Plus there is always the possibility you could lose it.\n\nIn my opinion the best way to obtain cash abroad is to use a travel debit card with no foreign transaction fees. I use the debit card associated with the Charles Schwab High Yield Investor account. This online account is free to open, free to maintain, and requires no minimum balance. It provides a fair up to date exchange rate at every ATM on any network worldwide. It provides fraud protection and isn’t linked to any other accounts you may have. Plus it charges no foreign transaction fees snd it reimburses any frees charged by the ATM itself. We use this only for travel, transferring funds into it before a trip snd ignoring it between trips. We’ve used it on trips to numerous countries on several continents. Never once had a problem of any kind. It’s easy and convenient.\n\nWe use a charge card for hotels and most expenses but the debit card to get local currency at our destination.\n\nYou can apply for this card online. Or you can look up other travel debit cards because there are a white few out there. One of them might suit your needs."}, {"username": "Wallace Clavelle", "comment_text": "Just use your cc.\nMake sure you accept euro and not US dollar when using your cc. You will be charged more."}, {"username": "Tricia Bean Scott", "comment_text": "Debit card at ATM machine, best rate, easiest way."}, {"username": "Jeanette Colon", "comment_text": "Find an ATM from a bank only, otherwise it’s astronomical rates"}, {"username": "Achim Marke", "comment_text": "I recommend a atm owned by an bank in Italy. Be aware there are set up atms which totally overcharge. Use one in front of a bank or walk into the bank. If your house bank in USA don't overcharge exchange there. Private rental is often expected in cash anyone else even on beach or mountain top takes cards. Visa and mastercard for sure Amex can not tell"}]}, {"id": "2196656880733390", "text": "Humidity today in Rome 😭😭😭😭", "link": "facebook.com/groups/1373361046396315/permalink/2196656880733390/", "likes": 2, "comments": []}, {"id": "2196742474058164", "text": "Please be aware, do not book b&b's without review. We were staying at Kalos B&b in Sorrento (booked via booking.com) and the host was upset that we used the kitchen to make food for our toddler even though I expressly took permission from them for it. He stormed into our room screaming and shouting to get out even though we had 3 more nights of reservation. He was aggressive and was ready to hit my husband. We stayed calm and walked out.\n\nWith peak season, so far we found accommodation in one hotel for one night and will need to look for more options tomorrow. It was a very scary experience especially for my daughter in front of whom he was screaming despite us telling him to calm down n talk.\n\nWould also appreciate any advice on steps I should take to safeguard ourselves and recuperate the money lost.\n\n****UPDATE *****:Sorry din't get a chance to go through soo many comments we stayed in all 3 different hotels in last 3 days( weekend) , We have reported to Police with all the relevant evidence and chats and its under investigation, thankfully my husband was on business meeting at that time with team recording on. We had to report in Italian language to police and engage a translater, which was all new for us. All hotel staff / Police were very helpful in getting the translation . We also iniated complaint with booking.com via chat which seems to be a slow. Also we have requested them to unlist and take actions , please stay safe and spread the msg .🙏 💙", "link": "facebook.com/groups/1373361046396315/permalink/2196742474058164/", "likes": 27, "comments": [{"username": "Douglas Godesky", "comment_text": "To be clear, this was NOT an Airbnb lodging, this was some \"bed and breakfast\" establishment not on the Airbnb system, correct? Many have expanded your B&B to Airbnb which seems not to be the case; we have had outstanding Airbnb visits worldwide, including Italy."}, {"username": "Michelle Cotoni", "comment_text": "Search for reviews always! Regardless of it’s a hotel or vacation rental. Read all fine print."}, {"username": "Linda Corigliano", "comment_text": "This is terrible. I would report him to the local authorities. They live in tourism there."}, {"username": "Stuart Vogt", "comment_text": "Sorry for the experience, but I would never think to use the kitchen in a bed and breakfast. Airbnb yes, bed and breakfast no. Handled very poorly. Nothing you can do when someone just keeps yelling"}, {"username": "Michele Drozdowski", "comment_text": "Check out Hotel Florida-we just left, reasonable, clean and they had rooms available."}, {"username": "Peggy Bollinger", "comment_text": "I will never use booking.com again. I have used them for more than 10 years and got screwed in property in Florence. Booking.com would not back me on anything. I went straight to corporate and threatened suit. Finally my American Express stepped in and I got my money back. Not what it used to be"}, {"username": "Peta Willoughby", "comment_text": "Sorry you went through this. You should definately report this to booking.com. They should probably ban him from using their platform and hopefully reimburse you. This is disgusting behaviour and it’s abuse.\n\nDefinately stick to hotels from now on. I predominately used hotels whilst travelling, but I did book an apartment through booking.com for our accommodation in Rome - and there was renovations going on throughout the entire complex everyday. It felt like we were the only ones in the entire complex as everything else was under construction. They also knocked on our door to enter the apmt to do some electrical work. I wasn’t impressed. From now on I’m sticking to hotels.\n\nHope you get your money back, all the best."}, {"username": "Maria Strachan", "comment_text": "The guys sounds like a psycho!"}, {"username": "Tammi Vajda", "comment_text": "We used Airbnb’s the whole time in Italy. I will say reviews matter. So pay close attention to them. Recent ones are the best. Also, look to see how booked the place is. A frequently booked one with great reviews, 4.9 or higher, have all been just wonderful."}, {"username": "Terry Lee", "comment_text": "So sorry to hear. Try to salvage rest of vacay and put it on back burner til after home. Take care"}, {"username": "Brandy Saylor-Wilds", "comment_text": "I was just looking at that one! I’m staying in Sorrento on my own for 3 nights while the kids go to the dolomites for hiking. I am so glad you posted this."}, {"username": "Monica Villafranco", "comment_text": "So if I’m understanding correctly- you stayed at a b&b, but needed a kitchen for your child. So you used the kitchen that they use to cook meals for all their guests. I’m assuming ￼ they were upset because they probably had to sanitize the kitchen again prior to cooking meals to ensure the safety of their guests??\n\nthe reaction was a bit much, but I’m thinking it was a language barrier.\n\nMy family and I have always booked through VRBO or Airbnb here in the states and abroad when my kids were little. and now that they’re adults, we still do it because it saves some money eating in a few days. ￼\n\nI suggest you try that in the future. Good luck!"}, {"username": "Chantal Pelletier", "comment_text": "See with Booking directly\nThey usually insurances for cases like thise"}, {"username": "Sheyla Enrich", "comment_text": "That is why I don’t do Airbnb, I book hotels in the center and I feel secure like that. One more reason to don't do airbnb"}, {"username": "Chantal Séguin", "comment_text": "I always book by airb&b and never never got any trouble. But yes you have to read every line and email questions .."}, {"username": "Chantal Séguin", "comment_text": "Contact booking.com for sure they will find you a place. Airb&b do that"}, {"username": "Rosalinda Winco", "comment_text": "Contact your credit card and tell them the situation. They will open up a case and get both sides of the story. If they side with you then you can recoup your money for the days owed. And yes never stay at a place that has no reviews. Good luck. I wonder if there was a language barrier and they misunderstood that you were going to use the kitchen to prepare your child a meal. There was no need to scream and act violently towards you."}, {"username": "Holli Martin", "comment_text": "B&B stands for Bed & Breakfast in the UK. If you stay in Self Creating then it's like an flat/\napartment. But maybe it's different in Italy."}, {"username": "Bill Bowler", "comment_text": "For all those making erroneous comments this is a Bed & Breakfast not Air BnB!"}, {"username": "Frances McDonagh", "comment_text": "I \"Always\" look at reviews for a place I am booking I presumed everyone would 🤷🏼‍♀️"}, {"username": "Pamela Schnepp", "comment_text": "Antoinette Schultz Vogt - note differences in B&B and Airbnb."}, {"username": "Nilza Mercado", "comment_text": "That’s why you’re better off with an “entire place” Airbnb. You won’t have to deal with those restrictions and such behavior from a host is not tolerated by Airbnb regulations. I’ve had nothing but great experiences staying at Airbnbs"}, {"username": "Carol Brewer", "comment_text": "Make sure you post your dissatisfaction\non Trip Advisor ."}, {"username": "Tracy Thacker", "comment_text": "Thanks for posting! Will not stay there!!"}, {"username": "Lori Miller", "comment_text": "Air bnb? If so report- they will be banned from the platform. Nevermind- bnb not airbnb. Report to booking . Com"}, {"username": "Dawn King", "comment_text": "I would contact booking.com. I booked all my accommodation through them (7 in all) and not one problem"}, {"username": "Lisa DeLeo", "comment_text": "You never use an Italians kitchen!!! Nope. 😳"}, {"username": "Gina Bennett Pruitt", "comment_text": "There is more to this story. Why post anonymously too?"}, {"username": "Samantha R. Howlett", "comment_text": "Hopefully they refund you fully and take this guy off of their listing! It’s one thing to speak to you guys about the rules it’s another to start an altercation."}, {"username": "Cath Woods", "comment_text": "I don’t like that booking .com now have “air bnb” or “b-n-b”type accommodation\nI liked it when they only had hotels etc with reception desks etc\nNot keen on this new business model of theirs - leave that to air bnb\nHave cancelled some accomodation for September after reading the reviews of bad hosts, and misleading descriptions"}, {"username": "Ruth Akutu Maccarthy", "comment_text": "So sorry you had this experience.\nThe host could have handled this in a very different way"}, {"username": "Prithviraj Sengupta", "comment_text": "If you had explicitly taken permission , where was the issue ? He had no right to behave the way he did. And then if you did nothing wrong why did you not escalate?"}, {"username": "Liz Shermeto", "comment_text": "I would go back to booking.com. They may have some kind of recourse to get your money back to you either through them or the owner."}, {"username": "Pat Carley", "comment_text": "I have been reading the last two days about people’s experiences with B&Bs, VRBO and AriBNBs. The conclusion I’ve drawn for my self /\npersonally is when traveling to Europe or else to book with a reputable hotel. The stories I’ve heard just add another layer of stress not need on a vacation-especial\nly an expensive vacation.\n\nI want to thank everyone who provides open and honest feedback.\n(Tami)"}, {"username": "Kay Rendall", "comment_text": "Report him to Booking.com. I have had satisfaction from then in past when host would not release security deposit. It was back in my account from them within 10 days. I have been using them for over 10 years. Plus tell it like it is on a review."}, {"username": "Marybeth Hart Janerich", "comment_text": "If you are still looking for a place, you could try Villa La Contessina. It’s a fabulous hidden oasis! It’s a B&B with no access to a kitchen but is very close to a bar for breakfast. I’m so very sorry this happened to you. Onward and upward!"}, {"username": "Deborah Graystone", "comment_text": "What a terrible experience. You must contact Booking.com and report it, it is serious and you would not want anyone to stay there again. Booking.com should refuse to have them on their site anymore, effective immediately. They will be horrified. I have travelled the UK staying in B & B’s, all booked through booking.com and never had a problem. Great stays."}, {"username": "Lupe Cldron", "comment_text": "Looks like kitchen is listed as part of amenities. If only the use of kettle and refrigerator was available, they should have made that clear. The lack of reviews would have concerned me. What a horrible experience. I hope the OP writes a review."}, {"username": "Reese Colmenares", "comment_text": "Sorry for that horrible experience esp with your young child. Please write the review for that place so noone will be rudely treated in the future."}, {"username": "Kayla Luffey Swinney", "comment_text": "Call the customer service number for Booking.com\nThey are very helpful and will get it resolved and refunded!"}, {"username": "Colleen Lee", "comment_text": "Make sure you give them the review they deserve."}, {"username": "Nancy Favila Wong", "comment_text": "I’m sorry you had this happen. I just can’t book B&B’s because of all the horror stories. Everything will work out !"}, {"username": "Isabelle Avl", "comment_text": "Updated post:\nWhen I look at the screenshot posted of the conversation with the host, honestly no one could have concluded that the use of the kitchen was permitted or not.\nThe host barely speaks English so maybe it’s all just a big misunderstandin\ng ? I can’t figure out what he means by « toast and cheese »: is there supposed to be the meal for her toddler?\nAnyway what a nightmare 😞\nI don’t understand how a host of a Bed& Breakfast who is supposed to interact with his guests, doesn’t master a little bit a language that everyone can￼ understand..\nand he should certainly not scream at the guest, whatever the problem may be..\n\nAnyway, don’t throw the baby out with the bath water..\nB&B can be absolutely wonderful and you might end up staying in an amazing place and barely see the host.\nBut there is a big difference between AirBnB and B&B.\nIt is NOT the same.\n\nshe stayed in a Bed and Breakfast, (B&B).\nMeaning the owner of the place lives there and you get the lodging and coffee (Cornetto e Cappuccino).\nIt’s a person who has a spare bedroom in his apartment.\nSo, you basically rent a room in someone’s apartment, where the common-area kitchen is only for the use of the owner who prepares breakfast for you in the morning.\nSo, in that case, the kitchen is always off limits!\n\nIt’s not an AirBnB.\nYou are not alone in the flat !\nRead the conditions and the amenities included !! « Kettle and fridge ».\nBasta!\n\nOf course the man should have explained without screaming.\nBut did we get all the info from both sides??\nAnd Why post anonymously ? Does this person have something to hide ??\n\nBy the way, B&B is used a lot in Europe, and it’s actually great and cheap if you want to discover a region and are open to stay in someone’s house.\nBut most of the time, you will stay in amazing places, that are far more beautiful than if you stayed in a hotel.\n\nBut.. new country, new customs!\nSo get informed, read the descriptions.\nOpen yourself for new discoveries.\nAnd enjoy!"}, {"username": "Leah van Soest", "comment_text": "If you booked via booking .com, they take a lot of responsibility as they are the booking partner.\nLodge a complaint with them as well"}, {"username": "Silvia Vendetutto", "comment_text": "Do a report to the police, B&B and booking"}, {"username": "Steph Craddock", "comment_text": "Go to the police and say you want to do a denuncia against the owner. (A police report) if your are in a rural area then the carabinieri. A d then splatter the name of it all over social media."}, {"username": "Heidi Maria Farrugia", "comment_text": "Marisa Ursini Brancato this person is posting anonymously why ? I mean this behaviour is absolutely unacceptable but please let’s not judge everyone! There’s amazing hosts in Italy! And Europe for that matter"}, {"username": "Aurore Villiers", "comment_text": "You should do a police report"}, {"username": "Maicka Palomares", "comment_text": "Reggie"}, {"username": "Graham Sherlock", "comment_text": "Air BnB's are an absolute lottery, some are run professionally many are not. Hotels are a much safer bet. Imagine leaving your valuables in this guys house when you are out for the day, no way. The spectrum for air bnb's is too great, you can be delighted or down right disgusted."}, {"username": "Ashley Spuhler", "comment_text": "Do you speak Italian? Was it the same person who told you it was okay to use in the first place? Maybe there was something lost in translation when you asked about the kitchen or lack of communication between the workers. Either way tho his behavior is completely unacceptable & make sure to let booking . com know about his hostility."}, {"username": "Sam Mah", "comment_text": "You needto contact the booking dot come people. They are actually really helpful. Let me know if you need the number...."}, {"username": "Diana Morgan", "comment_text": "She says B&B booked through Booking. Com. Surely he should be reported to Booking. Com"}, {"username": "Tijana GH", "comment_text": "Talk to booking and report then there. It will be most likely treated as cancelled reservations and they will be most likely kicked off the platform. Booking might also help you to find another accommodation, as long as this one is seen as cancelled. And also they will reimburse you the difference in price. Good luck!"}, {"username": "Kim OA", "comment_text": "A B&B is just a room if you had a child perhaps it would have been more sensible to book an apartment.\nOr to ask the proprietor of the B&B if they could prepare the food for your child ? After all it is there home and there are many reasons why they would not allow someone into their kitchen IE: hygiene rules as they are preparing breakfast for guests there .\nIt’s also the part of the B&B that is their personal home . You don’t have the right to wander around using the other facilities as you please . It’s a very cheap option because it’s a room that’s it .\nI would never have that expectation when booking a room in a B&B the clue is in the name ."}, {"username": "Evangelia Volka", "comment_text": "you should contact ASAP with \"Booking.com\""}, {"username": "Henriette Langius", "comment_text": "There is a big the difference between a B&B and a Airbnb. Here a B&B is just like it says you get a bed and breakfast. A Airbnb you get the whole house, including kitchen"}, {"username": "Sue Cameron", "comment_text": "I do not like people hiding behind anonymous posts. If you are naming and shaming a business (which will affect their income) at least have the decency to put your name behind it. I wonder if maybe this person took the child into the kitchen (which could be a safety issue), left the kitchen messy, used some of the hosts food/milk etc. hopefully booking.com will get information about both sides of this situation. The host must have been very angry about something if he reacted that strongly. However, if he was threatening in his behaviour, especially with no good reason, he does need to be reported."}, {"username": "Daphne Grace", "comment_text": "You booked through Booking.com - you cld try calling their Customer services to complain and try to get money back. They should know and maybe they will drop advertising that place."}, {"username": "Michelle Smith", "comment_text": "That's disgusting\nNotify air B and B for sure\nThis is not on"}, {"username": "Sarah Salisbury Vander Heide", "comment_text": "Yikes!"}, {"username": "Sally Warren", "comment_text": "It’s unlisted now."}, {"username": "Mary Iuor", "comment_text": "How rude! Report him to whoever is in charge."}, {"username": "Nikki Hannan", "comment_text": "As someone who has been an Airbnb host stories like this make me so cross. I cannot understand how people can call themselves a “host” and behave like this. On behalf of other Airbnb hosts out there I am so sorry your family had to experience this, it’s completely unacceptable behaviour in any circumstances. I would contact Airbnb immediately and tell them how this person behaved, at the very least you should have your money refunded and hopefully this address will not be permitted to be listed again. 😔"}, {"username": "Robin Barbera", "comment_text": "try grand hotel de la villa."}, {"username": "Lina Stump", "comment_text": "Wow 😔 that's awful and traumatic!!! I must say I've never experienced any negative experiences, I am Italian and would be appalled at that"}, {"username": "Lisa Solary Jacoby", "comment_text": "I am sorry this happened! Was this a B&B or Airbnb? Typically in B&Bs, the kitchens are off limits or at least the ones I went to. I think because that is where they make meals for other guests.\nIt could have been handled differently."}, {"username": "Jaime Cleek", "comment_text": "Report him to booking and if he came into your place where you paid to stay, I'd file a report"}, {"username": "Mindy Jo", "comment_text": "I booked with Emily Suites b and b in sorrento. The reviews were fab!"}, {"username": "Evy Fredy", "comment_text": "OMG! Never heard of a similar experience before! I wouldn’t pay him an would report him to Booking.com! Terrible!! This guy should be banned from renting to someone else!! Usually Airbnb have a kitchen included otherwise you’d go to an hotel! So sorry you guys had to have such a bad experience in a beautiful place like Sorrento! I hope you can dispute the charges and report this terrible host!"}, {"username": "Carmel Napolitano-mancarella", "comment_text": "Ohh nooo😞"}, {"username": "Bisy K Stancheva", "comment_text": "You need to contact booking right away\nWe’ve used booking.com for years. And I agree with you don’t book unless there’re enough good reviews."}, {"username": "Cee Esperance", "comment_text": "Susan Levine Solomon she booked it on booking.com not airbnb."}, {"username": "Liz Keating", "comment_text": "We had a similar problem in Paris. the owner demanded we leave immediately. Booking.com stepped in and we stayed the length of our reservation. Booking.com was wonderful!"}, {"username": "Whitney Allbaugh", "comment_text": "Where does it say you can use the kitchen? In the screen shot doesn't mention it either way."}, {"username": "Jackie Richards", "comment_text": "Can you show what the policy and rules state?"}, {"username": "Maxine Cunnyngham", "comment_text": "Yes, stop all charges on your card now. Then you can thread it out later."}, {"username": "Evelyn Everson Akers", "comment_text": "We stayed at a beautiful Airbnb in Santorini. The owner was so wonderful and helpful."}, {"username": "Michele Wilson Joseph", "comment_text": "We have had wonderful experiences booking through AirBnb. But I really do read all reviews!! Sorry that happened to you."}, {"username": "Pam DeGenova", "comment_text": "Definitely contact Booking.com. I have used them several times with no problems"}, {"username": "Tom Cannon-Bailey", "comment_text": "report to Booking.com"}, {"username": "Brian Osman", "comment_text": "This is exactly why I don't use them"}, {"username": "Susan Huff", "comment_text": "A B&B is just that, bed and breakfast. AirBnB is the whole place to yourself as is VRBO.\nRegardless, if you had permission from him to do this, he should never have acted this way. I would contact booking.com over this for sure. If you do not get satisfaction, go to your credit card bank and dispute this.\nWrite a nasty review as well!\nI am so sorry you are going through this on your lovely vacation."}, {"username": "Teresa Vozza", "comment_text": "Definitely report to booking.com so they don’t refer anyone else there. Perhaps they will reimburse you??"}, {"username": "Jenny Payne", "comment_text": "Contact airb&b direct that’s why I use them🌻"}, {"username": "Anthony Seeton", "comment_text": "So sorry to hear about your experience. I looked this property up and it is a bed and breakfast. Regardless though, the behavior of the “host” was inappropriate and clearly threatening. I would dispute the charge immediately on your credit card. Then, go and enjoy the rest of your trip. Don’t let this individual ruin your family vacation.\n\nWhen you get home you should call the owner of the B&B and tell him/her that you also want compensation for the three nights of alternate lodging you had to pay for. I would only do this though if you are 100% sure you are in the right; as in you have clear documentation from the owners permitting you to use the kitchen for the purpose you stated. But again, wait until you get home to do this. Right now, invest your emotional energy in enjoying your time with your family."}, {"username": "Anders Haines", "comment_text": "Email- Booking.com imm. I had a problem with a BnB in Naples. They imm. canceled w the owner. I got a complete [ 1 week]refund. Truly, they will help you out. They even helped me find another place at a reduced rate. I truly wish you the best. [[ Take photos of your husband]] Imm sit down and calmly write out what happened to you and your family. You may need it in the near future. I truly am so sorry you went through this."}, {"username": "Rhonda Hope", "comment_text": "We’ve stayed in many b&b’ booked through booking.com but only with tons of reviews and I google the place on other websites to make sure it’s excellent"}, {"username": "Rhonda Hope", "comment_text": "Reach out to booking.com also leave a bad review"}, {"username": "Linda Kogan", "comment_text": "A bed and breakfast is totally different from an airbnb.\nB&b is a house with rooms for rent vs airbnb is you rent the whole house or guest house.\nVery different\nGuys, her situation has nothing to do with airbnb."}, {"username": "Roxanne Curzi", "comment_text": "Does it say the kitchen is included under property facilities and policies?"}, {"username": "Deb Temple Delf", "comment_text": "Contact booking.com immediately to remedy your situation!"}, {"username": "Shelley Howard", "comment_text": "B&B don't usually inc kitchens ... was it in your booking it was inc ..."}, {"username": "Ann-Louise Dooley", "comment_text": "Have you called Booking.com??"}, {"username": "Roberto VillaLe", "comment_text": "Wow! no matter if It wasn't included this man acted like a real bully, shame."}, {"username": "Carol Mckie", "comment_text": "Contact booking.com and complain"}, {"username": "Marisa Ursini Brancato", "comment_text": "I’ve never used a B&B and stories like these are making me think Hotels are the way to go"}, {"username": "Nancy Brennan Carrow", "comment_text": "Updated post- If you don't get it resolved through B & B, dispute the charge on your credit card when you get your statement."}, {"username": "Annette Gonzalez", "comment_text": "Incredible that experience in a vacation, check the policy for your money back.I don’t like B&B."}, {"username": "Karen O'Reilly", "comment_text": "You poor things thats not good"}]}, {"id": "2195986167467128", "text": "Is a Hour and 15min layover enough for a international flight to Italy? Not checking a bag\nLayover in Atlanta 1 1/2 hours then to Venice. Delta Airlines….Thanks in advance.\n\nEdit: my concern is is an hour and 15 min layover pushing it or do you think I should try to change it for a longer layover?", "link": "facebook.com/groups/1373361046396315/permalink/2195986167467128/", "likes": 6, "comments": [{"username": "Jenn Messina Babore", "comment_text": "I always look for a min of 2 hours as delays can be an issue. It also depends on the number in your party and ages (can they run to the next gate, etc.)."}, {"username": "Loretta Spahmer", "comment_text": "You can check the ontime performance of the first flight. If it has a high percentage then you should be fine."}, {"username": "Stephanie Smith", "comment_text": "Yes as long as the ticket segments are booked together"}, {"username": "Jaime Cleek", "comment_text": "Hope they are in the same terminal. I'd pay to upgrade my seats to be able to get out"}, {"username": "Kari Wojszczyk", "comment_text": "My husband just passed 3 M miles flown—most of those international. For international flights I always give him 3 hr layovers. He never has issues with luggage, customs, or catching his next flight. Atlanta is a huge airport…."}, {"username": "Traci Raymer", "comment_text": "Atlanta is the biggest airport in the US. There is a train between terminals. If you have a choice I would extend it. If it’s in the same terminal shouldn’t be a problem"}, {"username": "Martin Marinov", "comment_text": "Atl typically yes but watch out for them summer time storms that pop up and mess everything up"}, {"username": "Sedalise Hernandez", "comment_text": "We had the same when we traveled in May. We had plenty of time!"}, {"username": "Alexandra A Welker", "comment_text": "It's pretty tight but go to Google and type the flight number for the incoming and outgoing to Italy and click on Flightware .com, it will show flight status, airport delays for that specific flight. And you can check historical info as well."}, {"username": "Gregory Smith", "comment_text": "ATL is a huge airport. I'd take an earlier flight on my outbound and spend a few extra hours to make sure I make my connection. Return I wouldn't worry about it so much. 1:15 is fine if everything goes well but if there is weather in Atlanta you might be in trouble. You don't say which season."}, {"username": "Marissa Marie", "comment_text": "I took this same exact flight 2 weeks ago…missed the connection in Atlanta to Venice."}, {"username": "Sandra Shoffner", "comment_text": "Not from Atlanta"}, {"username": "D'Anna Hohe", "comment_text": "You should be able to search the flights and see what gates they go into/out of in Atlanta. If it is the same terminal, you might be fine. Depending upon time of year, weather delays out of Tampa might also be a problem.\nAn hour and a half can be tight unless you are going through a smaller airport."}, {"username": "Fannie Liu", "comment_text": "If there’s an option for a longer layover I would recommend it for an International flight. I’m not sure when you’re going but have to consider factors like weather delays, ATC and Pilot shortage, busy ATL airport, etc. There generally aren’t that many flights where it’s easy to rebook for immediate departure like a domestic flight. Not to mention the stress associated. A little extra buffer is safer."}, {"username": "Valerie Collanton", "comment_text": "I don’t think it’s enough time. 2 hours minimum. Atlanta is a big airport. You need to take the sky train between terminals. Unlikely the flight to Venice will be in the same terminal you come in. When I took that flight last October they also kept changing the terminal."}, {"username": "Patty Ham", "comment_text": "You should be fine through Atlanta unless thunderstorms delay and cancel flights-then all bets are off. If you feel more comfortable with a longer layover than go for it."}, {"username": "Donna Gail Devall", "comment_text": "I’m catching this flight in august"}, {"username": "Alla Zats", "comment_text": "Very short layover is always pushing it but especially during peak travel season."}, {"username": "Gayla Regitz Jones", "comment_text": "We flew through Atlanta (rdu-atl-fco) with a 1:20’min and no issues at all- with the shuttle it’s fine. Now Boston or Philly I’d worry"}, {"username": "Holly Ng", "comment_text": "Definitely extend it. No need for the added stress of rushing and dashing through the airport. We had a similar situation this summer and I told my husband to get a longer layover."}, {"username": "Carly Mathes", "comment_text": "A few years ago I had a domestic layover (Newark to Tallahassee via Atlanta) and had a 2.5 hour layover in Atlanta. My incoming flight from EWR was delayed an hour then I had to change terminals in Atlanta to catch my flight to Tallahassee. ATL is HUGE and I had to legit sprint across terminals with a suitcase. Needless to say, I missed my flight to Tallahassee. In this instance, it was fine and I took the next flight out. International flights are different as there are much fewer, if any, options the same day if you miss the connection. I’d give yourself more time to be safe. The worst that can happen is you’re on time and have to hang out in the airport for an extra hour."}, {"username": "Janie Osborn Wiltshire", "comment_text": "International flights go out of concourse E or F.\n\nLook at flight history and see if your connecting flight has a history of on time arrivals.\n\nI would also check for options should you or your bag 💼 miss the Italy flight.\n\nBest wishes…always have a plan B. The airline does not care as much as you do‼️"}, {"username": "Miyuki Kanno Paul", "comment_text": "Only if there is no delay. ATL is a huge airport, by the way. What month of the year are you going?"}, {"username": "Rhonda Hope", "comment_text": "Lately no at least 3 hours minimum"}, {"username": "Rhona OConnor", "comment_text": "Book a through ticket with a travel agent, that way if you miss a connection they will put you on another flight. If you book separate legs yourself you must buy the new ticket."}, {"username": "Vasthi Cheddar", "comment_text": "ATL? Sounds tight... a slight delay and it's not enough time"}, {"username": "Loretta Walsh Bucci", "comment_text": "Anywhere but Atlanta …."}]}, {"id": "2196060934126318", "text": "What snacks are allowed on overseas travel on flights\nGoing from Australia to Europe", "link": "facebook.com/groups/1373361046396315/permalink/2196060934126318/", "likes": 12, "comments": [{"username": "Delly Tracy", "comment_text": "Yes but yoy cabt take fresh food like a salad or carrots through security or customs . Eat them all or hust take a few to get you there"}, {"username": "Andrea Laurie-Cruz", "comment_text": "Ex Cabin Crew here - You can take anything as long as you throw it away before you get to your overseas destination AND/OR it does not exceed liquid contents of 100ML at departure security points (unsure if this has been lifted in the US? I’m not US based).\nI skip inflight meals at all costs."}, {"username": "Jenny Payne", "comment_text": "I always take cheese & biscuits as I don’t eat on flights even international flights, I eat before I leave home , it suits me 🌻"}, {"username": "Anthony Sperduti", "comment_text": "All of them"}, {"username": "Sal Facciponti", "comment_text": "Anything"}, {"username": "Ildiko Gyimesi Mikos", "comment_text": "“Allowed”??????\n?? Whatever you want! Bon appetite. No liquids from outside TSA security checkpoints. No alcohol."}, {"username": "Vero N Ferny", "comment_text": "We took nut mix, pretzels, chips pretty much anything you like…"}, {"username": "Georgina Mcauliffe", "comment_text": "Make sure you empty your stash properly before you get off the plane if it's fruit and veg. I once forgot an apple and got a nightmare reception from customs in NZ requiring a huge amount of grovelling to avoid a fine."}, {"username": "Rhona OConnor", "comment_text": "Just don't bring smelly food like egg sandwich 🥪"}, {"username": "Sandra Shoffner", "comment_text": "Look on your airlines website to get correct information."}, {"username": "Jan McMahon", "comment_text": "I try to be aware of potential allergies and sensitivities of fellow passengers, no peanuts, nothing with onions, eggs, tuna"}, {"username": "TrishRandy Toll", "comment_text": "I take what I want to eat while on the plane and then dispose of what doesn't get eaten before arrival. That way there is nothing going into the arrival country that may not be allowed and I can get through that process easier. I have been stopped in different countries for different foods so just find it easier to leave behind what I don't eat. So only take what you can eat while in the air."}, {"username": "Debbie Lee", "comment_text": "I once took some fruit from UK to USA. Ate it all before we landed. However when we arrived at security the sniffer dog showed a keen interest in my bag. Needless to say I was searched. As we moved further down the queue the dog came to me again 😱 I went in to panic mode and was expecting to be carted off for a strip search 🙀 anyway the lady with the dog remembered searching me further back in the queue so was happy to let me go 🙏🤣"}, {"username": "Rebecca Branta", "comment_text": "All of them."}, {"username": "Jaime Cleek", "comment_text": "These types of questions would be fantastic if you included your country. Not everyone in this group is from the US and overseas doesn't necessarily mean US. I think each country is different what they allow."}, {"username": "Lois Richardson", "comment_text": "Any."}, {"username": "Rachel Owens", "comment_text": "I take cup of noodles and request hot water for them"}, {"username": "Eric Parks", "comment_text": "I wouldn't suggest bringing durian or anything else that would curl the nose hairs of the people next to you."}, {"username": "Allan Olexa", "comment_text": "Just be kind to your fellow passengers as far as a food with a strong aroma."}, {"username": "Jules Earl-Rossiter", "comment_text": "Your allowed every thing.... the only thing you can't take in a carry on is liquid's unless they are in 100 ml contains in a ziplock see through bag...🙃"}, {"username": "Maria Angela Perrone", "comment_text": "Just for fun! Once I was flying from Milano to SFO. When I landed, they made me open all my bags until they found it! It was a ham and cheese sandwich that my mother had put in one of my bags, 'just in case I got hungry' lol.\nI didn't know about it.\nI told security it was turkey, because the Italian cooked ham is very light in color.\nThey let me keep it."}, {"username": "Kate Farrell", "comment_text": "Or Tuna……"}, {"username": "Dave Conroy", "comment_text": "TBH I find it a bit gross that someone would bring stuff on board and sit next to me scoffing that **** and stinking and masticating their crisps, cakes, sandwiches all over. Why?"}, {"username": "James Maxwell", "comment_text": "Anything that doesn’t explode."}, {"username": "Andrea Shelton", "comment_text": "Please, no Tuna and Onion sandwiches."}, {"username": "Melissa Smith", "comment_text": "Tinned tuna should go down a treat haha"}, {"username": "Frances McDonagh", "comment_text": "Anything bar durian, eggs, fish. You can take any size past security I like my water, taytos and chicken, stuffing symbols as Ryanair too dear on short haul"}, {"username": "Monica Vazdauteanu", "comment_text": "Why this new trend of posting as anonymous? Must be the questions you guys ask"}, {"username": "Dianne West", "comment_text": "I never eat airline food and always take my own. Nothing stinky, but protein bars, cheese and biscuits etc."}]}, {"id": "2196492917416453", "text": "Hello group I’m planning a visit in august have never been before and would really like to try and make the most of the trip, we’re staying in Desenzano can’t remember the hotel name, park hotel maybe? We like sightseeing, fine dining , would like a boat trip , also we are a bit stuck on getting from bergamo airport to the hotel not sure weather to get shuttle transfer or a hire car , any help would be much appreciated thanks in advance", "link": "facebook.com/groups/1373361046396315/permalink/2196492917416453/", "likes": 0, "comments": [{"username": "Alice Francesca", "comment_text": "Did you check buses or trains? There are many trains getting to Desenzano and I am sure there is a bus from Orio al Serio to Bergamo or Brescia to go to the train station.While on lake Garda absolutely use the ferries to go discover: Riva del Garda, Malcesine, Isola del Garda, Limone del Garda ecc."}, {"username": "Alice Francesca", "comment_text": "Ps in August it will be overcrowded everywhere you go.."}]}, {"id": "2196494234082988", "text": "Hi I read a great post of a lady touring with partner and kids who loved playing football.I can’t find post but she gave great detailed account of all towns and cities visited.She mentioned a fabulous leather shop and that Rome was too hot and 5 days there too much with kids.\nCan some please tell me her name? she is now heading elsewhere in Europe for ?4 weeks but happy to respond to any questions.\nI want to read her great post again and I’m not having any luck finding it again!\nThanks,Lee.", "link": "facebook.com/groups/1373361046396315/permalink/2196494234082988/", "likes": 2, "comments": [{"username": "Robyn Gerena", "comment_text": "If you use the group's search bar for \"sons football\", the post will come up. I tried to link it but it might be against the rules?"}]}, {"id": "2196499977415747", "text": "Hey y’all, we’re going to Italy for two weeks in the end of September. We will be staying in Positano for one week and Sorrento for another week. Any recommendations on local restaurants, attractions, cooking classes? We have booked two boat tour. Tried to get a reservation at Le Sirenuse and La tagliata’s cooking class but they’re all fully booked! 😭\n\nThank youuu", "link": "facebook.com/groups/1373361046396315/permalink/2196499977415747/", "likes": 3, "comments": [{"username": "Starla Dawn", "comment_text": "My daughter and I had the best time on this."}, {"username": "Starla Dawn", "comment_text": "https://\nwww.tripadvisor.\nca/\nAttractionProduc\ntReview-g187782\n-d15884936-Capr\ni_Blue_Grotto_B\noat_Tour_From_S\norrento-Sorrent\no_Province_of_N\naples_Campania.\nhtml"}, {"username": "Andrea Gattini Pennington", "comment_text": "Positano Home Cooking and Wine Tasting was amazing. Did a boat tour down the Amalfi Coast, much easier than taking a bus and was beautiful, Next2 was my favorite restaurant of the ones we went to although all the food was good. We stayed on Capri for 4 days after Positano and boat tour there was beautiful as well along with the blue grotto."}, {"username": "LeAnn Bonkiewicz", "comment_text": "F"}, {"username": "Alice Francesca", "comment_text": "Try and see Capri too at least, along with Ravello..."}, {"username": "Kay Rendall", "comment_text": "In Sorento. Da Gigino in the old town. Family owned. Few tables outside for people watching which I always book. Inside and upstairs many large tables locals. Can be noisy. Best lunch/dinner in Sorrento. The Foreigners Club on the cliff just behind old town. Great views. Havent eaten there, but believe food is good.\nIn Positano Sacrenco de Or, family owned. Good prices, friendly. Sit outside."}, {"username": "Michelle Solak", "comment_text": "Do dinner at La Tagliata if you can! We did that for our last night in Positano and absolutely loved it - amazing experience!\nLa Sirenuse has a bar called Franco’s Bar which doesn’t take reservations - if you go I would get there at least 10 min before opening so you can get in and get a seat! Also enjoyed the cocktail bar at Hotel Poseidon for amazing views - I was able to make a reservation online exactly 2 weeks out (literally on the hour when it turned midnight Italy time - otherwise you can’t make a res)\nHappy planning and have an amazing time!"}]}, {"id": "2196517050747373", "text": "I would like a recommendation for a hotel with pool in Sorrento that also is accessible to get to other towns . Also that will offer a pick up from FCO in Rome . 3 people. Traveling light.\n\nThank you so much for any help.", "link": "facebook.com/groups/1373361046396315/permalink/2196517050747373/", "likes": 2, "comments": [{"username": "Giuseppe Placi", "comment_text": "All the hotels can arrange a transfer from Rome.\nThey can book for you. But usually it is cheaper to book directly with a car company to bypass the hotel commission\nHotels with pool\nConca Park\nHilton\nPlaza\nHotel Regina\nHotel Miramare"}, {"username": "Melissa Ciske", "comment_text": "Hotel Villa Maria has a pool! We loved it there"}, {"username": "Gail Bielskis", "comment_text": "You can take trains from Rome Airport to Sorrento\nchange in Naples\nThere is an express train from Naples to Sorrento or there is a bus from train station in Naples that is nice\nluggage stored underneath/15 eu pp\nStayed at Hotel Continental in Sorrento\nloved it"}, {"username": "Rita Bates", "comment_text": "Hotel Plaza is central\nhas a pool with great views of the Bay of Naples& Mt Vesuvius too."}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.kqzyfj.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g656615-d6302\n01-Reviews-Hilt\non_Garden_Inn_R\nome_Airport-Fiu\nmicino_Province\n_of_Rome_Lazio.\nhtml"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.anrdoezrs.ne\nt/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187782-d2762\n02-Reviews-Gran\nd_Hotel_Capodim\nonte-Sorrento_P\nrovince_of_Napl\nes_Campania.htm\nl"}]}, {"id": "2196525074079904", "text": "Planning a month trip to Italy and have not booked any train tickets. Looked today at the prices and they seemed to go up. Was hoping to get tickets for cheaper (less then $200 Canadian) for two people. Is it worth it to book train tickets now or wait until we’re in Italy to book ? Will they go up in price if we wait?", "link": "facebook.com/groups/1373361046396315/permalink/2196525074079904/", "likes": 3, "comments": [{"username": "Joe-Linda Po Agustin", "comment_text": "Depends- if it’s the fast trains then prices go up, but regional trains stay the same."}, {"username": "Lindsay Storry", "comment_text": "If you know you preferred travel days and times, book now. Prices go up as the train fills up. If you want flexibility then wait until closer to the date. The price will likely be higher but there should still be room (there was space on both of the high speed trains we took this month)"}, {"username": "Lauren-Jade Roberts", "comment_text": "Ítalo seem to have regular offers on weekend if your happy to book the non-changeable ones"}, {"username": "Tracy Foss", "comment_text": "I booked business class it's worth it & was only $225 Rome -Florence , Florence - Venice for 2"}, {"username": "Victoria Laverty", "comment_text": "Gets more expensive to wait"}]}, {"id": "2196530770746001", "text": "Hi everyone, I am planning a trip to Italy 25 October to 7th November this year.\n\nWe plan to visit Lake Como first for around 3 nights. Where is best for us to base ourselves during the stay please?\n\nWe are then going to travel south, most likely visiting Sorrento & Positano then either Sicily or Puglia.\n\nWe've never been to Italy before, are there places we should add to our list to visit?\n\nThankyou!", "link": "facebook.com/groups/1373361046396315/permalink/2196530770746001/", "likes": 3, "comments": [{"username": "Cecilia Lewis", "comment_text": "Following"}, {"username": "Wade Evans", "comment_text": "I would not stay in como But on the Switzerland side to the north Lugano"}, {"username": "Glenn Todd Webb", "comment_text": "Bellagio or Tremezzo. Or Stressa on lake Maggiore"}, {"username": "Alice Francesca", "comment_text": "How are you going to go from Lake Como to Sorrento? I highly recommend a flight from Milan to Naples or a train from Milan to Naples.Driving would be too much.\nIf you have never been to Italy you should take into consideration visiting at least one city : Venice, Rome , Florence, Naples (not my favorite)"}, {"username": "Dianne West", "comment_text": "Forget Como and go to Lake Maggiore much more of a \"local\" experience."}, {"username": "Kirsty Manning", "comment_text": "Stayed in Bellagio. Loved it. Only downside is that it’s on a hill and in the heat we got plenty of exercise!! Worth it though. Nice to wander it and be staying close by. Did day trips by ferry to Varenna. Como itself was too busy and overwhelming for us really."}, {"username": "Kay Rendall", "comment_text": "Amalfi Coast pretty much closes down end October. The tourist season is over. B&bs close, restaurants close, ferries stop running because rough seas I believe very few buses run except school buses.\nEveryone rests as they have worked 7 days a week probably from 7am or earlier, to 1 am, sometimes later, plus travelling time.\nSo then the locals rest, hibernate, perhaps visit family in one cities. About April start sprucing everything up, getting ready for the season again\nWhere as the big cities in Italy keep ticking over, looking after them locals and maybe some tourists Hope this helps Have been in Positano about 25/10 and a lot restaurants in the evening. Perhaps only 1 to choose from. Can be cold, lots rain, strong winds. Hope this helps."}, {"username": "Lisa Valdovinos", "comment_text": "Capri is fun"}, {"username": "Tonsia Keytel", "comment_text": "Stay in Bellagio but in the town center close to the ferries, several nice hotels to choose from right there. Taxi service is almost no existent there, at least in May it wasn’t."}, {"username": "Phyllis Snyder", "comment_text": "Please ASP purchase Rick Steve’s Italy guide book is beyond amazing and will provide all the information you’re looking for & need. And is your trip this October 2023? If so you need to start booking accommodations ASP- I’m going next fall and have already booked my stays- and there were accommodations already booked when I was looking."}, {"username": "Jenny Payne", "comment_text": "I’m staying in Bellagio, as I meet a young girl on a train in Italy who comes from lecco , she said this was a good place to stay . I don’t think you have enough time to get to Sicily with the time you have in Italy . Have a look at a map it’s a long way, I have been by train from Rome and also have gone by airplane 🌻"}, {"username": "Renae Larcus", "comment_text": "At Lake Como stay in Varenna. Easy to get to and easy to ferry around the lake to other towns"}, {"username": "John Sampson", "comment_text": "Hi.ive had some great holidays in basilicata,.Nex\nt region to puglia.. lovely little mountain village. Great food etc.about an hour from mateta..where they filmed passion of christ.very ancient ,very greek.\nI love it"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2196535960745482", "text": "Good morning, My hubby and I will be spending about three weeks in Italy….￼approaching quickly. Sadly I haven’t booked any of our accommodations. We start in Rome and we plan on spending five nights there. Suggestions on what areas we should stay in, it’s our first time. TIA", "link": "facebook.com/groups/1373361046396315/permalink/2196535960745482/", "likes": 8, "comments": [{"username": "Bennett Richards", "comment_text": "Hotel Grand Palatino Rome. Perfect location and fantastic breakfast 3 blocks from the Colosseum and Forum. Staff wonderful… really great 7 day stay."}, {"username": "Donna Gilardone Szwabowski", "comment_text": "Pantheon Inn, Hotel Nazionale"}, {"username": "Jenny Payne", "comment_text": "I suggest you book soon as it is always busy especially since Covid up to October as the weather is still nice 🌻"}, {"username": "Laura Uribe", "comment_text": "If you can’t find something in your budget in Rome, try Frascati. You can take the train there. You have left it incredibly late to book someplace."}, {"username": "Charleen Siegler Schuss", "comment_text": "Love Hotel Damaso near Campo de Fiori, Piazza Navona."}, {"username": "Marina Belardo Johnson", "comment_text": "If you want to save big … stay outside rome. I stay in Formia on the beach 🏝️ and travel to rome to see what you like by train. Rome is very hot now … 😫"}, {"username": "Charlotte Nepstad", "comment_text": "Either the closest you can get to the pantheon, or trastevere for a more streetfeel"}, {"username": "Andrew Mircovich", "comment_text": "Hotel Lancelot is a great hotel that is very reasonably priced . It’s in a lively Cielo residential neighborhood a 10 minute walk to the Colosseum . Loved it"}, {"username": "Gary W Anderson", "comment_text": "Popular base cities are Venice, Florence for access to Tuscany, history, museums and romance then of course Rome and south I like Sorrento for access to Amalfi Coast.\nMake your reservations ASAP for skip the line and access to the most popular sites. Copy your passports, important papers and cards just in case of lose. Travel safe, eat well and enjoy gelato."}, {"username": "Starla Dawn", "comment_text": "Hotel Barocco rooftop sauna and spa suite"}, {"username": "Nicky Heath", "comment_text": "Trastevere or Monti"}, {"username": "Kyle Hamilton", "comment_text": "Wherever you can get this late."}, {"username": "Alice Francesca", "comment_text": "Monti or Trastevere good areas ."}, {"username": "Steve Wolfrom", "comment_text": "Look up accommodations in former monasteries"}, {"username": "Danielle Evans", "comment_text": "We are currently here, staying at Villa del Fonte in the Trastevere area. Could not recommend staying at this hotel and in the Trastevere area more!!"}, {"username": "Kristi N Doug Leonard", "comment_text": "We stayed in this fantastic Airbnb in March. It’s right in the middle of everything in Trastevere. We mostly walked to the coliseum, St Peter’s Basilica, Trevi Fountain in the daytime. Then headed back to our “home” to be close to bars & restaurants. Hope you find the best place for you!"}, {"username": "Jayne Dawson Meyer", "comment_text": "La Fontana, your view is the Trevi fountain. Super beautiful & close to everything in city center"}, {"username": "Nicki Trueman", "comment_text": "We stayed at Quest House Lihong near Vittoria Emmanuel and Manzoni metro. You can find them on booking.com\nWas a 20 min walk to colesseum or of course you can metro.\nWe payed approx 375 euro for three nights.\nIt’s a basic room but it does the trick for two people. Owners are lovely."}, {"username": "Monique Swanner", "comment_text": "We stayed at \"just chilling suites\" about 10-16 minute walk from all the major tourist spots"}, {"username": "Phillip Farquhar", "comment_text": "We stay in FH 55 grand palatino 5 minutes from the colosseum and great restaurants"}, {"username": "Virgz Van Møøre", "comment_text": "Stay central, as said many times in many posts : Trevi/Pantheon/\nNavona"}, {"username": "Dayna Steinberg Cioffi", "comment_text": "We loved being near the Spanish Steps. Hotel d’Inglittera was amazing (5 star, ask for a renovated room)"}, {"username": "Robyn Lawson", "comment_text": "Domus Ciliota in Venice💙"}, {"username": "Jane Eichhorn", "comment_text": "Jane Eichhorn"}, {"username": "Jill Ian", "comment_text": "We just stayed at Hotel Romano it’s very close to colosseum and we walked every where in the heat! It’s only 2 stars but I can’t rate it enough!"}, {"username": "Taylor Ellzey Babcock", "comment_text": "We are here now in a hotel near the Spanish Steps and love the location."}, {"username": "K M Uí Fhionnaláin", "comment_text": "I would recommend Trastevere."}, {"username": "Debbie Lyons", "comment_text": "Trastevere wonderful area"}, {"username": "Jackie Field", "comment_text": "Air bnb in Rome"}, {"username": "Marianne Brown-Lowe", "comment_text": "Ask Marie!"}]}, {"id": "2196552314077180", "text": "Hi, looking to plan a trip to Sorrento next May/June and see Capri/Amalfi/Ravello/Pompeii and all the sights, but when I start looking into flights and hotels, it all seems so expensive and I get overwhelmed!\n\nFlying from London, can anyone recommend a nice hotel in Sorrento that isn’t extortionate and the best ways to visit the various towns along the coast and Capri?", "link": "facebook.com/groups/1373361046396315/permalink/2196552314077180/", "likes": 2, "comments": [{"username": "Gail Bielskis", "comment_text": "I stayed at Hotel Continental & loved it/but may be more than you want to pay\nUse Booking.com App\nwill give you lots of choices with different prices & availability"}]}, {"id": "2196553027410442", "text": "Loving this group…thanks to all for tips and recommendations! Quick question, how easy is it to get ferry out of Venice for a 6:30am flight? Is it better to stay on mainland the night before and if so, recommendations on best area?", "link": "facebook.com/groups/1373361046396315/permalink/2196553027410442/", "likes": 0, "comments": [{"username": "Carole Tarlap", "comment_text": "I'd stay the night before close to the airport 🤷 IMO"}]}, {"id": "2196559647409780", "text": "Any information about travelling to Italy in January? How cold is it? Lol", "link": "facebook.com/groups/1373361046396315/permalink/2196559647409780/", "likes": 4, "comments": [{"username": "Gail Linville Ellis Fuhrman", "comment_text": "I went in February 2023 and it wasn’t that cold, we just wore light jackets, less crowded, it was fantastic"}, {"username": "Yolanda Arena", "comment_text": "Depends where you’re going, in the south is quite comfortable, just need a light jacket, however in the North you may need a coat or ski jacket."}, {"username": "Angela Macias", "comment_text": "Depends where you go. They have world class ⛷️ skiing"}, {"username": "Lynn Francisco Casella", "comment_text": "Just like CA wet winters dry hot summers"}, {"username": "Alice Francesca", "comment_text": "Italy stretches from North to South and have very different climatizzatore from the Alps to Sicily! North: winter jacket, gloves, hat etc (temperatures around 0 C), from Rome going south much better( around 12 to 18 C)"}, {"username": "Frank Hunt", "comment_text": "What do you call cold, people have a different perspective."}, {"username": "Justin Henderson", "comment_text": "I am thinking of a trip in January as well. Is everything open? How is Amalfi in January?"}, {"username": "Wilki KJ", "comment_text": "Depends...the North is cold the further south you go the warmer it is."}, {"username": "Kristina Ruk", "comment_text": "It depends which part.. were in Rome once in the beginning of January was +15 C, not so cold but also not warm..once we were skiing in Dolomites there was a snow storm, so cant predict for sure"}, {"username": "Monica Sucato", "comment_text": "It depends on where you go AND....every year Is different with this climate change...but yes, It can be very cold"}, {"username": "Abe Michelson", "comment_text": "Obviously if you go to Southern Italy & Sicily it will be down right pleasant."}, {"username": "Simone Pfenninger", "comment_text": "Freezing cold for me, ok not below 0°, but really cold"}, {"username": "Krissy DaRusso", "comment_text": "Venice low season is January 1st-January 31st! 😂"}]}, {"id": "2196556720743406", "text": "Has anyone taken the Venice train into Ravenna to leave on a cruise the morning of? Any problems? Any advice would be helpful, thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2196556720743406/", "likes": 1, "comments": [{"username": "Amy Dreise", "comment_text": "We did and had no issues."}, {"username": "Tracy Jenkins Winetroub", "comment_text": "That's what we are doing in September!"}]}, {"id": "2196581884074223", "text": "Heading to Rome in November,we are looking for a small town on the outskirts to stay for 3 nights,we are considering frascati.any information on frascati or any other suggestions would be appreciated.", "link": "facebook.com/groups/1373361046396315/permalink/2196581884074223/", "likes": 1, "comments": [{"username": "Alice Francesca", "comment_text": "Is this your first time in Rome? If so, stay in Rome."}, {"username": "Simone Pfenninger", "comment_text": "Pitigliano, Orvieto"}]}, {"id": "2196637230735355", "text": "Hey, how do people transfer from Milan Bergamo Airport to the centre?\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2196637230735355/", "likes": 0, "comments": [{"username": "Colleen Dawson", "comment_text": "Rome2rio app will give you all the information you need, mode, cost and time."}, {"username": "Ruth Akutu Maccarthy", "comment_text": "There's a direct and cheap bus outside the airport. Very easy. The bus goes straight to the train station which is in the center."}, {"username": "Tal Burdejny", "comment_text": "Bus/uber\nCheck out google maps. Will give you all the options"}, {"username": "Alejandro Gabriel Valenzuela Anghileri", "comment_text": "Bus, you can get them at the airport. Don't remember how much it costs"}, {"username": "Thuy Tdt", "comment_text": "They’re plenty of busses\nIt’s about 10€ and takes an hour to get to the central station in Milan"}, {"username": "Angie Gloria Razza", "comment_text": "Hi! Centre of Bergamo or centre of Milan? They are both worth seeing"}, {"username": "Janice Vaznonis", "comment_text": "I did the train both ways, easier than I anticipated"}, {"username": "Wilki KJ", "comment_text": "Bus outside terminal is easiest and cheapest. An uber is about €100 + or - a few"}, {"username": "Karen Blackmore", "comment_text": "The Orio shuttle bus goes from Bergamo airport to the central station in Milan. €10 I think. Depending on where you are staying, the train to say Milan Garibaldi may be easier."}]}, {"id": "2196637480735330", "text": "can't get enough of this view", "link": "facebook.com/groups/1373361046396315/permalink/2196637480735330/", "likes": 18, "comments": [{"username": "Dianne Giordano", "comment_text": "Dianne Giordano"}]}, {"id": "2196641427401602", "text": "Curious to know if you HAVE to see the colliseum on a tour, or can you just go in and wander around by yourself? I only have limited free time when I go, and I'd really rather just pop in and look around and leave when I'm done, on my own time.", "link": "facebook.com/groups/1373361046396315/permalink/2196641427401602/", "likes": 20, "comments": [{"username": "Phyllis Snyder", "comment_text": "Actually seeing these fabulous buildings from outside is rewarding in itself. If you have limited time enjoy walking the awesome streets- grab a gelato. And there’s lots of open freebies that are worth checking out."}, {"username": "Angie Stockman Nelson", "comment_text": "Here’s the link to the site for tickets. https://\nwww.coopculture.\nit/en/products/\nticket-colosseum\n-roman-forum-pa\nlatine_24h/\n\nNo tour needed."}, {"username": "Mary Anne", "comment_text": "We didn’t do a tour, but did hire a head set once inside. We found the head set not to be user friendly at all so gave up and just wandered, eavesdropping on the occasional tour. We got the essence of it all without feeling like we were being herded around."}, {"username": "Lina Stump", "comment_text": "You cam just go in on your own after you buy a ticket"}, {"username": "Julia Salmon", "comment_text": "We didn’t buy tickets ahead of time and wish we did. We got there by 9am. There was a line about 3 hours long just to wait and get a ticket for a time later that day. So we’d have to come back anyway. We ended up getting a tour from one of the people right outside of it so that we wouldn’t have to wait."}, {"username": "Stacy Freeman", "comment_text": "The Rick Steves app has audio tours you can download, including one for the Colosseum."}, {"username": "Phyllis Snyder", "comment_text": "Rick Steve’s says if you don’t have tickets then try going around/ just before closing and you might get lucky because less people there- but you will have to make your visit shorter."}, {"username": "Wendy Harrison", "comment_text": "Yes, of course you can. You still need to buy tickets in advance Ilas I recall. Don't forget the Forum. And we loved wandering the Palatine Hill."}, {"username": "Maya Maximova", "comment_text": "We bought a skip the line ticket that was not a tour but just got us in quicker. Then explored on our own. Totally doable. I feel it slows you down a lot going with a large tour group and especially in the current heat I want to move at my own speed."}, {"username": "Jayne Dawson Meyer", "comment_text": "Sure, but the wait is loooong."}, {"username": "Barbara Bastianini", "comment_text": "I ‘ve never taken a guided tour of the Colosseum but have always just bought an admission ticket to move at my own pace.\n\nUnfortunately, though, the days of just popping in are in the past. Even without a tour the only way to be guarsnteed of getting in is to purchase an admission ticket in advance. Something like 16 thousand people visit the colosseum each and every day so entering takes a little bit of planning.\n\nYou might want to look at the official see site to see what’s available on your dates."}, {"username": "Gillian Bissex", "comment_text": "We spent 2 days in Rome and did not buy a ticket for anything. There is so much to see and plenty of atmosphere to soak up by just walking around."}, {"username": "DeAnna Pulliam Like", "comment_text": "We did not do a tour, just tickets. We explored on our own trying to avoid the large tour groups. We downloaded Rick Steve's audio tour and listened to that with our own earbuds. It worked out very well!"}, {"username": "Lauren-Jade Roberts", "comment_text": "We got the audio guide for €6 - which you can do in about 40 mins - but you can also just get entry tickets and no audio guide. We got them from official website by buying a roma pass - more time slots"}, {"username": "Sarahjane Zuniga", "comment_text": "Highly recommend the golf cart tour if you have limited time."}, {"username": "Ellen Edmonds-Wilson", "comment_text": "You should buy your ticket in advance so you cut out one queue and only have to do the security queue. Just turning up to anywhere now for tickets that’s a major site means lots of waiting - and in Rome it is in the sun."}, {"username": "Ellen Edmonds-Wilson", "comment_text": "We did a Show Me Italy tour with a fab guide called Fi. It was excellent. How else would you know the exact place Caligula was assisinate and other inside info you don’t get by wandering around the three sites? Money well spent for a 2-3 hour tour."}, {"username": "Lyn Wise", "comment_text": "We didn't do a tour. In fact the only tour we did was at the Vatican"}, {"username": "Virgz Van Møøre", "comment_text": "Depends on how much you are interested in its history...."}, {"username": "Keri Catoe", "comment_text": "Wander and download Rick Steves free audio tour. He’s great!"}, {"username": "Lisa Valdovinos", "comment_text": "We had tickets in advance and we were able to skip the line. It was a guided tour that was very informative. We are usually not tour people but this was very good. The whole thing was less than two hours."}, {"username": "Harris Dee", "comment_text": "Book a tour … skip a line, stay longer and linger after the tour"}, {"username": "Petriela Bacheva", "comment_text": "I did a 2h tour yesterday and it was absolutely worth it to understand the whole history behind all the stones. And we skipped the lines"}, {"username": "Laura Schellberg Conroy", "comment_text": "Book a skip the line self guided tour. It will give you a timed entry but then you are on your own."}, {"username": "Kit Nader", "comment_text": "You can go in yourself but you MUST get a skip the line ticket in advance or you day will be spent queuing to get in"}, {"username": "Faryal Abbas", "comment_text": "I’m a little confused about the colosseum. There is an underground tour and an arena tour and then Roman forum, palatine hill how can we get tickets for everything together? My husband and I like to move on our pace too and never buy tour guides tickets.\nI looked into coop culture but tickets are not available to buy. What’s colosseum official website?"}, {"username": "Darryl Vanstone", "comment_text": "We did a self guided skip the line tour. It was great. Could tour at your own pace and not have to wait in line to get in"}, {"username": "Dana Green", "comment_text": "There’s no way in heck I’d do a 2-3 hour Coliseum tour in the Roman heat. We walked around the Coliseum at night for about 30 mins and it was perfect."}, {"username": "Angela Johnson", "comment_text": "We had a change in plans that opened up a few hours for us and I was able to book a tour on Viator two hours prior."}, {"username": "Katie Conlon Horan", "comment_text": "So, the only time we have in Rome to see Colosseum etc prior to a cruise is Sunday 8/6. I’ve heard the first Sunday is open entry to museums, etc. What does that mean to us/even try to go at all, family of 5?! ￼It looks like that’s the one day the whole month of August I can’t pre-book anything on viatour or other sites. We are seeing the Vatican on a tour on Saturday the fifth at least."}, {"username": "Linda Chase", "comment_text": "We went on our own - no tour, but did research ahead of time"}, {"username": "Garry Burrows", "comment_text": "Be prepared to wait in line. I would assume if you go on an organised tour your would skip the wait"}, {"username": "Brandy Hines", "comment_text": "There are skip the line tickets and then you just go on your own. I did them 4 years ago but I don’t remember where I purchased them from"}, {"username": "Ann-Louise Dooley", "comment_text": "Great question...I am thinking the same."}, {"username": "Jaime Cleek", "comment_text": "You have to buy a ticket"}, {"username": "Brian McGraw", "comment_text": "https://\nwww.tiqets.com/\nen/checkout/\ntickets-for-colo\nsseum-roman-for\num-palatine-hil\nl-arena-p975451\n/\nbooking_details/\n?partner=romeinf\no\n\nNo you don’t have to take a tour. Just buy a ticket online."}]}, {"id": "2196644010734677", "text": "Could you tell me reliable taxi number for within Rome, please?", "link": "facebook.com/groups/1373361046396315/permalink/2196644010734677/", "likes": 0, "comments": [{"username": "Ann-Louise Dooley", "comment_text": "Yes....great question!!\nNo responses yet! Does that mean there aren't any!!!??"}, {"username": "Cindi Lachney", "comment_text": "Use Free Now app it’s outstanding to get a taxi you can even order one ahead of time"}, {"username": "Gail Bielskis", "comment_text": "Uber app uses regular taxis"}]}, {"id": "2196646637401081", "text": "Walking through Rome is like walking through time itself.", "link": "facebook.com/groups/1373361046396315/permalink/2196646637401081/", "likes": 208, "comments": [{"username": "Martine Huguet-Latour", "comment_text": "It is sooooo true !"}, {"username": "Judy Charon", "comment_text": "Looking forward to it!"}, {"username": "Payel Mahata Dey", "comment_text": "Completely agree . I named my personal album for rome as .. “ when we are walking through time “🙂"}, {"username": "Ricky Ellis", "comment_text": "I will never forget the impression the coliseum made on me."}, {"username": "SD Allen", "comment_text": "SD Allen"}, {"username": "Kevin Bates", "comment_text": "Like a huge open air museum"}, {"username": "Roger W Ilsley", "comment_text": "Agree"}, {"username": "Maria Uto", "comment_text": "Maria Uto"}, {"username": "Melanie Volz", "comment_text": "Love Rome"}]}, {"id": "2196647184067693", "text": "Flying to Milan in august and staying in lake como, any recommendations on the best and cheapest way to travel from milan malpensa airport to como please ? Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2196647184067693/", "likes": 2, "comments": [{"username": "Betty Stilt", "comment_text": "Train"}, {"username": "Betty Stilt", "comment_text": "Rome2Rio app"}, {"username": "Lisa Silva Amaya", "comment_text": "we took the trenitalia super easy and very reasonable"}, {"username": "Frank Hunt", "comment_text": "Train Lin app, therefore train."}]}, {"id": "2196649947400750", "text": "Looking to book a golf cart tour in Rome. Just two people. Would appreciate any suggestions. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2196649947400750/", "likes": 2, "comments": [{"username": "Gail Bielskis", "comment_text": "use Get your Guide App"}, {"username": "Cyndi Ternovoy", "comment_text": "We booked a golf cart tour in September in Rome on Airbnb Experiences."}, {"username": "Renee Ettore Suglia", "comment_text": "Eating Europe does a great food one."}]}, {"id": "2196648364067575", "text": "I am seeing many of the booked tours on Expedia for Florence and Genoa state masks required. I am wondering if this is old information or if they are still requiring people to wear masks", "link": "facebook.com/groups/1373361046396315/permalink/2196648364067575/", "likes": 1, "comments": [{"username": "Gail Bielskis", "comment_text": "Was in Italy in May\nno masks required"}]}, {"id": "2196650680734010", "text": "Visits to vatican hearing different things about wearing shorts. Hear no as well as yes if they are down to your knees. Anyone with info? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2196650680734010/", "likes": 0, "comments": [{"username": "Greta Peters", "comment_text": "Preferably long pants but if you really have to - yes shorts down to your knees."}, {"username": "Anne Nelson Mason", "comment_text": "I’ve always advised pants and women should have covered shoulders!"}, {"username": "Rita Kanten", "comment_text": "In this heat they are allowing shorts down to knees."}]}, {"id": "2196651657400579", "text": "How do you get from the main airport in Rome (FCO) to Venice?", "link": "facebook.com/groups/1373361046396315/permalink/2196651657400579/", "likes": 9, "comments": [{"username": "Vero N Ferny", "comment_text": "Train 4 hrs"}, {"username": "Carmela Noble", "comment_text": "Leonardo express to termini and freccia train to Venice"}, {"username": "Jonathan Goetzel", "comment_text": "Get another plane."}, {"username": "Troy Boliver", "comment_text": "It’s very easy. There’s a train at the Rome airport—when you exit baggage look for the signs and follow. There’s a ticket counter with excellent personnel to help with your onward journey. Via the airport train You can get directly to the main station in Rome and board your train to Venice"}, {"username": "Friedemann Diederichs", "comment_text": "Fly"}, {"username": "Valerie Murillo", "comment_text": "Train, it was really nice"}, {"username": "Andy McCain", "comment_text": "Get the OMIO app! So easy. You can set up payment and have the ticket on your phone."}, {"username": "Louise Desnoyers", "comment_text": "Train, the most efficient way to travel in Italy!"}, {"username": "Bridget Gieseke", "comment_text": "Use the Rome2Rio app… it will give you all the transportation options and average time and average cost"}, {"username": "Anthony McClure", "comment_text": "Train to termini from there take the train to Venice."}, {"username": "Maria C Sapien", "comment_text": "Train 🚂"}, {"username": "Jane Coutts", "comment_text": "Fast train is fantastic"}, {"username": "Alyce Henry", "comment_text": "We used the high speedy train. We loved it"}, {"username": "Alex Dodge", "comment_text": "Fly!!! It will be like a 5-6 ordeal to get there from FCO and your already at the airport and it will likely be about the same cost maybe cheaper"}, {"username": "Giovanni Pianigiani", "comment_text": "How much time do you have? If you have 4 days you may consider walking. Or perhaps just Google for other options better suiting your needs"}, {"username": "Rhona OConnor", "comment_text": "When planning any journey I use Google. It gives all the transport options. 😉"}, {"username": "Manny Patricia Botelho", "comment_text": "Train"}, {"username": "Doug Burke", "comment_text": "With a question like that it's no wonder they went anonymous!"}, {"username": "Shawn Kopp", "comment_text": "Gps"}, {"username": "Amit Aviran", "comment_text": "Train 🚊"}, {"username": "Marie Cole", "comment_text": "Train to boat"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Why? Just fly into Venice if you aren’t visiting Rome."}, {"username": "Robyn Mosca Kingston", "comment_text": "I’m flying…"}, {"username": "Larry Reinier", "comment_text": "Train"}, {"username": "John Bruckman", "comment_text": "Take train to main station… then grab a train to Venice. Easy."}, {"username": "Vincenzo D'Angelillo", "comment_text": "Fly"}, {"username": "Nola Bostridge", "comment_text": "We got a train and then a water taxi. It’s fun and easy . Have a great time 🙂"}, {"username": "Danilo Piaggesi", "comment_text": "The train from the LEONARDO DA VINCI AIRPORT in Rome, to the MARCO POLO AIRPORT in Venice, is a high-speed train"}, {"username": "Brice Blosser", "comment_text": "Train."}, {"username": "Ellen Edmonds-Wilson", "comment_text": "Train. Four hours. Or fly."}, {"username": "Monica Sucato", "comment_text": "By train"}, {"username": "Susan B. Corino", "comment_text": "Train"}, {"username": "Stewart Cameron", "comment_text": "Train to Termini in Rome then train to Santa Lucia ( Venice ) then vaporetto ( water bus ) or water taxi to your hotel. Vaporetto €10 and water taxi around €80 ( but a great way to travel )"}, {"username": "Michael Albertsen", "comment_text": "Fly to Marco polo airport."}, {"username": "Gillian O'Callaghan", "comment_text": "Fly, train, drive, bus. I went by train but had 5 stops on the way."}, {"username": "Sonia Sharma", "comment_text": "There is a direct train between 1pm -2pm from the main Fiumicino airport train station straight to Venice. Takes about 5 hours. No changes required."}, {"username": "Russell Weidner", "comment_text": "Train"}, {"username": "Suzi Henry", "comment_text": "I flew. EasyJet. Cheap if you’re not checking a bunch of bags and don’t mind cramped quarters for 45 minutes"}, {"username": "Giulia Cardamone", "comment_text": "Planes, trains and automobiles! :) Try using Rome2Rio .com\nIt's a fabulous planning tool and points you in the right direction. No pun intended!\nSafe travels. ✈️"}, {"username": "Alison Hardy Piet", "comment_text": "I took a cruise ship"}, {"username": "Kathy Pierce", "comment_text": "Train!"}, {"username": "Jonathan Barlow", "comment_text": "Rieley Allpress, you just know this is Rebecca Sunderland"}, {"username": "Salvatore Giardina", "comment_text": "Train , but why anonymous?"}]}, {"id": "2196653674067044", "text": "Summer in Rome.", "link": "facebook.com/groups/1373361046396315/permalink/2196653674067044/", "likes": 19, "comments": [{"username": "Adolfo Can", "comment_text": "Very cool"}]}, {"id": "2196658707399874", "text": "Hi everyone, thanks to this group for so many suggestions . Since I am a last minute planner I referred a lot on this group. Tomorrow I am heading back home.\n\nWe booked a flight & hotel together in booking.com for a stay in Naples. On the 1st day we tried on our own to use local trains to visit Pompei but trains cancellations made that impossible.आणखी From Naples we been to Amalfi & positano(2nd day) the 3rd day we have been to Rome & 4th day we visited Capri & Ana Capri.\n\nWe took the day trips via get ur guide app, we boarded on the nearby point for Amalfi & posits I day trip and booked Colosseum English tour , (we booked high speed train to Rome by ourself) Capri trip arranged through the hotel. So we had Hotel pickup & drop back to hotel. The one we booked and the one hotel booked both are from HP travels. Colosseum tour is by Italy tours.\n\nEverything was nice we didn’t have any hassle except the first day.", "link": "facebook.com/groups/1373361046396315/permalink/2196658707399874/", "likes": 3, "comments": []}, {"id": "2196661427399602", "text": "I’m in Florence and want to know how early should I go to catch the sunset at Piazzale Michelangelo? When does it start getting crowded enough to not find place on stairs. Given than sunset happens at 20:51 nowadays? Has anyone been here recently?", "link": "facebook.com/groups/1373361046396315/permalink/2196661427399602/", "likes": 2, "comments": [{"username": "Desiree Dube", "comment_text": "I went a week and a half ago on a week night and it wasn’t too bad around 7:30.didn’t check the stairs but generally things weren’t too crowded. I then walked to San Miniato and that lookout area was practically empty. Walked back down to Piazzale Michelangelo around 8:30 and it was packed and practically impossible to get a spot on the ledges to take a photo"}, {"username": "Hafsa Mansoor", "comment_text": "Bump"}]}, {"id": "2196660037399741", "text": "Hotel recommendations for a night in naples before we fly out early in the morning the nx day", "link": "facebook.com/groups/1373361046396315/permalink/2196660037399741/", "likes": 1, "comments": [{"username": "Giuseppe Placi", "comment_text": "Hotel Piazza Bellini"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2196663394066072", "text": "My sincere gratitude to the admin of this group.\nIt has helped us so much to plan our Italy trip. Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2196663394066072/", "likes": 2, "comments": [{"username": "Lucas Grilli", "comment_text": "Can I know how it helped you ? I'm planning a trip too :)"}]}, {"id": "2196670067398738", "text": "Hi everyone, I would love to travel to Italy as it’s one of my dream destinations.\nI’m looking to visit Florence, Venice and Rome in October for a week, could you give me some suggestions on travel (coming from UK), on where to stay in each city, how do I get from one city to the next, how long to stay in each city and how would the weather be for October.\n\nAny help would be appreciated, thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2196670067398738/", "likes": 4, "comments": [{"username": "Steve Grossman", "comment_text": "Weather should be great and still pretty warm."}, {"username": "Karen Schmidt", "comment_text": "Weather will be great and crowds quite a bit less. I would pick 2 and get to know the cities better. Maybe fly into Rome, spend 4 nights…high speed train to Venice. Spend 3 nights and fly home from there. Or in reverse…"}, {"username": "Laura Jetton", "comment_text": "I took a Perillo tour."}, {"username": "Alice Francesca", "comment_text": "Train is the easiest option."}, {"username": "Rhona OConnor", "comment_text": "There is so much information in the posts on this page, read some of them and you will have all the answers. Everyone is going to those places..... And no where else is appears 🤔"}, {"username": "Virgz Van Møøre", "comment_text": "Perhaps you should add 1 or 2 others locations 😂"}, {"username": "Phyllis Snyder", "comment_text": "One week is not enough time. Just do one or maybe 2."}]}, {"id": "2196672024065209", "text": "BITE CREAM\nSeems a random one and not seen many here mention it. In Tuscany and Sorrento we found we got quite a few bites.\n\nOn a prior visit to Sorrento in 2015 someone at a wedding we attended in Sorrento got bites as well.\n\nRecommend taking cream with you for it!", "link": "facebook.com/groups/1373361046396315/permalink/2196672024065209/", "likes": 3, "comments": [{"username": "Jaime Cleek", "comment_text": "Bug spray"}]}, {"id": "2196690877396657", "text": "What are the best places to stay in Rome and Sardinia and Puglia?", "link": "facebook.com/groups/1373361046396315/permalink/2196690877396657/", "likes": 0, "comments": [{"username": "Maria Comitogianni", "comment_text": "Interested to know too"}, {"username": "Sabrina Tjoelker", "comment_text": "Following"}]}, {"id": "2196684564063955", "text": "Which area of Rome to stay with teenagers. Parents want to be able to let them rest at an Airbnb while we go out nearby for Aperitivo if they need rest. Close to trains and taxi stands key!", "link": "facebook.com/groups/1373361046396315/permalink/2196684564063955/", "likes": 3, "comments": [{"username": "S.P. Espy", "comment_text": "Prati"}, {"username": "Alice Francesca", "comment_text": "Trastevere"}, {"username": "Cettina Milioto", "comment_text": "Centro"}, {"username": "Carol Taylor Tisdale", "comment_text": "Just returned with teens. We stayed in Piazza Navona/\nPantheon area and it was great. Taxi stand around the corner…Great cafes everywhere. Easy walk to Trevi. Lots of nice shops and gelato."}, {"username": "Jan Armstrong", "comment_text": "This was our property from Bookings.com in Trastevere. Just off the main di Trastevere main road where there is a taxi stand. You cross the main road and you are straight into the heart of the neighbourhood with all the restaurants. We also got 2 Ubers that could pick us up right at the Piazza corner the apartment is located in. Great wifi and aircon. 3 spacious double bedrooms so our 2 teens ( 16 and 14) got their space and privacy. The management company were excellent at responding to our requests leading up to it and also arranged drivers to and from the airport. For walking into the centre, it took approx 20mins from our apartment to Pantheon/ piazza Navona"}, {"username": "Jennifer Johnson Mayes", "comment_text": "Just left Rome with teens (22, 20 and 16). We also stayed in Piazza Navona/\nPantheon area and it was awesome - the bars are open late so bring some ear plugs if staying in a nearby neighborhood. Taxi stand around the corner and Great restaurants and cafes everywhere. Easy walk to Trevi. Lots of nice shops and gelato."}, {"username": "Leah Naylor", "comment_text": "Anything near pantheon/ piazza Navona/ Trevi and city center. We love Albergo del Senato and it is right in front of the Pantheon. We also love the Prati area. Much quieter, beautiful to walk across the bridge each day but much quieter and not as many options for nighttime (but you may sleep better without the street noise). Although there are some nice hotels around the train station, I’d avoid to keep things safe and not have to worry as much."}, {"username": "Sally Warren", "comment_text": "Trastevere!"}]}, {"id": "2196687000730378", "text": "Hello, I need suggestions for a reasonable air B&B, for 4 adults either in Sorrento, Naples or Positano ( just one night).\nGrazie ! 😊🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2196687000730378/", "likes": 2, "comments": [{"username": "Cynthia McDonald", "comment_text": "Hotel elyse"}]}, {"id": "2196691110729967", "text": "Hi all - I would like to take a private tour of Positiano, Amalfi and Ravello. I reached out to one company, Taxi Mister Cab Driver, and they said total cost is about $350-400 euros for 8 hour trip. I wasn’t sure if this was a decent price for a private tour. ☺️ Anyone who has done a private tour to those three towns, any other recommendations or companies for me to consider? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2196691110729967/", "likes": 15, "comments": [{"username": "Mary Anderson Jenkins", "comment_text": "That seems reasonable."}, {"username": "Billie Begley", "comment_text": "Make sure it is Ciro la Motta there is someone out there who is not him. We did 4 different tours with Ciro and his team. Fantastic tours. You can’t go wrong They are amazing ❤️❤️"}, {"username": "Tricia Brittingham Neff", "comment_text": "We’re paying $450 for Positano, Sorrento, Pompeii"}, {"username": "Julie Kov", "comment_text": "May I ask, how many people is this for?"}, {"username": "Monica Griffith", "comment_text": "It is very reasonable for that time, plus they are amazing , I have used them before."}, {"username": "Nathan Mansfield", "comment_text": "I’m going soon and thought we would take a ferry from Positano to Amalfi, walkthrough to Atrani and catch a bus to Ravello for about €70 for the day."}, {"username": "Jeff Davis", "comment_text": "I think that is a good price. I recently paid 300 euros for taxi from Positano to the cruise port, one way, when my reserved private car failed to show timely."}, {"username": "Amber Ikemoto", "comment_text": "Seems about right for the time booked."}, {"username": "Tari Lawson", "comment_text": "Very reasonable."}, {"username": "Tamra Ann", "comment_text": "Luxama Travel"}, {"username": "Tracy Foss", "comment_text": "That's 50 euro an hour ,driver picks you up takes you everywhere you want to go and returns you back to your accommodation.S\nome of the group tours work out to 500 for 2 people for the day. I would think it's reasonable"}, {"username": "Kimberly Lynne", "comment_text": "If you can afford the private driver, it is worth the cost. You can set your pace, no waiting, a secure place to leave any purchases, air, and no waiting on transportation.\nThis saved us hours!"}, {"username": "Melissa Cortez", "comment_text": "Looking for same and trying to get in touch with taxi mr cab driver. I tried through what’s app. But no response yet."}, {"username": "Linda Metallo Casey", "comment_text": "Call Mena Forino with Amalfi Coast Transfers"}, {"username": "Patty Ward", "comment_text": "Ciro and his team are the best!That price is more than fair and the best you'll find. He's truly worth double that.We discovered Ciro too late last year -he was booked solid but was able to spend a few hours with us and then took us to our hotel in Sorrento.We already had a full day tour scheduled at that point with someone else for later in the week.If Ciro had been available,we would have canceled the other tour.That tour was no comparison to the few hours we spent w/Ciro.He charged double that amount for a full day + extra 2 hrs and took us to high end stores we had no interest in going and bad mouthed other tour companies!!If you have an opportunity to tour with Ciro,go for it!! You'll have the best day!!"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Yes a very reasonable price for a company that is reliable and insured."}, {"username": "Jan Wallace", "comment_text": "that’s what we paid"}, {"username": "Victoria Marchetti", "comment_text": "Look in to a boat tour some will stop and dock at the towns along the coast"}, {"username": "Paul Cav", "comment_text": "Anna Cavallin James Murray"}, {"username": "Brad Nelsen", "comment_text": "Use the buses and walk. Much cheaper!"}, {"username": "Bridget Nisbet Saggese", "comment_text": "My family of four used this service Mario was awesome"}]}, {"id": "2196697307396014", "text": "Florence - we had a wonderful day - yes it was hot but that did not keep us from seeing the beautiful history this city holds. Hands down best part was our guide - he was amazing - knowledgeable and all around nice guy ! If you are looking to enhance your Florence experience consider Leonardo Martelli as your guide 🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2196697307396014/", "likes": 24, "comments": [{"username": "Kris Van Duyne O'Boyle", "comment_text": "I’m headed to Florence in October. How can I connect with Leonardo?"}, {"username": "Anjali Talla", "comment_text": "Yeah where can we find him"}, {"username": "Patty Barnes", "comment_text": "Grazie!"}]}, {"id": "2196697920729286", "text": "I’m looking into booking Hotel Smeraldo in Rome for our last night. The direct booking offers option to reserve and pay once at hotel. The pay online option is more expensive. Also the first booking is like a lot cheaper than secondary websites like Expedia. And refundable up to 72 hrs prior. Is booking direct a good idea? How about the pay at hotel part? It’s like $60 cheaper direct and for balcony room whereas Expedia base room is same price. Our time will be limited so I don’t want to have any issues. Thank you for any feedback.", "link": "facebook.com/groups/1373361046396315/permalink/2196697920729286/", "likes": 0, "comments": [{"username": "Lauren-Jade Roberts", "comment_text": "I always book direct where I can. Your cutting out Expedia’s profits"}]}, {"id": "2196703030728775", "text": "What is the best olive oil to buy in Florence, and that can get shipped to the US?", "link": "facebook.com/groups/1373361046396315/permalink/2196703030728775/", "likes": 0, "comments": [{"username": "Douglas H Broxson", "comment_text": "Any"}, {"username": "Alice Francesca", "comment_text": "Extra virgin olive oil ."}]}, {"id": "2196708277394917", "text": "I had an EU adaptor that worked in France but didn't work in the hotel in Italy any reason why?", "link": "facebook.com/groups/1373361046396315/permalink/2196708277394917/", "likes": 0, "comments": []}, {"id": "2196709884061423", "text": "Good afternoon. I will be in Rome for one & 1/2 days (2 nights, coming from Florence) before I fly home. Is there an area that is better to stay in so that I may try to get in as much as possible?", "link": "facebook.com/groups/1373361046396315/permalink/2196709884061423/", "likes": 0, "comments": [{"username": "Beth Heys", "comment_text": "I stayed in an AirBnB near Piazza Navona. Walking distance to Trastevere, Vatican, Pantheon, I did walk to the Colosseum though it was a trek. There are buses around but tickets a bit harder to come by - I ended up purchasing at a metro station. The metro stations are around the edges of the centre so I couldn't catch trains. I loved being so central to everything"}, {"username": "Alice Francesca", "comment_text": "Monti or Trastevere or around Trevi Fountain/\nPantheon or Trinita dei Monti"}]}, {"id": "2196710920727986", "text": "Heading to Italy mid August and wondering if anyone has any tips for eating gluten free?", "link": "facebook.com/groups/1373361046396315/permalink/2196710920727986/", "likes": 2, "comments": [{"username": "Susan Kowalczyk", "comment_text": "AIC App"}, {"username": "Jen Reynolds", "comment_text": "Gluten Free Italy has wonderful suggestions!"}, {"username": "Mary Iuor", "comment_text": "Many places accommodated my gf allergies."}, {"username": "Michele Borey", "comment_text": "Most of the restaurants were very good about having gluten free options. My niece required it."}, {"username": "Angela Humbles Searcy", "comment_text": "Pretty much everyone I know that has gluten allergies. Can eat anything in Italy and not have any issues whatsoever."}, {"username": "S.P. Espy", "comment_text": "Italy is really great about gluten free food. I probably used the words “senza glutine” more than any others. You can find good places using find me gluten free and the fork app. Many places will have a small GF menu or will accommodate you."}, {"username": "Julia O'Brien Holbrook", "comment_text": "Find Me Gluten Free app is great but most places will know what they can serve you. I’m dairy free too and manage just fine in Italy."}, {"username": "Michele Chartrand Patarino", "comment_text": "Where will you be? Found amazing places I could share in Florence if you are heading that way!"}, {"username": "Cindy Santa Ana", "comment_text": "Just returned from 18 days and gluten-free. I will say that Venice, Florence and Rome all have a plethora of GF places. Tuscany towns and Cinque Terre have limited options but still lots of fresh seafood that's naturally GF. If you tell me which cities, I can share my favorite spots."}, {"username": "Debbie D'Agostino", "comment_text": "I’m GF and eating out was no problem!! Their GF rolls are soo good!"}, {"username": "Lauren Platts", "comment_text": "We are in Sorrento now & it’s absolutely amazing! There’s a page called Coeliacs Eat Abroad and lots of recommendations\n👌"}, {"username": "Donna Murphy", "comment_text": "Italy is super GF friendly- almost every restaurant/\ncafe in Milan had GF options and the food was wonderful!"}, {"username": "Sshona Ssmillie", "comment_text": "My daughter is gluten and dairy free, found gluten free no issues anywhere in Rome and down the Amalfi coast. Dairy free is another matter but gluten free was so easy"}, {"username": "Glen Bentley", "comment_text": "Never had an issue - the alternative pasta is penne."}, {"username": "Rachel Tillman Cornish", "comment_text": "My husband has celiac and I believe I remember that Italian government provides a subsidy for those with Celiac. There are many, many places with large GF menus. It’s much easier to eat GF there than anywhere we’ve traveled."}, {"username": "Julie Okerlund", "comment_text": "Most of the bigger cities offer many gluten free options on the menu."}, {"username": "Danielle Townsend", "comment_text": "Thanks everyone. Looking forward to eating with ease!"}]}, {"id": "2196711134061298", "text": "Traveling is the best way to free your soul, how many of you are like me? Italy will be my next stop", "link": "facebook.com/groups/1373361046396315/permalink/2196711134061298/", "likes": 6, "comments": [{"username": "Susan Cantafio", "comment_text": "Susan Cantafio"}, {"username": "Cindy Neilson", "comment_text": "Absolutely!"}]}, {"id": "2196711254061286", "text": "Anyone in Venice must book in a gondola ride with Lucky Luca.\nHe gives a commentary tour the whole time. One of the best Italy experiences for our family 🥰", "link": "facebook.com/groups/1373361046396315/permalink/2196711254061286/", "likes": 29, "comments": [{"username": "Jane Lindsay", "comment_text": "Agreed! He was wonderful!!!"}, {"username": "Maryanne Hilbeck", "comment_text": "How do you locate him in Venice?"}, {"username": "Tammy Barr", "comment_text": "luckyluca6@hotm\nail.com"}, {"username": "Margo Desjardins", "comment_text": "how much is a gondola ride with him"}, {"username": "Linda Boyle", "comment_text": "Linda Boyle"}, {"username": "Tracy Foss", "comment_text": "Thank-you love getting all the information!"}, {"username": "Nanette Spain", "comment_text": "Did a gondola ride with him in May. He was fantastic!"}, {"username": "Karen Smart", "comment_text": "We used him in 2018. Great experience!"}, {"username": "Stephanie Fenton", "comment_text": "I have him booked for our trip. Glad to hear all the great reviews!"}, {"username": "Diane Desmond Rosenfeld", "comment_text": "What made him wonderful? Is it a private ride for 2 people? Does he sing?"}, {"username": "Tanya Luca Chetcuti", "comment_text": "David Chetcuti"}, {"username": "Sharen Griffin", "comment_text": "Thank you for sharing!!! Does he take 4 people or just 2 ?"}, {"username": "Lynn Imonti Aziz", "comment_text": "We booked him for end of September he was already quite booked. he is very quick to respond to emails which was nice"}, {"username": "Mary Ann Mills", "comment_text": "Will it be cool weather in the evening October 3?"}, {"username": "Shelly Seifert Lettieri", "comment_text": "Ours was great and he told us all about the buildings we passed and the history of Venice."}, {"username": "Kathy Morra Kuloy", "comment_text": "Sandra Todd Coffey this! 🛶"}]}, {"id": "2196712304061181", "text": "Bonjourno any good suggestions on trip to capri from Salerno", "link": "facebook.com/groups/1373361046396315/permalink/2196712304061181/", "likes": 3, "comments": [{"username": "Vincent Affinito", "comment_text": "The ferry to capri is in Salerno"}]}, {"id": "2196712490727829", "text": "Are there lockers where you can store your luggage at the airport or Termini in Rome?", "link": "facebook.com/groups/1373361046396315/permalink/2196712490727829/", "likes": 0, "comments": [{"username": "Robert Lawshe", "comment_text": "No. But you can google baggage storage near Rome termini and you will find a few places close by"}, {"username": "Alice Francesca", "comment_text": "Yes there are!!"}]}, {"id": "2196712710727807", "text": "Sunset", "link": "facebook.com/groups/1373361046396315/permalink/2196712710727807/", "likes": 3, "comments": []}, {"id": "2196713567394388", "text": "Hello everyone. We will be in Florence for our anniversary. Would love a suggestion for a dinner to never forget!!!!", "link": "facebook.com/groups/1373361046396315/permalink/2196713567394388/", "likes": 0, "comments": [{"username": "Michael Galan", "comment_text": "La Giostra"}, {"username": "Nikki Livingston", "comment_text": "La Giostra!! It’s incredible and beautiful too!"}, {"username": "Mary Ellen Maatman", "comment_text": "We loved Cuculia!"}]}, {"id": "2196713207394424", "text": "Please do not use horse carriage rides!!! Italy is so hot!!! Poor horses", "link": "facebook.com/groups/1373361046396315/permalink/2196713207394424/", "likes": 569, "comments": [{"username": "Margie Williams", "comment_text": "Totally agree!!! It’s so disturbing"}, {"username": "Paula Brink", "comment_text": "Yes, awful."}, {"username": "Paula Bennett", "comment_text": "I hate that!!!!!! Not cool! NY horse died recently! Animal abuse!!!"}, {"username": "Alexandra Pinna", "comment_text": "Horrible"}, {"username": "Debbie Vitale", "comment_text": "They've been banned in some places, thankfully, but we have a long way to go"}, {"username": "Alexandra Pinna", "comment_text": "In montreal we banned it, come on my people, petition"}, {"username": "Connie Dennis", "comment_text": "OMG absolutely! They have these there?"}, {"username": "Connie Dennis", "comment_text": "In Greece it's absolutely disgusting with the poor donkeys going up so many steps!\nWhat's wrong with people?"}, {"username": "Annie Slater", "comment_text": "A horse pulling a carriage died from heat stroke last week on a Greek Island. If tourists are informed and boycott them, then horse drawn carriages will cease to exist, and horses will no longer be tortured like that. Stop riding the donkeys too!!"}, {"username": "Sandy Conrad", "comment_text": "So awful"}, {"username": "Rosinda Maria", "comment_text": "Def should be banned"}, {"username": "Debbi Mayfield", "comment_text": "In Charleston SC near where I live they have really strict rules on how long horses can work (I think one ride/2 hour break) and they are NOT allowed to work when it’s over a certain temp. They also have a huge farm to run free on St. John’s Island for an extended period of time after working a few days or a day!"}, {"username": "Oneida Ann Murphy", "comment_text": "How hot does the planet have to get before it’s stopped . Hottest month on record ."}, {"username": "Andrea Shelton", "comment_text": "People eat horse in Italy."}, {"username": "Sande Ricci", "comment_text": "These horses and donkeys are someone’s liviehood. You don’t really think they would work their animals to death do you? Yep, it’s hot. It’s hot in a lot of places where horses are used for work. They don’t want their animals to die."}, {"username": "Tracy Staples", "comment_text": "Don’t use horse carriage rides anywhere. It’s like breeding animals for $$. Go get a real job and don’t make $$ at an animals expense"}, {"username": "Lyn Wise", "comment_text": "100% agree\nAnd how many locals taking their dogs out walking on the hot ground. We saw dogs pulling on their leads to get into the shade. They are burning their feet pads. Disgraceful"}, {"username": "Deepika Bhandari Alsweiti", "comment_text": "In NYC and many parts of US too, it’s sad."}, {"username": "Brian Osman", "comment_text": "Y'all should boycott Italy and Greece!!! Until something is done"}, {"username": "Donna Hord Llorens", "comment_text": "It's disgusting."}, {"username": "Petra Kolinskitadi", "comment_text": "Any animal used by a local; DO NOT GIVE THEM MONEY"}, {"username": "Denise German Boitano", "comment_text": "Bummer"}, {"username": "Jenny Payne", "comment_text": "Never, it is so cruel & we all have kegs to walk & not take a ride in a horse carriage 🌻"}, {"username": "Lauren Vassallo Beattie", "comment_text": "Greece is terrible with donkeys. If God gave you legs use them."}, {"username": "Maria Teresa Correale Willoughby", "comment_text": "Not for horses! Hot for horses is if their temperature reaches 150F"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2196713864061025", "text": "🥰😁☺️", "link": "facebook.com/groups/1373361046396315/permalink/2196713864061025/", "likes": 1, "comments": []}, {"id": "2196714967394248", "text": "Recommendations for Sardinia please", "link": "facebook.com/groups/1373361046396315/permalink/2196714967394248/", "likes": 3, "comments": [{"username": "Vanessa Tuveri", "comment_text": "What would you Like to know ?\nI was born and rased in sardegna ."}, {"username": "Adele Mazoudier", "comment_text": "Give yourself lots of time. It’s stunning."}, {"username": "Alice Francesca", "comment_text": "Alice Francesca"}, {"username": "Alice Francesca", "comment_text": "Alice Francesca"}, {"username": "Alice Francesca", "comment_text": "Alice Francesca"}, {"username": "Alice Francesca", "comment_text": "Stay around the Costa Smeralda (NW), fly to Olbia"}, {"username": "Sharon Hickey", "comment_text": "Which is best for the nicest beach and calm seas then please?? 🙂"}, {"username": "Romina Lauretig Toscano", "comment_text": "North!"}, {"username": "Pietro Di Sorbo", "comment_text": "La Maddalena and Caprea Islands.\nAnyway in all Sardinia there're crystal water and amazing beaches, if you are in searching for that you won't disappointed."}, {"username": "Sharon Hickey", "comment_text": "Thank you girls, you’ve been very helpful 😍"}]}, {"id": "2196716967394048", "text": "I am planning to travel to Italy to visit Sicily and the Puglia area. And my be a few days in Siena and Lucca. My doubts: Is May a good month? Is still cold? Should I change it for June ? Is June a month with many tourists ?\nThanks in advance for your suggestions", "link": "facebook.com/groups/1373361046396315/permalink/2196716967394048/", "likes": 0, "comments": [{"username": "Alice Francesca", "comment_text": "May is wonderful.If you have at least 2 days in Siena rent a car and drive one hour south, to the stunning Valle d'Orcia valley..Pienza,\nSan Quirico, BAGNO Vignoni and Montalcino ♡"}, {"username": "Virgz Van Møøre", "comment_text": "Yeah May is good, how long for all of this ?"}]}, {"id": "2196725860726492", "text": "Tentatively planning a trip to Italy for my family of 4, which includes two teens who will be 17 and 14 next summer. We would have 11 days maximum and I'd like to have a mix of culture, beach, and staying at one of those agrotourismo places in Tuscany that is a gorgeous antique property nestled in the hills with a pool, etc.\n\nI'd love anyआणखी suggestions for an itinerary. Venice and/or Florence would be great as part of this, but I feel we can skip Rome because of time constraints.\n\nPlease let me know any suggestions or an itinerary you may have. We will be flying in from the Midwest, United States. Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2196725860726492/", "likes": 2, "comments": [{"username": "Alice Francesca", "comment_text": "Check Chiostro di Pienza hotel in Pienza, real Tuscany!"}, {"username": "Alice Francesca", "comment_text": "Alice Francesca"}]}, {"id": "2196726874059724", "text": "I definitely have planners fatigue so am searching for help on the following (we have 8 people):\n\n-Driver recommendations around Rome\n-recommendations from Santorini to Oia by water taxi or sailboat (yes I know this is the Italy site) and back\n-Driver for Mykonos to area beaches and back\n-Driver for Messina to Taormina and back\n-Driver for Livorno to Pisa and back", "link": "facebook.com/groups/1373361046396315/permalink/2196726874059724/", "likes": 0, "comments": []}, {"id": "2196727517392993", "text": "Hi all!\nAnyone have any suggestions for a breakfast place close to the Vatican? We have a 9:00 am tour tomorrow and want to eat before. 🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2196727517392993/", "likes": 0, "comments": []}, {"id": "2196730600726018", "text": "I’ve seen a few posts here where colosseum tours have been cancelled. Has anyone has similar issues with the Vatican? I would like to book from their partner site not the actual Vatican website. Tia!", "link": "facebook.com/groups/1373361046396315/permalink/2196730600726018/", "likes": 1, "comments": [{"username": "Jaime Cleek", "comment_text": "Book through the Vatican directly"}]}, {"id": "2196730694059342", "text": "Any ideas on how to book reservations at https://www.parrucchiano.com/?\n\nTheir online form is down, and calling them the line is busy.", "link": "facebook.com/groups/1373361046396315/permalink/2196730694059342/", "likes": 0, "comments": [{"username": "Alice Francesca", "comment_text": "Try TRE SORELLE RESTAURANT IN POSITANO."}, {"username": "Billie Begley", "comment_text": "Yes. We went there in September. It is So Worth it. Fantastic evening. You need to call them. They don’t use the online form. They take reservations up to 2 weeks in advance. We called in exactly at the 2 week mark. They open at 12 noon. We are in Canada so that was a 3 am phone call. Took me ten minutes to get through."}, {"username": "Billie Begley", "comment_text": "Billie Begley"}, {"username": "Bill Bowler", "comment_text": "Any place that makes it that hard to reserve isn't worth the bother in my books. They intentionally shut down their online reservation system during the Sunmer."}]}, {"id": "2196732780725800", "text": "Planning a 14 day trip to italy (May 2024) with my husband and two college age sons. this will be our first trip to Italy. Our plan is to fly into Rome and out of Milan. So far the thought is 3 days in Rome, 4 days and Florence/Tuscany, 3 days in Venice, then Lake como for 3 days and back to Milan for a day before flying out. Everyone really wants to see Lake como. I'm wondering if we are missing out not seeing Cinque Terre. Thoughts on this itinerary?", "link": "facebook.com/groups/1373361046396315/permalink/2196732780725800/", "likes": 6, "comments": [{"username": "Alexandra A Welker", "comment_text": "Sounds good but I would probably do 1-2 nights in Lake Como and add nights in Florence so you can take a day trip to Cinque Terre or stay 1-2 night in CT."}, {"username": "Connie Wilson", "comment_text": "I think anything less would be rushing your trip."}, {"username": "Connie Rai", "comment_text": "I'm a travel advisor and have been to Italy many times. See attached"}, {"username": "Bev Madill", "comment_text": "If you add another location you'll be rushing things and that's not the way to enjoy this beautiful country. Lake Como and the CT are both magical but maybe your sons might enjoy some hiking in the CT? I'd do whatever fits best with your itinerary. Good luck."}, {"username": "Tonsia Keytel", "comment_text": "Cinque Terre is a must do on your list, a great time of the year to go there, went in May this year!"}, {"username": "Charleen Siegler Schuss", "comment_text": "It's a perfect iterary"}, {"username": "Ashley Martins", "comment_text": "Add a day to Florence & take away from Rome that way you could go to CT if you want to see it."}, {"username": "Barbara Bastianini", "comment_text": "Everyone’s different. I wouldn’t add anything else. I’d change my itinerary s bit to add another day or two in Rome. I’d Drop one each from Lake Como and Florence to add them to Rome.\n\nI would not add the Cinque Terre.\n\nBut that’s me. Your trip should be designed around your interests and preferences not mine. There’s really no one way to do this that’s right for everyone. The key is to find the way that’s right for you.\n\nYou’re in fir a treat no matter what you decide."}, {"username": "Shelly Kentner Lehman", "comment_text": "DONT DO TO MANY PLACES IT WILL BE TO RUSHED you would wish you didn’t do so much"}, {"username": "Reagan Bramston", "comment_text": "Easy to catch a train to/from Varenna. Great spot for restaurants & to catch the ferry to visit all over Lake Como. Cheaper & less crazy busy than Bellagio. Up the hill from Varenna ferry port is a great walk to Castello di Vezio, a fabulous 12th century castle & now a sanctuary for birds of prey. You walk past a small community church & ancient cemetary & local olive trees. Just before you get to the castle you can stop at a small coffee shop & pay a small fee to enter the grounds. Climb all over cute little castle & the view from the top over Lake Como is very special. Luv Varenna. Could spend many relaxing days at the Lake, discover many hidden gems whilst wandering."}, {"username": "Doug Burke", "comment_text": "Don't try to cram in too much. Go for trip quality. As with most anything, an increase in quantity usually results in a decrease in quality. Same with trips. Take the time to absorb the things about Italy that can't be photographed."}, {"username": "Phyllis Snyder", "comment_text": "Factor in travel time between cities-"}, {"username": "Dayna Steinberg Cioffi", "comment_text": "Great itinerary. Teens can really make the most of these trips bc they love to stay up late and so does Italy! We never ate before 9pm and got to see and do so much."}, {"username": "Angela Forshaw", "comment_text": "I once did a week flying to Milan and home from Bergamo - and had a wonderful time. We spent a couple of nights in Milan (Navigli district on the canal with lots of bars/pavement cafes and only a good walk into the centre of Milan) then got train to Varenna (Lake Como) for 3 nights (used ferries to see Bellagio/Como/\nMenaggio etc - then got train to Bergamo for couple of nights - which is beautiful and often overlooked.\nAll very doable."}, {"username": "Tremayne Mushayahama", "comment_text": "I would say Milan and leaving from Venice or vice versa. will save you a day of travelling. Because Venice to Lake Como, you will pass by Milan again.\nMilan, Lake Como, Rome, Venice\nLake Como is beautiful na Varenna is a good base and only 15 mins ferry to Bellagio, but lots to do at night. Keep in mind May will rain a lot.\nPeople here always bash if someone wants to do many destinations. If you want to add Cinque Terre, go ahead YOLO, it's your first time, it's like shopping and tasting the waters. I ended up not liking Florence and regretted having 7 days there maybe bcz I find museums not amusing. But I discovered Lucca (day trip)"}, {"username": "Tania Lediard", "comment_text": "Save it for another trip. And it can be pretty rainy in May, so not as enjoyable"}, {"username": "Nancy Kaelin Smith", "comment_text": "I did this exact trip. It was perfect. Lovely to end in Lake Como. Very relaxing. I stayed in Varenna."}, {"username": "Lucrezia Folger", "comment_text": "with the time allowed you have to cut something. Of course, \"everything\" is worth seeing in Italy but you only have so much time, and you need time to be in the places you've chosen. Sounds like a good 1st trip."}, {"username": "Lucia Dedíková", "comment_text": "I recommend to stay 3 days in Roma, stay few days (3 days) in Tuscany (Saturnia thermals, San Galgano, Grosseto...), move to Pisa, Lucca for 1 day, Florence 1 day, Venice 1 day, Bergamo + Lake 3 days, Milano 1days. Have a good trip :)"}, {"username": "Rosa Rasoilo", "comment_text": "I would take a day trip from Florence to visit cinque terre. Otherwise leave everything as is."}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "Sounds wonderful! I wouldn't change anything for your first trip."}, {"username": "Elyssa Gross", "comment_text": "LOVED Cinque Terre!"}]}, {"id": "2196741447391600", "text": "I am arriving Rome in mid December then Venice and touring around. How is the weather then? Obviously winter but will it be freezing?", "link": "facebook.com/groups/1373361046396315/permalink/2196741447391600/", "likes": 0, "comments": [{"username": "Jacquie Johnston", "comment_text": "Jacquie Johnston"}, {"username": "Mary Brandon", "comment_text": "Winter jacket"}]}, {"id": "2196734120725666", "text": "We leave for Rome next week for 9 days. We have relatives there who leave for the summer to go to Oria and want us to take a 3 hour train ride to see them for a few nights. Does this sound like a lot? We are traveling with a senior, 3 adults and 3 teens.", "link": "facebook.com/groups/1373361046396315/permalink/2196734120725666/", "likes": 0, "comments": [{"username": "Jennifer Walp Rydholm", "comment_text": "I am certainly no expert on trains in Europe, but I really think it depends on the health and mobility of the senior in your group. I would think that you would want at least a day between the train trip, so that would be three days outside of Rome, between the health of the senior and the other things you want to do in Rome, I would see if 2 to 3 days would take away from your trip. Personally, with nine days I think you could fit it in."}, {"username": "Athelney Woolnough", "comment_text": "Yes do it! 9 days in one city is a lot….plus it’s beautiful down there!"}]}, {"id": "2196734434058968", "text": "Hello. This group is very helpful. I am planning our first trip to Italy. I recently discovered the Withlocals app and would like to know if others have had good or bad experiences with it.\nMany TIA!", "link": "facebook.com/groups/1373361046396315/permalink/2196734434058968/", "likes": 0, "comments": []}, {"id": "2196734457392299", "text": "What is your favourite restaurant in Amalfi???\nAnnnnnnnd go! 🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2196734457392299/", "likes": 1, "comments": []}, {"id": "2196734780725600", "text": "Hi everyone! I’m planning to visit around New Years and it’ll be my birthday as well. I’m debating\n\nTuscany, Rome, Milan, maybe Venice. I am wondering which would you choose to spend your birthday & New Year’s Eve in?", "link": "facebook.com/groups/1373361046396315/permalink/2196734780725600/", "likes": 0, "comments": [{"username": "Lucrezia Folger", "comment_text": "Roma 100%!"}, {"username": "Karen Schmidt", "comment_text": "Venice was fantastic at New Years. The city is much quieter in the days leading up to, and the days after. One morning around 8am we had Saint Mark Square almost to ourselves. ￼"}]}, {"id": "2196737234058688", "text": "Anyone have good recommendations for car service from airport to Rome city center. Do not want to take public transportation. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2196737234058688/", "likes": 0, "comments": [{"username": "Carrie Teller Badger", "comment_text": "Romecabs.com was great when we used them from airport to city"}, {"username": "Kay Rendall", "comment_text": "Romecabs wonderful for transfers book on line. Family owned, reliable. Same price as taxi from rank."}]}, {"id": "2196741680724910", "text": "We are wrapping up our 4 day stay in Venice, want to share (repay this group) by sharing 3 highlights :\n1. Burano - first time here and was pleasantly surprised how beautiful it is. Unlike the bustling Murano and shops full of glass stuff, Burano is colorful and have unique shops of handmade lace. visit the relatively unknown lace museum or evenआणखी the free lace amazing lace gallery in the back of a shop! Dalla Lidia Merletti D'Arte\n+39 041 730052\nhttps://goo.gl/maps/ZBegWf5U5BFKozQP8\n\n2. Doge palace Special Itinerary tour - Doge’s Hisden Treasure! Highly recommend this very limited tour for about same price as regular ticket and includes the entire museum visit. What a special treat to see the secrets of the Doge and access to rooms majority of visitors don’t see. https://palazzoducale.visitmuve.it/en/the-museum/layout-and-collections/the-doges-hidden-treasures-itinerary/\n\n3. Jewish Ghetto - this is usually overlooked, we loved the tour of the first Jewish Ghetto in the world. The guide was very informative and visiting the synagogues was a very inspiring experience.", "link": "facebook.com/groups/1373361046396315/permalink/2196741680724910/", "likes": 2, "comments": [{"username": "Janet Smiley Carucci", "comment_text": "Thankyou! This is helpful!"}]}, {"id": "2196775684054843", "text": "Anyone stayed in an Agriturismo in Sorrento area? Any good suggestions? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2196775684054843/", "likes": 1, "comments": [{"username": "Diana Salvatore", "comment_text": "Agriturismo Antico Casale.\nThey have a bus stop right there."}]}, {"id": "2196742944058117", "text": "What’s everyone’s favorite town in Umbria??", "link": "facebook.com/groups/1373361046396315/permalink/2196742944058117/", "likes": 7, "comments": [{"username": "Monica Colontonio Macho", "comment_text": "Orvieto"}, {"username": "Maria Badamo DeSocio", "comment_text": "Spello"}, {"username": "Norma Kalberer", "comment_text": "Assisi"}, {"username": "Jim Kelleher", "comment_text": "Castiglione del Lago"}, {"username": "Beth Ann", "comment_text": "Spello or Orvieto"}, {"username": "Dr-Jon Warnecke", "comment_text": "GUBBIO, Rasiglia, Spoleto, Spello, Assisi, Perugia, Orvieto. Each one is unique, but quaint and beautiful. Much less touristy than Tuscany, and less expensive too! I lived in Perugia for 4 years."}, {"username": "Gay Bell DiBartolomeo", "comment_text": "Spello"}, {"username": "Tami Frediani", "comment_text": "Spello ❤️❤️❤️"}, {"username": "Mike Crawford", "comment_text": "Orvieto"}, {"username": "Angelina John", "comment_text": "Orvieto!!!!!"}, {"username": "Lila Schwartz", "comment_text": "Peruggia and Spoleto !"}, {"username": "Annette Fordyce", "comment_text": "Perugia. It’s a great base for day trips to the towns others have mentioned. Twenty minutes by train to Assisi, 30 to Spello. There is also a lot to see and do in Perugia- some really good restaurants and cafes, beautiful churches, and ancient Etruscan walls. I lived there as a child, and have gone back as often as I can. We were just there for five days in May, and other than a quick trip to Assisi, we spent the whole time in Perugia and still don’t feel as if that was long enough."}, {"username": "Stacey Nyitrai Troisi", "comment_text": "We loved visiting Gubbio and Assisi. They were fantastic!!! We stayed in Saragano. Great base. Great people."}, {"username": "Sue Milo Snider", "comment_text": "Orvieto ❤️"}, {"username": "Alice Francesca", "comment_text": "Spoleto or Assisi"}, {"username": "Dimitri Pianese", "comment_text": "Perhaps Assisi then Bevagna, Trevi and Rasiglia (with no tourists)."}, {"username": "Michael Steemann Brøndum", "comment_text": "There are so many beautiful things about Umbria. We been living here now for 6 years in the northern part .. in a litte beautiful town called Montone. And there for also my favorite place in Umbria💚 but I am also in love with the nature, the food and the People who are living her... welcome to visit our facebookpage Familien Brøndum i Umbrien/ a Danish family living in Umbria there is a lot of pictures and stores from our life here in Umbria💚🇮🇹"}, {"username": "Back Stage", "comment_text": "Todi"}, {"username": "John McKay", "comment_text": "Gubbio!"}, {"username": "Carlien Bruyel", "comment_text": "Narni."}, {"username": "Linda Debrewer", "comment_text": "Spello!"}, {"username": "Dawn Falsinotti", "comment_text": "Assisi"}, {"username": "Sarit Rolnik", "comment_text": "Spello and Assisi"}, {"username": "Jeanne Hannivig-jones", "comment_text": "Perugia, passingno sul Trasimeno and assisi"}, {"username": "Amber Ikemoto", "comment_text": "Orvieto. Absolutely charming and lovely."}, {"username": "Mick Konowal", "comment_text": "Assisi and Spello."}, {"username": "Francesco Ronchi", "comment_text": "Assisi, Orvieto, Spoleto"}, {"username": "Shelby Musselman Dickman", "comment_text": "Thanks everyone! We’re basing outside Orvieto (Altarocca) so great to see Orvieto is a favorite! Any suggestions on private drivers and/or Umbria tours that start in Orvieto?"}, {"username": "Alessandra Pasteris", "comment_text": "Hard to pick just one but Perugia and Assisi are my top two."}, {"username": "Diane Milam Morgan", "comment_text": "Orvieto"}, {"username": "Richard Petronio", "comment_text": "Orvieto!!"}, {"username": "Tina Tupper", "comment_text": "Orvieto"}, {"username": "Nicole Douglas", "comment_text": "Orvieto"}, {"username": "Chris Love", "comment_text": "Spoleto"}]}, {"id": "2196743037391441", "text": "What is the name of the train station I would go to from Venice to Florence? Are there multiple train stations in Florence? How far in advance should I book the train?\nBest place to book a gondola from port in Venice to a hotel close to Saint Mark's Basilica?\nThank you!!!", "link": "facebook.com/groups/1373361046396315/permalink/2196743037391441/", "likes": 0, "comments": [{"username": "Monica Sucato", "comment_text": "Florence main train station Is called Santa María Novella (S.M.Novella)"}, {"username": "Lisa Valdovinos", "comment_text": "The gondolas are everywhere. We just walked up to one. 100.00 Eros but we did an extended ride. I believe it was 80 Euros for the shorter trip. There was no line. It’s a bit pricey but I’d always wanted to do it."}]}, {"id": "2196745454057866", "text": "We are planning a trip for September of next year. We will be in Venice for eight days on a canal cruise and the boat will be our hotel.\nAfter that we thought we would take the train to Florence for one day/ night and then head to Montepulciano for maybe three nights before heading back to the states. The only thing we are committed to is the eight day Venice. Aside from that I would love suggestions, comments or recommendations.\nGracie!", "link": "facebook.com/groups/1373361046396315/permalink/2196745454057866/", "likes": 0, "comments": [{"username": "Robin Burrell", "comment_text": "Montepulciano is small. Stay in Venice for 3 days instead"}, {"username": "Sande Ricci", "comment_text": "Spend more time in Florence. We were there for 4 days this past May and are planning to come back in September of 2024!"}, {"username": "Gina Rovello Keenan", "comment_text": "I would do 3 nights in Florence and one night in Montepulciano."}, {"username": "Alice Francesca", "comment_text": "While in Montepulciano visit the nearby villages: Pienza, Bagno Vignoni, San Quirico.Best stay in Pienza : Chiostro di Pienza hotel."}, {"username": "Alice Francesca", "comment_text": "https://\nwww.italia.it/\nen/tuscany/\nthings-to-do/\npienza-the-ideal\n-city"}, {"username": "Greg Saba", "comment_text": "The last time we spent three nights in Florence, it was so crowded, we took a day trip by rail to Siena. We spent another day on the more local side of the Arno (known as Oltrano) including Patti Palace and Bobble Gardens. We gave up on the \"skip the line\" lines. I am guessing you selected quieter Tuscany, maybe for the wine, etc., but Montepulciano is an excellent base. Besides Pienza, a ride through the Val D'Orcia area, including San Quirico d’Orcia, would be perfect on a nice day. Other favorites in rural Tuscany for us were Montalcino, Monteriggioni, San Gimignano, Volterra and, of course, Siena."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2196754314056980", "text": "Flying into Milan Linate and need to go straight to central train station.\nAny recommendations\nfor transfer ? Probably have about 90 mins", "link": "facebook.com/groups/1373361046396315/permalink/2196754314056980/", "likes": 0, "comments": []}, {"id": "2196762240722854", "text": "Can anyone shed light on the nail polish trends in Italy right now? I will be in Rome and on a Mediterranean cruise for two weeks in September and I’m not up to date on what colors/styles Euro women are doing for manis/pedis. I would like to be subtly appropriate. Also I need something to last for the duration since I won’t be ducking out to a salon amidst sightseeing! Thanks for the advice!", "link": "facebook.com/groups/1373361046396315/permalink/2196762240722854/", "likes": 54, "comments": [{"username": "Robyn Smuin", "comment_text": "Omg people. If this post is about something that's not important to you, SCROLL ON. Good grief!!\n\nI seriously can't believe how many nasty, crusty, sanctimonious and judgmental people are in this group. You guys can all afford to go to Italy. Italy!!! Do you not know how lucky you all are? How are you still this dissatisfied and unhappy in life that this is how you treat other people?\nHappy people don't get worked up about something so unbelievably innocuous. Happy people don't put other people down or purposely try to shame others like this.\n\nKeep your ugliness to yourselves, and quit clawing at everything and everyone around you... it's super, super gross and it's poisoning this group. You're not better or smarter or more cultured because you don't get your nails done. Get over yourselves."}, {"username": "Sandra Keyser", "comment_text": "I hope you are kidding! We were in Italy for a month and not once did I notice anyone’s nail polish. Be you not what someone else is or is not doing!"}, {"username": "Julie Salem", "comment_text": "I would just have what you like and not worry about fitting in, there will be a salon on cruise I’m\nSure that can repaint your nails of needed , either go bright or go French / natural , you could have a pale colour snd on your ring finger have nail art x"}, {"username": "Cindy Breneman Hattrich", "comment_text": "Red is always the classiest"}, {"username": "Evette Davis", "comment_text": "Everybody looks at the amazing historical sites or the beautiful lakes & beaches, not each others nails! I was there for a month & never looked at anyones nails & didnt care if they looked at mine which were au natural!! Its only important to you"}, {"username": "Lisa Jones", "comment_text": "My daughter got these acrylics done in London during our European holiday 😁"}, {"username": "Joanna May", "comment_text": "I feel you. I have these kinds of questions. I don’t have any answers for you, but these are my nails right now. Before I leave next Friday for Milan, I’m going to have them bring the length down a bit and do a solid nude neutral with full shine."}, {"username": "Denise Haynes Faustyn", "comment_text": "I appreciate anyone who asks a question that is important to them, it is probably important to a lot of people who are afraid to ask. What I can not tolerate is anyone who says \"who cares\" in their answers. The person who asks does, DUH. Everyone has the things that they care about, if it isn't your thing or you can't contribute, SCROLL PAST AND SHUT UP."}, {"username": "Christine Camilleri", "comment_text": "I’d hate to be around when you had a really big decision to make lol 😂 😂😂 sorry couldn’t help myself 😂"}, {"username": "Susan B. Corino", "comment_text": "I always get gel mani ballet slippers light pink"}, {"username": "Sally Warren", "comment_text": "It’s a cruise so will be full of Americans. European women don’t wear much nail polish."}, {"username": "Zucchero Candito Kandinsky", "comment_text": "We don't have big trends here on nails, probably it is less popular than in other countries. Usually I see natural pinks or nudes, french, and some dark red. Bright colours are considered less classy. Also, very long nails are not popular"}, {"username": "Melanie Sutton", "comment_text": "Does anyone other than you really care?\nI like this page for pertinent information but check with one of the Kardashians on your nail colour"}, {"username": "Cindy Rogin", "comment_text": "I bring Dazel brand and do my nails as I go. I bring a color I like as I don’t care what trends there are. Dazel dries completely in 5 min so very handy for traveling."}, {"username": "Alice Dzimiera", "comment_text": "I didn't really notice what nail color women were wearing when I was there a few weeks ago. I wear bright colors in the summer...this was OPI Strawberry Margarita"}, {"username": "Edmond Nolan", "comment_text": "Seriously 🙄🙄🙄"}, {"username": "Christine Calleja", "comment_text": "All white is a thing at the moment here in the med :)\n\nYou can play it safe and do french .. they are always in fashion."}, {"username": "Christine Calleja", "comment_text": "These were my nails when i visited Naples for the scudetto celebrations...\nI'll be going to Italy again soon they will be similar but red or white instead of blue 🫶🏻"}, {"username": "Jen Larkin", "comment_text": "I get shellac French manicure. It looks really nice and lasts for weeks!"}, {"username": "Cristina Maximciuc", "comment_text": "Nude color, semipermanent and you are good to go anywhere and match any outfit."}, {"username": "Kate Bremner", "comment_text": "Short round with French tips in non white colours 🙂"}, {"username": "Clara Balzano", "comment_text": "OMG, seriously?"}, {"username": "Jo-ann Tonon", "comment_text": "Sorry but this is probably the least important thing I can think of. Enjoy Italy. Wear appropriate clothes at churches. Eat & drink well 💚🤍❤️"}, {"username": "Josie Gilbert", "comment_text": "I sported my usual, natural horse managing and riding nails, a bit of dirt, cracks and general mismanagement. I had no problems navigating the culture with them. I may have been judged but didn't notice"}, {"username": "Enery Castellanos", "comment_text": "No clue about style but I did mine with a bit of diamonds on my wedding finger as the real thing is staying behind 😊 get there in a short few hours."}, {"username": "Lisa Terzigni-Miller", "comment_text": "Red white and green ways work 🤪"}, {"username": "Wendy Neesham Westall", "comment_text": "Just go with whatever colour you prefer. Don't worry about what others are wearing."}, {"username": "Linda Mell Misskelley", "comment_text": "They don't even have nail salons like we have here on every corner!"}, {"username": "Sarah Lybarger", "comment_text": "This is such a fun question! Wouldn’t have thought of it, but now I need to know what to do with my nails when I go, for sure! 😁❤️"}, {"username": "Jenn Messina Babore", "comment_text": "I found that many of the Italian ladies wore a more natural almost sheer color."}, {"username": "Katty Veneno Perez", "comment_text": "I’m going with my greenish from Miami weather 😂"}, {"username": "Hilda Farrugia", "comment_text": "If you are on a cruise you can get your nails done on board- whilst the ship is at sea"}, {"username": "Kim Carlton", "comment_text": "When I travel, I get a French manicure, and I always get SNS on my nails. My typical manicure lasts 4-5 weeks unless I’m doing a lot of gardening or heavy cleaning where I break a nail. The French manicure looks neat and clean, and you don’t notice a demarcation line between the nail color and cuticle as the nail grows out."}, {"username": "Erica Kline", "comment_text": "Hahahha omg"}, {"username": "Teresa Heran", "comment_text": "My mani/pedi was white. Gel fingers and natural toes. Neither got dingy or dirty. I was gone for a month so I refreshed my mani half way through.\nDid a few boat and snorkeling trips and went to a couple of beach clubs - white pedicures were mainly what I saw. Manicures were the full spectrum"}, {"username": "Aida Perez Castellano", "comment_text": "I just came back two days ago. For my hands, I had a French manicure 💅 done with dip powder which still looks great. On my toes, I went for a pink because it’s my favorite. It was gel and looks as great as the day I had it done (about 2 1/2 weeks ago)."}, {"username": "Silvia Frati", "comment_text": "Two trends... natural or American style with gel,lots of colours and long nails (which I find really tacky). But please do not worry, we usually do not care about others nails"}, {"username": "Kelly Page", "comment_text": "If you don’t have anything to say that’s helpful to the post, move on. I love this group except for the unhelpful, arrogant and sometimes extremely rude comments. Sheesh. Travel is extra. So if you are in this site, you get the wonderful privilege to travel to other places. That’s extra. So if someone wants to ask about nail color, who cares? Be nice. Be helpful. Or move on. People that are critical of others must be really bored.. and the negative comments… boring. 🥱"}, {"username": "Donna Parrish", "comment_text": "You need Gel X to last the duration"}, {"username": "Arlene Soriano Concepcion", "comment_text": "Just got back- I chose neutral with my signature glitter! 😝"}, {"username": "Carol Melendi", "comment_text": "Do nude in case it chips it won’t be noticeable"}, {"username": "Shannon Ruffin Pelicano", "comment_text": "Funny bunny or bubble bath OR. A combination of the two is great! Easy simple and natural."}, {"username": "Lucrezia Folger", "comment_text": "Been 17 times and never knew or heard of this trend. I know many Italians there and this was never a subject."}, {"username": "Betty Stilt", "comment_text": "Clear or buff."}, {"username": "Briana McDougall", "comment_text": "I can't believe the negativity in these comments! If nails aren't your thing, just scroll past people.\n\nGreat question! I too am an \"occasion nails\" girlie (if you've seen the tiktok from the salon owner you get this), but will likely go with a nude and maybe a white French tip when I go in October. 1) I want it to look good for the whole 3 weeks, and this is the best way to get longevity) 2) It will go with any outfits 3) it seems the most chic option."}, {"username": "Sshona Ssmillie", "comment_text": "Not my nails but a design I get done a lot and love, goes with everything"}, {"username": "Sshona Ssmillie", "comment_text": "Not my nails but one of two of my fav designs. Goes with everything"}, {"username": "Kate Piszczek", "comment_text": "Kate Piszczek"}, {"username": "Kate Piszczek", "comment_text": "Kate Piszczek"}, {"username": "Romina Lauretig Toscano", "comment_text": "Antique rose ... simple and elegant."}, {"username": "Annie Nelhams", "comment_text": "Depends on where you are going/staying.\nBeach, rental house- whatever’s you like.\nCity/ hotel- elegant, subtle"}, {"username": "Alicia Cox", "comment_text": "Lol well if it’s subtle - STAY AWAY from these crazy trends right now with the 6” nails decorated with all kinds of nonsense! Think classic! Short, manicured, neutral!"}, {"username": "Melanie Shoemake Eason", "comment_text": "I’m going in the fall and thinking a short red would be pretty but not distracting, and classic in photos. I do gel. I leave on Friday and will get them done Thursday morning. They’ll be a little grown out (11 day trip) but should hold up fairly well."}, {"username": "Natalie Kampe", "comment_text": "just got back! i did these blue flowers with shimmer base 🙂"}, {"username": "Jess Lynn", "comment_text": "I’m here now and a lot of the locals have a pale/baby pink color and it is so pretty!"}, {"username": "Henriette Langius", "comment_text": "Henriette Langius"}, {"username": "Michele Baron Vold", "comment_text": "No one will care about your nails. I always use Funny Bunny and do a no chip which lasts at least 2+ weeks. Blend in. Do not know how old you are but you cannot go wrong with this color. And it does not get dingy. I also take a bottle with to touch up. If you want color perhaps Navy or a bright blue."}, {"username": "Susan Modeva", "comment_text": "always get a mani / pedi before I vacay .. tend to go orange on my toes and nude on hands .. because I love to look to wiggle my pedicured happy toes at the pool and on the beach 😊and Nude on my nails incase they chip so not so noticeable 🧐.. but hey ho its your holiday ..whatever makes you smile"}, {"username": "Rachael Richardson", "comment_text": "My nails are BIAB and are 4 weeks old now we go back to the Uk on Sunday after 18 days in Italy"}, {"username": "Nicole Goudey-Rigger", "comment_text": "Permanent French and a fun color on your toes with gel. I get a month out of mine, no chips."}, {"username": "Lisa Hettrick", "comment_text": "I had a female tour guide tell me on my first day in Italy not to worry about trying to blend in. No matter what you do, they can tell you’re not Italian. That being said, you can’t go wrong with neutrals. Do what pleases you."}, {"username": "Cindy Neilson", "comment_text": "Sounds like a huge generation gap! 😂"}, {"username": "Antonella Borraccino", "comment_text": "I live in the south of Italy and here the trend is Stiletto shape. But do it only because you want to do it not to be appropriate."}, {"username": "Claudine Grech Fleri-Soler", "comment_text": "No long nails,neutrals and white toes."}, {"username": "Gina Scialdone Ferris", "comment_text": "Lots of French colored tips"}, {"username": "Lynda Blackley", "comment_text": "Joanne Nacson.. I was considering this .. watdaya think 🤔.."}, {"username": "Marie Simpson", "comment_text": "🙄🧐"}, {"username": "Danielle Evans", "comment_text": "This is mine and my best friends. We are travelling around Italy currently 😌I think any colour you like would be perfect!"}, {"username": "Kim Smith", "comment_text": "Really? Use red. Easy"}, {"username": "Sue Daglish", "comment_text": "Anna Von Bergheim"}, {"username": "Olivia Busby", "comment_text": "The glazed donut look is in along with the tips being a different /brighter color."}, {"username": "Angela Gilmore", "comment_text": "Guys you really have some misconceptions about Italians 😅\nYes, yes the fashion industry and all, but believe me we do not care what tourists wear, and even more about their nails. There is no appropriate color for your nails. Choose what you like and what makes you feel comfortable."}, {"username": "Sheena Puzey", "comment_text": "I'm currently in Rome. I have looked at the Italian women looking so chic and comfortable. Not once did I look at their nails. My only thought was how do they put this package together and not be dripping with sweat and red faced like myself - looking like I've run a marathon. I can't wear polish at work but painted mine pink for the trip. I bought nail polish remover at the supermarket yesterday for €.66. My nails have not been this long since before my first wedding🤣"}, {"username": "Clare Boxer", "comment_text": "I went for a Mediterranean blue tip, the nude near the nail bed was good so the growth wasn’t as obvious x"}, {"username": "Lorraine Rattray", "comment_text": "Will be in Zurich in Oct staying at the central plaza hotel in the main square area. Can anyone give me a nail artist in that area. I will need an infill.\nWould be greatly appreciated"}, {"username": "Kari Cooper", "comment_text": "Italian women, at least here in the north, wear all colors and styles. Just like women everywhere else.\nIn Sardegna last week the girl we made friends with had black with spider webs the first half of the week and then got them done on her day off and came back with red/black with spider webs. It was her personal style.\nOthers like neon. Others like nude.\n\nGo with whatever you like."}, {"username": "Frances McDonagh", "comment_text": "Get what you want just back I wasn't looking at all the nails. I did my own what I liked beforehand"}, {"username": "Monique Swanner", "comment_text": "Everyone laughing at you, but I get it! These are my nails that I had done for my wedding and seemed to fit in well here. More natural colors, the \"chrome/milky\" look is very in."}, {"username": "Shani Mitchell", "comment_text": "John Simpson"}, {"username": "Giorgia Petraia", "comment_text": "Only red, natural pink or french manicure. Everything else is tacky."}, {"username": "Leila Myftija", "comment_text": "The shorter and more subtle the better.\nAnything else is not elegant and tacky."}, {"username": "Julie Helton Attanucci", "comment_text": "To be honest with you, I was just there and had my nails bright pink. But…. I never once looked at anyone’s nails and just did mine as usual. Just do you and you’ll be good. Have a fabulous time."}, {"username": "Lisa Gaimaro Sullivan", "comment_text": "I got my first gel manicure for our trip because I didn’t want them to be all chipped in a few days (as a normal manicure would). I went with a kind of tannish color that looked nice in the salon but it looked boring in pictures (holding drinks/\ngelato). I’m not a person who is really into nails, but I understand your question. I wouldn’t worry about fitting in for trends, but you will look at the pictures for a long time. The minute I walked out of the salon and saw my color in the daylight, I realized that I’m going to Italy, and that should’ve been my time for a nice red that I wouldn’t normally do, but in the end I was just happy that they looked neat and finished the whole time."}, {"username": "Diane Grodzki Smith", "comment_text": "You would like to be subtly appropriate … seriously 🤦🏻‍♀️"}, {"username": "Sandra Shoffner", "comment_text": "Never looked at anyone's nails,too busy looking at everything else. I don't think that's a big deal there and I've never seen a nail shop on 6 trips."}, {"username": "Aimee Swanson Lake", "comment_text": "Yes I totally get it too! I was actually looking for the same info before we left for our two week trip to Italy. I did a light pink- Ballet Slippers- gel and it lasted for more than two weeks with no problems. I actually only saw one nail salon in Rome while we were there but I’m sure there are many more. My focus was on food and the sights so get that mani pedi and enjoy your trip!🎉"}, {"username": "Kim Aranha", "comment_text": "I am constantly amazed with what people ask on this group￼.\nIt is interesting to learn what worries people before they travel…. I went to America for a few days this week and I started looking at my fellow passengers - really looking. What they were wearing, their carry-on bags, were they wearing “crossbody”, their Tattoos, hair styles, torn jeans, how they spoke and even what they were saying ….it seams as if most people on this group areAmerican or Australian - the two nationalities ask very different questions and supply very different answers.\nI know had to add nail polish to my observations….\nI would have never thought to enquire about nail polish crazes in a country I am visiting ….. it strikes me of a bit of “living in a Barbie world”… but what is important to one person is of no consequence to the next !\nI am going to Italy for a month in October and my one year old grandson will be traveling with us with his parents… can anybody tell me what the well dressed one year old is wearing in Italy ….. 🤣😂🤣"}, {"username": "Laura DeCicco", "comment_text": "Nobody cares what your nails look like, do them how you want"}, {"username": "Nancy Komatz", "comment_text": "Nancy Komatz"}, {"username": "Marjan Wagner", "comment_text": "I did orange to match with an Aperol\nSpritz 🤣"}, {"username": "Susan Donlan", "comment_text": "Look at online Italian clothing catalogs"}, {"username": "Mary Nadal", "comment_text": "Be aware that Italy is not like the US where there are tons of nail salons you can just drop in and get a mani-pedi. Many places require appointments well in advance and don’t take walk-ins. Just something to know so you know what to expect! The spa at your hotel might be a better bet than trying to walk in to a place off the street if you want to get your nails done while you’re there."}, {"username": "Rhonda Hope", "comment_text": "I always wear neutral nail powder dip I never wear a color polish"}, {"username": "Melissa Santos", "comment_text": "I love following the trends in a new place. Learning what they like and how they live. Thanks for posting so I can follow. Haters gonna hate! Can’t wait to see what you go with! ❤️"}, {"username": "Fannie Liu", "comment_text": "I would recommend a gel mani and pedi, it should last at least two weeks. Dip powder is also an option and people say it last even longer. Gel is great when you use sunscreen and insect repellent it doesn’t mess up the polish like a regular mani. Can’t help you with color, I’m just going with what I like. 😊"}, {"username": "Maddy Herbert", "comment_text": "I had my nails done before leaving for Italy and had them redone 2 weeks into the trip in Corfu. (The salon was amaaaazing, if you’re heading that way definitely look up Fab Beauty Bar), but I did book ahead.\nIn Italy, I noticed a lot of the younger service staff had nice nails. ￼\nIn terms of trends, i think it also depends on skin tone and length.\nI saw a lot of French tips/neutrals in longer nails (not crazy long) and some shorter red wine colours.\nI’d suggest a neutral colour (I have pale skin so something similar to essies ballet slippers works well for me) for longevity and subtlety!"}, {"username": "Yuliya Kovalev", "comment_text": "Yuliya Kovalev"}, {"username": "Yuliya Kovalev", "comment_text": "The Hailey Bieber nails are great for compliments while looking simple"}, {"username": "Yuliya Kovalev", "comment_text": "Yuliya Kovalev"}, {"username": "Yuliya Kovalev", "comment_text": "Yuliya Kovalev"}, {"username": "Alice Francesca", "comment_text": "I am from Italy and we do all colours.It depends also what kind of woman you are: classy Italian women go for neutral colors even in the summer, long nails/brightly colored ones are considered tacky."}, {"username": "Lucy Filice", "comment_text": "I like bubble bath and movie buff from OPI"}, {"username": "Cathy Guarino Marrone", "comment_text": "I’m a nail tech in the US and just recently went to Italy in June. I’m know for doing my own nails with lots of nail art, but I do like to keep with being appropriate as well. Though when going to Italy my daughter said Mom be simple. (She had a faded French gel manicure). Well, that just made my wheels turn to design my nails appropriately for Italy! Lol\nI did them in a stiletto shape, with red, gold and rhinestones. Pictured here. They were truly obnoxious but I got so many compliments on them! Like wearing jewelry for me. Did I stick out like a tourist? Who cares! With this said wear whatever makes you comfortable and I surely did have fun with mine. Italy is very ornate in decoration and so we’re my nails! Lol\nI also walked into a few salons to see what they were like and said, I’m from the USA and wanted to say hello. They were very receptive and went crazy saying “BELLA” looking at my hands.\nI do tell my clients though simple is appropriate and goes with clothes better. Whatever makes you feel comfortable.\nBtw, also during fashion week here in the US nails are done quite outrageous to make statements, by CND using Shellac, on some of the runways fashion models coming out of cities in Italy such as Milan.\nEnjoy your trip! 🇮🇹💅🏼"}, {"username": "Kristi Bailey", "comment_text": "So I already know I'm going to stand out as a tourist the minute someone hears me speak (I'm from the south) so I will do my nails the same for my upcoming trip as I do here at home. I've had many different designs and have a longer nail. Current set attached, I have no idea what I'll be in the mood for come September, but they will be this shape and length. My preference 🤷‍♀️."}, {"username": "Maureen Buccelli", "comment_text": "I did dip powder on my hands and shellac or gel on my feet. Went with a neutral color on both. Dip lasted 3 weeks pedi is still good"}, {"username": "Jenny Larsen", "comment_text": "The only people I saw with nail polish were American tourists. Only saw two nail salons in five weeks , I’m sure they are there I just didn’t see them."}, {"username": "Rashelle Lynne", "comment_text": "These were mine for our trip, but it was in February….you need a brighter color- especially for a cruise! The colors I chose actually ended up being from a line of Italian named polishes…like truffle, Cyprus, dolce etc. I also got a lot of compliments on them from Italian women"}, {"username": "Michela Ratti", "comment_text": "Hi! Whichever style/ colour you prefer. Do not worry"}, {"username": "Jennifer Dinshaw Schock", "comment_text": "i went fancy on our cruise. I did a dark red with rhinestones on the big toes. We went during Oct/Nov."}, {"username": "Virginia Whitelaw", "comment_text": "I always take a bottle with me when I travel to touch up my nails just in case they chip!"}, {"username": "Kyra Savoie Miles", "comment_text": "Wow you got the info you were inquiring about and “oh so much more” in like >4 hours. Enjoy the cruise!"}, {"username": "Jackie Zalewski", "comment_text": "Same as anywhere else, but I like to go classic in Italy. Miami I step out of my zone. Have fun!!!"}, {"username": "Kerri Armitage", "comment_text": "You're really overthinking it...have what you want! We aren't on another planet in Europe just a continent"}, {"username": "Andrea Robinson", "comment_text": "I use Avon 60 second drying nail polish. That way you can change the colour if you want. I find gel nails restrictive because I feel “stuck” with the colour so I use the Avon one which is quick to do.\n\nhttps://\navon.uk.com/\nproducts/\nultra-colour-60-\nsecond-express-\nnail-enamel"}, {"username": "Arta Goldman", "comment_text": "Nude, French or red Valentino. Only. No long nails!"}, {"username": "Michelle Smith", "comment_text": "Lol I was in Italy and Greece last month\nDon't stress over the colours of nails\nJust be you\nTbh most italians probably won't even be looking you.\nJust enjoy 😉"}, {"username": "Anna Tsouvela", "comment_text": "Zina Berikou μάλιστα 🤔🤔"}, {"username": "Jayne Dawson Meyer", "comment_text": "Do what you like. Nobody is staring at your nails."}, {"username": "Lara Bourke", "comment_text": "Just be yourself and paint your nails whatever with whatever you like."}, {"username": "Hollie Barcheck Juersivich", "comment_text": "Classic red for me. Never goes out of style"}]}, {"id": "2196762444056167", "text": "Is it best to buy my ferry tickets when in Positano or buy on line before the trip?", "link": "facebook.com/groups/1373361046396315/permalink/2196762444056167/", "likes": 0, "comments": [{"username": "Bob Warren", "comment_text": "We bought ours in Positano."}, {"username": "Cece Francis", "comment_text": "Where does the ferry go to ?"}, {"username": "Millie Galanto", "comment_text": "Buy them there!!"}]}, {"id": "2196767640722314", "text": "What is the best way to travel Amalfi coast ? For a week , please", "link": "facebook.com/groups/1373361046396315/permalink/2196767640722314/", "likes": 0, "comments": [{"username": "Scott Hunt", "comment_text": "Train to Naples and driver"}, {"username": "Anthony Taylor", "comment_text": "Do trips by boat and road.Both views are amazing"}]}, {"id": "2196769400722138", "text": "Hi ladies, what are your favourite shoes for walking? I know to each it’s own but was still wondering. I’m not after fashion brands more after comfort. Please share. Thanks in advance:)", "link": "facebook.com/groups/1373361046396315/permalink/2196769400722138/", "likes": 0, "comments": []}, {"id": "2196772294055182", "text": "Coming to Rome in September thinking of making a day trip to Florence. Is the train easy to navigate? And what is the must sees in Florence?", "link": "facebook.com/groups/1373361046396315/permalink/2196772294055182/", "likes": 0, "comments": [{"username": "Desiree Dube", "comment_text": "If you just have one day, I’d recommend the Duomo complex (buy tickets in advance if you want to climb the dome), Palazzo Vecchio’s Hall of the 500 and the rooms to the right side and also do the battlements and tower, Ponte Vecchio, Uffizi - it’s going to be a whirlwind day though! I’d recommend doing two days in Florence instead."}, {"username": "Ann LaGreca", "comment_text": "Yes the train is easy. I recommend taking a walking tour so you can see the highlights, starting at Piazza Novella"}]}, {"id": "2196771940721884", "text": "After much research I am thinking of renting a car in palermo from BRID.....they get great reviews on trip advisor and I would like to know of any experiences that any of my friends here may have had in palermo...thanks so much in advance for any advice", "link": "facebook.com/groups/1373361046396315/permalink/2196771940721884/", "likes": 0, "comments": []}, {"id": "2196778244054587", "text": "Sounds great!", "link": "facebook.com/groups/1373361046396315/permalink/2196778244054587/", "likes": 32, "comments": [{"username": "Jennifer Walp Rydholm", "comment_text": "This sounds great! We wanted to go there but with three cities it seemed like we couldn’t fit it in with the train time. Now we could leave Rome with baggage, store near Pompeii, and take a train to Florence at the end of the day. So far no trains are listed and we go in September. It still might be too much depending on the trip back and to Florence but I would love to fit that in if we can store luggage."}, {"username": "Lynne Sutton", "comment_text": "Sue San Rebecca Lowry"}, {"username": "Stephanie Osborn Rushing", "comment_text": "This is the best news as we are planning to leave Rome to Pompeii on August 7!"}, {"username": "Stephanie Osborn Rushing", "comment_text": "Although I’m not seeing it as an option to book in advance…🤔"}, {"username": "Stephanie Osborn Rushing", "comment_text": "Oh, it’s only on sundays, bummer"}]}, {"id": "2196778364054575", "text": "Hey guys, my flight will land at Fiumicino airport at 00:20, and I just realized that the shuttle bus and train both won't be operating at that time! Do I have any other options? I want to go to Roma Termini", "link": "facebook.com/groups/1373361046396315/permalink/2196778364054575/", "likes": 0, "comments": [{"username": "Cecilia Christine Costantini", "comment_text": "https://\nwww.tambus.it/\nroma-fiumicino/ it runs until 2.30am"}]}, {"id": "2196781970720881", "text": "My daughter just got engaged and they are considering getting married in Italy. We are from the U.S. and are looking for venues that affordable yet breathtaking. Open to all areas. Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2196781970720881/", "likes": 0, "comments": [{"username": "Alice Francesca", "comment_text": "Check Hotel Chiostro di Pienza in Tuscany.As beautiful as you can imagine (former convent from the 1500's), Italian garden, restaurant and pool."}, {"username": "Alice Francesca", "comment_text": "My sister got married here!"}]}, {"id": "2196785170720561", "text": "So who was in Taormina yesterday and witnessed the most amazing wedding take place. Oh my gosh. Amazing.", "link": "facebook.com/groups/1373361046396315/permalink/2196785170720561/", "likes": 0, "comments": []}, {"id": "2196789560720122", "text": "Are backpacks permitted in the museums ?", "link": "facebook.com/groups/1373361046396315/permalink/2196789560720122/", "likes": 2, "comments": [{"username": "Brian Osman", "comment_text": "Yes, they prefer smaller ones"}, {"username": "Sara Beth", "comment_text": "Yes brought one in the other day. A smaller one."}, {"username": "Marissa McLean", "comment_text": "Some times, but it’s probably safer and more convenient to just check it - it’s usually free to do so 9x out of 10"}, {"username": "Dori Raddatz-Crolius", "comment_text": "You can get clear back packs on Amazon pretty inexpensive. That would probably work"}, {"username": "Sara Hackett", "comment_text": "I had a crossover one that was ok."}, {"username": "Nissa Nolan Foster", "comment_text": "Different museums have different rules. Rule of thumb is, if the museum has sculptures they will probably make you check your backpack."}, {"username": "Gillian O'Callaghan", "comment_text": "I always wear a small daypack. In some places you can but in others it goes intto a locker for which you have the key. Some places your bag gets scanned."}, {"username": "Carmen Rodriguez Boyd", "comment_text": "The Borghese Gallery in Rome was the only museum we encountered that was strict with bag sizes. But they had a bag/coat closet, so it was all good."}, {"username": "ארז בן טובים", "comment_text": "Bottom line: even the few who dont let you in with a backpack, has lockers where you can store them for the visit. No worries."}]}, {"id": "2196785350720543", "text": "Considering traveling from Tuscany area outside of Florence (with a car) to Cinque Terre with 2 young kids. Will need to ditch the car at some point. Tell me everything I need to know! Easiest place to catch the train? Town to stay for the best sites for kids? Things to do with kids? Thank you in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2196785350720543/", "likes": 2, "comments": []}]