[{"id": "2205042309894847", "text": "How hard is it to get to and from Burano? Is a Venice city pass enough?", "link": "facebook.com/groups/1373361046396315/permalink/2205042309894847/", "likes": 1, "comments": [{"username": "Gwen Cooke", "comment_text": "It’s not hard at all … just jump on a vaperetto … wait an hour and there you are … just be mindful the vaperetto times to and from Burano are not very frequent … I’m not sure what a city pass is so can’t comment on that sorry"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.viator.com/\ntours/Venice/\nMurano-Glass-and\n-Burano-Lace-To\nur-from-Venice/\nd522-3731MURANO?\npid=P00070587&m\ncid=42383&mediu\nm=link&medium_v\nersion=selector"}, {"username": "Vero N Ferny", "comment_text": "Jump on a small boat easy peasy!!!!"}]}, {"id": "2205045676561177", "text": "Hello, is there an overnight train from Paris to Venice? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2205045676561177/", "likes": 0, "comments": [{"username": "Tania Lediard", "comment_text": "There used to be. I believe it was discontinued. Check the website seat61. It should have more details."}, {"username": "Donna Gilardone Szwabowski", "comment_text": "It’s from Milano Centrale"}]}, {"id": "2205060649893013", "text": "Hey everyone!! Is there any hidden gems amongs the Amalfi coast that we should go to in September ? Any nice walks, or places of the beaten track? Also any nice beaches or places to rock jump? We will be there 11-16th September so will everything be open still? Also sorry for more questions but what’s the weather usually like temp wise at that time 🙂 thank you!!", "link": "facebook.com/groups/1373361046396315/permalink/2205060649893013/", "likes": 0, "comments": []}, {"id": "2205060703226341", "text": "Do anyone know if your late due to your flight and don’t make to your hotel will they cancel the rest of your stay in Rome .", "link": "facebook.com/groups/1373361046396315/permalink/2205060703226341/", "likes": 2, "comments": [{"username": "Romana Svítková", "comment_text": "This is hardly an Italy specific question, best ask the hotel."}, {"username": "Melanie Matthews Stuprich", "comment_text": "I would just contact the hotel and let them know you will be late and I’m sure they will be fine with it all but just don’t expect a refund since it’s not their problem."}, {"username": "Carol Johnson", "comment_text": "All Hotel have different rule .. I would call the hotel + make sure you get the person name date and time .. communicate is the keys"}, {"username": "Janine Emma Lucas", "comment_text": "Call if your flight get changed"}, {"username": "Katarzyna Marczewska", "comment_text": "I always split my stay and separate first night after landing . No issue if I am late - just one night lost"}]}, {"id": "2204785179920560", "text": "Hi, just looking for suggestions for sneakers / footware( Australian) for walking Italy. I’d love some all white ideas as I want to have the option to wear with skirts and dresses as well as shorts. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2204785179920560/", "likes": 53, "comments": [{"username": "Kath Jurewicz", "comment_text": "Frankie 4 best shoes ever made in Australia 🇦🇺"}, {"username": "Charlotte Perry Henrichs", "comment_text": "Keen"}, {"username": "Autumn Barber", "comment_text": "I refuse to wear tennis shoes-but it’s just me. I like to appear more stylish…lol. These are my Sofft and Bionica shoes that are both super comfy"}, {"username": "Jennifer Smith Ravanesi", "comment_text": "Oofos has an all white slip on sneaker option and they are AMAZING"}, {"username": "Suzanne Kay Schonfeld", "comment_text": "Love my Birkenstock sneakers!"}, {"username": "Irene Zugaro Mancusina", "comment_text": "Asics are meant to be the best for feet, even my podiatrist thinks they’re great. I walked in leather Superga sneakers but my right dodgy foot still isn’t happy after our 14km walk around Rome last September 🤦🏻‍♀️"}, {"username": "Tina Jaime Pirlott", "comment_text": "These were recommended as well by someone."}, {"username": "Kathy Korody Artuso", "comment_text": "Kizik! Most comfortable sneaker I’ve EVER worn!"}, {"username": "Michelle LaMantea Talbot", "comment_text": "I love my Skeechers. Last time I wore their Go Walks in wide and did many miles a day and they never hurt. I also love my Birkenstocks and got tennis shoes from them that are comfy. Recently I bought Birkenstock inserts and they make any shoe perfect"}, {"username": "Karin Hoffner Gilbert", "comment_text": "On cloud 5. Beautiful shoes, just got them for my trip next month"}, {"username": "Mary Gregory", "comment_text": "Sneakers 👟"}, {"username": "Rosemary Giuffre", "comment_text": "Hokas"}, {"username": "Bernadette Di-Filippo", "comment_text": "Try them on in store, walk around a bit. Everyone’s arch is different and you need to find a brand that’s right for you. But definitely get one with arch support and a good thick, solid sole for the walking! Wear them at home for a few weeks before you leave. Australia sells leading podiatrist brand shoes. I bought Taos, but I was hoping to find Vionic but could only get online."}, {"username": "Lynn Conklin Olson", "comment_text": "I mostly wore white sketchers last month. They were very comfortable. I had white Nikes, but they hurt my feet."}, {"username": "Jim Masiongale", "comment_text": "Just booked a private driver from VCE airport to hotel. It appears it’s through Luxer. Our trip is in August. Are these reliable companies?\nThanks"}, {"username": "Karen Watling", "comment_text": "It’s hot in sneakers, walking sandals would be good to have"}, {"username": "Jan Seeho", "comment_text": "Australian travelling to Italy in October. I bought white Ecco leather shoes, have been wearing them and they are super comfortable and supportive. Highly recommended 🤩"}, {"username": "Vicki Barr", "comment_text": "To be honest .. I walked all over Italy in my Birkenstocks ..\nthey were the light ones .. I get hot feet in sneakers .."}, {"username": "Maria Musumeci", "comment_text": "I purchased & wore these Skechers in 2022. They're leather upper with supersoft sole. They were so comfortable & looked great!"}, {"username": "Eileen Muro", "comment_text": "I wore Sketchers shoes. But these Sketchers sandals were my favorite. Very comfortable and can be worn with shorts or a dress/skirt."}, {"username": "Belinda Page", "comment_text": "Geox"}, {"username": "Susan Smit", "comment_text": "I too, love my Frankie 4s. I can wear them all day, on my feet and walking without any issue."}, {"username": "Mary Palazzolo", "comment_text": "Wear anything that is comfortable for you no one is judging."}, {"username": "Tania Gemma", "comment_text": "I wore Vejas and they were great"}, {"username": "Danielle Chipchase", "comment_text": "Rollies 👌 I lived in mine on our 5.5 week trip and they didn’t disappoint! They are super light, comfortable and super cute 😊"}, {"username": "Joyce Vastola", "comment_text": "Hoka"}, {"username": "Cindy Wesely", "comment_text": "What about Birkenstock sandals?"}, {"username": "Llou Mari", "comment_text": "Ascent Stratus (Womens)"}, {"username": "Georgina Curr", "comment_text": "Visit a good shoe store and get fitted. Wide fittings easier these days. Take your time to try several and get good socks! I bought Ecco leather shoes, comfy as from first day. Compression socks recommended to me. $30 a pair!! I know! But they really make a difference….👟👟👟"}, {"username": "Cynthia King", "comment_text": "I have limited options because I need the shoe to have wide toe box. Allbirds tree dash 2 is light weight with great support (I wear with custom orthotics). The days I wore Allbirds all day while in Paris and Italy, no pain or tired feet. The 2 days I wore Taos white leather sneaker (which has been comfortable when I wear them at home), had tired feet and pain by late afternoon, not able to endure 18-20k steps. Allbirds 👍👍"}, {"username": "Marlene Norris", "comment_text": "Sketchers stand on air. Look great and so comfortable, I averaged 20,000 per day last year in Italy and will be wearing them again when we go next week. 😊"}, {"username": "Marina Rosa Moni", "comment_text": "Fila disruptor"}, {"username": "Miranda Cifelli", "comment_text": "Buy them there it’s cheaper"}, {"username": "Claudia Lanni", "comment_text": "On runner's, they were Fantastic!"}, {"username": "Irene Deacon", "comment_text": "Sneakers with a zip are great for quick removal. Merrill and Vionic for walking sandals."}, {"username": "Yvette Khoury", "comment_text": "Wow"}, {"username": "Kylie Pritchard", "comment_text": "I just wore these New Balances for 3 months and they were fabulous. I’m normally a hoka girl but can’t fault these. Plus light and easy to wash."}, {"username": "Jo Jacobsen", "comment_text": "Frankie4 ❤️"}, {"username": "Gianna Onesi", "comment_text": "Brooks"}, {"username": "Tiffany Guido", "comment_text": "Oofos"}, {"username": "Tim Nerida Cottrell", "comment_text": "Thank you everyone for your contributions, very helpful. Now to quickly buy and wear some in before we go beginning of sept ."}, {"username": "Kate Bryant", "comment_text": "Frankie 4!"}, {"username": "Maree Marchant", "comment_text": "Swear by Frankie 4 I wear Nat have walked all over Europe in them lots of colours to choose from"}, {"username": "Maria Coladangelo Ducca", "comment_text": "Try Vionic"}, {"username": "Kelly Jones", "comment_text": "Crocs sandals - I just did miles in them in Amalfi rome Sicily"}, {"username": "Jo McManus", "comment_text": "Skechers Slip ins. So comfortable, light as a feather and the come in white"}, {"username": "Dori Sze Lok", "comment_text": "Greats. Italian made. Leather foot bed so you can also wear without socks. I wore mine all over Italy."}, {"username": "Annie T Lugg", "comment_text": "I wear Hoka Bondi for work. A nurse with Rheu Arthritis. Have just bought Clifton 9 and love them. Trendy. Comfy and the beige colour. Set to walk the streets of Italy. Also have a pair of Teva sandals. Ugly but soooo.comfy and can fo into the water 💧 See you all there in August September. From.Qld."}, {"username": "Dayna Moritz Zavone", "comment_text": "I was recommended that I purchase Ecco shoes and they were fabulous! Very comfortable and supportive. I had originally planned to wear Converse but you really need lots of cushioning for the cobblestones and lots (and lots) of walking."}, {"username": "Rachael Ann", "comment_text": "Frankie 4- we just returned and they were fab!"}, {"username": "Jean Monteforte Capuano", "comment_text": "Shoes were my biggest stress when I was packing for Italy recently. I’ve had surgery on both of my feet and I tried on quite a few pair before settling on the following. We walked 20,000+ steps a day. I brought 3 pairs of shoes and didn’t have any pain or issues:\n\nBrooks Ghost sneakers. I got ones that were mostly white and looked cute with my dresses.\nDansko Racquel sandal in white (these made for great water shoes on Capri)\nCrocs “dress” sandals that I walked in too (pictured)"}, {"username": "Tracey Jenkins Little", "comment_text": "I wore my On Cloudnova forms most days, they were great!"}, {"username": "Andrea Zulch", "comment_text": "Wow great to see you on this site. We will be there in mid September!"}, {"username": "Pamela Timby-Straitiff", "comment_text": "I just got a pair of Dolce Vita to test out before our trip in October. So far I love them!!"}, {"username": "Helen Ewing", "comment_text": "On previous trips I've worn hoka, Ecco, sketchers and new balance, all great, but my absolute favourite was Allbirds I wore on my most recent trip."}, {"username": "Silvia Bucci", "comment_text": "Little advice: if you are not an usual walker, every shoe you buy, don't use it for the first time in Italy in a 10km walking...use it at home for some hour before!"}, {"username": "Debbie Chojnacki", "comment_text": "Look at Midas shoes"}, {"username": "Donna Dougherty", "comment_text": "Sorel"}, {"username": "Helen Rosenberg", "comment_text": "White Hokas"}, {"username": "Angie KD", "comment_text": "Skechers gowalk. Soooo comfortable"}, {"username": "Trish Dooley Thorp", "comment_text": "I wore Ascent Stratus available from Athletes foot. They are really comfortable. They are available in a range of colours. Cost $190."}, {"username": "Cat Furness", "comment_text": "I have just spent 3 months in Italy and wore my Skechers go runs. So comfy and all white!!"}, {"username": "Cate Neil", "comment_text": "All great suggestions - but you need to try them out before you go.\nI had 3 pairs of runners that I rotated as my feet are fussy - NB, Hoka & Asics- & silver Birks for after all the walking 😀. I used them all.\n\nWhite runners go with everything.\n\nI think there are so really good sandals, for walking, too. teva are great."}, {"username": "Linda Spiers", "comment_text": "Frankie 4 Mim 3 are great! Planning to wear mine there in September"}, {"username": "Reese Colmenares", "comment_text": "I wore the Hoka Bondi 8 and tge Feetures compression socks. Really good"}, {"username": "Christine Broussard", "comment_text": "Sketchers as so easy to get in Oz and so many styles and colours now"}, {"username": "Mandy Spiers", "comment_text": "I bought sketchers, super comfy and easy to wash and quick dry"}, {"username": "Sara Bee", "comment_text": "I went to Italy and I came back to australia with a suitcase of shoes. Next year I’ll go barefoot and buy there directly. 😝"}, {"username": "Fiona Rieger", "comment_text": "I’ve got problem feet and have just bought Bared Whimbrel that fit my orthotics . I’ll be wearing them on the plane as they would add a bit of weight to my coo luggage. Very supportive shoes and we plan to do lots of walking"}, {"username": "Lynette Lewis", "comment_text": "Anyone know if you can get Frankie 4 in UK? Thanks"}, {"username": "Lisa Nordby Robilliard", "comment_text": "If you have wide feet Ziera are great, if not the world is your oyster."}, {"username": "Sherrin Wake Bracci", "comment_text": "Aussie here too. Hubby and I have bought new sketches walkers to take to Italy. Super light and comfy."}, {"username": "Kellee Fullerton", "comment_text": "Great question! I’m keen to know also 👍"}, {"username": "Jackie Southwell-Hall", "comment_text": "I have the Teva Tirra lovely supported walking sandals"}, {"username": "Gayle Hogg", "comment_text": "Frankie 4 or Hoka"}, {"username": "Maryanne Battistone", "comment_text": "Atoms are great"}, {"username": "Jo Morgan", "comment_text": "I have just come back from Italy and I lived in these the whole time I was there"}, {"username": "Dawn King", "comment_text": "I bought some Nike white runners. They are like slippers."}, {"username": "Elizabeth Rocka", "comment_text": "Hi There. Occupying my thoughts a lot too ahead of trip. Springcourt in Sydney or quick delivery out of Melbs is my choice for travel and blending with dresses. Canvas ones or the leather. They fit my slender orthotics and my podiatrist likes them (structurally).\nThey’re basically French, Dunlop Volleys but extra comfy. Maybe not as comfortable as the more athletic sneakers but a good compromise."}, {"username": "Mandy Tiffen", "comment_text": "Kiwi here - I've got some Teva Tirra sandals & Skechers Go Walk sneakers. Super comfy!"}, {"username": "Lori Greco", "comment_text": "If you haven't worn BARED before, I advise AGAINST them. They are so heavy. I tried 10 pairs and went them all back"}, {"username": "Tracy Sachse", "comment_text": "Hokas"}, {"username": "MarkKaren Packard", "comment_text": "I use a pair of Tommy Hilfiger white leather ones"}, {"username": "Alice Byrne", "comment_text": "I’m here currently and bought a pair from ECCO and they’re very comfy!"}, {"username": "Margaret Minicozzi", "comment_text": "Sketches"}, {"username": "Tanya Cutri", "comment_text": "These are available at Athletes Foot and look great with pants, shorts, skirts & dresses"}, {"username": "Maryann Dedden", "comment_text": "Ascent brand from the Athletes foot- Style Stratus all white, comfortable and look good. I’m a Podiatrist and have most brands in my cupboard but these shoe are my favourite"}, {"username": "Maria Grazia Rizza Costanzo", "comment_text": "I’ve got 3 pairs of FRANKiE4. The most comfortable walking shoe for me"}, {"username": "Kathy Gaynor-Sloan", "comment_text": "Bared"}, {"username": "Lisa Peatfield", "comment_text": "Planet shoes are the best, I suffer with plantar fasciitis but not when I wear them"}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "I wore Ryka sneakers all over Italy. Extremely comfortable for the many miles put on daily."}, {"username": "Lee-Ann Paterson", "comment_text": "Frankie 4’s, this is my 3rd trip wearing them."}, {"username": "Khanh Pham", "comment_text": "Cole Haan has some of the most comfortable walking shoes that can be smartly worn. Their price points are not ridiculous, and many styles don't look like sneakers. Not sure which models you have in Oz. I wore Cole Haans everyday getting to and from work & home. +10k / San Francisco hills. Have a blast in Italy!"}, {"username": "Rosslyn Patience", "comment_text": "Ecco."}, {"username": "Suzanne O'Connor", "comment_text": "Frankie 4 so comfortable"}, {"username": "Fatima Oliveira", "comment_text": "Frankie4 for me too 👍.\nMaybe hokka as a second pair"}, {"username": "Vanessa Durkin", "comment_text": "Try Toms they are really so comfortable feel luke gloves on your feet do variety of colours so can wear with dresses skirts capri pants or jeans and look very nice.i bought three pairs different colours i also bought some white nike trainers very comfy especially for walking over uneven surfaces or cobbles have fun"}, {"username": "Mary Collins", "comment_text": "White SuperGa and look like a local!"}, {"username": "Lauren Vassallo Beattie", "comment_text": "I wore asics"}, {"username": "Simone Fiebig", "comment_text": "Keds"}, {"username": "Gena Kona-Mancini", "comment_text": "Vessi!"}, {"username": "Jennifer Irene", "comment_text": "Frankie4 or Bared. Both are Australian podiatrist designed shoe companies that sell fashionable styles.\nLoved by teachers and nurses all over Australia!\nThey are expensive but worth it. I have 3 pairs of hornbills from Bared and 2 pairs of Frankie4's\nI prefer Bared and wear them almost exclusively (teacher). Both have very active BS&S FB groups where you could trial a pair cheaper than buying new. Both have a few shops in capital cities.\nHere is a blog post where they highlight best sneakers for holidays:\nhttps://\nbaredfootwear.co\nm/au/articles/\ntop-five-sneaker\ns-to-take-on-ho\nliday"}, {"username": "Toby Levy", "comment_text": "I walked (heaps) for 3 weeks in Italy in a pair of new balance all white during the day and a pair of vejas at night."}, {"username": "Jacki Cincotta", "comment_text": "Frankie 4"}, {"username": "Lesley Roser", "comment_text": "Can’t go past Merrills footwear they come in joggers and sandals as well.\nI found them comfortable and great on cobblestones. I now wear them for work. Highly recommend"}, {"username": "Yhele Apidga", "comment_text": "Vessi the best"}, {"username": "Simone Gore", "comment_text": "Where do you get Frankie 4 from"}, {"username": "Jodie Grzeschka", "comment_text": "I lived in Frankie 4 and Birks."}, {"username": "Michelle Prince", "comment_text": "I brought 2 pairs of white sketchers most comfortably trainers to walk around in every day"}, {"username": "Nicola O' Malley", "comment_text": "Hokas"}, {"username": "Nicole Bellato", "comment_text": "Frankie 4s. Can’t get any better!"}, {"username": "Nicole Ferraro", "comment_text": "Emilia Jolakoska"}, {"username": "Rebecca Purdy", "comment_text": "Frankie’s wore them everywhere!"}, {"username": "Dale Noro", "comment_text": "Sketchers we have been twice and wore them 8 weeks first time 10 weeks 2nd time can't go past any foot wear from sketchers all comfortable ."}, {"username": "Kim Seibert", "comment_text": "M. Gemi. Wore every day for two weeks in Italy. Very comfortable"}, {"username": "Noelene Cameron", "comment_text": "I have been a fan of Frankie 4 for years but when in London recently I bought a pair of Ecco leather walking shoes and I am now a convert. They are the most comfortable walking shoes I have ever worn. No rubbing, red or hotspots from day 1.\nI walked cobblestone streets in Italy, France, Croatia, Montenegro, Croatia and more!\nComfort plus +++++"}, {"username": "Trish Dooley Thorp", "comment_text": "I wore Ascent Stratus for four weeks of travel. They were so comfortable. I bought them through Athletes Foot online. They have a selection of colours , cost $189:99"}, {"username": "Heather Stokes", "comment_text": "Heather Stokes"}, {"username": "Nóra Fonyogábné Zsebeházy", "comment_text": "I am a Skechers fan. Wear whatever is comfortable for you (but NOT Flipflops as they do not hold your feet/ancle in a proper way)"}, {"username": "Nóra Fonyogábné Zsebeházy", "comment_text": "Nóra Fonyogábné Zsebeházy"}]}, {"id": "2204786413253770", "text": "Fishing recommendations in cinque terre or the Amalfi coast ?", "link": "facebook.com/groups/1373361046396315/permalink/2204786413253770/", "likes": 1, "comments": [{"username": "Ville Lignell", "comment_text": "5 Terre: https://\nwww.monterossope\nscaturismo.org/\nenglish/"}]}, {"id": "2204787089920369", "text": "Hello. Anybody stay at Hilton Molino Stucky in Venice. Proms and cons please. Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2204787089920369/", "likes": 1, "comments": [{"username": "Jholyne Egerton", "comment_text": "Up"}]}, {"id": "2204787823253629", "text": "New to group and first time posting so during the next couple of months, I’ll be looking for information! Thank you all in advance. Going to Rome and Florence, the end of November beginning of December and looking for something different to do. Would love to go to speakeasy. Any suggestions?", "link": "facebook.com/groups/1373361046396315/permalink/2204787823253629/", "likes": 1, "comments": [{"username": "Alessandro Iannelli", "comment_text": "\"speakeasy\" as in one of those bars that recreate the atmosphere of speakeasies during u.s. prohibitionism?\nif that's the case, this article lists 6 of them in rome, with a brief description, it's in italian but you know, google translate. https://\nwww.gamberorosso\n.it/notizie/\nspeakeasy-roma/"}]}, {"id": "2204791179919960", "text": "For those travelers r carrying only person item and carry on, how do you do when you want to shop and there’s no room to put in your luggage? Do you ship those items? Which company do you use for shipping to US? Thanks for any suggestions. 🙏", "link": "facebook.com/groups/1373361046396315/permalink/2204791179919960/", "likes": 10, "comments": [{"username": "Jayne Dawson Meyer", "comment_text": "You can ship it or buy another back pack or suitcase anywhere . Take it with you. Places all over including street markets to get these.\nHave fun, dont stress & just enjoy😊😊😊"}, {"username": "Elaine King", "comment_text": "Take a duffle bag in your carry on,"}, {"username": "Marissa McLean", "comment_text": "Lots of stores that sell specialty goods - for example the glass in murano - will ship items home for you. I would NOT suggest using postitalien because it’s very expensive and also very unreliable, DHL/UPS is better. Or you can get a box and just fill it with your stuff and check that onto your flight, might be even cheaper"}, {"username": "Suzie LG", "comment_text": "We bought a medium sized suitcase in Venice towards the end of our trip, filled it with clothes and checked the bag. We put all of our valuables and gifts in our carry on luggage."}, {"username": "Jess Galasso", "comment_text": "Carry a collapsible duffle or buy a suitcase and check a bag home."}, {"username": "Alexandra A Welker", "comment_text": "Bring a collapsible duffle bag or buy another suitcase."}, {"username": "Sandi Van", "comment_text": "I put a duffle bag in my carry on so later shopping items will go in the suitcase and clothes into the duffle lol"}, {"username": "Jenny Payne", "comment_text": "Go to the post office and send your used clothing bk home, take your own tape + black maker as they don’t secure them very well . They use boxes"}, {"username": "Kathy Tully Sexton", "comment_text": "We travel with two backpacks and one hard sided case with an empty duffel in the luggage. On the way home it gets filled with the clothes, our backpacks and the stuff we have accumulated along the way goes in the hard sided luggage for protection"}, {"username": "Heather Sechrist", "comment_text": "Packed a duffel inside carry on."}, {"username": "Jennifer Walp Rydholm", "comment_text": "We take two backpack carryons with everything we really need and check one bag that we put a duffel in. If it is lost, we are still ok. But it is not that full going over and we can check two bags going back. So we often put some souvenirs in our carryons and clothes etc in the checked bag. But it gives us a lot of space."}, {"username": "Robyn Mosca Kingston", "comment_text": "I purchased a longchamp bag (on sale) before we left…it folds up very small and easy to pack. It opens to a large “travel bag”. I’ll check my luggage on the way home."}, {"username": "Tara McCloud Odebrecht", "comment_text": "Foldable duffles are great for that."}, {"username": "Ken Lerch", "comment_text": "We routinely travel for 1-2 months at a time, once or twice a year. We also routinely plan and budget to ship since we try to travel never carrying more than 1 med. suitcase and 1 small carry-on. We research options in the disembarking city. In travels in US, Canada, Alaska, we used postal service filling a box we bought there. In Athens we bought cheap duffel and had hotel arrange to send it. Several times in Tuscany and Rome found MBE or FedEx, packed a box and they shipped. Once a landlady sent us to a private handler who did all the packing and sent thru FedEx. We just returned from 6 weeks in 8 countries in Northern Europe, ending in Copenhagen where we used the postal service, giving them small duffel and small backpack we bought and had, and they boxed. For our next return trip to Italy we already know where and how we will ship. A little planning makes for much easier travel."}, {"username": "Jen Ashley", "comment_text": "Is being an extra empty duffel bag and check stuff on the way back."}, {"username": "Rosanne Addessi", "comment_text": "We bought an inexpensive suitecase while in Rome but since then I bought a Biaggi carry on bag that opens to a checked bag for the return trip. We used it in Portugual this year and It worked great!"}, {"username": "Wendy Spano Bracco", "comment_text": "A collapsible duffel."}, {"username": "Jade Stringer Alkire Wisecup", "comment_text": "We are allowed 1 under the plane bag but are only bringing carry ones and going to pack very minimal, if we purchase too much we will purchase something to put under the plane on the way home. We don’t want to deal with to much during the time there."}, {"username": "Vicki Churik Williams", "comment_text": "Buy another bag and check it."}, {"username": "Kaci Butland", "comment_text": "Collapsable duffel bag that I stuff my dirty laundry in and check. I use my suitcase for purchases 😊"}, {"username": "Tara Roed", "comment_text": "I had a bag folded up in my luggage that was a decent size for what I was buying. We also shipped ceramics home. The place offered that service."}, {"username": "Dave Colleen", "comment_text": "We packed our clothes in backpacks and took two empty suitcases for souvineers. We had one free luggage check each. Figured if they lost the empty luggage on the way to Italy, no big deal. Our hotel in Venice offered to hold our luggae until we returned in two weeks. We started and ened in Venice."}, {"username": "Cynthia Marie", "comment_text": "We wear clothes we no longer want and donate at the end of our trip. Leaving us with empty suitcases to fill."}, {"username": "Stephanie J Stevenson", "comment_text": "We don’t buy much when we travel. Go to any thrift store and it is filled with souvenirs people brought home from their trips and later discarded. Nothing wrong with that, just decided it wasn’t for us anymore. Happy travels."}, {"username": "Gretchen Abee Rombold", "comment_text": "I took an expandable tote in my suitcase. I also took compression bags that I squeezed most of my clothes in on the way home for space."}, {"username": "Greg Transue", "comment_text": "We buy a extra suitcase over there."}, {"username": "Bea Kuckens", "comment_text": "We have rules about souvenirs: They either have to be flat and flexible (eg. fabric) or small enough to fit inside my husband's extra pair of size 12 shoes🤣"}, {"username": "Lynette Räfsbäck", "comment_text": "I save memories and photos.. if really \"must have\" a souvenir I buy a fridge magnet or postcard. Within Europe I travel economy light which is 8 kg carry on.\nJust wondering: what do you all do with the stuff you bring home?"}]}, {"id": "2204799239919154", "text": "Train question, if you were to buy a train ticket from say Rome to Florence can u get off at other points in between and later in day get back on and continue to Florence? Or is it better to buy point to point or multi pass?", "link": "facebook.com/groups/1373361046396315/permalink/2204799239919154/", "likes": 1, "comments": [{"username": "Brenno Bianchi", "comment_text": "No, you can't; also high speed trains don't have any stop between Rome and Florence (sometimes they don't even stop in Florence)"}, {"username": "Luca George Tudor", "comment_text": "No, you have to stamp the ticket before getting on the train and it will be valid only for some time after the stamp according to the distance… so a few hours or so"}]}, {"id": "2204802863252125", "text": "Favorite hotels in Rome near/in city center for 3 adults? We like nice places! First time in Rome…Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2204802863252125/", "likes": 0, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.tkqlhce.com/\nclick-100692842-\n12291623?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.it\n%2FHotel_Review\n-g187791-d17506\n625-Reviews-NH_\nCollection_Roma\n_Fori_Imperiali\n-Rome_Lazio.htm\nl"}]}, {"id": "2204802999918778", "text": "Does anyone on here have experience using a luggage storage place in Rome? If so, was it a good experience and who would you recommend?", "link": "facebook.com/groups/1373361046396315/permalink/2204802999918778/", "likes": 1, "comments": []}, {"id": "2204806533251758", "text": "I have found a tour I want through tiqets.com. Has anyone used the site. Is it trust worthy?", "link": "facebook.com/groups/1373361046396315/permalink/2204806533251758/", "likes": 1, "comments": [{"username": "Karen Blackmore", "comment_text": "We used Tiqets for St Peter's Basilica dome tour and it was great. The guide was very good, lots of helpful Rome tips too. Also bought museum entry on there. No problems at all."}, {"username": "Victoria Laverty", "comment_text": "Yes no probs"}]}, {"id": "2204806033251808", "text": "Has anyone traveled to Italy with Kensington Tours? How was your experience? We are considering the Best of Rome, Florence and Venice 9 day tour.", "link": "facebook.com/groups/1373361046396315/permalink/2204806033251808/", "likes": 0, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2204807476584997", "text": "My friends and I are going to Italy in October, flying in and out of Rome. Our stops are Sorrento 3 nights, Florence 4 nights, and Rome 3 nights. I want to start off in Sorrento, then Florence, then finish in Rome. Since we are flying out from Rome, I thought it would utilize our time best by doing it that way. We only have one layover in the USआणखी before we fly direct to Rome. Our arrival flight gets in around 8am, and I was wanting to jump on the high speed train straight to Naples, and then catch a ferry over to Sorrento. Has anyone done this? Is this idea reasonable? Is there a high speed train from the airport that goes direct to Naples, or do I need to go to Roma Termini station and take off from there?", "link": "facebook.com/groups/1373361046396315/permalink/2204807476584997/", "likes": 1, "comments": [{"username": "Jenny Payne", "comment_text": "You better check and see if ferries are still operating as it will depend on the weather🌻"}, {"username": "Rita Scotto Epifanio", "comment_text": "There’s a train from the airport in Rome called the Leonardo davinci that will take you straight to Roma Termini where you can take the high speed train to Naples."}, {"username": "Gena Kona-Mancini", "comment_text": "I did the train from Naples to Sorrento. But we were staying in piano di Sorrento. I would check wherever you're staying and if you are near the port. We were charged €20 for a 1.7km taxi ride to the train station from where we are staying. That being said, the ferry made me a bit nauseous so that's why I decided on thr train, but also, the train can be packed and you may have to stand for an hour. If you take the train an option is taking the Campagnia Express which is more expensive but they were nicer trains and it looked like they were mostly empty. You need to ask for it at the ticket counter because they don't offer it unless you ask!"}, {"username": "Elaine M Woodward", "comment_text": "What airport in USA do you fly out of?"}, {"username": "Valerie Collanton", "comment_text": "Ferries from Naples to Sorrento will be running in October. Pretty sure they run year round. You can take a train to Sorrento from the Naples train station which would save you the taxi ride to the port to catch the ferry. If you do take the ferry, once you get to Sorrento there is a lift that takes you to the main square. Or you can get a taxi to your hotel if it is not walking distance from the square. I prefer the ferry to Sorrento than the train. But I took the Circumvesuviana\n— which is like a NYC subway with no room for luggage. I have not taken the Campania Express so I can’t comment on how that one is."}, {"username": "Miyuki Kanno Paul", "comment_text": "I’ve done it many times. In fact I did it all the way to Ischia just 3 months ago. If high speed train is available from FCO, that will be fabulous. If not, take Leonardo Express to Roma Termini first, then take either Frecciarossa or Italo to Napoli Centrale. Purchase your train tickets all the way to Napoli Centrale at either ticket booth or vending machine. Once you arrive at Napoli Centrale, you take either shuttle bus or taxi to Molobeverello port. Purchase your ferry ticket(for you and your luggage separately)."}, {"username": "Diane Rogers-Gajewski", "comment_text": "Did you look into a multi city flight? We are flying into Naples and out of Venice. It will save you a train trip if you could book it that way."}, {"username": "Kathy Morra Kuloy", "comment_text": "We are going in October also and taking the flix Bus from Rome to Sorrento for $38. We found it better than making all those transportation changes."}, {"username": "Betty Stilt", "comment_text": "Can you arrive at Naples airport?"}]}, {"id": "2204812903251121", "text": "Any restaurant recommendations or advice while in Porto Ercole?", "link": "facebook.com/groups/1373361046396315/permalink/2204812903251121/", "likes": 0, "comments": [{"username": "Philip Curnow", "comment_text": "It's a small place. Just go and find somewhere when you arrive. The unknown is always more interesting."}]}, {"id": "2204813829917695", "text": "We will be at Lake Garda in September and I’m really struggling to decide where to stay. Any suggestions would be most welcome.", "link": "facebook.com/groups/1373361046396315/permalink/2204813829917695/", "likes": 3, "comments": [{"username": "Lyn Evans", "comment_text": "Malcesine is gorgeous and a bit quieter. Easy up to mt baldo on gondola and ferry to Limone and Riva del garda. Sirmione is gorgeous too but busier. Can get local bus to Verona from there. Also ferry to Bardolino and walk along lakeside stopping for a drink at a bar enroute to Garda. Ferry back to Sirmione after. Lake Garda is stunning!"}, {"username": "Karen Blackmore", "comment_text": "We stayed in Lazise, it's lovely. A long waterfront with lots of restaurants."}, {"username": "Maggie Lodge", "comment_text": "Garda Town easy to get to anywhere else by boat..Fabulous Restaurants..We\nhave just come back ..We are frequent visitors always stay in Garda ..Hotel Terminus recommended 👌 right on Lake Side..\nEnjoy"}, {"username": "Virgz Van Møøre", "comment_text": "If you travel by train : Peschiera is cuter than Desenzano"}, {"username": "Sandra Dyer Williams", "comment_text": "We stayed in beautiful Sirmione. It’s only a 35 minute transfer from Verona airport. We stayed in Hotel La Paul which is an easy stroll to the centre for everything. You can catch the ferries to Limone, Riva del Garda, Salo, and other places. Buses to Verona for the day etc as well as eat from a HUGE selection of beautiful restaurants with stunning lake views. Some are very affordable. There is a castle you can visit in Sirmione. Beautiful gardens a little beach.\nWe had 10 days there and loved every minute.\nHope you find somewhere and enjoy yourselves 🇮🇹♥️"}, {"username": "Sandra Dyer Williams", "comment_text": "The view from our bedroom window at Hotel La Paul. The staff are very friendly and helpful 🇮🇹♥️"}, {"username": "Michela Zanni", "comment_text": "Desenzano or Sirmione. From there you can have day trip by 'battello' to the other towns on the lake. From Desenzano you can take easily a train to Verona, Brescia, Venezia..."}, {"username": "Sam Downing", "comment_text": "Hi there. We love Lake Garda and go often. Whilst it’s not quintessential Italian style hotel, we absolutely love staying at Quellenhof Luxury Resorts the food, spa, facilities and service are second to none. Incredible place. Lazise is lovely and s great location for exploring the rest of the area"}, {"username": "Jenny Mueller", "comment_text": "First time for us in Lake Garda We stayed here very nice hotel - small pool but lovely chilled atmosphere . No queues for sunbeds and nice breakfast . Ferry for easy travel to Sirmione and rest of lake . Close to train station .\n\nhttps://\nwww.villarosades\nenzano.com/en"}, {"username": "Laura Pugsley", "comment_text": "I arrived back from lake Garda last night - absolutely stunning! We have 3 teenager daughters so based ourselves in Riva del Garda where there is loads to do and malcesine and limone were an easy ferry, bus or car ride away. We did a day south and visited sirmione which was absolutely beautiful but so crowded. If we returned I would stay here but only out of really high season so Sept you’d probably be ok. Easier for airport too if you’re flying into Verona! Have a great trip; it’s all so gorgeous you can’t really go wrong."}, {"username": "Meghan Lee", "comment_text": "Riva del Garda was lovely, can do a trip to the Cascade from here too"}, {"username": "Ana Ka", "comment_text": "We stayed at llac living hotel in limone sul garda and we absolutely loved it. It’s brand new, amazing pool area and gorgeous view! Oh and shuttle service to any restaurant nearby! I vote limone sul garda 💕"}, {"username": "Ana Ka", "comment_text": "Ana Ka"}, {"username": "Suzanne Sanderson", "comment_text": "We stayed peschiera del garda - Hotel Acquadolce, used the ferries to get around to all the different places on the lake."}, {"username": "Ryan Monahan", "comment_text": "We stayed in Sirmione in July, out at the tip of the peninsula. We loved it. We also visited Limone, Malceceni and Riva and they were all so beautiful. The towns further up the Lake were much quieter, since they are much farther to access by car. But staying in any of the towns it’s so easy to jump on the ferry and go to other towns."}, {"username": "Rachel Harper", "comment_text": "Garda Town you can walk to Bardolino along the Lakeside.\nMalcesine is very beautiful.\nI stayed in Limone in June it was stunning.\nI normally stay in Garda Town.\nEverywhere is beautiful on Lake Garda.\n💚🤍❤️"}, {"username": "Anita Clayton", "comment_text": "We loved Sirmione."}, {"username": "Sharon Woollgar Rabe", "comment_text": "Sharon Woollgar Rabe"}, {"username": "Fiona Mac", "comment_text": "Laura Murray Wilson any suggestions"}, {"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.dpbolvw.net/\nclick-100692842-\n12291623?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.it\n%2FHotel_Review\n-g187842-d23845\n8-Reviews-Hotel\n_Olivi_Spa_Natu\nral_Wellness-Si\nrmione_Province\n_of_Brescia_Lom\nbardy.html"}, {"username": "Laura Murray Wilson", "comment_text": "Pescheira Del Garda lovely x"}, {"username": "Zanna Darcy", "comment_text": "We loved Torbole and can't wait to go back"}, {"username": "Sandra Chambers", "comment_text": "We stay in peschiera del Garda a beautiful little village it has a train station where Verona is 20 minutes away and Venice is 1 hour away , there are buses that can take you everywhere else and are all very reasonably priced and very helpful drivers there is also a free bus to garda land which picks you up and drops you off at the train station you can also use the ferry which is a beautiful way to get around but expensive 80 euro + per person"}, {"username": "Silvia Par", "comment_text": "Sirmione!! Beautiful place."}, {"username": "Debbi Beston", "comment_text": "I always stay in Garda town. It has the bus terminal so easy to get on bus before they get too crowded. We usually get a bus to another town then the ferry back to cool down on the lake. Restaurant Al Porto in Garda is fabulous."}, {"username": "Denise Adams", "comment_text": "Stayed Riva, closer to mountains , trips into Dolomites were fab"}, {"username": "Carol Volpe Moriarty", "comment_text": "Sirmione!"}, {"username": "Susan Streed McNaughton", "comment_text": "Sirmione. Right on the lake. Take a day, drive all the way around the lake. Look into the rotating tram up the mountain. So worth it!"}]}, {"id": "2204817959917282", "text": "FYI……most pottery factories have retail shops and usually sell their seconds also. I bought many pieces 20 years ago. Most pieces I could not find why they were considered seconds.", "link": "facebook.com/groups/1373361046396315/permalink/2204817959917282/", "likes": 0, "comments": []}, {"id": "2204826719916406", "text": "We are flying Air Canada and Lufthansa to Rome from San Diego. I was going to carry on a small spinner and take my under the seat travel backpack. According to the airlines each bag can only weigh 8 lbs. My suitcase alone is 7 lbs empty!😂😂. Am I missing something? Feedback is appreciated.", "link": "facebook.com/groups/1373361046396315/permalink/2204826719916406/", "likes": 13, "comments": [{"username": "Grace Scinto", "comment_text": "You could go up to 8kg but I’m not sure if that’s 8kg total or each. Also if there are too many doing carryon they will check it in anyway."}, {"username": "Alessandro Iannelli", "comment_text": "You certainly have a heavy suitcase, maybe you could use a lighter one."}, {"username": "Amie M. Rossetti", "comment_text": "17.5 lbs is about 8kg"}, {"username": "Ruth Pellow", "comment_text": "8 kilos!"}, {"username": "Yvonne Ormson", "comment_text": "It’s 8 KGs! Only the US and maybe 2 other countries in the world use lbs.\nWe have ultralight carryon (under 2 kg) which really helps."}, {"username": "Alexandra A Welker", "comment_text": "Get the hard shell spinner, it's very light. Also, the weight should be 8kg not 8lbs, that's unheard of."}, {"username": "Leo Nekuda", "comment_text": "Its 8kg.We are in Europe now finishing tour of Italy.We flew with Air Canada to Frankfurt.We are family of 4.Each carry on and back pack.All carryons around 10 kg.I was a bit worried about the weight difference but absolutely no problem.Only problem was when we were boarding a smaller plane to Vienna. Our 2 oversized carryons would not fit the overhead storage.So they labeled it and took it down with large suitcases.Free of charge.So do not worry and enjoy your holday."}, {"username": "Suzie LG", "comment_text": "Air France (partners with Delta) allowed 40lbs. for a carry on"}, {"username": "Penny Van Boxtel", "comment_text": "Air Canada is definitely 8 KG(17.6 lbs)"}, {"username": "Maria Coladangelo Ducca", "comment_text": "Buy another light suitcase"}, {"username": "Lynette McKenzie Kalama", "comment_text": "I guess 17 lbs doesn’t seem like much but I am going to pack light but hmmmm…..has anyone used the travel backpacks and put under the seat?"}, {"username": "Melanie Fuger-Dolan", "comment_text": "Personally not understanding why everyone only want to travel with a carry-on. We just got home and each had a large checked baggage; one rolling one large duffle bag. We had no problem and had lots of room to bring home wine."}, {"username": "Billie Begley", "comment_text": "When we flew Air Canada and Lufthansa in September we printed off the restrictions with Air Canada. There is something. I think it was in codeshare where it states that your luggage restrictions are with the Originating Airline Ticket which was Air Canada. We were asked to check our Carry on in Frankfurt. It was only 20 pounds. We said no we were allowed due to the fact it is a code share and you go by the originating flight. She looked at it and told us to proceed."}, {"username": "Joy Wilkinson Huggins", "comment_text": "Lesson learned….avoid Lufthansa …a petty oversight bunch. 🤮"}, {"username": "Sheyla Brasil-Brydun", "comment_text": "We flew both of those airlines just a few weeks ago to and from Rome, they only weighed our carry on luggage and not our personal item/backpacks."}, {"username": "Kelly Siegmann", "comment_text": "It's 8 kg not 7 pounds. I just flew Lufthansa in May."}, {"username": "Debbi Mayfield", "comment_text": "So I’m guessing since it’s Lufstansa it’s in Kilos which means you have some wiggle room lol.\nI’d keep it to 17 pounds just to he safe. I travel with heavy medical equipment with case it’s 96-99 pounds depending on scale/\nairlines. If it goes over they charge (free since it’s medical). Just so if they are off from YOUR home scale you’re good"}, {"username": "Cathy Armstrong-Corsetti", "comment_text": "I am also flying Air Canada and the carry on has no weight restrictions hope this helps"}, {"username": "Theresa Bogda Steadman", "comment_text": "I have never seen carry on bags weighted? Am I missing something?"}, {"username": "Christine Pinto Kulp", "comment_text": "Are you sure they do t mean 8 kg (kilograms) not 8 lbs? Check again!"}, {"username": "Doris Harris Grotheer", "comment_text": "I looked online...you can have up to 8kg (which is 17.67 lbs) for your carryon. When we went in June I stressed over the weight etc. They never checked it...however, my son's spinner bag was a little over the size..(maybe half and inch or an inch at the most)...so they were going to gate check it. However, the flight attendant was gracious and said it would easily fit overhead and allowed him to keep it with him. We did check some luggage straight through and were blessed that they all arrived safely. Rome to Munich to Chicago to Joplin, MO."}, {"username": "Sarah Emerson Nelson", "comment_text": "I just got back from an Air Canada/\nLufthansa combo from Italy and weight was not an issue.\n\nHere's what the AC website says: no weight, just have to be able to lift it yourself:\n\nhttps://\nwww.aircanada.co\nm/ca/en/aco/\nhome/plan/\nbaggage/\ncarry-on.html#/\n\nI did not check the LA website, but maybe it's 10 kilos, not pounds? That was a limitation for me on smaller flights in Europe, but it didn't stop me... and boy was I glad I did carry on!!"}, {"username": "Adele Mirabelli", "comment_text": "I fly air Canada all the time. Checked luggage is 50 pounds. They have never weighed my carryon."}, {"username": "Michelle Dechene Black", "comment_text": "Can’t imagine. Air Canada has never weighed a carry on bag of mine. Nor have I ever had a carry on bag weighed by any other airline (West Jet, Delta, Cathay, Alaska) etc. No experience with Lufthansa. You’re carrying it, why should it matter to them. I would expect that weight is really only relevant in a small aircraft (single engine prop) that has weight restrictions, including passengers, to fly."}, {"username": "Renee Brezovsky", "comment_text": "I just traveled with my carry on, Lufthansa to Budapest, and back to Boston. I did my check in through the app, so I could bypass the counter when I arrived at the airport. They can’t weigh your bag at the gate. On my return connecting flight, they added a tag and stowed it as I got on, but got my bag immediately upon exiting the plane. My other 3 Lufthansa flights, my bag was with me. Over 8 kg."}, {"username": "Kimberly MacKinnon Cherry", "comment_text": "Most airlines have a 17 lb limit fir carry ons, except United is 50 lbs"}, {"username": "Alla Zats", "comment_text": "8 kg is the limit for carry on on Lufthansa which is about 18lbs"}, {"username": "Desiree Miller Kessel", "comment_text": "Our Lufthansa flight was cancelled. Put on condor airlines!! Had to spend five hours changing it. Be aware Lufthansa is known to cancel flights and use VERY low fare airlines"}, {"username": "Cristina Abreu De Zayas", "comment_text": "Are you sure it is 7 lbs? It might be 7 kg."}, {"username": "Rhonda Hope", "comment_text": "You need to start with a very light suitcase we do carry on all the time"}, {"username": "Lisa Adams Robertson", "comment_text": "Sure it's not 8kg?"}, {"username": "Helen Wake", "comment_text": "Was thinking 8kg too"}, {"username": "Rhona OConnor", "comment_text": "Yes.... Europe is metric so it's KG not LBS"}, {"username": "Jack Giacomo Avondo", "comment_text": "Please try purchasing a newer light weight bag, you will recover the cost over and over, from the extra weight you would have lugged around. From one of the millions of persons who regretted carrying even a kilo of extra unnecessary weight. Hope you have a fantastic trip either way"}]}, {"id": "2204834586582286", "text": "I am flying into Milan (BGY) airport and need to get to Lake Como (Varenna). What is the best way? The options I’m looking at say it takes 3+ hours to get there. We arrive at 3:20 on Ryanair. ( I’ve heard they typically run late.) i would like to get to Varenna before too late. I would appreciate any help. The trains are a bit confusing and it seems a private car would be expensive.", "link": "facebook.com/groups/1373361046396315/permalink/2204834586582286/", "likes": 0, "comments": [{"username": "Mike Guluk", "comment_text": "Ryanair typically runs on time.trains work renting a car is way more expensive, but will get you there much quicker. You also will hit traffic you will be in Milan at rush hour"}, {"username": "Michela Zanni", "comment_text": "Rent a car"}, {"username": "Karen Blackmore", "comment_text": "Milan BGY is Bergamo airport. Outside the terminal get the 1A bus to Bergamo station. Then regional train to Varenna. Need to change at Lecco. Use Trainline app to book just before you need. We often did it once at the station. Saves having to do any ticket validation. From Bergamo station to Varenna is about 1hr 20 mins."}, {"username": "Marija Gafa'", "comment_text": "I would get a bus from Bergamo airport to Milan centrale (there are several available outside of the airport), and then get a train from Milan centrale to Varenna"}, {"username": "Kay Rendall", "comment_text": "I am flying out Au today, end journey, flying Rome, Milan Linate.\nAsked my accom to organise taxi\nto pick me up. Less expensive than what transfer cos quoted.\nAfter 32 hrs travelling. Cost of taxi is not so important."}, {"username": "Victoria Laverty", "comment_text": "http://\nwww.lakecomotran\nsfers.com/\n\nAsk the transfer service quote very good reasonable"}, {"username": "Lauren-Jade Roberts", "comment_text": "Ryanair are almost never late."}, {"username": "Shane Macdonald", "comment_text": "Trains are good in Italy. Use the Trainline app as it also tracks the train and tells you the platform to wait at. You will need to get to bergamo train station first which is a short bus ride. It’s very simple, no need to pay way over the odds for a taxi"}, {"username": "Greg Saba", "comment_text": "Spend a night in beautiful and vibrant Bergamo and go to Varenna the next day."}, {"username": "Sheila Grant", "comment_text": "Take the bus to Bergamo and get off at train station! Short journey!\nTake train to Lecco takes around 50 mins .then take train to Varenna !It will be the train going to Tirano.\nTakes 15 mins . Dry doable."}, {"username": "Lean Ni Chleirigh", "comment_text": "I’ve been at two large family weddings in Varenna. Most people flew Ryanair and got the train from Milan and it was quite straight forward. Six years ago, we didn’t even book ahead, we just bought at the station. The train ride is completely beautiful.\nLast year my aunt got a private car and nearly missed her flight home because the driver got stuck in a ferry that was delayed getting to her."}, {"username": "Brian Osman", "comment_text": "Cab is about 120 euro"}, {"username": "June Quagliariello", "comment_text": "Cab"}, {"username": "Amy Schmelzle Walsh", "comment_text": "We took the train from Rome to Milan then taxi to Como--$160 euros trip took and hour and a half from Milan"}, {"username": "Annette Brin", "comment_text": "Ok - how it goes - u take bus or Taxi from BGY to main station in Bergamo. to save time I get a taxi it about 25 Euro. Bus can be full or fill fast. So taxi best IMO.\n\nFrom Main Station Bergamo to Lecco train- Lecco is Southern eastern leg of Lago di Como . Depending on train route u may switch trains or not and continue to Varenna- Esino station. It is NOT the final stop u get on train that end station is typically TIRANO. Cost about 40 USD with taxi and and 3 hrs. Private taxi 150 Euros or so and 1 hr 15 minutes more or less. No hassle. Time is money if u in a hurry."}, {"username": "Annette Brin", "comment_text": "I also ask what time of year? Also this is a time vs money vs hassle. Time is money especially if your time in Varenna is short."}, {"username": "Suzanne Spencer", "comment_text": "We are doing this in September and plan to catch either the train or bus from the airport to Milan then the train to Varenna we have bought our train tickets."}, {"username": "Larisa Layvant", "comment_text": "Trains are very easy not expensive run on time and cheap"}, {"username": "Glenn Todd Webb", "comment_text": "Rent a car so you won’t have to be dependent on public transportation after you arrive."}, {"username": "Ibbu Mohd", "comment_text": "Trenord -train goes directly to varenna from milan stations, or rent car its better."}, {"username": "Erin Mitchell", "comment_text": "I waited until I landed (MXP) to get a train because I didn’t know how long everything would take."}, {"username": "Pamela Heldenbrand", "comment_text": "https://\nwww.rome2rio.com\n/map/\nMilan-Bergamo-Ai\nrport-BGY/\nVarenna"}]}, {"id": "2204837746581970", "text": "Did any of you bought the Omnia or the Roma pass? Is it worth it if we are staying 3-4 days in Rome?", "link": "facebook.com/groups/1373361046396315/permalink/2204837746581970/", "likes": 0, "comments": [{"username": "Lauren-Jade Roberts", "comment_text": "We bought the Roma pass but only so we could get access to the colosseum through official channels. We did use the bus a few times and the metro but wouldn’t say it was worth the money other than what it saved us from having to buy a third party colosseum ticket"}]}, {"id": "2204839673248444", "text": "ISO Make-up Artist & Hair Stylist\n\nMy boyfriend and I have hired a professional photographer September 4th to take some engagement photos of us around the city. I am wanting to find someone to come to my hotel in the morning to do my hair and make up.\n\nAny suggestions?", "link": "facebook.com/groups/1373361046396315/permalink/2204839673248444/", "likes": 0, "comments": []}, {"id": "2204840103248401", "text": "Has anyone ever mailed their souvenirs back to the U.S. in lieu of checking in a suitcase? I am only planning on traveling with a small carry on bag and back pack, but would like to buy souvenirs. Has anyone ever shipped their items back? If so, what did you do?", "link": "facebook.com/groups/1373361046396315/permalink/2204840103248401/", "likes": 15, "comments": [{"username": "Lisa Schalig-Winter", "comment_text": "Many stores offer shipping. We had leather and pottery sent via FedEx. No problems and not very expensive."}, {"username": "Danielle Withrow", "comment_text": "I sent packages back from both Italy (Florence) and Portugal through a company called Mail Boxes, Etc. I've also sent packages back from other countries via the company. Very reliable. They have stores in the major Italian cities."}, {"username": "Rhona OConnor", "comment_text": "You could also buy a big bag and check it in on your return."}, {"username": "Jenny Payne", "comment_text": "I mail parcels back to Australia from Rome but I also take my own tape + black maker as they don’t wrap them secure enough . It’s not cheap but I send all my old clothing bk , & if u send new clothes take all the tags off and turn them in side out . They do arrive takes a few weeks 🌻"}, {"username": "Marie Romeo", "comment_text": "Bear in mind that some items sent by post could attract customs duty."}, {"username": "Brooke Dowling", "comment_text": "I shipped my clothes back and kept my souvenirs with me… they arrived the day after I got home. Everything was fine 🤷🏻‍♀️"}, {"username": "Fetchin Gretchen", "comment_text": "Yes and they never made it. I think stolen on arrival at LAX. Now I send back my used clothes instead to make room for souvenirs."}, {"username": "Heather Nixon", "comment_text": "I bring a duffel bag and put my clothes in that and check it and then all my souvenirs go in my carry on."}, {"username": "Sandra Shoffner", "comment_text": "Took them to Mailbox or FedEx"}, {"username": "Jessica Stewart", "comment_text": "I’m planning on using dhl type shipping company to ship things back."}, {"username": "Lisa Valdovinos", "comment_text": "We went to mailbox Etc. in Florence. We shipped some clothes and souvenirs."}, {"username": "Danielle Withrow", "comment_text": "I would agree with Marie about what you put in the box that might be flagged by customs (coming back from Ireland customs charged me for a number of knit wool new sweaters that I bought as gifts). So I often pack in the box things like used clothing and paper souvenirs- then on the declaration form you can write \"personal items-used clothing\". Any more expensive items fit in my bag (like a small leather bag from Florence!). Again, sending a box back is not always cheap but I hate to tote stuff like that around or have no room coming back because I travel very light."}, {"username": "Andrea Bainbridge", "comment_text": "I had the shop ship my plates home. Wasn’t cheap but certainly easier."}, {"username": "Wendy Spano Bracco", "comment_text": "I check my bag and keep my souvenirs and such in my carry."}, {"username": "Sande Ricci", "comment_text": "We bought a 10x15 ft carpet in Milan and it was shipped back home to Texas. Took about 10 days. It cost $400.00 to ship Fed Ex. Wasn't cheap but for what it weighed it wasn't bad!"}, {"username": "Nancy Day", "comment_text": "We shipped back Irish tea set,a complete set of China ,shipped it fr Ireland to NJ.Also shipped alot of gifts from Alaska and Florida,no issues.Must get insurance !!"}, {"username": "Kerri Bevilacqua", "comment_text": "Yes, we shipped most things back using Mailboxes, Etc. In Florence. It took about a week. Wine and a few ceramics were shipped separately from the stores/\nwineries."}, {"username": "Kelly Barfield Burchill", "comment_text": "So we did that and I think we were a little “taken”. We went to the first DHL we saw in Florence and we were definitely limited in time and in a hurry to get to our train. So shipping six bottles of wine home and a few pieces of clothing ended up being like $360. Again like I said because we are in such a hurry we didn’t even think about it and just paid it. But I’m sure that was their most expensive like express shipping… So I guess lesson I’m trying to share is be sure to ask about all shipping options. I’m sure there was a less expensive way of mailing things home."}, {"username": "Dawn Hofmeister", "comment_text": "I sent 3 boxes home. Went to mailboxes etc in Bologna, Florence, and Venice. Bought the box there, (which they apply to purchase price). Each box arrived in 3-5 days to the states. Venice was cheaper to send from than Bologna. In Venice Sent a 9 kilo box and it was 70€. A 4 kilo box was also 65€ from Bologna. I received emails letting me know the status of each box. I sent home souvenirs and extra clothes. No extra duty charges, nothing stolen or broke."}, {"username": "Robin Ricca-Bouden", "comment_text": "My daughter used mail boxes Inc in Florence after traveling for week and 1/2. Still had another week and 1/2 left. The package arrived before she got home."}, {"username": "Jesy Rose", "comment_text": "Any recommendations\nfor souvenirs that will consist of 20 bottles of wine and olive oil? How do I get that back? Haha"}, {"username": "Gayla Regitz Jones", "comment_text": "We bought a collapsible suitcase we packed in our carry on then on the return trip home we checked our hardside carry on with dirty clothes and wine and put our other souvenirs (leather mostly) in the other bag that became our carry on"}, {"username": "Helena S. Stone", "comment_text": "I sent Venetian masks and Murano glass pieces. Everything came as I sent, no problem at all."}, {"username": "Thuy Tdt", "comment_text": "It’s probably cheaper to buy extra luggage instead of sending it home"}, {"username": "Tommy Jenkins", "comment_text": "Tammy Allenbaugh Jenkins here’s what we were wanting to know -"}, {"username": "Delphinia Salamin", "comment_text": "My friends mailed back a box no issues but I now take an empty carry on bag and fill it with stuff I want to buy"}]}, {"id": "2204845293247882", "text": "Venice, Italy 🇮🇹 #italy #italia #italy🇮🇹 #italy_vacations #italytravel #italytrip #itlaybloggers #italianstyle #italymagazine #italiandesign #italyhomeluxury #italymillionairesclub ###europe #visititaly #आणखीdesinators #travel #travelphotography #travelling #venice #venizia #venice🇮🇹 #veniceitaly #venicecanals #venicetaxi #venicelove #veniziacityitaly #cafe #floriancafe #sanmacro #gondora #music #beautifulcity #bedtlife #canel", "link": "facebook.com/groups/1373361046396315/permalink/2204845293247882/", "likes": 2, "comments": []}, {"id": "2204848606580884", "text": "I’m Traveling to Italy next year and want to know if anyone is familiar with airbnb cancellation policy. If a host lists free cancellation and 100% refund by April 19. If I have to cancel, do I need a specific reason to do so or can I just cancel before that date for any reason and get the refund. New to this airbnb community and don’t know the all the rules yet.", "link": "facebook.com/groups/1373361046396315/permalink/2204848606580884/", "likes": 4, "comments": [{"username": "Elaine King", "comment_text": "Read their rules, I've canceled before designated date and all my money was refunded, pp"}, {"username": "Bev Madill", "comment_text": "I've had to cancel in the past and received a full refund, no questions asked."}, {"username": "Karen Blackmore", "comment_text": "Be aware that the host can also cancel on you! This happened to us, not in Italy. But just keep back some budget in case! With only two weeks before our stay we had trouble finding a replacement and ended up with two hotel rooms, much more expensive!"}, {"username": "Alexandra A Welker", "comment_text": "The rules vary in for each property. And no, you really don't need to give a reason why you're cancelling."}, {"username": "Jenny Payne", "comment_text": "No just do it before the date that is stipulated 🌻"}, {"username": "Reagan Bramston", "comment_text": "I have cancelled an air bnb in Milan, in time for a full refund, which the host paid into my account, but be warned there is always a 'service fee' charged by Air bnb & THEY do not refund that fee. The service fee is different on each property."}, {"username": "Fetchin Gretchen", "comment_text": "I now get the cancel insurance since a host cancelled on me on a date I had booked 9 months prior just a few days before my flight. Glad I did as it covered my having to leaving one of the subsequent bookings I had to leave 2 weeks early due to internet failure."}, {"username": "Paul Anderson", "comment_text": "Every host chooses how they want to deal with it. We have very strict cancellation policy. You need to read what your host has decided."}, {"username": "Katherine Wright", "comment_text": "You will get a prompt to indicate the reason when you cancel but you don't have to indicate one of those reasons you can just indicate other and leave it at that. So if you are just no longer interested or whatever the case is there is no issue 🙂"}, {"username": "Marylou Coppola", "comment_text": "Thank you"}, {"username": "Sande Ricci", "comment_text": "We have never had a problem with Airbnb or VRBO. You don’t need a reason to cancel by the date they give you. You money will be returned to your card."}, {"username": "Marylou Coppola", "comment_text": "Thanks everyone for the information. 😊"}, {"username": "Yvette Pavone", "comment_text": "JUST CANCEL. NO REASON"}]}, {"id": "2204856476580097", "text": "Which would be your ideal October Amalfi coast day between these two options:\n\n1) group tour from Sorrento leave 9 am. 1 hour stop in Positano, 1 1/2 hr Amalfi city and 1 1/2 hour Ravello. Driver drops us back in Sorrento at 5pm. This is easier but I’m afraid time in each town seems too limiting?\n\nOR\n\n2) one way private driver from Sorrento drops usआणखी in Ravello. Spend couple hours then we will hike down the path (45-60 min) to Amalfi city - spend couple hours then bus to Positano. Spend couple hours and then catch maybe an 8pm bus back to Sorrento (can’t do ferry it stops running too early). This will give us more freedom and time in each city but will it be too complicated or exhausting?\n\nThanks for advice!", "link": "facebook.com/groups/1373361046396315/permalink/2204856476580097/", "likes": 1, "comments": [{"username": "Carine Brys", "comment_text": "Definitely option 2. We did option 1 and I remember racing around like beheaded chickens."}, {"username": "Colleen Jennings", "comment_text": "Option 2. You’ll be free to go at your own pace & not rely on late-comers back to the bus (there are always those who hold everyone up!). Enjoy your day there - you’ll wish you were staying longer - it’s beautiful."}, {"username": "Jenny Payne", "comment_text": "Why not catch the bus from Sorrento, spend a few hours in Positano, then get bk on the same bus and go see Amalfi, then catch the bus bk to Sorrento? very easy done it a few times, make sure you know when the last bus leaves Amalfi 🌻🌻"}]}, {"id": "2204858823246529", "text": "I recently returned from 2 1/2 months in Italy and Greece. I carried my passport in my money belt under my slacks. ￼\nHas anyone actually had a money belt stolen off of them? I can’t think of a safer way to carry things, but if anyone has any suggestions, I would love to hear them.", "link": "facebook.com/groups/1373361046396315/permalink/2204858823246529/", "likes": 20, "comments": [{"username": "Kadie Mcgugan", "comment_text": "I’m going to Italy tomorrow for early 3 weeks.. do I need to carry my passport ? I would rather not incase it got wet or stolen 😬"}, {"username": "Krissy DaRusso", "comment_text": "This is how I carry mine as well."}, {"username": "Kate Laidlaw", "comment_text": "Agree, in Italy now. Travel days passports in the money belt and into the safe.\n\nHave digital and photocopy as well. Not worth the risk carrying it around."}, {"username": "Jack Giacomo Avondo", "comment_text": "Always try protecting your documents in either a plastic bag or waterproof protector. As all have mentioned. You must have your passport at all times, if stopped and asked to produce it. Happy travels"}, {"username": "Anne Power", "comment_text": "I would suggest getting the passport card and keeping your main passport in safe"}, {"username": "Michela Zanni", "comment_text": "Separate credit cards, money and documents and pay attention to your bags. I've never been robbed, and I live in Italy"}, {"username": "Jenny Payne", "comment_text": "I use a cross body bag if I take it out, often leave it at the hotel or apartment in a case with a zip tag as it had a code and so far after 16 years going to Italy been lucky but a lot of commonsense 🌻"}, {"username": "Mika Whyte", "comment_text": "I would feel so uneasy leaving my passport in a safe in the hotel room, those safes are accessible by the hotel staff and you have no way of knowing they’re not dodgy. I don’t see how you could be pickpocketed with it in a money wallet under your pants."}, {"username": "Sue Gaughan", "comment_text": "I always use a money belt."}, {"username": "Voula Ladas", "comment_text": "I have heard of someone who was travelling in an Asian airport have his money bag stolen from under his clothes without him even realising . It was all caught on airport security video . These thieves are super amazing at theft . Generally these bags worn under clothes ,are pretty safe ,but make sure the straps are slashproof . Pacsafe make a good one . I don’t trust leaving my passport in a hotel safe . They can still be accessed by the hotel , and I am also scared of forgetting it there . Its not so bad if you are staying there for afew days , but if you are on a tour and visiting different hotels almost daily , there’s a higher chance of forgetting it there ."}, {"username": "Jun Cee", "comment_text": "carrying your passport in a hidden waist belt all throughout a vacation for fear of being picked or harassed by authorities is a kill joy. make a photocopy in a back pocket. personally I just bring an expired driver ls license."}, {"username": "Fetchin Gretchen", "comment_text": "I had a money belt that had a push button release somehow released and lost $2000 in Euros. So now I get a belt without any release mechanism if I wear one. But have not worn one in years. Instead I have my valuables around my neck, separate from any other handbag."}, {"username": "Julie Settlemire Upham", "comment_text": "I bought a small bag that attaches to a belt and goes into pants mainly for passports."}, {"username": "Pam Simpson Wilson", "comment_text": "The VRBO owner took picture of ours for the government-some\nthing to do with city tax per person/nt which we had to pay in cash"}, {"username": "Wendy Spano Bracco", "comment_text": "I use a crossbody. Plenty of inner pockets and one completely flat in my side. I keep my passport in there. I have the Lululemon belt and would not be comfortable wearing that all day. I can’t imagine a security belt. No way."}, {"username": "Jennifer McDonnell", "comment_text": "Can you get the Passport card - I usually carry that on me and leave the passport book in the safe."}, {"username": "Jo Ann Ciuffini Forcino", "comment_text": "Will a copy be acceptable if getting a VAT at a shop?"}, {"username": "Jules Earl-Rossiter", "comment_text": "Why don't you just carry a photocopy of your passport and leave the passport in the hotel safe...🙃"}, {"username": "Maria Samaee", "comment_text": "I never carried with me, just have the picture in your phone."}, {"username": "Stephanie Lubin", "comment_text": "We are going to Greece next year. Any suggestions on things to see and do?"}, {"username": "Anna Gambino", "comment_text": "Someone mentioned carrying it at all times in the event of a natural disaster. I have friends that were ￼in Italy during an earthquake so I always carry mine. Also, you do need ID when traveling and I’m not comfortable leaving my passport anywhere."}, {"username": "Gigi Alb", "comment_text": "Neck wallet worn crossbody, under clothes, tucked inside pants or underwear if wearing a dress."}, {"username": "Bonnie Rodgers Henderson", "comment_text": "I sew a pocket on the inside of my pants and skirts. Only carry a copy of your passport on you"}, {"username": "Dawn Marie", "comment_text": "I have had two recent calls from people who have had their valuables and documentation stolen one from their Airbnb, and the second was from their hotel"}, {"username": "Melissa Reyes", "comment_text": "This is what I used. Worked great. I did not carry my passport around with me"}, {"username": "Ann Brahmani Bost", "comment_text": "This might be a good solution. https://\nwww.amazon.com/\ngp/product/\nB07V6V69MC/\nref=ppx_yo_dt_b_\nasin_title_o09_\ns00?ie=UTF8&th=\n1&psc=1"}, {"username": "Carolina Alejandro Clabaugh", "comment_text": "I carried mine in my travelon crossbody and it was fine."}]}, {"id": "2204871399911938", "text": "How would you suggest going from positano to ravello? Hotel quoted a car service, but it was higher than what I had hoped. Is Ravello worth staying in?", "link": "facebook.com/groups/1373361046396315/permalink/2204871399911938/", "likes": 0, "comments": [{"username": "Melanie Lyons Roff", "comment_text": "We arrange a two hour stopover in Ravello with a driver on the way back to Naples. It added cost but not as much as a special trip."}, {"username": "David Good", "comment_text": "Bus is very easy, not sure on cost, but definitely not expensive"}, {"username": "Iliana Zlatareva", "comment_text": "Yes it is, bus"}, {"username": "Nancy Koehler Barboni", "comment_text": "Go to Ravello for a day. The journey there is beautiful as well."}, {"username": "Corey Anthony", "comment_text": "Ferry to Amalfi is like $25. Then can grab the bus to ravello which is also super cheap"}, {"username": "Katie Kirk", "comment_text": "We took a private car. Little pricey but less work than the bus. We stayed at Villa Cimbrone for 3 nights. Not too much to do but a nice time to rest and recover. This was our last stop before flying home so it was a nice way to end our trip."}, {"username": "Jennifer Stanek", "comment_text": "We took the bus all around the coast including Ravello. It’s $10 for a 24 hour pass."}]}, {"id": "2204871419911936", "text": "What’s the best app to download for fast train round trip from Milano to: Florence, Venice, Lake Como.", "link": "facebook.com/groups/1373361046396315/permalink/2204871419911936/", "likes": 1, "comments": [{"username": "Emily Louise Cua-de Ramos", "comment_text": "Following this 🙂"}, {"username": "Gena Kona-Mancini", "comment_text": "Trenitalia"}, {"username": "Gabriele Fordini Sonni", "comment_text": "High speed trains are operated by Trenitalia (public) and Italo (private). Buy directly from those two, others are just third party resellers.\nBe sure to book in advance for lower fees and to secure a spot.\n\nYou can check your itinerary using Google Maps or directly from their website.\n\nYou can recognize high speed train by their names (Frecciarossa, Frecciargento and Frecciabianca for Trenitalia) and the abbreviation AV (Alta Velocità)"}, {"username": "Bev Madill", "comment_text": "Just use Trenitalia."}, {"username": "Josephine Spallina", "comment_text": "Thank you so much! 😊"}, {"username": "Mia Catalano", "comment_text": "Yes trenitalia, it kept updating with any delays and the platform number etc.."}, {"username": "Gianna Onesi", "comment_text": "Trenitalia"}, {"username": "Tímea Kovács", "comment_text": "Omio"}, {"username": "Ibbu Mohd", "comment_text": "Italo (all)\nTrenord (lake como-varenna)"}]}, {"id": "2204885233243888", "text": "Hi, we are currently in Florence and will be at Venice in two days. We would like make a reservation at a nice restaurant in Venice to celebrate my daughter’s 14th birthday. Any recommendation will be greatly appreciated!", "link": "facebook.com/groups/1373361046396315/permalink/2204885233243888/", "likes": 1, "comments": [{"username": "Janice Nugent", "comment_text": "Harry’s Bar!!! Grab a Bellini while you’re there as well."}]}, {"id": "2204908629908215", "text": "Hi all, here’s some random tips for anyone travelling to Italy that I’ve discovered during my recent travels.\n4 star doesn’t always mean 4 star. I am currently staying in a 4 star hotel in the Dolomites which is 2 star at the most. I’ve stayed in 3 stars which are more like 5 star!\nHotels generally offer breakfast but apartments don’t usually.आणखी\nSome pharmacies sell lovely jewellery much cheaper than the shops or markets.\nRemember lots of shops close between 12-3pm. Yesterday I had a handful of dresses ready to try on only to be told the shop was closing!\nAlways carry an umbrella because when it rains it pours.\nIf you can hire a car, do, because it opens up a whole world but always ensure you pay the full insurance with the hire company as we always pick up a few bumps and scrapes along the way.\nThe Duolingo app is great for learning some Italian phrases before you travel.\nFinally, enjoy every second in this beautiful country.", "link": "facebook.com/groups/1373361046396315/permalink/2204908629908215/", "likes": 81, "comments": [{"username": "Alessandro Iannelli", "comment_text": "regarding closing time, it also depends on the area, there re places where it's more common for stores to close between 13 and 16."}, {"username": "Michela Zanni", "comment_text": "Most shops close during lunch time in the Dolomites. In other tourist places they are always open, even during weekend. The same for malls and supermarkets. Open 7/7 and all the day"}, {"username": "Bronwyn Croft", "comment_text": "Kim Russell"}, {"username": "Elena Eugeni", "comment_text": "The Italian hotels stars system is not about quality, rather about provided services. If an hotel as a certain number of characteristics\n(number of room, number of private bathrooms, full time concierge, all day restaurant, all night room service....), it gets a certain star rating"}, {"username": "Karen Joyal Pastori", "comment_text": "Thank you. Going in 6 weeks"}, {"username": "Giovanni Pianigiani", "comment_text": "curious about the jewellery you found at the chemist. what was that?"}, {"username": "Barbara Bastianini", "comment_text": "It sounds like people may be equating the hotel star rating system in Italy with standards of quality or luxury. But that’s not the way the star system works there.\n\nThere are government mandated criteria that a hotel has to meet at each star rating. They involve things like the size of the reception area, if the hotel provides an elevator, even the number of towels per guest the hotel provides and how often the sheets are changed.\n\nAs the star rating increases the requirements of the lower rating must be met as well as more stringent ones. For example the two star must provide everything the one star does as well as more. And so on up the line.\n\nAll levels must clean guest rooms once per day. But here are some examples of what the star ratings mean at each level.\n\n1 star. The reception area has to be open 12 hours a day. A double room will be at least 14 square meters. Rooms will be cleaned daily and sheets changed once per week. There has to be at least one bathroom for every three rooms.\n\n2 star. Has to have an elevator and change sheets twice a week.\n\n3 star. The reception area has to be open 16 hours per day and the staff must speak at least one foreign language. Staff must wear uniforms.\n\n4 star. Sheets and towels must be replaced daily. Laundry service must be offered. A double room has to be at least 15 square meters. Air conditioning must be provided. All rooms must have an en-suite bathroom.\n\n5 star. Reception area must be open 24 hours. The reception staff must speak three languages and double rooms must be at least 16 square meters.\n\nHow far the reception desk is from the guest rooms is also a factor.\n\nIt’s confusing but those are the kinds of things that Italian hotel star ratings refer to. Not to quality or subjective things like how “nice” the rooms are.\n\nSince many Italian hotels are located in old historic buildings they may have fewer stars just because it might be impossible to retrofit an elevator or AC into the building or en-suite bathrooms into every guest room. The one star doesn’t mean the hotel is not nice and doesn’t indicate lack of quality. And the 4 or 5 star rating doesn’t guarantee quality ( although there may be a correlation.) The way stars are awarded sort of guarantees a nice place full of character in an older building in the city center will have fewer stars than a newer, more generic hotel on the outskirts or in the countryside. So when looking for a hotel it’s usually best to factor in the location, amenities and guest reviews as well as the star rating. Because those stars can often confuse a first time visitor.\n\nSo a 4 star hotel in Italy always means a 4 star by Italian standards, but the visitor will likely be thinking the star is a guarantee of a certain level of quality. It is not, because that’s not what the Italian star system is rating."}, {"username": "Lisa Ball Johnson", "comment_text": "Kelsey Johnson. Robin Johnson I find this site extremely interesting and helpful in planning out next trip"}, {"username": "Charles Broussard", "comment_text": "Is there a hotel in the Dolomites you would recommend? Will be there in October."}, {"username": "Maureen Judice", "comment_text": "Cecile Broussard\nEileen Huval"}, {"username": "Rhonda Taylor Biel", "comment_text": "Please explain insurance for car service? Do you mean a rental car?"}, {"username": "Irene Oda", "comment_text": "Car rental advice- we never pay for the car insurance offered. Rather we pay for the rental with one of our travel credit cards and when we use the card for paying the rental fee there is an automatic insurance coverage included. We also buy travel insurance on our trips that also includes car rental insurance too. So save your money for this extra car rental insurance and treat yourself to something nice...."}]}, {"id": "2204916396574105", "text": "Hi\nWe are looking to travel in 2024 , 6-8 weeks. Some time in other countries as well.\nWe are not sure whether to go May/June or Sept/Oct?\nWe are trying to miss the heat and the crowds (Olympics in Paris early Aug).\nBetter weather is a bigger concern for us so your feedback is appreciated.\nThx.", "link": "facebook.com/groups/1373361046396315/permalink/2204916396574105/", "likes": 0, "comments": [{"username": "Rosslyn Patience", "comment_text": "Done both in Italy and both times are fine."}, {"username": "Gwyneth Spadaro-Dutturi", "comment_text": "Visit Slovenia too if you are going to be in Italy."}, {"username": "Sonita Sandhu", "comment_text": "Make sure to go to Croatia. It’s beautiful!"}, {"username": "Beth Ashwood", "comment_text": "Have just come back from Italy and Greece\nWe were there mid June to mid July\nIt got quite hot and there were big crowds of tourists in Italy already in mid June\nWas still fabulous but do plan to book popular tourist sites in advance"}]}, {"id": "2204918369907241", "text": "Hi I am in Milan now with my 15 year old son . Any ideas of places to go that he will enjoy besides San Siro? Thank you 😊", "link": "facebook.com/groups/1373361046396315/permalink/2204918369907241/", "likes": 1, "comments": [{"username": "Karen Blackmore", "comment_text": "The Leonardo 3 museum my daughter (20) enjoyed. Get the headset for extra info as some of it only in Italian. There are lots of hands on things to build. Got tickets through Tiqets, but can just turn up. It's at the far end of the Galleria Vittorio Emanuele (the posh shopping centre nr the Duomo)."}, {"username": "Karen Blackmore", "comment_text": "San Siro stadium is awesome! Went to a concert there, so no idea how good the tour is."}, {"username": "Karen Blackmore", "comment_text": "Rooftop of the Duomo is great too!"}]}, {"id": "2204926553239756", "text": "Pros and cons of booking direct v tours\n\nExample, Vatacin tickets booked direct.\n\nIt appears much cheaper to book direct and make your own way there.\n\nWhat's people's experience going direct.", "link": "facebook.com/groups/1373361046396315/permalink/2204926553239756/", "likes": 3, "comments": [{"username": "Jaime Cleek", "comment_text": "It's cheaper and you are guaranteed entry"}, {"username": "Becky Robertson", "comment_text": "We went direct and got an audio guide, wandered around at our own pace, if a room was very crowded we hung back till the big group tours moved on. We preferred doing it this way rather than being herded around in a large group 😊"}, {"username": "Leigh Griffiths-Cole", "comment_text": "We booked direct with the Vatican and had a great Vatican guide take us around. Much cheaper, we paid 118 euros for 4 people last Nov."}, {"username": "Zoe Croasdale", "comment_text": "Depends on time of year. We went October. No queues and you just follow along those in front. Can get audio tour. I am told you can queue jump with a booked tour, which would be worth it if busy!"}, {"username": "Tari Lawson", "comment_text": "Booking direct will be more cost effective and you won't have to worry about the your being canceled. That is always my preference. I only use tours as a last resort."}, {"username": "Matthew Hatch", "comment_text": "If you book direct do you get a quicker entry or do you have to line up?"}, {"username": "Wendy Spano Bracco", "comment_text": "I booked private tours (4 people). We go in a month. I wanted the early open time and have someone to get us through."}, {"username": "Jonh Kim", "comment_text": "Hello I’m reselling my 3x tickets now please message me if you’re interested in buying them thanks 😊"}, {"username": "Shen Min Chue", "comment_text": "With the current spate of booking cancellations from 3rd party operators, sometimes last minute, it is definitely better & safer to book direct, to ensure that your bookings are risk-free from such nasty cancellations."}, {"username": "Miyuki Kanno Paul", "comment_text": "I always book directly with the official website. No extra service charge whatsoever. No cancellations. We had English guided tour including Sistine chapel"}, {"username": "Amy Lewis", "comment_text": "I have 4 tickets for sale, can’t attend anymore. I can as well show proof of purchase, message me if interested in getting them\n\nHopefully I don’t come across as a scammer, Thanks"}, {"username": "Richelle Trezise", "comment_text": "We have booked direct saved heaps if you want to listen to a guided audio rick steves is supposed to be good. That what we will be using. A paid guided tour will have head phones for you to use"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2204929763239435", "text": "Looking for recommendations\nfor great pizza, more authentic in Naples. Or other great restaurants in Naples. Thank you in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2204929763239435/", "likes": 4, "comments": [{"username": "Maria Brozou", "comment_text": "try the sorbillo pizzeria in historic center"}, {"username": "Jess Armour", "comment_text": "L'Antica Pizzeria Da Michele- the pizzeria from eat pray love and the best pizza in the world (even the locals I have spoken to have said this) good pricing too. Long lines so pays to go a bit before opening and line up"}, {"username": "Claudio Blizzard Indastria", "comment_text": "Da Michele is the most classic experience but the line is always insane.\n\nThere's a lot of alternative around the corner anyway like di Matteo, concettina ai tre santi.\n\nOther great spots are 50 kalò, Starita, Pellone, etc etc\nYou can't go wrong in the end"}, {"username": "Lauren Vassallo Beattie", "comment_text": "Un Sorriso Integrale Amico Bio\nAnnarè Ristorante Pizzeria"}, {"username": "Ville Lignell", "comment_text": "Social pizza, creative kitchen rooted in tradition. Their pizza dough melts in the mouth. https://\nwww.socialpizza.\nit/\nfood-menu-chiaia\n/"}, {"username": "Ewa Kolodziej", "comment_text": "Ewa Kolodziej"}, {"username": "Irene Young", "comment_text": "Another vote for Da Michele……best pizza ever ❤️🍕"}, {"username": "Elena Eugeni", "comment_text": "Starita, Pellone, Salvo a Chiaia. They are all good to be honest"}, {"username": "Scott Perry", "comment_text": "Following"}, {"username": "Anthony Martini Jr.", "comment_text": "Everything pizza is great, don't get all caught up in being picky...unless you want to go to the oldest pizzeria on earth...but the second oldest not far is actually better\n\n\"Nestled in the city's bustling centre, the famous Antica Pizzeria Port'Alba is not only the oldest pizzeria in Naples, Italy but the oldest pizzeria in the whole world. While the restaurant dates back to 1830, the origins of the business go back much further than that\""}, {"username": "Patricia Capuccio", "comment_text": "Antonio and Antonio in the Santa Lucia neighborhood"}]}, {"id": "2204684499930628", "text": "Tips for solo travelers?", "link": "facebook.com/groups/1373361046396315/permalink/2204684499930628/", "likes": 10, "comments": [{"username": "Gillian O'Callaghan", "comment_text": "Travelled solo in Italy for a month (April and July)......what\nwould be helpful?"}, {"username": "Marie Cuzzi", "comment_text": "Enjoy yourself!!!"}, {"username": "Brooke Dowling", "comment_text": "Have fun calling the shots on your own trip… use your head, be aware of your surroundings just like you would be in a group. It’s amazing."}, {"username": "Nicole Beaumont", "comment_text": "Solo traveled throughout Italy in June for 3 weeks. My biggest tip would be always be aware of your surroundings."}, {"username": "Karen Robertson Fitterer", "comment_text": "Do whatever you want 😊"}, {"username": "Julie Tran", "comment_text": "Traveled solo for the 1st time, dont rush and relax !"}, {"username": "Ville Lignell", "comment_text": "Keep your luggage compact, your valuables inside your clothes and get creative. The country is well-covered by train & bus networks."}, {"username": "Janet Lugar Miller", "comment_text": "I am 67..flying over on my own.. meeting up with people I dont know..wine tour...\nHope to do another trip next year on my own too."}, {"username": "Michael Widjaja", "comment_text": "Enjoy and be careful"}, {"username": "Jennifer L. Mezzio", "comment_text": "When are you going? I’m going solo in Oct. I am booking tours with small groups and not venturing out too far away or late at night."}, {"username": "Annette Giovia", "comment_text": "I enjoyed travelling alone in Italy. Do what you want to do, when you want to do it. Mingle, walk the alleyways, enjoy the food. Appreciate the beauty of where you are. Just keep aware."}, {"username": "Sandra Maldonado", "comment_text": "Real solo, or touring with a group?\nIf real solo, plan, plan, plan. This way you’ll feel confident to make last minute changes if you want. And book a food tour, wine tasting, or day trip.\nIf touring with a group, be ready at the time your tour direction told you so. If an introvert, make sure to take some alone time. If an extrovert, you’ll naturally make friends."}, {"username": "John Bates", "comment_text": "Get travel insurance. Secure your luggage well. Have a great time and relax."}, {"username": "Mariah Sartori", "comment_text": "Enjoy yourself!!!"}, {"username": "Wendy Spano Bracco", "comment_text": "I love my solo trips. I went to sparks 3x solo. It’s great to be on your own schedule! I mapped everything out on GoogleMaps by areas. Made reservations for dinners. It’s so easy to travel like this!"}, {"username": "Miyuki Kanno Paul", "comment_text": "Be confident. Act like you own the world! Be vigilant. You will be just fine❤️I’ve done not one but two solo trips to Italia. It was fun❣️"}, {"username": "Jordan Messina", "comment_text": "Enjoy yourself. Just be mindful of surroundings. Get lost and immerse yourself in their culture."}, {"username": "Julie Norris", "comment_text": "Did for a month in Rome last October. Loved it. Take time to people watch 😀 obviously be aware of your surroundings. I never felt unsafe walking to restaurants for dinner or being solo in places of interest. Learn some key phrases. Plan ahead but don't fill every moment so you can enjoy the energy of where you are. I'm back again solo this year, love it so much every time"}, {"username": "Martin-John Rubio", "comment_text": "Be confident...KNO\nW the basics of the language whatever country you're in"}, {"username": "Angela Brown Walters", "comment_text": "Use the visitacity.com app it is spectacular!!\nI've only used it in London but from what I've seen it will work as brilliantly in almost all cities in the world.\nShows you what's close to each other, approximate length of time each places takes to visit, days & hours place is open/closed, cost & what tube stop is closest. You will find suggestions of places to visit you haven't heard of and can move things around to fit with your needs. You can enter into the planner sitting at a park and people watching for hours or taking a mid day nap. It color codes each day on a master map so you can visually see what's been planned."}, {"username": "Robin Burkholz Shaham", "comment_text": "I traveled alone for 16 days in Italy. Each day I signed up for a group tour for 2-3 hours. One day was a cooking class, the next day a historical tour through Florence, The Vatican, a full day in Tuscany etc. The food tours are fun and a great way explore the area. This allowed me to meet new people so I was not alone all the time. Honestly I loved traveling solo and yes I had high levels of situational awareness but did not let it stress me. Everyone in the cities speak English so you will be fine if you need help. Have a great time. I can’t wait to return, because well, I left my ❤️in Florence."}, {"username": "Rhonda Russell", "comment_text": "I have traveled solo for the last 6 years and have had no problems. I find a local cafe for my morning coffee and ask the staff for recommendations\nof where their favourite places to go are and where NOT to go. I love to wander and soak up the atmosphere. Be kind, smile and Enjoy"}, {"username": "Voula Ladas", "comment_text": "Always have a plan B in place for unexpected circumstances ( plane delays or cancellations, theft of your money or phone , lost luggage , illness , accidents etc )"}, {"username": "Claire Lewis", "comment_text": "Book hostels"}]}, {"id": "2204685129930565", "text": "Is there a train that takes you from Tirano (after getting off the Bernina Express) to Como? I cant find any info. Do they run often? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2204685129930565/", "likes": 0, "comments": [{"username": "Bea Kuckens", "comment_text": "https://\nwww.rome2rio.com\n/map/Tirano/\nComo-My Italy Rome2Rio will show most of your options."}, {"username": "Stefano Bressanelli", "comment_text": "Tirano to Milano ( direct), then Milano to Como. From centrale station you can use the trains that go to Locarno. With stop in Como."}]}, {"id": "2204688833263528", "text": "any recommendations for a hotel in Milan 1st week of September, fairly central location, 200 - 300€", "link": "facebook.com/groups/1373361046396315/permalink/2204688833263528/", "likes": 1, "comments": [{"username": "Debbie DiOssi", "comment_text": "Hotel Spadari. Great hotel and great location."}, {"username": "Robin Burrell", "comment_text": "Hotel Dei cavalieri has a great rooftop bar and restaurant."}, {"username": "Glenn Todd Webb", "comment_text": "Rosa grand behind duomo"}]}, {"id": "2204689366596808", "text": "We are looking for transportation\nfrom the cruise port in Trieste to Venice then the following day from Venice to airport. Any recommendations?\nAlso, Our flight is at 11:30 am are we better staying close to airport or will we be ok to stay in the canal area?\nIf you can’t tell I’m a firdt time visitor.", "link": "facebook.com/groups/1373361046396315/permalink/2204689366596808/", "likes": 0, "comments": [{"username": "Ville Lignell", "comment_text": "Train from Trieste to Mestre, choose a hotel there and visit Venice by train/bus. Mestre is well connected with the airport."}, {"username": "Carolyn Hall Raffo", "comment_text": "Uber"}, {"username": "Ryan Monahan", "comment_text": "There's no Uber in Venice... as I'm sure you could guess 😛 Just take the AliLaguna boat ferry. It goes all the way down the grand canal and then out to the airport. There are a few Alilaguna booths around the city along the Canal, you can get your tickets in advance. We just did it 3 weeks ago. Find the stop closest your hotel and it takes you right to the terminal!"}, {"username": "Lori Hagen", "comment_text": "Are you taking a cruise first? I think that a great idea. Princess Cruises has that package but not for our dates."}]}, {"id": "2204690456596699", "text": "Can you suggest where to buy fast train tickets Rome to Naples.\nFerry tickets Naples to Sorrento (Massa Lubrenese )\n\nHow far is the city center in Rome to train station.\nHow far is Naples train station to ferry, ferry to Sorrento ?\nI tried a search, there is a lot of information.\n\nThank you for your help.", "link": "facebook.com/groups/1373361046396315/permalink/2204690456596699/", "likes": 2, "comments": [{"username": "Diane Davis Lawyer", "comment_text": "omio.com"}, {"username": "Brenno Bianchi", "comment_text": "For the trains, if you will take a Frecciarossa on the Trenitalia website or app, if you will take a Italo on Italotreno website or app"}, {"username": "Rosemarie Furnari Cisluycis", "comment_text": "I am training it to all of my destinations in Italy. You can buy fast train tickets on either Italo or Trenitalia. I would recommend downloading their apps and purchasing that way this way you don’t have to validate your tickets before getting on. Tickets will be available on the app.\n\nThe city center is about a 35 minute drive to/from the Roma termini.\n\nFrom Naples to Sorrento it is an hour drive. The ferry is about 45 minutes. The train is about an hour 15 minutes.\n\nHope this helps."}, {"username": "Ibbu Mohd", "comment_text": "Ferryhopper-dir\nect site booking your ferries\nItalo-trains (take these, better than govt trains)"}, {"username": "Sonita Sandhu", "comment_text": "I stayed in Piazza Navona and it took about 10 mins to Roma train station by taxi or Uber. Did it a few times as I was in and out of Rome."}, {"username": "Sonita Sandhu", "comment_text": "Take the train from Naples to Sorrento!"}, {"username": "Philip Curnow", "comment_text": "Fastest and best way to buy train tickets is from the English language sections of websites of the Italian train operators themselves. They are www.italotreno.\nit and www.trenitalia.\ncom."}, {"username": "Gena Kona-Mancini", "comment_text": "Also. Book 2 weeks in advance for the train from Rome/Naples because you save quite a bit of money doing so!"}, {"username": "Junko Osaki", "comment_text": "For fast trains from Rome to Naples\n\nhttps://\nwww.italotreno.i\nt/en\n\nOr\n\nhttps://\nwww.trenitalia.c\nom/en.html"}, {"username": "Gina Marie", "comment_text": "What location is the ferry to sorrento ?"}]}, {"id": "2204691206596624", "text": "Going to the motherland in September on a 14 day Mediterranean cruise! So excited to be in Naples for a day! Any locals on here that live in Naples? I’d love to bend your ear 😊", "link": "facebook.com/groups/1373361046396315/permalink/2204691206596624/", "likes": 1, "comments": [{"username": "Ettore de Vita", "comment_text": "I’m"}]}, {"id": "2204694313262980", "text": "If you could visit only one place in Italy, where would it be and why?", "link": "facebook.com/groups/1373361046396315/permalink/2204694313262980/", "likes": 108, "comments": [{"username": "Anna Mahoney", "comment_text": "Venice"}, {"username": "Diane Matthews", "comment_text": "Tuscany💕"}, {"username": "Stuti Dhandhania", "comment_text": "Pienza. Is left a mark on my heart."}, {"username": "Gail Magnuson", "comment_text": "Sicily"}, {"username": "Sharon Pearce", "comment_text": "Positano with a visit to Da Adolfo beach restaurant 💕😎"}, {"username": "Lynda Evans", "comment_text": "Ancona"}, {"username": "Phillip Williams", "comment_text": "Positano ￼"}, {"username": "Rosemarie Mahoney", "comment_text": "Florence"}, {"username": "Yvonne van Gent", "comment_text": "San Quirido d’Orcia"}, {"username": "Catherine Gaudineau", "comment_text": "Alberobelo, matera, polignano a mare..."}, {"username": "Joanne Wright", "comment_text": "Umbria. Heaven on earth."}, {"username": "Sherrie Gillespie", "comment_text": "Positano"}, {"username": "Vicky Papantoni", "comment_text": "Again Matera!I Tuscany next trip"}, {"username": "Jeff Barnes", "comment_text": "Coliseum"}, {"username": "Carine Pattijn", "comment_text": "Sicily it wood be a new place for me😉"}, {"username": "Linda Guglielmetti O'Brien", "comment_text": "Oh wow one? Tuscany in the wine country part. Because any photograph picture I took could not capture the beauty of the countryside."}, {"username": "Maria Cappucci", "comment_text": "Amalfi Coast"}, {"username": "Dave Schickling", "comment_text": "Bologna - food, architecture, people, authenticity"}, {"username": "Gloria Covello-Morris", "comment_text": "The amazing beaches of Calabria!!"}, {"username": "Micah Baze", "comment_text": "That’s a hard question. Rome and Venice were two of my favorites"}, {"username": "Marybeth Caturello", "comment_text": "Capri"}, {"username": "Kenneth T Williams", "comment_text": "Yep"}, {"username": "Jill Gigliotti", "comment_text": "Jill Gigliotti"}, {"username": "Bettine Aba Eli", "comment_text": "Without even thinking about it VENICE and the weirdest thing while trying to rest I was just thinking of it and the feelings of excitement that I had when I arrived there, it is fantastic"}, {"username": "AnnMarie Pfeifer Decker", "comment_text": "I would go to the most remote village in Tuscany or Sicily."}, {"username": "Raphael Joson", "comment_text": "Rome or Florence"}, {"username": "Thomas Bragg", "comment_text": "Napoli, reconnect with family"}, {"username": "Maria Al", "comment_text": "Venice because I haven’t been there yet"}, {"username": "Urša Dvoršak", "comment_text": "Puglia or Sicily 🤔🤔🤷‍♀️🤷‍♀️"}, {"username": "Nancy Katchmar", "comment_text": "Ischia"}, {"username": "Lorraine Saliba", "comment_text": "I like all Italy it's my 2 Nd home after Malta"}, {"username": "Gwyneth Spadaro-Dutturi", "comment_text": "Mt Etna. On a clear day. Stunning for geology and views"}, {"username": "Patrick Snoeck", "comment_text": "FIRENZE"}, {"username": "Catspelle Jones", "comment_text": "One place is hard but I think it would simply have to be Rome. It’s historic, classic and the colosseum is considered one of the new seven wonders of the world 😃"}, {"username": "Anna Maria Gatt", "comment_text": "Rome for sure"}, {"username": "Jennifer Black", "comment_text": "The Isle of Capri. I could easily while away the hours for years looking at the fantastic views and eating the amazing food."}, {"username": "Deniz Bircan", "comment_text": "Sorry cant get used to italy’s culture that they use toilets without toilet seats\n\nI been few cities and was always like that, thats a no for me"}, {"username": "Janine Aziza", "comment_text": "Piazza Navona"}, {"username": "Craig Young", "comment_text": "Tough one.. Genoa, love the old port town.. for a third time"}, {"username": "James Trickett", "comment_text": "Lake Garda. We love it :-)"}, {"username": "Miranda Fioravanti", "comment_text": "My perfect 3-combi and 1 city:\n\"Marche💛 Abruzzo💛\nTrabocchi Coast💛\"\n-My Eternal city\" Rome\"💛"}, {"username": "Lily Mishra", "comment_text": "Incredible Italy 🇮🇹 💙 😍. Why one place of Italy. The whole Italy is spectacular. No words to describe about Italy. I visited twice to Italy. Before my death if I get opportunity to visit I will definitely visit ITALY only."}, {"username": "Inger Karin Røe Ødegård", "comment_text": "Florence - because of it´s beauty, renessance art and food❣️"}, {"username": "Alison Evans", "comment_text": "Sorrento it’s so beautiful 😍 and close to lots of other nice places to visit too."}, {"username": "Suzie Noren", "comment_text": "Some Iceland like Sardegna"}, {"username": "Shirley Newton", "comment_text": "Venice"}, {"username": "Cory Lee", "comment_text": "Cortona ❤️"}, {"username": "Pauline SassyNana DeRose", "comment_text": "Umbria, calming, not commercialized,\nbeautiful vineyards and sunflower fields. Beautiful lil towns"}, {"username": "Maria De Francesco", "comment_text": "Naples cause irs where my perents come from and its beautiful and also venice so beautiful and romantic"}, {"username": "Diana Burnett", "comment_text": "Sardinia. It soothes my soul"}, {"username": "Katie Brooks", "comment_text": "Rome"}, {"username": "Kim Newton", "comment_text": "I've been to a lot of places in Italy but Rome has my heart 💖 xx"}, {"username": "Domenico Cutrupi", "comment_text": "Calabria"}, {"username": "Peter Guzman", "comment_text": "Pisa, I love that town, because of the fun I've always had there"}, {"username": "Jessica McCawley", "comment_text": "Sicily every time"}, {"username": "Manoj M Sampath", "comment_text": "Naples- Food, beaches (amalfi, sorrento), vesuvius national Park to hike"}, {"username": "Kim Kennedy", "comment_text": "Dolomiti. Amazingly beautiful and it has so many wonderful places and things to see and do."}, {"username": "Dóri Kovács", "comment_text": "Capri"}, {"username": "Andrea Kroposki", "comment_text": "Sardinia"}, {"username": "Lee Mckay", "comment_text": "Only 1. Sorry too many to choose from"}, {"username": "Carmelina Ricioppo", "comment_text": "Why?"}, {"username": "Marie Gaynor", "comment_text": "Venice. Because - Venice! ❣️"}, {"username": "Kris Anne", "comment_text": "Sicily"}, {"username": "Ninoska Malik", "comment_text": "Literally everywhere. Italy is spectacular. Just choose what is your desire. Culture or beaches. Watch the serie of Stanley Tucci “Searching for Italy” then you will decide\n\nhttps://\ncnncreativemarke\nting.com/\nproject/tucci"}, {"username": "Salome Pillay", "comment_text": "Rome for the rich Catholic culture and the Vatican city"}, {"username": "Elaine King", "comment_text": "Venice. City of Romance"}, {"username": "John Glynn", "comment_text": "Lake Como"}, {"username": "Janet Goulding", "comment_text": "Taormina In Sicily, Capri or the Amalfi coast. All very pretty 🇮🇹"}, {"username": "Sandra Yee", "comment_text": "Capri, but over night"}, {"username": "Kay Stultz-Green", "comment_text": "Florence because Donna Hartsell is an Italy pro and she says it is the absolute best place ever!! Maybe I’d also like to see Lake Como area!!❤️"}, {"username": "Mirsada Miki Mikica", "comment_text": "Florence of course ♥️"}, {"username": "Alison Abela", "comment_text": "Very hard to choose. Italy is all beautiful and each city with its own beauty and charm. Rome, Milan, the region of Trentino Alto Adige, Puglia, Toscana, Sicily.. all magnificent on their own way 😍"}, {"username": "Ma Ria", "comment_text": "Firenze❤️"}, {"username": "Andrea Jackson", "comment_text": "Portofino"}, {"username": "Anastasiya Zhinipotoku", "comment_text": "Firenze ❤️"}, {"username": "Ann Hoyle", "comment_text": "I will let you know in 3 weeks\nI am visiting tonight.👏👏👏🎉🥂✈️"}, {"username": "Robin Burkholz Shaham", "comment_text": "Florence hands down. The best city with so much to do and easy to navigate. The history and art alone is magnificent, let alone the architecture and sculptures.\n\nThe food….. DELICIOUS."}, {"username": "Rachel Bradfield", "comment_text": "Rome - Breathtaking 🇮🇹"}, {"username": "Vida Amani", "comment_text": "Amalfi coast"}, {"username": "Hermineh Topalian", "comment_text": "I visited Venice ,murano,burano,\nthere are so beautiful"}, {"username": "Christopher A. Johnson", "comment_text": "If only one place, it must be Rome, the Eternal City. Don’t ask why, just go."}, {"username": "Lester Esterhuizen", "comment_text": "Rome for a 4th time.Just carved its way into my heart ❤️ 😊"}, {"username": "Linda Tibbles", "comment_text": "Florence"}, {"username": "Tesse May", "comment_text": "Capri!! The happiest place for me!! Just LOVE CAPRI❤️"}, {"username": "Arlette Bouez", "comment_text": "San Gimignano! A gem of the Tuscany scenery! We stayed at Villa Clara! Very nice hotel a few meters from the walls of the old town! Breathtaking sunset and the food is just amazing!"}, {"username": "Kerstin Anderson-Ridge", "comment_text": "Taormina- the most gorgeous place I’ve ever seen - great wine, tomatoes, people, views and pasta 🍝"}, {"username": "Julia Haggerston", "comment_text": "Asti don’t know why I’m just drawn x"}, {"username": "Simona Kimovec", "comment_text": "One place in Italy, ....it doesn't mater as long as it id Italy"}, {"username": "Lorraine Saliba", "comment_text": "Milan it's nice and good for shopping in the same time"}, {"username": "Piangporn Boonmima", "comment_text": "Before I would say Florence, I love art and Florence have a lot cool museum. But now I change to Bologna after visit this old city first time last year. Small but charming, delicious food everywhere, very old unique buildings around city , also 80% tourists are Italian that I feel this city very cool and unique… love ❤️"}, {"username": "Lilian Piotto", "comment_text": "Island of Elba, Tuscany!!"}, {"username": "Julie Thomson", "comment_text": "Campania, my grandparents are from there."}, {"username": "Terri Keeble", "comment_text": "Positano"}, {"username": "Rachelle Ethington", "comment_text": "Rome. If this would be your first experience inItaly, definitely Rome."}, {"username": "Louise Desnoyers", "comment_text": "Torino!"}, {"username": "Sandy Harle", "comment_text": "Positano ❤❤❤❤"}, {"username": "Eileen Mercieca", "comment_text": "Rome! So much too see! And walking so easy and transport of all type for any corner!! It has everything from monuments to historical places extremely beautiful churches museums beautiful relaxing giant garden zoo great shopping centres all you can mention you will find it and so accessable!!!"}, {"username": "Eileen Mercieca", "comment_text": "Been too Rome more than 25 times and will visit again!"}, {"username": "Billie Frances Swanda", "comment_text": "Florence. Just because"}, {"username": "Cynthia FreemanBradby", "comment_text": "Venice, it’s so beautiful"}, {"username": "Ronit Gorenstein", "comment_text": "Vieste"}, {"username": "Dawn Fitzgerald Kriegh", "comment_text": "Sardinia because it is beautiful."}, {"username": "Barbara van den Burg-Gerber", "comment_text": "Rome!"}, {"username": "Jarka Brůhová", "comment_text": "Perhaps Sicily And why? Beautiful countryside, antic sights, crystal clear sea."}, {"username": "Luis Rivera", "comment_text": "Roma"}, {"username": "Hatice Turgut", "comment_text": "Rome"}, {"username": "Neetal Timble", "comment_text": "Definately Venice"}, {"username": "Genoveva Drumeva", "comment_text": "La Maddalena, Sardinia"}, {"username": "Linda Chagnon", "comment_text": "Lago Maggiore as my family is from a small village not far from it."}, {"username": "Debbie Drummond", "comment_text": "Without doubt Lake Garda\nBreathtaking and beautiful stay in the north of the lake very scenic my favourite time would be June and my favourite location would be in Malcesine you have the cable car there to go up Mount Baldo and it’s stunning you can buy a boat ticket and hop around the pretty resorts of Torbole (morning coffee) Riva (lunch) Limone (afternoon tea) what a wonderful day out easy to visit Venice and the dolomites lots of excursions available or you can take the local bus around the lake and stop off in any of the resorts take in a market day or sightsee I would highly recommend taking in the opera in Verona it is the most magical experience and you’ll enjoy the whole experience even if you don’t like opera you get an English translation of the opera going in so you can follow the story have a wonder around Verona before hand and go to see Romeo and Juliet’s balcony\nThe pretty castle in Malcesine often holds free classical music events and that’s a nice way to while away an afternoon\nTop Tips\nIt’s all cobbled streets in Malcesine so don’t pack your heels\nRent a room with a Lake view if you can it’s worth every Penny it just looks like it’s been drawn I could look at it for hours …\nDon’t go in August it will be very busy with other tourists and the Italians are also on their holidays so very busy and very hot ….\nI was a travel agent for 20+ years and have been to some wonderful places around the world but Italy ticks all my boxes and Lake Garda is one of my favourite places ever it won’t disappoint ❤️"}, {"username": "Somayeh Jazayeri", "comment_text": "Rome"}, {"username": "Egidio Zammit", "comment_text": "Verona,"}, {"username": "Petra Valic", "comment_text": "Matera"}, {"username": "Peter Fitzsimon", "comment_text": "Is says something about a country when you ask for a favourite place and you get over 100 different answers .."}, {"username": "Brittany Verlenich", "comment_text": "Lake Como or generally the Dolomites. Stunning scenery."}, {"username": "Renee Madison Stryker", "comment_text": "Capri island, Portagino, Sorrento 🇮🇹"}, {"username": "Emma Dowling", "comment_text": "VENICE"}, {"username": "Mimi Torkkola", "comment_text": "I like to visit again in Ravello very peaceful area good for the soul 🇮🇹"}, {"username": "Natia Akhalashvili", "comment_text": "Naples 🤍"}, {"username": "Sara Punis", "comment_text": "Maybe is stupid to say but Italy is the most beautiful country in the world so it is imposible to say"}]}, {"id": "2204697569929321", "text": "Hi everyone!\n\nI’m currently in Rome but will be heading to Cinque Terre soon for my birthday. I’d love some recommendations on dinner spots that stood out to you. We are staying in Riomaggiore but up to go elsewhere 🙂 thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2204697569929321/", "likes": 1, "comments": [{"username": "Beth Stratton-Woodland", "comment_text": "Vernazza was my family’s favourite spot. Many sit down restaurants open from 12-3 and open again at 7. We didn’t know this. Learn from our mistake😃"}, {"username": "Tonsia Keytel", "comment_text": "Nessum Dorma in Manarola."}]}, {"id": "2204698426595902", "text": "Hello. Will I find these available in Rome and/or Milan by chance? It’s something I look forward to returning to Europe to have.", "link": "facebook.com/groups/1373361046396315/permalink/2204698426595902/", "likes": 7, "comments": [{"username": "Brenno Bianchi", "comment_text": "Yes are sold in Italy too, but I don't know how much common they are, the most popular brands of iced tea are Estathè, San Benedetto The and Beltè."}, {"username": "Markie MK", "comment_text": "They have many peach flavored iced teas available in Italy. I am sure you will find some that you like."}, {"username": "Alessandro Battxi", "comment_text": "Of course you'll find it"}, {"username": "Clare Boxer", "comment_text": "Yes. I practically lived on it - but not necessary the Lipton brand!"}, {"username": "Carmela Noble", "comment_text": "Esta thè pesca is waaaaaaay better"}, {"username": "Nina Truong", "comment_text": "Thank you, everyone!"}]}, {"id": "2204699819929096", "text": "My husband and I are traveling with only a large backpack and are looking for options from Rome to Positano. we are hoping to stop in pompeii and Mt. Vesuvius. I was looking at day trips from Rome to Pompeii and Vesuvius but they only allow small bags. Any good options besides just train ride ? I know we will need to get a car from Naples to Positano. Just more concerned with Rome to Naples area with tours. Trying to make it an easy travel day. I know there are places we can store our bags near pompeii ?", "link": "facebook.com/groups/1373361046396315/permalink/2204699819929096/", "likes": 3, "comments": [{"username": "Gary W Anderson", "comment_text": "Sorrento or Naples or you’ll be traveling a day."}, {"username": "Heather Sechrist", "comment_text": "Pompeii has a full size luggage check."}, {"username": "Wendy Wallin", "comment_text": "Better to take a ferry along Amalfi coast. Traffic is apparently bedlam driving the coast road."}, {"username": "Rachael Richardson", "comment_text": "There is luggage storage at the train station in Pompeii , there is a travel agent on the 1st floor they charge €6"}]}, {"id": "2204701613262250", "text": "Hey guys… need your help… family of 5 wanting to do Dolomites and Lake Como, so where would you suggest we stay? Coming in to those areas from Florence. Also, we will be flying out of Milan, so what’s the best option for transportation? TIA!", "link": "facebook.com/groups/1373361046396315/permalink/2204701613262250/", "likes": 0, "comments": [{"username": "Glenn Todd Webb", "comment_text": "Rent a car. Stay in Bellagio or Tremezzo. Villa balbianello and Carlotta are in Tremezzo. Villa Melzi in Bellagio."}, {"username": "Karla Danielle Heywood", "comment_text": "f"}, {"username": "Christine Cannon Neuman", "comment_text": "Following"}]}, {"id": "2204709186594826", "text": "Is anyone heard that will be any strikes scheduled for august?", "link": "facebook.com/groups/1373361046396315/permalink/2204709186594826/", "likes": 2, "comments": [{"username": "Nancy Mahrous Samuel", "comment_text": "Up"}, {"username": "Andrea Herbold K.", "comment_text": "Check here for strikes: https://\nwww.cgsse.it/\ncalendario-sciop\neri"}]}, {"id": "2204703333262078", "text": "I buy a piece of jewelry made in every place I travel to - any recommendations in Florence?\n(I will also be in Siena, Pisa, San Gimignano, and Venice, but I’m thinking Florence may be my best bet?)\nNothing over the top crazy expensive, but something good quality. Suggestions, please!", "link": "facebook.com/groups/1373361046396315/permalink/2204703333262078/", "likes": 27, "comments": [{"username": "Donna Templet Brignac", "comment_text": "Ponte Vecchio I Florence!"}, {"username": "Leigh Melville", "comment_text": "In Venice https://\nmarinaesusannase\nnt.com/en/\ncollezioni"}, {"username": "Jazz Caldwell", "comment_text": "Florence is an area known for their leather. I once owned a pair of red leather poinsettia earrings - fabulous!"}, {"username": "John Layman", "comment_text": "The gold store right next to st. Croce square or plaza. Best gold prices"}, {"username": "Marla Friedman Luterman", "comment_text": "Bought a beautiful ring from the oldest continually running family jewelry store on the Ponte veccio… I think it is Fratelli Piccini is the name…really\nCool experience to see their working showroom and if you find a piece of jewelry you love even more special"}, {"username": "Lora Jane", "comment_text": "Thank you all so much! This was exactly what I needed!"}, {"username": "Erika DeNicolo Palmer", "comment_text": "Check out DelBrenna jeweler’s - we love them! they have a store in Cortona and Florence"}, {"username": "Judy Carey", "comment_text": "I like your style!!!"}, {"username": "Gina Spyker Fairfield", "comment_text": "The leather school (Scuola del Cuoio) in Florence had some very cool leather bracelets."}, {"username": "Carolyn Madl", "comment_text": "DelBrenna jewelry just opened new Florence location, the owners are awesome! Jewelry is beautiful and all price points. I’ve been getting compliments since I returned home."}, {"username": "Laurel Waggoner Archey", "comment_text": "25 years ago, I bought three simple stackable gold bands on Ponte Vecchio, and they were a steal. I combine with other rings all the time. I recently had them cleaned and the jeweler told me it was a great purchase!"}, {"username": "Rhonda Smith", "comment_text": "Gold…."}, {"username": "June Mangone", "comment_text": "A Thousand Joys is a local artisan who makes jewelry with an Etruscan feel. She makes the jewelry in Florence, she has a place on the other side of the river."}, {"username": "Kim Doan", "comment_text": "Yes Venice"}, {"username": "Kathy Dowdell", "comment_text": "Lots of nice jewelry shops!"}, {"username": "Jayne Dawson Meyer", "comment_text": "Florence. Several shops to choose & lovely pieces as well. Wont be dissatisfied."}, {"username": "Heather Harper", "comment_text": "Janelle Butler-Sovechle\ns"}, {"username": "Veronica Solimando-Lynch", "comment_text": "Florence has an open market, SanLorenzo. You will find just about everything there."}, {"username": "La Cinzia", "comment_text": "Don't forget Volterra! There are some artisan jewelers with reproductions of Etruscan jewels. Volterra is one of the oldest towns in Italy and very near to San Gimignano"}, {"username": "Traci Carlson", "comment_text": "When in Florence please go to Torrini Jewelers. The family business was started in 1369. We purchased items directly from the owner. He was wonderful, and was very proud of his heritage and product. Amazing."}, {"username": "Sara Gilardi", "comment_text": "Paolo Penko jewels are amazing, often inspired by Florence. Maybe the silver pendants could be something"}, {"username": "Kristen Rozansky", "comment_text": "Definitely look at the Murano Glass places in Venice. Many beautiful and affordable options for jewelry."}, {"username": "Liz Sapienza-Martin", "comment_text": "I still wear the Italian gold ring I bought over 30 years ago on the Ponte Vecchio in Florence. A wonderful daily memory of my trip"}, {"username": "Debbie Milne Jenkins", "comment_text": "Gold earrings, rings etc from Florence or Cameo."}, {"username": "Ann Treviño Mears", "comment_text": "Misuri leather store in Piazza Santa Croce sells leather and has a jewelry store attached to it. I bought a beautiful white gold pendant there last month that I absolutely love."}, {"username": "Nancy Vahl Raske", "comment_text": "I do the same since I was 18!"}, {"username": "Lora Jane", "comment_text": "Thanks, all! Bought a beautiful silver ring on the bridge!"}, {"username": "Donna Worthington Shiro", "comment_text": "If I ever make it back to Florence, I’ll go to this store and buy the traditional florentine ring in 18kt white gold with Diamonds. It was spectacular and I’m still kicking myself. This jeweler makes everything by hand….he actually supplies some of the merchants at ponte vecchio. Do yourself a favor and go see this store!"}, {"username": "Tammy Moore", "comment_text": "Same here!!"}, {"username": "Candy Mattiello", "comment_text": "Go to San Gimignano… there is a jeweler on the left hand side of the street, maybe 200ft up the Main Street, who will make jewelry that YOU help design! My sister got a gorgeous necklace made out of silver… gorgeous ❗️"}, {"username": "Paula Bennett", "comment_text": "Murano glass has some pretty necklaces, earrings, bracelets."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "I would buy murano glass jewels in Venice."}, {"username": "Carla Onofrio", "comment_text": "Florence has an entire street of jewelry stores that go over the river. Ponte Vecchio. I found a beautiful vintage ring for a great price at Sergio Vaggi."}, {"username": "Crystal Angersola", "comment_text": "Gold from Ponte Vecchio."}, {"username": "Bea Kuckens", "comment_text": "While in Venice, there are some beautiful pieces from the glass factories in Murano. At the factory showroom they gladly let you try it on to see if it suits you."}, {"username": "Teresa Shawn Lane", "comment_text": "There is a guy over in a piazza who makes jewlery. Gosh I can't remember but it's #12 and you have to go through the door then through the gate. He's famous, he been around for years..somebody\nhelp me out!!"}, {"username": "Debra Fergison Canova", "comment_text": "Florence, the gold Bridge\nhttps://\nwww.italyperfect\n.com/blog/\nwp-content/\nuploads/2016/09/\nPonte-Vecchio-Su\nnset.jpg"}, {"username": "Jennifer Smith", "comment_text": "There is a jeweler in San G who works in silver and bronze. My friend has several piece from him and thinks his prices are good"}, {"username": "Paula Bodden", "comment_text": "There is a very nice gift shop near the Leaning Tower in Pisa. I bought a beautiful necklace there that I get many compliments on every time I wear it."}, {"username": "Jill Tingley", "comment_text": "Gold"}, {"username": "Robert Castelli", "comment_text": "Go to The Ponte Vecchio Bridge…\nJewelry vendors lining each side"}, {"username": "Dixie Kotylak", "comment_text": "Ring?"}, {"username": "Anita Lahey", "comment_text": "DelBrenna Jewelry - The Italian Boutiques"}, {"username": "Marcia Hattman Colucci", "comment_text": "I’d buy a Florian coin ring.. gold or gold silver combo. They also do pendants.."}, {"username": "Carrie Jaquess", "comment_text": "There’s a company that makes small pendants that mimic the rose windows of major cathedrals. You can buy them in gold, silver, gold plated and with or without semi precious stones. Can’t remember the name but saw them in the gift shop of the Assisi Duomo s week as jewelry shops in Rome and Assisi."}]}, {"id": "2204709806594764", "text": "I feel like some people need a reminder to be kind when commenting on posts. As mom always taught us growing up, if you don't have anything nice and productive to say, don't say anything at all. It's reallyआणखी that simple. Sarcastic comments are pointless. We're all here for a positive reason - the beautiful country of Italy. Keep your comments just as beautiful.\n\nAlso, here's a picture of our stay in Manarola. Morning coffee with a view 💕", "link": "facebook.com/groups/1373361046396315/permalink/2204709806594764/", "likes": 225, "comments": [{"username": "Angela Hollis", "comment_text": "Good comment and picture! We're planning a week in Manarola in October. Any advice? Restaurants? Must-do's?"}, {"username": "Dorothy Seal", "comment_text": "Brava....grazie"}, {"username": "Bonnie Loftspring", "comment_text": "Lovely picture & yes, people respond/post w an attitude they would never speak to someone’s face."}, {"username": "Bea Kuckens", "comment_text": "Love the comment and the photo."}, {"username": "Sharon Vogt", "comment_text": "Where did you stay? Beautiful picture"}, {"username": "Kristin Brady", "comment_text": "Well said! Thank you."}, {"username": "Mardi Schnitzer Spitzer", "comment_text": "Thank you! It’s very disappointing to me when people are snarky!"}, {"username": "Stuart Vogt", "comment_text": "Unless you have a bad experience and people need to be warned."}, {"username": "Mary Andreotta", "comment_text": "100% agree!!! Thanks for sharing your beautiful photo!"}, {"username": "Judy Carey", "comment_text": "I just commented on another post where someone was being judgmental. The poster was asking for a hotel recommendation by the Spanish Steps and the commenter jumped all over the decision. Rude!"}, {"username": "Marg Ryan", "comment_text": "Well said 👏🏻"}, {"username": "Kylie Hall", "comment_text": "It’s why most stop posting sadly, must suck to be them tho!!"}, {"username": "Anne Espo", "comment_text": "Gorgeous!!"}, {"username": "Michelle King", "comment_text": "Gorgeous"}, {"username": "Jack Partington", "comment_text": "Beautiful!"}, {"username": "Rita Sanza", "comment_text": "I used to live in la Spezia next to the cinque terre. And I've just comeback from Italy last week. Manarola is fantastic"}, {"username": "Eivan Maroki", "comment_text": "💯 agree with the comment and the picture is amazing"}, {"username": "Jack Giacomo Avondo", "comment_text": "Jack Giacomo Avondo"}, {"username": "Tracey O'shea", "comment_text": "Agree..after I was shot down about asking about spas I won't be asking any more questions. I truly don't understand why ppl just don't scroll on...rather than being sarcastic😔"}, {"username": "Dámaris Ojeda Fernandez", "comment_text": "Completamente de acuerdo. Estos grupos estamos para ayudarnos y exponer nuestras experiencias y así hacer más agradable las vacaciones del que pregunta. No comprendo los comentarios sarcástico como tu dices o los que te contestan... busca en Google... para eso como tu dices.. mejor callar."}, {"username": "John Layman", "comment_text": "It,s all about helping others and sharing tips and suggestions to make your trip enjoyable"}, {"username": "Phuong Nguyen", "comment_text": "We have been there , fabulous place . Enjoy the view"}, {"username": "Angie Baumgartel Conley", "comment_text": "100% agree! We are all just excited about our upcoming trips and are trying to plan unforgettable trips to places we have never been!"}, {"username": "Carrie Stallard", "comment_text": "We had the same idea!"}, {"username": "Carlene Ellis", "comment_text": "Great photo! Looks amazing"}]}, {"id": "2204188896646855", "text": "Edit: Thank you everyone, I have downloaded Flush app and will carry €1 coins. Appreciate your kindness.\n\nApologies for 💩content.\nI have a bowel condition and sometimes I need to find a toilet quickly. Is there a toilet location app and what are the chances of being able to use a toilet in a cafe/coffee shop? Thank you for your kind responses.", "link": "facebook.com/groups/1373361046396315/permalink/2204188896646855/", "likes": 54, "comments": [{"username": "Michelle Murphy Margolati", "comment_text": "I bring tissues that come in small individual packages. The kind you carry when you have a cold. Works great for bathrooms without TP and they don’t take up much room."}, {"username": "Genevieve Hunt", "comment_text": "FLUSH is a helpful app."}, {"username": "Karen Gregorchuk", "comment_text": "Courtney Greg"}, {"username": "Micheal Gunner", "comment_text": "Flush as mentioned a number of times but also Toilet Finder but if you are polite and occasionally have to buy some water or a drink most places will let you use their toilet, travelled up and down Italy and never got denied but occasionally they will ask you to purchase something"}, {"username": "Jo Ann Ciuffini Forcino", "comment_text": "Does Flush work all over Italy or just in Rome?"}, {"username": "Jazz Caldwell", "comment_text": "Yep, the Flush app...you are not alone, clearly!"}, {"username": "Mimi Nguyen", "comment_text": "Go into any cafe and buy something then you can use the toilet for free or pay 1 euro and use the facility if you don’t want to buy anything."}, {"username": "Robin Burrell", "comment_text": "You will need to buy an item to use toilet."}, {"username": "Kathleen Curatolo Hannah", "comment_text": "Run into a restaurant or bar. I’ve never been held back when I can’t “ hold back”!"}, {"username": "Angie Formica", "comment_text": "Always carry tissues."}, {"username": "La Cinzia", "comment_text": "Usually at the bar you ask for a coffee (or something) and you can use the toilet"}, {"username": "Carine Boon", "comment_text": "Don't forget train stations, department stores, hotels, some metro stations, museums, hospitals, parks. I found a lot of places that were not on Flush in Milan."}, {"username": "Laura Okoniewski", "comment_text": "I have GI issues too, and am super super worried about how not to have an accident in public (IBS-D and BAM)... Thank you, OP, for asking this question!!! And thanks to everyone for your advice!!!"}, {"username": "Jenny RV", "comment_text": "Occasionally public bathrooms may not have TP and/or soap etc. So bring tissues and a hand sanatizer etc."}, {"username": "Laura McLeran", "comment_text": "Toilets in cafe/coffee shops are reserved for customers, so buy a bottle water and they will let you use the restroom. Also, check out the larger hotels as they often have restrooms in the lobby."}, {"username": "Miyuki Kanno Paul", "comment_text": "I carry a roll of TP wherever I go in Italia. In fact, my husband always reminds me of it as a checklist item before leaving our hotel. I’ve had enough experiences that I must pack a couple of boxes of Imodium in my suitcase along with other FirstAid package as well.\nIt’s not the matter of if. It’s a matter of when I have an urgent situation. It can happen to anyone at any given moment!"}, {"username": "Dawn King", "comment_text": "I also have a bowel condition and didn’t have any trouble finding toilets at all and they were all nice"}, {"username": "Ellis Peacock", "comment_text": "Create and print a little card in Italian explaining your condition and that your happy to pay a few euros for the privilege."}, {"username": "Raa Austin", "comment_text": "I cannot wait card in Italian\n\nhttps://\ncrohnsandcolitis\n.org.uk/\ninfo-support/\nbecome-a-member/\ncant-wait-card"}, {"username": "Debbie Potter", "comment_text": "I saw in some of my research that they charge to use the restrooms in Italy?...is this true? If so between my husband and I, we're gonna be broke on just using their restrooms...lol"}, {"username": "Sierra Behrens Tibbetts", "comment_text": "I have read and heard horror stories about the bathroom facilities in much if Italy. Are there no health codes? Why are the public restrooms so gross?"}, {"username": "Mike Adams", "comment_text": "Always carry hand wipes"}, {"username": "Enzo Teutonico", "comment_text": "BRING TERLIT PAPER. Alot of places wont have any toilet tissue. Carry some in your bag"}, {"username": "Steph Craddock", "comment_text": "Bars are everywhere. Send your partner to buy something, while you run for the loo."}, {"username": "Sascha Smith", "comment_text": "I think we all need to know where to locate a restroom in a time of need!! No worries!!"}, {"username": "Ruth Akutu Maccarthy", "comment_text": "Aside from the app, also start taking probiotics a month prior to departing. Make sure it has Saccharomyces boulardii in it which is the one indicated for diarrhea"}, {"username": "Kate Brennan", "comment_text": "Alexandra Brennan , good info 💩"}, {"username": "Karen Le", "comment_text": "This is such good info. I had no idea there was such a thing as the Flush app. Thanks all!"}, {"username": "Ali Everson", "comment_text": "That will be very important to get sorted as nearly all public toilets require a Euro and there can be long queues. All the best with your planning. 😀"}, {"username": "Teena Leuba", "comment_text": "Denise Bibby"}, {"username": "Catherine Hatfield-Fuster", "comment_text": "We also found that Google Maps showed public toilets as well."}, {"username": "Lisa Roth", "comment_text": "Flush app!"}, {"username": "Stephanie Holman", "comment_text": "Tim Holman, now THIS is good info!"}, {"username": "Luca George Tudor", "comment_text": "Depending on the area pubblic toilets are not always “nice” to be used but if you go to the bar and take a coffe or anything they will allow you to use the toilet without any problem"}, {"username": "Jennifer Pompa Strong", "comment_text": "I have Crohns and this freaks me out too! I’m planning on going in a year or 2 and it already worries me lol!"}, {"username": "Wendy Harrison", "comment_text": "Save up some toilet paper 'ends', and put them in little baggies, and carry one with you when you're out."}, {"username": "Annette Tamminga", "comment_text": "Thank you for asking. I have IBS and the stress of worrying about finding a restroom makes it worse."}, {"username": "Clare Davison", "comment_text": "No need to apologise,by the way."}, {"username": "Marc Rosenfeld", "comment_text": "Just go into any restaurant or cafe and buy a drink. They won’t give you a hard time"}, {"username": "Jacqui Hakes", "comment_text": "Many options! Caffès - just buy an espresso etc- quite economical; some gelaterias with sit down space if someone’s in the mood for a cold treat same option; all\nMacdonalds you can just walk in & use ( Burger King requires a # on the receipt); or if in a pinch offering a euro or two at many restaurants will work. Just take a mini hand sanitizer & small packet/\nZip lock of emergency TP with you at all times as sometimes ( often) toilettes are out of soap or paper ."}, {"username": "Stephanie Evans", "comment_text": "Honestly we always seemed to struggle to find bathrooms! When we landed in the states I was so happy to just be able to pee when I wanted!"}, {"username": "Natalie Medina", "comment_text": "The Flush app! 🧻"}, {"username": "Michelle Pedersen Kemmerer", "comment_text": "Thank you for this post! I also have GI issues and worry about this as I am going in October. I have downloaded the Flush app but just in looking around my area it doesn’t seem to have many options. Hoping that’s because I don’t live in a large city."}, {"username": "Janet Messanelli Bozzone", "comment_text": "Download “Flush”. It has listings of public toilets worldwide. I usually opt for a cafe if there’s a choice because most of the public toilets have a small charge. Why not get a coffee instead. 🤗"}, {"username": "Susan Lowry Lamb", "comment_text": "We've never had an issue in Italy. Love, Your soul sister."}, {"username": "Yvonne Burch Mercer", "comment_text": "I downloaded the flush app but didn’t find it to be helpful because the options were not plentiful or seemed to be nearby when I had to “go.” I mean sometimes you just can’t make it five blocks!"}, {"username": "Naritta Nurit Matheus", "comment_text": "Do not drink coffee as it eilmake ur situation worser. Go to shop and buy a medicine"}, {"username": "Kati Tor", "comment_text": "I installed the flush app too but never used it. Once emergency comes u wont be able to concentrate on finding a toilet using the app. My personal suggestion (although not the healthiest) is low dose imodium every 2 days."}, {"username": "Renee Kremesec", "comment_text": "You can use restrooms easily in Italy. Just dont go to France."}, {"username": "Alice Francesca", "comment_text": "I have Ibs and I am Italian.When I need to go I just buy an espresso or a botte of water in a cafe and use their restroom.."}, {"username": "Lisa Silverman", "comment_text": "Yes there are many options for bathrooms, however not all necessarily quick. You may have to walk a bit."}, {"username": "Rachael Richardson", "comment_text": "We went in anywhere to use toilet never had to buy anything ! Just be cheeky and go in ! I’ve done this all over on my travels never had a problem"}, {"username": "Daisy Yoo", "comment_text": "flush"}, {"username": "Carly Botelho", "comment_text": "Flush app"}, {"username": "Catherine Carson", "comment_text": "Caron Sullo Carson"}, {"username": "Kristen Rozansky", "comment_text": "Flush app"}, {"username": "Sue Clarke", "comment_text": "My partner is coeliac, so l understand your worries! I have to drink lots of water with my health issues, so anything toilet related is important to me too.... This Facebook page is fantastic with information. Hopefully, one day in the next year or so l will get to Italy. Long flight from Australia!"}, {"username": "Renee Rundle Stoneham", "comment_text": "The Flush app"}, {"username": "Jeanne Ricca Newman", "comment_text": "Good info Jennifer Ricca-Chiapperi\nno"}, {"username": "Christine Limmer", "comment_text": "McDonalds is good and any other fast food restaurant when you are caught short!"}, {"username": "Cecilia Christine Costantini", "comment_text": "You need to buy something (coffee/bottle of water/candy whatever) in coffee places to be able to use the toilet. Often you will see signs on the door saying: \"bagno/\ntoilette/wc solo per clienti\" meaning only paying customers can use it. If it says \"bagno guasto/fuori servizio' it means it is broken (often it is not, but they prefer not to let customers use it)."}, {"username": "Kirsten Rea Davis", "comment_text": "There are cafes and bars all over-just buy a water or coffee and they will let you use the toilet."}, {"username": "Kerrin Barassi", "comment_text": "Flush 🚽"}, {"username": "Joy Clift", "comment_text": "Got to be honest, the loo situation isn't always amazing. I hardly ever found the trinity of toilet seat, toilet paper and soap. Have some soap and paper handy"}, {"username": "Jennifer Larese Taylor", "comment_text": "Why not get a sunflower lanyard? It is the recognized symbol for hidden disabilities. You are more likely to get support if you are wearing one"}, {"username": "Dayna Scinto", "comment_text": "I have found the best toilets (cleanest) are the ones you pay to use. I’m not sure of an app though sorry 😞"}, {"username": "Laura DeCicco", "comment_text": "Flush."}, {"username": "Christine Philomena", "comment_text": "This app"}, {"username": "Amelia Bonannella", "comment_text": "A lady posted yesterday saying there was an app called The Flush, but that she didn’t use it as she used restaurants/\ncafe/bars for restrooms"}, {"username": "Bill Bowler", "comment_text": "Flush app"}, {"username": "Voula Ladas", "comment_text": "There’s lots of Apps to find a toilet. Flush, Toilet Finder, Accessaloo and so many more ."}, {"username": "Donna Kate", "comment_text": "The app is flush"}]}, {"id": "2204630993269312", "text": "Best areas to stay in Milan for one night? Needs to be close to train station to get to Lake Como", "link": "facebook.com/groups/1373361046396315/permalink/2204630993269312/", "likes": 0, "comments": [{"username": "Raffaele Bagnarola", "comment_text": "I would say to stay around Cadorna station (or on a green metro line stop)- which is a lovely area next to the castle- plus you have the station where train depart for Como"}, {"username": "Brenno Bianchi", "comment_text": "Which one of the three?\nThe area around Milano Centrale is quite terribile, the one around Milano Porta Garibaldi is fine, the one around Milano Cadorna is nice. All of them have direct trains to Como."}, {"username": "Mike Adams", "comment_text": "AC HOTEL next to train station Garabaldi station"}]}, {"id": "2204425236623221", "text": "Hi! In Rome now- looking for recommendations for a \"mall\" or location where I can buy walking shoes. Bonus points if we can find soccer cleats!\n\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2204425236623221/", "likes": 1, "comments": [{"username": "Ville Lignell", "comment_text": "Just try any shoe shop in the city. Malls aren't a thing in Italy."}, {"username": "Sigrid Cormier", "comment_text": "Google it! I found 3 sports shops that sell cleats. Your the best judge of location that works for you."}, {"username": "Nydia Bryan", "comment_text": "Look up La Rinascente or OVS these are stores often mentioned. OVS has several locations"}, {"username": "Monica Colontonio Macho", "comment_text": "There are malls in Rome, if you google shopping centers or malls you will find them on the outskirts of Rome. You will probably have to take a taxi."}]}, {"id": "2204494293282982", "text": "For anyone who is done Bellaggio and Milan. If we only have two full half days, are we killing ourselves to do both or would you recommend one or the other? We are not the relaxing sit by the beach kind of vacationers we are they get up and go type.", "link": "facebook.com/groups/1373361046396315/permalink/2204494293282982/", "likes": 1, "comments": [{"username": "Gianna Onesi", "comment_text": "My bucket list! If there I would definitely do Milan, Lake Como and Bellagio enjoy it!"}, {"username": "Laura Cardinale", "comment_text": "Milan is a big city, Bellagio is a very small town.\nHalf a day is enough ti enjoy Bellagio and its sightseeing, not enough to enjoy Milan (unless you want to see only The Duomo from the outside)"}, {"username": "Miyuki Kanno Paul", "comment_text": "We spent only 2 nights in Bellagio. We were pretty busy driving around all over the place such as visiting friends in Ticino in Switzerland, hiking and aperitivo in Varenna, and dinner in Chiavenna. We went back to Milano for 1 full day/\nnight(including Duomo and Cenacolo Vinciano) before flying out early morning from Milano Malpensa."}, {"username": "Amy Schmelzle Walsh", "comment_text": "It took us about 1 1/2 hours to get from Milan to Bellagio by car after the train from Rome to Milan we had a day and a half there. It was plenty of time- mellow and relaxing we took a boat all over the lake and walked back and forth from our Airbnb to town."}]}, {"id": "2204550966610648", "text": "Hi there,\nLooking to book flights to Milan for a holiday to lake como. Been watching flights all month and just went to book them after being paid and they’ve gone from £600 for two to £1100 for the two of us for 31st of august! Definitely cannot afford this and all other flights are massive layovers or too many changes.\n\nDoes anyone know the best time to book flights or cheaper ways to get to lake como?", "link": "facebook.com/groups/1373361046396315/permalink/2204550966610648/", "likes": 2, "comments": [{"username": "Bea Kuckens", "comment_text": "It's all supply and demand. August is high demand. Look at the airline calendar - some days of the week are even less expensive than others."}, {"username": "Jenny Payne", "comment_text": "In Australia,April\nis our good time to book for Europe but peak time & school holidays are expensive 🌻"}, {"username": "Anna Ngo", "comment_text": "Google flights. Play with the dates. Low Prices shown are listed for basic economy. If looking for premium economy or higher, go to their airline website.\nAlways look during the opposite season.\nEx: booking for summer vacation? Start looking during late fall and during winter time (5-6months in advance).\nMy flight price for my winter trip was half the price of what the summer prices were giving me"}, {"username": "Michela Zanni", "comment_text": "July and August are very high season in Italy. Nothing Is cheap in these months"}, {"username": "Ishbel Raffle", "comment_text": "I’m seeing Wizz air price single from Stanstead is£25. Add extra for bags or just go with an underseat bag"}, {"username": "Giovanni Pianigiani", "comment_text": "£ in sense that you are flying from the UK? Where from? I can't find anything for more than 120€ right now between London and Milano"}, {"username": "Maja Vidmar", "comment_text": "unfortunately you are too late. It will only go up."}, {"username": "Lucy Lou", "comment_text": "Use skyscanners website and it shows you all the flights and prices"}, {"username": "Marianne Hendriks", "comment_text": "Remove cookies and search history."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2204585493273862", "text": "hello, has anyone flown with KLM Royal Dutch Airlines from Rome to the USA? I am looking for flights next March.", "link": "facebook.com/groups/1373361046396315/permalink/2204585493273862/", "likes": 2, "comments": [{"username": "Ania Kubica", "comment_text": "Yes, we have been travelling frequently through Amsterdam. No issues. KLM code shares with Delta."}, {"username": "Petra Keen", "comment_text": "We have flown KLM from Rome to YVR (Vancouver BC) via Amsterdam twice and they were excellent!"}]}, {"id": "2204557629943315", "text": "Please recommand hôtel or appartement in Firenze with a balcony or large open windows near train station for 2 adults. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2204557629943315/", "likes": 1, "comments": [{"username": "Schalk Van Wyk", "comment_text": "Hotel Boccaccio"}]}, {"id": "2204572093275202", "text": "I will be in Sienna during September. We want to spend a day wine tasting. I rented a vehicle so transportation is taken care of. Do you have any recommendations of wineries within a reasonable drive from Sienna. We are somewhat spoiled because we live close to Napa valley. I would love to find something in a castle or beautiful views with amazing red wine.", "link": "facebook.com/groups/1373361046396315/permalink/2204572093275202/", "likes": 2, "comments": [{"username": "Alice Francesca", "comment_text": "Montalcino or Montepulciano.B\nest red wine."}, {"username": "Alice Francesca", "comment_text": "https://\nwww.toursoftusca\nny.it/tours/\nmontepulciano-wi\nne-tours/\n?utm_source=gads\n&kw=montepulcia\nno+wine+tasting\n&gclid=Cj0KCQjw\n2qKmBhCfARIsAFy\n8buKbeYd9nfXz0j\nol4IdHTNtWFYPO9\n0xCUe9QsHAtG7e6\nLPtlbJx241QaAq_\njEALw_wcB"}, {"username": "Alice Francesca", "comment_text": "https://\nwww.consorziobru\nnellodimontalci\nno.it/en/583/\nwines"}, {"username": "Philip Curnow", "comment_text": "Borgo Casa al Vento"}, {"username": "Romilly Farina", "comment_text": "We went to a small winery called Montefioralle. It was a spectacular view and I loved their Chianti. Olive oil was great too."}, {"username": "Rebecca A. Baer", "comment_text": "I loved Chianti Winery and store."}, {"username": "Tania Williford", "comment_text": "I booked a Brunello tour. I used to be a wine geek so I was excited to book some of wineries that make the big daddies."}, {"username": "Lisa Zimmerle Rutt", "comment_text": "Banfi, the castle in Montalcino does tastings, (it’s a co op), I enjoyed Altesino but not a castle or anything, just very nice people and a good wine."}, {"username": "Filomena Rinaldi", "comment_text": "Definitely Montepulciano is worth a visit...the whole town is amazing.."}, {"username": "Lora Ruscitti Covington", "comment_text": "DeRicci in Montepulciano is wonderful. Beautiful views and great wine."}, {"username": "Schalk Van Wyk", "comment_text": "Consider visiting the Montecucco area -\nwonderful Sangiovese at a fraction of the price of Brunello. Basile winery is especially worth visiting."}, {"username": "Jana Lynn Longo", "comment_text": "In addition to Montefioralle..\n.. Check out Castello di Volpaia and Castello del Terriccio."}]}, {"id": "2204573826608362", "text": "Do rental car companies have age limits in Florence?", "link": "facebook.com/groups/1373361046396315/permalink/2204573826608362/", "likes": 2, "comments": [{"username": "Carole Tarlap", "comment_text": "Rental companies have age requirements ALL OVER. Check the companies requirements 🤷"}]}, {"id": "2204575243274887", "text": "From Lake Garda to Tirano has anyone use any transport other than the train.\nRome2rio says train is almost 7hours but drive is less than 3 hours. We don’t want to hire a car while on holiday so wondering if there is a bus or car transfer options.", "link": "facebook.com/groups/1373361046396315/permalink/2204575243274887/", "likes": 1, "comments": [{"username": "Stefano Bressanelli", "comment_text": "Peschiera del Garda to Milan. Then Milan to Tirano . By train."}, {"username": "Brenno Bianchi", "comment_text": "The shortest route by public transport is likely firstly by train Peschiera del Garda-Brescia and Brescia-Edolo, in Edolo take the bus for Tirano which is on the other side of the montain."}, {"username": "Elizabeth May La Duca", "comment_text": "Www.GoogleMaps.\ncom/directions"}, {"username": "Elizabeth May La Duca", "comment_text": "download app for Google Maps"}]}, {"id": "2204577779941300", "text": "Anyone do a day trip from Rome to Sperlonga beach. And maybe a cave boat trip whilst there ?", "link": "facebook.com/groups/1373361046396315/permalink/2204577779941300/", "likes": 2, "comments": [{"username": "Philip Curnow", "comment_text": "It is possible by train. But a local bus will pick you up from the nearest station to complete your journey there. Plan you return carefully timewise"}]}, {"id": "2204577783274633", "text": "Any recommendations for a hotel in Rome. We’d like to be as close to the airport as possible. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2204577783274633/", "likes": 2, "comments": [{"username": "Sandy Radican Shikaly", "comment_text": "Hilton at the airport... city center is about 45 min away"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Rome is an hour away from the airport."}, {"username": "Rachel Gray", "comment_text": "We stayed at the Sheraton but if I could do it again, I’d stay closer to the city center and just take a taxi to the airport."}, {"username": "Tony-Annette Unpingco Ada", "comment_text": "Mercure. it's about fivr minutes from the airport"}, {"username": "Tom McKeev", "comment_text": "Leonardo train straight to the airport from Roma termini. Can stay close to there and be close to everything"}, {"username": "Lisa Schalig-Winter", "comment_text": "We stayed at Hotel Academy the night before our flight. It was fine for 1 night. We were within walking distance of some great restaurants. 10 minutes from the airport."}, {"username": "Sonita Sandhu", "comment_text": "Unless you have a super early flight don’t stay near the airport. Take the Leonardo express. It’s fast and easy or a cab."}, {"username": "Alberta Sensale Chirico", "comment_text": "Thank you everyone! 😊"}, {"username": "Gay Bell DiBartolomeo", "comment_text": "Hilton. Can walk to terminal."}, {"username": "Colleen Schimmenti", "comment_text": "We left piazza del popolo yesterday at 630 am. 30 min to airport. We stayed at GCF Luxury Suites on Via Del Corso."}]}, {"id": "2204609699938108", "text": "Venice Carnival.\nIt has been on my „ to do” list for a while now, thinking we might do it in 2024. Travelling from USA, was thinking about Milan as a base. Will one day during the Carnival be enough? Just wanted to walk around, not attend any paid events. What places are worth visiting at that time of the year in the north?\nWe have been to Italy several times, but never concentrated on the north.", "link": "facebook.com/groups/1373361046396315/permalink/2204609699938108/", "likes": 0, "comments": [{"username": "Philip Curnow", "comment_text": "Why not Verona as a base?"}, {"username": "Michela Zanni", "comment_text": "It's a nightmare during Carnival. So crowded"}, {"username": "Tonsia Keytel", "comment_text": "Lake Como, Lake Garda, Cinque Terre."}, {"username": "Lushan Yao", "comment_text": "Venice Carnival is a very memorable experience! You see elaborate and elegant costumes everywhere, especially at St. Mark’s Square. There’s no need to pay for any special events. The ambience itself is beautiful!"}, {"username": "Edoardo Casolo", "comment_text": "Carnival is nice but super crowded. Use something closer as a base like Verona or padova"}, {"username": "Eric Parks", "comment_text": "Milan is a ways from Venice and not the best tourist city imo. I'd stay closer. I'd also spend at least two full days playing in Venice if not more."}, {"username": "Philip Curnow", "comment_text": "So happy so many in this group don't like Milano and call it 'non touristy'. Let's keep it that way. Milan's rubbish, stay away. There's always the Cinque Terre and Poggibonsi 😆"}]}, {"id": "2204600486605696", "text": "Has anyone booked an extra seat on a red eye flight from the US? We’re looking at flights for next summer and Premium Economy seats have gone up significantly over the last month. It would be $1000 less expensive to book 3 main cabin seats instead of 2 premium economy seats. We just want to have enough space to get a little sleep without climbing over/being climbed over to use the restroom.", "link": "facebook.com/groups/1373361046396315/permalink/2204600486605696/", "likes": 21, "comments": [{"username": "John LaSalle", "comment_text": "I’ve done it from China to NY, it was years ago. It wasn’t a problem."}, {"username": "Jessica Stewart", "comment_text": "I would wait to book your flights imo they could go down"}, {"username": "Nicole Lee", "comment_text": "I booked economy plus (emergency exit) because there was no premium plus available based on plane which was false but it worked out we were right behind premium plus- and we had more leg room then premium plus back row. If you do it i noticed the back row of premium plus was not as spacious as the other rows!"}, {"username": "Lorissa Gill", "comment_text": "I didnt think you could do this unless you were to use a fake name for the third seat?"}, {"username": "Lisa Silverman", "comment_text": "Doesn't matter how many seats you have when you're sitting next to a 2 year old that cried for 5 hours straight. No one slept on that flight."}, {"username": "Kelsey Larabie", "comment_text": "Are they guaranteed to be together? My husband and I ended up sitting on opposite sides of the plan on our last flight it was so full."}, {"username": "Michelle Murphy Margolati", "comment_text": "Some people purchase two seats because of their size. I think you could do it for comfort."}, {"username": "Carla Johnson", "comment_text": "I read a story some time back about a person purchasing an extra seat but the flight was over booked and airline made person give up extra seat since no one was technically sitting there, the person was compensated for it"}, {"username": "Michael Barnes", "comment_text": "Im generally considered a fat person and need leg room as well as girth.\nEconomy wasn't an issue in a 2-5-2 config"}, {"username": "Mitch Rollings", "comment_text": "I'm 6'4\", 385. I used to fly often for the gov't; and, of course, I could only fly economy. I don't know how many times I have been fussed at because my knees were jammed into the seat in front of me and the passenger couldn't recline. As I walk down the aisle, people would avert their eyes as if I wouldn't sit next to them if they didn't look inviting. I vowed to never fly economy once I retired. My wife saw it for herself on a recent trip to Greece. She got mad at the passenger in front of me when he kept berating me because he couldn't recline. I was so used to it I just explained my height and shrugged him off. She lit into him...that's my girl!\nANYWAY, we went to France a couple of months ago and I had your same idea. It was a couple of thousand dollars cheaper to get a row of three premium economy seats than to buy two business class seats. Since it was an international flight (Tulsa to Marseilles), we elected to go with the business class seats. If it was a relatively short domestic flight, we might have gone the three seat route. The reason we went business class was the fear of a cancelled flight, or an equipment change, or an overbooking where they would give the extra seat to another passenger. We would not be guaranteed that those seats would be together if there was an equipment change or cancelled flight. Unfortunately, my wife loved being able to stretch out completely and sleep for many hours. I have a feeling all our international flights will be upfront from now on. BTW, business class in Europe is a regular row of economy seats with the middle seat left empty."}, {"username": "Tami Sue", "comment_text": "That won't work. You have to buy the ticket in some name. And they need to check in. No check in they will give that seat away."}, {"username": "Bea Kuckens", "comment_text": "Depends on the month. We just looked at Denver to Munich in March and that would save us $400. If you're going in June, then yes, a more significant difference. Consider two economy seats, bulkhead, across the aisle from each other..."}, {"username": "Robin Burrell", "comment_text": "If you book the premium economy you may be able to upgrade to business close to the flight or at the airport"}, {"username": "Kim Berg", "comment_text": "I would look at flights every day (I know obsessive) but it paid off big time for us. We are going in May and I watched the flights day for 3 weeks and one day on a Wednesday around noon the flights for Delta One (lay flat seats) round trip dipped so we booked. Next day they went back up over $1500 per person."}, {"username": "Kathy Hogan Van Mullekom", "comment_text": "I tried to book an extra seat and my cruise consultant said it’s not allowed. Not sure why when a paid seat is a paid seat."}, {"username": "Karen Bowman", "comment_text": "What a great idea! Never thought of going that before."}, {"username": "Susan Sorrels Resor", "comment_text": "Good idea"}, {"username": "Jessica McGuigan Howard", "comment_text": "We did it from Rome back to the US. We just had to book on the phone so they could note it was an extra seat, then we had to have our boarding passes printed at the airport. It was a little bit of a hassle when we switched planes in Canada, as they kept getting confused about the extra ticket/\nboarding pass. Ends up my kids didn't even end up sleeping on the flight, and we totally didn't need the seat 🙄 But it was nice to have extra room."}, {"username": "Christine Philomena", "comment_text": "We booked the exit row seats not the one closest to the door and felt we had plenty of room."}, {"username": "Lisa Ann", "comment_text": "We are taking at 12:30 am this month from NY and plan to sleep as best we can. Good rate and honestly would rather do that and get to rome around 3pm than fly all day."}, {"username": "Merry Sterling", "comment_text": "We traveled in economy from Seattle to Istanbul, Turkish Airlines. Service was outstanding but the seats don’t allow for any extra room"}, {"username": "Ryan Monahan", "comment_text": "We flew Toronto to Rome, overnight 8.5hrs. Paid a little extra for the exit row seats at the front of a section. No seats for 4’ in front of us. We were side aisle but because of the open space the 3rd person with us in the window seat could get up without disturbing us. It was great for about $100!"}, {"username": "Larry Reinier", "comment_text": "It’s the seats in front of you that get you"}, {"username": "Michelle Boucher", "comment_text": "Me and my husband do this often but you have to go to the counter at the airport instead of doing your boarding pass yourself the day before because you have to have two seats under one name and the system will not let you checkin online."}, {"username": "Margaret Fullriede", "comment_text": "That is a great idea."}, {"username": "Heidi Coble Sharer", "comment_text": "I don't sleep on the plane. So for us paying the extra $1000 isn't worth it. I think it just really depends on what your needs are. The nice thing about 3 seats is that you can either leave it empty between the two of you or sit side by side and have an empty seat on the other side of you. This would cut down on people bumping into you or climbing all over you."}, {"username": "Tanya Yyz", "comment_text": "Not guaranteed seats together even if you prepay the seats"}]}, {"id": "2204602019938876", "text": "Does anyone know where to get genuine soccer tops in Rome?", "link": "facebook.com/groups/1373361046396315/permalink/2204602019938876/", "likes": 2, "comments": [{"username": "Alejandro Gabriel Valenzuela Anghileri", "comment_text": "Check figc.it"}, {"username": "Maria Y Alexieva", "comment_text": "Fan stores of the club you want to buy a t-shirt."}, {"username": "Elena Innocenti", "comment_text": "Via del corso Adidas store have Italia National team jersey and also AS Roma team.\nPlus in Rome you can find many AS Roma store that have official Roma merchandising (one is in front of Palazzo Chigi, another one in Via del corso, near piazza del Popolo).\n\nNike store have Inter shirt\n\nIn Via Nazionale (near Piazza della Repubblica) one small shop “calcioitalia” have many football shirt."}, {"username": "Francesco Ronchi", "comment_text": "If you look for the italian jersey you can't go wrong with going into an Adidas store"}]}, {"id": "2204607406605004", "text": "Hi\nAny advice on getting from Naples to port of Civitavecchia on sept 23 ? We will take cruise on sept 24 !\nI am thinking train but it looks like we make stop in Rome , which is fine ! Maybe a driver makes more sense???\nThank you", "link": "facebook.com/groups/1373361046396315/permalink/2204607406605004/", "likes": 1, "comments": [{"username": "Miyuki Kanno Paul", "comment_text": "High speed train such as Frecciarossa by Trenitalia or Italo to Roma Termini first, then transfer to Regionale train to Civitavecchia. If you prefer no transfer, then take Intercity train all the way though it will take at least an hour longer"}, {"username": "Ville Lignell", "comment_text": "Forget the drivers, a train with the change in Rome is the best and most affordable."}, {"username": "Allison Carlisle Young", "comment_text": "We used driver for our family of 5. Limousinrome.co\nm he responds fast with quotes"}, {"username": "Regina-Rich Krett", "comment_text": "We are using Welcome Pickups"}]}, {"id": "2204611416604603", "text": "Dumb question I'm sure (especially since I've lived/visited in and around NYC my entire life)....\nLadies, what's your opinions on traveling with your wedding/engagement rings?\n\nNot saying it's not safe, just looking for practical thoughts...", "link": "facebook.com/groups/1373361046396315/permalink/2204611416604603/", "likes": 11, "comments": [{"username": "Allison Taeger Wilson", "comment_text": "If you tend to swell in the heat you may want to leave at home. I'm ok buty Mother in law had to take hers off and leave in the safe as her fingers have swelled due to heat"}, {"username": "Heather Hudson", "comment_text": "I never wear my jewelry when I travel because of swelling- I have a separate (cheap) one that I wear."}, {"username": "Haley Rose Conley", "comment_text": "Personally, I just brought silicone rings. I wouldn't say I ever felt unsafe but my rings have too much meaning to risk anything happening on a 2 week trip."}, {"username": "Shelley Frise", "comment_text": "My plan was to leave my wedding rings home only because I love being in the ocean and didn’t want to loose them"}, {"username": "Daniela Parhar", "comment_text": "I wear it. No issues at all unless your planing to swim or dive and it’s loose on you."}, {"username": "Penny Bellofatto Westberry", "comment_text": "I wear mine. They're insured."}, {"username": "Jill Medrano Casey", "comment_text": "I wore mine all the time. If someone steals it (whether in Rome or in my hometown of Chicago or anywhere else), it's insured."}, {"username": "Crystal Fernandez Montes", "comment_text": "I’m planning on getting costume jewelry that look like my wedding rings. Amazon has a lot of options and they look pretty similar to what I have. I’m worried about myself misplacing my rings and if I don’t have an attachment to the rings, then I’ll be okay if I lose or break them. I know with the heat and travel, my hands get a little swollen."}, {"username": "Denise Conley Thurling", "comment_text": "No. Wear a cheap option."}, {"username": "Sigrid Cormier", "comment_text": "I don’t bring any jewelry, my fear is more, leaving it behind."}, {"username": "Lucrezia Folger", "comment_text": "I wear my jewelry and bring some as I change my earrings daily. Same rings I keep on."}, {"username": "Gundega Barkane", "comment_text": "What if someone raids your home and rings while you are traveling?"}, {"username": "Linda Jo Rice", "comment_text": "Never do it. I have a lovely simple ring that I wear when I travel"}, {"username": "Roxanne Franquelli", "comment_text": "I purchased a plain cheap band for traveling."}, {"username": "Kim Geary Keidel", "comment_text": "I bought one on Amazon. I didn’t have to worry I would leave it in hotel. (I wasn’t worried I would have it stolen off of me, just that I would lose it.)"}, {"username": "Jennifer Stanek", "comment_text": "You’ll be fine. Don’t believe everything you read or you’ll be afraid to walk outside when you arrive."}, {"username": "Jenny Metcalf", "comment_text": "I have a tattoo for when I don’t wear mine. 😀"}, {"username": "Lisa Marie Corcoran", "comment_text": "I’m leaving mine at home and just wearing a silicone band or something"}, {"username": "Lenora D'Agostino Elliot", "comment_text": "I only bring inexpensive jewelry because I always fear I will leave something in a hotel room."}, {"username": "Michelle McNeil", "comment_text": "I wore my set the entire time and never felt unsafe"}, {"username": "Zoe Croasdale", "comment_text": "There is a site group somewhere full of Europeans asking whether it is safe to wear jewellery whilst visiting the US. I am from the UK and all we hear is if you visit the US you will be robbed at gunpoint for your money and jewellery if you rent a hire car - because the americans know you are not local. It is the same in Europe as it is anywhere else you travel. Don't show off wealth, keep yourself safe as you would at home by not wondering down dark alley's. But most of all - have fun and don't believe all the scare stories you read!!!! By the way I love the US. Great place with fabulous people. I also love Italy - great place with fabulous people!"}, {"username": "Laide Aliani", "comment_text": "in our seas there are more wedding rings than shells 🤣🤣 keep them safe at home or hotel"}, {"username": "Chris Franklin", "comment_text": "I wear my wedding band and leave my engagement ring at home."}, {"username": "Ashleigh Harsanyi", "comment_text": "It’s fine. Anytime I felt a bit unsafe, only Naples train station and in Rome I just turned my diamond around. As for swimming my wedding ring is tighter so I put that on last to make sure my engagement ring didn’t fall off."}, {"username": "Monica Roman-Fazio", "comment_text": "I just came back and I left everything at home."}, {"username": "Patsy Luque Mejia", "comment_text": "I don’t take mine. It’s one less thing to keep track of going through all of the airports, security lines, and hotel transfers, etc. Plus if my hands swell, which has happened, I won’t be able to wear them anyway. It would likely end up in the hotel safe."}, {"username": "Fannie Liu", "comment_text": "I generally do not wear my engagement ring or anything expensive on any vacations because I don’t want to lose it. Don’t trust in hotel safe for when I go to the beach etc. Can always bring/buy inexpensive costume jewelry even fake engagement ring for travel. Even then I’d rather not bring any attention with a big rock on my finger."}, {"username": "Cynthia Tarantino", "comment_text": "I never travel with jewelry...I never seem to end up wearing all I bring... so now I just have a simple pair of hoops I wear for the entire trip"}, {"username": "Shawn Galbraith", "comment_text": "I know someone that leaves her gorgeous real rings at home and uses an alternate travel ring"}, {"username": "Bethany Rudy", "comment_text": "Never felt unsafe. Wear it"}, {"username": "Pao Magnoler", "comment_text": "Don't worry about it. You are going to Europe."}, {"username": "Lucy Thornton", "comment_text": "??? You're not going to an uncivilised country, Italy was there long before America!"}, {"username": "Letty Veronica", "comment_text": "Never felt unsafe. Wore mine the whole time. I feel much more unsafe in our hometown of Pittsburgh"}, {"username": "Colleen Dawson", "comment_text": "Strange enough, at home I wear neither. When I travel I wear them especially to Italy so the in-laws don’t question me."}, {"username": "Vivien Paulik", "comment_text": "People were wedding ring in Italy too. So it is okay.\nIf you have an extreamely expensive diamond engagement ring, I say no to travel with it. Not because it will be stolen, just not good for travelling"}, {"username": "Victoria Williams", "comment_text": "Why not"}, {"username": "Tabatha Hessler", "comment_text": "Better safe than sorry\nDon’t travel with them on, best to leave them home imo"}]}, {"id": "2204613549937723", "text": "Can anyone tell me if there is anywhere around Milan I can donate some stuff. I have a van with a sofa bed, matress and camping gear (chairs, tables and cooking gear etc) we need to get rid of before we fly home. I cant seem to find any info online.", "link": "facebook.com/groups/1373361046396315/permalink/2204613549937723/", "likes": 0, "comments": [{"username": "Dafne Vassetti", "comment_text": "Try Caritas. caritas@caritas\nambrosiana.it"}]}, {"id": "2204622639936814", "text": "Traveling to Minori from Salerno. I only have about a 15 minute window to get to the ferry port from Salerno train station. I arrive at 530 at train station and last ferry leaves at 6pm. Do you think I can make it. I have paper tickets printed. Do I just go straight to the ferry or still need to stop by ticket station?", "link": "facebook.com/groups/1373361046396315/permalink/2204622639936814/", "likes": 0, "comments": []}, {"id": "2204621666603578", "text": "Hi! Spending some time in poligano a mare. Would love to visit ostuni but the city center is about 2 miles away, is there a bus from the train station?", "link": "facebook.com/groups/1373361046396315/permalink/2204621666603578/", "likes": 0, "comments": [{"username": "Schalk Van Wyk", "comment_text": "There is a bus every hour. We stayed in Polignano about five years ago - and loved it. There is an amazing vegetarian restaurant called ‘Mint’."}]}, {"id": "2204467103285701", "text": "DAY 12 - PESCHICI\nWe are visiting the Gargano, a land between sea and mountains! Gargano is one of the most scenic parts of Puglia with green mountains covered with lush pine forests, olive groves, and a dramatic coastline of white limestone cliffs, colourful sea caves, and long sandy beaches.\nLooking for a place to stay in Peschici? Then look no further than Morcavallo Hotel, a romantic hotel with a wonderful sunset iew that brings the best of Peschici to your doorstep. Have a look here: https://www.anrdoezrs.net/click-100692842-11552042?url=https%3A%2F%2Fwww.tripadvisor.com%2FHotel_Review-g194848-d2285770-Reviews-Morcavallo_Hotel-Peschici_Province_of_Foggia_Puglia.html\nPeschici has a small historic centre of whitewashed houses where you can wander the winding streets up to the Norman castle with panoramic views of the coast. From the town's belvedere, you can see the characteristic trabucchi, wooden structures suspended over the sea that were once places dedicated exclusively to fishing 😍 and now some of these are typical restaurants!\n#gargano #garganoexperience #garganocoast #garganolovers #peschicilifeisbeautiful #peschici #puglia #apulia #apulianholidays #apuliatravels #nextstopItaly #italy", "link": "facebook.com/groups/1373361046396315/permalink/2204467103285701/", "likes": 11, "comments": []}, {"id": "2204575496608195", "text": "Enjoy this virtual walking tour with our native Florentine guide and discover a side of Florence only locals know about and get lost among Florence’s streets where you can really feel the art and the history ofआणखी Florence, as well as its unique ancient traditions.\n\nJoin our virtual experience: https://nextstop-italy.com/virtual-tours/hidden-florence/\n\n#florence #florenceitaly #florence #virtualworld #italyiloveyou #renaissanceart #medievalart #tuscany #italytrip #italygram #renaissancetour #history #VirtualTour #art #tuscanytrail #italytravel #pontevecchio #PonteVecchioFirenze #palazzovecchio #michelangelo #uffizigallery #museums", "link": "facebook.com/groups/1373361046396315/permalink/2204575496608195/", "likes": 5, "comments": []}, {"id": "2204536046612140", "text": "Hello! I am on a Mediterranean highlights tour that will be ending in Rome. The tour wil officially end in the am with hotel checkout but my flight is not until 10 pm.\n\nWill the hotel hold my bags?\nWhat do you recommend doing in the interim?\nIs there a lounge or anything at the airport I can hang out in? I’m flying Aegean but also have AA card and points and United points.\n\nThanks!!", "link": "facebook.com/groups/1373361046396315/permalink/2204536046612140/", "likes": 3, "comments": [{"username": "Betty Stilt", "comment_text": "Ask the hotel now if they will hold the bags. Then you needn’t worry anymore."}, {"username": "Rebecca Marshall", "comment_text": "• email your hotel to ask them\n• explore all around Rome- it’s an amazing city to walk around\n• it depends what terminal you’re in\n\nMake the most of your day- you’ll love it!"}, {"username": "James-Kathy Dickerson", "comment_text": "I know this isn't the best advice but if the hotel is not to expensive and you can swing it I would pay for another night enjoy your day stress free...come back to the hotel take a shower and ready for the flight home 🙂"}, {"username": "Maria Brozou", "comment_text": "Some hotels accept late check out for a fee. Ask them. Aegean usually has lounge access only for business class tickets."}, {"username": "Lora de Vries", "comment_text": "You can ask your hotel for a late check out or for half a day, which will take you to 6pm. You would have to pay for the half a day request."}, {"username": "Stacey Esposito", "comment_text": "Our hotel held them for us yesterday till 3pm. Checkout was 11 am. We walked around rome headed back got our bags and headed to the airport for a 7pm flight. It was perfect"}, {"username": "Bridget Gieseke", "comment_text": "Best advice… ask your own hotel… do not rely on the advice of strangers who may have never heard of or let alone stayed at your hotel. There are lounges at the airport. Are you a platinum am ex or priority pass holder? Delta or American status holder? Not trying to be rude, just trying to give an accurate depiction of what’s necessary for lounge entry. Best advice on here was to try and book an extra night where you’re staying if you don’t have access to the lounges."}, {"username": "Kasey Jackson", "comment_text": "Thanks all! thanks! I’m nothing on Aegean lol but I’m gold status on AA but not sure what that gets me. I appreciate it and will try to contact the hotel and consider paying for another night."}, {"username": "Michela Zanni", "comment_text": "I've never had problem to leave my luggage at the hotel after check out until departure. Hotels always have a store for them"}]}, {"id": "2204541306611614", "text": "So, I've read here and elsewhere that Tmobile's service is 'iffy' in Italy for many T-Mobile subscribers, while others have no issue. My phone plan offers free 2G data and unlimited texting, phone calls are 25 cents per minute.\n\nIf you are a T-Mobile subscriber, how was your service if you were on 2G? Did you have decent service in Rome,आणखी Florence, Naples and/or Sorrento? If you were using 4 or 5G, how was your service in those same cities?\n\nI can buy us an upgrade 5G 10-day pass for $30 but if service is bad regardless, that may not be the answer. I have a Samsung A52 and my husband has an iPhone 12 and we both get 5G fine in the states. Our phones are unlocked. Getting phone calls is not so much the issue as needing to have access to websites, GPS and various apps. If you're a T-Mobile subscriber, please let me know your experience in Italy with data and accessing apps easily at decent speeds! Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2204541306611614/", "likes": 5, "comments": [{"username": "Jenny Shelden Pauswinski", "comment_text": "We had great service and we have an old grandfathered sprint to tmobile plan. So, not magenta or magenta plus. I actually upgraded one week because we were going to be driving and it was the same. I wouldn't recommend upgrading. It was 4g service and worked well most places"}, {"username": "Andrew Grayson", "comment_text": "I have T-mobile and was wondering the same. But I have Magenta Max and 2 5G capable phones. My parents were in Italy a few months ago and said they had Zero issues with t-mobile."}, {"username": "Randy Aull", "comment_text": "We have been in Italy for a while now and quickly realized that the speeds and signal for Tmobile were too limiting for us. We wanted to know we could get directions, restaurant reviews, etc. So we did the Airalo esim thing (the European regional, not Italy only) and regularly get fast 5g. Often lose signal in the old buildings because of the thick walls."}, {"username": "Nikki Dolente", "comment_text": "I bought the 10 day plan and has zero issues"}, {"username": "Ashley Martins", "comment_text": "I did unlimited international & 5G for $50 for 30 days with T Mobil while in Europe last month. Worked great!"}, {"username": "Anthony Martini Jr.", "comment_text": "T-Mobile service in Italy is great.\nI can't understand why you will pay anything extra though, I only pay for the bump from unlimited 256k/sec to 512k/sec, which is cheap. There are no other charges to use your phone in Italy.\nWhen I'm there I use an esim and get 100gb of data, and share that with my group via hotspot. 5G all day, and I think I paid $25 for that last time"}, {"username": "Julie Tran", "comment_text": "I have tmobile i had no issues"}, {"username": "Sande Ricci", "comment_text": "I have T Mobile and it as great. We used WhatsApp for phone calls and text messages."}, {"username": "Lora Ruscitti Covington", "comment_text": "We have T-Mobile and had no issues."}, {"username": "Penny Bellofatto Westberry", "comment_text": "I have had no trouble with t mobile all over Italy, France, and Switzerland. I have 5g, but a lot of time in Italy is reverted to 2 or 3, but was still fine."}, {"username": "Alexandra A Welker", "comment_text": "Portable wifi as another option."}, {"username": "Sonia Scotto Lubrano", "comment_text": "I have T-Mobile. You connect with TIM and use their cell towers. Cell service in Italy isn’t what it is in the states.\n\nKnowing all that, service was fine. Not spectacular but I did well."}]}, {"id": "2204548403277571", "text": "Our colosseum tour does not include the Roman Gorum and Palentine Hill. Should I buy tickets ahead of time for those (I realize that the colosseum is included with most on the official site)? Or, can we get them there without a huge queue? We have 6 different tours planned for 5 days. Should we skip this? TIA", "link": "facebook.com/groups/1373361046396315/permalink/2204548403277571/", "likes": 0, "comments": [{"username": "Shen Min Chue", "comment_text": "Essentially all daytime tickets to the Colosseum will include entry to the Roman Forum and Palatine Hill. Thus the basic tickets which your tour agency is holding on to actually include access to these 2 places, it is just that they are not using this portion of the tickets when they conduct the tour for you on the actual day. Thus if your guide holds the physical tickets, you can ask him for your ticket and with that, you can independently visit the 2 places. If he holds digital tickets, ask the guide to bring you to the Forum and leave you there and you can self-explore."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2204554303276981", "text": "Beautiful Lake Braies -Italian Dolomites\n\n📷myself", "link": "facebook.com/groups/1373361046396315/permalink/2204554303276981/", "likes": 30, "comments": []}, {"id": "2204558306609914", "text": "Anyone use Uber from Rome airport to Civitavecchia", "link": "facebook.com/groups/1373361046396315/permalink/2204558306609914/", "likes": 0, "comments": [{"username": "Philip Curnow", "comment_text": "Forget Uber. They will be leaving Italy soon. Consider a professional NCC which translates as rental car with chauffeur."}]}, {"id": "2204560606609684", "text": "Has anyone stayed at little rose room in Vatican Prati area? How was your experience?", "link": "facebook.com/groups/1373361046396315/permalink/2204560606609684/", "likes": 0, "comments": []}, {"id": "2169014273497651", "text": "✨Sorrento✨\n🤩Sorrento is a small town wonderfully located over white steep cliffs and offers a fantastic view over the Bay of Naples. 😍 For 2000 years already visitors from all over the world have been attracted… आणखी to Sorrento by breathtaking sunsets and fragrances of orange and lemon gardens.🍋\nThe best luxury hotel: Bellevue Syrene 5*\nThe Bellevue Syrene, one of Sorrento’s well-known luxury hotels, is located in a place of timeless beauty.🤩 Born as a patrician residence, then became a villa, today it's a five-star hotel peaking on the waves, with terraces dominating the Gulf of Naples and a postcard Vesuvius on the background.❤️\n👉Book here for the best price : https://www.anrdoezrs.net/click-100692842-11552042?url=https%3A%2F%2Fwww.tripadvisor.com%2FHotel_Review-g187782-d235955-Reviews-Bellevue_Syrene-Sorrento_Province_of_Naples_Campania.html", "link": "facebook.com/groups/1373361046396315/permalink/2169014273497651/", "likes": 44, "comments": [{"username": "Nilza Mercado", "comment_text": "Elvin Mercado 😍😍😍😍♥️♥️♥️♥️🇮🇹🇮🇹🇮🇹🇮🇹🇮🇹"}, {"username": "Sandra Francano Richards", "comment_text": "We stayed there. It’s spectacular!"}, {"username": "Chris Love", "comment_text": "I’ll be in Sorrento in early October. I checked and that hotel is $4,428 per night.\n\n😂"}]}, {"id": "2204473953285016", "text": "Hi there:-)\n\nMy friend and I booked a flight to (from Amsterdam) Italy for 10 days ( 12 till the 21th of august) with only handluggage. Our starting point is Milan (one day and night) and from there we still have to figure out where to go and try to avoid the crowded area’s/places.\n\nWe made a list of places we want to see and explore and still haveआणखी to decide what is realistic:\n\n- Bergamo/ Brescia\n- Verona\n- Venice\n- Lugano/ area Como\n- Florence/Tuscany\n\nIf it’s possible we are travelling by train and otherwise rent a car.\n\nDo you have other suggestions/ better options! I know august is very crowded but we are joining the game:-)\n\nLove to hear your thoughts. It’s going to be my first time in Italy😊", "link": "facebook.com/groups/1373361046396315/permalink/2204473953285016/", "likes": 2, "comments": [{"username": "Monica Patil", "comment_text": "My trip isn’t until September. But I heard a lot of Italians take their vacations in august so a lot of businesses are closed for the whole month. So I would check to see what’s open that you would wanna do there and then decide by that. But enjoy ur trip wherever you go! 😁😁"}, {"username": "Jenny Payne", "comment_text": "Don’t take the world ,I go twice a year to Italy & less is best. I only wear linen,cotton, silk, best sneakers in the world for walking & one pair of sandals. You want to blend in not stand out as a tourist. I have been going for 16 years and so far so good not had any problems. Make sure your phone works in Italy as I’m from Australia & you can pay $5 per day from your provider but I have an Italian phone and just buy a SIM card when I arrive 🌻"}, {"username": "Bea Kuckens", "comment_text": "It's hard to get to \"out of the way\" places by train, and everything is crowded in August."}, {"username": "Karen Blackmore", "comment_text": "Bergamo is lovely and an oasis! Le Funi Hotel is recommended."}]}, {"id": "2204475809951497", "text": "Hi how many days would you recommend in Milan, Venice, Florence, Tuscany and Rome?", "link": "facebook.com/groups/1373361046396315/permalink/2204475809951497/", "likes": 4, "comments": [{"username": "Rick Pierangeli", "comment_text": "I recommend to move to Italy"}, {"username": "Revd Engin Yildirim", "comment_text": "Florance is part of Tuscany. I would do 2 days in each city, and a month in Tuscany."}, {"username": "Anthony McClure", "comment_text": "There are not enough days for Italy!"}, {"username": "Stevie Boombatz", "comment_text": "Two in each"}, {"username": "Patricia Portas", "comment_text": "Not less than two-three nights each and as many as you can 🤷‍♀️"}, {"username": "S Christian Everett", "comment_text": "Eternally"}, {"username": "John Licata", "comment_text": "1,000"}, {"username": "Kathleen Snow", "comment_text": "Two weeks"}, {"username": "Emily Smith", "comment_text": "3 each if you can swing it. Don’t want to be spending more time traveling than experiencing."}, {"username": "Gary W Anderson", "comment_text": "How much time do you have? Minimum time I feel would be Milan 3 days, Florence is the door to Tuscany so day trips are simple 4 days or so and Rome 4 days. Travel safe, eat well and enjoy gelato"}, {"username": "Martin L. Epperly", "comment_text": "At least 1 week in each and 1. Month in Roma."}, {"username": "Russell Weidner", "comment_text": "Week each. Then pick one and move there."}, {"username": "Dave Grotz", "comment_text": "365"}, {"username": "Diana Sankara", "comment_text": "If you visit Florence you're already visiting Tuscany."}, {"username": "Elaine King", "comment_text": "I'm booked for 8 nights in Venice"}, {"username": "Tracy Glasgow", "comment_text": "I had 2 days in Milan, 3 in Rome, and 1 in Venice. Not enough time in Milan and Rome but one day/night in Venice more than enough."}, {"username": "Dean Pecorari", "comment_text": "What about Liguria, Emilia, Puglia ????"}, {"username": "Bill Rupp", "comment_text": "Milan (1) Take your Gold Card; Venice (1); Florence (2) Art, Museums, Shopping, Food; Tuscany (3) Rent a Car; Rome (2) 🍷"}, {"username": "Jennifer Gustafson", "comment_text": "Venice 3, 4-5 for Florence/\nTuscany do day trips and explore Florence from dinner on, Rome 4…if you have more time then this then explore more. I haven’t been to Milan yet but I would have loved more time for Tuscany and Umbria regions."}, {"username": "Nóra Fonyogábné Zsebeházy", "comment_text": "A life time 😇🙂"}, {"username": "Stuart Clark", "comment_text": "365"}, {"username": "Stefania Barou", "comment_text": "A life is not enough!"}, {"username": "Jazz Caldwell", "comment_text": "As many as you possibly can!"}, {"username": "Antonella Nannucci", "comment_text": "my choice would be: Milan 1 day, Venice 1 day (2 if you want to do the Murano and Burano tour) Florence 2 days (increasing 1 day per location if you want to see Siena, Pisa, Lucca and tour the Chianti area) Rome 2/3 days."}, {"username": "Kelly Roland Thompson", "comment_text": "I did one in each, then 2 in Tuscany, 2 in sorrento and 3 in rome. Busy but it worked"}, {"username": "John Adams", "comment_text": "My first trip to Italy was for two weeks. Flew into Rome - 4 days, train to Florence - 4 days, train to Venice - 3 days and finally train to Milan for three days. Departed Milan Malpensa for home.\n\nIt gave the opportunity to visit and see what I wanted to see and a few surprises in each but not enough time for anyone of the four.\n\nReturned last year to Tuscany and saw Pisa and Lucca and other small Tuscan towns.\n\nThis year visiting Genoa, Turin and Milan. Next year, Paris and Venice. After that Rome and Umbria and then southern Italy and Malta. 😁\n\nKeeping my fingers crossed."}, {"username": "Chantal Adams", "comment_text": "It’s all very personal to each person and what they’ve experienced about Italy (1st time, 2nd time etc) as for myself having been to Italy only twice I would say : Rome 2-3 days, Venice 1-2, Florence 2-3, Tuscany 1 month (😉😂) and Milan ? Not sure. I’m going there for the first time next week, I’ll be there 3 days. Have a great trip no matter how many days you stay in each place, it will never be enough! 😊"}, {"username": "Gary Oroian", "comment_text": "17 days!"}, {"username": "Tommy Jenkins", "comment_text": "4-6 months each location"}, {"username": "Vivien Paulik", "comment_text": "For me it could take months 😅 but okay\nVenezia 4 days\nMilan 2 days\nToscana a week\nRome 4 days"}, {"username": "Philip Curnow", "comment_text": "6, 8, 4, 21, 365"}, {"username": "Heath Conn", "comment_text": "0, 3, 3, 10, 5"}, {"username": "Antonio Aloè", "comment_text": "3-4 days Milano + lago di Como and lago di Garda,from 7 days to 1 month Florence and Tuscany,Rome from 4-5 days to...."}, {"username": "Ken Lerch", "comment_text": "2, 3, 5, 7 (w/car driving around), 6."}, {"username": "Tom O'Hara", "comment_text": "7 in each."}, {"username": "Emily LeaTh", "comment_text": "I guess I should have said \"Search Youtube for \"How to see [city] in a day\" because somehow linking to an example got my comment removed. I do not represent any tour group, but found that kind of video really help in deciding if I really wanted to try to do it all in a day or have a bit more time. Venice and Florence were doable in a day, but it would have been nice to have 2 or 3 days in each (both are such major world-renowned landmarks that crowds are likely at all times of year and you need to book everything well in advance.) Rome needed 4 days at least, and you could spend so much more time depending on what you want to see. I also spent 5 days in Sorrento because I wanted some time to not do as much scheduled/\nticketed sightseeing and relax a bit, which would be nice in Tuscany too. We flew in to Milan, but then immediately drove to Bologna. A day in Milan would have been great."}, {"username": "Francesco Ronchi", "comment_text": "You shall spend a month in Tuscany (Florence is included)"}, {"username": "Lisa Martinson", "comment_text": "3 each except Rome 4 or 5"}, {"username": "Roland Trego", "comment_text": "Milan 1 day and night, Venice at least two full days and nights, Florence 2 full days + 2-3 days to see the villages in the surrounding Tuscan countryside (Siena, Lucca, San Gimignano and more if you rent a car), Rome 4 days and nights. By the way, Florence is the capital of Tuscany."}, {"username": "Gracy Grace", "comment_text": "We stayed 3 weeks in all those cities with our own car. 7 days in Rome. 😉"}, {"username": "Abe Michelson", "comment_text": "3 weeks minimum. I realize that might be a tall order. But Seriously. When it comes to Italy. Go Big or Go home!!!"}, {"username": "Veronica Solimando-Lynch", "comment_text": "2 days in each city is enough"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Florence is in Tuscany, what else you want to see when you say Tuscany?"}, {"username": "Fernando Leon", "comment_text": "Milán 2. Venice 2. Then go to Padua, Verona, Vicenza. Florence 2 and then go Pisa. Rome 3 and go to the South to Capri and if you can go to Sicily its beatiful ."}, {"username": "Jay Parekh", "comment_text": "We’re doing Rome, Florence, and Venice in 8 days.. 10 if you include air travel days from US."}, {"username": "Constantine Matsos", "comment_text": "How many days do you have to spend in Italy? You can easily do several weeks in each city you mention and you will need a lot more time to explore all of Tuscany."}, {"username": "Annette Giovia", "comment_text": "As many as possible!!"}, {"username": "Kate Conroy", "comment_text": "Do you know what you want to do/see in each location, if you do plan around that, I found Milan to be lovely, however it all depends on your interests, have fun and enjoy trip."}]}, {"id": "2203862766679468", "text": "My wife and I just finished our first trip to Italy. Thank you all for the advice and tips, they helped tremendously. Just wanted to share our experience if it may help anyone.\n\nI booked everything for us via Travelocity travel package months out. Hotel, airplane tickets, and tours. I know that’s scary for a lot of folks, but that’s what we did.\n\nFLIGHTS:\nWe flew economy and it was fine. Amazingly there was only a 45 minute delay going and we actually got back about 30 minutes early. I’m a bit on the taller side so I was cramped on the short flight from our hometown to ATL. But the long flights (ATL to FCO going and CDG to ATL coming back) weren’t too bad.\n\nHOTEL:\nWe stayed in Regola Suites which is very near Trastevere (just across the bridge). It was nice. Breakfast was served in the room each morning. The bed was hard, but other than that it was pleasant and quiet. The staff were very friendly and accommodating, and it was in a convenient spot. We probably could have walked most places within 25 minutes, but the wife wasn’t too keen on walking, especially in the heat, so we took a lot of taxis.\n\nGETTING AROUND:\nThe hotel booked a private driver for us from Fiumicino airport (55 euros) and back to Fiumicino when we left (75 euros since we had to leave at 3:15am for an early flight). We mostly used Free Now to book taxis to get around the city. We also hailed a couple of taxis right off the street. There was a noticeable difference in price between using the app and just flagging a taxi down. Getting a taxi through the app was 10-12 euros more on average I’d say. And the app was sort of hit or miss. Sometimes it took a long time for a driver to accept, and a couple times none would. So my advice would be to flag a taxi down if you can. Had no issues paying them via CC.\n\nTrain tickets to Florence were booked through Italo 2 months in advance. Had no problems at the station.\n\nPAYING FOR STUFF:\nWe used a CC for just about everything. I had loaded money on our Wise card before we left and we used that to withdraw cash if we needed. ATMs are all over the place and they were easy to use. Only paid fee of 3,75 euros when we withdrew funds, which we only did twice.\n\nTOURS:\nWe did tours in Rome, Florence, Pompeii and The Vatican. A total of 5. All (except the Pantheon) was booked through Travelocity and 3 were handled by City Wonders and one by Florence Specialists. We had zero issues. (Others around us were having issues with Pantheon entry and it seemed very unorganized, but we escaped any problems). Everything went as planned, no last minute changes, cancellations, or hiccups.\n\nMISC:\nYes it was hot, but it took nothing away from our experience.\n\nHad no safety concerns. I was out walking alone in the colosseum area after midnight with no fear. (Take that for what it’s worth).\n\nNo encounters with pickpockets.\n\nCarried a copy of my passport. My wife carried hers in her. No one ever asked to see either.\n\nThe locals were friendly enough, but I found a some to be less than friendly. (Maybe irritated by my bad Italian, but hey, I was giving it my best and attempting to speak the local language).\n\nOnly made reservations to a rooftop restaurant (Ambrosia) for our anniversary dinner and it was great. Everywhere else we had no issues showing up and being seated relatively quickly.\n\nOverall, it was an absolutely amazing experience and we enjoyed ourselves immensely. So go, have fun, and do it your way.\n\nCiao!", "link": "facebook.com/groups/1373361046396315/permalink/2203862766679468/", "likes": 35, "comments": [{"username": "Faten Gharaibeh", "comment_text": "Thanks for sharing"}]}, {"id": "2203977553334656", "text": "Cinque Terre, Lake Como or Lake Garda??? Love the idea of hiking from village to village and stopping at vineyards, reastauants with a hilltop view at Cinque Terre... but want to make sure I'm not getting sucked into social media hype if the other areas could be more enjoyable. I can only pick one 😞 thanks!!!!", "link": "facebook.com/groups/1373361046396315/permalink/2203977553334656/", "likes": 6, "comments": [{"username": "Etschi Bruckner", "comment_text": "I´ve once hiked the Cinque Terre from Portovenere to Levanto ( 4 days) - and took the boat back. But that was about 10 years ago, before it got so full - nowadays I would chose Lago d´Iseo or lago di Tenno - maybe with a couple of days at Lago di Garda.."}, {"username": "Pao Magnoler", "comment_text": "5 Terre!"}, {"username": "Paula DiCicco", "comment_text": "Just did Lake Como and Cinque Terre- both gorgeous but I think I would pick Cinque if I had to pick:) Very different places! Lake Como is less touristy, peaceful and calm where we were (Cernobbio). All Cinque Terre Villages busy but so unique and fun. We stayed in Riomaggoire but visited all. LOVED LOVED Neesun Dorma pesto class in Manorala- top 4 activity of trip with 7 different stays throughout Italy."}, {"username": "Roland Trego", "comment_text": "In September, I would do the Cinque Terre villages."}, {"username": "Sheryl Korljan", "comment_text": "If you’re wanting to hike cinque terre is lovely but be prepared to get up early to avoid the crowds when it makes all the difference to an enjoyable walk. I usually left around 7.15 in the morning and barely encountered any other walkers. It is as stunning as it looks, I went early June"}, {"username": "Marian Van Soelen Hand", "comment_text": "Currently in Como. Avoid Bellagio at all costs. The rest of the lake is gorgeous! Bellagio is definitely social media hype and a tourist trap right now."}, {"username": "Michela Zanni", "comment_text": "Garda. But depends on the period"}, {"username": "Sara Kyle Hargett", "comment_text": "Go for it"}, {"username": "Tonsia Keytel", "comment_text": "Cinque Terre."}, {"username": "Melanie Baffes", "comment_text": "The hiking between the Cinque Terre villages is outstanding -- and not crowded like the towns themselves. You get a spectacular view, too."}, {"username": "Stefano Follador", "comment_text": "Vineyards are also in Garda area. If you need any suggestions please free feel to ask"}, {"username": "Shona Vincent", "comment_text": "We have just come from almost a week in Lake Garda - I haven’t been to the other two, but my goodness Lake Garda is stunning. We stayed in a spot in the north and one in the south and I was at or in every ferry port on the lake while there… every single one breathtakingly beautiful! Cannot recommend enough!!"}, {"username": "Scott Seneca", "comment_text": "Cinque Terre"}, {"username": "Gianna Onesi", "comment_text": "Lake Como"}, {"username": "Virgz Van Møøre", "comment_text": "Como"}, {"username": "Julien Costin", "comment_text": "Go to Lake Maggiore if you want less crowds just as beautiful as the other 3 you mentioned."}, {"username": "Karla Danielle Heywood", "comment_text": "Cinque terre 100000% if you fly to genoa you can get a real bargain"}, {"username": "Jenine Gallardo", "comment_text": "Just did Garda and Terra - do both if possible:)"}, {"username": "Nissa Nolan Foster", "comment_text": "lake garda"}, {"username": "Sheron Milliken", "comment_text": "I’ve been to all 3 and I like them all. Where will you be coming from and where will you be going afterwards? I’d probably go to whichever area is closer."}, {"username": "Suzanne Joslin Oliveria", "comment_text": "Have done CT 2x and Como once. CT for the win!"}, {"username": "Ryan Monahan", "comment_text": "Hiking village to village, CT is your place. Garda is pretty big to hike between many towns. Taking the ferry is pretty awesome though. We just spent 3 days each at CT and LG and loved them both!"}, {"username": "Renee Dillenbeck", "comment_text": "I had this same question and don’t want to make a separate post. I’m going the first week of November with teenagers."}, {"username": "Stephanie Coleman Bragg", "comment_text": "I have been to Lake Garda and Cinque Terre and loved both. I don’t think you can be disappointed in either place."}, {"username": "Plane Shummer", "comment_text": "Lake Garda. Been to all 3 and wins."}, {"username": "Jozanne Sbitney", "comment_text": "Hiking from Vernazza to Montorosso at Cinque Terre is beautiful! You can swim in the sea at the beginning & end of the hike!"}, {"username": "Connie Owens", "comment_text": "Cinque Terre no question! Truly magical!"}, {"username": "Claudia Marcon", "comment_text": "Lake Garda"}, {"username": "Gloria Maledi", "comment_text": "5 terre"}, {"username": "Manuela Gabrielli", "comment_text": "Garda Lake!"}, {"username": "Laura DeCicco", "comment_text": "When will you be there? We spent time in CT in May/June and I was worried about the hype. It is gorgeous, we did the pesto experience and had a beautiful hilltop dinner. I would 💯 % go back"}, {"username": "Iby Sibyll", "comment_text": "Lake Garda is amazing too.."}, {"username": "Dafne Vassetti", "comment_text": "Lake Garda."}]}, {"id": "2203985336667211", "text": "I everyone going to italy first week I. September first time. We land at 7:15 am at leonardo davinci airport. Need to get to sorrento for hotel. What is the best way to go. Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2203985336667211/", "likes": 1, "comments": [{"username": "Gary Trignani", "comment_text": "Train to Naples. Driver to Sorrento. There are other ways but this is the easiest and most convenient. ￼"}, {"username": "Jerry Lyubelsky", "comment_text": "High speed train to Naples. Local commuter train to sorrento"}, {"username": "Robin Darmstadt Mancil", "comment_text": "High speed train to naples then the Campania Express to Sorrento. The local train is a nightmare if you’re traveling with luggage and sometimes standing room only. The Campania Express is a tourist train, runs 4 times a day so plan accordingly. Assigned seats, nicer train, less stops. 15€ and worth every penny! Walk downstairs from fast train and you’ll see the ticket office. Campania has its own window. When we used it they walked us all to the train."}, {"username": "Lucrezia Folger", "comment_text": "Train, bus, shuttle, drive, or fly. All options."}, {"username": "Karen Ries", "comment_text": "Fly to Naples"}, {"username": "Michela Esse", "comment_text": "Take the train from Airport to Roma Termini station ( the main train station). Then take the Frecciarossa train to Naples (High Speed line). In 2 hours you Will arrive to Naples and then with a private driver to Sorrento"}]}, {"id": "2204058196659925", "text": "Does anyone have a great travel agent for planning the trip\nPlan on going next September", "link": "facebook.com/groups/1373361046396315/permalink/2204058196659925/", "likes": 0, "comments": [{"username": "Usha Lalwani", "comment_text": "Nyssa from Click and Trip is amazing."}]}, {"id": "2204100896655655", "text": "Is there anyone with lots of experience on here that could help me book bus/ train tickets for our September trip? I am SO overwhelmed trying to figure it out and kicking myself for not using a travel agent. I know the apps are all easy to use. That’s not the issue. The issue is the billions of choices of train stations and I have no idea whichआणखी one is the right one for our location…￼ for example, we are going to be in a random town in Lake Como and need to make our way to Milan. I don’t even know if there are any major train stations in Lake Como? I can’t seem to find the answer. ￼ It appears that there will just have to be a bunch of connections made, and I have no idea what they are.\nCould I pay someone to help me book?", "link": "facebook.com/groups/1373361046396315/permalink/2204100896655655/", "likes": 1, "comments": [{"username": "Gianna Onesi", "comment_text": "Go on the web it's pretty straight forward see where you need to go put in times and you checkout."}, {"username": "Roxanne Franquelli", "comment_text": "PM me. I could try to help. I just did mine. Took 45 min. Lol"}, {"username": "Cindy Morgan Schmoe", "comment_text": "We just got back from Italy and we booked the train at the station. It was very easy."}, {"username": "Carmela Siniscalchi Frattellone", "comment_text": "Train tickets are super easy. I went on the Italiarail website and purchased through there."}, {"username": "Mary Anne", "comment_text": "The Trainline app is super easy."}, {"username": "Dafne Vassetti", "comment_text": "It depends where you are sleeping in Como. There are thousands of towns around lake Como and different train stops/train stations depending where you are. What's the town where you are staying?"}, {"username": "Gabriele Fordini Sonni", "comment_text": "Just use Google Maps, it works like a charm. It pulls data directly from trains and buses timetables databases, it's accurate and has information for the most remote places, even if you give him precise coordinates/\naddress.\n\nPick your starting location, pick your destination and make sure to use the \"public transport\" route. Doublecheck the desired time of arrival or departure and you can start planning your trip.\nAfter you found your desired path simply confront it with wathever provider services said route to check if everything it's ok.\n\nDepending on your destination you might need to change alot between buses / trains, so be sure that you have all the necessary infromations and tickets\n\nApple Maps or Bing will surely work in a similar manner, but i've never used them."}, {"username": "Stefano Bressanelli", "comment_text": "Como has 2 Major stations. One Is the nearest to the lake. Its name is Como nord lago. The other Is named Como San Giovanni. This station has International links with switzerland. Both station lead to Milan by different Rail Path."}, {"username": "Elizabeth May La Duca", "comment_text": "I don’t go anywhere without checking with Google Maps / Directions first !!!\nDownload the app"}, {"username": "Elizabeth May La Duca", "comment_text": "WWW.GOOGLEMAPS.\nCOM"}, {"username": "Miyuki Kanno Paul", "comment_text": "Do you have a copy of Rick Steves ITALY guidebook?"}, {"username": "Jerry Japczyk", "comment_text": "Put in your info to Rome to rio"}, {"username": "Diane Wilkerson", "comment_text": "Rome2Rio app or web site will show you the stations and options."}, {"username": "Carine Boon", "comment_text": "If you stay in Como city, there is train direct to Milan Centrale. The train station in Como is Como San Giovanni. There is another train to Milan leaving from Varenna (north of Como city, and a city that a lot of people here want to visit). That train stops in Lecco, a city on the western part of the lake. Both journey take one hour. They have buses and boats around the lake, and also water taxis. Where will you stay?"}, {"username": "Randi Renee Pearon", "comment_text": "Pearodise Travel LLC ! No reason to stress!"}, {"username": "Kay Rendall", "comment_text": "There r 3 stations in the town of Como. 1 in Varenna I think."}, {"username": "Reagan Bramston", "comment_text": "Rom2rio free app will help you. You can even type in the actual address (hotel/ air bnb ) you wish to depart from, & shows you how long a walk to the nearest train/bus/\nferry point along with times. Example hit on train option & will have the name of the station .Can also enter the date for more accuracy. We stayed in Varenna, Lake Como, used the lake ferry to get there from Como then train from Varenna to Milan with trains to anywhere from there."}, {"username": "Bianca Balderas-Saenz", "comment_text": "What random town in Como?"}, {"username": "Virginia Lane", "comment_text": "https://\nwww.rome2rio.com\n/map/\nLago-di-Como/\nMilan"}, {"username": "Niamh Ryan", "comment_text": "Pm me if you still need help!"}, {"username": "Sam Mah", "comment_text": "We have recently completed a 3 month Eurail pass holiday. Some cities have from 4 -8 stations, so yes it is a pain in the neck until you work out how to get the right one. Best thing to do is either find the adress your staying at in Google maps or if it is a big city, just put in the city (ie Rome) once that comes up just search for \"train station\" (there is around 8 for Rome) you can tell which is the biggest terminal as it has multi lines runiing through it. The check which is closest to where you want to stay. Be aware sometime a trip will only terminate at one station and you will have to catch another train/tram/bus/\nor walk to get to your accommodation."}, {"username": "Sam Mah", "comment_text": "These are the train stations in the Lake Como area..."}, {"username": "Niamh Ryan", "comment_text": "Hi Christy, if you still need help, pm me."}, {"username": "Deborah Jewison", "comment_text": "Google maps is your friend! Have a look at where you’re staying, find the nearest train station and then put it in the train app to see connections. Or put starting point and destination into google maps and it should tell you stations and connections."}]}, {"id": "2204439839955094", "text": "I haven’t seen a lot of post on Sicily. We are flying into Palermo on October 2. Any suggestions on places to visit? Also recommendations on how to travel to the main land? Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2204439839955094/", "likes": 1, "comments": [{"username": "Shawn Galbraith", "comment_text": "We spent 10 days\nLoved Siracusa/\nOrtigia, Agrigento, and Palermo. Fave was Cefalu.\n\nTry to get last minute tickets to the Opera in Palermo it was life changing."}, {"username": "Dafne Vassetti", "comment_text": "In Palermo eat - Arancina, Cannoli, Cassata, Pane e Panelle, Iris.\n\nVisit - Piazza Pretoria/Also known as Piazza della Vergogna and the surrounding churches, go up the Cathedral (inside is very plain), but the terraces of the church have a great view, Monreale and its Duomo, Palazzo Reale and Cappella Palatina. If you have time visit Mondello Beach - you can easily get there with public transport.\n\nThe Ballarò market and Vucciria market are great, but my suggestion would be to get a guide for a food tour that can bring you in these two markets. Vucciria is easier to get around than Ballarò."}, {"username": "Alessandro Iannelli", "comment_text": "The main reason why you don't see many posts about Sicily is that there are at least 2 fairly big groups (not nearly as.much as this one, but still) dedicated to travelling to sicily. For travelling to the main land, I would recommend flying."}, {"username": "Raymond Capkin", "comment_text": "Lipari off coast Messina"}, {"username": "Elaine Jefford", "comment_text": "Palermo is a wonderful city full of history and beautiful churches and buildings, take a stroll down to the Quattro canti, eat gelato and cannoli, have a lunch at the food market (Ballaro) take the bus to Monreale, take the train to Cefalu, if the weather is fine take the bus to Mondello beach, go to the palace and if you have time to go to the east side of the island visit Catania, Syracuse, Taormina and take a tour up Etna."}, {"username": "Lisa Abrams Argento", "comment_text": "We spent 9 days there in early June. I would go back tomorrow if I could. Loved it. Stayed at Hotel Posta in Palermo. The opera house is amazing. The medieval town of f Erice is you have a car. Ortigia is a must. Eat Granita, it is the best morning or cooling off meal/snack. Can I fit in your suitcase please."}, {"username": "Keri Catoe", "comment_text": "Rent a car. Go to Agregento and see the Valley of the Temples. It will blow your mind. And be prepared to walk a lot there. You could also go to Segesta which is similar but smaller. Mount Etna and Taormina are amazing to see. Driving is a sport and stick shift so you must be comfortable in stressful situations driving. We spent an entire month in Sicily and fell in love with it. Everything’s less expensive (except in Taormina) and the food is so incredibly fresh. The pastries are mind blowing also. Enjoy!!!"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "When you visit Palermo be sure to visit Palazzo dei Normanni and Duomo di Monreale. They are stunning!"}, {"username": "Janice Nugent", "comment_text": "Taramina is a must-see. Mt Etna your as well. enjoy!"}]}, {"id": "2204470779952000", "text": "I’ve checked rometorio but hoping for advice based on experience. We will be 2 people traveling from Florence to Amalfi in October. Looking for the most convenient route, not necessarily the cheapest. Train to Sorrento then taxi to Amalfi?\nAfter our stay in Amalfi will travel to Rome. Travel advice?", "link": "facebook.com/groups/1373361046396315/permalink/2204470779952000/", "likes": 1, "comments": [{"username": "Heather Sechrist", "comment_text": "It may be easier to take the fast train to Salerno and then taxi over."}, {"username": "Jenny Payne", "comment_text": "I would either get a driver to Naples fast train I use Italo company to Florence 🌻"}, {"username": "Tara Roed", "comment_text": "On the way back you could get s private car to Naples train station and take the fast train to Rome. I did that from Positano. The train is only about 1 hour. It was very easy"}, {"username": "Jennifer Stanek", "comment_text": "We took the train to Salerno then the bus to amalfi."}, {"username": "Theresa Sorrentino Pagan", "comment_text": "I just booked this trip. Train to Salerno and ferry to Amalfi through ferryhopprr.com lots of times to catch the ferry.\nOn the return we’ll be in Sorrento booked ferry to Naples and then train to Rome"}, {"username": "Miyuki Kanno Paul", "comment_text": "Take high speed train from Firenze S.M.N. to Napoli Centrale. Take a bus or taxi to Molobeverello port. Catch a ferry to Amalfi"}]}, {"id": "2204132349985843", "text": "Hi everyone. We are taking a 7 day Mediterranean cruise. Our stops are Venice, Sicily, Rome, and Pisa/Florence. Most days we will have 12 hours at each stop. Should we book our excursions through the cruise or is it easy to do things without the cruise excursions? First timer to Italy so please be nice. Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2204132349985843/", "likes": 7, "comments": [{"username": "Gary W Anderson", "comment_text": "Book thru cruise"}, {"username": "Susan Argall", "comment_text": "Definitely book an excursions from cruise ship when you get to Rome Florence and Venice. The ports are far away When I go to Naples I grab a taxi for the day. This driver took us to Pompeii Amalfi coast Sorrento and back to port. 300 us for the day The city of Naples is walking distance but don't waste your time there unless you have time when you get back"}, {"username": "Kay Rendall", "comment_text": "There r often tour operators at the port when u land. I usually use these as they r cheaper for local excursions\nHaving said this if u are late for the departure time of the ship, traffic delays, breakdowns etc the ship will not wait. Have seen passengers taxis outside port locked gate trying to get in\nHowever if u use a cruise excursion, ship will not leave without u.\nDepends on how long, time of the tour, excursion, whether u take the risk.\nI often just take the pus from port, tour explore city on my own. Take a taxi back, but leave myself plenty time to arrive back for departure."}, {"username": "Jenn Messina Babore", "comment_text": "Easy to do on your own. We don’t book through the ship unless we have OBC to burn."}, {"username": "D'Anna Sullivan", "comment_text": "Just did a similar cruise. It’s great to get your feet wet in places you’ve never been but I wouldn’t do a 2nd cruise like it. There were too many changes/\ncancelations to port times and it was frustrating. Didn’t have enough time to do things I planned. Ended up canceling excursions to explore on our own."}, {"username": "Laura Uribe", "comment_text": "The reason you want to book through the cruise line is that if you are delayed on one of their excursions, they normally wait for you. If you’re delayed on a third party excursion, they leave without you."}, {"username": "Melissa Reyes", "comment_text": "We booked through the cruise since it was our first time in Europe. We did walk around a few port towns after our excursions"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Have a look here: www.tomsportgui\ndes.com\n\nAlso, join your roll call on Cruise Critic. Fellow cruisers are usually looking for people to join them on private tours."}, {"username": "Lauran Cantwell", "comment_text": "Be aware that many of the cruise ports are quite a distance from the actual town. You will need transportation to the city at the very least. While there may be independent tour operators to choose from, it's just safer and easier to book ship excursions."}, {"username": "Rachael Richardson", "comment_text": "You defo won’t need 12 hours in Pisa get a train to Lucca from there , you’ll easy have time"}, {"username": "Martha Hughes", "comment_text": "You can download audio tours on your phone free from Ricksteves.com... then you can wander on your own and make your own way. OR on line you can find ToursByLocals.c\nom .. choose a guide and they'll design your tour and tell you so much history (like the audio RS tours). I love the local guides they're spirited and are so educated."}, {"username": "Susan Lowry Lamb", "comment_text": "I’ve always been of the belief that it’s safer to book through the cruise line, because your risk of not making it back to a ship that’s leaving port are cut dramatically."}, {"username": "Kathy Tully Sexton", "comment_text": "Just took a cruise from Greece to Venice. We only booked one port thru the cruise line. Make certain you know exactly what port the ship calls on. Some are hours away from the “famous” cities. Also are the ports docked or tendered. That makes a difference. If you do not do a ship sponsored excursion take a photo of the sign displaying the return time before you disembark so you know exactly when you must be back on board. Usually 30-60 min before departure but sometimes more. We didn’t want all that travel time so we stayed local and saw smaller cities closer to the ports but we are not first timers. Most ports will have lots of people trying to sell you excursions upon coming ashore."}, {"username": "Judy Carey", "comment_text": "It's probably cheaper to book with tour companies like Viator or Get Your Guide."}, {"username": "Ken Lerch", "comment_text": "The governing factors are that it is your first time here and some of the destination (Rome, Florence and maybe parts of Sicily) are significant distances from the ports. The logistics and coordination will be difficult for a newbie. Let the cruise line take care of those factors."}, {"username": "Rebecca R. Russo", "comment_text": "We just got back from a 11 day cruise! We did everything ourselves and did not book excursions through the cruise line. For the Florence/Pisa port it's actually Livorno I believe which is about an hour away from Florence. If you are good with time management then do your own... however if you are not maybe booking through the cruise line would be best."}, {"username": "Rebecca R. Russo", "comment_text": "Rome was the hardest place to get to because you had to take a bus provided by the train station to the next train station about 40 minutes away because of construction on the tracks. But still was able to see the coliseum, the Vatican, capital, waterfall and had an amazing lunch."}, {"username": "Mary Zagers White", "comment_text": "We just did a 9 day cruise. I did a lot of research before and booked most through Get Your Guide and some through the cruise. Def google the ports and understand what it takes to get to where you want to go. And then decide what you want to do. My fav was a segue tour. Good luck and enjoy!"}, {"username": "Aurora Villegas Flores", "comment_text": "We didn’t book anything through our cruise. We did it ourselves, and used Viator. 👍🏼"}, {"username": "Delphinia Salamin", "comment_text": "It’s always best to book through the cruise line especially if you have not visited these ports before. If the cruise is late docking or you miss a port you will get refunded by the cruise line but you will not get refund from private tour operator unless you have travel insurance to cover the cancelled port. For Rome you dock in Civitavecchia a small town you may want to walk around but on your own to go to Rome you need to get in on a train. Otherwise you may find tour operators outside the ship that may offer last minute tours"}]}, {"id": "2204432609955817", "text": "Hello everyone,\nI am planing to travel to italy for approximatively 3 weeks. I have never been to Italy and I need some help from you . Do you think that my plan is ok ? I will be travelling in late august 2023 !\nVenise : 3 nights\nComo lake : 2 nights ( I don't know if it is a good idea to go do como lake during the first week of september ... is the… आणखी weather good enough ?\nCinque terre 3 nights\nFlorence 3 nights\nTuscany : 3 nights\nPIano di sorrento : 4 nights\nRome : 4 nights\n\n\nMy second question is what type of luggage do you bring with you ? Backpack ?\n\n\nThank you very much", "link": "facebook.com/groups/1373361046396315/permalink/2204432609955817/", "likes": 78, "comments": [{"username": "Rachel Lange", "comment_text": "I am also leaving in about three weeks and I have booked all my hotels around about 10 months ago, ￼activities and fast trains . ￼ I think everything is booked out. Good luck, finding accommodation as I believe the whole world is going to Europe. ￼"}, {"username": "Caterina Liquori-Culhane", "comment_text": "We were told September is now peak tourist season"}, {"username": "Grace Scinto", "comment_text": "Wheeled suitcases are fine as long as it’s not overly large. Stick to 68cm suitcase that will expand and a daypack for everyday use. With that amount of space and light clothing you will be fine."}, {"username": "Alison Alborough", "comment_text": "Have just returned from Italy (and 6 other countries). Glad you are spending time in each place. Enjoy each one fully. Don’t madly rush to take in every possible site. (Leave some to enjoy on your next visit).\nI hate back packs - very hot on your back but convenient if you are happy for the weight and sweat. We had medium sized roller bags but could easily have just used carry on. No one dresses up. Wash and dry lightweight clothes. Make sure to have really good footwear (I only wear sandals)"}, {"username": "Laureen Chivell", "comment_text": "Sienna."}, {"username": "Linda Tibbles", "comment_text": "Tuscany is a region, not a specific town. I would recommend staying in Florence for extra nights, and doing day trips out in Tuscan region."}, {"username": "Maicol Carrasquilla", "comment_text": "Rome maximum 2 nights. Spent more days in Florence is worth more"}, {"username": "Nicola Morgans", "comment_text": "you don't need three nights in Cinque Terre."}, {"username": "Leanne Hopkins", "comment_text": "Following"}, {"username": "Marianna Holloman", "comment_text": "Pack in a carry on. You will be so glad you did with that much travel. Enjoy!"}, {"username": "Nina Sikand", "comment_text": "Went to Florence at Easter for 5 nights and 3 is definitely manageable. Loved it beautiful city. Stayed in Sorrento for a week but 4 nights would be adequate too. Long time since I went to Venice but did manage it in a weekend. Enjoy!!"}, {"username": "Patti Koscal", "comment_text": "We’re doing Venice for 3 nights, Florence for 5 and Rome for 4. Doing day trip to the Cinque Terre from Florence and also Siena. Then we get on a transatlantic out of Rome for 15 nights we travel carryon only. A soft sided European size roll on and a personal item. We did the same last year for London. We are 66 and 70. It was a breeze. Happy vacation!"}, {"username": "Sopra la Roccia", "comment_text": "Da Toscana andare a Sorrento ci sono parecchie ore viaggio"}, {"username": "Steve Wolfrom", "comment_text": "Stick with your plan. The weather will be fine, and you’ve allowed plenty of time at each stop. If you have your hotels, you’re all set. ￼ If you haven’t done so already, it’s time to plan your transportation.\nI’ll assume you know that for many tours in attractions you will want to buy your tickets advance."}, {"username": "Joseph Guerrero", "comment_text": "Sounds excellent, I know there are other places or itineraries but my best advice is to not overthink it, you will never be able to do it all, and PACK LIGHTLY!"}, {"username": "Robin Terzi", "comment_text": "Perfect!"}, {"username": "Basia Szokarski", "comment_text": "Sounds like good amount of time in each place. Weather in Italy is still hot in September. How are you traveling in Italy? Como is lovely but it'll be a lot of effort to get there and you'll already be seeing such incredible places...that you may want to reconsider....e\nspecially if by train."}, {"username": "Basia Szokarski", "comment_text": "3 nights in CT is Ideal. I recommend staying in monterosso as there's a lovely beach where you can go after hiking. Two solid days will give you time to hike on two mornings and relax in the late afternoons and evenings. We stayed at the hotel Vila steno. If that's not available ask about their sister hotel ...hotel de Pasquale."}, {"username": "Bonnie Siu", "comment_text": "I did north Italy for 18 days Venice, the Dolomites, Mantova, Verona, Bologna, Bergamo and Milan. It was great - food, people, culture. I used a 60+ litre backpack and so happy I did that, not only it’s easier i got some muscle training too! 🙂\nEnjoy your trip! 👏"}, {"username": "Leigh Ann Fan Farmer", "comment_text": "If you can, I would suggest traveling light. When we visited Cinque Terre, we just had spinner carryons and it was still a pain to carry up several flights of stairs to our room. My husband just used a large backpack. if you take a train, there is also a good chance you will lug your luggage up and down stairs to get to the correct platform. Definitely bring a suitcase with good wheels. You will most likely be pushing your suitcase esp in Venice if you are not carrying it. we carry a packable duffel if we need more space. Good luck and have a blast!"}, {"username": "Sue C. Aurandt", "comment_text": "In Rome do not stay at The Hilton that is connected to\nAirport. If anything goes wrong they will blame you and then charge you. They are not interested in your side of the story. Have fun!!!"}, {"username": "Bernadette Breen-Shinner", "comment_text": "Looks good\nWeather will be fine\nLight is always best for luggage"}, {"username": "Patti Bauman Widener", "comment_text": "Your schedule actually looks good, IMHO. However we prefer to stay longer in one place and not jump around for short stays, believing we will return in the future. Don’t forget that travel days can take up a good part of the day, buy the time you find your new accommodation and settle in.\nIt should still be warm in early September. We will be in Cinque Terre and Milan at that time and are planning for weather in the 80’s.\nLuggage is a personal preference. Try to travel light. Getting on and off trains with big suitcases can be a pain."}, {"username": "Lisa DeCastris Kvintus", "comment_text": "Your plan is great! All places wonderful! Italy is beautiful, don't stress the small things, take it all in...have been to all those and loved all🇮🇹❤️"}, {"username": "Marie Montafia", "comment_text": "September is beautiful weather in Italy. Your itinerary looks great, I wouldn’t change it…"}, {"username": "Suzanne Sullivan", "comment_text": "Wow! I wish I had been a part of this site while I was planning for the trip I’m on now. For what it’s worth, I’m in Florence now and I wish I had stayed an extra night in Sorrento. I’m gone for 18 days and I stucka day of rest on at Florence which I’m thankful I did as my itinerary is as busy as yours. I post every day on my page with what I’m doing and seeing if it interests you and helps you plan yours. Here is the itinerary I made."}, {"username": "Debbie Milne Jenkins", "comment_text": "Nice itinerary - I travel for 2-3 months with only a carryon piece of luggage for ease in train travel - photos are my souvenirs and I bring clothing that dries quickly and do hand washing in the tub on the first night’s stay at each 213 night stop. System has worked very well for my husband and I - ages 68 and 73 so we don’t want to haul lots of luggage - he also brings a carryon and a very small backpack for day trip use."}, {"username": "Carolyn Collins", "comment_text": "Can you squeeze in Matera in Basilicata? Such a special place!"}, {"username": "Maryjo Zappia Jeffries", "comment_text": "I took just a carry-on bag and a backpack for a two week stay. We traveled to Italy and the UK so we needed summer clothing and clothes for much cooler temps. Our flight kept getting canceled so having our luggage with us worked to our benefit for last minute flights. I booked places with washing machines and packed clothes pins and laundry detergent sheets. This worked great for our family of four. I didn’t wear half the stuff I packed. Also, we had lots of steps to climb for all of our rentals so having a small suitcase was a lifesaver"}, {"username": "Helene Smith", "comment_text": "Where is Napoli! You need to stay there too."}, {"username": "Bea Kuckens", "comment_text": "You'll be doing a lot of moving around - if by train, smaller luggage is easier. We take carry-on size rollaboards. In-line skate wheels are better on the cobblestone streets than spinners. Add a backpack - a small one can be your \"personal item\" on the plane, or you can check the carry-on suitcases (which is what we do)."}, {"username": "Lucrezia Folger", "comment_text": "Venice : 3 nights\nLargo Como: 2 nights,( Google weather trends that time of year)\nCinque Terra 3 nights (3 nights is NOT too much)\nFlorence is the capital of Tuscany for 3 nights.\nAdditional(Tusc\nany : 3 nights?)\nSorrento: 4 nights\nRome 4-5 nights\nAs far as luggage, you will get a lot of opinions on that. I have always done a check-on and a carry-on. People travel all different ways so do what's comfortable for you."}, {"username": "Shelby Symons", "comment_text": "I'm still on my 5 week trip here (currently on my 4th week) and we did 2 nights in lake Como which was enough we spent a whole day out on the ferry going to different ports etc we also did cinque Terre and based ourselves in Manarola so we were away from the crowds and then just jumped on the trains to do trips and we did 3 nights here which was enough. Our air bnb was great and had a terrace which we could people watch from. We did 5 days in Florence and we did so much from here we were out doing day trips everyday besides one day so I think 3 would be enough. We are doing Rome at the end of our trip as we fly out from there and we are doing 3 nights there"}, {"username": "Marsha Katz", "comment_text": "Cinque Terre\n1 night is enough, even if you see all 5 towns.\nI you’re sadly missing Venice!! That’s a huge mistake.. it’s fabulous!"}, {"username": "Sara Punis", "comment_text": "To see Venice you need like 1-2 days, Cinque terre also 2 days. I would prolong staying in Rome maybe"}, {"username": "Jenny Frank", "comment_text": "There is no guarantee ever re weather and Europe is gorgeous in any weather!!!"}, {"username": "Jackie Bottenberg Evans", "comment_text": "We are doing 3 1/2 weeks. 3 nights in Paris then to abuzzo for a week then Tuscany and then up to cinque terra."}, {"username": "Alejandro Gabriel Valenzuela Anghileri", "comment_text": "Lake Como: past year it was good 'til mid October and beyond. First week of September should be fine"}, {"username": "Judith Wylie", "comment_text": "I know you have put a lot of thought into your itinerary, and it looks great, but I wouldn’t have skipped our two-night visit to Capri. The Cadillac convertible taxis were worth the trip. We stayed in Anacapri, a little town higher up. I don’t remember how we got around, probably those taxis and a lot of walking.\n\nIt was a long time ago. I hope it hasn’t changed much."}, {"username": "Pauline Newton", "comment_text": "This sounds EXCELLENT - a good distribution of days. Staying those 3 or 4 nights here and there is always good as you get to feel familiar with a place and a little bit ‘at home’ .\nWe always stay in air bnb now so that we cand. easily do washing/\nlaundry AND we like shopping for food and cooking some of the time- eating at restaurants for EVERY meal becomes tiresome not to mention expensive. My husband and I share ONE MEDIUM size suitcase and one cabin bag- - we learnt that juggling bags is no fun at all.\nBest wishes!"}, {"username": "Suzanne Mills", "comment_text": "Way too much travel. Garda not Como. It’s Venice by the way . Skip Tuscany and more Rome .\nMore Florence, cinque terre deserves 10 days minimum.\nHumid and likely rain but fewer tourists."}, {"username": "Karla Danielle Heywood", "comment_text": "for me 2 nights in venice was more than enough … why not do 1 night in garda or verona as both on way to como!\n\n3 nights in cinque terre too much … whilst travelling down why not spend a day visiting genoa, camogli, portofino, santa margerhite?\n\nlots of time needed for florence, but maybe 3 days in central tuscany too much … have a look at lucca too"}, {"username": "Michael Widjaja", "comment_text": "Pre covid I did a month in Italy for language and gastronomy course in October-Novembe\nr period and I brought 1 (trunk) luggage,1 cabin luggage and 1 backpack and I stuff 1 duffel back"}, {"username": "Frank Hunt", "comment_text": "Tuscany is a big place"}, {"username": "Stefan Sig", "comment_text": "You will likely find that four days in Rome will not be enough, but if that’s all the time you have at least you’ll enjoy it ￼"}, {"username": "Landa Lusby", "comment_text": "I’m headed at that time 4 nights Rome, 4 CT, 5 in Tuscany area and 2 in Lake Como. I think you should be fine. It’s all in what you want to do in each area"}, {"username": "Tremayne Mushayahama", "comment_text": "Pack lightly, bring a small suitacase (a carry on) and day bag, you will climb those stairs with a large suitcase. There is plenty of laundry in Italy.\nIf it's your first time, go crazy and go against the rules here since people always say too many places. Visit as many places as you can so that next visit you know where to take more time. Therefore, 3 nights in Venice is too much. and also 4 nights in Rome is too much. I would include Amalfi Coast, Naples (visit to Pompeii), Sorrento and visit to Capri. And while in Florence, day trips to Pisa, Lucca and Vineyards)."}, {"username": "Ana Belen Ayard", "comment_text": "Sounds great to me"}, {"username": "Michelle Cutrone Van Duyne", "comment_text": "Venice 3 nights\nComo 3 nights\nFlorence 4 nights and do a day trip into the countryside\nSorrento 4 nights\nRome 3 nights"}, {"username": "Ryan Monahan", "comment_text": "We did almost your identical trip, but in reverse. And we chose Lake Garda instead of Como. But overall, loved the trip, it was amazing!!!"}, {"username": "Jenny Wardle", "comment_text": "I bought one of these. It has wheels but also straps for a backpack if you want to carry it. To be honest, I just wheeled it everywhere and it was fine. All the same places you are going. Great itinerary.\nIf I went back, I would stay a night in Siena and one less in Florence or Rome and would splurge on a night in Capri"}, {"username": "Cryst Cheung", "comment_text": "It’s too long for 4 night in Rome\nComo lake is a place more worth to spend times, there’s a lot of beautiful town nearby or just even stay in the balcony for the whole morning.\n\nFlorence is in Tuscany , you can together stay 6 days but not Florence 3 nights ( the town itself maybe 2 days is enough)"}, {"username": "Cryst Cheung", "comment_text": "Cryst Cheung"}, {"username": "Cryst Cheung", "comment_text": "Cryst Cheung"}, {"username": "Irene Oda", "comment_text": "The question really is - are you ok with it? Hope you have all your accommodations confirmed. Otherwise it's either slim pickings or nothing. Enjoy your trip!"}, {"username": "Dunia Aldyni", "comment_text": "Nice plan but don’t miss Venice is magical 😍😍😍"}, {"username": "Evan-Sue Wilson", "comment_text": "I think your timeline is really good. By the time you take out a day or half day travelling, the stay is always shorter. You do want to stop and smell the roses."}, {"username": "Stacy Oberman Malinow", "comment_text": "Just came from Rome, Florence, Venice and Lake Como. I would say 2-3 days in Rome, 3 days in Florence, 2 days in Venice and 3 days in Lake Como. In August though many things may be closed. I traveled with one suitcase and one backpack/ carry on. Your clothes will be light so you don't need much luggage."}, {"username": "Annette Mayer", "comment_text": "Don't miss Lucca"}, {"username": "Jen Larkin", "comment_text": "Late august is fine. We travelled northern Italy and booked accommodation as we went. We travelled via train and booked hotels close by. Was a wonderful trip and fabulous accommodation!"}, {"username": "Christy Geis", "comment_text": "That sounds like a lovely plan! My boyfriend could do that with just a backpack ( of course doing some laundry along the way). I would do a backpack plus a carryon. I typically don’t like to worry about checked luggage."}, {"username": "Dafne Vassetti", "comment_text": "1. Weather in Como should be fine. But still weather is unpredictable, but it's still warm that time of the year.\n3. Night in Cinque Terre is too much unless you will be visiting also places like Portofino, Sestri Levante, Santa Margherita Ligure.\n4. Florence is in Tuscany - it's the capital of the region Tuscany. Any specific place you were thinking to stay?"}, {"username": "Julie Angel Bruther", "comment_text": "I’m doing 6 weeks . Venice to Sicily! Only carry on and backpack. Making sure my Airbnb have a washer.. so much easier to get around"}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "Just finishing up our trip. Definitely over-packed. Since you'll be in different cities, plan to mix and match clothing to rewear. Did carry-on and that made life very easy."}, {"username": "Sande Ricci", "comment_text": "Bring a carryon. I have an Ebag that I love. It's a roller bag that can be used as a backpack as well. Giant suitcases are hard to travel with."}, {"username": "Cheryl A. Taylor-Allred", "comment_text": "If you’re traveling alone, it’s a bit difficult to manage a large suitcase on the trains. Laundromats are readily available- I take a carry on and backpack for 3 weeks and just plan to wash while I’m there.\nYou will love Italy and will have a fabulous time with your itinerary. Side note- carry a copy of your passport with you and always lock your passport up at your hotel 👍🏼"}, {"username": "Charleen Siegler Schuss", "comment_text": "The itinerary looks great. Maybe a little too much time in CT unless you going to do a lit of hiking. August is an awful month to however. It's hot, hot and that's when all the Italians take there vacations. Late September is perfect. I bring a carryon with wheels and an expandable bag. You are staying at each place to do laundry. I was tops occasional pants and undies using shampoo or body wash. Use a towel to ring out the clothes and hang over night. It might take a day and a half. Bring at least 2 pairs of comfortable walking shoes and a light rain jacket.\nHave a wonderful time. Less is more when traveling."}, {"username": "Alice Francesca", "comment_text": "Make it september if you can.August is peak tourist season and everywhere you will go it will be unpleasantly overcrowded"}, {"username": "Elaine Hester", "comment_text": "Italians vacation during the month of August. Lots of places close. Search this group as I think there was a post yesterday about this."}, {"username": "Mike Adams", "comment_text": "Looks lovely! Take me. I’m small and don’t eat much.\n\nSmall luggage , with wheels for me .\n\nBack lightly. Wear layers.\n\nWash smalls at night."}, {"username": "Jenny Payne", "comment_text": "Don’t take the world ,it is hard work . I travel a lot in Italy and my advise a good packsack ,& a good cabin size case + a crossbody bag. One pair of leather sandals and a pair of good sneakers as it is still very warm, if u haven’t got it buy it they have everything + 🌻🌻"}, {"username": "Fernando Leon", "comment_text": "1 . Take hotel in Padua . In train go one day to venice , and other to verona and Vicenza .\n2. Its so much time in cinque terre .\n3. Take time to go to Capri and At least to Taormina and Agrigento in Sicily .\n4. Travel whit a small baggage"}, {"username": "Tami Sue", "comment_text": "I have two different backpack luggage. They barely fit as a carry on because they are long. And one has wheels. I would end up wheeling it around so now I just bring a carry on luggage. Make sure it has 4 wheels."}, {"username": "Frank Dragna", "comment_text": "Check to see how much time is going to be eaten up by travel between destinations. Can lose a lot of quality time that way."}, {"username": "Glenn Todd Webb", "comment_text": "Como is fine. Didn’t care much for Sorrento. Stay in Ravello instead. CT and Amalfi coast are so similar, cut one and spread the time out."}, {"username": "Tracy Piko Lawniczak", "comment_text": "I did a Tom Bihn 45L backpack. We were gone for 10 days. We did some Airbnbs so we could wash laundry."}, {"username": "Roland Trego", "comment_text": "It looks very doable, actually."}, {"username": "Philip Curnow", "comment_text": "Drop a night from 5 Terre and add it to Tuscany"}, {"username": "Diane Janovas", "comment_text": "Are you really saying August this year...which is this month"}, {"username": "Diane Janovas", "comment_text": "."}, {"username": "Steve Grossman", "comment_text": "At this time, I don't think you will find any hotels available. Or many airbnb. August is also the month that all Italians are on vacation. I would strongly Suggest that your trip should start in the middle of september When the crowds have disappeared"}, {"username": "Rachel Cox", "comment_text": "That's a nice well paced itinerary :) I wouldn't worry about the weather at Lake Como at that time of year.\n\nI also don't think it's too much time in CT like others are saying. Too many people try to do a rushed visit - you have 3 weeks, so it's good that you can take your time!"}, {"username": "Paula DiCicco", "comment_text": "I agree don’t think that is too long in CT. We are just finishing up 3 weeks and did Venice (2), Lake Como (3), stopped in Milan for afternoon, Cinque Terre (3), Rome (3), Sorrento (4) and family 4. Was perfect amount for each at three weeks. However, could have used a day more in each of possible. Travel by trains until Rome which does take up a good chunk of day. Also, depends what all you would want to see in each as to where you stay longer. I had lot I wanted to do in Sorrento so wanted longer - kayak, Capri, Amalfi coast, beach etc. Enjoy!!"}, {"username": "Alicia Cox", "comment_text": "Looks like a great itinerary! Have a great trip!"}, {"username": "Dori Reader", "comment_text": "Following"}, {"username": "Julie Agarkov Mayblyum", "comment_text": "Sounds great"}, {"username": "Greg Saba", "comment_text": "One caution: Piano di Sorrento. We booked there once, assuming that it was close to central Sorrento. We regretted it because we needed to take public transportation anytime we wanted to visit the areas where tourists usually go. We got more bang for our buck there, but we paid and walked away when we realized just how far away it was from the core of the town."}, {"username": "Alexandra A Welker", "comment_text": "I think your schedule/\nitinerary looks good. Get the hard shell luggage because it's light and durable. For a personal bag a backpack works but this is what I use, a weekender bag and it can fit a lot of stuff. 😀"}, {"username": "Vikki Grass", "comment_text": "IMO Lake Como, I would split 1 night Varenna and 1 night Belagio.\n\n3 nights in Santa Margherita because you can train to Cinque Terre as much as you can tolerate the crowds and this town is enchanting. You can ferry one day over to Porto Fino.\n\nhotel-continent\nal.it\n\nThis hotel is walkable from the train station"}, {"username": "Lisa Zarlingo Smith", "comment_text": "I think it looks wonderful - and to all the people saying 3 nights is too much in Cinque Terre - we stayed two nights and wanted a third~"}, {"username": "Miyuki Kanno Paul", "comment_text": "Are you flying into Venezia and flying out of Roma?\nWe do bring large suitcases with 4 wheels that spins 360° along with carry on roller board suitcase, a duffle bag, a tote, etc. We always bring wine, EVO, jarred products, ceramics, and such home that having large suitcases are essential. We carry foldable daypack each for daily activities. No fancy bags necessary.\nYou do need a pair of very sturdy shoes or two. Merino wool socks are very breathable. Bring a wide brimmed hat. A tube of high SPF sunscreen is a must. The ray of sun is much stronger in Italia."}, {"username": "Rachael Richardson", "comment_text": "Sounds good to me\n!\nWe went for 17 nights had a small case, checked one in as has toiletries in , carried on the others plus a small rucksack\n1 case each , small rucksack or handbag"}]}, {"id": "2204277619971316", "text": "Hi all, when staying in BnB's, where do you get advice on transport from your accommodation to the train station when uber is not available? Ostunia is where we will be. Thankyou", "link": "facebook.com/groups/1373361046396315/permalink/2204277619971316/", "likes": 1, "comments": [{"username": "Matteo Basile", "comment_text": "You may check on Google maps or other apps or just ask the host. Anyway in Ostuni there is a train station about 4km from the town you may reach by taxi or bus"}, {"username": "Dafne Vassetti", "comment_text": "Ask your host!"}, {"username": "Gena Kona-Mancini", "comment_text": "I have been relying on Google maps!"}, {"username": "Gillian O'Callaghan", "comment_text": "Ask the BnB owners......I'm\nsure most people staying there need transport."}, {"username": "Kay Rendall", "comment_text": "Ask your host, they organised cheap taxi for me Ostuni."}]}, {"id": "2204384029960675", "text": "Has anyone figured out any cooling tips for sleeping with no a/c? Before I get any sass, I'm from Louisiana, so I know heat and humidity. In fact, it's cooler in Naples than it is here right now. (But our power went out at home a few weeks ago and I about pulled my hair out.)\n\nAnyway, my husband will be working nights and needs to sleep during theआणखी day, so he'll be extra miserable. And he's already a hot sleeper and a poor sleeper. I'm looking online at fans that go under your sheets, desktop \"a/c\" and all kinds of stuff but I'm worried about voltage and actual effectiveness. Have any hot sleepers tried any of these things?", "link": "facebook.com/groups/1373361046396315/permalink/2204384029960675/", "likes": 6, "comments": [{"username": "Katie White-Meade", "comment_text": "I recommend a cooling cloth each. They are fabulous. You just wet them and place them where you want the area cooled. Around the neck is ideal."}, {"username": "Jenn Messina Babore", "comment_text": "Do you already have accommodations or can you rebook for a place that has a/c? Our AirBnB had a/c."}, {"username": "Miyuki Kanno Paul", "comment_text": "Many places do not have window screen. Expect mosquitoes visiting. If your hotel doesn’t have Vape or plug-in mosquito repellent, get one from a nearest grocery store/general store"}, {"username": "Allison Mir", "comment_text": "AC isn’t common where I live - when we had unusually hot weather in June I put a hot water bottle in the freezer which was amazing"}, {"username": "Stacey Esposito", "comment_text": "Cooling cloths one night I placed a portable handheld fan on the night table so I could sleep."}, {"username": "Kim Sousa Andrews", "comment_text": "Just make sure your place has a/c before you book. All 5 of my airbnbs had great a/c!"}, {"username": "Amie M. Rossetti", "comment_text": "Lather yourself in menthol or camphor. It'll keep you cool all night, and breathing easier"}, {"username": "Narelle Harper", "comment_text": "Have a cool shower, don’t dry off, lay on a towel, hopefully with a fan. Usually worked for me when it’s hot."}, {"username": "Melody McLean Norburn", "comment_text": "Cooling mats (bought them for our dog) work for quite a while. Sheets in fridge /\nfreezer before bed (I’d use a large ziplock bag) was one of recommendations made by experts during recent heat wave. I second the cool shower before bed, cool cloth over fan"}]}, {"id": "2204384186627326", "text": "Hi everyone, I am visiting Verona at the start of September. We have booked the opera but looking for other recommendations for what to do also also places to eat. Thanks 😊", "link": "facebook.com/groups/1373361046396315/permalink/2204384186627326/", "likes": 0, "comments": [{"username": "Pietro Adami", "comment_text": "Trattoria Giulietta e Romeo, in Corso S. Anastasia (local recipes for locals)\n\nAlcova del Frate, near Ponte Pietra (more expensive but worth every cent); narrow seats & tables\n\nL’Oste Scuro (definitely expensive but it is a unique fish experience! )"}, {"username": "Stefano Follador", "comment_text": "Pietro Adami had some really complete comments.\nI should add another restaurant that I found out quite nice: La Greppia, is just in the city center.\nTheir “bollito”, typical regional dish, is really good"}, {"username": "Nicola Bradley", "comment_text": "https://\nwww.hosteria17.i\nt/"}, {"username": "Nicola Bradley", "comment_text": "Also lovely neighbourhood and great selection of pizzas https://\nwww.tripadvisor.\nco.uk/\nRestaurant_Revie\nw-g187871-d6212\n163-Reviews-La_\nPizza_di_Paolo_\nRosetta-Verona_\nProvince_of_Ver\nona_Veneto.html"}, {"username": "Nicola Bradley", "comment_text": "https://\nwww.torredeilamb\nerti.it/en/"}, {"username": "Nicola Bradley", "comment_text": "If time I would recommend a day trip to Venice, only an hour by train"}]}, {"id": "2204391303293281", "text": "Any advice for ferries in Lake Como? We will be staying in Tremezzo in May. The navigazionelaghi website timetables for \"Ship and Fast Service\" seem to be pretty comprehensive but when searching for trips on the site nothing comes up. Do we buy tickets ahead of time or only day-of?", "link": "facebook.com/groups/1373361046396315/permalink/2204391303293281/", "likes": 0, "comments": []}, {"id": "2204396129959465", "text": "The day we leave, need to get from Florence to Rome for our flight at 3 pm. What is the best way? Having trouble figuring it out.", "link": "facebook.com/groups/1373361046396315/permalink/2204396129959465/", "likes": 18, "comments": [{"username": "Caroline Costa Leng", "comment_text": "Train\nGet the OMIO app\nSo easy"}, {"username": "Lyn Pappas Dahm", "comment_text": "Leave the day night before and stay in Rome close to the train station that night. Then take the Leonardo Express to the airport around noon."}, {"username": "Bobbie Lane Hausherr", "comment_text": "I’d take the train from Florence to Rome the night before and stay there overnight."}, {"username": "Margaret Liggieri Markman", "comment_text": "Private driver"}, {"username": "Jodi Shiffman Silverman", "comment_text": "Train"}, {"username": "Kim Aranha", "comment_text": "Train"}, {"username": "Jenna Phillips Clabeaux", "comment_text": "Train"}, {"username": "Charlie Charnigo", "comment_text": "Stay the last night at Rome airport. Way to much can go wrong trying to go that far the day of the flight."}, {"username": "DeAnna Pulliam Like", "comment_text": "I believe there is a Hilton at the Rome Airport. There is another hotel there I believe that rents in 3 and 6 hour increments. ? So you could get some sleep before you need to check in and go through security. That would take the stress of travel and making it to the airport off your mind. 😊"}, {"username": "Bob Lampo", "comment_text": "Use the Rome2rio website and it shows you every option. You can plug in your hotel address and the airport and it will plot you door to door."}, {"username": "Danai Cerra", "comment_text": "Train"}, {"username": "Scot Gabriel", "comment_text": "Rented a car and drove to Pisa for a quick visit then onto the airport. Stayed overnight at the Airport Hilton. Easy walk over the link bridge right into the terminal."}, {"username": "Tricia Harman", "comment_text": "Train…"}, {"username": "Shelly Kentner Lehman", "comment_text": "We took the Italo Prima train easy to get tickets and board train. Great way to travel"}, {"username": "San Dra", "comment_text": "Just curious, in the event of a transit strike on a booked train route, what typically happens to travellers? Do they get rebooked, refunded, another transit mode offered? (Or basically go figure it out for yourself at the time?)"}, {"username": "Andy McCain", "comment_text": "Andy McCain"}, {"username": "Candy Mattiello", "comment_text": "Train… beautiful ride! It goes right to the airport…."}, {"username": "Michele Baron Vold", "comment_text": "Night before, stay in Rome at the airport."}, {"username": "Jane Capone", "comment_text": "I hired a driver. No stress"}, {"username": "Charlotte Lowe", "comment_text": "Train"}, {"username": "Jeanne Santomauro Schnupp", "comment_text": "Train"}, {"username": "Pong Ac Ai", "comment_text": "Train head straight to termini"}, {"username": "Pong Ac Ai", "comment_text": "Sorry train Firenze SMN to FCO"}, {"username": "Elaine C. Macalolooy", "comment_text": "We took the train from Venice to Rome on the same day for our flight back to Barcelona and it took 4 hrs. Booked our ticket online from Venice to the airport. You will likely need extra time to be at the airport to check-in your luggage and maybe even get your VAT Refund. For me, I would definitely leave early in the morning so I can get to the airport by 12pm."}, {"username": "Christine Matthews", "comment_text": "train"}, {"username": "Fiona Mac", "comment_text": "Fast train"}, {"username": "Josephine Rauch Rotunda", "comment_text": "We had the same issue five years ago… taught us to plan better with arrival and departure cities in mind!\n\nWe ended our vacation in Florence and had to get back to Rome for a flight so our hotel arranged a private car service… I don’t remember anymore what it cost but it seems like $300 rings a bell.… It was worth it. The train would’ve been more troublesome and we would’ve needed a cab just to get to the train station so this worked out great ….there were five of us….too much and heavy luggage to drag around."}, {"username": "Mandy Thurmon McLaughlin", "comment_text": "The Rome2Rio app was a huge help during our trip"}, {"username": "Laura Lvdl", "comment_text": "Train"}, {"username": "Michelle Corrao", "comment_text": "Train"}, {"username": "Ken Lerch", "comment_text": "Rapid train"}, {"username": "Rachael Richardson", "comment_text": "Train"}, {"username": "Bonnie Manter", "comment_text": "Train"}, {"username": "Dafne Vassetti", "comment_text": "Two times a day there is the direct train (fast train) from Firenze Santa Maria Novella Station to Fiumicino Airport. So much easier than arriving in Rome train station and then changing to get the Leonardo Express, especially if you have big luggages.\nYou will arrive very early at the airport, but less stressful and you won't have issues in case of delayed trains."}, {"username": "Henry Ratliff", "comment_text": "High speed train 🚊 go business class it’s a few bucks but nice."}, {"username": "Elaine Valte-De Jesus", "comment_text": "High speed train. I took Italo Rome to Florence and Florence to Venice. It was great and easy"}, {"username": "Annick Mannaerts", "comment_text": "Train! Traffic can be jammed. It’s relaxing."}, {"username": "Jayne Dawson Meyer", "comment_text": "High speed train!"}, {"username": "Bill Shafer", "comment_text": "I would go the day before. Italy is notorious for transit strikes."}, {"username": "Lucrezia Folger", "comment_text": "Remember you need to get there by 12PM."}, {"username": "John Bruckman", "comment_text": "There’s a train every hour."}, {"username": "Shane McClain", "comment_text": "Train"}, {"username": "Shane McClain", "comment_text": "Italiarail"}, {"username": "Eileen Lonergan", "comment_text": "Get Rome the day before"}, {"username": "Shannon Plane", "comment_text": "High speed train is extremely convenient."}, {"username": "Pao Magnoler", "comment_text": "Fast train. Frecciarossa."}, {"username": "Linda Pitler", "comment_text": "Early fast train. You’ll be in Termini in 90 minutes, then take the train from there to the airport."}, {"username": "Paula Stewart", "comment_text": "Train x"}, {"username": "Karavaraki Ioanna", "comment_text": "There is a high speed, non stop train, to fumicino airport.\nIt takes only 1.5 hours"}, {"username": "Marty Harte", "comment_text": "I’m literally in a van having left Florence an hour ago heading back to Rome. Have about an 1:15 to go and the bullet train passed us by. I’m on a tour but for SURE take the train."}, {"username": "Beth Casey Murphy", "comment_text": "Beth Casey Murphy"}, {"username": "Julie Frady", "comment_text": "I love the train! Nice ride ❤️"}, {"username": "Nadia Filice", "comment_text": "Take early morning fast train"}, {"username": "Debbie Schultz", "comment_text": "Take a high speed train. And then cab to airport."}, {"username": "Donna Russonello Merlino", "comment_text": "Dafne Vassetti FrecciaRossa train is the fast train.\nItaliarail.com is in English. It is one hour and a half. Buy “Business second class” is what we do. To airport. Or, to central Rome the day before. Roma Termini station."}, {"username": "Barbara Bastianini", "comment_text": "Everyone’s different. I myself always always spend the night before a flight near the airport I’m flying out of.\n\nTransportation can always be subject to the unexpected. Trains can be delayed, sometimes for several hours. If you drive you can hit traffic congestion or get lost. If those things happen on the way to Rome it’s possible you’ll be left scrambling for an alternate way to get to the airport on time. Or else you could miss your flight. Since you can never count on everything going perfectly when you transit I prefer to actually be near the airport to make my trip home easier. That’s just less stressful for me.\n\nOf course things could go just right. That’s a possibility, too. But I prefer to consider the worst case scenario when planning. That’s what works for me."}, {"username": "Bea Kuckens", "comment_text": "The train from Florence to Rome Termini takes just under two hours. You then change to Leonardo Express to the airport which takes about half an hour. Some people do it the day of their flight, but we prefer to stay near the airport the night before to make the travel day less stressful."}, {"username": "Cinzia Colombo", "comment_text": "Frecciarossa to Fiumicino … book online in advance and you will avoid troubles …"}, {"username": "Michelle Bergman Davis", "comment_text": "Take an early train"}, {"username": "Jennifer Gustafson", "comment_text": "The train!"}, {"username": "Diane Davis Lawyer", "comment_text": "High speed train, takes about 90 minutes or so."}, {"username": "Mike Laudick", "comment_text": "Take the train to Rome and then another to FCO. It is easy."}, {"username": "Rosa Morabito", "comment_text": "Take an early train to Rome (3hrs) then transfer in the Rome-airport express. (30mins)"}, {"username": "Leanne Dawn Sutton", "comment_text": "Train"}, {"username": "Nils Riedl", "comment_text": "Try trenitalia, it seams like its 2-3 trains every hour. The airportexspress\nis 2 x every hour."}, {"username": "Jana Lynn Longo", "comment_text": "Take the train from Santa Maria Novella station in Florence to the Fiumicino station at the airport in Rome. Example....Fire\nnze Santa Maria NovellaFiumicin\no Aeroporto (FCO)\nThu, Aug 10 · 07:05 – 09:22\n2h 17m · Direct\n1 adult\nUS$42.80"}, {"username": "Robin Barbera", "comment_text": "TRAIN"}, {"username": "Lisa DeLeo", "comment_text": "Avoid stress.\nI would take the train the day before.\nNot worth taking a chance if it’s late or suddenly not running.\n\nOr… for fun, I’d rent a car the day before and drive so u can take ur time and get to see more things…"}, {"username": "Andrea Blasi Chimo", "comment_text": "High speed Train directly to Rome airport. That’s exactly what we did."}, {"username": "Kathy Dowdell", "comment_text": "Train/driver"}, {"username": "Dorothy Press", "comment_text": "Train or hire a driver. We love how fast the train is."}, {"username": "Tom Duffy", "comment_text": "Train from Florence to Roma Termini...Roma Termini to Airport via Leonardo Express train"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2204400373292374", "text": "Planning a 2 week trip next April, starting in Flying into Venice… Florence… Train down to Salerno to go to Positano to stay and then Rome and fly out.\n\nNeed some guidance on how many days per and also things in Florence (day trips included) as well as Should I stay in Positano and do things from there. If so what as never been to the Amalfi coast?\nThank you🙏", "link": "facebook.com/groups/1373361046396315/permalink/2204400373292374/", "likes": 2, "comments": [{"username": "Elena Eckley", "comment_text": "Ishchia in Almalfi"}, {"username": "Suzanne Shea-Simpson", "comment_text": "We’ve used TripMasters.Com for Europe travel and GetYourGuide.Co\nm for all tours and transportation."}, {"username": "Marc Rosenfeld", "comment_text": "I would stay in Sorrento and do day trips to Positano and amalfi"}, {"username": "Linda Blagden", "comment_text": "Go to Sorento and Pompeii from Positano amazing place. Sorento home of lemoncello😋🥰\nFrom Florence you can get to Sienna, Pisa and San Giminano ( most famous ice cream shop in the old town) nearly 100 flavours including alcoholic 😂\nAll a must if you have time 🥰🥰enjoy"}]}]