[{"id": "2197994373932974", "text": "Wow…incredible! In case this area is in your itinerary, take note. I couldn’t post the video but you can view it on TruthSocial.", "link": "facebook.com/groups/1373361046396315/permalink/2197994373932974/", "likes": 0, "comments": []}, {"id": "2197751897290555", "text": "This was taken late May in Florence already the crowds 😩", "link": "facebook.com/groups/1373361046396315/permalink/2197751897290555/", "likes": 77, "comments": [{"username": "Barbara Coldren", "comment_text": "Things to do in Naples"}, {"username": "Andy Rodal", "comment_text": "Andy Rodal"}, {"username": "Terry Pisano", "comment_text": "OP was simply commenting. It IS crowded in the beautiful picture. She didn't express that she was bothered. Why should she not share that and why would we not want to know that? People are easily offended...."}, {"username": "Larry M Murray", "comment_text": "People make your choices, you don't like heat don't go in the summer; Don't like cold don't go in the winter. if you don't like crowds maybe not go at all. Life is full of personal choices."}, {"username": "Bella Cassandra", "comment_text": "I was there two weeks ago was fine"}, {"username": "Susan Lowry Lamb", "comment_text": "A few years ago I heard that if you're over 50 years old the world population has doubled in your lifetime. It's why everything feels so crowded anymore."}, {"username": "Kelsey McCarty", "comment_text": "One of my fav pics I got of the Duomo :)"}, {"username": "Paulina Nowak", "comment_text": "Just left Florence. Yes it was busy but still amazing. Very busy in the mornings as people were lining up for tickets. It’s not like you can’t pass or walk around."}, {"username": "Miroslav Tobiasek", "comment_text": "Let’s face it. We are the crowd! It is not “we & they”. It is us - tourists who want to see it in person."}, {"username": "Magdalena Kasprzyszyn", "comment_text": "I was there in the middle of February and still people everywhere."}, {"username": "Vera Feeny", "comment_text": "I was there 2 weeks ago. When we left at 8 am there weren't that many people. That's the secret to avoiding crowds in July 🤣"}, {"username": "Pat Dreker Demeraski", "comment_text": "Magnificent!!"}, {"username": "Diane Davis Lawyer", "comment_text": "I hope the crowds are smaller by mid September!"}, {"username": "Erica Verde", "comment_text": "An advice: during summer there's crowd in every touristic place. In other months try to visit a popular place during working days, not in the weekend. You'll see the difference"}]}, {"id": "2197749743957437", "text": "Ein etwas anderer Kurztrip! Freue mich auf das Essen, den Wein 🍷 und die schöne Gegend.", "link": "facebook.com/groups/1373361046396315/permalink/2197749743957437/", "likes": 2, "comments": []}, {"id": "2197733530625725", "text": "Buongiorno🇮🇹 Please, no rude comments, I beg of you! Grazie!\n\nI ditched my family, practicing self care as I need a break from these people🤣. In Rome and have a bit of limited mobility (walk with cane), inआणखी Cafe and just want to wander and go in shops, any other suggestions? I cannot keep up with my military son and daughter in law 20 year olds that except too much of me physically. I literally could sit here and people watch, I'm not cultured, 50 years old, first time leaving country (except Mexico), I am Italian, this reminds me of my grandpa and family who are all long gone❤️. If no suggestions, have a favoloso day everyone (my purse is close to chest, husband was pickpocketed by a gypsy last night, no worries, I am aware!)", "link": "facebook.com/groups/1373361046396315/permalink/2197733530625725/", "likes": 364, "comments": [{"username": "Mary Giorlando", "comment_text": "Enjoy! At your own pace & doing whatever you enjoy."}, {"username": "Andrea Romano", "comment_text": "Do what makes YOU happy. It’s Italy what could be bad? Eat, drink.. people watch."}, {"username": "Shelly Stowell", "comment_text": "I did that in Rome too!!"}, {"username": "Kate Bella", "comment_text": "Take a tour to see the site with a golf cart ."}, {"username": "Linda Papavero Snyder", "comment_text": "Do whatever makes your heart happy, wander around at your own pace & take in all the beauty around you, eat the gelato & enjoy your people watching!!!"}, {"username": "Azmi Danuri", "comment_text": "Italy is best enjoyed piano piano"}, {"username": "Lia Geloso", "comment_text": "Take the golf cart tour"}, {"username": "Lia Geloso", "comment_text": "http://\nmobile.060608.it\n/it/\ncultura-e-svago/\nverde/\ngiardini-ville-e\n-parchi-urbani/\nvilla-borghese-p\narco-di-culture\n.html"}, {"username": "Jennifer Gadaleta", "comment_text": "I love your attitude, go forth and enjoy 😉"}, {"username": "Melissa Miceli Alomia", "comment_text": "Go to Villa Borghese, sit in the shade with a cold drink or gelato & relax"}, {"username": "Katie Hooker Thomas", "comment_text": "Do a golf cart tour!!!"}, {"username": "Vivian Chlarson- Hoffart", "comment_text": "I was in Italy in April, even our Italian family in Verona call them gypsies."}, {"username": "Gina Scialdone Ferris", "comment_text": "You are doing exactly what you should be! Enjoy & savor!"}, {"username": "Laura Tew", "comment_text": "I am sitting at the bottom of the airbnb garden, away from my 21 year old daughter because we are fed up of each other and it's only day 6 ofa 5 week holiday! 😅🤣🤣"}, {"username": "Ileana Collado", "comment_text": "I think jr's great to have group time and solo time ...I believe on Sundays there is the big market by the Trastevere station that is worth a walk through"}, {"username": "Jos Recine", "comment_text": "Go your own ways just meet up for lunch and dinner at a designated place. No better place to spontaneous than in Rome.., good luck"}, {"username": "Ruth Korchinski", "comment_text": "Enjoy your morning.. grab a coffee and a gelato and people watch to your hearts content…. Breathe in the Italian air and just “be”."}, {"username": "Stacey Esposito", "comment_text": "Piazza navonna was beautiful to just people watch. An impromptu magic show in the square. A man pretending to be a statue"}, {"username": "Krystal Apolinaro", "comment_text": "I get it, I think we all need some space at times. Nothing wrong with taking some time for yourself, especially when you are struggling with keeping up.\n\nAlso…my phone was stolen in Rome. It’s now in Algeria, wondering about the people who stole it since you mentioned you know who pick pocketed your husband."}, {"username": "Marie-Louise Harrison", "comment_text": "F"}, {"username": "Maria Strachan", "comment_text": "It's ok to be on vacation and want some alone time. Weather it's sitting in a piazza to people watch and having a coffee or a drink or reading a book or magazine. Or staying back at the hotel for a nap or just doing nothing. Or browsing in the shops in your own. You don't need to apologize or explain to anyone. You need to listen to your body and mind and give it what it needs. Enjoy your time in Italy!"}, {"username": "Suzy Palmer", "comment_text": "It’s your vacation too! Do what you want. Everyone vacations differently."}, {"username": "Linda Kisslinger Daniels-Smith", "comment_text": "Enjoy your day as you see fit!"}, {"username": "Mike Adams", "comment_text": "Sounds like a perfect day.\n\nRelax in a cafe. Live life in the slow lane.\n\nLet the energizer bunnies run around all they want. Tell them to take photos!"}, {"username": "Barbara Gilbert Bianchi", "comment_text": "Do whatever makes you happy. People watching from a cafe in Italy sounds like heaven. Maybe visit churches close by."}, {"username": "Cynthia Tarantino", "comment_text": "Have a wonderful trip"}, {"username": "Joanne Bianco", "comment_text": "I like it"}, {"username": "Cathleen Brown", "comment_text": "Piazza Navona is a great place to sit and people watch"}, {"username": "Gloria Darroch", "comment_text": "Are you able perhaps to take a day or half day tour by car or by bus to see more of the area but without too much effort? Otherwise your plan sounds perfectly reasonable!"}, {"username": "Connie Iacozza Brazzoni", "comment_text": "It happened to me on the bus in Rome. The attempt happened but I stooped hum. He went right into my fanny pack that was close to me. I saw his hand. He got blasted from my husband. When this happens you feel violated. Derogatory or not. It's not a good feeling having this happen to you."}, {"username": "निनावी सहभागी", "comment_text": "Thank you everyone SO MUCH for your input and kind words! Unfortunately, the post was approved after my day was over, but hopefully someone will find all this info helpful! I walked around, went into every shop, talked (as much as I could) with the locals, came back to apartment to nap a bit, then got a haircut at Rockstar Salon, it was amazing! Family came back, and we went to dinner - and by then it had cooled down and was lovely outside. I needed the break. Grazie everyone❤️🇮🇹❤️"}, {"username": "Tracey Knight", "comment_text": "Grab snacks and a cold drink and ride a hop on hop off bus and just don’t get off. Tell them you’ll see them at dinner."}, {"username": "Barbara Bastianini", "comment_text": "There’s no one way to enjoy Rome that’s right for everyone. You know what’s best for you. And truthfully there’s not much better than people watching on a busy piazza, sampling the gelato, tasting the wine, etc. Absorbing the atmosphere is just as important, if not more so, than running yourself ragged to see the “highlights”. Just let Rome seep into your soul & enrich you rather than beat you up!\n\nBuon viaggio!!"}, {"username": "Louise Thaell", "comment_text": "Have a fabulous time doing whatever you like to do"}, {"username": "Elaine Lee", "comment_text": "Enjoy what works for you!"}, {"username": "Lisa Hartert", "comment_text": "In Rome I absolutely loved hanging out at cafes on Piazza Venezia. Even though it is so loud in it’s top notch people watching. There is a\nPolizia/ carabinieri station nearby so you get to see all the action. Enjoy!"}, {"username": "Maxine Cunnyngham", "comment_text": "Enjoy your day! ❤"}, {"username": "Jeanne Hannivig-jones", "comment_text": "La dolce fa niente...the sweetness of doing nothing... just sit back and soak it all in!"}, {"username": "Carol Johnson", "comment_text": "People watching is always the best with a glass of wine I did that a lot in Rome and Florence in May 🥂🍾🥂."}, {"username": "Patti Farrell", "comment_text": "Take the hop on hop off bus"}, {"username": "Christine Sounes", "comment_text": "Google top 10 attractions in Rome and buy ticket for hop on hop off bus. If you feel like getting off fine if not what the heck just go round and round. Also golf cart tour. It’s your holiday just relax and enjoy mosey around"}, {"username": "Debra Cooper", "comment_text": "Nothing wrong with wanting to ditch your family. You need you time! Well done for taking time out for you. Some great suggestions here."}, {"username": "Michelle Harbour Lowry", "comment_text": "I love your post. You do you girl. Just breathe it all in. Sit and people watch if that makes you happy."}, {"username": "Layla Maryam Razavi", "comment_text": "Love this, just sitting in a piazza and people watching is fun. Some ideas:\n\n- trastevere is a fun beautiful neighborhood\n- the cappuccino monks is a cool mausoleum full of old bones\n- the pantheon is a one of a kind historical and architectural gem to go sit inside and admire\n- piazza navona is one of the most singular piazzas and the fountains there far out beat trevi 😉\n\nHave fun!!"}, {"username": "Cathy Halloran", "comment_text": "Golf cart tour! We did it a month ago, it was amazing!"}, {"username": "Linda Zavarella", "comment_text": "Love your post and all the great suggestions!"}, {"username": "Jackie Ames", "comment_text": "I totally understand!! I enjoy being on my own at times as well. Enjoy your trip on your terms 😊"}, {"username": "Debbi Mayfield", "comment_text": "You do you! This is awesome"}, {"username": "Lina Luppino", "comment_text": "Let them do as they please you sit back with a glass of Aperol Spritz and take it all in - after all you are in Italy 🙏🏻🙏🏻🙏🏻"}, {"username": "Angelina John", "comment_text": "Enjoy"}, {"username": "Kylie Rostron O'Connor", "comment_text": "I would love to just sit and people watch in the Center of something\nDrink eat watch enjoy"}, {"username": "Laura Miller Bailey", "comment_text": "I so love and appreciate this post! I’m ditching (home, daily life, etc) myself, and heading out for 2 weeks, alone, in September! I too need a break, and what better place to recharge, people watch, eat gelato, drink 🍷 and immerse myself in your culture. I’m grateful for the ideas shared, as I have some mobility issues too! Leisurely pace, that’s my speed. Grazie! ❤️"}, {"username": "Robin Kronick", "comment_text": "I took my 80 plus year old mother on a tour of Italy; she did what she could but so much of Italy is just being in the moment! She just loved the country and the trip! Mom died 3 years ago and that memory will be with for the rest of my life! Do what you can do and eat gelato, drink wine or eat when you can not !"}, {"username": "Nancy Day", "comment_text": "Perfecta I'm 71 doing our first trip to Italy 21 days with my sister(73) and best friend (71).Plan to do alot but a slower pace ...our own customized trip.Thank you I had the Golf cart\nTour in mind"}, {"username": "Sheridan Collins", "comment_text": "Sounds like you are having the perfect Italian day for you, enjoy"}, {"username": "Jane Perry", "comment_text": "I hope you enjoy your afternoon and alone time. People watching is a lovely pass time and you’ll be surprised and how many smiles you’ll receive."}, {"username": "Carole Welch Lang", "comment_text": "Good for you for not rushing through Rome and just wanting to sit in cafe and be!"}, {"username": "Marg Ryan", "comment_text": "Darling. Sit and remember your family roots. Drink the coffee. Chat to the locals. Listen to their Italian chatter and to the church bells. To me this is so simply rewarding. Anywhere in Italy."}, {"username": "Tracy Foss", "comment_text": "I think you posted before your trip that u were worried take care of yourself try a golf cart tour or ride the hop on hop off bus otherwise nothing wrong with just people watching"}, {"username": "Johnson Johnson", "comment_text": "50 is not old"}, {"username": "Heather Acaley Lozano", "comment_text": "I say, find a great piazza, sit down at a cafe (I know the food isn’t usually as great because they are touristy spots) but grab a drink and an appetizer and people watch. That’s one of my favorite past times! We found a great spot in the shade years ago at Piazza Navona. There was a caricature artist and other vendors in the middle of the plaza and it was great. I also liked wandering around Villa Borghese with it’s surrounding park. Nice level paths and plenty to see. It feels like the Central Park of Rome!"}, {"username": "Effie Laganopoulos Meyer", "comment_text": "You can get on the hop on hop off bus and just ride the entire loop. They tell you what you are seeing etc. I also read that there is a virtual bus. It is a 30 minute ride and as you look out the window you will see what that landmark was like in ancient Rome. That’s what I plan to do when I get there. That and enjoy some good food and drinks."}, {"username": "Larry M Murray", "comment_text": "See the Orange Garden, Rome. Nice for peaceful time. Take a cab if necessary"}, {"username": "Jenny Larsen", "comment_text": "Stop , eat , rest and people watch . We all enjoy things differently"}, {"username": "Ken Lerch", "comment_text": "great post!"}, {"username": "Carrie Du Bois", "comment_text": "Sometimes my husband and I just like to relax in the hotel room with a good book. We consider this part of the way we travel."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "How do you know it was a “gypsy”? It is a derogatory racist label just so you know."}, {"username": "Lisa Jones", "comment_text": "Grab a coffee and do some people watching. Or if you fancy a bit more just take a taxi or one of those hop on, hop off buses"}, {"username": "Jen Alexitch Rachow", "comment_text": "Love that you are taking time for yourself. Do You! Maybe wander to a gelateria and then another🤣🤣 because - gelato!"}, {"username": "Bernadette Di-Filippo", "comment_text": "I like that you ditched them to enjoy some “me time!” Good for you! Hope you get some great advice and enjoy your holiday."}, {"username": "Laurie Denoni", "comment_text": "I need to be by myself to recharge also! Slow wandering and taking time to really use all your senses. I find this calming and I see things I would have not noticed"}, {"username": "Tanaz Mesic", "comment_text": "It’s a great idea to take a break from each other when travelling. Otherwise, too much arguing. My 19 yo broke her leg badly during our first week away and needed surgery. We eventually hired an electric wheelchair for her. She was embarrassed at first but then realised how independent it makes her and how much more she gets to see. Please pm me if you need details of where we hired from. Otherwise, enjoy the cafes and watch Italy go by. 💛"}, {"username": "Keli Mauer Sorrentino", "comment_text": "One of the best parts of visiting another country like Italy is to sit in a cafe and people watch! It’s fine to see sights but some time must be spent slowing down and enjoying the pace of life there!!"}, {"username": "Karen Molinari", "comment_text": "“La dolce vita” has no age limits or cultural sensibilities, you just have to want to love life in the moment. That’s it. I like Janice’s golf cart tour suggestion. You can sit and soak it in. I’m also from an Italian-America\nn family, second generation born in USA. One thing I do know: Italians appreciate the art of a wonderful meal and good conversation. Unleash your inner roving reporter, if you will. If a shop owner speaks English, ask them about themselves and how their business came to be. You’ll probably walk away with an enjoyable anecdote or two, and most people like to feel valued when asked about their lives. Enjoy!"}, {"username": "Martin Arizona", "comment_text": "Enjoy"}, {"username": "Rita Sanza", "comment_text": "Relax and enjoy your holiday"}, {"username": "Kim Kirsten NeeMeglic", "comment_text": "Kim Kirsten NeeMeglic"}, {"username": "Kim Kirsten NeeMeglic", "comment_text": "Kim Kirsten NeeMeglic"}, {"username": "Kim Kirsten NeeMeglic", "comment_text": "Kim Kirsten NeeMeglic"}, {"username": "Kim Kirsten NeeMeglic", "comment_text": "Kim Kirsten NeeMeglic"}, {"username": "Kim Kirsten NeeMeglic", "comment_text": "Kim Kirsten NeeMeglic"}, {"username": "Kim Kirsten NeeMeglic", "comment_text": "Kim Kirsten NeeMeglic"}, {"username": "Kim Kirsten NeeMeglic", "comment_text": "These were great Rome ideas someone just shared!"}, {"username": "Cinzia Wong", "comment_text": "Good for you for ditching them."}, {"username": "Jen Lim", "comment_text": "Jen Lim"}, {"username": "Jen Lim", "comment_text": "I love people watching , too🩷"}, {"username": "Cindy Capozzi", "comment_text": "Love your comments! It's your vacation too and I firmly believe in time apart, even on vacation. I'd get a gelato or cappuccino and sit at the Trevi fountain until they found me. We saw a bride and groom and 2 couples get engaged one night. Magical."}, {"username": "Robin Burrell", "comment_text": "Golf cart tour is a wonderful idea"}, {"username": "Kathy Fryer", "comment_text": "I hope he didn’t lose too much money….so sorry"}, {"username": "Matthew Livio Conti", "comment_text": "“I am Italian” (but has never been to Italy. 😂)"}, {"username": "Becky Harless Coovert", "comment_text": "Vacation can meaning different things to people\nEnjoy people watching! I love it, and just watching the Italian Way! ❤️"}, {"username": "Maxine Righi", "comment_text": "Just enjoy... Go to piazza di spagna and sit on the steps and take it all in"}, {"username": "Nancy Grassa Rogers", "comment_text": "What you are doing sounds perfect!"}, {"username": "Robin Barbera", "comment_text": "Traveling solo is the best"}, {"username": "Tom Cannon-Bailey", "comment_text": "Do what makes you happy. I would guess you probably are paying for some of your adult child’s trip and all the fun…. Time for parent time. Enjoy!!"}, {"username": "Evy Fredy", "comment_text": "Enjoy yourself doing what makes you happy and not what makes them happy ! You’re in a beautiful place, have a gelato and enjoy your time to yourself fully🌸🌸"}, {"username": "Michelle Prendergast-Jernigan", "comment_text": "Enjoy"}, {"username": "Sandy Abplanalp", "comment_text": "You don’t have to do everything together. My husband and I travel often and I can do more so I do and alone or with others. Everyone has to do what they enjoy then get together and share your experiences at the end of the day."}, {"username": "Nydia Bryan", "comment_text": "Good for you. Just because you travelled together doesn’t mean you have to stay together the entire time. Like someone else suggested do a golf/Vespa/\nfiat tour on your own. Less moving on these tours and less pressure feeling like you’re holding them back plus you see all the sites."}, {"username": "Diane Vertin", "comment_text": "Ignore the rude comments. Some people ate just ignorant! Enjoy the beauty, the memories, the smells, the food, the wine! Stay ever present! Enjoy La Dolce Vita. I, too, am of Italian Heritage! Enjoy every minute of it! It’s in your DNA!!!!"}, {"username": "Lauran Cantwell", "comment_text": "We took a family vacation once. A good time was had by all for 3 days.....unfort\nunately it was a 7 day vacation!!! 😂🤷‍♀️\nYou do you. I too have mobility and health issues and just can't keep up. I do what I can and then just go off by myself, same as you have just done. I could people watch and soak it all in all day.\nMy 2 absolute favorite memories of Italy are sitting in a little outside high above Taormina and sitting feeding the pigeons in St Peter's Square. Both times my tour was simply too much for me so I found a spot to sit, recharge and joined up later. You do what you need to do."}, {"username": "Marianne Hendriks", "comment_text": "I’m so sorry to read this! Just go into a local bar, sit down, be angry, cry, be yourself. Try to explain how you feel with head hands and feet. You will manage. You are in one of the best countries in the world. Ask them to see the city! Don’t come back to your hotel! live!!"}, {"username": "Thalina DeMarco", "comment_text": "Enjoy! Let them know that you prefer these moments to take things in. Everything is so beautiful.\nI don’t like yo carry any items, like a purse. I keep everything on my body. I wear purse type belt."}, {"username": "Martin Rudolph", "comment_text": "Rome is an open air museum. If you like to wander, fill your boots. Eat Gelato,grab. A slice or two of pizza, sit at a Cafe and people watch. La dolce vita."}, {"username": "Romina Lauretig Toscano", "comment_text": "Where do you stay if I am not indiscrete?"}, {"username": "Debbie Vitale", "comment_text": "Just let them know you're ok & you'll meet back up with them later. I 100% understand the need to slow down!"}, {"username": "Lisa Minichini-Dowty", "comment_text": "Enjoy!"}, {"username": "Bob Sullivan", "comment_text": "Peoplewatching (and listening) is always great. Love hearing languages from around the world. And if you're a chatter, strike up a conversation with someone sitting nearby if they have what looks like an interesting drink or nibble. If a local, they might have some great suggestions."}, {"username": "Suzanne Nye", "comment_text": "I got back from Italy a couple weeks ago. I am 75 years old and traveled on a tour with my 18-year-old grandson. It was his ￼ high school graduation present. Obviously, I could not keep up with him or sometimes the rest of the group. I booked a golf cart tour for myself and it was wonderful. I got to see the sights and not have to fight the cobblestone streets, the steps, and the crowds. I spent a lot of time eating gelato, drinking coffee and eating pizza. I enjoyed watching people in the café and sitting quietly. Have fun and try to stay cool."}, {"username": "Amy Corday", "comment_text": "Golf cart tour—the best!!"}, {"username": "Fiona Loughlin", "comment_text": "I hear ya sister...curren\ntly wearing compression socks and havent been a shop yet lol"}, {"username": "Sharon McMahon", "comment_text": "I enjoy my own company also. Even when traveling with family who I love"}, {"username": "Shelley Howard", "comment_text": "Jump on the hop on bus and people watch from there .. u can stay on as long as u wish..."}, {"username": "Brooke Nealley", "comment_text": "Not sure where in Rome you are/are staying, but I highly recommend Forno Monteforte. They have delicious pastries, coffee and pizza by the slice that they heat up for you. It was heavenly! We went back twice. Try a maritozzo con panna. I dream of having this again often! I’ll share a pic. ☺️\n\nForno Monteforte Address:\nVia del Pellegrino, 129\n\nOr if you’re near - this gelato:\n\nGelateria La Romana\n\nAddress:\nVia Venti Settembre, 60\n\nBest gelato I’ve tried in Rome!\n\nDa Francesco was my favorite pasta!"}, {"username": "Melanie Noble", "comment_text": "It’s a vacation and you’re supposed to do exactly what you want to do! Find yourself a good spot and just do some people watching if that’s what makes you happy no shame in that, enjoy."}, {"username": "Sally Sprinkle", "comment_text": "Honestly, it’s probably too hot to do much else than sit and drink some thing Delicious, enjoy a gelato and people watch."}, {"username": "Liz Cooper", "comment_text": "I like to do just what you’re doing here! So much that is fascinating walks by me whenever I sit in a Roman cafe!"}, {"username": "Judy Grayson", "comment_text": "Enjoy Italy on your time schedule... soak in the culture, enjoy the food, wine and people... talk to strangers and make new friends... good luck and happy travels..."}, {"username": "Brenda Barrett Dunphy", "comment_text": "Never apologise for me time. It's so healthy to look after yourself 🌹"}, {"username": "Gail Bielskis", "comment_text": "sit & enjoy\ngood for you"}]}, {"id": "2197729630626115", "text": "Streetart lovers in Rome, in the garden Parco Caduti 19 Luglio 1943 in San Lorenzo (behind Termini Stations) you can currently visit this open-air exhibition related to the bombings in Rome in 1943.\nThere areआणखी also more big murals and streeart in general in the neighbourhood (and lots of graffiti, which might make it look dangerous, but it is not)\nThe neighbourhood is not touristy, so restaurants and bars are not tourist traps. I have seen spritz for 3.50 euros, there is a great icecream place also with vegan options and if you are hungry, go to Pizza Alice and ger some pizza slices (my favourite as a vegan is the one with potatoes and the one with spicy eggplabt), all on via Tiburtina across the park.", "link": "facebook.com/groups/1373361046396315/permalink/2197729630626115/", "likes": 5, "comments": []}, {"id": "2197720023960409", "text": "Hi,\nWe are traveling on a Med cruise in January with stops in Genoa, Palermo and Valletta (and Citavecchia) for Rome.\nWe have visited Italy briefly 8 years ago and saw Pisa, Como, and had a day in Rome for the Colleseum.\n\nDoes anyone have ideas for these ports for two 56 year olds and two sons 18 and 20?\n\nWe can e-bike, prepared to do a private tour, and would love to see the Vatican.\n\nAny ideas very much appreciated.\n\nWe are from Australia so not concerned about the cold.", "link": "facebook.com/groups/1373361046396315/permalink/2197720023960409/", "likes": 2, "comments": [{"username": "Janet Jamieson Thomson", "comment_text": "At the port in Valletta there is a fabulous war museum, very interesting and not far to walk"}, {"username": "Paul Distefano", "comment_text": "In Valletta you can walk 10 mins and go up the lift to the centre of our Capital City. Lots of museums, shops and restaurants"}, {"username": "Annie Nelhams", "comment_text": "Genova has an open top bus tour, jump on jump off. It has stops by the ferry stop, the aquarium and the city centre.\nThe old town is a fascinating maze of narrow streets (caruggi) with little squares with places selling local produce: focaccia, pesto and the little chickpea pancakes farinata."}, {"username": "Sam Mah", "comment_text": "Genoa is gorgeous for just wandering around and getting lost in its cobbled streets. You can take (free) funiculars to the highest point to look down on the city. They have an excellent Marine museum (Galata) with quite possibly the most miniature ship/boat displays in the world."}, {"username": "Jennifer Larese Taylor", "comment_text": "Palermo is a great city to walk around. It’s quite easy to walk around the sites. We went to the opera which was quite an experience. The cathedral is quite interesting and the oldest royal residence in Europe in close to it. But shopping and wondering the area of the Quattro canti is also quite buzy and fun"}, {"username": "Helen Ladkin", "comment_text": "Valletta is the most beautiful city, sailing into the port at sunrise is simply spectacular. There is an elevator near the port which takes you to the historical centre, and a wander through the Armoury and the Palace is not to be missed. Loved it.\nYou may strike some rough seas at that time of the year, so it might be a good idea to get some pressure point wrist knitted bracelets. Chemist Warehouse sell them. They worked for me but our last sail in the Mediterranean was in April/ May so only a few wild nights."}]}, {"id": "2197719420627136", "text": "Any Recommendations for great hotels in Venice with views???", "link": "facebook.com/groups/1373361046396315/permalink/2197719420627136/", "likes": 1, "comments": [{"username": "Meredith Williams", "comment_text": "i loved H10 Palazzo Canova!"}, {"username": "Jill Wolder", "comment_text": "Marriott Venice resort."}, {"username": "Jon Hotter", "comment_text": "JW marriott"}, {"username": "Mat PO", "comment_text": "Aman"}, {"username": "Kit Nader", "comment_text": "Depends on budget. Mid priced hotel columbina...you\ncan see bridge of sighs and tower at st marks and roof tops etc .... Nice boutique hotel 4*"}, {"username": "Lynn Francisco Casella", "comment_text": "Cruise ship"}, {"username": "Frances Scannapieco", "comment_text": "Hotel Al Ponte Antico, Venezia. On the Grand Canal. Fabulous views and veranda. Perfect hotel"}, {"username": "Michael Galan", "comment_text": "Hilton Molina Stuckey"}, {"username": "Debbie DiOssi", "comment_text": "Ca Segredo"}]}, {"id": "2197355247330220", "text": "San Gimignano💙💙💙\n\nCiao🤚", "link": "facebook.com/groups/1373361046396315/permalink/2197355247330220/", "likes": 175, "comments": [{"username": "Debbie Bodette", "comment_text": "Love this place!!"}, {"username": "Mary Jane Fiorante Mangino", "comment_text": "Loved it there. Even on a rainy day!"}, {"username": "Gregory Hawkins", "comment_text": "A spectacular place!"}, {"username": "Debbie Campbell Mullen", "comment_text": "Ciao🇮🇹"}, {"username": "Angie Zeyfang", "comment_text": "Angie Zeyfang"}, {"username": "Darryl Rasch", "comment_text": "Ciao😎"}, {"username": "Marti Campbell", "comment_text": "❤️❤️"}, {"username": "Candy Mattiello", "comment_text": "Love, Love, Love San Gimignano! Just the cutest little town…"}, {"username": "Lee-ann Betts - Elbe", "comment_text": "Had coffee at that cafe May this yr. 💜. One of the Amazing villages in Tuscany. 💋💋"}, {"username": "Karl Cvelbar", "comment_text": "One of the best places in Italy."}, {"username": "Pierre Côté", "comment_text": "What’s your favorite restaurant in San Gimignano?"}, {"username": "Enolita Castillo", "comment_text": "Been there.. love beautiful San Gimignano"}, {"username": "Cynthia Soliz Solorzano", "comment_text": "Blessed to have visited this gem of a place! Hope to be back one day!"}, {"username": "Gram Jane", "comment_text": "What a wonderful town. People were so friendly but that goes for all over Italy"}, {"username": "Gram Jane", "comment_text": "Eat where the locals eat. You cannot go wrong"}, {"username": "Gregory Hawkins", "comment_text": "I would visit this amazing Medieval town for the gelato alone!"}, {"username": "Sandra Kent", "comment_text": "Amazing was there last year"}, {"username": "Sandi Reynolds Manion", "comment_text": "Got to see the filming of Tea with Mussolini here. Cher arrived on set and Lily Tomlin and Judy Dench were already there. Great day!"}, {"username": "Chris Edwards", "comment_text": "Sonia Piccoli"}, {"username": "Lela Kosaric", "comment_text": "I am buyast ,Italy is my favorite country 👋🤩"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2197355233996888", "text": "Hello. This group is very helpful. I am planning our first trip to Italy. I recently discovered the Withlocals app and would like to know if others have had good or bad experiences with it. Also any tips for visiting Italy in December?\nMany TIA!", "link": "facebook.com/groups/1373361046396315/permalink/2197355233996888/", "likes": 0, "comments": []}, {"id": "2197213127344432", "text": "Taking a poll here: I'm a little miffed!\nIs it reasonable to require guests to take out their own trash in apartments rentals in Venice?\nTo make matters complicated, you have to go down several blocks to meet a barge between specific times for different types of garbage, recyclables & cardboard. Each type of trash is at a different pickup location on different days.\nLet’s face it: who really wants to worry about taking out the trash while on vacation? Especially when you are paying $250/night for your apartment rental.\n\n*** UPDATE: We were messaged the trash schedule late ON check in day, for a 3 night stay. All we have is 4 glass soda bottles, 4 metal cans and about 6 plastic bottles and a pizza box. We haven't been cooking in the apartment either. There's a small trash bag without any organic mater. I just find it exorbitant as a request. We are very conscientious guests, I even strip the beds & wipe down counters with my Lysol travel wipes upon departure. I wasn't expecting \"hotel \" service, just walking BLOCKS from our location, to SEPARATE drop off points is alot to ask. ***", "link": "facebook.com/groups/1373361046396315/permalink/2197213127344432/", "likes": 10, "comments": [{"username": "TJ Williams", "comment_text": "Stop complaining"}, {"username": "Cecilia Christine Costantini", "comment_text": "It might happen in some towns where they have specific pickup time and pickup days for the different types of trash, as it would pile up in the house and the owner would have no way to store it before throwing it out (before the next guests arrived), as it is collected according to a specific calendar and there are no big bins in the street. We experienced the same in Spoleto/Umbria."}, {"username": "Phyllis Snyder", "comment_text": "Realistic for apartment rental- much different from a hotel with a cleaning crew."}, {"username": "Colleen Dawson", "comment_text": "Another option is to spend the extra money and get a hotel instead."}, {"username": "Debby Johnson", "comment_text": "Along with no baggage storage on the last day, is why I always do hotels now - its my holiday, don't want the stress"}, {"username": "Debra Colbert Gonzales", "comment_text": "You’re not in a hotel."}, {"username": "Alicia Cox", "comment_text": "Prob not unreasonable but sounds NOT easy, so not sure it’s worth it 🤷🏻‍♀️"}, {"username": "Susan Palmer", "comment_text": "Yup. We have always had to do the trash “thing” when staying in AirBnB’s throughout Italy.\nAnd yes, trash in Italy is complicated."}, {"username": "Hen Garrett", "comment_text": "We’ve had a 10 minute walk to the nearest public bins in rural France before now. Curbside collection isn’t always a thing in some European countries and I imagine in Venice it’s a logistical nightmare. Part of renting an Airbnb is experiencing somewhere like a local."}, {"username": "Paula Brink", "comment_text": "Every VRBO we ever stayed at in Hawaii required this. I don’t use Airbnb but have read lots of things online indicating this is a requirement there too.\nWe rented an apartment from an owner in Puglia ( private not through an agency) and yes it was a requirement too plus the apt had different bins for separating the recycling from the trash inside and then different bins to put outside at night on a schedule for pickup- no different to what we do at home. I would not expect anyone else to deal with my garbage in an apt rental. In Venice everything is a bit more complicated because of the access by water only. Think of it as an interesting way to learn about a different way of life. People are always going on about wanting to live like a local, well this is part of it.🤷‍♀️\nIf taking out the trash bothers you then maybe hotels are a better option."}, {"username": "Wendy Harrison", "comment_text": "Next time, book a hotel."}, {"username": "Carol Taylor Tisdale", "comment_text": "For an apartment or condo or house.... yes, that's the type of accommodation you are renting and I have never questioned our needing to dispose of trash that we accumulate. However, we have never had to go to the lengths you just described. We've rented 3 apartments in Venice and each one had trash receptacles on the first floor of the building so it was not difficult or out of the way to dispose. AirBnB properties don't operate like hotels. Pros and cons. We have to decide which ammenties are most important to us."}, {"username": "Dawn Darling", "comment_text": "The things people complain about oh my goodness."}, {"username": "Simone Pfenninger", "comment_text": "No, if you are renting a flat, you are paying for the cleaning at the end of your stay which includes getting rid of the trash"}, {"username": "Annette Tamminga", "comment_text": "If you want someone to take out your trash in an apartment or home rental then you have to hire someone to do so. Sounds like you were expecting a hotel."}, {"username": "Dawn Wall Burke", "comment_text": "Yes, completely reasonable."}, {"username": "Dave Colleen", "comment_text": "If it was me, I wouldn’t want to deal with trash schedules so I’d opt for a hotel."}, {"username": "Debbie Vitale", "comment_text": "I would take the trash as requested but anything else, like recycling, at the end of the time there"}, {"username": "Ricardo Guzman", "comment_text": "Sounds fun and you’ll feel like a local. Next time stay in a hotel."}, {"username": "Kathy Whiting", "comment_text": "Always do it and think very reasonable expectation."}, {"username": "Bella Cassandra", "comment_text": "It depends where you are staying. I have always been able to set the different trashes out at night as scheduled for pick up the next day. However I suppose if your staying somewhere away from the trash route you may have to have escort the trash at certain times. I would not want to do that."}, {"username": "Joëlle Manceau-Williams", "comment_text": "I am an Airbnb host and also traveled a lot staying at airbnbs or other rentals. I ask my guests to take the trash out, however it’s right now the stairs and can be anytime. When we stayed in Paris we also had to take the trash out ourselves. I don’t see anything wrong with it. My mom lives in Italy and her town is very strict with recycling and there’s a different type of trash pick up each day. We put it out the night before or on our way out early morning. Minimal effort, and I couldn’t imagine a host keeping up with it for you. It’s minimal when you’re renting an apartment or house."}, {"username": "Robýn Kretsçhmər Schuchårdt", "comment_text": "I would be horrified to make someone else take out my trash!! Clean up after yourself!"}, {"username": "Doug Burke", "comment_text": "We own a beachfront condo in the States and our renters have to take out their trash. Granted it's not as complicated (dumpster is on the property) but they still have to remove it from the unit as needed."}, {"username": "Cheryl Rockhold Rader", "comment_text": "At first I thought “ of course! That’s always expected “. But when I read the requirements I thought it was excessive for a tourist. But if you are there more than a day or two I can see it would be necessary"}, {"username": "Hal Shaw", "comment_text": "What do you need to do is put all the trash in a box and gift wrap it and leave it outside. Someone is bound to steal it. Then you’re free of it. 😊"}, {"username": "Cinzia Wong", "comment_text": "Not reasonable but requested"}, {"username": "Laura Uribe", "comment_text": "We had to do the same thing in Venice. Luckily we were close to the barge."}, {"username": "Jenny Larsen", "comment_text": "Yes their rubbish system is very complicated and different to ours in australia but there go ."}, {"username": "Jerry Kiger", "comment_text": "Apartment prob has limited ability to hold trash and tight space with other apartments prob in a complex. This prob same for the other tenants and just way of life … sure does suck paying $250 and in the heat looking for trash dumb area"}, {"username": "Marcie Huckaby", "comment_text": "Do you pay for a daily cleaning service? Do you want to set it outside the door and have someone come pick it up? How long is your rental?"}, {"username": "Oldriska Balouskova", "comment_text": "At least you can now truly feel like a local"}, {"username": "Pao Magnoler", "comment_text": "Yes, sometimes they require to do so. I was required when I went ti Lake Como. Is no that big if a deal."}, {"username": "Kim Geary Keidel", "comment_text": "I’ve always been required to take out the trash at every VRBO I’ve rented. (Now, your scenario is more complicated having to go at specific times. I would not want to plan my day on vacation around the trash.)"}, {"username": "Nicole D'Amico", "comment_text": "If you are renting an apartment then I would think you would be responsible for taking out the trash. The owner isn't there so he obviously can't do it, so you would just let it pile up while you are there? I'm super confused. If you don't want to do basic household stuff like take out the trash or wash dishes (if you are staying in a place that has a kitchen and you use it) then just stay in a hotel where they do all that for you."}, {"username": "Loretta Spahmer", "comment_text": "This is beyond “taking out the trash”. I would not be happy- was it in The rules or listing before you booked or did you get hit with this rule or requirement after checkin? It makes a difference if you knew in advance.\nI’m a host of 4 US properties and my guests are not required to take out the trash."}, {"username": "Gregory Smith", "comment_text": "Venice is tricky b/c there are unique requirements in terms of which days trash gets picked up and where. It was clearly spelled out in the ABnB we rented a few years back. Agree about the headache with taking out trash on vacation, OTOH the solution is to stay in a hotel. Unlike most cities Venice of course doesn't have a bunch of dumpster. Island living <shrugs>"}, {"username": "Susan Hulsey Watkins", "comment_text": "Not Italy, but we had to drive our garbage to a community center from a cabin in Colorado on certain days due to bears in the area."}, {"username": "Anita Clayton", "comment_text": "Stay in a hotel if you don't want to dispose of your rubbish unless you pay for a daily cleaning charge."}, {"username": "Delly Tracy", "comment_text": "I only use Airbnb'S and you are required to clean up after yourself. Theres no maid service . If thats what you require then get a hotel"}, {"username": "Pat Xavier", "comment_text": "yes you should..."}, {"username": "Richard Meek", "comment_text": "Living like a local at it's most authentic. 👍"}, {"username": "Karoline Bakker", "comment_text": "Yes that’s normal. It’s your trash"}]}, {"id": "2197352803997131", "text": "Hi,\n\nI’ve seen many post about shopping. 🛍️ Could you share some pictures of the stores you liked? I love shopping and I’d like to add that to my budget, but I have no idea if I would be really interested in the items they sell there. Coming from the US and I have never been to Europe. Thank you in advanced.", "link": "facebook.com/groups/1373361046396315/permalink/2197352803997131/", "likes": 1, "comments": [{"username": "Kay Rendall", "comment_text": "The jewellery can be interesting, they use a lot of semi precious gemstones, which we in Australia do not. So some beautiful chunky jewellery with out being too expensive. Last trip bought beautiful chunky glass bracket with large piece onx hanging from it"}]}, {"id": "2197349827330762", "text": "We have 1030AM tickets for the Vatican, if we go early would they let us in? Just trying to beat the heat.", "link": "facebook.com/groups/1373361046396315/permalink/2197349827330762/", "likes": 0, "comments": [{"username": "Elena Eugeni", "comment_text": "No, they usually tell you to come back later"}, {"username": "Jane Lisa", "comment_text": "No"}, {"username": "Elena Innocenti", "comment_text": "No"}, {"username": "Amerline Lee", "comment_text": "They let me in only 30min earlier."}]}, {"id": "2197347637330981", "text": "Back to Canada from Calabria yesterday. Just had to pop on and thank those that recommended an esim. Saved us about $125CAD for the week…that’s a lot of gelato!! Grazie Mille 🤗", "link": "facebook.com/groups/1373361046396315/permalink/2197347637330981/", "likes": 1, "comments": [{"username": "Carol Lonsdale", "comment_text": "Welcome back folks. 😘"}]}, {"id": "2197262464006165", "text": "We have 1 day in rome prior to our cruise, our flight lands at 745 am.. (flying from ORD) I'm not sure how long it will take considering deplaning, customs and the drive from fco to rome. Thoughts on booking a tour with a start time of 11am?\nLast time we were in Italy, we got a transfer from fco to Civitavecchia, it was an early flight but i dont remember how long it took us to get out of the airport.\nThanks for the input", "link": "facebook.com/groups/1373361046396315/permalink/2197262464006165/", "likes": 0, "comments": [{"username": "Karen Blackmore", "comment_text": "Time to exit the airport is anyone's guess 🔮, depends on too many factors. I wouldn't stress yourself with a booked trip before mid afternoon."}]}, {"id": "2197346057331139", "text": "Is there any rules on being fully vaccinated, needing antigen testing or masks?", "link": "facebook.com/groups/1373361046396315/permalink/2197346057331139/", "likes": 0, "comments": []}, {"id": "2197278947337850", "text": "Has this group noted any hotels in rome within 20-30 minutes walking distance from the major attractions (spanish steps, trevi fountain, colosseum, pantheon, vatican, piazza navona) that have 2 double beds? I am finding it to be like searching for a needle in a haystack!🫣", "link": "facebook.com/groups/1373361046396315/permalink/2197278947337850/", "likes": 4, "comments": [{"username": "Kristina Ruk", "comment_text": "20-30 min from which atractions? Italy is a big country ;)"}, {"username": "Sergio Milone", "comment_text": "Condotti palace. They have family room (2 double bed or 4 single bed). Just behind Spanish steps."}, {"username": "Bambi Harris", "comment_text": "When are you going? a lot is booked up, but our hotel (best western art deco) is walking distance to trevi, villa borghese, spanish steps etc"}, {"username": "Debbie DiOssi", "comment_text": "Hotel Artemide. Includes an amazing breakfast."}, {"username": "Katherine Rogers", "comment_text": "Hotel Smeraldo has family rooms"}, {"username": "Rachael Richardson", "comment_text": "Our booking . Com accommodation had 2 double beds 51 pio borgo - amazing little property near the Vatican"}, {"username": "Marsha Luring", "comment_text": "We just were there in June and stayed at Kolbe Hotel. It was very nice. 15 minute walk to the Colosseum and right next to the Roman Forum. We walked to Trevi Fountain and the Pantheon. Breakfast included."}, {"username": "Lorraine Diven Park", "comment_text": "Sophie Terrace Hotel."}, {"username": "Jean Bennett O'Reilly", "comment_text": "Condotti Hotel. Small boutique hotel near Spanish steps."}, {"username": "Amerline Lee", "comment_text": "Navona ApartHotel. 3 double beds for the family room. Direct bus to all major sites, walking distance within 30 min."}]}, {"id": "2197344387331306", "text": "Has anybody stayed at a monastery in Rome? And was it good? Would you recommend it and which one and how did you reserve it? ￼", "link": "facebook.com/groups/1373361046396315/permalink/2197344387331306/", "likes": 0, "comments": [{"username": "Marva Cogdill Ballentine", "comment_text": "We have a reservation for September, can’t tell if it’s good. We’re hoping it is."}, {"username": "Nancy Stuller", "comment_text": "I stayed at Casa di Santa Brigida back in May."}, {"username": "Brenda Keeter", "comment_text": "monasterystays.\ncom"}]}, {"id": "2197343807331364", "text": "Headed to Rome in a couple weeks, any recommended place to get Ink?", "link": "facebook.com/groups/1373361046396315/permalink/2197343807331364/", "likes": 1, "comments": [{"username": "S Christian Everett", "comment_text": "Squid ink or tats ?"}, {"username": "Mark R Palladino", "comment_text": "Are you bringing a printer with you? 🤣"}, {"username": "Kevin Kappel", "comment_text": "Lol.just a tattoo"}, {"username": "Amanda Lynn", "comment_text": "St. Peter’s Ink; Fabrizio did mine."}, {"username": "Aaliyah Zeck", "comment_text": "Renee Zeck"}, {"username": "Tammy Gutsche", "comment_text": "Wisdomless Tattoo"}]}, {"id": "2197342547331490", "text": "Has anyone gone from St Lucia train station to Hilton Molino Stucky on private water taxi ? Could you tell me the process ? I’ve emailed a water taxi company but I’m a little confused. And I’ve been on this website long enough to know that some people will respond with some snarky comments or tell me to Goggle or to search posts in this group . Well I did search within this group before I posted .", "link": "facebook.com/groups/1373361046396315/permalink/2197342547331490/", "likes": 13, "comments": [{"username": "Susanna Sheard Kuenn", "comment_text": "We did this years ago, we just walked out of the station and hired a private taxi. It was beautiful, he gave a quick tour along the way. On the back to the airport we took the hotel shuttle across to venice and took the water bus....I'm glad we didn't do that when we got there, it was crowded and long because of stops. The taxi was easily triple the cost though"}, {"username": "Patricia Breh", "comment_text": "I typically prefer public transport because of the cost. Looks like you can take the vaporetto (boat bus) to your hotel. There are a couple of options."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "As soon as you walk out the train station the Grand Canal will be right in front of you. There is a vaporetto stop and a station for private water taxis."}, {"username": "Claire Dowson", "comment_text": "You can public transport from right outside the station to right outside your hotel. 4.1 boat would take you."}, {"username": "Karen Riley", "comment_text": "I had a travel agent try to pre arrange a private water taxi for us and the cost was over $400. We arrived at the train station, walked out and paid $60 for a private water taxi that took us straight to our hotel"}, {"username": "Fetchin Gretchen", "comment_text": "The water taxi pier at St Lucia station is located just outside the main entrance to the station. It is a short walk from the train platforms, and there are signs to help you find it. The pier is also wheelchair accessible.\n\nHere are some of the companies that operate water taxis from St Lucia station:\n\n* Alilaguna\n\n* Motoscafivenezi\na\n\n* Venice Water Taxi\n\n* Private Water Taxis\n\nThe prices for water taxis from St Lucia station vary depending on the company and the time of day. However, you can expect to pay around €60 for a taxi to Hilton Molino Stucky.\n\nHere is a table of the companies and their prices:\n\n| Company | Price |\n|---|---|\n| Alilaguna | €50-€60 |\n| Motoscafivenezi\na | €60-€70 |\n| Venice Water Taxi | €60-€80 |\n| Private Water Taxis | €60-€100 |\n\nI hope this helps!"}, {"username": "Casarine Temple", "comment_text": "Thanks everyone who responded , I feel more at ease now that I know what to expect . Y’all are the greatest 💜"}, {"username": "Shelley Howard", "comment_text": "it's like a normal airport but instead of cars it's boats, there are private ones, shared ones or public transportation no need to stress worry or pre book walk out and pick what suits .. if public u can buy tickets there .. don't forget to validate before jumping on ..."}, {"username": "Dave Colleen", "comment_text": "Our hotel arranged for a water taxi for us. See if yours does the same"}, {"username": "Stacey Esposito", "comment_text": "I got out of that station today, walked out and hired a private water taxi right outside the station. 60 euros"}, {"username": "Bernadette Collins", "comment_text": "Just out of the station will be private water taxis. A great way to arrive in Venice."}]}, {"id": "2197342117331533", "text": "Thinking of going to Amalfi Coast in mid to late October. Will enough still be open?", "link": "facebook.com/groups/1373361046396315/permalink/2197342117331533/", "likes": 0, "comments": [{"username": "Alice Francesca", "comment_text": "Yep.best time."}]}, {"id": "2197341533998258", "text": "Wedding anniversary trip. 10 days in Italy. September/October 2024. Exploring mostly through food and wine. Two locations. Options are Tuscany countryside, Liguria, Amalfi and Puglia. Which two would you choose?", "link": "facebook.com/groups/1373361046396315/permalink/2197341533998258/", "likes": 0, "comments": [{"username": "Debbie Davidson Cvijanovich", "comment_text": "Stay North or go South.\n\nNorth: Florence, Cinque Terre (or Camogli, San Fruttuoso and Portofino) and Tuscany\n\nSouth: Amalfi Coast and Puglia.\n\nWe’ve been to Italy 4X…all in October. Best time to travel. We’ve only concentrated in the North. This October, we’re exploring the South."}, {"username": "John Sampson", "comment_text": "I know puglia is great"}]}, {"id": "2197337763998635", "text": "Only in Italy , Citta di Castello.", "link": "facebook.com/groups/1373361046396315/permalink/2197337763998635/", "likes": 1, "comments": []}, {"id": "2177237569341988", "text": "CAR RENTAL IN ITALY\nItaly is an excellent destination to explore by car. It is home to vibrant cities, world-famous landmarks, distinct regions, and natural beauty. Having your own car in Italy gives you the flexibility and freedom to explore outside of Italy’s major cities. You can visit ancient ruins, sample wine at vineyards, stay in agriturismi (working farms), swim in crystal clear water at the beach in Puglia, or road trip through the Dolomite mountains up north. For Cheapest Car Rental Rates have a look here: https://www.discovercars.com/?a_aid=NextStop-Italy\nDRIVER'S LICENSE REQUIREMENTS\nItaly recognises EU drivers licenses.\nDrivers from non-EU countries may use their home country licenses accompanied by an International Driving Permit (IDP) or official translation. You must obtain your IDP in your home country.\nYou must have your drivers license (and IDP, if required) with you at all times.\nRental companies require drivers to be between 25 and 65 years of age, but some companies will allow younger or older drivers, often with a supplementary fee. In some cases, you may rent a car at age 19 or 20, but only a specific type of car (small). Most rental companies require drivers to be at least 21 (again, paying a supplement).\nCar rental agencies in Italy require you to have had your driver’s license for at least one year before the rental.\nAlways check the rental contract terms and conditions for specific age and driver’s license requirements.\nFor Cheapest Car Rental Rates have a look here: https://www.discovercars.com/?a_aid=NextStop-Italy", "link": "facebook.com/groups/1373361046396315/permalink/2177237569341988/", "likes": 15, "comments": [{"username": "Michelle O'Connell", "comment_text": "Steve Mortland we need to renew our IDR"}]}, {"id": "2185834111815667", "text": "Paddle boarding tour from Sorrento to Bagni Regina Giovanna\nThere’s one surefire way to escape the Amalfi Coast’s crowds: get on the water. With this small-group tour, you’ll meet your guide, get acquainted with… आणखी your paddleboard, and head out on the crystal waters toward Punta del Capo. Once arrived, you’ll beach your boards and either head to explore the Roman villa of Pollio Felice—which dates back 2,000 years—go for a swim, or simply enjoy the exquisite, uncrowded views. Read more about Paddle boarding tour from Sorrento to Bagni Regina Giovanna - https://www.viator.com/tours/Sorrento/Paddle-boarding-tour-from-Sorrento-to-Bagni-Regina-Giovanna/d947-284551P1?pid=P00070587&mcid=42383&medium=link&medium_version=selector", "link": "facebook.com/groups/1373361046396315/permalink/2185834111815667/", "likes": 12, "comments": [{"username": "Karen Espinoza", "comment_text": "Wow! Amazing!"}, {"username": "Karrie Doyle", "comment_text": "Amy"}]}, {"id": "2191679791231099", "text": "The Resort Valle dell'Erica is your dream resort in Northern Sardinia, between Santa Teresa Gallura and Palau, facing the enchanting scenery of the islands of the La Maddalena and Corsica Archipelagos. A parkआणखी of 28 hectares surrounded by unspoilt nature and exclusive small white sandy beaches and coves 🥰\nDiscover more: https://www.kqzyfj.com/click-100692842-11552042?url=https%3A%2F%2Fwww.tripadvisor.com%2FHotel_Review-g608922-d623779-Reviews-Resort_Valle_Dell_Erica_Thalasso_Spa-Santa_Teresa_Gallura_Province_of_Olbia_Tempio_Sard.html%23%2Fmedia%2F623779%2F619599724%3Ap%2F%3Falbumid%3D107%26type%3D2%26category%3D107", "link": "facebook.com/groups/1373361046396315/permalink/2191679791231099/", "likes": 1, "comments": [{"username": "Lynne Warshaw Gilman", "comment_text": "Looking for suggestions for outstanding restaurants in Florence and Rome. In Rome we are staying near the Piazza Barberini."}]}, {"id": "2197360120663066", "text": "Venice 🇮🇹🌷", "link": "facebook.com/groups/1373361046396315/permalink/2197360120663066/", "likes": 2743, "comments": [{"username": "Katherine AliNuñez", "comment_text": "Spectacular!"}, {"username": "Tori Burdon", "comment_text": "Kathy Friel😍😍😍"}, {"username": "Teona Cholokava", "comment_text": "Ani Mania"}, {"username": "Lisa Roy Schafer", "comment_text": "Miss this beauty 🇮🇹"}, {"username": "Christina Minghine Stamper", "comment_text": "Meryl Hawley - we need to be here again ❤️😭"}, {"username": "Jarle Henriksen", "comment_text": "Vivi Elena Heggelund"}, {"username": "Stacey Edwards", "comment_text": "Kieran Edwards Cathy Cross Dave Cross not long now!!!"}, {"username": "Andy Rodal", "comment_text": "Andy Rodal"}, {"username": "Kyunghoo Kim", "comment_text": "Love this picture ❤️"}, {"username": "Jorge Lara", "comment_text": "Andale ahí merengues Ana Luisa Medellin Palacios"}, {"username": "Lisa Thomas", "comment_text": "Millie Evans-Thomas 🤍"}, {"username": "Schesly Gedeon Césaire", "comment_text": "Love it! ❤️"}, {"username": "Gino Oechler", "comment_text": "Which canal please ?"}]}, {"id": "2197363323996079", "text": "Is it normal to be asked passport number and expiration to book a boat excursion? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2197363323996079/", "likes": 3, "comments": [{"username": "Mike Ball", "comment_text": "We went on a boat excursion to Elba a few years ago and all we were asked for was a contact number for our hotel in case it was cancelled ."}, {"username": "Amelia Bonannella", "comment_text": "We have booked 3 boat tours during our holiday and 3 ferries. Only the ferry from Naples to Sicily requested passport details"}, {"username": "Tara Roed", "comment_text": "No one asked for them from us"}, {"username": "Roxanne Patti", "comment_text": "How do you post anonymously?"}, {"username": "Danielle Johnston", "comment_text": "Hotels have asked me but not one excursion"}, {"username": "Lynn Crane", "comment_text": "All of mine asked to have it ready in case. Only two asked to see it. Colloseum and Academia. Our boat excursion in Amalfi asked to have it ready but didn't require showing it when we got there."}, {"username": "Mary McIver Gwynne", "comment_text": "I provided those details for the ferry between Naples and Palermo."}, {"username": "Sandra Massengale", "comment_text": "Yes"}]}, {"id": "2197364007329344", "text": "Hello! Next month we are traveling to Italy for 5 nights. We are landing in Venice and getting back from Milan.\nWe have already booked 2 nights in Venice but I don't know where to book the rest. We thought to visit Venice, Verona, Garda and Milan (last night in Milan for sure so it's easier with going to the airport).\nSo we are at a loss where toआणखी book the 2 nights left? Garda? - if so do you have recommendations?\nAlso do you have any recommendations for tours or places not to miss in our short trip? As we are without kids we want to do things more grown-up 😅 like food and wine tours etc", "link": "facebook.com/groups/1373361046396315/permalink/2197364007329344/", "likes": 6, "comments": [{"username": "Pietro Adami", "comment_text": "Sirmione, on Garda lake"}, {"username": "Pietro Adami", "comment_text": "Or Verona, then rent a car and drive to the lake and/or in the Valpolicella area (few kms out of Verona) for wine tasting"}, {"username": "Rhona OConnor", "comment_text": "Don't plan too much. Relax and enjoy one or two places. Travelling between places takes time."}, {"username": "Lisa Abrams Argento", "comment_text": "Verona was very nice so is Bologna."}, {"username": "Enrica Palla", "comment_text": "Sirmione will be good for a two days staying, and not too far from Milan."}, {"username": "Stefano Follador", "comment_text": "If you are planning a wine tasting I suggest you to come to Valdobbiadene. A wonderful place where you can taste the real Prosecco. If you like it my family own a winery and we are happy to receive visitors"}, {"username": "Renae Larcus", "comment_text": "If you go to Garda, stay in Sirmione. Easier to get to and from there you can take the ferry to other towns. Garda is a very long lake and you probably will not get to the Northernmost towns in the time you have, but we really loved Sirmione and the ferry ride."}, {"username": "Alice Francesca", "comment_text": "Stay in Desenzano but use ferries to get around.Lake Garda is wonderful.Start\nfrom Riva del Garda then Malcesine, Isola del Garda, Salo' and Sirmione♡"}, {"username": "Anne-Marie Hallas", "comment_text": "Lake como not far from Milan"}, {"username": "Laura Uribe", "comment_text": "You really need to decide and book immediately. You have left it incredibly late given how packed Italy is the last two years. You’re not going there, but Rome literally is almost out of rooms for the end of October. Don’t wait any longer!! Make those reservations!"}, {"username": "Irene Oda", "comment_text": "Better start looking at booking. You may have to be flexible-:your destinations may depend on availability of rooms."}, {"username": "Sande Ricci", "comment_text": "Spend a little more time in Milan. It's amazing with a lot to see there."}, {"username": "Virgz Van Møøre", "comment_text": "Peschiera, train station on your way, easy to move around, cute and pretty"}, {"username": "Steve Grossman", "comment_text": "Balogna"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Five nights? I would stay three nights in Venice then Milan for the last two nights."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2197365927329152", "text": "We’re on a cruise heading to Florence. We just left Rome and absolutely loved it! I had more time to research what to see there and set up a few tours. I would love to see Michelangelo’s David but I think my teenagers are toured out after room. Anyone have any ideas where we should go? Our excursion is “Florence on your own” so we’ll just be dropped off in Florence to explore on our own. TIA", "link": "facebook.com/groups/1373361046396315/permalink/2197365927329152/", "likes": 2, "comments": [{"username": "Barb Parker Lee", "comment_text": "Make time to see David....so impressive! Kids would like the bridge over the river - lots of shops, music, etc."}, {"username": "Colleen Bradley Dehn", "comment_text": "A golf cart tour would be great -my family with teens enjoyed it"}, {"username": "Margie Williams", "comment_text": "I have found that teens are impressed with The David. You don’t need a tour. Just an hour visit if tickets are available."}, {"username": "Carm Parent", "comment_text": "You can see the replica of statue of Davide for free in Florence. Unless your my husband ( the one thing he wanted to see years back). Musuem was closed ( happened to be Monday) and replica was sent away for cleaning restoration lol)"}]}, {"id": "2197373780661700", "text": "Hey all! We have decided to stay in Naples and do local transportation to get to and from the Amalfi Coast to explore.\nCan anyone elaborate further how best to get from Naples to Sorrento-Positano-Amalfi-Ravello?\nDo we take a public ferry from Naples? Train? Bus? Or combo of all 3?\nShould we book these in advance or just line up day of?\nWe canआणखी even split it up to 2 days i.e Sorrento/Positano one day and then Amalfi/Ravello the other day if it is too hard to everything in one day-we would like to relax too. What sounds best to all of you? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2197373780661700/", "likes": 5, "comments": [{"username": "Annie Slater", "comment_text": "We used a tour company called Napoli Official Tours to take us on day trips from Naples to Amalfi and Pompeii. They picked up right from our hotel and had air conditioned mini buses. They had a good selection of tours."}, {"username": "Linda Brecher Bekoff", "comment_text": "Maple has a very large ferry dock which can get you to most of those if not all destinations including the islands Capri, Ischia. There is also a bus and train but much more gritty.\nOnce you get to the lower AC, transport between cities can be ferry or public bus."}, {"username": "Monica Patil", "comment_text": "We are taking a ferry from Naples to Capri, and then ferry to Capri to Positano, hanging out there for a little bit then taking ferry to Amalfi Town (staying the night there) in the morning we are taking the bus to Ravello hanging out there for a while and then taking the stairs down back to Amalfi town. Then heading on the ferry to Sorrento till night time then taking the train/ferry back to Naples. Hope this helps! That’s why we didn’t have to sit in that traffic and get more out of our time there."}, {"username": "Glenn Todd Webb", "comment_text": "https://\nwww.easycartourn\naples.com/\n\nDon’t do Sorrento, Positano, Amalfi , Ravello in 1 day. Just do Amalfi and Ravello. If u have 2 days, I would do Ravello and see Villa Rufolo and Villa Cimbrone one day and Amalfi one day."}]}, {"id": "2197376430661435", "text": "Looking for hotel recommendations on the Almafi Coast with access to the sea. … a descent to the sea really. We love the water and want to be able to swim a lot. But not in Positano ( too crowded ) but near a lively town as budget friendly as possible ( < $450 per night ) thank you !", "link": "facebook.com/groups/1373361046396315/permalink/2197376430661435/", "likes": 0, "comments": []}, {"id": "2197376520661426", "text": "Our tour has a free day in Rome. I would love to hear if any of you have done a cooking class or an e-bike tour. If so, you get extra credit if you provide links!!!! Thanks so much in advance 🙂", "link": "facebook.com/groups/1373361046396315/permalink/2197376520661426/", "likes": 1, "comments": [{"username": "Olga Kevorkova Wilkins", "comment_text": "Following"}]}, {"id": "2197376650661413", "text": "Looking for Florence restaurants august 14-17", "link": "facebook.com/groups/1373361046396315/permalink/2197376650661413/", "likes": 4, "comments": [{"username": "Deanna Williams Flora", "comment_text": "We went once a couple of years ago and going back this August. It is small so get reservations. A truly lovely experience!"}, {"username": "Tiffany Hadfield Merrill", "comment_text": "Tiffany Hadfield Merrill"}, {"username": "Leah Greenspan", "comment_text": "La Giostra! Also try the Fork app- there are some awesome options there."}, {"username": "Lourie Morse", "comment_text": "Zest! Great food and if you sit outside you’ll have a great view of the city."}, {"username": "Gary Fossaceca", "comment_text": "Il Porcepino"}, {"username": "Laura DeCicco", "comment_text": "Bucca Mario, Cinghiale Bianco, Trattoria ZaZa"}, {"username": "John Bruckman", "comment_text": "Marione"}, {"username": "Roe Gallo Saks", "comment_text": "Vasalinga in the Santo Spirito area across the Arno. Worth the walk!"}, {"username": "Caryn Goode", "comment_text": "Buca Lapi for Bisteca Florentine, 4 Leoni, & Antica Trattoria da Tito."}, {"username": "Sam Mouchamel", "comment_text": "Sam Mouchamel"}, {"username": "Nancy Kirby", "comment_text": "Trattoria Anita"}, {"username": "Jeannine Egdorf Phelan", "comment_text": "Jeannine Egdorf Phelan"}]}, {"id": "2197376787328066", "text": "We land in Milan and have five days to explore and we want a couple of days in Florence. Would you recommend longer in Florence than Milan and train or hire car between? We also want to do a mini trip to Pisa. Any advice? Coming from UK and no jet lag etc.", "link": "facebook.com/groups/1373361046396315/permalink/2197376787328066/", "likes": 2, "comments": [{"username": "Kristina Ruk", "comment_text": "Well Florence has more historical places and museums to explore.. just not to miss I recomend buy tickets online prior as in place you have to stay in long que."}, {"username": "Marita Naude", "comment_text": "Florence for me! Beautiful and so much to see and do. Use the train, easy"}, {"username": "Federico Pedroni", "comment_text": "Rent a car and explore Tuscany"}, {"username": "Sam Mah", "comment_text": "Not a lot to see in Milan. Lots to see in Florence."}, {"username": "Connie Wilson", "comment_text": "I would depart by train to Florence upon arrival and spend 3 nights (taking a quick trip to Pisa). Train back to Milan and spend your last night(s) there near the center by the Duomo."}]}, {"id": "2197391400659938", "text": "Best restaurants to eat in Rome and the almafi coast?", "link": "facebook.com/groups/1373361046396315/permalink/2197391400659938/", "likes": 10, "comments": [{"username": "Lorraine Diven Park", "comment_text": "Tonnarello in Trastevere - lovely food wine and atmosphere. Be prepared to queue - but worth it 😍"}, {"username": "Luci Colla", "comment_text": "Taverna sorrentino. In Sorrento. I absolutely love Sorrento and the food at this restaurant was delish! If you go here do the Capri tour as well. Highly recommend. Enjoy 😊"}, {"username": "Flavia Bernardo Ciddio", "comment_text": "In Rome you must go to “la fraschetta di Castel Sant’ Angelo”really really good!!!"}, {"username": "Sandy Hookerman Kriger", "comment_text": "Very hard to get a reservation at the best restaurants in any city right now. Good luck."}, {"username": "Laura DeCicco", "comment_text": "*AMaLfi"}, {"username": "Becky Lewis", "comment_text": "Comodo Mercado Trevi just down from the Trevi Fountain. Walk in front of fountain with it on your left and it's ahead on that street.\n\nVia del Lavatore, 88b, 00187 Roma RM, Italy"}, {"username": "Leah Greenspan", "comment_text": "Taverna Trilussa in Rome, Ristorante da Paolino in Capri and La Sponda in Positano. We went for our honeymoon a few years back!"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Look on Trip Advisor for the restaurants convenient to your hotel and read the reviews. The best ones are small osteria and trattorias away from the main touristy sites."}, {"username": "Alice Francesca", "comment_text": "Been there, love it..and I am Italian!\nhttps://\nwww.letresorelle\npositano.it/"}, {"username": "Andy McCain", "comment_text": "Get away from the tourist areas in Rome. Go to Trastevere across the river. Great food."}, {"username": "Pong Ac Ai", "comment_text": "Trastevere in Rome so many choices and cheaper"}, {"username": "Azte Noah Vineberg Byud", "comment_text": "cucina e cantina"}, {"username": "Tango As", "comment_text": "Of tire rod pasta and pizza go to Ornellis black angus steakhouse…. Best steak I’ve had anywhere"}, {"username": "Donny Fischer", "comment_text": "Another vote for Tonnerello in Rome!"}, {"username": "Meredith Holloway Helbon", "comment_text": "Following"}, {"username": "Sandy Radican Shikaly", "comment_text": "Amalfi Coast??? What town?"}, {"username": "Frank A Colacino", "comment_text": "Anything away from the tourist areas"}, {"username": "Leo Rodriguez", "comment_text": "Felice e Testaccio in Rome. In Capri go to La Grotelle. The most stunning views"}, {"username": "Lizzie Danner Roth", "comment_text": "Hosteria Grappolo D'Oro was delicious!"}, {"username": "Michelle Evans", "comment_text": "Following"}, {"username": "Jennifer Gustafson", "comment_text": "Do the www.EatungEurop\ne.com twilight Trastevere food tour in Rome and in the Amalfi coast go to Agricola Fore Porta beautiful farm to table restaurant."}, {"username": "Ian Beyer", "comment_text": "Sneak up to Agerola/San Lazaro, some neat spots there."}, {"username": "David Baillie", "comment_text": "Explore and take risks. You won't be disappointed and perhaps you'll avoid the lines of tourist lemmings clutching at their high expectations. It's Italy. It's great."}]}, {"id": "2197393757326369", "text": "Cooking class in sorrento or rome???", "link": "facebook.com/groups/1373361046396315/permalink/2197393757326369/", "likes": 0, "comments": [{"username": "Christina Papasso", "comment_text": "We just left Sorrento and had an incredible experience with Villa Ida cooking class. It’s a family run villa, winery and we had a very special time there"}, {"username": "Stephen Henn", "comment_text": "Cooking Classes in Rome with Chef Andrea Consoli. Google it, admin won’t approve post if link included. Our family did this 4-5 hour class and had a great time. Watch the video on his web page to get an idea what the class is like."}, {"username": "Tyler Tinney", "comment_text": "Chez Barone - Sorrento. Highly recommend."}]}, {"id": "2197396057326139", "text": "I’ll be traveling to Italy 🇮🇹 in late September, early October. I’ll need to use my MacBook. Do I need a separate power converter? I have a European converter, but it only has the two prong option. Do I need one specifically for the laptop, and does it need to be three prong?", "link": "facebook.com/groups/1373361046396315/permalink/2197396057326139/", "likes": 0, "comments": [{"username": "Nicki Trueman", "comment_text": "You should be okay but what I’d suggest is getting a good quality worldwide, surge protector travel adaptor. This can help regulate the voltage. I am from NZ and went to the US and used my laptop and completely screwed my battery cause I was using a very cheap adapter."}, {"username": "Sarah Hartley", "comment_text": "When I went and took mine I just used my usual cable and plug (that came with the MacBook), and then a 2-prong adapter plug 🙂"}]}, {"id": "2197396943992717", "text": "First time going to Italy. Any bad experience to avoid when travel by train especially in this peak summer time.suggestion\ns and lesson not be late or find the right train easier\nThank you so much 🙏", "link": "facebook.com/groups/1373361046396315/permalink/2197396943992717/", "likes": 55, "comments": [{"username": "Rachael Richardson", "comment_text": "Watch out for pickpockets a couple next to us in a rush put wallet in backpack - gone in seconds , look for train number and departure time VALIDATE your ticket , speaking to a family from Canada who didn’t - €200 fine for them all"}, {"username": "Deborah Coulter Cusick", "comment_text": "Don’t take offered help, keep walking head forward"}, {"username": "Joy Tallent", "comment_text": "Be sure to get off at the right place!"}, {"username": "Janet Messanelli Bozzone", "comment_text": "Remember to validate if you are on a regional train. Be alert for pickpockets and keep an eye on your luggage. We have never had an issue in the high speed trains we have taken but you could invest in a small cable lock if you are worried about your luggage. Have a wonderful trip!"}, {"username": "Tammy Oehler Liggett", "comment_text": "Jamie Welch Kendra Thompson this stresses me out more than anything!"}, {"username": "Miyuki Kanno Paul", "comment_text": "Never accept any help from anyone unless she/she wears the official uniforms at the train station. Say No grazie firmly"}, {"username": "Alex M Moretti", "comment_text": "Watch out for the Pickpocketing there.\nThey work in groups of two or three people. One is usually the lookout, one is the cover or blocks the view for the one that does the pickpocket/\nstealing."}, {"username": "Gillian O'Callaghan", "comment_text": "Did 13 trips all booked on Trainline, and one return Florence to Pisa where I got tickets at the station. No issues on any trip.\nCheck trip # on board not your destination.\nMake sure you can manage/lift any luggage as some trains have narrow step steps."}, {"username": "Marina Gray", "comment_text": "I’m travelling to Italy in October and had planned on getting around by train\nAfter reading all of these msgs I now have major anxiety lol but good to know all the tips"}, {"username": "Melissa Feielin Hawkins", "comment_text": "Did the trains all over Italy this month. Was challenging getting to lake Como and back. Workers had us going to wrong tracks wrong stops . Thank goodness for kind people who helped us.\nWe really liked Italo bullet train, did first class in and out of 3 different cities and so glad we did. The private waiting lounges where awesome, as was the train service and cabin space. Much much easier to get to point A then the other trains.\nOnly downfall was train workers randomly go on strike and when that happens trains don’t run. Which ended up costing us $600 to get from Naples to Rome via private car"}, {"username": "Kelly Lutrick Sanford", "comment_text": "Book ahead where you get assigned seats and make sure you validate your ticket each time before you board."}, {"username": "Mike Pedretti", "comment_text": "Travelled a lot in Italy by train, loved every minute of it"}, {"username": "Lisa Gaimaro Sullivan", "comment_text": "I didn’t read the comments, but make sure if it’s a train that you have assigned seating, make sure to wait at the right coach number located on the platform. Also allow for extra time. We were going to the Vatican, never expected for there to be a long line just to buy tickets and that the first train would be too full to get on so had to force our way onto the next.\nAlso we found out that on the metro in Rome, you can purchase tickets by swiping your credit card at the turnstile."}, {"username": "Nai La", "comment_text": "Is it better to book in advance inter city train ticket ?"}, {"username": "Lucy Lozano", "comment_text": "Travel light!"}, {"username": "Sunny Suzanne Whitsell", "comment_text": "Make friends with the locals. Even if they don’t speak English they can show you how to get off the train. We learned the hard way when they were all laughing at us."}, {"username": "Allison Coltart", "comment_text": "Do not let your bags out of your sight. Not for a minute. Professional thieves. But we love traveling by train! It’s the best. Just got to keep your eyes open! ❤️"}, {"username": "Ruby Kwan", "comment_text": "Watch your luggage by the door very closely if you have larger luggage. A couple had their luggage stolen off the train, and they didn’t even realize it until it was too late. ￼"}, {"username": "An Nie", "comment_text": "It’s beautiful. All of the places, people and experiences will warm your hear. Suggest max 2 days in Rome and then explore. Capris is magical. Have spectacular. time."}, {"username": "Letha Logan-Dardani", "comment_text": "We are planning to travel from Milan to Naples via high speed train in September with luggage.\nDo these stations/ trains give you time to board and load your luggage? Is it safe to store luggage ?"}, {"username": "Suzi Hellmundt", "comment_text": "I spent 5 weeks travelling by train in Italy and really had no problem at all - advice get to the station early at least 20mns; bring some fruit and water with you; look at your train number for platform; bring 1 euro coins for the loo at the station but train toilets were clean and free to use; make sure you sit in your assigned seat. I felt safe and comfortable at all times."}, {"username": "Suzi Hellmundt", "comment_text": "plenty of help around too with train personnel ready to help and police looking insanely elegant in their uniforms were very charming and helpful too"}, {"username": "Frannie Kaplan", "comment_text": "Don't talk to or interact with loiterers or \"gypsies\" even to tell them to leave you alone, or weird catcallers. Literally ignore them like they're not there.\n\nOften the toilets don't work or there's no toilet paper so try to go before.\nSame with ticket machines, try to buy them in advance.\nYou can also buy them from the train inspector but they cost about 7 euros extra on top of the original price."}, {"username": "Terry Schad Filkins", "comment_text": "Randy Filkins Marie Moore FYI"}, {"username": "Rachael Richardson", "comment_text": "I got a flexible bike lock to lock all our luggage together if it was out of sight"}, {"username": "Ryan Micallef", "comment_text": "Keep an eye on your luggage.. if you’re in executive or first class it’s pretty easy to.. also the train stations are always packed cuz they don’t put up which platform you are going to be on until 15-20 mins before the train leaves. Just be vigilante.. don’t trust anyone around you."}, {"username": "Stevie Boombatz", "comment_text": "Use a money belt as there’s many pickpockets"}, {"username": "Jono Roland", "comment_text": "Have plenty of water as aircon sometimes doesn’t work well, and take small to medium sized luggage. 🤓❤️🇮🇹"}, {"username": "Donna Parr", "comment_text": "One thing make sure you validate your tickets 🎫"}, {"username": "Jeanne D'Orazio Curry", "comment_text": "I appreciate everyone’s comments…the good and bad. It is overwhelming though. I fly into Rome and want to take the fast train to Florence. So I have to take transportation to Rome Central? I have decided not to buy a ticket in advance because who knows what time plane will land and imm will be. Do I buy a ticket at Rome airport to Florence? Does that include connecting to train in Rome Central. Knowledge is powerful! Thank you for your help"}, {"username": "Elaine King", "comment_text": "Join forums"}, {"username": "Allison Campbell", "comment_text": "Just got back and caught 5 trains . Don’t take a huge suitcase . Trains are busy even if you have booked a seat and luggage space is sparse or there isn’t any . Also it cost us a fortune in porter fees etc in Positano and Capri as cobble stone streets . Pack light !!"}, {"username": "Cheryl Ann", "comment_text": "Download the apps so you have your tickets on your phone. One phone holds all of the tickets, so when the conductor came by, I just pointed to the five people in my party."}, {"username": "Connie Wilson", "comment_text": "If you are unsure or nervous about train travel, this site explains it all. Be informed, not confused. After your first trip you should be a pro!\n\nhttps://\nwww.seat61.com/\ntrain-travel-in-\nitaly.htm"}, {"username": "Viviane Van Braeckel", "comment_text": "A lot of trains still don’t have\nairco ! Unbearable in the summerheat as windows can only be opened very little."}, {"username": "Anthony McClure", "comment_text": "Watch out for people offering to assist you with storing your luggage, they do not work for the train company and will insist that you pay them for helping you."}, {"username": "Anthony McClure", "comment_text": "Travelling by train in Italy is easy safe and enjoyable. Happy travels."}, {"username": "Diana Wilson", "comment_text": "Just be careful in big cities all.over\nEurope"}, {"username": "Lisa Valdovinos", "comment_text": "They announce the platform you’re on 10 minutes before the train leaves."}, {"username": "Miley Bindzus", "comment_text": "FYI"}, {"username": "Tami Sue", "comment_text": "I like to use my maps to make sure I'm going the right way."}, {"username": "Blanca Gil", "comment_text": "Agree. It’s important to be there early to get your bearings and not look frazzled."}, {"username": "Tremayne Mushayahama", "comment_text": "If you miss your train, curse and shout in your favorite language and take the next one. Not the end of the world.\nGet and read a newspaper to look sophisticated.\nIt's easier to walk outside train to you coach than board on coach 2 to go all the way to coach 10"}, {"username": "Bea Kuckens", "comment_text": "Book ahead, select your seat (I don't like riding backward). Departing platform numbers aren't posted until 20 minutes prior to departure, so be alert and ready to sprint if necessary (we once had the farthest car on the farthest platform - took almost the full 20). Boarding ASAP assures a place for your luggage (keep it minimal, light and in view). Plan ahead if traveling at meal time - not all trains have a bistro car and when they do they are crowded and slow. Easier to grab a sandwich in the station and take it with you. At the risk of being too \"personal\" - use the restroom about 20 minutes before you arrive at your station. Finding one at the station is difficult, time consuming, a line, and with a fee."}, {"username": "Valerie Collanton", "comment_text": "Your ticket will have the train number on it. Look for that on the departure board. As others said you usually only have a few minutes to get to the platform once it is posted. So be ready. Also know the car/carriage (carrozza) number for your seat. It is also printed on your ticket. You will need to be sure you are in the right one. While you can walk through the cars, it won’t be easy to do that with luggage. So best to get on the right one."}, {"username": "Vera Feeny", "comment_text": "If you are using TrenItalia trains, there is an app & you can download your tickets. You can also check the status of trains & know the track # (binario) in advance. Ritardo means delay and most of our trains were on time, but a couple had delays."}, {"username": "Lorene Vallish Phelps", "comment_text": "William Phelps"}, {"username": "Cory Burns", "comment_text": "Has been a lot of delays, maybe travel early to possibly avoid this"}, {"username": "Robin Miller", "comment_text": "Book executive or business seats if possible, totally worth it"}, {"username": "Jessica Asquith Hemphill", "comment_text": "Not enough room for suitcases so get on early. Watch out for planned strikes. Really threw off our first day scrambling for an alternative plan of transportation"}, {"username": "Jeanette Petrie", "comment_text": "Watch out for the gypsies who get on the train and ask for money then get off at the next stop."}, {"username": "Taam Can Ci", "comment_text": "Always keep your eyes on the station display board for your train's platform information until the last moment. Dont go to the platform to wait for the train early. Reserved seat may be occupied by someone if you do not alight at the first started station."}, {"username": "Anne Vincent", "comment_text": "Livia Koloamatangi"}, {"username": "Kim McKissack", "comment_text": "Was a long while back but my Mom's purse straps were cut in the train station. She was smart and didn't carry anything not replaceable in there. Her money, passport etc was in a money belt. Her purse had lipstick, pen, paper, sunscreen. Be aware."}, {"username": "Lester Smith", "comment_text": "Keep bags in your sight, try NOT to sleep on the train."}, {"username": "Dolly Cote", "comment_text": "Don’t go to Rome on a Holiday"}, {"username": "Arina Aquarius", "comment_text": "Take the express train if you are travelling from Naples to Sorrento- it may not be faster but its safer!!"}, {"username": "Udo Stolarczuk", "comment_text": "Watch out for pickpockets. Also the last time I went, a member of our group wasn’t paying attention at the airport and had his very large suitcase stolen."}, {"username": "D Rochelle Milton", "comment_text": "Sy Sandblom great question! If not prepared sounds like it’d be a nightmare 🤦🏾‍♀️"}, {"username": "Sarah Penfold", "comment_text": "Most of the trains we have been on for the last 3 weeks have been great, on time, aircon, no strikes comfortable etc\n\nAlthough we had a bad experience with the train going from Pompeii back to Sorrento, it was a very old run down local train and caught on fire as it was pulling into the station for us to get on….everyone was screaming to get off as the flames were coming a few people were crushed on the platform in the rush and needed medical attention.\n\nThe train line was the only line from Naples to Sorrento and was blocked all day and night in both directions.\n\nThis resulted in thousands of people having to find other ways in and out.\n\nWe luckily got out after about an hour as crowds were growing, we had to pay $270 euro for a driver to get us out.\n\nWhen things are working they are great, but some of these towns become chaos if something happens."}, {"username": "Jenny Penny", "comment_text": "Pack light"}, {"username": "Scott Perry", "comment_text": "If you buy a paper ticket at the station, don’t forget to validate your ticket!"}, {"username": "Krissy DaRusso", "comment_text": "Overpacking!"}, {"username": "Rhona OConnor", "comment_text": "Get there early! Trains are very punctual."}, {"username": "Annie Nelhams", "comment_text": "*Many city stations are huge, get there early to get your bearings and find your route to the platform.\n*Most intercity trains have designated seating; to find where to stand on the platform to locate for your carriage on these long trains, look for the indicator boards overhead on each platform.\n*If you buy physical tickets make sure you validate them in the machines before boarding( a fine if you don’t, there will almost certainly be a ticket inspector on board)\n*If travelling solo on a long journey, consider a luggage lock to secure your bag to the rack, that way, if you need the bathroom you can safely leave your bag.\n*Listen for the “next station” announcements during your journey - often in Italian & English. On local trains, you may not have these announcements, if it’s dark and you’re not sure where you are, follow along using Google maps, that way, you’re ready to alight in plenty of time.\n* Most trains have a couple of steep steps up and down and some are double decker, don’t expect people to help you on and off with your luggage, so consider what you can lift &move.\nGood luck!"}, {"username": "Sandy Hookerman Kriger", "comment_text": "The high speed train stops for five minutes at each stop. You need to get off quickly. The door does not open by itself. You must push the button or you'll miss your stop like I did!"}, {"username": "Maureen Moyson Wright", "comment_text": "It was very easy to navigate and there were people who work there walking around to help:)"}, {"username": "Renee Ligarde Kitsmiller", "comment_text": "I am on a train in Italy right now and the biggest lesson we learned is to make sure you are on the right coach. There were several people on the wrong coach and it was difficult to get to our seats. The first number below is the coach or the number of the actual train car. Luggage space is definitely at a premium."}, {"username": "Giovanni Pianigiani", "comment_text": "Train stations are of 2 kinds: pass-through (most of them, the train will stop, and then continue in the same direction) and \"terminal\" (Milan Roma Napoli Centrale, rails end at the station, trains stop and then continue in the direction where they came from). On the former you typically have to take an underground tunnel to get to the right platform. In smaller stations there might be no elevator which might be annoying if you have big luggage and you are tight on time"}, {"username": "Paul Anderson", "comment_text": "I was in a room on a train with one other passenger. I told him I was going to the bathroom and would be gone for 10 minutes. I left waited a minute then returned to fine him unzipping my suitcase!!!!!"}, {"username": "Mike Adams", "comment_text": "Train s are great. Pack a snack and some water."}, {"username": "Yvonne Lo", "comment_text": "Train trikes tend to happen on Fridays. Maybe avoid travelling intercity on Fridays if you can. 🤷🏻‍♀️"}, {"username": "John Paul Mantey", "comment_text": "Trains were always on time."}, {"username": "Phillip Farquhar", "comment_text": "I recommend booking executive class only 8 seats in the carriage free food& drink you also get the lounges at the stations definitely good value"}, {"username": "Marc Rosenfeld", "comment_text": "Book first class / business class seats!!!"}, {"username": "Frances McDonagh", "comment_text": "They may not give all announcements in English"}, {"username": "Allan Olexa", "comment_text": "When checking the track number screen, look for train number not destination. The termination location is what’s on the board not stops along the way."}, {"username": "Susan Corrigan", "comment_text": "Lightweight bag to make putting up on shelf easier… the trains can be pretty packed."}, {"username": "Jono Roland", "comment_text": "Don’t bring heavy luggage/large suitcases as some trains have smaller baggage racks and won’t be able to accommodate all bag sizes. 🤓"}, {"username": "Claudia Amp", "comment_text": "You only validate paper tickets for REGIONALE trains (local trains with no assigned seats, other tickets for Intercity or Freccia don’t need to be validate cause you automatically reserve a seat when you buy and they are not open tickets compared to the Regionale ones).\n\nCheck train number not destination on the timetable display\n\nGet to your platform 10 mins before or wait close to the platforms (some stations like Roma Termini are huge and some platforms are far, also platform number may not be visible on the display until very last minutes before departure)\n\nDo not drink water from the train bathrooms\n\nDo not leave bags or luggage unattended, do not place bags on empty seats next to you; you get distracted and you’ll lose ur stuff. Use overhead rack and lock up your luggage.\n\nGet close to the train doors a few minutes before you descend from the train.\n\nListen to announcements of the stops, follow the route with Trenitalia app or Google maps if you are unsure of what stops you have before your destination.\n\nCheck coach and seat before you get on the train to avoid having to walk the whole train with your luggage looking for your seat.\n\nDo not leave luggage unattended while at on the platform or anywhere in the train station\n\nFor any doubts always look for the “capotreno”.\n\nRiding trains in Italy is easy."}, {"username": "Phyllis Snyder", "comment_text": "I have not gone yet - but I hear lots of people didn’t validate their paper tickets before boarding and were fined - about $50!"}, {"username": "Maria Al", "comment_text": "Allow time for traffic accidents in the way."}, {"username": "Heather Wise Wheelton", "comment_text": "Pre book and first class as you are guaranteed a seat and they have aircon."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Make sure your valuables are well secured whenever using public transportation.\nValidate paper tickets."}, {"username": "Miley Bindzus", "comment_text": "Thank you so much everyone 🙏 😊"}, {"username": "Jan Hughey", "comment_text": "There was a train strike the day we had tickets. Be mindful you may not get to leave when you want to."}, {"username": "Izzerbizz McNally", "comment_text": "James C. Eslinger"}, {"username": "Ann LaGreca", "comment_text": "Try and stay near the doors so you can get off first, they will be crowded; wear a mask because people will cough and sneeze without covering their mouths. Believe me , it was like that in April! Buon viaggio 🇮🇹🇮🇹"}, {"username": "Elizabeth Brown Atkinson", "comment_text": "Biggest tip is beware of pick pocketing"}]}, {"id": "2197399627325782", "text": "We are driving from Rome to Sorrento. Any good places to stop to eat on the way from Rome to Sorrento, closer to Sorrento ?", "link": "facebook.com/groups/1373361046396315/permalink/2197399627325782/", "likes": 0, "comments": []}, {"id": "2197401780658900", "text": "Going to Rome in late September/early October. Any recommendations for cooking classes while I’m there?\n\nThx in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2197401780658900/", "likes": 2, "comments": [{"username": "Maciej Pilarski", "comment_text": "No"}, {"username": "Joya Nicastro Cherry", "comment_text": "Following 🍝"}, {"username": "Linda Tibbles", "comment_text": "Look on Viator and Get Your Guide sites."}, {"username": "Chloë Sint", "comment_text": "We did a fantastic pasta making class with Pastificio Faini … booked directly."}, {"username": "Romina Lauretig Toscano", "comment_text": "Onedaychef"}, {"username": "Stephen Henn", "comment_text": "Cooking Classes in Rome with Chef Andrea Consoli. Google it, admin won’t approve post if link included. Our family did this 4-5 hour class and had a great time. Watch the video on his web page to get an idea what the class is like."}]}, {"id": "2197400067325738", "text": "Ravello restaurant recommendations for dinner if only staying there one night ?", "link": "facebook.com/groups/1373361046396315/permalink/2197400067325738/", "likes": 1, "comments": [{"username": "Kiran Rao", "comment_text": "Osteria Ravello!"}]}, {"id": "2197400750659003", "text": "Hello everyone ! 💚🤍❤️\nToday is the second anniversary of the end of my wonderful 30-day road trip around the sun-kissed landscapes and the alluring cultural hotspots of Italy 🇮🇹\nEmbarking from Massa-Carrara, in the north-west of Tuscany, and driving my way through the most captivating sceneries that range from cerulean seas to sprawling vineyards, towering mountains, historic cities, and quaint little towns... all I can say is that my heart now beats to the rhythm of \"il Belpaese\". I feel incredibly lucky to have witnessed Italy's triumphant moment at the European Championship right in the heart of the most charming Italian village, Tropea! 😍⚽\nItaly in 30 days – a venture that sounded daunting at first, but was made seamless with a meticulously planned itinerary on Google Maps. My journey led me through UNESCO world heritage sites, awe-inspiring churches, industrious cities, the occasional vineyard, and the myriad hues of Italy's natural beauty. It reaffirmed my belief that Italy indeed is the most beautiful country in the world! 🌍💕\nEach day brought its unique magic, the radiant sunrise over vineyards, the sunset painting the sky with shades of fire against the silhouette of the mountains, the ever-changing landscapes, and the generous hospitality of Italians, everything was a sight to behold.\nI've been thinking: wouldn’t it be great if there was a tool that could help us plan a comprehensive travel itinerary like the one I just completed, but with less effort ? Well, I am flirting with the idea of developing an AI-driven tool/app that could just be a game-changer for travel planning. 🚀💡\nAnd now, I want to hear from you lovely folks. What's your favorite spot in Italy? 🤔 Could you recognize all the places of my video and photos? How do you usually organize your trips? What would be your dream features in a tool that helps plan your travels? 🧳✈️\nDrop your thoughts, suggestions, and of course, any questions you might have about my journey or this intriguing idea in the comments below! Let's share, learn and inspire each other to more amazing adventures.\n\n\nI conclude with a small poem made by the AI about my journey:\n\n\n\"From Tuscan hills, Lucas sets his sight,\nUnder the golden Mediterranean light.\nJourneying through history, culture, and wine,\nExperiencing Italy, life in every line.\nIn this grand voyage, Lucas finds his delight.\"\n\n\nCan't wait to read your stories and suggestions! 🥳\n— Italy मध्ये.", "link": "facebook.com/groups/1373361046396315/permalink/2197400750659003/", "likes": 21, "comments": [{"username": "Mariposa Mariposa", "comment_text": "How cool!!! Love all the photos-what a beauty Italy is. Can’t wait to travel for the first time next year. Interested in the responses you’ll get, thanks for this🇮🇹🤍"}, {"username": "Greg Kopp", "comment_text": "That would be a great app. We all plan such different vacations though. The first Italy trip was a week from Rome>Florence>V\nenice. The second was a month from Lucerne>Lake Como>Cinque Terre>Tuscany (Terricola base/Siena/San Gimignano/Pisa/\nLucca)>Sorrento (base) Amalfi coast/Capri. We've stayed in small and nice hotels and an agrituirismo. There's no way to pick a favorite, and we want to explore new areas next time, so there's the unknown to contend with. I'm not sure how an app could sift the variety and number of places to go within the available time and budget, but it would be welcome. If I could enter time range first, eliminate where we don't want to repeat, identify the type/mix of cities we want based on what we loved in the past and figure out transportation and mapping, all within a budget, that would be a godsend. I guess I'd like for it to offer up various itineraries and a way to modify them. Struggling with all this right now for next year's trip. Loved the pictures that brought back memories!"}, {"username": "Lisa Gonzalez Propri", "comment_text": "Bella Italia!! We are going next month can’t wait!!!"}, {"username": "Gabriel Toncelli", "comment_text": "Mamma mia !! What amazing journey !"}, {"username": "Margi Lifsey Bradway", "comment_text": "Lovely! What was your favorite spot in Tuscany? I am planning my next trip!"}, {"username": "Sue Simmonds", "comment_text": "We will be in Italy for 18 nights in August 2023,self drive, Air bnb, staying away from major tourist destinations...\nAIR BnB, August 2 or 3 night stays\nIsera\nPoppi, Tuscany\nMontesilvano\nMassafra\nCollelongo\nMontepulciano\nMarmirol Region\nSirmione\nSouth Tyrol\n\nPending the other 5 weeks in Voralberg, Austria 🇦🇹\n😁"}, {"username": "Bella Cassandra", "comment_text": "Ha! Love the video I was naming each site as it popped up 💕💕"}, {"username": "Tammy Jo", "comment_text": "Your photos are stunning!!!! ❤❤❤"}]}, {"id": "2197400947325650", "text": "Needs some suggestions.\nI have 4 nights left in my trip in mid August unplanned, it needs to depart from Florence but ends at Milan for the flight home.\n\nI am thinking a relaxing water body where swimming is fun and has good food, as we’d have our fair share of cathedrals, tuscany hills, museums by this point. I am eyeing Lake Como, Naples, Cinque Terre, Italy east coast, but I want this to be the only stop so we don’t need to drag our belongings and the kid too much.\n\nAny favourites?", "link": "facebook.com/groups/1373361046396315/permalink/2197400947325650/", "likes": 4, "comments": [{"username": "Jeff Gentner EA", "comment_text": "Since you are leaving from Milan, I'd choose Lake Como. You can do day trips to Varenna, maybe a day trip towards Switzerland. You should see Milan, too, even though you've done so much already. We spent 6 days in Milan,did day trips but loved Milan, as well."}, {"username": "Robin Burrell", "comment_text": "Santa Margarita, Camogli, Genoa,"}, {"username": "Charleen Siegler Schuss", "comment_text": "Lake Como"}, {"username": "Renae Larcus", "comment_text": "Lake Como, stay in Varenna. One hour train from Milan and you can ferry around the lake to other towns. Or Lake Garda. Stay in Sirmione."}, {"username": "Phyllis Snyder", "comment_text": "Stay away from beach towns as they will be packed- Maybe Bologna west of Florence."}, {"username": "Allison Campbell", "comment_text": "Lake Como - hire a vespa . We stayed in Ballagio and did day trips ."}, {"username": "JeriLynne Clifford", "comment_text": "We loved Rimini! Found it by watching Stanley Tucci. We also loved Modena. Great food and on the way to Milan. We took a cooking class and just chilled. This is where Parmesan, Prosciutto and Balsamic are king. We visited factories of all of them and had a lovely time at a Lambrusco winery."}, {"username": "Irene Oda", "comment_text": "Hopefully you have booked accommodation already."}, {"username": "Jaime Cleek", "comment_text": "Milan to Naples is far"}, {"username": "Judy Aswege Daley", "comment_text": "Lake Como for sure. You won’t be disappointed."}, {"username": "Yvette Pavone", "comment_text": "Lake como, cinque terre is beautiful but A LOT OF MOUNTAIN"}, {"username": "Iliana Zlatareva", "comment_text": "Lake Como, Naples is a different story, you need more than 4 days for Napoli bay."}, {"username": "Simone", "comment_text": "Terme di Saturnia are a beautiful place to visit."}, {"username": "Pamela Simmons Elder", "comment_text": "Love looking at the pictures of it."}]}, {"id": "2197402197325525", "text": "We want to do summer Italy but I keep seeing don't go in July 😱 it's for moms 65th ....helpppp pic to not get lost", "link": "facebook.com/groups/1373361046396315/permalink/2197402197325525/", "likes": 25, "comments": [{"username": "Robin Barbera", "comment_text": "Summer is the busiest time of year and normally it’s just ridiculously crowded. I will go in April and May or September plus August is my most European vacation."}, {"username": "Delia Miscella Wroblewski", "comment_text": "Do not go in July or August! Actually, where do you want to go and what do you want to do? My answer might be different after I know the answer to those two questions."}, {"username": "Bonnie Loftspring", "comment_text": "I’m assuming July 2024, go May before crowds & heat Plus Never put off celebrating, a bit early is Perfect. Then on her real Birthday do the Family Celebration, what could be better?!"}, {"username": "Lauren-Jade Roberts", "comment_text": "It’s fine, for a relaxed pace it’s hot every summer but if you want to race around all the sites it’s hard work in the heat. Definitely book places with pools so you can go chill in the middle of the day"}, {"username": "Alessandro Iannelli", "comment_text": "It's very hot right now. So it depends on you, and on how much you tolerate heat. Personally, I believe the best months to come to italy are between April and October (or possibly also march and November in Sicily), EXCEPT for the two months of July and August. This is just my opinion of course, but if you can come in a different period than this, it's better."}, {"username": "Yvonne Donnellan", "comment_text": "Why not go in July??"}, {"username": "Janet Isaacs Lanza", "comment_text": "We're here now. Never again in July 🥵"}, {"username": "Sandra Shoffner", "comment_text": "Too hot in July. I usually go around 2nd week of June."}, {"username": "Michelle Dima Polokelo Mahumapelo", "comment_text": "I’m here now, it’s too hot. I’ll never come back in July. The heat is unbearable."}, {"username": "Steve Savva", "comment_text": "It is very very hot but if you’re okay with that then why not."}, {"username": "Ashley Martins", "comment_text": "We went middle of June & was fabulous"}, {"username": "Maria Piccolo Stern", "comment_text": "I wouldn’t…"}, {"username": "Rosanna Hardeman", "comment_text": "Go, but realize it’s very hot. Still fun, still incredible, just very hot."}, {"username": "Susanna Sheard Kuenn", "comment_text": "We've 2x Thanksgiving week and it was perfect, weather and no crowds"}, {"username": "Louise Faggioni", "comment_text": "Go on June, heat less oppressive"}, {"username": "Margorie Madrid", "comment_text": "I went in June and I thought it was so hot 🥵 never again during the summer! 😒"}, {"username": "Elaine King", "comment_text": "I'm going next year, originally scheduled for end of July first of Aug 2024, after seeing the heat waves this year and reading the comments about the heat I changed my trip to May, I will turn 70 next year, live in Florida so I'm use to the heat but people said it's way to crowded as well, join FB groups, yes more than one, be a part of the discussions,\nGood luck"}, {"username": "DerricknCatherine Fejarang", "comment_text": "We’ve gone many times… only in June and July. Yes, it’s hot and busy but I don’t have a lot of choice for a 3 week span of time when we can take our kids off school. So June/July it is. We come from a place where we hit 105 degrees at home during the summer anyway. So I can either be at home in the heat or in beautiful Italy for the summer. If you’re used to heat, it wouldn’t be a big deal. Haven’t had problems with crowds either, they don’t bother me much. If you have other date options, go in September. Have a great vacation!"}, {"username": "Katherine Veliz", "comment_text": "July is HOT!!! They don’t like using AC like us in the states."}, {"username": "Jess Ica", "comment_text": "Some people can only go then. Go when you can."}, {"username": "Andresa GB", "comment_text": "Depends where you want to go\nI went last summer\nRome… will never step foot the in summer anymore in my life, during the day it is impossible.\nAmalfi coast and Capri\nWas awesome\nSardinia was awesome.\nFlorence is ok during summer a little better than Rome.\nVenice it was ok also"}, {"username": "Phyllis Snyder", "comment_text": "Look into an area with lakeside- lake como for example. Or look into branches on the Adriatic Sea less crowded or popular with tourists."}, {"username": "Sara Rocco", "comment_text": "Going in September or early June is perfect!"}, {"username": "Alyson Galusha", "comment_text": "I would recommend not coming in July. We are here now and it’s unbearable."}, {"username": "Frank Hunt", "comment_text": "I’ve holidays in summer in Italy 6 or 7 times sure it’s hot, sometime just nice sometimes too hot but it’s great, even for + 70s yrs like me."}, {"username": "Linda Snaring", "comment_text": "We have gone in July a few times and we had a great time! But it was not hot like this year. I think it would be to hot to go with kids in July or August. July might be ok if you did a trip down the Italian coast. You could stay at places on the ocean or places with a pool."}, {"username": "Jekaterina Lastočkina", "comment_text": "We now in Tuscany. And yes it is hot 🥵 we try to go to cities - Florence, Pisa, Rome, but we were able just to spend on sun ~30-40 min. All the time 0,5 l of water and gelato. Out of the cities it is much more easy to breath, but still hot. Today we had piknic in wine yard and it was quit ok in shadow with wind +35 🤭"}, {"username": "Renae Larcus", "comment_text": "Yeah.Don’t go in July. Or August. We have been there the last two Augusts. Hot, crowded. 👎👎"}, {"username": "Michele Baron Vold", "comment_text": "Delay it until September, October. Or go in May."}, {"username": "Renee Rundle Stoneham", "comment_text": "If you go know it will be hot so plan accordingly, place with a pool, beach or lake for a few days etc…\nRome (which is a must in my opinion) gets incredibly hot during summer.\n\nSooo… end of May and early June before summer really ramps up, September.\n\nPersonally I love Europe during the weeks leading up to Christmas! It’s magical with all the markets etc…"}, {"username": "Notarstefano Na Kori", "comment_text": "What is the reason not go in July? Bc of the weather? Because it is crowded? What are your plans? Do you have a specific area you want to go?"}, {"username": "Katerina Zob", "comment_text": "Don't stress. Go in July if you want. 😄 It's just a season and it's hot. Nothing worse than that."}, {"username": "Edoardo Casolo", "comment_text": "July and august are generally hot and crowded"}, {"username": "Gina Johannes", "comment_text": "I am here now and last week was 99 degrees. I would suggest making sure your hotel has a pool so you can take a break in the middle of the day when it is so hot! It was a life saver for us in Florence!"}, {"username": "Levashni Naicker", "comment_text": "August is a lot better and less crowded"}, {"username": "Kristina Ruk", "comment_text": "Why not? Seaside parts are awesome 😉if it is hot you can swim and water is warm enough in medditeranian ;) if it is hot offcourse cities can be harder to explore, but I live in colder country so I like heat in summer🤣🤣"}, {"username": "Karen Baxter", "comment_text": "It’s always unbearably hot and very busy in the cities."}, {"username": "Cassie Roberts", "comment_text": "We just got back. Soooooo hot and crowded"}, {"username": "Robin Coco", "comment_text": "Leaving Italy today. It’s very hot!! And the AC isn’t cool enough to keep you comfortable. Although I loved the trip, I definitely wouldn’t come back in July due to the heat."}, {"username": "Maya Ingram", "comment_text": "Go in the begining of september it was lovely"}, {"username": "Jenny Meffert", "comment_text": "If you need to go in July then you know that heat will be a problem so work around it. Organise trips etc that aren’t to difficult and enjoy the experience."}, {"username": "Jeff Gentner EA", "comment_text": "Go in summer only if that's your only option. Mid September to mid October is the best time. Not as hot. Not as crowded."}]}, {"id": "2197405477325197", "text": "If you had a free day (your birthday) while staying in Rome end of July what would you do? You fly back to NY the next day so keeping that in mind. Day trip somewhere? Stay put in Rome and do something fun? Group of about 10-15 people, kids to adults. Thanks for any suggestions! 🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2197405477325197/", "likes": 0, "comments": [{"username": "Colleen Jennings", "comment_text": "Book a fab restaurant and enjoy a lovely memorable meal!"}, {"username": "Meghan Tan", "comment_text": "Stacy Giammarino Betty, I would go to the Tivoli Gardens. Keep in mind many businesses and restaurants are closed entirely August."}]}, {"id": "2197406843991727", "text": "Can anyone tell me about the town of Baveno on Lake Maggiore as well as visits to Isola Bella & Isola dei Pescatori.\nI would love to hear from some one who has been there.\nIs it worth visiting?", "link": "facebook.com/groups/1373361046396315/permalink/2197406843991727/", "likes": 0, "comments": [{"username": "Susi Menazza", "comment_text": "The islands are just stunning"}]}, {"id": "2197411780657900", "text": "How is bus transportation in Rome? We are not staying central so if we don’t want to walk 30 minutes and instead take the bus is it reliable and safe at night?", "link": "facebook.com/groups/1373361046396315/permalink/2197411780657900/", "likes": 3, "comments": [{"username": "Cecilia Christine Costantini", "comment_text": "It depends on what neighbourhood you are sraying at. Buses are not \"so\" reliable, there aren't too many night buses."}, {"username": "Eric Maurer", "comment_text": "Buses were hit and miss, some times they didn't show up and some times they were so packed you couldn't get another person on. I also recommend buying a pass for however many days you need the bus it might cost a little more but it's worth it to not have to find tickets all the time."}, {"username": "Mike Ball", "comment_text": "Buses are pretty reliable in the city centre but I’m not sure about the outskirts, there is probably a bus service app you could download,\n\nIf you are worried about using buses at night a taxi back to your accommodation would probably be the best and safest option"}, {"username": "Gena Diaco Penland", "comment_text": "We had no issues with the buses! They weren’t always right on time,but usually came within 5 min. Occasionally they were super crowded, but we didn’t find them too bad."}, {"username": "Heather Sechrist", "comment_text": "The bus was great until they shut the street down for a concert!"}, {"username": "Ellen Edmonds-Wilson", "comment_text": "Metro was good. And even had decent air con"}, {"username": "Sigrid Cormier", "comment_text": "Are you close to the subway? Would that work for you? You can google a public transit map of Rome."}, {"username": "Elena Innocenti", "comment_text": "horrible. Traffic, delay, crowded. Good luck."}, {"username": "Traci Raymer", "comment_text": "We used taxis and private drivers. Stayed near the airport. Taxi 50 euro one way private 80-120. We had 6"}, {"username": "Phyllis Snyder", "comment_text": "Where are you staying? I’m going to stay near trastevere- and my arbnb host says #8 tram is close and takes you right to central area."}, {"username": "Debbie DiOssi", "comment_text": "Try the Hop On-Hop Off buses. They go to all the main attractions."}, {"username": "Harris Dee", "comment_text": "Free now great app for taxi service"}]}, {"id": "2197412853991126", "text": "Path of the Gods anyone?\n\nWhat is the best/easiest way to get from Amalfi to the Path of thr Gods?", "link": "facebook.com/groups/1373361046396315/permalink/2197412853991126/", "likes": 1, "comments": [{"username": "Stephen Henn", "comment_text": "We wanted to go to Path of the Gods last October but neglected to get bus tickets ahead of time. Got to the bus station at 9 AM, waited in line for 90 minutes to buy tickets and were then told no more buses were going (sold out?) and if we found a way there no guarantee we’d get a bus back. Be sure to purchase tickets in advance if going by bus."}, {"username": "Robert Atkinson", "comment_text": "We did a private transfer from positano to Bomerano and hiked back to positano. If you are amalfi, will need transport on both ends of the hike"}, {"username": "निनावी सहभागी", "comment_text": "We ended up taking the bus to Bomerano bus stop, hiked the Path of the Gods down to Positano, rented umbrellas and spent the day on the beach and took the ferry back to Amalfi.\n\nIt was glorious!"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2197416057324139", "text": "Family of 8 looking for restaurant recommendations for Florence (end September). No fine dining- just great food and atmosphere and good for larger groups. TIA!!", "link": "facebook.com/groups/1373361046396315/permalink/2197416057324139/", "likes": 0, "comments": [{"username": "Tiffany Hadfield Merrill", "comment_text": "So good, fun atmosphere"}, {"username": "Claudia Amp", "comment_text": "Gozzi (only opened at lunch though) in San Lorenzo; La Casalinga, Mercato Centrale can be a nice option as well."}, {"username": "Claudia Amp", "comment_text": "Santo Bevitore too"}, {"username": "Andrea Parsons Eubanks", "comment_text": "We were a family of 8. We went to ZaZa and loved it. The atmosphere was fun. They had a small room in the back where we sat just us at one big round table. The waiter was great and could barely speak English so he got a big kick out of us trying to speak Italian. All of our food was good!"}, {"username": "Mia Catalano", "comment_text": "Matto Matto"}, {"username": "Gary Fossaceca", "comment_text": "I recommend Il Proscepino!"}, {"username": "Laura DeCicco", "comment_text": "ZAZa or Cinghiale Bianco"}, {"username": "Kathy Whiting", "comment_text": "Without doubt La Fettunata fantastic food very casual and wonderful prices"}]}, {"id": "2197417783990633", "text": "Planning a 12 day trip for next June. It’ll be our first time to Italy. Can you please help me with a must see or do itinerary? I need recommendations on where to fly into and out of and what is feasible in the limited time we have.", "link": "facebook.com/groups/1373361046396315/permalink/2197417783990633/", "likes": 3, "comments": [{"username": "Alana Marie Sult", "comment_text": "A few more details please....comin\ng from and how many is a great start!"}, {"username": "JeriLynne Clifford", "comment_text": "It can be overwhelming for sure but decide what you want to focus on and go from there. We are big food and wine lovers so that tends to be our focus with a few museums sprinkled in. We live in the TX Hill Country so we are drawn to agritismos vs crowds.\nI recommend watching all of Stanley Tuccis shows and maybe Bobby and Giada in Italy and see what excites you.\nSecond thing is fly to a big city like Milan or Rome. Flying into the smaller airports mean you go through another European airport and that can cause some stress. We fly Austin to JFK to Milan."}, {"username": "Becky Lewis", "comment_text": "Tour the Roman Forum. So much history and beautiful views. Streer food tour was really cool as well. Got to see lots of Rome while walking from place to place plus try different foos"}, {"username": "Karen Espinoza", "comment_text": "Everywhere you go is amazing\nChoose your favorites cities\nGoogle the distance between each place\nWatch YouTube videos\n☺️"}]}, {"id": "2197424740656604", "text": "I know these questions have been asked a million times so here is 1 million and 1 times:\nBest or favorite train to take from Milan to La Spezia and I want the upgraded one :) And what app to use\nBest site to order tickets for museums in Florence or any other suggestions for tours or tickets.\nBest rental car company.\nTHANK YOU!!!", "link": "facebook.com/groups/1373361046396315/permalink/2197424740656604/", "likes": 0, "comments": []}, {"id": "2197426227323122", "text": "Why its always raining in garda alot to see bur cannot due to rain 😭??", "link": "facebook.com/groups/1373361046396315/permalink/2197426227323122/", "likes": 0, "comments": []}, {"id": "2197437697321975", "text": "Hello!\nWe are flying into Rome and at the end of our time there, we will be renting a car to drive to Florence, Venice and Ravenna. I have read conflicting opinions about whether we should drive in Italy. Any experiences would be helpful!\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2197437697321975/", "likes": 7, "comments": [{"username": "Alice Francesca", "comment_text": "Train is much easier!"}, {"username": "Kristina Ruk", "comment_text": "It is the same driving as in any other bigger country. For help have navigation on a phone ;)"}, {"username": "Ted Dembowski", "comment_text": "Rome to Florence to Venice are super easy train routes. Not sure about Ravenna."}, {"username": "John Liddi", "comment_text": "Drive. It's not hard. Avoid urban areas and the ZTL zones in smaller towns. Otherwise, it is easy."}, {"username": "Sharon Jones", "comment_text": "Driving is easy enough. Parking is a challenge. But scheduling trains, getting to the station, getting bags on, off again, also a challenge"}, {"username": "Brad Nelsen", "comment_text": "It’s easy but make sure your car has English speaking sat nav!"}, {"username": "Laura Uribe", "comment_text": "It’s not hard as long as you stay outside of large cities and city centers. We always get a car for the areas not serviced by train. Get car when leaving Rome and drop off when you get to Venice. Important to make sure that wherever you’re staying offers a parking solution. The vast majority do not."}, {"username": "Allan Olexa", "comment_text": "Rural driving is easy just watch for speed trap cameras and no vehicle zones. City traffic is chaotic…don’t drive. Parking in cities or destinations is very limited or nonexistent. Unless you’re driving to rural stops, take the wonderful trains."}, {"username": "Annie Nelhams", "comment_text": "Autostrade ( marked in Green) Ok if you’re confident drivers, most have toll booths- the toll lanes marked T are for those vehicles with a toll reader. The one with the hand is cash, others tap card.\nYou will find that Italian/German drivers will come up very close behind and flash if you are going too slowly.\nSpeed limits vary through tunnels and roadworks.\nRural roads easier and often very narrow in the hill towns.\nMake sure you don’t drive into historic centres as there is a heavy fine.\nMake sure you get rental insurance for wheels & tyres and breakdown cover\nBest of luck"}, {"username": "Wade Bailey", "comment_text": "Trains connect city centers. Easy to use."}, {"username": "Carolyn Hassarati", "comment_text": "We have been driving in Rome , Almamfi is fine just drive like the locals and watch out for the motorbikes 😏"}, {"username": "JeriLynne Clifford", "comment_text": "We choose to never rent a car when we are in Italy. We hire drivers if we want to go to wineries. While it might seem expensive if you divide it out by days that you’d rent a car plus the cost of gas, parking, possible tickets to us it’s worth it. There’s no stress or arguing over missed turns. To go between cities there is such a huge amount of trains. If you travel light, I never checked baggage, and never will, it’s not a problem think of all the extra things you can do with the money you are spending on a car"}, {"username": "Charleen Siegler Schuss", "comment_text": "Stay out of the big cities. The folks don't drive, they dance. White lane lanes are decorative. Be bold, when you get cut off it's not personal. Be careful of driving into historic zones. Memorize all the signs. You will leave the country thinking you were successful at not getting a ticket and 4 months later one will appear. There are speed traps and cameras everywhere. You need an International Driver License. Get it at AAA. The Autostrada ( freeways) are wonderful. Stay to the right except when passing.\nDriving is the only way to see the amazing countryside. Good luck\n."}, {"username": "Kelly Hanberg Rosati", "comment_text": "We rented a car out of Paris and drove through France, Italy, and Germany. The highways in Italy are much easier to navigate than here in the states. There are fewer exits and we didn’t experience a ton of traffic. It helps to have the passenger serve as a navigator while driving in cities. Google maps or waze worked great for us and we’d find an underground parking to stay put for the day and walk around or use public transportation.\n\nWe took a week long cruise out of Venice so needed to park the car for a week. We found Terminal Fusina Venezia which cost 52 euros for the week (if you reserve/prepay in advance - we reserved the day before). They have daily parking as well and a ferry shuttle that takes you directly to Venice. The ferry runs every hour to/from Venice and costs about 13 euros round trip for an adult. There was a mixture of day trippers and people like us with suitcases. We bought the ferry tickets at the booth in front of the parking lot. We didn’t have any trouble finding space on the ferry for either direction. Let me know if you have more questions."}, {"username": "Stephen Henn", "comment_text": "Don’t linger in the passing/left lane or you’ll be run over. Italians truly honor the “keep right except to pass” policy. Also, watch your mirrors as motorcycles use the white line to pass between two cars. Depending on when you’re traveling, Amalfi Coast can be challenging due to congestion. Best to have a small car for tight places."}, {"username": "Phyllis Snyder", "comment_text": "If it were me- I’d drive only in the country side not the busy cities. Also small cars are best due to narrow country roads and town streets. Stay cautious of all traffic restrictions as Italy is known for traffic traps and will fine & find you for the $. Get international license as well."}, {"username": "Olga Olga", "comment_text": "Agree, Rome, Florence, Venice and Ravenna it’s kind big city’s- no reason to take a car. Train are fast and you’ll probably be staying in these city’s for few days, so no reason to pay for car that will be staying a parking garage. Plus you will have problems with LEZ or Restricted access zones (it’s big fines)if you unknowingly drive in these areas."}, {"username": "Steve Grossman", "comment_text": "I've driven there on forty one trips. I've driven in South Africa, I've driven in China. Just get on the roads, it's just like driving at home."}, {"username": "Barb Florance", "comment_text": "Thank you for your thoughts!"}, {"username": "Bob Dook", "comment_text": "Driving is not a problem, unlike parking. Be aware of speed limits/cameras and restricted zones. Acquire an International Driving Permit before you go. You'll need insurance, as bumps and scrapes can be costly. I have driven the area you mention, but not recently. Consider not driving and using trains instead."}, {"username": "Jenny Larsen", "comment_text": "I would not drive I would get the train to Orvietto for a few night the most amazing surprise if a town and then to Florence"}, {"username": "Claudia Castellini", "comment_text": "Actually if you don’t want to do other stops, the train would be faster, cheaper and easier.\nIf you decide to go by car, try avoid traveling in the weekends (at least in summer) and be ready to some traffic jam.\nThink also that parking in the historic center of Florence can be difficult and expensive; otherwise traveling by train, you arrive directly in the center of all these cities and if you take an hotel in the center you basically don’t need any other transportation except a taxi when you arrive with your luggages, but you’ll find it very easily."}, {"username": "Frank Hunt", "comment_text": "I’ve driven many times in Italy, took the challenge of Rome twice, no problem. However if you are only traveling between major Cities and towns with a rail link I would not recommend car hire, enjoy the comfort of rail travel using the easy to use Trainline app."}, {"username": "Carol Taylor Tisdale", "comment_text": "Driving through Italy is wonderful!! The only warning i would give is do not drive into big cities: Rome, Florence, Milan. The drive through Tuscany is a dream. ♥️"}, {"username": "Lynn Nelson", "comment_text": "I have driven twice, and never in the cities..I rented a car in Venice and drove to Treviso and the Dolomites and while I was glad I was able to see so much in the mountains, I would not do it again. This year I flew.to Lamezia Terme, stayed in Tropea, and explored the Coast of.the Gods - Costa Degli Dei and I feel the same about that trip.\nDriving is stressful, honestly, and the train system is excellent."}, {"username": "Elena Eckley", "comment_text": "We always rent a 🚘 car. But my husband is used to driving in New York City. We rented from Hertz had an international driver’s license. The autostrada is always easier. The only problem we had was we rented in Rome one time and returned to Malpensa and they said the car had been hit. We had charged the card to AMEX and were able to solve the issue. BON viaggio"}]}, {"id": "2197438587321886", "text": "I have one more hotel to book for our last night in Rome…..recommendations?", "link": "facebook.com/groups/1373361046396315/permalink/2197438587321886/", "likes": 1, "comments": [{"username": "Anna Buchan", "comment_text": "La villa pinciana"}, {"username": "Brad Nelsen", "comment_text": "Try Little Queen Relais"}, {"username": "Joseph Ceci", "comment_text": "Flying out of FCO the next morning? You can’t beat the airport Hilton for convenience."}, {"username": "Lynn Francisco Casella", "comment_text": "Hilton Cavalieri"}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "Parisii luxury Relais! Relaxing, gracious service, stylish decor and the best breakfasts!"}, {"username": "Kim Hudson", "comment_text": "Somewhere with a pool 😊"}, {"username": "Karen Pedersen", "comment_text": "We stayed at the Hotel Isola Sacra Airport 3 nights ago. I would have no problem in recommending it"}, {"username": "Lesley Nesbitt-Blanchard", "comment_text": "Thank you everyone! I found one that had very good reviews and not too pricey . It’s Hotel Smeraldo. 😊"}, {"username": "Kathy Massicotte Talnose", "comment_text": "Hotel michel angelo"}]}, {"id": "2197439223988489", "text": "Hello, we are going to Italy in around 2 weeks and looking for some advice:\n1. We would love to go to Amalfi Coast but don’t know if this possible we are driving any places to go/park? Without it being too busy then we could travel into the main part?\n2. Do we need to book to climb mount Vesuvius?\n3. Can anyone recommend a Pompeii tour?\n4. Must things to do in Milan, Lake como, Florence/Tuscany, Naples, ischia\nThank you!!!", "link": "facebook.com/groups/1373361046396315/permalink/2197439223988489/", "likes": 0, "comments": [{"username": "Immi Walker", "comment_text": "Watch twosome travellers on YouTube! They have the sweetest small video on Tuscany ( they see sienna , san giomano and the hot springs)\n\nIn Tuscany my two top bucket list spots are\n- sunset looking over the man ing curved road\n- saturina hot springs\n\nI’ll comment both below"}, {"username": "Immi Walker", "comment_text": "Immi Walker"}, {"username": "Immi Walker", "comment_text": "Immi Walker"}, {"username": "Stephen Henn", "comment_text": "Parking along the Amalfi Coast will be difficult. If your accommodations are in a village along the coast, I’d leave car there and take public transport or private driver to other villages."}, {"username": "Cindy Mitchell", "comment_text": "We spent a week in Amalfi coast and did not have a car. Between bus system and boats, we could go wherever we wanted and a car would have been a hassle I believe we took buses to Pompeii and Versuvius.\nI recall we took bus from sorrento to Amalfi"}]}, {"id": "2197441453988266", "text": "Thank you all for the help with our trip. 10 wonderful days that we packed full.\nThings we recommend:\n\n-Cool towels. These were life savers during the 100*heat.\n\n-Brita/ Fontanelle free water fountain locator app. We used these a lot!\n\n-TripIt app- made an itinerary for us that we could share with family. So easy!\n\n-Google translate\n\n-WhatsApp- our hotels and B&Bs used this to communicate directly with us.\n\n-Mobile Passport App- we had a super short wait to get back through customs. We even had a 12 year old with us.\n\n-gel pedicures pre- trip\n\n- Bring a washcloth!\n\n-We had no safety concerns- just aware of our surroundings. A Fanny Pack/ crossbody was super helpful. We did carry on only. It was the best/ easiest for us.\n\n-Take the water taxi into Venice.\n\n-Take a food tour of Trastevere.\n\n- 50 Euro will get a family of 4 in a taxi straight to/from your hotel and FCO in Rome.\n\n-Aperol spritz are great any time of day.\n\n-Private external bathrooms can get you a cheaper hotel room- a deal provided no one has to get up at night to pee! 🤣\n\n-Check that temp before using the bidet!\n\nI hope you have as wonderful a trip as we did!", "link": "facebook.com/groups/1373361046396315/permalink/2197441453988266/", "likes": 219, "comments": [{"username": "Melissa Cortez", "comment_text": "Mobile passport control app? Is that the exact name of the app?"}, {"username": "Kim Aranha", "comment_text": "Sounds like a load of very useful information"}, {"username": "Lauren Davidson", "comment_text": "Thank you for sharing!"}, {"username": "Nancy Zakrzewski", "comment_text": "Mobile Passport app… where did you use it? Europe, US, Canada??"}, {"username": "Tricia Brittingham Neff", "comment_text": "Can you share which passport app you used? There are quite a few and I want to make sure I’m using the right one!"}, {"username": "Tricia Brittingham Neff", "comment_text": "Also, water fountain app 🤦🏼‍♀️🤷🏼‍♀️"}, {"username": "Stephanie Fish", "comment_text": "Ty"}, {"username": "Susan Maxwell", "comment_text": "Very helpful! Thanks for sharing!"}, {"username": "Lisa Wylin", "comment_text": "Lovely photos, where is the photo by the water, thanks💕"}, {"username": "Lisa Wylin", "comment_text": "Not Venice, the big water"}, {"username": "Jan Armstrong", "comment_text": "And when those feet get tired, the Uber drivers are wonderful. Worth every penny or should I say, Euro"}, {"username": "Debbie Pagano Dalton", "comment_text": "Can you explain the tripIt app"}, {"username": "Elizabeth Brown Atkinson", "comment_text": "Darrin Kerbs good info"}, {"username": "Eileen Milazzo-Elliott", "comment_text": "Allison Elliott in case there are any tips you hadn’t thought of."}, {"username": "Deanna Scheetz Langer", "comment_text": "Loved the bidet tip! 😂"}, {"username": "Jan Buess", "comment_text": "Funny and useful!!!"}, {"username": "Flor Torres", "comment_text": "Edee Brownell Alma Chang"}, {"username": "Sami Golling", "comment_text": "Did the Tripit app cost money? Also what app did u use to find the water"}, {"username": "Kadie Mcgugan", "comment_text": "Cameron Holliday"}, {"username": "Terri Bazinet", "comment_text": "Free water fountain locator app? Name?"}, {"username": "Lyn Bee", "comment_text": "Some great tips and apps there !"}, {"username": "Cindy Vennare", "comment_text": "Yes! Washcloths!!!"}, {"username": "Nancy Curmi", "comment_text": "Ali Sha"}, {"username": "Carol Hayes", "comment_text": "Could u take a pic of the mobile passport app u used bc there are a few to choose from? Thank you for all of the info."}, {"username": "Jessica Swayze Bennett", "comment_text": "Stephanie Sullivan Rogers"}, {"username": "Chris Tobnick", "comment_text": "Chris Tobnick"}, {"username": "Angela Cistolo Tomko", "comment_text": "I regret not taking a gondola when I was in Venice years ago. I was told it was not worth it. Hope to get back to take one."}]}, {"id": "2197442583988153", "text": "I need recommendations for a beautiful Venice hotel on a Canal in a convenient area. I’m not looking for cheap but I don’t want crazy Expensive. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2197442583988153/", "likes": 207, "comments": [{"username": "Debbie Kaye", "comment_text": "Carnival Palace"}, {"username": "Ruth Oestereich", "comment_text": "Following"}, {"username": "Phyllis Waring", "comment_text": "Carlton Hotel. Near the train station on the Grand Canal!! Reasonable prices..quality\nservice..excell\nent breakfast\nAsk for a balcony room overlooking the canal!!"}, {"username": "Badges Rodriguez", "comment_text": "Venice venice hotel"}, {"username": "Barry Rotenberg", "comment_text": "Hotel Rialto at the bridge."}, {"username": "Karen Toms", "comment_text": "Hotel Ala is a great hotel. Easy to get to, only 2 bridges from Piazza San Marco, great breakfast, and is on a Gondola route (ask for a canal room)"}, {"username": "Deborah Wilson Melton", "comment_text": "Great suggestions"}, {"username": "Christine Guthrie Martimbeau", "comment_text": "Views on Venice has the BEST houses- this is a picture from the living room of the house we rented two weeks ago"}, {"username": "Jesy Rose", "comment_text": "Does anyone have recs on hotels under $300USD/night?"}, {"username": "Melissa Mercuri", "comment_text": "We just stayed at hotel columbina and it was amazing!!"}, {"username": "Cathie Johnson", "comment_text": "Palazzo Barocci - Right on the Grand Canal. Close to everything. Get a room overlooking the canal."}, {"username": "Kath Spinks", "comment_text": "All these beautiful photos are making me want to book a city break . Anyone visited end of January?"}, {"username": "Jennifer Melka Maley", "comment_text": "A friend just loves Locanda Vivaldi but I haven’t stayed here personally… Ck it out."}, {"username": "Jennifer Melka Maley", "comment_text": "Following"}, {"username": "Shelly Torrano", "comment_text": "Amanda Sims Maag Ideas for our adventure!"}, {"username": "Kelly Sparacino", "comment_text": "Gritti Palace was amazing. Fabulous location and service."}, {"username": "Ashley Johnson", "comment_text": "We stayed at Ai Mori D’oriente. It was wonderful! The staff was amazing! We stayed for 5 days"}, {"username": "An Nie", "comment_text": "This is one place I want to take the most important love in my life. And never leave. So beautiful. Patrick M Forrest"}, {"username": "Thao Russo", "comment_text": "In Mai we stayed in Casa Verando, it was mega mega. The location is 3 minutes to the Sandro square, but still in quiet place, in front is the small canal. Very romantic! Also the decorations inside hotel and room are antique and very nice. https://\nwww.casaverardo.\nit/de/"}, {"username": "Srilatha U Rao", "comment_text": "Edward..."}, {"username": "Marilyn Carlisle", "comment_text": "Hotel canal Grande! I cried when we left! Very close to train station and steps from vaporetto stop. Great restaurants near by and a wonderful place to wander and get lost! The breakfast is to die for too!"}, {"username": "Denyelle Dioguardi Machado", "comment_text": "The breakfast and coffee was fabulous! It’s on the corner of a small canal. Great location!\n\nhttps://\ncaalvise.com/\n?lang=en"}, {"username": "Judy Bellinder Potilechio", "comment_text": "We did air b and b"}, {"username": "Kelly Palermo Luke", "comment_text": "We were there 2 weeks ago and stayed at the Gritti Palace. It was amazing!!"}, {"username": "Cathy Edwards Dotter", "comment_text": "JW Marriott or the Hotel Danieli"}, {"username": "Carolyne Banford", "comment_text": "We are booked Palazzo Suite Ducale. Any info would be appreciated’"}, {"username": "Mark O'Hare", "comment_text": "Following"}, {"username": "Miranda Bloch", "comment_text": "We stayed hotel Colombina- fabulous and very reasonably priced."}, {"username": "Maria Carriedo-Ceniceros", "comment_text": "We just got back 2 weeks ago and stayed at Hotel Aqua Palace. Just a 2 min walk to St Mark’s Sq. Gondola stand just outside front door. It was one of the more reasonable hotels we found. I would stay there again\n\nView of small canal from the room."}, {"username": "Jasmine Davidson", "comment_text": "F"}, {"username": "Julie Herr Rozell", "comment_text": "Hotel Bel Sito ♥️♥️♥️ Great location with water taxi dropoff on small canal.\n\nhttps://\nwww.hotelbelsito\nvenezia.it/"}, {"username": "Cherie Dwyer", "comment_text": "Al Ponte Antico overlooking the Rialto Bridge. We had a beautiful stay - Matteo and Barbara, the owners, are wonderful.\n\nhttps://\nwww.alponteantic\no.com/"}, {"username": "Marnie Rae", "comment_text": "F"}, {"username": "Kathie Price Essiambre", "comment_text": "Following"}, {"username": "Gemma McQuoid", "comment_text": "Has anyone stayed at the Monte Carlo?"}, {"username": "Paul Davis", "comment_text": "We recently stayed at Pensione Accademia. Very nice, super breakfast, has a great courtyard, see photo (rare green space in Venice). It has its own dock which allows us to get picked up right there by a water taxi to take us to the airport. Very close to the Accademia bridge which crosses the grande canal."}, {"username": "Eileen O'Shaughnessy", "comment_text": "Following"}, {"username": "Tiffany Mike", "comment_text": "Hotel Carlton on the Grand Canal Venezia"}, {"username": "Melissa Feielin Hawkins", "comment_text": "Stayed here earlier this month for 4 days. Wow what an incredible experience. Raddison Palazzo Nani- a true 5star with amazing canal front suite, luxury spacious rooms, customer service/staff that is fantastic , location perfect. It’s own hidden small garden/patio area which was our favorite to enjoy the fabulous breakfast and espressos.\n\nZoom in on the picture collage 🤗💖🇮🇹"}, {"username": "Kim Geary Keidel", "comment_text": "We stayed at Splendid and loved it!"}, {"username": "Tracey Rogers", "comment_text": "We stayed at the NH Collection Venezia Dei Dogi. Oh my. There are gardens in the back that have underground tunnels and back up to the sea."}, {"username": "Carla Casci Principato", "comment_text": "H10"}, {"username": "Terri Dalton", "comment_text": "PALAZZETO PISANI GRAND CANAL VENICE. If you take a private taxi it will take you right to the door!"}, {"username": "Andrea Howard", "comment_text": "Hotel Saturnia"}, {"username": "Felicia Goldfarb", "comment_text": "Hotel Dona Palace, right on canal, 2 min walk to the San Marco Square, A/C, comfy rooms and amazing breakfast!"}, {"username": "Sandra Kingsley", "comment_text": "We were going to stay at Rialto Hotel right at the Rialto Bridge but had to cancel at the last minute due to cruise changes. Check it out!"}, {"username": "Lisbeth Adelina", "comment_text": "F"}, {"username": "Caroline Shedleur", "comment_text": "F"}, {"username": "Karen Lewis", "comment_text": "We stayed at Hotel Principe great location & lovely hotel. Lovely views from balcony over the canal"}, {"username": "Heather MacDonald", "comment_text": "We stayed at the Casa dei Pittori apartments. They have a variety of apartments in the building. We were on a canal and watched gondolas and taxis go by... The apartment set up a porter to walk us from the train to the apartment and back again. It was €5 a bag."}, {"username": "Rhonda Hope", "comment_text": "Hotel foscari palace beautiful hotel on the canal"}, {"username": "Rhonda Hope", "comment_text": "Rhonda Hope"}, {"username": "Maria Samayoa", "comment_text": "F"}, {"username": "Bokkie Els", "comment_text": "San Cassiano is such a beautiful place and very close to San Stay vaporetto stop. The breakfast is delicious and the staff are friendly and helpful. It was a great experience. ❤️❤️"}, {"username": "Daniel Fett", "comment_text": "Following"}, {"username": "Carolyn Balding", "comment_text": "Hi would I be able to have info for the apartment please"}, {"username": "Janet Cabot", "comment_text": "StTing here In September https://\nwww.casagredohot\nel.com/\n?gclid=Cj0KCQjwn\n_OlBhDhARIsAG2y\n6zMReJFdMenMrez\nLShlwk2GBdWSjEC\nZs5WLxgLEnRsAsD\n8wg3n4qv3waAoPz\nEALw_wcB"}, {"username": "Antonio Aloè", "comment_text": "expedia,,,,"}, {"username": "Kit Nader", "comment_text": "Hotel columbina its a pretty boutique hotel on the same canal as the bridge of Sighs, you can actually see it out of the window . I highly recommend it. Near st marks ( 2 minute walk) . It has its own dock too so you can get a taxi from the airport straight to the door. Beautifully decorated...ver\ny good staff...4 star...so price isn't over the top. Air con 24 hour desk... breakfast ... bar...gorgeous bathrooms with shower and bath. Lift which not all hotels have. My favourite venice hotel and I've stayed in quite a few."}, {"username": "Lynn Dye Shell", "comment_text": "Hotel Ca’dore was a great place to stay for us last week. Cool air conditioning, clean and pretty room, friendly staff, away from the grand canal so not noisy but three minute walk to vaporetto stop."}, {"username": "Francine Lataille", "comment_text": "Maxime Lataille"}, {"username": "Petrca Praznik", "comment_text": "Hotel Santa Lucia, near rail station. 😊 Cheap, good,clean, very kind staff"}, {"username": "Lauren Smigielski", "comment_text": "Hotel Metropole was beautiful! Would definitely stay there again when in Venice 😊"}, {"username": "Gina Romano Peralta", "comment_text": "La londra palace is amazing"}, {"username": "Rod Fick", "comment_text": "The Rialto, adjacent the Rialto Bridge, was excellent for us."}, {"username": "Teri Mayo", "comment_text": "Ai Reali"}, {"username": "Shannon Stanton King", "comment_text": "We loved Saturnia! Our window overlooked a gondola route\n\nhttps://\nwww.guestreserva\ntions.com/\nhotel-saturnia-i\nnternational-ve\nnezia/\nbooking?msclkid=\na64284b381ee14c\ne2effe00f8cf06b\nb1"}, {"username": "Danielle Gervais", "comment_text": "Ho well not available for my dates in September!"}, {"username": "Lilly Raymond", "comment_text": "Hotel Antiche Figure Venice\n\nhttps://\nwww.hotelantiche\nfigure.it/\n?mibextid=2JQ9oc\n#/"}, {"username": "Nancy Francis", "comment_text": "F"}, {"username": "Phyllis Snyder", "comment_text": "When?"}, {"username": "Annie Nelhams", "comment_text": "https://\nwww.booking.com/\nShare-RMIWHG\nThis hotel is fabulous- pick up by boat. Near Ponte Academia"}, {"username": "Sabine Pressl", "comment_text": "Hotel Metropole"}, {"username": "Nina Churchill", "comment_text": "https://\nwww.hotelamerica\nn.it/en/"}, {"username": "Dana McLoughlin", "comment_text": "We just stayed at Hotel Principe very nice"}, {"username": "Katja Heikka", "comment_text": "I just came home from Venice. We stayed in Hotel Serenissima near Rialto and S. Marco. We liked the situation of hotel very much. Hotel was quite small and nice☺️ Good breakfast. Not too expensive. And the stufff was very kind and helpful😍"}, {"username": "Heather Butler Martin", "comment_text": "St. Regis!! We were just there in May. Booked private transport from airport to hotel through the concierge and from hotel to train station when we left. It’s right on the grand canal and amazing!"}, {"username": "Jane Jamieson", "comment_text": "Myself and my family always stay at il ponte de mocenigo its beautiful and not expensive, it's beside ste star vaporetto stop"}, {"username": "Irene Beck", "comment_text": "We highly recommend Hotel Palazzo Giovanelli & Gran Canal Venice. It was amazing! One place I wouldn’t stay is right by the Rialto…so busy at all hours of the day and noisy. Just go look and walk over it!"}, {"username": "Lorinda Nelson", "comment_text": "Hotel Rialto! Great location. Awesome place!"}, {"username": "Kristine Cameron", "comment_text": "H10"}, {"username": "Paul Fielding", "comment_text": "Baglioni"}, {"username": "Dolores Alimentato", "comment_text": "The Carnevale Place Hotel we stayed there in May and extended our stay by two days. Awesome and not as crazy busy and the vaporetto stops out front."}, {"username": "Domenica Calvene", "comment_text": "We are in Venice now staying at Hotel da Bruno..this is an apartment for the 3 of us but can sleep up to 5 you like to share a bed or are couples.\nVery central to shops.Walk everywhere.\nRialto and Metropole are both on the main canal as we passed them many times walking.Lots of hotels etc in Venice.Water taxis and water bus are easily accessible if you need them.\nGoogle maps is a must.😃"}, {"username": "Joe Visotski", "comment_text": "Following"}, {"username": "Megan Sergeant", "comment_text": "Following"}, {"username": "Erica Lowy", "comment_text": "Londres Palace Venice❣️‼️"}, {"username": "Michelle Atkinson Kelsey", "comment_text": "Not directly in a canal but close. We just left today. Rosa Salva hotel. Charming rooms."}, {"username": "Eddy Quermia", "comment_text": "Hallo, didn't anyone booked a B&B??"}, {"username": "Marjie Gignac", "comment_text": "Following"}, {"username": "Laura Yano", "comment_text": "F"}, {"username": "Brad Nelsen", "comment_text": "Hotel Moresco"}, {"username": "Ellen Edmonds-Wilson", "comment_text": "We left the Ca Maria Adele on Friday and can’t speak highly enough of it. Off a small canal from the Grand Canal opposite the Gritti Palace, there’s a Vaporetto stop 40m away. It’s only 12 rooms and no lift, but it’s gorgeous and personal. Also no kids under 16. We loved it. The photo was the view from our bathroom. We had four views from four windows - overlooking the church and down the canal. Great location in a quieter arty area of Dusodoro and there are lots of lovely places to see and eat. Also there’s a pub nearby with €3 spritzes and ciccetti. Loved it. The price was excellent for the high quality hotel. Best we stayed in during our month in Italy."}, {"username": "Gisèle Bolduc", "comment_text": "F"}, {"username": "Carolyn Agee", "comment_text": "Following"}, {"username": "Diane McKegney", "comment_text": "F"}, {"username": "Sally Amatelli Millaway", "comment_text": "We stayed at Splendid Venice and loved it."}, {"username": "Carrol Lanoue", "comment_text": "."}, {"username": "Ruth Mattingly", "comment_text": "Hotel Kette is nice and great location, near Piazza San Marco. Reasonable."}, {"username": "Dave Colleen", "comment_text": "We just left Hotel Moresco. Stayed here twice. They give you breakfast, a bottle of Prosecco, a welcome drink, happy hour (free food bites), bathrobe, slippers, and great customer service. On the canal easy walk to train 💜"}, {"username": "Liz Mazzare Contadeluci", "comment_text": "F"}, {"username": "Janis Parker", "comment_text": "Hotel Nani Moncenigo Palace\nBeautiful, quiet, great breakfast. Dosoduro area with private water taxi to the entrance or public vaporetta a block away."}, {"username": "Cherie Coe", "comment_text": "Quentin Coe check this out"}, {"username": "Claudine Auclair", "comment_text": "JW Marriott"}, {"username": "Nancy Clawson", "comment_text": "H10 Palazzo is where we stayed. It was awesome. Rooftop bar with appetizers with amazing view on canal. They also arranged a free water taxi for us to the Murano glass factory."}, {"username": "Tracy Wrinn Mcdermott", "comment_text": "https://\nwww.alponteantic\no.com/\n\nThere are a couple of less expensive rooms (still $350) not on the grand canal, but they have a terrace for breakfast and drinks that has a view of the Rialto Bridge. Great reviews."}, {"username": "Mirella Pagnotta Nardi", "comment_text": "F"}, {"username": "Linda Chase", "comment_text": "Hotel Principe on the Grand Canal"}, {"username": "Veronika Sheykova", "comment_text": "I recommend Heureka Hotel and Cima Rosa they have suites with canal view"}, {"username": "Ashley J Hundt", "comment_text": "Same. Following"}, {"username": "Michelle Marchini", "comment_text": "Following"}, {"username": "Nancy Mazur Sutch", "comment_text": "St. Regis"}, {"username": "Candy Cooper Martin", "comment_text": "We have stayed at Hotel Cavelletto a couple of times. It is on a canal and close to St. Marks square. Small rooms but very comfortable and air conditioned!"}, {"username": "Lisa Valdovinos", "comment_text": "L’ Orologio"}, {"username": "Debbie DiOssi", "comment_text": "CaSegredo"}, {"username": "Louisa Curvelo", "comment_text": "Louisa Curvelo"}, {"username": "Stephanie Willox", "comment_text": "Following"}, {"username": "Michelle Greenwood", "comment_text": "https://\nwww.hotelcontine\nntalvenice.com/"}, {"username": "Joe Visotski", "comment_text": "Pardon my ignorance but what is everyone following ??"}, {"username": "Nathalie Séguin", "comment_text": "We loved this little boutique hotel on the grand canal. Your expensive might be different than my expensive, this was at the very top of my budget. Our room didn’t have a canal view but the breakfast room did. It was a great hotel. https://\nrivadelvin.it/en"}]}, {"id": "2197454923986919", "text": "Are reservations a must for restaurants in Rome?", "link": "facebook.com/groups/1373361046396315/permalink/2197454923986919/", "likes": 0, "comments": [{"username": "Anthony Sperduti", "comment_text": "No\nEat before 9"}, {"username": "Jerry Lyubelsky", "comment_text": "We did not make any reservations at all"}, {"username": "Lisa Kelly", "comment_text": "No"}]}, {"id": "2197456990653379", "text": "Planning a trip with my teen son in late May, 2024, with stops in Venice, Florence, Rome and Pompeii. I'm already overwhelmed and haven't even started planning details! 😆 I will be traveling from Texas and can fly out of any of the major airports (Dallas, Austin, Houston). I want to purchase round trip tickets rather than one-way because one-wayआणखी seems twice as expensive. However, I'm unsure where to fly in/out of Italy in order to avoid spending a lot of time traveling to and from the airport. Most people seem to start at one end of Italy and end at the other, but maybe it's better to circle back (stay a day or so at the beginning and end of the trip in one city rather than consecutive days) in order to save on costs? Any suggestions about airports and related itinerary are greatly appreciated!", "link": "facebook.com/groups/1373361046396315/permalink/2197456990653379/", "likes": 1, "comments": [{"username": "Stephanie Osborn Rushing", "comment_text": "We are flying direct out of DFW on American to Rome round trip. Then doing Rome, amalfi coast, Florence. Leaving super early in Florence to catch late afternoon flight back home. Was worth it for us to do direct. Bought flights and then set google tracker. Once flights dropped ($500 per ticket) we called American and they credited us the difference, kept same seats so was a win! Just have to jump on it when those prices change."}, {"username": "JeriLynne Clifford", "comment_text": "Fellow Texan here, and I will tell you I recommend flying into a large city like Rome are Milan. We think of countries is being huge, because the United States is huge, but Italy is feasible to get around via train."}, {"username": "Lisa Adams Robertson", "comment_text": "Flying in one city and out of another can save you valuable time. You don't have to buy one way tickets; look at the multi-city option. It might be a little more than a round trip ticket out of one city, but not nearly as costly as one way tickets."}]}, {"id": "2197462647319480", "text": "Just got back and wanted to let anyone interested in the VAT tax tips. It’s amazing.\nWe did alot of shopping. Use 1 dedicated passport.\nUpon arrival at FCO- scan passport and all your purchases show up. Choose refund of your choice. I did back on CC\nSwiped it and was less than 5 mins.\nRefund showed up the next day.", "link": "facebook.com/groups/1373361046396315/permalink/2197462647319480/", "likes": 319, "comments": [{"username": "Richard LaRusch", "comment_text": "Hilary Diekow & Danielle Diekow LaRusch"}, {"username": "Leah Hernandez", "comment_text": "🤯🤯 wow! I’ve only been on a Mediterranean cruise once 12 years ago. I didn’t know this was a thing. I am planning a trip next year. (Not a cruise this time) We will be flying into Spain and then flying home from Italy. Will I be able to use my purchases in Spain at the airport in Italy?"}, {"username": "Cherie Dwyer", "comment_text": "Ours was not through the company with the Kiosk, we had to go to a counter, wait in line, show item then after they completed form take it sbd lit it into a mailbox right there. Still waiting for the refund."}, {"username": "Cherie Compartore", "comment_text": "Following"}, {"username": "Maureen Judice", "comment_text": "Cecile Broussard\nEileen Huval"}, {"username": "Tracey East", "comment_text": "I bought a leather jacket in Rome and it was so easy at the airport, I had packed it in my checked luggage and no one asked to see it, took about 2 minutes to use the kiosk, asked for refund onto credit card, and voila refund showed once we got home. The shop assistants will always use the VAT back as a sales tactic to get you to spend more, they were the ones that gave me all the information, I was sceptical at first but followed their instructions and it was a breeze ☺️"}, {"username": "Janelle Skaggs Priester", "comment_text": "I had to file at 2 different places…1) Global Blue…was a kiosk, got refund next day\n2) Planet (my most expensive purchase)…stood\nin line, dealt with a human, still have not received refund and have been back almost a month."}, {"username": "Dina Garrett", "comment_text": "Linda Williams, Julie Franco Mellow, BillandAngala Verley"}, {"username": "Mark E Thomas", "comment_text": "What if you make purchases in Italy but fly out of Paris?"}, {"username": "Georgeann Farinacci Greene", "comment_text": "Is the tax also charged for those that reside in Italy? Would you save that tax if a friend or relative ( that lives in Italy) purchased something for you ie a Gucci bag or 18kt jewelry?"}, {"username": "Allison Shotton", "comment_text": "Can anyone tell me how does it work if we are catching the train from Rome to London and flying home from London"}, {"username": "Cathy Halloran", "comment_text": "I wonder what I did wrong? I have been waiting over 30 days????"}, {"username": "Nicole Millar", "comment_text": "Marlene Kaiser-Domingue\nz"}, {"username": "Silvia Scholz Natal", "comment_text": "I go every year “home” to German and I’m an American! Stupid me I never even was thinking about that and I do leave some money there lol"}, {"username": "Silvia Scholz Natal", "comment_text": "Can you explain closer please. You get your receipt and then what ??"}, {"username": "Heather Gianoli-Hinkley", "comment_text": "If we are leaving from Venice to Amsterdam. Can I do my VAT in Amsterdam?"}, {"username": "David Davey", "comment_text": "How many passports do you carry?"}, {"username": "Catherine Gallus", "comment_text": "Roger Hilton"}, {"username": "Richelle Tye", "comment_text": "Richelle Tye"}, {"username": "Michele Young Rozzi", "comment_text": "Can’t u just buy all the high items put in ur luggage and call it a day 😬"}, {"username": "Gina Winterstein", "comment_text": "Same. They say you need to have your purchased avail to shore them, but they didn’t ask to see any of them. The vat location in the airport is located right inside the airport."}, {"username": "Loredana Jimenez", "comment_text": "For clarification: I will be paying for my GUCCI purchase in euros. I will bring my passport to the store, they will scan-do the appropriate paperwork. When I get to FCO: Have my actual purchase with me, as they may want to see it. Advise at the counter how I want my refund (I will want cash, easier option). THEN PROCEED TO CHECKIN? I am from USA ."}, {"username": "Sandy Vee", "comment_text": "This for Global Blue only though"}, {"username": "Krystal Apolinaro", "comment_text": "Wow nice! My refund hasn’t shown up yet, processed on Thursday."}, {"username": "Tina Vuong", "comment_text": "In my recent experiences, VAT refunds were very efficient in Rome and Dublin. Long lines in Paris and more paperwork.\n\nRefunds and minimum spending amounts vary by country.\n\nVAT refunds Must be processed at your final EU country"}, {"username": "Kay-Khuyen Nguyen", "comment_text": "If I purchase an LV bag in Mylan, but my last destination is in Paris so do they except that VAT tax refund in Paris’s airport? Or do I have to purchase the bag in Paris?"}, {"username": "Pat Petrello", "comment_text": "F"}, {"username": "Karen Rice", "comment_text": "I will be leaving Rome on a cruise ship. Is there anyway to claim the rebate in that situation? ￼"}, {"username": "Fiona Cameron", "comment_text": "What if Im flying out of Bologna???"}, {"username": "Fiona Cameron", "comment_text": "Wish Id known this the last 2 times I traveled to Italy and bought $$ leather jackets !!!"}, {"username": "Melissa Hoppe Oshiro", "comment_text": "."}, {"username": "Craig D'Onofrio", "comment_text": "Kristin Carr D'Onofrio"}, {"username": "Mandie Cowan", "comment_text": "Does anyone know if this applicable at a cruise port? We are staying in Italy for 10 days and then leaving by cruise back to the USA."}, {"username": "Lisa Bolte", "comment_text": "."}, {"username": "Sandy DT", "comment_text": "Is this for all countries? I’m from Canada"}, {"username": "Robyn Cane", "comment_text": "Jessica Liston"}, {"username": "Patricia Eileen", "comment_text": "How much do you have to spend? $156? How much is the tax?"}, {"username": "Michelle Plutto", "comment_text": "Following"}, {"username": "Debi Murray Lee", "comment_text": "We fly into Rome for a week but out of Athens after a cruise, is this applicable?"}, {"username": "Michele Levesque Semosky", "comment_text": "For information: https://\nwise.com/gb/vat/\nitaly#"}, {"username": "Michelle Hebert Frederick", "comment_text": "How much is this tax? Just curious as to the percentage if it is worth the trouble."}, {"username": "Letty Veronica", "comment_text": "Yes so easy!! No line at all at FCO. Got back hundreds!"}, {"username": "Melisa Kish", "comment_text": "Jamie Hegwood"}, {"username": "Stefania Carmosino Spas", "comment_text": "F"}, {"username": "Carolynn Hinz Reed", "comment_text": "What if you have a very early flight, can it be done before hand? At at a location other than airport? We leave Venice at 6:30am. TY"}, {"username": "Kristen Hahn Hankey", "comment_text": "."}, {"username": "Paula Brink", "comment_text": "https://\nwww.italist.com/\nmagazine/\nhow-to-get-a-vat\n-refund-italy/\n#:~:text=Bring%2\n0your%20VAT%20f\norms%2C%20your,\nget%20your%20re\nfund%20straight\n%20away.\n\nHere is an explainer."}, {"username": "Melissa Oh", "comment_text": "AJ DiSerio"}, {"username": "Brenna Buratti", "comment_text": "Is"}, {"username": "Lisa Terry Holtcamp", "comment_text": "I like some others am new to this and my head is spinning. Curious are the prices CSR for those higher end items like Gucci a lot cheaper than the US to do this or are you just buying it there?"}, {"username": "Nancy Francis", "comment_text": "Great info!"}, {"username": "Jennifer Erdman", "comment_text": "Thank you for sharing!"}, {"username": "Lisa Baglio Garrison", "comment_text": "Same here too. Was a very simple process!"}, {"username": "Jodi Elizabeth", "comment_text": "So what about purchase less than 156€? We asked a vendor today where we spent slightly under .. he says they could only do a form for the 156€ but at the VAT office at the airport they would add up all receipts for purchases of goods? Is that true?"}, {"username": "Bob Lampo", "comment_text": "Yes great smooth fast service. Just be sure that each merchant files the paperwork and gives you a copy before you leave.\nIf not, you won’t get your VAT back. My first merchant told a naive me to file on my own and it was my dead end."}, {"username": "Wendy Ward Stanger", "comment_text": "I’m assuming there is a VAT booth at Florence airport as well? We have a very early flight. Do you think they would be open at 4 or 5 AM?"}, {"username": "Denise Dunlap", "comment_text": "Is there one at the cruise terminal? We’re leaving Italy by ship…."}, {"username": "Jan Buess", "comment_text": "That is awesome!"}, {"username": "Denise Dunlap", "comment_text": "If I understand this convoluted process correctly (🤣) I need to spend more than 155 at least once then the VAT office will also add in my smaller purchases to that lg amt? 🤞🏻"}, {"username": "Jan Buess", "comment_text": "I just read that it's between 11 to 15% refund on your purchases over 154.95EU. The companies charge a small fee to refund. Also the real tax you pay on goods is like 22% so I imagine it's a good thing to get most of that back. Make sure the store files and gives you a receipt"}, {"username": "Larissa Bond", "comment_text": "So, you registered your passport at the airport? Where exactly? Thanks!"}, {"username": "Penny Bellofatto Westberry", "comment_text": "It has gotten so much easier than years ago! Yes, makes it even easier if you use one credit card and thus one passport for all purchases."}, {"username": "Mandy Miller", "comment_text": "I'm confused 😕... What is this 😬... Seriously since joining this group I've had some amazing tips 😃... But it's likd I'm planning a trip to the moon 😂... Why do I have to register my passport??... Help 😅"}, {"username": "Kim Aranha", "comment_text": "This is fantastic information"}, {"username": "Jemma Foster", "comment_text": "."}, {"username": "Jane Mock", "comment_text": ".."}, {"username": "Carol Shrieve", "comment_text": "You don’t register at the airport. When you make a purchase over approx. $156, you show the merchant your passport and they give you a VAT tax form with your receipt. ￼￼(only items you can carry on a plane) Keep all of these receipts together in one envelope - it will help expedite when you get to the airport. There are two different VAT tax agencies: planet and global blue. Merchants choose which ones they use, so you may have to go to both offices at the airport. Luckily right together. Carry on the items you purchase in the original packaging, and ￼￼take them and VAT forms to the VAT tax office in the airport for your refund. Signs are everywhere—easy\nto find. You show the receipts & the items to the customs agent, then proceed to one of the two windows to get your refund. ￼You have your choice to have a check mailed (which almost never gets there), refund to your credit card or cash on the spot. ￼ They take a ￼fee so you never get the full amount back."}, {"username": "Janine Emma Lucas", "comment_text": "Was this at the walk up ‘counter’ or a self serve kiosk?"}, {"username": "Cindy Corbin Cangelose", "comment_text": ".."}, {"username": "Paula Bennett", "comment_text": "Did they want to see all the items you purchased?"}, {"username": "Sara Rhodes", "comment_text": "Gareth Rhodes"}, {"username": "Laura Miller Bailey", "comment_text": "Thank You for the information"}, {"username": "Shawn Sanders", "comment_text": "Did you provide a photocopy of your passport at the store or did you have to bring the actual passport?"}]}, {"id": "2197471497318595", "text": "Has anyone used Amex travel to book accommodations and airfare?", "link": "facebook.com/groups/1373361046396315/permalink/2197471497318595/", "likes": 0, "comments": [{"username": "Robert Lawshe", "comment_text": "I have used them to book hotels through FHR in italy"}, {"username": "Laura Uribe", "comment_text": "I compared Bookig .com with Capital One Travel. Yes I got extra points using Cap 1, but it cost more. Be sure you’re getting the best deal for you."}]}, {"id": "2197472593985152", "text": "Plan to travel for first time to Italy May 2024 for 15 days with husband and 22 year old daughter. Want to go to Rome, Venice, Florence, Cinque Terre and maybe another city. For first time is it best to use travel agent or just research and book myself? Hotel vs VRBO for 3 people? How soon should I book? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2197472593985152/", "likes": 2, "comments": [{"username": "Kristina Ruk", "comment_text": "It is always cheaper and makes more independent to search yourself, but if you dont feel confident ask travel agent, but these days with internet anything possible;) we are family of 5 and sometimes looking for place to sleep like 2-3 hours before stop.. also we travel by car arround Europe but I dont see any problem as so many trains and flights are arround Europe or any specific country. Good luck hope you'll have terrific trip"}, {"username": "Richard Stein", "comment_text": "We are in Italy now, we booked the entire trip ourselves. We booked 7 months in advance for the planes and hotels, and added the tours as we got closer and researched what we wanted to do and see. If your booking yourself, book early especially the tours/sites you want to see because big companies buy a lot of the tickets early. We prefer hotels but a lot of people use VRBO/ABNB, for the kitchen and wash. We usually spend most of our time out of our room so a hotel is perfect for us. Good luck and have a great trip ."}, {"username": "JeriLynne Clifford", "comment_text": "I always book my trips myself. If you book at hotels, the concierge can help you book restaurant reservations if needed. I do not recommend using a third-party booking agent. Always booked directly with the hotel this way. If there’s any problem they can fix it. I’ve had friends and family have nightmares using third-party agency’s."}, {"username": "Lisa Valdovinos", "comment_text": "We used a travel agent and it took a lot of pressure off me. I usually plan all of our trips myself but this was a big one so I needed help. No regrets!"}, {"username": "Greg Saba", "comment_text": "Research and book yourself. It is very easy today. You can get hundreds of opinions on the internet but only one from a travel agent, perhaps one who has never even been to all the places you describe. We find that planning our trips is half the fun of travel. The sweet spot for booking international travel is often said to be 2-4 months prior to travel. Car rentals are pricey, but the areas you mentioned can all be accessed by the great and affordable Italian rail system. TripAdvisor and Fodors, as well as FB, provide lots of itinerary suggestions. We often google 1,2, or 3 days in a particular town or city and see what interests us. Be forewarned if you book lodging on sites like airbnb and VRBO, they take virtually no responsibility for problems including last second cancellations. Ending up, as we did recently, late in the day in Nice, France, with a host cancellation can ruin your trip. And, unlike hotels, companies like airbnb say they are not responsible."}, {"username": "Virgz Van Møøre", "comment_text": "Too short for all of this"}, {"username": "Alyce Henry", "comment_text": "Costco travel the best"}, {"username": "Brenda May Schindler", "comment_text": "Thank you for the information"}, {"username": "Carlie Lee", "comment_text": "If it's your first time, it can definitely be overwhelming. Travel agents who have been there (like myself) can be a huge help!"}]}, {"id": "2197473073985104", "text": "Has anyone flown ITA airways? Wondering how strict they are with luggage sizes. The one I like is just 0.5in bigger in length and width then their sizing but I also don’t want to chance it. So hard traveling for so long with such a small carry on! Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2197473073985104/", "likes": 8, "comments": [{"username": "Valerie Freeman", "comment_text": "I haven't but recently booked. I ended up calling to ask questions, then booked business class being ill have checked bags"}, {"username": "Rhona OConnor", "comment_text": "Check in a bag..... Just don't fill it to more than you can lift if you are travelling by train."}, {"username": "Michelle Solak", "comment_text": "We flew them and didn’t have any issues, though all our bags were within the size limits. I personally wouldn’t risk it"}, {"username": "Delia Miscella Wroblewski", "comment_text": "I’ve flown ITA a few times from New York. They never weighed or measured my carryon. I really don’t think that 1/2 an inch will matter."}, {"username": "Eileen Steiniger", "comment_text": "Flew them in Italy, Rome to Venice. No measuring was done. They made back packs go under the seat"}, {"username": "Tiffany Hadfield Merrill", "comment_text": "We flew out of lax and they weighed our luggage but didn’t measure it."}, {"username": "Traci Raymer", "comment_text": "Flew into Sicily yesterday. The only thing it has to pass is the security where they scan it. No one measures it. Only one of us was asked to weigh our bag."}, {"username": "Tracy Foss", "comment_text": "I'm worried too about trying to travel light for practically 4 weeks we have some local flights 1 ITA & 2 ryanair but also trains going to try not to stress if they make us put in the hold 🤷🏼‍♀️"}, {"username": "Lisa DiDonato Hayden", "comment_text": "We flew ITA from Bari to Rome - no issues with the sizes of our checked bags, carry one or personal items 🙂"}, {"username": "Janet Messanelli Bozzone", "comment_text": "One way they checked for weight. 8kg! One way they didn’t. They didn’t looks at the size either way. 🤷🏼‍♀️"}, {"username": "Mary Brown", "comment_text": "I was super nervous flying through LHR and ￼ British Airways reading stories on￼ these Facebook groups.\nI was also worried about 1/4 of an in￼ch, and I can tell you no one measured our carry ons. I saw People with even larger ones like 24”\nI would be shocked if someone actually gave you a hard time over a half an inch."}]}, {"id": "2197478057317939", "text": "First post but regular follower. We’ve traveled to Europe fairly extensively, however, we’ve always done a single country at a time. I’m in the early stages of planning a trip to Italy next year. This time, I’m going to do something a little differently than I’ve done in the past.￼. I’m planning on flying into Paris, spending a few days, then taking a train to Milan and beginning out Italian adventure from there. My question is… does anyone have specific experience with the train from Paris to Milan? Experience? Details? Thanks in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2197478057317939/", "likes": 0, "comments": [{"username": "Rhona OConnor", "comment_text": "I just did Paris - lucerne - Bologna with no problems. The Paris Lucerne was expensive enough 🤔 one of the 3 trains was late, missed a connection, one to the staff pulled up other trains for us to get and it was no problem."}, {"username": "Robin Burrell", "comment_text": "We did it a few years ago. Wonderful. Spectacular scenery. I remember it as being very comfortable, a car we could purchase meals from. I’m sure we upgraded. Not too busy."}, {"username": "Tania Lediard", "comment_text": "Easy trip. We brought our own little picnic including wine and made it an incredible part of the whole experience. We go with - it isn’t always the destination, but the experiences along the way!"}, {"username": "Susan Monaghan", "comment_text": "As long as you’re en route, could be interesting to make an overnight stop in Interlaken, Switzerland to go up to the Jungfrau. Or even a stop in Stressa, Italy on Lago Maggiore."}, {"username": "Penny Bellofatto Westberry", "comment_text": "We've combined Paris and Lake Como a few times, but have flown - Easy Jet or AF - very reasonable prices."}, {"username": "Connie Wilson", "comment_text": "I took this train with my 10-year old son and it was a beautiful trip. We went via Geneva, although there are a couple of other routes available. My suggestion is to only go as far as Stresa on Lago Maggiore, Lugano, Como or Torino and spend a couple of days. Again, your route will determine where you could stop.\nDownload the TrenItalia App to see the different routes and stops (you’ll need to click on a specific train for the stops)."}, {"username": "Alice Francesca", "comment_text": "Train ride easy and wonderful scenery.You should stop in Turin and spend a couple of days there.From there, drive to Lake Como.Skip Milan, I am Italian and I can't bear it like many of my countrymen"}, {"username": "Alice Francesca", "comment_text": "https://\nwww.theguardian.\ncom/travel/\n2023/may/27/\ngrand-torino-ita\nly-turin-city-b\nreak"}]}, {"id": "2197481843984227", "text": "Hello, Is it better to book a gondola ride in advance? Thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2197481843984227/", "likes": 1, "comments": [{"username": "Victoria Laverty", "comment_text": "No plenty and set rate\n\nI asked for small cannals"}, {"username": "Gina Johannes", "comment_text": "Nope. There are plenty available and run every 20 minutes. Was there last week. 80euro to 100 euro"}, {"username": "Miklos Verdes Kovacs", "comment_text": "Better to buy one !"}, {"username": "Eric Maurer", "comment_text": "Nah"}, {"username": "Paul Anderson", "comment_text": "I’m on vacation. Buying in advance means keeping a schedule."}, {"username": "Kit Nader", "comment_text": "No ... not unless you want to arrange a singer or musician to accompany you. It's easy to find one...in fact you'll be tripping over gondoliers!"}, {"username": "Sandra Desmond", "comment_text": "A few years ago we didn’t book I’m sure there’s plenty around if you book it your tied to a time"}, {"username": "Lynn Francisco Casella", "comment_text": "No"}, {"username": "Brian Osman", "comment_text": "You can just walk up and book it"}, {"username": "Reshma De Cruze", "comment_text": "Plenty available with set pricing"}, {"username": "Lisa Valdovinos", "comment_text": "You can just walk right and get one. We had no reservations and there was no line."}]}, {"id": "2197483287317416", "text": "Early bird catches the worm. Trevi Fountain at 7 am. No crowds 🥰", "link": "facebook.com/groups/1373361046396315/permalink/2197483287317416/", "likes": 185, "comments": [{"username": "Annabelle Neal", "comment_text": "Where is your dress from please x"}, {"username": "Kristin Bryant Powell", "comment_text": "Where is that dress from 😍"}, {"username": "Lily Nasery", "comment_text": "Gorgeous! Love that dress!"}, {"username": "Péter Haller", "comment_text": "Péter Haller"}, {"username": "Haylee Jeffery", "comment_text": "Robynne Douglass"}, {"username": "Marie Cuzzi", "comment_text": "Best time to go!!! Good for you"}, {"username": "Sara Capi", "comment_text": "Beautiful!!"}, {"username": "Lauren Vassallo Beattie", "comment_text": "I'd rather sleep in😴 😅 especially being on Italian time lol"}]}, {"id": "2197484790650599", "text": "My husband and I will be in Rome for a week from Saturday before Easter 2024 - any suggestions on what we should do ?? Should we organise a tour our just explore on our own?\nWill most things be open through Easter ?", "link": "facebook.com/groups/1373361046396315/permalink/2197484790650599/", "likes": 0, "comments": []}, {"id": "2197488533983558", "text": "Can I ask please, although I wouldn't want to hear any negatives, has anyone anything positive to say about Hotel Antico Moro, Venice? Going in a few weeks time. It looks like a lovely wee quaint hotel..\nWe just want to know is it near attractions, & handy to travel to different locations...\nAnywhere within walking distance we should definitely see or do?\nThank you.", "link": "facebook.com/groups/1373361046396315/permalink/2197488533983558/", "likes": 4, "comments": [{"username": "Ellen Edmonds-Wilson", "comment_text": "It’s on the mainland by the look of it rather than the islands of Venice. You’ll need to get to the Vaporetto station to get in to the sights of Venice if that’s the right hotel."}, {"username": "Dave Conroy", "comment_text": "Google Maps will show you pretty much everything in that area, from sights to coffee shops and way more ... just type in the address of the place, or the name."}, {"username": "Kay Jenkins", "comment_text": "have you read the reviews on trip advisor or elsewhere? https://\nwww.tripadvisor.\nit/\nHotel_Review-g23\n57586-d565337-R\neviews-Antico_M\noro_Hotel-Zelar\nino_Mestre_Vene\nto.html"}, {"username": "Julie Self Burlison", "comment_text": "I stay at Hotel Ala. It is a great location, clean good breakfast and budget friendly"}, {"username": "Ariel M. Sheetrit", "comment_text": "I stayed there with my husband about 5 years ago, loved it."}, {"username": "Janet Walls", "comment_text": "You would only be around 40 minutes from Santa Lucia (walk & train), or 40 minutes from Rialto (bus & vaporetto). I have been to Venice many times, & my partner is half Venetian. Only ever stayed in \"Venice\" once, and Mestre many many times. Venice is full of overpriced hotels, looking to take advantage of gullible tourists. Mestre is much more sensibly priced which leaves plenty of extra spending money. The journey in and out is all part of the experience."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2197493917316353", "text": "I know florence isn’t known for seafood but my friend is a pescatarian. Anyone have restaurant recommendations? Also where did you have your best meal?", "link": "facebook.com/groups/1373361046396315/permalink/2197493917316353/", "likes": 2, "comments": [{"username": "Scott Perry", "comment_text": "My favorite meal was at the Trattoria Boboli in Oltrarno, just on the other side of the river."}]}, {"id": "2197494820649596", "text": "This group has been great to follow I have been to Italy and am going again\n1. It’s reminded me of things iv forgotten\n2. Made me think about things I hadn’t\n3. Alerted me to things that may have changed since covid\n4. And allows me to swipe on if it doesn’t interest me or serves no purpose. But I’m so sick of the people that have to beआणखी negative run down peoples posts make them feel stupid, if you know everything already then why are you in this group? If you know everything then you should be of help with your knowledge in a KIND manner not be arrogant. If someone is there RIGHT NOW and makes a post as to how they see a situation doesn’t mean it’s WRONG. IT might be wrong to you but it might help someone else who thinks different to you", "link": "facebook.com/groups/1373361046396315/permalink/2197494820649596/", "likes": 21, "comments": [{"username": "Patsy Luque Mejia", "comment_text": "Exactly! 💯"}, {"username": "Pam Hughes", "comment_text": "Hi, just wondering how easy it is to drive around Siscly or do we need to find a tour.Thanks."}, {"username": "Lexie Enlow", "comment_text": "I agree. I see some really mean unnecessary comments here. If you don’t have anything nice to say, just scroll along and don’t say anything at all."}, {"username": "Maxine Cunnyngham", "comment_text": "I'm somewhat new to the group and have noticed these mean thoughtless comments too. Good post."}]}, {"id": "2197503517315393", "text": "Suggestions for a short few hours in Naples.\nDoing Herculaneum in the morning but just have one day on this trip. Happy to wander but thought there might be some interesting ideas here ?", "link": "facebook.com/groups/1373361046396315/permalink/2197503517315393/", "likes": 1, "comments": [{"username": "Elena Eugeni", "comment_text": "There is a lot to see in Naples. You can spend a few hours in Museo Archeologico, since they have a lot of findings from Pompei and Ercolano. Or you can take a walk to the seafront promenade. Museo di Capodimonte, with its gardens, is awesome as well. Palazzo Reale is a short visit but really worth it, and you can see a beatiful view of the harbor if you visit the rooftop gardens as well (2 euros, need to be booked online)."}, {"username": "Elena Eugeni", "comment_text": "The view from Palazzo Reale"}, {"username": "Claudia Amp", "comment_text": "Certosa di San Martino in Vomero area; great view of Naples. Chiostro di Santa Chiara, beautiful beautiful majolica cloister and peaceful to walk around."}]}, {"id": "2197509067314838", "text": "Florence lunch question… I have two lunch periods “free” while we’re in Florence. I have a few thoughts - looking for opinions on which would be best:\n1. Osteria Pastella - I LOVE truffles and the pasta finished in the cheese wheel looks great\n2. Ciro & Sons - I love Neopolitan pizza and this place has great reviews (that I’ve seen)\n3. Mercatoआणखी Centrale - we are going there for sure, but not sure if we should plan breakfast or lunch there? I’m kind of trying to figure out the market.\n\nIs there something I’m not considering? We are staying right next to the Uffizi so anywhere in the city center is close.", "link": "facebook.com/groups/1373361046396315/permalink/2197509067314838/", "likes": 2, "comments": [{"username": "Carolyn Chambers Rosamilia", "comment_text": "Please don’t try to plan every meal. Surprise yourself. Be spontaneous."}]}, {"id": "2197517043980707", "text": "Hello! Family of 4 heading to Amalfi in mid-August. Looking for advice for these three things:\n1- Cooking class that is simple- like maybe just pizza? (to do with 16yo son)\n2- Full day boat tours (also- do these boats ever have bathrooms on them?)\n3- Are massages a thing there? Like for a special treat to hire someone to come to your home and provide one?\nThank you in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2197517043980707/", "likes": 0, "comments": []}, {"id": "2197517103980701", "text": "Looking to book a private water taxi for my wife and I from Santa Lucia train station to our hotel while going thru Grand Canal. Anyone have suggestions on which water taxi company they like?", "link": "facebook.com/groups/1373361046396315/permalink/2197517103980701/", "likes": 2, "comments": []}, {"id": "2197515437314201", "text": "I’m planning a trip to Sardinia in October. We will be renting a car and would appreciate any recommendations. My husband and I are over 70 which usually means additional costs.\nThanks for your help", "link": "facebook.com/groups/1373361046396315/permalink/2197515437314201/", "likes": 0, "comments": [{"username": "Kay Rendall", "comment_text": "Visit Alhergo a lovely interesting old town. Stay in the centre, I stayed in ex monastery. Also Calaghari was great town to visit.\nI am 70's travelled bus and train, so easy. Visited Olbia, Esmerlda Coast (not my favourite) plus the island of La Magdellena by ferry. Lovely, 1 day not enough. Didnt visit beach areas. Young 70's"}, {"username": "Gioia Clari", "comment_text": "Check \"Autunno in Barbagia\", a series of local festival all around Barbagia little towns (the area in the center of Sardinia) to see where you can find it when there - you will find local customs and food in a very peculiar and typical framework. The program is usually shared around mid-September. Alghero is very nice indeed, la Maddalena Island is wonderful if the weather is still warm and sunny. If you go around Cagliari and like historical sites, I'd suggest you to stop in Barumini to Su Nuraxi (great example of the nuragical civilization) and Nora archeological site. You'll find plenty of places to eat in Cagliari, but I'll definitely suggest \"Ci pensa Cannas\" - it is a very down-to-earth place where you can enjoy yummy fish dishes for a good price. When wandering around Sardinia make sure you have Google translator available just in case. If you tell me what you'd like to see/do I may have other suggestions for you :)"}, {"username": "Greg Saba", "comment_text": "We booked our car in Sardinia through AutoEurope, a highly regarded broker. One big advantage is that they often provide an option of full insurance for a price a lot less than the surprise you usually get at the desk. We spent 8 nights and did a report on Fodors, based in Alghero and Cagliari. We did a lot of driving, but be aware driving at times on some roads can be slow going. We did love Sardinia and often had the roads to ourselves."}]}, {"id": "2197519177313827", "text": "I was just reading this thread and lost it, can anyone point me to. I can't seem to see it", "link": "facebook.com/groups/1373361046396315/permalink/2197519177313827/", "likes": 33, "comments": [{"username": "Laura Bolzic", "comment_text": "Did they use a rocket ship from Naples to Rome? That’d be the only way to get them there in 10 minutes 😂😂😂😂"}, {"username": "Vivienne Smith", "comment_text": "It takes hours by super quick train from Naples to Rome. Something wrong here lol"}, {"username": "Albu Andreea-Mihaela", "comment_text": "In november of last year i went from ciampino airport to our hotel in the termini area and the drive was about 45 minutes at noon..i believe they teleported from naples to rome🤣🤣"}, {"username": "Alfonso Ingenito", "comment_text": "I can understand the error it’s been very hot and the heat does strange things to a brain lol 😆"}, {"username": "Kim Aranha", "comment_text": "Typo for sure.\nIt’s over 200 kilometers and at least 2 hours steady driving - the Freccia Rossa can do it in 1.5 hours I think."}, {"username": "Julie Norris", "comment_text": "I thought it was a joke post 😂"}, {"username": "Lisa Jones", "comment_text": "It’s around 2 hours from Napoli to Rome, isn’t it?"}, {"username": "Lisa Jones", "comment_text": "I wonder if it’s AI?"}, {"username": "Jo Dal Santo", "comment_text": "The information about most of the sites being close and an easy walk between them all is accurate. The 10 min trip, absolutely not."}, {"username": "Giada Todaro", "comment_text": "1h and few mins by train. Prolly she just made a mistake writing this post"}, {"username": "Jo Harmel", "comment_text": "I copied it to read later -\n\nHelllo all. I just came back from 13 amazing days in Italy and wanted to provide some tips and insights that I learned while there. We did 4 days in Rome and then 7 days in Amalfi coast (our house we stayed at was actually Massa Lubrenese which is quieter, then did day trips). We were there the first two weeks of July and it was HOTTTT. Granted it was a heat wave affecting Spain and Europe, high 80s and high humidity percentage each day (60-75%) making it feel hotter.\n\nWe landed in Naples airport and took a taxi to our Rome hotel, it was easy and a quick 10 mins drive. We got the ground running, saw the Trevi fountain, Piazza Novana, & Pantheon. All three of those are super close to each other. And there are PLENTY of restaurants for lunch or dinner around that area.\nNext day was the Vatican tour. We chose the private tour our travel agent booked for us. We got there the second they opened to beat the heat. It was a 4 hour tour of the Vatican museum, Sistine Chapel, and St. Peter’s Basilica.\n* Few things here. Get water once you go through security and use the bathroom. They have vending machines with water right when you walk in. They’re no fountains here to fill up reusables.\n* It’s hot, no AC. Wear cool clothes. I wore a dress that was light weight material that covered my knees and brought a sweater to put over my shoulders for the Chapel and Basilica. My boyfriend wore light weight pants (have to cover knees) and a shirt sleeve button up, also lightweight material.\nAfter the tour, it was about 12:30 and we grabbed lunch at Bar Vitti in Piazza San Lorenzo in Lucina. It was soo soo yummy, they have gluten free options as well if that is a concern for you, (my bf is celiac)The Spanish steps are also over here along with high end shops like Louis Vuitton.\n\nNext day was The Colosseum, Rome Forum, & Palatine hill. Words cannot describe how beautiful this tour was. But also, words cannot describe how hot it was. There’s limited to no shade throughout this whole tour. There are fountains where you can fill up your water bottles which was nice. But if you can go as early as possible, because by the time we got out around 11:30 or 12, the heat and sun was almost unbearable.\n\nOur last day in Rome we saved for shopping and casually roaming the streets with no set time schedule. I did schedule an appointment to go into the Louis Vuitton store because there was some thing I wanted to buy, I do recommend scheduling an appointment if you are interested in doing that.\n\nWe left for Amalfi by train from Rome to Napoli Centrale, it was an hour train ride non stop. So easy, makes penn station look mediocre if you’re from New York, or New Jersey, you know what I mean.\n\nOur house was in Massa Lubrenese, which was about an hour and a half from Naples.\nIt was supposed to be 30 mins from Sorrento and 60 mins from Positano. But traffic during July and august are HORRIFIC. Taxis are suspended so you have to rely on private car services or public transport.\n\nFirst day we chartered a private yacht that took us around the island of Capri. We also did the blue grotto tour, HIGHLY RECOMMEND.\n\nDay 2 tour of Pompeii, highly recommend also VERY VERY hot.\n\nDay 3 we got on the ferry from Positano, and toured Ischia. Could’ve skipped this day but it was beautiful.\n\nDay 4 Sorrento. Perfect for shopping, we ate at Donna Sofia, which was sooo good. The whole restaurant is an ode to Sofia Loren.\n\nDay 5 Positano, Pupetto Beach club on Fornilo Beach. AMAZING. 60 euro per person, we had to lounge chairs and an umbrella. You get a waiter to bring you food and take orders. The food itself was pretty reasonable. We had a total of four alcoholic drinks, two bottles of water to lunch, entrées and french fries and it came to €150.\n\nHope this helps! Feel free to ask me any questions. In the comments you can tag me I may have missed some things. My brain is still on European time so I’m still trying to adjust."}, {"username": "Kathi Carroll", "comment_text": "I know Italians drive fast, but…"}, {"username": "Kerry Aldred", "comment_text": "Just tagged you in the post comments"}, {"username": "Steph Craddock", "comment_text": "I think they're confused ..they really didn't land in Naples and get a quick 10 min taxi ride to Rome! Unless they had a time machine? 🤔 It's a few hours Naples - Rome."}, {"username": "Jo Tunnicliffe", "comment_text": "What was he driving a fighter jet?!"}, {"username": "Bill Bowler", "comment_text": "HOLY JEBUS the author in the original post admitted they wrote it wrong. Give it a break on the 10 minutes please!!! She meant FCO to Rome not Rome to Naples. Typos happen everyday, good gawd people."}, {"username": "Maria Hines", "comment_text": "Naples is not a 10 minute trip to Rome"}, {"username": "Rebecca Carroll", "comment_text": "Why go to Rome and shops designer though when you have so many beautiful things to see and do and eat…. Shopping wasn’t in the top 1,000 of things I wanted to do"}, {"username": "Jerry Kiger", "comment_text": "Not sure you got info, search the 1st sentence here is pic of the name … saw full was reposted not sure you wanted the name to reference? Lot of\nComments on that thread"}, {"username": "Michele Wilson Joseph", "comment_text": "I need to find that taxi! 😂"}, {"username": "Maria Angela Perrone", "comment_text": "Wow! Wonder woman was in Italy! 10 minutes from Napoli to Roma 😂"}, {"username": "Helen Wake", "comment_text": "Seems fake to me...."}, {"username": "Robin Barbera", "comment_text": "It is 222K from naples to rome. Impossible to do it in 10 minutes.."}]}, {"id": "2197519823980429", "text": "Anyone had the pleasure staying at any of these hotels? Reviews can be tricky so thought I would ask.\n\nHotel Monte Cenci in Rome\nRelais Balcone di Giulietta in Verona\nPalazzo Veneziano in Venice.", "link": "facebook.com/groups/1373361046396315/permalink/2197519823980429/", "likes": 1, "comments": []}, {"id": "2197519927313752", "text": "Florence for 3 nights. Where have you stayed that you can recommend for a couple?\nHotel or AirBnb is good.\nTIA", "link": "facebook.com/groups/1373361046396315/permalink/2197519927313752/", "likes": 2, "comments": [{"username": "Maureen McCall Bradley", "comment_text": "We stayed at an Airbnb through Chiara 5 Senses. We booked direct. Antonella was amazing!!!"}, {"username": "Carolyn Schwab", "comment_text": "Last time we went we stayed at Hotel Rosso 23, absolutely loved it. I could've lived there ❤️"}, {"username": "Veronica Mendez", "comment_text": "Grand Hotel Baglioni Firenze"}, {"username": "Stacy Prestigiacomo", "comment_text": "We stood at this airbnb , was very nice and clean . Also close to duomo"}, {"username": "Nancy Kirby", "comment_text": "Hotel Alessandra"}, {"username": "Caryn Goode", "comment_text": "Hotel Realis Uffizi. Great location."}, {"username": "Shannon Pettigrew", "comment_text": "Thank you so much! I’ll go check out these places. Much appreciated."}, {"username": "Alex Kovacs", "comment_text": "Hotel Calimala"}, {"username": "Mary Wallace Comunale", "comment_text": "We loved Hotel Cavour. Great location A block from the Doumo and has a rooftop bar with great views."}, {"username": "Lewis RC", "comment_text": "We loved Hotel Berchielli. Right on the Arno River, very close to the Ponte Vecchio and easy walking distance to everything, great service, etc."}, {"username": "Gretchen Abee Rombold", "comment_text": "We were just there and stayed at Glance hotel. Everything was walkable, free breakfast buffet and a rooftop pool for the hot afternoons with a pool bar. Also very close to the train station."}, {"username": "Suzi Gioffredi Lincoln", "comment_text": "Hotel Torre Guelfa!!"}, {"username": "Anthony LoBue", "comment_text": "Love the air bnb that we stayed in Florence."}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "Fantastically stylish boutique hotel in the heart of Florence. Amazing breakfast. Casa G"}, {"username": "Lisa Jane", "comment_text": "Kairos by Florence art apartments - stunning and central http://\nkairos-by-floren\nce-art-apartmen\nts.florence-hot\nels-it.com/en/\n#main"}, {"username": "Lisa Jane", "comment_text": "Kairos by Florence art apartments - stunning and central ⭐️⭐️⭐️"}, {"username": "Nicole Beaumont", "comment_text": "Hotel Duomo Firenze"}, {"username": "Kathy Holden Reams", "comment_text": "Hotel Spadai. Can’t say enough good things about the location and everything else about it! The breakfast was amazing too"}, {"username": "Josette Bartolo", "comment_text": "BSJ15 Borgo San Jacopo room"}, {"username": "Maria McGill", "comment_text": "Hotel Perseo"}, {"username": "Candy Mattiello", "comment_text": "The J and J …"}, {"username": "Andrew Wilson", "comment_text": "https://\nwww.leonardodv.c\nom/it/"}, {"username": "Andrew Wilson", "comment_text": "We stayed here very nice hotel"}, {"username": "Ave Maria Vescovo Brown", "comment_text": "Hotel Torre Guelfa"}]}, {"id": "2197523050646773", "text": "Best cooking class in Tuscany? Near San Quirico d’orico?", "link": "facebook.com/groups/1373361046396315/permalink/2197523050646773/", "likes": 0, "comments": []}, {"id": "2197524127313332", "text": "My Magnificent founding in Italy!\n\n🇮🇹 Civita di Bagnoregio\n🇮🇹 Tivoli", "link": "facebook.com/groups/1373361046396315/permalink/2197524127313332/", "likes": 3, "comments": []}, {"id": "2197526163979795", "text": "I am an avid reader. I need to read every night before I go to bed. I am traveling to Italy in October, going from Milan to Alba to the Cinque Terra to Florence to Rome. I'd like to read something related to Italy while I'm traveling, fiction or non-fiction. Suggestions?", "link": "facebook.com/groups/1373361046396315/permalink/2197526163979795/", "likes": 75, "comments": [{"username": "Amber Valvano", "comment_text": "I loved one Italian summer"}, {"username": "Rhona Gordon", "comment_text": "How about The Glassblower of Murano... but that might make you want to add Venice to your itinerary! :)\nOr: One Italian Summer... but that might make you want to add Positano to your itinerary! ;)\nBoth are haunting and so of the area."}, {"username": "Mette Høllund Sloth", "comment_text": "Perhaps Dan Browns books Inferno and Angels and Demons, takes place in Rome, Florence etc."}, {"username": "Josefina Riquelme", "comment_text": "Following"}, {"username": "Caroline Mitchell", "comment_text": "3 books to recommend:\nIl Gattopardo or the Leopard-set in Sicily\nRoom with a view- set in Florence\nExtra Virgin - set in Liguria\nEnjoy!"}, {"username": "Tamara Nopo", "comment_text": "Dan Brown: Inferno / Angels and Demons"}, {"username": "Yelhsa M Nehpets", "comment_text": "Inferno by Dan Brown xx"}, {"username": "Peggy Lozauskas", "comment_text": "The Reluctant Tuscan by Phil Doran."}, {"username": "Diane Firlotte", "comment_text": "Following"}, {"username": "Carol Millman", "comment_text": "Beautiful Ruins"}, {"username": "Adela Primiano", "comment_text": "One Italian summer,Rebecca Serle—the Italian Villa,Daniela Sacerdoti"}, {"username": "Kristen Haas", "comment_text": "Beautiful Ruins is very good. And the My Brilliant Friend series!"}, {"username": "Mariët Eertman-Heemstra", "comment_text": "Under the Tuscan Sun."}, {"username": "Marie Derry", "comment_text": "Still Life by Sarah Winman, The Italian Girl by Lucinda Riley and The Temptation of Gracie by Santa Montefiore"}, {"username": "Nancy Opremcak", "comment_text": "Before we went this past April I read Oil and Marble (about da Vinci and Michaelangelo) as well as Raphael (another renaissance painter) Both novels by Stephanie Storey and I really liked them both."}, {"username": "Jamie Vance", "comment_text": "4 seasons in Rome! It’s a great book and you learn a lot about Rome!"}, {"username": "Christine Byrne", "comment_text": "One Italian Summer"}, {"username": "Christine Byrne", "comment_text": "F"}, {"username": "Jane Lindsay", "comment_text": "The Rome Affair by Karen Swan."}, {"username": "Bronwyn O", "comment_text": "I'm not usually a non-fiction reader (not that I don't, but I have to be in the right headspace and can only handle so much at a time generally), however, I had no problem getting into and enjoying Sicily: An Island at the Crossroads of History by John Julius Norwich. I actually did find myself reading it just for fun. It's a fairly large book though, so only bring if you're not worried about weight and space."}, {"username": "Deborah Jewison", "comment_text": "The Enchanted April by Elizabeth von Arnim. Portofino by Frank Schaeffer."}, {"username": "Scott Perry", "comment_text": "Trieste and the Meaning of Nowhere by Jan Morris is pretty terrific too!"}, {"username": "Anne Davidson", "comment_text": "Invest in a kindle or fet the app on your ipad and buy books thru amazon. Nothing worse that running out of books snd not able to buy ones in english."}, {"username": "Michele Cook", "comment_text": "Check out the Donna Leon series\nVery good"}, {"username": "Janine Colon Cipollone", "comment_text": "My brilliant Friend by Elena Ferrante. HBO turned it into a series as well. Loved the books and the series"}, {"username": "Mary Brandon", "comment_text": "A Room with a View"}, {"username": "Sandra Paul", "comment_text": "Her Tuscan Summer by Vanessa Carnevale"}, {"username": "Jessica Marks", "comment_text": "Paolo Cognetti!\n\nhttps://\nwww.theguardian.\ncom/books/2018/\nmar/18/\neight-mountains-\npaolo-cognetti-\nreview"}, {"username": "JA Var", "comment_text": "RHYS ￼ BOWEN\n￼ The Tuscan child\n\n￼ The Venice sketchbook\n￼ By the same author\n\n￼ The glass blower of Milano\n￼ By marina\n￼ FIORATO"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "Denise Kelso"}, {"username": "Rhonda Bean Hendershot", "comment_text": "Rick Steves guide books for each location!!"}, {"username": "Catherine Sincovich Kerr", "comment_text": "Beach Music"}, {"username": "Bronwyn Lyons", "comment_text": "A Room With A View.\nE. M. Forster"}, {"username": "Cheri Kimple Travis", "comment_text": "Following! Thx!"}, {"username": "Janet Sorah", "comment_text": "A Rosie Life In Italy. It is wonderful and a true adventure about a couple from Ireland who moved to Rome...truly entertaining!!!"}, {"username": "LeAnne Cantrell", "comment_text": "Beautiful Ruins!!\nOutstanding read set in the Cinque Terre in the 1960s when (hilariously drunken) Richard Burton and Liz Taylor were in Rome shooting Cleopatra.\n\nIt has flash forwards to Hollywood in the 80s when reality TV was just getting rolling and to the Seattle grunge music scene too.\n\nPoignant, sharp, and funny."}, {"username": "Melissa Elliott", "comment_text": "One Italian Summer"}, {"username": "Randee Shade Shafer", "comment_text": "Great question! Love all the ideas. Some advice if you read on your phone at night- bring a long charging cord. When I was in Italy recently the outlets in the room were rarely near the bed. May have just been my experience but I was happy to have long cord for reading and charging at night. 😊"}, {"username": "Patty Ryan", "comment_text": "Under the Tuscan Sun"}, {"username": "Sandy Hookerman Kriger", "comment_text": "Under the Tuscan Sun"}, {"username": "Joanne Izenberg", "comment_text": "Eternal by Lisa Scottine. WWII in Jewish Ghetto in Rome. Amazing book 💜 Fiction but based on fact.\nThe Italian Escape- Catherine Mangan\nTo Italy with Love by Nicky Pellegrino. Easy holiday read 😊"}, {"username": "Julie Neighbors Porter", "comment_text": "Four Seasons in Rome, by Anthony Doerr. A delightful, transportive book by a wonderful author (All the Light We Cannot See). 💕"}, {"username": "Kathryn Healy", "comment_text": "I enjoyed Stanley Tucci’s Searching for Italy"}, {"username": "Raf Gervasio", "comment_text": "Stanley Tucci Taste....its funny and very italian makes you hungry too"}, {"username": "Olga Pasfield", "comment_text": "Ciao Bella, Kate Langbroek"}, {"username": "Kristin Perry Adams", "comment_text": "Four Seasons in Rome by Anthony Doerr. Non-fiction. I’ve read it three times because his writing is so descriptive and it transports me back."}, {"username": "Pat Dalton", "comment_text": "What a wonderful book!!"}, {"username": "Anne-Marie Colgan-Monahan", "comment_text": "One Italian Summer by Rebecca Serle 📚"}, {"username": "Marnie Morrione", "comment_text": "Older one (1908) but a classic…A Room with a View by English writer E. M. Forster"}, {"username": "Kasia Sobierajska Sroka", "comment_text": "I am so happy to read all these comments, I will have a lot to read😄🥰"}, {"username": "Sara Punis", "comment_text": "My brilliant friend ( 4 books) it deserves a nobel"}, {"username": "Cheryl Trigg", "comment_text": "A thousand days in Tuscany (also Venice) by Marlene de Blasi a true story. You’ll love it."}, {"username": "Chris Gambino", "comment_text": "Still Life by Sarah Winman was wonderful."}, {"username": "Holly Davidson White", "comment_text": "Holly Davidson White"}, {"username": "Holly Davidson White", "comment_text": "Holly Davidson White"}, {"username": "Holly Davidson White", "comment_text": "Holly Davidson White"}, {"username": "Susan Baitala Finn", "comment_text": "Susan Baitala Finn"}, {"username": "Tracy McKean", "comment_text": "The Agony and ecstasy written by John Irving is a must!"}, {"username": "Alease Mullen Higgins", "comment_text": "Following"}, {"username": "Tana Muraro Sheets", "comment_text": "Under the light of the Italian Moon is an excellent read. Author is Jennifer Anton."}, {"username": "Maria Marena Greenslade", "comment_text": "Danielle Steel’s novel Palazzo!!"}, {"username": "Laura Shojaei", "comment_text": "I loved Whereabouts by Jhumpa Lahiri. Set in Italy, written in Italian. I read the English translation."}, {"username": "Cindy Corrigan", "comment_text": "One Italian Summer - it’s excellent"}, {"username": "Sandra Kingsley", "comment_text": "Under the tuscan sun!"}, {"username": "Bobbie A. Lewis", "comment_text": "Can I purchase it in hardcover?"}, {"username": "Connie Vitale", "comment_text": "I just read the Venice sketchbook and loved it!"}, {"username": "Jill Ledgerwood", "comment_text": "Still Life is the best summer book."}, {"username": "Jeanette Petrie", "comment_text": "Nicky Pelligrino has some lovely books. Her stories are based around little villages in the Puglia area."}, {"username": "Isabelle Morgante", "comment_text": "Les lions de Sicile en 4 tomes"}, {"username": "Charlotte Perry Henrichs", "comment_text": "Read the series beginning with My Brilliant Friend by Elana Ferrante."}, {"username": "Fetchin Gretchen", "comment_text": "Caveat that I have not read all of these! Some suggestions for books to read before your trip to Italy:\n\n**Fiction**\n\n* **The Leopard** by Giuseppe Tomasi di Lampedusa: This classic novel tells the story of a Sicilian noble family during the Risorgimento. It's a beautiful and moving book that will give you a deeper understanding of Italian history and culture.\n\n* **My Brilliant Friend** by Elena Ferrante: This Neapolitan novel series is a must-read for any fan of historical fiction. It follows the lives of two friends from childhood to adulthood, and it's a fascinating look at Italian society and culture.\n\n* **Under the Tuscan Sun** by Frances Mayes: This memoir tells the story of a woman who buys a villa in Tuscany and falls in love with the country. It's a heartwarming and inspiring read that will make you want to pack your bags and head to Italy right away.\n\n* **A Room with a View** by E.M. Forster: This classic novel is set in Florence and tells the story of a young woman who finds love and self-discovery in Italy. It's a charming and romantic read that will make you want to explore Florence for yourself.\n\n* **Love & Gelato** by Jenna Evans Welch: This young adult novel is set in Rome and tells the story of a teenage girl who travels to Italy to meet her father's family. It's a fun and heartwarming read that will make you want to fall in love with Rome.\n\n**Non-fiction**\n\n* **The Food of Italy** by Rick Steves: This book is a great introduction to Italian cuisine. It covers everything from pasta to pizza to gelato, and it's full of delicious recipes.\n* **The History of Italy** by John Julius Norwich: This book is a comprehensive overview of Italian history from the Roman Empire to the present day. It's a great way to learn about the rich and complex history of Italy.\n\n* **La Bella Figura** by Beppe Severgnini: This book is a humorous look at Italian culture. It's full of insights into Italian customs and traditions, and it will make you laugh out loud.\n\n* **The Italian Way** by Frances Mayes: This book is a collection of essays about Italian life and culture. It's a great way to learn about the Italian way of thinking and living.\n\nI hope this helps!"}, {"username": "Esther Kim", "comment_text": "The House in Amalfi by Elizabeth Adler; A Villa in Sicily mystery series by Fiona Grace; Italian Ways: On and Off the Rails from Milan to Palermo by Tim Parks. And a perennial favourite, Under the Tuscan Sun by Frances Mayes."}, {"username": "Carole Mackewich", "comment_text": "If you like historical fiction, Under a Scarlet Sky would be a good choice!"}, {"username": "Bonnie Cope", "comment_text": "One Italian Summer ❤️"}, {"username": "Lisa Verlinger Guarino", "comment_text": "Followimg"}, {"username": "Stephanie Overton", "comment_text": "Thank you to everyone, enjoying reading all the tips and experiences you have given me. Hoping and planning our ultimate dream trip hopefully in a couple of years. Keep it coming and looking forward to one day soon getting there.🙂"}, {"username": "Mary Jean Petrucci", "comment_text": "The Inspector Bordelli series by Marco Vicchi"}, {"username": "Helene Moccia", "comment_text": "A boatful of Lemons\nBy Nicky Storey\n(Set in POSITANO)\nAvailable on Amazon"}, {"username": "Margaret Mackenzie", "comment_text": "Under a Tuscan Sun"}, {"username": "Donna Parrish", "comment_text": "Under The Tuscan Sun"}, {"username": "Sue Daglish", "comment_text": "Still life"}, {"username": "Miyuki Kanno Paul", "comment_text": "I read guidebooks!!"}, {"username": "Jane Allison Frenzel", "comment_text": "Under the Tuscan sky"}, {"username": "Lisa Frahm", "comment_text": "Beneath the scarlet sky, Scratch, Under the Tuscan Sun, Taste by Stanley tucci"}, {"username": "Joy Price Morriss", "comment_text": "Italian Lessons."}, {"username": "Lyn Evans", "comment_text": "I love this author.. she has quite a few all based in Italy."}, {"username": "Fiorenza Susin-Carrey", "comment_text": "The midwife of Venice by Roberta Rich…excellent!\n!"}, {"username": "Lora Ruscitti Covington", "comment_text": "Lora Ruscitti Covington"}, {"username": "Jen Lewis", "comment_text": "The Birth Of Venice….Sara Dunnart."}, {"username": "Ruth Newell", "comment_text": "I'm sooo glad you posted this question. My reading list just grew- exponentially! Thank you!"}, {"username": "Billie Frances Swanda", "comment_text": "Eat pray love. Just read the eat part"}, {"username": "Laura Di Martino - Kempt", "comment_text": "Italian Neighbours by Tim Parks. He’s British but has been a lecturer at Verona University for decades"}, {"username": "Donna Parrish", "comment_text": "Eat Pray Love?"}, {"username": "Nancy M. Rose", "comment_text": "Loyalty by Lisa Scottoline"}, {"username": "Lori Broin", "comment_text": "Italian Summer"}, {"username": "Whitni Henderson", "comment_text": "Whitni Henderson"}, {"username": "Wendy Harrison", "comment_text": "If you like mysteries, try Andrea Camilleri. Set in Sicily."}, {"username": "Maria LaPietra Guerrero", "comment_text": "Beneath the Scarlett Sky\nThe love letters of Olivia Morretti\nThe Venice Sketchbook\nThe fours seasons of Rome\nThe Star Crossed Sisters of Tuscany\nThat month in Tuscany\nLove and Gelato\n\nHappy Reading 🙂"}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "A heartwarming story/memoir which beautifully references the Italian culture, people and language. It’s exactly how I felt after my first and subsequent 4 other trips to Bella Italia!"}, {"username": "Kristin Owens", "comment_text": "From Scratch! Great book and there’s a series on Netflix too."}, {"username": "Paula Brink", "comment_text": "Roma by Steven Saylor"}, {"username": "Maryellen Gustafson", "comment_text": "under the Tuscan sun"}, {"username": "Linda Johnson", "comment_text": "Agony and Ecstasy"}, {"username": "Liisa M. Valo", "comment_text": "Street Fight in Naples"}, {"username": "Stephen Henn", "comment_text": "The Agony & the Ecstasy by Irving Stone"}, {"username": "Sarah Nelson", "comment_text": "This is an amazing compilation and suggestions! Thank you everyone for contributing!! I’m heading to Italy later this year and now have my reading list!!"}, {"username": "Nina Heller", "comment_text": "Beautiful ruin"}, {"username": "Carrie Gaudio", "comment_text": "My Brilliant Friend"}, {"username": "Janet Jamieson Thomson", "comment_text": "Eat pray and love, by Elizabeth Gilbert"}, {"username": "Carole Garron", "comment_text": "Books by Lisa st aubin de teran: The Slow Train to Milan, Elements of Italy, A Valley in Italy. And of course Mary McCarthy’s The Stones of Florence."}, {"username": "Meredith Holloway Helbon", "comment_text": "Following"}, {"username": "Marilyn Baron", "comment_text": "Lisa Scottoline’s Eternal."}, {"username": "Diane Petonito Giordano", "comment_text": "See if u can get Eyewitnesses Guides. They have books on all different countries. I have one about Italy & it breaks all the areas down. What u can go see, food, etc. I found them to be very interesting. A lot of places I never heard of. Just such a beautiful Country. Enjoy"}, {"username": "Linda Baker", "comment_text": "Beneath a Scarlett Sky. I couldn’t put it down. True story from WWII. FANTASTIC!!"}, {"username": "Shelby Musselman Dickman", "comment_text": "Our Italian Summer by Jennifer Probst (different book than One Italian Summer…which is also good, especially if going to Positano!)"}, {"username": "Jazz Caldwell", "comment_text": "Under the Tuscan Sun and of course there's always Romeo and Juliet."}, {"username": "Jill Delk-Roddick", "comment_text": "Eternal by Lisa Scottoline, historical fiction, Rome, the audiobook was lovely!"}, {"username": "Rosemary Vaccaro- Dutra", "comment_text": "Gina Stang Check out the great reads!"}, {"username": "Michelle Thrasher", "comment_text": "The Decameron by Giovanni Boccaccio"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "About Piedmont check if you find something by Cesare Pavese, 5 Terre something written by Bruno Morchio, Florence I would say to read some of the short stories of Boccaccio.\nFor true italian spirit check Giuseppe Tomasi di Lampedusa, Federico de Roberto, Giovanni Verga.\nI don’t know what you’ll find in english, but these books will give you a glimpse of Italian soul, not a tourist fanfiction 😁"}]}, {"id": "2197529137312831", "text": "Wife and I had a fabulous holiday in Tuscany in early May of this year. The weather was fairly warm, but as you know, no air conditioning until June.\nSo we slept with windows open, but there are no screens. So my wife got eaten alive.\nAny advise on this or is the only option to go to sleep with bug repellent on?\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2197529137312831/", "likes": 1, "comments": [{"username": "Ellen Edmonds-Wilson", "comment_text": "Plug in bug killer. Our hotel in Venice has them in the room but we didn’t need them because it was hot and the windows were closed and the a/c on."}, {"username": "Lauren-Jade Roberts", "comment_text": "Avon skin so soft"}]}, {"id": "2197529230646155", "text": "Will be flying solo for first time to Rome. How difficult is it to navigate FCO airport for both arrival and departure? Will be flying Delta. Think I am more worried about arriving departure with check in etc so just trying to plan ahead since will be alone.", "link": "facebook.com/groups/1373361046396315/permalink/2197529230646155/", "likes": 5, "comments": [{"username": "Jenny Payne", "comment_text": "It’s not difficult, I come from Australia, and just follow the crowd, from memory last February,one queue for European citizens and rest for all the other countries. Just be organised. have your passport in hand, I never wear a belt + anything that will set the security off . I also organise a driver from airport as it’s 23 hours travelling from Australia, but it isn’t difficult catching the airport train to the termini, the taxis from termini can rip you off if your not careful so use RometoRio app & work out how much to your accommodation,i\nf the first taxis seems 2 much go to the next guy in line 🌻"}, {"username": "Rebecca Marshall", "comment_text": "It’s literally no different than arriving/\ndeparting from any other airport. It’s well marked and plenty of signage."}, {"username": "Eileen Steiniger", "comment_text": "Easy airport to navigate. But strongly recommend that you get there 3 hours prior to departure. Took a while to get through customs."}, {"username": "Tari Lawson", "comment_text": "It's relatively easy, but if you have difficulty, you can ask for help. I have found the airport employees very helpful."}, {"username": "Danielle Johnston", "comment_text": "It’s easy"}, {"username": "Janet Isaacs Lanza", "comment_text": "There are pretty good signs directing you."}, {"username": "Traci Raymer", "comment_text": "Arrival has at least three terminals so check which terminal to check in then find delta. We flew delta into Rome and got off at terminal 3 and flew ITA to Sicily which was terminal 1"}, {"username": "Olga Olga", "comment_text": "If possible, do not check bags, only bring carry on bags. You’re a tourist, you don’t need fancy clothes, only casual and comfortable. They lost our checked luggage and we were without clothes for 4 days. Also, remember to be at the airport a minimum of 3 hours before your departure time."}, {"username": "Sharon Menegoni", "comment_text": "Arrival at FCO is a breeze! Just follow the signs (and the crowd.....)"}, {"username": "Leila Jane", "comment_text": "One word of caution which I myself did not heed so I offer it to you ~ do not accept an offer for a taxi ride from anyone INSIDE the airport. By law, taxi drivers are supposed to wait OUTSIDE the airport and the fare to Rome is also set by law to be no more than 48 euros. We were tired and not thinking clearly when we arrived and got scammed by a driver who came inside the airport by baggage claim while we were waiting for our luggage and then charged us like 4 times the going lawful rate. We didn't find out until later."}, {"username": "Greg Saba", "comment_text": "Easy to navigate, although walking from arrival gate to customs can be quite long. Great terminal with quality food. Eataly is our favorite. Our terminal in June had opera singers performing. Soothing."}, {"username": "Stella Dee", "comment_text": "Very easy to navigate and all signs are in English."}, {"username": "Linda Pitler", "comment_text": "It’s easy and there are signs (in English) directing you where to go. When you are ready to leave and you need a taxi, there is a queue that moves pretty quickly. If you are heading to the train, there are ticket machines and lots of signs directing you.\nIt’s not a difficult airport. Have a great trip.\nI do have friends in Rome and they are telling me it’s super hot so plan accordingly."}, {"username": "Adriana Rodriguez-Argueta", "comment_text": "Much easier than many US airports"}, {"username": "Darryl Vanstone", "comment_text": "Rome airport was very quick and efficient compared to most in my opinion"}, {"username": "Jonelle Bindl Gilden", "comment_text": "Very easy! If you do check a bag—- bring a small duffel bag with enough clothes,etc to get by fur a few days in case of lost luggage."}, {"username": "Valerie Collanton", "comment_text": "Arrival is easy. Departure was a little more confusing in finding the correct gate as there are so many international departures. Just give yourself plenty of time and ask someone so you don’t end up in the wrong area."}, {"username": "Lisa Silverman", "comment_text": "Arriving was way more stressful and difficult than departing."}, {"username": "Miyuki Kanno Paul", "comment_text": "It’s easy! Just follow the sign of train icon once exiting the customs hall. Either go outside and go across the street to go up the escalator, or go underground pass to go across the street and go up the escalator to the train station.\nYou will see a taxi sign as well.\nDo not take any offer from share van ride or “need a taxi” calls. Go to the official taxi area with their respective logo on the doors"}, {"username": "Ida Sfo", "comment_text": "Was at FCO in June this year. The set Taxi rate to Central Rome is 50 euros. As noted above - exit the airport and cross toward the Official Taxi stand center island and get in line (which moves quickly so little wait time). There will be traffic police directly cars. Keep a post-it or card with your hotel name & address - show this to your taxi driver and confirm 50 euros. If you prefer a private driver (who holds a sign up with your last name before exiting the airport) the cost is roughly 75 euros but many companies are booked out - it depends on your travel date."}, {"username": "Harris Dee", "comment_text": "Reserved a driver before I left … the negative Nancys, doubting Dennis’, nasty Nathans, crazy Karens and all other rude commenters … Will balk at the prices I paid… 94 euros … the drive into Rome from the airport was filled with a historical lesson and personal anecdotes that was quite inspirational … very relaxing to come off an international flight to a foreign city and see a driver holding signage￼ w your name on it!"}]}, {"id": "2197536853978726", "text": "Looking for a dinner recommendation near Siena. we are celebrating our 25th wedding anniversary and hoping for a unique, enjoyable experience with great food. Thanks so much!", "link": "facebook.com/groups/1373361046396315/permalink/2197536853978726/", "likes": 0, "comments": [{"username": "Gail Vincent Mauney", "comment_text": "Jill Bartley or Judy Baratta. Any ideas? (Our sons were in hs and marching band together)."}, {"username": "Elaine Johnston Corn", "comment_text": "Happy Anniversary 💕💕💕 be right there lol"}]}, {"id": "2197540807311664", "text": "This is the most amazing and helpful site, thank you from a new Europe traveller. (Like very new)\nCan anyone share details and recommendations\nof a great golf cart tour in Rome? 🫶", "link": "facebook.com/groups/1373361046396315/permalink/2197540807311664/", "likes": 1, "comments": []}, {"id": "2197548277310917", "text": "Bonjour , quelqu’un a eu une expérience bonne ou mauvaise avec hellotickets pour une visite du Vatican . Merci", "link": "facebook.com/groups/1373361046396315/permalink/2197548277310917/", "likes": 0, "comments": []}, {"id": "2197552587310486", "text": "What is the best way to get from Venice to Geneva? If flying, which airline is most reliable?", "link": "facebook.com/groups/1373361046396315/permalink/2197552587310486/", "likes": 0, "comments": [{"username": "Louis Des Forges", "comment_text": "There is only 1 airline with direct flights Easyjet."}]}, {"id": "2197561907309554", "text": "Has anyone used Viator for day tours in Italy...specifically the Amalfi Coast? If so, could you please share your experiences? Thank you kindly :)", "link": "facebook.com/groups/1373361046396315/permalink/2197561907309554/", "likes": 0, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2197562403976171", "text": "Hello I’ve been reading previous posts and doing research about travelling to lake Como from Milan for one day. From what I can tell so far it may be best to narrow the day down to catching train in and out of Bateman then catch ferry to Bellagio and visit done if the villas from there. Or wil we see them on the way?\n\nLooking to make the most of oneआणखी day but not do too much. Happy to walk around have lunch maybe visit one villa?\n\nI understand ferry tickets can be hard to come by amd book out so I’m happy to get to varenna early and purchase return tickets etc.\n\nLooking for advice, thanks very much. Any would be appreciated", "link": "facebook.com/groups/1373361046396315/permalink/2197562403976171/", "likes": 0, "comments": [{"username": "Richelle Trezise", "comment_text": "We have booked milan to Varenna. Then the ferry to Bellagio and other places"}]}, {"id": "2197563230642755", "text": "Just came home from a fantastic 17 day stay in Italy. We went for my partner’s conference in Rome, I honestly would not visit in July if my boyfriends conference was not scheduled for this time of year. It’sआणखी lovely, beautiful, magical, but it was extremely hot, packed with tourists. We made the most of it but mostly rested inside during the day while in Rome due to extreme heat. I would say I loved our country side excursions to towns in Tuscany the most. Montalcino is amazing and the entire Val d’Orcia region is incredible. We rented a car with GPS and took the Chiantigiana Road from Florence to Siena and it was lovely. We got a small amount of euros from Bancomats, but mostly used credit card and Apple Pay. Uber was great in Rome, kept me sane and cool from walking around in the heat from site to site. Italians are lively, gracious, and dramatic and it was fun being immersed in their culture. We stayed at fantastic airbnbs and had amazing food. Have fun adventures, stay hydrated, be patient with the crowds and other tourists. Ciao!", "link": "facebook.com/groups/1373361046396315/permalink/2197563230642755/", "likes": 471, "comments": [{"username": "Brenda Hoffman Powell", "comment_text": "Wonderful pictures~IPhone\ncamera or ?"}, {"username": "Margie Williams", "comment_text": "So many favorites from Roma and Firenze! Thank you. You took me there!"}, {"username": "Gina Romano Peralta", "comment_text": "Wow love your pics!!! And thanks for Uber tip in rome. I’ve been researching best ways to get around. Do you have any suggestions for rome hotel or Airbnb"}, {"username": "Phyllis Snyder", "comment_text": "Fabulous reporting! One question is I heard Uber wasn’t good in Rome- in fact rare? Most guide say free now app is better?"}, {"username": "Jackie Sapio", "comment_text": "Awesome pictures!"}, {"username": "Susan Isaac", "comment_text": "Beautiful pictures. Thanks for sharing"}, {"username": "Tammy Jo", "comment_text": "Wonderful pictures!!!"}, {"username": "Terry Pisano", "comment_text": "Love the pics! My hubby and I are taking an art appreciation course this summer as I thought we'd get some culture before our fall trip to Italy. So I recognized several pieces in your post. Our instructor is huge on including street art pop art in his lectures, so I really appreciate those pics as well!"}, {"username": "Diane Petonito Giordano", "comment_text": "I was there last month & it was already hot & crowded. But we also went to the same towns u did. So much fun. I ate & drank my way though Italy. Went to places where the locals go. Everyone was welcoming & fun. Next time go Southern Italy 🇮🇹"}, {"username": "Concetta Geraci", "comment_text": "Wow, beautiful pictures!!"}, {"username": "Penny Chevront", "comment_text": "Great pictures!"}, {"username": "Karin Hoffner Gilbert", "comment_text": "Wonderful! Can you share your air bnb in Rome. We're traveling in September"}, {"username": "Patty Foster", "comment_text": "Our trip was in October. Perfect, low to mid 80s. The world is on fire this year."}, {"username": "Sue Donaldson", "comment_text": "Great photos !!"}, {"username": "Nick Cittadinni", "comment_text": "Who’s the artist of the painting in the 5th pic?"}, {"username": "Donna Holt", "comment_text": "Your photos are amazing! 💖"}, {"username": "Bronwyn Grant", "comment_text": "Gr8 photos❤️thanx 4 sharing"}, {"username": "Judith Ross", "comment_text": "Love your photos"}, {"username": "Handcock Alison", "comment_text": "Wow your photos are fantastic"}, {"username": "Paola Pulga", "comment_text": "Ti aspettiamo nuovamente in Italia 🥰"}, {"username": "Linda Charlene Vaughan Osborne", "comment_text": "Beautiful pictures. Thanks for sharing."}, {"username": "D Rochelle Milton", "comment_text": "Dana Green fantastic photos! Someone mentioned both driving licenses, are you referring the AAA Intl. Driver’s Permit? That’s what I use when driving outside the US. Thnx."}, {"username": "Cathy Robinson Monachelli", "comment_text": "Beautiful pictures"}, {"username": "Lisa Gonzalez Propri", "comment_text": "Great pics! ♥️"}, {"username": "Carolina Alejandro Clabaugh", "comment_text": "Wonderful pictures"}, {"username": "Kathie Duffy", "comment_text": "❤️❤️❤️"}, {"username": "Laura Fox", "comment_text": "Jennifer Johnson"}, {"username": "Bela Soni", "comment_text": "Can you please share airbnb link please"}, {"username": "Bailey Marquis", "comment_text": "How was the drive to Siena? We are going on October, and I am a little nervous about driving abroad!"}, {"username": "Gerri Tronc", "comment_text": "Craig Rickards"}, {"username": "Mary Andreotta", "comment_text": "Lovely photos!"}, {"username": "Cindy Ann Muntz", "comment_text": "When you hired your car did you only need your drivers license plus your international one as well"}, {"username": "Mariposa Mariposa", "comment_text": "Thanks for sharing!! Nice pics!"}, {"username": "Mirka Zembjak", "comment_text": "Amazing photos, love it… thanks for sharing.\n\nI was in Italy mid May - Venice, Florence and the Cinque Terre… and it was already packed with tourist, but loved every bit of it… and you are spot on about the Italians 🙂"}, {"username": "Janine Brailsford", "comment_text": "Beautiful photos! You have a good eye! Love the night time shots!"}, {"username": "Jenny Branthwaite", "comment_text": "Fantastic photos"}, {"username": "Pietro Adami", "comment_text": "Looks like you did not “visit” Italy.\n\nYou “lived” Italy, instead!\n\n👍"}, {"username": "Katherine AliNuñez", "comment_text": "Amazing photos 😍Thank you for sharing!!!"}, {"username": "Khan S", "comment_text": "Plz share your experience with air bnb any link or contact#"}, {"username": "Andrea Romano", "comment_text": "Fabulous photos! Ty❤️🍷"}, {"username": "Toni Cab", "comment_text": "Thank u for sharing prob the pics I have seen yet. Especially because I am planning my trip and I may not make it to David and that area."}, {"username": "Jennifer Quinn", "comment_text": "Gorgeous photos!"}, {"username": "Melissa Welch", "comment_text": "Fabulous photos! Can I ask a couple of questions.\n- Did you hire the car from the actual airport car rentals?\n- How was it driving out of the area of Florence, was it easy?\n\nNot sure if I should hire car from airport or train to Siena and hire car from there.\n\nLast time I went to it was on a bus tour to Florence and Siena."}, {"username": "Amy Accettura", "comment_text": "Great pics!"}, {"username": "Jo Kolbusz", "comment_text": "Did you do a tour ? or skip the queue? Entrance to the Vatican?"}, {"username": "Sarah Nelson", "comment_text": "Great pics and adventures! We are planning on three nights in Siena. Would you recommend where you stayed there? If so, the name of the ?"}, {"username": "Nadia Camier", "comment_text": "Nice photos !"}, {"username": "Steve A Kohler", "comment_text": "Fantastic pics. Was the street artist selling his paintings?"}, {"username": "Laura Allison", "comment_text": "Thank you for your beautiful photos!!"}, {"username": "Susan Maxwell", "comment_text": "Beautiful photos!"}, {"username": "Natalie Correro Clifford", "comment_text": "Beautiful photos"}, {"username": "Heidi Caruso", "comment_text": "Great pictures!! Ty for sharing! I will make it there…one day."}, {"username": "Cindy Valdivia", "comment_text": "Love the photos! Did you take them with a phone?"}, {"username": "Pat Borstorff", "comment_text": "Amazing pictures!"}, {"username": "Andrea D'Aleo Knipfel", "comment_text": "Beautiful photos."}, {"username": "Jan Fargo", "comment_text": "Loved your pictures, took me back 2 years when we were there. It's a magical place."}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "Val d’Orcia region is the best! The Tuscany which shows in all the gorgeous landscape photos! And the culture/people is lovely. Immersing oneself and savoring makes for the most meaningful trip. Glad you had an amazing visit."}]}, {"id": "2197569747308770", "text": "For a trip from Florence to Cinque Terra…\n\nSemi guided tour (bus ride, train/boat tickets)\nVs\nHandling the trip on your own…", "link": "facebook.com/groups/1373361046396315/permalink/2197569747308770/", "likes": 2, "comments": [{"username": "May Mazen", "comment_text": "Up"}, {"username": "Jim-Holly Ballew", "comment_text": "Train on your own- super easy"}, {"username": "Edel Robbins", "comment_text": "We took the train from Florence to La spezia and stayed there. Took the ferry from there which stops at each village.. super easy"}]}, {"id": "2197579593974452", "text": "Looking to rent a car in Venice and dropping it off in Hungary 2 weeks later. Any tips? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2197579593974452/", "likes": 0, "comments": [{"username": "Wade Bailey", "comment_text": "The international drop off fee will be about $1000, not the rental. The rental car agency will have to have the car shipped back to Venice."}]}, {"id": "2197572800641798", "text": "Hello, does anyone know what the Aus to euro exchange rate is in Italy roughly. Just wondering if I should change most of my money in Australia or if I should wait. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2197572800641798/", "likes": 16, "comments": [{"username": "Helen Wake", "comment_text": "Wise card is great. You don't get charged like many cards who charge you conversion fees."}, {"username": "Kelly Kel", "comment_text": "Better rate in Australia and better rate from exchange places than banks and airport. We found cash rate was also better than travel card but then you have to keep it secure or carry with you."}, {"username": "Mia Catalano", "comment_text": "We are here now, we were going to cash $200 today, it would only leave us with 90 euro! We’ve got a wide card the rate is so much better on there! We load our Aussie dollars on to there and then convert to Euro 😀"}, {"username": "Wendy Harrison", "comment_text": "Why not just use an ATM? Exchanging cash of any kind seems fraught."}, {"username": "Leisa Davis", "comment_text": "Download the XE app. You will find it very useful."}, {"username": "Christine Broussard", "comment_text": "Travelex on line is 57c at present but minimal spend is AUD350"}, {"username": "Colleen Lee", "comment_text": "Don't exchange here, use your debit card in a bank ATM, not the random ones on the streets. You will pay a fee however it is still less than buying euro in the banks in Australia, and exchange rates in airports are terrible, exchanging in Italy is also expensive. Talk to your bank, there are some cards which offer cheaper rates. However it doesn't cost that much to make a few withdrawals, factor in $100 au for the 4 weeks, for the convenience of not carrying hundreds of Euro around and you get the conversion rate on the day, sometimes it's up, sometimes down, luck of the draw. Holidays cost money, it's just one of the things you will have to factor in. A cup of coffee is less than $3 in a most places away from the monuments, that alone will save you money, pay cash for things like coffee etc, you shouldn't pull out your card for small purchases. They will love you if you use small change to purchase. Where will you be staying /visiting?"}, {"username": "Brad Nelsen", "comment_text": "€6 = $10"}, {"username": "Narelle Catalano", "comment_text": "Tried to change $200 Australian today would only get 90 euros, not worth it ❤️"}, {"username": "Wayne Simmonds", "comment_text": "Jesus, and you’re travelling wow"}, {"username": "Kim Hosking", "comment_text": "Don’t worry about rate at the moment it will change daily - but the rate against the euro remains fairly constant in the 60 to 65 area. If you work on 62 - 63 you will be accurate all the way through. I’ve alway found paying with debit/credit card works best with just an in case 100 to 200 euro on me for cash if needed. I top the cash up from an ATM as I go"}, {"username": "Lisa Joy", "comment_text": "Thanks for asking the question\nI’ve been wondering the same\nI will be using a St George worldwide wallet account in the main, but the rate on there at the moment is only €58.52\nWholesale is €61\nBank fees are annoying but seem reasonable\nThoughts?"}, {"username": "Helen Ewing", "comment_text": "I found it cheaper to withdraw cash from a bank atm over there using my normal Aussie atm card, and select that your bank will apply the exchange rate. Mind you, we didn't need much cash, but it helps at markets and some places will give you a decent discount for cash."}, {"username": "Lisa Scott", "comment_text": "We always get 200 euros for incidentals from the Adelphi Bank in Chapel St (If you’re in Melbourne). Their rate is always the best and they don’t charge a conversion fee. You can’t just walk in though - call and order the euros at least a week before you go. You need to weigh up the inconvenience of having to drive there and what your time is worth over a travel exchange bureau or just getting cash from an ATM in Europe."}, {"username": "Liz Warren", "comment_text": "Great Question we’re also travelling from Aus and great feedback on the Wise card and how much to bring. Thanks for asking!"}, {"username": "Jane Coutts", "comment_text": "About .5 € per $1AUD it’s shite 😫"}, {"username": "Neal Gibson", "comment_text": "I travel regularly to Italy from Australia and chose to use cash ,therefore exchange before departure.The rates haven’t changed much over my experience roughly 0.62 per aus dollar.Shop around your local exchange sites for your best deal.Ciao ❤️🇮🇹"}, {"username": "Lidia Molinari", "comment_text": "I’m in Italy now don’t change Australian here very bad rate 40 to 50 Australia I was geting 58 to 60 use travel card in italy"}, {"username": "Lauren Vassallo Beattie", "comment_text": "If u have a stop over di it in Singapore if u can they will give u the best rate. There's a bunch of them in Lucky plaza."}, {"username": "Dimity Betar", "comment_text": "Look on Google it’s 60 cents today ,"}, {"username": "Dimity Betar", "comment_text": "I just go to atm and get cash when I’m running low , I try to keep around 100€ in wallet"}, {"username": "Mel Peci", "comment_text": "Never in your country of origin, but in the country when you get there. (I'm Aussie abs just got back)."}, {"username": "Mel Peci", "comment_text": "Don't get cash in your country, it will cost you heaps more (or...just get €50). Only use credit cards designed for international travel (ie. No international transaction fees. No ATM fees). These cards do exist. When using an ATM make sure the ATM you are using, doesn't charge a fee. If it does, withdraw your card and go to another. NEVER USE THE LITTLE ATM's THAT ARE EVERYWHERE. These are PRIVATE ATMs and WILL charge a BIG fee.\n\nOne more thing, I always take 3 or 4 cards. Why? One may get lost/stolen. You may forget your PIN and can't reset because your mobile (cell phone) is in flight mode etc etc! I was locked out of one card this trip.\nP.S.S. if you are travelling with your wife, you now have \"double\" cards on the assumption that you both use the same CC A/C with individual cards 😁😁"}, {"username": "Meeda Hardien Francois", "comment_text": "Kaashifa Francois"}, {"username": "Catherine Maldoni", "comment_text": "We are here …just arrived Friday … changed $2000 aus dollars … got $1130 euro 🥺"}, {"username": "Rose Stolarek", "comment_text": "Westpac travel card is great no fees but it’s only for Westpac customers. We were there 2 weeks ago and rate was .61\nThe rate changes daily\nWhen in Europe do not use Euronet atms as the rate is shocking !\nUse bank atms"}, {"username": "Damion MacDonald", "comment_text": "Michelle MacDonald"}, {"username": "Richelle Tye", "comment_text": "Do the wise cards need to be a physical card or can we use digital cards ( like in Australian like Apple Pay )"}, {"username": "Maree Marchant", "comment_text": "I’m from Australia and always found it better to withdraw cash at an atm if need be there is always one at the airport. You lose a bit on the currency exchange here.\nAs long as your card doesn’t charge international transaction fees take a nominal amount and use your card. I use ING orange everyday no fees.\nEnjoy your travels !"}, {"username": "Penny Williams", "comment_text": "I just withdrew cash from ATMs using my Commonwealth or Suncorp card. I found cash quite useful in Italy."}, {"username": "Rhona OConnor", "comment_text": "Don't bring a big amount of cash..... Use card 💳 . Safer."}, {"username": "Sally Warren", "comment_text": "Use an ATM with a travel card"}, {"username": "Joe Guzzi", "comment_text": "Umless you are changing millions, it doesn't matter."}, {"username": "Todd N Nicole Clarke", "comment_text": "I changed mine before I left oz but don’t do it at the airport, you don’t need a huge amount mainly for city taxes at hotels, majority of places take card just make sure your bank doesn’t charge international transaction fees, 28degrees Mastercard gives good rates and Citibank debit card with no international fees"}, {"username": "Trace Barron", "comment_text": "I'm using Wise travel card. Waiting till rates are good and then putting it on the card. Will take a $500EUD cash split between us for things extra"}, {"username": "Darlene Mulcunry Robertson", "comment_text": "I travel a lot and have used the app *convert* it’s free in the App Store. This gives you an up to date rate on all monies."}, {"username": "Robyn Lawson", "comment_text": "It’s not good but hasn’t been for 6 months. $1 aus buys .59 euro . Be worse in Italy. I wouldn’t wait. Got my euro yesterday in Perth."}, {"username": "Berndt Weihs", "comment_text": "With Mastercard( Paylife)\n1€ = 1.625 AUD take an ATM"}, {"username": "Melissa Jane Brown", "comment_text": "I started loading euros onto my Qantas Travel Money card a few months before travel, whenever the rates were good and I just used that everywhere - worked perfectly."}, {"username": "Paul Anderson", "comment_text": "Wait or you will loss money! Only change money in the country it’s printed."}, {"username": "Lynette Lowes", "comment_text": "Been back three weeks we took about 100euro cash the rest on travel card was getting about 61euro to $1 . When need more cash just went to a bank atm. Pretty much just used cards"}, {"username": "Jaime Cleek", "comment_text": "Google has calculators that tell you"}, {"username": "Jenny Payne", "comment_text": "I go to Italy a lot + going in October and I do it at home $1 Australian = 0.60 euros"}, {"username": "Ian Goodgame", "comment_text": "I use XE App to check and also the Currency App, always take about 100 Euro from here in small denominations to use as tips and for coffee, otherwise always use credit card or Qantas Money Card."}, {"username": "Graham Sherlock", "comment_text": "Put money into you bank account specifically for travel, then convert it in there to euros. Then in italy access those euros via a debit card from your bank. Carry 200 euro on you maximum."}, {"username": "Grace Scinto", "comment_text": "One of the risks of travelling- if you do the exchange will get better and if you don’t it will get worse. Close your eyes and make a choice."}, {"username": "Neville Spargo", "comment_text": "Some ATM’s offer shocking fx rate against A$, just got a quote 1 hour ago from a ATM at Naples station $100 euro was going to cost me A$193 ! Of course did not proceed ! The Italy bank ATMs seem to offer best rates, the No name ATMs just sign posted with a big yellow letters - ATM offer the worst rate . In hindsight should have taken a little more Euro from Australia . We have not had a big need for euro cash , 98% of transactions have been via tap and go on our Ubank debit card which offers a good fx rate and NO fees !"}, {"username": "Harris Dee", "comment_text": "Use a credit card w no international fees… haven’t touched my cash in 2 weeks"}, {"username": "Sandra Timi", "comment_text": "Will be less than what you get in Australia because they will hit you hard with conversion costs. Generally better to change here."}, {"username": "Izzie MacDonald", "comment_text": "Used a Wise card loaded up with Euros then a cc for other expenses"}, {"username": "Haylee Jeffery", "comment_text": "Robynne Douglass"}]}, {"id": "2197587580640320", "text": "We’ll be visiting Capri late September and want to book a boat tour to the Blue Grotto no more than 2 hours in length. We would prefer a larger boat, maybe 2 levels and average of 40 passengers. ￼ Any recommendations and places to book through?", "link": "facebook.com/groups/1373361046396315/permalink/2197587580640320/", "likes": 2, "comments": [{"username": "निनावी सहभागी", "comment_text": "Shawanda Taylor thank you for this info! I couldn’t find one on Viator for that cost, but I did find one for that price on get your guide. Do you by chance have a link to the one you booked it through? Would be much appreciated if you do. Thank you!￼ 🥰"}]}, {"id": "2197588823973529", "text": "From where we will be staying in Rome, there is not a great deal of difference in time to get to Roma Termini or Roma Tiburtina by taxi. Would you recommend to take a fast train to Florence with Italo from Tiburtina as it is less hectic?", "link": "facebook.com/groups/1373361046396315/permalink/2197588823973529/", "likes": 1, "comments": [{"username": "Gloria Di Francesco", "comment_text": "It's the same! Not so different! 😊"}, {"username": "Elena Innocenti", "comment_text": "Trains start from Termini, then Tiburtina and go to Firenze.\nTiburtina is less crowded.\nTrain stop for few minutes.\nIf I have to go to Firenze I prefer Tiburtina.\nIf I have to go to Milano, I prefer Termini because there are trains don’t stop to Tiburtina and Firenze."}]}]