[{"id": "2197596140639464", "text": "Does anyone know what restaurant this is in Verona, center city, outdoor dining looked like a Roman temple…", "link": "facebook.com/groups/1373361046396315/permalink/2197596140639464/", "likes": 8, "comments": [{"username": "Pietro Adami", "comment_text": "Looks like Corte Sgarzarie; look for Osteria Sgarzarie"}, {"username": "Susan Sharpe Shirley", "comment_text": "Looks like it could be La Loggia Bistro: https://\nla-loggia-bistro\n.business.site/\n?utm_source=gmb&\nutm_medium=refe\nrral"}]}, {"id": "2197598883972523", "text": "Hi re walking shoes .. I am after a waterproof walking shoe, as comfortable as possible for our October Italy trip. I have tried on a few (Hoka etc) and haven’t found the comfortable shoe. Don’t need them to walk up trails, just for inner city. Does anyone have recommendations?\nThank you", "link": "facebook.com/groups/1373361046396315/permalink/2197598883972523/", "likes": 4, "comments": [{"username": "Michele Lentz", "comment_text": "Bzees"}, {"username": "Carol Potter", "comment_text": "Hoka Clifton 9….."}, {"username": "Debi McGrath", "comment_text": "Merrell"}, {"username": "Debbie DiOssi", "comment_text": "Try Sorel"}, {"username": "KB Spector", "comment_text": "If you have a women’s size 9 foot or larger, these are very nice. (Size down 2 sizes for the men’s equivalent so a W9 is a M7. This is what I purchased and it was perfect). Super comfortable, note only the white is waterproof"}, {"username": "Leslie BC", "comment_text": "I ❤️ my Hokas"}, {"username": "Elisha Lynn Simon", "comment_text": "Keens"}, {"username": "Carol Oram", "comment_text": "Salomon"}, {"username": "SE Rosenberg", "comment_text": "These. My friend got me onto these. There’s a huge range of them but I’m happy with the black ones. Waterproof too."}, {"username": "Walaa Hosny", "comment_text": "Cloud 5"}, {"username": "Rupama Schwartz", "comment_text": "I’ve worked at trade shows all my life and comfortable shoes has always been a challenge.\nMy last two trips to Italy I wore Dansko tennis shoes. I have never worn a more comfortable shoe in my life."}, {"username": "Marie Beseau", "comment_text": "I bought waterproof on clouds for our October trip."}, {"username": "Kim de Blecourt", "comment_text": "My KURU's were great there in February. kurushoes.com"}, {"username": "Linda Kogan", "comment_text": "On cloud. I have 7 and love them. But get one with a bit of cushioning since you will walk all day in them."}, {"username": "Teresa McMahon", "comment_text": "I love Merrell's for extensive city walking"}, {"username": "Lauren Swanteck Myler", "comment_text": "I bought On’s Cloud 5s."}, {"username": "Julie Butters", "comment_text": "Just a thought perhaps you should see a podiatrist and have insoles specifically made for you. I have this and my feet have gone from being agony to happy in any shoe I put my insoles in."}, {"username": "Lisa Pinder", "comment_text": "FitFlop"}, {"username": "Jessica Jordan", "comment_text": "On Cloud! Spent 12 days in Italy this past May and walked 12,000-20,000 steps day for a total of 64 miles with no problem. I brought two other pairs of shoes and never put them on."}, {"username": "Becky Reeder", "comment_text": "Do you have knee problems or foot issues. I recommend hoka s They do take some getting used to because the change the way the weight is distributed to your foot. But after that it is amazing how good my feet and legs hold up I know several orthopedic surgeons that have their patients start wearing them before knee surgery. The Bondi series is the one they recommend for that. But there are some other really good shoes recommended on this feed. Good luck!!"}, {"username": "Kelly Irwin", "comment_text": "I love my Altra! The ball of the feet are wider to prevent crowding of your toes. I had on cloud and they didn't hold up good. I walk 4 to 6 miles at a time and the soles wore out faster than any shoe I've owned."}, {"username": "Ginny Krisanda", "comment_text": "Be careful with Hokas. I tried them and thought they were wonderful at first but after three 2 mile walks my hip was so sore I was limping. I’m back to 2-3 mile walks in my Brooks everyday with no problems. Hokas aren’t for everyone."}, {"username": "Pamela Schnepp", "comment_text": "I bought Taos and have been wearing them to break them in. I like them and would recommend them."}, {"username": "Colleen Church", "comment_text": "AllBirds Mizzies are water proof"}, {"username": "Elena Paonessa", "comment_text": "https://\nca.vessi.com/"}, {"username": "Monique Swanner", "comment_text": "I wore my af1s and saw a ton of other people doing the same."}, {"username": "Kathy Craig Thomas", "comment_text": "On Clouds. Cute, comfortable and waterproof!"}, {"username": "Jane Coutts", "comment_text": "I bought Hoka for the first time to bring to Italy - they are fantastic- I didn’t even wear them in before I left - not waterproof though"}, {"username": "Lisa Ryan", "comment_text": "Columbia water proof shoes"}, {"username": "Elena Eckley", "comment_text": "Sketchers Walkers"}, {"username": "Jenny Payne", "comment_text": "Think it is a matter of trying on different ones to see how comfortable they are🌻"}, {"username": "Joe-Linda Po Agustin", "comment_text": "Vessi! We’re going this October, and have been using them for short walks. Very comfy, no break in needed. They give discount to health care workers too."}, {"username": "Lisa Valdovinos", "comment_text": "I love Brooks. They’re the best shoe I’ve ever had! I have four pairs."}, {"username": "Jenni Vail", "comment_text": "The dr scholls Time off shoe"}, {"username": "Miriam Griffin Woods", "comment_text": "Miriam Griffin Woods"}, {"username": "Brooke Summerville", "comment_text": "Merrell make a waterproof version. I like them because they are not white or pink or purple."}, {"username": "Paula Stansberry Brown", "comment_text": "Try Easy Spirit punters. They are my go to shies. I wear an insert and it fits perfectly in them."}]}, {"id": "2197603227305422", "text": "I am travelling Puglia August, September 2023 by public transport, young 70's female solo. So excited. However having problems finding Travel options Taranto/Gallipoli and Gallipoli/ortranto\nLooking direct bus or train, not a lot changes with luggage.\nAny advice appreciated", "link": "facebook.com/groups/1373361046396315/permalink/2197603227305422/", "likes": 0, "comments": []}, {"id": "2197600757305669", "text": "I have a question? We are going in october for the first time with camper to Italie. What are the best places to go to. We want to stay every time 2 or tree day’s and travel not deeper than Rome. We love nature and small villages. Anyone suggestion? Thanks at advance", "link": "facebook.com/groups/1373361046396315/permalink/2197600757305669/", "likes": 0, "comments": []}, {"id": "2197616307304114", "text": "We are from a state in the US where THC/marijuana is legal. It’s pretty much the same as alcohol in Europe- no one cares & people don’t go overboard because it’s just part of our society now. What’s the situation in Italy?", "link": "facebook.com/groups/1373361046396315/permalink/2197616307304114/", "likes": 40, "comments": [{"username": "Lori Webb", "comment_text": "CBD only"}, {"username": "Rhiannon Bowden", "comment_text": "Maybe go to Amsterdam if you need drugs 🤷‍♀️\nIt absolutely stinks, I googled if Skunks were in Hawaii last month because that’s what it smells like."}, {"username": "Roger Pajo", "comment_text": "I brought high( pun intended) caliber vape pens over from the states to Barcelona then Rome. Placed them in my with toiletries …bada-bing, bada-boom. Everyone one and their brother smokes in Barcelona and Rome so no one noticed. TSA is more concerned about other things…"}, {"username": "Nancy Hull", "comment_text": "I have seen many people smoking cigarettes everywhere even in restaurants but no marijuana💁‍♀️"}, {"username": "Maria Coladangelo Ducca", "comment_text": "N O leave that stuff home. More more trouble than it is worth ."}, {"username": "Maria Coladangelo Ducca", "comment_text": "These are your views and not the Italian government views"}, {"username": "Leila Myftija", "comment_text": "Medical cannabis (with high levels of THC) is legal but only with a presciption.\nYou can find it with cbd in stores, on line, etc.\nThe legal amount of THC is 0.3% (for food products, such as flour or oil) and less than 0.6% for everything else (ex. edibles).\nThe legal amount of weed you can have on you is 5 gr.\nBut I wouldn't risk it because it all depends on who you come upon (re: law enforcement)."}, {"username": "Edmond Nolan", "comment_text": "😡😡😡😡🤬🤬🤬🤬"}, {"username": "Anita Grzeszkiewicz", "comment_text": "I would strongly suggest checking offical sites for your answer, and I definitely would not recommend travelling abroad with it, irrespective of having a medical card for it or not. You may find yourself in all sorts of trouble, especially if transiting through another country on your way from the US to Italy."}, {"username": "Sharon Walsh", "comment_text": "Kylie Dillon🤣"}, {"username": "Ida Sfo", "comment_text": "Cannabis & Craft Beer in Rome"}, {"username": "Terri Dalton", "comment_text": "I bought a HHC vape pen in Tuscany. Milder than THC but still works"}, {"username": "Brian Marcus", "comment_text": "It's not legal. That's it."}, {"username": "Amy Lou", "comment_text": "If you check into it, medical marijuana is not a prescription. At least here in Florida, you have a certificate￼. Yes, you have to see a doctor, but no one hands you a prescription to go to a pharmacy. I would never risk going through customs with any product I was unsure of. ￼￼"}, {"username": "Maryann Stacey", "comment_text": "In Italy and Greece weed (thc not cbd) is considered the same tier as cociane or pills."}, {"username": "Manuela Critelli", "comment_text": "Si consuma molto ma è illegale. Anche per piccole quantità puoi avere guai seri. Nei rivenditori di tabacco trovi la l'erba legale, con quella non avrai problemi."}, {"username": "Christina Pepe", "comment_text": "Find a skate park. They will always have what you’re looking for."}, {"username": "Frank Dragna", "comment_text": "Ask Brittney Griner for her travel tips."}, {"username": "Zimog Bestia", "comment_text": "Solo cbd ve lo assicuro"}, {"username": "Anna EClar", "comment_text": "Going to another country and bringing in something you know to be illegal is a very bad idea. CBD is not THC . Yes you will probably get away with a THC vape pen in your makeup bag, but is it work the risk? Just live without it during your vacay."}, {"username": "Jenny Lee", "comment_text": "Just something to consider, Amsterdam is known for their coffee and weed shops and it is openly accepted there."}, {"username": "Farah Metheny", "comment_text": "Well not sure about Italy but in Spain it’s legal as long as you have just enough for your personal consumption. Amsterdam is legal too."}, {"username": "Sachel Valeria Obando", "comment_text": "They have stores but its really all just cbd . Only in Sorrento did i find a store that actually sold thc weed ."}, {"username": "D Rochelle Milton", "comment_text": "Ok Brittney Griner let us."}, {"username": "Sh Kaplan", "comment_text": "I never smelled it while I was there and I can tell you that made me happy. Hate the smell"}, {"username": "Michelle Menninger", "comment_text": "I saw weed shops in Prague.(I'm aware it's not Italy) They get their weed from California 🤣"}, {"username": "Anita Carlisle", "comment_text": "All we had to do every morning in London Hyde Park is walk outside our hotel 🏨 and inhale. 🤣"}, {"username": "Paola Pulga", "comment_text": "in Italy the use and possession of marijuana is illegal"}, {"username": "Maureen Rebello Hagerty", "comment_text": "Cbd shops are there and sell what I guess they consider cbd but marijuana or any type or thc is a nooooo"}, {"username": "Cookie Romero", "comment_text": "In the cannabis store in rome they sell up to a gram of flower & have edibles. Merchant confirmed it’s ok to smoke but generally away from crowds. i.e. in parks or hotel patio"}, {"username": "Mary Lou Gillen", "comment_text": "Well I suggest if you need to get high on a vacation instead of just enjoying the country you are going to with a clear mind, you should just stay home smoke your weed and watch a travel show on TV."}, {"username": "Paula Gallagher", "comment_text": "It’s not federally legal. If you take it on the plane you are doing it at your own risk ⚠️."}, {"username": "Janet Kenyon", "comment_text": "In Rome today didn’t get the chance to go in as on a walking tour"}, {"username": "Bill Nickerson", "comment_text": "Ask Brittany Griner?🙄"}, {"username": "Jessica Stone", "comment_text": "Glad someone asked. I only use it for sleep and migraines. But I was curious over there."}, {"username": "Victoria Marchetti", "comment_text": "I smelled ditch weed being smoked on the streets in Rome. Never looked for any. Brought dab pens with that me, had nonproblems getting in and out security at airport with"}, {"username": "Laura Schulz", "comment_text": "I plan to stash gummies with my vitamins. I've traveled with a vape but not sure I'd go to Europe with a vape."}, {"username": "Catalina Daniel", "comment_text": "Not the same in Italy. We did get approached by some Moroccans in Milan, trying to sell some to us. Extremely shady, pushy & insistent! It felt like it became very dangerous, very quickly! Just be careful"}, {"username": "Carine Brys", "comment_text": "I don't know about Italy in particular. BUT it's not because it is legal in some states in the US that it will be legal wherever you enter the EU. You might not even go through customs in Italy. I have nothing against weed, but I would not risk it."}, {"username": "Stephanie Garofalo", "comment_text": "Cannabis is only legal in Italy for medical use, recreational use is not permitted. Sorry to see people feel the need to debate the state of weed and alcohol use, ignoring your question."}, {"username": "Melanie Panzella", "comment_text": "Driving under the influence of anything is drunk driving. No one in their right mind would consent to being behind a wheel nor anywhere else that puts them or others at risk for safety. A drug is a drug is a drug."}, {"username": "Lexi Steele", "comment_text": "I heard different things while I was there but I definitely came across a marijuana vending machine on the street in Florence 😅🤷🏼‍♀️"}, {"username": "Steven Fletcher", "comment_text": "it is not legal in Italy and a USA medical card for it is worthless in Europe. Just goto Amsterdam it’s a cheap hop flight away 💁🏻‍♂️ or just do without it 🤷🏻‍♂️"}, {"username": "Sana Jalil Hamdan", "comment_text": "Cannabis shops are legal and open in Rome"}, {"username": "Dan Baron", "comment_text": "In Italy: Marijuana recreational use is illegal but also decriminalized.\nPossession of cannabis for personal use results in a fine but not a felony."}, {"username": "Melinda Lambert", "comment_text": "They key to your question is “state” it is still federally illegal and You would not want to loose your place on the plane when you go through security."}, {"username": "Alice Francesca", "comment_text": "The Marijuana vending machines or shops in Italy only sell marijuana with very low Thc.Anything else is illegal"}, {"username": "Terry Spincic", "comment_text": "Stay at home and smoke weed every day"}, {"username": "Karen Kerr", "comment_text": "I wouldn't mess with the carbonari. You'd be better going to Amsterdam if you want to use drugs 🤣🤣"}, {"username": "Saura Prucey", "comment_text": "News flash: kids in high school have been smoking weed for many decades regardless of legality."}, {"username": "Marisa Ursini Brancato", "comment_text": "People care. Please don’t speak for the US citizens."}, {"username": "Teresa L. Mormile", "comment_text": "I would never travel with it via air domestic or international. Marijuana is legal in many states but is not legal federally, and I wouldn’t want to chance breaking an international rule I wasn’t 100% sure on."}, {"username": "Sally Sprinkle", "comment_text": "As far as I know with the exception is Amsterdam, marijuana is not legal anywhere in Europe, somebody correct me if I’m wrong. I live in France and I never smell marijuana."}, {"username": "Maria Giordano", "comment_text": "I care & hate it : from a resident of state where the shXt is legal. The fact that you need to bring it on a vacation which is probably only a few weeks long speaks volumes. But no one is going “overboard.” Pathetic"}, {"username": "Natalie Baruch", "comment_text": "I have a medical license, and from what I gather (I may well be wrong) you cannot travel internationally\nin possession, even with a license, even if it's translated and notarized. You can either travel to countries where it's legalized and get your stuff there, travel to countries where it's not and go the illegal route (I wouldn't risk that for anything) or go without. I have fibromyalgia/\narthritis/ME/\nCFS/and orthopedic issues. I don't work, or do much of anything because I'm pretty much constantly in pain, or knackered, or depressed, but I refuse to give up traveling, and usually when I'm out of my routine and doing what I love, many of my symptoms subside and I don't need my pain killers or my medical cannabis. I pay I high price at home and can be bed ridden for months, but to me it's worth the price."}, {"username": "Cynthia Marie", "comment_text": "🤦🏻‍♀️"}, {"username": "Betsy Stabell Brown", "comment_text": "Ask Brittney Greiner how that worked out"}, {"username": "Angela Grumpylicous", "comment_text": "Has no one learned from the BG situation. Don’t take any on your flight there. Only purchase in country if legal and from legal sources. Don’t attempt to take anything out of country."}, {"username": "Daniel Gleason", "comment_text": "Cbd and extremely week. Byow"}, {"username": "Lacy Rieber", "comment_text": "I acted like I was in Santa Cruz California, where I’m from. Went fine."}, {"username": "Rita Levi Montalbano", "comment_text": "Hardly illegal, also a small possession can give you trouble. however, there are many consumers especially among teenagers. if you want to smoke here, know that it is illegal, that you will have to buy it from the black market and that you will have to consume it in a very discreet way."}, {"username": "Trace Barron", "comment_text": "Don't even try it"}, {"username": "Michelle Dougherty", "comment_text": "Try our CBD lite. It's not gonna be the same, but will get you through in a pinch and totally legal. Unlike in the states, it does in fact contain a small amount of the good stuff lol\nLord, I saw Jim Jefferies in Milano on 19/04 and let me tell you, the next morning walking around was LOUD."}, {"username": "Ann Law", "comment_text": "There are Marijuana stores in Italy."}, {"username": "Daniele Morani", "comment_text": "Consumption and possession of any drug doesn't constitute a crime in Italy, so you should be fine as long as you don't carry a lot of weed with you and you are descrete when consuming."}, {"username": "Paula Bennett", "comment_text": "Except if you’re a truck driver, nurse etc you need to pass a drug test whether it’s legal or not. Also not legal at the Federal level so not yet a part of society."}, {"username": "Manuela Bonazzi", "comment_text": "Il consumo e il possesso personale non è illegale ma nessuno lo fa alla luce del giorno e comunque non viene venduta in maniera legale. Il possesso di quantità maggiori invece è un reato penale. Io vi consiglio caldamente di lasciare perdere...per una o due settimane non può essere un problema evitarla...io non ne ho mai fatto uso quindi non posso darti ulteriori consigli o indicazioni."}, {"username": "Kris Carr", "comment_text": "I’m on cbd oil with THC. It’s by prescription in Aus. Can I bring a letter from GP and get the same product or only cbd?"}, {"username": "Steph Craddock", "comment_text": "Only CBD no real marijuana . But you can buy it in tabbachi shops."}, {"username": "Laura Miller Bailey", "comment_text": "How about Delta 8 gummies. Are they legal/\navailable in Italy?"}, {"username": "Shardul-Neha Purohit", "comment_text": "Getting the munchies in Italy would be crazy…"}, {"username": "Debbie Patriss Hesse", "comment_text": "It would probably stink to get to the airport and stopped. Imo"}, {"username": "Debbie Potter", "comment_text": "My husband uses Snus tobacco and not sure if it's illegal to bring into Italy? I can't find information on their Customs site about Snus in Italy. All I know is that it's illegal to sell. Does anyone know anything about it?"}, {"username": "Diane Bolognese Pettengill", "comment_text": "Google is your friend\n\nhttps://\nroma-pass.com/\nis-weed-legal-in\n-italy/"}, {"username": "Jonathan Coombs", "comment_text": "CBD is legal in Italy and they have stores where you can buy it. But I suggest having a puff in the privacy of your accommodation. You can still be questioned by police"}, {"username": "Micaela Codi", "comment_text": "For all those who write that CBD is legal in italy… kinda is. There is a black hole in the law: It is legal to grow It (with proper licenses) and sell it… but not to smoke it or consume it. on the cbd packages you Will find written that its for ornamental use, so please. Smoke it in private.\n\nAny thc or other drug is considered as illegal, but then it’s just up to common sense. Most of the times, if they stop you with a very small quantity they might let you go cause it’s a “personal use” quantity, but if you find a more “radical” officer he might appeal to the fact that it’s illegal.\n\nIf you need it for medical use, contact a pharmacy close to your travel accommodation some weeks before travelling to let them know so that they can order it, don’t just come with your GP receipt cause 99% they won’t give it to you. - even for us italians, with a medical receipt, it’s extremely hard to have it from a pharmacy."}, {"username": "Jeanne Taylor", "comment_text": "Jeez smoke a joint and chill out"}, {"username": "Dawn Falsinotti", "comment_text": "I wouldn’t go to another country and participate in any risky behavior."}, {"username": "Mallory Reamer", "comment_text": "When I was in Bologna in May I was hoping to find some but was unlucky. They have CBD stores but nothing with THC (anything over .2%) The woman at the store we went to, Baked, was explaining the mafia and the church want it to remain illegal or something lol. I ended up eating CBD gummies at night to help with sleep. Also might have brought a vape cart in my makeup bag 🫢"}, {"username": "Elizabeth Florio Campanella", "comment_text": "I just heard Gigi hadid was arrested in the bahamas and had a nyc medical marijuana card but didn't have one for the bahamas. I would be very careful."}, {"username": "Simona Ptichka", "comment_text": "Definitely not legal\nNone of recreational drugs are"}, {"username": "निनावी सहभागी", "comment_text": "I was just wondering if there were edibles available, particularly in Rome. I do have a medical card from Michigan. It’s not a big deal, I just figured it would take the edge off with the heat. And for those saying alcohol isn’t as bad a weed, you should try weed sometime. As long as you’re not driving, it’s harmless in comparison. I’ve seen many a person go overboard drinking & get ‘angry’ & go off the deep end. Weed just chills a person out in general. I appreciate everyone’s advice!"}, {"username": "Aliya Dalfen", "comment_text": "We found a weed vending machine in Florence 😊"}, {"username": "Diane Bicknell Cooper", "comment_text": "I was just there in Rome and saw three pot stores."}]}, {"id": "2197608930638185", "text": "Leave for 3 mths Italy in 1 week. Any apps, way to download maps,Como, Bologna, Gallopoli that I can use offline please. Used to use printed maps prior covid, but not any them around these days. Thank u", "link": "facebook.com/groups/1373361046396315/permalink/2197608930638185/", "likes": 0, "comments": [{"username": "Rhona OConnor", "comment_text": "Use Google maps and download them."}, {"username": "Wendy Harrison", "comment_text": "Try Maps.me"}]}, {"id": "2197629157302829", "text": "Any recommendations for a place to stay in Rome beginning of October for few nights before getting on cruise? Airbnb or hotel\n5 adults", "link": "facebook.com/groups/1373361046396315/permalink/2197629157302829/", "likes": 0, "comments": []}, {"id": "2197630137302731", "text": "I’ll be in Venice with my teenage daughter for just a day trip in few days. This will be my first time there so I’m wondering how do I get from the train station to city center and also back from city center to the train station.\nAlso what’s the fastest way back from city center to the train station so we won’t miss our train. Any tips to make this journey easier will be appreciated.", "link": "facebook.com/groups/1373361046396315/permalink/2197630137302731/", "likes": 2, "comments": [{"username": "Pietro Adami", "comment_text": "Get a vaporetto (public boat service) just in front of the exit of the train station. You can buy tickets and get details at the info points there"}, {"username": "Renae Larcus", "comment_text": "You may be able to walk. Venice isn’t that big and if you have easy luggage you can walk. Or take a vaporetto. They re right in front of the train station."}, {"username": "Steve Savva", "comment_text": "As you exit the main train station down the steps turn left an follow the signs for St. Marks square. It’s a good 30 minute walk due to the winding streets and crowds but lots to see and admire along the way. From St. Marks square you can catch a water bus to return to the main train station."}, {"username": "Steve Savva", "comment_text": "https://\nwww.rometoolkit.\ncom/\nvenice_visit/\nvenice_water_tra\nnsport.html"}]}, {"id": "2197659263966485", "text": "I’m looking for recommendations/input on cooking classes in Rome. I’ve looked on ”Get Your Guide” and many classes have mixed reviews making me wonder if the experience is worth the time.\n\nAlso, any suggestions for the best way to get from the airport to hotel (near Vatican City)?\n\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2197659263966485/", "likes": 0, "comments": [{"username": "Stephen Henn", "comment_text": "Cooking Classes in Rome with Chef Andrea Consoli. Google it, admin won’t approve post if link included. Our family did this 4-5 hour class and had a great time. Watch the video on his web page to get an idea what the class is like. As far as how to get from FCO to hotel near Vatican take the Leonardo Express from FCO to Termini (14€) then take the Metro Line A towards Battistini getting off at either Ottaviano station or Cipro-Musei depending whichever is closest to your accommodations."}, {"username": "Dayna Steinberg Cioffi", "comment_text": "We did In Rome cooking for a pasta and tiramisu class. It was great. We booked directly with them."}]}, {"id": "2197645537301191", "text": "Does anyone have a recommendation for a guide/driver to take a day trip from Rome to Capri and back?", "link": "facebook.com/groups/1373361046396315/permalink/2197645537301191/", "likes": 0, "comments": []}, {"id": "2197651253967286", "text": "hello everyone! What information can those who have used luggage storage give me? Is it the same in all Italy? is it usually very expensive? Would it work, for example, to leave the suitcase for a couple of days in case you want to go lighter to another city?\nThanks in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2197651253967286/", "likes": 0, "comments": []}, {"id": "2197650773967334", "text": "Heading to Lake Como in a week and keen to know how to buy fast ferry tickets ahead of time or is the only option literally going to the ticket office when you get there?", "link": "facebook.com/groups/1373361046396315/permalink/2197650773967334/", "likes": 0, "comments": [{"username": "Ellen Edmonds-Wilson", "comment_text": "You can only buy fast ferry tickets at the ticket office on the day. If you wan to go back in one you need to book when you arrive as they sell out quickly. Regular ferry tickets can be purchased in advance but we found the slow process of getting anywhere from Como town really annoying. It must drive the locals mad. I stood all the way from Como to Bellagio - over two hours, because it was heaving in June."}]}, {"id": "2197657603966651", "text": "We are planning a 10v day family trip to Italy wth a must visit to Monza for F1 on 1,2,3 September can you please suggest best route starting from Rome and places to stay. We want to see as much as possible as its our first trip. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2197657603966651/", "likes": 0, "comments": [{"username": "Lisa Valdovinos", "comment_text": "We took trains and private cars everywhere."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2197660497299695", "text": "LOST!\nHello everyone. Hopefully somebody can help us.\nWe traveled yesterday afternoon at aprox 15.46 from Milan Rogoredo station /track 8 to Rome and\nlost my daughters personalized jacket.\n\nIt is a gray jacketआणखी that she got as a Christmasgift from our Canadian family.\n\nWe still had it in Milan at the Piazza Duomo.\n\nThen took the Metro at M3 to San Donato and got out at station Milano Rogoredo.\nNot sure if we lost it at the Metro or at the trainstation.\n\nI can not find any lost and found department from the station, so hopefully through Facebook\n\nPlease contact me if you have any information.\n\nGRACIE🙏\n\n#LostAndFound #lost #italy #italytravel #wynandsfarms #lostjacket #MilanoRogoredo #trainstation #metro", "link": "facebook.com/groups/1373361046396315/permalink/2197660497299695/", "likes": 6, "comments": [{"username": "Cinzia Belliero", "comment_text": "Check this link if you were using Trenitalia: https://\nwww.trenitalia.c\nom/en.html\n\nIf you were using Italo, you may find info here: https://\nwww.italotreno.i\nt/en/\nsupport-contacts\n\nYou may file a request to Milan municipality here: https://\nwww.comune.milan\no.it/servizi/\noggetti-rinvenut\ni/\nricerca-oggetti-\nrinvenuti\n\nWhile"}]}, {"id": "2197662693966142", "text": "Has anyone done a cooking class on the Amalfi Coast they can recommend? We are staying in Praiano but happy to travel. Thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2197662693966142/", "likes": 0, "comments": []}, {"id": "2197663353966076", "text": "How far in advance do you need to book train tickets? Planning on taking a train from Rome to Florence and a few days later Florence to Venice. Ty!", "link": "facebook.com/groups/1373361046396315/permalink/2197663353966076/", "likes": 3, "comments": [{"username": "Victoria Laverty", "comment_text": "Sooner the cheaper\n\nItalio not goverment owned"}, {"username": "Colleen Jennings", "comment_text": "If you know your plans are confirmed I’d suggest booking them - once the trains are full you can’t buy a standing seat - unlike here in the UK."}, {"username": "Gillian O'Callaghan", "comment_text": "I booked 13 train trips in Italy...all on Trainline. Some a couple of weeks ahead, some a few days and day trip Florence to Pisa I booked on the day."}, {"username": "Jenny Frank", "comment_text": "Book."}, {"username": "Renae Larcus", "comment_text": "The sooner you can book the cheaper they are. They usually release tickets 60-90 days before you travel. Get your fast train tickets in advance. The local ones you can get later."}, {"username": "Phyllis Snyder", "comment_text": "The popular routes like yours especially in the high season should be booked as soon as possible- just to be safe of not getting your specific times. But always be prepared for changes."}, {"username": "Ellen Edmonds-Wilson", "comment_text": "The earlier you book, the cheaper tte tickets. Thé really cheap ones have conditions which prevent changes or refunds, but some have the ability to change without penalty. Booking a month ahead or more can save quite a lot of money."}, {"username": "Alex Kovacs", "comment_text": "While you could possibly book them up to the day of, we booked like 2 months in advance and saved a lot of money that way since we already knew the days/time frames we’d need."}, {"username": "Virgz Van Møøre", "comment_text": "You can even buy last minute"}, {"username": "Eileen Steiniger", "comment_text": "Also- check the strike date sites. They announce strikes 2 weeks in advance. This caused us to fly to Venice instead of the fast train."}, {"username": "Lori Sammons", "comment_text": "I saw a number to the train when purchasing, I’m assuming that’s the number of each cab?"}, {"username": "Claudia Amp", "comment_text": "Depends; like now to many holiday destinations, tickets become more and more scarce and pricey. It’s always better to book in advance to get cheaper rates and good seats."}, {"username": "Jenny Payne", "comment_text": "I only ever buy mine the day before as I go a few times a year and have no problem + of expensive as long as it’s not peak time🌻"}, {"username": "Sara Beth", "comment_text": "Let’s just say I paid $40 for our two tickets a couple months in advance and the day of I looked to see what they would be and they were $110."}, {"username": "Pong Ac Ai", "comment_text": "The day before"}, {"username": "Angela Elsley", "comment_text": "I booked two to three months ahead (going Sept) and some business class tickets were already sold out for the fast train for certain routes."}, {"username": "Bing Robertson", "comment_text": "I booked all mine direct on trentialia app while in Italy the same week (or two) I wanted to travel. For an idea of availability, it was in July 2023 and I got coaches 7, 5 and 2."}, {"username": "Rachel Gray", "comment_text": "Rome2Rio app or Omio"}, {"username": "Casarine Temple", "comment_text": "Madison Hart We’re doing that same route. I booked all tickets as soon as they became available."}, {"username": "Tracy Glasgow", "comment_text": "I booked a couple of months out so I didn’t miss out on the trips/times I wanted. Booked through Rail Europe so I could see all available options and tickets in the app on my phone"}]}, {"id": "2197667783965633", "text": "Can anyone tell me some happy stories about British Airlines losing your luggage and miraculously getting it to where you are staying????", "link": "facebook.com/groups/1373361046396315/permalink/2197667783965633/", "likes": 0, "comments": []}, {"id": "2197674670631611", "text": "Heloo, we are off to Italy first week August for 7 days. Flying to Naples. We are staying in Sorrento for all 7 days. Any suggested itinerary, restaurants, do’s and donts? Planning to hire a car for the 7 days. We are 4 adults and 3 kids. TIA", "link": "facebook.com/groups/1373361046396315/permalink/2197674670631611/", "likes": 3, "comments": [{"username": "Lisa Valdovinos", "comment_text": "Boat trip to the Blue Grotto and Capri."}, {"username": "Laura Uribe", "comment_text": "Visit Ravello and Capri. The funicular in Capri is usually faster than catching the bus to the upper area.\nIt’s probably too brutally hot to go to Pompeii.\nNaples has underground tunnels that you could visit.\nDefinitely a beach visit to help the kids combat the heat. Hope this gives you a few things to explore. Have fun!"}, {"username": "Angela Gilmore", "comment_text": "Day trip to Amalfi coast (Amalfi, Maiori, Minori, Positano, Vietri), a day or two in Naples (tons of things to see and 2 days are not enough), Vesuvio, Pompei and Ercolano, and stop, I think that's enough for 7 days 😅\n\nI forgot Capri!"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Don’t hire a car. Parking and driving are too difficult all along the Amalfi Coast. Hire a driver to take you around and use the ferry system along the coast and to Capri."}, {"username": "Alice Francesca", "comment_text": "Do NOT hire a car in August on the Amalfi coast! Use ferries.it s peak tourist season!"}, {"username": "Tracy Wrinn Mcdermott", "comment_text": "No car. Absolutely use ferries to visit the towns along the Amalfi Coast and Capri. If you visit Pompeii use the Circumvesuviano\nregional train. You can use that train to get from Naples to Sorrento as well, but it may be very crowded and hot. Hiring a driver to go up to Ravello is nice too."}, {"username": "Renae Larcus", "comment_text": "Sorrento is a wonderful base. So much to see from there."}, {"username": "Renae Larcus", "comment_text": "Take the SITA bus from Sorrento to other towns. Right by the train station"}, {"username": "Phyllis Snyder", "comment_text": "Why rent a car?"}, {"username": "Niyati Shah", "comment_text": "Thank you everyone for all the suggestions and recommendations\n.."}, {"username": "Niyati Shah", "comment_text": "Any restaurant recommendations\n? With vegetarian food as well"}, {"username": "Patti Warren", "comment_text": "Definitely eat dinner and watch the sunset at Marine Grande in Sorrento."}, {"username": "Tiffany Hadfield Merrill", "comment_text": "Sorrento ❤️ so many options to list"}, {"username": "Nhora Andrea Holmes", "comment_text": "I was just in Sorrento family of 5 and I agree with the car if you want to be comfortable. It will be hard to find parking but still doable and you can explore at your own pace. Everything is super busy, so buses/trains are packed and taxis are expensive."}, {"username": "Nhora Andrea Holmes", "comment_text": "https://\nwww.parrucchiano\n.com/"}, {"username": "Nhora Andrea Holmes", "comment_text": "Ristorante Zi Ntonio"}]}, {"id": "2197681243964287", "text": "Looking for a place to stay overnight while driving from Rome to Matera, Italy. Currenlty looking at Melfi, Italy as an option - wanting something off the beaten track. Any suggestions?", "link": "facebook.com/groups/1373361046396315/permalink/2197681243964287/", "likes": 0, "comments": []}, {"id": "2197682297297515", "text": "we’re debating taking the train to florence from rome or if we should rent a car and drive the scenic route.\nWhat car rental agencies would you recommend or would you recommend the train?", "link": "facebook.com/groups/1373361046396315/permalink/2197682297297515/", "likes": 0, "comments": [{"username": "Elena Eugeni", "comment_text": "Much better by train. With the high-speed train, it takes little time and the Florence station is very close to the city center. By car it is necessary to take the highway and there is often a lot of traffic. Alternative roads are very long and not worth it"}, {"username": "Ryan Monahan", "comment_text": "We were there for 2 weeks earlier this month. Rented a car from Thrifty. Almost new Lancia Hybrid. Cost around $500USD plus gas and tolls. Loved having the car especially exploring Tuscany south of Florence. Wine tasting etc. never could have done it without the car."}]}, {"id": "2197696657296079", "text": "If you happen to be in Scansano (south of Pisa and Firenze, and home to an excellent wine named Morellino di Scansano), don’t miss the restaurant Il Carraio.\nTop quality cooking (and a lovely b&b attached).\n\n", "link": "facebook.com/groups/1373361046396315/permalink/2197696657296079/", "likes": 0, "comments": []}, {"id": "2197694813962930", "text": "Hi everyone, looking for recommendations for a great tour from Milan to Lake Como for the day please .￼", "link": "facebook.com/groups/1373361046396315/permalink/2197694813962930/", "likes": 0, "comments": []}, {"id": "2197704020628676", "text": "who can stop , putting up pictures when you have visited one of the most beautiful islands of all, CAPRI\n\nI'll be back🇮🇹🕶️💦", "link": "facebook.com/groups/1373361046396315/permalink/2197704020628676/", "likes": 295, "comments": [{"username": "Deb Harnett", "comment_text": "Thanks for your photos amazing can’t wait to visit there in august 😊"}, {"username": "Moyra Clarke", "comment_text": "I recognise several places where you took your beautiful photos. So many photo opportunities on Capri x"}, {"username": "Susan Pike", "comment_text": "I was there last summer! One of the most beautiful places in the world! ❤️🌹"}, {"username": "Mariposa Mariposa", "comment_text": "Great pictures ..What a beauty🇮🇹🤍"}, {"username": "Heather Ann", "comment_text": "Heather Ann"}, {"username": "Heather Ann", "comment_text": "Loved visiting Capri ❤️great pictures posted"}, {"username": "Mirka Zembjak", "comment_text": "Love your photos… thank you for sharing…can’t wait to visit next year"}, {"username": "Roger W Ilsley", "comment_text": "LoveCapri"}, {"username": "LeAnn Bonkiewicz", "comment_text": "Going in September. Can you tell me a few of your favs?"}, {"username": "Dana Talusani", "comment_text": "Capri is magnificent! Your photos are beautiful."}, {"username": "Lenka Jelínková", "comment_text": "❤️this wonderful place"}, {"username": "Tessa Teague Moore", "comment_text": "Kelly Cox Hastings this will be us in a few months!"}, {"username": "Krista Missons", "comment_text": "How do ever decide Isabel Isidro Collings ❤️❤️"}, {"username": "Tricia Lanieri Forchetti", "comment_text": "It’s amazing, isn’t it! Enjoy!!"}, {"username": "Denise Adams", "comment_text": "Would love to go back, when its less busy!!"}, {"username": "Connie Flynn", "comment_text": "I bought a Capri watch there. My FAVORITE! Lovely area! How hot was it?"}, {"username": "Karen Carlucci Giorgi", "comment_text": "Great pictures! Thanks for sharing! Be there in two months. Can’t wait!"}, {"username": "Gail Malcolm", "comment_text": "Is it easy to go to\nCapri when u hop off the ship 🚢?"}, {"username": "Sarah Salisbury Vander Heide", "comment_text": "Did you stay or just visit? If you stayed, was it worth it?"}, {"username": "Pong Ac Ai", "comment_text": "Pong Ac Ai"}, {"username": "Andrea Romano", "comment_text": "Spectacular photos"}, {"username": "Lina Stump", "comment_text": "Meravigliosa"}, {"username": "Lisa Hry", "comment_text": "I really would love to go to Capri, I’ve been doing some research and it seems that it is quite expensive in comparison to other locations. Can you comment on this? I am from Canada so our dollar doesn’t stretch as far."}, {"username": "Charlotte Eriksen", "comment_text": "I have been to Capri in August and now in June\nI think it's worth ALL the money, I think it's one of the most beautiful islands, but it's important to live in Capri itself\n\nI have both times stayed at the Hotel Weber Ambassador, with an absolutely wonderful view of the sea, they have a bus that goes up to Capri every 10 minutes for free, so at that hotel you get it all!\nI hope to be back next year!"}, {"username": "Charlotte Eriksen", "comment_text": "The Weber Hotel"}]}, {"id": "2197713833961028", "text": "Assisi", "link": "facebook.com/groups/1373361046396315/permalink/2197713833961028/", "likes": 4, "comments": []}, {"id": "2177061109359634", "text": "The Italian Holiday - The perfect holiday escape to Italy for sun, sea and spaghetti in 2023!\nThe perfect escape! Would highly recommend to anybody looking for a sunny escape into a heart-warming tale of friendship and a little romance, set in Southern Italy 🥰\nHave a look here: https://amzn.to/3WJaK84", "link": "facebook.com/groups/1373361046396315/permalink/2177061109359634/", "likes": 9, "comments": [{"username": "Nicole Gouzoules Sheehan", "comment_text": "Hmmm Anyone read this? Maybe a fun read for the plane."}]}, {"id": "2197336100665468", "text": "Has anyone stayed in Borgo Pio area of Rome? If so would you recommend this location for a family’s first visit to Rome.", "link": "facebook.com/groups/1373361046396315/permalink/2197336100665468/", "likes": 4, "comments": [{"username": "Libby Cellini", "comment_text": "My cousin runs a hotel there called Trianon Borgo Pio. It’s literally centrally located between Castel Sant’angelo and The Vatican area. Beautiful location!"}]}, {"id": "2196675147398230", "text": "Recommendations on scuba diving locations and companies, we will be a little bit of everywhere. We are planning for mid April.", "link": "facebook.com/groups/1373361046396315/permalink/2196675147398230/", "likes": 5, "comments": [{"username": "Dianne West", "comment_text": "Where are you staying? I mean you can't dive in Florence?"}, {"username": "Alejandro Gabriel Valenzuela Anghileri", "comment_text": "Not a scuba diver, but the \"Cristo degli abissi\" in San Fruttuoso Is quite known. And San Fruttuoso and surroundings (Portofino, Camogli and so on) are awesome"}, {"username": "Mary Anne", "comment_text": "My husband loved his dives at Baia near Naples. Sunken mosaics from 2000 years ago."}]}, {"id": "2197339577331787", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2197339577331787/", "likes": 5, "comments": []}, {"id": "2196802387385506", "text": "One thing to note on Italian travel is while you can buy meals with credit card, you need to tip (when wanting to do so) in cash/ euro. So ensure you have cash in those instances!", "link": "facebook.com/groups/1373361046396315/permalink/2196802387385506/", "likes": 40, "comments": [{"username": "Wendy Spano Bracco", "comment_text": "It may not be “required” but it is appreciated. Not a hard concept. If you are going to nicer restaurants, it’s pretty typical to leave a small tip."}, {"username": "Luigia Gray", "comment_text": "You don't have to tip.\nI've been to Italy many times and have never tipped. It's an American\nthing!"}, {"username": "Douglas Godesky", "comment_text": "Tipping not required, but keeping spouse happy is required, therefore, I tipped. On cc to at least earn points/miles."}, {"username": "Jan'et Leigh", "comment_text": "When I was in Italy, I tipped wait staff and tour guides but always told them, “please accept this as symbolic of my appreciation for your kindness and excellent service”. No one ever seemed at all offended."}, {"username": "Angela Grumpylicous", "comment_text": "Don’t introduce American culture of tipping. They don’t get paid $2 an hr like our wait staff. We don’t want to increase their cost of living."}, {"username": "Lynn Griffey-Ennis", "comment_text": "My entire trip to Italy I only had one ridiculous eating experience. I was at a cafe in Rome and my daughter and I each had a water ( which of course I expected to pay for), we each had a soda ( large and unnecessary, but I didn't realize when I ordered), 1 cannoli, and a gelato sundae type thing. 60 euros was my bill! Then he said \" at most places you don't have to tip, but if you want to tip me, go ahead and leave it on the table.\" There weren't prices on the menu we received and the bill wasn't itemized so I'm still not sure what was SO expensive. I'm thinking the gelato, which I found extremely affordable there compared to really any ice cream shop here. Live and learn, always find the prices out beforehand."}, {"username": "Ed Braz", "comment_text": "American imperialism at its best - tipping is seen as a status symbol rather than the more respectful, subtle approach customary in Europe. Leave your vainglorious customs at home!"}, {"username": "Lisa Valdovinos", "comment_text": "We tipped everywhere and they appreciated it a lot!"}, {"username": "Bill Bowler", "comment_text": "While it's not required alot of the new generation of servers are money grubbing opportunists when it comes to tourists and will boldly ask you for cash only tips. I just tell them sorry no soldi on me unless the service, food and ambiance was absolutely outstanding."}, {"username": "Jim Painter", "comment_text": "PLEASE do not export US tipping culture to anywhere."}, {"username": "Dean Pecorari", "comment_text": "I never tip in Italy…they often charge service"}, {"username": "Bill Elias", "comment_text": "This is just waiters taking advantage of rube Americans. If you dined with any other accent, you wouldn’t get the same treatment."}, {"username": "Lee D'Angelis", "comment_text": "Tipping is not required in Italy. You can if you want but it is not expected."}, {"username": "Atet GC", "comment_text": "Tipping is not customary in Europe and Asia. Only in North America 😂🤣"}, {"username": "Lisa Ross", "comment_text": "The first person to ask me for a tip is certainty not getting one."}, {"username": "Cynthia Blue Mariano", "comment_text": "In Florence a few years ago, I was traveling by myself. I frequented a particular restaurant and kept leaving a tip. Wasn’t aware. I had the same waiter every time (great gnocchi I couldn’t resist) On my last visit he actually told me I didn’t need to leave a tip in Italian restaurants!! So I didn’t. I thought that was very nice of him to clue me in! 😜"}, {"username": "Maicka Palomares", "comment_text": "Reggie"}, {"username": "Rita Kanten", "comment_text": "The people having a fit about tipping are mostly Italian and most of them are not servers in restaurants. And i think The reason they don't want tipping to become common in Italy is because it will cost them more to go out. So what if it changes the culture! Maybe it's time for that particular cultural item to change. So stop yelling at those people who want to tip."}, {"username": "Annie Nelhams", "comment_text": "My family live in Italy- tipping is really not expected."}, {"username": "Jerry Kiger", "comment_text": "When lived in Italy, while ago, tipping was not expected and locals somewhat frowned on it. Locals said when waiting to tip hand to person vs leave on table … but this was long ago sure has changed some"}, {"username": "Cathy Tabaku", "comment_text": "For those who don’t argue and leave a tip only when they feel it is necessary (because duh everyone knows it’s not mandatory but it IS appreciated!!! Literally 1-3 euros MAX is fine), it is actually a law in Italy that businesses cannot accept tips by card because it usually will not get paid out to the staff (I lived and worked in the restaurant industry in Italy). So the poster is actually correct and is giving a helpful suggestion. The only businesses making it mandatory are tourist traps taking advantage of Americans, which local Italians stay way clear of so I guarantee they aren’t feeling threatened by this lol"}, {"username": "Carlenne Brown Jarvis", "comment_text": "Please tip, and in cash only! We spoke to a few servers and they do appreciate tips, but requested cash so it didn’t affect their *income/\ntaxes?* I forget exactly, but just do cash 😁"}, {"username": "Casanova Fernandez", "comment_text": "Appreciation they say is an application for more. if i fail to acknowledge you it'll shows how ungrateful i am. I can't be less grateful to a Man who God has used in blessing me and my family in general. I was introduced to Mr Thomas Ellswort few months back Right now I know how much I can boast off about my financial state. He helped me with the little capital I invested and I made so much profit for myself and my family. Thank you so much Mr Thomas, and if you are also finding it difficult trading for yourself contact him now through ➡️➡️ Thomas Ellsworth Sykes"}, {"username": "Alejandro Gabriel Valenzuela Anghileri", "comment_text": "If you want to leave it is ok, but normally in Italy we don't leave tip"}, {"username": "Jekaterina Lastočkina", "comment_text": "Mainly all places has “caperto” like service fee. So you do not need to leave more if you do not see any need"}, {"username": "Edmond Nolan", "comment_text": "European here tipping is not a thing in Europe 🙄"}, {"username": "Rachael Richardson", "comment_text": "I have never tipped once , they don’t expect it at all , not like the USA or other tipping countries"}, {"username": "Jai Schmidt", "comment_text": "One thing I am sick of is Americans forcing tipping culture on everyone. I went to eat with an American and I paid to repay a favor between us. And what does she do?\n\nDO YOU WANT ME TO GET THE TIP she says.\n\nI said sure.\n\nAlthough I am American by passport, I like how I don't have to tp everywhere. In America, it is forced and waiters and waitresses have been known to get aggressive if you don't tip enough.\n\nUnless they are scammers or beggers, non Americans don't typically feel entitled to American money because they don't need bought.\n\nAnd that is exactly what tipping is. Buying people. Objectifying them as less than you because you ASSUME they make less money than you or their employer hides money from them.\n\nThis is nothing but American projection. Newsflash Americans!!!\n\nThat waitress you see in the rest of the world? They do get paid a living wage. No one is hiding money from them and the employer pays them so you don't have to. That way, you will never hear a waitress loudly announce \"Oh I got a dollar in tip! Now I can pay my rent!\"\n\nThat server you see in the rest of the world? They never are making the choice to eat or pay a doctor because they have healthcare.\n\nDepending on where you are in the world, childrem are looked after so you don't have the \"single mother syndrome\" like you do in the US where a woman has to support one or more kids alone for whatever reason.\n\nThat student? Depending on where he is in the world, his studies might be free or low cost. He is just working for pockrt money. Let that one sink in \"thousands of sollars in debt Americans.\"\n\nRich people use money to appear better and/or cover their problems. One of the ways also is to use money to put down others.\n\nAs for the American I was with the other night, oh yes. She tipped all right. She made the server hold out his hand so she can slowly count the change, slowly putting the coins in his hand one by one.\n\nTipping has become a show off, virtue signaling culture invented by America.\n\nHow embarrassing!"}, {"username": "Glenn Todd Webb", "comment_text": "Service charge is included in the price. If you tip, you are double tipping."}, {"username": "Kim SungHee", "comment_text": "WHY TIPPING SHOULD BE GIVEN IN CASH:\nIn Europe, state tax called VAT is around 20% depends of the country.\nWhen you leave a tip in card, the restaurant has to fill for VAT and the government takes 20% of the tip or the business has to double account for the tips, what usually small business are incapable to do by themselves so they need an accountant.\nWhether it is true most of Europeans are tight, tipping is welcome.\nIn trendy places, it is expected. 10% is alright.\nFew Brits in the comments pretend it isn’t a British thing but all the trendy places in London charge 15% in tip."}, {"username": "Jayne Dawson Meyer", "comment_text": "Actually, No. They dont expect tip. Much appreciated, but don't expect it.\nYou do need small euros for restrooms if not visiting that establishment."}, {"username": "Jordan Schmale", "comment_text": "Tipping is not required in Italy"}, {"username": "Oldriska Balouskova", "comment_text": "It is not required of course but it is much appreciated"}, {"username": "Dave Conroy", "comment_text": "No, let's not do this ..."}, {"username": "Connie Iacozza Brazzoni", "comment_text": "Every where you go they charge 3 to 4 euro per person to sit at the table on top of your meal"}, {"username": "Maria Ariano", "comment_text": "\"Coperto e ristorazione: dove, quando e perché\" https://\nwww.ristorazione\nitalianamagazin\ne.it/\ncoperto-e-ristor\nazione-dove-qua\nndo-e-perche"}, {"username": "Voula Ladas", "comment_text": "This again🙄……tipping is not expected . Sure if you get amazing service …..tip then….but don’t tip everyone. People need to respect the culture in Italy."}, {"username": "Hannah Catherine", "comment_text": "I asked an Italian waitress in Bologna about this a few days ago as I had seen a lot of different things about tipping - she said it is absolutely not necessary, but nice if the service was good. I do think it’s good to have cash though if you do wish to tip, because they won’t add them on to the card payment."}, {"username": "Silvia Frati", "comment_text": "Not required.but we are very very happy if we receive one. It is a kind thing to leave a tip."}, {"username": "Ilaria Verda", "comment_text": "Tipping is not an obligation!!!!!\n!"}, {"username": "Manuela Bonazzi", "comment_text": "Ma quando mai? In Italia nessuno si aspetta né richiede la mancia."}, {"username": "Douglas Godesky", "comment_text": "Respectfully, incorrect, we often added gratuity to cc."}, {"username": "Letisha Withrow", "comment_text": "If you had waiters expecting a tip I'm guessing you never went to a restaurant with menus only written in Italian 😏"}, {"username": "Amanda Lynn", "comment_text": "Anyone leaving anger emojis over an innocuous question really needs a trip to Italy!"}, {"username": "Graham Sherlock", "comment_text": "No tipping, it's not the culture. Tipping in the US might make you feel better but in Italy it's a different culture, just feel good being here. Things can't be bought here, emotions are not transactional in Italy, it is not a US consumer driven society and that's why so many people from the US live here."}, {"username": "Romanovska Irena", "comment_text": "It is not compulsory to tip in Italy! If you are from US, please, when in Italy, do as italians do!"}, {"username": "Luca Tocci", "comment_text": "No tipping system in Italy.\n\nWhen they ask for cash WITHOUT giving you a receipt, they're evading taxes.\nDo NOT fall for it."}, {"username": "Dana Golden", "comment_text": "Tipping is not required nor expected."}]}, {"id": "2197233504009061", "text": "Hi,\nWe are travelling in January on a cruise as part of a longer European cold Christmas visiting from Australia. We have travelled briefly to Italy previously. Seeking day trip ideas for Genoa, Palermo, and Valletta for a group of four. Two adults and two young adults - 18 and 20.\nThank you !!", "link": "facebook.com/groups/1373361046396315/permalink/2197233504009061/", "likes": 1, "comments": []}, {"id": "2197193657346379", "text": "Can anyone recommend a hot air balloon experience in Tuscany please? I have looked at some from Chianti and Siena, would one region be better than the other? Thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2197193657346379/", "likes": 4, "comments": [{"username": "Casanova Fernandez", "comment_text": "I can't be less grateful to a man who God has used in blessing me and my family, Right now I know how much I can boast about my Mr Thomas, He helped me with the little capital I had and I made so much profit for myself and my family, That is the main reason I decided to drop this here for any interested person struggling with financial crisis, am so sorry for intruding in your post, but everyone needs this. contact Mr ➡️➡️ Thomas Ellsworth Sykes"}, {"username": "Brian McGraw", "comment_text": "I booked one on GetYourGuide launching from San Casciano Val di Pesa."}]}, {"id": "2197203637345381", "text": "Hi I love to go to Milan Rome and Amalfi but can’t go on the train How can I do this thank you", "link": "facebook.com/groups/1373361046396315/permalink/2197203637345381/", "likes": 2, "comments": [{"username": "Gina Schofield", "comment_text": "You may have to check out where ferries will get you and use private drivers or buses for the rest.\nGet the Rome2Rio app"}, {"username": "Ruth Akutu Maccarthy", "comment_text": "You can take a plane from Milan to Rome, a ferry from Rome to Amalfi"}, {"username": "Casanova Fernandez", "comment_text": "I have been seeing post everywhere and a lot of people keep saying reach out to him and eventually I did and it turned out to be legit ➡️ Thomas Ellsworth Sykes"}, {"username": "Jorge Manuel Goncalves Gomes", "comment_text": "Train the best way"}, {"username": "Donna Gilardone Szwabowski", "comment_text": "Drive"}]}, {"id": "2197250347340710", "text": "Hello everyone! I will be traveling to Italy, driving through Florence and all over Tuscany. My question is about GPS. I’m from USA. Will my iPhone Maps work well over there while traveling through Tuscany? Do I need to purchase a GPS ahead of time?", "link": "facebook.com/groups/1373361046396315/permalink/2197250347340710/", "likes": 2, "comments": [{"username": "Paul Anderson", "comment_text": "Your iPhone will work fine. We have a car with built in gps and it helps a lot."}, {"username": "Simone Pfenninger", "comment_text": "Sometimes you need to use Offline maps"}, {"username": "Petra Krištofová", "comment_text": "You can also try waze app 🙂 worked great there"}, {"username": "Alicia Cox", "comment_text": "Rent a car with GPS; don’t waste ur money buying one as it may not be legal. Also, we had no issues with phones. We used both the built in/provided gps plus the phone. Just BE AWARE of all the rules, signs, when not to enter (like inside the walls of Lucca), traffic cameras - educate yourself for sure. Allow more time than what nav says. In cities, road signs are on the buildings & hard to see as they blend in. Traffic is crazy & way difft rules of the road than in the US. 🤷🏻‍♀️"}, {"username": "Sandra Shoffner", "comment_text": "We rented a car with gps twice but couldn't get correct directions so we ended up using Google."}, {"username": "Amanda Molinelli DuAime", "comment_text": "I’ve been using Google maps on my iphone and it works great."}, {"username": "Fetchin Gretchen", "comment_text": "Depends on if you get a sim card or not. Will work better with local service."}, {"username": "Alice Francesca", "comment_text": "Don't miss Siena and the Valle d'Orcia area : Pienza, San Quirico, Montalcino, Bagno Vignoni! Real Tuscan landscape♡"}, {"username": "Colleen Dawson", "comment_text": "Google maps and GPS are worldwide apps used anywhere."}, {"username": "Frank Hunt", "comment_text": "I had a lot of trouble with Google maps some years ago, but probably ok now."}, {"username": "Alejandro Gabriel Valenzuela Anghileri", "comment_text": "I live in Italy, Google maps is perfect. I have an iPhone and I don't like apple maps very much, but it could be just a bias"}, {"username": "Dr-Jon Warnecke", "comment_text": "If nothing works, most areas of Italy have signs for \"Roma\", so you can at least get directons, because \"all roads lead to Rome!\""}, {"username": "Stephen Henn", "comment_text": "We used iPhone maps from Amalfi to the Dolomites and it worked just fine. Waze also worked to warn us of speed cameras."}, {"username": "Laura Uribe", "comment_text": "Works great except in cities with really narrow and close streets or tall buildings. Then it’s a little more challenging."}, {"username": "Jerry Kiger", "comment_text": "Renting car ? What best way to rent in Italy, do cars normally need be dropped off same region or can pick up Rome drop off North day Venice? Wondering if best use some train, car rental, etc for mixture?"}, {"username": "Monica Colontonio Macho", "comment_text": "Waze was the best for us. The car rental company told us that the gps in the car and google were not as accurate as the Waze app. It worked wonderfully"}, {"username": "Irene Oda", "comment_text": "I use Google maps on my phone (non iPhone). Works everytime. It seems to be easier if I start my searches in a place with wifi (hotel, train station etc)"}, {"username": "D'Anna Hohe", "comment_text": "The apps work but are not always the best at avoiding the ZTLs (central zones where cars are prohibited except with permits). Be certain you understand the rules and recognize the signs because mistakes are accompanied by high fines. It is sometimes best to park on the outskirts to avoid the ZTLs and because parking in the cities (specifically Florence and Rome) can be difficult anyway!"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2197294490669629", "text": "Which one? Does anyone know if we are forced to have breakfast first if I get “breakfast at museum” instead of prime? The “prime experience” costs almost double the “breakfast at museums” and prime includes aआणखी tour which I don’t really want, but prime does specify breakfast is after the tour ( which obviously I want due to crowds). There is a 7:30 slot available for prime and 7:45 available for breakfast at museum. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2197294490669629/", "likes": 3, "comments": [{"username": "Jorge Manuel Goncalves Gomes", "comment_text": "I like to find out too. I will be there next week"}, {"username": "Dawn Canada", "comment_text": "Our breakfast didn’t start until 9:00 am or maybe even 9:30. We started with the prime tour at 7:15 first. We did the tour, then ate, then we could go back through the museums again and the Sistine chapel again (but now with the crowds)."}, {"username": "Kristi Brennan", "comment_text": "I read the difference between the two to be that the prime had a guided tour and the other was on your own. Not sure totally sure, but that seems to a count for price difference?? 🤷🏻‍♀️"}, {"username": "Shen Min Chue", "comment_text": "These are different tickets thus with the Breakfast at the Museums ticket, you will have to eat breakfast first before making your way to the Sistine Chapel, unlike the Prime Experience. Even if you forgo breakfast, you will face more crowds at the Sistine compared to the Prime Experience since the latter has an hour of early entry before opening hour. However the Prime Experience ticket is only 68 euros to purchase, you will have to pay much more if you get a similar equivalent booking from a 3rd party operator. You can self-explore the rest of the museums after the conclusion of your 2 hours guided tour. The Breakfast at the Museums is a valid option if the basic standard entry tickets are all sold out from the official site."}, {"username": "Valda McMullen", "comment_text": "Don't worry about the breakfast.\nDo the before the lines tour.\nOurs started at 7.00am we went straight in passed all the museum's, which were closed. Though our guide explained about each as we went passed.\nWe went to the Sixteen Chapel - there were only about 20 people in there.\nThe guide explained the paintings and all the intricacies.\nThen at the back we could go through the door to the left which took us directly to the start and we could visit all the museum's (AMAZING).\nWhen we eventually got back to the Sixteen Chapel it was packed - could barely tilt head to look up.\nThough the door to the right to St Peter's.\nOn the way don't miss the little door to under St Peter's were all the Popes are buried"}, {"username": "Jaime Cleek", "comment_text": "That one may just be breakfast only"}, {"username": "Ellen Edmonds-Wilson", "comment_text": "We did the Prime Experience and it was worth every cent. We were the only group in the Hall of Maps and one of only three in the Sistine Chapel. The guide was excellent. After breakfast we went to see the other areas of the museum and couldn’t believe the crowds."}, {"username": "Stacey Esposito", "comment_text": "If you can do prime and get in earlier I would do that. I did the 815 breakfast at the museum and no they don't force you. The time we spent at the breakfast the museum was filling up."}, {"username": "Sarah Luisa Hughes", "comment_text": "We did breakfast at the museums in September, it was great and still empty when we started walking around. But you fo not have to have the breakfast if you do not want it, you can go straight in, but cannot have it afterwards."}]}, {"id": "2197324667333278", "text": "Nous partons demain de Montréal pour Rome 🎉🎉🎉🍷🍷🍷", "link": "facebook.com/groups/1373361046396315/permalink/2197324667333278/", "likes": 396, "comments": [{"username": "Debra Barnett", "comment_text": "It is extremely hot in Italy at present, you will need light clothing!"}, {"username": "Tracey Sadiq-Butz", "comment_text": "Enjoy and have a wonderful time! We just got back from 3 weeks of excitement!"}, {"username": "Patrizia D'Arcangelo", "comment_text": "Buon viaggio! 🇮🇹 ❤️ 🇨🇦"}, {"username": "Gisella Acito", "comment_text": "Cool"}, {"username": "Beverly Bovo", "comment_text": "Beverly Bovo"}, {"username": "Kathy Fryer", "comment_text": "Kathy Fryer"}, {"username": "Marco Brambilla", "comment_text": "Ta partet düman? Dülza l’uga"}, {"username": "Dominic Lelièvre", "comment_text": "Bon vol! Nous dans 1 mois!"}, {"username": "Ray Haneski", "comment_text": "Passe de bonnes vacances"}, {"username": "Debbie Plante", "comment_text": "Enjoy!!"}, {"username": "Rozy Centonze", "comment_text": "Bon voyage!"}, {"username": "Agnes Sax", "comment_text": "Passé une bon temps!￼"}, {"username": "Melinda Giuffre", "comment_text": "Bon voyage!"}, {"username": "AnnaMaria Nicholas", "comment_text": "Safe travels !"}, {"username": "Vanna Mori", "comment_text": "Great, enjoy my country👍"}, {"username": "Monika Maruňáková", "comment_text": "Monika Maruňáková"}, {"username": "Julie Berthiaume", "comment_text": "Nous partons dans 10 jours ✈️\n❤️"}, {"username": "Isabelle Dalpé", "comment_text": "Bon voyage à vous!!\nNous nous partons le 8 septembre retour le 22\nJ’ai tellement hâte!!😊"}, {"username": "Adriana Iantosca-Sebastiani", "comment_text": "Adriana Iantosca-Sebastiani"}, {"username": "Graziella Altobelli", "comment_text": "Buon viaggio"}, {"username": "Joseph Aoun", "comment_text": "Joseph Aoun"}, {"username": "Véronique Morissette", "comment_text": "Ce sera notre tour de partir de Montréal vers l’Italie en septembre. Moins de deux mois à attendre maintenant. Si quelqu’un voyage aussi de Montréal dans ces coins là, faite moi signe svp. Ça me rassurerait de savoir qu’on est pas seul ☺️"}, {"username": "Linda Yanni", "comment_text": "Buon Viaggio! Have a great time"}, {"username": "Johanne Laramée", "comment_text": "j'aimerais tellement ....Rome, Grèce...wow"}, {"username": "Yadira Davis", "comment_text": "Have a wonderful time! Rome ‚ the eternal city 🏙️"}, {"username": "Lucy Studd", "comment_text": "Buon viaggio"}, {"username": "Isabel Pierre-Luc Perreault", "comment_text": "Isabel Pierre-Luc Perreault"}, {"username": "Isabel Pierre-Luc Perreault", "comment_text": "Isabel Pierre-Luc Perreault"}, {"username": "Isabel Pierre-Luc Perreault", "comment_text": "Isabel Pierre-Luc Perreault"}, {"username": "Isabella Davis", "comment_text": "Isabella Davis"}, {"username": "Pat Peenstra", "comment_text": "Good luck it will be very hot& crowed!!"}, {"username": "Nadia Granito", "comment_text": "Bon voyage! Nous sommes allés en Italie il y a 2 semaines déjà et c’était fantastique!"}, {"username": "Adriana Sormani", "comment_text": "Bon Voyage! Buon Viaggio!"}, {"username": "Johnny J. Turpin", "comment_text": "Johnny J. Turpin"}, {"username": "Lilian Villarreal", "comment_text": "Nous partons la semaine prochaine!!! Bon voyage 🛫"}, {"username": "Maxine Righi", "comment_text": "Bon voyage"}, {"username": "Yolanda Arena", "comment_text": "Yolanda Arena"}, {"username": "Catherine Fréchette", "comment_text": "Bon voyage!"}, {"username": "Camille Meigneux", "comment_text": "Bon voyage!!! Je dois encore attendre octobre..!"}, {"username": "Diana Wilson", "comment_text": "Have a good journey and holiday"}, {"username": "Kathy Pageau", "comment_text": "J’ai tellement hâte nous c’est le 9 sept!!!"}, {"username": "Kristine CCyr", "comment_text": "Bon voyage, apportez vous un petit ventilateur portatif , il fait chaud en ta..., moi ce sera début septembre"}, {"username": "Shawn Kopp", "comment_text": "Have a wonderful time!"}, {"username": "Erminia Pedata", "comment_text": "Super! Bonne voayage! Combien de jours vous restez à Rome?"}, {"username": "Terri Bazinet", "comment_text": "Woohoo, we leave on Monday for Rome, from Montreal 🛳️🇮🇹🛳️🇬🇷🛳️🇹🇷🛳️"}, {"username": "Maria NoBa", "comment_text": "Bon voyage!"}, {"username": "Maggie Williams Dryden", "comment_text": "Bring fans"}, {"username": "Cinzia Colombo", "comment_text": "Benvenuti! Vi aspettiamo !"}, {"username": "Stephanie Garofalo", "comment_text": "Bon voyage!"}, {"username": "Franz Josef Eschi", "comment_text": "Franz Josef Eschi"}, {"username": "Catherine Darsigny", "comment_text": "Bon voyage !\nAprès Rome, nous sommes maintenant en Sardaigne… 🇮🇹👌🏻"}, {"username": "Paulinha Cã", "comment_text": "Have a great trip!!! We will travel from Montreal to Rome in October !"}, {"username": "Mike Cao", "comment_text": "Nous retournons à Montréal dimanche ￼😂😂😂😂"}, {"username": "Diane Leesmith", "comment_text": "Bon voyage"}, {"username": "Cathy Ricci", "comment_text": "Have fun I'll be in Rome in September"}, {"username": "Martine Viau", "comment_text": "Bon voyage\nNous sommes de retour depuis hier\nC’était magique\nSoyez prêt car il fait chaud 🥵\nNos dernières journées était 49 degré"}, {"username": "Christiane Evers", "comment_text": "It's going to be very hot"}, {"username": "Martine Huguet-Latour", "comment_text": "On y était début mai pour 3 semaines : c'est la plus belle chose que j'ai vécue de ma vie ! Bon voyage et savoures chaque instant !!"}, {"username": "Caroline Langlois", "comment_text": "Profitez-en ça passe tellement vite, nous y sommes allé en septembre dernier 3 semaines.. si vous avez du temps, les cinq terres c’est un must… si vous y aller, dormez à Levanto ( mieux qu’en la grande ville de la Spezia) le village suivant, mon endroit favori, petit village ( restaurant la palme WoW) … et à Rome trestevere le soir, vraiment bien comme quartier"}, {"username": "Manuela Teves", "comment_text": "Bom voyage"}, {"username": "Marie-Josée Trottier", "comment_text": "Bon voyage!!! 😊"}, {"username": "Romina Lauretig Toscano", "comment_text": "Fait chaud!"}, {"username": "Johanne Montpetit", "comment_text": "Bon voyages! Nous c'est l'annee prochaine!"}, {"username": "Maria Grillo-Abel", "comment_text": "Have an amazing time and stay safe."}, {"username": "Patricia Anne McMahon", "comment_text": "Patricia Anne McMahon"}, {"username": "Agneta Danielsson", "comment_text": "Bon voyage! Il fait tres chaud!🥵"}, {"username": "Tina Louise", "comment_text": "Safe travels ✈️"}, {"username": "Lois Feller", "comment_text": "Lois Feller"}, {"username": "Nathalie Prestige Pare", "comment_text": "Bon voyage... nous aussi c'est pour bientôt... tellement hâte"}, {"username": "Joy Crawford", "comment_text": "Going to be hot 🥵"}, {"username": "Caroline Chaloux", "comment_text": "Bon voyage nous aussi c’est bientôt ☺️"}, {"username": "Ruth Akutu Maccarthy", "comment_text": "You will enjoy it!!!!"}, {"username": "Pierre Côté", "comment_text": "Svp, vous partagerez vous coups de cœur"}, {"username": "Erica Lowy", "comment_text": "In Montreal you must eat at Joe Beef if you have time. I was just looking at their cookbook again…. ❤️"}, {"username": "Doris Sanjuan", "comment_text": "Good luck 👍"}, {"username": "Line Gregoire", "comment_text": "Bon voyage !!! Fin août pour nous❤️🇮🇹🇮🇹"}, {"username": "Ana Paula Mazzucco", "comment_text": "Ana Paula Mazzucco"}, {"username": "Chantal Adams", "comment_text": "Bon voyage!!! Moi c’est lundi!!! 🇮🇹🇮🇹🇮🇹"}]}, {"id": "2197305494001862", "text": "Can anyone recommend a cooking class in Milan or Stresa? The one we wanted to do in Varenna is no longer operational. Grazie!", "link": "facebook.com/groups/1373361046396315/permalink/2197305494001862/", "likes": 0, "comments": []}, {"id": "2197307754001636", "text": "Dumb question... For those that have previously traveled through italy.. Have you found that most people speak English?\nOr is it a good idea to learn some basic Italian before traveling?\n?", "link": "facebook.com/groups/1373361046396315/permalink/2197307754001636/", "likes": 2, "comments": [{"username": "Cecilia Christine Costantini", "comment_text": "Moat people speak basic English, or will at least try. With googletranslato\nr and internet on your phone, you won't need to learn any Italian - also because, even if you learn some basic questions, you would need to be able to also understand people's answers, which is not basic anymore, as you can't predict what they will say. Having said that it is always nice when people try to speak some Italian and you will be praised for it, especially if you use basic greetings and please and thanks yous."}, {"username": "Michael Galan", "comment_text": "Most do but it's always a good idea to at least try to have some conversation in Itaian when possible. The simple words like, please (Per favore), thank you (Grazie),, good morning (Buongiorno), good evening (Buonasera) and goodnight (buonanotte) are great starters"}, {"username": "Dave Colleen", "comment_text": "Yes, a lot speak English but picking a few words phrases, goes a long way."}, {"username": "Kristina Ruk", "comment_text": "They speak English really good, some of them perfect ;)"}, {"username": "Letty Veronica", "comment_text": "A lot of them do but most of the taxi and Uber drivers barely spoke any English. Thankfully we practiced for months before going."}, {"username": "Lucas Grilli", "comment_text": "Just learn to speak with your hands, often it's enough 🤌"}, {"username": "Larry M Murray", "comment_text": "Yes but knowing and using simple words or phrases pays volumes. I had one waiter who loved my Boston Italian."}, {"username": "Annette Fordyce", "comment_text": "Like others have said, it’s always appreciated if you make an effort to learn the basics. Also, if you have any medical conditions or food allergies, it’s useful to learn the words for those things. At least have them written on a card."}, {"username": "Emma Basilico", "comment_text": "Most of the people in Italy will know english, at least the basic. It’s not necessary to speak in italian and most of the times, the effort it’s not appreciated because trying to, for example, order in it, can actually be more time consuming for the person that is working 🙂"}, {"username": "Laura St James", "comment_text": "Yes, they speak English (most) but they are so impressed when you try a few basic words and phrases. It's fun to learn so give it a try!"}, {"username": "Meredith Williams", "comment_text": "i learned key phrases and it went a long way 💜"}, {"username": "Tari Lawson", "comment_text": "It's always a good idea to learn some of the local language."}, {"username": "Kirsten Rea Davis", "comment_text": "Most did speak English or had another person in the store that did. I was glad I had learned some before my trip because I was able to read many signs and menus without having to translate everything."}, {"username": "David Baillie", "comment_text": "What? No most people do not speak English in Italy."}, {"username": "Kim Aranha", "comment_text": "Most people speak some tourist English ( heavily accented) but Italians love it when you try to speak their language -"}, {"username": "Jenny Frank", "comment_text": "Yes most speak English that said learn Italian\nI am , making me feel proud to do this will enrich the trip"}, {"username": "Ellen Edmonds-Wilson", "comment_text": "In tte large cities in the tourist areas English is the shared language across all visitors. Sometimes people don’t speak English but Google translate is very helpful. In Italy they speak Italian so knowing a few phrases, including I’m sorry I don’t speak Italian/\nunderstand works wonders"}, {"username": "Janet Isaacs Lanza", "comment_text": "Most people involved in the tourist industry speak English, but out of respect, because you are in their county, you should learn some basic Italian like please, yes, no, thank you, etc"}, {"username": "Kerri Bevilacqua", "comment_text": "It’s good to learn at least some basic Italian, not only for interactions with people, but navigating transportation,\nordering food, reading signs, etc. It is also appreciated if you make the effort"}, {"username": "Cassandra Goodgame", "comment_text": "After a week in Puglia my friend and I wound up in a steak house in Naples and no one in there spoke a word of English… Had no wifi so no translator. It was hysterical trying to communicate and order but I had enough basic Italian to get by and we had a fabulous meal and some free limoncello at the end. Learn a little."}]}, {"id": "2197233094009102", "text": "Dear travellers. Could I kindly ask those who have toured Italy this summer and going into autumn 2023. Plse could you post any contacts for excellent guides that you may have used or mini tour operators - short trips - who impressed. Am preparing a detailed tour itinerary (23 days) for folk who would enjoy some local expertise on the ground - someone who can enrich their experience and support them in their travels.\nTIA", "link": "facebook.com/groups/1373361046396315/permalink/2197233094009102/", "likes": 8, "comments": [{"username": "Stephanie Lee Garcia", "comment_text": "Following"}, {"username": "Glenn Todd Webb", "comment_text": "For where in Italy?"}, {"username": "Julie Waters", "comment_text": "Following. I would like to go in September/\nOctober this year."}, {"username": "Roxanne Patti", "comment_text": "https://\nwww.italyunfilte\nred.com/\n\nhttps://\nwww.allaroundtus\ncany.it/\n\nhttp://\nwww.napolinvespa\n.it/"}, {"username": "Mary Andreotta", "comment_text": "Following"}, {"username": "Starla Dawn", "comment_text": "Sergio and his daughter Agatha were amazing epic day.\n\nhttps://\nwww.tripadvisor.\nca/\nAttractionProduc\ntReview-g187782\n-d15884936-Capr\ni_Blue_Grotto_B\noat_Tour_From_S\norrento-Sorrent\no_Province_of_N\naples_Campania.\nhtml"}, {"username": "Starla Dawn", "comment_text": "https://\nwww.tripadvisor.\nca/\nAttractionProduc\ntReview-g187895\n-d19347975-Hors\neback_ride_visi\nt_to_S_Gimignan\no_tuscan_lunch_\nwine_tasting_Ch\nianti_winery-Fl\nore.html"}, {"username": "Janie Patri Thomason", "comment_text": "Following"}, {"username": "Monique Swanner", "comment_text": "I have two suggestions, info in the photos below. The first is the private tour company we used in Rome and Florence. We met with two guides, cristiano in Florence was especially fun and knowledgeable. We toured the uffizi and his passion for the art and for the history of the artists was captivating. Our guide Simon in Rome who toured the colleseum and Roman forum was also incredibly knowledgeable and kind. Both are contracting through expert tours and travel, nicoletta would be the person to contact for those.\n\nWe also booked a vespa wine tour through Tuscany, and I believe that may have been the highlight of our trip. It was absolutely gorgeous, the guides Santi, Gabi and Stefano were fun and did a great job of splitting the groups by experience so everyone could ride at their own pace. You could also drive a classic automobile if Vespas are not your thing. The pasta lunch after the tour was incredible and at a beautiful estate owned by the company. I will attach the viator listing here as well"}, {"username": "Colin Ng", "comment_text": "Following"}, {"username": "Marina Belardo Johnson", "comment_text": "I just got back from an amazing tour !!! It was all local experiences, authentic local gourmet delicacy food tasting!!! Wine tasting, olive oil making, farms visits it was a dream. Next to a protected areas by the mountain and on the beach 🏝️ with an ocean pool !!! Pm me !"}, {"username": "Lisa Terry Holtcamp", "comment_text": "Following"}]}, {"id": "2196378057427939", "text": "We are coming back from 6 weeks in Italy and those are the must bring for us!!!\nSuper light Back back with wheels ( my husband did not like wheels so he did a large backpack …. and a carry on for each of us. It had everything we needed for each person!\n\nTravel belts ! For your money, passports and phones, credit cards and do not leave it anywhere !!!\n\nI used my nice fashionable travel belt and I did not bring a bag this time and it has been the best thing I did !!! so I did not have to worry about pickpockets on public transportation I put the bag under my shirt and my shirt in my shorts … can’t open it, can’t see it, can’t take it …\n\nBug spray and after bites !\nPack super light you do not need that many clothes!\n\nYou can wash it and dry it same day and travel with a backpack !\n\nEat in local restaurants only … you even get better local products and not on main touristy sites or get panini at a salumeria ! Super cheap and super good ! Save big this way.\n\nTravel with bus or train and save on the private taxi can be super expensive!\n\nComfortable shoes ! You walk walk and walk !!!\nBring shoes you have already used few times !!!\n\nBring 2 portable batteries your phone will die for taking pictures ! We had one and it did not last all day … lol", "link": "facebook.com/groups/1373361046396315/permalink/2196378057427939/", "likes": 163, "comments": [{"username": "Shirley Lewis", "comment_text": "good advice ... I'm sure people do not realize the mosquitoes in Florence are fierce!!"}, {"username": "Yvonne Dionne-Parks", "comment_text": "Can you recommend good walking shoes?"}, {"username": "Sue Ramsey", "comment_text": "Great advice!"}, {"username": "Nicole Condemi", "comment_text": "We’ve brought double walled water bottles, it’s so hot and they keep water super cool"}, {"username": "Diane Desmond Rosenfeld", "comment_text": "If you could change one thing about the trip, what would it be. My husband and I are going in September for 6 weeks."}, {"username": "Barbara Hughes Maistros", "comment_text": "I used a hairdryer in Germany to finish drying a lightweight dress I washed in sink with a biodegradable laundry sheet."}, {"username": "Debra McCraw Austin", "comment_text": "These Euro Soft sandals are very comfortable and have a cork heel/sole. I wore mine all around Rome, Florence, and Venice. Switching between these and supportive sneakers. I got mine from Amazon. They come in different colors."}, {"username": "Judy Charon", "comment_text": "Thanks for sharing. This is what I’m planning on doing too. Less is more AND keep it simple when packing!"}, {"username": "Fran Astur", "comment_text": "We are family of 3 and travelling on Dec. I am wondering how can I travel light and for sure if I wash it everyday it won’t dry in a day. Is it really hard to travel in Italy with large luggages?"}, {"username": "Dave Conroy", "comment_text": "Excellent advice. There are people who insist they are the exception and must drag around large cases full of daily crap, when it isn't necessary with basic planning 😂 I've passed them on crowded staircases and struggling on trains all over the world. But they did have two changes of clothes and shoes for that evening."}, {"username": "Tami Frediani", "comment_text": "We brought bug spray for our trip. Didn’t need it until the end when the heat wave star￼ted to hit. One of the things that we bought while in Italy was creams for bug bites. Wished I had bought more. Already used the cream at home and it’s amazing How fast these bites are going away and don’t itch."}, {"username": "John Cosenza", "comment_text": "Wish I bought bug spray. We just got back from two weeks and Venice I got bit really bad. But they do have excellent and big care 🙂."}, {"username": "Valerie Collanton", "comment_text": "The mosquitoes are definitely fierce in the summer and in the fall. I bring repellent wipes. That way don’t need to worry about dealing with spray bottles"}, {"username": "Maria Coladangelo Ducca", "comment_text": "Super advice. The one about eating is great . Going to a local trattoria and a salumeria is the way I always go . Usually these places are owner operated 👏👏"}, {"username": "Zarina Shaik", "comment_text": "Jarryd Thurston this is the page I’m talking about"}, {"username": "Maggie Kane", "comment_text": "Nice share!"}, {"username": "Charlie McLeish", "comment_text": "Thank You 🙏"}, {"username": "Marie Simpson", "comment_text": "Sophie King Demi Quinn"}, {"username": "Louise Faggioni", "comment_text": "Thank you Marina, all great tips!"}, {"username": "Lisa Hogan", "comment_text": "Hoka"}, {"username": "Eileen Milazzo-Elliott", "comment_text": "Allison Elliott more tips in case there is anything new for you"}, {"username": "Alicja Krampa-Chrabąszczewicz", "comment_text": "Alicja Krampa-Chrabąszczewicz"}, {"username": "Roslyn Tidmarsh", "comment_text": "Love,love,love!"}, {"username": "Jesse Crawford", "comment_text": "Korri Sullivan"}, {"username": "Nina De Martino McDonough", "comment_text": "Do you have a brand for the backpack? Did you have to check it?"}]}, {"id": "2197086437357101", "text": "Currently in Florence and faxing the best time. Wanting to check out the wine windows? Any recommendations of how to find them would be appreciated 🍷Grazie", "link": "facebook.com/groups/1373361046396315/permalink/2197086437357101/", "likes": 4, "comments": [{"username": "Danielle Johnston", "comment_text": "I’m guessing you mean the wine window. We found them from google maps."}, {"username": "Dave Colleen", "comment_text": "Babae"}, {"username": "Robýn Kretsçhmər Schuchårdt", "comment_text": "Are there more than one?"}, {"username": "Kim Hudson", "comment_text": "This one was close to our hotel. We stumbled upon it by accident but loved it. Look for the flowers on the wall 🌸"}, {"username": "Amy Clark", "comment_text": "Just went to one a few hours ago. Google cantina de Pucci. It was so fun. 🍷🇮🇹🍷"}, {"username": "Debbie Horton Rough", "comment_text": "what?!?! this is brilliant!!!! <3"}, {"username": "Kathy Kibbe", "comment_text": "Babae in Santo Spirito"}, {"username": "Patachia Fisher", "comment_text": "We were there in June and found this link helpful. Enjoy!\nhttps:/\nwww.theintrepidg\nuide.com/\nwine-windows-in-\nflorence/"}, {"username": "Fleur de Liz", "comment_text": "One is near the Babae resto accdg to Rick Steves"}, {"username": "Fei Dadulla Miranda", "comment_text": "Are wine windows only in Florence?"}]}, {"id": "2197200114012400", "text": "Just an FYI We are in Florence now - yes it’s hot but it’s OK there is shade to walk in and plenty of places to buy cold water - go out early then siesta then go again - the Italians don’t eat dinner until at least 8.30 pm !\n\nAlso I highly recommend skip the line tickets for everything in Italy it’s worth the money and beats queuing in the heat .\n\nLast tip - wear whatever you like no one here cares\n\n😊😊😊", "link": "facebook.com/groups/1373361046396315/permalink/2197200114012400/", "likes": 15, "comments": [{"username": "Debbie Rainford", "comment_text": "Comfortable walking shoes are a MUST!"}, {"username": "Randy Aull", "comment_text": "I agree"}, {"username": "Jerry Kiger", "comment_text": "For tourist sites requiring tickets … is best to buy prior online, once there say hotel, or at the site? Thank you for any tips"}, {"username": "Roy Martinez", "comment_text": "How is a bottle of water"}, {"username": "Cathy Ruggiero", "comment_text": "Hi glad uour enjoying Florence! Have you done any day trips out to any other towns in Tuscany I’ll be staying in Florence the second week of September and won’t have a car. I’m wondering if I’ll be able to see sienna or Chianti on a tour"}, {"username": "Rita Davoli-Conti", "comment_text": "Thanks for sharing"}, {"username": "Anne Dido", "comment_text": "I couldn’t agree more, especially on wear anything you like.\nBtw we ate dinner 6-7 pm. Lol"}]}, {"id": "2197212887344456", "text": "Hotels for a stayover in NAPLES before an early morning flight???? Thanks all", "link": "facebook.com/groups/1373361046396315/permalink/2197212887344456/", "likes": 2, "comments": [{"username": "Tami Whittlesey", "comment_text": "It may require a little more info to give a specific recommendation but overall Centro Historico or Chiaia is what I choose when in Naples. Good luck!"}]}, {"id": "2197203460678732", "text": "Planning to go to southern Italy in November of next year...\n\nRecommendations on where to stay, want to walk everywhere...what to definitely see, train rides/day trips\n\nBig foodie/drinks and market shopper", "link": "facebook.com/groups/1373361046396315/permalink/2197203460678732/", "likes": 4, "comments": [{"username": "Simone Pfenninger", "comment_text": "Napoli"}, {"username": "Pietro Adami", "comment_text": "Puglia region. Don’t miss Gallipoli"}, {"username": "Laura DeCicco", "comment_text": "When you say Southern Italy, what do you mean? Calabria? Puglia? Sicily?"}, {"username": "Glenn Todd Webb", "comment_text": "Ravello-Villa Rufolo and Villa Cimbrone"}, {"username": "Gayle Moores", "comment_text": "Visit the Amalfi Coast! It is amazing and worth seeing. There will be less people at that time of the year and will not be as busy as Summer.I would stay in Sorrento which is just off the Amalfi Coast.There is a port in Sorrento and you can take a ferry to the Islands of Capri, Ischia or Procida.The ferries to the Amalfi Coast will not be running in November but there is the Sita bus that leaves from the Sorrento train station. You can buy your tickets there as well. Just get there early to get a good seat.The bus stops along the Coast at the different towns. Another way of seeing the Coast is to take a daytrip tour with a tour company. There are many that offer tours."}]}, {"id": "2197217320677346", "text": "First time to Rome this September. Going on a tour to Pompeii and Amalfi but need to be at Piazza del Popolo at 7:10 which is about 45 min drive from our hotel. Would it be easy to get a taxi around 6am?", "link": "facebook.com/groups/1373361046396315/permalink/2197217320677346/", "likes": 0, "comments": [{"username": "Cathy Ruggiero", "comment_text": "I agree ask the hotel I was there last Summer by myself I train from Rome to Naples and sound at the taxis Ron strike so I rented a car and drove the Amalfi coast"}, {"username": "Cathy Bacchus", "comment_text": "Thanks. This is a guest house type hotel with no on site staff 24 hours but I will check with them when we arrive."}]}, {"id": "2197220150677063", "text": "Recommendation for a tour company to take us to a day trip to Lake Como/Bellagio/Varenna from Milan. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2197220150677063/", "likes": 4, "comments": [{"username": "Mackenzie Weis Jones", "comment_text": "Following"}, {"username": "Beth Ruiz Graves", "comment_text": "Milan Day Tours if your looking for private tour."}, {"username": "Alejandro Gabriel Valenzuela Anghileri", "comment_text": "If you just want to get to Varenna and Bellagio from Milan you can be absolutely comfortable going by yourself using public transportation.\nVarenna is a train stop, Ferry to Bellagio is just a few minutes walk from Varenna train station. Really easy"}]}, {"id": "2197221570676921", "text": "Going to Tuscany at the beginning of October and would love suggestions for towns/areas to stay. We will be there for 4 nights. Would also like suggestions for wineries! Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2197221570676921/", "likes": 0, "comments": [{"username": "Johnny J. Turpin", "comment_text": "San Gimignano\nPop. 7,100\nSiena\nPop. 54,000\nFlorence\nPop. 380,000\nLucca\nPop. 82,000"}]}, {"id": "2197231897342555", "text": "Crossing the pond with some extra room in my suitcase and looking forward to find some new pieces! Please share your finds for boutiques, jewelers, street vendors etc. that you loved! Rome, Venice, Como are where I’ll have the most time. I don’t need designer, just pretty and unique/can’t find in the US. TIA!", "link": "facebook.com/groups/1373361046396315/permalink/2197231897342555/", "likes": 0, "comments": [{"username": "Tara Roed", "comment_text": "We shopped here ❤️\n\nhttps://\nwww.nousatelier.\nse/"}, {"username": "Claudia Amp", "comment_text": "In Rome:\n\nhttps://\nwww.bernarddelet\ntrez.com/"}, {"username": "Claudia Amp", "comment_text": "Rome https://\nwww.angosturajew\nels.com/"}, {"username": "Claudia Amp", "comment_text": "Nice shop with quality pieces in Monti area, Rome\n\nhttps://\nlolroma.com/"}]}, {"id": "2197232290675849", "text": "Hi. Trying to decide between Hotel Continental and Grand Hotel President. Your thoughts? Thanks for your help!", "link": "facebook.com/groups/1373361046396315/permalink/2197232290675849/", "likes": 0, "comments": [{"username": "Maria LoSurdo", "comment_text": "Where??"}, {"username": "Claudia Amp", "comment_text": "Where on the globe? 😂"}, {"username": "Susan Watts Halgren", "comment_text": "Florence?"}, {"username": "Nicole Lee", "comment_text": "Hotel Continental was great! Perfect location beautiful rooftop and i heard the restaurant there for dinner is very good we just didnt have time to eat there"}, {"username": "Roland Trego", "comment_text": "Sorrento? Though I have not stayed in either, I can tell you that the Terrazza Vittoria restaurant atop the Continental is excellent and offers stunning views."}]}, {"id": "2197235354008876", "text": "Any recommendations for a small authentic restaurant in Como? Hoping for a mom and pop place with really tasty Italian food. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2197235354008876/", "likes": 2, "comments": [{"username": "Tina Marie Chiarello", "comment_text": "We were there in May. We are at Pizza Romo Como. The owner Jonny is wonderful! His son is the chef. We had a prosciutto and Burata appetizer. No one in all of Italy gave us that amount of prosciutto. We also had a raw shrimp appetizer and the rack of lamb. All were a outstanding. He gave us Prosecco on the house and at the end of our meal he gave me a limoncello and my husband grappa. I cannot say enough how wonderful this meal was!"}, {"username": "Scott Hunt", "comment_text": "Cranzia was told by a local food was fantastic and nice decor"}, {"username": "Carol Sabia", "comment_text": "https://\nwww.ristoranteso\nciale.it/"}, {"username": "Shelley Bowen Glassman", "comment_text": "Thank you so much 💕"}]}, {"id": "2197233627342382", "text": "Best way to get to Florence from Rome for a day trip?", "link": "facebook.com/groups/1373361046396315/permalink/2197233627342382/", "likes": 8, "comments": [{"username": "Anne Ellis Teather", "comment_text": "Train"}, {"username": "Jason Hobel", "comment_text": "High speed train from either Italo or Trenitalia. It is just over an hour trip on those trains."}, {"username": "Jamie Medeiros", "comment_text": "Train"}, {"username": "Agneta Danielsson", "comment_text": "By train!"}, {"username": "Michelle Bergman Davis", "comment_text": "Train"}, {"username": "Michael Alea", "comment_text": "Train"}, {"username": "Renae Larcus", "comment_text": "Train"}, {"username": "Jeff Gentner EA", "comment_text": "Train"}, {"username": "Nancy Kirby", "comment_text": "Early and fast train"}, {"username": "Poulami Saha Roy", "comment_text": "I used flixbus"}, {"username": "Raf Gervasio", "comment_text": "Fecciarossa"}, {"username": "Virgz Van Møøre", "comment_text": "Train"}, {"username": "Pat Cray", "comment_text": "Train"}, {"username": "Charlotte Lowe", "comment_text": "Train!"}, {"username": "Laura DeCicco", "comment_text": "Fast train."}, {"username": "Jim Hash", "comment_text": "Earliest train there and the latest one back. You won’t have nearly enough time to hit the big sites. You might have time to get into Academia to see David (tons of other great stuff there) or into the Uffizi. You really need 3 to 4 full days to see everything (from the inside). Still, if I only had one day to do Florence I would go. Just realize that you will want to come back and stay longer on your next trip."}, {"username": "John Mazurek", "comment_text": "Train - super easy and great way to see the countryside."}, {"username": "Jess Galasso", "comment_text": "First and last train 🚂"}, {"username": "Daniela Poli", "comment_text": "Train, you arrive and don't need worry about carparking. Fast trains arrive quickly"}, {"username": "Michelle Miller", "comment_text": "Train"}, {"username": "Bobbie Lozzi", "comment_text": "Peter Lozzi"}, {"username": "Monica Sucato", "comment_text": "Train"}, {"username": "Connie Wilson", "comment_text": "Fast (Frecce) trains booked through TrenItalia. 1.5 hours."}, {"username": "Kim Tremain", "comment_text": "Fast train"}, {"username": "Heidi Olivier", "comment_text": "Sue Marggraff\nKarin Gebleux\nTrudi Chatelier"}, {"username": "Belinda Cooper Hockings", "comment_text": "Paul Riding"}, {"username": "Shane McClain", "comment_text": "Train"}, {"username": "Christiana Xenofontos", "comment_text": "Train 😎"}, {"username": "Billie Frances Swanda", "comment_text": "Train"}, {"username": "Lupita HC", "comment_text": "Train 🚊"}, {"username": "Mar Zieh", "comment_text": "By bus"}, {"username": "Nick Cittadinni", "comment_text": "Helicopter"}]}, {"id": "2197243550674723", "text": "Backpacking to Venice from Zurich! Milano Centrale is BUSY! No room for some people in 2nd class and no room for luggage. Train platform did not update until 30 mins prior to our departure. Some girls did notआणखी have assigned train tickets so they had to get off bc train was full. Hired a private water taxi to transport to hotel due to strike today for €70 🤞🏼🤞🏼🤞🏼Safe travels everyone! Any recommendations for food spots appreciated 😁", "link": "facebook.com/groups/1373361046396315/permalink/2197243550674723/", "likes": 17, "comments": [{"username": "Helen Ostler", "comment_text": "Trattoria alla Madonna - wonderful fish! Enjoy after your journey."}, {"username": "Ellen Edmonds-Wilson", "comment_text": "There’s a great little Corner Pub on Dusodoro which does €3 spritzes and well priced drinks as well as ciccetti and food. It’s lot of fun with lovely staff too."}]}, {"id": "2197245910674487", "text": "If you are a Christian/need a moment of tranquillity and reflection, I suggest visiting any of the little or medium-sized churches you will find at basically every corner in Rome.\n\nI was born in Rome, but I hadआणखी never been to Santa Maria in Via until this time, and was surprised to see a fountain in the Chapel of Santa Maria del Pozzo (Mary of the Well).\n\nOn the site there was the house of a Cardinal, with a well in the stables. In 1256, the well overflowed. A picture of Our Lady was floating on the waters, which disappeared as soon as the picture was recovered. Pope Alexander IV declared it a miracle, and ordered the construction of the chapel.\n\nIt is supposed to be \"holy\" water, so have a seat, pray, drink some water, light a candle, donate a few coins and then go back into the heat.", "link": "facebook.com/groups/1373361046396315/permalink/2197245910674487/", "likes": 44, "comments": [{"username": "Monica Yasmine Crampton", "comment_text": "Love this, next time I'm in Rome (my favourite place) I'll make sure to visit"}, {"username": "Chrystal Stevens Bisonet", "comment_text": "I love this! Thank you!"}, {"username": "Adriana Rodriguez-Argueta", "comment_text": "Yep, over 900 churches in Rome"}, {"username": "Pietro da Rimini", "comment_text": "There are so many amazing churches in Rome and I love that you mentioned a lesser known one. It is a fabulous place for a moment of reflection, even if you are not Catholic."}, {"username": "Tracey David Lobue", "comment_text": "Do any of these churches have the relics of saints one can venerate?"}, {"username": "Ginger DiGalbo Katz", "comment_text": "I think I've seen about 50 over the years..I know ...there are like 4000"}, {"username": "Denise Bibby", "comment_text": "Teena Leuba 😍"}, {"username": "Dixie Kotylak", "comment_text": "Thank you 🙏🏻"}, {"username": "Tarek Anthony Khairy", "comment_text": "Rome Sweet Home ❤️\nMy wife and I, were born no where near Rome or Italy for that matter. However whenever we travel back to this city, and walk in her streets and spot a church. We make an effort of walking in, bend the knee, and take a seat and admire.\nEvery single time this happens we discover so much history and walk out with this feeling of just being right at home."}, {"username": "Matthew Cawley", "comment_text": "Church of St. Ignatius of Loyola is a good one to see by design"}, {"username": "Cecile Geeurickx", "comment_text": "We have the church of Santa Cecilia in Trastevere as well. I am planning to visit it asap. :)"}, {"username": "Lynette Leone Watkins", "comment_text": "A beautiful post. Thank you"}, {"username": "Michele Allan Oder", "comment_text": "I have been to that church a few times. I love to sit, pray, and reflect there…. ￼ I brought home some holy water from the church.\n🙏🙏🙏"}, {"username": "Katherine Galea", "comment_text": "Melissa Rapa ❤️"}]}, {"id": "2197247987340946", "text": "Just wondering if anyone could comment on the use of air tags for tracking luggage while travelling. Should I buy Apple even though they are the most expensive !", "link": "facebook.com/groups/1373361046396315/permalink/2197247987340946/", "likes": 14, "comments": [{"username": "Danielle Johnston", "comment_text": "I have apple AirTags on my dogs and they are great. Last a year and new batteries are cheap. Easy to follow from my phone."}, {"username": "Paula Brink", "comment_text": "I love mine."}, {"username": "Eric Parks", "comment_text": "I have Tile and they work well. My son traveled to Italy and Switzerland this summer and his phone died. We could at least tell his suitcase (and presumably him) made it to the hotel. Which gave my wife some peace of mind."}, {"username": "Janette David Payne", "comment_text": "We have the Apple tags and it certainly paid off in Vietnam, we were waiting for our suitcase at the airport… never came out, but it showed up on my iPhone as nearby… showed it to one of the ground staff and she went through to the back and yelled out to the luggage handlers… a few minutes later out comes our smallish grey suitcase… her English was very good and she apologised, it was in the far back corner of the enclosed trailer and in the dark they hadn’t seen it….\nAlso our niece got the Tile, and she went all through Italy and France… piece of mind knowing your bag is nearby.\nWell worth it !! They’ll be in use again September/\nOctober again !!"}, {"username": "Marina Belardo Johnson", "comment_text": "Worth every penny !!! If bags are lost … you will\nKnow where to find them …"}, {"username": "Maria LaPietra Guerrero", "comment_text": "I think they were worth it and great"}, {"username": "Nadia Filice", "comment_text": "You get what you pay for. I use them all the time"}, {"username": "Lisa Valdovinos", "comment_text": "We used air tags. They worked well."}, {"username": "Dawn Langlois Gustafson", "comment_text": "AirTags worked wonderful when my son lost his luggage. ￼ we could follow it on its way home. ￼ Buy a 4 pack. My daughter is in Greece and I made her put one in every purse/bag/\nsuitcase. 😂"}, {"username": "Jaime Cleek", "comment_text": "it depends what your phone is, they are only for iPhones and I didn't think they were that expensive, but like 25 dollars."}, {"username": "Regina-Rich Krett", "comment_text": "We have AirTags in all our luggage, backpacks, work bags, purses, etc.. they are great and you can easily track your belongings."}, {"username": "Neville Spargo", "comment_text": "We are on the last leg of our 75 day trip through Europe and have been very happy with the performance of our Apple AirTags , good peace of mind !"}, {"username": "Catherine Johnson", "comment_text": "Arrived home yesterday. Was waiting for my luggage. Looked at my AirTag and it announced that my luggage was in the terminal. It appeared a few minutes later. So glad to have my AirTag."}, {"username": "Billie Begley", "comment_text": "We used them coming home from Rome to Canada. We were able to track where they were when we landed in Montreal and there was no luggage. Went to baggage check. Showed them exactly where they were at the\nRome terminal. He contacted them. Had them Re tagged direct to Kelowna. Was great."}, {"username": "Heather Mitchell", "comment_text": "Yes last week my husbands luggage stayed an extra night in Paris before finally joining us in Milan. We were able to tell where it was and knew when it got to Milan a lot sooner than the airline. So we had already picked it up before we got the email saying it was there. Best purchase."}, {"username": "Allan Olexa", "comment_text": "Absolutely yes. Do you have an Apple device to “Find My”? I have an Android phone so use my iPad (connected to wifi)."}, {"username": "Ellen Edmonds-Wilson", "comment_text": "I know exactly where my suitcase is when I travel. I also have one in my handbag in cast someone steals it at home or in holiday. They’re excellent."}, {"username": "Joya Nicastro Cherry", "comment_text": "I used them all throughout Europe.\nHave me peace of mind."}, {"username": "Rachel Gray", "comment_text": "Yea but make sure you activate them properly. I just flew to Rome and kept getting notifications to activate someone else’s AirTag the entire flight. I almost activated out of annoyance but didn’t."}, {"username": "Valerie Combdon McCavour", "comment_text": "Thank you so much everyone for the great comments. I will definitely be ordering them."}, {"username": "Valerie Combdon McCavour", "comment_text": "Just wondering if anyone has taken the train from Florence to Rome and if you have a preference?"}, {"username": "JeriLynne Clifford", "comment_text": "Air tags are worth it! I got 4 apple brand on Amazon for about 100 bucks.\nMy husband calls them LoJack for traveling."}, {"username": "Bianca Hillier", "comment_text": "Definitely get one! I flew from Venice to London but my suitcase went to Barcelona instead 😅 having the AirTag helped the airline to locate my suitcase and was back to me in 4 days! Best investment I made especially now as everyone’s suitcases are always being sent to the wrong place!"}, {"username": "Patty O'Connor Beringer", "comment_text": "Maybe this is a dumb question, but do I need air tags when taking a direct flight?(Chicago\nto Rome)"}, {"username": "Lisa Rodriguez", "comment_text": "You have to have iPhone for the Apple ones"}, {"username": "Susan Lowry Lamb", "comment_text": "Don’t bother. My friends knew where their bag were, but it still took days to get them."}, {"username": "Marsha Titus Bloxom", "comment_text": "What works with an android? Only thing I find had a limit of 250 feet."}, {"username": "Carine Brys", "comment_text": "Don't you need at least an iPhone 11 to use the air tags? Mine is the 10."}, {"username": "Brooke Summerville", "comment_text": "Can be used during the trip and afterwards as well as in your luggage. Can be used for keys, passport wallet, kids, in the car so you can locate it if parked in unfamiliar surrounds."}, {"username": "Richelle Trezise", "comment_text": "Does anyone recommend another brand not Apple. I have a new Samsung and we can't get galaxy tags in Australia."}, {"username": "Meredith Williams", "comment_text": "i was pleased w my apple air tag for peace of mind! i also put it in my purse each day! so a double use!"}, {"username": "Kim Lehman Johnson", "comment_text": "Yes"}, {"username": "Colleen Dawson", "comment_text": "Apple air tags are for IPhones. If you have an Android phones, then Tiles are used. There may be other options I am not aware of, or if they are interchangeable\n."}, {"username": "Stacy Derouin", "comment_text": "Smart Tags work great! They're Samsung."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2197265660672512", "text": "Thank You for helping a moma out here!\n\nI’m so grateful to take my family to Rome but I can’t help but be concerned about the weather. I pre-booked with an agent before I knew what I know now but am willing to cancel and re-book if I have other options. What would you add/subtract. Me, husband and 2 young teens staying at Anantara Palazzo Naiadi\n\nआणखी Day 1: 4:00-7:00 golf cart tour\n\nDay 2: 9am- skip the line Vatican museum (willing to give these away if I can get the 7:30 breakfast tickets)\n\nDay 3: 9:45-12:45 3 hour private van tour catacombs. Lunch and 3:00 Gladiator School (my husband is going to kill me during this when he has to dress up with the kids haha).\n\nDay 4: 4:30- 8:30 private walking food tour of Rome\n\nDay 5: 9am Villa Borghese\n\nThis is a splurge trip for us so budget isn’t a concern. Just looking for happy Teens and fun memories during our first trip to Rome! I SO appreciate your suggestions. Restaurants, Day Trips for a beach or cooler temps. Please keep in mind, coming from Milan, Venice, Florence, Sorrento (Amalfi coast) on to Rome where we fly out of.", "link": "facebook.com/groups/1373361046396315/permalink/2197265660672512/", "likes": 19, "comments": [{"username": "Tari Lawson", "comment_text": "From what I can see you should be fine. We were there Monday-Wednesda\ny. It was hot. We walked all over Rome, all day. We stayed hydrated, took breaks in shaded areas or inside museums/\nchurches/\nrestaurants. We had no issues."}, {"username": "Judy Charon", "comment_text": "Looks pretty terrific to me. Have a great time."}, {"username": "Ruth Akutu Maccarthy", "comment_text": "Listen, the weather is hot that's true but it's not like in Dubai 😁.\nChoose lightweight clothes, always have water bottles in your bags, eat fresh fruits and you can add a white small umbrella.\nYou'll be fine and enjoy ✨✨❣️"}, {"username": "Rachael Richardson", "comment_text": "We have done the same tour as you! We are in Rome now and come from the UK, where it is usually cold ! the heat is bearable if you are sensible, drink plenty of water. It is humid , so portable fab , hat, refillable water bottles there are fountains everywhere to refill for free. We did the 10am Vatican tour today it was fine, people on here are scaremongers - it was fine.\nYour other days sound fine."}, {"username": "Phyllis Snyder", "comment_text": "If you take small breaks to hydrate and rest then carry on- your family should be fine. And if all else fails- head to Boghese park and picnic, bike ride I think they have row boats- it’s green & shady- or rent bikes and ride the aqueduct park- take a picnic."}, {"username": "Lisa Kelly", "comment_text": "The only thing we cancelled last week was a vintage bike tour of Florence from 10-12:30. Just too hot after 11 to be peddling around. We napped / cooled down everyday from 11-3. I might cancel that gladiator dress up thing. That would be unbearable for me in the heat"}, {"username": "Krista Ford-Walcer", "comment_text": "Looks amazing have the best trip!!"}, {"username": "Molly Roberts Siegenthaler", "comment_text": "The Gladiator school is the one thing that our entire family loved without question!!! It was educational, fun and they have a pet wolf!😍It truly made our trip to Rome. They hopefully have the training lot shaded with shade cloth now."}, {"username": "Jeff McLellan", "comment_text": "Do the Rome 500 EXP if your husband or you is confident stick shift driver. Our girls loved it."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Don’t add anything. Your hotel will be the perfect oasis to end your trip. Enjoy it!"}, {"username": "Rachel Armstrong", "comment_text": "Is there places to swim to cool down"}, {"username": "Richard Stein", "comment_text": "We are in Rome now, your intenirary looks great. Is it hot, yes but afternoon breaks in the hotel are fine. It is cool in the morning and at night. Rome is a crazy alive city, it seems enormous but is very walkable. There are restaurants, museums and monuments everywhere. It's really fun here, my only is advice is portable rechargeable fans, because if you're in a crowded restaurant it can be warm and the little fan can be a god send, one for everyone."}, {"username": "Lisa Valdovinos", "comment_text": "We did the street food tour and it was awesome!"}, {"username": "Barbara Gentilcore", "comment_text": "Wet facewashers around your neck help also"}, {"username": "Raquel Pickering", "comment_text": "You cant miss the basilica! Make sure your Vatican trip isn't on a Wednesday as the pope does his mass and blessing and you can get 2000+ people in the square outside. We did a skip the line on a Wednesday and it was packed and mad and they cut the st peters basilica because of the mass. You can't miss the basilica it is amazing. - take your rosary and get it and yourselves blessed inside (just go to the confessionals inside they take confessions but also do blessings. We had a lovely priest whod been to Australia and had a 10 minute chat!) Also we attended a little mass in one of the alcoves inside. It was in latin and lovely. You can do the tombs there of past popes and go to the top of the dome! Take a handheld fan to the Vatican museums cause you so need it! You can also buy a cooling neck wrap online that you wet and stay cool. We had a 3 hour tour and wished we'd done a self guided audio. Most definitely need skip the line though. Enjoy your trip!!"}, {"username": "D'Anna Hohe", "comment_text": "I used to live across from Villa Borghese. If you don’t have a guided tour already, see if you can get on the guided museum tour - it helps if you know the history of the museum and it highlights the art work. Visits are limited to two hours so it also helps you pace yourself.\nYou can walk through the park to an overlook where you can view Piazza del Popolo. There are also places to rent bike carriages and golf carts in the park. There is a gated area that surrounds a lake and you can’t rent rowboats. The pond isn’t large but that or the pedal carriages might be fun for the teens.\nOnce you walk to the south end of the park (where the overlook is), you can head east and get more views of the city. You can finish at the top of the Spanish steps. There are several cafes in the park as well as vendors if you need drinks and the park is pretty and will get you out of the sun for awhile."}, {"username": "Erika Sa", "comment_text": "Don't cancel your trip!!"}, {"username": "Gommy Shirley Pribisco Brady", "comment_text": "Sounds Perfetto! Enjoy!!!"}]}, {"id": "2197267677338977", "text": "I am at the end of booking our trip and am thinking I would love a vineyard tour and dinner… is this possible?", "link": "facebook.com/groups/1373361046396315/permalink/2197267677338977/", "likes": 4, "comments": [{"username": "Judy Charon", "comment_text": "Most definitely. Check out the Chianti tours."}, {"username": "Jayne Dawson Meyer", "comment_text": "Yes."}, {"username": "Vikki Hoffman-o'connor", "comment_text": "Where? We spent a month in Italy and we are foodie/ winies. I can help"}, {"username": "Vikki Hoffman-o'connor", "comment_text": "OK all...as promised...all excellent: Sicily - wine tasting: Baglio Sorìa Firriato winery (Trapani), Donna Franca (Trapani - nice sunset dinner and tasting), Tenuto del Gelso (Catania), Nicosia Winery (Catania). Eating: La Lopa and Baccanti (Matera). Eating in Polignano a Mare: Antiche Mura, if eating at Grotta Palazzese make sure you go when it's still light out. Wine and food: Cantina del Vesuvio Russo Family (Vesuvius - excellent wine AND food with beautiful view of volcano). Saturnia (technically part of Tuscany): for the hot springs! Eat at I Due Cippi! Tuscany: Castiglion Del Bosco, Enoteca la Fortezza (wine tasting in the fort - Montalcino), Altesino Winery, Poggio Rubino, Corte Pavone, Baracchi Winery. Aosta: Osteria da Nando (for fondutta - Stanly Tucci recommended!). Alba: Bosca Winery. Near Verona: Pietro Zardini Winery, La Cucina de Verona (excellent cooking class with wine), Bonazzi Dario e Fabio. Venice: Ristorante Al Paradiso, Bar All’Arco, Al Cove, Barbacani Michelle Michelle Plutto"}, {"username": "Janet Isaacs Lanza", "comment_text": "We just did this today and it was fabulous! We did lunch though, not sure if they have dinner.\nhttps://\nwww.tripadvisor.\ncom/\nAttractionProduc\ntReview-g187782\n-d17576845-Cort\necorbo_Irpinia_\nwines_tour_of_t\nhe_vineyards_Co\noking_class_win\ne_tasting-Sorre\nnto.html#"}]}, {"id": "2197269404005471", "text": "Taormina, Sicily ￼stole my heart!", "link": "facebook.com/groups/1373361046396315/permalink/2197269404005471/", "likes": 72, "comments": [{"username": "Laura Compitello Mutter", "comment_text": "Yes, it’s beautiful"}, {"username": "Karen Cumbo", "comment_text": "Karen Cumbo"}, {"username": "Bob Graham", "comment_text": "Is that the White Lotus filming location? Beautiful"}, {"username": "Larry Reinier", "comment_text": "We enjoyed our time there as well"}, {"username": "Jacqui Ann", "comment_text": "Agreed!"}, {"username": "Val Westlake", "comment_text": "Val Westlake"}]}, {"id": "2197269864005425", "text": "Are there Taxis at FCO airport after MIDNIGHT", "link": "facebook.com/groups/1373361046396315/permalink/2197269864005425/", "likes": 1, "comments": [{"username": "Aaron Loree", "comment_text": "Yes. They keep coming all night."}, {"username": "John Bruckman", "comment_text": "Of course"}, {"username": "Romina Lauretig Toscano", "comment_text": "Sure"}, {"username": "Muhammad Arslan", "comment_text": "24h"}, {"username": "Phillip Farquhar", "comment_text": "Get the Samarcanda app good company they will pick up up at airport"}, {"username": "Bonnie Loftspring", "comment_text": "Taxis are very aware of flight schedules & know they will get fares."}]}, {"id": "2197272467338498", "text": "Recommendations for a B&B/ Farm in the country near Pienza or Montalcino !!!", "link": "facebook.com/groups/1373361046396315/permalink/2197272467338498/", "likes": 0, "comments": [{"username": "Charlotte Paul", "comment_text": "Absolutely The Isabella Experience"}, {"username": "Simone Pfenninger", "comment_text": "Podere il Casale between Montepulciano and Pienza"}]}, {"id": "2197284067337338", "text": "Any suggestions on booking a water taxi in Venice to marco polo airport?\nBy phone et app? Just arrived today.\nThanks in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2197284067337338/", "likes": 0, "comments": [{"username": "Bella Brown", "comment_text": "My mother and I were in Venice few weeks ago and we used Consorzio Motoscafi Venzia, they arrived at our hotel before schedule pick up. Would recommend then! Roughly 150 euros from our hotel to the airport https://\nwww.motoscafiven\nezia.com/it/"}, {"username": "Eric Maurer", "comment_text": "Eric Maurer"}]}, {"id": "2197286564003755", "text": "Ciao friends. My husband and I are planning a trip to Italy hopefully in September 2024. My great grandmother and grandmother came from a town called Agira in Sicily. Has anyone been there or know of it? ￼", "link": "facebook.com/groups/1373361046396315/permalink/2197286564003755/", "likes": 0, "comments": [{"username": "David Fidgeon", "comment_text": "When you put that name into Google you get the facts and contacts !"}]}, {"id": "2197286780670400", "text": "Hello! Has anyone in this group ever been to Serino, in the Avellino province of Campania? Tips? Must do/sees? TIA 😊", "link": "facebook.com/groups/1373361046396315/permalink/2197286780670400/", "likes": 0, "comments": [{"username": "Carrie Hulsey Lindholm", "comment_text": "Following. I’m trying to learn as much as I can about this area."}]}, {"id": "2197286794003732", "text": "Hello again! May I ask what app is best to help me translate from English to Italian to be able to communicate? Thank you sooo much!", "link": "facebook.com/groups/1373361046396315/permalink/2197286794003732/", "likes": 2, "comments": [{"username": "Cecilia Christine Costantini", "comment_text": "Googletranslate\nworks ok for short sentences and will also pronounce them for you."}, {"username": "Kristina Ruk", "comment_text": "People talk perfect/\nunderstandable english in Italy so not neseccary any apps ;)"}]}, {"id": "2197288507336894", "text": "We are going to Rome next week with our family. we are staying at a villa in Capena. The kids range in age from 6-13. We’re letting the adult kids go to florence overnight overnight. My two questions are what to do with kids in and around Rome. If anyone has been to capenaCapena, is there anything to do in that area with the kids. Weve booked tours for the Vatican, the Colleseum and the Catacombs.", "link": "facebook.com/groups/1373361046396315/permalink/2197288507336894/", "likes": 2, "comments": [{"username": "Romina Lauretig Toscano", "comment_text": "Activities for kids in Capena, no.\nIn Rome, EUR area:\nhttps://\nshop.luneurpark.\ncom/it/vendita/\nbiglietti?gclid=\nCj0KCQjw2eilBhC\nCARIsAG0Pf8ta-o\n1GHMuL-Jv1FbNNK\nEQgusSBMjum8bC2\npsvnrgLa3bq3Dw0\n-6uwaAujTEALw_w\ncB"}, {"username": "Cecilia Christine Costantini", "comment_text": "If you drive, 1 hour from Capena you can go to Bomarzo, Parco dei Mostri, I loved it as a kid."}, {"username": "Laura Uribe", "comment_text": "The younger ones might enjoy the zoo, Bioparco Di Roma. It’s about 30 minutes from Capena."}, {"username": "Nimirta H Lulla", "comment_text": "Which site did you use to book the tours for Vatican? Looking at private tours ?"}]}, {"id": "2197292377336507", "text": "Hi. We are planning to go to to Italy in August. I am confused wether I should skip Venice or it’s worth going. I am getting mix reviews. Pls help!", "link": "facebook.com/groups/1373361046396315/permalink/2197292377336507/", "likes": 19, "comments": [{"username": "Kelly Groenendaels", "comment_text": "Dont skip it...you will regret it later if you do..."}, {"username": "Lynne McInally", "comment_text": "Venice I loved!"}, {"username": "Laura St James", "comment_text": "Venice was one of the best parts of my trip. It might not be as enjoyable in August, but if that's the only time you can go, make the most of it! Explore during early morning and at sunset, and rest during the heat of the day."}, {"username": "Steph Smith", "comment_text": "We loved Venice!"}, {"username": "Sarah Penfold", "comment_text": "Venice was my favorite city"}, {"username": "Sshona Ssmillie", "comment_text": "I am a believer in doing what you think, everyone is different and just because someone does or doesn’t like something it does mean you will feel the same way. Do some you tube videos or watch a couple of travel shows and take it from there. I guess what I am saying is suit yourself knowing what you like and dislike"}, {"username": "Barbara Kistler Wilhelm", "comment_text": "Definately venoce plus murano and burano"}, {"username": "Dave Colleen", "comment_text": "That is a decision only you can make. Not everyone likes Disneyland but those that do love it. I love Venice."}, {"username": "Tony Mancini", "comment_text": "Anyone saying to skip Venice is looking at it as a check mark off of a list.\nVenice is a unique and beautiful city. There are no other like it .\nThe city will mark you( pun intended) and give you a lifetime of memories.\nDON'T SKIP IT"}, {"username": "Sarah Hartley", "comment_text": "I would personally skip it! Much preferred other places in Italy"}, {"username": "Linda Santucci Fries", "comment_text": "I absolutely love Venice. I’d never miss it."}, {"username": "Romina Lauretig Toscano", "comment_text": "Go!"}, {"username": "Becky Yu", "comment_text": "My 1st trip to Italy, I only did Rome and Florence because we were short on time and I had also heard mixed reviews. This time, we did those same two and added Venice. I'm here to say Venice is a must even if you just go once. It's so unique and we loved going to Murano and Burano from there too!"}, {"username": "Erica Lowy", "comment_text": "You must see Venice. There’s nothing like it on this planet!!!"}, {"username": "Sara Hackett", "comment_text": "I loved Murano."}, {"username": "Heidi Shaffer Montecino", "comment_text": "Venice is awesome!!! Italy is awesome."}, {"username": "Letty Veronica", "comment_text": "Oh my gosh Venice is tied up with Capri as my favorite. We were there two weeks ago and it was not crowded like people say"}, {"username": "Kathy Flood", "comment_text": "Go!!!"}, {"username": "Kristina Ruk", "comment_text": "Worth it 300 %🤣. just go to every place once in a life time to have your opinion.."}, {"username": "Clare Lynda", "comment_text": "Venice is unique touristy but you have to go once in your life\nHead for the back streets"}, {"username": "Jennifer Brown", "comment_text": "I think everyone should experience the uniqueness of Venice. There is no place like it in the world.\nI'm really glad I went and saw Venice but I don't need to go again. I much prefer so many other parts of Italy and Sicily but Venice is a must see in my opinion ☺️"}, {"username": "Daniela Parhar", "comment_text": "I’d use the time I have in visiting other cities before going to Venice. I know most people find it beautiful but I’ve been twice and just can’t like it. I did like Murano but in my opinion, there’s so many other cities that are better. Personally, I love Florence, Siena, Milan or Rome better."}, {"username": "Rhonda Russell", "comment_text": "Absolutely. I was told 2 days would be too long, glad I didn’t listen. Spent 2 weeks exploring and loved every minute. Don’t miss Torcello"}, {"username": "Wendi Dusseault", "comment_text": "Go! It's something you should see!!!"}, {"username": "Dr-Jon Warnecke", "comment_text": "I always tell people that Italy should be visited in regions if you can only go 10-20 days. Visit smaller villages around the tourist areas for a feel of how Italy really is/was. But Venice really is a must-see!"}, {"username": "Nikki Blosser", "comment_text": "Venice is worth a visit. We have been twice and want to go back. There are different islands to visit while there and the beautiful St Mark’s. Plus oodles of bridges to cross, areas to get lost and to enjoy the beauty of the buildings and the canals."}, {"username": "Graham Sherlock", "comment_text": "Yes go, you have to see it."}, {"username": "Graham Sherlock", "comment_text": "August is way too hot in Italy though, July has been extreme, August we be worse"}, {"username": "Katie Ewers", "comment_text": "Loved Venice, awesome place!"}, {"username": "Krissy DaRusso", "comment_text": "💯 worth going! I heard mixed as well and I’m so grateful I experienced it for myself. I was their very briefly, 2 days!"}, {"username": "John Cosenza", "comment_text": "Its 100% worth it. Just was there last week"}, {"username": "Leslie Henise Kelly", "comment_text": "Skip. It will be so hot and crazy crowded. Go to Verona instead or anywhere else."}, {"username": "Pietro Adami", "comment_text": "It’s simply …. unique! A must-see"}, {"username": "Gail Dial Harris", "comment_text": "I consider it a must! JS"}, {"username": "Rachelle Ethington", "comment_text": "Never skip Venice and stay overnight. After the day tourist leave for the day, Venice transforms and is so beautiful."}, {"username": "Richard Rodriguez", "comment_text": "Worth going in comparison to other places? Mostly depends where but you’ll miss much more not going to Sorrento instead."}, {"username": "Kimberly Miller", "comment_text": "We were there in May and loved it!"}, {"username": "Lisa Long", "comment_text": "I love Venice"}, {"username": "Mary Evans", "comment_text": "Venice is my favorite city."}, {"username": "Laurie Frainetti", "comment_text": "￼ I think Venice is definitely worth seeing once in your lifetime if you can. I wouldn’t skip it even if just for one day."}, {"username": "Phyllis Snyder", "comment_text": "How much time is your vacation? I wouldn’t skip Venice if you have the time."}, {"username": "Wendy Bey-Sottovia", "comment_text": "Venice is great!"}, {"username": "Rebecca A. Baer", "comment_text": "I loved it and the side trip to Verona!"}, {"username": "Sue Perks", "comment_text": "Sue Perks"}, {"username": "Leila Jane", "comment_text": "Venice is unique. There is no other city like it anywhere. I wouldn't miss it."}, {"username": "Sue Perks", "comment_text": "Sue Perks"}]}, {"id": "2197294160669662", "text": "Help! I had booked a pizza/gelato making class via Get Your Guide for Aug 21 and it was cancelled- any tips for other similar options in Rome? Thinking I should book directly with a place….. (added a pic of pretty flowers on my morning run today, as a thanks for your help!!)", "link": "facebook.com/groups/1373361046396315/permalink/2197294160669662/", "likes": 3, "comments": [{"username": "Kim Hudson", "comment_text": "https://\nwww.inromecookin\ng.com/\nWe were just in Rome and had a fantastic experience here. Way exceeded our expectations and so much fun!"}, {"username": "Anita Downey", "comment_text": "This is in Frascati only a 30 minute train ride from Rome. Awesome experience https://\nwww.fromscratche\nxperiences.com/"}]}, {"id": "2197297574002654", "text": "Hi, i have 2 kids age 3 and 5 and planning to go to Italy in mid August, what would you recommend, sicily or Sorrento ?! With Some hotels recommendation please. Thank you in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2197297574002654/", "likes": 2, "comments": [{"username": "Carolyn Chambers Rosamilia", "comment_text": "It’s pretty late. Best to check a booking site for availability in both places and make you decision based on what you find is still available. I’ll warn you, the pickings will be slim anywhere this late."}, {"username": "Iliana Zlatareva", "comment_text": "Sorento"}, {"username": "Alice Francesca", "comment_text": "Can you postpone to the first or second week of september? Middle of August is THE national holiday (Ferragosto) and unless you find a cabin at 3000 meters up in the Alps, everywhere else will be overcrowded and very expensive"}, {"username": "Roland Trego", "comment_text": "￼ For beaches, I would recommend Sicily. Sorrento is going to be more expensive than Sicily. The truth is, however, you are going to have a really rough time finding any hotels￼ on such short notice. August is peak vacation month in Italy. You might have better luck in Puglia."}, {"username": "Anna Buchan", "comment_text": "Sorrento"}]}, {"id": "2197294554002956", "text": "Narrowing down where we want to stay in Rome. Has anyone stayed at Hotel Romano, River Palace Hotel and/or Casa I Cappuccini?", "link": "facebook.com/groups/1373361046396315/permalink/2197294554002956/", "likes": 0, "comments": [{"username": "Beth Talbert", "comment_text": "We stayed at Hotel Forte near The Spanish Steps. Quiet street and lively area of town."}]}, {"id": "2197299734002438", "text": "Our first stop in Sardinia ..two nights at Hotel Bitta in Arbatax....highly recommend amazing staff . We would never have found this place without our travel agent . Clearest water I have ever swum in and inआणखी Australia we have some amazing beaches but this was just stunning. The place was full of Europeans holidaying. I didn't hear any English being spoken ...a truly beautiful spot I just wish we had stayed more then two nights .", "link": "facebook.com/groups/1373361046396315/permalink/2197299734002438/", "likes": 141, "comments": [{"username": "Judy Charon", "comment_text": "Fabulous. Thank you for sharing this!"}, {"username": "Pietro Di Sorbo", "comment_text": "Yes, this is Sardinia, Arbatax?\nYou haven't seen anything yet, Sardinia beaches are heaven on earth."}, {"username": "Micheal Loveridge", "comment_text": "Great pics, I love going somewhere and not hearing anyone speaking English"}, {"username": "Paula Brink", "comment_text": "That looks divine, thanks for sharing. Sardinia has been on our list for a while..hopefull\ny in 2024!"}, {"username": "Nicole Buchanan", "comment_text": "Looks stunning!"}, {"username": "Debbie Lyons", "comment_text": "These pics are beautiful. Sardinia is on our list too. We're from Australia and wondering are you driving around the island"}, {"username": "Christine Broussard", "comment_text": "That looks amazing!!"}, {"username": "Mariposa Mariposa", "comment_text": "Beautiful 🤍🇮🇹"}, {"username": "Krista Missons", "comment_text": "Isabel Isidro Collings 💗"}, {"username": "Jo Courage", "comment_text": "Was it expensive this accom??"}, {"username": "Katrina Wybrow", "comment_text": "Lovely. What did it cost per night?"}, {"username": "Tanya Oke", "comment_text": "We stayed there in May great place try the seafood co-op near the harbour best seafood x"}, {"username": "Katie White-Meade", "comment_text": "This post is fantastic. Thank you."}, {"username": "Mardi Lee", "comment_text": "That looks heavenly ! Shivering here in Australia but happy for you!"}, {"username": "Sue Ramsey", "comment_text": "Wow looks stunning 😍"}, {"username": "Simone Gore", "comment_text": "Stunning"}, {"username": "Holly Baldassare", "comment_text": "Wow! Great pics. This place looks like a dream!!"}, {"username": "Charlotte Morris", "comment_text": "How beautiful 😍 looks so picturesque and relaxing. I would love to go here but I’ve just checked on booking.com and it says no children can stay here 😩"}, {"username": "Agata PM", "comment_text": "You should go to Stintino. One of the most beautiful beaches in Europe I've ever seen."}, {"username": "Adriana Sormani", "comment_text": "Sardegna us so beautiful!"}, {"username": "Michelle Cross", "comment_text": "Apple Cross"}, {"username": "Amanda Jane Worthington", "comment_text": "Heavenly 🇮🇹 ♥️"}, {"username": "Amber Markiewicz", "comment_text": "Absolutely gorgeous!!!"}]}, {"id": "2197302354002176", "text": "Can anyone recommend an app or series of videos to learn some basic Italian needed for travel? I’ve been using the Duolingo app, but I seriously doubt I will at any time need to write out and spell correctly that “she writes in the newspaper”. 🤷🏻‍♀️\nJust want to be able to somewhat converse and understand someone speaking to me in a shop or restaurant. Help!", "link": "facebook.com/groups/1373361046396315/permalink/2197302354002176/", "likes": 60, "comments": [{"username": "Andrea Karina Niazi", "comment_text": "You don't need much italian to visit. Most Italians speak English and they are very nice and sweet people in general."}, {"username": "Sandy Kemnitzer Fritchie", "comment_text": "Drops"}, {"username": "Sharon Jones", "comment_text": "We had a lot of fun with Coffee Bread Italian from Amazon music"}, {"username": "Josie Gilbert", "comment_text": "busuu is better, I got sick of Chiara and I am from Philidelphia, when I am in fact from Sydney. Wasn't very useful"}, {"username": "Linda Prunkel Reinhard", "comment_text": "There’s a podcast called CoffeeBreak Italian. Its more conversational."}, {"username": "Carine Brys", "comment_text": "I think I saw Google Translate offer a link for common traveling expressions. You will first need to select English to Italian, of course."}, {"username": "Carine Brys", "comment_text": "Hahaha, over here in Europe there used to be books to learn English. Assimil, they were called. Who doesn't know the expression \"My tailor is rich!\" That is SO useful to know, don't you think? 😂"}, {"username": "Dawn King", "comment_text": "Duolingo is great if you want to learn the language properly but I think Rosetta Stone has a travel setting"}, {"username": "Denis Claros", "comment_text": "Just use google translate. Translate the words/phrases you think you will need (common courtesy, “help with…”, etc), listen to the pronunciation and memorize it."}, {"username": "Kimberly D Caruso", "comment_text": "coffee break italian podcasts"}, {"username": "Angela Hollis", "comment_text": "Go to YouTube and look for Rick Steves Beginning Italian for Travelers with Trish Feaster. That will get you a long way. I also like Rick Steves pocket Italian phrase book. He has all the restaurant and food vocabulary in there too.\nI found Duolingo annoying too."}, {"username": "Amy Kaye", "comment_text": "Don't waste your time, use Google translate if needed."}, {"username": "Linda McCrea", "comment_text": "Check out Italki where you can choose your tutor/teacher by reading their profile and listening to them on line . Private lessons for your specific needs."}, {"username": "Rachel Wright", "comment_text": "Ha ha ha. My husband as been on Duolingo for months. I just learnt how to say ‘Hello, Thank you, Please, Beer, Red Wine, White Wine. I think I’m sorted 🤣"}, {"username": "Kate Caldwell Ambrose", "comment_text": "My favorite useless Duolingo phrase is “Un gatto non e una persona.”"}, {"username": "Lara Rebecca", "comment_text": "I like the tutors on Preply."}, {"username": "Lauren Vassallo Beattie", "comment_text": "Parlo Italiano, un pò. The most common phrases you will need,\nDove il bango\nCiao, buongiorno and buonasera\nGrazie, per favore\nCome sta, va tutto bene or if you just come off a 12 hr flight sto molto stanco 😅\nQuanto costa\nCibo molto buono or buonissimo if they ask how was the food\nThat's pretty much it\nOr if someone pisses you off, che cazzo fai, fare incazzare, or in a joking way that u don't give a s.... e sti cazzi 😅"}, {"username": "Tracy Krause", "comment_text": "I feel the same abut Duolingo.\nI learned everything I needed for my trip last month from Stefano on YouTube"}, {"username": "Carrie Jaquess", "comment_text": "Check your local adult school or adult continuing education department through the local school district. We've been studying Italian for five years through our adult school and the first session (which was once/week for 8 weeks) was essentially Italian for travelers. The instructor included fantastic info for traveling to Italy such as info about Apertivo, coperto, how to find good restaurants, how to order coffee and pastry, how to find restrooms (just go into a bar and order an espresso for €1), etc."}, {"username": "Connie Vitale", "comment_text": "Pimsleur. It’s great."}, {"username": "Sue Gelardi", "comment_text": "This is all you need to know. Just joking."}, {"username": "Gloria Park", "comment_text": "https://\nwww.youtube.com/\nwatch?v=K6G_clfR\nX5U\n\nItalian Phrases To TRAVEL (TOP 25 Phrases You Need in Italian) Learn Italian with Teacher Stefano)"}, {"username": "Gloria Park", "comment_text": "https://\nyoutu.be/\nVeH03PzD25E"}, {"username": "Sandra Vilters-boer", "comment_text": "Say Hi app is great. I use it in my work to communicate with people from all over the world"}, {"username": "Ellen Martin Weglarz", "comment_text": "Babble"}, {"username": "Nicole Alexander Taule", "comment_text": "I found good information on Pinterest."}, {"username": "Anna Gambino", "comment_text": "Google translate. Basic phrases. I also have a set of “Learn Italian” CDs that I play constantly in my car. Trying to retain as much Italian as I can."}, {"username": "Ilana Brongiel", "comment_text": "I’m on day 83 of Duolingo. Just asked some women in my city if anyone wants to work on Italian. Hoping to get some real time practice conversations that way. I’m fairly happy with Duolingo but agree that some of the stuff is weird!"}, {"username": "Kris Carr", "comment_text": "I remember a great sentence from a book Avanti from High School Italian - “Dario e’ sempre in retardo”. Dario is always late! Very useful 😂"}, {"username": "Michelle Anderson- Rowland", "comment_text": "Keryth Rowland here are some ideas for you."}, {"username": "Meredith Holloway Helbon", "comment_text": "Following"}, {"username": "Colleen O'Conner", "comment_text": "My husband likes Pimsleur app. It will stretch your brain but you will come out speaking Italian! He’s learned 3 languages-two thru country emersion, with tudors & with various apps and highly recommends Pimsleur!"}, {"username": "Jazz Caldwell", "comment_text": "You won't need much...try Babbel!"}, {"username": "Kim Fox", "comment_text": "Following"}, {"username": "Peggy Frasca Prichard", "comment_text": "Duolingo uses repetition to teach how to conjugate etc.. agree, it doesn’t start with travel phrases but you can google those and memorize. It’s good to understand how their use possessive, plural, etc."}, {"username": "Peggy Frasca Prichard", "comment_text": "Peggy Frasca Prichard"}, {"username": "Sally Wilkinson", "comment_text": "Are you anywhere near St Petersburg Florida?"}, {"username": "Rosi Hubbard Slater", "comment_text": "Pimsleur is excellent and you speak the language from day 1."}, {"username": "Cheri Fox", "comment_text": "Joseph Albertson"}, {"username": "Carley Greive", "comment_text": "I remember I was all amped when I started Duo then I randomly got the phrase “Quando muoiono?” (When do they die?) and I was like 😳"}, {"username": "Robin Samson Pratt", "comment_text": "Watch soap operas in Italian"}, {"username": "Janie Bishop", "comment_text": "I signed up for Kleo . It’s interactive and they correct you ."}, {"username": "Carrie Aageson", "comment_text": "I’ve been using Pimsler. I love trust the lessons begin very basic, are 30 minutes (perfect for my morning walk) and you can easily repeat and they have “learning games” with each chapter"}, {"username": "Teri Mayo", "comment_text": "We found pimleur to be very helpful for learning things a tourist needs. Duo is great if you're trying to learn the language but not so much for functioning as a tourist."}, {"username": "Kimberly MacKinnon Cherry", "comment_text": "Pimsler is good. We used it before our trip to Southern Italy last April, it was very helpful. I studied 30 minutes a day for about 6 weeks. It really helped in grocery stores and other less touristy places."}, {"username": "Alexandra Chase", "comment_text": "I receive an email each day from dailyitalianwor\nds.com. It may be helpful with commonly used phrases."}, {"username": "Soc Cer", "comment_text": "they all speak english in tourist towns/cities now....not only that....there are so many dialects throughout Italy, that unless you learn to speak proper Italian or that specific dialect for that region, they won't understand you anyways."}, {"username": "Connie Ryder", "comment_text": "These comments and this post are hilarious 😂. I’ve been so busy I haven’t tried, but I am going to laminate a card in Italian and Greek for my food allergies. Tomato allergy going to Italy 🤦‍♀️."}, {"username": "Sam DeVizio", "comment_text": "https://\nopen.spotify.com\n/show/\n3YHxZ1AQDuS8PQR1\nqu87lP?si=WQN7C\nvXNQBOTbdqf8N_G\nOw\n\n“Learn Italian with Joy of Languages” podcast has been pretty good. The episodes are short, and they give good tips on how to order food, gelato, wine etc. The episodes are labeled so you can get an idea of what they’re about- for example one was about boarding trains and went over phrases that would be useful."}, {"username": "Leah Chapman", "comment_text": "YouTube has heaps of choices! I just searched “learn basic Italian for travel”. Have a great trip 🇮🇹"}, {"username": "Diana Himes", "comment_text": "Look up Italy Made Easy on YouTube. Manu has Dozens of free lessons there. He also has a pay site that is like taking college courses in Italian which is phenomenal but not needed for the basics. I use both as I’ve traveled to Italy quite a bit post pandemic."}, {"username": "Ashley Dyer", "comment_text": "Duo is worthless, invest in Babble. You don’t need to know how to say “monkey” in your Italian travels. 🤦🏻‍♀️😂"}, {"username": "Peter Morgan", "comment_text": "Try Michel Thomas system\nHe has a very good way of encouraging a natural conversational style of language learning\nMy wife and I , with no French, were able to learn and sensibly use a couple of hundred words and expressions after only a couple of weeks"}, {"username": "Laura Torres Palomino", "comment_text": "Look on YouTube….so many videos on conversational Italian. I made a list in my phones Notes 😊…and I used it!"}, {"username": "Janice Schollen", "comment_text": "Exactly my thoughts about Duolingo as well😆"}, {"username": "Matthew Hills", "comment_text": "Italy made easy on YouTube"}, {"username": "Beverley Milson", "comment_text": "I’ve been learning Italian for about 8 years. I can now read, write, speak in Italian comfortably but still find it difficult to understand as Italians speak pretty fast. I can understand for awhile but then my brain simply cannot keep up. I manage well in Italy but can’t imagine any app that would teach you to string words & grammar together without lots of practice. Good luck… I suggest you simply learn a few common expressions & phrases you may use."}, {"username": "Kathleen Roll", "comment_text": "If you get guidebooks on Italia there are usually some great sentences in the back about situations that you may find yourself in.\n\nI am sure even Duolingo 😂 has taught you good the basic greetings, please and thank you.\n\nSo -\nVorrei - I would like\nMangiare - to eat\nChoice -\nUna pizza (plus type)margarita/\npeperoni (peppers not pepperoni much to my husbands shock)\nSpaghetti vongole (spaghetti with clams) etc\n\nBere? To drink?\n\nUna limonata per favore (a lemonade please)\nDue birra (2 beers)\n\nUn caffè\nUn cappuccino\nUno shakerato ( a shaken coffee, cold and yum but always with sugar. I do not do sugar but when it’s cold, believe me without is BITTER)\nUn tè (a tea)\nUn Aperol spritz ( because!)\nUna bottiglia di vino rosso (we all know what that is 😂)\nUn gelato cioccolato (chocolate ice cream)\n\nVorrei il conto per favore ( I would like the bill please)\n\nMi piace (I like)\nMi piace molto ( I like it a lot)\nSaporito (tasty)\n\nDov’è (where is)\nIl bagno (the bathroom)\nL’albergo (the hotel) + name\nLa fermata dell’autobus (the bus stop)\nLa stazione ferroviaria ( railway station)\n\nDi sopra (upstairs)\nDi sotto (down stairs)\n\nGira (go)\nA sinistra (left)\nA destra (right)\nAttraverso (through)\nDietro (behind)\nDavanti (in front)\nIndietro (inside)\n\nHo bisogno …. (I need)\nUn dottore\nUna farmacia\nUna dentista\n\nHo (I have)\nUn mal di testa (headache)\nUn mal di stomaco\n\nPermesso (excuse me/ permission) when you want to get through people.\nMi scusi (excuse me)\nPrego (of course/ this way/ you’re welcome - the most spoken word in Italian 😂 )\n\nSign language is pretty clear when you see a pastry 😂 as is a smile.\n\nQuanto costa (how much)\nTrouble is always the answer unless you see a till with the numbers it is so quick, my brain doesn’t work so quickly with numbers)\n\nI hope that helps a wee bit.\nIn a restaurant be patient.\nIt is not rushed, they want you to enjoy the meal.\n\nThe usual rules - they do not put pineapple on pizzas!\nNo cappuccino after breakfast or especially midday - of course you will get one, and also silently judged 😂 I do not think any self respecting Italians would ever stoop to adding pineapple to a pizza as mama would not be happy)\n\nHo fame (I am hungry)\nHo molto fame (very hungry)\nHo sete (I am thirsty)\n\nHo perso (I have lost)\nMio marito (my husband)\nLa mia valigia (my case)\n\nVorrei\nComprare (to buy)\nUna borsa (a bag)\n\nAndare (to go)\n\nMuseo (museum)\nCattedrale (cathedral)\nL’ospedale (hospital)\nTeatro (theatre)\nNegozio (shop)\nNegozio di scarpe (shoe shop)\nIl ponte (the bridge)\n\nHave fun - depends where you go is the language level\nOf English - I have just had four days in Naples with friends and I needed my italian.\nRome, Venice, Milan, Sorrento and Florence etc not do much but it is always fun.\nEnjoy-"}, {"username": "Lisa Darley", "comment_text": "Michel Thomas is a listen and repeat approach. It’s fantastic."}, {"username": "Rachael Richardson", "comment_text": "Even if you try and speak Italian I find they know you speak English and they just speak back to you in English - I tried many times - most of them really don’t seem bothered ! As long as you know hello, please thank you and how to ask for the bill you will be fine"}, {"username": "Jen Alexitch Rachow", "comment_text": "Check your local library for audio books. i use the libby app to download from my library and listen and practice in my car when I am out and about- Bluetooth y my phone. It is free!!"}, {"username": "Gail Lafferty", "comment_text": "simplitalian on Instagram is fun."}, {"username": "Annie Nelhams", "comment_text": "I can recommend the Michel Thomas course - no homework, listen and join in."}, {"username": "Annie Nelhams", "comment_text": "Longer term the app italki enable you to have three trial lessons to find a one to one teacher you click with."}, {"username": "Liz Hayden", "comment_text": "I am using the babbel app. Lot's of emphasis on pronounciation.\nIt's 💲 though"}, {"username": "Marcela Martinez", "comment_text": "I feel you!! I’ve been doing the same app! By now, I’m an expert writing in the newspaper 😂😂"}, {"username": "Lisa Hedenberg Nichols", "comment_text": "90% of Italians speak English. Just google ‘basic Italian phrases’, memorize those and you’ll be fine. Hello, goodbye, please, thank you, etc. Been here and in France for 2+ weeks with no issue. 1/2 the time I end up saying something in French instead of Italian and then switch back to English, lol."}, {"username": "MaeLeigh Cf Cervantes", "comment_text": "Lei mangia una mela. Seriously how often will I need to say that"}, {"username": "Anita Grzeszkiewicz", "comment_text": "Head over to Instagram and check out Alessandro https://\ninstagram.com/\nlets.be.italians\n?igshid=MzRlODB\niNWFlZA%3D%3D"}, {"username": "Bea Kuckens", "comment_text": "Translator with Speech app on phone (Apple for sure, others ?). You can translate a single word or a phrase and hear it pronounced. Logo is a tongue sticking out of a mouth, printed like a world map."}, {"username": "Melissa Freas", "comment_text": "Been using babbel. Learning basics. Just need to be better about doing my lessons."}, {"username": "Debbi Mayfield", "comment_text": "I’ve used Coffee Break and Babel and so far after 6 months I can speak Ciao, grazie, and pronounce SOME places/foods🤦‍♀️\n60 year old brain is quite different than 20 year old who WAS fluent in Spanish haha.\nI’m in deep doodoo"}, {"username": "Hillary Lindsay", "comment_text": "I know exactly how you feel\nI’ve been using the Duolingo app too 🤣🤣"}, {"username": "Ed Murphy", "comment_text": "Ed Murphy"}, {"username": "Melodye Mitchell", "comment_text": "If you want to learn the Italian language and not just memorize a few phrases, then Duolingo works well. Once you learn how to conjugate the verbs and have a better understanding of the pronouns, you can make your own sentences. Otherwise just use Google translate"}, {"username": "Dee Scandone", "comment_text": "That’s exactly where I’m up to! I thought the same. It’s not really what I wanted to learn."}, {"username": "Michelle McNeil", "comment_text": "Babbel"}, {"username": "Jodi White", "comment_text": "Pimsleur (app) is good for conversational language. I’m currently using the Italian program, and I’ve learned more than I did in two semesters of college Italian."}, {"username": "Julie Thorpe Schlueter", "comment_text": "Go to Rick Steves website. They have four different language tutorials for tourists. Very helpful."}, {"username": "Dana Cook Anderson", "comment_text": "I use coffee break Italian."}, {"username": "Deborah Fagan", "comment_text": "Shaun Fagan"}, {"username": "Nicki Trueman", "comment_text": "I used Duolingo, but also took the lonely planet Italian guide. It was a small little book that I kept in my bag. Anytime I had a moment to myself (sipping an espresso ☕️ or a spritz) I would take it out, read, practice and that worked pretty well. I also keep common phrases on my phone in the notes app - things like “table for 2 please” and “I would like to have the *insert food name here*”\n😊"}, {"username": "Amanda Igoe", "comment_text": "Paul noble language series on audible. Excellent"}, {"username": "Angie M. Tarighi", "comment_text": "Honestly, just use YouTube for most used Italian phrases. Much easier and it will get you pretty far in communicating here. As long as you are trying, the locals will help."}, {"username": "Danielle Sardella Gosselin", "comment_text": "Marisa Gosselin so many suggestions!"}, {"username": "Mary Skvarch", "comment_text": "Mark Frobose’s\nAudiobook is excellent for beginners"}, {"username": "Rosemary Cataldi", "comment_text": "Learn Italian with Joy of languages. Short podcasts that you can listen to over and over. Katie and Mateo break it down in easy chunks!"}, {"username": "Jules Blumke", "comment_text": "Thanks for this information."}, {"username": "Meredith Holloway Helbon", "comment_text": "Following"}, {"username": "Lisa Bowen Hastings", "comment_text": "Coffee break italian podcast"}, {"username": "Roberta Nanni", "comment_text": "YouTube \"italiano per turisti\""}, {"username": "Nydia Bryan", "comment_text": "Busuu"}, {"username": "Carrie Lamm Bishop", "comment_text": "I was using Duolingo but got frustrated with it. Am now trying the Mango app, through my local library. One thing I especially like about it is explanations about the context and formal/\ninformal use."}, {"username": "Lynn Spataro", "comment_text": "I’m doing Rocket Italian (since June for a Sept trip) its good for for basic conversations like ordering food, getting train tickets, booking a hotel room. I really like the audio recording to check your pronunciation and it has a free one week trial before purchasing."}, {"username": "Katie Rhodes-White", "comment_text": "If you have audible - Learn Italian with Paul Noble"}, {"username": "Colleen Jennings", "comment_text": "Pinterest has some fantastic Italian posts."}, {"username": "Sharon Menegoni", "comment_text": "Duo Lingo!"}, {"username": "Mary Nadal", "comment_text": "I used the Pimsleur series for Portuguese before going to Brazil and really liked it - you might check out the Italian version."}, {"username": "Sara Mantei Broderick", "comment_text": "Coffee Break Italian is a great podcast on Spotify."}, {"username": "Eric Maurer", "comment_text": "We have been in Italy 2 weeks and haven't needed to use \"the turtle is in the table\" or \"I don't drink oil\" yet"}, {"username": "LaDaun Mitchell", "comment_text": "I like the CoffeeBreak Italian podcast."}, {"username": "Fetchin Gretchen", "comment_text": "I like pimsleur. Download to your phone or ipod"}, {"username": "Gloria Maledi", "comment_text": "hellotalk"}, {"username": "Pam Johnston-Hill", "comment_text": "You can also look up “Wolters world” (I think) on YouTube and he gives you some basic words that you’ll need"}, {"username": "Cheryl Zimmerman", "comment_text": "Prego is please, it works for a lot of things. Grazie is thank you, Dove il (pronounced Dovay il) means \"where is.\" Google simple phrases that you think you'll need like, How much is this? Or \"Do you ship.\" Keep them on your phone. They will come in handy. You don't need to speak the language because most people also speak English. But people also appreciate if effort is made."}, {"username": "Diane Kito", "comment_text": "Google translate app is great...can translate conversations in real time, can translate menus and can teach you correct pronunciation 😊"}, {"username": "Suzanne Hendriks", "comment_text": "It depends on where you go to. Most Italianen in popular areas speak English."}, {"username": "Lindsy Serrato", "comment_text": "Babbel"}, {"username": "Marla Simpson Ruzicka", "comment_text": "I’m liking the Pimsleur App. I’m learning conversations that I will likely have…mainly “I don’t understand Italian” but also helpful phrases."}, {"username": "Julie Bischoff", "comment_text": "Coffee Break Italian Podcast is excellent!"}, {"username": "Nancy Komatz", "comment_text": "Lots on YouTube"}, {"username": "Valerie Collanton", "comment_text": "Learn Italian with Lucrezia is good. YouTube videos. She has beginner content. I think the videos are better when you are a complete beginner as you get to hear the language. IMO DuoLingo isn’t enough when you are just starting"}, {"username": "Angel Marie Fultz", "comment_text": "I have used Pimsleur to learn basics for several countries. It’s great about focusing on useful phrases that a tourist will use. I have found it to be much more useful than Rosetta Stone or Duolingo. I was able to pick up entry level conversational skills for Japanese, Thai, Twi, German, and Dutch over the years, and plan to use it again to learn to speak some Italian."}, {"username": "Jessica Wilson Glaspell", "comment_text": "Same here. 🤪🤪. I thought I was the only one. And, as you mentioned in one comment, I have that Cajun accent also and afraid I will butcher some of the pronunciation. 😉"}, {"username": "Christine Gautreaux Richard", "comment_text": "Italian Matters"}, {"username": "Eden Seery Thornton", "comment_text": "Try Coffee Break Italian podcast"}, {"username": "Inna Rozen", "comment_text": "Babbel"}, {"username": "Krystal Schinella", "comment_text": "Something that might be helpful is researching the phrases you often use in shops and on public transport. But it's one thing to be able to ask questions compared to receiving the answers in another language so also try translating the answers you can possibly receive. Things that go a long way are knowing how to say \"can I please have\" of \"excuse me, where is (location)\". Please remember that some phrases in English are said a different way in italian, so best bet is to make it simple and polite.\nSome of the phrases I often use:\n\"Scusami, quanto costa?\" Excuse me, home much does this cost? (Usually knowing general numbers will help, otherwise the person will sometimes write the number down/gesture it/write it on the eftpos machine)\n\"Posso avere una tavola per due per favore\" can I have a table for two please. Often i would recieve the question \"inside or outside\" in return at restaurants. Honestly just the fact that you are attempting to speak in italian goes a long way. Happy learning 🙏🏻💯"}, {"username": "JoLynn Waters", "comment_text": "You would be surprised what you will pick up from Duolingo. I am in Italy now and use a lot of what I learned. I also use Busuu as it is better at explaining sentence structure. But unless you have someone to converse with, it is very hard to get good at another language."}, {"username": "Antonella Borraccino", "comment_text": "Michelle Hebert Frederick please, write here what you want to know, I will help you."}]}, {"id": "2197303574002054", "text": "This is a question for all of you ladies with really long, thick hair or extensions. Can anyone recommend a good hairdryer for Italy? The one that I use at home is too powerful. I knocked out the breakers forआणखी the entire side of our hotel floor the last time I tried to use it there 🙈 I bought one years ago that was sufficient, but it has since died. ￼\nPlease don’t suggest that I let my hair air dry because that is not a possibility. ￼\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2197303574002054/", "likes": 2, "comments": [{"username": "Jamie Medeiros", "comment_text": "Honestly we just got back from Italy and I used the hotel one because it was one less thing to pack and I have two rows of extensions 22” length so a ton of hair and it worked fine. I washed every couple of days."}, {"username": "Kris Locatelli", "comment_text": "Here’s the one I take. Conair cord keeper 1875. If you’ll notice at the bottom of the handle there’s a small black disc…this allows you to switch from American wattage to European. Works great!"}, {"username": "Lisa Marie", "comment_text": "Lisa Marie"}, {"username": "Jackie Richards", "comment_text": "I take this on my trips to dry. Once is nice and dry, I either leave it or if I want it super straight use my flat iron. https://\nwww.amazon.com/\nRevlon-One-Step-\nDryer-Volumizer\n-Brush/dp/\nB097CNMZF5/\nref=asc_df_B097C\nNMZF5/\n?tag=hyprod-20&l\ninkCode=df0&hva\ndid=59836091855\n9&hvpos&hvnetw=\ng&hvrand=170883\n83611702720679&\nhvpone&hvptwo&h\nvqmt&hvdev=c&hv\ndvcmdl&hvlocint\n&hvlocphy=90118\n61&hvtargid=pla\n-1678147205441&\npsc=1"}, {"username": "Susie Dunn", "comment_text": "Fellow extension gal 💁🏻‍♀️ and I so appreciate someone asking this question."}, {"username": "Dina Mencarini", "comment_text": "I'm using this one for travel. I haven't tried it in Europe yet, but it is dual voltage so I'm hoping it will work.\nBaBylissPRO Nano Titanium Travel Dryer, Blue https://a.co/d/\n6hgcGLH"}, {"username": "Tania Lyons", "comment_text": "Dyson it’s the best"}, {"username": "Jared Mankins Scavotto", "comment_text": "Mine got fried with an adapter. I wouldn't chance anything other than what's provided by the hotel."}, {"username": "Jess Ica", "comment_text": "Air dry is a possibility, you just don't want it to be one 😂"}, {"username": "Cynthia Marie", "comment_text": "I use the one the hotels offer."}, {"username": "Anita Haynes Dawson", "comment_text": "This dries pretty good. High wattage. But have not tried it out of United States. Hope it works when we go to Italy. Had high ratings."}, {"username": "Cristina Maximciuc", "comment_text": "Did you try Dyson?"}, {"username": "Anna Cappeluti", "comment_text": "I’ve been in Italy for almost 7 weeks now and I bought my travel hairdryer with me, it’s a GHD. It has the dual voltage. There are hairdryers in most hotels but you have to keep your finger on the button for it to work which is a real pain if you have thicker hair. I also bought my straighter with me, I’m so glad I did as my hair doesn’t air dry well either. I’ve used both everyday with no problems. Their only small and don’t take to much room in your luggage.\nHave a fabulous time on your holiday. 😎😎🇮🇹"}]}, {"id": "2197312004001211", "text": "Does anyone have an idea how to see all five villages in Cinque Terre (staying in Florence) in a semi private group or private tour?", "link": "facebook.com/groups/1373361046396315/permalink/2197312004001211/", "likes": 1, "comments": []}, {"id": "2197312544001157", "text": "Florence- wine window", "link": "facebook.com/groups/1373361046396315/permalink/2197312544001157/", "likes": 336, "comments": [{"username": "Halle Simonetti", "comment_text": "Ronald Simonetti need a wine window here !"}, {"username": "Mark Irving", "comment_text": "Susan Stanton\nTony Stapley"}, {"username": "Branka Fogarty", "comment_text": "Love this ❤️ Dijana Dabic Tai Tran"}, {"username": "LaToya Thompson", "comment_text": "Anthony E. Thompson II we have to visit!"}, {"username": "Sam Woolls", "comment_text": "Liz Dyer"}, {"username": "Elsa Borrego Contreras", "comment_text": "Suzie Gallardo Irving Gallardo 🍷"}, {"username": "Robyn Hay", "comment_text": "Sue Shipsides Clancy Shipsides🍷🍷"}, {"username": "Tegan Dalton", "comment_text": "Rochelle Tunney"}, {"username": "Steve Capron", "comment_text": "Kerrie Capron"}, {"username": "Phyllis Snyder", "comment_text": "Just watched a view about these windows- how during the black plague they were a way to serve customers without physically contacting them- guess during Covid it was useful as well."}, {"username": "Josh Alexander", "comment_text": "Sharon Alexander"}, {"username": "Salvino Zaccone", "comment_text": "Véronique Licciardi"}, {"username": "Rachael Weaver", "comment_text": "Derek Weaver"}, {"username": "Gail Houston", "comment_text": "Bobby Parker x"}, {"username": "Stefanie Puckett-Hall", "comment_text": "Meredith Weaver Kier my envy grows"}, {"username": "Elizabeth Thorpe Vorster", "comment_text": "Barney Vorster bucket list !"}, {"username": "Jemia Gregory", "comment_text": "Connie Deiriggi"}, {"username": "Danielle Johnstone", "comment_text": "Darren Kerber"}, {"username": "Sheenal Kumar", "comment_text": "RaJa Kumar"}, {"username": "Julie McIvor", "comment_text": "Lynette Pitt. Gotta find this 😊"}, {"username": "Lea S Martinez", "comment_text": "Lexi Alyse"}, {"username": "Juan Ernesto Rez", "comment_text": "María Alejandra"}, {"username": "Eline Meyhui", "comment_text": "Delphine De Clerck iets voor ons? 😂😂😂"}, {"username": "Jenny Field", "comment_text": "Tracey Mcdonald Niamh O'Farrell Michelle O'Connell we need to go here"}, {"username": "Gianna Giovannetti", "comment_text": "Wine window of Palazzo Pucci, It was very busy this afternoon 😄"}, {"username": "Heather Crumpler", "comment_text": "Omg Amy Matte 🤣 this is my kind of window lol"}, {"username": "Tayte Hebert", "comment_text": "Omg I love this!"}, {"username": "James Saxton", "comment_text": "I saw somewhere that there is only one working one left. All the others are shut down."}, {"username": "Kathryn Wild", "comment_text": "I'm on my way!"}, {"username": "Rainha Jane", "comment_text": "Daryl Clark"}, {"username": "Hayley Vinko", "comment_text": "Kathy Miles this on your spreadsheet? 🍷"}, {"username": "Claire Appleby", "comment_text": "Tan McKee when in Florence!"}, {"username": "Melissa Rapa", "comment_text": "Katherine Galea 😍"}, {"username": "Matt-Kathy Stavely", "comment_text": "Scott Schomaker so you know I have to find one of these! And apparently you can walk around with a glass of wine"}, {"username": "Jenna Jackson", "comment_text": "Dawn Ferguson"}, {"username": "Holly Goins Kesler", "comment_text": "Johanna Green"}, {"username": "Kelli Fallon", "comment_text": "John Fallon"}, {"username": "Mel McCormack", "comment_text": "Tenniel McKenzie"}, {"username": "Darrel Mcdonald", "comment_text": "Leisa McDonald"}, {"username": "Michelle Horan", "comment_text": "Brigid Bradbury are you ready"}, {"username": "Brett Marson", "comment_text": "Debbie Marson ❤️"}, {"username": "Nikki Barrett", "comment_text": "Amelia Beatson this would be cool"}, {"username": "Carlee Wilkinson", "comment_text": "Grace Wilkinson can’t wait 😍😍😍"}, {"username": "Nikki Barrett", "comment_text": "Simran Bansal put this on your list!"}, {"username": "Brenton Walker", "comment_text": "Lauren Bevan"}, {"username": "Louis Ferdinand", "comment_text": "Michelle Nguyen"}, {"username": "Kaina Melly", "comment_text": "Paula Short"}, {"username": "Miranda Groeneweg - Suijkerbuijk", "comment_text": "Vicky Huiszoon Sebastiaan Bethlehem"}, {"username": "Luke Debbie Johnson Walker", "comment_text": "They are the best and so much fun. 😊"}, {"username": "Anna Skreiner", "comment_text": "Julia White add to your map!"}, {"username": "Amy J Stephenson", "comment_text": "Sam Hansford Laura Walter Brilliant!"}, {"username": "Tiffany Boland", "comment_text": "Dannielle Boland"}, {"username": "Trudie Macari", "comment_text": "Paula Copley you would love this 💋🤣"}, {"username": "Karlyn Canon", "comment_text": "Joaqui Canon why we didnt see this?"}, {"username": "Dave Jackson", "comment_text": "Wayne Martin Jane Martin Prev Eaves 🥂🥂"}, {"username": "Belinda Page", "comment_text": "Tracey Beckham for this - Bella Donna restaurant ( we ate there as well. Our friends who live in Florence took us there."}, {"username": "Linda Andersson", "comment_text": "Anna Hedenborg det du berättat om🥰✨️🍷"}, {"username": "Sharon Kay", "comment_text": "Libby Kay"}, {"username": "Kelly Jones", "comment_text": "Jordan Mulligan this is what you were telling me about, so cool!"}, {"username": "Simon Barrett", "comment_text": "Katy-Jane Britten"}, {"username": "Judy Charon", "comment_text": "Judy Charon"}, {"username": "Leighton Lee", "comment_text": "Looking forward to experiencing this soon!"}, {"username": "Judy Charon", "comment_text": "Looks wonderful! I’m hoping to be able to do this in September."}, {"username": "Maud Palmen", "comment_text": "Michael Sloen must see… and drink ☝🏻"}, {"username": "Kammey Evans McCord", "comment_text": "Cathy Brooks"}, {"username": "Mike Ward", "comment_text": "Is this Babea or is there another wine window in Firenze?"}, {"username": "Erika Clinton", "comment_text": "How do you find these?"}, {"username": "Bonnie Leann Sayer", "comment_text": "I have never heard of this but will definitely keep an eye out when I visit Florence ❤️ how much does it typically cost?"}, {"username": "Marie Peña - Marimon", "comment_text": "🥂❣️🥂"}, {"username": "Stacy Derouin", "comment_text": "I just love the history of these windows. Cool they thought to reopen them during COVID!"}, {"username": "Cristian Jimenez", "comment_text": "Karla Nos faltó ir 😄"}, {"username": "Benjamin Joseph", "comment_text": "Caroline Lenfant"}, {"username": "Darren Williams", "comment_text": "Lynette we must find one"}, {"username": "Arlene Meadows", "comment_text": "Karl Meadows"}, {"username": "Leanne Westcott", "comment_text": "Kim Noble Aimee Mauger"}, {"username": "Rhio Schulz", "comment_text": "Cheryl Hopgood"}, {"username": "Sandra Baxter", "comment_text": "We need these in Arkansas 😍"}, {"username": "Kara Tathem", "comment_text": "Michelle Power another reason to visit Italy 🥂"}, {"username": "Viki Borovsky", "comment_text": "Loved it,they are everywhere in Florence 🍷"}, {"username": "Tena Deans", "comment_text": "Amanda Dean we are totally doing this 🥂"}, {"username": "Kelly Bevan", "comment_text": "Reece Hallam I have found our next destination 🤣"}, {"username": "Karen N Alan Form", "comment_text": "Jo Fitzgerald Craig Fitzgerald loving this, we need to try"}, {"username": "Tammy Lynn Schmitt", "comment_text": "Jeff Schmitt"}, {"username": "Michelle Evans", "comment_text": "Ashleigh Bennett can’t wait 🇮🇹🥂"}, {"username": "Sarah Hadjinian Kirakossian", "comment_text": "I missed this 🙁"}, {"username": "Amy Clark", "comment_text": "Jackie Hill I’m writing a list of where these are 😉"}, {"username": "Dana Turner", "comment_text": "Susan Turner-Hill"}]}, {"id": "2197314944000917", "text": "Hi all, looking for anyone that’s taken the train from Paris to Monterosso in the Cinque Terre. Does the train go from Paris to Lyon and then slow down thru the French Alps to Turin, Italy? Is the scenery from Lyon to Turin worth taking the train -vs- flying to Milan from Paris and taking a train from Milan to Monterosso? Also, does the train from Turin go down along the Mediterranean Sea to Monterosso? Thanks for any input!!", "link": "facebook.com/groups/1373361046396315/permalink/2197314944000917/", "likes": 2, "comments": [{"username": "Alice Francesca", "comment_text": "I am from Turin.very scenic route by train from Lyon to Turin as you will be crossing the Alps!Turin is worth a visit too ,one or two days if you want to see the center, at least 3 or 4 if you go for the many Savoy family royal palaces ( Reggia di Venaria and others).The train from Turin takes you to Genoa in about 2 hrs, then a regional train to Cinque Terre."}, {"username": "Alice Francesca", "comment_text": "https://\nlavenaria.it/"}, {"username": "Alice Francesca", "comment_text": "https://\nwww.lonelyplanet\n.com/articles/\ntop-things-to-do\n-in-turin"}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "If you don’t want to see Turin or Milan just take a plane from Paris to Pisa or Genova and then 1 hour train to 5 Terre."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2197316684000743", "text": "Hi, heading to Venice tomorrow. Looking for recommendations please!\nAlso, approximately how much are the water taxis?\nThanks ☺️", "link": "facebook.com/groups/1373361046396315/permalink/2197316684000743/", "likes": 2, "comments": [{"username": "Laurie Morrison", "comment_text": "Check Monica Cesarato’s food tours"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Wander away from the crowds and the main attractions. Get a Vaporetto pass for the day. Enjoy!"}, {"username": "Mary Anne", "comment_text": "We paid €60 to get from train to St Marks Square and €80 for a prebooked pick-up from our hotel back to the station. Worth every cent."}, {"username": "Alexandra A Welker", "comment_text": "Water taxis are more expensive than water buses. Vaporetto(water\nbus) ticket price is about €9.50 (single trip ticket). If you plan on staying there more than a day, I suggest getting a vaporetto day pass (1,2,3 or 7day passes available) https://\npublic-transport\n.tickets-venice\n.com/\n?gclid=Cj0KCQjw2\neilBhCCARIsAG0P\nf8t-4sn3l-jlnh4\nfsQVWJwqO8vViJT\n2l3CpkRlJt2mGW6\nIl8a5vECkwaAlHX\nEALw_wcB"}, {"username": "Bella Brown", "comment_text": "I just came back from Italy a few weeks ago, my mother and I used Consorzio Motoscafi Venezia. The driver arrived before the scheduled pick up time. We had a flight to London at 8:30am so we got the Water Taxi just after 5am, roughly paid 150 euros for the two of us. Would definitely recommend! https://\nwww.motoscafiven\nezia.com/it/"}, {"username": "Gina Johannes", "comment_text": "Public water taxi is 9 euro, private can be 60-80 depending on where you are going. We were there last week. Today they are having a water strike. So no water taxis today!"}, {"username": "Dave Colleen", "comment_text": "Dolfin Restaurante is our favorite. About 10 minute walk from train station."}, {"username": "Eric Maurer", "comment_text": "We paid 60 from the train station to San Zacharia and 150 back to the airport from the hotel. https://\nmaps.app.goo.gl/\nfK4v5GQurJq138co\n8\n\nhttps://\nmaps.app.goo.gl/\n383kEYBNjAreuDhm\n7"}, {"username": "Lynne McInally", "comment_text": "I picked the hotel across from the train station l. No water taxi taken. Venice was my favourite place. #hotelanticheFi\ngure"}]}, {"id": "2197158497349895", "text": "Day 3: Giovinazzo - Matera (75 km)\nWhen you arrive for the first time in Matera, you do not believe your eyes. The city is a maze of zigzagging staircases, steep lanes,cave dwellings and tiny courtyards: it’s a magical and unique landscape in the world. Halfway between Calabria and Apulia, Matera is also known as the “City of stones\"! For a truly unique experience and to avoid the heat, live Matera by night: the white stone turns to golden reflections, thanks to the city lights and it all becomes unreal, it is such a perfect combination of dramatic panorama and architectural beauty!\n\n\nThe most romantic thing to do in Matera is to book a hotel room in the Sassi.\nWhere to stay: https://bit.ly/471LIFZ\nAquatio Suite Hotel is a charming hotel sets into a tufa ridge in the city’s Sasso Caveoso district located in the heart of UNESCO’s Sassi World Heritage site and it also includes a wonderful spa with a swimming pool carved into the rock and a restaurant with an outdoor courtyard...simply magical!\n\n\nWhat to do: Explore as much as possible without getting tired with this tour aboard an authentic Italian Ape Calessino (Tuk Tuk). Zip through the streets of the historic Sasso Caveoso neighborhood to admire the main churches and squares and snap photos of the famous cave houses and views of the surrounding valley.\n\n\nRead more about Ape Tour Matera - Panoramic tour in ape calessino 👉 https://bit.ly/3rAqnDc\n\n\n\n\nFor the best gelato or granita in Matera, taste the one of “I vizi degli Angeli”, this place has unique and delicious flavours!\n\n\n\n\n\n\n\n\n#matera #materaitaly #materabynight #italytrip #italy #italytravel #basilicata #italy_vacations #cityofstone #tufa #cave #MagicalMoments #unique #placestovisit #places_wow", "link": "facebook.com/groups/1373361046396315/permalink/2197158497349895/", "likes": 20, "comments": [{"username": "Tom Jankowski", "comment_text": "This place looks magical"}, {"username": "Dan Trudi Flynn", "comment_text": "Matera is gorgeous\nLoved it"}]}, {"id": "2197162430682835", "text": "I’m heading to Italy in October. I hired a woman from an Italian tour company who has made all the arrangements for tours, driver to and from etc. My question is do I tip the drivers? Do I tip her?I know they say you don’t tip in restaurants but what about everything else? Thank you!!!", "link": "facebook.com/groups/1373361046396315/permalink/2197162430682835/", "likes": 3, "comments": [{"username": "Edoardo Casolo", "comment_text": "If the service is really good you can tip if you want."}, {"username": "Michele Liggett", "comment_text": "Our travel agent suggested tipping drivers she set up for b us abd tipping our local contact in Italy."}, {"username": "Lina Lala", "comment_text": "I tip the driver, servers etc. They appreciate it."}, {"username": "Alice Francesca", "comment_text": "Try Piedmont: https://\nwww.google.com/\namp/s/\namp.theguardian.\ncom/travel/\n2022/oct/13/\nitaly-piedmont-w\nine-food-restau\nrants-art-guide"}, {"username": "Giovanni Pianigiani", "comment_text": "For them is extra money so they'll certainly appreciate, extra bucks that they don't need to tell the tax agency. But, taking aside the examples of US waiters or 3rd world porters who probably don't have a decent salary, I wonder why you would feel you have to tip someone for doing their (paid) job: when you tip your driver, for driving you safely around in a clean car, what about the mechanics who fixed the car or the employees of the car washing? Likewise, when tipping your waiter at the restaurant, have you considered the chef, or even just the hidden people who sliced the lettuce for your salad?"}, {"username": "Dayna Steinberg Cioffi", "comment_text": "We left small tips everywhere. The guides, drivers, waiters, and taxis. Use your euro coins or small bills"}, {"username": "Jennifer Johnson Mayes", "comment_text": "Here’s what I got from my agent for my family of five"}, {"username": "Kathleen Sidary Couvillion", "comment_text": "I have friends who have lived in Italy their entire lives and say the no tipping rhetoric is false. They always tip. Plus they sent me this info this am and informed me servers do not receive a living wage.\n\nIf you can afford such a trip you can afford to tip.\n\nI am not going to debate this subject - now if Italian s want to tell me my close friend is a liar please DM me and she will debate the subject with you. I am only the messenger."}, {"username": "Phyllis Snyder", "comment_text": "The people who actually do the driving or walk you to and talk to about the sites deserve a tip- but not the company office workers- just my thoughts."}, {"username": "Laura Jetton", "comment_text": "Tip the guides and drivers ❤️ they appreciate it."}, {"username": "Kit Nader", "comment_text": "Tip if you want ... but only if service superb. I tip taxi drivers and I love tipping great waiters ... fenice restaurant big tips....Great waiters."}, {"username": "Janice Rea", "comment_text": "We tipped everyone. Maybe not the 20% as in US but since everyone in tourism was hard hit during Covid, they could use the extra $$$"}, {"username": "Rita Levi Montalbano", "comment_text": "As other say, the best thing to do is to tip the \"missing\" part of a price, for example if they asks you for 47€ you can give them 50€ and that would be appreciated (to tell them to keep the change in italian is \"tieni il resto\"). Otherwise, tipping is not really a thing in italy"}, {"username": "Dave Conroy", "comment_text": "I'd find it patronising. I've done my job at the rate I quoted you and now you're giving me some small token payment. Should I tip you for being friendly and keeping up on the tours. It's imposing cultural norms where they don't exist. At worst it's encouraging exploitation so people become reliant on tips rather fair wages."}, {"username": "Virgz Van Møøre", "comment_text": "Tip only when you are satisfied"}, {"username": "Debbie Plante", "comment_text": "Thank you everyone for your responses. I appreciate the time you took to respond!!!"}]}, {"id": "2197166104015801", "text": "Anyone use Venice as a place to stay and take day trips to other locations? If so, where did you go?", "link": "facebook.com/groups/1373361046396315/permalink/2197166104015801/", "likes": 2, "comments": [{"username": "Robyn Lawson", "comment_text": "Day trip to Dolomites all booked😊💙"}, {"username": "Simone Pfenninger", "comment_text": "Burano and Murano; can be done in 1 day by vaparetto"}, {"username": "Rebecca Ritter", "comment_text": "Train to Bolzano"}, {"username": "Alice Francesca", "comment_text": "Verona home of Romeo and Juliet! By train"}, {"username": "Faye Haines", "comment_text": "Padua"}, {"username": "Sarah Abts", "comment_text": "Go to Lido! You can take the vaporetto or if you don’t want to be with other people take a Motoscafi(priva\nte boat water taxi). Lido is a small island that takes about 20 min to get to by Motoscafi and 30-40 min by vaporetto. We just got back from a 16 day trip to Italy! We rode bikes in Lido, it is such a beautiful island. We also had a cabana for the day at the Excelsior hotel, so gorgeous! It was amazing to swim in the Adriatic Sea.\nYou can also take a day trip to Florence, 2.5 hours by train, it only takes a 1-1.5 days to see Florence. When are you going?"}, {"username": "Krissy DaRusso", "comment_text": "I was going to use Venice as a base but it’s so crowded there. I chose Treviso, right outside of Venice and zero crowds. It was refreshing and always seemed just a few degrees cooler."}]}, {"id": "2197166347349110", "text": "Hello all!\nRecomendation local food for dinner in Florence, Venice and Rome.\nThanks I’m advanced", "link": "facebook.com/groups/1373361046396315/permalink/2197166347349110/", "likes": 5, "comments": [{"username": "Katherine Wood Reeves", "comment_text": "Just ate here last night. Delicious, so friendly. They have an additional seasonal menu they will bring you as well. We ate mostly off the seasonal menu, shared several starters, 3 pastas, and 1 steak among 5 adults and were stuffed.\n\nhttps://\nwww.thefork.it/\nristorante/\nclub-culinario-t\noscano-da-osval\ndo-r62329#tabSw\nitch=true"}, {"username": "Katherine AliNuñez", "comment_text": "Thank you so much! ❤"}, {"username": "Jane Coutts", "comment_text": "A wonderful seafood restaurant in Venice is Alla Madonna- very authentic seafood cuisine\n\nFlorence- il cinghiale bianco- - very old traditional florentine restaurant specialising in meat.\n\nRome-Pianostrad\na or Roma Sparita"}, {"username": "Kelly Hanberg Rosati", "comment_text": "We loved Restaurante Sant Angelo in Venice. We went for lunch and didn’t need a reservation. There’s an air conditioned room to the left when you walk into the restaurant. https://\nmaps.app.goo.gl/\nYnJiiZGJJJ76kfvD\n6?g_st=ic"}, {"username": "Tom Jankowski", "comment_text": "Florence we loved:\nFlorence's Oldest Gelateria: https://\nvivoli.it/en/\nhome-2/\nTrattoria Ilcontadino: https://\nwww.facebook.com\n/\ntrattoriailconta\ndinofirenze (lunch deal!)\n\nRome there's a SPECIAL pizza place right outside the Vatican but the name escapes me"}, {"username": "Jacqui Kaye-Robinson", "comment_text": "Going on a cruise in August. We are stopping at Florance and Rome, so we will check out the above restaurants.\nThanks"}, {"username": "Dave Colleen", "comment_text": "Venice- Dolfin Restaurant. We 💜it"}, {"username": "Annette Fordyce", "comment_text": "We love both the Buca Lapi and Cibreo in Florence. Needed reservations while we were there in May, which our hotel took care of for us."}, {"username": "Maria NoBa", "comment_text": "In Venice, I recommend Ristorante San Trovaso. Great food."}, {"username": "Maria NoBa", "comment_text": "For the best ice cream in Venice, try Nicco. I get the gianduiotto. To die for!"}]}, {"id": "2197156650683413", "text": "Good morning, is there an app that you prefer for making dinner reservations in Rome / Florence? I can make the reservations on individual restaurants’ websites, but an app may be nice to have them all in one place. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2197156650683413/", "likes": 4, "comments": [{"username": "Cyndi Nistal", "comment_text": "You might try the fork."}, {"username": "Ellen Edmonds-Wilson", "comment_text": "The restaurant websites will direct you to their preferred booking site. We here are many beyond The Fork. Sometimes it’s an email to the restaurant and they email you a confirmation."}, {"username": "Daisy Yoo", "comment_text": "Fork"}, {"username": "Elena Innocenti", "comment_text": "The Fork, Quandoo, Open Table"}]}, {"id": "2197150327350712", "text": "Hey !\nThinking of traveling to ITALY in September 1st week and would club Swiss on a 14 day trip .\nNeed suggestions on how to go about the itinerary, which cities to visit in Italy and how long to stay in each city.\nPS - On a restricted schedule of 14 days so would not want to waste any of it and its for a group of 3 young couples .\nTIA !", "link": "facebook.com/groups/1373361046396315/permalink/2197150327350712/", "likes": 2, "comments": [{"username": "Anita Reed Matchett", "comment_text": "We are going to be in Rome 3 days, Venice for 3 days and Florence for 4 days."}, {"username": "निनावी सहभागी", "comment_text": "We also were thinking Rome-florence-V\nenice .\nAny recommendations\nthats a must do .\nIs Naples also worth the visit ? What does the south coast offer?"}]}, {"id": "2197074817358263", "text": "Curious how difficult it is for travelers to read the Italian menus and how you translated.\nI plan to eat my way through Italy!!! Lol\nThis does make me nervous though especially with having a food allergy.\nAdvice needed", "link": "facebook.com/groups/1373361046396315/permalink/2197074817358263/", "likes": 27, "comments": [{"username": "Letty Veronica", "comment_text": "Google Translate app"}, {"username": "Joe Guzzi", "comment_text": "We are fluent in Italian."}, {"username": "Tari Lawson", "comment_text": "We had trouble with the translations many times. Sometimes the staff were able to help us, other times some patrons gave us information or we looked at what others were eating and ordered the same."}, {"username": "Delly Tracy", "comment_text": "Just ask and tell."}, {"username": "Rhona OConnor", "comment_text": "The words become very familiar as most menus have the same type of thing. You will understand very quickly. If a menu is in all English beware it's for Tourists!! I found the less English, the better the food!"}, {"username": "Alicia Cox", "comment_text": "Use an app & look up the Italian words for the ingredients you need to avoid. Many of the restaurants have an English description as well."}, {"username": "Jill Medrano Casey", "comment_text": "Google translate with the photo option. Works great!"}, {"username": "Frances McDonagh", "comment_text": "Google translate"}, {"username": "Mary Ellen Maatman", "comment_text": "Allergy listings on menus are very complete. Often, menus in English are available."}, {"username": "Sarah Hadjinian Kirakossian", "comment_text": "We stayed in 4 different provinces had no difficulties."}, {"username": "Donna Dougherty", "comment_text": "Google translate"}, {"username": "Carla Casci Principato", "comment_text": "Italy is very sensitive to food allergies. Use Google Translate to Translate menus and what you want to convey"}, {"username": "Rita Sanza", "comment_text": "No problem. Most of them are written in inglish and Italian"}, {"username": "Traci Raymer", "comment_text": "Camera option on google translate. But most have an English version underneath"}, {"username": "Jim Hash", "comment_text": "Run your food allergy through Google translator and save it on your phone or on a piece of paper in your wallet. Feel honored if they bring you the Italian menu. Normally they’ll peg you as a tourist before you sit down and will have an English menu. The best non-tourist restaurants might not have an English menu. These are the best ones, and even then they have someone who can speak English. This is why so many of us keep coming back. The people, the culture and the food is so exceptional!"}, {"username": "Douglas Godesky", "comment_text": "Very difficult and did not want to dork out with a phone, so learned a few food words, and went with it, ate whatever came along. Fun."}, {"username": "Alexandra A Welker", "comment_text": "Type on Google and click images it will show you what it will look like."}, {"username": "Gillian O'Callaghan", "comment_text": "I loved the menus in Italian....and I don't read the language. I had jotted down some dishes I wanted to try, some key words (proteins, vegetables, fruit etc) and when they weren't enough I asked."}, {"username": "Susan McHenry", "comment_text": "Use your phone to translate"}, {"username": "Caren Murray Kleinman", "comment_text": "Make up a couple of cards in Italian stating what your allergic to…. Have them laminated and keep one with you all the time. Google translate will interpret the menus."}, {"username": "Felicia LoCascio Whitney", "comment_text": "Write down in Italian what your allergies are. Show to your server."}, {"username": "Linda Hill", "comment_text": "Plenty of gf in Italy from pizzas, pasta etc"}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "We've been here a week so far. As much as I can remember, every restaurant has had the English translation below each item."}, {"username": "Lisa Hedenberg Nichols", "comment_text": "Google translate app. Take a photo in the app and read"}, {"username": "Lisa Komarec", "comment_text": "Most menus, have an English version. Otherwise you can translate on google."}, {"username": "Maggie Williams Dryden", "comment_text": "Unless you’re going someplace rural, they’re in English."}, {"username": "Wendy Spano Bracco", "comment_text": "GoogleTranslate\n!! I used the lens a few times in Paris a few months ago. It’s great."}, {"username": "Beth Searight Millar", "comment_text": "I had an app called Italian Food. Shows categories, names, pictures and descriptions. I didn't end up using it as the menus usually had English and I knew a few words in Italian and learned more as the days went on."}, {"username": "Glenn Todd Webb", "comment_text": "Minor problem. Almost all are dual language or you can find one nearby. All waiters speak English good enough and are happy to help"}, {"username": "Renee Rundle Stoneham", "comment_text": "Google Translate"}, {"username": "Scott Perry", "comment_text": "Many, if not most of the menus in Italy have English translations. That said, you probably are better served by going to places whose menus are only in Italian. I’ve seen people can use translation apps on their phones for reading menus."}, {"username": "Sheyla Brasil-Brydun", "comment_text": "Use Google translate. It has an option to take a picture which will then translate the words on the item.\n\nETA:most of the places we ate at had the menu in Italian with the translation in English underneath each item. Also many places were very good at labeling items on the menu with most known food allergens. This was very helpful as my son and I both have food allergies."}, {"username": "Cecilia Christine Costantini", "comment_text": "I use GoogleLens when I travel, although you need to have an internet connection. Also, if you have an allergy (not an intolerance), you might want to write it clearly in Italian on a card and shiw it to waiters. I speak Italian so if you want me to translate a sentence you might want/need to say let me know. (I am a vegan, so I am quite familiar with the whole avoiding ingredients issue)."}, {"username": "Janine Witte Winiarz", "comment_text": "Someone had posted these allergy cards which I thought were great: https://\nequaleats.com/\n?gad=1&gclid=Cj0\nKCQjw2eilBhCCAR\nIsAG0Pf8vwJVB0m\nwYdtoIAF1lgXF4n\nvucbRSXUmmtYXS4\nmEZ3JunNChGuwEz\n0aAmUbEALw_wcB"}, {"username": "Kirsten Rea Davis", "comment_text": "They are very aware of allergies in Italy (at least the 5 cities I was in). Many places have the allergens listed in the menus with numbers and the numbers beside the food. I did order some allergy cards from Equal Eats on Etsy that had it in English and Italian so they understood about contamination, etc. You could download and print or get an actual card (credit card size). I felt better having that for the few places that did not speak English."}, {"username": "Ellen Edmonds-Wilson", "comment_text": "There’s a government mandate about allergy listings. Menus will have a number system with the top ten allergies marked. If you’re not in the top ten allergy you’ll need to explain it. The coeliac in our family had the best food trip ever in Italy. They’re so switched on."}, {"username": "Hal Shaw", "comment_text": "I don’t speak Italian, but I did grow up in an Italian neighborhood in South Brooklyn and I am fluent in Italian food. Looking forward to my trip there in October. ￼🍅🍕🍝🇮🇹"}, {"username": "Nick Justason", "comment_text": "Been in Italy for 4 days and the Google translate app has a feature where you can take a photo or view live through your camera lense and will instantly translate. Very handy at the train station"}, {"username": "Kristina Ruk", "comment_text": "We do like this on android. Take a picture of the menu then tap on it it appears share sign (further see in comments)"}, {"username": "Maria Al", "comment_text": "We are here now. I had previously purchased allergy cards from allergy eats (she is allergic to eggs, peanuts, and tree nuts). They send custom cards in the language and allergies you specify. It has made things super easy."}]}, {"id": "2197155614016850", "text": "Good morning. For the folks that are familiar with Lake Garda, how easy it is to get from Desenzano to Malcesine? Can I take a ferry? We are spending only a day there (coming from Milano) and I really want to take the cable car to Monte Baldo. Any insights are greatly appreciate.\n\nGrazie 😊", "link": "facebook.com/groups/1373361046396315/permalink/2197155614016850/", "likes": 25, "comments": [{"username": "Iris Joan Price", "comment_text": "Hoping you get some comments as I am also interested in visiting Lake Garda"}, {"username": "Sandy Kinnerman Kennedy", "comment_text": "Following too"}, {"username": "Stefano Bressanelli", "comment_text": "Maybe it Is faster to get off in peschiera del Garda (train) and then catch the bus to Malcesine /riva del Garda. Just take a look to timetables. Ciao"}, {"username": "Denise Bibby", "comment_text": "Teena Leuba"}, {"username": "Alice Francesca", "comment_text": "Yes .take the ferro from Desenzano to Malcesine but be aware that you need to buy the ticket to monte Baldo in advance as right now it s overcrowded"}, {"username": "Renae Larcus", "comment_text": "Yes you can take the ferry but it’s quite a ways. Lake Garda is long!"}, {"username": "Caren Cone", "comment_text": "Thank you everyone! I was able to find an all day ferry ticket(hop on/ hop ff) and got tickets to Monte Baldo for late afternoon. We don't have anything else planned so I think even if we spend sometime on the ferry that won't be a problem (looking forward to admiring all the beauty from the boat). We don't go back to Milan until 9:30 pm so hopefully we can watch the sunset from Sirmione too. ☺️"}, {"username": "Lyn Evans", "comment_text": "When we stayed in Malcesine a few years ago we caught the fast ferry down to Sirmione...clos\ner to Peschiera del garda stn. Not sure if this service is still avail but it’s quite a long distance to travel so fast ferry was great."}, {"username": "Julia Domenica", "comment_text": "How was monte baldo? I am going next week and debating going! Was it easy to get too from the ferry dropoff in Malcesine? Thank you!!"}]}, {"id": "2197156640683414", "text": "Hi,\n\nIs end October a feasible month to visit either Venice or Amalfi ?\n\nTravelling with 3 young children under the age of 12z\n\nThank you", "link": "facebook.com/groups/1373361046396315/permalink/2197156640683414/", "likes": 0, "comments": [{"username": "Virgz Van Møøre", "comment_text": "Sure it is"}, {"username": "Iris Joan Price", "comment_text": "I was in Sorrento, Capri,Amalfi second to last week of October last year and it was wonderful. Keep in mind, however, that the express train to and from Naples/\nSorrento (for Pompei and Herculaneum) and the ferries stop running end of October."}, {"username": "Daniele Morani", "comment_text": "Yes, early October is not bad at all. No crowds and still nice weather."}]}, {"id": "2197160060683072", "text": "We are going to a wedding in the Sienna area and will spend an extra few days there. (Rome first) Does anyone have suggestions for where to go, what to do in that area, places to stay?", "link": "facebook.com/groups/1373361046396315/permalink/2197160060683072/", "likes": 3, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nwww.tkqlhce.com/\nclick-100692842-\n11552042?url=ht\ntps%3A%2F%2Fwww\n.tripadvisor.co\nm%2FHotel_Revie\nw-g187902-d1062\n1684-Reviews-Re\nlais_degli_Ange\nli-Siena_Tuscan\ny.html"}]}, {"id": "2197163874016024", "text": "What was originally going to just be a lazy morning at the hotel in Naples before catching our train to Bologna turned into an amazing two hour tour with Ludovica from Ludoviguida (who was our guide for our private tour of Pompeii and Herculaneum). When we left her in Herculaneum we promised to stay in touch and contact her when we were next here with a plan to visit Naples her beloved home.\n\nWell we checked our schedule and she checked her and moved some stuff around so she could show us around a bit. We learned a lot, had some local treats which were delicious and then she arranged for a driver she knows to give us a driving tour of the other parts of Naples we didn’t visit with her before taking us to the Napoli Afragola train station. He was great the first taxi driver who admittedly had poor English but was trying his best and we got into a good rhythm. The girls had fun and we certainly saw more of Naples than planned and learned a bunch too. The girls liked seeing the high school that she went to, the piazza that she used to hang out at with her friends growing up and even the church where her parents were married.\n\nIf you are in Naples for the first time or even for a short time and want to see and explore with a super experienced fun guide we highly recommend Ludovica.", "link": "facebook.com/groups/1373361046396315/permalink/2197163874016024/", "likes": 320, "comments": [{"username": "Scott Heran", "comment_text": "Looks like Naples has calmed down since we were there a few weeks ago. Pretty crowded and everyone going crazy for Naples Football Campioni! It was a great place to see. We have been to Italy numerous times but never saw Naples. Glad we finally did."}, {"username": "Elena Dompa", "comment_text": "Thank you for sharing!!!"}, {"username": "Theresa Corica-Slusser", "comment_text": "Thank you. Going in September and have business card saved."}, {"username": "Janet Canter", "comment_text": "That’s cool. I’m curious how much was the tour?"}, {"username": "Andrea Gattini Pennington", "comment_text": "How was her Pompeii tour? Very knowledgeable? How much for a family of 5 I am helping out with planning this trip. Would be first week of August."}, {"username": "Iris Joan Price", "comment_text": "If you have HBOMax (now just MAX) you may want to watch My Brilliant Friend (3 Seasons, the 4th and last season still in production) set in Naples starting in the 1950s and following the complicated friendship of two girls over their lifetimes. Having visited Naples, you may, as I did, immediately get a sense of being there and a feel for the culture as it evolved over those decades."}, {"username": "Carolina Alejandro Clabaugh", "comment_text": "Thank you for sharing!!!"}, {"username": "Margaret Clark", "comment_text": "Rachel Clark"}, {"username": "Jacqueline Morris", "comment_text": "Did you stay in a hotel in Naples, if so can you provide the name?"}, {"username": "Kim Swenson", "comment_text": "That's amazing! We met her when we checked into our amazing boutique hotel in Naples and she gave us some great tips on places to visit!"}, {"username": "Kym Fabris", "comment_text": "Anna Fabris Michelle To"}, {"username": "Till Blumenthal", "comment_text": "Best Caffè in Napule! Vulevu!!! 💪🏼💪🏼"}, {"username": "Pat Morgan", "comment_text": "How fun! Sounds like a fantastic time!"}, {"username": "Meredith Holloway Helbon", "comment_text": "Following"}, {"username": "Paula Luca", "comment_text": "So what did you think of Bologna?"}, {"username": "Jenny Meffert", "comment_text": "So wish we had read this post before our trip to Naples last year. Had been before to Pompeii but unfortunately this time we did not have the best guide and the place was packed. Left early and went to Herculaneum the next day. Didn’t have a guide but enjoyed it, especially the comparison with Pompeii. Have noted her details to pass on to others and, hopefully, share her knowledge on a future trip. Thank you so much for the post."}, {"username": "Sarah Reed", "comment_text": "Debbie Stevens Sears"}, {"username": "Frances McDonagh", "comment_text": "Bologna is amazing has the most leaning tower in Italy and the food capital of Italy"}, {"username": "Marina Gray", "comment_text": "Thank you for sharing!"}, {"username": "Josephine Rauch Rotunda", "comment_text": "Thank you so much for this info… We will be sure to contact her the next time in Naples. Last year our driver who picked us up from the airport, took us on a tour before he even dropped us off at the hotel, so nice of him… Everyone was wonderful in Naples. We did a food tour that lasted about four hours and the guide we had went above, and beyond to show us the city, it’s good to know about your tour guide though, as there are so many more places in Naples, we would like to be shown. Glad you had a nice trip.❤️"}, {"username": "Shawn Sanders", "comment_text": "Possibly interested. We’re a family of 4."}]}, {"id": "2197166464015765", "text": "Just got back from a cruise and a three night stay in Rome. Italian ports were Rome, Sicily (Messina), Naples (but went to Ercolano to see Herculaneum, Livorno ( Florence/Pisa). This was my first time in these ports except the Tuscany area.\n\nWeather was sunny and hot. In Rome The food was amazing andThe traffic horrendous. Watch out for scooters. Because of the heat, 90°-100° took a taxi most of the time. Did walk from our hotel, to the Trivi Fountain and The Spanish Steps. Expect crowds. Did a tour of the Colseum with The Tour Guy. Worth the skip the line and the information was fantastic. At St. Peter’s toured the Necropolis and because we did the tour could skip the line into the Basilica. Amazing tour. The Vatican Scavi Tour. Get reservations early limited to 250 people per day. Small groups (12-16) tour is available in English. Be aware of hot, humid conditions as well as steps and narrow areas.\n\nIn Messina just roamed around the town. Cathedrals everywhere.\nIn Herculaneum did a tour with an archeologist. Fantastic tour.\nSince I had already spent a week in Tuscany a few years ago, I walked around Livorno. Very nice city with shaded walkways and lots of shopping opportunities.", "link": "facebook.com/groups/1373361046396315/permalink/2197166464015765/", "likes": 48, "comments": [{"username": "Sheila Heart", "comment_text": "Johnny J. Turpin, what cruise line did you use? How did you like it?"}, {"username": "Kimberly Lodyga Roberts", "comment_text": "We were thinking of doing a short cruise and spend a few days in Rome before and then heading to Tuscany after. What ports did you visit on your cruise ?"}, {"username": "Jann Kinsela", "comment_text": "What guide did you use for the Herculaneum?"}, {"username": "Susan Johnson", "comment_text": "Awesome"}]}, {"id": "2197170887348656", "text": "📍 Batterie Di Punta Rossa. A fascinating wild beach close to San Felice Circeo in lazio region.", "link": "facebook.com/groups/1373361046396315/permalink/2197170887348656/", "likes": 5, "comments": []}, {"id": "2197102287355516", "text": "We are heading to Italy for two weeks Sep-Oct. We are not interested in Rome, Venice, the Amalfi coast or the most famous fountain or church in Italy. We want to enjoy culture, good wine, food and will add in some bike riding. We would like to find some of the least crowded places and would love your recommendations for cities/towns/areas. Iआणखी would also like to do a cooking class. I love beautiful places and scenery. We were focusing on Tuscany only, but are now considering Verona and Bologna as well (food for Bologna and Verona because of the proximity to areas that make some of my favorite wines). We would love to stay in a small, clean and not touristy town near some of these areas where we can park the rental car and just bike or walk everywhere and immerse ourselves in the local culture. Any and all ideas are welcome!", "link": "facebook.com/groups/1373361046396315/permalink/2197102287355516/", "likes": 5, "comments": [{"username": "Italy Virtual Tours by NextStop-Italy", "comment_text": "https://\nnextstop-italy.c\nom/\nvirtual-tours/\ntrevi-capital-oi\nl/"}, {"username": "Simone Pfenninger", "comment_text": "Bologna, Modena, Ferrari Museum in Maranello, Ferrara, Parma, Piacenza, Dozza and something special: Castiglione dei Pepoli-Hotel Fattoria Ca' Di Fatino"}, {"username": "Janet Walls", "comment_text": "You might enjoy Assisi, Spoletto & Perugia. Bologna & Verona are both excellent for 2/3 days. Viareggio is a good central place to stay for great access to adjacent villages and towns."}, {"username": "Jerry Japczyk", "comment_text": "Padua a collage town"}, {"username": "Greg Saba", "comment_text": "You can find places in every corner of Italy. Besides Tuscany, there are the Dolomite mountains, Lakes region, Italian Riviera, Adriatic coast, Puglia, Campania, Calabria, Umbria, Sicily and Sardinia. Each has many towns and cities that are not overrun with tourists, provide culture, great food and wine. We have enjoyed them all, and are hard pressed to name a favorite."}]}, {"id": "2197181660680912", "text": "Starting to plan a trip for next year to celebrate quite a few things…. 10 years of marriage, 20 years of sobriety for me and 15 years of sobriety for hubby will all be celebrated in 2024 (so no need for wine areas or wine tours)\n\nIt will be our first trip (husband and wife) to Italy. Thininking of taking a tour to start up north and eventually a few days on our own maybe down south / Sicily. Hoping for any tips and advice you all may be able to provide. Thank. you so much in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2197181660680912/", "likes": 19, "comments": [{"username": "Scott Perry", "comment_text": "Maybe a pizza tour in Naples? If you go, the archaeological museum is amazing!"}, {"username": "Mary Anna Machi", "comment_text": "Food tour around Bologna (prosciutto )to visit Parma (cheese) and modena (balsamic vinegar); add Ferrari museum if car interest. Close to Venice and como for romance."}, {"username": "Mallorie Mathis McManus", "comment_text": "You'll get tons of responses with great ideas. I just came to say congratulations\n🎉 on all three amazing accomplishments\n. I hope you have a splendid time, clearly you guys deserve it!!!! <3"}, {"username": "Joanne Calzaretta", "comment_text": "Congratulations\non all!!"}, {"username": "Patsy Luque Mejia", "comment_text": "Congratulations\nto you and your hubby! I start the planning phase of our trips about 11-12 months in advance. I start by watching you tube videos and researching various travel websites. From there I pin down the places that interest us the most and start planning. I take into consideration the amount of time we’ll be there and the availability of transportation from location to location as well. Of course I do tweak the plan and revise it as time progresses. This strategy has worked for us. 😊"}, {"username": "Phyllis Snyder", "comment_text": "Phyllis Snyder"}, {"username": "Nancy Koehler Barboni", "comment_text": "Depends on your budget and time frame. Don’t rush it."}, {"username": "Valerie Collanton", "comment_text": "So many choices as to areas. Once you do some research and decide my advice is to pick some “home” bases and do day trips from there. For example, If you are going for three weeks I would pick 3 areas and spend a week in each. That way you really get to see the region."}, {"username": "Bonnie Loftspring", "comment_text": "Lake Maggiore, Isola Bella Borromeo. north lake area. This was the most fabulous tour through summer palace"}, {"username": "Jennifer Walp Rydholm", "comment_text": "My husband and I are also going and we do not drink now for many years 😉. So I am prepared to say “senza alcool”. We also skip wine tours and will focus on gelato, food and the tourist highlights."}, {"username": "Karen Klag", "comment_text": "Congratulations\non all your accomplishments\n😊"}, {"username": "Dr-Jon Warnecke", "comment_text": "Choose north, Central, or south Italia! Too much travel takes away from seeing a lot."}, {"username": "Lisa Adams Robertson", "comment_text": "Congratulations\n! I can highly recommend a small group tour of Sicily by Amber Road Tours! It was our first international trip and it was wonderful! Sicily is a bit harder to get around on your own since public transportation isn't as available as it is in other areas. The tour manager is so much fun and I think he must know almost everyone in Sicily! 😄 I recommend October, since the Summer is so hot."}, {"username": "Paige Montecalvo", "comment_text": "We did Venice, Rome, Positano in 8 nights. I wish we had more time (just did a quick stop overnight in Rome but still managed to see the Colosseum, Forum, and Trevi fountain!)\n\nFigure out how long you can stay, then pick places based on at least 3-4 nights in each place. That way you can do 2 “busy” days and 1-2 “relax” days in each spot.\n\nJust take travel time into consideration if you want to see it all, bc Sicily is quite a trek from Northern Italy. It’s over 700mi north to south (very close￼ in length to California, to give some context)\n\nCongrats on all your milestones! My husband is also sober and we spent over a month all over Europe this summer and had no issues. In fact, I feel the Europeans pushed alcohol way less than they do when dining out here in the states. Not that we were too worried about it, we just weren’t sure what to expect."}, {"username": "Nancy Day", "comment_text": "Congrats living the good life ...enjoy!"}]}, {"id": "2197182240680854", "text": "Staying in Florence but looking for suggestions to travel to a spectacular wine tasting in Tuscany. Taxi ?", "link": "facebook.com/groups/1373361046396315/permalink/2197182240680854/", "likes": 2, "comments": []}, {"id": "2197186254013786", "text": "Leaving in FOUR DAYS!! Hit me with all your hidden secrets, off the beaten path, MUST DO’s in Venice, Lake Como, Rome!! I want to make this my kids (teens) trip of a lifetime!!!", "link": "facebook.com/groups/1373361046396315/permalink/2197186254013786/", "likes": 3, "comments": []}, {"id": "2197182170680861", "text": "Have a free day in Florence from my tour. Would like to shop for Leather and Jewelry. Any recommendations? Best way to get around Florence? Restaurant for lunch/ dinner?", "link": "facebook.com/groups/1373361046396315/permalink/2197182170680861/", "likes": 2, "comments": [{"username": "Marta E Gillette", "comment_text": "Great shopping"}, {"username": "Scott Perry", "comment_text": "Benheart"}]}, {"id": "2197182847347460", "text": "MtSeceda\n#loveitalia #langkofel #passogardena", "link": "facebook.com/groups/1373361046396315/permalink/2197182847347460/", "likes": 5, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2197186300680448", "text": "Has anyone bought this before?\nIs it worth it?\nIt does say public transport but is that just buses or trains too?\nThank you 😊", "link": "facebook.com/groups/1373361046396315/permalink/2197186300680448/", "likes": 2, "comments": [{"username": "Louis Des Forges", "comment_text": "The ticket for the duomo and museum is €22. If you want to spend all 3 days in Milan then yes, but for me I wouldn't need to spend that long."}]}, {"id": "2197186774013734", "text": "Okay friends, I keep hearing warnings to stay away from Positano because of the overwhelming crowds unless you are actually staying there. My husband and I are staying in Sorrento and planned on doing a day trip to explore Positano. We have reservations for lunch at Le Petit Murat. I can’t imagine traveling to Italy and not seeing Positano! I’d to hear from some people who have been this summer to get their advice.😕", "link": "facebook.com/groups/1373361046396315/permalink/2197186774013734/", "likes": 55, "comments": [{"username": "Lori Lord Rourk", "comment_text": "You have to go to Positano! Crowd or no crowd it’s Amazing 🥰"}, {"username": "Allison Campbell", "comment_text": "We got back 3 weeks ago . We did stay there for 4 nights . Our experience was that a lot of people flood in from morning to late afternoon then they leave and it thins out . Still busy for dinner but no where near as busy at night. Enjoy ."}, {"username": "Marcella Mayoya", "comment_text": "I went in Oct the crowd wasn’t a problem."}, {"username": "Kathy Kattic McKee", "comment_text": "Positano is a must see."}, {"username": "Agatha Blatti", "comment_text": "I did a boat tour … for 12 people. 1.5 hours in Positano , 1.5 hours in Amalfi and 1.5 hours swimming at a private beach near Positano away from the crowds . Highly recommend this tour especially in this heat ….you need to swim 🏊‍♀️"}, {"username": "Jennifer Taylor- Madrigal", "comment_text": "How is it for people with mobility issues? Going with my mom next spring and Positano is one of the stops on our cruise."}, {"username": "Jen Lim", "comment_text": "Hi😊Can you avoid the stairs and still enjoy Positano? I hv bad knees..but i want to see the place. Thank u"}, {"username": "Ashley DeFrees", "comment_text": "It was not that busy when we went a few days ago, the heat probably has something to do with it. I would recommend going!"}, {"username": "Lisa Beaudry", "comment_text": "Take a boat from Sorrento Coast and maybe only stop in for a couple hours!"}, {"username": "Sara Kyle Hargett", "comment_text": "I wouldn't do a whole day"}, {"username": "Richelle Trezise", "comment_text": "We are going to italy for 2 weeks and only going as far south as Rome"}, {"username": "Mary Weldele Coco", "comment_text": "It’s fantastic!! Not to be missed. We were just there."}, {"username": "Lee Rew", "comment_text": "It’s very pretty, between the heat and walking uphill I didn’t get to see as much as I wanted."}, {"username": "Franco De Luca", "comment_text": "Never NOT go see Positano. It is an absolute must. Anyone who tells you differently is not smart. You go no matter what."}, {"username": "Pamela Jones", "comment_text": "We went. Yes amazingly busy but still so worth it. Go...experience\nor forever say 'I wish I'd gone' what is one persons stress is anothers Exciting moment!"}, {"username": "Gintare Kondrote", "comment_text": "Don't worry, yes it is crowded, but a bit less than I expected reading here. Also don't forget you are also a tourist that makes it crowded, because it is good weather, beautiful and very popular city and everybody wants to see it. Tourists are everywhere so just relax and enjoy the city 😉\nP.S. everybody who want no crowds should go on winter. It is crazy not to expect crowds during summer in the busiest cities of Italy... by the way, Rome was twice more crowded than Positano on July, just to compare."}, {"username": "Anne Vincent", "comment_text": "Livia Koloamatangi"}, {"username": "Tracy Glasgow", "comment_text": "We did a day trip from Rome to Positano and Pompeii. Had a couple of hours in Positano and whilst busy it was great. Would have liked a bit more time."}, {"username": "Mindi David Wierzchowski", "comment_text": "It was a bucket list item for us. We took a day trip and it was lovely. All the little shops and a dip in the sea with the postcard view~do it! We did hire a private driver that dropped us right off at the shopping area. Very nice."}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "All of Italy is hot and crowded now….. but so worth it ! Sorrento was my favorite… enjoy !"}, {"username": "Paris Buchanan", "comment_text": "We were just there last Saturday - 100% worth it! We have used a driver every Tim we got for 15 years and he is amazing! Connect with Luigi De Martino you won’t regret it."}, {"username": "Roseann Ferrara Castrillon", "comment_text": "Go in the evening when the day trippers leave"}, {"username": "Sarah Bird", "comment_text": "Paul Bird"}, {"username": "Mike Jamison", "comment_text": "Went there this week on a day trip and shopped for a few hours and ate lunch. It wasn’t any more crowded and any other town we have been to in this trip. I wouldn’t worry."}, {"username": "Liz Wilson McAndrews", "comment_text": "We did a day trip to Positano in late June. It was very very people-y, so much so, that we did not enjoy ￼it. We ended up having lunch and leaving. No doubt that it is a beautiful place. Next time I’d like to visit at a different time when it is less crowded."}, {"username": "Penny Major Wood", "comment_text": "Get there very early."}, {"username": "Katia Bazerkanian", "comment_text": "Wasn’t there this summer but did the same a couple summers ago. We rented a Vespa and drove it to positano, highly recommend. The views were exceptional and we got to see a whole different side of Italy by taking our own route, at our own pace. The crowd didn’t get crazy until 12-1, we got there around 10-11"}, {"username": "Lorraine Mann", "comment_text": "We did a private tour up the coast. The drive was insane- traffic the whole way and terrifying. lol. Positano was mobbed so we didn’t stop there - ate lunch at a very high end hotel and walked around Ravello. Made a few other stops along the way. Honestly, liked sorrento much better. By boat might be a better idea, but no sure if you can swing that."}, {"username": "Paola Bobko", "comment_text": "It is definitely a must see, but yes it is very busy; I go to the coast every year and this year (i am currently here) it’s the busiest I have experienced in the last 5 years. Positano is unbelievable, can barely walk on the street. I would say Get there as early as possible, the crowds are one day visitors arriving on the ferries, so if you are able to arrive around 8am, you will still have the chance to enjoy a few hours of quietness; I would also suggest to visit Ravello, and go to Villa cimbrone (Google it and you will get convinced by the pictures 🙂"}, {"username": "Sam Cowie", "comment_text": "Have just come back from Italy today. We stayed in Praiano and took the bus to Positano a few times. Yes, it’s busy but not impossible to do and see things. The question I’d ask is “would you have regret if you didn’t go?”"}, {"username": "Colleen Sommerin", "comment_text": "I was there 10 days ago and stayed in Praiano. I visited Positano twice and it was busy. Getting on and off ferries was extremely busy. The bus ride there took 44 mins, should take about 15 mins due to the heavy traffic. In saying that it didn't stop me visiting. I splashed out for water taxis a couple of times which was a huge time saver and a much more enjoyable way to move between Positano and Praiano. Fridays are particularly bad as 4 big cruises ships dock and many passengers gravitate to Positano. The thing I found most disappointing was the beach, it didn't look nice and with so much boat traffic i wouldn't recommend it. I was happy to leave and head back to the quieter and prettier Praiano."}, {"username": "Letha Logan-Dardani", "comment_text": "We are doing the same! Going in mid September using Sorrento as our home base than visiting Positano, Amalfi and Capri with a half day trip to Pompeii.\nTaking the ferry to each place instead of a driver. Much more enjoyable experience and a lot less expensive.\nAny suggestions for restaurants in the Positano area. Capri as well\nHave fun!!"}, {"username": "Ann Treviño Mears", "comment_text": "We stayed in Sorrento and went to Positano w/o any issues earlier this month . I think the biggest issue is making sure you get there early."}, {"username": "Joan Belserene Forcheski", "comment_text": "Go & enjoy. We were there last week. It is crowded but worth seeing. It’s the peak of summer vacation. We had a delicious lunch & glad we went. Go by ferry. Easy from Sorrento."}, {"username": "Cindy Breneman Hattrich", "comment_text": "I’m going in august and can’t wait"}, {"username": "Anita Bonaminio Krimm", "comment_text": "I thought the same. We’re going to stay in Sorrento 3-4 nights and day trip to Positano and Capri."}, {"username": "Linda Espie", "comment_text": "You only live once."}, {"username": "Reese Colmenares", "comment_text": "Go to Positano. The fact that it is crowded because it is beautiful. I went there shopping and it’s manageable. Dont fear the crowds, enjoy every moment you are there"}, {"username": "Katrina Lumsden", "comment_text": "We were just there a week ago. We booked a the first ferry from Sorrento to Positano. Had beach chairs booked for the day in Pupettos Beach Club just 5 minutes away which was beautiful and much less crowded. After about 2pm we wandered into Positano and checked out the shops, ate gelato and had a look around. Not too crowded and definitely worth doing. Then back on our booked ferry to go back to Sorrento. You just have to be organised."}, {"username": "Rebecca Wilcox", "comment_text": "We never had a problem and we were there in May, but no crowds"}, {"username": "Rosemary Vaccaro- Dutra", "comment_text": "Gina Stang"}, {"username": "Carolina Garcia-Abalo", "comment_text": "We stayed 7 days in Sorrento and took day trips. I would revisit Capri and Amalfi. Positano is very touristy and hilly. If you do go, I recommend spending the morning in the beach club."}, {"username": "Peggy Bollinger", "comment_text": "Go and enjoy"}, {"username": "Maria Coladangelo Ducca", "comment_text": "You are there . Just go it will be lovely"}, {"username": "Meredith Holloway Helbon", "comment_text": "Following"}, {"username": "Angela DeMario", "comment_text": "Head there EARLY and get out by lunch time -was there last week our driver dropped us off at 9 and came back at 12:00 - it was perfect -we got out just in time then stopped in Amalfi for a bit and headed up the mountain to Ravello for lunch 🙌"}, {"username": "Sarah Hirsch Keller", "comment_text": "Just got back a few days ago. We went to Florence, Cinque Terra, Venice, Rome and then to Sorrento for 4 nights and finally to an island called Ischia.\n\nWe did the Almafi and Positano boat tour with Rovello option from Sorrento. Then we went to Ischia for 3 nights. I liked Sorrento and thought Positano was very pretty. We only got about an hour there though. It was enough time to get some pictures and walk around. I would have liked another hour there. It is lots of stairs though and very crowded and hot this time of year. Almafi was even more crowded and mostly restaurants and shops. It felt like the boat drops you off just for you to go shopping and eat for a couple hours. I wasn’t impressed with Almafi to be honest. I did enjoy enjoy seeing the coastline view from the boat though. The crowds and heat definitely made it less enjoyable.\n\nMy husband and I said if we were to do it again we would have just spent an entire week in Ischia. Beautiful sand beaches, not crowded and less expensive. Wonderful hot springs and gardens too. It was so peaceful and mostly Italians vacation there so way less touristy. The island was beautiful with cute towns and an easy bus system to get around. Most people rented Vespas though. It was my favorite place of all the places we went."}, {"username": "Stephanie Garofalo", "comment_text": "Please don’t change your plans… go, explore and enjoy!"}, {"username": "Margaret Ferrara Interlandi", "comment_text": "Don’t miss Positano! Crowded or not it’s the most beautiful place! Go to the beach…it’s spectacular"}, {"username": "Tiffany Turner", "comment_text": "We were there a couple weeks ago and crowded but not overwhelming. Found spot on beach. We hired driver so he could just drop us off and come back to pick us up as driving there and parking are crazy."}, {"username": "Amanda Geistweidt", "comment_text": "Positano was my favorite part of Italy! Spent 4 days in Positano over July 4th!!!!! Spectacular\nYes people ….. but it quiets some in evenings….. and if you want take a boat (5min) to a private beach during peak afternoon hours to beat the crowds it’s a wonderful option! Would not miss this beautiful gem!"}, {"username": "Sheyla Enrich", "comment_text": "I agree..don't miss Positano!!. I'll be in Sorrento in September and go to Positano is a must! Enjoy!"}, {"username": "Joanne Diaz", "comment_text": "We took the Ferry from Sorrento, crowded but absolutely worth it"}, {"username": "Jenn Messina Babore", "comment_text": "We were just there last week. The tour groups start coming through around lunchtime. Best time to visit is in the morning."}, {"username": "Lillian Gucciardi Nahas", "comment_text": "Don’t miss Positano and you'll enjoy Palazzo Murat. I had lunch there on my last visit. 🇮🇹"}, {"username": "Janice Ann Monaco-Keller", "comment_text": "We stayed in Sorrento for a week last October. Perfect. Hired a semi private boat to Amalfi and the second day same boat to Capri. Amazing. We flew in from. Genova after traveling a few northern regions. Go!"}, {"username": "Maggie Williams Dryden", "comment_text": "I’m here today and you would absolutely be remiss to skip this. It’s been my favorite part of Italy so far."}, {"username": "Maggie Williams Dryden", "comment_text": "Call Mistertaxidrive\nr Napoli and they’ll make sure you have a great experience on the Amalfi coast!"}, {"username": "Tina Bellitto", "comment_text": "Why not stay in Positano and day trip Sorrento"}, {"username": "Tina Bellitto", "comment_text": "See ravello while you are there"}, {"username": "João Petinga", "comment_text": "Just got home from the Amalfi coast and people in this group seem to exagerate a bit. There’s a lot of tourists like everywhere else but it’s not like you can’t walk the streets or enjoy a day at the beach or a nice meal.\n\nI didn’t feel overwhelmed anywhere, never waited much to be seated at restaurants or bars and never had trouble sight seeing. The only time I felt like there were a lot of people was when taking the bus somewhere but even then I managed to find a sit 8/10 times"}, {"username": "Paige Montecalvo", "comment_text": "We were the the first week of July and it was no more crowded than anywhere else we went on our month long journey to Europe 🤷🏻‍♀️My only suggestion would be to stay away from the bus in Positano. It’s not super timely and only runs every 30-60 mins and people were almost fist fighting over getting on it. Walk everywhere, and be sure to pre schedule your car service back to sorrento! We were at the taxi stand with a couple who didn’t do this and they had a hard time finding a ride back (this was like 9PM) and had to pay a taxi driver $160€ to take them back.\n\nIf you can, I recommend traveling by boat!"}, {"username": "Kristen Simonds Driscoll", "comment_text": "We spent our day in Sorrento then took the 5:15 ferry to Positano. It was simply beautiful. We had a drink overlooking the water and went in a few shops. It was soooo beautiful. We took a taxi home."}, {"username": "Mary Moloney", "comment_text": "We did a boat trip last Friday from Nerano to Amalfi (3 hours) and Positano (2 hours). Absolutely loved Amalfi but couldn’t get out of Positano fast enough, uncomfortably crowded especially in the heat and overpriced shops and restaurants."}, {"username": "Lisa Hedenberg Nichols", "comment_text": "We were there a week or so ago. Stayed in Minori but did a day-long boat trip that stopped for us to swim, to have lunch (at a place only accessible by boat) and for about 1.5 hours in Positano. Would not have missed P for the world, and it was so beautiful to see from the water. But yes, it was a complete zoo and hotter than hades. We wandered for a bit but got fed up with the crowds, lucked into a table in the beach bar so had a couple of drinks and some nibbles - which was perfect. Still very glad we went but even more happy that we didn’t stay there!"}, {"username": "Bonnie Christopher Bates", "comment_text": "Hotel pupetto"}, {"username": "Kath Milburn", "comment_text": "Just go and enjoy. It is a fabulous place."}, {"username": "Cettina Milioto", "comment_text": "We were there last week…\n\nStayed in sorrento and we went to positano beach club (incanto) and then had a beautiful supper ! It wasn’t even that crowded! People don’t like line up but honestly alittle patience and it was fabulous…I feel I love with sorrento soooo happy we stayed there. But positano was definitely a bucket list. So we spent the day and was happy I did."}, {"username": "Kristina Chuprasova", "comment_text": "We went for a day trip yesterday and did not regret.We took the road for cars instead of stairs. It took us around 1.5 hour and there were no people. It is very hot, make sure you have water with you."}, {"username": "Gloria Di Francesco", "comment_text": "Positano is amazing! Better during the week than saturday or sunday!"}, {"username": "Janice Rea", "comment_text": "We went in May. Crowded but you will be fine"}, {"username": "Tanzia Samad", "comment_text": "I’m here right now in Positano, I’m so glad I made the decision to stay here ! It’s the best hands down ."}, {"username": "Diana Himes", "comment_text": "Do a boat tour from Sorrento that stops in positano for a couple hours. Plenty of time to do a little shopping and stop for a drink! Not sure when you’re going, but I’ve done boat, land and DIY to Positano. The small boat tour was wonderful and peaceful!! Romantic too! We stopped in Positano, Amalfi, and had a swim stop. Same recommendation for a trip to capri. Stay off the big ferry and go with a smaller company for the ambience if nothing else! One more thing…we LOVE Sorrento. So walkable and the restaurants in Marina Grande are so nice! So central and with great access to trains, boats etc.!"}, {"username": "Angela Kodess", "comment_text": "Just wondering what does everyone do with there stuff when they swim...like bag or passports etc. I don't want them stolen.. I keep hearing how bad the pick pockets are & all that."}, {"username": "Dawn Sapien", "comment_text": "We were there a few weeks ago and loved every bit of it!"}, {"username": "Susan Levings", "comment_text": "No more crowded than other parts of Italy."}, {"username": "Kylie Graham", "comment_text": "We are currently on the Almafi and went to Positano today. Was it busy- yes. Is it worth seeing- absolutely"}, {"username": "Karen Cumbo", "comment_text": "Go!!!!! Enjoy! Especially if you have dinner reservations. Get a table with a view. I’ve never had a problem with crowds there. Nothing compared to Walt Disney World."}, {"username": "Patricia Kassas", "comment_text": "I’m here now, staying in Sorento, and going to and from Positano on day trips. It is crowded but so beautiful. if you have organised transport to get there and back, definitely do it. It is a wonderful place even when crowded."}, {"username": "Michelle Knoll", "comment_text": "We were only in Positano for a couple of hours after a long day of walking the coast and it was totally worth it even for just that long!"}, {"username": "Susan Buck", "comment_text": "Just go, you’ll regret it if you don’t. It’s AMAZING!"}, {"username": "Christine Pinto Kulp", "comment_text": "It’s quaint and very beautiful. It’s super touristy though with crowds even in off-peak season and extremely hilly. If you can, stay over at least one night so you can start your day early (before the crowds) and stay out late (after the majority of tourists have left).it’s really pretty at night."}, {"username": "Tiziana Berrtaglia", "comment_text": "Just go and enjoy it"}, {"username": "Donna Kate", "comment_text": "Everywhere is more crowded in peak season, go and enjoy it. That's what I plan on doing in 4 weeks time"}, {"username": "Cheryl Callahan Gibney", "comment_text": "We were there 2 weeks ago. The weekends are very busy, by Tuesday it was not crowded at all. Go midweek if you can. Worth the trip!"}, {"username": "Darryl Vanstone", "comment_text": "We stayed in sorrento and did a day trip by boat to Positano and amalfi. Spent 2hrs in each. Was all we needed."}, {"username": "Christina Altier", "comment_text": "If you have trouble with lots of steps steep and a lot of walking think twice"}, {"username": "Dawn King", "comment_text": "I went and couldn’t wait to leave. Really struggled to see what people rave about"}, {"username": "Oneida Ann Murphy", "comment_text": "Personally just there for second time ..a drive by on ferry is plenty ."}, {"username": "Teresa Heran", "comment_text": "Go!"}, {"username": "Alex Hicks", "comment_text": "I definitely had high expectations for positano and it did not live up to it but you have to if you’re here! I’m in Sorrento right now and it’s a quick ferry ride to the town. It’s definitely beautiful and pictures are great but that’s about it. You need to experience it for yourself though! 😊"}, {"username": "Lauren Ako", "comment_text": "Went for 5 nights. Beautiful place.. Lots of steps, great restaurants, most charming town. i wouldn't miss it. We were there for a wedding."}, {"username": "Monica Villafranco", "comment_text": "Do what YOU want to do. I use these types of forums to get ideas, recommendations\netc. but I don’t allow opinions to deter me from what I have my heart set on. Go! Have fun!! It’s a beautiful place not to be missed!😀♥️🥂"}, {"username": "Lisa Frisco Moore", "comment_text": "Don’t listen to people! Go! It’s amazing! We spent 8 days with our base there and couldn’t get enough! Breathtaking and worth any crowd you’ll encounter!"}, {"username": "Kit Nader", "comment_text": "Just go and enjoy it!"}, {"username": "Kelly Rennie", "comment_text": "Crowds are part of traveling! Don't miss out because of some negative comments. Go ahead with your plans and enjoy. It's beautiful."}, {"username": "Jeanne Bissell", "comment_text": "Getting around by boat is the way to go. Driving is horrible."}, {"username": "Clare Boxer", "comment_text": "We went last week on a day trip from Sorrento, then went onto Amalfi before returning back. It was busy, but honestly fine! You should definitely go if it’s on your list! This was when we got off the ferry.."}, {"username": "Johni Divine", "comment_text": "Definitely go to Positano!!!"}, {"username": "Anna Buchan", "comment_text": "It is beautiful but very busy. Do Almafi or ravello instead same feel"}, {"username": "Dana Talusani", "comment_text": "I think you are doing it right! My husband and I stayed in Sorrento (loved it!) and took a day boat tour to Positano. That was perfect for us!"}, {"username": "Helen Fletcher", "comment_text": "We stayed in sorrento and got the bus to Positano two days in a row to spend time there it was lovely buses take a while and can be busy but it really is fun and tge views are breathtaking"}, {"username": "Nancy Koehler Barboni", "comment_text": "Go!!! A must see once in your lifetime! The journey of getting there is part of the experience too!!!"}, {"username": "Maria Cascardo", "comment_text": "We were just there. Crowded for sure but just know that going in. I didn’t love it but so glad we did it. We ended up only being there for a few hours but it was the experience that I wanted and completely worth the crowd."}, {"username": "Maria NoBa", "comment_text": "I would go by bus and then walk it downhill and take a ferry to return to Sorrento! Will save you a lot of uphill walking. Enjoy!"}, {"username": "Rachael Richardson", "comment_text": "We went for 3 hours well enough time just to have something to eat and enjoy the view, bus from sorrento €2 didn’t take long - only half day needed - over touristy now !"}, {"username": "Kim Cicarelli", "comment_text": "I just got back from spending 3 weeks traveling all over Italy. My FAVORITE place is Positano!!! It is absolutely magical. Please do not miss out on it."}, {"username": "Rita Sanza", "comment_text": "Definitely go end enjoy!"}, {"username": "Nakitha Badon", "comment_text": "We went to Positano for the day and loved it"}, {"username": "Janet Isaacs Lanza", "comment_text": "We were just there a couple of days ago. Crowded but manageable."}, {"username": "Brad Nelsen", "comment_text": "See it but don’t stay long. It’s so hot and crowded."}, {"username": "Renee Rundle Stoneham", "comment_text": "Go.\nYou have reservations which is 1/2 the battle during peak times.\n\nIt’s summer and crowded everywhere, just pack your patience etc…\n\nDefinitely go early so you can explore a bit before lunch. Then you can decide if you want to stay longer, beach (?) or go to another location like Ravello.\n\nDefinitely take a boat, ferry, private water taxi etc one way. As the most beautiful views come from the water."}, {"username": "Toby Levy", "comment_text": "Just got back. We based in sorrento and went to positano for the day. Had a bit of a laugh watching people run through the streets to line up for the first ferry. We went mid morning, and came back on second last ferry at 5.30. Very easy, no long queues and plenty of seats. It was hot and busy in positano but we had no trouble getting lunch and later drinks by the beach without prior bookings. Beautiful day"}, {"username": "Graham Sherlock", "comment_text": "Positano is nothing special at all, was my least favourite place, I was there a month ago"}, {"username": "Melissa Feielin Hawkins", "comment_text": "Just got back from exploring all over Italy and we found that the water taxi’s where the best way to visit all the different villages along the Amalfi Coast. (We went to Sorrento, Positano, Praiano, and Amalfi. ￼Plus you get to see the breathtaking beauty of it from a different perspective.\nJust have your hotel schedule it for you a day or two before hand. We did find that a day of water taxi was very challenging. Have a wonderful time!"}, {"username": "Neville Spargo", "comment_text": "We are staying in Sorrento right now and did a day trip to Positano yesterday. We caught the early bus (#5070) from Sorrento , took around 35-40 minutes, very scenic drive . As for crowds it was crazy busy and super hot which did not make it super enjoyable sorry to say . By taking the bus it lets you off up the top (2nd stop - Sponda is name of stop) on the main road then you get to walk down the hill through all the small roads and alley ways of shops , cafes and restaurants. Some very nice shops . Made our way to the beach and had a very nice swim to cool us down . Found a nice spot for lunch then we caught the ferry back to Sorrento . Nice way to do this as a day trip from Sorrento. I must say, Sorrento is so much more relaxing than Positano. ( Positano is very expensive compared to Sorrento too)"}, {"username": "Lynn LaColla Barnsback", "comment_text": "Ravello less crowded"}, {"username": "Lynn LaColla Barnsback", "comment_text": "It was a madhouse last year and apparently worse this year. Just hard to enjoy anything when it’s just so packed"}, {"username": "Joyce Saccoccio", "comment_text": "Go...its beautiful\nDon't miss it"}, {"username": "Patti Horstmann", "comment_text": "If you take the ferry you will feel like cattle and will miss the evening experience. If it is your only option, then go but plan to be one of a million tourists who leave by 5."}]}]