[{"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2200609640338114", "text": "Hey friends! Headed to Italy from October 3-20th.\n\nI have two main questions- I only booked us two days in Florence; is that enough?\nAlso-\nIs Naples and the southern western coast still open and available to visitors? I\nAlso; I’ve heard Naples is dirty but looks like a good center point for a lot of activities we want to do- what’s your opinions?", "link": "facebook.com/groups/1373361046396315/permalink/2200609640338114/", "likes": 2, "comments": [{"username": "Pao Magnoler", "comment_text": "You can do 2-3 days in Florence, just Florence, if you want yo visit Tuscuny then you will need much more."}, {"username": "Scott Perry", "comment_text": "Naples is fantastic! I stayed in Chiaia this summer. Upscale area, yet just a couple metro stops from the center."}, {"username": "Karen Schmidt", "comment_text": "Two days in Florence is enough if that is all you plan on doing. If however, you want to book a tour￼ to see some of the smaller towns, catch a winery, eat lunch at the farm etc. then you’ll need another day."}]}, {"id": "2200451513687260", "text": "Wow!!!!! We have just reached 500k 🥳🎉🥂 Thank you to all of you for making a friendly, informative and beautiful group! 💪 **Keep posting and inviting new members! **\nGrazie! ❤️🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2200451513687260/", "likes": 4, "comments": []}, {"id": "2200433307022414", "text": "DAY 7 - CISTERNINO\nCisternino is one of the most charming villages of the beautiful Valle d’Itria!\nWhere to stay: Borgo Canonica....like in a fairy tale!\nGorgeous setting, landscapes and overall architecture...set… आणखी around olive trees, bouganvilla & flowers. Everybody at this hotel is so genuinely friendly and helpful. The 42 trulli, that below to the rural borgo of the nineteenth century ,will bring you back to the past in order to let you live a unique experience!\nDiscover more: https://www.tkqlhce.com/click-100692842-11552042?url=https%3A%2F%2Fwww.tripadvisor.com%2FHotel_Review-g652000-d12659041-Reviews-Borgo_Canonica-Cisternino_Province_of_Brindisi_Puglia.html%23%2Fmedia%2F12659041%2F327368771%3Ap%2F%3Falbumid%3D101%26type%3D2%26category%3D101\n#puglia #cisternino #itriavalley #trulli #trullilovers #trullihouses #apulia #apulianholidays #apulianlife #apuliatravels #apulianfood #white #whitelovers #hiddengems #magicalplace", "link": "facebook.com/groups/1373361046396315/permalink/2200433307022414/", "likes": 1, "comments": []}, {"id": "2200480380351040", "text": "Hi everyone we would like to go to Orvieto from Rome. What would be the best way to go there ? Train or bus ?? Train do I have to reserve tickets or buy them upfront ?", "link": "facebook.com/groups/1373361046396315/permalink/2200480380351040/", "likes": 1, "comments": [{"username": "Sue Gaughan", "comment_text": "The train! From Roma Termini! So easy!"}, {"username": "Sue Gaughan", "comment_text": "I always purchase my tickets right before I’m ready to leave. Check the Trenitalia app"}, {"username": "Simone Pfenninger", "comment_text": "Train - reserve in advance - take Business or First, if available, tickets"}, {"username": "Katrin Martin", "comment_text": "download Omio app then buy tickets there to take the train. find one that is cheapest."}]}, {"id": "2200482440350834", "text": "I just read that flip flops are not allowed on Capri. Since we will be on a boat tour to Capri, I thought flip flops would be acceptable, but then I read this article saying they aren’t allowed. Is this true? Also can bus tickets, tickets for the funicular, chair lift, and blue grotto be paid for with a credit card or are euros needed to pay for these Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2200482440350834/", "likes": 49, "comments": [{"username": "Romina Lauretig Toscano", "comment_text": "Since the 60ies in Capri noisy shoes are forbidden..."}, {"username": "Karen Tuccinardi", "comment_text": "I was just there last week and wore my flip flops.."}, {"username": "Nicole Gangale", "comment_text": "I stayed in Capri for 3 days and wore my flip flops no issues!"}, {"username": "Leila Myftija", "comment_text": "Noisy shoes aren't allowed."}, {"username": "Simone Pfenninger", "comment_text": "I traveled only in Flip Flops all over Italie 🙂"}, {"username": "Simone Pfenninger", "comment_text": "Unbelievable !\nCan you wear Flip Flops in Florida?"}, {"username": "Connie Vitale", "comment_text": "Just flip flops not allowed in cinque terre but sandals like tevas are ok? Or only closed toe shoes as someone else indicated?"}, {"username": "Claudette Franco", "comment_text": "Normally in boats you are not allowed to use flip flops, so once you arrive you put it in a special place and walk around the boat without it; maybe that is what they are trying to say.\nI went to Capri and use flip flops day and night; most of the people are in flip flops or sneakers."}, {"username": "Samaria Braman", "comment_text": "F"}, {"username": "Lisa McCusker Sherer", "comment_text": "Ohhh Capri is absolutely beautiful- I wore sandals!!\nA charming jewelry store at top (as u get off the life)) - sell beautiful cameos- still bummed I didn't get one (looked all over Italy, nothing like the shop in Capri\n\n- the roads are very uneven and rocky- but I wore open toe sandles"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Yes you can wear flip flops… they actually sell beautiful ones on Anacapri and you can buy everything with a credit card. We went to Italy for two weeks and brought no cash."}, {"username": "Diane Leesmith", "comment_text": "Wear trekking sandals like teva etc (which you can also go in water with) , have good support and no need to worry about flip-flops then."}, {"username": "Teresa Marina", "comment_text": "I literally just got back and wore flip flops lol."}, {"username": "Lisa Martinson", "comment_text": "Lol just be careful walking in them."}, {"username": "Ivette Lugo", "comment_text": "crocs are the best"}, {"username": "Michelle Sarkis", "comment_text": "This is so funny you can where what ever the f*** you want on your feet!"}, {"username": "Luisa Ravenna", "comment_text": "In Capri you can't use wooden flip flops because they are noisy. In Cinque Terre you can't use flip flops in the paths because they are dangerous.\nYou should be able to pay everything by credit card, it's the Italian law"}, {"username": "Romina Lauretig Toscano", "comment_text": "This kind of noisy shoes are forbidden"}, {"username": "Paul Davis", "comment_text": "Jo Ann Ciuffini Forcino: Apparently this is true…and believe it or not it is because they are too noisy!!\nThat’s one snooty town!!😂😂\n\nhttps://\ntravelbiz.ie/\npassengers-urged\n-to-leave-flip-\nflops-at-home-i\nf-they-want-to-\navoid-hefty-fin\ne/\n#:~:text=Accordi\nng%20to%20YourO\nverseasHome.com\n%2C%20flip,in%2\n0the%20rest%20o\nf%20Italy."}, {"username": "Monica Roman-Fazio", "comment_text": "Was just there and I wore flip flops along with everyone else"}, {"username": "Gommy Shirley Pribisco Brady", "comment_text": "I don't know about in Capri, but I wore flip flops while in Rome and all the way down the Amalfi Coast."}, {"username": "Skye Birch", "comment_text": "who the heck told you this... this is un true yes you can wear them."}, {"username": "Ville Lignell", "comment_text": "Folks, google images of the landscape & terrain on Italian islands, Sorrento peninsula or Cinque Terre. I've seen tourists struggling in flip flops even on the streets of Naples. I can't understand who in their right mind would venture on rocky terrains in footwear only suitable for the beach...Cards are accepted everywhere but you'll be charged in €€, that's our currency."}, {"username": "José Marina", "comment_text": "mandami la tua data di nascita e ti dirò cosa vedono gli angeli nella tua vita amorosa❤️🇮🇹"}, {"username": "Larry Dash", "comment_text": "You mean I can’t wear my tap dancing shoes?🤣"}, {"username": "Thelma Gipson", "comment_text": "Not true, people wear flip flops everywhere, capri and cinque terre. Wear whatever is comfortable for you, it's your vacation."}, {"username": "Rachael Richardson", "comment_text": "You wouldn’t be able to walk up the hills in them anyway ! But if you staying there and have a pool - how can it be a rule 😂"}, {"username": "Rachael Richardson", "comment_text": "Also don’t bother going to capri it’s not worth it as a day tourist 20,000 people it’s a nightmare, do an Amalfi coast boat tour instead"}, {"username": "Connie Iacozza Brazzoni", "comment_text": "I wore my flip flops. No issues"}, {"username": "Jodi Bruno Rojas", "comment_text": "I was there last week and wore flip flops. No problem"}, {"username": "Billie Begley", "comment_text": "Not that I’m aware of. They are not acceptable in the Cinque Terre."}, {"username": "Lisa DiDonato Hayden", "comment_text": "I wore flip flops on Capri with no issues. I was also coming from a boat tour."}, {"username": "Stacy Prestigiacomo", "comment_text": "No I wore there"}, {"username": "Diana Sideris", "comment_text": "I wore them- we went to the beach there and around town this is news . Maybe in evening restaurants? Overall they don’t wear flip flops in Europe around just for beach days not for evening dinners or around cities"}]}, {"id": "2200442390354839", "text": "Give me all the details on using HIPPOCKET Wi-Fi! Worth it for iPads? Will be traveling for 20 days! Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2200442390354839/", "likes": 1, "comments": []}, {"id": "2199941623738249", "text": "EDIT: We have decided to take the Campania Express. Thank you, all, for your input and help.\n\nWhich train is better to take with two carry ons, and two backpacks: Campania Express or Circumvesia train? I'm reading horror stories about both. Ugh.\n\nWe are coming in from Florence to Naples Centrale, then we have to get to Sant'Agnello. Where we areआणखी staying is five minutes from the train station. It will be mid-dayish on a Friday.\n\nI checked on a private transfer and they are RIDICULOUSLY expensive, close to $300!!! No thanks.\n\nSuggestions, please? Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2199941623738249/", "likes": 3, "comments": [{"username": "Stacey Esposito", "comment_text": "See if your hotel can arrange pick up at the train station for you. Ours did in rome and it was 60 euros. Looking myself it was much more"}, {"username": "Paula Brink", "comment_text": "Probably the Campania Express as it’s more of a tourist train rather than a commuter train like the Circumvesuviana\n.\nYou will be fine, just keep an eye on your belongings if the train is crowded."}, {"username": "Miyuki Kanno Paul", "comment_text": "Campania Exp is catered to tourists. Reserved seats, aircon’d, luggage spaces and such. It only runs 2-3 times a day, and a bit pricey that locals don’t use it. We found it very inconvenient for our time schedule, so we took regular commuter train. During off peak time, it skips several minor stations, so it’s a plus for us. Just be aware of your surroundings at all time, just like you do anywhere!"}, {"username": "Angela Gilmore", "comment_text": "Campania Express is just for tourists, so I think it is better for you. I've never taken it, but I know it has AC, more comfortable seats, more space for luggage and there are only tourists on it (less chance of pickpockets). If I am not mistaken, it leaves from platform 3 in Napoli Garibaldi Circumvesuviana\nStation (which is under the train station).\nRegular train is super crowded, no AC, not always on time. It is way cheaper that Campania Express.\nThis is the time schedule of Campania Express"}]}, {"id": "2199939750405103", "text": "I know I’ll be eating my way around Italy but I also will be with my 2 children. Just wondering if the supermarkets are easy to find to buy the basic essentials that my kids will eat ? Eg fruit, yoghurts, nuts, crackers etc etc I’m worried if they don’t eat out if they don’t like the food I can carry the basics on me ???\nSorry. Should’ve mentioned my son is sick and at times can only eat certain things depending on how sick he feels at the time. So just trying to be prepared for when he can’t eat out that I have the basics to offer him.\n\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2199939750405103/", "likes": 28, "comments": [{"username": "Erica Senes Tombesi", "comment_text": "Ask for \"Supermercato\",\nas we call supermarket. There are everywhere, and you can find everthing you needs. In Highways you will find also some store, whith nuts and crackers for sure, but maybe no fruit or yogurth..\nI'm so sorry for you son."}, {"username": "Evelyn Brown", "comment_text": "If you want to look for grocery stores near your hotels, look for names like Carrefour, Pam, Conad, Esselunga (I'm sure there are many more, but that's what I have near me). They have a pretty great selection, including potato chips and even peanut butter 😉 Sometimes you'll see these stores with 'City' or 'Express' in the name - this means it's a smaller store, closer to convenience store in size, but still offering produce, dairy, etc. It's just in a smaller space, so selection can be a little limited.\n\nGood luck with your travels!"}, {"username": "Jeanette Moore", "comment_text": "We saw small grocer type stores. Lots of Swiss yogurt and healthy snacks. Very good!"}, {"username": "Lisa Silverman", "comment_text": "Believe it or not, with the exception of Rome, we didn't see any supermarkets. Was in Pisa, Sicily and Naples. Lots of pharmacy's not supermarkets."}, {"username": "D'Anna Hohe", "comment_text": "For all those people who think that the question is silly, I want to point out that many large cities in the US do not have full scale supermarkets near downtown tourist areas, so this may be a very reasonable question coming from people who have not traveled to Europe before."}, {"username": "Nadia Mckenna", "comment_text": "You will have no problem getting yoghurt, chips , crackers or any snacks. Btw, fruit in Italy tastes amazing. So much more flavour than what we get in Australia 😋"}, {"username": "Diana Paniagua Santos", "comment_text": "I’m most Italian cities I’ve found this supermarket, Carrefour. A lot of them are open 24 hours, they have all the essentials, plus precut fruit, veggies, premade meals and frozen food. Look for them, I think they’ll have everything you need."}, {"username": "Elena Paonessa", "comment_text": "Rest assured that u will find every possible kind of snack, food, produce that u find at home. Generally even better quality as food is beyond important to Italians and they don’t eat all the processed, junk food that we tend to consume in North America. Just Google supermarkets near me and I’m sure that you’ll find many in the general vicinity of your hotel. Your son will be thrilled with the many tasty options so don’t worry too much : )"}, {"username": "Alexis Brajtman Aruch", "comment_text": "In more historical areas often found fruit and little grocery stores and delis but not necessarily massive supermarkets. Lots of little places selling simple sandwiches etc too which my then even more fussy than now younger son was very happy with. I’m not sure what foods your son can or can’t eat but I for e.g can’t eat gluten and had no issues on a trip to Italy last year. Couldn’t eat everything everywhere but was easily able to find great Italian gf options"}, {"username": "Pat Hojnowski", "comment_text": "People, can' t you read and kind?\nHer child has an illness, for God's sake."}, {"username": "Morena Federici", "comment_text": "You can easily find many supermarkets, but I advise you to enter the small food shops and small bakeries. You will find many typical products, artisan bread of many types, cured meats, cheeses, local sweets."}, {"username": "Elissa Astorino", "comment_text": "Italy is all about food. You will have no problem finding the basics no matter where you go. Locals are usually very helpful to ask as well."}, {"username": "CiCi LeCanard", "comment_text": "This was a good question! Also a good idea to have little ziplock bags handy. signed mom of three have fun mom🤗"}, {"username": "Irene Oda", "comment_text": "You don't mention where you are from. Yes as others have mentioned all this food is available at supermarkets. Where you find supermarkets will depend on where you are. Even smaller cities have supermarkets. Sometimes they are large other places have smaller 'mart' types. If you need to know where, I would check on Google where to find supermarkets in any given place. As an example - where I am in the south and in a town of less than 10,000 population I've got 3 to choose from. Plus I've got a weekly fresh food market. So it really depends on your destination. Ask also at your hotel. They can give you lots of advice."}, {"username": "Toni Quatrini Bannister", "comment_text": "I saw markets in all three of the cities I visited. I was able to buy snacks and water. They have everything you will need."}, {"username": "Helen Hammond", "comment_text": "Plenty of good supermarkets and grocery stores all over Italy, you will eat well"}, {"username": "Debra McCraw Austin", "comment_text": "We found this supermarket in Rome. They had everything we get in the US... Cheerios, yogurt, produce, snacks, Gatorade, deli meats, and much much more. I used Google Translator on my phone for understanding some labels."}, {"username": "Cheryl Belloff", "comment_text": "Wow very snarky comments 😳😳😳😳sorry Karla I was wondering the same thing ! Wish people wouldn’t post comments if they can’t be nice"}, {"username": "Kacie Poskitt", "comment_text": "I found some awesome grocery stores in Milan & Florence. I struggled to find anything in Amalfi coast. In Naples I didn’t look too hard so I can’t say. I would search grocery stores on a map of the places you’re staying and they’ll pop up"}, {"username": "Catherine Rawcliffe", "comment_text": "You will find that what are called supermarkets in many Italian cities would barely register as a corner shop elsewhere. Very small, often in historic buildings without huge signs outside, but always surprisingly well stocked. I'm pretty certain you'll be fine for the 'normal things you mention everywhere. They may noy be familiar brands, but they'll be recognisable enough for you to find what you want."}, {"username": "Vanessa Durkin", "comment_text": "I think this was a very alpropriate question I was also wondering how accessible gricery shops are in relation to tourust areas so am hapoy with tge informative answers from most people you always get a few nasty ones"}, {"username": "Ellen Martin Weglarz", "comment_text": "Yes by small not like here in the states"}, {"username": "Terri Anna", "comment_text": "Use Google Map with your hotel address then type to search for supermarket or even Aldi…"}, {"username": "Kally Trahearn", "comment_text": "Wherever you are, you can use Google Maps and search supermarket - it will show you where the nearest ones to you are. I'm sure you'll find something for your son to eat, especially if he can pick it out himself.\nEnjoy your trip"}, {"username": "Jodi Harris", "comment_text": "An Australian, and have just spent 6 weeks in Italy mainly in Puglia and Sicily. There is much less choice of supermarkets than what we have in our country. Also less choice of fresh foods particularly fresh meats and vegetables. Plenty of cheese, bread, pasta and cured meats though! Often the better supermarket chains you need a car as they are on outskirts of town.\nEdit - If you can find their local farmers markets, these are amazing."}, {"username": "Rita Sanza", "comment_text": "I was in Sicily last week and there's lots of supermarkets. Where do you think people do their shopping."}, {"username": "Susan Rathke", "comment_text": "I never found a grocery shop in Genoa, but was able to pop in for a focaccia, found a farmers market for fruits/veggies and got water from the fountain. Sandwiches were my staple.\nFound 2 grocery stores within 1/2 block of each other in Milan. It was hit and miss for me."}, {"username": "Sara Bee", "comment_text": "Are you looking for very specific things? You can find pretty much everything in Italy…maybe less variety of junk food."}, {"username": "Kate N Karim Al-Azzawi", "comment_text": "They're there but they look very inconspicuous. Look for more like \"corner stores\" - they have all sorts of cool things for snacks!"}, {"username": "Jennifer Charsley", "comment_text": "Google maps is helpful in pointing out supermarkets. They are sometimes a bit hidden but they are many and very well stocked"}, {"username": "Jennifer Larese Taylor", "comment_text": "Italian grocery stores are amazing. Just don’t handle the fruit and veg- they are extremely hygienic. Your kids will enjoy going and picking out some snacks"}, {"username": "Sh Kaplan", "comment_text": "I have to say that the supermarkets will have those things but no junk food. It’s hard to find a potato chip if that’s what they eat. I assume the Italians don’t eat much junk which is why most Italians I saw were very thin.\n\nAnyone making fun of this post is just not nice. This woman wants to know this information and you can all be gracious. If you have nothing nice to say then don’t say anything"}, {"username": "Daniele Morani", "comment_text": "There are plenty of places where you can buy food in Italy. The only thing to pay attention to is opening hours: some small, indipendent shops in small towns might close for lunch. That being said, I can guarantee your kids won't starve in Italy. Hell, not even the homeless starve in Italy."}, {"username": "Linda Slover Bright", "comment_text": "You will enjoy shopping for groceries in Italy! The COOPs are fantastic. The produce is fresh-picked and picture perfect."}, {"username": "Natalie Goldman", "comment_text": "I will give you a piece of info. When you buy fruits in supermarket, weigh them and get a ticket ( they have stations all over produce station). The cashier will NOT weigh your produce and will send you back to do it.\nThe machines are very easy to use ( with pictures)\nI learned the hard ( and embarrassing) way that I need to do it 🙂"}, {"username": "Karen Schofield", "comment_text": "Yes. Lots of supermarkets with the basics and also exciting things that you won’t get at home."}, {"username": "Giada Todaro", "comment_text": "Sorry not sorry. Do you know that italy is not a third word country? Not only you will find hundreds of supermarkets on your path, but u will find better food that u usually find in your country. 😑"}, {"username": "Tania Badilla", "comment_text": "I went with my 7 & 6yrs old kids this summer and had to cook breakfast for them daily (Airbnb) Lunch and dinner they had pasta, pizza, etc. we didn’t have any problems 😊"}, {"username": "Suzanne Calpito Ragsdale", "comment_text": "Any regular grocery store around you will work. Just use your phone to locate one. But I’d be surprised if your kiddos didn’t like the food. Truly you can get plain spaghetti and plain chicken, plain lettuce…in any restaurant."}, {"username": "Jessica Palladino", "comment_text": "PAM is great with multiple locations! Just throw it in Google maps"}, {"username": "Kathryn Zurcher-Baglien", "comment_text": "Through the pictures I have seen on this site, there seems to be a fair amount of open air markets and stores. No doubt you will be fine.🙂"}, {"username": "Kie Francis", "comment_text": "Plenty of lidl"}, {"username": "Mary Lou Gillen", "comment_text": "You didn’t say what month you will be there. This time of year it’s the most crowded and steaming hot. I would think the Italians have pretty much had it with the tourists by now. I know I would. Other than that I find that the Italians really love small children and go out of their way to prepare something special for your children. Also remember that Italy has everything we have in the United States or wherever you are from. You are not going into the wilderness. You’re going to be surprised that every thing your children eat at home will be easily found there. When kids get hungry don’t worry they eat!"}, {"username": "Maria Teresa Dimacali", "comment_text": "If your child is picky. You can always ask for pasta with butter. If your kids like spaghetti pasta.. “Spaghetti ala burro.” Or “Penne ala burro.” That’s what I order for my picky child since she doesn’t like sauces on her pasta. But she loves Italian carbonara. Hope this helps! 😊"}, {"username": "Michele Liggett", "comment_text": "Disappointed un rhe negative comments being posted here. This group has been helpful to many on other questions."}, {"username": "Pam Vel", "comment_text": "At Roma Termini, there's a grocery at the lower level"}, {"username": "Tana Muraro Sheets", "comment_text": "Small stores seem to be every few blocks. You may have to go to several to get basics. Be sure to bring reusable bags. ♥️"}, {"username": "Cherie Hewitt Gilbert", "comment_text": "Amazing how we all read things different ! First i hope your son gets better soon .. there’s a huge difference in be picky and not being able to eat certain foods because you are sick .. no one should have to suffer from that .. especially kids. I’ve have not been there (yet) so have no idea how close the stores are to anything .. i live 20 miles from one myself so i have to plan ahead ! Hope you get some good advise .. Good luck ! Hope you all have a fantastic trip !!!"}, {"username": "Nicole Beaumont", "comment_text": "Yes, they’re easy to find and have the essentials. I always frequent the grocery stores in whatever country I’m in."}, {"username": "Maggie Gpe Banuelos", "comment_text": "We found several mini marts in Rome called Carrefour! You can google map them for the nearest location🤗 I needed my fruit early morning so I would buy late evening and have it at my disposal🤗 plus ny daughter needed her snacks so I get you 🙌"}, {"username": "Bea Kuckens", "comment_text": "We are always able to find a market to get at least beer, water, distilled water (for CPAP), yogurt, bananas, etc. to have on hand. Most of them have at least a small selection of grab & go items. If you're lucky, they'll have a real deli and bakery, too 🙂 I had to eat very bland on our last trip and was able to manage with market purchases for many meals (at least breakfast and lunch) - not fun but you do what you have to do. And in an eatery I'm not afraid to ask for just pasta with butter if that's all my system will handle that evening."}, {"username": "Lois LaMonica Norton", "comment_text": "If you have hotel with breakfast, most I’ve been to on recent trip included yogurt"}, {"username": "Lauran Cantwell", "comment_text": "Not sure where you're staying but there was a cute supermarket more like we're used to on the corner of the street with the steps to the Vatican Musuems entrance. It had everything and more you could possibly need."}, {"username": "Maureen Rebello Hagerty", "comment_text": "Yes. Very easy. If you don’t speak the language get a translator app for your phone. It can read labels and stuff"}, {"username": "Mary Passeri", "comment_text": "Hi, you'll be absolutely fine.Supermarke\nts are usually well sign posted plus there are small shops, bakers, greengrocers etc everywhere. You might even be lucky enough to come across a street market.\nRelax and enjoy your holiday."}, {"username": "Diana Smith", "comment_text": "Some supermarkets close around 1 P M and reopen around 4. Keep that in mind. Other than that you should be able to find anything. Have fun…:) Btw… you will be doing so much walk that even if you eat you will lose weight… 😆"}, {"username": "Samantha Osborne", "comment_text": "Supermarkets can be found especially in big cities who will have a metro branch. I stayed in Rome and bought all sorts to take to my hotel room. They have nice yoghurts and the crackers are lovely. I used to buy nuts and potato chips too with mini bottles of prosecco"}, {"username": "Francesca Baker-Brooker", "comment_text": "I think this is a really helpful question as I have anorexia and prefer to cook myself, so will be shopping in supermarkets for my safe food."}, {"username": "Joanne Nacson", "comment_text": "Research the places you are going to and see where the nearest supermarket is to your accommodation. You could also check with your host if there is one within walking distance. It might be good to pack enough emergency supplies from home of his favourite items. It’s often hard for people to answer questions when there are no specifics. If you will have a car you will most likely be able to drive to a supermarket. I doubt smaller towns have multinational supermarkets - most likely fresh food markets set up in the town square. Hope this helps"}, {"username": "Farah Metheny", "comment_text": "I would suggest packing some of his favorite, non perishable snacks. The food in Europe is definitely different, in a good way! More fresh foods, less prepackaged. Fruit shouldn’t be a problem. He might actually feel better eating Italian food since he won’t be eating processed American food. Use your Google maps or Apple Maps to locate supermarkets or fruit stands. Hope you and your family have an amazing vacation, and your son gets to enjoy some yummy Italian food. 🙂"}, {"username": "Sandy Michelle Duggan", "comment_text": "yes, very accessible"}, {"username": "Ilaria Giorgulli", "comment_text": "Your kids will eat easily, it’s full of supermarkets with fruit departments, snack, biscuits.. i suggest you to buy Taralli (salty round snack, very basic ingredients) yoghurt we have many kinds. I’m an Italian mum of 2kids!"}, {"username": "Charlotte Yksnøy", "comment_text": "I have picky kids and They eat a lot every time we are in Italy. Pizza margarita, fries, pasta napolitana, pasta bolognese. Just make sure to chose places that are child friendly.\nSupermarkets are also very accessible, I am sure you will be able to find snack options there 😊"}, {"username": "Yvonne Ormson", "comment_text": "Yep. Italians shop at grocery stores too 🙄"}, {"username": "Rhona OConnor", "comment_text": "There are lots of small supermarkets in every town..... Not the big malls of the US but local shops with a wide range of products."}, {"username": "Wendy Harrison", "comment_text": "Visiting grocery stores in different countries is always a treat, and a tourist attraction in its own right. Enjoy!"}, {"username": "Alice Francesca", "comment_text": "No we don't have supermarkets.We\ngrow our food on our balconies;)"}, {"username": "Phyllis Snyder", "comment_text": "Yes! Best food in Italian markets! No additives like in the states! Healthy eating!"}, {"username": "Lea Clariss Baduria", "comment_text": "They will be fine. Spaghetti everyday and pizza . They love these 🍕 🍝 for sure.\nShops are accessible for sure."}, {"username": "Linda Miller", "comment_text": "Plenty of grocery stores in Italy"}, {"username": "Angela Spori", "comment_text": "No. We aren't fans of children in Italy so we don't have anything they would eat in supermarkets"}, {"username": "Renae Larcus", "comment_text": "Grocery stores everywhere."}, {"username": "Camellia May Phillips", "comment_text": "Supermarkets and open air markets are fantastic and super fun to find new foods. I much prefer that to eating in restaurants."}, {"username": "Stephanie Garofalo", "comment_text": "Easy to find and the kids should enjoy the experience!"}, {"username": "Dayna Scinto", "comment_text": "Easy to find those items in most supermarkets or COOPS which is a common supermarket chain. We stocked up on similar items to have as breakfasts and snacks at our Airbnb’s"}, {"username": "Dareya Pourhamidi Cohen", "comment_text": "Kids that don't like pasta? That's a new one 😁"}, {"username": "Rita Sanza", "comment_text": "Please!you're going to Italy!"}, {"username": "Angela Cagna Gaberel", "comment_text": "Local supermarkets are inside towns and always a walkable distance from touristic areas, big malls are outside towns"}, {"username": "Shawna Mcdonald Sapp", "comment_text": "Sometimes the rudeness of comments has me cracking up. Honestly people. We visit Mexico regularly of course we know they shop at the grocery store. Does that mean the grocery store is easily accessible from the tourist area…. Nope, we take a taxi to get there every-time. Maybe her question was more how far from the touristy area are the stores so she can plan how to get there. Geesh"}, {"username": "Chris Vilsack", "comment_text": "Yes of course. It's not restaurants everywhere"}, {"username": "Angela Cagna Gaberel", "comment_text": "Example: if you open Google maps and search Firenze supermarket, you’ll find how many supermarkets are in the center of Firenze!"}, {"username": "Angela Cagna Gaberel", "comment_text": "Angela Cagna Gaberel"}, {"username": "Angela Cagna Gaberel", "comment_text": "Then when you spot one you can go on searching with street google!"}, {"username": "Angela Cagna Gaberel", "comment_text": "This seems a little one just in the center of Firenze!"}, {"username": "Patrizia D'Arcangelo", "comment_text": "Sorry, but where do you think you're going? There are supermarkets and grocery stores everywhere. You are not going to the Sahara desert."}, {"username": "Angela Cagna Gaberel", "comment_text": "Dope! Isn’t it? I can personally assure you that Carrefour has fruits and yoghurt"}, {"username": "Yvonne Donnellan", "comment_text": "Italy has fantastic supermarkets."}, {"username": "Anita Gundersen", "comment_text": "If the kids don’t like italian food, they won’t starve to death during the vacation 🫨"}]}, {"id": "2200433693689042", "text": "Has anyone used a private driver to go from Florence to Rome? If so what was the cost and who did you use? Grazie!", "link": "facebook.com/groups/1373361046396315/permalink/2200433693689042/", "likes": 0, "comments": [{"username": "Anne Hunter", "comment_text": "Yes we have booked Joe Bananas for all our transfers in October this year\nGoing from Rome to Florence with a winery stopover\nJust ask for a quote\nThey are great to deal with"}]}, {"id": "2200448203687591", "text": "Amore.\nFirenze", "link": "facebook.com/groups/1373361046396315/permalink/2200448203687591/", "likes": 2, "comments": []}, {"id": "2200449083687503", "text": "I have reservations in Sorrento this September. I am hearing conflicting reports that Sorrento is filled with hills and hard to navigate. I consider my self in decent shape but I’m fearful that too much could make my trip less enjoyable. I’m wondering if Positano or the Amalfi Coast would be better?\n\nOr somewhere else? We have two weeks to trainआणखी travel around Italy before we head to France.\n\nPlease note: we have traveled to Italy before. In fact we just got back this week from taking our teens and I’m exhausted. The heat really took it out of me.\n\nThank you for your guidance and advice. I appreciate it.", "link": "facebook.com/groups/1373361046396315/permalink/2200449083687503/", "likes": 14, "comments": [{"username": "Barbara Bastianini", "comment_text": "Anywhere on the Amalfi Coast is going to have hills. You really can’t escape them. Cliffs are just part of the landscape.\n\nPositano will be worse than Sorrento."}, {"username": "Sharon Milligan Martin", "comment_text": "No. Sorrento is fine. Positano is very hilly."}, {"username": "Lauren-Jade Roberts", "comment_text": "The main part of sorrento is on top of the cliff. From the port there is a lift to the top or a bus for €1.40 which takes you up and down the cliff.\n\nThe port is flat and the centre is flat it’s the getting from one to the other which is steep but there are alternatives. Also the walk down from the town to the port is okay as in the shade and down hill"}, {"username": "Kimberly MacKinnon Cherry", "comment_text": "Sorrento doesn't have lots of hill, but Amalfi Coast does for sure! Sorrento is lovely, we really enjoyed it."}, {"username": "Renae Larcus", "comment_text": "Haha. Positano is way more hilly than Sorrento"}, {"username": "Jessica Jordan", "comment_text": "Have never been to Sorrento, but was in Positano in May. Steps everywhere and you were either going up hill or down hill. Quite a workout!"}, {"username": "Kay Rendall", "comment_text": "There is also a bus from main square to Port. That I use. Up to the markets behind station is a bit uphill, but u cam taxi and walk back."}, {"username": "Mary Anne", "comment_text": "We found Sorrento to be fine. We stayed in Sant ‘Agnello and walked into Sorrento a number of times. No steps and beautiful views. We used the lift at the Sorrento port and also the one in Sant’Agnello down to the the beach bar."}, {"username": "Virginia Walton", "comment_text": "Don’t skip out on Sorrento. It is worth it."}, {"username": "Rachael Richardson", "comment_text": "There are not many hills in sorrento there is a lift down to the front ! Positano is unreal for hills and stairs , think you may have been given wrong info"}, {"username": "Janice Rea", "comment_text": "Sorrento is a way better option than towns in the Amalfi Coast. We were just there. I didn’t find it too hilly to navigate. Wishing you the best. ."}, {"username": "Starla Dawn", "comment_text": "Oh my goodness no it’s easy to get around. Just one cliff to the harbour and beach but there is an elevator. I really loved the vibe in Sorrento"}, {"username": "Sandy Michelle Duggan", "comment_text": "sorrento has a lift from beach to town, its your choice to walk or use lift , the lift is 1.10 euro each way, in town it's quite easy getting around. Just spent 4 days there."}, {"username": "Carine Boon", "comment_text": "In Sorrento they have busses because there are some hills, but nothing compared to Positano or Amalfi."}, {"username": "Marc Rosenfeld", "comment_text": "Positano is ALL hills. Sorrento is amazing!!! If you need to go to the beach you can take an elevator down and back up"}, {"username": "Rhona OConnor", "comment_text": "Look at the other side of the country..... Mostly flat and georgous. We stayed in Bari and Pescara. Lots to do and see. Not full of tourists."}, {"username": "Joey Clark", "comment_text": "Sorrento is perfect. We went to each town on the amalfi coast, but so glad we stayed in Sorrento. Definitely take the lift up from the port. Eat lots of lemon cake - you won’t find it anywhere else in Italy like here…I miss it the most!!"}, {"username": "Betsy McCallum", "comment_text": "We stayed in a lovely hotel, Antiche Mura, just off the main square￼￼. I am quite disabled with bad knees and found Sorrento very easy to navigate. Also Amalfi and Ravello were relatively flat￼. Stayed in Sorrento for 9 days and loved it￼"}, {"username": "Nina Churchill", "comment_text": "I would stick with Sorrento, it’s a good base for exploring the area with a good tourist infrastructure."}, {"username": "Dixie Kotylak", "comment_text": "We were in Sorrento one night and I loved it, didn’t find it too steep at all! Cinque terra was very steep, and I loved Sorrento!"}, {"username": "Kally Trahearn", "comment_text": "I've been to both Sorrento and Positano and this time around will be travelling with someone who has mobility issues. We will be staying in Sorrento and avoiding Positano at all costs. Sorrento is relatively flat and will a little patience, the cobbled streets can be navigated fairly easily. Positano has more ups and downs than a Yo-Yo 🤣"}, {"username": "Kim Butler Oam", "comment_text": "Sorrento is ok if you get accommodation in or near town. My tour had us up in the hills so it was not a good location. The hotel had a shuttle but there was a fair bit of waiting around for that.. Just be careful booking your accommodation and you’ll be fine, Sorrento is a great base"}, {"username": "निनावी सहभागी", "comment_text": "Thank you everyone. You absolutely sealed the deal."}, {"username": "Julieta Sommariva", "comment_text": "Sorrento is fine, we just came back and Positano is worst but beautiful! I would go back 1000 times"}, {"username": "Tracey Fairbrother", "comment_text": "The town is pretty flat but on a cliff"}, {"username": "Debra Kingston", "comment_text": "Sorrento has a very flat, non hilly area in their main area of town. Just lovely to walk around the shops, butchers, bakers, sandwich shops, restaurants. Stay in town.\nI never experienced any major hills. Positano is built on hills. I could only stay by the Main Street close to the beach. You do not want to stay in the hills there, but beautiful for a visit."}, {"username": "Omar Chaaraoui", "comment_text": "I wouldn't care much. Positano is hilly, but it's worth the effort. Sorrento is not that hilly. Both are gorgeous, so don't let a little bit of effort get in the way of enjoy some of the most beautiful places on earth."}, {"username": "Fetchin Gretchen", "comment_text": "Sorrento is part of the Amalfi coast. I was there 5 days as a base and there is an elevator to get quickly up and down hill so you do not have to walk so much. As a base it is easy to go to positano. Capri, Amalfi, etc by ferry or take the bus along the coast to Serrano."}, {"username": "Bob Dook", "comment_text": "Sorrento no problem. Positano steps."}, {"username": "Danielle Gervais", "comment_text": "Sorrento is perfect! Try to go and have the buffet if it’s still exist at night for supper the Grand Hotel Excelsior Victoria, food exquisite and the view! Naples , Capri and the Vesuvio\nWe had the chance to have a table right on the edge! Will never forget"}, {"username": "Janet Isaacs Lanza", "comment_text": "Positano is worse to get around than Sorrento. A ton of hills and stairs."}, {"username": "Jillian Maxwell Novay", "comment_text": "Sorrento is fine. Not hilly, just lots of uneven/\ncobblestone streets. Positano has endless stairs!"}, {"username": "Jeff Neil", "comment_text": "Also if you arrive or depart Positano by ferry, you are in a pedestrian only area with luggage."}, {"username": "Angela DeMario", "comment_text": "Positano is worse !!"}, {"username": "Janine Emma Lucas", "comment_text": "I did this: use google and use street views. Sorrento, positano, Amalfi are built on cliffs. Lots of hills"}, {"username": "Janine Emma Lucas", "comment_text": "We had a house rental booked UP in Sorrento. When I google map walked via satellite I realized we couldn’t stay up that far from the marina. We rebooked a hotel lower and closer to the main areas"}, {"username": "Gina Spyker Fairfield", "comment_text": "Most of Sorrento is not bad. I was comfortable walking there as a 50+ year old heart patient who was still recovering from catching Covid earlier in our trip. The climb down to the port to get a ferry would probably be the most strenuous walking, but I believe there’s an elevator too. Positano was tough for me."}, {"username": "Colin Lumbis", "comment_text": "Main Street is relatively flat. AND to get down to the port area for boat trips there’s a LIFT. What3words for lift…. ///\ntenuous.utopia.w\naxers"}, {"username": "Madeline Caporale", "comment_text": "You are sightseeing in Europe, you are going to be doing lots of walking wherever you go."}, {"username": "Inna Rozen", "comment_text": "Sorrento is actually flat compared to the Amalfi coast. Not sure where you’re hearing that from."}, {"username": "Dayna Steinberg Cioffi", "comment_text": "Sorrento is flat and more spread out. Positano and Amalfi are all stairs and narrow."}]}, {"id": "2200450677020677", "text": "Hi everyone!\nI am planning a trip to Italy for next June. We are wanting a more coastal trip than inland. We have been looking at the Almafi Coast! Any other places we should look at?\nThank you!", "link": "facebook.com/groups/1373361046396315/permalink/2200450677020677/", "likes": 1, "comments": [{"username": "Romina Lauretig Toscano", "comment_text": "Lecce"}, {"username": "Stefano Follador", "comment_text": "Definitely the Salento area in Puglia, next to Lecce.\nThe I am e big fan of Costa estrusca in Tuscany, south of Livorno, and Costa dei Trabocchi in the Adriatic Sea.\nCheck also Trieste area, really different, but deserve a visit.\nObviously there is also Liguria coast, cinque terre, and also the riviera romagnola, more holiday like area"}, {"username": "Pietro Di Sorbo", "comment_text": "Other what seggested Stefano Follador I would suggest to you the Sicily areas of Syracuse, Taormina Isolabella and Giardini Naxos, Cyclops Coast, Cefalù, Scala dei Turchi, Scopello, Mondello, San Vito Lo Capo, Marsala.\nAll the Sardinia coast (here the sea is stunning everywhere), Calabria coast, Tropea Capo Vaticano, the Gargano Area in Apulia and the Argentario area in Tuscany.\nConsider Italy has tens of little Islands with stunning beaches and crystal water(Elba, Giglio, La Maddalena, Ponza, Lipari, Pantelleria, Ustica, Lampedusa, Favignana, Salina are some of them)."}, {"username": "Chiara Pirrello", "comment_text": "Le cinque terre"}, {"username": "Vee Broughton", "comment_text": "Amalfi Coast is beyond stunning, but do keep in mind that thousands of other tourists are also visiting so bars/\nrestaurants will be full, beaches will be overcrowded and roads/buses/\ntrains will be unbearable. I’d advise April/May/\nSeptember over Summer months to have a genuinely enjoyable experience."}, {"username": "Starla Dawn", "comment_text": "I LOVED my stay at Hotel MEA at Lipari, Sicily. And other islands to go to from there too. But it was ocean view pool view the best food I had in Italy too. It wasn’t crowded either!! And my daughter and I stopped at Taormina on way back to Catania to fly to Florence."}]}, {"id": "2200466117019133", "text": "Hi. My family and I ( 12 people) are going to Italy for 21 days next July. Is it easy to rent a van with driver to stay with us during all the day? where can I find this service to hire? Thanks in advance", "link": "facebook.com/groups/1373361046396315/permalink/2200466117019133/", "likes": 2, "comments": [{"username": "Pietro Adami", "comment_text": "Google, “noleggio minibus con autista” + the city you are staying"}, {"username": "Brad Nelsen", "comment_text": "Possibly 2 x 6; not sure I’ve seen a van with 12."}, {"username": "S Christian Everett", "comment_text": "Mydaytrip.com"}]}, {"id": "2200468417018903", "text": "Can anyone recommend a half day tour in Florence to visit wineries including lunch … I wanted to book Lucas & Lorenzo but unfortunately they are booked already .. any suggestions??? I’ll be there in October and I am traveling Solo .. I would want a small group experience … thanks", "link": "facebook.com/groups/1373361046396315/permalink/2200468417018903/", "likes": 2, "comments": [{"username": "Christine Marcum Good", "comment_text": "Same!"}]}, {"id": "2200474863684925", "text": "Thinking of visiting Rome and Naples in August. Is it true that most places (shops/restaurants) will be closed in August?", "link": "facebook.com/groups/1373361046396315/permalink/2200474863684925/", "likes": 0, "comments": [{"username": "Colleen Jennings", "comment_text": "Hi. Rome & Naples will very much be open in August. Some smaller shops close between 1-4pm each day but restaurants don’t close. Enjoy your trip!"}, {"username": "Cecilia Christine Costantini", "comment_text": "Not in the city center, except maybe some smaller shops."}, {"username": "Pam Gerretsen", "comment_text": "Some places might be closed, but not generally many so shouldn't affect your visit."}, {"username": "Lorissa Gill", "comment_text": "No"}]}, {"id": "2200479040351174", "text": "We will be staying in Varenna (Lake Como) for 3 nights end of September. Our AirBNB is about 2 miles from the train station. We do not plan to rent a car. Is it difficult to get taxis at the station? Does anyone have a contact for a driver to/from train station to our AirBNB? Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2200479040351174/", "likes": 2, "comments": [{"username": "Simone Pfenninger", "comment_text": "You need to ask at the Rest. / Tabeccheria to call one for you. Usually there are no taxis available at arrival 🙂 It's a pain in the neck"}, {"username": "Sherill Hacker", "comment_text": "I took a picture of this at the tourist office in Varenna last month."}, {"username": "Victoria Laverty", "comment_text": "No taxis at station"}, {"username": "Lyn Evans", "comment_text": "I had saved the details of Lorenza Taxi for when we are there and need a taxi .. she gets good reviews by looks of it."}]}, {"id": "2200493163683095", "text": "Visit to the Vatican- we would like to do the Vatican museums on august 27th but it looks like on their website there is no general admission that day but it’s a free last Sunday of the month. How early should I get in line to get tickets that morning?", "link": "facebook.com/groups/1373361046396315/permalink/2200493163683095/", "likes": 0, "comments": [{"username": "Paul Anderson", "comment_text": "Early is always a long line after lunch no lines."}, {"username": "Ania Kubica", "comment_text": "I was told by our Airbnb owner to go to Vatican in the afternoon."}, {"username": "Christy Powers", "comment_text": "I was scared they would run out of tickets by afternoon"}]}, {"id": "2200503647015380", "text": "What’s the best way to get from the Milan airport to my hotel in Meta?\n\nThank you so much!", "link": "facebook.com/groups/1373361046396315/permalink/2200503647015380/", "likes": 0, "comments": [{"username": "Benedetta Vanni", "comment_text": "Milano has 2 airports: Malpensa and Linate. Which one? And: your destination is... Meta? Maybe... Meda?"}, {"username": "Giovanni Pianigiani", "comment_text": "It depends on where is your goal (meta)"}]}, {"id": "2200504310348647", "text": "A nice adventure in Santa Margherita Ligure - Portofino and Cinque Terre", "link": "facebook.com/groups/1373361046396315/permalink/2200504310348647/", "likes": 26, "comments": [{"username": "Simone Pfenninger", "comment_text": "Loved Santa Margherita Ligure a lot more than Portofino"}, {"username": "Marjaana Häkli", "comment_text": "So did I. And Rapallo is also ❤️"}, {"username": "Denise Incandela Boccio", "comment_text": "I will be there next month! Can’t wait! 🇮🇹"}, {"username": "Lisa Calbreath Eissmann", "comment_text": "Was thinking of Santa Margherita as a base for visiting Cinque Terre and Portofino, etc. Would you suggest? Seems like it would be a bit more relaxed."}, {"username": "Marjaana Häkli", "comment_text": "Yes, S. Margherita works well as a base. For me CT was too crowded - of course very beautiful.\nIt is easy to go to Portofino, Rapallo, San Fruttuoso, CT, Genova …. and Milan from S. Margherita. Good train connections. I was travelling alone and did not want to drive."}, {"username": "Annette Giovia", "comment_text": "I was in Santa Margherita Ligure in 2017. Was there for two glorious weeks. There isn't a day that goes by that I don't wish I was there again. Felt the healthiest, happiest, most contented EVER. Took the boat to Portofino several times. The train to Genoa, the bus to Rapallo. One of these days I'll go back. And I just might stay. FOREVER."}, {"username": "Annette Giovia", "comment_text": "Annette Giovia"}]}, {"id": "2200505517015193", "text": "Looking for suggestions for a photographer, hair and makeup in Tuscany! thanks in advance", "link": "facebook.com/groups/1373361046396315/permalink/2200505517015193/", "likes": 0, "comments": [{"username": "Usha Lalwani", "comment_text": "Reachout to Holidaygrapher for a photographer in Tuscany- not sure about Makeup."}, {"username": "Julia Donovan", "comment_text": "I recommend akopec_photogra\nphy on instagram"}, {"username": "Nancy Caruso Watts", "comment_text": "Florence Photographer"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2200483727017372", "text": "Explore the traditional Tuscan town of Lucca: this lovely city will transport you back in time! Join our virtual walking tour and get ready for a journey into beauty and history! Our local guide Patrizia willआणखी show you the highlights of this enchanting city. You will virtually stroll through the cobblestone streets, bustling piazzas and old Renaissance walls of Lucca and you will see the birthplace of local composer Giacomo Puccini.\nJoin our virtual experience: https://nextstop-italy.com/virtual-tours/lucca-walled-city/\n\n#medievalart #italytravel #italyiloveyou #virtualworld #italytrip #vacationmood #italygram #tuscany #renaissanceart #renaissancetour #tuscanylovers #tuscanytrail #VirtualTour #art #lucca #luccacity #luccaitaly #bikelovers #history #historylovers", "link": "facebook.com/groups/1373361046396315/permalink/2200483727017372/", "likes": 8, "comments": []}, {"id": "2198225397243205", "text": "Hi Need urgent help to decide which tour of colosseum to book. Its my first time visiting, with son, tossing between Self guided Audio vs guided tour of Colosseum RF and PH. There is an option of booking with an Archeologist too. Thanking you in anticipation 🙏🏼🌸", "link": "facebook.com/groups/1373361046396315/permalink/2198225397243205/", "likes": 1, "comments": [{"username": "Jeff McLellan", "comment_text": "Guided tour is the way to go."}, {"username": "Daisy Yoo", "comment_text": "No need for guided tour, u can also download the free offline Rick Steve audio and also watch some documentary at home"}, {"username": "Ania Kubica", "comment_text": "We do Rick Steves whenever available and have been really happy. No time obligation and it’s free ."}]}, {"id": "2200200810378997", "text": "Our hotel in Venice was spectacular. This was the view from our balcony. Everything about this hotel was 4 star and the location was great. Quiet artistic neighborhood but so close to everything. Hotel American Dinesen", "link": "facebook.com/groups/1373361046396315/permalink/2200200810378997/", "likes": 308, "comments": [{"username": "Margo Desjardins", "comment_text": "Could you send me the name of this hotel"}, {"username": "Lynn Clemens", "comment_text": "Name of Hotel?"}, {"username": "Gloria Holleran", "comment_text": "Where is this in Italy what town"}, {"username": "Gloria Holleran", "comment_text": "Venice"}, {"username": "Patty Cummings", "comment_text": "Ooo great! Staying there in September!!!"}, {"username": "Anita DiLorenzo Hall", "comment_text": "I stayed there while in Venice as well. Loved it. Especially loved the option of being able to arrive in a water taxi luggage and all. 💕"}, {"username": "Beth Iverson Brown", "comment_text": "We will be there in 1 month!!!"}, {"username": "Janet Gallinetti Lank", "comment_text": "Good to hear as I have reservations there."}, {"username": "Lena Conccicao", "comment_text": "Wow! Gorgeous!"}, {"username": "Gavino Reloj", "comment_text": "Website (English) via Google\n\nhttps://\nwww.hotelamerica\nn.it/en/"}, {"username": "Lynn Clemens", "comment_text": "Hotel American"}, {"username": "Mary Miragliotta Scilla", "comment_text": "We also stayed there when we went to Venice 🇮🇹♥️ Great location and wonderful staff."}, {"username": "Jo Courage", "comment_text": "Good to know, thank you for sharing…. How did it compare price wise?"}, {"username": "Jonalee Wilson Stephens", "comment_text": "Thx for the tip!!"}, {"username": "Anne Marie Wiesman", "comment_text": "We stayed there in Venice as well 🇮🇹"}, {"username": "Natalie Cook", "comment_text": "Looks nice but not $1000 a night"}, {"username": "Shelley Boxsell", "comment_text": "Jenny Myers"}, {"username": "Janis Parker", "comment_text": "Stayed there a few years ago. It was nice and the area quiet."}, {"username": "Dori Richardson Burton", "comment_text": "Nancy Juckem"}, {"username": "Irene Oda", "comment_text": "Thank you for posting. So glad you enjoyed your stay!!"}, {"username": "Cindy Giuliani Buda", "comment_text": "Hotel Kette I’d where we are staying."}, {"username": "Kristin Provost", "comment_text": "Kelly Streeter"}, {"username": "Maureen Moyson Wright", "comment_text": "￼ We just left Venice ￼yesterday and stayed at that hotel. Absolutely amazing wonderful rooms and stuff and ice AC was ice cold make sure you leave the hotel and go out to the right and hit up the corner pub a great place to have a cocktail at night before dinner."}, {"username": "Jocelyn Quiza Morrison", "comment_text": "How far is this hotel from the train station ?"}]}, {"id": "2200393743693037", "text": "Hello!! My husband and I are wanting to do a sweet little photography session while we are in Italy to commemorate our honeymoon!\n\nDoes anyone have any recommendations for photographers who would do a short session in any of the following locations:\n\n-Amalfi coast (Amalfi, Positano, Ravello)\n-Puglia (Ostuni, Alberobello, Bari)\n-Sicily (Catania, Palermo, Taormina)\n\nThank you in advance!", "link": "facebook.com/groups/1373361046396315/permalink/2200393743693037/", "likes": 3, "comments": [{"username": "Jeff McLellan", "comment_text": "We have used Angle to find photographers for shoots during our trips and been very happy.\n\nhttps://\nangleplatform.co\nm/amalfi-coast/\nphotographers"}, {"username": "Pegi Christina", "comment_text": "I’ll be in Rome aug 6-13 🙂"}]}, {"id": "2200405177025227", "text": "I am flying into Florence with my two kids, young adult and teen, in August. I have a car reserved. My daughter said there’s a train from Florence to Forte dei Marmi. We are there for 3 days to hang out on the beach mostly. We want to go to Cinque Terre. Should we use trains to get around instead of renting a car? Will we be able to get around Forte dei Marmi, markets, restaurants, etc, on foot or bicycle? Is Uber available if needed? Thank you!!", "link": "facebook.com/groups/1373361046396315/permalink/2200405177025227/", "likes": 4, "comments": [{"username": "Steph Craddock", "comment_text": "Hire a car, the station is a long way out from Forte dei Marmi. But ti go to Cinque Terre take the train. Drive to statio at Forte then catch train from there."}, {"username": "Colleen Jennings", "comment_text": "Market at Forte dei Marmi on Weds & Sundays. We hire bikes to get around when we’re there. Flat cycle path runs alongside the road & many people cycle. There’s also a bus that goes from town to town along the coast. We’ll be there in September!"}, {"username": "Veronica Parravicini", "comment_text": "Hi, unfortunately Forte dei Marmi doesn’t have a train station so you’ll need to stop at Viareggio and then grab a taxi😅 (no Uber in Italy)\nIn Forte you can walk around by foot.\nCinque Terre (meaning “five lands”: Monterosso, Vernazza, Manarola, Corniglia and Rionaggiore) have trains stations and the best way to get around are foot and train/boat"}, {"username": "Sande Ricci", "comment_text": "Take trains."}, {"username": "Brenno Bianchi", "comment_text": "Forte dei Marmi is very small and compact. Usually everybody there move by bike. In less then 20 minutes you can go from a side to the other of the town borders. All the all neighboring towns are reachable by bike with bike lanes. Moving by car is not very easy after the evening because lots of roads become close to the motorized traffic. Those with accommodation in Forte dei Marmi go by bike even to Michelin-star restaurants and leave the lamborghini in the garage.\nThere are some taxi in town but are a handful, not easy to call and book."}, {"username": "Benedetta Vanni", "comment_text": "If you search for images of the Cinque Terre on Google, you can easily guess that roads are narrow and there are no parking lots, so make yourself a favour and ride trains (use Trenitalia app for booking). Forte dei Marmi instead is a very cyclable town, flat and wide, but the station is far from the center (name of station: Forte dei Marmi - Seravezza - Querceta) so you will need some sort of pick up service to reach your accomodation."}]}, {"id": "2200393287026416", "text": "Good afternoon .... advice needed please. My friend has booked a trip and is staying at the hotel Cristina . She hasn't booked transfers from the airport and a taxi quoted her €355 . Is there an app like bolt or user than she can use to get her from the airport (bgy) to the hotel ??? any recommendations would be greatly appreciated ....thank you 😉", "link": "facebook.com/groups/1373361046396315/permalink/2200393287026416/", "likes": 7, "comments": [{"username": "Rossana Rotini", "comment_text": "Where Is the hotel??"}, {"username": "AnaMaria Uceda", "comment_text": "BGY=Bergamo"}, {"username": "Annette Tamminga", "comment_text": "What city is the hotel in and which airport is she flying out of?"}, {"username": "Ivette Lugo", "comment_text": "trains and ferry are the way to go"}, {"username": "Paul Vincent", "comment_text": "https://\nwww.welcomepicku\nps.com/milan/\nbergamo-airport-\ntransfer-to-cit\ny/\n#:~:text=How%20m\nuch%20is%20a%20\ntaxi,night%20dr\niving%20may%20b\ne%20applied."}, {"username": "Carol Johnson", "comment_text": "Try … Free Now app .. it lik￼e Uber but for Europe I use it when I was in Europe in May"}, {"username": "Kim Aranha", "comment_text": "locations please"}, {"username": "Karen Blackmore", "comment_text": "Bergamo has a great bus to central Milan. Also the bus 1A goes to the station where there are great train links to wherever the hotel is. Rome2rio is a good app, as is Google maps for options"}, {"username": "Hannah Huntington", "comment_text": "Thank you so much!🤗 that's all the info I got from her before I left work but will get where she's landing to where she is going and hopefully we can sort her out xx"}, {"username": "Hannah Huntington", "comment_text": "Right she is flying from bergamo orio el serio and going to Hotel Cristina via tamas 25010 ??? That's all the info she has x"}, {"username": "Pietro Adami", "comment_text": "Pietro Adami"}, {"username": "Ulla Helander", "comment_text": "It seems she's going to Limone Sul Garda. It's a 1,5 h drive. I would also check public transit, but not sure what transportation is available at Lake Garda."}, {"username": "Pietro Adami", "comment_text": "From Bergamo airport to Limone sul Garda it’s about 120 km, more than 1 hour and a half."}, {"username": "Laura Uribe", "comment_text": "The train goes through Bergamo. Cab to Bergamo train station and train to Lake Garda. Hotel is at top of lake. Maybe catch ferry to hotel? Honestly if this is her first trip, that’s a lot of moving parts."}, {"username": "Frank Hunt", "comment_text": "No details again. 🤷‍♂️ However I believe the answer is 42.😎"}, {"username": "Robin Burrell", "comment_text": "Take a train to Desenzano and a bus from there to Limone. The app Rome to Rio will do this for her. 58 minute train ride, can’t remember how long bus from Desenzano is. She could also just take a bus from Bergamo to Brescia, then another bus to Limone. I think it’s going to be about a 4.5 hr trip"}, {"username": "Mike Drelicharz", "comment_text": "That seems high. She should check with the hotel for transportation options."}, {"username": "Monica Roman-Fazio", "comment_text": "Call the hotel and ask them what's the best way to get to them."}, {"username": "Jud Luli", "comment_text": "Tienes bus miralo en google"}, {"username": "Bev Madill", "comment_text": "Try GoOpti shuttle service."}, {"username": "Jenny Larsen", "comment_text": "Train and then ferry"}, {"username": "Jenny Larsen", "comment_text": "Train to here. Then either ferry or bus. I threw away my ferry timetable but there were lots of ferries."}, {"username": "Jenny Larsen", "comment_text": "Jenny Larsen"}, {"username": "Jenny Larsen", "comment_text": "Desenzano del garda is the station closest to the lake. From there she should be able to get a ferry or a bus. We found it hard to get info before we arrived . The train station ticket office told us where to go as we had planned a different way based on either time to rio or maps . Anyway both of those sent us a longer way. We took her advice and it was much easier. You can also check the ferry times on their website I’ll see if I can find the link"}, {"username": "Jenny Larsen", "comment_text": "Looks like the ferry takes four hours so bud would be the best option"}, {"username": "Jenny Larsen", "comment_text": "Jenny Larsen"}, {"username": "Omar Chaaraoui", "comment_text": "App I use in Italy: \"Rome2Rio\" and \"Omio\" for public transportation.\n\"Freenow\", \"itTaxi\", and \"Uber\" for taxis."}, {"username": "Phyllis Snyder", "comment_text": "Can the hotel assist her?"}, {"username": "Tina Banset", "comment_text": "Try the Rome2Rio app it give’s several options"}, {"username": "Hannah Huntington", "comment_text": "Thanks everyone ☺️"}, {"username": "Carole Tarlap", "comment_text": "Is the hotel in Sorrento? And she is coming from Milan? TRAIN"}, {"username": "Vero N Ferny", "comment_text": "If flying into FCO you can get the train to almost anywhere and its super easy... She can also download Uber and select a taxi or Uber whichever she prefers... i found the trains to be the easiest way though."}, {"username": "Chris Vilsack", "comment_text": "Where is the hotel?"}, {"username": "Judith Corcoran Konicki", "comment_text": "In Italy, I used both the FREENOW and Uber apps successfully."}, {"username": "Frankie Rizzo", "comment_text": "Landing where\nHotel is where"}, {"username": "Rhona OConnor", "comment_text": "Public transport is very good in Italy. Use Google maps and you will find a route."}]}, {"id": "2200413310357747", "text": "Hello 👋🏻\nMe and my husband are traveling to Italy for our honeymoon this Friday.\nWe booked accommodation in Arezzo, Pistoia and Bologna and will be there for 13 days.\nAny recommendations of what to see/do in the area?\nWe would love to do cooking class too!!\nIt will be our first Italy trip so I will really appreciate any help. Thanks! 😊🥰", "link": "facebook.com/groups/1373361046396315/permalink/2200413310357747/", "likes": 2, "comments": [{"username": "Scott Perry", "comment_text": "Guero on via Goito for cocktails in Bologna. 😄"}, {"username": "JeriLynne Clifford", "comment_text": "We loved Trattoria Da Me and Ahime in Bologna. We also did the little train up to the Sanctuary. We spent a lot of time in Modena. We did a private cooking class there that was an incredible experience. Also hired a private car to take us to a winery, Parmesan cheese factory, salumeri museum and unbelievable balsamic vinegar agristismo."}, {"username": "Pietro Adami", "comment_text": "I would search for the cooking lesson (pasta and tortellini … love it) in Bologna"}, {"username": "Alice Francesca", "comment_text": "Arezzo is ok for one or two days, same Pistoia.I am Italian and the most beautiful part of Tuscany is Siena and south of it, the Val d'Orcia region.Once you are there, you will never want to leave"}, {"username": "Huong Worley", "comment_text": "Two restaurants highly recommended by our local friend. Make reservation or show up right when they open. Best meal we had was at Osteria Al 15, very reasonable prices for high quality foods. Check out San Marino for a day trip, beautiful third smallest country in the world.\n\nTrattoria dal Biassanot\n\nVia Piella, 16, 40126 Bologna BO, Italia\n+39 051 230644\n\nOsteria Al 15\nVia Mirasole, 13, 40124 Bologna BO, Italia\n+39 051 331806"}, {"username": "Benedetta Vanni", "comment_text": "Arezzo is known for antique markets/expos and jewellery craftsmanship. From Pistoia you can go to Grotta Giusti which is a lovely spa with a thermal spring. In Pistoia, book for lunch at \"La Bottegaia\"."}, {"username": "Laura Piccinini", "comment_text": "Go to Modena when you Will be in Bologna ! UNESCO site and local vibes!"}]}, {"id": "2200415777024167", "text": "What is better Italy in June or September go for a month? Planning for 2024\n2 weeks in Tuscany, 2 weeks in Almafi Coast maybe a week in Sicily? Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2200415777024167/", "likes": 1, "comments": [{"username": "Connie Wilson", "comment_text": "Both months are better that July and August. I would tend more towards September."}, {"username": "Kristina Ruk", "comment_text": "June it can be real summer, September it is csn be warm or getting colder..depends\nif the year..So what you prefer..I would go June as not against heat as live in North Europe🤣"}, {"username": "Jill Greenberg Minton", "comment_text": "For Tuscany I would say September. We were just there in July and was really hot. I imagine it would still be in June. We did a great e-bike rental and the owner said September/\nOctober is his favorite month in Tuscany. He was born and raised there. I guess depends on your weather preference."}, {"username": "Brad Nelsen", "comment_text": "September"}, {"username": "Renae Larcus", "comment_text": "September! Cooler and less crowded."}, {"username": "Glenn Todd Webb", "comment_text": "Easy. September. Less crowds and heat."}, {"username": "Chris Vilsack", "comment_text": "Climate change is real. Look at this year's temps and you decide. Middle of sept for a month should be great. Plus all students will be back in school and parents back at work. And the sea will still be warm"}, {"username": "Romina Lauretig Toscano", "comment_text": "September"}, {"username": "Janice Rea", "comment_text": "I would go in September"}, {"username": "Cherol Hegge", "comment_text": "September"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "September"}, {"username": "Carrie Duffy VanderMolen", "comment_text": "June (so less people will be there in September when we go)😁"}, {"username": "Sheri Dettman", "comment_text": "September"}, {"username": "Jane Lisa", "comment_text": "September unless you want to suffer in the heat and crowds."}, {"username": "Patti Porter", "comment_text": "I personally wouldn’t go any summer month"}, {"username": "Rebecca Knox Housley", "comment_text": "September, no question."}, {"username": "Virgz Van Møøre", "comment_text": "I have experienced more rainy days in June than in September"}, {"username": "Lee D'Angelis", "comment_text": "September"}, {"username": "JoAnn Byrd", "comment_text": "We are going September into October because the weather won’t be too hot. I can not stand the heat and walking around. Can’t wait for it."}, {"username": "Amanda Richards", "comment_text": "September - too hot & busy in June"}, {"username": "Paul Davis", "comment_text": "Glo Pritt Lorenzi: one thing to be aware of is that the Tuscan countryside that is lush in June, is toast in September (see photo)."}, {"username": "Sandra Mueller-Hofner", "comment_text": "September"}, {"username": "Rhonda Smith", "comment_text": "September"}]}, {"id": "2200423213690090", "text": "We are Going to Rome, Naples & Sicily at the end of September. 5 days in each location. ￼\nGive me one favorite thing to do in each location please 😎", "link": "facebook.com/groups/1373361046396315/permalink/2200423213690090/", "likes": 3, "comments": [{"username": "Nariman Dergam", "comment_text": "Interested"}, {"username": "Chiara Pirrello", "comment_text": "In Sicily: Taormina and Cefalù"}, {"username": "Janine Emma Lucas", "comment_text": "Where in Sicily? It’s a huge island. We’re doing 3 days in Catania, 2 in Ortigia, 5 in palermo."}, {"username": "Carolina Alejandro Clabaugh", "comment_text": "In Naples-go to Capri it’s beautiful"}, {"username": "Valentina Saltarelli", "comment_text": "Rome, I live here, out of the beaten track..\n\nMuseo Centrale Montemartini ,\nPalazzo Massimo alle terme , Street art Tor Marancia, Holy stair and Sancta Sanctorum,\nArea Sacra Largo Argentina\nMausoleo di Augusto\n\nGelato da Fassi zona Esquilino\nStreet food Trapizzino a Testaccio"}, {"username": "Lisa Adams Robertson", "comment_text": "Sicily: Mt. Etna, Taoromina, Valley of the Temples, Church in Monreale.\n\nNaples: Archeological Museum, Sansevero Chapel, day trips to Caserta (amazing Royal Palace), and Herculaneum/\nPompeii. Needed more time in Naples.\n\nRome: it's all amazing! Borghese Galleria, St Peter's, Vatican, Colosseum, and ebike tour of Appian Way, Catacombs and Aquaducts."}, {"username": "Tess Galinato Perez", "comment_text": "Rome - sightseeing\nNaples and Sicily - Eat. Especially Sicily, specifically Palermo. 😆"}]}, {"id": "2200421893690222", "text": "Does anyone know if it's possible to do a day trip to Pompeii from Rome independently by public transportation? All the tours from Rome only give two hours in Pompeii and I'd like more time.", "link": "facebook.com/groups/1373361046396315/permalink/2200421893690222/", "likes": 1, "comments": [{"username": "Madeline Caporale", "comment_text": "Consider doing a search on this page. I believe this was covered in the last few days, and if I recall someone responded with train suggestions from Rome to Pompeii."}, {"username": "La Paito", "comment_text": "https://\nwww.governo.it/\nen/articolo/\nlaunch-rome-pomp\nei-frecciarossa\n-rail-link/\n23163"}, {"username": "Paul Handley", "comment_text": "Train"}, {"username": "April Dykes", "comment_text": "I am doing a day out in Pompeii from Rome in September and I think we are doing trains there and back so it gives us the extra time for walking around the site 🙂"}, {"username": "Ania Kubica", "comment_text": "Take high speed train from Termini to Napoli. Then regional train to Pompei Scavi. We toured with free Rick Steves audio. Everything is well explained in his guide."}, {"username": "Miyuki Kanno Paul", "comment_text": "It’s going to be a very long day, and you cannot screw up. Being said, yes, it’s doable."}, {"username": "Nydia Bryan", "comment_text": "Copied this from an article\n\nThere are currently no direct rail routes linking the two popular tourism destinations—tr\navelers need to first take a train from Rome to Naples, just over an hour away, and then navigate the crowds at the Napoli Centrale train station to transfer to a regional train called the Circumvesuviana\n, bound for Pompeii. That train from Naples to Pompeii is known for being old and slow, with stops in several small towns along the way. The whole journey takes roughly two hours."}, {"username": "Corina Cristea", "comment_text": "https://\nwww.euronews.com\n/travel/2023/\n04/05/\nvisiting-pompeii\n-will-be-easier\n-thanks-to-a-ne\nw-high-speed-tr\nain-line-from-r\nome"}]}, {"id": "2200423790356699", "text": "Anyone tried pistachio liquor omg it's my fave 😍 green drink on left", "link": "facebook.com/groups/1373361046396315/permalink/2200423790356699/", "likes": 56, "comments": [{"username": "Yostina Narouz", "comment_text": "Where can I get it?"}, {"username": "Rubin Urban", "comment_text": "Sounds amazing! Find out the recipe if you can and post it please"}, {"username": "Kirsty Scammell", "comment_text": "I’ve tried it and oh my!!! It’s delicious, they were selling it in a little delicatessen in Rome 😍"}, {"username": "Bernice Lund", "comment_text": "Bought some in Sorento can’t wait to try it 😁"}, {"username": "Cindy Vennare", "comment_text": "Yes! We tried that and meloncello in Siena. Amazing. Let’s not forget to mention Italian Gin!"}, {"username": "Frances McDonagh", "comment_text": "I can't get it in Ireland 😭😭😭"}, {"username": "Bianka Angileri La Mude", "comment_text": "It’s delish!!!"}, {"username": "Roberta Andrechick Niedt", "comment_text": "Love it! Brought some home with us 😊"}, {"username": "Liane Buttino", "comment_text": "Oh yes the best ❤️"}, {"username": "Frances McDonagh", "comment_text": "I was bringing carry on was lucky to find a 100ml I had a layover and luckily didn't buy a big bottle if they had taken it at security I'd have murdered them 😆"}, {"username": "Chante Lugo-Wrecke", "comment_text": "Brought some back from Positano, it’s outstanding!"}, {"username": "Theresa Wong", "comment_text": "I've tried it on vacation. Omg. Love it too"}, {"username": "Carol Johnson", "comment_text": "Yes I had it everyday at Novella Octeria Toscana in Florence .. what about the Cantaloupe Liquor , I had that at Bosco De’Medici Winery in Pompei . I bought two bottles home"}, {"username": "Terry Checketts", "comment_text": "At the Market in Campo d flori bought Pistachio lemoncello was great."}, {"username": "Angela Marsala-Gaydos", "comment_text": "Brought it home - delish"}, {"username": "Gay Robertson", "comment_text": "Cheryl Debenham"}, {"username": "Jennifer Gustafson", "comment_text": "Soooo good!"}, {"username": "Voula Ladas", "comment_text": "Yes it’s very nice . Went to Limoncello factory on way to Positano . Tried all the varieties ,but for me my favourite is still the original Limoncello ."}, {"username": "Jennifer Rockefeller", "comment_text": "I bought some in Capri. So good!!!"}, {"username": "Krissy DaRusso", "comment_text": "OMG! They sent us some to the table! It sounds disgusting but it’s so good! Anyone know a place you can have some sent home (USA)?!?!"}, {"username": "Pete Wilson", "comment_text": "There are varying recipes online, none of which I've tried, but reading a few they all appear to have pistachio cream in them. This recipe is one I have seen and gives a direct link to a recipe of how to make your own pistachio cream to incorporate. I hope it may help. https://\nanitalianinmykit\nchen.com/\nhomemade-creamy-\npistachio-lique\nur/ . This is the direct link to the pistachio cream required https://\nanitalianinmykit\nchen.com/\npistachio-cream/\n#recipe"}, {"username": "Lisa Abrams Argento", "comment_text": "It was really good."}]}, {"id": "2200427370356341", "text": "Florence Airport - does anyone know where is the UBER passenger pick up spot? 🙂 (and yes, there's UBER service in Florence)", "link": "facebook.com/groups/1373361046396315/permalink/2200427370356341/", "likes": 0, "comments": [{"username": "Benedetta Vanni", "comment_text": "The airport in Firenze is so small. I guess you will just have to get outside and take a look around. I would suggest to look for \"taxi\" or \"NCC\" signs. NCC stands for Noleggio Con Conducente which is Rent With Driver."}]}, {"id": "2200428907022854", "text": "Hello all, any Pompei tour departing from Salerno or vietri sul mare? Hotel charges 160 euro per person for 5h, but wanted to evaluate other option.", "link": "facebook.com/groups/1373361046396315/permalink/2200428907022854/", "likes": 0, "comments": []}, {"id": "2200429463689465", "text": "Thank you for accepting me into your group. I am planning an Italy trip next year. I am thinking October 2024. My noni was born in Lucca and that is one of my main destinations. I plan to spend at least two weeks. I want to see Venice, Florence, Rome, Siena, Pisa, and whatever you can all recommend. I would like to find a tour that I can do this trip with. Does anyone have any suggestions of a good reasonably priced tour?\nThank you.", "link": "facebook.com/groups/1373361046396315/permalink/2200429463689465/", "likes": 0, "comments": [{"username": "Angela Marsala-Gaydos", "comment_text": "Look up Firebird Tours - they will customize a tour"}, {"username": "Robin Burrell", "comment_text": "Lucca was wonderful"}, {"username": "Lynn Luken", "comment_text": "Spend a few days in Lucca, our favorite Hotel Ilaria or Airbnb"}, {"username": "Anita Clayton", "comment_text": "We stayed for a week in Lucca in a fantastic Airbnb and then moved onto Florence, Milan and Genoa. Train travel is so easy in Italy."}]}, {"id": "2200430593689352", "text": "Has anyone taken the train from Naples to Portofino or Santa Margherita Ligure? Or do you recommend a different mode? Looking to spend some time in that area so any suggestions of things to see/do would be appreciated. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2200430593689352/", "likes": 0, "comments": [{"username": "Simone Pfenninger", "comment_text": "Santa Margherita di Ligure is beautiful. I took the train from La Spezia"}, {"username": "Alice Francesca", "comment_text": "Train is still the best option."}, {"username": "Benedetta Vanni", "comment_text": "Train.\n1. Napoli - Firenze (frecciarossa or italo trains)\nFirenze - Pisa (regional train)\nPisa - Santa Margherita (intercity train)\n2. Napoli - Roma (frecciarossa or italo trains)\nRoma - Santa Margherita (intercity train)"}]}, {"id": "2185211038544641", "text": "Incredible experience in a cave! Matera 😍\nThe idea of staying in minimalist stone cave rooms with antique furnishings lit only by candlelight is certainly not for everyone, but somehow Sextantio makes it… आणखी luxurious, comfortable, and relaxing 🥰 pure magic! The combination of cave living from a time past combined with a 5-star hotel experience make this place absolutely worth a stay!\nDiscover more: https://www.anrdoezrs.net/click-100692842-12291623?url=https%3A%2F%2Fwww.tripadvisor.it%2FHotel_Review-g187772-d1234089-Reviews-or10-Sextantio_Le_Grotte_della_Civita-Matera_Province_of_Matera_Basilicata.html%23REVIEWS", "link": "facebook.com/groups/1373361046396315/permalink/2185211038544641/", "likes": 21, "comments": []}, {"id": "2199804043752007", "text": "Hi all, I purchased this beautiful painting from an artist in Rome. He said it was of Sorrento. Does anyone know where this spot is, if it exists? I understand if may not look exactly the same in real life but have seen a similiar spot depicted by another artist.", "link": "facebook.com/groups/1373361046396315/permalink/2199804043752007/", "likes": 0, "comments": [{"username": "Nick Peacock", "comment_text": "It is near Pompeii, on the way there, just before it. Also it is past Naples. Sorento is set on a very high cliff. Very pretty. I saw it in December which was cold and rainy but still nice. There were many high sharp curbes on a Cliffside to get to it, almost threw up, we were all ready to do so but my young daughter did throw up. Otherwise very nice. Pompeii was very nice too."}]}, {"id": "2199972543735157", "text": "Has anyone stayed at the BEST WESTERN PLUS HOTEL UNIVERSO near Tetmini in Rome?", "link": "facebook.com/groups/1373361046396315/permalink/2199972543735157/", "likes": 1, "comments": [{"username": "Tammy Lynn Schmitt", "comment_text": "I’m about to in October. When we went to Paris, we made a very regrettable hotel decision, after one night there we turned tail and went to the best Western. It had a king size bed, which is helpful when you have a husband that is 6 foot five. The best Western in Rome also has king size beds and they seem to have very standardized accommodations.\nIf I were going to be in the hotel for much more than sleeping and showering, I might want something nicer. But the best Western is great when you’re really just looking for a clean hotel with a comfortable bed."}, {"username": "Antonella Piccolo", "comment_text": "Yes its amazing!!"}]}, {"id": "2199979197067825", "text": "Private tour in a car around Rome suggestions?", "link": "facebook.com/groups/1373361046396315/permalink/2199979197067825/", "likes": 0, "comments": [{"username": "Benedetta Vanni", "comment_text": "Car in Rome : you don't really wanna do that"}, {"username": "Marie Vitale Burke", "comment_text": "My nieces just came back I will ask them."}]}, {"id": "2200104910388587", "text": "Looking for Lake Como options- which city, transfer from Milan airport, tours, lodging, restaurants, etc.", "link": "facebook.com/groups/1373361046396315/permalink/2200104910388587/", "likes": 0, "comments": [{"username": "Yostina Narouz", "comment_text": "Following"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2199985010400577", "text": "I've heard the wait to eat here can be very long and want to queue for dinner next week. How long are people waiting for that who have went in Rome recently?", "link": "facebook.com/groups/1373361046396315/permalink/2199985010400577/", "likes": 11, "comments": [{"username": "Todd N Nicole Clarke", "comment_text": "Our hotel was right near it we went at about 7-7.30 and line started to form after we were seated, it’s pretty quick turn over, but the line was there consistently after that"}, {"username": "Leo Gomez", "comment_text": "I had the hotel make reservations for us. Fun experience, food was good."}, {"username": "Elena Innocenti", "comment_text": "In my opinion, it's not worth it."}, {"username": "Jess Armour", "comment_text": "Went at 6pm yesterday and there was no queue yet. Food was delicious and well worth the visit!"}, {"username": "Mélissa Cassidy", "comment_text": "Tonnarello est meilleur. Meilleur service, meilleur nourriture"}, {"username": "Beth Ann", "comment_text": "I went and it was the worst meal I had in Rome last November. Lots of better options IMO. This seems to be a huge tourist trap"}, {"username": "Romina Lauretig Toscano", "comment_text": "I live in Rome and have never queued for a meal. And never I will :)"}, {"username": "Giulia Rossi", "comment_text": "Go to Eggs instead!"}, {"username": "Pat Xavier", "comment_text": "its Rome, why would you ever wait for a meal at a tourist trap ha"}, {"username": "Fabian VO", "comment_text": "We went for lunch around 12 there was no line"}, {"username": "Joelle Thiessen", "comment_text": "We went early … I can’t remember exactly what time but maybe around 6 or 6:39 and only had to queue for a few mins ! We had the carbonara and really enjoyed it !"}, {"username": "Valentina Saltarelli", "comment_text": "I live in Rome and Da Fortuna often there is a long queue, the food is very good\nBut be careful this is our high season Rome\nIs packed ."}, {"username": "Carola Blödgen", "comment_text": "Who have gone"}, {"username": "Alice Francesca", "comment_text": "Any Italian restaurant thst has pther restaurants in cities abroad are to stay away from.\nTry MATRICIANELLA.\nTHAT is where the Romans go."}, {"username": "Emanuele Semproni", "comment_text": "You can find much better and no queue, this place is sooo crowded and overrated don’t even know why 🤷‍♂️"}, {"username": "Marcy Weiss", "comment_text": "Our hotel was right there — we ate there around 2 pm just to have it"}, {"username": "Mon E Guil", "comment_text": "I walked in with no wait"}, {"username": "Yanely Cruz", "comment_text": "I went this past Sunday and waited 30 min and was with a party of 7. Made the line outside …"}, {"username": "Alyssa Judd", "comment_text": "I waited 30 minutes in Milan and the food was so good! Definitely worth it!"}, {"username": "Alanis Wieckowski", "comment_text": "Thanh Nguyen"}, {"username": "Irene Mikalef", "comment_text": "We waited about 90 minutes for a table at the Rome location. Worth the wait."}, {"username": "Elissa Cara", "comment_text": "Wait is like 10-15 mins. Totally worth it"}, {"username": "Alaa BahnAsy", "comment_text": "45 mins"}, {"username": "Aimee Sen-Gupta", "comment_text": "I went to the Rome location, wasn’t worth the wait at all! Was the worst meal we had in Rome, sooo many better places, genuinely any restaurant without pictures outside is better than here."}, {"username": "Mary Kate Montgomery", "comment_text": "30 mins and not worth the wait"}, {"username": "Claudia Fericelli", "comment_text": "We went twice and waiting around 15mins each time - totally worth it for the carbonara"}, {"username": "Zara Haskett", "comment_text": "We went Monday night and just walked in. It was good!"}]}, {"id": "2200077797057965", "text": "Anyone in Sicily right now? How are the fires? We are supposed to arrive Monday feeling nervous now", "link": "facebook.com/groups/1373361046396315/permalink/2200077797057965/", "likes": 1, "comments": [{"username": "Cristina Galea Tonna", "comment_text": "did you get any news regarding sicily right now please?"}]}, {"id": "2200115267054218", "text": "Looking for help with Venice please?\nIf I book the museum pass for Doge's Palace on the offical site (with no guided tour) does that mean it's a skip the line ticket? Or do I need to also book a time slot orआणखी tour to skip the line? A little confused.... I see other websites are selling skip the line/priority bookings, but they cost a little more as they are a third party, buut worth it if it will be quicker....\nhttps://palazzoducale.visitmuve.it/en/pianifica-la-tua-visita/bookings/\nor:\nhttps://book.doge-palace-tickets.com/book/8586/checkout/?couponCode=HEADOUT5&date=2023-08-31&pax.adult=2&pax.child=2&pax.senior=0&time=10%3A00%3A00&tourId=33811&variantId=33843", "link": "facebook.com/groups/1373361046396315/permalink/2200115267054218/", "likes": 0, "comments": []}, {"id": "2200367370362341", "text": "Can anyone recommend good hotels in Milan?\n\nI am a little worried about hotel room theft\nthank you~~", "link": "facebook.com/groups/1373361046396315/permalink/2200367370362341/", "likes": 0, "comments": [{"username": "Nariman Dergam", "comment_text": "Interested"}, {"username": "Ona Gardemeister", "comment_text": "I’ve been in over ten hotels in Milano during the years and never, ever have I been worried that somebody would steal something from my hotel room. Maybe I’ve been lucky, but been to Italy and literally all over at least 6 times a year and never had a theft in hotel or b&b or an apartment. Love the country"}, {"username": "Anita Clayton", "comment_text": "IQ Milano."}, {"username": "Lisa Martinson", "comment_text": "Roommate hotel guilia"}, {"username": "Benedetta Vanni", "comment_text": "4 star hotels provide for a safe in every room. Personally i have never been robbed in a hotel in my country."}, {"username": "Glenn Todd Webb", "comment_text": "Rosa Grand behind Duomo"}]}, {"id": "2200370270362051", "text": "For anyone traveling in 2024…you now will need a visa!", "link": "facebook.com/groups/1373361046396315/permalink/2200370270362051/", "likes": 1, "comments": []}, {"id": "2200370420362036", "text": "Anyone there now, how is the fire situation on the smoke?", "link": "facebook.com/groups/1373361046396315/permalink/2200370420362036/", "likes": 2, "comments": [{"username": "Ryan Coleman", "comment_text": "It's hazy for sure! Only city I didn't find hazy was Venice. Rome, Naples, Florence, Capri and the Amalfi Coast are hazy."}]}, {"id": "2200373607028384", "text": "First of all thank you everyone for sharing so much information about Italy. We are taking a trip in September and was curious about how much euro we should take with us. We are traveling from the US and will be there for 11 to 12 days. I want to take some euros for restroom, souvenirs, etc..\nThank you in advance for your input . ￼", "link": "facebook.com/groups/1373361046396315/permalink/2200373607028384/", "likes": 3, "comments": [{"username": "Rhona OConnor", "comment_text": "About €300 would be enough... You can get more from a ATM if you need it. Use restaurant or cafe loos just buy a coffee or something 😁"}, {"username": "Nariman Dergam", "comment_text": "Interested"}, {"username": "Janell McClung", "comment_text": "Are restrooms pay? 👀"}]}, {"id": "2200375953694816", "text": "Hi!\nI'm looking to book a Beach Club for a day in Positano. I'm looking at these 4 but open to others... anyone ever do this? Thanks!\nDa Adolfo Beach Club: Located on Laurito Beach, Da Adolfo is a rustic beach club that offers fresh seafood and excellent service. It's only accessible by boat, which adds to its charm.\nArienzo Beach Club: Arienzo is a… आणखी stylish beach club located on a secluded beach just outside Positano. It's the perfect place to relax and enjoy the stunning views of the Amalfi Coast.\nOne Fire Beach Club: One Fire is a trendy beach club located in Praiano, just a short drive from Positano. You’ll find a fun atmosphere, great music, and a wide range of activities, including paddleboarding and kayaking.\nMarameo Beach Club: For 50 euros a person you can have the entire VIP section with a private hot tub and shower and fantastic views and service!", "link": "facebook.com/groups/1373361046396315/permalink/2200375953694816/", "likes": 0, "comments": []}, {"id": "2200377040361374", "text": "Will be visiting Italy for the first time; my family is from Sicily. While in Sicily I’d like to get a tattoo to mark the occasion. Looking for recommendations for a good tattoo artist in Sicily.", "link": "facebook.com/groups/1373361046396315/permalink/2200377040361374/", "likes": 0, "comments": []}, {"id": "2200379293694482", "text": "Hi everyone - has anyone used a very reliable car service from Rome airport to another city (like an hour or two) away when traveling with a baby for transfer? Would need them to have a car seat 😀 having trouble finding a car service that isn’t limited to a Rome hotel or Rome in general. I know the train is an option but a very long day for traveling with a baby would prefer a car transfer.", "link": "facebook.com/groups/1373361046396315/permalink/2200379293694482/", "likes": 3, "comments": [{"username": "Heather Hills Jacobs", "comment_text": "Try Venice Group Services.. they helped us so much!! Lmk if you want his information."}, {"username": "Allison Carlisle Young", "comment_text": "Try limousinrome.co\nm we used them for our family. He responded to my questions super quickly. We had good experience with them. We didn’t have a baby…"}, {"username": "Dianne Radcliff", "comment_text": "GetTransfer.com"}]}, {"id": "2200382707027474", "text": "Hello everyone! Would anyone like to share their favorite “hidden” from tourists places/areas in Rome? Where it’s not to crowded and really worth visiting.\n\nAlso would really appreciate if you could recommend your favorite rooftop bars with nice view in Rome and in Florence. Thank you so much in advance!😍", "link": "facebook.com/groups/1373361046396315/permalink/2200382707027474/", "likes": 5, "comments": [{"username": "Stacy Oberman Malinow", "comment_text": "Westin rooftop bar in Florence was beautiful"}, {"username": "Nariman Dergam", "comment_text": "Interested"}, {"username": "Alice Francesca", "comment_text": "Rome:\nhttps://\nwww.eitchborromi\nni.com/en/\nrestaurant/\nJust above Piazza Navona\nHidden gems: Chiostro del Bramante (nearby a small Church with Raphael frescos)\nGiardino degli Aranci (google it)\nGianicolo (above Trastevere, it s touristy but I never see it mentioned here, anyway amazing)"}, {"username": "Barbara Pasteris Allen Hettlinger", "comment_text": "The Protestant Cemetery in Testaccio. Beautiful park-like grounds and interesting headstones. Keats and Shelley are both buried there. Volpetti Salumeria and the Mercato are also in Testaccio making this an interesting neighborhood to wander around."}, {"username": "Peach Panfili", "comment_text": "If you want “hidden from tourist” places simply steer clear of Rome, Florence, “Tuscany”, Cinque Terre, Venice and the Amalfi Coast - particularly in July and August. There’s so much more to this exquisite little country than this over-worn, tourist-clogged\ntrail.."}, {"username": "Patty Beemer", "comment_text": "Spend half a day in Ostia Antica."}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "Loved the Ponte and Testaccio (market) areas. Best was Castel Sant’Angelo for a drink at bar with views of St Peter’s Duomo and the most magnificent sunset from its (Castel) rooftop terrace."}]}, {"id": "2200227920376286", "text": "We recently returned from our summer trip and thought of sharing this beautiful agriturismo. ☺️\n\nJune, 2023\n\nAgriturismo Sole\nTrequanda, Tuscany", "link": "facebook.com/groups/1373361046396315/permalink/2200227920376286/", "likes": 181, "comments": [{"username": "Sue Kim", "comment_text": "Beautiful picture!"}, {"username": "Toni Underwood", "comment_text": "Authentic Italian holiday, just beautiful"}, {"username": "Anel Van Zyl", "comment_text": "Beautiful photos! Love the cats. We saw cats everywhere we went in Italy!"}, {"username": "Tracy Sandhu", "comment_text": "Absolutely stunning! 🥰"}, {"username": "Lois Letterie Cianci", "comment_text": "Wow!! Spectacular scenery!!"}, {"username": "Pauline Newton", "comment_text": "Beautiful!"}, {"username": "Gayle Puiia McDevitt", "comment_text": "Great photos!"}, {"username": "Gina Misa Love", "comment_text": "So pretty 😘"}, {"username": "Denise Incandela Boccio", "comment_text": "Thanks for sharing! Your daughter is a very pretty little girl. 🇮🇹"}, {"username": "Teresa Rivero", "comment_text": "Beautiful photos! ❤️🇮🇹"}, {"username": "Anne Ingham", "comment_text": "Anne Ingham"}, {"username": "Erin Lynch Montellione", "comment_text": "Beautiful!"}, {"username": "Ruth Akutu Maccarthy", "comment_text": "❤️❤️❤️❤️ superb"}, {"username": "Elvira Lelli", "comment_text": "Tuscany beautiful region of Italy....scener\ny is gorgeous...🤩"}, {"username": "Lindsay Stewart", "comment_text": "Beautiful pictures"}, {"username": "Pam Hughes", "comment_text": "Stunning photos!"}, {"username": "Karen Anders", "comment_text": "Beautiful photos x"}, {"username": "Louise Faggioni", "comment_text": "Louise Faggioni"}, {"username": "Pat Felice", "comment_text": "Looks so beautiful and peaceful💕"}, {"username": "Angela Perky Perkins", "comment_text": "Angela Perky Perkins"}, {"username": "Carol Antony", "comment_text": "Beautiful"}, {"username": "Leslie BC", "comment_text": "Beautiful photos"}, {"username": "Judy Skyberg Limmer", "comment_text": "Would like to stay somewhere in Tuscany when we get to Italy!"}, {"username": "Loretta Wilks", "comment_text": "Absolutely beautiful pics and such a beautiful little girl !"}, {"username": "Rachel Castleberry", "comment_text": "Beautiful photos. Your daughter is a very pretty. Thank you for sharing. Your photos are amazingly tranquil. 💞"}, {"username": "Sandie Chandler", "comment_text": "You can tell the photographer on tour. Beautiful photos. Captures the romance and tranquility of your trip."}, {"username": "Kim Manning", "comment_text": "Beautiful photos"}, {"username": "Jacqueline S Sparber", "comment_text": "Thank you for sharing! This is beautiful ❤️"}, {"username": "Suzanne Furiosi", "comment_text": "What beautiful photos ❤️. It looks amazing"}, {"username": "Ptt Hotay", "comment_text": "Magnifique"}, {"username": "Julie Hinton", "comment_text": "Beautiful!!"}, {"username": "Margarita Nechaeva", "comment_text": "Absolutely gorgeous!!!"}, {"username": "Nicole Gouzoules Sheehan", "comment_text": "Wow. Beautiful photography."}, {"username": "Julie Berthiaume", "comment_text": "Beautiful pictures 🤩"}, {"username": "Tracy Foss", "comment_text": "Spectacular!"}, {"username": "Maria Cavaliere Fischetti", "comment_text": "Beautiful photos"}, {"username": "Annette W Bryant", "comment_text": "Amazing photos! Beautiful girl!"}, {"username": "Mariët Eertman-Heemstra", "comment_text": "Beautiful, but rather expensive! There are also enough Agriturismo's in Tuscany for less than € 100,- per night!"}, {"username": "Rita Sanza", "comment_text": "Gorgeous ❤️❤️"}, {"username": "Linda Fife", "comment_text": "Beautiful poctures"}, {"username": "Jill Bügler", "comment_text": "Beautiful photos, they should pay you for advertising the lovely property 😀"}, {"username": "Collette Lawson Duffield", "comment_text": "Wonderful pictures! You have a beautiful little model."}]}, {"id": "2200225537043191", "text": "Anyone visited Monte Cassino - the monastery or town? How about interesting places nearby? Can't seem to find much on Google. TIA.", "link": "facebook.com/groups/1373361046396315/permalink/2200225537043191/", "likes": 0, "comments": [{"username": "Ken Vecchia", "comment_text": "Only drove by it on the main highway"}, {"username": "Anita Clayton", "comment_text": "We did about 23 years ago. There used to be a day tour to Caserta and Montecassino from Sorrento. A beautiful and tranquil place."}, {"username": "Irene Oda", "comment_text": "Thank you! We went to Monte Cassino yesterday. It was a great experience. It can only be reached by car, I did see some tourist buses ( big ones). It's an amazing place. I was very surprised at it's grandeur and size. There us a nice museum and a separate art gallery. In all we spent about 4 hours visiting."}]}, {"id": "2200225470376531", "text": "My husband and I will be spending 4 months in Italy from Nov thru Feb, traveling from city to city by train. We have never been to Italy before. When traveling by train, we are thinking of simply going to the train station on the day we want to travel and buying our tickets, as opposed to making advance reservations. It just seems simpler. Is this a good idea? What is your experience? Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2200225470376531/", "likes": 51, "comments": [{"username": "Steve Grossman", "comment_text": "At that time of year, you will have no problem buying your tickets at the train station"}, {"username": "Catalina Daniel", "comment_text": "Seeing as I missed out on hundreds of dollars in train tickets due to delayed flights, Id say get them at least the day before. Waiting too long may limit your options. ie when we finally got into Rome, our 4 hr train ride turned into an 8 hr train. I noped it & rented a car for 3 days instead. It turned out much cheaper & quicker 🙃"}, {"username": "Penny Williams", "comment_text": "It's more expensive to do it that way, but you could buy a rail pass such as Eurail."}, {"username": "Martina Larkin Keighery", "comment_text": "Ya that's no prob. We are just back a week & even tho it was busy it was no prob getting train as long as U don't use the locals trains. They are very packed & risk of pick pockets."}, {"username": "Benedetta Vanni", "comment_text": "Book tickets in advance for high speed or intercity trains if you plan to travel between december 15th and january 10th: people who live in the North but are originally from the South will go back to their families for christmas. Some lines will be saturated!"}, {"username": "Angela DiGianni Nocera", "comment_text": "Where are u planning on\nStaying?\nHotels or b&b?"}, {"username": "John Liddi", "comment_text": "What happens if you book seats on a high speed train from Rome to Naples, and your flight to Rome is delayed causing you to miss the train?"}, {"username": "Bob Dook", "comment_text": "The trains are not going to be too busy when you visit, so no real need to book in advance. Walk in on the day will give you flexibility and I would do that. Mind you, I always do that. 🙂"}, {"username": "Angela Valentine", "comment_text": "it's winter at this time so not a large amount of tourists to contend with......you shouldn't need to book too much in advance which frees you up a bit to make choices you might not have considered before. Have a great time. 😀"}, {"username": "Kay Rendall", "comment_text": "I often go day before to get the layout station, purchase tickets from machine so I am not rushed"}, {"username": "Tracy Amin", "comment_text": "Rent a car 🚗"}, {"username": "Robin Burrell", "comment_text": "You will be absolutely fine November through February doing this. I would mention that if you buy on the app the day you go or the day before you get an electronic ticket you don’t have to validate."}, {"username": "Diana Radin", "comment_text": "OMG 4 months in Italy… that’s fantastic… have a wonderful time! We did 8 weeks and I didn’t want to come home… longing to go back! I booked our train tickets about a week ahead of time, no probs at all."}, {"username": "Linda Safstrom Humphreys", "comment_text": "My daughter and I travelled in November/\nDecember Milan Florence and Venice by train….purchased tickets from the station….no problems"}, {"username": "Dixie Kotylak", "comment_text": "Take only a backpack…luggin\ng my suitcase and bag around on the trains was a definite drag…I imagine it would be much more pleasant travelling lighter! Lesson learned for me! 😉 Love Italy! ❤️🇮🇹"}, {"username": "Sonal Parekh", "comment_text": "Download the app for both train lines and you can book tickets the morning of! It’s super easy. But it will be more $$$ on the day of"}, {"username": "Tiina Mänty-Holopainen", "comment_text": "What an excellent idea! I have done just that when travelling in Italy and had no problems. Bought the tickets at the stations and went where ever I wanted. I have travelled like that solo, with husband and the kids. We all love exploring new places."}, {"username": "Paola Pulga", "comment_text": "no problem buying the ticket on the same day, for high speed I recommend the Freccia rossa or Italo app. Here in Italy it won't be difficult to make friends and discover infinite beauties. good holiday and welcome to Italy"}, {"username": "Neya Kapitanidi", "comment_text": "I have booked most of my train tickets in Italy when already at the station or on the way to it"}, {"username": "Neya Kapitanidi", "comment_text": "Trainline app works perfectly"}, {"username": "Sonya Rogers", "comment_text": "My husband and I just returned from travelling around Italy by train. It was amazing. It was so easy too.\nSome trains need a reservation, I,E Frecciarossa. It's also best to know where to change trains and times. We did book some in advance where necessary but jumped on others that didn't require a seat res.\nI can highly recommend using the interail pass, go online and have a look, it's very cost effective. We were first timers travelling through the country by train, although we have been visiting Italy for nearly 30years. You will have a ball! Enjoy every moment 🇮🇹"}, {"username": "Marylou Scarciotta Buonaugurio", "comment_text": "That would work out fine. You won't be locked into a certain date if you decide to stay longer."}, {"username": "Rita Sanza", "comment_text": "It will be fine .but I prefer to travel first class .much more comfortable especially with luggage. Enjoy your holiday"}, {"username": "Bill Haenlein", "comment_text": "On long trips it might be wise to get tickets in advance!! Also 3 months are max time in Italy!"}, {"username": "Karen Williams", "comment_text": "How are you arranging for that? I thought the longest you could stay was 90 days?"}, {"username": "Carmela Suppo", "comment_text": "Yes no problem at all"}, {"username": "Jack Partington", "comment_text": "That's always worked for us!"}, {"username": "Jun Cee", "comment_text": "it is....until the ticket seller tells you there are no more tickets because they sold out last night to online passengers."}, {"username": "Fiona Cameron", "comment_text": "Here’s a link to a really handy tool to calculate the 90 days. I used to think it was just 90 out of 180 days, but it’s actually a little more complicated 🥺\n\nSchengen calculator\n\nhttps://\nwww.schengenvisa\ninfo.com/\nvisa-calculator/\n?fbclid=IwAR1Vio\nqAGBAZUe1XhhHBl\njez8tnO5YsvV_O0\n7QMR5p0TbhNsjyI\n1OrI5ieg&mibext\nid=Zxz2cZ"}, {"username": "Karen Espinoza", "comment_text": "It is a great idea 👌"}, {"username": "Lauri Datri Anderson", "comment_text": "Absolutely works. I was purchasing them as we were walking to the station. My husband thought it was hilarious. But it worked. Download the OMIO app. Gives you all the trains."}, {"username": "Phyllis Snyder", "comment_text": "IT’s recommended to book in advance for the most popular routes- and it’s less expensive as well. Tickets do sale out essentially during peak season and hours."}, {"username": "Brenda Keeter", "comment_text": "We’ve done that in England, Belgium, and Netherlands with no problems. Best to make reservations ahead for high speed trains. I would imagine that time of year, should be fine, though I haven’t traveled by train in Italy."}, {"username": "Alice Francesca", "comment_text": "It s always cheaper if you buy in advance.Use trenitalia.it ."}, {"username": "Lisa Valdovinos", "comment_text": "We did it in advance."}, {"username": "Michael Simon", "comment_text": "How do you get around the 90 day max in the Schengen countries?"}, {"username": "Linda Miller", "comment_text": "That's the only way I'll buy tickets. I did just that a few months ago. You have more flexibility that way! And really don't have to worry about strikes and refundable tickets if you purchase the day of!"}, {"username": "Stefano Follador", "comment_text": "It’s interesting travelling this way and I think it’s doable, especially since you are travailing in a relatively low season.\nJust one comment.\nTravelling by train it’s great if you are moving city to city, but then if you are going more into rural Italy it will be more complicated.\n\nFor example I live in Valdobbiadene, a really nice wine area birthplace of Prosecco and UNESCO world heritage, and for coming here it could be a little complicated since the closer station it’s about 10 km faraway and a lot of destination out of the mass tourism are in the same situation.\nWhat I suggest you is to keep an eye on car rental if needed, but again train travelling is totally doable in Italy.\nWell if there is no strike 😅"}, {"username": "Cecilia Christine Costantini", "comment_text": "Also, if a train doesn't go somewhere, keep in mind there are dozens of bus companies to reach smaller towns and villages. Funny thing: city bus is called AUTOBUS in Italian, but buses that run between cities and regions are called PULLMAN."}, {"username": "Keith Crossley", "comment_text": "A fond memory from 1970, with just a backpack: getting to the train station and thinking \"where should I go today?\""}, {"username": "Susan Cantafio", "comment_text": "We made reservations for all our train trips in Italy the last time cheaper that way and we just made them for this trip in Sept we always travel business coach since you can pick your seats"}, {"username": "Alice Engstrom", "comment_text": "try tobook. less frustrationa and you could actulally get reserverd seats... important!"}, {"username": "Lois Wagner Haight Porcelli", "comment_text": "Easy to buy"}, {"username": "Susan Lowry Lamb", "comment_text": "Four months? Can you feel the envy coming off of me? Don't super book it all. I think a bit of freedom to go where your hearts take you would make a better trip."}, {"username": "Carey Matthews", "comment_text": "We were very successful in our longer stays to buy at the train kiosks a day or two in advance."}, {"username": "Peter Nagafuchi", "comment_text": "The unplanned plan is best for leisure and fun ….go as the spirit moves is our favorite way to travel."}, {"username": "Alan Monroe", "comment_text": "We used an app called ‘Trainline’. It shows all the available trains and times. Just type in your your ‘to’ and ‘from’ and it shows you what’s available- then you just book your ticket. Tickets are loaded to your phone."}, {"username": "Carol Taylor Tisdale", "comment_text": "It depends on whether or not you want to be able to reserve a certain seat. If you want to book the more comfortable seats in the Business or First Class cars you need to book ahead of time. It is usually more expensive to wait to purchase tickets. But if you are adventuresome and can roll with the flow.... certainly do it!"}, {"username": "Domenica Calvene", "comment_text": "Rome2rio app is great!!"}, {"username": "Ed Hoenig", "comment_text": "You should be fine that time of year buying day of. But if you have any definite major route sections and dates for those you can save a lot of money booking those and getting the 2 for 1 fares. We booked our major legs and winged it for the short routes and flexible days."}, {"username": "Rip Lonergan", "comment_text": "We spent 16 weeks traveling all around Italy by train last summer. The only tickets we got in advance were for trips, two hours or more. ￼ we were able to get first class seats, every leg of the trip purchasing a day or two in advance. FYI we traveled from Monaco to Lyon to Geneva to Milan, Florence, Como and Garda, Rapalo.￼ La Spezia, ￼ Menton, Ventimiglia, and back to Nice. ￼ We took numerous day trips to Pisa, , Carrera, etc. We never had problems getting seating, and we were there during high season. ￼ many times we just bought our seats at the train station when we arrived at the station with ￼the electronics kiosk.\n\nPrior to making this choice, we investigated the Eurail pass and determined it was not cost-effective.\n￼\n\nTrain travel is wonderful, on time comfortable, and it was so nice for us not to have to visit an airport. We flew into. ￼Nice on the Fourth of July and didn’t see another airport until. ￼October!"}, {"username": "Annette Mayer", "comment_text": "Day of worked for us. My best suggestion when packing be prepared for taking luggage up and down stairs at train stations"}, {"username": "Katalina Loredo", "comment_text": "Regional trains are always the same price but fast trains get more expensive as the time gets closer. If don’t mind regional trains, I would book the day of!"}, {"username": "Janet Messanelli Bozzone", "comment_text": "Just check out the schedules for the routes you are interested in. Hot hubs like Venice, Milan, Florence, Naples and Rome have many trains leaving daily. So these are not an issue. Yes, you can save some $$$ but often those tickets are not refundable or exchangeable. Even places that don’t have many train options are bookable a week in advance."}, {"username": "Liz Cooper", "comment_text": "I’ve done this too. Fine. Never had a problem."}, {"username": "Yulia Bridun", "comment_text": "We were buying tickets right before boarding train - family of 4 - June this year."}, {"username": "Ruth Akutu Maccarthy", "comment_text": "Depends on where you are going. If you're going far distance, for example Rome- Milan I suggest you take the fast train such as Frecciarossa of trenitalia.it or Italo of Italo.it these two services have different prices based on when you purchase it. If you book it very early you'll get a very good price. If you book the day before or worst the same day the price will be very very high. If it's a short distance and you are taking a regional train then you can buy it at the train station directly the day of departure.\nI love buying all my tickets online since I don't have any paper to keep or convalidate it"}]}, {"id": "2200195247046220", "text": "Ciao, can anyone please share their experience with baggage rooms at Train Stations around Italy?\nOur flight back home is at night and we want to visit Florence that day, without the luggage slowing us down, is it safe and is there such an option to leave luggage in a locker or similar at the Train Station in Florence?", "link": "facebook.com/groups/1373361046396315/permalink/2200195247046220/", "likes": 0, "comments": [{"username": "Nariman Dergam", "comment_text": "Interested"}, {"username": "Dawn Lanette McKinley", "comment_text": "Baggage rooms are safe and reliable. I’ve never had any problems using them, this includes in Florence. ￼"}, {"username": "Benedetta Vanni", "comment_text": "No problem at all in Firenze:\nhttps://\nmaps.app.goo.gl/\nssPeAx9mcoz2un2c\n9"}]}, {"id": "2200190757046669", "text": "Firstly I’d like to say how amazing it us to be part of this group. Have taken in some fantastic advice.\nLooking at travelling to Italy this time next year and starting to do the budget so I know how much I will need to save.\nHow much should I allow for meals per day?\nHow much should I allow for accommodation, not wanting anything flash or expensive. 2-3 star’s hotel is fine.\nThankyou in advance", "link": "facebook.com/groups/1373361046396315/permalink/2200190757046669/", "likes": 3, "comments": [{"username": "Connie Wilson", "comment_text": "I would advise to choose a time other than July or August if remotely possible."}, {"username": "Rhona OConnor", "comment_text": "Have a look at Booking.com and you will get actual prices."}, {"username": "Sarah Williams", "comment_text": "Accommodation prices vary wildly. Amalfi cost is expensive, Capri more so £350+ Naples, Pisa,Lucca super cheap £90-£100"}, {"username": "Rosa Pulsoni- Mandaradoni", "comment_text": "After everyone’s suggestions. Looking at going September/\nOctober 2024.\nStill after budget suggestions."}, {"username": "Renae Larcus", "comment_text": "My advice is don’t go in July!"}, {"username": "Bonnie Loftspring", "comment_text": "Go to Trip Advisor, look at hotels w dates in mind, strictly for reference, you will get an idea of hotel rates for that period & reviews too. Trip Advisor can be a great resource"}]}, {"id": "2200190330380045", "text": "Has anyone used Planbuddy to plan their travel itinerary?", "link": "facebook.com/groups/1373361046396315/permalink/2200190330380045/", "likes": 1, "comments": [{"username": "Caroline Fitzgerald", "comment_text": "Is anyone able to help with this?"}, {"username": "Danielle Kendall", "comment_text": "Never heard of if."}, {"username": "David Walker", "comment_text": "You cannot beat TripIt!"}]}, {"id": "2200181063714305", "text": "Day 2- Realisations/Tips\n1. Golf cart tour or hop on-hop off bus.\nI highly recommend the golf cart tour-u will visit most places without the need to walk at all. Since it is a small group, u can always ask more questions to your tour guide.\n2. Please do make sure u choose your hotel near the center. When i booked my hotel, TH Roma Carpegna Palace, I read from the reviews that its location is ideal. However, I find myself paying 25-30 euro per way to the center and the same way back (sometimes even more because no taxi would take except the black vans) so again, choose wisely.\n3. I initially planned to watch the Sound of Freedom here because it is not available in the country I live (middle east) so I went to Cinema Moderna-well all movies are in italian.. no subtitles. Obviously, I was not able to watch haha\n4. Those traveling solo, I would like to encourage you not to overplan. Leave some space for floating schedules. Sometimes, just sitting by yourself is all you need-just appreciating that u indeed made it here or wherever country you are in. Be gracious to yourself. ( I met quite a number of amazing people yesterday and I am\nExtremely humbled that I got a chance to listen to them and be listened to. At the end of the day, more\nThan being travelers, we are human beings who long for connection.\n5. Don’t be shy to strike a pose. Hhhaha tickets and traveling in general are expensive already. We have worked hard so seal it with a pose. Ahah\n6. Do know that less expections mean less disappointments. have fun. Be grateful. Be blessed!", "link": "facebook.com/groups/1373361046396315/permalink/2200181063714305/", "likes": 23, "comments": [{"username": "Rye Eiven", "comment_text": "I like that gold cart tour 😃 how much is it?"}, {"username": "Sherri Wills", "comment_text": "We booked The golf cart tour in September…. Can’t wait!"}, {"username": "Bonnie Lerman Urban", "comment_text": "Great pictures"}, {"username": "Mariposa Mariposa", "comment_text": "Great info thanks🇮🇹☺️"}, {"username": "Teresa Brewer Harkins", "comment_text": "What awesome words of encouragement! I need to heed your words and not over-plan!! And great pics!!!"}, {"username": "Tracy Foss", "comment_text": "Thank-you for your suggestions I have golf cart tours booked in several cities! I always make sure our hotel is in central location it is # 1 on my list ! We are right at Trevi fountain in Rome"}]}, {"id": "2200165780382500", "text": "Hello! 🌻I have traveled to Italy several times now, but in this September it will be my first time renting a car. So I need your suggestions about Tuscany - I’m renting car in Rimini and for two days I’ll have it to discover new places, my main focus is region of Tuscany.\nCan you suggest how to plan the trip from Rimini - what to see - focused on nature, trails, spots for swimming.\n- where to stay - villages, small towns.\nAnd what is must see in the way.\nThank you! 🌞", "link": "facebook.com/groups/1373361046396315/permalink/2200165780382500/", "likes": 0, "comments": [{"username": "Alice Francesca", "comment_text": "Hi!\nI am Italian and the Val d'Orcia is where you want to be headed if you long to see the *REAL* Tuscany.\nHave Pienza as a homebase\nhttps://\nwww.italia.it/\nen/tuscany/\nthings-to-do/\npienza-the-ideal\n-city\n\nCheck: CHIOSTRO DI PIENZA\nHOTEL POSTA MARCUCCI\n(A day at their wonderful spa )\nMONTICCHIELLO\nMONTALCINO\nSAN QUIRICO D'ORCIA"}]}, {"id": "2200165220382556", "text": "Good Morning!\n\nJust a quick question, when applying for a visa, do you need to provide proof of train tickets? Ill be landing in Rome, going to Milan, through Switzerland and then to Paris for a few days and then back to Rome for another 8 days.\n\nI dont want to be bound on train ticket times. Any advice?", "link": "facebook.com/groups/1373361046396315/permalink/2200165220382556/", "likes": 0, "comments": [{"username": "Colleen Dawson", "comment_text": "The best resource for your question would be the government website of the countries you are visiting, since most on this site do not need a visa to the countries you listed."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2200155310383547", "text": "Hi all,\n\nThinking of doing a day trip from Monterosso to Portofino. Is there a direct ferry service available? Will be travelling in early Sept. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2200155310383547/", "likes": 0, "comments": []}, {"id": "2200162890382789", "text": "Hi everyone, i have an accommodation question. In September we will be travelling to Italy as a family of four (myself, my husband, and two sons, aged 12 and 9) for three nights in milan, four nights in Rome and two nights in venice.\n\nAre hotels or Airbnbs a better option?", "link": "facebook.com/groups/1373361046396315/permalink/2200162890382789/", "likes": 2, "comments": [{"username": "Kristina Ruk", "comment_text": "It depends what you prefer ;) I dont like much of cleaning on holidays (as for my opinion (it just mine opinion) Airbnbs I seem disrespectfull to leave garbage or like unmake beds, like any kind of bigger mess), so if I find hotel for better price I prefer hotels. As I need to wash for my familly Airbnbs most of them have washers and dryers (that I dont like overpack also) but I just simply can do with hands and soap and it dries overnight..hote\nls ussually lets you to leave luggage if you arrive early, as well it more convenient if we arrive late. So its up to your familly what is better for you"}, {"username": "Karen Schmidt", "comment_text": "I usually book Airbnb’s when I travel with the 4 of us. More space, separate bedrooms and the ability to save money on food. Plus, I can do some laundry. If it’s only 2 of us…I do a combo so I can have breakfast made for me on some of the mornings"}, {"username": "Lisa Schalig-Winter", "comment_text": "Just stayed in Rome with our 18 and 15 year old kids. Our Airbnb had a lot more room than a hotel. Many of the hotels we looked at offered 2 double beds. We are in a hotel for our last night and I’m so glad we had the extra space plus a kitchen and 2 bathrooms in our Airbnb."}]}, {"id": "2200161283716283", "text": "Hello guys! I know that this group is intended for travels in Italy. I am just curious if someone can refer or recommend a reliable tour guides/agents in Salzburg and Vienna, Austria. We are planning to go there for Christmas Market this year on our own after our group tour ends in Venice. Please reply if you know someone who can assist us. Thank you everyone if you can share with your feedback and sorry if I’ve crossed the boundary.😊", "link": "facebook.com/groups/1373361046396315/permalink/2200161283716283/", "likes": 0, "comments": []}, {"id": "2200156123716799", "text": "Hi I love this site reading everyone great travels .I’m thinking of taking a tour of Italy next may .Most will be by bus .Just some info of people that have done this .Are the buses safe ?I usually cruise but I’m not going to see as much as a road tour", "link": "facebook.com/groups/1373361046396315/permalink/2200156123716799/", "likes": 0, "comments": [{"username": "Connie Wilson", "comment_text": "Buses are just fine, and Italy has an extensive train system that is scenic as well."}, {"username": "Alice Francesca", "comment_text": "Use trains instead.I am Italian."}, {"username": "Gaye Phillips", "comment_text": "If you are going alone. Bus it. I backpacked Italy Greece. Can get dangerous.Train\ns you can still get robbed. Been there done that.Nearly got robbed on the train at sleezy Brindzey goin to the ferry for the Islands. Glad I had my Mace."}]}, {"id": "2200154407050304", "text": "Hi everyone\n\nCan anyone please give me some advice on how to reach positano from Naples.\n\nI was thinking of taking the train to seronto and then ferry to Positano.\n\nIs there any better route using public transport?\n\nAnd which website are you using to book the ferry?\n\nThankyou", "link": "facebook.com/groups/1373361046396315/permalink/2200154407050304/", "likes": 1, "comments": [{"username": "James-Kathy Dickerson", "comment_text": "Ferry Naples to Capri, and Capri to Positano"}, {"username": "Sigrid Cormier", "comment_text": "Oh that would be a beautiful trip….bonus not having to pay €100 for a tour!"}, {"username": "Miyuki Kanno Paul", "comment_text": "If still in season, take a ferry from Molobeverello port to Positano"}]}, {"id": "2200146997051045", "text": "Venice- did anyone stayed on main land close to Marco Polo airport ? We are staying in Antony hotel. We didn’t know there is main land and Venice island before booking. I need help with few things with yourआणखी personal experience -\n\n1. How did you travel to Venice island back and forth?\n2. Any good places to eat, shop and buy groceries like basic items close to airport ?\n\nThanks for your help.", "link": "facebook.com/groups/1373361046396315/permalink/2200146997051045/", "likes": 2, "comments": []}, {"id": "2200143117051433", "text": "Recommendations\nfor nice hotel room with a nice view at Venice preferably near the Rialto bridge", "link": "facebook.com/groups/1373361046396315/permalink/2200143117051433/", "likes": 4, "comments": [{"username": "Meredith Williams", "comment_text": "we loved h10 palazza canova steps from the rialto"}, {"username": "Jill Wolder", "comment_text": "Hotel Daniele is a short walk from Rialto. It is in the center of Venice. A beautiful hotel"}, {"username": "Debbie Horton Rough", "comment_text": "Hotel Rialto"}, {"username": "Elaine King", "comment_text": "Go to booking.com enter the location you prefer. I found a place just accross the Rialto bridge, I found the attached hotel, depends on when your traveling,"}, {"username": "Frances Scannapieco", "comment_text": "Hotel Al Ponte Antico. Boutique Hotel on Grand Canal. Right by Rialto Bridge"}, {"username": "Renae Larcus", "comment_text": "A la Commedia Hotel near the Rialto Bridge."}, {"username": "Wendy Rogers", "comment_text": "Palazzo Bembo"}, {"username": "Coll TC", "comment_text": "Hotel American Dinesen was lovely, we walked everywhere easily"}, {"username": "Lisa Rucki Clark", "comment_text": "I stayed Vrbo literally next to the Rialto Bridge. Looked at it every night from the room. More roomy than a hotel. I’d check that route."}, {"username": "Diana Radin", "comment_text": "Hotel Rialto… good location, great view of the bridge, lovely hotel"}]}, {"id": "2200136310385447", "text": "Hello All\nI will be traveling to Paris but will be working my way up to Italy\n\nWhat fast train or app can I use to To get there\n\nAfter Paris I will be stopping by Switzerland 🇨🇭\nThen Milan to Venice and Lastly Rome\nThen go back to Paris to depart back home", "link": "facebook.com/groups/1373361046396315/permalink/2200136310385447/", "likes": 0, "comments": [{"username": "Veronica Parravicini", "comment_text": "From Switzerland to Milan you can use Trenitalia, there are a few fast trains.\nIt depends on where you are staying in Switzerland"}, {"username": "Sam Mah", "comment_text": "Work out the costs from SNFC, SBB Trenitalia then see if there is a Eurail/ Interrail pass that makes it cheaper."}, {"username": "Karen Schmidt", "comment_text": "Train takes a long time from Paris . Fly one way"}]}, {"id": "2200133577052387", "text": "Hi someone yesterday mentioned a book to read whilst in Italy can anyone one remember the name of the book", "link": "facebook.com/groups/1373361046396315/permalink/2200133577052387/", "likes": 5, "comments": [{"username": "Whitni Henderson", "comment_text": "There were 182 responses to that post.\nIf you go to the top of the group’s page you will see a little magnifying glass. Click on it. Type the word BOOK into the search bar and it will bring up the post from yesterday. Then you can scroll through all of the suggestions 🙂"}, {"username": "Stephanie Osborn Rushing", "comment_text": "I didn’t see the other post, but rereading this for our upcoming trip. SO good!"}, {"username": "Roxanne Galari La Rosa", "comment_text": "Hi it may have been one Italian summer?"}, {"username": "Sofia Kanack", "comment_text": "Probably was the book One Italian Summer"}, {"username": "Margaret Ryan", "comment_text": "I just finished this 2020 book. Gorgeous. 😍"}, {"username": "Margaret Ryan", "comment_text": "I just finished this 2020 book. Gorgeous. 😍"}, {"username": "Kathy Greco", "comment_text": "A Boat Load of Lemons is a lovely read about Positano."}, {"username": "Agnese Arnó Ch-Ch", "comment_text": "I tagged you in the post!"}]}, {"id": "2200128137052931", "text": "Can someone please share the official site to buy tickets to see David and the Uffizi in Florence?\n\nI'm getting confused and want to make sure I'm on the right sites.\n\nThank you", "link": "facebook.com/groups/1373361046396315/permalink/2200128137052931/", "likes": 0, "comments": [{"username": "Ann Wise", "comment_text": "This site provides information & links: https://\nwww.visitflorenc\ne.com/\nwhat-to-see-in-f\nlorence/\nbooking-florence\n-museums.html"}]}, {"id": "2200122227053522", "text": "Hello! I have a question about how much you can bring back from Italy to the USA. I have looked online but got confused with all the information. I have been traveling the last 3 weeks around the Mediterraneanआणखी with my family and we have picked up some alcohol and olive oils. We are unsure how much we can bring back. We bought an extra suitcase but are now unsure if we need to split it up between various bags. Thoughts? Below is our list.", "link": "facebook.com/groups/1373361046396315/permalink/2200122227053522/", "likes": 6, "comments": [{"username": "Angie Jeanne", "comment_text": "Following"}, {"username": "Robert Lawshe", "comment_text": "As far as alcohol, from my experience, bring back whatever you want. When customs asks you how much you have, tell them the truth. 99.99% chance they won’t care, they might tell you you brought too much but they will let you through. I have never had a problem when I have been honest, last trip we brought back approximately 11 750 mL bottles between my wife and I."}, {"username": "Prashant Iyengar", "comment_text": "Just declare if asked. It’s usually $2-3 per liter above the limit. Very reasonable. For what you have they won’t even care."}, {"username": "Ashley Martins", "comment_text": "You are fine, it’s all for personal use. Whenever we go to Europe I bring back at least 5 bottles wine & hubby at least 10 plus beers plus balsamic, oil, honey, etc. depending on where we visit. Never an issue."}, {"username": "Heath Conn", "comment_text": "I’ve made many trips. The only alcohol I’ve brought back is wine. 6 bottles person. I’ve never had any issue with anything else except - meat. Specifically, beef and pork based sausage. All of them will likely be confiscated."}, {"username": "Salvatore Giardina", "comment_text": "$800 worth"}, {"username": "Rip Lonergan", "comment_text": "As of 2021, an American citizen who is at least 21 years old can bring back up to 1 liter (33.8 fl oz) of alcohol, including wine, duty-free when returning to the United States. However, if you are bringing back more than 1 liter, you will have to pay duties and taxes on the extra amount.\n\nRegarding olive oil, there are no specific limits set by the U.S. Customs and Border Protection (CBP) for personal use. However, it is recommended to declare any agricultural products, including olive oil, at the U.S. port of entry. CBP may inspect the items to ensure they comply with import regulations regarding food items. It's always a good idea to check the latest guidelines provided by CBP or contact them directly for the most updated information before traveling."}, {"username": "Pam Gerretsen", "comment_text": "Given the differing answers, I wanted to check as I am travelling to the US later this year, and planning to take some prosecco for our celebrations, and the 1 litre limit was going to mess with my.plans!\n\nhttps://\nwww.tsa.gov/\ntravel/\nsecurity-screeni\nng/\nwhatcanibring/\nitems/\nalcoholic-bevera\nges#:~:text=Che\ncked%20Bags%3A%\n20Yes&text=Alco\nholic%20beverag\nes%20with%20mor\ne%20than,to%20l\nimitations%20in\n%20checked%20ba\ngs."}, {"username": "John Wilson", "comment_text": "No limit for beer and wine, ( and anything else under 24%) and 5 litres per person over 24%~ make sure you declare separately"}, {"username": "Brian Yonks", "comment_text": "Just ship it back.... you purchase and then find a \"Mail Boxes Etc\" store and they will ship and box it for you. Most vineyards will also ship it. Don't carry it."}, {"username": "Caroline Sands Hugo", "comment_text": "Where are you from"}, {"username": "Caroline Dombey", "comment_text": "Don't bring anything back. It's never the same."}, {"username": "Sandi Van", "comment_text": "1 liter per person … but download the mobile passport control app answer the questions before you go thru custom and they won’t ask much. Plus you get to go to the shorter line like global entry but MPC line barely any wait"}, {"username": "Cherie M VanCleave", "comment_text": "You are able to ship some things if that helps 🙂"}, {"username": "Richard Stein", "comment_text": "We just got back yesterday, we brought back 6 bottles of wine. No oil though, we had no problem at all breezed through customs. They don't really care about wine or oil, there looking for meats and fruits, anything prohibited."}]}, {"id": "2200119747053770", "text": "I have a 14 day trip in the end of September. Rome/Florence/Venice/Milan...There is so much information it can be overwhelming. Besides a few \"must do's\" what do you think about NOT planning stuff and just going with the flow when you get there? For example, I want to day trip to various spots. But what if I book it for one day but then there'sआणखी something else to do and I want to go Thursday instead? Does that make sense? This is why I'm a horrible planner. I think to myself what if I meet someone local who says \"you HAVE to go here or there\" Because those are the places I'd really like to go. Thanks for listening. Open to any advice. Signed- overwhelmed", "link": "facebook.com/groups/1373361046396315/permalink/2200119747053770/", "likes": 9, "comments": [{"username": "JeriLynne Clifford", "comment_text": "You do you. Just realize you might not get in to see everything if it sells out. We tend to do 3-4 days in a city. We do the “must see” stuff in one day (usually the first full day) then figure it out. Food and wine are important to us so I do make dinner reservations and lunch if it is a must."}, {"username": "Lisa Valdovinos", "comment_text": "We went through a travel agent and she planned excursions for us but also left us with plenty of time to explore on our own."}, {"username": "Terry Pisano", "comment_text": "I've been planning almost the same trip for the last 6 months. If there are must do's on your list, I'd book them and work around it. I also booked alot of other things, but like you, I want to keep my options open, and I've already cancelled some of the things I had booked and may continue to do that up until we leave. But Coliseum was on hubby's must do list so that one is booked and paid. Having said that, everything is subject to change... and we'll go with the flow."}, {"username": "Elizabeth Lupo DiVito", "comment_text": "That trip sounds exhausting just with so many towns in that short time. Each of those towns have so much to see and the packing and unpacking and changing locations eats a lot of time too. If you preschedule you won't have any flexibility."}, {"username": "Sarah Williams", "comment_text": "We don’t plan for every day - but we do figure out the must do’s so we wanted to do the lemon tour in Amalfi and it’s not open every day, queue jumping tickets etc but we also have down days to meander, walk, bar hop, beach ….whatever takes our fancy.\nOne of my favourites was a day just wandering the back streets of Venice stopping here and there, away from the crowds."}, {"username": "Sarah Williams", "comment_text": "And it’ll be brilliant whatever you plan - you’re in Italy 🇮🇹"}, {"username": "Phyllis Snyder", "comment_text": "If you’re not into researching and planning traveling- then probably should seek travel agencies to do the work for you. But of course some basic ideas on what’s on your list of must see is important. A good guide book might help."}, {"username": "Roland Trego", "comment_text": "The only issue doing things last minute is that you may end up paying top dollar for hotels that are mediocre or worse. There’s a reason the good ones get fully booked early on. The rest—dinners, day trips, trains—can mostly be done spontaneously, but certain places, e.g., Galleria Borghese, must be booked beforehand."}, {"username": "Tracy Foss", "comment_text": "I book activities every other day and take a day off in between to do what you want at a more relaxed pace. It works for us and usually spend 5 nights in each place"}, {"username": "Stacy Smith Urso", "comment_text": "Go with the flow but things like Vatican, colosseum , Amalfi and anything that requires a driver or entrance, splurge on the private or semi private tours! I have an amazing lady that took us up the coast of Amalfi with her driver and it was amazing. Don’t attempt driving there 😂 call me if you need suggestions. Just there a couple weeks ago 😉"}, {"username": "Cathy Schreck Brucker", "comment_text": "Thanks so much! I appreciate the different perspectives!"}, {"username": "Glenn Todd Webb", "comment_text": "Tickets are a must buy ahead of time to so many things like duomo, last supper, David…. If you don’t get ahead of time you will miss out or spend your trip standing in line."}, {"username": "Lushan Yao", "comment_text": "When I tried to plan my first trip to Italy, I felt overwhelmed. There’s too much to see, to do and to choose. I ended up joining a tour as a solo traveler, and it was the trip of a lifetime! If you are open to tours, it might be a good option, especially if it is your first travel to Italy."}, {"username": "Gabi Thomas Chaplin", "comment_text": "best advice we got: plan to do 1-2 things a day and spend the rest of the time exploring and that worked out great for us! however, “big things” book up months in advance (Vatican, Colosseum, etc) so if those are on your Must See/Do, get tickets and that will be your “thing” for that day 😊"}, {"username": "Renee Dillenbeck", "comment_text": "I’m doing almost this same trip the end of October and I’m not a planner and my mind is in knots trying to read everything I can on this page and then figure it out. It’s a great page and has helped me a lot, but because I am how I am, I’m going to book the couple things in Rome and make sure I make it those days and the rest will be what they will be. I’m bringing teenagers who would rather wander around anyway and I think a lot of tour planning would be too much for them."}, {"username": "Tricia Brittingham Neff", "comment_text": "I just arrived today!! My plan was to schedule everything that needed to be scheduled and ‘must do’s’ all on the same day and I always left 1 day in each stop free to do as we please!! I feel like it will be a good balance!!"}, {"username": "Charleen Siegler Schuss", "comment_text": "Go with the flow\nWhen you are concentrating on all the must sees you miss out on La Vita Dolce. Walking neighhoods, getting lost, going into a deli, bakery, wine, hardware, or grocery store struggling with the language, watching families stroll in the evening, the teenagers gathering, discovering a fountain on a back alley is Italy as much as the iconic sites."}, {"username": "Jeff Mayernik", "comment_text": "We usually plan 'anchor' activities, the must do's and especially the ones requiring advance booking, at 1 per day and leave basically one day out of every 5 as an unplanned day for things we discover after arrival. A 7 to 10 day trip would have 2 or 3 days completely blank. Not a good strategy for everyone but it's worked for us"}, {"username": "Rachael Richardson", "comment_text": "If you go out of season I’m sure you can do that. We’ve just been to Venice and while there decided to book a boat trip to murano that morning - plenty of spaces\nAnd our colosseum trip got cancelled while there and we rebooked another day no problem"}, {"username": "Becky Lewis", "comment_text": "I went this past Feb for 2 weeks and we booked excursions in advance but also left plenty of days with nothing planned. Have a mix of both!"}, {"username": "Alicia Cox", "comment_text": "Plan the must sees esp if it requires a reservation. Leave the ability for flexibility. Just figure out each place for how long & book ur room. Do that now & do the fine tuning later unless it requires a reservation. And depends on ur transportation.\nTuscany out of Florence required a car or a tour or a driver. Big cities you can walk & use public transportation.\nDo water taxi to Murano & burano out of Venice - easy, cheap, allow half day at each but do them same day. They are wonderful!"}, {"username": "Lucie Thibodeau Davis", "comment_text": "Rome-We booked our tickets a week in advance for a guided tour at the Colosseum & the Vatican. The rest will will play it by ear when we are there. Like you, I don’t like to have too many things set in stone but wanted to book the most important/most popular."}, {"username": "Veronica Parravicini", "comment_text": "Book in advance super turistic spots only or things you really want to do\nThere’s no need to be super organised especially if you are coming here late September (off season)\nEnjoy the Italian (unplanned) way of living😂😂"}, {"username": "Barbara Bastianini", "comment_text": "Just keep in mind that people are all different. What one person considers a “must do” might not be a must do for you. Even if a local tells you that you HAVE to go somewhere doesn’t mean that recommendation is right for you. The local may have different interests and preferences than you do.\n\nI remember going to South Africa on what turned out to be the best trip of my lifetime. After going on several different big 5 safaris in different locations, touring the wine country doing wine tastings and staying in a vineyard hotel, hiking to view 4 thousand year old rock art, entering a cave containing prehistoric artifacts, visiting lots of historic sights, touring townships, swimming in the Indian Ocean and much much more someone told me I’d missed the one “must see” & I couldn’t say I’d been to South Africa because I hadn’t gone shark diving. But I had absolutely zero interest in that. I had planned the perfect trip for me based on my own interests. I experienced the South Africa that I want to experience.\n\nOnly you can know what you HAVE to see. So you should plan your trip around your own interests. Know that no one can ever see anything on any one trip so design an itinerary that hits as much of what you yourself want to do as your time frame snd budget allow. In that itinerary leave a day or a few days open to allow for flexibility. Use those unplanned days for more spontaneous things like maybe day trips. Or If you don’t want to take those day trip you could just spend that day making the rounds of gelato shops. Or sitting at a cafe on a busy piazza enjoying a drink while people watching.\n\nDon’t be overwhelmed. Plan carefully without driving yourself crazy trying to see and do everything. Because that’s impossible. Just pick your highlights and forget about the rest for now. Use your unscheduled days to be more spontaneous.\n\nDon’t let yourself be overwhelmed. We all have limits, Financial, time, or physical constraints always come into play. Accepting those limits snd adjusting your trip to them is what makes for a great time. You don’t want to end up not enjoying a wonderful place because you’re thinking about other wonderful places that you’re not going to.\n\nSo choose your activities according to what best suits your interests. Schedule your highlights. That way you won’t be disappointed if something else presents itself because what you already scheduled is a must see for you. Schedule the things you’d be disappointed to miss. Then be spontaneous with the time left over."}, {"username": "Laura Uribe", "comment_text": "We play everything by ear except the things that we absolutely want to see. Last Supper must be booked. If you don’t want to spend hours in line and want to see David, book tickets. Otherwise, just wing it!"}]}, {"id": "2200096763722735", "text": "Palermo yesterday. Scary footage of the fires.\nCatania has been without power or water for 2 days.", "link": "facebook.com/groups/1373361046396315/permalink/2200096763722735/", "likes": 0, "comments": []}, {"id": "2200089207056824", "text": "Hi! Need suggestions for a cooking class in the Tuscany area for October. Will be staying in Cortona. A lot of classes I have found depart from Florence.", "link": "facebook.com/groups/1373361046396315/permalink/2200089207056824/", "likes": 0, "comments": [{"username": "Whitney Meyers", "comment_text": "La Chiusa Tuscany has the best classes"}, {"username": "Alice Francesca", "comment_text": "https://\ncesarine.com/en/\nsearch/\ncortona?gclid=Cj\n0KCQjwiIOmBhDjA\nRIsAP6YhSVgFMTv\nIx-YW0WWEtVF0vv\nxDZhqX3zsO9iuWH\nU1tPRWSVZZ-_iwu\ngMaAhdMEALw_wcB"}]}, {"id": "2200084760390602", "text": "Here is an unusual question. I will be in Florence and Rome in October. I am a seamstress and would like to purchase a few pieces of fabric while there. Can you tell me some fabric stores to visit for good quality and yet affordable fabric by the yard? Thanks for your input!", "link": "facebook.com/groups/1373361046396315/permalink/2200084760390602/", "likes": 0, "comments": [{"username": "Diane Leesmith", "comment_text": "Shame you’re such a long way from Burano ( near Venice)."}, {"username": "Benedetta Vanni", "comment_text": "There's a town called Prato which is a few minutes away from Firenze: it's the capital of textile factories in Toscana and i would dare to say in Italia. Look for something interesting over there! You can reach the town center by train."}]}, {"id": "2200075813724830", "text": "Rome to Ischia and then back to Rome…\n\nHow much travel time do y’all think we need to account for?\n\nWill be in Ischia for a few days only so want to use our time wisely but also give ourselves proper travel time.\n\n(Looking at traveling via fast train then ferry but we know we to set time aside from what we are seeing travel times are on Google)", "link": "facebook.com/groups/1373361046396315/permalink/2200075813724830/", "likes": 0, "comments": []}, {"id": "2200012767064468", "text": "Hello a lady posted a list of menu items( from her friend that lives in Italy) and what they were in English. I cant find the post", "link": "facebook.com/groups/1373361046396315/permalink/2200012767064468/", "likes": 0, "comments": []}, {"id": "2200071207058624", "text": "Going to Italy next week on my Babymoon. Does anyone know if gelato is made with pasteurized milk or cream?", "link": "facebook.com/groups/1373361046396315/permalink/2200071207058624/", "likes": 0, "comments": [{"username": "Cecilia Christine Costantini", "comment_text": "Copied this from an Italian webpage about gelato and pregnancy: In realtà, che si tratti di gelato confezionato o artigianale non c'è alcuna differenza, perché anche le gelaterie che propongono prodotti artigianali o semi-artigianal\ni prevedono la pastorizzazione\ndegli ingredienti. 》 pasteurized milk / ingredients! But to be on the safe side you can always ask: questo gelato è fatto con latte pastorizzato?"}, {"username": "Ingrid Zancoli", "comment_text": "In Italy doesnt exist raw milk as you intend it, especially to prepare food or gelato. I think you can ask about this problem of not pasteurizing only if you are in a farm far into the mountains, but in towns you can feel safe because laws about food safety are quite strict"}, {"username": "Giada Todaro", "comment_text": "Every single thing with Milk or eggs as ingredients is pasterurized. Our laws are pretty strictly about food so dont worry"}, {"username": "Frannie Kaplan", "comment_text": "Mill"}, {"username": "Ruth Akutu Maccarthy", "comment_text": "There's gelato without milk too especially the fruit flavoured ones. Ask before buying"}, {"username": "Vivien Paulik", "comment_text": "It is okay. They do not use raw milk."}, {"username": "Benedetta Vanni", "comment_text": "Milk is always pasteurized. As for eggs, i would stay away from home made tiramisu."}, {"username": "Marilyce Arbelo", "comment_text": "I’m allergic to milk and have found vegan gelato in multiple spots!"}]}, {"id": "2200071060391972", "text": "Buongiorno fellow travelers. Curious if anyone stopped off in Istanbul first from US then headed over to Italy..if so, would you please share your itinerary and any helpful hints for travel or planning. Looking to book quickly for a September trip. Ty.", "link": "facebook.com/groups/1373361046396315/permalink/2200071060391972/", "likes": 0, "comments": []}, {"id": "2200070420392036", "text": "Hi , we are travelling to Lezzeno , Lake Como area and was wondering if anyone could recommend some restaurants in that area ?", "link": "facebook.com/groups/1373361046396315/permalink/2200070420392036/", "likes": 0, "comments": [{"username": "Sophie Jackson", "comment_text": "Bump!"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2200065227059222", "text": "We are spending a day in Venice. What are your favorite things to do in Venice besides the gondola ride lol. ￼ty😊", "link": "facebook.com/groups/1373361046396315/permalink/2200065227059222/", "likes": 14, "comments": [{"username": "Pao Magnoler", "comment_text": "You can go to Fondaco dei Tedeschi, it's an amazing rooftop where you can see Venice, you can have \"aperitivo\". It's free and you can booked online."}, {"username": "Michael Samori", "comment_text": "Saint Marks\nWalk and explore and take the ferry to every stop and check out the area - Rialto bridge, academia etc"}, {"username": "Joanne Smith", "comment_text": "Do you really need someone to tell you what to do in Venice? Why are you actually bothering to go?"}, {"username": "Annette Mayer", "comment_text": "Getting lost, finding a quaint restaurant, gelato. Oh...take a lot of pictures."}, {"username": "Dee Jayawardena", "comment_text": "Boat ride to Burano is a must"}, {"username": "Stephen Lucy Morgan", "comment_text": "Thanks for asking this question !! I’m the same as you !! I’ve researched but Want to get the best out of the short time we are there !!! My first time to Italy and can’t wait xxx have great time"}, {"username": "Michelle Lynne", "comment_text": "Sunset Jazz Catamaran 😍"}, {"username": "Peter Apostolo", "comment_text": "Eat in the original ghetto in Jewish deli."}, {"username": "Ryan Schenian", "comment_text": "Cantina Do Mori for local Cicchetti and Gelateria Nico"}, {"username": "Jay Cabrera", "comment_text": "Eat and drink and just pick a direction to walk in"}, {"username": "Christie Grant", "comment_text": "Go to the square and watch a random sing Andre Bocceli and cry for hours ❤️"}, {"username": "Heidi Thorner", "comment_text": "Walk around and take it all in!"}, {"username": "Rachael Richardson", "comment_text": "Just walking around and getting lost, love arsenale area and the park"}, {"username": "Virginia Whitelaw", "comment_text": "Go online & book to go onto the roof of the Fondaco dei Tedeschi - a beautiful store near the Rialto bridge. The roof has a 360 deg view of Venice! It is amazing! Fabulous for photographs! The visit is free!"}, {"username": "Diana Schmitt Stansell", "comment_text": "https://\nrowvenice.org/\nHighly recommend!"}, {"username": "Frank Hunt", "comment_text": "Walking my backside off, coffee, shopping, eating, beers, arts, sightseeing, a ferry somewhere. Im worn out thinking about it."}, {"username": "Pamela Yoshioka-Diaz", "comment_text": "Accademia"}, {"username": "Arianna Reel Cook", "comment_text": "I loved getting lost over in the Jewish neighborhood.\nIt’s much quieter, and had a lot of cute little shops. There’s lots of little stops and monuments to learn some history if you like that kind of stuff."}, {"username": "Deborah Coram", "comment_text": "100% getting lost. Make sure you have google maps so you can find your way back. We came across Libreria Acqua Alta which is this incredible bookstore. Stay in an apartment with a canal view not a hotel - makes it so much more authentic and wonderful!"}, {"username": "Mary Gregory", "comment_text": "Take a water taxi to Burano 💕"}, {"username": "CiCi LeCanard", "comment_text": "CiCi LeCanard"}, {"username": "Dixie Kotylak", "comment_text": "Take pics on the canal! Don’t miss going up in the clock tower, it wasn’t expensive, and the views were AMAZING!!!"}, {"username": "Maria O'Callaghan", "comment_text": "Walk"}, {"username": "Judith Tobin", "comment_text": "Wander Canareggio area away from the hustle and bustle"}, {"username": "Jocelyn Pettitt", "comment_text": "Sit in the square. Order a 20 Euro Frappe or dessert and enjoy the good life for a couple hours. 🙌 Loved Venice!"}, {"username": "Cathy Hayes", "comment_text": "Eat then eat again then visit the duck shop,sooo cute"}, {"username": "Veronica Solimando-Lynch", "comment_text": "Just walk around the streets.\nYou never know what you will find."}, {"username": "Berit Irene", "comment_text": "Get away from crowded tourist attractions and into the locals, and just take it all in."}, {"username": "Claire Dowson", "comment_text": "Literally wander around using your phone map for bridges. So many hidden wonders."}, {"username": "Michelle Bergman Davis", "comment_text": "Skip the gondola ride, just wander the streets."}, {"username": "Meredith Williams", "comment_text": "wander 😍"}, {"username": "Chris Elliott", "comment_text": "Boat trip around the islands is good"}, {"username": "Joanne Atkin", "comment_text": "Eat. Lol"}, {"username": "Lisa Valdovinos", "comment_text": "Exploring. It’s so beautiful."}, {"username": "Lynn Dye Shell", "comment_text": "We did the secret treasures tour of the Doge Palace and it was really good. Also, just roam around and get lost. You will find amazing shops, restaurants, gelato, beautiful canals and bridges everywhere."}, {"username": "Pat Cray", "comment_text": "St. Marks’s Basillica\nDoges Palace\nBoat ride to Murano\nShopping"}, {"username": "Carol Taylor Tisdale", "comment_text": "One day??? Other than your gondola ride... do nothing but walk, explore, absorb. Don't waste precious time trying to go through the Duomo or Doge, etc. Stroll through San Marco Piazza, walk deep into the neighborhoods and eat at cafes in those areas (do NOT eat where someone is hawking out front or there are pages of photos of food!!!). Spend a little time walking through the 'other' side of the Grand Canal. The area around the Basilica S. Maria Gloriosa dei Frari is lovely. Eat gelato. Drink a cappuccino. Not sure how early you will arrive but the Rialto fish market is quite an experience."}, {"username": "Brian Johnson", "comment_text": "literally just being there. fwiw i've never been interested in the gondola ride"}, {"username": "Ruth Weinheimer Walsh", "comment_text": "St. Mark's Basilica, Florian Cafe, Libreria Alta Acqua"}, {"username": "Marie Cuzzi", "comment_text": "St Mark’s if you can go during the day have an expensive espresso so worth to me … go back at night it is magical"}, {"username": "Kristina Ruk", "comment_text": "Walking arround 😉It just have some magic those little streets.. I always imagine how it was like XIX-XVIII century all Europe came here for carnavals ;)"}, {"username": "David Davey", "comment_text": "People watching trying to identify nationality. Let me know if you can correctly identify who they are, contact me if you are young certain organization would like to contact you😀"}, {"username": "Nick Triano", "comment_text": "Guggenheim Guggenheim Guggenheim"}, {"username": "Patricia Siemiontkowski", "comment_text": "Get lost!"}]}, {"id": "2200065727059172", "text": "Hi, my husband and I are hiring a car from Treviso airport just north of Venice and I driving up to Villabassa. ￼I’d love some recommendations on the most scenic drive and hopefully we can also do a couple of short hikes enroute. We have all day. Many thanks.", "link": "facebook.com/groups/1373361046396315/permalink/2200065727059172/", "likes": 0, "comments": []}, {"id": "2200064650392613", "text": "Sorrento", "link": "facebook.com/groups/1373361046396315/permalink/2200064650392613/", "likes": 7, "comments": []}, {"id": "2200060713726340", "text": "My husband and I are having trouble finding lodging in Lake Como for September specifically Varenna, Bellago and Menaggio online through airbnb and hotels. Any recommendations?", "link": "facebook.com/groups/1373361046396315/permalink/2200060713726340/", "likes": 0, "comments": []}, {"id": "2200059600393118", "text": "Hi there. My husband and I are going to be staying in Positano for 4 nights late October and are wondering what would be the best way to see the whole of the Amalfi Coast - has anyone done a vesper tour or some way by boat? Any advice/recommendations will be most appreciated !! Thanks 😊", "link": "facebook.com/groups/1373361046396315/permalink/2200059600393118/", "likes": 0, "comments": []}, {"id": "2200056657060079", "text": "When's the best time to book the train (if at all) and the hotels if I'm going around end of September? Should I do it now or wait?", "link": "facebook.com/groups/1373361046396315/permalink/2200056657060079/", "likes": 0, "comments": [{"username": "Lisa Valdovinos", "comment_text": "I would book now."}, {"username": "Colleen Jennings", "comment_text": "If you know your plans won’t change I’d book now."}, {"username": "Casarine Temple", "comment_text": "Book now but be aware The Ryder Cup is September 25- October 1 so accommodations may be limited and / or more expensive."}]}, {"id": "2200025293729882", "text": "Hi,\nMy Husband and I are flying to Rome in April and we have been to Rome so we dont want to stay there, we want to go to Venice,Florence and the Amalfi Coast my question is should we go to Venice first and then Florence and the coast or do the coast first and then Florence and Venice,,we plan on spending 3 weeks.\nAny suggestions would be appreciated. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2200025293729882/", "likes": 7, "comments": [{"username": "Glenn Todd Webb", "comment_text": "I wouldn’t fly into Rome if I’m not staying there but since you are, go to Amalfi first on day of arrival. It’s pretty much a wasted travel day anyway."}, {"username": "Renae Larcus", "comment_text": "From Rome, go to Amalfi Coast first. Where are you flying out of to return home?"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "I would fly into Venice and out of Rome. Train your way from city to city."}, {"username": "Margo Desjardins", "comment_text": "I have to fly into and out of Rome that’s my problem…? So I’m booked for 5 days in Florence but I thought it might be easier to take the train from Rome to Venice and Stay 3 days and then Florence and the Amalfi coast and then stop somewhere else on the way back from the coast or do the opposite..go all the way to the coast and work our way back…"}, {"username": "Margo Desjardins", "comment_text": "thanks for the suggestions"}, {"username": "Brad Nelsen", "comment_text": "Coast last."}, {"username": "Graham Sherlock", "comment_text": "Do Cinque Terre, Lucca, Venice... Amalfi is so overrated"}, {"username": "Peach Panfili", "comment_text": "The season at places like The Amalfi Coast doesn’t properly open till about mid April, so take this into account when planning."}, {"username": "Janice Rea", "comment_text": "I would start north to south."}, {"username": "Amanda Richards", "comment_text": "Amalfi first then fast train to Florence and Venice (you could also stop in Bologna)"}, {"username": "Patricia Hyssop", "comment_text": "If you are interested in the Amalfi Coast you might want to consider Sorrento as your destination, going further into the coast will take up a day of travel either way and you can get to Capri from Sorrento , just a thought unless you want to do a private hire car, expensive but time saving. Once you get to Napoli there is a fast train to and from Rome so close to the airport."}, {"username": "Lucrezia Folger", "comment_text": "Either way, its all the same."}, {"username": "Julia Salmon", "comment_text": "We just did that exact trip. Really just picked where it was cheapest to fly in and out of. Started in Venice (layover in London) then train to Florence then train to Amalfi coast and then Rome was last stop in Italy."}]}, {"id": "2200052493727162", "text": "For a 5 night stay, Positano or Cinque Terre? As I have advanced cancer am after a base to stay & relax which has the most stunning views. Am young & fit but on this holiday don’t want to exhaust myself too much. After a bucket list experience. All suggestions/recommendations welcome - thank you 💗", "link": "facebook.com/groups/1373361046396315/permalink/2200052493727162/", "likes": 1, "comments": [{"username": "Huong Worley", "comment_text": "I have been to both but spent more time in CT so I voted for CT. Each village has its own beauty and you can also do a day trip to Portofino which is as amazing."}]}, {"id": "2200051680393910", "text": "Has anyone been on the underground Vatican Tour and do you recommend it?", "link": "facebook.com/groups/1373361046396315/permalink/2200051680393910/", "likes": 0, "comments": []}, {"id": "2200049630394115", "text": "Portofino is one of our cruise port stops. Should we spend day in Portofino only or take day trip to Cinque Terre? I welcome feedback on those two areas. 😁", "link": "facebook.com/groups/1373361046396315/permalink/2200049630394115/", "likes": 1, "comments": []}, {"id": "2200045913727820", "text": "Looking for a restaurant in bellagio with musicians\nplaying during dinner or on a terrace. Any suggestions?", "link": "facebook.com/groups/1373361046396315/permalink/2200045913727820/", "likes": 0, "comments": []}, {"id": "2200045797061165", "text": "Any recommendations on cooking schools/ classes and location of them for vacations/ think it would be fun to spend 3-5 days ! Any near train stations …", "link": "facebook.com/groups/1373361046396315/permalink/2200045797061165/", "likes": 1, "comments": [{"username": "Lisa Valdovinos", "comment_text": "There’s a cooking class we took in Florence. We made pizza and gelato. It was really fun. I think it was booked through Viator. I had a travel agent so I’m not entirely sure."}, {"username": "Whitney Meyers", "comment_text": "La Chiusa Tuscany great cooking classes"}, {"username": "Julie Hinton", "comment_text": "Whitney Meyers is absolutely right! La Chiusa is wonderful!! George and Linda, the owners/\nWhitney’s parents, are the best. Staff is terrific! Setting/views are breathtaking! You won’t be disappointed. I promise."}, {"username": "Margaret MacGillivray", "comment_text": "La chuisa Tuscany"}, {"username": "JeriLynne Clifford", "comment_text": "https://\ntuscanwomencook.\ncom/"}]}, {"id": "2200045597061185", "text": "What is the best tour of capri from sorrento to see thenisland and blue grotto", "link": "facebook.com/groups/1373361046396315/permalink/2200045597061185/", "likes": 0, "comments": [{"username": "Cindy Donaldson Fouts", "comment_text": "Also would like to know"}, {"username": "Billie Begley", "comment_text": "Contact Capitano Ago. They offer a\nBoat tour from Sorrento. They take you to the Blue Grotto , cruise around Capri. Give you 4 hours on Capri. Great day. They have different tours on their website."}]}, {"id": "2200039103728501", "text": "My 2 girl friends and I are traveling to Italy in October. We are wanting to explore Tuscany/Umbria regions, and would really like to rent a car for more flexibility, but I’m feeling really intimidated/worried about driving in Italy (not knowing any Italian). For those that have driven in this area, is it pretty easy to do and navigate, and doesआणखी Google Maps/Waze work there? Also, we are staying in Florence/Rome and wondered which city is the best place to rent a car out of? Should I book before we go, or is it something we can do when we get there? Any recommendations for rental car companies? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2200039103728501/", "likes": 1, "comments": [{"username": "Stephen Henn", "comment_text": "We used the Apple Maps on our iPhone and Waze from Amalfi Coast to Dolomites. Worked perfectly. I rent cars from the nearest airport and yes you should prebook. Video the outside of your car at pick up and drop off so you have proof of its condition should issues arise after you leave Italy. Watch for speed cameras, they’re everywhere. Print a copy of Italian road sign descriptions and familiarize yourself with the most common ones, especially ZTL zones."}, {"username": "John Selvaggio", "comment_text": "I rented a Tesla from hertz at Rome FCO and travelled all over Tuscany and Umbria. Nav system uses Google maps, so no issues. Tesla was cheaper than other cars and no problem finding Superchargers. Best was in Arezzo , convenient to Tuscany and Umbria. Be sure to stop in Pienza!"}, {"username": "Evelyn Trager Jose", "comment_text": "Don’t forget your international drivers license!"}, {"username": "Benedetta Vanni", "comment_text": "\"Does Google Maps work there?\" Hey, Italy is not Cuba!"}, {"username": "Sally Warren", "comment_text": "Google maps worked well for us last year. We spent a few days in Rome, then rented car from airport ( for easy driving), took it via Saturnia Terme to Greve in Chianti. Did day trips to both Siena and Firenze from there. I’m Firenze we parked outside town and walked in. In Siena we parked at a railway parking area and took bus in.\nDrove to Umbria, stayed in countryside. Day trip to Assisi. Drove to the Adriatic coast (tunnels through Appenines) and down to Ostuni, Puglia. From there day trips to Locorotondo, Alberobello; Lecce, S.Maria de Leuca. Drove to Matera, parked in public parking and walked in to old town.\nLeave car at Bari airport. Fly to Catania, Sicily. Hire car, drive Siracusa.\nAgrigento. Palermo. Taormina. Leave car Catania and fly to Napoli. Continue to Amalfi coast with private transfer $$$$\nFinish trip via ferry and train.\nDriving in the country or on the autostrada is easy. It’s parking and city or village driving which are scary.\n\nGoogle maps even kept us out of ZTL."}]}, {"id": "2200035930395485", "text": "Hi all. Will be in Italy in late September. We have 3 full days in Rome and debating on taking 1 of those and going to the Amalfi Coast. Also we are doing 2 days in Chinque Terre. Is it worth taking a whole day away from Rome? Thanks in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2200035930395485/", "likes": 0, "comments": [{"username": "Sandy Bradshaw Reich", "comment_text": "Amalfi Coast was one of our favorites💜"}]}]