[{"id": "2196790164053395", "text": "Ratana in Milan? I have a reservation on the patio July 28 at 7:00 pm. For those who have been there, good misting system and shade or too hot?", "link": "facebook.com/groups/1373361046396315/permalink/2196790164053395/", "likes": 0, "comments": []}, {"id": "2196789927386752", "text": "Is it possible to fly into Milan then travel to Venice, on to Florence, on to Rome, and then fly out of Naples all with in two weeks? Thoughts? Suggestions?", "link": "facebook.com/groups/1373361046396315/permalink/2196789927386752/", "likes": 2, "comments": [{"username": "Matthew Cawley", "comment_text": "Anything is poss but that many places you will lose a day from just all travel added together. If 2 weeks I would lower how many places. Venice to Florence expect be a fair time"}, {"username": "Joe-Linda Po Agustin", "comment_text": "Doable. Take fast trains if available."}, {"username": "Michael Galan", "comment_text": "There's visiting Italy and Experiencing Italy.\nDepends on which one you want."}, {"username": "Ken Lerch", "comment_text": "Of course it’s possible. Take away the travel times between venues and maybe you’ll have about 10 days left. Just don’t expect an in-depth experience in any of these great cities."}, {"username": "Glenn Todd Webb", "comment_text": "Doable but not recommended. 3-4 cities in 2 weeks"}, {"username": "Frank Hunt", "comment_text": "Research is your friend."}, {"username": "Tony Mancini", "comment_text": "If you want to check off those cities in your list it's doable. If you want to experience those cities way to much. You need 2 days in Venice and Florence needs 3 days as well as Rome. Milan two days .Naples 3 days. But that's a lot of hustle and bustle and not really a vacation too enjoy. You won't remember much . The point of these type of holidays is to create memories that can last a ?ifetime."}]}, {"id": "2196790334053378", "text": "Naples starting best way to do 6 day amalfie coast drive .bus or by sea ..any recommended", "link": "facebook.com/groups/1373361046396315/permalink/2196790334053378/", "likes": 0, "comments": []}, {"id": "2196792774053134", "text": "Advice please 🙂 I’m heading to Italy next month on a group tour with my Mom. One day is a “choice between”- sail to Capri, or spend the day in Positano. We chose Capri as we figured that would be easier to do pre-booked through the tour. However, we do not want to miss out on Positano. Our hotel is in Sorrento, am I correct the only way to get to Positano is by ferry? If so, is that something I pre-book? Mom and I will be venturing out on our own during a free afternoon. Thanks so much!", "link": "facebook.com/groups/1373361046396315/permalink/2196792774053134/", "likes": 9, "comments": [{"username": "Alex Kovacs", "comment_text": "The ferry is about 40 min each way! We pre booked on ferry hopper then went to the stand to get the tickets. You really only need to prebook about the day before and you also don’t need a full day in Positano in my option. Our sail around Capri was our favorite day of our 17 day Italy trip!"}, {"username": "Valerie Collanton", "comment_text": "There is also a bus from Sorrento to Amalfi that stops in Positano. Beautiful drive. Especially if you go all the way to Amalfi"}, {"username": "Susan Cantafio", "comment_text": "Enjoy we did a group tour and had the best time we are still friends with most of the people that were on that tour 10 years later we are heading back again in Sept and doing on our own but the tour was amazing"}, {"username": "Wendy Bey-Sottovia", "comment_text": "Capri!"}, {"username": "Jenny Payne", "comment_text": "Also by bus, I would bus from Sorrento to Positano then you can catch a ferry to Capri & also get a ferry back to Sorrento"}, {"username": "Kathy Pierce", "comment_text": "Positano is a short drive from Sorrento. Capri is about an hour ferry ride."}, {"username": "Danielle Marilyn", "comment_text": "I highly recommend positano! But stray away from the touristy areas of positano! Positano was a dream for me!"}, {"username": "Alex Kovacs", "comment_text": "Also - just do your research if you decide the bus route! I’ve heard horror stories so we avoided (did private driver one way) just due to crowds, lines, motion sickness etc!"}, {"username": "Amy Corday", "comment_text": "We hired a taxi driver to take us from Sorrento all along the Amalfi coast. The taxi company was recommended in a book but I can’t remember the name of the book or the taxi company. 😬 Our driver was great and stopped along the way for photo ops. Beware: Positano is ALL stairs. If that’s not a problem, it’s well worth the visit. Enjoy!"}, {"username": "LeAnn Bonkiewicz", "comment_text": "Private driver from Sorrento to Positano"}, {"username": "Alice Francesca", "comment_text": "August is peak tourist season...it will be overcrowded so altghout there are buses to Positano, take a ferry or boat"}, {"username": "Md Sujon", "comment_text": "I am from Bangladesh I want to go Italy but I don't have visa anyone can help me"}, {"username": "Dianne West", "comment_text": "I hate Positano overpriced over crowded and over.rated. Capri.is only marginally better. I'd hire a private boat and do a tour up.or down the coast yourself."}, {"username": "Katie Hardman", "comment_text": "Capri"}, {"username": "Angela DiGianni Nocera", "comment_text": "Don’t miss\nPositano\nTake\nTour by van or\nFerry"}]}, {"id": "2196792890719789", "text": "Has anyone stayed at Maison dell'Orologio in Rome? The address is via dei Banchi Nuovi 19.", "link": "facebook.com/groups/1373361046396315/permalink/2196792890719789/", "likes": 2, "comments": []}, {"id": "2196792897386455", "text": "Are tickets to Uffizi Gallery transferable? If so I have 2 tickets for Sept. 19th entry time 4:00-4:15 if anyone wants them! I don’t want them to go to waste. 😊", "link": "facebook.com/groups/1373361046396315/permalink/2196792897386455/", "likes": 0, "comments": []}, {"id": "2196793050719773", "text": "San Vito di Cadore, Dolomite", "link": "facebook.com/groups/1373361046396315/permalink/2196793050719773/", "likes": 3, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2196793367386408", "text": "In April, we are spending 2/3 days in Verona and plan to take a day trip to the Dolomites. In particular, we want to see Santa Magdalena and Lago de Brais. Is this reasonable, especially end of April?", "link": "facebook.com/groups/1373361046396315/permalink/2196793367386408/", "likes": 0, "comments": []}, {"id": "2196793670719711", "text": "Anyone have experience traveling here mid to late October? Looking for typical weather for packing ideas as I’m trying to do COO. ☺️ TIA!", "link": "facebook.com/groups/1373361046396315/permalink/2196793670719711/", "likes": 0, "comments": []}, {"id": "2196632940735784", "text": "Day 2 Trani- Giovinazzo (25 km)\nWant to explore Puglia off the beaten track? Head to the picturesque little town of Giovinazzo an hidden gem full of character and history, just 20 km from Bari. The best thing… आणखी to do in Giovinazzo is to explore the marina and the cobbled streets full of flowers! Get lost amongst the ancient architecture and soak in the authentic Apulian atmosphere!\nWhere to Stay: https://bit.ly/44Q4pdN\nS.Martin hotel is an ancient monastery (XII century) placed in the full center of the historical town of Giovinazzo. Great views of the town and the Adriatic sea on its rooftop that often had live music and cocktails at dusk.\nDay trip: Don't miss a visit to Matera and Altamura - book here: https://bit.ly/44TNyqA", "link": "facebook.com/groups/1373361046396315/permalink/2196632940735784/", "likes": 38, "comments": [{"username": "Maria Musumeci", "comment_text": "Oh we visited Giovinazzo & Molfetta. Such beautiful towns 😍"}, {"username": "Nicola Algerino", "comment_text": "Finalmente.. qualcuno che scopre anche altre parti d’Italia !!! 💪🏻"}]}, {"id": "2196636314068780", "text": "Three friends and I are starting to plan a trip to Italy for 2025. What is the best time to go if we want to avoid the extreme heat but still find it warm enough to swim? September? October? BTW-we’re all 55 plus and the heat is hard on us. Many thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2196636314068780/", "likes": 8, "comments": [{"username": "Billie Begley", "comment_text": "We were a group of 7 seniors. We went in September and found it awesome weather wise."}, {"username": "Sandra Shoffner", "comment_text": "I like going first or second week of June."}, {"username": "Jacquie Johnston", "comment_text": "I’ve been 5 times Oct was the best weather"}, {"username": "Andreia Dogaru", "comment_text": "September is perfect , sunny but not hot , good water temperature"}, {"username": "Elena Innocenti", "comment_text": "June or september"}, {"username": "Maria Musumeci", "comment_text": "Definitely September, we went 4 weeks each time in 2019 & 2022, perfect warm weather, sunny & blue skies all the way. But not too hot."}, {"username": "Dianne Ellis Patureau", "comment_text": "April was perfect last year!"}, {"username": "Giovanni Pianigiani", "comment_text": "June you're likely to find better weather (and longer days), in September the water temperature is likely to be warmer."}, {"username": "Lucia Evangelista", "comment_text": "Definitely Mid-September! It is relentless and unbearable to come to Italy from Mid- June to August. You wont be able to go sightseeing much due to the heat and people stay indoors from 11 til 7pm due to the heat. Forget going to the beach as well… And if you are menopausal, forget it."}, {"username": "Gina Spyker Fairfield", "comment_text": "We went for the second half of September into early October 2022. We had great weather (highs in the 70’s every day). I’m in my 50’s and heat sensitive too."}, {"username": "Andrea Stewart Graham", "comment_text": "We went early June and the weather was perfect highs in the upper 70s, low 80s. Busy but not crazy busy."}, {"username": "Suzanne Mills", "comment_text": "April or October"}, {"username": "Anne F. Brennan", "comment_text": "Thank you everyone for all of your advice! September sounds like it is a winner!"}]}, {"id": "2195948144137597", "text": "I have an upcoming trip to Italy august 14-27. I unfortunately did not book tickets to the Ferrari factory, Lamborghini, or Ducati tours for us. These were the only things my boys really want to do there otherआणखी than visit relatives. Has anyone had luck as a walk up and visiting these locations. Do you know if these places keep tickets available for walk-Ins?\nThanks in advance for your feedback.", "link": "facebook.com/groups/1373361046396315/permalink/2195948144137597/", "likes": 5, "comments": [{"username": "Gioia Clari", "comment_text": "If you buy them from the website, even the day before, you are sure that you'll be able to enter. Moreover, the Ducati factory seems to be closed in August, while the Ducati museum is closed from the 14 to the 20 of August and on Wednesday as well."}]}, {"id": "2196475984084813", "text": "I highly recommend Ferro Toso when in Murano. For €15 he will walk you through making your own piece of jewelry and it's really in about an hour. He was super nice and helpful and the whole family had a great time.\nhttps://www.ferrotoso.it/workshop", "link": "facebook.com/groups/1373361046396315/permalink/2196475984084813/", "likes": 154, "comments": [{"username": "Claire Seears", "comment_text": "Is there anything like this in Rome?"}, {"username": "Lorrie Sabatelli-Harris", "comment_text": "Ryane Sabatelli Garcia"}, {"username": "Aimee Murdock Ka", "comment_text": "I wish I had known about this, I’ll remember for next time. Great idea!"}, {"username": "Ann Romanowski", "comment_text": "That's amazing, we just got off Murano island and would have loved to do this."}, {"username": "Ashley Denise Baker", "comment_text": "Greg Baker I wish this was were we are going"}, {"username": "Pia Reilley Loughin", "comment_text": "Thank you for sharing!"}, {"username": "Monica Colontonio Macho", "comment_text": "Thank you!"}, {"username": "Trina Gray", "comment_text": "Brilliant- can’t wait for Murano in Oct.\nWere you on a tour or did you find this exploring on your own?"}, {"username": "Cheryl KBillk", "comment_text": "Did you need a reservation or just walk up?"}, {"username": "Cecile Geeurickx", "comment_text": "Ok, so now I need to go to Murano just for this !!! 😍"}, {"username": "Eric Maurer", "comment_text": "You can make reservations on their website but we also saw people just walk up. We had an 11 but got there early and started around 10. It was pretty laid back https://\nwww.ferrotoso.it\n/workshop"}, {"username": "Cynthia Sistler", "comment_text": "Very cool!"}, {"username": "Fiona Ferrar", "comment_text": "Trisha Franklyn"}, {"username": "Gay Robertson", "comment_text": "Cheryl Debenham"}, {"username": "Angie Bacon-Gonzalez", "comment_text": "Kathy Bacon"}, {"username": "Teresa Melanson", "comment_text": "Thank you! 😁"}, {"username": "Becki Williams Johnson", "comment_text": "Now that is an amazing idea!!! I really wish i had know about this!!"}, {"username": "Carly Maree", "comment_text": "Lyn Boyd"}, {"username": "Emma Selfe", "comment_text": "Sam Selfe"}, {"username": "Tracy Kelley", "comment_text": "Very cool!"}, {"username": "Nina Sutcliffe", "comment_text": "Kristy Price"}, {"username": "Nicola Blackshaw", "comment_text": "Shellie Rodriguez"}, {"username": "Clayton Webb", "comment_text": "Nicole Webb"}, {"username": "Stacey Box", "comment_text": "That is so cool!"}, {"username": "Adriana Sormani", "comment_text": "Wonderful!"}, {"username": "Kym Fabris", "comment_text": "Anna Fabris Michelle To"}, {"username": "BeeYoong Song", "comment_text": "Booked for our trip in August and so looking forward to it!! Thank you ."}, {"username": "Trace Barron", "comment_text": "Peter Barron"}, {"username": "Emily Garofalo", "comment_text": "Sandra Budonaro Garofalo"}]}, {"id": "2196487997416945", "text": "Who do you recommend for an all day boat tour from Amalfi for 4 people? There are so many.", "link": "facebook.com/groups/1373361046396315/permalink/2196487997416945/", "likes": 3, "comments": []}, {"id": "2196486510750427", "text": "Morning! Has anyone done the “eatwith”or dine with locals type of experience where you dine at a persons home when in Rome? I remember a post about someone’s experience but can’t find it though the search. Looking for recommendations for companies and/or specific tours. Thank you!", "link": "facebook.com/groups/1373361046396315/permalink/2196486510750427/", "likes": 0, "comments": [{"username": "Masu Wesen", "comment_text": "Following. I'd love to know too. Please let me know if you find something."}, {"username": "Hen Garrett", "comment_text": "Yes - we booked through Eat With. It was an amazing experience. Just look on their site and put in your dates and it will come up with options so you can pick the one that suits you best. There is everything from cocktail evenings to pasta making to hosted dining evenings."}, {"username": "Colin Ng", "comment_text": "Following"}, {"username": "Debbie Jones Schilling", "comment_text": "Sounds like a great authentic experience."}, {"username": "Michael Gillihan", "comment_text": "https://\nwww.eatwith.com/\nevents/28511"}]}, {"id": "2196489584083453", "text": "Arrived in Rome yesterday very hot 🔥. Today we hopped on the local bus into town then rode on the hop on hop off bus. Cheap and easy to get around.", "link": "facebook.com/groups/1373361046396315/permalink/2196489584083453/", "likes": 43, "comments": [{"username": "Agne Krause", "comment_text": "How did you survive the heat? Is that bus open roof or conditioned?"}, {"username": "Maria Musumeci", "comment_text": "Oh we did the hop on hop off bus too, it was great!"}, {"username": "Geetha Rama", "comment_text": "Can I get link how to book the hop on hop off bus? Will it cover all the attractions in Rome? I'm travelling in September. Kindly advice, tq"}, {"username": "Toni Richard Trocquet", "comment_text": "Which one did your take?\nThere are so many! Reading reviews no w!"}]}, {"id": "2196490860749992", "text": "I am in Italy. Where do I buy a bus pass for multiple days?", "link": "facebook.com/groups/1373361046396315/permalink/2196490860749992/", "likes": 3, "comments": [{"username": "Vītola Endija", "comment_text": "In the shops 😎"}, {"username": "Marilene Sagaz Lanza", "comment_text": "Tabacarias."}, {"username": "Cecilia Christine Costantini", "comment_text": "In Rome, if you are talking about city buses, you can also get them from machines that are at Metro stops. You can use the bus pass also on the Metro, trams and the \"train\" to Ostia"}, {"username": "Simone Pfenninger", "comment_text": "Tabaccheria"}, {"username": "Vincenzo D'Angelillo", "comment_text": "Tobbaconist"}, {"username": "Joe Smihula", "comment_text": "If you go back to the building there’s a sign that says bud passes. You can buy them there."}, {"username": "Alan Simpson", "comment_text": "Bus station maybe"}, {"username": "Vincenzo D'Angelillo", "comment_text": "can buy a bus ticket from a \"cartoleria,\" which is a shop where magazines and newspapers are sold. Most train and bus stations in Italy have cartoleria shops. You can also buy bus tickets in some \"tabaccheria\" shops. A tabaccheria is a tobacco shop found throghout Italian towns and cities."}, {"username": "Enrico Lecce", "comment_text": "Any cafes"}, {"username": "Kirsten Abrams", "comment_text": "Tobacconists"}, {"username": "Lashawn Bennett", "comment_text": "Check your hotel front desk."}, {"username": "John Green", "comment_text": "We have been getting them at the metro station, quick and easy"}, {"username": "Steve Savva", "comment_text": "Tabaccheria should selling newspapers etc. it’s straight forward"}]}, {"id": "2196493157416429", "text": "A must-see in Milan, Italy. Milan Cathedral, Italy is a country full of history and culture, and Milan is one of the largest cities in Italy. It is also a dynamic and charming tourist destination. Milanआणखी Cathedral: This Gothic building is a landmark building in Milan, with spectacular works of art and observation deck, overlooking the whole city.", "link": "facebook.com/groups/1373361046396315/permalink/2196493157416429/", "likes": 12, "comments": []}, {"id": "2196494434082968", "text": "Ciao everyone! We are going to be attending the Bocelli concert on the 29th of July and in Lajatico (Tuscany) and wondering the best way to get there from Florence? Thanks in advance for any suggestions!", "link": "facebook.com/groups/1373361046396315/permalink/2196494434082968/", "likes": 4, "comments": [{"username": "Simone Pfenninger", "comment_text": "That's pretty far away - have a look at Rome2 Rio\nRent a car or hire a taxi"}]}, {"id": "2196495644082847", "text": "We’re planning a day trip by train tomorrow from Florence to either Livorno or Viareggio, to spend some time by the beach and get some relief from the city heat. Which destination would be best if travelling by train, without too much extra travel from the station to reach the sea? Any recommendations for particular beaches, or particular banos that provide umbrellas, decent food etc? Do the banos also offer beach towels?", "link": "facebook.com/groups/1373361046396315/permalink/2196495644082847/", "likes": 0, "comments": []}, {"id": "2196502394082172", "text": "Just wondering does most people take photos on their phones now instead of cameras??", "link": "facebook.com/groups/1373361046396315/permalink/2196502394082172/", "likes": 82, "comments": [{"username": "Anita Lawrence Mundy", "comment_text": "Yes, take photos more than take calls!"}, {"username": "Kristian Strebør", "comment_text": "No I use a mirrorless camera as well as my phone"}, {"username": "Ellen Edmonds-Wilson", "comment_text": "Yes."}, {"username": "Anthony LoBue", "comment_text": "Light vs bulky and heavy"}, {"username": "Paul Anderson", "comment_text": "How much do you want to carry?"}, {"username": "Catherine Rawcliffe", "comment_text": "At the moment I do - but only because my DSLR is playing up. I still prefer the flexibility of using a camera with different lenses!"}, {"username": "Nandita Goswami", "comment_text": "Yes"}, {"username": "Pam Studstill Stump", "comment_text": "I took both my camera with me to Scotland last year and ended up taking the same photos with my phone and camera. Just visited France and only used my iPhone 14. Great pictures, super easy and it was certainly nice not lugging all of the heavy equipment with me."}, {"username": "Jim Hinckley", "comment_text": "11 days in Ireland and only used my iPhone"}, {"username": "Janet Kenyon", "comment_text": "In this heatwave my phone as stopped working until it cools down"}, {"username": "Jeff McLellan", "comment_text": "I gave up on my SLR a few years ago. Have an iPhone 14 Pro now and it has been great."}, {"username": "Jeff McLellan", "comment_text": "You can always practice at home to get better at and more creative with your phone camera. I used it on selfie mode to take pictures of church ceilings and also of buildings using timer. The effect of the camera being right down on the ground is pretty cool."}, {"username": "Jeff McLellan", "comment_text": "I did buy this Manfrotto tripod which is the best iPhone tripod I have ever used. Unlike the tiny cheap ones this is super steady and has not failed me once. I have also used it to hold phone more comfortably for selfies and great for low light night shots."}, {"username": "Katia Taam", "comment_text": "Yes. I think I don't remember the last time I've used a camera."}, {"username": "Colleen Church", "comment_text": "Yes"}, {"username": "Edmond Nolan", "comment_text": "Phone way easier to carry"}, {"username": "John Selvaggio", "comment_text": "From my car window while driving thru Tuscany 3 weeks ago, using iPhone 14ProMax"}, {"username": "Xrys Teena", "comment_text": "Yes. I took great photos on my Samsung"}, {"username": "Sherri Leis Dillavou", "comment_text": "Yes"}, {"username": "Debbie Potter", "comment_text": "I would do both"}, {"username": "Elio Cerrone", "comment_text": "Shawn hannatie salary"}, {"username": "Sara Kyle Hargett", "comment_text": "I do"}, {"username": "Carol J Norton-Guerra", "comment_text": "Yup 😁"}, {"username": "निनावी सहभागी", "comment_text": "Thank you everyone, I went out and got an iPhone 14 pro max."}, {"username": "Carla Gutierrez", "comment_text": "Yes. I had to photograph someone to model a dress for me but I can’t afford to buy a camera where I can manipulate a light. So I used my iPhone 10 instead and bought a $12 preset for it."}, {"username": "Berta Havens", "comment_text": "Looks that way"}, {"username": "Karen Schwesinger", "comment_text": "Positano! IPhone 12"}, {"username": "Gary Rosensteel", "comment_text": "Anyone under 25, “What’s a camera?”"}, {"username": "Jacquie Johnston", "comment_text": "i’ve used every kind of 35 mm camera. You can imagine lugged them all over the world. ￼ I took this photo with my iPhone 13+ pro in Venice in October 2022 and it’s an 11 x 14 canvas. I don’t have any qualms about using the quality camera on my iPhone."}, {"username": "Amanda Parnell", "comment_text": "I've done plenty of trips just using my phone and the photos are great, however I recently printed some to start a scrapbook and althought they are still good, you can see the lack in quality, they also dont print out properly so there is a lot of editing to get the whole picture in. Im heading off again in September so this time im taking my small canon powershot, I'll still use my phone as well but for decent shots I'll be trying out the camera. If you aren't interested in printing them, I'd say stick to your phone (if its a good one) less to carry."}, {"username": "Cindi Lachney", "comment_text": "Took this with iPhone 12 Pro Max but looking to upgrade to 14"}, {"username": "Behindthelens Skeeter", "comment_text": "Both"}, {"username": "Behindthelens Skeeter", "comment_text": "Behindthelens Skeeter"}, {"username": "Behindthelens Skeeter", "comment_text": "Behindthelens Skeeter"}, {"username": "Pearl Lucero", "comment_text": "Yes. I use to carry a phone too, but it got to cumbersome and the photos came out just as good."}, {"username": "Jayde Byers", "comment_text": "Just the iPhone 🥰"}, {"username": "Paige Montecalvo", "comment_text": "Just came here to say… I bought a $500 cannon. Ended up getting better photos with the new iPhone and I gave up trying to use it and it ended up just taking up space in my bag 😏 I had intended to take a photography class for dummies before I went but didn’t have time to and I just couldn’t get the photos to turn out great on the camera."}, {"username": "Amanda Ying Hwang", "comment_text": "Yes. iPhone 12"}, {"username": "Angelika Pfeifer Mitchell", "comment_text": "I took my mirror less and one lens with me to France this summer and barely used it. I basically used my phone for everything. I wont bring my big camera to Italy next year."}, {"username": "Mary Iuor", "comment_text": "Phones easier to carry."}, {"username": "Kim Aranha", "comment_text": "I haven’t used a camera in years"}, {"username": "Kathy Wilkey Smith", "comment_text": "Just because less to carry."}, {"username": "Kim Aranha", "comment_text": "iPhone photo of Via Giulia in Rome"}, {"username": "Kim Aranha", "comment_text": "iPhone 14"}, {"username": "Kelly Bailey", "comment_text": "Yes! I was going to take my big camera, but I’m so glad that I didn’t. between the heat and the amount of people, your cell phone will be much easier."}, {"username": "Dee Davis", "comment_text": "Yup. At least for me. It is a pain to carry a heavy camera"}, {"username": "Teresa Heran", "comment_text": "You’ll see both"}, {"username": "Jennifer Dinshaw Schock", "comment_text": "I use both but I prefer my DSLR. I have a regular lens and a long lens. Nothing beats that long lens and I prefer the DSLR burst mode for action shots. My iPhone is good but I use it more for doing videos on a trip."}, {"username": "Sougata Das", "comment_text": "I used my iPhone 14 Pro and DSLR Nikon 610 80-300 mm lens during my trip to Canadian Rockies this month. Closeup photos or portraits use the iPhone. Distant pictures use the Nikon."}, {"username": "Frederick Rühr", "comment_text": "I don’t. I schlep a camera around."}, {"username": "Anthony Parisotti", "comment_text": "Note 20 ultra"}, {"username": "Teresa Bliss", "comment_text": "Kinda sad."}, {"username": "Thomas Tomlins", "comment_text": "Well with the level of quality that my phone takes, yes"}, {"username": "Cinzia Wong", "comment_text": "Wow was JUST researching that today. Want a very lightweight compact 35 mm digital."}, {"username": "Jen Alexitch Rachow", "comment_text": "I did my last trip. I even bought an expensive pocket sized point and shoot camera because I wanted yo take scenic photos in Scotland and I barely used it🙄. My iPhone photos turned out amazing."}, {"username": "Tricia Bean Scott", "comment_text": "For travel purposes, I got a point and shoot that shoots in RAW format vs. carrying my bulky DSLR. Pix quality is still better on a camera vs. a phone IMO."}, {"username": "Lyn Evans", "comment_text": "Does anyone know if you have an e sim in your 11 pro I phone ( I’m looking at holafly) if there’s an option to use wifi when at your hotel to upload your pics to the i cloud without putting roaming back onto your phone with your normal telco Sim?"}, {"username": "Bern Louna Proctor", "comment_text": "I’m definitely ditching my iPhone for a Samsung when I go travelling. The photos don’t compare. My daughters pics on her Samsung are camera quality"}, {"username": "Belinda Herrera Lopez", "comment_text": "I used my iPhone 14 pro max."}, {"username": "Jill Medrano Casey", "comment_text": "Yes"}, {"username": "Catherine Mai An", "comment_text": "Yep!"}, {"username": "John D. Truty", "comment_text": "Really torn— iPhone 14 pro and/or Fuji X-T30 with XF 27 mm pancake and 7O-300 telephoto…. May bring both but really most daytime tours and on boat with iPhone will do just fine… evening in town walk around and maybe distance shots from the boat…. Leaning towards just iPhone— got a month to decide…."}, {"username": "Jessica Nichols", "comment_text": "I do. So when it’s time to upgrade my iPhone, I always get the best one. I justify it to myself because of the better camera 😂. But seriously, that’s also one less thing I have to pack"}, {"username": "Julia Rajska", "comment_text": "I only used my IPhone 14pro"}, {"username": "Kit Nader", "comment_text": "Yes always on my phone"}, {"username": "Kimberly Lewis", "comment_text": "Yes."}, {"username": "Chelsea Hunt", "comment_text": "Yeap! Took this (and so many other favorites) with my phone. I decided that my DSLR was too bulky and not worth bringing on this trip for my beginner level of skill."}, {"username": "Norman Preece", "comment_text": "The trouble with cameras on phones in bright sunlight they are useless"}, {"username": "Jaime Clare", "comment_text": "I only use my Samsung S21 Ultra and love all the pictures I've taken this trip. ❤️"}, {"username": "Karin Harmsen", "comment_text": "Yes!"}, {"username": "Stephen Thomas", "comment_text": "iPhone 14"}, {"username": "Leah Razuri", "comment_text": "Not professional photographers."}, {"username": "Rick Salazar", "comment_text": "I am a professional photographer as much as I love taking my camera and all my lens but not having that extra weight is great. I have a iPhone 14 Pro max and it does the job done and happy with it."}, {"username": "Dayna Scinto", "comment_text": "Yes"}, {"username": "Nancy Curmi", "comment_text": "Ali Sha"}, {"username": "Desiree Dube", "comment_text": "I do both 🙂 I think it depends on what you want to use the photos for. If you want high quality photos that will be used for larger prints, on websites, etc. you’ll want to bring your camera. If you’re just taking photos for social media or sharing with family/friends and don’t need super high quality files for your own preferences/\npurposes, you’re probably good just using your phone. (Disclaimer: by quality I mean the resolution of the files, quality loss due to file compression, etc.; not saying phone pictures are bad)"}, {"username": "Sonia Smith", "comment_text": "Absolutely."}, {"username": "Jim Walker", "comment_text": "I Phone 14 Pro"}, {"username": "Connie Dennis", "comment_text": "Samsung s21 plus,\nWhy drag a camera"}, {"username": "Rebekah Krieger", "comment_text": "I do - I don’t feel the need to use a camera since I’m not a photographer"}, {"username": "Barbara Bastianini", "comment_text": "I use my phone for photos of friends and my camera for landscape, wildlife, art, and architecture."}, {"username": "Cheryl Rockhold Rader", "comment_text": "Hubs and I found this very helpful and learned so many tricks.\n\nhttps://\nsecure.iphonepho\ntographyschool.\ncom/\niphone-photo-aca\ndemy?utm_campai\ngn=Search_Keywo\nrds&utm_medium=\nppc&utm_source=\nGA&utm_content=\nLikely_Misspell\ns&utm_term=Like\nly_Misspells&gc\nlid=CjwKCAjwtuO\nlBhBREiwA7agf1q\nBth-aqO4w9zVnTs\nwI9kqdbemI6-udg\nQH3PDQlk-3aQwmq\nhGQI9vxoCNvYQAv\nD_BwE"}, {"username": "Jona Guðmundsdottir", "comment_text": "Yes, most ppl do."}, {"username": "Michelle D'Elisiis", "comment_text": "I’ve been debating whether to use my phone or my camera. I think I will bring both because I’ll wish I brought my camera if I don’t. (Guess it’s a female thing? lol)"}, {"username": "Alexandra A Welker", "comment_text": "I haven't used my DSLR in years, I just use my phone."}, {"username": "He Ju", "comment_text": "No, no they don't"}, {"username": "Jennifer Tarin", "comment_text": "I'm a photographer and do both. I have a Nikon dslr that goes everywhere with me (I have literal nightmares about forgetting it when I'm on vacation and having someone overnight it to me). Is it bulky and awkward? Yes. Would I do anything different? No. Phone cameras just can't do what my dslr can"}, {"username": "Annette Mayer", "comment_text": "I do"}, {"username": "Ann Barrett", "comment_text": "Phone"}, {"username": "Annette Mayer", "comment_text": "Sansung S10+ today"}, {"username": "Rebecca Donofrio", "comment_text": "Yes\nOne less piece of property to keep track of LOL"}, {"username": "Sacha Layos", "comment_text": "I did both. I use a Canon 5D Mkiii so I worried about the weight of it, but I also knew I would kick myself if I didn’t take it for my first trip to all of these amazingly scenic countries."}, {"username": "Bassam N Ziadat", "comment_text": "What ever you capture the photos with its always will be amazing"}, {"username": "Vasthi Cheddar", "comment_text": "Samsung Galaxy S22 ultra"}, {"username": "Francine Eaves-Ranft", "comment_text": "We do"}, {"username": "Dana Golden", "comment_text": "Yes"}, {"username": "Claudie Leduc", "comment_text": "iPhone 13 Pro ✨"}, {"username": "Jacquie Johnston", "comment_text": "I stopped using my 35 mm canon XL after I got my phone 8+ and now I shot this with the iPhone 13+ Pro."}, {"username": "Jacquie Johnston", "comment_text": "Jacquie Johnston"}, {"username": "Joe Laricchia", "comment_text": "I have a great Digital Camera took it the first time and used both my phone and camera Both took great pictures. The last time I left the digital at home and just used my phone Took about 900 photos and all came out great. Some are framed and hanging on our walls"}, {"username": "Jacquie Johnston", "comment_text": "I shot this in Venice, October 2022 with my iPhone 13+ pro dont use my 35mm cameras anymore, ￼ Ive carried those cameras all over the world. This photo is a 11x14 canvas frame"}, {"username": "Eric Maurer", "comment_text": "I did take someone's picture with a one time use camera yesterday 😁, but most are phones"}, {"username": "Robert Pratali", "comment_text": "We’re going next year and I plan to bring my DSLR with several memory chips."}, {"username": "Mercedes Rotolo", "comment_text": "No , we have an amazing camera from Berger Bros. In Syosset. Yes you can take photos on your phone - but honestly there is nothing like a real photo from an actual camera ."}, {"username": "Mercedes Rotolo", "comment_text": "And you will see people w amazing cameras around their necks . Again yes you can use your phone, I’m not say that you can’t but you will see people w actual mm cameras .enjoy !! The photos will be fabulous no matter how you take them ."}, {"username": "Dorian Ziedonis", "comment_text": "Unfortunately yes. Best to stick with real camera, not phone. Camera far better. But, too easy with phone. 😉\n\nMy go-to is a Leica d-lux6."}, {"username": "Theresa Hussmann Rasmussen", "comment_text": "Definitely my camera!"}, {"username": "Stephanie Garofalo", "comment_text": "Sure seems that way."}, {"username": "Ken Lerch", "comment_text": "Let me put it this way, “most” of those who took pics before there were phone cameras and those who’s goal that was y too have more than postcard snapshots, still use cameras. All those who weren’t either now use phones, and there’s more of them."}, {"username": "Alan Simpson", "comment_text": "What a stupid question are you real what did you post this question on here with"}, {"username": "Paul Distefano", "comment_text": "Unless a professional.ph\notographer I say yes. I have an expensive Canon camera and hardly use it."}, {"username": "Amy Riley", "comment_text": "Yes for my family"}, {"username": "Sandra Kingsley", "comment_text": "I always take my big camera! Only use phone as a last resort!"}, {"username": "Peggy Frasca Prichard", "comment_text": "Does?"}, {"username": "Patti Porter", "comment_text": "I do"}, {"username": "Lisa Amellio-Chavez", "comment_text": "Went to Scotland earlier this year. I opted to leave my camera at home. I used my iPhone 14 pro & couldn’t be happier with the pics I took!"}, {"username": "Sara Hackett", "comment_text": "I bought a fancy camera and used a phone. I stuck out with the fancy camera. The beggars only approached me, not my friend."}, {"username": "Ledia Martinez", "comment_text": "Yes"}, {"username": "Katrina Martin", "comment_text": "Always use my phone. Samsung S22 ultra 👍"}, {"username": "Anthony Sperduti", "comment_text": "Yes"}]}, {"id": "2196503757415369", "text": "Another question about the Trains. I am heading from Monterosso to Florence. There is an option with 2 changes...one being in Pisa. Are you able to get off and explore Pisa and then carry onto Florence or do you have to stick to the times booked?", "link": "facebook.com/groups/1373361046396315/permalink/2196503757415369/", "likes": 2, "comments": [{"username": "Adriana Carbone-Cerasoli", "comment_text": "If you want to explore Pisa - book the second train at a later time\nOtherwise you need to be on that train for the time you booked\n\nAnd the Tower of Pisa is a good walking distance from the train station …."}, {"username": "Jeanette Petrie", "comment_text": "Just be careful. I got on the wrong train when I was in Cinque Terre. Easy to get confused with Italian announcements. I would go non stop next time."}]}, {"id": "2196506987415046", "text": "Best day trips from Milan?", "link": "facebook.com/groups/1373361046396315/permalink/2196506987415046/", "likes": 9, "comments": [{"username": "Wahab Sidharta", "comment_text": "Getyourguide app"}, {"username": "Muhamed El Sayed", "comment_text": "Varena .. bellagio .. como\nLugano"}, {"username": "Kadie Mcgugan", "comment_text": "Cameron Holliday"}, {"username": "Hana Komic", "comment_text": "I really liked Bergamo."}, {"username": "Tammy MacBride", "comment_text": "Stresa."}, {"username": "Elina Grigoryan", "comment_text": "Varenna and Bellagio ❤️"}, {"username": "Sandra Ashurst", "comment_text": "Sirmione lake garda"}, {"username": "Virgz Van Møøre", "comment_text": "Como"}, {"username": "Yolanda Mena", "comment_text": "Bergamo, Verona. Lake Como, Sirmione, Lake Garda, Bernina express"}, {"username": "Renae Larcus", "comment_text": "Bergamo. Varenna. Sirmione"}, {"username": "Stephanie Garofalo", "comment_text": "All good suggestions. I’d make the trip to Lake Como and visit Varenna, one of the most picturesque towns on the lake. Easy to get there and you won’t be disappointed."}, {"username": "Yvette Jasmine Lopez", "comment_text": "Bergamo and lake Como"}, {"username": "Alice Putaro", "comment_text": "Pavia and Oltrepò Pavese for wines!"}, {"username": "Demi Coronel", "comment_text": "Bernina express and lake como."}, {"username": "Annette Fordyce", "comment_text": "We loved Stresa and the Borromean Islands. It wasn’t crowded and very beautiful. In May this year we took a train from Milan to Varenna and then a ferry to Bellagio- it was beautiful and I’m glad we went, but it was so crowded. Bergamo looks lovely."}, {"username": "Nicole Wild", "comment_text": "Lugano (Switzerland)"}, {"username": "Louise Desnoyers", "comment_text": "Bergamo!"}, {"username": "Esa Mali", "comment_text": "Esa Mali"}, {"username": "Martha Kosir Stankewicz", "comment_text": "Like Como then Bellagio"}, {"username": "Reham Botros Ghali", "comment_text": "Florence"}, {"username": "Stefano Bressanelli", "comment_text": "Lago Maggiore/ lago d'Orta/ lago di Iseo/"}, {"username": "Pietro Di Sorbo", "comment_text": "Many suggested to you the lakes of Como, Garda, Iseo and Maggiore and cities like, Bergamo, Pavia and so on.\nThese are amazing places and if you will take one of them you certenly won't disappointed.\nBut I would suggest to you another city really nice that no one suggested to you (honestly I don't know why) this city Turin.\nIs at about one hour train hour from Milano.\nThere're a lot to see,the Royal residences of Turin and Piemonte a part of UNESCO heritage, the Egypt museum is the oldest in the world about Nilotic civilization, the Mole Antonelliana, Parco Valentino, Sindone chapel and so on, and its center is walkable and enjoyable (I think not too crowded too).\nTake a look on web."}, {"username": "Liz Ariar", "comment_text": "We stayed 5 days in Milan and took a day trip to Verona, it was nice. Then the next day we went to lake como in Belaggio. Another day we spent in Bologna. All by regional train. 2 days we spent in Milan walking around in the Doumo area and shopping."}, {"username": "Sadeka G. Tomaneng", "comment_text": "Verona and Venice"}, {"username": "Johanna Ting", "comment_text": "Interlaken"}, {"username": "Charmaine Tetkoskie", "comment_text": "Lake Cuomo"}, {"username": "Sheila Grant", "comment_text": "Cinque Terre"}, {"username": "K M Uí Fhionnaláin", "comment_text": "Bergamo is beautiful."}, {"username": "Tatiana Kitlak", "comment_text": "Is it make sense to rent a car to make all day trips from Milan?"}, {"username": "Alex Hicks", "comment_text": "Lake Como! ✨"}, {"username": "Mariya Terzieva", "comment_text": "Como!"}, {"username": "Cheryl Theunissen", "comment_text": "Bernina express, lake Como"}, {"username": "Gioia Clari", "comment_text": "If you move with trains and public transport, Pavia and the Certosa monastery or Bergamo and its Città Alta I'd say. Brescia is small but nice as well. Como is nice but very crowded at the moment"}, {"username": "Yelena Shteynvil", "comment_text": "1. Varenna, lake Como, from there boat to Bellagio. 2. Stresa, lake Maggiore, from there boat to Borromean islands. 3. Verona, train."}, {"username": "Erin McNulty", "comment_text": "We are doing two. One to Venice and one to lake como/ lake Maggiore"}, {"username": "Marina Kerman Garbarskiy", "comment_text": "Olga Kazachkova-Fayb\nusovich Karina Staro"}]}, {"id": "2196504994081912", "text": "We are traveling from the ￼Rome airport, Leonardo da Vinci, and need to get to Naples. What train should I take? And does it leave directly from the airport. If so, what is the name of the station that it departs from at the airport.", "link": "facebook.com/groups/1373361046396315/permalink/2196504994081912/", "likes": 0, "comments": [{"username": "Giuseppe Placi", "comment_text": "From Rome you need to reach Termini station.\nFrom Termini a train to Naples"}, {"username": "Cecilia Christine Costantini", "comment_text": "There are direct buses from the airport to Naples https://\nwww.flixbus.it/\n?departureCity=1\n05d8c7f-86c9-43\n0f-85ea-5b502d2\nc21bc&arrivalCi\nty=40e096c1-864\n6-11e6-9066-549\nf350fcb0c&rideD\nate=24.08.2023&\nadult=1"}]}, {"id": "2196509224081489", "text": "Has anyone seen these anywhere in Italy? I’m on the hunt! Didn’t find them in Milan. Checking Venice. I’ll be in Ravena, Rome, Florence, Naples, Pisa, and a couple towns in between. TIA!", "link": "facebook.com/groups/1373361046396315/permalink/2196509224081489/", "likes": 2, "comments": [{"username": "Monica Colontonio Macho", "comment_text": "I don’t know where you can get them in Italy, but I found them on amazon."}, {"username": "Sigrid Cormier", "comment_text": "I googled this candy and you can buy retail in Italy. If you google you’ll find a location that may work for you."}, {"username": "Danielle Johnston", "comment_text": "They had them in a dish in the lobby of our hotel lol"}, {"username": "Rachelle Ethington", "comment_text": "All over Amazon."}]}, {"id": "2196510540748024", "text": "We leave in FIVE DAYS!! I’m so excited, just finishing up some last minute plans/reservations. I know I don’t need to pre-book a gondolier but I have one that was recommended to me that I’d like to reserve.आणखी What time of day would you suggest for the best ride/pictures?? Sunset? morning?\nThank you!!\n(Picture so my post doesn’t get lost!)", "link": "facebook.com/groups/1373361046396315/permalink/2196510540748024/", "likes": 24, "comments": [{"username": "Adriana Carbone-Cerasoli", "comment_text": "Close to Sunset 🙂"}, {"username": "Tracy Piko Lawniczak", "comment_text": "We are currently in Venice and walking back to our Airbnb and we saw them and said what a perfect time for a ride. It was 8pm."}, {"username": "Dianne Giordano", "comment_text": "Have a great trip. Italy is beautiful. We loved it all."}, {"username": "Nicole Condemi", "comment_text": "FYI, 7am (I think) to 7 pm is €80, then after 7pm it €100, if money is a consideration. We hopped off our gondoliere at 655, so had paid the €80, but I could hear them requesting the €100 to the people next in line.\n\nCertainly was an experience that I’d always wanted to do , so just take it in an enjoy!"}, {"username": "Cara-lyn Alpin", "comment_text": "I read on another post sometime ago to look for Campo S. Sofia ( bright orange building) for cheaper Gondala rides"}, {"username": "Angie Martin Barber", "comment_text": "Hi can you share who was recommended? We will be there in September and would love to do the same."}, {"username": "Irene Beck", "comment_text": "Generally 80 to 100 Euro depending on time of day plus gratuity."}, {"username": "Tricia Brittingham Neff", "comment_text": "Booked for sunset. Thank you ✅"}]}, {"id": "2196519767413768", "text": "We are in the midst of planning our trip to Italy for next October. Our first stop will be Rome then off to Florence and maybe Venice, but I am seeing mixed reviews about Venice. Would Naples be a better choice?", "link": "facebook.com/groups/1373361046396315/permalink/2196519767413768/", "likes": 15, "comments": [{"username": "Lee Mckay", "comment_text": "Venice was brilliant absolutely love it"}, {"username": "Rhonda Russell", "comment_text": "I spent 2 weeks in Venice last year, loved every minute. Highly recommend visiting Torcello while you’re there"}, {"username": "TR Malo", "comment_text": "Skip Naples go to Amalfi coast-positano"}, {"username": "Luisa Maureen Sanchez Daluyaya", "comment_text": "Venice is so beautiful. Don’t miss it!"}, {"username": "Helena Azevedo", "comment_text": "Venice 😍🎶🥰\nWe loved Hotel Rialto.\nMarvelous location, and it is a bonus treat to have the breakfast buffet outside❤️"}, {"username": "Joyce Studman Wishner", "comment_text": "Stay with Venice and go to Burano.\nStay away from Naples"}, {"username": "Cathy McDonald", "comment_text": "Love venice but the real venice comes out after dark and when all th tourists have left so make sure you stay there and not off island"}, {"username": "Marie Montafia", "comment_text": "Definitely visit Venice. It’s so unique and absolutely beautiful!"}, {"username": "Elyssa Gross", "comment_text": "We loved Venice. So beautiful."}, {"username": "Sarah Williams", "comment_text": "Venice is other worldly. It’ll be beautiful in October. Loose yourself in the back streets and if you can, have cocktails at the rooftop bar if the Hotel Danielle overlooking the bay. And DO NOT get the bus from the airport. Take the waterbus and watch the islands of Venice appear…..\nNaples has a charm but Venice blows it out of the water!"}, {"username": "Dayna Steinberg Cioffi", "comment_text": "Venice is so charming and magical. Would absolutely choose it!"}, {"username": "Jenny Frank", "comment_text": "Venice is a must"}, {"username": "Jules Blumke", "comment_text": "Venice is a must. Everyone should visit there at least once in their life."}, {"username": "Patrizia D'Arcangelo", "comment_text": "Visit Venice"}, {"username": "Louise Coertze", "comment_text": "Venice best we just come back"}, {"username": "Lisa Lorentz", "comment_text": "Milan and lake Como and Venice are all magical !"}, {"username": "Marianne Langa", "comment_text": "I think everyone should experience Venice at least once in their lifetime. A very unique place.."}, {"username": "Ellen Edmonds-Wilson", "comment_text": "Venice is wonderful. Don’t miss it. It’s special. We left this week and it’s stolen my heart. Much nicer and cleaner than Rome."}, {"username": "Mary Gregory", "comment_text": "Venice is beautiful ♥️. From there take a water taxi to Burano"}, {"username": "Marie Gaynor", "comment_text": "Definitely go to Venice. It is such a unique and beautiful place. 🙂"}, {"username": "Len Murtha", "comment_text": "Cinque Terre"}, {"username": "Dana Golden", "comment_text": "Venice! No place like it!"}, {"username": "Alicia Cox", "comment_text": "Tuscany would be a better choice"}, {"username": "Diana Plop", "comment_text": "Definitely Venice / Burano & Murano.\nI would do 2 trips :\n1)North - Venice/ Murano/ Burano + Lago di Braies - Dolomites + Firenze + Cinque Terre.\n2) Center: Rome+ Pompeii + Coast Amalfy - Positano + Amalfi + sentiero degli Dei + island of Capri."}, {"username": "Annie Nelhams", "comment_text": "Are you a confident traveller? Venice is, in the main, elegant sophisticated and pretty safe to walk around, day or night, whether as a family or solo. It is picturesque and small. Temperatures pleasant in October. Naples still pretty warm in October, sprawling hectic, and more edgy, hidden gems art wise -needs caution in some neighbourhoods,\nespecially at night or solo, but a great base for Herculaneum or Pompeii."}, {"username": "Lynn Nelson", "comment_text": "Oh dear No! Naples is fun, but Venice is magical, don't miss it"}, {"username": "Richard Laidlaw", "comment_text": "What. Ronit. Said."}, {"username": "Sharon Jones", "comment_text": "No one should miss Venice"}, {"username": "Bonnie Guy Bingman", "comment_text": "My husband and I went to Venice last spring (along with other places) and it was wonderful!! Our favorite city (or a tie).❤️"}, {"username": "Karen Kinney Codella", "comment_text": "Venice!!!!!"}, {"username": "Eric Maurer", "comment_text": "Venice is amazing"}, {"username": "Paul N Marietta Dodson", "comment_text": "Depends on what experience you want. Venice is beautiful, but the last time we were there, 6 years ago, the cruise ships docked the same time our train pulled in. All the bridges were covered in tourists, St Marks square, the same. I would not go back, but that's me. Naples, November 2022, had some rough moments, but I'd go back in a heartbeat if I could. The food, the people, the crazy way you learn to walk across the street with confidence, the museums, all of it, was worth spending a few days. Make your holiday yours, expect to be overwhelmed either way."}, {"username": "Charleen Siegler Schuss", "comment_text": "If you have never been to Venice, it's a must. It is fun to end your trip there because you can walk freely without the fear being run over bt a car, a bus, or a Vespa."}, {"username": "Lisa Kelly", "comment_text": "Go to Siena. Beautiful And less hectic"}, {"username": "Catherine Lackey", "comment_text": "Venice is wonderful!!"}, {"username": "Daniela Parhar", "comment_text": "I didn’t enjoy Venice. I mean, it’s a beautiful place but I wouldn’t spend more than a day there. We even had time to go to Murano. For me, it’s one of those places that you have to see once but there’s a lot more places that I’d rather go to."}, {"username": "John Licata", "comment_text": "I think it is very personal and depends on the amount of time you want to travel. October is the high water season, so do some research for Venice.\nIt is also the time of the international chocolate festival in Bologna, so there’s that."}, {"username": "Laura Schellberg Conroy", "comment_text": "Just came home. We did Milan, Venice, Florence, Rome, Naples, Palermo. In that order. Naples was just ok. It was a good place to be to go to Pompeii. I would suggest Sorrento instead of Naples. But if it’s a choice of Venice and Naples I would go to Venice."}, {"username": "Frances McDonagh", "comment_text": "Venice is lovely you should triy beautiful Bologna too the red city, capital of food and towers that lean more than Pisa"}, {"username": "Alexandra A Welker", "comment_text": "Venice is a must see, there's nothing like it. You don't want to miss it."}, {"username": "Deborah Coram", "comment_text": "Do not miss Venice!"}, {"username": "Pam Hughes", "comment_text": "Despite the tourists Venice is a once in a lifetime must and stay at least one night to experience it at night also."}, {"username": "Yelena Shteynvil", "comment_text": "Absolutely not!"}, {"username": "Connie Curto", "comment_text": "Loved Venice! It’s a must see at least once in a lifetime! Capri as well!"}, {"username": "Annette Gonzalez", "comment_text": "Go to Venice is amazing!"}, {"username": "Michelle Rigdon", "comment_text": "Venice is one of my favorite places! You can go check out Murano and Burano too!"}, {"username": "Bob Sullivan", "comment_text": "Mixed reviews from people you know or total strangers?"}, {"username": "Laurie Francis Menk", "comment_text": "No"}, {"username": "Starla Dawn", "comment_text": "Definitely not"}, {"username": "Leah Naylor", "comment_text": "Venice over Naples a million times over. Even if you like Naples, it’s just another city. Venice is unique, special - and magical for those who love it. There is absolutely NO comparison."}, {"username": "निनावी सहभागी", "comment_text": "After hearing all the great comments, we will definitely be going to Venice! thank you for sharing!"}, {"username": "Sh Kaplan", "comment_text": "Milan is only a one day event and Venice is so magical"}, {"username": "Ronit Fraid", "comment_text": "Venice is a must! It’s heaven… a fantasy…"}, {"username": "Letty Veronica", "comment_text": "Venice is magical as others said. My whole family liked it much more than Florence."}, {"username": "Pat Cray", "comment_text": "Nooooo! Stick with Venice!!!"}, {"username": "Lisa Adams Robertson", "comment_text": "I loved Naples, but maybe go to Venice before climate change destroys it."}, {"username": "Chrystal Stevens Bisonet", "comment_text": "Venice 💯"}, {"username": "Sara Smile", "comment_text": "I’m planning my first trip to Italy next October as well. We plan on going to Rome, Florence, and Venice. ￼￼ if you want, send me a friend request and we can throw ideas out to each other. ￼"}, {"username": "Elizabeth Lupo DiVito", "comment_text": "I think everyone should she Venice for at least a couple days. Naples wouldn't be high on my list. I would add more time in Florence"}, {"username": "Martha Kosir Stankewicz", "comment_text": "I would go to Verona from Florence"}, {"username": "Vicki Susie Naab Gandolf", "comment_text": "Venice maybe wasn’t my very favorite spot in Italy, but I think you should experience it. It had its own charm."}, {"username": "Meredith Williams", "comment_text": "venice was magical! i absolutely adored it and wished we’d had more time! no cars, lots of bridges and water! ❤️"}, {"username": "Laura Uribe", "comment_text": "Love Venice! Milan is only worth a day."}, {"username": "Robýn Kretsçhmər Schuchårdt", "comment_text": "We're choosing Naples as one of our stops for Pompeii and Mt Vesuvius etc. If that history interests you. Otherwise Venice seems quite popular."}, {"username": "Stacy Dellasega", "comment_text": "Venice is absolutely lovely. I recommend finding a local guide for a guided tour of places most don’t see. I did not like Naples other than it’s ease in seeing Pompeii"}, {"username": "Vero N Ferny", "comment_text": "I loved Venice its a must see at least once in your life!!!"}, {"username": "Ana Belen Ayard", "comment_text": "Absolutely not for me. There’s no other city like Venice. It’s absolutely beautiful. But it’s different for everyone so it depends on what you’re interested in."}, {"username": "Jennifer Grimes Presley", "comment_text": "We enjoyed Venice and did a day trip up into the Dolomites."}, {"username": "Kristina Ruk", "comment_text": "If you havent seen Venice so definately you should go there once in life and then decide. Was there 3 times and cant get off the magic of walking on tiny streets..."}, {"username": "Lynair Bergman", "comment_text": "I loved Venice"}, {"username": "Janet Canter", "comment_text": "My son says his favorite city so far is Florence and we should spend at least three days there."}, {"username": "Claudia Amp", "comment_text": "Napoli is really underrated, go for Napoli and maybe in a different season, if you have the chance, visit Venezia."}, {"username": "Anel Van Zyl", "comment_text": "No other place in the world like Venice!"}, {"username": "Angela Gilmore", "comment_text": "It really depends on your interests and inclinations. Naples is more chaotic and rich of history and contradictions.\nAnd these contradictions make it more fascinating.\n\nVenice is unique, one in the world, and romantic. I think it is overrated, I visited it twice in the summer and it was too hot and too crowded. I hated it 😅 But my fault because I went there always in the summer. October should be better.\n\nI am more interested in history, art and culture and I think Naples has more to offer in this respect.\n\nAnyway, my advice, see some videos about the two cities, read about their \"attractions\", their tourist spots and decide. Only you can know what is best for you :)"}, {"username": "Jacquie Johnston", "comment_text": "Did them all last Oct 21 days planes trains cruise ship !!!"}, {"username": "Maria NoBa", "comment_text": "Venice is beautiful. Busy but worth seeing. If you don’t want to be in older buildings, stay at the lido and take a vaporetto back and forth. You might enjoy the beach at the Lido."}, {"username": "Mary Fortura", "comment_text": "Absolutely not. Go to Venice. 👍🏻"}, {"username": "Claudie Leduc", "comment_text": "Excuse me? Venice is magical! ✨ You should go! Dont miss Burano!"}, {"username": "Krissy DaRusso", "comment_text": "I had always heard mixed about Venice as well. I spent the weekend there and so glad I did. Venice is beautiful but complicated. It’s like no where else in the world. There is something about it that’s magic."}, {"username": "Karen Schmidt", "comment_text": "I LOVED Venice. Do not miss it! I think it depends when you go. October is great"}, {"username": "Ruth Lindsey", "comment_text": "You will regret not going to Venice"}, {"username": "Nicole Beaumont", "comment_text": "I was very adamant that I didn’t need to visit Venice on my trip last month. However I had a free day in Milan and decided to ￼take a day trip there. I am SO glad I did! It’s really a place everyone should experience at least once. It’s now on my list to revisit whenever I make my way back to Italy. 😊"}, {"username": "Kathy Budde", "comment_text": "Venice is amazing!"}, {"username": "Alice Francesca", "comment_text": "Venice over Naples hands down.I am Italian."}, {"username": "Janet Messanelli Bozzone", "comment_text": "Venice over Naples any day."}, {"username": "Grace Sulsenti", "comment_text": "I for one wasn't as thrilled with Venice. Sorrento is our favorite, where you can spend 2 or 3 days, if you have time. All tours go to Venice.\nSorrento & Amalfi coast are wonderful.\nJust my opinion.\nOnce at Venice was enough for me."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Don’t miss Venice!!"}, {"username": "Phyllis Snyder", "comment_text": "No - stay with Venice."}, {"username": "Kathy Flood", "comment_text": "I just got back from Venice and loved it!!!"}, {"username": "Allan Olexa", "comment_text": "We absolutely love Napoli. A one day visit to Venezia was quite sufficient for our interests."}, {"username": "Robert Suarez", "comment_text": "I would consider Milan."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2196518774080534", "text": "Is it difficult to fly out of Milan to France, then fly back? (US passports) we are only thinking for a day or 2.", "link": "facebook.com/groups/1373361046396315/permalink/2196518774080534/", "likes": 0, "comments": [{"username": "Christine Aird Craig", "comment_text": "Ryanair"}, {"username": "Gillian O'Callaghan", "comment_text": "Difficult how? Both are Schengen countries so no passport checks if that's your concern."}, {"username": "Karen Schmidt", "comment_text": "Easy. Lots of low cost airlines flying everywhere. Not really worth it for one day though. Most of the airports are a bit outside of city centre so you need to allow transfer times, etc. plus the time you need to show up before your flight."}, {"username": "Pashe Simpson", "comment_text": "You can take the train into Paris and back"}, {"username": "Wilki KJ", "comment_text": "Unless you are flying from Linate which is really close to close, Malpensa or Bergamo are about 1 hour away from city centre. Buses run regularly and there is a train to Malpensa. You get cheap flights to France Ryanair and Easy jet and some others; check Skyscanner for prices and places they fly to. Going in and out is easy....I would maybe look at more than 1 day though as times of flights can vary & travel time to airports. Ryanair use Bergamo and Easy Jet use Malpensa. There are other low cost flights. Linate like I said is closest to Milan as its like a city airport but expect to pay more for flight."}, {"username": "Gioia Clari", "comment_text": "Paris deserves at least 3-4 days, there's plenty to see. Moreover, if you are looking at a low cost airline pay very close attention to the baggage allowance - most low costs are worth it if you only carry a small backpack, and bringing any other luggage will cost you a lot"}, {"username": "Connie Wilson", "comment_text": "Not at all."}, {"username": "Eric Parks", "comment_text": "It's easy but I would take the train. Once you factor in arriving early, security, going to the airport in addition to flight time...it will probably work out to be about the same amount of total time. Plus its more comfortable."}, {"username": "Tonsia Keytel", "comment_text": "Take the train, very easy!!"}, {"username": "Emma Osbourne", "comment_text": "We took Vueling Airlines easy transition."}, {"username": "Rachael Marolda Lundin", "comment_text": "Would be an easy flight but I would make sure it wasn’t on a registered strike day. We flew out of Milan last Saturday and almost every flight was cancelled."}, {"username": "Frank Hunt", "comment_text": "Easy!"}, {"username": "Donna Gilardone Szwabowski", "comment_text": "Nope, very easy and much faster then the train. You can even store luggage at the airport that you don’t need for France"}, {"username": "Dianne West", "comment_text": "I'd do the train. Less.likely.for\n.a.delay."}]}, {"id": "2196520690747009", "text": "Hi everyone we are arriving in Rome mid August. What suggestions do you recommend for visiting the Colosseum, any particular day, times etc.\nThanks in advance 😊", "link": "facebook.com/groups/1373361046396315/permalink/2196520690747009/", "likes": 11, "comments": [{"username": "Cheri Arrowood-Stanziano", "comment_text": "Be prepared for 90-100 degree heat\nBook tours through Viator so u can hopefully go in AM before it gets oppressively HOT\nDrink lots of water"}, {"username": "Jerry Lyubelsky", "comment_text": "Book a morning tour on Viator. We did the 9am colosseum, palatine hill, Roman forum. No wait in line walked right in with the tour group"}, {"username": "Dana Golden", "comment_text": "Early tour with viator. If you are visiting Palentine hill and forum, bring a hat, Sun umbrella and be prepared to bake. Water fountains everywhere so bring a bottle to fill up."}, {"username": "Sandra Kingsley", "comment_text": "Book the first time available to get thru before the crowds turn up!"}, {"username": "Rachael Richardson", "comment_text": "We had our early morning one cancelled so had to rebook at 4pm another day ! It’s still very hot then but no choice now 😩🥵"}, {"username": "Thomas Harris", "comment_text": "Rome is such a hot city. Be safe"}, {"username": "Connie Rai", "comment_text": "Earliest tour with skip the line option. It is always the best"}, {"username": "Phyllis Snyder", "comment_text": "Buy tickets from official site not 3 rd party."}, {"username": "Michelle Symons", "comment_text": "Thanks everyone. Does the official site offer line skip, can't seem to see it on there 🤔"}, {"username": "Tasha Weller", "comment_text": "Check Rick Steves for your trip. You'll lots of $ and time. I've used his site many many many times! Download his free tours. Enjoy!"}, {"username": "Ann Treviño Mears", "comment_text": "Go first thing in the morning bc the heat is oppressive so you don’t want to be there in the afternoon. I don’t know that any day is better or worse bc it’s tourist season so it’s always busy. Make sure you already have tickets for entrance bc you don’t want to wait in line to get tickets. We had a tour guide who did both the Roman Forum and the Colosseum for us and was phenomenal!"}, {"username": "Bennett Richards", "comment_text": "Be there a 6:00am to be at the head of the line."}, {"username": "Pong Ac Ai", "comment_text": "If you got chance make sure you got colosseum in day time and night time it would make your trip memorable"}, {"username": "Michelle Symons", "comment_text": "Thanks everyone got them online. Appreciate the tips 😊"}, {"username": "Ellen Edmonds-Wilson", "comment_text": "Be early. Pre purchase tickets. Or go late for a night tour. The middle of the day is sweltering."}, {"username": "Johnny J. Turpin", "comment_text": "Early or late in the day. Check The Tour Guy. Well organized, small groups, great head phones, jumps the line."}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "I don’t think you will have many options at this lay date."}, {"username": "Bianca D'Amore", "comment_text": "As early as possible. It’s going to be VERY hot with minimal shade."}, {"username": "Karen Blackmore", "comment_text": "https://\necm.coopculture.\nit/\nindex.php?option\n=com_snapp&view\n=event&id=2E4CF\n2E0-F5B7-7757-4\n241-0173584374D\n6&catalogid=06B\n97E06-CA46-981E\n-360A-017A9FE4C\n3F6&lang=en\nCurrently availability for one day"}, {"username": "Karen Blackmore", "comment_text": "Karen Blackmore"}]}, {"id": "2196524337413311", "text": "If you are in Bologna and like streetart, take an early morning walk along Via del Pratello. Most shops' roller-shutter doors are beautifully painted by famous national and international artists. Here are some of my favourites.", "link": "facebook.com/groups/1373361046396315/permalink/2196524337413311/", "likes": 38, "comments": [{"username": "Emma Holmes", "comment_text": "Kevin Holmes"}, {"username": "Daisy Yoo", "comment_text": "Love them , I will be based there on our 3rd stop early Dec , will definitely check them out"}, {"username": "Elizabeth Pfeiffer", "comment_text": "Thanks for sharing the pix."}, {"username": "Friedemann Diederichs", "comment_text": "Great tip! I’ll be there a week in September.\nAny ideas for good local ristorante? No tourist traps with laminated picture menus?"}, {"username": "Patty Barnes", "comment_text": "Patty Barnes"}]}, {"id": "2196521950746883", "text": "Where is the best spot to rent a car and drop it off going from Lake Garda to Val Gardena and then on to Venice? Thank you!!", "link": "facebook.com/groups/1373361046396315/permalink/2196521950746883/", "likes": 0, "comments": [{"username": "John Lapinsky", "comment_text": "At the airport where you are arriving."}, {"username": "Sara Overbagh Hammonds", "comment_text": "We rented in Milan and drove to Lake Garda on to Val Gardena and dropped car off in Venice.\n\nOr closer to Lake Garda is Verona."}, {"username": "Lesley Eagle", "comment_text": "Could you get the train from Garda to Venice then hire the car from Marco Polo airport and return it there before visiting Venice?"}]}, {"id": "2196527027413042", "text": "In NYT today. Glad my trip is next year🌞", "link": "facebook.com/groups/1373361046396315/permalink/2196527027413042/", "likes": 0, "comments": [{"username": "Michelle Bartsch", "comment_text": "That spot in the pic is soooooo hot, I was there mid September in 2012.....and oh man\nFor sure have an umbrella/\nparasol, good shoes, and water."}]}, {"id": "2196531327412612", "text": "😍", "link": "facebook.com/groups/1373361046396315/permalink/2196531327412612/", "likes": 38, "comments": [{"username": "Dana Golden", "comment_text": "Great pic!!!"}, {"username": "Diep Nguyenthingoc", "comment_text": "Y"}, {"username": "Betty Bartlett", "comment_text": "Betty Bartlett"}]}, {"id": "2196531444079267", "text": "Hi everyone - I know backpacks are not allowed on the Vatican tour but are purses/cross-body bags and mini umbrellas allowed? How about empty insulated bottles?", "link": "facebook.com/groups/1373361046396315/permalink/2196531444079267/", "likes": 0, "comments": [{"username": "Diane Bicknell Cooper", "comment_text": "I had a backpack when I went through the Vatican"}, {"username": "Karen Schmidt", "comment_text": "Yes. We had water bottles too. My daughter in our tour…."}, {"username": "Danielle Johnston", "comment_text": "I had a backpack last week"}, {"username": "Gena Diaco Penland", "comment_text": "We had backpacks!"}, {"username": "Eric Maurer", "comment_text": "Yes to all"}, {"username": "John Green", "comment_text": "I carried a small backpack today"}, {"username": "Tiffany Chehova", "comment_text": "Also had a backpack, insulated cup, selfie stick today at vatican"}, {"username": "Kim Geary Keidel", "comment_text": "Backpacks are allowed. I took one a few weeks ago."}, {"username": "Barbara Kistler Wilhelm", "comment_text": "Yes"}, {"username": "Elaine Hayes", "comment_text": "I carried a small backpack in. No problem."}, {"username": "Stacey Esposito", "comment_text": "People had backpacks. I had a crossbody and I saw people with the insulated water bottled"}, {"username": "Barbie Phillips", "comment_text": "We went last Tuesday…my hubby had a small backpack & I had a crossbody bag. I also had a water bottle. No issues!"}, {"username": "Fiona Oliver", "comment_text": "We had backpacks they go through a security scanner and take plenty of water."}, {"username": "Ellen Edmonds-Wilson", "comment_text": "Day packs and regular sized bags are just fine as are water bottles."}]}, {"id": "2196532680745810", "text": "Can you please recommend a winery with a restaurant you can walk in and have lunch (and maybe wine tasting) that you don’t have to book a tour for? Something anywhere on the route from Rome to Florence. Can you for example just walk in to Madonna del Latte to have lunch?? Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2196532680745810/", "likes": 0, "comments": [{"username": "निनावी सहभागी", "comment_text": "It is so funny how a post on what is a trendy colour for mani/padi in Italy right now gets 89 responses and a question on a winery in Tuscany you can just walk in and have a lunch without booking a tour has 0 responses 😂😂😂"}, {"username": "Meredith Holloway Helbon", "comment_text": "I’d respond, only it’ll be my first time in Italy in a month. Wish I could help you out. Have an incredible trip!"}]}, {"id": "2196543097411435", "text": "Has anyone used any of the popular group travel companies? Specifically for 30-40 age groups?", "link": "facebook.com/groups/1373361046396315/permalink/2196543097411435/", "likes": 0, "comments": []}, {"id": "2196540157411729", "text": "Love this page! My question - Are tsa luggage locks beneficial when traveling in Italy?", "link": "facebook.com/groups/1373361046396315/permalink/2196540157411729/", "likes": 2, "comments": [{"username": "Connie Wilson", "comment_text": "Beneficial how? Locks are always good to use on your luggage."}]}, {"id": "2196544627411282", "text": "My bestie and I are traveling to Italy in April. Is it possible to book accommodations that are $150 a night? Or is that budget to low?", "link": "facebook.com/groups/1373361046396315/permalink/2196544627411282/", "likes": 64, "comments": [{"username": "CiCi LeCanard", "comment_text": "Try booking.com or airbnb.."}, {"username": "Kelly Aynes Zingaro", "comment_text": "We did as a family of 4. Did some hotels and some AirBnBs."}, {"username": "Agnieszka Predkiewicz", "comment_text": "Booking.com\nAgoda.com\n\ndepending on which part of Italy you want to go to - if you make your reservations now, I think that you will have no problem with prices up to 150 eur per night / you will find even cheaper offers, but what will happen with prices in April 2024, no one will answer you"}, {"username": "Patrick Poole", "comment_text": "Yes.\nCheck air b&b"}, {"username": "Patti Farrell", "comment_text": "Check prices for these at that time and book early and phone directly and you might get a better price.dont go in July or August. Too busy, too hot. Too expensive\n\nROME:\nCasa di Santa Francesca Romana in\nTrastevere\nIl Corso bed and Breakfast bear Piazza del Popolo"}, {"username": "Phyllis Snyder", "comment_text": "Depends what city and level of comfort & services. Get Rick Steve’s Italy guide he lays out several accommodations,\nlocations and cost."}, {"username": "Cynthia Blackstone", "comment_text": "Airbnb or VRBO!"}, {"username": "Donna Tedford", "comment_text": "I stayed at centro Rome twice it’s $145 per night. Try booking. Com\nOr Costco travel or hotels.com ot Airbnb."}, {"username": "Annette Mayer", "comment_text": "Easily"}, {"username": "Susan Levings", "comment_text": "Go to booking.com. Decide where you wan to stay and look at the multiple options. I have been 4 times, 21 days each time and very rarely spent over $100…and most of the bookings were 2 bedroom. Exception is Venice but worth every penny!"}, {"username": "Totò Maryax", "comment_text": "Aldebaran holiday housee Take a look at my facebook page, if interested contact me on WhatsApp at the number +393761740153 Mary"}, {"username": "Linda Miller", "comment_text": "There are plenty of accommodations at very reasonable prices!"}, {"username": "Hafsa Arshad", "comment_text": "Thats too much. You can find good options for $50-$100 per night"}, {"username": "Annick Hupperetz", "comment_text": "If you are traveling to Tuscany look up Agrotourism which is the way to go and you will find very easily in your price range."}, {"username": "Silvia Urbinelli", "comment_text": "I'm italian and I tell you that it's a price for a good hotel. Usually we pay less and we stay in good hotels. You might find some other cheaper ones."}, {"username": "Anthony Sperduti", "comment_text": "Yes"}, {"username": "Rachael Richardson", "comment_text": "Yes booking . Com or air bnb"}, {"username": "Jill Dempsey", "comment_text": "Tons of nice places under that!"}, {"username": "Judith Sico", "comment_text": "Won't find a nice hotel for that price"}, {"username": "Martha Lee", "comment_text": "Depends on where and when you’re going"}, {"username": "Liz Zibaitis Condon", "comment_text": "We had an air. Bb in Sorrento in June for just over $150"}, {"username": "Maureen McCartan Harris", "comment_text": "I would love to know that because i've been on expedia and trip advisor and even some of the suggestions on here, and it's a lot higher than that"}, {"username": "Bob Patterson", "comment_text": "Absolutely possible"}, {"username": "Ruth Hackert", "comment_text": "There are some on Airbnb"}, {"username": "Kit Nader", "comment_text": "Easy for 150"}, {"username": "Kim Murphy", "comment_text": "Depends on where you are going. Big cities will be expensive. Off the grid not."}, {"username": "Melanie Procaccini", "comment_text": "That's the best time of year to go to Italy weather wise."}, {"username": "Shari Powers Roberts", "comment_text": "We have a 2 bedroom 2 bath apartment in Florence and we paid just a little over that."}, {"username": "Rana Umair", "comment_text": "Agriturismos all day!"}, {"username": "Henriette Langius", "comment_text": "It's to high. I pay around 60-100 euro per night for 2 persons. Agritourismo 120 including breakfast and dinner"}, {"username": "Amanda Gilbert", "comment_text": "If you look around you can find something. We use Booking to find places then call for a lower rate."}, {"username": "Beth Casey Murphy", "comment_text": "The convents and monasteries have rooms for rent at reasonable prices. monasterystays.\ncom"}, {"username": "Danielle Baca", "comment_text": "Yes! That’s my favorite time to go. You can find plenty for under that. I even stay on the Almafi coast for under that"}, {"username": "Dana Golden", "comment_text": "Air B& B. Very doable"}, {"username": "Hudd Cass", "comment_text": "Have a look online at options."}, {"username": "Joe Guzzi", "comment_text": "My wife and I are going to Italy tomorrow, EUR 150 for two nights, so 75/night (for two, NOT each)"}, {"username": "Don Bentivoglio", "comment_text": "Depends on what tolerance you have for amenities"}, {"username": "Angela Humbles Searcy", "comment_text": "It's a good price."}, {"username": "Karon Patterson", "comment_text": "We did 3 star hotels and bandb for $200 per night.😊"}, {"username": "Connie Hardway", "comment_text": "Airbnb"}, {"username": "Amy Nicewander", "comment_text": "My bestie and I are planning a trip for next spring and from what I have researched this is totally doable"}, {"username": "Alana Marie Sult", "comment_text": "My sister and I did airbnb that averaged about 70 per night"}, {"username": "Laura Uribe", "comment_text": "If you book now, you can probably find lower unless you are stuck on a hotel. Booking has a lot of apartments that are nice and around $100 per night or less."}, {"username": "Michelle Jussel Mccarthy", "comment_text": "Bestwestern has properties in Italy that are in that price range, depending on where :)"}, {"username": "Najeana R. Crandall", "comment_text": "Me and my husband are going during the same time and found nice Airbnb for that price close to all the tourist attractions"}, {"username": "Yiota Anastasi", "comment_text": "If u know the exact dates of your trip, book your accomodation as early as you can. The earlier the cheapiest. Don't forget to look gor Airbnbs."}, {"username": "Kathryn Meltzer", "comment_text": "Yes! My husband and I booked Airbnbs that were around $100 everywhere except Venice. We wanted a full kitchen everywhere though, so it was $164 a night in Venice."}, {"username": "Connie Wilson", "comment_text": "Many places $150 or less. Booking.com has many choices for accommodations."}, {"username": "Mary Ann Mancuso", "comment_text": "That’s like saying I’m going to US can I stay for $150. Well in Mobile Alabama yes in Napa Valley California no. It’s going to make a huge difference where."}, {"username": "Connie Wilson", "comment_text": "Here’s a good site for low-cost rooms.\n\nhttps://\nwww.monasterysta\nys.com/\n?d=Italy%2FLazio\n%2FRome-accommo\ndation"}, {"username": "Elaine King", "comment_text": "Try booking.com. I'm going in May, I wanted to be close to the Rialto, you can search in the area you'd like to stay in, read their reviews,"}, {"username": "Linda Brecher Bekoff", "comment_text": "It depends on what kind of accommodations you require. We have been to Italy 9 times. We stay in small family owned hotels. All with private bath, air conditioning, and good location. Rare to pay more than $150/night- often less. These places are charming and hosts very helpful. Not plush, sometimes limited bath products, small towels. We embrace their traditions. If we wanted American accommodation we would stay in America. Enjoy the adventure!"}, {"username": "Mike Guarini", "comment_text": "Lots of apartments on booking and VRBO"}, {"username": "Megan Leigh", "comment_text": "Depends on where you are going. The big cities & CT are obviously more. Nor sure about amalfi but I'm guessing the same. You should still be able to do it- especially with monasteries, airbb, vrbo, etc. But you may need to sacrifice some comforts. In the smaller areas $150 is more than enough for some really great places."}, {"username": "Ruth Olivia Yanes", "comment_text": "We did airb@b for less than that."}, {"username": "Ken Lerch", "comment_text": "Where are you going and what is your style and standard of travel? Possible? Yes. Desirable? Maybe."}, {"username": "Matthew Livio Conti", "comment_text": "Yes it’s easily possible."}, {"username": "Mallorie Mathis McManus", "comment_text": "To be fair - 3* hotels in Europe are not plush by any means. 80% of time when traveling Europe, I stay in 3* and they are decent, safe and comfortable usually nicely located. Whether or not they include breakfast is hit/miss. I think between $150 & 200 is reasonable if splitting a room with someone. One of my friends and I did it two years ago - using Booking . com (which was super nice because you could actually SEE the rooms online and get a true pic of the room). The other 20% I have spent more just for the location/view etc. We generally do that at least a couple of nights on every trip."}, {"username": "Billie Frances Swanda", "comment_text": "Yes. Use Frommers and look for B and B"}, {"username": "Jolie Swain Mireles", "comment_text": "That’s good!!!!"}, {"username": "Annie Slater", "comment_text": "Is that US funds? We booked a great hotel in Naples that was under that and it was fabulous. It was called Grande Hotel Oriente and it was super clean, comfortable and great buffet breakfast included. Right in the heart of the tourist area in downtown Naples. Walking distance to amazing restaurants and the ferry terminal."}, {"username": "Kelly Ann", "comment_text": "It really depends on which cities you are visiting\nAre you willing to stay in the towns outside the city? This could help keep the budget lower…"}, {"username": "Friedemann Diederichs", "comment_text": "I found fantastic Airbnb starting at 90 buxx"}, {"username": "Pietro Di Sorbo", "comment_text": "Yes, try with booking.com"}, {"username": "Eileen Lonergan", "comment_text": "When I go to Italy I use booking.com filter what's important for me. Beach, aircon, restaurant, a bar, breakfast, 8 stars and above my average is usually 100 a night over two weeks. Sometimes more sometimes less"}, {"username": "Simone Pfenninger", "comment_text": "Depends on the aera and date of travel. I'm sure, you can find somthing in that range in Mai in Tuscany, Pugli, Sizily or Lago di Como"}, {"username": "Judy Carey", "comment_text": "I'm searching for rooms in Florence and Rome for March and finding hotels under that amount per day."}, {"username": "Karen Schmidt", "comment_text": "It depends on your level of comfort and services you want. $250-$275 has always gotten us a really nice, unique, historical Airbnb apartment. This was true no matter the city we were in. Cheaper is available on Airbnb for sure…but a touch of something special is important to me so I budget a bit more . On occasion I have found for significantly less, especially off season"}, {"username": "Dave Conroy", "comment_text": "Easily TBH. You will get good standard for £50/night. Dunno what that is in $. I think it's very often diminishing returns spending more. You're only really sleeping there, but you want a safe, clean place with the facilities needed and the right transport and location. Below £40 these days then maybe not quite so nice, lots of compromises possibly, but it always depends. Do the research yourself on AirBnB and/or Booking and you'll soon get a sense."}, {"username": "Wilki KJ", "comment_text": "Where are you going to be staying? For me you can get places within that budget that are basic but clean and friendly. There has been times when all I'm interested in is having a clean room, with a TV and a fridge and private bathroom. If I'm going to be out all day on adventures that's all I need."}, {"username": "Victoria Marchetti", "comment_text": "Try vrbo.com or airbnb.com"}, {"username": "Debra Zee", "comment_text": "The Monetary for sure and the Convent in Rome is central, fabulous and well priced"}, {"username": "Lina Stump", "comment_text": "Where are you going in Italy? Have you tried Booking.com?"}, {"username": "Sally Sprinkle", "comment_text": "Where in Italy that makes a big difference?"}, {"username": "Sigrid Cormier", "comment_text": "For next April, I would search for 1bedroom apartments. Bed sitting room with small kitchenette all in one, plus a small bathroom.they are generally houses that have been converted into &-6 units. Quite often will have a balcony or terrace, some a shared courtyard or rooftop lounging space."}, {"username": "Rosalia Nastasi", "comment_text": "Yes if you are coming to Sicily. Palermo is beautiful and much cheaper than other parts."}, {"username": "Dawn Falsinotti", "comment_text": "It’s plenty."}, {"username": "Sandy Radican Shikaly", "comment_text": "Hostel maybe"}, {"username": "Heather Stokes", "comment_text": "No,that's about what we are paying now.Book well in advance to secure the cheapest deals.We are staying in Bologna for only $93 per night so you can pay a bit more in some places and save in others."}, {"username": "Amber Evans", "comment_text": "Air b&b! I travel alone a lot and that def saves me money. So I try to do a mix of hotel and that. I stayed in 4 last time I was in Italy. It’s also nice to have a fridge . I stayed in an apartment in Florence and Lucca and I. Manarola it was a private room with shower in a shared building that had a couple other guests. I also stayed with an older Italian couple in their home in Montepulciano."}, {"username": "Claudia Amp", "comment_text": "Depends on the city; some years back 150 a night could get you nice accommodations;\nnow in bigger cities, especially during holiday season 250 and above. 150 in April could work, unless your dates are close to Easter holidays then prices may go up. It all depends on the area Northern Central Italy is expensive, South not so much unless you are going to major tourist destinations."}, {"username": "Pao Magnoler", "comment_text": "Yes!"}, {"username": "Claudia Amp", "comment_text": "Check Airbnb too, might get a whole apartment for that price per night."}, {"username": "Romina Lauretig Toscano", "comment_text": "Yes!"}, {"username": "Ted Kostisin", "comment_text": "In April, your not going to have an issue finding a place to stay. Two of our favorite vacations we ever took, we only had reservations in the bigger cities. We did northern England and Scotland in late may, early June. And Paris and Southern France in April. We had reservations in Paris and Edinburgh. Other than that, we just floated about. It was lovely. We rented a car, absolutely no schedules, just exploration. It was 1999 and 2001, so it was easier and more commen to juat walk into a hotel and ask if they had a room.\nWe're headed for Puglia and Calabria in October. We're planning to do it again, although with the phone we will probably find places on our phones. As to prices, you can find cheap places, just search. Here's a screen shot, a quick search for Rome in April. Less than $100 per night. Just a question of what your looking for. Generally my wife and I, only shower and sleep at the hotel, maybe coffee. That's it."}, {"username": "Carol Scime-Raiford", "comment_text": "You can even find nice accommodations for less"}, {"username": "Rhona OConnor", "comment_text": "Have a look at Booking.com their rooms ate good value.... And the reviews are accurate."}, {"username": "Joelle Thiessen", "comment_text": "Definitely possible."}, {"username": "Julia Phillips", "comment_text": "We booked whole apartments for less than that… Booking.com"}, {"username": "Miyuki Kanno Paul", "comment_text": "Usually book 3 consecutive nights will give you a discount"}, {"username": "Maureen King", "comment_text": "Following *"}, {"username": "Delia Miscella Wroblewski", "comment_text": "Where?"}, {"username": "Linda Metallo Casey", "comment_text": "I think it’s very low. But then we’re just came from Amalfi Coast so I can’t compare"}, {"username": "Michael Westlake", "comment_text": "Try the Monastery rooms. It comes up with a Google search. Otherwise, in my experience, you're looking at hostels. I've seen pretty good feedback on both but they come with limitations."}, {"username": "Michael Westlake", "comment_text": "Monastery Stays - BnB Accommodation - Book Monastery & Convent Rooms\nhttps://\nwww.monasterysta\nys.com/"}, {"username": "Maria Brozou", "comment_text": "Which city?"}, {"username": "Jenn Messina Babore", "comment_text": "It definitely depends on where you are going and what you are looking for (other than the budget, of course)."}, {"username": "Erin McNulty", "comment_text": "Airbnb?"}, {"username": "Janet Messanelli Bozzone", "comment_text": "Go off season and it is easier."}]}, {"id": "2196551047410640", "text": "What hotels, wineries and activities are open from March 15-March 31st in Tuscany and Umbria region? I’m coming across of hotels that open in April.", "link": "facebook.com/groups/1373361046396315/permalink/2196551047410640/", "likes": 0, "comments": []}, {"id": "2196547690744309", "text": "Whats the temp by month in rome and amalfi area", "link": "facebook.com/groups/1373361046396315/permalink/2196547690744309/", "likes": 13, "comments": [{"username": "Lauren Vassallo Beattie", "comment_text": "Go on accuweather"}, {"username": "Jean Bennett O'Reilly", "comment_text": "Check the internet"}, {"username": "Andrea Romano", "comment_text": "🔥"}, {"username": "Juliet Lee", "comment_text": "Google is a really useful source 🤣🤣🤣"}, {"username": "Dianne West", "comment_text": "Google it!"}, {"username": "Nadia Waugh", "comment_text": "Select a month:\nhttps://\nwww.timeanddate.\ncom/weather/\nitaly/rome/\nhistoric"}, {"username": "BJ Webster Smith", "comment_text": "🔥🔥🔥🔥"}, {"username": "Terry Massaro", "comment_text": "Google weather"}, {"username": "D'Anna Hohe", "comment_text": "I don’t know where you live, but weather in Italy isn’t any more predictable than it is anywhere else, and I’m not sure how the wide ranges of temperature predictions you will get here would help you at all with planning. Much better to look at temperatures a few weeks before you pack for your trip."}, {"username": "Edmond Nolan", "comment_text": "Google is free"}, {"username": "Kay Kay Ogburn", "comment_text": "I just got back and it was high 90's.. very hot"}, {"username": "Mariët Eertman-Heemstra", "comment_text": "You never now, at the moment it is REALLY hot over there with 104 °F!! April/May and September are much better!"}, {"username": "Alicia Cox", "comment_text": "Best to google specific time & area, but best times in general are Apr-May & sept - December"}, {"username": "Alicia Cox", "comment_text": "Also, any time that is in the “change of season” time, just take layers & what is cool for some, may be perfect for another. Also if ur in a city with lots of concrete, asphalt, tall buildings vs on the water. I also prefer a rain coat with a hood rather than an umbrella."}, {"username": "Norms Garcia", "comment_text": "Norms Garcia"}, {"username": "Felicia LoCascio Whitney", "comment_text": "Right now very high. 100+ with oppressive humidity."}, {"username": "Sherri Leis Dillavou", "comment_text": "I was there in December and it was right around 60 degrees everyday"}, {"username": "Gene Alligood", "comment_text": "How about Googling it😂"}, {"username": "Nancy Lewis", "comment_text": "Google it"}, {"username": "Irene Oda", "comment_text": "It's very hard to predict. Weather is changing rapidly. Last year the crazy high temps were around fir short periods, thus year the high 95+ to 101F has been daily for several weeks with no relief in sight. Spring time was very rainy- more than usual. If I was going to guess- late September would be a 80F. May would be 70 and climbing. Predictions based on past year us almost useless. It's hotter for longer periods. I think it's the new normal."}, {"username": "Shelley Howard", "comment_text": "there are a few good weather apps available online ..."}, {"username": "Sheryl Elizabeth", "comment_text": "In Rome now…… very hot 🥵"}, {"username": "Karen Klein-Jelaso", "comment_text": "Right now hot as hell!"}, {"username": "Lynda Petralia", "comment_text": "It’s online."}, {"username": "Bianca D'Amore", "comment_text": "Hot af. I was just there a week ago. And they said it only gets hotter, apparently places close in mid august cause it’s just too hot"}, {"username": "Karen O'Reilly", "comment_text": "Going in a week 😳"}, {"username": "Margarita Lysakova", "comment_text": "Hi, how is the weather in Feb and March? Planning for the next year and have to plan by school breaks. Thank you!"}, {"username": "Jennifer Gustafson", "comment_text": "July/august it was around 95-97 everyday we were there."}, {"username": "Rachelle McGregor", "comment_text": "Came back two weeks ago, it is so so hot!!!!"}, {"username": "Gina Baltazar", "comment_text": "Very hot"}, {"username": "Aydrian Pollard-Hayes", "comment_text": "We are going in April/ May. I read here it was good months to go! 🙂"}, {"username": "Bill Elias", "comment_text": "“What are thing you can Google?”"}, {"username": "Agnieszka Predkiewicz", "comment_text": "Check on internet - simple"}, {"username": "Rosemary Herger", "comment_text": "Google"}, {"username": "Frances McDonagh", "comment_text": "40°atm in South 30°in the north"}, {"username": "Sam Izzo", "comment_text": "Sam Izzo"}, {"username": "Alex Hicks", "comment_text": "Hot"}, {"username": "Ted Larson", "comment_text": "Google it. !"}, {"username": "Mel Peci", "comment_text": "Google it!"}, {"username": "Valerie Taylor-Crow", "comment_text": "Google is your friend!!"}, {"username": "Jaime Cleek", "comment_text": "You can google this and it will tell you the average temp etc."}, {"username": "Rhona OConnor", "comment_text": "That's a good question for Google......"}, {"username": "Sue Gelardi", "comment_text": "Weather Channel"}, {"username": "Monica Vazdauteanu", "comment_text": "You know you can can google for the answer, right?"}, {"username": "Frank Hunt", "comment_text": "Google it!"}, {"username": "Kim Kirsten NeeMeglic", "comment_text": "Kim Kirsten NeeMeglic"}, {"username": "Rodger Cravens", "comment_text": "Weather.com is amazing"}, {"username": "Bobbie A. Lewis", "comment_text": "You can Google temperature by region."}, {"username": "Dale Kitchen", "comment_text": "Google?"}, {"username": "Peter Doyle", "comment_text": "85-90 July- August"}, {"username": "Sherene Pipkorn", "comment_text": "Late May was perfect touring and sightseeing weather this year"}, {"username": "Lisa Minichini-Dowty", "comment_text": "Google"}, {"username": "Monica Villafranco", "comment_text": "We visited Rome,\nNaples and Amalfi Coast Mid- May in 2022. It was perfect!! Weather, crowd wise, plane ticket costs.\n\nFirst time we went in July- nope not doing that again haha!"}, {"username": "Diane Bolognese Pettengill", "comment_text": "Weatherchannel.\ncom"}, {"username": "Sandra Maldonado", "comment_text": "Google average temperature in city you want."}, {"username": "Roxanne Kellogg", "comment_text": "Do not believe posts of the mid 80’s in June in Florence and Tuscany! We’ve been there twice, 4 years apart and both times it was excruciatingly hot! Upper 90°’s approaching 100° both trips and humid. Global warming is changing the average temperatures everywhere."}, {"username": "Ed Enfield", "comment_text": "Google. You type in your question just like you did in this group."}, {"username": "Lyn Pappas Dahm", "comment_text": "Timeanddate.com"}, {"username": "Mario Bélanger", "comment_text": "Google"}, {"username": "Beth Casey Murphy", "comment_text": "Check Rick Steves guidebook"}, {"username": "Joleena Pickett Louis", "comment_text": "Google will tell you the average temps by month in every city."}, {"username": "Alan Simpson", "comment_text": "Google it"}, {"username": "Friedemann Diederichs", "comment_text": "Don’t do Rome in July and August. There is a reason locals flee town"}, {"username": "Giorgio Zanichelli", "comment_text": "google exists"}, {"username": "Danielle Johnston", "comment_text": "HOT HOT HOT"}, {"username": "Kirsten Abrams", "comment_text": "Look it up"}, {"username": "Jordan Schmale", "comment_text": "Ever heard of google?"}, {"username": "Danielle Baca", "comment_text": "Some of y’all are mean adults 😂 it’s literally a travel trip page. Sometimes is better to hear from people who have actually been there and can explain it better.\n\nI’m from up in the mountains in Colorado and march/April is warm for me. Rome gets slightly cool at night those months and I use a light jacket."}, {"username": "Joe Anastasi", "comment_text": "Google."}, {"username": "David Gotlieb", "comment_text": "Hot… suggest you just google it"}, {"username": "Gary Fossaceca", "comment_text": "Google it!"}, {"username": "Angela Gilmore", "comment_text": "Which month exactly?\nI live here"}, {"username": "Lynn Abrams", "comment_text": "It was just as warm in Ischia. It’s the summer"}, {"username": "Renae Larcus", "comment_text": "Google average temperatures for each town."}, {"username": "Linda Miller", "comment_text": "Google"}, {"username": "Gil Rodriguez", "comment_text": "All but July and August agreed"}, {"username": "Cheryl Williams", "comment_text": "https://\nweatherspark.com\n/y/71779/\nAverage-Weather-\nin-Rome-Italy-Y\near-Round"}]}, {"id": "2196551910743887", "text": "Hi Everyone! Has anybody used the Stow Your Bags luggage locker service (stowyourbags.com) in Rome or Naples? Our accommodations have a little later check in so we want to store our bags for a few hours so we can explore or get lunch without lugging all our stuff. TIA!", "link": "facebook.com/groups/1373361046396315/permalink/2196551910743887/", "likes": 0, "comments": [{"username": "Lori Harrison", "comment_text": "Usually the hotels will store them for you until your room is ready. We have done this in Europe many times."}, {"username": "Charles Kline", "comment_text": "You are going to Italy?!"}]}, {"id": "2196557760743302", "text": "Hello! I'm spending some time in my family's homeland, Polignano A Mare, in December and then heading north (Rome - Florence - Tuscany -for a few weeks and ending in Venice for New Year's. We originally thoughtआणखी Christmas in Bolzano would be nice but are also open to more days in Tuscany over the holiday. Has anyone experienced late December in Bolzano? Thank you for your recommendations! I love this group!", "link": "facebook.com/groups/1373361046396315/permalink/2196557760743302/", "likes": 5, "comments": [{"username": "Elena Eugeni", "comment_text": "Christmas in Bolzano is awesome, from there you can also quickly get to Merano or Bressanone, full of lights and Christmas markets. And snow, usually"}]}, {"id": "2196560250743053", "text": "I meed to ask for the weather in italy on 15 sep till 22 is it good or not\nAnother question please did any one tried plans master app is it good or not\n\nThank you", "link": "facebook.com/groups/1373361046396315/permalink/2196560250743053/", "likes": 0, "comments": []}, {"id": "2196563330742745", "text": "Back in the ‘70s, we never made reservations when traveling in Europe. We always made a reservation the day we arrived somewhere at the visitors’ kiosk at or near the train station. In those days, we mostly stayed at Bed and Breakfasts or small independent hotels. Is this feasible in this day and age during the shoulder season (trip planned for March or April? We’re planning a Eurail pass trip and prefer not to be tied down with a strict itinerary. Thanks!", "link": "facebook.com/groups/1373361046396315/permalink/2196563330742745/", "likes": 9, "comments": [{"username": "Robin Burrell", "comment_text": "It certainly is, but you may have to compromise on hotel or room configuration"}, {"username": "Rhona OConnor", "comment_text": "Keep an eye on Booking.com.... You might even get some bargains!!"}, {"username": "Jacquie Johnston", "comment_text": "That was the 70s I was just in Italy 2022 for 21 days, you need to make your reservations ￼ ahead of time"}, {"username": "Keith Crossley", "comment_text": "We toured in Portugal & Spain for two weeks somewhat how you describe. In big cities / where we had a set date (e.g. prepaid Alhambra tour) we got reservations. Otherwise we stayed where the road took us, and that was very good. Being one of those '70s travelers myself, I note that the internet has somewhat supplanted the tourist offices. You can get very nice lodgings at the end of the day as the hotels try to fill rooms."}, {"username": "Brian Osman", "comment_text": "Yes it's the off season"}, {"username": "Dianne West", "comment_text": "I don't think it's possible as way more people are travelling. Eurail passes are a rip off just buy tickets as you go along"}, {"username": "Romina Lauretig Toscano", "comment_text": "Good Luck 😲"}, {"username": "Janet Messanelli Bozzone", "comment_text": "Trains are still easy to book same day for popular destinations with multiple departures. Hotels not so much. Make cancellable reservations for accommodations"}, {"username": "Barbara Bastianini", "comment_text": "We did the same thing back in the 1970s. It was a great way to travel, I miss those days. But things have changed so much since then! I myself would not do it now in the high season. And I think shoulder season is as crowded now as peak season used to be. Personally I’d make reservations for accommodations in advance just to be sure to have a place to lay my head. You can probably find a room on arrival but my concern would be that what’s available would be either rock bottom cheap or else top tier luxury. Because it’s those two extremes that tend to be available at the last minute. I’d hate to have to arrive and find I’d have to sleep in a dingy dirty dump or else be faced with spending more than I can afford. To to protect myself I book ahead anymore no matter what time of year I travel.\n\nI always have a general idea of where I’m going and how much time I’ll need in each place anyway so it just makes sense to make sure I’m able to stay in a nice place within my budget while I’m there.\n\nEveryone’s different, though. You may not mind being surprised at your destination as much as I do."}]}, {"id": "2196565214075890", "text": "Looking for a private tour company for our trip in September for our time on the coast, contacted a few and they are already booked for our dates. Any recommendations would be appreciated. TIA", "link": "facebook.com/groups/1373361046396315/permalink/2196565214075890/", "likes": 1, "comments": [{"username": "Linda Metallo Casey", "comment_text": "Not sure if Mena does that but call Mena Forino with Amalfi Coast Transfers."}, {"username": "Denise Curtis", "comment_text": "Rainbow limos/tours"}, {"username": "Felicia LoCascio Whitney", "comment_text": "Driver in Rome\nAlthough they will bring you anywhere."}]}, {"id": "2196573254075086", "text": "I have a question and I hope you are kind. I’ve only been to Europe one other time and flew into Paris so this wasn’t an issue but my question is we are flying to Rome via Amsterdam. Will we have to get our luggage and go through customs or just our carryons and go through customs. I’m sure we will do the whole customs thing in Rome. Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2196573254075086/", "likes": 4, "comments": [{"username": "Cheri Arrowood-Stanziano", "comment_text": "Everything goes through customs\nLook into Global Entry before u leave US\nIf I am correct you will go through customs in AMS and then your luggage gets rechecked"}, {"username": "Cheri Arrowood-Stanziano", "comment_text": "Yes, you have to go through customs on a layover in Amsterdam . Passengers are required to collect their checked baggage and pass through customs, before they can proceed to their connecting flight."}, {"username": "Karen Schmidt", "comment_text": "You will go through customs in the first place you land. So in this case, Amsterdam. Your luggage should be checked all the way through if it’s a through￼ ticket ( eg when you booked it said Rome as final destination). If however you bought separate tickets from Amsterdam to Rome, then you will have to collect your luggage and re-check. ￼ Customs does not get done again in Rome. ￼"}, {"username": "Debbie Zornes Ruch", "comment_text": "You should clear customs and immigrations in Amsterdam where you will recheck your bags. Very easy. Always check the luggage tags the airlines attaches to your bag that your bag is directed to the correct and final destination."}, {"username": "Brenda Fuqua Rice", "comment_text": "We did not buy separate tickets to Rome."}, {"username": "Lushan Yao", "comment_text": "Your baggage will be sent automatically to Rome, so you won’t need to collect your bags and check them in again in Amsterdam. You will go through passport control in Amsterdam and go through customs in Rome."}, {"username": "Heather Sechrist", "comment_text": "When you check your bags in the US, just ask and they will be able to tell you as well."}]}, {"id": "2196569640742114", "text": "Planning a trip to Sorrento in late October but saw things start to shut down in mid October. Has anyone\nbeen there in late October? Are ferries still running, are there shopping and restaurants open?", "link": "facebook.com/groups/1373361046396315/permalink/2196569640742114/", "likes": 1, "comments": [{"username": "Giuseppe Placi", "comment_text": "The season ends at the end of October first days of November"}, {"username": "Kay Rendall", "comment_text": "Positano starting to shut by then. Not sure about Sorrento."}, {"username": "Cindy Gallen Barton", "comment_text": "We were there October 20-24 last year. Everything was open, weather was sunny and 70's. Was told things would start shutting down 1st week in November"}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2196576030741475", "text": "Some advice on how to get from the main train station in Naples to either the ferry or the train that takes you into Sorrento? Once in Sorrento, which is closer to the main area of Sorrento? The train or ferry? Which would you recommend?", "link": "facebook.com/groups/1373361046396315/permalink/2196576030741475/", "likes": 3, "comments": [{"username": "Giuseppe Placi", "comment_text": "Train station in Sorrento is in the centre.\nFrom the port there is an elevator going up"}, {"username": "Jason Hobel", "comment_text": "Once you arrive at the Napoli Centrale, it is a short walk to the Garibaldi station. It is essential the same building just follow the signs and go down the stairs and look for the Campania Express. The Campania Express is the tourist train that takes you directly to the Sorrento station. Keep in mind that the Campania Express runs about every 3 hours or so but still very convenient."}]}, {"id": "2196575584074853", "text": "Would love hotel recommendations in Sorrento", "link": "facebook.com/groups/1373361046396315/permalink/2196575584074853/", "likes": 9, "comments": [{"username": "Donna Russonello Merlino", "comment_text": "Hotel Plaza Sorrento"}, {"username": "Izzerbizz McNally", "comment_text": "James C. Eslinger"}, {"username": "Dan Carr", "comment_text": "Find an Agriturismo…you\nwill not regret."}, {"username": "Heidi Littman Meiers", "comment_text": "Can someone tell me why BW La Solara comes up as like the #1 rated hotel on a bunch of websites and no one has mentioned it ? We felt fortunate to score Resys there and now I'm nervous"}, {"username": "Antonella Piccolo", "comment_text": "Hotel Michelangelo Sorrento"}, {"username": "Tina Sarantopoulos", "comment_text": "Hotel Rivage pretty central with a pool, loved our stay there."}, {"username": "Suzie LG", "comment_text": "Hilton Sorrento Palace …. Gorgeous with clean modern rooms and fabulous views of Mt. Vesuvius! ❤️"}, {"username": "Sandra Francano Richards", "comment_text": "The Bellevue Syrene…….you’ll\nthank me."}, {"username": "Monica Roman-Fazio", "comment_text": "Hotel gardenia it was a coke of blocks from the center and had a pool wish was great and staff was so friendly and helpful"}, {"username": "Tracy Wrinn Mcdermott", "comment_text": "La Minervetta …. Beautiful ❤️"}, {"username": "Barbara Brosnan", "comment_text": "Hilton, we were just there 2 weeks ago."}, {"username": "Mary Iuor", "comment_text": "Hotel Vesuvio was amazing for me, will definitely be going back."}, {"username": "Jean Bennett O'Reilly", "comment_text": "Grand Hotel La Favorita. Perfect!!"}, {"username": "Marilyn Wheeler", "comment_text": "Minerva"}, {"username": "Aiden Sone", "comment_text": "Grand Favorita"}, {"username": "Maddy Chloe", "comment_text": "Hotel Aniche Mura!! 🩵"}, {"username": "Geoff Roush", "comment_text": "Imperial Hotel Tramontano Sorrento is the best"}, {"username": "Amanda Stewart", "comment_text": "Has anyone stayed at Maison il Conservatorio Sorrento?\n\nMaison il Conservatorio Sorrento\n+39 081 1809 8254\nhttps://goo.gl/\nmaps/\nULEkDubG6WBKN3jA\n9"}, {"username": "Gina Romano Peralta", "comment_text": "Hands down the one best hotel I’ve ever stayed in.\n\nhttps://\nexcelsiorvittori\na.com/"}, {"username": "Nancy Fricke Corsi", "comment_text": "Palazzo Jannuzzi Relais"}, {"username": "Ewa Kolodziej", "comment_text": "Minerva Hotel"}, {"username": "MaryEllen Daddario-Colon", "comment_text": "Grand Hotel Flora, walking distance to town. Get a room in the back of the hotel."}, {"username": "Julie Connolly Arruda", "comment_text": "Diamond Suites! Recently stayed there. Great location near Piazza Tasso and the host Michele is wonderful."}, {"username": "Renee Rundle Stoneham", "comment_text": "The Hotel Grand Royal.\nOcean front, Amazing grounds, fantastic breakfast included."}, {"username": "Lidia DeMartino", "comment_text": "Dream"}, {"username": "Gina Scalzi", "comment_text": "Hotel Plaza"}, {"username": "Lauren Van Bavel", "comment_text": "We've stayed at Hotel Miramare 3 times and can't wait to go back for our 4th visit. Staff are great and ocean views are amazing. Beautiful terrace for breakfast and dinner with a gorgeous sunset."}, {"username": "Brian LaMantia", "comment_text": "Hotel Christina. It has a pool , beautiful views, shuttle bus from train station to hotel & center of town"}, {"username": "Bridget Nisbet Saggese", "comment_text": "Hotel Minerva"}, {"username": "Kally Trahearn", "comment_text": "Definitely recommend Hotel Plaza Sorrento - have stayed there before and booked to go there again."}, {"username": "Anita Clayton", "comment_text": "We have stayed in top hotels, poor hotels and lots of apartments it depends how much you want to spend."}, {"username": "Lisa DiSalvo Timmoneri", "comment_text": "We stayed at hotel mignon and loved it! We booked it late and they were available and we are so happy they were. Great hotel and great location!"}, {"username": "Kath Milburn", "comment_text": "Conca Park hotel"}, {"username": "Kelly Roland Thompson", "comment_text": "Grand hotel Royal"}, {"username": "Giuseppe Placi", "comment_text": "Hotel Conca Park\nHotel Miramare\nMaison Marie\nPalazzi Jannuzzi\nHotel Plaza\nPalazzo Montefusco\nHotel Rivage"}, {"username": "Lillian Hattenbach", "comment_text": "We stayed at Grand Hotel Due Golfi in Santa Agata, about 10 minute shuttle drive down to Sorrento. We had a view of Sorrento from our hotel. Shuttle runs am to pm. Walked into Santa Agata. Had dinner in town. Quaint town."}, {"username": "Wendy Bey-Sottovia", "comment_text": "Hotel Corallo! Amazing!"}, {"username": "Tiffany Williams", "comment_text": "Grand Hotel Royal..5 star experience. here's the view from our room of Mt vesuvius"}, {"username": "Nicole Lee", "comment_text": "Hotel corallo is wonderful! But a little shuttle ride to main area\nMain area- hotel continental and hotel tramatano!\nWill absolutely be going back 😀"}, {"username": "Jim-Holly Ballew", "comment_text": "Jim-Holly Ballew"}, {"username": "Lisa Valdovinos", "comment_text": "We stayed in Sant’Agnello at Hotel Villa Garden. It’s a 20 minute walk to Sorrento. It’s a boutique hotel that sits on a cliff overlooking the sea. The staff is wonderful. There is a pool and the breakfast is amazing!"}, {"username": "Sarah Higgins", "comment_text": "Grand Hotel Continental****\n-Sorrento"}, {"username": "Marianne Kathleen McCrary", "comment_text": "Sorrento Continental"}, {"username": "Diana Ferro-Rodrigues", "comment_text": "Parco dei Principi & Hotel Corallo"}, {"username": "Samina Jassani", "comment_text": "We booked this for our end of September trip.\nMost of the recommended hotels where booked on our dates."}, {"username": "Colin Ng", "comment_text": "Following"}, {"username": "Julianne Waatti Kulman", "comment_text": "Hotel continental 🇮🇹"}, {"username": "Yvonne Hainey Williams", "comment_text": "This is where we stayed and it was stunning , out of sorrento and the view was stunning .\nIt was like having your own private villa and breakfast was lovely , barbara and staff amazing .\nHave a look x"}, {"username": "Billie Frances Swanda", "comment_text": "Use Frommers check out La Perla. Its on the Amafi coast. Nice"}, {"username": "Frances Scannapieco", "comment_text": "Hotel Antiche Mura. Right in the center of Sorrento. Fabulous"}, {"username": "Renee Giordano Norton", "comment_text": "Grand Hotel Capodimonte"}, {"username": "Dan Trudi Flynn", "comment_text": "Hotel de la Ville"}, {"username": "Suzanne Sanderson", "comment_text": "Hotel Plaza Sorrento"}, {"username": "Kimberly Mosiniak Seagle", "comment_text": "La Favorita"}, {"username": "Gladys Marziotto", "comment_text": "Hotel Michangelo"}, {"username": "Holl E Bee", "comment_text": "Hotel Michelangelo"}, {"username": "Cheryl Gorfinkle", "comment_text": "Imperial Hotel Tramantano"}, {"username": "Anthony Colachicco", "comment_text": "Bellevue Syrene"}, {"username": "Greg Struthers", "comment_text": "We stayed at Grand Hotel de la Ville. Very comfortable and a wonderful staff. My only complaint was about being attacked by the shower curtain while showering. :P"}, {"username": "Emma Butcher", "comment_text": "Hotel Plaza Sorrento"}, {"username": "Jason Hobel", "comment_text": "It all depends on what you are looking for and your budget and location. I didn't need anything fancy because I was only there for sleeping and showers but as long as it was clean and comfortable, I was happy. We loved Casa Evelina Sorrento. It was very nice and met all our expectations."}, {"username": "Christine Piche", "comment_text": "Hotel Rivage Sorrento"}, {"username": "Mer Riggieri", "comment_text": "Hotel Contenential"}]}, {"id": "2196576974074714", "text": "Venice here we come", "link": "facebook.com/groups/1373361046396315/permalink/2196576974074714/", "likes": 78, "comments": [{"username": "Billie Frances Swanda", "comment_text": "Wear comfortable shoes"}, {"username": "Alison Langella", "comment_text": "Enjoy its magical ✨️ 💛 💖"}, {"username": "Maryanne Calabrese Bressan", "comment_text": "Maryanne Calabrese Bressan"}, {"username": "Julie Berthiaume", "comment_text": "Yééé enjoy! 👏👏👏"}, {"username": "Celeste Marflak", "comment_text": "Have a wonderful time! Enjoy"}, {"username": "Elle Verga Francisco", "comment_text": "Have a lovely trip! Safe travels!"}, {"username": "Ruth Akutu Maccarthy", "comment_text": "Have a wonderful time"}, {"username": "Brown Weedy Weegy", "comment_text": "Have a wonderful time"}]}, {"id": "2196578037407941", "text": "My husband took this picture on our walk back from dinner in Venice.", "link": "facebook.com/groups/1373361046396315/permalink/2196578037407941/", "likes": 223, "comments": [{"username": "Michelle Riopelle", "comment_text": "Awesome photo!\nI was expecting a finger of God at the top of it! Lol"}, {"username": "Michelle Cotoni", "comment_text": "Cool!"}, {"username": "Sigrid Picken", "comment_text": "Awesome photo!"}, {"username": "Janeal Smith", "comment_text": "We were caught in this storm! It was amazing! So much lightening, thunder and rain!"}, {"username": "Erica Lowy", "comment_text": "Fantastic. Also it’s a location in Venice rarely seen"}, {"username": "Lina Stump", "comment_text": "Beautiful"}, {"username": "Lee-Ann Boting MacDonald", "comment_text": "Magnificent"}, {"username": "Debra Genovese", "comment_text": "Great photo 📸"}, {"username": "Frederick Rühr", "comment_text": "Great timing. Great photo."}, {"username": "Andrea Romano", "comment_text": "Wow!!⭐️🥂"}, {"username": "Karen Parnell Potter", "comment_text": "Going to Tuscany/Rome/\nFlorence 2024. Should we do Venice?"}]}, {"id": "2196610244071387", "text": "I will be visiting Rome, Grease and Turkey in October, should I use Credit cards, cash or exchange my American money to euro?\nThank you for you help!", "link": "facebook.com/groups/1373361046396315/permalink/2196610244071387/", "likes": 0, "comments": [{"username": "Eleni Koi", "comment_text": "Credit card is fine everywhere"}, {"username": "Stephen Henn", "comment_text": "I would definitely get some euros from your bank before leaving for vacation. Credit card works for other purchases but for beverages and small items you’ll want euros. Be sure your credit card doesn’t charge international exchange fees."}]}, {"id": "2196619510737127", "text": "Hello ~ my husband and I are traveling to Italy the last week of September/first week of October for our 10 year anniversary 🙌🏻 we are considering a hot air balloon ride in the Tuscan country side. Has anyone ever done this? Thoughts?", "link": "facebook.com/groups/1373361046396315/permalink/2196619510737127/", "likes": 0, "comments": []}, {"id": "2196580957407649", "text": "We are a family of 6 with 4 kids ages 11-18 and heading to Rome the first week of January. If you had a long day trip/excursion, would you choose Venice or Amalfi? (Amalfi would entail a private driver with visits to Amalfi, Positano). Thanks for your help! This group is great.", "link": "facebook.com/groups/1373361046396315/permalink/2196580957407649/", "likes": 0, "comments": [{"username": "Samina Jassani", "comment_text": "If you have to choose between two , I would do Venice.\n1- commute with kids via train is easy less hours.\n2- it’s a totally different experience of Venice. Especially for your age group. They can write essay lol\nI booked 2 bedroom 2 bathroom hotel in Venice. Near train station. Traveling with two boys."}, {"username": "Kay Rendall", "comment_text": "Amalfi Coast, Positano will basically be closed for three winter. The b&bs shut, most restaurants, I would think also most or all shops when the tourist s leave end October/\nNovember. Ferries stop because high seas. I believe almost all buses stop. So I would choose Venice."}]}, {"id": "2196590324073379", "text": "Has anyone rented scooters or vespas? We're looking into it for Bellagio. Do you need international drivers license if you're American?", "link": "facebook.com/groups/1373361046396315/permalink/2196590324073379/", "likes": 0, "comments": []}, {"id": "2196592614073150", "text": "Hi Group, I have a question: is Discover Card popular in Italy?? Or at least anyone use it there ?\nThanks", "link": "facebook.com/groups/1373361046396315/permalink/2196592614073150/", "likes": 0, "comments": [{"username": "Stephen Henn", "comment_text": "Not accepted anywhere that I know of. Visa, Mastercard and Apple Pay are most common form of payment."}, {"username": "Jane Lisa", "comment_text": "No, not accepted almost anywhere."}, {"username": "Carmine Castiglia Jr", "comment_text": "Carmine Castiglia Jr"}, {"username": "Rita Kanten", "comment_text": "Nope."}]}, {"id": "2196593894073022", "text": "We are planning a trip to Italy with Globus Tours in Oct. 2023. On the Sunday that we will be there we will be in Cinque Terre. I have asked our Travel Agent about the ability to attend Mass on Sunday and her response was to ask the tour guide when we are there but if it is not possible to arrange it then we will have to skip going to Mass. As a practicing Catholic that is not an option. Have any other practicing Catholics in this group run into this problem. I would appreciate your advise.", "link": "facebook.com/groups/1373361046396315/permalink/2196593894073022/", "likes": 7, "comments": [{"username": "D'Anna Hohe", "comment_text": "I’m not Catholic, but there are five different towns you are dealing with, and presumably moving between on the tour. It seems like the best course of action would be to obtain a schedule of the masses offered by the separate churches and then, perhaps you can arrange to attend one and meet up with the rest of the group later once you know the specific tour schedule.\nCould you obtain contact information through the Catholic Church to inquire about specific schedules for individual churches?"}, {"username": "Jo M Davies", "comment_text": "There were lots of local Roman Catholic churches around the region, but do be aware that many smaller towns seemed to have their services on Saturdays or unusual times to enable the priests to serve all the communities. I am sure the local hotels and restaurants will be able to advise you. Blessings"}, {"username": "Sandra Shoffner", "comment_text": "Yes, you need to check with Globus to see what their schedule is."}, {"username": "Lisa Abrams Argento", "comment_text": "You could also try for a Saturday evening Mass."}, {"username": "Linda Crockett", "comment_text": "Thank you for your suggestions. I did get more detailed information from Globus and there is no way to arrange to attend Mass on either Sat. evening or Sun. morning due to the schedule. We would have to miss the entire tour schedule on Sun. The other problem is that I was unable to get a website for the churches so I can't even confirm Mass times. I checked Masstimes.org (in case someone was going to suggest that) and they have no Mass times listed. We have no paid for the tour yet so I may have to cancel and look elsewhere. First time in Italy so we are too nervous to plan the trip on our own."}, {"username": "Debbie Zornes Ruch", "comment_text": "There is a beautiful church, Church of St. Margaret of Antioch in Varnazza. As a practicing Catholic I can’t imagine you wouldn’t be welcome. Cinque Terre is a favorite destination when I travel."}, {"username": "Young Kim", "comment_text": "I lived in Italy and Sunday mass will not be possible for the Tourist. It because most Italian Catholic Church has a Mass schedule 8,9,10 or 11 Am or 12 noon. If you are in the big Major city, then you might find it as you like it. But most of the Major city has a big church or Cathedral, you might find the good schedule for Sunday. Check your tour schedule and you might be able to attend the Mass if you happen to be in big city. I travel by myself and make my own schedule to find my time for Sunday Mass. Good Luck and enjoy your vacations!!!"}, {"username": "Greg Saba", "comment_text": "One of the many reasons, we do not do tours. We find it so much better, a lot less expensive, and obviously more flexible when you do-it-yourself.\nWe have traveled to Italy once or twice a year for 23 years and have always done it ourselves. Nothing to fear, and we have had few regrets. For example, when we hiked Cinque Terre, we were able to look at the weather and pick the best day of the week for that. There are plenty of people here and in other places on the internet who can help you and provide answers to questions as you do the planning. I would rather travel with my wife than a group of strangers. When we have joined groups for short periods of time on such things as cruise excursions, there were always people who got lost or needed to make extra trips to the bathroom that kept us from maximum enjoyment. And, hoping you get to Vernazza, as crowded as it is when groups arrive. Here's a photo of the beautiful Catholic Church there."}, {"username": "Annette Fordyce", "comment_text": "There are Catholic run tour companies that might be a good fit! I don’t have any to recommend as I’ve always just planned my own trips, but they would definitely be aware of the Sunday mass obligation."}, {"username": "Becky Jones Dodson", "comment_text": "I'm not Catholic, but I am so impressed in this day and time that you are so committed. That is wonderful. I'm of the opinion that God will forgive you for missing mass once, but that's all it is--just my opinion. We loved our Globus Tour, so I'd hate for you to miss it."}, {"username": "Monique Anne", "comment_text": "I suggest you ask when you get to you hotel. They should be able to assist."}, {"username": "Dianne West", "comment_text": "Ive never had a problem walking into any church in Italy whether mass was on or not. If youre timeframe works just rock up."}, {"username": "Linda Crockett", "comment_text": "Again, thank you for all your responses. We decided to go ahead with the scheduled trip. Fortunately, we are in the same hotel from Saturday to Monday so if we need to skip the Sunday tour to go to Mass we will do that and just catch up with the group later in the day or on Monday. It will give us the opportunity to see what its like to plan a day on our own because, God willing, the next time we travel to Italy it will be without a tour company! 😃🙏"}, {"username": "Rochelle Yngks", "comment_text": "When Im travelling, I would attend a Livestream mass or even a recorded mass from my parish. I prefer that because at least it's in English.\nI was in Milan Sept 2022, I attended a Sunday mass at the Duomo and it was in Italian. I was able to follow the readings on my cellphone. EWTN should have live and recorded masses."}]}, {"id": "2196594334072978", "text": "Hello, we are flying into Venice Airport (Marco Polo) on a late flight... Our hotel is in the Mestre area..can I ask please, what's the best form of transfer to our hotel? Bus/taxi/other etc, how long would it take, & how much please?\nThank you....", "link": "facebook.com/groups/1373361046396315/permalink/2196594334072978/", "likes": 1, "comments": [{"username": "Don Moberly", "comment_text": "How did you make out with this as none answered your question. I'm also flying into Venice and wondering how to get to hotel. It's my understanding you need a water taxi at some point. But need a bus from water taxi?"}]}, {"id": "2196604794071932", "text": "Thinking about doing to Italy\nVenice.florence milan .Rome Pompeii.\nAt the end of March begining of April\nAny advice .where to fly in.\nHotel.routes.(TIA)", "link": "facebook.com/groups/1373361046396315/permalink/2196604794071932/", "likes": 0, "comments": [{"username": "Jade Stringer Alkire Wisecup", "comment_text": "Same here, hopefully we will get some good advice."}, {"username": "Tracy Piko Lawniczak", "comment_text": "I would just start searching to see which is the cheapest to fly to. Then create your itinerary from there. What’s what I did my first time coming to Italy. I didn’t want to spend a fortune on flights.\n\nYour places you want to visit could do it a few different way. Start from the south in Rome and work your way north. Rome, Florence Milan venice or RFVM or VMFR etc. if you want in one out of the other. Also depends on how many days you are going too. Have to take into account the travel time. Venice to Rome is 4 hrs on the fast train"}]}, {"id": "2196603507405394", "text": "Thank you for all the advise I got from this group:) I just back home from 2 weeks vacation, adding some notes and pictures.\n\nVisited: Genova Florence Rome\n\nPositano pompeii Amalfi Coast\n\n1- I had a great timeआणखी in Italy, just really hot, so never I go back in summer:)\n2- You need Euro for Taxi, we paid with credit card in Spain for all Taxi but not in Italy.\n3- All the tours were perfect except one day trip from Rome to Positano pompeii Amalfi Coast, 1 hour in Pompeii and 1.5 hours in Positano, rest of the 12 hours were sitting in the bus.", "link": "facebook.com/groups/1373361046396315/permalink/2196603507405394/", "likes": 2, "comments": []}, {"id": "2196604427405302", "text": "We are going to Florence at the end of September and will be getting a Florence Pass. Do we still have to make reservations or line up when going to attractions such as the Uffizi?\nThanks in advance.", "link": "facebook.com/groups/1373361046396315/permalink/2196604427405302/", "likes": 0, "comments": [{"username": "Karen Schmidt", "comment_text": "I would suggest booking everything with a tour guide. They by pass all lines, and in some cases have a dedicated entrance. I was in Florence at the beginning of October last year and the lines were insane. I can’t even imagine right now. Our tour walked past everyone. It was a lifesaver"}]}, {"id": "2196610020738076", "text": "I am a super confident driver (who lacks patience at time) so a van with driver was the best option for our Sorrento to Naples leg as we just could not handle another trip on the Campania ‘Express’ just afterआणखी this in the tunnel a bus sped past us and two vehicles in front of us on the wrong side of the road (unless the double white lines and oncoming traffic don’t mean the same as they do back home).", "link": "facebook.com/groups/1373361046396315/permalink/2196610020738076/", "likes": 6, "comments": [{"username": "Billie Begley", "comment_text": "Yeah driving in Naples was interesting. The private drivers were awesome but there were times I questioned if we would get there in one piece"}, {"username": "Angela Gilmore", "comment_text": "They say that if you learn driving in Italy and Malta you can drive everywhere 😅\n\nCan I ask you what happened on the Campania Express?"}, {"username": "Betsy LaCasse Karver", "comment_text": "Not clear from picture what is happening"}, {"username": "Lisa Gaimaro Sullivan", "comment_text": "Sums it up. We have another going head on with a bus!"}, {"username": "Renee Bruno-Arias", "comment_text": "I’m very nervous in the car. Will I be ok on the drive from Naples to Praiano? We have a private driver?"}, {"username": "Paula Brink", "comment_text": "Lol this looks familiar.\nMy husband drove during our 2 week stint in the area and I cringed and said bad words a lot from the shotgun seat lol.\nThat double white line was the third lane for motorbikes and scooters going in both directions!"}, {"username": "Lisa Ann", "comment_text": "I wish I had a video of our taxi ride in Naples! 😂 Rules of the road? Nope, not in Naples!! It was indeed memorable.\n\nNaples has it’s own set of rules for everything. There are none. 😆"}, {"username": "Angela Emmitte Tripp", "comment_text": "They drive insane in Amalfi loo"}, {"username": "Terri Brinkman", "comment_text": "Naples to sorrento was the scariest driving and drivers I’ve ever experienced….an\nd I don’t say that lightly….being from the U.S., they make NYC, LA, Orlando, anywhere here look like amateurs at best. If one isn’t prepared or a defensive driver, don’t drive there, it’s unlike anything ever! 🤷‍♀️🫣🙌🙏"}, {"username": "Janet Isaacs Lanza", "comment_text": "I have never in my life seen drivers like in Italy. I've heard it's this way all over Europe. It's like there are no rules at all. They just do whatever they want. We have drivers and I'm scared for my life 😂"}, {"username": "Ray Kelley", "comment_text": "They do that."}, {"username": "Ellen Edmonds-Wilson", "comment_text": "We saw some scary driving in Italy. 😬😳😱"}, {"username": "Alice Francesca", "comment_text": "It s PEAK TURIST SEASON.avoid driving anywhere in the Amalfi area."}, {"username": "Giorgia Petraia", "comment_text": "If you need to surpass someone and noone is coming opposite direction and police is not around you can do that"}]}, {"id": "2196610190738059", "text": "Hi, this will be our second trip to Rome so I’d like to see things I didn’t have time for on my last trip. I’m interested in hearing from travelers who have gone to Villa Borghese. Did you book through the museum? I’m interested in a tour and a visit of the gardens. Any thoughts and recommendations are most welcome.\n\nThank you.", "link": "facebook.com/groups/1373361046396315/permalink/2196610190738059/", "likes": 1, "comments": []}, {"id": "2196610230738055", "text": "We had to rearrange our entire trip due to my daughter breaking her leg on the second week of our holiday and had to cancel all accommodation. We have found new, last minute accommodation in most Italian cities but still looking for accommodation in Rome - 29/7 - 2/8.\nPrefer an apartment, central as my daughter will be in a wheelchair, no steps and including a/c for 4 people.\nCan anyone please recommend something. Thanks", "link": "facebook.com/groups/1373361046396315/permalink/2196610230738055/", "likes": 0, "comments": [{"username": "Stacy Derouin", "comment_text": "It's not an apartment, but we were really happy with Hotel Stendahl in Rome with a wheelchair. Hopefully someone will have an apartment suggestion."}]}, {"id": "2196612477404497", "text": "IMPORTANT INFO:\nFor those traveling to Europe for 2024 and beyond, you will have an additional travel requirement - ETIAS. This is like a visa requirement, they call it an \"authorization\". There are 30 countries (that you travel from) that this affects and the USA is one of them. It's a minimal fee (7 euros) and supposed to be a fastआणखी application but just allow yourself enough time to have it approved.\nI wasn't aware and just wanted others to be aware so their vacations aren't ruined because of not knowing. Just google it and it'll give you the specifics.", "link": "facebook.com/groups/1373361046396315/permalink/2196612477404497/", "likes": 365, "comments": [{"username": "Rhiannon Bowden", "comment_text": "No different to the US Esta Waiver. Easy to do"}, {"username": "Morgan McFarlane", "comment_text": "Laura Van Nus"}, {"username": "Neti Maioriello", "comment_text": "Thankyou"}, {"username": "Dani Marie Criscuolo", "comment_text": "Chris J Criscuolo"}, {"username": "Jules Blumke", "comment_text": "Thanks for this info. I didn't know this was going to happen."}, {"username": "Michele Donley", "comment_text": "Angela Lewis"}, {"username": "Maria Spalvieri", "comment_text": "Thank you for sharing"}, {"username": "Pickles Pohl", "comment_text": "Christy Arneson"}, {"username": "Brittney Ziemniak", "comment_text": "Yvonne Lopez"}, {"username": "Julie Garcia Cortinas", "comment_text": "Robin Silicani Hasson"}, {"username": "Kris Martin", "comment_text": "Julie this is us too."}, {"username": "Judy Dimino Olsen", "comment_text": "Karolyn Olsen"}, {"username": "Ruth Akutu Maccarthy", "comment_text": "Thanks"}, {"username": "Dana Guidotti Rooney", "comment_text": "I’m wondering will this apply to Australian passport holders."}, {"username": "Meredith Holloway Helbon", "comment_text": "Following"}, {"username": "Gina Hajdu", "comment_text": "Tammy Hajdu-Burrows"}, {"username": "Yvonne Lopez", "comment_text": "Loco Lopez Brittney Ziemniak"}, {"username": "Sandy Vee", "comment_text": "Only 7 euro pp LOLOL. Times 70 million visitors. Cash grab."}, {"username": "Bianca Sparacino", "comment_text": "Gabriel Sparacino"}, {"username": "Monica Foster", "comment_text": "Stephanie Gordon"}, {"username": "Karen Espinoza", "comment_text": "Thank you 🙏"}, {"username": "Samantha Jo", "comment_text": "180 day grace period from January 2024. Thank you for posting this! Super useful information. We will need it for a lot of up coming travels to Europe."}, {"username": "Mindy Jo", "comment_text": "So i rrad this article as follows. If I travel to Italy and Switzerland in November of 2023 I will not need an ETIAS? Am I correct that it's not required until 2024?"}, {"username": "Anne Contini", "comment_text": "I'm british but a French resident - do I need one for Italy?"}, {"username": "Sandra Elaine Arriola", "comment_text": "I have American Express or Mastercard. Never leave home without. 😩"}, {"username": "Christine M Machacek", "comment_text": "This has been all over the news this weekend. However no one reported when the application will become available or the link to it. I hope we are all not scrambling to get this done for 2024. I’m traveling to Rome but not until Sept. of next year. I’m thinking I will have some time to do it."}, {"username": "Lorri Parenti Smith", "comment_text": "Ashlea Botello"}, {"username": "Jerry Hagan", "comment_text": "Show me you papers…."}, {"username": "Gerard Condo", "comment_text": "Another nail in the freedom coffin a €7 fee that will go up quickly. We already pay a per day tax to stay in many countries which is BS. I think my days of Europe travel will stop once this starts......🤬"}, {"username": "Gerard Condo", "comment_text": "Already have to pay a BS per day tax....Now more money and our personal details to be sold on as well....🤬"}, {"username": "Deborah Shaw", "comment_text": "So glad we’re traveling this fall!"}, {"username": "Susan Zimmerman", "comment_text": "Alison Harp LeCraw"}, {"username": "Tina Bellitto", "comment_text": "I don't think it applies if you're dual citizenship,wil\nl have to do more research"}, {"username": "Sara Schoonmaker Brumfield", "comment_text": "Brad Brumfield"}, {"username": "Erica Madrid", "comment_text": "Ariyanna Madrid"}, {"username": "Simone Beck", "comment_text": "Rachel, Kylie and Shanelle I wonder if this relates to us too?"}, {"username": "Rar Storti", "comment_text": "Lisa Fitzhugh"}, {"username": "Julie McDonnell", "comment_text": "Emily Gruber Mirjalili"}, {"username": "Trish Lee Morrison", "comment_text": "Brandy Landrum Turner"}, {"username": "Ryane Sabatelli Garcia", "comment_text": "Lorrie Sabatelli-Harri\ns"}, {"username": "Lynne Keegan", "comment_text": "Jenny Curties"}, {"username": "Kelli Barto", "comment_text": "KT Hertz👋"}, {"username": "Lisa Roussel LeBouef", "comment_text": "Marla Rodrigue Brignac"}, {"username": "Nicole Mcleod", "comment_text": "Rob McLeod"}, {"username": "Sue Swail Bang", "comment_text": "Kristopher Bang"}, {"username": "Amy Carroll-Saravana", "comment_text": "Rebecca Vaughn Caldow Cindy Caldow Campos"}, {"username": "Sonia Read", "comment_text": "Michael Strijder"}, {"username": "Charlie Charnigo", "comment_text": "Just another tax…traveling takes money and the government wants to take it. Call it what ever acronym you want. And to think the money will be used as intended…🤷🏼‍♂️😂"}, {"username": "Lisa Gold Duncan", "comment_text": "Thanks for the update."}, {"username": "Paula Bennett", "comment_text": "Stacy Bennett"}, {"username": "Nora K Brown", "comment_text": "Everett Brown read this..."}, {"username": "Sam Cowie", "comment_text": "I’m in Italy now and have seen adverts about it."}, {"username": "Norah Guerin", "comment_text": "I get why they are doing this. We are currently traveling thru Europe and have been using the train, no ID required, no security at train station, no baggage screening. It’s a great service but one that can be a vulnerable spot. We started in Paris and are now in Luxembourg and not ID presented"}, {"username": "Cris Wimer", "comment_text": "Sounds like a money grab"}, {"username": "Lisa Geeringh", "comment_text": "Jacques Geeringh"}, {"username": "Èkrærkë Rêdńëv Lýzëíl", "comment_text": "Ff"}, {"username": "Èkrærkë Rêdńëv Lýzëíl", "comment_text": "If i travel 5 countries do i need ETIAS EVERY COUNTRY"}, {"username": "Deborah Wilson Melton", "comment_text": "Yes heard about this. Thanks for the reminder"}, {"username": "Jeanette Plummer", "comment_text": "Valerie are you aware of this?"}, {"username": "Dori Richardson Burton", "comment_text": "Nancy Juckem"}, {"username": "Lori Sammons", "comment_text": "Thank you"}, {"username": "Ann Law", "comment_text": "Thank you"}, {"username": "Megan Joyce", "comment_text": "Justihn Mychel"}, {"username": "Machel Bigelow Salado", "comment_text": "Thank you!"}, {"username": "Colleen Dawson", "comment_text": "It has been an ongoing decision, should have been later this year, now postponed to 2024. Possibly will be extended again."}, {"username": "Starla Dawn", "comment_text": "Well glad I travelled when I did."}, {"username": "Susan Levine Solomon", "comment_text": "Saw this! Thx for sharing:)"}, {"username": "Kim Kirsten NeeMeglic", "comment_text": "Like the ESTA for the usa"}, {"username": "Peggy Frain", "comment_text": "Never heard of this. Why now? Nothing I’ve read in the newspapers either ☹️"}, {"username": "Linda Jo Rice", "comment_text": "Not available to apply for yet"}, {"username": "Diane Plott Miller", "comment_text": "Online application and should be approved very quickly."}, {"username": "Jenny Phelps", "comment_text": "Thank you for posting! We moved our original travel dates because it was originally scheduled for November 1st but very little information had been released. Hopefully the new date will give them an opportunity to iron out the details."}, {"username": "Gwen Cooke", "comment_text": "I didn’t realise this was something to applied to the USA … I thought it was just for us Brits having dared to leave the EU … nice to know it’s not just us …"}, {"username": "Debbie Correa", "comment_text": "Kennetha Sanchez"}, {"username": "Dawn Burton Hammon", "comment_text": "https://\ntravel-europe.eu\nropa.eu/\netias_en"}, {"username": "Lyn Pappas Dahm", "comment_text": "No way Italy will be able to implement this! The approvals would take months. Total chaos"}, {"username": "April Dykes", "comment_text": "Would this be applicable for people travelling from the UK to Rome? 😳😳😳😳"}, {"username": "Cheri Fox", "comment_text": "Joseph Albertson"}, {"username": "Rhona OConnor", "comment_text": "Is this a scam???? 🤔"}, {"username": "Karen Capper", "comment_text": "Pam Deeble"}, {"username": "Eva McLean", "comment_text": "Is this the same as the visa being (or soon to be) required to visit any of the Schengen area countries? I believe there are 26 of them and I know Canadian travelers do (or will soon) need one to travel to/from any of them."}, {"username": "Karen Dittman", "comment_text": "It’s something I read about about 2019. I believe Covid slowed this program down."}, {"username": "Kathryn Porell Fournier", "comment_text": "They have postponed it so many times. You still can’t apply so idk 🤷🏻‍♀️"}, {"username": "JoAnn Sgarlata Simmons", "comment_text": "Michelle Vincent do you know anything about this ?"}, {"username": "Evy Fredy", "comment_text": "How about Canada?"}, {"username": "Debbie DiOssi", "comment_text": "This has been postponed a couple times. I haven’t seen where they have an official implementation date yet though."}, {"username": "Debbie Morton", "comment_text": "It is allegedly to do with BREXIT but I suspect more about tracking people’s movements and I understand that. It’s good for 3 years so you don’t have to reapply every trip."}, {"username": "Michelle Broome", "comment_text": "Yes, I just read this article today but this has been in the news for a while."}, {"username": "Donna Dillon", "comment_text": "It’s just like us Aussies going to America. We need to complete an ESTA online prior to travel.\nIt’s quick and painless"}, {"username": "Debbie Vitale", "comment_text": "Thank you, put it on my calendar for January '24"}, {"username": "Beverly Kerr", "comment_text": "https://\netias.com/\netias-confirmed-\nfor-2024"}, {"username": "Diane Rogers-Gajewski", "comment_text": "Thank you 😊!!"}]}, {"id": "2196614927404252", "text": "We are looking to do a day trip to lake Garda in September from Milan. We are a group of ladies who are foodies, love good wine and to explore can be off the beaten path. Any reccs on what to see do, wine tasting maybe. Food? Thank you.", "link": "facebook.com/groups/1373361046396315/permalink/2196614927404252/", "likes": 5, "comments": [{"username": "Alice Francesca", "comment_text": "One day is not enough! You will see Desenzano, where the train stops but you won't be able to explore other than Sirmione (one short bus trip from Desenzano train station) .I highly recommend to stay at least 3 days and take ferries to Riva del Garda up north, Malcesine, Isola del Garda, Salo', Limone del Garda.Stunning places."}, {"username": "Alice Francesca", "comment_text": "https://\nwww.italia.it/\nen/veneto/\nmalcesine"}, {"username": "Alice Francesca", "comment_text": "https://\nwww.isoladelgard\na.com/en"}, {"username": "Alice Francesca", "comment_text": "https://\nwww.gardatrentin\no.it/en/\ntowns-villages/\nriva-del-garda"}, {"username": "Alice Francesca", "comment_text": "https://\nvisitsirmione.co\nm/en/"}, {"username": "Virgz Van Møøre", "comment_text": "Rather stop in Peschiera, smaller and cuter"}, {"username": "Ruth Akutu Maccarthy", "comment_text": "There are so many places you could visit!\n\nDesenzano: very beautiful and long frontlake, you can swim and enjoy a sunbath, the center has many bars to drink.\n\nPeschiera: River Mincio entering in Garda lake gives it a spectacular blu/green colour that will give you breathtaking pictures. Many many restaurants along the \"canal\" with a fantastic view, there's a little touristic train you can hope on to tour the frontlake if you don't want to walk.\n\nRiva del Garda: you must take the transparent lift that leads on the hill where there is an ancient fort to visit and a modern restaurant to drink and eat, obviously the view is incredible.\n\nBardolino: there's LIFE in Bardolino! Restaurants, bars, hotels, frontlake, flowers! Everything.\n\nLimone del Garda. A beautiful small jewel, I suggest you get there by ferry early in the morning because it gets dark quicker there ( the mountains cover the sun). You can hire electric bicycles and circle on what I think is the longest European suspended frontlake the visit the center for lunch ( many fish restaurants), souvenir shopping.\n\nFinally Malcesine: I personally love the beach of Malcesine the water is so clean and transparent, then you can visit the castle\n\nEnjoy"}]}, {"id": "2196624177403327", "text": "USING GOOGLE MAPS...\n\nOff the back of my train advice I thought I would share this as well.\n\nHow do you go A to B / town to town and know what to do/take....\n\nPersonally we used google maps first then each app ofआणखी the main suppliers (trenitalia, italo and flixbus).\n\nHopefully video helps.\n\n2 examples:\n1 - 1 station to another and how to see what trains are going and times etc (even for later dates)\n\n2 - Station in 1 town to example hotel in another (used as I knew it would include train and bus example).\n\nHope this helps!", "link": "facebook.com/groups/1373361046396315/permalink/2196624177403327/", "likes": 0, "comments": []}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2196624637403281", "text": "Restaurant RECs near Hotel Artemide?! No tourist trap!! Hidden gems!!❤️🇮🇹🍷❤️🇮🇹", "link": "facebook.com/groups/1373361046396315/permalink/2196624637403281/", "likes": 3, "comments": []}, {"id": "2196627667402978", "text": "Is Swiss airline a good airline?", "link": "facebook.com/groups/1373361046396315/permalink/2196627667402978/", "likes": 9, "comments": [{"username": "Viktória Fazekas", "comment_text": "Swiss and Austrian airlines is a best airlines!"}, {"username": "Kit Nader", "comment_text": "Yes"}, {"username": "Connie Wilson", "comment_text": "We fly Swiss exclusively from SFO. Zurich is an easy transfer for flights anywhere in Italy and Europe. Never had a problem!"}, {"username": "Colin Karen Harrison", "comment_text": "Yes"}, {"username": "Yolanda Hanavan", "comment_text": "Yes, I’ve flown on them twice and was very happy with the service."}, {"username": "Berndt Weihs", "comment_text": "Yes,one of the best!"}, {"username": "Edmond Nolan", "comment_text": "They are amazing I’ve used them a lot they are part of the Lufthansa group"}, {"username": "Linda Miller", "comment_text": "The on board chocolates are wonderful!"}, {"username": "Simone Pfenninger", "comment_text": "Only in Business or First. Eco is pretty poor."}, {"username": "Marie Parker", "comment_text": "Yes, I’ve flown it a few times in the past 3-5 years.\nThey have merged with a couple others now: under the Lufthansa Group."}, {"username": "Sam Izzo", "comment_text": "I’ve flown them multiple times. I’ve had no issues with them. Now their German counterpart is a different story"}, {"username": "Miriam Rios Paneque", "comment_text": "Yes!!!"}, {"username": "Mat PO", "comment_text": "Tell me one thing Swiss that is not good…"}, {"username": "Wayne Solis", "comment_text": "Without a doubt"}, {"username": "Judi Ryan Graff", "comment_text": "Love it!!!!"}, {"username": "Joanne Hopkins-Lucia", "comment_text": "The best ! 👏👏👏"}, {"username": "Penny Bellofatto Westberry", "comment_text": "Their biz class seat from MIA to ZRH was not great this past May."}, {"username": "Delly Tracy", "comment_text": "Yes very. Great service and very helpful staff. Ive nade a big mistake choosing to go elsewhere for my September trip to Rome. I wish I'd stayed with them à ive used them for many years"}, {"username": "Lindsay Stewart", "comment_text": "We love it! Top notch service"}, {"username": "Frank Hunt", "comment_text": "Mixed, depends on the crew!"}, {"username": "Mariusz Sz", "comment_text": "W klasie biznes leciałem wielokrotnie na trasie ZRH - Azja. Jedzenie było bardzo dobre, niestety wybór win słaby. Obsługa i ambiente bardzo przyjemna."}, {"username": "Anthony Parisotti", "comment_text": "Sam Izzo Lufthansa?"}, {"username": "Anthony Parisotti", "comment_text": "Sam Izzo Lufthansa?"}, {"username": "Suzana Ferreira", "comment_text": "Yesss"}, {"username": "Alla Zats", "comment_text": "Worst Business Class compared to others. Economy is a nightmare. Food and flight personnel very decent."}, {"username": "Connie Rai", "comment_text": "One of the best"}, {"username": "Zoli Berecki", "comment_text": "Like the watches made there ... if you heared about them 😏😏"}, {"username": "Lena Hrdlickova", "comment_text": "Absolutely"}, {"username": "Lili Dis", "comment_text": "One of the best I ever used."}, {"username": "Larry Reinier", "comment_text": "Yes somewhat spendy"}, {"username": "Jennette Riches", "comment_text": "here is the Tripadvisor reviews for Swiss https://\nwww.tripadvisor.\nca/\nAirline_Review-d\n8729160-Reviews\n-Swiss-Internat\nional-Air-Lines\n-Swiss"}, {"username": "Ann Marshall", "comment_text": "One of the best."}]}, {"id": "2196624974069914", "text": "Hi guys! We are going to be in Italy for about 2 weeks. We chose to stay in Rome and Venice. I’d love to take some day trips to neighboring towns or villages. Any recommendations? Thanks in advance!\nAlso, should I spend more time in Rome and less in Venice or should I divide the time equally?", "link": "facebook.com/groups/1373361046396315/permalink/2196624974069914/", "likes": 1, "comments": [{"username": "Karen Schmidt", "comment_text": "You easily have time for a 3rd location. 5 in Rome (with Day-trip to Orvieto), 4 in Venice (With day trip to Verona) and maybe Florence, Cinque Terre or Sienna for 5 more?? There are beautiful day trips from all those locations too. Just a thought 😊"}]}, {"id": "2196628370736241", "text": "For those of you looking for less expensive places in Rome, go to monasterystays.com and look for Casa Maria Immacolata, a convent on Via Ezio. I’m there now, and it’s just what we needed!", "link": "facebook.com/groups/1373361046396315/permalink/2196628370736241/", "likes": 2, "comments": [{"username": "Leslie BC", "comment_text": "Fantastic"}]}, {"id": "2196629600736118", "text": "Please share the best company that you have used to take day tours/trips during your stay in Sorrento? We are planning to stay a week and want to explore Sorrento, Capri, Positano, Ravello, etc. Thank you kindly!", "link": "facebook.com/groups/1373361046396315/permalink/2196629600736118/", "likes": 0, "comments": [{"username": "Giuseppe Placi", "comment_text": "Transferelax\nSorrentocars\nGuemar\nUmberto Limos"}]}, {"id": "2196631607402584", "text": "Going to Italy next year. Doing Rome and Florence. Trying to decide between Venice or Milan after Florence. Which is better for a few days?", "link": "facebook.com/groups/1373361046396315/permalink/2196631607402584/", "likes": 8, "comments": [{"username": "Melissa Feielin Hawkins", "comment_text": "Just got back from Italy. We did Milan, Venice, Amalfi coast , Rome. Venice was our absolute favorite. Just something beyond magical about it. Once you step away from the main cluster of tourists traps and get lost in neighborhoods it’s like you just stepped back in time.\nI’ve posted a few travel Tik toks you can check out at\nMrsfirehawk702"}, {"username": "Gillian O'Callaghan", "comment_text": "Venice because it's unique."}, {"username": "Suzanne Mills", "comment_text": "Venice"}, {"username": "Jerry Lyubelsky", "comment_text": "Venice is definitely unique but it was WAY to crowded and food was no buono"}, {"username": "Renae Larcus", "comment_text": "Venice!!!"}, {"username": "Daniela Parhar", "comment_text": "I’d do Milan and if you still can, Venice. They can both be done in only a few days."}, {"username": "Alyce Henry", "comment_text": "Just left Venice stayed 6 days,wasn't to crazy 6 days in Milan Venice is breathtaken"}, {"username": "Laura Piccinini", "comment_text": "Venezia !!!"}, {"username": "Diana Ferro-Rodrigues", "comment_text": "Venice"}, {"username": "Carol Taylor Tisdale", "comment_text": "If you have never seen Venice before … gotta go there. So unique and is a great experience."}, {"username": "Abe Michelson", "comment_text": "Venice. Especially for a couple of days. If it’s your first time. Venice is a must."}, {"username": "Robyn Lawson", "comment_text": "There is no question…. Beautiful and stunning Venice 💙🥂"}, {"username": "Connie Wilson", "comment_text": "Venice!"}, {"username": "Pam Armenia O'Brien", "comment_text": "Venice"}, {"username": "Monica Sucato", "comment_text": "Venice! It Is unique!"}, {"username": "Kristina Ruk", "comment_text": "If from those 2 I would choose Venice..as once in a lifetime you have to see it ;)"}, {"username": "Pao Magnoler", "comment_text": "Venice!"}, {"username": "Romina Lauretig Toscano", "comment_text": "Venice !"}, {"username": "Barbara Brosnan", "comment_text": "We were just in Venice and loved it. Stayed in an amazing AirBnB in Canarrgio, away from the crowds but short walk to those areas."}, {"username": "Stephanie Blasko", "comment_text": "Don’t miss Venice! Nothing like it!"}, {"username": "Dave Colleen", "comment_text": "Venice"}, {"username": "Phyllis Snyder", "comment_text": "I think Venice."}, {"username": "Krissy DaRusso", "comment_text": "Definitely Venice over Milan!"}, {"username": "Karen Albertyn Wood", "comment_text": "Venice"}, {"username": "Mary Jackson", "comment_text": "Venice…….magica\nl. We stayed five days and each day was filled with absolute joy. Walked all day, ate well, got lost found our way again. The nights were just spectacular!"}, {"username": "Elyssa Gross", "comment_text": "Venice! Such a beautiful city"}, {"username": "Carolyn Chambers Rosamilia", "comment_text": "Venice no question!"}, {"username": "Connie Titone", "comment_text": "Venice"}, {"username": "Danielle Johnston", "comment_text": "Venice I loved"}, {"username": "Chantal Loir", "comment_text": "Venice!!!!!!"}, {"username": "Michelle Casillas", "comment_text": "Honestly. If you have a few days do both! Milan has amazing architecture and of course “The Last Supper”. But Venice is wellllll VENICE!!! I did Milan in 24 hrs (we booked the walking tour with the last supper-well worth it!) and Venice in a day as well (only the main island where San Marco’s\nSquare is and Burano Island). It’s not for the faint at heart and many people say don’t try to do too much. BUT if this is your only chance my vote is for both. 🥂🇮🇹"}, {"username": "Stacy Prestigiacomo", "comment_text": "Venice 1000 percent"}, {"username": "Alexandra A Welker", "comment_text": "Venice is a must, do not miss since you're already in Italy, at least 2 nights 3 is even better. Milan can be done in one day/one night."}, {"username": "Linda Chase", "comment_text": "Venice"}, {"username": "Annette Fordyce", "comment_text": "I love Milano and always end my trips there. The climb to the top of the Duomo is amazing, and seeing The Last Supper was a bucket list item for me. Plus the shopping is amazing, and I like doing it at the end so I’m not lugging my purchases around for the first part of the trip. However, we were there in May and it was very crowded. If you don’t do well with crowds and do not care as much about the shopping, you can’t go wrong with a few days in Venice!"}]}, {"id": "2196617747403970", "text": "Fly virtually to Sicily! Our expert guide will lead you on a virtual journey through this beautiful island, to explore the most beautiful places of Sicily!\n\nJoin our virtual experience: आणखीhttps://nextstop-italy.com/virtual-tours/best-of-sicily/\n\n#medievalart #italytravel #italyiloveyou #virtualworld #italytrip #vacationmood #sicily #sicilylove #sicilyitaly #sicilytravel #sicilyessence #sicilytourism #sicilypictures #TAORMINA #taorminasicily #cefalù #cefalusicily #ValleyoftheTemples #syracuse #ortigia #ortigiaisland #palermo #palermo #archaeology", "link": "facebook.com/groups/1373361046396315/permalink/2196617747403970/", "likes": 6, "comments": []}, {"id": "2185883405144071", "text": "A beautiful spot from which explore Tuscany😍\nSituated at the base of Sant’Angelo in Colle, a small village, and overlooking some vineyards, this is a very special place located only ten minutes away from the… आणखी famous Montalcino! It's the complete Tuscan experience!\nDiscover more: https://www.kqzyfj.com/click-100692842-11552042?url=https%3A%2F%2Fwww.tripadvisor.com%2FHotel_Review-g1725292-d8517803-Reviews-Castel_Brunello-Sant_Angelo_in_Colle_Montalcino_Tuscany.html%23%2Fmedia%2F8517803%2F198307643%3Ap%2F%3Falbumid%3D101%26type%3D2%26category%3D101", "link": "facebook.com/groups/1373361046396315/permalink/2185883405144071/", "likes": 3, "comments": []}, {"id": "2148922242173521", "text": "Desirèe experience. Visit of the marine caves of Vieste.\nHire a private boat to explore the unspoiled Gargano coast and let the skipper take you to the region's secluded beaches and bays, some of which are… आणखी inaccessible by land. During the round trip from Veste to Baia delle Zagare you can relax on the deck and listen to commentary on coastal attractions in English or Italian.\nRead more about Desirèe experience. Visit of the marine caves of Vieste - https://www.viator.com/tours/Vieste/Desiree-coastal-trips-Tour-to-visit-the-marine-caves-of-Vieste/d50845-140985P2?pid=P00070587&mcid=42383&medium=link&medium_version=selector", "link": "facebook.com/groups/1373361046396315/permalink/2148922242173521/", "likes": 7, "comments": []}, {"id": "2196457594086652", "text": "I’m just starting to plan for a 2024 trip in May. Is it easy to take day trips if your home base will be in Tuscany? I want to go to Naples,Pompeii and Amalfi. Can we go by train or need to rent a car? I didn’t really want to move around place to place if it’s reasonable to do. Or maybe the travel costs outweigh staying in one place? Planning to fly in/out of Rome or Florence. TIA for any advice.", "link": "facebook.com/groups/1373361046396315/permalink/2196457594086652/", "likes": 6, "comments": [{"username": "Brad Nelsen", "comment_text": "Tuscany is a LONG way from those places - at least 4 hours by car."}, {"username": "Jenny Payne", "comment_text": "Depends how many people involved? I go a lot to Italy and if I’m showing friends around this is what I do, usually stay in a 3 star hotel in Rome near termini ( if u stay in a hotel you can leave your luggage) and I go off with a backpack & crossbody bag and cabin size case, if you get an Airbnb u can’t do that . So I plan to try and not backtrack as fast trains are not cheap but never go in peak times am & pm. Florence always get an Airbnb & do day trips to Lucca, Siena , and wherever else you like , then I’ll take the fast Train to Naples then local train to Sorrento and make that my base airb&b and do day trips to all the other towns🌻"}, {"username": "Lucrezia Folger", "comment_text": "From where ever you are in Tuscano day trips to those areas is not possible. It is too far."}, {"username": "Dann Hrusch", "comment_text": "Better off planning on having two bases. One for Rome, Naples, Amalfi and Pompeii and then move up to Tuscany/\nFlorence."}, {"username": "Alice Francesca", "comment_text": "Train from Florence to Rome in 2 hrs"}, {"username": "Glenn Todd Webb", "comment_text": "Those places are a long way, you can’t do all them in 1 day trip, and they are clustered together. So consider staying a few days in that area and not making trips back and forth."}, {"username": "Gary W Anderson", "comment_text": "For Tuscany base in Florence, easy guided day trips. I personally recommend trains because they are clean, on time and quick. We stayed in Sorrento and day tripped to all the southern locations you stated. Don’t forget Rome and as soon as you set your dates get reservations and skip the line tickets ASAP. Do make copies of all papers, passports and cards before you leave just in case. Travel safe, eat well and enjoy gelato"}, {"username": "Virgz Van Møøre", "comment_text": "Then have a base in Sorrento"}, {"username": "Steve Grossman", "comment_text": "It's four and a half hours each way to the places you mentioned. So if you don't feel like getting another hotel, just drive for 9 hours a day"}, {"username": "Tracy Wrinn Mcdermott", "comment_text": "If you go for two weeks I would divide your time between a base in Florence/\nTuscany area another base in sorrento to access Naples, Pompeii (use the circumvesuviano\ntrain for day trips ) , and the Amalfi Coast (use ferry for day trips). Add 2/3 ngts in between for a stop in Rome. Rent a car just in the Tuscany region, outside of Florence, to visit smaller hilltop towns and wineries."}, {"username": "Helen Ladkin", "comment_text": "Lovely to have your first base somewhere in Tuscany, but Amalfi Coast would be best visited from a base in that area."}, {"username": "Jeff Gentner EA", "comment_text": "If you want to see Naples, Pompeii, and Amalfi, I'd stay in Naples or Sorrento. We love Sorrento, so that would be my choice. Easy train to Pompeii or Naples from there. For Amalfi, we usually hire a driver."}]}, {"id": "2196476540751424", "text": "hello, we are traveling to Italy the last week of August through the middle of September.\n\nWe have three private tours - in Milan Rome and Florence respectively\n\nWe are taking a train to, and from Milan to Rome and we are staying in four-star hotels for seven nights. A travel agency has booked the above for us and it is over 5k\nThoughts?", "link": "facebook.com/groups/1373361046396315/permalink/2196476540751424/", "likes": 2, "comments": []}, {"id": "2196424267423318", "text": "We’ll be traveling to Florence for 2 days and plan to visit Pisa. Interested to know if there are beaches or towns worth visiting by the sea in that area?", "link": "facebook.com/groups/1373361046396315/permalink/2196424267423318/", "likes": 2, "comments": [{"username": "Simone Pfenninger", "comment_text": "Viarggio"}, {"username": "Claudia Amp", "comment_text": "Viareggio, Livorno area too."}, {"username": "Tiffany Watson", "comment_text": "Thank you! Do you recommend going by train from Pisa or a car service?"}, {"username": "Claudia Amp", "comment_text": "This is Quercianella"}, {"username": "Claudia Amp", "comment_text": "Castiglioncello"}]}, {"id": "2196365294095882", "text": "I have just seen that a train strike is announced for 6 September, Trenord Srl, Lombardia.\nI am flying into Milan on that day and was hoping to catch the Malpensa express to Centrale and then a train to Varenna.\nDo you think this strike affects these trips?", "link": "facebook.com/groups/1373361046396315/permalink/2196365294095882/", "likes": 2, "comments": [{"username": "Helen Newby", "comment_text": "Do you know if the train strike will affect Rome and Florence?"}, {"username": "Hilary Bullard Locklear", "comment_text": "How do you find out about strikes???"}]}, {"id": "2196453267420418", "text": "Watertown, Venice", "link": "facebook.com/groups/1373361046396315/permalink/2196453267420418/", "likes": 43, "comments": []}, {"id": "2196461957419549", "text": "Bologna we loved you just as much second time around ❤. Was the perfect start to our 6 week trip to acclimatise to the heat and settle in after our long trip from Australia. Yes it is hot but if you choose Italy in summer you have to expect this -if you don't tolerate heat well choose another time . . We got going early, had plenty of stops for iced water and of course aperol spritz 🤣 and embraced the Siesta . We still managed 25 to 33000 steps a day as we find walking the best way to discover a city . Last time we were here we did all the touristy things which were fabulous but this time we slowed down and just enjoyed beautuful Bologna .We did do the 6km walk up a hill to Maddona di luca along the world's longest portico and 600 archways .This is not for the faint-hearted we are pretty fit but it was a challenge in the heat (we went early ) .You can get a little train up and back but my partner wouldn't get on it as said it looked like a kids train 🤣 so walk back we did but aperol stops along the way and much easier downhill . Restaurants we didn't need to book but we did as Italians seem to love when you make a reservation. Vicolo Colombina a Michelin restaurant was fabulous and very reasonably priced and La Traviata a family run restaurant had great service,food and wonderful wine list . For cocktails Guero a must tecommended by one of the members of this group ..we would never of found it but so glad we did why this group is so great thanks Scott ....my favourite time of the day was an early walk on my own watching the city wake and all the locals heading off to work and having a cappuccino alongside them ☕ now for our next adventure 9 days in Sardinia can't wait to see if it's as good as we have heard .", "link": "facebook.com/groups/1373361046396315/permalink/2196461957419549/", "likes": 45, "comments": [{"username": "Emma Holmes", "comment_text": "Kevin Holmes"}, {"username": "Greg Kopp", "comment_text": "Six weeks? Interesting. (That's the same amount of time it takes to fly from AUS to the US, as I recall...okay, felt like it.) What's the rest of the itinerary look like?"}, {"username": "Briana McDougall", "comment_text": "Where did you stay in Bologna? We're going in October and I still need to book accommodations."}, {"username": "Daisy Yoo", "comment_text": "Very helpful pointers , I was just wondering how am I going to get there , as when I checked the bus was not easy to get there , I was even consider rent a bike but I would totally do the little kids train up and down"}, {"username": "Simone Pfenninger", "comment_text": "I took the minitrain 🙂"}, {"username": "Nicola Algerino", "comment_text": "Dove andrete in Sardegna?"}, {"username": "Mariposa Mariposa", "comment_text": "How beautiful 🇮🇹🤍"}, {"username": "Scott Perry", "comment_text": "You’re welcome!"}]}, {"id": "2196465094085902", "text": "Today @ Siena. 34 degrees Celsius.☀️😜❤️", "link": "facebook.com/groups/1373361046396315/permalink/2196465094085902/", "likes": 41, "comments": [{"username": "Luigia Gray", "comment_text": "Too hot for me!"}, {"username": "Rose Stolarek", "comment_text": "Beautiful"}, {"username": "Virgz Van Møøre", "comment_text": "Nightmare"}, {"username": "Michael Imbelli", "comment_text": "Temperature calls for another round or two of drinks. 😜"}, {"username": "Simone Pfenninger", "comment_text": "Perfect temperature for me 🙂"}, {"username": "Muhammad Arslan", "comment_text": "keep it up"}, {"username": "Melissa Landriscina", "comment_text": "That is a comfortable temp"}]}, {"id": "2196467437419001", "text": "Are there different prices if you pay cash vs credit card at restaurants?", "link": "facebook.com/groups/1373361046396315/permalink/2196467437419001/", "likes": 11, "comments": [{"username": "Kimberly Borg", "comment_text": "No"}, {"username": "Gillian O'Callaghan", "comment_text": "No...but you may pay some fees using your credit card which are implemented by your provider."}, {"username": "Richard Meek", "comment_text": "Some restaurants are free and very low calorie if you don't have cash, they won't serve you.. :)"}, {"username": "Anthony Sperduti", "comment_text": "No"}, {"username": "Brad Beckett", "comment_text": "No but I recommend keeping at least one menu during your whole experience to prevent the menu pricing swap scam. If they won't let you keep one \"in case you want to order more later\" then that's a good indication to get up and leave."}, {"username": "Ellen Edmonds-Wilson", "comment_text": "No. Why would they?"}, {"username": "Kimberly Lynne", "comment_text": "We were often offered a lower total when we paid in euro. This was in Sorrento and along the Amalfi coast. The amount was small. Similar to the states practice of charging 3% for credit."}, {"username": "Melinda Rose", "comment_text": "For the people mocking you, I understand what you are asking. In the US many small restaurants will charge an extra 3% if you use a credit card. Same with gas stations."}, {"username": "Luca Lookone Ferrentino", "comment_text": "Nope. Actually, according to an european law it is forbidden to apply different prices to different payment methods."}, {"username": "Robert Lawshe", "comment_text": "It is not legal in Italy"}, {"username": "Neville Spargo", "comment_text": "No, same price regardless of payment method"}, {"username": "निनावी सहभागी", "comment_text": "This post is not about discounts. Where I live, at some restaurants, you are charged 3-4 percent extra for using your credit card. If you use cash, you don’t pay that extra fee. For someone who doesn’t want to pay that fee, this is an important question so you can bring enough cash to cover your meals."}, {"username": "Berndt Weihs", "comment_text": "NO!!"}, {"username": "Markie MK", "comment_text": "No, not in restaurants, but there is sometimes a price difference at gas stations in smaller cities. The difference is very small tho."}, {"username": "Katie Kirk", "comment_text": "Yes! BUT it was offered, we didn’t ask, and it only happened at a less touristy location. I wouldn’t expect it anywhere and I certainly wouldn’t ask."}, {"username": "Phyllis Snyder", "comment_text": "Look into cc fees as appose to debt- debt $ comes straight from your checking account- and is easier to be subject to fraudulent charges. Using debt card at atms for cash- cc for changes when shopping."}, {"username": "Wendy Spano Bracco", "comment_text": "I know exactly what OP is asking. OP doesn’t want a 3% fee added onto CC for using a card. OP I have heard people have asked before paying in Italy and then decide if they want to pay cash. We are going next month and will be asking each restaurant. I think those who don’t want or bring cash are getting annoyed by this question lol"}, {"username": "Elena Innocenti", "comment_text": "in Italy is illegal charging credit card fees or have different price."}, {"username": "Marie Cuzzi", "comment_text": "I never encountered that"}, {"username": "Jenny Larsen", "comment_text": "Not in my experience"}, {"username": "Kris Beacham", "comment_text": "No"}, {"username": "Giovanni Pianigiani", "comment_text": "By law there shouldn't. Reality is there might be, mainly because when being paid by cash the business might try not to include the revenue in their tax declaration. Ask for a receipt, if you want to abide by the law (a real one with all the vat details, not just a handwritten note) or, if you want to break the law and save money, ask for a 20% discount minimum (VATin Italy is 22%)"}, {"username": "Maria Coladangelo Ducca", "comment_text": "Yes , smaller towns and places off the tourist places are usually owners operated .Trattorias and salumeria are where locals eat out in the evening . Salumeria has great pannino or just buy any of the sliced lunch meats . Super inexpensive"}, {"username": "Patty Ham", "comment_text": "Not that I have ever seen."}]}, {"id": "2196468917418853", "text": "Need advice - rental car company . Nice to Genoa then other towns . Thank you", "link": "facebook.com/groups/1373361046396315/permalink/2196468917418853/", "likes": 2, "comments": [{"username": "Ettore de Vita", "comment_text": "Every time your cross a European country there is a fee for a drop off , very expensive, you wan to stay within the border then cross it with a train/bus or taxi to the nearest next car rental and go from there"}, {"username": "Bob Lampo", "comment_text": "Euro car seems to do a nice job there. I used Hertz on my trip and they worked well. EuroCar seemed to have more outlets and I know many who were pleased with it."}, {"username": "Linda Snaring", "comment_text": "Sixt car rental. When we wanted to leave Italy and go to France. We drove to the nearest town with an airport. It was a smaller airport. Returned the car and got on a cheap flight to the next town in France where our next rental car was. The flight was very reasonable. But their carry on measurements can sometimes be a little bit smaller than a major airlines. ￼Have fun."}, {"username": "Steve Grossman", "comment_text": "Take the train you won't have any drop off fees"}]}, {"id": "2196472180751860", "text": "Hi any recommendations for a short trip to perugia😊", "link": "facebook.com/groups/1373361046396315/permalink/2196472180751860/", "likes": 2, "comments": [{"username": "Ettore de Vita", "comment_text": "It should be no short trip to Perugia , Perugia is beautiful, stay awhile"}, {"username": "Scott Perry", "comment_text": "Cocktails at Dempsey’s"}, {"username": "Scott Perry", "comment_text": "And Tortas at Testone"}]}, {"id": "2196469630752115", "text": "Hey all. We are in Florence and We have a couple of hours one morning and a couple of hours one evening free - we would like to take the train to pisa. Wondering if we should do morning or evening ? Thanks so much!!!", "link": "facebook.com/groups/1373361046396315/permalink/2196469630752115/", "likes": 2, "comments": [{"username": "Claudia Amp", "comment_text": "Do morning and enjoy Florence in the evening"}, {"username": "Colleen Jennings", "comment_text": "The train to Florence takes an hour so you’ll spend your couple of hours on the train. Not much to see in Pisa apart from the tower so if you want some time away from Florence go to Fiesole - doable on a bus."}]}, {"id": "2213253022407109", "text": "", "link": "facebook.com/groups/1373361046396315/permalink/2213253022407109/", "likes": 9, "comments": []}, {"id": "2196469917418753", "text": "In Florence now and looking for some authentic things to bring back as souvenirs. Is there anywheres that would have a nice coffee mug, not the gift shop/tourist type? What other sort of souvenirs are authentic to Florence as well as Venice? Thanks in advance 🙂", "link": "facebook.com/groups/1373361046396315/permalink/2196469917418753/", "likes": 26, "comments": [{"username": "Susan Brooks", "comment_text": "Look for the wooden salad servers with the ceramic tops. I have one at home and I’m sorry I didn’t buy some as gifts."}, {"username": "Alice LeCount", "comment_text": "Mugs are typical American souvenirs but Italians don’t drink coffee from mugs. Look for demitasse cups and saucers or the larger cappuccino type of cups and saucers. I have been known to buy such things with a logo at the actual Cafe’ that I’m visiting, just by asking. Otherwise the efficient little hardware style shops on every other corner where locals frequent have a variety of these same cups. But mugs? Never."}, {"username": "Laurel Finlinson", "comment_text": "I bought a small original watercolor painting of the city. Easy to pack and travel with. Framed it for my home when I returned."}, {"username": "Sharon Jones", "comment_text": "I bought a painting from a street artist. And the cashmere scarf that saved me from freezing in May"}, {"username": "Anita Grzeszkiewicz", "comment_text": "In Venice my parents brought meback a beautiful Murano necklace and earrings and a beautiful large carinval mask and some mini ones"}, {"username": "Marianne Hendriks", "comment_text": "Try Dini caffè. Www.dinicaffe.i\nt. No mugs, but cappuccino or espresso tazzini (cups). Worth the walk. Would call them first. And great coffee!!"}, {"username": "Jody Holwadel Thomas", "comment_text": "I love this post! Can’t wait to do some shopping in a few weeks! 🥰😜"}, {"username": "Kim Comerford", "comment_text": "Christmas Decorations"}, {"username": "Brenda Harris Dixon", "comment_text": "Lauren Nicole Dixon good ideas!"}, {"username": "Patti Berger", "comment_text": "I found some nice things in the gift shops of the Uffizi and Academia museums."}, {"username": "Fiorenza Bruni", "comment_text": "We also bought spices (garlic/chile blend) and olive oil soaps and similar products to bring back, purchased at the local Co-op in Santa Maria (Empoli). I love buying Italian scarves and shawls at the outdoor market stalls. Easy to pack. Check out the historic pharmacy near Santa Maria Novella for handmade toiletries."}, {"username": "MaryAlice Stickney Bell", "comment_text": "I have not been there since 15 years ago but I bought the most gorgeous linen hand towels and table cloths and some cool ceramics."}, {"username": "Fiorenza Bruni", "comment_text": "Tiny micro mosaic pill boxes, earrings and necklaces. Little bottles of limoncello (I saw them near the Leaning Tower at outdoor stalls in Pisa). Hand embroidered tea towels and beautiful linens."}, {"username": "Raina Brown McKinnon", "comment_text": "Leather!!! I may have bought as many bags/purses/\nwallets as there are days of the week 😬"}, {"username": "Raina Brown McKinnon", "comment_text": "Marvis Toothpaste!"}, {"username": "Maureen McCall Bradley", "comment_text": "Go to Terra at Via De' Ginori 47r Firenze\nThe artist makes everything out of Tuscan soil. Something completely different!!"}, {"username": "Maureen McCall Bradley", "comment_text": "Go to Medici Chapel and then go to Mosaici di Lastrucci to see these beautiful mosaics continue to be made. It’s a one of a kind purchase as well."}, {"username": "Melanie Sartuche", "comment_text": "In Venice, I bought masks. There's only 3 authentic mask makers in Venice that make the paper mache masks used during Mardi Gras. I don't remember what the place was called, but it was a small shop loaded with tons of masks, and a little old Italian man who didn't speak English. It was in the St Mark's area\nI bought 6 beautiful large feathered venetian masks and one small one, and had them shipped home in the US for $450. Mines on the wall next to my bed, I love it"}, {"username": "Miyuki Kanno Paul", "comment_text": "Buy ceramics from this place!"}, {"username": "Barbara McMahon", "comment_text": "I bought a beautiful leather purse there and olive oil soap"}, {"username": "Debora A. Diaz", "comment_text": "For small gifts: leather bracelets, coin purses and key chains."}, {"username": "Debora A. Diaz", "comment_text": "Gold at The Gold Market!"}, {"username": "Rita McClurken Child", "comment_text": "Following, so many great ideas"}, {"username": "Roula Abaci", "comment_text": "I love the glass mosaic jewelry there is one place that has a pretty large selection it’s called Domo I wish i remembered the address"}, {"username": "Kelly Tabor", "comment_text": "The leather market in Florence has many lovely and easy to pack pieces."}, {"username": "Eva Salas", "comment_text": "Leather"}, {"username": "Tiffany Turner", "comment_text": "We got some olive wood cutting board or utensils in Florence and good prices on leather stuff at outdoor markets. In Venice got some nice glass souvenirs like a gondola that was unique.bought at glass shop on Rialto bridge."}, {"username": "Darlene Wilson Somers", "comment_text": "In the leather market (by the famous boar), there is at least one stall with large fringed shawls. They are a kind of lighter fleece material, but super warm and durable. I've had mine for 7 or 8 years and love it."}, {"username": "Ijeoma Mary Nweke-Ukor", "comment_text": "Get some authentic leather purse , belt , wallet etc from leather school it’s directly behind Santa Croce and get it engraved for free while you wait . They have everything from not too expensive to very expensive. Have fun with the weather we were in Florence 3 days ago the heat was crazy hot 🥵"}, {"username": "Anwen Ingram", "comment_text": "Leather in florence"}, {"username": "Claudia Amp", "comment_text": "Officina Farmaceutica Santa Maria Novella products (beautiful packaging, very elegant), AquaFlor (in Santa Croce) soaps, Erbario Toscano toiletries; try going to local small “bottegas” or “enoteca” for original items."}, {"username": "Claudia Amp", "comment_text": "https://\nwww.aquaflor.it/"}, {"username": "Claudia Amp", "comment_text": "https://\neu.smnovella.com\n/it"}, {"username": "TA Crossman", "comment_text": "We cherish a watercolor hand painted print of the Duomo. Bought it on street."}, {"username": "Claudia Amp", "comment_text": "This too https://\ndrvranjes.it/it/\n?gclid=EAIaIQobC\nhMIuozenqudgAMV\nVwMGAB04XAdmEAA\nYASAAEgImcvD_Bw\nE"}, {"username": "Claudia Amp", "comment_text": "You can also get ceramics (made in Montelupo Fiorentino and found at Ceramiche Ricceri close to the Duomo in Firenze) or you can also get little gold renaissance style jewels in Oltrarno in places like Alessandro Dari or just check on Ponte Vecchio and Palazzo Pitti gift shop."}, {"username": "Lynn Crane", "comment_text": "Silk scarves. Find a reputable jeweler(not on the Ponte de Vecchio) and get something gold. Leather from the leather school."}, {"username": "Jenny Payne", "comment_text": "Try the department store Rinascente"}, {"username": "Jenny McDannell", "comment_text": "Not fancy - but pistachio cream - we just bought it from the grocery store"}, {"username": "Farheen Rahman", "comment_text": "I got beautiful hand painted wooden trays! I got them 10 years ago and still use them. 🥰"}, {"username": "Cheri Arrowood-Stanziano", "comment_text": "I bought an LV purse and saved quite a bit\nLeather goods and pottery, wine, olive oil.\nIf you make a large purchase at one shop, you can claim VAT tax at airport but you will need your passport\nIt’s quite easy to do at FCo"}, {"username": "Mo Dee", "comment_text": "I don’t know about mugs but, I loved the items in a store called il Papiro.\n\nSo many items handmade."}, {"username": "Mia Catalano", "comment_text": "The leather markets have lots!"}, {"username": "Kathy Kibbe", "comment_text": "There are some great shops in the Oltrarno area - especially across from the Pitti Palace - very unique items"}, {"username": "Stacy Derouin", "comment_text": "We got handmade paper (stationary)and\nsoaps..."}, {"username": "Blanca Gil", "comment_text": "Leather goods can be found in Florence. Keychains, wallets, belts and purses at Infinity Firenze on Borgo Santi Apostoli."}, {"username": "Claudia Codega", "comment_text": "Leather bag or wallet"}, {"username": "Ellen Edmonds-Wilson", "comment_text": "Nothing from the Ponte Vecchio or the tat shops. Paper products, journals, handmade jewellery, leather from Italy not China, masks from an artisanal designer that cost more than €20. Biscuits from Burano. Glassware. A gorgeous dish painted with fruit or vegetables. There are plenty of beautiful and authentic shops to buy from, but they’re not in St Mark’s Square in Venice or by the Duomo in Florence. Brass statues of the lion of Venice made in Venice since 1900 mark a great souvenir. Perfume. Shop around and don’t buy junk."}, {"username": "Kristen Blue", "comment_text": "We bought artwork in Venice from an artist and then in Florence, a hand painted olive oil bottle at a pottery shop just on the other side of Ponte Vecchio - shop owner was so kind and wonderful to talk with. I also bought a small leather purse."}, {"username": "Kelly Ladwig", "comment_text": "Street art!"}, {"username": "Paula Brink", "comment_text": "Beautiful leather gloves from Madova- as you exit the Ponte Vecchio on the Oltrarno side. They have every colour you could imagine and great quality.\nAlso in Oltrarno there are many artisan shops where you will find beautiful things, not the typical tourist junk. Especially near the Palazzo Pitti.\nIn Venice make sure any glass you buy is actually made there- lots of cheap made in China stuff. Buy on Murano if possible. There are a couple of small boutiquey glass shops there."}, {"username": "Caroline Kern-Templeton", "comment_text": "Murano glass… I bought back jewelry gifts and everyone loved them.\nBought myself some too 😊"}, {"username": "Millicent Collins", "comment_text": "Saw some lovely wall clocks in a little place but would not be able to tell you directions. They were lovely and wishes now I had one"}, {"username": "Susan Eby", "comment_text": "I bought a cd from a group of street musicians in Florence, not knowing if it would work at home, but it did! Beautiful! It brought back the \"feel\" of Florence every time I listened to the beautiful music."}, {"username": "AgAnne Chrzanowska", "comment_text": "In via dei Gucciardini, if you keep walking straight from Ponte Vecchio towards the Pitti Palace, on the right, before the Pitti Palace there is a shop D.Vers@ with products of local artisans. Similar is Florence Factory at the end of Via dei Neri, on the left, walking from Piazza della Signoria."}, {"username": "Desiree Dube", "comment_text": "I’d recommend skipping the leather market and heading straight for the leather school! It’s accessible for all price ranges and they will engrave your initials for free! Other than that, Pinocchio is huge in Florence! Going towards the Pitti Palace from Ponte Vecchio, you’ll come across the Pinocchio Store on the right side of the road. Florence also has several Il Papiro shops with handmade stationary and other items with the marbled paper design."}, {"username": "Pamela Heldenbrand", "comment_text": "Leather bookmarks from the Leather School."}, {"username": "Marisa Brombal D'Emilio", "comment_text": "The best gift I ever bought in Florence were beautiful coin purses made of paper."}]}, {"id": "2196474300751648", "text": "We are going to Milan in October and plan to take a day trip to Varenna. Thanks to all the recommendations here we see we can easily get a train there and back. Hoping I can get a few things cleared up:\n\n1. Isआणखी it possible to get round trip train tickets? And is that best going to and from Varenna? Can we get these at the station the morning of (round trip ticket specifically)? Then I assume we would validate easy way before getting on.\n\n2. If not getting round trip tickets, is it easy to get the return ticket in Varenna? Seems like there is not a ticket booth or ticket machine there? Maybe I’m wrong\n\n3. Is it easy to get on the right train coming back from Varenna? For some reason I’m nervous we could accidentally hop on the wrong one, how do you know which train to get on?\n\nThanks for any help and patience with my questions. Silly questions but couldn’t find answers to these from searching.\n\nPhoto so maybe people will see my post", "link": "facebook.com/groups/1373361046396315/permalink/2196474300751648/", "likes": 4, "comments": [{"username": "Rose Stolarek", "comment_text": "You will not hop on the wrong train back to Milan . Varenna is a small station . We spent 5 days there and loved exploring Lake Como from Varennna.We bought tickets online ."}, {"username": "निनावी सहभागी", "comment_text": "I was hoping to get more responses. It’s frustrating that other posts get so much more traffic. Maybe I should’ve asked about travel insurance. Seems to get more reactions. Maybe this will bump the post. Appreciate any more advice"}]}, {"id": "2196450947420650", "text": "We are heading to Rome/Venice/Florence March 7-20, 2024.\nI have seen thousands of pictures taken during the summer. ￼ I’d be interested to see what it looks like in March. Could you please photo dump pictures from ear￼ly March?\nI want to see clothes, sky, and landscape.", "link": "facebook.com/groups/1373361046396315/permalink/2196450947420650/", "likes": 7, "comments": [{"username": "Claudia Amp", "comment_text": "March is usually chilly and often rainy in Italy. Not too cold but not full blown spring either. We normally wear light jackets, trench coats during the day and in the evenings we wear heavier jackets; scarves are always worn."}, {"username": "Claudia Amp", "comment_text": "Maybe try googling Italy in March so you can get statistics cause based on where you are In Italy, weather can be quiet different."}, {"username": "Cecilia Christine Costantini", "comment_text": "Late March/early April 2023 were particularly cold/rainy. I had to wear a thicker jacket. I hadn't brought one, but my mom (who lives in Rome) bought me one as a present (at a streetmarket, 25 euros). It got warmer around April 15th and I was only wearing a t-shirt, hoodie and thin jacket. But it varies a lot, depending on the year, so better check when your trip is approaching. I will upload some pictures in the following comments."}, {"username": "Cecilia Christine Costantini", "comment_text": "Cecilia Christine Costantini"}, {"username": "Cecilia Christine Costantini", "comment_text": "Cecilia Christine Costantini"}, {"username": "Cecilia Christine Costantini", "comment_text": "Cecilia Christine Costantini"}, {"username": "Cecilia Christine Costantini", "comment_text": "("}, {"username": "Cecilia Christine Costantini", "comment_text": "Cecilia Christine Costantini"}, {"username": "Cecilia Christine Costantini", "comment_text": "This is the thick jacket I was wearing"}, {"username": "Liz Russo", "comment_text": "I went to Venice in late March 22 and had absolutely beautiful, unseasonably warm weather. No rain at all, I wore short sleeves all day, and i would eat at night outside with a light jacket. I took a chance going in March and for me to was worth it. It was absolutely perfect weather. Perfect temperature to travel and walk around and site see."}, {"username": "Lin Da", "comment_text": "We are thinking of March 15-29, 2024. From what I read 2022 was great, and 2023 had lots of rain."}, {"username": "Alice Francesca", "comment_text": "It varies A LOT.you could get an early spring type of weather or late winter one.Check the weather just before leaving on meteo.it"}, {"username": "Phyllis Snyder", "comment_text": "Jackets boots and umbrellas ☔️."}]}, {"id": "2196451727420572", "text": "Hi everyone, just asking does anyone have any recommendations for accommodation in Sorrento that would be wheelchair friendly thanks, asking for a friend, appartments or Hotel thanks in advance 🙂", "link": "facebook.com/groups/1373361046396315/permalink/2196451727420572/", "likes": 4, "comments": [{"username": "Jeff McLellan", "comment_text": "Older apartments likely will not be an option. Ours had a few steps into and the elevator was tiny and likely wouldn’t fit a wheelchair. Might be safest to stick with hotels or any newer buildings."}, {"username": "Stacy Derouin", "comment_text": "As a wheelchair user, I would stick with hotels. They're much more likely to have elevators."}, {"username": "Donna Russonello Merlino", "comment_text": "Hotel Plaza Sorrento"}]}, {"id": "2196346864097725", "text": "Coming to Europe for the 1st time with my 7 year old daughter (single mum) and thinking to include Italy into my trip. I will have 5 nights available to spend in Italy. But where in Italy is my question?\nWas thinking amalfi coast? We love beaches, pools nice views, food? Please tell me what you think? I have no idea what I’m in for 🤷‍♀️", "link": "facebook.com/groups/1373361046396315/permalink/2196346864097725/", "likes": 3, "comments": [{"username": "Claudia Amp", "comment_text": "You can get all that in most parts of Italy. Try Tuscany, it has all that; long coastline, beautiful cities and towns, great countryside and nature, majestic villas with pools, great food and the region is well connected with trains and has two major airports (Pisa and Firenze)."}, {"username": "Hen Garrett", "comment_text": "Tuscany is a runner but also Portofino area or Lake Como or Lake Garda. Other option is Venetian coastline where you can combine a beach holiday with visiting Venice and Verona."}]}, {"id": "2196211217444623", "text": "Has anyone taking the bus from Naples to Pompeii. I have seen a lot about taking the circumvesuvian train but I am having a harder time getting bus info. From what I understand there is a bus that is close to the cruise port (where we will be starting from) that goes to Pompeii. I can't find any youtube videos about taking the bus and am having a hard time figuring out ticket prices. Any insights? I believe the bus line that has the 8am bus is SITA Sud.", "link": "facebook.com/groups/1373361046396315/permalink/2196211217444623/", "likes": 2, "comments": [{"username": "Jenn Messina Babore", "comment_text": "https://\nglobal.flixbus.c\nom/bus-routes/\nbus-naples-pompe\nii"}, {"username": "Shirley Lewis", "comment_text": "you've probably read that IF you take the circumvisuviana\nbe VERY aware of pick pockets in the station before boarding as well as on board tho the train can be fun and is certainly an adventure back in time 🙂"}, {"username": "Elizabeth May La Duca", "comment_text": "Google Maps/directions"}, {"username": "Jeff McLellan", "comment_text": "Having taken the Campania Express from Naples to Sorrento I strongly recommend booking a car service. It was awful and I can’t imagine the circumvesuvian we had return tickets and have opted to book a van back to Naples tonight."}, {"username": "Allan Olexa", "comment_text": "Try using the Citymapper app."}, {"username": "Samantha May", "comment_text": "we wanted over an hour for that bus a few years ago , in the end got another bus ro train station and went by train!!"}, {"username": "Angela Gilmore", "comment_text": "This is SITA bus. If you want explanation about this pic, write me :)"}, {"username": "Kay Jenkins", "comment_text": "Have you asked the cruise company for advice?"}, {"username": "Marie Butler", "comment_text": "Chloe Butler these comments are concerning - buses and trains aren’t reliable"}, {"username": "Katerina Giannopoulou", "comment_text": "Δέσποινα Παππά"}]}, {"id": "2196346920764386", "text": "The Italian oven, 104 F live from Polignano a Mare", "link": "facebook.com/groups/1373361046396315/permalink/2196346920764386/", "likes": 1934, "comments": [{"username": "Eva Sanchez Gonzalez", "comment_text": "Juan Jose Sanchez Gonzalez"}, {"username": "Nicole Jovanovski", "comment_text": "I was there last week, it was so hot and so overcrowded!"}, {"username": "Cee Dopetastic", "comment_text": "So, that beach is basically like a bowl of human soup."}, {"username": "Gabriella Pálmai", "comment_text": "Three weeks ago🇮🇹🫒🛵🍕🍋❤️"}, {"username": "Milena Burzanovic", "comment_text": "😍😍😍😍😍"}, {"username": "Adrian Popescu", "comment_text": "Nice place."}, {"username": "Diana Kirkova", "comment_text": "Diana Kirkova"}, {"username": "אתי אבו", "comment_text": "צולם מלמעלה מעל הגשר"}, {"username": "Janina Łakomska", "comment_text": "Perspektywa z dołu również piękna 🤩"}, {"username": "Sandra DiCamillo", "comment_text": "Last week in Poglinano a Mare. Alberobello and Matera afterwards, 43 deg, Italian oven alright!! 🥵"}, {"username": "Katalin Grozne Vegh", "comment_text": "Katalin Grozne Vegh"}, {"username": "Györgyi Pozsgainé Tamás", "comment_text": "(2022.06.❤️😍🍀✈️🌹)"}, {"username": "Klára Szilágyi", "comment_text": "2023.06.29 🌞❤️🥰"}, {"username": "Elizabeth Manuel", "comment_text": "Roasting for another week in this heatwave. Then temperatures return to normal for Summer low 30s which is lovely. wwwmasseria2tor\nri.com"}, {"username": "Keta Asatiani", "comment_text": "Fav place ✨"}, {"username": "Renata Margjoni", "comment_text": "Giugno 2023"}, {"username": "Christene Squires", "comment_text": "March 2022, had it all to myself. 😊"}, {"username": "Regina Silva", "comment_text": "Estive em Polignano a Mare há 15 dias, essa praia é um colírio para os olhos! Julho/2023"}, {"username": "Dawid Tekieli", "comment_text": "Dawid Tekieli"}, {"username": "Dawid Tekieli", "comment_text": "Dawid Tekieli"}, {"username": "Henry Fortunatow", "comment_text": "Wow"}, {"username": "Agnieszka Rybacka", "comment_text": "June 2023🥰"}, {"username": "Agnieszka Rybacka", "comment_text": "Czerwiec 2023 🥰"}, {"username": "Jani Plasz", "comment_text": "J'adore"}, {"username": "Cathy Heikkinen Vogt", "comment_text": "Stuart Vogt 🥵"}, {"username": "Renata Rogowska", "comment_text": "Czerwiec 2023 👍😊"}, {"username": "Renata Maulyte-Radiniene", "comment_text": "Labai gražus miestas❤️❤️"}, {"username": "Adrianna Baran", "comment_text": "Adrianna Baran"}, {"username": "Veronika Szatmáriné Zátrok", "comment_text": "Veronika Szatmáriné Zátrok"}, {"username": "Assen Nikolov", "comment_text": "Love this place, been there"}, {"username": "Gill Parkin", "comment_text": "Send some sun to GB it's not stopped raining for days!"}, {"username": "Simone Brown", "comment_text": "May 2023 a little less crowded 😉"}, {"username": "Nick Folkes", "comment_text": "40°C for the rest of the world 👍🏻🤌🏻"}, {"username": "Frances McDonagh", "comment_text": "Better than Ireland pouring here"}, {"username": "Roxanne Patti", "comment_text": "Our heat index for today in S. Louisiana in 111.😩 I’ll be staying inside with the A/C on. Wish I had that beautiful water to swim!"}, {"username": "Eddie Donoghue", "comment_text": "Andrea McGrath"}, {"username": "Virgz Van Møøre", "comment_text": "Horror movie"}, {"username": "Jackie Linenthal Tambone", "comment_text": "I'm in Phoenix. I think today will be the 20th day in a row of temps 110 or over. No end in sight. It was 117 yesterday."}, {"username": "Perla Ivonne Vargas Miranda", "comment_text": "No importa que esté ardiendo bellísimo lugar … si vuelvo"}, {"username": "Perla Ivonne Vargas Miranda", "comment_text": "Ya estoy acostumbrada.. aquí en mi bello mexicali bc. Mexico a 55 grados no pasa nada"}, {"username": "Marcus Hiesler", "comment_text": "Sharon Hiesler"}, {"username": "Sigrid Picken", "comment_text": "Come to Australia. Perfect Winters day on the Gold Coast. Not a cloud in the sky and 23deg Celsius."}, {"username": "Ricky Ellis", "comment_text": "This is why I only go in spring or fall"}, {"username": "Thomas Tomlins", "comment_text": "Perfect temp 😎"}, {"username": "Sofia Popo", "comment_text": "❤️"}, {"username": "Corinne Joly", "comment_text": "Si on enlève les gens....superbe\nendroit"}, {"username": "Marcha van den Eeden-Jansen", "comment_text": "Els Jansen-Blokhuis"}, {"username": "Marcha van den Eeden-Jansen", "comment_text": "Els Jansen-Blokhuis"}, {"username": "JoLynn Waters", "comment_text": "Yes, we are here now too. Wish it would at least cool off at night. Take a boat ride and swim in the sea"}, {"username": "Makrai Andi", "comment_text": "Szép hely 😊"}, {"username": "Paweł Falkowski", "comment_text": "Three weeks ago 👌🇮🇹🇵🇱"}, {"username": "Katherine Wright", "comment_text": "Rhonda Legge...looks like paradise....so excited!!"}, {"username": "Dache Marrone", "comment_text": "Sabrina Morse"}, {"username": "Kim Radke", "comment_text": "Geoff Radke"}, {"username": "Dariusz Fiszer", "comment_text": "W maju 2022 nie było tak gorąco :)"}, {"username": "Danielius Paulauskas", "comment_text": "Danielius Paulauskas"}, {"username": "Kinga Ilyés", "comment_text": "Polignano 2023 May 🥰"}, {"username": "Scott McGlinchey", "comment_text": "Yes, it ain't half hot!"}, {"username": "Cody Johnson", "comment_text": "I believe that’s more like Herculaneum 79AD 🥵🔥🤯☠️"}]}, {"id": "2196347937430951", "text": "Should I visit Ischia and Procida islands?", "link": "facebook.com/groups/1373361046396315/permalink/2196347937430951/", "likes": 2, "comments": [{"username": "Peter Tsouroulla", "comment_text": "Yes ! Ischia is amazing"}, {"username": "Claudia Amp", "comment_text": "If you can yes; Procida I prefer to Capri, for example (Capri aside from the beautiful landscape, the center “piazzetta” and surrounding areas are so commercial to me whereas Procida is more a fishermen’s island)"}, {"username": "Mike Ball", "comment_text": "Definitely. Sadly our trip to Procida was cancelled but we had a lovely week on Ischia, plenty to see and do ."}, {"username": "Maria Ek", "comment_text": "Me and my husband is in ischia right now for the 7th time and we love this island 😍🇮🇹"}, {"username": "Debbie Davidson Cvijanovich", "comment_text": "We’re going in October. I keep adding more days there and taking away from Amalfi Coast. It looks heavenly! Less crowded, less expensive and has hot spring water!"}, {"username": "Vincenzo D'Angelillo", "comment_text": "Yes"}, {"username": "Miyuki Kanno Paul", "comment_text": "Both islands are beautiful. We were on Ischia and took a ferry to Procida for lunch back in May"}]}]